{
  "id": "1hvxl8s",
  "title": "Weird but Surprisingly Effective Ways to Reduce Anxiety",
  "selftext": "Hey everyone,\n\nI've been exploring unusual ways to deal with anxiety, and I thought I'd share a list of weird strategies that have worked for me. Like probably everyone else here I have tried a ton of different traditional methods to relieve anxiety such as breathing exercises, meditation, journaling, therapy, working out etc and while those are amazing methods that work for some, sometimes nothing seems to help in the moment. So I started experimenting and came up with some unconventional tricks (and some I’ve picked up from others) that work surprisingly well for me!\n\nI have separated methods into different categories so you can browse each category depending on what works for you!\n\n**Body Oriented:**\n\n* **Turn Your Room Cold** \\- Turn the heat down or open a window. A colder space can sometimes help your body calm down.\n* **Chug a Bottle of Water** \\- It’s refreshing and forces you to pause for a second. Bonus: dehydration can make anxiety worse, so this helps on two levels.\n* **Lay on Your Other Side (Away From Your Heart)** \\- If you’re lying on your left side and can feel your heartbeat too strongly, flip over. It can stop you from hyper-focusing on it.\n* **Dunk Your Face in Ice Water/Take a Cold Shower** \\- This one feels extreme but it really works. It triggers your \"dive reflex,\" which slows your heart rate and calms your nervous system.\n* **Hold Ice Cubes or Something Cold** \\- The cold sensation brings you back into your body and out of your head.\n* **Sit on the Floor** \\- Just plop down wherever you are. Sitting on the ground can make you feel more grounded.\n\n**Mind Tricking:**\n\n* **Spell Words Backward** \\- Pick a random word (like elephant for example) and spell it in reverse. Keep repeating with different words until you are distracting enough to break the cycle of anxious thoughts.\n* **Count Things Around You** \\- Look around the room and count how many blue objects you can see or how many things are round.\n* **Force Yourself to Smile** \\- Even fake smiling can trigger endorphin release and convince your brain you’re okay.\n* **Do Some Math** \\- Start at 100 and count backward by 7s. Or do a Times table.\n\n**Behavorial:**\n\n* **Flip Your Environment Around** \\- Rearrange your furniture, your desk, or even just your pillows. Cleaning up your space can shift your mindset too.\n* **Play The Floor Is Lava** \\- Lol like the game you played as a kid. Jumping around the room is a great distraction.\n* **Eat Some Crunchy or Sour Snacks** \\- The texture, taste and sound give your mind something else to focus on.\n* **Wrap Yourself With Blankets** \\- Weighted blankets are ideal, but even regular ones can work.\n* **Gratitude** \\- Think about everything you are grateful for. This can help take your mind off of insecurities you are thinking about.\n\n**Environmental:**\n\n* **Turn on White Noise or Static** \\- The background hum of white noise can calm your brain if silence feels too loud. However, this one sometimes leads to hyperfocusing on intrusive thoughts, dissociation or depersonalization for me, so proceed with caution.\n* **Dim the Lights or Change the Color** \\- Swap your lighting for something softer or cooler (like blue or green tones).\n* **Smell Something Really Strong** \\- Smell something like peppermint, citrus, or even vinegar because a strong scent can \"shock\" your senses and pull you out of your anxious headspace.\n\n**Interactive:**\n\n* **Carry Something Heavy** \\- Holding something with weight can help ground you.\n* **Balance on One Leg** \\- It sounds weird, but focusing on balancing can help distract you.\n* **Scribble** \\- Grab a pen and just scribble as hard and fast as you can. Helps release energy, is super calming, and can help distract you\n* **Stare at Something Moving** \\- Watch a fan, a candle flame, bobblehead, the snow falling outside, etc. It gives your mind something repetitive and calming to focus on. However, this one also sometimes leads to hyperfocusing on intrusive thoughts, dissociation or depersonalization for me, so again, proceed with caution.\n\nSome of these sound ridiculous, but they’ve actually helped me, and I hope they can help you too!!!",
  "created_utc": 1736272992.0,
  "score": 1672,
  "num_comments": 110,
  "url": "https://www.reddit.com/r/Anxiety/comments/1hvxl8s/weird_but_surprisingly_effective_ways_to_reduce/",
  "comments": [
    {
      "id": "m5x5ldb",
      "body": "The dehydration thing was huge for me. I didnt realize it at all for awhile and now I try get my gallon of water in every day.\n\nI also notice my face and ears get hot when my anxiety is high so I stand in front of a fan or ac vent for 10 minutes.\n\nI just read about eating a really sour candy when an attack sets in that helps redirect your brain. I ordered some to see if this works. 🙂",
      "created_utc": 1736277676.0,
      "score": 230
    },
    {
      "id": "m5ys302",
      "body": "for me its:\n\n1. Get busy.  I can be having a panic attack at work, but if shit hits the fan, suddenly I have other shit to do. \n\n2. A panic attack has never made me pass out, killled me, or anything of the sort. This has gotten me through life so far.  This to this day remains true.  If I were to ever pass out or anything similar, than all of this would go out the window.  But having that undefeated status has really helped so far.",
      "created_utc": 1736295267.0,
      "score": 104
    },
    {
      "id": "m5xm7rd",
      "body": "The cold factor with either drinking water, making the room colder, or dunking your face has helped me tremendously. It works fast too! I'll give the rest of these a try. Thank you! 😊",
      "created_utc": 1736282493.0,
      "score": 51
    },
    {
      "id": "m5xzjri",
      "body": "I have heat anxiety so cold room, holding ice etc is HUGE for me. I live in AZ so it's a big struggle.",
      "created_utc": 1736286303.0,
      "score": 31
    },
    {
      "id": "m5xfqd8",
      "body": "Love this! Hope we all can move forward and get better ♥️",
      "created_utc": 1736280617.0,
      "score": 20
    },
    {
      "id": "m5yufrc",
      "body": "Singing sometimes helps. I’m terrible at, but it allows me to focus my breath.",
      "created_utc": 1736296034.0,
      "score": 19
    },
    {
      "id": "m5zdas0",
      "body": "These are absolutely wonderful. Thank you for taking the time to do this! ❤️ \n\nCold water on my face, box breathing, moving, running or some form of exercise to get some energy out of my fried nervous system seem to help me the most. Sometimes drawing or painting is also meditative. I also definitely agree with dehydration. It increases my helath-anxiety because I feel dizzy, tired, crampy...etc. \n\nI tend to hum a lot to self-sooth and it can stimulate the Vagal nerve which is supposed to help reduce anxiety. I use a sun lamp with a vibrating platform it also helps shake out nerves a bit. \n\n\nOne of the oddest ones I've found:\n\n I have also found wasabi peas to be a strange bit effective distractor like sour candy. I read a study about how the unique voliltile compounds in wasabi/horseradish cause a \"pain\" response in the brain which in turn releases oxytocin (the feel-good chemical) to combat the burn. Made me wonder if it's why I'm so addicted to wasabi/horseradish because it actually does make me feel a little better!",
      "created_utc": 1736302354.0,
      "score": 17
    },
    {
      "id": "m5yuitl",
      "body": "I love this subreddit! I just found it and it’s been life changing. Thank you so much for putting this list together, friend 💕",
      "created_utc": 1736296061.0,
      "score": 10
    },
    {
      "id": "m5yoh8q",
      "body": "I absolutely love those tricks. Thanks for sharing.",
      "created_utc": 1736294076.0,
      "score": 6
    },
    {
      "id": "m5zfqdj",
      "body": "The cool air flow definitely helps me a lot!! I can’t be in a hot room with no air flow or wear tight clothes or clothes that cover up my neck.\nI always need to be where there is cool/cold air flowing.",
      "created_utc": 1736303211.0,
      "score": 7
    },
    {
      "id": "m5yqcvs",
      "body": "Thank you for sharing this ❤️\n\nMy favorite is \"turn your room cold\" and \"sit on the floor\"",
      "created_utc": 1736294694.0,
      "score": 6
    },
    {
      "id": "m5zo5fi",
      "body": "Try using non-dominant hand to do tasks..brush teeth…draw…\nForces the focus.",
      "created_utc": 1736306167.0,
      "score": 6
    },
    {
      "id": "m5yulw9",
      "body": "This is so helpful… I am going to try the spelling words backwards and counting and stuff on a flight I have Friday",
      "created_utc": 1736296089.0,
      "score": 5
    },
    {
      "id": "m5zs20k",
      "body": "I've been doing the turn your room cold thing for years! I just kind of discovered it on my own. I saw it was the first thing listed and I perked up like I've finally found others who get it. \n\nThat one works the best for me. I also add in a wet, cold washcloth that I rotate spots with - my forehead, chest, back of neck, even my stomach sometimes. I have a fan blasting as high as it goes, and am often stripped down to only my bra and underwear. \n\nI have several friends who experience anxiety/panic attacks. Most look kind of confused when I describe what helps me. I started having attacks almost 20 years ago. \n\nI've also done the forced smiling and counting or tapping. I'll need to keep some of these other things under my hat for times when I can't strip down and blast a fan!",
      "created_utc": 1736307621.0,
      "score": 5
    },
    {
      "id": "m5xxvgj",
      "body": "This is wonderful! Thank you for posting!!! ❤️",
      "created_utc": 1736285818.0,
      "score": 4
    },
    {
      "id": "m5yu1ve",
      "body": "Summary: distract yourself from the anxiety",
      "created_utc": 1736295909.0,
      "score": 12
    },
    {
      "id": "m5yozwt",
      "body": "The carrying something is something that i do to carry weight.  Having something tangible",
      "created_utc": 1736294247.0,
      "score": 3
    },
    {
      "id": "m5z7b3r",
      "body": "A weird one for me is to over exaggerate enunciating the vowels. I don’t know why but sometimes it just works.",
      "created_utc": 1736300299.0,
      "score": 3
    },
    {
      "id": "m5zfx2y",
      "body": "Love this. Feels like advice I got in DBT",
      "created_utc": 1736303276.0,
      "score": 3
    },
    {
      "id": "m5xradi",
      "body": "thanks!",
      "created_utc": 1736283930.0,
      "score": 2
    },
    {
      "id": "m5yw171",
      "body": "Thank you for sharing this ❤️‍🩹",
      "created_utc": 1736296552.0,
      "score": 2
    },
    {
      "id": "m5zfye1",
      "body": "Excellent advice ",
      "created_utc": 1736303288.0,
      "score": 2
    },
    {
      "id": "m5zjcaq",
      "body": "Laying down on the floor has always been so random but effective for me. Especially if it’s nice cool hardwood. Thanks for the list!! I’ll try these other ones too (:",
      "created_utc": 1736304464.0,
      "score": 2
    },
    {
      "id": "m5zk8kv",
      "body": "Great advice! Thank you",
      "created_utc": 1736304775.0,
      "score": 2
    },
    {
      "id": "m5zp4n2",
      "body": "This is why I have a bag of jolly ranchers at work lol",
      "created_utc": 1736306528.0,
      "score": 2
    },
    {
      "id": "m5zq3v1",
      "body": "This is a very helpful list! Cold also really works for me. I like pressing the small plastic rubbermaid freezer packs on the back of my neck. Instant relief and somehow the plastic itself feels soothing to hold.",
      "created_utc": 1736306891.0,
      "score": 2
    },
    {
      "id": "m602o9z",
      "body": "Nice list. I do some of these, and others are new to me. Thanks!",
      "created_utc": 1736311955.0,
      "score": 2
    },
    {
      "id": "m641hrv",
      "body": "“Saving”! Thanks for these ideas!",
      "created_utc": 1736369445.0,
      "score": 2
    },
    {
      "id": "m5z6gu7",
      "body": "interesting. thanks for sharing. I especially like the interactive ones. but when im in the thick of it, I am sometimes not able to initiate any of it, I would need someone to remind/force me to do any of this. Also wondering if its just distracting until the feeling(s) subside/pass?",
      "created_utc": 1736300016.0,
      "score": 1
    },
    {
      "id": "m5zb2rl",
      "body": "Deep exhales",
      "created_utc": 1736301581.0,
      "score": 1
    },
    {
      "id": "m5zi8iy",
      "body": "Excellent ",
      "created_utc": 1736304086.0,
      "score": 1
    },
    {
      "id": "m5zqh6r",
      "body": "Make the “R” / “Arrrr” sound and force yourself to yawn. Works like a charm!",
      "created_utc": 1736307027.0,
      "score": 1
    },
    {
      "id": "m60ii5r",
      "body": "dunking your face in ice water is amazing. it actually resets something in the nervous system. when i had terrible anxiety attacks it was the only way to reset my nervous system.",
      "created_utc": 1736319959.0,
      "score": 1
    },
    {
      "id": "m60m3hd",
      "body": "Thank you so much.  Next time I attend a stressful meeting I will try these and hopefully not suffer as much",
      "created_utc": 1736322103.0,
      "score": 1
    },
    {
      "id": "m60nsw8",
      "body": "Any tips for nausea and not being able to sleep? All I want to do is sleep.. I’m on 20mg of fluoxetine, I’m thinking about taking double today o just can’t bare this feeling",
      "created_utc": 1736323135.0,
      "score": 1
    },
    {
      "id": "m60o2v0",
      "body": "Great tips!!",
      "created_utc": 1736323306.0,
      "score": 1
    },
    {
      "id": "m60uxef",
      "body": "My main physical symptom that sends me to panic is dizzines or out of balance and when i hold my toddler i don't feel that . My husband doesn't understand why i want to carry my son throughout the store now it's explained.",
      "created_utc": 1736327715.0,
      "score": 1
    },
    {
      "id": "m60x3pw",
      "body": "I really love this 🥹\nI have this post saved now and put a copy in my notes. I really appreciate all the different methods especially since everyone handles/holds anxiety differently 🩷",
      "created_utc": 1736329111.0,
      "score": 1
    },
    {
      "id": "m60zbof",
      "body": "Commenting so I can come back, thanks.",
      "created_utc": 1736330546.0,
      "score": 1
    },
    {
      "id": "m61blo9",
      "body": "Taking saffron as a daily supplement has helped me a lot\n I hear you want to make sure to get a reputable brand because saffron is expensive. I use youtheory",
      "created_utc": 1736337712.0,
      "score": 1
    },
    {
      "id": "m61jqyn",
      "body": "Yes, overheating and dehydration are huge anxiety boosters. Another thing that gives me immediate relief is a calm conversation about unrelated topics with someone who I know who understands my condition",
      "created_utc": 1736341469.0,
      "score": 1
    },
    {
      "id": "m61mce4",
      "body": "Mine was drinking tea! Something about it really helped soothe me. Making it, letting the tea bag soak, adding sugar, milk and finally sitting down and taking little sips until it cools down to gulp it. Idk it just helped me be mindful and live in the moment",
      "created_utc": 1736342532.0,
      "score": 1
    },
    {
      "id": "m61nba5",
      "body": "I like to stretch and listen to my breath when i am noticing im getting really anxious but if im not able to, then i breath in a vapor inhaler which has been helpful. The menthol gives me something to focus on. I want to try sour candy and sip on some water too. Thank you for this <3",
      "created_utc": 1736342918.0,
      "score": 1
    },
    {
      "id": "m61oihw",
      "body": "Wow, this is a great post. Thank you op!",
      "created_utc": 1736343393.0,
      "score": 1
    },
    {
      "id": "m61z1vx",
      "body": "Sunglasses 😎 \n\nFor whatever reason they help",
      "created_utc": 1736347238.0,
      "score": 1
    },
    {
      "id": "m623mtr",
      "body": "Gargle it stimulates the Vagus nerve and chills you out and deep breathing is a plus also.",
      "created_utc": 1736348762.0,
      "score": 1
    },
    {
      "id": "m626wrb",
      "body": "Sour Patch Kids or just buy a bag of citric acid",
      "created_utc": 1736349808.0,
      "score": 1
    },
    {
      "id": "m629k5b",
      "body": "I learned in a yoga class that water helps regulate our nervous systems.",
      "created_utc": 1736350641.0,
      "score": 1
    },
    {
      "id": "m62akdm",
      "body": "Eye movement",
      "created_utc": 1736350954.0,
      "score": 1
    },
    {
      "id": "m62axw8",
      "body": "I don't quite understand how the turning the room cold thing works for anxiety? Isn't it efficient for panic attacks instead?",
      "created_utc": 1736351071.0,
      "score": 1
    },
    {
      "id": "m62lukk",
      "body": "I was so tired of my anxiety. I had it in 2021 and it kinda went silent until like march 2024 when it all just came back. I really needed that post, I forgot how helpful these unconventional things are. Thank you",
      "created_utc": 1736354329.0,
      "score": 1
    },
    {
      "id": "m638cdf",
      "body": "One of my always works methods is feet up a wall, arms sprawled out, breathe deep into my chest",
      "created_utc": 1736360993.0,
      "score": 1
    },
    {
      "id": "m63wno6",
      "body": "The cold water!!!! The best. I love ice cold showers",
      "created_utc": 1736368042.0,
      "score": 1
    },
    {
      "id": "m649f5a",
      "body": "I got anxious yesterday returning to the office for the first time in two weeks and it wasn’t until later that I realised getting up and walking around helped. I’d convinced myself it’d just gone away on its own. I’m currently trying to put together a toolbox so these are very helpful 😊",
      "created_utc": 1736371735.0,
      "score": 1
    },
    {
      "id": "m649y1v",
      "body": "Gently hold on to your ear first at the top, then middle and then lobe and pull out or down. This stimulates your vagus nerve and signals the body to calm. \n\nYou know its working as it will induce a big old yawn! \n\nThought this was rubbish until I tried it and it works!",
      "created_utc": 1736371888.0,
      "score": 1
    },
    {
      "id": "m64byhp",
      "body": "Great list!!",
      "created_utc": 1736372474.0,
      "score": 1
    },
    {
      "id": "m65f2aw",
      "body": "What helps me is dancing - I put on a dance workout on YouTube and between the music and moving my body it usually breaks my anxiety cycle. Thanks to everyone who shared tips.",
      "created_utc": 1736385037.0,
      "score": 1
    },
    {
      "id": "m65on3v",
      "body": "A child, less than 10 probably. I thought it was normal",
      "created_utc": 1736388340.0,
      "score": 1
    },
    {
      "id": "m66tqtm",
      "body": "I appreciate your efforts. You have conducted numerous insightful experiments on yourself. However, there must be underlying reasons behind one’s anxiety and fear. These reasons are often deeply rooted in our past and cannot be identified or understood without deliberate introspection. As we know, every reaction has an underlying action/reason except for the fact that we have not reached at all the reasons yet. Fear and anxiety—essentially mild forms of fear—are reactions. To manage them, we must uncover their causes or triggers.\n\n The challenge with this approach is that our minds operate so rapidly that identifying the reasons behind our emotions becomes difficult. It requires consistent effort and perseverance. Many people attempt this process but, when they fail to uncover the cause, they become more anxious and frustrated.\n\nIn my experience, fear will persist until you uncover its root cause. Here’s the tricky part: often, it feels as though we fear without any identifiable reason. Despite our attempts, we might not succeed in finding the cause immediately. But believe me, there is always a reason. Once you identify it, you can redirect your energy toward something constructive and beneficial in the long run.\n\nNow, let’s address your solutions. They are highly effective in disrupting negative mental patterns. Our brain, for the sake of efficiency, creates shortcuts by learning from past outcomes. This is why it provides automatic suggestions when we face a situation. It operates on a “problem-solution” framework. When something occurs, the brain processes previously stored information and generates results within milliseconds. The gap is so brief that it seems as though the brain is offering solutions instantaneously.\n\nFear and anxiety are also the brain’s responses to navigate situations—they are like default mental patterns. One such pattern is the “problem-solution” cycle. When the brain encounters an impasse, it presents fear as a solution to address the uncertainty. To disrupt these patterns, your solutions are indispensable. However, we must first identify the root cause. Once the cause is known, we can recondition the mind using your strategies. If we attempt to break the patterns first without understanding the cause, the brain will simply create new pathways for fear.\n\nThese are my insights. I apologize for any shortcomings in my language, but I hope my thoughts are clear.\n\nSteve Jobs once said, “You can’t connect the dots looking forward; you can only connect them looking backward. So you have to trust that the dots will somehow connect in your future.”",
      "created_utc": 1736406145.0,
      "score": 1
    },
    {
      "id": "m66u6wy",
      "body": "These are wonderful, thank you!",
      "created_utc": 1736406406.0,
      "score": 1
    },
    {
      "id": "m670n3v",
      "body": "Thank you very much I will use coping skills in my day to day life now.",
      "created_utc": 1736410331.0,
      "score": 1
    },
    {
      "id": "m67d5vj",
      "body": "My ex came home to me jumping around the room, wrapped in blankets, knocking furniture over, shoving candy down my throat - all while gurgling out \"GRATEFUL! I'm grateful!!\"\n\n\nDo what we gotta do. Anxiety of this life is a trip man! 😁",
      "created_utc": 1736418482.0,
      "score": 1
    },
    {
      "id": "m6ilez0",
      "body": "there's some great advice in here \n\none of the big ones for me is just comedy, either a podcast or the simpsons or something (when my anxiety was at its worst years ago I would watch a lot of parks and recs because it was funny AND everything always worked out in the end)\n\nalso unfortunately being cold absolutely triggers my anxiety ",
      "created_utc": 1736563574.0,
      "score": 1
    },
    {
      "id": "m6n7nx7",
      "body": "Odd enough, cold temperature makes me more anxious than warm!",
      "created_utc": 1736632899.0,
      "score": 1
    },
    {
      "id": "m6ur6i0",
      "body": "I get panic attack thinking of any blood test. I am due to get one done. What to do?",
      "created_utc": 1736734238.0,
      "score": 1
    },
    {
      "id": "m7jrbym",
      "body": "I’ve been suffering from panic attacks for over 20 years and I’ve learned a few ways to manage it over the years.\n\n1. Lay in the shower with the water running on you and try to clear your mind.\n\n2. Listen to White Noise, I have a White Noise app on my phone and I always listen to waves crashing. I try to picture the waves in my mind as I listen to them to clear out any thoughts. \n\n3. I get very nauseous during a panic attack so sometimes I lay in bed with a heating pad on my stomach and that helps me focus on just the heat from the heating pad. \n\n4. I recently purchased a neck fan, which has been life-changing, just having cold air blowing on you and your own personal little White Noise bubble is a lifesaver.",
      "created_utc": 1737074209.0,
      "score": 1
    },
    {
      "id": "m8uhm8z",
      "body": "The cold is huge. I take a ton of cold showers",
      "created_utc": 1737687733.0,
      "score": 1
    },
    {
      "id": "msp0yfu",
      "body": "These are all really good suggestions, thanks OP for keeping it real!",
      "created_utc": 1747430488.0,
      "score": 1
    },
    {
      "id": "m623u4w",
      "body": "This is to some degree how ocd starts, if you start counting stuff when you are anxious this can become a habit because its rewarding to feel less anxiety. Then at some point you might become so dependent on it that you cant go without.",
      "created_utc": 1736348828.0,
      "score": 1
    },
    {
      "id": "m5xfuwt",
      "body": "Yes I find that anything with an interesting texture or taste really helps!!",
      "created_utc": 1736280654.0,
      "score": 28
    },
    {
      "id": "m5ze9j7",
      "body": "The sour candy works for me.  I carry warheads with me.",
      "created_utc": 1736302691.0,
      "score": 8
    },
    {
      "id": "m60fn10",
      "body": "My kid has anxiety and his therapist gives him warhead candies for his panic attacks!",
      "created_utc": 1736318341.0,
      "score": 8
    },
    {
      "id": "m626rzl",
      "body": "I’m a fan of the cold water strategy, but when I don’t want or have time to get my face wet I keep a bag of water in the fridge that I use instead. I just take it out, hold my breath and hold it on my face while I lean over to simulate submerging my face in cold water. It still works surprisingly well!",
      "created_utc": 1736349767.0,
      "score": 7
    },
    {
      "id": "m66ndwm",
      "body": "ive been anxious about a trip coming up, and my face BURNS up sometimes. seriously thought it gave me a fever. ugh its terrible",
      "created_utc": 1736402643.0,
      "score": 3
    },
    {
      "id": "m5zebbe",
      "body": "A Dr. Once told me no one has ever died from an anxiety attack!  Thank God right! Some relief in that!",
      "created_utc": 1736302709.0,
      "score": 36
    },
    {
      "id": "m60v1lt",
      "body": "I start cleaning my room with songs playing in the background to keep myself busy.",
      "created_utc": 1736327791.0,
      "score": 9
    },
    {
      "id": "m6ill53",
      "body": "the worst a panic attack has ever done to me is left me laying in bed shivering so yeah I guess I'm the same, it can't kill me either ",
      "created_utc": 1736563637.0,
      "score": 2
    },
    {
      "id": "m5yd91k",
      "body": "Cold was the only thing that snapped me out of a panic attack at the dentist. I was *this* close to canceling and bolting but the assistant was so kind and brought me a cold water bottle, a fan, and would blow cold air in my face with the little tool they use.",
      "created_utc": 1736290427.0,
      "score": 19
    },
    {
      "id": "m5zq8x6",
      "body": "yes!! i am moving to san diego this summer so i am def gonna need to keep cold things around me at all times to prevent overheating",
      "created_utc": 1736306942.0,
      "score": 7
    },
    {
      "id": "m5znpja",
      "body": "yes! i love to sing. one of my go tos when i am really anxious is taking a COLD shower and singing once i get accustomed to the temperature! thank u for sharing❤️",
      "created_utc": 1736306005.0,
      "score": 5
    },
    {
      "id": "m61rjk3",
      "body": "This is such a good one that I use that I’ve never seen anyone else mention!! Focusing on the lyrics and my breathing when singing really snaps me out of it sometimes. Sounds so crazy bc I will literally feel like I’m dying, but this works!",
      "created_utc": 1736344542.0,
      "score": 4
    },
    {
      "id": "m6ilpp8",
      "body": "yes unfortunately I have roommates but I can sing while I'm driving at least lol\n\nwhat I can do at home though is play my guitar, it's electric so just plug in headphones in the amp and no one is bothered by my noodling ",
      "created_utc": 1736563683.0,
      "score": 2
    },
    {
      "id": "m6xw9tz",
      "body": "My therapist said there’s actual science behind that! Talking and singing and humming vibrate your vocal cords, which massages some kind of nerve that ends up helping us to calm down. I had my worst panic attack in October, and for a few days after that when I was dealing with the aftershocks, humming at work helped me, and belting out songs in the car did too.",
      "created_utc": 1736785726.0,
      "score": 2
    },
    {
      "id": "m5zjvnl",
      "body": "thank you for sharing!! i will have to try wasabi peas!",
      "created_utc": 1736304652.0,
      "score": 5
    },
    {
      "id": "m5zjm1e",
      "body": "I can certainly relate to the hot room thing. Even have vent covered up in bedroom so heat can't blow on me. Have a Chill Jet running at night facing me. If I get hot it definitely makes things worse, having suffered heat exhaustion back in 2021. From that time am supersensitive to heat. Whether my anxiety condition is related to the heat exhaustion residual am not sure. But take extra steps to make sure it doesn't have an opportunity to set itself up. Thanks so much for sharing all this great info.",
      "created_utc": 1736304559.0,
      "score": 4
    },
    {
      "id": "m6imlfu",
      "body": "the neck thing I'd weird lol, ties make me start gagging, and if I were to say, fill my jacket pockets and it started weighing on my neck and shoulders that would do it too ",
      "created_utc": 1736563999.0,
      "score": 2
    },
    {
      "id": "m5zkhwd",
      "body": "Sort of but not really.\n\nA bunch of these work either via stimulating the parasympathetic nervous system, or through interrupting sensation-->thoughts-->over-awareness-of-the-sensation cycles that elevate and perpetuate anxiety.\n\nI think it's quite important to make this sort of distinction because not all of the above techniques work the same way, which means using combinations of them can be effective, and that working your way through some of them if one isn't working can also be effective.\n\nWriting them all off as simply distracting yourself robs you of their benefits.",
      "created_utc": 1736304864.0,
      "score": 31
    },
    {
      "id": "m602yg2",
      "body": "Singing is good in general - requires focus, regulates breathing, has positive mental associations if you pick songs you really like.",
      "created_utc": 1736312077.0,
      "score": 6
    },
    {
      "id": "m5zmiwb",
      "body": "i completely understand what you mean. when my anxiety takes over it can feel impossible to break free from the cycle. if you can, try sharing this list with someone you trust so they can support you during moments where you're having anxiety. if that’s not an option, try starting with something really simple like chugging water or lying down on the floor and go from there. the point is to try and create a pause and give your mind and body a moment to reset. it can help you step back from being consumed by the feelings to observing and processing them more intentionally! i hope this helps ❤️",
      "created_utc": 1736305575.0,
      "score": 3
    },
    {
      "id": "m609z7g",
      "body": "I have been making little written reminders - they can be like flash cards, or a single bullet point list. They can be physical, index cards or the like, or electronic on your phone - use memo app, or Quotes Creator (with it you can have all sorts of cool backgrounds, photos or color gradients, etc.).\n\nThat way, you only have to remember to reach for the cards or list, instead of trying to recall each individual item.",
      "created_utc": 1736315340.0,
      "score": 2
    },
    {
      "id": "m6oqtot",
      "body": "Hi, I wanna say I haven’t had a panic attack in months, & I’m the exact same. Techniques are nice but when it’s actually happening, I’m not gonna be thinking about 5 things I see, 4 things I touch, 3 things…. Etc. that sometimes makes me feel overstimulated & worse. I will say I just had the idea to do a voice recording/video on my phone as sort of a “guide” to play if I ever have one. You can record yourself telling yourself what to do, or hyping you up to sing a song, etc. might be helpful! ",
      "created_utc": 1736651507.0,
      "score": 2
    },
    {
      "id": "m673f1e",
      "body": "How long have you been in them? Xxx",
      "created_utc": 1736412123.0,
      "score": 2
    },
    {
      "id": "m62tx2c",
      "body": "I think that it can help with both! I personally don’t have many panic attacks and anxiety attacks are the main issue for me, but I do start to get anxious when I’m overheating. When I adjust the room temp to be cooler I instantly feel better, it might not work for everyone but I wanted to share bc it was a game changer for me",
      "created_utc": 1736356820.0,
      "score": 1
    },
    {
      "id": "m62n0ik",
      "body": "Music (listening to something I enjoy or playing some instrument/singing) and limiting social media use kinda helps me too. Sm are often overstimulating and bombarding with triggering content to make us more engaged while music is just soothing and engaging. But these are pretty well known",
      "created_utc": 1736354671.0,
      "score": 1
    },
    {
      "id": "mqybdbm",
      "body": "Did you do anything to make it go silent? If so, what helped?",
      "created_utc": 1746565012.0,
      "score": 1
    },
    {
      "id": "m5ye4vd",
      "body": "This is really interesting because I suffer with anxiety and also always feel the need to suck on sour candies. I never thought the two were related but actually makes a lot of sense!",
      "created_utc": 1736290704.0,
      "score": 11
    },
    {
      "id": "m6inh60",
      "body": "Yea buddy",
      "created_utc": 1736564319.0,
      "score": 2
    },
    {
      "id": "m70tbfk",
      "body": "That’s so neat! Thanks for sharing and I’m glad that you found something that helps.",
      "created_utc": 1736817531.0,
      "score": 1
    },
    {
      "id": "m6inls0",
      "body": "Yeah the neck needs to always have air flowing around it. Everyone around me is complaining about the cold temps for winter and I’m enjoying it actually.",
      "created_utc": 1736564364.0,
      "score": 1
    },
    {
      "id": "m5zl0kk",
      "body": "love this response, thank you!!",
      "created_utc": 1736305046.0,
      "score": 15
    },
    {
      "id": "m60ao6b",
      "body": "Besides, if it works don't knock it, I say. Anxiety fights dirty, and if I find something that helps that's not \"illegal, immoral, or fattening\" as the saying goes, I'm not going to hesitate to use it. I understand about not over-relying on crutches; however, sometimes people can carry that too far in the other direction.",
      "created_utc": 1736315687.0,
      "score": 11
    },
    {
      "id": "m62rvji",
      "body": "brilliant! thanks",
      "created_utc": 1736356197.0,
      "score": 2
    },
    {
      "id": "m6y45vc",
      "body": "wow thats a good idea <3",
      "created_utc": 1736788040.0,
      "score": 1
    },
    {
      "id": "m679rha",
      "body": "It’s been about two months maybe less xxx",
      "created_utc": 1736416294.0,
      "score": 1
    }
  ]
}