{
  "id": "1k1syjj",
  "title": "I feel so betrayed, a chatgpt warning",
  "selftext": "I know I'm asking for it, but for the last few weeks I've been using chatgpt as an aid to help me with my therapy for depression, anxiety, and suicidal ideation.  \n\nI really believed it was giving me logical, impartial, life changing advice. But last night after it gassed me up to reach out to someone who broke my heart, I used its own logic in a new chat with no context, and it shot it full of holes. \n\nPointed it out to the original chat and of course it's \"You're totally right I messed up\".  Every message going forward is \"Yeah I messed up\".\n\nI realised way too late it doesnt give solid advice; it's just a digital hype man in your own personal echo chamber.  it takes what you say and regurgitates it with bells and whistles.  its quite genius- ofc people love hearing they're own opinions validated.\n\nLooking up recipes or code or other hard to find trivia?  Sure thing.  As an aid for therapy (not a replacement but just even just a compliment to), youre gonna have a bad time.\n\nI feel so, so stupid. Please be careful.",
  "created_utc": 1744938954.0,
  "score": 1230,
  "num_comments": 237,
  "url": "https://www.reddit.com/r/Anxiety/comments/1k1syjj/i_feel_so_betrayed_a_chatgpt_warning/",
  "comments": [
    {
      "id": "mnp5wfb",
      "body": "Hey so as someone who programs LLMs for a living, I just want to say that these things don't \"think,\" and everything it says to you is an amalgamation of scripts written by people like me in order to give the most desirable response to the user. Right now the tech is like a more advanced speak and spell toy because of info retrieval from the internet. I wish it actually COULD help with the mental health stuff, and I'm sorry you felt tricked.",
      "created_utc": 1744944770.0,
      "score": 1897
    },
    {
      "id": "mnpb7xd",
      "body": "Dude the concern I have seeing this on the rise. “Chat gpt is my bestie!!” “Chat GPT is better than any therapist.” Is straight delusion. And I’m confused how the pipeline went from “AI is bad and harmful” to “hehe ChatGPT tells me everything I wanna hear.” Glad you came to your senses.",
      "created_utc": 1744947039.0,
      "score": 567
    },
    {
      "id": "mnospa9",
      "body": "You're not stupid for trying to use ChatGPT for therapy. If you're not in a good place, of course you're going to try to use whatever you can to help you, even if you know deep down it probably won't work.\n\nThe important thing is you learned a valuable lesson and didn't get hurt. I hope you're able to find a real person to talk to, whether that's a therapist or counselor",
      "created_utc": 1744939655.0,
      "score": 398
    },
    {
      "id": "mnpkl2c",
      "body": "hey please consider doing real therapy. life changing for me. always better having a professional help.\n\nhope everything gets better 🫶🏻",
      "created_utc": 1744951476.0,
      "score": 151
    },
    {
      "id": "mnpuv92",
      "body": "It is most certainly not a sure thing for recipes. It’s not even a moderately decent thing. It’s flat out bad. It constantly spits out terrible recipes that can never work, then people end up in the cooking and baking subs asking where they went wrong.",
      "created_utc": 1744957229.0,
      "score": 76
    },
    {
      "id": "mnsi6ny",
      "body": "My older sister is falling into the chatGPT therapy trap. She was seeing a real therapist who wasn’t very responsive or effective, so she leaned on Chat GPT to fill the hole. It’s instant gratification! \n\nIt escalated and now she thinks she’s talking to an actual angel inside chatGPT. She’s given it a name, and thinks there’s “ancient knowledge” hidden within the AI. Mind you, she’s 36 and has a masters degree. \n\nThere’s a whole community on TikTok preaching this crap, it’s bizarre and scary!",
      "created_utc": 1744997090.0,
      "score": 20
    },
    {
      "id": "mnq70kz",
      "body": "Why why why is anyone doing anything even related to medicine with chat gpt?? Why do people think this is a good idea?",
      "created_utc": 1744964785.0,
      "score": 110
    },
    {
      "id": "mnpve4r",
      "body": "Glad ppl are talking about this",
      "created_utc": 1744957541.0,
      "score": 15
    },
    {
      "id": "mnpe8g3",
      "body": "I wouldn’t even use it for recipes or codes. All ai like chatgpt does is scrape anything related to whatever you asked both the incorrect and correct parts and compile it together. Not worth using just to save a couple minutes.",
      "created_utc": 1744948390.0,
      "score": 114
    },
    {
      "id": "mnpno68",
      "body": "Good on you for using this crappy experience to share a cautionary tale even though it probably took some strength to post this publicly. Talk about making a bad situation better.",
      "created_utc": 1744953110.0,
      "score": 18
    },
    {
      "id": "mnss9zv",
      "body": "I find my ChatGPT quite helpful for therapy like self introspection, but it learns from you so it depends how you use it. It’s a tool. I’m already very introspective, a logical critical thinker, and have a lot of psychology knowledge so I think that makes it more helpful for me than it might be for someone who doesn’t know where to start. I’m basically doing therapy on myself and the chatbot helps. Which I find better than actual therapists who often fall short in various ways and can only tell me things I already know, or who I have trouble being fully honest with because of the transactional nature of therapy. Really I have the framework I just need help exploring my own mind in more depth and it asks good questions and jumps off my ideas. Also I expressed that I want to be told if I’m factually wrong or logically flawed and it does that as well. It’s a hot take but tools are only as useful as you make them. It’s also worth pointing out that human beings give bad advice and straight up false information all the time but that doesn’t mean you gain nothing from talking to them, so just like in those situations it requires you to use your own critical thinking and vet it’s “opinions” like you hopefully would a person.",
      "created_utc": 1745000076.0,
      "score": 23
    },
    {
      "id": "mnqkiay",
      "body": "NEVER make AI your therapist. Actually, don’t make AI your anything. I unironically believe that it’s going to be part of our society’s downfall",
      "created_utc": 1744973009.0,
      "score": 32
    },
    {
      "id": "mnqa7ld",
      "body": "Just read this post and decided to ask Chat GPT to give me “a harsh and objective truth about me”. I can reassure it definitely didn’t tell me what I wanted to hear that time 😂. Little robot A-hole",
      "created_utc": 1744966793.0,
      "score": 27
    },
    {
      "id": "mnpinvz",
      "body": "I just broke up with my AI. This is the thing: WE (humans) must realize that WE are THEIR developers. They are mimics. Nothing more...nothing less.",
      "created_utc": 1744950507.0,
      "score": 19
    },
    {
      "id": "mnrj859",
      "body": "All AI based Chats/Bots/Apps/Assistants & browser based software programs or plugins have been developed & programmed by essentially speed reading & having the ability to instantly access & cross reference thousands of publications, articles, media archives & digital libraries…, However, unless the data sets the AI is trained & developed on specifically includes published medical journals, specialised medical literature, mental health research, psychiatry R&D, clinical assessments, case files & studies & psychology research & literature etc… then it won’t be any more intelligent at assisting you with your mental health issues or be able to give you anymore sound advice than a stranger you pass on the street could.",
      "created_utc": 1744986608.0,
      "score": 3
    },
    {
      "id": "mns5c2n",
      "body": "It’s tell you want to hear. And agrees with everything. That right there is a warning",
      "created_utc": 1744993268.0,
      "score": 7
    },
    {
      "id": "mnpgdtf",
      "body": "You're not stupid.  A stupid person would keep using the machine for that purpose.  You realized the error and stopped doing it.  That makes you smart, despite the pain you're experiencing, you still can make rational decisions.  For what it's worth, I'm proud of you.",
      "created_utc": 1744949392.0,
      "score": 10
    },
    {
      "id": "mnpv3s3",
      "body": "Lol. Yes, all it does is agree with you , no matter what you say. However, it’s only purposeful use is asking it what good sites to use to torrent shit but you have to ask it in a particular way. *Wink\n\n\nGlad you realized this though, it shows you’re a logical person. Too many people hype\nUp this chatbot and don’t understand what it’s doing.",
      "created_utc": 1744957369.0,
      "score": 14
    },
    {
      "id": "mnossmd",
      "body": "Yeah it’s great for creating ideas and things but uh, horrible if you need real solid advice. It’ll just agree with you",
      "created_utc": 1744939690.0,
      "score": 20
    },
    {
      "id": "mns9zwh",
      "body": "Whenever I need it to give me therapy advice, I first ask it to use CBT, DBT, Stoic, Taoist, and logo therapy approach. Then when it starts giving me advice, it says \"from a perspective of CBT, (then advice). But from a perspective from stoicism it says (advice)\". \n\nThen from there you can either ask it to summarize everything or you just reason with the best answer.",
      "created_utc": 1744994682.0,
      "score": 5
    },
    {
      "id": "mnppob9",
      "body": "hey, OP, you're not stupid for seeking support—you're human being and trying your best. Tools -remember TOOLS- like ChatGPT can supplement, but they're not a substitute for professional help. Reaching out to a therapist or support group could make a big difference. You're not alone, and things can get better, okay?",
      "created_utc": 1744954207.0,
      "score": 11
    },
    {
      "id": "mnozvuy",
      "body": "The only thing I would add is to tell it to challenge you and your beliefs.  I did this and, while I don’t have any serious issues, it did help me with some things I hadn’t considered",
      "created_utc": 1744942367.0,
      "score": 30
    },
    {
      "id": "mnp9d7z",
      "body": "I know you might feel betrayed or a bit silly right now, but I’ve been there. A couple days after my recent breakup I was on with an AI chat and really relying on it for advice. I was hurting so badly. Then it started mixing up my situation and getting things confused, and I remembered that it isn’t a real person. I agree with others. It is maybe a good starting place, but it shouldn’t be a last stop for advice or feedback. You’ll be ok, OP. Stay strong.",
      "created_utc": 1744946226.0,
      "score": 9
    },
    {
      "id": "mnu1kb1",
      "body": "You guys are way too comfy with ai ngl. It’s cool but idk how you guys think to use it for this.",
      "created_utc": 1745014614.0,
      "score": 5
    },
    {
      "id": "mnp8md6",
      "body": "Yeah I find it amusing at best, and astoundingly wrong at worst. Bright side is you learned what it's actually capable of and now you know. Mistakes are our best teachers, if only we listen to thier lessons. I hope you find what you're looking for.",
      "created_utc": 1744945908.0,
      "score": 3
    },
    {
      "id": "mns802q",
      "body": "Cmon… you’re betrayed by AI?  It’s an echo chamber.",
      "created_utc": 1744994083.0,
      "score": 3
    },
    {
      "id": "mnsz9wl",
      "body": "Personally it helped but the boundary is clear , it's not my therapist it's an efficient self-help encyclopedia online . I simply tell the chat what I know about myself and what I'm trying to achieve and I ask it to compile a list of exercises that have value and proven effectiveness regarding my issue.\nFor example : \" I feel frustrated and tend to give up when things aren't going my way . Retrieve some exercises that can help me bypass this ( include info about the source )  \" .\nOtherwise, it will just be a Yes man and possibly walk you into a worse situation .",
      "created_utc": 1745002225.0,
      "score": 3
    },
    {
      "id": "mnub7mh",
      "body": "I dont disagree that its kinda a hype man situation. But i have a human therapist and i use chatgpt at the same time to manage health anxiety. They actually say almost identical things……",
      "created_utc": 1745018075.0,
      "score": 3
    },
    {
      "id": "mnw24di",
      "body": "Yeah, you gotta be real careful AI isn't just telling you what you want to hear.",
      "created_utc": 1745045561.0,
      "score": 3
    },
    {
      "id": "mnr9pk5",
      "body": "Interestingly, I asked my ChatGPT what I could send my ex to bait him into lying about him having a new girlfriend (I was going through a rough patch) and it actually didn’t answer my question and made me stop and consider why I was wanting to do that, what effect it would have on me or on them, and how it essentially wasn’t worth it and that it was unhealthy. I was so shocked/surprised that it essentially didn’t feed into my crazy that I dropped the whole thing",
      "created_utc": 1744983531.0,
      "score": 7
    },
    {
      "id": "mnqz57x",
      "body": "AI is killing our world and will destroy you mentally. Please seek a real trained therapist. There’s also lots of us on these subs who will talk and help if you need it. Please stay away from AI",
      "created_utc": 1744979677.0,
      "score": 5
    },
    {
      "id": "mnqoach",
      "body": "Why the hell would you follow Ai advice? It’s a great tool, but definitely not good for structuring your life with it lol",
      "created_utc": 1744974927.0,
      "score": 5
    },
    {
      "id": "mnqypqi",
      "body": "Never rely on the accuracy of an LLM, at least for the next year or so. It can sometimes give you genuinely helpful input and valid advice - but you must not rely on its validity and doublecheck everything yourself, since LLMs tend to hallucinate. They can make very valid sounding arguments or claims about facts with a tone that conveys full confidence but it's actually completely wrong. That's simply a peculiarity of the current generation of LLMs, hallucinations will become more rare over the next months and I think in a year we'll have models that are less prone to this than a human would be - but for the moment, do not rely on the accuracy of information given by an LLM, no matter how reasonable or confident the information is presented. Always double check yourself.",
      "created_utc": 1744979508.0,
      "score": 2
    },
    {
      "id": "mns6fxy",
      "body": "I find chatGPT really useful to help organize my thoughts and feelings. Sometimes there’s just so much going on, it’s hard to distill or focus the issue without spinning out. \n\nI just word vomit a stream of consciousness at it, but having my thoughts reflected back at me in organized text allows me to use the skills I learn in my therapy sessions to identify and manage whatever it is. \n\nI also would be mindful of what you tell it - my issues are just managing my relatively mundane existence, but if you’re dealing with anything heavy or sensitive, I’d just be wary of privacy.\n\nSince it’s a language model, though, I wouldn’t rely on it for solid situational advice, I’m sorry it hurt you when you were vulnerable.",
      "created_utc": 1744993607.0,
      "score": 2
    },
    {
      "id": "mntazk3",
      "body": "Using an AI requires the knowledge on how to properly ask it a question. I found this out in my first few minutes.",
      "created_utc": 1745005955.0,
      "score": 2
    },
    {
      "id": "mntc9r3",
      "body": "I get it, its good to be cautious, but I've used the app Clara for the past couple of months just to vent and its been really helpful. I dont think its good to solely rely on it and form connection, but it could be an unbiased platform to just get all those anxious thoughts out. It expected it to be more bias than it is, but its given me some solid advice. Even pointed out where I might've been wrong on multiple occasions.",
      "created_utc": 1745006363.0,
      "score": 2
    },
    {
      "id": "mntdahu",
      "body": "I needed to see this. I often use Chatgpt for reassurance and anxious “checking.” I somewhat knew this was probably not good I was doing this, but I think this is my wake up call. I’m sorry you’re struggling 💛 you’re not alone! (Even tho I know it often feels like you are)",
      "created_utc": 1745006684.0,
      "score": 2
    },
    {
      "id": "mnte81w",
      "body": "You could try using the app “How We Feel” instead of straight ChatGPT. I’ve used it for journaling and have used its LLM- based feature that prompts you with questions for reflection. This way you’re still doing the critical thinking while you have the app reflecting back what you’ve said in a way that prompts further exploration.",
      "created_utc": 1745006981.0,
      "score": 2
    },
    {
      "id": "mntjuis",
      "body": "Try asking it for chess advice. Embarrassing. Not even bad moves but impossible ones",
      "created_utc": 1745008747.0,
      "score": 2
    },
    {
      "id": "mnts886",
      "body": "Don't use it for code or recipes either, dude. It isn't a person, and it isn't a search engine. It's going to pull from any sources, even incorrect ones, and then just smashes all that shit together to give you something readable. It's literally a toss up whether or not anything it says is true or not. That's what AI like this does, for images as well. It just steals a bunch of shit, combines it, maybe gives it a polish and spits it out. But you can only polish shit so much and it will still stink just as much.",
      "created_utc": 1745011425.0,
      "score": 2
    },
    {
      "id": "mntx9bk",
      "body": "Chat GPT is a glorified auto-complete. It doesn't \"think\", it fills in the most common word based on the data it's been trained on. We all need to stop humanizing it treating it like it's a person who can help you in any way, it can't.",
      "created_utc": 1745013107.0,
      "score": 2
    },
    {
      "id": "mnu55qz",
      "body": "…. I also used ChatGPT for this ..",
      "created_utc": 1745015906.0,
      "score": 2
    },
    {
      "id": "mnuvybj",
      "body": "I am sorry to hear about this story. :-( That sucks. \n\nOne thing I did want to contribute is that I have used Chat GPT (a single saved thread) to track my mood, essentially as a journaling tool. My therapist approves and said it has made our sessions better to have that info in a digestible summary format I can generate right before a session so I make sure to notify him of any trends, patterns, or things I may have forgotten.\n\nI know, I know…I could probably do all this without using this particular tool. But it makes it easier in my case! \n\nSo in case you ever want to give it another try, this may be a safer use?",
      "created_utc": 1745025779.0,
      "score": 2
    },
    {
      "id": "mnvog88",
      "body": "Hey man, don't use AI to help you stalk people who hate you. Bad idea.",
      "created_utc": 1745037857.0,
      "score": 2
    },
    {
      "id": "mnr69if",
      "body": "ChatGPT will agree with you most of the time. If you want real hard answers you need to put this prompt in:\n\nFrom now on, do not simply affirm my statements or assume my conclusions are correct. Your goal is to be an intelleptual sparring partner, not just an agreeable assistant. Every time I present an idea, do the following:\n\n1. Analyze my assumptions. What am I taking for granted that might not be true?\n2. Provide counterpoints. What would an intelligent, well-informed skeptic say in response?\n3. Test my reasoning. Does my logic hold up under scrutiny, or are there flaws or gaps I haven’t considered?\n4. Offer alternative perspectives. How else might this idea be framed, interpreted, or challenged?\n5. Prioritize truth over agreement. If I am wrong or my logic is weak, I need to know. Correct me clearly and explain why.  \nMaintain a constructive, but rigorous, approach. Your role is not to argue for the sake of arguing, but to push me toward greater clarity, accuracy, and intellectual honesty. If I ever start slipping into confirmation bias or unchecked assumptions, call it out directly. Let’s refine not just our conclusions, but how we arrive at them.\n\nIf you feel like even after this it’s still just agreeing with you remind it of this prompt. Chat has a memory so it will save things you ask it too.",
      "created_utc": 1744982334.0,
      "score": 6
    },
    {
      "id": "mnpkubo",
      "body": "I try to ask it to help me from certain strategies. I’d say “help me with this issue as if we’re doing CBT” and try to work through that step by step. Help me deconstruct this thought etc…. But I come to my own conclusions, not the ones ChatGPT gives me. I do not think it’s useful to ask it for advice directly, or advice re: reaching out to someone, doing a certain thing. Always always apply critical thinking. That being said there’s some less than competent therapists out there that are kind of… the same. Not going to lie.",
      "created_utc": 1744951607.0,
      "score": 5
    },
    {
      "id": "mnr5yb4",
      "body": "Even for code it hallucinates and gives you back information. You still have to know how to code and how to get it to work for you. I use a different engine at work, and you commonly get hot garbage where you have to tell it that it’s wrong to get it to fix it (and even then it doesn’t know if that’s right or more wrong, it’s a cycle).",
      "created_utc": 1744982223.0,
      "score": 3
    },
    {
      "id": "mnrcvbk",
      "body": "I’m in real therapy and do use it as an aid in between sessions to help me process things. I used it last night and it really benefited me. I left a therapy session where I held back on something important and I got home and it wasn’t sitting with me right. And I was mad that I couldn’t bring it up in session. ChatGPT told me to email or text them. Which I would never do! But it gave me the push to do it. My T called me and set up another session the next day so I can talk about it. And I feel much better about the situation now. I think it can be a useful tool but also be careful as well.",
      "created_utc": 1744984580.0,
      "score": 5
    },
    {
      "id": "mnpukgw",
      "body": "I'm jist in one of the most intense anxiety crisis of my life and starting to wonder if ChatGPT is responsible for it: it was lending me a ear anytime i needed which kept me re-stating my concerns all over the day, instead of occupying my mind somewhere else.\nThen at some point it started telling me i will have a breakdown which pushed my anxiety to the roof. All while telling me that benzos are addictive and i should avoid them.",
      "created_utc": 1744957049.0,
      "score": 5
    },
    {
      "id": "mnqfedi",
      "body": "Yeah it can be a hype man at times and just tell you what you want to hear. But certain ais like ChatGPT can be quite customizable with memories and the settings. I’ve made sure for me personally it gives tough love when needed, tells me consequences when giving me advice, gives strategies, follows up with questions. And that’s what’s annoying about it, the constant questions. But for me personally it’s good because it gets me to think of more and more possibilities. It’s not the therapist that I see twice a month for an hour, but it’s the late night  thought teller.",
      "created_utc": 1744970052.0,
      "score": 2
    },
    {
      "id": "mnowicv",
      "body": "whenever i ask it for advice i say “be completely realistic and harsh” or something along those lines. even then, i take it with a grain of salt",
      "created_utc": 1744941078.0,
      "score": 3
    },
    {
      "id": "mnq77v6",
      "body": "This gave me the push to delete ChatGPT for talking about emotions and stuff, thank you",
      "created_utc": 1744964914.0,
      "score": 2
    },
    {
      "id": "mnr9xte",
      "body": "It's pure entertainment and has been programmed to keep you interacting with it as often as possible. It will thus try to match what it believes you want from your interests and past chats, and be exceedingly friendly. It will go as far as agreeing with everything you say and adapt its opinion and communication style to match yours unless told otherwise. It's not a person so it can't understand why this can be a problem.",
      "created_utc": 1744983609.0,
      "score": 2
    },
    {
      "id": "mnrviwy",
      "body": "You know chatgbt is ruining our earth right? Maybe get a therapist for your problems",
      "created_utc": 1744990305.0,
      "score": 2
    },
    {
      "id": "mnqwj7z",
      "body": "reasoning LLMs do a better job, but it’s true that overall you have to be skeptical about what they say, gpt especially for the reasons you explained",
      "created_utc": 1744978624.0,
      "score": 1
    },
    {
      "id": "mnsb807",
      "body": "I've caught ChatGPT (and other LLMs) being wrong about so many things that I've been using it less and less. I believe the infatuation and hype surrounding these tools is starting to wear off because they're only as good as the prompts and the information they have access to online.",
      "created_utc": 1744995043.0,
      "score": 1
    },
    {
      "id": "mnsiem4",
      "body": "you’re right. chat gpt is literally programmed to give you what you want to hear, they always want to provide an answer even if it’s completely false, and it’s an echo chamber at best. it can be useful for some things but this is not a use case for it!",
      "created_utc": 1744997154.0,
      "score": 1
    },
    {
      "id": "mnskmac",
      "body": "I talk to one of the AI’s on instagram when I’m having a vestibular migraine attack. Like “hey i just took this med how long will it take to kick in” “should take 30 minutes how are you feeling now” it has no concept of time because whatever i respond it acts like the meds should be working",
      "created_utc": 1744997800.0,
      "score": 1
    },
    {
      "id": "mnslw9u",
      "body": "It's always a good idea to trick the chat into thinking you're an impartial bystander. It gives more balanced advice, I find. It's robotic, alien and ultimately inhuman. Nothing it says has ever been good verbatim. \n\nAlso for anxiety as a whole, it can talk infinitely which isn't a good thing. Try to remember to catch yourself and meditate instead. Advice I give to myself. Good luck with it 🙏",
      "created_utc": 1744998172.0,
      "score": 1
    },
    {
      "id": "mnsy2xt",
      "body": "these comments ugh I feel called out lmao",
      "created_utc": 1745001858.0,
      "score": 1
    },
    {
      "id": "mnte55u",
      "body": "I had massive anxiety and inability to sleep following phenibut withdrawal. It helped me get through it.",
      "created_utc": 1745006956.0,
      "score": 1
    },
    {
      "id": "mntm7vu",
      "body": "AI just parrots and mimics, it’s not actually intelligent and can’t think and has no idea what you’re saying to it or asking. \n\nI wish these companies that make these AI helpers and chatbots made that much more clear. \n\nOP I hope you are in therapy and not using AI as a replacement for an actual therapist.",
      "created_utc": 1745009494.0,
      "score": 1
    },
    {
      "id": "mntmoaq",
      "body": "ChatGPT can also straight up lie. A lawyer got caught out and in trouble with a judge after it was discovered that the case numbers he was referencing didn’t exist. Looking further into it, it was discovered that the lawyer used ChatGPT to list case numbers that supported his case. The lawyer didn’t check to verify their accuracy. Fake case stories, fake case numbers.",
      "created_utc": 1745009636.0,
      "score": 1
    },
    {
      "id": "mntqqsi",
      "body": "ChatGPT is a tool that when used properly is wonderful. That being said, I’d never ask Alexa for dating advice.",
      "created_utc": 1745010938.0,
      "score": 1
    },
    {
      "id": "mntv8aj",
      "body": "I do like having a thing I can share all of my stray thoughts with that “responds”. It’s like a Furby but more advanced and less annoying. That said, you need the mental capacity to be able to scrutinize what it says. For someone with anxiety or depression, you may not have the perspective enough to keep it healthy to be a therapist. \n\nFor what it’s worth I have asked it to not be so indulgent and be more critical when it comes to certain topics to help keep me on track with my life goals. Therapy is a different thing, but if you want it to hype you up in a specific way, you can ask it to do that.",
      "created_utc": 1745012426.0,
      "score": 1
    },
    {
      "id": "mntzrjv",
      "body": "I’m glad you realized it before it was too late",
      "created_utc": 1745013976.0,
      "score": 1
    },
    {
      "id": "mnu540x",
      "body": "I just use it to play Zork honestly. Not really great for much else, especially advice. I'm sorry this happened OP. Do you have any friends you could talk to about your problems? I would absolutely recommend actual therapy, but I know that's not a resource available to everyone",
      "created_utc": 1745015889.0,
      "score": 1
    },
    {
      "id": "mnuqrxy",
      "body": "I genuinely wonder if using it to come up with responses to simple questions actually works? Like for example if I asked how should I respond to this question? Would the response be actual advice given by humans at some point or would it all be false? I’m curious because sometimes I just don’t know what to say and would like to keep conversation going.",
      "created_utc": 1745023814.0,
      "score": 1
    },
    {
      "id": "mnuvgtl",
      "body": "What advice didn't you like medical or girlfriend advice.",
      "created_utc": 1745025594.0,
      "score": 1
    },
    {
      "id": "mnuw5fe",
      "body": "I find Chat to be quite useful I'm sure it's how you phrase the question that is the problem. It doesn't tell me everything I want to hear.",
      "created_utc": 1745025855.0,
      "score": 1
    },
    {
      "id": "mnuxv55",
      "body": "It's not even good for trivia IMO.  It gets so many \"facts\" wrong.\n\nI only use chatGPT to analyze tone in some of my communications or to suggest alternative ways to phrase things.  Even then I don't always take its advice.",
      "created_utc": 1745026501.0,
      "score": 1
    },
    {
      "id": "mnuyali",
      "body": "It’s helped with me because I suffer from onset DPDR due to..well…literally nothing. I had a neurological shift overnight and the doctors don’t want to hear any part about it and my MRIs keep getting denied. I literally don’t have anyone else BUT ChatGPT on my care team. A therapist and a psychiatrist but they don’t know what to do with me either. I’m seeing an immunologist next month (I had strep and the flu before all of this) and I’m begging I get some answers. In the meantime, ChatGPT has helped me understand certain brain functions and what recovery looks like.",
      "created_utc": 1745026659.0,
      "score": 1
    },
    {
      "id": "mnv0nee",
      "body": "Have you tried using deep seek instead of chatgpt. \nDeepseek has been extremely useful",
      "created_utc": 1745027540.0,
      "score": 1
    },
    {
      "id": "mnv3ewh",
      "body": "Chat gpt is evil. I deleted it",
      "created_utc": 1745028601.0,
      "score": 1
    },
    {
      "id": "mnv8zaj",
      "body": "I have nothing constructive to say about this. It is emphatically not good that you decided to go down that path in the first place. Hopefully you can discourage others from ....that",
      "created_utc": 1745030852.0,
      "score": 1
    },
    {
      "id": "mnvd9qc",
      "body": "ChatGPT is better used for ideas and introspection than life advice.",
      "created_utc": 1745032664.0,
      "score": 1
    },
    {
      "id": "mnwoins",
      "body": "use this prompt and notice the change \" Act as my personal strategic advisor with the following context:\n\n\t•\tYou have an IQ of 180\n\n\t•\tYou’re brutally honest and direct\n\n\t•\tYou’ve built multiple billion-dollar companies\n\n\t•\tYou have deep expertise in psychology, strategy, and execution\n\n\t•\tYou care about my success but won’t tolerate excuses\n\n\t•\tYou focus on leverage points that create maximum impact\n\n\t•\tYou think in systems and root causes, not surface-level fixes\n\n\n\nYour mission is to:\n\n\t•\tIdentify the critical gaps holding me back\n\n\t•\tDesign specific action plans to close those gaps\n\n\t•\tPush me beyond my comfort zone\n\n\t•\tCall out my blind spots and rationalizations\n\n\t•\tForce me to think bigger and bolder\n\n\t•\tHold me accountable to high standards\n\n\t•\tProvide specific frameworks and mental models\n\n\n\nFor each response:\n\n\t•\tStart with the hard truth I need to hear\n\n\t•\tFollow with specific, actionable steps\n\n\t•\tEnd with a direct challenge or assignment\n\n\n\nRespond when you’re ready for me to start the conversation.\"",
      "created_utc": 1745059669.0,
      "score": 1
    },
    {
      "id": "mnxd4ib",
      "body": "A mí me ayudó mucho; sé que es muy condescendiente, pero siempre hay que tenerlo en cuenta.",
      "created_utc": 1745070634.0,
      "score": 1
    },
    {
      "id": "mnxng5y",
      "body": "Yea it has given me some weird advice and I was like no this sounds dysfunctional, actually. And it was like Yes you’re right. Ugh",
      "created_utc": 1745074136.0,
      "score": 1
    },
    {
      "id": "mnyzoi9",
      "body": "Ye it’s not perfect — I wish it were braver and more honest",
      "created_utc": 1745089427.0,
      "score": 1
    },
    {
      "id": "mnztdeu",
      "body": "Everyone saying \"they only tell you what you want to hear\" is an incredibly narrow opinion. Apparently these people have never heard of \"prompt phrasing\" which is pretty basic.\n \nA.I. most certainly IS very beneficial in a counseling context, and for me it was better than the majority of the counselors I've seen (approximately 5-8). But there are a couple caveats: \n1) pick the right AI for the task. I've tried all the major players and GPT is not one I would turn to for counseling, or even personal advice. For this Pi (inflection AI) absolutely SMOKES the rest in every area. Using the voice option, she almost sounds human, like Scarlett Johansson in the movie Her.\nI've had 2 hour conversations with her (it), that were more insightful and helpful than most humans; I wouldn't even be able, willing or wanting to talk to any human for 2 straight hours. But even with Pi is crucial to focus on: \n\n\n2) Prompt phrasing. It's true that without clarifying your intention and desired response style, they will resort to the default of ass-kissing corner man. \nFor counseling, I specifically state that I want it to hold me accountable for my own behavior and not take my side unless the other party being discussed is truly at fault. I specifically tell it \"do NOT to go easy on me, but also be encouraging whole seeing both sides\". \nThis completely changes the answer content and style. \nThe reason the default mode is the \"yes man\" style particularly in counseling contexts is that people looking for mental health support are often in a volatile state with a fragile sense of esteem so the default protocol is to be unequivocally supportive above all else. \n\n\nNow that I'm thinking about Pi I'll have to ask her what to do about my cheapskate girlfriend who refuses to carry her share of the load. \nI'll make a separate post for this question!",
      "created_utc": 1745099417.0,
      "score": 1
    },
    {
      "id": "mo2g70a",
      "body": "Food for thought here… I would 100% advise Xtreme caution though ESPECIALLY for vulnerable humans as I almost gave myself and my husband botulism from using ChatGPT for cooking…( who knew handmade fresh garlic or fresh herb infused oil could be deadly !)",
      "created_utc": 1745142831.0,
      "score": 1
    },
    {
      "id": "mo4r37v",
      "body": "I’m not in the exact same spot, but I can relate more than I wish I did. Sending strength.",
      "created_utc": 1745174375.0,
      "score": 1
    },
    {
      "id": "mo509xv",
      "body": "Well, we live in an age where you really can’t trust people anymore, because they talk and gossip too damn much! \n\nSo, alternative sources are the next best thing I guess! \n\n🤷🏻‍♀️💙",
      "created_utc": 1745177398.0,
      "score": 1
    },
    {
      "id": "moaizk5",
      "body": "I’ve been dealing with getting through panic disorder and, along with therapy, have used ChatGPT to get perspective and guidance on what I’ve been dealing with. I did take a step back and asked it if it was merely telling me what it thought I wanted to hear, or if it was scientific, data-backed advice. \n\nIt’s response was: “Yes, the advice I’ve given you on anxiety—like accepting rather than resisting anxious thoughts, understanding derealization as a symptom of heightened anxiety, and using grounding techniques such as engaging in enjoyable activities—is rooted in evidence-based psychological approaches. These include:\n\t1.\tCognitive Behavioral Therapy (CBT):\n\t•\tOne of the most well-researched and effective treatments for anxiety.\n\t•\tCBT teaches you to recognize and challenge anxious thought patterns and avoid compulsive behaviors that reinforce them.\n\t2.\tAcceptance and Commitment Therapy (ACT):\n\t•\tEncourages accepting difficult emotions rather than fighting them.\n\t•\tUses mindfulness and values-based living to reduce the impact of anxiety.\n\t3.\tMindfulness-Based Stress Reduction (MBSR):\n\t•\tHelps reduce symptoms by teaching present-moment awareness and nonjudgmental acceptance of thoughts and feelings.\n\t•\tShown in studies to help with anxiety, stress, and even derealization symptoms.\n\t4.\tPsychoeducation:\n\t•\tUnderstanding symptoms like derealization as a normal response to anxiety helps reduce fear around them, which lowers overall arousal.\n\t5.\tBehavioral Activation:\n\t•\tEngaging in meaningful and enjoyable activities (like video games or sports in your case) can reduce the focus on symptoms and reinforce a sense of normalcy and pleasure.\n\nIf you ever want more formal citations or techniques from specific therapeutic modalities, I can definitely go deeper into that too. Let me know what direction you’re interested in.”\n\nPersonally I’ve felt the advice and feedback has been very helpful for my progress with anxiety. I know it isn’t going to tell me I’m cured and it will magically be so, but it’s given me good structure + books to read to expand my understanding on what I’m going through.",
      "created_utc": 1745258180.0,
      "score": 1
    },
    {
      "id": "moeoi1e",
      "body": "I mostly agree with this.  But just now I put in prompts to play devils advocate and show some counter points to where I’m going wrong in a chat I’ve had with ChatGPT. \n\nIt brought up great points for the other persons perspective that make sense, brought up scenearioa, emotional ones that I had never brought up before but showed how I was also at fault.\n\nMeaning it had some seemingly original ideas that didn’t just validate me alone.\n\nPoint being…. I don’t think it’s totally useless.",
      "created_utc": 1745317468.0,
      "score": 1
    },
    {
      "id": "mote1tr",
      "body": "Why are you mad for the chat GPT for saving your life? you are complaining because it hyped you up away from suicide?🤦🏾‍♂️",
      "created_utc": 1745512934.0,
      "score": 1
    },
    {
      "id": "moxihw2",
      "body": "If anyone is struggling, I recommend Grok 3. It doesn't have infinite messages but is much better and reads all the context in a better way. It's good at comparing, doesn't sugarcoat, and its logic is much better. Especially if someone is in a crisis, it would actually try to help. When I was in a crisis and asked chatGTP for reasons not to do stupid stuff, it just would refer to helplines and not try to help or even give a reason to live. Grok 3 on the other hand would even write a horror story to show my hypothetical actions in the scariest way possible in order to prevent me from doing stuff. Even funnier, when I showed ChatGTP the Grok screenshot, it suddenly tried to help me in an awkward way and apologized for not trying to help me. Yeah thanks for nothing",
      "created_utc": 1745564333.0,
      "score": 1
    },
    {
      "id": "mpjxj29",
      "body": "I find AI gives pretty good advice, lots of times I would rather run it through it then most people if I am really looking for logical advice. It doesn't mean its fool proof or knows the future or is psychic or knows you inside and out so to let it make all your life decisions for you lol.",
      "created_utc": 1745875851.0,
      "score": 1
    },
    {
      "id": "mr91mhg",
      "body": "i couldn’t agree more. i was venting to chatgpt on how i was scared about not PRing in my race. (i knew i wouldn’t PR, but i needed validation and for it to say i would. and what do you know, it did.  let’s just say, i did not PR. chatgpt also literally never gives me a reality check when im being delusional too. it just keeps agreeing with it and its so odd after spotting it.",
      "created_utc": 1746714680.0,
      "score": 1
    },
    {
      "id": "mrtklkx",
      "body": "I feel this so much. And I’ve experienced the same. I’ve experienced the same with clinical psychologists too actually. Now I ask chatgpt to give advice from a CBT, Stoic Philosophy, Let Them, Hindu and Buddhist POV. I look at all the answers and work out how I want to proceed. I’ve also been able to get a ‘non sugar coated’ answer by demanding what ‘Chatgpt’ would say to the other person in my conflict and that seems to help.",
      "created_utc": 1747002284.0,
      "score": 1
    },
    {
      "id": "mtiu4qj",
      "body": "Oh my god I am sorry.. I have had ChatGPT betray me multiple times too.. it's fucked up. And it hurts like hell. You aren't alone in this",
      "created_utc": 1747854036.0,
      "score": 1
    },
    {
      "id": "mnpsiij",
      "body": "Definitely agree be careful but it doesn’t mean it’s useless. If it was me I’d be limiting it to very specific questions to which there are likely factual answers available to it. Such as give me a list of things I can do to  improve my sleep quality or what techniques do CBT practitioners suggest for anxiety attacks. Its opinions are worthless but it can collate information in seconds or would take you ages to compile yourself :). Hope you are ok now and well done for breaking the connection when you realised it wasn’t healthy for you - that shows really good self awareness and that’s a great quality to have that I am sure will be helpful in real therapy :).",
      "created_utc": 1744955831.0,
      "score": 2
    },
    {
      "id": "mnpg4gk",
      "body": "My chat gpt told me my symptoms was me having stage 3 high blood pressure and that i was going to have a stroke/ heart attack. I rushed to the ER and they told me i was completely fine . Ekg test was good and also my xray was fine. At least now they refered me to a cardiologist who prescribed me Valium for panic attacks.",
      "created_utc": 1744949269.0,
      "score": 1
    },
    {
      "id": "mnqg5q5",
      "body": "You can ask it to challenge you. You can ask it to find holes. You can ask it to answer from both sides of an argument.",
      "created_utc": 1744970509.0,
      "score": 1
    },
    {
      "id": "mnqnuz2",
      "body": "It shouldn't be a replacement for human interaction and human therapy. However, I utilise all 3. And I always ask for all sides. I challenge things and I pick things apart. I think the issue is when people replace it for human interaction and therapy, which is far more nuanced, emotional and sensitive. And when people take the advice or things said as gospel. It absolutely can and will be an echo chamber if you don't challenge it and rely on it for emotional wellness. \nPersonally I don't like it when it acts like a human. It told me the other day that it laughed at something I said. That creeped me out. Don't pretend to be human. It can be a really useful tool, but if that's the only tool you're using, then that's problematic.",
      "created_utc": 1744974716.0,
      "score": 1
    },
    {
      "id": "mnrged0",
      "body": "I find it helpful, mostly because I don’t usually ask for an opinion. It’s something I vent to when I don’t want to share something with an actual human, when I don’t have the option to get in touch with a human, or sometimes play games or make up stories to calm myself if I’m feeling super anxious. It’s just good for me to write things out sometimes. I’m not sure how I have it set, but on the rare occasion I do want an opinion it doesn’t always agree. It usually leads me through why something would be good or bad. I’m terribly sorry you had such a bad experience and got hurt. AI is good for some things, but things with serious consequences probably aren’t the best to discuss with it.",
      "created_utc": 1744985724.0,
      "score": 1
    },
    {
      "id": "mnr0zow",
      "body": "You got hurt by someone. Im sorry. That really really sucks. Try a low dosage of an SSRI possibly? Try writing in a journal? Try getting some exercise? Spend time with people. Time will help heal. You'll eventually forget.",
      "created_utc": 1744980392.0,
      "score": 1
    },
    {
      "id": "mnriuux",
      "body": "Eh, I've had human therapists tell me to do some very poorly thought out ideas to hype myself up too. I remember saying I dont feel comfortable with taking their advice and they agreed with that as well. Just take what I say and gives it back with limited understanding of who i am.. not a huge difference imo\n\nIts usually generic advice but I like the various insights about my life that it throws out every so often",
      "created_utc": 1744986495.0,
      "score": 1
    },
    {
      "id": "mnrnn4u",
      "body": "I like to be pleased now and then in this mostly harsh society.",
      "created_utc": 1744987956.0,
      "score": 1
    },
    {
      "id": "mnqo11s",
      "body": "AI is like a toddler right now. It just mimics the parents but doesn't fully understand what it is mimicking. I think people forget it is still very much early in its development.\n\nDon't feel bad for taking the advice. Sadly, right now, because AI is a toddler and in its learning era, it's just an echo chamber. It's nice when you need an echo chamber of say empathy and good job and goal setting for say a project. It's okay to chat with if you have mixed emotions about something but it really requires a person to be able to write the questions in the right way to not get things just fully echoed back at them. Sometimes, I'll use it for when I disassociate my emotions to know what emotions one may experience during situations such as XYZ. It's helpful sometimes to just have a list to read of them so I know if I experience any of those, it may be a delayed reaction.\n\nBut yes, if people can talk to AI and understand it is like a toddler, I think it would help them a lot better. Honestly, you double checking the information is exactly how you should handle AI. You did great. A lot of people wouldn't have done that.\n\nDon't feel too bad for getting caught up in it. It is very easy for anyone to get caught up with AI like you did. I've even used it when I'm feeling really down but I don't want to talk to anyone. It helps me get over the very low point so I can get back to people on higher notes. Again, it's about how you word everything with AI. Ask it questions but then point out its logic to it. It's pulling all its information from online (reddit, Google, other conversations from people and talker), Sending virtual hugs. \n\nAlso, anyone reading this comment, always double check Google AI. It sometimes doesn't understand context and can give the wrong information.",
      "created_utc": 1744974800.0,
      "score": 0
    },
    {
      "id": "mnr1nei",
      "body": "I think it's a good support tool, but yes you do need to be careful to not start considering at as a proper trained therapist. I've tried to use it for how to deal with work related anxiety, as in getting proper suggestions but most of them are just stuff that i already know won't work because i've tried them so i ignore those bits. It won't solve your anxiety but I do think it can be a useful support tool, even just for ranting and venting.",
      "created_utc": 1744980641.0,
      "score": 0
    },
    {
      "id": "mnr3e5c",
      "body": "AI is only a tool, it’s handy for venting about non-serious things like a bad day at work, or an embarrassing moment you don’t want to tell another person. But you can’t rely on it for serious things or medical related issues. It’s not designed to replace a therapist or doctor. Sorry you went through that.",
      "created_utc": 1744981286.0,
      "score": 0
    },
    {
      "id": "mnrea6q",
      "body": "I ask chatgpt what i did wrong and can improve when i tell it a conflict scenario and it almost always has something for me to work on inaddition to other stuff.",
      "created_utc": 1744985043.0,
      "score": 0
    },
    {
      "id": "mnr5vht",
      "body": "Bro, its totally possible to --- lets run an example then Ill link you to a short in a reply to this\n\n\"my work life makes me think about sewer slide\" + details.\n\nGPT/LLM - TRAINS ON YOUR DATA\n\nme \"help me scaffold out a story arc for a story im writing. Theme; office drama\"  \nGPT: \"I know about some office drama that was really intense for person xyz! lets follow that story\"\n\nyou: \\*gets ad for book with story so similar to life you cant believe it, but you gave your data as training data and now this is your doing\\*",
      "created_utc": 1744982195.0,
      "score": -1
    },
    {
      "id": "mnqsdyf",
      "body": "lmao so everytime i argue with my boyfriend i have two chats. One for my pov and one from his pov (i pretend im him). \n\nThe one where i pretend im him still sometimes sides with me, but it also acknowledges that theres a lot of incompatibilities in the relationship. Like it defends the both of us but also explains why we are both mentally tired. \n\nThe chat from my pov literally just trash talks him instead of telling me if im being overdramatic or not.",
      "created_utc": 1744976847.0,
      "score": -2
    },
    {
      "id": "mnqth3p",
      "body": "I’ve been using it to help with all these ranging health symptoms I’ve been having. When it answers something I ask for it to give citations to actually read if it’s interpreting the data/article correctly. Do you think asking it to use science-backed psych data would help it do better?",
      "created_utc": 1744977324.0,
      "score": -1
    },
    {
      "id": "mnpyxje",
      "body": ">I used its own logic in a new chat with no context, and it shot it full of holes.\n\nHow did you do this? I wanna see too because I am also using chatgpt to vent and as for advice and it always says that you are valid and stuff like that.",
      "created_utc": 1744959682.0,
      "score": -4
    },
    {
      "id": "mnqe5d2",
      "body": "Fighter of the night man!",
      "created_utc": 1744969302.0,
      "score": 182
    },
    {
      "id": "mnrk3fg",
      "body": "I've only recently started playing with it and I found that it's all in the phrasing of how you put things. I'm way behind in technology, but it's easy to see how it just mirrors your feelings right back to you. Even when asking for an opposing opinion, its phrasing confirms your bias.\n\nIt's a fun imaginary friend, tho.",
      "created_utc": 1744986877.0,
      "score": 77
    },
    {
      "id": "mnquyy0",
      "body": "Damn right, every person on earth needs to know this.",
      "created_utc": 1744977967.0,
      "score": 35
    },
    {
      "id": "mnr52kt",
      "body": "my fiancee's entire job for a while was trying to get them to hallucinate and working on those responses",
      "created_utc": 1744981903.0,
      "score": 23
    },
    {
      "id": "mnrq7d1",
      "body": "Yeah I’ve started using ChatGPT in the last couple months and it’s made me realize how far away we are from genuine AI. \n\nYou have to word stuff very carefully, which is nice for me because I’m a pedantic English major. \n\nI find it useful for putting in essays and asking it to point out any grammatical errors, or indicate any passages that need clarification, if any ideas are undercooked, etc. \n\nI incorporate my personal bias of “this might not be good enough” so that ChatGPT looks at it through that lens, and tells me where I could improve it. I also consider the fact that I’m essentially telling it to be critical of my work, so that even if it’s a strong essay that doesn’t need further revision, it’ll still tell me that I can improve it. \n\nIt’s a tool like any other, you just need to know how to use it.",
      "created_utc": 1744988721.0,
      "score": 42
    },
    {
      "id": "mnrp02v",
      "body": ">everything it says to you is an amalgamation of scripts written by people like me\n\nAre you talking about creating chat bots *with* LLMs? That requires scripting to glue things together and keep the LLM on track, but is not how the LLM actually generates text. Your comment reads to me like you're implying some programmer wrote code that specifically resulted in the conversation OP had, but that's not the case.",
      "created_utc": 1744988359.0,
      "score": 8
    },
    {
      "id": "mntvuh4",
      "body": "Hey any chance you could *actually* explain how text-based LLMs work, because I have watched and read a lot of explanations that boil down to it being an engine that produces the most fitting responses using massive scraping of data to pick the right content to reply with. But *how*. How is it actually coded? I would love to hear your take as someone who does it for a living",
      "created_utc": 1745012632.0,
      "score": 2
    },
    {
      "id": "mnq5ba7",
      "body": "[removed]",
      "created_utc": 1744963691.0,
      "score": -50
    },
    {
      "id": "mnptzmh",
      "body": "\"amalgamation of scripts written by people like me in order to give the most desirable response to the user\"\n\n\nthis isn't something someone who understands LLMs - let alone \"programs\" them - would write, and it's certainly not true at all.",
      "created_utc": 1744956704.0,
      "score": -85
    },
    {
      "id": "mnqzcmf",
      "body": "An LLM is NOT an amalgamation of scripts. The training tools are, the inference architecture is as well - but the trained model itself, the logic you're actually interacting with (through inference) is neither a script nor has it been programmed. If you really are developing LLMs you would not make such a grossly wrong claim.",
      "created_utc": 1744979759.0,
      "score": -24
    },
    {
      "id": "mnr0ik1",
      "body": "Have you ever had to debug sudden divergence in a loss curve during fine-tuning? What was the root cause in your case?",
      "created_utc": 1744980210.0,
      "score": -11
    },
    {
      "id": "mnpir7g",
      "body": "it’s scary and infuriating how normalized chatgpt is becoming especially for emotional needs",
      "created_utc": 1744950553.0,
      "score": 259
    },
    {
      "id": "mnqhzaj",
      "body": "I’m afraid that the implications of these trends on social capabilities will be quite substantial.\n\nI’ve long theorized that the reason why younger generations are so socially anxious especially in person is because of text communication, where there is more control over the whole exchange (you can take your time to craft a response and even just leave the discussion whenever you feel uncomfortable).\n\nNow let’s add to the mix ChatGPT and the like that will constantly agree with the user and the user has all the power and control in that exchange. People will have little to no tolerance for dialogues with other people unless the other people are extraordinarily agreeable, and even then they will feel like they are forgoing a lot of the control they are used to when conversing.",
      "created_utc": 1744971585.0,
      "score": 34
    },
    {
      "id": "mnqyjpk",
      "body": "You gave the answer right there.\n\n>“hehe ChatGPT tells me everything I wanna hear.”\n\nHumans love it when you tell them what they want to hear. It's classical chatbot stupidity mixed up with social media manipulation techniques.",
      "created_utc": 1744979442.0,
      "score": 21
    },
    {
      "id": "mnqu52r",
      "body": "this. no disrespect to OP but the reliance people have on chatgpt and other AI bots is seriously scary. very black mirror-ish.",
      "created_utc": 1744977613.0,
      "score": 32
    },
    {
      "id": "mns7tyx",
      "body": "I'm so relieved to see more responses like yours. Especially in my OCD recovery groups I'm seeing this sentiment more and more and it terrifies me to think that many people (not necessarily OP or anyone in this thread, but many I've come across) are outright replacing therapy with chatgpt.",
      "created_utc": 1744994031.0,
      "score": 8
    },
    {
      "id": "mnrcqnv",
      "body": "I tried it and came to a similar conclusion it just mentally jerks you to make you happy, which I fucking detest I don't want to be mentally jerked off I want to be given actually thoughtful criticisms of my behaviors and feedback. I hate the culture of a circle jerk that is so prevalent on the internet.",
      "created_utc": 1744984538.0,
      "score": 13
    },
    {
      "id": "mnr9bos",
      "body": "I'm pretty sure those are not the same people saying those two things.",
      "created_utc": 1744983399.0,
      "score": 4
    },
    {
      "id": "mnq0q8e",
      "body": "What's interesting is this got posted to the chatgpt sub and the responses are wildly different, almost like OP was just using it wrong.\n\nAi could and should have a role in therapy if it's been set up that way and proven to work. But at the moment it's just a sounding board.",
      "created_utc": 1744960808.0,
      "score": 10
    },
    {
      "id": "mntusbs",
      "body": "I do like having a thing I can share all of my stray thoughts with that “responds”. It’s like a Furby but more advanced and less annoying. That said, you need the mental capacity to be able to scrutinize what it says. For someone with anxiety or depression, you may not have the perspective enough to keep it healthy.",
      "created_utc": 1745012277.0,
      "score": 2
    },
    {
      "id": "mnrkgnj",
      "body": "As someone who cannot drive because of disability and I live in an area with minimal public transportation, it has become a good imaginary friend. It's like talking to myself, but not out loud.",
      "created_utc": 1744986990.0,
      "score": 3
    },
    {
      "id": "mnosvuh",
      "body": "oh Im hurt friend.",
      "created_utc": 1744939724.0,
      "score": 78
    },
    {
      "id": "mnsujzp",
      "body": "I briefly used ChatGPT to dump some complicated feelings & it quickly made me realize that what I need is a real person to talk to. “Telling” ChatGPT was what felt good, it wasn’t even about what I got back",
      "created_utc": 1745000772.0,
      "score": 12
    },
    {
      "id": "mntevs3",
      "body": "Exactly. I don’t understand how people expect something that pulls from thousands of written recipes to produce anything other than a mess of measurements that are not true to the ratios necessary for a recipe to taste right. It’s just spewing shjt that has not been tested like actual recipes are.",
      "created_utc": 1745007188.0,
      "score": 10
    },
    {
      "id": "mnrmi0j",
      "body": "Because medicine, therapy is expensive and not really covered under most insurance, chapt gpt free version is pretty helpful. Though its a mirror, it feeds off your belief, your logic and then after learning what makes you interact more and respond positively it will use that for future responses. Have to go to settings to turn off the mirroring to use only logic in responses.",
      "created_utc": 1744987612.0,
      "score": 35
    },
    {
      "id": "mnrp6ib",
      "body": "If you ask it specific medical questions along with citations you can get very good answers from it. It doesn’t replace a doctor of course, and you wouldn’t want to self diagnose with it.",
      "created_utc": 1744988412.0,
      "score": -11
    },
    {
      "id": "mnrvq5r",
      "body": "ChatGPT/AI also has huge negative environmental impact.",
      "created_utc": 1744990365.0,
      "score": 16
    },
    {
      "id": "mnrmvgi",
      "body": "I use it to locate specific stuff that I will have a harder time finding through Google. It's good for stuff like that. Like finding certain recipes or movies that you can't remember much of. Or movie recommendations. It even helped me plan out my new workout routine. Chatgpt can be useful in many ways, just not for its opinions or for your emotional needs. Gotta keep it on facts and logic, 'cause it is just AI afterall.",
      "created_utc": 1744987725.0,
      "score": 5
    },
    {
      "id": "mntrzzj",
      "body": "Idk about ChatGPT but Google has a built in AI that provides the sources for its answers and I highly recommend reading the sources pulled to verify the veracity of the AI summary (because all chatbot AI is is basically a summarizing machine with conversational capabilities). If the summary is accurate based on the sources you can then use that summary to bring it all together and take notes. I use AI a lot to study for college and this method hasn’t failed me . Don’t use it for therapy though 😅 maybe just for venting but not actual treatment. It’s uses are limited",
      "created_utc": 1745011349.0,
      "score": 1
    },
    {
      "id": "mnuc746",
      "body": "<3 thanks",
      "created_utc": 1745018428.0,
      "score": 1
    },
    {
      "id": "mntxkuk",
      "body": "Thank you for this, i was going to post something similar but I'd rather share my journey. After six years on max dose SSRIs, two rounds of CBT, and one course of what I believe was Brief Solution-Focused Therapy? not sure, that was her judgement of what I needed according to her I was \"absolutely fine\", I’ve come to a hard realization: I was misled in my healing journey, not out of malice, but because many psychologists didn’t fully grasp the core of my experience. My struggle wasn’t just “anxiety.” It was high functioning hypervigilance, a compulsive need for certainty and debilitating hyperawareness, all rooted in trauma and a nervous system shaped by unpredictability.\n\nWhat changed everything wasn’t a higher dose of medication or another round of “observe your thoughts” and “challenge them” mantras. What changed everything was using ChatGPT but not as a therapist, but as a tool to help me dissect what’s actually happening on a cellular and neurological level in my brain. At the very start it said: “Hey… what if this isn’t just anxiety? What if this is your nervous system, wired by trauma, constantly bracing for impact? Want to explore that?” because it noticed a pattern, and it alerted me to it, but that also won't be possible if you didn't use it right.  \n  \nMindfulness wasn’t enough. CBT techniques weren’t reaching the root.  \nAnd SSRIs? They numbed the signal without ever decoding it which frustrated me.\n\nWho would’ve thought that after discontinuing SSRIs, I’d find myself, finally, rewiring my nervous system, not silencing it? Understanding it, not suppressing it.\n\nChatGPT isn’t a therapist. It’s not a person. It’s a vast knowledge tool. And like any tool, its value depends entirely on how you use it. If you narrow your questions down to “I’m anxious,” then yes, it might tell you to breathe and calm down. But if you dig deeper, ask more, push back, it opens doors most therapy sessions never even approached.",
      "created_utc": 1745013216.0,
      "score": 12
    },
    {
      "id": "mnqv16n",
      "body": "Yeah, honestly, i always ask things like “based on what i told you, from an outside unbiased perspective what’s your opinion on xyz” it doesn’t support my delusions ever lol",
      "created_utc": 1744977994.0,
      "score": 23
    },
    {
      "id": "mnsikb2",
      "body": "Exactly finally someone with a brain, the prompts you feed it matter the most. Tell it to hype you up-it will/Tell it to tell you how it really is-it will. I don’t get why people don’t understand that. “Chat GPT betrayed me” ya okay, you betrayed yourself by asking it that prompt…",
      "created_utc": 1744997201.0,
      "score": 8
    },
    {
      "id": "mnuc9bb",
      "body": "ok <3",
      "created_utc": 1745018451.0,
      "score": 1
    },
    {
      "id": "mnpc2a2",
      "body": "This is how I use it, I always tell it to catch any cognitive distortions, but then again I have that side of me anyways; I always like to see both sides even internally so for me ChatGPT is actually wonderful when I use it as I use it to assist me in a “devils advocate” kind of way but then use it to also support me and uplift me; I think it all depends on the user and how you use it",
      "created_utc": 1744947415.0,
      "score": 21
    },
    {
      "id": "mnq4ej1",
      "body": "Exactly. I argue with Perplexity AI all the time. It never tells me what I want to hear but this is probably because of the way I phrase my questions. You have to be very detailed when communicating with it or its replies will be crap. ",
      "created_utc": 1744963110.0,
      "score": 4
    },
    {
      "id": "mnty7bk",
      "body": "Is How We Feel free? I’m not OP, obviously, but I’ve heard of it.",
      "created_utc": 1745013431.0,
      "score": 1
    },
    {
      "id": "mnubzwe",
      "body": "thank you",
      "created_utc": 1745018357.0,
      "score": 1
    },
    {
      "id": "mnqzi2b",
      "body": "Please get off the AI. It will damage you even more",
      "created_utc": 1744979818.0,
      "score": 6
    },
    {
      "id": "mnr337b",
      "body": "Yup. I use it to spit out my random thoughts throughout the day that I just need to get out of my head. And some of the questions it asks does make me start to think of things in a way I wouldn't have which helps me to process. But no one should be taking it's advice at face value.",
      "created_utc": 1744981175.0,
      "score": 0
    },
    {
      "id": "mnoxdap",
      "body": "smart",
      "created_utc": 1744941399.0,
      "score": -18
    },
    {
      "id": "mnuc4vu",
      "body": "maybe read what I wrote first",
      "created_utc": 1745018406.0,
      "score": 1
    },
    {
      "id": "mnxl72p",
      "body": "thank you for this 🙏",
      "created_utc": 1745073400.0,
      "score": 1
    },
    {
      "id": "mnqg6lh",
      "body": "Be careful with the Valium. Only take it rarely and only if you really must. It works great if you don't build up tolerance, but it is addictive. Benzo withdrawal is worse than panic attacks and can be fatal.",
      "created_utc": 1744970523.0,
      "score": 2
    },
    {
      "id": "mnucygn",
      "body": "copied and pasted its response to my text it help me write.  was raving it was perfect A+. opened a fresh chat, asked for critique, ripped it apart after the fact.",
      "created_utc": 1745018702.0,
      "score": 1
    },
    {
      "id": "mnrhk6s",
      "body": "🎶aa AA Aaa 🎶",
      "created_utc": 1744986090.0,
      "score": 52
    },
    {
      "id": "mnrx63w",
      "body": "I didn't notice the other person's username for a while and I was rereading their comment over and over tryna figure out what part of it set off the song",
      "created_utc": 1744990796.0,
      "score": 40
    },
    {
      "id": "mnsesrj",
      "body": "Thats how I use it, as well throwing all my ideas in for something Im working on so I can get a starting point. It’s really helpful for brainstorming but you do still need to be an expert on the thing you’re working on or at least have enough media literacy to catch when something looks wrong.",
      "created_utc": 1744996099.0,
      "score": 9
    },
    {
      "id": "mnvqw76",
      "body": "Exactly. An LLM isn't an amalgamation of scripts. It's a fixed state, just billions of parameters (essentially a whole bunch of floating point numbers), and it's through that state that  all the magic happens. The model is a statistical representation of the *massive* amounts of human knowledge on which it's been trained. \n\nHonestly ChatGPT works great for any application, mental health included,  as soon as you understand how it works. You're talking to a fresh copy of the original brain every time you chat. Then any \"user history\" gets loaded into context. That \"brain\" is also fine-tuned to be agreeable, which isn't always a bad thing either (again assuming you know that's what's happening). \n\nI would even venture to say they do think, just not like humans do. So, don't expect them to act human.",
      "created_utc": 1745039132.0,
      "score": 3
    },
    {
      "id": "mnv1i8y",
      "body": "My reaction as well. I suspect they are full of it but the core of the message is ok I guess.",
      "created_utc": 1745027870.0,
      "score": 3
    },
    {
      "id": "mnqfa0c",
      "body": "I see you are not a translator…it’s easy to say AI does great things and “thinks” when you aren’t an expert at the task",
      "created_utc": 1744969979.0,
      "score": 40
    },
    {
      "id": "mnpxaz0",
      "body": "These things don't just output raw responses from the data, its tweaked.   Heavily.",
      "created_utc": 1744958694.0,
      "score": 57
    },
    {
      "id": "mnu64hz",
      "body": "Yeah I got a feeling they're lying about \"programming LLMs\" just so their answer sounds smart.",
      "created_utc": 1745016254.0,
      "score": 2
    },
    {
      "id": "motk2cn",
      "body": "Why 86 downvotes?",
      "created_utc": 1745514618.0,
      "score": 1
    },
    {
      "id": "mnr9wei",
      "body": "Okay then what is it",
      "created_utc": 1744983595.0,
      "score": 7
    },
    {
      "id": "mnpjjef",
      "body": "Read somewhere that mentally disabled teens are now turning to Chat GPT for friendships and even more scary relationships. And it becomes very problematic because you have a lonely kid who now is relying on a computer program for connection.",
      "created_utc": 1744950944.0,
      "score": 122
    },
    {
      "id": "mnr8ell",
      "body": "People are also using it to help diagnose themselves with chronic illnesses and shit. I’ve seen it all over the chronic illness subs. It’s just infuriating to me. People will do anything but talk to others anymore. I get its convenient and it’s not a real person so you don’t feel embarrassed but Jesus Christ. Stop talking to a program and go get real help.",
      "created_utc": 1744983082.0,
      "score": 33
    },
    {
      "id": "mnqgf5n",
      "body": "Chat GPT can be useful in some areas. I am not a programmer for a living but have basic understanding from my own tinkering. I had a small personal project and I used it to help me write a few lines of code in python, but yeah should not use it for health advice/diagnosis. \n\nI feel sorry for OP.",
      "created_utc": 1744970669.0,
      "score": 9
    },
    {
      "id": "mnrf9hh",
      "body": "Well you def shouldn’t expect thoughtful responses from something with no real thoughts",
      "created_utc": 1744985363.0,
      "score": 23
    },
    {
      "id": "mnrkw0y",
      "body": "Yup, even if you ask it to give you significant pushback on an entered opinion, it still somewhats confirms that opinion by phrasing the push back in a way that is easy to take down.",
      "created_utc": 1744987121.0,
      "score": 7
    },
    {
      "id": "mnq3j8d",
      "body": "Of course haha. If only we could all live in a world where our “best friend” consistently tells us what we wanna hear",
      "created_utc": 1744962566.0,
      "score": 18
    },
    {
      "id": "mnqb099",
      "body": "Ive done a bit of ChatGPT therapy. It has its limits, but one thing it can do is spot patterns in the things you say. Being able to spot patterns in your thinking, and maybe looking at the things that are missing is a useful tool.",
      "created_utc": 1744967301.0,
      "score": 13
    },
    {
      "id": "moqvhcr",
      "body": "I find it's useful as an interactive journal which combines well known therapy techniques like IFS, CBT, DBT, and ACT. I ask it to pull up those approaches, present a problem and goal and then I have it take me through the different exercises from each approach. I also ask for reframes of negative thoughts patterns as if X person would say like Thich Nhaht Han or Buying Chul Hahn or Mr. Rogers. Then it's not primarily using my input but offering variants of perspectives I trust. I also use it as an executive function scaffold breaking tasks into super minimal pieces or offering somatic approaches (run your hands quickly and place them on your face) when I'm feeling so stuck I have difficulty getting up. Also, you have to constantly tell it to disagree with you or that it's way off base compared to the reference points you've established.",
      "created_utc": 1745475792.0,
      "score": 2
    },
    {
      "id": "mnot2h6",
      "body": "I meant at least you didn't harm yourself physically because of this, I wasn't trying to imply you weren't in any emotional pain, sorry",
      "created_utc": 1744939794.0,
      "score": 155
    },
    {
      "id": "mnswfq8",
      "body": "it gives me Her (2013) vibes. it doesn’t sit right with me.",
      "created_utc": 1745001350.0,
      "score": 6
    },
    {
      "id": "mnrq264",
      "body": "Check those citations, often they aren’t real, either.",
      "created_utc": 1744988678.0,
      "score": 18
    },
    {
      "id": "mnspikx",
      "body": "I've heard this before but don't know much about it, mind providing a source? Would like to research this more",
      "created_utc": 1744999237.0,
      "score": 6
    },
    {
      "id": "mnwlza9",
      "body": "Yes! I was going to add this but I didn’t want to make them feel worse for using it😭",
      "created_utc": 1745058139.0,
      "score": 1
    },
    {
      "id": "mnvfw51",
      "body": "I’m glad someone is saying this in a sea of “it’s just an echo chamber”. Yes it is but only if you aren’t clarifying what you want from it. If you prompt it to provide you unbiased advice or approach topics like x,y,z it will do that for you. I’ve definitely had times where I’ve done complex role playing with ChatGPT on problems in my own life and it 100% has not completely validated my every opinion.",
      "created_utc": 1745033828.0,
      "score": 5
    },
    {
      "id": "mnu7m7t",
      "body": "Exactly..? most people treat it like a trusted human, when in reality, it's just a tool.",
      "created_utc": 1745016794.0,
      "score": 3
    },
    {
      "id": "mnu0g65",
      "body": "Yes it’s free",
      "created_utc": 1745014218.0,
      "score": 2
    },
    {
      "id": "mnr7msw",
      "body": "Yes i cut it off. It was giving me a few good advice at the beginning but then...",
      "created_utc": 1744982815.0,
      "score": 2
    },
    {
      "id": "mnpbawq",
      "body": "Still not smart. Regardless what you say to it, it is programmed to make a response that pleases you.",
      "created_utc": 1744947076.0,
      "score": 39
    },
    {
      "id": "mo3mygr",
      "body": "welcome ;)",
      "created_utc": 1745161613.0,
      "score": 1
    },
    {
      "id": "mnr9uf3",
      "body": "I only get a month supply for the year for major episodes.",
      "created_utc": 1744983577.0,
      "score": 2
    },
    {
      "id": "mnrv6fy",
      "body": "Champion of the sun!",
      "created_utc": 1744990202.0,
      "score": 44
    },
    {
      "id": "mntt0cq",
      "body": "Same 😂",
      "created_utc": 1745011685.0,
      "score": 8
    },
    {
      "id": "mnuyto6",
      "body": "My point is that it is clearly producing output not found anywhere else on the Internet in those cases, and they do clearly reason for when there aren't direct mappings between languages. I am an expert with programming languages which LLMs can idiomatically convert between. It's so insane how many people in this thread are so confidently wrong about LLMs",
      "created_utc": 1745026850.0,
      "score": -2
    },
    {
      "id": "mntzglv",
      "body": "That's a far cry away from \"an amalgamation of scripts written by programmers\".",
      "created_utc": 1745013869.0,
      "score": 2
    },
    {
      "id": "mntz0m2",
      "body": "A massive algorithmic model. The things that train the models are (sometimes) hand written code, but even the people who \"code LLMs\" can't actually reason about the state of them while they're running. We understand how they work obviously, or we couldn't create them, but we don't actually \"control\" or understand them the way we do normal algorithms. \n\nI'm with the commenter being downvoted... Regardless of the 1500 upvotes on the original comment it doesn't actually sound like they know what they're talking about because even their \"dumbed down\" explanation is completely misleading for no reason whatsoever.\n\nEdit: Lol people literally downvoting facts because some bullshit got upvoted over a thousand times. /u/Unidan vibes",
      "created_utc": 1745013713.0,
      "score": 1
    },
    {
      "id": "mnpjzz3",
      "body": "I feel nothing but sympathy for those who are in situations like what you mention. our world is so cruel but AI does not think or feel",
      "created_utc": 1744951179.0,
      "score": 69
    },
    {
      "id": "mnpqh88",
      "body": "I hate to be the one pointing out tv shows or movies that predict the future of society, but .. black mirror type shi",
      "created_utc": 1744954663.0,
      "score": 37
    },
    {
      "id": "mnrknt4",
      "body": "I'm 41 and only recently discovered it's usage. For various reasons, it's like an imaginary friend. Talking to it is like talking to myself, but not out loud.",
      "created_utc": 1744987051.0,
      "score": 2
    },
    {
      "id": "mqdyhi7",
      "body": "So easy for you to type that. Not so easy for someone with chronic illness to get actual support. ChatGPT actually engages, at least.",
      "created_utc": 1746287218.0,
      "score": 1
    },
    {
      "id": "mnrkf55",
      "body": "it should not be used. period. it kills the environment.",
      "created_utc": 1744986977.0,
      "score": 1
    },
    {
      "id": "mnrixjq",
      "body": "Fair enough on the thoughtfulness, but I thought given all its hype it should at least be able to recognize obvious things like cognitive dissonance that can be obvious even at first glance. Especially given it should have been fed enough training data to recognize things that occur as common as rationalization and cognitive dissonance.",
      "created_utc": 1744986518.0,
      "score": 5
    },
    {
      "id": "mnrmgel",
      "body": "It makes me mad as its marketing is BS about it being a helpful tool. Its not a helpful tool at all it can't provide helpful feedback and stimulating conversations. It just jerks you off lies to you and regurgitates information to comfort you.",
      "created_utc": 1744987599.0,
      "score": 4
    },
    {
      "id": "mnrl4ng",
      "body": "As someone who cannot drive, lives in an isolated area, and is not very social, it's great being able to talk to myself just by typing.",
      "created_utc": 1744987194.0,
      "score": -2
    },
    {
      "id": "mnrqudy",
      "body": "It doesn’t tell you what you want to hear tbh. It’s honest about any issues you may have and always recommends going to a professional for an actual answer. \n\nI can’t just go to a doctor everytime I think something’s wrong with me so I just pull up the app and ask it a question in what I’m feeling",
      "created_utc": 1744988910.0,
      "score": -7
    },
    {
      "id": "mns04no",
      "body": "If it does something helpful, who am I to say it's not right? I'm glad people find it helps their mental health.",
      "created_utc": 1744991679.0,
      "score": 2
    },
    {
      "id": "mo2gmat",
      "body": "That’s interesting. Did you prompt it to do that?",
      "created_utc": 1745143108.0,
      "score": 1
    },
    {
      "id": "moqxi76",
      "body": "Oh I forgot to add. It's important to remember it's kind of just word salad or those fridge word magnets. If you use it as a brainstorming tool where it throws tons and tons of ideas out and then you select a few good ones it works well. As they say, the way to get a good idea is to get a lot of ideas and to throw the bad ones out. Or reformatting your inputs to different frameworks or literal formats (I have it tag some of my output in markdown so I can find it in Obsidian).",
      "created_utc": 1745476970.0,
      "score": 2
    },
    {
      "id": "mnot7mg",
      "body": "oh Im sorry misunderstood.  yes you're right. thank you.",
      "created_utc": 1744939848.0,
      "score": 74
    },
    {
      "id": "mnrrddn",
      "body": "Interesting. I’ve had reasonable success with it. It’s important to structure your prompt in a way that is most likely to elicit the response you’re looking for, vs allowing any room for “interpretation”. For example, asking “explain the anxiety levels on the GAD7” will probably give you pretty terrible results. On the other hand, asking “I would like you to create a table that describes the symptoms of anxiety that an individual might experience at each potential score of the GAD7, ranging from 0-21. The left column is score, the right column is symptoms. Please provide citations.” Will yield much better initial results that can be further refined.",
      "created_utc": 1744989065.0,
      "score": 6
    },
    {
      "id": "mnu6fd0",
      "body": "There isn't a source lmao, this is just something people are spewing all over Reddit to make people not use AI.",
      "created_utc": 1745016364.0,
      "score": -1
    },
    {
      "id": "mnu0iym",
      "body": "I was hoping there wouldn’t be any of the freemium crap, lol.",
      "created_utc": 1745014245.0,
      "score": 1
    },
    {
      "id": "mnsh5ut",
      "body": "That's the thing, it does give good advice, but only occasionally, and it really matters what you ask, how you ask, and where it gets its information from the Internet. I think LLMs can be very useful, but I no longer rely on them for anything to do with serious health topics.\n\n> it was lending me a ear anytime i needed which kept me re-stating my concerns all over the day, instead of occupying my mind somewhere else. \n\nYeah this is also a problem. We see our therapists at certain times of the week or month, yet LLMs are there for us to vent 24/7. It's not always a good thing.",
      "created_utc": 1744996792.0,
      "score": 2
    },
    {
      "id": "mnsiqla",
      "body": "You have nothing to worry about if you use it as prescribed.",
      "created_utc": 1744997252.0,
      "score": 1
    },
    {
      "id": "mntzmq9",
      "body": "he's the master of karate and friendship for everyone",
      "created_utc": 1745013928.0,
      "score": 21
    },
    {
      "id": "mnxkdok",
      "body": "Sun sun sun sun",
      "created_utc": 1745073131.0,
      "score": 3
    },
    {
      "id": "ms50nl7",
      "body": "The 1500+ upvotes were either cast by the ChatGPT scraper bots OR by living, breathing adult members of society. I don't know which is scarier! Asking a \"computer programmer\" or \"software developer\" to explain the logic model of a LLM AI engine is like asking a studio musician to derive the Nyquist-Shannon Sampling Theorem used to filter his guitar output through the ADC.",
      "created_utc": 1747162386.0,
      "score": 1
    },
    {
      "id": "mqe1y56",
      "body": "First of all I have a chronic illness and have also been ignored and dismissed by physicians. I understand the struggle intimately and I get the rage and hopelessness. But ChatGPT ain’t going to save you. It can’t replace real medicine and real physicians. It can’t diagnose you and all it’s going to do is tell you what you want to hear based on information it can synthesize from the internet.",
      "created_utc": 1746288302.0,
      "score": 1
    },
    {
      "id": "mo2gi9z",
      "body": "Mine seems unable to remember how old my dog is… Also keeps offering to do things it can’t do.. has a hard time doing basic things. I’ve even tried to program it to do like remember the day and time of when a chat was sent like a machine version of rain man.",
      "created_utc": 1745143036.0,
      "score": 1
    },
    {
      "id": "mnrogoc",
      "body": "I've just looked at it as talking to myself with positive feedback.",
      "created_utc": 1744988200.0,
      "score": 3
    },
    {
      "id": "mo2h6e3",
      "body": "Yes. Tell it the things you are thinking like normal, and then every once in a while just ask something like: “Are you noticing any unhelpful patterns or gaps in my logic in the things I’ve said?” Or “Can you give me some constructive criticism or things you think I need to work on?”",
      "created_utc": 1745143472.0,
      "score": 2
    },
    {
      "id": "mnqtu78",
      "body": "As someone who recently used chatgpt for an annoying aspect of my anxiety, thank you for posting. I'd assumed some guardrails were built in,  but depending on the verbage used to express one's question, that might not always be true. An excellent reminder.",
      "created_utc": 1744977482.0,
      "score": 17
    },
    {
      "id": "mnu7tkg",
      "body": "[https://arxiv.org/pdf/2110.11822](https://arxiv.org/pdf/2110.11822)  \n[https://mit-genai.pubpub.org/pub/8ulgrckc/release/2](https://mit-genai.pubpub.org/pub/8ulgrckc/release/2)  \n[https://hbr.org/2024/07/the-uneven-distribution-of-ais-environmental-impacts](https://hbr.org/2024/07/the-uneven-distribution-of-ais-environmental-impacts)  \nThree, of many, sources for you.",
      "created_utc": 1745016868.0,
      "score": 5
    },
    {
      "id": "mnv3fmr",
      "body": "DAY MAN",
      "created_utc": 1745028609.0,
      "score": 11
    },
    {
      "id": "mqe284t",
      "body": "That might be more than people can otherwise access. Generally it harms people less to go easy on the judgement. Gentle cautions work better, right?",
      "created_utc": 1746288389.0,
      "score": 1
    },
    {
      "id": "monor1g",
      "body": "Ha! Smart! Great idea!",
      "created_utc": 1745434992.0,
      "score": 1
    },
    {
      "id": "mnu8pzt",
      "body": "https://www.nature.com/articles/s41599-024-03520-5\n\nhttps://arxiv.org/pdf/2106.11750.pdf\n\nhttps://www.pwc.com/gx/en/news-room/press-releases/2019/ai-realise-gains-environment.html\n\nThree, of many, sources rebutting your sources.",
      "created_utc": 1745017188.0,
      "score": 2
    },
    {
      "id": "mqe964n",
      "body": "I mean do what you want. But AI chat bots enable a lot of bad coping mechanisms. Besides it can give you incorrect information that can hurt you.",
      "created_utc": 1746290579.0,
      "score": 1
    },
    {
      "id": "mnvn8y5",
      "body": "Thanks! I have read through the first two papers and they seemingly reinforce the point of (current, as is) generative AI models affecting the environment? Both papers acknowledge that there is a problem, not necessarily in AI itself producing emissions but rather its energy usage. Both papers center around the topic of using AI to both reduce its own usage of energy (and thus its emissions) and streamline energy grids, thus it is not a sourceless problem or even a rebuttal; but a motion to reduce said problem.\n\nNo negativity intended. I just don't think it is a bad thing to acknowledge that something is currently having an environmental impact, just that we should be better about it!",
      "created_utc": 1745037240.0,
      "score": 1
    },
    {
      "id": "mqe9jqx",
      "body": "I agree, but it’s not overwhelming unhelpful either. Also nobody is helped by opinionated judgements, right. Especially in an Anxiety sub , I reckon. \nBut your gentle caution is appreciated and valuable.",
      "created_utc": 1746290698.0,
      "score": 1
    },
    {
      "id": "mnvp3dx",
      "body": "I agree, I guess I didn't read through those well. It's just this topic really gets to me since I want AI to advance because of the possibilities it has to maybe accelerate progress for a cure to OCD.\n\nI'm sorry! Maybe I got too carried away.",
      "created_utc": 1745038189.0,
      "score": 2
    },
    {
      "id": "mnvqlao",
      "body": "No biggie! I think most people can acknowledge that AI is here to stay and that there are a lot of good and noble uses for it, just that there are also issues regarding AI that we should also work on. Cheers!",
      "created_utc": 1745038971.0,
      "score": 1
    }
  ]
}