{
  "id": "1ifo6up",
  "title": "Any other Americans here feel like they’re on the verge of constant panic attacks since the inauguration?",
  "selftext": "I’m a woman. I’m a person of color. I have chronic pain and autoimmune diseases.\n\nI literally cannot read or watch the news because there’s constantly a new reason for my anxiety to spike. Which I hate, because I try very hard to be informed and aware.",
  "created_utc": 1738467115.0,
  "score": 3458,
  "num_comments": 439,
  "url": "https://www.reddit.com/r/Anxiety/comments/1ifo6up/any_other_americans_here_feel_like_theyre_on_the/",
  "comments": [
    {
      "id": "mai5k9u",
      "body": "The worst part of it is that a lot of my anxiety seems to be getting validated. \n\nMe to my boss and coworkers: “we will probably lose our overtime pay because Trump wants to demolish the Federal Government.”\n\nBoss: “Our overtime will be fine.”\n\n*Overtime gets halted during his 2nd week in office due to the grant freeze*",
      "created_utc": 1738472023.0,
      "score": 102
    },
    {
      "id": "mahu9p9",
      "body": "Yes! The conflict between wanting to be informed and wanting to be sane!",
      "created_utc": 1738467637.0,
      "score": 1426
    },
    {
      "id": "mahw4xx",
      "body": "[deleted]",
      "created_utc": 1738468309.0,
      "score": 282
    },
    {
      "id": "mahw96a",
      "body": "Yes, I was having panic attacks dating back to July when I basically figured out he was going to win a second term. I actually had to do an intensive outpatient program to help get myself under control. I know where you’re coming from. The only thing you can do right now is focus on the things you can control and try to enjoy the little things, watch funny shows, exercise, get outside, what have you. That’s all we can really do. Also, this time of year is miserable for those of us with anxiety, so try to look forward to Spring (if that helps at all)",
      "created_utc": 1738468352.0,
      "score": 307
    },
    {
      "id": "maihkgc",
      "body": "I’ve embarrassed to tell anyone I’ve had to take a Valium to be able to sleep every night since because I don’t want to sound dramatic or hysterical but this has all really done a number on my mind. And heart.",
      "created_utc": 1738477218.0,
      "score": 70
    },
    {
      "id": "maie6lg",
      "body": "Short answer: absolutely. \nMy nervous system is so shot, I literally just read my curated subreddits then play video games. I’m logging out this year. It’s too much for typical human being to hold 1) this much info and 2) this much collective trauma. I can feel the stress killing. I need to go enjoy my life instead of fearing everything.",
      "created_utc": 1738475672.0,
      "score": 33
    },
    {
      "id": "maihgru",
      "body": "Yes, and nearly everyone I know in my life is feeling the stress of it too. Please remember you’re not alone, and take time to disconnect, stop doomscrolling, and do something fun with people you love and feel safe with. It’s very important and makes a difference, I felt it today while I spent time with a a friend and mainly commiserated. We will get through this!",
      "created_utc": 1738477170.0,
      "score": 29
    },
    {
      "id": "mai03dw",
      "body": "If it helps, this is a completely reasonable situation to feel like this. This isn't \"my brain chemistry is fucked up and I'm panicking about nothing\", it's a reaction to entirely legitimate concerns. \n\nRemember that media in capitalist societies isn't about informing the public: it's the spectacle. A lot of the things you see in media are designed to provoke an emotional response, learning to tune out the unimportant while maintaining focus on what actually matters is going to be central to your mental health over the next four years.\n\nWhat helped me when Bolsonaro won here in Brazil was getting organized. On my own, I felt helpess. Having joined a political party, I feel like an active part in shaping the future I want to live in, and that gives me hope. Nowadays, even I know we're going through some very dark times, I feel hopeful, which is a complete reversal of how I felt before.",
      "created_utc": 1738469802.0,
      "score": 125
    },
    {
      "id": "mai22c3",
      "body": "Yep. Very worried about an economic collapse and my husband losing his job. Or even worse, us needing to escape the country. Nothing feels out of the realm of possibility anymore and I'm just sick to my stomach about it.",
      "created_utc": 1738470583.0,
      "score": 43
    },
    {
      "id": "maj6pw8",
      "body": "What I tell myself to stay sane:\n\n1. You are not alone. Just because you read the news alone, doesn't mean you are alone. This thread alone shows that you are not the only one. \n\n2. We're gonna deal with this as a group. You can't fix it yourself and you won't have to. A feral United States is a concern for the entire world.\n\n3. Fighting back takes time. Evildoers can \"move fast and break stuff.\" They win (proverbial) battles.  But there are more of us than there are than them. And lawsuit by lawsuit, political process by political process, allies will win (proverbial) wars.  Don't feel you have to file all those lawsuits personally.  \n\n4. Allies will appear in places you don't expect it. As the situation grows more dire, the consequences will hurt more people. You may occasionally see a troublesome relative, co-worker, or neighbor showing vulnerability and new openness to the situation.  But it will take time. \n\n5.  Other people are watching the news. You can take a break now and again. American is not \"sleepwalking into a crisis.\" Over a hundred million, including you, have been aware for years. You taking a break for a few hours or few days is okay. The rest of us will keep reading news. It'll be okay. \n\nTake a deep breath through your nose and know we're all on the same ship together. As others say, rest is resistance.",
      "created_utc": 1738491250.0,
      "score": 41
    },
    {
      "id": "mairc1j",
      "body": "I haven’t really been the same since the morning after the election. I think a piece of me literally died that day. The inauguration has sent me into a state of disassociation in a way. I keep seeing things come up here, things he’s doing a mere week and a half into office and I can’t even spend any sort of emotions on it because I am so tired and I am so sad. \n\nI’m a woman and to know how many people just don’t give a fuck about us is crazy. It’s a strange sense of betrayal living in a world where they voted a lying rapist in over a competent woman. Twice.",
      "created_utc": 1738482268.0,
      "score": 69
    },
    {
      "id": "mahuws7",
      "body": "I used to have high levels of anxiety in a classic way. Now I’m just numb. Though, I’m handwashing at OCD levels again (I was diagnosed in high school, but it dissipated for two decades) to where my hands are cracking and bleeding and constantly red, so it’s registering on some level regardless of the numbness.",
      "created_utc": 1738467865.0,
      "score": 85
    },
    {
      "id": "mahufy8",
      "body": "Absolutely. My advice to you is that yes you need to be informed, but not every second of the day. I've spent far less time on my for you page on tiktok. I will go and watch old animal videos or cooking videos that I saved to quench the thirst for using the app in a way that doesn't contribute to the spiral. Allow yourself to consume only a certain amount of news per day and try not to focus on it otherwise. I know that's easier said than done and I would still certainly encourage you to keep informed, but do not let it consume you. I'm a woman so I understand feeling real threats from what is going on, but falling into constant panic attacks is not going to put you in a good position to problem solve",
      "created_utc": 1738467699.0,
      "score": 78
    },
    {
      "id": "maiyivv",
      "body": "That is the point. It is by design. Try to avoid the news. It’s not you, it’s purposeful.",
      "created_utc": 1738486388.0,
      "score": 17
    },
    {
      "id": "mai4qts",
      "body": "me and my partner are both trans, and she is hispanic. we live right by the border, and ICE is everywhere. her sister was almost taken, even tho she is a born and raised u.s. citizen. i'm terrified to leave my house for anything.",
      "created_utc": 1738471678.0,
      "score": 42
    },
    {
      "id": "mahvdcq",
      "body": "Yeah, it's a constant anxiety. I think I might get off of most social media for a while so I can calm down.",
      "created_utc": 1738468031.0,
      "score": 69
    },
    {
      "id": "maiasoh",
      "body": "No, honestly for me it's more like that person who just loses hope and so just sits calmly and becomes almost like a blank ghost because they just gave up.\n\nAny hope at all I had that maybe just maybe, even if we voted in an oligarchy, the rich elite would at least help working class americans a LITTLE is gone.",
      "created_utc": 1738474254.0,
      "score": 12
    },
    {
      "id": "maic21j",
      "body": "I wasn’t expecting it to hit me hard, but the day of it really came crashing down once news of his post-inauguration speeches started coming out. On top of a lot of other things going, I’ve been dealing with intense anxiety and intrusive/obsessive thoughts. Tuning out doesn’t help a ton, either.",
      "created_utc": 1738474773.0,
      "score": 11
    },
    {
      "id": "maif9uh",
      "body": "Yes, it’s so bad my hair is falling out and I’m on my period.",
      "created_utc": 1738476155.0,
      "score": 12
    },
    {
      "id": "maiffxh",
      "body": "I've not had legitimate panic attacks in a decade, and after the inauguration I am now getting them randomly out of the blue",
      "created_utc": 1738476232.0,
      "score": 10
    },
    {
      "id": "mais8kn",
      "body": "Yup. Big pharma gonna cash out on the anxiety meds once again.",
      "created_utc": 1738482773.0,
      "score": 11
    },
    {
      "id": "mahxneg",
      "body": "i’ll tell you one thing i’ve never flown before and now i’ll never get a damn plane for at least four years",
      "created_utc": 1738468867.0,
      "score": 42
    },
    {
      "id": "maid0ke",
      "body": "I feel like I'm going to have a heart attack because it's been beating as wildly as hummingbirb wings lately.  😮‍💨",
      "created_utc": 1738475171.0,
      "score": 9
    },
    {
      "id": "maim4um",
      "body": "Absolutely. I've been trying to disassociate to the best of my abilities, but this shit is impossible to ignore...",
      "created_utc": 1738479479.0,
      "score": 11
    },
    {
      "id": "maj4lhg",
      "body": "I’m not making fun of you, but it would probably be healthy to get off of social media for awhile as it’s not healthy to see so many crazy headlines. I did this during peak pandemic and it helped a bunch.",
      "created_utc": 1738490000.0,
      "score": 11
    },
    {
      "id": "majveeq",
      "body": "I'm in the UK and it's taken me all this time to calm the hell down about it. It's terrifying what's happening around the world. What the US does affects a lot of places, not just them and fart is currently playing a dangerous game and I don't understand why he's doing it. He's not helping his people at all. \n\nI'm also scared as a tall woman who has enough issues trying to exist in women only spaces and has been told my entire life I'm not a real girl because of my height. I look like a normal girl, I'm just sized up. I'm scared for all my friends in America. I'm scared for my friends in the UK who are trans, gay, not white etc because ripple effects spread here. I'm scared for all of us. \n\nI saw they're banning a lot of scientific papers in the US in the most recent order, a lot of gender related papers and papers on women's reproduction. They've banned the CDC from working with WHO. Books are being banned, people are being rounded up and removed, trans people can't get passports now. It's terrifying and these are just a few things happening. The US is no longer safe or free. Hell it wasn't either for a long time but watching this, it's horrifying. \n\nMy friends did make me feel a lot better last weekend though. They spent the night taking the piss out of Musk and Fart while we played Secret Hitler. That was good. They're not scared like I am, but they weren't too phased about COVID or how scary that was. I was one of the first people in the UK to have it so I knew how serious it was and how scary. They didn't until they got it. I was probably the most sick out of everyone though. I had supplies before everyone started panic shopping and was able to share my food supply with them without worrying about what I'll eat.",
      "created_utc": 1738503888.0,
      "score": 10
    },
    {
      "id": "mak1emc",
      "body": "If one more person tells me to just look on the bright side or to focus on the good things day to day i’ll actually snap. The government is crumbling, the concern isnt unwarranted anxiety.",
      "created_utc": 1738506116.0,
      "score": 10
    },
    {
      "id": "maki0ae",
      "body": "Honestly my anxiety has morphed in to just a firey burning rage.",
      "created_utc": 1738511464.0,
      "score": 11
    },
    {
      "id": "mahvkcq",
      "body": "Yes. As a black woman it’s just dread 24/7. And I’m privileged because I live in California. Take your time. Fill your cup. Rest is resistance (I keep telling myself).",
      "created_utc": 1738468101.0,
      "score": 72
    },
    {
      "id": "mahx2p7",
      "body": "I’ve lost seven pounds since the election due to constant nausea",
      "created_utc": 1738468653.0,
      "score": 36
    },
    {
      "id": "mahxn97",
      "body": "I’m Canadian and I’m feeling constant anxiety because of it.",
      "created_utc": 1738468866.0,
      "score": 48
    },
    {
      "id": "maibjba",
      "body": "I think this is why my anxiety feels more heavy like I’m constantly scared",
      "created_utc": 1738474558.0,
      "score": 9
    },
    {
      "id": "makhr9f",
      "body": "Gay man here. I teach mostly Hispanic high schoolers. I’m terrified for myself and for them.",
      "created_utc": 1738511390.0,
      "score": 8
    },
    {
      "id": "mahx14v",
      "body": "i’m in the UK and it’s causing me serious anxiety i can’t imagine how you guys feel",
      "created_utc": 1738468637.0,
      "score": 39
    },
    {
      "id": "maifzx7",
      "body": "Yes. I feel like everyday is 100 hours long, I can't eat, I can't sleep right. I can't find myself smiling or laughing. Just thinking about what I can do to protect my loved ones, my pets and myself. I would've never guessed this is what I'd be doing at 26. :/",
      "created_utc": 1738476483.0,
      "score": 6
    },
    {
      "id": "mainrtg",
      "body": "absolutely. it's so hard to maintain a balance of staying informed and keeping my mental health in check. i keep on compulsively checking the news to make sure i don't need to pack up and flee to another state or country - it seems like we are on the verge of a societal collapse",
      "created_utc": 1738480330.0,
      "score": 7
    },
    {
      "id": "mai2pmo",
      "body": "Reddit has become a firehose of negativity since the inauguration.  It has had a much greater impact on my depression than my anxiety.  I've cut way back on the amount of time I spend on here.",
      "created_utc": 1738470847.0,
      "score": 26
    },
    {
      "id": "maij8t4",
      "body": "Literally every day since the election. I’m terrified of losing access to my medication and health insurance…",
      "created_utc": 1738478028.0,
      "score": 12
    },
    {
      "id": "maii6n0",
      "body": "Yep you’re not alone. I’ve decided to unplug as much as I can. What good is being informed when I’m literally powerless to change it? Until they’re at my door, why worry about stuff, because it’s just going to destroy any “normal” days I have. I do have my doctor checkup next Friday, I think I’ll ask to have a supply of short term anxiety meds to take the edge off on really bad days…",
      "created_utc": 1738477512.0,
      "score": 6
    },
    {
      "id": "majv2s8",
      "body": "The media thrives on anxiety.",
      "created_utc": 1738503761.0,
      "score": 5
    },
    {
      "id": "makeo0s",
      "body": "Same, I’m a woman, POC, with anxiety and autoimmune.   \n\nSomeone told me that the flood-the-field strategy from the administration is designed to invoke fear and chaos. The fact that it’s what they want, helps me resist it bc I’m not giving them satisfaction to play into their hands.   \n\n\nOther things that help me (it’s still hard): \n- limit news intake (like half an hr a day.)\n- self care, little things like a walk or snack  \n- talk with friends/family about concerns    \n- remember some decisions are outside our control",
      "created_utc": 1738510463.0,
      "score": 7
    },
    {
      "id": "mahwjlx",
      "body": "Yup . It's been a horrible two weeks and I am not watching the news. ",
      "created_utc": 1738468458.0,
      "score": 18
    },
    {
      "id": "mahxzvs",
      "body": "I feel like my anxiety my increase to agoraphobia. I'm a woman and POC. Luckily I'm in CA and most people openly don't like Trump.",
      "created_utc": 1738468996.0,
      "score": 21
    },
    {
      "id": "maiwk4c",
      "body": "I guess I shouldn’t be shocked that there are comments in here like, “Nah, I wasn’t upset about the last guy and all the awful things he did in the last four years so this will be fine!”  It gives me absolutely no solace whatsoever that each and every one of those people will have a moment - probably as soon as the coming days or weeks - to the effect of “Oh, I was wrong about that.”  Doesn’t make me feel the least bit better, because I selfishly enjoy being able to afford food and car repairs and stuff like that.",
      "created_utc": 1738485230.0,
      "score": 17
    },
    {
      "id": "mai0g5i",
      "body": "Every fucking day.\n\nThe silver lining is my clothes fit better because I can't hold food down or eat a lot because of the stress. Yay me... FML.",
      "created_utc": 1738469939.0,
      "score": 15
    },
    {
      "id": "mai1j69",
      "body": "So sorry you are struggling.I find comfort in  confirming that other sane people exist. I have so much anger for the fools that put us in this situation.  I’m hoping that the insanity will be enough to help democrats regain control and neutralize Trump. Impeachment and banishment to the phantom zone  would be ideal, but I’d settle for a tar and feathering . Until then , and I need to take my own advice, read or watch things that bring you comfort and maybe check a site like NPR or PBS for news occasionally .  Limiting social media is never a bad idea too. Take care.",
      "created_utc": 1738470368.0,
      "score": 5
    },
    {
      "id": "maibpmy",
      "body": "I am all over the place from panicking to planning to shutting down.",
      "created_utc": 1738474630.0,
      "score": 6
    },
    {
      "id": "maih5mw",
      "body": "I've been listening to audiobooks to ease my mental pain. ",
      "created_utc": 1738477022.0,
      "score": 5
    },
    {
      "id": "mairsw5",
      "body": "[removed]",
      "created_utc": 1738482530.0,
      "score": 6
    },
    {
      "id": "maoaqok",
      "body": "I’m trans. It’s only a matter of time before they start hunting me for sport. My stomach is in knots daily and I haven’t had a good nights sleep in several days.",
      "created_utc": 1738552258.0,
      "score": 5
    },
    {
      "id": "mai9h75",
      "body": "It’s crippling. Everything that’s been happening. The feeling of doom and feeling helpless and not being able to turn back time.",
      "created_utc": 1738473712.0,
      "score": 10
    },
    {
      "id": "mailzhx",
      "body": "I'm not American, yet I also have anxiety with Trump action since he's basically speedrunning the world into recession!",
      "created_utc": 1738479402.0,
      "score": 8
    },
    {
      "id": "maig27j",
      "body": "Yes. Im a disabled veteran and I have chronic pain and chronic illnesses and I keep having panic attacks from this whole fucked up situation. I’ve had to take time outs from the news and certain subreddits",
      "created_utc": 1738476512.0,
      "score": 5
    },
    {
      "id": "maikso3",
      "body": "I had my very first panic attack today EVER…out of nowhere. Culminated in an ER visit thinking I was actively having a stroke/heart attack/other. \n\nI’m a combat wounded veteran. PTSD diagnosis, anxiety from chronic pain as my initial injury has cascaded throughout my body. I guess it just took a perfect storm of a really painful day and the constant dread of this current administration. Doesn’t help that I’m a federal employee as well and Elon Musk and the rest of the Project 2025 gang is effectively terrorizing us.\n\nIt was the worst thing I’ve ever experienced, which says a lot considering you know there was a day where I was once dying on a battlefield lol. I legitimately thought I was going to die. I was trying to make sure my kids didn’t have to see me collapse and expire, told my wife where to find all of my life insurance papers. \n\nThe thought of what we went through today is giving me anxiety. I just never want to feel that again, it’s devastating to know people have to go through this stuff.",
      "created_utc": 1738478801.0,
      "score": 4
    },
    {
      "id": "mail0ru",
      "body": "Yep, what's worse is my psych has me on meds that can potentially make my anxiety worse and I can't tell if it's everything going on or the meds, or maybe a mix of both. Anyway, I feel awful, I can feel parts of my brain in overdrive, and I'm in a constant state of screaming \"Oh my god,\" like Butters mom.",
      "created_utc": 1738478914.0,
      "score": 4
    },
    {
      "id": "majbrle",
      "body": "The “news” makes me anxious too. Good call to avoid.",
      "created_utc": 1738494266.0,
      "score": 4
    },
    {
      "id": "makaypj",
      "body": "I absolutely do. I WANT to stop doom scrolling while staying informed but right now that feels impossible. \n\nIf I close an app and open it 30 minutes later multiple new shitty things have happened, so if I stop looking I feel like I'm not able to be informed. Unfortunately this is by design. The group doing all these shitty things wants people to be overwhelmed and feel hopeless.",
      "created_utc": 1738509318.0,
      "score": 3
    },
    {
      "id": "makhorp",
      "body": "Definitely. I was doing so well for a long time, too, after I was diagnosed and began treatment for ADHD. But for the past few weeks I’ve been unable to stop or control my anxiety. Normally I wake up feeling a bit anxious but after I take my meds the racing thoughts disappear and I can get on with my day. But now the meds hardly do anything. It’s just a constant stream of blabbering, racing thoughts in my head and I can’t turn it off. Things that I used to do to distract myself aren’t working. I’m lucky that I have a psychiatrist who is working with me on changing up my medications, so hopefully I notice some difference soon. I’m also thankful for my therapist and support system of friends and family. I’m trying very hard to focus on the small things I have control over. Reading the news gives me some small sense of control but I am realizing how toxic it is for me, so I’m starting to limit the amount of times I check the news in a day. I’m sorry so many others are feeling the same, but it is comforting knowing I’m not alone and it is completely normal to feel this way.  💜",
      "created_utc": 1738511370.0,
      "score": 5
    },
    {
      "id": "makswyo",
      "body": "Yes, absolutely. I'm a queer disabled woman on government health insurance who works in public libraries, so uh, it has been a no good very bad time. The best thing that I've done for myself is to minimize the time I'm spending reading the news to once a day, so that I'm not deluging myself in all the bad shit that's happening. I think there's a really fine line between keeping informed and overwhelming yourself with bad news stories. I try to focus on the stuff that I can control and the good I can (and do) do in my workplace. Like sure everything is scary and sucks complete ass, these people hate us, and my anxiety is through the roof, but at least I get the opportunity to help the kids in my area to develop better literacy and information and digital literacy through my work. I help out seniors, homeless people, people in poverty, and immigrant families through the work I do and I'm trying my best to keep my eyes on that. I can't do the best work I can do for my patrons and my community if I let myself get consumed by the fear, burning rage, anxiety, and confusion that I'm feeling.\n\n&nbsp;\n \nIf you're not in a workplace like mine where your job affords you the ability to help out people in your community it might help you feel like you're able to control some positive impact if you find a local volunteering opportunity. It doesn't even have to be that big or cost you money.  There are a lot of local orgs that are always looking for volunteers. There are even some virtual or at home volunteer opportunities if you google around. Some organizations that are looking for helpers all the time:\n\n&nbsp;\n\n* Groups like Project Linus where volunteers knit, quilt or crochet blankets for sick kids in hospitals, and all kinds of other kids in need.\n\n* Local food banks\n\n* Local litter clean up groups\n\n* Local animal shelters\n\n* Local state/city/county level campaigns for candidates that are seeking to fight against the current admin and make positive changes in your community\n\n* Local senior centers and hospice groups\n\n* Forest preserves and parks looking to fight buckthorn and other invasive species or do controlled burns\n\n* Public library volunteers\n\n* Orgs that help people with preparing for citizenship exams, learning English, etc.\n\n* Youth centers\n\n* Tutoring centers for disadvantaged youth\n\n* Shelters for domestic violence victims\n\n* Homeless shelters\n\n* Single issue advocacy lobby groups that lobby state legislatures on issues like human rights, human trafficking, education, immigration, healthcare reform, etc.\n\n&nbsp;\n\nYou can also write letters/emails or make phone calls to the offices of your representatives, regardless of their party to annoy them about the issues that are important to you as a constituent. There are a lot of single issue advocacy groups for issues that you probably care about that have created form letters you can use to write your letters. \n\n&nbsp;\n\nEverything sucks ass and it really sometimes makes me start to panic when I let myself get overwhelmed with the powerlessness that I feel related to bigger issues. I have to just let myself focus on the immediate community around me. What can I do today to help make the community around me better? A lot of my panic is about these feelings of powerlessness and a lack of control in the midst of chaos, so this is the approach that has been helping me. I have to keep up a belief that there is good out there, and that most people are fundamentally kind, and that we're all just bumbling around trying to figure it out. \n\n&nbsp;\n\nThe evil assholes are really, really loud, obnoxious and attempting to do a lot of damage, but ultimately for all that they are overwhelmingly loud, they are not the majority and they want the rest of us to forget that. They want to make it seem like the evil bullshit that they believe in is \"what everyone's thinking,\" but it's not true. Ultimately everything they're doing, and the systems they want to enact can't sustain themselves for the long term. History has shown us that all fascists are losers in the end; their system is Ouroboros eating its own tail -- they turn on each other eventually because they secretly all hate one another, and collapse. Idk, I try to remind myself of this too because I can't let myself lose all hope -- it's what they want anyways and I sure as fuck don't want to give them the satisfaction.",
      "created_utc": 1738514636.0,
      "score": 4
    },
    {
      "id": "malkgxe",
      "body": "I am having to turn off social media and news for a couple days at a time to get thru.  Last time he was in office I had a dog that required my attention and helped me deal with what was going on.  She passed away last year so I am facing it alone this time.",
      "created_utc": 1738522149.0,
      "score": 5
    },
    {
      "id": "mamilbq",
      "body": "Oh yeah totally, though since the election really. Every day a new nightmare.",
      "created_utc": 1738531857.0,
      "score": 4
    },
    {
      "id": "mai6ayx",
      "body": "yes. i’m trans and i’m terrified.",
      "created_utc": 1738472341.0,
      "score": 14
    },
    {
      "id": "mahuykp",
      "body": "Yeah. I’ve had trouble sleeping. This Elon musk crap has had my mind racing all night these past few nights. On edge is putting it lightly",
      "created_utc": 1738467883.0,
      "score": 23
    },
    {
      "id": "maissmd",
      "body": "Of course you’re panicking—if you’re not, you must not own a TV or a phone or a brain. The new national pastime isn’t baseball anymore; it’s worrying. We can’t wait to tell everyone else exactly how to panic, like we’re all guidance counselors handing out emotional homework. “You, sir—panic about the economy! You over there—panic about the environment! And you in the back, who forgot to set your DVR, panic about missing that new reality show!” Meanwhile, we’re all supposed to check in with each other: “Did you get your recommended daily allowance of anger, fear, and confusion?” It’s never enough to be nervous on your own—everyone wants to make sure you’re nervous in the correct way, at the correct time, about the correct issue. Because apparently we can’t even freak out without an instruction manual in this country.",
      "created_utc": 1738483087.0,
      "score": 8
    },
    {
      "id": "mai2i1z",
      "body": "I feel like I'm either panicking, planning solutions to possible problems, or shutting down. It definitely feels like a 24/7 on edge sense of alarm. It feels like we have been so perfectly manipulated long term into being a divided population, sold different lies than the people next to us so this insanity can happen that allows a select few to profit. That then makes me question myself and then I go back to anxiety or rationalizing things. Again. ",
      "created_utc": 1738470762.0,
      "score": 5
    },
    {
      "id": "mai2ypz",
      "body": "My symptoms are worse than they've ever been in my life. Just steadily climbing with every passing day of this circus.",
      "created_utc": 1738470949.0,
      "score": 7
    },
    {
      "id": "mahwgy5",
      "body": "100% It got so bad I uninstalled ap and npr news apps. At least for the next couple of weeks. Just need a break",
      "created_utc": 1738468431.0,
      "score": 8
    },
    {
      "id": "mai9srp",
      "body": "Yes 🥺",
      "created_utc": 1738473846.0,
      "score": 3
    },
    {
      "id": "maiai10",
      "body": "Of course.",
      "created_utc": 1738474136.0,
      "score": 3
    },
    {
      "id": "maikg8f",
      "body": "I’m having a full blown panic right now. I had to take a Xanax.",
      "created_utc": 1738478628.0,
      "score": 3
    },
    {
      "id": "majgq44",
      "body": "POC here too with chronic pain, anxiety, and ADHD. I’ve found myself just staring at nothing in particular zoning out at work. I meditate every morning but I can quiet my mind anymore. The constant tension from anxiety only makes my chronic pain worse. When Trump stopped all federal funding on Tuesday it was like a fire drill at work since we have a few departments that rely on some type of federal funding for ongoing projects. I don’t know how the next 4 years will turn out but it’s not even been two weeks and it’s been a dumpster fire.",
      "created_utc": 1738497117.0,
      "score": 3
    },
    {
      "id": "malajwq",
      "body": "Yes! Once I heard Musk has access to treasury computer systems I hyperventilated. This means he has access to everyone paid anything by the Fed. He can go in to federal employee records and change hire dates to delete pensions, lower social server payments. Do what ever he wants.",
      "created_utc": 1738519491.0,
      "score": 3
    },
    {
      "id": "mam4ppo",
      "body": "Yes.  I used to read the news daily. Now I get extremely anxious about it.  \n\nBtw I am a white straight man.  I’m supposed to be in the safe demographic.  And I don’t feel safe at all. \n\nI have friends and family that are non-white and some LBGQ.  I worry about them a lot.",
      "created_utc": 1738527797.0,
      "score": 3
    },
    {
      "id": "mam6m1p",
      "body": "I’ve found it helpful to remind myself any time I see another outrageous headline that the strategy they are using is literally “shock and awe.” Bombarding us with so much stuff we get overwhelmed and disengage. It’s hard not to, but every time you remind yourself this is what’s happening, you take back some of that power",
      "created_utc": 1738528351.0,
      "score": 3
    },
    {
      "id": "mamh0y3",
      "body": "When I was in an abusive environment with my family growing up, I’d get this thing where I’m constantly yawning, fighting for a deep breath and not getting it. It was a terrible struggle between 13-22. Fast forward 5 years I’m finally in a healthy environment, I’m doing well, but starting in November, it started up again, and got extreme starting the 20th. It’s the worst feeling and I’m honestly terrified because I need to stay in the loop but it’s so harmful for my wellbeing",
      "created_utc": 1738531398.0,
      "score": 3
    },
    {
      "id": "mahzkzl",
      "body": "In Canada. Terrified. How is this real life?",
      "created_utc": 1738469605.0,
      "score": 11
    },
    {
      "id": "mai3ulz",
      "body": "I had a panic attack in the grocery store. I was there to stock up on things in case prices rise but I didn't know what to buy or if I should by stuff or if I will ever eat what I buy and I don't have a lot of money and I and I just lost it in the aisle. I started crying and had to leave, i couldn't get a grip. Ridiculous.",
      "created_utc": 1738471311.0,
      "score": 5
    },
    {
      "id": "mai3wa0",
      "body": "Yes. I’m a new mom and work in health care. My anxiety fueled tics have gotten to where I can’t control them anymore.",
      "created_utc": 1738471330.0,
      "score": 6
    },
    {
      "id": "mai4mrr",
      "body": "Oh my gosh, are you me?\nA person of color.\nChronic illnesses.\nWoman.\n\nBut yes…these are very scary times. We’re all just doing our best and we have to hope 🥺",
      "created_utc": 1738471632.0,
      "score": 6
    },
    {
      "id": "mai56xw",
      "body": "I’m thankfully on anti-anxiety meds but the doom scrolling issue is REAL.",
      "created_utc": 1738471865.0,
      "score": 6
    },
    {
      "id": "mahyaq1",
      "body": "I’m Canadian and your government is actively trying to start fights with mine. \n\nAnxiety is through the roof.",
      "created_utc": 1738469111.0,
      "score": 10
    },
    {
      "id": "mahykdu",
      "body": "Woman here. I’ve been crying at the drop of a hat the past three weeks, over nothing. My husband got confused about something I said and instead of communicating rationally I just started sobbing. I *know* it’s completely irrational and I can. not. stop.\n\nMy husband keeps telling me to “just stay off my phone” and sure, I could be on social media less, but that’s not going to change the reality of the situation. I don’t know how to make him understand this like low-grade terror that’s constantly humming in my subconscious.",
      "created_utc": 1738469213.0,
      "score": 13
    },
    {
      "id": "mahylmd",
      "body": "Yes. Already had been harassed a few times and someone pulled a gun in front of my 6 year old. I’m a citizen and constantly harassed.",
      "created_utc": 1738469226.0,
      "score": 10
    },
    {
      "id": "mahxsrp",
      "body": "Yes. Something’s got to give.",
      "created_utc": 1738468923.0,
      "score": 5
    },
    {
      "id": "mahyv6t",
      "body": "Yep. I have to tune out a little to the news because every news is bad news 😢",
      "created_utc": 1738469327.0,
      "score": 5
    },
    {
      "id": "maikbbf",
      "body": "Yup! Nonbinary person here on testosterone- ever since the election results my anxiety has spiked through the roof and to combat it my brain either dissociates completely or goes into panic attack mode. I want to move out so badly but I don’t have enough funds right now and don’t even know where it would be safe enough to go. Losing hope more and more🤠👍",
      "created_utc": 1738478560.0,
      "score": 5
    },
    {
      "id": "mahwr2w",
      "body": "Yes however mine has been since November 5. I had a panic attack a week later.",
      "created_utc": 1738468534.0,
      "score": 6
    },
    {
      "id": "maik7py",
      "body": "Feeling a lot more anxiety, helplessness and overall rage.",
      "created_utc": 1738478511.0,
      "score": 2
    },
    {
      "id": "majq2rk",
      "body": "No but I also admit that I've just been burying my head in the sand. If it's giving people panic attacks i really recommend unplugging. Theres no sense in following it all.",
      "created_utc": 1738501699.0,
      "score": 2
    },
    {
      "id": "majr10e",
      "body": "My insomnia has been awful since the inauguration, it’s so fucked up that we could even get to this point. So many people have failed us in recent years, looking at you Garland.",
      "created_utc": 1738502108.0,
      "score": 2
    },
    {
      "id": "makd180",
      "body": "Yes. I'm at the point where I'm trying to shield myself from the news but it comes from too many places",
      "created_utc": 1738509965.0,
      "score": 2
    },
    {
      "id": "makp6rr",
      "body": "Same here. Plugging in to our local communities by volunteering, connecting with neighbors, organizing, etc is going to be the way we restore our sanity and faith in humanity. Fight against isolation and constant spiraling. It's difficult but its so worth it! You got this!!",
      "created_utc": 1738513561.0,
      "score": 2
    },
    {
      "id": "makslws",
      "body": "I literally have had the worse eczema flare up on my face the past few weeks. Anxiety is through the roof and depression is lingering. I’m so hopeless to the pint I don’t want to go see doctors anymore.",
      "created_utc": 1738514547.0,
      "score": 2
    },
    {
      "id": "maktt1o",
      "body": "My advice stay social media and stop watching and reading new sources for at least 4 days to a week. Things change daily with this guy. The media can’t keep up so they write either speculation option pieces or half ass bias reporting. My husband is a federal worker and I’ve been worrying about him losing his job and have been trying to avoid the news. If the head of the DOJ doesn’t know what’s going on the media sure as hell doesn’t either. Hardly any of the information coming from the media about the “buyouts” is inaccurate or misleading.",
      "created_utc": 1738514893.0,
      "score": 2
    },
    {
      "id": "mal7k29",
      "body": "Yes and I’m constantly avoiding broadcast media. It’s good to know what’s going on in the world but somehow during this administration they’re overwhelming us with press conference after press conference. Everywhere you turn it’s a new scandal that you feel attacked and powerless to defend yourself from. I’ve stopped going on social media, except for YouTube and Reddit. Now I focus on reading the LA times for my news source. Print tends to feel far less overstimulating than broadcast journalism. I can understand what’s happening and focus on what I can control. Focusing on who/what makes you happy is going to be your best defense this term just like his last.",
      "created_utc": 1738518686.0,
      "score": 2
    },
    {
      "id": "malecpl",
      "body": "Yes :( I am not only female but my insulin is no longer covered by my insurance, nor is my insulin pump supplies, so I've been paying out of pocket. My husband is a teacher so I have no clue what's going to happen with that. My parents are very staunch Trump supporters so I don't really have much support.",
      "created_utc": 1738520505.0,
      "score": 2
    },
    {
      "id": "maleq4r",
      "body": "Canadian here..there are times I feel this I don’t want to ignore the news though because that would also be bad. It’s stressful and lots of doo scrolling 😞",
      "created_utc": 1738520605.0,
      "score": 2
    },
    {
      "id": "mali0sp",
      "body": "I have a newborn daughter that was in the NICU and that's a 500k bill that I'm thankful to have good insurance to cover, but I worry for others who don't. I worry about her future. I worry about my trans nephew. I worry about my first gen Latino family members. I worry about my child's access to vaccines and about the children that cant get vaccines and how herd immunity may go out the window. I worry about my sister who is extremely stressed at all of this for many reasons. I worry about my other sister looking for federal jobs, and I worry that our country will become less safe as  government spending is cut that may be in areas like last time that affected things like food inspections. I worry about our schools being afraid to treat kids with respect and acceptance or lose funding. I worry about the revisionist history and social studies they'll be taught. I worry that things won't get better for women and minorities because the problems we face are being treated like they don't exist. I'm worried about women being abused and raped and forced to have their rapist's child. As a mother of a daughter that's terrifying. We were making progress, and now it feels like we've stepped back 100 years. It feels like a comic where a supervillain has taken over and we're just waiting to hear what horrible new thing will be announced. Imagine trying to determine if you have post partum depression or anxiety in this situation too, because I can't figure that one out. And now I have to put together my grocery list and prepare myself mentally for even more expensive groceries because of the tariffs on our neighbors.",
      "created_utc": 1738521490.0,
      "score": 2
    },
    {
      "id": "mall9hs",
      "body": "Yes. But I need to know what’s happening so I know when to fight. I will not let people be taken to camps without me knowing. I’m not strong enough to lead right now but if they need bodies to march I’ll be there.",
      "created_utc": 1738522365.0,
      "score": 2
    },
    {
      "id": "maltwuz",
      "body": "I feel like I’ve been fighting for my country to do the right thing my entire life only for my country to say, “fuck that, we’re going to step back 50 years and go with everything that’s wrong about this country” and I’m so done! I lost my son a year and a half ago and then my mother and I can’t do this anymore! I just want America to treat others with humanity and be a GOOD example to the world but no, no none of that! We’ve got to go with the evil clown!  It may not cure my anxiety but my wife and I are preliminary planning to sell everything and move abroad because fuck this shit! I can’t do it anymore!",
      "created_utc": 1738524738.0,
      "score": 2
    },
    {
      "id": "man0dxb",
      "body": "Daily.   \nAnd my job requires reading the news on a daily basis.",
      "created_utc": 1738537202.0,
      "score": 2
    },
    {
      "id": "man4wmc",
      "body": "Every. Fucking. Day.",
      "created_utc": 1738538645.0,
      "score": 2
    },
    {
      "id": "mane1n7",
      "body": "I’m absolutely losing it too. I’ve been doing my best to just keep my sanity. I’m a queer newly wed so you can imagine this has been absolute hell.\n\nI think the worst part of it all is that I have no one I can just  turn to. I feel bad when I panic in front of my husband cause he is dealing with the tariffs at his job and he doesn’t need more to worry about with me. \n\nI usually would go to my dad in these instances too, but when my old man told me he was nervous too and to just endure it, I felt like I lost my mind.\n\nThings I’ve been doing:\n\nI upped my therapy sessions to once a week. I need the outlet to just panic and be vulnerable. I also need someone who will let me panic in circles without getting frustrated at me. \n\nI made a game plan with my husband in case we need to move to a blue state for safety. I’ve put him in charge of being my news keeper. If something scares him, we begin the plan. Thankfully for now my county has protections for us and we own our home. Also all of my family and his are very accepting of us. \n\nUp next, I do NOT read the news about politics. I stopped going on instagram, Facebook and I deleted Twitter a long while ago. I’m only allowed Bluesky, Reddit and YouTube. The only time I let myself on Facebook is for messenger messages or DMs of memes from my friends. I’m not perfect and I just got through a big mess up that scared the crap out of me but I’m okay.\n\n\nTo add to my social media portion, I have worked VERY hard on blocking or muting anything political. This includes posts I agree with. It does me zero favors to listen to all that.\n\nPenultimate thing I did was build my army (not in the literal sense but figuratively). I am surrounding myself with people who love me for me. I started a chosen family for many of my closest friends who have less than accepting families. We get together every week for dinner. This helps me feel less lonely\n\nAnd finally, I am using more technology that doesn’t connect to the internet. I bought myself a tamagotchi so I could have something to do instead of be on my phone. I started playing Zelda wind Waker with my husband cause the GameCube is offline. I also replayed a ton of old Pokémon games too.\n\nThis might’ve been a ramble, but I needed to let it out a little today. We will make it through this. It’ll suck, and there will be many discouraging days ahead, but it’s important more than ever to take care of yourself.",
      "created_utc": 1738541594.0,
      "score": 2
    },
    {
      "id": "manrldn",
      "body": "Then don’t watch the news.. and avoid places where it reports on news related things.  It’s not hard to do.",
      "created_utc": 1738545990.0,
      "score": 2
    },
    {
      "id": "manufin",
      "body": "On the verge of? Get on my level! \n\nPanic attacks are my default now; it feels strange when I’m not panicked.",
      "created_utc": 1738546903.0,
      "score": 2
    },
    {
      "id": "many3kj",
      "body": "No, I just avoid politics completely. Works for me.",
      "created_utc": 1738548085.0,
      "score": 2
    },
    {
      "id": "manzb0v",
      "body": "Political anxiety is directly correlated to your daily screen time.",
      "created_utc": 1738548477.0,
      "score": 2
    },
    {
      "id": "maofd7r",
      "body": "Absolutely! I am a man and white. And I’ve worked with outstanding organizations over the past few years, but this is a bit overwhelming.\n\nI had so much hope in future generations, but I’ve been so disappointed with the lack of engagement and even the conservative cultural shift.",
      "created_utc": 1738553851.0,
      "score": 2
    },
    {
      "id": "maooqm6",
      "body": "The stress is destroying me and I'm a CISHET white guy. \nI have an autoimmune myself. I'm terrified for all my lady friends, LGBTQ friends, minority friends, and honestly even us white people. It's such a massive step backwards",
      "created_utc": 1738557336.0,
      "score": 2
    },
    {
      "id": "maotcfv",
      "body": "Every single day it's a circus. People I thought I knew have become so hateful.\n\nFamily isn't the wholesome nice people I thought they were because of this man. \n\nI go on social media and it's all people talk about. Red hats at the grocery store, bumper stickers, nazi flags in the neighborhood I live in (along with Trump and American flags). \n\nI have never witnessed such a thing before, ever! \n\nSo now I have distanced myself from my \"friends\", family, social media, and do online grocery pickup. I hope things change for the good soon. Being harassed in the parking lot at Walmart by a group of men chanting \"Grab her by the pussy, Grab her by the pussy\" was the rotten cherry on top of a shit cake.",
      "created_utc": 1738559188.0,
      "score": 2
    },
    {
      "id": "map11xj",
      "body": "I'm a white woman and I've felt nothing but panic and dread and I can only imagine how POC feel.  It's been 24/7 despair and I don't even feel like the same person anymore. It's like I woke up in another life that looks the same but feels unrecognizable and frightening.  Knowing this many people are rejoicing about this monster makes me feel like I woke up in Hell, surrounded by demons. ",
      "created_utc": 1738562740.0,
      "score": 2
    },
    {
      "id": "map83w6",
      "body": "I’ve been having constant panic attacks since this man was let into the office. But I know it’s bad if I look away even for a second. I have privilege and I should be using that first. My marginalizations come second. I just want it to stop.",
      "created_utc": 1738566465.0,
      "score": 2
    },
    {
      "id": "map9x2w",
      "body": "Yes...it's very unnerving.",
      "created_utc": 1738567481.0,
      "score": 2
    },
    {
      "id": "mapaq62",
      "body": "I’m a white male and still terrified for my wife and daughter on the way…",
      "created_utc": 1738567939.0,
      "score": 2
    },
    {
      "id": "mapimef",
      "body": "No. The US is an evil empire and it's dying. We must protect ourselves, but this is a good thing",
      "created_utc": 1738572719.0,
      "score": 2
    },
    {
      "id": "maps99a",
      "body": "yes.",
      "created_utc": 1738578715.0,
      "score": 2
    },
    {
      "id": "mapwhkq",
      "body": "Not American but whatever is happening to you will affect us and will come our way eventually too (it's already happening in a lot of places in Europe). \n\nI'm sick with worry. I have a great urge to do something... anything... but I feel powerless. \n\nI won't spend the rest of my life building pyramids and city states for the oligarchs. I will not be a serf. I'll die before that happens.",
      "created_utc": 1738581186.0,
      "score": 2
    },
    {
      "id": "maq0f7f",
      "body": "Not panic attacks but certainly stressed and worried. If I had the choice and the ability I would move to a different country right now honestly. At least until this is over.",
      "created_utc": 1738583311.0,
      "score": 2
    },
    {
      "id": "maq7ldy",
      "body": "Yes, I’m having a hard time focusing on anything else, because what is the point when our literal world is falling apart? I have a friend who doesn’t want to hear a thing about what is going on. She just wants to be a turtle, she says, it’s “just politics” and she doesn’t want to hear it because it stresses her out. I wish I had the ability to tune it all out, but I can’t, because everyone I love is in mortal danger, including her. She does have a safety net though, a partner that makes enough money to keep him out of the brackets that get the biggest tax increase, so she has a buffer for now. I hope the existential terror and anxiety I feel in this regard ends up being misplaced, but I don’t think it is! I can use the tools my therapist taught me to work through the anxiety and panic I know is misplaced and part of my anxiety disorder, but I don’t think this particular anxiety is misplaced at all.",
      "created_utc": 1738586688.0,
      "score": 2
    },
    {
      "id": "mai28rh",
      "body": "You’re not alone. I have some risk factor in my family related to this administration but am otherwise quite privileged, but care about those who aren’t, and I have been having a racing heart every night at bed with minimal glimpses of the news. \n\nSending you a hug. There are many of us here who will fight for your rights. Just focus on taking care of yourself.",
      "created_utc": 1738470657.0,
      "score": 4
    },
    {
      "id": "mai0wdi",
      "body": "It’s felt like we’ve lived an eternity since",
      "created_utc": 1738470115.0,
      "score": 3
    },
    {
      "id": "mai5ceb",
      "body": "Yeah I'm in the same boat. It fucking sucks.",
      "created_utc": 1738471930.0,
      "score": 3
    },
    {
      "id": "mai89q3",
      "body": "Yes. I’m also having work issues so the combination is sending my resting heart rate through the roof. Not sure what to do about this. I try to not read the news but I skim the headlines about 1-2 times a day and even that small amount isn’t working. But I can’t imagine going completely dark on it. I don’t know what to do about it. ",
      "created_utc": 1738473193.0,
      "score": 4
    },
    {
      "id": "maj0rti",
      "body": "Heightened anxiety and more depression, definitely.",
      "created_utc": 1738487726.0,
      "score": 3
    },
    {
      "id": "mak35f3",
      "body": "Seriously, the answer is to stop watching or reading the news. If you feel disconnected stick to local/community news only.\nMy anxiety improved a lot when I stopped.\nThere is no obligation to know what's going on. If it came down to anything urgent that would affect you personally and immediately, then a friend would let you know. Otherwise, even if there are terrible changes afoot, there's nothing you personally could do to change it.\nJust quit all news",
      "created_utc": 1738506722.0,
      "score": 3
    },
    {
      "id": "maj44tw",
      "body": "You think you're in danger because you are a woman who is not white, just because there is a different president?\nThis is unfortunately a case of the media doing what it does best, and scaring folks needlessly. Best thing to do is not watch the news, particularly left leaning outlets.",
      "created_utc": 1738489721.0,
      "score": 6
    },
    {
      "id": "mahylq2",
      "body": "Today I had a big cry to let it all out so I could function for the rest of the day",
      "created_utc": 1738469227.0,
      "score": 3
    },
    {
      "id": "mai0vdh",
      "body": "I checked out. I believe this world is pointless and the damage to it is so far gone beyond whoever is in office. It just gets worse and worse.",
      "created_utc": 1738470104.0,
      "score": 2
    },
    {
      "id": "maiojd0",
      "body": "Yep. Autistic queer trans man here, and I haven't slept well at all since the inauguration.",
      "created_utc": 1738480736.0,
      "score": 4
    },
    {
      "id": "majp510",
      "body": "[removed]",
      "created_utc": 1738501290.0,
      "score": 2
    },
    {
      "id": "mahwa4r",
      "body": "Honestly, not reading or watching news should be a blessing no matter who's president. I'm personally addicted to news and it's so hard to break the addiction.",
      "created_utc": 1738468362.0,
      "score": 2
    },
    {
      "id": "mahwjp0",
      "body": "I’m going to bungle writing out what I’m asking so please be nice:\nYes and I would love for us to have open chat to help each other stay calm and act rationally to weather this awfulness. And for those who wish, support each other as we civilly resist and work to change the tide.",
      "created_utc": 1738468459.0,
      "score": 1
    },
    {
      "id": "mahttmc",
      "body": "Happy cake day! Sorry America sucks!",
      "created_utc": 1738467480.0,
      "score": 0
    },
    {
      "id": "mai5lw0",
      "body": "Nope",
      "created_utc": 1738472043.0,
      "score": 9
    },
    {
      "id": "mahwfu1",
      "body": "Yes, though my two ER visits in December also contributed. I have anxiety attacks all the time to the point where I have high blood pressure now. I stutter and shake for no reason and I often need physical comfort with someone to make them stop. If I get a panic attack I feel like I'm dying. Time is either moving too slow or too fast. I worry about everything (right now it's this spider bite on my forearm that aches) and I have trouble sleeping because I'm afraid I'll die in my sleep",
      "created_utc": 1738468419.0,
      "score": 2
    },
    {
      "id": "mai2r6j",
      "body": "Yes. I had to unfollow the subreddits that talked about it and I don’t go over to News or Popular. I want to stay informed but I just can’t right now. It’s the most I’ve ever seen of just new negative story after new negative story.",
      "created_utc": 1738470865.0,
      "score": 2
    },
    {
      "id": "mai9euz",
      "body": "Yes. Something I have to tell myself though is I cannot be a part of the Resistance if I’m too busy hyperventilating and crying in the corner 🤣🤣",
      "created_utc": 1738473684.0,
      "score": 2
    },
    {
      "id": "mailcll",
      "body": "One thing that has helped me is realizing that not all of what Trmp is saying he will do will actually happen. It will be a long unfolding of events over these 4 years.",
      "created_utc": 1738479077.0,
      "score": 2
    },
    {
      "id": "maimj4n",
      "body": "I'm a white, disabled Canadian woman living 25 km from the border and I'm feeling the same. I haven't been able to sleep since the inauguration. Even my emergency anxiety meds aren't working. Unfortunately I know our politics are heading this way too and it freaks me the hell out.",
      "created_utc": 1738479683.0,
      "score": 2
    },
    {
      "id": "mainoxh",
      "body": "Well, i decided not to let that demon in office phase me.\n\nAnd considering i hv health challenges as well, I refuse to give AHoles like him and his supporters any of my energy, time, or peace of mind!\n\nAnd I don't watch any news that involves him either\n\nSo, it's a choice, really. \n\nDon't let Rump's evil spirit take u to task at all. \n\nThere are too many other things you could be focused on that brings you joy or peace.",
      "created_utc": 1738480289.0,
      "score": 2
    },
    {
      "id": "maixs3o",
      "body": "Constantly. I lost what I thought was my entire support system during this election. I'm very isolated even in a blue state weirdly enough.",
      "created_utc": 1738485951.0,
      "score": 2
    },
    {
      "id": "maj3vzz",
      "body": "absolutely. I've already had several crying sessions in fear for myself and those around me. I have a physical disability as well as severe anxiety and adhd that prevents me from working a typical job, so I get disability benefits. I'm so scared and angry watching those clowns say whatever they want, even though I know a lot of it is just executive orders that bear no weight (yet) and how little retaliation they are getting for it drives me nuts. when that fuckwad blamed disabled people for the plane/helicopter collision, I felt a deep dark pit inside me grow because that sounded like a warning. I'm so sad and furious, I want to step away from it all but I can't seem to. the worst part is how often disabled folks are forgotten about, even by the left. that's why I shudder at the return of the r-slur, it makes me want to vomit.",
      "created_utc": 1738489572.0,
      "score": 2
    },
    {
      "id": "majbke4",
      "body": "This is me as well. Someone sent me a Bernie Sanders video and he really helped me feel better - he was talking about what we can do to at least feel proactive against the overwhelming negativity and some things to be mindful about. I hope it helps.",
      "created_utc": 1738494149.0,
      "score": 2
    },
    {
      "id": "maje7rs",
      "body": "Yep, every day. Anxiety is the thing that won’t let me sleep.",
      "created_utc": 1738495695.0,
      "score": 2
    },
    {
      "id": "mak6yup",
      "body": "You are doing one thing right. Stop watching cable news. They keep people watching out of fear. \nWhen new bad things actually play out in real life, THEN worry. Nothing has changed. Breathe.",
      "created_utc": 1738508020.0,
      "score": 2
    },
    {
      "id": "mahxwva",
      "body": "Yes",
      "created_utc": 1738468965.0,
      "score": 2
    },
    {
      "id": "mahyqbc",
      "body": "Yes. I think I need to stay off my TikTok. It’s not helping",
      "created_utc": 1738469276.0,
      "score": 2
    },
    {
      "id": "mahytjc",
      "body": "Yes! I’m trying my hardest to stay away from the news and fb. I’ve also turned off alerts from national news apps. That’s helped a little.",
      "created_utc": 1738469310.0,
      "score": 3
    },
    {
      "id": "mai0xfs",
      "body": "I hate it as a hispanic born in the u.s i always have to make sure to look around for any white vans with the word border patrol in the parking lot of the places i love to go to i get it i don’t have to worry about it since i’m a citizen but it’s getting frustrating carrying my passport and other items with me at all costs since i’m most likely to get stopped and profiled due to my skin every day since inauguration day i always worry for myself or other people in my situation. I always get nervous when i see a police vehicle nowadays since i heard they are assisting with deportations as well.",
      "created_utc": 1738470127.0,
      "score": 3
    },
    {
      "id": "mai3a0r",
      "body": "Yes because at any moment my whole family can be deported, and I'd end up homeless or living in my car and lose everything.",
      "created_utc": 1738471076.0,
      "score": 2
    },
    {
      "id": "mai4ff3",
      "body": "No and it makes me think I might be dissociating. But my anxiety is very well managed these days. \n\nI have always been good in a crisis such as medical emergencies and then the emotion catches up with me after the fact. I think that’s what’s happening now. \n\nI won’t get into the politics if you’re already upset but I am preparing myself and reaching out to loved ones to do the same. Also probably getting back into activism. \n\nI would say try to do all the things you know to treat your anxiety, don’t be afraid of meds (got me through an awful breakup last year), and remember that you have survived all of your worst days until now. Remember times that you had to just get through it, this is my current mindset.",
      "created_utc": 1738471546.0,
      "score": 2
    },
    {
      "id": "maigv0v",
      "body": "Hi. Yes! All the time! \n\nLiterally every time I open my phone there’s a new notification about something awful he’s doing. I’m also in the political sector so it’s hard to avoid it. \n\nMy advice would be to close your phone every now and then, and engage with the people around you. Lean on your community. Volunteer. Rest. You are NOT alone, we’ll get through this.\n\nWhile it’s terrifying that history is repeating itself, remind yourself with that, fascism often collapses. \n\nWe’re in this together.",
      "created_utc": 1738476882.0,
      "score": 2
    },
    {
      "id": "maj9c7p",
      "body": "As a black man and DACA recipient with ADHD, autism, anxiety, and depression, this turn of events has made me feel detached from society. It seems people are only looking out for their own best interests at the expense of others and even themselves.",
      "created_utc": 1738492829.0,
      "score": 1
    },
    {
      "id": "maildf0",
      "body": "TDS",
      "created_utc": 1738479089.0,
      "score": 2
    },
    {
      "id": "majet3q",
      "body": "No - I don’t let politics rule my life.  The person in office rarely makes an impact on me to the extent I would get anxious over anything.",
      "created_utc": 1738496037.0,
      "score": 0
    },
    {
      "id": "maj0mh1",
      "body": "No. I have anxiety about other things.",
      "created_utc": 1738487640.0,
      "score": 1
    },
    {
      "id": "maid1p0",
      "body": "Yes. I don’t know how to help other than tell you I’m right there with you.",
      "created_utc": 1738475184.0,
      "score": 1
    },
    {
      "id": "maidhff",
      "body": "Yes and my depression is killer",
      "created_utc": 1738475371.0,
      "score": 1
    },
    {
      "id": "majlfvy",
      "body": "I recommend watching this. https://youtube.com/shorts/LqkSNovrbFo\n\nIn short, do your best to limit what you consume and try to hyper focus on certain areas instead of taking in everything.",
      "created_utc": 1738499582.0,
      "score": 1
    },
    {
      "id": "majrpq4",
      "body": "Oh yes. We need to limit our doomscrolling. Im learning to do that",
      "created_utc": 1738502399.0,
      "score": 1
    },
    {
      "id": "majsvfg",
      "body": "Yeah. It's driven me to drinking and weed. Gotten it more under control but I can only hope I'm in a relatively safe space and do my best. \n\n\nGood luck!",
      "created_utc": 1738502879.0,
      "score": 1
    },
    {
      "id": "majtbhe",
      "body": "It's so hard to watch the news anymore, my anxiety also spikes. It's easier to read it than listen for me personally.",
      "created_utc": 1738503063.0,
      "score": 1
    },
    {
      "id": "majtp8u",
      "body": "Yes. I am now on Zoloft and Atavan.",
      "created_utc": 1738503220.0,
      "score": 1
    },
    {
      "id": "majtvkt",
      "body": "Please take care of yourself. Make self care a priority, limit your social media and news access. Develop new hobbies such as knitting/crochet/embroidery to keep your hands busy. Exercise. Sleep. **it’s going to be a long four years, pace yourself**",
      "created_utc": 1738503290.0,
      "score": 1
    },
    {
      "id": "mak0ahw",
      "body": "YES!!!",
      "created_utc": 1738505722.0,
      "score": 1
    },
    {
      "id": "mak7d7y",
      "body": "Yeah. It’s hard not to catastrophize what might happen next with every news story. \n\nThe tariffs got my brain spinning yesterday with fears about how much more expensive everything is going to get and how international trade wars are going to make America suffer in a way our generation has never experienced. \n\nThis on top of the hostile changes they are making to every layer of government and threatening retribution for anyone standing in their way. This is feeling like a much darker chapter than Trump I, which was plenty dark.",
      "created_utc": 1738508152.0,
      "score": 1
    },
    {
      "id": "mak8z8g",
      "body": "Yep been using way more of my PRN in the last two weeks then a do on average in 3 months",
      "created_utc": 1738508681.0,
      "score": 1
    },
    {
      "id": "makdkzz",
      "body": "I listen to a podcast in the morning that is about 5-10 minutes long about the news and then try to avoid digging too deep the rest of the day. It’s called the Morning Announcements",
      "created_utc": 1738510132.0,
      "score": 1
    },
    {
      "id": "make9je",
      "body": "Make sure you’re taking some time for yourself and drinking lots of water and ensuring you keep yourself informed whilst also maintaining boundaries for your own mental health. If you need a chat, I’m here!",
      "created_utc": 1738510339.0,
      "score": 1
    },
    {
      "id": "makfgg7",
      "body": "Talked to my therapist about this yesterday. We’re all feeling this together and it sucks 😭😭😭",
      "created_utc": 1738510701.0,
      "score": 1
    },
    {
      "id": "makk9pp",
      "body": "Yes!! I have tried to stay informed but ultimately I deleted my Facebook (I live in a conservative state) to keep my mind at peace.",
      "created_utc": 1738512127.0,
      "score": 1
    },
    {
      "id": "makoi2k",
      "body": "Yes. I am in survival mode and barely functioning at my job. It is surreal.",
      "created_utc": 1738513361.0,
      "score": 1
    },
    {
      "id": "makpgcf",
      "body": "Not for the above listed reason.",
      "created_utc": 1738513638.0,
      "score": 1
    },
    {
      "id": "makvsqo",
      "body": "Everyday",
      "created_utc": 1738515457.0,
      "score": 1
    },
    {
      "id": "mal7a7w",
      "body": "Oh yeah…",
      "created_utc": 1738518616.0,
      "score": 1
    },
    {
      "id": "mally7z",
      "body": "The Founding Fathers created a system of checks and balances to prevent any one branch of government from becoming too powerful. I hope it stays this way.  Is Trump a sociopath, psychopath, narcissist, or a combination of all?",
      "created_utc": 1738522549.0,
      "score": 1
    },
    {
      "id": "malp6d7",
      "body": "Yes. I  hate that it's consuming me, and I think about it constantly.",
      "created_utc": 1738523432.0,
      "score": 1
    },
    {
      "id": "mam2411",
      "body": "Same. My sleep and appetite took a nosedive since the 20th.",
      "created_utc": 1738527048.0,
      "score": 1
    },
    {
      "id": "mam2rpy",
      "body": "Cut out the news completely! Also listen to or read this article called “Don’t believe him” by Ezra Kline. It helped take a lot of my fear away. Trump is a weak man don’t let him get in your head.",
      "created_utc": 1738527235.0,
      "score": 1
    },
    {
      "id": "mam5008",
      "body": "Yeppppp",
      "created_utc": 1738527879.0,
      "score": 1
    },
    {
      "id": "mam8lg7",
      "body": "I have hyperhidrosis so everyday is a battle in the frontlines when I left the womb.",
      "created_utc": 1738528927.0,
      "score": 1
    },
    {
      "id": "mam9rpg",
      "body": "Yeah. You're not alone. I'm afraid for my friends and I'm afraid for peace.",
      "created_utc": 1738529271.0,
      "score": 1
    },
    {
      "id": "mama3lj",
      "body": "All I can advise is do independent research on issues that worry you vs taking a title/click bait on an issue that worries you ❤️",
      "created_utc": 1738529369.0,
      "score": 1
    },
    {
      "id": "mamblea",
      "body": "My husband has taken my phone away a few times after finding me in my bed crying reading the feeds. I just feel like the country i was born in and my family have been since we became a country is out of control and headed to destruction. \n\nIt has made my anxiety hit overdrive.",
      "created_utc": 1738529802.0,
      "score": 1
    },
    {
      "id": "mamcapn",
      "body": "Not at all I’m very relieved and happy trump is in office",
      "created_utc": 1738530008.0,
      "score": 1
    },
    {
      "id": "mamccd7",
      "body": "Yes yes yes. Ever since the day he got elected, I have felt HORRIBLE and an impending sense of doom. As a queer woman who is firmly childfree stuck in a red state, I am TERRIFIED. I just cannot comprehend how SO many people fell for his bullshit.",
      "created_utc": 1738530021.0,
      "score": 1
    },
    {
      "id": "mamf9ey",
      "body": "I’ve been disassociating as much as I can. My parents refuse to get passports and keep saying “they can’t touch us cause we’re born here”, completely forgetting the 20+ years of their child telling them about fascism and Nazi Germany. \n\nI can’t leave my parents, if they don’t help themselves I have to resign to our fate.",
      "created_utc": 1738530878.0,
      "score": 1
    },
    {
      "id": "mamfj2o",
      "body": "I can’t handle the news anymore. Like I genuinely cannot it sends me into spiraling. I feel like a horrible person because I know people need to be informed for things to change but that person can’t be me. I will have continuous panic attacks over it :( I want to live somewhere else",
      "created_utc": 1738530958.0,
      "score": 1
    },
    {
      "id": "mamfjqc",
      "body": "Yes!",
      "created_utc": 1738530963.0,
      "score": 1
    },
    {
      "id": "mamkwbe",
      "body": "100%. I am diagnosed with Generalized Anxiety Disorder so I struggle with anxiety in general. But with everything going on in the world currently, my anxiety is so much worse. It’s so hard to have to keep going everyday, show up to work, & act like everything is “normal”. I feel a constant sense of doom. Social media used to be an escape for me, but now I’m torn between wanting to open the apps to stay informed because I know it will spike my anxiety. But I will say that I’m glad to hear that I’m not alone in feeling this way. Everyone hang in there, please don’t give up ❤️‍🩹",
      "created_utc": 1738532530.0,
      "score": 1
    },
    {
      "id": "mamlk9d",
      "body": "Before the inauguration for me but moreso in the last week or two.",
      "created_utc": 1738532724.0,
      "score": 1
    },
    {
      "id": "mamqdx9",
      "body": "Yes, absolutely.",
      "created_utc": 1738534161.0,
      "score": 1
    },
    {
      "id": "mamsq7q",
      "body": "It me!",
      "created_utc": 1738534866.0,
      "score": 1
    },
    {
      "id": "mamsuak",
      "body": "Yes, I'm in a red state but vote Democrat, I am disabled and working education.  I get them around big news and breaking events doom scrolling doesn't really help me either.  I'm working on looking at things I can control and possible things I could do if things all go to hell.  I haven't gotten to the latter as much yet.",
      "created_utc": 1738534900.0,
      "score": 1
    },
    {
      "id": "mamv9jr",
      "body": "American woman here and yes, I know exactly how you feel. The worst part is that it’s really difficult to tell anyone because a lot of people just. Don’t get it. They don’t care. They think it’s stupid to be so upset. Maybe I’m just overthinking but I can’t stop imagining finally telling someone what I’ve been struggling with since November and getting mocked in response for being so emotionally affected",
      "created_utc": 1738535640.0,
      "score": 1
    },
    {
      "id": "mamx4tq",
      "body": "100%",
      "created_utc": 1738536203.0,
      "score": 1
    },
    {
      "id": "mamxtc8",
      "body": "Yes! I’m moving to LA real soon so I can make more money (my agent and job are out there) and then I’m getting out of this country ASAP and honestly I suggest you do too and everyone. Our power will go out for days. If not weeks",
      "created_utc": 1738536409.0,
      "score": 1
    },
    {
      "id": "man2z2p",
      "body": "Can anyone help me? I've been stuck in a sort of anxiety loop for like 3 days. I feel like all hope is lost. :(",
      "created_utc": 1738538022.0,
      "score": 1
    },
    {
      "id": "man30wy",
      "body": "I’ve been dissociating since October….",
      "created_utc": 1738538039.0,
      "score": 1
    },
    {
      "id": "man40bx",
      "body": "I’m considering leaving the country.",
      "created_utc": 1738538356.0,
      "score": 1
    },
    {
      "id": "man6bju",
      "body": "Yes. I’m terrified. My anxiety has never been this bad. I feel like I’m losing my mind.",
      "created_utc": 1738539103.0,
      "score": 1
    },
    {
      "id": "man94nt",
      "body": "I have felt constantly on the verge of panic since the genocide in Gaza escalated, I understand the feeling OP. I think we have to find a healthy balance of engaging with the realities around us because Americans have this way of burying our heads in the sand until things directly impact us - but the shit has been hitting the fan for ages now. I say this as a fellow American who is trying to find that balance and failing. My mental health is only as okay as it is because I've been in therapy for years and because I have been prioritizing leaving space for some hobbies and self improvement - but that's easy for me to do since I am self-employed.\n\nI think those who bury their heads in the sand will regret not engaging with the news, but maybe avoiding tv news - which is sensationalistic af and also often not all that informative - is a way to approach news without losing brain cells.\n\nAlso, we will become increasingly alienated. If possible try to make relationships with likeminded people in your community, get involved in organizing and things that interest you in general. Read theory, if possible. It's time to acknowledge things have been very bad for a very long time.",
      "created_utc": 1738540010.0,
      "score": 1
    },
    {
      "id": "man9kgb",
      "body": "Yes, which is why I turned it all off. No Facebook, no tv, very little Reddit (I unsubscribed to a TON of subreddits recently that have just devolved into people fighting constantly about everything, all the time) it's all gone. And it has increased my peace SO SO much. I promise, you won't miss out on anything that is important. You will find what truly is important when you choose what you  listen to and read. Social media has become garbage and the news is just scaring everyone more and more everyday. It's awful. Turn it off. Much love to you.",
      "created_utc": 1738540151.0,
      "score": 1
    },
    {
      "id": "manhoi2",
      "body": "Yes. I started therapy at the end of last year and thankfully on meds now but since this new administration, I’ve had daily panic attacks. I wake up with one and go to bed with one. \nI’m at a loss.",
      "created_utc": 1738542771.0,
      "score": 1
    },
    {
      "id": "manluf9",
      "body": "Yes! I have been trying to distract myself by focusing on work and hobbies and avoiding most of the news. I just try to live my best life and not think about how bad things are getting.",
      "created_utc": 1738544122.0,
      "score": 1
    },
    {
      "id": "manoire",
      "body": "I’ve started to combat by being extra kind to others and doing more acts of service for others. It has helped",
      "created_utc": 1738544995.0,
      "score": 1
    },
    {
      "id": "manqqot",
      "body": "Absolutely. I started meds.",
      "created_utc": 1738545713.0,
      "score": 1
    },
    {
      "id": "manupjk",
      "body": "Oh that's a feature, not a bug! 😭",
      "created_utc": 1738546993.0,
      "score": 1
    },
    {
      "id": "manvrt6",
      "body": "I’m struggling more than I have my whole life. Something in my broke after Election Day/inauguration. I’m struggling to do anything. I’m already on enough anxiety meds, that I don’t want to take more. But the anxiety is making it hard to be present for my daughter… and I’m not sure how to just take a break.",
      "created_utc": 1738547330.0,
      "score": 1
    },
    {
      "id": "manxwo2",
      "body": "Yup",
      "created_utc": 1738548022.0,
      "score": 1
    },
    {
      "id": "manywvy",
      "body": "Transgender individual here…\nI hear you.",
      "created_utc": 1738548351.0,
      "score": 1
    },
    {
      "id": "manzgfq",
      "body": "I've gotten chronic constipation from all the anxiety and dread since then",
      "created_utc": 1738548526.0,
      "score": 1
    },
    {
      "id": "manzgyu",
      "body": "I feel you. Most nights I haven’t been able to sleep until 2-3 am because I am up reading news and freaking out about how bad it has gotten, so quickly. I had to delete my twitter because I was just scrolling for hours. It feels like the country is on fire.",
      "created_utc": 1738548531.0,
      "score": 1
    },
    {
      "id": "manzvy0",
      "body": "I have taken social media away from myself. I started using a flip phone. It's helped me a lot. Most of what will happen is out of my control. There's no point in doom scrolling. Since I have anxiety I'm always preparing for the worst anyways so it's not too much of a difference, I just don't feed my anxiety as much now.",
      "created_utc": 1738548667.0,
      "score": 1
    },
    {
      "id": "mao23q0",
      "body": "I fee the exact same way. I have 3 autoimmune diseases, fibromyalgia, adhd, mdd and anxiety. On top of that I haven't been able to get my biologic meds at all this year. Insurance companies and doctor's offices are moving weird this year, and it's just adding to the stress. I want to be engaged, informed, and active, but it's so difficult when my pain is going unchecked and my anxiety is through the roof. I'm seeing the effects of these political stunts in my family and friends and I want to fight for them, too.",
      "created_utc": 1738549399.0,
      "score": 1
    },
    {
      "id": "mao62tw",
      "body": "100%. i have to keep reminding myself that this is temporary and we’ve been through this before, but it still freaks me out. but that’s exactly what they want, for us to be scared. i’ve been trying to focus on what i can control within my own reach.",
      "created_utc": 1738550703.0,
      "score": 1
    },
    {
      "id": "maoal4z",
      "body": "Yea, I’m pretty much at the end of my rope (figuratively speaking).  It’s just too much to process at this point!",
      "created_utc": 1738552207.0,
      "score": 1
    },
    {
      "id": "maofa4l",
      "body": "I limit my intake of rage bait and try to follow center and moderate sites",
      "created_utc": 1738553822.0,
      "score": 1
    },
    {
      "id": "maoifq9",
      "body": "I'm in the same boat as you as a chronically ill WOC and I absolutely have been, when not dissociating, which has now become a problem. I'm staying informed (it's all stupid and ugly, this country is a joke and kakistocracy) to know when we can seek asylum, but also doing A LOT of self care.",
      "created_utc": 1738554941.0,
      "score": 1
    },
    {
      "id": "maomy9p",
      "body": "Yep. I’m non-binary, disabled and attempting to go back to school. I want to stay informed but have been having nightmares every night. At this point it feels very gloomy.\n\nJust taking it day by day. Stay safe!",
      "created_utc": 1738556637.0,
      "score": 1
    },
    {
      "id": "maon4b9",
      "body": "Yes. Honestly I don't know how to cope with this. I've been suffering with anxiety on and off for like 3 days now. I just don't know what to do.",
      "created_utc": 1738556702.0,
      "score": 1
    },
    {
      "id": "maonkh6",
      "body": "It’s been very hard recently",
      "created_utc": 1738556877.0,
      "score": 1
    },
    {
      "id": "map85ft",
      "body": "Nope, I’m ready to give anything different a chance, what’s been going on hasn’t been working. It’s just 4 years, if it makes things worse we can do something else.",
      "created_utc": 1738566488.0,
      "score": 1
    },
    {
      "id": "map9grv",
      "body": "I just had a text conversation with my dad this afternoon about this exact thing.\n\nHis response, boiled down: Don't worry, be happy. Think positive. Don't waste energy on what-ifs and negative thoughts.\n\nI finally had the chance to explain that Anxiety, Depression, C-PTSD, ADHD, and Autism don't allow my brain to work like that and the energy I have is rarely enough to get out of bed to take my meds that get me through the rest of each day.",
      "created_utc": 1738567228.0,
      "score": 1
    },
    {
      "id": "mapadjj",
      "body": "Stop watching the news and start writing to your congress critter. Literally, if you don’t like something, let your reps know. They want to be re-elected. Also, stay more active in local and State politics, it affects you far more than Federal, and it’s impact is more immediate.\n\nAs for Federal gov worries, review the history of Andrew Jackson. There is a lot of parallels of 47 with that of Andrew Jackson. Yes, it can be scary but there isn’t much else you can do other than what I suggested above. Just enjoy your life.",
      "created_utc": 1738567739.0,
      "score": 1
    },
    {
      "id": "mapg0my",
      "body": "It is important to be informed, however as someone who also has an autoimmune condition it is really important to take care of yourself. You have to come first, these things are currently out of our control. Rest is resistance. Do what you can to feel better about our current political climate(impossible as it is unsettling, scary, serious, and affects real people lives and outcomes). Find like minded individuals who have shared values in your community to pull you away from the panic.",
      "created_utc": 1738571082.0,
      "score": 1
    },
    {
      "id": "maphc4e",
      "body": "I'm also a woman, and I'm trans, so everyday has been a struggle between the urge to just collapse and drive to stay alive out of pure spite",
      "created_utc": 1738571907.0,
      "score": 1
    },
    {
      "id": "maq7h3h",
      "body": "I'm a queer woman and yes",
      "created_utc": 1738586635.0,
      "score": 1
    },
    {
      "id": "maj0qqq",
      "body": "No.",
      "created_utc": 1738487708.0,
      "score": 1
    },
    {
      "id": "majqbey",
      "body": "No",
      "created_utc": 1738501803.0,
      "score": 1
    },
    {
      "id": "mahvenl",
      "body": "I'm a white woman with chronic pain and autoimmune issues.  I have a biracial son.  I'm a HUGE supporter of WOC and believe in my heart that yall will change the world.  \n\nHowever, sometimes you need to take the cape off and take a break.  I know it's hard right now because the news is so overwhelming that you feel like you need to stay educated and pay attention. I am struggling with the same.  \n\nBut, I think I am taking a few days off starting tomorrow.  Protecting my peace, focusing on my health and happiness (if I can muster some). Autoimmune disorders are so much worse with stress.  \n\nJust know you're not alone.  A lot of us anxiety folks are struggling.  In 2016, I was so close to a complete breakdown, and I will not do that again.  History proves worse has happened, and we've overcome it.  Trump will be faced eventually, with repercussions.  Hugs.",
      "created_utc": 1738468045.0,
      "score": -4
    },
    {
      "id": "mahw3np",
      "body": "I haven't watched the news in weeks lol",
      "created_utc": 1738468297.0,
      "score": 2
    },
    {
      "id": "mahy6xr",
      "body": "Yes. I'm going to find an activist group to join. Generally doing something about fear helps.\n\nThen you can say 'I did all I could, the rest is out of my control, and if I shall fall, it will be fighting.'",
      "created_utc": 1738469070.0,
      "score": -2
    },
    {
      "id": "mai829c",
      "body": "I know this isn’t necessarily the right path, but it’s the path I took a few years ago when I realized the whole thing was just a crappy reality show…. I turned it off. Just as if it was a TV show. Because that’s all it is. I may not be informed or up to date, but I stopped caring years ago. It’s always the same fear mongering by the media, some ego maniac or idiot in power making dumb decisions or saying stupid things. For me? Just not worth it. It either will be or it won’t and constantly focusing my energy and thoughts on it only causes me suffering. And my happiness is more important. \n\nNot saying it’s the right way or the wrong way. But it works wonders for me.",
      "created_utc": 1738473101.0,
      "score": 1
    },
    {
      "id": "mahwnis",
      "body": "Yeah, definitely feel that way.",
      "created_utc": 1738468497.0,
      "score": 0
    },
    {
      "id": "mai3dij",
      "body": "Yes. I am too.",
      "created_utc": 1738471117.0,
      "score": 1
    },
    {
      "id": "mai5z57",
      "body": "same! I have to skip videos online because when I see or hear what he is doing I get so terrified & angry. I am so scared for anyone that is a non white male. He has so many undeniable comparisons to Hitler. He got into office saying that the jews (immigrants) were ruining the country, they were his target. He literally said that he was going to make Germany great again.",
      "created_utc": 1738472201.0,
      "score": 1
    },
    {
      "id": "mai6ysn",
      "body": "Sis, I stop watching the news too. I put my energy back to myself, doing the things I love, caring for my pets and caring about friends, family and my community. I feel much better.",
      "created_utc": 1738472626.0,
      "score": 1
    },
    {
      "id": "mai8rqh",
      "body": "Yep.  I have to have an echcardiagram on Wednesday since he took office it feels like my heart is jumping, and I can feel my heartbeat in my throat constantly.",
      "created_utc": 1738473408.0,
      "score": 1
    },
    {
      "id": "maidxcb",
      "body": "[this is fine ](https://imgur.com/a/WXDcTBV)",
      "created_utc": 1738475560.0,
      "score": 1
    },
    {
      "id": "maimqyj",
      "body": "Yes, but there's nothing I can currently do Bout it",
      "created_utc": 1738479796.0,
      "score": 1
    },
    {
      "id": "maiqwdf",
      "body": "This post used to say something, but now it doesn't. Respect the privacy of yourself & others.",
      "created_utc": 1738482027.0,
      "score": 1
    },
    {
      "id": "maix0di",
      "body": "Yes. I have cried over his BS more than once, but I have also utilized what power I have to fight back. I have been active signing petitions and writing to various local senators and congresspeople. I refuse to stay down without a fight because I cannot let them win.",
      "created_utc": 1738485494.0,
      "score": 1
    },
    {
      "id": "maj2mz8",
      "body": "Yes. 100000%. You are not alone and it is scary.",
      "created_utc": 1738488833.0,
      "score": 1
    },
    {
      "id": "maj9sof",
      "body": "Yea my anxiety is through the roof! I tried to tell my psychiatrist about it this morning but he said just pray to god… so now I’m healed /s",
      "created_utc": 1738493106.0,
      "score": 1
    },
    {
      "id": "majafsz",
      "body": "Yes. I can’t do anything. Executive dysfunction max",
      "created_utc": 1738493486.0,
      "score": 1
    },
    {
      "id": "majii15",
      "body": "Yes. I was at work the other day and I almost lost it when my customer asked me if I was going to watch the Super Bowl…",
      "created_utc": 1738498082.0,
      "score": 1
    },
    {
      "id": "majioae",
      "body": "Daily!",
      "created_utc": 1738498173.0,
      "score": 1
    },
    {
      "id": "majkc4w",
      "body": "I'm not even American,  I'm UK and feel anxious about it. Especially all the stuff about women's reproductive health. It's scary. Yet I don't know if I'm just reading too much on reddit as well.",
      "created_utc": 1738499027.0,
      "score": 1
    },
    {
      "id": "majm9a1",
      "body": "As a trans queer poc no",
      "created_utc": 1738499979.0,
      "score": 1
    },
    {
      "id": "majsigg",
      "body": "i feel that. i’m a trans woman who was planning to transition this fall when i left for college and that doesn’t seem like it’ll be possible anymore. i’m trying to just distract myself as much as i can to avoid letting the despair set in",
      "created_utc": 1738502729.0,
      "score": 1
    },
    {
      "id": "majtlry",
      "body": "Have a margarita, don’t turn on HbO.  You’ll be fine",
      "created_utc": 1738503180.0,
      "score": 1
    },
    {
      "id": "mai3jn3",
      "body": "Get off the internet. You’ll be fine.",
      "created_utc": 1738471186.0,
      "score": -5
    },
    {
      "id": "mairh08",
      "body": "[deleted]",
      "created_utc": 1738482345.0,
      "score": -3
    },
    {
      "id": "mahu7qq",
      "body": "Yep",
      "created_utc": 1738467618.0,
      "score": -6
    },
    {
      "id": "mahue0l",
      "body": "Yes. ",
      "created_utc": 1738467680.0,
      "score": -3
    },
    {
      "id": "mai4gdb",
      "body": "Yes but I’m Australian. Female and disabled too, and partially native",
      "created_utc": 1738471557.0,
      "score": 0
    },
    {
      "id": "makya68",
      "body": "No 🤣",
      "created_utc": 1738516147.0,
      "score": 0
    },
    {
      "id": "mal4gge",
      "body": "No",
      "created_utc": 1738517863.0,
      "score": 0
    },
    {
      "id": "mahv1ra",
      "body": "Nope",
      "created_utc": 1738467915.0,
      "score": -26
    },
    {
      "id": "mahw3v6",
      "body": "No",
      "created_utc": 1738468299.0,
      "score": -20
    },
    {
      "id": "manz7yw",
      "body": "RFK’s goal includes addressing the chronic disease epidemic.",
      "created_utc": 1738548450.0,
      "score": 0
    },
    {
      "id": "maooh3y",
      "body": "Nope.  Go out and get some fresh air.  Rediscover your hobbies and passions.  Focus on what’s important.  Be an active member of your community.  Be useful.",
      "created_utc": 1738557234.0,
      "score": 0
    },
    {
      "id": "mahwpla",
      "body": "Nope!",
      "created_utc": 1738468519.0,
      "score": -21
    },
    {
      "id": "mahue5q",
      "body": "[removed]",
      "created_utc": 1738467681.0,
      "score": -26
    },
    {
      "id": "mahypp2",
      "body": "Let’s say your on instagram a lot. You can go to settings and put a daily reminder like less than 15 mins a day and instagram will remind you so you won’t be hours worrying about what’s happening and triggering more than what we already are",
      "created_utc": 1738469270.0,
      "score": -2
    },
    {
      "id": "maipcir",
      "body": "Pretty sure the entire left are in that category lol",
      "created_utc": 1738481176.0,
      "score": -10
    },
    {
      "id": "majby39",
      "body": "No, quite the opposite.\n\nI feel very good for the first time in a while.",
      "created_utc": 1738494374.0,
      "score": -9
    },
    {
      "id": "mahx2nc",
      "body": "Nope. I learned to accept that new leadership is going to be a good thing for all of us.",
      "created_utc": 1738468653.0,
      "score": -29
    },
    {
      "id": "maiquqm",
      "body": "If you have been watching the news for decades, have you noticed they tend to exaggerate, sometimes are writing something based of “allegedly” “sources” “reportedly” much is inaccurate, deceiving.",
      "created_utc": 1738482002.0,
      "score": -1
    },
    {
      "id": "mao9fjm",
      "body": "Grow up and live your life.",
      "created_utc": 1738551819.0,
      "score": -1
    },
    {
      "id": "malif41",
      "body": "No",
      "created_utc": 1738521596.0,
      "score": 0
    },
    {
      "id": "mamqlji",
      "body": "no",
      "created_utc": 1738534225.0,
      "score": 0
    },
    {
      "id": "maijrma",
      "body": "No. Even after the last four years of insane crap  the previous administration put this country and its people through I had no attacks from political or social issues. It's the little everyday life things that cause anxiety in me. Over the years, I've learned how to separate the big issues I have no control over with the stuff I can. It helps in managing my anxiety.",
      "created_utc": 1738478290.0,
      "score": -9
    },
    {
      "id": "maiq75x",
      "body": "Nope, as a minority it seems like for me nothing has really changed. I chose to use services like Ground News to get up to speed and determine whether or not what is being parroted is actually true on Reddit.",
      "created_utc": 1738481638.0,
      "score": -7
    },
    {
      "id": "mai002x",
      "body": "My life didn't change when Trump was in office the first time. Didn't change when Biden took office. Hasn't changed the second time with Trump. Doesn't really seem to matter who is in office.",
      "created_utc": 1738469766.0,
      "score": -3
    },
    {
      "id": "malh6g0",
      "body": "Nope, this is the most peace I've felt with my government in the last four years",
      "created_utc": 1738521262.0,
      "score": -4
    },
    {
      "id": "mai3x3s",
      "body": "I'm not American nor do I live in America, Can someone explain to me why \" A lot of Americans \" Are feeling anxious about Trump taking the lead ?",
      "created_utc": 1738471339.0,
      "score": -1
    },
    {
      "id": "maji5q4",
      "body": "A friend, a woman of color who recently got her green card, once told me that I was extremely privileged for not being able to keep up with what’s going on all the time…\n\nWhile that was hurtful, I wasn’t even mad. She doesn’t have anxiety and doesn’t understand… It doesn’t feel like a privilege, it feels like a curse… I can’t be as informed as I want to be. I want to know… I want to fight… but I’m barely keeping my head above water.",
      "created_utc": 1738497898.0,
      "score": -1
    },
    {
      "id": "maonci7",
      "body": "Have you considered therapy?",
      "created_utc": 1738556791.0,
      "score": -1
    },
    {
      "id": "mak8oqc",
      "body": "No, I have real life problems to worry about.",
      "created_utc": 1738508587.0,
      "score": -6
    },
    {
      "id": "makgvm6",
      "body": "No I feel so much better that things are going to get better for Americans \n\n❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️",
      "created_utc": 1738511132.0,
      "score": -5
    },
    {
      "id": "mal3iz5",
      "body": "Did the world fall apart when he was president the first time? No. If the opposing candidate was so awesome, she wouldn't have lost by a landslide. A vast majority of voters wanted him in. The side that didn't is going to make it seem like the end of the world is near. It's not. We'll all be fine.",
      "created_utc": 1738517604.0,
      "score": -2
    },
    {
      "id": "maltu07",
      "body": "Nope I feel great. Got a great man leading again",
      "created_utc": 1738524716.0,
      "score": -2
    },
    {
      "id": "maludp5",
      "body": "No.",
      "created_utc": 1738524867.0,
      "score": -2
    },
    {
      "id": "mam6ss9",
      "body": "Stop watching the news and get off social media. Many people have just simply gotten off all media and has helped greatly with self care mental well being.",
      "created_utc": 1738528405.0,
      "score": -2
    },
    {
      "id": "mamqp4w",
      "body": "I really think some people need some serious help! Life is hard….",
      "created_utc": 1738534256.0,
      "score": -2
    },
    {
      "id": "makohbw",
      "body": "Nope. Cause I don’t need the news to spoon feed me my thoughts.",
      "created_utc": 1738513355.0,
      "score": -3
    },
    {
      "id": "malotjo",
      "body": "No, I’m not a bitch",
      "created_utc": 1738523334.0,
      "score": -3
    },
    {
      "id": "makfd0f",
      "body": "Let’s keep political conversations out of r/anxiety ",
      "created_utc": 1738510672.0,
      "score": -6
    },
    {
      "id": "maibwa8",
      "body": "[removed]",
      "created_utc": 1738474707.0,
      "score": -11
    },
    {
      "id": "malej47",
      "body": "Your boss is an idiot.",
      "created_utc": 1738520552.0,
      "score": 36
    },
    {
      "id": "maie1c4",
      "body": "I can't distract myself enough. I drove 80 miles today no where in particular just to not stare at my phone.\n\nI am also chronically ill but, jfc if my intrusive thoughts have ratcheted up.",
      "created_utc": 1738475608.0,
      "score": 143
    },
    {
      "id": "maioli4",
      "body": "Read the news; not the pundits, not the comments.",
      "created_utc": 1738480768.0,
      "score": 45
    },
    {
      "id": "mai7feb",
      "body": "I’m struggling too! Woman here, also with chronic illnesses and a pending autoimmune problem. I’m not well!",
      "created_utc": 1738472823.0,
      "score": 169
    },
    {
      "id": "majbcyv",
      "body": "Yes, this. I am trying to check in with the news only once a day - news junkie here - and otherwise paying more attention to my loved ones, planning my garden, kissing my pets, and focusing on local community.",
      "created_utc": 1738494027.0,
      "score": 25
    },
    {
      "id": "man0flw",
      "body": "I deleted Twitter. I think it took years off my life being addicted to it for the first term, I knew I couldn’t do it again.",
      "created_utc": 1738537217.0,
      "score": 10
    },
    {
      "id": "maigx9q",
      "body": "I feel you so hard!! But we do need to rest and unwind for our mental health so don’t forget to do that every now and then.",
      "created_utc": 1738476912.0,
      "score": 20
    },
    {
      "id": "majmmac",
      "body": "👆🏻I just can’t settle down. The anxiety is overwhelming",
      "created_utc": 1738500150.0,
      "score": 20
    },
    {
      "id": "maod8kh",
      "body": "YUP I really need to get off insta and reddit but :/",
      "created_utc": 1738553113.0,
      "score": 4
    },
    {
      "id": "mai3au9",
      "body": ">almost daily because going through the motions and sending my stupid little emails just feels so wrong as all of this unfolds\n\nAbsolutely..... Like, I guess this is how Germans felt in 1933-36 or so",
      "created_utc": 1738471086.0,
      "score": 56
    },
    {
      "id": "majvsna",
      "body": "Mine died the other night. I ended up not bothering to charge it until I went to bed, it was kinda nice. No distractions. I drew in my journal, watched Arthur on my pc (there's no social media or anything on it that can distract me, apart from games and Plex).",
      "created_utc": 1738504041.0,
      "score": 10
    },
    {
      "id": "maicdar",
      "body": "I support this ❤️",
      "created_utc": 1738474902.0,
      "score": 4
    },
    {
      "id": "mahz9i6",
      "body": "Focus on things you can control. So important. From there you can try to expand out but take care of yourself",
      "created_utc": 1738469481.0,
      "score": 75
    },
    {
      "id": "maic0kb",
      "body": "Intensive outpatient program ? May I ask what that entails? Therapy ?",
      "created_utc": 1738474756.0,
      "score": 8
    },
    {
      "id": "makajvv",
      "body": "Can I ask please the mg dose you take. I have been prescribed  2mg, and it does absolutely  nothing. I, too, am an anxious  mess, and I'm in the UK . I'm so sorry you are suffering  too.",
      "created_utc": 1738509187.0,
      "score": 11
    },
    {
      "id": "mam52m2",
      "body": "Don’t feel embarrassed.   For me it’s the same.  Just klonopin instead of Valium. (1mg)\n\nI’m sure many of us are in the same boat",
      "created_utc": 1738527900.0,
      "score": 7
    },
    {
      "id": "mamkepn",
      "body": "I’d add : do something fun but also try to do something meaningful. Volunteer w local orgs and political groups. You can make a difference if we all do these little things together. We can make a difference. Let’s hope for the best for the midterms and let’s try to get involved in our communities to contribute to the changes that we want to see.",
      "created_utc": 1738532388.0,
      "score": 8
    },
    {
      "id": "maiatev",
      "body": "I would like to add that the media is a business that makes profit. They report the news in a way that keeps you scared and they want you to watch more.",
      "created_utc": 1738474262.0,
      "score": 55
    },
    {
      "id": "maihoml",
      "body": "Thank you for explaining it like this. That really helped to read. 🩷",
      "created_utc": 1738477273.0,
      "score": 10
    },
    {
      "id": "male4bb",
      "body": "A friend laughy fled to Canada the first Trump term, I asked her if she has a spot in her garage I could sleep in.",
      "created_utc": 1738520444.0,
      "score": 9
    },
    {
      "id": "makat7t",
      "body": "Will you chill out and give the new guy a chance? It has not been very long. Under the last administration we were totally crashing. Had it not changed; we'd be worrying about what Country is going to overtake us. We have a chance. Our President and VP show up for work. Last 4 years it was constant vacation time. How could that make anyone feel safe?",
      "created_utc": 1738509269.0,
      "score": -23
    },
    {
      "id": "maj7wfa",
      "body": "Thank you for this.",
      "created_utc": 1738491962.0,
      "score": 7
    },
    {
      "id": "malwozu",
      "body": "[removed]",
      "created_utc": 1738525516.0,
      "score": -9
    },
    {
      "id": "maiai6d",
      "body": "Some people tell me my hands are red but it seems normal to me. It's a weird situation.",
      "created_utc": 1738474137.0,
      "score": 6
    },
    {
      "id": "mamvl53",
      "body": "We're watching PBS, lots and lots of PBS.",
      "created_utc": 1738535736.0,
      "score": 1
    },
    {
      "id": "mak819n",
      "body": "I’m so sorry",
      "created_utc": 1738508373.0,
      "score": 8
    },
    {
      "id": "maodofs",
      "body": "I’m so sorry your partner’s sister was almost taken. I am also trans, and biracial, and am terrified to go anywhere but I am fortunate to live in a safer state. I saw a YouTube video that said POC should start carrying papers to be safe. I have ADHD and lose everything but I might try to be diligent about carrying mine cuz ICE has been spotted many places here, too.",
      "created_utc": 1738553265.0,
      "score": 4
    },
    {
      "id": "mahz31s",
      "body": "I just deactivated my Instagram and while I still use reddit, I have found my anxiety is much more manageable without Instagram. We do not have to be constantly informed to be decent citizens.",
      "created_utc": 1738469413.0,
      "score": 29
    },
    {
      "id": "mak9a22",
      "body": "Ive been off social media since 2017. I love participating in youtube live streams. The small ones are the best. Some are issues for my generation, others are technology based/ internet freedom. There are other important things to learn about. I give no care about mainstream news. \nPlease don't watch the view. I think that goes without saying.",
      "created_utc": 1738508780.0,
      "score": 1
    },
    {
      "id": "malflz3",
      "body": "Yes, but damn I was on zoloft & it killed my sex drive, Then I quit & my sex live has not come back, it's bad, makes my balls hurt. 🤣",
      "created_utc": 1738520840.0,
      "score": 1
    },
    {
      "id": "mahz8k7",
      "body": "I have a trip coming up in April and I’m sooo dreading it like never before",
      "created_utc": 1738469471.0,
      "score": 24
    },
    {
      "id": "maieo5q",
      "body": "I live in a staunchly blue state and there are still MAGAts here shopping in Costco like it’s nothing. Nobody is standing up to literal proud facists and it constantly makes me panic. It’s so triggering.",
      "created_utc": 1738475886.0,
      "score": 20
    },
    {
      "id": "mak7qdl",
      "body": "This is very good advice. ❤️",
      "created_utc": 1738508273.0,
      "score": 3
    },
    {
      "id": "mamkl0n",
      "body": "I’d add : take some time and practice self care. but also try to do something meaningful. Volunteer w local orgs and political groups. You can make a difference if we all do these little things together. We can make a difference. Let’s hope for the best for the midterms and let’s try to get involved in our communities to contribute to the changes that we want to see.",
      "created_utc": 1738532438.0,
      "score": 1
    },
    {
      "id": "makba0r",
      "body": "Because you lived in California! Fires, crimes and homeless. I would be anxious too.",
      "created_utc": 1738509419.0,
      "score": -8
    },
    {
      "id": "maijnti",
      "body": "Make sure you're drinking plenty of water!",
      "created_utc": 1738478237.0,
      "score": 10
    },
    {
      "id": "maietss",
      "body": "Deep breathing really helps me. I’ll catch myself holding my breath.",
      "created_utc": 1738475954.0,
      "score": 10
    },
    {
      "id": "makw9cp",
      "body": "🫂",
      "created_utc": 1738515584.0,
      "score": 2
    },
    {
      "id": "maih88o",
      "body": "So sorry about these ridiculous tariffs. I’m an American who lived in Canada for 2.5 years and I’m devastated with how our relationship as countries is actively being destroyed by this scumbag.",
      "created_utc": 1738477056.0,
      "score": 25
    },
    {
      "id": "malex5p",
      "body": "Well at least Canada is targeting Red Trump States for tariffs, hope they love those 10$ a dozen egg prices.",
      "created_utc": 1738520656.0,
      "score": 10
    },
    {
      "id": "maicf5p",
      "body": "May I ask why, genuine question",
      "created_utc": 1738474924.0,
      "score": -10
    },
    {
      "id": "makorcw",
      "body": "Were you this worried during former administrations that deported MILLIONS ON MILLIONS?",
      "created_utc": 1738513435.0,
      "score": -2
    },
    {
      "id": "maleff9",
      "body": "Reddit didn't fire everybody in the FBI, the Finance protection Chief & people in air traffic control.",
      "created_utc": 1738520525.0,
      "score": 3
    },
    {
      "id": "malpxnk",
      "body": "I understand. The cost of my medications has already sky rocketed with the lift on the price cap. Ava being told repeatedly not to panic hasn’t been helpful.",
      "created_utc": 1738523640.0,
      "score": 2
    },
    {
      "id": "maoha0f",
      "body": "But like, how do I know that video isn’t ALSO psyop??? I’m having fucking trust issues over here bro",
      "created_utc": 1738554520.0,
      "score": 2
    },
    {
      "id": "maoft8v",
      "body": "I’m also trans, and a POC, with chronic pain and an autoimmune disease. I can’t turn my mind off of the absolute worst case scenarios",
      "created_utc": 1738554007.0,
      "score": 3
    },
    {
      "id": "malai1r",
      "body": "I’m so sorry you have to deal with this. Trans people should not be treated as they currently are, it’s absolutely awful and I wish I could help somehow. ",
      "created_utc": 1738519478.0,
      "score": 3
    },
    {
      "id": "mai26o6",
      "body": "[removed]",
      "created_utc": 1738470633.0,
      "score": -16
    },
    {
      "id": "maifmx1",
      "body": "Correction: It is not their government trying to start fights, it is that orange piece of trash inciting the world.",
      "created_utc": 1738476319.0,
      "score": 10
    },
    {
      "id": "maj54yx",
      "body": "Just one horrible person.\n\nWe love you, Canada!",
      "created_utc": 1738490323.0,
      "score": 3
    },
    {
      "id": "maii91n",
      "body": "Citizen or not nobody deserves that. I’m sorry you’re going through that. You’re in my thoughts.",
      "created_utc": 1738477545.0,
      "score": 7
    },
    {
      "id": "mb4h7od",
      "body": "This content has been removed. We require that all posts be of a supportive nature.",
      "created_utc": 1738771313.0,
      "score": 1
    },
    {
      "id": "maib1g4",
      "body": "I wouldn't say it's an addiction. Some people like watching a lot of news and they like politics",
      "created_utc": 1738474353.0,
      "score": 1
    },
    {
      "id": "majb08g",
      "body": "getting downvoted for being right 😭",
      "created_utc": 1738493822.0,
      "score": -1
    },
    {
      "id": "mahv6a5",
      "body": "Same to the last part",
      "created_utc": 1738467960.0,
      "score": -21
    },
    {
      "id": "maivz2q",
      "body": "Do you believe that the things he has done since taking office have been a net positive for the country, or for you personally?",
      "created_utc": 1738484892.0,
      "score": 5
    },
    {
      "id": "mai9q8l",
      "body": "You mean like the last time when Covid took over. Sheesh",
      "created_utc": 1738473817.0,
      "score": 9
    },
    {
      "id": "mai3xug",
      "body": "We aren’t all billionaires",
      "created_utc": 1738471348.0,
      "score": 10
    },
    {
      "id": "maia0ur",
      "body": "Can you break down, specifically, why you think that in regards to woman and people of color?",
      "created_utc": 1738473939.0,
      "score": 9
    },
    {
      "id": "makp9nz",
      "body": "Given how much current events are a leading cause of anxiety for so many right now, I don't feel that's a realistic option.",
      "created_utc": 1738513584.0,
      "score": 5
    },
    {
      "id": "mak2sdh",
      "body": "This content has been removed. We require that all posts be of a supportive nature.",
      "created_utc": 1738506599.0,
      "score": 1
    },
    {
      "id": "makg7sj",
      "body": "Driving is the way I allow my mind to free associate. Just music and the road. At this point, we all need to find those moments that we can disconnect from reality, so we don’t get burned out. It’s going to be a long two years til midterms.",
      "created_utc": 1738510930.0,
      "score": 44
    },
    {
      "id": "mak7jw9",
      "body": "It would have been much better if you took a nice long walk. You could have drove to a mall and not deal with weather. Driving or scrolling not great for your health.",
      "created_utc": 1738508213.0,
      "score": -3
    },
    {
      "id": "malgtsh",
      "body": "I really need to remember this. I've gotten in a bad habit the past couple days of reading comments and then panicking. Thank you.",
      "created_utc": 1738521168.0,
      "score": 18
    },
    {
      "id": "mamfdz3",
      "body": "Most of the news is owned by one conglomerate and they are not reporting things like the multitude of protests going on.",
      "created_utc": 1738530915.0,
      "score": 10
    },
    {
      "id": "makoviu",
      "body": "& not the instagram, fb, twitter trolls too",
      "created_utc": 1738513469.0,
      "score": 9
    },
    {
      "id": "mainvnw",
      "body": "Plz don't. We can't let some male we don't know nor would ever want to know who is evil to his core to affect us\n\nWell, i decided not to let that demon in office phase me.\n\nAnd considering i hv health challenges as well, I refuse to give AHoles like him and his supporters any of my energy, time, or peace of mind!\n\nAnd I don't watch any news that involves him either\n\nSo, it's a choice, really. \n\nDon't let Rump's evil spirit take u to task at all. \n\nThere are too many other things you could be focused on that brings you joy or peace.",
      "created_utc": 1738480387.0,
      "score": 44
    },
    {
      "id": "maizhdq",
      "body": "So, has there been a bill agains people with chronic illnesses? Not an US citizen, maybe I missed that.",
      "created_utc": 1738486960.0,
      "score": -26
    },
    {
      "id": "maosyhx",
      "body": "I am also a new junkie, and read many articles from a variety of sites I consider trusted; MSNBC, CNN, al Jazeera, the guardian, ap news, etc.  even fox can have the occasional interesting article as long as it isn't remotely political. I can't listen to the news, though, dumps voice triggers me and I become super stressed and ragey. Which, yes, causes major anxiety.\n\n  lately, however, I have noticed I'm having more and more difficulty getting Google to give me accurate news articles when I want to read about a topic that is anti trump, or simply topics that don't align with the far right.  Is anyone else having this problem?  Or am I being paranoid?",
      "created_utc": 1738559026.0,
      "score": 3
    },
    {
      "id": "manfes7",
      "body": "Same but with Facebook.",
      "created_utc": 1738542036.0,
      "score": 8
    },
    {
      "id": "malkcx8",
      "body": "yes this, Im up, Im down...wandering almost in a zombie state.",
      "created_utc": 1738522119.0,
      "score": 6
    },
    {
      "id": "maioj8h",
      "body": "It’s basically where you work with other people with anxiety and depression issues to learn new skills to deal with those feelings. Some clinics offer intensive processing therapy, unlike what I did, which was CBT heavy",
      "created_utc": 1738480734.0,
      "score": 17
    },
    {
      "id": "mamibda",
      "body": "I have 10 mgs. I usually break it in half and try half first and if it doesn’t do the trick I take the rest. Some nights are ok, some I barely get through even with the whole 10 😔",
      "created_utc": 1738531776.0,
      "score": 9
    },
    {
      "id": "manxk5a",
      "body": "Same. 2mg of klonopin daily. Sigh.",
      "created_utc": 1738547906.0,
      "score": 4
    },
    {
      "id": "mamvcm1",
      "body": "This.",
      "created_utc": 1738535665.0,
      "score": 3
    },
    {
      "id": "makfq81",
      "body": "You are completely delusional.",
      "created_utc": 1738510783.0,
      "score": 23
    },
    {
      "id": "mam0fos",
      "body": "Very strange take, but I don't argue with strangers on the internet.",
      "created_utc": 1738526575.0,
      "score": 8
    },
    {
      "id": "malzkoh",
      "body": "Did that make you feel better? I can’t imagine being a person who goes after someone who is honest about what’s making them anxious.",
      "created_utc": 1738526328.0,
      "score": 17
    },
    {
      "id": "mamedj3",
      "body": "Man, the entire political philosophy of conservatives is just pure maliciousness isn't it? You guys can't even hide it anymore.",
      "created_utc": 1738530616.0,
      "score": 18
    },
    {
      "id": "maoenf5",
      "body": "i'm sorry you've gotta go through this, too :( carrying papers is a good idea actually, i never thought to carry my SS card with me until now. as of lately, i don't really go anywhere alone, either. \n\njust remember, we aren't in this alone. no matter what happens, we all have each other to stand and fight injustice together. hang strong friend, we can power through this ❤️",
      "created_utc": 1738553602.0,
      "score": 3
    },
    {
      "id": "mai113a",
      "body": "It doesn't help that the news has him on all of the time. I just need a break from him entirely.",
      "created_utc": 1738470167.0,
      "score": 18
    },
    {
      "id": "maiy0cm",
      "body": "Well everyone should delete all of their Meta accounts (and Twitter, if you have it).  Not to mention Amazon.  Because, seriously, fuck those guys kissing the ring.\n\nBut, to answer OP, yep I'm anxious.  I had actually been living under a self-imposed rock since a couple weeks after the insurrection because I'd basically had a nervous breakdown the previous year (due to various life stressors and newly developed health issues brought on by said stress).  It had taken me over 4 years to get my feet back under me enough to start trying to peak out from under my rock some only to be faced with the inauguration and the days since.  It's set me back immensely.",
      "created_utc": 1738486086.0,
      "score": 15
    },
    {
      "id": "mai1o4h",
      "body": "Canceling mine. Fuuuuuuck that.",
      "created_utc": 1738470424.0,
      "score": 14
    },
    {
      "id": "maoeh1n",
      "body": "Does it not seem like it got worse since the inauguration? I used to seem a few people here and there, in my blue state, but *now* almost every time I go out people either have maga shit on or are talking about how glad/relieved they are that he won 😩(mind you, I don’t go out as much as that average person *because* of my anxiety and health issues, but still it feels like more than before)",
      "created_utc": 1738553541.0,
      "score": 1
    },
    {
      "id": "mal96oi",
      "body": "[removed]",
      "created_utc": 1738519125.0,
      "score": -3
    },
    {
      "id": "mak7wv9",
      "body": "Agreed, these people are deranged. So many Americans disagree with what’s happening.",
      "created_utc": 1738508333.0,
      "score": 8
    },
    {
      "id": "map4qqv",
      "body": "It makes no sense. Why would you treat one of your closet allies like this? He’s completely unhinged which is so terrifying.",
      "created_utc": 1738564637.0,
      "score": 1
    },
    {
      "id": "map4fjx",
      "body": "Well he’s a fascist, let’s be honest everything he is doing is textbook fascism which is terrifying. The comments he has made about Canada becoming the 51st state are unhinged but he’s unhinged enough to do something about it. The way he’s scapegoating LGBQT+ people and immigrants makes me sick as does the way he’s rolling back women’s rights. Plus, fascism and far right ideologies are on the rise here as well. The current Conservative leader who may very well be our next Prime Minister is basically a Canadian Trump and it terrifies me seeing what’s happening over there and knowing it could be happening here soon. And just knowing there are people all over the world who wholeheartedly agree with this and praise what this horrible man is doing makes me very scared for the future of humanity. There are many other things but that sums up the main points that contribute largely to my daily anxiety. Sorry about the downvotes, I’m happy to answer your question and I don’t think it was out of line to ask.",
      "created_utc": 1738564470.0,
      "score": 3
    },
    {
      "id": "mamldib",
      "body": "You’re getting a lot of downvotes but perhaps you didn’t see on the news. Trump is imposing tariffs on Canada because he thinks that the trade deficit means he’s « subsidizing us » ie of course we will export more - we are 41M and you are 320M+ … and we have a big country as well w a lot of resources so we export more. \n\nAnd he has threatened to annex Canada by economic force (to destroy us economically so we have no option but to join as a 51st state …) \n\nTrump is alienating his closest partner and longest ally.",
      "created_utc": 1738532669.0,
      "score": 2
    },
    {
      "id": "makq9h5",
      "body": "I wasn’t a teacher back then, plus I was about 7-8 years younger. Yes, I was worried then. But I also lived in a place that was surrounded by white people and conservatives. I moved west with my (now) husband when we felt like there wasn’t anything left for us in our conservative state. \n\nI’ve never been a conservative. But I grew up in a strict conservative, religious household. I had to do a lot of unlearning once I learned I was gay. \n\nSo instead of throwing criticisms at me, maybe go after the people who are causing the problem and not someone who is actively trying to fight back.\n\nThe tone of your post just comes off as accusatory and if you truly believe in helping the cause rather than hindering, you may want to rethink how you approach people. Especially those on the same side as you.",
      "created_utc": 1738513872.0,
      "score": 3
    },
    {
      "id": "malr063",
      "body": "I don't have any control over trump.  I voted against him in the primary and in the general election.\n\nI do have some control over my screentime.  I try and limit the amount of doomscrolling I do.",
      "created_utc": 1738523933.0,
      "score": 6
    },
    {
      "id": "maiwcuq",
      "body": "This subreddit prohibits posting misinformation, negative generalizations, and dehumanizing speech.\n\nYou can learn to identify misinformation with the SPOT technique:\n\n* S - is this a credible news **S**ource?\n* P - Is this **P**erspective biased?\n* O - Are **O**ther sources reporting the same story?\n* T - Is the story **T**imely?\n\nFor more on media literacy please check out [Media Smarts](https://mediasmarts.ca/digital-media-literacy/general-information/digital-media-literacy-fundamentals)",
      "created_utc": 1738485113.0,
      "score": 1
    },
    {
      "id": "mamlmpl",
      "body": "It takes more than one horrible person to get this far.",
      "created_utc": 1738532743.0,
      "score": 2
    },
    {
      "id": "maifbfa",
      "body": "And some people like getting drunk and they like booze. I don’t see much difference.",
      "created_utc": 1738476175.0,
      "score": 0
    },
    {
      "id": "maki96i",
      "body": "classic reddit... giving me downvotes just because I don't care for politics...",
      "created_utc": 1738511537.0,
      "score": 0
    },
    {
      "id": "maicbk4",
      "body": "I just said “nope”, to answer OP’s question. I haven’t been on the verge of a panic attack since the inauguration. \n\nNot sure why I’m getting downvoted. It’s sometimes best to let go, and move on. It helps anxiety a lot to sometimes trust the majority vote. We all want what’s best for our country, including woman and people of color.\n\nSince you asked, I have no problem breaking it down:\n\n1. Women will be in a safer country not surrounded by illegal immigrant criminals (particularly rapists). That’s a huge positive for women. They are getting deported as we speak, a huge win for America.\n\n2. Record-low Black unemployment in 2019. Before COVID-19, Black unemployment fell to 5.4% in August 2019, the lowest ever recorded at that time.\n\n\n3. Wages for Black workers increased under Trump, particularly in lower-income jobs.\n\n\n4. Opportunity Zones (OZs) and tax incentives were aimed at revitalizing Black communities, leading to more investment.\n\n5. First Step Act (2018) - Released thousands of Black inmates sentenced under harsh laws (e.g., crack vs. powder cocaine disparity). Focused on rehabilitation, sentencing reform, and reducing recidivism.\n\nI could keep going, although this is why I don’t have anxiety. Im basing all my decisions off historical data between the two parties. \n\nA lot of good happened when trump was president, especially for people of color and women, in particular. It sets my mind at ease we have a true leader in this country again, getting the job done that hasn’t been done the last 4 years.\n\nWe were on the brink of a world war.",
      "created_utc": 1738474883.0,
      "score": -3
    },
    {
      "id": "mamhlzw",
      "body": "I understand that the uncertainty around the new administration can bring a lot of fear and anxiety, and that’s completely valid. However, this subreddit is meant to be a space for support specifically around anxiety itself, and political discussions—while important—can often cause more stress and division. Let’s keep this space focused on helping each other navigate anxiety in a way that’s supportive for everyone. ",
      "created_utc": 1738531571.0,
      "score": 1
    },
    {
      "id": "mamg1dj",
      "body": "I understand the uncertainty around the new administration can bring a lot of fear and anxiety. However, this subreddit is meant to be a space for support specifically around anxiety itself, and political discussions— while important— can often cause more stress and division. \n\nLet’s keep this space focused on helping eachother navigate in a way that’s supportive for everyone. ",
      "created_utc": 1738531108.0,
      "score": -1
    },
    {
      "id": "makkcq7",
      "body": "Apologies for earlier comment about being new, I was more saying that I’ve had panic attacks since 2016, but I understand that things just got another level crazier. I am definitely feeling the ramp up and it’s a terrible feeling :(",
      "created_utc": 1738512152.0,
      "score": 1
    },
    {
      "id": "maksqlm",
      "body": "You are assuming Im able to take a long walk.\n\n\nPlease do not tell me how to deal with my emotions.",
      "created_utc": 1738514585.0,
      "score": 17
    },
    {
      "id": "mallvad",
      "body": "If someone screamed into a crowd that an asteroid will pass Earth, many of them would jump to the conclusion that it's gonna hit. Anxiety is contagious.\n\nLearn to come to your own conclusions based on what you and you alone read. If you're unsure who to trust, download Ground News and get a variety of different sources.",
      "created_utc": 1738522528.0,
      "score": 11
    },
    {
      "id": "majbh9t",
      "body": "Wow. This is quite a comment",
      "created_utc": 1738494098.0,
      "score": 20
    },
    {
      "id": "maq65pd",
      "body": "I just call him the turd. All my friends know who I’m talking about.",
      "created_utc": 1738586057.0,
      "score": 3
    },
    {
      "id": "majpjv8",
      "body": "No, no bills or executive orders have been passed (as far as I know) targeting people with chronic illness. But RFK Jr. is Trump’s HHS pick and he is a science denier. Trump pulled the US out of WHO, and has muzzled the CDC. He has talked openly about gutting Medicaid and dismantling the ACA, which many people with chronic illnesses and/or disabilities depend on. He mismanaged our last pandemic and over a million US citizens died as a result of his incompetence, and we’re on the verge of another pandemic with bird flu. With his pause on all federal spending, many states were locked out of Medicaid portals, disrupting healthcare to millions. Nothing about his administration suggests that he will improve healthcare for Americans in any way, and so far he has done a lot to actively undermine healthcare.",
      "created_utc": 1738501471.0,
      "score": 11
    },
    {
      "id": "maj5qjd",
      "body": "It's more where the bills already are and the ones on their way! I think the comment you were replying to was referencing their health issues as a reference point on the current topic though.",
      "created_utc": 1738490663.0,
      "score": 2
    },
    {
      "id": "malzmup",
      "body": "Sorry to hear that you missed the part where I showed empathy by sharing similar struggles!",
      "created_utc": 1738526346.0,
      "score": 1
    },
    {
      "id": "maion43",
      "body": "Wow, was not aware they offer this. Need to look into it",
      "created_utc": 1738480792.0,
      "score": 9
    },
    {
      "id": "mao1eai",
      "body": "Oh wow, no wonder 2mg isn't working. Thankyou . For replying. I'm really sorry about your suffering  😔  It's horrible, isn't it.",
      "created_utc": 1738549165.0,
      "score": 2
    },
    {
      "id": "mamzy6f",
      "body": "Also this guy doesn't know the first few months of a presidency are typically the honeymoon phase and get an elevated rating as a new president, I think Trump will blow through all that political capital quickly, if he hasn't already.",
      "created_utc": 1738537064.0,
      "score": 3
    },
    {
      "id": "maicab8",
      "body": "Maybe he’ll grown on ya,  /s",
      "created_utc": 1738474869.0,
      "score": -7
    },
    {
      "id": "maldvxf",
      "body": "That's not all they kissed!😜",
      "created_utc": 1738520385.0,
      "score": 1
    },
    {
      "id": "map3hh9",
      "body": "Oh, I’m completely aware of that. Up here we know that there are a large number of you who are against it. Thinking of you all the time!",
      "created_utc": 1738563970.0,
      "score": 1
    },
    {
      "id": "makrbfv",
      "body": "Sorry you wanted to take a simple question that way. Maybe come to terms with why that is.",
      "created_utc": 1738514175.0,
      "score": -2
    },
    {
      "id": "mapslf1",
      "body": "Yes because completely ignoring what he’s doing and how he’s destroying this country is a brilliant idea.",
      "created_utc": 1738578918.0,
      "score": 1
    },
    {
      "id": "maifnyv",
      "body": "Booze is a drug and watching news is not",
      "created_utc": 1738476331.0,
      "score": 0
    },
    {
      "id": "mamveb4",
      "body": "I understand your thought process, and I'll say no more, except for: I wish you luck, if curtailing this broader topic of conversation is your current objective, as I suspect that effort will not be successful.",
      "created_utc": 1738535679.0,
      "score": 3
    },
    {
      "id": "man2rkn",
      "body": "I would love to be able to walk, but I can't. I have horrible pain. If you can't walk, drive. A nice drive seems it would be great. Unfortunately I don't drive. I was too afraid to try as a young girl. My anxiety was horrible as a 15-16 yr old girl and I was married & had a baby. He was an abuser. Thankfully we lived with my Mother and she kicked him out. Now my Mom is gone & so is my daughter. Both passed in 1999 within 2 months of each other. My Mom had cancer & my daughter a terminal brain tumor.",
      "created_utc": 1738537955.0,
      "score": 5
    },
    {
      "id": "majhepe",
      "body": "Isn’t it though? The accuracy of this comment is astounding. Just screams I get it! Nicely done fellow redditor.",
      "created_utc": 1738497491.0,
      "score": 8
    },
    {
      "id": "mak98gd",
      "body": "[removed]",
      "created_utc": 1738508765.0,
      "score": -4
    },
    {
      "id": "maiooqj",
      "body": "Good luck",
      "created_utc": 1738480816.0,
      "score": 6
    },
    {
      "id": "makv5f2",
      "body": "You are a piece of work, aren’t you? Bless your heart.",
      "created_utc": 1738515278.0,
      "score": 3
    },
    {
      "id": "mapwsrb",
      "body": "I'm not \"completely ignoring what he's doing.\"  \n  \nWhat do you believe is accomplished by wallowing in despair?",
      "created_utc": 1738581358.0,
      "score": 2
    },
    {
      "id": "maig3gd",
      "body": "Do you understand the nature of addiction? Addiction is not limited to drugs. Addiction is an obsessive compulsive behavior which causes dysfunction in peoples lives. I don’t even call it the news anymore, I call it the media and it is toxic and addictive.",
      "created_utc": 1738476528.0,
      "score": 1
    },
    {
      "id": "maq1pow",
      "body": "I appreciate your understanding. My goal isn’t to shut down important conversations but to help keep this space a place where people can find relief from anxiety rather than added stress. \n\nI know it’s a tough balance, and I respect that people have different perspectives on what’s helpful.",
      "created_utc": 1738583968.0,
      "score": 1
    },
    {
      "id": "mands8o",
      "body": "Oh Im sorry.\n\nI can walk but not far. I have cerebral palsy and I tore my meniscus a few years ago and my knee is still not right. ( don't ever go in ciproflaxin)",
      "created_utc": 1738541511.0,
      "score": 2
    },
    {
      "id": "mal6gkr",
      "body": "This subreddit prohibits posting misinformation, negative generalizations, and dehumanizing speech.\n\nYou can learn to identify misinformation with the SPOT technique:\n\n* S - is this a credible news **S**ource?\n* P - Is this **P**erspective biased?\n* O - Are **O**ther sources reporting the same story?\n* T - Is the story **T**imely?\n\nFor more on media literacy please check out [Media Smarts](https://mediasmarts.ca/digital-media-literacy/general-information/digital-media-literacy-fundamentals)",
      "created_utc": 1738518396.0,
      "score": 1
    },
    {
      "id": "manhmkc",
      "body": "Sorry I didn’t pander to your cupcake feelings but I’m an honest person.",
      "created_utc": 1738542754.0,
      "score": -1
    }
  ]
}