{
  "id": "1fzgzrb",
  "title": "Anyone not having kids because of crippling anxiety?",
  "selftext": "If I didn’t have such bad anxiety, especially health anxiety, I would probably want to have kids. But the fact that I worry so much already about my existing family, and every ache and pain in my body (mostly because of anxiety making me so tense that it causes a vicious cycle of aches and pains - which then make my anxiety worse)\n\nI start to get depressed thinking that I may lose out on having my own family because of anxiety. But I also can’t imagine having another human to worry about. \n\nAnyone else?",
  "created_utc": 1728439965.0,
  "score": 1022,
  "num_comments": 276,
  "url": "https://www.reddit.com/r/Anxiety/comments/1fzgzrb/anyone_not_having_kids_because_of_crippling/",
  "comments": [
    {
      "id": "lr2eel0",
      "body": "I decided early on in life that I didn’t want children. One of the many reasons is that I would probably have health anxiety on top of everything else, and also later on have anxiety about my children’s safety. \n\nAnd this is if I survive the pregnancy, childbirth and survive PTSD from childbirth.",
      "created_utc": 1728465862.0,
      "score": 298
    },
    {
      "id": "lr2iynu",
      "body": "On the flipside, I have two kids and crippling anxiety - especially health anxiety - and it is very hard. But in between the hard it’s beautiful. I am immensely grateful I had children. I just don’t want them to pick up on my anxieties and develop them because of me, that’s what I struggle with the most.",
      "created_utc": 1728469034.0,
      "score": 197
    },
    {
      "id": "lr2h5qw",
      "body": "I want kids but too afraid my anxiety is gonna get in the way. Really sucks.",
      "created_utc": 1728467824.0,
      "score": 26
    },
    {
      "id": "lr2lbc7",
      "body": "I think I want them but not even when my mental health is good do I think I could handle the stress of a child, plus the fear they'll inherit all these disorders. I don't want to give that opportunity to them.",
      "created_utc": 1728470519.0,
      "score": 28
    },
    {
      "id": "lr2xazj",
      "body": "I have two children and terrible anxiety, and honestly, it’s not that bad. If anything they force me to get out of myself and push myself to do things even when I feel shit. Of course some days I wish I could stay in bed all day and cry instead of getting up to take care of them, but at the end of the day they probably do more to HELP my anxiety than the contrary.",
      "created_utc": 1728476644.0,
      "score": 27
    },
    {
      "id": "lr2f8ni",
      "body": "Just read an article about children being a constant worry until you die. So if it is a very real concern for you then trust in your decision.",
      "created_utc": 1728466466.0,
      "score": 50
    },
    {
      "id": "lr2ybz2",
      "body": "On the flip side, having a kid has given me a new perspective and has made my anxiety a lot more manageable. Instead of always internally worrying about myself, I’m focused on my kid. I’m not advocating having a kid to cure your anxiety but, glass half full!",
      "created_utc": 1728477101.0,
      "score": 19
    },
    {
      "id": "lr1jx1a",
      "body": "Ya you are not alone. I've been wanting to have children so my wife and I have been married back in 2016. Never suffered with health issues and/or anxiety until about 2020. And it's kind of been a downward spiral from there. Wife is 39 and I'm 32. And after getting over financial hardship finally but now I have crippling anxiety and depression. She's ok with having a child but I could barely take care of myself let alone be a father. Even though I want to be one so bad, it would be selfish. But you are def not alone.",
      "created_utc": 1728445390.0,
      "score": 36
    },
    {
      "id": "lr2pz9y",
      "body": "I don’t worry as much about my own anxious feelings in relation to having children, but rather that it would hinder me in providing a stable, happy and relatively care free childhood for them. Or that they may even become anxiety ridden themselves, through learned behaviours or whatever. I’d rather not have a child than risk them struggling with this their entire life like I have.",
      "created_utc": 1728473130.0,
      "score": 9
    },
    {
      "id": "lr2npoy",
      "body": "Anxiety and no money",
      "created_utc": 1728471909.0,
      "score": 8
    },
    {
      "id": "lr32lpi",
      "body": "Just had a kid and have suffered from anxiety most of my life. My anxiety skyrocketed after having this kid and I kind of regret having him. I love him but this was probably not a good idea for my health",
      "created_utc": 1728478905.0,
      "score": 7
    },
    {
      "id": "lr2o0e4",
      "body": "Kids just multiply your anxiety anyways. I tell my kids to not have kids because I already have so much anxiety about their future and day to day life. The anxiety for our children’s future is only going to get worse. I do NOT recommend it knowing what I know now.",
      "created_utc": 1728472072.0,
      "score": 13
    },
    {
      "id": "lr2tuxe",
      "body": "My wife and I each have out own anxiety conditions and we have decided to not have kids to keep life as manageable as we can. It's unfortunate but for the best for us.",
      "created_utc": 1728475056.0,
      "score": 7
    },
    {
      "id": "lr34e6r",
      "body": "I was on the fence most of my life, neither my wife nor I had strong feelings about it and after some stuff came up that really messed me up I realized that if I can BARELY handle my own / my wife’s and my pets health stuff, then I could absolutely not handle a child having health issues or similar.  I was honestly glad to come to that realization because at least now I don’t feel guilty for not having kids too..",
      "created_utc": 1728479628.0,
      "score": 5
    },
    {
      "id": "lr2sn9z",
      "body": "I have a kid and anxiety (specifically health anxiety) and in a way having him around has actually given me a lot of perspective and grounded me. When I’m feeling anxious, heading over to him and building a tower together or reading a book is super grounding. He’s just so happy all the time haha. \n\nPregnancy was great also cause they give you regular blood and blood pressure and urine tests to say everything’s alright",
      "created_utc": 1728474473.0,
      "score": 9
    },
    {
      "id": "lr2zffy",
      "body": "i have terrible health anxiety and a history of psychosis, so getting pregnant and being postpartum scares tf out of me. i’ve felt like this since i was a kid but just assumed id grow out of it when im older. i’m only 19 now and people around me are starting to have kids, but im not any less scared. if anything im more scared bcuz i hear so many terrifying stories of women who do suffer from ppd. so im not too sure if i want kids, and im not too sure my bf is okay w that! so thats what im dealing w lol",
      "created_utc": 1728477580.0,
      "score": 5
    },
    {
      "id": "lr2lehr",
      "body": "I have a baby and the health anxiety about him and myself is next level but it's so worth it because it's a love like no other. I used to worry all the time especially health anxiety pre-baby too.",
      "created_utc": 1728470573.0,
      "score": 8
    },
    {
      "id": "lr35vb6",
      "body": "I wondered how the hell I was going to be dad with crumpling anxiety, surprisingly since the day my daughter was born my anxiety disappeared.",
      "created_utc": 1728480215.0,
      "score": 3
    },
    {
      "id": "lr3hayv",
      "body": "For what it's worth, having kids actually improved my anxiety in a lot of ways. I had extremely traumatic births and struggled with PPA/PPD. It taught me a major lesson - you have zero control over anything. Dealing with the PTSD of what has happened will never end but I've learned to better live in the moment and not let my anxieties control my everyday life, because I only have so much time with my kids being this little. \n\nI can't control if my kids get sick, or if they have a tantrum in public, or if they choke, or if my parents die, or if my partner or I lose our jobs. Life will literally just go on. I continue to take my medications and go to therapy and try to be my best self. I'll always be anxious but I can't imagine missing out on all of this because of it.",
      "created_utc": 1728484340.0,
      "score": 5
    },
    {
      "id": "lr3vzis",
      "body": "Up until I was about 35, I always figured if I had kids, then I had them, if not, then oh well.  It wasn't until after 35 that I was so grateful that I never had kids.  My anxiety was always on the con side of if I should have kids or not, because my own anxiety was passed down from my mother and I never want anyone else to experience what I went through when I was at my worst.  I'm often amazed that I survived and don't know if I will if it ever gets that bad again.  I think having a kid or multiple kids would definitely have exacerbated my anxiety and I don't think I would have been able to be the mother I think all children deserve.  I still have a family, though.  I'm married and we have 3 dogs and I have nieces and a nephew.  I have my parents, brothers, cousins, aunts and uncles and friends who are more like family.  I'm 42 now, so I'd like to think my baby-making days are behind me and i have yet to regret being childfree.",
      "created_utc": 1728489160.0,
      "score": 3
    },
    {
      "id": "lr2j1bl",
      "body": "I thought it might affect me, but it really doesn’t.  I previously thought that I didnt want to pass this onto my child, but I learned my anxiety likely stems from trauma.  I worry about my daughters safety and her future, but that stems from the desire to want the best for her. I wouldn’t say my anxiety has worsened with a child (though republicans are trying to take women’s bodily autonomy away, so I’m anxious about that for her) but I’m more cautious and think about the future more to best protect her.  I don’t have any new or worsened physical symptoms since having her, and it’s been a truly great and wonderful experience.  Obviously you should try to sort through your problems if you can before having a child, but I’m sure many of us know that this is a lifelong affliction and it’s not going away.  You might find that being an anxious person helps you think of ways to protect them more, since we are always worrying about what ifs.  Do what’s best for you, but don’t let your anxiety hold you back!",
      "created_utc": 1728469082.0,
      "score": 8
    },
    {
      "id": "lr2r20q",
      "body": "No offense but are u sure u want to make a kid that maybe has the same fears/anxiety??? You certainly dont wish your condition on a tiny person you gonna love. So I dont get it.\n\nI am also fked in the head and thats why I would never ever produce a kid cuz it might inherit the same anxiety problems. And I dont wish this condition onto my worst enemy and specially not my child.\n\nNow if you really want one, just adopt and make one kids life better, instead of forcing a new life into this world without asking.",
      "created_utc": 1728473678.0,
      "score": 8
    },
    {
      "id": "lr2fkcf",
      "body": "I never wanted kids, now it feels like I have a genuine excuse to be honest because realistically im too anxious.",
      "created_utc": 1728466702.0,
      "score": 6
    },
    {
      "id": "lr2ofqw",
      "body": "Yes, me too. I think I would be 24/7 worrying about my children if I had them. And that's not a healthy pattern for them neither",
      "created_utc": 1728472305.0,
      "score": 3
    },
    {
      "id": "lr2qso9",
      "body": "i appreciate how you care about the potential future baby. birthing an unwanted child with parents who are not ready to take care of even themselves is a bad idea that will only bring the child suffering",
      "created_utc": 1728473548.0,
      "score": 3
    },
    {
      "id": "lr30gfm",
      "body": "It's on the list. \n\nI did a lot of psychology and relationship advice reading, and the amount of resentment and stress just destroys so many marriages. It's a major complaint in many divorces. \n\nI know that I would resent having children. And it would be very bad for my mental health. My gf feels the same way. We would rather have a happy relationship than children.",
      "created_utc": 1728478021.0,
      "score": 3
    },
    {
      "id": "lr2raz0",
      "body": "Yeah between my anxiety, depression, and ADHD, I don’t think I could raise a child. \n\n\nMental illness runs strongly in my family and I wouldn’t want to bring a child into this world just for them to suffer like I have. They’d most likely inherit my ADHD",
      "created_utc": 1728473806.0,
      "score": 5
    },
    {
      "id": "lr1owl7",
      "body": "Here I am",
      "created_utc": 1728448022.0,
      "score": 2
    },
    {
      "id": "lr1qqdh",
      "body": "Yes",
      "created_utc": 1728449101.0,
      "score": 2
    },
    {
      "id": "lr2lpjg",
      "body": "you’re not alone! anxiety sucks :(",
      "created_utc": 1728470758.0,
      "score": 2
    },
    {
      "id": "lr2pipa",
      "body": "Meee! And I'm not even sad about it, I look at my life and think \"the only thing I'm happy about is that I don't have children\"",
      "created_utc": 1728472889.0,
      "score": 2
    },
    {
      "id": "lr3424h",
      "body": "For me when I had my daughter some anxiety sort of went away like there is something bigger , like it’s no longuer you the most important",
      "created_utc": 1728479491.0,
      "score": 2
    },
    {
      "id": "lr36bwb",
      "body": "i wasn’t aware that i had anxiety until i had children, so too little too late for me i suppose. it was also exacerbated by some trauma. but my anxiety isn’t terrible. it’s a low rumble on a good day and i can feel semi-okay. on a bad day? fuck. i feel so bad that i gave them a mom like myself.",
      "created_utc": 1728480392.0,
      "score": 2
    },
    {
      "id": "lr36d4s",
      "body": "It used to but I can’t have biological kids of my own anymore. It’s funny how life makes decisions for you sometimes in a way. Still, sorry to hear it’s been so awful for you. I hope your anxiety gets better soon 💖",
      "created_utc": 1728480406.0,
      "score": 2
    },
    {
      "id": "lr37jiu",
      "body": "Deciding to NOT have kids, when you are aware that having them would be such a burden for your mental health and how it would harm their own growth, is a wise decision. More people should be this much self-aware. No need to feel shame bc of it, and those who try to convince you that you're \"missing out\" most likely are worried about future where there won't be enough of cheap workers paying as many taxes as today. The rich ones are scared of becoming less wealthy bc of low childbirth.",
      "created_utc": 1728480857.0,
      "score": 2
    },
    {
      "id": "lr3pirh",
      "body": "Lexapro",
      "created_utc": 1728487077.0,
      "score": 2
    },
    {
      "id": "lr3v6ai",
      "body": "I don't want to pass on these genes. I can't risk another human having to experience the hell I've lived through and continue to. Just gonna let natural selection have its way and let the non anxious beings procreate.",
      "created_utc": 1728488902.0,
      "score": 2
    },
    {
      "id": "lr3yht0",
      "body": "Probably not a bad idea… raising one child with anxiety is hard",
      "created_utc": 1728489965.0,
      "score": 2
    },
    {
      "id": "lr40jf0",
      "body": "Yep. Love kids, work with them so get my maternal instincts out with my job but I'm in no way mentally or physically well enough to have my own full time. I worry about the kids I work with after i finish work so my own would be unbearable and I'd probably feel like a terrible parent.",
      "created_utc": 1728490627.0,
      "score": 2
    },
    {
      "id": "lr4a398",
      "body": "I have three kids. I had anxiety before, but now I like to say I have anxiety on steroids as I also have CPTSD. \n\nI love my kids. But, knowing what the world is today, and specifically the U.S., if I had to make the decision to have kids, I likely wouldn’t. I’m not sure what country you are in, but this country is MUCH different today than when I started having kids 14 years ago. 😢",
      "created_utc": 1728493668.0,
      "score": 2
    },
    {
      "id": "lr4ad1g",
      "body": "Yea :,) I really want to be a mom but I’m terrified of having kids, the whole process or even having an absent partner making me a single mom in a relationship, not being able to protect them from the world…. I’m just scared I’ll be a pad parent and I wont be able to give them what they want and need and that makes me so insanely anxious about the whole thing",
      "created_utc": 1728493756.0,
      "score": 2
    },
    {
      "id": "lr4ja93",
      "body": "Hi! I have anxiety about that too. The way politics are trying to control women, climate change, economy, and my abusive parents and stepparents are the reasons why I have anxiety regarding having kids. It’s something my bf and I both discussed. And the sad part is we want kids.",
      "created_utc": 1728496588.0,
      "score": 2
    },
    {
      "id": "lr4m70y",
      "body": "I used to feel that way sometimes but getting it treated and then having children made me stronger",
      "created_utc": 1728497539.0,
      "score": 2
    },
    {
      "id": "lr66ynz",
      "body": "I don’t think I’d want to put my children through what I  go through mentally and I kind of hold a small amount of resentment to my own parents for having me tbh",
      "created_utc": 1728516555.0,
      "score": 2
    },
    {
      "id": "lr74n3d",
      "body": "The entire thing sounds stressful. \nDoctor visits, pain, nausea, labor, the after effects. I sometimes find it hard to believe that my body is technically built to handle it to some degree. \nBut damn like do I have to?! I want a kid but I don’t want to do all that! makes me start stressing.",
      "created_utc": 1728529626.0,
      "score": 2
    },
    {
      "id": "lr7dp69",
      "body": "As an anxious overthinker I eventually became an anti natalist. A very short summary of anti natalism: those that do not exist do not suffer, and they wont make me suffer either.",
      "created_utc": 1728533877.0,
      "score": 2
    },
    {
      "id": "lr7g1rs",
      "body": "I never thought I would be strong enough to be a father because of my anxiety.\n\nI overcome and transformed my relationship with stress and 18 months ago became a first time father - of TWINS. \n\nThe skills and practices I learnt for my stress and anxiety have made me a present and calm father.",
      "created_utc": 1728535094.0,
      "score": 2
    },
    {
      "id": "lrd2q1p",
      "body": "I hate to say it, but YES. I already have two beautiful children, and I thought I was done but for the last 2 years I have really been wanting another. I thought I had my anxiety under control, and then a couple of months ago I began semi-trying with my husband. When my next cycle was approaching I got so worried about the what-if’s: I’ll be 33 when the baby is born, what if there is something wrong with her/him? What if I develop GD and constantly have to check my blood sugar? What if I can’t manage a new baby and homeschool my other two? \nI started to have panic attacks. I got a pregnancy test and it was negative, and my panic cleared up. I am still very sad about it but I don’t think having another baby is in the stars for me. ",
      "created_utc": 1728618939.0,
      "score": 2
    },
    {
      "id": "lrogjny",
      "body": "[removed]",
      "created_utc": 1728796892.0,
      "score": 2
    },
    {
      "id": "lr2pvto",
      "body": "Yup! No having kids from my crippling anxiety either. I worry too much about the sex being bad to even have it.",
      "created_utc": 1728473081.0,
      "score": 1
    },
    {
      "id": "lr2x52o",
      "body": "I have anxiety but not that kind so I’m undecided but leaning more towards wanting kids.",
      "created_utc": 1728476569.0,
      "score": 1
    },
    {
      "id": "lr2zfox",
      "body": "That’s just one of the reasons for me. There are lots of others I won’t get into here, but yeah anxiety about basically all of it is a factor too. \n\nI also have emetophobia (could be argued that’s a type of anxiety I suppose, so still fits into your question), so the idea of having something that tends to puke a lot (and will also want to likely be crawling all over me during those times because they want comforted) literally gives me a panic attack just thinking about it so….big nope from me on that front too.",
      "created_utc": 1728477583.0,
      "score": 1
    },
    {
      "id": "lr303uv",
      "body": "I have zero desire or maternal instincts to even have children, but yes, anxiety is definitely a playing factor in why I do not want children. I would never want to pass my mental illness onto someone else on top of having to worry about another human being 24/7 and make sure they grew up properly, plus I have to worry about who could hurt them.",
      "created_utc": 1728477871.0,
      "score": 1
    },
    {
      "id": "lr30ymt",
      "body": "I'm not having children because I like my quiet time and having money. I don't have a maternal bone in my body so I don't feel I'm missing out on anything, bring on the cats!",
      "created_utc": 1728478235.0,
      "score": 1
    },
    {
      "id": "lr39crt",
      "body": "Yup! I don’t want postpartum, I would want to be present for my kids, and I don’t wanna pass this shit on. \n\nI grew up with a mother that had untreated anxiety and depression. It affected her parenting skills and her ability to be present.",
      "created_utc": 1728481539.0,
      "score": 1
    },
    {
      "id": "lr3a03y",
      "body": "I have anxiety about my (nonexistent) kids having anxiety",
      "created_utc": 1728481778.0,
      "score": 1
    },
    {
      "id": "lr3afyu",
      "body": "It’s so hard, don’t. It’s constant hell  😭",
      "created_utc": 1728481939.0,
      "score": 1
    },
    {
      "id": "lr3c3jr",
      "body": "Yes it's one of the reasons. I don't think I'd be a good mom with my anxiety and chronic fatigue. I would hate to leave everything to my.husband and then just feel bad about it",
      "created_utc": 1728482533.0,
      "score": 1
    },
    {
      "id": "lr3cf5g",
      "body": "I was like this my whole life. Wanted kids but was too afraid so I just convinced myself I didn't want them. My partner always knew he wanted kids. I was really nervous when I got pregnant unexpectedly, but 2 kids later, it has been more than worth any of the additional anxiety.",
      "created_utc": 1728482649.0,
      "score": 1
    },
    {
      "id": "lr3cs0w",
      "body": "It’s a good start to acknowledge your own anxieties that cause you trouble in life before having a family. A lot of people don’t and think having a family will just sort out all their problems. This couldn’t be further from the truth. \n\nAlways easier said than done, but try using this time to overcome it. It’s a journey, and you learn so much about yourself. Hell, I think everyone in this sub is on their own journey and they’re all difficult in their own ways - but we can and will do it!\n\nI wish you well, and if a family is what you truly desire I am sure you have it within yourself to take the difficult steps to overcoming anxiety. Your future self and your family will be forever grateful x",
      "created_utc": 1728482776.0,
      "score": 1
    },
    {
      "id": "lr3e1pf",
      "body": "Yes, but it’s mainly social anxiety. I hate to admit it, but I have never been on a date in my life. While part of it was due to focusing on school and building a career, I was always scared no one would love me. I also have a twin sibling who is actively dating and it makes me feel not worthy. I always joke with my friends and family, “That requires a guy wanting to put up with me for 18+ years, and I just don’t see that happening.”",
      "created_utc": 1728483222.0,
      "score": 1
    },
    {
      "id": "lr3e7gz",
      "body": "I’m like you. Really bad health anxiety. I just had my first baby and while I worry about her, my anxiety has not taken over and I’m actually so much more chill with her and her health than I am with my own.",
      "created_utc": 1728483278.0,
      "score": 1
    },
    {
      "id": "lr3evi8",
      "body": "Yes I really can’t imagine how I could be a good mom. It’s such a struggle already (barely) maintaining my job, myself and taking care of our dogs. Maybe if I didn’t have to work I would have less stress and could care for children",
      "created_utc": 1728483509.0,
      "score": 1
    },
    {
      "id": "lr3f2sl",
      "body": "I’d worry too much about them, like all the time. I don’t wanna become an unbearable parent because of my extremely bad anxiety, I’m already anxious about my dog, so it’d definitely be worse with a kid 😭\n\nAnd, the fear of pregnancy. I’m a trans man, but, I still have yk, parts attached so, I’d most likely be the one giving birth.. the way my mom described giving birth to me and my siblings? aw nah :(",
      "created_utc": 1728483578.0,
      "score": 1
    },
    {
      "id": "lr3g6o1",
      "body": "It's not my only reason, but it's one of many. I also have health anxiety, and going through my own pregnancy just seems like hell. I know I would be stressed all the time. I know I am never going to have bio children if I can help it, but adoption is still on the table pending my financial and mental security---less of a burden to my body and I still get to have a family.",
      "created_utc": 1728483959.0,
      "score": 1
    },
    {
      "id": "lr3gghu",
      "body": "This is me 110%. Had my first panic attack in 7th grade and gone downhill since (I’m 52) \n\nI have so many mental and physical illnesses it wouldn’t be fair to (1) doom a child to potentially inherit my problems and/or (2) not being able to take proper care of the child because I can’t take proper care of myself. \n\nI had the best most selfless Mom ever, and I could never do what she did.\nI even feel like I fail as a cat mom even though I have the most loved and spoiled cats ever, because inevitably they get sick and die, and I blame myself, even tho cats have much shorter lifespans than humans.\n\nThe good part is we (husband and I) have had a lot more freedom and disposable income to travel and whatnot. \n\nAnd frankly my estranged sibling had two kids, and she and her husband turned them into evil humans who believe in QAnon and hate everyone who is different (including their own grandfather, my father, who practically raised them, but who is non practicing Jewish). She and her hub and kids are estranged from us all and that has destroyed my father, so having kids isn’t always a great reward either. It can be a great heartbreak.\nSending everyone here love and peace.",
      "created_utc": 1728484052.0,
      "score": 1
    },
    {
      "id": "lr3k2u2",
      "body": "I feel exactly the same. 50 here.",
      "created_utc": 1728485275.0,
      "score": 1
    },
    {
      "id": "lr3khm9",
      "body": "I'm one of those that didn't really know i was experiencing anxiety my entire life until I had kids. Now it's just so much worse because I love my kids so darn much and I can't stop the intrusive thoughts. Getting help now to manage it though. My kids are the most precious things in my life and they love me, it's awesome, so I probably wouldn't change my mind even if I go back in time.",
      "created_utc": 1728485413.0,
      "score": 1
    },
    {
      "id": "lr3kp3c",
      "body": "I ended up having kids. I think it affects everyone with anxiety differently. I think I would still have pretty bad anxiety even if I didn't have kids because I always have. \n\nI do worry about my kids a lot though but I think that'd still be the case even if I didn't suffer from anxiety. I have a 21 year old bipolar and carefree son, a 9 year old autistic son and a 3 year old son with a minor health issue. I have health problems and childhood trauma as well. It's a lot. I don't regret my kids at all though and wouldn't have it any other way, despite their issues and my worrying about them. Their love is like no other and we share so many happy times together. I've been seeing a therapist for a couple of months now and it's really helped a lot. I also see a psychiatrist and get medications for my anxiety. That has helped a ton.",
      "created_utc": 1728485483.0,
      "score": 1
    },
    {
      "id": "lr3lh3f",
      "body": "Yeah, me pretty much. Also bc I can’t afford it.",
      "created_utc": 1728485738.0,
      "score": 1
    },
    {
      "id": "lr3m6an",
      "body": "I've never wanted kids anyway. Having my anxiety struggles have only exacerbated that. Anxiety itself has also caused an increase in my temper and lack of patience. It wouldn't lend to me even being a good parent. \n\nEven if I ever did change my mind, I'd sooner adopt. The idea of going through childbirth naturally makes me wanna fucking vomit. It's an anxiety, hypochondriac nightmare. \n\nI'm also a black woman and I'm statistically the most likely to die in childbirth in the U.S. I'm good.",
      "created_utc": 1728485967.0,
      "score": 1
    },
    {
      "id": "lr3mmi3",
      "body": "I've always had awful anxiety. I had a kid and worry about everything but I'm having a great time anyway. Having someone else to worry about kind of feels good and gets me out of my head. I do go to therapy every other week to talk about my anxiety and had ppa. I'm more confident in my body for what it survived and the awesome creature it made, and myself for always trying to be a good parent. I've never been so proud of myself. Also having a pediatrician you trust and can call/message is huge. \n\nIn deciding to have a kid I did a lot of meditative thinking visualizing what I wanted the rest of my life to be like and made pro/con lists lol.",
      "created_utc": 1728486115.0,
      "score": 1
    },
    {
      "id": "lr3ob2c",
      "body": "In my 20s, I was too selfish but in my 30s, I just think I'm too damaged and I've never been financially or emotionally stable enough to give a child the things they deserve. I had a vasectomy a few years ago so that ship has sailed. Anyway, my niece turned 1 and had a big party on Sunday and it made me very sad thinking about all the things I missed out on. I was watching these chaotic children and loving every minute of it. There was a girl trying to bite balloons! It was adorable. I'm 38 now and even if I reversed the vasectomy (haha), suddenly got super healthy, and made way more money, I feel like I'm too old to start.",
      "created_utc": 1728486676.0,
      "score": 1
    },
    {
      "id": "lr3ofrq",
      "body": "Partially. As long as I can remember, I never wanted kids. Just had no appeal to me. And as I got older, I had more and more reasons to not want them; one of them being my lifelong battle with anxiety and other mental health issues. I honestly do not think I could handle having a child and worrying about them for the rest of my life. I don’t regret my decision one bit.",
      "created_utc": 1728486720.0,
      "score": 1
    },
    {
      "id": "lr3ph1w",
      "body": "I feel like if I got pregnant the whole time I'd be worrying about my body being in so much pain and irreparably damaged (not saying that's for every pregnancy and birth but a lot of people do experience that)",
      "created_utc": 1728487061.0,
      "score": 1
    },
    {
      "id": "lr3qwtu",
      "body": "I have always wanted a lot of children. I have a 5 year old and I am also about to be 38. My patience is not what it use to be....add in anxiety and depression....well it's not a good mix. I am thinking of getting my tubes tied but I don't want to do something so permanent and regret it later..... You aren't alone",
      "created_utc": 1728487528.0,
      "score": 1
    },
    {
      "id": "lr3rgxz",
      "body": "When I was pregnant, I had to be on anti anxiety meds and then switched to Zoloft for my 3rd trimester because they said it was safest for the babies. Without the meds, my body is in such panic, it was a risk if I wasn’t on them. \n\nI’ve had health anxiety most of my life on top of PTSD and OCD. Effexor has helped so much of my anxiety; it really all depends what works best for you. \n\nWhen my girls were in the newborn phase, I was always worried and panicking (they are my only and firsts so new parent anxiety was definitely kicking in) but as time goes on, a lot of parent anxiety has subsided with confidence in being a parent. Do I still worry? Yes. But with my medication, experience, routine, and confidence. It’s helped a lot.\n\nHaving children or not having children is a personal choice; and either way you will have a fulfilled life. It all depends on what you want 💗",
      "created_utc": 1728487709.0,
      "score": 1
    },
    {
      "id": "lr3t9rr",
      "body": "Having a kid and crippling anxiety has been an absolutely awful combo. If you know yourself well enough to not do it then that’s great. I don’t recommend it.",
      "created_utc": 1728488293.0,
      "score": 1
    },
    {
      "id": "lr3vubw",
      "body": "Yes. I honestly don't think I could handle having a kid. I'm anxious in general, and we have a dog with a lot of issues over the past couple years. I worry about our dog constantly. I won't let anyone else watch him because I'm scared they'll do his meds wrong or he'll get out if the yard. I would be 10x worse with a kid. I'd be a helicopter mom for sure and we'd probably both suffer because of it so I'm good.",
      "created_utc": 1728489114.0,
      "score": 1
    },
    {
      "id": "lr3w8gq",
      "body": "I don’t think I’m capable of getting married or having children without my anxiety ruining everything. Every time my family says “you’ll understand one day when you have your own kids” I tell them that’s not going to happen \n\nI want to avoid spreading my depression/anxiety to a significant other or children, even if I miss out on all the good that comes from making a family",
      "created_utc": 1728489239.0,
      "score": 1
    },
    {
      "id": "lr40b8l",
      "body": "I'm going to be 50 in a few days, and I've never had kids precisely because I had a crippling phobia of pregnancy and childbirth.  If you could grow kids in tanks like Sea Monkeys, I probably would've had half a dozen by now. I'm pretty happy being child-free, though, and have few regrets about this.",
      "created_utc": 1728490554.0,
      "score": 1
    },
    {
      "id": "lr418pi",
      "body": "🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️ Me 1000%. I am terrified of having to go off meds while pregnant and having a mental breakdown. I’m afraid of how anxious I will be having to be responsible for a human life. I’m afraid that my child would get my panic disorder and depression. The list goes on and on. I hate it. I don’t want to miss out on being a parent because of fear and anxiety, but I also don’t know how to get passed it.",
      "created_utc": 1728490852.0,
      "score": 1
    },
    {
      "id": "lr419d6",
      "body": "I have decided not to have children for many reasons, but anxiety is also one of these reasons. \n\nI already struggle with my anxiety (health anxiety in particular). I can’t imagine dealing with someone else’s anxiety. And in my opinion, bringing someone into this world who might have the same kind of anxiety I have just seems very cruel and selfish.",
      "created_utc": 1728490857.0,
      "score": 1
    },
    {
      "id": "lr41lz1",
      "body": "I love kids, but I couldn't have some of my own that's for sure... :/",
      "created_utc": 1728490972.0,
      "score": 1
    },
    {
      "id": "lr42r67",
      "body": "Anxiety is only one of the many reasons why I’m 100% childfree. \n\nI may pass down my anxiety and panic disorders to my kids. Also, I worry so much and I know that with a kid I would worry like crazy and I would be stressed all the time. \n\nBut it’s not a primary reason for being childfree - I don’t want to be pregnant or give birth, I don’t want to give up my hobbies or free time. I have goals like travelling and I enjoy my quiet weekends. \n\nEven if I didn’t have anxiety or panic disorders, I still wouldn’t want kids",
      "created_utc": 1728491339.0,
      "score": 1
    },
    {
      "id": "lr42rw4",
      "body": "I’m the opposite, I have kids now I have crippling anxiety",
      "created_utc": 1728491345.0,
      "score": 1
    },
    {
      "id": "lr43tkj",
      "body": "I had my kids before I knew I had crippling anxiety. I didn't find out what I was feeling wasn't normal until years after they were grown and gone. You *can* do it. My kids turned out great.",
      "created_utc": 1728491680.0,
      "score": 1
    },
    {
      "id": "lr455co",
      "body": "There has been a few studies that showed people with children live longer! Of course there are risks associated with child birth that need to be considered. My health anxiety actually got a bit better after kids due to the fact I have him to worry about and I'm not stuck in my head as much. But it's such a personal decision whatever you decide is right for you is the right answer.",
      "created_utc": 1728492102.0,
      "score": 1
    },
    {
      "id": "lr460xn",
      "body": "Omggg! Exactly exactly the feeling I have. I think suffering from health anxiety and the anxiety of losing a loved one really scares me to death. And the whole reason why I fear having kids though somewhere I want them.",
      "created_utc": 1728492381.0,
      "score": 1
    },
    {
      "id": "lr48vv1",
      "body": "I wanted kids, almost died, and then abruptly changed my mind.",
      "created_utc": 1728493280.0,
      "score": 1
    },
    {
      "id": "lr49ri7",
      "body": "My child saved my anxiety honestly. Is it crippling still absolutely but does it push me to do things that make me uncomfortable and push me to get myself out of it because I will not let him suffer absolutely yes.",
      "created_utc": 1728493564.0,
      "score": 1
    },
    {
      "id": "lr49zym",
      "body": "yep :/ i’d love to have kids but i think my mental illness would make me a horrible mother",
      "created_utc": 1728493639.0,
      "score": 1
    },
    {
      "id": "lr4aket",
      "body": "Two years ago I got a cat and I am so in love with her. Sometimes when I’m at work or on holiday I’ll get this notion that something terrible has happened to her and I’ll think of all the things it could be. This has convinced me I would probably be one of those awful helicopter parents and I wouldn’t want to do that to a child. If I’m like that with a cat imagine what I’d be like with a human I made???",
      "created_utc": 1728493821.0,
      "score": 1
    },
    {
      "id": "lr4b820",
      "body": "I know that I would become that 'helicopter' parent and probably end up constantly taking my baby to the ER. My health anxiety also just prevents me from wanting to become pregnant and going through childbirth. I also don't want to raise a kid in home with financially instability. I was very anxious as a kid because my dad losing jobs and my parents arguing about money. I don't want my kid to go through what I did.",
      "created_utc": 1728494030.0,
      "score": 1
    },
    {
      "id": "lr4blu5",
      "body": "I have severe health/death anxiety which has only gotten worse having kids (plus not being in counselling or on medication). My worries now include them and my partner. Mostly around \"what if something happens to me and I leave them behind\" but also, \"what if something happens to them\". My son (12) also has health anxiety now, so that's hard too.\n\nTo add, my children are amazing and hilarious and I'm super thankful for them. But if I could do it all again, I wouldn't have had kids, or at the very least, I would have picked someone better to have kids with.",
      "created_utc": 1728494154.0,
      "score": 1
    },
    {
      "id": "lr4ebup",
      "body": "No. How about “Have kids AND crippling anxiety!?”",
      "created_utc": 1728495015.0,
      "score": 1
    },
    {
      "id": "lr4fxcu",
      "body": "No, its because I don't have a pot to piss in and a girl that id want to marry around me and part of that is my fault because I have to fulfill my potential. I hope you get over your anxiety.",
      "created_utc": 1728495522.0,
      "score": 1
    },
    {
      "id": "lr4h9h4",
      "body": "This is literally me. I’d be fine when they’re young and with me but once they’re wanting to be independent and not in my protection I think I’d lose my mind and health.",
      "created_utc": 1728495947.0,
      "score": 1
    },
    {
      "id": "lr4jub2",
      "body": "Life isn’t really good…I choose not to extend it to the unborn.",
      "created_utc": 1728496767.0,
      "score": 1
    },
    {
      "id": "lr4kabd",
      "body": "One of the 5,000 reasons",
      "created_utc": 1728496911.0,
      "score": 1
    },
    {
      "id": "lr4kvja",
      "body": "I would obsess over my children so much I wouldn't be able to get anything done. I would have to be a stay at home husband or else it wouldn't work.",
      "created_utc": 1728497105.0,
      "score": 1
    },
    {
      "id": "lr4l8cf",
      "body": "As long as I can afford surrogates I might have kids 😂cuz my health anxiety would convince me that getting pregnant is not safe. \nAnother big problem : The baby screaming. I might end up in jail cuz yeeting it out of the window would cross my mind.\nEdit : how is a baby even supposed to come out of my underweight body ? Plus am super super super tight down there so I do think abt it a lot. Am not ruining my body for some baby  I haven’t even met yet lol.",
      "created_utc": 1728497220.0,
      "score": 1
    },
    {
      "id": "lr4nu6y",
      "body": "It's totally ok to not want kids! My experience was that taking medicine for my severe anxiety helped  and reduced my health anxiety enough that parenting is possible.  I can't explain how much I love my kids and how glad I am that I get to experience being their mom. Anxiety is weird, I'm levelheaded and reasonable when it comes to their health, but still worry too much about my own.",
      "created_utc": 1728498077.0,
      "score": 1
    },
    {
      "id": "lr4oxxr",
      "body": "Parenting is a big responsability. It doesn’t matter of you have anxiety or any other sort of handicap, if you can't power through it, then you shouldn't. Theres always your partner that might complement where you could lack and viceversa. If anyone is not willing to give their 110% to being a parent then don't be, and there's nothing wrong woth it.",
      "created_utc": 1728498434.0,
      "score": 1
    },
    {
      "id": "lr4rgdh",
      "body": "I got married three years ago. A year after the wedding, I started to have panic attacks and super anxiety. Since then, Ive tried several antidepressants with minimal effect. I don’t want to have kids, because  I couldn’t cope wit that amount of stress. Nonetheless, my husband really wants them and I feel trapped, because he’s almost 50. So, I’m waiting when he’s going to announce that he wants a divorce.",
      "created_utc": 1728499238.0,
      "score": 1
    },
    {
      "id": "lr4w9ry",
      "body": "Yes. I had a harsh upbringing with abusive parents. I'm always terrified I'm going to fuck kids up like my parents did me. It actually resulted in an irrational fear of children and a general dislike of babies. Most women swoon over a baby, I have 0 interest and find them creepy. I can only guess, but I assume it's from my abuse, like a weird trauma response gone haywire. It's only fueled further by the fact no infant placed in my arms has had a good time, they always shriek or cry like I'm some monster the minute they are passed to me. I automatically give them back, and now I just say no thanks.\n\nSo much of what you do and say impacts children for life. I'm not about the do what my parents did to me, not even on accident.",
      "created_utc": 1728500773.0,
      "score": 1
    },
    {
      "id": "lr4wl9s",
      "body": "Omfg if you want anxiety then have kids!  I was fine before children and now I worry about every fucking thing",
      "created_utc": 1728500876.0,
      "score": 1
    },
    {
      "id": "lr4yegf",
      "body": "I chose not to have children because I knew that it might push me over the edge.  I have a hard enough time coping with life as it is.  My Mother is aging and it’s so overwhelming because she needs my help with so many things.  I can’t imagine adding children to the mix.  Also, my husband was fine without having children.  We discussed it beforehand, and he felt that we could make a great life together despite not having children.",
      "created_utc": 1728501455.0,
      "score": 1
    },
    {
      "id": "lr55kh2",
      "body": "I have kids and have health anxiety and panic attacks, kids keep you level and it’s the best feeling anyone can ever have, it’s just pure love like you’ve never felt before,",
      "created_utc": 1728503726.0,
      "score": 1
    },
    {
      "id": "lr563hu",
      "body": "Yup I’d love to have kids but probably won’t happen for me :(",
      "created_utc": 1728503891.0,
      "score": 1
    },
    {
      "id": "lr57ad6",
      "body": "Yes but I’m putting in the mental work right now to get to a good place so I can have the family I’ve always wanted without fear or worry :)",
      "created_utc": 1728504265.0,
      "score": 1
    },
    {
      "id": "lr5bci7",
      "body": "I'm not having kids for many reasons but one of the big ones is mental health. My entire family has high anxiety to some degree or another whether it's diagnosed or not. At this point it has to be genetic, at least the tendency does. I don't want to pass that on. I also doing want to pass on my disability. If I ever did decide to have kids I would adopt, there are tons of kids already in existence that need homes and I feel I would be better with an older kid anyway. Might even adopt a kid WITH my disability since I'm sure that makes it harder to get adopted especially if the kid is already older. I think i could do some good with like teenagers that need to be boosted into adulthood and set up for success.",
      "created_utc": 1728505547.0,
      "score": 1
    },
    {
      "id": "lr5edfa",
      "body": "I didn’t have anxiety (to my awareness) until I was 31. I had my daughter at 32. But I had been in therapy for a few years at that point and working on the anxiety actively.\n\nI am still in therapy. My anxiety decreased during pregnancy magically, I don’t know why as I was terrified of pregnancy prior. Must have been hormonal. But postpartum I have dealt with anxiety and depression, though not particularly worse anxiety than before—just a new focus for the anxiety, obviously. \n\nIf you really want it, seek therapy and treatment. Do for yourself what you would do for your own child should they have anxiety.",
      "created_utc": 1728506512.0,
      "score": 1
    },
    {
      "id": "lr5n552",
      "body": "Yep. I am not mentally strong enough for kids",
      "created_utc": 1728509381.0,
      "score": 1
    },
    {
      "id": "lr5pzz7",
      "body": "Having kids really helped with my anxiety actually. Just game me a new perspective and “too busy to worry”.",
      "created_utc": 1728510355.0,
      "score": 1
    },
    {
      "id": "lr5s33f",
      "body": "You don't *have* to worry about other people, you know? Obviously especially young kids need a little help, but people can also develop independence quickly if allowed to do so",
      "created_utc": 1728511079.0,
      "score": 1
    },
    {
      "id": "lr5wx3f",
      "body": "Yes. My anxiety would consume me even with my meds over my children if I were to have them. Also I would not want to bring children into a world like this.",
      "created_utc": 1728512774.0,
      "score": 1
    },
    {
      "id": "lr60vtv",
      "body": "Avoid having children if you have anxiety..it will only get worse !!!",
      "created_utc": 1728514264.0,
      "score": 1
    },
    {
      "id": "lr619zg",
      "body": "As someone with really bad anxiety who has a kid. Don’t have kids if you have anxiety. This shit sucks. I’m constantly scared I’m going to lose her. My fears were there before her, but since she was born, it’s just gotten so much worse.",
      "created_utc": 1728514410.0,
      "score": 1
    },
    {
      "id": "lr64b7y",
      "body": "No, I’m not having kids because I have all the sex appeal of a moldy potato. I wouldn’t even date me.",
      "created_utc": 1728515563.0,
      "score": 1
    },
    {
      "id": "lr6an9v",
      "body": "Yes! I feel the same way.",
      "created_utc": 1728517918.0,
      "score": 1
    },
    {
      "id": "lr6fztz",
      "body": "Guilty",
      "created_utc": 1728519932.0,
      "score": 1
    },
    {
      "id": "lr7445r",
      "body": "Although anxiety itself wasn't the main factor in me deciding to be childfree, it was definitely an important one.  I've always felt worried that if I accidentally had a kid I wouldn't be able to care for them, and so therefore also always felt super anxious about accidentally getting someone pregnant.\n\nThat being said, the anxiety about having a kid was solved pretty easily for me by getting a vasectomy, however, that may not be for everyone if they still might want a kid in the future.",
      "created_utc": 1728529396.0,
      "score": 1
    },
    {
      "id": "lr7ejgr",
      "body": "Yep. I can barely handle anything being remotely wrong with my dog without going into a spiral. I’ve chosen to not have kids for my own wellbeing and for the wellbeing of those kids. I would be unbearable. That’s no way for a kid to have to live.",
      "created_utc": 1728534306.0,
      "score": 1
    },
    {
      "id": "lr7lgzk",
      "body": "Another thing is children puke and I have emetephobia",
      "created_utc": 1728538094.0,
      "score": 1
    },
    {
      "id": "lr7sxdo",
      "body": "id wanna be rich to have kids bc financial instability is a huge fear of mine and itll just fuck my anxiety and depression up indefinitely",
      "created_utc": 1728542782.0,
      "score": 1
    },
    {
      "id": "lr8k2xh",
      "body": "I definitely can relate to this and yet now I have 3 young kids.\n\nSo I am a hypochondriac due to a traumatic surgery when I was 3, I have had a lot of trauma like loss of very close family members within a short period of time and other traumas so I’m a very anxious person.\n\nNever wanted kids but felt the same as you wondered if I’d miss out or maybe regret it.\nI had always said if I were to be pregnant it would have to be by accident because I’d absolutely never go out of my way to get pregnant due to my anxieties.\n\nMy husband and I accidentally got pregnant, I miscarried which was traumatic but the loss of that possibility of having a child did something to me and actually made me really sad. We ended up pregnant again and I actually made it through the pregnant plus birth without having a mental breakdown.\nThe reason why I think is hormones, once I experienced all the hormones that occur due to pregnancy it almost made me instinctually care more about the baby then myself which was so weird since I’m so hyper sensitive/worried about myself.\nAnd during birth same thing it was like instinct I didn’t even think or worry about myself.\nThen having an actually baby I was so tired, busy and infatuated with my child that I rarely had time to notice myself.\n\nNow that I have 3 kids the only times I ever experience anxiety is when I’m not with them and have time to actually be alone in my thoughts / have time for my mind to wonder. That’s when I notice I’ll start worrying about things like health related anxieties regarding my own health and so on.\n\nI’m not sure if anyone else has experienced this but I say to my husband my kids saved me from anxiety. I still have it and always will but not even close to what it was before having kids.\nNow I’m a mom, my kids depend on ME to calm them, make them feel safe and there’s something very empowering about that.\n\nI just thought I’d share as encouragement!",
      "created_utc": 1728560572.0,
      "score": 1
    },
    {
      "id": "lr8liew",
      "body": "I didn’t do it because of anxiety. Even if i made it past the baby years, then  I would be scared to death every time they left to go to school. Will there be a school shooting? bullying? what if they get cancer?  It’s cruel and selfish to bring an innocent child into the world and be an anxious parent to them - IMO. \nIt is so much to manage. I grieved it and now i own my decision and don’t sit around reeling sorry for myself.  Plus I am Aunt of the Year every year to two little people i cherish (and worry about!) ",
      "created_utc": 1728561267.0,
      "score": 1
    },
    {
      "id": "lr9qw0p",
      "body": "Please know that you need to change your viewpoint on whether or not you have kids(s). You're seeing this from a perspective of \"what I want\", \"what's best for me\" and \"missing out on starting a family\". Please be aware these are all selfish viewpoints. \n\nYou should frame your view on what your unborn child would want. Does your kid want to be born? How will you help your child if they have a physical or mental disability? If your child is healthy, can you raise them well and later on help them go to college? Are you financially well off and can provide a place of safety and solace for your child throughout their life while you're alive and beyond? \n\nYour child may enjoy their life as a whole but will suffer in the process. Your child will get hurt playing sports, will get bullied (or be the bully), will get sick from time to time, may get in a car accident, may be abusive to you or others, may get depressed, will feel stress over schoolwork, may lose their job, may never get married or raise a family of their own, will get frail and old one day (if they're fortunate to live that long), may have an existential crisis on the meaning of life, and eventually die as we all will someday. \n\nLife is suffering, it's a fact of life. However only your child can determine if their suffering was worth it",
      "created_utc": 1728576525.0,
      "score": 1
    },
    {
      "id": "lrgjbbu",
      "body": "I just have anxiety of everything. It’s affecting my work, my intimate life, my friendships and everything. Any ideas what to do? What might be the cause?",
      "created_utc": 1728674856.0,
      "score": 1
    },
    {
      "id": "lrm2k5d",
      "body": "Actually yes but I feel a happy sense of relief surrounding it. Kids need someone engagedamg many hours of the day. Most people don’t do right by their kids in this way and many ways. Most parents are “don’t tell me how to raise my kids” and never open up a parenting book. I see more yell at their kids instead of redirecting. And a lot of parents zoned into their phones. I’m not judging them from a critical pov, but rather saying what kids needs. I would rather help my friends and family with their kids than create another family of kids that also needs the ever lacking community support.",
      "created_utc": 1728762018.0,
      "score": 1
    },
    {
      "id": "lrm37xg",
      "body": "Do t forget about how postpartum can affect depression too. Some women won’t have libido return for two years. I knew a married couple who this happened to the woman, her dumb husband didn’t understand this, and both of them are very Christian. Especially the woman. He pressured her to do an open marriage because he was insecure that he was no longer attractive to her because of her post partum lack of libido and they opened their marriage while having a less than 1 year old newborn. A lot of men pressure their partner into sex before their body (with a gaping wound) can handle it, which can easily lead to death if an infection occurs. Pretty disgusting if you ask me and completely turns me off to pregnancy and child birth. ",
      "created_utc": 1728762246.0,
      "score": 1
    },
    {
      "id": "lrnwf10",
      "body": "Nothing can truly prepare you for having kids—nothing. There are three major events in life that will change you: the death of a loved one, getting married, and having children. Of these, having children is the number one reason for living. You will never experience greater happiness! I've been through the worst, and my children gave me purpose and helped me understand the meaning of life. Have kids! And of course, stay away from drugs—they will damage both your brain and heart.\nTo put things into perspective, one of my kids stop breathing in two occasions and somehow I brought him back twice by performing CPR at 5days old and 1 month old.",
      "created_utc": 1728787212.0,
      "score": 1
    },
    {
      "id": "ls4nxuf",
      "body": "I’m sure you’re a beautiful woman and soul. Don’t let anything hold you back from starting a family. I wish that I had kids when I was younger I always felt that it was my destiny . Hope everything happens good for you sending love from Florida ",
      "created_utc": 1729039537.0,
      "score": 1
    },
    {
      "id": "lr2ljon",
      "body": "Your anxiety gets much better once you have kids. It doesn't disappear, but your brain will be more busy making a living and caring for them. Also now, I can't image my life without them. DO IT. You will not regret it. I was in your place at some point and it's absolutely relatable.",
      "created_utc": 1728470661.0,
      "score": 1
    },
    {
      "id": "lr3h8ge",
      "body": "I didn’t plan my kids. I had them and they are my entire world, biggest joy but also my main anxiety trigger. I didn’t know true fear until I had them. I worry too much",
      "created_utc": 1728484317.0,
      "score": 1
    },
    {
      "id": "lr3kkia",
      "body": "No, I don't want kids because I consider procreating an unnecessary extension of the everlasting pain inherent to existence. I also see birth as the condemnation to face an unescapable fate of death and fear.\n\nConsider your own suffering through health anxiety. By having children, you could be exposing them to the same kind of suffering you're enduring in this moment. Do you really want that?",
      "created_utc": 1728485440.0,
      "score": 1
    },
    {
      "id": "lr2xi5q",
      "body": "i'm not having a child because it's morally wrong",
      "created_utc": 1728476733.0,
      "score": 0
    },
    {
      "id": "lr2w55x",
      "body": "exactly.Nothing about the process seems fun to me.",
      "created_utc": 1728476118.0,
      "score": 84
    },
    {
      "id": "lr3jye1",
      "body": "I ended up developing Tokophobia after 3 miscarriages. I have all these fears now that were non existent when I started TTC.",
      "created_utc": 1728485235.0,
      "score": 8
    },
    {
      "id": "lr8krvp",
      "body": "💯💯💯💯💯",
      "created_utc": 1728560913.0,
      "score": 1
    },
    {
      "id": "lr2tyyr",
      "body": "This explains what it's like perfectly. My wife has to keep me in check otherwise I become a helicopter parent. Every time these kids move I think of every possible way they could hurt themselves doing whatever they are doing. However, there isn't much compared to the feeling when your kid randomly says \"I love you, Dad\" or wants to sit next to you and just chill. Makes it all worth it",
      "created_utc": 1728475108.0,
      "score": 28
    },
    {
      "id": "lr3cabp",
      "body": "Stories like yours is what has me on the fence. I know I would do everything in my power to make sure my kids don’t learn my anxious thought patterns. I know a lot of it stems from childhood traumas of mine and would do everything to not repeat those things.",
      "created_utc": 1728482601.0,
      "score": 9
    },
    {
      "id": "lr2ljjx",
      "body": "Unfortunately, anxiety is something that’s better to be up front and honest about then try to hide. I think as a parent, it’s not just showing the anxieties, but also getting help (therapy and/or meds) and being honest about that with them so that when they struggle with anxiety or whatever else, they follow your pattern of getting help and communicating/not being ashamed.",
      "created_utc": 1728470658.0,
      "score": 36
    },
    {
      "id": "lr30nlj",
      "body": "It’s so hard Thoe",
      "created_utc": 1728478104.0,
      "score": 2
    },
    {
      "id": "lr2n26b",
      "body": "I picked up my dad's health anxiety - not my mom's OCD though (yet).",
      "created_utc": 1728471538.0,
      "score": 4
    },
    {
      "id": "lr3go6h",
      "body": "If you don’t mind me asking, how did you have your kids with your anxiety? I have crippling anxiety and health anxiety (I’m a woman and pregnancy/child birth scares me). I want a kid! But I’m so scared…",
      "created_utc": 1728484124.0,
      "score": 2
    },
    {
      "id": "lr2xl4x",
      "body": "lol then why have kids if you know they'll probably be anxious too",
      "created_utc": 1728476769.0,
      "score": -9
    },
    {
      "id": "lr2j8i3",
      "body": "Im sorry you’re going through that.  Anxiety is a real asshole",
      "created_utc": 1728469211.0,
      "score": 2
    },
    {
      "id": "mcd1wex",
      "body": "If it helps I had anxiety before I had kids, still do now that I have kids and I've found there are benefits. The demands of parenting are good for shifting focus from your anxiety onto caring for others. Also the good parts of being a parent really help boost your mood. Sure there is a lot of struggle that comes with being a parent but I don't think my anxiety is any worse now that I have kids but my life is certainly much better. Can't speak for everyone, just wanted to share my personal experience.",
      "created_utc": 1739367170.0,
      "score": 1
    },
    {
      "id": "mcd2nzk",
      "body": "Also as someone with bad anxiety and two kids I came to agree with everything said here",
      "created_utc": 1739367453.0,
      "score": 1
    },
    {
      "id": "lr43e22",
      "body": "yes, come here to say this.  if you don't have crippling anxiety but want to get it, have a bunch of kids!",
      "created_utc": 1728491541.0,
      "score": 2
    },
    {
      "id": "lr4lvmp",
      "body": "Yep my mom worries about me and my brothers all the time. One brother is deceased and one of the 2 remaining is just ruining his life. It’s hard. And now you said this I have a new perspective abt being a parent. No matter how good we raise the kids ,there will always be that one or more who will drive you insane. My mom deserves better because she went through a lot and now we are making her go through a lot. It’s not fair.",
      "created_utc": 1728497434.0,
      "score": 2
    },
    {
      "id": "lr2zo6k",
      "body": "Ugh this is such a hard decision. Especially considering parenting is the ultimate unknown. Full of what ifs. \n\n\nThere are parents who have children and it changes their life for the better. They're no longer hyperfocused on themselves. And there are parents who have children and feel differently. \nAll this to say, you know yourself best.\n\n\nOne thing that helped me was talking to a therapist to try to tease out what was what. You might already have one but it helped to clarify things.",
      "created_utc": 1728477684.0,
      "score": 6
    },
    {
      "id": "lr2lfk8",
      "body": "I would try.  She's 39, realistically if she doesn't have a child soon she may never.  Does she really want one? It's not selfish to have a child.",
      "created_utc": 1728470590.0,
      "score": 4
    },
    {
      "id": "lr67t3l",
      "body": "Do not underestimate the determination and love fatherhood can give you.\nThe things you are saying are partly valid but also based on the person you are now. You can be a toy different man 4 years from now. (As you are now than 4 years ago.) And it could be for the better if you do the work. When you have children with a partner you love and trust and if you have a safe relationship (not counting feelings of anxiety not based on facts) than I'd think you two could become great parents!\nI do think you need some therapy. Fear/anxiety can lay a curtain over your feelings and thoughts.\nBut do it quickly because of your wifes age. (Life is unfair for giving us such a short amount of time and much pressure in this time in out lives.)\n\nI'm taking the time to write this because something in the way you wrote it made me feel you could be great parents. All based on next to no information, I know.\nWhatever you decide to do, make sure you are both on board. Think about freezing eggs is possible/necessary. Have some therapy either way and talk about this subject. And whatever you do then, if you not just letting the clock run out and decide, but both of you are consciously making that choice, that's okay eitherway.\n\nI wish you good luck!",
      "created_utc": 1728516873.0,
      "score": 1
    },
    {
      "id": "lr9fogt",
      "body": "Is it possible to have a child with it not being selfish? I just realized that most people that want to be a parent say \"I want\" when they talk about having a kid.  It's not \"they want\" because they haven't been born yet. I don't want to go down the rabbit hole if there is a such a thing as unselfish altruism. It's a philosophical delimma for sure. I think it's probably best to just not think about it but it does pop into my mind every now and and again. \n\nShoot now I'm in the rabbit hole. I do want to ask you one thing. Do you think it's possible to date or marry someone where you care more about your spouse or fiancee more than yourself?",
      "created_utc": 1728572839.0,
      "score": 1
    },
    {
      "id": "lr2rtpf",
      "body": "[deleted]",
      "created_utc": 1728474067.0,
      "score": 0
    },
    {
      "id": "lr5wlmk",
      "body": "Thank you for your honesty. We need perspectives like this too. But do know that postpartum anxiety is common, since your hormones need to get back to baseline. Hope that baseline happens soon for you!",
      "created_utc": 1728512656.0,
      "score": 2
    },
    {
      "id": "lr2objf",
      "body": "^^",
      "created_utc": 1728472242.0,
      "score": 2
    },
    {
      "id": "lr3a9ne",
      "body": "This is exactly how I realized I wouldn’t be able to handle my kids! I love kids and seeing them grow throughout the years is beautiful. However, I get OCD flares often to the point where I can’t function. I have a cat and when he’s ill it is soooo stressful for me. I cannot imagine having to care for a child because it would be so hard. \nI get called selfish sometimes, but I stopped taking it personal since it comes from people who already have children.",
      "created_utc": 1728481874.0,
      "score": 6
    },
    {
      "id": "lr3bfnc",
      "body": "I’ve heard this every so often as well. I really hope it would be the case for me, but I’m stuck in a fear cycle where I can’t pull the trigger on it",
      "created_utc": 1728482293.0,
      "score": 3
    },
    {
      "id": "lr41yyt",
      "body": "I was wondering the same thing. My opinion might be biased since I’m childfree, but it seems like some people are still selfish enough to bring kids into a messed up world.",
      "created_utc": 1728491086.0,
      "score": 3
    },
    {
      "id": "lr2xufq",
      "body": "real, idk why anyone in here is saying they want kids because they're also saying they want their kids to inherit their problems. there is plenty of kids that already exist in the world with no parents.",
      "created_utc": 1728476885.0,
      "score": 3
    },
    {
      "id": "lr3ahyh",
      "body": "The child would be very much wanted. I am known as the “mother hen” in my family and everyone tells me I would be an amazing mother. But I just can’t bring myself to have kids if I can’t even get a grip on my anxiety. I can’t even imagine how much worse it would get if I had my “whole heart outside of my body” like how people describe your love and worry for kids. And pregnancy/birth has so much risks as well.",
      "created_utc": 1728481960.0,
      "score": 2
    },
    {
      "id": "lr3bq0l",
      "body": "One thing I’ve heard is that you should know you’re a good mom for even worrying like that. We are all human and not perfect all the time. The fact that you want to be the best for them says a lot about yourself as a mother. Thank you for sharing your perspective!",
      "created_utc": 1728482397.0,
      "score": 1
    },
    {
      "id": "lr5yesd",
      "body": "Thank you so much. I’m sorry to hear that you wanted them but can’t.",
      "created_utc": 1728513336.0,
      "score": 2
    },
    {
      "id": "lr5y0o9",
      "body": "I’m in the U.S. and agree that things are so much different than when I was a teen and younger. Seems like so much more to be anxious about.",
      "created_utc": 1728513186.0,
      "score": 1
    },
    {
      "id": "lr8kwqi",
      "body": "Congratulations, refreshing to hear some people find a way to manage their anxiety",
      "created_utc": 1728560979.0,
      "score": 1
    },
    {
      "id": "lrzyhsd",
      "body": "WHy would i want to bring kids into this anxiety filled world fueled by marketing FOMO",
      "created_utc": 1728971275.0,
      "score": 1
    },
    {
      "id": "lr42wad",
      "body": "But I understand and hope you do better than me to work through it",
      "created_utc": 1728491383.0,
      "score": 1
    },
    {
      "id": "lr6o2fi",
      "body": "What meds do you take, and how was your anxiety during pregnancy?",
      "created_utc": 1728522990.0,
      "score": 1
    },
    {
      "id": "lr6nv32",
      "body": "Problem with me is I know I would give 110% , just worried what it would do to my mental health. I think about how much I put into work and family , where I’m a perfectionist and burn myself out. I still power through it but with lots of anxiety and panic",
      "created_utc": 1728522912.0,
      "score": 2
    },
    {
      "id": "lr6nk5d",
      "body": "I’m so sorry to hear that. I hope he comes around",
      "created_utc": 1728522795.0,
      "score": 1
    },
    {
      "id": "lr6na53",
      "body": "Sorry to hear that ☹️",
      "created_utc": 1728522687.0,
      "score": 1
    },
    {
      "id": "lr6mnjg",
      "body": "Much easier said than done",
      "created_utc": 1728522442.0,
      "score": 1
    },
    {
      "id": "lr6m044",
      "body": "May I ask if you’re speaking from experience ?",
      "created_utc": 1728522191.0,
      "score": 2
    },
    {
      "id": "lr6lpj6",
      "body": "I’m so sorry you’re dealing with that. How old is she? Is it maybe just PPA?\nI’ve definitely been leaning no kids this year because of how rough it was, and how bad my anxiety was. The worst in my life that I can remember.",
      "created_utc": 1728522077.0,
      "score": 0
    },
    {
      "id": "lrhwwsf",
      "body": "Have you ever been to a therapist? That might help you find the root cause",
      "created_utc": 1728693247.0,
      "score": 1
    },
    {
      "id": "lrsfsem",
      "body": "Wow this was a roller coaster to read. Why did your child stop breathing??",
      "created_utc": 1728857956.0,
      "score": 1
    },
    {
      "id": "lr35m2c",
      "body": "It's pretty reckless to make a claim like that with such confidence. YOUR anxiety got much better, but you can't predict what will happen to someone else. My mom's anxiety certainly didn't get better after having kids. ",
      "created_utc": 1728480114.0,
      "score": 2
    },
    {
      "id": "lr2x12t",
      "body": "This is my experience as well, to some degree. I have terrible health anxiety for the past year but before that, my children have helped my anxiety for years.",
      "created_utc": 1728476520.0,
      "score": 2
    },
    {
      "id": "lr3b9zq",
      "body": "I’m always worried that I might pass away and my child won’t have a mother (even though I’m a healthy person), as well as something happening to my child. I can’t imagine it getting better. What kind of anxiety did/do you have? I would really hope this would be the outcome for me but I’m terrified that it won’t be.",
      "created_utc": 1728482237.0,
      "score": 0
    },
    {
      "id": "lr3jeus",
      "body": "I understand it is a very personal decision to make, I do think though that not everything worth having or experiencing has to be enjoyable. I realize pregnancy as a whole is a traumatic experience for the body, but hundreds of thousands of years of procreation and evolution have built bodies plenty capable of bouncing back from such events. We are stronger than we like to believe.",
      "created_utc": 1728485055.0,
      "score": 2
    },
    {
      "id": "lr40jl3",
      "body": "TIL I learned that I have Tokophobia",
      "created_utc": 1728490628.0,
      "score": 3
    },
    {
      "id": "lr3cuzw",
      "body": "In a way, having a baby kind of reduced the anxiety I have about stupid shit. As cliche as it is: it helps put things in perspective",
      "created_utc": 1728482805.0,
      "score": 18
    },
    {
      "id": "lr3k00d",
      "body": "I feel that as someone with anxiety I am the very best person to pick up on, listen to, and help my little one out if they develop any anxiety themselves. I was terrified of having a baby and I do still get panicky about it sometimes but I desperately didn't want to allow my anxiety to dictate the course of my entire life. The thought of being at the end of my life and knowing that I gave up the chance to be a mum over anxiety about things that either never happened, or did but I was able to deal with them, is what swayed me. My little boy pushes me out of my comfort zone daily and that is exhausting but it's forcing me to be brave and showing me what I'm capable of. If the only reason you don't want kids is anxiety, get yourself a therapist that specialises in perinatal mental health and talk it through with them, come up with a battle plan. I can promise you that the little person you get to keep is well worth the effort x",
      "created_utc": 1728485249.0,
      "score": 7
    },
    {
      "id": "lr4wt98",
      "body": "You could never show the slightest amount of anxiety in front of your child, and they could very easily still develop an anxiety disorder.  Because there's a genetic component.\n\nThe analogy I always make is that your genes load the gun but life pulls the trigger.  And what you have running around is a cute little loaded gun.\n\nIt frustrates me that humans, as a whole, refuse to be realistic about having kids.  Most people still revert to their base animal instincts to procreate and try to dress it up as this beautiful life experience.\n\nAnyway, if you're interested, look into [transgenerational epigenetic inheritance](https://en.wikipedia.org/wiki/Transgenerational_epigenetic_inheritance?wprov=sfla1).\n\nAnd I won't even get into things like overpopulation, climate change, increasing income disparity, and every other reason not to have kids.. 😅",
      "created_utc": 1728500946.0,
      "score": 1
    },
    {
      "id": "lr2spex",
      "body": "I totally agree except when it comes to telling them  anxiety you're having about their health. My 5 yr old just had to get his tonsils out and I was super anxious about it for a month but I made sure to never say that in front of him. We talked about what surgery was and how it would hurt a bit afterwards for a few days but he'll get lots of ice pops and medicine and he did amazing! He was all smiles in the hospital leading up to it. He had a rough couple of days when he refused to take pain meds while healing but overall it was so worth it. Had he seen how I was really feeling, he would've freaked out.",
      "created_utc": 1728474502.0,
      "score": 16
    },
    {
      "id": "lr3c22r",
      "body": "Something interesting I recently learned is that healthy anxiety is a form of OCD. An expert can correct me if I’m wrong, but it does make sense. You get obsessive thoughts around your health, and compulsive behaviors to reassure you that you’re safe. \nI was diagnosed with GAD but I think that’s a blanket term, and I might actually have OCD. But then I also get agoraphobia, but it’s related to needing to use a bathroom without one around or me passing out.",
      "created_utc": 1728482518.0,
      "score": 7
    },
    {
      "id": "lr2olnz",
      "body": "I’m only just now realising how much health anxiety my dad has so clearly that didn’t help me haha",
      "created_utc": 1728472396.0,
      "score": 2
    },
    {
      "id": "lr4z9wf",
      "body": "I always wanted kids. For me, I would have done just about anything to have them. I know that’s unhelpful but it’s the truth. I put my fears aside and just went for it. Sending you love.",
      "created_utc": 1728501732.0,
      "score": 2
    },
    {
      "id": "lr34o3f",
      "body": "Because life is worth living even with anxiety",
      "created_utc": 1728479740.0,
      "score": 8
    },
    {
      "id": "lr4xo08",
      "body": "Well like I said… only just recently did I realise. ie post kids. But also - because I wanted to? Let’s call it a difference of opinion, clearly.",
      "created_utc": 1728501217.0,
      "score": 1
    },
    {
      "id": "lr3ev11",
      "body": "Thank you I appreciate that. Ya a few people told me that maybe having a child will change you handle things. But I know myself. I love children. And I want to be able to have our own. But I know I will just shut down.",
      "created_utc": 1728483504.0,
      "score": 3
    },
    {
      "id": "lr3uvoq",
      "body": "There are many selfish reasons that people have children. People say that having kids is “worth it” to them, but is it worth it to the kid? Many of us have traumatic childhoods, I don’t think going through that was “worth it”",
      "created_utc": 1728488808.0,
      "score": 5
    },
    {
      "id": "lr3ei58",
      "body": "Well that's the problem. Not only is she 39 but unfortunately has PCOS as well. So it's only going to get worse from here 😑",
      "created_utc": 1728483382.0,
      "score": 3
    },
    {
      "id": "lr6d0r1",
      "body": "Thank you so much. I actually am going through therapy and all that. But unfortunately, what I'm dealing with seems to be more physical than mental and doctors have even determined that. The physical symptoms im dealing with is causing mental ailments and they just can't figure things out. 😒",
      "created_utc": 1728518811.0,
      "score": 1
    },
    {
      "id": "lra06bn",
      "body": "Well the reason why im saying it would be selfish is because it seems as if my responsibility won't be focused on caring for the child. Because I'm too messed up",
      "created_utc": 1728579551.0,
      "score": 2
    },
    {
      "id": "lr3elz4",
      "body": "Oh I'm extremely thankful. But this post was about having children.",
      "created_utc": 1728483419.0,
      "score": 6
    },
    {
      "id": "lr669ns",
      "body": "I’m the dad 😭",
      "created_utc": 1728516296.0,
      "score": 3
    },
    {
      "id": "lr3kudb",
      "body": "Yeah, I get bothered by the hate sometimes but people who judge choices others make are not people I really care to value the opinions of.",
      "created_utc": 1728485531.0,
      "score": 2
    },
    {
      "id": "lr4a7va",
      "body": "Totally understandable. \n\nIf it helps put things in perspective, even people who don’t suffer from anxiety find it hard to bite the bullet and finally have a kid. They wait and wait for the day they feel fully ready but you never really are haha but you do it anyway",
      "created_utc": 1728493710.0,
      "score": 5
    },
    {
      "id": "lr425ap",
      "body": "Yeah, honestly it’s just confusing trying to understand their logic",
      "created_utc": 1728491143.0,
      "score": 2
    },
    {
      "id": "lr5wd2c",
      "body": "I don’t think having kids means they automatically inherit their parents problems. I don’t have the same problems my parents have.",
      "created_utc": 1728512567.0,
      "score": 1
    },
    {
      "id": "lr3as1z",
      "body": "Yup there's only one good choice to have kids and thats to adopt. Giving birth to kids is morally the most fked up thing imaginable, at least for me. Forcing life into someone, without asking him, without knowing how bad life will fck him over. Like wtf why is it so fkin normalized I dont get it.",
      "created_utc": 1728482062.0,
      "score": -2
    },
    {
      "id": "lr5yntz",
      "body": "It was unfortunately necessary, I’m trans so yeah, that’s part of the deal when you get surgery. I think it’s always going to hurt that I can’t have biological kids of my own, but I could always adopt and I know I’m going to be an amazing auntie!",
      "created_utc": 1728513432.0,
      "score": 1
    },
    {
      "id": "lr5zzdy",
      "body": "Exactly. And I wish I could tell you that it is nothing to worry about. But, I have 6th, 7th, and 8th graders who have threats of violence at their schools, and my anxiety can’t handle it. Hell, this county since 2020 is even a different place and I don’t see it going back to where it was before. It is so divided, and there is so much hatred. I have a ton of anxiety as empathy is probably my core value and I can’t imagine the lack of empathy going on everywhere. 💔 And I feel guilty for bringing my kids into this.",
      "created_utc": 1728513921.0,
      "score": 1
    },
    {
      "id": "lr75ql5",
      "body": "I think it is because I love them so much so it is good and bad",
      "created_utc": 1728530110.0,
      "score": 1
    },
    {
      "id": "lsawcv9",
      "body": "ehhh... not really. I think the hard part isn't the independence, which comes naturally, but anxious people not fretting pointlessly, which is hard for them to not do.",
      "created_utc": 1729131330.0,
      "score": 1
    },
    {
      "id": "lr6m2gh",
      "body": "Yes",
      "created_utc": 1728522216.0,
      "score": 1
    },
    {
      "id": "lr7rlqu",
      "body": "She’s just turned 2. It’s not as bad as when she was an infant, but it doesn’t seem to be going anywhere. I got horrible health anxiety after my dad died in like, 2019, so that’s just been added on. But yeah, it’s rough to have anxiety and kids. But I can never say I regret having her.",
      "created_utc": 1728541919.0,
      "score": 1
    },
    {
      "id": "lsmfwdm",
      "body": "We discovered his stomach issues just a few days after leaving the NICU, issues we hadn’t known about before. I honestly can't remember much of what happened in my life during his first year because all my focus was on him. While most parents feed their baby every 2-3 hours and then rest, I had to keep mine almost upright constantly, or else he would vomit everything back up and stop breathing because he wasn't strong enough to clear his throat. Needless to say, I didn’t get much sleep that year. Adding cereal to his formula helped his stomach settle, allowing him to gain weight and reduce the vomiting.\n\n\nNow, at 9 years old, he’s thriving—excelling in advanced mathematics in his gifted and talented class, mastering the saxophone, and even getting into coding.\n\n\nIf I had to do it all over again, I would in a heartbeat.",
      "created_utc": 1729302306.0,
      "score": 1
    },
    {
      "id": "lr7l1bs",
      "body": "Thats true. I shouldnt have generalized. But I bet your mom would choose having you and anxiety rather than just anxiety alone.",
      "created_utc": 1728537840.0,
      "score": 1
    },
    {
      "id": "lr7kny2",
      "body": "I have had exactly the same thoughts. And to tell you the truth, I still do. \n\nI had severe panic disorder from health anxiety especially the heart. And extreme fear of death. Even though; thanks to god I am a healthy person. But guess what and this triggers me before anyone. We are all on the same road. But I’d rather have children and anxiety rather than just having anxiety. \n\nHaving children or not having children is not the question here. Anxiety might never go away. But its a million times better when you experience this kind of love you give to your children or receive from them. And you will never know what life throws at you but one thing I know is god promised he provides sustenance and protection. \n\nThis conversation can go on and on about the uncertainty and someone’s beliefs. But the point is. Anxiety stems from your vicious cycle happening inside your brain. When you have children, your brain will have less time worrying about itself and tricking you into unreasonable fears while you direct your focus towards the love you get from your children and provide.",
      "created_utc": 1728537625.0,
      "score": 1
    },
    {
      "id": "lr3ntp9",
      "body": "Having babies can literally kill you, if somebody doesn’t want to risk it you shouldn’t judge or pressure them because of it.",
      "created_utc": 1728486517.0,
      "score": 40
    },
    {
      "id": "lr5z3gv",
      "body": "I get what you’re trying to say. \n\nI’ve wanted kids severely for as long as I can remember. I also suffer with debilitating anxiety and depression from time to time. I worry about what it will be like to deal with those issues while pregnant, raising children, etc. That said, to me and my wants and goals, it is worth it. \n\nEveryone is different though. If you don’t want kids, don’t have them. That’s perfectly okay too.",
      "created_utc": 1728513592.0,
      "score": 2
    },
    {
      "id": "lrm3f3o",
      "body": "And I think we’ve been told this exact thing for so long that it makes it difficult for women to think about what they want for themselves. ",
      "created_utc": 1728762315.0,
      "score": 1
    },
    {
      "id": "lr3d1zc",
      "body": "Preach",
      "created_utc": 1728482874.0,
      "score": 6
    },
    {
      "id": "lr44i0o",
      "body": "I really hope this is what happens to me!",
      "created_utc": 1728491896.0,
      "score": 1
    },
    {
      "id": "lr2wt86",
      "body": "I get that, but later in life when he’s in a situation you can be open about it - hey, remember when you got your tonsils out? I was a wreck! As a parent that’s how we are right? It’s normal to feel for our kids safety. It’s our job. It’s all about the communication and how we do it.",
      "created_utc": 1728476422.0,
      "score": 12
    },
    {
      "id": "lr5cw39",
      "body": "Thank you. I need to be brave like you! ",
      "created_utc": 1728506038.0,
      "score": 1
    },
    {
      "id": "lr3i2q7",
      "body": "having kids at all is immoral tbh\n\nyou're okay with kids getting traumatised by panic attacks that feel like dying. cool 👍",
      "created_utc": 1728484607.0,
      "score": -7
    },
    {
      "id": "lr4xshx",
      "body": "yeah its all about what *you* wanted lol. not a single thing about your kids, typical parent",
      "created_utc": 1728501258.0,
      "score": 0
    },
    {
      "id": "lrlparh",
      "body": "I'm sorry to hear that.\nI can relate because I've had a chronic pain illness (Fibromyalgia) for about 20 years now and I'm only in my late thirties. It's kind of a mystery disease (unknown cause, no treatment) but with a lot of pain and with a wide array of strange other sympthoms.\n\nHaving most parts of your life being taken from you is just very hard to deal with. Besides the obvious strain of not feeling well physically. \nThere should be more attention in healthcare for the impact that physical damage/pain has on the brain and the nervous system because it's very important for mental wellbeing but also for healing in calming the physical body down while being sick/having pain etc.\nAnyways, I think it's awesome that you are already in therapy and you are being taken seriously physically.\nI wish you well!",
      "created_utc": 1728757564.0,
      "score": 1
    },
    {
      "id": "lr6ldkh",
      "body": "lol aww I’m sorry. I don’t like that for you, but I must say, it’s actually its even refreshing to hear a dads perspective and that they can also relate. I feel like most dads don’t get it , since women typically deal with the most effects of child rearing and obviously pregnancy/birth.",
      "created_utc": 1728521950.0,
      "score": 2
    },
    {
      "id": "lr5wl0n",
      "body": "having kids is immoral in general anyway because they might get a disorder even if you dont have it",
      "created_utc": 1728512649.0,
      "score": 1
    },
    {
      "id": "lr54xl6",
      "body": "Absolutely wild to describe one of the few biological and evolutionary constants in life as “normalized” lmao",
      "created_utc": 1728503530.0,
      "score": 5
    },
    {
      "id": "lr5ew1a",
      "body": "Adopted kids also get born and have life forced onto them…\n\nI wish you could see life as a gift even if it sucks sometimes.",
      "created_utc": 1728506678.0,
      "score": 3
    },
    {
      "id": "lr5w393",
      "body": "Just wondering, would you rather have never been alive or born if you truly believe life is so bad? What keeps you going everyday so that you don’t try to end it, if it’s that bad?\n\nMy anxiety is bad, but probably because I feel like life is beautiful and worth living. That’s why I have health anxiety. I don’t want a short life.",
      "created_utc": 1728512468.0,
      "score": 0
    },
    {
      "id": "lr6mgs7",
      "body": "I take comfort in knowing I at least have a niece and nephew I can snatch away for weekends and spoil too",
      "created_utc": 1728522370.0,
      "score": 2
    },
    {
      "id": "lr6m9qs",
      "body": "I was just saying the other how there’s been such a huge shift since 2020. Feels like living in an alternate universe. I also feel like I lost all those years due to worry. Wishing you and your kids safety and health 🙏",
      "created_utc": 1728522295.0,
      "score": 1
    },
    {
      "id": "lr8l6h1",
      "body": "I’ve heard it described this way as well. I just don’t know if I can handle another thing that may give me intense anxiety.",
      "created_utc": 1728561109.0,
      "score": 2
    },
    {
      "id": "lscqhqf",
      "body": "Well, yes. That’s what I’m referring to. I worry about grown adults in my family that are independent, let alone children.",
      "created_utc": 1729168175.0,
      "score": 1
    },
    {
      "id": "lr6p111",
      "body": "Sigh. Thank you for your honesty! \nI didn’t expect this post to blow up, but it’s been a huge eye opener about how many people feel strongly about this topic, and that it’s not just me.",
      "created_utc": 1728523366.0,
      "score": 1
    },
    {
      "id": "lr8jsy0",
      "body": "My condolences about your father. I lost my future mother in law this year and it’s definitely made my anxiety worse.",
      "created_utc": 1728560435.0,
      "score": 1
    },
    {
      "id": "lsof7u4",
      "body": "Wow, glad you child is ok",
      "created_utc": 1729342180.0,
      "score": 1
    },
    {
      "id": "lr7m81s",
      "body": "You're right that she most likely would have; however, because of her insurmountable mental health struggles, my childhood was isolating and scary, and I have forgone having children myself because I don't want them to have to experience anything like the life I've had. It's too much for me to put on another living being. ",
      "created_utc": 1728538540.0,
      "score": 1
    },
    {
      "id": "lr7kpxf",
      "body": "Feel free to dm me bro should you like to ask about anything. We are all on the same boat.",
      "created_utc": 1728537656.0,
      "score": 1
    },
    {
      "id": "lr3oedf",
      "body": "I’m not pressuring anyone. Anything you do throughout you day could literally kill you. The person I replied to said nothing about the process seems “fun”, I’m simply offering that not everything has to be “fun” for it to be worth it. Like I said it’s a personal choice everyone gets to and should be allowed to make. I wasn’t telling anyone to go make a baby. But this is a sub-reddit about anxiety, and generally about people wanting help with it. If you don’t want a baby that’s fine, but don’t let your anxiety be the determining factor.",
      "created_utc": 1728486706.0,
      "score": 12
    },
    {
      "id": "lr313ce",
      "body": "Oh totally! I just didn't want him to be nervous leading up to it like I was. I love your earlier point about being open about therapy and anxiety. I talk to my kids a lot about how a little anxiety is good, like remembering to check before you cross the street keeps you safe. But when it takes over your life, it's time to talk to someone. I have a therapist I talk to once a month, even when things are good because I love her point of view and then if things get too stressful for me, I can just add appointments instead of stressing about finding a good therapist while I'm already stressing.",
      "created_utc": 1728478288.0,
      "score": 4
    },
    {
      "id": "lr4ytvz",
      "body": "You can argue a million different ways why you shouldn’t have kids. Climate change, global conflict, cost of living, generational trauma etc etc. all of those would be more convincing to me, someone who has panic attacks, than this comment. Mental illness is something to teach children, like everything else. I’ve never had a panic attack in front of my children but one day I will and I will, after the fact, explain to them what happened rationally. How many people in the world have had at least one panic attack? Why would you not? \n\nBut sure, we’re all just selfish. Hope you feel better.",
      "created_utc": 1728501591.0,
      "score": 2
    },
    {
      "id": "lr514qa",
      "body": "You’re right, I better go back in time and meet with my husband’s sperm and my egg before we conceived to check they want to form a blastocyst.",
      "created_utc": 1728502331.0,
      "score": 2
    },
    {
      "id": "lr7j775",
      "body": "Yea but they already exist, they are already here and need a patent. It's morally wrong to make one cuz they're waiting for parents.\n\nMan eben if I see life as a gift, all it needs for this concept to work is ONE person on the whole world that hates life. Dont make kids cuz ur kid could be this one person. Thats why.",
      "created_utc": 1728536795.0,
      "score": 0
    },
    {
      "id": "lr7jrsz",
      "body": "I dont self destruct cuz I dont wanna hurt parents. Mum didnt know she had depression and that it would be inherited by me. Once they're gone I will be gone too.\n\nEasy answer: I wanna die, but not today.\n\nOh I have some health anxiety too. But thats mainly cuz my anxiety/AvPD doesnt let me go outside easily and specially not to places like doctors and stuff like barber/restaurant/cinema/whatever.\n\nI have two legs and would give them away for the removal of my AvPD. Cuz what are legs worth if I cant go outside.",
      "created_utc": 1728537117.0,
      "score": 1
    },
    {
      "id": "lr8lud5",
      "body": "Yes that is very true also!",
      "created_utc": 1728561426.0,
      "score": 1
    },
    {
      "id": "lr3swck",
      "body": "If you’re not going to have “fun” raising a child then why would you do it? Why resign yourself to a life of responsibility and possibly destroy your health in the process?  Saying that “we are stronger than we like to believe” and “our bodies evolved to do this” sounds a lot like pressuring to me. Society keeps telling us to have babies by saying shit like that when really it would most likely be a poor outcome for that child. What child wants to grow up with an anxious overbearing parent that doesn’t even have fun raising them?",
      "created_utc": 1728488173.0,
      "score": 13
    },
    {
      "id": "lr55j4z",
      "body": "Great path to be on! Good job.",
      "created_utc": 1728503715.0,
      "score": 0
    },
    {
      "id": "lr4z2ga",
      "body": "yes you are, you got it:)\n\nyou had kids why? because you just felt like it, despite all of the reasons you listed? yes, you are as selfish as they come.",
      "created_utc": 1728501665.0,
      "score": 0
    },
    {
      "id": "lr51a78",
      "body": "you could have said \"because i wanted to give my kids a good life\" or something like that (which is false anyway but it makes more sense than \"because i felt like being a breeder\")",
      "created_utc": 1728502380.0,
      "score": 1
    },
    {
      "id": "lr9yrip",
      "body": "By the same token you also don’t get to assume who will hate or love life upon being born.\n\nIf born to good caring loving parents, a child is much more likely to enjoy life.",
      "created_utc": 1728579103.0,
      "score": 1
    },
    {
      "id": "lr8kek2",
      "body": "I’m so sorry you feel that way. Life is definitely hard and my anxiety can be torture at times but I feel thankful to be alive and healthy. I think the good outweighs the bad. I’m sorry life has not treated you the same. I hope there is a shift for you  that changes your perspective, and wish you peace.",
      "created_utc": 1728560731.0,
      "score": 1
    },
    {
      "id": "lr41d2b",
      "body": "Our bodies *did* evolve to do this exact thing. By definition, all life did. That's not pressuring, it's a statement of scientific fact. If they had used that to justify why you should have kids, that would be pressuring, but they didn't say that. They just acknowledged reality.",
      "created_utc": 1728490891.0,
      "score": 9
    },
    {
      "id": "lr3us9w",
      "body": "You’re making a lot of assumptions. 1. That raising a child has to be “fun” all the time to be worth it. Raising a child or children is not easy, and exactly like life without a child, it will be filled with good and bad moments. 2. Newsflash, unless you plan on remaining a child yourself forever your life will already be filled with responsibility and the possibility of destroying your health in the process. That’s called LIVING. You can’t stay healthy all the time until the day you die. If someone is worried about the physical and mental toll of pregnancy and raising children consult medical experts to ease the worries. 3. Again I wasn’t telling anyone what to do, just offering that letting anxiety make a decision for you is not actually making a decision it’s living in fear. If you truly don’t want a child regardless of your anxiety about it, then don’t have one. 4. Why do you assume a parent with anxiety can’t raise a child who is happy and well adjusted? Why do you automatically assume that an anxious parent is a bad parent? Because it was YOUR experience? I had a father who was anxious and depressed his whole life. Up until the point that he took his own life. Does that make him a bad father? No, not in my opinion and not in the opinion of my 4 younger siblings. You are either very young, or a very naive and idealistic person. Life is messy, but not always. Life is dangerous, but not always. Have a baby, don’t have a baby, I don’t fucking care. But don’t let your anxiety decide what you do with your life.",
      "created_utc": 1728488778.0,
      "score": -4
    },
    {
      "id": "lr50gct",
      "body": "Haha, by that reasoning, isn’t your own existence immoral then? Why are you still alive? How selfish of you. \n\nIf you counter by saying you didn’t choose to be, I counter by saying you’re choosing to be now. \n\nNot only that, but you’re choosing to be alive AND an asshole on reddit. Way to make the most of it.",
      "created_utc": 1728502110.0,
      "score": 2
    },
    {
      "id": "lr51kd4",
      "body": "You just pointed out that you’d argue with any of my reasoning, so I figured I’d not waste my time",
      "created_utc": 1728502469.0,
      "score": 2
    },
    {
      "id": "lr45idw",
      "body": "They said pregnancy is a traumatic experience for the body but then contrasted that by saying “BUT we eVolved to do that” and “our bodies can bounce back, we’re stronger than we think” which duh of course people have been popping babies out forever that doesn’t mean it can’t permanently damage you body, change the way you look, KILL YOU, or god forbid you have a child with disabilities. I consider that pressuring since they didn’t respond to the main post, but to a commenter that agreed on deciding not to have children.",
      "created_utc": 1728492217.0,
      "score": -2
    },
    {
      "id": "lr400qz",
      "body": "Also it’s quite rude to call somebody naive and idealistic.",
      "created_utc": 1728490459.0,
      "score": 2
    },
    {
      "id": "lr3ztmx",
      "body": "[removed]",
      "created_utc": 1728490396.0,
      "score": 0
    },
    {
      "id": "lr50ri9",
      "body": "no i'm not choosing to be, survival instinct is a thing. the first time i hurt myself it was almost impossible because my body sent me into a panic because what i was doing went against being alive. my parents are the selfish ones. i'm choosing to be an \"asshole\" on reddit by telling people the truth; most parents are selfish.\n\nand i have no foolproof way out of here lol...if i had a gun i wouldn't be here",
      "created_utc": 1728502210.0,
      "score": 1
    },
    {
      "id": "lr51ork",
      "body": "yes but i wouldn't have called you selfish if you had given me that reasoning. but you just proved my point, that parents are selfish",
      "created_utc": 1728502508.0,
      "score": 0
    },
    {
      "id": "lr4e5wb",
      "body": "Both of what y'all said are true though. You're looking wayyy too deep into what they said, I saw no pressure there. Literally the first sentence was along the lines of I understand it's a personal decision.\n\nIt's like if I tried to argue that because you don't want kids because you find it traumatic, you're then implying that I find it completely fun because I wanted a kid. That sounds silly doesn't it?",
      "created_utc": 1728494962.0,
      "score": 9
    },
    {
      "id": "lr4y3es",
      "body": "No one is debating whether pregnancy can kill you. But we literally *did* evolve to do that.\n\nThe odds of a baby being born disabled are 3%.\n\nThe odds of the mother dying during childbirth are 0.022%.\n\nIt's okay if you don't want to have children, but these are fringe cases, yet you're acting like they're common. They are not.",
      "created_utc": 1728501355.0,
      "score": 5
    },
    {
      "id": "lr66r4i",
      "body": "How DARE you?  \nMy father did kill himself and I resent how JUDGEMENTAL you people are about it! \n\nI've had to hide his manner of death b/c of people like you.",
      "created_utc": 1728516478.0,
      "score": 2
    },
    {
      "id": "lr6q83y",
      "body": "This content has been removed. We require that all posts be of a supportive nature.",
      "created_utc": 1728523828.0,
      "score": 1
    },
    {
      "id": "lr40rp2",
      "body": "You’re clearly a troll and someone who doesn’t understand mental health if you’re going to call someone who commits suicide “selfish” which again would make you naive. Enjoy your day.",
      "created_utc": 1728490700.0,
      "score": 1
    },
    {
      "id": "lr52epm",
      "body": "I’m sad for you. If you’re not already, you should get help.",
      "created_utc": 1728502737.0,
      "score": 2
    },
    {
      "id": "lr9cuwk",
      "body": "Those odds are too high. Is there a way that genetic or DNA testing beforehand can show if there is a 0% chance of a baby being born disabled? In our day and age with our technology and medical advances there should be no reason babies are still being born disabled",
      "created_utc": 1728571896.0,
      "score": 1
    },
    {
      "id": "lr5sgup",
      "body": "Do you have any source for the death during childbirth statistic? I’d like to read it because that may help some of my anxiety. It’s a lot lower than I thought it would be.",
      "created_utc": 1728511198.0,
      "score": 0
    },
    {
      "id": "lr4357w",
      "body": "I’m a troll because I’m stating my opinion? Again it’s rude to call people names. And it is selfish, people do it because they can’t deal with their own life and in the process they destroy everybody around them and leave their responsibilities to others. How is it not selfish?",
      "created_utc": 1728491462.0,
      "score": -1
    },
    {
      "id": "lr52g87",
      "body": "i am",
      "created_utc": 1728502750.0,
      "score": 1
    }
  ]
}