{
  "id": "1deke08",
  "title": "I sleep with a teddy bear at 27 ",
  "selftext": "I'm so anxious that I need it to sleep. Anxiety painful, tremors, chest tightbess, and hard to concentrate. ",
  "created_utc": 1718233794.0,
  "score": 1018,
  "num_comments": 542,
  "url": "https://www.reddit.com/r/Anxiety/comments/1deke08/i_sleep_with_a_teddy_bear_at_27/",
  "comments": [
    {
      "id": "l8clv6s",
      "body": "I sleep with a squishmallow at 26… I’m single, so cuddling with it, is all I got 🤷🏻‍♀️",
      "created_utc": 1718236318.0,
      "score": 440
    },
    {
      "id": "l8chnaz",
      "body": "Nothing wrong with that!",
      "created_utc": 1718234663.0,
      "score": 548
    },
    {
      "id": "l8ctrhw",
      "body": "40 y/o here and sleep with a bear.",
      "created_utc": 1718239495.0,
      "score": 198
    },
    {
      "id": "l8cxsie",
      "body": "So? I’m a 30 year old dude currently in bed with my 27 year old wife. A teddy bear is also in here somewhere",
      "created_utc": 1718241105.0,
      "score": 216
    },
    {
      "id": "l8clg1v",
      "body": "At 22, I sleep with my weighted dinosaur, I love her with all my heart. Whenever my boyfriend and I are on FaceTime in bed he’ll say “awe, you’re cuddling with your dinosaur ☺️” makes me chuckle.",
      "created_utc": 1718236150.0,
      "score": 96
    },
    {
      "id": "l8cnagc",
      "body": "I sleep with a squishmallow named Georgia O'Teef because she is a shark and has nice teef\nEdit: I too am 27 for the following month at least",
      "created_utc": 1718236885.0,
      "score": 65
    },
    {
      "id": "l8cu82r",
      "body": "I have 2 stuffed Octopuses 🐙 I sleep with and my couch is lined with stuffed animals.  For some reason I feel safer I guess. I'm 53.",
      "created_utc": 1718239681.0,
      "score": 56
    },
    {
      "id": "l8cppzb",
      "body": "Jumping on the train of saying it’s so totally fine 💛 30 here, I do it too.",
      "created_utc": 1718237877.0,
      "score": 43
    },
    {
      "id": "l8cjrpb",
      "body": "I sleep with a weighted plushie. And I just bought a second one last night. They’re the big ones too lol. They help! No shame.",
      "created_utc": 1718235487.0,
      "score": 26
    },
    {
      "id": "l8cr960",
      "body": "May I recommend , the Warmies plushes. You microwave them to get them warm and they smell like lavender. The warmth is really comforting during anxiety",
      "created_utc": 1718238493.0,
      "score": 26
    },
    {
      "id": "l8cxsxv",
      "body": "I’m 40 and I’ve had one since my dog died in 2020.",
      "created_utc": 1718241110.0,
      "score": 28
    },
    {
      "id": "l8cx7ae",
      "body": "42 with a purple frosted donut squishmallow 🍩",
      "created_utc": 1718240871.0,
      "score": 19
    },
    {
      "id": "l8cw0pr",
      "body": "I’m 26 and I have a snowman plushie I’ve had since i was a baby and I sleep with him ever night. His name is snow bear🥰",
      "created_utc": 1718240395.0,
      "score": 16
    },
    {
      "id": "l8dbni4",
      "body": "And there is nothing wrong with that.\n\nI'm almost 60 and I have stuffed animals.\n\nIt's a comfort",
      "created_utc": 1718246722.0,
      "score": 16
    },
    {
      "id": "l8cs4z8",
      "body": "29, been sleeping with my Ducky for over 19 years",
      "created_utc": 1718238847.0,
      "score": 13
    },
    {
      "id": "l8cpdfj",
      "body": "Im 27 and sleep with a bunch of pillows and some stuffed animals…AND with the bathroom light on (night lights don’t do a thing for me)",
      "created_utc": 1718237734.0,
      "score": 11
    },
    {
      "id": "l8d28sa",
      "body": "I’m 43 and I sleep with a Baphomet plushie.",
      "created_utc": 1718242919.0,
      "score": 26
    },
    {
      "id": "l8cjkva",
      "body": "Me too",
      "created_utc": 1718235411.0,
      "score": 11
    },
    {
      "id": "l8cmr1j",
      "body": "I have a stuffed animal I sleep with as well. He is a beaver squishmallow :3",
      "created_utc": 1718236669.0,
      "score": 11
    },
    {
      "id": "l8cpwq0",
      "body": "I'm in my mid 30s and while I have my very favorite stuffed animal safely tucked away so my cat doesn't get to it, I have plenty on my bed still including a shark and a bunny that I frequently sleep with.",
      "created_utc": 1718237954.0,
      "score": 8
    },
    {
      "id": "l8ctld6",
      "body": "My husband is in his 40s and he still uses a pillow to snuggle with when I’m not in bed.  If sleeping with a teddy helps you sleep then keep doing it",
      "created_utc": 1718239426.0,
      "score": 9
    },
    {
      "id": "l8cycr7",
      "body": "Hey, I still have my stuffed dog from when I was born!",
      "created_utc": 1718241336.0,
      "score": 8
    },
    {
      "id": "l8ctrt3",
      "body": "me too!! well (well im turning 27 in two months) i sleep with a big white bear my friend gave me and a small lion that an old guidance counselor gave me",
      "created_utc": 1718239498.0,
      "score": 7
    },
    {
      "id": "l8ctrvy",
      "body": "Me too",
      "created_utc": 1718239499.0,
      "score": 7
    },
    {
      "id": "l8cwhe8",
      "body": "I did until I got a dog and he tore up the teddy bear. Now I cuddle with him 😂",
      "created_utc": 1718240585.0,
      "score": 7
    },
    {
      "id": "l8dc0yt",
      "body": "I'm 32 and have a stuffed bunny I still sleep with. Or my cats <3 Nothing wrong with that",
      "created_utc": 1718246868.0,
      "score": 7
    },
    {
      "id": "l8cyjd2",
      "body": "I have been sleeping with the same stuffed bear for 30 years.",
      "created_utc": 1718241410.0,
      "score": 7
    },
    {
      "id": "l8cywnt",
      "body": "32 and teddy has been with me all the way!",
      "created_utc": 1718241558.0,
      "score": 6
    },
    {
      "id": "l8d1cq6",
      "body": "40 year old sleeps with a bear I got when I was 7. Boyfriend’s aware, no issue 😊",
      "created_utc": 1718242558.0,
      "score": 5
    },
    {
      "id": "l8d9ctu",
      "body": "Half a century here and I have a big brown bear named Buster.  Got him in 1993 before my wife and I were married.  (We were, however, dating at the time.)",
      "created_utc": 1718245775.0,
      "score": 6
    },
    {
      "id": "l8cr4gu",
      "body": "I do too! I have several and I’m 28!",
      "created_utc": 1718238441.0,
      "score": 5
    },
    {
      "id": "l8crzl6",
      "body": "It’s fine. 🥰",
      "created_utc": 1718238787.0,
      "score": 5
    },
    {
      "id": "l8d0cqg",
      "body": "About to turn 40. I have a stuffed raccoon named Boo.",
      "created_utc": 1718242145.0,
      "score": 5
    },
    {
      "id": "l8d7b30",
      "body": "My lovely boyfriend got me a big pink bear for valentines day and now I cuddle with it more than i cuddle with my boyfriend and I am 32 lol",
      "created_utc": 1718244973.0,
      "score": 6
    },
    {
      "id": "l8cly8i",
      "body": "If it helps you get a good night’s sleep, makes you feel better/more secure, etc., keep doing it!",
      "created_utc": 1718236351.0,
      "score": 8
    },
    {
      "id": "l8cr9fw",
      "body": "Cutie",
      "created_utc": 1718238496.0,
      "score": 4
    },
    {
      "id": "l8crs1m",
      "body": "I won't judge you.",
      "created_utc": 1718238704.0,
      "score": 4
    },
    {
      "id": "l8cydkc",
      "body": "I’m 23 sleep with a bear! If I ever have a truly shit day I’ll go full toddler mode and take my teddy to the couch with me for the day",
      "created_utc": 1718241345.0,
      "score": 5
    },
    {
      "id": "l8cymxo",
      "body": "I’m 41 and sleep with a stuffed animal from time to time",
      "created_utc": 1718241450.0,
      "score": 4
    },
    {
      "id": "l8czhng",
      "body": "I got 7 and I'm 29. 5/7 are Whinie the pooh characters.",
      "created_utc": 1718241794.0,
      "score": 4
    },
    {
      "id": "l8df54j",
      "body": "I’m 41, and I’m snuggled up to my teddy bear right now. 🙂",
      "created_utc": 1718248168.0,
      "score": 4
    },
    {
      "id": "l8curqd",
      "body": "At least you have something to hold onto",
      "created_utc": 1718239901.0,
      "score": 3
    },
    {
      "id": "l8cvood",
      "body": "Same",
      "created_utc": 1718240260.0,
      "score": 3
    },
    {
      "id": "l8cwlh9",
      "body": "29 and I don’t always but I can on difficult nights. That said, making my bed every day involves putting the two of them where they belong among my pillows!",
      "created_utc": 1718240630.0,
      "score": 3
    },
    {
      "id": "l8czd4d",
      "body": "20 and have one, he was given to me when i was born :)",
      "created_utc": 1718241743.0,
      "score": 3
    },
    {
      "id": "l8czqg1",
      "body": "same here!! exact same age as you, but my \"cuddle buddy\" is Appa from Avatar the Last Airbender! my partner deals with it lol. he knows Appa is my cuddle buddy, not him... plus, Appa doesn't get sweaty... my partner & i do when we cuddle ahahah. 😂\n\ni cannot sleep without holding him, & i don't even care... if your teddy bear keeps your anxiety \"calmer\", keep doin' you!!!",
      "created_utc": 1718241895.0,
      "score": 3
    },
    {
      "id": "l8d0zsm",
      "body": "I do too at 30! And probably will forever. No shame in that at all!",
      "created_utc": 1718242409.0,
      "score": 3
    },
    {
      "id": "l8d1hw2",
      "body": "Weighted blankets and a lot of plushies:)",
      "created_utc": 1718242614.0,
      "score": 3
    },
    {
      "id": "l8d2h7z",
      "body": "I will always sleep with a stuffed animal, my regular Pusheen is my favorite plush to sleep with. I like a lot of other plushes too!",
      "created_utc": 1718243014.0,
      "score": 3
    },
    {
      "id": "l8d2xro",
      "body": "i have a polar bear teddy named shasta he goes all over the world with me, every road trip, plane ride, cruise etc he comes and he also sleeps with me every night! got him when i was 11 im 23 :P",
      "created_utc": 1718243200.0,
      "score": 3
    },
    {
      "id": "l8d3e40",
      "body": "I sleep with multiple plushies it makes me happier and safe. I'm also 27 so there's no shame. \nr/plushies is full of adults who carry plushies daily or have favorites and even personalities to their plushes.",
      "created_utc": 1718243384.0,
      "score": 3
    },
    {
      "id": "l8d3owa",
      "body": "I'm 32 and sleep with a squishmallow every night lol. I don't see myself stopping in the near future even though I'm a mom now 🤷‍♀️😅",
      "created_utc": 1718243507.0,
      "score": 3
    },
    {
      "id": "l8d4jq1",
      "body": "I sleep with a nemo plushie that I’ve had for 8 years now. I also keep plushies around my room for when I need to touch, hug, cuddle, or even just for random thoughts I like to share aloud. I am 23 years old. I have had a bed full of plushies since a baby up until 2 years ago when I needed to make space for my bf. Now they hang around my room looking all cute 🥰",
      "created_utc": 1718243859.0,
      "score": 3
    },
    {
      "id": "l8d55a1",
      "body": "Ever since I started sleeping with my build a bear I’ve felt better. It has the perfect huggable mess to it",
      "created_utc": 1718244097.0,
      "score": 3
    },
    {
      "id": "l8d5qc5",
      "body": "My wife is 27 and still sleeps with a Pooh Bear. Whatever floats your boat and makes you feel comfortable / safe.",
      "created_utc": 1718244336.0,
      "score": 3
    },
    {
      "id": "l8d6sjp",
      "body": "I sleep with a pillow pet ive had since i was 10. Not as a pillow but as a cuddle buddy. Im also married",
      "created_utc": 1718244765.0,
      "score": 3
    },
    {
      "id": "l8d6x0q",
      "body": "I’m 19 and sleep with my teddy bear that I’ve had since I was 2 years old. I’ll never sleep without him, he’s my best friend 😌",
      "created_utc": 1718244814.0,
      "score": 3
    },
    {
      "id": "l8d6xw6",
      "body": "43 and 38 and the stuffed dog sleeps tucked in between the pillows",
      "created_utc": 1718244824.0,
      "score": 3
    },
    {
      "id": "l8d7fg8",
      "body": "I sleep with my baby blanket every single night (and it comes with me to ANY other place I’m sleeping) and I’m almost 23",
      "created_utc": 1718245022.0,
      "score": 3
    },
    {
      "id": "l8d7swq",
      "body": "I sleep with a squishmallow and I'm over 30. I'll die in my sleep an oooooold lady snuggling my stuffie. When I would spend nights with my now ex, I'd bring my pillow-pet. Hell, hes the one who bought me the pillow-pet. Haha.",
      "created_utc": 1718245164.0,
      "score": 3
    },
    {
      "id": "l8d81bw",
      "body": "At age 25 I had a major insomnia and anxiety attack. Didn’t sleep for 5 days. I thought I was losing it. I went on a sabbatical to the coast and my wife sent me with a Care Bear of all things, because she was worried about me.\n\nI’m 49 now and to this day when my wife goes on a trip on her own she slips the same Care Bear into her spot in the bed. It’s okay to be tender and vulnerable and do what you need to to calm down.",
      "created_utc": 1718245254.0,
      "score": 3
    },
    {
      "id": "l8d81ro",
      "body": "I’m 27 and I can’t sleep if I don’t have a stuffy with me ♥️ no judgement here",
      "created_utc": 1718245259.0,
      "score": 3
    },
    {
      "id": "l8d89dt",
      "body": "I 32f sleep with plush toys (stitch, tramp, and simba) scattered around me,and for some reason the dog understands not to ever chew them 🥰",
      "created_utc": 1718245342.0,
      "score": 3
    },
    {
      "id": "l8d8mph",
      "body": "I'm 27 and I sleep with a baby blanket since I was a baby myself. My husband also sleeps in the bed with me and it's totally fine.",
      "created_utc": 1718245483.0,
      "score": 3
    },
    {
      "id": "l8d99js",
      "body": "I'm 42 and sleep with a Beast plushie. It's comforting. I sleep alone because my husband works nights. I need the plushie snuggles.",
      "created_utc": 1718245737.0,
      "score": 3
    },
    {
      "id": "l8da8oe",
      "body": "My 25 year old self & my build a bear stuffed axolotl checking in",
      "created_utc": 1718246140.0,
      "score": 3
    },
    {
      "id": "l8dahk1",
      "body": "I’m almost 27 and I have 6 small little plushie bunnies — they make my heart melt 🩷 and I wouldn’t be with my boyfriend if he didn’t support me loving them hah!",
      "created_utc": 1718246243.0,
      "score": 3
    },
    {
      "id": "l8daw25",
      "body": "40 with several Squishmallows specifically to hug when I'm falling asleep or anxious.",
      "created_utc": 1718246413.0,
      "score": 3
    },
    {
      "id": "l8db1md",
      "body": "I’m 22 and I sleep with my baby blanket and a few of my plushies! 😅",
      "created_utc": 1718246474.0,
      "score": 3
    },
    {
      "id": "l8dbrzu",
      "body": "I slept with my baby blanket until I was 32 years old. Nothing wrong if it if it brings you relief.",
      "created_utc": 1718246769.0,
      "score": 3
    },
    {
      "id": "l8dbsxl",
      "body": "I sleep with a huge Pikachu and I’m 31! Nothing wrong with it.",
      "created_utc": 1718246778.0,
      "score": 3
    },
    {
      "id": "l8dcena",
      "body": "My teddy (named teddy) has an entire personality and my partner and I speak to him every night. He works the overnight shift making sure monsters don't get us and sleeps during the day 😊 nothing wrong with having fun and feeling comforted by a teddy!",
      "created_utc": 1718247022.0,
      "score": 3
    },
    {
      "id": "l8dcizs",
      "body": "I'm 27, my partner is 24 and our bed is full of squishmallows so I wouldn't worry about it at all",
      "created_utc": 1718247072.0,
      "score": 3
    },
    {
      "id": "l8dcq6i",
      "body": "I’m a bit older than you and always have my Pusheen near me, if I’m not hugging her, she’s at the top of my pillow 🥹 \n  \nNo plans to stop anytime soon either!",
      "created_utc": 1718247157.0,
      "score": 3
    },
    {
      "id": "l8ddcx2",
      "body": "I have a blankey",
      "created_utc": 1718247426.0,
      "score": 3
    },
    {
      "id": "l8ddptu",
      "body": "I'm 21 and I cannot sleep without a body pillow. My friends and I bought game character pillows as a joke, but it's unironically the most comfortable pillowcase ever.",
      "created_utc": 1718247572.0,
      "score": 3
    },
    {
      "id": "l8dedm8",
      "body": "I literally kissed the top of my teddy bears head and wrapped him in a blanket before I went to sleep lol. Well not sleep just worrying in my bed at 4 am :))",
      "created_utc": 1718247841.0,
      "score": 3
    },
    {
      "id": "l8degc1",
      "body": "I’m 30 and I’ve been married for 8 years. I sleep with a bear every night too. If I have a panic attack my husband brings him to me without me ever asking. No shame! 🧸",
      "created_utc": 1718247872.0,
      "score": 3
    },
    {
      "id": "l8deko0",
      "body": "21 and sleep with a stuffed dog i’ve had since birth",
      "created_utc": 1718247922.0,
      "score": 3
    },
    {
      "id": "l8depyk",
      "body": "I’m 31 and snuggling with the strawberry cow I won from an arcade. No shame",
      "created_utc": 1718247986.0,
      "score": 3
    },
    {
      "id": "l8df657",
      "body": "Age is just a number. I’m 42 & have a killer whale & a shark that I sleep with. It’s like sleeping with a small pillow. I think more people need stuffed animals in their lives.",
      "created_utc": 1718248180.0,
      "score": 3
    },
    {
      "id": "l8dfba4",
      "body": "I'm 26 and my bed is full of plushies, too! Every night I pick a different one to hug to sleep.",
      "created_utc": 1718248242.0,
      "score": 3
    },
    {
      "id": "l8dfe8q",
      "body": "I’m about to turn 29 and I’ve been sleeping with a stuffed animal since I was 5. I need to hold something close to my chest to fall asleep as I get into a fetal position. It’s so apart of my life that I don’t even think much about it.",
      "created_utc": 1718248278.0,
      "score": 3
    },
    {
      "id": "l8dg6nd",
      "body": "I sleep with 4 big stuffed sharks at 20\n\n( And i plan to keep doing so for the unforeseeable future :p )",
      "created_utc": 1718248625.0,
      "score": 3
    },
    {
      "id": "l8dg70s",
      "body": "38 and still do.  We all need comfort of some kind.  🩷🧸",
      "created_utc": 1718248629.0,
      "score": 3
    },
    {
      "id": "l8dh8q3",
      "body": "I sleep with a stuffed bunny and I’ll be 34 in a month.",
      "created_utc": 1718249106.0,
      "score": 3
    },
    {
      "id": "l8dhahh",
      "body": "I’m 33, will be 34 next week. I still sleep with stuffies. They have changed over the years but for the past few it has been my weighted cheetah, giant pink squishmellow and smaller squishmellow. Sometimes the squishmellow are pillows, arm rests for reading, cuddle when sleeping, whatever. My weighted cheetah is when I’m extra anxious before bed, I just slap her on my chest and do deep breaths. Then I’m usually out. I’m also single and have my queen bed to myself besides my cats, so I like having “something” to put my arm around at night.",
      "created_utc": 1718249128.0,
      "score": 3
    },
    {
      "id": "l8dhds1",
      "body": "I sleep with a 1998 godzilla with a plastic head and arms. Got him right before my brother was born as a gift to make me not feel like the new baby was taking love away from me. Picked it out myself.",
      "created_utc": 1718249169.0,
      "score": 3
    },
    {
      "id": "l8dhk6m",
      "body": "48. It’s a stuffy opossum but hey.",
      "created_utc": 1718249250.0,
      "score": 3
    },
    {
      "id": "l8dhqaz",
      "body": "Same but stuffed dolphin lol",
      "created_utc": 1718249331.0,
      "score": 3
    },
    {
      "id": "l8dih7p",
      "body": "27 and i have about 20 squishmallows on my bed",
      "created_utc": 1718249682.0,
      "score": 3
    },
    {
      "id": "l8diob2",
      "body": "I sleep with my newborn blanket handknit by the nurses who helped deliver me at the hospital.",
      "created_utc": 1718249774.0,
      "score": 3
    },
    {
      "id": "l8djpd6",
      "body": "39 years old and have a plethora of stuffed animals/squishmallows. Not all are on the bed, but when it's lonely at night, it's nice to have something. 🤷‍♀️",
      "created_utc": 1718250257.0,
      "score": 3
    },
    {
      "id": "l8djqfl",
      "body": "I'm 23 and I often hug a stuffed dog or a pillow. It's comforting to hold something close to you while you fall asleep",
      "created_utc": 1718250271.0,
      "score": 3
    },
    {
      "id": "l8dkq2k",
      "body": "I have a squishmallow koala and Snorlax. I use a squishy pig as a pillow which is softer than my actual pillow. I no longer sleep with my stuffed cat I got in 1999 because I don't want my dog chewing on it. But I love my stuffed animals and I'm 32. Don't be upset or feel ashamed for enjoying a teddy! It makes you happy!",
      "created_utc": 1718250749.0,
      "score": 3
    },
    {
      "id": "l8dkrjs",
      "body": "My boyfriend and I are temporarily long distance. He bought me a teddy bear and I hug it all the time when I'm in bed. Actually I'm currently hugging it as I'm typing this!",
      "created_utc": 1718250769.0,
      "score": 3
    },
    {
      "id": "l8dll9e",
      "body": "I’m 34 with three children and a husband. Snoozie bear still sleeps with me every night",
      "created_utc": 1718251176.0,
      "score": 3
    },
    {
      "id": "l8dm355",
      "body": "Stuffed animals help a ton and if anyone gives someone shit for it I'll fight them. I'm 20 and im never gonna stop sleeping and playing with my little guys they make me very happy. I always depended on them as a kid, and when my step mom got rid of them while I was in school it made life rough. I started getting my own stuffed animals at 17 and got to experience what I lost as a kid. Made existing a little easier. If it makes you happy then that's what matters.",
      "created_utc": 1718251422.0,
      "score": 3
    },
    {
      "id": "l8dmgsn",
      "body": "Nothing wrong with that. They actually make anxiety pillows for all ages. I had one at age 28 and named it Squiggles.",
      "created_utc": 1718251614.0,
      "score": 3
    },
    {
      "id": "l8dnd60",
      "body": "I am 27 myself and I too sleep with a sort of squishmellow, it's a little piggy called Vincent and it's such a comfort. Life is already tricky as is, don't complicate it even more by judging yourself for something that makes you feel good :)",
      "created_utc": 1718252076.0,
      "score": 3
    },
    {
      "id": "l8do65l",
      "body": "I have had my bear bear since the day I was born and still sleep with her and hold her when I’m really anxious! She’s great so absolutely nothing wrong with that! I’m 21 ☺️",
      "created_utc": 1718252492.0,
      "score": 3
    },
    {
      "id": "l8dqbqc",
      "body": "27 guy and I have a plushie net hung up in the corner of my ceiling holding my collection",
      "created_utc": 1718253651.0,
      "score": 3
    },
    {
      "id": "l8f69in",
      "body": "Kinda cute ngl",
      "created_utc": 1718284510.0,
      "score": 3
    },
    {
      "id": "l8cy4ip",
      "body": "That’s okay. Nothing wrong with that at all.",
      "created_utc": 1718241241.0,
      "score": 2
    },
    {
      "id": "l8czx7v",
      "body": "I dont sleep. 😖",
      "created_utc": 1718241973.0,
      "score": 2
    },
    {
      "id": "l8czxw0",
      "body": "this is a green flag!",
      "created_utc": 1718241980.0,
      "score": 2
    },
    {
      "id": "l8d1kbi",
      "body": "31, do not sleep with a teddy bear but I think I will start up again :')",
      "created_utc": 1718242642.0,
      "score": 2
    },
    {
      "id": "l8d2qam",
      "body": "36, and stuffed animals for me. Special ones. Lol",
      "created_utc": 1718243117.0,
      "score": 2
    },
    {
      "id": "l8d2x3c",
      "body": "Not the strangest thing you could cuddle with XD",
      "created_utc": 1718243193.0,
      "score": 2
    },
    {
      "id": "l8d376b",
      "body": "Honestly your not alone",
      "created_utc": 1718243306.0,
      "score": 2
    },
    {
      "id": "l8d3wiq",
      "body": "I want a weighted blanket. My anxiety so physical, I enjoy when my young child lays on my chest. I need a weighted blanket haha",
      "created_utc": 1718243595.0,
      "score": 2
    },
    {
      "id": "l8d72as",
      "body": "Me too, I’m 36",
      "created_utc": 1718244873.0,
      "score": 2
    },
    {
      "id": "l8d7971",
      "body": "Big deal. I slept with a monster at 27. You’re better off.",
      "created_utc": 1718244952.0,
      "score": 2
    },
    {
      "id": "l8d7ggf",
      "body": "No worries - Still gotta sleep with mine at 38! 😎",
      "created_utc": 1718245033.0,
      "score": 2
    },
    {
      "id": "l8d9gh8",
      "body": "Nice to know I'm not the only one",
      "created_utc": 1718245817.0,
      "score": 2
    },
    {
      "id": "l8davcy",
      "body": "Look into the bearaby weighted pillows! You might enjoy them.",
      "created_utc": 1718246405.0,
      "score": 2
    },
    {
      "id": "l8dcagt",
      "body": "And you slay with that. I snuggle my blanket cuz its comfy and makes me feel safe.",
      "created_utc": 1718246975.0,
      "score": 2
    },
    {
      "id": "l8derb5",
      "body": "21. Same here, even though I share a bed with my partner.",
      "created_utc": 1718248001.0,
      "score": 2
    },
    {
      "id": "l8dgjmr",
      "body": "Nothing wrong with that I imagine them coming to life during the night fighting off your fears like doom slayer 🤣🤣🤣",
      "created_utc": 1718248791.0,
      "score": 2
    },
    {
      "id": "l8dhxlt",
      "body": "i have a blankey lmao and it was allegedly so fluffy when i first got it at 1 but all i remember is the way it is now cause ive had it so long and im 22",
      "created_utc": 1718249427.0,
      "score": 2
    },
    {
      "id": "l8die37",
      "body": "I hold a pillow in my arms. I'm 33.",
      "created_utc": 1718249641.0,
      "score": 2
    },
    {
      "id": "l8dizt0",
      "body": "That’s all good they are comforting that is they’re point❤️",
      "created_utc": 1718249921.0,
      "score": 2
    },
    {
      "id": "l8dj7e9",
      "body": "I’m going to be 59 this summer. I still hug my pillows. Being a side sleeper it works.",
      "created_utc": 1718250020.0,
      "score": 2
    },
    {
      "id": "l8dja2j",
      "body": "Nothings wrong with this",
      "created_utc": 1718250054.0,
      "score": 2
    },
    {
      "id": "l8dk1v3",
      "body": "Nothing wrong with that coming from a 19 y/o dude. Do whatever makes you deal with your anxiety better. And who gives a shit what other people think nowadays just do whatever helps best with your anxiety 🤍",
      "created_utc": 1718250423.0,
      "score": 2
    },
    {
      "id": "l8dk7r4",
      "body": "Used to be my ex wife, now I just sleep with a body pillow. I prefer body pillow so much more, same squishy, no anxiety",
      "created_utc": 1718250502.0,
      "score": 2
    },
    {
      "id": "l8dk9jk",
      "body": "I still get scared to sleep in the dark",
      "created_utc": 1718250526.0,
      "score": 2
    },
    {
      "id": "l8dkv8c",
      "body": "I sleep with a night light at 24. I’m uncomfortable in complete darkness. And I like being able to see where I’m going when I have to use the bathroom",
      "created_utc": 1718250819.0,
      "score": 2
    },
    {
      "id": "l8dl74f",
      "body": "I sleep with one and I’m 34. It’s great for side sleeping!",
      "created_utc": 1718250982.0,
      "score": 2
    },
    {
      "id": "l8dlc7d",
      "body": "I'm almost 31 and same! And I'm married!",
      "created_utc": 1718251051.0,
      "score": 2
    },
    {
      "id": "l8dlrim",
      "body": "I have electric candles, and two (very bright) nightlights. Sometimes if I wake up in the middle of the night I turn my Philips Hue lights on to their dimmest setting and sleep that way. I’m 43.",
      "created_utc": 1718251262.0,
      "score": 2
    },
    {
      "id": "l8dlrwj",
      "body": "My wife gave me a stuffed lion at 37, I sleep better now.",
      "created_utc": 1718251267.0,
      "score": 2
    },
    {
      "id": "l8dmd0w",
      "body": "This is so cute 🥺🥺 keep on sleeping with the teddy 👍",
      "created_utc": 1718251561.0,
      "score": 2
    },
    {
      "id": "l8do3jp",
      "body": "I'm almost 38 :)",
      "created_utc": 1718252454.0,
      "score": 2
    },
    {
      "id": "l8do4ct",
      "body": "Nothing wrong at all about this.",
      "created_utc": 1718252466.0,
      "score": 2
    },
    {
      "id": "l8dov4x",
      "body": "amen",
      "created_utc": 1718252856.0,
      "score": 2
    },
    {
      "id": "l8dp2x0",
      "body": "Never grow up.",
      "created_utc": 1718252971.0,
      "score": 2
    },
    {
      "id": "l8dq3k5",
      "body": "I'm 44 and I suck my thumb at bed time.",
      "created_utc": 1718253526.0,
      "score": 2
    },
    {
      "id": "l8dqk6d",
      "body": "I got a weighted therapy blanked. feels like beeing lovingly hugged to sleep.\nwhatever helps man.",
      "created_utc": 1718253779.0,
      "score": 2
    },
    {
      "id": "l8dqm91",
      "body": "I’m 23 and my bed is filled with stuffed animals. nothing wrong with having stuff that makes you happy and keeps you safe!!!",
      "created_utc": 1718253811.0,
      "score": 2
    },
    {
      "id": "l8dr61r",
      "body": "Im 26 and i sleep with 2 stuffed toys: Cindy and Louie 🥰🥰",
      "created_utc": 1718254109.0,
      "score": 2
    },
    {
      "id": "l8drrys",
      "body": "Nothing wrong with that. \n\nI myself keep avocado shaped stuffed pillow. Who cares what I take to bed with me? And even if they did, it’s their problem! \nYou do you! :)",
      "created_utc": 1718254448.0,
      "score": 2
    },
    {
      "id": "l8drsiz",
      "body": "Me too, my sleep companion is a polar bear plushie and I’m 43. Do what is the best for you.",
      "created_utc": 1718254457.0,
      "score": 2
    },
    {
      "id": "l8dsbu1",
      "body": "I still sleep with the same frog stuffed animal my grandma got me when I was little and I’m 22",
      "created_utc": 1718254757.0,
      "score": 2
    },
    {
      "id": "l8dsj2p",
      "body": "I have a ton of bought-as-an-adult stuffies at 36. My bed partner is a Squishmallow.",
      "created_utc": 1718254871.0,
      "score": 2
    },
    {
      "id": "l8dskmd",
      "body": "I cuddle my pillows the same way i cuddle my teddy bear. My teddy bear is on the couch, for cuddles during rough days and couch naps. And I’m 26. Its okay.",
      "created_utc": 1718254894.0,
      "score": 2
    },
    {
      "id": "l8dwv0v",
      "body": "Nothing to be ashamed of. I don't usually sleep with a stuffed animal, but recently my cat was in the hospital overmight, and I happened to realize that my childhood stuffed toy was right there. Helped me through the night.",
      "created_utc": 1718257445.0,
      "score": 2
    },
    {
      "id": "l8e5v35",
      "body": "Hell I'm 25 and married. Me and the wife have a ton of build a bears and we cuddle our favorites every night. It really helps, age doesn't matter! \n\nEdit: squishMallows are usually the pillow as well lol!",
      "created_utc": 1718263372.0,
      "score": 2
    },
    {
      "id": "l8e6w1b",
      "body": "My gf has 3 covers to hug",
      "created_utc": 1718264106.0,
      "score": 2
    },
    {
      "id": "l8enfdn",
      "body": "I just have a body pillow.",
      "created_utc": 1718275435.0,
      "score": 2
    },
    {
      "id": "l8enh1q",
      "body": "I’m 28 and I sleep with a medium sized bear, he’s pretty big. Not gonna lie I be choking that motherfucker OUT at night. I also keep my teddy bear my grandpa gave me before he passed right next to me. He’s a normal size teddy bear so when I travel, he comes too. I legit can’t sleep without at least one.",
      "created_utc": 1718275463.0,
      "score": 2
    },
    {
      "id": "l8enzyl",
      "body": "34 here and my wife keeps buying me stuffies. I currently sleep with my sloth, Sylvie, and a carrot named…Carrot.",
      "created_utc": 1718275777.0,
      "score": 2
    },
    {
      "id": "l8gb8yh",
      "body": "I sleep with a teddy bear named Teddy and I am 32",
      "created_utc": 1718298731.0,
      "score": 2
    },
    {
      "id": "l8gbnlh",
      "body": "I sleep with a stuffie at 24, nothing wrong with sleeping with a stuffed animal",
      "created_utc": 1718298866.0,
      "score": 2
    },
    {
      "id": "l8gffrx",
      "body": "My wife has this stuffed lizard she has owned for like 15 years and she sleeps with it every single night. She is also a professional woman with a masters degree who works for a corporation in the main office.  Doesn’t mean a thing really, it just comforts her to hold on to it.",
      "created_utc": 1718300114.0,
      "score": 2
    },
    {
      "id": "l8gghso",
      "body": "If you aren’t hurting anyone you can do whatever you want. I’m 28 and have a whole pile of squishmallows in my room. \n\nDo what makes you happy and comfortable",
      "created_utc": 1718300462.0,
      "score": 2
    },
    {
      "id": "l8ggmwm",
      "body": "I want to get a set of plushies now 💕",
      "created_utc": 1718300509.0,
      "score": 2
    },
    {
      "id": "l8ggzfx",
      "body": "I sleep with a boba fett bear from build a bear workshop.",
      "created_utc": 1718300623.0,
      "score": 2
    },
    {
      "id": "l8gkosl",
      "body": "I mean I sleep with either a plushy Gengar or crocheted Nessie depending on my mood and I'm 37. No judgement here.",
      "created_utc": 1718301845.0,
      "score": 2
    },
    {
      "id": "l8gljl6",
      "body": "i see your teddy bear, and i raise you one wolf, one dragon, seven rabbits, one panda, one fox, three horses, and a triceratops 🥹",
      "created_utc": 1718302130.0,
      "score": 2
    },
    {
      "id": "l8gngv1",
      "body": "i sleep with a jelly cat at 25",
      "created_utc": 1718302781.0,
      "score": 2
    },
    {
      "id": "l8gqemy",
      "body": "I have a whole pile of Hello Kitty, My Melody, Pusheen etc. that I sleep in every night, plushies FTW!",
      "created_utc": 1718303840.0,
      "score": 2
    },
    {
      "id": "l8i0wiq",
      "body": "I’m 42 and still sleep with the stuffed dog I got at age 8. I’m married with 2 kids.",
      "created_utc": 1718319956.0,
      "score": 2
    },
    {
      "id": "l8dlqni",
      "body": "look into MALS, dysautonomia, MTHFR mutations, costochondritis\n\n  \nand begin practicing deep diapgramatic breathing",
      "created_utc": 1718251250.0,
      "score": 1
    },
    {
      "id": "l8dtpmr",
      "body": "I have three stuffed sloths that me and my boyfriend are very attached to and cuddle every single night. We take them with us when we have to travel. My first sloth is Steven, then Timmy (Tim Tim) and Kiwi. Sometimes we joke about what people would say if they saw how we interact with them 🤣 I’m 26",
      "created_utc": 1718255546.0,
      "score": 1
    },
    {
      "id": "l8duf5c",
      "body": "I snuggle with a regular pillow. It feels comforting. Nothing wrong with having something that makes you feel safe. That said, I’m sorry to hear your anxiety is so bad.",
      "created_utc": 1718255963.0,
      "score": 1
    },
    {
      "id": "l8dufmb",
      "body": "My teddy bears name is Lavi! He's a real bro. What's your teddy 's name?",
      "created_utc": 1718255971.0,
      "score": 1
    },
    {
      "id": "l8dufsv",
      "body": "I am almost 22 and still sleep with my childhood zebra beanie baby knockoff thing. My husband is very supportive of it, doesn't find it weird and will make sure I have it whenever I want/ need it, hides it from our dog, etc! I am so glad to have someone supportive and not bashing me for being an adult with a \"toy\" ♥️",
      "created_utc": 1718255974.0,
      "score": 1
    },
    {
      "id": "l8dufw1",
      "body": "21 and have slept with the same teddy bear since preschool🥰 I can’t sleep without it",
      "created_utc": 1718255975.0,
      "score": 1
    },
    {
      "id": "l8dusca",
      "body": "That's totally fine! 😊\n\nIf I didn't have allergies, I'd have a giant silky-furred stuffed (or, better yet, real) animal beside me in bed. \n\n(Also, I'm 49 and still get scared of the dark - and sleep with the light on - at times. Also, if someone knocks on my bedroom door while I'm sleeping, I wake up screaming (and I don't live alone.) 😅🙈)",
      "created_utc": 1718256182.0,
      "score": 1
    },
    {
      "id": "l8duzbt",
      "body": "I am 40 married with two kids and I sleep with olive the other reindeer.  I don’t care what people think, brings me comfort❤️",
      "created_utc": 1718256299.0,
      "score": 1
    },
    {
      "id": "l8dv1xm",
      "body": "I’m 49 and sleep with the teddy bear I got at 3 months old. I also have Warmies, stuffed animals I got from every trip I went on, and I just got a bunny that mimics breathing and breathing noises built especially for anxiety. I think having something we can hold onto is a must.\n\n\nAnd my husband of 14 years doesn’t care. He is the one that usually buys them for me and he names them!",
      "created_utc": 1718256342.0,
      "score": 1
    },
    {
      "id": "l8dwh1a",
      "body": "I do too! I have a few plushies I sleep with",
      "created_utc": 1718257207.0,
      "score": 1
    },
    {
      "id": "l8dxwca",
      "body": "Currently cuddling mine and I’m a 31 year old woman lmao. I’ve had him since I was a baby in the hospital (I was born w/ a lot of issues) and his name is Brownie Bear. My fiancé has one too and she’s 27. No shame in it at all.",
      "created_utc": 1718258088.0,
      "score": 1
    },
    {
      "id": "l8dxxnm",
      "body": "I’m 32 and I sleep with my bunny stuffed animal and Scooby Doo stuffed animal. My sister is 39 and sleeps with her teddy bear.",
      "created_utc": 1718258111.0,
      "score": 1
    },
    {
      "id": "l8dyacj",
      "body": "Nothing wrong with that. I’m the same age as you, and not only do I sleep with a teddy bear, I cuddle and play with it too. It’s one of the dearest things to me.",
      "created_utc": 1718258332.0,
      "score": 1
    },
    {
      "id": "l8dyjdi",
      "body": "I sleep with my pink stitch stuffed animal every night and I’m 23. I used to suck my thumb till I was 13. I need something to self soothe before I go to sleep or I clench my jaw at night, or I can’t sleep. I don’t see anything wrong with it. It’s brings comfort that I never had as a child. I feel you. 🩷",
      "created_utc": 1718258489.0,
      "score": 1
    },
    {
      "id": "l8dyjwn",
      "body": "I used to always sleep with stuffed animals as a kid  they were such a comfort to me especially because I was afraid of the dark , going to bed would sometimes give me anxiety because of the nightmares I would have , eventually I stopped somewhere in my teenage years because my family criticized me a lot for “not acting like most boys your age” so I ditched them at some point because I felt like I had to because it’s not the norm of course I had the relapse every now and then on a rough night. About a year ago after living on my own for a little while and battling aggressive insomnia I realized living alone Im pretty much free to do whatever makes me comfortable i eventually found a weighted stuffed zebra (that I may or may not have overpaid for) to say its had the biggest impact on my sleep in years would be an understatement (no it didn’t fix all my sleep issues but im a lot more comfortable now) anyways life is short sleep with your teddy bear we all have our copes and I say as long as their harmless go for it I think the person who sleeps with a teddy bear is way cooler than one who judges someone for sleeping with a teddy bear, food for thought.",
      "created_utc": 1718258498.0,
      "score": 1
    },
    {
      "id": "l8dyyu1",
      "body": "I am used to sleep with my husband. But when he is not here, I would highly appreciate the company of my childhood stuffed animal I loved.",
      "created_utc": 1718258758.0,
      "score": 1
    },
    {
      "id": "l8dzl2x",
      "body": "My wife is 28 and has several teddy bears. No judgement here.",
      "created_utc": 1718259151.0,
      "score": 1
    },
    {
      "id": "l8e01y0",
      "body": "I'm 34 and sleep with a squishmallow! I like to hang on to something, but my fiance has too much body heat and I get hot, so this is the perfect solution. My mom does as well and she's 53.",
      "created_utc": 1718259456.0,
      "score": 1
    },
    {
      "id": "l8e0bim",
      "body": "I cuddle with anyone who needs one 🙂🙌 there is nothing more effective ♥️",
      "created_utc": 1718259628.0,
      "score": 1
    },
    {
      "id": "l8e0mrj",
      "body": "Sounds like a really helpful lil' guy to have around! Glad the teddy is helping you out 😊",
      "created_utc": 1718259833.0,
      "score": 1
    },
    {
      "id": "l8e0vvp",
      "body": "Same! My husbands bought it for me 2 years again (I’m 26) when my anxiety and depression was so bad - he was working nights so I couldn’t cuddle up to him so he got me teddy instead. Really good idea. \n\nI’m sorry you have those issues - I know how you’re feeling. I don’t wish this on anyone. Reach out to me if you want to. \nObviously I don’t want to sound cliche but perhaps going to visit a psych or a therapist to see what the root problem is and why it’s causing your symptoms. \n\nThe holistic things I did was light a lavender / calming candle and do do breathing exercises. I had someone do reiki on me a few times and that made me feel light as if I reset all my emotions. I also went for deep tissue massages every 2-3 weeks which released stress.\nThings like chamomile, raspberry and green tea calmed me down so much before bed. \nAnd most of all, my favourite comfort books like The Walking Dead comics took me away from reality. \n\nI know those can be expensive so I pray you have the funds for this….. annoyingly you do have to have some money to get your anxiety sorted, whichever way you try. \n\nI hope this helped xx",
      "created_utc": 1718259997.0,
      "score": 1
    },
    {
      "id": "l8e16lt",
      "body": "I sleep with one at 33",
      "created_utc": 1718260192.0,
      "score": 1
    },
    {
      "id": "l8e1tc7",
      "body": "I just bought my mum a beanie baby to comfort her now that she’s out of hospital, she’s 65. You are never too old for teddy. She has a teddy on her bed at home",
      "created_utc": 1718260612.0,
      "score": 1
    },
    {
      "id": "l8e2k8i",
      "body": "Same, but at 37. It's all good.",
      "created_utc": 1718261117.0,
      "score": 1
    },
    {
      "id": "l8e394a",
      "body": "Most normal anxiety behaviour :D. I never had one as a small child so I never got used to it :\\",
      "created_utc": 1718261584.0,
      "score": 1
    },
    {
      "id": "l8e3bln",
      "body": "I’m a 33 year old male and I still have stuffed animals.\nI also have a body pillow.\n\nHumans are communal animals, we don’t like to be alone. There’s not a thing wrong with having something to make you feel less alone when the world is dark and quiet.",
      "created_utc": 1718261630.0,
      "score": 1
    },
    {
      "id": "l8e3h4b",
      "body": "I have a 7ft teddy bear and I’m 27 too",
      "created_utc": 1718261731.0,
      "score": 1
    },
    {
      "id": "l8e3pqj",
      "body": "I’m 52m. Married. Got a body pillow and a stuffed Lion. My wife usually ends up cuddling the Lion.",
      "created_utc": 1718261888.0,
      "score": 1
    },
    {
      "id": "l8e3qw5",
      "body": "I’m 43.  I sleep with a teddy bear, and a stuffed husky.",
      "created_utc": 1718261909.0,
      "score": 1
    },
    {
      "id": "l8e46ce",
      "body": "My stuffed golden retriever Joy always sleeps in my arms. When i get anxious, i press it against my chest and it soothes it. Otherwise, its just for comfort. I cant handle my arms being empty. Im also 27.",
      "created_utc": 1718262198.0,
      "score": 1
    },
    {
      "id": "l8e4a1y",
      "body": "My fiancé sleeps with a stuffy to the point of the stuffy’s death almost, lol, and I find it so sweet. I love the stuffies on our bed. I have a large teddy bear and cow stuffy he’s gotten me as well. \n\nCuddle your teddy bear. I’m 32 and he’s 27. We’ll cuddle our stuffies for life!",
      "created_utc": 1718262269.0,
      "score": 1
    },
    {
      "id": "l8e51aq",
      "body": "28 and in a relationship and I still do as well.  I probably always will!  It’s also just more comfortable than not sleeping with a teddy bear as somehow it supports my body. Boyfriend doesn’t care, thinks it’s cute.",
      "created_utc": 1718262789.0,
      "score": 1
    },
    {
      "id": "l8e53n7",
      "body": "I feel you. For me I sleep with my baby blanket as something to smell oddly enough - even after cleaning it always smells the same eventually and I’ve been used to that scent ever since I was a babe. It naturally relaxes me.",
      "created_utc": 1718262835.0,
      "score": 1
    },
    {
      "id": "l8e59tr",
      "body": "Hey! I am 27 years old too. I have 16 small plushies on my bed, there is nothing wrong with that! I suffer from anxiety and OCD, sometimes life is so hard and I don't even have no one to hug. So they are helping me and I hope they are helping you too :)",
      "created_utc": 1718262957.0,
      "score": 1
    },
    {
      "id": "l8e5c2q",
      "body": "Nothing wrong with that- I'm 37 this year and still also sleep with a teddy bear on occasion.",
      "created_utc": 1718263000.0,
      "score": 1
    },
    {
      "id": "l8e5gf9",
      "body": "I have 2 stuffed rabbits and a llama I cuddle with. I originally had one rabbit that I gave to my long distance bf when he visited and I had to hunt down the exact same rabbit because I couldn’t sleep without it🤷‍♀️",
      "created_utc": 1718263087.0,
      "score": 1
    },
    {
      "id": "l8e5rku",
      "body": "I just bought a weighted stuffed animal to use when my husband is away for work (every few months) or when he stays up later than I do. I was embarrassed at first but he told me not to be. Anxiety can be rough so do whatever makes you more comfortable :)",
      "created_utc": 1718263304.0,
      "score": 1
    },
    {
      "id": "l8e65yd",
      "body": " Nothing wrong with that I’m 26 and I have a stuffed dog toy that resembles a dog of mines I had that run away named lucky I like it because it reminds me of him",
      "created_utc": 1718263585.0,
      "score": 1
    },
    {
      "id": "l8e6npv",
      "body": "Elmo at 32",
      "created_utc": 1718263942.0,
      "score": 1
    },
    {
      "id": "l8e7ol9",
      "body": "I have an emotional support plushie t-Rex since my anxiety was re-triggered Dec 2022 his name is Dr. Dinomasaur. And I’m in my late 30s.",
      "created_utc": 1718264684.0,
      "score": 1
    },
    {
      "id": "l8e7s5b",
      "body": "When I moved into my new apartment I definitely slept with my teddy bear from when I was a baby for the first week! 🧸",
      "created_utc": 1718264753.0,
      "score": 1
    },
    {
      "id": "l8e89om",
      "body": "I wish more people did tbh. Adults are allowed to be scared.",
      "created_utc": 1718265108.0,
      "score": 1
    },
    {
      "id": "l8e8opc",
      "body": "That's nothing, I sleep with a wife at 40. /s\n \nJokes aside, it's absolutely fine. People do far more childish stuff for absolutely brainless reasons at even wiser ages. You're not hurting anyone including yourself, and that's all that matters.",
      "created_utc": 1718265407.0,
      "score": 1
    },
    {
      "id": "l8e8rjc",
      "body": "This is a great example of something that can help relieve anxiety and has no cost to your body... Hopefully it may inspire others to seek similar mitigations",
      "created_utc": 1718265464.0,
      "score": 1
    },
    {
      "id": "l8e91rj",
      "body": "I sleep with one at 38 so don’t worry about it 😂",
      "created_utc": 1718265670.0,
      "score": 1
    },
    {
      "id": "l8e9wqo",
      "body": "35 here, I have a collection of Sanrio plushies and when I feel anxious, they help me comfort myself. I baby talk to them and cuddle them. When I nap, I hug them.\n\nEdit: I keep my nightlight and TV on.",
      "created_utc": 1718266295.0,
      "score": 1
    },
    {
      "id": "l8eabh9",
      "body": "And that's totally OK. I sleep with my cats, dog and cuddle my pillows too.",
      "created_utc": 1718266591.0,
      "score": 1
    },
    {
      "id": "l8eafg3",
      "body": "Nothing wrong with that. I have an always have a teddy beside me to cuddle whenever i go to sleep. No shame in that!",
      "created_utc": 1718266670.0,
      "score": 1
    },
    {
      "id": "l8eb1cw",
      "body": "It’s normal! I’ve got quite a few of mine congregated around, quite a lot of people are open about having teddies",
      "created_utc": 1718267119.0,
      "score": 1
    },
    {
      "id": "l8ebl44",
      "body": "I'm 46 and sleep with a weighted stuffed bear ❤️ 🧸",
      "created_utc": 1718267527.0,
      "score": 1
    },
    {
      "id": "l8eccqu",
      "body": "Im 20 and still sleep with stuffed animals. I can’t imagine ever stopping. I’ll be 80 and still cuddling with them all night long.",
      "created_utc": 1718268094.0,
      "score": 1
    },
    {
      "id": "l8ecvn1",
      "body": "26 I sleep with 2 \nTravel a lot for work and bring them with me \nNo shame\nThe times I’ve not been able to bring them on short trips abroad for work I’ve hugged pillows",
      "created_utc": 1718268477.0,
      "score": 1
    },
    {
      "id": "l8ed1pj",
      "body": "i cuddle my pillow like a mama bear cuddles her babies",
      "created_utc": 1718268600.0,
      "score": 1
    },
    {
      "id": "l8ed459",
      "body": "Same here at 29!",
      "created_utc": 1718268648.0,
      "score": 1
    },
    {
      "id": "l8ed88k",
      "body": "I sleep with one as well and I am 20",
      "created_utc": 1718268733.0,
      "score": 1
    },
    {
      "id": "l8ediz4",
      "body": "I’m almost 40 and have discovered sleeping with a stuffy (squismallow) helps a lot. Whatever works!",
      "created_utc": 1718268952.0,
      "score": 1
    },
    {
      "id": "l8edvaq",
      "body": "I’m in my 30’s, I have a bunch of plushes I sleep with every night.",
      "created_utc": 1718269202.0,
      "score": 1
    },
    {
      "id": "l8eevj3",
      "body": "i sleep with multiple plushies!!! &will for the rest of my life probs:) absolutely nothing wrong with having something that gives u comfort, esp when sleeping. the people that judge u for it are shallow-minded anyways",
      "created_utc": 1718269945.0,
      "score": 1
    },
    {
      "id": "l8eg9mp",
      "body": "I hug my hubbys pillow and I have a stuffed carrot like Milk from Milk and Mocha Bears. My room was filled with them before I got married almost 2 years ago 😅😅😅",
      "created_utc": 1718270908.0,
      "score": 1
    },
    {
      "id": "l8egf0l",
      "body": "I turn 35 in 3 months.",
      "created_utc": 1718270976.0,
      "score": 1
    },
    {
      "id": "l8egffw",
      "body": "I turn 35 in 3 months.",
      "created_utc": 1718270976.0,
      "score": 1
    },
    {
      "id": "l8eh26i",
      "body": "That’s fine! I sleep with a body pillow for a similar feel.",
      "created_utc": 1718271256.0,
      "score": 1
    },
    {
      "id": "l8ehhlc",
      "body": "I always sleep with 2 squishmallows. I am almost 27, too! \n\nI’ve read before that about 40% of people cuddle something when they sleep & that it promotes a sense of security.\n\nNothing weird about it.",
      "created_utc": 1718271542.0,
      "score": 1
    },
    {
      "id": "l8ej7rj",
      "body": "I also sleep with a stuffed animal mid to late 20’s. And when my gf is here I still be holdin onto my stuffed animal, shes completely fine with it, it helps support my head properly or else I wake up with back issues.",
      "created_utc": 1718272751.0,
      "score": 1
    },
    {
      "id": "l8ejn8r",
      "body": "i have like 9 squishies and teddies in my bed and i’m 22. It’s what i like to do, it’s not weird. what ever makes you happy and comfortable when you sleep :))",
      "created_utc": 1718273037.0,
      "score": 1
    },
    {
      "id": "l8elcvk",
      "body": "Makes me wanna get one.",
      "created_utc": 1718274146.0,
      "score": 1
    },
    {
      "id": "l8elodr",
      "body": "I sleep with a stuffed dog at late 30s",
      "created_utc": 1718274352.0,
      "score": 1
    },
    {
      "id": "l8elpid",
      "body": "Approaching 30 and I sleep with a stuffed wolf that I made about 10 years ago from like... a Build A Bear 😂",
      "created_utc": 1718274372.0,
      "score": 1
    },
    {
      "id": "l8elt9z",
      "body": "same bro (23)",
      "created_utc": 1718274439.0,
      "score": 1
    },
    {
      "id": "l8emigp",
      "body": "I sleep with 12 teddies and am 46",
      "created_utc": 1718274880.0,
      "score": 1
    },
    {
      "id": "l8enqai",
      "body": "Cool, my house is full of plush pink seals and no one who lives there is under 30.",
      "created_utc": 1718275617.0,
      "score": 1
    },
    {
      "id": "l8enzzz",
      "body": "I sleep with a full size Pooh bear. He is the perfect size and shape to cradle my head and arm to prevent migraines from poor sleep posture. He is just like the one my mom got me as a child. She passed in 2022. I found him, literally found him, under very odd circumstances when I was struggling with my grief. I have slept with him every night since. I consider him a gift from my mom. I'm 46 years old and a war vet.",
      "created_utc": 1718275777.0,
      "score": 1
    },
    {
      "id": "l8eozjl",
      "body": "In my worst moments I sleep with my plushie bunny that I've had since I was 5-6.\n\nI'm 30.",
      "created_utc": 1718276352.0,
      "score": 1
    },
    {
      "id": "l8eq4nf",
      "body": "I mean, it’s simply comfortable to sleep while holding a pillow. I always sleep with a pillow between my legs and up to my stomach just because my legs will hurt otherwise. The good thing about a teddy bear is the shape of it makes it good for the upper or lower body to hold on to - nothing wrong with that. If something, anything makes you feel more comfortable, theres nothing wrong with that - as long as you don’t do that thing obsessively (ie. having a room stuffed with teddy bears).",
      "created_utc": 1718276991.0,
      "score": 1
    },
    {
      "id": "l8eqfk5",
      "body": "33 M and I hug my pillow, most comfortable way to sleep 😎",
      "created_utc": 1718277157.0,
      "score": 1
    },
    {
      "id": "l8ercl3",
      "body": "I don't have a teddy bear but it is a plushie!! And I'm 36. It's okay 💛",
      "created_utc": 1718277650.0,
      "score": 1
    },
    {
      "id": "l8ertao",
      "body": "33 with my nearly 31 year old bear. \n\nI didn't use him for years... but started again when I started to have terrible insomnia. He's been helping",
      "created_utc": 1718277895.0,
      "score": 1
    },
    {
      "id": "l8es9qb",
      "body": "I sleep with 3 teddies at 15...so there is nothing wrong with it!",
      "created_utc": 1718278131.0,
      "score": 1
    },
    {
      "id": "l8escth",
      "body": "I sleep with seven anime plushies lol Im 30, sometimes I even 'talk' to them when I feel really alone and I have no one to tell my shits to. ",
      "created_utc": 1718278176.0,
      "score": 1
    },
    {
      "id": "l8esffq",
      "body": "There's no age limit to plushies -asides from some not being suitable for babies due to small parts being a potential choking hazard- so there's nothing wrong with wanting to sleep with one. Heck, I'm 47 and I sleep with a teddy!",
      "created_utc": 1718278214.0,
      "score": 1
    },
    {
      "id": "l8etcix",
      "body": "Loll i have many friends who do this and get intooooo it too!! And sometimes i surround myself with many many stuffed animals its comfortable and i feel very cute thh u should too.",
      "created_utc": 1718278685.0,
      "score": 1
    },
    {
      "id": "l8eu4hb",
      "body": "I am 37 and I still suck my thumb when I sleep. I even sometimes do it during the day when I need physical comforting.",
      "created_utc": 1718279070.0,
      "score": 1
    },
    {
      "id": "l8eu9lh",
      "body": "I’m 51 gripping tiny stuffed bear paw most nights. Can’t go without it",
      "created_utc": 1718279139.0,
      "score": 1
    },
    {
      "id": "l8evdy2",
      "body": "I'm 40 and have a whole menagerie of soft toy animals to comfort me :)",
      "created_utc": 1718279686.0,
      "score": 1
    },
    {
      "id": "l8exgvq",
      "body": "Same",
      "created_utc": 1718280689.0,
      "score": 1
    },
    {
      "id": "l8exnza",
      "body": "28 & have my baby blanket still lol",
      "created_utc": 1718280780.0,
      "score": 1
    },
    {
      "id": "l8eymvv",
      "body": "I sleep with one at 42. And probably also at 52 and 62... Totally fine!!\nOh, and mine is a buffalo!",
      "created_utc": 1718281231.0,
      "score": 1
    },
    {
      "id": "l8eyq8p",
      "body": "I sleep with my stuffed dog I've had for over 20 years (also 27)",
      "created_utc": 1718281273.0,
      "score": 1
    },
    {
      "id": "l8eyvbo",
      "body": "I do that at 31!",
      "created_utc": 1718281338.0,
      "score": 1
    },
    {
      "id": "l8ezsm9",
      "body": "I’m 42 and sleep with a squishmallow unicorn. I just can’t fall asleep if I don’t have something to hug. Never be ashamed of the little harmless things that can help you. 🩷\n\nETA- I gotta shoutout my other snuggle pal, Bearpool. He’s build-a-bear Deadpool. 😀",
      "created_utc": 1718281757.0,
      "score": 1
    },
    {
      "id": "l8f0vmt",
      "body": "Mood",
      "created_utc": 1718282246.0,
      "score": 1
    },
    {
      "id": "l8f1gnp",
      "body": "That’s okay! I’m nearly 40 and still sleep with my precious moments stuffed duck that was in my crib as a child. Whatever you need to do. Take a deep breath, do some “box breathing” (in for 4, hold for 4, out for 4, hold for 4 repeat) adult coloring books, ice packs or heat packs (whichever makes you comfortable) and put on a funny tv show or some good music. You’ve got this, OP! 🤍",
      "created_utc": 1718282502.0,
      "score": 1
    },
    {
      "id": "l8f25qw",
      "body": "Same! I still sleep with my childhood beanie baby at 26. Take her whenever I’m staying the night some place. My mum recently got me a companion for her from the same set.",
      "created_utc": 1718282802.0,
      "score": 1
    },
    {
      "id": "l8f2mp1",
      "body": "totally normal to feel the need to hug something while sleeping! i cant fall asleep alone, unless i hug my partner, dog or a plush toy lol",
      "created_utc": 1718283002.0,
      "score": 1
    },
    {
      "id": "l8f305e",
      "body": "That’s fine! I’m almost 40 and I’ve got one. It’s comfy with how I sleep. You’re good",
      "created_utc": 1718283160.0,
      "score": 1
    },
    {
      "id": "l8f3nut",
      "body": "I sleep with a teddy bear at age 47 and probably will until I die. It’s just way more comfortable and I already have insomnia so I’ll take what I can get.",
      "created_utc": 1718283438.0,
      "score": 1
    },
    {
      "id": "l8f48xd",
      "body": "I sleep with two Squishmallows, my cat, and my childhood teddy bear - I'm 35, I'm an adult, who cares? This is how we take care of our needs",
      "created_utc": 1718283683.0,
      "score": 1
    },
    {
      "id": "l8f4hgy",
      "body": "36 and I sleep with a bear that I was given the day I was brought home from the hospital.",
      "created_utc": 1718283784.0,
      "score": 1
    },
    {
      "id": "l8f4qbl",
      "body": "I’m 30 and I sleep with a dog toy that coincidentally is a bear. The toy was my dog’s favorite. I miss him.",
      "created_utc": 1718283887.0,
      "score": 1
    },
    {
      "id": "l8f5iyy",
      "body": "Me too :)",
      "created_utc": 1718284213.0,
      "score": 1
    },
    {
      "id": "l8f5wvn",
      "body": "25 and sleep with my build a bear frog :)",
      "created_utc": 1718284369.0,
      "score": 1
    },
    {
      "id": "l8f7dig",
      "body": "It’s okay I’m 27 and sleep with a squishmallow if my fiancé isn’t with me",
      "created_utc": 1718284958.0,
      "score": 1
    },
    {
      "id": "l8f7sac",
      "body": "I'm 37 and do this.",
      "created_utc": 1718285120.0,
      "score": 1
    },
    {
      "id": "l8f7zcg",
      "body": "Whatever it takes. Sleep is too important, so whatever it takes. I have to have 'my' pillow. Seriously, that thing is like 20 years old and my wife says the next time she washes it, it will just all apart this time. I cannot sleep without it, not sure how I can replace it. When we travel, I take it with us. I'd go into a total panic if I ever forgot it.",
      "created_utc": 1718285197.0,
      "score": 1
    },
    {
      "id": "l8f8brz",
      "body": "Ok what’s wrong with that? If you are embarrassed about it just don’t tell anyone",
      "created_utc": 1718285332.0,
      "score": 1
    },
    {
      "id": "l8f8dgm",
      "body": "I sleep with 3 Squishmallows at 33. If I travel I bring them with me",
      "created_utc": 1718285351.0,
      "score": 1
    },
    {
      "id": "l8f8hqs",
      "body": "I’m not pregnant, will probably never be pregnant in the future; but I sleep with one of those u-shaped pregnancy body pillows.  Sleep whatever way works for you.  Anyone that gets intimate enough to see me sleep can GTFO if they don’t like it.",
      "created_utc": 1718285398.0,
      "score": 1
    },
    {
      "id": "l8f9k1k",
      "body": "I’m a 50 year old male and sleep with a teddy bear. My Mom bought it for me when I was born. There are no rules to when you can or can’t sleep with a teddy bear. Do what you like!",
      "created_utc": 1718285819.0,
      "score": 1
    },
    {
      "id": "l8fbdhs",
      "body": "Me too at 23! They've never left my bed. And my still mom does so too, at 50 years old. It's just very comfortable",
      "created_utc": 1718286521.0,
      "score": 1
    },
    {
      "id": "l8fc9qx",
      "body": "My teddy bear has traveled with me around the world and faced the good as well as the bad.",
      "created_utc": 1718286854.0,
      "score": 1
    },
    {
      "id": "l8fe5nk",
      "body": "Half my bed is filled with plushies and pillows that I cuddle with to fall asleep. I’m in my mid thirties.\nI would suggest also getting a weighted blanket! They help me a lot with night time anxiety!",
      "created_utc": 1718287550.0,
      "score": 1
    },
    {
      "id": "l8fe6fq",
      "body": "I’m 21 and still sleep with my teddy you’re not alone. My friends dog sleeps with his teddy and he’s 63 in dog years 🩷",
      "created_utc": 1718287558.0,
      "score": 1
    },
    {
      "id": "l8feteq",
      "body": "I'm 41 and still have a bed covered with stuffed animals. I can't sleep if I don't have one in the bed.",
      "created_utc": 1718287789.0,
      "score": 1
    },
    {
      "id": "l8ffbip",
      "body": "That's totally fine, my friend.\n\nI can recommend the book \"The power of now\" - it has removed most anxieties from my life",
      "created_utc": 1718287972.0,
      "score": 1
    },
    {
      "id": "l8ffsa1",
      "body": "I have several stuffed animals on rotation lol! I'm in my 40s and married. My little stuffed puppy that belonged to my grandmother is one of my favorites.",
      "created_utc": 1718288137.0,
      "score": 1
    },
    {
      "id": "l8fh0sr",
      "body": "I'm a 43F, married for 16yrs , Still sleep with Teddy",
      "created_utc": 1718288579.0,
      "score": 1
    },
    {
      "id": "l8fh9oa",
      "body": "Honestly, it's far more healthy to sleep with a teddy bear than to be hooked on benzos. Do what's best for you and don't care about what others think, that's key to control anxiety - and I'm an anxious person myself who used to deal with tachycardia and all sorts of health problems because of anxiety.",
      "created_utc": 1718288666.0,
      "score": 1
    },
    {
      "id": "l8fhnwv",
      "body": "Late 30s checking in. Sometimes I sleep with my squishmallow.",
      "created_utc": 1718288806.0,
      "score": 1
    },
    {
      "id": "l8fhw44",
      "body": "Aww that's so cute loving you so much 🥹 🫂 ❤️",
      "created_utc": 1718288886.0,
      "score": 1
    },
    {
      "id": "l8fi7d5",
      "body": "I’m 29 with a 3 year old cinnamoroll plush I sleep with every night. It’s just the perfect texture and shape. It falls perfectly in my arms and head. I even take it on long road trips. It’s just so comforting and cute. Don’t let anyone tell you it’s weird.",
      "created_utc": 1718288996.0,
      "score": 1
    },
    {
      "id": "l8fipsn",
      "body": "ill forever sleep with a teddy bear",
      "created_utc": 1718289175.0,
      "score": 1
    },
    {
      "id": "l8fj3j9",
      "body": "  Nothing wrong with that. Everybody’s different — and I know telling people for any reason may be hard. 🙂 Be proud of yourself for admitting it. I’m twenty-one, and I still usually sleep with some kind of light on… most of the time. My Ma’s in her forties, and even she needs something to help her sometimes on a rough night. It’s more common than you might think. \n\nHope this helps. 😉",
      "created_utc": 1718289308.0,
      "score": 1
    },
    {
      "id": "l8fjqyw",
      "body": "I’m 30, single, no kids, and I sleep with my stuffies, too.",
      "created_utc": 1718289534.0,
      "score": 1
    },
    {
      "id": "l8fjrjs",
      "body": "I have a night fury (toothless) and the light fury plushies! They are usually in bed with me! Whether I hold them or not!! It’s comforting! I do it with my comforter too and my dog🤣",
      "created_utc": 1718289540.0,
      "score": 1
    },
    {
      "id": "l8fjyt8",
      "body": "I have a teddy bear I sometimes try to cuddle with, but my dog steals it and cuddles it…. But he refuses to cuddle me",
      "created_utc": 1718289611.0,
      "score": 1
    },
    {
      "id": "l8fkng9",
      "body": "I'm 26 and have 2 toy bears on my bed and also a long zebra toy that I cuddle with to sleep!",
      "created_utc": 1718289849.0,
      "score": 1
    },
    {
      "id": "l8fl74x",
      "body": "Pfft I'm 35 I still sleep with teddy's my fav at the moment is a super soft dragon I got from Lidl, I also have 2 cats and a dog who all share the bed and I'm pretty sure they count as living snugglies lol, nothing wrong with it.",
      "created_utc": 1718290037.0,
      "score": 1
    },
    {
      "id": "l8flpgy",
      "body": "I sleep with a stuffed baby doll at 26. My husband is very accepting and helped me feel a little more at ease about it. It’s a security thing, idk. Still trying to work through some shame around it but she helps my anxiety tremendously 🙂",
      "created_utc": 1718290213.0,
      "score": 1
    },
    {
      "id": "l8fmw4w",
      "body": "I am 25 I am usually sleep hugged a pillow\n,     I am single",
      "created_utc": 1718290617.0,
      "score": 1
    },
    {
      "id": "l8fnw19",
      "body": "absolutely normal, especially in today’s times! I’m 26 and still have a ton of plushies, and will buy them pretty frequently. I’m engaged and my fiancé doesn’t care at all, and he actually uses some of the squishier ones as a pillow! cuddle your teddy and be at peace op :)",
      "created_utc": 1718290957.0,
      "score": 1
    },
    {
      "id": "l8fnwlc",
      "body": "Partner and I are both in our forties and each have a stuffie. And a dog snuggled in there too. Be comfortable and safe however you want, no shame!",
      "created_utc": 1718290963.0,
      "score": 1
    },
    {
      "id": "l8foe16",
      "body": "I’m 34 and I never stopped buying plushies and stuffed animals. Hugging a body pillow helps me sometimes",
      "created_utc": 1718291131.0,
      "score": 1
    },
    {
      "id": "l8fovy9",
      "body": "49 and I collect Stitch stuffies. I have seasonal snuggle buddies from my hubby for self soothing my PTSD.",
      "created_utc": 1718291300.0,
      "score": 1
    },
    {
      "id": "l8foxer",
      "body": "That’s so sweet. The only reason I stopped is when my then boyfriend made fun of me. I think I’m going to start again",
      "created_utc": 1718291314.0,
      "score": 1
    },
    {
      "id": "l8fphft",
      "body": "If it helps to assuage any of your anxiety, I sleep with a stuffed rabbit at 42.",
      "created_utc": 1718291504.0,
      "score": 1
    },
    {
      "id": "l8fpsae",
      "body": "I love this for us tbh \nLook at all of us in here living our best anxious lives",
      "created_utc": 1718291605.0,
      "score": 1
    },
    {
      "id": "l8fpsc7",
      "body": "I'll be 37 in 2 months and I sleep with several stuffed animals as well as the blanket I got as a baby. It's more common than you'd think!",
      "created_utc": 1718291605.0,
      "score": 1
    },
    {
      "id": "l8fq67y",
      "body": "I'm 28 and I do too, well it's a yoshi plush. My mother makes comments a lot, but it's comforting when I have anxiety and can't sleep lol.",
      "created_utc": 1718291735.0,
      "score": 1
    },
    {
      "id": "l8fs5j1",
      "body": "So?? I’m 30 years old and I still talk like a baby sometimes with my family. I have a million stuffed animals. It’s not weird. Whatever makes you feel comfortable is totally fine as long as you’re not hurting anyone.",
      "created_utc": 1718292393.0,
      "score": 1
    },
    {
      "id": "l8fs86s",
      "body": "I have stuffed toys on my bed next to my pillow and they stay there when i sleep. I love plushie things, it gives me a cozy, safe space. Im 34",
      "created_utc": 1718292418.0,
      "score": 1
    },
    {
      "id": "l8fs91t",
      "body": "Married and I still have blankets I have to have 🤷🏼‍♀️",
      "created_utc": 1718292426.0,
      "score": 1
    },
    {
      "id": "l8fvf8n",
      "body": "Same! I am 34 though.",
      "created_utc": 1718293481.0,
      "score": 1
    },
    {
      "id": "l8fwwxq",
      "body": "If you’re embarrassed about it (you shouldn’t be, but I understand how these things are sometimes), you could always trade it for a smaller pillow",
      "created_utc": 1718293970.0,
      "score": 1
    },
    {
      "id": "l8fxfq0",
      "body": "I sleep with a bunch of stuffed Pokemon, a Yu-Gi-Oh! Plush, and a LoZ Plush.",
      "created_utc": 1718294142.0,
      "score": 1
    },
    {
      "id": "l8fxj43",
      "body": "I sleep with my stuffed cat meow meow at 29!! Every night baby! No shame. Never ever get rid of your bear. My mom got bulled into doing that when she was in her 20s and regrets it everyday. I’ll have mine till the day I die",
      "created_utc": 1718294173.0,
      "score": 1
    },
    {
      "id": "l8fyypr",
      "body": "I an 34 and sleep with two  🧸 🧸",
      "created_utc": 1718294649.0,
      "score": 1
    },
    {
      "id": "l8fyza3",
      "body": "I an 34 and sleep with two  🧸 🧸",
      "created_utc": 1718294654.0,
      "score": 1
    },
    {
      "id": "l8fyzpj",
      "body": "27 and I sleep with my stuffed rabbit. I see nothing wrong with it!",
      "created_utc": 1718294658.0,
      "score": 1
    },
    {
      "id": "l8g19vh",
      "body": "whatever makes you happy and comfortable is so so so based. \n\nsleep is extremely imoortant to your health so whatever you need to do to get sleep is valid as fuck.",
      "created_utc": 1718295423.0,
      "score": 1
    },
    {
      "id": "l8g1v71",
      "body": "Thats a good idea. I try to sleep with my dog but he hates cuddles.",
      "created_utc": 1718295622.0,
      "score": 1
    },
    {
      "id": "l8g1yn1",
      "body": "I've got a set of those squishy seals that I sleep on, I've tried all kinds of pillows but those have been working for me. No Ragrats not even a letter.",
      "created_utc": 1718295654.0,
      "score": 1
    },
    {
      "id": "l8g2uyw",
      "body": "I still have a LOT of stuffed animals, and I'm 21. I sleep with one in my arms every single night. My bf teases me, but he knows it makes me happy and less anxious, so he doesn't judge.",
      "created_utc": 1718295953.0,
      "score": 1
    },
    {
      "id": "l8g39e7",
      "body": "I’m 36 and I sleep with a giant cyndaquil plushie",
      "created_utc": 1718296086.0,
      "score": 1
    },
    {
      "id": "l8g3dam",
      "body": "I'm married and have a Stitch I cuddle with and my husband will even spray his cologne on it on occasion for me. I have multiple Stitches and a teddy bear and a axolotl.\n\nAlso 27.",
      "created_utc": 1718296122.0,
      "score": 1
    },
    {
      "id": "l8g3x16",
      "body": "I sleep with 2 shark plushies and I'm almost 40, they help tremendously!",
      "created_utc": 1718296304.0,
      "score": 1
    },
    {
      "id": "l8g3y0q",
      "body": "I still sleep with the baby blanket that my Godparents gave me when I was 3 months old!! I am 31 now. I don’t feel ashamed of it at all, it gives me comfort & none of my partners have ever teased me about it. My best friend STILL tells me she wishes that she had kept her baby blanket, but she tossed it when she was 13.",
      "created_utc": 1718296314.0,
      "score": 1
    },
    {
      "id": "l8g42dd",
      "body": "I'm 37 and I sleep with the same teddy bear I've had since i was five (Big Bear)",
      "created_utc": 1718296354.0,
      "score": 1
    },
    {
      "id": "l8g4bqw",
      "body": "I sleep with a blanket my mom sewed before she died",
      "created_utc": 1718296442.0,
      "score": 1
    },
    {
      "id": "l8g4lqe",
      "body": "I’m 23 and I still sleep with my dog stuffie I’ve had since I was 4",
      "created_utc": 1718296534.0,
      "score": 1
    },
    {
      "id": "l8g5v3u",
      "body": "I'm 41yo and I still sleep with my childhood bear. He's just a rag now, but he's still my bear",
      "created_utc": 1718296950.0,
      "score": 1
    },
    {
      "id": "l8g6mi9",
      "body": "Everyone should always sleep with a teddy bear, even at 97.",
      "created_utc": 1718297200.0,
      "score": 1
    },
    {
      "id": "l8g762w",
      "body": "I do at 38",
      "created_utc": 1718297378.0,
      "score": 1
    },
    {
      "id": "l8g78kd",
      "body": "hot girls sleep with a stuffed animal. period.",
      "created_utc": 1718297401.0,
      "score": 1
    },
    {
      "id": "l8g945y",
      "body": "A big golden retriever sleeps in my bed with me and improved my anxiety 😊",
      "created_utc": 1718298017.0,
      "score": 1
    },
    {
      "id": "l8g96cj",
      "body": "That's ok. Nothing wrong with it whatsoever.\n\nI'm 50 and I sleep with a baby blanket and a Squishmallow, and I still suck my thumb while I'm falling asleep. This isn't hurting anyone, not even myself.",
      "created_utc": 1718298037.0,
      "score": 1
    },
    {
      "id": "l8g9wj3",
      "body": "Neither my (29F) partner (29M) nor dog (4M) like to cuddle in bed at night, so I'm thankful for my little body/sausage pillow (26) that I still use every day 😢",
      "created_utc": 1718298279.0,
      "score": 1
    },
    {
      "id": "l8gaer2",
      "body": "Me too, brother! I’m 26 and my Teddy is 22 years old- enough to drink and smoke cigarettes (not that I’d let her!). I used to feel lots of shame because I thought people would think it’s childish (and some ppl do!) but I learned to get over that fear because it’s just a Teddy and it’s not hurting anyone and it’s definitely helping me. I also collect swuishmallows and other stuffies, I like to think they’re my brood. I have one gorilla that I put on my dresser so he overlooks the room ( I like to think he watches over the tinnier ones and me).",
      "created_utc": 1718298449.0,
      "score": 1
    },
    {
      "id": "l8gapbm",
      "body": "32 and I still sleep with a cuddly monkey. I even tuck my fiancé in with it when he's sleeping and I'm not 😂 absolutely nothing wrong with it.",
      "created_utc": 1718298548.0,
      "score": 1
    },
    {
      "id": "l8gb7wv",
      "body": "I sleep with a bear and two giraffes, it’s no big deal.",
      "created_utc": 1718298722.0,
      "score": 1
    },
    {
      "id": "l8gbgy9",
      "body": "I have a \"Blankie\" I sleep with every night. My last boyfriend had a stuffed dog. We all cuddled together! Do what makes you feel safe and comfortable. Don't worry about societal expectations created by people who don't know how crippling anxiety can be. I will say, nothing is wrong with having a comfort item, but I do hope you have the ability and resources to get help that works at the root of the problem. Then hopefully you won't have to rely quite so heavily on one, not for anyone else's sake or comfort, just yours! \n\nHope you and your teddy have as wonderful of a day as me and my blankie are!",
      "created_utc": 1718298804.0,
      "score": 1
    },
    {
      "id": "l8gepgp",
      "body": "It's okay I sleep with my djungelskog teddy almost everynight and I'm 24, brought it when I was 21.",
      "created_utc": 1718299872.0,
      "score": 1
    },
    {
      "id": "l8girwv",
      "body": "Me and my boyfriend both sleep with our baby blankets! haha",
      "created_utc": 1718301210.0,
      "score": 1
    },
    {
      "id": "l8gmnp5",
      "body": "I sleep with a fan on and the pillow is my teddy bear in a way. It’s fine whatever works literly works. Sometimes id sleep different just not to trigger my anxitey",
      "created_utc": 1718302501.0,
      "score": 1
    },
    {
      "id": "l8go2q2",
      "body": "Ain't nothing wrong with that. You do whatever helps you sleep.",
      "created_utc": 1718302998.0,
      "score": 1
    },
    {
      "id": "l8gocod",
      "body": "I do too and I’m 26. I think it’s normal and okay",
      "created_utc": 1718303099.0,
      "score": 1
    },
    {
      "id": "l8gsqo8",
      "body": "im glad the teddy bear helps soothe your anxiety. do they have a name?",
      "created_utc": 1718304606.0,
      "score": 1
    },
    {
      "id": "l8gt4ex",
      "body": "I sleep with a teddy bear or a shark at 55!",
      "created_utc": 1718304731.0,
      "score": 1
    },
    {
      "id": "l8gtipv",
      "body": "I have a comfort pillow that I have had since I was 6 and is hanging on for dear life. I am 31. You’re okay.",
      "created_utc": 1718304860.0,
      "score": 1
    },
    {
      "id": "l8gu72m",
      "body": "Nothing wrong with that :)) If it makes you feel less anxious then it’s a good thing, don’t let anyone make you feel bad about it :))",
      "created_utc": 1718305084.0,
      "score": 1
    },
    {
      "id": "l8gvlfu",
      "body": "im 26 and have never slept with a stuffed animal of any sort but im kind of interested in trying now",
      "created_utc": 1718305552.0,
      "score": 1
    },
    {
      "id": "l8gvq75",
      "body": "I have so many stuffed animals that I have to keep a bunch in my closet or y boyfriend won't fit on the bed. And they're all soft and fluffy animals",
      "created_utc": 1718305596.0,
      "score": 1
    },
    {
      "id": "l8gwnrs",
      "body": "I have had anxiety since I was 6. I still have a stuffed bear my parents got me at age 6 to help get over anxious moments. It’s surprisingly in great shape. 🥳",
      "created_utc": 1718305902.0,
      "score": 1
    },
    {
      "id": "l8gxec4",
      "body": "I used to work as an emt and I've had elderly patients travel with a stuffed animal before. One made a comment it must seem so stupid and I did my best to reassure her it's nothing to be ashamed about. We all find comfort in different ways.  Life is hard enough without us judging each other in how we find comfort. I'd never judge someone for something like that. Hug your teddies tight all you want!",
      "created_utc": 1718306145.0,
      "score": 1
    },
    {
      "id": "l8gy4dv",
      "body": "i’m only 18 but i sleep with a teddy bear a nurse gifted me when i was in the hospital for a suicide attempt",
      "created_utc": 1718306385.0,
      "score": 1
    },
    {
      "id": "l8gyo41",
      "body": "I've been sleeping with my plush bunny for 25 years (26 now). It helps me with my anxiety",
      "created_utc": 1718306569.0,
      "score": 1
    },
    {
      "id": "l8gyw3r",
      "body": "I sleep with a toy clown I've had since birth and I'm 32.\nWell actually... I have 3 copies of this clown now as the eldest obviously got a bit battered over the years.",
      "created_utc": 1718306643.0,
      "score": 1
    },
    {
      "id": "l8h0gy3",
      "body": "I have bequeathed most of my stuffies to my daughter but I still have a few that are mine. My mom got me a fat squishy seal so I can cuddle it when I’m anxious. I’m 41.",
      "created_utc": 1718307168.0,
      "score": 1
    },
    {
      "id": "l8h0k60",
      "body": "I have the stuffed dog i was given for my first xmas and a cinnamoroll plush im 26",
      "created_utc": 1718307197.0,
      "score": 1
    },
    {
      "id": "l8h1sc3",
      "body": "30 here. We have two. One for each of us. Giant bears. Highly recommend the giant ones.",
      "created_utc": 1718307606.0,
      "score": 1
    },
    {
      "id": "l8h27ih",
      "body": "my partners gave me a giant squishmallow after our 2nd date and i sleep w it every night",
      "created_utc": 1718307746.0,
      "score": 1
    },
    {
      "id": "l8h3hdb",
      "body": "I'm 30 I still have my teddy bear from when I was born. As in is displayed in my bedroom, I don't cuddle with it because now I have cats and a husband to cuddle with but it's there in my \"adult\" bedroom. You are good 😌 if anyone ever shame you for that, go away from them. You are allowed to enjoy what you like as far as you are not hurting anyone",
      "created_utc": 1718308171.0,
      "score": 1
    },
    {
      "id": "l8h3r8e",
      "body": "I sleep with two \"cuddle\" pillows. One for each side. I'm 44. It's comforting.",
      "created_utc": 1718308260.0,
      "score": 1
    },
    {
      "id": "l8h4oml",
      "body": "Hi, my mom is 56 and always tells me nobody can judge (anyone) for liking things like plushies at any age, she still sleeps with an old teddy bear and has a collection of plushies from various parts of the world, she'll never separate from them.\n\nMy cousin is 30 and she has a collection of plush monkeys, my other cousin had like 20ish cat plushies before getting actual cats with his gf, but some are still around the house.\n\nMe (19) and my best friend (18) exchange plushies every time he sleeps over at his grandma who lives close to me.\n\nComfort has no age, especially if it's something that soothes you and calms you, and best of all, you'll never sleep alone ✨",
      "created_utc": 1718308566.0,
      "score": 1
    },
    {
      "id": "l8h4pvj",
      "body": "I sleep with 3. I’m 35.",
      "created_utc": 1718308577.0,
      "score": 1
    },
    {
      "id": "l8h53aq",
      "body": "I got a weight stuffed dog for Christmas, my actual dog claimed it as his own so I cuddle a stuffed duck now lol",
      "created_utc": 1718308702.0,
      "score": 1
    },
    {
      "id": "l8h64g5",
      "body": "Who the hell cares. \nAre you hurting someone else? No? \nYou do you, if this makes you happy so dang what. People need to let others themselves and others live. It’s the only way the aliens will talk to us.",
      "created_utc": 1718309045.0,
      "score": 1
    },
    {
      "id": "l8h9an8",
      "body": "I sleep with cleo the catapillar, this big ass catapillar toy from Toys R us or Smiths (something like that). Was meant for my dog, he uses it sometimes, but i use it more now.",
      "created_utc": 1718310093.0,
      "score": 1
    },
    {
      "id": "l8h9wga",
      "body": "There's like 10 small plushies in my bed every night. I sleep hugging a thwomp plushie and small gengar plushie. I turn 30 in 2 months. I'm also married.",
      "created_utc": 1718310291.0,
      "score": 1
    },
    {
      "id": "l8h9xru",
      "body": "I don't sleep with it but i still have my teddy bear from 2001 and now i'm 26",
      "created_utc": 1718310303.0,
      "score": 1
    },
    {
      "id": "l8h9zjx",
      "body": "I have two weighted stuffed animals and I’m 21. Don’t ever worry about something that brings you comfort ❤️",
      "created_utc": 1718310318.0,
      "score": 1
    },
    {
      "id": "l8ha0n0",
      "body": "I sleep with my teddy and im 23. I got him at 18 when i was going through a rough time, so he’s definitely an emotional support teddy but also super soft and nice :3",
      "created_utc": 1718310328.0,
      "score": 1
    },
    {
      "id": "l8hafnx",
      "body": "I sleep with my baby blanket at 25 and have a partner. He doesn’t care about it but says it’s itchy so he rather not have it next to him. Lol",
      "created_utc": 1718310464.0,
      "score": 1
    },
    {
      "id": "l8hb1tc",
      "body": "i sleep with my baby blanket.",
      "created_utc": 1718310664.0,
      "score": 1
    },
    {
      "id": "l8hcbai",
      "body": "I'm a 34 year old dude and me and my fiancé who I've been with for 8 and a half years sleep with a rotation of teddies. Comfort is comfort.",
      "created_utc": 1718311076.0,
      "score": 1
    },
    {
      "id": "l8hd7gi",
      "body": "Not single and I sleep with a few stuffed friends. The weight on my chest when I sleep is always helpful.",
      "created_utc": 1718311368.0,
      "score": 1
    },
    {
      "id": "l8hf8dd",
      "body": "I sleep with between 2-4 squishmallows at 24 and I share a bed with my partner. Even he sometimes steals one to hug in the night. No shame - they are the best and super comforting ",
      "created_utc": 1718312034.0,
      "score": 1
    },
    {
      "id": "l8hfbd6",
      "body": "37, my boyfriend buys me little guys to sleep with for my anxiety. Doesn't hurt anyone, sparks my joy.",
      "created_utc": 1718312061.0,
      "score": 1
    },
    {
      "id": "l8hgoog",
      "body": "I'm 37 and sleep with a pusheen plush because it's comfy AF to snuggle with! My partner also has one.",
      "created_utc": 1718312516.0,
      "score": 1
    },
    {
      "id": "l8hjn1y",
      "body": "Age 50 and Brownie is not going anywhere!",
      "created_utc": 1718313527.0,
      "score": 1
    },
    {
      "id": "l8hjqv0",
      "body": "I’m 22 and my bf is 24 and we sleep with all our plushies and jellycat collection!! There is so many plushies but im at the point where I don’t care!! I love jellycats the most and will bring them on adventures with me too and my friends do the same! We all now bring ours out on adventures wherever we go and all still bring plushies to sleep woth",
      "created_utc": 1718313563.0,
      "score": 1
    },
    {
      "id": "l8hjt0v",
      "body": "I'm 38, and I sleep with a tiger stuffy that I have had since I was two.",
      "created_utc": 1718313585.0,
      "score": 1
    },
    {
      "id": "l8hmxeh",
      "body": "Nah man. Nothing wrong with that at all.❤️",
      "created_utc": 1718314682.0,
      "score": 1
    },
    {
      "id": "l8hn8r6",
      "body": "33 and I have a blanket on top and one squished between my arms and touching my chin. I hope my fiancé will be okay with that soon!",
      "created_utc": 1718314793.0,
      "score": 1
    },
    {
      "id": "l8hnobq",
      "body": " 33 - same, there is no shame ☺️",
      "created_utc": 1718314943.0,
      "score": 1
    },
    {
      "id": "l8hohli",
      "body": "Same I have a body pillow and my bear beary from childhood (I was a very creative toddler obviously)",
      "created_utc": 1718315231.0,
      "score": 1
    },
    {
      "id": "l8hopri",
      "body": "There absolutely nothing wrong with that.  It helps you. I'm 64 and sleep with a rag doll that was my mothers.  If someone tried to make fun of me my response would be \"screw you, I miss my mom and the doll reminds me of her and your opinion matters jack shit to me\".",
      "created_utc": 1718315312.0,
      "score": 1
    },
    {
      "id": "l8hphp8",
      "body": "You do you. Love it 🥰 \n\nPlease forgive me but the first thing that popped into my mind:\n“Please tell me you use protection”",
      "created_utc": 1718315593.0,
      "score": 1
    },
    {
      "id": "l8hplyt",
      "body": "Same. I’m 36",
      "created_utc": 1718315636.0,
      "score": 1
    },
    {
      "id": "l8hpqom",
      "body": "I’m 48 and frequently sleep cuddling the bear I bought myself when I was 20. I feel better and more relaxed, and it hurts no one.",
      "created_utc": 1718315684.0,
      "score": 1
    },
    {
      "id": "l8hqy9q",
      "body": "I sleep with a squirtle and I’m older than you. You’re good.",
      "created_utc": 1718316126.0,
      "score": 1
    },
    {
      "id": "l8hrdjt",
      "body": "Im 34 and sleep with a plushy boar.",
      "created_utc": 1718316286.0,
      "score": 1
    },
    {
      "id": "l8hs6jq",
      "body": "It's natural actually. We're social creatures, snuggling with something is very comforting.",
      "created_utc": 1718316588.0,
      "score": 1
    },
    {
      "id": "l8hscgs",
      "body": "I sleep with tons of plushies, including my little dalmatian plush from when was baby me. I'm 23 and don't plan on stopping. Tho I understand feeling anxious/insecure for sleeping with them. 🫂\nMy mom also sleeps with a plush some nights and is 48.",
      "created_utc": 1718316650.0,
      "score": 1
    },
    {
      "id": "l8hsfu8",
      "body": "So.",
      "created_utc": 1718316687.0,
      "score": 1
    },
    {
      "id": "l8hsitt",
      "body": "i’m in my 20s as well and i too sleep with a teddy! i also still sleep with this scrappy little crocheted yarn blanket my mom made me when i was a baby. i don’t give a fuck! it’s comfy and reassuring as hell! i love buying plushies so much and in fact i have two on the way to me in the mail from build-a-bear. i’m so goddamn excited.",
      "created_utc": 1718316719.0,
      "score": 1
    },
    {
      "id": "l8hsqjd",
      "body": "I'm 40 and sometimes at night I steal my wife's Figment cuddly plushy",
      "created_utc": 1718316800.0,
      "score": 1
    },
    {
      "id": "l8hug74",
      "body": "30 with a panda pillow pet :)",
      "created_utc": 1718317450.0,
      "score": 1
    },
    {
      "id": "l8hui1c",
      "body": "I'm 32, and my husband of 7 years buys me plushies, so....You're good! :) If that's what you need to sleep, then that's what you need. Sleep I important! 😴",
      "created_utc": 1718317470.0,
      "score": 1
    },
    {
      "id": "l8huusf",
      "body": "I’m 43 and sleep with a blanket I got when I was 8.",
      "created_utc": 1718317606.0,
      "score": 1
    },
    {
      "id": "l8hvcgw",
      "body": "That's Good there is  nothing wrong with it I collect teddy bears .",
      "created_utc": 1718317794.0,
      "score": 1
    },
    {
      "id": "l8hvphd",
      "body": "Plushies are underrated! 🦄",
      "created_utc": 1718317936.0,
      "score": 1
    },
    {
      "id": "l8hw8t1",
      "body": "I did til I moved in with my now husband at 38. No shame in the teddy bear game. Do what you’ve gotta do!!!!",
      "created_utc": 1718318148.0,
      "score": 1
    },
    {
      "id": "l8hwze7",
      "body": "I do the same at 60",
      "created_utc": 1718318433.0,
      "score": 1
    },
    {
      "id": "l8i0xfu",
      "body": "My wife is 33 and is currently taking a nap while cuddling a stuffed animal. She simply sleeps better that way. If it helps you and isn't harmful, do what you need to do.",
      "created_utc": 1718319965.0,
      "score": 1
    },
    {
      "id": "l8i1n2b",
      "body": "My wife is 30 and has an elephant I bought for her she sleeps with. \n\nI personally hold a pillow, and the pillow I've always had since I was a baby is on my couch downstairs. I usually hold it while I game. The only reason I don't sleep with it is because it's basically worn down to nothing. I'm 30.\n\nYou're not weird.",
      "created_utc": 1718320245.0,
      "score": 1
    },
    {
      "id": "l8i28ia",
      "body": "Nothing to be ashamed of. If it helps you then do it.",
      "created_utc": 1718320480.0,
      "score": 1
    },
    {
      "id": "l8i455c",
      "body": "My young daughter changes it up and gives me a different one every now and then. I am 35 and male.",
      "created_utc": 1718321229.0,
      "score": 1
    },
    {
      "id": "l8i4grs",
      "body": "Well, i cuddle my cat. I’m 42",
      "created_utc": 1718321358.0,
      "score": 1
    },
    {
      "id": "l8i4woh",
      "body": "I’m 30 and I do. It comforts me x",
      "created_utc": 1718321537.0,
      "score": 1
    },
    {
      "id": "l8i8aqs",
      "body": "My boyfriend got me a stuffed dog for my 23rd birthday and I sleep with it almost every night. It brings me so much comfort",
      "created_utc": 1718322904.0,
      "score": 1
    },
    {
      "id": "l8i8i0f",
      "body": "Cute",
      "created_utc": 1718322984.0,
      "score": 1
    },
    {
      "id": "l8i8n3r",
      "body": "I'm 23 and I cuddle with a plush at night. My latest plush is a very soft white and red cat with a heart on its chest. I'm leaning towards naming her Clarice. I love stuffed animals, honestly.",
      "created_utc": 1718323043.0,
      "score": 1
    },
    {
      "id": "l8cmrzd",
      "body": "28 here and same... doesn't get much better than this, right? ...right? Guys?",
      "created_utc": 1718236680.0,
      "score": 129
    },
    {
      "id": "l8d4vhq",
      "body": "I’m not even single and I sleep with one every night 😅",
      "created_utc": 1718243989.0,
      "score": 109
    },
    {
      "id": "l8dt6px",
      "body": "Lmao I'm 28 and me and my husband both got our own bird squishmallowd to cuddle at night",
      "created_utc": 1718255242.0,
      "score": 39
    },
    {
      "id": "l8drvuc",
      "body": "I'll be 26 in 2 weeks, and I sleep with a dinosaur. I used to hug an old flat pillow, but this guy is cuter and softer and more comfy. No regrets. He also doesn't have claws or staple remover teeth, unlike my cats. Win win!",
      "created_utc": 1718254507.0,
      "score": 33
    },
    {
      "id": "l8ehlpe",
      "body": "I'm 38 and I have 8 (14 inch) squishmallows on my bed, I use them as pillows because I have chronic neck and back pain and they're the only thing that keeps me from waking up with a migraine. When one gets too squished to bounce back in the washer, it gets moved to the side and replaced rather than being thrown out.",
      "created_utc": 1718271627.0,
      "score": 12
    },
    {
      "id": "l8dmk0f",
      "body": "I have an extra pillow that is like a decorative one and I cuddle it pretending it it my hubby. Apparently you can manifest like that.",
      "created_utc": 1718251660.0,
      "score": 8
    },
    {
      "id": "l8e9aei",
      "body": "I’m 36 and I collect Squishmallows (and Pusheen stuff)! They are the best!",
      "created_utc": 1718265846.0,
      "score": 7
    },
    {
      "id": "l8e55du",
      "body": "I’m 22 and have about 3 of the small ones… they are they perfect size to fit inside my elbow and press against my chest/neck when I’m in bed and it’s the comfiest I have ever felt!",
      "created_utc": 1718262870.0,
      "score": 6
    },
    {
      "id": "l8g1rdv",
      "body": "I’m 25 I used to cuddle my toys even with guys lol. But I got a dog and his cuddle better than any guy",
      "created_utc": 1718295587.0,
      "score": 6
    },
    {
      "id": "l8ebd0o",
      "body": "They are so soft and squishy ☺️☺️",
      "created_utc": 1718267359.0,
      "score": 2
    },
    {
      "id": "l8gfohw",
      "body": "I got me a snorlax squishmallow and I'm going on 27, I love that thing so soft and squishy and nice to hold at my side when my heart wants to make itself annoyingly present in my head",
      "created_utc": 1718300196.0,
      "score": 2
    },
    {
      "id": "l8ggnhw",
      "body": "31 sleeping with a squishmellow. It’s just a cute hug able pillow that places my arms perfectly where they need to go lol",
      "created_utc": 1718300514.0,
      "score": 2
    },
    {
      "id": "l8hut1e",
      "body": "33 here, husband and I both have teddybears, we're just one big cuddle puddle",
      "created_utc": 1718317587.0,
      "score": 2
    },
    {
      "id": "l8iy06k",
      "body": "My sister got me to get a squishmallow.. IM SO HAPPY I DID KTS THE BEST!!!",
      "created_utc": 1718333773.0,
      "score": 2
    },
    {
      "id": "l8j7ba0",
      "body": "I'm 28 and I'm currently in bed with 5+",
      "created_utc": 1718338254.0,
      "score": 2
    },
    {
      "id": "l8d1i5k",
      "body": "Hugging a pillow is not materially different and nobody would even bat an eye if you mentioned you sleep like that.",
      "created_utc": 1718242617.0,
      "score": 193
    },
    {
      "id": "l8duf2n",
      "body": "I turn 40 soon!  o/\n\n(& I swap out which friend I'm sleeping with most nights)",
      "created_utc": 1718255962.0,
      "score": 24
    },
    {
      "id": "l8dtslq",
      "body": "How . . . how’d you have a real bear as a pet? 😳",
      "created_utc": 1718255595.0,
      "score": 12
    },
    {
      "id": "l8hpb94",
      "body": "The gay dream 😂😂😂",
      "created_utc": 1718315528.0,
      "score": 2
    },
    {
      "id": "l8ddlna",
      "body": "lol somewhere sounds so ominous",
      "created_utc": 1718247525.0,
      "score": 63
    },
    {
      "id": "l8dywmc",
      "body": "Yup, we both have our stuffed animals from childhood next to us... and a few new ones. Can't sleep without protection!",
      "created_utc": 1718258720.0,
      "score": 20
    },
    {
      "id": "l8dv64p",
      "body": "Love it!!!",
      "created_utc": 1718256412.0,
      "score": 5
    },
    {
      "id": "l8d9l3l",
      "body": "Hell, my weighted dinosaur comes with me to therapy and work too! If people ask about it I have them put her on their lap so they can see how relaxing it feels :)",
      "created_utc": 1718245868.0,
      "score": 26
    },
    {
      "id": "l8d2dq9",
      "body": "The way you said I love her with all my heart is so cute ☺️",
      "created_utc": 1718242975.0,
      "score": 16
    },
    {
      "id": "l8ehcu5",
      "body": "I bet that’s fantastic. I use a weighted blanket, and now I’m wishing I had a Dino friend too hehe.",
      "created_utc": 1718271446.0,
      "score": 4
    },
    {
      "id": "l8f46sg",
      "body": "Omg I didn’t know weighted animals was a thing! Now I have to buy one to sleep with.",
      "created_utc": 1718283659.0,
      "score": 4
    },
    {
      "id": "l8k8510",
      "body": "I have a weighted bunny rabbit, they are brilliant for self soothing when overwhelmed. I’m in my 40s and bought it from a children’s shop ❤️",
      "created_utc": 1718362051.0,
      "score": 2
    },
    {
      "id": "l8duibl",
      "body": "I need to follow her Instagram, please.",
      "created_utc": 1718256016.0,
      "score": 9
    },
    {
      "id": "l8g64zo",
      "body": "Hahaha so cute \"teef\"",
      "created_utc": 1718297041.0,
      "score": 2
    },
    {
      "id": "l8eio9h",
      "body": "I have a newish (10 years old) Teddy Bear and a Blanket I've had since I was 13. \n\nI'm 51.",
      "created_utc": 1718272383.0,
      "score": 10
    },
    {
      "id": "l8f5qgf",
      "body": "I thought after I posted that I was 53 I would get laughed at. Trust me. I'm used to it. That's why I'm sleeping with stuffed animals to begin with😅",
      "created_utc": 1718284297.0,
      "score": 2
    },
    {
      "id": "l8cuemt",
      "body": "Do the weighted ones help you more?",
      "created_utc": 1718239757.0,
      "score": 4
    },
    {
      "id": "l8gyf41",
      "body": "I have the sloth and i love keeping it on my belly when I'm having period pain. Just wish my rabbit would stop trying to eat it 😂",
      "created_utc": 1718306484.0,
      "score": 2
    },
    {
      "id": "l8dk2aq",
      "body": "so sorry for your loss 💔",
      "created_utc": 1718250429.0,
      "score": 15
    },
    {
      "id": "l8cq8ti",
      "body": "I keep \"nightlights\" in the hall, bathroom and 1 in my room. Mostly because I'm blind at night and have nearly tripped to death over piles of clothes on the floor, but also because it helps my anxiety to have a little bit of light. \n\nDo what works for you, OP",
      "created_utc": 1718238088.0,
      "score": 3
    },
    {
      "id": "l8fpin8",
      "body": "31 and same!! (Along with multiple squishmallows)",
      "created_utc": 1718291515.0,
      "score": 2
    },
    {
      "id": "l8cyk3q",
      "body": "I had a boyfriend that thought it was hot though… not sure how I felt about that",
      "created_utc": 1718241418.0,
      "score": 2
    },
    {
      "id": "l8gtyrf",
      "body": "Oh I love this! I used to collect Pooh stuffies as a kid. Don't know what happened to them. Might need a new one soon!",
      "created_utc": 1718305008.0,
      "score": 2
    },
    {
      "id": "l8gqjs6",
      "body": "Omg I love this!! Joined!!",
      "created_utc": 1718303889.0,
      "score": 2
    },
    {
      "id": "l8cytao",
      "body": "Right! :)",
      "created_utc": 1718241521.0,
      "score": 34
    },
    {
      "id": "l8ezu2z",
      "body": "Same 😂 thankfully my partner thinks it’s cute!",
      "created_utc": 1718281775.0,
      "score": 27
    },
    {
      "id": "l8gddu7",
      "body": "Same here. Bear helps me relax and eases my anxiety. (Yes, the teddy bear’s name is Bear. Don’t judge me.) When I am really stressed or anxious, my SO brings me Bear to help calm me down while I try to do my breathing exercises.\n\nEdit: I’m in my 40s.",
      "created_utc": 1718299434.0,
      "score": 26
    },
    {
      "id": "l8fpwst",
      "body": "FLAT PILLOWS FOR THE WIN. Need my snuggle pillow or I won’t catch a WINK",
      "created_utc": 1718291647.0,
      "score": 5
    },
    {
      "id": "l8drln5",
      "body": "That’s actually kind of why I (25) still sleep with a stuff animal. It’s not really an anxiety or comfort thing to me, but I sleep on my stomach and hold the stuffed animal on whatever side my head is turned to, so it props up my shoulder just the tiniest amount and takes any strain off of my neck (always hear that stomach sleeping is bad for your neck, and I def feel some of the strain when I don’t do this but I’ve never had a problem when I DO do this). \n\nI use a pillow to do it when I don’t have a stuffed animal (like traveling), but the pillow is always just a little larger than I’d prefer. Honestly I even took my stuffed animal with me when I went on spring break with a bunch of friends my senior year of college—like shared a bed with other friends and everything so they all would’ve seen it. I have no shame about it, why should I?",
      "created_utc": 1718254351.0,
      "score": 51
    },
    {
      "id": "l8esw0f",
      "body": "Im 40.\nMy pillow is 2 ears and a tail away from being a cuddly toy to sleep with.\n\nSleep is so important, people only know about this if you tell them and if it helps you sleep, who cares?\nIf my cat was the type to cuddle in, i wouldnt need the pillow - but shes a lap cat, likes her own space.",
      "created_utc": 1718278454.0,
      "score": 9
    },
    {
      "id": "l8eungh",
      "body": "For real, I stick a pillow between my legs, one under my head, and one that I hug. Teddy bear is just a different pillow shape",
      "created_utc": 1718279327.0,
      "score": 7
    },
    {
      "id": "l8f0fj8",
      "body": "that’s what i do!! mostly just cause i haven’t found a stuff animal “shape” that works for my sleep 😂😂 honestly i gotta find my old pillow pet and throw that in the wash!",
      "created_utc": 1718282046.0,
      "score": 3
    },
    {
      "id": "l8dz7o1",
      "body": "40's are great! I definitely felt a lot more free of expectations and don't compare myself to anyone/anything any more. \n\nAlso I'm 49 and still sleep with my many times mended teddy bear I've had since I was a very young kid :)",
      "created_utc": 1718258912.0,
      "score": 24
    },
    {
      "id": "l8h7gdf",
      "body": "Well a teddy bear",
      "created_utc": 1718309486.0,
      "score": 2
    },
    {
      "id": "l8erk3u",
      "body": "🥺 this is adorable",
      "created_utc": 1718277762.0,
      "score": 10
    },
    {
      "id": "l8dekva",
      "body": "I have some weighted microwave “bears” (it’s a sloth and sheep), I might see about putting him in my car for comfort 😭",
      "created_utc": 1718247925.0,
      "score": 10
    },
    {
      "id": "l8d6zz6",
      "body": "I’ve gotten better sleep since having her so I’m completely happy 🫶🏻😭",
      "created_utc": 1718244846.0,
      "score": 12
    },
    {
      "id": "l8eyw4z",
      "body": "I tried weighted blankets, that thing makes me feeling like someone is holding me down 😭 so I had to switch to the Dino, I can put it on my chest and get the same effect. Target is where I got mine!",
      "created_utc": 1718281348.0,
      "score": 3
    },
    {
      "id": "l8erok7",
      "body": "I second this motion, she needs an Instagram account like yesterday",
      "created_utc": 1718277827.0,
      "score": 4
    },
    {
      "id": "l8fjsne",
      "body": "This would be what she would post on insta for sure:\n\nhttps://imgur.com/a/sfLXmBi\n\n(Photo of her at the beach. Well, the parking lot of the beach because I didn't take my phone further than this lol)",
      "created_utc": 1718289551.0,
      "score": 2
    },
    {
      "id": "l8h8s50",
      "body": "YES",
      "created_utc": 1718309926.0,
      "score": 2
    },
    {
      "id": "l8cuw6o",
      "body": "I find it does, yeah",
      "created_utc": 1718239948.0,
      "score": 6
    },
    {
      "id": "l8dklge",
      "body": "Thanks. I miss him everyday.",
      "created_utc": 1718250686.0,
      "score": 11
    },
    {
      "id": "l8ctfn8",
      "body": "I’m clumsy af and can be way too tired to actually put things away so the light DEFINITELY helps with that as well. \n\nMy brother is the total opposite. He needs it to be pitch black and SILENT for him to be able to sleep. \n\nI’ve literally woken up in a cold sweat because someone turned the light and my fan off. \n\nI’m a MESS when the power goes out.",
      "created_utc": 1718239363.0,
      "score": 3
    },
    {
      "id": "l8emdza",
      "body": ">I keep \"nightlights\" in the hall, bathroom and 1 in my room. Mostly because I'm blind at night and have nearly tripped to death over piles of clothes on the floor, but also because it helps my anxiety to have a little bit of light. \n\nWell, it's a good thing you didn't build a trap with a floor of daggers pointing upward then forgetting where the trap was & walking straight into it when going to the bathroom.",
      "created_utc": 1718274801.0,
      "score": 2
    },
    {
      "id": "l8hwws8",
      "body": "My 2 childhood toys (lion & tiger) , got lost after I went to uni, devastated to say the least",
      "created_utc": 1718318406.0,
      "score": 2
    },
    {
      "id": "l8gtcg0",
      "body": "Mine is named Pinky Bear!",
      "created_utc": 1718304804.0,
      "score": 2
    },
    {
      "id": "l8hclx7",
      "body": "Lmao mine is a cat and it's named Kitty 😂",
      "created_utc": 1718311172.0,
      "score": 2
    },
    {
      "id": "l8l3o97",
      "body": "Yupppp! Haha I need a good pillow for my head, a snuggle pillow/dino for my arms to hug, and a body pillow to koala, or I'm ruined 😅",
      "created_utc": 1718375747.0,
      "score": 2
    },
    {
      "id": "l8f1xxi",
      "body": "I mentioned in the post that I’m nearly 40, and mine is a stuffed duck from when I was born lol A LOT of it has to do with the fact that my family is now gone, and I’m alone. I miss them so much, that I CLING to my stuffed duck because that’s the only thing that reminds me of them, and makes me feel “safe”. The looks I get are unbelievable lol and truthfully, I’d do a double take too. But it helps ME. Therefore, my duck will continue the journey to recovery with me 😂🤍",
      "created_utc": 1718282709.0,
      "score": 20
    },
    {
      "id": "l8el5d9",
      "body": ">always hear that stomach sleeping is bad for your neck, and I def feel some of the strain when I don’t do this but I’ve never had a problem when I DO do this). \n\nI can't sleep on my stomach most the time as I don't get enough oxygen but that maybe the position & your teddy bear probably helps with this. \n\nI personally always sleep on my side",
      "created_utc": 1718274016.0,
      "score": 6
    },
    {
      "id": "l8f4vwo",
      "body": "I do the same thing!",
      "created_utc": 1718283951.0,
      "score": 3
    },
    {
      "id": "l8f8vhk",
      "body": "I do the exact same thing 🥹",
      "created_utc": 1718285549.0,
      "score": 3
    },
    {
      "id": "l8giw6v",
      "body": "🥰😘",
      "created_utc": 1718301249.0,
      "score": 2
    },
    {
      "id": "l8fjv93",
      "body": "This would be what she would post on insta for sure:\n\nhttps://imgur.com/a/sfLXmBi\n\n(Photo of her at the beach. Well, the parking lot of the beach because I didn't take my phone further than this lol)",
      "created_utc": 1718289576.0,
      "score": 6
    },
    {
      "id": "l8ghsx3",
      "body": "XD ILY, thank you for sharing. The name is even more perfect with those teeeefs! (Love that hair color too)",
      "created_utc": 1718300893.0,
      "score": 2
    },
    {
      "id": "l8czkm3",
      "body": "Thank you. I just started seeing the weighted stuffed animals recently.",
      "created_utc": 1718241828.0,
      "score": 2
    },
    {
      "id": "l8hte4m",
      "body": "Yay for the Bears Club!! 🐻",
      "created_utc": 1718317047.0,
      "score": 2
    },
    {
      "id": "l8htn3l",
      "body": "None of us ever claimed to be the most creative when coming up with names for our stuffed friends. 😂😂",
      "created_utc": 1718317140.0,
      "score": 2
    },
    {
      "id": "l8fbjw8",
      "body": "You are not alone! You have us.",
      "created_utc": 1718286589.0,
      "score": 8
    },
    {
      "id": "l8fzxh6",
      "body": "OH MY GOD HER LITTLE TEEF",
      "created_utc": 1718294973.0,
      "score": 4
    },
    {
      "id": "l8fj7v9",
      "body": "Indeed. 💪🏻",
      "created_utc": 1718289350.0,
      "score": 6
    },
    {
      "id": "l8g3o6d",
      "body": "Thank you. Honestly, that means a lot. Sending you a big hug. 🤍",
      "created_utc": 1718296222.0,
      "score": 5
    },
    {
      "id": "l8g1vbm",
      "body": "I KNOW. I just look at her and it makes me feel better",
      "created_utc": 1718295624.0,
      "score": 5
    }
  ]
}