{
  "id": "1hn1qn6",
  "title": "Someone stranger sat with me through the car wash",
  "selftext": "My cars covered in salt so I decided to go through a touchless car wash like I have many time before. But as I was waiting something happened with some car in the other line and he looked to be stuck, then I started to panic because what if my car gets trapped in the car wash. It was my time to go, I had cars behind me, I paid and I just couldn't do it. So I got out of my car and asked the car behind me if I they could back up and let me leave as I was having a panic attack and that they could have my paid car wash is they wanted. Turns out it was a mother and her teenage son and immediately this mom is like \"would you like me to go in the car wash with you if that would make you feel better?\" and as I was holding up the line I said sure and so she had her son drive her car and she hopped in my tiny two seater miata, and just sat and talked to me while I drove through the car wash. We just talked about Christmas and she was telling me how she had to sell her house and how her son liked my car and I'm just sitting there shaking like a leaf. And soon enough the car wash was over, we survived, my car didn't break down, and I dropped her back off with her son.\n\nOne of the most wholesome experiences of my life. \n\nIm going to try to find her on my towns Facebook page, try and give her some grocery and car wash money for the trouble. ",
  "created_utc": 1735257537.0,
  "score": 2497,
  "num_comments": 40,
  "url": "https://www.reddit.com/r/Anxiety/comments/1hn1qn6/someone_stranger_sat_with_me_through_the_car_wash/",
  "comments": [
    {
      "id": "m3ysbm4",
      "body": "Stories like this remind me that there are truly kind strangers out there. What a wonderful thing to do for someone who is in full panic mode.",
      "created_utc": 1735263341.0,
      "score": 640
    },
    {
      "id": "m3yjc79",
      "body": "You need to at least give her a shout out. That was adorable of her.",
      "created_utc": 1735259975.0,
      "score": 385
    },
    {
      "id": "m3z1fat",
      "body": "That's really sweet. Sometimes strangers do the simplest things that you never forget. My first flight had really bad turbulence at takeoff and I got motion sick, and I somehow got seated like 7 rows in front of my bf at the time. An older lady next to me offered to let me hold her hand because she could see I was nervous when we started to take off, and then she got me pretzels to settle my stomach and insisted that she could take my sick bag and get rid of it for me even though I protested. That lady probably doesn't even remember any of this but I always will.",
      "created_utc": 1735266858.0,
      "score": 103
    },
    {
      "id": "m3ytdn6",
      "body": "That’s honestly such a beautiful random act of kindness, really restores faith in humanity!",
      "created_utc": 1735263739.0,
      "score": 54
    },
    {
      "id": "m3z9vym",
      "body": "The title made me think I'd be reading a scarey story, but your experience was wholesome af 🥰\n\nGood luck finding your car wash buddy.",
      "created_utc": 1735270226.0,
      "score": 37
    },
    {
      "id": "m3zsbpa",
      "body": "If we only knew more people would be like this, I bet we wouldn't even have much panic, because we'd feel less isolated, safer, cared about. What a world that would be, eh?",
      "created_utc": 1735278565.0,
      "score": 26
    },
    {
      "id": "m3z811g",
      "body": "Thank you for sharing this, there are still kind people in the world.",
      "created_utc": 1735269472.0,
      "score": 15
    },
    {
      "id": "m40gye8",
      "body": "Angels come disguised. god bless.",
      "created_utc": 1735294112.0,
      "score": 9
    },
    {
      "id": "m41fph5",
      "body": "That’s a great story thank you for sharing. FWIW i think a thank you card would be wonderful and deeply appreciated, but I don’t think anything of monetary value is required. She might also like to know that you shared the story here.",
      "created_utc": 1735311649.0,
      "score": 7
    },
    {
      "id": "m43jgoz",
      "body": "What a beautiful moment! I can't go through car washes by myself; I have panic attacks as well. Last time, my mom drove, and I was in the passenger. I don't think my car has been washed since last October.\n\nWhen I went to get my first dose of the covid vaccine, it was at our town's big event space where conventions are usually held. I was already a nervous wreck from driving there (anxious driver, and I don't go to that side of town much), and then the sheer number of people in line was making me jittery. On top of that, I have a horrible fear of needles, so I was almost in tears; I was stuck between being frozen and bolting out of there. There was an older lady behind me in line who asked if I was okay, and I managed to talk to her. She said her son was about my age and also scared of shots. When we got up to the front, she asked to sit across from me while she got hers, and she held my hand the whole time. I've never met a stranger like her and I'm so grateful to her for taking the time to calm me down.",
      "created_utc": 1735336272.0,
      "score": 4
    },
    {
      "id": "m437txg",
      "body": "That's a very sweet story 💜 and for what it's worth, I work at a carwash and we see people have panic attacks all the time! I work here and going through to get my free one is STILL scary! Expecially if the wash is having problems or someone drives up on the rails and gets stuck! Mom's can be the best! Even when they aren't our own!",
      "created_utc": 1735332473.0,
      "score": 3
    },
    {
      "id": "m43k27u",
      "body": "an empathetic mother who happen to also know how to help in this situation, what a rare finding, thanks for sharing this wholesome story.",
      "created_utc": 1735336465.0,
      "score": 3
    },
    {
      "id": "m42blxw",
      "body": "Wow this is so nice and wholesome 🥰",
      "created_utc": 1735322140.0,
      "score": 2
    },
    {
      "id": "m43k89r",
      "body": "This is nice to read.",
      "created_utc": 1735336520.0,
      "score": 2
    },
    {
      "id": "m43vhm8",
      "body": "That’s awesome! Sad that it needed to be done, but awesome that someone cared enough to hop in a car with a complete stranger to help them overcome a panic attack. Sorry OP you had to go thru that. I suffer from panic attacks I’ve been blessed (not necessarily religious based blessed) to not have had one in months. I hope you find peace.",
      "created_utc": 1735340355.0,
      "score": 2
    },
    {
      "id": "m4511a1",
      "body": "Man I love this so much. We are all humans just trying to get home at the end of the day. Sometimes we need a hug or some words or just someone to make a connection. What a blessing that someone so understanding was there when you needed her.. love that for you!",
      "created_utc": 1735356065.0,
      "score": 2
    },
    {
      "id": "m42qlwn",
      "body": "Aww that’s amazing",
      "created_utc": 1735326895.0,
      "score": 1
    },
    {
      "id": "m45188e",
      "body": "I really hope you find her- she’s a gem!",
      "created_utc": 1735356148.0,
      "score": 1
    },
    {
      "id": "m45krfb",
      "body": "This made me tear up. It’s little moments like that that make me love humans.",
      "created_utc": 1735364961.0,
      "score": 1
    },
    {
      "id": "m45nje9",
      "body": "Awwww....",
      "created_utc": 1735366428.0,
      "score": 1
    },
    {
      "id": "m45nuy2",
      "body": "Ugh. Love this story so much. Thanks for sharing. It can really help our mental wellbeing knowing that people like that exist.",
      "created_utc": 1735366600.0,
      "score": 1
    },
    {
      "id": "m46pnh8",
      "body": "Awww. That was a nice story. ",
      "created_utc": 1735390420.0,
      "score": 1
    },
    {
      "id": "m46ytox",
      "body": "Wholesome!!!",
      "created_utc": 1735394772.0,
      "score": 1
    },
    {
      "id": "m4seysh",
      "body": "I had a woman sit next to me on a plane once and I started having an anxiety attack. She was so sweet and talked to me and helped me through it. I think about her often.",
      "created_utc": 1735696964.0,
      "score": 1
    },
    {
      "id": "m4xxj65",
      "body": "This is beautiful. Thank you for posting!",
      "created_utc": 1735781800.0,
      "score": 1
    },
    {
      "id": "m50y6nc",
      "body": "Lol the title makes it seem like the complete opposite of what actually happened (some scary dude getting in your car). Glad it wasn’t the case",
      "created_utc": 1735834281.0,
      "score": 1
    },
    {
      "id": "mk1j0dz",
      "body": "Honestly, I'm more amazed that you explained your situation to a stranger and let them help. Both those things are hard for me.",
      "created_utc": 1743095254.0,
      "score": 1
    },
    {
      "id": "m4018sk",
      "body": "Some of the most heartwarming memories I have and stories I've heard involve these kinds of people. Example, maybe someone works at a grocery store in the bakery and it's tough. Always is. But, maybe there's a \"Store Mom\" or \"Store Dad\" type who comes in, and when you see that person as you clock in for the shift, you know they got your back.\n\nThe people who ask \"how are you doing,\" and *truly* mean it. It shows. And when you aren't doing well, they *care*. Maybe they don't have all the answers you need, but they have the capacity to empathize with your situation. The types of people who listen instead of just waiting out your sentence so they can start theirs.\n\nWe need MORE of these people. Now more than ever, I say. Good news is, every single one of us can do something to become more like those people. To be helpful and empathetic to others, in turn building character and helping someone. The cycle keeps going. It only ends if we let it.",
      "created_utc": 1735283639.0,
      "score": 80
    },
    {
      "id": "m3yorzp",
      "body": "Definitely. Will probably do it anonymously because its a specific enough story that she would know its about her, but I don't want to out myself and have everyone around town know I'm an anxious little mess.",
      "created_utc": 1735261989.0,
      "score": 189
    },
    {
      "id": "m3yjdmb",
      "body": "I mean if she doesn't let you give her any money",
      "created_utc": 1735259989.0,
      "score": 19
    },
    {
      "id": "m3z2gnd",
      "body": "I got a 5 hour flight coming up in a week and I am petrified. Luckily I'll can probably be sandwiched between my parents and have ativan. .\n\nDid the flight get better at least?",
      "created_utc": 1735267268.0,
      "score": 30
    },
    {
      "id": "m3zs3xo",
      "body": "Talk about going above and beyond!",
      "created_utc": 1735278447.0,
      "score": 1
    },
    {
      "id": "m3zanq6",
      "body": "I can see how you read it that way lol. Like I got car jacked in a car wash. Should've added a little 😊❤️👍 to seal the deal.",
      "created_utc": 1735270538.0,
      "score": 19
    },
    {
      "id": "m45e4sl",
      "body": "Yeah, my own mom always says if I ever have an issue and I'm not with/can't contact my own mom, to find another mom and they can usually replace your own mom if need be. \n\nAlso this makes me feel better. I felt so stupid being scared over a open (only the back door closes so you can drive off, no tracks just a moving arch of hoses, plus the whole side wall is a window) car wash. But my brain was convinced it was like [The Tunnel ](https://youtu.be/KOwKExagzdQ?feature=shared) (don't watch is your scared of tunnels) or something. So it makes me feel better others panic (like I wish they didn't, but at least I'm not alone).",
      "created_utc": 1735361748.0,
      "score": 2
    },
    {
      "id": "m4sflhj",
      "body": "I'm flying on Saturday morning and this made me feel a little better.  \n\nDid you feel a little better after at least? Sometimes when I panic its just kinda like a dam bursting of panic, and onces its over I'm ok.",
      "created_utc": 1735697224.0,
      "score": 1
    },
    {
      "id": "m3z59tj",
      "body": "Yes, and I love flying now! My ex told me that flight had the 2nd worst turbulence he'd ever experienced, and he used to travel for work a lot. I'm very afraid of heights, but for whatever reason flying doesn't scare me at all, I just didn't quite know what to expect that first time.\n\nI also messed up and forgot to take my Dramamine until 20 min before takeoff, so it failed to work in time 🤡 So if you get any type of motion sickness, learn from my mistake haha!\n\nAlso for what it's worth, I fell into a rabbit hole last year that led me to a comprehensive list on Wikipedia of every US plane crash with casualties dating back decades, and they don't really happen anymore here unless it's a little private plane. I was kinda surprised! (If you're outside the US I'm sure it's probably similar)",
      "created_utc": 1735268384.0,
      "score": 10
    },
    {
      "id": "m3zbc13",
      "body": "Amazing coincidence; I was once car jacked in a car wash.\n\nThey got clean away 😊❤️👍",
      "created_utc": 1735270818.0,
      "score": 11
    },
    {
      "id": "m4txref",
      "body": "Yes I felt better. We talked about everything and she showed me pictures of grandchildren on her phone. It was distracting and I eventually felt fine.",
      "created_utc": 1735727204.0,
      "score": 1
    },
    {
      "id": "m3za3lg",
      "body": "Unfortunately I do have to take a little plane but I brought it up in r/fearofflying and every pilot was like \"The Cessna Caravan is like a reliable little mini van.\" I of course also looked up the airlines crash record and while [they do crash](https://aviationweek.com/business-aviation/safety-ops-regulation/splashdown-caribbean-what-happened) quite a bit, they are all chill crashes over shallow waters and nobody dies. \n\nLuckily I'm great at everything else flying wise, no sickness, no headaches, no ear pain. I'm just scared I'll have a panic attack and I am very much a get up and run kind of panicker and don't want to deal with that on a plane. But supposedly I once heard someone said it is   impossible to panic on ativan when it works correctly (can have the stimulating effect on like children and the elderly but it always works great for me) so that fact that may or may not be true makes me feel better.",
      "created_utc": 1735270311.0,
      "score": 7
    }
  ]
}