{
  "id": "1iaodyd",
  "title": "Anyone physically shake when your anxiety spikes?",
  "selftext": "I don't know why, but when my anxiety spikes I start to physically shake like I'm cold or something.\n\nIt sometimes can get quite annoying.",
  "created_utc": 1737921093.0,
  "score": 855,
  "num_comments": 177,
  "url": "https://www.reddit.com/r/Anxiety/comments/1iaodyd/anyone_physically_shake_when_your_anxiety_spikes/",
  "comments": [
    {
      "id": "m9bm90e",
      "body": "Yes I’m like a chihuahua",
      "created_utc": 1737921751.0,
      "score": 254
    },
    {
      "id": "m9blurl",
      "body": "Yes, when my anxiety is at its worst my whole body shakes",
      "created_utc": 1737921639.0,
      "score": 128
    },
    {
      "id": "m9bnkhd",
      "body": "I’m no doctor, but my psychiatrist prescribed me propranolol to stop shaking. Get some intel, and haven’t tried yet.\nShaking is the main reason I can’t get a job :/",
      "created_utc": 1737922134.0,
      "score": 60
    },
    {
      "id": "m9bn2nv",
      "body": "Yep, body shakes and sometimes my teeth chatter. The worst. I try deep breathing to calm my nerves",
      "created_utc": 1737921988.0,
      "score": 30
    },
    {
      "id": "m9bw6gp",
      "body": "Yes, especially during social confrontations or crises! I start feeling like I'm freezing cold, my teeth chatter and I shake aggressively",
      "created_utc": 1737924490.0,
      "score": 23
    },
    {
      "id": "m9blz92",
      "body": "Omg every day, I can mask pretty well but that’s my tell. It’s so embarrassing.",
      "created_utc": 1737921674.0,
      "score": 16
    },
    {
      "id": "m9bmupa",
      "body": "Yep. I have tremors a lot.",
      "created_utc": 1737921924.0,
      "score": 16
    },
    {
      "id": "m9blbeu",
      "body": "To me, it is the only symptom I cannot control as of now. Everything else I learned how to but not the shaking. So I just shake with semi clear mind whenever I am anxious. It’s kinda wild that when I am cold or feverish and shake, it triggers my anxiety because anxiety shakes are very similar.",
      "created_utc": 1737921487.0,
      "score": 14
    },
    {
      "id": "m9bohrx",
      "body": "I had a really bad panic attack last year and shook for three days after it",
      "created_utc": 1737922399.0,
      "score": 8
    },
    {
      "id": "m9bs9po",
      "body": "Yes a constant vibrate. Absolutely cant stand it",
      "created_utc": 1737923433.0,
      "score": 8
    },
    {
      "id": "m9c1yr5",
      "body": "I do and the worst thing are the neck/head tremors. I feel like those stupid bobbing dogs for cars. Always wondering if people around me are noticing it and it makes my anxiety even worse.",
      "created_utc": 1737926069.0,
      "score": 8
    },
    {
      "id": "m9bklti",
      "body": "Yes, this happens to me from the adrenaline rush.",
      "created_utc": 1737921285.0,
      "score": 4
    },
    {
      "id": "m9d8yl3",
      "body": "Yes and as a man it’s why I hate confrontation. When my adrenaline spikes it makes me look like a frightened animal and I look weak.",
      "created_utc": 1737938359.0,
      "score": 5
    },
    {
      "id": "m9ei9dr",
      "body": "I don’t shake, but I’ve gotten so incredibly tense my back hurt (badly).",
      "created_utc": 1737953176.0,
      "score": 6
    },
    {
      "id": "m9bo0gh",
      "body": "Yes, that's normal way body wants to shake off the tension. Unless you are in social situation, just allow this. I know it may sound stupid, but thats better than trying to fight it.",
      "created_utc": 1737922260.0,
      "score": 5
    },
    {
      "id": "m9crb6y",
      "body": "I start feeling really cold and then shaking",
      "created_utc": 1737933102.0,
      "score": 5
    },
    {
      "id": "m9d1f6h",
      "body": "Yes! When it's really bad I shake. I've had my thigh muscles convulse, it was an odd sensation. My sister also has super shaky hands when she's not medicated.",
      "created_utc": 1737936120.0,
      "score": 5
    },
    {
      "id": "m9bld3l",
      "body": "Yes i experienced this for the first time last week and it’s WILD!!!",
      "created_utc": 1737921500.0,
      "score": 3
    },
    {
      "id": "m9btm5y",
      "body": "If I am super anxious, I’ll get tremors. Honestly, sometimes I don’t fight it and just lay on the couch/in bed and let them take over. It’s fine, I am fine and I know it will pass. I actually haven’t had the tremors in a long time but I used to have it quite frequently.",
      "created_utc": 1737923794.0,
      "score": 3
    },
    {
      "id": "m9c8n3s",
      "body": "I usually feel this way AFTER I start calming down from being super anxious. I noticed it at first after talking on the phone with my parents. 😅 Now I know that's what is happening.",
      "created_utc": 1737927842.0,
      "score": 3
    },
    {
      "id": "m9cub9h",
      "body": "Yup. Really bad. I shake constantly at a low amount, only noticeable when I grab say a piece of paper or a slice of pizza. But if I start to panic, I’ll shake so bad it’s my whole body. Legs, torso, head. I’ll lay on the bed in a fetal position trying to stop. It makes my whole body sore. \n\nWell this used to happen. I am on meds now and don’t have panic attacks anymore, but I always have a low amount of anxiety constantly and my hands shake. Been that way since I was a kid. My friends thought I was having a sugar rush lol",
      "created_utc": 1737933983.0,
      "score": 3
    },
    {
      "id": "m9dfp9b",
      "body": "my legs started shaking uncontrollably one night when i was having an anxiety attack 😭",
      "created_utc": 1737940312.0,
      "score": 3
    },
    {
      "id": "m9bzmw8",
      "body": "All mammals shake to release stress. Eg. Dogs and cats do it. Humans can do it too! ✋",
      "created_utc": 1737925429.0,
      "score": 2
    },
    {
      "id": "m9ca1mm",
      "body": "Yes, and cannot stop it all unless i go away from the situation",
      "created_utc": 1737928226.0,
      "score": 2
    },
    {
      "id": "m9cz3jw",
      "body": "For me its kinda weird but my head kinda rocks or shakes back and forth",
      "created_utc": 1737935423.0,
      "score": 2
    },
    {
      "id": "m9dzshl",
      "body": "Shaking hands and chattering teeth. When it's really bad my whole body contorts. After those kinds of attacks I have to sleep for at least 10 hrs.",
      "created_utc": 1737946451.0,
      "score": 2
    },
    {
      "id": "m9eaqih",
      "body": "I get twitches :/",
      "created_utc": 1737950176.0,
      "score": 2
    },
    {
      "id": "m9ecqra",
      "body": "My hand starts twitching as an indicator of my stress.  My hand will get faster and make bigger morions as anxiety rises.  My wife had called it my stress meter.  The funny thing is when my anxiety is off the charts, my hand goes limp.",
      "created_utc": 1737950935.0,
      "score": 2
    },
    {
      "id": "m9eq3ob",
      "body": "I become very anxious while doing presentations, so I write bullet points on a piece of paper to remind myself of what to say. It only works some of the time, though, because I'm often shaking too badly to be able to read the bullet points",
      "created_utc": 1737956753.0,
      "score": 2
    },
    {
      "id": "m9fom6a",
      "body": "Yes and my teeth start chattering as well",
      "created_utc": 1737977016.0,
      "score": 2
    },
    {
      "id": "m9fpbvn",
      "body": "Yes, uncontrollable when really bad",
      "created_utc": 1737977404.0,
      "score": 2
    },
    {
      "id": "m9fqj7g",
      "body": "All the time, when im talking have adrenaline rush in chest",
      "created_utc": 1737978044.0,
      "score": 2
    },
    {
      "id": "m9frfyp",
      "body": "My hands were shaking all the time, my handwriting was illegible. I'm on trintellix now and it's stopped.",
      "created_utc": 1737978510.0,
      "score": 2
    },
    {
      "id": "m9hqzco",
      "body": "Yep! I thought maybe it was just me so I am glad to see this post. I shake like a little chihuahua. It’s like I get the shivers as if I’m cold. Shaking and teeth chattering. It’s AWFUL and so embarrassing if others see. I’ve been able to calm it by wrapping myself in a weighted blanket or just having my husband hold me tight and rub my back.",
      "created_utc": 1738001840.0,
      "score": 2
    },
    {
      "id": "m9blgji",
      "body": "Yes. All the time.",
      "created_utc": 1737921528.0,
      "score": 1
    },
    {
      "id": "m9bmg3h",
      "body": "I struggle greatly with this",
      "created_utc": 1737921807.0,
      "score": 1
    },
    {
      "id": "m9boy66",
      "body": "Yep",
      "created_utc": 1737922530.0,
      "score": 1
    },
    {
      "id": "m9boztu",
      "body": "Yep",
      "created_utc": 1737922543.0,
      "score": 1
    },
    {
      "id": "m9bplhv",
      "body": "Yes",
      "created_utc": 1737922712.0,
      "score": 1
    },
    {
      "id": "m9bpsax",
      "body": "I take remeron and it has helped tremendously. I couldn’t stop shaking before that.",
      "created_utc": 1737922763.0,
      "score": 1
    },
    {
      "id": "m9bpxam",
      "body": "Yes.",
      "created_utc": 1737922798.0,
      "score": 1
    },
    {
      "id": "m9bqn0b",
      "body": "Yes! I also have restless leg syndrome. Doesn't help!",
      "created_utc": 1737922985.0,
      "score": 1
    },
    {
      "id": "m9br4j0",
      "body": "Yes. People hug me and ask me if I’m cold. Nope! I just don’t particularly care for being around large groups of people.",
      "created_utc": 1737923121.0,
      "score": 1
    },
    {
      "id": "m9bu1sd",
      "body": "Yes I tremble really hard for hours",
      "created_utc": 1737923910.0,
      "score": 1
    },
    {
      "id": "m9bvboo",
      "body": "Yes, it feels like my skeleton is vibrating and trying to bust out of my skin.",
      "created_utc": 1737924255.0,
      "score": 1
    },
    {
      "id": "m9bvt22",
      "body": "Yes I get trembly, and I can’t eat either.",
      "created_utc": 1737924388.0,
      "score": 1
    },
    {
      "id": "m9bwlfv",
      "body": "My hands do",
      "created_utc": 1737924607.0,
      "score": 1
    },
    {
      "id": "m9bxvqh",
      "body": "I do sometimes.",
      "created_utc": 1737924961.0,
      "score": 1
    },
    {
      "id": "m9c28vw",
      "body": "That's my Goddamn baseline",
      "created_utc": 1737926143.0,
      "score": 1
    },
    {
      "id": "m9c34sl",
      "body": "Yup, been on 20mg of propranolol for about 1 2/2 years, daily. Game changing and it’s pretty damn safe, I’ve experienced zero possible side effects.",
      "created_utc": 1737926382.0,
      "score": 1
    },
    {
      "id": "m9c54m0",
      "body": "Nervous Chihuahua I am",
      "created_utc": 1737926898.0,
      "score": 1
    },
    {
      "id": "m9c5uz4",
      "body": "Yep, fucking annoying.",
      "created_utc": 1737927092.0,
      "score": 1
    },
    {
      "id": "m9c7cuo",
      "body": "Yeah, usually only when I'm alone thankfully, but yes. Usually once a day I shake a lot and a couple times I shake a bit.",
      "created_utc": 1737927492.0,
      "score": 1
    },
    {
      "id": "m9c7xui",
      "body": "I'm doing it right now. The fact that they keep the office 50 degrees fahrenheit doesn't help",
      "created_utc": 1737927649.0,
      "score": 1
    },
    {
      "id": "m9c8bkd",
      "body": "Yep. Currently shaking as I read this.",
      "created_utc": 1737927752.0,
      "score": 1
    },
    {
      "id": "m9cbvcd",
      "body": "I sure do. Not just a little bit, either. Other people can easily observe it.\n\nI don't get out much any more, but when I did, people would sometimes ask me why I was shaking so much. Rather than saying \"none of your business\" I would just say it was a side effect of some medication I was taking. Most people would leave it alone at that point. Some would ask what the medication was, but I wouldn't answer that question.",
      "created_utc": 1737928733.0,
      "score": 1
    },
    {
      "id": "m9cdvz0",
      "body": "Every. Single. Time. People become very concerned when they see me do this but it’s completely normal",
      "created_utc": 1737929305.0,
      "score": 1
    },
    {
      "id": "m9colt3",
      "body": "YES. It feels like I'm vibrating from the inside.",
      "created_utc": 1737932326.0,
      "score": 1
    },
    {
      "id": "m9cs0np",
      "body": "I tremble all day every day from it, even on effexor, but it definitely gets worse when my anxiety goes up. Just a stupid thing I have to learn to live with",
      "created_utc": 1737933309.0,
      "score": 1
    },
    {
      "id": "m9csa19",
      "body": "The only time i'm not shaking is when i'm sleeping 🥲",
      "created_utc": 1737933384.0,
      "score": 1
    },
    {
      "id": "m9cvepu",
      "body": "Yes and my teeth chatter, I have a cold burning feeling, and I feel faint and have to lie down so\nI don’t fall over.  Good times.",
      "created_utc": 1737934310.0,
      "score": 1
    },
    {
      "id": "m9cyf0v",
      "body": "I don't think you have true (not normal) anxiety unless you shake.",
      "created_utc": 1737935215.0,
      "score": 1
    },
    {
      "id": "m9czi7z",
      "body": "Yes, if i have any emotion that feels over the top i start shaking. If it’s anxiety it makes me more anxious cause I’ve had anxiety induced paralysis several times and it always starts with shaking. I go so cold too",
      "created_utc": 1737935539.0,
      "score": 1
    },
    {
      "id": "m9d0mli",
      "body": "Sometimes in my hands, but maybe that’s because im getting old",
      "created_utc": 1737935876.0,
      "score": 1
    },
    {
      "id": "m9d32er",
      "body": "Yep!",
      "created_utc": 1737936608.0,
      "score": 1
    },
    {
      "id": "m9d5fco",
      "body": "i think most ppl here would",
      "created_utc": 1737937289.0,
      "score": 1
    },
    {
      "id": "m9d5t1q",
      "body": "Sometimes",
      "created_utc": 1737937403.0,
      "score": 1
    },
    {
      "id": "m9dfsqu",
      "body": "Yes",
      "created_utc": 1737940342.0,
      "score": 1
    },
    {
      "id": "m9dj4kb",
      "body": "sometimes yea",
      "created_utc": 1737941366.0,
      "score": 1
    },
    {
      "id": "m9dl8nr",
      "body": "yes i do and im so self conscious about it",
      "created_utc": 1737942025.0,
      "score": 1
    },
    {
      "id": "m9dlhfs",
      "body": "Yes and bad",
      "created_utc": 1737942100.0,
      "score": 1
    },
    {
      "id": "m9do3ua",
      "body": "Ohhhh yes. When it's been at its worst (typically during medical tests, as those cause me great anxiety), I've shaken so hard that it's looked like I'm convulsing. It's the one thing that's made medical professionals say \"hey that's concerning, are you okay\" and I get to be like \"yeah actually this is normal\"",
      "created_utc": 1737942923.0,
      "score": 1
    },
    {
      "id": "m9dpd7q",
      "body": "yes it's the worst",
      "created_utc": 1737943311.0,
      "score": 1
    },
    {
      "id": "m9dpvbm",
      "body": "Ugh yes, especially when I’m coming down from an attack. I always just assumed it was the leftover adrenaline causing me to shake.",
      "created_utc": 1737943471.0,
      "score": 1
    },
    {
      "id": "m9dxpx5",
      "body": "Yes. I shake like I’ve been left out in hypothermic conditions, naked. I’m not cold. I just shake uncontrollably. I’ve had anxiety my entire life (31F) but this is a newer symptom for me. I have no idea where they came from but thank god it only happens when I’m in a panic attack or horrific anxiety.",
      "created_utc": 1737945857.0,
      "score": 1
    },
    {
      "id": "m9e0bmt",
      "body": "yes this is one of the most common symptoms",
      "created_utc": 1737946606.0,
      "score": 1
    },
    {
      "id": "m9e4gid",
      "body": "Yeah",
      "created_utc": 1737947927.0,
      "score": 1
    },
    {
      "id": "m9e5mz3",
      "body": "Absolutely, when I get really bad driving anxiety.",
      "created_utc": 1737948334.0,
      "score": 1
    },
    {
      "id": "m9e5y57",
      "body": "yes and for hours",
      "created_utc": 1737948443.0,
      "score": 1
    },
    {
      "id": "m9e7owe",
      "body": "Shake and shiver. If a particularly bad attack ill shiver",
      "created_utc": 1737949063.0,
      "score": 1
    },
    {
      "id": "m9eax03",
      "body": "YES",
      "created_utc": 1737950244.0,
      "score": 1
    },
    {
      "id": "m9ecgpe",
      "body": "Yes, my palms and fingers..not so significantly, but one can see it.",
      "created_utc": 1737950828.0,
      "score": 1
    },
    {
      "id": "m9ed8ye",
      "body": "Yes!!!!!",
      "created_utc": 1737951130.0,
      "score": 1
    },
    {
      "id": "m9eg5y3",
      "body": "Me!",
      "created_utc": 1737952297.0,
      "score": 1
    },
    {
      "id": "m9ejzqe",
      "body": "I always assume it's from the extra adrenaline or whatever other stress hormones, but yeah. Definitely a cue that the situation is bad and I need to regulate/ground. As another commenter mentioned, I also sometimes experience the shakes after the big anxiety spike starts to taper, almost like a paradoxical response. Not sure what that's about. Unpleasant either way, and yeah, often annoying. I try to find humor in it though where possible or just accept it for what it is and ride it out.",
      "created_utc": 1737953923.0,
      "score": 1
    },
    {
      "id": "m9eo222",
      "body": "Yes! It usually starts in my legs and works its way to the rest of my body. Cant stop them either, over time they just stop. It’s annoying, embarrassing, and stresses me out more.",
      "created_utc": 1737955761.0,
      "score": 1
    },
    {
      "id": "m9er1dx",
      "body": "Yes and it’s been constant for a whole week now and my body is so sore and tired and I can’t sleep",
      "created_utc": 1737957216.0,
      "score": 1
    },
    {
      "id": "m9ewuup",
      "body": "Mostly you'll feel palpitations in your heart and hands become sweaty, just try to keep calm, it's only for a limited time, it will pass, in order to overcome this just imagine why it's happening only to you and not anyone else, it's because everything is a mind game, just try to calm yourself and bit by bit try to challenge it, it will then get deleted from your life too.\nStayhard.StayStrong. 🙂",
      "created_utc": 1737960289.0,
      "score": 1
    },
    {
      "id": "m9exu6d",
      "body": "I have full blown \"twitch\" attacks and sometimes randomly yell words involuntarily. It's almost like a tourette's tic is the best way I can describe it.",
      "created_utc": 1737960835.0,
      "score": 1
    },
    {
      "id": "m9ezj8w",
      "body": "[deleted]",
      "created_utc": 1737961798.0,
      "score": 1
    },
    {
      "id": "m9f2rej",
      "body": "Yes. It’s so annoying. I try to be confident in tough situations and then at some point my body abandons me",
      "created_utc": 1737963702.0,
      "score": 1
    },
    {
      "id": "m9f44wu",
      "body": "Oh all the time. Scared my husband to death when we were dating and I just started practically convulsing on his couch",
      "created_utc": 1737964535.0,
      "score": 1
    },
    {
      "id": "m9faacb",
      "body": "I experience a burning sensation instead.",
      "created_utc": 1737968381.0,
      "score": 1
    },
    {
      "id": "m9fjfra",
      "body": "Yup, I literally have to force myself to breath deeply and slowly once I realize it or my neck and back muscles start to cramp from how tense I am. Once got put on muscle relaxers, good times",
      "created_utc": 1737974074.0,
      "score": 1
    },
    {
      "id": "m9fko8p",
      "body": "Yeah especially my hands and jaw that's usually how I know my anxiety is about to go full blown attack I get dizzy to",
      "created_utc": 1737974804.0,
      "score": 1
    },
    {
      "id": "m9fz87q",
      "body": "Same, Like it's bad enough that i am feeling bad myself. Why let others know about it too?",
      "created_utc": 1737982101.0,
      "score": 1
    },
    {
      "id": "m9fzgud",
      "body": "My fingers will spasm. Makes me feel like my body is teeing up a stroke lol",
      "created_utc": 1737982201.0,
      "score": 1
    },
    {
      "id": "m9g83wi",
      "body": "Yeah, adrenaline can do that. I get it sometimes.",
      "created_utc": 1737985549.0,
      "score": 1
    },
    {
      "id": "m9gamr3",
      "body": "Yes, uncontrollably sometimes if the anxiety attack is bad enough.",
      "created_utc": 1737986449.0,
      "score": 1
    },
    {
      "id": "m9gdtgr",
      "body": "When I had my peak worst anxiety times, I had this constant deep tremors going on in my chest, even when sleeping. ",
      "created_utc": 1737987555.0,
      "score": 1
    },
    {
      "id": "m9ghstv",
      "body": "Yes.  I also get a tightness in my chest and have difficulty catching my breath.",
      "created_utc": 1737988884.0,
      "score": 1
    },
    {
      "id": "m9gm48x",
      "body": "A little bit and I'll start talking like I'm cold. Like my teeth will chatter",
      "created_utc": 1737990256.0,
      "score": 1
    },
    {
      "id": "m9gw9nf",
      "body": "Ye all the time. My left hand shakes everyday.",
      "created_utc": 1737993258.0,
      "score": 1
    },
    {
      "id": "m9h533w",
      "body": "Yes. I can shake quite a bit if my anxiety is high, especially if there are other factors like lack of sleep.",
      "created_utc": 1737995764.0,
      "score": 1
    },
    {
      "id": "m9h6s99",
      "body": "I notice I do that sometimes. Especially, when a panic attack is getting too bad.",
      "created_utc": 1737996235.0,
      "score": 1
    },
    {
      "id": "m9h90h3",
      "body": "Yes my fingers tremble.",
      "created_utc": 1737996848.0,
      "score": 1
    },
    {
      "id": "m9h9xk8",
      "body": "Yes. After panic attacks I shake/shiver like I’m cold. Recently, I was on an airplane and it lost cabin pressure so the oxygen masks came out n the whole ordeal, I was SHAKING like a mf. Of course, circumstances fit for the reaction but to answer the question, I shake. Lol",
      "created_utc": 1737997102.0,
      "score": 1
    },
    {
      "id": "m9hb04x",
      "body": "Every time..",
      "created_utc": 1737997404.0,
      "score": 1
    },
    {
      "id": "m9hkzuc",
      "body": "Never occurred to me that this could be an ADHD thing.  \n\nIt's not just anxiety, it's anything that gets me excited.  so frustrating, because it reeks of lack of self confidence!  And it makes it difficult for me to talk in a calm manner.",
      "created_utc": 1738000185.0,
      "score": 1
    },
    {
      "id": "m9ho9em",
      "body": "Yes terribly",
      "created_utc": 1738001084.0,
      "score": 1
    },
    {
      "id": "m9hphfs",
      "body": "Yes. Especially as I'm getting older. Had nerves of steel back when I was younger. Now, when things get really serious, I find myself shaking. Mainly my arms and hands. Sometimes even my legs. I account some of it to PTSD.",
      "created_utc": 1738001424.0,
      "score": 1
    },
    {
      "id": "m9hwp2g",
      "body": "I do",
      "created_utc": 1738003414.0,
      "score": 1
    },
    {
      "id": "m9hxgpv",
      "body": "Yes ",
      "created_utc": 1738003628.0,
      "score": 1
    },
    {
      "id": "m9ii2vg",
      "body": "yess, and my teeth chatter and lock up i feel like i can barely move",
      "created_utc": 1738009406.0,
      "score": 1
    },
    {
      "id": "m9ir4nl",
      "body": "I start coughing",
      "created_utc": 1738011958.0,
      "score": 1
    },
    {
      "id": "m9ixpsn",
      "body": "yup! when i have bad panic attacks i shake uncontrollably and my teeth start chattering a lot",
      "created_utc": 1738013787.0,
      "score": 1
    },
    {
      "id": "m9iyonx",
      "body": "Yep, me . Sometimes the physical symptoms begins before the actual mental anxiety.\nI have to run and take my propranolol for relief.",
      "created_utc": 1738014058.0,
      "score": 1
    },
    {
      "id": "m9iyphk",
      "body": "i do, most of the time. i also experience cold flashes then heart palpitations. but the worst thing was when i felt like i couldn't breathe and my head felt so light 😔\n\noh lemme add, when my anxiety hits off the roof, i also have bad sciatic nerve pain and it felt like my legs/thighs were being sliced and I couldn't stand straight and it lasts for 2-3 minutes 🥲",
      "created_utc": 1738014064.0,
      "score": 1
    },
    {
      "id": "m9j4ux9",
      "body": "Yes",
      "created_utc": 1738015795.0,
      "score": 1
    },
    {
      "id": "m9jf2jr",
      "body": "yes my arms and my legs go crazy.",
      "created_utc": 1738018794.0,
      "score": 1
    },
    {
      "id": "m9jhi35",
      "body": "Yup. I have full body tremors that don’t go away easily when my anxiety is high",
      "created_utc": 1738019547.0,
      "score": 1
    },
    {
      "id": "m9jos72",
      "body": "Yes. Shook on a plane once the FA thought I was having a seizure lol",
      "created_utc": 1738021884.0,
      "score": 1
    },
    {
      "id": "m9jwieg",
      "body": "ME TOO! my teeth actually CHATTER, it feels really cool but def not worth the anxiety lol.",
      "created_utc": 1738024363.0,
      "score": 1
    },
    {
      "id": "m9k0idt",
      "body": "yep same drives me mad :(",
      "created_utc": 1738025642.0,
      "score": 1
    },
    {
      "id": "m9k7wel",
      "body": "Yep....",
      "created_utc": 1738027999.0,
      "score": 1
    },
    {
      "id": "m9kbse4",
      "body": "I mostly get palpitations and don’t even realize that my breathing is uncontrollable",
      "created_utc": 1738029251.0,
      "score": 1
    },
    {
      "id": "m9kovfk",
      "body": "I use to get these weird head twitches when I was anxious and it was difficult to look people in the eyes when they were happening",
      "created_utc": 1738033557.0,
      "score": 1
    },
    {
      "id": "m9kr1uv",
      "body": "It’s anxiety leaving your body. Anxiety is energy that has to leave eventually. I’m usually exhausted when I am shaky. It’s a sign to me that my body is finally releasing the anxiety, but the crash that comes with the release makes me feel equal frustration. You may want to try some other physical things. There are sensory tubes that you can get on Amazon. They are corrugated and form a circle. There’s a weight inside that rolls around. You can rock them back and forth as a way to self-sooth and get the anxious energy out in a way that feels more productive. They’ve helped me a lot. ",
      "created_utc": 1738034300.0,
      "score": 1
    },
    {
      "id": "m9ks5xw",
      "body": "Yes it's the adrenaline, got on propranolol for it, it has stopped symptoms of shaking and heart racing.",
      "created_utc": 1738034687.0,
      "score": 1
    },
    {
      "id": "m9l7c2q",
      "body": "Yeah I started having attacks fairly recently where I get full body tremors. It really freaked me out the first couple times it happened and I ended up calling an ambulance only to have the paramedics arrive as my anxiety attack was ending. Super embarrassing lol.",
      "created_utc": 1738040626.0,
      "score": 1
    },
    {
      "id": "m9lsim3",
      "body": "Yes. It’s like I have Parkinson’s, it’s so bad. Hard to do my eyeliner and mascara cuz I can’t hold my hands still. Anxiety is such a B",
      "created_utc": 1738051866.0,
      "score": 1
    },
    {
      "id": "m9lukcv",
      "body": "yeah. it sucks because people notice.",
      "created_utc": 1738053161.0,
      "score": 1
    },
    {
      "id": "m9nicdb",
      "body": "Yes, so embarrassing",
      "created_utc": 1738079456.0,
      "score": 1
    },
    {
      "id": "m9ns67w",
      "body": "Yes I shake when I'm nervous",
      "created_utc": 1738082245.0,
      "score": 1
    },
    {
      "id": "m9qianz",
      "body": "Yes & it’s bad. What’s the best meds for this?",
      "created_utc": 1738110089.0,
      "score": 1
    },
    {
      "id": "m9rlfld",
      "body": "Yes, sometimes I start shaking so bad it is almost like a seizure. Freaks me out everytime. I just ride the wave though because afterwards I at least feel less anxious and usually either tired or calm.",
      "created_utc": 1738123022.0,
      "score": 1
    },
    {
      "id": "ma0snc7",
      "body": "Went to doc they put the cuff on went right in panic mode 160 over 115 pulse 120",
      "created_utc": 1738250467.0,
      "score": 1
    },
    {
      "id": "ma96y85",
      "body": "Yea i have more twitching but it was caused by something else (long covid) so i still have twitching even when my anxiety isn’t as bad it just ramps up",
      "created_utc": 1738354390.0,
      "score": 1
    },
    {
      "id": "mehzyd0",
      "body": "Yup took an ambulance ride to the hospital during my first panic attack.  While at the hospital I was cold and whole body was shaking.  Walked out about two hours later.  🙄",
      "created_utc": 1740395088.0,
      "score": 1
    },
    {
      "id": "m9ewz6m",
      "body": "Yeah that happens to me. I always thought I was just cold, especially in restaurants where it happened constantly. I figured out it was anxiety when I realized I could just be like “stop.” And stop shaking until I forgot to stop myself lol. Stopped happening after I worked on my social anxiety and got better with it!",
      "created_utc": 1737960356.0,
      "score": 0
    },
    {
      "id": "m9bx3mh",
      "body": "anyone???? its everyone",
      "created_utc": 1737924747.0,
      "score": -1
    },
    {
      "id": "m9hail7",
      "body": "Chihuahuas are so cute though. But I totally get it.",
      "created_utc": 1737997265.0,
      "score": 8
    },
    {
      "id": "m9cchdk",
      "body": "Drop the chalupa.\n\nIn case you don't know the reference, several years ago Taco Bell had a spokesdog that was a chihuahua. In one of their ads for chalupas, that's what the dog would say. Every time I see a chihuahua, or hear the word, I instantly think, \"drop the chalupa.\" Here is a video of it. [TW: there is a simulated police raid in it](https://www.youtube.com/watch?v=CKO9pf6pxV4)",
      "created_utc": 1737928907.0,
      "score": 3
    },
    {
      "id": "m9c0wfq",
      "body": "Propranolol was a game changer for me…I am on a higher dose 120mg ER once a day.\n\nI used to shake so badly when I would get that adrenaline dump when anxiety spikes…then it was impossible to manage or calm down. \n\nI had many business presentations, interviews, etc. go sour bc I was so physically shaken by anxiety. \n\nIt’s a physiological thing but the propranolol just … made the physical symptoms disappear. And with that, the anxiety is so much more manageable to the point of not even noticing it.\n\nI have also taken a step back while in stressful situations and thought “huh, I’m not freaking out…I feel like I should be, but I’m not…” \n\nAnd that’s a win for me. It’s definitely worth a try!",
      "created_utc": 1737925775.0,
      "score": 36
    },
    {
      "id": "m9bnxsh",
      "body": "Propranolol works great. I'm on it for about 5 days but that's due to alcohol withdrawal I guess. Have to get off of it soon.",
      "created_utc": 1737922239.0,
      "score": 5
    },
    {
      "id": "m9chold",
      "body": "I'm so excited for you to try the propranolol, life changing. Wishing you the best of luck in this journey! I used to shake due to anxiety for HOURS at work.",
      "created_utc": 1737930386.0,
      "score": 2
    },
    {
      "id": "m9f8m79",
      "body": "I also have propranolol for emergency situations. I take 5 or 10mg max and it does wonders. 0 shaking! No side effects, but keep in mind in only blocks physical symptoms. I still feel some adrenaline rushes in my body but it stays inside.",
      "created_utc": 1737967317.0,
      "score": 1
    },
    {
      "id": "m9dq4lc",
      "body": "Omg yes social confrontation is when this shit really blasts off for me. Hard to argue effectively when you’re shaking like a leaf lol",
      "created_utc": 1737943553.0,
      "score": 8
    },
    {
      "id": "m9bn07g",
      "body": "Same",
      "created_utc": 1737921968.0,
      "score": 1
    },
    {
      "id": "m9ivxpb",
      "body": "Do you shake at all times or just sporadically?",
      "created_utc": 1738013292.0,
      "score": 1
    },
    {
      "id": "m9k89py",
      "body": "I think I read something it’s your body’s way to release the energy from the adrenaline. It’s like how a dog shakes when they’re excited. Lean into it and purposely make yourself shake to speed up the process",
      "created_utc": 1738028118.0,
      "score": 1
    },
    {
      "id": "m9iw2tw",
      "body": "what meds did you get on? And you're saying you shake now even when you have a clear mind?",
      "created_utc": 1738013331.0,
      "score": 1
    },
    {
      "id": "m9iw5q7",
      "body": "what was your shaking like before taking it?",
      "created_utc": 1738013354.0,
      "score": 1
    },
    {
      "id": "m9f9noq",
      "body": "Yes this can develop or be a genetic disposition your body doesn't react to cannabinoids the same way as others it sucks theres some scientific mumbo jumbo its like cannabis sensitivity sydrome or something basically your kinda allergic to weed major bummer when it's developed ",
      "created_utc": 1737967979.0,
      "score": 1
    },
    {
      "id": "m9bxj3u",
      "body": "I'm sorry I don't know anyone else with anxiety disorder so I was just wondering.",
      "created_utc": 1737924866.0,
      "score": 4
    },
    {
      "id": "m9f2u81",
      "body": "Any side effects?",
      "created_utc": 1737963748.0,
      "score": 3
    },
    {
      "id": "m9bpthj",
      "body": "Is there a reason you need to stop taking it? It’s great that it’s helping you with alcohol withdrawals, but it can be used for anxiety as well. \nPersonally, when I get really anxious my heart starts racing. I’m talking like resting HR 135 while laying down. It’s not effective for panic attacks, but it helps with daily maintenance of anxiety for me.",
      "created_utc": 1737922772.0,
      "score": 6
    },
    {
      "id": "m9bq2sr",
      "body": "Has your doc ever mentioned Clonidine? It works similarly and is also used to treat both anxiety and withdrawal actually. Might be worth looking into or talking to your doctor about it.",
      "created_utc": 1737922836.0,
      "score": 2
    },
    {
      "id": "m9czahi",
      "body": "What are the wds with Propranolol? Bad as benzos or more like gabapentin? (Which was bad to wd from, too)",
      "created_utc": 1737935477.0,
      "score": 2
    },
    {
      "id": "m9k26wj",
      "body": "When my anxiety is really bad its consistent for up to hours. Recently did a record while going in for a surgery of shaking for solid 3 hours before they put me under. Otherwise, it’s more occasional internal shakes indicating I am getting anxious if I don’t leave the situation.",
      "created_utc": 1738026177.0,
      "score": 1
    },
    {
      "id": "m9jgt4o",
      "body": "Oh yeah I’ll have a clear mind and have a low rumble of a shake, only noticeable at times, mainly in my hands. Worsens when I get anxious. And I’m on a beta blocker, helps my high blood pressure and my anxiety.",
      "created_utc": 1738019331.0,
      "score": 1
    },
    {
      "id": "m9ixy4b",
      "body": "Couldn’t hold a glass of water to my mouth without 2 hands and I’d still spill some…pop the pill, completely steady in about 45 minutes.",
      "created_utc": 1738013851.0,
      "score": 1
    },
    {
      "id": "m9by3ec",
      "body": "no worries I just started my propranolol today i hope anxiety will go away.",
      "created_utc": 1737925017.0,
      "score": 1
    },
    {
      "id": "mbiwroy",
      "body": "Honestly, no side effects worth noting. The relief from not being so physically shaken all the time outweighs any negatives.\n\nFor example, I had a doc appt today and they always take my blood pressure. Just knowing they’re taking it usually increases it (white coat syndrome), but it was near perfect at 122/80.\n\nLove propranolol and don’t see myself discontinuing anytime soon.",
      "created_utc": 1738954513.0,
      "score": 2
    },
    {
      "id": "m9bqb9o",
      "body": "[deleted]",
      "created_utc": 1737922896.0,
      "score": 6
    },
    {
      "id": "m9bshpn",
      "body": "I'm currently on below\n\n\n1. Amitriptyline 12.5mg + Chlordiazepoxide 5mg\n2. Baclofen IP 20mg\n3. Naltrexone 50mg\n4. Multivitamin\n5. Apranol SR 40\n6. Pantoprazole + Domperidone",
      "created_utc": 1737923495.0,
      "score": 2
    },
    {
      "id": "m9e0213",
      "body": "I think the withdrawals are like anxiety symptoms. Racing heart, sweating, nervousness. But nothing as severe as benzo withdrawal.",
      "created_utc": 1737946527.0,
      "score": 3
    },
    {
      "id": "m9jcnfi",
      "body": "Got it. If you took at benzo during this period, did that help at all?",
      "created_utc": 1738018067.0,
      "score": 1
    },
    {
      "id": "m9c0ek2",
      "body": "I've never heard of that I used to take buspirone, but it made my eyelid twitch and just didn't like it.\n\nI'll ask about that.",
      "created_utc": 1737925637.0,
      "score": 2
    },
    {
      "id": "m9br3al",
      "body": "Oh okay, yeah that makes sense to want to know where the issue(s) are stemming from. \nJust know that if you find this beneficial, there’s no shame in taking medication prescribed by your doctor that helps your mental or physical health. Wishing you healing, you got this.",
      "created_utc": 1737923111.0,
      "score": 5
    },
    {
      "id": "m9ed2px",
      "body": "Thanks for responding. It didn't do much for me. I guess that's a good thing...",
      "created_utc": 1737951064.0,
      "score": 1
    },
    {
      "id": "m9jd8o9",
      "body": "I did, it helped at the the time, I’m since off of it. I’ll probably be on propranolol for the foreseeable future, and it even cheap without health insurance, about $15",
      "created_utc": 1738018245.0,
      "score": 1
    },
    {
      "id": "m9lctuy",
      "body": "Propranolol can make your eyelids twitch too. While it controlled my body tremors the eyelid twitching was extremely annoying. Plus I used to suddenly jolt awake in the middle of the night for no reason. Stopped when I got off it.",
      "created_utc": 1738043158.0,
      "score": 1
    },
    {
      "id": "m9elkkk",
      "body": "What was your dosage?",
      "created_utc": 1737954616.0,
      "score": 1
    },
    {
      "id": "m9jdkz1",
      "body": "Thanks. The only thing I've found that seems to settle me is a small dose of Xanax but obviously don't want to continue that if I don't have to. \n\nAlso, did you have much mental anxiety when all this was going or was it solely physical? Any other physical symptoms?",
      "created_utc": 1738018346.0,
      "score": 1
    },
    {
      "id": "m9ldmuh",
      "body": "Yeah side effects suck, but I have to try something. The tremors can be quite annoying and sometimes get in the way of day to day life.\n\nI really don't know 🤷",
      "created_utc": 1738043552.0,
      "score": 1
    },
    {
      "id": "m9lsk3p",
      "body": "The side effects are a gamble and don't happen for all, otherwise it's a pretty good option considering how well it controlled the anxiety physical symptoms.",
      "created_utc": 1738051892.0,
      "score": 1
    }
  ]
}