{
  "id": "1izbtmq",
  "title": "What on gods green earth is wrong with the world where we are going to take away antidepressants?",
  "selftext": "I understand children don't have a choice and parents should be the one making the decisions.....but what about us adults...IF THEY take away antidepressants we are going to have a ton of people offing themselfs and not working and using drugs to cope......anyone else find this disturbing I would not be alive without meds that's helped me become a man.......the world is getting worse and worse day by day my son has ADHD and my oldest takes after his dad and also has MDD",
  "created_utc": 1740648106.0,
  "score": 973,
  "num_comments": 263,
  "url": "https://www.reddit.com/r/Anxiety/comments/1izbtmq/what_on_gods_green_earth_is_wrong_with_the_world/",
  "comments": [
    {
      "id": "mf1m7u8",
      "body": "honestly, if the government takes away anti-depressants, mood stabilizers, anti psychotics, etc. i really think they wouldn’t take them away for long because if any crowd is gonna riot, it’s a bunch of mentally ill people off their medications.",
      "created_utc": 1740649048.0,
      "score": 1493
    },
    {
      "id": "mf21ly6",
      "body": "I don’t think the pharmaceutical companies are going to let that happen",
      "created_utc": 1740657647.0,
      "score": 430
    },
    {
      "id": "mf1scbj",
      "body": "Or the rate of illegal drugs will sky rocket",
      "created_utc": 1740652767.0,
      "score": 154
    },
    {
      "id": "mf1onee",
      "body": "Watch a fuck ton of people riot because they are going through withdrawal and then people offing themselves.",
      "created_utc": 1740650556.0,
      "score": 128
    },
    {
      "id": "mf2mb9u",
      "body": "They can have my Zoloft/Prozac/Xanax when they pry it from my cold, anxiety-riddled fingers.",
      "created_utc": 1740665745.0,
      "score": 89
    },
    {
      "id": "mf2yqnk",
      "body": "Hi, medical student here. I just finished my psychiatry rotation and when I asked my attending about this he said that there's no way in hell this will actually end up happening, mostly because of how profitable these drugs are for Big Pharma. They will protect their own interests and lobby for these drugs to stay in production.",
      "created_utc": 1740669721.0,
      "score": 57
    },
    {
      "id": "mf2k20d",
      "body": "“Just be happy, stop being sad.” 🤬",
      "created_utc": 1740664962.0,
      "score": 45
    },
    {
      "id": "mf4sey9",
      "body": "Who says they're taking away anti-depressants? I don't get it. Was this on major news or some website with conspiracy theories?",
      "created_utc": 1740688379.0,
      "score": 11
    },
    {
      "id": "mf2tf16",
      "body": "It will never happen, this is likely just a scare tactic and red herring while they put actual effort into destroying other parts of the healthcare system. Antidepressants are a multi million dollar industry, no way pharmaceutical companies are going to allow anything to happen. Just some quiet changing of \"donations\" or \"sponsorships\" under the table and this will blow over.",
      "created_utc": 1740668058.0,
      "score": 12
    },
    {
      "id": "mf2cbq1",
      "body": "Don't worry, they are going to cure us by sending a bunch of unmedicated people with ADHD and mood disorders to a commune so we can learn to grow vegetables :)",
      "created_utc": 1740662167.0,
      "score": 45
    },
    {
      "id": "mf43f3m",
      "body": "Of all the things I’m worried about this isn’t one of them. Big pharma won’t allow it and too many govt officials and their families are reliant on them as well.",
      "created_utc": 1740681300.0,
      "score": 9
    },
    {
      "id": "mf22a1q",
      "body": "I said this somewhere recently. This is a fucking stupid idea. You're gonna cut the drugs that manage people's mental illness in the country with the highest civilian gun ownership?\n\nThough... I'm guessing it's all part of the plan.\n\nWith the way pharmacies and doctors already often treat people on controlled substances, it's already easier to just buy drugs on the street. Welcome back 1990s failed war on drugs.",
      "created_utc": 1740657968.0,
      "score": 38
    },
    {
      "id": "mf5u4u5",
      "body": "As a patron of the mental illness buffet, I will leave the country so fast if medication is outlawed.",
      "created_utc": 1740699691.0,
      "score": 8
    },
    {
      "id": "mf23y1n",
      "body": "Don’t put too much stock in what RFK talks about. He’s batshit bonkers, and pharma companies ain’t about to even entertain the notion to get rid of these drugs. Too many rich fuckers stand a chance to lose money and influence.",
      "created_utc": 1740658727.0,
      "score": 23
    },
    {
      "id": "mf3m2gu",
      "body": "It'll never happen. Big pharma controls America right up there with big oil.",
      "created_utc": 1740676406.0,
      "score": 8
    },
    {
      "id": "mf5xxaw",
      "body": "Literally will never happen, big pharma would never allow it.",
      "created_utc": 1740700940.0,
      "score": 6
    },
    {
      "id": "mf27xqp",
      "body": "It’s a profound attack against the stability of our own country to have someone both completely unqualified and inexperienced like this in such an important position. Maybe I can run the Yankees with Costanza too. \n\nThis guy has NO QUALIFICATIONS for his job.",
      "created_utc": 1740660429.0,
      "score": 15
    },
    {
      "id": "mf33l4e",
      "body": "It's never happening, Big Pharma is in bed with both parties.\n\nPay no attention to RFK. The man is only there to babble through the next 4 years.",
      "created_utc": 1740671150.0,
      "score": 19
    },
    {
      "id": "mf3mqek",
      "body": "I don’t think it will go through. Antidepressants are a billion-dollar industry with more than 10% of the country on SSRI’s alone. RFK can try, but there’s no way pharmaceutical companies won’t go down without a lengthy fight and legal challenges.",
      "created_utc": 1740676592.0,
      "score": 5
    },
    {
      "id": "mf4mt3h",
      "body": "they're not going to, pharmaceutical execs are their friends and they make boatloads of money off of psychiatric drugs.",
      "created_utc": 1740686779.0,
      "score": 4
    },
    {
      "id": "mf6j5um",
      "body": "Why do people think this is going to happen? There's nothing so far that indicates they plan to ban psychiatric drugs.",
      "created_utc": 1740708144.0,
      "score": 8
    },
    {
      "id": "mf31lv7",
      "body": "[deleted]",
      "created_utc": 1740670579.0,
      "score": 5
    },
    {
      "id": "mf37uz1",
      "body": "Money rules the world. As long as someone can make money off of prescription drugs they are not going anywhere.",
      "created_utc": 1740672380.0,
      "score": 4
    },
    {
      "id": "mf4golw",
      "body": "The pharmacuetical industry is a billion dollar empire. They spend millions annually on lobbying politicians, healthcare professionals and advertisements. It’s not going anywhere.",
      "created_utc": 1740685056.0,
      "score": 5
    },
    {
      "id": "mf5bl8f",
      "body": "And if you think THEY won’t get their medications - you’re mistaken. They will also get their abortions. Wonder if everyone who voted for them knows that",
      "created_utc": 1740693836.0,
      "score": 4
    },
    {
      "id": "mf1pjk1",
      "body": "What country does this relate to? I Googled and can't see any definitive answer.",
      "created_utc": 1740651096.0,
      "score": 12
    },
    {
      "id": "mf1mk7q",
      "body": "I don't know where you are getting information that antidepressants are being stopped, but there is no info about this on the internet? I can't imaging any reason the government would do that.",
      "created_utc": 1740649265.0,
      "score": 34
    },
    {
      "id": "mf247gs",
      "body": "i agree with u that the world is getting worse and worse and honestly idk what we can do about it either 😒did the govt say they were going to take them away? i think i missed it",
      "created_utc": 1740658843.0,
      "score": 3
    },
    {
      "id": "mf3dupp",
      "body": "I wrote to Teva (makers of fluoxetine).  They told me they have “no plans to cease production.”  As corporate-happy as the Repubs are, I think the pharm companies would put up a fight if SSRIs are banned.",
      "created_utc": 1740674093.0,
      "score": 3
    },
    {
      "id": "mf6td7y",
      "body": "They’re not going to do it. Too much money.",
      "created_utc": 1740711762.0,
      "score": 3
    },
    {
      "id": "mf758le",
      "body": "out of all their bad ideas, i feel like any that would destroy the profits of a large industry are least likely to be implemented. this is america, after all, and nothing matters more than corporate interests.",
      "created_utc": 1740716200.0,
      "score": 3
    },
    {
      "id": "mf98w50",
      "body": "Who said they are being taken away?",
      "created_utc": 1740753255.0,
      "score": 3
    },
    {
      "id": "mf2aiqc",
      "body": "Do I think prescription drugs are unnecessarily massively over-prescribed, absolutely. \n\nHowever, for the people that do genuinely require them (and there’s many), they are absolutely life saving. \n\nI have SAD depression, pretty severely. I only take antidepressants in the thick of winter, to mentally get through it. Only taking the medication for a few months is my choice, otherwise my doctor would have no problem if I stayed on them year-round. \n\nI also exercise, do light therapy, take vitamins, meditate, eat healthy. I strongly believe natural remedies, are absolutely beneficial in lowering (sometimes eliminating) symptoms.\n\n Western doctors are typically quick to throw a prescription at you, and have you be on your way, when there is so many non-medicated remedies, that can also massively help with symptoms. \n\nUnfortunately you really need to advocate for yourself. However when you’re in the thick of depression, or a mental health crises, that is so fucking hard to do. \n\nIt’s such a complex issue. Eliminating the medications is absolutely dangerous & moronic, but to have a conversation around more strict guidelines, so doctors are not over prescribing, is also a good thing, in my opinion. \n\nIn a perfect world, we’d have free access to psychiatric professionals, who can make proper mental health diagnoses.",
      "created_utc": 1740661463.0,
      "score": 10
    },
    {
      "id": "mf55cs0",
      "body": "They cannot take these away even if they tried. Let’s not get anxious about the impossible.",
      "created_utc": 1740692044.0,
      "score": 5
    },
    {
      "id": "mf23jfr",
      "body": "It’s not going to happen. Fear mongering is what it is",
      "created_utc": 1740658546.0,
      "score": 10
    },
    {
      "id": "mf5wzsw",
      "body": "It's a lie I tell you. Misinformation....stop believing everything you see on the Internet. That does not make it true. I've been hearing crap for years from dumb resources.",
      "created_utc": 1740700634.0,
      "score": 6
    },
    {
      "id": "mf3bip8",
      "body": "They're not taking them away, stop believing everything",
      "created_utc": 1740673430.0,
      "score": 6
    },
    {
      "id": "mf2b91e",
      "body": "This is absolutely NOT going to happen. There's too many groups with too much money at stake here, let alone the sheer medical catastrophe this would cause.\n\nThey could try, and they would fail. They aren't sending out 2 million soldiers to personally monitor pharmacy and doctor behavior.\n\nThis just will not happen.",
      "created_utc": 1740661750.0,
      "score": 2
    },
    {
      "id": "mf48r2v",
      "body": "Since this is the anxiety reddit (and many of us lived through Trump 1.0), my best advice is to act on things that actually happen. Trump and his cronies constantly say batshit insane stuff! It's designed to scare us, keep us disoriented, and keep us from getting organized. For our own mental health, we cannot spend every hour worrying about what could happen. I know this is easy to say, but I promise if you try to focus your new consumption and outrage, it does help.",
      "created_utc": 1740682800.0,
      "score": 2
    },
    {
      "id": "mf8xf51",
      "body": "Nobody is going to take away antidepressants. Calm down",
      "created_utc": 1740749323.0,
      "score": 2
    },
    {
      "id": "mf31wfz",
      "body": "Reading partisan news is bad for anxiety :-) At least what I understood RFK Jr is saying at face value is that all kind of medicines are overused instead of prevention, especially for kids. With the idea being that people go to boot camps and meditation retreats to get better and insurance should cover some of those as an alternative to meds. Which is over optimistic in terms of effectiveness, but also not harmful as an addition choice. Now, this *could* be a dogwhistle for \"ban the meds and drag them away to camps\" but I don't see evidence for claims made by networks like CNN. Certainly hope not, I am on a couple of meds dude is not a fan of.",
      "created_utc": 1740670665.0,
      "score": 6
    },
    {
      "id": "mf55g4w",
      "body": "It's all b.s. Just chill. I used to scare myself with all this mess and years later I still take meds. Why don't they just take all the pharma down? lol",
      "created_utc": 1740692070.0,
      "score": 5
    },
    {
      "id": "mf354ml",
      "body": "At least link an article or something before just saying a thing that probably isn't true.",
      "created_utc": 1740671593.0,
      "score": 3
    },
    {
      "id": "mf31xcu",
      "body": "I could be wrong, but I don't think there is much to be concerned about. There has been a whole lot of research put into developing psych meds, and there is empirical evidence that they are effective. As others have said, too, pharmaceutical companies won't stand for having huge chunks of their revenue eliminated. After all, they are some of the people that get the best politicians money can buy.",
      "created_utc": 1740670672.0,
      "score": 3
    },
    {
      "id": "mf2gbrv",
      "body": "are bros tryna kill me⁉️😭🙏",
      "created_utc": 1740663647.0,
      "score": 2
    },
    {
      "id": "mf4a4to",
      "body": "We already have a ton of people offing themselves and not working and using drugs to cope.",
      "created_utc": 1740683196.0,
      "score": 2
    },
    {
      "id": "mf4qqaz",
      "body": "Can I get a bit more info on this? I’m so confused… the US government is taking away anti depressant now?",
      "created_utc": 1740687899.0,
      "score": 2
    },
    {
      "id": "mf304wm",
      "body": "I’m out of the loop, what’s going on??",
      "created_utc": 1740670142.0,
      "score": 1
    },
    {
      "id": "mf3word",
      "body": "If they do this they will have major issues. I myself am a vet with mental health issues and sometimes it feels like Iam just barely managing even with antidepression and other medications. I am able to handle things for the most part as I stay fairly secluded, rarely got out more than a five minute drive from my home, and use other little things to help manage my issues with PTSD, and Anxiety. But there are a lot of vets that have worse symptoms than mine and may need even more help through medication than I.",
      "created_utc": 1740679385.0,
      "score": 1
    },
    {
      "id": "mf4x0ze",
      "body": "What?! Who’s taking them away?!",
      "created_utc": 1740689685.0,
      "score": 1
    },
    {
      "id": "mf6tz5n",
      "body": "if they take away my mood stabilizers i’m not sure i will survive :(",
      "created_utc": 1740711981.0,
      "score": 1
    },
    {
      "id": "mf80k75",
      "body": "There’s gotta be more to it. Maybe be a lot more strict with doctors on who they are prescribing to? Similar to any controlled substance. They CANT take any people life saving meds.",
      "created_utc": 1740732286.0,
      "score": 1
    },
    {
      "id": "mf824rm",
      "body": "This is the first I have heard of this. I would not be alive without my antidepressants, and I will not be if they take them away. My hope is that will be too much pushback from various groups for this to actually happen",
      "created_utc": 1740733299.0,
      "score": 1
    },
    {
      "id": "mf8kguq",
      "body": "if my anti-panic meds go buh-byes, i will cry. i need those to function every day or i’d be having a panic attack every hour",
      "created_utc": 1740743998.0,
      "score": 1
    },
    {
      "id": "mf3rpj2",
      "body": "well, a bunch of dimwits with no idea how science works are now in total control of the US government. They plan to shape this country into a 3rd world dictatorship. We have to stand up to them en mass.",
      "created_utc": 1740677989.0,
      "score": 1
    },
    {
      "id": "mf69my8",
      "body": "The way i see it is they want to take away our meds and unrestrict guns so we fucking kill each other and ourselves and give out \"thoughts and prayers\" in the aftermath.",
      "created_utc": 1740704843.0,
      "score": 1
    },
    {
      "id": "mf7eohh",
      "body": "nobody is taking away anti-depressants, that's a conspiracy theory.",
      "created_utc": 1740720276.0,
      "score": 1
    },
    {
      "id": "mf1vo82",
      "body": "I understand wanting to cut them down as they are over prescribed, but there are always people that will need them.\nIf they were to blanket stop them, it couldn't be sustained. There would be suicides.",
      "created_utc": 1740654677.0,
      "score": 0
    },
    {
      "id": "mf1zscz",
      "body": "For some reason, it's not letting me quote your post. When you stated that there are going to be people offing themselves without their meds, that's what the current regime is hoping for. \n\nThink about it, take away Medicare and people's ability to get adequate medical coverage, and then take away medications from people who need them and BOOM population control.",
      "created_utc": 1740656840.0,
      "score": -1
    },
    {
      "id": "mf4c9ra",
      "body": "Rooting for big pharma on this one",
      "created_utc": 1740683805.0,
      "score": 1
    },
    {
      "id": "mf4iok6",
      "body": "Who is taking away antidepressants? I don’t watch the news so",
      "created_utc": 1740685613.0,
      "score": 1
    },
    {
      "id": "mf4urdo",
      "body": "If they want to increase the load on emergency medical care 10 fold, good fucking luck. Between the people off their meds and the overworked, under staffed, and under funded medical providers, they’re going to have some serious riots occurring ☠️ they are already over capacity in most psych units in hospitals and outpatient clinics, this will just tip everything over the edge -someone who works in the medical system",
      "created_utc": 1740689049.0,
      "score": 1
    },
    {
      "id": "mf8kwpc",
      "body": "It’s just fear mongering",
      "created_utc": 1740744210.0,
      "score": 1
    },
    {
      "id": "mf61s21",
      "body": "The cruelty is the point.",
      "created_utc": 1740702218.0,
      "score": 0
    },
    {
      "id": "mf8x8p9",
      "body": "Last time, I assumed that y'all were just misguided. I gave you the benefit of the doubt, but this time you knew what you were getting and you voted for him anyway (or didn't bother to vote at all), so I can't. I know it's not all of you, but at this point, I have to assume that this is really who you are as a people. I still don't entirely believe it, but I have stopped assuming that you can ever be reasonable, trustworthy, or even coherent. If your goal was to stop us from relying on you to fix all of our problems, well done; you achieved that (maybe). If your goal was literally anything else, WTF, America? WTF...",
      "created_utc": 1740749259.0,
      "score": 0
    },
    {
      "id": "mf2v3zx",
      "body": "It’s wild that they think taking away medications that keep people stable and regulates their emotions is a good idea.",
      "created_utc": 1740668597.0,
      "score": 0
    },
    {
      "id": "mf3vh8e",
      "body": "So much for the land of free choice",
      "created_utc": 1740679044.0,
      "score": 0
    },
    {
      "id": "mf44wls",
      "body": "I believe the cruelty is the point with these folks making decisions (corporations and billionaires). The less people who need help, the better in their eyes for a few reasons. I won't say more on that bc it's not supportive. Solutions like calling our representatives on a regular basis to keep them accountable... that's something many of us can do, even with phone anxiety. Be nice to the interns who answer the phones. 5Calls might be helpful. Writing to them helps too.",
      "created_utc": 1740681721.0,
      "score": 0
    },
    {
      "id": "mf42e9v",
      "body": "I truly don’t think I’ll survive without antidepressants. Like I genuinely think my SH tendencies will come roaring back the second I stop taking them. \n\nIg that’s what they want, huh?",
      "created_utc": 1740681008.0,
      "score": -1
    },
    {
      "id": "mf5d3zs",
      "body": "I feel like that's the plan. They want instability",
      "created_utc": 1740694292.0,
      "score": -1
    },
    {
      "id": "mf86cuq",
      "body": "No one is taking them away—yet. For now, it’s just an idea being explored, but citizens must pay attention and get involved. While we’re all busy with work and family, we still need to stay informed, vote, and contact our local representatives as necessary.",
      "created_utc": 1740735984.0,
      "score": -1
    },
    {
      "id": "mf3a3tv",
      "body": "ADHD/ADD meds are FAR over prescribed. And for those on it there should be  constant effort through therapy to get them off of it. Same with benzos. Yes people need it but no one should be on amphetamine for like 20 years.",
      "created_utc": 1740673026.0,
      "score": -5
    },
    {
      "id": "mf1zoh7",
      "body": "Might not be a bad idea to wean people off of antidepressants and use more natural approaches. But everyone wanted to criticize big pharma for the same reasons and now it's a problem. Just saying, we've been pumped with drugs that deliver more side effects than they actually help. People go through yrs of bouncing from cocktail to cocktail of drugs trying to find the \"right one\" and still fly off the hinges. \nI dig the concern but healthy alternatives wouldn't be bad.. I can't speak on wellness farms and stuff because it hasn't occurred but maybe start trying to find natural ways as well rn because they do exist. Big Parma don't want you alive either. Don't forget that bit while the world is hating the current administration.",
      "created_utc": 1740656787.0,
      "score": -19
    },
    {
      "id": "mf48pyj",
      "body": "Conservatives are pure evil",
      "created_utc": 1740682792.0,
      "score": -2
    },
    {
      "id": "mf1uju0",
      "body": "Why, because they keep you stuck and do not heal anything. \n\nSo you can't live without them.",
      "created_utc": 1740654044.0,
      "score": -32
    },
    {
      "id": "mf1rssu",
      "body": "That’s why they also wanna round us all up to send to “wellness farms”.",
      "created_utc": 1740652446.0,
      "score": 465
    },
    {
      "id": "mf35cin",
      "body": "I take a bunch of shit including anti depressants and anti psychotics. Off my meds I’m a deranged lunatic with anger problems.",
      "created_utc": 1740671657.0,
      "score": 40
    },
    {
      "id": "mf4096d",
      "body": "Take away everything from a person and make them suicidal.  There going to be one or two with nothing to lose and a list of names.",
      "created_utc": 1740680404.0,
      "score": 27
    },
    {
      "id": "mf2crla",
      "body": "Hate to say it but I think violence is what they want.",
      "created_utc": 1740662335.0,
      "score": 73
    },
    {
      "id": "mf3aqgc",
      "body": "Yeah legit if they take away my antidepressants and my suicidal ideations come back I will turn them into homicidal ideations out of spite",
      "created_utc": 1740673207.0,
      "score": 24
    },
    {
      "id": "mf3m4x7",
      "body": "Maybe that’s the plan. Martial law",
      "created_utc": 1740676425.0,
      "score": 9
    },
    {
      "id": "mf2f39i",
      "body": "LETS PARTY!!!!!",
      "created_utc": 1740663201.0,
      "score": 4
    },
    {
      "id": "mf3dmqm",
      "body": "Count me in if they take my meds away.",
      "created_utc": 1740674031.0,
      "score": 3
    },
    {
      "id": "mf4ick4",
      "body": "Yep. It’s absolutely not going to happen. Carry on.",
      "created_utc": 1740685520.0,
      "score": 2
    },
    {
      "id": "mf65p5a",
      "body": "On the contrary, the present government would be pleased with this result as it is for control.",
      "created_utc": 1740703512.0,
      "score": 2
    },
    {
      "id": "mf80xuo",
      "body": "Especially since they already closed all the mental institutions. Thanks George W.",
      "created_utc": 1740732531.0,
      "score": 1
    },
    {
      "id": "mf46tgz",
      "body": "Never thought I’d be on the same side as Big Pharma, but here we are.",
      "created_utc": 1740682260.0,
      "score": 153
    },
    {
      "id": "mf2c2m5",
      "body": "This.  I'm not too concerned just yet because those companies are so powerful.",
      "created_utc": 1740662070.0,
      "score": 158
    },
    {
      "id": "mf2g996",
      "body": "can you give me an example of when the industry has protected a class of drugs like this?\n\ni’m not optimistic. The technocrat billionaires (the ones mostly lurking in the shadows still, not really even discussing that south african guy) are fascists that would probably rather get rid of us, and a lot of the christian right (the workforce in DC) doesn’t fully believe mental illness and neurodivergence are even real at all. I just don’t know what lobbying can do in this situation.",
      "created_utc": 1740663622.0,
      "score": 22
    },
    {
      "id": "mf3pdxm",
      "body": "Yeah I don’t live in the US but it’s honestly on time where I’m on the side of big pharma and glad they have the power they do. It’s absolutely not going to happen.",
      "created_utc": 1740677334.0,
      "score": 1
    },
    {
      "id": "mf4dk5p",
      "body": "My first call was to Teva!",
      "created_utc": 1740684171.0,
      "score": 1
    },
    {
      "id": "mf2492b",
      "body": "black market, think we all heard this one before",
      "created_utc": 1740658863.0,
      "score": 35
    },
    {
      "id": "mf62ul5",
      "body": "[deleted]",
      "created_utc": 1740702570.0,
      "score": 3
    },
    {
      "id": "mf1rnwi",
      "body": "Hyperbole here but what if it was another way for them to create a class of people perfect for just throwing in jail.",
      "created_utc": 1740652364.0,
      "score": 64
    },
    {
      "id": "mf2kscd",
      "body": "My spouse is on a cocktail of antidepressants and ADHD drugs. I’ve honestly got no idea what I can do to help her if she gets those ripped away. It’d be catastrophic",
      "created_utc": 1740665219.0,
      "score": 27
    },
    {
      "id": "mf3yra4",
      "body": "They don’t need to worry about the suicides.\n\nThey need to worry about the murder-suicides.\n\n☺️",
      "created_utc": 1740679979.0,
      "score": 17
    },
    {
      "id": "mf5ayej",
      "body": "It's well researched and reviewed that tapering off is fine for anyone who wants to cease use of SSRIs. In fact a strong term I just saw and that I wouldnt mind seeing more in argument of policies that contract widespread medical advice is that it's a 'medical best practice.'\n\n\nWith that said the quality of life of millions of people would directly and drastically suffer for no fucking reason other than some dumb power obsessed blow hard said so.\n\n\nThis is from a blow hard that speaks exactly like someone who's never had to struggle or fight or be crushed or win against mental illness and the stigmas that society places on it. Someone who's never deeply empathized with or supported a person who has. Also someone who's not medically trained or qualified to speak about medicine or psychology and is irresponsible enough to do so anyway.\n\n\nFighting and having the right to succeed in the fight for a somewhat normal, dignified, and peaceful life is what this is about. Absolutely people should riot about anyone trying to shame that, show misunderstanding or no understanding about that, or take it away.",
      "created_utc": 1740693646.0,
      "score": 7
    },
    {
      "id": "mf5aysz",
      "body": "They'll label them as bad as cocaine and the right will start a campaign against drug addicts all falling the veil of the same stigma as hard drugs, this is all in project 2025 its all for a Christian nationalist state",
      "created_utc": 1740693650.0,
      "score": 1
    },
    {
      "id": "mf2p5g3",
      "body": "Right me aswell",
      "created_utc": 1740666680.0,
      "score": 15
    },
    {
      "id": "mf63f9e",
      "body": "Don't threaten them with a good time.",
      "created_utc": 1740702760.0,
      "score": 1
    },
    {
      "id": "mf8kna6",
      "body": "this but lexapro.",
      "created_utc": 1740744084.0,
      "score": 1
    },
    {
      "id": "mf2rely",
      "body": "“Thanks, RFK! I’m cured!” /s",
      "created_utc": 1740667414.0,
      "score": 15
    },
    {
      "id": "mf5swt1",
      "body": "Tried that. Relapsed on meth. Oops. Maybe I should've kept taking my mirtazapine but I got tired of the sexual side effects. Now I'm single and honestly don't give AF about any sexual side effects. My ability to be a functional human being with emotions matters more.",
      "created_utc": 1740699284.0,
      "score": 3
    },
    {
      "id": "mf7ruvg",
      "body": "“Taking away anti depressants” is definitely a stretch at this point but there are some concerning things taking place to be aware of. \n\nhttps://www.nbcnews.com/news/amp/rcna192722\n\nBut as others have pointed out… SSRIs make too much money so pharmaceutical companies will not allow much to happen I’m sure.",
      "created_utc": 1740727049.0,
      "score": 3
    },
    {
      "id": "mf4u4x0",
      "body": "There trying to say that psych meds are bad for people and as addictive as HEROIN",
      "created_utc": 1740688873.0,
      "score": 1
    },
    {
      "id": "mf4tnrp",
      "body": "Lookup rfk jr",
      "created_utc": 1740688736.0,
      "score": -4
    },
    {
      "id": "mf3019z",
      "body": "I hope so. I worked for someone who was totally overmedicated. Their dr put them on the max of a few medications. This person needs therapy, badly, and refuses to go,and her Dr keeps just doing whatever she says. (Shame on that dr. I go to the same office, different dr thankfully).\nYet myself and others take them and they work, they help us be as human and \"normal\" feeling as we can be. I got prescribed Xanax and as much as I really need it and it really, really works, I asked my Dr not to prescribe it bc several members of my family have issues with major addiction and I do not want that to happen to me.\nI hope they just are careful with it, like how they should handle opiods instead of just prescribing them to anyone like they have to people I've known in big amounts and having people hooked.",
      "created_utc": 1740670112.0,
      "score": 2
    },
    {
      "id": "mf2yoop",
      "body": "And lemme tell you; if there’s one activity that’ll get the ol’ ADHD brain a movin’, oh yeah, it’s gonna be fuckin’ farming.",
      "created_utc": 1740669705.0,
      "score": 19
    },
    {
      "id": "mf3h4dm",
      "body": "Which honestly sounds kind of nice (as an *option*), if the living conditions aren't miserable, but that seems extremely unlikely. It would be nice to live in a small community that is tight enough that everyone works together, rather than for themselves alone.",
      "created_utc": 1740675014.0,
      "score": 6
    },
    {
      "id": "mf45c8d",
      "body": "Idk about you but my mind don't stop thinking about everything",
      "created_utc": 1740681843.0,
      "score": 0
    },
    {
      "id": "mf6wjs8",
      "body": "I'd like to congratulate drugs for winning the war on drugs. If only the US has great example from relatively recent history that shows how prohibiting popular drugs doesn't make people stop using them, but does promote higher purity/potency variants to emerge in black markets run by violent organized crime? If only they saw how crime dropped following the legalization of said drug as people were able to buy it legally once again? Along with health outcomes becoming less severe as they were able to regulate contamination to prevent accidental poisoning that can be the result of residual chemicals from the process of making it? If only addiction rates actually went down as it became easier for the casual user to purchase less strong/concentrated versions of the drug instead of the highly pure and dangerous forms that were being traded by the gangs because it was easier to transport more potent products as you get more effect for the same space, therefore leading to higher profit? \n\nEverything I'm talking about are things that happened during the 1920-1930s during the prohibition era when America tried to ban alcohol. It didn't work to stop people, particularly alcoholics, from drinking but it did make many gangsters very rich while making alcohol more dangerous as there were no regulations forcing them to make sure they properly cut all the methanol from their distillation. It also lead to lower concentration\nBeers and wines becoming much less common, unless made by individuals at home while the gangs focused on high proof spirits as they simply made more money as they could charge more for the higher alcohol percentage for the same sized bottle. What's truly scary but not super shocking is that US government even poisoned illegal alcohol batches in an attempt to scare people into quitting the now illegal drug. It didn't work it just killed a bunch of people, while alcohol remained as popular as it ever was. Another unintentional side effect of criminalizing alcohol was that even kids started to become drinkers of they had the money to buy it. When it illegal there's no law that sets a minimum age for purchases, and drug dealers often don't discriminate for any reason as long as you've got the money to buy it. \n\nThe repeal of prohibition had many positive effects on society not the least of which was the new regulations that meant consumers could know exactly what to expect in each bottle along with allowing the US to make taxes on it, and setting minimum drinking ages so children weren't drinking from an early age. Methanol poisoning incidents became increasingly rare as the government set strict regulations in requirements to be able to legally make, distribute, sell, or serve alcohol by a company. Everyone generally agrees prohibition was an outright failure in respect to alcohol and that repealing it while regulating it was the best move for public health, but for some reason we can't seem to apply the same logic to other drugs that people use recreationally, or even in addictive patterns. Alcoholics aren't thrown in jail simply for the act of drinking alcohol (although they will still be arrested for committing other crimes while drunk. An altered state of consciousness isn't a legal defense\nIf you voluntarily consumed something to alter your mental state.), but if you are an addict of a different\nDrug, one that has been shown by study after study to actually cause less total harm you can be arrested, and in many areas the times in jail are higher than even many violent crimes. Think the guys in Texas who do 10+ years for weed meanwhile the jerk that beats his wife to a pulp gets maybe 8 years max, with 3-5 being shockingly common. Why are stoners punished more harshly than literal wife beaters? In America the reason is unfortunately historical racism. I don't want to explain more cause this comment is already long, but there's some shockingly direct quotes from Nixon's administration that admit to the war on drugs being a cover for racism.",
      "created_utc": 1740712909.0,
      "score": 3
    },
    {
      "id": "mf46dwb",
      "body": "He already on video downplayed the largest measles outbreak we've had in years.",
      "created_utc": 1740682139.0,
      "score": 4
    },
    {
      "id": "mf4ut50",
      "body": "It's crazy we are even talking about this",
      "created_utc": 1740689063.0,
      "score": 0
    },
    {
      "id": "mf7z523",
      "body": "You mean like saying they are? They’ve quite literally said this. One of them (not sure if it was musk or trump) said they would round up all the adhd people take away their meds put them in work camps and force them to do manual labor. So yea we aren’t just making it up, they’ve discussed camps and they have absolutely said they would get rid of adhd and depression medications",
      "created_utc": 1740731392.0,
      "score": 1
    },
    {
      "id": "mf5tjua",
      "body": "I wish weed worked for me. But it causes anxiety so intense it can trigger psychosis.",
      "created_utc": 1740699498.0,
      "score": 3
    },
    {
      "id": "mf1q6f5",
      "body": "My guess is USA going by their recent moves",
      "created_utc": 1740651478.0,
      "score": 23
    },
    {
      "id": "mf1xfcy",
      "body": "USA. I'm living the nightmare. Why RFK Jr is in any position to have any say in healthcare is beyond me .",
      "created_utc": 1740655626.0,
      "score": 16
    },
    {
      "id": "mf1njsj",
      "body": "Start imagining. It's days or at the most, weeks away. You do know what happened with flu shots today, right?",
      "created_utc": 1740649880.0,
      "score": 0
    },
    {
      "id": "mf24apr",
      "body": "i didnt see any info about this either tbh",
      "created_utc": 1740658883.0,
      "score": 3
    },
    {
      "id": "mf1ngke",
      "body": "It's part of that make America healthy again....rfk keeps spouting out that we shouldn't use these meds and antidepressants are as addictive as pain meds?",
      "created_utc": 1740649825.0,
      "score": -3
    },
    {
      "id": "mf312jt",
      "body": "... Did you actually look? RFK keeps saying he's gonna do it",
      "created_utc": 1740670421.0,
      "score": 1
    },
    {
      "id": "mf1y4ia",
      "body": "Google RFK SSRI and you'll see plenty of articles about this. They aren't being stopped (yet?) but RFK has formed his Make America Healthy Again initiative, which Trump made into a commission by EO. Part of the initiative is to take a good hard look at several classes of mental health drugs, including SSRIs, stimulants, and mood stabilisers.",
      "created_utc": 1740655991.0,
      "score": 0
    },
    {
      "id": "mf7evf2",
      "body": "Nobody is taking psychoactive drugs away from people.  It is a liberal taking point.  RFK Jr.s point is that SSRIs and similar mood stabilizing drugs are extremely hard to get off of , once you are on them.  All he is saying is maybe take a step back and look at the environment/ living situation before putting young people on meds that are hell to get off of.  There is no need for all the overacting posts in this thread.",
      "created_utc": 1740720364.0,
      "score": 1
    },
    {
      "id": "mf2ct1w",
      "body": "It's been mentioned in the form of an opinion and wish but no one has even presented this to the roundtable for an actual debate. People were against big pharma for overmedicating since forever ago but now that the current administration is loathed, suddenly big pharma is their friend and trying to save lives.",
      "created_utc": 1740662350.0,
      "score": -4
    },
    {
      "id": "mf2pe5g",
      "body": "It genuinely scares me thinking about it",
      "created_utc": 1740666759.0,
      "score": 3
    },
    {
      "id": "mf56wz6",
      "body": "But. That’s like our favourite thing to do.",
      "created_utc": 1740692514.0,
      "score": 8
    },
    {
      "id": "mf7z6s3",
      "body": "Oh we should not believe actual statements from the White House?",
      "created_utc": 1740731423.0,
      "score": 0
    },
    {
      "id": "mf4eddq",
      "body": "https://www.usatoday.com/story/life/health-wellness/2025/02/18/trump-executive-order-antidepressants-ssris/79066753007/",
      "created_utc": 1740684400.0,
      "score": 0
    },
    {
      "id": "mf4emtl",
      "body": "Yeah but it's gonna get 100x worse guranteed you think it's bad now wait till people can't cope with life and see how dangerous the world will be and watch how drug addiction will increase x50",
      "created_utc": 1740684473.0,
      "score": 1
    },
    {
      "id": "mf4uk3e",
      "body": "I think the plan is pushing marijuana and psychedelics for therapy....and the government will tax it all and take control",
      "created_utc": 1740688993.0,
      "score": 1
    },
    {
      "id": "mf80fsh",
      "body": "There are various quotes from the 2 in the Oval Office about how adhd people should get stimulants taken away and be sent to camps and forced to work (yea they don’t understand adhd at all, all they would be doing is causing hell for whomever would be in charge of keeping them there. \nThe other things they’ve said is basically not approving or retracting approval of antidepressants and birth controls that are on the market. So effectively they would ban them from being sold here with no notice and no concept of what that could do to the people who rely on them. It’s 100% a way to cause chaos, mass slaughter without them every having to aim a gun and fire",
      "created_utc": 1740732209.0,
      "score": 1
    },
    {
      "id": "mf4u9nx",
      "body": "There one step closer with rfk in office",
      "created_utc": 1740688911.0,
      "score": 0
    },
    {
      "id": "mf5nxxo",
      "body": "Media fearmongering is all. Pay no heed.",
      "created_utc": 1740697649.0,
      "score": 3
    },
    {
      "id": "mf83r4t",
      "body": "Which alot of us can't afford to go to therapy we have been on these meds for years and our primary care does the medication management",
      "created_utc": 1740734331.0,
      "score": 0
    },
    {
      "id": "mf854cf",
      "body": "I'd hope the CDC alone would stop this from happening......",
      "created_utc": 1740735190.0,
      "score": 2
    },
    {
      "id": "mf92f42",
      "body": "Same here I need them to work and socialize or I'm going to lock myself in my home and collect welfare like the other half of the usa",
      "created_utc": 1740751071.0,
      "score": 1
    },
    {
      "id": "mf3s345",
      "body": "This is like the book, Animal Farm. \"we are all equal but some of us are more equal than others\".",
      "created_utc": 1740678094.0,
      "score": 1
    },
    {
      "id": "mf5t42x",
      "body": "Why am I downvoted? Lol",
      "created_utc": 1740699352.0,
      "score": 2
    },
    {
      "id": "mf2lx35",
      "body": "Do you really think the current administration cares about high suicide rates though? They're already rolling back/cutting things that will cause a lot of harm. ",
      "created_utc": 1740665609.0,
      "score": 4
    },
    {
      "id": "mf285uz",
      "body": "They don’t care one bit.",
      "created_utc": 1740660521.0,
      "score": 0
    },
    {
      "id": "mf2896l",
      "body": "Yep. Everyone is asleep while our quality of life is being completely stolen by sociopath elites.",
      "created_utc": 1740660558.0,
      "score": 2
    },
    {
      "id": "mf2ddov",
      "body": "Population control bordering on eugenics.",
      "created_utc": 1740662569.0,
      "score": 1
    },
    {
      "id": "mf4fl0y",
      "body": "So am I my rumination and thought of all this is extremely overwhelming I'm ruminating everyday over all this political bs.....you have GAD also I see",
      "created_utc": 1740684743.0,
      "score": 1
    },
    {
      "id": "mf4vcft",
      "body": "Trump put rfk Jr as the HHA secretary and RFK believes ssris are what causes mass shootings and wants to take away meds and send us all to well being farms to take care of animals and grow food",
      "created_utc": 1740689212.0,
      "score": 1
    },
    {
      "id": "mf4w4kp",
      "body": "Good I'm glad you don't support this the medical community needs to come together and help.....I'm terrified I have GAD and MDD I have a family a 10 year old whose ADHD idk what I would do if they take me off my medicines",
      "created_utc": 1740689432.0,
      "score": 2
    },
    {
      "id": "mf4wgwy",
      "body": "Do some providers not explain the black box warning I think that falls on the pharmacy not the doctors let's not forget it's your choice to take any medicine or even go to a doctor.....I don't like going to the doctor I hate it....it makes my anxiety 10 fold....but I know without care I'm a deadbeat dad with care I'm a good citizen and dad and work fulltime provide insurance etc for my family",
      "created_utc": 1740689529.0,
      "score": 2
    },
    {
      "id": "mf48ybd",
      "body": "If that's what they want then there going to deff get that",
      "created_utc": 1740682857.0,
      "score": 2
    },
    {
      "id": "mf4qv0y",
      "body": "Says someone who absolutely has no idea what ADHD is",
      "created_utc": 1740687937.0,
      "score": 1
    },
    {
      "id": "mf225bs",
      "body": "Speak for yourself. My meds do way more good than harm and there is no ‘natural approach’ that will replace an antipsychotic. Truthfully I find it very offensive to assume everyone is chronically overmedicated.",
      "created_utc": 1740657905.0,
      "score": 6
    },
    {
      "id": "mf4fqmg",
      "body": "I think they wanna try to push marijuana as a medicine",
      "created_utc": 1740684788.0,
      "score": 0
    },
    {
      "id": "mf1xr3m",
      "body": "That's kind of the point. If we could live without them we wouldn't take them in the first place. That's like saying people on chemo can't live without it. No shit sherlock.",
      "created_utc": 1740655798.0,
      "score": 16
    },
    {
      "id": "mf1zjbc",
      "body": "Braindead take. There are thousands of medications that do not heal anything but prevent plenty. Insulin is one of them. Trying to take that away from patients too, are you?",
      "created_utc": 1740656716.0,
      "score": 10
    },
    {
      "id": "mf38i2s",
      "body": "There are those of us who've tried EVERY other option with little to no success. My depression and anxiety are treatment-resistant, I've tried everything including non-traditional treatments, lifestyle changes, supplements, decades of therapy, diet changes, exercise, spending time in nature and getting in touch with my spiritual side, etc etc. I just paid out the nose for a round of acupuncture that did nothing to help. After much trial and error I finally found a med combo that allows me to actually function most of the time.\n\nHave any other suggestions about how I can \"heal\" myself?",
      "created_utc": 1740672565.0,
      "score": 2
    },
    {
      "id": "mf6vne4",
      "body": "💯 ☑️ 💯 ☑️ 💯 ☑️ \n\nOh no. Please don't speak facts in the sub. I tell you. The dramatics on this thread proves the drugs aren't helping them at all. Everyone is having n attack over a discussion someone had. They're stuck for sure. Way too dependent and this thread is proof that it ain't helping much because why I everyone in panic mode?",
      "created_utc": 1740712581.0,
      "score": 0
    },
    {
      "id": "mf1yviz",
      "body": "With access to lots of lethal farm equipment.",
      "created_utc": 1740656382.0,
      "score": 178
    },
    {
      "id": "mf1rx55",
      "body": "A place where we can focus…or concentrate… at a camp. It’s a fucking concentration camp.",
      "created_utc": 1740652517.0,
      "score": 346
    },
    {
      "id": "mf2o7lb",
      "body": "You mean like sanitariums?",
      "created_utc": 1740666375.0,
      "score": 30
    },
    {
      "id": "mf3btfu",
      "body": "Agricultural labor camps to replace the migrants.",
      "created_utc": 1740673514.0,
      "score": 31
    },
    {
      "id": "mf57reu",
      "body": "Not they, RFK.\n\n\nhttps://www.npr.org/sections/shots-health-news/2025/01/30/nx-s1-5281164/antidepressants-ssris-rfk-jr-heroin#:~:text=During%20his%20Senate%20confirmation%20hearing%20to%20serve%20as,as%20heroin%20%E2%80%94%20a%20claim%20contradicted%20by%20research.\n\n\nPeople need to stop supporting this fucking buffoon dressed up in a suit.",
      "created_utc": 1740692724.0,
      "score": 35
    },
    {
      "id": "mf328xp",
      "body": "Let's not dress it up, tongue in cheek has no place any more. \n\nThey'll be concentration camps. They want genocide.",
      "created_utc": 1740670765.0,
      "score": 50
    },
    {
      "id": "mf4xg90",
      "body": "I think there might be too many of us 🤔",
      "created_utc": 1740689804.0,
      "score": 10
    },
    {
      "id": "mf40cm3",
      "body": "What that's something that's happening? Jesus christ",
      "created_utc": 1740680431.0,
      "score": 7
    },
    {
      "id": "mf4p1z7",
      "body": "I am on a cocktail of meds and can confirm Zoloft finally stabilized my moods without it! My moods are gonna make everyone suffer, so good luck if they take these away haha! I don’t understand how some of these people just think people with depression get magically cured overnight, sometimes meds are the only thing that got us out of that dark place.",
      "created_utc": 1740687420.0,
      "score": 16
    },
    {
      "id": "mf4y2sk",
      "body": "I like to think all of our therapists and psychiatrists will be on the frontline because they all know full well we need these things to be stable. It won't just be the mentally ill unhappy. It'll be allll our people too. Like my brother once said, \"i hate anyone that hurts my sister.\"",
      "created_utc": 1740689982.0,
      "score": 14
    },
    {
      "id": "mf4vkyj",
      "body": "This is exactly what I'm thinking. And the list isn't going to be Bob the cashier or random poor person.\n\nPeople are going to remember the rich Nazis that took their lives from them.",
      "created_utc": 1740689279.0,
      "score": 6
    },
    {
      "id": "mf2pnmd",
      "body": "They want martial law so they can have absolute power.",
      "created_utc": 1740666845.0,
      "score": 59
    },
    {
      "id": "mf2lce5",
      "body": "https://www.politico.com/news/2024/07/04/leader-of-the-pro-trump-project-2025-suggests-there-will-be-a-new-american-revolution-00166583\n\nhttps://www.rollingstone.com/politics/politics-news/kevin-roberts-heritage-revolution-bloodshed-1235052706/",
      "created_utc": 1740665413.0,
      "score": 1
    },
    {
      "id": "mf70pp5",
      "body": "!",
      "created_utc": 1740714459.0,
      "score": 2
    },
    {
      "id": "mf3sz1l",
      "body": "Who is Marshall?",
      "created_utc": 1740678340.0,
      "score": 5
    },
    {
      "id": "mf5m5ma",
      "body": "dark days",
      "created_utc": 1740697073.0,
      "score": 32
    },
    {
      "id": "mf5ng37",
      "body": "Idk man, they’re saying fuck all about the NIH cuts and pharma absolutely 100% relies on basic science done at universities (NIH funded!!!) to discover new drugs, never mind that those same universities grant PhDs and thus create their workforce. They’re fucked without that pipeline and yet not a single one of those slimy fucks is saying a word.\n\nEdit: also, half of these SSRIs are generics, they aren't the big moneymakers. If they were going after your Humira or other other big $$$ ones then sure maybe, but generics manufacturers ≠ the same as your Pfizers or Eli Lillys or GSKs lol",
      "created_utc": 1740697487.0,
      "score": 12
    },
    {
      "id": "mf2j35y",
      "body": " Pharmaceutical companies make a shit ton of money from these medications. They aren't just going to roll over and lose the US as a market for all these drugs. Some very rich people would be very inconvenienced and you know they can't have that.",
      "created_utc": 1740664623.0,
      "score": 98
    },
    {
      "id": "mf2jib6",
      "body": "It’s possible, I’m not saying it isn’t. I’m just doubtful those corps will just give up those sweet, sweet profit margins.",
      "created_utc": 1740664769.0,
      "score": 20
    },
    {
      "id": "mf38wf2",
      "body": "That guy is Canadian.  His parents are Canadian who went to South Africa during Apartheid because they thought it was great and left SA when they saw the end of authoritarian rule was in sight. We don't want him back either",
      "created_utc": 1740672681.0,
      "score": 12
    },
    {
      "id": "mf3pza1",
      "body": "Watch any of the recent documentaries or series  on opioids, particularly Perdue and the Sackler family. After all the damage and destruction caused, oxy is still overprescribed.",
      "created_utc": 1740677505.0,
      "score": 1
    },
    {
      "id": "mf6spe7",
      "body": "How did it go? What did they say?",
      "created_utc": 1740711527.0,
      "score": 2
    },
    {
      "id": "mf67yyy",
      "body": "[deleted]",
      "created_utc": 1740704271.0,
      "score": 1
    },
    {
      "id": "mf1sli5",
      "body": "Lets say work case scenario everyone starts tweaking and riots. They wouldn't be able to arrest everyone in the riot. I would probably turn manic and cry in my bed. Chances are the psych wards will be filled to the brim and benso stock would run out because they would administer benzos to calm everyone down so they could plan the next action.\n\nAlso if everyone thats tweaking are thrown in to jai you would have moved the riot from the streets to riots in the jail systems.",
      "created_utc": 1740652915.0,
      "score": 27
    },
    {
      "id": "mf32qex",
      "body": "Im on adhd meds anti prichotics ssri and snri. Honestly ive experienced withdrawal and I honestly think I would be as good as dead.",
      "created_utc": 1740670906.0,
      "score": 12
    },
    {
      "id": "mf6srbh",
      "body": "Yup. While it's not the majority of mental health patients that become violent when unmedicated, there are enough of them in this country that are being treated successfully that banning these sorts of meds could cause a sharp rise in violent crime. Also drug crime as people turn to the streets to self medicate, which rarely ends well for a lot of mentally ill people. Add in the people who might not have a list of people or homicidal ideation, but a more reckless attitude towards everything that hints at a death wish due to their lack of care if they live or die, but they're not willing to actually end so they just do progressively riskier behaviors in an attempt to either subconsciously kill themselves, or just to feel some kind of emotion as they're so numb they feel nothing unless they do something extreme. I've been in that numb, passively suicidal, and reckless mindset before and while I had no plans to actually kill anyone specifically, I drove insane because it was one of the few things that could get me to feel alive. Incredibly risky and I'm shocked I never lost my license or was in any serious accidents as a result. Not everyone will be as lucky as me, and it's very possible for people in that mindset to take someone else with them while driving recklessly even if they never actually planned to end anyone's life, not even their own. They just want to feel alive because they're numb and feel no happiness, no sadness, just nothing. It's a very hollow and hard to describe feeling that will drive you to wild things to feel something as when you're that numb you don't even really feel human, so anything that does make you feel helps you feel human again, even if it's very dangerous that mindset starts to not care cause even fear is muted. \n\nAdd in how unpredictable psychosis can be, as well as the economic impact when millions of depressed people are now too depressed to get out of bed or go to work and it becomes pretty obvious that removing these drugs will not be good for society, not even RFK would be able to deny that if people saw the real impact it had. I honestly think the role of big pharma lobbying will be more influential in preventing him from acting on this claim, and I wouldn't be shocked if they are using these comments as a way to stir people up and distract them while they do other much more destructive things. That seems like how trump and his cronies like to role, saying one outlandish thing to keep people busy and freaked out, while doing something else much worse for the general public while they're distracted by the wild claim that they don't plan on ever actually doing.",
      "created_utc": 1740711546.0,
      "score": 1
    },
    {
      "id": "mf6zwji",
      "body": "His relative was given a lobotomy because she was \"uppity\" (in other words a girl who wasn't gonna bow down to assholes in the 1950sish)",
      "created_utc": 1740714156.0,
      "score": 3
    },
    {
      "id": "mf8l92l",
      "body": "I used to take Lexapro but I started having \"brain zaps\" and, in an effort to get rid of them, switched to the Zoloft/Prozac combo. \n\nBut after talking to some people and still getting them even without missing a dose I'm starting to worry there's more going on; an MRI was clear but I'm seeing a neurologist next week.",
      "created_utc": 1740744372.0,
      "score": 1
    },
    {
      "id": "mf76wbb",
      "body": "From ppl who has already assessed the patient and decided that the reward outweighs the risks from the medication for that specific patient. The doctors should weigh everything including side effects, how quickly a patient needs relief, comorbidities the patient may have, med interactions with any other med you are on and ideally also the risk of developing a withdrawal syndrome if one chooses or is forced to quit their medication for and good doctors consider all of that before deciding on which medication to try for a certain condition. Psych meds shouldn't be an exception. Generally when there's one med or manygof a specific class used as the standard first treatment despite other drugs of other classes with similar effects it's because the recommended drugs have been found to either have less side effects while having similar effectiveness as previous drugs that were more common, or the drug is more effective than the previous drug such as penicillin vs sulfa drugs. \n\nSo while on some level I can see why he might have that view point but it also shows a fucktom of ignorance about how our health care system works which is what makes the safety of these psych meds much higher than heroin, even when quitting and experiencimg a withdrawal the prescription psych meds are often much easier to quit as physicians know the halflifes and can calculate the best tapering schedule to minimize withdrawal while keeping the patient as symptoms free as possible, which is pretty far from heroin where you have to be you're own doctor to avoid withdrawal but that's hard to do when in severe withdrawal. All of this to say that while psych meds are technically addictive from a physical standpointtheyre much safer than illegal drugs of addiction and should not be banned in a way that lumps them together.",
      "created_utc": 1740716880.0,
      "score": 3
    },
    {
      "id": "mf8fllk",
      "body": "Opening by saying head meds do a LOT of good for a LOT of people and if prescribed by a doctor, probably best to try taking as prescribed and asking them about adjusting or changing if you feel they're not working well enough, what follows is prejudiced opinion, plain and simple, probs best to ignore the crazy man for legal reasons.\n\n\nHonestly, from my experience in the uk, they're not better managed or less likely to fuck up someone's life than the addictive painkillers in the 90s-ish even if they're not strictly addictive or giving people highs.\nI support a public intervention looking into how they're prescribed and how to manage mental health more effectively. \n\nIm talking comparing how they're  prescribed too readily, often misused as a substitute for more intensive medical intervention, severe withdrawal and risk of side effects worsening mental health when users aren't properly monitored by the prescribing physicians- like all those Dr's prescribing cheap oxy for minor injuries rather than physio/surgery to actually fix the issue or mild mental health being instantly medicated and the side effects of meds treated as further mental health stuff.\n\n\nMy GP has had me on a laundry list of antidepressants which I'm almost certain fucked me more than the depression would have because of lack of supporting care/supervision and I have been waiting literally years to speak to a psychiatrist for more than 1 session because the NHS has been fucked with a dry splintery post by at least the last 3 decades of governments. \nIt's cost me relationships, my finances and jobs. Doing recreational doses of fentanyl for those 6 years alongside the mental health would probably have been as disruptive but more enjoyable. ",
      "created_utc": 1740741498.0,
      "score": 1
    },
    {
      "id": "mf8ri5u",
      "body": "They are!!\nEspecially Benzos, they can kill you in withdrawal, Heroin won't.",
      "created_utc": 1740747068.0,
      "score": 1
    },
    {
      "id": "mf3dcwp",
      "body": "Yeah buddy, i can bring my 5000 empty flower pots with me. It will get us started 🤩",
      "created_utc": 1740673953.0,
      "score": 12
    },
    {
      "id": "mf67ckv",
      "body": "💀even my succulents are dying, thanks for the reminder to water the poor guys.",
      "created_utc": 1740704064.0,
      "score": 6
    },
    {
      "id": "mf68wta",
      "body": "Trust, big pharma isn't about to allow this to happen. Waaayyyy too profitable to have them give up, after all they have super lobbyist power",
      "created_utc": 1740704594.0,
      "score": 3
    },
    {
      "id": "mf6xfad",
      "body": "I'd bet you this rhetoric is a distraction from other abhorrent things the trump admin is quietly working on passing through without public attention because everyone is busy talking about the threat to psych drugs. I agree it probably won't happen as it's too much money for big pharma as the economic and social impacts of such a change would be devastating to this country's already weak economy. I'd almost guarantee this is a distraction from something else equally terrible.",
      "created_utc": 1740713230.0,
      "score": 1
    },
    {
      "id": "mf82ujo",
      "body": "Same here! I haven’t met many others who have the same problem as me with weed. I used to be able to smoke it fine as a teenager, but in the last ten years I started having more and more bad reactions to it and now I can only smoke a very very small amount if I have some alcohol my system. \n\nThe first time I had a bad reaction I was so high that I seriously believed that I was in something like the matrix and that I was the only real person in the world, everyone else was in my head. It was one of the worst experiences of my life",
      "created_utc": 1740733759.0,
      "score": 2
    },
    {
      "id": "mf1wohg",
      "body": "I don't tend to assume as there are bad moves been mad by governments across the globe. Not exclusively the US.",
      "created_utc": 1740655226.0,
      "score": 0
    },
    {
      "id": "mf1xu5n",
      "body": "That's truly awful. I'm sorry your having to deal with all this.",
      "created_utc": 1740655842.0,
      "score": 6
    },
    {
      "id": "mf6pat8",
      "body": "We’re going to have another pandemic. I can’t see it.",
      "created_utc": 1740710317.0,
      "score": 1
    },
    {
      "id": "mf1rr5n",
      "body": "Folks, our government is a demented shit show, but do you really think that the pharmaceutical industry would allow this to happen? The only people this administration is serving are billionaires and big business. If it gives you any relief, know that they will ban mifepristone and birth control way before they touch other drugs (because they hate women). If and when that happens, you can start worrying about your antidepressants.",
      "created_utc": 1740652418.0,
      "score": 20
    },
    {
      "id": "mf1r50t",
      "body": "He just made negative comments about them, mainly for children on them. He never once said that he was going to “ban” them. Find me a source where he said that he wants to get rid of them. Making negative comments about something is not the same as banning something.",
      "created_utc": 1740652048.0,
      "score": 31
    },
    {
      "id": "mf35b65",
      "body": "Where did he say that?? I have also looked around the internet and found nothing about him saying he wants to ban them outright, mostly what I'm reading is concern about them being prescribed to children and some good ole misinformation about them (which is of course harmful, but different from what ya'll are saying is happening). Please point me to where he stated that he wanted an outright ban of antidepressants because ya'll are really freaking me out.",
      "created_utc": 1740671646.0,
      "score": 4
    },
    {
      "id": "mf5nekp",
      "body": "RFK has no such power.",
      "created_utc": 1740697474.0,
      "score": 1
    },
    {
      "id": "mf5omq8",
      "body": "Yes indeed. Therein lies our challenge!",
      "created_utc": 1740697873.0,
      "score": 3
    },
    {
      "id": "mf617fr",
      "body": "Bruh, how did I get a downvote?! 🤣 we need our meds people. I can 100% guarantee there are a shitload of people in the medical community alone on at least one of those types of meds. I definitely don’t support any of them being taken away. I’m worried with you OP. I see hundreds of patients just in the clinics I cover that are on these types of medications and I couldn’t imagine seeing them suffer without them. It’ll be a devastating blow to the already broken system that is our medical community if these drugs are taken off the market. \n\nI mean, hey, you want to sit longer than 12 hours being evaluated in an ER, sitting in the waiting lobby almost the whole time, if not the entire time, because there are at least 50% more patients needing those meds, having some kind of crisis from not having them and there’s NO BEDS available, be my guest. We are already averaging 12 hours to be seen and treated with no beds and a short-staffed ER. Let’s just add more to that, it’s no big deal 🤦🏻‍♀️",
      "created_utc": 1740702027.0,
      "score": 2
    },
    {
      "id": "mf2bu71",
      "body": "The ignorance you just typed is alarming. To say there is no natural approach to replace these meds is to say nature in general is ineffective. Idgaf how offensive it is. The truth rarely sits right with most people. I will stand alone in this truth and it'll still be the truth.\n\nAll the overhyped dramatics over something that hasn't even hit the table of debate yet, goes to show.\nThe meds should be able to calm you down enough if it's in your system well enough. Most of the comments are panic comments. What exactly are your meds doing?\n\nYes it works for many but for way too many people it does more harm than good. For things like bipolar and schizophrenia, yes I believe meds should be used but GAD (my dx) any form of anxiety I think should be approached with more therapies. Even depression. They need more qualified therapists which they are lacking. Walking is AMAZING. Hiking is how I was able to wean myself after yrs drug hoping because the right dosage was never achieved. \n\nAgain, we are OVER medicated. We need to be weaned down from the drugs. Even my own psych said at the start that the meds would eventually be stopped but it's started in order to stabilize. Yall want a bandaid. We NEED PREVENTION. We can't prevent shit if we're always putting band-aids on the symptoms. Why are you against preventing???\n\nDown vote me by 1000. I stand on my words and your dramatics just prove my point. Nothing has even happened.",
      "created_utc": 1740661979.0,
      "score": -5
    },
    {
      "id": "mf811up",
      "body": "Getting run over by a combine harvester driven by someone of their meds just sounds like one of the worst ways to go no thanks.",
      "created_utc": 1740732603.0,
      "score": 12
    },
    {
      "id": "mf24pev",
      "body": "No, no, it’s a wellness farm where we can work to help make us free from evil medicines. . Totally different. \n\n/s",
      "created_utc": 1740659063.0,
      "score": 96
    },
    {
      "id": "mf5j0os",
      "body": "ADHD here. Nothing at that camp will help me concentrate.",
      "created_utc": 1740696092.0,
      "score": 32
    },
    {
      "id": "mf4g2po",
      "body": "I have adhd how would I do that",
      "created_utc": 1740684884.0,
      "score": 14
    },
    {
      "id": "mf7dkj6",
      "body": "See also: A collective farm in the Gulag Archipelago",
      "created_utc": 1740719776.0,
      "score": 2
    },
    {
      "id": "mf3gjv7",
      "body": "Only private owned sanitariums",
      "created_utc": 1740674856.0,
      "score": 19
    },
    {
      "id": "mf62xzv",
      "body": "This. It will be phrased as fresh air, light physical labor, and the spiritual satisfaction of growing healthy food crops. The natural cures for depression and anxiety.",
      "created_utc": 1740702601.0,
      "score": 13
    },
    {
      "id": "mf912x0",
      "body": "Some very smart, compassionate bureaucrat will decide which farm you go to....",
      "created_utc": 1740750612.0,
      "score": 3
    },
    {
      "id": "mf4l6yy",
      "body": "No not yet. Look, under this crazy regime literally anything can happen - dictators dictate. Stalin put stamp collectors into camps.\nBut so far we have only some ramblings from Bobby junior, and while I’m as anxious as the next person and will certainly be losing sleep over the fear of losing my meds, it’s all fantasy at this point.",
      "created_utc": 1740686319.0,
      "score": 24
    },
    {
      "id": "mf7ktk2",
      "body": "Zoloft pulled me out of the worst, most horrible depression of my life and keeps it under control for the most part. It’s a miracle drug for me.",
      "created_utc": 1740723243.0,
      "score": 2
    },
    {
      "id": "mf7c75d",
      "body": "Unless you are a therapist on meds too and turn into an anxious adhd gremlin with seizures...",
      "created_utc": 1740719164.0,
      "score": 6
    },
    {
      "id": "mf2ua5v",
      "body": "I think so too….I think the GOP of today loves pain, suffering and violence. When you look at their actions, always the best indicator of a person or group’s goals, they’ve been supporting policies, using language that leads to a place that causes people to suffer. When they refused to pass any common sense gun laws after those first graders and their teachers were massacred at Sandy Hook, I knew that what we are dealing with is more evil than a lot of people are still comprehending. I don’t really know how to fight it, tbh.",
      "created_utc": 1740668333.0,
      "score": 38
    },
    {
      "id": "mf69n4j",
      "body": "Whoever my phone’s voice to text, thought it was",
      "created_utc": 1740704845.0,
      "score": 1
    },
    {
      "id": "mf5qedn",
      "body": "Yeah I mean I'm a PhD and a university administrator. That pipeline will take a little bit to dry up. It's not urgent in the same way when it comes to their bottom line. Since they're motivated by money and not public good, those companies aren't going to enter the fight until it is good and worth it for them.\n\nI don't see the pharmaceutical companies ignoring the obvious setting of precedent nearly so easily unless something is written into this that enables them to ultimately profit.",
      "created_utc": 1740698448.0,
      "score": 8
    },
    {
      "id": "mf2qfiy",
      "body": "Including doctors. The kickbacks on them are probably insane. Every doctor I've ever been to who I've said that I need help with my anxiety, their eyes light up, and they write a prescription, no questions asked.  They don't even ask about counseling anymore.  Antidepressants are literally the only drugs with severe side effects that get treated like this.",
      "created_utc": 1740667098.0,
      "score": -25
    },
    {
      "id": "mf7xzi5",
      "body": "They said they have “no plans to halt production.”  That’s good…",
      "created_utc": 1740730680.0,
      "score": 3
    },
    {
      "id": "mf681ij",
      "body": "God 🤯",
      "created_utc": 1740704295.0,
      "score": 1
    },
    {
      "id": "mf71521",
      "body": "Ssri withdrawals are HELL. I am withdrawing from Zoloft now that I lost my insurance. It really does feel like a slow death",
      "created_utc": 1740714620.0,
      "score": 7
    },
    {
      "id": "mf802mi",
      "body": "We already saw what happened when people are taken off necessary medications that can be addictive when the CDC speculated opiates legally prescribed were causing the opioid crisis which is really actually an OD crisis and Fentanyl is the actual culprit. States passed laws so fast it was insane and they scared the doctors into refusing to prescribe opiates. MANY chronic pain patients who validly needed these meds and who had horrific withdrawal due to their body being dependent upon a needed medication to function ended up committing suicide by buying street drugs and then dying (either bc it was laced or because they couldn’t take the pain). \nThen the CDC retracts the hypothesis once ODs skyrocketed despite the fact that prescribing them became more and more rarely used, shorter duration, etc. yet not one law was revisited despite them saying that the extreme laws enacted off of a suggestion had harmed more patients that protected addicts and had NO effect of the OD rates which continued in an upward trajectory. \nBut let’s be real we as a country are not thinking about that at all. Therefore history will repeat itself. Taking all women off birth control will also be hellacious. I’m on mine full time because I have such severe PMDD that I would spiral in to the darkest hole for a few days and it’s so hard to climb out of over and over again. \nBut the dying and the psyochosis is the goal. They can commit genocide while blaming those who die from no access to necessary medications to function",
      "created_utc": 1740731978.0,
      "score": 2
    },
    {
      "id": "mf9234z",
      "body": "Yeah benzos are dangerous if abused or misused especially but it's ultimately your choice and the doctors .....they prescribe oxycontin to patients and Percocets? Those are scheduled higher for addiction than benzos along with ADHD meds.",
      "created_utc": 1740750957.0,
      "score": 1
    },
    {
      "id": "mf928me",
      "body": "Idk everyone's diff",
      "created_utc": 1740751009.0,
      "score": 1
    },
    {
      "id": "mf1x4ia",
      "body": "I wouldn’t think a lot of what is happening would happen, and if you don’t think it’s going to have a devastating impact on various industries (including the pharmaceutical industry) then I’m jealous.",
      "created_utc": 1740655465.0,
      "score": 17
    },
    {
      "id": "mf2nul1",
      "body": "I, a 40 year old woman, was about to ask my doc to try BC to see if it helps my hormonal migraines 😢 I also have been on klonopin for about a decade and can't just cold turkey it, not sure if that is included in the \"mood stabilizers\" but fuck RFK.",
      "created_utc": 1740666258.0,
      "score": 3
    },
    {
      "id": "mf21inz",
      "body": "I might need to go back and fact check some information on this, but it’s been my understanding that a large reason (or more specifically the *only* reason) that in recent years you’ve been hearing things about a shortage on adhd medications is specifically because the DEA has been putting production caps on how much supply can be made. And as far as I’m reading now it doesn’t look like this administration is interested in changing that or rolling that back any. \n\nWhich is to say, I get what you’re saying. But also “the government likes billionaires and do you think the pharmaceutical industry would allow this to happen” doesn’t really jibe with what the reality already currently is. It’s already happening. \nI know it’s not quite the same thing and there’s a difference between adhd meds and antidepressants but all it really takes is this fucked up administration to get a wild idea in their heads and get some kooks and quacks in there that will give them the biased information they need to say “yep the meds are bad” and it’ll be done.",
      "created_utc": 1740657602.0,
      "score": 5
    },
    {
      "id": "mf1u4o2",
      "body": "It IS going to happen.",
      "created_utc": 1740653800.0,
      "score": -7
    },
    {
      "id": "mf1rl2t",
      "body": "There has been no official statement on banning them but they are going to \"investigate\". I use that term loosely. \n\nWe'll see what they are planning in the coming weeks or months. I don't use anything like that, yet.\n\nI certainly do not want them banned.",
      "created_utc": 1740652317.0,
      "score": 22
    },
    {
      "id": "mf2w09j",
      "body": "unrelated..  https://www.nbcnews.com/health/health-news/fda-cancels-meeting-select-flu-strains-seasons-shots-rcna193931  no more flu shots.",
      "created_utc": 1740668882.0,
      "score": 3
    },
    {
      "id": "mf24e2a",
      "body": "[deleted]",
      "created_utc": 1740658924.0,
      "score": -10
    },
    {
      "id": "mf6an2d",
      "body": "Famous rule followers, the Trump admin",
      "created_utc": 1740705188.0,
      "score": 1
    },
    {
      "id": "mf2cplp",
      "body": "There are not natural replacements for antipsychotics is pretty solidly backed by science. There is no evidence beyond your anecdotal assumption that people are overmedicated. And yes, nature is ineffective with neurological disorders, that’s why we have modern medicine. You’re getting downvoted because you’re wrong, not because you’re just offensive. If you don’t need meds I’m happy for you, but you obviously don’t understand how the brain works nor the reasoning behind someone having a disorder which requires medication. I will never be able to be off my medication because I have a neurological disorder as plenty of other people do. You’re the one vomiting out ignorance. I personally don’t think big pharma is going to allow any admin to ban meds but acting like they should is disrespectful to those who actually struggle with mental illness. If therapy alone works for you then you probably shouldn’t speak your uneducated opinions on possible legislation.",
      "created_utc": 1740662314.0,
      "score": 4
    },
    {
      "id": "mf6is5v",
      "body": "Yeah, work will make you free! I think I've heard that somewhere before...sounds like a great idea! /s",
      "created_utc": 1740708011.0,
      "score": 19
    },
    {
      "id": "mf4k4xk",
      "body": "Restorative!",
      "created_utc": 1740686022.0,
      "score": 13
    },
    {
      "id": "mf63t5y",
      "body": "Is this administration really thinking about taking away our meds?",
      "created_utc": 1740702888.0,
      "score": 13
    },
    {
      "id": "mf4icux",
      "body": "As far as they’re concerned you’re just not trying hard enough. Probably just send you to the showers and get some sleep.",
      "created_utc": 1740685522.0,
      "score": 16
    },
    {
      "id": "mf7ft6i",
      "body": "And if we give a good hard days work then we’re rewarded with a shower. But if we don’t work hard enough they send you to the shower early.",
      "created_utc": 1740720798.0,
      "score": 2
    },
    {
      "id": "mf30hqc",
      "body": "It's a difficult fight and one that we basically have to wait and see at this point, unfortunately.  I thought I just read something last night that repubs want gun reform, and I think its sole purpose is to take weapons out of people on the lefts hands. It's becoming increasingly clearer that they know that what they are doing is going to cause massive backlash, and they've prepared for that backslash to be impossible to sustain.  They know exactly what they are doing is bogus and they know people will eventually get violent.  This administration is extremely predictable.",
      "created_utc": 1740670248.0,
      "score": 13
    },
    {
      "id": "mf33dec",
      "body": "Yeah, I dont think villifying all doctors is necessary in this context. Antidepressants save lives with relatively low risk. I'm not sure what these \"severe\" side effects you're talking about are. Also if you see a doctor and their eyes \"light up\" when you tell them you have anxiety, maybe you should find another doctor.",
      "created_utc": 1740671088.0,
      "score": 39
    },
    {
      "id": "mf4e7kl",
      "body": "What kind of back alley doctors are you seeing?\n\nIt took me 6 months, multiple referrals, and counseling to get on antidepressants.",
      "created_utc": 1740684353.0,
      "score": 6
    },
    {
      "id": "mf6ots0",
      "body": "The mood stabilizers likely refers to drugs like lamictal(lamotragine) that are specifically and exclusively used for stabling the mood of bipolar patients. As far as I know Klonopin is a benzo that was developed for anxiety that happens to help with stabilizing mood despite that not being it's intended effect. Much like SSRIs being prescribed for anxiety and OCD even though they were originally developed for depression. Or gabapentin with its myriad of off label uses beyond pain relief, like migraine prevention, easing of withdrawal symptoms in opioid addicts, and use for anxiety and other mental health disorders. Gabapentin was designed to help with nerve pain but ended up helping other things too and as such it's prescribed quite frequently for things other than nerve pain. I love my gabapentin cause it cut my migraine frequency in half and also helps a little with my anxiety which is nice. The only issue with it is that it's very easy for it to cause dependence in me and the withdrawals are pretty harsh for a drug with such mild psychoactive effects when using it normally. The withdrawal seems way worse than it should be for how subtle of an effect it appears to have on my anxiety and other issues. Other than the migraines which is a much more obvious difference but I didn't have any withdrawal associated increase beyond what I already had before I started the med. Although it would be hard to get worse than where I was before I started gabapentin as I was getting them every other day, it is possible for that to be worse and I'm so glad that I didn't get anything beyond that when I didn't have it. \n\nSo in summary, any drug that is used off-label as a mood stabilizer is likely safe unless it falls into one of the other categories that RFK wants to remove, While drugs that are specifically approved and primarily used for that purpose are at a much higher risk, which could also affect anyone who uses them for off-label reasons as well. Seroquel is a great example. Primarily developed and used as a bipolar med and is classified as an atypical antipsychotic, but it's pretty commonly used for anxiety, sleep, as an add on to improve ADHD treatment efficacy as well as a complement to depression medications when one or 2 SSRIs isn't doing enough. Seroquel also occupies a very specific niche of being great for bipolar depression without causing mania, which leads to it being used to stabilize moods as well as to manage psychosis, so despite all the other uses for it it likely is at risk since it was first created and approved as an antipsychotic despite it kinda being a fancy antihistamine but that's its own fun quirk. Interestingly enough my mirtazapine is also a fancy antihistamine. I apparently react best to allergy meds that are simultaneously psychoactive. Really makes me ponder the link between psychical conditions and mental ones, like how anxiety is strongly correlated with IBS, likely as a result of serotonin receptors being strongly concentrated in both the brain and the gut. The most popular anti nausea med,  zofran, actually works directly on those serotonin receptors in the gut. I believe it is not psychoactive as it doesn't cross the blood brain barrier but I might be wrong. Another funky one is famotodine, the anti heart burn drug. It's also an antihistamine but it's a non drowsy med because it can't cross the blood brain barrier. So it just reduces the production of stomach acid instead. Fascinating how often histamine activity shows up on unexpected meds that are never used for allergies. \n\nI hope this makes sense, taught you a few new things about meds and pharmacology, and helps you to understand which meds likely will be targeted and which ones are likely safe. As long as they don't go after benzos I believe you should be fine with Klonopin. Unfortunately anyone taking Seroquel for sleep or anxiety would be affected if RFK gets his way since Seroquel is primary classified and used as an antipsychotic. Gabapentin is safe (for now) but all the OCD meds that are SSRIs/antidepressants first and anxiety/OCD treatments second might want to consider \"dose increases\" ;) after talking to your doctor so that you can build up a stockpile by having a prescribed amount higher than what you actually take. Unfortunately this also applies to anyone who take any SSRI to help chronic pain as it's been show that antidepressants in general are surprisingly effective for certain types of chronic pain, with nerve pain showing a particularly effective reaction to antidepressants that increase serotonin. The most common used antidepressant for this purpose is actually amitriptyline, a tricyclic antidepressant, but I wouldn't be surprised if there's pain patients on SSRIs taking them to increase their pain management effectiveness that would be affected by an SSRI or antidepressant ban too. \n\nWhile RFKs rhetoric is extremely concerning for anyone who depends on any of the medications included in his rants, I highly doubt he would actually be successful in banning or reducing any except for maybe ADHD meds which are schedule 2 and limited in production amounts by the DEA. Most mental health meds are not categorized this way and are schedule 3 or 4 and therefore subject to much less stringent regulations. This is why a primary care physician and urgent care doctors can prescribe you SSRIs, but Adderall often requires a visit to a specialist. The reason RFK won't realistically succeed in banning SSRIs, antipsychotics, mood stabilizers, and other mental health meds is twofold. For one big pharma makes too much money off of these meds to allow them to be banned or limited in sale without some serious lobbying to protect their profits. The second is the court of public opinion. Even his dumb ass would be shocked if he made real moves towards this by the amount of people who protest. The economic impact would be too severe to ignore as many many Americans in high profile office jobs are on at least 1 of the mental health medications claimed to want to target. \n\nIt is scary rhetoric but there are ways to prepare, such as tapering for those that can handle it, or building up a stockpile by getting an increase from your provider while taking the same dose by either cutting pills or taking less per day (please please please seek doctor advice before going this route especially if cutting pills as not all pills can be cut and see an even decrease in dose. So please talk to your doctor if you are worried enough to consider this.) but realistically (I hope) there will not be sweeping bans of these drugs because of how devastating the economic impacts would be and the power of big pharma lobbying to protect their easy money. The only exception could be further ADHD meds shortages as the DEA can set strict limits on the number pharmaceutical companies are allowed to make per year. For those struggling to figure out how to function I recommend looking into straterra or other plant based legal stimulants (caffeine and nicotine are two decent options) as well as helpful supplements (like l-tyrosine, a dopamine precursor)and if you don't smoke looking into Wellbutrin as well which can be helpful for some ADHD patients. Of course talk to your doctor before making any of these changes yourself. Meds can be tricky and dangerous if misused and even supplements aren't always safe and might have interactions that surprise you. Like Adderall interacting with vitamin c and antacids.",
      "created_utc": 1740710148.0,
      "score": 1
    },
    {
      "id": "mf21dts",
      "body": "No? They don't really stand to gain anything from doing that. Big pharma makes way too much money for that to make sense. Too many people rely on them, even within the government. The logistics would be absolutely insane and the financial impact would be way too devastating to our economy",
      "created_utc": 1740657539.0,
      "score": 0
    },
    {
      "id": "mf30ogf",
      "body": "It is probably too optimistic but, maybe these old white men will get the flu and their weakened immune systems will finally off them.",
      "created_utc": 1740670306.0,
      "score": 10
    },
    {
      "id": "mf4ljet",
      "body": "I wanted to die when I was a kid. I needed/need antidepressants to keep me sane. I've been taking them since I was 10. I definitely don't want to go off them, because by day 3 of no meds (and I've had this happen before) a small voice in the back of my head whispers about ending everything. On my meds, I'm fine and very much not suicidal. When I'm off of them, my mind isn't my own. It's been that way since I was a kid, and that's why I'm pro-medication for kids.\n\nAs for stimulants, there's evidence that if you give kids with AD/HD stimulants when they're really young, it'll help train their brain and correct course.\n\n[Stimulant medications in children with ADHD normalize the structure of brain regions associated with attention and reward](https://www.nature.com/articles/s41386-024-01831-4)",
      "created_utc": 1740686415.0,
      "score": 3
    },
    {
      "id": "mf2mbv0",
      "body": "I can say the opposite is also backed by science. We all get our info from external sources. So who's to say who is reliable and who is not.\nHowever with my own 2 eyes and my own 2 ears I can see, read and hear the experiences and complaints of others including myself. Dr's don't even know what they're prescribing us. Ever read the pamphlet enclosed with your drugs? Check out the warning info.\n\nYou will read one sentence of what it will do to help you and the rest of the pamphlet is warnings about common and uncommon side effects that may even lead to death.\nThe only warning you get on a bottle of natural supplements is that they haven't been FDA approved. That's probably why the list of pros outweighs the cons on natural supplements. Neither is perfect because both are tweeked by man but to say nature isn't better than these man made drugs, at all, is next level ignorance. People place all their trust into the same source they question.\nNow all of a sudden that source is the golden standard? 👌",
      "created_utc": 1740665750.0,
      "score": -6
    },
    {
      "id": "mf3qvnh",
      "body": "Antidepressants are widely misunderstood online. For example, the reason SSRIs are often prescribed first is because of their safety and side effect profiles. The cost-benefit ratio is so favorable that it would be irresponsible to try something else first.",
      "created_utc": 1740677756.0,
      "score": 16
    },
    {
      "id": "mf3ag6u",
      "body": "Being a chronic pain patient as well, I don't know how many times just for myself, they push antidepressants for chronic pain. Cymbalta is way worse for you than any of the painkillers long term. People have bad liver damage, prolonged brain zaps while trying to quit, seizures, suicidal thoughts, and withdrawal.  There are studies cutrently going on to see if they have any significance in the development of dementia.  I'm not demonizing antidepressants.  I'm saying that they hand them out like candy for a drug that has quite a few side effects, some being severe, and it is quite possible that it is a money maker for the doctor and pharmaceutical companies.  This is not me saying that people shouldn't take them and they aren't useful.  I think they help people tremendously, and individuals need to weigh the risks and benefits.\n\nI'm also not trying to villify all doctors, but I have gone through quite a few of them trying to get help with my chronic illness, and several of them have offered antidepressants, while not offering to help me find counseling or a referral to a psychiatrist. I have been one of those people who lost coverage when I was younger and couldn't afford to go to a doctor and had been on antidepressants for a year that weren't helping much, but when they were gone, I definitely knew it, and I was a little pissed that I had been lied to about how non-addictive they supposedly are.",
      "created_utc": 1740673125.0,
      "score": -13
    },
    {
      "id": "mf4jizm",
      "body": "Just PCPs and a pain specialist.  Almost every single one of my family members and friends who are on them got them from their PCP.  None that I know are in counseling. One of them did originally get on them from a psychiatrist, but didnt like the psychiatrist so her PCP took over.  I'm currently on them for pain from my pain management doctor. It might be because most of us live in a rural area with only a few psychiatrists around.  I think in the last 10 years, I've probably had at least 5 different providers who weren't in the psych field prescribe me antidepressants after my first consultation based off the results from the GAD and depression survey. I figured this is how they do it everywhere while sending patients who are worse off to psych and counseling.  \n\nThe way you were treated, in my opinion, is the the right way, besides the wait, of course. That has not been my experience at all.",
      "created_utc": 1740685851.0,
      "score": 1
    },
    {
      "id": "mf2ca69",
      "body": "They probably already know Big Pharma isn't gonna let it happen & are just trying to ask for more bribes from the shareholders, which means price increases for the regular folks.",
      "created_utc": 1740662150.0,
      "score": 2
    },
    {
      "id": "mf32ajg",
      "body": "im an old white man..  that \"used to\" get a flu shot every year.  you can see the link going back to covid.  maga wanted herd immunity and no vaccines.",
      "created_utc": 1740670777.0,
      "score": 1
    },
    {
      "id": "mf4tvjw",
      "body": "Sadly the flu may cause dementia, it increases the risk a whole bunch even decades earlier, so it will put young people at risk of health problems too (even though some young people will die from flu regardless), and the dementia will burden us with caring for boomers…. Also only 42% of Gen Z showed up to vote. We need to get more angry about that because boomers are dying, there are more of us than them. Also the republicans millennials and the republican gen z it’s scary, if we can make sure there are no conservative gen z and millennials we will be good",
      "created_utc": 1740688799.0,
      "score": 1
    },
    {
      "id": "mf5nlqq",
      "body": "Why you gotta make it racist?",
      "created_utc": 1740697538.0,
      "score": 1
    },
    {
      "id": "mf4zw4b",
      "body": ".... its not who I am but it's the thoughts I have too. I don't know what to do except make it thru the next 4 years. I jokingly tell the technology that may or may not be listening, \"fbi, i dont have the means (or energy) but I wouldn't be sad if someone else offed him.\" \n I went off my meds partially last year and it wasnt good. You wanna multiply that by the masses? CRAZY.  Hopefully their beliefs catch up with their health, like you said.",
      "created_utc": 1740690500.0,
      "score": 0
    },
    {
      "id": "mf38dpd",
      "body": "So then you’re just writing off the entire medical field then. Are you also in favor of using natural remedies in place of insulin?",
      "created_utc": 1740672530.0,
      "score": 2
    },
    {
      "id": "mf3elrx",
      "body": "Look I just said there are those that require meds but you willfully missed that part because the rest doesn't suit your dependence on these drugs that aren't the greatest things in the world for us.\nI'm not going back n forth. I'm not explaining shit you choose to twist and take out of context willfully. I said what I said. You said what you said. We don't agree. It's cool. Have a great day.",
      "created_utc": 1740674308.0,
      "score": -1
    },
    {
      "id": "mf3n8me",
      "body": "All I was saying is that the idea that the government should start pushing for ‘natural’ is silly and weird and unfounded. People are rightfully concerned and you saying it would be a good thing is gross.",
      "created_utc": 1740676733.0,
      "score": 2
    }
  ]
}