{
  "id": "1itdpfl",
  "title": "I can’t believe this is the timeline",
  "selftext": "I can’t believe everything happening in the United States right now. I can’t believe this guy got voted back in. The signs were all there, we knew this would happen. I’m honestly so stunned and full of despair idk what to do. I’m so scared all the time.",
  "created_utc": 1739992186.0,
  "score": 1874,
  "num_comments": 86,
  "url": "https://www.reddit.com/r/Anxiety/comments/1itdpfl/i_cant_believe_this_is_the_timeline/",
  "comments": [
    {
      "id": "mdo9wqj",
      "body": "[deleted]",
      "created_utc": 1739995257.0,
      "score": 595
    },
    {
      "id": "mdp0bnv",
      "body": "It isn’t in your control. No amount of suffering on your end will change this. The only thing you can do is take care of yourself",
      "created_utc": 1740002302.0,
      "score": 125
    },
    {
      "id": "mdo0i81",
      "body": "You've got to disconnect from the news. I did it about 2 weeks before the election, I couldn't take the 24/7 blanket coverage. I unsubbed from all the news and politics subreddits, and youtube channels. That's all I use, really.\n\nThe difference in my mental health has been very noticeable. I am still staying in touch with developments and I agree that it's scary as shit. But staying hooked to every single little development, watching the talking heads argue back and forward over every scandal like it's the end of the world... it's not healthy.\n\nDisconnect, not permanently, but until you've regained some actual perspective. The stuff going on around your local area is far more important to your every day life, if you must read news, read local news instead.",
      "created_utc": 1739992744.0,
      "score": 371
    },
    {
      "id": "mdokqrn",
      "body": "Turn the tv off turn the tv off",
      "created_utc": 1739998144.0,
      "score": 95
    },
    {
      "id": "mdopccm",
      "body": "I just got done telling my partner the same exact words last night. Remember, it's okay to be scared. Feel your feelings and don't try to push them away. But take an opportunity to appreciate the things in your immediate day-to-day life that are good and that you appreciate. Expressing appreciation for the good things in your life (especially when everything else seems so dark) will help stabilize your mood and give you ground to steady yourself and plan your next steps from.",
      "created_utc": 1739999363.0,
      "score": 34
    },
    {
      "id": "mdojh3t",
      "body": "our anxiety and overwhelm IS his goal right now.  when people are overwhelmed and exhausted, they fold.  his actions are all illegal and he's rushing them on purpose so that we can't focus on just 1 issue to fight and are all left scrambling in exhausted panic.  keeping your sanity through this is it's own kind of resistance!  do not feel bad taking time to recharge.",
      "created_utc": 1739997808.0,
      "score": 58
    },
    {
      "id": "mdo1ua8",
      "body": "Anxiety takes a rational fear and amplifies it. You need to disconnect",
      "created_utc": 1739993101.0,
      "score": 73
    },
    {
      "id": "mdoz9ld",
      "body": "This most propably won’t apply to anyone, but my anxiety have been less lately, as I’ve begun working out a lot more and been trying to make myself feel stronger and more “in control”. Even though I have no control of all this madness, it tricks my brain into less fear and more strength. I dont know. Its a good time to be strong.",
      "created_utc": 1740002017.0,
      "score": 13
    },
    {
      "id": "mdo82d0",
      "body": "I won’t have the time or energy to reply to everyone here as I’m also in the middle of moving (amplifying the anxiety, I’m sure) but thank you for your kind words and advice. I’ve disconnected quite a bit but I’m going to work on catching myself when I’m spiraling through news articles and whatnot. 🩷 thank you again",
      "created_utc": 1739994768.0,
      "score": 57
    },
    {
      "id": "mdobefn",
      "body": "Sometimes anxiety is completely warranted. \n\nI wonder if the people in this thread telling you to chill out would have said the same thing to Germans under the early days of the Nazi takeover.\n\nYou should relax... After you've used your anxiety towards a productive end. Let it motivate you to come up with a plan. Do you have a path towards leaving the country? Do you have connections with mutual aid organizations in your area? \n\nTake steps to prepare. Have a solid plan. Have a contingency plan. \n\nThen chill out.",
      "created_utc": 1739995659.0,
      "score": 56
    },
    {
      "id": "mdobb7p",
      "body": "It’s good to know that media outlets literally make money off of people clicking their headlines, so anything they report will be click bait titles meant to invoke fear and interest. Most of what you see is exaggerated.\n\nWhat you don’t see is there are a huge proportion of the government with good moral interests and lots of people fighting back. You will only ever really see the bad news. It’s good to be aware of this.",
      "created_utc": 1739995634.0,
      "score": 19
    },
    {
      "id": "mdowx7f",
      "body": "Information warfare and manipulation has gotten very effective and we need countermeasures. A good start is educating people about the tactics involved. There’s no open-use link I can find for it, but [this book](https://www.degruyter.com/document/doi/10.1515/9781478027676-004/html), especially the chapter the link leads to, is very informative. If you can access it or feel like buying it, might be worth a look.",
      "created_utc": 1740001383.0,
      "score": 7
    },
    {
      "id": "mdpag2r",
      "body": "This helped me manage some of my anxiety over what was going on the last few weeks.  I don’t even really love the journalist who made it lol, but his voice is soothing and I needed reminders from people in the know about taking it all in stride:\n\nhttps://youtu.be/K8QLgLfqh6s?si=mjovbmxeMYtk3PGZ",
      "created_utc": 1740005168.0,
      "score": 9
    },
    {
      "id": "mdotzje",
      "body": "I feel you. Here's my advice based on my own coping methods:\n\n- Avoid all news. Full detox.\n\n- Don't let people tell you what's going on\n\n- Do what relaxes you like cooking, binging junky TV, listening to metal music and screaming, knitting, whatever\n\n- Wear clothes with elastic waistbands\n\n- Plan something to look forward to like a trip or a fun night out\n\n- Spend time with people who make you laugh\n\n- Pet furry animals as much as possible. Tell them they are beautiful\n\n- Stay off social media\n\n- Listen to podcasts like Limetown or Divorce Ranch while cleaning out your refrigerator or closets\n\n- Put fresh fruit in your water\n\n- Give away nice things that you don't use on buynothing\n\n- Wear fuzzy socks\n\n- Look at websites like PSTR studio and imagine where you would hang your favorite prints\n\n- Buy delicious, individually-wrapped chocolates, put them in the freezer, eat one or two every night\n\n- Host a game night\n\n- Plan to grow something this spring like a windowsill herb garden, a pot of flowers for your front door, a patch of tomato plants, etc.\n\n- If you think you can handle it, listen to Maddow's first season of Ultra -- people have tried to destroy us from the inside before and we survived\n\n- Bake cookies for someone who needs to be cheered up\n\n- Create a comforting bedtime routine\n\n- Go to a museum or a movie on a weekday\n\n- Look for ways to be kind to strangers\n\n- Watch [Jackie and Shadow and their 3 eggs](https://www.youtube.com/live/B4-L2nfGcuE?si=lZbVY_sA-QRLmVSU) live. Eggs could hatch as early as next weekend!",
      "created_utc": 1740000595.0,
      "score": 38
    },
    {
      "id": "mdo1jfj",
      "body": "My anxiety has been awful since the inauguration. I also just started a new job. I had to step away from the news and social media. Especially tiktok. I have a digital subscription to the New York Times, and I limit my news reading to once a day on that. I remind myself that it’s not helpful/useful for me to worry constantly about things I can’t change. It’s been hard though!",
      "created_utc": 1739993021.0,
      "score": 22
    },
    {
      "id": "mdo0n46",
      "body": "Same here. It’s incredibly hard right now.",
      "created_utc": 1739992781.0,
      "score": 13
    },
    {
      "id": "mdoa4pu",
      "body": "I have to take frequent breaks off social media in order to keep myself stable. It’s too much. Even the memes can be too much like all the stuff with Elons kid…funny at first then I start to get angry and upset with what’s happening in our government bc why is that man everywhere. \n\nI’m so angry. Just try to step back, don’t let this man be in control of your well being. That is what he wants.",
      "created_utc": 1739995316.0,
      "score": 10
    },
    {
      "id": "mdpr9k5",
      "body": "Something I did a long time ago that’s helped tremendously is avoiding most news. Just get trusted friends to tell you if something important happens or try limiting what you see. \n\nI used to fall victim to the same trap of getting scared when I see headlines and having to continuously see more to put myself at ease. It’s not healthy and it’s what they want - clicks.",
      "created_utc": 1740010380.0,
      "score": 10
    },
    {
      "id": "mdoegwe",
      "body": "I needed to see this because I feel the same way. I feel crazy and anxious that everyone is going along with this when we have a man who just called himself king on social media. I know our grandparents survived the nazis and shit but Jesus Christ this is such a dark timeline",
      "created_utc": 1739996477.0,
      "score": 14
    },
    {
      "id": "mdo9q7a",
      "body": "My anxiety has been at an all time high the past month. I work for state government in education. The uncertainty of federal grants and what it means for students is real.  I’m struggling to disconnect from the news, especially at work as it’s part of my job. Is anyone else in this boat?  Any tips are appreciated!",
      "created_utc": 1739995208.0,
      "score": 6
    },
    {
      "id": "mdpjls0",
      "body": "I feel the same way. I can't believe that he get in again.",
      "created_utc": 1740007953.0,
      "score": 8
    },
    {
      "id": "mdpjyui",
      "body": "Why don’t you just log off, if politics is affecting your anxiety that badly, just log off",
      "created_utc": 1740008070.0,
      "score": 7
    },
    {
      "id": "mdota8l",
      "body": "Relax, it’s going to be okay, stay off of Reddit",
      "created_utc": 1740000412.0,
      "score": 4
    },
    {
      "id": "mdo8a5a",
      "body": "stay off tiktok, lot of it is fear mongering or bs from both sides. dont worry about things you cant control. although, i do want to ask what it is we “knew” would happen since he got in office? did something change or happen drastically? im genuinely curious bc i dont think ive heard anything",
      "created_utc": 1739994824.0,
      "score": 6
    },
    {
      "id": "mdovdh2",
      "body": "You seriously need therapy and stop watching the \"news\"",
      "created_utc": 1740000966.0,
      "score": 4
    },
    {
      "id": "mdpopcz",
      "body": "Just turn off the news & social media you won’t know what he’s doing anymore",
      "created_utc": 1740009575.0,
      "score": 2
    },
    {
      "id": "mdo1w4c",
      "body": "I put a 20 minute timer on all social media apps including Reddit. I generally click ignore and to remind me in 15 minutes. But it helps to keep getting a notification that my time is up to remind me to put down the phone.\n\nFuck Donald Trump. Fuck Elon Musk. Eat the rich",
      "created_utc": 1739993115.0,
      "score": 2
    },
    {
      "id": "mdo468z",
      "body": "To be honest my life didn't change much during his first term and it hasn't changed since he took office again. Not going to saddle myself with worry on other people's behalf.",
      "created_utc": 1739993728.0,
      "score": -4
    },
    {
      "id": "mdpeyio",
      "body": "[removed]",
      "created_utc": 1740006513.0,
      "score": 1
    },
    {
      "id": "mdoypik",
      "body": "As people have said, try and avoid/ disconnect from the news. I get sucked in on different channels, remember the news manipulates the way you think as thats what they do, is pay per click and make you watch to sell stuff or wind you up thats the agenda. Its biased and sensational.\n\nThe world isnt that bad as there are a lot more nicer people than you think just think about the people you may meet in the day that smile or chat with you. Concern yourself with the things you can control. I know things are easy said than done, thats the nature of anxiety, but if you do little things to distract you even for a few moments it allows you to calm a little.\n\nI go for a walk in the countryside (in the UK) with an old friend every weekend and disconnect, no phone etc and that really helps. Look at things around you, trees, sky, nature even small things. They are there and will be still there after the orange one isnt lol. Hope that helps a bit. Stay safe.",
      "created_utc": 1740001866.0,
      "score": 1
    },
    {
      "id": "mdo1734",
      "body": "There is nothing we can do. Either give up or move forward. If you need help moving forward, seek help from your support group. These are frustrating times indeed, but you survived a global pandemic, you can survive this too.",
      "created_utc": 1739992929.0,
      "score": -5
    },
    {
      "id": "mdoannz",
      "body": "[removed]",
      "created_utc": 1739995459.0,
      "score": -9
    },
    {
      "id": "mdokzzu",
      "body": "This is the price to pay for America ignorance",
      "created_utc": 1739998212.0,
      "score": -7
    },
    {
      "id": "mdpqw07",
      "body": "I'm more of a libertarian than I am a conservative but all in all I'm pretty happy with how things are going. \n\nThe political pendulum swings both ways, and that will never change. 4-8 years from now it will be the conservatives crying about how the country is being ruined. \n\nHaving grown up in the 80s/90s, this is nothing new.",
      "created_utc": 1740010262.0,
      "score": -21
    },
    {
      "id": "mdp9xjp",
      "body": "[removed]",
      "created_utc": 1740005019.0,
      "score": 0
    },
    {
      "id": "mdp2k66",
      "body": "I got really into Tudor history during the pandemic and the end of his last administration. Specifically about Henry VIII's reign. Nonfiction, historical fiction, you name it, I read it. There was something weirdly reassuring about it.\n\n\n...I think I'm due to re-read *Wolf Hall.*",
      "created_utc": 1740002922.0,
      "score": 112
    },
    {
      "id": "mdpgvh2",
      "body": "same here. I spend most of my time focusing on learning because it is one of two things that destract me from my anxiety. The other thing is, oddly enough, horror movies.",
      "created_utc": 1740007099.0,
      "score": 19
    },
    {
      "id": "mdoemtv",
      "body": "This is great advice. Thank you.",
      "created_utc": 1739996521.0,
      "score": 13
    },
    {
      "id": "mdp9k9a",
      "body": "Always a good outlet",
      "created_utc": 1740004912.0,
      "score": 6
    },
    {
      "id": "mdo8pnk",
      "body": "This makes a ton of sense. Any tips on how to stop the anxiety from telling you that you must “be aware!”",
      "created_utc": 1739994938.0,
      "score": 57
    },
    {
      "id": "mdom3pu",
      "body": "In August I deleted the Facebook and Instagram apps and disabled all notifications. My accounts are active solely to check on my father’s Facebook maybe once a month. My husband likes to send me reels on Insta, but we watch them on his phone so I’m not tempted. I informed all my friends and they were so supportive. They send screenshots to the group chat instead of direct links. \n\nAt first I felt empty because of all this free time, but it made me realize how much of my daily routine was consumed by social media. I even found a hobby I absolutely love. To say I feel free is an understatement.",
      "created_utc": 1739998500.0,
      "score": 16
    },
    {
      "id": "mdof9sh",
      "body": "Could not agree more. I keep myself aware to the point that if the world was literally about to end, I would know. But I’ve learned to mute all of the day-to-day crap. People have told me I’m ignorant and selfish for choosing to ignore what’s going on in the world but I see it this way - I literally have no control over what’s happening (for the most part). But I do have control over what I subject myself to. \n\nIf hearing all of this negative stuff on the news, online, etc. is causing me to struggle functioning in my own life on a daily basis, I need to get a hold on what I can control so that I can continue to work my full time job, be there for my family, and try to find some sense of normalcy.",
      "created_utc": 1739996689.0,
      "score": 8
    },
    {
      "id": "mdpa1cb",
      "body": "Agreed. I had to do this also.",
      "created_utc": 1740005050.0,
      "score": 2
    },
    {
      "id": "mdpgcwd",
      "body": "[removed]",
      "created_utc": 1740006941.0,
      "score": 1
    },
    {
      "id": "mdodpan",
      "body": "I’m moving too!!! I had to go up on my antidepressant. I’m on celexa 20mg, but for the past two months I’ve been having insomnia, waking up with loose stool, hot flashes and my heart pounding. Not to mention instead of getting migraine headaches maybe twice a month, I would have them at least 3-4 times a week! I was running out of my ubrelvy I take for migraines and sick of feeling sick most of the time. I went up just 5mg of my celexa (I cut a 10mg in half) it worked! Symptoms gone! Stress is a killer.",
      "created_utc": 1739996273.0,
      "score": 9
    },
    {
      "id": "mdp9a9h",
      "body": "This is exactly it. In most cases, removing yourself from the thing that triggers your anxiety is the right decision. This is much more nuanced, though. Ignoring the current situation won't help a single thing, unfortunately.",
      "created_utc": 1740004832.0,
      "score": 25
    },
    {
      "id": "mdobz5f",
      "body": "I don’t have any advice, but I wanted to say I work for a university and also have no escape from this crap. It feels like it’s taken over every aspect of my life. There’s some small comfort in knowing I’m not alone in this.",
      "created_utc": 1739995812.0,
      "score": 4
    },
    {
      "id": "mdotdm2",
      "body": "They’re downvoting you for being reasonable",
      "created_utc": 1740000437.0,
      "score": 2
    },
    {
      "id": "mdozzhu",
      "body": "He/ it lol loves the power and the attention. Sadly all politicians are the same. Its the Same here in the UK and the general feeling of powerlessness for everyone is crazy. The Musk thing is a new one its bonkers to see the oval office like that.",
      "created_utc": 1740002210.0,
      "score": 2
    },
    {
      "id": "mdpnumm",
      "body": "This content has been removed. We require that all posts be of a supportive nature.",
      "created_utc": 1740009307.0,
      "score": 1
    },
    {
      "id": "mdocqqp",
      "body": "And what if you don’t have a support group?",
      "created_utc": 1739996017.0,
      "score": 3
    },
    {
      "id": "mdoduwc",
      "body": "[removed]",
      "created_utc": 1739996314.0,
      "score": 3
    },
    {
      "id": "mdpjr0i",
      "body": "how does this contribute to easing someones anxiety about the country? lol",
      "created_utc": 1740008000.0,
      "score": 2
    },
    {
      "id": "mdpmme3",
      "body": "Any recommendations? That sounds interesting.",
      "created_utc": 1740008923.0,
      "score": 13
    },
    {
      "id": "mdogl7b",
      "body": "Endless information seeking is your brain trying to feel like it has some control over the situation and can see what’s coming, but no amount of information is ever enough, because it’s an anxiety-driven behavior. Social media and news agencies know that and purposefully exaggerate messaging to freak you out more and drive more information consumption. \n\nStopping this is hard, so you first need to bring awareness. Identify when you’re seeking information in an unhealthy way. At first, just acknowledging it can help. Over time, you can find alternative activities for your attention, but it takes time and practice to see your behavior as unhealthy and slowly move toward more healthy behavior. \n\nMy therapist told me to schedule time to worry and research. I write down all my concerns and worries the give myself some time each day to indulge. Once that time is up, I need to move on. It’s easier said than done, but it helping to acknowledge that seeking information in an obsessive way is hugely unhealthy and unhelpful",
      "created_utc": 1739997040.0,
      "score": 106
    },
    {
      "id": "mdoy30d",
      "body": "Realizing that\n\n1) the news guides your awareness and is open to manipulation. Example: WaPo suddenly decided to go “impartial” just in time to not endorse either candidate; there was basically no coverage of the short-lived attempt to get Congress to refuse to confirm Trump on the grounds that he committed treason; they just recently pulled an ad by an activist group calling for Trump to fire Musk; and of course Bezos has personally issued a statement essentially saying that he will happily slobber all over agent orange’s withered string cheese.\n\n2) that excessive info can paralyze you. There’s so much to do, where to start? Is there even a point to starting? Is what I want to do even important compared to what else needs to be done?\n\nIn order: doesn’t matter, yeah, and yeah. We all gotta do what we can do. Apathy got us here, can’t let it keep us here. Anything is better than nothing.",
      "created_utc": 1740001698.0,
      "score": 10
    },
    {
      "id": "mdosucp",
      "body": "Well, for me it became an issue of being overwhelmed by it all. The endless discussion over miniscule events, day after day... it got to the point where the feeling of drowning was much stronger than my need to know what's going on.\n\nSince the inauguration, I've heard a few things, some of his cabinet picks and the like. From what I've heard this is purely a paying back of loyal servants, regardless of qualifications. There's been a massacre of resignations at the justice department as they get rid of anyone not willing to obey Trump's orders, legal or not.\n\nThis is all very bad. But I haven't had to sit through the endless discussions of every nomination, every scandal, every famous lawyer clutching their pearls and saying 'I never thought it would get this bad'.\n\nAnd you know what? My level of knowledge isn't even slightly worse for missing all that discussion. It doesn't help you \\*at all\\* to pay close attention.\n\nThe actual big stories will just filter through your friends and family, you'll hear about them. You really don't get \\*any\\* benefit from paying close attention.\n\nI can stay just as well-informed as I was before, just by checking headlines once or twice a week, if that. Any more attention and they are going to hook you with the algorithm.",
      "created_utc": 1740000296.0,
      "score": 5
    },
    {
      "id": "mdpa8at",
      "body": "Yes! I stopped using Meta and Twitter and feel sooooo much better.",
      "created_utc": 1740005105.0,
      "score": 4
    },
    {
      "id": "mdpoaz5",
      "body": "This subreddit prohibits posting misinformation, negative generalizations, and dehumanizing speech.\n\nYou can learn to identify misinformation with the SPOT technique:\n\n* S - is this a credible news **S**ource?\n* P - Is this **P**erspective biased?\n* O - Are **O**ther sources reporting the same story?\n* T - Is the story **T**imely?\n\nFor more on media literacy please check out [Media Smarts](https://mediasmarts.ca/digital-media-literacy/general-information/digital-media-literacy-fundamentals)",
      "created_utc": 1740009449.0,
      "score": 10
    },
    {
      "id": "mdomrv7",
      "body": "We’ll get through this 🫂 I hope your move goes well",
      "created_utc": 1739998678.0,
      "score": 1
    },
    {
      "id": "mdp95li",
      "body": "So glad this has worked for you!! And thanks for the heads up about these meds, I would never have thought that just a 5 MG increase would make so much of a difference!!",
      "created_utc": 1740004796.0,
      "score": 1
    },
    {
      "id": "mdpi4iw",
      "body": "thats fine lmfao, i kinda figured that would happen, but had some hope somebody would actually realize it from my input, ty for being one of them lol.",
      "created_utc": 1740007490.0,
      "score": 6
    },
    {
      "id": "mdpie19",
      "body": "I agree with that full heartedly, ty for explaining.",
      "created_utc": 1740007572.0,
      "score": 0
    },
    {
      "id": "mdoe005",
      "body": "People in these support subreddits tend to generealy be supportive. Although, of course, with a limit, you can seek help or vent in the sub. You can even talk to us if it helps to cope.",
      "created_utc": 1739996353.0,
      "score": 1
    },
    {
      "id": "mdpadic",
      "body": "Could you reach out to some local volunteer groups? I met a few great friends, after moving across state,  through volunteering. And I am sure that others in your community are also looking for more support, so I'm sure it would be easy to ban together with some like minds right now.",
      "created_utc": 1740005147.0,
      "score": 1
    },
    {
      "id": "mdoebs2",
      "body": "[removed]",
      "created_utc": 1739996439.0,
      "score": -3
    },
    {
      "id": "mdojmkt",
      "body": "Are you proud to fear-monger disinformation?",
      "created_utc": 1739997848.0,
      "score": -2
    },
    {
      "id": "mdprcmg",
      "body": "For nonfiction, anything by Alison Weir is a good place to start. I especially enjoyed *The Children of Henry VIII.*\n\n\nFiction-wise, Hilary Mantel's trilogy on Thomas Cromwell is fantastic - *Wolf Hall* and *The Mirror & The Light* are some of my all-time favorites - but it's also super dense. If you want something a little lighter, I really enjoyed CJ Sansom's Shardlake series. It's a mystery series set in the later years of Henry VIII's reign and after his death. The main character is a lawyer. There's a recent miniseries of the first novel in the series, but I haven't had a chance to see it yet.",
      "created_utc": 1740010408.0,
      "score": 21
    },
    {
      "id": "mdpkdz5",
      "body": "Wow, very eye opening comment. For as long as I can remember, I’ve been obsessed with reading about everything that pops into my mind on Wikipedia, even to the point that I will just stay in bed all day scrolling. I’m always trying to learn more to understand the world. Totally makes sense that it’s driven by anxiety rather than just deep curiosity.",
      "created_utc": 1740008207.0,
      "score": 21
    },
    {
      "id": "mdote0y",
      "body": "These are all excellent points, and tips. The most important factor in all of it is being able to look at your own behavior and see when you are doing things against your long-term goals.\n\nChanging is hard, but don't let small back-steps bother you. Small mistakes don't matter, what matters is keeping up new habits regardless. They will eventually replace the old ones.",
      "created_utc": 1740000439.0,
      "score": 7
    },
    {
      "id": "mdpcj2p",
      "body": "I’m glad it’s helped you too! \n\nMy Twitter is linked to my college email that I no longer have access to. For years I contemplated creating a new account and decided it was unnecessary. Definitely a huge blessing in disguise!",
      "created_utc": 1740005777.0,
      "score": 2
    },
    {
      "id": "mdpv61u",
      "body": "Thank you sooo much😀",
      "created_utc": 1740011625.0,
      "score": 2
    },
    {
      "id": "mdpuz5x",
      "body": "I was very hesitant to go from 20mg to 30mg (a 20 + a 10), so I’m going up slowly going to 25mg with the help of my pill cutter.",
      "created_utc": 1740011563.0,
      "score": 1
    },
    {
      "id": "mdogm19",
      "body": "Dunno why I’m getting downvoted for asking a reasonable question, especially since I thought you meant a support group of friends irl (which I don’t have). But yeah, hopefully I’ll be able to find some support on here",
      "created_utc": 1739997047.0,
      "score": 2
    },
    {
      "id": "mdp9iih",
      "body": "Lol I've just read quite a few jerky remarks, and seen a few so bad they got deleted. I doubt this sub is anyone's support group!",
      "created_utc": 1740004899.0,
      "score": 1
    },
    {
      "id": "mdog2cp",
      "body": "Anxiety medications aren’t a prophylactic like a vaccine. It’s a treatment. Many medications being available doesn’t suddenly stop people from developing anxiety, nor does it remove anxiety entirely. It’s gives people a more balanced brain chemistry so they can learn to cope with their anxiety appropriately. You can’t learn to cope when you’re in an adrenaline overload 24/7. Maybe your personal anxiety isn’t severe enough to need medication, but that isn’t a fact for many people who would be dead otherwise. \n\nHe’s already coming after my own health coverage and ability to receive any sort of health care, and I can’t help but imagine that will spiral out until we’re all suddenly left without any help or access to care. Not to mention taking away my ability to leave the country, or have protections against any discrimination whether that be work or housing or just on the street. \n\nI hope your stance remains the same when the leopards come to eat your face.",
      "created_utc": 1739996901.0,
      "score": 3
    },
    {
      "id": "mdom82n",
      "body": "This subreddit prohibits posting misinformation, negative generalizations, and dehumanizing speech.\n\nYou can learn to identify misinformation with the SPOT technique:\n\n* S - is this a credible news **S**ource?\n* P - Is this **P**erspective biased?\n* O - Are **O**ther sources reporting the same story?\n* T - Is the story **T**imely?\n\nFor more on media literacy please check out [Media Smarts](https://mediasmarts.ca/digital-media-literacy/general-information/digital-media-literacy-fundamentals)",
      "created_utc": 1739998532.0,
      "score": 0
    },
    {
      "id": "mdok4rw",
      "body": "How so? What part is fear mongering? You can go on the White House website and read it for yourself. It’s in plain black and white.",
      "created_utc": 1739997983.0,
      "score": 2
    },
    {
      "id": "mdpmsas",
      "body": "It’s so sneaky too, because curiosity and learning are seen as valuable and good uses of time. But, are you in control or is the process?\n\nI spent the first year of Covid finding every source I could to know more and understand what was happening, but I wasn’t in control. I couldn’t stop and I felt compelled to keep going. Compare that to trying to teach myself meditation and mindfulness. I am the one in control and seeking the learning and I can stop when I’m overwhelmed.\n\nNow, I’m not saying I fixed this problem for myself. This new administration has me back in old habits, but I’m recognizing when I’m not the one in control and slowly trying to get that control back.",
      "created_utc": 1740008974.0,
      "score": 15
    },
    {
      "id": "mdogxq0",
      "body": "Yes, I did mean irl support group like friends and family in that reply.\n\nOnline support groups can work to some extent but it's very limited and honestly some can be so fake lol.",
      "created_utc": 1739997134.0,
      "score": 1
    }
  ]
}