{
  "id": "1gei63s",
  "title": "I Had a Panic Attack at Work, and My Boss Surprised Me",
  "selftext": "Hi everyone,\n\nI wanted to share something that happened yesterday. I've been dealing with anxiety for years, but I've always managed to keep it under wraps at work. Yesterday, during a team meeting, I felt it building up the rapid heartbeat, the dizziness, the overwhelming urge to flee.\n\nBefore I knew it, I was hyperventilating in front of everyone. I was mortified. I thought, \"Great, now everyone knows I'm a mess.\"\n\nBut then something unexpected happened. My boss calmly ended the meeting and sat down next to me. She didn't bombard me with questions or make a scene. She just said, \"It's okay. Let's take a walk.\"\n\nWe went outside, and she shared that her sister also struggles with anxiety. She told me to take the rest of the day off and offered resources our company provides for mental health.\n\nI always thought showing vulnerability at work was a weakness, but her kindness showed me otherwise. If you're struggling, please know that there are people who will understand.\n",
  "created_utc": 1730162702.0,
  "score": 1735,
  "num_comments": 61,
  "url": "https://www.reddit.com/r/Anxiety/comments/1gei63s/i_had_a_panic_attack_at_work_and_my_boss/",
  "comments": [
    {
      "id": "lu9v488",
      "body": "That's amazing! Thank you for sharing this!",
      "created_utc": 1730163119.0,
      "score": 348
    },
    {
      "id": "lu9wezx",
      "body": "That's the kind of boss we all need.  Glad it ended on a positive note!",
      "created_utc": 1730163552.0,
      "score": 155
    },
    {
      "id": "lu9wir5",
      "body": "I’m really happy you have that support from your boss! Mine is similarly empathetic and it makes a huge difference!",
      "created_utc": 1730163586.0,
      "score": 62
    },
    {
      "id": "lu9yesz",
      "body": "Thank you so much for sharing this. Your story really hit home because it shows the kind of compassion and understanding I wish more people had in the workplace. It’s inspiring to hear that your boss not only handled the situation gracefully but also took the time to make sure you felt supported. That’s not something everyone gets to experience, and it makes a huge difference.\n\nFor me, managing anxiety has been a journey, and it's not something I’ve been able to openly share in a work environment. I’ve struggled with anxiety for years and often feel the pressure to keep it hidden, especially around others who might not understand what I’m going through. There have been times I wanted to express what I was dealing with but held back, afraid that it might be seen as weakness or even hurt my work relationships. Not everyone realizes how much courage it takes to even show up to work when you're battling anxiety beneath the surface.\n\nReading stories like yours gives me hope that one day more workplaces will create environments where employees can be open about their mental health without feeling judged. Your boss's kindness proves that there are people out there who genuinely understand and want to help, which is something I’ve longed for myself. I think we all deserve to work in places where our mental well-being is supported, not sidelined.\n\nThank you again for sharing this experience and reminding me—and all of us—that empathy does exist in the workplace. It’s a reminder to keep advocating for ourselves and to believe that one day, workplaces everywhere will start to see the value in creating a safe space for everyone. I’m genuinely happy you had this experience, and I hope it helps inspire more of us to speak up or seek out environments that embrace mental health.",
      "created_utc": 1730164233.0,
      "score": 29
    },
    {
      "id": "lua4686",
      "body": "Tell your boss that a stranger on internet thinks she's cool and deserves all the happiness in the world.\n\nIt's difficult to manage anxiety as is, and work makes the pressure go up. A good boss does exactly what yours did and I'm glad you felt better after their actions. \n\n\nTake care of yourself, go on a walk, do your favorite stuff and remember that you're in control of yourself, not your anxiety! ( Saying this as I struggle heavily myself )",
      "created_utc": 1730166165.0,
      "score": 24
    },
    {
      "id": "luagixu",
      "body": "Your boss is a human.",
      "created_utc": 1730170414.0,
      "score": 15
    },
    {
      "id": "lu9ykf2",
      "body": "Having a good boss that understands the human side of business is so nice. I miss my first boss so much cause he genuinely cared for everyone he worked with even though the company didn't. Cherish those people.",
      "created_utc": 1730164288.0,
      "score": 8
    },
    {
      "id": "lu9yrno",
      "body": "A lot of people suffer from some anxieties and can sympathize. I have trouble with situations most others can handle, but can do some things that many struggle with.",
      "created_utc": 1730164354.0,
      "score": 7
    },
    {
      "id": "lu9zy59",
      "body": "This has just very recently started to happen to me and I’m in my late 40’s.  I have a theory about it I want to share and see if others can relate or if it even could help others.  I was always anxious, self conscious, worried etc.  But how my limbic system reacted to it was to fight.  Slam caffeine and nicotine, attack, conquer, go home and drink to calm down.  Rinse and repeat.  Lately, I’ve become physically weaker, it’s a combination of age and if I am honest “comfort seeking” mentality.  I think my Limbic system who knows me better than I do understands that deep down if I stood my ground and tried to fight whatever threat is facing me that I would crumble and probably die.  Therefore the “flight” half of the reaction is starting to happen.  \n\nMy plan:  Get stronger. Physically, emotionally, and spiritually.  And try to dig down and find the root cause of my insecurity and just deal with it somehow.  I need to convince my Lizard Brain I can still fight and somehow make it less twitchy in the process.",
      "created_utc": 1730164742.0,
      "score": 7
    },
    {
      "id": "lua1w5p",
      "body": "This is the response I strive to give to my team. I’m glad you have good support.",
      "created_utc": 1730165396.0,
      "score": 6
    },
    {
      "id": "luab46r",
      "body": "I was in the ER once with a really bad panic attack and messaged my supervisor to let her know i wasn’t coming in and what was happening. She said the same thing happened to her when she was around my age. It happens to way more people then you think, and by speaking up about it it helps others feel less alone.",
      "created_utc": 1730168489.0,
      "score": 5
    },
    {
      "id": "lua2jda",
      "body": "That’s a great leader & a good boss!",
      "created_utc": 1730165614.0,
      "score": 5
    },
    {
      "id": "lua3om3",
      "body": "Gosh, this give me hope. What a great gesture. You’re lucky to have such an empathetic boss.",
      "created_utc": 1730166001.0,
      "score": 3
    },
    {
      "id": "lua3cbq",
      "body": "This is beautiful. It’s wonderful to hear how gentle and understanding she was. She understands that you’re a human, and that you are allowed to feel.",
      "created_utc": 1730165884.0,
      "score": 2
    },
    {
      "id": "lua8ef7",
      "body": "I am so glad you had this positive experience OP! Your boss sounds amazing 👏🏻 I wish all of them were that way.\n\nI used to hide my anxiety and it made it so much worse. After I told my coworkers how I was feeling, they were so supportive and kind. Many of them had mental health struggles too, and it was so refreshing to be open and honest about it.",
      "created_utc": 1730167571.0,
      "score": 2
    },
    {
      "id": "luaz9vr",
      "body": "I started at new position two weeks ago. Same building, different team and managers. I was open from the start that I have ADHD, but I work on it, I'm on meds and I use my ADHD as a superpower, not weakness. That's not an excuse but more as an explanation, so noone is surprised if I need more time learning sth new. I was understanded and supported over that. I have two managers and they both said - yeah, I probably have that too but haven't got a proper diagnosis yet. And when I fucked up it was a talk about where I made mistake and how to better myself and to always ask for help if I'm stuck.",
      "created_utc": 1730178811.0,
      "score": 2
    },
    {
      "id": "lubr6tm",
      "body": "Very understanding boss god bless",
      "created_utc": 1730197272.0,
      "score": 2
    },
    {
      "id": "lucfy2b",
      "body": "What helped me a lot when I knew that I was going to a very stressful situation, like a presentation, was to take 20 mg of Propranolol.  It just controls how the body reacts to anxiety like fast heartbeat, sweating, etc.  I don't take it everyday, just in these situations.",
      "created_utc": 1730208395.0,
      "score": 2
    },
    {
      "id": "lucjcwn",
      "body": "Wow thats such a blessing to have a superior like that. I had a panic attack and my job was ready to fire me because I was too much of a \"risk\". And I work from home.",
      "created_utc": 1730209590.0,
      "score": 2
    },
    {
      "id": "lua6ip5",
      "body": "I got demoted for it.\n\nLifting pipe with a big bridge crane and had a panic attack and someone took over then i became a parts cleaner.\n\nNote I was doing this job well for many months before this experience...",
      "created_utc": 1730166935.0,
      "score": 3
    },
    {
      "id": "lua0b9o",
      "body": "Kudos to your boss! 👏🏻👏🏻👏🏻",
      "created_utc": 1730164863.0,
      "score": 1
    },
    {
      "id": "lua5135",
      "body": "Love that!! It’s great when you have a workplace that will support and discipline you ! My boss lets me lay on his floor when I’m having an attack and then he’ll put a video on his computer for us to watch and he’ll just talk to me about random shit to take my mind off it!",
      "created_utc": 1730166450.0,
      "score": 1
    },
    {
      "id": "lua5n0z",
      "body": "Thank you so much for sharing your experience.  I had the blessing of an empathic and kind boss twice before and they are amazing to have.  I'm glad you have this person as your boss!",
      "created_utc": 1730166644.0,
      "score": 1
    },
    {
      "id": "lua7auc",
      "body": "Great. I would like to work in a company like that. She deserves appreciation for her understanding of mental health needs.",
      "created_utc": 1730167200.0,
      "score": 1
    },
    {
      "id": "lua7c88",
      "body": "Your boss is a perfect example of how people in leadership positions supposed to be. Kind boss = kind team",
      "created_utc": 1730167212.0,
      "score": 1
    },
    {
      "id": "luabvku",
      "body": "This is so awesome and so validating .",
      "created_utc": 1730168748.0,
      "score": 1
    },
    {
      "id": "luac118",
      "body": "I love this!",
      "created_utc": 1730168800.0,
      "score": 1
    },
    {
      "id": "luacv6t",
      "body": "That’s so sweet. Wow. Theres still people out there in the world",
      "created_utc": 1730169091.0,
      "score": 1
    },
    {
      "id": "luadrj2",
      "body": "That's so much better than most of the stories you read and hear. It ALMOST gives a bit of faith in humanity.",
      "created_utc": 1730169408.0,
      "score": 1
    },
    {
      "id": "luagcyr",
      "body": "It's a health issue, and having a boss like that is awesome.  She was understanding and empathetic.  I like her.",
      "created_utc": 1730170353.0,
      "score": 1
    },
    {
      "id": "luai63u",
      "body": "For me it depends on the boss. \nBecause my old boss had 0 compassion or empathy honestly. \nI remember when they let me go I was having a bad panic attack obviously and they are like \"do ya want water or something\" \n\n:|",
      "created_utc": 1730171021.0,
      "score": 1
    },
    {
      "id": "luaiaxj",
      "body": "Your boss is incredible. Definitely let her know how much it meant to you!",
      "created_utc": 1730171073.0,
      "score": 1
    },
    {
      "id": "luake8x",
      "body": "Thanks for sharing this.\n\nHope you are doing better.",
      "created_utc": 1730171866.0,
      "score": 1
    },
    {
      "id": "luck4tm",
      "body": "Oh, man oh man oh man ooooo man. If I had a nickel for every time I had a panic attack at work, I’d be a rich man. Had to be brought to the hospital TWICE because of this. \n\nActually woke up this morning feeling a little uneasy. It’s more of an uphill battle that I have to fight off every day. I’ve even had to lock myself in the men’s room with my meditation music on in the background.",
      "created_utc": 1730209850.0,
      "score": 1
    },
    {
      "id": "lucrpfk",
      "body": "That is a great story! \n\nI kept waiting for the OP to say \"She told me to take the rest of the day off, gave me a Valium, and....\" That would have made her boss of the year! Just kidding. \n\nThanks for sharing this story!",
      "created_utc": 1730212364.0,
      "score": 1
    },
    {
      "id": "lud032e",
      "body": "Y know, not discouraging or giving off negative vibes but\n\nThese kinds of people, don't appear much in the world nowadays.\n\n\nCheers to people out there with anxiety, you will find a way out. Stop saying things like i won't heal or shit's gonna keep happening for the rest of my life",
      "created_utc": 1730215031.0,
      "score": 1
    },
    {
      "id": "lud0mkk",
      "body": "Yeah I don’t think that works if you’re a man. They just basically tell me that if it happens again, I’m getting written up",
      "created_utc": 1730215201.0,
      "score": 1
    },
    {
      "id": "lud2lb4",
      "body": "This made me smile. I wish I had a boss like that and I hope I’ll find someone as nice and empathetic as her for my new workplace 🙏🏻🤗",
      "created_utc": 1730215810.0,
      "score": 1
    },
    {
      "id": "lud5o5e",
      "body": "Your boss is AMAZING! One thing I learned in social situations - I would tell people that I have social anxiety and I'm trying to work through it. I would ask for their patience. As it turned out, most people were very understanding and wanted to help. The people that didn't, in my opinion, were not worth talking to.",
      "created_utc": 1730216757.0,
      "score": 1
    },
    {
      "id": "lud5wl4",
      "body": "Going through a rough day, and it bought a smile on my face ❤️kind people do exist",
      "created_utc": 1730216828.0,
      "score": 1
    },
    {
      "id": "ludb24k",
      "body": "Omg your boss is a hero ! Great boss!",
      "created_utc": 1730218403.0,
      "score": 1
    },
    {
      "id": "ludk800",
      "body": "Great boss and do take care of yourself though.",
      "created_utc": 1730221186.0,
      "score": 1
    },
    {
      "id": "lueesje",
      "body": "Awe my manager did this with me yesterday, I broke down and she took me aside and opened up to me as well and it made me feel safe and listened to and I was able to do my whole 8 hour shift after",
      "created_utc": 1730230314.0,
      "score": 1
    },
    {
      "id": "luf0gfj",
      "body": "That sounds really tough, but I’m so glad your boss handled it so well.",
      "created_utc": 1730236765.0,
      "score": 1
    },
    {
      "id": "luf93xi",
      "body": "Your Boss is a kind understanding soul. I wish all bosses were like this. I had an amazing boss once. I loved working for her",
      "created_utc": 1730239480.0,
      "score": 1
    },
    {
      "id": "lugpygj",
      "body": "I was having one at work once and it was so bad I was super dizzy and had to have my husband come pick me up. My boss came outside and stood with me and we talked about how hard it is since both our moms had died recently, he stayed until my husband got there",
      "created_utc": 1730257412.0,
      "score": 1
    },
    {
      "id": "luhvasn",
      "body": "I worked for a place called movie tavern. I was a cook. I had a major anxiety attack one day. They just left me to hyperventilate balled up in the corner of the kitchen by the walk in, for 4 hrs.",
      "created_utc": 1730281730.0,
      "score": 1
    },
    {
      "id": "luiawtn",
      "body": "Thank you",
      "created_utc": 1730289886.0,
      "score": 1
    },
    {
      "id": "lumwt7x",
      "body": "I LOVE your boss for that",
      "created_utc": 1730342594.0,
      "score": 1
    },
    {
      "id": "luri8dz",
      "body": "I get I'm catching anxiety attacks everyday cannot get a handle on it been trying hard to stay out my head but it's hard not even getting a good solid sleep. Only sleeping about 3 hours a night and that's with medication. I just jump in and out of sleep. Don't know what to do. Need answers.",
      "created_utc": 1730410831.0,
      "score": 1
    },
    {
      "id": "lv4joil",
      "body": "Mate you won the lottery of bosses",
      "created_utc": 1730604333.0,
      "score": 1
    },
    {
      "id": "lwqrnef",
      "body": "Some company stole your post and modified it to promote their services. \n\nThe Ahead App. ",
      "created_utc": 1731417194.0,
      "score": 1
    },
    {
      "id": "mt784te",
      "body": "I had my first panic attack at work today. Been with that company for almost six years now and it’s never happened before. Anyways, every Monday my team and I briefly meet to discuss what each of us have going on for the week. That’s it. Literally could not be easier. When it was my turn to speak, for whatever reason, my heart began racing and my voice trembled harder that it ever had before. That’s when the real panic set in and I completely went blank for a few seconds. Ended up stepping outside and faking a “headache.” It was absolutely humiliating. Once I got back everyone was asking if I was okay and that I looked red. I told them it happened earlier in the week and that I’m gonna get it checked out. I know it’s anxiety, and they probably know too, but I’m still going to the doctor to get this figured out. I’ve dealt with anxiety my entire life but always thought it’d get better as I got older. It’s actually getting worse. I’m really glad to hear your boss was kind and supportive though. That makes all the difference in the world.",
      "created_utc": 1747693527.0,
      "score": 1
    },
    {
      "id": "lubbwbb",
      "body": "I would have been différent if you were a man….we don’t have that kind of understanding When we suffer",
      "created_utc": 1730186945.0,
      "score": -1
    },
    {
      "id": "lu9v7jo",
      "body": "You're more than welcome, I'm glad you found it helpful",
      "created_utc": 1730163150.0,
      "score": 90
    },
    {
      "id": "luaeyxl",
      "body": "I think the reason you were demoted is because it’s actually hazardous you’re operating a big machinery it can be deadly for you or others involved. It sucks that you were demoted but they did it for safety reasons.",
      "created_utc": 1730169840.0,
      "score": 2
    },
    {
      "id": "luac5fq",
      "body": "Great boss, it scary to be outed as afflicted by anything at work.",
      "created_utc": 1730168842.0,
      "score": 26
    },
    {
      "id": "luamjru",
      "body": "I don't have physical panic attacks,it's all internal or mental they didn't know,I was just kinda frozen for alittle bit,and after that I went back to work. Maybe 15mins later.",
      "created_utc": 1730172723.0,
      "score": 1
    },
    {
      "id": "luaqy01",
      "body": "Then they most likely interpreted it as you couldn’t handle to job after all despite having a solid history. If it’s possible try to reapply for that position? Maybe even with another company if possible? Don’t let it bother you so much that industry is very brutal supervisors want things done quickly so you staying still for 15 minutes to them was a waste of time.",
      "created_utc": 1730174601.0,
      "score": 2
    },
    {
      "id": "lub3cyt",
      "body": "There is only one controller per bridge crane so I had my little internal freak out one guy that had a in with the higher ups took the controller and used it for about 10 or 15mins to get it done after that I went back as usual until the next day then I became a parts cleaner. (Horrible job btw)\n\nThis was a few years ago and I'm off to bigger and better things.\n\nIt really wasn't a big deal,I was never unsafe with the crane I did a fine job just froze alittle with my axinety attack, in fact by this point I have been working there for around 4/5 mouths.",
      "created_utc": 1730181248.0,
      "score": 1
    },
    {
      "id": "lub3ivn",
      "body": "The job title was called ( coordinator) moved parts to the fitters then to the welders looked at blueprints to determine the parts needed next and load parts for alike jobs on a semi trailer.",
      "created_utc": 1730181352.0,
      "score": 1
    }
  ]
}