{
  "id": "1fopydz",
  "title": "What screams \"I'm not feeling good mentally at all\"?",
  "selftext": "For me, I know I’m bad off when I’ve lost my appetite. I LOVE food.",
  "created_utc": 1727218891.0,
  "score": 876,
  "num_comments": 364,
  "url": "https://www.reddit.com/r/Anxiety/comments/1fopydz/what_screams_im_not_feeling_good_mentally_at_all/",
  "comments": [
    {
      "id": "lorszdw",
      "body": "This may be silly but not listening to music. That’s usually the first sign for me and I don’t always notice it right away.",
      "created_utc": 1727220103.0,
      "score": 1288
    },
    {
      "id": "lorpq42",
      "body": "[removed]",
      "created_utc": 1727218930.0,
      "score": 806
    },
    {
      "id": "lorqj1b",
      "body": "Not desiring to eat, no interest in surroundings, feeling tired all the time, avoiding friends and family.",
      "created_utc": 1727219221.0,
      "score": 314
    },
    {
      "id": "lorpxuu",
      "body": "[removed]",
      "created_utc": 1727219008.0,
      "score": 635
    },
    {
      "id": "lortedg",
      "body": "Hard to get ahold of through text/calls, no interest in reaching out or texting/calling back for prolonged periods of time",
      "created_utc": 1727220253.0,
      "score": 252
    },
    {
      "id": "lorpu4g",
      "body": "[removed]",
      "created_utc": 1727218970.0,
      "score": 370
    },
    {
      "id": "lorvbwc",
      "body": "Lingering in bed...like most of the day.",
      "created_utc": 1727220951.0,
      "score": 179
    },
    {
      "id": "lort6rg",
      "body": "Personal hygiene, for example brushing my teeth becomes unimportant or really hard mentally to do, now I know about it I catch it and the thoughts and force myself to do it!",
      "created_utc": 1727220177.0,
      "score": 159
    },
    {
      "id": "lorxmpx",
      "body": "Being filled with hatred and mood swings",
      "created_utc": 1727221795.0,
      "score": 112
    },
    {
      "id": "loru5i2",
      "body": "For me: getting angry easily, feeling lost, numb, not socializing, no desire to do any tasks or errands, always feeling tired but can't sleep.",
      "created_utc": 1727220523.0,
      "score": 96
    },
    {
      "id": "lortor0",
      "body": "Snapping at people randomly not having motivation to read",
      "created_utc": 1727220357.0,
      "score": 90
    },
    {
      "id": "lorxy4w",
      "body": "I cancel plans a lot... and then I spiral about canceling so often and thinking my friends hate me for it.",
      "created_utc": 1727221912.0,
      "score": 72
    },
    {
      "id": "losmywt",
      "body": "Can’t sleep but feeling wired with anxious energy and ruminating fearful thoughts with worry that something bad is about to happen or im in trouble. Snappy. Not doing chores and staying in bed. Feeling scared. Isolating myself and not talking",
      "created_utc": 1727231424.0,
      "score": 54
    },
    {
      "id": "lorwbq5",
      "body": "How clean or dirty my house is. It correlates very closely to my mental health",
      "created_utc": 1727221317.0,
      "score": 90
    },
    {
      "id": "los3lg3",
      "body": "This is more depression related, but I know it’s getting bad when I obsessively have to budget and conserve my energy over the tiniest most mundane tasks. When I have to keep putting off a small task that would take like 10 minutes at most because the idea of even having to move my body any more is completely unbearable. E.g, “I just took a shower which exhausted all my focus ability and energy, and now I won’t be able to feed myself. Guess I’ll just go lay down with wet hair and starve because that’s easier and requires less movement”.\n\nThis gets extra difficult when you have a partner who you love dearly but basically can’t show up for on your bad days, because keeping yourself alive is already eating up ALL your precious focus and energy. You then have no more to spend on them beyond maybe short conversations. 🫠\n\nFor anxiety, it’s getting bad when my brain feeds me some wild-ass OCD image about how doing something mundane like washing the dishes or walking down my hallway in socks could potentially kill or injure me. Fun!!!!!",
      "created_utc": 1727224022.0,
      "score": 38
    },
    {
      "id": "lorrqd6",
      "body": "My escape from everything whenever it gets heavy is going out. I know it's getting bad when going out no longer works",
      "created_utc": 1727219653.0,
      "score": 34
    },
    {
      "id": "lortg43",
      "body": "the appetite one is big. Feeling nauseous after every bite",
      "created_utc": 1727220270.0,
      "score": 57
    },
    {
      "id": "lorw6ak",
      "body": "I work with kids and I pride myself on patience with them. \n\nI know I'm off on days where I'm just a little snipper than usual.",
      "created_utc": 1727221261.0,
      "score": 25
    },
    {
      "id": "losaft1",
      "body": "Apathy. Not caring about anything at all be it chores, people, hobbies, etc.",
      "created_utc": 1727226590.0,
      "score": 20
    },
    {
      "id": "lorxflq",
      "body": "I know I’m bad off when I stop taking care of myself. Stop leaving the house. Zoning out.",
      "created_utc": 1727221722.0,
      "score": 19
    },
    {
      "id": "los7cxx",
      "body": "Crying/being on the verge of crying",
      "created_utc": 1727225414.0,
      "score": 20
    },
    {
      "id": "lorrcfk",
      "body": "Yeah emotional regulation out the window. Sucks bc o don’t always notice it immediately",
      "created_utc": 1727219514.0,
      "score": 18
    },
    {
      "id": "lot0c1p",
      "body": "This thread is calling me the fuck out",
      "created_utc": 1727237310.0,
      "score": 18
    },
    {
      "id": "los6i1p",
      "body": "I can’t bring myself to clean my house so it turns into a pig sty",
      "created_utc": 1727225092.0,
      "score": 16
    },
    {
      "id": "losfqgv",
      "body": "For me, my appearance. I generally don’t wear much makeup for skin health. However, when I am struggling, you can really see it in my face and hair. I tend to be disheveled as fuck in hard times, just trying to keep on.",
      "created_utc": 1727228618.0,
      "score": 14
    },
    {
      "id": "lorzd6a",
      "body": "For me it's dreaming so intensely that I either wake up or remember the dream in the morning. It only happens to me before or during a very bad mental phase and it's always nightmares full of fear and loss.\n\nAlso, due to that (and generally): Sleeping but getting increasingly tired nonetheless. It's like no amount of sleep in this world could actually have my brain rest properly.",
      "created_utc": 1727222440.0,
      "score": 13
    },
    {
      "id": "loskwla",
      "body": "“i’m fine”",
      "created_utc": 1727230604.0,
      "score": 13
    },
    {
      "id": "lotznhl",
      "body": "Nothing sounds good. Everything pisses you off",
      "created_utc": 1727259637.0,
      "score": 12
    },
    {
      "id": "lortqh9",
      "body": "I get super fatigued and tense and start getting super dizzy. Feeling over the edge or ready to run as if someone is chasing me. I sometimes don't perceive it at first until it has built up, and I'm edgy and dizzy.",
      "created_utc": 1727220374.0,
      "score": 11
    },
    {
      "id": "lorzlp5",
      "body": "I pick at my face when I'm anxious. Plucking beard hairs. If my beard is patchy and full of holes, I'm having a bad time.",
      "created_utc": 1727222530.0,
      "score": 11
    },
    {
      "id": "lose0fi",
      "body": "when i literally can’t force myself out of bed even if i wanted to",
      "created_utc": 1727227961.0,
      "score": 10
    },
    {
      "id": "losh739",
      "body": "Lethargy, procrastination, TV & YouTube, not eating at all, house is a mess, can't leave the house, depression.",
      "created_utc": 1727229173.0,
      "score": 9
    },
    {
      "id": "lotr5cr",
      "body": "1. Having anxiety and depression for so long to the point you start to believe that this is normal and everyone else feels the same way only recently (have I found out that feeling like this isn’t normal😱😱)\n\n2. doom scrolling through social media at 5 am because you cant fall asleep even though you are fucking exhausted.\n\n3. Hating and dreading every past, current, and future moment. \nIdek anymore I’m just rambling anything to pass the time I guess 🥹 Loneliness is a killer",
      "created_utc": 1727253886.0,
      "score": 10
    },
    {
      "id": "lorrm0k",
      "body": "Overthinking, not sleeping or eating.",
      "created_utc": 1727219610.0,
      "score": 8
    },
    {
      "id": "lorv21e",
      "body": "For me, not showering. \nI don’t know what it is, all I can think about is that I love to do it so much that I don’t want to ruin it with my mood.\nOnce my gf realizes my towel is on the same place for 2 straight days, she knows something is wrong.",
      "created_utc": 1727220851.0,
      "score": 9
    },
    {
      "id": "lorz1cs",
      "body": "The more time I lose the more I know I’m not doing okay.",
      "created_utc": 1727222318.0,
      "score": 8
    },
    {
      "id": "losipqp",
      "body": "Feeling zero joy when doing activities that typically make you happy. It's like you're living life on autopilot.",
      "created_utc": 1727229756.0,
      "score": 7
    },
    {
      "id": "losn6po",
      "body": "Scalp picking",
      "created_utc": 1727231509.0,
      "score": 9
    },
    {
      "id": "lothuh8",
      "body": "Avoiding hanging out and not reaching out to beloved ones and friends for months at once.",
      "created_utc": 1727247389.0,
      "score": 7
    },
    {
      "id": "los15iw",
      "body": "Impulsive urges to break things/hurt myself all the time",
      "created_utc": 1727223111.0,
      "score": 7
    },
    {
      "id": "losjdvp",
      "body": "No appetite, no interest in even thinking about my favorite activities, doom scrolling all day, not getting out of bed, poor sleep, wanting to pull away from friends",
      "created_utc": 1727230015.0,
      "score": 7
    },
    {
      "id": "losmgzy",
      "body": "When I have trouble leaving my house and when its physically difficult to eat anything.",
      "created_utc": 1727231225.0,
      "score": 7
    },
    {
      "id": "losoc7w",
      "body": "Nausea, impulsivity, and crying over little things",
      "created_utc": 1727231970.0,
      "score": 5
    },
    {
      "id": "losp03g",
      "body": "Posting too much on social media. Spending too much time on social media. The internet in general, particularly the last 5-10 years.",
      "created_utc": 1727232239.0,
      "score": 7
    },
    {
      "id": "lot58ws",
      "body": "Not being able to concentrate, crying having to do anything (go to work, grocery shopping, doing laundry, showering etc), self harming, no interest in anything anymore (not talking to friends, going places, ignoring every responsibility), worrying about anything bad happening to my family.",
      "created_utc": 1727239857.0,
      "score": 6
    },
    {
      "id": "lotf0t6",
      "body": "Spiraling into bad habits. I'll spend hours on YouTube & Reddit to fill myself with fast media & procrastinate on my tasks.",
      "created_utc": 1727245568.0,
      "score": 6
    },
    {
      "id": "low561e",
      "body": "For me, everything seems like too much work. Even things I love to do sound exhausting.",
      "created_utc": 1727287713.0,
      "score": 5
    },
    {
      "id": "los8ztj",
      "body": "This might be a weird one, but constant deja-vus. Often accompanied by a feeling of stomach-dropping. I get them even multiple times a day when I'm in a really bad place.",
      "created_utc": 1727226033.0,
      "score": 5
    },
    {
      "id": "loso1bj",
      "body": "Binge eating",
      "created_utc": 1727231850.0,
      "score": 4
    },
    {
      "id": "losrsuo",
      "body": "All these symptoms you guys mention here is like my everyday life for years 😭😭😭 maybe minus \"not listening to music\"",
      "created_utc": 1727233409.0,
      "score": 5
    },
    {
      "id": "losymqv",
      "body": "Self doubt and worry.",
      "created_utc": 1727236474.0,
      "score": 5
    },
    {
      "id": "lotw5lp",
      "body": "I don’t answer to peoples text because ”I’m too exhausted” \n\nthen sometimes I end up not answering them for weeks",
      "created_utc": 1727257399.0,
      "score": 5
    },
    {
      "id": "los2hc8",
      "body": "My heart starts beating incredibly fast",
      "created_utc": 1727223605.0,
      "score": 4
    },
    {
      "id": "los3mag",
      "body": "Not eating, losing weight, being wired but tired, racing thoughts, stressing about everything. Not responding to texts",
      "created_utc": 1727224031.0,
      "score": 3
    },
    {
      "id": "losqadx",
      "body": "Self destructive behaviors. Getting angry at loved ones.",
      "created_utc": 1727232773.0,
      "score": 4
    },
    {
      "id": "lossr2n",
      "body": "When i notice i havent taken any pictures recently i know its been bad",
      "created_utc": 1727233812.0,
      "score": 4
    },
    {
      "id": "losv77y",
      "body": "Literally having the thought “I don’t feel good.”",
      "created_utc": 1727234883.0,
      "score": 4
    },
    {
      "id": "lot7umb",
      "body": "Oversleeping or not sleeping enough. Basically tired no matter what",
      "created_utc": 1727241266.0,
      "score": 4
    },
    {
      "id": "lou7f8a",
      "body": "Needing to know more and researching random useless stuff that creates more anxiety. For example, “I wonder if I can get fired for not emailing back” turns into a deep internet rabbit hole of workplace laws and reading Reddit posts.",
      "created_utc": 1727263834.0,
      "score": 3
    },
    {
      "id": "lovt9qc",
      "body": "for me the first signs my mental health is going in the pooper is that I barely sleep, or sleep all day, everything starts to get too overwhelming (noises, activities, eating) constant headaches and nausea, and absolutely no appetite ever.",
      "created_utc": 1727284055.0,
      "score": 3
    },
    {
      "id": "lovx4cd",
      "body": "I start having difficulties leaving the house and it becomes a vicious cycle where I end up feeling completely stuck inside a prison created by my own mind because of shame and anxiety (the consequence of years of emotional abuse). It’s horrible and breaking out of this cycle is extremely hard the longer it lasts the thought of leaving the house gives me massive anxiety",
      "created_utc": 1727285238.0,
      "score": 4
    },
    {
      "id": "low1s5r",
      "body": "Having no motivation to do anything",
      "created_utc": 1727286669.0,
      "score": 4
    },
    {
      "id": "loxkxeb",
      "body": "If we’re talking small signs, then it’s definitely stepping out of your routine esp. if you’re pretty strict with it. For me, it’s things like not really working out anymore, not doing chores or at least leaving them for days, not doing small stuff that usually makes me happy like putting on makeup etc or painting my nails. It’s like a ‘greyscale’ version of yourself. You’re still there but not really.",
      "created_utc": 1727304329.0,
      "score": 3
    },
    {
      "id": "loxq1k1",
      "body": "I can't concentrate on anything.",
      "created_utc": 1727306187.0,
      "score": 4
    },
    {
      "id": "los4yly",
      "body": "Staring into the abyss of aloneness (not loneliness) especially on the comedown of a relapse (I’m in recovery)",
      "created_utc": 1727224529.0,
      "score": 3
    },
    {
      "id": "los6t4u",
      "body": "Eating less than usual. This is a new one that I hope goes away.",
      "created_utc": 1727225208.0,
      "score": 3
    },
    {
      "id": "los90cc",
      "body": "withdrawing",
      "created_utc": 1727226040.0,
      "score": 3
    },
    {
      "id": "lose9k5",
      "body": "For me, personally, I'll stop caring about how I look, go without washing my hair/body, stay in bed, not get my book done, and if I have to get out of bed, you may catch me staring at the pain killers on the counter",
      "created_utc": 1727228059.0,
      "score": 3
    },
    {
      "id": "loskqw8",
      "body": "when i stop eating due to health anxiety",
      "created_utc": 1727230543.0,
      "score": 3
    },
    {
      "id": "losmyqy",
      "body": "Screaming",
      "created_utc": 1727231422.0,
      "score": 3
    },
    {
      "id": "lospksw",
      "body": "fucked up sleep schedule. went through a cycle of staying up till 4-7 am, sleeping til the after noon, possibly napping around 5. rinse and repeat",
      "created_utc": 1727232477.0,
      "score": 3
    },
    {
      "id": "losqs25",
      "body": "“I’m fine.”",
      "created_utc": 1727232978.0,
      "score": 3
    },
    {
      "id": "lostf19",
      "body": "Having bangs",
      "created_utc": 1727234102.0,
      "score": 3
    },
    {
      "id": "lot0u56",
      "body": "Sudden and Steep decline in personal hygiene",
      "created_utc": 1727237563.0,
      "score": 3
    },
    {
      "id": "lot1bka",
      "body": "Under sleeping and feeling of intense exhaustion. No appetite. Zoning out and being distant. Having a horrible time with socialization and social anxiety. Very on edge and hyper aware of everything and everyone.",
      "created_utc": 1727237809.0,
      "score": 3
    },
    {
      "id": "lot5rug",
      "body": "Being easily irritated and snappy at everything someone says, especially if they aren’t typically like that.",
      "created_utc": 1727240131.0,
      "score": 3
    },
    {
      "id": "lot5te5",
      "body": "I don‘t like to cook or bake anymore, because it doesn‘t give me any pleasure and just feels like a chore.",
      "created_utc": 1727240153.0,
      "score": 3
    },
    {
      "id": "lotww1l",
      "body": "having a messy room",
      "created_utc": 1727257887.0,
      "score": 3
    },
    {
      "id": "lotx7hi",
      "body": "When i am in my own little \"fight or flight\" world. Start ignoring life around me.",
      "created_utc": 1727258091.0,
      "score": 3
    },
    {
      "id": "lou0zel",
      "body": "When I have been sleeping for 10+ hours every day and still feel tired. 10/10 signs that I am not doing okay and feeling v heavy about something",
      "created_utc": 1727260434.0,
      "score": 3
    },
    {
      "id": "lou25rj",
      "body": "Messy room 😭",
      "created_utc": 1727261110.0,
      "score": 3
    },
    {
      "id": "lowajal",
      "body": "lack of motivation and exhaustion",
      "created_utc": 1727289387.0,
      "score": 3
    },
    {
      "id": "lorxvis",
      "body": "Binging",
      "created_utc": 1727221885.0,
      "score": 2
    },
    {
      "id": "lorxw10",
      "body": "I feel you on the food thing. If it’s been over 24 hours and I haven’t eaten, something is wrong af.",
      "created_utc": 1727221890.0,
      "score": 2
    },
    {
      "id": "loryk25",
      "body": "Tedious psychotic behavior...",
      "created_utc": 1727222140.0,
      "score": 2
    },
    {
      "id": "loryl4s",
      "body": "Bipolar mania.",
      "created_utc": 1727222151.0,
      "score": 2
    },
    {
      "id": "lorzowa",
      "body": "When every room is a mess, if I have a pile of food wrappers and empty cups on my bedside table, fuzzy teeth from not brushing for a fpl days, greasy hair, not bathing. Those are all when it gets really bad. So thankfully like twice a year or so unless I'm going through something very bad.",
      "created_utc": 1727222563.0,
      "score": 2
    },
    {
      "id": "los0bdo",
      "body": "When I don’t sing along to my favorite songs while I’m driving 😂",
      "created_utc": 1727222796.0,
      "score": 2
    },
    {
      "id": "los1v5t",
      "body": "When I pass a day not singing. If you can't hear me hum or sing I'm not doing good, chief.",
      "created_utc": 1727223376.0,
      "score": 2
    },
    {
      "id": "los2xm7",
      "body": " Normal stuff like doors opening, etc. make me jump.\nConstant nausea.\nLittle things make me so irritated. Like don't even breathe near me.",
      "created_utc": 1727223774.0,
      "score": 2
    },
    {
      "id": "los7ipl",
      "body": "Im quiet and always hugging something",
      "created_utc": 1727225474.0,
      "score": 2
    },
    {
      "id": "los901u",
      "body": "I have no appetite until I'm home with my husband. Then we eat what we can. It's all good.",
      "created_utc": 1727226036.0,
      "score": 2
    },
    {
      "id": "losazm4",
      "body": "Sleeping all day and night",
      "created_utc": 1727226800.0,
      "score": 2
    },
    {
      "id": "losetgy",
      "body": "Driving around a neighborhood aimlessly after getting off of work instead of just going home",
      "created_utc": 1727228270.0,
      "score": 2
    },
    {
      "id": "losipxe",
      "body": "My eyes start feeling wet and my throat gets tight. Usually it takes a lot for me to actually cry, but if I’m almost there it’s also bad.",
      "created_utc": 1727229758.0,
      "score": 2
    },
    {
      "id": "loso6sj",
      "body": "Haha, yeah. For me, it’s excruciating pain- but I can’t determine if it’s real (physical) or psychosomatic. \n\nAlso SI or urges to self harm that occur more than once a day.\n\nThese are entirely internal experiences, but were you looking for external too/instead?",
      "created_utc": 1727231911.0,
      "score": 2
    },
    {
      "id": "losoozj",
      "body": "Brain fog for sure, also the less anchored I am the thinner my brows get and my poor nails get picked to death",
      "created_utc": 1727232114.0,
      "score": 2
    },
    {
      "id": "lost24j",
      "body": "\"I think I'll rewatch Bojack :)\"",
      "created_utc": 1727233946.0,
      "score": 2
    },
    {
      "id": "lostako",
      "body": "Intense paranoia and brain fog",
      "created_utc": 1727234048.0,
      "score": 2
    },
    {
      "id": "losw45m",
      "body": "Me.",
      "created_utc": 1727235296.0,
      "score": 2
    },
    {
      "id": "lot2may",
      "body": "Avoiding the typical daily conversations with friends and family.",
      "created_utc": 1727238477.0,
      "score": 2
    },
    {
      "id": "lot3ygt",
      "body": "I tend to use gaming as an outlet to my problems. It's an escape and only good distraction thus far. I love watching c-dramas, drawing, or painting, but there's literally no motivation or energy to do so. \n\nI digress, I know it's bad when all I want to do is just game and not physically talk to anyone or leave my room/house.",
      "created_utc": 1727239177.0,
      "score": 2
    },
    {
      "id": "lot4rwg",
      "body": "When I walk around like a hobo with unwashed hair lol ",
      "created_utc": 1727239610.0,
      "score": 2
    },
    {
      "id": "lot52zv",
      "body": "Can't get out of bed. If u get up I have to run back to bed as it's my safe place",
      "created_utc": 1727239771.0,
      "score": 2
    },
    {
      "id": "lotcjo1",
      "body": "I know I'm bad when I can't even go grocery shopping cause I'm too anxious.",
      "created_utc": 1727244019.0,
      "score": 2
    },
    {
      "id": "lotdmg7",
      "body": "Damn, reading all the comments I’m apparently not feeling good mentally.",
      "created_utc": 1727244685.0,
      "score": 2
    },
    {
      "id": "lou28r0",
      "body": "When it\\`s as it worst, I can\\`t do anything, not eat, talk, sleep, do school, leave my house, take care of myself. I can\\`t even cry about it or explain what the hell is going on to anyone. I become almost 100% non functional and I can\\`t do anything about it. It\\`s hell!",
      "created_utc": 1727261156.0,
      "score": 2
    },
    {
      "id": "lou2o8g",
      "body": "Zero appetite, suddenly snappy, isolating",
      "created_utc": 1727261395.0,
      "score": 2
    },
    {
      "id": "lou5bw2",
      "body": "Not being able to cry anymore. It's been at least 6 months.  Need to.",
      "created_utc": 1727262799.0,
      "score": 2
    },
    {
      "id": "lou7czy",
      "body": "when I start doing the \"I'll shower tomorrow\" that just goes on and on and on",
      "created_utc": 1727263803.0,
      "score": 2
    },
    {
      "id": "lou7wuj",
      "body": "Obsessive thoughts all related to one subject or event. Not being able to stop over analyzing everything about \"it\", whatever it may be at that time. Going down somewhat of a rabbit hole of being consumed by this one thing and my NEED to FIX it. Not being able to fix it or not knowing the answer to something that I'm obsessing over, it starts to be the cause of more anxiety (more than my usual amount of anxiousness) and it will not stop, does not go away or feel better and then panic starts to come in waves and after the panic settles momentarily I feel almost a tiny bit of relief. But only to be hit with another wave of panic a little while after. But yea, what starts it are usually OCD thoughts about something thats bothering me or something I'm scared of or fear is going to happen. Then it's all downhill from there and eventually it passes, if I am able to talk about it to someone it helps, if im lucky. There have been times when it didn't pass after awhile and I needed professional help because it manifested in something like I was terrified to leave my home or I just couldn't snap out of it and it was manifested in over sleeping so I didn't have to be awake a deal with my mind (which I am prone to liking to sleep anyway but during these cycles it's way much worse, like I will use sleep medicine right when I wake up to try and go right back to sleep). It also manifests in isolating myself even more than I already do (I'm an introvert). Or not willing to be awake during day time, being afraid to see the sun. Feeling like I'm going to die, feeling like I can't breathe. Lol yes I have quite a few issues but they have gotten better over the years with help and medicines. But I have my moments where I fall and it usually starts with obsessive thoughts about something unpleasant that's bothering or scaring me for some reason. And this always happens during a time that I'm under a lot of stress, I've found that out. The mind can be a very scary thing.",
      "created_utc": 1727264075.0,
      "score": 2
    },
    {
      "id": "loubiww",
      "body": "My memory becomes impaired, I burn my food, drop things, and have no desire to do anything.",
      "created_utc": 1727265744.0,
      "score": 2
    },
    {
      "id": "louhff8",
      "body": "When I need at least a 1 hour cooldown from having 1 conversation, or being invited to hang out with people makes me feel sick. When I lay in bed until 2 am with my headphones on just listening to sad music. When I start taking anxiety and depression online tests haha. When I start journalling again.",
      "created_utc": 1727268228.0,
      "score": 2
    },
    {
      "id": "louk9b8",
      "body": "Same as you OP. Plus body odour cause I can't be bothered to shower, racing thoughts, crying spells, lethargy, dissociation.",
      "created_utc": 1727269323.0,
      "score": 2
    },
    {
      "id": "loum1gk",
      "body": "When I am staring at the ceiling and waiting for this feeling to go away. But it won't go away.",
      "created_utc": 1727269997.0,
      "score": 2
    },
    {
      "id": "louo59u",
      "body": "Napping all the time. No attention span. Lack of interest in anything that used to be very interesting. (Hobbies, books, etc)",
      "created_utc": 1727270784.0,
      "score": 2
    },
    {
      "id": "lous7dn",
      "body": "Watching the same tv shows over and over again mindlessly, just to drown out  the fear mongering voices in your head.",
      "created_utc": 1727272248.0,
      "score": 2
    },
    {
      "id": "louwam5",
      "body": "Yes, same here. I have this strange feeling in my stomach, not exactly nausea, but it makes me not want to eat.",
      "created_utc": 1727273643.0,
      "score": 2
    },
    {
      "id": "lov0q69",
      "body": " dirty house coupled with 12+ hrs of sleep",
      "created_utc": 1727275103.0,
      "score": 2
    },
    {
      "id": "lov3zmo",
      "body": "When I loose interest in everything and lay in bed most the day",
      "created_utc": 1727276145.0,
      "score": 2
    },
    {
      "id": "lovchwv",
      "body": "I️ feel like I’m going to throw up the physical anxiety pain gets so bad. Bowels act up. Can’t even listen to music or focus. Miss work or school. Or I’m feeling numb and hopeless. Have to take a benzo.",
      "created_utc": 1727278832.0,
      "score": 2
    },
    {
      "id": "lovhx31",
      "body": "For me… not paying bills. I have the money in my account, it’s there and ready. I just don’t have the motivation to click three buttons and make the payment.  Then I get mad at myself a few days later when I pick myself up and have to pay a late fee.",
      "created_utc": 1727280527.0,
      "score": 2
    },
    {
      "id": "lovj2do",
      "body": "Sleeping a lot. Not showering every day. Being snappy with family/loved ones. Being absent minded. Being more klutzy than normal. Not cooking, and eating dry cereal. Overspending.",
      "created_utc": 1727280885.0,
      "score": 2
    },
    {
      "id": "lovltsq",
      "body": "I start feeling like showering is a huge chore and I stop watering my plants.\n\nWant to know how I'm doing? Look at the plants lol",
      "created_utc": 1727281749.0,
      "score": 2
    },
    {
      "id": "lovqsoe",
      "body": "Paralysis. Not being able to work or do self care",
      "created_utc": 1727283292.0,
      "score": 2
    },
    {
      "id": "lovxxb3",
      "body": "My house becomes an absolute mess. To the point it’s gross.",
      "created_utc": 1727285486.0,
      "score": 2
    },
    {
      "id": "low2hxl",
      "body": "Thoughts feeling heavier and everything souding muffled are the biggest tell tale signs for me.",
      "created_utc": 1727286890.0,
      "score": 2
    },
    {
      "id": "low6xn4",
      "body": "It’s when you don’t take care of urself",
      "created_utc": 1727288265.0,
      "score": 2
    },
    {
      "id": "lowha67",
      "body": "When I start to ignore my pets (don’t play with them or pet them as often)",
      "created_utc": 1727291503.0,
      "score": 2
    },
    {
      "id": "lowhmtv",
      "body": "My sleep patterns change. I either feel like I could sleep all day or I can’t sleep at all.",
      "created_utc": 1727291614.0,
      "score": 2
    },
    {
      "id": "lowqfuf",
      "body": "Skipping a shower for too many days in a row",
      "created_utc": 1727294316.0,
      "score": 2
    },
    {
      "id": "lox25sm",
      "body": "Leaving my house messy dishes undone, not showering for like 3 days, not brushing my teeth in 1 day… Just laying in bed binge watching YouTube. I told my boyfriend if you see the house a mess just know I’m depressed.",
      "created_utc": 1727297913.0,
      "score": 2
    },
    {
      "id": "lox7irc",
      "body": "Feeling tired and exhausted all the time despite sleeping enough. Poor hygiene. Feeling empty.. That's where I am.",
      "created_utc": 1727299653.0,
      "score": 2
    },
    {
      "id": "loxdx06",
      "body": "Unable to sleep, anxious, always panicky",
      "created_utc": 1727301820.0,
      "score": 2
    },
    {
      "id": "loxfg7f",
      "body": "Well I just slept through my therapy appointment so I guess for me, oversleeping.",
      "created_utc": 1727302360.0,
      "score": 2
    },
    {
      "id": "loxgt5u",
      "body": "I tend to get really quiet and don't engage with people in any meaningful way. I also can't make eye contact when I'm super depressed or anxious.",
      "created_utc": 1727302843.0,
      "score": 2
    },
    {
      "id": "loxhayp",
      "body": "When I close the door and prefer not getting out of my room",
      "created_utc": 1727303019.0,
      "score": 2
    },
    {
      "id": "loy0xep",
      "body": "Feeling like wires are under my skin, exhausted but can’t sleep, increase in intrusive thoughts, zero motivation to do anything, feeling completely empty, not eating",
      "created_utc": 1727310189.0,
      "score": 2
    },
    {
      "id": "loy51yj",
      "body": "I stopped taking care of myself. No showers, cooking, or doing anything I should be. I just sit there like a potato and gaze into the abyss, lol",
      "created_utc": 1727311706.0,
      "score": 2
    },
    {
      "id": "loys00q",
      "body": "I start to lose my ability to think before responding.  Like, basically responding more emotionally charged than logical.",
      "created_utc": 1727320759.0,
      "score": 2
    },
    {
      "id": "loyv4sj",
      "body": "Sleeping as much as possible all day then being awake all night",
      "created_utc": 1727322182.0,
      "score": 2
    },
    {
      "id": "loz1zfj",
      "body": "Me screaming \"I'm not feeling good mentally",
      "created_utc": 1727325561.0,
      "score": 2
    },
    {
      "id": "lozafz2",
      "body": "Being completely repulsed by food and not wanting to eat is a sign of major depression for me. Like having to force myself to eat.",
      "created_utc": 1727330333.0,
      "score": 2
    },
    {
      "id": "lozkbvb",
      "body": "Not eating the whole day just because I’m scared of a meeting.",
      "created_utc": 1727336853.0,
      "score": 2
    },
    {
      "id": "lp0garv",
      "body": "No interest in anything, not wanting to leave your bed/home,  no appetite, even usually easy tasks being neglected, just overall feeling meh",
      "created_utc": 1727355098.0,
      "score": 2
    },
    {
      "id": "lp26a16",
      "body": "I’m really aware of it but I just stopped talking to everyone. Not just ‘haha sure a few friends’ - literally every single person. I left all social media other than Twitter (because I don’t follow anyone I know IRL there) I couldn’t be bothered to reply to people and eventually most stopped bothering. No one ever picked up the phone to check on me so.. kinda sad but also showed that a lot couldn’t be bothered either!",
      "created_utc": 1727375129.0,
      "score": 2
    },
    {
      "id": "lp3wnyy",
      "body": "when i notice whoever i get validation from at the moment being silent and it bothers me. i just know my mood will go downhill for the whole day if im not comfortable alone with myself.",
      "created_utc": 1727396108.0,
      "score": 2
    },
    {
      "id": "lp993zy",
      "body": "Finding even television is uninteresting compared to sleeping ",
      "created_utc": 1727476230.0,
      "score": 2
    },
    {
      "id": "lpctvtb",
      "body": "I don't smile and I'm slouchy \nI am beautiful when I'm happy but when my mental state windows I feel my age.",
      "created_utc": 1727539253.0,
      "score": 2
    },
    {
      "id": "lort72z",
      "body": "When I color my hair blue, violet, or any uncommon color...",
      "created_utc": 1727220181.0,
      "score": 2
    },
    {
      "id": "los56pr",
      "body": "When I start getting virtigo in wide open spaces where there's nothing to hold onto like a ramp or even a tree. Or Derealisation. That's anxiety at my worst. Depression at my worst is a deep emptiness. But second to that is the feeling like I'm gonna cry all the time. All. The. Time.",
      "created_utc": 1727224612.0,
      "score": 1
    },
    {
      "id": "los5od4",
      "body": "Having my head symptoms nonstop",
      "created_utc": 1727224792.0,
      "score": 1
    },
    {
      "id": "los7y4d",
      "body": "Not doing anything I enjoy for over a week",
      "created_utc": 1727225636.0,
      "score": 1
    },
    {
      "id": "losb6lt",
      "body": "When I start not being able to feel my feelings and insomnia",
      "created_utc": 1727226874.0,
      "score": 1
    },
    {
      "id": "losdlsh",
      "body": "I enjoy cooking, but when I'm depressed I cook only for utility. Think chickpeas and rice vs. Homemade seitan. \n\nWhen I'm really stressed I have a tendency to just cook/bake while I process it so my roommate comes home and there's like four different things made. \n\nI was also chronically extremely stressed at my old job and when the team vibes got weird I would make \"pls don't hate me\" cookies even though now I know it was not about me everyone else was also just extremely stressed and there would be something that happened behind the scenes I didn't know about and all I was picking up were the bad vibes.",
      "created_utc": 1727227803.0,
      "score": 1
    },
    {
      "id": "losinaa",
      "body": "My coworkers always go “what’s wrong you have been very quiet”",
      "created_utc": 1727229730.0,
      "score": 1
    },
    {
      "id": "losnx39",
      "body": "Doom thinking and laying down for hours.",
      "created_utc": 1727231803.0,
      "score": 1
    },
    {
      "id": "loso8pq",
      "body": "Irritability, feeling angry at everything and everyone, lashing out",
      "created_utc": 1727231932.0,
      "score": 1
    },
    {
      "id": "losqfs6",
      "body": "zero appetite and super repetitive/obsessive thoughts",
      "created_utc": 1727232836.0,
      "score": 1
    },
    {
      "id": "lostqzn",
      "body": "When I’ve been driving for an hour, feeling like everything is okay, and I look at my watch and my HR is 130 and I realize I’m clinching my jaw and white knuckling the steering wheel. Happens almost daily. My wife has to drive if the drive is longer than 3 hours and I hate it so much, because she shouldn’t have to do that. But driving for me is a sure fire way to spike my anxiety.",
      "created_utc": 1727234246.0,
      "score": 1
    },
    {
      "id": "loszvpa",
      "body": "Feeling irritable and easily angered. \nDishes piling up in the kitchen. \nNot having the energy to reply to messages from friends.",
      "created_utc": 1727237084.0,
      "score": 1
    },
    {
      "id": "lot2ecw",
      "body": "If I stop initiating conversation for a long while or respond in short ways, something is eating at me. \n\nSlowly foregoing hobbies is another huge red flag.",
      "created_utc": 1727238362.0,
      "score": 1
    },
    {
      "id": "lot328c",
      "body": "How fast someone smiles at a joke, and how their smile looks. I can tell when it’s off",
      "created_utc": 1727238710.0,
      "score": 1
    },
    {
      "id": "lot3m2c",
      "body": "Numbing out. Audiobooks playing 24//7 and an insatiable need to play the sims for 3 days straight",
      "created_utc": 1727238997.0,
      "score": 1
    },
    {
      "id": "lot4vp9",
      "body": "Road rage",
      "created_utc": 1727239664.0,
      "score": 1
    },
    {
      "id": "lot67wr",
      "body": "I have trichotillomania (compulsive hair pulling) among other issues and so I am mostly bald but sometimes when I’m doing better I’ll get months of slow regrowth that I can destroy and pull out in 10 mins. Being late to engagements, zoning out for hours pulling my hair/digging into my skin is  a huge sign that I’m not doing great.",
      "created_utc": 1727240368.0,
      "score": 1
    },
    {
      "id": "lot6oeu",
      "body": "Rewatching bojack horseman",
      "created_utc": 1727240615.0,
      "score": 1
    },
    {
      "id": "lot8ipv",
      "body": "when my dirty laundry is a growing mountain",
      "created_utc": 1727241644.0,
      "score": 1
    },
    {
      "id": "lot93dy",
      "body": "When I have extra sleep issues.\n\nI already have sleep issues, but if Im unable to stay still long enough (fidgety and restless and everything is uncomfortable) then it means my anxiety is bad or im on the verge of burnout or a melt down. \n\nOr when sh urges come back\n\nOr when I cant shower or brush my teeth bc it's too overwhelming \n\nOr when every little sound makes me cry\n\n\nALL HAPPENING RN, HELP 😭\n\ni just flinched at a lightswitch getting turned off 😭",
      "created_utc": 1727241972.0,
      "score": 1
    },
    {
      "id": "lot9kt9",
      "body": "Me, when I'm hungover af",
      "created_utc": 1727242255.0,
      "score": 1
    },
    {
      "id": "lotd6im",
      "body": "Stopping all my hobbies and neglecting myself. I’ve currently got a huge knot in my hair that I can’t get out.",
      "created_utc": 1727244408.0,
      "score": 1
    },
    {
      "id": "lotej8t",
      "body": "No appetite at all I gag if I see food and I pace until my feet hurt.",
      "created_utc": 1727245258.0,
      "score": 1
    },
    {
      "id": "lotfm1v",
      "body": "Knew a guy who spent 5k on an ai gf app.",
      "created_utc": 1727245945.0,
      "score": 1
    },
    {
      "id": "lothftk",
      "body": "im not talking",
      "created_utc": 1727247121.0,
      "score": 1
    },
    {
      "id": "lothp8d",
      "body": "I love food as well so loss of appetite,  panic attacks, insomnia, and mainly nightmares for me.",
      "created_utc": 1727247292.0,
      "score": 1
    },
    {
      "id": "lotki6q",
      "body": "Skin around my thumbs messed up to the bleed.",
      "created_utc": 1727249172.0,
      "score": 1
    },
    {
      "id": "lotm6fw",
      "body": "Absolutely nothing can hold my attention",
      "created_utc": 1727250355.0,
      "score": 1
    },
    {
      "id": "lotmttv",
      "body": "Smoking a lot more, not listening to music anymore, struggling to do my daily tasks and wanting to sleep literally all day. That's it for me.",
      "created_utc": 1727250816.0,
      "score": 1
    },
    {
      "id": "lotpvb1",
      "body": "Thinking I need to get a tattoo.",
      "created_utc": 1727252975.0,
      "score": 1
    },
    {
      "id": "lotqccz",
      "body": "when I think K-pop is too loud and annoying...... yeah, i am kpop fan but when i'm not feeling good not being able to stand any cheerful tunes.",
      "created_utc": 1727253315.0,
      "score": 1
    },
    {
      "id": "lotuczz",
      "body": "The state of both my desk and the side of my bed are typically perfect reflections of my current mental state. The messier it looks = the worse I’m feeling lol. The house could be all tidied up, but somehow these two areas would still look awful if I’m not doing well",
      "created_utc": 1727256165.0,
      "score": 1
    },
    {
      "id": "lotudf5",
      "body": "When I just can’t get off Reddit or off my phone in general. Like right now, I want to go to the gym but I just can’t get up because my mind is spiraling.",
      "created_utc": 1727256173.0,
      "score": 1
    },
    {
      "id": "lotuk3v",
      "body": "A lot of things for me, ranging from \"I lose interest in what I like\" or its strange counterpart \"I begin to be suddenly super interested in something but at a bizarrely high level\", to dark thoughts or obsession over something that has happened (reliving a bad event) or has yet to happen (in which case I will explore each and every way it can turn very badly and even sometimes consider suicide).",
      "created_utc": 1727256302.0,
      "score": 1
    },
    {
      "id": "lou1l08",
      "body": "I do, I scream that all the time",
      "created_utc": 1727260783.0,
      "score": 1
    },
    {
      "id": "lou2pg3",
      "body": "When I don’t want to wash my hair.",
      "created_utc": 1727261413.0,
      "score": 1
    },
    {
      "id": "lou7cbv",
      "body": "I get moody and then go flat affect 😅 Not getting out of bed, my house getting messy is a big one cause when I’m well I keep it pristine. 😅",
      "created_utc": 1727263795.0,
      "score": 1
    },
    {
      "id": "lou8gau",
      "body": "For me it’s when I start to get easily emotional at everything. I just cry for no reason sometimes",
      "created_utc": 1727264334.0,
      "score": 1
    },
    {
      "id": "lou91ur",
      "body": "I slow down, speech, actions, just no go in me because I don’t care at the time",
      "created_utc": 1727264619.0,
      "score": 1
    },
    {
      "id": "loubjls",
      "body": "Me - I'm screaming that.",
      "created_utc": 1727265753.0,
      "score": 1
    },
    {
      "id": "loupe9t",
      "body": "Me.",
      "created_utc": 1727271246.0,
      "score": 1
    },
    {
      "id": "louqfmp",
      "body": "Can tell my mental state is doomed when I download League",
      "created_utc": 1727271622.0,
      "score": 1
    },
    {
      "id": "louri2v",
      "body": "Nightmares. Very vivid horrible nightmares. I know my depression is bad when I start to get nightmares.",
      "created_utc": 1727272001.0,
      "score": 1
    },
    {
      "id": "louudni",
      "body": "Doing crazy makeup looks or my nails.\n\nMy coworkers have started to notice too.\n\nI do all of my wacky looks when I don't feel good, mentally and physically.\n\nI think it just offers me an escape for a little while, something to focus on and take my mind off of how I feel.\n\nPlus it hides how pale and red I get when I feel off.",
      "created_utc": 1727272992.0,
      "score": 1
    },
    {
      "id": "louuol8",
      "body": "My yard goes to crap",
      "created_utc": 1727273098.0,
      "score": 1
    },
    {
      "id": "louwxe3",
      "body": "Piles of laundry",
      "created_utc": 1727273853.0,
      "score": 1
    },
    {
      "id": "louxajg",
      "body": "I eat constantly and stop household and personal hygiene  tasks due to no motivation.",
      "created_utc": 1727273974.0,
      "score": 1
    },
    {
      "id": "louzjpi",
      "body": "Check Donald Trumps Twitter. Should give you some insight lol",
      "created_utc": 1727274717.0,
      "score": 1
    },
    {
      "id": "lov186w",
      "body": "Wishing for a car wreck.",
      "created_utc": 1727275265.0,
      "score": 1
    },
    {
      "id": "lov3kd5",
      "body": "My brain 👀",
      "created_utc": 1727276013.0,
      "score": 1
    },
    {
      "id": "lov94fo",
      "body": "When I don’t sing and hum, I love singing and do it pretty mindlessly when I’m in a good mood. You can I’m not feeling well when I am not making music of some kind.",
      "created_utc": 1727277773.0,
      "score": 1
    },
    {
      "id": "lova9s1",
      "body": "For me, it’s skipping on personal hygene. That doesn’t work for me when I’m not in a good mental state.",
      "created_utc": 1727278130.0,
      "score": 1
    },
    {
      "id": "lovcjin",
      "body": "If I’m not hungry at all, or can’t sleep, and if I’m not interested in watching anything on tv",
      "created_utc": 1727278845.0,
      "score": 1
    },
    {
      "id": "loveezc",
      "body": "Not listening to my usual YouTube videos. I always have them on in the background when I work. When I'm not feeling good in my head, it's silent.",
      "created_utc": 1727279429.0,
      "score": 1
    },
    {
      "id": "lovfjqn",
      "body": "I know it’s getting bad when it’s harder than usual for me to get out of bed or just take care of myself in general",
      "created_utc": 1727279781.0,
      "score": 1
    },
    {
      "id": "lovfn1z",
      "body": "Over sleeping, poor hygiene care, no interest in doing things that once brought joy.",
      "created_utc": 1727279809.0,
      "score": 1
    },
    {
      "id": "lovlk9f",
      "body": "forgetting things and crying cause you are hyper sensitive",
      "created_utc": 1727281667.0,
      "score": 1
    },
    {
      "id": "lovlprl",
      "body": "Getting irritable way easier than normal",
      "created_utc": 1727281715.0,
      "score": 1
    },
    {
      "id": "lovp4j5",
      "body": "I find myself being irritated with everyone a lot quicker. And also not having the energy to continue conversations.",
      "created_utc": 1727282776.0,
      "score": 1
    },
    {
      "id": "lovstbm",
      "body": "Don’t even have the energy to scroll social media or do other stuff on the phone.",
      "created_utc": 1727283911.0,
      "score": 1
    },
    {
      "id": "lovt8qx",
      "body": "Lack of confidence, avoiding eye contact, isolating, self medicating with various things.",
      "created_utc": 1727284046.0,
      "score": 1
    },
    {
      "id": "lovv11e",
      "body": "If I don’t want to watch movies or read smth or i don’t want to relax without forcing myself",
      "created_utc": 1727284597.0,
      "score": 1
    },
    {
      "id": "low7t0l",
      "body": "When all my joints ache. My body holds a lot of tension, so when I am joint achey without any other signs of \"illness\" i know that my mental health is about to take a deep dive down.",
      "created_utc": 1727288537.0,
      "score": 1
    },
    {
      "id": "lowixjm",
      "body": "I don't want coffee. Coffee is a comfort and a delight...  \nAnd, music. I stop listening and enjoying",
      "created_utc": 1727292020.0,
      "score": 1
    },
    {
      "id": "lowkbbg",
      "body": " Irritability, being inconsiderate and rude to others.",
      "created_utc": 1727292444.0,
      "score": 1
    },
    {
      "id": "lowl8mb",
      "body": "I love watching scary movies, thrillers, true crime shows, etc. If I don’t feel like watching “spooky” stuff then you know I’m not doing well.",
      "created_utc": 1727292729.0,
      "score": 1
    },
    {
      "id": "lowq8wz",
      "body": "Not playing my guitar and/or not listening to music. Music is such a big part of my life. If I stop playing music then something is wrong and I need to address it quickly.",
      "created_utc": 1727294257.0,
      "score": 1
    },
    {
      "id": "lowucbh",
      "body": "Music used to be the thing I was biggest into. I loved listening to new music and discovering new bands. Now I could give a fuck less. Things sound good still but I'm just not into it anymore. I also used to love painting and crafts. I don't care about any of that shit anymore.",
      "created_utc": 1727295519.0,
      "score": 1
    },
    {
      "id": "lowvk3u",
      "body": "me on most days (hah..ha..ha...), but i digress. for me, it means rigid posture, nervous tics, clasping/wringing hands, feeling lost in my normal environments, stuck in slow motion despite mentally going infinitely faster. i start spiraling into my anxious thoughts & quickly lose my firm connection with reality...it sucks.",
      "created_utc": 1727295893.0,
      "score": 1
    },
    {
      "id": "lox1177",
      "body": "Doom scrolling",
      "created_utc": 1727297569.0,
      "score": 1
    },
    {
      "id": "lox5pz5",
      "body": "Me",
      "created_utc": 1727299058.0,
      "score": 1
    },
    {
      "id": "lox8t98",
      "body": "Sounds weird but when I stop having deep contemplative thoughts. Like they stop being this “clear” feeling to this survival feeling",
      "created_utc": 1727300083.0,
      "score": 1
    },
    {
      "id": "loxdmuf",
      "body": "I know it's bad when I see darkness everywhere. Everyone is rotten. Out to get you. I hate when this happens. I don't like being this way. I always think everything can be solved. People are okay even if they are an arse at times.",
      "created_utc": 1727301718.0,
      "score": 1
    },
    {
      "id": "loxfj3w",
      "body": "For me it’s pain. Headaches, throat tightness, chest pain. Also feeling super irritable and on the verge of crying but usually not actually crying 😮‍💨",
      "created_utc": 1727302389.0,
      "score": 1
    },
    {
      "id": "loxgxx3",
      "body": "Letting my beard grow out of proportion, looking like a hobo.",
      "created_utc": 1727302890.0,
      "score": 1
    },
    {
      "id": "loxkajf",
      "body": "Not being interested in anything or even talking to anyone",
      "created_utc": 1727304097.0,
      "score": 1
    },
    {
      "id": "loxo8j0",
      "body": "For me it would be stood stuck in time staring out the window deep in thought. When I snap out of the trance I realise I’m not ok after it and have to start doing my things to sort it out",
      "created_utc": 1727305530.0,
      "score": 1
    },
    {
      "id": "loxxoza",
      "body": "Avoiding friends and family. I’m in one of those moods for the last week or so and I just don’t want to talk to people.",
      "created_utc": 1727308995.0,
      "score": 1
    },
    {
      "id": "loxzpea",
      "body": "A person who’s audibly screaming “I’m not feeling good mentally at all” would probably be a strong sign\n\nFor me specifically I drink a lot less water and end up dehydrated",
      "created_utc": 1727309738.0,
      "score": 1
    },
    {
      "id": "loy1isu",
      "body": "When I don’t take care of my hair!! just started feeling better and had to detangle a bunch of matted hair",
      "created_utc": 1727310407.0,
      "score": 1
    },
    {
      "id": "loy4zxr",
      "body": "My first symptoms are almost always physical",
      "created_utc": 1727311685.0,
      "score": 1
    },
    {
      "id": "loy69cw",
      "body": "when i start partying and spending all my money on going out",
      "created_utc": 1727312152.0,
      "score": 1
    },
    {
      "id": "loykipo",
      "body": "Not playing video games. I’m always gaming and love it, so if I’m not even in the mood for that I’m generally not well",
      "created_utc": 1727317641.0,
      "score": 1
    },
    {
      "id": "loyqwfv",
      "body": "When I awake with a sense of dread.  It hits me in my stomach area.  Then I am fighting the anxiety for two to three hours.  I take clonazepam but sometimes it doesn’t work at a low dosage so Ivup it.  I am trying to take a bit of Mirtazapine to take the edge off.  The problem is that these medications can make you sleepy.",
      "created_utc": 1727320276.0,
      "score": 1
    },
    {
      "id": "loytr2e",
      "body": "Self-Deprecating jokes. It may not seem like a lot to some, and not all jokes are, but sometimes there's a joke that someone makes and I realize, \"Oh my gosh, they have low self esteem.\"",
      "created_utc": 1727321548.0,
      "score": 1
    },
    {
      "id": "loyunv1",
      "body": "When I sleep more than usual, I know that I want to escape everything.",
      "created_utc": 1727321965.0,
      "score": 1
    },
    {
      "id": "loyvznw",
      "body": "For me ordering a lot of DoorDash and from food apps. It means I’m having trouble leaving the house and going inside of a grocery store. ",
      "created_utc": 1727322584.0,
      "score": 1
    },
    {
      "id": "loz5azf",
      "body": "no sleep",
      "created_utc": 1727327349.0,
      "score": 1
    },
    {
      "id": "loz5q9d",
      "body": "This will probably be your strangest response, but when I stop recycling. I'm a huge environmentalist, work in sustainability, and it pains me to throw recyclables in a trash can. When I stop having the energy to rinse recyclables and throw them out instead, you can bet my mental health is real bad.",
      "created_utc": 1727327586.0,
      "score": 1
    },
    {
      "id": "lozb0b2",
      "body": "Me. I scream that. every now and again deep into a pillow",
      "created_utc": 1727330674.0,
      "score": 1
    },
    {
      "id": "lozdjre",
      "body": "I usually just feel so disconnected from everything",
      "created_utc": 1727332275.0,
      "score": 1
    },
    {
      "id": "lozdrwz",
      "body": "When I start singing the same bit of a song over and over in my head. At increasing speed.",
      "created_utc": 1727332421.0,
      "score": 1
    },
    {
      "id": "lozhvxu",
      "body": " Body odour, dirty hair.",
      "created_utc": 1727335133.0,
      "score": 1
    },
    {
      "id": "loziqul",
      "body": "Full days of just staring into the abyss not able to pull myself off the couch to even grab myself a drink of water",
      "created_utc": 1727335726.0,
      "score": 1
    },
    {
      "id": "lozj5zb",
      "body": "Sleeping in / all day.\n\nI typically hate sleeping in past 8AM.",
      "created_utc": 1727336023.0,
      "score": 1
    },
    {
      "id": "lozk3em",
      "body": "losing interest in hobbies",
      "created_utc": 1727336685.0,
      "score": 1
    },
    {
      "id": "lozkxgl",
      "body": "When I wake up. Always the worst part of every day.\n\nThen I smoke a big one and its all ok. I rather dont give a fck than doing anything else.",
      "created_utc": 1727337286.0,
      "score": 1
    },
    {
      "id": "lozof3e",
      "body": "Bullying and being rude. When people behave like that it mean something is wrong is going on with them",
      "created_utc": 1727339763.0,
      "score": 1
    },
    {
      "id": "lozq4dw",
      "body": "I have nonspeaking episodes because of autism. I’m not very perceptive when it comes to my own body / mind so I usually don’t notice anything‘s wrong until I’m literally unable to speak.",
      "created_utc": 1727340969.0,
      "score": 1
    },
    {
      "id": "lp0n6md",
      "body": "My parents knew I was bad when I stopped creating. They knew it was worse but seeing my screen time on procreate and they instantly got me help :)",
      "created_utc": 1727357678.0,
      "score": 1
    },
    {
      "id": "lp0pte9",
      "body": "Doomscrolling, a messy house, taking all feedback too personal at work, sleeping a lot. Not in the mood to socialize, wanting to drink (I never have more than two drinks normally), crying all the time, extremely short fuse, headaches. Come to think of it...I might be going into a spiral.",
      "created_utc": 1727358617.0,
      "score": 1
    },
    {
      "id": "lp2g6fo",
      "body": "How I'm feeling right now wanting to commit suicide n just not wanting to do shit but just sittt",
      "created_utc": 1727378252.0,
      "score": 1
    },
    {
      "id": "lpcu4d6",
      "body": "I can tell you what caused my anxiety...\nMy children's father legally kidnapped my children.",
      "created_utc": 1727539333.0,
      "score": 1
    },
    {
      "id": "lpfd3ok",
      "body": "When I'm really struggling, my room starts getting messy and cluttered, I can't control it. I just don't feel like picking up after myself. It's just anxiety builds up and I'm all over the place",
      "created_utc": 1727572374.0,
      "score": 1
    },
    {
      "id": "lpq8wrf",
      "body": "When you stop \" feeling\".....   about *anything* ..   ....  *anyone....  , * *and** .... yourself.*\n😐😐😐",
      "created_utc": 1727738190.0,
      "score": 1
    },
    {
      "id": "lretqav",
      "body": "When I'm looking at the sky or nature and I feel nothing",
      "created_utc": 1728654472.0,
      "score": 1
    },
    {
      "id": "mekehlk",
      "body": "not talking when playing my favorite videogame with my friend i usually laugh alot with my friend",
      "created_utc": 1740424066.0,
      "score": 1
    },
    {
      "id": "losqfaz",
      "body": "My brain, constantly.",
      "created_utc": 1727232830.0,
      "score": 0
    },
    {
      "id": "lostbw9",
      "body": "Saaaame. No music, books, hobbies, tv when I get really bad",
      "created_utc": 1727234064.0,
      "score": 118
    },
    {
      "id": "lorufd2",
      "body": "[deleted]",
      "created_utc": 1727220621.0,
      "score": 217
    },
    {
      "id": "los19qg",
      "body": "I’m glad you pointed this out because I recently have noticed the same thing about myself. If I go more than a week or so without listening to any music, I know something is wrong.",
      "created_utc": 1727223155.0,
      "score": 73
    },
    {
      "id": "lost0ty",
      "body": "Yes I definitely notice this for me too. And if I do listen to music it’s classical.",
      "created_utc": 1727233931.0,
      "score": 20
    },
    {
      "id": "lote8hs",
      "body": "Yes! And then I catch the songs I am connecting too and go \"oh no\"",
      "created_utc": 1727245068.0,
      "score": 24
    },
    {
      "id": "lot3vu0",
      "body": "Same here. I’ve come to the conclusion it is because of too much stimuli at that moment. I have GAD and ADHD so im sensitive for all kind of nervous system stimulus, even though I also need and enjoy it very much 😮‍💨",
      "created_utc": 1727239139.0,
      "score": 38
    },
    {
      "id": "loujjzy",
      "body": "Ever since my mom died I rarely listen to music anymore. And I used to have it playing every day while I cooked and cleaned. It's only when I'm in a good mood and half drunk I'll put it on.",
      "created_utc": 1727269053.0,
      "score": 13
    },
    {
      "id": "lotr1b3",
      "body": "I’ve never thought about it like this, but I think this absolutely applies to me too. I feel like I need Spotify to send me a notification if I haven’t listened in 3 days!",
      "created_utc": 1727253806.0,
      "score": 7
    },
    {
      "id": "lou11ha",
      "body": "Omg I recognise this as well. So true, if I am not vibing to music then something is def wrong w me",
      "created_utc": 1727260468.0,
      "score": 3
    },
    {
      "id": "lou55ed",
      "body": "Either that or only listening to the same few songs, excessively. To the point where just looking at other song titles, even of songs I normally like, is too much.",
      "created_utc": 1727262707.0,
      "score": 3
    },
    {
      "id": "lourvzr",
      "body": "When I'm really depressed I actually have to stay away from my music. I only let myself listen to Motown. Most of the music I listen to has so many memories attached to it that my brain just can't handle it.   \n\nI lost 2 people very close to me within a year and didn't listen to anything for close to 6 weeks. When one of them passed I couldn't even listen to a song like Smells Like Teen Spirit which has no emotional attachment, but because it was my Dad who passed and I was a teenager when the song came out it messed up my head. I'm a huge huge music person and can often tell my mood based on what I can get through listening to.",
      "created_utc": 1727272136.0,
      "score": 2
    },
    {
      "id": "lov7152",
      "body": "OMG yes, I listen to music daily, cleaning, taking a shower etc when I know I’m getting bad or overly anxious I just don’t care to listen to music because it actually makes me more anxious??? lol",
      "created_utc": 1727277113.0,
      "score": 2
    },
    {
      "id": "lovemiu",
      "body": "me too i hate it so much. i used to love music :( i just don’t feel like myself anymore. i listen to the same anxiety podcast episode on repeat everyday",
      "created_utc": 1727279494.0,
      "score": 2
    },
    {
      "id": "loxc5pd",
      "body": "That's what metal music is for 🤘and watch your diet. The poisons in some processed foods are linked to stress and anxiety.",
      "created_utc": 1727301213.0,
      "score": 2
    },
    {
      "id": "loxnp79",
      "body": "I'm exactly the same way. I don't always notice right away that I've stopped listening to music, but it's a huge indicator for me. Once I lose my appetite and have a constant knot in my stomach, it becomes more obvious. Those are the two big signs for me.",
      "created_utc": 1727305330.0,
      "score": 2
    },
    {
      "id": "lsx8dcz",
      "body": "I'm in big trouble then !",
      "created_utc": 1729466449.0,
      "score": 2
    },
    {
      "id": "loup36d",
      "body": "For me, it's the complete opposite. I usually use music as a form of escapism so I usually wear headphones and block everything out for hours even days.",
      "created_utc": 1727271131.0,
      "score": 1
    },
    {
      "id": "loux2p3",
      "body": "My version of this is not singing along to any of the music I like/usually do so for. I love to sing.",
      "created_utc": 1727273902.0,
      "score": 1
    },
    {
      "id": "lov4oeo",
      "body": "that’s so interesting that you said it was the first sign! for me when i stop listening to music i’m already so far gone haha",
      "created_utc": 1727276364.0,
      "score": 1
    },
    {
      "id": "lov53y0",
      "body": "Same here. As much as I love music, it makes my anxiety feel more intense.",
      "created_utc": 1727276502.0,
      "score": 1
    },
    {
      "id": "lov5lxx",
      "body": "Same",
      "created_utc": 1727276662.0,
      "score": 1
    },
    {
      "id": "lovte42",
      "body": "This is right on target. 🎯 When I'm depressed I listen to zero music unless I'm in the car. I also watch too much YouTube.",
      "created_utc": 1727284093.0,
      "score": 1
    },
    {
      "id": "low9ncf",
      "body": "SO TRUE",
      "created_utc": 1727289109.0,
      "score": 1
    },
    {
      "id": "lowksnq",
      "body": "This is so true. For me it’s because music brings on so many emotions and I just can’t deal with them.",
      "created_utc": 1727292592.0,
      "score": 1
    },
    {
      "id": "lowlcbh",
      "body": "Damn that's so right",
      "created_utc": 1727292761.0,
      "score": 1
    },
    {
      "id": "lowqrvt",
      "body": "Or when you listen to music but it's all depressive shit about suicide",
      "created_utc": 1727294418.0,
      "score": 1
    },
    {
      "id": "lowxufk",
      "body": "for me it’s the opposite. usually, i’ll find a couple songs i really relate to and listen to them on repeat. i rely on music for disconnecting from reality so when i do that a lot more it’s usually a sign",
      "created_utc": 1727296589.0,
      "score": 1
    },
    {
      "id": "lowzt11",
      "body": "YES! My headphones broke more than two weeks ago. And for the past two weeks I have been dealing with panic attacks and increased health anxiety. It is so hard to buy new ones and this is because I am not feeling well right now. Ironically I love listening to music and when I am well, I listen daily!",
      "created_utc": 1727297196.0,
      "score": 1
    },
    {
      "id": "lox9il5",
      "body": "When I don’t sing to myself or have a song in my head, I know I’m in a bad place",
      "created_utc": 1727300320.0,
      "score": 1
    },
    {
      "id": "loxg9nl",
      "body": "I noticed this as well! I had zero drive last year to listen to anything. This year I’ve listened to so many new albums, I know I’ve bounced back.",
      "created_utc": 1727302650.0,
      "score": 1
    },
    {
      "id": "loxkfmq",
      "body": "This is so interesting! It’s the exact opposite for me. I’ll drown myself in music to just try to drown out whatever’s going on in my head (usually fails though)",
      "created_utc": 1727304149.0,
      "score": 1
    },
    {
      "id": "loymwih",
      "body": "I just listened to music nonstop for like 3 hours.  I haven't done that in over 2 years. I sort of agree with u but for me being able to listen to music also means being ok with feeling big feelings, which is sometimes positive but also often negative/part of my ruminating. Today it was a mix of both but it felt so good to get to listen after so long!",
      "created_utc": 1727318602.0,
      "score": 1
    },
    {
      "id": "lozdtit",
      "body": "Same with me! Do you then \"force\" yourself to listening to music to get out of this?",
      "created_utc": 1727332450.0,
      "score": 1
    },
    {
      "id": "lozgb5b",
      "body": "I am a musician myself. It is a viscous cycle for me, depressed so I stay away from music, and staying away from music aggravates my depression/anxiety. ",
      "created_utc": 1727334063.0,
      "score": 1
    },
    {
      "id": "lp18fpk",
      "body": "I'm the opposite. Only music. 🤣😭",
      "created_utc": 1727364657.0,
      "score": 1
    },
    {
      "id": "lpcu046",
      "body": "I agree.. sometimes when I'm depressed I'll drive to work with no music on... But I have noticed when I have music on it completely changes my mood like music is my medicine.",
      "created_utc": 1727539294.0,
      "score": 1
    },
    {
      "id": "m0tjl9o",
      "body": "Sometimes when I’m feeling bad, I’m like, “Have you taken your music today?”",
      "created_utc": 1733544848.0,
      "score": 1
    },
    {
      "id": "m5cm6ei",
      "body": "heavy on this. music specifically.",
      "created_utc": 1735997359.0,
      "score": 1
    },
    {
      "id": "lorqsmv",
      "body": "For me, it’s under sleeping. Everything else, same here!",
      "created_utc": 1727219318.0,
      "score": 146
    },
    {
      "id": "lot6xfk",
      "body": "This. So much this. \n\nI catch myself staring stone faced at people talking to me, and then when i realize they're saying something funny, i smile or grin immediately making it seem fake. I try so hard to be present, but my mind is always somewhere else",
      "created_utc": 1727240755.0,
      "score": 49
    },
    {
      "id": "losttwc",
      "body": "Yep I’ll oversleep because for once I’m actually happy but it’s in my dreams 💀",
      "created_utc": 1727234282.0,
      "score": 31
    },
    {
      "id": "lorv139",
      "body": "Me at my best",
      "created_utc": 1727220842.0,
      "score": 23
    },
    {
      "id": "lot05ct",
      "body": "My baseline",
      "created_utc": 1727237217.0,
      "score": 6
    },
    {
      "id": "lov4601",
      "body": "Deff all these",
      "created_utc": 1727276201.0,
      "score": 1
    },
    {
      "id": "lovjdv4",
      "body": "I have taken 3 naps a day on weekends, and they were not power naps, they were a minimum 2 hours each.",
      "created_utc": 1727280985.0,
      "score": 1
    },
    {
      "id": "lovv1qr",
      "body": "For me when I’m depressed it’s the opposite it’s like my brain is going 100 times slower than usual and nothing interests me even though I’m usually interested in so many different things",
      "created_utc": 1727284603.0,
      "score": 1
    },
    {
      "id": "lpfq7cf",
      "body": "I dissociate and over sleep. Currently just burnt out and done.",
      "created_utc": 1727577857.0,
      "score": 1
    },
    {
      "id": "lovv9m7",
      "body": "100%",
      "created_utc": 1727284669.0,
      "score": 2
    },
    {
      "id": "lot24mh",
      "body": "Months, for me",
      "created_utc": 1727238221.0,
      "score": 98
    },
    {
      "id": "lou13sr",
      "body": "FACTS, if i am putting off doing my dishes and they pile up, lol",
      "created_utc": 1727260506.0,
      "score": 19
    },
    {
      "id": "los52mx",
      "body": "For me it’s the polar opposite. Lol",
      "created_utc": 1727224570.0,
      "score": 29
    },
    {
      "id": "lp8jv36",
      "body": "So you are saying me not vacuuming my place for a year (??) might not be normal, even though I want to?",
      "created_utc": 1727467344.0,
      "score": 1
    },
    {
      "id": "lotmiwi",
      "body": "Yes!!! Me!!!",
      "created_utc": 1727250600.0,
      "score": 16
    },
    {
      "id": "lov16or",
      "body": "The past few weeks I was not interested in reaching out or reverting any texts/calls, even my best friend’s. It’d piss me every time I’d get a call/text no matter who it was from.",
      "created_utc": 1727275252.0,
      "score": 13
    },
    {
      "id": "loum09p",
      "body": "This is me when my anxiety is good.",
      "created_utc": 1727269985.0,
      "score": 4
    },
    {
      "id": "loxswy4",
      "body": "Me to the T",
      "created_utc": 1727307238.0,
      "score": 2
    },
    {
      "id": "loybapz",
      "body": "Oof. I'm in the throes of that now!",
      "created_utc": 1727314062.0,
      "score": 1
    },
    {
      "id": "lorvjrs",
      "body": "Hey! This is me. You can add in lack of money too.",
      "created_utc": 1727221031.0,
      "score": 37
    },
    {
      "id": "lov8k7n",
      "body": "It sucks",
      "created_utc": 1727277596.0,
      "score": 1
    },
    {
      "id": "losr6ts",
      "body": "Or like me, last week 4 days straight in bed. My body aches everywhere.",
      "created_utc": 1727233150.0,
      "score": 38
    },
    {
      "id": "lov18f6",
      "body": "Doing this rn",
      "created_utc": 1727275267.0,
      "score": 3
    },
    {
      "id": "lovw1ep",
      "body": "100%",
      "created_utc": 1727284906.0,
      "score": 6
    },
    {
      "id": "lpkn3qr",
      "body": "I hear you on getting angry easily- I get just annoyed & irritated to the maximum. Sometimes I wish I could get angry because I feel angry- I'm not myself lately & I hate it ",
      "created_utc": 1727653283.0,
      "score": 2
    },
    {
      "id": "lou4f3h",
      "body": "I just bailed on my cousins wedding… I had a massive panic attack about it, yelled at my mom for pressuring me to go (it’s a 10 hour drive with events all weekend and no breaks from anyone… a literal nightmare for me) and it’s all over now but I felt guilty about it all weekend. Not to mention that i can’t afford to take time off work, but I got the time off so even though I was home I wasn’t scheduled and no one wants to give up their shifts this time of year lol",
      "created_utc": 1727262327.0,
      "score": 10
    },
    {
      "id": "lot6zp9",
      "body": "Hello twin.",
      "created_utc": 1727240788.0,
      "score": 6
    },
    {
      "id": "losnoim",
      "body": "Yes",
      "created_utc": 1727231708.0,
      "score": 2
    },
    {
      "id": "lot034r",
      "body": "Same here! And I find it goes both ways… if I’m feeling crappy, my house will be messier. But also, a messy chaotic house triggers my anxiety and makes me feel crappy.",
      "created_utc": 1727237186.0,
      "score": 24
    },
    {
      "id": "losem9p",
      "body": "I feel this one!",
      "created_utc": 1727228194.0,
      "score": 3
    },
    {
      "id": "loviu9m",
      "body": "Yep, this is me. Also there's two big piles of clothes, random paperwork and mail in the middle of my living room floor right now...I guess that's a pretty good indicator of how things have been going lately.",
      "created_utc": 1727280815.0,
      "score": 3
    },
    {
      "id": "low46x2",
      "body": "Wow that resonates with me so much",
      "created_utc": 1727287409.0,
      "score": 4
    },
    {
      "id": "lorvr4j",
      "body": "Just constant nausea for me, if I eat, nauseous, if I don’t, nauseous. Have to force myself to eat anything",
      "created_utc": 1727221106.0,
      "score": 27
    },
    {
      "id": "los66j0",
      "body": "I have the opposite problem. I just binge eat junk food",
      "created_utc": 1727224975.0,
      "score": 10
    },
    {
      "id": "lorzpg0",
      "body": "I do keep having an appetite, yet I can't eat due to feeling nauseaus after two or three bites. Makes it extra frustrating for me bc I put in the effort of cooking and then throw it away 🥲",
      "created_utc": 1727222569.0,
      "score": 9
    },
    {
      "id": "lorza2y",
      "body": "Yeah this. People tell me they overeat when they’re stressed and I’m like “what the fuck is a nervous eater, how do you consume *anything* when stressed let alone overeat???”",
      "created_utc": 1727222409.0,
      "score": 17
    },
    {
      "id": "low4bon",
      "body": "100%",
      "created_utc": 1727287451.0,
      "score": 1
    },
    {
      "id": "loxmbmm",
      "body": "And my nails are always breaking when they’re usually nice and painted. Usually also a sign that I’m not eating or sleeping well so hair and nail health is gone.",
      "created_utc": 1727304830.0,
      "score": 2
    },
    {
      "id": "los68he",
      "body": "This was me today.",
      "created_utc": 1727224995.0,
      "score": 2
    },
    {
      "id": "lpknrk1",
      "body": "I hear you- I spend all of my waking hours doom scrolling.  Just looking for some hope & something to hold on to ",
      "created_utc": 1727653549.0,
      "score": 1
    },
    {
      "id": "lot78mj",
      "body": "I broke my kitchen sink the other day",
      "created_utc": 1727240927.0,
      "score": 1
    },
    {
      "id": "lotzuoh",
      "body": "are you diagnosed with any um trauma disorders ? i hope so, for your sake",
      "created_utc": 1727259758.0,
      "score": 1
    },
    {
      "id": "loszzcb",
      "body": "Oh no. This has pretty much become my baseline",
      "created_utc": 1727237134.0,
      "score": 47
    },
    {
      "id": "loxnupl",
      "body": "No music books hobbies for me either the only thing I do is TV show shows that I’ve seen over and over.",
      "created_utc": 1727305387.0,
      "score": 3
    },
    {
      "id": "lowtum6",
      "body": "I SEEM TO HAVE ZERO APPETITIE ALL THE TIME NOW MYSELF, I CAN EAT BUT I DONT WANT TO, AND THE ANXIETY IS JUST OFF THE CHARTS. I NOTICE I DONT READ AS MUCH WHEN ITS BAD.",
      "created_utc": 1727295367.0,
      "score": 15
    },
    {
      "id": "losqt7q",
      "body": "Totally agree. I grew up listening to rock music with my dad, but I loved every genre of music. But since my anxiety/ptsd, it doesn’t matter what song I play, I just cry.",
      "created_utc": 1727232991.0,
      "score": 30
    },
    {
      "id": "low1x14",
      "body": "I am the same way with playing my own music as well. If I’m playing guitar on a consistent basis (a few times a day for about 30 mins) things are good. When I haven’t picked it up in 3 days, 2 weeks, one month even, that’s when you know it’s not good up in the brian",
      "created_utc": 1727286711.0,
      "score": 4
    },
    {
      "id": "lovq63x",
      "body": "When I’m screaming at the top of my lungs to my teen angst playlist circa 2004.\n“…is it worth it can you even hear me?!”",
      "created_utc": 1727283100.0,
      "score": 2
    },
    {
      "id": "lovoil5",
      "body": "Same since my mom died suddenly in 2019. Used to be extremely into and knowledgeable about music. Can’t listen to it since losing her. I know it indicates something much deeper.",
      "created_utc": 1727282589.0,
      "score": 10
    },
    {
      "id": "lowa9os",
      "body": "Likewise, I think it’s just our grief causing us anhedonia, nothing feels like it used to, like nothing feels right, no joy in anything I used to do that brings me joy. Sorry you’re in “the club” too. It’s tough.",
      "created_utc": 1727289302.0,
      "score": 2
    },
    {
      "id": "lpkmmk5",
      "body": "Wow I do the same thing when people talk to me- I try to focus on what they are saying so I can at least reply but I really don't care what they are saying lol. I know what you mean about a fake smile or grin...",
      "created_utc": 1727653095.0,
      "score": 1
    },
    {
      "id": "lovm3en",
      "body": "Yeah I usually force myself to wash them only when they start speaking",
      "created_utc": 1727281833.0,
      "score": 10
    },
    {
      "id": "loto9u9",
      "body": "Me too! I have like 4 messages from friends sitting there in my notifs from days ago and I just can't muster the energy to message them back... but I can scroll reddit for 2 hrs straight easily lol.",
      "created_utc": 1727251839.0,
      "score": 34
    },
    {
      "id": "lot18tq",
      "body": "[deleted]",
      "created_utc": 1727237770.0,
      "score": 9
    },
    {
      "id": "lovnxpa",
      "body": "Vicious fucking cycle isn’t it?  My depression causes problems and my problems reinforce my depression.",
      "created_utc": 1727282411.0,
      "score": 5
    },
    {
      "id": "lovisnf",
      "body": "1000%!",
      "created_utc": 1727280801.0,
      "score": 1
    },
    {
      "id": "loskz84",
      "body": "for me depression makes me binge and anxiety makes me lose my appetite because food isnt even on my mind",
      "created_utc": 1727230633.0,
      "score": 10
    },
    {
      "id": "lou0obi",
      "body": "No, I'm not. But with time I developed better coping mechanisms. And I'm too much of a coward to kill myself.",
      "created_utc": 1727260252.0,
      "score": 1
    },
    {
      "id": "lotxeas",
      "body": "I was about to say 😅😅😅 I been doing this for years",
      "created_utc": 1727258213.0,
      "score": 23
    },
    {
      "id": "lozab99",
      "body": "I’m sorry ugh 😩 I’m just getting better from a few years of this and hope you do too",
      "created_utc": 1727330252.0,
      "score": 2
    },
    {
      "id": "lowume0",
      "body": "[deleted]",
      "created_utc": 1727295604.0,
      "score": 4
    },
    {
      "id": "lovr1uu",
      "body": "I am sitting in the pain with you, fellow griever. Sending a virtual hug.",
      "created_utc": 1727283370.0,
      "score": 8
    },
    {
      "id": "lovndzd",
      "body": "Yeahhh, your post made me realize that I’m doing the same thing. I have to force myself to engage with my friends who I love. wtf is wrong with us….",
      "created_utc": 1727282240.0,
      "score": 14
    },
    {
      "id": "lot1fzx",
      "body": "My hips too. It’s ridiculous, I need to snap out of this rut I’m in.",
      "created_utc": 1727237873.0,
      "score": 10
    },
    {
      "id": "loxjd5w",
      "body": "Yep! Same with food prep - I know that preparing healthy nutritious meals for myself will help the anxiety, but I get so overwhelmed I can’t do it, so I end up eating junk that’s quick and easy, which adds to the anxiety. \n\n Wish I could afford a cleaner / personal chef for the times I’m struggling,, it would be such a good mental health boost.",
      "created_utc": 1727303761.0,
      "score": 1
    },
    {
      "id": "lp3c78x",
      "body": "Thank you! I did push myself to start up therapy again. Had my first session this week. Hopefully I'll have some improvement soon. I'm ready to feel like a person again",
      "created_utc": 1727388596.0,
      "score": 1
    },
    {
      "id": "lowvqm5",
      "body": "Thanks 😊 I sure hope it comes back I love food but I just don’t have hunger very often",
      "created_utc": 1727295948.0,
      "score": 2
    },
    {
      "id": "loz7t3b",
      "body": "Really? I’ve not had an appetite in a year and I’ve lost like 35 pounds and underweight at this point 😅😅😅",
      "created_utc": 1727328766.0,
      "score": 1
    },
    {
      "id": "lovs2mf",
      "body": "Sending one back your way. The pain truly never fully goes away unfortunately.",
      "created_utc": 1727283677.0,
      "score": 5
    },
    {
      "id": "loyd651",
      "body": "This thread gave me a mental kick in the arse to message them all back last night. I have no f'ing idea why we are like this lol.",
      "created_utc": 1727314775.0,
      "score": 3
    }
  ]
}