{
  "id": "1iiq0or",
  "title": "The best piece of advice for anxiety from 2 + years of therapy.",
  "selftext": "I promise I am not bluffing when I say something that my newest therapist said to me, really changed my relationship to anxiety and how I live my life. My anxiety is down about 50% these days and continuing to lower. \n\nSo, basically, what my therapist told me (who has a PhD and is actually qualified) is that people with High levels of Anxiety often don’t Trust themselves. This means they lack faith in their ability to overcome setbacks and challenges, thus creating fear of the unknown and potential pitfalls of life. \n\nThe second best piece of advice is that I needed to take Risks. Real Risks. Anxiety thrives on Avoidant behavior. The more you avoid, the more anxiety grows. Once I started taking Risks big and small, my life got so much better and less insulated by fear. As my comfort zone grew, my sense of self efficacy did as well. \n\nNow, this may not work for everyone depending on what is causing your anxiety, but for me, it worked wonders. \n\nTL/DR: Increase your Self Confidence and reduce avoidance. ",
  "created_utc": 1738803073.0,
  "score": 1031,
  "num_comments": 93,
  "url": "https://www.reddit.com/r/Anxiety/comments/1iiq0or/the_best_piece_of_advice_for_anxiety_from_2_years/",
  "comments": [
    {
      "id": "mb96ags",
      "body": "Exposure therapy works best for people like us! It’s all about taking risks.",
      "created_utc": 1738825105.0,
      "score": 248
    },
    {
      "id": "mb91epm",
      "body": "So interesting. What kinds of risks did you start taking? I’m intimidated but intrigued",
      "created_utc": 1738822552.0,
      "score": 37
    },
    {
      "id": "mb9d03l",
      "body": "Absolutely.\n\nAnxiety thrives off uncertainty. \n\nDoubt feeds into uncertainty. \n\nThe \"What if...\" Question generates the doubt, starting the cascade. \n\nChallenging thoughts around these feelings is the way to combat anxiety. \n\nWhy do I feel like this? Am I feeling this way because there is an actual risk? Or is it just an anxiety?\n\nUnderstand the cycle involved in anxiety and symptoms. \nThoughts - Feelings - physical symptoms - behaviours.\n\nWhat I find helpful is to recognise thoughts as what they are: just thoughts. \nLike clouds in the sky, they come and go. You can't stop them, but you can control how you react to them. \n\nUtilise \"Thought-action fusion\". - when you have a thought, it doesnt mean it will come true. Thoughts hold no weight or bearing in the observable world.",
      "created_utc": 1738828953.0,
      "score": 36
    },
    {
      "id": "mb8zil5",
      "body": "Thanks for this reminder. I guess at the end of the day, it's just us who can calm our anxiety and to do that we need to trust ourselves, remind ourselves that everything is alright and it will eventually be better.",
      "created_utc": 1738821617.0,
      "score": 29
    },
    {
      "id": "mb9g5qr",
      "body": "Totally true! But i have to add, it goes deeper than that too. Meaning we don’t trust ourselves but we also have a belief system that is not coherent with ourselves. For example, we believe we are not good enough, we believe bad things abt ourselves etc. I feel , through the years of anxiety I have had and still working on them, it is also about the way we see ourselves and what we choose to believe. Hard to break bc belief system is like a web that has been created since long time but not impossible for sure. Sometimes when you hit rock bottom, you ask yourself, will i still want to keep believing this or will i start working on mindset change. It is so crazy how human body/brain works. Example, I have other health issues apart from anxiety and bc of that health issue, travelling is scary for me but travelling is what makes me feel alive too. So i push through and go for it, and i feel wrecked and drained and al shit feelings and thoughts in my trip. This is one way of doing it even if you don’t trust you got this, and in time i have done it and done it and yes the anxiety comes , i overthink it but i go for it, it doesn’t go as planned but it is better than limiting myself from the one thing i love to do .",
      "created_utc": 1738830867.0,
      "score": 16
    },
    {
      "id": "mba691m",
      "body": "My therapist says to me, the more anxiety wins, the stronger it gets.  \n\nThis was in relation to some life changes I'm looking to make/have made- leaving my job and getting a puppy.  \n\nSo yes take risks.",
      "created_utc": 1738845459.0,
      "score": 10
    },
    {
      "id": "mb8ue6g",
      "body": "This is beautiful advice. I had never thought of it this way. Thank you for sharing.",
      "created_utc": 1738819235.0,
      "score": 21
    },
    {
      "id": "mb9u5v6",
      "body": "Did they have any insight on how to trust yourself?",
      "created_utc": 1738839443.0,
      "score": 9
    },
    {
      "id": "mb9rxyz",
      "body": "Thanks for sharing! That's really interesting and I'm glad to hear it's helped you :) \n\nI think exposure works for some but not others. My therapist suggested that my willingness to expose myself to stressors and \"power through\" my discomfort was actually a form of self-denial, because I could only make myself do those things by ignoring the unbearable discomfort they brought me. Maybe an honest and slow approach to exposure is better, but I'm trying to be more gentle with myself these days...",
      "created_utc": 1738838154.0,
      "score": 7
    },
    {
      "id": "mb98xre",
      "body": "Totally agree! The \"don't trust themselves\" part really stuck out to me. What a perfect way to describe it.",
      "created_utc": 1738826586.0,
      "score": 4
    },
    {
      "id": "mb9f4yx",
      "body": "Agreed on the risk taking - forcing myself to do everything I’m nervous about has helped tremendously !",
      "created_utc": 1738830243.0,
      "score": 4
    },
    {
      "id": "mba5fjg",
      "body": "Self mistrust is definitely a thing. What has helped me in recent times has been reading Claire Weekes. She addresses some of this, how to start small and be patient with the process, plus specific troubleshooting tips for various quirks that can arise over the course of panic and anxiety recovery - things that we might start to freak out over thinking they are signs we're losing our minds, or too far gone to recover, but really they are just signs of stress and depletion and will pass.",
      "created_utc": 1738845103.0,
      "score": 4
    },
    {
      "id": "mbai6j1",
      "body": "This is actually so great and I’m definitely going to try this. Thank you for sharing!",
      "created_utc": 1738849956.0,
      "score": 3
    },
    {
      "id": "mbb5bh9",
      "body": "I have anxiety and trust myself and take many risks like changing careers and purchasing a home.",
      "created_utc": 1738857123.0,
      "score": 5
    },
    {
      "id": "mbc2mw3",
      "body": "I was deadly afraid of driving after having an accident ( no one got hurt but the car got totaled).\nMy therapist said that the only assignment I had was to drive. I asked if I could start with just staying in the car and get used to it. He said nope- you have to drive. What's hilarious is I also get anxious if I don't finish an assignment so it was the perfect thing to say to me. Now I drive everywhere- not brave enough for the highway but I'll get there !",
      "created_utc": 1738866337.0,
      "score": 4
    },
    {
      "id": "mbbmi3m",
      "body": "Yeah I used to be a confident happy go lucky guy and now my self confidence and image have tanked and anxiety skyrocketed",
      "created_utc": 1738861885.0,
      "score": 3
    },
    {
      "id": "mbcjfwh",
      "body": "I really feel ,after a year of introspection,that the lack of trust in me and how my future will be has been a big factor to my anxiety and me turning to a hypochondriac.As Fran’s Kafka said “he is afraid to die because he has yet to live “. But it really is easier said than done",
      "created_utc": 1738870965.0,
      "score": 3
    },
    {
      "id": "mbdknpb",
      "body": "Glad the advice has helped you! Thank you for sharing. 😊✨️",
      "created_utc": 1738881287.0,
      "score": 3
    },
    {
      "id": "mbad79v",
      "body": "Taking risks (and losing) is how some of us wound up here. \nI don’t see how this would help if you actually have receipts of what happened. \nI think anxiety and fear are our body’s way of protecting us.",
      "created_utc": 1738848194.0,
      "score": 5
    },
    {
      "id": "mba32xq",
      "body": "Both of those check out with me. Thanks for the tips, I’m going to explore them.",
      "created_utc": 1738844050.0,
      "score": 2
    },
    {
      "id": "mba3cs5",
      "body": "thank you for the great advice",
      "created_utc": 1738844175.0,
      "score": 2
    },
    {
      "id": "mbao06y",
      "body": "So what were the underpinnings of emotions that manifested into anxiety for you? You mention trust. Do you think the root of that distrust was internal (ex: self-doubt, perfectionism, lack of self-efficacy) or external (ex: unpredictable environments, past betrayals, instability)?\n\nLacan often speaks of anxiety as arising not from a lack but from an encounter with something too Real. Something we cannot fully integrate into our symbolic understanding of ourselves. Do you think your shift was about gaining self-trust, or was it more about redefining what trust even meant for you?\n\nWhen you talk about taking risks, do you mean it in the sense of behavioral exposure, or was it more of an existential risk, challenging the fundamental coordinates of your sense of self and desire? I’d love to hear more about how this shift happened for you on a deeper level.",
      "created_utc": 1738851910.0,
      "score": 2
    },
    {
      "id": "mbatq1b",
      "body": "Thank you for sharing! I needed this reminder today.",
      "created_utc": 1738853729.0,
      "score": 2
    },
    {
      "id": "mbb3sp7",
      "body": "I agree that we need to learn to trust in myself. However my self esteem is so low that I find it really hard to have any confidence and I don’t know how to raise it.",
      "created_utc": 1738856691.0,
      "score": 2
    },
    {
      "id": "mbc1p7z",
      "body": "Absolutely 100% I don't trust myself. Me and a partner manage 13 group homes for intellectual disabilities and autism. I can make decisions all day long that I know will impact their lives in high-quality, meaningful ways. Yet to make a decision for myself, I don't trust myself. I'm aware that it doesn't make sense but it's so true.",
      "created_utc": 1738866079.0,
      "score": 2
    },
    {
      "id": "mbdtec7",
      "body": "O/T: Good job finding a therapist with a PhD. I need one of those.",
      "created_utc": 1738883954.0,
      "score": 2
    },
    {
      "id": "mbea4lx",
      "body": "Lots of sound advice here",
      "created_utc": 1738889379.0,
      "score": 2
    },
    {
      "id": "mbezrl1",
      "body": "Some other good tips:\n\nGet therapy! \n\nMeditation, with constant stimuli in today's world it's getting more important to let our brain get a break!\n\nRigerous exercise, something that pushes you and gets that heart beating hard in a natural way, not from anxiety.\n\nAcceptance, you have anxiety, you will maybe always have it and it's ok, it won't kill you, in small steps go do what triggers or causes anxiety for you outside your safe space. \n\nPlan to have an anxiety attack, if going to the park alone caused it before, plan to do that maybe with a friend at first, and see it almost certainly not come when you are planning for it, or at least not as intense, small wins like this is huge when every experience has felt negative.\n\nAnother good metaphor, anxious thoughts are like a telephone that keeps ringing. But you dont always have to pick it up. This can help seperate your thoughts from your self and your reactions. It's normal to have anxious thoughts, but not to always (over) react to them.",
      "created_utc": 1738898041.0,
      "score": 2
    },
    {
      "id": "mbfdhrf",
      "body": "Totally agree with the first part. I am in therapy too. I struggle with the second. I was a very avoidad person so once in my life 12 years ago i took a very big risk . A calculated positive risk. Everything from that day on went to hell. My life is totally fucked. Ruined completely. I look back and i remember that once i was really happy. And i find it hard to beleive . There is no chance i will be happy again thats certain. \nSo that makes me trust myself even less. I lost the tiny bit trust i had left.\n\nI know i  am not helping but this is my experience. ",
      "created_utc": 1738903099.0,
      "score": 2
    },
    {
      "id": "mbk4qrr",
      "body": "This didnt work for me either, my anxiety was more of the sensitized nervous system type.\n\nI really needed rest first and then slowly expose to bigger and bigger fears, being very mindfull of how much pressure I was putting",
      "created_utc": 1738967230.0,
      "score": 2
    },
    {
      "id": "mc0d0eo",
      "body": "This resonated with me so much, thank you. Any tips on how to work on self-trust? ",
      "created_utc": 1739193062.0,
      "score": 2
    },
    {
      "id": "mcluraq",
      "body": "What risks one can take?\n\nI can't take risks only when it comes to money and my life -So I can't do risky investments and I can't do bungee jumping kind of stuff. Obviously not gonna do them just to let go of my anxiety. What else can I do? I have no problem with little daily stuff like calling a public office on phone, going to grocery shopping alone or talking to strangers in parties whatsoever.",
      "created_utc": 1739476643.0,
      "score": 2
    },
    {
      "id": "mbejb5d",
      "body": "This is so great OP! And so on point- I’d been learning about anxious attachment (your attachment style formed in childhood), and realising the anxiously attached person has a low sense of self- they don’t know themselves! They don’t know what they need or want as they’re always sacrificing this to meet other peoples needs. This is fantastic advice that can work for anxiously attached people too x",
      "created_utc": 1738892418.0,
      "score": 1
    },
    {
      "id": "mbeqwcz",
      "body": "This feels true for me. I don't trust anyone, especially myself. Lol \nSeriously though, this was really helpful    ty for sharing.",
      "created_utc": 1738894999.0,
      "score": 1
    },
    {
      "id": "mbg2nk2",
      "body": "Hey, I've taken big risks before because i thought it's just a fear and they backfired. Some permanent. Proceed with caution. Now I have anxiety because of it",
      "created_utc": 1738915623.0,
      "score": 1
    },
    {
      "id": "mbg4xah",
      "body": "[removed]",
      "created_utc": 1738916993.0,
      "score": 1
    },
    {
      "id": "mbhrtcx",
      "body": "Not trusting myself hits so close to home! Thank you for this!",
      "created_utc": 1738942896.0,
      "score": 1
    },
    {
      "id": "mmxolq7",
      "body": "By taking risks I think you mean doing the things that you logically know are safe and reasonable, but that your anxiety won’t let you do. Like if you’re terrified of food poisoning to the point that you have an extremely limited diet, eat a food outside your comfort zone. You know it won’t kill you. Take a tiny nibble. ",
      "created_utc": 1744568665.0,
      "score": 1
    },
    {
      "id": "mba6yp6",
      "body": "The truth of the matter is some of us developed anxiety because we couldn’t afford to take risks. As a child of immigrants , nope cannot afford to risk anything.",
      "created_utc": 1738845760.0,
      "score": 68
    },
    {
      "id": "mb9p778",
      "body": "That didn't work for me at all. It made my anxiety worse than ever",
      "created_utc": 1738836482.0,
      "score": 52
    },
    {
      "id": "mcaesbt",
      "body": "No it doesn't. At least not for everyone .\n I was working in exposing environment, everyday new people , every few weeks new travel and experiences, stress and my anxiety stay as it always been or even got worse.",
      "created_utc": 1739322597.0,
      "score": 1
    },
    {
      "id": "mb9r4wv",
      "body": "Basically do whatever you’re too anxious to do, for example say you avoid a certain place because you have experienced anxiety there before, go to that park. The more you give into the anxiety the more it grows it’s like when you feed a cat and it keeps coming back because you keep feeding it.",
      "created_utc": 1738837666.0,
      "score": 49
    },
    {
      "id": "mbc4mdz",
      "body": "Awesome!",
      "created_utc": 1738866882.0,
      "score": 1
    },
    {
      "id": "mcexmrg",
      "body": "I love that as a quote ",
      "created_utc": 1739387207.0,
      "score": 1
    },
    {
      "id": "mbc4vq5",
      "body": "Self talk alone isn’t enough, trust comes from doing. And reaffirming through action that you have your own back",
      "created_utc": 1738866954.0,
      "score": 5
    },
    {
      "id": "mbayzod",
      "body": "Yes id love to know this too. I try positive self talk frequently but it's hard for me overcome. My therapist says it has roots in my childhood being invalidated so it involves reprogramming",
      "created_utc": 1738855308.0,
      "score": 5
    },
    {
      "id": "mbc4o8l",
      "body": "I love Claire Weekes.",
      "created_utc": 1738866896.0,
      "score": 5
    },
    {
      "id": "mbk4zmc",
      "body": "Claire weekes was for me also the way out",
      "created_utc": 1738967304.0,
      "score": 2
    },
    {
      "id": "mbc482r",
      "body": "I wonder what your anxiety is about?",
      "created_utc": 1738866771.0,
      "score": 1
    },
    {
      "id": "mbc417m",
      "body": "Great story!",
      "created_utc": 1738866719.0,
      "score": 3
    },
    {
      "id": "mbc44hf",
      "body": "Enjoy getting it back!",
      "created_utc": 1738866744.0,
      "score": 2
    },
    {
      "id": "mbdbaae",
      "body": "That’s an interesting quote. Never heard it before. Thanks!",
      "created_utc": 1738878603.0,
      "score": 3
    },
    {
      "id": "mbc4ksy",
      "body": "Taking Risks and winning is what helps.",
      "created_utc": 1738866870.0,
      "score": 3
    },
    {
      "id": "mbatyaw",
      "body": "I agree. I guess it was too big risks",
      "created_utc": 1738853799.0,
      "score": 0
    },
    {
      "id": "mbc4f7t",
      "body": "Self doubt for sure. Lots and lots of that. Insidious it is.",
      "created_utc": 1738866826.0,
      "score": 1
    },
    {
      "id": "mbc3y9t",
      "body": "Start with something small that you can achieve. Something that gives you a sense of accomplishment and competence",
      "created_utc": 1738866696.0,
      "score": 1
    },
    {
      "id": "mc6zmnb",
      "body": "The life you had planned on is ruined, and yeah, that sucks. That’s difficult to bounce back from.\n\nThat was a past life, have you ever considered the viewpoint that we each live many lives? Every atom in your body is replaced within 5 years if it helps to think in physical terms. You’ve even experienced that in a way, not understanding how a past version of you could feel happy. Isn’t it equally as plausible that a future version of you would also be happy in a way that is inexplicable to you now? You trust your ability to predict the future far too much.\n\nWhat if the current and future versions of you were allowed to have dreams and failures of their own without all the predetermined assumptions that belong to someone else? Learn from your mistakes if you can, but to chain yourself to the past seems a self indulgent way to punish ourselves. You have agency left and get to decide if that’s how you will spend it.",
      "created_utc": 1739286920.0,
      "score": 1
    },
    {
      "id": "mcnd496",
      "body": "There you go.",
      "created_utc": 1739492891.0,
      "score": 1
    },
    {
      "id": "mbaeex1",
      "body": "What I’m more so talking about is let’s say someone is scared to grocery shop alone - try to take ‘risks’ to go grocery shopping alone. It can be going with a friend and then going off in an aisle alone. I’m sorry - I didnt mean risks that can put your life or anything else in danger.",
      "created_utc": 1738848637.0,
      "score": 45
    },
    {
      "id": "mbau00q",
      "body": "Are your parents here legally?  If so, there's nothing to worry about.  If not, well....yeah, I can understand the concern.",
      "created_utc": 1738853814.0,
      "score": 0
    },
    {
      "id": "mbea9x2",
      "body": "Or is it that you have nothing to lose and everything to gain from being willing to take some risk?",
      "created_utc": 1738889427.0,
      "score": 1
    },
    {
      "id": "mmxo1j5",
      "body": "This is a ridiculous excuse. Take some risks that don’t cost money and won’t piss off your parents (if that’s what you’re talking about?) I know you can think of some. ",
      "created_utc": 1744568487.0,
      "score": 1
    },
    {
      "id": "mb9ulwo",
      "body": "Ya, same for me.",
      "created_utc": 1738839695.0,
      "score": 18
    },
    {
      "id": "mcf06ns",
      "body": "I agree. To this day I have the worst trauma from times where I pushed myself to do things regardless of my anxiety. Which has actually worsened my anxiety and outlook on life. ",
      "created_utc": 1739387912.0,
      "score": 1
    },
    {
      "id": "mcex0jd",
      "body": "Same sadly :( I'm hoping a therapist will help me make it a journey instead of hitting a wall",
      "created_utc": 1739387035.0,
      "score": 2
    },
    {
      "id": "mbc9a0t",
      "body": "She's the OG of panic recovery! 😉",
      "created_utc": 1738868158.0,
      "score": 3
    },
    {
      "id": "mbkq4uq",
      "body": "She was even honored by the Queen, I saw! So many people who have been helped and still popular.",
      "created_utc": 1738974135.0,
      "score": 1
    },
    {
      "id": "mbc7dru",
      "body": "Feeling overwhelmed",
      "created_utc": 1738867641.0,
      "score": 2
    },
    {
      "id": "mbc9bxw",
      "body": "Psych appt tomorrow  thanks",
      "created_utc": 1738868172.0,
      "score": 2
    },
    {
      "id": "mbc75eq",
      "body": "Not worth it to me.  I’ve had too many catastrophes to f around and find out.",
      "created_utc": 1738867577.0,
      "score": 3
    },
    {
      "id": "mc7l1js",
      "body": "Yes i am often thinking that the moment i changed my life with that decision i literally jumped to a different timeline. It feels like it is a complete different life. What you say makes sence though. Maybe all hope is not lost and i could he happy again one day . Thanks 😊 ",
      "created_utc": 1739293070.0,
      "score": 1
    },
    {
      "id": "mbb3318",
      "body": "The risk here is not legal, it’s more financial. It has to do with having no safety net, little to no family to reach out to for help, etc.",
      "created_utc": 1738856488.0,
      "score": 29
    },
    {
      "id": "mba078w",
      "body": "And same for me. With a gene that actually makes it extremely difficult to break down adrenaline, any kind of stress is disastrous. There are no “one size fits all” solutions.",
      "created_utc": 1738842669.0,
      "score": 32
    },
    {
      "id": "mcf1bbu",
      "body": "This is so sad..",
      "created_utc": 1739388224.0,
      "score": 1
    },
    {
      "id": "mbdbgn4",
      "body": "That’s understandable. This mode of therapy probably won’t work for people like you. Stress reduction and management are better routes",
      "created_utc": 1738878651.0,
      "score": 1
    },
    {
      "id": "mbdbkl4",
      "body": "That is your perogative, I chose not to stay enclosed in fear regardless of the outcome",
      "created_utc": 1738878682.0,
      "score": 1
    },
    {
      "id": "mbb9iuk",
      "body": "This is exactly it. I have no fallback plan. I can’t just “move back in with my parents” if I lose a job, go to jail or get sick or injured to the point where I can’t work.  I AM my parents house.",
      "created_utc": 1738858312.0,
      "score": 18
    },
    {
      "id": "mbaehpq",
      "body": "Oh wow what is this gene called?",
      "created_utc": 1738848666.0,
      "score": 9
    },
    {
      "id": "mbaqo8z",
      "body": "I have this as well -- I have to keep my stress levels down as much as possible, and it's not always possible 😢",
      "created_utc": 1738852774.0,
      "score": 2
    },
    {
      "id": "mbca4r6",
      "body": "Please share. Maybe I need to be tested for this",
      "created_utc": 1738868390.0,
      "score": 1
    },
    {
      "id": "mbd50wj",
      "body": "  Maybe talk to a doctor about beta blockers - they can block much of the effects of physical anxiety(adrenaline)",
      "created_utc": 1738876885.0,
      "score": 1
    },
    {
      "id": "mbe2uzv",
      "body": "I had my anxiety under control for 20 years mostly with celexa 20mg and as needed clonazepam, but was able to go months without it, then if I was experiencing anxiety I would take at most .25mg. Unfortunately my husband died and I found him so I was experiencing extreme anxiety. I was afraid to go home after work and after to wake up ⬆️ n the morning because I would feel overwhelmed at what I had to do that day. So, I’m back to the as needed clonazepam which I hate taking because it makes me tired. In 2015 I made the decision to go back to school for nursing, then this past November I made the decision to buy a condominium.",
      "created_utc": 1738887020.0,
      "score": 1
    },
    {
      "id": "mbbug62",
      "body": "However, if you cannot or are not willing to, improve yourself to combat your anxiety, eventually things will fail, as the anxiety will grow.  Taking risks can be small as mentioned in other comments. Start off by : going to the grocery store by yourself, driving on the highway (some have issues with these tasks), little things. Then, you continually go outside your comfort zone as the zone expands.  Eventually, you will start to have faith in yourself and start feeling more normal.  It was a rough road, but I did just that.  I am not on meds, I don't go to therapy.  I don't need to anymore.  \n  \nLast year was very eventful. I moved cross country. I was let go from my job (my wife is disabled, so I earn the money)... *in the middle of the move!!* I have two kids - one in IL, the other in FL with me.  They were both hospitalized for different illnesses, at the same time!!    \n  \nGuess what? I got through all that.  However, only three years ago, these events would have definitely put me in the psych ward.  But I got through it, thanks to some aggressive therapy and my willingness to get uncomfortable outside of my \"safety zone\".\n\nIt sucks when you go through it, but it is sooooo worth it in the end.",
      "created_utc": 1738864074.0,
      "score": 12
    },
    {
      "id": "mbd5xxi",
      "body": "There are more genes that interfere with the breaking down of adrenaline, but COMT is one of the best known.  \nThe COMT enzyme plays a crucial role in the breakdown of catecholamines such as dopamine, adrenaline and noradrenaline and oestrogens. Impaired function of the COMT enzyme (in about 1/3 of the western population) can lead to Increased adrenaline and noradrenaline levels. This can lead to increased stress response, anxiety, increased heart rate, etc.",
      "created_utc": 1738877139.0,
      "score": 6
    },
    {
      "id": "mbd77xr",
      "body": "Yes, that's right and I also use those in such a case. But that only affects the autonomic nervous system, not the other effects of too much adrenaline.\n\nIt sometimes takes literally 3 days for the adrenaline to disappear from my system and for my body to calm down - even with beta blockers.",
      "created_utc": 1738877491.0,
      "score": 1
    },
    {
      "id": "mbmrqbj",
      "body": "Ptsd",
      "created_utc": 1739005495.0,
      "score": 1
    },
    {
      "id": "mbeuxaq",
      "body": " 3 days?! Whoa that seems extreme .. you have a disorder correct? How can u tell the adrenaline is still high after a few days? Are you shaky or flushed?",
      "created_utc": 1738896377.0,
      "score": 1
    },
    {
      "id": "mbgpirz",
      "body": "Well, I've always found myself overly stressed and reacting to everything, whereas I don't really get upset about things. So quite contradictory.  \nWhen I had genetic testing done, it showed that I don't process adrenaline well. It was a relief to finally know that.  \nWhat I suffer from is mainly a feeling of super tension, threat and insecurity for days after the stress. I sleep badly, my heart beats fast (but that's what the beta blockers are for).",
      "created_utc": 1738929129.0,
      "score": 1
    },
    {
      "id": "mbj35fa",
      "body": "  “Sleep badly”\n\n  Oh man insomnia has been the thorn in my side for too long. It’s one of the hardest areas to improve on for me. Stack insomnia on top of depression and anxiety and you become less than human in a way",
      "created_utc": 1738956339.0,
      "score": 1
    }
  ]
}