{
  "id": "1euxnvt",
  "title": "I took a Clonazepam before a social event and I felt normal and healthy...this is devastating ",
  "selftext": "Hi everyone. Male, 31, lifetime sufferer of panic attacks, agoraphobia, and chronic debilitating nausea. Any stress at all or even sometimes for no reason I start feeling incredibly nauseous. In fact a lot of my anxiety revolves around emetophobia.\n\nAnyway, tonight I took the Clonazepam an hour before. Within an hour I felt....normal. I felt like I could conquer the whole world...not in a manic way but in a \"holy shit I just feel....normal\"\n\nThis got me thinking. How much of my daily chronic and fairly severe nausea is \"just\" my anxiety? I'm on snris for my general anxiety and they work very well. But, this feeling of being healthy is wild to me.\n\nIs there a way to deal with this nausea in other ways than benzos?\n\nI've trried mint, ginger, and even zoffan before to no avail.\n\nAny tips would be amazing. ",
  "created_utc": 1723944823.0,
  "score": 861,
  "num_comments": 549,
  "url": "https://www.reddit.com/r/Anxiety/comments/1euxnvt/i_took_a_clonazepam_before_a_social_event_and_i/",
  "comments": [
    {
      "id": "linl9tv",
      "body": "Benzos are just small miracles in pill form which make them so addictive. ",
      "created_utc": 1723946040.0,
      "score": 722
    },
    {
      "id": "linnsie",
      "body": "Ativan is seriously the only thing that helps me. I take it for emergencies and it’s also the only thing that helps my horrible ibs flare ups and the panic attacks that follow. My panic attacks are so bad that I pass out. I’m almost out of the small amount of pills I was prescribed 2 years ago and I’m worried. It helps my anxiety induced nausea too. I don’t feel addicted to them in any way but I’m worried about not having a safety net. I’m the type of person who feels like I need to go to the ER and like I’m dying when I’m having a panic attack. I hate it.",
      "created_utc": 1723947113.0,
      "score": 113
    },
    {
      "id": "liolhds",
      "body": "Propanalol is amazing and also non-narcotic",
      "created_utc": 1723964449.0,
      "score": 64
    },
    {
      "id": "lipgc83",
      "body": "hey. benzos are there for a reason. i used to take them when my depression and anxiety was at its highest, but tapered off as i became more stabilized. if it helps, it fuckin helps, you know? when you’ve been so desperately anxious for so long, allowing your brain that peace is not only healthy but necessary for healing. you’ve got to remember what it’s like to feel normal.",
      "created_utc": 1723983882.0,
      "score": 17
    },
    {
      "id": "linn5g3",
      "body": "ah. this is the only medication that legitimately works on my crazy anxiety as well... it's been years, every single medical professional I have seen, 4 different ones I believe (all telehealth due to location as well as worsening of condition) and due to the stigma..they just don't. instead, I'm on like, my 6th different medication that ultimately does nothing. what's the point of producing Anti-anxiety medication if it doesn't go to the actual patients who suffer FROM JUST THAT SPECIFIC ILLNESS. it's impossible. It's clear this is a problem the majority of us will have to contend with. how many have already failed?",
      "created_utc": 1723946835.0,
      "score": 79
    },
    {
      "id": "linnrfc",
      "body": "Bruh I feel u man! It’s wild right? Ur ssri are great! I take an Ativan even at .50 feel like I can handle anything !",
      "created_utc": 1723947099.0,
      "score": 13
    },
    {
      "id": "liogf8j",
      "body": "Clonazepam is the greatest thing since sliced bread. I’ve had addictions to so many benzodiazepines, Xanax, Valium, Ativan, pressed bars you name it - nothing is even close to Clonazepam. It’s the only one that doesn’t get you high, but really just eliminates anxiety for the day and lets me work and be social. \n\nEverything in moderation. It’s very easy to go off the deep end with benzos and go through withdrawals… been there too many times to count. I seriously wouldn’t wish withdrawals on my worst enemy.",
      "created_utc": 1723961283.0,
      "score": 12
    },
    {
      "id": "lio36my",
      "body": "So true. I used to be extremely. Dependent on it now I only  take it a couple times a month for emergencies. But it really is a miracle. I always used to think I liked myself better on klonopin . More relaxed and present versus in my head thinking about how I can’t breathe etc. other meds don’t really work for me",
      "created_utc": 1723954071.0,
      "score": 8
    },
    {
      "id": "liox0xj",
      "body": "So when you eat something that’s off, or get salmonella or norovirus etc, your stomach reacts the only way it can to get rid of it for you- vomiting (fight mode). Stomach has identified the threat, wants to keep you alive (thanks stomach!) When someone feels anxious they can feel sick because the brain tells the body to look out for threats - freeze mode (fight-flight-feeeze-fawn- one of the 4 threat responses we just never talk about it). Actively retching is more like fight mode! The stomach gets the message from the brain that there are threats about and goes into -I’m ready to be sick mode- or actively gets you to retch because it’s scared the imminent threat is going to kill you (thanks again stomach!) \n\nYou have to actively speak to the subconsious to reassure it that the situation you’re in is not going to kill you- your brain is overdoing the threat response and your body is running right along with it. Repeat that you’re safe to yourself when you’re having to do anything scary and when eating every bite. Being scared of being sick is kind of counterintuitive too, because your body is doing exactly what it can only do to keep you alive- that’s it’s sole mission. So say ‘thank you body for doing these things but I don’t need you too- because we’re safe’. Helpful to identify your traumas and where they started- your brain is reacting like you’re about to get eaten by a sabre tooth tiger whilst out gathering food because it’s reaponses are v limited and rooted in evolution. Tell the brain you’re not going to die from X Y or Z and the subconsious will start to believe it.",
      "created_utc": 1723972172.0,
      "score": 9
    },
    {
      "id": "lipfp92",
      "body": "Have you tried hydroxyzine? They're not addictive because it's just an antihistamine and they work wonders for me. Only problem is they make me hella drowsy. Gotta cut them in half if I don't wanna take a nap 🤣 \n\n\n\nFirst time I had them I was in the ER with really bad heart palpitations (thanks prednisone) and was freaking out. They gave me some and I almost fell asleep in the waiting room haha my husband even commented that he was shocked at how happy and relaxed I was. I'm a frequent ER flyer so he's used to seeing me panic 🤣🤣 I asked them to send me home with a prescription and got more from my primary later. Total game changer combined with my sertraline.",
      "created_utc": 1723983569.0,
      "score": 6
    },
    {
      "id": "lint3iy",
      "body": "Oof this is so rough. I’m sorry OP, I really empathize with you. Fellow emetophobe and nausea struggler and pretty sure my chronic stress and anxiety my whole life has given me IBS.\n\nThe brain gut connection can be so strong, I really hope it’s studied more. For me, finding the right medication was what has helped the most. SSRIs/SNRIs helped a bit, but ultimately they aren’t for me, and I’m actually on antipsychotics being used off label for anxiety and depression instead and they work way better. When I am unmedicated I basically stop eating, get severely underweight, and feel nauseous and like I’m going to pass out 24/7. Do you struggle with under or overeating at all? I also tend to walk around with my abdomen muscles super clenched, and when I relax them suddenly I’ll feel a bit better.\n\nI’m wondering if there is a medication that will work even better for your anxiety which could help, or maybe an additional medication (I am not a doctor, just speculating). CBD might be worth a try? I find it helps my nausea and boosts my appetite (THC in doses that makes me high does the polar opposite and makes me feel super sick). I also find that L-Theanine works like a benzo for me, just not nearly as potent. When I am experiencing anxiety that’s not quite a panic attack I will pop one and it does help calm down my brain which in turn calms down my stomach. I also started taking magnesium glycinate daily and it helps my body feel more zen.\n\nI hope this helps! Big hugs if you want them.\n\nEdit: I also forgot to mention Propranolol! I love it, it helps a TON with physical anxiety symptoms. There’s immediate release versions you can take as needed, or extended release ones you can take every day. I was on the extended release for a long time and loved it, but it did make me pretty dizzy and lightheaded. I’m now on the immediate release as needed and it feels a lot better. Also, if you have asthma, be very careful with beta-blockers. They can cause your symptoms to be worse. I’m lucky and it doesn’t affect my lungs, but you really should be careful with it.",
      "created_utc": 1723949410.0,
      "score": 13
    },
    {
      "id": "linrdrq",
      "body": "The severe nausea is the thing that makes dealing with my anxiety the worst. I have a low dose hard to refill Rx for Ativan. I totally hear you that there is something that helps but it is not the ultimate solution. Hang in there!",
      "created_utc": 1723948661.0,
      "score": 5
    },
    {
      "id": "lio5q55",
      "body": "Taking a beta blocker daily has really helped me. My anxiety always showed itself very physically but I think it was because I was so sensitive to feeling even a tiny bit off, so that when I did, I would panic and it would all become sooo much worse. Worth a try?",
      "created_utc": 1723955328.0,
      "score": 5
    },
    {
      "id": "linoalk",
      "body": "I have the same exact situation on my end as a female, same age. I take Cymbalta daily & Ativan PRN. I used to be addicted to overtaking benzos and then I realized my anxiety was never going to get better if I used it as a daily routine. So now I don’t take the allotted amount unless I truly need it and can’t fight through it. Unfortunately, the only thing you can do is take control of your situation and prepare for those situations that might arise with Pepto, bags, mints, etc. I also go to individual therapy 2x per month & hot yoga 3x per week. It’s not devastating to know that with some mindfulness and preparation, we can live a fairly “normal” life. Wishing you the best.",
      "created_utc": 1723947328.0,
      "score": 13
    },
    {
      "id": "lioe6en",
      "body": "After my TBI Ativan was the only thing that saved my life.  Took a few months before the doctor prescribed it and it was life changing got me back on track.  I haven’t taken it in a while but it legit reset my mind.",
      "created_utc": 1723959918.0,
      "score": 4
    },
    {
      "id": "lipwpy8",
      "body": "Clonoz saved my life. I developed acute panic disorder sudden onset from complex PTSD. It didn't instantly relax me like xanax or valium. It just made me feel like the faulty alarm in my brain was fixed. I've been on it 18 months and will likely be on it forever. I take it like an anti depressant and it's slow release. I've had one of the worst experiences of my life in the past year and yet I've dealt with it all far better than I would have I wasn't medicated. I basically fell desperately in love with a friend who hit on me only to find out he was a psycholigically abusive monster. I've never felt like that about anyone. I thought he was the one. And he practically destroyed me. But being on Klonoz I didn't have the extra weight of extreme of anxiety on top of the emotional pain. I've also got serious health issues I'm facing and going to hospital to screened for cancer and pain management. Before I went on Klonoz I was too phobic to even get a blood test, As long as you're responsible with benzos they can be life savers.",
      "created_utc": 1723990656.0,
      "score": 4
    },
    {
      "id": "liq191o",
      "body": "[deleted]",
      "created_utc": 1723992287.0,
      "score": 6
    },
    {
      "id": "linsxw7",
      "body": "I totally feel the same. Been on it for a few years now. I don’t feel any kind of high, relaxation, sleepy, etc. I just feel “normal” like you said.  I remember telling my wife when I would first try it that I just felt “normal”. Sorry I have no tips for the nausea but I wish you the best.",
      "created_utc": 1723949341.0,
      "score": 9
    },
    {
      "id": "lip3dje",
      "body": "I find these comments crazy! I've been on benzos for 20+ years (more than 1 type per day).\nNever built tolerance, they always work wonders. \nIf I need some, I'll just call the clinic and they're prescribed. Maybe there's not a problem here of people abusing benzos? \nI have about 10 boxes of different benzos in my \"pharmacy drawer\". It's normal to me.\nI don't understand the hesitancy towards them... what is wrong in needing them to feel normal/good? My brain needs them, so I take them. Same as with SSRI's, on them for 20+ years. \n\nNever felt like taking more than what I need and they always work. So what if someone needs them to function? \n\nAlso, I've stopped taking them quite abruptly when I made some changes along these years and didn't notice any withdrawal symptoms. \nI really don't understand it - if someone benefits from taking them, why not just take them and keep taking them?? Chronic disease is a thing so why do people mention withdrawal as soon as the subject is benzos? Why the automatic thought of \"I'll need to stop them\"? Most probably people need to take them forever - what's wrong with that?\n\nI really don't get it, it's a different world around here I guess. Anyone cares to explain it to me? I know it's a big issue in some countries, I don't get why.",
      "created_utc": 1723976470.0,
      "score": 18
    },
    {
      "id": "lip8c8a",
      "body": "You might have a chronic condition that you aren't aware of. I know for myself, I was diagnosed with chronic urticaria (a long term condition that causes hives, flushing, and fatigue). I didn't know for most of my life that I had chronic urticaria. The benzos would really help with my skin flushing, and my logic was that \"I am flushing because I am nervous, and the benzos take away the nervousness and therefore the flushing\". Once I was diagnosed with chronic urticaria, I learned thar benzos help with chronic urticaria symptoms like flushing. So, my point is that you could have a chronic condition that you don't know about, and the benzos could be helping to alleviate symptoms of that condition.",
      "created_utc": 1723979603.0,
      "score": 3
    },
    {
      "id": "linke2d",
      "body": "I've dealt with the awful nausea too, the only thing that seems to work for me is Prozac",
      "created_utc": 1723945678.0,
      "score": 3
    },
    {
      "id": "linwz6d",
      "body": "Man what a coincidence, the same exact thing happened to me this week. I had Clon prescribed toe a few months ago and really only took it at night as needed. I had panic coming on the other day and took one, and immediately felt… normal and healthy. It was such an amazing feeling. I just get worried that Dr.’s will refuse to prescribe it.",
      "created_utc": 1723951163.0,
      "score": 3
    },
    {
      "id": "lioeqfm",
      "body": "Proponolol works really well for physical anxiety. Please do your research but it really works for me. I'd look into natural remedies. Have you been to the doctor to see if youre deficient in anything ? Magnesium is an absolute god send. \n\nI always ask the basic questions such as do you exercise and do you eat well? It's vital that we exercise and it's vital we eat well. Food is fuel. Make sure you drink lots of water. I deal with all kinds of stomach issues from nausea to bloating. I recently heard that working out your legs releases a lot of endorphins. So going for walks uphill, jogging/running, lifting weights, of body exercises like air squats. \n\nIt's the worst and if I don't feel good in my stomach, I have trouble doing anything. Then it'll begin an awful cycle where I'll get mental anxiety from not eating, then physical anxiety from the mental anxiety combined with not eating. \n\nAnother thing that helps me is this green powder blend. I mix it with plant based protein and it's really easy to consume and get down. It gives me good, positive energy. Theres so much more you can try such as Omega 3.\n\nMake sure you write everything down. Take note of the way you feel before you do something, then take note how you feel after you do whatever it is you do.",
      "created_utc": 1723960247.0,
      "score": 3
    },
    {
      "id": "liomviq",
      "body": "I’ve never once been able to get any doctor to prescribe me even a low dose prescription of even just a handful of any benzo to use as a last resort. Or to even have just for the relief of knowing I have something available in an emergency even helps and I don’t and up taking it. Every last one has treated me like a drug addict doctor shopping for merely suggesting . even though no doctor has even prescribed them to me and I can count on 1 hand the times I have taken any in all my 50 yrs of living. \n\nYet, I had a dog that was super anxious of storms and loud noises. The vet prescribed actual Xanax, repeatedly. \nJust knowing they were there was a relief and calmed my anxiety without actually taking any.",
      "created_utc": 1723965340.0,
      "score": 3
    },
    {
      "id": "liotg1y",
      "body": "Mirtazapine helped my anxiety induced nausea a lot, it almost went away completely. It's a strong antiemetic",
      "created_utc": 1723969733.0,
      "score": 3
    },
    {
      "id": "liozwq1",
      "body": "Unfortunatly I’m in the same boat and have to do the same as you with my lorazepam…",
      "created_utc": 1723974145.0,
      "score": 3
    },
    {
      "id": "lipi9y1",
      "body": "Don’t ever take that pill . It will destroy your life . I took it for 6+ yrs and it took a hell out of me to come out of it . It took 2 full years to get through withdrawal symptoms. Doctors won’t admit your symptoms and they will think you are mad but trust me it induces symptoms which are above and beyond the realm of medicine functions. It’s a good drug to suppress anxiety neurosis but it’s not a cure .",
      "created_utc": 1723984818.0,
      "score": 3
    },
    {
      "id": "lipn1fl",
      "body": "I have what you’re talking about, but replace nausea with being light headed. For years I tried everything, and there are 2 things I can recommend you try. \n\nFirst: don’t dismiss breathing exercises. They 100% work. I did only this for years. \n\nSecond: Buspar. Ask your doc about it. It’s the first medicine that actual did something (long term) and it seems the side effects are almost non-existent. I can’t explain what it does though, it just seems to make everything a “little better”. A shitload of my daily stress is just gone.",
      "created_utc": 1723986817.0,
      "score": 3
    },
    {
      "id": "lipy3v7",
      "body": "By far the best anxiety pill I have taken. It calms me down to a great extent.",
      "created_utc": 1723991163.0,
      "score": 3
    },
    {
      "id": "liqb0ue",
      "body": "I’m scared of benzo addiction too, but I keep lorazepam (Ativan) or diazepam (Valium) on hand for emergencies. I take mirtazapine (Remeron) daily and it keeps the anxiety and panic at a tolerable level, for the most part, but there are certain situations that the mirtazapine just doesn’t touch. Driving in big city traffic is a big panic attack inducer for me; socializing with a group of people I don’t know very well is another. Certain types of doctor appointments, having to give a presentation/speak publicly, attending loud, crowded, overstimulating events like festivals or tourist attractions… these are situations where I know I will need prescription assistance if I’m going to make it through. I often go weeks between taking a dose, because these types of situations aren’t terribly frequent for me. The most consistently I took benzos was a period of time when I was having panic attacks at bedtime or in my sleep. My psychiatrist had me take a low dose on evenings when I could feel the anxiety ramping up. I also took them while I was in a community theater play. I took it a few days a week for a couple of months. I was a little worried that I might develop an addiction in both of those situations, but I quit taking them without any problems, maybe because it was such a small amount. \n\nI will say, though, I’ve never taken more than prescribed in case I like it too much! 😅",
      "created_utc": 1723995645.0,
      "score": 3
    },
    {
      "id": "lio5alq",
      "body": "I felt the same after taking an ativan. Wanted to cry at how normal I felt.",
      "created_utc": 1723955111.0,
      "score": 5
    },
    {
      "id": "linwsv1",
      "body": "I remember taking my Ativan for the first time and wanting to cry because I was like, “damn, is this what normal people feel like?” Of course, I only take them when I absolutely need them because I don’t want to lose my access to such a wonderful thing, so about 10 will last me three months. It’s crazy how anxiety just becomes a part of us",
      "created_utc": 1723951083.0,
      "score": 2
    },
    {
      "id": "lio9skh",
      "body": "I just want to say, the baseline for nausea in the majority of people is zero.",
      "created_utc": 1723957437.0,
      "score": 2
    },
    {
      "id": "lioe4zb",
      "body": "My problem is nothing like yours, but on some days when my sciatic pain is not flaring up, I feel just about euphoric. I guess it's kind of like that. Part of it is waiting for the other shoe to drop but most of it's lovely.",
      "created_utc": 1723959894.0,
      "score": 2
    },
    {
      "id": "liophmq",
      "body": "Honestly I would love to try this but scared of getting addicted to it.",
      "created_utc": 1723967064.0,
      "score": 2
    },
    {
      "id": "lios6to",
      "body": "slightly unrelated, but for some reason when I started taking magnesium, my anxiety almost completely disappeared. I became almost manic because I got SO excited about not being so anxious anymore. And then for some reason it stopped working, but it was nice for like 2 weeks!\n\n\nI still recommend magnesium for anxiety. It definitely helps (and is more healthy)",
      "created_utc": 1723968884.0,
      "score": 2
    },
    {
      "id": "liovpbs",
      "body": "Clonazepam was one of the few meds that ever helped my anxiety, and it does also help with nausea, regardless of the cause.  I have a condition that causes nausea as the primary symptom and it is known to help for that.  Usually I take Gravol for it, heat on the stomach also helps so hot drinks/soups, hot baths, heating pads etc.",
      "created_utc": 1723971285.0,
      "score": 2
    },
    {
      "id": "lip6ohe",
      "body": " How much of my daily chronic and fairly severe nausea is \"just\" my anxiety ==> 98%",
      "created_utc": 1723978619.0,
      "score": 2
    },
    {
      "id": "lipax2v",
      "body": "Clonazepam makes me sleepy. But man it really makes things better",
      "created_utc": 1723981086.0,
      "score": 2
    },
    {
      "id": "lipect8",
      "body": "I take Lorazepam (Ativan) every morning. Doctor gave me 1mg tablets, but I crack them in half and take it every day. I have real bad anxiety in mornings",
      "created_utc": 1723982894.0,
      "score": 2
    },
    {
      "id": "liper3w",
      "body": "I take lorazepam (Ativan) every morning, but crack the 1mg pill in 1/4’s and if I wake with anxiety at4am I take 1/4, and take another 1/4 at 6am if still have bad anxiety. I need to be at work by 7am",
      "created_utc": 1723983094.0,
      "score": 2
    },
    {
      "id": "liphoaf",
      "body": "[removed]",
      "created_utc": 1723984531.0,
      "score": 2
    },
    {
      "id": "lipqmc8",
      "body": "The question I was asking myself the other day was “how can I have the clonazepam feeling without the clonazepam?” I know it’s probably not doable.",
      "created_utc": 1723988312.0,
      "score": 2
    },
    {
      "id": "lipvlwl",
      "body": "I take a tricyclic antidepressant called amitriptyline for anxiety, IBSD and insomnia. It's also commonly prescribed for other things like migraines, cyclic vomiting syndrome, neuropathy, etc. I used to deal with a lot of emetophobia (fear of vomiting) but since being on ami I don't get that nauseous feeling all the time anymore. Still happens occasionally due to my chronic reflux and post nasal drip but it's definitely decreased. Ami does cause drowsiness so it's usually taken at bedtime but at a low dose I imagine the drowsiness might be similar to that of a benzo.",
      "created_utc": 1723990245.0,
      "score": 2
    },
    {
      "id": "liqahmj",
      "body": "Unfortunately, you feel normal until you don’t. And that’s  even more devastating. Because you are left with 10 times the initial anxiety plus an addiction. And the withdrawal symptoms are so bad. I would advise you to do The Work (by Byron Katie). If you are religious you find feel scared to do it but if you just use it as a tool, you might start feeling less anxious.",
      "created_utc": 1723995463.0,
      "score": 2
    },
    {
      "id": "liqnny2",
      "body": "I have exhausted a lot of alternative options when it comes to physical anxiety symptoms. EMDR therapy, exercise, group therapy, meditation, changing my eating, cutting out certain foods and caffeine, Lexapro, etc the list goes on. \n\nUnfortunately, it just depends on the persons threshold.\nBenzos have always been the only thing that have helped me feel literally normal when it comes to physical anxiety. I experience loose bowls, nausea, sweating, trembling, shaking, panic, back pain, joint pain. Like my body freezes up when I’m stressed and anxious. Benzos take all that away 😔",
      "created_utc": 1723999868.0,
      "score": 2
    },
    {
      "id": "lir4vim",
      "body": "I think Benzos can be useful in extreme moderation. I take .5mg (sometimes I’ll cut it in half and just take .25) every month or so and it can be a lifesaver. But it’s important not to take them often and to stay at a lower dose. Keep trying to find other alternatives and use them as an emergency. But I find that even knowing I have the benzos is enough to calm my anxiety down.",
      "created_utc": 1724005551.0,
      "score": 2
    },
    {
      "id": "lirzlrq",
      "body": "There are countless stories about benzo addictions and horror stories. I will be one of a few but I have used klonopin on a daily for probably a decade at this point and have only went up by .25 mg in that time. I still get relief from anxiety when I use it, have stopped cold turkey plenty of times and have never felt the need to go any higher.\n\nIt helps a ton with functioning in social events and dealing with general anxiety. I also use CBD, which I’m hoping will replace it but I use both when I feel the need.",
      "created_utc": 1724015875.0,
      "score": 2
    },
    {
      "id": "lisdde2",
      "body": "This is what happened to me 5 years ago, 6 overdoses, at least 20 excruciating withdrawal periods, a rehab visit, 3 break ups, 4 arrests, years of depression later, I am finally 57 days clean. Don’t do it, it’s a slippery slope.",
      "created_utc": 1724020878.0,
      "score": 2
    },
    {
      "id": "lisy4nq",
      "body": "I had the same reaction with Ativan. I’m on Effexor all the time and that’s helping, I use the Ativan to help my brain see that these situations that made me so frozen and mad are actually normal and I’ve been able to approach them without it. If you journal it helps, before and after the event, then try to wait longer before taking it next time. \n\nThat’s what my doc has me doing anyway, and I’ve gone from 3x/week (low dose) usage to once a month or less.",
      "created_utc": 1724028920.0,
      "score": 2
    },
    {
      "id": "linw4js",
      "body": "I've been on several anxiety medications over my years, but oddly enough when I was diagnosed with ADHD a few months ago, the medications I was prescribed (Adderall and then Vyvanse later), it got rid of my anxiety entirely",
      "created_utc": 1723950770.0,
      "score": 2
    },
    {
      "id": "linz7li",
      "body": "X medication has been a game changer for me.",
      "created_utc": 1723952200.0,
      "score": 1
    },
    {
      "id": "lioiczt",
      "body": "I find weed helps sometimes…but not always. \n\nSometimes I take too big of a hit and cough up a lung and eventually whatever was left in my stomach at the time. \n\nI recently read that smelling isopropyl alcohol helps to.",
      "created_utc": 1723962498.0,
      "score": 1
    },
    {
      "id": "lioltgu",
      "body": "Here in Spain there is a medication called motilium which is anti nausea. This has worked for me with my anxiety nausea. Only thing is you can't take them more than 4/5 days in a row.",
      "created_utc": 1723964658.0,
      "score": 1
    },
    {
      "id": "lip4ij1",
      "body": "I have the same issue. I’m only taking Domion atm but man I wish I didn’t have the nausea and anxiety for like 15 years of my life. It was so debilitating (and still is, it just happens less often nowadays).",
      "created_utc": 1723977228.0,
      "score": 1
    },
    {
      "id": "lip51sg",
      "body": "Use this as something to aim for. You know taking benzos daily isn’t a solution but use it as a benchmark for how you want to feel with non addictive meds and therapy.",
      "created_utc": 1723977580.0,
      "score": 1
    },
    {
      "id": "lipbpvn",
      "body": "My dr told me Benzodiazepines should never be taken more than 2 weeks. That being said I’ve been on Rivitril for 6 years but down from 1 mg 3 times a day to.5 once a day. Hope to be done with the in time. 🇨🇦",
      "created_utc": 1723981516.0,
      "score": 1
    },
    {
      "id": "liq2odw",
      "body": "You sound like me. But I’m 72, I have just gone from type 2 to type 1 diabetes so now on insulin—since I had Covid. I also have ibsd. My digestive issues are helped with Imodium. Recently I have been nauseous while pooing. \n\nI love Xanax. I feel better in digestion and sleep better. But it is addictive so I only take 1-2 times a week.",
      "created_utc": 1723992789.0,
      "score": 1
    },
    {
      "id": "liq7bgz",
      "body": "Clonazepam is the only thing that helps me too. If you haven’t tried it yet, propranolol could be something to test out for physical anxiety symptoms it’s a lot safer. \n\nI was prescribed it when my mom died and I couldn’t eat, sleep or stop crying for months. Literally could not function they gave me every other medication that was not a benzo available at the highest dose. I’ve always had panic disorder and once it kicks in, my house could be on fire and I’d just think “meh whatever”. Truly the only thing that kept me alive. I’m still struggling with panic attacks and insomnia over a year later and I hope I don’t have to depend on this med forever…",
      "created_utc": 1723994382.0,
      "score": 1
    },
    {
      "id": "liq944m",
      "body": "Don't be upset when the medication does what it's supposed to do.",
      "created_utc": 1723994995.0,
      "score": 1
    },
    {
      "id": "liqehdt",
      "body": "What dose did you take",
      "created_utc": 1723996803.0,
      "score": 1
    },
    {
      "id": "liqeygn",
      "body": "Adhd more than anxiety but that's how I'm feeling rn about medication, like what if it just fixes me? I dont want to be dependant on some drug that might stop working for no reason in the future",
      "created_utc": 1723996963.0,
      "score": 1
    },
    {
      "id": "liqjz35",
      "body": "they’ve saved my life. and i am not addicted to them. but i don’t take them more than needed. i keep a personal goal to take less whenever possible - bc my goal is to lessen my anxiety not mask it for life with pills.\n\nthe pills are an incredibly important tool. they saved me from high risk suicide.",
      "created_utc": 1723998639.0,
      "score": 1
    },
    {
      "id": "liqkmc2",
      "body": "I am also a very nauseous person. I have OCD and emetophobia, giving severe panic attacks. I have found that an SSRI and a mood stabilizer are the best at controlling my nausea. Mood stabilizers can help a LOT with anxiety!\n\nI also use Zofran for nausea\nHydroxizine for lesser anxiety\nAtivan for severe anxiety (maybe a few times a year)",
      "created_utc": 1723998855.0,
      "score": 1
    },
    {
      "id": "liqs2a6",
      "body": "It's probably due to Gaba. Same reason many find same relief from drnking alcohol (problem is, it backfires and makes things worse).\n\nCheck the below link out. I think the ultimate goal is to work on the microbiome. L. Rhamnosis is shown in mice studies to have an impact on stress/anxiety but there are others. Lifeway and Giant organic keffir both have this strain. You could try doing an experiment for a weak or so, I'd suggest daily consumption as many meals as possible, just have a small glass. Plus the extra protein could help anxiety too.\n\nI used to be in peak shape when I was doing a lot of keffir, hard to know if that's why but it's been on my radar.\n\nPs. Fibers and vegetables and such can't be discounted. Probiotics have such an impact that they are linked to weight gain. Years and years back it was probably mostly thought simply by regulation insulin or keeping you full, and while these help things, the fiber has a profound effect on our microbiome. There are so many chemical compounds both good and bad these bacteria can produce and they play a crucial in health of both mental and physical.\n\nhttps://www.sciencedaily.com/releases/2024/06/240605162519.htm#:~:text=When%20someone%20eats%20a%20poor,eat%2C%20and%20how%20we%20feel.",
      "created_utc": 1724001322.0,
      "score": 1
    },
    {
      "id": "liqsoor",
      "body": "I know that feeling well. And once you realize how great benzos work, it becomes very difficult not to take them for any situation that may cause anxiety. I ended up relying on them anytime I wanted to do anything social and whenever I drove. I took them everyday for work for years (at a very low dose). \n\nNow, I take them very sparingly but I believe they caused permanent damage to my memory. I can  barely remember anything that happened a week ago. I watch movies over and over again and don’t remember anything that happens in them. I have trouble recalling words and names. \n\nNot trying to scare you! I am not against taking benzos by any means. Just be sure you don’t get to a point where you find yourself using them as a crutch multiple times a week for long periods of time.",
      "created_utc": 1724001519.0,
      "score": 1
    },
    {
      "id": "liqxsjf",
      "body": "Not an expert on anxiety but maybe ask yourself. Was there a time in your life when you felt normal? What was different? I noticed that social isolation and lack of purpose bring severe anxiety in me. You might have different causes, but they must be there. Hope you feel better soon",
      "created_utc": 1724003190.0,
      "score": 1
    },
    {
      "id": "lir077k",
      "body": "The same happened to me with my dizziness. I took 0.5mg Clonazepam before a social event and I felt like myself again.",
      "created_utc": 1724003987.0,
      "score": 1
    },
    {
      "id": "lir9g7x",
      "body": "When i went to the hospital because i thought i was dying ...i could NOT stop puking. Lot of other stuff but the nurse gave me an injection and i quit puking. The paramedics on the way gave me like 3 iv zophran. \n\nWhen i stopped puking and settled down the nurse came to me and said \"im gona level with you. You had zophran and kept getting sick. I just gave you some ativan and now your fine. This is an anxiety attack\" \n\nI didnt believe throwing up was a symptom but anxiety always manifests there. \n\nI always am about a 4/10 anxiety. And it sucks that benzos are the magic cure that is also a dangerous addicting substance. So unfair.  Today i didnt have a panic attack but decided since ive been attack free for awhile to just have one day to feel like a human and not a shrinking violet. \n\nNow i feel guilty. But whatever i just want to feel calm one eff day.",
      "created_utc": 1724007065.0,
      "score": 1
    },
    {
      "id": "lirnr61",
      "body": "So there this kid that's making fun of my brother because he drinks but he lost his wife 3 years ago and he always making fun of him and I have anxiety not because of that but what should I do  like is always the broken ones that are making of they say I should be strong and strong people don't complain and don't show their feelings I just a kid I don't know what to do",
      "created_utc": 1724011901.0,
      "score": 1
    },
    {
      "id": "lirv6dd",
      "body": "I hate them so much but also need them when anxiety becomes crippling like I can’t leave the house and can’t get out of the bathroom bc anxiety causes stomach/ bowel trouble. I was on clonazepam and it worked for awhile then stopped, same thing w alprazolam. Currently have lorazepam for rescue situations only. My partner holds them and will give them when I become incapacitated but I can’t won’t ever take daily again",
      "created_utc": 1724014360.0,
      "score": 1
    },
    {
      "id": "lirz3wv",
      "body": "r/emetophobia",
      "created_utc": 1724015703.0,
      "score": 1
    },
    {
      "id": "lisc0oi",
      "body": "I went to the hospital for what I now know was a panic attack a few years ago. They gave me a shot of ativan and for the first time in my whole life, it was quiet. My brain was quiet. My body was quiet. I was still and relaxed. I didn't know I had anxiety that bad until that day.",
      "created_utc": 1724020353.0,
      "score": 1
    },
    {
      "id": "lisgj3i",
      "body": "hi, i also have emetophobia and at one point struggled to leave my house because i would get panic attacks everyday and was also severely nauseous. i take benzos as needed, but currently started wellbutrin and it was life changing for me. not sure if you’re on it, but it really helped with my nausea which was mostly from anxiety. i know for some people it makes anxiety worse but for me it really helped. edit: i have been on wellbutrin for over a year",
      "created_utc": 1724022100.0,
      "score": 1
    },
    {
      "id": "lish0fr",
      "body": "I took clonazepam for 2 years pills and the dissolvable pills. I’m now taking Xanax and it works great. I nauseous myself and I use fresh ginger with pineapple peels and boil it for 5 mins then strained and sip.  \nAlso Vicks helps too just get the tube one. This is for emergency for me. \n\nGood luck . ",
      "created_utc": 1724022286.0,
      "score": 1
    },
    {
      "id": "lisimz5",
      "body": "Mirtazapine is amazing for anxiety-induced nausea. \nBe careful with the benzos. I went from once a month to daily pretty quickly. Now, I can’t get that amazing *normal* feeling back.",
      "created_utc": 1724022905.0,
      "score": 1
    },
    {
      "id": "lisktrs",
      "body": "[removed]",
      "created_utc": 1724023737.0,
      "score": 1
    },
    {
      "id": "liskvhh",
      "body": "They are amazing in the beginning. But after 2-3 years in you have to take a mouthful to even try and get the same effect you did of your first 0.5. They are a blessing and a curse         \n          \nSource: me",
      "created_utc": 1724023756.0,
      "score": 1
    },
    {
      "id": "lisu03c",
      "body": "Take a look into the research of passionflower. It has been studied and has been found to be as effective as some benzodiazepines. If you are not wanting pharmaceuticals there are a lot of other natural remedies that are calming.",
      "created_utc": 1724027299.0,
      "score": 1
    },
    {
      "id": "liszadj",
      "body": "I’m on a very low daily prescription of Citalopram. I have an extremely low dose prescription of Clonazepam that I use in case of an emergency (panic attack I can’t manage).\n\nAccompanied with therapy, Clonazepam is a true miracle of science. Mostly due to therapy, I’ve come a long way and have only used a half dose of Clonazepam once or twice in the last year. \n\nIt’s a tool to use and it works really well. I hope you can pursue therapy at some point, too.",
      "created_utc": 1724029383.0,
      "score": 1
    },
    {
      "id": "lit0hz9",
      "body": "Have you and your doctor ever talked about baclofen? It's generally used as an additive to pain management regimens, it's a muscle relaxer. I was put on it after getting sober from benzos(I was an addict, your use is good) for pain and honestly found it more useful for anxiety. It lacks the withdrawal syndrome and abuse potential that benzos have so I wouldn't assume it would be a huge ask if you're already on benzos. To be clear I am suggesting this as something you could take once or twice everyday for general anxiety, not as a replacement for Clonazepam PRN.\n\nI told my PCP it was better for anxiety than pain and he referred me to a psychiatrist who continued my script.",
      "created_utc": 1724029871.0,
      "score": 1
    },
    {
      "id": "lit1yb6",
      "body": "It sounds ridiculous but Ashagawanda KSM-66 has helped me a lot. Tho if you take take too much of it, it will make you numb and kind of depressed. But when I take the right amount plus exercise it does really take the edge off.",
      "created_utc": 1724030458.0,
      "score": 1
    },
    {
      "id": "lit4bxp",
      "body": "Nausea? Interesting. I take gravol ginger for any nausea and it works fine for me plus eating peppermints (or gum) \n\nWhile people talk about being addicted , if you take it as prescribed, when needed, however your doctor writes it out you will be fine \n\nProblems start when people are taking high doses for days, adding up to weeks or even months. Rebound anxiety happens making the original anxiety seem tenfold. Seizures etc again that’s if you’re taking wild amounts for long periods of time.",
      "created_utc": 1724031418.0,
      "score": 1
    },
    {
      "id": "lit7pec",
      "body": "I have taken them for 1 year and nevera felt addicted.  I decided to stop because i gained a los of weight and lowered my methabolizm.  My psychiatrist denied that effect,  it is just my appraisal.  \n\nI kept thinking, how i have lived my life without this tranquility for all my life (40 years). I think they are perfect, except for the weight issue",
      "created_utc": 1724032777.0,
      "score": 1
    },
    {
      "id": "litan7p",
      "body": "Did everybody else think you were acting normal? One of the things about benzos is they make you think that you're normal but other people see you slurring your words and not always making sense. I'm not saying that's the case here, if you were around somebody that you trust ask them how they thought you were acting.",
      "created_utc": 1724033979.0,
      "score": 1
    },
    {
      "id": "litcm9n",
      "body": "Yep I know how it feels. I have ocd and when I’m in a spiral it’s the only drug that stops it in its track. It’s amazing, but I’m only given 10 every 2 years…oh well guess I just have to suffer.",
      "created_utc": 1724034797.0,
      "score": 1
    },
    {
      "id": "lite0zb",
      "body": "I don’t know anything about your situation or history, but I would like to recommend yoga, mindfulness, and r/somaticexperiencing. I know these kinds of meditative practices are easy to write off, and can be very challenging when you are feeling so sick and anxious all the time. But for me personally even just getting brief flashes of the calm and relaxation was so worth it. And with practice those flashes get longer and stronger. Some day hopefully I will be able to integrate it as a regular part of a normal life 🙃",
      "created_utc": 1724035393.0,
      "score": 1
    },
    {
      "id": "litjr2q",
      "body": "I suffer with a similar issue except my physical symptom is a severe tightening of the chest. I mean it literally feels like I’m being strangled from the inside. Like my bones are collapsing in and my internal organs are trying to hold them up. Sometimes it happens bc of anxiety, other times it’s random. Though I understand it’s not quite the same thing as you’re going through. I’d still take that over severe nausea bc at least in my case I’m able to hide that feeling and try to go about my day as best I can. Nausea would be debilitating. I feel for you man. I really wish the physical effects of anxiety were talked about more, and I do feel like that’s beginning to happen. \n\nUnfortunately I don’t really have any advice to offer as I’m in the same boat as you. Clonazepam is like a goddamn miracle pill. If I could take 0.5 mg of klonopin 1-3 times a day and never build a tolerance/get addicted, life would be fucking grand. But as it stands, benzo’s are addictive. So all I can offer is that you’re not alone, and I truly think there’s hope for us. Science is a fickle mistress and psychology is truly a field that is in its infancy. A breakthrough could be made tomorrow that opens the door wide open for better treatment, whether that be a new anxiety medication or a therapy method or whatever else it could be. I personally also find solace in knowing that if I’m experiencing this, and others are also experiencing this, then someone else has probably experienced and overcome it before us. And if they can overcome it, so can we.\n\nETA: now that I think about it I have found some things that help a bit. Hydroxixyne for one. It’s an antihistamine medication used for panic attacks, it’s non-addictive and has worked really great for me! It’s nothing like a benzo but personally I often find it does at least get me back to a state where I’m not experiencing physical symptoms of my anxiety. So it might help your nausea! \n\nAlso I know it’s cliche and feels like a line but yoga really can help. It’s not all a bunch of hoopla, as much as my teenage self insisted it was (to spite my yogi mother.) Though the catch-22 with something like yoga is that you have to do it consistently in order to get that “mind-body connection” thing and it’s fucking HARD to build any habits like that when you’re living in survival mode due to severe anxiety. Which is why I don’t often do it despite suggesting it now 😭",
      "created_utc": 1724037918.0,
      "score": 1
    },
    {
      "id": "litylhx",
      "body": "Exact same situation here, long term antidepressant did the trick. Amitriptyline 25mg",
      "created_utc": 1724045727.0,
      "score": 1
    },
    {
      "id": "liu4vua",
      "body": "This is what makes them so unbelievably deadly. Everyone just wants to feel relaxed and normal.",
      "created_utc": 1724049625.0,
      "score": 1
    },
    {
      "id": "liu5i2b",
      "body": "I’ve never taken medication for my anxiety but I’m wondering now if at least trying it would help. I would like to be able to test it out and see if it worked even short term. I’m super scared of side effects though 😢",
      "created_utc": 1724050019.0,
      "score": 1
    },
    {
      "id": "liuq42o",
      "body": "I feel the same way. I’ve actually taken .25 mg everyday for a long time without needing to raise the dose! It’s always just made me feel normal. Like, it turns one specific nob down when it comes to overstimulation or endless stream of thoughts. \nIdk. It helps me a lot but if I ever get the chance to conquer my anxiety without a pill then I’ll try to ween myself off",
      "created_utc": 1724063565.0,
      "score": 1
    },
    {
      "id": "liut8o3",
      "body": "Just about any benzo will treat nausea.. you have to weigh up benefit vs risk. I'm a long term benzo 'addict'.. don't get me wrong, I'm addicted but don't like the term because of the connotations. I take it for social anxiety, I'm one of those rare people who has a ceiling dose and I never go above it. But still I advise caution.. I source mine on the black market, they come from a chemist but dealing with pill heads - no judgement, I'm no better - it can be an absolute nightmare. Like dealing with someone who has sunk a bottle of whiskey and who will have zero memory of me coming around. \nNow I never, ever take a dose for that effect as I simply don't like it. But maybe I'm lucky and I am still dependent on a highly addictive substance. You should never mess with illicit benzos unless you have the self control to keep 6 - 12 months supply to detox. Very, very few people are capable of this.\nObviously not a worry if you get them prescribed, but you may still get a taste for them. It's almost impossible to predict. If you can stick to the smallest possible dosage once a day then they can be very helpful. If being the unanswerable question..\nBenzos haven't ruined my life, but they have that of many people I deal with. If it's only for anti nausea I'd consider an antihistamine first.",
      "created_utc": 1724065340.0,
      "score": 1
    },
    {
      "id": "livevws",
      "body": "I find that Mary Jane has a pretty similar effect with less side effects and it’s better for you. Perfectly legal, it’s called delta 9. Delta 8 is sort of like the “diet” or “lite” version. But the key is you have to microdose it. Like if you have a pack of gummies, cut each one in half. You should just BARELY feel high. For me that’s like 2-3mg. Just remember that everyone has different bodies and so you are going to have to experiment with it in a safe space when you have no obligations- like on the weekend or something. You are predisposed to an anxious reaction-Do not take more than one “bite” a day: If you take a gummy and don’t feel anything, try again tomorrow. Start small- work your way up. Stay responsible with it. \n\nOh, and we are a bit like plants. So when you’re feeling uncomfortable make sure to get your water and sunshine. You don’t have to talk to anybody. Just sit on your balcony, porch or in the backyard with a book or something \n\nPlease please remember that Klonapin is extremely addictive and not for everyday use. That is your 911 break in case of emergency only.\n\nSigned- someone with zero insurance so has to manage this bullshit without my meds. Meds are the best, but, yknow. It is what it is.",
      "created_utc": 1724074800.0,
      "score": 1
    },
    {
      "id": "liwhs5f",
      "body": "Kratom worked great for me so far! Worked better than Lexapro in my experience.",
      "created_utc": 1724087611.0,
      "score": 1
    },
    {
      "id": "liyaskc",
      "body": "Yeah it fucking sucks but you don’t want to get hooked on those. Try massage therapy and exercise. Acupuncture can help with the nausea as well. 😔",
      "created_utc": 1724108457.0,
      "score": 1
    },
    {
      "id": "liz8ibz",
      "body": "I take l-theanine and it really helps me with anxiety and rage if I’m getting it 😂 but I usually take it everyday at night, with my other supplements and my life is better since I incorporated it. I take 200mg. I’ve taken 400mg, more than that does make me drowsy.\n\nAnd if I have a really bad crisis I take hydroxicine, either 2.5mg or 5mg, some people might take a lot more but my metabolism is really fast and that is what my psychiatrist recommended",
      "created_utc": 1724120610.0,
      "score": 1
    },
    {
      "id": "lizibxg",
      "body": "Benzos will help calm your nervous system so you can come out of fight or flight long enough to do the work on yourself that you need to do. I would suggest that you try CBT therapy while on your medications and see where that takes you. ",
      "created_utc": 1724124480.0,
      "score": 1
    },
    {
      "id": "lizm2gu",
      "body": "Have you tried the carnivore diet? It made me get colds more often (I think I needed to take a vitamin D supplement), but it wiped out my anxiety and I felt pure bliss in waves throughout my 3 months on it. Worth a try, but it'll take at least a week or two for the benefits to kick in (as anxiety can be triggered by food intolerances, and it can take a while for those foods to get out of your system, especially if you've eaten them on a regular basis - such as gluten. Gluten can be a huge trigger for anxiety, for instance). \n\n\nI've heard many people say it helped their anxiety - even if it isn't the meat-only thing causing the lack of anxiety, it could be used as an elimination diet in which you slowly reintroduce foods and see what your anxiety triggers are so you can stop eating them in the future. If it were me, I would do strict carnivore for a month, see how I feel, and if it helped, slowly reintroduce foods. \n\n\nJust a thought!",
      "created_utc": 1724126077.0,
      "score": 1
    },
    {
      "id": "ljer9ys",
      "body": "You may have already ruled this out, but if not I suggest possibly getting tested for acid reflux? I have had anxiety my whole life and i always thought it was the only cause of all of my stomach problems but after going to a doctor and getting put on a daily acid reducer its made a big difference for me. ",
      "created_utc": 1724347531.0,
      "score": 1
    },
    {
      "id": "ljf0mv1",
      "body": "I've had panic attacks and horrible anxiety since I was 10, and Klon is the only drug that's ever really made me feel close to what I imagine \"normal\" is. I've been taking it PRN for like 18 years, and I've had zero issues with getting dependent on it or needing to increase my dose--been on the same .25mg dose the whole time. I've found that it works best for my anticipatory anxiety + panic attacks. I'm at my very best when I combine that with daily Prozac, yoga, magnesium, and mindfulness exercises to stay grounded. \n\n\nIn the times I haven't had Klon but have had the terrible anxiety or panic, I turn to my senses. Taste (pop in a ginger or a super minty gum), touch (doing a body scan to see how the rest of my body feels, really focusing on my physical senses), and controlled breathing. Definitely not the same as taking a Klon, but I'm still alive so I guess it worked well enough. Miserably, but it worked 🤣♥️",
      "created_utc": 1724350374.0,
      "score": 1
    },
    {
      "id": "lotggas",
      "body": "Without it I'm lost.. and I've been Without prescription for 2 years now , am buying it from BM. Only problems is that they are not 100% reliable",
      "created_utc": 1727246484.0,
      "score": 1
    },
    {
      "id": "lqaa48r",
      "body": "I'm trying to get help now for same thing an a few other anxiety issues and I am currently seeing psychiatrist about my issue an my anxiety plays up that much I can't even speak to him properly an I don't seen to be getting anywhere as he thinks I'm drug seeking I assume, an clonazepam will help an does help ( I then can get on with life . It's so exhausting going through this at the moment it's making me worry more an more",
      "created_utc": 1728041903.0,
      "score": 1
    },
    {
      "id": "lryx2i0",
      "body": "I’ve taken mine everyday for 5 years and I’ve never built a tolerance",
      "created_utc": 1728954629.0,
      "score": 1
    },
    {
      "id": "ls9jmm3",
      "body": "I woke up everyday feeling nauseaous for quite a long time do to my anxiety and the technique that helped me was EFT tapping, try it",
      "created_utc": 1729113275.0,
      "score": 1
    },
    {
      "id": "lt0refj",
      "body": "Try Lee Holden Qi Gong I like his A.M. P.M. DVD routine, also have his Depression DVD. He also has free demos online [HoldenQiGong](https://www.holdenqigong.com/) \n\nImportant to remember that regular practice yields the best results. I bought DVD’s on Amazon, there are some on eBay as well. \n\nPeace be with you.",
      "created_utc": 1729525316.0,
      "score": 1
    },
    {
      "id": "lw3i67e",
      "body": "Brother, I’ve had the same thing for the last 6 years, daily nausea to the point of wanting to be in the ER, zofran helped for the first couple times, but not since. It gives me so much relief in itself though just knowing I already took one before leaving the house. I still haven’t found a solid solution and it’s ruined so many things for me, even just grocery shopping. I’m on klonopin now too, and completely agree with you. This is awful. I’ve never met anyone that had the same issue.",
      "created_utc": 1731081679.0,
      "score": 1
    },
    {
      "id": "lw6g5k1",
      "body": "What ssris are you taking ??",
      "created_utc": 1731114699.0,
      "score": 1
    },
    {
      "id": "lw8ejpo",
      "body": "How much did you take? No side effects next day?",
      "created_utc": 1731150631.0,
      "score": 1
    },
    {
      "id": "ly6ue2w",
      "body": "See your primary care physician now",
      "created_utc": 1732156859.0,
      "score": 1
    },
    {
      "id": "ly6ugzi",
      "body": "See your dr asap",
      "created_utc": 1732156888.0,
      "score": 1
    },
    {
      "id": "lynz75c",
      "body": "I personally feel “normal” as well when I take them. My anxiety/panic from PTSD and just probably genetics as well, unfortunately need my mind to be sedated. Which is exactly what a Clonazepam does, it’s sedates you. Which for us who suffers from serve anxiety/panic is good but if you gave it to a normal person with no anxiety they would be on the floor drooling or passed out I’m sure lol. I would not think it’s devastating? Everyone is different, some of us just need a calming medicine in our lives to survive 😅",
      "created_utc": 1732409027.0,
      "score": 1
    },
    {
      "id": "m0ix2ou",
      "body": "Same for me with social anxiety, when i take 2mg of Clonazepam before any presentations or social events i just feel normal and super relaxed and can talk with anyone about anything with no preblems at all. I find it very useful to take them before any job interview also.\n\nBut like with all drugs they should only be used when you need them, otherwise baam and now you can´t go a single day without them. The good thing about Clonazepam is the really long half life.",
      "created_utc": 1733399374.0,
      "score": 1
    },
    {
      "id": "m79jybw",
      "body": "i know this is an old post but same on EVERYTHING. down to THE AGE, even. (tho, I am a ~lady~ not male lol!) but i concur. i never knew the name for fear of throwing up til last year…. makes me feel not alone that ive seen other people have it, too. i came to your post bc i was searching clonazepam in reddit. i just took half of a 1mg for the first time and am freaking out bc *medication anxiety.* how ridiculous 😫\n\ni have been taking alprozolam on an as needed basis (1-2x per week) for the last 3 years and it has done wonders for me. just like how klonipin has done for you - all the same things for me with xanax. i just wanted something to last a bit longer than xanax does. \n\nhave you found anything else that you supplement? i fear that benzos are the only thing that will make us feel this free and rid the anxiety completely. i have tried sooooo many holistic approaches and nothing compares. i dont take ssris/snris so im just raw doggin’ life and it gets old. -__-",
      "created_utc": 1736946079.0,
      "score": 1
    },
    {
      "id": "mjixiuq",
      "body": "Is taking one clonazepan a week enough to cause cognitive side effects (forgetfulness, dementia, etc.)?",
      "created_utc": 1742842680.0,
      "score": 1
    },
    {
      "id": "mlp9wbk",
      "body": "Ondansetron works wonders for nausea",
      "created_utc": 1743948800.0,
      "score": 1
    },
    {
      "id": "mnzcfpv",
      "body": "It can be a blessing and a curse at the same time. The right benzo for you makes you feel normal and wipes all the anxiety away. \nI’ve tried every med under the sun for anxiety when I was 18 and so many cocktails of SSRIs, antipsychotics, SNRIs, other meds like Buspar, Propanolol and nothing worked that great and some made me feel worse.\n\nI am on Clonazepam and have been for 20 years. I have had no negative side effects from them other than I am dependent on them. In the 20 years I have been on the I tapered myself off 4 times and stayed off for about a year each time and decided they helped me so much that I chose to remain on them as they still work just as well and help me so much. That’s not the case for everyone but they help me so much and haven’t had no negative effects from them. I know they are addictive but to me weighing the pros and cons and I chose to stay on them. I know how to taper off if I ever need to as I’ve don’t it 4 times before",
      "created_utc": 1745093704.0,
      "score": 1
    },
    {
      "id": "ms7qc2q",
      "body": "benzos are genuinely a miracle drug, that’s why they’re so dangerous",
      "created_utc": 1747195122.0,
      "score": 1
    },
    {
      "id": "lio3vr2",
      "body": "Don’t take benzodiazepines!!\nI took them for 2 years and became dependent on them. In the end they made my anxiety worse. I had to go into detox.  It was awful!  \nIm 7 months benzo free and still not 💯",
      "created_utc": 1723954410.0,
      "score": 0
    },
    {
      "id": "linqnh5",
      "body": "I guess I can see that. I don't feel a urge to keep taking them, just an urge to feel normal",
      "created_utc": 1723948348.0,
      "score": 193
    },
    {
      "id": "liog4qy",
      "body": "Also the withdrawals can be a lot worse than heroin and opium withdrawal",
      "created_utc": 1723961105.0,
      "score": 36
    },
    {
      "id": "lipjxf6",
      "body": "[removed]",
      "created_utc": 1723985578.0,
      "score": 6
    },
    {
      "id": "linovpt",
      "body": "Oh man, I totally feel you on all points. I rarely take them but when I do they literally change my whole sense of reality",
      "created_utc": 1723947581.0,
      "score": 16
    },
    {
      "id": "lipfw0p",
      "body": "Me too. I take Ativan, my doctor gave me 30  1mg pills a month. I cut them in 1/4’s and take 1/4 at 3am and another 1/4 at 6am, I have bad morning anxiety. Have you be at work by 7am. Doctor said it’s ok if I take that daily since it’s a small amount. He said “I might be the type that needs it daily. It really helps with my morning anxiety",
      "created_utc": 1723983662.0,
      "score": 8
    },
    {
      "id": "lipxoj1",
      "body": "I get these kind of panic attacks with IBS flare ups as well! If I didn’t have Ativan I would have to go to the hospital. I’ve met other people who have found the same connection as well. You’re definitely not alone.",
      "created_utc": 1723991008.0,
      "score": 7
    },
    {
      "id": "linzc1k",
      "body": "Same. I always grab some when I’m in Mexico. Not addicted but just knowing and having them available thwarts like half the attacks.",
      "created_utc": 1723952255.0,
      "score": 14
    },
    {
      "id": "lipfpvu",
      "body": "How often do you take them and what do you have a prescription for? Do you take them like once a week, once a month etc? And how long have you been on them? I’m trying to take them just for emergencies or big events.",
      "created_utc": 1723983578.0,
      "score": 2
    },
    {
      "id": "mh1kvuf",
      "body": "If this has been a lifetime occurrence for you, as it's been for me, it may be due to excess glutamate in the brain. Benzodiazepines enhance the activity of the neurotransmitter gamma-aminobutyric acid (GABA) at the GABA receptors of the brain. Glutamate is responsible for \"exciting\" the brain, so to speak, whilst GABA relaxes the brain. Overactive glutamate receptors can lead to digestive problems, pain, anxiety, essential tremors, and even in some cases neurodegenerative disorders. I used to be so opposed to taking a benzo (Klonipin) long-term, but after years of being unmedicated and watching my life fall apart, I'm at peace with it now. SSRI/SNRI don't work, and that follows since they work off serotonin receptors and not GABA.",
      "created_utc": 1741623491.0,
      "score": 2
    },
    {
      "id": "lipy8m2",
      "body": "Omg sameee",
      "created_utc": 1723991212.0,
      "score": 1
    },
    {
      "id": "lithjsy",
      "body": "Gosh I so relate to you!",
      "created_utc": 1724036927.0,
      "score": 1
    },
    {
      "id": "lipl2u7",
      "body": "How often do you take the lorazapam and how many mg,do you take it everyday or as needed,how many days can you go without it,",
      "created_utc": 1723986092.0,
      "score": 1
    },
    {
      "id": "lip5yrm",
      "body": "This is the best non narcotic drug in the game, followed by gabapentin, followed by hydroxizene, which I take all 3 together.\n\nThat being said, I still take klonopin 3x a day.",
      "created_utc": 1723978173.0,
      "score": 25
    },
    {
      "id": "lip7gnk",
      "body": "Propranolol was life changing for me. Stopped almost all the physical symptoms of my anxiety over night!",
      "created_utc": 1723979090.0,
      "score": 18
    },
    {
      "id": "lip5hsq",
      "body": "I really want to try it!",
      "created_utc": 1723977871.0,
      "score": 5
    },
    {
      "id": "lir451y",
      "body": "I mean I don’t think it calms mental anxiety the way benzos do.",
      "created_utc": 1724005307.0,
      "score": 5
    },
    {
      "id": "lip78aj",
      "body": "Was going to suggest this - it usually has no side effects and can be taken regularly if needed.  Way milder but should address the same physical anxiety symptoms.  It's been a total game-changer for me!",
      "created_utc": 1723978953.0,
      "score": 2
    },
    {
      "id": "lisn9so",
      "body": "Wish beta-blockers didn't make me really faint.",
      "created_utc": 1724024682.0,
      "score": 1
    },
    {
      "id": "lisspz9",
      "body": "Does it have a different name it goes by?  Never heard of that.",
      "created_utc": 1724026802.0,
      "score": 1
    },
    {
      "id": "lja6h8z",
      "body": "I had it prescribed but my heart rate is already on thr limit of low side (60 bpm min) I wasn't sure I could take it as they can lower your heart rate",
      "created_utc": 1724277711.0,
      "score": 1
    },
    {
      "id": "linybk7",
      "body": "Heard. I’ve tried at minimum 15 different anxiety (non-benzo) meds to help my crippling anxiety. In addition to job changes, therapy, you name it.. No help (except benzos and therapy). \n\nThen what?",
      "created_utc": 1723951790.0,
      "score": 25
    },
    {
      "id": "linqu7m",
      "body": "Yes exactly! Very few get the daily dose because they are scared of us getting addicted, but they are okay with us suffering immensely forever?",
      "created_utc": 1723948430.0,
      "score": 31
    },
    {
      "id": "linp7ew",
      "body": "Yes exactly!!! I wish they had an extended  release form that they would push out more easily",
      "created_utc": 1723947720.0,
      "score": 6
    },
    {
      "id": "mc6p9j7",
      "body": "What dose do you take?",
      "created_utc": 1739283596.0,
      "score": 1
    },
    {
      "id": "lipf3qi",
      "body": "Hey thats an interesting post, can you tell me more in easy words about the freeze mode? From what I've understood in your post it's the mode to \"look/scan for the threat\"? My brain often goes into freeze so I'm looking for any solution I can",
      "created_utc": 1723983271.0,
      "score": 6
    },
    {
      "id": "lmi6pn6",
      "body": "meanwhile there’s me who legitimately thinks if I say something isn’t going to happen I’m jinxing myself, though logically I know it isn’t likely. I’m prescribed clonazepam and my anxiety is so bad that I’m anxious about taking them so I usually just suffer instead. sometimes they make me feel dizzy and then that makes me more anxious",
      "created_utc": 1726003925.0,
      "score": 1
    },
    {
      "id": "liq618x",
      "body": "Duddddde. Yes I got prescribed them as well and yes they work really well. But they also knocked me tf out and I woke up with the craziest dry mouth everrrr",
      "created_utc": 1723993943.0,
      "score": 2
    },
    {
      "id": "liop74q",
      "body": "I'm sure you take Imodium for the IBS. A 50+ year sufferer due to stress and anxiety I take 1 dose and it usually kicks in within 20 minutes.\n\nIf I have an important event I have to attend even if it's a fun event I get anticipatory anxiety. I'm a basketcase days before it but once I'm there I'm generally fine. I have to make sure I eat bland food for at least 3 or 4 days prior so my stomach has a less of a chance of bothering me. Used to have panic attacks 30-40 yrs ago but haven't had one in many years. Though I still expect them to happen. It's so fucked up.",
      "created_utc": 1723966867.0,
      "score": 6
    },
    {
      "id": "lintnuo",
      "body": "Oh wow! Thank you for all this advice! What antipsychotic are you on out of curiosity? I am on one as well but I forgot its name. You feel that the antipsychotic helps your anxiety or panic? And did you feel like it helped your nausea?\n\nBut yes I totally feel that dizzy/pass out vibe all day too. I keep losing weight too :/.\n\nYes, all the hugs 🤗",
      "created_utc": 1723949664.0,
      "score": 4
    },
    {
      "id": "lipo51c",
      "body": "Not the thread op but this comment was helpful and validating with my own struggles, thank you! Reading comments like these help you feel less alone in anxiety experience, it’s kind of comforting in itself knowing there are folks also going through it and the options that are out there to trial 😭 hope all is well and thank you for the wisdom!",
      "created_utc": 1723987287.0,
      "score": 3
    },
    {
      "id": "linu8fa",
      "body": "What brand Cbd or l theanine ?",
      "created_utc": 1723949920.0,
      "score": 1
    },
    {
      "id": "linrmvw",
      "body": "Sorry you are also dealing with this. I hope we can find something helpful soon",
      "created_utc": 1723948770.0,
      "score": 6
    },
    {
      "id": "lipo6s8",
      "body": "I have 1mg Ativan, cut them in 1/4’s, have bad morning anxiety and have to be at work by 7am, take 1/4-1/2 every morning",
      "created_utc": 1723987308.0,
      "score": 2
    },
    {
      "id": "lip4ts7",
      "body": "I really want to try one but my doctor is adamant that I shouldn't because of my autoimmune issues unfortunately",
      "created_utc": 1723977435.0,
      "score": 1
    },
    {
      "id": "linom0s",
      "body": "Thank you for sharing your journey <3 I wish you all the very best",
      "created_utc": 1723947465.0,
      "score": 3
    },
    {
      "id": "linr29a",
      "body": "Ayo same medication combo.",
      "created_utc": 1723948526.0,
      "score": 3
    },
    {
      "id": "lipofhn",
      "body": "I take .25mg every morning",
      "created_utc": 1723987412.0,
      "score": 3
    },
    {
      "id": "lirp7iw",
      "body": "🙏🙏🙏",
      "created_utc": 1724012385.0,
      "score": 1
    },
    {
      "id": "lintria",
      "body": "Thanks for the confirmation that I'm not alone in this, friend. Wishing you the very best.",
      "created_utc": 1723949708.0,
      "score": 7
    },
    {
      "id": "liuv6sg",
      "body": "Do you mind me asking what you take and how much? Or does it vary from day to day",
      "created_utc": 1724066373.0,
      "score": 1
    },
    {
      "id": "lipoowi",
      "body": "That’s right! I take Ativan small dose daily, I need to be at work by 7am and I have bad morning anxiety",
      "created_utc": 1723987523.0,
      "score": 4
    },
    {
      "id": "lip6z4s",
      "body": "Benzos are not good for you long term daily usage. Just too many negative risks like Alzheimer's, congnitivec function decline, and heart issues. That being said, if it's worth the risk to enjoy the time spent before these issues POSSIBLY arise, more power to you and I think you should do what is right for you",
      "created_utc": 1723978801.0,
      "score": 10
    },
    {
      "id": "lipnsuu",
      "body": "The issue with benzos is that for most people, they build up a tolerance very quickly therefore you need more to get the same effects overtime. They are very addictive as well. Another thing is that they are dangerous. If you have sudden withdrawal, they work similarly to alcohol on the CNS, and what happens is the withdrawal can be deadly, literally. That is why they are controlled substances here in the US. It sucks because there are people who can use them sparingly as needed, and have zero issues, But unfortunately, that is not as common as the former. I can’t even get ones from my doctor so I buy them from other people unfortunately because they’re so restricted.",
      "created_utc": 1723987140.0,
      "score": 5
    },
    {
      "id": "liq6wpf",
      "body": "I do indeed have a chronic illness. I have behcets and rheumatoid arthritis and possibly histimine intolerance or mast cell disease (waiting on tests)",
      "created_utc": 1723994244.0,
      "score": 2
    },
    {
      "id": "lip3xdl",
      "body": "That is my exact same fear!",
      "created_utc": 1723976841.0,
      "score": 2
    },
    {
      "id": "liqkxrl",
      "body": "In my experience, exercise actually made my anxiety worse. I would try to go for a brisk walk, run , or even lifting weights at home, and a couple minutes in I would get shaky, lightheaded, then boom panic attack. I wasn’t anxious about exercising or anything and I was super active in my younger years, basically an energizer bunny. If I had to describe it, it felt like an intense physiological response that was out of my control.\n\nIt wasn’t until I got on the right meds that exercise started helping, especially once I started taking my beta-blocker. After looking into polyvagal theory I think it makes sense. I think my nervous system was already so activated that physical exertion would push my body over the edge. My heart rate was already elevated at baseline, blood pressure was high, and my system was full of adrenaline by just getting through the day. Exercise was increasing all those things even more. It also wasn’t helping that the nausea was making me skip meals so my body had no energy.\n\nYour advice is fantastic and I’m not at all trying to say you are wrong, I hope you don’t take it that way! For me, the order I did things in made a massive difference. Getting medicated first while doing tons of therapy, then adding in exercise slowly and working on diet is what worked for me!",
      "created_utc": 1723998962.0,
      "score": 1
    },
    {
      "id": "lip5trh",
      "body": "Yeah that is the case with many doctors. I find that if I ask for these drugs, the doctors immediately shut down and say no but if I just explain my symptoms and panic attacks they will give them to me",
      "created_utc": 1723978085.0,
      "score": 3
    },
    {
      "id": "liq5cfp",
      "body": "Hmm. I'm not familiar with braking exercises, could you explain?",
      "created_utc": 1723993708.0,
      "score": 1
    },
    {
      "id": "liqcjl1",
      "body": "Also, re: nausea — I was on Zofran the entire time that I was taking Zoloft, a couple of years ago. I lost a lot of weight from being too nauseous to eat. When I switched from Zoloft to Remeron the nausea disappeared. The most common side effect of Remeron is actually weight gain, which I needed. I gained about 20 pounds during the first few months I was on it. Two years in, I’ve stayed around that same weight, with some fluctuations occasionally.",
      "created_utc": 1723996155.0,
      "score": 1
    },
    {
      "id": "lirpmfh",
      "body": "How long have you gone on a course like this (taking only for emergencies)? Weeks, years etc?",
      "created_utc": 1724012521.0,
      "score": 1
    },
    {
      "id": "liq6y17",
      "body": "That’s what I use, helps a lot",
      "created_utc": 1723994257.0,
      "score": 1
    },
    {
      "id": "lip3uah",
      "body": "I'm in the same boat. I get 30 and it lasts me the whole year",
      "created_utc": 1723976782.0,
      "score": 1
    },
    {
      "id": "lip4vtg",
      "body": "I know 😂 it must be nice",
      "created_utc": 1723977471.0,
      "score": 1
    },
    {
      "id": "lip5xtp",
      "body": "If taken as needed as a last resort, it isn't that big of a problem. It's the daily use prescription that you need to avoid",
      "created_utc": 1723978157.0,
      "score": 1
    },
    {
      "id": "liq6vkx",
      "body": "I use Lorazepam (Ativan)",
      "created_utc": 1723994234.0,
      "score": 1
    },
    {
      "id": "lip60uu",
      "body": "That's interesting. I wonder if you were deficient and then now have too much in your system",
      "created_utc": 1723978210.0,
      "score": 1
    },
    {
      "id": "lip71eq",
      "body": "Samesies. I love it /s",
      "created_utc": 1723978840.0,
      "score": 2
    },
    {
      "id": "liq5oiy",
      "body": "Glad it works for you so we'll too :)",
      "created_utc": 1723993821.0,
      "score": 2
    },
    {
      "id": "liq52fr",
      "body": "Exactly!!! Like just let me feel normal. I don't want anything crazy.\n..just normality",
      "created_utc": 1723993614.0,
      "score": 2
    },
    {
      "id": "liq4uat",
      "body": "Interesting. I was on that for my migraines a while ago. Maybe I'll talk to my doc about getting on it again",
      "created_utc": 1723993536.0,
      "score": 2
    },
    {
      "id": "liqnvuz",
      "body": "Yes I'm exactly the same. The consequences of being animals in a world of technology I suppose",
      "created_utc": 1723999941.0,
      "score": 2
    },
    {
      "id": "lisdn00",
      "body": "I'll be ok, but I appreciate your concern. I've been prescribed this for several years now...I just rarely take it. When I do take it, it's just such a calming feeling..but, even today I feel a bit hungover",
      "created_utc": 1724020981.0,
      "score": 2
    },
    {
      "id": "lio0odl",
      "body": "How do you feel when your adhd meds start to wear off? Do you have any rebound anxiety?",
      "created_utc": 1723952868.0,
      "score": 2
    },
    {
      "id": "lip3phz",
      "body": "Oh wow, I have ADHD and just got prescribed astarys. Hopefully it will help in the same way!",
      "created_utc": 1723976694.0,
      "score": 1
    },
    {
      "id": "liq6d8s",
      "body": "He's mostly right. Unless you are catatonic or deeply paranoid schizophrenic. But that's with daily usage, not for occasional usage",
      "created_utc": 1723994058.0,
      "score": 2
    },
    {
      "id": "liq3x8b",
      "body": "Wow, honestly that's inspiring a bit. I've been struggling with a lot of similar issues but I have ibs mixed and an autoimmune disease that blinded me a few years ago. It's been very hard to keep going.",
      "created_utc": 1723993219.0,
      "score": 2
    },
    {
      "id": "liqnl8t",
      "body": "Oh wow a mood stabilizer? I think I'm on one...or I am prescribed one that I have been scared to take. It's vraylar I think",
      "created_utc": 1723999843.0,
      "score": 2
    },
    {
      "id": "liqyn92",
      "body": "While this is a great question and I appreciate you asking it, I have genuinely always been a nervous wreck. My first panic attack was in 4th grade, but even before that I was always skiddish",
      "created_utc": 1724003470.0,
      "score": 1
    },
    {
      "id": "lir0buj",
      "body": "Maybe I'll just take one every time I leave the house. Which, admittedly is rare haha",
      "created_utc": 1724004031.0,
      "score": 1
    },
    {
      "id": "lira4jk",
      "body": "Yeah I often try not to take them unless it's a absolutely necessary. That being said, don't let guilt fill your mind.",
      "created_utc": 1724007290.0,
      "score": 2
    },
    {
      "id": "lisdd37",
      "body": "Man that's really powerful. It honestly frustrates me so much considering that my general state is not a common one. I wish I could be like those normal people haha",
      "created_utc": 1724020874.0,
      "score": 1
    },
    {
      "id": "lisgqcy",
      "body": "Interesting. I'm on effexor which took me from agoraphobic to where I am now, which is much much better, but still terrible in its own right. I'm so glad to hear it's helping!",
      "created_utc": 1724022178.0,
      "score": 1
    },
    {
      "id": "lisop43",
      "body": "Very interesting! I have a pretty sensitive stomach\n I'm worried because ginger is so potent! Haha",
      "created_utc": 1724025240.0,
      "score": 1
    },
    {
      "id": "lisuhgt",
      "body": "Oh snap! I will look into it right now!",
      "created_utc": 1724027484.0,
      "score": 1
    },
    {
      "id": "lit10wf",
      "body": "Very very interesting!!! I shall look into it",
      "created_utc": 1724030082.0,
      "score": 1
    },
    {
      "id": "litaw1u",
      "body": "No I was my normal self, as per asking my wife. I'm glad you asked because I haven't considered that haha",
      "created_utc": 1724034081.0,
      "score": 2
    },
    {
      "id": "litep5m",
      "body": "Wow that's new to me, even as a lifetime meditation student. I shall look into it! I wish you the very best!",
      "created_utc": 1724035679.0,
      "score": 2
    },
    {
      "id": "liv6nij",
      "body": "I've been on all the meds. I am super sensitive to side effects. I would recommend a ssri to start. Side effects are typically mild and often go away after a few days.",
      "created_utc": 1724071626.0,
      "score": 2
    },
    {
      "id": "livfyvf",
      "body": "I'm terrified of gummies. I smoked before but the gummies freak me out because I've seen people totally lose their mind on them haha. Should I be getting a certain strain or low THC type?",
      "created_utc": 1724075194.0,
      "score": 1
    },
    {
      "id": "ljesadk",
      "body": "Wow really? Did you have heartburn a lot? I get it after certain foods but always after laying down",
      "created_utc": 1724347835.0,
      "score": 1
    },
    {
      "id": "ljf57vf",
      "body": "Oh wow we have a very similar timeline on when we started getting attacks. My first was in 4th grade and I fainted and then  had hundred more until the age of 16 when I was taken to a THERAPIST AFTER being placed in a psychiatric ward. I got my first ssri and they only happen with triggers now. I'm so sorry you've had to live in a body like mine which decides regularly that everyday events are life or death. Wish you the very best❤️",
      "created_utc": 1724351783.0,
      "score": 1
    },
    {
      "id": "lotgrc1",
      "body": "Oh man, that's brutal. Why aren't you able to get the script from a doc?",
      "created_utc": 1727246682.0,
      "score": 1
    },
    {
      "id": "lr052m9",
      "body": "Yeah it's so hard. You really can't ask for it or suggest that you want it in any way otherwise they think you're seeking. I'd definitely recommend finding a new psychiatrist and starting over with them. Be upfront about your panic attacks and how they impact your life, talk to them and even try other options first, and after building a report, perhaps they will prescribe it.",
      "created_utc": 1728423388.0,
      "score": 1
    },
    {
      "id": "lryx5hc",
      "body": "Same. Except I been on mine since 2012 haha",
      "created_utc": 1728954661.0,
      "score": 1
    },
    {
      "id": "lw6gc2o",
      "body": "I'm on an SNRI called effexor XR.",
      "created_utc": 1731114765.0,
      "score": 1
    },
    {
      "id": "lyo10of",
      "body": "Do you take them daily? But yeah, you're totally right. Im in the sam boat",
      "created_utc": 1732409713.0,
      "score": 1
    },
    {
      "id": "liod2p9",
      "body": "How did you end up getting off them? What kind of detox did you do? I heard the only way is to use the Ashton method. Detox is not long enough for this drug. Only slow decreases over time..  what was your experience?",
      "created_utc": 1723959277.0,
      "score": 3
    },
    {
      "id": "lip4nc3",
      "body": "To be clear I take them <3 times a month, not daily.",
      "created_utc": 1723977317.0,
      "score": 1
    },
    {
      "id": "lio4bwr",
      "body": "Every benzo addict will tell you it all started with just wanting relief from anxiety. It does work extremely well if you can take it as prescribed, however, it’s amazingly quick building a tolerance.\n\nI’m glad it helped, and pls be careful",
      "created_utc": 1723954634.0,
      "score": 307
    },
    {
      "id": "liobgiq",
      "body": "Careful with this. It doesn’t take much for your brain to link those two to mean the same thing. The only path to “normal” is “x”.",
      "created_utc": 1723958354.0,
      "score": 107
    },
    {
      "id": "liqak5j",
      "body": "I recently got prescribed them and wow, I get it.  It's great.  I'm just taking days off from it to stay away from any addiction.  But for gatherings or stressful days, it's perfect.",
      "created_utc": 1723995487.0,
      "score": 7
    },
    {
      "id": "lip9fk5",
      "body": "Same been taking for years and still same",
      "created_utc": 1723980240.0,
      "score": 5
    },
    {
      "id": "lirti0x",
      "body": "Just gonna let you know benzo withdrawal is worse then any other drug withdrawal on planet earth so please be careful like I would would rather withdraw from opiates a million times over before have to to go through benzo withdrawals",
      "created_utc": 1724013805.0,
      "score": 3
    },
    {
      "id": "lisxzj0",
      "body": "That is the addiction… you’re addicted to what you’re calling “normal.” It is not “normal” and it takes more and more to feel “normal.” You have to heal what’s actually causing your anxiety. \n\nIt’s like if you had a sprained ankle and took painkillers to walk on it. The painkillers make it feel like everything is fine, but underneath, the injury is still there and might even get worse if not properly treated. Similarly, benzos can make you feel like your anxiety is gone, but if you’re not also working on the root causes—through therapy, lifestyle changes, or other coping strategies—the anxiety will still be there, and be even harder to manage without the medication.",
      "created_utc": 1724028863.0,
      "score": 2
    },
    {
      "id": "lip9z45",
      "body": "Ask your doctor about Gabaphentin. Legit changed my daughter’s life with the nausea and dizziness.",
      "created_utc": 1723980553.0,
      "score": 4
    },
    {
      "id": "lirc4kw",
      "body": "My psychiatrist believes some people don’t have normal GABA levels and need this help.",
      "created_utc": 1724007969.0,
      "score": 1
    },
    {
      "id": "logoaz2",
      "body": "EXACTLY! I there is no “europhic feeling” from Clonazepam. Anyone with anxiety knows not to abuse or miss use benzo’s, they are something we literally have to have in order to live comfortably.",
      "created_utc": 1727056529.0,
      "score": 1
    },
    {
      "id": "liq2asa",
      "body": "If you take benzos daily, you'll develop a tolerance, then you won't feel normal.",
      "created_utc": 1723992656.0,
      "score": 1
    },
    {
      "id": "lipk4lo",
      "body": "And that’s how it ropes you in, even if you take as prescribed. These drugs should be available in single doses for emergency only. I cannot overstate this enough.",
      "created_utc": 1723985667.0,
      "score": -3
    },
    {
      "id": "liogo85",
      "body": "It depends on the person and if/how you taper. If you don't taper, you're in for a bad time. Taper too fast and it will be uncomfortable. If you taper slowly and use the Ashton manual as guidance, it should be a pretty smooth experience. I've gone cold turkey, fast tapered and slow tapered all on separate occasions and slow taper is a walk in the park compared to the rest lol.",
      "created_utc": 1723961439.0,
      "score": 26
    },
    {
      "id": "ljf4lg5",
      "body": "Not true for me at least. I was prescribed 4mg of Xanax daily and used clondine to get off them. Can't remember the dose of the clodidine. Remember everybody is different",
      "created_utc": 1724351590.0,
      "score": 1
    },
    {
      "id": "lipoumn",
      "body": "No I never woke up with piss pants from having a seizure from heroin withdrawal. I genuinely need benzos . ",
      "created_utc": 1723987591.0,
      "score": 1
    },
    {
      "id": "lir84bo",
      "body": "How much did you end up taking? And what were the neurological effects? \nI’ve been using my Ativan more after a breakup and it’s not good",
      "created_utc": 1724006622.0,
      "score": 1
    },
    {
      "id": "lipg83i",
      "body": "Ativan helps me daily, I take 1/4-1/2 of 1mg pill every morning. Need to be at work by 7am",
      "created_utc": 1723983826.0,
      "score": 5
    },
    {
      "id": "liu3jz1",
      "body": "[deleted]",
      "created_utc": 1724048778.0,
      "score": 2
    },
    {
      "id": "liqa5mw",
      "body": "At which dose bro? I take .25 or .50 as needed!",
      "created_utc": 1723995351.0,
      "score": 1
    },
    {
      "id": "lja5swz",
      "body": "Are ativan less \"risky\" than Xanax?",
      "created_utc": 1724277482.0,
      "score": 1
    },
    {
      "id": "lit7zfk",
      "body": "Same here! Ativan saves me a hospital trip. Maybe we can be friends and chat about it sometime.",
      "created_utc": 1724032888.0,
      "score": 3
    },
    {
      "id": "liofw6i",
      "body": "Is it OTC there or something?\n\nedit: pls don’t downvote me I was just genuinely curious",
      "created_utc": 1723960959.0,
      "score": 11
    },
    {
      "id": "lipg0pm",
      "body": "When you take the Ativan do you take 1mg or crack it in 1/2?",
      "created_utc": 1723983726.0,
      "score": 1
    },
    {
      "id": "lipdbg4",
      "body": "I mean, gabapentin can cause addiction and can make you high.",
      "created_utc": 1723982360.0,
      "score": 15
    },
    {
      "id": "liu94np",
      "body": "Hydroxyzine actually induces anxiety in me, don't like the way it makes me feel. Same with Benadryl as it's in the same drug class.",
      "created_utc": 1724052398.0,
      "score": 1
    },
    {
      "id": "lissrte",
      "body": "Damn I gotta try this how have I never heard of this once",
      "created_utc": 1724026821.0,
      "score": 1
    },
    {
      "id": "lipfcip",
      "body": "I would absolutely recommend beta blockers - so helpful for the somatic symptoms but non addictive. Was a game changer for me, I tell everyone with anxiety everywhere I go.",
      "created_utc": 1723983392.0,
      "score": 9
    },
    {
      "id": "lipfmp5",
      "body": "I would talk to your doctor about it. It really does work (for physical symptoms) and is in no way addictive. You have nothing to lose by trying it if your main symptoms are physical (for me this is mainly heart rate, tightness in chest and stomach etc)",
      "created_utc": 1723983533.0,
      "score": 2
    },
    {
      "id": "lipx7ef",
      "body": "I was skeptical of Propranolol until I had to stop taking it because I switched insurance.  At the  same time I started having the worst anxiety I’ve ever experienced and it was daily and my brain did not link these together. \n\nI ended up asking my doctor if I could try propranolol again along with stopping all of my ADHD medication because I wanted to be able to function and not just be a prick. Now I will forever praise it for those able to take it and it work for them because I think it honestly has saved my life.",
      "created_utc": 1723990834.0,
      "score": 1
    },
    {
      "id": "lir8pd0",
      "body": "Obviously, Because Benzodiazepines have a narcotic effect, which I stated - Propanalol doesn’t - so you don’t feel something nice, you just don’t feel anxiety to the levels inherent in people with chronic anxiety.\n\nNarcotics make you feel nice, but have a massive price in addiction.\n\nBenzodiazepine addiction can’t be overcome alone at home like heroin, crack and meth. The withdrawals can kill you (like alcohol). Addiction to Benzo’s is no joke.",
      "created_utc": 1724006817.0,
      "score": 1
    },
    {
      "id": "lio3im8",
      "body": "they know exactly what, they simply  don't care. you are to either a. Engage in criminal acts (that give serious prison time and felonies) just to purchase the same exact RX from black market or B. Suffer until you can't take it anymore. I know far too many people that just.. bit the bullet, all because their physician didn't want to refill or perhaps even speak with them about it. shit gets too much at some point, they know this. The American medical situation has become the most disgusting greed filled career field which, as we can see now, only attracts the exact people WHO SHOULDNT be anywhere near patients and those who genuinely SUFFER and yet is the most attractive field of choice simply for the fact that regardless of what specialty practice any M.D. decides to pursue always guarantees at least a base salary of *rich as fuck* (always more than $100,000 grand, starting, but skies the limit) it is genuinely killing more Americans than War or Famine ever could hope to... let alone a first world country, which is apparently what we are...",
      "created_utc": 1723954233.0,
      "score": 15
    },
    {
      "id": "liphniz",
      "body": "I take Lorazepam (Ativan) daily it helps me alot",
      "created_utc": 1723984521.0,
      "score": 1
    },
    {
      "id": "lio2wg6",
      "body": "Benzos are a nightmare - please do not go down this path. Taking them on a daily basis will downregulate your GABA receptors and cause serious brain changes. Eventually, the drug will turn on you and you’ll either have to raise your dosage or taper off them. As someone currently tapering off them, it’s not worth it. I wish I never touched a benzo in the first place. I wish someone would have warned me, so I’m warning you. \n\nIt’s not about addiction, it’s about physical dependence. I didn’t abuse them, I actually took less than my prescribed amount the entire time I was taking them. There’s a good reason many doctors are no longer prescribing them for daily use. r/benzorecovery - just a sample of the horror you can look forward to if you don’t believe me. Some people get screwed after only a few weeks of daily use. Not a gamble I would take.",
      "created_utc": 1723953935.0,
      "score": 54
    },
    {
      "id": "lirx2kf",
      "body": "Nobody should be taking benzos daily. NOBODY. They simply stop working used that way, there’s no way around that. And once that happens, the problem is no longer anxiety but serious addiction.",
      "created_utc": 1724014997.0,
      "score": 3
    },
    {
      "id": "lipgxnm",
      "body": "Your right! I got lucky and my doctor gave me 6 months, 30 pills in each of 1mg lorazepam (Ativan). I crack it and take it in 1/4’s every morning",
      "created_utc": 1723984176.0,
      "score": 2
    },
    {
      "id": "m8zc6f4",
      "body": "They are okay with you suffering because they don't understand what your type of anxiety feels like. If they were suffering with it, they would be using it for themselves.",
      "created_utc": 1737753398.0,
      "score": 1
    },
    {
      "id": "lipndb6",
      "body": "They have benzos with longer half lives that is sort of akin to extended release. Ask your doctor about it.",
      "created_utc": 1723986954.0,
      "score": 4
    },
    {
      "id": "mc6yge5",
      "body": "Just .5 - 1mg at that point. I no longer get them unfortunately!",
      "created_utc": 1739286564.0,
      "score": 2
    },
    {
      "id": "liqhmij",
      "body": "Haha yesss. My best sleep ever tho lmao I take them when I can't sleep 😅",
      "created_utc": 1723997853.0,
      "score": 1
    },
    {
      "id": "liqcvwt",
      "body": "I relate to you so much! It sucks so bad and it’s something I still struggle with. Imodium has been my best friend, I always have to have it on hand. When I have a stressful event coming up like travel or an interview I take it preemptively, because without it 10/10 times I will get diarrhea and it makes life so much worse, sorry for the TMI.",
      "created_utc": 1723996266.0,
      "score": 6
    },
    {
      "id": "lipnglh",
      "body": "What kind of bland food",
      "created_utc": 1723986993.0,
      "score": 1
    },
    {
      "id": "linynej",
      "body": "[removed]",
      "created_utc": 1723951942.0,
      "score": 11
    },
    {
      "id": "lipqn1b",
      "body": "Something that starts with. A Quetipine",
      "created_utc": 1723988320.0,
      "score": 1
    },
    {
      "id": "liqen36",
      "body": "I edited my comment but also wanted to make sure you saw it:\n\nI also forgot to mention Propranolol! I love it, it helps a TON with my physical anxiety symptoms. There’s immediate release versions you can take as needed, or extended release ones you can take every day. I was on the extended release for a long time and loved it, but it did make me pretty dizzy and lightheaded. I’m now on the immediate release as needed and it feels a lot better. Also, if you have asthma, be very careful with beta-blockers. They can cause your symptoms to be worse. I’m lucky and it doesn’t affect my lungs, but you really should be careful with it.",
      "created_utc": 1723996857.0,
      "score": 1
    },
    {
      "id": "lmi7ayd",
      "body": "Do you find that the clonazepam makes you feel dizzy? I struggle with this and it makes me not want to take them. Though I usually only take 1/4 of a pill so I’m unsure how much of the dizziness if still anxiety… I get anxious over taking the pill too",
      "created_utc": 1726004119.0,
      "score": 1
    },
    {
      "id": "liq5s7s",
      "body": "This makes me so happy 😊 Connecting with others really does help you feel less alone! I’ve been sick and tired of the usual “it’s all in your head just get over it” reactions I’ve faced in my life, as well as the toxic positivity that we aren’t supposed to feel sad and frustrated dealing with these symptoms. It really sucks, and acknowledging that is key I think, along with thinking outside the box and trying everything that might help even though it’s scary! Everybody and every body is so unique which I think is why anxiety is so frustrating. I really hope what I’ve shared helps at least one person. Anxiety is such a formidable beast, it has taken me over a decade of trial and error to get where I’m at and it’s still not perfect but I’m so much better than I was.\n\nI wish you peace and hope you find something that works great for you! If you ever want to chat, I’m always open for venting or whatever might be helpful 💜",
      "created_utc": 1723993856.0,
      "score": 5
    },
    {
      "id": "lio0f1q",
      "body": "Good question! I highly recommend getting them from a reputable source and avoiding Amazon when possible. It’s also great if the company has third party testing of efficacy and publish the results on their website!\n\nMagnesium Glycinate I get from my grocery store.\n\nThe brand of L-Theanine I use is the soft gels from Sports Research, I order it online since I can’t find it anywhere local.\n\nSince weed is legal in my state, I go to a local dispensary for my CBD. But reputable brands that do the testing mentioned above that I’ve personally tried and liked are Lazarus Naturals, WYLD CBD, Koi, and R&R. I find that “full-spectrum” CBD works best for me. It technically has THC in it, and you will possibly get flagged on a drug test if you take it, but it will not get you high at all. There’s just a teeny tiny amount of THC that helps the CBD be more effective.",
      "created_utc": 1723952751.0,
      "score": 7
    },
    {
      "id": "linrtxh",
      "body": "I really appreciate that reply! :)",
      "created_utc": 1723948855.0,
      "score": 3
    },
    {
      "id": "lirgv4o",
      "body": "Oh bummer. Sorry to hear that. Really hope you can find something that works for you!",
      "created_utc": 1724009588.0,
      "score": 1
    },
    {
      "id": "linroof",
      "body": "Look at us 🤞🏽👯‍♀️",
      "created_utc": 1723948792.0,
      "score": 2
    },
    {
      "id": "liqdosr",
      "body": "Yea small doses can be a life saver",
      "created_utc": 1723996535.0,
      "score": 2
    },
    {
      "id": "livmdz0",
      "body": "Don’t mind at all. I used to try just taking it as needed but that only increased my anxiety bc whether I should take it or not became a stressor, meanwhile my body was in constant flight or flight mode with panic/anxiety symptoms. Anyway my prescriber and therapist both supported me taking it regularly if it meant improved quality of life. I have been taking .5 mg 2x a day daily, morning and evening for a few years now.",
      "created_utc": 1724077459.0,
      "score": 1
    },
    {
      "id": "lj0ar6p",
      "body": "Yep. If I feel better taking them why would I stop? I apply the same principal to all medication. Years ago I felt better after changing medication and asked my doctor if I could stop it - she replied \"no - that means it's working and you need it\". Duh! \nI have no issue with taking medication my entire life - as long as I need and it helps me, it's the same as any other chronic illness ¯\\_(ツ)_/¯",
      "created_utc": 1724140017.0,
      "score": 1
    },
    {
      "id": "mr6mns7",
      "body": "False. People need to stop talking about shit they do not understand. ",
      "created_utc": 1746673511.0,
      "score": 1
    },
    {
      "id": "mr6mt61",
      "body": "This is factually incorrect and has been proven false repeatedly, over and over and over and over and over again, yet people still repeat it.\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC3321276/\n\nRead it. There is NO evidence of anxiolytic tolerance. In fact the opposite: substantial evidence exists that anxiolytic effects persist over time. ",
      "created_utc": 1746673572.0,
      "score": 1
    },
    {
      "id": "liq9ape",
      "body": "That makes a lot of sense now! Chronic urticaria has a lot of symptoms that are similar to MCAS, and both can cause too much histamine in the body (chronic urticaria causes too much histamine to be released by the skin). I originally thought I had MCAS but my doctor said it was chronic urticaria. Benzos are known to help with histamine issues, so that could be why you feel better when you take one. Your symptoms might not be due to anxiety, but due to your chronic illnesses. Have you tried xolair? I think that treatment for your chronic conditions can help with the issues that you are experiencing.",
      "created_utc": 1723995056.0,
      "score": 2
    },
    {
      "id": "lip76l3",
      "body": "Trust me, they need to stay a very occasionnal silver bullet.\n\nIf you take them daily, you'll build tolerance, and your anxious mind will learn to trigger you no matter what.",
      "created_utc": 1723978925.0,
      "score": 2
    },
    {
      "id": "lisg7m5",
      "body": "It didn't sound like you were ready to exercise if you had no food and nutrients in you. I don't take this as negative at all. There's no one size fits all solution unfortunately but I do feel like once the body is ready for it, exercise is paramount. If your body is already strained, you're right that exercise isn't going to help. Last thing you want to do is overwork your heart. \n\nYou have to try others possible solutions like magnesium as I said. That supplement helps calm down our CNS (central nervous systems). Sounds like the beta blocker helps but I've really started viewing medicine as a means to an end. A temporary fix while you search and work on root cause. Therapy is something I didn't mention, but that's also a great way to figure things out if that makes sense. \n\nOur bodies go into a state of fight or flight as you know and your body might perceive danger and our heart rates go up. The heart is basically working as if you were exercising but you're not. Getting blood work done and seeing if you're deficient in anything is also important. Hope you're having a great day and it sounds like you're on the mend. My initial comment was just some suggestions but not an actual routine because that varies from person to person.",
      "created_utc": 1724021979.0,
      "score": 1
    },
    {
      "id": "liq29kn",
      "body": "This is usually something I mention after taking about everything and discussing solutions. Unfortunately one time I was actually in with the doctor and started having one - this was like 2 days after I caught my husband with another woman. A friend of mine recommended him. He completely belittled me and said the worst things to me, and even made it personal about my marriage. All around traumatic experience.",
      "created_utc": 1723992645.0,
      "score": 1
    },
    {
      "id": "liq8gis",
      "body": "Oh no! I meant “breathing exercise”. Autocorrect must have changed it. Going to assume you’ve heard of these though. A lot of people don’t give breathing enough of a shot because it doesn’t work immediately. It works immediately if you’ve practiced enough though. \n\nAlso, there’s a big difference between chest breathing and stomach breathing. Chest breathing can actually make things worse, you have to learn stomach breathing. Different breathing methods trigger different nervous system responses. When someone is doing something stressful, or in an emergency, your body will kick in chest breathing. Shallow faster breaths. This is a sympathetic nervous system response, and what typically happens with anxiety. \n\nStomach breathing can make this response flip around to the parasympathetic system, which is the system your body uses for relaxation. \n\nA lot of people also dismiss breathing because a lot of people pushing breathing are spiritual types. I’m not, and I dismissed it, until I watched these 2 videos that were sent by my therapist. It made a lot of sense to me after as it’s approached scientifically. \n\nhttps://youtu.be/q06YIWCR2Js?si=Sh4CLwy3so_5NBje\n\nhttps://youtu.be/Q_fFattg8N0?si=TIaWVbP8pipAlZMD\n\nI also very much believe that people dismiss a lot of things that work because they’re not desperate enough to be vulnerable. I know I did, and I see others do it all of the time. Unless you’re feeling rock bottom, there’s a good chance that your protective mind will say “fuck this” and not bother with it. \n\nBest of luck!",
      "created_utc": 1723994771.0,
      "score": 1
    },
    {
      "id": "litvw76",
      "body": "Since 2021.",
      "created_utc": 1724044127.0,
      "score": 2
    },
    {
      "id": "lip8jy3",
      "body": "I used to have terrible nausea and IBS for years.  \nEventually i outgrowed it, and now my anxiety shows itself mostly with vertigo and feelings of passing out.\n\nBoth sucks very much.",
      "created_utc": 1723979728.0,
      "score": 2
    },
    {
      "id": "litnguy",
      "body": "same here same. 🫥",
      "created_utc": 1724039665.0,
      "score": 1
    },
    {
      "id": "liqocfw",
      "body": "💯 I agree about the technology world. It’s a fast paced life that not all of us are meant for",
      "created_utc": 1724000094.0,
      "score": 1
    },
    {
      "id": "liq99jl",
      "body": "I’m glad to have inspired you. I’m beginning talk therapy soon too. This past few days have been really rough as I had an ibs flair. And I’m totally out of control with blood sugar. Four shots a day. My mom is 96 and I know I’ll not be around for that long.",
      "created_utc": 1723995045.0,
      "score": 1
    },
    {
      "id": "liqnuky",
      "body": "I highly recommend you try it, or another one. I currently take Citalopram for an SSRI and Lamotrigine for my mood stabilizer! It is the only combo that truly keeps my nausea anxiety at bay.",
      "created_utc": 1723999929.0,
      "score": 1
    },
    {
      "id": "lirsilu",
      "body": "I'd advice against it man, we have to fight our anxiety and overcome it instead of relying on pills to retain some sort of normalcy. I haven't taken any Clona since that day and it was like 3 weeks ago, we gotta be strong.",
      "created_utc": 1724013481.0,
      "score": 1
    },
    {
      "id": "lishqqp",
      "body": "i used to be on effexor too but had to switch due to the withdrawals! but for your nausea problem if you don’t want to try new meds, have u tried cbd?\nthat might help.",
      "created_utc": 1724022566.0,
      "score": 1
    },
    {
      "id": "lix4c9a",
      "body": "I’ve had luck with putting a dropper full in a glass of water. My stomach is very sensitive so I either feel nauseas after eating certain foods or it makes me use the bathroom….. when I drink this it takes the nausea and acid reflux away rather quickly.",
      "created_utc": 1724094795.0,
      "score": 1
    },
    {
      "id": "litfd53",
      "body": "Yeah I just discovered the sub a few weeks ago as well and in a lot of ways it perfectly describes and explains some of the thoughts/feelings I’ve been having. Definitely a rabbit hole worth diving into. The whole possible nausea/anxiety link could definitely be dissected by those somatic observations. I hope it helps you 🥰",
      "created_utc": 1724035964.0,
      "score": 1
    },
    {
      "id": "livmhte",
      "body": "That’s definitely why I’m saying one bite a day! Don’t play with it lol. If you get high enough you will think you are dying.  Understand going into this that weed is not going to kill you, say to yourself “I am not dying, I’m just really high”. It happens to everyone at least once. Just part of it, and personally I can laugh about it afterwords. I find its therapeutic effects worth it.\n\n I have basically worked it to a science where I know exactly how much to take for daily use vs eliminating a panic attack. I also know exactly how to safely increase the dose without blasting myself to outer space . Always do half a gummy at a time. Choose from one of the lower dose selections- websites will specify and sometimes even have recommendations for beginners. If you have a local shop near you, don’t be afraid to ask questions. Just don’t start at the gas station 😅\n\nThe gummies you order online don’t always specify a strain. I like using Cycling Frog because they are cheap and reputable and lab test their product safety and content regularly. \nAs a lightweight, I take half of one to microdose, or a whole one to enjoy recreationally or stop a panic attack. Be safe. Don’t drive with it. Don’t go to work with it or mix it with your obligations. Good for bad days at home, social use and general chores and light errands.",
      "created_utc": 1724077495.0,
      "score": 1
    },
    {
      "id": "ljg1taz",
      "body": "Get that sorted. You shouldn’t really ever have heartburn. Prescription acid reducers do wonders.",
      "created_utc": 1724362012.0,
      "score": 1
    },
    {
      "id": "lk04ddp",
      "body": "i did! but plenty of people dont have any heartburn and only stomach aches and find out they have acid reflux (thats how my mom was) but ya laying down and getting heartburn is a symptom of acid reflux",
      "created_utc": 1724675259.0,
      "score": 1
    },
    {
      "id": "loth926",
      "body": "As everywhere there are big traffic links to  benzos and from time to time the officials fo some random checks at patients home to see if there is no abuse\n If you're off by even one pill they cut you off in 2 months time. And from time to time i like to get like half a pill for maybe an extended night out. And as 3 pills were missing from my prescription they decided to cut it off. I don't know if am explaining this right as I'm more fluent in French in writing or talking than English.",
      "created_utc": 1727247001.0,
      "score": 1
    },
    {
      "id": "lothhnw",
      "body": "Anyway im good for today and tomorrow just got 3.5mg rn and ive kept 2.5 for tomorrow so am gonna relax and chill.. this feeling of being normal got so much value to me that i don't even waste time working full time. I do some part-time and tries to enjoy and heal myself (that's the priority)",
      "created_utc": 1727247154.0,
      "score": 1
    },
    {
      "id": "lsdq8pq",
      "body": "Ohhhhh okay 😂 that makes sense then",
      "created_utc": 1729180648.0,
      "score": 1
    },
    {
      "id": "lyo1wlf",
      "body": "NOPE! I only take as needed. Only on days my anxiety/panic gets extremely bad. Which is maybe like 1 week out the month or maybe half the month, like 15 days all together here and there, not 15 days straight. Thats like the worst possible amount tops I take. I only tell the doctor I take them every day to get the 30 count every month, I would rather have more then I need then not enough! As others have stated in the comments if you take it every day thought it will slowly start to loose its “feel good” effect due to your bodies tolerance build up. Also Benzos can be addicting to some people. I personally never have the problem, even when I was on Percocets for a month for a broken bone I didn’t have any physical or mental addiction to them after they were gone. BUT everyone is different. Either way I would definitely only take as needed.",
      "created_utc": 1732410055.0,
      "score": 1
    },
    {
      "id": "liosd5s",
      "body": "Is it worth taking if it builds a tolerance so quickly? What's the point in taking it anymore once the tolerance builds?",
      "created_utc": 1723969001.0,
      "score": 49
    },
    {
      "id": "lipk5yk",
      "body": "I took it as prescribed and it still ruined my life",
      "created_utc": 1723985684.0,
      "score": 11
    },
    {
      "id": "liq3agf",
      "body": "I don't think so. The people I've known to abuse benzos were trying to get messed up, not normal. When you actually have anxiety and take a benzo, there's really not much desire to abuse. I have a physical dependence on them, but I'm not an addict. I have to remind myself to take them, not because I want to, but because I've had a seizure from going cold turkey off of them.",
      "created_utc": 1723993001.0,
      "score": 15
    },
    {
      "id": "liu8z2n",
      "body": "Yup ex benzo addict here, doctors put me on them when I was 16 and it took me 11 years to get myself in a good enough place mentally to wean myself off of them. They did work amazing for panic attacks and anxiety but I couldn't function without them so I ended up addicted to them. That was a tough one to kick especially since I still have anxiety problems.",
      "created_utc": 1724052295.0,
      "score": 3
    },
    {
      "id": "moyt696",
      "body": "Thats the way to do it! I find that a 3 day reset (no benzos) is perfect for preventing any addiction. \n\nI took clonazepam 11 days in a row once and I must say that I felt horribly depressed and had heightened anxiety for 3 days after that when I did a reset...",
      "created_utc": 1745587628.0,
      "score": 2
    },
    {
      "id": "lisykm0",
      "body": "I appreciate your dedication and you have made your point. I will be extremely careful. Thank you",
      "created_utc": 1724029097.0,
      "score": 2
    },
    {
      "id": "liq6hpi",
      "body": "Oh snap really? I have some for my migraines that I haven't tried yet! Perhaps I'll give it a go!",
      "created_utc": 1723994102.0,
      "score": 1
    },
    {
      "id": "lit9lbv",
      "body": "One of the first things I was prescribed out of 20-25 things to *not* give me the only thing that actually works lol. Sucks when the only thing that helps is the one thing doctors won’t give you",
      "created_utc": 1724033543.0,
      "score": 1
    },
    {
      "id": "logom43",
      "body": "And Clonazepam has such o long self life that you really don’t need to increase the dose that often. I’ve been on it at least over 25 years and this is the second time of increasing the dose.",
      "created_utc": 1727056654.0,
      "score": 1
    },
    {
      "id": "liq5i73",
      "body": "Yeah definitely. I'll be wary. But I've been careful. I only take them 1/3 times a month and I take half of my 1mg",
      "created_utc": 1723993762.0,
      "score": 1
    },
    {
      "id": "liok621",
      "body": "I have unintentionally gone cold turkey and never had any issues. 😬Every practitioner cringes when I have to tell them that. Never experienced a single withdrawal symptom either. I acknowledge that I am SUPER lucky in this aspect but my drug tolerances are almost always high. So benzos are rough and I need to reset my tolerance but my anxiety is dependent on a rescue med in addition to my SSRI. If anybody has ideas, please send them on over.",
      "created_utc": 1723963633.0,
      "score": 10
    },
    {
      "id": "liojnre",
      "body": "That's why I wrote can be and not is.",
      "created_utc": 1723963319.0,
      "score": 11
    },
    {
      "id": "lipkbxl",
      "body": "I tapered over about 5 months and it was still a horrific experience.",
      "created_utc": 1723985759.0,
      "score": 3
    },
    {
      "id": "lioo8ly",
      "body": "How long is the slow tapering process? I'm on klonopin and Celexa.",
      "created_utc": 1723966223.0,
      "score": 1
    },
    {
      "id": "lipps4r",
      "body": "Benzodiazepines are known to cause seizures If you stop taking it at a high dose. Everyone is different but for those who get dependant and go through withdrawal usually agree benzodiazepines can be on a different level.\nSome people need them I'm not arguing it's a bad medication but it should be a last resort kind of thing",
      "created_utc": 1723987973.0,
      "score": 6
    },
    {
      "id": "lipln8x",
      "body": "How long you been on it,any side effects,how many mg you take a day,any brain fog,or other side effects from it,I take 0.25mg or 0.5,mg every other day or 3 days,but don't think it's helping that much",
      "created_utc": 1723986333.0,
      "score": 2
    },
    {
      "id": "liplnky",
      "body": "How long you been on it,any side effects,how many mg you take a day,any brain fog,or other side effects from it,I take 0.25mg or 0.5,mg every other day or 3 days,but don't think it's helping that much",
      "created_utc": 1723986333.0,
      "score": 1
    },
    {
      "id": "liplqdz",
      "body": "How long you been on it,any side effects,how many mg you take a day,any brain fog,or other side effects from it,I take 0.25mg or 0.5,mg every other day or 3 days,but don't think it's helping that much",
      "created_utc": 1723986362.0,
      "score": 1
    },
    {
      "id": "liutvyl",
      "body": "Do you also take Ativan? How many mgs a day do you take? Some days it’s 1/4 of a 1mg pill some days it’s a little more if my anxiety gets really bad. But I take that 1/4 of pill every morning, because my body is so jittery inside upon waking. Had my cortisol checked, the endocrinologist said my numbers looked normal",
      "created_utc": 1724065692.0,
      "score": 1
    },
    {
      "id": "lirbr11",
      "body": ".25-.50 every morning",
      "created_utc": 1724007840.0,
      "score": 1
    },
    {
      "id": "ljaern3",
      "body": "I didn’t know, maybe google it. I think Csnax is more habit forming",
      "created_utc": 1724280586.0,
      "score": 1
    },
    {
      "id": "liwaqyv",
      "body": "That sounds good 🩵",
      "created_utc": 1724085354.0,
      "score": 1
    },
    {
      "id": "liogw0u",
      "body": "Kinda. Some pharmacies will sell it to you even though you need a prescription. That's the best part about Mexican pharmacies, you can get anything. I got a factory sealed bottle of 90, 2mg alprazolam bars. It did cost me like $400CAD though lol",
      "created_utc": 1723961573.0,
      "score": 12
    },
    {
      "id": "lja666a",
      "body": "Please don't by OTC in Mexico as those aren't 100% safe. I always go see a doctor (super cheap like 60$ for an appointment) and get a s ript for what I need.",
      "created_utc": 1724277606.0,
      "score": 3
    },
    {
      "id": "liphvlf",
      "body": "You’re not wrong. But that’s also more of a dosage thing though. I take 600 mg gabapentin 3x a day and do not get high. \n\nSomewhat like saying the propranolol is addictive because your blood pressure will rise without it. \n\nIt’s give and take. All medicines have pros and cons.",
      "created_utc": 1723984629.0,
      "score": 4
    },
    {
      "id": "lipo9iw",
      "body": "*but* you should be careful with beta blockers if you have asthma as one of the most common side effects is a persistent dry cough that can exacerbate asthma symptoms. and non-selective beta blockers such as propranolol and labetol should not be used *at all* you have asthma. they can tighten airways and cause severe bronchospasms while also significantly decreasing the effects of beta agonists like albuterol. so if you do have an asthma attack, the effectiveness of your rescue medication will be severely decreased.\n\nfun fact: antihistamines can actually work well for anxiety too. hydroxyzine is the most commonly used, but even plain old benadryl can reduce acute symptoms of anxiety.",
      "created_utc": 1723987341.0,
      "score": 13
    },
    {
      "id": "liq645v",
      "body": "Will do :) thank you",
      "created_utc": 1723993971.0,
      "score": 1
    },
    {
      "id": "litb3pp",
      "body": "Propranolol is not \"addictive\" but it does cause physical symptoms when you stop taking it and you should not stop taking it cold turkey, your body does become dependent on and they can affect your blood pressure and other things.",
      "created_utc": 1724034169.0,
      "score": 1
    },
    {
      "id": "lipbu1s",
      "body": "[deleted]",
      "created_utc": 1723981578.0,
      "score": 4
    },
    {
      "id": "liogl7c",
      "body": "been taking the gamble for years and been fine. same dose for 2 years. just one person here. but i'm saying it's possible to be ok, in spite of everything else. i don't mean to downplay anyone struggling, but it saved my life.",
      "created_utc": 1723961386.0,
      "score": 32
    },
    {
      "id": "lirnubd",
      "body": "Thoughts on taking them only for emergencies - 1-2x per month?",
      "created_utc": 1724011929.0,
      "score": 5
    },
    {
      "id": "lioh2rp",
      "body": "I was taking clonazepam for awhile. I didn’t think it was making much of a difference with my anxiety. My doctor and I agreed that I needed to taper off of it and switched me to something else. Her idea of tapering and my idea were very different and I stopped taking too much too soon. I ended up in the ER afraid of what was happening to me. My face was moving uncontrollably, I was twitching, I felt bugs crawling under my skin. At the ER they demanded I submit urine for a drug test. Thankfully my girlfriend helped me since I wouldn’t have been able to. I don’t know how one nurse figured it out, all the others thought I was having a bad trip or something. Anyway, the nurse who figured it out came and gave me a shot of something that was like pouring water slowly over my head. I felt a relief that started at the top of my head and went down to my feet. I could be normal now, control my body and expressions. I felt like me. I had to go back to tapering so it wouldn’t happen again, and do it so incredibly slowly it drove me nuts.\n\nBenzos were never meant for long term use. It was an off label prescription to go beyond I believe ten days. The drug companies knew the repercussions, but nobody reads the fine print. Avoid these if you can, they aren’t worth it.",
      "created_utc": 1723961688.0,
      "score": 15
    },
    {
      "id": "lipt5xb",
      "body": "There are plenty of people that use benzoes responsibly.",
      "created_utc": 1723989317.0,
      "score": 6
    },
    {
      "id": "lipcjwg",
      "body": "[deleted]",
      "created_utc": 1723981962.0,
      "score": 1
    },
    {
      "id": "mr6me2e",
      "body": "“They simply stop working used that way, there’s no way around that.”\n\nThis is plainly false and demonstrates someone who has not read the empirical literature. There is actually zero evidence of anxiolytic tolerance.\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC3321276/\n\nRepeatedly demonstrated.",
      "created_utc": 1746673403.0,
      "score": 1
    },
    {
      "id": "liq567k",
      "body": "Oh that would be amazing for road trips",
      "created_utc": 1723993650.0,
      "score": 1
    },
    {
      "id": "mcrvdzy",
      "body": "Thanks. How come you don’t get them anymore, did it become an issue?",
      "created_utc": 1739558572.0,
      "score": 1
    },
    {
      "id": "liqla9j",
      "body": "Yea I use it before an event as well. With IBS there's always TMI. Lol. Even when I tell my wife she says you don't have to describe it. I don't. I just tell her my stomach is acting up. She's so unsympathetic.",
      "created_utc": 1723999079.0,
      "score": 2
    },
    {
      "id": "liqlklh",
      "body": "Nothing fried.  No ice cream. No chocolate.  Lots of toast or bagels with cream cheese. A chicken sandwich. Nothing spicy.",
      "created_utc": 1723999177.0,
      "score": 1
    },
    {
      "id": "lip481n",
      "body": "Wow that is so awesome!! I really appreciate you sharing this with me. I'm so glad it's been helpful for you",
      "created_utc": 1723977037.0,
      "score": 4
    },
    {
      "id": "lipj0dj",
      "body": "What time of day should I take my magnesium glycinate?",
      "created_utc": 1723985158.0,
      "score": 2
    },
    {
      "id": "lmi7qej",
      "body": "I take 1/2 of 1mg and I weigh about 170 lbs. I sometimes feel a loopy sort of dizziness, yes, but it's not uncomfortable for me. If you feel dizziness from it, I'd make sure to check your blood pressure (you can buy cuffs really cheap). You could have abnormally low blood pressure, especially if you are on other meds that cause that",
      "created_utc": 1726004260.0,
      "score": 1
    },
    {
      "id": "m5tbwow",
      "body": "You are literally the only person I could find with the same symptoms as me! I always hold my middle to lower abdomen tight when I get anxious! It’s caused me to lose a ton of weight from not eating. I also struggle with sleep so recently I’ve been taking clonazepam 1/2 a 1 mg pill to aid in my sleep. I just don’t want to rely on them or have bad withdraws. I buy them from a know friend but I go to the doctors this fri. I’m definitely gonna tell them this info!",
      "created_utc": 1736220083.0,
      "score": 1
    },
    {
      "id": "liolmpm",
      "body": "I live in a legal state with a dispensary down the road. The website does nothing to really help differentiate what might be helpful for me so I don’t make use of it. I’d like to though. With Thc there are so many strains and every edible I’ve tried makes my anxiety skyrocket. I’m afraid to try anything new. Maybe I’ll check it out again and see if they have the CBD that you’ve recommended. Im ok with small amounts of THC, if it’s actually helpful!",
      "created_utc": 1723964541.0,
      "score": 3
    },
    {
      "id": "liuvc8p",
      "body": "I have 1mg a day tablets for Ativan, which do you take and how many mgs a day?",
      "created_utc": 1724066453.0,
      "score": 1
    },
    {
      "id": "liw8431",
      "body": "Yes!! Whether to take it or not is just making me more stressed! My doctor said “just take it if it helps you”, but I don’t know why I put in my head, you might get addicted.",
      "created_utc": 1724084511.0,
      "score": 2
    },
    {
      "id": "lj1sodu",
      "body": "Do you take a benzo daily? I take a small amount every morning, for anxiety",
      "created_utc": 1724165558.0,
      "score": 1
    },
    {
      "id": "mrb9o0k",
      "body": "Your source / link seems to actually confirm what I am saying, but a bit less dramatic and more hopeful",
      "created_utc": 1746738098.0,
      "score": 1
    },
    {
      "id": "liq49mw",
      "body": "Oh no! I'm so sorry to hear that :( that is absolutely atrocious of him. I assume you are looking for other doctors? Don't rule out nurses, they often know more. Always here if you need to vent!",
      "created_utc": 1723993337.0,
      "score": 2
    },
    {
      "id": "liq8xr3",
      "body": "Oh okay haha I was like damn I never heard of this braking thing. Yeah I've definitely tried breathing exercises before but not with such acuteness. I'll try out the stomach breathing method! Thank you",
      "created_utc": 1723994934.0,
      "score": 1
    },
    {
      "id": "liqowx3",
      "body": "Like, let me be a grazing ape in a forest again, plz haha",
      "created_utc": 1724000283.0,
      "score": 2
    },
    {
      "id": "liqnzgc",
      "body": "That's awesome! I'll try it out today honestly haha",
      "created_utc": 1723999974.0,
      "score": 1
    },
    {
      "id": "lishvlx",
      "body": "I've tried it in vape form. But it made me lightheaded. Should I try droplets or perhaps the gummies ?",
      "created_utc": 1724022617.0,
      "score": 1
    },
    {
      "id": "litfp34",
      "body": "Very interesting!!! I hope so too! Good night friend",
      "created_utc": 1724036109.0,
      "score": 2
    },
    {
      "id": "livvsai",
      "body": "Yeah I'm in Massachusetts so I have plenty of options haha. Also can't drive because I'm legally blind. Thank you for all the advice! I really appreciate it!",
      "created_utc": 1724080601.0,
      "score": 2
    },
    {
      "id": "lipfqlz",
      "body": ">Is it worth taking if it builds a tolerance so quickly? What's the point in taking it anymore once the tolerance builds?\n\nThe point is more to use it as a \"rescue med\" when, no matter what, you can't calm yourself down/ground yourself. \n\nEven just knowing \"if i cant calm myself down, i have this bottle of meds\" can be enough to keep yourself from panicing MORE about the panic attack.",
      "created_utc": 1723983589.0,
      "score": 136
    },
    {
      "id": "lipqzqh",
      "body": "I used it for years as an emergency medication, and never had issues with tolerance.\n\nIt helped me for years...then suddenly I couldn't get it prescribed anymore. Still trying to find an equal alternative.",
      "created_utc": 1723988460.0,
      "score": 27
    },
    {
      "id": "lipe6so",
      "body": "Take it when it makes a big difference - weddings, big parties. But dont drink alcohol",
      "created_utc": 1723982809.0,
      "score": 29
    },
    {
      "id": "liotfvz",
      "body": "Once the tolerance is built, it’s too late to be able to easily stop. It builds, you find ways of getting more, it builds again…vicious cycle",
      "created_utc": 1723969730.0,
      "score": 27
    },
    {
      "id": "liq4f75",
      "body": "Yes, because it is possible to start and stop. I have had a clonezepam rx for over a decade at this point. Most times, 15 tablets will last 3 to 6 months. Some times heave lasted one month. It is entirely possible to actually take these as needed, and not abuse them.",
      "created_utc": 1723993389.0,
      "score": 15
    },
    {
      "id": "livgodg",
      "body": "I’ve had Klonapin before. So has my dad. It ruined his life. Mine was ok. The difference is my dad took his on a daily basis to function as a human. That’s what his situation required. That means Klonapin was not a good option for him. I took mine only when I was straight up in a panic attack, which would maybe happen once a week. It was a good option for me for my panic disorder. I got therapy for my panic attacks and now I need meds to control my episodes maybe once every 3 months. Well, that doesn’t neccisarily warrant a prescription so generally I just have some D9. I generally am able to talk myself down. So the prescription isn’t really required anymore and I don’t have to worry about the addiction. I hated the side effects regardless.",
      "created_utc": 1724075450.0,
      "score": 1
    },
    {
      "id": "lswhwk7",
      "body": "its just supposed to be when you really need it. There are people who take benzos long term chronically, but they are under very strict regimes and dosing under a doctors care.",
      "created_utc": 1729457445.0,
      "score": 1
    },
    {
      "id": "m2xy1b9",
      "body": "The tolerance may build, you won't feel the buzz anymore. The anti anxiety effects continue working though.",
      "created_utc": 1734672548.0,
      "score": 1
    },
    {
      "id": "mcpr5sv",
      "body": "Cons and pros of every medication out there. Benzos have dangerous withdrawals if your body ever gets adjusted and you try to quit cold turkey it could be fatal. Your body will start to eventually crave the feeling because its so euphoric in the sense you just feel anxiety free. Id say its a good short term method to help with specifically panic attacks and not anxiety disorder. If you take it all the time for anxiety youll build a dependency, need more for the same effects and your anxiety will be 100x worse when you dont have it or try to quit. Then you have to worry about interactions such as drinking because thats a deadly combo and other medications probably wont interact well. Its really up to you though",
      "created_utc": 1739532734.0,
      "score": 1
    },
    {
      "id": "liq3bcm",
      "body": "Same. Are you off yet?",
      "created_utc": 1723993010.0,
      "score": 1
    },
    {
      "id": "lir3qbb",
      "body": "Exactly. There’s millions of people that use them responsibly.",
      "created_utc": 1724005170.0,
      "score": 6
    },
    {
      "id": "ljntc9y",
      "body": "What are you doing to help your anxiety after being off the benzos? What was the prices like to get off of them?",
      "created_utc": 1724475051.0,
      "score": 1
    },
    {
      "id": "liqbvbn",
      "body": "Could not get her to go to school cause every morning was throwing up and the psych prescribed the Gaba and it’s been amazing. She takes 1 per day but can take up to 3 if needed. Something about it calming the nervous system.",
      "created_utc": 1723995929.0,
      "score": 2
    },
    {
      "id": "liqmqd3",
      "body": "[removed]",
      "created_utc": 1723999562.0,
      "score": 1
    },
    {
      "id": "logs6uq",
      "body": "Wow really???? That's awesome. So you are on it daily? Or as needed",
      "created_utc": 1727058112.0,
      "score": 1
    },
    {
      "id": "lj09d6t",
      "body": "You only take them one to three times a month but in the post you made it seem like it was the first time. What the fuck dude are you just trying to entertain people so they will talk to you?",
      "created_utc": 1724139084.0,
      "score": 1
    },
    {
      "id": "lipavpg",
      "body": "I had the same thing. Took benzos for months and quit and never had withdrawals. I still told my psychiatrist I had an addiction and I did abuse benzos a few times by taking too much so I guess I did have one. I still miss the instant relief they brought though and kind of regret telling them. I hope it's for the best.",
      "created_utc": 1723981064.0,
      "score": 6
    },
    {
      "id": "liop7se",
      "body": "I've seen a few people write the same thing and heard of others being on monster doses for a long time and quitting cold turkey without issues while other people get moderate to severe withdrawals after a few weeks on doses that are small in comparison so we are just different",
      "created_utc": 1723966879.0,
      "score": 2
    },
    {
      "id": "litaira",
      "body": "I didn’t experience withdrawals the last time I went completely cold turkey because I took a long trip abroad and didn’t take them with me. I realized that my anxiety was mostly because of my environment. Once I got away, the anxiety stopped. I didn’t feel the need to take anything for months!\n\nThis is just me though. I’m not big into anything like cigarettes or alcohol so I can do without things unless the anxiety is so bad that it disrupts my life.",
      "created_utc": 1724033928.0,
      "score": 2
    },
    {
      "id": "liol5mp",
      "body": "Yeah I understood you. I just expanded on it a bit",
      "created_utc": 1723964246.0,
      "score": 11
    },
    {
      "id": "lipuki1",
      "body": "Happy Cake Day!",
      "created_utc": 1723989856.0,
      "score": 1
    },
    {
      "id": "liq4n7a",
      "body": "Sorry to hear that! Which benzo were you on? How long did you take it? What dosage? What benzo was used to taper with?",
      "created_utc": 1723993467.0,
      "score": 1
    },
    {
      "id": "lioybgc",
      "body": "[removed]",
      "created_utc": 1723973061.0,
      "score": 4
    },
    {
      "id": "liqii4s",
      "body": "What dose of clonazepam are you on?",
      "created_utc": 1723998147.0,
      "score": 1
    },
    {
      "id": "lqcf80u",
      "body": "Yeah I am prescribed 2mg extended release once a day and a instant release 0.5mg also once a day. I have panic disorder. I need it . I wouldn't advise anyone to get on this medicine unless you are like me and have horrible anxiety and panic attacks where you feel like your dying.",
      "created_utc": 1728068486.0,
      "score": 1
    },
    {
      "id": "lirbcei",
      "body": "I take it every morning, first I try .25 mg and if that doesn’t help, I take another .25 mg every day. I have no problems with it. It really helps a lot with my anxiety.",
      "created_utc": 1724007702.0,
      "score": 1
    },
    {
      "id": "liqw5z1",
      "body": "Just get it prescribed lol. You're living in Canada, I've never paid for Ativan here.",
      "created_utc": 1724002656.0,
      "score": 4
    },
    {
      "id": "lit7u4v",
      "body": "Mind sharing where? If you can remember? I only take .5 for emergencies but the doctor I was seeing who was the only person willing to prescribe it to me is not with my insurance anymore. Tragic.",
      "created_utc": 1724032830.0,
      "score": 2
    },
    {
      "id": "lipyonl",
      "body": "I'm not hating because I used to be on pregabalin which is pretty similar to gabapentin.\n\nThe high effects can usually be felt on the first days of treatment but the anxiolytic effects don't disappear.\n\nYour analogy isn't good at all because propranolol isn't abused, doesn't have any severe withdrawals, is not addictive mentally.\n\nI'm a recovering drug addict, have many drug addicts friends and I've seen how gabapentinoids can potentially destroy lifes. Many people od'd and died by mixing pregabalin/gabapentin with other cns depressant which isn't a case with propranolol.\n\nI'm not trying to demonize gabapentin but I just want to give people  objective information about drugs.",
      "created_utc": 1723991375.0,
      "score": 11
    },
    {
      "id": "lu9d9j9",
      "body": "[deleted]",
      "created_utc": 1730157161.0,
      "score": 1
    },
    {
      "id": "liqdjw3",
      "body": "Thank you for calling this out! In my experience a lot of my providers were not aware of the relationship between propranolol and asthma. Propranolol doesn’t cause asthma side effects for me or affect my inhaler when I need it, but I’m definitely a rare case.",
      "created_utc": 1723996490.0,
      "score": 3
    },
    {
      "id": "lipi5gp",
      "body": "Yes…. Ativan helps me, I crack my 1mg tablet in 1/4’s and take whatever I need throughout the day",
      "created_utc": 1723984758.0,
      "score": 1
    },
    {
      "id": "miryc7h",
      "body": "Have you gone off benzos before? Are you taking them daily? I have permanent damage from benzo withdrawal. It’s worse than hell. Best feeling drug on earth .. wish there were a safer alternative",
      "created_utc": 1742468814.0,
      "score": 1
    },
    {
      "id": "lirpuzs",
      "body": "That’s exactly how they were intended to be used. Acute panic attacks, flights, public speaking, medical procedures, etc - all fine. That is the only way doctors should be prescribing these drugs, I was just unfortunate to have a doctor that told me daily use was perfectly fine.",
      "created_utc": 1724012601.0,
      "score": 6
    },
    {
      "id": "liq4jxd",
      "body": "I’m sorry you were the victim of an irresponsible doctor. Mine told me to rapid taper as well, but I did my research and found a benzo wise doctor to taper me down slowly. I’m so sick of this taper, I want to be done with this poison. \n\nHow did you make out? Are your symptoms better now that you’re off?",
      "created_utc": 1723993435.0,
      "score": 1
    },
    {
      "id": "liq0ne1",
      "body": "It’s not about “responsibly.” I took less than my prescribed dose. There’s a black box warning on benzos because they aren’t meant for daily use and thankfully doctors are changing their tune on them. Benzos worked great for me until they didn’t. There are thousands of people out there just like me that are now suffering because we trusted our doctors.",
      "created_utc": 1723992076.0,
      "score": 0
    },
    {
      "id": "liq11cw",
      "body": "I was on 0.5mg of klonopin for 6-7 years and then raised the dosage to 1mg for about a year because I began to develop a tolerance eventually. Some people take decades to reach tolerance, some it happens much quicker. I switched to Valium to taper bc it’s less potent and easier to titrate down.",
      "created_utc": 1723992212.0,
      "score": 2
    },
    {
      "id": "mcsl7k1",
      "body": "Absolutely lol. I’ve had a lot of addiction issues",
      "created_utc": 1739566177.0,
      "score": 1
    },
    {
      "id": "liqnhx7",
      "body": "I’m so sorry to hear your spouse isn’t empathetic or even sympathetic. My husband is the same way, he always thinks I’m too sensitive, too dramatic, not tough enough. We did a big trip to Disney World with his extended family 6 months ago, and the whole week I was running to the bathrooms and super anxious. I hate being away from home and changing my routine (thanks autism lol), even when I’m having fun and doing something I wanted to do. The diet change and massive increase in exercise made my stomach such a mess.\n\nHe had the nerve to tell me that I made his vacation experience less enjoyable because of it, something that I cannot control. He was also angry with his aunt because she was having stomach issues as well due to a long recovery from food poisoning and spent too much time going to bathrooms. What an asshole.\n\nIt’s part of why we are currently separated and living apart. Funny how getting away from his toxicity, my stomach has actually been a bit better! Still not 100% though, it’s so frustrating!",
      "created_utc": 1723999812.0,
      "score": 2
    },
    {
      "id": "lipt9ws",
      "body": "I take it twice a day, one when I wake up and one when I’m getting ready for bed!",
      "created_utc": 1723989360.0,
      "score": 3
    },
    {
      "id": "lmi83d0",
      "body": "I take 1/4 or 1/2 of a .5 mg. I weigh about 110 and I do often have low blood pressure but don’t take other meds except zofran as needed",
      "created_utc": 1726004376.0,
      "score": 1
    },
    {
      "id": "m5wszl2",
      "body": "I’m so glad I could help in some way 😊 Doing body scans throughout the day, and even setting alarms/reminders on your phone to do it might help! It feels silly, but I have reminders that say “unclench your jaw and stomach.” 😂 As for the insomnia, I’m so sorry you are going through that. As a fellow sufferer I know how rough that can be on your body and mind. Might be worth asking your doctor about Trazodone or another medication like it instead of the Klonopin. I’m not a doctor, but benzodiazepines  can become less effective over time which sucks!",
      "created_utc": 1736274051.0,
      "score": 2
    },
    {
      "id": "lipro1m",
      "body": "[removed]",
      "created_utc": 1723988729.0,
      "score": 2
    },
    {
      "id": "livggmr",
      "body": "I was only talking .5mg 2X daily for a few months then down to .5 then 0",
      "created_utc": 1724075372.0,
      "score": 2
    },
    {
      "id": "lixv1zp",
      "body": "Yup I got the same message. Risk of Addiction scared me too and obviously it’s a risk but it also depends on who you are, why you’re taking it, etc. I’ve never been a big drinker or really been into other substances. Not into anything else addicting. I get no pleasure from taking it other than feeling “normal”. Am I dependent on it? Sure, like a diabetic on insulin. Am I an addict? Not yet at least lol.",
      "created_utc": 1724103165.0,
      "score": 3
    },
    {
      "id": "lj3l59q",
      "body": "Oh I take a few daily - diazepam or lorazepam + alprazolam (extended release in the morning and small doses through the day) + clonazepam (sleep). \n\nI have had to stop all of them and I didn't have any issues. Maybe I'm just lucky 😅",
      "created_utc": 1724185575.0,
      "score": 2
    },
    {
      "id": "mrbjl56",
      "body": "Huh? Your comment says \"*for most people, they build up a tolerance very quickly therefore you need more to get the same effects overtime*\", and this is a subreddit about anxiety. My source says explicitly:\n\n> tolerance develops relatively quickly for the sedative and anticonvulsant actions of benzodiazepines, whereas tolerance to anxiolytic and amnesic effects probably does not develop at all.",
      "created_utc": 1746741258.0,
      "score": 1
    },
    {
      "id": "ljbejie",
      "body": "Thank you! Of course I walked out crying and never went back lol. I definitely have better visits with nurses. I don’t have a primary thigh I need yo find one but I haven’t had any other reason to go to one - thank goodness. My gynecologist is a nurse and she will prescribe any non-controlled meds I need.",
      "created_utc": 1724293693.0,
      "score": 1
    },
    {
      "id": "liqwovk",
      "body": "LMAOOO 😭",
      "created_utc": 1724002830.0,
      "score": 2
    },
    {
      "id": "lisi8vd",
      "body": "I use droplets! Have tried thc gummies, but not cbd gummies.",
      "created_utc": 1724022757.0,
      "score": 1
    },
    {
      "id": "liw042b",
      "body": "Hope it works for you! I see lots of options in this thread :)",
      "created_utc": 1724082000.0,
      "score": 1
    },
    {
      "id": "liqnmfj",
      "body": "This is a great way to look at it.",
      "created_utc": 1723999854.0,
      "score": 22
    },
    {
      "id": "liqpmb3",
      "body": "Exactly this! Knowing that I stop a panic if I have one helps me not be so afraid to do something that might trigger an attack and makes it so they just don’t happen instead",
      "created_utc": 1724000513.0,
      "score": 17
    },
    {
      "id": "lir3124",
      "body": "100%. I’ve been averaging one about once a month or less. But even just knowing they’re there is helpful.",
      "created_utc": 1724004936.0,
      "score": 10
    },
    {
      "id": "lir86di",
      "body": "I call it my “break glass” pill. I keep one or two on me in a watertight bottle and, like chapstick (for some odd reason), just knowing it’s there usually negates the need to actually use it. But man, when I can’t get my anxiety under control, Xanax is a damn blessing.",
      "created_utc": 1724006641.0,
      "score": 1
    },
    {
      "id": "lqab3ug",
      "body": "Exactly 💯 agree as long as know I have then I'd be fine but I'm trying to explain to my doctor that exact reason but he has me picking them up weekly , I'm just so tired of worrying about panic attacks and not having medication.",
      "created_utc": 1728042378.0,
      "score": 1
    },
    {
      "id": "lisyjvr",
      "body": "In the exact same boat….I’ve had to use a 5 mg edible in lieu of a prescription to Xanax or Klonopin",
      "created_utc": 1724029089.0,
      "score": 2
    },
    {
      "id": "liov3x5",
      "body": "I’ve been on .25 for panic attacks for 3 years and haven’t gone up in my usage or script",
      "created_utc": 1723970878.0,
      "score": 68
    },
    {
      "id": "lir36qi",
      "body": "I mean yeah but that’s if you use it a lot. Using it as an emergency like once every couple weeks or month (how you’re supposed to use it) won’t build tolerance.",
      "created_utc": 1724004987.0,
      "score": 4
    },
    {
      "id": "liqbuyq",
      "body": "so again, what's the point of even going on these meds in the first place if they're apparently nothing but bad for you",
      "created_utc": 1723995926.0,
      "score": 1
    },
    {
      "id": "liqbsa8",
      "body": "Yeah I got off about 2 years ago so I could get pregnant. If it weren’t for that motivation I don’t think I’d ever have gotten off.",
      "created_utc": 1723995901.0,
      "score": 2
    },
    {
      "id": "m83gdcw",
      "body": "I was just prescribed Clonazepam but don't want to get addicted. Do you have any advice you can give? Thanks!",
      "created_utc": 1737340027.0,
      "score": 2
    },
    {
      "id": "livwluo",
      "body": "I have BPD, Bipolar 2 and panic disorder. I took them for a relief from my panic attacks and loved living without anxiety so much I began to take them as often as possible. I’m glad there’s millions who use it responsibly, but there’s also millions of people who use alcohol and opiates responsibly, and millions of people die from these things too. It’s just a warning to be careful.",
      "created_utc": 1724080868.0,
      "score": 1
    },
    {
      "id": "liqjnkr",
      "body": "Gabapentin did nothing for me except make me twitchy, unfortunately.",
      "created_utc": 1723998532.0,
      "score": 3
    },
    {
      "id": "liqclqc",
      "body": "Wow I had the same issue when I started jr high\n Missed the first 3 weeks of school",
      "created_utc": 1723996174.0,
      "score": 2
    },
    {
      "id": "liqnfrp",
      "body": "Oop interesting idea!",
      "created_utc": 1723999794.0,
      "score": 1
    },
    {
      "id": "logwwtg",
      "body": "Daily and as needed. I have to take it at night. However, I have a serious social anxiety panic attacks. If I take it during the day due to an event I’m still usually okay to sleep without taking any extra at night due to its long shelf life. Let’s say the script is, was take 2 1 mg tablets at night. 1 1/2 is what I need to for social anxiety, going to Dr appointments, getting my hair cut, etc.. that I can usually be okay to sleep. If needed I’ll take the other half to make up for the 2 mg. I usually try to take the lowest dose possible for night time which on a night ai had just work Is 1 mg. On a Sunday after I’ve been getting lots of sleep and am. Not tired I’ll need 1.5. On rare occasion it has been the the full 2 mg",
      "created_utc": 1727060049.0,
      "score": 1
    },
    {
      "id": "lj0y8vu",
      "body": "I can see why you would think this but I usually only take them once I'm fully panicking rather than preemptively. Sorry for the confusion",
      "created_utc": 1724154194.0,
      "score": 1
    },
    {
      "id": "litbx9w",
      "body": "Unfortunately anxiety is one of the biggest life disruptions I have on a good day but I’ve never been into self medicating with cigarettes or alcohol either. I do have my medical MJ card but when I’m this stressed it just four hours of paranoia. So we’re not gonna do that right now. 😬 It helps with my joint pain but I have to be in the right mindset.",
      "created_utc": 1724034510.0,
      "score": 1
    },
    {
      "id": "lipimgs",
      "body": "Had my worse experience 30 yrs ago trying to stop Xanax. That was a horror show. I only take .5mg of clonazapam morning and night.",
      "created_utc": 1723984981.0,
      "score": 2
    },
    {
      "id": "liqkw1i",
      "body": ".5mg 2 times a day",
      "created_utc": 1723998947.0,
      "score": 1
    },
    {
      "id": "lqcgu4k",
      "body": "Yeah like I said we are all different but I think most people don't need benzodiazepines they just need to workout and eat right and find meaningful relationships and that's why I wrote what I did and hopefully help some people avoid a difficult experience.\nI hope you are feeling good and I'm glad you found something that works for you, some people stay at a low dose of Xanax for many years and swear by it and I've taken that into consideration",
      "created_utc": 1728069012.0,
      "score": 1
    },
    {
      "id": "lir43e4",
      "body": "No doctor in Canada is giving you 90, 2mg tablets of alprazolam unless they're a quack. I'm nearly 30 and been getting them prescribed for almost 2 decades and haven't met one doc yet who's that chill. Even my psych who would prescribe me 40mg of dexedrine per day and ambien would only give like 30 tablets of 0.5mg clonazepam or whichever benzo I wanted, a month. He said it's risky to give handfuls when the college is breathing down your neck. \n\nIf you meant just get them prescribed in general though, then yeah I do lol. It was just convenient getting a large amount of a higher dose at the time.",
      "created_utc": 1724005291.0,
      "score": 7
    },
    {
      "id": "litilv2",
      "body": "It's the pharmacy across from the Riu Cancun!",
      "created_utc": 1724037400.0,
      "score": 1
    },
    {
      "id": "liqjfpo",
      "body": "The last thing I want to do is spread misinformation. Thank you for correcting me.",
      "created_utc": 1723998458.0,
      "score": 5
    },
    {
      "id": "lu9yb92",
      "body": "Well everyone has the correct dose for them and I couldn’t tell you your dose. So. You might’ve needed more, maybe your circumstances weren’t moving in the right direction. \n\nWhen I was in rehab, gabapentin was extremely noticeable for me, and the reduction of my anxiety even at a 100 mg dose was noticeable for me. \n\nI was in rehab for alcohol. When I got out of rehab my doctor put me on klonopin and then of course the gabapentin is less noticeable, it’s not as strong as any benzodiazepine will ever be. But yes, I continue to take it to this day. \n\nMy anxiety meds I take are 50 mg hydroxizene, 600 mg gabapentin, 40 mg propanolol(highly recommended), and 1 mg of klonopin. \n\nSo I cannot give you an accurate current opinion on JUST gabapentin besides rehab. It was a life saver in rehab, and I believe it helps me outside.",
      "created_utc": 1730164198.0,
      "score": 1
    },
    {
      "id": "liso48b",
      "body": "my doctor wanted to prescribe it for me (knowing I have asthma) and thankfully I have been in pharmacy for a decade so I was like uhhhh no thank you",
      "created_utc": 1724025014.0,
      "score": 3
    },
    {
      "id": "lirqs23",
      "body": "Thank you. That’s really what I’m hoping I can get them for",
      "created_utc": 1724012905.0,
      "score": 3
    },
    {
      "id": "lprisvj",
      "body": "A psychiatrist just prescribed me 0.5 mg, 4 tablets a day. I had no idea they were addictive!",
      "created_utc": 1727756014.0,
      "score": 2
    },
    {
      "id": "lirez54",
      "body": "My symptoms are so much better.  I take buspar and venflafaxine now to maintain. I also microdose cannabis. I have done a lot of therapy which has done the most good. CBT worked well, when I was ready and open to it. I understand my brain wiring or chemical makeup is off and I’ll never be able to be drug free and happy. But I can be happy without having to buffer myself so much I can’t feel anything. I can feel now, extreme emotions, and not get caught in them spiraling out of control.",
      "created_utc": 1724008943.0,
      "score": 2
    },
    {
      "id": "liq13se",
      "body": "And there will be thousands suffering when thier meds are taken away. Just because it didn’t work for you doesn’t mean you should spear head taking them from everyone.\n\nI’m sick of this attitude of something didn’t work for me so fuck everyone else, they don’t deserve relief.\n\nEverything in life has risks.",
      "created_utc": 1723992236.0,
      "score": 4
    },
    {
      "id": "mcslilj",
      "body": "You and me both! Trying to find the least abusable benzo to replace alcohol at social events.",
      "created_utc": 1739566267.0,
      "score": 1
    },
    {
      "id": "liqo4rk",
      "body": "How old are you? Sent me a message to chat",
      "created_utc": 1724000024.0,
      "score": 1
    },
    {
      "id": "lirblnu",
      "body": "How many milligrams of magnesium in the morning and night please and thank you",
      "created_utc": 1724007790.0,
      "score": 1
    },
    {
      "id": "lmi8bdn",
      "body": "There might lay your problem. Zofran can also cause low BP. I can't take them together either. I also take zofran as I have a terrible fear of getting sick.",
      "created_utc": 1726004450.0,
      "score": 1
    },
    {
      "id": "m5wzr7z",
      "body": "I definitely will! I agree! My biggest concern is becoming dependent and then having to taper off in order to not get withdraws. I’m definitely not a medication guy. It all started with a stomach bug in July that lasted two weeks. Ever since I’ve been an anxious, tense mess with little to no sleep.",
      "created_utc": 1736275988.0,
      "score": 1
    },
    {
      "id": "liq0ykw",
      "body": "Thank you so much for the recommendations! I really appreciate it!",
      "created_utc": 1723992185.0,
      "score": 2
    },
    {
      "id": "lisir7n",
      "body": "Ok I'll give that a go! I'll start off small I presume?",
      "created_utc": 1724022950.0,
      "score": 1
    },
    {
      "id": "liqskau",
      "body": "It really works",
      "created_utc": 1724001480.0,
      "score": 2
    },
    {
      "id": "lirmp3i",
      "body": "This is what I want to do. Do you get it from your regular GP or psychiatrist or what? Just trying to see how supportive docs are of that approach. And how long have you been on that path w the meds?",
      "created_utc": 1724011556.0,
      "score": 1
    },
    {
      "id": "litczfx",
      "body": "Edibles don't work for me. I lack some digestive enzyme, and I can eat huge amounts with very little effect. \n\nSome tinctures work though. I started DJing at a club on the weekends again, and was having full-on panic attacks in the booth. I made it through, but it was actual torture. \n\nI went to the dispensary and they showed me this stuff from \"MULE Extracts\". They call it Muleshine, and it's a syrup. They have one called \"Quadshine\" with 1oz/1000mg split between THC, CBD, CBN, CBG. \n\nI mix half of it with a vitamin mix drink for my bottled water and do that twice throughout the night. \n\nIt actually helps a good bit. It's $20, but worth it for now at least.",
      "created_utc": 1724034952.0,
      "score": 1
    },
    {
      "id": "liov5o0",
      "body": "Not saying it’s healthy but it’s unfortunately only way how I can cope and hold down a job",
      "created_utc": 1723970910.0,
      "score": 46
    },
    {
      "id": "lipzkxo",
      "body": "Yes, it’s possible to use it responsibly. Not everyone can. I have had periods of addiction and periods of responsible use, I’m happy to say I’m using responsibly now. But it’s a slippery slope",
      "created_utc": 1723991698.0,
      "score": 16
    },
    {
      "id": "lipex4k",
      "body": "Which medication do you take? I take lorazepam (Ativan)",
      "created_utc": 1723983180.0,
      "score": 1
    },
    {
      "id": "lis7hu7",
      "body": "Same but even longer; Like 10 years maybe. I actually try 1/2 of a .25 tab first but for facing super scary stuff like a flight on a plane, root canal or surgery, I might take up to 1 mg ‘just to get in the building or plane’. But there are many days where I don’t take any and try exercise, getting enough sleep, meditation ect.",
      "created_utc": 1724018662.0,
      "score": 1
    },
    {
      "id": "lirnih0",
      "body": "Correct, and that’s the way the drug was always intended to be used. A lot of us that were prescribed before the black box warning was issued were told it was safe to take daily. Which was a lie.",
      "created_utc": 1724011822.0,
      "score": 2
    },
    {
      "id": "liqjghf",
      "body": "The idea is that they’re for emergency use so you don’t build a tolerance.",
      "created_utc": 1723998465.0,
      "score": 5
    },
    {
      "id": "liqmwvn",
      "body": "How often were you taking them?",
      "created_utc": 1723999622.0,
      "score": 2
    },
    {
      "id": "liqc60s",
      "body": "I’m in the home stretch of my taper, I would like to get pregnant but I’m running out of time bc age plus endometriosis, so I’m not sure if it’s in the cards. Either way, I am committed to getting the hell off. How long did it take you to start feeling somewhat normal/how soon after you were done tapering did you try for a baby?",
      "created_utc": 1723996029.0,
      "score": 1
    },
    {
      "id": "m83hwjt",
      "body": "Sure, ONLY take it when you absolutely need it for an acute panic attack, public speaking, plane ride, medical procedure, etc. It should never be taken daily, because you can become dependent in as little as 2 weeks. A lot of people start out taking it “as needed,” and then begin justifying taking it more and more frequently (like they can’t sleep, or they’re really stressed at work). That’s how the dependency gets its claws in you. Please be careful with this! It’s a great medication if you take it *very* sparingly.",
      "created_utc": 1737340521.0,
      "score": 1
    },
    {
      "id": "lixvd0m",
      "body": "It's never unwise to be careful. I just see it quite often in this sub of people who are prescribed them and choose to suffer additional panic attacks and episodes out of fear of using them. They're not the only med that can help, but if you have them, use them responsibly when needed.",
      "created_utc": 1724103266.0,
      "score": 2
    },
    {
      "id": "logx8wo",
      "body": "That's awesome that it helps you and I'm surprised that you're able to get it daily. I'll definitely ask my doctor about it because I'm losing my mind haha. \n\nMay I ask, do you have agoraphobia?",
      "created_utc": 1727060192.0,
      "score": 1
    },
    {
      "id": "lit1rwc",
      "body": "How long? That's a fairly low dose so it shouldn't be too bad but it really depends on the person.",
      "created_utc": 1724030387.0,
      "score": 1
    },
    {
      "id": "lqclnf5",
      "body": " I wouldn't take it everyday if you ever feel the need to try it and end up deciding to start I advise you or anyone to only take a small dose when needed but don't take them everyday, nobody wants to be physically addicted. Sort of a crutch for when you really lose it. I struggle with anxiety still even at this dose everyday. It helps me though.",
      "created_utc": 1728070573.0,
      "score": 1
    },
    {
      "id": "lirl5c0",
      "body": "That’s wonderful to hear! I tried buspar for a few weeks earlier in my taper and I feel like it increased my anxiety? My desprescriber told me ideally I get off the benzos with as few helper meds as possible, but they were offered. I have hydroxyzine for sleep but it doesn’t do all that much. I just linked up with a new CBT therapist this past week, as I am in the home stretch of my taper. \n\nMy biggest fear is that I’ll never heal, or that it will take years. I know it’s not true, but the non-linear nature of benzo healing is very unnerving. One unexpected shift I’ve experienced is that my anxiety has gotten *better* as I’ve gotten lower on my dosage. Now it’s just more anger and depression - frustration with the whole ordeal. It’s hard to see the light right now.",
      "created_utc": 1724011038.0,
      "score": 1
    },
    {
      "id": "lmi8rjm",
      "body": "ugh well that’s not ideal. I also have emetophobia and am trying to plan to have a less stressful plane ride. looks like it won’t be by taking zofran and clonazepam haha. sorry you deal with that too. it’s the worst",
      "created_utc": 1726004599.0,
      "score": 1
    },
    {
      "id": "lizntbg",
      "body": "Yes I’d start off with the lowest recommended dose and if you don’t feel any better, go ahead and try a bit more. Usually it tells you how many drops to use on the packaging!",
      "created_utc": 1724126861.0,
      "score": 1
    },
    {
      "id": "lirnykc",
      "body": "I got it from a GP, he gave me a low dose. But my now psych is supportive as well. I’ve only taken it since April when my anxiety was really bad from Prozac withdrawal. Now I’m back on Prozac I’m taking it a lot less",
      "created_utc": 1724011969.0,
      "score": 2
    },
    {
      "id": "liuuh2l",
      "body": "Are you also on an antidepressant?",
      "created_utc": 1724066002.0,
      "score": 1
    },
    {
      "id": "liq6yks",
      "body": "I'm in the same situation, unfortunately. Have tried every therapy and ssri under the sun. Nothing works except alprazolam.",
      "created_utc": 1723994262.0,
      "score": 14
    },
    {
      "id": "lir7a7h",
      "body": "Wish I could have that kind of control. I was addicted to painkillers years ago, so I can’t even take the chance.",
      "created_utc": 1724006346.0,
      "score": 2
    },
    {
      "id": "lipjxiy",
      "body": "How many mg of lorazapam do you take per day,do you take it everyday or as needed,how long you been on it,does it help you with your anxiety",
      "created_utc": 1723985579.0,
      "score": 1
    },
    {
      "id": "ljd7ip9",
      "body": "Same here, diff for everyone obviously but I don’t love the way it makes me feel so I just use it when I’m anxious but am under close watch w my doctors. It helps me get to work and do hard things. Nice to hear ur story as people discuss the negatives a lot",
      "created_utc": 1724328998.0,
      "score": 2
    },
    {
      "id": "liro2mb",
      "body": "Yeah that’s messed up. Addiction runs in my family so I’m always very careful with it and it’s my last resort.",
      "created_utc": 1724012006.0,
      "score": 2
    },
    {
      "id": "lprh8lw",
      "body": "A psychiatrist prescribed me Clonazapam 4 times a day (0.5 mg pill morning, afternoon, and 2 at night). And now I'm reading it's addictive?? I took the first one a few hours ago.",
      "created_utc": 1727755242.0,
      "score": 2
    },
    {
      "id": "liqr3dq",
      "body": "Twice a day",
      "created_utc": 1724001005.0,
      "score": 2
    },
    {
      "id": "liqer2e",
      "body": "I don’t remember exactly how long it took me to feel normal. Not too long. Maybe a month to feel much more emotionally regulated. Some physical symptoms lingered like brain zaps, and reading my old comments apparently I had some muscle pain for a while. I got pregnant about 8 months afterward because I still had to get off gabapentin and propranolol, and get my period back after getting my IUD removed.",
      "created_utc": 1723996894.0,
      "score": 2
    },
    {
      "id": "m83iy11",
      "body": "Thanks. A few weeks ago I had a few things in my life that were overwhelming and brought this on. It started with not being able to sleep and nausea and I can't eat much of the time unless I force myself. But it's been pretty constant and the breathing and meditations the therapist recommended help only briefly. I'm going to see a psychiatrist about a different med that's not addictive like this one. Did you have the same type of symptoms, and can you tell me how you overcame your anxiousness?",
      "created_utc": 1737340858.0,
      "score": 2
    },
    {
      "id": "logyyhw",
      "body": "Yes, I have it all. I get anxiety that I’ll have an anxiety attack. And it’s embarrassing because my heart will beat super fast you can see it beating through my shirt collar and get real shaky, trembling, it feels like I’m about to have a seizure.",
      "created_utc": 1727060908.0,
      "score": 1
    },
    {
      "id": "lit85ns",
      "body": "A long time. Approx 30 yrs. I notice it if I skip a dose.",
      "created_utc": 1724032959.0,
      "score": 1
    },
    {
      "id": "lqcncb5",
      "body": "Even if you don't take it daily you are still at risk of becoming dependent as it takes alprazolam around 5 days to flush out of your system. \nI've heard of a person that was only using on Saturdays to Sundays for a long time without issues but eventually getting stronger cravings and finally endded up having a seizure on a friday so it can definitely sneak up on you unless you make sure to take long breaks.\nI have tried it at low doses and high doses and been through withdrawals many times and I get incredibly dependent very quickly but I don't get addicted by anything it's just the type of person I am",
      "created_utc": 1728071127.0,
      "score": 1
    },
    {
      "id": "lis6asf",
      "body": "The light was very dim for me. Everything came to a head and I was tired of ‘losing’ and them ‘winning’. I was determined to enjoy life and quiet the voice that told me I wasn’t good enough. I went to inpatient therapy and I wasn’t ready. I was more wrapped up in the rules, the other people, but not me. I ended up years later at an intense 10 day program that I was determined would work. I made it work, and now I see I can keep on this path. Changing how I viewed things really helped. And my new views are so much more realistic and likely than the crap I was telling myself. I feel like a combination of drugs, good therapy, and the proper mindset made all the difference. All working well together made a better me. The one that was there, but hidden.",
      "created_utc": 1724018223.0,
      "score": 2
    },
    {
      "id": "lmi9sd6",
      "body": "Ahhh I totally feel that. I've been terrified of flying to my parents forever and it's only a 2 hour flight. I highly recommend you take meclizine (OTC, also called dramamine less drowsy) a few hours before your flight. It will prevent motion sickness. It can be taken with Clonazepam typically.\n\nI'm 31 now and I've been dealing with emetophobia, several motion sickness, and agoraphobia for like 18 years now, so if you ever need any help, let me know friend. Best of luck",
      "created_utc": 1726004943.0,
      "score": 1
    },
    {
      "id": "liv5qkx",
      "body": "No, they've never had positive effects for me.",
      "created_utc": 1724071247.0,
      "score": 2
    },
    {
      "id": "lirb093",
      "body": "When I awaken too early (3am) with bad anxiety I take a quarter of a 1 mg tablet. And then if I still have bad anxiety at 6 AM I take another quarter. I have to be at work by 7 AM so I take like half a milligram a day. Unless something comes up during the day, that’s really bad, I take another quarter every day I take it in the morning",
      "created_utc": 1724007587.0,
      "score": 2
    },
    {
      "id": "mirxh5q",
      "body": "WHAT?!!! daily use?",
      "created_utc": 1742468372.0,
      "score": 1
    },
    {
      "id": "lir3ecy",
      "body": "Well yeah…that’s a lot",
      "created_utc": 1724005058.0,
      "score": 7
    },
    {
      "id": "m83pe6a",
      "body": "Absolutely look into something that isn’t addictive - a beta blocker for the physical adrenaline spikes, hydroxyzine, maybe something like trazodone for sleep. Anything but taking a benzo daily. I didn’t really overcome the anxiety per se. What happened is that eventually tolerance to the benzo kicked in and my anxiety got progressively worse while still on them. That’s the nature of these things, many people start to raise their dose because the drug doesn’t work as well after a while. \n\nThen once I started tapering, all hell broke loose and I was in a state of 24/7 panic for months on end. Literally NOTHING worked to calm me down, breathing exercises, grounding, meditation, all absolutely useless. I just had to keep myself alive second by second, minute by minute, hour by hour. And that’s what you have to do - anxiety can’t hurt you (yes, it can suck, but it can’t kill you). \n\nIf I knew what torture these drugs could lead to one day, I would have never touched them. I would have just worked through the anxiety without the benzos, because that was nothing compared to the chemical terror of benzo withdrawal. So I wish I knew what it would have been like to have those tools at my disposal from the start.\n\nI am incorporating those things now, because there’s no drug to rely on. I’ve been off the drug for less than 2 months and things are still very rough, but they’re at least better than my taper. I have developed so many health issues from the benzos that I worry I’ll never get better. Haven’t had a good night’s sleep in over a year! For sleep, focus on good sleep hygiene and maybe try CBT-I. At my worst, I was only getting around 3 hours of sleep a night. The way I dealt with that was I just accepted that I won’t sleep and it made the prospect of not falling asleep less scary. Eventually it started to improve.  \n\nPlease please exhaust all of your other options before settling on benzos. I will also caution against gabapentinoids (these are often given during benzo withdrawal and can have withdrawals almost as bad as benzos) and antipsychotics (these can have terrible side effects), but the other stuff I mentioned in the beginning are fairly low-risk. There’s also buspar and SSRIs to try as other alternatives. Best of luck!",
      "created_utc": 1737343181.0,
      "score": 1
    },
    {
      "id": "logzdjr",
      "body": "Yeah I feel that. I just want to feel normal all the time like everyone Else. I started having attacks when I was like 6 or 8 and never stopped. I'm sorry, our path is a difficult one.",
      "created_utc": 1727061080.0,
      "score": 1
    },
    {
      "id": "litiie3",
      "body": "Wow. Yeah that's a very long time. Sorry to hear! Honestly it would most likely take over a year, maybe more if you've been on them that long. Even a doctor really couldn't say for sure because people's brains are different. If you feel fine when you don't miss a dose, I'd probably just stay on them. But good luck with whatever you choose!",
      "created_utc": 1724037358.0,
      "score": 2
    },
    {
      "id": "lqcnl7q",
      "body": "Interesting yes sounds about right .",
      "created_utc": 1728071208.0,
      "score": 1
    },
    {
      "id": "lqcoak9",
      "body": "Xanax takes 72 hours typically to detox from every time I have ever got off it I would end up in the hospital for 3 days every time after 3 days it would be out of my system.",
      "created_utc": 1728071439.0,
      "score": 1
    },
    {
      "id": "lis72e0",
      "body": "This gives me hope. I’m glad you were able to come out the other side.",
      "created_utc": 1724018505.0,
      "score": 2
    },
    {
      "id": "mj1zfmx",
      "body": "Yes. I read here that it's addictive so I didn't continue. And even the 2 pills I'd tried (half dosage) hadn't done anything anyways.",
      "created_utc": 1742596489.0,
      "score": 1
    },
    {
      "id": "lirap4a",
      "body": "I mean I was initially prescribed .25 mg as needed. My need went up and up and up. That’s what the danger is.",
      "created_utc": 1724007481.0,
      "score": 2
    },
    {
      "id": "m83r0yo",
      "body": "Thanks so much for explaining all of that. I'm not going to take any more of them for the time being. I may need to take one before an upcoming surgery that I've been putting off until winter is over. I've also noticed the dry mouth that caused me to stop taking the only other similar drug that I've ever taken, Lunesta which I know is for sleeping and I took it maybe once a week. But my mouth got to be so dry that I threw them away and stopped them cold turkey. That wasn't so hard but these benzos, wow they sound like torture to get off. What I hate is having a fast metabolism and I guess being anxious even speeds that up. So I get hungry so much even in the middle of the night. I'm going to ask right therapist if she can help me with cognitive behavioral therapy and I'm going to a psychiatrist to hopefully get a prescription for something safer. Thanks again for your help, it's much appreciated.",
      "created_utc": 1737343814.0,
      "score": 2
    },
    {
      "id": "m8n53ia",
      "body": "Well she just prescribed mirtazapine and I didn't have a good experience last night. It helped me fall asleep quickly but feeling drowsy and sluggish all day. I'll suggest the buspar or an SSRI. Thanks again!",
      "created_utc": 1737593589.0,
      "score": 1
    },
    {
      "id": "litq6op",
      "body": "I'm 67. For all I know they might have stopped working since it's such a low dose. It does help me sleep better. 60 pills a 2 month supply only cost $12. Might as well keep taking them forever. I hate trying to change medication and going through side effects.",
      "created_utc": 1724041021.0,
      "score": 1
    },
    {
      "id": "lqco7w6",
      "body": "Yeah but he was probably taking high doses during the weekends and was one of the people who get easily dependent. A lot of people have taken massive amounts for a long time and stop without feeling anything at all. Its interesting for sure",
      "created_utc": 1728071415.0,
      "score": 1
    },
    {
      "id": "liu1lmx",
      "body": "It’s worth the work. I’ve worked harder on things for other people, might as well take care of me and reap the rewards.",
      "created_utc": 1724047558.0,
      "score": 2
    }
  ]
}