{
  "id": "1jnc2hb",
  "title": "Nobody is thinking about you",
  "selftext": "",
  "created_utc": 1743340227.0,
  "score": 632,
  "num_comments": 61,
  "url": "https://i.redd.it/dft6sjnjttre1.jpeg",
  "comments": [
    {
      "id": "mkjqfzu",
      "body": "The author of this hasn't met my co-workers.",
      "created_utc": 1743355307.0,
      "score": 38
    },
    {
      "id": "mkio9h8",
      "body": "I strongly disagree. \n\nI think almost everyday about the random who suffer.  \n\nI do care about people i never meet. \n\nEveryday i try to help, i dont want a thanks i just want to help. \n\nThis picture is maybe true for some people but its not a pure fact",
      "created_utc": 1743343073.0,
      "score": 91
    },
    {
      "id": "mkln04s",
      "body": "This is bullshit. I wouldnt be like this if people werent as judgmental of the different as they are",
      "created_utc": 1743377206.0,
      "score": 10
    },
    {
      "id": "mkixta8",
      "body": "I think about the people i know...where they are... how their life turned out....the very reason y i worry about someone thinking about me....i am not living the perfect life i wanted but people from my past knew about  the perfect life i wanted the very fear of encountering them make me more socially anxious 😔",
      "created_utc": 1743346343.0,
      "score": 7
    },
    {
      "id": "mkjlzvl",
      "body": "And then people bitch at YOU for not thinking about THEM.",
      "created_utc": 1743353962.0,
      "score": 8
    },
    {
      "id": "mkkqxzu",
      "body": "r/wowthanksimcured :/",
      "created_utc": 1743366436.0,
      "score": 6
    },
    {
      "id": "mkk4m9x",
      "body": "It can be a comfort to believe, but the truth is that I think about other people plenty. Doesn't take much to extrapolate from there.",
      "created_utc": 1743359582.0,
      "score": 6
    },
    {
      "id": "mkka0fw",
      "body": "I can't believe you would wear that.",
      "created_utc": 1743361216.0,
      "score": 5
    },
    {
      "id": "mkjjxvb",
      "body": "I need this tattooed on me. Paranoia is a slimy bitch",
      "created_utc": 1743353329.0,
      "score": 9
    },
    {
      "id": "mkkhtmb",
      "body": "I disagree with that lots of people think about others. Just look at the laws being passed in USA goverment banning lgbt rights, trans rights, disable rights, women rights. Republicans can’t stop thinking about next person to take away rights from while the left can’t stop thinking about who gonna be the next one affected and what we will need to do in order to try and fight back so all our rights aren’t taken away etc. random people think about others too look at crimes that happen for example like trans person getting beat to death but there lots of other examples of people thinking about you too. so yeah people do think about you.",
      "created_utc": 1743363638.0,
      "score": 3
    },
    {
      "id": "mkk3smy",
      "body": "This is gold.   \nWhere is this from? is it a book?",
      "created_utc": 1743359330.0,
      "score": 4
    },
    {
      "id": "mkl1xkc",
      "body": "I was the one who overthought and hurt myself thinking bout possibilities",
      "created_utc": 1743369927.0,
      "score": 2
    },
    {
      "id": "mkmsqwo",
      "body": "While this is probably true about me, this is not true about the people I think about 🙃 like the guy I still have feelings for that I don't talk to anymore. I think about that guy everyday and how he's doing",
      "created_utc": 1743393592.0,
      "score": 2
    },
    {
      "id": "mkmtntx",
      "body": "I'm just thinking about your username! I love it! 🥰😁",
      "created_utc": 1743394022.0,
      "score": 2
    },
    {
      "id": "mkn7nbv",
      "body": "I know this is meant for those who struggle and worry about being perceived by others, but I am one of those people and honestly this thing never really helped. Had the opposite effect even.\n\nBut that's the nature of things sometimes, nothing is a one size fits all.",
      "created_utc": 1743401499.0,
      "score": 2
    },
    {
      "id": "mkze70v",
      "body": "You guys collectively make a valid point, there are truths to everyone's statements, I can concur a lot of the experiences I'm reading, my question is ,  why can't we have both ? Compassion as well as the opportunity to love ourselves!! It seems like it's one or the other, at least in my experience, I once was married, and my spouse declined to work, I was 21 when I met her and she saw my potential and took total advantage, anywho, the extra I had to do to supplement both incomes I think burnt me out, I had absolutely no time for me!! I truly loved her , but taking care of everything on my own including a child was abusive to me,she passed away two yrs. ago ,and now due to working so much and not actually enjoying life , I'm kinda lost, I was warned not to allow her to be my everything, but I was on my own since 13 and wanted nothing more than to have a family and be a dad, in conclusion, tho we may be late bloomers,lets honestly treat ourselves well, indepently, and allow others to do the same, the lesson  for me was , take care of yourself, before others take advantage of you, might be selfish, but no one can love me, like me, I'm older now ,but I will never forget the sacrifices I made to please someone, who apparently didn't reciprocate those emotions,this goes from job to home to people in the street, what I'm saying is respect,love and compassion should be reciprocal, and if not we as human beings can feel unappreciated, I'm sorry thanks for allowing me to vent",
      "created_utc": 1743573637.0,
      "score": 2
    },
    {
      "id": "mkzkqlv",
      "body": "This actually made me feel worse. I wish somebody, anyone, would think of me. I feel so lonely",
      "created_utc": 1743577756.0,
      "score": 2
    },
    {
      "id": "ml0dbkx",
      "body": "Yeahhhh.... the stares I get in public as a disabled person say otherwise. Like, I don't go outside unless I absolutely have to. Anxiety is so bad I barricade my door..",
      "created_utc": 1743595263.0,
      "score": 2
    },
    {
      "id": "mkinksr",
      "body": "At the least, for those who do think so, a god or the universe is always thinking about you",
      "created_utc": 1743342826.0,
      "score": 1
    },
    {
      "id": "mkkrhqp",
      "body": "I understood the message the first time reading it but it sounds so mean the second time😂",
      "created_utc": 1743366605.0,
      "score": 1
    },
    {
      "id": "mkku60p",
      "body": "This is true… mostly. Sometimes I daydream about old friends I’ve lost or former lovers, wondering what they’re up to and if they’re happy.",
      "created_utc": 1743367432.0,
      "score": 1
    },
    {
      "id": "mklce60",
      "body": "this is accurate and healing and a trigger at the same time lol",
      "created_utc": 1743373487.0,
      "score": 1
    },
    {
      "id": "mkmg591",
      "body": "Well ACTUALLY",
      "created_utc": 1743388155.0,
      "score": 1
    },
    {
      "id": "mkn253d",
      "body": "[deleted]",
      "created_utc": 1743398349.0,
      "score": 1
    },
    {
      "id": "mkn90zd",
      "body": "Not true. Sorry. But people do think about people. We will think about our family, our friends, and even strangers we saw that day. It’s how the brain processes things. So it has to think about others to process what they’ve done, said, or whatever. And people do think about your mistakes. Either way you need to not let it affect you.",
      "created_utc": 1743402326.0,
      "score": 1
    },
    {
      "id": "mknc8eo",
      "body": "this made me feelings of isolation worse :'c",
      "created_utc": 1743404307.0,
      "score": 1
    },
    {
      "id": "mkni7jf",
      "body": "I disagree. Unless you are an able bodied conservative cis het white man than you live rent free in their head to extent that they need to pass harmful laws and remove protections to inflict as much harm as possible on minorities for daring to live a life different from their own.",
      "created_utc": 1743408237.0,
      "score": 1
    },
    {
      "id": "mkrbvgi",
      "body": "Oh how I wish this were true! The second I read this my first thought was about that one classmate whom I know turns around and speaks badly of me while I am right there or not. \n\nIt’s funny that she wastes her breath talking about my ✨ TrUlY fAnTaStIc ✨ self. Actually, you know what? My name is “ToO gOoD” for her to say it. :D",
      "created_utc": 1743458020.0,
      "score": 1
    },
    {
      "id": "mkxp87z",
      "body": "My body dysmorphia says no",
      "created_utc": 1743548231.0,
      "score": 1
    },
    {
      "id": "mkz0ckw",
      "body": "Now I feel even more like shit now",
      "created_utc": 1743566396.0,
      "score": 1
    },
    {
      "id": "ml3019r",
      "body": "This isn't true. People do think of you. Not everyone. Some people do.\n\nI would be extremely depressed if NOBODY thought about me. Parents? Co workers? Friends ? If none of them thought of me then I might as well move away and make a fresh start.",
      "created_utc": 1743624846.0,
      "score": 1
    },
    {
      "id": "ml3y7z3",
      "body": "The thought that no one WAS thinking of me is depressing 🥹💀",
      "created_utc": 1743635278.0,
      "score": 1
    },
    {
      "id": "ml4kyvm",
      "body": "Not true, my experiences says otherwise ",
      "created_utc": 1743643113.0,
      "score": 1
    },
    {
      "id": "mljmqbz",
      "body": "If this were true, then why do people give me so much BS?",
      "created_utc": 1743863451.0,
      "score": 1
    },
    {
      "id": "mlobdyh",
      "body": "Yeah… no. People gossip. It’s not just a teen thing or something only mean people do. People judge, just sometimes they do it directly towards you. People talk behind your back, people comment on your recent breakup or your weight changes. The most common conversation topic I’ve ever seen is others. Yea, the world doesn’t revolve around you, but people will talk about you, just not ONLY about YOU.",
      "created_utc": 1743931632.0,
      "score": 1
    },
    {
      "id": "mlopgv7",
      "body": "It’s partly true. People think about themselves when there are things that can benefit them over others. But they are quick to judge without walking your shoes if it brings your moral down. Judgement is easy, it takes no vulnerability and accountability of forming a relationship with others.",
      "created_utc": 1743940165.0,
      "score": 1
    },
    {
      "id": "mklv56x",
      "body": "real! i read this and i was like “yeah, but my coworkers gossip about me behind my back and also in front of me, so…”",
      "created_utc": 1743380137.0,
      "score": 7
    },
    {
      "id": "mkjtf6y",
      "body": "Lol",
      "created_utc": 1743356206.0,
      "score": 5
    },
    {
      "id": "mkn8mlm",
      "body": "I have a weird situation at work where, yes I do think a lot about my coworker, but because she is constantly droning on about how she thinks people think badly of her, suspect her of wrongdoings, hate her, make fun if her, will fire here or stole from her etc. For hours on end. And it drives me absolutely insane. So it seems to be a selffulfilling prophecy and now I strongly contemplate sending her this post.",
      "created_utc": 1743402084.0,
      "score": 3
    },
    {
      "id": "mkoue4u",
      "body": "Or my nosy ass Aunt who gave me anxiety growing up because it was like having someone watching your every mood and discussing it heavily with everyone else in the family.",
      "created_utc": 1743431071.0,
      "score": 2
    },
    {
      "id": "mkvwv0v",
      "body": "It’s ai gened so I’m guessing there is no author.",
      "created_utc": 1743527931.0,
      "score": 2
    },
    {
      "id": "mkiy2zg",
      "body": "Yeah, honestly it was meant for those who are anxious, those who can't get over every single mistake they did. I just wanted to reassure them that it's okay to make mistakes but ig it came out wrong",
      "created_utc": 1743346432.0,
      "score": 35
    },
    {
      "id": "mko15hl",
      "body": "same",
      "created_utc": 1743419798.0,
      "score": 1
    },
    {
      "id": "mkiyp5h",
      "body": "Honestly yeah, that's why I miss family reunions or get togethers with my old friends. Ik they don't mean any harm but I don't want to disappoint them",
      "created_utc": 1743346635.0,
      "score": 3
    },
    {
      "id": "mklckm1",
      "body": "felt this 👊",
      "created_utc": 1743373548.0,
      "score": 2
    },
    {
      "id": "mkkhf36",
      "body": "Wear what",
      "created_utc": 1743363511.0,
      "score": 2
    },
    {
      "id": "mkjkpd9",
      "body": "Ikr, it's like a parasite stuck in our brain. It affects us so much and we can't do anything about it",
      "created_utc": 1743353563.0,
      "score": 4
    },
    {
      "id": "mknjw0b",
      "body": "You okay?",
      "created_utc": 1743409383.0,
      "score": 1
    },
    {
      "id": "mknjx3k",
      "body": "Thank youuu!!! 😭😭😭",
      "created_utc": 1743409404.0,
      "score": 2
    },
    {
      "id": "mknk2ah",
      "body": "Yup, sorry that it may have hurt you",
      "created_utc": 1743409500.0,
      "score": 1
    },
    {
      "id": "mknjzql",
      "body": "Well I'm thinking about you if that helps",
      "created_utc": 1743409452.0,
      "score": 1
    },
    {
      "id": "mknk54s",
      "body": "Do you think about the little mistakes other people did years ago?",
      "created_utc": 1743409554.0,
      "score": 1
    },
    {
      "id": "mkuet9p",
      "body": "I guarantee you they have crap lives.",
      "created_utc": 1743510032.0,
      "score": 2
    },
    {
      "id": "mkugobt",
      "body": "Sorry you had to go through that, I can strongly empathise with your situation. My mother did this with me. She also has an insane temper and throws tantrums daily which resulted in me developing a debilitating anxiety disorder at the age of 6 which has been the absolute BANE of my existence for the past 30 years...but I don't necessarily resent her for it, despite the fact that it has fucking *ruined* my life and caused me a massive amount of trauma that I'm currently trying to recover from. Been living on my fucking frayed nerves since somewhere around the age of five or six.",
      "created_utc": 1743510810.0,
      "score": 1
    },
    {
      "id": "mkiyywf",
      "body": "My bad then, usually people are a bit depress so i use to think that was aswell lmao",
      "created_utc": 1743346724.0,
      "score": 6
    },
    {
      "id": "mkoiwnw",
      "body": "Yeah, I'm okay. But this wouldn't apply to him. At least for now. I think about him everyday. He just doesn't know it.",
      "created_utc": 1743427238.0,
      "score": 2
    },
    {
      "id": "mkpoymd",
      "body": "Yep.",
      "created_utc": 1743440316.0,
      "score": 1
    },
    {
      "id": "mkomv0a",
      "body": "The one that got away... I wanna know more about how you met him and stuff if you're comfortable",
      "created_utc": 1743428634.0,
      "score": 1
    },
    {
      "id": "mkps00m",
      "body": "You sure you don't have photographic memory?",
      "created_utc": 1743441220.0,
      "score": 1
    },
    {
      "id": "mkqwrfv",
      "body": "Definitely not the one who got away 😅 he was someone i was talking to, and wouldn't tell me he wasn't interested. So I kept hanging onto hope even though communication was inconsistent on his end. I had to end our \"talking\" for my sanity, because i knew he wasnt as interested as i was. I thought he was really cool though. It's only been 2 months since we stopped talking but I'm aware how I've built him up in my head. I still don't quite understand why he keeps showing up in my head, besides my attraction and disappointment but I'll give it time. He hasn't reached out either so I know how he feels with the silence. I wish him well though, every day.",
      "created_utc": 1743453310.0,
      "score": 1
    },
    {
      "id": "mkpsgh9",
      "body": "Yes I do. But I still remember. Everyone does. I remember all of my peers acting like complete idiots and assholes. I remember who was smart and who wasn’t. Who had potential in life and who was going to end up as a sex worker or a junkie. I don’t remember every detail of course. But i remember a lot.",
      "created_utc": 1743441354.0,
      "score": 1
    }
  ]
}