{
  "id": "1il4yqy",
  "title": "I'm american and I really hate it.",
  "selftext": "I hate seeing immigrants be labeled as \"illegal aliens\" or something and be deported, or held in camps as if they're some sort of vicious animal we have to worry about. I hate being labeled as a country that might possibly be the cause of a genocide. I hate that my own president is literally considering ETHNICALLY CLEANSING palestine, and his little dick rider doing a literal nazi salute TWICE and seeing the same thousands of people support him for it. I hate how I'm watching my OWN PEOPLE get their rights stripped away from them, not only affecting my people, but people in other countries as well!! Why do my people have to be so cruel? Why can't we be normal? I wish I could just fix everything but I can't.",
  "created_utc": 1739069733.0,
  "score": 340,
  "num_comments": 154,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1il4yqy/im_american_and_i_really_hate_it/",
  "comments": [
    {
      "id": "mbys90z",
      "body": "I have locked this post because of the number of absolutely atrocious comments here.",
      "created_utc": 1739162037.0,
      "score": 1
    },
    {
      "id": "mbrw8d8",
      "body": "I’m a first generation Mexican American. My baby sister can pass off as white and it’s sad I’m happy for that. I can’t but I have a very white last name thanks to my husband.",
      "created_utc": 1739070349.0,
      "score": 75
    },
    {
      "id": "mbsv665",
      "body": "This is a fair thing to feel severe mental distress over and you’re in the same boat as a lot of Americans. If it helps, those of us who see the situation for what it is need to stick around. Thats one of the only things that can keep me going sometimes— that maybe I’m needed to help steer my country onto a better path. And at the very least I can say I told you so when it’s all over.",
      "created_utc": 1739086076.0,
      "score": 13
    },
    {
      "id": "mbv1nmv",
      "body": "I hear you. \nI felt that way growing up: little kid during McCarthy era with Left parents scared of losing jobs\nAdolescent during Vietnam war. \nI feel that way still, it just doesn’t weigh on me as much. \nActivism helps: you get to meet lots of people who care about the things you do.",
      "created_utc": 1739119923.0,
      "score": 5
    },
    {
      "id": "mbs1xrb",
      "body": "Most Americans aren’t cruel or abnormal. The president may be but there are people working hard to block what he wants to do, some in Congress, federal judges, etc. And individuals have the ability to vote out Congresspeople who support him over the next 4 years. \n\nI think a many American voters were confused by misinformation spewed by biased news outlets, influenced by social media and believed the lies of horrific political ads that we were constantly inundated with for months before the election.\n\nI agree a lot has to change",
      "created_utc": 1739072492.0,
      "score": 49
    },
    {
      "id": "mbs9zes",
      "body": "https://www.politico.com/blogs/under-the-radar/2017/02/trump-fbi-files-discrimination-case-235067\n\nHis past views haven’t changed. He’s just added more minorities that are dark too. He always gave me the creeps.",
      "created_utc": 1739075749.0,
      "score": 14
    },
    {
      "id": "mbt0zff",
      "body": "Perhaps the best way to feel hopeful is to take action, even if it's something very small. Getting together with neighbours, sharing food, supporting each other, doing something that makes you laugh, maybe meditating or praying together (no belief in God required - the Universe is listening).... 💗🙏 These things make a difference.",
      "created_utc": 1739089284.0,
      "score": 8
    },
    {
      "id": "mbs2ahv",
      "body": "I know.  It's the cruelty baked into this country's DNA lashing out yet again.",
      "created_utc": 1739072628.0,
      "score": 23
    },
    {
      "id": "mbt6axf",
      "body": "Idk why people in the comments are being so mean and judgmental. These are some dark times and living in a world filled with so much hate, violence and negativity with no sight in end (in fact it just seems to keep getting worse) is beyond draining. There will always be people that believe and do evil things. Love will always prevail. You can’t fix it all and it’s not your job to. But doing what you can may help give you a sense of control back. Attend protests, support local people of color and small businesses, call your reps, create art, etc. know that you’re not alone in this. And don’t forget to take care of yourself 💛",
      "created_utc": 1739092279.0,
      "score": 12
    },
    {
      "id": "mbu4s54",
      "body": "Hey, it’s a tough wake up call as Americans. We are internally struggling with an identity we thought we had. It feels like it’s falling apart for sure. A lot of division and unfortunately a lot of information out there. Most of it is curated to fit a certain narrative.\nI hope you can minimize any news content and just focus on yourself for a while. Try something new or do your usual hobbies.\n\nI’ve been reading a lot lately just to learn more about world history. I quit drinking. \n\nMost Americans are not bad people. Most Americans are struggling like many others around the world. We have been living in a country that claims to be #1 but most people can’t even live outside of pay check to pay check and we are the only developed country with out free healthcare for all. So yeah it’s crappy but there’s still a lot of not crappy things. Keep your head up we need good folks to stand up to the evil and the hate from the orange man and his corrupt regime",
      "created_utc": 1739109585.0,
      "score": 6
    },
    {
      "id": "mbwa0ok",
      "body": "I am german and I really hate it",
      "created_utc": 1739132332.0,
      "score": 3
    },
    {
      "id": "mbt5184",
      "body": "The loud 1% is always more seen than the silent 99. That’s the slice that makes the most noise, definitely, and that makes the most sensationalistic news. If you wanna escape, I read Australia has LGTBQ visas. Just say you’re bi and from the US, should be enough\n\n(They’re not gonna check if you actually are, that would be weird 😭)",
      "created_utc": 1739091559.0,
      "score": 6
    },
    {
      "id": "mbsldt6",
      "body": "[removed]",
      "created_utc": 1739080933.0,
      "score": 17
    },
    {
      "id": "mbvjxzw",
      "body": "It’s time we all vote when it’s midterms. And it’s time we start using our voice. I’m very sick of what’s happening every day. And I wonder honestly what’s the point of anything now. I’m in school and don’t know how I’ll pay for it if there’s no department of education. I have adhd so no dei… don’t know what will happen with my protections in the work place. I’m a single individual so taxes going up. I’m just so irritated and annoyed that people in this country really sold us out because they don’t like illegal immigrants and the price of eggs.",
      "created_utc": 1739125025.0,
      "score": 2
    },
    {
      "id": "mbvmj8k",
      "body": "I’m also American and all I can say is: same.",
      "created_utc": 1739125747.0,
      "score": 2
    },
    {
      "id": "mbw418o",
      "body": "Most countries require immigrants to apply for citizenship. But a certain political party uses it as moral leverage to garner votes. They manufacture outrage and call themselves the people party, but in actually receive vast donations from global elite fascists. They have most media news outlets because their donors own all of them repeat Republicans and Trump are racists 24/7. This is well known if you have common sense.",
      "created_utc": 1739130615.0,
      "score": 2
    },
    {
      "id": "mbwm6b5",
      "body": "  I'm with you, the cruelty is heartbreaking & inconceivable. And the frustration of fellow white folks needing to retreat into self-care more than take action or blindly follow this racist narrative. I can't just sit & color at my craft club of 40 members when this is going down. Our neighbors need allies, these people being targeted now don't get that privilege of just \"taking an indefinite break from the problem\". I hope someone does some voodoo or witchcraft to stop this & it works. There's Literally no reason for any of this 😤😓. I don't even know what to say.",
      "created_utc": 1739135867.0,
      "score": 2
    },
    {
      "id": "mbumet4",
      "body": "[removed]",
      "created_utc": 1739115504.0,
      "score": 4
    },
    {
      "id": "mbt1vy7",
      "body": "I hate to add to your upset . Yes, the genocide is our fault, as we continued to fund Israel’s genocide.  So be mad but shit has been going on for a while and we as a country need to wake up to the rot in both parties.",
      "created_utc": 1739089785.0,
      "score": 6
    },
    {
      "id": "mbs9u1u",
      "body": "But the egg prices!",
      "created_utc": 1739075685.0,
      "score": 4
    },
    {
      "id": "mbsmd11",
      "body": "See a therapist or go camping by yourself for a week. I don’t know what else to tell ya",
      "created_utc": 1739081421.0,
      "score": 4
    },
    {
      "id": "mbv2yg9",
      "body": "Do yourself a favor and don't pay much attention or else you will just get more depressed.  It's going to be a rough 4 years but there is nothing we can do about it.",
      "created_utc": 1739120288.0,
      "score": 2
    },
    {
      "id": "mbwlmti",
      "body": "OP, you’re not alone in your feelings. If I had enough money I’d be out of here so damn fast. I’m too old to march and fight and resist. If thing one and thing two get their way, I’ll be homeless by March first. I wish you peace wherever you land.",
      "created_utc": 1739135711.0,
      "score": 2
    },
    {
      "id": "mbwwwd5",
      "body": "I'm brown and hispani  American and love it here!",
      "created_utc": 1739139012.0,
      "score": 2
    },
    {
      "id": "mbslmcd",
      "body": "The funny thing is you can find videos of Obama saying the exact same thing about deporting people but nobody said anything then. Funny how people are only hating trump for it",
      "created_utc": 1739081052.0,
      "score": 1
    },
    {
      "id": "mbs1vs0",
      "body": "It’s not your job to fix the world, I’m not saying give up on what ever you believe in but the world isn’t gonna change anytime soon. We’ve never gotten along and we never will",
      "created_utc": 1739072470.0,
      "score": 2
    },
    {
      "id": "mbs6kss",
      "body": "[removed]",
      "created_utc": 1739074342.0,
      "score": -2
    },
    {
      "id": "mbsaf45",
      "body": "It really does feel like the world is crashing down around our ears. I’m a disabled trans guy with a disabled son  and a preteen daughter in middle America. I’ve been looking at moving, but it doesn’t seem like there is any where that wants us and I don’t have the $$$. \n\nDuring times like this, I keep repeating to myself what Mr. Rogers said when bad things happen, “look for the helpers”.  It is easy to see the hatred. And I am not denying the terrifying news, but there are good people doing good things. We will persist.",
      "created_utc": 1739075934.0,
      "score": 1
    },
    {
      "id": "mbslm83",
      "body": "Literally feels like how Hitler took over. Installed fear in the people. made everyone turn against minorities. Making people slowly think there a Superior race. why tf are we letting history repeat.",
      "created_utc": 1739081050.0,
      "score": 1
    },
    {
      "id": "mbxqajo",
      "body": "I feel this. I’ve been marching and getting involved in organizing but like.. god I’m tired of this. I want my neighbors and friends to be safe",
      "created_utc": 1739148564.0,
      "score": 1
    },
    {
      "id": "mbyd62i",
      "body": "[removed]",
      "created_utc": 1739156437.0,
      "score": 1
    },
    {
      "id": "mbs4trt",
      "body": "[removed]",
      "created_utc": 1739073627.0,
      "score": -7
    },
    {
      "id": "mbsgobm",
      "body": "[removed]",
      "created_utc": 1739078696.0,
      "score": -4
    },
    {
      "id": "mbscvp8",
      "body": "[removed]",
      "created_utc": 1739077000.0,
      "score": -7
    },
    {
      "id": "mbsvtm6",
      "body": "Join the resistance \n\nWe resist\nhttps://www.reddit.com/r/WeResist/s/PfS0YS3bLv",
      "created_utc": 1739086436.0,
      "score": 0
    },
    {
      "id": "mbs9lw6",
      "body": "[removed]",
      "created_utc": 1739075592.0,
      "score": -5
    },
    {
      "id": "mbwwbzo",
      "body": "President elon wants to bring South Africans here per government expense. He is offering them refuge.\n\nFucked up !",
      "created_utc": 1739138842.0,
      "score": 0
    },
    {
      "id": "mbsxxfr",
      "body": "[removed]",
      "created_utc": 1739087594.0,
      "score": -4
    },
    {
      "id": "mbrwvux",
      "body": "[deleted]",
      "created_utc": 1739070587.0,
      "score": 0
    },
    {
      "id": "mbs7rgu",
      "body": "[removed]",
      "created_utc": 1739074827.0,
      "score": -38
    },
    {
      "id": "mbsjqip",
      "body": "This country was literally built on white supremacy and slavery, so...",
      "created_utc": 1739080125.0,
      "score": 21
    },
    {
      "id": "mbs7sn6",
      "body": "[removed]",
      "created_utc": 1739074840.0,
      "score": -28
    },
    {
      "id": "mbu3ppv",
      "body": "[removed]",
      "created_utc": 1739109186.0,
      "score": 14
    },
    {
      "id": "mbyb8jg",
      "body": "It would be heartless to travel to Mexico and not feel empathy for the population and how they live. Imagine being born a couple of miles away and have so few opportunities and a substandard quality of life. All because of a border.",
      "created_utc": 1739155793.0,
      "score": 2
    },
    {
      "id": "mbvyucu",
      "body": "Incorrect. This is a controversial conversation in many first world countries. \n\nNow if you were to replace the term “illegal immigration” with “universal healthcare”, your comment would be correct.",
      "created_utc": 1739129165.0,
      "score": 2
    },
    {
      "id": "mbv2g7a",
      "body": "[deleted]",
      "created_utc": 1739120146.0,
      "score": -4
    },
    {
      "id": "mbtcmpr",
      "body": "When did Obama refer to immigrants as “animals” and “vermin”?",
      "created_utc": 1739095909.0,
      "score": 14
    },
    {
      "id": "mbv0ic6",
      "body": "Obama never used scare tactics (calling immigrants derogatory words/phrases), nor did he ask to do cruel things to them (killing, separating babies from moms and families, etc.) He did not stoke racism and white supremacy. They are not comparable. ",
      "created_utc": 1739119601.0,
      "score": 3
    },
    {
      "id": "mbv2hlh",
      "body": "Revolutions make the world change swiftly and suddenly.",
      "created_utc": 1739120157.0,
      "score": 3
    },
    {
      "id": "mbsmhdg",
      "body": "Real. Find your own purpose that matters to you and ride it out til you die. It’s pretty easy once you accept it",
      "created_utc": 1739081483.0,
      "score": 1
    },
    {
      "id": "mbyqx9t",
      "body": "Thank you for your participation in our subreddit. Your post and/or comment was removed due to veering off-topic. Please remember all comments on r/mentalhealth should relate to mental health and how to improve and support it. If you have any questions, please contact the moderation through modmail.\n\nIf you would like to contact the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1739161493.0,
      "score": 1
    },
    {
      "id": "mbs5odx",
      "body": "[removed]",
      "created_utc": 1739073971.0,
      "score": 4
    },
    {
      "id": "mbs8ow0",
      "body": "Native Americans are being held by ICE and threatened with deportation because their tribal paperwork isn’t considered legal. I could be deported by my appearance and speaking Spanish alone. But I was born here, know two languages, and enough world and US history to know even if he doesn’t make it so he can rule for a third term that we’ll be left in rough shape. And the op isn’t a victim, it’s natural fear. This is a mental health page after all.",
      "created_utc": 1739075209.0,
      "score": 5
    },
    {
      "id": "mbs7ig5",
      "body": "[removed]",
      "created_utc": 1739074725.0,
      "score": -5
    },
    {
      "id": "mbsjybu",
      "body": "Yeah they are. Legal residents, harassing us citizens, POC.\n\nYou haven't been paying attention to the news.",
      "created_utc": 1739080228.0,
      "score": 4
    },
    {
      "id": "mbssmlc",
      "body": "[deleted]",
      "created_utc": 1739084716.0,
      "score": 2
    },
    {
      "id": "mbv4a3k",
      "body": "You believe what you’re told.\nThat’s a good little child. \nAfter all Trump declared himself Daddy, and he loves you.",
      "created_utc": 1739120655.0,
      "score": 1
    },
    {
      "id": "mbyr8fv",
      "body": "This isn't the right place for that, but it did make me chuckle.",
      "created_utc": 1739161620.0,
      "score": 2
    },
    {
      "id": "mbv4lbd",
      "body": "[removed]",
      "created_utc": 1739120742.0,
      "score": 4
    },
    {
      "id": "mbymbwj",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1739159696.0,
      "score": 1
    },
    {
      "id": "mbtbje9",
      "body": "That's already been untrue. It's not just illegal",
      "created_utc": 1739095283.0,
      "score": 0
    },
    {
      "id": "mbrxszw",
      "body": "I question their logic, he’s openly racist. My dad never liked him and had my mom not died she wouldn’t either. Both were immigrants who got their citizenship in the 80s but both did well here. And unlike trump, they always paid their taxes.",
      "created_utc": 1739070927.0,
      "score": 21
    },
    {
      "id": "mbs0cup",
      "body": "[removed]",
      "created_utc": 1739071886.0,
      "score": 8
    },
    {
      "id": "mbrzt0i",
      "body": "[removed]",
      "created_utc": 1739071675.0,
      "score": 5
    },
    {
      "id": "mbs28a9",
      "body": "Interesting how you haven’t read this article closely enough to know you’ve misquoted it, the number given is 42%. Also this is a known right leaning organization so it’s possible the numbers are skewed. \n\nI will agree that many Latinos did vote for trump more than what was expected and the economy was a major part. The same could be said about the female demographic, particularly white women. People are often willing to believe obvious lies and overlook things if it seems they might profit in some way, and in a country that is built on individualism and monetary gain it’s sad but not surprising that people are willing to overlook blatant racism, misinformation, criminality and nazi rhetoric because they were told they might save a few bucks in taxes(which is also a lie as basically all economists not connected to the right have said).",
      "created_utc": 1739072604.0,
      "score": 4
    },
    {
      "id": "mbsw5yk",
      "body": "Right, like Twitter and Facebook. Run by a bunch of dirty fuckin' commies",
      "created_utc": 1739086624.0,
      "score": 10
    },
    {
      "id": "mbs7wgo",
      "body": "What, lol?",
      "created_utc": 1739074885.0,
      "score": 19
    },
    {
      "id": "mbsadre",
      "body": "What left wing person owns a news outlet?",
      "created_utc": 1739075918.0,
      "score": 13
    },
    {
      "id": "mbsopgv",
      "body": "[removed]",
      "created_utc": 1739082610.0,
      "score": 1
    },
    {
      "id": "mbv1rrg",
      "body": "STFU",
      "created_utc": 1739119956.0,
      "score": 1
    },
    {
      "id": "mbv878i",
      "body": "[removed]",
      "created_utc": 1739121758.0,
      "score": 6
    },
    {
      "id": "mbvbtsy",
      "body": "[removed]",
      "created_utc": 1739122778.0,
      "score": 6
    },
    {
      "id": "mbv24yh",
      "body": "Or say they’re “poisoning our blood”.",
      "created_utc": 1739120057.0,
      "score": 8
    },
    {
      "id": "mbva7t5",
      "body": "[removed]",
      "created_utc": 1739122327.0,
      "score": 5
    },
    {
      "id": "mbs77ra",
      "body": "[removed]",
      "created_utc": 1739074604.0,
      "score": -2
    },
    {
      "id": "mbv4dlj",
      "body": "Good source",
      "created_utc": 1739120681.0,
      "score": 4
    },
    {
      "id": "mbstf1b",
      "body": "Cherry picking",
      "created_utc": 1739085135.0,
      "score": -7
    },
    {
      "id": "mbs62ui",
      "body": "I have Mexican family members that voted for him because of his “Christian” views. I don’t remember what religion they are, but they worship one god and tell my Catholic mom that she doesn’t worship the right way. Basically, their heads are so far up their asses, they can’t see.",
      "created_utc": 1739074135.0,
      "score": 20
    },
    {
      "id": "mbs6nty",
      "body": "[removed]",
      "created_utc": 1739074377.0,
      "score": -18
    },
    {
      "id": "mbs2267",
      "body": "[deleted]",
      "created_utc": 1739072539.0,
      "score": 1
    },
    {
      "id": "mbshs9r",
      "body": "There's a guy running around in Musk's circle who wants to grind up the poor to use for biofuel... It's not just ethnic cleansing they're after; it's total control of everything.",
      "created_utc": 1739079203.0,
      "score": 1
    },
    {
      "id": "mbs7sj3",
      "body": "**Pot calling the kettle black** 🫖. If you’d read the article closely enough, you’d see it lists its sources—making any “right-leaning organisation” argument redundant:\n> _”Sources: AP VoteCast. CNN - Exit poll results 2024. CNN - Exit poll results 2020. New York Times - Presidential Election Results (by county). Pew Research Center - Key facts about Hispanic eligible voters in 2024. UnidosUS - Summary of Latino support in battleground states in 2024.”_\n\nSo unless you’re suggesting all of these are secretly right-wing outlets, you might want to read a little more closely yourself.",
      "created_utc": 1739074839.0,
      "score": 2
    },
    {
      "id": "mbs8ygj",
      "body": "[removed]",
      "created_utc": 1739075319.0,
      "score": -36
    },
    {
      "id": "mbsdk90",
      "body": "I said run as in operated by, not owned by. Most are owned by conglomerates.",
      "created_utc": 1739077300.0,
      "score": -19
    },
    {
      "id": "mbypo6x",
      "body": "Please just use the report button and block them next time :)",
      "created_utc": 1739160993.0,
      "score": 2
    },
    {
      "id": "mbvcrcj",
      "body": "[removed]",
      "created_utc": 1739123035.0,
      "score": -7
    },
    {
      "id": "mbvqmf7",
      "body": "Exactly. You have to ignore ALOT of trumps rhetoric to say he’s the same as Obama",
      "created_utc": 1739126879.0,
      "score": 6
    },
    {
      "id": "mbxcrmg",
      "body": "Fake news, dude. Politics is my jam. I volunteered for Obama’s campaign. I pay attention. You are lying. ",
      "created_utc": 1739144187.0,
      "score": -1
    },
    {
      "id": "mbv3s4g",
      "body": "[removed]",
      "created_utc": 1739120515.0,
      "score": 1
    },
    {
      "id": "mbstnd4",
      "body": "[removed]",
      "created_utc": 1739085258.0,
      "score": 2
    },
    {
      "id": "mbunhtx",
      "body": "There was a huge Puerto Rican population here that drove around before the election with Puerto Rican flags and his campaign flags on their trucks in a big convoy honking and yelling and everything to show they support him. He is doing nothing useful for Puerto Rico and is actively being detrimental. I don't understand that either. I read an article about the large amount of people that came from Puerto Rico after the hurricane in 2017 and I don't get why they would vote for someone who actively didn't help them and isn't going to.",
      "created_utc": 1739115828.0,
      "score": 4
    },
    {
      "id": "mbsgtwi",
      "body": "And this ☝️ is why I left religion 20-odd years ago. There's no consensus and everyone tries to force you to worship their way.\n\nI had a guy tell me once that when you die and go to heaven your wife becomes your sister, and that having a sinful thought is the same as committing the sin; so I must repent for even have the thought pop into my head (as if I had any control over it)...\n\nAnother person, actually my best friend growing up; his mom believed that if you didn't go to every church service offered and didn't basically spend your entire day worshipping then you'd go to hell. She never had a problem with her husband working full time though, interestingly.\n\nThat along with a bunch of hypocrisy from every other religion caused me to reevaluate my life and decide that I can be a good person without the threat of going to hell when I die being over my head all the time.",
      "created_utc": 1739078766.0,
      "score": 1
    },
    {
      "id": "mbs4kyc",
      "body": "[removed]",
      "created_utc": 1739073527.0,
      "score": 1
    },
    {
      "id": "mbseh9z",
      "body": "Fair enough you’re right, but considering that the person who posted it did so with an lol next to it, misquoted said article and is in this thread calling the opposite party silly names I didn’t feel obligated to. All that plus the fact that this site is known to put a right slant on topics, I think it was fair to doubt. I also did say i agreed with the fact that a large percentage of Latinos did vote for trump against Harris, I just didn’t fully trust the exact number given.",
      "created_utc": 1739077706.0,
      "score": 3
    },
    {
      "id": "mbs9hhy",
      "body": "That’s not what I’m suggesting at all.\n\nI was trying to give OP a little hope. This is a mental health sub.",
      "created_utc": 1739075540.0,
      "score": 25
    },
    {
      "id": "mbtgtu1",
      "body": "I wanted to say something but held myself back in fear of being banned.",
      "created_utc": 1739098325.0,
      "score": 4
    },
    {
      "id": "mbseea7",
      "body": "And what leftists are running the media?",
      "created_utc": 1739077669.0,
      "score": 14
    },
    {
      "id": "mbstvtf",
      "body": "No, you are cherry picking stories in order to make the deportations seem like they are all unjustified.",
      "created_utc": 1739085382.0,
      "score": -6
    },
    {
      "id": "mbs73de",
      "body": "[removed]",
      "created_utc": 1739074552.0,
      "score": -7
    },
    {
      "id": "mbs6a21",
      "body": "[deleted]",
      "created_utc": 1739074219.0,
      "score": -5
    },
    {
      "id": "mbsewmn",
      "body": "That’s fair, well said 🙂",
      "created_utc": 1739077897.0,
      "score": 1
    },
    {
      "id": "mbypana",
      "body": "THIS.",
      "created_utc": 1739160844.0,
      "score": 3
    },
    {
      "id": "mbswk6d",
      "body": "Hilarious. You asked the simplest possible clarifying question, and he just fell apart like wet tissue paper",
      "created_utc": 1739086836.0,
      "score": 18
    },
    {
      "id": "mbsud97",
      "body": "[deleted]",
      "created_utc": 1739085642.0,
      "score": 2
    },
    {
      "id": "mbs9r9l",
      "body": "[removed]",
      "created_utc": 1739075654.0,
      "score": 3
    },
    {
      "id": "mbs80kr",
      "body": "[deleted]",
      "created_utc": 1739074932.0,
      "score": -1
    },
    {
      "id": "mbs83sj",
      "body": "[removed]",
      "created_utc": 1739074968.0,
      "score": 9
    },
    {
      "id": "mbs9w6u",
      "body": "[removed]",
      "created_utc": 1739075711.0,
      "score": 3
    },
    {
      "id": "mbu3bw7",
      "body": "Unfortunately some people are so ignorant that they actually can’t think outside Fox News. It’s wild",
      "created_utc": 1739109040.0,
      "score": 5
    },
    {
      "id": "mbuuwyv",
      "body": "I read NBC article. What it also acknowledges is re-entering the country after being deported is a crime and that's not exactly a rare occurrence. So technically, they could count among those with criminal histories.",
      "created_utc": 1739118008.0,
      "score": 0
    },
    {
      "id": "mbsfipy",
      "body": "[removed]",
      "created_utc": 1739078175.0,
      "score": 1
    },
    {
      "id": "mbse77r",
      "body": "[removed]",
      "created_utc": 1739077582.0,
      "score": 1
    },
    {
      "id": "mbs8p5b",
      "body": "[removed]",
      "created_utc": 1739075213.0,
      "score": -3
    },
    {
      "id": "mbs8hlf",
      "body": "[deleted]",
      "created_utc": 1739075125.0,
      "score": 0
    },
    {
      "id": "mbsgbj7",
      "body": "[removed]",
      "created_utc": 1739078536.0,
      "score": 1
    },
    {
      "id": "mbsfuh0",
      "body": "[removed]",
      "created_utc": 1739078321.0,
      "score": 2
    },
    {
      "id": "mbshwsn",
      "body": "[removed]",
      "created_utc": 1739079260.0,
      "score": 1
    }
  ]
}