{
  "id": "1f6kssr",
  "title": "It’s a crime to be a girl ",
  "selftext": "It’s a crime to be a girl in my country India. I have never ever tried defaming my country but with everything going on around and that constant fear what if something bad happens it is really scaring me a lot. I have been considered as a burden in my own family and this safety thing has always been there. I do have some really horrifying experiences too and with each passing day I feel this “It’s a crime to be a girl! It’s a crime to hope for a justice in my country!” I am even writing all this with shivering hands, sorry if I hurted anyone’s sentiments but as an Indian girl it’s utmost painful to even say this! ",
  "created_utc": 1725213841.0,
  "score": 382,
  "num_comments": 60,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1f6kssr/its_a_crime_to_be_a_girl/",
  "comments": [
    {
      "id": "ll0wxus",
      "body": "I swear to god. No matter how positive you try to keep yourself, you're hit with the most inhumane things hapenning to women in this country every single minute. \n\n\nIt gets scarier when you see the country out and protesting for a heinous crime, but no suspects are arrested and are roaming around freely. ",
      "created_utc": 1725214568.0,
      "score": 170
    },
    {
      "id": "ll1lx1d",
      "body": "Life can’t even exist without women. It’s ridiculous how women are treated. Women grow men in the womb.",
      "created_utc": 1725223034.0,
      "score": 16
    },
    {
      "id": "ll0zt15",
      "body": "Its not a crime to be a girl. \nYour post reminded me of these words I read- “sometimes we have to seek therapy to tolerate those around us who would not seek therapy”. \nBut what do you do when the whole nation is living under a rock. I left India more than a decade ago, and moved to US permanently. \nI did not realize things were NOT ok while living in India- because I was blind. I was living under a rock too. I felt this is normal. (Almost) All MEN stare at females. Almost every female is eve teased. This is NORMAL- yeh toh hota hee hai. I have to wear a dupatta/ odhni properly over ALL my kurtas (with jeans) or else It would not look ‘proper’.\nI was not even 20- and I accepted this way of living. \nThen I moved to California and realized - ohhhhh, so this is WHAT A FREE COUNTRY FEELS LIKE?? Holy shimmmizzles!!! 🥺\nI am sorry to all the females living in the Indian subcontinent- but yall are not free. I know you guys can taste a bit of independence, when your Ministers,\nMedia, employers, papas or husbands assure you they are there for you. But that is not Independence? India is not independent from the regressive, misogynist chains and it may take a couple of centuries to break them. \nHang n there. I am so sorry you feel it. I totally understand where you are coming from coz most of the women have been there- I have been there too. But we cannot help it. No amount of media uproar, worldwide negative inputs, or change of political parties can change the nation. This is so deep rooted that a complete eradication is impossible - atleast in this lifetime. \nI do not want to suggest it - but try moving away my dear!! Move to lesser known regions in Europe. Get away. Work on your education and career to get you out. Do not rely on NRIs to wed you out. Be who you are without anyone’s help. You’ll be proud if you do that. Never compromise!! Gosh I can go on forever with this- but I should stop my rant! 😔",
      "created_utc": 1725215543.0,
      "score": 36
    },
    {
      "id": "ll1ixxp",
      "body": "I am an Indian girl too and I second your thoughts. \n\nI feel the same and had my own set of traumatic experiences. It is a crime to be born as a woman in this country.\n\nAnd so far I feel that there is no escape at all. \n\nI also feel the anxiety, fustration and helplesness that you mentioned.\n\nAs a fellow indian girl, all I can offer is some time, my DMs are open for you if you want to share anything. Or just need to vent. \n\nPS I would never say that marriage or having children would be the solution to the insecurity that you feel in this country.",
      "created_utc": 1725222032.0,
      "score": 10
    },
    {
      "id": "ll161ei",
      "body": "Honestly India along with Pakistan and Bangladesh is in a state at the moment. It’s awful.\n\nOther countries it’s slightly better due to CCTV cameras everywhere and all sorts. The chances of you getting a case sorted out is miles better than India Pakistan and Bangladesh. So I’d definitely suggest maybe the US or UK or even like Singapore is amazing with how they deal with crimes. But yeah it’s horrifying to be honest",
      "created_utc": 1725217655.0,
      "score": 9
    },
    {
      "id": "ll1abyi",
      "body": "Praying for equality and peace!",
      "created_utc": 1725219122.0,
      "score": 6
    },
    {
      "id": "ll39xrc",
      "body": "I didn't know the situation in India, but my friend from Mumbai said he wouldn't want his kids to grow up in India. Women rights are probably terrible, and I'm so sorry to hear this. I can only wish for you that you become an independent woman and find a better place. You must believe that you are wanted and you are welcomed. My chinese family has also made me miserable multiple times, but at least I know what I gonna do differently from my parents. I live in Germany, but in China, I would be unhappy as well. Don't let your self-esteem be determined by ignorant people. Your suffering makes you beautiful.",
      "created_utc": 1725246031.0,
      "score": 4
    },
    {
      "id": "ll105pi",
      "body": "Maybe try fleeing the country",
      "created_utc": 1725215662.0,
      "score": 12
    },
    {
      "id": "ll17ihx",
      "body": "i totally agreee...",
      "created_utc": 1725218158.0,
      "score": 3
    },
    {
      "id": "ll2jpyp",
      "body": "Get out of India! There are places where you have more liberties!",
      "created_utc": 1725235401.0,
      "score": 3
    },
    {
      "id": "ll2raum",
      "body": "Time to leave India then",
      "created_utc": 1725238394.0,
      "score": 3
    },
    {
      "id": "ll31x2h",
      "body": "Are you in Kolkata? This has been an extremely difficult and triggering time indeed. I don't even know what to say, but sending you tons of love",
      "created_utc": 1725242657.0,
      "score": 3
    },
    {
      "id": "ll9ry1s",
      "body": "I have gone through what you mentioned and what you didn't.\n\nI can tell you only one thing.\n\nIt is our right to live freely, no matter what.\n\nAnd try to do it.\n\nBut always always know, if someone is gonna do something inappropriate, he/she should not go without punishment.\n\nCarry something always. \nAnd learn about the weak points.\n\nI know it's very easy to talk but when we go outside we get that fear.\n\nPeople are gonna scare more when they see the fear in our eyes. \n\nSo dont.\n\nIt's not a crime. We have full rights. I love you. I don't care what your parents or relatives think. You are precious.\n\nBelieve it and live like it. We are human in this life. Kya pata we become frogs next. \n\nSo dont ever try to put your happiness apart for even one minute ❤️",
      "created_utc": 1725347834.0,
      "score": 3
    },
    {
      "id": "ll1rwlw",
      "body": "😭💔🫂",
      "created_utc": 1725225045.0,
      "score": 2
    },
    {
      "id": "ll1uvsl",
      "body": "We love you OP!",
      "created_utc": 1725226069.0,
      "score": 2
    },
    {
      "id": "ll2q27j",
      "body": "😞🫂",
      "created_utc": 1725237903.0,
      "score": 2
    },
    {
      "id": "ll3sydj",
      "body": "I'm very sorry for what you're going through. Please don't feel guilty. It's not your fault you live in such a place.",
      "created_utc": 1725255550.0,
      "score": 2
    },
    {
      "id": "ll4asrp",
      "body": "Your country is defaming itself. Sorry you’re in this situation.",
      "created_utc": 1725266966.0,
      "score": 2
    },
    {
      "id": "ll608c8",
      "body": "I feel the same. I love my Indian culture but I am happy to appreciate it from a different country where I'm not constantly scared for my life. I'm moving out as soon as possible",
      "created_utc": 1725294092.0,
      "score": 2
    },
    {
      "id": "ll62duw",
      "body": "It should never be a crime to be who you are. If you just want someone to listen you can dm me any day. Im no miracle doctor, but maybe I can be of help. I wont judge",
      "created_utc": 1725294799.0,
      "score": 2
    },
    {
      "id": "ll67h61",
      "body": "Stay safe, get pepper spray, personal alarm and maybe a good taser.",
      "created_utc": 1725296462.0,
      "score": 2
    },
    {
      "id": "ll7huf5",
      "body": "I'm sorry I wish the world say the potential you have and fuck your country if they are doing that I'm sorry but damn I hope ur life goes amazing to the point your family sees wut the burden has become I'm sorry tho I wish I could help but I'm on the other side of the world",
      "created_utc": 1725312037.0,
      "score": 2
    },
    {
      "id": "ll9d8tj",
      "body": "I feel so bad for all the girls and women in India. I'm not saying my country is any better, but it's not as bad as India. It must be so overwhelming and terrifying for you to live there for so long. I hope you can leave as soon as possible. Stay safe.",
      "created_utc": 1725338982.0,
      "score": 2
    },
    {
      "id": "ll9uzcy",
      "body": "I'm so sorry.  This is truly relatable.\n\nI'm in the US and still...we're treated like criminals in many scenarios.  My personal experience...well, I wound up with complex PTSD because of it.\n\nI can't even begin to imagine what it's like in India and elsewhere, but my heart is with you.\n\nMay you be safe and well (as possible.)",
      "created_utc": 1725349917.0,
      "score": 1
    },
    {
      "id": "ll0wiqw",
      "body": "[removed]",
      "created_utc": 1725214426.0,
      "score": -6
    },
    {
      "id": "ll1ltzn",
      "body": "I have personally been thinking about this throughout the years. Over here women have it extremely well. But too many do not appreciate any of it and are behaving so poorly that I do not want to be with them. I would love to be the husband of a woman from a place where women are treated so poorly and bring them here to safety and a peaceful life to study and live a great life. \n\nMaybe you should begin thinking of something like this. To trade your place of birth for something better. There are so many men around here who would love nothing more than you. If possible, you could look for a school in Europe somewhere, make more friends and make a better life. In five years you could already be at work in some very nice place with some very nice people, in a place where you are left alone or better, loved like the best thing in the world. Think about it, seriously. I hope you have this kind of an opportunity.",
      "created_utc": 1725223006.0,
      "score": -9
    },
    {
      "id": "ll1j6d1",
      "body": "[removed]",
      "created_utc": 1725222112.0,
      "score": -3
    },
    {
      "id": "ll1l9y9",
      "body": "Let me write you a poem then as it may calm you:\n\nAs hard as the mountains are, as silent and strong, they are\nThey need a wind, a breeze, perhaps \nAnd a breeze that calms the suffered mountain \nAnd the lost traveler in the desert\nis a woman\nAnd no matter how mighty ocean waves are\nThey thirst the clam hands of the shore\nAnd the shore is a girl\nA woman is all\nA girl is nature \nAnd life starts in a woman\nAnd finds its meaning and nature in nature\nAnd a woman calms the mountain and the waves\nAnd nourishes nature.\n\nSorry if it's not the best poem you can hear as I got a little dizzy. I need to rest.hope you like it there.",
      "created_utc": 1725222819.0,
      "score": -3
    },
    {
      "id": "ll32n2b",
      "body": "So you come to reddit?",
      "created_utc": 1725242954.0,
      "score": -8
    },
    {
      "id": "ll0xuwj",
      "body": "Yeah exactly it’s kinda makes me feel helpless yk since childhood there’s always been rules advices precautions and what not i was kinda made to feel as if being a girl i have to be this way to be safe to always prove myself and no matter what you do there’s always a constant fear in mind while going out now I won’t even say that we are safe in our homes as well… it’s sooo soo scary that I feel like as a kiddo i used to think “Life will be like fairytale and now it’s more of like a worst nightmare”!! \n\nWhat is even worse is we only get blamed and monsters who does all these heinous crimes are roaming freely probably feeling proud and motivated to commit more crimes… I guess this isn’t what I wished my country my world to look like yk!! 😭💔",
      "created_utc": 1725214880.0,
      "score": 54
    },
    {
      "id": "ll3wmxf",
      "body": "That’s why they do it. They’re afraid.",
      "created_utc": 1725257729.0,
      "score": 3
    },
    {
      "id": "ll10zt8",
      "body": "Damnn!!! Girl you’re so much right I must agree tbh! Yes I have been thinking of going elsewhere abroad i am not sure exactly where but yes I am planning to. I want to be independent and not merely wait for an NRI to marry tbh I agree with your tbh every single point that you mentioned. Things are getting way harder here! I have my younger sister staying in different state and her worries sometimes scare me like anything i won’t lie! I have always been the person who everytime supported loved her country but this scary thing is really becoming more hauntful tbh it’s not even any particular case I am pointing too it’s legit a lotttttt of such things happening not only with others but even I have experienced something really really horrible! Those eve teasers those scary stares that comstant fear that someone might be following me i can’t even say in words what does it feel like! And you are absolutely right this isn’t Independence at all!!!! No one is safe if I have to tell honestly!! And thanks a lot for understanding me it truly means a lot to me 😭❤️‍🩹",
      "created_utc": 1725215948.0,
      "score": 13
    },
    {
      "id": "ll593vc",
      "body": "Everyone's rights suck in that country. There's just so much horridness that will effect averyoine",
      "created_utc": 1725284905.0,
      "score": 1
    },
    {
      "id": "ll11dss",
      "body": "Yeah I am planning to it can happen once I am working for few years once here but yeah that’s in my list!!",
      "created_utc": 1725216081.0,
      "score": 23
    },
    {
      "id": "ll43ruo",
      "body": "I am in Mumbai and thank you so much for being kind to me 🥹😭✨",
      "created_utc": 1725262200.0,
      "score": 2
    },
    {
      "id": "ll122ug",
      "body": "Dude... You have no idea. The data doesn't match because it is a massively missoginistic country that is run by old men, like here, but their treatment of women is \"normal\" there. The men do not report a crisis. They think there is an issue with women. You are talking out of left field. Her take is the same take most young women in India have.",
      "created_utc": 1725216316.0,
      "score": 8
    },
    {
      "id": "ll0zs0h",
      "body": "I know logically it might not be but remember we are that country where being born as a girl is considered as a sin and a liability and let me tell you this isn’t my story only that’s a story of tons of people out there even my friends even some strangers i personally interacted with and have seen too! Rest I feel be it molestation  or any form of harassment India is not behind more than 80% of women face sexual harassment but only 1% is reported to the police so ofcourse there’s a lot of things lot of pressure that a girl has to go through. It’s always like girls are told to be restricted always adviced and if she obeys everything then also there’s no full sure proof that she will be safe! Not even 6 months old baby not even 80 year old woman be it any form of dress any age anything it’s all seem like a fault with gender and writing this requires a lot of strength honestly!! \n\nAnd tbh Justice in India is more likely available to only rich people with political backing commoners have no value! It’s just mere another murder another SA just a mere Number for that sake! \n\nAnd the point here isn’t to compare any country with any other country the point is we don’t feel safe we are scared always like it’s always like we need a shield always and many people even say “She is a girl it must be her fault even before reading the full story!” So the problem isn’t any one thing there are a tons of things responsible for these things!\n\nNow coming to my family yes I have been doing a lot and I don’t personally think I am a liability but even if I am well I don’t need to prove anyone what I am cause some people never ever get satisfied no matter what you do for them and again it’s not only my personal issue i have heard similar things from a lot many other people!",
      "created_utc": 1725215533.0,
      "score": 6
    },
    {
      "id": "ll2neqo",
      "body": "You have no self awareness if you think anything you just typed is normal/not creepy, nobody is going to want to marry you lol I guess all those women you supposedly \"don't want to be with\"  really dodged a bullet.",
      "created_utc": 1725236854.0,
      "score": 8
    },
    {
      "id": "ll24akq",
      "body": "she's not going to marry you for citizenship bro",
      "created_utc": 1725229496.0,
      "score": 4
    },
    {
      "id": "ll2tfrl",
      "body": "[removed]",
      "created_utc": 1725239241.0,
      "score": 6
    },
    {
      "id": "ll1opgg",
      "body": "Buddy, wtf? I think you might need to unpack this in therapy.",
      "created_utc": 1725223970.0,
      "score": 7
    },
    {
      "id": "ll1mz5h",
      "body": "This is the worst advice I have ever seen. Reading and writing won't keep your mind calm when you are constantly in danger. This isn't someone being irrational, but a completely valid reaction to the horrible treatment of women in India. An education won't protect you from being raped or otherwise mistreated.\n\n\nEmotions aren't a waste of time, nor are they a choice. They are a natural, evolutionary response. Fear is a healthy thing. It keeps us safe.",
      "created_utc": 1725223390.0,
      "score": 6
    },
    {
      "id": "ll26cai",
      "body": "what makes you think OP isnt educated? what makes you think that this paralyzing fear she has is because she's illiterate and overly emotional and not because of maybe the pervading rape culture that haunts all of the subcontinent? plenty of rapists are very educated too, literally one of the legal cases i handled was against someone in a phd program. couldn't educate away his misogyny could we? \n\ndo you do this to everyone or just people from the 3rd world so you can be sanctimonious?",
      "created_utc": 1725230246.0,
      "score": 2
    },
    {
      "id": "ll124mc",
      "body": "I hope you get the chance to move somewhere safe and flourish and find your fairytale xx",
      "created_utc": 1725216332.0,
      "score": 26
    },
    {
      "id": "ll188hv",
      "body": "Yes. What you are feeling is soo REAL. I wish ALL females in India had the SAME realization. But most of us are inherently (subconsciously) raised by the patriarchal society to “wear this” and not that. Look decent. Talk politely like “this”. Do not laugh out loud. Sit like a girl. Eat properly… Imagine ALL MEN learning these things too- in a country like India. Just IMAGINE. That’s a distant dream. \n\nIt’s so sad (and funny) when I hear/ read/ see my best friends sharing 15th August “Happy Independence” posts online or Indian politicians bragging on how India is so advanced in XYZ. You can “fool” yourselves at times but do not get entangled in “apna desh, apne log” bullshit. \n\nLook at an accident on an Indian road next time. Look how janta behaves. People would circle around. Make videos. And literally “watch” someone die (dekho dekho- kaise marrr raha hai.. dekhhho). No one would   HELP.  Police ka chakkar ho gya toh? That’s inhumane. Little girls are getting molested/ raped in every state- every hour. \n\nIrony is.. “insaniyat”, humanity, humility forms the core of every Hindu/ Muslim/ Sikh’s cultural/ religion’s teaching- and YET, here we are. Can you FEEL my anger, yet? Haha.\n\nAt least in “modern”, “besharam” Independent Western countries people have the “decency” to call an ambulance ( US) if they see a road-accident. Strangers have not yet molested me ONCE when I walk my dog ALL ALONE at 10pm. My male colleagues don’t make indecent comments. I have NEVER seen a man STARING lustily, or rubbing his prick in public out here- but I have only lived here 15 years.. so maybe the “BAD, gora, videshi, non-sansskaari” men all are still HIDING and plotting against a “bechari, abla Indian woman”. \n\nGirl, bottom line- get OUT.\n\nIndia is sadly still a Third world nation- and not even at the boiling frog stage (Google the meaning of this metaphor). 😔",
      "created_utc": 1725218405.0,
      "score": 6
    },
    {
      "id": "ll11s7k",
      "body": "Yes, please get out when you can. You deserve a great life. Rooting for you",
      "created_utc": 1725216216.0,
      "score": 15
    },
    {
      "id": "ll1tgti",
      "body": "Praying you make it out safely. Praying for every girl and woman in India",
      "created_utc": 1725225579.0,
      "score": 6
    },
    {
      "id": "ll3a16d",
      "body": "Come here to Germany 🇩🇪.",
      "created_utc": 1725246071.0,
      "score": 2
    },
    {
      "id": "ll5lb4y",
      "body": "Ah, opposite end of the country. Oh we are all struggling in these hard times. We are all we got. Hope you feel better soonest 💖",
      "created_utc": 1725289172.0,
      "score": 1
    },
    {
      "id": "ll13cf5",
      "body": "Exactly! You don't need to do anything to prove you are worth being protected and safe! You deserve love and care and safety innately. I hope you find new friends and family and found-family in a new safe place and you get to find the joyful opportunities you deserve.",
      "created_utc": 1725216743.0,
      "score": 2
    },
    {
      "id": "ll7ywgv",
      "body": "I wasn't looking to marry her, since I don't know her. I am however looking to marry someone who isn't toxic and wants a nice life they can appreciate.",
      "created_utc": 1725318227.0,
      "score": 1
    },
    {
      "id": "ll31p4p",
      "body": "Exactly!",
      "created_utc": 1725242567.0,
      "score": 3
    },
    {
      "id": "ll3c7dy",
      "body": "Thanks a lot 🥹 I hope other women of my country also move to some place where they would feel safe! Cause staying 24*7 in fear is just so horrifying…!!",
      "created_utc": 1725247010.0,
      "score": 9
    },
    {
      "id": "ll3dgpv",
      "body": "Yes I can totally understand and relate a lot! Whole life I was told to be like this or be like this and I repeat every single time I was made to feel if you don’t be like this then something bad might happen to you hence I took all possible precautions but still something really bad happened? My question only was WHY??? And worst part is I am not even allowed to talk about it you know how much courage it takes to talk about something this sensitive!! I have always been that citizen that girl who used to feel proud of my country and yes there are lot of good things in my country about which I am grate for but let me be very frank! Safety is a basic necessity for every single human being (not even talking about any particular gender) but here in India it all seems like a luxury available to only RICH people who are backed by Indians! And no I am not talking about crimes against women I am talking about every single crimes happening here be it accident be it SA be it anything tbh!!! Yes, for me going abroad is now a must to do list though it might be difficult and challenging to go to a new country all by myself but somewhere you know I wish i could take all women out here with me i feel sometimes i even feel should i go to another planet or something to feel safe for 1 day fully please!!? \n\nInsaniyat is a myth here though not 100% but yes a most part of it!! Ppl make videos and photo of accidents of victim of crime but no one thinks of helping here!! Everyone says “You are a girl learn to protect yourself!” \n\nI won’t lie earlier I used to be afraid of street dogs now if they are there I feel bit safe and feel more scary when I see strangers out there staring like hell!",
      "created_utc": 1725247579.0,
      "score": 4
    },
    {
      "id": "ll9qu11",
      "body": "yes, i really recommend going to a much safer country, india is not really progressive in terms of female rights. i live in Canada, i can recommend it, it is much more peaceful and women’s rights are one of our most prized values. the nordic countries like sweden, finland and denmark are also very good countries, even if the language is difficult to learn. i hope you get out of this hell as soon as possible. sending virtual hugs 🫂",
      "created_utc": 1725347106.0,
      "score": 2
    },
    {
      "id": "lqa13tt",
      "body": "even as a guy ima leave this hell and shift to a better country and btw is canada good?",
      "created_utc": 1728036885.0,
      "score": 1
    },
    {
      "id": "lqcrgpu",
      "body": "definitely better than India if you’re talking about human rights. as for the economy, it’s on a bad trend, but probably fine. the housing market is all over the place, so that’s pretty bad. i do still recommend going over to canada, compared to india. oh and also, our modern culture is so centered around minorities and immigrants that people love them more than citizens lol, but that’s a positive for you",
      "created_utc": 1728072479.0,
      "score": 1
    },
    {
      "id": "lqfgy71",
      "body": "that's cool to hear then \nwell yea even as an indian i absolutely prefer the culture of there more and i js LOVE it lol",
      "created_utc": 1728117931.0,
      "score": 1
    }
  ]
}