{
  "id": "1ki4gom",
  "title": "I think my dad is trying to tell me something",
  "selftext": "Lol",
  "created_utc": 1746747032.0,
  "score": 678,
  "num_comments": 38,
  "url": "https://i.redd.it/91p81fcq7nze1.jpeg",
  "comments": [
    {
      "id": "mrc52w8",
      "body": "that's really thoughtful. you're lucky.",
      "created_utc": 1746748829.0,
      "score": 218
    },
    {
      "id": "mrcgf6a",
      "body": "ADHD has a genetic component and by flagging this, it could be that he understands some aspects himself and recognizes that the article might resonate with you. I think it's possible that the gesture was probably not judgemental, otherwise he might have chosen something more critical or dismissive of neurodivergence. \n\nI can say that as someone who got a dx for ADHD at 38, it was the best thing that ever happened to me, because I was able to make lots of changes that reduced *the struggle*. My parents were not informed, and were part of a world that saw ADHD symptoms, and perceived misbehavior or lack of effort. \n\nI'm envious of your experience, to be honest, because you are being given some information and an opportunity to decide what to do with it. I hope you can get something positive out of the experience.",
      "created_utc": 1746753052.0,
      "score": 90
    },
    {
      "id": "mrdie58",
      "body": "That’s so sweet my parents just called me a pathetic weirdo and a freak for a disorder they gave me 😂🤷🏼‍♀️",
      "created_utc": 1746769430.0,
      "score": 14
    },
    {
      "id": "mrdw7y3",
      "body": "Oh to have a dad who cares 😭",
      "created_utc": 1746777755.0,
      "score": 12
    },
    {
      "id": "mrdeltb",
      "body": "[deleted]",
      "created_utc": 1746767439.0,
      "score": 13
    },
    {
      "id": "mrc81d5",
      "body": "Yes that’s how we parents hint for you to get your shit together. It’s just because we love you albeit passively aggressively.",
      "created_utc": 1746749937.0,
      "score": 22
    },
    {
      "id": "mremdsy",
      "body": "When I was diagnosed, I was kinda scared of my family's reaction for some reason. I thought they would dismiss it, tell me I am just \"collecting\" diagnosis or things like that.\n\nMy mom found out 1 day before me because she had a session with the professional who was diagnosing me to talk about my childhood and school years. She told my dad because that day he pulled me aside at work. He told me that I shouldn't let things define me, that I am more capable than what I give myself credit for, that he is proud of me.\n\nThe next day I got my diagnosis and understood what happened. I am so glad things went down the way they did.\n\nYou are lucky, cherish your dad, he means very well",
      "created_utc": 1746792178.0,
      "score": 7
    },
    {
      "id": "mrg45qg",
      "body": "That's better than \"there's nothing wrong with you, you're just going through a crappy time\" approach as well.",
      "created_utc": 1746809810.0,
      "score": 5
    },
    {
      "id": "mrduko6",
      "body": "This made me smile. What a good'un 💜",
      "created_utc": 1746776714.0,
      "score": 2
    },
    {
      "id": "mrgj2fb",
      "body": "How kind of him.",
      "created_utc": 1746814286.0,
      "score": 2
    },
    {
      "id": "mrh3agn",
      "body": "Could be like my parent(s) where there’s nothing wrong with them, what’s wrong is all of modern mental health knowledge. Then due to this train of thought, they cope with alcohol and then continue the cycle of abuse and project onto me and give me CPTSD. 👍",
      "created_utc": 1746820510.0,
      "score": 2
    },
    {
      "id": "mrqnwn2",
      "body": "My dad swept it under the rug when my GP told him there’s something not right with me when I was a toddler. And When I told him I might have ADHD at 14, he said ‘are you saying you need to go to a psych ward?’ Or something to that effect. Count yourself lucky, bro. Your dad’s choosing your well-being over his vanity and reputation unlike mine.\n\nI’m 22. Now, I ruined my life unintentionally over and over again and I didn’t even realise it was a problem until my mum told me about what my GP said last year after my dad passed.\n\nTook her nearly 20 fucking years to tell me this shit. This is the family who I love dearly but also despise, bro. \n\nBut I got an appointment coming up soon :). Get yourself checked bro don’t delay it. The sooner the better",
      "created_utc": 1746967207.0,
      "score": 2
    },
    {
      "id": "mrst3c6",
      "body": "Unfortunately, many people who aren’t aware of mental health conditions still dismiss the signs as bad parenting, rebellion, or even something spiritual like possession. I’ve lived through that. I went 15 years undiagnosed, constantly being misunderstood and mislabeled. Getting a diagnosis was the turning point that helped me become a somewhat functional adult, finally understanding myself instead of blaming myself.\n\nI think it’s encouraging that your dad offered you something informative instead of dismissive. Even if he doesn’t fully understand it all, the fact that he’s willing to start the conversation is a big deal. I hope this opens doors for you, and that your path is a little smoother than mine was. You deserve that.",
      "created_utc": 1746993044.0,
      "score": 2
    },
    {
      "id": "mrgr9am",
      "body": "He knows there's something wrong with you",
      "created_utc": 1746816778.0,
      "score": 1
    },
    {
      "id": "mrh238t",
      "body": "wow ive been wanting to tell my dad the same thing lol",
      "created_utc": 1746820142.0,
      "score": 1
    },
    {
      "id": "mrjzzpv",
      "body": "That \"dad\" at the end made me roll",
      "created_utc": 1746863130.0,
      "score": 1
    },
    {
      "id": "mrustdd",
      "body": "He could be telling you something or can see that you have similar symptoms as others. Regardless, this is really kind to see. You might feel less alone and earn knowledge. I wish you the best in life. 👏 Also, other mental illnesses have similarities. Just LYK in case you aren't diagnosed, but either way, you can always learn from someone else.",
      "created_utc": 1747019467.0,
      "score": 1
    },
    {
      "id": "msaffng",
      "body": "Everyone has ADHD now",
      "created_utc": 1747238067.0,
      "score": 1
    },
    {
      "id": "mscrjkj",
      "body": "Funny how we all perceive/ react to things differently.  So many people here think this is a great approach ( and in your case, maybe your father has a good sense of your communication style and probably did the right thing.) As for me ( and older adult with ADHD), I'd prefer someone to say straight to my face : \" Have you ever thought that you might have ADHD?\" I get very aggravated when people tiptoe around things and aren't direct. But again,  different strokes... The important thing is, your father cares about you, is concerned,  and obviously gave great thought to how he'd broach the subject. ",
      "created_utc": 1747263132.0,
      "score": 1
    },
    {
      "id": "mshccev",
      "body": "This made me smile. Subtle dad move with surprisingly solid follow-through. My wife was diagnosed with adult ADHD in her mid-30s after years of just \"powering through\" and wondering why everything felt a little harder than it should. Once she finally brought it up with her doctor and got treatment, it was like flipping on a light switch in a room she didn’t even know was dark. Her quality of life improved in a huge way—less stress, more peace, and a lot more self-compassion.\n\nSo if this post-it note leads to a conversation, or even just curiosity, it could be the start of something really helpful. Go, Dad.",
      "created_utc": 1747329555.0,
      "score": 1
    },
    {
      "id": "mu67ib0",
      "body": "Hi, happy to see you have your father who cares for you",
      "created_utc": 1748181444.0,
      "score": 1
    },
    {
      "id": "mrc0svv",
      "body": "[deleted]",
      "created_utc": 1746747290.0,
      "score": -4
    },
    {
      "id": "mrdk90t",
      "body": "Your dad is a legend!",
      "created_utc": 1746770469.0,
      "score": 29
    },
    {
      "id": "mrflqao",
      "body": "Yes! I know. This is actually not typical of him. Saving this as a keepsake in a box lol",
      "created_utc": 1746804195.0,
      "score": 24
    },
    {
      "id": "mrcpyp3",
      "body": "I was diagnosed at 39. My mom refused to even have me tested for ADHD because \"I could play with Legos for hours\" when I was a kid...\n\nAnyway, going to a psych and getting myself diagnosed was the best thing I did for myself in the past year, and I didn't know how badly I struggled until I started taking a low dose of Ritalin and eating a little better.",
      "created_utc": 1746756604.0,
      "score": 20
    },
    {
      "id": "mrfm71j",
      "body": "That's how I grew up too lol. I'm 31 now though and very moved by this almost haha",
      "created_utc": 1746804338.0,
      "score": 5
    },
    {
      "id": "mrfm3uk",
      "body": "Believe me it wasn't always this way. This is very atypical behavior for him. Keeping this article as a momento haha",
      "created_utc": 1746804311.0,
      "score": 2
    },
    {
      "id": "mrflxvr",
      "body": "They were those parents too. But at 31 I'm just really tickled by the thought lol",
      "created_utc": 1746804259.0,
      "score": 1
    },
    {
      "id": "mrh2mi8",
      "body": "the fact that my mom said those exact same things to me from the 1st paragraph when i told her 😀 im glad ur parents did better tho :3",
      "created_utc": 1746820305.0,
      "score": 4
    },
    {
      "id": "mrfn1sj",
      "body": "Love this!",
      "created_utc": 1746804599.0,
      "score": 2
    },
    {
      "id": "mrg4exg",
      "body": "Agreed. When I was a kid they told me to just \"pray\" about it when it got too hard. Lol so this was a very pleasant surprise for me haha",
      "created_utc": 1746809887.0,
      "score": 2
    },
    {
      "id": "mrfm8ba",
      "body": "It made me smile too",
      "created_utc": 1746804349.0,
      "score": 1
    },
    {
      "id": "mrgp523",
      "body": "I thought so too",
      "created_utc": 1746816133.0,
      "score": 1
    },
    {
      "id": "mrgsoyq",
      "body": "The mailman knows there's something wrong with me.",
      "created_utc": 1746817218.0,
      "score": 2
    },
    {
      "id": "mrk5vme",
      "body": "Hes a character lol",
      "created_utc": 1746866761.0,
      "score": 2
    },
    {
      "id": "mrcr6ji",
      "body": "Don’t give out your high school name on the internet, that’s super unsafe!",
      "created_utc": 1746757056.0,
      "score": 10
    },
    {
      "id": "mrfmbx4",
      "body": "The cardinal is for Saginaw valley state university",
      "created_utc": 1746804380.0,
      "score": 1
    },
    {
      "id": "mrhpooq",
      "body": "I am so sorry :/\n\nI heard that when I got my bipolar one, it was tough.",
      "created_utc": 1746827622.0,
      "score": 2
    },
    {
      "id": "mrg50d0",
      "body": "Yea IDK I don't have ADHD, I have EFD. It may as well be treated like nothing because in general it is.",
      "created_utc": 1746810065.0,
      "score": 1
    }
  ]
}