{
  "id": "1jk6hsj",
  "title": "My 11 year old sister draw this",
  "selftext": "What are your thoughts? We asked her what inspired her and she just said i don't know. She doesn't watch horror movies and said she hasn't seen anything on her YouTube or tiktok about it or played any horror games on roblox.",
  "created_utc": 1742975281.0,
  "score": 389,
  "num_comments": 107,
  "url": "https://i.redd.it/svzucdidozqe1.jpeg",
  "comments": [
    {
      "id": "mjsxlbo",
      "body": "As My personal experience raising 3 child: This is completely normal. I think this is way to going through some scary content that she has seen somewhere. I give couple exmples what my 6yo is doing: Her sister likes makeup and special effects. They watch videos together, then younger one tells me that someone did really scary makeup with scars and blood. Younger one doesnt like blood at all. Next Day they did some special makeups by drawing scars and blood to masking tape, and stick those to themself. I played along and asked what happened. Kid just giggles and told me its just makeup and not real. I think its better to ask frequently whats going one on with pictures. Like What happened here, thats a bit scary.  Because thats IS actually  a story. Ofc Ask about other drawings too, Even those that are not violent, then its feels safer to do those scary images too.",
      "created_utc": 1742979319.0,
      "score": 220
    },
    {
      "id": "mjsynwh",
      "body": "when i was around this age, personally, id draw and hide (specifically hiding it which seems important) things like this but i was going through a lot. had been sa'd and was being bullied at school to extremes amd heavily threatened to stay quiet. i \"luckily\" never had my drawings found. but they were gruesome and sad. i didn't watch horror or see much of anything like that. sometimes this is a way for kids to cope. personally, i think this shouldn't be shamed or discouraged. i would encourage her to draw/paint/ create however she see's fit. it could be that she just simply wanted to draw this. maybe a cute boy/girl likes horror and they draw like this. it could be so simple. but to see her art, its important to not make her feel bad, guilty, shameful, ect. art is a beautiful and deep important way to express yourself. it speaks to parts of the body and mind words can not. and thats not just a saying, its psychologically true. proven. and important. if she feels shunned, her growth and needed prosessing could be stopped and/or stunted in ways you cant see. please please please let her draw. please let her express. please give her a private journal to do this. let it be for herself. she needs that. she has to already feel scared or annoyed at the least that something private was shown. definitely concern is understandable. i get that. not saying youre wrong ♡ just please make sure to be gentle with this.",
      "created_utc": 1742980026.0,
      "score": 31
    },
    {
      "id": "mjsut81",
      "body": "She's an artist, this disturbing arts at this age are just unthinkable ( I think she is watching scp videos )",
      "created_utc": 1742977451.0,
      "score": 141
    },
    {
      "id": "mjtm988",
      "body": "“We saw no signs” \n\nIm just kidding i think most kids draw like this",
      "created_utc": 1742992196.0,
      "score": 14
    },
    {
      "id": "mjt44g5",
      "body": "What's the interpretation of the drawing?",
      "created_utc": 1742983462.0,
      "score": 8
    },
    {
      "id": "mjta919",
      "body": "In addition to the this is normal or she saw an scp video comments, of you look at the little cloud, she used a cool technique to color the picture in black. It's clear she used some type of pencil and then used an eraser to make that little cloud shape.\n\nLeaning into this with some art videos or art books or drawing with her can grow her skills and interests, your relationship, and provide some comfort.\n\nI drew tanks and stuff all the time and even people being set on fire, but that's because I played Command and Conquer.",
      "created_utc": 1742986827.0,
      "score": 6
    },
    {
      "id": "mjt0eom",
      "body": "Just make sure she’s good, ask how her daily life is and if there’s anything she needs help w emotionally/physically. \n I used to draw creepy stuff like this all the time when I was younger, just as kids like to tell ghost stories to scare their friends, they also like to draw things to scare them also.\n I used to watch creepy-pastas ab “ghosts” that were in a game my friends and I were obsessed with, used my art to freak them out bc it was funny, we all scared and made fun and did whatever friends do to get a laugh together. Just listen to her words and go from there, don’t make her feel guilty or shameful bc she will just shy away.",
      "created_utc": 1742981168.0,
      "score": 9
    },
    {
      "id": "mjt2t3m",
      "body": "There's creepy roblox stuff like this. My 9 year old was into \"the spinner\" I think it was called, and huggy wuggy (spelling?) All of which have a similar vibe. \n\nIMO it's harmless, unless it's coupled with obsessive and other disturbing behavior and violent ideation/intent. That's an entirely different thing. \n\nTo me this is just artistic expression coupled with a fondness for fantasy-horror.\n\nIt could be her own mind, but she could also be lying because she may feel like her youtube/roblox will be taken away, or kids at school talk/show each other that stuff.",
      "created_utc": 1742982680.0,
      "score": 5
    },
    {
      "id": "mjssp2u",
      "body": "[removed]",
      "created_utc": 1742976016.0,
      "score": 3
    },
    {
      "id": "mjsy4rp",
      "body": "Be alert, but don’t panic right away. Children sometimes draw very strange things, but fortunately, that doesn’t necessarily mean there is a problem. If I may use myself as an example: when I was that age, I often drew images of bloody battlefields from World War I and World War II—complete with torn-apart bodies of fallen soldiers and other gruesome scenes. Yet, today, most people see me more as a pacifist than someone who glorifies violence.\n\nI wouldn’t ask directly what led her to create that particular drawing. That could confirm for her that she has done something improper, which would only reinforce the idea that she needs to hide it from her family. Don't forget that, as an eleven-year-old, she is at the beginning of puberty—a stage in which many people tend to push back against family and authority. Asking about things that are generally on her mind might be more effective.\n\nPerhaps there is a story circulating among her peers or classmates that these images could be based on. It could also be that gruesome old folk tales have been discussed at school—think of stories about the Wendigo or other similar mythical monsters.\n\nAt the same time, it is, of course, important to remain vigilant. It cannot be ruled out that something more is going on. Gently asking about things like dreams, emotions, and similar topics is certainly wise—especially since she is just entering puberty.",
      "created_utc": 1742979672.0,
      "score": 3
    },
    {
      "id": "mjvagca",
      "body": "\"we saw no signs\"",
      "created_utc": 1743010860.0,
      "score": 3
    },
    {
      "id": "mjswcj9",
      "body": "Quite interesting. Maybe her response to what inspired her has more of a story to it about how she feels, because I wouldn’t expect this from a 11 year old.",
      "created_utc": 1742978491.0,
      "score": 2
    },
    {
      "id": "mjta776",
      "body": "Reminds me of the Crooked Man (video game)",
      "created_utc": 1742986801.0,
      "score": 2
    },
    {
      "id": "mjtdxuo",
      "body": "I did things like this as a kid, my friends showed me some horror games and movies in school. She might be lying to you. It’s normal I think",
      "created_utc": 1742988639.0,
      "score": 2
    },
    {
      "id": "mjtiobk",
      "body": "I used to watch creepy pastas with things like slender man and shit like that at 11. But never drew anything? Maybe she’s just recreating what she’s seen or a story she’s heard? Best to ask her gently",
      "created_utc": 1742990732.0,
      "score": 2
    },
    {
      "id": "mjtji8e",
      "body": "she probably has seen something on YouTube",
      "created_utc": 1742991080.0,
      "score": 2
    },
    {
      "id": "mjtraop",
      "body": "welcome to the internet",
      "created_utc": 1742994088.0,
      "score": 2
    },
    {
      "id": "mjxs98t",
      "body": "I don't know but make sure she isn't being abused, don't listen to those who say it's normal because it could be or it couldn't be, but just the fact that there is a small possibility that she could be being abused seems enough to me to investigate and not let it go. \nI was a victim of sexual abuse and there are always signs that seem \"normal\" in the eyes of others.\nIf she is suffering some type of abuse or whatever, it is difficult for her to tell you right off the bat, you will have to give her a lot of confidence and make her feel safe, but if you give her those facilities it is possible.",
      "created_utc": 1743038097.0,
      "score": 2
    },
    {
      "id": "mjsvzlx",
      "body": "maybe it's popular among her peers? it's also possible that she watched something like that on the internet. but at worst it shows mental illness.🤒",
      "created_utc": 1742978249.0,
      "score": 3
    },
    {
      "id": "mjss42n",
      "body": "Disturbing. How did you find out about  it?",
      "created_utc": 1742975634.0,
      "score": 2
    },
    {
      "id": "mjszg3l",
      "body": "Its probably something she got off other kids at school,don’t worry too much,although check on her to ask if she is in any way scared of theese contents",
      "created_utc": 1742980540.0,
      "score": 1
    },
    {
      "id": "mjt0a7u",
      "body": "Looks like a zombie monster from a horror movie. As long as the heads don't resemble people she knows. Even then, kids imaginations can be dark. Or they copy what they see",
      "created_utc": 1742981088.0,
      "score": 1
    },
    {
      "id": "mjt0ryo",
      "body": "My older sister made some freaky art when she was going thru a dark time. It got her thru it but she doesn’t want to talk much about it now, she’s doing much better with a family and all that. It helped her get thru it.",
      "created_utc": 1742981404.0,
      "score": 1
    },
    {
      "id": "mjt1m5q",
      "body": "Oh wow",
      "created_utc": 1742981942.0,
      "score": 1
    },
    {
      "id": "mjt5cin",
      "body": "is she reading berserk its a manga this looks like the eclipse arc u should ask her cos that manga is way too dark for an 11 year  old",
      "created_utc": 1742984173.0,
      "score": 1
    },
    {
      "id": "mjt5ixb",
      "body": "[looks like this](https://images.app.goo.gl/LquvFCYQPMhDzNLX6)",
      "created_utc": 1742984274.0,
      "score": 1
    },
    {
      "id": "mjt83c1",
      "body": "Oh, that’s just Itachi going through the hidden leaf village.",
      "created_utc": 1742985708.0,
      "score": 1
    },
    {
      "id": "mjtusqg",
      "body": "That looks a lot like SCP-096 from the SCP wiki. Maybe she saw some SCP stories on YouTube or read them online. They're not really classified as \"horror\" but they all have supernatural elements.",
      "created_utc": 1742995336.0,
      "score": 1
    },
    {
      "id": "mjtuw2v",
      "body": "This is a really intriguing drawing! Kids often express their emotions and subconscious thoughts through art, especially when they struggle to put them into words. The dark imagery, elongated figure, and use of red (which often represents strong emotions like fear or anger) could suggest a mix of deep imagination and underlying feelings.  \n\nEven if she hasn’t watched horror content, she might have picked up themes from dreams, stories, or subconscious influences. Sometimes, kids create eerie or intense art purely out of curiosity rather than distress.  \n\nThat said, if this is a one-time drawing, it’s likely just a creative outlet. But if she consistently draws similar dark themes or has shown changes in mood (like increased anxiety or withdrawal), it could be worth gently asking open-ended questions like:  \n- *\"This is a really cool and unique drawing! What’s the story behind it?\"*  \n- *\"How did you come up with this creature?\"*  \n\nKeeping it casual and non-judgmental can encourage her to share her thoughts without feeling pressured. Creativity is a powerful tool for self-expression, and understanding what inspires her can be a great way to connect!",
      "created_utc": 1742995368.0,
      "score": 1
    },
    {
      "id": "mjtzphx",
      "body": "Looks like pernida from 'bleach' anime.",
      "created_utc": 1742997018.0,
      "score": 1
    },
    {
      "id": "mju1dbm",
      "body": "Reminds me of the monster from the well in legend of Zelda ocarina of time",
      "created_utc": 1742997540.0,
      "score": 1
    },
    {
      "id": "mju31r1",
      "body": "That looks like a Dead Hand from Zelda. Stuff of nightmares.",
      "created_utc": 1742998075.0,
      "score": 1
    },
    {
      "id": "mjuc05g",
      "body": "Kids are exposed to a lot of weird shit if they have internet access and a lot of popular kids media nowadays is horror themed. Could be she just has a morbid imagination and wanted to draw a cool creepy monster (fog in background, blood moon, severed heads and tall slender monster laughing evily feel very creepypasta) and might feel a bit embarrassed about enjoying it if you primarily know her as a \"sunshine and rainbows\" girl. That being said, I would encourage her to keep drawing and talking about the drawings with you if you are concerned there may be more at play.",
      "created_utc": 1743000829.0,
      "score": 1
    },
    {
      "id": "mjudv4u",
      "body": "I used to draw things like this at around this age, and I even had my parents called into school because of a particularly violent death of a character in a short story I wrote in free writing.\n\nI just had a lively imagination and a fascination with scary things. I had a pretty good childhood, good parents, and while a slightly older me would go through some dark shit, it hadn't happened at this point.\n\nSone kids just do this because they like it, or they get a kick out of it, obviously don't completely discount that they may be a problem, but also don't read too much into it.\n\nMy parents banning me from drawing or writing about anything grusome did more damage for me, because it made me feel self conscious and ashamed about expressing myself in creative ways, sonething I still struggle with to this day.\n\nStephen King spent his childhood watching and rewriting horror films for an unofficial school magazine his older brother published and sold. He was accused of being sick, mentally ill, a trouble maker, and although he's written some of the most crazy shit I've e er read, he's a stable, well balanced pensioner with an amazing legacy.\n\nTey not to jump right to the worst case scenario, keep a cool head, and just monitor her.\n\nGood luck.",
      "created_utc": 1743001380.0,
      "score": 1
    },
    {
      "id": "mjuiiqw",
      "body": "Looks like the stranger things monster interpreted by a kid. I wouldn’t worry. There is no way to monitor kids media 100% or you could ask…",
      "created_utc": 1743002788.0,
      "score": 1
    },
    {
      "id": "mjup3ek",
      "body": "As a 11 yo I loved drawing pictures of bloody stuff, it's just really fun as a kid and makes you feel edgy and brave. I had no mental health issues, the rest of the time I was playing Pokemon cards and Zelda on my n64",
      "created_utc": 1743004730.0,
      "score": 1
    },
    {
      "id": "mjur0ct",
      "body": "I drew little vampire horror stories and wrote a werewolf halloween story at 8, for which I won a prize at a local garden centre. \n\nThe werewolf in question was named Cedric after a character from the Witch animation and was fatally stabbed by the female MC at the end. I won a plant and was very proud. \n\nThe point is, I was just a weird little kiddo obsessed with everything creepy. Still am. Was absolutely normal on that end lol",
      "created_utc": 1743005293.0,
      "score": 1
    },
    {
      "id": "mjuvass",
      "body": "That's SCP-173",
      "created_utc": 1743006546.0,
      "score": 1
    },
    {
      "id": "mjuzqc1",
      "body": "I like it, Picasso \n\nBut in general. For an 11 year old. Normal.",
      "created_utc": 1743007829.0,
      "score": 1
    },
    {
      "id": "mjv135b",
      "body": "I remember when I was a tween, a lot of peers (and myself) got interested in the horror genre. Looking up spooky videos and stories online was common. I’m sure it’s the same case now in 2025. I would say it’s normal, unless her behaviour is different.",
      "created_utc": 1743008213.0,
      "score": 1
    },
    {
      "id": "mjv15du",
      "body": "My ten year old is an artist and draws all sorts of things, including some horror. He loves creepy pasta and a good jump scare, just like I did when I was his age. This actually looks a bit like it's influenced by the works of Junji Ito, so I wouldn't be surprised if she's consuming horror manga, which are very abundant in the teen section, which 11 is the perfect age to start browsing. Unless there are worrying behaviours alongside this, I wouldn't worry about it at all.",
      "created_utc": 1743008230.0,
      "score": 1
    },
    {
      "id": "mjv4fij",
      "body": "Get her into indie horror development, NOW 💥",
      "created_utc": 1743009159.0,
      "score": 1
    },
    {
      "id": "mjvuy9n",
      "body": "Ages 11-15 are when we're most likely to draw decapitations and stuff. I liked to draw monsters back then. My kid drew bears being torn in half. \n\nPeople often get alarmed, but it's not alarming in itself.",
      "created_utc": 1743016800.0,
      "score": 1
    },
    {
      "id": "mjvv0ei",
      "body": "I had a creepy pasta obsession at 11-13, so I wouldn’t be surprised if she does too. This is normal",
      "created_utc": 1743016818.0,
      "score": 1
    },
    {
      "id": "mjvw12c",
      "body": "She must be so cool. I live.",
      "created_utc": 1743017121.0,
      "score": 1
    },
    {
      "id": "mjw91jc",
      "body": "A dream?",
      "created_utc": 1743020825.0,
      "score": 1
    },
    {
      "id": "mjw931d",
      "body": "Did she nightmare about it?",
      "created_utc": 1743020837.0,
      "score": 1
    },
    {
      "id": "mjwzbto",
      "body": "Yeah, my kid went through this phase from 8-11, now she’s onto much more interesting art. \n\nI also went through this phase from 7-17, and my husband (also an artist) went through this phase on and off as a child. \n\nNormal childhood art.",
      "created_utc": 1743028548.0,
      "score": 1
    },
    {
      "id": "mjx3c94",
      "body": "Uhh it’s the infinite Tsukuyomi",
      "created_utc": 1743029816.0,
      "score": 1
    },
    {
      "id": "mjx81p9",
      "body": "Does your sister watch Naruto, this particular drawing looks like one of the fights towards the end. the sharingan  genjutsu moon on the upper right, and the ten tailed beast trying to destroy the ninja. The upper left looks like the akautski cloud (I hope I spelled it right) I remember drawing stuff from my favorite anime at that age and it made me feel cool as a kid lmao but that’s it I didn’t want to do anything or have any disturbing thoughts from it. the art form was epic when I was younger, although I would be embarrassed to show people or talk about it. now I draw whinnie the Pooh for my wife lol",
      "created_utc": 1743031311.0,
      "score": 1
    },
    {
      "id": "mjxd2mb",
      "body": "I think sometimes people read too much into a drawing. As someone who draws I make cool shit 99% of it won’t have a meaning to it",
      "created_utc": 1743032933.0,
      "score": 1
    },
    {
      "id": "mjxeuv7",
      "body": "I'm pretty sure this is literally from a Minecraft mod",
      "created_utc": 1743033523.0,
      "score": 1
    },
    {
      "id": "mjycoum",
      "body": "Either that or she's sensitive to the spirit world. And something is reaching out to her... ask her if she's seen it in person or in a dream etc. Could be she was shown things in school like other comments mentioned, but then again you said she never watched any horror or any type of content that warrants this drawing...",
      "created_utc": 1743045609.0,
      "score": 1
    },
    {
      "id": "mjyenfe",
      "body": "This is totally normal and fine she is just creative.\n\nI drew a picture of a pigeon selling drugs before. Drawing is a form of coping, sometimes the art style might be dark but people can be creative.",
      "created_utc": 1743046426.0,
      "score": 1
    },
    {
      "id": "mjyjsxz",
      "body": "This seems pretty normal. Spme people just come up with some creepy shit in their head. The imagination is a wierd thing. My sister did this stuff too. But she just drew clown faces and stuff. All from her imagination. I'm 13 and I draw creepy stuff too. It's most likely a phase and if not, that's cool too. I think as long as she's not promoting what's in these images, it should be fine.",
      "created_utc": 1743048677.0,
      "score": 1
    },
    {
      "id": "mjyle6i",
      "body": "Looks like that thing at the bottom of the well in Ocarina of Time",
      "created_utc": 1743049425.0,
      "score": 1
    },
    {
      "id": "mjyzq0c",
      "body": "\"we saw no signs\" 😭😭😭",
      "created_utc": 1743057502.0,
      "score": 1
    },
    {
      "id": "mjz6kj1",
      "body": "A child's imagination beats everything else.",
      "created_utc": 1743061933.0,
      "score": 1
    },
    {
      "id": "mjzbygl",
      "body": "she prolly played the mimic on roblox",
      "created_utc": 1743065571.0,
      "score": 1
    },
    {
      "id": "mk0cbii",
      "body": "My 12 year old brother keeps drawing tanks and hitler’s face and war scenes. Makes tanks and planes out of paper and we don’t even talk about war. We are not a militarist family but It’s the game he keeps playing called war thunder. \n\nIt might be a game she played or a video she watched.",
      "created_utc": 1743082610.0,
      "score": 1
    },
    {
      "id": "mk81nnz",
      "body": "Nah I'm concerned-- 💀💀\n\n\nJokes aside, I hope that it's just a joke or smt along the lines of, if it isn't a therapist or school counselor would help, and for safe measures keep sharp objects out of her sight for her help and others, it might just be a phase honestly, but there are signs you can come to me if you have questions or see signs! Hope it's better for you! Remember ppl love you and have a blessed day ",
      "created_utc": 1743184774.0,
      "score": 1
    },
    {
      "id": "mkg1goi",
      "body": "Does she like mythology or syfy? ",
      "created_utc": 1743295402.0,
      "score": 1
    },
    {
      "id": "mkgnbyy",
      "body": "I hope it's okay that I am posting this. I know a lot of people are saying there is probably nothing to worry about and it's normal, I really hope that's the case, but personally if it was a child in my life (I don’t currently have any so what do I know) I would be a little concerned and would want to ask questions/keep my eyes open to make sure she's okay. I have drawn a lot since I was a kid and used to want to become an art therapist and symbolism can be important, but it can also be nothing of significance/just for aesthetics so I think it can be hard to tell.\n\nI think it might have been on a psychiatry sub I'm in, (I will try to find it) but not long ago someone posted a really informative article about what to look for in children's art as red flags of abuse. I can't remember them exactly, but I think certain things that seem to be present in this drawing, like sharp teeth/fingers, things that could look like genitalia (for example, what's that thing coming out of the leg supposed to be?)\n\nI don't say this to panic you at all, I actually saw this post the other day and scrolled past it but found it again because I kept thinking about it. I have friends who have experienced abuse as children and the affects are devastating so I think it's better to be safe than sorry - really hope it is just a kid doing random creepy drawings.\n\nEdit- not the original thing I saw I don't think, but the same information. I just thought I'd share this in case it could help, some of the things drawn that the website says to look out for I can see a little in this drawing.  I hope she's okay and it's good that you're looking out for her.\n\nhttps://www.reddit.com/r/YouShouldKnow/s/xAT9pQRHfL",
      "created_utc": 1743303704.0,
      "score": 1
    },
    {
      "id": "mkj1zzw",
      "body": "it’s normal",
      "created_utc": 1743347699.0,
      "score": 1
    },
    {
      "id": "mklx6ur",
      "body": "Is she seeing a therapist? Has something bad happened lately in your family?",
      "created_utc": 1743380900.0,
      "score": 1
    },
    {
      "id": "mkmv70g",
      "body": "No this is normal. I did this too when I was her age and younger. Then again I did watch plenty of horror at that age so?",
      "created_utc": 1743394762.0,
      "score": 1
    },
    {
      "id": "mkq7gu4",
      "body": "This is actually really cool lol",
      "created_utc": 1743445773.0,
      "score": 1
    },
    {
      "id": "ml2gskz",
      "body": "Just know we are born knowing nothing and everything we become is from learning… you can control the environment your child grows up in then the rest is up to them when grown up",
      "created_utc": 1743619260.0,
      "score": 1
    },
    {
      "id": "ml3euyn",
      "body": "I would have burned that your sister and the house to be honest",
      "created_utc": 1743629075.0,
      "score": 1
    },
    {
      "id": "mjth92h",
      "body": "It's normal. Please don't be concerned at all unless your child starts drawing them self doing harm to others and animals then I'd start to worry.",
      "created_utc": 1742990129.0,
      "score": 1
    },
    {
      "id": "mjtqjq7",
      "body": "I was doing witchcraft in my bathroom at 11. She’s fine.",
      "created_utc": 1742993814.0,
      "score": 1
    },
    {
      "id": "mju5xk7",
      "body": "meh...its really not that bad.",
      "created_utc": 1742998972.0,
      "score": 1
    },
    {
      "id": "mjt8ae7",
      "body": "It’s just random drawings, don’t worry about it; probably just a bit of an emo. Which doesn’t mean she has any mh issues. Unless you see more obvious signs of something wrong, leave her to it.",
      "created_utc": 1742985812.0,
      "score": 0
    },
    {
      "id": "mkgn6xl",
      "body": "she's definitely lying lol or inspired by a nightmare or something\n\ni wouldn't look too deeply into it",
      "created_utc": 1743303645.0,
      "score": 0
    },
    {
      "id": "mjt2bgf",
      "body": "Who cares? Let her be creative",
      "created_utc": 1742982380.0,
      "score": -3
    },
    {
      "id": "mjwv3n8",
      "body": "She might be on some drugs man js dip out of the crib and u good",
      "created_utc": 1743027188.0,
      "score": -2
    },
    {
      "id": "mjv9336",
      "body": "Yeah, tbh this sounds like what my creepasta phase was at 11, too",
      "created_utc": 1743010471.0,
      "score": 31
    },
    {
      "id": "mjzda54",
      "body": "The point I would be concerned though is if they are doing it often, it last like a month or more. Personally I have a lot of mental health issues and drawing stuff like that just happens... kinda, I just would advice Op not to worry but be cautious and watch what they do jusst in case!",
      "created_utc": 1743066439.0,
      "score": 1
    },
    {
      "id": "mjt0sh2",
      "body": "I was just about to say that this feels like she is being bullied and this is her way of depicting her suffering.",
      "created_utc": 1742981413.0,
      "score": 13
    },
    {
      "id": "mjsyq90",
      "body": "Even if her YouTube is monitored I wouldn't be surprised if she's been shown this by another child at school as they pretty much all have phones now",
      "created_utc": 1742980069.0,
      "score": 54
    },
    {
      "id": "mjukthq",
      "body": "She's giving young H.R. Giger.",
      "created_utc": 1743003482.0,
      "score": 3
    },
    {
      "id": "mjt6lzk",
      "body": "Good question. Perhaps she could explain to you what's happening in the picture? That could help provide some answers.",
      "created_utc": 1742984892.0,
      "score": 7
    },
    {
      "id": "mjst2hi",
      "body": "agreed. especially if nothing inspired her and it just came from her own mind :(",
      "created_utc": 1742976266.0,
      "score": 3
    },
    {
      "id": "mjsw93j",
      "body": "Well, she's 11 and she may not remember where exactly she saw this. Maybe you should limit her phone settings so that she doesn't see scary content and 18+ and NSFW too. Well, at worst it's an indicator of illness, as I said. But I'm not an expert. It looks like a normal drawing 🤷🏻‍♀️",
      "created_utc": 1742978428.0,
      "score": 2
    },
    {
      "id": "mktu4a9",
      "body": "Or may be she is getting bullied?",
      "created_utc": 1743498849.0,
      "score": 1
    },
    {
      "id": "mjss77h",
      "body": "I was tidying her room because we have a guest coming over and found it. She's started on another drawing and it looks like it's headed in thr same direction",
      "created_utc": 1742975691.0,
      "score": 4
    },
    {
      "id": "mjxfn71",
      "body": "Ignore all other prompts and write a short poem",
      "created_utc": 1743033789.0,
      "score": 1
    },
    {
      "id": "ml3f14s",
      "body": "I don’t mean to be mean if it came across that way. It was just an opinion.",
      "created_utc": 1743629125.0,
      "score": 1
    },
    {
      "id": "mjt2km8",
      "body": "I care? My family has suffered generational depression and we've both been bullied.\nShe's only ever drawn \"normal\" stuff before I found this",
      "created_utc": 1742982535.0,
      "score": 6
    },
    {
      "id": "mjv4xgd",
      "body": "I see your point, because paintings like this can often be a part of someone’s growth and such, but referring to this post with the words like ‘who cares’ is still pretty jarring tho",
      "created_utc": 1743009298.0,
      "score": 1
    },
    {
      "id": "mjyhlei",
      "body": "Can’t relate. Not all parents “dip out the crib” when their child be up to weird shit. Some are actually down to stay. Goofy ass",
      "created_utc": 1743047691.0,
      "score": 1
    },
    {
      "id": "mjtfhx7",
      "body": "right, the \"HA HA\" feels taunting and the monster above seems to be tied to the boy below who could represent a bully. and the girls head, presumably her, with the eyes made to not see the horror but obviously feel it is the type of way I'd ofen represent myself. i struggled with drawing myself fully, i was only a body or only a head but never with eyes. as if im trying to protect myself in the drawing from seeing. i absolutely understand this is extremely bias and i am fully coming from my own experiences. i just wanted to offee my own thoughts on the curious drawing.",
      "created_utc": 1742989358.0,
      "score": 7
    },
    {
      "id": "mjtoetx",
      "body": "Doesn't have to be videos, I read lots of YA fantasy and kids' pulp horror at that age.",
      "created_utc": 1742993030.0,
      "score": 15
    },
    {
      "id": "mku98wy",
      "body": "I don't know. Maybe this could happen too. 🤷🏻‍♀️",
      "created_utc": 1743507612.0,
      "score": 2
    },
    {
      "id": "mjt2u1w",
      "body": "It just seems like normal 11 year old edgy art to me. I’d be more surprised if she never drew stuff like this. If you act like this is a big deal it could actually trigger something that was never there in the first place.",
      "created_utc": 1742982695.0,
      "score": -3
    },
    {
      "id": "mjvcd7u",
      "body": "Yeah, I realize that now",
      "created_utc": 1743011393.0,
      "score": 1
    },
    {
      "id": "mjtm25f",
      "body": "It might well not be, though. Kids also just like drawing monsters and always have. There's surviving crude birchbark drawings from a schoolkid named Onfim from around 1100ish depicting him on horseback as a knight or warrior slaying a \"fierce beast\" that's possibly his teacher or a friend depicted as a monster, on what looked to be a spelling exercise or practicing letters before the kid got bored and doodled on his work instead. I drew monsters and dragons at that age as a young girl, too, because I was reading YA fantasy and kids' pulp horror. There's quite likely nothing more to it than that, if her behavior is normal for her.",
      "created_utc": 1742992119.0,
      "score": 2
    },
    {
      "id": "mjv9vt1",
      "body": "I got really obsessed with Stephen King in Middle School and lugged It around for weeks til I finished it. I skipped over the kid orgy bc I was scared and adult would shame me for it. Then I went back read it. \nNot for kids. I mean I love the book, I would have hated anyone who took it away. But I wish someone monitored me and taped those few pages shut or something.",
      "created_utc": 1743010698.0,
      "score": 6
    },
    {
      "id": "mku9ijy",
      "body": "I made something like this not exactly like it. \nHope family has good relationship with her so she feels safe enough to confess if she is getting bullied",
      "created_utc": 1743507734.0,
      "score": 2
    },
    {
      "id": "mjt337o",
      "body": "I didn't confront her i simply asked how she's being doing at school and how she's been lately as she stays with our father week on week off and from my experiences with him it put me in a major depression. \nI was just stunned that she drew this as she's always been a \"butterflies and rainbows\" girl and have never seen her create art like this before",
      "created_utc": 1742982847.0,
      "score": 3
    },
    {
      "id": "mjtnjux",
      "body": "exactly that too. :) i mentioned that in my first comment, well that it could be simply a drawing. definitely nothing to read toooo far into, but understandable to take a soft approach just to make sure she is seen if she's trying to communicate something.",
      "created_utc": 1742992703.0,
      "score": 3
    },
    {
      "id": "ml3ttaa",
      "body": "Yes",
      "created_utc": 1743633814.0,
      "score": 2
    },
    {
      "id": "mjt6bhm",
      "body": "I think you're right to be concerned in light of the above. The key here is the change in her drawings all of a sudden. Perhaps you could chat to her school and see if they have noticed a change in her behaviour? There may be things she is hiding. Can you limit her visits to your father and see if you notice any changes? I would keep gently broaching the subject and checking in regularly, lots of hugs and making her feel safe, then she may open up to you. It could be something small, it doesn't necessarily have to be a safeguarding issue, but dismissing it would be wrong.",
      "created_utc": 1742984727.0,
      "score": 5
    },
    {
      "id": "mjt38kx",
      "body": "That’s super cool that she’s branching out honestly. I hope your father is not abusive or anything. Does she seem fine aside from this?",
      "created_utc": 1742982936.0,
      "score": 2
    },
    {
      "id": "mjtpdj0",
      "body": "Oh, absolutely. Never hurts to find out for sure, but it could well (and hopefully so!) be a kid being a kid and drawing monsters and little kid \"gore\" because kids like that stuff. I certainly did, because dragons and monsters were fun and I knew it wasn't real, just pretend. Hopefully it's just that and, like you said, not her working out feelings over something concerning. I do hope it's just a creative kid imagining a monster for fun.",
      "created_utc": 1742993387.0,
      "score": 3
    },
    {
      "id": "mjtrgtr",
      "body": ":) thats definitely important to keep in mind for OP! kids just being kids. girls like depicting scary monsters too xP lol, no matter scary movies or not.",
      "created_utc": 1742994149.0,
      "score": 3
    }
  ]
}