{
  "id": "1htqa3s",
  "title": "I did acid when I was 17 and have been feeling dead inside since then",
  "selftext": "When I was 17 I decided to take acid with my friends and I ended up going through a traumatic bad trip that some may call \"ego death\", my subjective self was basically fading away and I felt like I was dying and literally entering vegetative state as I just couldn't remember how to speak who I was nor what my purpose was.\n\nWhen the trip was over I was fine but still in shock.\nThen after a few weeks I started having ptsd and anxiety attacks that made my life hell. Now fast forward a few years and I just feel depersonalized all the time, like I'm not there. Of course I can ground myself, but sometimes I just get disconnected from reality, go through derealizations and feel like I'm just a little man watching my life through the lense of my eyes.\n\nHave anyone gone through similar things ? Please help me\n\nAlso if you're contemplating doing psychedelics and you're below 25, please don't, what people say is true, don't gamble losing yourself for 3 hours of pleasure",
  "created_utc": 1736029783.0,
  "score": 880,
  "num_comments": 79,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1htqa3s/i_did_acid_when_i_was_17_and_have_been_feeling/",
  "comments": [
    {
      "id": "m5fl74r",
      "body": "[removed]",
      "created_utc": 1736033052.0,
      "score": 958
    },
    {
      "id": "m5fnu37",
      "body": "[removed]",
      "created_utc": 1736033960.0,
      "score": 89
    },
    {
      "id": "m5fx9ip",
      "body": "Someone put some in my lunch in the 8th grade. I've had severe unyielding dp/dr ever since.\n\nWhen did this happen?\n\n1995.\n\nGodspeed OP.",
      "created_utc": 1736037162.0,
      "score": 127
    },
    {
      "id": "m5gqnc6",
      "body": "My personal feeling is that you probably are in need of some good philosophy that can more truly ground you.  You'd have to find something special in the area of \"phenomenology\", but something designed for therapy or something. I'm thinking that your mind got dislodged but didn't find any footing on good concepts to help you organize your reality. You'd have to be careful about what philosophy to look into. \n\nYou probably don't realize how many concepts are involved in just being. Even your \"ego death\", a common term that is used, is really a concept, and it might not actually be a very good one, though there's probably something to it. But the very idea of \"ego\" is weird and complicated. You could take this all as a journey, but you can't just go to some commune, follow a guru, or pick up just any idea and run with it. But it's like your \"ego\" is kind of freed up but actually has no concepts to help you figure things out.\n\nI'd say try to read safer, \"for the public\" but phenomenologically oriented books like \"One Dimensional Man\" for starters, and try to find other readings in that vein.",
      "created_utc": 1736047400.0,
      "score": 17
    },
    {
      "id": "m5g2gtc",
      "body": "I had terrifying experience with weed and probably some ptsd. It’s psychological trauma and emotional numbing is part of that, have you tried any deep trauma work/therapy? \n\nI think some of us have more vulnerable brains and it may have shifted things for you chemically but that should be able to heal hopefully.",
      "created_utc": 1736038904.0,
      "score": 33
    },
    {
      "id": "m5fr3ot",
      "body": "[deleted]",
      "created_utc": 1736035076.0,
      "score": 57
    },
    {
      "id": "m5fp60b",
      "body": "I think I’ve been predisposed to depression or dysthymia all my life. Been contemplating going on a guided Ayurvedic trip as I’ve read it can really open doors in your mind and make you appreciate life more, but you’ve given me some food for thought.\n\nHoping the best for you!",
      "created_utc": 1736034418.0,
      "score": 31
    },
    {
      "id": "m5g40ic",
      "body": "When I was a teenager I had a similar event with that fake weed \"spice\" what helped the most was time, physical activity and not thinking about it. Every time I thought about it my anxiety would skyrocket and actavate a panic attack. The first step is working on the anxiety. As long at that exist in your life it will keep you buried in the back of your own consciousness forcing you to be an observer of the events taking place. You must take charge. Discipline and  belief to overcome.",
      "created_utc": 1736039440.0,
      "score": 9
    },
    {
      "id": "m5gzsbk",
      "body": "[removed]",
      "created_utc": 1736050867.0,
      "score": 9
    },
    {
      "id": "m5i0aek",
      "body": "Yes drugs can activate latent trauma and can give you all these symptoms. It’s very common with marijuana. \nPlease don’t listen to those that say your genes predisposed you to shot and now you have some incurable disease. The chemical imbalance theory of depression is basically debunked, that’s not how mental health works. Trauma is at the root of it, things from your past that drugs can very quickly bring to the forefront by overriding subconsciously systems; that drug event itself can be traumatic. \n\nA good trauma therapist that understands dissociation can be a godsend. I hope you find healing",
      "created_utc": 1736070655.0,
      "score": 7
    },
    {
      "id": "m5h5n4g",
      "body": "This is why I’m never touching anything, I KNOW it will “unlock” something that I will never be able to get rid of. Not only does drug-induced psychosis run in my family, but without trying to sound dramatic as possible, my brain is already fucked up as is. Certain experiences I’ve heard people having is already how I am by default, clean. I’ve been tested since I was a young teen for schizophrenia, mania, hell just general psychotic disorders I do not know the names of but luckily have none (thank god). I don’t care if I come across as boring to my peers, I refuse to partake in any substance no matter how “mild” because of these reasons. The part of me that is curious however admittedly feels restricted over this; I always thought if I decided to go out on my own terms or by some unstoppable force of nature that I would give in once just to see what would happen.",
      "created_utc": 1736053354.0,
      "score": 7
    },
    {
      "id": "m5ffrru",
      "body": "That could be me, I have fucked up my mind a little bit and I'm now suffering from OCD about it.",
      "created_utc": 1736031180.0,
      "score": 29
    },
    {
      "id": "m5hsid5",
      "body": "Whatsup man, did the same when I graduated college. Probably wasn’t as intense of a trip as it seems you experienced, but still a traumatizing experience that also left me riddled with anxiety, panic attacks, and depression for years to come.\n\nFast forward about 4 1/2 years and I can manage my anxiety well without the use of medications which were necessary for a while. Anti-depressants have been majorly helpful. Along with support and love from close people in my life.\n\nThe truth is you might never be exactly the same person again, but that’s okay. We naturally change as people, and things happen in our life that change us, some good, some bad, some self-inflicted, and some that we could never see coming. \n\nYou can gain a lot of strength in the journey of living life post-trauma and start to see the beauty again. But it takes time, patience, and resilience. Give yourself some credit you’ve been surviving for a while now. But whenever you find the energy - fight to thrive instead of just survive.",
      "created_utc": 1736065717.0,
      "score": 7
    },
    {
      "id": "m5i3c2f",
      "body": "I had a similar experience. I had tripped before without any long lasting effects, but this one was different. I started meditating consistently for a few months then had an acid trip where a friend pressured me into smoking weed when I was peaking. That broke my brain.\n\nI wasn't able to understand reality anymore. It felt like reality could mold to any interpretation I wanted it to. I would find any meaning I wanted in events. It was very scary because after the trip I could make the difference between what I considered a real thought and imagination.\n\nThis led me to almost killing myself. I was convinced at some point that the whole point in life is to realize it's a dream and kill yourself to wake up. I am lucky some friends talked me out of it.\n\nIt took me two years to get rid of it. I am grateful I was able to come back. I can see how if I would have taken a higher dose it would have been much more difficult to recover.",
      "created_utc": 1736072548.0,
      "score": 6
    },
    {
      "id": "m5ikov6",
      "body": "Hi, I went through the same at 19. Ptsd and depersonalisation lasted a few years. Cause: LSD + weed + was also raped the same year of the trip which made things messy. Was in hell until I was 25, then I changed my life completely and took charge of my health. You have to aggressively take care of yourself and it will get better. Quit drugs. Sleep well every night. Eat well. Exercise. Build community. Make yourself safe and happy. Go the talk therapy. Learn about brain health. It does get better. \n\nNow I’m 29, have no ptsd, and rarely get depersonalisation, but I do have some triggers, like Psychodelic images, strong visuals, lack of sleep and unwanted sex. But I just avoid what I can and deal with it how I can. \n Best of luck x",
      "created_utc": 1736082303.0,
      "score": 5
    },
    {
      "id": "m5i6jwb",
      "body": "Acid usually takes anywhere from like 10-15 hours, I’m not sure it was acid if the effects only lasted 3 hours. I am sorry you have gone through this though, a bad trip can be really traumatizing, I recommend you try therapy and be open with them about what you have done. In the long run it can really help your mental health.",
      "created_utc": 1736074487.0,
      "score": 4
    },
    {
      "id": "m5hhes8",
      "body": "Hey OP, sorry to hear you're going through this! I sometimes get the depersonalization issue with weed. I'm not certain that the issue you're having can be solved the same way but I find that avoiding caffeine, more weed, etc and getting enough sleep tends to help me. Additionally, it's easier to 'snap out of it' when you stop panicking (which usually means to stop focusing on it). It's much easier said than done. Addressing the anxiety that might be pre-existing here would probably be my first step. \n\nBest of luck, I know that feeling and it sucks big time. I hope this resolves for you ❤️",
      "created_utc": 1736059176.0,
      "score": 3
    },
    {
      "id": "m5huafh",
      "body": "idk if this is similar but i smoked weed one time at my old friends crib and as i was walking home everything was basically black it was like i was blindfolded but then my vision would come back and everything would be in low framerates like a video game then back to black then back to low framerates and it kept repeating. ive been dealing with derealization and ive felt miserable and directionless ever since",
      "created_utc": 1736066850.0,
      "score": 2
    },
    {
      "id": "m5io2p2",
      "body": "I had this happen to me, only I think I was more like 15 or 16. I couldn’t figure out how to help myself for a long time. For me the answer was therapy and EMDR. It took me until I was in my 30s to make those efforts. I’m 41 now and not suffering how I was.",
      "created_utc": 1736083787.0,
      "score": 2
    },
    {
      "id": "m5fst8n",
      "body": "I went through something similar (just not as extreme) due to some bad trips and experiencing ego death a few times from 19 to 21. 21-23 I dealt with depersonalization and derealization when under extreme stress. I'm 24 now and the issues are still there, but fading. Your early 20s are a common time for brain issues to surface, but as you get older, they may become more manageable and less frequent. Still, you should see a psychiatrist to check for anything more serious. Thankfully, a lot of disorders that cause psychosis or hallucinations are treatable. Keep hanging in there, these years are fuckin awful but we'll be out of the woods eventually",
      "created_utc": 1736035667.0,
      "score": 1
    },
    {
      "id": "m5fzs9n",
      "body": "[removed]",
      "created_utc": 1736037997.0,
      "score": 1
    },
    {
      "id": "m5ghgvp",
      "body": "[removed]",
      "created_utc": 1736044130.0,
      "score": 1
    },
    {
      "id": "m5hmx92",
      "body": "Also wanted to give my story, it was my first week in university and went to a friend's rock band, I arrived there super early and some friends were there, I accompanied them to smoke as I smoked cigarettes until suddenly they offered me a weed joint they had, I was pretty hesitant but I took it, the fuckers told me the way to smoke it was inhaling for 7 seconds and taking pauses in between rounds, I didn't know much better so I ended up smoking like 30 seconds, I had a coughing fit and in general thought it was funny once I had some water, however once in the bar something happened, I don't know the technical terms but I had basically a time distortion, I kept watching the streets for what I felt were like 2 days, I felt the passage of time so cruel and slow, and even when the band arrived, I couldn't walk nor speak well, so I guess it was a really bad trip.\n\nMuch support to you my dude, as you've seen in the comments you're not alone and I hope you are able to overcome this 🫂🫂",
      "created_utc": 1736062348.0,
      "score": 1
    },
    {
      "id": "m5hux0j",
      "body": "[removed]",
      "created_utc": 1736067240.0,
      "score": 1
    },
    {
      "id": "m5fogmj",
      "body": "Go to the doctor. Get some meds. It'll help.",
      "created_utc": 1736034176.0,
      "score": 1
    },
    {
      "id": "m5gohq8",
      "body": "I was 17 and took acid too . Had a horrible trip , felt like I was trapped in hell or some shit , then I took acid the next day and it was the best trip of my life . I guess it is true that man is his own heaven or hell",
      "created_utc": 1736046619.0,
      "score": 1
    },
    {
      "id": "m5galyl",
      "body": "As always I recommend speaking with a professional, but when you do you should ask about one of those in house psilocybin treatments. They make your brain malleable and with the help of a professional they can possibly work through any trauma it might have caused.",
      "created_utc": 1736041704.0,
      "score": 1
    },
    {
      "id": "m5flyhv",
      "body": "Hey OP, come talk about it with us on r/LSD if you feel up to it. A lot of good people are over there willing to help you out if you want some perspective on the situation. Much love ❤️",
      "created_utc": 1736033313.0,
      "score": -5
    },
    {
      "id": "m5fwl6s",
      "body": "Combat this with a good mushroom trip!",
      "created_utc": 1736036940.0,
      "score": -15
    },
    {
      "id": "m5him94",
      "body": "How many micrograms did you take? I’ve taken acid about 15 times and they have been some of the best experience I’ve ever had. I’ve only ever taken one tab at a time (100-200ug max)",
      "created_utc": 1736059851.0,
      "score": -2
    },
    {
      "id": "m5hl77o",
      "body": "You took a trip and climbed a tree\n At Robert Sledge's party\nAnd there you stayed 'til morning came\nYou were not the same after that",
      "created_utc": 1736061327.0,
      "score": -3
    },
    {
      "id": "m5ffz68",
      "body": "[deleted]",
      "created_utc": 1736031248.0,
      "score": -32
    },
    {
      "id": "m5gdg0s",
      "body": "thanks for this it helped a little. i’m diagnosed bipolar and while i always had issues with mental health, i never had problems with anxiety until my first panic attack induced by weed after smoking for years. It was the most horrible psychotic episode / 12 hour long panic attack, and since then ive battled with anxiety (13 years ago). \n\ni always like the thought of doing shrooms or acid just to try it but i’m so scared it would make my anxiety worse since even the thought of weed makes me panicky\n\ni always wondered if i caused the anxiety by constantly smoking but i suppose it’s like you said, my brain is probably wired to be set off and if the weed didn’t something else would have",
      "created_utc": 1736042706.0,
      "score": 33
    },
    {
      "id": "m5fzkhd",
      "body": "[removed]",
      "created_utc": 1736037925.0,
      "score": 119
    },
    {
      "id": "m5gajwl",
      "body": "Does smoking weed generally increase dissociative symptoms?",
      "created_utc": 1736041685.0,
      "score": 12
    },
    {
      "id": "m5hn3d5",
      "body": "As a seasoned psychonaut, I second this. The weed smoking is a very good point; in my experience, it is so often brushed off as not a big deal.",
      "created_utc": 1736062449.0,
      "score": 12
    },
    {
      "id": "m5ip80r",
      "body": "Thank you for this message. I do smoke weed regularly and also drink very often, well ever since my bad trip I've actually grown quite addicted to it. It just helps me feel relaxed. But I know it's only an illusion. I have an appointment with an addictologist in a few weeks, hope I'll be able to work with that person through this.",
      "created_utc": 1736084289.0,
      "score": 14
    },
    {
      "id": "m5g9uj7",
      "body": "[removed]",
      "created_utc": 1736041438.0,
      "score": 28
    },
    {
      "id": "m5g4gn8",
      "body": "I also had an experience somewhat recently where I thought I was losing my mind. Thank you for sharing this, I thought I was the only one. It was hands down the scariest moment of my life",
      "created_utc": 1736039597.0,
      "score": 6
    },
    {
      "id": "m5fyi4m",
      "body": "Excellent response!",
      "created_utc": 1736037572.0,
      "score": 5
    },
    {
      "id": "m5ir467",
      "body": "r/mentalhealth does not allow discussion of medication or drugs, including dosages, side-effects, or how to obtain a medication or drug. Do not discuss street drugs or use of medication that was not prescribed to you. \n\nIf drug misuse or abuse has or is affecting your mental health, you may discuss that you have a history with drug abuse, but do not provide more detail than is necessary.\n\nUsers may mention medication that they have been prescribed, and relate relevant information about their experiences. Such posts and comments must adhere to rule 1 and be focused on mental health and not on the medication or the experience of taking a medication. \n\nIn certain circumstances, it may be appropriate to recommend that a user discuss their symptoms with a medical professional. It is never appropriate to recommend a drug, class of drug, or a particular dosage.\n\n\n*If you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).*",
      "created_utc": 1736085102.0,
      "score": -7
    },
    {
      "id": "m5fyoiw",
      "body": "Jesus Christ… in 8th grade…",
      "created_utc": 1736037631.0,
      "score": 63
    },
    {
      "id": "m5gv6ju",
      "body": "Dayummm did you tell someone or just go through school?",
      "created_utc": 1736049090.0,
      "score": 16
    },
    {
      "id": "m5h9h10",
      "body": "Omg what. Dude did you find out? That’s awful",
      "created_utc": 1736055107.0,
      "score": 8
    },
    {
      "id": "m5iexrn",
      "body": "Gonna add something on here real quick.\n\nPhilosophy is about understanding. Once you get a solid grasp of your reality and a proper sense of self, you'd want to go and explore. Find a bunch of different perspectives and ideas, learn everything you can. Eventually, it will culminate into a singular perspective; you.\n\nAll paths are made of countless destinations.",
      "created_utc": 1736079350.0,
      "score": 4
    },
    {
      "id": "m5gpynk",
      "body": "Of you don’t mind me asking, what happened with the weed?",
      "created_utc": 1736047149.0,
      "score": 5
    },
    {
      "id": "m5gptsz",
      "body": "If you don’t mind me asking, what happened? Was it from a little weed or you smoked way too much and greened out? I occasionally smoke a small amount of weed and this scares the shit outta me.",
      "created_utc": 1736047100.0,
      "score": 18
    },
    {
      "id": "m5fw9ap",
      "body": "Me too",
      "created_utc": 1736036829.0,
      "score": 3
    },
    {
      "id": "m5ggrky",
      "body": "me 4",
      "created_utc": 1736043884.0,
      "score": 3
    },
    {
      "id": "m69l46t",
      "body": "Information provided on r/mentalhealth is not a substitute for qualified professional care.\n\nThe moderation team will remove content that offers information that should come from a professional and not from anonymous users on reddit.\n\nLinks or references to scientific articles are not a qualification to provide information of this nature on reddit.\n\nModerator discretion on this content is final.",
      "created_utc": 1736447495.0,
      "score": 0
    },
    {
      "id": "m5h1b88",
      "body": "I was/am genetically predisposed to OCD and a bad reaction/experience with MDMA triggered it for me. The dp/dr lasted around a year after the experience and still comes back occasionally even seven years later. \n\nJust don't do drugs if you even SUSPECT you might be susceptible to mental disorders or illnesses. It's not worth it people.",
      "created_utc": 1736051495.0,
      "score": 18
    },
    {
      "id": "m5imlke",
      "body": "Information provided on r/mentalhealth is not a substitute for qualified professional care.\n\nThe moderation team will remove content that offers information that should come from a professional and not from anonymous users on reddit.\n\nLinks or references to scientific articles are not a qualification to provide information of this nature on reddit.\n\nModerator discretion on this content is final.",
      "created_utc": 1736083124.0,
      "score": 1
    },
    {
      "id": "m5irfya",
      "body": "r/mentalhealth does not allow discussion of medication or drugs, including dosages, side-effects, or how to obtain a medication or drug. Do not discuss street drugs or use of medication that was not prescribed to you. \n\nIf drug misuse or abuse has or is affecting your mental health, you may discuss that you have a history with drug abuse, but do not provide more detail than is necessary.\n\nUsers may mention medication that they have been prescribed, and relate relevant information about their experiences. Such posts and comments must adhere to rule 1 and be focused on mental health and not on the medication or the experience of taking a medication. \n\nIn certain circumstances, it may be appropriate to recommend that a user discuss their symptoms with a medical professional. It is never appropriate to recommend a drug, class of drug, or a particular dosage.\n\n\n*If you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).*",
      "created_utc": 1736085241.0,
      "score": 1
    },
    {
      "id": "m5it07v",
      "body": "r/mentalhealth does not allow discussion of medication or drugs, including dosages, side-effects, or how to obtain a medication or drug. Do not discuss street drugs or use of medication that was not prescribed to you. \n\nIf drug misuse or abuse has or is affecting your mental health, you may discuss that you have a history with drug abuse, but do not provide more detail than is necessary.\n\nUsers may mention medication that they have been prescribed, and relate relevant information about their experiences. Such posts and comments must adhere to rule 1 and be focused on mental health and not on the medication or the experience of taking a medication. \n\nIn certain circumstances, it may be appropriate to recommend that a user discuss their symptoms with a medical professional. It is never appropriate to recommend a drug, class of drug, or a particular dosage.\n\n\n*If you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).*",
      "created_utc": 1736085890.0,
      "score": 1
    },
    {
      "id": "m5i3kzl",
      "body": "Acid builds tolerance very quickly. Perhaps due to your tolerance you simply had a lower dose and you weren't as overwhelmed.",
      "created_utc": 1736072700.0,
      "score": 4
    },
    {
      "id": "m5fz0ve",
      "body": "No. You may be trying to genuinely help here but this is naive and silly. \n\nPsilocybes can cause further disconnection at this point. No guarantee OP would have a good mushroom trip.",
      "created_utc": 1736037746.0,
      "score": 7
    },
    {
      "id": "m5iomgr",
      "body": "Abt 200ug + a whole blunt of really strong weed, I had taken more serious doses before, it wasn't my first time and I thought I was confortable with psychedelics. Turns out you never know when it hits you. You can take 3 tabs and have the time of your life, then have a bad trip off 1 single tab",
      "created_utc": 1736084029.0,
      "score": -1
    },
    {
      "id": "m5fkf4a",
      "body": "This is wrong on so many levels.",
      "created_utc": 1736032782.0,
      "score": 13
    },
    {
      "id": "m5fp116",
      "body": "Legitimately, what are you talking about?",
      "created_utc": 1736034371.0,
      "score": 5
    },
    {
      "id": "m5fwvpa",
      "body": "Don't listen to this. \n\nFirstly, there is no chemical imbalance caused by LSD. Even if there was, it can be fixed/rebalanced. \n\nSecondly, it's baseless rhetoric that doesn't mean anything. \n\nOur brains have neuroplasticity and can be healed following traumatic experiences.",
      "created_utc": 1736037036.0,
      "score": 4
    },
    {
      "id": "m5ha4yu",
      "body": "My great grand mother had bipolar one disorder, my grandmother had a psychotic break after her husband cheated on her, divorced her and went to jail. She does not have bipolar or any other psychotic disorder. \n\nI smoked weed for 4 years, I went through a very traumatic event and ended up experiencing cannabis induced psychosis. I am also not bipolar or have any other psychotic disorder. \n\non my maternal lineage there is a predisposition to bipolar and psychosis. So though my grandmother and I are not bipolar or anything else our brains are vulnerable to it. Her’s was under extreme stress during menopause and mine was under extreme stress while addicted to a otherwise harmless drug. The brain is really funny, I often wonder if I had of chosen weed if I would have ended up developing a full blow psychotic disorder. (Sober 3 years)",
      "created_utc": 1736055420.0,
      "score": 15
    },
    {
      "id": "m5g2r4w",
      "body": "[removed]",
      "created_utc": 1736039003.0,
      "score": 16
    },
    {
      "id": "m5gmdph",
      "body": "Yes, it can trigger DP/DR, anxiety disorders as well as psychosis.",
      "created_utc": 1736045871.0,
      "score": 21
    },
    {
      "id": "m5gd8w5",
      "body": "[removed]",
      "created_utc": 1736042635.0,
      "score": 5
    },
    {
      "id": "m5h2pz6",
      "body": "Oh yeah definitely told. It was a process. Years of process.",
      "created_utc": 1736052089.0,
      "score": 25
    },
    {
      "id": "m5hapid",
      "body": "No. I had an idea but had no way to prove. \n\nThe whole situation was like..... being forced to play with the Lament Configuration.",
      "created_utc": 1736055693.0,
      "score": 23
    },
    {
      "id": "m5ihn95",
      "body": "The problem is their sense of self may actually require some philosophy. A procedure of just learning anything one can is not wise. They need guidance and a safe, healthy approach.",
      "created_utc": 1736080800.0,
      "score": 3
    },
    {
      "id": "m5gts7w",
      "body": "I ended up in the er bc was screaming, terrified felt trapped in another dimension and it persisted like random happening while at work, panic attacks dissociation etc. fear of falling asleep.",
      "created_utc": 1736048561.0,
      "score": 16
    },
    {
      "id": "m5g2kug",
      "body": "Me three",
      "created_utc": 1736038942.0,
      "score": 2
    },
    {
      "id": "m5gdar1",
      "body": "[removed]",
      "created_utc": 1736042654.0,
      "score": 37
    },
    {
      "id": "m5ihshe",
      "body": "That's a given. Most people in general don't have a solid, established sense of self or identity and purpose, much less a wisp of ideologies beyond what's already given to them.\n\nAs I've said in the reply, you should do that AFTER establishing yourself properly. A proper foundation is everything, it will stabilize the person and give them the flexibility to change and adapt later on.",
      "created_utc": 1736080874.0,
      "score": 2
    },
    {
      "id": "m5i7dk4",
      "body": "Edible or inhaled?",
      "created_utc": 1736074984.0,
      "score": 6
    },
    {
      "id": "m5ii9ty",
      "body": "What is a given?",
      "created_utc": 1736081123.0,
      "score": 1
    },
    {
      "id": "m5iic8o",
      "body": "That their sense of self requires philosophy. Especially in its current state.",
      "created_utc": 1736081156.0,
      "score": 1
    },
    {
      "id": "m5iij7y",
      "body": "OK so your advice is quite confused.",
      "created_utc": 1736081255.0,
      "score": 1
    },
    {
      "id": "m5iitg4",
      "body": "Ok",
      "created_utc": 1736081396.0,
      "score": 1
    }
  ]
}