{
  "id": "1jvfg1t",
  "title": "Just found suicidal ideation in husbands search history. I don’t know what to do. Help?",
  "selftext": "Hello, last week my husband and I had a very huge fight that lasted through the week. We’ve seemed to have smoothed things out but last night I was looking though the search history on his computer and found this. I truly do not know what to do. Please help. ",
  "created_utc": 1744229339.0,
  "score": 1173,
  "num_comments": 120,
  "url": "https://i.redd.it/cs7drm4c9vte1.jpeg",
  "comments": [
    {
      "id": "mm9s0xh",
      "body": "**Hello u/!**\n\nThank you for using a content warning. Your post is under review.\n\n---\n**If you are in immediate crisis:**\n- Visit [Find A Helpline](https://findahelpline.com/i/iasp) for local hotline info.\n- Check [Hotline FAQs](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) for guidance.\n- Consider posting on r/suicidewatch or messaging their moderators [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch).\n\n---\n**For suicidal thoughts or self-harm:**\n- [HelpGuide](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) offers coping tips.\n- You are not alone – see personal stories on YouTube.\n- Practice grounding exercises or listen to your favorite music.\n- Refer to [Find A Helpline](https://findahelpline.com/i/iasp) for more resources.\n\n**Take care and stay safe!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1744229341.0,
      "score": 1
    },
    {
      "id": "mm9sjmj",
      "body": "Talk to him. Don't make any kind of accusations, or finger pointing. Ask him why, and what he's feeling. BE RECEPTIVE. Men are terrible at expressing what we're feeling inside. Ask, listen, and be supportive.",
      "created_utc": 1744229489.0,
      "score": 1779
    },
    {
      "id": "mm9zd63",
      "body": "Please talk to your husband as soon as possible, you may save his life",
      "created_utc": 1744231473.0,
      "score": 531
    },
    {
      "id": "mma5fyy",
      "body": "Sit him down, grab his hands, look him in the eye, and tell him you love him. Remind him why. Hug him. And then do what the other comments are saying, like offer support and compassion. If you can afford it, get him therapy.",
      "created_utc": 1744233283.0,
      "score": 267
    },
    {
      "id": "mm9tsvs",
      "body": "A good home is one of compassion, patience, no judgment, emotional support, loving kindness.. people need exposure to this be well..\n\n\nWhat was this fight even about? Was it something dumb?",
      "created_utc": 1744229852.0,
      "score": 342
    },
    {
      "id": "mma9ce8",
      "body": "Paramedic specialised in Psych-EMS*\n\n**The general approach to Psychiatric/Phycological (psychosocial) first-aid!**\n\n**Patient approach: verbal de-escalating and your role as psychosocial first-aider.** \n\nYour role as a psychosocial first-aiders is to make the patient feel safe; heard; seen; respected; and in general feel that you are there to help them, you should not form any thoughts about diagnoses (that’s a doctor with the proper education and experience’s job (usually a Psychiatrist)) or try to be their therapist, nor should you make promises or set expectations as that can make the treatment more difficult. \n\nYou should to the best of your ability use de-escalation techniques and to avoid physical intervention (use of force), if the patient is considered a danger to themselves or others you should contact the police for assistance.\n\n**The general approach:** Psychiatric (psychosocial) first-aid is extremely important, and there are some steps you follow:  \n\n\n1. **Assess the situation** \\- As soon as possible, you must check your surroundings for dangers to your own safety and that of others and take preventative measures to ensure that you remain safe, this includes **contacting your local EMS** (do not hang up on EMS unless they tell you to and give feedback as you go along, as well as rely on them for guidance if you are unsure. EMS is your best friend in any healthcare emergency, use them for what they are worth). - it might sound egoistic but it's important that you as a caregiver are safe so you can provide the assistance and help needed without the danger of being harmed.   \n\n2. **Contact and engagement** \\- talk to the patient in a non-confronting manner and actively listen to them, do not try to argue against them as that can escalate their frustration. Instead try to understand that they could be in acute distress; worried; psychotic/delusional or scared (depending on what the crisis is). If you come off as confrontive or judgemental the patient can quickly become defensive and reluctant to assistance/treatment, or become hostile and potentially a danger to themselves or others (such as the first-aider trying to help them).  \n\n3. **Safety and comfort** \\- respect, patience, and understanding are needed. Make sure they are in a safe environment where they feel comfortable, if possible stay with them and try to be comforting by showing them that you're there and they are being taken care of and aren't in any danger. Do not restrain them, you quickly run the risk of harming them; yourself and/or causing them to become hostile, let the proper personnel restrain them (e.g Police).  \n\n4. **Stabilization** \\- use distraction techniques, such as talking with them about their interests; hobbies; have them tell you a story or engage in other topics that take the focus away from the crisis.  \n\n5. **Information gathering** \\- get as much information about their condition as possible, pay attention to their mood and behaviour (this could be important for EMS and should be relayed back to your local EMS). If there are other people present who know the patient you can ask if the patient is known to have the symptoms/crisis and if they have a treatment plan or use any medication (\\*\\*DO NOT\\*\\* give any medications without being explicitly told so by qualified healthcare personnel, which rarely, if ever, happens).  \n\n6. **Practical assistance** \\- help them if there's anything they need or if they struggle with obtaining their basic needs. Provide physical and emotional stability, and offer practical assistance, such as: giving them water if thirsty; blanket if they are cold; or other practical help that can make them more comfortable.  \n\n7. **Connections** \\- reach out to those you believe can help them, for example: ask if there is anyone they would like for you to call/reach out to, such as: family; friends; or others who they feel confident in and that will be supportive. \n\nBe mindful about who you involve as they need to be able to de-escalate and not provoke them, this includes those around you; unless there is someone who is either trained in psychosocial first-aid or personally knows the patient, then having them leave the scene is your go-to. The fewer people (bystanders) the better, it’s a high pressure situation for both the patient and you as care-giver, and having bystanders is not only a distraction but can be potentially aggravating for the patient (This goes back to point 1. Assessing the situation and taking preventative measures to ensure everyone's safety. As well as point 3. Safety and comfort, having a lot of people around may be distressing).\n\n**Remember** that you as a psychosocial first-aider is **not** a therapist, nor is it your job to act as one or try to treat them beyond your capabilities (this includes not assuming diagnoses; suggesting path of treatment; or suggest medication). - **As mentioned:** It can make it difficult for EMS and an eventual therapist/treatment team to work with them if you have created expectations or made promises.",
      "created_utc": 1744234517.0,
      "score": 157
    },
    {
      "id": "mm9y0l1",
      "body": "There's a lot of help on the Samaritans website:\n https://www.samaritans.org/how-we-can-help/if-youre-worried-about-someone-else/how-support-someone-youre-worried-about/\n\nIt's UK-centric with emergency numbers etc but has good advice on how to support someone you love who is suicidal. Best wishes to you both",
      "created_utc": 1744231081.0,
      "score": 54
    },
    {
      "id": "mmac4gu",
      "body": "Ask and LISTEN to him\n\nDon't say things like \"what would the kids think\" or \"you would just leave us behind?\" \n\nTalk to him and listen. Seek professional help. You can't fix this yourself, and that's okay.",
      "created_utc": 1744235401.0,
      "score": 66
    },
    {
      "id": "mmcgwqs",
      "body": "So I've been down this hole before... sodium nitrate is very bad because *he knows what he's doing*. When I see people talking about that it's a big red flag for me that they probably need serious help.\n\nWhat I mean is he has talked to people or gone to places that are providing him with information that is serious. these places/people are serious about what they are doing. You don't just find stuff like this by accident, hell it's hard to find it if you're looking. \n\nThis tells me he has been researching this for a while, and has been planning this out, probably for a long time. I can't tell you what exactly steps to take (I'm sure there's lots of good information in the comments) but I want you to understand that you need to take this seriously, and plan out your next moves carefully.",
      "created_utc": 1744265525.0,
      "score": 21
    },
    {
      "id": "mm9txl6",
      "body": "It's difficult because you can't be upfront and tell him it's OK to say he feels suicidal without admitting you went through his history. I see two options here. You think of a way to say you went through his history in a way without him reacting badly, or, you take another approach, and say you were worried about him and searched the signs and it came up with depression. Then for both those options, tell him it's OK to feel like that and you just want to be there for him until you both get the \"old him\" back",
      "created_utc": 1744229891.0,
      "score": 80
    },
    {
      "id": "mm9uivh",
      "body": "Please talk to him offer your support and offer to attend an appointment with a healthcare professional in regards to his mental health. Be clear, open and honest that you're concerned.",
      "created_utc": 1744230061.0,
      "score": 26
    },
    {
      "id": "mm9ubds",
      "body": "Definetly talk to him about it as soon as possible. Don't be accusatory or aggressive as that'll make it harder for him to talk about it as a whole. Even if you don't ask him directly about it, talk to him in some way about his mental health. As the other commenter has said, men are in all honesty horrible at expressing and explaining their emotions so try to be as patient as possible with him. I hope he recovers and I hope that you and him are able to continue having a healthy relationship from now on.",
      "created_utc": 1744230001.0,
      "score": 14
    },
    {
      "id": "mmc26yj",
      "body": "Be an actual human being and talk to him, listen to him\n\nDont do the stupid thing of telling him to \"look forward, forget the past, the past is done, just move forward, what can you change if you keep thinking back to the past etc etc\", actually LISTEN to him and dont judge, people can feel judgement\n\nWhatever he's going through is very real to him, dont make it feel like he's talking to a wall\n\nI'm saying it as real as possible because this is a real thing I have and are still going through, I have no one I can trust - dont let him go through the same thing if you truly do give a fuck\n\nPeople may downvote me for being too real, not \"demure\", as it has happened before, but this is very real, and I'm speaking my personal experience right now\n\nTrust is fragile, the second someone feels like they can trust no one, and whatever they say, whatever they do can and will be used against them, their humanity dies",
      "created_utc": 1744257895.0,
      "score": 7
    },
    {
      "id": "mmbqaad",
      "body": "In 2023, I had a lot of suicidal thoughts. My business went under, we were living off of our credit cards while I looked for work…and apparently nobody wanted to hire me…for a little over a year. It was horrible, and I’m still working my way through the debt accumulated from that year. I only felt dismal failure. I felt like I had let my wife and kids down…I was constantly worried about what would end up happening with my house. Interest rates had skyrocketed, so selling my home and finding a new place didn’t feel like the option. I just felt doom and treacherous failure. One of the hardest parts was landing a lot of work interviews that never amounted to a new job. The constant rejection made me feel even more failure and put me in a dark place. I felt like nobody wanted me, and if I was dead, my family could use the insurance money to pay off the debt, and my wife could finish school. \nOne day, I broke down. I couldn’t do it anymore… my wife just sat next to me and hugged me. A real hug. She knew I wasn’t my typical self at that time and knew I was having a bout of depression, but she didn’t know how much I was thinking about ending it all. I literally felt like the world and society was uncomfortable and bad for me. The demand and pressure put on our conscience…JUST TO EXIST was too much. Her reaction to just love me was exactly what I needed. I needed to feel that I had purpose in others lives. I needed to feel wanted and loved. She immediately called a doctor and set up an appointment for me that afternoon. The doctor’s office made it happen for me because of how important the situation was. I was given SSRI’s and was told it may take 1 week’ish to start feeling the affects… I felt the affects within about an hour. I was instantly feeling lighter. I was able to get off the SSRI’s after about 4 months.\nIf you are able to show unconditional love and support to hear your husband release all of the pressures of life that he’s feeling, it should help. It helped me tremendously.",
      "created_utc": 1744252861.0,
      "score": 6
    },
    {
      "id": "mmaxich",
      "body": "Go up to him, stroke his hair, give him a hug and kiss. Tell him that fighting is silly and that you love him and couldn’t be without him.\n\nAsk him if he’s ok, hold his hand. Reassure him that you’re always there and that you love him and you’re not going anywhere.\n\nBe loving. Be kind. Be patient. Never ever throw anything back at him that you talk about because he will shut down and stop talking forever. \n\nJust be there but also now you know what he’s feeling you can also keep an eye out for any ‘off’ behaviour.",
      "created_utc": 1744242702.0,
      "score": 18
    },
    {
      "id": "mmabnmy",
      "body": "speakingofsuicide.com",
      "created_utc": 1744235250.0,
      "score": 9
    },
    {
      "id": "mmf4gcm",
      "body": "Well, fuck. You better not say you were looking through his search history. That will only make things worse.",
      "created_utc": 1744305335.0,
      "score": 3
    },
    {
      "id": "mmc7t57",
      "body": "Reading your history, you claim he offered going to a marriage counselor. Lead with this. \n\nTell him you changed your mind. Call therapists/crisis centers in your area, tell them your husband is suicidal and you need immediate help.",
      "created_utc": 1744260580.0,
      "score": 8
    },
    {
      "id": "mmbic0m",
      "body": "you need to call 988 they will guide you on what to do",
      "created_utc": 1744250081.0,
      "score": 3
    },
    {
      "id": "mma0ui9",
      "body": "Ask him and listen. Be understanding. Don’t take anything personally. Hope the conversation goes smoothly",
      "created_utc": 1744231903.0,
      "score": 5
    },
    {
      "id": "mm9vc46",
      "body": "I've been down that road this past 2 years after losing my dad. Even went through a rehab program where I stayed onsite with supervision care 24/7. The best thing you can do is talk to him, let him know how much you mean to him. Let him know that he can spill his heart out to you and you'll just listen. Let him know not to bottle up his emotions. You guys can also try looking to programs that can help him.",
      "created_utc": 1744230296.0,
      "score": 2
    },
    {
      "id": "mmcrvd6",
      "body": "I thought about that many times it's always because I felt alone even if I had people with me like friends and family I felt like it's not enough and no one to relate to\n\nAll i wanted is someone to relate to me and actually ask \"hey man, how is it going?\" I think that what you can do just try to ask and try to relate to him to his problem to his interests\n\nThis is according to my experience with suicidal thoughts and how I come to think about it",
      "created_utc": 1744272352.0,
      "score": 2
    },
    {
      "id": "mmbe6ay",
      "body": "Please speak to him ❤️ no accusations, just tell him you love him and that you're worried about him. Literally my worst nightmare, be strong",
      "created_utc": 1744248629.0,
      "score": 3
    },
    {
      "id": "mmca1wk",
      "body": "My guess is word \"divorce\" was mentioned during the fight?",
      "created_utc": 1744261729.0,
      "score": 2
    },
    {
      "id": "mmaugau",
      "body": "Talk to him about it and let him know that you are there for him. Please don't take it as him wanting to \"abandon\" you, I had a partner do that and it just made it worse. When people get to that point they usually convince themselves them dying would be doing others a favor.",
      "created_utc": 1744241646.0,
      "score": 2
    },
    {
      "id": "mmbw0t8",
      "body": "This man is deciding his last day. Intervene.",
      "created_utc": 1744255183.0,
      "score": 2
    },
    {
      "id": "mmaabq2",
      "body": "That's depressing. My kit has edibles beer and junk food and a whole bunch of sleeping pills.",
      "created_utc": 1744234830.0,
      "score": 1
    },
    {
      "id": "mmar4pk",
      "body": "Tell him it’s ok you got this. Don’t blame yourself",
      "created_utc": 1744240504.0,
      "score": 1
    },
    {
      "id": "mmaro7w",
      "body": "Talk to him and get him help",
      "created_utc": 1744240690.0,
      "score": 1
    },
    {
      "id": "mmax4z8",
      "body": "Just ask him! “Hey, I noticed you had suicidal ideation in our shared search bar. Are you actively planning on suicide? Is there any way I can help you to lighten this pressure?”\n\nMy spouse expressed suicidal ideation and I went way overboard by emailing saying he was sick and couldn’t come in the next day and emailing his old therapist (all with his consent at the time). \n\nBut the next day, he said that he really wish I would have just sat with him and talked to him. Like more car based and less action based.",
      "created_utc": 1744242572.0,
      "score": 1
    },
    {
      "id": "mmaykfq",
      "body": "I'm really sorry. Talk to him as soon as possible.",
      "created_utc": 1744243075.0,
      "score": 1
    },
    {
      "id": "mmbew5l",
      "body": "Asking him gently if he has a plan, for suicide, can give you information that might be helpful in diverting.",
      "created_utc": 1744248884.0,
      "score": 1
    },
    {
      "id": "mmcpo7c",
      "body": "I think he's the one who needs help",
      "created_utc": 1744270921.0,
      "score": 1
    },
    {
      "id": "mmdrzdn",
      "body": "I don't know where you live, but in germany the law is very clear about suicidal intentions - if someone expresses plans of suicide or if there's a clear reason to think that a person in suicidal, you can call the cops and EMS and the person can one legally forced to go to a mental health clinic by ambulance. Id always have that in mind a plan b",
      "created_utc": 1744290577.0,
      "score": 1
    },
    {
      "id": "mmfew8d",
      "body": "Just listen and be present for him. It’s hard not to show you are scared or angry but just being present would be the best option. Hoping this is something that is fairly recent and not something he has dwelled on for a long time. There is light at the end of the tunnel, he doesn’t have to sit in the dark but hopefully you can help him find root causes, could possibly be something you don’t know about at all",
      "created_utc": 1744308320.0,
      "score": 1
    },
    {
      "id": "mmg2k30",
      "body": "Force him to talk, even it meant an argument. My wife saved me many times that way.",
      "created_utc": 1744315303.0,
      "score": 1
    },
    {
      "id": "mmg81hu",
      "body": "It depends on the fight. It depends on what you want. Contrary to popular belief, you can't save people. It's best to carry on as best you see fit.",
      "created_utc": 1744316870.0,
      "score": 1
    },
    {
      "id": "mmguxf5",
      "body": "this is sad\n\nI hope things get better for you guys",
      "created_utc": 1744324016.0,
      "score": 1
    },
    {
      "id": "mmgxx61",
      "body": "Seek advice from a professional, where are you based in the world? Mind can be helpful, campaign against living miserably, the below website I've found most helpful personally\n\nhttps(://)Prevent(-)suicide(DOT)org(DOT)uk\n\nRemove the brackets obviously! And google 'Ask now, save lives', for a walk through of how to best help xx\n\nI just want to add, hopefully and chances are this isn't the case, but you mentioned in previous posts your husband may have cheated? Just keep part off your mind on if this could be a manipulation- to get you to stay with him. Could he have left the results for you to find?\n\nEven if that is the case, you should still take it very seriously, get him professional help, feeling actively suicidal is appropriate for a 999/ emergency number call, or going to A and E / emergency department. \n\nI've had a couple exes say that they're going to sh or otherwise hurt themselves if I don't do what they want. That is abuse - coercive control in the UK. \n\nAgain, you still need to take this seriously whatever the reason,  I've called 999 or the Mental Health Team for exes who've don't this maliciously, as its not worth taking the risk with their lives. \n\nBest wishes and hope you and your husband both come through this stronger and happier.",
      "created_utc": 1744325043.0,
      "score": 1
    },
    {
      "id": "mmgzuz8",
      "body": "Whatever you do do not get mad or show any kind of aggravation because that doesn’t help. Just ask him with gentle concern what he was thinking at the time and ask what you can do",
      "created_utc": 1744325700.0,
      "score": 1
    },
    {
      "id": "mmh0daj",
      "body": "Ask him how he is feeling lately. And let him know you are there for him in totality.",
      "created_utc": 1744325873.0,
      "score": 1
    },
    {
      "id": "mmh1shc",
      "body": "“Posted the wife a few days before killing her husband with sodium nitrate.”",
      "created_utc": 1744326360.0,
      "score": 1
    },
    {
      "id": "mmi8dy5",
      "body": "Talking through it all is the first and foremost plan. Let him know that you are listening and are there for support. I wish you all the best with this heavy burden.",
      "created_utc": 1744342366.0,
      "score": 1
    },
    {
      "id": "mmiggmf",
      "body": "It might be better to seek counseling outside marriage, as we don't know you or your husband. Some wives can be a bitch behind doors or there are some small things they think they are entitled to or vice versa. Seek outside help or invite him to a couples retreat",
      "created_utc": 1744346132.0,
      "score": 1
    },
    {
      "id": "mmimmas",
      "body": "I’m going to be the outlier here and advise you to get him help IMMEDIATELY. It is entirely possible to be compassionate, respectful, and take him to the hospital for a mental health crisis. \n\nIf he’s mad about the search history, that’s fine. Let him be mad. Marital issues can be solved, but only if both of you are alive.\n\nI can’t speak for your husband, but it appears this is no longer ideation. It is a plan.",
      "created_utc": 1744349311.0,
      "score": 1
    },
    {
      "id": "mmis9g4",
      "body": "i hate to be grim- and i need to stress IT IS NOT YOUR FAULT. AT ALL. \n\nif he’s truly as manipulative if not borderline abusive as you say, are you 100% sure this isn’t part of his plan to force you to stay? meaning does he know about the preceding divorce, have you started icing him out, etc? \n\nthere’s also the real, stark, and horrid possibility of him having been caught in something he genuinely regretted doing, and now his life is blowing up in front of him, whether by consequence of his own actions or not, and he simply can not handle it. \n\nbottom line, post about the bikini pics was 17 days ago, and the searches started 12 days ago. either he knows you look through his stuff and is using it as an abuse tactic, if what you’ve said is true, OR he’s collapsing under the pressure. \n\nwhether it was a conscious choice to like the pictures, inevitably risking the relationship from that day on, or a drunk choice, he’s actively being slapped with consequences, that he can not run from, and if he truly regrets what he did, he’s now losing the love his life, and his life stability as he knows it, which for men in this society (no matter how untrue it is) means they’re little to no amount of a man, let alone a man who deserves to live. \n\nit’s tricky. it’s hard, and it’s scary. you either need to talk to him 1 on 1 or with someone you both trust.",
      "created_utc": 1744352481.0,
      "score": 1
    },
    {
      "id": "mmivux8",
      "body": "Why were you going through his search history? Honest question. That's very invasive.",
      "created_utc": 1744354670.0,
      "score": 1
    },
    {
      "id": "mmzi6fb",
      "body": "Hi this is something that absolutely merits a discussion with your husband! Suicidal ideation can have a lot of variance in predicting attempts but the search results of means, quantity, etc can potentially be a form of active ideation with plan and it’s important to see it seriously and gain a perspective on where this came from.",
      "created_utc": 1744590959.0,
      "score": 1
    },
    {
      "id": "mn9gyem",
      "body": "I would be very careful not to \"throw this in his face.\"  In other words, you need to be gentle with the approach, and maybe even bring the topic up over several conversations.  If he doesn't want to talk about it, don't force him.  \n\nIf this stemmed from a fight, it's likely just that - ideation.  He must have felt quite hurt, or maybe feels very alone now.  I don't know him, or your relationship, or what you fought about, nor should I, but clearly he was affected. \n\nMaybe you can do a check in.  Mention you still feel bad about the fight, and maybe he'd like to talk about it.  \n\nI don't think there's a simple right or wrong answer, or any clear path.  I just think you should address this, but also be very, very gentle about it.  And in the meantime, just be kind.",
      "created_utc": 1744736602.0,
      "score": 1
    },
    {
      "id": "mmdk9xx",
      "body": "Why were you snooping through his stuff? Do you have an agreement to do so?",
      "created_utc": 1744287697.0,
      "score": 1
    },
    {
      "id": "mma6nce",
      "body": "Why would you look through his search history in the first place??",
      "created_utc": 1744233658.0,
      "score": -29
    },
    {
      "id": "mmdofv9",
      "body": "Maybe he just watched White Lotus",
      "created_utc": 1744289292.0,
      "score": -1
    },
    {
      "id": "mma5rex",
      "body": "[removed]",
      "created_utc": 1744233383.0,
      "score": -41
    },
    {
      "id": "mma13hp",
      "body": "Call the cops and crisis counselors? Nah ima share it on reddit instead. Why not?",
      "created_utc": 1744231974.0,
      "score": -44
    },
    {
      "id": "mm9vp2m",
      "body": "You're right. We are terrible at expressing our feelings. We're so used to bottling up all the emotions until we can't take it anymore",
      "created_utc": 1744230400.0,
      "score": 366
    },
    {
      "id": "mmafx85",
      "body": "As someone who struggles with depression and has several suicidal thoughts and even made an attempt when I was younger. I know exactly how this will go. \n\n\"Hey babe is everything alright?\"\n\n\"Yea, I'm fine\"\n\nWhen someone is thinking about ending their life. They already bought into the idea that the world and everyone they love would be a much happier place if they didn't exist. This is why I don't understand when people say \"it's a selfish act\"",
      "created_utc": 1744236654.0,
      "score": 204
    },
    {
      "id": "mmc90nw",
      "body": "\"Pointing finger\" is the keyword/phrase here\n\nWhenever I want to talk to anyone in my family, automatic finger pointing: \"STOP COMPLAININGGGGG, YOU HAVE A VICTIMIST MINDSET, STOP THINKING YOU'RE THE VICTIM\"",
      "created_utc": 1744261191.0,
      "score": 20
    },
    {
      "id": "mmhjf38",
      "body": "Most important thing, don’t use this against him later.",
      "created_utc": 1744332661.0,
      "score": 6
    },
    {
      "id": "mmafum5",
      "body": "Yess, this. Be honest with him.\n\nalthough..... why did you search for suicide in the search history....? Did you already suspect something or..... what....\n\nBut be honest, tell him what you saw, and maybe look out for any odd behaviour when you tell him that. I don't really know, except be honest. See how he responds.\n\nTo \\*honesty\\* to both of you. He needs to be honest too, that's why I said look out for any behaviour that's  maybe a little weird (\"not him\") personality when confronting him.",
      "created_utc": 1744236630.0,
      "score": 1
    },
    {
      "id": "mmehk8w",
      "body": "And honestly, to piggyback off of this, don't make any ASSUMPTIONS. It's possible he is trying to help someone else out (ie they said something about suicide by this method, he's trying to find out more to find out ways to help them not go through with it), or is looking it up because he read a relevant story, or is writing a fictional story, or is just curious. I look up all sorts of stuff for context/info that's a little alarming unless you know why.",
      "created_utc": 1744298586.0,
      "score": 1
    },
    {
      "id": "mn35f1p",
      "body": "Society and the media tells us to toughen up. Nobody gives a damn until something drastic happens unfortunately.",
      "created_utc": 1744649059.0,
      "score": 1
    },
    {
      "id": "mmbmo5m",
      "body": "Also say things like \"we are going to figure this out\" or \"we are going to get through this\" emphasize that his problems are your problems are he's not alone. Ask him if he's OK.",
      "created_utc": 1744251662.0,
      "score": 94
    },
    {
      "id": "mmb9vn8",
      "body": "That's good.",
      "created_utc": 1744247117.0,
      "score": 5
    },
    {
      "id": "mmd0fd5",
      "body": "I would remind him that whatever the fight was about can be fixed and isn't an end all. And that y'all can do it together. If you love him, show him that a little extra in the coming days.",
      "created_utc": 1744277942.0,
      "score": 18
    },
    {
      "id": "mmafa5g",
      "body": "The issue isn’t the issue. Individual and couples counseling stat",
      "created_utc": 1744236441.0,
      "score": 87
    },
    {
      "id": "mn47kpy",
      "body": "According to her last posts he liked a bikini photo of his coworker",
      "created_utc": 1744660420.0,
      "score": 1
    },
    {
      "id": "mmfltjy",
      "body": "yeah when i saw “sodium nitrite” i had the same exact thought. this is really scary because when i’ve been in that place i’ve been on websites where people talk about sodium nitrite and they go into detail including where to source it, how much to use, etc. this isn’t just ideation, it’s a sign he’s been researching this for a long time and is formulating or already has a specific plan, and is likely talking to other people who are planning the same thing and giving him information.",
      "created_utc": 1744310344.0,
      "score": 9
    },
    {
      "id": "mmc6ljy",
      "body": "Great advice, except replace “old him” to “feeling better”.\n\nHe may not like who he has been in the past, or something may have happened preventing him from ever being that person.",
      "created_utc": 1744259984.0,
      "score": 27
    },
    {
      "id": "mn3fo2n",
      "body": "Yeah, i would interpret it as extremely harmful to say you want to get the \"old him\" back. A huge part of empathy is acknowledging that it is still the same person, regardless of what they are currently experiencing. You're not a different person when you feel badly, whether it's from breaking a bone or experiencing intense emotion or emotionally numb. The important thing is to express affection/value regardless of the person's current state - describing the person as if they are a different person when they are unwell/have a negative perception would communicate (in my opinion, at least) that the person is conditionally cared for.",
      "created_utc": 1744652057.0,
      "score": 2
    },
    {
      "id": "mmesjc4",
      "body": "We do.",
      "created_utc": 1744301842.0,
      "score": 5
    },
    {
      "id": "mmab1c7",
      "body": "[deleted]",
      "created_utc": 1744235053.0,
      "score": 21
    },
    {
      "id": "mmcnq45",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1744269656.0,
      "score": 0
    },
    {
      "id": "mma2eun",
      "body": "im sorry but at the idealization point, calling the cops is one of the worst ideas ever. most of the time police can't handle mental health calls plus they'll just shove you somewhere to release you after half a week. i've been suicidal before and if my parents called the cops on me that would have done more harm than anything",
      "created_utc": 1744232356.0,
      "score": 24
    },
    {
      "id": "mma1y13",
      "body": "You can't call the police on someone for making Google searches. Do you think they just round up people and put them in psych wards at a whim?",
      "created_utc": 1744232218.0,
      "score": 29
    },
    {
      "id": "mmb1tj8",
      "body": "Cops? Really?\n\nThey'd just zero the husband for no reason when they smell the slightest hint of \"assumed aggression or agitation\"",
      "created_utc": 1744244247.0,
      "score": 4
    },
    {
      "id": "mmbkxxq",
      "body": "Don’t call the cops for someone googling something, jfc. Cops are notoriously terrible at dealing with mental health patients and involving them should be a last resort.",
      "created_utc": 1744251023.0,
      "score": 3
    },
    {
      "id": "mmdw3cs",
      "body": "Truly, it's so depressing to think about how men were told by other men to \"man up\" and \"suck it up\", when in reality, we all need to process our emotions and sometimes vent about them.",
      "created_utc": 1744292011.0,
      "score": 56
    },
    {
      "id": "mmefd35",
      "body": "As a man, how would you open up to talking bout your feeling? .. what words or situation would allow you to confide your emotions in someone.",
      "created_utc": 1744297927.0,
      "score": 4
    },
    {
      "id": "mrr7o05",
      "body": "I can relate to that even more so, being that I'm autistic and have a lot of experience with masking, but I do feel like I've gotten better over time and have felt a lot less of a need to do so.",
      "created_utc": 1746974553.0,
      "score": 1
    },
    {
      "id": "mmdb4qk",
      "body": "[deleted]",
      "created_utc": 1744283769.0,
      "score": -17
    },
    {
      "id": "mmalo4v",
      "body": "\"Yeah, I'm fine\"\n\"Yeah, I'll be alright\"\n\"It's nothing worth bringing up\"\n\n\nAll of those are cries for help and the person is lost or doesn't want to burden others.",
      "created_utc": 1744238651.0,
      "score": 118
    },
    {
      "id": "mmbwchi",
      "body": "Yes, he may not what to share. Here’s my step by step advice:\n\n1) do something that meets his love language (gifts, actions, whatever)\n2) tell him you want to talk about something that has been bothering you and ask if he is willing/able to talk\n3) tell him: “I am worried about you because something seems off lately. I cannot put my finger on it but you seem less happy. I have been noticing it and I am worried about whether you are happy. Is there something that has been upsetting you?” (Sentence one is non-judgmental and opening, sentence 2 is removing pressure on being accusatory, sentence 3 is showing that despite his efforts to avoid affecting you it still effects you, sentence 4 opens it up for him to share)\n4) no matter what he says, it’s about understanding his emotions. No recommendations, no judgement. He will probably get a lot out of it but it may be very confusing. Note: He may explain things he is upset about that don’t make any sense-that is ok\n\nThen you will have to work from there. He’ll need to work with you on what he needs but him opening up is the first step. \n\nSource: self experience",
      "created_utc": 1744255318.0,
      "score": 106
    },
    {
      "id": "mmur5qb",
      "body": "The selfish-act part is primarily because if you have say 4 immediate family members..... they will be traumatized, hurt, sad, missing you in a way that is on-going for years and years. So you will have inflicted pain on everyone of your family members, including the extended ones you might like such as cousins, aunts, uncles, etc. Next, your coworkers will think of you. Also, if you were here, I assume you tell 1 joke per day. At least. Maybe you're a rather funny guy and give 3 great sarcastic quips that make people chuckle. Maybe 10.  Who knows.  Maybe you open doors for people because that's the kind of nice-thing you do for other people.  Maybe one day you help you elderly neighbour bring a heavy purchase in from her car.  Its tiny small acts, thousands and thousands of, that you would do between the day you do the selfish act and the day you would have passed away from an accident or natural causes, that you've just removed from the world, plus traumatized everyone you know.....for your own benefit. \n\nIf I said here's twenty bucks but I want you to never help do another kind act for another person, never tell another joke and do nothing to help another person, such as the elderly neighbour AND you need to traumatize your family, friends and coworkers, if you said \"Okay! It benefits me\", you'd have no question it it was a selfish act.  In fact, no matter what the reward I gave out, if it was like an xbox or PS5, you'd probably still say, yeah selfish. The same applies if I said, here's a 3 day supply of aspirin or ibuprofen or some painkiller. So getting less-pain or no-pain or pain-reduction, doesn't change it from a selfish act.",
      "created_utc": 1744523175.0,
      "score": 1
    },
    {
      "id": "mmcxzzp",
      "body": "Sorry. That sucks",
      "created_utc": 1744276393.0,
      "score": 9
    },
    {
      "id": "mmh5jk3",
      "body": "I'm sure he didn't get suicidal because of the fight, infact no one gets suicidal over one thing. Small things build up causing huge amout of depression. Please update us on him OP.",
      "created_utc": 1744327663.0,
      "score": 7
    },
    {
      "id": "mmj2nzu",
      "body": "Oh good that’s alright then",
      "created_utc": 1744358977.0,
      "score": 2
    },
    {
      "id": "mmccbga",
      "body": "Yeah seeing those posts/comments… and the love bombing too… could… after he knew she looked at his web history already… could he be intentionally searching for suicidal things to guilt her into coming back?? (Source: I had an ex threaten to kill himself, with a knife, in front of me, to guilt me into staying after I found his search history that was much much worse than this. Not everyone is the same… but damn. OP, I hope you’re able to get him help… and also still leave like you already fully planned on.)",
      "created_utc": 1744262932.0,
      "score": -1
    },
    {
      "id": "mmc83lj",
      "body": "Also the betrayal he will feel for you calling the cops on him will make him even more suicidal",
      "created_utc": 1744260726.0,
      "score": 1
    },
    {
      "id": "mma30y0",
      "body": "I mean that’s literally what therapists do and these people are trained to handle these situations so why go running to people who are unqualified he needs to be sectioned until he calms down and doesn’t kill himself",
      "created_utc": 1744232544.0,
      "score": -25
    },
    {
      "id": "mma8fec",
      "body": "You actually can, my mother did this because of a vague Facebook post, got taken in to a behavioral health unit. In the U.S. they log it as a suicide threat.",
      "created_utc": 1744234223.0,
      "score": 1
    },
    {
      "id": "mmf9ii9",
      "body": "My bf always apologizes when he breaks down and cries. I always just hold him and tell him not to apologize. That I’m here to listen and hold him or try to help, whatever he wants. Bc at the end of the day, we’re all people with feelings. And just bc ‘you’re a man’ doesn’t mean shit doesn’t hurt the same.",
      "created_utc": 1744306785.0,
      "score": 16
    },
    {
      "id": "mmizn2s",
      "body": "It's sadly not just other men, a lot of guys will not share their feelings because the women in their lives were just as cruel if not worse.",
      "created_utc": 1744357037.0,
      "score": 5
    },
    {
      "id": "mme9f4q",
      "body": "It's not just 'other men' and you know that.",
      "created_utc": 1744296178.0,
      "score": 13
    },
    {
      "id": "mmehjl5",
      "body": "Being direct, but not judgmental. Showing you care. Cry with them.",
      "created_utc": 1744298581.0,
      "score": 4
    },
    {
      "id": "mmdvz7n",
      "body": "It's what the patriarchy told men to do, but it's not the process of being a man. Men need to voice their emotions and problems as well, we're all feeling creatures and we all need to process our emotions in a healthy way.\n\nBottling it up isn't one if these.",
      "created_utc": 1744291973.0,
      "score": 9
    },
    {
      "id": "mmbs3gl",
      "body": "My go-to is typically, \"it is what it is\" when things are going horribly.",
      "created_utc": 1744253585.0,
      "score": 53
    },
    {
      "id": "mmo9a25",
      "body": "Usually its yeah I'm alright (internally they aren't though.) (chances are when you walk away the ideations are still in their head living rent free. It's like when you have a flash of someone important in your mind in a crisis, but instead it's how they end things and it can run for some time like a movie in their mind. That is why they say it's mentally exhausting.) They're more likely not able to divulge everything one because it's to much for them to do, two they believe it's too much on their loved ones, and three they don't want the attention, they just want to be alone which yes that is dangerous. It's when they're alone do the rawest emotions of sadness come out. It's harder to recognize the longer they have it because they're constantly working on their poker face because they don't want others to see them like that or become burdensome to them, but it's hard for them to hide it in their eyes. Really peer in there. They'll probably try to look away or down or divert the attention off of themselves somehow because it makes them uncomfortable. Holding it in becomes a layer to protect themselves. Protect themselves from what? The environmental factors that made them feel that way. It doesn't have to be the particular person it can be a memory from long ago haunting them(past trauma), if they don't do X - your letting important person down or aren't worthy, or hampering the mood of everyone so best to lock it up so others don't go down with you (Self esteem issues). The inner dialogue in their minds are vicious and the worst critics of them because they know them best and can rip them to shreds, so it's like their mind acts as a separate entity like a bully, tearing them down. So it's like their mind is pushing for mental suicide in mental health. So they actually end their lives. This is an echo of long term damage of say bullying can do to people.  The screeching reel keeps going until they stop. You don't need me to tell you what that means.\n\n\nSo, to anyone reading this, if you really love that person make sure they know it. Sometimes, just sitting with them in quiet over time will cause them to open up to you. They just need someone to be with them. Sometimes they'll want a hug, sometimes they don't want to be touched. Depression shakes their foundation so bad it can be hard for them to keep their footing. Not literally, but composure wise, pressing it can make them worse. That's why sitting and being observant and seeing what they want is best. It's not easy, because you too want to reach out at times, but if they're super sensitive, consider these things. One moment they really need a hug because they feel so ostracized. Another it annoys them. Sometimes when they're in better spirits it's more accepting. It's not easy to navigate. The best way is being attentive. Emotional damage is complex and sometimes irreparable, sometimes it is. Just realize that those that go through with ending it, are too far gone. There is a threshold where therapy and treatments don't solve the problem. Those are the people that ended it. It's a dark thought, doctors couldn't save them, people couldn't save them. Think how horrible internally they must have felt.\n\n\nIt's dark from that point in a conversation because now you see a drop of how they feel it's probably the closest you'll get to feel what they feel. Because the darkest moments are the scariest. So scary people around them notice. But it's a lot worse for the person whose been internalizing these feelings for so long, the weight so heavy on them. They take the end route to lift that weight off of them. They too want to be free of their suffering whether they realize it or not. When they do choose to act out on  ending it, it's a coping mechanism to find relief from their suffering that's the motive.",
      "created_utc": 1744426232.0,
      "score": 1
    },
    {
      "id": "mmby54p",
      "body": "10/10 advice",
      "created_utc": 1744256083.0,
      "score": 22
    },
    {
      "id": "mmj1cz4",
      "body": "Excellent. Also: you are supportive of him and remind him how much he means to you and that you will get through this tough time together",
      "created_utc": 1744358138.0,
      "score": 2
    },
    {
      "id": "mmc5mot",
      "body": "I’m a crisis responder. This is excellent advice. However, I would add that you need to ask him DIRECTLY if he is suicidal. That is a big indicator of his intentions. Use the word suicide and/or suicidal.  Using this term does NOT put the idea of suicide in someone’s head if they do not already have that idea. It is best practice to be direct otherwise people will skirt around it and won’t be honest because of shame or fear. \n\nAsk him if this is recent or if this is new. Ask him if he knows what caused this to happen. Ask him if he has a plan. \n\nI’m going to be honest, based on that search history alone, it seems to me like he has a plan and intentions. You need to talk to him and try to get him psychiatric help before it’s too late.",
      "created_utc": 1744259522.0,
      "score": 1
    },
    {
      "id": "mngwqb4",
      "body": "Thank you for this.",
      "created_utc": 1744834765.0,
      "score": 2
    },
    {
      "id": "mn1xlnq",
      "body": "No, possibly the opposite, he’s looking for things to make him feel guilty and/or acting out as a cry for help.",
      "created_utc": 1744635015.0,
      "score": 0
    },
    {
      "id": "mmbocak",
      "body": "Therapists typically don’t call the cops. If it is an emergency (actively suicidal with a plan to commit suicide) they will call EMS, who will then require a police escort to transport the patient. EMS is a crapshoot with how they treat the patient, but they are a better choice as they have more training in psychiatric emergencies. If the patient becomes combative, the police escort will intervene, which is a bad time for everyone.",
      "created_utc": 1744252192.0,
      "score": 1
    },
    {
      "id": "mmgsy7r",
      "body": "My ex was like this. It is in all honesty the thing I miss most about her. She taught me what I want out of a relationship; never again will I settle for someone who I can’t cry to. It’s become one of my dealbreakers.\n\nIt’s rarer than you’d expect, so thank you for understanding that men are humans, and treating us as such.",
      "created_utc": 1744323348.0,
      "score": 7
    },
    {
      "id": "mmgel0q",
      "body": "Same, my partner knows how important mental health is for me, but it's so ingrained in him, that he always tries to hold his tears back. This is when I tell him, he can safely let things out, and then I snuggle him, pat his back and give forehead kisses.\n\nWe all need to vent, we all need someone to stay and a shoulder to (sometimes literally) to cry on.",
      "created_utc": 1744318782.0,
      "score": 6
    },
    {
      "id": "mrrbntm",
      "body": "u/beak_hashburner Absolutely. Anybody who says men don't cry are lying. People who say that men who cry are weak are absolutely wrong as well. Everyone needs an emotional release at one time or another, and there is nothing wrong with that.",
      "created_utc": 1746975835.0,
      "score": 2
    },
    {
      "id": "mmj71rt",
      "body": "It's mostly other men, but sorry if I worder it oncorrectly, you're right. It's not just other men, some women are not behaving around this issue as they should be.\n\nAlways wondered how women, the supposedly more kind and feeling gender is behaving like this. I could never be cruel with anyone, especially with someone who is having a hard time and is opening up about it.",
      "created_utc": 1744361816.0,
      "score": 3
    },
    {
      "id": "mrrebrj",
      "body": "With every toxic man there's often a toxic woman.",
      "created_utc": 1746976677.0,
      "score": 1
    },
    {
      "id": "mmeikx2",
      "body": "I mean, yeah, it's sort of cultural at this point [insert \"we live in a society\" meme]",
      "created_utc": 1744298891.0,
      "score": 16
    },
    {
      "id": "mmf31du",
      "body": "It's so funny to watch women cope\n\n\"IT'S THE PATRIARCHYS FAULT, WOMEN ARE ANGELIC PERFECT ENTITIES\"\n\nThe more interesting part is how it works and they actually fully convince themselves.",
      "created_utc": 1744304925.0,
      "score": -20
    },
    {
      "id": "mmf9ug3",
      "body": "Dude. When I die \"it is what it is\" will go on my grave stone. I say that a lot",
      "created_utc": 1744306879.0,
      "score": 6
    },
    {
      "id": "mmcwjjw",
      "body": "Being suicidal twice a year for 20 years has one benefit-I can relate. Thank you for your positive comment",
      "created_utc": 1744275459.0,
      "score": 15
    },
    {
      "id": "mnf8czj",
      "body": "And what do you do if the person says yes, I am suicidal or contemplating suicide?  I know I have been suicidal and talking helped me to get out of the cognitive spiral that bleaks all positive aspects of life worth fighting for.",
      "created_utc": 1744816936.0,
      "score": 2
    },
    {
      "id": "mngx524",
      "body": "Intentions are there but it seems like he hasn't found a plan suiting him. Op should directly ask him. Being soft or sweet can just make them mask things.",
      "created_utc": 1744834887.0,
      "score": 2
    },
    {
      "id": "mrregxe",
      "body": "u/I-am-a-fungi Me neither",
      "created_utc": 1746976722.0,
      "score": 2
    },
    {
      "id": "mmf5ycz",
      "body": "Get a fucking grip.",
      "created_utc": 1744305766.0,
      "score": 15
    },
    {
      "id": "mobuwza",
      "body": "Check out the [CSSRS](https://pcl.psychiatry.uw.edu/wp-content/uploads/2021/12/C-SSRS.pdf). It’s the Columbia suicide severity rating scale. It’s helpful in asking questions and determining risk. Just because someone is suicidal doesn’t mean they’re going to act on it. You have to ask them more questions. Ask if they have a plan, a means, a method, and have been thinking about it for awhile, or have attempted before. High risk requires professional intervention (hospital or psychiatric care), medium-low risk is fine to [create a safety plan.](https://www.suicideinfo.ca/wp-content/uploads/2019/09/Safety-plans-to-prevent-suicide.pdf) The most bare bones safety plans usually constitute having a friend or family member stay with the suicidal person and spend time with them over night to keep them safe and provide reassurance and comfort.",
      "created_utc": 1745272526.0,
      "score": 1
    },
    {
      "id": "mmfawk2",
      "body": "Oh my bad, you're right\n\nHey everyone it's okay I'm just crazy, ignore me",
      "created_utc": 1744307180.0,
      "score": -18
    },
    {
      "id": "mmwchce",
      "body": "Get help, seriously",
      "created_utc": 1744553603.0,
      "score": 1
    }
  ]
}