{
  "id": "1j45tip",
  "title": "First day on",
  "selftext": "Just posting to connect, seen the reviews of the medications online already but wanted to get perspective from anyone what these have done for you?\n\nI’d admit that I’m a bit hesitant about medications but I also want to be better so if this helps, then I’m all for it.",
  "created_utc": 1741188994.0,
  "score": 415,
  "num_comments": 185,
  "url": "https://i.redd.it/ljgy61wt4wme1.jpeg",
  "comments": [
    {
      "id": "mg5vrof",
      "body": "Love propranolol it worked wonders for me while I was on it, I wish I never stopped taking it",
      "created_utc": 1741189756.0,
      "score": 79
    },
    {
      "id": "mg5y5dm",
      "body": "I've taken both, beta blockers (propanolol) are much more noticeable especially right away and they really helped me with anxiety (PTSD)",
      "created_utc": 1741190443.0,
      "score": 43
    },
    {
      "id": "mg62tvx",
      "body": "I’m on propranolol and I love it. The first few days I felt a huge change in my anxiety, like a weight had been lifted off of me.",
      "created_utc": 1741191793.0,
      "score": 24
    },
    {
      "id": "mg5ygys",
      "body": "Taking Bupropion too! I haven’t been taking it long though but I’m hoping it helps with the depressive episodes.",
      "created_utc": 1741190537.0,
      "score": 14
    },
    {
      "id": "mg614l4",
      "body": "You got this!!!",
      "created_utc": 1741191306.0,
      "score": 10
    },
    {
      "id": "mg64g3c",
      "body": "Propranolol is amazing. My intense rages have settled down for the most part.",
      "created_utc": 1741192252.0,
      "score": 8
    },
    {
      "id": "mg6coys",
      "body": "I take 350 mg of bupropion and 10 mg of Prozac and I'm literally a different person without it. You've got a lot of clarity coming.",
      "created_utc": 1741194585.0,
      "score": 8
    },
    {
      "id": "mg5zvc8",
      "body": "I take both. Fair warning, bupropion is know to increase anxiety. I wasn’t on propranolol at the start, but was given hydroxyzine which I felt like I lived off of until I got used to it. \nI’m on 40 mg of propranolol a day (once in the morning and once at night) and it has literally been a LIFE SAVER",
      "created_utc": 1741190942.0,
      "score": 13
    },
    {
      "id": "mg61nfj",
      "body": "Bupropion has done wonders for me, especially paired with Sertraline\n\nBest of luck, friend",
      "created_utc": 1741191456.0,
      "score": 5
    },
    {
      "id": "mg6guaj",
      "body": "Let us know if your libido is affected, good or bad.",
      "created_utc": 1741195743.0,
      "score": 6
    },
    {
      "id": "mg66b4j",
      "body": "I'm on these (and a few others). Life is good.",
      "created_utc": 1741192782.0,
      "score": 4
    },
    {
      "id": "mg6m7ng",
      "body": "I’m on bupropion and it’s worked well for me. I started on lexapro and then celexa but got some side effects I didn’t like, but so far I like this new medication.",
      "created_utc": 1741197235.0,
      "score": 4
    },
    {
      "id": "mg5z1fk",
      "body": "I’ve taken both.  Prop made me extremely tired, like falling asleep at my desk. \nBup made me feel extremely disconnected and dizzy. \nI don’t take either any more.",
      "created_utc": 1741190703.0,
      "score": 7
    },
    {
      "id": "mg60l7d",
      "body": "How much does propranolol cost in USA?",
      "created_utc": 1741191150.0,
      "score": 3
    },
    {
      "id": "mg628o5",
      "body": "I recently started propranolol as well for high blood pressure and helps with stress, paired with my bipolar meds.",
      "created_utc": 1741191625.0,
      "score": 3
    },
    {
      "id": "mg673xl",
      "body": "Bupropion (Wellbutrin) works well in combination with Lexapro, and if you’re into natural herbal remedies, turmeric, and if you’re NOT in Kansas, Nebraska, or Idaho, some form of cannabis (some states are more open-minded than others although none of the Southeast where I live, 19 or 20 are complete legalization, 13 or 14 including FL, AL, LA, and MS in the Southeast are medical marijuana, the remainder except for three ignorant states I mentioned prior are full-spectrum CBD including GA, NC, TN, SC, and KY in the Southeast.)\n\nIf you have anxiety, Lexapro also helps with that, in conjunction with cannabis works (low THC, don’t want to overdo it, too much may have the opposite effect), oil of peppermint, bacopa, and inositol.  Not recommending any other anxiety meds, only saying the one because it’s also an antidepressant",
      "created_utc": 1741193009.0,
      "score": 3
    },
    {
      "id": "mg6en54",
      "body": "I’ve been on both of these for years and they have been extremely helpful for me!",
      "created_utc": 1741195134.0,
      "score": 3
    },
    {
      "id": "mg6fbp0",
      "body": "My brother said Prop + Klon were the only things that helped him. However, Prop is associated with hair loss (and weight gain I believe) which can be a deal breaker for some. \n\nI wouldn’t mind trying Prop again if not for those reasons. \n\nMy uncle (MD) suggested Wellbutrin over ten years ago, at the time, I was very reluctant to start medications. Been on many since then, but not that one. However, I do recall he said it’s important to pair that with a mood stabilizer, at least in my case. \n\nMy brother said Wellbutrin made his anxiety worse.",
      "created_utc": 1741195323.0,
      "score": 3
    },
    {
      "id": "mg6jrmn",
      "body": "Welcome to the club.",
      "created_utc": 1741196559.0,
      "score": 3
    },
    {
      "id": "mg6nidr",
      "body": "What did you get propranolol for? I heard it helps with essential tremor, people here saying they get it for migraines and anxiety. That thing sounds like an everything-medicine",
      "created_utc": 1741197594.0,
      "score": 3
    },
    {
      "id": "mg6y7w5",
      "body": "propranolol has worked wonders for my anxiety! sometimes i have to take 2 (psychiatrist said that’s the maximum for me at a time) and i am allowed to take it up to 2 times a day. literally life changing for me",
      "created_utc": 1741200558.0,
      "score": 3
    },
    {
      "id": "mg6ydb1",
      "body": "Those did nothing for me. Literally lol.",
      "created_utc": 1741200600.0,
      "score": 3
    },
    {
      "id": "mg77p70",
      "body": "I was on bupropion for a month or so and it made me very irritable and anxious so then I went off of it n now my anxiety is worse and I am having troubles sleeping. I’ll sleep for two hours then wake up then sleep for an hour until I’ve slept for 5 hours then around 6am I can’t sleep no more when I used to sleep 12 hours",
      "created_utc": 1741203195.0,
      "score": 3
    },
    {
      "id": "mg7lwg8",
      "body": "These two are my favorite out my like 6 medications lol I have addict branded on me forever (for alcohol not pills which is why it pisses me off lol) so no one ever wants to prescribe me a benzo for my anxiety. New guy said he would but I still wanted to try non addictive meds, NOTHING helped of all the ones we tried. Propranolol was the last one we tried and it makes such a difference. It really helps you off the edge of a panic attack physically but it doesn’t work on the mental anxiety like benzos do",
      "created_utc": 1741207143.0,
      "score": 3
    },
    {
      "id": "mg7p7vu",
      "body": "Dude, this is my current regiment... Take it as directed, breathe, and try to drink enough water. We get better by increments. A month 10% better than last sounds good, right?",
      "created_utc": 1741208050.0,
      "score": 3
    },
    {
      "id": "mg5zbxy",
      "body": "Hey I take the same things! They do wonders for me. I wonder if I can ever be off them someday, but right now I’m much better because of them.",
      "created_utc": 1741190787.0,
      "score": 2
    },
    {
      "id": "mg61oz3",
      "body": "I just started propanolol too, seems to help some but not enough for me.  Does it make anyone else’s feet and palms sweat?",
      "created_utc": 1741191468.0,
      "score": 2
    },
    {
      "id": "mg69za2",
      "body": "Low dose of propranolol I'm on 80mgs and currently isn't working 🙃",
      "created_utc": 1741193816.0,
      "score": 2
    },
    {
      "id": "mg6heuf",
      "body": "I take the same one you take on the left",
      "created_utc": 1741195903.0,
      "score": 2
    },
    {
      "id": "mg6iwtp",
      "body": "I love Bupropion",
      "created_utc": 1741196324.0,
      "score": 2
    },
    {
      "id": "mg6iyer",
      "body": "I took propanolol for a bit but had to stop because it was causing really bad shortness of breath.",
      "created_utc": 1741196335.0,
      "score": 2
    },
    {
      "id": "mg6jsfa",
      "body": "I was reluctant at first too but for me both works pretty well. Bupropion stabilized my emotions and Propranolol (taken when needed) is like a huge deep breath before and during anything that'll make me anxious.",
      "created_utc": 1741196565.0,
      "score": 2
    },
    {
      "id": "mg6kx1b",
      "body": "Propranolol helped me when I felt myself get into panic attacks. My Bupropion was combined with lexapro, and the bupropion worked to help me get “motivated”. Not sure if it was the lexapro, a combination of both, or just the former, but it worked for a while for me",
      "created_utc": 1741196876.0,
      "score": 2
    },
    {
      "id": "mg6w1qs",
      "body": "Just got put in propranolol for insomnia and I swear it didn’t help at all",
      "created_utc": 1741199958.0,
      "score": 2
    },
    {
      "id": "mg782wo",
      "body": "This is my perfect combo! The first med I was put on after seeking treatment for my depression & anxiety made me horribly suicidal and I was really nervous about starting anything afterwards. Switching to Wellbutrin was like a breath of fresh air for my depression. I decided I would “self manage” my anxiety but eventually wound up on propranolol for migraines. It helps with those but it again felt like a weight had been lifted off of my chest for the day-to-day anxieties - I hadn’t realized it had been as taxing as it was. Wishing you the best!",
      "created_utc": 1741203302.0,
      "score": 2
    },
    {
      "id": "mg78ekr",
      "body": "Propranolol has been awesome for me",
      "created_utc": 1741203394.0,
      "score": 2
    },
    {
      "id": "mg7bfbm",
      "body": "been taking it for years never seemed to help me",
      "created_utc": 1741204245.0,
      "score": 2
    },
    {
      "id": "mg7bli4",
      "body": "i’m on both including lexapro & trazadone. the bupropion keeps me alert and takes away my morning grogginess while the propanol helps my anxiety when i get on the train and helps my blood pressure at the same time, solid medication in my opinion",
      "created_utc": 1741204293.0,
      "score": 2
    },
    {
      "id": "mg7ck7s",
      "body": "I hated propranolol. I just couldn’t get down with something that messed with my heart. That’s so scary to me. Wellbutrin however was great! I took that one for a few years. Stopped because I wanted to just quit taking mental health medication altogether. Good luck to you.",
      "created_utc": 1741204561.0,
      "score": 2
    },
    {
      "id": "mg7g1iq",
      "body": "Bupropion works really well for me. I’m in 150mg of XL and also 25mg of Sertraline. My only real issue is I’m really gassy but Beano helped me with that. \n\nGood luck!",
      "created_utc": 1741205538.0,
      "score": 2
    },
    {
      "id": "mg7i80d",
      "body": "Wellbutrin changed my life!",
      "created_utc": 1741206143.0,
      "score": 2
    },
    {
      "id": "mg7l6kw",
      "body": "I talked to a psychiatrist last week and she left a note for my family doctor on debating on prozac or wellbutrin",
      "created_utc": 1741206944.0,
      "score": 2
    },
    {
      "id": "mg7l8h8",
      "body": "This is my daily regimen! It has worked wonders for me!",
      "created_utc": 1741206959.0,
      "score": 2
    },
    {
      "id": "mg7pk9p",
      "body": "Bupropion has been great for me!",
      "created_utc": 1741208142.0,
      "score": 2
    },
    {
      "id": "mg7ql3i",
      "body": "Might feel \"off\" for a few weeks, but then you might feel better than ever",
      "created_utc": 1741208419.0,
      "score": 2
    },
    {
      "id": "mg7r3wx",
      "body": "Good luck man\nFind the right combo and you will feel so much better",
      "created_utc": 1741208563.0,
      "score": 2
    },
    {
      "id": "mg7ra5k",
      "body": "I don't know the med on the left but I've been taking bupropion for a few years now. I think it's bumped up my blood pressure a bit but otherwise, it's been really helpful. I'm at 300mg now but I get bumped to 450mg to help with the seasonal depression.  I take a couple other meds too but I feel like this is the one I feel the most when I run out. \n\nOh, and if they didn't tell you, don't take it at night. I knew it was a stimulant but my ex's psych didn't tell her and she became a major insomniac.",
      "created_utc": 1741208612.0,
      "score": 2
    },
    {
      "id": "mg7ubem",
      "body": "Wellbutrin worked wonders for me. Goodluck!",
      "created_utc": 1741209459.0,
      "score": 2
    },
    {
      "id": "mg7xj04",
      "body": "I took Bruproprion (Wellbutrin) for a bit and loved it - I lost 40 pounds in 2 weeks and LOVED my body! Made my depression so much worse though - I have very complex depression though so not many medications do work for me",
      "created_utc": 1741210336.0,
      "score": 2
    },
    {
      "id": "mg82yua",
      "body": "Good luck. This combo worked wonders for my brother but it fucked me up. I felt like a fucking zombie. Took them both for a month then had to quit because I wasn’t able to perform at work.",
      "created_utc": 1741211821.0,
      "score": 2
    },
    {
      "id": "mg83ynl",
      "body": "Welbutrin (Bupropion) has been amazing for me. There has been basically zero side effects and it gives me a boost of energy. It is also nice to know that you can stop the medication cold turkey and there's no withdraw, at least that's what my therapist has told me.",
      "created_utc": 1741212091.0,
      "score": 2
    },
    {
      "id": "mg84nz1",
      "body": "It didn't work for me, I'll be honest. They put me on Wellbutrin pretty quickly, and when it did nothing they pulled me off. I take something much better now.\n\nAs for the Propolilililol whatever that generic is called, I'm allergic. They put me on it to balance out the physical reaction I was having to another drug. I immediately broke out in hives. So, didn't work.\n\nThat's not to discourage you. Medications take time to find the right ones. It can be a lotta trial and error. I finally found the combination that works for me and I am much better with the meds I'm on.",
      "created_utc": 1741212284.0,
      "score": 2
    },
    {
      "id": "mg862fl",
      "body": "I take bupropion, works well for me.",
      "created_utc": 1741212678.0,
      "score": 2
    },
    {
      "id": "mg87wpr",
      "body": "That combo was the best I found for anxiety and had the lowest side effects.",
      "created_utc": 1741213202.0,
      "score": 2
    },
    {
      "id": "mg89o6z",
      "body": "I’ve taken both. Bupropion didn’t work for me but Propranolol did. It can help slow your heart rate so you don’t feel so anxious. I was in fight or flight mode for years.",
      "created_utc": 1741213712.0,
      "score": 2
    },
    {
      "id": "mg8ccar",
      "body": "I am on a lovely mix of 150mg Bupropion XL and 150mg sertraline and the addition of the bupropion had a massive but positive effect on my wellbeing. Hopefully it does the same for you!",
      "created_utc": 1741214493.0,
      "score": 2
    },
    {
      "id": "mg8cih6",
      "body": "I’m on propranolol 60mg and I had no anxiety the day I went skydiving. It’s that nice.",
      "created_utc": 1741214542.0,
      "score": 2
    },
    {
      "id": "mg8em15",
      "body": "I’m on these! I am on 300mg of bupropion daily but otherwise same exact combo. Wellbutrin increased my anxiety a bit which is why I increased propranolol to be daily instead of as needed, but I have felt amazing on the combo. I hope it works for you! ❤️",
      "created_utc": 1741215172.0,
      "score": 2
    },
    {
      "id": "mg8fk9c",
      "body": "Ive been taking around that same amount of bupropion for I think two years now. It has definitely made a difference for less depressive episodes. Other than that I do take fluoxetine for anxiety. You got this!",
      "created_utc": 1741215457.0,
      "score": 2
    },
    {
      "id": "mg8ipx6",
      "body": "I take 300mg of BUPROPION works pretty well",
      "created_utc": 1741216446.0,
      "score": 2
    },
    {
      "id": "mg8j0a7",
      "body": "Buproprion gives a lot of folks nightmares",
      "created_utc": 1741216536.0,
      "score": 2
    },
    {
      "id": "mg8j4o9",
      "body": "Hope this combo helps!",
      "created_utc": 1741216575.0,
      "score": 2
    },
    {
      "id": "mg8mwfk",
      "body": "I didn’t have much luck on bupropion, but I am on lexapro now and works much better. Hoping this combination works for you though! Everyone is different. \nImportant to take your mental heath seriously! So good job! Remember that it takes a while for SSRIs to really build up in your system and do their job! So if you don’t immediately feel better, don’t worry!",
      "created_utc": 1741217789.0,
      "score": 2
    },
    {
      "id": "mg92ypb",
      "body": "LOVE propranolol! I had a rare reaction where it made my hair thin out so for vanity reasons I stopped taking it",
      "created_utc": 1741223530.0,
      "score": 2
    },
    {
      "id": "mg94tzg",
      "body": "I've had good luck with Bupropion. I remember the build up of it was challenging though. I had ringing ears, minor hand tremors, and acute anxiety (which was new to me, as I was only taking it for depression). All of that subsided mostly...still a bit of ringing and tremors, but very minor to the point I can essentially ignore it. I added 25mg of Sertraline as well, which feels like it rounded me out nicely. After a lot of years of trying, I feel normal and like myself.",
      "created_utc": 1741224175.0,
      "score": 2
    },
    {
      "id": "mg96xkc",
      "body": "Bupropion made me feel awful but it may make you feel better",
      "created_utc": 1741224907.0,
      "score": 2
    },
    {
      "id": "mg982e3",
      "body": "Don’t be discouraged by the Wellbutrin, it made me feel like a zombie, but after several weeks, I noticed a drastic improvement in my mood. Propranolol also helps me with my anxiety sweats haha",
      "created_utc": 1741225296.0,
      "score": 2
    },
    {
      "id": "mg9bsap",
      "body": "Which doc prescribes this?",
      "created_utc": 1741226582.0,
      "score": 2
    },
    {
      "id": "mg9tf2k",
      "body": "I personally hated taking bupropion. It made my anxiety so much worse because of the heart palpitations and I couldn’t sleep while I was taking it.",
      "created_utc": 1741232908.0,
      "score": 2
    },
    {
      "id": "mg9vstb",
      "body": "I really wish Bupropion worked for me, and I hope it works for you!",
      "created_utc": 1741233842.0,
      "score": 2
    },
    {
      "id": "mg9w1sy",
      "body": "The Wellbutrin I’ve been taking that for a while for me it’s like an anti-antidepressant booster.  It also helps people quit smoking.",
      "created_utc": 1741233943.0,
      "score": 2
    },
    {
      "id": "mg9wx7u",
      "body": "I’ve been taking bupropion for over half a decade. That and lamotrigine are the main things keeping me going each day :)",
      "created_utc": 1741234288.0,
      "score": 2
    },
    {
      "id": "mga2edl",
      "body": "i take both of these (wellbutrin daily - 300mg XL & propanalol as needed) and i’m so grateful - they’ve been life changing for me! \n\nthe wellbutrin is nice because i haven’t noticed many negative side effects but my mood, motivation, libido, and overall outlook/approach to life has been positively affected! since starting the wellbutrin i’ve had more motivation to get into practices that improve my mental health which has also help immensely!\n\nthe propanalol is a newer med and so far i’ve just taken it before a couple interviews and wow it helped so much! typically im a sweaty, shaky, heart racey mess and while i still had a bit of sweat i wasn’t shaky and felt like i was able to speak more calmly and confidently! \n\nhope these meds help you as they have me! you may want to ask your dr about gene site testing if these meds dont work - its not covered by insurance but if you get it done and call them when you get your bill and be really nice and ask if they offer any help with the cost of the bill, it seems they just waive the fee totally! with the current state of the world idk if they’re getting the grant funding they were previously but def worth a shot!",
      "created_utc": 1741236570.0,
      "score": 2
    },
    {
      "id": "mga99j9",
      "body": "IF YOU NOTICE YOUR EARS RINGING IMMEDIATELY STOP TAKING THE BUPROP.\n\nAsk how I know 🫠",
      "created_utc": 1741239628.0,
      "score": 2
    },
    {
      "id": "mga9md4",
      "body": "that’s my combo and it helped me a lot. my mood improved sooo much. \n\nwishing you the best of luck",
      "created_utc": 1741239798.0,
      "score": 2
    },
    {
      "id": "mgaeyna",
      "body": "Get a genesight, please… genesight.com",
      "created_utc": 1741242481.0,
      "score": 2
    },
    {
      "id": "mgalri8",
      "body": "I was diagnosed with anxiety and depression and had tried almost every medication that could be prescribed for my diagnosis. Bupropion had been the only drug that worked for me.\n\nFor over a year at the start, I was starting to think that medication would not help and sometimes even made me feel worse because of all the different medications I was trying. Only when I got to Bupropion did anything start to change for me\n\nFor anxiety however, I wasn’t prescribed anything that I had to take, so I can’t give my review on Propranolol as I hadn’t had it\n\nIm starting to explore the possibility that I might have adhd instead 😂",
      "created_utc": 1741246255.0,
      "score": 2
    },
    {
      "id": "mgam1dm",
      "body": "What are these used for?",
      "created_utc": 1741246413.0,
      "score": 2
    },
    {
      "id": "mgamtiu",
      "body": "I've been taking these for a long time now. They have worked great for me, I hope they do the same for you",
      "created_utc": 1741246874.0,
      "score": 2
    },
    {
      "id": "mgaowpr",
      "body": "Buproprion have me suicidal thoughts like I never had before. \n\nPropranolol for rid of my anxiety, but, like, all of it, so i didn't even worry about things I really should have.",
      "created_utc": 1741248100.0,
      "score": 2
    },
    {
      "id": "mgapwok",
      "body": "Been taking Burpropion since November '24 and it changed my life for the good. I'm really happy about the medication choice of my psychiatrist.",
      "created_utc": 1741248701.0,
      "score": 2
    },
    {
      "id": "mgapz95",
      "body": "Propranolol gang. Been on it for 15 years nearly.",
      "created_utc": 1741248746.0,
      "score": 2
    },
    {
      "id": "mgaxxla",
      "body": "Ex covert narc wife was on bupropion. The stuff worked and when she was\nOff it, life was completely hell. She would cycle on and off the meds while trying to get pregnant which made her mental\nState completely unpredictable. It is vital to stay on the stuff and not play games of off and on.",
      "created_utc": 1741253736.0,
      "score": 2
    },
    {
      "id": "mgbnez4",
      "body": "I quit my anti-depressants so I wouldnt get black out drunk after two beers lol",
      "created_utc": 1741266744.0,
      "score": 2
    },
    {
      "id": "mgbqvjj",
      "body": "Hey everyone! We’re researching how people manage their mood, sleep, fitness, and journaling—what’s working, what can be improved. If you track your mental or physical health, I’d love your input on a **quick 5-minute survey**: message me for details. It might also spark some new ideas for your own routine. Thanks so much! 🙏",
      "created_utc": 1741268022.0,
      "score": 2
    },
    {
      "id": "mgbr21c",
      "body": "My first day started at 8. Be strong. Don’t give up. I’m not sure what you have but we all stick together because we all understand how much it sucks",
      "created_utc": 1741268087.0,
      "score": 2
    },
    {
      "id": "mgbttvf",
      "body": "I’m currently taking both & I personally LOVE propranolol, the Wellbutrin I haven’t really noticed a huge difference. I’ve been on propranolol for years now for the physical symptoms of anxiety & it does wonders! I’ve been on Wellbutrin for almost 2 months now. I will say Wellbutrin for me doesn’t cause me any side effects like other meds have.",
      "created_utc": 1741269047.0,
      "score": 2
    },
    {
      "id": "mgcze63",
      "body": "After trying everything, bupropion is what worked for me. Stick with it and good luck!",
      "created_utc": 1741281509.0,
      "score": 2
    },
    {
      "id": "mgdhmr2",
      "body": "I'm on buproprion.  Works well",
      "created_utc": 1741286614.0,
      "score": 2
    },
    {
      "id": "mgdj02r",
      "body": "Taking Bupropion— makes showering easier (yes, I know) and cleaning and mood better. I would say it makes me a little aggro, but I also take Vyvanse lol. Bupropion made me overheat for the first week or so of taking it, haven’t noticed much of a problem now.",
      "created_utc": 1741287000.0,
      "score": 2
    },
    {
      "id": "mgefjqz",
      "body": "LOVE LOVE LOVE propranolol it’s one of my favorites i will never stop taking that med and then bupropion i had a horrible reaction to but i was also taking zoloft with it so that’s couldn’t been it but it made me sewercidual",
      "created_utc": 1741296111.0,
      "score": 2
    },
    {
      "id": "mh3ivc3",
      "body": "Everyone is different, just remember that when you are taking medications. So, \"they say that you will feel the effects within 3 weeks\", for me it was 3 months. Give yourself time. Try not to think too much about the medications. Be sure to take them as prescribed, but don't think every day 'do i feel better?' \"are these worth it?\" etc. You have to give them a chance. A good chance. Don't stop suddenly either.\n\nIt is best to carry on with life, use other techniques to help as well. Then, say after a good month or your next dr's appointment ask yourself, how do you feel?\n\nSide effects: the only side effect I've ever had from meds is a dry mouth. Easy cure: mints in my pocket always and a water bottle wherever I go!\n\nYou will know if you are on the right meds, after awhile, if you stop taking them for even one day and all of your symptoms come back ten fold. Then, you are on the right meds!",
      "created_utc": 1741643415.0,
      "score": 2
    },
    {
      "id": "mhbzber",
      "body": "PTSD? The Propranolol anyway?",
      "created_utc": 1741752643.0,
      "score": 2
    },
    {
      "id": "mhcj173",
      "body": "They gave me buproprion and it gave me night terrors to the point my wife woke me up bc I was trying to rip her ear off in my sleep....dr said,\"thats just a side effect\"....they gave me propanolol with my 3 klonopin a day and it did nothing. Still have panic attacks daily and heart palpitations. Idk what to do but those two meds were useless for me... :/",
      "created_utc": 1741763447.0,
      "score": 2
    },
    {
      "id": "mgacodt",
      "body": "Didn’t know this would take off like this, trying to acknowledge everyone and get back to you all but there’s a lot! I appreciate the time and effort to provide feedback as I start this journey! Wish nothing but the best for you all!!! Thank you!!!",
      "created_utc": 1741241301.0,
      "score": 1
    },
    {
      "id": "mgbmqac",
      "body": "[removed]",
      "created_utc": 1741266479.0,
      "score": 1
    },
    {
      "id": "mgbor0k",
      "body": "[removed]",
      "created_utc": 1741267248.0,
      "score": 1
    },
    {
      "id": "mh2ihul",
      "body": "Bupropion saved me fr",
      "created_utc": 1741632923.0,
      "score": 1
    },
    {
      "id": "mg629wa",
      "body": "Why are they in those containers? Don't they have a specific box with the name and all on it?\n\n(Cultural shock for me, honestly)",
      "created_utc": 1741191635.0,
      "score": 1
    },
    {
      "id": "mgkiinr",
      "body": "On what? It’s just Wellbutrin and propranolol. ",
      "created_utc": 1741378466.0,
      "score": 0
    },
    {
      "id": "mg68ac7",
      "body": " Flexing your antidepressants lol",
      "created_utc": 1741193340.0,
      "score": -6
    },
    {
      "id": "mg5xd7h",
      "body": "I'm taking it for heart palpitations and anxiety",
      "created_utc": 1741190217.0,
      "score": 41
    },
    {
      "id": "mg6dnej",
      "body": "That is good to hear! Was initially prescribed for essential tremors. Surprised how versatile it has been for everything and everybody else.",
      "created_utc": 1741194855.0,
      "score": 9
    },
    {
      "id": "mg6vyoz",
      "body": "I was having constant panic attacks until I started taking it.",
      "created_utc": 1741199935.0,
      "score": 10
    },
    {
      "id": "mg5wtpq",
      "body": "Wow, that’s great to hear! I hope that you’re better and that’s the reasoning why you no longer need to take it!",
      "created_utc": 1741190062.0,
      "score": 7
    },
    {
      "id": "mhbvxdq",
      "body": "I have such horrible anxiety, never any self-harm issues, and also take Wellbutrin. It’s all so worth it. Makes me feel so normal. Best feeling",
      "created_utc": 1741751178.0,
      "score": 2
    },
    {
      "id": "mg6i1ya",
      "body": "From what I can tell, it is very different from person to person. It does wonders for me, but I have friends who can't stand the side affects",
      "created_utc": 1741196085.0,
      "score": 7
    },
    {
      "id": "mhbwcj3",
      "body": "Wellbutrin as well as every antidepressant works differently for everyone. I’ve been on so many. But Cymbalta paired with Wellbutrin and Proponol, Gabapentin and Klonozapam (keeps all my anxiety away, and doesn’t keep me depressed); I’m feeling quite content with life",
      "created_utc": 1741751357.0,
      "score": 2
    },
    {
      "id": "mg6r7km",
      "body": "I appreciate that as I’m trying and want to be better!Thank you!!!",
      "created_utc": 1741198627.0,
      "score": 7
    },
    {
      "id": "mg6qeig",
      "body": "Nice! Glad to hear that because I’m kind of on that same path of impulsive behavior with my frustration or anger at times! Best wishes to you!",
      "created_utc": 1741198402.0,
      "score": 4
    },
    {
      "id": "mg6r2nn",
      "body": "Clarity, I like that! Thank you for sharing!!!",
      "created_utc": 1741198589.0,
      "score": 2
    },
    {
      "id": "mhbxf2y",
      "body": "Feeling “normal” is the goal! And it means you shouldn’t stop taking the meds! The meds got you there",
      "created_utc": 1741751809.0,
      "score": 1
    },
    {
      "id": "mg68apz",
      "body": "My doctor prescribed the SR at 100 mg 2x daily instead for this reason. We planned to increase the dose but I don’t feel like I need to.",
      "created_utc": 1741193343.0,
      "score": 5
    },
    {
      "id": "mg89r1j",
      "body": "I love my Sertraline. Helps immensely with Social Anxiety.",
      "created_utc": 1741213736.0,
      "score": 4
    },
    {
      "id": "mg6qvrc",
      "body": "I appreciate it! Thank you for sharing!",
      "created_utc": 1741198535.0,
      "score": 2
    },
    {
      "id": "mgagyib",
      "body": "How long did it take for sat to saturate/kick in?",
      "created_utc": 1741243559.0,
      "score": 2
    },
    {
      "id": "mg6pa8r",
      "body": "Hmm, 🧐 see this is why I’m hesitant but everyone reacts differently so we’ll see after a few days/weeks!",
      "created_utc": 1741198091.0,
      "score": 3
    },
    {
      "id": "mg9nljc",
      "body": "🙌🏽❤️",
      "created_utc": 1741230739.0,
      "score": 2
    },
    {
      "id": "mg6q9df",
      "body": "Glad to hear, wishing you well!",
      "created_utc": 1741198362.0,
      "score": 1
    },
    {
      "id": "mg6okv8",
      "body": "Glad to hear that part of the pictured medication helps, best of luck to you!",
      "created_utc": 1741197892.0,
      "score": 2
    },
    {
      "id": "mg64dpr",
      "body": "Abour 5-10 bucks with Good Rx. With insurance it would be free for me.",
      "created_utc": 1741192232.0,
      "score": 3
    },
    {
      "id": "mg6qn70",
      "body": "These run in my family apparently so I’m willing to try to find a way to help myself! Glad to hear these are working for you!",
      "created_utc": 1741198470.0,
      "score": 3
    },
    {
      "id": "mg6q7ie",
      "body": "Was waiting on the CBD/THC aspect, still uncertain about taking these but it’s worth a shot if it helps!\nI appreciate your time and feedback!",
      "created_utc": 1741198348.0,
      "score": 2
    },
    {
      "id": "mg6pugx",
      "body": "Very glad to hear, wishing you well!",
      "created_utc": 1741198247.0,
      "score": 1
    },
    {
      "id": "mg6pste",
      "body": "Hmm 🤔 \nYeah I was kind of taken aback having these prescribed upon my first visit with a new therapist yesterday, mostly positive reviews so we’ll see in due time what happens!",
      "created_utc": 1741198234.0,
      "score": 2
    },
    {
      "id": "mg6p0zu",
      "body": "Thank you? Haha not quite sure yet if I wanted to be here but so far everyone’s feedback has been positive!",
      "created_utc": 1741198019.0,
      "score": 2
    },
    {
      "id": "mg6og80",
      "body": "Beta blocker for anxiety/depression, been seeing different specialists to gauge where I’m at and this one I saw this week for the first time straight out the gate recommended medication.. started today but I’m still a bit hesitant what these do",
      "created_utc": 1741197857.0,
      "score": 2
    },
    {
      "id": "mg72rc2",
      "body": "Really great to hear that it’s helped! I do look forward to whatever comes next for my betterment!\nThank you for sharing!",
      "created_utc": 1741201813.0,
      "score": 2
    },
    {
      "id": "mg72l68",
      "body": "Whoa, crazy to hear! Not even with higher dosage?",
      "created_utc": 1741201765.0,
      "score": 1
    },
    {
      "id": "mg7q5j4",
      "body": "Makes sense!\nI appreciate the thought and encouragement!",
      "created_utc": 1741208303.0,
      "score": 3
    },
    {
      "id": "mg6qzu8",
      "body": "That’s great to hear that they’re working for you, gives me hope! Best of luck to you on your journey!",
      "created_utc": 1741198567.0,
      "score": 1
    },
    {
      "id": "mg6qt3h",
      "body": "Hmm 🤨 \nAlways strange how the same meds can cause people to react differently, hoping the best for you and for all of us!",
      "created_utc": 1741198515.0,
      "score": 2
    },
    {
      "id": "mg6pzvj",
      "body": "Whoa, yeah I was fighting against taking these but I don’t see too much wrong? We’ll see though what happens, wishing you the best on your journey!",
      "created_utc": 1741198289.0,
      "score": 1
    },
    {
      "id": "mg6pj5r",
      "body": "I’ve seen quite a few that are in the left too! We’ll see what happens on this road, wishing you well on your endeavors!",
      "created_utc": 1741198161.0,
      "score": 2
    },
    {
      "id": "mg6pdqw",
      "body": "First day so nothing yet to get used to, wishing you the best on your journey!",
      "created_utc": 1741198119.0,
      "score": 1
    },
    {
      "id": "mg6p4q7",
      "body": "Hmm, I’ve been seeing that one come up! Hoping and wishing the best for you!",
      "created_utc": 1741198048.0,
      "score": 2
    },
    {
      "id": "mg6ow0e",
      "body": "Glad to hear I’m not the only one, thank you for sharing! Wishing you the best!",
      "created_utc": 1741197980.0,
      "score": 1
    },
    {
      "id": "mg6orhs",
      "body": "I appreciate you sharing! Idk how I feel about it yet but so far the feedback has been pretty positive from everyone though.",
      "created_utc": 1741197945.0,
      "score": 2
    },
    {
      "id": "mg733kp",
      "body": "Seems like a wide ranged medication, I literally sleep too much as my escape but got prescribed this for anxiety along with depression",
      "created_utc": 1741201909.0,
      "score": 2
    },
    {
      "id": "mg9fn06",
      "body": "Nurse Practitioner got me on this!",
      "created_utc": 1741227918.0,
      "score": 1
    },
    {
      "id": "mgapcy3",
      "body": "Thank you for this!",
      "created_utc": 1741248369.0,
      "score": 1
    },
    {
      "id": "mgapbhg",
      "body": "Depression and anxiety as they are hand in hand, beta blockers to help control the physical symptoms",
      "created_utc": 1741248344.0,
      "score": 1
    },
    {
      "id": "mjb3y5a",
      "body": "🤣",
      "created_utc": 1742737266.0,
      "score": 1
    },
    {
      "id": "mh3lrrp",
      "body": "I appreciate this response and your thoughts to recovery! So far something has given me an insane case of insomnia, my take is that if I don’t sleep I can’t escape it how I usually do by going to sleep or taking excessive naps.\n\nI’m not quite mad at it but I’ve also picked back up BJJ to get the physicality out of me so I kind of need rest to  do this and to function haha\n\nSo far, it’s been good.. just trying to cope with everything and do what I can to keep pushing forward!",
      "created_utc": 1741644274.0,
      "score": 1
    },
    {
      "id": "mhc7zip",
      "body": "Part of it based on childhood and adulthood experiences, for the anxiety sweats and shakes - helps to control the physical aspects of it",
      "created_utc": 1741756909.0,
      "score": 1
    },
    {
      "id": "mhdq995",
      "body": "Whoa, very sorry to hear that those aren’t working! They do seem as very general medicines though as they cover a wide range of symptoms it seems like!\nStill under the advising of care? \nMaybe they can change up what you’re doing/taking??",
      "created_utc": 1741785982.0,
      "score": 1
    },
    {
      "id": "mgbmqda",
      "body": "Your comment has been removed. Surveys and polls are not allowed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1741266480.0,
      "score": 1
    },
    {
      "id": "mgbor2h",
      "body": "Your comment has been removed. Surveys and polls are not allowed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1741267249.0,
      "score": 1
    },
    {
      "id": "mg67jks",
      "body": "Most meds get ordered in big multiple dose bottles (generic usually). The pharmacy uses counters for each individual prescription out of those big bottles, and then puts them in child safe bottles. Some name brand meds come in original sealed bottles, but only a small percentage of specialized meds come sealed in boxes/dose packs. Things like a Z-Pak or PredniSONE and some other steroids come in an original dose pack. Also, sample packs for meds like Eliquis would be in a box with a dose pack, but that would usually come from your Dr directly.",
      "created_utc": 1741193131.0,
      "score": 3
    },
    {
      "id": "mg69cdb",
      "body": "What country are you in that they come in boxes? Almost every medication in the US is filled this way.",
      "created_utc": 1741193636.0,
      "score": 2
    },
    {
      "id": "mg5y1ek",
      "body": "I took it for migraines and anxiety, helped with my anxiety a bunch",
      "created_utc": 1741190410.0,
      "score": 21
    },
    {
      "id": "mg63yq8",
      "body": "For anxiety I recommend supplements rather than medication.  \nTry ashwagandha powder for your diet.\n\nFor heart try to drink taurine (no, it's not energy booster, it's not what gives energy in energy drink, it's sugar, and taurine balances it out. Read up about taurine to get the insight.",
      "created_utc": 1741192113.0,
      "score": -19
    },
    {
      "id": "mgba01f",
      "body": "I was taking it with Lexapro a couple years ago and I didn't really notice the Bupropion lol. My mom used to take it too. It can have pretty mild effects but I guess it all depends on your brain.",
      "created_utc": 1741260815.0,
      "score": 2
    },
    {
      "id": "mgadxmy",
      "body": "Proud of you for starting I know it’s hard!!",
      "created_utc": 1741241948.0,
      "score": 6
    },
    {
      "id": "mhbx3ls",
      "body": "Keep speaking to your psychiatrist and therapist, sometimes meds are the best way. If our body can’t manufacture enough neurotransmitters, then meds can help. They’re a life saver. Even my winter blues/S.A.D. is diminished when on this stuff. Cymbalta and Vyvance for my Depression/ADHD in the AM, Wellbutrin in the PM, and before sleep, clonozapam and gabapentin. Plus 30 mg of Buspar 3x a day…. It’s wonderful to not feel anxious about things. \n\nMy self-esteem is great.  I’m making a great difference at work, and people like me and know my career experience is one of a kind. I’m respected and appreciated.",
      "created_utc": 1741751673.0,
      "score": 2
    },
    {
      "id": "mg6swtf",
      "body": "Yeah, I have BPD, so it's been helpful along with DBT classes.",
      "created_utc": 1741199102.0,
      "score": 3
    },
    {
      "id": "mg6dkhl",
      "body": "The SR?",
      "created_utc": 1741194833.0,
      "score": 5
    },
    {
      "id": "mg68ghj",
      "body": "I’m now on 150 SR twice a day. I originally got moved up to the 450XL but it was causing tremors so was switched to this dose.",
      "created_utc": 1741193388.0,
      "score": 5
    },
    {
      "id": "mgagxf7",
      "body": "How long did it take to saturate/kick in?",
      "created_utc": 1741243543.0,
      "score": 2
    },
    {
      "id": "mgclbvc",
      "body": "It’s been so long, I honestly don’t remember \n\nMaybe a few days?",
      "created_utc": 1741277476.0,
      "score": 2
    },
    {
      "id": "mg6q9q7",
      "body": "You’re taking the right steps to work on your mental health. That deserves a congratulations",
      "created_utc": 1741198365.0,
      "score": 2
    },
    {
      "id": "mg7cjxp",
      "body": "People here say they love them, I should also get them but man, the waiting lists to see a neurplogist around here are insane. 3-6 months just go get the first appointment.  What the fuck",
      "created_utc": 1741204559.0,
      "score": 2
    },
    {
      "id": "mg74nj2",
      "body": "Yup. I took them for about 5 months and I felt no difference. It felt like I was taking pills for no reason. I’m just on Adderall now and my anxiety has completely gone away. I’m almost tooo chilll though lol",
      "created_utc": 1741202341.0,
      "score": 3
    },
    {
      "id": "mg7msx3",
      "body": "Thanks!  Yeah, it is helpful, but the clammy skin feeling gets annoying.",
      "created_utc": 1741207392.0,
      "score": 2
    },
    {
      "id": "mg7n8dr",
      "body": "Of course! Good luck!! I hope they work well for you, and make sure to report any side effects or changes in your lifestyle with your provider 🫶",
      "created_utc": 1741207511.0,
      "score": 2
    },
    {
      "id": "mh3q4sy",
      "body": "Hey there! Insomnia, welcome to my club :) \n\nYour body is probably just adjusting to the extra pick me up and go neurons! \n\nYes, exercise (not sure what BJJ is) s excellent and this habit will help you during dark times as well. \n\nNapping is a way to escape absolutely, but stopping the naps will help you to sleep well at night! \n\nGet into a nighttime habit. Try turning off your phone an hour before bed. Even leave it in another room, or silence it for a certain time (for me it is 10 p..m.). Go back to reading, if you enjoy doing that before bed, or some meditation. My habit is terrible-fall asleep watching a show. Silly habit and terrible for my sleeping.\n\nSleep hygiene is a huge deal and most of us don't practice it at all! \n\nMaybe I'll make a post about Box Breathing. A technique I learned about a year ago to help with my panic attacks. You can do that too while trying to get to sleep. All sorts of ways to beat insomnia, if it is just a slight side effect of the  medication.",
      "created_utc": 1741645598.0,
      "score": 2
    },
    {
      "id": "mg67uix",
      "body": "But isn't there a possibility to contaminate them in some way when handling them like that? I don't believe that 100% of the workers follow strictly the safety protocol",
      "created_utc": 1741193217.0,
      "score": 4
    },
    {
      "id": "mg6c3d9",
      "body": "I am from Bulgaria. Most medicine in Europe come in their own pack",
      "created_utc": 1741194416.0,
      "score": 2
    },
    {
      "id": "mg60c30",
      "body": "How migraine feels like? My side head hurts above jaw and sometime when i push my head with finger it hurts",
      "created_utc": 1741191077.0,
      "score": 8
    },
    {
      "id": "mhbxdmx",
      "body": "Really awesome of you to share your experience! Definitely a relief to know we all aren’t alone dealing with the feelings and emotions!\n\nI appreciate you, thanks!",
      "created_utc": 1741751791.0,
      "score": 2
    },
    {
      "id": "mhbx7xc",
      "body": "BPD? DBT?",
      "created_utc": 1741751725.0,
      "score": 1
    },
    {
      "id": "mg6hkcb",
      "body": "Sorry that was vague lol, Bupropion SR (sustained release) instead of XL (extended release)",
      "created_utc": 1741195946.0,
      "score": 6
    },
    {
      "id": "mgc7bon",
      "body": "I actually felt it right away (45 mins). That was just because it was new in my system. After I took the first dose, I noticed I was able to have conversations while holding eye contact, which I really struggled with before. Then, of course, that initial intensity tapered off. I can’t really say how long it took to saturate, but they say give it several weeks. I started off at 25mg and now (8 years later) I’m at 100mg.",
      "created_utc": 1741273425.0,
      "score": 2
    },
    {
      "id": "mh3txz2",
      "body": "Definitely appreciate you and all the thought put in this! Thank you for sharing your experience and feedback!\n\nPS - BJJ is Brazilian Jiu Jitsu 🤙🏽🤙🏽🤙🏽",
      "created_utc": 1741646774.0,
      "score": 1
    },
    {
      "id": "mg689sj",
      "body": "This is standard practice in the US and Canada.",
      "created_utc": 1741193336.0,
      "score": 5
    },
    {
      "id": "mg6bt55",
      "body": "Dump some in/on a special surface, count it out (either by machine or with a stick thing), and funnel it into your new bottle. Have never seen anyone touch a pill. Contamination? I guess that could happen somehow, but I've never heard of it.",
      "created_utc": 1741194336.0,
      "score": 2
    },
    {
      "id": "mg6e0r0",
      "body": "I have to take 6 different pills per day, and they are all in these bottles, i've never had an issue with contamination. I also use Amazon pharmacy here in the US, and get my meds in the mail within 2 days!\n\nAlso i get mine in 90 day quantities, its actually cheaper than a 30 day quantity",
      "created_utc": 1741194960.0,
      "score": 2
    },
    {
      "id": "mg7j1s0",
      "body": "In a warehouse environment like Amazon they use machines that are always cleaned.",
      "created_utc": 1741206367.0,
      "score": 2
    },
    {
      "id": "mg610o3",
      "body": "for me, they were typically pulsating headaches that wouldn't go away with most rest and would make me sensitive to lights but I'm sure there's a bunch of other symptoms",
      "created_utc": 1741191274.0,
      "score": 8
    },
    {
      "id": "mg6n53i",
      "body": "For me (I'm someone else), migraines make me want to throw up, feel dizzy, brain stopping to work properly. Even with ibuprofen, the pain goes away but the weird feeling and dizziness doesn't go away.",
      "created_utc": 1741197492.0,
      "score": 6
    },
    {
      "id": "mhbxwoc",
      "body": "My dad is also a psychiatrist and I grew up knowing therapy and meds were good. He even had me tested for AD(H)D when I was in 5th grade, he didn’t do the testing, but I did have pretty wild ADD at the time. Just turned 50 last Friday, but still feel and look like I’m in my mid-30s (good genes, lol)… but knowing mental health is so important to living a full life, I do what I must to stay feeling normal. We should all do what it takes, for some it’s much harder than others, but normal is also a state of mind, as much as it’s a feeling.",
      "created_utc": 1741752020.0,
      "score": 2
    },
    {
      "id": "mhbzgzp",
      "body": "BPD = Borderline Personality Disorder. The easiest description for me is that you see everything in black or white, and there's very quick mood swings. [Mayo Clinic explains it better](https://www.mayoclinic.org/diseases-conditions/borderline-personality-disorder/symptoms-causes/syc-20370237).\n\nDBT = Dialectal Behavior Therapy. This is a kind of talk therapy that is done by changing your reaction towards people and events that are negative. For example, if you know someone always makes you mad, rather than having an angry outburst, you accept that that is how they are, and you go on your way. [Harvard Medical has an in-depth article about it.](https://www.health.harvard.edu/blog/dialectical-behavior-therapy-what-is-it-and-who-can-it-help-202401223009)\n\nDialectical behavior therapy is very helpful for borderline personality disorder, as it helps you not react on the very first emotion you feel, and instead being mindful of what is happening.\n\nHopefully this helps explain both! I am not an expert, even though I have done the courses. I'm sure more people here could fill in what I didn't cover.",
      "created_utc": 1741752712.0,
      "score": 2
    },
    {
      "id": "mgi6eg3",
      "body": "I am taking 25mg too, but can't feel anything. 4 days until I start 50mg. \n\n\nDoes it get better? ",
      "created_utc": 1741353183.0,
      "score": 2
    },
    {
      "id": "mh3x559",
      "body": "Oooo! I thought it was Jiu Jitsu...but wasn't sure if it was boxing too! \n\nI hope you get the sleep you need because we all know that poor sleep makes depression/ anxiety worse. Keep us posted with your progress!",
      "created_utc": 1741647758.0,
      "score": 2
    },
    {
      "id": "mhbzwpx",
      "body": "Awesome! Glad you’re feeling much more in control and comfortable with how the meds are fixing your Neurotransmitters! Isn’t that what it’s really all about? Stupid brain doing stupid things…. “It’s the small stuff,” sometime",
      "created_utc": 1741752910.0,
      "score": 1
    }
  ]
}