{
  "id": "1jfzto8",
  "title": "Sexual assault by a celebrity has made me hate living.",
  "selftext": "My mental health is very low and has been since I was sexually assaulted by a person in the media. Struggles with depression are not new for me but the way I would cope with it was a lot healthier. Now I’ve started cutting myself and I’ve turned to alcohol to help cope with it. I even refused to leave my house for a year because of them. ",
  "created_utc": 1742505200.0,
  "score": 305,
  "num_comments": 79,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1jfzto8/sexual_assault_by_a_celebrity_has_made_me_hate/",
  "comments": [
    {
      "id": "miv5sgl",
      "body": "**Hello u/!**\n\nThank you for tagging your post with a content warning. This helps us share useful resources and prevent unintended triggers.\n\n*Your post may be held for review.*\n\n\n**Resources:**\n- [Rainn.org](https://rainn.org/types-sexual-violence) – Types of sexual violence\n- [Rainn.org](https://rainn.org/after-sexual-assault) – What to do after an assault\n- [Rainn.org](https://rainn.org/effects-sexual-violence) – Effects of sexual violence\n- [HelpGuide](https://www.helpguide.org/articles/ptsd-trauma/recovering-from-rape-and-sexual-trauma.htm) – Recovering from trauma (available in [multiple languages](https://survivorsnetwork.org.uk/resource/survivors-self-help-guide/))\n- [Find A Helpline](https://findahelpline.com/i/iasp) – Global helplines\n- Consider visiting r/rape or r/sexualassault for support.\n- [Supporting Survivors](http://www.tstresources.org/supporting-survivors/) – How to support survivors\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1742505200.0,
      "score": 1
    },
    {
      "id": "miveyf6",
      "body": "A celebrity is just a person, maybe it will help you heal not to think of them as anything special",
      "created_utc": 1742507975.0,
      "score": 200
    },
    {
      "id": "miv6ka5",
      "body": "Talk to a therapist",
      "created_utc": 1742505434.0,
      "score": 234
    },
    {
      "id": "miviopn",
      "body": "Hi I am a Licensed Professional Counselor and Certified Trauma and Sex therapist. I just want to start by saying I’m so sorry you’re going through this. What you’re feeling is completely valid, and surviving sexual assault—especially by someone in the public eye—can add layers of trauma, powerlessness, and isolation that make healing feel even harder. The fact that you’re reaching out and putting this into words is already a huge step, and you deserve support as you navigate this.\n\nI strongly encourage you to reach out to a trauma-informed therapist who can walk with you through this healing process. EMDR, somatic therapy, or other trauma-focused approaches can help process what happened in a way that doesn’t keep you stuck in survival mode. If therapy feels too big right now, even reaching out to a crisis line or a trusted person in your life could be a way to start feeling less alone.\n\nYou are not broken, and your response to trauma is not a reflection of your worth. Healing is possible, even if it feels far away right now. You deserve care, safety, and support. Please be gentle with yourself.\n\nSending love and healing your way!",
      "created_utc": 1742509154.0,
      "score": 123
    },
    {
      "id": "miva22a",
      "body": "Tell the police ",
      "created_utc": 1742506492.0,
      "score": 50
    },
    {
      "id": "miv8w2v",
      "body": "We believe you ❤️",
      "created_utc": 1742506137.0,
      "score": 65
    },
    {
      "id": "mivarsq",
      "body": "Report them",
      "created_utc": 1742506711.0,
      "score": 41
    },
    {
      "id": "mivf7yt",
      "body": "im sorry that happened to you that’s awful. talking to a therapist can help and if you have any proof you can go to the police with it or at least sign a restraining order to help you feel safer",
      "created_utc": 1742508058.0,
      "score": 12
    },
    {
      "id": "mivayoy",
      "body": "You are seen",
      "created_utc": 1742506770.0,
      "score": 18
    },
    {
      "id": "mivingf",
      "body": "i am so sorry you are going through this. i wouldn’t have made it through without therapy. you do not deserve alcoholism and self harm.",
      "created_utc": 1742509143.0,
      "score": 8
    },
    {
      "id": "miw6n9p",
      "body": "EMDR and Somatic Experiencing will heal you. But also taking action is a healing process worth taking; get in touch with a high profile attorney to sue that celebrity's ass and make a splash with a press conference and release. Go to the police simultaneously and file a criminal complaint. Taking action, not revenge, but action to ensure this doesn't happen to others will be part of your healing. In fact youre not the only one, if someone is a predator they continue. You will be saving others from further harm. Good luck",
      "created_utc": 1742517018.0,
      "score": 7
    },
    {
      "id": "mivw1wg",
      "body": "A therapist can help. So can support groups. There are some you can easily join right now (on Facebook even). Your situation is pretty unique, too, though. You have to worry about seeing this person everywhere you go. It sounds like you haven’t gotten any sort of ‘justice’ either, and that makes it hard. There can be rage that comes with that… seek out support through formal channels. You’d be surprised how much they can help. 💕I’m glad you reached out here. That’s a good step forward.",
      "created_utc": 1742513438.0,
      "score": 4
    },
    {
      "id": "miwbbu8",
      "body": "Yeah I know how you feel. I agree with everyone saying confide in professionals. You can even change the name or leave it anonymous if it gives you a deeper sense of security. What you are feeling is entirely understandable. My DMs are\nopen if you need to vent to a woman who was also sexually assaulted and also understands, sees and believes you.",
      "created_utc": 1742518692.0,
      "score": 3
    },
    {
      "id": "mivr0wz",
      "body": "Hey, go to a therapist and talk about what happened. They can help",
      "created_utc": 1742511834.0,
      "score": 3
    },
    {
      "id": "miwvihd",
      "body": "Have you reported them? Because doing so could potentially save someone else from having the same fate. I’m sorry this happened to you",
      "created_utc": 1742526043.0,
      "score": 3
    },
    {
      "id": "mixs5x3",
      "body": " Perhaps it's time to take your power back and speak to a lawyer? Or the police? Document what has happened to you. I know of someone who experienced a sexual assault at school. She ended up receiving a financial settlement which means she doesn't have financial stress. It helps enormously. It's an arduous process, but justice is important. ",
      "created_utc": 1742542640.0,
      "score": 3
    },
    {
      "id": "miwivr3",
      "body": "The way I stopped cutting was I taught myself how to love myself first and to heal from people pleasing. This is what has been helping me to heal from childhood trauma. \nI haven't done that in more than 15 years or so.",
      "created_utc": 1742521471.0,
      "score": 5
    },
    {
      "id": "mjf48kx",
      "body": "speak out one day",
      "created_utc": 1742784796.0,
      "score": 2
    },
    {
      "id": "mp0jk1a",
      "body": "I’m sorry love 🫀trauma therapy and recognizing it takes time to heal. I hope you receive the support you need. I’ve been purposefully celibate after my awful abusive experience with an actor. Cuz of defamation laws, I don’t think I can name him. Just know healing takes time and you aren’t alone. Trying not shame yourself is the most important aspect as is getting the support you need. \n\nMy friend works in volunteering for organizations that help w SA and they told me people often take years to even phone in for support or talk about it. So whatever your pace is, that’s natural too. \n\nMy experience was years ago, but I developed PTSD as a result — I also self shamed and that didn’t help things. Finding resources or podcasts might help with a validating perspective and otherwise anonymously reporting if you feel up for it. But don’t push yourself into anything you aren’t ready for. Trauma is complex and it takes so much time to process an experience.\n\nGentleness and self-compassion however you can incorporate it is essential and if you are able and when you are ready, reaching out for support & resources too. \n\nI know it’s difficult seeing people support those who have done so many horrible things behind the scenes and my heart breaks for all the women (and people really, just speaking as a woman) who have experienced that. \n\nPraying they all get called and more people come forward cuz there’s usually more than one. Sending you love 💗may the following year(s) treat you gently and you find safety once again in your being. Slowly, in a way that is gentle on your nervous system, because you deserve all the gentleness. ",
      "created_utc": 1745606009.0,
      "score": 2
    },
    {
      "id": "miv7p5g",
      "body": "Expose the celebrity here at least, it will make you feel better",
      "created_utc": 1742505776.0,
      "score": 4
    },
    {
      "id": "mivlodd",
      "body": "[removed]",
      "created_utc": 1742510108.0,
      "score": 1
    },
    {
      "id": "mixg2na",
      "body": "Say something.  Help is here.  You'll be cheered, not ridiculed.",
      "created_utc": 1742535306.0,
      "score": 1
    },
    {
      "id": "miyajga",
      "body": "expose them it will make you feel better. They are not special and deserve their karma",
      "created_utc": 1742553877.0,
      "score": 1
    },
    {
      "id": "miyfh7q",
      "body": "You need to report this, OP. Celebs are nothing special behind closed doors.",
      "created_utc": 1742556334.0,
      "score": 1
    },
    {
      "id": "mjyk7ms",
      "body": "Oh my god I'm so sorry. This must be very hard to deal with. Maybe try and reach out to some close friends and professionals? I hope you get better soon. ❤️\n\n\nLots of love 🫶❤️😊",
      "created_utc": 1743048864.0,
      "score": 1
    },
    {
      "id": "miv677r",
      "body": "Who is the celebrity??",
      "created_utc": 1742505324.0,
      "score": -18
    },
    {
      "id": "mivj0vm",
      "body": "Name and shame the celebrity.",
      "created_utc": 1742509261.0,
      "score": -7
    },
    {
      "id": "mivlejn",
      "body": "AIR IT OUT\nIF YOU STAND ON TEN PPL WILL HAVE YOUR BACK REGARDLESS AND WATCH HOW MANY PPL PROLLY NOT BE SURPRISED AT WHO IT COULD BE, FUCK THAT PERSON!! DO NOT SIT IN IT AND DO NOT LET THIS PERSON HAVE THE POWER OVER YOU \nWE SHALL SPIT AT THEM TOGETHER",
      "created_utc": 1742510019.0,
      "score": -2
    },
    {
      "id": "mivi2x0",
      "body": "This post seems fishy.",
      "created_utc": 1742508961.0,
      "score": -15
    },
    {
      "id": "mivqnbq",
      "body": "I’d say report them to the police and hopefully get them cancelled but most importantly talk to someone in person that can help you get through this",
      "created_utc": 1742511712.0,
      "score": -1
    },
    {
      "id": "miv7lll",
      "body": "Seems like a random as he.. comment, something to strike up a hateful debate",
      "created_utc": 1742505746.0,
      "score": -30
    },
    {
      "id": "mivjdm2",
      "body": "[deleted]",
      "created_utc": 1742509373.0,
      "score": 140
    },
    {
      "id": "mivcvir",
      "body": "💯 speak to a professional",
      "created_utc": 1742507344.0,
      "score": 70
    },
    {
      "id": "miynqjh",
      "body": "… contiguous em dashes? ChatGPT, bro. That’s ChatGPT.",
      "created_utc": 1742559900.0,
      "score": 7
    },
    {
      "id": "miviygz",
      "body": "i don’t think that would be very helpful towards OP. maybe even cause more harm.",
      "created_utc": 1742509240.0,
      "score": 49
    },
    {
      "id": "mivn4pr",
      "body": "No it won't. You are just curious and want the dirty details.",
      "created_utc": 1742510578.0,
      "score": 34
    },
    {
      "id": "mivk4t9",
      "body": "“here” at least?? yr just prying atp cuz yr curious 😭",
      "created_utc": 1742509613.0,
      "score": 76
    },
    {
      "id": "miw054c",
      "body": "I feel you, and totally wanna know who this ABSOLUTE PIECE OF TRASH is- BUT- this is this person’s trauma and it can probably give them a lot of unwanted attention on top of what they are already going through.\n\nFans are AWFUL and while they might get a lot of support, there WILL be people who come in saying all kinds of ignorant crap that can further damage the victim.",
      "created_utc": 1742514745.0,
      "score": 27
    },
    {
      "id": "mixcrk0",
      "body": "We do not permit requesting or suggesting the conversation move to another venue. Users who violate this rule may be banned from r/mentalhealth.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1742533532.0,
      "score": 1
    },
    {
      "id": "mp0hopw",
      "body": "As someone who’s also experienced something by someone in the media, there’s defamation laws to be worried about too since people who are powerful and rich and have really good lawyers can unfortunately get away with a lot ",
      "created_utc": 1745605455.0,
      "score": 2
    },
    {
      "id": "mj1krg1",
      "body": "just like the women who tried to expose their abuser, donald trump?",
      "created_utc": 1742591730.0,
      "score": 1
    },
    {
      "id": "miv6w3r",
      "body": "Why does it matter?",
      "created_utc": 1742505533.0,
      "score": -8
    },
    {
      "id": "mivnjw4",
      "body": "To the police, yes. On Reddit, no.",
      "created_utc": 1742510715.0,
      "score": 18
    },
    {
      "id": "mp0hr7r",
      "body": "defamation laws though :( ",
      "created_utc": 1745605475.0,
      "score": 2
    },
    {
      "id": "mivr29t",
      "body": "How so?",
      "created_utc": 1742511846.0,
      "score": 1
    },
    {
      "id": "miwhe9k",
      "body": "The celebrity will have lawyers who will do anything in their power to prevent getting any justice for the victim.",
      "created_utc": 1742520923.0,
      "score": 7
    },
    {
      "id": "mivpw98",
      "body": "I feel for you in going through this. I was sexually assaulted at school [in a special career program] by a classmate, who was essentially the most popular person in the class. “Everybody’s friend” kind of guy. He never got meaningfully punished. It was tough having to be around someone like that, while being surrounded by everyone else who were his friends. \n\nI know this isn’t the same situation as you, but I understand your grief. Even if it’s super tough now, I promise that it does get better. If you haven’t reported it to law enforcement or perhaps the person’s employer, and aren’t terribly afraid to do so, it doesn’t hurt to try. \n\nIt’s also good to know that even the biggest stars become irrelevant over time. Something that kinda worked for me, was that I fueled my anger and sadness into self improvement. Become a better person than they’ll ever be.",
      "created_utc": 1742511469.0,
      "score": 51
    },
    {
      "id": "mivmw61",
      "body": "what do you care about their fan base , if they are trash they are trash regardless, and also should speak up about it so that their fan base decreases , because if they are a celebrity they have a fanbase for something they did publicly not privately",
      "created_utc": 1742510502.0,
      "score": -58
    },
    {
      "id": "mp0heyo",
      "body": "I write like that sometimes too ! Parenthetical statement (parentheses) was one of my favourite forms of rhetoric — and kinda still is 😅",
      "created_utc": 1745605374.0,
      "score": 1
    },
    {
      "id": "mivmuas",
      "body": "this pretty much. They just want the juicy drama without realizing it's a living breathing human being tryna seek out some help",
      "created_utc": 1742510485.0,
      "score": 53
    },
    {
      "id": "mizn0zt",
      "body": "[deleted]",
      "created_utc": 1742571333.0,
      "score": 2
    },
    {
      "id": "mj108ff",
      "body": "Are we not all???",
      "created_utc": 1742585603.0,
      "score": 1
    },
    {
      "id": "mp4019p",
      "body": "yes and I still wouldn't be scared because many celebrities get still exposed",
      "created_utc": 1745652572.0,
      "score": 0
    },
    {
      "id": "miv7o0d",
      "body": "So they don't do it to others or people know who to avoid but I don't think it'd be wise for OP to put them out without proper legal aid.",
      "created_utc": 1742505766.0,
      "score": 42
    },
    {
      "id": "miv9xtd",
      "body": "So I know who to avoid? Why doesn’t it matter?",
      "created_utc": 1742506456.0,
      "score": 4
    },
    {
      "id": "miwhs0f",
      "body": "Don’t know why I’m being downvoted i just said something with common sense",
      "created_utc": 1742521065.0,
      "score": 1
    },
    {
      "id": "miy0cgd",
      "body": "Have you considered that the fan base is relevant because it is a constant reminder of not only their assailant, but also of how much social capital this person has? Things do not go well for people who come forward with their stories, but those who get dragged into the public eye get skewered for what may very well be the worst moment of their lives. Their lives get pored over and they get doxxed—sometimes sued. Nightmarish.\n\nMaybe because people may not want to go through the process of filing because it very, very rarely works out for them. Then you’re having to consider going against someone with money. And the laughably insensitive tone people exhibit with they discuss these things. Your comment, for example (well-intentioned as it may be).",
      "created_utc": 1742547879.0,
      "score": 14
    },
    {
      "id": "miwfbmp",
      "body": "YES I. Agree but this celebrity use POWER and if. They start getting rumor they are horrible that is GOOD thing celebrities  should NOT be allowed get away. W this !!! Esp since they have best lawyers so they don’t get justice that why HARVEY WEINSTEIN and DIDDY and R KELLY get away w thing so long",
      "created_utc": 1742520154.0,
      "score": 11
    },
    {
      "id": "mizpsqu",
      "body": "it’s true, but expose it to the police, not this random redditor who wants to be early to gossip",
      "created_utc": 1742572144.0,
      "score": 3
    },
    {
      "id": "mj1e0kz",
      "body": "if op wants to keep it to themselves then i’m not bothered. and if they’re gonna tell anyone, it shouldn’t be us reddit strangers",
      "created_utc": 1742589669.0,
      "score": 1
    },
    {
      "id": "mp470cv",
      "body": "[deleted]",
      "created_utc": 1745656773.0,
      "score": 1
    },
    {
      "id": "mivbgl1",
      "body": "People have done that before and it didn't matter. Kevin Spacey comes to mind.",
      "created_utc": 1742506920.0,
      "score": 13
    },
    {
      "id": "mivcq6a",
      "body": "Yes, because everything on reddit is fact. 🙄",
      "created_utc": 1742507298.0,
      "score": -10
    },
    {
      "id": "mivb9qt",
      "body": "[deleted]",
      "created_utc": 1742506863.0,
      "score": 3
    },
    {
      "id": "miycg8p",
      "body": "You don't have to give away your identity to be able to ruin someone's career as long as you have enough proof. If not or if you consider coming forward however not to other people but authorities then you leave it to them to investigate, indeed you go against someone with money but the police report should also negatively impact someone's image in a more or less matter plus contacting the media with proof again you do not have to give away you identity , file a report , contact media , interview anonymously , whats the worst case scenario ?\n\nThey find the person \"innocent\" you get nothing and police knows about it which in future if this event repeats the \"celebrity\" will have more problems in future.\n\nBut let's not look at the worst case scenario , the \"celebrity\" will most likealy offer you money to shut up at that point. edit: which again will make it obvs they are not innocent and more proof comes out , more fans are gonna stop being fans and so on",
      "created_utc": 1742554848.0,
      "score": -2
    },
    {
      "id": "mp47hh8",
      "body": "[deleted]",
      "created_utc": 1745657064.0,
      "score": 1
    },
    {
      "id": "mivffji",
      "body": "Pretty sure they mean their content…",
      "created_utc": 1742508123.0,
      "score": 2
    },
    {
      "id": "mj0odub",
      "body": "Having been through the crucible, the process in and of itself is kind of the terrible scenario in question. It’s great cost with very little return on investment (for some people, at least). I can see the pragmatism in what you’re suggesting, but it causes deep psychic strain to even do the practical steps. Many very strong, very resilient people can’t even say the words to their spouses/families, let alone to strangers who will tease through their experience with a fine tooth comb.\n\nThat latter bit is truly one of the worst experiences of my life, as I had to begin defending myself from interrogation-style tactics, just because I got a cop who hated people like me. I was told to expect nothing, and to essentially expect my file to rot in a back room for my efforts. I was hysterical to the point of almost crashing my car on the way out.\n\nIt’s a lot.",
      "created_utc": 1742582114.0,
      "score": 1
    },
    {
      "id": "mp4a71q",
      "body": "And still I would expose these celebrities",
      "created_utc": 1745658706.0,
      "score": 0
    },
    {
      "id": "mj0thm0",
      "body": "I am sorry that feelings don't affect my critical thinking and it always paid off , at least in the juridicial system",
      "created_utc": 1742583602.0,
      "score": -2
    },
    {
      "id": "mpmrs3m",
      "body": "[deleted]",
      "created_utc": 1745919737.0,
      "score": 1
    },
    {
      "id": "mj17c7m",
      "body": "Posing what I said as the absence of critical thinking seems a bit odd, but that’s why no group is a monolith. Everyone has their own atomized experience, and people interact with varying degrees of safety nets, social support systems, and bureaucratic hurdles. It’s just worth nothing that there are very rational, very logical counterbalances to the suggestion of an optimal course of action for those who want justice. In many cultures, silence and disappearing actually serves the individual’s self-preservation and wellbeing more than a sense of resolution (the Middle East, many parts of caste-ravaged India, etc.)\n\nI wish the justice system worked in our favor, and it saddens me to know how few people get their day in court, get to see the smallest sliver of retribution, and find themselves all the safer by the outcome. I, however, would never impose the labor of the crippling task, upon the person who was most crippled by the event in question. This is where systemic change and other people advocating come into dire need.",
      "created_utc": 1742587678.0,
      "score": 3
    },
    {
      "id": "mjvxjzo",
      "body": "Do u think u might have antisocial personality disorder?",
      "created_utc": 1743017579.0,
      "score": 1
    },
    {
      "id": "mjvxt1u",
      "body": "So you're saying you don't get distracted easily when under immense stress?",
      "created_utc": 1743017654.0,
      "score": 1
    },
    {
      "id": "mpmsa3l",
      "body": "[deleted]",
      "created_utc": 1745920045.0,
      "score": 1
    },
    {
      "id": "mkue743",
      "body": "google : \"exploit or take advantage of someone else for your own benefit\" nope , not me",
      "created_utc": 1743509772.0,
      "score": 1
    },
    {
      "id": "mjx0di6",
      "body": "not really edit: also idk what to consider stress , my emotions are a bit different I would say , things are happening and I adapt I don't know how to detect stress I feel like",
      "created_utc": 1743028882.0,
      "score": 1
    },
    {
      "id": "mpsuva2",
      "body": "So expose with proof? Of course someone should expose with some kind of proof?",
      "created_utc": 1745996580.0,
      "score": 0
    },
    {
      "id": "mkwkjt8",
      "body": "I don't think that's the best description of the condition",
      "created_utc": 1743535170.0,
      "score": 1
    },
    {
      "id": "mpucyx5",
      "body": "[deleted]",
      "created_utc": 1746022277.0,
      "score": 1
    }
  ]
}