{
  "id": "1kkgh0i",
  "title": "im stuck with my disabled brother for the rest of my life.",
  "selftext": "I don't want to do this. it makes me nauseous thinking about it.\n\nI don't love him.\n\nhe has autism. severely low functioning. he's violent and aggressive, and destructive.\n\nwhen my mom isn't able to take care of him anymore I don't know what I'll do with him. I don't want him around. I don't even want to think about him. he's going to ruin my life and I can feel it everytime I look at him.\n\nI never signed up for this. I don't want this responsibility. im so ashamed.\n\n  \nedit: thank you all for the advice and support. it really does mean a lot to me. im glad to find that I have options, and I don't have to deal with this on my own. I'm sorry to anyone with disabilities who might've read this and felt hurt. it was not my intention and I didn't think about my words before posting, as this was just raw vent. im just a teenager and this is my only safe space to share the ugly parts. ",
  "created_utc": 1747012716.0,
  "score": 602,
  "num_comments": 133,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1kkgh0i/im_stuck_with_my_disabled_brother_for_the_rest_of/",
  "comments": [
    {
      "id": "mruh5jq",
      "body": "As an autism parent, I would suggest a residential program or living facility. Be honest with your mom so she can start looking now and at least she can feel some peace with the decison, it can take a long time to find placent. \nI don't expect my son's siblings to take him if something happens to me. If they want to great, but it's not their responsibility imo. \nId rather have a planned place for my son to go then worry about the exact situation you're having.  Its not fair to you and I just think you should be open with your mom, it's ok to change your mind and just say I don't think it would be in his best Interest.",
      "created_utc": 1747014707.0,
      "score": 560
    },
    {
      "id": "mrudzrl",
      "body": "Then dont?  Assisted living facilities and programs exist. If you cannot take care of someone due to the strain and stress your best option is to find alternative housing for him. My aunty worked for a company that took care of adults with special needs and it varied from autism, to Down syndrome to amputees.",
      "created_utc": 1747013464.0,
      "score": 1001
    },
    {
      "id": "mrv44hd",
      "body": "I have a 31 year old son with autism.  I have a 34 year old son who has been very clear with me he does not want to take care of his brother in the event that his father and I are no longer available to do so.  \n\nI appreciated his honesty.  I told him I was okay with that and I would make a plan.  He does not feel guilt, he would feel much more guilty if his brother had no options.  Taking the time to talk about it makes time to plan.  Most of the assisted living placements have 3 or more years of waiting lists so your Mom will need to start applying now and get your brother on those wait lists.  Even if he gets a placement your Mom can defer if she wants and he will go back on the waitlist or she can transition him to asissted living with her support.  The transition is going to be the most difficult for your brother and having your mother there to support that will be beneficial in more ways than you know.",
      "created_utc": 1747024872.0,
      "score": 141
    },
    {
      "id": "mrui3j7",
      "body": "He’s not your responsibility. He’s your mom’s (and dad’s if he’s in the picture). Your mother needs to make plans for when she’s no longer here, and you should not be the one she chooses to be his care giver. Stand firm with your mother and make it clear to her that you are not going to be his mother when she’s gone.",
      "created_utc": 1747015078.0,
      "score": 235
    },
    {
      "id": "mrvbk9i",
      "body": "Hi! I’m a caretaker for people like your brother. When the time comes, you should start looking at assisted living facilities- just please make sure it’s a good one. Check reviews and take tours etc if getting him in one isn’t possible now. \n\nThe biggest, most helpful thing that will hopefully stop being as agro/destructive is activities or hobbies that you can introduce him to. Get him coloring books, lego toys- idle hands are the devils plaything. \n\nI wish you luck, and I empathize with you on not wanting to take on a responsibility you didn’t ask for. My place has my clients going out almost every day, they’re given a job that they bus to, do crafts etc to distract themselves. Facilities can be life altering given the right place. I joke they have more active lives than me (they definitely do) and they need that. Stability, routine is important. \n\nIf you have any questions for tips etc, I’m willing to chat!  Good luck op ❤️",
      "created_utc": 1747028894.0,
      "score": 32
    },
    {
      "id": "mruwd0d",
      "body": "You're under no obligation to take care of him. You're not his parent. Talk with your parents about getting things set up so he's taken care of in case of an emergency and they do die. You don't have to give your life up for something you never signed up for",
      "created_utc": 1747021079.0,
      "score": 45
    },
    {
      "id": "mrv3r2v",
      "body": "There are programs and living facilities for this EXACT situation. Used to work as an HCA(Home Care Aid) for a company that housed mentally disabled people, things like severe low functioning autism, dementia, legit had two patients that had the brain function and development of a 5 year old(sweet ladies but required 24/7 care their families could not provide). We housed all of our patients in actual houses, either on their own or with other compatible patients and they got to live a life like anyone else does, just with 24/7 care and monitoring. Please talk to your parents(or mom if it’s just her) about how you feel and that a care facility or company needs to be looked into for your brother.",
      "created_utc": 1747024683.0,
      "score": 24
    },
    {
      "id": "mrv2xeq",
      "body": "I used to volunteer for an organisation that ran Sibcamps - camps for siblings of children with disabilities. I just wanted to let you know that you are not alone and should not be ashamed to feel this way. \n\nAs the sibcamp kids approached their later teenage years many of them would have to wrangle with the possibility of caring for their siblings, when their parents aged. For some this was incredibly daunting and limited their freedom to live their own lives. \n\nTalk to your mum about this now if you're able to, or you could start to look into residential facilities that may be able to care for him, when the time comes. Taking control of the situation early may help you to feel less overwhelmed and hopefully allow you to let go of some of that guilt. It's not an easy position to be in, this does not make you a terrible person.",
      "created_utc": 1747024260.0,
      "score": 18
    },
    {
      "id": "mrv7usa",
      "body": "It’s not shameful not to love or want to care for someone that hurts you, whether it’s his fault or not. My brother is the same and it took me years to even want to be close to him, but he has more support and is getting better and so am I. \nUntil your mother is gone, focus on yourself and no one else, that is your right. You mum takes care of him now, you take care of you. Worry about what to do with him when the time comes, but I’m not sure how long that is for you?",
      "created_utc": 1747026836.0,
      "score": 16
    },
    {
      "id": "mrusl05",
      "body": "Then don’t.\n\nThere are government funded programs designed specifically for situations like this",
      "created_utc": 1747019365.0,
      "score": 76
    },
    {
      "id": "mrvdjrs",
      "body": "I'm an Autistic person with high care needs, and some of the issues you describe your brother has. I would previously have been described as moderate- severe, before language to describe Autistic people changed. I've been in SpecEd, sectioned, etc. \n\nYou have no responsibility to look after your brother, looking at your other posts, you're a teen yourself. If you don't want to and aren't equipped to look after your brother, it will be a bad experience for him as well as you. \n\nYou aren't his parent, and he's not your responsibility. Maybe you two would get on better when you can move out, like I did with my sisters. Maybe not, and that's OK! Don't be pressured into caring for him, it won't help either of you.",
      "created_utc": 1747030040.0,
      "score": 17
    },
    {
      "id": "mrvu0xv",
      "body": "I'll be totally honest and people can hate me for it. My adult daughter is severely autistic and intellectually disabled. I've never been able to get help. I've lost my health. I have no friends. I live in poverty. I love her but the lack of support systems has made this situation destroy my life. Start making plans NOW for some sort of facility where you could still be guardian/conservator if you choose, but not do the 24/7 care. It's A LOT and if you feel this way now then absolutely don't do it just to make your mother happy.",
      "created_utc": 1747040403.0,
      "score": 16
    },
    {
      "id": "mrvdhu8",
      "body": "Then don't, you have no obligation to do so.\nYour parents should have worked out a plan wayyy before hand what happens if they're not here anymore or if you are not comfortable with this.\n\nTalk to your mother, I'm sure you can find living facilities that will take care of your brother",
      "created_utc": 1747030008.0,
      "score": 10
    },
    {
      "id": "mrvlz7d",
      "body": "You don’t have to. You don’t have a duty of care. He is your mum’s responsibility, not yours. Nobody is expecting you to care for an aggressive, disabled sibling.\n\nThere are government facilities. My eldest son is autistic. He’s higher-functioning but also extremely aggressive & violent. My younger son is afraid of him. Police had to attend a couple of days ago after me and my younger son had to barricade ourselves in the living room. My eldest son got a knife & threatened to stab me & was trying to break the door down.\n\nNever in a million years would I expect my youngest son to be responsible for his older brother when I die. Never.\n\nYou have a right to your life. Go live it.",
      "created_utc": 1747035161.0,
      "score": 8
    },
    {
      "id": "mrvm912",
      "body": "I have a non verbal autistic child,  When he was about 14 we could no longer control him anymore. The state helped us get him into the proper care facility. We visit him all the time and by the way he acts he likes there. You need to look into that. If you don't love him it's not fair to him or you. I would get him in a home, so you don't end up doing  something stupid and ruin both of your lives.",
      "created_utc": 1747035337.0,
      "score": 8
    },
    {
      "id": "mrv92ht",
      "body": "Move far away before it comes to the point he needs care",
      "created_utc": 1747027501.0,
      "score": 9
    },
    {
      "id": "mrw589e",
      "body": "That sounds really tough... I'm sorry you're going through this, it's totally okay to feel overwhelmed and frustrated, your feelings are valid...",
      "created_utc": 1747047097.0,
      "score": 3
    },
    {
      "id": "mrwc9k3",
      "body": "You don't need to feel ashamed. Being a carer is very stressful and very demanding, and your brother clearly has very high support needs.   You would end up resenting him so much.  As some others have suggested here, he needs to go to a specialist care facility after your parents can no longer care for him.  I am autistic, though with lower support needs,  and I would hate someone to feel they had to give up their own life to care for me.",
      "created_utc": 1747050430.0,
      "score": 2
    },
    {
      "id": "mrwqeo1",
      "body": "I have a sibling (A - 2 years younger) who has a rare disorder under the ND umbrella, with many similar traits to autism (& CP). I also have another sibling (B - 4 years younger again).\n\nWhen A was born, society knew nothing of the disorder, there was little support - & diagnosis did not happen until A was 13 years old.  A is completely dependent on us for every need, 24 hours per day. \n\nNow, in our early 40s, the three of us are incredibly close. But, I credit this to our amazingly strong mother who fostered this connection, made us understand that it was always our responsibility to love & care for A, as for each other. \n\nGrowing up, yes! we had many, many, many challenges - those of which my friends or peers could never imagine or relate to. But - we learned a level of respect, patience, empathy, compassion, & love they never did. \n\nImportantly - our mother made it very clear to us very early, that while we were to love, care, & support A (in a time when others would have simply abandoned A to an institution), it was never, & would never be our job to give up our lives to care for A. The irony is that our mother raised us in a way that means both my youngest sibling and myself would never hesitate to do so if it was necessary. \n\nBut, after many years of dealing with red tape, government policy, changes, & hateful discrimination - we managed to get A into a shared living situation. A resides with one other person (a ward of the state via abandonment) and a rotating roster of disability support workers are present 24hrs/day.\n\nOp, I know your story is different, I respect that - and I respect the frustration and anger that can come from these situations. While it is perfectly understandable you may not want to shoulder the responsibility full time (it is abig responsibility) - I would just say that your sibling still has the right to a good quality of life. Talk to your parents, try to get these supports in place earlier rather than later - best for all involved. Good luck 🤞🏼",
      "created_utc": 1747056017.0,
      "score": 2
    },
    {
      "id": "mrx1pyw",
      "body": "I worked with a woman who had a child who was severely handicapped. It has been close to 25 years ago, so I don't remember his diagnosis. But he was nonverbal. He could not walk, get dressed, eat, or do very much of anything on his own. She was getting toward retirement age and was really struggling to care for him. She was a frail older woman, and he was an adult man who threw toddler type tantrums. So, with a lot of misgivings, she put him in a group home.  Within the year, he could talk and take care of himself to some degree. I also heard that he held down a job for a while. \n\nI don't think my co-worker was a bad parent she just wasn't as versed in the type of care her son needed. Also, caregiver burnout is a thing, too. My point is, don't beat yourself up too much if he needs to be in care. That's care workers' jobs.",
      "created_utc": 1747059815.0,
      "score": 2
    },
    {
      "id": "mskyiei",
      "body": "You are not a bad person for this. Use the other options and feel no guilt.",
      "created_utc": 1747375755.0,
      "score": 2
    },
    {
      "id": "msvq15z",
      "body": "“Assisted living facility” uh… do those not cost like… money?\n\nAlso he should have to bear no responsibility to his brother whatsoever.",
      "created_utc": 1747528619.0,
      "score": 2
    },
    {
      "id": "mrw0tif",
      "body": "<33",
      "created_utc": 1747044687.0,
      "score": 1
    },
    {
      "id": "mrwbk0y",
      "body": "Group home!",
      "created_utc": 1747050114.0,
      "score": 1
    },
    {
      "id": "mrwhv2p",
      "body": "You don't have to. Relax long enough to find some options that work, get him set up on social security, and placed in a care home. There are plenty of people who love doing it, no need for you to put yourself out.",
      "created_utc": 1747052797.0,
      "score": 1
    },
    {
      "id": "mrwscl2",
      "body": "I **really** hate that you feel ashamed. You shouldn't... this is not your child,  and you are under no obligation to make your brother your responsibility. Nor are you obligated to love him... it's ok to feel your feelings. Nobody else has shared your exact experience with him. \n *Your feelings are valid, and your life is your own.*\n\nI hope you're able to see that clearly one day very soon and to let go of any kind of guilt or shame associated with your brother's situation. \n\nI wish you all the best.",
      "created_utc": 1747056703.0,
      "score": 1
    },
    {
      "id": "mrxe1cc",
      "body": "It’s okay to feel overwhelmed. No one signs up for this kind of responsibility, and feeling scared or resentful doesn’t make you heartless it makes you human. Please don’t carry this alone.",
      "created_utc": 1747063521.0,
      "score": 1
    },
    {
      "id": "mrxt9gr",
      "body": "My Stepmom took in her younger brother after their mother passed. He was in his 50’s, Stepmom was in her 60’s. My dad mostly looked after him. Once my dad passed, uncle J, who had Down syndrome, became violent with my stepmom and any other woman who was around. He knew better than to buck up on a man. Uncle J is now in a facility.",
      "created_utc": 1747068006.0,
      "score": 1
    },
    {
      "id": "mrxxfcz",
      "body": "You are not responsible for him. Just make sure you let your mother know she will need to make arrangements for him in the long term because you don't wish to be the responsible party.",
      "created_utc": 1747069224.0,
      "score": 1
    },
    {
      "id": "mryfbpv",
      "body": "Put him in care. Assisted living - this is not your burden to bear. You need to focus on your own life.",
      "created_utc": 1747074402.0,
      "score": 1
    },
    {
      "id": "mrykbjw",
      "body": "I understand your feelings of shame and guilt, but you have done nothing wrong! you’re allowed to put yourself first. I work in mental health and with autistic/ID people, and there are absolutely agencies out there who offer CLAs ( community living arrangements ) that are staffed 24/7 and are trained to be able to handle the aggression your brother exhibits. and as long as one can prove necessity ( most likely, I don’t know the exact reqs ), whatever insurance he has / he’s on should cover all of it, if not most of it. I would be happy to help hunt some of these down if you like too!",
      "created_utc": 1747075881.0,
      "score": 1
    },
    {
      "id": "mrykfpd",
      "body": "This is NOT your responsibility.  you can walk away and they will figure it out for him",
      "created_utc": 1747075914.0,
      "score": 1
    },
    {
      "id": "mrym5vk",
      "body": "Put him in a facility. I don't know what happened that somehow society stopped thinking that this was an acceptable solution to managing severely disabled relatives.\n\nJust because your mom is giving herself a life sentence to care for him doesn't mean that it transfers to you.",
      "created_utc": 1747076428.0,
      "score": 1
    },
    {
      "id": "mryptaf",
      "body": "I’m sorry but so many things about this is sad and makes me angry and feeling like i should take care of your brother",
      "created_utc": 1747077538.0,
      "score": 1
    },
    {
      "id": "mryq442",
      "body": "It is not a siblings responsibility.  Please know that!",
      "created_utc": 1747077629.0,
      "score": 1
    },
    {
      "id": "mrys6hd",
      "body": "Simply don’t. My father is a mentally ill drug addicted who’s been on the same destructive cycle since he was 15. He still relies on his mother to this day, the very same way he did when he was 15. I’ve made it very clear to all, that once my grandmother passes, I won’t pick up that slack. He will either sink or float, but either way, he won’t do so in my lake. Make peace with yourself and just decide what you want.",
      "created_utc": 1747078250.0,
      "score": 1
    },
    {
      "id": "mryzw8o",
      "body": "assisted living , apply through government programs",
      "created_utc": 1747080574.0,
      "score": 1
    },
    {
      "id": "mrzu91j",
      "body": "I would explore every option to ensure his situation will not result with you as his caregiver. The primary reason is a caregiver has to at least be willing to take on the role and there’s no shame and not wanting to take on a role as heavy as caregiver, especially to your sibling.\n\nMy advice to you would be have a candid conversation with your mom regarding his living situation after her capability diminishes and especially after her passing. I had to have a similar conversation with my parents so they wouldn’t assume anything about life after their passing; it was hard but necessary.",
      "created_utc": 1747090147.0,
      "score": 1
    },
    {
      "id": "mrzyvb8",
      "body": "As a 32 year old who has a schizophrenic half brother, I can say we need systems in place with government to assist with these people. My brother has been a burden on my family for years and it’s fallen to me to take care of him. I felt your post my dude.",
      "created_utc": 1747091758.0,
      "score": 1
    },
    {
      "id": "ms15t4k",
      "body": "I really don't think you need to have any concern about taking care of your brother when your mother's gone because that's seems like a far way off you seem pretty young. \n\nBy the time that becomes a concern you'll be an adult and your brother will most likely just become a ward of the state. Seems a bit soon but make sure you tell your mother that you have no interest in helping your brother when she's no longer around. And it's actually within your right you don't have an application to take care of him right now he is not your responsibility. \n\nBut I would encourage you to tell your mom the anger and hatred you have towards your brother so that you guys can begin to separate your lives. I don't think it needs therapy I personally feel like your brother perceives your hatred and it might be affecting him negatively emotionally\n\n I was pretty much like your brother. My sister hated me, expressed it often, would sabotage me encourage her friends to abuse me and beat me and ridicule me. It was a horrible experience to be tormented at school and then have to return home to be tormented by a sibling. She was a very underhanded about it and my parents ignored it.\n\n The best thing is for your parents to make sure that you and your little brother have separate lives the best way that they can. I would no longer have family outings I would take the brother one place than take you one place. They might need an in-home caregiver take him out on outings for maybe two four hours a day to give you a rest.  Make sure you guys have separate rooms somehow give you privacy. Allow you to take your meals to your room. They would have daycares for him to give you a break put those most likely be during the day when you wouldn't be at home anyway because you're at school. \n\nGood luck sorry you feel so frustrated. Parents often forciblings to love and care for each other when they really have no obligation to you. And it creates a very hurtful dangerous situation.",
      "created_utc": 1747106863.0,
      "score": 1
    },
    {
      "id": "ms4obun",
      "body": "Same my brother also has low functioning autism and I am a glass child I raised him for a long while while my mom works now I’m a broken person cause I never got the help I needed as a kid it all went to my brother who is the same as he always was",
      "created_utc": 1747158863.0,
      "score": 1
    },
    {
      "id": "mse6994",
      "body": "I just want to encourage you to hang in there, move on with your own life and education. You do not need to sacrifice your whole life for your sibling. Follow your future, and when the time comes, involve social services (which will surely be a big part of his life) and they will place him, and you can choose how involved you want to be in his life. Don’t feel guilty about not “loving” him, love is an action not a feeling. I have a severely mentally ill sister. I do not feel any affection for her, but I want what’s best for her and am willing, to a degree, to assist with her care.  It’s normal to feel scared and overwhelmed. Please be kind to yourself. ",
      "created_utc": 1747281517.0,
      "score": 1
    },
    {
      "id": "msgilcv",
      "body": "this is so sad bit he's definitely not your responsibility though he needs special care. And you have the right to be yourself and to have the feelings that you have. You've got your life. Maybe it's really a good idea to talk to your mom about it all and how to find options so he could be cared and you could have your own life which belongs to you",
      "created_utc": 1747320855.0,
      "score": 1
    },
    {
      "id": "mslytgx",
      "body": "[removed]",
      "created_utc": 1747396218.0,
      "score": 1
    },
    {
      "id": "mslyz49",
      "body": "[removed]",
      "created_utc": 1747396283.0,
      "score": 1
    },
    {
      "id": "mslz2cj",
      "body": "[removed]",
      "created_utc": 1747396319.0,
      "score": 1
    },
    {
      "id": "mslz4yg",
      "body": "[removed]",
      "created_utc": 1747396350.0,
      "score": 1
    },
    {
      "id": "msw6r4a",
      "body": "Not ur responsbilty its ur moms but u can help not take over",
      "created_utc": 1747535476.0,
      "score": 1
    },
    {
      "id": "mt3ulqf",
      "body": "I have the same condition bro, I also feel the same sometimes but it's just that I can't trust anyone with my brother to anyone except my parents. So even tho I never wanted this responsibility I've to bear it somehow",
      "created_utc": 1747655309.0,
      "score": 1
    },
    {
      "id": "msqhnup",
      "body": "[removed]",
      "created_utc": 1747450602.0,
      "score": 0
    },
    {
      "id": "msyh8xh",
      "body": "Hey do inner engineering..it will help u feel motherly feeling towards everyone!! U will become loving naturally..",
      "created_utc": 1747577765.0,
      "score": 0
    },
    {
      "id": "mruedqm",
      "body": "[deleted]",
      "created_utc": 1747013619.0,
      "score": -31
    },
    {
      "id": "mrypkd5",
      "body": "As an autistic with 2 autistic kids ... one who has more severe delays.. this is messed up. U dont love him? Do u know why we meltdown? Do u know how misunderstood we are? This is just crazy to me and why the world scares the shit out of me. Empathy. Compassion. Its a thing",
      "created_utc": 1747077463.0,
      "score": -1
    },
    {
      "id": "ms0oboc",
      "body": "[removed]",
      "created_utc": 1747100463.0,
      "score": -1
    },
    {
      "id": "ms1mlqw",
      "body": "[removed]",
      "created_utc": 1747114595.0,
      "score": -1
    },
    {
      "id": "mruwxc4",
      "body": "[removed]",
      "created_utc": 1747021342.0,
      "score": -28
    },
    {
      "id": "mruy54i",
      "body": "[removed]",
      "created_utc": 1747021915.0,
      "score": -51
    },
    {
      "id": "mruuzsr",
      "body": "I'm the sole care taker of my mentally disabled uncle. Gotta wipe his butt every time he says \"poo poo\". \n\nRemember though that on the day of judgement it will turn out the lord was manifest in those least amongst us. As a sort of test. Better to serve in this short illusion of a life, and reign in the next.. in the spirit world.",
      "created_utc": 1747020448.0,
      "score": -71
    },
    {
      "id": "mruumq2",
      "body": "Best answer here!",
      "created_utc": 1747020284.0,
      "score": 59
    },
    {
      "id": "mrvhvc5",
      "body": "100% agree. I used to work at a group home for disabled adults and we had a lot of clients who where put in our care after their parents passed or couldn't take care of them anymore. Usually their siblings had power of attorney but not all cases. Some families would let the state take power of attorney, most of the time because they believe the state can take care of them better. I learned not to judge anyone's situation while working there.",
      "created_utc": 1747032617.0,
      "score": 49
    },
    {
      "id": "mrwep5o",
      "body": "I have a friend with an adult brother who is also severely autistic. The living facility gives him the ability to have some independence which he loves. You get to visit. You get calls about important issues or events and can go as much or little as your mental health allows. \n\nThis isn't your failing to have someone else watch over him. You can choose you.",
      "created_utc": 1747051484.0,
      "score": 138
    },
    {
      "id": "mrwrflv",
      "body": ">Assisted living facilities and programs exist.\n\nThey're also ridiculously and prohibitively expensive, depending on one's location. Not realistic for everyone. Even for those who could afford an assisted living situation, there are often years-long waiting periods.",
      "created_utc": 1747056379.0,
      "score": 43
    },
    {
      "id": "mrvlj6g",
      "body": "Sounds like a special needs where he can get $$ from government and live on his own",
      "created_utc": 1747034877.0,
      "score": 174
    },
    {
      "id": "mrx1zcv",
      "body": "Then let’s make assisted living facilities actually affordable.",
      "created_utc": 1747059896.0,
      "score": 23
    },
    {
      "id": "mrxaeml",
      "body": "As someone with a similar life to OP, I wouldn't forgive myself for this.\n\nHaving worked in assisted living spaces myself, I had to quit because the level of misconduct and abuse that goes on is sickening. \n\nI don't want to care for my relative but that doesn't mean they don't deserve care still and most places (in the UK anyways) like that do NOT care for their residents. They abuse them and get away with it time and time again.",
      "created_utc": 1747062445.0,
      "score": 8
    },
    {
      "id": "mrwhuqv",
      "body": " Why is even suggested that sibling should become lifelong caretakers?",
      "created_utc": 1747052794.0,
      "score": 27
    },
    {
      "id": "mrw465z",
      "body": "There are supervised group home but usually there is a wait. I have a friend that works for one and that has 8? Women living in it and they have become each other's family. You have to get him in this list though. There is usually a wait.",
      "created_utc": 1747046550.0,
      "score": 16
    },
    {
      "id": "mryrdwt",
      "body": "THIS. It's not on YOU. If I were you I'd start to slowly fade from the picture now. People believe actions more than words. If your mom tries to put a guilt trip on you then shame on her. Let me ask you: Did you ever fully get to be the kid growing up? Or did you have to do everything for your brother? Did you ever get to fully live your life? This is not your responsibility. You are the kid too. It ain't on you.",
      "created_utc": 1747078011.0,
      "score": 5
    },
    {
      "id": "mrvmjzh",
      "body": "I agree with you 100%\n\nI would just like to point out that the parents didn’t sign up for it either.\n\nSiblings don’t have a duty of care, parents do.\n\nMy autistic son was resultant from rape. I never signed up for this either.",
      "created_utc": 1747035531.0,
      "score": 1
    },
    {
      "id": "mrwinnq",
      "body": "Parents should never assume and dump that responsibility on siblings.",
      "created_utc": 1747053119.0,
      "score": 5
    },
    {
      "id": "mrxqd1e",
      "body": "I didn’t know there was a such thing as a camp like that. How awesome that those kids got time away and also met other kids in that situation. Love that",
      "created_utc": 1747067147.0,
      "score": 3
    },
    {
      "id": "mruxikt",
      "body": "…for now",
      "created_utc": 1747021620.0,
      "score": 129
    },
    {
      "id": "mrwiwd8",
      "body": "Why is your violent son still in the home? Your younger son deserves a safe home.",
      "created_utc": 1747053215.0,
      "score": 7
    },
    {
      "id": "mryq0me",
      "body": "I mean since y’all can’t handle it",
      "created_utc": 1747077600.0,
      "score": 1
    },
    {
      "id": "mslytig",
      "body": "Your comment has been removed because it links to CashApp. Soliciting funds is not permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1747396218.0,
      "score": 1
    },
    {
      "id": "mslyz66",
      "body": "Your comment has been removed because it links to CashApp. Soliciting funds is not permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1747396284.0,
      "score": 1
    },
    {
      "id": "mslz2ee",
      "body": "Your comment has been removed because it links to CashApp. Soliciting funds is not permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1747396320.0,
      "score": 1
    },
    {
      "id": "mslz50j",
      "body": "Your comment has been removed because it links to CashApp. Soliciting funds is not permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1747396350.0,
      "score": 1
    },
    {
      "id": "msx65q7",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747554033.0,
      "score": 2
    },
    {
      "id": "mrvmchm",
      "body": "If the only solution anyone can come up with to deal with a situation is ‘you should pray’ then everyone *really* needs to get out of the aforementioned situation.",
      "created_utc": 1747035398.0,
      "score": 10
    },
    {
      "id": "mry36bh",
      "body": "It’s a mentally and physically exhausting job. Please take care of yourself as well.",
      "created_utc": 1747070891.0,
      "score": 2
    },
    {
      "id": "msvqrll",
      "body": "Sorry he doesn’t want to bear to sole burden of taking care of him for the rest of his life..? The reason he doesn’t love him psychologically speaking, is cause he was never able to form a bond with him since he’s so anti-social and aggressive, our brains steer away from that and want nothing to do with it.\n\nImagine you have a dog, now this dog you are FORCED to live with, it shits everywhere, it attacks you, it barks all hours of the night, you have to take care of it. Do you think that you would love said dog? And do you think you’d want to continue taking care of it for the rest of your life?",
      "created_utc": 1747528913.0,
      "score": 1
    },
    {
      "id": "mt0h8jp",
      "body": "Information provided on r/mentalhealth is not a substitute for qualified professional care.\n\nThe moderation team will remove content that requests or offers information that should come from a professional and not from anonymous users on reddit.\n\nLinks or references to scientific articles are not a qualification to provide information of this nature on reddit.\n\nModerator discretion on this content is final.",
      "created_utc": 1747600694.0,
      "score": 1
    },
    {
      "id": "ms3f1ie",
      "body": "Thanks for contributing on r/mentalhealth. We have removed your post or comment because we determined that it violates rule 2. \n\n>All posts and comments must clearly and substantively contribute to mental health and wellbeing for the community or for the person posting. \n\n>This rule explicitly prohibits \"sound-off\", DAE, and posts offering vague or general unsolicited advice. \n\n>You may link to established resources elsewhere on the internet if the resource is paywall free and does not serve to promote the interests of any enterprise or individual.\n\n>Moderator discretion on this rule is final.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747145660.0,
      "score": 1
    },
    {
      "id": "mruyiq6",
      "body": "I also have autism and wouldn’t want to care for an aggressive, destructive person. It’s not the autism, but the damaging behaviours OP seems to struggle with. And frankly, anyone with a serious disability is a big job and we cannot shame people for being honest in their struggle with that. I’m sure the brother is struggling and he should be in a place that can actually help him, not with his unqualified sibling.",
      "created_utc": 1747022093.0,
      "score": 32
    },
    {
      "id": "mrv2aw4",
      "body": "She’s not a monster. She’s living with someone who is low-functioning, violent, and destructive. That tells me two things: the first is that, since she’s not a trained professional, she’s not equipped to handle him. The second is that HE is likely not living his best life. A more secure environment - a residential facility where he can be given boundaries while expanding his world - is the best solution for both of them. \n\nRegarding her love for him: she doesn’t have room for that right now, as he is a physical threat to her. But given some space, she may come to love her brother after all. \n\nYou are not her brother, and her brother doesn’t represent a whole community. He is an individual, living in and with a specific family. Decisions need to be made for his well being, and for the well being of the rest of the family as well.",
      "created_utc": 1747023949.0,
      "score": 14
    },
    {
      "id": "mrv9cqq",
      "body": "Right back at you",
      "created_utc": 1747027657.0,
      "score": 4
    },
    {
      "id": "mrwer5u",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747051510.0,
      "score": 1
    },
    {
      "id": "mrvbndh",
      "body": "You are in a cult.",
      "created_utc": 1747028945.0,
      "score": 27
    },
    {
      "id": "mrvm816",
      "body": "Have you ever considered putting your uncle into state care and going to live a better life?\n\nYour religion has brainwashed you into accepting a really crappy existence on the promise of a better one when you die… but what if this actually is it? What if there is no promised paradise? What if you’re just spending the only life you get to live jumping up to ‘poo pop’?!?",
      "created_utc": 1747035318.0,
      "score": 11
    },
    {
      "id": "mrvxoe0",
      "body": "Would the lord you pray to approve of the judgement You are bringing upon this person who is clearly struggling?",
      "created_utc": 1747042781.0,
      "score": 5
    },
    {
      "id": "mrwhw8c",
      "body": "This is so true! My mother had to do this with my stepfather after he had a stroke. Honestly, for me at least, it’s been a god send. \n\nIt’s definitely is not a failure. I’ll take care of my mom until the end but my stepdad? Hell no.",
      "created_utc": 1747052811.0,
      "score": 31
    },
    {
      "id": "mrwruv1",
      "body": "True, no time like the present to plan for the future.",
      "created_utc": 1747056528.0,
      "score": 12
    },
    {
      "id": "mrxaqav",
      "body": "Expensive and abusive too. I mena even nursing homes are notorious for the levels of abuse that goes on and even with constant reports and exposure documentriaes nothing changes. \n\nSame goes for any mental health facilities that has permanent residents living in them. I would never trust those places to provide the care a low functioning autistic person needs.",
      "created_utc": 1747062544.0,
      "score": 6
    },
    {
      "id": "mrzjerf",
      "body": "My daughter is autistic and only gets $600 from the govt on SSI. She could absolutely never live in her own with that.",
      "created_utc": 1747086532.0,
      "score": 31
    },
    {
      "id": "mrx375l",
      "body": "I dont have the time or resources to help lobby the government (your’s, mine or their’s) or champion this cause. If you or anyone does have the means i always encourage them to do their part but I’m a “micro not macro” kind of helper.",
      "created_utc": 1747060270.0,
      "score": -7
    },
    {
      "id": "msw5vke",
      "body": "because “it’s family! you do all you can to support them. you owe them and you can’t refuse or else youre a horrible person!” in reality… no.. it’s probably just because it’s “the easiest/the cheapest” thing to do, even though it’s not.. at ALL",
      "created_utc": 1747535110.0,
      "score": 3
    },
    {
      "id": "ms0nvxr",
      "body": "That’s what I’m worried about. My Mom needs assisted living to be paid by Medicaid in the not so distant future. I’m trying to find alternatives because I feel like I can’t bet on that anymore. \nI fear the future for these autistic kids/people. There’s so many now, I don’t trust our government to care for the vulnerable in the future.",
      "created_utc": 1747100314.0,
      "score": 5
    },
    {
      "id": "mrwk2jr",
      "body": "Our emergency mental health services are coming today. He’s probably going to paediatric inpatients.",
      "created_utc": 1747053680.0,
      "score": 6
    },
    {
      "id": "mtlgtbr",
      "body": "Did u seriously just compare autistic people to a dog? What the actual fuck is going on here....",
      "created_utc": 1747884714.0,
      "score": 1
    },
    {
      "id": "mrv0feh",
      "body": "same",
      "created_utc": 1747023019.0,
      "score": 9
    },
    {
      "id": "mrvi7vk",
      "body": "You can say that, but I was visited by the holy Spirit. Even manifest those light orbs people talk about seeing. I've shown 18 people.\n\nBut I just live my life in isolation away from the world and serve others and the holy Spirit. \n\nI'm not like most Christians, so I'm not a part of that whole hypocritical cult. I know that Adam is the first rebel angel, and we are all spiritually his children. Overcome the flesh, or be bound to it.\n\nYour down votes honor me.",
      "created_utc": 1747032831.0,
      "score": -27
    },
    {
      "id": "msw76gt",
      "body": "Why do u want to shatter his world if he trully believes that let him be if that gives him a purpose and helps him overcome his dificulties",
      "created_utc": 1747535657.0,
      "score": 1
    },
    {
      "id": "mrvmpqo",
      "body": "It's crappy because I have to wipe his butt, but I love him and this is what I want to do. I'm happy, and successful, and fulfilled.\n\nAlso, again, I've had quite a supernatural life. I don't expect people to believe my experiences, and I don't care to argue them or try to convince anyone, but suffice to say, after the experiences I have had, my faith is unshakable.\n\nI kinda walk the line of the spirit world, but again - just my experience and I know not many people have had experiences like mine, and so it's all rather unrelatable.",
      "created_utc": 1747035634.0,
      "score": -7
    },
    {
      "id": "msrn6xk",
      "body": "What is the judgement being leveled by this comment? He didn't comment on op's actions or feelings at all, just stated his own beliefs related to being in a similar situation.",
      "created_utc": 1747473591.0,
      "score": 0
    },
    {
      "id": "mrxww3z",
      "body": "I’m in the same boat. My stepdad has had multiple strokes and is now going through cancer treatment. My mom has been his sole caregiver (along with the help of my sister, her dad, at times) for 20 damn years. The amount of stress and unhappiness my mom has is immense. \n\nI’ve told her time and time again to put him in a home so she can have a life. She says my sister wouldn’t be able to handle it, even though she’s 24 now. On one hand, I get it, but I’m tired of seeing my mom miserable. It honestly pissed me off.",
      "created_utc": 1747069066.0,
      "score": 14
    },
    {
      "id": "mrwsnxd",
      "body": "Many people will never be able to completely retire on their own income/ss, let alone fund a relative's move to an assisted living program for several decades.\n\nDepending on their financial and their own mental health situation, OP may need to relinquish custody/guardianship of their brother to another relative or even the State. Based on their description, it could even be a dangerous situation for them, an unprepared and resentful sibling, to take of their angry and violent brother.",
      "created_utc": 1747056814.0,
      "score": 25
    },
    {
      "id": "mrximpf",
      "body": ">I would never trust those places to provide the care a low functioning autistic person needs.\n\nMay you always have the luxury of other options.",
      "created_utc": 1747064859.0,
      "score": 20
    },
    {
      "id": "mrzn21v",
      "body": "How much are apartments there? Is she a dependant for tax/healthcare purposes or does SSI not pay for rent?\n\n\nSomeone close to me with autism makes 1600 and lives 20 minutes from a big city studios there are 1200-1300.  20 minutes away from the city in the opposite direction could be found for for 7-800 if no one wants to take care of the person.",
      "created_utc": 1747087711.0,
      "score": -10
    },
    {
      "id": "mrx4w4z",
      "body": "The billionaire class literally does have the time and resources to implement this change… the problem is they tend to hate less fortunate people.",
      "created_utc": 1747060787.0,
      "score": 11
    },
    {
      "id": "mrvib44",
      "body": "Huh. Fuckin weird. Lol",
      "created_utc": 1747032884.0,
      "score": 15
    },
    {
      "id": "mrwj2c7",
      "body": "I just honored you too. You are nuts",
      "created_utc": 1747053282.0,
      "score": 6
    },
    {
      "id": "mrvnr3v",
      "body": "If you’re happy with your life, for whatever reason, then you are living the best life you can.\n\nEnjoy your butt-wiping! 🙃",
      "created_utc": 1747036296.0,
      "score": 7
    },
    {
      "id": "mrwuelf",
      "body": "I can agree to that.",
      "created_utc": 1747057419.0,
      "score": 3
    },
    {
      "id": "mrxj51y",
      "body": "That's the thing I don't. When it comes down to it I will have to sacrifice my own life to care for my relative because I either cannot afford other care or the other care available will more than likely result in my relative facing daily abusive and torment by the staff paid to \"care\" for them. \n\nLuckily from working in those places I do have experience in caring for people but I'd rather not have to do that but I'd rather make myself suffer than knowingly send a disabled relative to a facility where they will suffer.",
      "created_utc": 1747065005.0,
      "score": 2
    },
    {
      "id": "ms0am9a",
      "body": "I have a friend that’s autistic and lived in her own. She gets 1000-1200 (I can’t remember the exact amount) per month, that includes rent, food, etc. her parents have to subsidize the rest. I am also autistic, but I have a part time job. I only make $1200 a month (if I’m lucky) so my fiancé has to cover literally everything but grocery’s and my phone bill, and if I have extra I give it to him for our rent. If I work more than 30 hours a week I will have a meltdown. But because I can work, and I am ‘functional’ the government doesn’t think I need any help. I even applied for a tax thing for it and they said no 🤪",
      "created_utc": 1747095636.0,
      "score": 20
    },
    {
      "id": "mrzndar",
      "body": "Our one br apts go around 1600, I think. I don’t think she could be ok on her own though.",
      "created_utc": 1747087816.0,
      "score": 2
    },
    {
      "id": "mrvo1d6",
      "body": "You know it's not that bad, 5 minutes a day or so, and it doesn't really affect my life too much, but his quality of life is hugely improved being around my family, and people that love him, and my awesome fat cats. Yeah he has a life because of me and if it just costs a little bit wiping.. well /shrug.",
      "created_utc": 1747036478.0,
      "score": 1
    },
    {
      "id": "mry3jh2",
      "body": "That quite literally isn't an option for some people. As a single person from a family where I know I won't be getting any money when my parents die, if I had to take in my sibling with the level of supervision he needs I would quite literally become homeless. The stipend where I am only applies to caretakers of a certain age (which I am not), and the money given isn't enough to hire anyone qualified for enough hours that I'd be able to work full-time. Part time work wouldn't be able to cover rent, and day programs all have incredibly long waiting lists for people not in residential services. I'll check on my sibling every day if I have to, but it is quite genuinely the only choice I'll have barring changes in how my government handles things or some ridiculously unlikely circumstances like marrying rich. I hate it, and the idea leaves me heartbroken, but I will not be able to provide for them (or myself) if I took them out of their program when I'm guardian.",
      "created_utc": 1747070996.0,
      "score": 8
    },
    {
      "id": "ms0jtpt",
      "body": "Welcome to the \"can get a job\" autism part on the spectrum :P",
      "created_utc": 1747098890.0,
      "score": 11
    },
    {
      "id": "ms162zo",
      "body": "That's quite a bit of money and very rare. Usually State subsidies are not enough to live on. They will have to live in a board and Care facility or have roommates and if their behavior is that destructive good luck on your roommate. They wouldn't know time be arrested for domestic disturbance.",
      "created_utc": 1747106977.0,
      "score": 1
    },
    {
      "id": "mrwj9y8",
      "body": "Someone is caretaking if you only spend 5 minutes a day and are living your best life. You are dumping the responsibility on someone else.",
      "created_utc": 1747053367.0,
      "score": 2
    },
    {
      "id": "mryp4nn",
      "body": "That's fine and understandable. For the record I wasn't trying to SHAME people for doing it, just pointing out the fact its a very real and common risk of those places to be abusive and I personally would not forgive myself for resorting to that. \n\nThe issue isn't individuals sending their family there (so long as they research and know what they're doing instead of hiding from the truth of the place) the issue is the country having absolutely shit regulations and laws in place to protect vulnerable individuals.",
      "created_utc": 1747077332.0,
      "score": 2
    },
    {
      "id": "mso48xm",
      "body": "You should try the \"nobody recognizes your diagnosis\" part of the spectrum. It's a real blast.",
      "created_utc": 1747420465.0,
      "score": 1
    },
    {
      "id": "ms3u8gt",
      "body": "I should have mentioned that I’m in Canada, and my friend was one of the first girls diagnosed with autism before 3 in the 90’s. As a result she had a lot of experimental treatments and therapy’s done on her to see how it would work for woman.  So she’s genuinely fucked up from some of it, and was diagnosed with BPD as a result",
      "created_utc": 1747150168.0,
      "score": 1
    },
    {
      "id": "mrzywtd",
      "body": "Nah. He follows me around constantly. He's my responsibility. Time to get him in the shower.",
      "created_utc": 1747091772.0,
      "score": 1
    },
    {
      "id": "ms418vz",
      "body": "She probably also has money from research and maybe law suits? Anywho, In the states benefits are just enough to keep people from eating each out of famine. That's it",
      "created_utc": 1747152193.0,
      "score": 1
    },
    {
      "id": "mso5lua",
      "body": "In the mid 80s, I got classes as something not far from mentally retarded, but they had enough paper on hand to call it \"executive function disorder\" as a standalone diagnosis. \n\nFast forward to the 2020s and it *can't* be a diagnosis because it's just a *symptom*. I know for another fact in 2010 it was still holding up as its own title. \n\nBut forget about mainstream accommodations. \n\nI tried applying for them a couple months ago and got sent to primary care appointments (based on the form it didn't say anything different other than \"family doctor\" or \"medical Healthcare provider\") before the guy reviewing my case who missed in BIG BOLD LETTERS that I listed my diagnosis simply read the form saying the doctor was primary care, not a psychiatrist/ psychologist, and backpedaled to that instead. Not like there's medical records in the 2020s 🤦‍♂️",
      "created_utc": 1747420880.0,
      "score": 1
    }
  ]
}