{
  "id": "1gi8qeh",
  "title": "Feeling sad after EKG, exposed by nurse. ",
  "selftext": "I fainted yesterday while painting and was taken to the ER. A female nurse performed an EKG on me but I wasn't in a private room. I was sitting in triage. She was mad that the stickers weren't sticking because I had on lotion. Told me to never wear lotion to the hospital in such a rude tone. She exposed my entire breasts in the triage- not a room- there was no curtain even. She conducted the EKG all the while upset about the probes not sticking. I apologized many times but she didn't acknowledge me. She asked if I had anxiety and I said I have PTSD as I am a military veteran. I wasn't in the ER for anxiety but for fainting due to paint fumes. She wrote down \"anxiety\" anyway. I feel so disgusting after that experience. I have no idea how many people saw my breasts. I am struggling mentally a lot right now. ",
  "created_utc": 1730588058.0,
  "score": 476,
  "num_comments": 80,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1gi8qeh/feeling_sad_after_ekg_exposed_by_nurse/",
  "comments": [
    {
      "id": "lv3l2px",
      "body": "1. Fill out a complaint at the hospitals own website with all the specifics immediately. This is to show you did report it to them in writing and keep a screenshot. \n2. Contact a lawyer, don’t rely on the hospital’s process. They might reprimand the employee but the hospital’s staff is there to protect to hospital. \n\nI am so sorry this happened. Also what kind of idiot working in the ER thinks the visit was planned??",
      "created_utc": 1730591132.0,
      "score": 210
    },
    {
      "id": "lv3spou",
      "body": "I'm so sorry.. that's horrible behavior\n\nyou're a human and should be treated so, worthy of privacy and respect especially in a hospital",
      "created_utc": 1730593902.0,
      "score": 56
    },
    {
      "id": "lv3k2ga",
      "body": "Ok i think you need to talk to the hospital about this it is medical malpractise.\n\nShe needs to get fired",
      "created_utc": 1730590772.0,
      "score": 767
    },
    {
      "id": "lv4caz5",
      "body": "Contact the patient and family advocacy department at the hospital. That’s a big deal and unnecessary. I’m a cardiac nurse, I do ekgs every fucking day. The only time I would ever do it with a patient exposed is in a code blue situation, where it is literally life vs death … but even in those situations, we’ve been able to move bystanders away and limit exposure to medical personnel only.",
      "created_utc": 1730601350.0,
      "score": 34
    },
    {
      "id": "lv4pbnu",
      "body": "Folks if this happens to you, ask for the charge nurse asap. And then talk to patient relation and report the nurse to the licensing board. \nBTW we have multitude of swabs that can quickly clean and prep the skin for ecg probes. That nurse was dramatic and unprofessional. \nSigned-a charge nurse.",
      "created_utc": 1730606900.0,
      "score": 29
    },
    {
      "id": "lv48ji7",
      "body": "Absolutely talk to the hospital. That is unacceptable behavior. I’m sorry you went through that. And second of all, the nurse is acting like you planned an ER visit and put lotion on? I had a nurse announce I had a miscarriage in front of triage but guess what I didn’t even have one. Lol",
      "created_utc": 1730599893.0,
      "score": 20
    },
    {
      "id": "lv4q5lx",
      "body": "this is wrong it’s part of a nurses job to preserve a patients dignity as much as possible as well as be supportive, we are trained to help patients and their families in scary situations. u should report her.",
      "created_utc": 1730607300.0,
      "score": 7
    },
    {
      "id": "lv4c9gx",
      "body": "Not cool. I’ve worked in healthcare for 22 years and this is beyond the pale. At the least you need to report her to the hospital, get a lawyer, and as much as I hate to say this (because God forbid if people only knew the hell dealt with in the ER), maybe even report her to the board. I figure worst case scenario she gets a reeducation class and scolded from them. There are some genuine asshats at some of them, but boards aren’t always there to snatch away someone’s livelihoods.",
      "created_utc": 1730601335.0,
      "score": 12
    },
    {
      "id": "lv5dyhz",
      "body": "Please call the hospital and ask to speak to an ombudsman or something. She needs to be reported.",
      "created_utc": 1730621818.0,
      "score": 6
    },
    {
      "id": "lv635yo",
      "body": "Did you thank her for informing you not to wear lotion the next time you faint. Absolutely report her foolishness this is not acceptable \n\nNTA",
      "created_utc": 1730637354.0,
      "score": 6
    },
    {
      "id": "lv4d8x8",
      "body": "i go to the hospital regularly for some issues and i get ekgs everytime (i'm usually admitted for a couple days) most times they will reach over or under your shirt or bra if you have one, always ask before doing it, or if the shirt needs to be removed entirely it's done in a private room and they ask first. except this one time, a nurse came in to do an ekg. i was pumped full of pain meds so i was super aware of what was happening but she randomly completely lists my bra and exposes my breasts completely. again i wasn't in a state of mind where i could say anything but my mom saw what happened and we reported her to the charge nurse before we left. it's now in my chart that she is not allowed on my case and she was talked to. do not be afraid to report her, it can help prevent her from doing it to another person as this can be considered sexual assault. i'm sorry this happened to you, everyone should have privacy and feel respected while receiving medical care",
      "created_utc": 1730601718.0,
      "score": 10
    },
    {
      "id": "lv4ek16",
      "body": "I hope you are okay and can address this with hospital administration.\n\nI want you to know, that your concerns are reasonable.  It feels like a violation, but please know that if I (41M) were in that room with you, I know what I'd do, therefore I assume others mostly did: I'd look away out of respect for you, and keep listening to that awful nurse while raging at her in my head on your behalf.\n\nPart of me knows thats likely what the vast majority of others were doing.  Everyone else was there for a reason, and the pain and worry associated with that reason made them oblivious to any of it happening.\n\nAction still needs to happen, talk to the administrators, but please rest assured most people either were oblivious or sympathized as a fellow patient.",
      "created_utc": 1730602227.0,
      "score": 5
    },
    {
      "id": "lv4pfds",
      "body": "I’m sorry that happened to you. I work outpatient cardiology. We can literally just use an alcohol swab to get lotion off patients. Takes no time at all",
      "created_utc": 1730606951.0,
      "score": 5
    },
    {
      "id": "lv50d42",
      "body": "r/legaladvice",
      "created_utc": 1730612700.0,
      "score": 5
    },
    {
      "id": "lv490zf",
      "body": "That’s horrible! I’m so sorry. Your feelings are completely valid.",
      "created_utc": 1730600080.0,
      "score": 3
    },
    {
      "id": "lv4dap0",
      "body": "Please call and complain or ask someone to help you call the hospital where that ER is located. This is so wrong.",
      "created_utc": 1730601737.0,
      "score": 3
    },
    {
      "id": "lv4r3zn",
      "body": "Op I’m really sorry this happened to you. Sending you love.",
      "created_utc": 1730607762.0,
      "score": 3
    },
    {
      "id": "lv4yh6b",
      "body": "Hi.  I'm so so sorry to hear you were treated like this and that you were upset.  You have every right to, and who wouldn't feel upset by having this happen? It's good to have value over how you are treated in care situations. \n\nI'd say take a look at the patient rights and responsibilities that you sign when you receive treatment, there might be a desk or number to receive advocacy feedback.  You can talk with them about who was responsible, what you didn't know going into the session, what the staff was like and request a care review.  \n\nThe treatment team could learn from your feedback and avoid having the same thing happen again for someone else.\n\nDream Well.",
      "created_utc": 1730611594.0,
      "score": 3
    },
    {
      "id": "lv50dmw",
      "body": "What that nurse did is so wrong and many levels.  Breach of patient privacy both medically and physically.  I never expose patients at my hospital to the public. Let alone do an ECG in the waiting room. It’s always done in a private room. Please report this nurse both to the hospital and to the regulatory body she has a license with. As for the lotion who care. No one plans there day with a ER visit. She could have just used alcohol swabs first. The ecg stickers at my work do not stick that well even on good dry skin. \n\nAlso the way she treated you was wrong.",
      "created_utc": 1730612708.0,
      "score": 3
    },
    {
      "id": "lv51dpr",
      "body": "No, that's not okay. A curtain should always be provided especially in triage for obvious reasons. Those EKG stickers rarely stick because they arent pulled correctly from inventory, the wires are always a lazy mess and most health care professionals could not care less about you. That's how the job is able to be done. The majority of my healthcare has had horrible customer service...that's what it is right...customer service? I went to school for PCT and was so excited about it, but after the schooling and my externship and first job...those healthcare people are messed up. Most nurses never wanted to be a nurse, thats just what they could do respectfully to pay the rent...kinda like teachers. I feel for them, but most of them are not good people. The industry is a joke. A hospital is a business in a capitalistic society...never forget that.",
      "created_utc": 1730613320.0,
      "score": 3
    },
    {
      "id": "lv58kjg",
      "body": "I had an ECG a few weeks ago. It was in a curtained room and the male nurse asked if it was ok if he did it. I thought it was nice that he asked and said it was ok. I was comfortable but my Muslim fiancé was a bit upset about this. Next time I might ask for a female nurse just out of respect of my soon to be husband’s culture.",
      "created_utc": 1730618084.0,
      "score": 3
    },
    {
      "id": "lv59xul",
      "body": "What country are you in? It sounds very weird it wasn’t in a private room. Every single time I had an EKG it has been in a private room.",
      "created_utc": 1730619030.0,
      "score": 3
    },
    {
      "id": "lv5u5jk",
      "body": "I'm so sorry that this happened to you! That nurse was way out of line. You don't deserve that at all. She is a textbook example of a nurse that should not be a nurse. I don't know what world she lives in if she thinks visits to the ER are planned. \n\nYou are not disgusting at all - she is the one who had a disgusting, unprofessional attitude and terrible bedside manner. You did everything right. \n\n\\- a fellow female Vet",
      "created_utc": 1730632766.0,
      "score": 3
    },
    {
      "id": "lv61nhl",
      "body": "hi i have a heart condition and regularly receive EKG’s. this is mot routine. what happened to you isn’t okay and needs to be reported. if health care workers don’t want to be abused they shouldn’t be abusing patients. i’m sorry this nimtard made you feel unsafe and i’m sorry that they threw that card in your face at the end. you are more than your mental health!!!!",
      "created_utc": 1730636640.0,
      "score": 3
    },
    {
      "id": "lv67f47",
      "body": "That's not how a nurse should behave, from a fellow nurse, not in any circumstances.",
      "created_utc": 1730639231.0,
      "score": 3
    },
    {
      "id": "lv69atj",
      "body": "Dirty shit ass nurse ! I am sorry you had to go thru this I am nurse who works at a real dump of a hospital and never treat people this way.",
      "created_utc": 1730640008.0,
      "score": 3
    },
    {
      "id": "lv6ldzj",
      "body": "How were you to know you'd end up in the ER that day?  What a witch.  Report her.",
      "created_utc": 1730644505.0,
      "score": 3
    },
    {
      "id": "lv6n3qt",
      "body": "RN here - you NEED to report this. Chances are, she’s done this to other patients and has gotten away with being an asshole. So many issues here. Lotion can be wiped off. Any nurse worth their salt knows that a wipe and some alcohol swabs can fix this problem in seconds without even mentioning it to the patient. Most people don’t know they’re even coming to the hospital let alone getting an EKG done. \n\nAs for the privacy issue, there is no excuse for exposing your patient to the public. CURTAINS EXIST. Yeah, sometimes a boob is hanging out and that’s not a big deal IN PRIVATE. \n\nHaving a bad day is fine, but don’t make it your patients problem. I’m so sorry this happened to you. \nMy hospital has post treatment surveys, have you gotten one?",
      "created_utc": 1730645090.0,
      "score": 3
    },
    {
      "id": "lv6nb7c",
      "body": "I would add to this to speak to the hospitals ombudsman. Their job is to advocate and speak for the patients in times of conflict and dispute. I am so sorry you were treated this way. It was beyond unprofessional of this nurse to perform the procedure in triage, exposing your body and reprimanding you for the stickers not sticking. This whole situation needs escalated- even if you didn’t have the nurses name, the hospital will find out who it was.",
      "created_utc": 1730645159.0,
      "score": 3
    },
    {
      "id": "lv72paq",
      "body": "As a nurse, I’m actually disgusted to read what happened to you. I work in the icu and regularly need to admit unconscious patients. Even then, dignity and privacy is respected. We always still close the curtains and remove unnecessary ppl when doing ekg or skin checks. I’m so sorry you experienced this, it’s unacceptable",
      "created_utc": 1730650051.0,
      "score": 3
    },
    {
      "id": "lv7bxuf",
      "body": "Every hospital has a Patient Affairs or similar office as part of Hospital Administration. Definitely contact them.",
      "created_utc": 1730652867.0,
      "score": 3
    },
    {
      "id": "lv7olsn",
      "body": "If I could make a suggestion write what you wrote here and send it to the hospital and medical board. Do it weekly until you're satisfied with the response.",
      "created_utc": 1730656630.0,
      "score": 2
    },
    {
      "id": "lv890ah",
      "body": "I get that health workers have frustrating jobs but that crossed a line. Please consider filing a  complaint.",
      "created_utc": 1730662718.0,
      "score": 2
    },
    {
      "id": "lv8tjgq",
      "body": "Please file a formal grievance with the hospital. Be as detailed as possible. And know that if anyone did see you they were probably worried about there own things while being there. And if not I am sure they would have considered how inappropriate and unprofessional the nurse was being. It obviously doesn't make it okay but please let your voice be heard to protect others in the future.",
      "created_utc": 1730668987.0,
      "score": 2
    },
    {
      "id": "lvacjsb",
      "body": "I am so sorry you were mistreated! I see both perspectives; an overworked nurse, and who knows what she’s facing personally. BUT there is no reason you had to be nude in public like that! Absolutely find a way to report the situation so it doesn’t happen to anyone else. Take comfort in knowing that you are not alone, many of us have had horrible experiences in hospitals and it was hopefully a one-off situation. You are a valued woman and military vet💙Try to also focus on forgiveness and understanding that the nurse’s ultimate anger and poor judgement was not your fault. Sending hugs and I hope the hospital corrects your situation💙",
      "created_utc": 1730687467.0,
      "score": 2
    },
    {
      "id": "lvifbe8",
      "body": "File a complaint to the hospital. Check if you find her name on your hospital papers. \nI’ve done first aid courses and we were always instructed to be understanding on the person’s privacy. No matter the procedure you perform, you designate another person to secure the area so that there’s some privacy.\nAnd the other thing is that a nurse can’t diagnose you with anxiety since she’s not proper trained. Only a doctor can do that.\nFile the complaint and you’ll feel much better.",
      "created_utc": 1730809689.0,
      "score": 2
    },
    {
      "id": "lvsssbt",
      "body": "Bro omg this is so illegal and disgusting ",
      "created_utc": 1730933175.0,
      "score": 1
    },
    {
      "id": "lw9qrhw",
      "body": "I am a nurse, that should never ever ever happen. I am so sorry that happened to you! Definitely call a patient advocate. ",
      "created_utc": 1731170450.0,
      "score": 1
    },
    {
      "id": "lv94meu",
      "body": "I’d recommend talking to a lawyer to navigate these waters and hopefully she can be reprimanded also maybe talk to a therapist about the experience so you can feel like you have more control of your body and experience in life. Im sorry this happened to you I hope you start to feel better",
      "created_utc": 1730672496.0,
      "score": 1
    },
    {
      "id": "lv4x6c2",
      "body": "You need to calm down. There is nothing to worry about. She might be in a bad mood. Don't raise a complaint because her future might get affected. I can understand a lot of military veterans had PTSD. don't think deep and destroy your mental peace.",
      "created_utc": 1730610862.0,
      "score": -8
    },
    {
      "id": "lv3lrkf",
      "body": "Thank you so much for the input. I am left feeling very frustrated and extremely violated. I feel dirty. I will contact the hospital. ",
      "created_utc": 1730591381.0,
      "score": 80
    },
    {
      "id": "lv4op0e",
      "body": "Document everything ASAP and screenshot that complaint submission. And yeah, seriously - who expects patients to plan ahead for ER visits? That nurse was way out of line both with privacy and attitude. Definitely talk to a lawyer - hospitals often try to sweep this stuff under the rug.",
      "created_utc": 1730606606.0,
      "score": 16
    },
    {
      "id": "lv3ursy",
      "body": "Thank you so much for your kind words. It means a lot that you took the time to reply. ",
      "created_utc": 1730594655.0,
      "score": 14
    },
    {
      "id": "lv3lk2f",
      "body": "Thank you for the reply. I agree with you. ",
      "created_utc": 1730591307.0,
      "score": 197
    },
    {
      "id": "lv473d1",
      "body": "I don't think I would call it \"malpractice\", but it's definitely inconsiderate and terrible bedside manner...\n\nI'm an EMT and often bring patients to the ED that need EKGs.  It's exceptionally common for them to be done in an open setting in triage, but there should always be a curtain pulled back, and care should always be given to maintain patient privacy.  Even that grizzled old \"get off my lawn\" type 90 year old dude might be uncomfortable laying in a hallway with his shirt pulled up for all to see.  But for women especially.... even if a bra is \"technically\" covering things (an EKG does NOT require removing a bra), that doesn't mean the woman will be comfortable with it.\n\nETA: I agree with the rest of it. This behavior should absolutely be reported.",
      "created_utc": 1730599340.0,
      "score": 117
    },
    {
      "id": "lv5yqpn",
      "body": "I have submitted a report to the board. I felt conflicted on whether to do it or not. Do you think they will take this seriously? I just hope they can reeducate her on professionalism. I would hate this to happen to someone else. \n\n\nThank you for your comment, also! ",
      "created_utc": 1730635229.0,
      "score": 12
    },
    {
      "id": "lv6pyfq",
      "body": "That’s what was getting me! Bitch, clean the area and grab some new pads! What the actual fuck was she on about?!",
      "created_utc": 1730646037.0,
      "score": 5
    },
    {
      "id": "lv5yh5z",
      "body": "I can't believe they would announce something like that! Ughhh sometimes the medical system is so frustrating. \n\n\nI'm glad you didn't though. \n\n\nI was reading the reviews for this particular hospital and several people wrote that they had a girl arrested immediately after having a miscarriage. ",
      "created_utc": 1730635103.0,
      "score": 3
    },
    {
      "id": "lv64alf",
      "body": "Lol, yeah I should have. That's wild! \n\n\nI was so out of it, I was trying anything to change the mood of the experience. I know I do that when feeling uncomfortable. What's even more bizarre is she refused to even take my blood pressure. Wouldn't you take the BP of someone who fainted? As soon as she hears I have PTSD, it was over. I did end up reporting her, after much thought. \n\n\nThank you for your comment! ",
      "created_utc": 1730637868.0,
      "score": 3
    },
    {
      "id": "lv4gvyp",
      "body": ">It feels like a violation\n\nNot feels like it **is** a violation",
      "created_utc": 1730603157.0,
      "score": 10
    },
    {
      "id": "lv4kcof",
      "body": "Well said.",
      "created_utc": 1730604627.0,
      "score": 3
    },
    {
      "id": "lv5z78o",
      "body": "Thank you so very much for your kind words. I really hope most people did look away, as you would. That reassurance means so much. I think, as days pass, I'll begin to feel better.",
      "created_utc": 1730635454.0,
      "score": 2
    },
    {
      "id": "lv5z90h",
      "body": "Thank you so much!",
      "created_utc": 1730635478.0,
      "score": 2
    },
    {
      "id": "lv5znwk",
      "body": "I even offered to use alcohol swabs to the area first myself while she was complaining. Of course, she refused. She just kept struggling with the probes. I am not even sure she conducted the test correctly. She also refused to check my blood pressure when I asked. My BP wasn't checked until three hours into my stay after I asked another nurse. She barely acknowledged me as a human being. She must have known how uncomfortable I was. I just wanted to do anything to speed up the process. ",
      "created_utc": 1730635681.0,
      "score": 2
    },
    {
      "id": "lv5xrtg",
      "body": "I feel absolutely the same way. I have had an autoimmune disease since I was 23. My experience has been atrocious. In regards to what happened to me yesterday, my mom basically said suck it up and deal with it. And I am. I usually do. The humiliation I felt this time around is just lingering a little longer. \"A business in a capitalist society\" is so spot on! ",
      "created_utc": 1730634739.0,
      "score": 2
    },
    {
      "id": "lv5zpom",
      "body": "Ohio, USA ",
      "created_utc": 1730635706.0,
      "score": 3
    },
    {
      "id": "lv5zwi5",
      "body": "Thank you so much for your comment. I am seeing more and more \"professionals\" who have no business being in the medical field lately. It's so frustrating! \n\n\nThank you for your service to our country, as well. ",
      "created_utc": 1730635800.0,
      "score": 2
    },
    {
      "id": "lv62wbs",
      "body": "Thank you so much for your kind words. I did end up reporting it thanks to the support of this group. ",
      "created_utc": 1730637232.0,
      "score": 1
    },
    {
      "id": "lv6ncmn",
      "body": "Thank you so much. I wish we could have had an understanding RN like you. \n\n\nNo, I did not get a survey yet.",
      "created_utc": 1730645173.0,
      "score": 3
    },
    {
      "id": "lvadibm",
      "body": "Thank you so much for your kind words. That means so very much to me. \n\n\nMy husband was in the waiting room and said she was rude to everyone, including telling a very elderly man to \"hurry up.\" I do hope she's just having a bad day. I tried so hard to change the mood of the situation but was unsuccessful. I did submit the report and I forgive her and the situation. I hope she can find passion for her career again soon. ",
      "created_utc": 1730687821.0,
      "score": 1
    },
    {
      "id": "lwb1ljk",
      "body": "Thank you for your reply and thank you everyone. I did hear back and was told by the hospital that those tests are done like that if there are no private rooms available. I said but she was so rude while doing it and was told that's because the ER was crowded and she was stressed. I feel they won't take it any further. I know for a fact I won't ever go into the hospital again. I'm still dealing with immense anxiety after that experience. ",
      "created_utc": 1731185532.0,
      "score": 1
    },
    {
      "id": "lv6ol1z",
      "body": "Her future needs to be affected- she is taking care of a vulnerable population being a healthcare provider and has a duty to treat people with respect, which she did not, on any level from what OP described. Her behavior and demeanor is reprehensible at best. She should be reported, and had I witnessed this as a RN myself, I would have absolutely reported her and escalated it immediately.",
      "created_utc": 1730645585.0,
      "score": 1
    },
    {
      "id": "lv4k0w6",
      "body": "You are NOT dirty. You did NOTHING wrong. As Pete Walker would say, turn that shame in that nurse’s direction away from you.",
      "created_utc": 1730604482.0,
      "score": 39
    },
    {
      "id": "lv3m28g",
      "body": "I hope that nurse gets fired. I hope that you will become more okay after a few days or weeks.",
      "created_utc": 1730591489.0,
      "score": 89
    },
    {
      "id": "lv3pczx",
      "body": "Its great your gonna talk to your Counciler about it \nHave a nice day",
      "created_utc": 1730592684.0,
      "score": 17
    },
    {
      "id": "lv4dhq1",
      "body": "I agree too! Lawyerup!",
      "created_utc": 1730601811.0,
      "score": 14
    },
    {
      "id": "lv55l01",
      "body": "I went for an EKG recently. Not only was I instructed to take off my bra (and given a gown), but the person facilitating the test was male, and he kept \"moving\" my breasts, thru the gown, to do what he needed to do. It was awfully uncomfortable, but I had assumed this was routine. \n\nFrom some details in your comment, I'm learning that this was not routine?\n\nEdit: a word",
      "created_utc": 1730616052.0,
      "score": 12
    },
    {
      "id": "lv6yray",
      "body": "They need to \"reeducate\" her by firing her.  She doesn't deserve to be in that job, treating people like that.  And you didn't deserve to be treated like that.",
      "created_utc": 1730648830.0,
      "score": 10
    },
    {
      "id": "lv4h2vd",
      "body": "I know it is. I'm acknowledging OPs feelings, not downplaying it.  It feels like a violation because it is. And that feels bad.",
      "created_utc": 1730603238.0,
      "score": 5
    },
    {
      "id": "lv7wh73",
      "body": "That’s horrible. She shouldn’t be a nurse if she treats people that way. Try not to take it personally as I’m sure she probably unfortunately treats all her patients that way which again isn’t acceptable. Please report her.",
      "created_utc": 1730658944.0,
      "score": 1
    },
    {
      "id": "m4f4qk4",
      "body": "Why you delete your account are you ok",
      "created_utc": 1735508512.0,
      "score": 1
    },
    {
      "id": "lv66ky8",
      "body": "It depends on the circumstances.  It's not uncommon to have you remove the bra in the hospital, but not for an EKG in the triage area.  If you're already in a gown, then you're not in a triage area.  Moving the breast is normal, but there are right and wrong ways to do it (should be lifted with the back of the hand (i.e. not \"grabbed\", and with plenty of communication about what's going on and why)\n\nI don't work in the hospital, so I can't say with certainty why they would/wouldn't have you remove your bra.  I know that the metal in an underwire bra (not to assume what you wear) can interfere with imaging as well as emergency procedures (i.e. if CPR were needed, they're an absolute pain to cut through quickly)",
      "created_utc": 1730638876.0,
      "score": 15
    },
    {
      "id": "lv5xxzg",
      "body": "I too was absolutely nude from the waist up. I was not offered a gown.",
      "created_utc": 1730634825.0,
      "score": 10
    },
    {
      "id": "lv793d8",
      "body": "Thank you for having my back! ",
      "created_utc": 1730652022.0,
      "score": 5
    },
    {
      "id": "lv5zrzf",
      "body": "Your entire experience was just terrible. I mean, what were you supposed to do? Enforce a quick shower before being rushed to the hospital???  I have also, never before heard someone say that patients shouldn't wear lotion for an emergency visit. Just ridiculous.\n\nIt sounds like some bitch was having a bad day, and took it out on you. I'm so sorry you went through that",
      "created_utc": 1730635738.0,
      "score": 18
    },
    {
      "id": "lvd32iq",
      "body": "What the actual fuck? I’ve had several EKGs in the last few years and this is NOT normal.  The worst/most embarrassing they still pulled a curtain and gave me a little hand towel type thing to cover my boobs.  This is incredibly weird, not to mention idiotic that she wrote down your Dx incorrectly and lectured you for putting on lotion like you should have planned for the ER trip?? ",
      "created_utc": 1730735322.0,
      "score": 2
    },
    {
      "id": "lv60guz",
      "body": "Exactly! Who plans to come to the ER?! I fainted and when I came to, my BP was 220/110 and my heart rate was 138 at rest. I absolutely felt I needed to be seen ASAP. No time for a shower! That would have made me faint again. I've also never fainted in my entire life so that was extremely scary. She, of course, attributed all of this to anxiety. I tried to explain that I know the difference between anxiety and something arising from a physical reaction/response/issue.  My intelligence is constantly undermined, my self awareness ignored. They know best! I feel when they hear that we have a mental illness or affliction it's mostly case closed from the beginning. ",
      "created_utc": 1730636077.0,
      "score": 22
    },
    {
      "id": "lv6ufua",
      "body": "Seriously. You did the right thing going in! And as a nurse, PLEASE report that nurse! And not just via some stupid survey the hospital is inevitably going to send you. Contact the patient advocacy line or whatever public facing patient resource they have, figure out who the ER manager is, and tell them what you told us. \nYou can even give suggestions when you report on how to do better: I’ve had to apply EKG stickers to patients in non-private areas, but I always at least brought a towel and made sure to very carefully cover as much as possible. Not to mention she could’ve just taken an alcohol swab to the sticker sites to remove lotion residue and make em stick better… She must be new. \n\nI’m so sorry this happened, and I hope they didn’t find anything major!",
      "created_utc": 1730647501.0,
      "score": 1
    }
  ]
}