{
  "id": "1dlqnvl",
  "title": "My husband been having sex with me in my sleep since 2014. I've had two ectopic pregnancies that result in both tube's being removed for two separate pregnancies. Due to the amount of miscarriages I've has sex is painful. I tell him no but he just does it anyway. Should I sue him ?",
  "selftext": "I just found out my husband has cheated on me since I can't please him due to my surgeries.  It was his fault we got pregnant without a doctors supervision monitoring my health. I never knew I was pregnant until it was too late. Should I sue him for emotional damage, physical harm to my body, and my mental health? I need counseling so bad, but I'm afraid he'd go to jail. Should I just keep it in therapy? I can always delete this account.  I just wanted to hear different points of view. I swear I just want to d!3 than go file paperwork.  I wished I knew this wasn't normal.  I'm so fucking lost 😞  . I know people are asking why didn't I speak up? It's cause I thought this was normal in any relationship. \n\n\n\n\n\n\n\n\nI don't know why this post was locked but thank you to that one mom that want to give me a hug.  I desperately need it.😭😭😭. \n\nTO EVERYONE ASKING DID I CONSENT? HOW CAN I IF I'M HEAVILY SEDATED ON SLEEPING MEDS? ..... SOME OF YOU ARE THE REASON I DIDN'T SEEK HELP BECAUSE I DIDN'T WANT TO BE JUDGED ABOUT LETTING HIM DO THIS TO ME FOR YEARS.  \n\nI SAID SUE BECAUSE IF I WANT TO HAVE A FAMILY  WITH ANOTHER MAN I WOULD HAVE TO BE ARTIFICIALLY  INSIMINATED.  THAT COST MONEY I WOULD NEVER HAVE.\n\n I TRULY THOUGHT ALL WIVES DID THIS IN THEIR MARRIAGE SO THEIR HUSBAND CAN STILL BE PLEASED. \n\nI GREW UP IN RELIGIOUS HOUSEHOLD THAT NEVER HUGGED, NEVER SAID I LOVE YOU, NEVER DISCUSSED SEX NOR RELATIONSHIP ADVICE... \n\n I'VE HAD TO LEARN EVERYTHING FIRST HAND. Again, I was 19 yrs old. \n",
  "created_utc": 1719043419.0,
  "score": 948,
  "num_comments": 213,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1dlqnvl/my_husband_been_having_sex_with_me_in_my_sleep/",
  "comments": [
    {
      "id": "l9t4go5",
      "body": "I am locking this post because of the number of discriminatory comments and comments that encourage violence against OP's husband. \n\nWhat OP is reporting here is atrocious, but we still have no tolerance for bigotry and encouraging violence.",
      "created_utc": 1719087186.0,
      "score": 1
    },
    {
      "id": "l9qqocm",
      "body": "Your husband is a rapist; he *should* be in prison.",
      "created_utc": 1719049447.0,
      "score": 586
    },
    {
      "id": "l9qm35u",
      "body": "Bro had been R*ping you in your sleep... Fucking send that POS to jail he ain't your husband, nae respect for you at all, an argument is fair and excusable but repetitive unconscious sex without consent causing you pain and suffering and unknowingly being pregnant! Jesus woman, get em jailed and sued!",
      "created_utc": 1719045961.0,
      "score": 1807
    },
    {
      "id": "l9qmr31",
      "body": "Lady, you're being abused and have sustained permanent health damage as a result.\n\nWhether to sue him or not is up to you. IMO going to court it's not just about justice or vengeance, but also for preventing him from doing the same to others. Either way you should definitely file for a divorce and get away from him. \n\nPlease continue therapy and work towards ultimately finding a partner that treats you like a real human being - you deserve better!",
      "created_utc": 1719046464.0,
      "score": 323
    },
    {
      "id": "l9ql0cu",
      "body": "Please go to therapy, you need someone professional to talk about this. I feel sorry for you",
      "created_utc": 1719045164.0,
      "score": 206
    },
    {
      "id": "l9qkp4p",
      "body": "Thats 🍇 while also knowingly jeopardizes your health! You should leave him and take legal action. This is really horrible and you deserve better. ❤️",
      "created_utc": 1719044931.0,
      "score": 385
    },
    {
      "id": "l9quzmp",
      "body": "This might be the first thread that I've audibly said \"what the fuck\" to and had to re-read multiple times. \n\nWhat they've done is evil, they deserve the full extent of the law and you deserve appropriate compensation.",
      "created_utc": 1719052610.0,
      "score": 43
    },
    {
      "id": "l9qz1ne",
      "body": "> I’m afraid he’d go to jail.\n\nAre you kidding me? That is exactly where he belongs???\n\nI’d go medieval on his ass if I were u.",
      "created_utc": 1719055247.0,
      "score": 60
    },
    {
      "id": "l9qoj0a",
      "body": "Please report this to the police as fast as you can, what happened was not okay nor is it normal. Dude has no control over himself and doesn’t respect you and your words.",
      "created_utc": 1719047806.0,
      "score": 70
    },
    {
      "id": "l9qn41j",
      "body": "[removed]",
      "created_utc": 1719046734.0,
      "score": 184
    },
    {
      "id": "l9qpq5s",
      "body": "You were r*ped in your sleep.. you have every right to push EVERYTHING on him/ against him.\n\n\nHe is a m*nster.. please take the correct action, have him sued/ jailed and save yourself..",
      "created_utc": 1719048724.0,
      "score": 82
    },
    {
      "id": "l9qszsm",
      "body": "Why on earth would you sue him? That is a criminal offence. Report him to the police for committing a crime.",
      "created_utc": 1719051183.0,
      "score": 47
    },
    {
      "id": "l9rl3a7",
      "body": "A legitimate husband/partner respects your bodily autonomy because he loves you and honors you. You do not have either of those. You have someone who thinks of you as their possession. He has ZERO respect for you, and you deserve so much better.",
      "created_utc": 1719066076.0,
      "score": 10
    },
    {
      "id": "l9qouxm",
      "body": "[deleted]",
      "created_utc": 1719048056.0,
      "score": 41
    },
    {
      "id": "l9qtobc",
      "body": "HE SHOULD BE IN PRISON.",
      "created_utc": 1719051676.0,
      "score": 20
    },
    {
      "id": "l9rl7k0",
      "body": "This is rape.",
      "created_utc": 1719066123.0,
      "score": 9
    },
    {
      "id": "l9sk8v8",
      "body": "This is a very weird question.  \n\nFirstly, your husband is 100% raping you. This is sexual abuse and assault. \n\nGET OUT! RUNNN...\n\nBut next, the should you 'sue him' part is strange...? \nYou should leave him and take him to court and never look back. \nTHEN I guess you could 'sue him' for damages, etc., but like... love, you gotta get out first and put an end to this! Prioritize.",
      "created_utc": 1719079444.0,
      "score": 8
    },
    {
      "id": "l9qon3k",
      "body": "Hi OP. What your husband is doing is a gross overstepping of boundaries. He is disrespecting your wishes. He is proving he doesn't care for your health, either physical or mental.\n\nI think you know this but I'm going to type it out because sometimes it's important to see the words: **your husband is raping you**.\n\n\nYou're understandably concerned about what would happen if you pursued legal recourse, but I'd like you to put that out of mind for a moment.\n\nWhat you should be focusing all your energy on instead is escaping this relationship.\n\nI'm scared for you, OP. He is not a good person. Just because you're married doesn't mean he can claim your body whenever he feels like it. \n\nPlease research domestic violence resources in your area and start making a plan to get out. Your immediate safety is the most pressing concern.",
      "created_utc": 1719047892.0,
      "score": 7
    },
    {
      "id": "l9qkxz6",
      "body": "Yes. Do.",
      "created_utc": 1719045116.0,
      "score": 28
    },
    {
      "id": "l9qn24g",
      "body": "Yes file a case against him",
      "created_utc": 1719046693.0,
      "score": 28
    },
    {
      "id": "l9szjrv",
      "body": "Thank you for sharing, I’m so sorry all this has been happening to you. This is in no way normal in any type of healthy relationship, you deserve so much better. My advice would be to find a safe place you can go, such as a relative or friend’s house where you will be protected from him. Once you know you are safe, go straight to the police. Document this conversation somehow if you can, just in case they are not responsive, as this can be useful in court. When you are assured that this matter is being taken seriously, file for a protection order and find a good divorce lawyer. The only fair outcome of this horrific situation is that you are awarded a massive sum due to your years of abuse, and he should be sentenced to a lengthy prison term. He is a monster and does not deserve to be free for what he has done. He needs to be prevented from harming anyone else at all costs. Any other documentation or “proof” will also be helpful in court. If you need any help finding resources in your area, I’d be glad to help as I am experienced in social work and therapy. I hope you can recover from this unspeakable ordeal. You are braver than you know. Wishing you well.",
      "created_utc": 1719085300.0,
      "score": 6
    },
    {
      "id": "l9qzy3b",
      "body": "Yes who he is and his relationship to you is completely irrelevant. He is by definition a rapist and therefore a danger to society and should be charged and locked up. If he sees **his own wife** as just an object to stick his dick in whenever he feels like it, I imagine the “barrier to entry” for sex crimes against others is pretty low for him. He is a danger to society and also just a *fucking asshole*",
      "created_utc": 1719055793.0,
      "score": 11
    },
    {
      "id": "l9qr1x3",
      "body": "Ask for help. Seek justice. You deserve it <33 love you  stay safe. I believe in you.",
      "created_utc": 1719049733.0,
      "score": 11
    },
    {
      "id": "l9r50hn",
      "body": "This is someone who does not respect you. You shouldn’t be worried about him going to jail. I’m so sorry you are going through this. This is so messed up :( please if you have someone to talk to or somewhere to go for a while please go. This is abuse :( do you have any children at all together?",
      "created_utc": 1719058640.0,
      "score": 5
    },
    {
      "id": "l9rahy5",
      "body": "He's been putting you through all this for TEN YEARS and he's still your husband? Girl, please get help. And I mean that. You don't deserve this, but it seems you don't realize that. ",
      "created_utc": 1719061418.0,
      "score": 6
    },
    {
      "id": "l9rqr3g",
      "body": "He is assaulting you in your sleep . Document it put a hidden camera by the bed then lawyer up and destroy him .",
      "created_utc": 1719068303.0,
      "score": 4
    },
    {
      "id": "l9qtqc7",
      "body": "He should absolutely be sent to jail so he can no longer hurt anyone else",
      "created_utc": 1719051715.0,
      "score": 9
    },
    {
      "id": "l9qj6hy",
      "body": "Call the police and get out. Believe it or not, that is rape.",
      "created_utc": 1719043817.0,
      "score": 3
    },
    {
      "id": "l9ql6pm",
      "body": "that is literally rape, I am so sorry. jail is the least he deserves for the damage he's done to you and your body",
      "created_utc": 1719045298.0,
      "score": 3
    },
    {
      "id": "l9r0072",
      "body": "Send that pos to jail. He’s raping you, in your sleep!!! No means no. You deserve better, he should be exposed before he does it some other woman. I’m so sorry you’re going through this.",
      "created_utc": 1719055829.0,
      "score": 4
    },
    {
      "id": "l9r6w9i",
      "body": "Fuck this mfer for real. He’s not owed any of your sympathy. Not only did he r*pe you for the last decade (which is and enough on its own), he did it despite the pin and suffering it has been causing you.",
      "created_utc": 1719059632.0,
      "score": 5
    },
    {
      "id": "l9rae0g",
      "body": "He’s literally raping you.. so yeah you should so him for harm.. and also get checked for STDs if he’s having sex with others.",
      "created_utc": 1719061367.0,
      "score": 4
    },
    {
      "id": "l9rmtnc",
      "body": "Sue him? How about leaving him?. Then you can think about the rest. Getting away is the first priority here.",
      "created_utc": 1719066769.0,
      "score": 4
    },
    {
      "id": "l9rr4wy",
      "body": "Please please send his ass to jail and get mental health treatment. I know I’m an internet stranger but if you were one of my friends irl, I’d rip that man in half",
      "created_utc": 1719068449.0,
      "score": 4
    },
    {
      "id": "l9rszh7",
      "body": "He raped you. You should be reporting him to the police but sadly cops are assholes to women. I would find a grassroots organization that helps survivors of violence and get their help",
      "created_utc": 1719069152.0,
      "score": 5
    },
    {
      "id": "l9rvfjs",
      "body": "That is sexual assault. That is rape. Period. Married or not, he did it without your consent and you specifically said no.  I understand why you didn't speak up, it happens more than people realize in domestic violence cases, for many reasons, the primary one being legitimate fear because of the violence, and a safe exit plan is necessary. Your feelings are valid! But this man should absolutely be reported and in prison. Therapy and legal action are absolutely necessary and therapists are available online if you can't find a local therapist. You can also reach out to a domestic violence organization for help and counseling, and some of them offer legal assistance if they have an on-staff attorney, it just depends on the organization and what they're able to offer. You should find a therapist who specializes in trauma and domestic violence, as they are trained for this. I am so sorry this has happened to you. A domestic violence crisis line can help you find a local dv organization in your area.",
      "created_utc": 1719070079.0,
      "score": 5
    },
    {
      "id": "l9rzq7t",
      "body": "He belongs in jail.",
      "created_utc": 1719071706.0,
      "score": 3
    },
    {
      "id": "l9s03pu",
      "body": "It's up to you. Depending on what he's worth financially, you could get a decent amount of money to assist with future fertility/pregnancy costs.\n\nIt could also allow you to show the world who he is, punish him for what he did to you, if that's what you want.\n\nBut any trial, civil or criminal, can be very, very hard. \n\n[I Sued My Rapist And Walked Away With $400,000. This Is What I Learned About Power.](https://www.google.com/amp/s/www.huffpost.com/entry/suing-a-rapist_n_5ce43a6de4b087700995f4d7/amp)\n\nAny reporting will require you to relive and repeat what happened to strangers, over and over. Some rape survivors who go through it say it was worse than the actual assault.\n\nIf YOU want to report him for whatever reason, or pursue charges for whatever reason, do it! But don't do it for someone else's reasons. Don't do it because you feel like you \"should\" or are \"supposed to.\" \n\nReliving, reporting any assault can be super hard. Even in counseling, it can be really difficult. I absolutely don't blame you for not reporting it. No one should. \n\nMy only recommendation is to *try* to work through it in counseling. As I said, it's difficult, painful. Again, I'd never blame you for choosing not to. It can really help, though.",
      "created_utc": 1719071847.0,
      "score": 4
    },
    {
      "id": "l9sk0ix",
      "body": "Send him to jail.",
      "created_utc": 1719079358.0,
      "score": 5
    },
    {
      "id": "l9sphc7",
      "body": "I'm really sorry you had to go through all of this. Your husband is a rapist who has no regard for your health or wellbeing, he is a selfish person who has inflicted a lot of pain upon you for his own vile and disgusting pleasure, that's no husband, that's an abuser. \n\nBest thing to do right now is to try and take care of yourself, you are the priority. Think first about your physical and mental health; and stay as far away from this person as possible, cut all contacts and communication with him and do get some support and continue going to therapy. \n\nI would also definitely suggest taking legal actions for all the things he has done to you, get some counseling and legal help. I know it can be hard but he doesn't deserve to go on without paying for his actions and I believe it can help you find some closure.\n\nI wish you all the best, take care,",
      "created_utc": 1719081439.0,
      "score": 3
    },
    {
      "id": "l9suo0f",
      "body": "That is sexual assault and you should get in contact with your local Domestic Violence advocates. You need to divorce his ass and get a lawyer. They can help you with all of that. I am so sorry he robbed you of your fertility. That is **not** okay..",
      "created_utc": 1719083412.0,
      "score": 3
    },
    {
      "id": "l9qv46a",
      "body": "He needs to go to jail.",
      "created_utc": 1719052697.0,
      "score": 7
    },
    {
      "id": "l9qwzxw",
      "body": "Does he drug you? I'm wondering how he can do that without you waking up? either way, dump his ass.",
      "created_utc": 1719053963.0,
      "score": 6
    },
    {
      "id": "l9qzc54",
      "body": "Police, ESCAPE, and lots and lots of therapy. I’m so upset for you.",
      "created_utc": 1719055424.0,
      "score": 3
    },
    {
      "id": "l9r0rko",
      "body": "How does someone have sex with someone else while they are sleeping? Does he drug you?",
      "created_utc": 1719056276.0,
      "score": 3
    },
    {
      "id": "l9r2erm",
      "body": "That's really fucked up",
      "created_utc": 1719057210.0,
      "score": 3
    },
    {
      "id": "l9r3d12",
      "body": "Sue? That and throw his ass in jail!",
      "created_utc": 1719057741.0,
      "score": 3
    },
    {
      "id": "l9r5oer",
      "body": "Press charges for assault, then divorce.",
      "created_utc": 1719058995.0,
      "score": 3
    },
    {
      "id": "l9rb159",
      "body": "Sue him?!!! Get that C**t put in jail. That's is beyond wrong. You shouldn't have to put up with any of that. As a man if my partner said no I'd leave it at that, no one should be forced to do anything let alone without them even knowing plus yeah sue him aswell.",
      "created_utc": 1719061669.0,
      "score": 3
    },
    {
      "id": "l9rhtcg",
      "body": "Absolutely yes, not only is this obviously against the law, but also someone as depraved as him deserves to rot in jail. Think of it like this, what would you tell a good friend of yours to do if they came to you in the same situation?",
      "created_utc": 1719064719.0,
      "score": 3
    },
    {
      "id": "l9rp8c5",
      "body": "Bruh, I read the title and my fucking jaw dropped. I don't normally advocate for violence get yourself a bag of lime and shovel, because that's all that worthless sack of trash deserves",
      "created_utc": 1719067715.0,
      "score": 3
    },
    {
      "id": "l9rprf8",
      "body": "its sex without consent, or rape. Bro will be jailed by now,  if he is in my country.",
      "created_utc": 1719067922.0,
      "score": 3
    },
    {
      "id": "l9rvyg8",
      "body": "This is a serious crime (I imagine many different crimes). I'm sorry you're going through all of this.",
      "created_utc": 1719070277.0,
      "score": 3
    },
    {
      "id": "l9rw33t",
      "body": "You’re unable to give consent while you’re asleep. You’ve told him no. He’s disregarded you and your well-being. This is awful and you should 100% sue and 100% press charges. Speak with legal council before making any moves. Definitely have your medical records prepared.",
      "created_utc": 1719070327.0,
      "score": 3
    },
    {
      "id": "l9rzeur",
      "body": "Please, please, call the police. I can’t even imagine how hard this is to deal with, but this man is evil, please tell someone",
      "created_utc": 1719071587.0,
      "score": 3
    },
    {
      "id": "l9s3a55",
      "body": "Get as far away from that man as possible. Take whatever legal action you can. He’s a rapist, and that’s putting it nicely. Look on psychology today.com to see what counselors are around your area and taking clients because you could probably use some professional help after being so horribly violated. What the fuck. What an awful person he is.",
      "created_utc": 1719073056.0,
      "score": 3
    },
    {
      "id": "l9sc4sg",
      "body": "My answer has two sides, so bear with me. \nEthically and morally, I’d say absolutely take him to court. What he’s been doing to you is SA and his complete disregard for the pain and health complications he KNOW it causes you shows how little he prioritizes you and whatever care he has for you.  He’s consistently prioritized his sex drive over everything else and that makes him a dangerous man. \n\nOn the other side, as someone who’s gone through the court process for SA, I spent a year in trial against my abuser over two counts, one where I was incapacitated and drunk and there were multiple witnesses, and one where I was asleep. I spent a year on the phone and in meetings with lawyers and advocates and prosecutors, and it was awful. I was constantly having to relive and retell what he did to me, in excruciating detail, again and again. Because the courts need to prove beyond a shadow of a doubt, I was questioned and every single detail of my abuse was picked apart under a microscope. And after all of that, the case was dropped at a year, didn’t make it to the courtroom, all because there was a POSSIBILITY the court would’ve perceived us as dating and the jury would’ve eaten me alive. My prosecutors were angels, they were so kind and they fought for me so hard. But they told me that ultimately it boiled down to the jury and with the complexity of it, with the potential perception that we’d been dating,  she did not want me to be subjected to a jury and the defense when that perception was on the table. \n\nI only pursued the case after finding out the same guy had done it to another girl about six months after me. I wanted repercussions so he could never hurt another person again, so I chose to pursue a criminal case over a civil case. And the court process made me relive that and second guess my own experience constantly for a year, only for the case to get dropped. \nI won’t tell you what you should or shouldn’t do by any means. All I’ll say is that, as someone who went through that court process to fight for myself and protect other women, I wouldn’t do it again. The court process caused me an incredible amount of trauma and held me in that traumatic space preventing healing for so long, and he got off scott free.",
      "created_utc": 1719076408.0,
      "score": 3
    },
    {
      "id": "l9qzfyi",
      "body": "SUE? MOTHERFUCKER CHARGE HIS SORRY ASS AND SEE HOW HE LIKES WAKING UP TO DAYSHAWN QUANTAVIOUS CLAPPING HIS BOOTY IN THE CELL BUNK",
      "created_utc": 1719055490.0,
      "score": 17
    },
    {
      "id": "l9qooca",
      "body": "sue him. he blatantly has no respect. or care for you and your body. you deserve so much more than that kind of treatment.",
      "created_utc": 1719047917.0,
      "score": 6
    },
    {
      "id": "l9qsy2i",
      "body": "Sue him? First slap him and then keep him away from you. He cannot abuse your body like this.",
      "created_utc": 1719051146.0,
      "score": 5
    },
    {
      "id": "l9qkmfh",
      "body": "Spousal rape is absolutely a thing that should be taken seriously. If you are not consenting...it's rape. He is aggravating medical issues that you have stacking up the mental toll that repeated miscarriages and medical issues cause. In your bed when you are asleep should be the safest place in the world. \n\nYour medical issues are not a green card to cheat. If you guys are not on the same page sexually where he feels the need to look elsewhere then let him look else where for a roof for his head, somewhere to eat his meals, shower, sleep. You deserve better. \n\nI understand not wanting to get him into trouble with the law, feelings are complicated, emotions make everything hard. But please remember that you didn't get him into trouble his actions did. He made the choices. \n\nI strongly suggests you seek help from a Dr or woman's refuge or mental health support even if you don't want to go down the legal route. You need support for recovery from sexual assault/rape. \n\nSpousal rape is real and it happens every day. It should be taken seriously.\n\n\nAlso go back and see your Dr about your medical issues and keep at them till they help you.",
      "created_utc": 1719044875.0,
      "score": 2
    },
    {
      "id": "l9qlr8q",
      "body": "im so sorry that you had to go through that thats seriously not okay. Consent is important and he didnt respect that so yeah get counseling thats the least he could for all the damage he’s done. Thats health thats the most serious thing in a persons life and he lets his pleasures win him over. I hope you get the help you need. Take care and. have a good day 🤍",
      "created_utc": 1719045717.0,
      "score": 2
    },
    {
      "id": "l9qpdac",
      "body": "What he is doing is wrong, that is rape. I can’t tell you what to do, as crime victims have to make the decision to report a crime,but he is an adult and should be held accountable to the law. Regardless of whether you report him, you should seek therapy and consider leaving him for your safety and well being.",
      "created_utc": 1719048449.0,
      "score": 2
    },
    {
      "id": "l9qpezu",
      "body": "This is rape. You need to press charges and sue him. Especially since he caused physical damage. Go to therapy.",
      "created_utc": 1719048485.0,
      "score": 2
    },
    {
      "id": "l9qqbam",
      "body": "he's raping you .report him ",
      "created_utc": 1719049174.0,
      "score": 2
    },
    {
      "id": "l9qqbpy",
      "body": "That's rape, file a police report and get away from him. You deserve to be safe. ",
      "created_utc": 1719049183.0,
      "score": 2
    },
    {
      "id": "l9qxnww",
      "body": "This is rape. He is raping you. Gather as much evidence and take him for all he's worth and get him charged.",
      "created_utc": 1719054390.0,
      "score": 2
    },
    {
      "id": "l9qy16f",
      "body": "I'm so sorry",
      "created_utc": 1719054622.0,
      "score": 2
    },
    {
      "id": "l9qz2fl",
      "body": "Um that's rape... no way around it. Lock him up",
      "created_utc": 1719055261.0,
      "score": 2
    },
    {
      "id": "l9r4tvl",
      "body": "If sex is unwanted in any way shape or form it’s called RAPE and if he loves you for real he wouldn’t be doing ANYTHING to hurt you! Sue him?! Put his ass in prison!!!",
      "created_utc": 1719058539.0,
      "score": 2
    },
    {
      "id": "l9r873r",
      "body": "Yeah this is non consensual sex, aka rape",
      "created_utc": 1719060295.0,
      "score": 2
    },
    {
      "id": "l9r9ade",
      "body": "YES. That is rape.",
      "created_utc": 1719060837.0,
      "score": 2
    },
    {
      "id": "l9rc2hm",
      "body": "That's rape.  Report him.  No means no , you made that clear",
      "created_utc": 1719062155.0,
      "score": 2
    },
    {
      "id": "l9rfqcx",
      "body": "That is not healthy, he is actively raping you.",
      "created_utc": 1719063819.0,
      "score": 2
    },
    {
      "id": "l9rjro2",
      "body": "This is rape",
      "created_utc": 1719065531.0,
      "score": 2
    },
    {
      "id": "l9rp4la",
      "body": "Jfc why is he your “husband” and not “ex husband” at the very least?! What kind of monster would do this…it’s rape and physical abuse. He should be in prison.",
      "created_utc": 1719067674.0,
      "score": 2
    },
    {
      "id": "l9rpva4",
      "body": "send him to jail",
      "created_utc": 1719067963.0,
      "score": 2
    },
    {
      "id": "l9rqxgr",
      "body": "Yes.",
      "created_utc": 1719068370.0,
      "score": 2
    },
    {
      "id": "l9rwjmq",
      "body": "That is Rape. Leave him and report him to the police.",
      "created_utc": 1719070500.0,
      "score": 2
    },
    {
      "id": "l9rx39a",
      "body": "bruh. what the fuck",
      "created_utc": 1719070707.0,
      "score": 2
    },
    {
      "id": "l9ry8lx",
      "body": "Please pursue legal action",
      "created_utc": 1719071142.0,
      "score": 2
    },
    {
      "id": "l9rypje",
      "body": "Please please please leave this man and press charges. Please. This is not sex; it's rape. PLEASE get out of there.",
      "created_utc": 1719071321.0,
      "score": 2
    },
    {
      "id": "l9s0kto",
      "body": "If there ni consent its rape",
      "created_utc": 1719072027.0,
      "score": 2
    },
    {
      "id": "l9s0p0g",
      "body": "Divorce and sue him",
      "created_utc": 1719072072.0,
      "score": 2
    },
    {
      "id": "l9s0sni",
      "body": "Please start living somewhere else immediately, with someone you can trust. He is raping you. I'm so sorry this has been your life for so long. I don't know what you should do legally, but you really need to get away from him immediately.",
      "created_utc": 1719072110.0,
      "score": 2
    },
    {
      "id": "l9s4t0j",
      "body": "[removed]",
      "created_utc": 1719073629.0,
      "score": 1
    },
    {
      "id": "l9sbxu4",
      "body": "HUH. \n\nThis is RAPE, girl. Run!!",
      "created_utc": 1719076335.0,
      "score": 2
    },
    {
      "id": "l9sc3pr",
      "body": "Omfg he needs to be locked up go to a crisis shelter or domestic violence support organization, divorce him asap, and also notify the local police and prosecutors office.",
      "created_utc": 1719076397.0,
      "score": 2
    },
    {
      "id": "l9sefc0",
      "body": "please get the authorities involved..",
      "created_utc": 1719077270.0,
      "score": 2
    },
    {
      "id": "l9t25v6",
      "body": "Homie should be on a watch list that everyone can see, vigilantes should definitely be a thing. Like everyone says that isn't consent. Dude needs to be buried.",
      "created_utc": 1719086306.0,
      "score": 2
    },
    {
      "id": "l9rewtd",
      "body": "You will be in for such a fight. It will be a he said/she said and this has gone on for a decade. The legal system will hammer you. That may not be right, but it’s a likely outcome. You need to divorce him, block him, and put him so far in the rearview mirror that you can’t see the speck. Get out. But for the sake of your mental health, don’t start putting yourself through a bunch of fights with him and strangers.",
      "created_utc": 1719063454.0,
      "score": 4
    },
    {
      "id": "l9rqppi",
      "body": "Sue, meaning divorce and have arrested? Yes.",
      "created_utc": 1719068289.0,
      "score": 4
    },
    {
      "id": "l9rub6y",
      "body": "I understand the state you’re in. Please seek professional assistance. Therapists aren’t mandatory reporters for people of the age of majority who aren’t elders/disabled. You’d be able to speak freely without concern of repercussions, and get the advice that would best help you get out of this situation.",
      "created_utc": 1719069653.0,
      "score": 4
    },
    {
      "id": "l9qok7v",
      "body": "[removed]",
      "created_utc": 1719047831.0,
      "score": 6
    },
    {
      "id": "l9qve49",
      "body": "Yeah that's called grape",
      "created_utc": 1719052884.0,
      "score": 4
    },
    {
      "id": "l9rjjuo",
      "body": " That's not your husband if you ask me that's fd up",
      "created_utc": 1719065442.0,
      "score": 2
    },
    {
      "id": "l9sopmv",
      "body": "You should sue him like yesterday. Please , think about yourself because he is clearly not thinking about you. The best of luck.",
      "created_utc": 1719081146.0,
      "score": 2
    },
    {
      "id": "l9t3yjn",
      "body": "fucking divorce him and yes fucking sue him if he ends up in jail that’s where he belongs he should not be fucking RAPING u in ur sleep. if u don’t say anything it will happen to someone else and u also deserve justice for what happened",
      "created_utc": 1719086994.0,
      "score": 2
    },
    {
      "id": "l9qjelb",
      "body": "If you're not consenting to that kind of activity technically I think it's rape. Whether you sue him or not is not for me to decide. With the right lawyer you have a strong case against him.",
      "created_utc": 1719043980.0,
      "score": 1
    },
    {
      "id": "l9qz0mw",
      "body": "Unless you have a very specific kink, that's just rape. If he admits it, get a recording or get it in writing and divorce him. I can't believe you would allow it to go on for 10 whole years",
      "created_utc": 1719055230.0,
      "score": 1
    },
    {
      "id": "l9radcu",
      "body": "Does your state/country recognize marital rape?",
      "created_utc": 1719061358.0,
      "score": 1
    },
    {
      "id": "l9rm99f",
      "body": "In your sleep or while you are asleep? Because for first you cannot sue anyone but first latter you definitely should.",
      "created_utc": 1719066542.0,
      "score": 1
    },
    {
      "id": "l9s118k",
      "body": "Sue him? Get him charged!",
      "created_utc": 1719072200.0,
      "score": 1
    },
    {
      "id": "l9sg602",
      "body": "No, dear, I'm fully medicated when I sleep. My husband is wide awake . He cleans me up after he's done. Sometimes, a towel is left between my legs and sometimes he washes me . The after smell of sex is so loud. I know I don't get up to participate I'm completely a d3@d body when I sleep.",
      "created_utc": 1719077922.0,
      "score": 1
    },
    {
      "id": "l9shh8y",
      "body": "I'm curious to know what part did you believe it was norman in all relationships?",
      "created_utc": 1719078413.0,
      "score": 1
    },
    {
      "id": "l9sol25",
      "body": "Not sued, that implies civil court cases. Arrested; that's a very serious crime, he needs to be charged with rape and sexual assault for all the times he did that in the decade he's been doing it.",
      "created_utc": 1719081097.0,
      "score": 1
    },
    {
      "id": "l9sx4y9",
      "body": "Call your local domestic abuse hotline. Many of them offer FREE therapists and can help you come up with a plan. ",
      "created_utc": 1719084364.0,
      "score": 1
    },
    {
      "id": "l9t07om",
      "body": "You should divorce him immediately, get a protection order, and file chargers.",
      "created_utc": 1719085556.0,
      "score": 1
    },
    {
      "id": "l9t1z42",
      "body": "You can’t sue him I don’t think but you should definitely press charges that is rape",
      "created_utc": 1719086235.0,
      "score": 1
    },
    {
      "id": "l9s3pme",
      "body": "Most definitely should look into it. Especially if it wasn't agreed upon. I had a girlfriend that would beg me to wake her up that way and I wouldn't even do that. This is just wrong.",
      "created_utc": 1719073221.0,
      "score": 1
    },
    {
      "id": "l9qzsq2",
      "body": "[removed]",
      "created_utc": 1719055705.0,
      "score": 1
    },
    {
      "id": "l9rpv8s",
      "body": "[removed]",
      "created_utc": 1719067962.0,
      "score": -2
    },
    {
      "id": "l9r0g28",
      "body": "Sex sleep disorder is a real thing where you have sex in your sleep but if they can't find evidence of that maybe you should",
      "created_utc": 1719056088.0,
      "score": -4
    },
    {
      "id": "l9r8p8x",
      "body": "You must be a deep sleeper. What annoys you more, the cheating or raping?",
      "created_utc": 1719060547.0,
      "score": -5
    },
    {
      "id": "l9rpb73",
      "body": "[removed]",
      "created_utc": 1719067746.0,
      "score": 47
    },
    {
      "id": "l9qt5ce",
      "body": "[deleted]",
      "created_utc": 1719051295.0,
      "score": -15
    },
    {
      "id": "l9rmons",
      "body": "Absolutely. This comment says it all.,",
      "created_utc": 1719066713.0,
      "score": 210
    },
    {
      "id": "l9ru5mq",
      "body": "This. Please find a trusted friend or doctor, share this post, and ask for whatever support or help you need going to the police station. You should also discuss with someone you trust getting into trauma therapy asap so you can heal. What your husband did is very wrong. He needs to he someplace he cant do it again and you deserve the medical attention it takes to heal. Please go to the police today if possible and if you told your doctors these facts. find new doctors and a lawyer to deal with them.",
      "created_utc": 1719069594.0,
      "score": 84
    },
    {
      "id": "l9rixol",
      "body": "This might be a dumb question, but could this have been an arrangement for them when it started?\nIm not trying to play devils advocate for raping someone. If there was no consent at all then i agree with the comment above.\n\nIf this is something OP used to give consent for but doesnt any longer, then OP might need to try some couples counceling or just divorce the \"husband\" (read: POS) and possibly press charges.\n\nAgain, if there was no consent for the sleep sex it is rape and really not okay.",
      "created_utc": 1719065185.0,
      "score": -53
    },
    {
      "id": "l9rkjm4",
      "body": "Thank you so much , I'm trying, but no one is taking new patients in my hometown. I feel so loss. This is why I posted here. To get the point of view from strangers. I was hoping a therapist saw my post.",
      "created_utc": 1719065854.0,
      "score": 89
    },
    {
      "id": "l9r79l0",
      "body": "The 🍇is a perfect workaround!!",
      "created_utc": 1719059824.0,
      "score": 54
    },
    {
      "id": "l9rix6w",
      "body": "Thank you I'm so lost. I didn't even think it was rape. I thought all couples did this. I met him when I was 19. So all I know is him.",
      "created_utc": 1719065180.0,
      "score": 14
    },
    {
      "id": "l9ripin",
      "body": "Yes I am, His family is large . We live in a small town. The judicial system is screwed . Some of his family member's are involved with law enforcement",
      "created_utc": 1719065092.0,
      "score": 21
    },
    {
      "id": "l9qoi3x",
      "body": "[removed]",
      "created_utc": 1719047787.0,
      "score": 46
    },
    {
      "id": "l9rimba",
      "body": "My tube's have been removed due too the pregnancies I wasn't aware of. I'd like to have a family with my next relationship.  I can't have kids unless I see a specialist.  I still have my ovaries just no tube's.",
      "created_utc": 1719065055.0,
      "score": 29
    },
    {
      "id": "l9rxufh",
      "body": "Oftentimes, if there isn't enough evidence of a crime or enough evidence for the district attorney to pursue charges, a civil lawsuit is the only way to get any sort of justice or legal assistance.\n\nA sexual assault lawsuit – separate from criminal case proceedings – can help survivors recover damages for the harm caused.\n\nIn this case, the rapist could be sued for emotional distress and permanent physical harm.",
      "created_utc": 1719070992.0,
      "score": 15
    },
    {
      "id": "l9rmt6c",
      "body": "Thank you so much. I've lost myself in this relationship.",
      "created_utc": 1719066763.0,
      "score": 11
    },
    {
      "id": "l9rph3x",
      "body": "That self awareness means you probably are.",
      "created_utc": 1719067810.0,
      "score": 13
    },
    {
      "id": "l9ro45p",
      "body": "I honestly didn't know💔😭",
      "created_utc": 1719067281.0,
      "score": 3
    },
    {
      "id": "l9rjgj9",
      "body": "Thank you I thought this was normal in a relationship. I met him at 19 😭",
      "created_utc": 1719065404.0,
      "score": 6
    },
    {
      "id": "l9qjc40",
      "body": "For context: this happened to me. It typically continues to escalate. I got out but I wish I had made a report because then you have some evidence to fall back on. You deserve so much better. 💜",
      "created_utc": 1719043931.0,
      "score": 16
    },
    {
      "id": "l9rjbly",
      "body": "No I take some heavy anti depression medication for my migraines and to sleep. I suffer from sleep insomnia. A tornado can be going on and I wouldn't wake up until 6 hrs l8r.",
      "created_utc": 1719065346.0,
      "score": 8
    },
    {
      "id": "l9rijc9",
      "body": "Some people are very heavy sleepers.\n\nMy ex used to do the same to me, often, when my kids were babies and I was sleep deprived and would finally get to pass out.\n\nHe'd watch porn after I fell asleep and then use my body (without my knowledge or consent) to satisfy himself. Sometimes I would wake up in the middle of it. It's so violating and dehumanizing. \n\nMan, it really sucked to type that out.\n\nBelieve other people's lived experiences, survivors need support.",
      "created_utc": 1719065020.0,
      "score": 11
    },
    {
      "id": "l9sdzmh",
      "body": "Wow thank you for sharing your story with me. That's why I'm afraid to go to the court system. My hometown, Every judge lawyer and cop is related to each other. His family has ties in the judicial system.",
      "created_utc": 1719077105.0,
      "score": 2
    },
    {
      "id": "l9rj4lz",
      "body": "I said sue because I want him to pay for what he's done too my body. I feel less of a women because I can't have children the old fashioned way. I have to pay a doctor to get pregnant",
      "created_utc": 1719065265.0,
      "score": 10
    },
    {
      "id": "l9se6m8",
      "body": "Thank you🥹 i wished I was able to see through his bs sooner. I would still have both my tubes.",
      "created_utc": 1719077178.0,
      "score": 1
    },
    {
      "id": "l9t3twt",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to discuss this removal, please contact the moderation team using the [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1719086945.0,
      "score": 1
    },
    {
      "id": "l9r5o00",
      "body": "[removed]",
      "created_utc": 1719058989.0,
      "score": -5
    },
    {
      "id": "l9sekeh",
      "body": "Coming from a man thank you so very much. I truly thought this was normal for your spouse to wake you up like that . I'm thinking it was his way of showing me he wanted me physically. Not him just pleasing himself. My body has so much vaginally scaring from my miscarriages I only would have sex if I took pain pills first.",
      "created_utc": 1719077324.0,
      "score": 2
    },
    {
      "id": "l9slfb6",
      "body": "[removed]",
      "created_utc": 1719079892.0,
      "score": 2
    },
    {
      "id": "lcv6ovf",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to discuss this removal, please contact the moderation team using the [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1720805357.0,
      "score": 0
    },
    {
      "id": "l9rk6lu",
      "body": "I am it's the grape 🍇 part. I don't care about who he sleeps with. I'm happy it's not me anymore, due to this I can't have children.  I'm a high risk for pregnancy.  My pregnancies were supposed to be monitored and supervised by a professional.  He didn't follow any of my doctors orders and just started having seggs with me while I'm sleep. I truly thought all couples did this. I was only 19 when I met him.",
      "created_utc": 1719065702.0,
      "score": 3
    },
    {
      "id": "l9t4nxj",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to discuss this removal, please contact the moderation team using the [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1719087264.0,
      "score": 6
    },
    {
      "id": "l9qxq9x",
      "body": "Seriously? OP literally wrote “I tell him no but he does it anyway” and you come up with if she consented? Use your brain dude",
      "created_utc": 1719054431.0,
      "score": 68
    },
    {
      "id": "l9qz8b0",
      "body": "How the fuck can she consent if she’s sleeping???? Also, no, being married doesn’t give you automatic consent to be raped in your sleep.",
      "created_utc": 1719055359.0,
      "score": 48
    },
    {
      "id": "l9qxg1j",
      "body": "She was asleep what do you mean 😟",
      "created_utc": 1719054250.0,
      "score": 20
    },
    {
      "id": "l9rrn6o",
      "body": "This comment is unhelpful and gross.\n\nVictim blaming is neither helpful nor kind. \n\nhttps://welshwomensaid.org.uk/news/understanding-victim-blaming-and-why-its-harmful-to-survivors/",
      "created_utc": 1719068641.0,
      "score": 32
    },
    {
      "id": "l9rsqld",
      "body": "Consent can be revoked at ANY TIME. Even if you are married.",
      "created_utc": 1719069059.0,
      "score": 22
    },
    {
      "id": "l9sqfry",
      "body": "How can someone consent if they are alseep??",
      "created_utc": 1719081801.0,
      "score": 6
    },
    {
      "id": "l9rthkr",
      "body": "Even if they used to give consent and no longer do, it means it's NO consent. They are being raped and they should put their husband in jail. Your comment is moronic.",
      "created_utc": 1719069341.0,
      "score": 10
    },
    {
      "id": "l9rq0oy",
      "body": "If you go on psychology today website, you can find many therapists from near or far. During Covid, a lot of therapists moved their practice to a virtual option. So many are doing it virtually now. Send out a few emails. Do the 15 min consults. Find someone to talk to 💕",
      "created_utc": 1719068021.0,
      "score": 42
    },
    {
      "id": "l9rpaj2",
      "body": "I’m sending you all my love. You need to get away from that man. He doesn’t deserve you. He needs to be punished, and you need to be protected.",
      "created_utc": 1719067739.0,
      "score": 52
    },
    {
      "id": "l9rwxx7",
      "body": "Try telehealth therapy if you can't find anyone!\n\nYou are a victim of serial rape. I would recommend calling RAINN (Rape, Abuse & Incest National Network) if you're in the US to get better (professional) advice. \n\nIt's free, confidential, 24/7: 1-800-656-4673\nYou can also chat for free: https://hotline.rainn.org/online",
      "created_utc": 1719070650.0,
      "score": 15
    },
    {
      "id": "l9rvq9d",
      "body": "Thriveworks. It’s online and takes all kind of insurance plans.",
      "created_utc": 1719070192.0,
      "score": 6
    },
    {
      "id": "l9rom9f",
      "body": "There are telehealth options, too!",
      "created_utc": 1719067477.0,
      "score": 3
    },
    {
      "id": "l9s3apj",
      "body": "I think you can call 988, crisis/suicide hotline. Even if you're not thinking of suicide, there are still helpful people answering the phone that can direct you to next steps.",
      "created_utc": 1719073062.0,
      "score": 1
    },
    {
      "id": "l9sbys9",
      "body": "you can say rape here, reddit isn’t like tiktok",
      "created_utc": 1719076345.0,
      "score": 60
    },
    {
      "id": "l9r98qx",
      "body": "filters don’t catch it so it’s not ideal if you’re trying to avoid discussions of rape",
      "created_utc": 1719060815.0,
      "score": -4
    },
    {
      "id": "l9s08pt",
      "body": "Omg no, absolutely 100% not ok, I'm so very sorry. Listen to the people telling you to report him but try to gather evidence, maybe a text asking him how long he has been doing this in your sleep.  He should not get away with this and he will do it again to someone else. Please take care of yourself",
      "created_utc": 1719071900.0,
      "score": 18
    },
    {
      "id": "l9s1aar",
      "body": "This is Not something all couples do. It's not okay at all. Good for you for posting here to validate your feelings and experience. Get away from him asap! No one deserves what you're going through.",
      "created_utc": 1719072296.0,
      "score": 12
    },
    {
      "id": "l9szj2g",
      "body": "Oh honey, I just want to give you a mom hug. It's not normal and you deserve better! Please see what organisation's are nearby that may be able to help you get out of this situation.",
      "created_utc": 1719085292.0,
      "score": 10
    },
    {
      "id": "l9s5eoa",
      "body": "I met my fiance at 18 and we have a 1 year old now. I know that this behavior is not normal at all and even though my partner is older I held strong on my boundaries and respect is very important to me in a relationship. Above love. Your husband does not respect you as a person, uses you as just a lifeless body when your sleeping. It's not only rape that concerns me. It's the kind of death fetish he has along with rape. He is dangerous and what you should consider is, if you don't report him, how many girls will he do this to?",
      "created_utc": 1719073850.0,
      "score": 6
    },
    {
      "id": "l9qpzfg",
      "body": "[removed]",
      "created_utc": 1719048922.0,
      "score": 45
    },
    {
      "id": "l9qvow1",
      "body": "[removed]",
      "created_utc": 1719053086.0,
      "score": 9
    },
    {
      "id": "l9scdgn",
      "body": "Him raping you is terrible and if I were you I would call the police.\n\nAs for whether you can sue him, you might want to ask at r/legaladvice\n\nBy the way, feel free to join us at r/ectopicsupportgroup",
      "created_utc": 1719076497.0,
      "score": 30
    },
    {
      "id": "l9rmzck",
      "body": "Codependency can definitely do that",
      "created_utc": 1719066831.0,
      "score": 8
    },
    {
      "id": "l9s6yfl",
      "body": "It's called [Marital Rape](https://en.m.wikipedia.org/wiki/Marital_rape).\n\nMarital rape or spousal rape is the act of sexual intercourse with one's spouse *without* the spouse's consent. It is considered a form of domestic violence (even if the act is non-violent) and sexual abuse.\n\nSome people believe a husband can't rape his spouse because he \"owns\" her body or some other *garbage*. \nThose people will tell you what he did isn't rape. And [in some countries](https://en.m.wikipedia.org/wiki/Marital_rape_laws_by_country), it isn't classified as rape, and isn't illegal.\n\nBUT, as you have seen, *MANY* people will tell you it *is* rape, and it is widely classified as rape or sexual assault in many countries.",
      "created_utc": 1719074421.0,
      "score": 5
    },
    {
      "id": "l9rqcnw",
      "body": "NO. It’s monstrous abuse.",
      "created_utc": 1719068151.0,
      "score": 10
    },
    {
      "id": "l9rjohc",
      "body": "I don't have anyone to talk to. I told his mother she said I'm lying. I'm afraid to tell my family because they think he's so perfect.",
      "created_utc": 1719065495.0,
      "score": 3
    },
    {
      "id": "l9rqhsi",
      "body": "I’m so sorry.\nI’m thankful he’s your ex, but I’m sad you met him in the first place.",
      "created_utc": 1719068206.0,
      "score": 3
    },
    {
      "id": "l9s1qzq",
      "body": "Omg I feel for you. That's horrendous. I'm glad you aren't with him now.",
      "created_utc": 1719072472.0,
      "score": 3
    },
    {
      "id": "l9rl0i7",
      "body": "If you file criminal charges you can also have restitution added for all of the physical damage. (You'll need proof, such as hospital bills and Dr's notes) You need to make sure he can never do this to another woman, especially you. While he is sitting in jail you can serve him the divorce papers as well.",
      "created_utc": 1719066045.0,
      "score": 17
    },
    {
      "id": "l9s2itl",
      "body": "It's OK and understandable to feel sorrow and loss about having lost the ability to get \"naturally\" pregnant, but it does not make you any less of a woman.\n\nA woman who can't bring a pregnancy to term without a miscarriage is not less of a woman.\n\nA woman who can't give birth vaginally is not less of a woman.\n\nA woman who can't breastfeed is not less of a woman.\n\nA woman who can't get pregnant at all and has to adopt is not less of a woman (or less of a mother!)\n\nA woman who chooses never to have children is not less of a woman.\n\nWe all have our own choices, our own problems, our own hurdles. We ARE NOT LESS for what we have to deal with compared to another person. \n\n*You Are Not Less Of A Woman!*",
      "created_utc": 1719072769.0,
      "score": 16
    },
    {
      "id": "l9rq8p3",
      "body": "You’re not “less of a woman” just because you can’t have children the old fashioned way.\nYour womanhood isn’t defined by childbearing.\nYou were abused and maimed by a predator who you trusted.",
      "created_utc": 1719068108.0,
      "score": 8
    },
    {
      "id": "l9r7agm",
      "body": "Proof?",
      "created_utc": 1719059837.0,
      "score": 4
    },
    {
      "id": "l9rfqvs",
      "body": "Got offended and reported my comment? So u have no proof and u report ppl that prove u wrong, avarage straight and anti LGBTQ ppl men 💀u got offended that it's a million times safer for women to be lesbian",
      "created_utc": 1719063825.0,
      "score": 2
    },
    {
      "id": "l9rfwk1",
      "body": "And why u report coments against rapists? Do u love rapists and wanna protect them ? Kinda SUS",
      "created_utc": 1719063895.0,
      "score": 2
    },
    {
      "id": "l9rjwmd",
      "body": "Ok? And this guy is a rapist. What’s your point?",
      "created_utc": 1719065587.0,
      "score": 2
    },
    {
      "id": "l9t3lyl",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to discuss this removal, please contact the moderation team using the [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1719086860.0,
      "score": 1
    },
    {
      "id": "l9r7ljf",
      "body": "It comes like this : Black straight relationship has the highest numbers of domestic violance, followed by Hispanic and White",
      "created_utc": 1719059994.0,
      "score": -2
    },
    {
      "id": "l9t7q43",
      "body": "If you suspect a user is not being genuine, keep it to yourself or report it. This is a support forum.",
      "created_utc": 1719088433.0,
      "score": 1
    },
    {
      "id": "l9rarf3",
      "body": "Well, some couple would do it but talk about it before... ''Can I/you do that?'' ''Yeah, I don't dislike it'' (kind of things). So they consent before \n\nBut here, not only did they not talk about it prior to it, and she said no multiple times. So it's 🍇 and she's hurt. He deserves prison for his actions \n\n\n(I just read multiple posts on Reddit and Quora and some like it but consent prior to the action)",
      "created_utc": 1719061541.0,
      "score": 10
    },
    {
      "id": "l9ribik",
      "body": "I'd tell him I don't want to have sex before I go to sleep. After taking my medicine it puts me to sleep for hours. I don't feel anything.  I just wake up smelling like sex",
      "created_utc": 1719064929.0,
      "score": 10
    },
    {
      "id": "l9ruzc7",
      "body": "I don’t think they were trying to victim blame, just offer helpful insight. \n\nIt’s totally true that consent can be revoked at any time. This IS rape and it is wrong. I think the commenter was just trying to help determine whether there is legal ground to send him to jail.\n\nSome rape is criminal, some is not in the eyes of the law, and some is hard to prove. It’s unfortunate and wrong, but it’s something to consider.",
      "created_utc": 1719069909.0,
      "score": 12
    },
    {
      "id": "l9rs48t",
      "body": "Thank you Moon . I appreciate you taking the time to help me❤️",
      "created_utc": 1719068822.0,
      "score": 24
    },
    {
      "id": "l9rqlzw",
      "body": "I needed this so bad😭😭😭😭😭😭😭😭😭😭❤️ thank you so much.",
      "created_utc": 1719068250.0,
      "score": 41
    },
    {
      "id": "l9ryhd4",
      "body": "Thank you very much🥹❤️",
      "created_utc": 1719071234.0,
      "score": 7
    },
    {
      "id": "l9rot63",
      "body": "Those fools rushed me off the phone.",
      "created_utc": 1719067551.0,
      "score": 3
    },
    {
      "id": "l9t56oh",
      "body": "We filter the word, but I'm going to start filtering the emoji too. We allow discussion of rape, but not details, so we hold all mentions for human review.",
      "created_utc": 1719087465.0,
      "score": 28
    },
    {
      "id": "l9r1exc",
      "body": "[removed]",
      "created_utc": 1719056649.0,
      "score": 17
    },
    {
      "id": "l9sdnef",
      "body": "Omg thank you so much for the resources 😭😭😭😭😭😭 I didn't know their were support groups for women whom suffured from miscarriages.",
      "created_utc": 1719076978.0,
      "score": 21
    },
    {
      "id": "l9s0m4u",
      "body": "1. Are you still with him?\n2. Obviously depends on your family but I'd bet they're better to talk to than his family. My in-laws placed the blame all on me when everything went down as well even though I was on good terms with them before that. \n3. Definitely speak to a therapist. There are also domestic violence hotlines you can call/text to talk to. They can help with some of the practical stuff and get you out.",
      "created_utc": 1719072041.0,
      "score": 4
    },
    {
      "id": "l9rn5jk",
      "body": "Thank you so much😭 I'll do everything each of you said. I'm going to seek help again this Monday. I live in a small town so if I were to say something everyone would know  before I even make it to court.",
      "created_utc": 1719066899.0,
      "score": 10
    },
    {
      "id": "l9sesj9",
      "body": "Ma'am thank you from the bottom of my heart . I appreciate this response. I'm going to frame it.🥰 thank you for not making feel alone.",
      "created_utc": 1719077408.0,
      "score": 8
    },
    {
      "id": "l9ro39x",
      "body": "Do you have any indication that he’s doing this? Apart from the smell because that is a big assumption to make",
      "created_utc": 1719067271.0,
      "score": -25
    },
    {
      "id": "l9s0bri",
      "body": "I wish you luck, hun! You deserve the peace 💕",
      "created_utc": 1719071932.0,
      "score": 12
    },
    {
      "id": "l9s11ja",
      "body": "Try local nonprofits or community health organizations? They will most likely have availability of some kind, or at least they can help with something",
      "created_utc": 1719072204.0,
      "score": 4
    },
    {
      "id": "l9shwcd",
      "body": "There's a TON of subreddits for that. r/miscarriage as well. There's also r/ttcafterloss , r/pregnancyafterloss , r/IVF , r/cautiousbb to name a few. So many women out there going through similar things",
      "created_utc": 1719078571.0,
      "score": 16
    },
    {
      "id": "l9ron07",
      "body": "Are you serious? You do know what sex smells like, right? If I told him no beforehand and woke up with swimmers running down my leg, why wouldn't I know what sex smelled like. We don't have sex because of the scaring on my vagina from my miscarriages.",
      "created_utc": 1719067485.0,
      "score": 16
    },
    {
      "id": "l9rs17p",
      "body": "Victim blaming is neither helpful nor kind. \n\nPlease stop. \n\nhttps://welshwomensaid.org.uk/news/understanding-victim-blaming-and-why-its-harmful-to-survivors/",
      "created_utc": 1719068790.0,
      "score": 14
    },
    {
      "id": "l9s1e8g",
      "body": "On this topic... has he ever admitted to having done it? When you told him to stop, did he agree? Did he apologize?\n\nThe reason I ask is there is a surprisingly common condition ([Sexsomnia](https://www.sleepfoundation.org/parasomnias/sexsomnia)) where people have sex in their sleep... its essentially like sleep walking; the person often has absolutely no memory of it. Their eyes may be open, they may even talk, but their brain is asleep. Some people report the person with sexsomnia may act very differently as well.",
      "created_utc": 1719072338.0,
      "score": 6
    },
    {
      "id": "l9s3xdc",
      "body": "This is straight up rape and not ok. Personally I've been in a similar situation and I know how hard it is to speak up. I just wanted to forget about it and move on. But you are married to this man and he repeatedly does this to you knowing it would be painful if you were awake. Then to cheat on you? I think you should report this. Sue him please.",
      "created_utc": 1719073302.0,
      "score": 2
    },
    {
      "id": "l9rtm5a",
      "body": "That was not victim blaming, it was a request for clarification.  OP seems awfully naive in some areas, and ambient scent isn't exactly a reliable indicator of sex.  \n\nThere is no blame being placed on OP for their husband's actions.",
      "created_utc": 1719069389.0,
      "score": -19
    }
  ]
}