{
  "id": "1hpccqk",
  "title": "I got raped.",
  "selftext": "I (M14) got raped by (F17)\n\nTw drug abuse and rape\n\n\n\n\n\n\nUnfortunately I was raped by a friend and I think it was partly my fault. So to start, I've known this friend for a year and I trust her 100% until she did this. We were both at a house party where we were taking drugs. Unfortunately, I also took something and had to face the consequences of it. When I took it (I won't say which drug) I felt bad, I felt like I was dying, I noticed that something was about to happen (collapse) and that's why I tried with all my might to tell my girlfriend to come with me. Simply that she is there. When we were at the toilet, the last thing that occurred to me was how she locked the door and I fell asleep on the floor. idk what happened. I woke up with her on top of me. In her couch at her home. I didn't have the strength to talk, she just did it. She gave me a bj at the end and then got off me. I wasn't fully conscious but I indicated to her that I didn't really want it. I wanted to cry but no, I packed my things and went home. Im fcked up. I fcked it up. Pls dont take drugs and stay safe guys",
  "created_utc": 1735524537.0,
  "score": 423,
  "num_comments": 144,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1hpccqk/i_got_raped/",
  "comments": [
    {
      "id": "m4oyfum",
      "body": "Reminder: you can tell OP not to take drugs and also not be an unsupportive victim blamer. Some of the comments I have removed are very hurtful and there is no tolerance for this kind of victim blaming here. Think twice about what you say to someone who just experienced a traumatic event. They already feel shame and guilt they will carry for the rest of their lives - they don't need your \"holier than thou\" chastizing as well.",
      "created_utc": 1735653995.0,
      "score": 1
    },
    {
      "id": "m4h5ajy",
      "body": "This is not your fault. Tell a trusted adult what happened, you weren’t able to say yes and she was clearly coherent enough to know what was going on.\n\nAs scary as it may be she needs to be held accountable, she could do this to another person.",
      "created_utc": 1735533851.0,
      "score": 290
    },
    {
      "id": "m4h4qdm",
      "body": "It was NOT your fault AT ALL. Not even a tiny bit. Someone older than you took advantage of you while you were inebriated and that is 1000% on her and 0% on you, regardless of if you took the drug by your own choice. I am so so sorry that this happened to you. Please remember that nothing you did caused this and I wish you so much luck in healing from this ❤️",
      "created_utc": 1735533631.0,
      "score": 70
    },
    {
      "id": "m4h88q8",
      "body": "Already seeing comments going down this abysmal route but yes. Males can get SA'd and raped too and you are a victim. You need to tell a parent, a principal or teacher you trust. This isn't ok, and you need to make it known.",
      "created_utc": 1735535091.0,
      "score": 122
    },
    {
      "id": "m4hcpd2",
      "body": "you're 14 and under the influence; it's not your fault at all :( im really sorry that happened to you.",
      "created_utc": 1735537148.0,
      "score": 23
    },
    {
      "id": "m4h2861",
      "body": "I am so sorry this happened to you. It's wasn't your fault no matter the circumstances, the only cause of rape and sexual assault are rapists and people who choose to assault. You can't handle this alone and dont have to. Please tell a trusted adult!",
      "created_utc": 1735532643.0,
      "score": 13
    },
    {
      "id": "m4h7uj1",
      "body": "It's never ever your fault. Please tell your parents/guardians about this.",
      "created_utc": 1735534923.0,
      "score": 13
    },
    {
      "id": "m4h8jjz",
      "body": "Dude. That's fucked up. Please tell someone in confidence, then, if you still have contact or know someone who does have contact with this girl go to the authorities. I don't know where you live, but in some places, especially for a crime as serious as this she may be tried as an adult. And if anyone says that \"oh you must have liked it\" or some bullshit CUT THEM OUT. Being a man and being sexually assaulted is hard, (not speaking from experience) especially in America. Stay strong, keep fighting. We people on reddit will always be here for you. As someone your age and kind of your gender (M-NB), feel free to ask me for whatever advice you want. I might not be that helpful but I've been to a LOT of therapy. I understand that you may be hesitant and that's ok, only talk if you feel safe.\n\nHere for you, wishing you The best of luck and happiest of futures\n\n\\-Me",
      "created_utc": 1735535223.0,
      "score": 11
    },
    {
      "id": "m4h4cqk",
      "body": "I'm so sorry you had to go through something like this and it wasn't your fault. I'm 14 too and the best thing you could possibly do is tell someone, no matter how scary it is it's gotta come out at some point man.\n Parents, teachers, anyone who can out your safety first and get you help, even if there was drugs involved. \nyour a minor and to be dating a 17 year old (I'm not sure where your located) but I'm pretty sure is illegal and the 17 year old can be charged for just that alone. \nIm just a random stranger on the internet but I'm so sorry this happened to you and it was not your fault, weather you took stuff or not. She was the person who did that not you.\n You should be more aware of what's going into your body and more aware of the side affects and causes as sadly stuff like this is common and stay safe and aware if you are gonna go to parties in the future, it is never a good idea to try random drugs or anything given to you from hand rather than from a reliable source. \nPlease take care of yourself and please stay safe",
      "created_utc": 1735533488.0,
      "score": 20
    },
    {
      "id": "m4hdgc5",
      "body": "First of all it's not your fault your just a kid you should tell them cops or a trusted adult",
      "created_utc": 1735537492.0,
      "score": 6
    },
    {
      "id": "m4hnz9u",
      "body": "It’s not your fault brother \nIf it make you feel any better I got rape 3 time (Am 18)\nDude at 23 \nMy cousin she is 21 \nAnd my mom friend she is 45 \nI didn’t tell anyone but don’t be me.\nTalk to your mom or someone you trust. \nPlease tell someone you trust \nPlease",
      "created_utc": 1735543058.0,
      "score": 7
    },
    {
      "id": "m4hiacm",
      "body": "Am sorry. Me too because I was on a lot of weed in a camera guy's apartment. And he gave me oral I didn't want too. We all need to be safe but it's NOT YOUR FAULT, it is HERS. No one can make one person hurt another. It's easy to ask for permission. It's easy to deny yourself. It's easy to wait. It's not your fault or mine. And I am so sorry. I hope you find trauma informed therapy to help you heal from this eventually. r/Survivors can be a good resource to.",
      "created_utc": 1735539886.0,
      "score": 3
    },
    {
      "id": "m4ifarf",
      "body": "Honestly this needs to be reported to the authorities. Firstly for rape, and secondly for sex with a minor. Even if you had consented to it you’re still underage.",
      "created_utc": 1735560227.0,
      "score": 3
    },
    {
      "id": "m4i7t6l",
      "body": "Find the fucker who did it report them to the cops. \n\nThat shit ain’t ok. 109% NOT YOUR FAULT it happened.",
      "created_utc": 1735555721.0,
      "score": 3
    },
    {
      "id": "m4iruka",
      "body": "First off, you need to get checked for sexually transmitted diseases. Yes, that’s a crappy thing to say but you need to hear the truth - and a bunch of people saying they’re sorry isn’t doing you much good now. Go to a family planning clinic or somewhere else where you feel comfortable and get tested. It will bring you peace of mind. After you knock that obstacle out of the way, you’ll be able to focus intently on healing your mental wounds. For that, I might consider a counselor at one of the aforementioned sites, or… IF you’re comfortable with it then perhaps a religious counselor. Not all religions are the same, so judge that yourself. You basically need someone that will listen - so you’re not carrying this heavy load yourself. It may take some time  - maybe even years to truly heal, but you will heal. As survivors WE are resilient.\n\nUnintended things can happen when one loses self control due to drugs - this includes being taken advantage of by someone you know. I know this from personal experiences as a young adult. The flippant attitude towards drugs is partly to blame. Fortunately, you’re still alive and can walk away from this experience - unlike someone that got into a car accident and killed an innocent bystander, for example. \n\nYou might say WTF, but seriously go and start a physical fitness hobby like walking or running. As your stamina improves you will feel a sense of accomplishment. This can be therapeutic in so many ways.",
      "created_utc": 1735566256.0,
      "score": 3
    },
    {
      "id": "m4ggjtm",
      "body": "**Hello u/!** \n\nThank you for tagging this post with a content warning! This helps greatly!\nIt can prevent other users from potentially getting triggered and it gives us the chance to provide you with some resources regarding this topic.\nGood to know is that using this flair automatically marks your post as NSFW.\n\n*Your post may not show up directly on our subreddit, please be patient, it is most likely in queue to be manually reviewed by our team.*\n\n\n---\n**Here are some resources:**\n\n* Rainn.org provides information on [the types of sexual violence](https://rainn.org/types-sexual-violence), [what to do after](https://rainn.org/after-sexual-assault) and the [effects](https://rainn.org/effects-sexual-violence) it can have.\n* Here are some helpguides if you are [recovering from sexual trauma](https://www.helpguide.org/articles/ptsd-trauma/recovering-from-rape-and-sexual-trauma.htm), this one is available in [multiple languages](https://survivorsnetwork.org.uk/resource/survivors-self-help-guide/).\n* If you want to talk to a professional, on [this website](https://findahelpline.com/i/iasp) you can find helplines for your country.\n* Some other good subreddits that check out are: r/rape and r/sexualassault. These are safe communities with good resources listed. \n* We also want to provide you with some information on how to [support survivors](http://www.tstresources.org/supporting-survivors/), in case you are looking for help for a [loved one](https://www.rainn.org/TALK).\n\n      \n---\n\n        \n**Take care and stay safe!**  \n\n*If you see any inappropriate comments, please report them and we will deal with them accordingly.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1735524538.0,
      "score": 2
    },
    {
      "id": "m4hjh2c",
      "body": "No, you don’t deserve it. Your choices do not mean you deserve to have bad things to happen to you. You are a victim. Please reach out to a professional. Your school counselor is a good option if you don’t have an adult you can trust.",
      "created_utc": 1735540513.0,
      "score": 2
    },
    {
      "id": "m4hvrhs",
      "body": "[removed]",
      "created_utc": 1735547916.0,
      "score": 2
    },
    {
      "id": "m4hxrfp",
      "body": "I’m so sorry this happened to you man. This was not your fault. Taking drugs has bad outcomes yes but doesn’t mean you should be subjected to rape. I see your comments about not being able to go to someone about it but hope you can have a therapist or atleast one trusted person to just talk about it with in person.",
      "created_utc": 1735549218.0,
      "score": 2
    },
    {
      "id": "m4i291f",
      "body": "I’m so sorry! Is there an adult who can support you! Lots of love and hugs to you Op. always rem - you didn’t do it, it is not your fault. Ok?",
      "created_utc": 1735552163.0,
      "score": 2
    },
    {
      "id": "m4icidb",
      "body": "I'm so sorry this happened to you. Please don't allow this one dark moment to ruin your life, I had something similar happen when I was younger and I felt all the things you are feeling but all it did was make me bitter and hateful on the outside and smothered/overburdened/out of control on the inside but I realised one morning that I have the power to let this rule me or build me and I chose to let it build me. I'm now open to talk about it with people I trust and I actively encourage victims to talk if they can when they're ready because although it won't feel like much, a story shared is definitely a story halfed in weight.\nSending love and positivity your way friend! \nAll the best.",
      "created_utc": 1735558609.0,
      "score": 2
    },
    {
      "id": "m4iguxk",
      "body": "It's not your fault!!!",
      "created_utc": 1735561076.0,
      "score": 2
    },
    {
      "id": "m4iiy5r",
      "body": "It’s definitely NOT your fault.  This is I believe no consent under incapacitation. \n\nIncapacitation is defined as a state in which individuals are unable to make rational, reasonable decisions because they lack the capacity to understand the “who, what, when, where, why, or how” of a situation or interaction. Individuals cannot give sexual consent if they can’t understand what is happening, or if they are disoriented, helpless, asleep, or unconscious for any reasons. That applies even if it is because they voluntarily consumed alcohol or drugs. Unless consent is “knowing,” it is not valid.\n\nThose engaging in sexual activity who know or should have known that the other party is incapacitated are engaging in sexual misconduct.  \nPlease tell somebody so she doesn’t do this to anyone else. Red Reddit",
      "created_utc": 1735562167.0,
      "score": 2
    },
    {
      "id": "m4jsylh",
      "body": "If you were SA never blame yourself for anything that you felt you were forced to do. Anyone can do that to anyone regardless of gender or identity, I’m so sorry friend I hope you’re ok and know that you are very strong to talk about this. Best wishes \nVI",
      "created_utc": 1735578959.0,
      "score": 2
    },
    {
      "id": "m4ki43p",
      "body": "Comrade, it is definitely not your fault. And you should cut ties with her. I would suggest you tell the police but since you did illegal substances, that is not the best idea.",
      "created_utc": 1735586658.0,
      "score": 2
    },
    {
      "id": "m4llarz",
      "body": "Book a good psychologist asap, trauma cannot wait. Recovery is arduous but not impossible.",
      "created_utc": 1735598789.0,
      "score": 2
    },
    {
      "id": "m4hf3z2",
      "body": "I'm so sorry this happened. The feeling is not pleasant and it just destroys and ruins you. I'm deeply sorry about what you have gone through...",
      "created_utc": 1735538291.0,
      "score": 1
    },
    {
      "id": "m4hfo1i",
      "body": "I’m sorry that happened to u..",
      "created_utc": 1735538569.0,
      "score": 1
    },
    {
      "id": "m4inq2s",
      "body": "It wasn't your fault. Please tell someone you trust.",
      "created_utc": 1735564460.0,
      "score": 1
    },
    {
      "id": "m4izsr3",
      "body": "sending all of the luck to u..its not your fault, stay safe <3",
      "created_utc": 1735569400.0,
      "score": 1
    },
    {
      "id": "m4jfath",
      "body": "I’m so sorry you had to go through this. What happened is not your fault, and you’re incredibly brave for speaking up about it. It’s really important to find someone you trust, whether it’s a parent, teacher, or counselor, to talk to about this. There are also professionals and organizations that specialize in supporting survivors. You don’t have to go through this on your own.",
      "created_utc": 1735574697.0,
      "score": 1
    },
    {
      "id": "m4jtteq",
      "body": "Ugh such a bad situation. I would tell your parents if your trust them and ask them to help you get therapy. Unfortunately I don't suspect there will be any repercussions for her since she a female and not only does this happen less often it's very stigmatised. Not to mention she's still very young as well.\n\n\nHang in there, I know all these comments sound empty coming from strangers but that doesn't mean they don't care and if you reach out to others who have experienced something similar you will find support. \n\n\nWish I could say something more helpful but the reality just sucks. Nothing anyone can say will change that unfortunately.",
      "created_utc": 1735579234.0,
      "score": 1
    },
    {
      "id": "m4k2ycj",
      "body": "I'm 16F, i got sexually assaulted when i was 14 by my at the time boyfriend, so i went through something similar as you, so if you want to talk, feel free to DM me\n\nYou are responsible for taking the drugs.\nNothing else.\nNot what anyone does while you're unconcious.\nNo sane person will see an unconcious person, get turned on, and instead of calling for help (because if someone under the influence of drugs becomes unconcious, others around them *should* call for help) choose to rape them\nThat girl took advantage of you being unconcious. She raped you. It is 100% her fault for choosing to assault you. Because if you cant consent, it is assault, it is rape.\nIf you have the means to, get therapy.",
      "created_utc": 1735582020.0,
      "score": 1
    },
    {
      "id": "m4k4c5q",
      "body": "Please don’t blame yourself! I am 25 y/o and lived with being assaulted for years no one believed me and I blamed myself . Was SA by my uncle someone I trusted . Please know it’s not your fault and please take the proper steps to heal from this. Sending love ! She needs to be held accountable!! She is a monster for this , rather or not if you were sober or intoxicated she took advantage of you",
      "created_utc": 1735582448.0,
      "score": 1
    },
    {
      "id": "m4kdpt6",
      "body": "I’m so sorry, OP. Realize a few things: 1. This was not your fault, drugs or no drugs. You didn’t consent. You’re a victim here. 2. Physical response isn’t consent. Your body may have responded to stimuli but it means nothing in the broader picture. You were still r-ped. 3. Men can and do get r-ped by women. Many will try to tell you otherwise. I don’t know how the laws or police work in your country. I would recommend pressing charges but at the very least I hope you can get counseling from someone trustworthy who won’t write your experience off.\n\nHoping the best for you.",
      "created_utc": 1735585301.0,
      "score": 1
    },
    {
      "id": "m4kttxy",
      "body": "and this why having severe trust issues is mostly useful, especially as a muslim living in the west, things can go crazy asf in there, and in the end some feminist motherfuckers say the infamous \"mens are the problem\", man, i am having flashbacks of some similar experience happened to me when i was 8 or 7",
      "created_utc": 1735590254.0,
      "score": 1
    },
    {
      "id": "m4ky1uz",
      "body": "Gg",
      "created_utc": 1735591542.0,
      "score": 1
    },
    {
      "id": "m4l69f8",
      "body": "She should never have taken advantage of you, no matter if you take drugs or not. I'm sorry to hear this happened to you. I hope you have a good support network around you (parents, other family and friends).",
      "created_utc": 1735594038.0,
      "score": 1
    },
    {
      "id": "m4luejc",
      "body": "That's actually so horrible, please reach out and tell someone in real life, I hope you heal and never experience it again.",
      "created_utc": 1735601877.0,
      "score": 1
    },
    {
      "id": "m4mg7om",
      "body": "I made a comment already but I also just want to add if anyone ever feeds you the line \"well you were hard\" or \"well you came\" don't listen to them and stay far the hell away from people who think like that! Biology is gonna do what biology does, that does not make it assault any less!",
      "created_utc": 1735609373.0,
      "score": 1
    },
    {
      "id": "m4mr1g4",
      "body": "I'm so sorry that she did that to you. \n\nIf you ever wanna talk, I'm here",
      "created_utc": 1735613194.0,
      "score": 1
    },
    {
      "id": "m4n4nmr",
      "body": "Man, I’m really sorry that happened to you. I really suggest telling a trusted adult, that person needs to be held accountable for their actions. All luck to you, man.",
      "created_utc": 1735618220.0,
      "score": 1
    },
    {
      "id": "m4ngc4i",
      "body": "Sorry to hear that. It's not your fault. No one has to suffer through this shit.",
      "created_utc": 1735623258.0,
      "score": 1
    },
    {
      "id": "m4njkya",
      "body": "It was not your fault at all. Rape is always 100% the fault of the perpetrator, you didn't mess up. I'm so sorry this happened. Agree with the comments saying to tell a trusted adult who can support you, and take care of your mental health at this time. Wishing you the best.\n\n\nP.S, some of the comments here are cruel and very likely not coming from people with a lot of actual life experience, don't listen to them.",
      "created_utc": 1735624875.0,
      "score": 1
    },
    {
      "id": "m4nper7",
      "body": "Listen to everyone telling you it’s not your fault. I would also try to find some way to go to therapy (by either telling your parents or something) because that is traumatic and you deserve to have someone help you process it.",
      "created_utc": 1735628045.0,
      "score": 1
    },
    {
      "id": "m4nysjv",
      "body": "Rape is never ok male or female is report them",
      "created_utc": 1735633871.0,
      "score": 1
    },
    {
      "id": "m4q6svy",
      "body": "(Very sorry if this is bad English isn’t my first language)\n\nThis type of stuff always enrages me. It is not your fault no matter what. You took a substance with somebody you trusted and they took advantage of that. I saw how you can’t report her due to how your county is and I am honestly so sorry about that. Please try to talk to somebody about it if you can, but please understand it was not your fault at all. I really hope you can get better and please remember to take care of yourself. And for people who don’t know,\nNo is not consent\nA high yes is not consent\nA drunk yes is not consent\nSleeping is not consent\nSilence is not consent\nNot being sure is not consent\nI’m very proud of you for telling your story OP and I really hope you can recover fully and have the best life you can.",
      "created_utc": 1735668731.0,
      "score": 1
    },
    {
      "id": "m4ujn7s",
      "body": "This is terrible. I am so sorry OP, it's not your fault. If she talked you into it, it is still coercion and rape or a minor who at the time couldn't have consented even if they were an adult. You don't deserve this. Please get help. Please talk to someone irl before this type of things fills you and becomes too much.",
      "created_utc": 1735739893.0,
      "score": 1
    },
    {
      "id": "m50rk03",
      "body": "Take drugs when you’re older, and with more caution. But I hope you’re doing okay. Hopefully there’s some people in your life you can talk to.",
      "created_utc": 1735832146.0,
      "score": 1
    },
    {
      "id": "m5sgpzc",
      "body": "ITS NEVER EVER EVER EVER YOUR FAULT",
      "created_utc": 1736209506.0,
      "score": 1
    },
    {
      "id": "m4h6op3",
      "body": "[removed]",
      "created_utc": 1735534428.0,
      "score": 0
    },
    {
      "id": "m4km9sw",
      "body": "🤦🏿‍♂️",
      "created_utc": 1735587938.0,
      "score": 0
    },
    {
      "id": "m4jcrbp",
      "body": "hang on di you just say you did it again after that first time?",
      "created_utc": 1735573875.0,
      "score": 0
    },
    {
      "id": "m4kdl50",
      "body": "[removed]",
      "created_utc": 1735585262.0,
      "score": 0
    },
    {
      "id": "m4h92pj",
      "body": "[removed]",
      "created_utc": 1735535458.0,
      "score": -24
    },
    {
      "id": "m4v07pz",
      "body": "a man cannot be raped.  he can control his erections if he wants too.  ",
      "created_utc": 1735746692.0,
      "score": -1
    },
    {
      "id": "m4jdx8r",
      "body": "[removed]",
      "created_utc": 1735574251.0,
      "score": -4
    },
    {
      "id": "m4iw5w5",
      "body": "[removed]",
      "created_utc": 1735568010.0,
      "score": -8
    },
    {
      "id": "m4j58z7",
      "body": "[removed]",
      "created_utc": 1735571364.0,
      "score": -8
    },
    {
      "id": "m4hap4p",
      "body": "I don’t know if police can do anything about this as a woman can only legally be convicted of rape if there’s anal penetration involved. But I’m deeply sorry you had to go through that. You need to stay away from her and tell a loved one about what happened. For real. Don’t blame yourself too much. There’s only so much you can do before someone else takes advantage of that vulnerability and makes you feel terrible afterward. \n\nDon’t blame the drugs, blame her. You were only looking for escape and found a nightmare because of that bitch.",
      "created_utc": 1735536196.0,
      "score": -11
    },
    {
      "id": "m4hb10z",
      "body": "[removed]",
      "created_utc": 1735536353.0,
      "score": -35
    },
    {
      "id": "m4hfbg0",
      "body": "Yes, I know, but in my country it is very difficult with rape. There are cases in my country where mass rapists have been released. and my parents would find out about it, a very difficult situation\n\nTy for your text\nWish you the best",
      "created_utc": 1735538395.0,
      "score": 84
    },
    {
      "id": "m4j9lnu",
      "body": "This! It's not your fault. She took advantage of the situation and didn't respect you at all. I absolutely recommend talking to a trusted adult, and at least go to a school nurse/counselor(or even a school psychologist if you have one in your school) to talk about what happened. I know how it feels: scary, confusing, burdening and embarrasing, but talking about it helps with dealing the trauma. School personnel can help redirect you to your possibilities in terms of police, therapy etc. \n\nMy heart is with you, and I hope you'll have the courage to reach help❤️ Even if substances seem like something to help the pain, I recommend not self medicating with anything. I went down that path and it wasn't good. It wasn't your fault. Even if you were high, it wasn't your fault. And I don't have a say in your relationships, but take this as advice from a big sister(and a fellow rape victim who got raped when intoxicated): break up with her. She doesn't respect you. And you truly can't trust her. Break up will sting like hell, but it will be so much better for your health not to be in contact with her. \n\n❤️❤️‍🩹",
      "created_utc": 1735572837.0,
      "score": 1
    },
    {
      "id": "m4h5xtu",
      "body": "Unfortunately, she talked me into it afterwards like its hard very but ty",
      "created_utc": 1735534116.0,
      "score": 21
    },
    {
      "id": "m4hhmtn",
      "body": "Your right i try to thank you",
      "created_utc": 1735539554.0,
      "score": 27
    },
    {
      "id": "m4hi009",
      "body": "Thann you i appreciate",
      "created_utc": 1735539742.0,
      "score": 5
    },
    {
      "id": "m4hhju0",
      "body": "I rlly try to thank you",
      "created_utc": 1735539511.0,
      "score": 5
    },
    {
      "id": "m4hgj1g",
      "body": "Hey thank\nshe talked me into it afterwards that it was okay and sum. But yk in my country the penalty for something like that is horrible bad. Like massrapists gets realeased cause he wasn't aware of what he was doing.\nWish you the best",
      "created_utc": 1735538992.0,
      "score": 5
    },
    {
      "id": "m4h5b2u",
      "body": "Ty for your text. Im trying rlly but its hard very hard. Stay safe bro",
      "created_utc": 1735533856.0,
      "score": 11
    },
    {
      "id": "m4hhgge",
      "body": "I try to ty",
      "created_utc": 1735539465.0,
      "score": 3
    },
    {
      "id": "m4jmev7",
      "body": "Sad to hear that, im trying too\nWish you the best",
      "created_utc": 1735576947.0,
      "score": 1
    },
    {
      "id": "m4hj0y7",
      "body": "Im sry for what happend to you. \nI took psychedelic unfortunately\n she talked me into it afterwards that it was okay and that fcked me up even more.\nTy for your information \nStay safe!",
      "created_utc": 1735540271.0,
      "score": 2
    },
    {
      "id": "m4jzakb",
      "body": "Its a friend tbh reporting is a bit difficulty",
      "created_utc": 1735580911.0,
      "score": 1
    },
    {
      "id": "m4k0b0t",
      "body": "Hey dude ty  im planning to  go to my sister like in a few days i dont want to ruin new years day and yea.\nI think she could help me and she doesent gonna say anything to my parents.  \nThank you for your information\nWish you the best",
      "created_utc": 1735581215.0,
      "score": 3
    },
    {
      "id": "m4v5gwy",
      "body": "I try to thank you",
      "created_utc": 1735748578.0,
      "score": 1
    },
    {
      "id": "m4jn4p4",
      "body": "Thank you, \nI try  to believe that this isnt my fault really but its hard very\nWish you the best",
      "created_utc": 1735577168.0,
      "score": 1
    },
    {
      "id": "m4v5pwx",
      "body": "Thank you i try to talk with the school councelor,\nWish you the best",
      "created_utc": 1735748666.0,
      "score": 1
    },
    {
      "id": "m4v5y4n",
      "body": "Sad to hear that you expierenced that type of shi to.\nThank you !",
      "created_utc": 1735748745.0,
      "score": 2
    },
    {
      "id": "m4jw1qe",
      "body": "Hey thank you for your information.\nYes im def trying to \nWish you the best",
      "created_utc": 1735579923.0,
      "score": 2
    },
    {
      "id": "m4jv9e6",
      "body": "Thank you for the words\nWish you the best",
      "created_utc": 1735579682.0,
      "score": 1
    },
    {
      "id": "m4kqod4",
      "body": "Ty,\nYea complicated situation",
      "created_utc": 1735589290.0,
      "score": 1
    },
    {
      "id": "m4hfkew",
      "body": "Ye it does... ty",
      "created_utc": 1735538518.0,
      "score": 2
    },
    {
      "id": "m4hftml",
      "body": "Thank you",
      "created_utc": 1735538649.0,
      "score": 1
    },
    {
      "id": "m4jqia8",
      "body": "Ty.🫶",
      "created_utc": 1735578203.0,
      "score": 1
    },
    {
      "id": "m4jp7se",
      "body": "Thank you wish you the best!",
      "created_utc": 1735577806.0,
      "score": 2
    },
    {
      "id": "m4jut5n",
      "body": "Yes i know,\nThank you wish you the best",
      "created_utc": 1735579542.0,
      "score": 1
    },
    {
      "id": "m4v6dgy",
      "body": "Hey thank you for your offer, sad to hear that you was SA, i hope you overcome it. \nI try to get help but it needs a bit time.\nWish you the best!",
      "created_utc": 1735748892.0,
      "score": 1
    },
    {
      "id": "m4ks6zt",
      "body": "Hey, sad to hear that you had experience SA i hope you overcome it.\nShe somehow convinced me that it was my fault. \nunfortunately.\nThank you\nWish you the best",
      "created_utc": 1735589754.0,
      "score": 2
    },
    {
      "id": "m4l83jv",
      "body": "Hey bro im sorry for what happend to you,\nPeople who say something like that are just sick of being welcome in Europe",
      "created_utc": 1735594605.0,
      "score": 1
    },
    {
      "id": "m4h6ttk",
      "body": "Tf",
      "created_utc": 1735534488.0,
      "score": 3
    },
    {
      "id": "m4jq4oi",
      "body": "Nah i didnt",
      "created_utc": 1735578086.0,
      "score": 2
    },
    {
      "id": "m4kqidy",
      "body": "Your right lol",
      "created_utc": 1735589238.0,
      "score": 1
    },
    {
      "id": "m4m3vmx",
      "body": "Nah this ain't supportive at all.",
      "created_utc": 1735605117.0,
      "score": 1
    },
    {
      "id": "m4hbr9q",
      "body": "Doesn't matter. Drugs or not no one should be raped or taken advantage of.",
      "created_utc": 1735536697.0,
      "score": 14
    },
    {
      "id": "m4hb9kl",
      "body": "Whoa, teenagers doing drugs? In America?! Never heard of that before.",
      "created_utc": 1735536465.0,
      "score": 6
    },
    {
      "id": "m4v341f",
      "body": "He cant.",
      "created_utc": 1735747737.0,
      "score": 1
    },
    {
      "id": "m4v3p4h",
      "body": "Whats are your arguments on how a men cannot get raped?",
      "created_utc": 1735747945.0,
      "score": 1
    },
    {
      "id": "m4jolss",
      "body": "Hey,\nshe talked me into this shi afterwards like on phone .  \nI can say that it was a psychedelic but i mixed.\ni thought it would be a gread high but absolutly fcking no.",
      "created_utc": 1735577619.0,
      "score": 3
    },
    {
      "id": "m4jwa51",
      "body": "WTF",
      "created_utc": 1735579995.0,
      "score": 3
    },
    {
      "id": "m4iz21o",
      "body": "Dude!",
      "created_utc": 1735569119.0,
      "score": 1
    },
    {
      "id": "m4jqs2c",
      "body": "What 😭",
      "created_utc": 1735578287.0,
      "score": 2
    },
    {
      "id": "m4hegy8",
      "body": "Ty im trying \nWish you the best",
      "created_utc": 1735537977.0,
      "score": 1
    },
    {
      "id": "m4hd40q",
      "body": "Mf should I shout it around me in the neighborhood? and ofc it wasn't yesterday lol. i posted it on more subs bcs that more people see them alr? should I post this shi on my main so that all my friends can see that? Uffff",
      "created_utc": 1735537334.0,
      "score": 13
    },
    {
      "id": "m4v4xq8",
      "body": "Sad to hear that you experienced rape too\nI try to say it to an school  counselor after the holidays. Thank you\nWhish you the best 🫶",
      "created_utc": 1735748388.0,
      "score": 2
    },
    {
      "id": "m4mfg2a",
      "body": "That's called coercion, which is still rape, just not the stereotypical kind that people usually think of. It's not always someone kicking screaming saying no. Physical force isn't always used. But in this case it sounds like you were both coerced and physically forced as you were literally unconscious. Either way you need to know that this happening to you is absolutely in no way your fault. I am terribly sorry someone did this to you, sadly it's usually people we know and trust.",
      "created_utc": 1735609108.0,
      "score": 3
    },
    {
      "id": "m4khjjp",
      "body": "Always trust your parents, but I’d consult a counselor first. They legally can’t blow up on you like your parents can, and they can help you approach your parents. We all make mistakes, this one I will admit was a pretty bad one, but you’re alive to learn from it. Btw, I’m also a M14, so I gotchu.",
      "created_utc": 1735586481.0,
      "score": 4
    },
    {
      "id": "m4w004d",
      "body": "Damn. Just straight damn. Sexually assaulting someone and then gaslighting them into thinking its normal is, in my opinion, one of the worst things you can do. Also, the law about rapists where you live is fucked up. Prison is supposed to be about rehabilitation and if you can do something so terrible and think its OK, what can you do when you know your in the wrong. I know you're young, but once you are an adult, GTFO. Just don't go to America. Really hope that you can use what she said as testament to clarify that she did, in fact, know what she did. I don't know what she said but, if she said something like; \"Its ok, you enjoyed it\" or some bs like that then that may be used to clarify that she did intend to SA you.",
      "created_utc": 1735758569.0,
      "score": 2
    },
    {
      "id": "m4h64ho",
      "body": "Sometimes you just gotta keep on trying, things get better eventually, if you want someone to vent or talk to I'm here if you want bro",
      "created_utc": 1735534193.0,
      "score": 5
    },
    {
      "id": "m4hk826",
      "body": "I hope you get the justice you deserve",
      "created_utc": 1735540920.0,
      "score": 2
    },
    {
      "id": "m4hjbqa",
      "body": "Oh yeah our perpetrators love to gaslight but it's ultimately never ok??? She didn't even ask you!!!! Drugs make people so vulnerable so they are really dangerous. You are not fucked up. You are just a kid and all gets mess up and get into dangerous situations. But you will heal. But I am sorry. She is dangerous, you should cut her out because these people just do it again and again if not.",
      "created_utc": 1735540433.0,
      "score": 1
    },
    {
      "id": "m4m1o4b",
      "body": "Who gives a fuck, if they were your friend they wouldn’t have done that to you. Go to the cops.",
      "created_utc": 1735604368.0,
      "score": 2
    },
    {
      "id": "m4k3l6w",
      "body": "Wishing you all the best.",
      "created_utc": 1735582216.0,
      "score": 1
    },
    {
      "id": "m4m46uo",
      "body": "Ignore that user. You did nothing wrong. Experimenting does not equal getting abused by anyone. (I reported that user, please do the same) Please tell your family and friends and the authorities. You'll get help and support that you need.",
      "created_utc": 1735605221.0,
      "score": 1
    },
    {
      "id": "m4mxucj",
      "body": "[removed]",
      "created_utc": 1735615673.0,
      "score": 0
    },
    {
      "id": "m4hbzu8",
      "body": "[removed]",
      "created_utc": 1735536811.0,
      "score": -9
    },
    {
      "id": "m4kt37x",
      "body": "welcome to reddit",
      "created_utc": 1735590026.0,
      "score": 0
    },
    {
      "id": "m4hf9h9",
      "body": "[removed]",
      "created_utc": 1735538368.0,
      "score": -29
    },
    {
      "id": "m55kj1j",
      "body": "❤️‍🩹 if it's too hard to say it out loud, you can always write what you want to say on paper and give it to a counselor :) Sometimes the words just don't seem to come out and writing it down can be easier",
      "created_utc": 1735893292.0,
      "score": 1
    },
    {
      "id": "m4v57t0",
      "body": "Thank you for your information🫶\nWish you the best",
      "created_utc": 1735748488.0,
      "score": 1
    },
    {
      "id": "m4kqteg",
      "body": "Thank you bro!",
      "created_utc": 1735589333.0,
      "score": 1
    },
    {
      "id": "m4x7oaf",
      "body": "Yea i try to my country is falling apart to lol.\nShe said like\" i saw you liked it dont make such a big deal of it😂\"  it fcked my up and still do.",
      "created_utc": 1735772684.0,
      "score": 1
    },
    {
      "id": "m4h6x91",
      "body": "Tyy",
      "created_utc": 1735534527.0,
      "score": 4
    },
    {
      "id": "m4hm2pf",
      "body": "Thank you",
      "created_utc": 1735541948.0,
      "score": 2
    },
    {
      "id": "m4hn616",
      "body": "Thank you, She knew what she had done, she even wrote to me afterwards.\nI try to cut her out but it's hard because we have the same circle of friends",
      "created_utc": 1735542578.0,
      "score": 1
    },
    {
      "id": "m4kbixg",
      "body": "Thank you",
      "created_utc": 1735584639.0,
      "score": 2
    },
    {
      "id": "m4nmq3c",
      "body": "[deleted]",
      "created_utc": 1735626540.0,
      "score": 1
    },
    {
      "id": "m4o67b5",
      "body": "We do not victim blame. Period. You cannot justify someone being SA.",
      "created_utc": 1735638812.0,
      "score": 1
    },
    {
      "id": "m4hcmfi",
      "body": "Where in my comment did I ever allude to me \"wondering why bad things are happening\" lol. If you can't tell that I'm being sarcastic, you're tone-deaf beyond belief.",
      "created_utc": 1735537111.0,
      "score": -2
    },
    {
      "id": "m4hfij5",
      "body": "do several (; LIKE MF I WOULD DO IT IF IT WAS EASYYY",
      "created_utc": 1735538492.0,
      "score": 6
    },
    {
      "id": "m4m51ps",
      "body": "Bro youre lost bc thats exactly what this sub, and many others, was invented for. Can't handle it then hop off to another sub. Sorry you got triggered.",
      "created_utc": 1735605514.0,
      "score": 1
    },
    {
      "id": "m77bqe3",
      "body": "Yeah man. If you’re ever needing someone to talk to that is unaware of who you are and is completely unbiased, just DM me. Peer pressure is so often downplayed, and they make the victim look like the one who is at fault. Drugs are enticing, I know. I’ve never done them because I have my reasons, but I’ve been tempted many many times. I understand. We are human bro. Just do me a solid: don’t hang with that friend group anymore. They aren’t good for you.",
      "created_utc": 1736905942.0,
      "score": 1
    },
    {
      "id": "m4ynv03",
      "body": "Now, I can't speak for you but if I was getting sexually assaulted I would  act like I enjoyed it so it would end faster.",
      "created_utc": 1735792569.0,
      "score": 1
    },
    {
      "id": "m4qaiwu",
      "body": "[removed]",
      "created_utc": 1735669896.0,
      "score": 1
    },
    {
      "id": "m4hcwsn",
      "body": "[removed]",
      "created_utc": 1735537243.0,
      "score": -1
    },
    {
      "id": "m4m5ne8",
      "body": "[removed]",
      "created_utc": 1735605718.0,
      "score": -1
    },
    {
      "id": "m4qci2w",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1735670518.0,
      "score": 1
    },
    {
      "id": "m4hfsqj",
      "body": "Lmao",
      "created_utc": 1735538636.0,
      "score": 2
    },
    {
      "id": "m4heq0g",
      "body": "The /s is stupid lol. There's an entire sub dedicated to shitting on the /s.",
      "created_utc": 1735538099.0,
      "score": -6
    },
    {
      "id": "m4p6jl1",
      "body": "Mf your crazy. Lol should i record it  next time that you believe me?\nIf it was a dream i wouldnt post it to get help or?",
      "created_utc": 1735657078.0,
      "score": 1
    },
    {
      "id": "m51gz43",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1735840049.0,
      "score": 1
    }
  ]
}