{
  "id": "1k9ucgv",
  "title": "Dont have kids",
  "selftext": "I basically resent my 2 kids and think of them as nothing but parasites that stole everything from me.\n\nWhen does this nightmare become rewarding? When does it get better?\nTf is the point of this shit?\nI get berated by anyone i bring it up with and nobody actually helps even when I reach out\nI didnt sign up for this\n\nI just wanna have a beer with the boys, all i do is work and sleep...\n\n",
  "created_utc": 1745843396.0,
  "score": 1372,
  "num_comments": 317,
  "url": "https://i.redd.it/ied298erkkxe1.png",
  "comments": [
    {
      "id": "mpklqig",
      "body": "Alright y'all. I'm locking this because it's really gone haywire. Be nice.",
      "created_utc": 1745884104.0,
      "score": 1
    },
    {
      "id": "mphfte4",
      "body": "Get yourself the snip if you don’t want to accidentally have a third one popping out.",
      "created_utc": 1745848883.0,
      "score": 116
    },
    {
      "id": "mphbd2r",
      "body": "You need therapy… please. For yourself and your children’s sake. They don’t deserve to feel like mistakes or burdens. That will truly fuck them up for life. If you can’t give them the emotional support they deserve, maybe they should be adopted.",
      "created_utc": 1745847399.0,
      "score": 979
    },
    {
      "id": "mphlzcq",
      "body": "Did you just say you “didn’t sign up for this”??? Quite literally you did. And if you treat your kids even remotely the way you are talking, they are going to have even worse mental health than you as they grow up. There’s a reason no one is resonating with you on that. The KIDS did not sign up for this.",
      "created_utc": 1745850846.0,
      "score": 114
    },
    {
      "id": "mphkdm0",
      "body": "OP, there is a lot here, but first things first :\n\n1 - you need to come up to terms with the fact that **you also wanted those kids. At least the second one.** The first - eh, might have been an accident - the second is not. You could have separated years ago, you chose not to. You could have had the snip, you chose not to. You could have stopped having sex, you chose not to. These are your doing, not your wife's, not your kids, yours.\n\n2 - **they did not choose to be here**. The 9y-old knows you hate him. Believe me, he knows. You need to start planning accordingly to protect them from that hate, from that resentment.\n\n3 - which is why you need to **get away**. Go to your parents, make up a work trip or something, pay for a sitter and get yourself a couple of days to make a decision.\n\n* Obviously, get a vasectomy, that's the first thing to do beside seeing a therapist which you already do.\n* Separate. Be the bad guy. I am sorry, but it's better to be the guy that initiated divorce and refused custody than to keep this up. Resentment leads to hate, hate leads to violence. Your kids are kids and deserve a house with a loving parent, even if it's a single one. Calling them parasites that stole everything from you is already violent and no kid deserve a violent parent.\n\n4 - When all of this is said and done, might be good for you to get to a facility or some sort of rehab. I am not sure you realize that you are aging and that even with no kids, you might not get a beer with the boys or your younger ways.",
      "created_utc": 1745850347.0,
      "score": 247
    },
    {
      "id": "mphbzi7",
      "body": "why did you have them",
      "created_utc": 1745847615.0,
      "score": 74
    },
    {
      "id": "mphbtlp",
      "body": "You have 2 kids, 9 yo and 6 month old, why did you let it happen a second time if you already hated the first kid? I'm sorry but, surgery, protection, or just not having sex with your partner anymore.\n\nI'm sorry for your situation, why not get a divorce? Your 9yo no doubt senses that you hate them...and that's not healthy.",
      "created_utc": 1745847559.0,
      "score": 450
    },
    {
      "id": "mphitsp",
      "body": "Kids are parasites that stole everything from you. Like they asked you to make them? Like you didn’t choose to make them yourself?\n\nI feel horrible for your kids. Please give them to family who loves them and move on with your life.",
      "created_utc": 1745849853.0,
      "score": 167
    },
    {
      "id": "mphoy2y",
      "body": "You need to get away from those kids. For everybody’s sake. Get out. Just leave. Own up to your bullshit. Your kids will sense that you don’t like them anyway, so you might as well not make every day awful for them.",
      "created_utc": 1745851757.0,
      "score": 48
    },
    {
      "id": "mpijuis",
      "body": "Posts like this should remind us all why abortion rights are so important.",
      "created_utc": 1745860938.0,
      "score": 22
    },
    {
      "id": "mphqh07",
      "body": "Get a vasectomy. Please.",
      "created_utc": 1745852226.0,
      "score": 36
    },
    {
      "id": "mpi178u",
      "body": "\"I didn't sign up for this\" - well....You did, twice because ya know sex.... \n\nYour children are the ones who didn't sign up for this. They didn't ask to born. So please don't have resentment. They will feel and see that resentment and affect their mental health.\n\nAlso, it's perfectly normal to feel tired and overwhelmed because of children. They are hard work. Perhaps talk to your friends and family for an extra hand or even a childminder. Once a week for 1 day could be good break for your and your wife?",
      "created_utc": 1745855447.0,
      "score": 60
    },
    {
      "id": "mphrofs",
      "body": "As a kid whose parents felt this way about her, this is awful. I’m sorry you feel this way but understand that your kids can tell and they also don’t deserve to have resentful parents. They’re young, innocent, and did not ask to be brought into this world only to be resented. \n\nI think you should seek therapy and I hope things get better for you and your family.",
      "created_utc": 1745852595.0,
      "score": 15
    },
    {
      "id": "mphe6sx",
      "body": "How old are your kids? This is what you signed up for for at least until they are both in middle school. I mean this with love, because I also have two kids and ZERO time for myself and it absolutely sucks ass sometimes, but: You made them. They’re your responsibility. If you don’t think they can sense your resentment, you’re wrong. Time to sack up and put on your big boy pants and be a good father. Yep, it’s just work and sleep for a while. Yep, it sucks. Yep, it will end. The reward is putting two well-rounded, well-loved, well-raised people out into the world. And you won’t get that reward if you don’t put in the work, dad.",
      "created_utc": 1745848354.0,
      "score": 27
    },
    {
      "id": "mph1rbx",
      "body": "Hey, I’m really sorry you are experiencing these negative emotions around your children. This subreddit might be useful for you, as there’s a **lot** of people in the same exact position as you. Sorry I can’t give any tips or suggestions, hopefully someone else can. Just remember, your children did not choose to enter this world. Try to make the best out of the situation, hopefully it will get easier and better over time. \n\nhttps://www.reddit.com/r/regretfulparents/",
      "created_utc": 1745843868.0,
      "score": 170
    },
    {
      "id": "mphhuzz",
      "body": "This is why we DONT put superficial, egotistical expectations on people to start families when some don’t want to. Whether it be too early or ever at all. Sorry brother, my advice for if your mentality does not change to a more positive one and you notice yourself becoming outwardly hateful towards them: please leave the family. It is _not_ their fault. No child deserves to feel like a burden; it is your duty to take the pain of leaving rather than them facing the mental and emotional consequences of feeling unwanted the rest of their lives.",
      "created_utc": 1745849549.0,
      "score": 26
    },
    {
      "id": "mpi5th9",
      "body": "Then maybe you shouldn't have had kids. \n\nWhy don't people think this shit through before they have kids? It's really not that hard to think about, is it?",
      "created_utc": 1745856823.0,
      "score": 25
    },
    {
      "id": "mph9pg2",
      "body": "Can I ask when you started feeling this way? Was there a specifically catalyst that set it off? When you say they stole everything, what is “everything”?",
      "created_utc": 1745846813.0,
      "score": 12
    },
    {
      "id": "mphuk34",
      "body": "If you really don't want them, leave and pay child support.",
      "created_utc": 1745853472.0,
      "score": 11
    },
    {
      "id": "mpi2j64",
      "body": "Jesus Christ. Let me call CPS for you! Those poor kids",
      "created_utc": 1745855839.0,
      "score": 33
    },
    {
      "id": "mphosmq",
      "body": "My first child nearly caused a divorce, I didn't want them, wife did, my choice was divorce or children.\n\nIt then took a good 6 months to bond with my eldest. gave in for a second, took less time to bond with him. She wanted a 3rd, I didn't but agreed, and we lost twins and she nearly died.  She had another miscarriage and finally our 3rd was born.\n\nMy kids have kept me alive. I'd have given in years ago if not for the thought of them suffering what I've suffered.  I find peace 3 times in my day to day life.  After sex with my wife, if my kids fall asleep on me, or when they give me hugs.    They fall asleep on my very rarely now with the youngest being 5 but they still come and give me big cuddles. Wrap their arms around me, and it acts like a barrier to the negativity in my life.\n\nPart of me wants to say that you're focusing on the wrong things. You're focusing on what you've lost not what you've found. \n\nThe other wants me to tell you to stop being so fucking selfish, these kids didn't ask to be born, you did it and you have to man up and be a good dad like they deserve, so one day, they will be sitting there around a fire having beers with their dad.\n\n\"I didnt sign up for this\" - did you bust your but inside a woman without protection?  YES, so you did sign up for this.  \n\nNow, I'm not being a dick to you, but you need to see this from both sides.  Things will not get better for you or your kids until you start focusing on the little things in their lives and learning to embrace it.  It's your viewpoint that is the issue, not the kids. \n\nI hope you can change that viewpoint, because you really are missing out on a wonderful experience, far better than drinking beer with the boys.",
      "created_utc": 1745851712.0,
      "score": 40
    },
    {
      "id": "mphm4h3",
      "body": "Yeah so I can’t sit back and let someone talk about their kids like this. I understand that life can be extremely hard and stressful at times but acting like it’s all your kids fault isn’t okay. You chose to have kids which means you took on the responsibility of taking proper care of your 2 children. You’re an adult and you need to recognize that it’s your responsibility to help your kids, not the other way around.",
      "created_utc": 1745850891.0,
      "score": 50
    },
    {
      "id": "mphfgvw",
      "body": "you’re definitely going to get berated for this, that is the kind of subject that doesn’t go easily. you told others that you started feeling this way a few years ago, but you have a 2 month old? are you being coerced into making more children? how did this happen? and if you ever feel any urge or desire to get rid of the “problem” that is your children, don’t act on it, go to the police, to CPS, whatever can help immediately or quickly, and say everything. \n\nyou brought life into the world, and willingly or not, you have at least some responsibility. if you absolutely cannot under any circumstance sacrifice part of your lifetime to nurture and take care of these children, then do the necessary steps to give them a foster home, or to support the mother. just know that you are making the lives of everyone involved most probably much worse by doing this. this is NOT to blame or to mock, but you have to know the stakes of these thoughts and (possible) desires, and decide accordingly. if you hate them that much, your children know. \n\nnow to the more personal part of your issue. this is definitely having a catastrophic effect on your mental health, so consider therapy (if you have time and funds) and i wish to remind you that suicide isn’t the way to go. your life isn’t at an end, you’re just faced with an impossible decision, with extreme moral stakes,  that you apparently never wanted. it sucks, and i understand, but i reiterate, these children have been brought to life because of you and your significant other, and it is NOT THEIR FAULT. \n\nto end this, i am a single individual with no expertise on such a matter, i am simply stating my understanding and opinion of this situation. go see a couple’s counseling expert. go see a therapist. go to see anyone that may help, to either repair whatever happened that made you see these children as parasites, or at least give these children a solid chance at life whilst giving you what you apparently want.\n\ni hope you have a good day, and i cannot say enough how important it is that you think this through. i am assuming many things in this text, assuming the worst, but i would like it to not happen, so i’m talking anyway.\n\n**edit**: making a small edit just to say something. this entire message is **not** meant to insult, blame, judge or mock. this situation is very serious, and my bluntness is a conscious choice to show that it is. you are a valuable human being and deserve peace of mind, very little things can change that fact. if you don’t care about my advice, go ahead, and do your own thing, this is just a message to try and help with the only way i can.",
      "created_utc": 1745848772.0,
      "score": 10
    },
    {
      "id": "mphbo4h",
      "body": "Yeeeesh, maybe your first thought shouldn’t have been “I hate my kids, Im gonna post this to Reddit”. Maybe get some help?",
      "created_utc": 1745847506.0,
      "score": 66
    },
    {
      "id": "mphs5zf",
      "body": "Your children deserve better than this.",
      "created_utc": 1745852745.0,
      "score": 23
    },
    {
      "id": "mpi4dp8",
      "body": "I know it feels like shit, but you should blame the system that forces you to work all day and night and the unnecessarily high cost for child caring and schooling etc., not the kids. The kids literally can't do anything about it and are not responsible. It's the society we live in, and this shitty economical system. If you had plenty of money and time things would look dramatically different between you and your family. They love you. They will understand what you've sacrificed. I do, in adulthood. Thank you for working so hard and loving them despite your hardships.",
      "created_utc": 1745856390.0,
      "score": 9
    },
    {
      "id": "mph80uc",
      "body": "You know that those are your kids right? Dont resent them, or see them as parasites, you brought them into this world with your wife. Its not their fault\n\nI know how stressful it is and how heavy it is and how much responsibility it takes to be a parent \nNo beers with the boys for now maybe until they're older then you can have some free time \n\nJust dont resent your kids its not their fault",
      "created_utc": 1745846210.0,
      "score": 1416
    },
    {
      "id": "mpi4sx1",
      "body": "Bro should have used a condom if you're so bothered about beers with the boys. Like damn. Grow up. How old are your kids? Why aren't you getting the occasional night for that if that's really what you want?",
      "created_utc": 1745856518.0,
      "score": 8
    },
    {
      "id": "mphm2y7",
      "body": "You brought them into this world",
      "created_utc": 1745850877.0,
      "score": 23
    },
    {
      "id": "mphx3ph",
      "body": "Yeah you did sign up for it. The night you had unprotected sex. Sorry man, I don't feel bad fornyou. Get help, they're the ones who didn't sign up for this.",
      "created_utc": 1745854233.0,
      "score": 15
    },
    {
      "id": "mpiewuk",
      "body": "Wow...poor kids. Antinatalism is needed. It's a much better alternative to forcing children into existence only to be resented by the person who created them.",
      "created_utc": 1745859501.0,
      "score": 5
    },
    {
      "id": "mphy6i5",
      "body": "Thank you so much for reminding me why I didn’t have children. On another note, this is depression. Full on depression. You need to figure out how to get out of it.",
      "created_utc": 1745854557.0,
      "score": 13
    },
    {
      "id": "mphjj9h",
      "body": "You need to seek a legitimate therapist / psychologist. What you’re experiencing isn’t uncommon.",
      "created_utc": 1745850079.0,
      "score": 6
    },
    {
      "id": "mphms3x",
      "body": "Hiw old are your kids?  I have two and i went out with my friends once every two weeks.\n\nIts doable. make a plan with your significant other and one week they go out one weeke you go out.",
      "created_utc": 1745851093.0,
      "score": 5
    },
    {
      "id": "mph9h4f",
      "body": "Hiya,\n\nSorry you feel like this. \n\nSounds like you need to get some help and seek therapy.\n\nRemember they are children. They are innocent. They also read you and your negative energy towards them.\n\nYou need to change how you think. Thoughts?\n\nJust my experience - \n\nYou get out what you put in. The more you invest the more you see in return. It's amazing 😍",
      "created_utc": 1745846731.0,
      "score": 18
    },
    {
      "id": "mphikbf",
      "body": "i’m sorry you’re in this situation. it must be impossible and i can empathise enormously considering i never want kids but please please try not to take out this feeling on your children because it will fuck them up permanently. it sucks but please keep reminding yourself that your kids didn’t ask to be born and nor did they ask to be your responsibility. \n\ndid you choose to have kids and then regret it afterwards or was this an accidental pregnancy situation?",
      "created_utc": 1745849771.0,
      "score": 5
    },
    {
      "id": "mpij0mr",
      "body": "Hot take. But appreciate the insight. Take care of yourself. Cuz at the end of the day you're lack of self-care is going to manifest in abuse for your children. \n\nYou want to have a beer with the boys schedule it out. \nYou need to go to school - figure it out. \n\nYeah it's going to be harder, 80 hour work weeks across a traditional job and school, but you're not stuck. \n\nIt's called enlighten self-interest. What is good for you we'll be good for your family. If you keep trying to white hand red knuckle the next 18 years you'll break and people will think of you as crazy aggressive or the problem. \n\nThanks for telling someone even Reddit. Take care of yourself now before people's reaction is unforgiving hive mind tolerance towards a burnt out man  It really is hard to recover without support.",
      "created_utc": 1745860700.0,
      "score": 3
    },
    {
      "id": "mph6e35",
      "body": "May I ask how old your children are? I understand how kids can be quite a headache during the first years of their lives, and although I'm not in your situation, I can imagine how exhausted you must be. You might not feel anything positive towards them, you may even feel hatred, but to them, you're their whole world. You're the very person they will look up to for a long time. It is a great responsibility, it may be stressful, tiring and scary, so you are allowed to take breaks- no, you MUST take breaks. Without them, you will only keep developing and deepening your hatred towards your children. Find a way to get a day all for yourself, once or twice a week, take turns with your partner or find a babysitter, leave them with a family member, anything that will keep them safe and cared for; make sure they stay with someone and go take a breather. Exhausting yourself any further will only make things worse, you may experience emotional outbursts and become aggressive, so in order to take care of them, take care of yourself. Don't make them fear you",
      "created_utc": 1745845615.0,
      "score": 10
    },
    {
      "id": "mph4ez0",
      "body": "How old are your kids?",
      "created_utc": 1745844884.0,
      "score": 7
    },
    {
      "id": "mphn9rh",
      "body": "Look I get it, I’m a mum, I never saw myself having kids but it happened and I have a 16 month old. I often miss my life before having him but he’s my heart and soul. I brought him into this world so it’s my job to make sure he has the best life and feels nothing but love. \n\nYou need to change your mindset, it doesn’t last forever but how you act now, will having a lasting impact on them. \n\nSeek some support for how you’re feeling but do not let the kids feel the impact of this.",
      "created_utc": 1745851244.0,
      "score": 8
    },
    {
      "id": "mphyngu",
      "body": "You cannot pour from an empty cup. Our kids eat up all of our energy and love, and when we have none for ourselves to begin with they get the worst of us. This isn't you. If your kids are in good hands with love and support, you need to take a step back to fix yourself. Get help, fall back in love with yourself, continue therapy and get more serious about it. There is a deep connection between the health of our inner child and our ability to parent, so start by being kinder to the young version of yourself still inside. Focus on you and the love for your kids will find you. I'm so sorry you are feeling this way.",
      "created_utc": 1745854695.0,
      "score": 3
    },
    {
      "id": "mpi3xxd",
      "body": "You need more than therapy. You probably need to be on medication. I’ve suffered with mental health issues my entire life, but it wasn’t until after I had my kids that my symptoms became unbearable and out of control. I have ADD and bipolar, diagnosed after my 3rd baby. I had to see an actual psychiatrist, not a therapist. I advise you to do this asap. You seem unstable, and it’s quite unsettling.",
      "created_utc": 1745856259.0,
      "score": 3
    },
    {
      "id": "mpi6k1g",
      "body": "Your kids didn't ask for being born. It's you and your s.o. who bear that responsibility. Please don't let ur anger and frustration out on them and seek a therapist",
      "created_utc": 1745857047.0,
      "score": 3
    },
    {
      "id": "mpi7v9s",
      "body": "I have four kids, and have had moments like this. I don't know the ages of the kids, but just know that as they get older it gets easier. At least it did for me.\n\nAlso, you can still have a beer with the boys. If you can't that's not a kids thing. That's a marriage thing. My wife and I both prioritize each other's social and leisure needs. Sometimes that means I hold down the fort, and sometimes she does.\n\nAlso...this is a very immature mindset and you need to reframe your life.",
      "created_utc": 1745857439.0,
      "score": 3
    },
    {
      "id": "mpila1d",
      "body": "i do not have kids. i’ve been reading comments, and just from a mental health standpoint, i think you may need to check yourself into a mental health facility, for the sake of everyone. the things you’re thinking are scary. you’re already in therapy but you probably need something more intensive right now. you can have several days to get away from the situation, talk to doctors, talk to therapists, have time to do nothing but think, and decide if maybe moving out for good might be the best for everyone, even if you feel like it’s all on you. because right now, this isn’t good for anyone. please get help and i wish you luck.",
      "created_utc": 1745861347.0,
      "score": 3
    },
    {
      "id": "mpiyo9r",
      "body": "Please do not let your kids feel that resentment because all that’s gonna do it pass the cycle of mental illness and low self worth to them as well",
      "created_utc": 1745865274.0,
      "score": 3
    },
    {
      "id": "mpj6bo7",
      "body": "If it's not rewarding, you're parenting wrong.",
      "created_utc": 1745867565.0,
      "score": 3
    },
    {
      "id": "mpjb5im",
      "body": "The nightmare ends when you let go of the emotion you’re projecting onto them",
      "created_utc": 1745869043.0,
      "score": 3
    },
    {
      "id": "mpjfqva",
      "body": "Your kids can tell that you hate them btw.",
      "created_utc": 1745870433.0,
      "score": 3
    },
    {
      "id": "mphr3o4",
      "body": "Why did you have them??",
      "created_utc": 1745852416.0,
      "score": 5
    },
    {
      "id": "mpi5g9m",
      "body": "Gosh, I can’t help but feel painfully sorry for your children. Please seek help, so they don’t grow up psychologically damaged.",
      "created_utc": 1745856711.0,
      "score": 5
    },
    {
      "id": "mphm5rg",
      "body": "I wouldn’t hate on this wounded OP. We all go through it. He’s just voicing it. Life does suck but you gotta heal you and understand that you had sex = child was born. There are tons of options to get what you want. Divorce. Parental release. Stepping up. Healing etc.",
      "created_utc": 1745850902.0,
      "score": 4
    },
    {
      "id": "mphxjei",
      "body": "I'm sorry but, what's keeping you from having a beer with the boys? Do you not get some time for yourself? My parents never had a problem doing their activities with 3 young kids, so I really wonder, do they have special needs? Are they sick?",
      "created_utc": 1745854365.0,
      "score": 4
    },
    {
      "id": "mphz92w",
      "body": "please seek therapy.",
      "created_utc": 1745854871.0,
      "score": 4
    },
    {
      "id": "mpik7ks",
      "body": "I can't have children, I would give anything to bring life. \nGet some therapy and figure out why you resent your life and your children. They didn't ask to be brought into this world.",
      "created_utc": 1745861042.0,
      "score": 4
    },
    {
      "id": "mphjd32",
      "body": "a lot if these comments are really unhelpful, huh. \n\nI LOVE being a parent. If Im not given a break after x amount of days, I become the parent that hides from their kid and looks for every opportunity to not engage. \n\nWe all need breaks, some more than others. Sounds like you really need time to yourself. \n\nWhy cant you go have a beer with the boys? If you tell your wife you’ll stay with the kids for 3 hours while she goes do whatever, will she reciprocate while you go do something that relaxes you? This is the key to me. You occasionally need time away from the kids to be fully able to enjoy them",
      "created_utc": 1745850025.0,
      "score": 7
    },
    {
      "id": "mph6nef",
      "body": "Welcome to adulthood...",
      "created_utc": 1745845711.0,
      "score": 7
    },
    {
      "id": "mphl4qf",
      "body": "Hi man, we all as parents as fathers Been there. Your post leaves me with 1000 questions but for now I will focus on this. No one. I repeat. No one makes you feel the way you feel with the exception of yourself. You control your reaction. And the more negative it is the more negative life will be. Heck yeah I get frustrated and wish I never had kids. Heck yeah I wish my partner stood up more and took the kids away from me for 1-3hrs when she is just sitting and watching TV. \n\nBut the reality is, work will always suck. When you don’t make time for yourself we tend to lash out at those who need us. \n\nTake a breathe. Take some time off. Go away for 1-2 days and reflect on what you want. Resenting is a normal feeling at times, pain and stress is normal to feel. But prolonged long term hate or resentment for your kids can fester into catastrophic issues especially if you have a daughter. \n\nBe safe. Stand tall and work on yourself asap.",
      "created_utc": 1745850580.0,
      "score": 2
    },
    {
      "id": "mpi5zht",
      "body": "you don’t have to tell me twice",
      "created_utc": 1745856874.0,
      "score": 2
    },
    {
      "id": "mpi6kfl",
      "body": "This sounds really difficult, I’m so sorry you’re experiencing these feelings. Have you tried talking to your partner about needing some time to yourself to unwind so you don’t burn out? Maybe even just like an hour a night and one or two nights a month you can go out with your boys?",
      "created_utc": 1745857050.0,
      "score": 2
    },
    {
      "id": "mpi72vo",
      "body": "You can visit r/regretfulparents and post this there.",
      "created_utc": 1745857203.0,
      "score": 2
    },
    {
      "id": "mpimb99",
      "body": "It honestly sounds like you need a break and some therapy. Parenting can be hard. It is definitely an adjustment. You can’t party all day everyday anymore but you absolutely can make time to go get a beer with the boys. Parenting doesn’t have to be the death of your social life or hobbies. It gets overwhelming for sure but take some time to go do something for yourself. Allow your wife to do the same.",
      "created_utc": 1745861647.0,
      "score": 2
    },
    {
      "id": "mpin9x4",
      "body": "Children aren't consequences. My heart breaks for the wife and kids, based on this post and your replies I can't imagine you were much of anything BEFORE any of them arrived. \n\nThis sounds like evidence in a future criminal case tbh. Leave that woman and those kids ALONE, I mean ffs....this is just vile and I don't even live with it/have experience this firsthand as a child. \n\nBest advice? Leave. You've most certainly done enough damage as it is. Let them focus on healing THEIR mental health.",
      "created_utc": 1745861923.0,
      "score": 2
    },
    {
      "id": "mpiohy5",
      "body": "Why are you resentful of your own children?\n\nI hope you get some help",
      "created_utc": 1745862275.0,
      "score": 2
    },
    {
      "id": "mpisiwr",
      "body": "I'm in my late 40's. I remember like it was yesterday being 12 and my dad looking me in the eyes and saying that he \"never really wanted kids\", but he did it for my mom. I knew he resented me being around, there's no way to hear that and not have it impact you. He and I do not have a relationship, my parents are divorced, I talk to him by email or phone every 3-5 years, and haven't seen him in 7-8 years. Please talk to a professional about how you are feeling, even if you aren't explicit, your kids know how you feel. You tell in yourself with every eye roll, sigh, cancelled plan, and hug lacking genuine warmth. Get help.",
      "created_utc": 1745863437.0,
      "score": 2
    },
    {
      "id": "mpixrvp",
      "body": "You were the one who had them, resent yourself not your kids",
      "created_utc": 1745865004.0,
      "score": 2
    },
    {
      "id": "mpizulh",
      "body": "You literally FORCED them into this world for YOUR OWN WANTS, you are the parasite\n\nGet a vasectomy asap since you seem to not be able to grasp how a condom, birth control pills, plan B, or any other form of birth control works\n\nUnless you were raped, you quite literally signed up for this, the \"descissions\" were made by **YOU**",
      "created_utc": 1745865625.0,
      "score": 2
    },
    {
      "id": "mpj4vgp",
      "body": "Your kids didn’t ask to be brought into this world. You had 8 years to split with your partner, firmly discuss not wanting anymore kids, getting surgery to not have anymore kids, etc..yet you still had another one. The problem is you, not your kids. Whether you use protection or not, if you have sex you risk having a kid! \n\nI can guarantee the oldest kid can tell how you feel towards him and his sibling. Kids aren’t dumb and they pick up on things like that.\n\nWhy didn’t you think about what comes with having kids in the first place? First one may have been an accident but the with the second one you should’ve known better.",
      "created_utc": 1745867128.0,
      "score": 2
    },
    {
      "id": "mpj6mm2",
      "body": "Sounds like you need to talk to a pro. You sound burnt out. You need to add in you time. \n\nParenting is hard. I have a 4 year old Autistic kiddo, and there are times where I desperately need a break but can't. I get it. But it's not their faults. You can't pour from an empty bucket. You need to do things that fill your bucket. You need to learn how to enjoy the positives of parenting, and let the negatives slide off your back. You need to learn how to do this. It does not come easily. But it helps. \n\n But you chose to have these kids. You choose to give them life. They are only doing what kids do- seeking support from their parents as they learn to navigate the world. Don't hate a cactus for not being a rose. Appreciate them both for what they are. Learn to appreciate it. Appreciate the times your kids ask you to swing them again because they love how you do it. Appreciate the times they laugh with you because you made a joke. Let go the tantrum in the grocery store. Let go of the times they don't listen to you the first 30 times and now everyone is upset. Embrace them. Love them. Get help when you need it. \n\nGet professional help my dude. Choose to be better. For you. For your kids. You can do it.",
      "created_utc": 1745867658.0,
      "score": 2
    },
    {
      "id": "mpja0nu",
      "body": "YOU put them in this world, they did not just come to you. YOU created them.\nYou are the guy who puts a stick in his bike wheel and then falls and cries about it.\n\nGet your shit together. Go to therapy if needed. \n\nDon't ruin human lives that YOU created because you didn't think hard enough before doing so. They deserve better than that",
      "created_utc": 1745868692.0,
      "score": 2
    },
    {
      "id": "mpjetoe",
      "body": "Mf stop acting like life foced them on you.degenerat.\nCalk it up to your life choice.the hell.",
      "created_utc": 1745870156.0,
      "score": 2
    },
    {
      "id": "mpji34b",
      "body": "It is not their fault they were born. Give them love, they’re children. They’re your children.",
      "created_utc": 1745871138.0,
      "score": 2
    },
    {
      "id": "mpjjbjn",
      "body": "Going against the grain here to send you love. While everyone else is right that it isn’t the kids’ fault, I can at least say I see your POV. A decision was made and it’s a bit more taxing than you’d hoped, and it’s okay to recognize that life would be different if you didn’t have kids. But just don’t sink deeper into that thought, continue therapy and start figuring out a way to adjust to your new environment and life. It will get better eventually. If you can, try to take some time for yourself as a reward for all your hard work every now and then. You aren’t a monster. Just continue trying not to be one. Things will get better.",
      "created_utc": 1745871505.0,
      "score": 2
    },
    {
      "id": "mpjjtvw",
      "body": "Why did you have kids then ?",
      "created_utc": 1745871657.0,
      "score": 2
    },
    {
      "id": "mpk9cyz",
      "body": "Dude, you kinda did ask for this, but please believe that I have empathy and it isn’t over. There is hope. You can have a beer with the boys. It’s up to you to take those first steps because no one is coming to save you. Your kids at least deserve a childhood that they can look back on fondly. If you can’t do it for yourself, do it for them. If you can’t even do that, then do the right thing and let someone better have custody.",
      "created_utc": 1745879873.0,
      "score": 2
    },
    {
      "id": "mpkcb8g",
      "body": "Here's the thing. You did sign up for it, you signed up by having kids. It's a part of the deal. \n\nHere's a question for you. Do you actively take an interest in what your kids are into? Do you try to show them what you like? Do you try to connect to your kids so you know them as people? Because that's the reward. You have to invest more into it than it sounds like you are, simply being present but secretly angry isn't going to reap any rewards. What it will do is make both you, and then miserable.",
      "created_utc": 1745880877.0,
      "score": 2
    },
    {
      "id": "mpkf8mm",
      "body": "as a child who has a parent hate them, or did atleast. don’t pull urself away then come back and pull and come all the time pick and stay too it ur hurts let",
      "created_utc": 1745881889.0,
      "score": 2
    },
    {
      "id": "mpkkrsw",
      "body": "Yeah. Reddit is not the best place to ask about incredibly complex emotional issues anyone and everyone with or without experience can comment and the majority of society will not understand situations outside of their experiences.\n\nIf the current therapy isn't working, its time to start looking around for another one. I don't know you or the situations that led up to this but the one thing you can do to \"take responsibility\" as everyone is harping on you about, is to put the work in to be a better version of yourself. Helping yourself helps the ones around you.\n\nI'm sure the resentment is probably causing some kind of feedback loop of guilt, you clearly don't want to feel this way.\n\nThere is no easy answer but you and your family deserve to be happy; this is something for a professional to help you with. Getting berated by the internet isn't going to help. This post should be locked.",
      "created_utc": 1745883776.0,
      "score": 2
    },
    {
      "id": "mpi3xtu",
      "body": "Your situation is exactly why I will never be having kids. Still, your an adult, you know what the potential consequences are of having sex. Of course you could do every right (using protection and pulling out etc) and it still could happen. In which case since your not the carrier it would ultimately be the other person's decision whether to keep the pregnancy or not. However you still had a choice to stay or leave. Now I don't particularly advocate for knocking someone up then running for the hills but if the flip side is hating the sprogs existence and resenting them? Well in that case for the kids sake I'd say leave. Too late for you now though I think. All I can suggest is to look forward to when they are adults and can leave the home, though in today's economy that may be a very very long time away.",
      "created_utc": 1745856258.0,
      "score": 3
    },
    {
      "id": "mpi3r26",
      "body": "I would visit r/regretfulparenting , posting this stuff anywhere else will give you backlash. There are adults that sympathize with what you’re going through. It put me off from being a parent reading all of these stories. It’s not easy or rewarding now, but I hear it’ll get much better once they start gaining independence. My advice is to not let this seep through your interactions with them. Don’t let these natural feelings harm the people you brought into this world- they didn’t have a choice.",
      "created_utc": 1745856202.0,
      "score": 3
    },
    {
      "id": "mpi1zak",
      "body": "How old are you if you don't mind me asking? Beer with the boys is something I hear from Millennials in their 30's but I normally see boomers referring to their kids as parasites who stole everything. Just curious on the age range. Might help shed some light regarding whether its an issue based on generation and attitudes at the time.",
      "created_utc": 1745855676.0,
      "score": 2
    },
    {
      "id": "mpim2yl",
      "body": "When you’re alone and old after years of your shit parenting because you “resent your parasites,” I bet you money you’ll regret it. \n\nYour children deserve better. And anyone who relates to this bullshit is fuck all too. \n\nIf you decided to have kids- it’s on you to prepare them for life and AT LEAST TRY to instill positive values in them. \nBut having a beer with *the boys* is more important-\n\nAt this point, I hope they find a better home before you fuck them up completely. They deserve better.",
      "created_utc": 1745861580.0,
      "score": 3
    },
    {
      "id": "mpip2l9",
      "body": "What is wrong with people that go through life barely getting by suddenly thinking a child will make all of it better? I have ZERO sympathy for you OP. For your kids sake I hope you tighten that loose screw and get your shit together!",
      "created_utc": 1745862439.0,
      "score": 2
    },
    {
      "id": "mphywgj",
      "body": "Hey, I know you don't mean that genuinely. You wouldn't have kids for no reason, I'm sure. Children mirror you, think of them like sponges. If you yell, they will too. If you say they are a parasite, then they can and will say it to others. \n\n  \nPeople say parenting is rewarding because you get to watch a small baby grow to an adult, see them change and transform. They are people too, no matter the stage of which their brain has grown yet. I suggest, take time to breathe. This isn't your fault, and whenever you need to, take time in a quiet room to heal. \n\nWhen you feel as though you can, you should spend time with your kids. Get to know them! I know, they're your kids, you probably THINK you know everything about them, but there's always surprises.",
      "created_utc": 1745854767.0,
      "score": 1
    },
    {
      "id": "mpi1u7o",
      "body": "Did you always feel this way? Or did these feelings just creep up on you when they hit a certain age? How long have you felt this way?",
      "created_utc": 1745855635.0,
      "score": 1
    },
    {
      "id": "mpi3w71",
      "body": "how old are they?",
      "created_utc": 1745856244.0,
      "score": 1
    },
    {
      "id": "mpi5kbr",
      "body": "Im on the opposite end, my life was a ptsd driven substance abuse nightmare. Ended up getting married, was fine for a couple years then it all started again almost ending my marriage. Then my wife got pregnant, we decided to keep. I have a 6 and 3 year old and I can honestly say I am still here becaise of them. Everything I do is to give them a better life than I had. And I still can go out for a beer with the boys now at least once a month, me and wife just cant really go out for a beer together but we take turns letting the other have a night of relaxing with friends.\n\nGlad you are in therapy because you need to find a way to change your attitude towards them. My dad didnt want me and resented me and aloooot of bad shit happened to me because of my realization I was an unwanted burden. They didnt ask you to bring them into the world, dont treat them like they owe you something for your sacrifice.\n\nYour allowed to feel sorry for yourself, but don't wallow around in your pit of self pity because your kids will eventually realize that dad wishes they didnt exist. Then they will begin down a dark path leading them into horrible situations with horrible people and it will in the end be your fault for projecting your self hatred onto them. \n\nShare your hobbies with them, find joy doing things they want to do, watching them learn and grow. Instead of thinking you have to do all this because of them, think that you are doing all this for them. \n\nYou are their hero automatically by default. Dont become the cliche of \"never meet your heros because they will disappoint you\". When they are grown up you will look back and your real regret will be all the time you wasted wishing they didnt exist.",
      "created_utc": 1745856746.0,
      "score": 1
    },
    {
      "id": "mpi7ke9",
      "body": "I don’t have kids but I feel for you. I know you’re not the only parent to feel this way. It’s hard to take care of ourselves and someone else. You can love your kids and still be depressed and that’s draining. I wanna say it gets better as they get older. At least I appreciate my parents more now. I’m thankful for all the times they said no or protected me. I’m thankful they were not abusive. I’ve gone through things with them like divorce that profoundly affected me. I still have issues with my dad but I’m still grateful and have told them so. Thankfully, throughout my life I met other people my age who had worse parents. And it taught me a lesson that my parents couldn’t teach me. It humbled me. And made me more loving with friends. \n\nI guess my advice would be to make sure that you’re doing all that you can to take care of yourself. I mean your physical health and your mental and emotional health. That may mean you may have to have some tough conversations.  Being a good dad is more than people think. It does really matter that you try and show up. This is coming from a girl who missed out on my dad. And my dad was a harsh disciplinarian. So in some ways it worked out. You will get through this. Just keep reminding yourself. It doesn’t have to look perfect.",
      "created_utc": 1745857349.0,
      "score": 1
    },
    {
      "id": "mpi9148",
      "body": "Hey- I've been there. What really helps is getting that beer. \n\nI assume you can't get a sitter? Is the wife putting in equal work? Can you guys talk about it and work out a solid commitment to giving each other time away and downtime?  Do you have family? \n\nIf someone offers you help- take it! Never ever feel bad about putting yourself first to maintain mental health. Because once it goes down, everyone suffers. \n\nWhat are the ages?",
      "created_utc": 1745857782.0,
      "score": 1
    },
    {
      "id": "mpi9iam",
      "body": "1, while I'd love the idea of having a baby, there is no way in hell i would want to pass on my mental and physical bullshit to some innocent kid. 2, Bro, look at it this way: they didnt ask to be born, They had no choice in the matter. 3, you should really consider taking to a counselor or therapist",
      "created_utc": 1745857922.0,
      "score": 1
    },
    {
      "id": "mpiek7p",
      "body": "Thats why I dont intend to have any. The world is a horrible place. We deserve to go extinct 🤷🏽‍♀️",
      "created_utc": 1745859402.0,
      "score": 1
    },
    {
      "id": "mpiigkm",
      "body": "Parenting is hard. I think you may be experiencing really severe parental burnout. When left to fester it can cause really deep depressions, which I think is where you’re at. I’m surprised your therapist hasn’t necessarily mentioned anything like this. \n\nYou can still have the things you want in life, but you need to rearrange the ways you’re thinking about your family and aspirations, which can be difficult. Not having a life of your own to be yourself is not healthy, and it will have an impact on your kids. I think maybe talk to your wife and therapist about feeling burnout and ways that you can take steps to fix it.",
      "created_utc": 1745860537.0,
      "score": 1
    },
    {
      "id": "mpijk1i",
      "body": "I get it. I chose not to have kids. I like things a certain way and kids don’t pop out knowing the rules. I don’t think you have much thought to what that reality would be like, how it would impact your preferred lifestyle and for how long. You’re probably more angry at yourself than you let on. \nI’m sure there are many parents who thought they wanted kids and realized it wasn’t for them. \nHere’s the thing…I didn’t fulfill what my parents ordered. Dad wanted the other gender. Mom wanted someone who might possibly save her marriage even though Dad was already screwing around. And I knew. I always knew I wasn’t right in their eyes. More work. More parental duties done to the lowest standard. \nGet out. Save your kids.",
      "created_utc": 1745860855.0,
      "score": 1
    },
    {
      "id": "mpijkdq",
      "body": "I'm sorry you're suffering but I understand why you don't get the reactions you want. You signed up to be a parent and now you insult and mistreat your children and whine about wanting to have a beer with your friends. That's not okay. If you want the people in your life to show you compassion you need to change your focus. Ask for help to deal with your mental health. Ask for help to become a better parent. Ask for help to improve your schedule so you can have quality time with your children and time to relax for yourself. Focus your venting on how you feel about yourself, on your struggles, on your symptoms etc, not on hatred of the innocent children you made. This will get you the sympathy, room to vent, support, help and advice you want and desperately need. People simply don't feel much compassion when a parent insults and expresses such feelings against their children (especially if it's several so you made a second one after knowing very well what you signed up for), and wanting time to go out and drink like back when they were single. It will probably take longer for you to reflect, let go of the selfishness and heal enough to get rid of all resentment against your children, but the time to start with that and the time to make sure you show your children love and emotional support and do everything in your power to prevent them from noticing your resentment is now.",
      "created_utc": 1745860857.0,
      "score": 1
    },
    {
      "id": "mpijwo1",
      "body": "I see you fell for society's \"you need to have kids to be happy\" scheme.\n\nIt's not true unfortunately, not everyone is happy with kids and you're experiencing that first hand but you must understand that these kids of yours didn't *ask* to be born. They didn't ask to be your kids. \n\nHow old are they? Depending on their age is how you should go around addressing this situation because like it or not, them discovering you feel like this will hurt them in the long run and it will hurt you too. If you ever do go about addressing this to them, please treat them like human beings and with respect.",
      "created_utc": 1745860955.0,
      "score": 1
    },
    {
      "id": "mpinpus",
      "body": "Damn. I’m sorry to hear that. I’m 37 and don’t have kids because I’m pretty sure I’d feel the same way about them that you do. Go figure, I get hated on for but wanting them. So I’m judged either way lol. I can’t imagine being stuck in that situation, though. I’m proud that you’re in therapy. I hope it gets better as they get older.",
      "created_utc": 1745862050.0,
      "score": 1
    },
    {
      "id": "mpiot2y",
      "body": "How old are your kids if you don't mind me asking. Maybe they could do something around the house so it's more meaningful, have you tried chores so everyone contributes to the house? But please don't ever let your kids know you don't want them or think negatively of them. My dad was emotionally unavailable and I've been trying to excommunicated myself from him for the longest time because I know he doesn't care and it's led to so many issues. You can have \"beer with the boys\", I'm not a parent or technically an adult, but I know it's not sustainable if you don't take time for yourself, you get sick of seeing a person so much, even when you love them. Do they have a grandparent, nanny, or friends house they could go over to?",
      "created_utc": 1745862363.0,
      "score": 1
    },
    {
      "id": "mpioy4d",
      "body": "I’ve been looking into my own narcissistic traits recently. I tend to overvalue and to devalue people, things, and myself. \n\nDoes that sound like you at all? \n\nWhy do you resent them? Is there anything else behind that resentment? I think it’s important to ask questions like that in order to get to the root of it. \n\nWhy do they feel like parasites? What have they actually taken from you? What do you need that you feel they are taking?\n\nFor me, what I feel is taken from me no matter what I do, is time. Time continues no matter what I do, so it doesn’t necessarily matter what I do. It’s okay that my time was taken from me because it was always going to be. As long as I still have goals, as long as I’m still breathing, I still have time.",
      "created_utc": 1745862405.0,
      "score": 1
    },
    {
      "id": "mpipju4",
      "body": "Who decided to have sex without a condom and birth control?\nWhose pullout game is weak?\nWho did not sprint to the pharmacy to get plan b after the condom broke?\nWho knew they did not want kids but did not go to the doctors to get their balls cut?\n\nGood news is you can go to those sperm olympics that have been popping up on reddit. Maybe you'll win money.",
      "created_utc": 1745862577.0,
      "score": 1
    },
    {
      "id": "mpiptya",
      "body": "Parent of 3 littles here… I get it man, fatherhood is 100% self sacrifice. \n\nWhat all parents need to learn is how and when to fill our own buckets.  Coping skills. It can be VERY hard to make time, and it’s not going to magically happen so don’t wait for it - create it. Make it happen.  Pay for childcare for a cpl hours to get outside and hike, go do your hobby, rest, etc.  \n\nIf we can’t keep ourselves growing, healthy and evolving for the better we can’t raise little humans to have those coping skills either.  I’m rooting for you.  Make time for you.  You deserve and your kids deserve to have a calm and loving father, too.",
      "created_utc": 1745862657.0,
      "score": 1
    },
    {
      "id": "mpiqqef",
      "body": "I don’t really have much to offer by ways of advice but I hope your situation improves soon. life is hard.",
      "created_utc": 1745862914.0,
      "score": 1
    },
    {
      "id": "mpir9q0",
      "body": "Being a parent is hard, but damn is it fun. I have 3 little people who have learned all they know from me and are down for whatever. MY OWN LITTLE CHAOS ARMY\n\n\n\nNow... 💯 , you more or less give up the you first mentality,  but once you lean into it, it becomes the new normal. You gotta find things that you can do by yourself while still being present. For me that's audio books, playing video games remote ( so the TV stays freed up, gotta have the entertainment). I decided to start playing bass, then kids think that's the COOLEST thing, now they want little guitars to play along. But finding little things that YOU can do while hanging with the kids or after they have gone to sleep, helps immensely.  Audio books are easy, all you need is earbuds, your phone and an app. \n\nOnce you find the things you  can do while still interacting with them, the sailing becomes much easier.\n\nAlso, playgrounds. They play, you sit on the bench and watch them, it's a nice nothing time.",
      "created_utc": 1745863068.0,
      "score": 1
    },
    {
      "id": "mpirks9",
      "body": "I can completely understand this.\n\nBut I wonder if you tried thinking about turning the problem into the problem and getting to the real core of what is going on.\n\nLike you mention that your kids are parasites that stole everything from you. Well, what is it that they stole? Is it money? Then money is the problem, maybe not your kids: if you had more money would that alleviate the problem in a way? Then focus on that and see if there are things you can do to try and work on fixing that.\n\nIs it your freedom that they stole? Well perhaps you can make an effort to try and get some of your free time back? Asking friends/family to watch the kids a little more often to do some of the things you love to do.\n\nIs it loneliness and not being able to hang out with the boys? Well, that IS possible. It’s hard, and requires a bit of work, but you CAN do it if you try really hard. I know it seems impossible, but it just requires a bit more work. \n\nI know you probably feel like you are at the end of your tether and have no energy or motivation to create change, and that’s really tough. But if you dig deep I’m sure you can find it. You DO have the ability to improve your situation, even if you feel completely alone in this, try reaching out to someone. You might be surprised at someone around you that can step up and help. \n\nMost of all though, it’s ok to feel these things, your human, not super-human, these feelings are completely normal. It’s hard. Really hard. But you might be surprised by how strong you can be if you push yourself to try something different.\n\nJust keep putting one foot in front of the other and you can do it. \n\nAnd keep posting or writing or anything that helps you work things out for yourself.",
      "created_utc": 1745863157.0,
      "score": 1
    },
    {
      "id": "mpirw00",
      "body": "I'm very torn on this:\n\nOn the one hand: \nParents have feelings like any other human being and sometimes we dont enjoy parenthood, which is a very hard feeling and is associated with shame, but you cant control that you feel nothing for your kids. This has to be a very hard feeling because you feel like you should love them and dont want to hurt your kids.\n\nOn the other hand:\nI dont get the feeling from your post that you feel ashamed of having those feelings. You seem like you are drowining in self pity and have a lot of compassion for you self, while you lack severe compassion for the little humans you brought into this world. You dont see that your children are the victims because their own father hates them for no apparent reason. I read that one child is only 6 month old, if this is correct, than wtf, a 6 month old cant do ANYTHING that makes them a parasite...\n\nYou have serious problems and i dont want to dimish them, but the actual human beings that need to be pittied here are your children.\nGet Help, Get better, but your children are NOT your Problem",
      "created_utc": 1745863248.0,
      "score": 1
    },
    {
      "id": "mpiusva",
      "body": "do you think you’d feel differently if you had your kids when you were ready? genuinely asking. \n\ni also think maybe you need to respectfully leave your partner and pay child support. kids can feel your resentment no matter how much you hide it. i can’t say for certain but i think it would be easier on them down the line to heal from the fact that you were absent than it would be to heal from the pain of knowing you resented them. idk just what i think could be the case",
      "created_utc": 1745864116.0,
      "score": 1
    },
    {
      "id": "mpivi5v",
      "body": "Christ",
      "created_utc": 1745864326.0,
      "score": 1
    },
    {
      "id": "mpivopn",
      "body": "Please seek therapy.",
      "created_utc": 1745864380.0,
      "score": 1
    },
    {
      "id": "mpiy07y",
      "body": "In the spirit of don't let things end up like this:\n\nMy niece was adopted out to her grandmother at birth. 5 years later she took it hard when she found out. Her bio dad disappeared ( for the second time), so she is 14 or 15 at this point, she gets super drunk and calls up ol' bio dad.  Now, in all his infinite wisdom when his blubbering drunk daughter asks \" why did you leave, why don't you love me?\", this man responds \" man, this is kinda like a  break up\" .  In the end,  he shows back up when she is 15 and leaves again, just gone, like a ghost.  Now she is a broken person, who in attempts to get that  compassion she wants from her bio mom,  now frequently cries wolf about rape and SA.  In the end she came clean about it, said she did it because people left her alone to do what she wanted to do, the problem is she has gone after every male in the family, effectively shattering it permanently.   Now I don't judge bio dad for adopting her out, it was the right call and a responsible thing to do...but damn it sent her sideways, the notion of not being wanted or good enough....what's worse is he married and had 2 other kids, who he did keep.  She wants so bad to emulate them, because she sees they were wanted and maybe being like them, will make her wanted too.",
      "created_utc": 1745865074.0,
      "score": 1
    },
    {
      "id": "mpizamk",
      "body": "Get therapy. If you're already getting therapy, then go more often. It honestly sounds like your kids (and wife) would be better off without you like this. If I had a dad who actively resented my existence I sure as hell wouldn't want him around. Having children is hard and often not rewarding at the moment, but you basically get about a decade of them being kids until they're teens, then they want nothing to do with you anyway. At least try to enjoy that time you do have with them. Then you have the rest of your life to get beers with the boys or whatever again.",
      "created_utc": 1745865459.0,
      "score": 1
    },
    {
      "id": "mpj26j8",
      "body": "My husband and I are childfree by choice. I used to dream of being a mom. I always thought I would do it. But when the time came to start trying, I didn’t want to. I think there would be a lot less children out there if people felt like they could be honest with themselves. Too many parents have kids because they think it’s the next step. It’s not a step, it’s a choice. And a lot of you did it because you felt obligated. I hope one day they changes and I hope you can find a little peace, OP.",
      "created_utc": 1745866321.0,
      "score": 1
    },
    {
      "id": "mpj4lgu",
      "body": "I’m not going to have kids, so not an issue here. I’m the eldest sister of two siblings, so I was like a 3rd parent anyway to them. I have known that for years thanks to my parents toxic behaviours and also most days I’m too much to take care of on my own with my mental health issues, lack of financial stability and being a person who is socially isolated due to lifelong emotional neglect, constant criticism, being invalidated, sexual abuse and lack of any real love or support from family or friends. \n\nIf it wasn’t for my small bits of peace, freedom and having creative hobbies as well as my pets I think I would have given up trying to improve my life, even if it is just in small parts. \nNot going to make the same mistake my parents did by having kids when they didn’t want them genuinely for the right reasons and weren’t mentally well enough to care about their emotional wellbeing and being more kinder and positive. It really has fucked me up but I just avoid people like the plague now, most of the ones I have dealt with are complete douchebags, and so am I probably, but at least I’m more self-aware and am trying to be better.",
      "created_utc": 1745867044.0,
      "score": 1
    },
    {
      "id": "mpj53a8",
      "body": "Oh trust me. Some of us know",
      "created_utc": 1745867194.0,
      "score": 1
    },
    {
      "id": "mpj6y8h",
      "body": "Kids are a blessing, I pray that you see that soon.",
      "created_utc": 1745867756.0,
      "score": 1
    },
    {
      "id": "mpj6yxw",
      "body": "You might want to join r/regretfulparents",
      "created_utc": 1745867762.0,
      "score": 1
    },
    {
      "id": "mpj76kg",
      "body": "I hate to say it but I can sorta understand you. This is why I've never wanted kids and don't plan on having any, because I know I'll have the same mentality. I have no patience for kids and it wouldn't be fair to them. I like kids enough, I've bonded really well with my 5yo nephew and I love him to death. I just don't see the \"appeal\" of having any of my own. Also, \"I didn't sign up for this\", I mean you kinda did when you decided to not only have one, but TWO kids. They didn't ask to be born, you chose to have two of them and they don't deserve to be seen as parasites...",
      "created_utc": 1745867828.0,
      "score": 1
    },
    {
      "id": "mpj7eu2",
      "body": "But you did ask for this? Your kids didnt exactly have a choice but you did vro",
      "created_utc": 1745867897.0,
      "score": 1
    },
    {
      "id": "mpj8du6",
      "body": "I dont have kids and all i do is work and sleep.",
      "created_utc": 1745868191.0,
      "score": 1
    },
    {
      "id": "mpj9uf9",
      "body": "Having kids is hard. Having kids and no work life balance is so fucking draining. I love my son more than anything and I still need a break. My husband still plays video games with his friends at night because that’s how he recharges and relaxes. I get two hours during his naps to do what I want to do. Do you have a village? Family close by? Do you still spend time with your partner alone? Do YOU get to spend time alone? Not having those things can really build resentment and that’s a hard place to come back from.",
      "created_utc": 1745868638.0,
      "score": 1
    },
    {
      "id": "mpjam2e",
      "body": "r/regretfulparents. And I wonder don't people know what they are signing up for!",
      "created_utc": 1745868876.0,
      "score": 1
    },
    {
      "id": "mpjb6e1",
      "body": "OP, kids can definitely up the stress level in your life but they can also add a ton of love and more pros than cons. Keeping kids on a schedule, especially with sleep, if they are younger will make life for everyone better. You getting enough rest will help you to not feel so stressed. Alcohol is a depressant and if drinking regularly can add to depression. It is not worth it. As someone with adult kids, I can tell you that this time in your life will be crazy but it will be over before you know it.",
      "created_utc": 1745869050.0,
      "score": 1
    },
    {
      "id": "mpjca3z",
      "body": "Your not a bad person but those are your kids. I think you should talk to a psychiatrist. You might have depression. I am not a medical expert but meds and therapy",
      "created_utc": 1745869388.0,
      "score": 1
    },
    {
      "id": "mpjdg7m",
      "body": "Yeah… give your kids to someone who will actually treat them like humans. You know you don’t **have** to keep them right?",
      "created_utc": 1745869745.0,
      "score": 1
    },
    {
      "id": "mpjesmb",
      "body": "I don’t think resenting the children is helpful. How did they get here? Not by willing themselves into existence. If you weren’t ready for children, a conversation should’ve been had with your partner before the first one. You may not want them to see you like this but they can tell. When a parent doesn’t want you, we always know.",
      "created_utc": 1745870148.0,
      "score": 1
    },
    {
      "id": "mpjez8v",
      "body": "How old are your kids?",
      "created_utc": 1745870203.0,
      "score": 1
    },
    {
      "id": "mpji1hh",
      "body": "No shit",
      "created_utc": 1745871124.0,
      "score": 1
    },
    {
      "id": "mpjj2ip",
      "body": "It is easy to be a good parent if you have infinite time, money, and patience. Unfortunately those things are in short supply in the real world. There is immense pressure on parents to shield children from their emotions and stressors. Rightfully so because children are not punching bags for our frustrations. \n\nI'm sure you love your children -- if you didn't, you wouldn't be feeling conflicted or attempting to shield them from your mental health concerns. You are trying to balance the stressors of life and feeling inadequate about the results. \n\nI would recommend you build in some genuine, deliberate self care for you as an individual, your relationship, and your kids. Plan one night a week where you do go out and socialise with your friends. Does it suck that you can't drop everything and go down the pub for hours without thinking about it? Sure. But it's not all or nothing -- you can build in a night out into your schedule without letting down your family. Same thing goes for your spouse/co-parent. They need to be able to take a break and a rest, even if it's just \"mum's having a bath and needs to be left alone\". You should also build in some deliberate activities with your spouse without children -- a date night. Doesn't have to be elaborate or expensive, just a \"let's make a point to watch a film together on Thursdays after the kids have gone to bed\". Finally, set aside time for your kids that is positive time, not just chores. Children are people. The frustration of kids is the administration of having to do school runs, lunches, bath time, bed time, discipline. You should also have fun times with them. Maybe they like lego or football or dinosaurs -- take time to explore and develop shared interests with them. Read to them. Get to know them. The more you humanise them, the less they will seem like a chore to be dealt with. \n\nThe last thing I would say is that you should try to have dinner together as a family at least five nights a week if you aren't already. Sit together at a table and talk to each other. Let them share what's happening in their day, you share what happens in yours. If you're frustrated, they can hear about it in a way that isn't blinded by emotion and exhaustion. \"I had a hard day at work and I'm very tired\" is something children can hear and process. Some people do this as \"apple and onion\" -- you share a good and bad thing you went through. But you can also just let it flow naturally if that feels easier. Every healthy well-adjusted family I know is built on communication and shared experiences. \n\nIt IS stressful. LIFE is stressful. But continuing to suppress your feelings and seeing everything as a burden and a chore will only cause a continued destruction spiral. Wishing you luck. You are not a bad person, you are burnt out. You can't make the hard things disappear, so you need to find ways to rework your life so you can incorporate good things that balance them out. It will get better.",
      "created_utc": 1745871431.0,
      "score": 1
    },
    {
      "id": "mpjj46g",
      "body": "I've felt that burn out, and I don't think there's a single parent who hasn't. But the biggest thing i could tell you that helped me was MAKING time for a beer with the boys.\n\nIt started to feel like my life was just work and parenting, nothing else. I gave up everything else in my life to prioritize my family. But that leads to heavy self neglect, which causes those feelings of resentment to grow.\n\nThose kids probably love you more than you'll ever understand, even though you feel that way about them. All they know is you're their parent and they love you. They won't understand the sacrifice until they're older, and that's okay.\n\nBut what isn't okay is neglecting yourself. Make a night for yourself to go out with some friends, even if it's just 1-2 of them. I lost a handful of friends just from being a parent when they weren't, but i made new friends with other fathers who were feeling the same way I was. It really helped me feel less alone, and it helped pull me out of the pit that I was letting myself fall in.\n\nI know it sucks man. It's the hardest thing you could do, but it's worth it. I promise. Just try and take care of yourself. You aren't atlas, you don't have to hold up the world alone. \n\nYou got this 👌🏼",
      "created_utc": 1745871444.0,
      "score": 1
    },
    {
      "id": "mpjl784",
      "body": "if you don't want kids then why on earth did you bring them to this world? calling them \"parasites\", really??? poor children will grow up traumatized and nobody deserves that (speaking from experience). i wish people who are traumatized or unhealed would take a moment before bringing in innocent souls into the world and then blaming them for existing. please keep going to therapy and read some CPTSD books and books about parenting to make sure your kids won't suffer due to bad upbringing or emotional neglect. childhood is crucial phase to the human.",
      "created_utc": 1745872060.0,
      "score": 1
    },
    {
      "id": "mpjlb7c",
      "body": "My parents would strongly agree",
      "created_utc": 1745872094.0,
      "score": 1
    },
    {
      "id": "mpjmo5c",
      "body": "After the first one did you think \" this time will be different\"",
      "created_utc": 1745872497.0,
      "score": 1
    },
    {
      "id": "mpjp8if",
      "body": "You're a dangerous parent. That's not normal, and how you feel indicates mental health issues or profound immaturity, laziness or bitterness as a person.\n\nYou're looking for the point of it all? Reproduction keeps the world turning. Parents that reflect their mental issues or instability/not being up to the task of raising children, on their own children, produce problematic, but most of all damaged, individuals that are shaped poorly by their environment, which was their household that resented them.\n\nEveryone needs a loving home to grow up in. That's why you are the problem as it stands. You have issues, please seek therapy to avoid transferring them to your precious kids.\n\nI hope that someone in your circle that knows what's on your mind will tip off the mother of these kids, if she doesn't already know it's to this extent.\n\nNote: Maybe you are suffering from a condition that prevented natural bonding between you and your kids. A healthy parent with the natural bond to their biological children would be incapable of feeling the way you do.",
      "created_utc": 1745873263.0,
      "score": 1
    },
    {
      "id": "mpjqfrl",
      "body": "Please dont hurt the. They didn’t ask to be born and then a few years even if you wanted them they’re gonna want you to fuck off when they’re teenagers. Anyway, hang in there.",
      "created_utc": 1745873622.0,
      "score": 1
    },
    {
      "id": "mpjqjq8",
      "body": "People may downvote me for this but please even if you resent them, be kind. Try your best to not let them see that. I was a child who was resented and it left me a very broken person incapable of believing someone can love her. Nobody deserves to feel that way. Get help, work through it and talk about it to a therapist who can help not let those emotions build up \nKids are hard and it may be hard now but they’ll grow up eventually and you get to watch them blossom into beautiful humans and have their own families. Give it time\nThey didn’t choose to be born but you chose to have them. That’s a decision you’ll have to unfortunately deal with because every child deserves to be loved.",
      "created_utc": 1745873657.0,
      "score": 1
    },
    {
      "id": "mpjql89",
      "body": "Sending positive energy to you and I'm sorry that others in your life has judged you.\n\nYour feelings are valid, never forget that. \n\nDM me if you need a resource for talking though your feelings if you like- no pressure.",
      "created_utc": 1745873670.0,
      "score": 1
    },
    {
      "id": "mpjtwiq",
      "body": "maybe you should’ve worn protection",
      "created_utc": 1745874698.0,
      "score": 1
    },
    {
      "id": "mpjtyat",
      "body": "Unfortunately, you did sign up for this.",
      "created_utc": 1745874714.0,
      "score": 1
    },
    {
      "id": "mpjv7hf",
      "body": "You don’t want to have children so you can drink beer instead? Horrible excuse.",
      "created_utc": 1745875110.0,
      "score": 1
    },
    {
      "id": "mpjwk1o",
      "body": "When does it become rewarding? You shouldn’t have had kids if you expected to get something out of them. You should have had kids to bring them into this world and show them love and the pleasures this world has to offer (even though it’s honestly shit rn).",
      "created_utc": 1745875539.0,
      "score": 1
    },
    {
      "id": "mpjxr9m",
      "body": "Do you have any ME time ?\nDo you have anyone to hangout with ?\n\nCheck out your community center and local neighborhood house for support group and  programs that maybe helpful. \n\nHow long have you see this therapist ?\nIf it's a few years and nothing change then change another one.",
      "created_utc": 1745875925.0,
      "score": 1
    },
    {
      "id": "mpk0ne1",
      "body": "Those who truly don’t want kids will do anything to prevent it from happening.",
      "created_utc": 1745876898.0,
      "score": 1
    },
    {
      "id": "mpk2b5p",
      "body": "Regardless of how you feel, telling others to \"not have kids\" since your own experience is negative is just as bad of advice as it I posted \"just go and have kids\" as the subject line of a mental health post. \"I regret having kids\" is different than stating it in the imperative form for others. \n\nPersonally, I have never been happier or felt life was more beautiful than in having my own children, even when it's hard. And trust me, it's hard. I have a 2 year old and a 4 month old, plus I'm taking care of my aging and disabled mother. But we plan on most likely having another kid. Why? They are the most precious and incredible things in the world.\n\nI had no idea I'd feel like this before I had kids, ans contrary to what I see on the internet, nearly every parent I know has expressed something similar. I just figured that my husband and I love each other very much and he comes from a very close family, like even close with the extended family, that is like one of the kindest and happiest units of people I've met. I was kinda terrified of having kids but it just felt like \"the next step\" in ways I couldn't really describe and would fail to of I tried to explain rationally.\n\nI had no idea. None whatsoever. No idea how much I would love them. After my first was born - though pregnancy itself was rough - I described myself as having \"postpartum euphoria.\" I looked forward to each morning for the first time in my life, knowing that I'd get to see my little baby girl. I loved every minute of it, except some of those middle of the night wakeups.\n\nIf I'm having a bad day, if there are work things getting me down, even if I'm feeling annoyed with other family about something, the minute I see my kids...it all goes away. I look at them and just feel better about life, at peace in a way I've never felt, even when peace would seem like an absurd term to use between tantrums and crying and late nights and whatnot. I love talking to my little two year old, seeing how her little mind and personality and sense of humor have developed over time. I love my tiny 4 month old and how he's become the biggest squishy cuddle monster who always has a smile and laughs and just wants hugs and kisses, actually liking if you mush his cheeks.\n\nIt is hard and I am often exhausted, don't get me wrong, and I've had to set back some of my own goals related to the pace of my career. But that is okay. Even though I am doing for work something that I haveong dreamt of and love, nothing in the world comes close to the feeling I have for the human beings who are my children.\n\nI'm not saying it's wrong for you to feel otherwise. I try feel bad for you that your experience is so different than mine, that you haven't found in it that peace that it has brought me. \n\nI see that to you, it feels like they've \"taken\" something from you and that they're \"parasites.\" To me, I think that's where so much of the peace comes from: this recognition that my ego is simply that, an ego, and the ability then to be able to put my \"self\" aside in the focus on something higher than myself. It's a new state of maturity, like in graduating from high school to college, this is like graduation from self-centerdness to the freedom that comes from expanding beyond the ravenous and needy constraints of the ego.\n\nThat's my long schpeal for why, though you are suffering, I don't think you should declare as a statement to others that they should not do the thing that's causing your own suffering. For others, it's just the opposite, and many people simply have no idea how they will actually feel but will get influenced by social media posts that highlight only bad experiences or people's fears and the worst of it, say much like vaccines or birth control, causing a sociological niche default position of thinking of this one thing as a particular root of suffering, and thus possibly losing out on what may be one of the greatest sources of meaning, joy, and contentment one can ever have.\n\nI'm also someone who has suffered with mental health issues that I do not want to disclose on and off throughout my life, and I know others who have as well and feel similarly to me about kids - that it is freeing and liberatea you a bit from the self-obsession of ego, so i hope people don't read this and think \"oh well if I have mental health issues, perhaps I shouldn't have kids.\" Nonono.\n\nAnyway, maybe you can reframe some of your feelings to how I posed them, or just consider what that would look and feel like? To be able to let go of things you thought of once as needs and reevaluate what are your actual essentials to manifesting your sense of self and joy. Parenting shouldn't lead to the complete dissolution of the self, but rather a refinement of the self through learning what is ubessential and can instead be let go. And yes even after that winnowing there are periods where it doesn't feel we have enough time to even devote to those essential bits of the self, but perhaps that's what you can work on with your therapist. What is essential to the self vs what is an ego attachment that actually causes more harm than joy, and for that which is essential, how best to manage your time to assure that you can at least get some of it in to its maximized capacity?",
      "created_utc": 1745877480.0,
      "score": 1
    },
    {
      "id": "mpk2co3",
      "body": "Do activities with them. Bond over your favorite things. Mold them into mini versions of yourself...that sounds bad but some things I like are because my dad made a memory with me",
      "created_utc": 1745877494.0,
      "score": 1
    },
    {
      "id": "mpk2gl4",
      "body": "Well that isn't good advice for you to give everybody because most people I know have a hard time but love and enjoy having children. But I also can empathize and recognise you must be struggling and that is not at all uncommon or make you a bad father. But it is a cry for help and it could potentially make you raise them, even temporarily, in a way you may deeply regret. \n\nNot to mention you may psychologically damage them and hinder their development which will also make your role as a father even more burdensome on you. Though please don't let this add to your anxiety right now. \n\nIt's also ok to tell you kids that you are struggling but you love them and that you are working hard to provide them with a good life, home and upbringing but that you need some rest sometimes to recuperate. \n\nWithout knowing what's going on here's some thoughts. Sorry if this is too broad or obvious or just dot points with only vague ideas. Just trying to offer support and empathy. \n\nMaybe this won't at all help. But folks these days have lost something our parent's parents (or older) experienced with their children in that they aren't anything for a parent to mold or choose to have particular interests or personalities. They were more like other people in a sense but that's a terrible description really. \n\nYou just need to try and see yourself as a shepherd and if they have turned out to be bad/shitty adults then that's something that can happen even with good guidance. \n\nParenting isn't always a thing of \"the more you put in, the more you results/rewards you'll see\". At least not so much that is always noticeable. Especially in the short term. A lot of the time you may feel it unrewarding in some ways. Try to just be present with them and try not to expect anything in a broad sense. \n\nIf they are adults you need to set healthy boundaries in what you can accommodate for them while trying to support them to become self functioning. Though boundaries for younger children is also important. For you and them to enact in a fair and healthy and tailored way. \n\nOther than the fact that you did make the choice to have them you should also try and free yourself from some burdens that may be causing some of that resentment but also it must be done in a healthy way for you and them while you still provide them with support, love and guidance. Not giving these things will only make this worse in the long run. But also I understand in these hard times that that might not be possible. Especially financially. \n\nMost importantly if you have a partner there may be issues there that is adding to this mental anguish or maybe you just are strung out and tired. Which is very parenty of you. We are tribal creatures and we have lost the community of the tribe where children have many brothers, sisters, aunties, uncles and even other parental figures that are not blood. \n\nTry to communicate with and listen to your partner and definitely talk about this issue with them. \n\nIf you don't have a support network of friends and/or family then you should try and find folks to fill those roles, though you must also give as well as receive support. Groups can be found and you'll find you are not alone in this struggle you are going through. \n\nWhile you should try to find ways to relax and enjoy some spare time if possible don't treat it as a place you're dying to run to for escape. Try to enjoy those moments when there but chasing the escape will easily become habit forming and addictive as fuck. Don't seclude yourself in some man cave and neglect your responsibilities and the enjoyment of being a father but try to find ways to enjoy yourself. Though again. Economically, times are tough for most of us right now in the west. \n\nA few quiet ones, a joint, gummies, a cigar are fine if that's your thing but don't treat them as tools of escapism either as you could very well start abusing them as unhealthy coping tools and even spiral or do something very bad. \n\nTry and find ways to enjoy your time with your children that you can do as a family. Kids can't always reach goals you set or even they themselves may be at certain stages of development where they are angsty or even wishing to be left alone or seek their own identities or freedoms and so you may feel the bond is breaking and even that it's feeling unrewarding but try to show them you love them and respect their desires for such things and offer them your love and guidance. These are usually phases. Sometimes long phases. But phases nonetheless. \n\nIf it's just that you miss your own freedom try to not hold onto the idea that life is over now. It isn't. You have much free time ahead of you in the future and even if it's burnout, getting help in any of the many ways will show you that this you are experiencing is also a phase. But you really should get into therapy if you can. Highly encourage you to. \n\nIf you are raising children that have physical or mental difficulties then you need to find support from folks that are experiencing the same thing. Again groups are always around to join and meet new people. This can be very draining and you do need to find ways to cope and learn. Read up on things etc. \n\nThere also may be just something going on chemically in your brain that is causing depression or anxiety and again you need to see a doctor and a therapist for treatment if that's the case. \n\nThings might seem ominous now, but what you're going through is very common and most folks pull through and look back and they see how much they've changed and become happier and less depressed once they work things through. But you need to find a way to do this, but you need to put the effort into finding those things out. Even do so totally out of your own selfishness to just want to feel better for your own sake. That'll help the family anyways. \n\nLastly. If you are in a bad mental state and you are going to physically or emotionally hurt your children then you need to tell those closest to you ASAP and get yourself professional help. This will not help you in any way and only make things drastically worse for you. If you are really scared about this you may want to even check yourself in somewhere. \n\n\nAgain. Sorry if this is vague and cliche. Long day for me and my head is frazzled but I just wanted to at least help you see that there's lots of things you can do from here and also that what your feeling is natural and you WILL overcome this. I promise you that you have not at all doomed your life. You've identified some very real issues and that's very good because you know at least what is at the least, partly causing your stress and anxiety and that's healthy and the first step to getting back on track and sound of mind again. \n\nAnd hey. Kids are fucking little (and big) shits a fuckload of the time too so who doesn't want to drive their family off a cliff sometimes. \n\nPS: Do NOT drive your family off a cliff.",
      "created_utc": 1745877530.0,
      "score": 1
    },
    {
      "id": "mpk3ozd",
      "body": "I’ve got 4 kids. Two of which are under two. It’s rough. The days of beers with the boys are few and far between. I like to take small moments of my day and just enjoy the moment. Also baseball is nice. It’s something out of body that I can look forward to watching.",
      "created_utc": 1745877944.0,
      "score": 1
    },
    {
      "id": "mpk4xoy",
      "body": "Have a beer with the boys. My partner looks after the kids while I have a break and I do the same for my partner. It sounds like you need a bit more balance in your life.",
      "created_utc": 1745878361.0,
      "score": 1
    },
    {
      "id": "mpk6qyq",
      "body": "Still don't understand why people who say they don't want kids are told to 'think things over because they might regret', while people who say they do want kids are uncritically cheered on, no matter whether they are ready for it or not.",
      "created_utc": 1745878977.0,
      "score": 1
    },
    {
      "id": "mpk718t",
      "body": "You'll need a major life style change. That's not easy. Talk to your wife about it, tell you you're feeling burnt out and overworked. Right now it feels like you hate your kids but that's just the burn out I promise. When you do hard things for the benefit of someone else and you start to hate that thing, you're gonna start to hate that person. It feels impossible to get a break but try your best to get some down time. Talk to your partner, and hell if your kids are old enough talk to them. Not a \"I sacrifice everything for you\" lecture, just a conversation about how you want some time to relax and maybe talk about them contributing more to the household. You're not a bad person, just a tired one.",
      "created_utc": 1745879073.0,
      "score": 1
    },
    {
      "id": "mpk9osp",
      "body": "You're allowed to be you, and it's not wrong that you want your life to be different. There's a sense of loss and maybe grief I'm picking up? Im sorry if im totally off base. But you do need time for your boys and a beer. Is there a way to fit it in so you have time to just be you? To give your mind a break from the demands of life.",
      "created_utc": 1745879985.0,
      "score": 1
    },
    {
      "id": "mpkbd4t",
      "body": "Go. To. Therapy. GO. TO. THERAPY.\n\n\nThat thinking isn't helping you, and it certainly isn't helping them.\n\n\nWhether you planned them or they were accidentally conceived, they're people who deserve their dignity and common courtesy.\n\n\n\nAs their parent, it's your responsibility they grow up well adjusted to get along with the rest of society. I'm sorry you feel this way about them, but they are your responsibility.\n\n\nIf you need some help, tell your partner, reach out to their grandparents, uncles, or aunts. Hire a babysitter to get some evenings to yourself.",
      "created_utc": 1745880555.0,
      "score": 1
    },
    {
      "id": "mpkbp8d",
      "body": "I feel so sorry for your kids.. and you. \n\n\nAlso, many people who don't have kids feel like all they do is work and sleep too. \n\n\nIts not like your dream of going out and drinking beer is out of reach.  Ask your family to help watch them or hire a sitter. ",
      "created_utc": 1745880670.0,
      "score": 1
    },
    {
      "id": "mpkc1bh",
      "body": "You should talk to a psychologist or therapist and keep changing until you find the right one. Your feelings are valid and you need to talk to someone that can help you understand why you feel like this. Did you struggle with depression before having them ?",
      "created_utc": 1745880784.0,
      "score": 1
    },
    {
      "id": "mpkg641",
      "body": "This is a lot more common than parents are willing to admit. I think it’s courageous of you to speak your mind and vent here. I think it’s completely valid to go through these emotions. I wonder if there is something deeper going on that is being projected onto the kids. If there isn’t, it’s still valid and okay. I’m sorry that this is your experience as kids are permanent and my heart goes out to you. Hang in there, come up for air when you can, create moments in your life where you can find rest and joy- if that seems impossible, keep trying til you make it possible.",
      "created_utc": 1745882206.0,
      "score": 1
    },
    {
      "id": "mpkkhdw",
      "body": "I feel worse for your kids than I do for you. They have no choice in this. You had a choice twice, now you regret your choices. Do you not have other friends who are fathers who actually like their kids? If not, I suggest befriending some",
      "created_utc": 1745883678.0,
      "score": 1
    },
    {
      "id": "mphqyzi",
      "body": "Lots of feedback coming through, will add my 2c because I’ve struggled with depression and relationship with my kids for years\n\nDon’t beat yourself up for how you feel. And don’t let anyone else beat you up. No one can help how they feel and no one (especially you) should judge you for how you feel\n\nTalk to a therapist, they can help you work through the feelings\n\nIgnore all this trash about “you shouldn’t have had kids then”. Worthless thinking about that, you are where you are.\n\nHaving kids is super hard especially without much help. Don’t let all the “perfect” parents on social media get you down. \n\nYou MUST find ways to take breaks, do whatever it takes. There will be consequences, but I expect it will be worth it. I know it’s cliche but “you can’t pour from an empty cup”",
      "created_utc": 1745852377.0,
      "score": 1
    },
    {
      "id": "mpi42fk",
      "body": "This is a crystal clear reminder why I never, ever wanted children.",
      "created_utc": 1745856296.0,
      "score": 1
    },
    {
      "id": "mpht5km",
      "body": "You shouldn’t need help, there’s something just wrong with you. Kids are a blessing and you shouldn’t resent yours.",
      "created_utc": 1745853044.0,
      "score": -6
    },
    {
      "id": "mpi0w6o",
      "body": "Felt. Kids suck and I can't stand them which is why I will never have them",
      "created_utc": 1745855356.0,
      "score": -5
    },
    {
      "id": "mphpo7l",
      "body": "Many people feel like op- it’s not uncommon. Maybe less so to speak your truth but that is honest and should be respected. So many people just go through the expected motions of life and how they will impact everyday.",
      "created_utc": 1745851979.0,
      "score": -4
    },
    {
      "id": "mpjlrgu",
      "body": "Thats why i never plan to have kids. They are disgusting and steal all of ur time and energy. I never saw them as anything more than parasites. And as a girl i aint ruining my body too for some foul creatures. \n\nTho I belive that every child deserves to have a great life but not everyone deserves to be a parent.",
      "created_utc": 1745872228.0,
      "score": -3
    },
    {
      "id": "mpjxzx4",
      "body": "Can I ask a couple questions?\n\nI had similar albeit not as extreme emotions towards my family for a while before things changed.",
      "created_utc": 1745876002.0,
      "score": 0
    },
    {
      "id": "mphe5cg",
      "body": "This is sad to read. You just gotta have that beer and friends on Friday, Saturday, and Sunday night respectfully no matter what. When the work is done, then you must go out and play. I learned this as a kid. Even if I didn’t want to go out and play I had no choice even if it was 30 minutes. Same applies as my adult life.",
      "created_utc": 1745848340.0,
      "score": -5
    },
    {
      "id": "mpkl12h",
      "body": "There are a lot of couples that want kids but they can't, and you don't want yours.\n\nIt seems like an easy problem to fix.",
      "created_utc": 1745883864.0,
      "score": -2
    },
    {
      "id": "mphn8a9",
      "body": "21 w no kids",
      "created_utc": 1745851232.0,
      "score": -5
    },
    {
      "id": "mphdpb8",
      "body": "Im in therapy, ive been there for a few years now. It helps but i still crash out like this from time to time. I do it in private, cant let them see me like this. Im not allowed to be like this anyway.",
      "created_utc": 1745848192.0,
      "score": 185
    },
    {
      "id": "mpiufvb",
      "body": "Most sane comment here. 👏🏼",
      "created_utc": 1745864010.0,
      "score": 42
    },
    {
      "id": "mpkl373",
      "body": "100000000000% can’t sum it up better myself",
      "created_utc": 1745883884.0,
      "score": 11
    },
    {
      "id": "mphfrag",
      "body": "10 years and still an unanswered question. I wanted to wait so we could get better jobs and a more stable life. That was deemed unimportant when descissions were made.",
      "created_utc": 1745848864.0,
      "score": -52
    },
    {
      "id": "mphfh7f",
      "body": "Protection didnt protect, descission was made against my wishes and advice. If I left id have them anyway and be worse off.\n\nIm also VERY aware its not healthy. I wish i didn't feel this way about it and the situation was different. Lack of stability seems to be the root cause, addressing that has become increasingly difficult as time goes on.",
      "created_utc": 1745848775.0,
      "score": -28
    },
    {
      "id": "mphfrqj",
      "body": "I can't go on that subreddit bc it makes me hate people so much. I wouldn't recommend it to anyone bc I think it's a cesspool of sociopaths trying to shake off all accountability and ruining their poor childrens' lives in the process",
      "created_utc": 1745848869.0,
      "score": 176
    },
    {
      "id": "mphhrqp",
      "body": "The link doesn't go anywhere was the subreddit nuked?",
      "created_utc": 1745849520.0,
      "score": 7
    },
    {
      "id": "mpkhcwh",
      "body": "I was looking for this comment. It'll probably be really helpful if you talk with other parents in the same situation op🖤",
      "created_utc": 1745882612.0,
      "score": 3
    },
    {
      "id": "mph5e8w",
      "body": "There is no regret, i didnt want either of them to begin with. I explained the finances, living conditions, the detriment to our lives it would cause. All sound reasoning Ignored though, and it was decided for me  based off the thinking of \"wouldnt it be cute though\" and thats it. No consideration for the future, each other, out lives, absolutely NOTHING. Hindsight proves i was right all along and now its my job to fix it. im so sick of peoples lack of forethought, accountability and straight up ignorance. Now im stuck here. a dried out husk of a person i once was doing my best not to show how absolutely dead and tortured inside i am because of this, just so the kids can have some sort of childhood. Its not their fault, its ours.",
      "created_utc": 1745845246.0,
      "score": -101
    },
    {
      "id": "mphitca",
      "body": "I agree with you 100%. I did not understand from the way this person wrote the post if they feel hatred and they show it towards their children or if just they feel exhausted and those emotions are internal without them being externalized. In case they are externalized and kids feel that, then this is a serious problem. When you decide to bring into this world a child you have to be ready to do your best. I personally do not want a child but if something crazy/weird/bad happened and I got pregnant and could not have abortion I would just do my best. Making the children feel that they are the cause of your depression is a burden that they will carry with them forever. When children get this sense of ''my parent is sacrifised for me'', they carry it forever.",
      "created_utc": 1745849849.0,
      "score": 4
    },
    {
      "id": "mphd03c",
      "body": "6 years ago the feelings began to be apparent. My heart was still full of the youthful spirit and go get em attitude. My way of life was stolen. my carefree attitude, my hobbies, my social life, my income, my self esteem, my hopes, my dreams, my ambition, my goals, my plans, my friends, my standard of living, my mental and physical stamina. All gone in about 6 months. i didnt realise i was pretending it was fine until years later. So I scrape cash together to see a shrink, get diagnosed with the spice i wasnt aware of, get the meds for it. Trying to address these feelings of resentment like and adult so i can be and do better. The meds made me more aware of the situation tho, more aware of how treacherous the hellscape were in is. So i sack up and push through and pursue a better life only to have it snached away a second time. Things are worse now though, I don't have the ignorance or energy of my youth anymore and the patterns are repeating.",
      "created_utc": 1745847959.0,
      "score": 1
    },
    {
      "id": "mphemfh",
      "body": "Why do you think i made a burner acc?\n\nI also am getting professional help.",
      "created_utc": 1745848496.0,
      "score": 4
    },
    {
      "id": "mpiqb1m",
      "body": "Truth is that, even though this comment is naive, even though you can't just \"stop feeling that way\" you have to pretend that you can. \n\nYou will fuck up your child's mental health, emotional regulation- their entire life, basically- by making it clear that you hate them and didn't want them, and by ruining that relationship it's only going to make the resentment worse except now it'll be reciprocated. \n\nWe have extensive evidence about what happens to kids who grow up in hateful homes. Give them up to the state or put on a brave face while you work on your issues.",
      "created_utc": 1745862792.0,
      "score": 90
    },
    {
      "id": "mphou1k",
      "body": "What helpful advice that has always been so useful in every mental health situation. “Don’t do that.” \n\nProblem solved.",
      "created_utc": 1745851723.0,
      "score": 1219
    },
    {
      "id": "mphtwu2",
      "body": "r/thanksimcured",
      "created_utc": 1745853275.0,
      "score": 69
    },
    {
      "id": "mphz16e",
      "body": "I’m depressed\n\nOkay well don’t be. \n\nWow. Thank you. 😂",
      "created_utc": 1745854807.0,
      "score": 119
    },
    {
      "id": "mpk774g",
      "body": "Literally. Ideally try to work on it but, if it's going to be put towards anyone, redirect that resent towards yourself (OP) lmao.",
      "created_utc": 1745879129.0,
      "score": 6
    },
    {
      "id": "mphz9ns",
      "body": "It's just that easy   /s",
      "created_utc": 1745854875.0,
      "score": 8
    },
    {
      "id": "mpk6tue",
      "body": "I assume you don’t have kids.",
      "created_utc": 1745879004.0,
      "score": 0
    },
    {
      "id": "mph93ki",
      "body": "Kids are 9yo and 6mo. Thats the thing tho i dont/cant get those 2 days i need. Family doesnt want a bar of anything apart from using them for insta clout if/when they visit. Friends are just as bad. Were on our own, the mrs has gaslit herself into thinking we have support. We dont. Its just us, the 2 of us. Days off work is just tagging in and out of having a nap. The catastrophy i foresaw using basic common sense has come to be. There are no date nights, days off, time for ourselves, holidays, hobbies. Its just unrelenting endurance that in 20 years time will either have one of us dip out from the relationship or life caus the jobs done or create a disgusting rift between all of us. But how cute right? I love being shackled like this, having a metaphorical bat taken to my legs then told to run. The cherry on top being, everyone complains I can't run after doing this. Then baffled disbelief that i was right. Its just us, walking through the dark night of life. Cold and weary, because it was easier to ignore the reality of what was to come.",
      "created_utc": 1745846596.0,
      "score": -27
    },
    {
      "id": "mpiu8z3",
      "body": "says in other replies that one is 9 and the other was born 6 months ago\nedit: typo",
      "created_utc": 1745863953.0,
      "score": 3
    },
    {
      "id": "mphld3t",
      "body": "100% kids suck sometimes!!! Especially when you have a mega lazy partner drives resentment. But you gotta peel that back structure conversations ask and demand where needed and if all else fails. Walk away form that lazy person.",
      "created_utc": 1745850652.0,
      "score": 0
    },
    {
      "id": "mpisipl",
      "body": "Wow I guess there really is a sub for everything.",
      "created_utc": 1745863436.0,
      "score": 3
    },
    {
      "id": "mpk6gen",
      "body": "If you say they are a parasite, then they can and will say it to others. > Exactly this, if nothing changes, these children will end up becomming Ayn Rand devotees in the future",
      "created_utc": 1745878878.0,
      "score": 1
    },
    {
      "id": "mpivlwe",
      "body": "He's said 9 and a baby who's a few months old.",
      "created_utc": 1745864357.0,
      "score": 1
    },
    {
      "id": "mpiqmu0",
      "body": "In the future, your kids might go through something, and even though you hate the situation, you'll realise that you do care for them, atleast a little bit. First, you'll hate everything, wonder why you have to deal with this....but eventually, before something happens, you'll realise. I'm sorry for being vague, but I knew my parents hated me, untill I ODd and died for the first time, they said \"why would you do this to us, what'd we do\" and that was the issue, nothing. Take time to find things that both you and your kids enjoy, so it doesn't feel like such a chore. Listen to music you enjoy, so they think of you when they hear the song. Talk about your childhood, so they know what to do and what not. Isn't that the joy of having children, you get to help build this little human into something wonderful then send them off to do whatever they want. I'm not saying \"just dont\" but please find a way to appreciate them somehow before they're gone, and you can't bring them back.",
      "created_utc": 1745862886.0,
      "score": 1
    },
    {
      "id": "mpj2bq0",
      "body": "Get over yourself. Children are a blessing to those who WANT that blessing. You’re another brainwashed person who thinks there’s only one job for a woman and that is for her to have children. You’re incorrect.",
      "created_utc": 1745866364.0,
      "score": 2
    },
    {
      "id": "mphugv5",
      "body": "And when does mum get the same? Unfortunately when you have kids your social life takes a hit. Yes OP should definitely make time to see friends but it can’t be the priority",
      "created_utc": 1745853445.0,
      "score": 7
    },
    {
      "id": "mpiks2z",
      "body": "Then he can divorce and give her full custody or only have the kids 2 days a week. Better than having them and the children living with him when he clearly hates them. Children can feel the resentment, I’m sorry I don’t feel bad for him. He’s selfish, he said he does speak to a professional, they likely aren’t telling him about accountability which he lacks but only puts accountability on his wife. Unless a woman doesn’t want kids why marry her? If you know you had unprotected sex and she can get pregnant she will obviously keep them. There’s so many selfish pieces of shit who kill their kids and family because they hate having them. Just divorce, give full custody, pay child support and let her find a better man. Those children didn’t choose to be born and have a selfish father who hates them.",
      "created_utc": 1745861205.0,
      "score": 1
    },
    {
      "id": "mphkkx6",
      "body": ">cant let them see me like this. Im not allowed to be like this anyway.\n\nThey know. The oldest knows. Your wife probably knows.",
      "created_utc": 1745850409.0,
      "score": 471
    },
    {
      "id": "mphz5pg",
      "body": "Let’s get rid of the “I’m not allowed to show emotion” mindset. That’s so so so so so so unhealthy.",
      "created_utc": 1745854844.0,
      "score": 117
    },
    {
      "id": "mphr6ys",
      "body": "I think the fact that you don't allow yourself to be like this is the issue here. \nIf you keep the façade up your whole life you are never going to create any opportunity to construct something better for you with the people who make up your close environment.\n\nI am understanding that right now you have a lot more to deal with than you bargained for and that makes you unhappy with your life, and you feel trapped because you do not have the kind of relationship with your close family where you support each other whichever way, so you are alone with the problem.\n\nI would suggest to be assertive with what you are feeling and talk about it, don't be aggressive, keep calm even if people take it personally and start shouting. Make all of it a \"you and your family against issues\" effort, do not try to assign blame and designate who should try harder to fix everything.",
      "created_utc": 1745852444.0,
      "score": 39
    },
    {
      "id": "mpin5rk",
      "body": "You're probably not masking it nearly as well you think you are.",
      "created_utc": 1745861890.0,
      "score": 34
    },
    {
      "id": "mpiolt0",
      "body": "“Crash out” “beers with the boys” how old are you?",
      "created_utc": 1745862306.0,
      "score": 59
    },
    {
      "id": "mpity7x",
      "body": "If you're not letting them see you sad, are you not allowing them to see you happy either? Because if you're not, *that's* where you're robbing *yourself* of bonding with them. Happiness is found in *moments*, it's not a destination.",
      "created_utc": 1745863862.0,
      "score": 9
    },
    {
      "id": "mpjgaql",
      "body": "Lol internet isnt private.",
      "created_utc": 1745870590.0,
      "score": 2
    },
    {
      "id": "mpjyxrs",
      "body": "“i’m not allowed to be like this” is incredibly immature.",
      "created_utc": 1745876305.0,
      "score": 2
    },
    {
      "id": "mpkciyb",
      "body": "Do you find the person is helping? If you don’t reckon so or feel kind of invalidated I would recommend changing until you find one that helps you understand why you feel this way. There might be traumas or something underneath. Feel free to message me",
      "created_utc": 1745880949.0,
      "score": 1
    },
    {
      "id": "mphpbwh",
      "body": "Have you tried shroom therapy?",
      "created_utc": 1745851875.0,
      "score": -5
    },
    {
      "id": "mphlng7",
      "body": "[deleted]",
      "created_utc": 1745850742.0,
      "score": -40
    },
    {
      "id": "mpjbhnu",
      "body": "I couldn’t agree more. Everything said was spot on and I hope OP takes this particular post seriously",
      "created_utc": 1745869147.0,
      "score": 17
    },
    {
      "id": "mphh0lb",
      "body": "reading the other replies, you say you had a second child just 6 months ago. how come you repeated the same mistake?",
      "created_utc": 1745849276.0,
      "score": 103
    },
    {
      "id": "mpiaoj1",
      "body": "Why didn’t you get a vasectomy?",
      "created_utc": 1745858270.0,
      "score": 41
    },
    {
      "id": "mphhhdn",
      "body": "Sounds like you really need to take control of your own life. If protection didn't protect (are you using both birth control AND condoms? Or just condoms?) I'm honestly surprised why you didn't get a vasectomy or something after the first one. To keep having sex with a woman knowing damn well she would never agree to an abortion is not really a smart decision, I'm sorry to say ...\n\nDoes she know how you feel? Does she feel the same or is she still stuck in, \"haha look how cute\" land? Has couples therapy ever come up? A support group for parents in a similar boat to you, maybe you should look for one.\n\nYou aren't a bad person, but you made some really dumb choices so please don't take it out on the children that you brought into this world.\n\nThis was my family life growing up and I WISHED my parents would have gotten a divorce. I think I would have been a lot less fucked up had they divorced and peacefully co-parented.",
      "created_utc": 1745849426.0,
      "score": 92
    },
    {
      "id": "mphi69i",
      "body": ">descission was made against my wishes and advice\n\nStop. It wasn't. For your own mental health you need to come to terms with the fact that you were not trapped and that you are part of that decision, unless you were r\\*ped and it does not look like it's the case. Whenever you have sex you take the risk. You lower it, but it's never zero, with protection. It's most certainly not zero if you rely on the pill, which too many couples do.\n\nOne accident happens. The second, especially **years later**, is no accident. You could have separated, you did not. You could have had a vasectomy, you did not. You could have stopped having sex, you did not.\n\nYou also chose and you need to come up to terms with your decision.",
      "created_utc": 1745849649.0,
      "score": 308
    },
    {
      "id": "mpjfamv",
      "body": "I feel for you, and nothing can change the past and that's a hard lot. I'm very grateful for my abortions because I know I'd have fucked  up bad as a parent and been in the same place as you. For your own sake, you have the ability to control future outcomes if you get snipped. I know several people who have had it done and have zero regrets.",
      "created_utc": 1745870298.0,
      "score": 7
    },
    {
      "id": "mpkj6tw",
      "body": "Unless you were raped, it was YOUR decision.",
      "created_utc": 1745883236.0,
      "score": 7
    },
    {
      "id": "mpi385t",
      "body": "Majority of the posts are definitely **bad**, but I remember seeing a couple decent ones where people genuinely sought advice on how to deal with their child/children and how to be a better parent. Perhaps showing this to someone who didn’t want children from the very beginning wasn’t the best idea 😭 I thought his hatred towards them grew over time until I read one of his replies",
      "created_utc": 1745856044.0,
      "score": 33
    },
    {
      "id": "mphzoxe",
      "body": "I went on the sub and searched up \"autism\". Half of the people there are just evil.",
      "created_utc": 1745855001.0,
      "score": 106
    },
    {
      "id": "mphtmmb",
      "body": "I only became aware of that sub a few days ago and the intense rage I feel for every single one of those \"parents\" is unreal.",
      "created_utc": 1745853189.0,
      "score": 49
    },
    {
      "id": "mpjm1qq",
      "body": "i just saw that subreddit and makes my blood boil. it's so painful, i have no words. I don't want to have kids myself because it's such a big responsibility and seeing other humans take this lightly, bring innocent souls into this world, and then mistreat them and traumatize them is just pure unfairness. nobody deserves to grow up neglected and abused. i pray for the children of such parents.",
      "created_utc": 1745872313.0,
      "score": 10
    },
    {
      "id": "mpiwxq6",
      "body": "Their victim mind is horrible af…",
      "created_utc": 1745864755.0,
      "score": 14
    },
    {
      "id": "mpjq7wc",
      "body": "Why? Because they don't like being parents?",
      "created_utc": 1745873556.0,
      "score": 0
    },
    {
      "id": "mpho1z1",
      "body": "Link was typed incorrectly. r/regretfulparents",
      "created_utc": 1745851484.0,
      "score": 16
    },
    {
      "id": "mpi3gad",
      "body": "Yeah sorry I edited it. I copied + pasted it and removed the last bit of the link thinking it would work but apparently not 🫠",
      "created_utc": 1745856111.0,
      "score": 4
    },
    {
      "id": "mph9tlp",
      "body": "Well...\n\nSpeaking of accountability...",
      "created_utc": 1745846854.0,
      "score": 138
    },
    {
      "id": "mpho959",
      "body": "I feel really shitty speaking in an accusatory tone at someone experiencing mental health distress, but this seems like it was the easiest decision in the world and yet you made the opposite decision. Fine, you made a mistake. But then, after having a child, you did it AGAIN! You now KNEW you hated your choice. \n\n>it was decided for me \n\nThis. This is your lack of accountability. You end by saying it takes two to tango, but you say you didn't make the decision. Did your family pressure you? Your partner? Did she know you didn't want kids but pushed you to do so? \n\n>Hindsight proves i was right all along and now its my job to fix it. im so sick of peoples lack of forethought, accountability and straight up ignorance.\n\nYou're sick of other people's lack of forethought, accountability, and ignorance... OTHER people? You also shouldn't prove yourself right that you absolutely hated an idea when that idea is a human life. And then, what? Realize how horribly wrong you were and... do it again? I'd really love some kind of context here. \n\n>There is no regret, i didnt want either of them to begin with\n\nDo you often do things you have every reason to not do and no reason to do and the ability not to do? You did it, wish you hadn't more than anything. That's regret. Just because you didn't want to in the first place doesn't make it not regret, it just makes it nonsensical.\n\nMy dad had only ever been with my mom. Neither wanted kids. Then, according to my dad, one day she wanted a kid. He did not want to lose her, so he stayed in the relationship. Apparently they spent a year in couple's therapy over this. Ultimately they had me because my dad wanted my mom to be happy. And my dad loved me and loved that love until I expressed my desire to not want to be alive anymore at age 9 (two mentally ill people having kids was a shitty idea, gotta say!). He still loves me, but describes the period of time since then as \"worth the first 10 years of my life and his relationship before they had me.\" \n\nAccording to my mom, I was wanted by both of them and he's full of shit. The therapy was over a lot of other problems (maybe don't have a kid then!).\n\nI'm not having kids. My partner doesn't want kids. If she ends up wanting kids one day, I will have to leave my soulmate. We will simply want two different lives.\n\nSo please, give context as to how it was decided for you. Twiiiiice.",
      "created_utc": 1745851546.0,
      "score": 36
    },
    {
      "id": "mphaesk",
      "body": "Having children should not be a unilateral decision. Were you reproductively coerced? You should look into sterilisation if you do not want to have any more kids.",
      "created_utc": 1745847064.0,
      "score": 57
    },
    {
      "id": "mphcach",
      "body": "did you do the deed? well if so womp womp",
      "created_utc": 1745847718.0,
      "score": 43
    },
    {
      "id": "mphnk20",
      "body": "If it’s *this* bad and not an issue of some form of postpartum depression, then consider giving up your parental rights. It’s one thing to have regrets or feel overwhelmed by the reality of fatherhood. It’s another entirely to have never wanted them in the first place. A loving stepdad would be more beneficial for these kids than you.",
      "created_utc": 1745851331.0,
      "score": 23
    },
    {
      "id": "mphw0mk",
      "body": "Leave. Leave the kids to be with a parent who actually gives a shit about them. None of your children asked to be born. YOU made the decision to procreate and YOU are supposed to be a grown adult. \n\nLeave the environment your children live in, because the eldest can definitely sense the resentment towards his existence and no child deserves to be made to feel like that. \n\n> im so sick of peoples lack of forethought, accountability and straight up ignorance.\n\nAre you for real? Where is yours? Your eldest is going to be discussing the way his father made him feel with a therapist in later life as it is, you want to keep adding to it once he becomes a teenager? A young man?",
      "created_utc": 1745853912.0,
      "score": 21
    },
    {
      "id": "mphfr9m",
      "body": "Next time just don't have sex my guy",
      "created_utc": 1745848864.0,
      "score": 29
    },
    {
      "id": "mphi94u",
      "body": "Can’t say I haven’t known thousands that have the same decision making skills unfortunately.",
      "created_utc": 1745849673.0,
      "score": 6
    },
    {
      "id": "mphdyh6",
      "body": "Wrap your willy lol",
      "created_utc": 1745848276.0,
      "score": 20
    },
    {
      "id": "mpi2ozu",
      "body": "With all due respect, did you consider ending the relationship? I don't mean that in a sarcastic way I mean WAS there an opportunity? Like if you were married and struggling financially I can understand seeing divorce as simply not an option to consider or even ending a relationship if you've got joint ownership of a place",
      "created_utc": 1745855887.0,
      "score": 3
    },
    {
      "id": "mpj0cs2",
      "body": "You should 100% leave your family. Doesn't sound like you are in a good place and its better for you and them to be apart for now.",
      "created_utc": 1745865776.0,
      "score": 3
    },
    {
      "id": "mphovej",
      "body": "I’m not sure this will help you, because you are suffering, but it is very possible you would still be extremely depressed without the children. Mental illness like depression can make you dissatisfied with EVERYTHING, and your mind will fixate on some reason why. I was so obsessive and regretful when I was depressed. \n\nHumans are fickle creatures, especially when depression is thrown in. You might find have yourself extremely miserable at some later point of your life, seeing other people and their children and feeling regret that it was too late to have them. \n\nTry to find meaning in them. There are easier and more difficult periods, but if you try to know them as small people, you will realize they are unique individuals who can ultimately add beauty to your life.",
      "created_utc": 1745851735.0,
      "score": 4
    },
    {
      "id": "mpi0gzo",
      "body": "It seems you may have consciously made the decision to be with a person who doesn’t give a fuck about you. That’s an issue. You had children with a person who doesn’t care how you feel. There are ways out of this.",
      "created_utc": 1745855231.0,
      "score": 3
    },
    {
      "id": "mphelu0",
      "body": "If this started with your first kid why did you have a second????",
      "created_utc": 1745848491.0,
      "score": 50
    },
    {
      "id": "mphn3yi",
      "body": "These are all things women have to consider before ever getting pregnant. It unfortunately seems like you didn’t consider what actually goes into raising 2 other human beings before you had them…..",
      "created_utc": 1745851195.0,
      "score": 22
    },
    {
      "id": "mphqmxf",
      "body": "Don’t let anyone make you feel bad. Reddit is literally there to discuss whatever you want and these people have no problem replying.",
      "created_utc": 1745852275.0,
      "score": -34
    },
    {
      "id": "mpixrnz",
      "body": "Yeah. It's not as easy as just deciding to not have those feelings - but you do need to recognize that you can't take those feelings out on them, and take responsibility for having your kids in the first place.",
      "created_utc": 1745865002.0,
      "score": 25
    },
    {
      "id": "mpjfzdo",
      "body": "This needs gold tbh",
      "created_utc": 1745870503.0,
      "score": 3
    },
    {
      "id": "mphprse",
      "body": "No I get what he means though whilst it’s not as easy as just saying don’t resent them, it’s also important OP remembers their kids also didn’t ask for this. And they deserve a loving home and not to feel resented.",
      "created_utc": 1745852010.0,
      "score": 667
    },
    {
      "id": "mpjihju",
      "body": "Lmao!  Or \"it'll be worth it, you just gotta push through\".",
      "created_utc": 1745871258.0,
      "score": 11
    },
    {
      "id": "mpk85p7",
      "body": "[Bob Newhart knew this a while ago](https://youtu.be/aAhA7KfbJgg?si=CWxguMIeCFBo-etr)",
      "created_utc": 1745879456.0,
      "score": 1
    },
    {
      "id": "mpi7fqd",
      "body": "Mom?? Is that you??",
      "created_utc": 1745857310.0,
      "score": 42
    },
    {
      "id": "mpiajpy",
      "body": "Why didn't I think of that sooner?? Now I can stop taking all of my meds!",
      "created_utc": 1745858231.0,
      "score": 24
    },
    {
      "id": "mpk82t2",
      "body": "Im 15 i am the kid. If i were to hear my parents resented me for just being born which is not my fault id forever feel like a burden id feel not worthy of anything \n\nDo you know how much damage this could do to a child?\n\nWhat would you feel like if your parents thought of you as nothing but a Parasite, something to resent.\n\nOP could've said hes not used to not having free time. Parenthood is no joke and i know that, but these are kids \n\nOP has two kids one 9 and the other some months old why would he have another if he already resented the first one\n\nI think he should think better.",
      "created_utc": 1745879429.0,
      "score": 3
    },
    {
      "id": "mphbnab",
      "body": "Were you forced into having children? 😭 im a bit baffled",
      "created_utc": 1745847499.0,
      "score": 62
    },
    {
      "id": "mpi19wm",
      "body": "So your “basic common sense” told you that having another kid would be unworkable, therefore you…had another kid? You made the decision to have a second kid less than two years ago and after already being experienced as a parent. If you didn’t think it would pan out, why did you do it? I’m not asking this to lambast you over past choices, I think this is something you really need to understand about yourself.",
      "created_utc": 1745855469.0,
      "score": 16
    },
    {
      "id": "mpju9do",
      "body": "Why isn't hiring a babysitter to get you both some obviously very needed time to yourselves an option?",
      "created_utc": 1745874810.0,
      "score": 7
    },
    {
      "id": "mphybal",
      "body": "Who says mom isn’t doing the same?",
      "created_utc": 1745854596.0,
      "score": 2
    },
    {
      "id": "mpi6on5",
      "body": "As an oldest kid, yes we know. We notice everything",
      "created_utc": 1745857086.0,
      "score": 335
    },
    {
      "id": "mpi96vk",
      "body": "Yeah, kids always know even if you try to hide it. They hear everything, they notice changes, facial expressions, ECT.",
      "created_utc": 1745857828.0,
      "score": 91
    },
    {
      "id": "mpi9d74",
      "body": "It's really bad for the kids too. Have emotions, tell them why, let them watch you recover.",
      "created_utc": 1745857880.0,
      "score": 58
    },
    {
      "id": "mpk83v6",
      "body": "His age doesn't matter, his emotional maturity is teenage.  He could be 47 and have toddlers, this is how they can make you feel when you're already low.",
      "created_utc": 1745879439.0,
      "score": 24
    },
    {
      "id": "mphzjeh",
      "body": "I’m sorry that you’ve been made to feel this way. If you feel like women use your pain and emotion against you, I’d highly recommend better people in your life.",
      "created_utc": 1745854956.0,
      "score": 15
    },
    {
      "id": "mphnobh",
      "body": "this isnt true in my experience. is it actually true in yours?",
      "created_utc": 1745851367.0,
      "score": 12
    },
    {
      "id": "mphq3fp",
      "body": ">This was my family life growing up and I WISHED my parents would have gotten a divorce. I think I would have been a lot less fucked up had they divorced and peacefully co-parented.\n\nI wished my dad left when my mom wanted a kid and my dad didn't and couple's therapy didn't help! What cowardice. Although this account of things is just my dad. My mom insists he wanted me too and he's so full of shit.\n\nI'm 40 and my dad still says the only way he can help his mental health (when we suggest therapy or medication) would be to leave us, but \"he wouldn't do that to me.\" I'm kinda used to the dysfunction. No point furthering the chaos now.",
      "created_utc": 1745852111.0,
      "score": 32
    },
    {
      "id": "mpidykw",
      "body": "THANK YOU i am so tired of grown adults not taking responsibility for their own choices",
      "created_utc": 1745859230.0,
      "score": 155
    },
    {
      "id": "mpib5zd",
      "body": "Yep. You are correct. Dont want kids? Snip snip, or just dont have sex.",
      "created_utc": 1745858413.0,
      "score": 54
    },
    {
      "id": "mpi75y6",
      "body": "Word, my parent's had 3 mistakes after my younger brother and they're exhausted",
      "created_utc": 1745857229.0,
      "score": 18
    },
    {
      "id": "mping3f",
      "body": "There was a woman going on and on about how much she hated her disabled child and thinking about how to get away with murdering them. Countless people supported that monster.",
      "created_utc": 1745861973.0,
      "score": 71
    },
    {
      "id": "mphba33",
      "body": "LMAOOO 😭",
      "created_utc": 1745847370.0,
      "score": 35
    },
    {
      "id": "mphebme",
      "body": "Did we not read the last sentence?\n\nIt takes 2 to tango. Im just as much at fault here.",
      "created_utc": 1745848398.0,
      "score": -43
    },
    {
      "id": "mphdvzg",
      "body": "Womp womp indeed",
      "created_utc": 1745848253.0,
      "score": -24
    },
    {
      "id": "mphw8gj",
      "body": "Further to that - GET A VASECTOMY. \n\nThe decision wasn't made for you; you failed to prevent something YOU did not want in the first place.",
      "created_utc": 1745853977.0,
      "score": 22
    },
    {
      "id": "mphqk2j",
      "body": "I’m a parent. I’ve gone through periods where I resent my kids. I resented having yet another thing to take care of when I could barely take care of myself and I resented everyone saying “you have to get better for your children.”\n\nOP doesn’t need to hear that they should care about their children. Likely that’s all they’ve heard from anyone around them.",
      "created_utc": 1745852252.0,
      "score": 181
    },
    {
      "id": "mpibua3",
      "body": "Just be happy! 😂",
      "created_utc": 1745858612.0,
      "score": 13
    },
    {
      "id": "mpkaws8",
      "body": "Yeah absolutely, you raise some really good points but at the same time, nobody knows how things are gonna be. You can’t predict what parenthood will be like. \n\nSometimes these things aren’t planned and when that’s the case, you associate the kid with the disruption to your life, as unfair as that is. \n\nI agree that he shouldn’t have had another if he already resented the first one, and I agree that nobody would want to hear their parents say these things about them, but I do really get what he means.",
      "created_utc": 1745880401.0,
      "score": 1
    },
    {
      "id": "mphx27e",
      "body": "Tbf a lot of people are forced to by “expectations” and “standards “ of what having an adult life is like. Not sure if this is his case but let’s not pretend there isn’t pressure going on, there’s a whole buncha discourse going on trying to raise awareness of that. It affects both women and men.\n\nETA: In case I need to explain it, also, this doesn’t justify going backwards now that they were born. I’m just pointing that out.",
      "created_utc": 1745854221.0,
      "score": 3
    },
    {
      "id": "mpk2clk",
      "body": "Yes we do. Problem is- I was never taught how to comfort a person, so I don’t know how.",
      "created_utc": 1745877494.0,
      "score": 44
    },
    {
      "id": "mpj8c8e",
      "body": "Do you mean “etc”?",
      "created_utc": 1745868178.0,
      "score": 12
    },
    {
      "id": "mpk7qi7",
      "body": "Extremely important for kids to see a parent be vulnerable, and then witness them overcome that emotional and mental anguish by enacting self care and self love. \n\nWhat exactly you display to them of your struggles and said self care should of course try to be tailored in an appropriate way to the child and where they're personally at in their stage of development. \n\nBut also that isn't always the scenario that initially plays out as we are all capable of breaking down under pressure and children are often unexpectedly exposed to scary moments like this that they cannot fully grasp when they see that their parent or care giver is struggling. But children are resilient and when offered love and care and show that you are still strong and most importantly there for them and it can teach them many strengths when they see that you can go through something scary and tremendously difficult yet look after yourself and recover. \n\nThough one should also just be careful with overburdening children with sharing too much of the adult world or problems out of the scope of their understanding as this can be impossible for their developing brains to comprehend. Boundaries are super important and tailoring the information you share with your child so that it is ppropriate for them must be considered carefully. \n\nEmotional parentification is a terrible terrible and toxic trait that overwhelms a child since they are ill equipped with the knowledge or the tools to navigate certain adult concepts. It can be severely frightening for a young mind and they can become an anxious scout always on the lookout for signs of danger as they start to feel like THEY now have a role as protector of the parent. A role they cannot carry out. \n\nYour child should not become a best friend/confidant to share all your woes with. Boundaries. Healthy, tailored boundaries. Otherwise you end up with a child who grows up into an anxious adult, one who also grows up to resent the parent that put those burdens on their shoulder.",
      "created_utc": 1745879312.0,
      "score": 13
    },
    {
      "id": "mphp51n",
      "body": "Sadly kinda true sometimes. Not as bad as OP",
      "created_utc": 1745851817.0,
      "score": -4
    },
    {
      "id": "mpikji2",
      "body": "I have come to find that sometimes accountability and ego is like an unstoppable force meets an immovable object. I think it’s quite complex and complicated. Not to mention when adding the weight of social stuff can have on many people. The worst part of OP’s post to me, the kids may have already noticed this. I wish the OP would redirect his problem towards the idea of having had kids rather than to his kids, which is what I get from the explanation; they are not at fault. Redirecting may help him even if it would still take time. Hell, he could even try to see his kids as just people who deserve some decency and whatnot even if his paternal feeling isn’t there. It may not be optimal but considering how it seems to me OP feels completely detached, perhaps that may help.\n\n\nOr i could be wrong. Just throwing some thoughts.",
      "created_utc": 1745861137.0,
      "score": 35
    },
    {
      "id": "mpivkzd",
      "body": "what??",
      "created_utc": 1745864349.0,
      "score": 34
    },
    {
      "id": "mpheuyl",
      "body": "So to whom are you referring when talking about a lack of forethought and accountability? It seems like you have given this much forethought, 10 years ago yet had another kid last year?",
      "created_utc": 1745848573.0,
      "score": 74
    },
    {
      "id": "mpi8tts",
      "body": "Why'd you get kids then? Like i understand my simple answer is not always what you want especially in mental health situations, but its the truth. Its not the kids fault and he needs to take care of them. Im a 15 yr old and if i ever saw my mother, or father posting something like this it'd break my heart. Why get a kid when you'll resent them? Parenthood is hard and im not saying its easy.",
      "created_utc": 1745857722.0,
      "score": 214
    },
    {
      "id": "mpigiwn",
      "body": "The moment you decided to be a parent is the moment you signed up for all that comes with it. You don't get to resent them or blame them for the consequences of your choice. They can feel that and it's cruel to hurt your children like that. It's also unfair. Your selfishness at that point starts the process of your children later struggling just like you. You need to find other parts in your life where you can put yourself first. Anything involving the physical and emotional well-being of your children is off limits for that.",
      "created_utc": 1745859972.0,
      "score": 33
    },
    {
      "id": "mpiklf0",
      "body": "Well tough shit-because you decided to have them? You want sympathy for having children that YOU consciously made the decision to have? \n“I resent my children because I’m tired and can’t take care of myself.” Sorry you suck at making life decisions? Doesn’t mean you get to shit on your kids for it.",
      "created_utc": 1745861152.0,
      "score": -1
    },
    {
      "id": "mpjshjq",
      "body": "Are you sure you men 'resent'? You've actually gone through periods of actually begrudging your kids?\n\nThat's wild. Your children deserve so much better. Wow.",
      "created_utc": 1745874252.0,
      "score": 1
    },
    {
      "id": "mpkildf",
      "body": "I get what he means too, but i still find it wrong, what he longs for is free time and i know he maybe didn't see how rough parenthood can be and also financial wise of course.\n\nFor free time he can find a babysitter for them and for financial stuff thats hard to answer\n\nStill overall i dont think its right to think of your kids as parasites, or something to resent, its okay to find things hard, or sometimes your kids are just a heavy loud because they are, i take care of my little cousins sometimes and holy shit it really gets exhausting, but i cant resent them they're just kids who need love, care and understanding \n\nAlso im glad you understand and i also get where you're coming from",
      "created_utc": 1745883032.0,
      "score": 1
    },
    {
      "id": "mpke4a8",
      "body": "That was a punch in the gut 😅. After I learnt how fuked up my dad’s childhood was and that abuse ran in the family it helped me understand why he was a shitty person. It doesnt excuse his behaviour and the trauma I went through but now his behaviour doesn’t hurt so much. \nI noticed the difference with how my parents treated my older brother than me. I was surprised to find out I was planned since they treated me like a burden. I think they hate that I was born with neurological problems, unmediated ADHD (very hyper kid) and undiagnosed autism.",
      "created_utc": 1745881498.0,
      "score": 20
    },
    {
      "id": "mpjw9ic",
      "body": "Yes, sorry for the typo.",
      "created_utc": 1745875446.0,
      "score": 8
    },
    {
      "id": "mpj59f1",
      "body": "no i agree! from what i can tell from his post there is no way is he will find a solution to his problem, because he feels like this is something that happened to him, not something that he had control over. in order to move forward he needs to realise the amount of influence he has(and has had) over his own life/fate.",
      "created_utc": 1745867246.0,
      "score": 14
    },
    {
      "id": "mpiw5v2",
      "body": "It's because it's a job that's impossible to prepare for and it's permanent. Also news flash lots of parents resent their kids at some point it's just not normal or allowed to be said. They're are entire books and studies about it.",
      "created_utc": 1745864522.0,
      "score": 18
    },
    {
      "id": "mpi9leg",
      "body": "I didn’t go to the store on the whim and pick up a couple of kids! \n\nI had kids when I was young. Having my children actually triggered severe postpartum depression. I also later found out that I was bipolar, something that doesn’t show up until you’re late 20s or early 30s. I also found out my late 20s I had undiagnosed ADHD. I also didn’t plan on getting divorced and trying to do all of it myself. I didn’t know that I was going to be rising children who are also neurodivergent. I didn’t know that my bipolar disorder would end up being treatment resistant and I would have to undergo two years of electroconvulsive therapy. \n\nFeeling something also isn’t the same as acting on it. I have never told my children that I have resented them. I had made sure that when things get bad they are taken care of by people who can manage them. I’ve made sure that they get therapy and I get therapy. But I am not going to pretend for a minute that I have never felt like that because that would be bullshit. \n\nIt’s not simple. Nothing ever is.",
      "created_utc": 1745857948.0,
      "score": 128
    },
    {
      "id": "mpinlj7",
      "body": "You guys writing this, in a mental health sub, is staggeringly unhelpful. The guy just wrote that this is all he hears, and it isn't helping. Why do you feel the need to write this shit? How about leaving the comments for someone with actual advice?",
      "created_utc": 1745862016.0,
      "score": -8
    },
    {
      "id": "mpjt95y",
      "body": "My children deserve the world. You find me someone that can do better than I am doing every day and we can talk. Until then, you are not in my shoes. You do not know my life or my mind or my heart or my kids. But I can guarantee that judgement from strangers on the internet saying “you’re a terrible person who doesn’t deserve your kids” probably isn’t doing anything to help anyone’s mental state.",
      "created_utc": 1745874492.0,
      "score": 5
    },
    {
      "id": "mpkk7ia",
      "body": "Are we living the same life? 🤔",
      "created_utc": 1745883584.0,
      "score": 2
    },
    {
      "id": "mpiuegs",
      "body": "Man, my mom told me she wished she never had me once. She was upset and I was being awful,  but damn I remember it clear as day. Kinda sucks all the things I wished I could remember, that one took the spotlight. \n\nAnyway.....back to things that won't be said to my kids...",
      "created_utc": 1745863999.0,
      "score": 143
    },
    {
      "id": "mpj2dcu",
      "body": "I love your honesty. That’s what life is like. Parents get sick. The important part is that you took care of your children and you, nevertheless. For some people that even means, to place the children somewhere else until they get better. You did a lot, bipolar, neurodivergent kids, by yourself one of these things is often more than one person can handle. You got therapy for you and your kids, for me that’s the best part. In hindsight, adults can deal with the thought that their parents weren’t perfect but actively seeking help. Parents who clearly should’ve gotten help and didn’t try that’s a different story you have to deal with as an adult.",
      "created_utc": 1745866378.0,
      "score": 8
    },
    {
      "id": "mpic9cz",
      "body": "Of course its not simple, im just saying my answer is simple since im not fully sure what else to do then give my own perspective. Asides that i understand this my mother also had kids very young and got married young i think she divorced twice and she just honestly only knows motherhood. She admitted it was dumb of her, but she did her best to take care of us, im the youngest so i live on my own with them my father and mother they can relax now since im pretty independent anyway\n\nBut asides that they never resented us of course me and my siblings misbehaved and were a pain sometimes, but they made it\n\nMy mom always told me she loved being a mother, though i do think she deserved some more life \n\nMy mom also has some things, but i keep forgetting the names of them but shes overall just very traumatized and is afraid to go outside \n\nAgain not invalidating anyone's story i just give my perspective which may be simple sometimes \n\nYou do your best",
      "created_utc": 1745858736.0,
      "score": 15
    },
    {
      "id": "mpiy3c7",
      "body": "Children feel it and it's disastrous for them. When I was a child, my father and his family always made me feel like a burden and as if my existence was a problem and that strongly contributed to the destruction of my self-esteem and my rotten mental health today, so I don't feel too sorry for these kinds of people. Their mental health matters, but it's important to remind them that their children's mental health does too. They are under construction and didn't ask to be there.",
      "created_utc": 1745865100.0,
      "score": 15
    },
    {
      "id": "mpjv7j6",
      "body": "do you think maybe he should, idk, take it to heart if it’s “all he hears”?",
      "created_utc": 1745875111.0,
      "score": 6
    },
    {
      "id": "mpiovwn",
      "body": "Go and read three things: OP's post, his comments on this post and how harmful the criticised behaviour is for children. Then come back and tell me if it's still mean to tell people to *take accountability, take care of their mental health and don't fuck up innocent children.*",
      "created_utc": 1745862386.0,
      "score": 23
    },
    {
      "id": "mpjpvkj",
      "body": "Mine screamed at me she wishes we would die as she accelerated through an intersection because she couldn’t handle my brother and I being shit hears.  That was 30 years ago and remember that to this day.\n\nI’ve been NC with her for 4 years.  That was a small taste of what was to come.",
      "created_utc": 1745873454.0,
      "score": 40
    },
    {
      "id": "mpiuss3",
      "body": "It sucks. I know it does. But our parents are people too. Chances are if I have a struggling mental health, our parents probably were too. all we can do is try to be better than they were. All anyone can do is the best they can with what they have from where they are",
      "created_utc": 1745864116.0,
      "score": 20
    },
    {
      "id": "mpj34b5",
      "body": "The hard part about mental health is that our brains lie to us. I’m often unable to recognize just how much help I need until I get some. I’m lucky to have people around me that help take care of me. Not everyone has that. Not everyone has moments of clarity to know that they aren’t coping the way that they think they are. My heart breaks for the people in those situations.",
      "created_utc": 1745866600.0,
      "score": 10
    },
    {
      "id": "mpiv3k3",
      "body": "Agreed.  It never bothered me like it has other people who have heard it. I just think damn mom...poor choice of words.\n\n\n\nAs a parent now, I apologize when I let it get away from me. I sit them down and tell them I'm sorry and that I shouldn't have said what I said. I'll be damned if a spotlight memory is created because I was being an angry asshole",
      "created_utc": 1745864204.0,
      "score": 41
    },
    {
      "id": "mpiw42y",
      "body": "My mom once told us we were all a bunch of parasites sucking the life right out of her. To be fair she was nine months pregnant with her fifth child at that point and I think I would have handled it FAR WORSE. We’re all adults now and we will not let her live down ever. We constantly tease her.",
      "created_utc": 1745864508.0,
      "score": 14
    }
  ]
}