{
  "id": "1jlxqbk",
  "title": "How many do you relate to?",
  "selftext": "",
  "created_utc": 1743175719.0,
  "score": 388,
  "num_comments": 117,
  "url": "https://i.redd.it/eow9ydsd8gre1.jpeg",
  "comments": [
    {
      "id": "mk780bs",
      "body": "Oh wow look it’s my mother",
      "created_utc": 1743176235.0,
      "score": 72
    },
    {
      "id": "mk7h5sk",
      "body": "After being with an abusive partner all of them.\n\nOne of the worst habits she would have. Is if I mentioned something we had done together she would argue that it wasn't her and I got her mixed up for someone else or another ex.\n\nCrazy thing is she would do it so often. Even though I knew the memory was with her. I even believed that I was wrong.\n\nOr she would say things I know she hadn't said or done and tell me that it was just simply me who had forgot or was in the wrong.\n\nI still have nightmares.",
      "created_utc": 1743178910.0,
      "score": 18
    },
    {
      "id": "mk7etbd",
      "body": "my parents do all of these😭😭😭",
      "created_utc": 1743178218.0,
      "score": 12
    },
    {
      "id": "mk7zfua",
      "body": "My mother.  And it's not just a one-time thing, either, because back during her childhood in Soviet-occupied Ukraine, she, herself, received a ton of abuse from her father.  She experienced a ton of abuse and misogyny, especially from the men at her work as well as my father.  And by the time I was born and diagnosed with autism, her idea of \"curing\" my autism is passing down the exact same experiences she had with abuse and discrimination to me.",
      "created_utc": 1743184144.0,
      "score": 9
    },
    {
      "id": "mk79e47",
      "body": "gaslighting, withholding, dismissiveness, isolation and (it’s not on the list) parentification.",
      "created_utc": 1743176636.0,
      "score": 8
    },
    {
      "id": "mk85maw",
      "body": "Wow. It’s just like a family reunion!",
      "created_utc": 1743185943.0,
      "score": 7
    },
    {
      "id": "mk7nrma",
      "body": "Me to myself:",
      "created_utc": 1743180831.0,
      "score": 6
    },
    {
      "id": "mk8qssl",
      "body": "All of them",
      "created_utc": 1743192260.0,
      "score": 5
    },
    {
      "id": "mk8ofn9",
      "body": "It’s like a bpd checklist… now I would love for her to just give me the silent treatment.",
      "created_utc": 1743191568.0,
      "score": 4
    },
    {
      "id": "mk7pyp4",
      "body": "I experienced A LOT of these, thanks to society where I live (if I could move, I would, and I would never return).\n\nThe police won't even do anything. These types of behavior are encouraged here (even though the people won't admit it). It's awful here.",
      "created_utc": 1743181456.0,
      "score": 3
    },
    {
      "id": "mk7yv90",
      "body": "When I was in a residential many staff trivialized me :)",
      "created_utc": 1743183983.0,
      "score": 3
    },
    {
      "id": "mk859fr",
      "body": "[removed]",
      "created_utc": 1743185836.0,
      "score": 3
    },
    {
      "id": "mk8itka",
      "body": "Hey it's one of my EX friends who pulled stuff like this all the time on me. \n\n\nEspecially name calling & humiliation especially.",
      "created_utc": 1743189878.0,
      "score": 3
    },
    {
      "id": "mk8qvoe",
      "body": "You want me to pick my favorite ones to use or...?",
      "created_utc": 1743192284.0,
      "score": 3
    },
    {
      "id": "mk8rv80",
      "body": "All but isolation, and that was friends family, my ex wife",
      "created_utc": 1743192574.0,
      "score": 3
    },
    {
      "id": "mk8szb8",
      "body": "I've had 11 of them done to me possibly 12 but I'm out of that relationship.",
      "created_utc": 1743192903.0,
      "score": 3
    },
    {
      "id": "mk96shu",
      "body": "Sweet mother dearest did all and more",
      "created_utc": 1743197122.0,
      "score": 3
    },
    {
      "id": "mk9bs57",
      "body": "TIL I've been abused 🫠",
      "created_utc": 1743198717.0,
      "score": 3
    },
    {
      "id": "mk9ugof",
      "body": "All of the above",
      "created_utc": 1743204897.0,
      "score": 3
    },
    {
      "id": "mk7qaj7",
      "body": "Experienced this all these between two partners",
      "created_utc": 1743181549.0,
      "score": 2
    },
    {
      "id": "mk7x0yw",
      "body": "Sounds like my ex.",
      "created_utc": 1743183459.0,
      "score": 2
    },
    {
      "id": "mk8je88",
      "body": "I relate to every of these... I can't be proud I guess...",
      "created_utc": 1743190052.0,
      "score": 2
    },
    {
      "id": "mk9gzay",
      "body": "step dad and mom...",
      "created_utc": 1743200421.0,
      "score": 2
    },
    {
      "id": "mk9izt5",
      "body": "Nearly all",
      "created_utc": 1743201093.0,
      "score": 2
    },
    {
      "id": "mk9t97v",
      "body": "11, some are the speciality of my father some of my mothers and some of them do both the only thing ive never experienced was Isolation, but I was made fun of that nobody likes me etc.",
      "created_utc": 1743204493.0,
      "score": 2
    },
    {
      "id": "mk9ygqc",
      "body": "Didn't have the type of relationship with my parents to have any of these. It's was just \"do what we tell you to do\" then everyone went their seperate ways.",
      "created_utc": 1743206250.0,
      "score": 2
    },
    {
      "id": "mk9zvvt",
      "body": "Salespeople have like 4-5 of these traits",
      "created_utc": 1743206742.0,
      "score": 2
    },
    {
      "id": "mkamnvw",
      "body": "I try to fit all of those into my daily routine.",
      "created_utc": 1743214886.0,
      "score": 2
    },
    {
      "id": "mkar6kg",
      "body": "Not 2...not 4....9!!!",
      "created_utc": 1743216642.0,
      "score": 2
    },
    {
      "id": "mkate4n",
      "body": "if this is a bingo game, I'm winning first",
      "created_utc": 1743217530.0,
      "score": 2
    },
    {
      "id": "mkbtlfm",
      "body": "These are all sub categories of Emotional Abuse. If anyone is suffering any of these they need to try and leave and find a place of safety",
      "created_utc": 1743237645.0,
      "score": 2
    },
    {
      "id": "mkbz5gq",
      "body": "Sad Bingo noises",
      "created_utc": 1743241426.0,
      "score": 2
    },
    {
      "id": "mkci0sc",
      "body": "It's sad how I relate to and recognize all these types of mental abuse.",
      "created_utc": 1743251950.0,
      "score": 2
    },
    {
      "id": "mkdfmjz",
      "body": "Since most people are saying that its their mother, how did you deal with her? Cuz the same things been happening to me (belittling, critcism, silent treatment, name calling, scapegoating) and i dont really know how to deal with it (I'm 18 :/). Its been affecting a lot of parts of my life already - i dont trust people easily - even my own teachers at college and always think that everyones there to pull me down or damage me in some way. Have a very low self esteem. Should i make a different post regarding this altogheter?\n\n  \nEdit - I've made a seperate post on this subreddit itself so if you can, please do help me out there",
      "created_utc": 1743264046.0,
      "score": 2
    },
    {
      "id": "mkdmk46",
      "body": "Well Gahdamn put me through the fire and then wet me and say hello (idk what I just said)",
      "created_utc": 1743266320.0,
      "score": 2
    },
    {
      "id": "mkdqifi",
      "body": "Every single one and with several people. That's so wrong...",
      "created_utc": 1743267587.0,
      "score": 2
    },
    {
      "id": "ml83j6a",
      "body": "Gaslighting, constant criticism, blaming, trivializing. That's one third of the whole list.\n\n  \nGotta respect your parents though right?",
      "created_utc": 1743697784.0,
      "score": 2
    },
    {
      "id": "mlefe56",
      "body": "Oh wow, that is exactly how my ex and my family treats me all the time, beautiful",
      "created_utc": 1743785039.0,
      "score": 2
    },
    {
      "id": "mlefurv",
      "body": "After reading through many of these comments, I'm starting to see a pattern, and it seems to be that the often culvert is the mother lol",
      "created_utc": 1743785178.0,
      "score": 2
    },
    {
      "id": "mk7nipi",
      "body": "[deleted]",
      "created_utc": 1743180762.0,
      "score": 1
    },
    {
      "id": "mk8e3j1",
      "body": "I've seen the whole lot.",
      "created_utc": 1743188454.0,
      "score": 1
    },
    {
      "id": "mk8zt2d",
      "body": "My cocktail would be name calling, gaslighting, making threaths, witholding, dismissivness, constant criticism, humiliation, blaming, belitlling and trivialising.\nAt this point I've lost my personality, I'm an empty being walking, doing the minimum required that I be allowed to go and sleep.",
      "created_utc": 1743194953.0,
      "score": 1
    },
    {
      "id": "mk9pqh2",
      "body": "Ugh I’m guilty of a lot of this from my younger years…I’ve done my best to grow and do better but man do I cringe when I think about what an asshole I’ve been in the past.",
      "created_utc": 1743203321.0,
      "score": 1
    },
    {
      "id": "mka70fb",
      "body": "I can relate to 6 all from different people in my family...",
      "created_utc": 1743209238.0,
      "score": 1
    },
    {
      "id": "mkb1gz4",
      "body": "If this was bingo, I would almost have full set, except the isolation part… thank you mom.",
      "created_utc": 1743220980.0,
      "score": 1
    },
    {
      "id": "mkb8zhy",
      "body": "God I've been literally through everything listed here. ",
      "created_utc": 1743224606.0,
      "score": 1
    },
    {
      "id": "mkbl7tv",
      "body": "There's just this uneasiness that i feel every time i see these words. most of the time i see people use these to justify their own shortcomings. Someone did something bad and was reprimanded, now the other person is gaslighting. Someone want to be left alone and now they're avoidant and does \"silent treatment\". Sometimes things aren't that deep. \n\nI understand that these things actually exists and does happen but nowadays, people try to be this \"knowledgeable\" person that labels everything with such haste without even knowing the full details of a situation.",
      "created_utc": 1743231951.0,
      "score": 1
    },
    {
      "id": "mkc6glz",
      "body": "I relate to 7 of those. ",
      "created_utc": 1743246074.0,
      "score": 1
    },
    {
      "id": "mkcffmr",
      "body": "Gaslighting, making threats, trivializing, and dismissiveness. A bit of constant criticism but only about other people.",
      "created_utc": 1743250780.0,
      "score": 1
    },
    {
      "id": "mkd83gd",
      "body": "My mother mastered them all.",
      "created_utc": 1743261560.0,
      "score": 1
    },
    {
      "id": "mkeeazc",
      "body": "All of them. Also emotional blackmail and countless others I could probably think of when my brain is more awake",
      "created_utc": 1743275164.0,
      "score": 1
    },
    {
      "id": "mkf0k2x",
      "body": "my ex did all of that",
      "created_utc": 1743282492.0,
      "score": 1
    },
    {
      "id": "mkgzz75",
      "body": "I experienced them all in my childhood. Abusive school environment.",
      "created_utc": 1743309509.0,
      "score": 1
    },
    {
      "id": "mkh9nzb",
      "body": "My ex. Sometimes I feel bad for disappearing from her, knowing I’ll likely never get a form of acceptance from someone again, but at the same time I’m free of her manipulation.",
      "created_utc": 1743314840.0,
      "score": 1
    },
    {
      "id": "mklhl4n",
      "body": "I had a situationship with a guy who used all of those tactics to make me do sexual stuff for him .",
      "created_utc": 1743375332.0,
      "score": 1
    },
    {
      "id": "mknx6r6",
      "body": "I think all of us will experience all of the above sooner or later, it's part of life. Important is how you deal\\* with it.",
      "created_utc": 1743417727.0,
      "score": 1
    },
    {
      "id": "mkvznvw",
      "body": "Trivializing stands out, never thought that was abuse.. I remember never being to have an opinion on how. I felt about anything growing up. My opinion didn’t matter.. my concerns were always brushed aside with a trivializing tone.",
      "created_utc": 1743528774.0,
      "score": 1
    },
    {
      "id": "mkyg4oe",
      "body": "10/12",
      "created_utc": 1743558128.0,
      "score": 1
    },
    {
      "id": "mkztbik",
      "body": "All of it.  Good thing I never have to see my parents again, especially my stupid, sadistic mother.  I still hate them after years of not seeing them (well, I still see my dad here and there, plus he never hit or touched us inappropriately and he put food on the table)",
      "created_utc": 1743583721.0,
      "score": 1
    },
    {
      "id": "mohu4re",
      "body": "Everyone in my life does pretty much all of these too me",
      "created_utc": 1745354518.0,
      "score": 1
    },
    {
      "id": "mk79tlg",
      "body": "[deleted]",
      "created_utc": 1743176758.0,
      "score": 15
    },
    {
      "id": "mk7dxpf",
      "body": "My mother fits on most of those descriptions. She maybe skipped just a few (less than a handful).",
      "created_utc": 1743177960.0,
      "score": 5
    },
    {
      "id": "mk7m23g",
      "body": "Sorry but bahahaha",
      "created_utc": 1743180346.0,
      "score": 3
    },
    {
      "id": "mkewr7f",
      "body": "She’s wondering why you haven’t called her recently.",
      "created_utc": 1743281230.0,
      "score": 1
    },
    {
      "id": "mkmvjol",
      "body": "Oh look it's my parents and siblings and everyone else I'm close to.",
      "created_utc": 1743394934.0,
      "score": 1
    },
    {
      "id": "ml6nmah",
      "body": "My same thought. And my grandfather (mother's father). Sigh.",
      "created_utc": 1743680686.0,
      "score": 1
    },
    {
      "id": "mk7mmtq",
      "body": "Gosh she sounds like a nightmare",
      "created_utc": 1743180511.0,
      "score": 8
    },
    {
      "id": "mkd4u0j",
      "body": "You are not alone buddy. Hit up r/griefsupport You deserve to be comfortable in your own skin, I hope you can find some peace",
      "created_utc": 1743260483.0,
      "score": 3
    },
    {
      "id": "mk7m8dz",
      "body": "I can feel ya 😭",
      "created_utc": 1743180396.0,
      "score": 6
    },
    {
      "id": "mk7zzs0",
      "body": "Ah, generational trauma, I hope she loves you enough to change her behaviour some day cuz honestly you deserve better",
      "created_utc": 1743184302.0,
      "score": 7
    },
    {
      "id": "mkdyaic",
      "body": "Explain that last one please?",
      "created_utc": 1743270021.0,
      "score": 3
    },
    {
      "id": "mk8ab2n",
      "body": "Yeah, every family reunion is like a bingo of this traits",
      "created_utc": 1743187344.0,
      "score": 4
    },
    {
      "id": "mk8x3eq",
      "body": "Why are you still in the relationship dude",
      "created_utc": 1743194138.0,
      "score": 1
    },
    {
      "id": "mk8aewa",
      "body": "😂",
      "created_utc": 1743187375.0,
      "score": 2
    },
    {
      "id": "mk8ldtf",
      "body": "Good that they are an ex, you deserve better",
      "created_utc": 1743190658.0,
      "score": 1
    },
    {
      "id": "mk8xasz",
      "body": "To use? Didn't know it was a chart for your tools",
      "created_utc": 1743194200.0,
      "score": 2
    },
    {
      "id": "mk8wt2z",
      "body": "Good for you",
      "created_utc": 1743194050.0,
      "score": 1
    },
    {
      "id": "mk99kgb",
      "body": "It's always the family huh",
      "created_utc": 1743198013.0,
      "score": 3
    },
    {
      "id": "mk9cse1",
      "body": "Wait until you learn about the signs of emotional and psychological abuse 🙂",
      "created_utc": 1743199039.0,
      "score": 3
    },
    {
      "id": "mk8li7q",
      "body": "Not am I but atleast we know what to avoid in a person",
      "created_utc": 1743190695.0,
      "score": 1
    },
    {
      "id": "mk9jjou",
      "body": "That's a disastrous smoothie but yeah same",
      "created_utc": 1743201278.0,
      "score": 2
    },
    {
      "id": "mk9z7bu",
      "body": "So neglectful parents? That's... Sad",
      "created_utc": 1743206504.0,
      "score": 1
    },
    {
      "id": "mka0bs9",
      "body": "I can see the gaslighting but what are the other traits?",
      "created_utc": 1743206897.0,
      "score": 1
    },
    {
      "id": "mkc17zg",
      "body": "Congratulations on your accomplishments!!",
      "created_utc": 1743242781.0,
      "score": 1
    },
    {
      "id": "mkc2ay8",
      "body": "What if they are your parents tho? How'd you leave them?",
      "created_utc": 1743243481.0,
      "score": 1
    },
    {
      "id": "mkcoyho",
      "body": "🫂🫂",
      "created_utc": 1743254821.0,
      "score": 2
    },
    {
      "id": "mkdht5j",
      "body": "Honestly, people like this almost never change, atleast I haven't seen it happen so the best thing you can do is go on no contact or go on low contact. Going on low contact means talking only when it's absolutely necessary and maintaining a minimum relationship. If they can't talk or be around you much then the damage automatically lessens a lot. You should make a different post too. Any kind of help is good but let it stay here. 🫂 I'm here to talk if you want",
      "created_utc": 1743264764.0,
      "score": 1
    },
    {
      "id": "mkdqx48",
      "body": "😂😂😂 same but that was funny",
      "created_utc": 1743267716.0,
      "score": 2
    },
    {
      "id": "ml8cch4",
      "body": "My principles say, \"Respect those who respect you\"",
      "created_utc": 1743700377.0,
      "score": 1
    },
    {
      "id": "mk7ocj3",
      "body": "I wanna beat you up for saying that about yourself. Start respecting yourself brat. Fake it till you make it. You deserve better",
      "created_utc": 1743180996.0,
      "score": 1
    },
    {
      "id": "mko0nam",
      "body": "Deal*. Yup, I agree although some people experience this on q more severe level",
      "created_utc": 1743419543.0,
      "score": 2
    },
    {
      "id": "mkztztv",
      "body": "Btw I just discovered a sub last week called r/raisedbynarcissists   it is my new favorite subreddit, you might like it.  Very comforting for some reason, I love everyone there too.",
      "created_utc": 1743584190.0,
      "score": 1
    },
    {
      "id": "mk8n294",
      "body": "It's my mom and my ex. I sense a pattern",
      "created_utc": 1743191167.0,
      "score": 11
    },
    {
      "id": "mk9gc7s",
      "body": "This is why MIL/FIL stereotypes exist. You aren't overreacting, it's just that your SO normalized the behavior before you came along",
      "created_utc": 1743200209.0,
      "score": 2
    },
    {
      "id": "mk820m5",
      "body": "just say ur name now AMAZING USERNAME",
      "created_utc": 1743184878.0,
      "score": 3
    },
    {
      "id": "mkedci9",
      "body": "Parentification is basically taking on adult responsibilities as a child. A good example is being forced to watch siblings(without compensation) because parents expect the oldest/older kids to automatically help out with younger sibs.",
      "created_utc": 1743274851.0,
      "score": 4
    },
    {
      "id": "mk927ax",
      "body": "We’re divorcing and have a child. I am the custodial parent and can’t fully ignore her and need to communicate about our child. But she’s aware I can’t block her fully so she’ll start new email threads every week or so and will go fully off topic from our child.\n\n She was pretty normal until she got pregnant and then started to get really delusional and became abusive.",
      "created_utc": 1743195678.0,
      "score": 2
    },
    {
      "id": "mk9ael0",
      "body": "Oh yeah its wonderful",
      "created_utc": 1743198281.0,
      "score": 3
    },
    {
      "id": "mk9dlsm",
      "body": "TIL (probably) that I'm a punching bag.",
      "created_utc": 1743199305.0,
      "score": 2
    },
    {
      "id": "mk9znfy",
      "body": "Not purposeful. Just a mom who grew up without parents and a stepdad that didn't know how to deal with children.",
      "created_utc": 1743206660.0,
      "score": 2
    },
    {
      "id": "mkc2cv6",
      "body": "Call child line, disclose it to school or professional",
      "created_utc": 1743243517.0,
      "score": 2
    },
    {
      "id": "mkdl9qj",
      "body": "I'm anyways going to move out of house in 2 3 months once the exams are over but till then what do I do? Cuz it's really messing up my studies. She just doesn't stop whining.",
      "created_utc": 1743265899.0,
      "score": 2
    },
    {
      "id": "mknoda7",
      "body": "This. They don't change. They often get worse with age. I'm in my mid 20's, trust me, you need to get out as soon as possible and get away from her. The effects add up over time. Don't stay very long.",
      "created_utc": 1743412380.0,
      "score": 1
    },
    {
      "id": "mlabesq",
      "body": "My principles say, \"Almost everyone I will ever meet is an asshole\"",
      "created_utc": 1743722293.0,
      "score": 1
    },
    {
      "id": "mk9pf30",
      "body": "My mom my ex and an ex best friends. I think I found the pattern now lol time to break it.",
      "created_utc": 1743203216.0,
      "score": 6
    },
    {
      "id": "mkc9qj8",
      "body": "Samee, it's my mum, ex, and abusive housemate",
      "created_utc": 1743247930.0,
      "score": 2
    },
    {
      "id": "mk98ydq",
      "body": "She seriously needs help it seems. It must be hard to see your loved one transform into someone who could hurt you",
      "created_utc": 1743197817.0,
      "score": 4
    },
    {
      "id": "mk9al58",
      "body": "So wonderful, I started hearing the word \"family\" 🙂",
      "created_utc": 1743198336.0,
      "score": 3
    },
    {
      "id": "mk9je1e",
      "body": "I bet 10 karmas, you're a scapegoat too",
      "created_utc": 1743201226.0,
      "score": 2
    },
    {
      "id": "mka04kh",
      "body": "That's better in a way ig even though it still doesn't excuse their actions, I can understand them better and I hope they do too and maybe learn how to treat you like a person if not their child",
      "created_utc": 1743206827.0,
      "score": 1
    },
    {
      "id": "mkdnoqt",
      "body": "Fuck it, do you have any place you can go to study? Library, cafe, park even your friend's or relatives houses or maybe study at night. And lock yourself in your room if you can. I'll ask my friend about it. Will update soon",
      "created_utc": 1743266687.0,
      "score": 1
    },
    {
      "id": "mkhcpg6",
      "body": "Well she recommended you to lay low and not lose hope. You don't owe shit to her. She may have given birth to you but that doesn't change the fact that she couldn't even give you a good enough childhood. Your pain is valid and honestly make your desperation to be away from her your fuel. You can do it, here have some of my faith until you get your own 🍀",
      "created_utc": 1743316732.0,
      "score": 1
    },
    {
      "id": "mkac3vv",
      "body": "That's like the final form of a nightmare. My sympathies",
      "created_utc": 1743211064.0,
      "score": 2
    },
    {
      "id": "mkbz2ct",
      "body": "Yeah, unfortunately she has bpd with narcissistic tendencies so she probably won’t be able to recognize that she needs help and will just remain unstable. It’s definitely not fun to watch, but I’ve definitely grown and healed a lot from my experiences with her.",
      "created_utc": 1743241367.0,
      "score": 2
    },
    {
      "id": "mkhftzx",
      "body": "The thing is she gives mixed signals. Pre covid, she was the best mom ever - active, energetic, etc sure she was mad sometimes but overall she was great. Post covid, she turns 50, the covid drained all her immunity to say and now she's just constantly ill. And though i understand shes just trying to vent, it doesnt make her words any better. Even now sometimes she cracks jokes, slight physical affection but then theres intense periods - weeks on end of her just belittling and scapegoating me. So I'm torn what to do and plus i have all these exams lined up so i dont even have time to think about this stuff",
      "created_utc": 1743318725.0,
      "score": 1
    },
    {
      "id": "mkc2f66",
      "body": "Good for you. It must be hard seeing her like this but you don't deserve any harm that she might cause so it's better if you stay away",
      "created_utc": 1743243558.0,
      "score": 1
    },
    {
      "id": "ml6pubr",
      "body": "How long were y'all together before she got pregnant? I'm wondering if she was putting on an act before? Or maybe the stress of pregnancy/hormone changes really brought this out in her?",
      "created_utc": 1743681634.0,
      "score": 1
    },
    {
      "id": "ml7r19v",
      "body": "4 years. It was more unhealed trauma from childhood and enmeshment that brought out the more true nature. In some cluster b disorders it’s known as masking. Where someone gets more attached the harder it is for them to maintain the mask of normalcy.",
      "created_utc": 1743694098.0,
      "score": 1
    }
  ]
}