{
  "id": "1kcbgu9",
  "title": "i am 22 years old and i dont have any chance to a normal life",
  "selftext": "Hello everyone.\nYeah, the title of this post doesn’t match the picture because it’s my drawing and I just had no idea what to put there (hope u enjoyed it hehe). But anyway, that’s not what this is about.\n\nI’m 22 years old, and earlier this spring I was diagnosed with bipolar disorder, borderline personality disorder, OCD, CPTSD, and generalized anxiety disorder.\nWow, that’s a lot, right?\nYeah, and that’s exactly why I couldn’t get proper treatment in my country. I hope I’m not the only one here going through this.\n\nRight now, I’m barely studying and not even sure if I’ll finish college — even though we almost don’t study at all. I’ve had to take two breaks in a row, and since I graduated from school, I’ve attempted suicide four times, three of which were seriously dangerous.\nI don’t even know what to say about that.\n\nI don’t have a safe environment at home. I’ve been kicked out more than once, and one time I was thrown out right after being discharged from a psychiatric hospital (yes, that’s a thing too).\n\n\nI tried working.\nMy first real job ended with me in a psych ward. The second one pushed me into psychosis. I can’t function normally in society or get along with anyone for long. All my relationships end in conflict.\n\nI’m receiving some kind of treatment right now, but it’s still not enough, because I live in a third world country. I’ve seen around ten different specialists, and none of them could help.\nI’ve been on about 16 or 17 medications — antidepressants, antipsychotics, mood stabilizers.\nMy health has been seriously damaged because of it, and I don’t have the money to fix it. I also have no ability to work.\nThere’s no support system for people like me here.\nUnless you count the locked psych ward where they’ll keep you until the end of your life.\n\nSo yeah :) That’s my story and where I’m at now.\nI just wanted to share my despair, because I no longer believe my life will get better.\nI’ve tried everything to make it better.\nI’m not going to give up, but I don’t want to believe in miracles anymore either.\nI’m glad I shared this with someone!^^\n\ntranslated with chat gpt! sorry guys my english is not that good…\n",
  "created_utc": 1746113128.0,
  "score": 294,
  "num_comments": 51,
  "url": "https://i.redd.it/7udg9a3tu6ye1.jpeg",
  "comments": [
    {
      "id": "mq18ytp",
      "body": "Im really not sure how I can help you but im leaving a comment so you can know that at least someone listened ❤️",
      "created_utc": 1746113664.0,
      "score": 52
    },
    {
      "id": "mq1fx7v",
      "body": "Embrace the dysfunctional you. I do.",
      "created_utc": 1746115725.0,
      "score": 24
    },
    {
      "id": "mq1b5ad",
      "body": "I'm so sorry to hear that. I feel somewhat similar sometimes, like I've been set up from the start to fail. It does sound like you haven't had the diagnoses for too long, and in my experience, the period where you're undiagnosed is the hardest. And I am in no position to say this and I could be wrong, but I feel like you should give it some time to sink in and for you to get used to having these diagnoses. On top of that, I don't know if you're doing that at therapy but it's also very good to know exactly which disorders cause which symptoms. For me that helped a lot, at least. And try to find communities here you and your disorders are accepted and understood. Whether that's with friends, family, or even just a community like this online. I'm free to talk if you feel the need to. My main advice would be to try to be patient with yourself and try to understand or figure out what's going on inside yourself. And find someone to trust and who will accept and understand you. You've got this, you're strong, and there are people who care about you.",
      "created_utc": 1746114302.0,
      "score": 12
    },
    {
      "id": "mq1gie8",
      "body": "ik u might not believe it or feel it right now, and that’s okay, but you will be okay. (speaking from personal experience of having those same thoughts and similar life circumstances) hang in there!",
      "created_utc": 1746115900.0,
      "score": 7
    },
    {
      "id": "mq1qj67",
      "body": "the drawing is super cool! I've also been practicing more lately, it's very relaxing. you have a really cool and unique style! keep up the good work",
      "created_utc": 1746118843.0,
      "score": 7
    },
    {
      "id": "mq2na3c",
      "body": "Bro u can draw. I have 0 skill and in the same place.\n\nI’m 23. I won’t be for long 😉\nI can tell by the way u talk u have a future.\nIt will be tough but u have a kick in you. \nI believe in you. \nDo well or I will haunt ur ass",
      "created_utc": 1746128368.0,
      "score": 3
    },
    {
      "id": "mq1p15t",
      "body": "U are special OP 🫵🤟",
      "created_utc": 1746118414.0,
      "score": 3
    },
    {
      "id": "mq2qx3c",
      "body": "You have the same diagnoses as my partner 🫶 coming from someone who observes, loves, and supports a very complex person, I can assure you that everything you want in life is absolutely possible. You are not your disorders and this life, while not designed to be easy for you, is still here for you to make your own. You are not alone. \n\n\"Normal\" is so blase. It's okay not to lead a normal life. In the 5 years I've know him, I've watched my partner grow beyond his trauma and mental disorders. He's 30 now, is back in school for barbering, but still faces challenges every day now being completely unmedicated.  It's hard work, but I see him get up again and again to continue fighting for the life he deserves. And yeah, its hard af. That's just how it has to be, and working together to accept that we lead a very different life from most couples is just part of it!\n\nI hope you can find value in your life despite everything. It's there, it's just hard to see sometimes. You are worthy of all good things. I just wanted to share my experience in hopes that you can find some hope in it. ❤️‍🔥",
      "created_utc": 1746129405.0,
      "score": 3
    },
    {
      "id": "mq9czqr",
      "body": "Hey love! Im proud of you for speaking your truth. The good news? The fact that you are able to recognize and acknowledge that the current society we live in is not for you (at this young age of 22!) is great because now you've made peace with it. You're not broken because you feel the weight of incredibly unrealistic societal pressures. You are not wrong in how you feel. You are here to enjoy life. There is a spectrum of sensitivity we feel as humans from those who feel nothing at all and some who feel \"too much\". I've always been someone who felt too much. For years i didnt want to identify myself as sensitive because i thought that made me seem weak but the truth is sensitive people are not weak. In fact sensitive people are often incredibly creative and not meant to work a traditional 9-5. Im not sure if you drew that image but its beautiful and if you are an artist i want to encourage you to lean into who you are. Own it. Can't work a regular job? Thats ok! You find a way to turn your passions or hobbies into a job. Will it be easy and fast, probably not but it doesnt matter how long it takes to make money because it's truly about the journey. It  should be enjoyable. If it isn't enjoyable, then that thing probably isn't for you. Even if you try to convince yourself that's what you were supposed to be. It's okay to follow your instincts. Even if your instinct is to just take a nap and not be productive. Society is constantly screaming in our face to hustle but you cannot pour from an empty cup. Sometimes it takes shutting out the world and sitting in silence with yourself. Go through your options and see what feels better. Abraham Hicks says it's like playing the hot and cold game. You feel in your body when something feels better than the other options. Do what feels good to you- not what other people expect of you. This is your life. You deserve to live the way you want. You deserve to be happy. So if everything sucks right now, just focus as much as you can on the one thing that sucks the least and go from there. I'd go more in depth but i feel like Abraham Hicks can explain it better than me ( you can watch abraham hicks videos on youtube ) Ive already rambled on for too long but anyway good luck my friend! You are not alone. You are not a broken mess of person. You are loved and I promise you things will get better. Could be a day, an hour, a year, 3 years ,3 minutes who knows. The more you listen to your inner truth the faster things will change in your favor. Pretty soon you'll be living your best life and you'll know that this low place was a perfect place to now go in the direction of what your true purpose is. Sending you much love on your journey <3",
      "created_utc": 1746217595.0,
      "score": 3
    },
    {
      "id": "mq1fv80",
      "body": "Your thoughts are your reality. Try CBT, you can find workbooks and stuff online",
      "created_utc": 1746115708.0,
      "score": 2
    },
    {
      "id": "mq25lz2",
      "body": "Abno, I hear you and my heart goes out to you. It is not at all easy. You don’t need to believe in miracles. But hey you know what? You are so strong and brave for not giving up. I can’t work well with couple of mine that I have but you live with four of the most difficult ones. Trust me when I say this. You are an inspiration. Prayers for you. It is going to get better with time. Lots of love.",
      "created_utc": 1746123160.0,
      "score": 2
    },
    {
      "id": "mq2i5rp",
      "body": "I can’t really help because you’ve already tried to get help and have heard all the generic “get better” advice but I’m here if you ever need to talk:) cause life sucks, I’m not old enough for college but I definitely relate to the mental hospitals and not being able to do school:/",
      "created_utc": 1746126872.0,
      "score": 2
    },
    {
      "id": "mq2s6or",
      "body": "Try herbal remedies like lions mane and ashwagandha! They’ve changed my life. I take both everyday, read all the reviews of people who have taken them! Definitely worth a shot, I’m a different person entirely! Xx",
      "created_utc": 1746129770.0,
      "score": 2
    },
    {
      "id": "mq35lrm",
      "body": "Hello, dear friends.\n\nI developed insomnia at age 20, then was once called obsessive-compulsive personality disorder, but at about age 30 I settled on the diagnosis of bipolar and my prescription is stable. I'm on a lot of meds, but recently I've been thinking that I could cut back on them (maybe the doctors want to give me meds because they make money).\n\nI'm about 50 years old. When I had a long interview with ChatGPT, it told me, \"You are a survivor who grew up in a morally hazardous family without breaking your own moral compass.\" I couldn't stop crying. These days, I'm finally enjoying being alive.",
      "created_utc": 1746133656.0,
      "score": 2
    },
    {
      "id": "mqfv177",
      "body": "I have ADHD, OCD, severe clinical depression, severe anxiety, and have a 95% chance of having some form of autism (I haven't actually had any real test of that one just a lot of me lines up with a large chunk of the aspects so I'm fairly certain it's just undiagnosed autism) So I feel you on this (at least the general idea of having a bunch of fun letters to describe me). Life be crazy. And you know what live that crazy life! Sure normal would be cool. But these things don't have to define you if you don't want (totally fine if you do want though that's all your choice ya know). Life is different for everyone so some of us get some extra hurdles. We can let them stop us. Or we can jump over them, or sometimes just climb over them or walk around them etc. But I'm going off topic. What I mean to say is you got this OP and I'm rooting for you however you decide to handle your life!",
      "created_utc": 1746309153.0,
      "score": 2
    },
    {
      "id": "mqkq8ec",
      "body": "Hello it sounds to me like you have been through hell and back ,I totally get it I lost my entire family since covid and also to suicide ,it seems to run in my family .my mother was a hospice nurse so all I've ever known is death, I even held my own dead son in my arms on mother's Day so I know death very well.. this should come in his own time and we should not rush it. it's been hard for me also I try to end my life by taking a giant leap off of a cliff instead I woke up after 1years, , comma, so I smashed my brain broke my neck lost my memory broke my arms my legs my ribs my collarbone smashed all my teeth had to have reconstructive surgery ,I was in a wheelchair for 2 years had to have physical therapy psychological therapy.. and miraculously today I survived and I'm happier than I've ever been ,I'm grateful to see everyday and take a breath life is a gift it is precious ,it goes by so very fast in the blink of an eye so try to enjoy it try to find something to take your mind away from the sadness and the hopelessness, when you feel like you're falling apart put on a happy song go outside in the shade put your feet on the earth in the dirt and just breathe,be still. ..be like a tree,, just sit there and breathe... You are not alone, remember you are not broken there is nothing wrong with you,!!!!! if you need someone to talk to I am here 💜🌹🌈",
      "created_utc": 1746382629.0,
      "score": 2
    },
    {
      "id": "mqrshe5",
      "body": "Same here I'm 22 and I don't have a normal life :(",
      "created_utc": 1746477848.0,
      "score": 2
    },
    {
      "id": "mqu9tkz",
      "body": "You are strong and brave for pushing through all of that. I have a brother who has also been in the hospital a few times and has a few mental health conditions similar to yours, struggles with relationships, can't do college because of his mental health etc. I still love him and care for him despite the deep troubles and stuff that happen. It is a constant battle but I believe in you!!\n\nFrom a faith perspective as a theist I believe that their is an afterlife and even if this life doesn't go the way you want it to as long as you seek repentance for your sins constantly, no matter how many, and pray to god you will one day touch the sweetness of your actions! And it will be lasting. So much that you will wish you could go through your life again just so you could do even more, despite all the struggles.",
      "created_utc": 1746510645.0,
      "score": 2
    },
    {
      "id": "mr8vk7u",
      "body": "You seem to have a real talent.  Keep drawing...",
      "created_utc": 1746712838.0,
      "score": 2
    },
    {
      "id": "mq1wkgx",
      "body": "Big ❤️ m8 godbless",
      "created_utc": 1746120565.0,
      "score": 1
    },
    {
      "id": "mq28t4t",
      "body": "Ты можешь зайти на мой профиль, там я рассказываю какой путь прошла и о том что справилась с теми же диагнозами что и у тебя, и если тебе нужна будет поддержка, я всегда смогу тебя выслушать и чем то помочь)",
      "created_utc": 1746124110.0,
      "score": 1
    },
    {
      "id": "mq2w64l",
      "body": "Don't get caught up in diagnoses. They don't fix you. Only self awareness and working on your behavior helps. If you can't work in a typical setting, find one that works for you. No medicine will fix you. No amount of money will change you. Just focus on learning scoping strategies. Take the time to gradually expose yourself to uncomfortable situations for brief durations of time. Build up tolerance to anything preventing you from living a productive life. You can have a good life. Don't let anyone scare you. Believe it or not that laundry list of pyschiatrist terms doesn't define you and may change, especially at 22. Keep going. Be thoughtful, methodical. You can do this",
      "created_utc": 1746130920.0,
      "score": 1
    },
    {
      "id": "mq2ysxi",
      "body": "I just came to say you draw very well and I’m jealous. Have a good day! :)",
      "created_utc": 1746131673.0,
      "score": 1
    },
    {
      "id": "mq3882m",
      "body": "I think you do. But your own kind of normal because, what’s normal anyways! It will take some work but get a good therapist and you can work through a lot of the symptoms to get to the life that works for you! You got this.",
      "created_utc": 1746134461.0,
      "score": 1
    },
    {
      "id": "mq3aznc",
      "body": "I don't have relationships. I don't have any conflict with people because I kinda treat everyone like npcs. Can't get hurt if you don't ever go beyond reactionary interactions.\n\nWould definitely suggest trying to get through it in a healthy way, though.",
      "created_utc": 1746135324.0,
      "score": 1
    },
    {
      "id": "mq3gjpo",
      "body": "[deleted]",
      "created_utc": 1746137100.0,
      "score": 1
    },
    {
      "id": "mq4x3lq",
      "body": "I hear you and I see you and I’m beside you",
      "created_utc": 1746155714.0,
      "score": 1
    },
    {
      "id": "mq54dog",
      "body": "What is your background?",
      "created_utc": 1746158800.0,
      "score": 1
    },
    {
      "id": "mq54h6u",
      "body": "You are perfect just the way you are. But you can fix your problems. You may need medication but you can do it. I believe in you. Very soon, a lot of new medications are coming out. I think you will be much happier with some of the upcoming scientific discoveries. They are coming out with a lot of new drugs in the coming years.",
      "created_utc": 1746158841.0,
      "score": 1
    },
    {
      "id": "mr3pu0s",
      "body": "I made a 7-day confidence reset kit that helped me stop overthinking everything. DM if you want it🔥",
      "created_utc": 1746640031.0,
      "score": 1
    },
    {
      "id": "mrecg3x",
      "body": "It's all in your head. Your situation has a lot to do with your mental state. When you have a better life you will feel mentally stable because all is well. Invest in yourself. Knowledge is power. I felt the same way and then realized at 25 that I have the power to change my shitty situation. Surround yourself with people who are wise and who will help you. Life is difficult so get used to the challenges. Don't be a quitter or a cop out. You are the creator of your own destiny",
      "created_utc": 1746787653.0,
      "score": 1
    },
    {
      "id": "mq1avdg",
      "body": "thank u:)",
      "created_utc": 1746114220.0,
      "score": 16
    },
    {
      "id": "mq1vhlc",
      "body": "thanksss!:)",
      "created_utc": 1746120261.0,
      "score": 2
    },
    {
      "id": "mq2cw6n",
      "body": "How to?",
      "created_utc": 1746125316.0,
      "score": 1
    },
    {
      "id": "mq1n48h",
      "body": "thank u 🥲🥲🥲",
      "created_utc": 1746117854.0,
      "score": 4
    },
    {
      "id": "mq2xhs5",
      "body": "Nah idc if I'm recieved a diagnosed condition or not",
      "created_utc": 1746131297.0,
      "score": 2
    },
    {
      "id": "mq1gku9",
      "body": "also i love ur drawing",
      "created_utc": 1746115921.0,
      "score": 2
    },
    {
      "id": "mq1uz13",
      "body": "thank uuu!",
      "created_utc": 1746120113.0,
      "score": 3
    },
    {
      "id": "mq1n5pr",
      "body": "thanks!",
      "created_utc": 1746117866.0,
      "score": 2
    },
    {
      "id": "mq2t1ni",
      "body": "Predominately ashwagandha! x",
      "created_utc": 1746130020.0,
      "score": 2
    },
    {
      "id": "mq1wtqv",
      "body": "thank u!",
      "created_utc": 1746120638.0,
      "score": 2
    },
    {
      "id": "mq4z8a9",
      "body": "For the sake of anonymity, I will say that this is one of the Asian countries",
      "created_utc": 1746156601.0,
      "score": 0
    },
    {
      "id": "mq555bi",
      "body": "hmmm im not good at english and i don’t know what do u mean by background:(",
      "created_utc": 1746159142.0,
      "score": 1
    },
    {
      "id": "mq3ztso",
      "body": "You are who you are, you say you can change ... but can we really? I have my social days, I have my isolation days. It is all OK. I am not made to be friends with most, I am not made to be loved. Put me at a party, I ignore the humans and befriend the dog. Not many like it but I am happy. https://youtu.be/LNRVy4CN5xw?si=9R2BmOF1OObITlL8",
      "created_utc": 1746143640.0,
      "score": 1
    },
    {
      "id": "mqh1opf",
      "body": "Hope you get better ",
      "created_utc": 1746325401.0,
      "score": 2
    },
    {
      "id": "mq1ncfj",
      "body": "thank uuuuuu🩷🩷🩷",
      "created_utc": 1746117921.0,
      "score": 2
    },
    {
      "id": "mq21c73",
      "body": "No probs hope u get well soon  and keep the drawing up absolutely terrific",
      "created_utc": 1746121922.0,
      "score": 1
    },
    {
      "id": "mq7uo67",
      "body": "Where are you from?",
      "created_utc": 1746201863.0,
      "score": 1
    },
    {
      "id": "mq7wlxv",
      "body": "from central asia!",
      "created_utc": 1746202416.0,
      "score": 1
    }
  ]
}