{
  "id": "1felvyg",
  "title": "I Survived a Genocide But I Feel Nothing",
  "selftext": "I managed to evacuate from Gaza, leaving behind the rubble, the bodies, and the memories of the war zone. You’d think getting out would bring relief, a sense of safety—but all it brought me was emptiness. I thought once I escaped, I’d be able to feel again, to grieve for the lives lost, for the people I knew. But I feel nothing.\n\nI’m in a place far from the violence now, surrounded by people who are living normal lives. They go about their day, complaining about trivial things—traffic, their jobs, relationship problems. And I just stare at them. How do they not realize how absurd it all is? I survived hell, saw children torn apart in the streets, watched families disappear overnight, and now I’m expected to care about small talk? I don’t.\n\nEven after I got out, people wanted me to share my story, to talk about the horrors I escaped. But every time I do, I feel detached, like I’m telling someone else’s story. I describe the destruction, the bodies, the screams, but it feels like I’m reading from a script. I can’tonnect to it anymore. It’s like I left my emotions back there, buried under the rubble.\n\nI’ve lost all sense of empathy. When I hear about someone dying, even someone close, it doesn’t register. I didn’t cry when I found out a friend of mine didn’t make it out. I didn’t care when I heard about others losing everything. I go through the motions, pretending to sympathize, but inside, it’s just blank.\n\nPeople think escaping the genocide means survival, but it’s not true. Part of me died there, and the part that made me human never made it out. Now, when I see images of what’s still happening, or hear about others’ struggles, I can’t bring myself to feel anything. I walk past people begging for help, and I feel no urge to stop.\n\nI’m broken in ways no one can see. On the outside, I’m functioning. I smile, I work, I talk to people. But inside, I’m just as destroyed as the streets I left behind.\n\nIt’s been 5 months ",
  "created_utc": 1726090624.0,
  "score": 1099,
  "num_comments": 118,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1felvyg/i_survived_a_genocide_but_i_feel_nothing/",
  "comments": [
    {
      "id": "lmon87v",
      "body": "You are describing dissociation which is one of the brain's survival mechanisms: to disconnect from your feelings connected to the trauma so you can function and not get crushed by the emotional and factual reality of what you have been through.\n\nIt is difficult to break through that wall that protects you. But if you want to do that, you definitely need to talk to a trauma focused therapist.\n\nI am really sorry to hear that you had to experience such horrors. I hope that you will eventually be able to connect to life again.",
      "created_utc": 1726096826.0,
      "score": 553
    },
    {
      "id": "lmo8avr",
      "body": "I don't know what to say but I didn't want to ignore your post. I cannot imagine what you have suffered and I'm so distressed anyone has to go through something like that. I wish I had something comforting to say but all I can say is that I'm so angry that suffering on this level exists.",
      "created_utc": 1726091372.0,
      "score": 186
    },
    {
      "id": "lmorgz8",
      "body": "What your experiencing is dissociative detachment. Your brain is protecting you from the impact by segregating it away and not letting you feel it. It is a protective mechanism and it might allow you to continue to live your life but it also might mean that the trauma will affect you in different ways throughout your life moving forward. I highly highly highly recommend seeking EMDR. To process and refile the memories may help. Definitely seek professional help and see what they say. I'm so sorry for what you experienced and my heart goes out to you.",
      "created_utc": 1726098432.0,
      "score": 63
    },
    {
      "id": "lmod7ke",
      "body": "You’ve been through a lot and you’ve had enough. It’s understandable. Give yourself time",
      "created_utc": 1726093104.0,
      "score": 58
    },
    {
      "id": "lmooixq",
      "body": "Everyday people who don’t live in a war zone cannot even fathom the extent of the damage it does to a persons psyche. It also makes me sick seeing people who are so care-free and privileged going about their lives complaining about stuff like traffic lights or whatever when we have literal war going on in our past, present, and future. \nI am so sorry you and anyone else has had to endure this extreme level of duress.",
      "created_utc": 1726097317.0,
      "score": 101
    },
    {
      "id": "lmotctn",
      "body": "I absolutely can’t imagine your mental health status or that of anyone either still alive in Palestine or evacuated… this is like the most intense trauma I think anyone could ever endure. I’m so sorry you’ve had to experience that and wish I could carry just a fraction of your pain for you. Hang in there, day by day",
      "created_utc": 1726099144.0,
      "score": 21
    },
    {
      "id": "lmosxp4",
      "body": "What you're experiencing is probably dissociation, and it's most likely the only possible human response to the horrors that you've seen. Your nervous system had to shut off everything happening around you and not perceive it in order to survive the emotional burden. Now that you subconsciously isolated your feelings for so long, you don't know how to feel or care anymore. And that's totally normal. People have that response for way smaller trauma. You'll probably need a lot of therapy to hopefully recover a bit in this lifetime. But it's totally understandable that your brain never wants to feel or perceive anything ever again.\n\nYou should also not blame yourself for not feeling as good as you hoped now that you're safe. The anticipation of the relief that you thought you would feel is what your mind fed you in order to survive and survival is our strongest instinct (which can be frustrating in this world, because often it feels not worth it to survive, especially with the things you've seen). You were in a situation of extreme and prolonged stress and shock, in a state of emergency, so your body and mind will need a long time to recover. They need a break. Our human minds didn't evolve to handle these atrocities and this level of destruction.\n\nTake it slow, one step at a time, just look at the close way forward and know that your feeling of numbness is valid. You need to give your brain time and when you're ready, seek therapy, even though it will be a long process to find a qualified therapist on this topic, few people can remotely relate to what you went through and their suggestions will sound tone deaf to you. Probably a therapist that specializes in PTSD could be good. \n\nMaybe also try to express your feelings to people who experienced the same thing and escaped, if you know any. They will understand you better than anyone. All of us here cannot imagine what you went through. At some point you might even feel survivor's guilt. But just know that you didn't deserve to get your humanity taken away like this. So try to get it back, at least a small portion of what you used to be. It's a matter of justice, it was stolen from you and you deserve it back. But give it time, don't try to force it. I'm hoping for the least pain possible in the years to come for you. I'm truly sorry you had to experience that.",
      "created_utc": 1726098986.0,
      "score": 37
    },
    {
      "id": "lmox11g",
      "body": "Use your current composure to set up a support system that’s gonna help you get through the shitshow when it catches up to you, please trust me. You aren’t feeling it YET. There are more ways than one it can manifest when it’s ready to surface, set yourself up for minimal chances to be caught off guard, because you might not end up just critically shaken up - but in a shape to pose danger(s) to yourself and perhaps even others.\n\nSorry to sound shitty with this, but it is what it is.\n\nI am, regardless, profoundly sorry for the situation which has affected you among so many. Routing for you.",
      "created_utc": 1726100556.0,
      "score": 16
    },
    {
      "id": "lmoyepe",
      "body": "I really don’t know what to say except there is no playbook for what you’ve experienced. I can barely live a “normal” life watching it on my screen from afar, so I cannot fathom what you’ve been through. I appreciate you sharing your experience though. That’s important. You don’t owe anyone happiness or a smile. You’ve seen and experienced things that we aren’t supposed to ever see or experience. You’re reacting probably as “normally” as possible. I wish you all the best.",
      "created_utc": 1726101076.0,
      "score": 15
    },
    {
      "id": "lmoz62m",
      "body": "Fuck I'm really sorry. You feel what you need to feel, when you need to feel it. It's not a good idea to be upset with yourself for WHAT you're feeling. I can't imagine what you've been through, it's more than we're supposed to be able to endure.",
      "created_utc": 1726101362.0,
      "score": 14
    },
    {
      "id": "lmokihv",
      "body": "I cannot begin to imagine how you must be feeling right now. If only I could take even 1% of your suffering to myself. No human being deserves to go through something so horrifying, ever. There are no words I can say to take your pain away but I am keeping you in my thoughts. 🫂 Take it one day at a time.",
      "created_utc": 1726095803.0,
      "score": 11
    },
    {
      "id": "lmp1kek",
      "body": "You've experienced an immense trauma. I think it's only natural to be in shock, detached... you're literally traumatized. don't try to rush the journey to \"normal\". \"Normal\" just got removed from your dictionary. All there is is the horror before, now and.. \"trivial\", which encapsulates everything else. That's OK for now. I'm glad you're safe. You can rebuild, in time. But whatever you're feeling (or not feeling), right now is more than normal. Your body and brain are still trying to process what they just endured and witnessed others enduring. It's OK not to be ok. Its OK not to feel. Be patient with yourself. When you're ready to talk, go to therapy to help you unpack all the things you should have never had to go through.",
      "created_utc": 1726102265.0,
      "score": 9
    },
    {
      "id": "lmoj095",
      "body": "I’m so sorry",
      "created_utc": 1726095243.0,
      "score": 7
    },
    {
      "id": "lmou3sj",
      "body": "as someone who has survived unspeakable horrors and trauma as well, i see you and i hear you. it’s really hard to care about the trivial things when you’ve been through (and in a sense are still going through) such awful things. i just wanted to let you know that you’re not alone.",
      "created_utc": 1726099432.0,
      "score": 8
    },
    {
      "id": "lmp1otf",
      "body": "I’m so sorry for what you have gone through. This crippling apathy is one I know all too well. After being forced to immigrate from Syria due to the war, I feel as though I left my whole identity there; well, however big an identity one develops at 11 years old. During the past ten years I’ve spent in the US, not once have I felt like my authentic self. Rather, I was a shell of a human. I still am, a shell of a human, passively going through the motions of life with no real care for what I’m doing. Similar to you, it feels like my real self got buried under the rubble somewhere back in Syria. This emptiness has gone on for so many years that I can no longer explicitly distinguish it, but I can still sense the weight of it somewhere in the back of my mind, haunting my every move, decision, and social interaction.\nRecently I’ve realized this is most likely not something I can amend on my own, and I will need the help of a professional. What we’ve experienced is not normal, and it should never be viewed as such. While we may get distracted by the mundane things that come with the newfound peace we’ve been lucky enough to attain, the trauma is always gonna be there, interfering with and tainting our quality of life. Inner work needs to be done to address and dismantle it. I hope the fact that someone out there relates to your experience is as comforting to you as reading your post was to me, in spite of how horrific our experiences have been. I wish you true happiness, and I wish you can make it out of this, just as I wish for myself.",
      "created_utc": 1726102312.0,
      "score": 8
    },
    {
      "id": "lmozvst",
      "body": "You're still in survival mode from a traumatic event. It will take time to feel again. You're numb and still going through the motions. What you're describing is likely a combination of PTSD and C-PTSD symptoms. I highly recommend you take advantage of whatever resources you have to talk to professionals and relate to those who have those symptoms. And do whatever you can to express yourself, even if it's through music, media, or other forms of self-expression like writing.",
      "created_utc": 1726101630.0,
      "score": 14
    },
    {
      "id": "lmoo111",
      "body": "we often need to jumpstart our feelings again after enduring an extended period in hell... treatment for our post war veterans who feel the same generally have to start each day with yoga, eat a light breakfast -- nothing too rich.. go into nature, sip some herbal tea (nothing caffeinated, no stimulants..) cycle down as much as possible, using breath work can help.. the idea is to be calm as possible. the heart should move more like a wave than a beat.. while doing this, meditate on wholesome things that you are grateful to be still alive for... it may take some time but the magic is in the genuine feeling of it... we have to hunt the good. even if it takes an hour or 2, we have to find it.. feel as much of it as we can, and do this each day.. this is generally how the way back starts",
      "created_utc": 1726097129.0,
      "score": 6
    },
    {
      "id": "lmp89d9",
      "body": "Im sorry :( im palestinian, although im outside, i cant believe whats happening to my family stuck in gaza, its inhumane whats happening to my people with no way to help them..",
      "created_utc": 1726104875.0,
      "score": 38
    },
    {
      "id": "lmoyw45",
      "body": "I don’t blame you since what u went through was traumatic , it wasn’t easy sometimes when something horrible happens for a long time we become emotionless",
      "created_utc": 1726101259.0,
      "score": 6
    },
    {
      "id": "lmpk04g",
      "body": " Seek therapy, Surviving warfare is something you can’t handle on your own",
      "created_utc": 1726109604.0,
      "score": 6
    },
    {
      "id": "lmr5idf",
      "body": "I want to take a moment to genuinely thank everyone who took the time to read and engage with my story. Your words of support, your advice, and your compassion mean more than I can express. \n\nSharing something so deeply personal is never easy, but seeing how many of you took the time to respond with kindness and understanding reminds me that there are still people who care about humanity. Your support gives me strength, and for that, I am truly grateful.\n\nTo those of you who offered thoughtful advice, encouragement, and empathy, thank you for helping me feel less alone in this journey. It’s a reminder that there’s still light, even when things feel dark.\n\nHowever, for anyone who tried to turn this into a political debate, blaming us or the Palestinian people for the horrors we’ve endured, only to end their comment by wishing me “healing” — I won’t take your words seriously. Hypocrisy has no place in true support. If you can’t acknowledge the reality of what we’ve been through, then your so-called “wish for healing” is nothing but empty, meaningless words. Keep your fake sympathy to yourself\n\nAgain, to everyone who showed real support, thank you from the bottom of my heart.",
      "created_utc": 1726143192.0,
      "score": 13
    },
    {
      "id": "lmp3418",
      "body": "I wouldn't worry about not having empathy or emotion in what you are talking about. Thank you for sharing your story. I'm so glad you are out. And you are out of fight mode and finishing the flight mode. Find your wise mind where your heart and heart body connect. Definitely look into therapy I'd go more than 1x a week too. Give yourself hugs and massage lotion into your skin so you are more centered/stop dissociation. Professionals can do this lots of self help books too but you deserve the best. Some books can trigger another issue. I hope you find peace of mind and connection.",
      "created_utc": 1726102851.0,
      "score": 4
    },
    {
      "id": "lmp67nv",
      "body": "It sounds like PTSD. You might still be in the survival mode that you recognize you are physically safe but you do not feel safe and calm yet. After all the catastrophic things happen, your brain is trying to protect you by disconnecting you from any negative feelings. It’s okay to feel this way. I hope you get better slowly. If possible, see if you can get medication or therapy. It might take a long time to recover from this",
      "created_utc": 1726104064.0,
      "score": 6
    },
    {
      "id": "lmp0foa",
      "body": "I'm so sorry that humanity is this way.  I wish it wasn't. I don't have anything to add but I felt wrong just scrolling on.",
      "created_utc": 1726101840.0,
      "score": 12
    },
    {
      "id": "lmpg9mc",
      "body": "May Allah swt bring you healing and ease ❤️ Reach out to a therapist that can help you please 🙏🏻",
      "created_utc": 1726108044.0,
      "score": 11
    },
    {
      "id": "lmp15ci",
      "body": "I surived a war too its been more than a year and am still struggling am so sick from all this",
      "created_utc": 1726102108.0,
      "score": 4
    },
    {
      "id": "lmpiwf5",
      "body": "Pray. Hold on to your faith. Be in community with family and friends, even if you want to isolate. You need emotional support during this time and I hope you can receive it. Even if it’s from a bunch of strangers online, we would hold space for you. Take care and I wish you happiness and healing 🤎",
      "created_utc": 1726109138.0,
      "score": 4
    },
    {
      "id": "lmpn3ye",
      "body": "Your experience is *very very normal* for someone who has been through a lot of trauma, especially the kind you describe. You feel numb because that sense of detachment is what allowed you to survive a genocide. Otherwise, the experience would be too emotionally overwhelming and you would not be able to take care of your survival needs in the midst of it. \n\nGive yourself grace around it. *It’s only been five months* since you got out. The experience is still very fresh and new in many ways. You need time and space to adapt to your current life.\n\nPeople should not be pressuring you to share your story. That’s your decision. When you are ready, you may benefit from working with a therapist who specializes in trauma. My guess is that the numbness will eventually wear off and you will feel again (and very strongly) or the numbness won’t wear off but it will come at a cost (like struggling to connect with other ppl). It might be good to have professional support from someone who understands this process.",
      "created_utc": 1726110953.0,
      "score": 5
    },
    {
      "id": "lmoanv3",
      "body": "You can try to find therapy and slowly get back to regular life.   \n  \nThe chance that it will hit you like a truck at some point is high, but that only means that your body is ready to move forward, if that happens.   \n  \nOther than that, I know what you mean. I haven't gone through a war like this, but many traumatic things and crisis' has happened to me. I feel like, it is part of life. During life, we lose some pieces here and there. Often we do only function. 5 month is not very long and you may feel like all of this is completely useless and what's the point of survival even. Everything feeling surreal and pointless. It may feel better in a year, but for me, it always felt like a stupid waiting game.",
      "created_utc": 1726092190.0,
      "score": 13
    },
    {
      "id": "lmpoat8",
      "body": "I feel you, PTSD is weird. I'm like 18 years past what started it (I've had several more major traumatic things happen but yea started 18 years ago) and only recently figured out how to \"be a person\" again. Take it one day at a time and be patient with yourself, and yes people's problems are abysmal compared to the horrors of what actually happens in the world you're 10000000% correct, though it is also my biggest source of peace at this point. Nothing can be as bad as what I went through, and if it is I already got through it and know I could if I had to. I'm gonna tell you some basic hard facts I've learned: at the end of the day you are the only one you will ever have, you are your biggest supporter, nothing is black and white, you can't save everyone, it sorta feels like you cheated death and you sorta did but that doesnt mean you have to leave a major mark on the world because you feel like you were spared or like people deserve more, trying to enjoy being alive is more than enough of a reason to be alive. Just don't be an asshole to people if their problems seem smaller, we're all anxiety programmed meat sacs with electricity controlling our heads and it gives us emotions none of this is ideal.",
      "created_utc": 1726111484.0,
      "score": 3
    },
    {
      "id": "lmpqcth",
      "body": "I'll give a more nuts and bolts type answer, not as touchy feely as others but I'm pretty detached myself. \n\nPTSD, dissociation, strong mental/emotional protectors. I have similar and the things I went through were far far less traumatic than your experience. Even so, I can say my feelings and my connection to life and empathy and compassion have not returned and it's been years. Its been a real problem in relationships. Only this year did I recognize that this is a trauma response and it actually needs to be dealt with--it won't necessarily just fade with time, so I highly recommend getting some sort of help for it.\n\nI'm not big on regular talk therapy, especially as someone with so many blocks. I could talk about it forever and still not get the walls to come down because they are so unconscious.  I like the idea of EMDR but havent tried it. I personally am doing parts work (internal family systems) therapy. Its all about working through your \"protector parts\" (for example, my numb part, my objective part, etc) and once you can get through them you find the traumatized parts of yourself underneath and work on healing them. Its a weird type of therapy but I really believe I found the best fit for the type of healing I need. Maybe you could benefit from it too.",
      "created_utc": 1726112433.0,
      "score": 3
    },
    {
      "id": "lmpx19h",
      "body": "Take it slow. Sending you love and condolences. There is no \"right way\" to be after making it out. It's okay to dissociate while you learn your new normal. It's okay to not be able to empathize or feel it's fair. Grief and trauma and survival mode wreck havoc on the body. Just take it slow.",
      "created_utc": 1726115793.0,
      "score": 3
    },
    {
      "id": "lmottmg",
      "body": "You're strong, i admire you, in your situation I would probably kill myself.",
      "created_utc": 1726099323.0,
      "score": 2
    },
    {
      "id": "lmproiz",
      "body": "You're not broken!!! Your brain is working exactly as intended to protect yourself from the horror you have lived through. Please don't judge yourself right now. If you are able to start seeing a therapist with some PTSD experience, I think it will really help. Many have sliding scales for fees and there are so many people who are behind Palestine, I am sure there will be someone who can start to talk about this with you.",
      "created_utc": 1726113064.0,
      "score": 2
    },
    {
      "id": "lmresua",
      "body": "As a person who experienced prolonged and inescapable torture throughout my childhood, I can thoroughly relate to the dissociation and lack of empathy.\n\nAs a person who grew up surrounded by gang violence, in an area abandoned by authorities, I can relate to the numbness of surviving something that so many others never could. \n\nI’m 30 now and still live in disbelief that I’ve made it that far. I know so many that didn’t, and won’t. \n\nI’ve spent a long time trying to establish meaning and reconcile what civility could possibly exist in such a brutal world. \n\nMy heart goes out to you. \n\nI recommend the r/cptsd subreddit as a lot of people there can relate to experiences of inescapable and prolonged trauma. If I find any groups related directly to escaping war, genocide, or the experiences of refugees, I’ll be sure to come back here and recommend them to you. \n\nIt’s ok to just maintain until you can find the time, place and space to heal. \n\nIntellectualizing what you cannot yet feel can be helpful. \n\nTry not to overwork yourself. It can be a coping tool, but burnout can make healing even more complicated. \n\nI hope you’re able to taste nutritious food and smell the essential oils in your baths. I wish you whole and expedient healing. 🫂",
      "created_utc": 1726146983.0,
      "score": 2
    },
    {
      "id": "lmsgl8s",
      "body": "I am really sorry. I don’t know if I, or anyone else can ever say the right words as a response. Even in my worst nightmares, I don’t go through what you have been through. Nothing we do will ever be enough. No form of repenting will wash away the blood we all have on our hands. I pray you find peace someday. Maybe not today, not in 5 years but someday. As someone who has gone through far far less, and I feel ashamed as I type this even and has experienced dissociation. Start with the small things, try to use your six senses very mindfully. Its not a lot but something to start off from.",
      "created_utc": 1726159577.0,
      "score": 2
    },
    {
      "id": "lmv2d8i",
      "body": "I wish i could help, I know this won't help but I'm sending a hug. \n\nNote: i know this has no place here, but your writing is beautiful. Its a talent. 🤍",
      "created_utc": 1726191541.0,
      "score": 2
    },
    {
      "id": "lmv4z8t",
      "body": "Hope you get to take care of yourself. Free Palestine 🇵🇸♥️",
      "created_utc": 1726192538.0,
      "score": 2
    },
    {
      "id": "lmwaz0d",
      "body": "Take some time, talk to someone, and one day you’ll feel again …i wouldn’t rush it with what you’ve experienced..I’d say you’re experiencing normal thoughts",
      "created_utc": 1726214413.0,
      "score": 2
    },
    {
      "id": "lmwg2vz",
      "body": "This post was incredibly eye opening. I’m so sorry you had to witness such needless monstrosities. It is quite literally impossible to imagine what you and everyone there have experienced.",
      "created_utc": 1726218066.0,
      "score": 2
    },
    {
      "id": "lnb51he",
      "body": "Let me just share my one quote just feel it inside:\n\" Yesterday was history, Tomorrow is a mystery, but today is a gift that why it is called present\"\nSometimes the best action it to just wave and say good bye to past. May god help you .",
      "created_utc": 1726433581.0,
      "score": 2
    },
    {
      "id": "lnjfvub",
      "body": "I have CPTSD from the time I was a kid (I did experience some traumas this year too) and didn’t go through anything close to what you did, and that still happened to me with the empathy. I still struggle to feel empathy for others. But my mental health issues cause me to focus a lot on my trauma so that’s where we differ. Talk therapy doesn’t help. All that helps is trying to heal and grow and have and give myself the love that I crave from others. I hope to do EMDR when I’m more stable.",
      "created_utc": 1726559988.0,
      "score": 2
    },
    {
      "id": "lmoindc",
      "body": "First of all, I'm very sorry for you. It must've been though, all the stuff you've seen and everything you went through.\n\nTruth is though, that people can't look into other people's lives. Something that is very hard and difficult for one, might be just a bump in the road for another. You can only feel what you've experienced, and only imagine a fraction of what someone else must feel. It's a very difficult concept since people are lost and attached to their own being and life which is normal. \n\nFor the fact that you're not able to connect with stuff, im pretty sure it's probably because you haven't been able to process everything properly. I think (and this is a theory) that a lot of people go numb because they are not letting themselves process everything. They put it in a box in the backs of their minds because they don't wanna think about it or don't wanna see it. It's a very though situation and I would recommend seeing a therapist. \n\nThe best of luck and I really hope that you'll manage to get yourself together a bit.",
      "created_utc": 1726095111.0,
      "score": 3
    },
    {
      "id": "lmoly9e",
      "body": "its called apathy when your subconscious mind faces alot of trauma it turns of the aspect that feels so you just don't feel anything good or bad doesn't mean anatomically your brain is messed up but emotionally you won't feel anything",
      "created_utc": 1726096346.0,
      "score": 4
    },
    {
      "id": "lmp8uq0",
      "body": "I’m so sorry you had to deal with the war and all that came of it.",
      "created_utc": 1726105109.0,
      "score": 3
    },
    {
      "id": "lmpkxzm",
      "body": "Esther Perel talks about this regarding people that survived the holocaust still ended up leaving the camps not alive. Sounds like you're going through something similar. \n\nSorry you're going through this and hope you heal.",
      "created_utc": 1726110006.0,
      "score": 4
    },
    {
      "id": "lmolsik",
      "body": "In the end, us humans can only focus on working. The more we appreciate Any work, the more value in the outcome. Whatever good comes to your mind when you think about working is what you shall strive for. Allah, life, sports, job, a family etc. Work until your phase of stress appears and then you can at least say that you feel something and work on some problems in shaa Allah. May peace be upon you and any other reader",
      "created_utc": 1726096285.0,
      "score": 2
    },
    {
      "id": "lmq35by",
      "body": "Believe it or not, it's there. It's scary to experience this when it's over a long period of time, even if you don't really \"feel\" the fear all the time. But I promise you the empathy is there; trauma just puts a block on it. Sometimes, it can be a very thick blockage. The sooner you start working on it with a therapist, the better luck you may have trying to break through it.\n\nMy brain is the same way from childhood trauma. My brain didn't work the same as the other kids'. I kind of started out that way in life. Talk was unimportant, I could not connect. I didn't even understand others' happiness. Seemed dumb to me. I still struggle with it because I didn't get help soon enough. But it still was just a blockage. It's a very good thing your brain does for you that allows you to function temporarily. It's looking out for you, even if it feels like it's no longer helpful. It's less of a brokenness and more of a demonstration of how we've evolved to navigate anything as human beings.\n\nQuick tip: Make sure to find a therapist that works with trauma and PTSD, specifically. Not every therapist is equipped to handle trauma, and not every one wants to. If you get one that shows discomfort or is unprepared, it can cause you to bury things more. I would recommend very regular appointments, even starting at once a week if you have the time.  For as severe as the trauma was, you're going to have to combat it just as severely.",
      "created_utc": 1726119213.0,
      "score": 2
    },
    {
      "id": "lmq4oce",
      "body": "Dear OP. Are you able to access free therapy where you are? I would suggest trying to find a good trauma therapist that specialises in PTSD. Also looking into EMDR. Really hoping you get the treatment you deserve",
      "created_utc": 1726120124.0,
      "score": 2
    },
    {
      "id": "lmst3jg",
      "body": "Hey u/ShatteredExistence_, I’m so sorry for everything you’ve been through. I can’t begin to imagine the depth of the pain and trauma you’ve experienced, and I want to acknowledge the strength it took for you to share this here. Surviving something like this can leave us feeling disconnected, like part of us is still trapped in that place, even when we’ve physically moved away from it.\n\nIt’s understandable that you feel detached from your emotions—after enduring such unimaginable loss, our minds can sometimes shut down to protect us from the overwhelming pain. Feeling like you’re going through the motions without being able to connect to the world around you doesn’t make you broken; it’s a response to what you’ve survived. What you’re experiencing is valid, even though it’s incredibly difficult.\n\nPlease don’t hesitate to seek support, whether from a therapist who specializes in trauma or even just by continuing to reach out in spaces like this. You don’t have to carry this alone. If you’re comfortable, feel free to message me anytime if you want to talk further, or if I can help find resources in your area.\n\nTry and be kind to yourself, you’re worth it. ♥",
      "created_utc": 1726163459.0,
      "score": 2
    },
    {
      "id": "lmt0vq9",
      "body": "That may sound weird, I haven’t been in Gaza, but I’ve been touch so much by the genocide that there was a time where I was watching videos of the genocide, the bombs, the bodies, the destroyed buildings, but also soldiers celebrating (ew) for day longs. I was very sick at that time, in pain and bedridden, I ended developing the same thing you’re talking about. I was so angry and frustrated to anyone that would talk about something else on social media, I couldn’t be in touch with reality anymore. The thing is that I wasn’t in Gaza like you were. When I realized how deeply I was into this I decided I had to stop watching all of the videos. But then it happened after month of watching it ? Anyway, I feel better now. I even meet with a trauma informed therapist once a month (for other type of trauma). My opinion is you seem suffering from PTSD and dissociation, and I truly understand you when you say nothing makes sense anymore, it will come back but you gotta do the work. You also got to keep living life for the one that stayed back. I also go to demonstrations and do a lot of different things to help those people, it helps my mental health knowing I’m doing at least something for the cause.",
      "created_utc": 1726165934.0,
      "score": 2
    },
    {
      "id": "lmpz8qv",
      "body": "Could be PTSD and either gets better or worse. You should talk to a therapisr and try to open things up a little",
      "created_utc": 1726116991.0,
      "score": 1
    },
    {
      "id": "lmq7i41",
      "body": "idk  what to say but im sorry humanity is this way",
      "created_utc": 1726121886.0,
      "score": 1
    },
    {
      "id": "lmqbgl1",
      "body": "However your body and mind is reacting to these circumstances is, how it’s supposed to feel. Your brain is a muscle, and just like any muscle it can be damaged from an overwhelming amount of usage. Your brain constantly having to process the horrors you experience is naturally going to leave you drained. You deserve so much grace from the world around you and yourself. I hope that one day you experience the peace that you deserve.",
      "created_utc": 1726124495.0,
      "score": 1
    },
    {
      "id": "lmqi23c",
      "body": "i couldn't just scroll after reading your post. I'm so sorry for what you've had to go through and the massive impact it's had on you. i unfortunately have nothing to add and I don't think anything anyone says here will make you feel okay. i hope you get the care, help and attention you require.",
      "created_utc": 1726129172.0,
      "score": 1
    },
    {
      "id": "lmqkg50",
      "body": "Sometimes small talks is what makes people still feel ‘alive’ but I wouldn’t blamed you for feeling that way so don’t blame yourself. But, most of us also felt the ick to the people who lacks the awareness or just doesn’t care at all to what’s happening in the world. They think, As long as it’s not their problem, they don’t want to care and get involved in anyway. I find it so revolting. \n\nBut anyway, you seriously needs to talk about it to someone, best if they’re someone close and care about you, second ask help with professional. My life lesson recently that i learned is to never be ignorant about anything.. Im so sorry you had to go through that i wish i can hug you",
      "created_utc": 1726130910.0,
      "score": 1
    },
    {
      "id": "lmqqk7l",
      "body": "You most likely have C-PTSD (complex) you are dissociating constantly. Your mind is trying to protect from the danger it most likely still things your in. It also may be shock, sometimes it can take YEARS before you feel something and realise the effect of it being real.",
      "created_utc": 1726135208.0,
      "score": 1
    },
    {
      "id": "lmqu4ol",
      "body": "I’m so sorry. :( you must be in total shock. How you feel and the way you’re coping makes complete sense. You don’t owe anybody empathy.",
      "created_utc": 1726137460.0,
      "score": 1
    },
    {
      "id": "lmr9j9t",
      "body": "You are still in survival mode. \n\nAre you in therapy?",
      "created_utc": 1726144915.0,
      "score": 1
    },
    {
      "id": "lmsi6d8",
      "body": "Thank you for sharing this because I understand as a survivor of trauma myself what you are describing. I struggle to feel any type of emotion. When I do it is overwhelming and intense. Sometimes I think I would cry if I could shed a tear. You are right to hear the day to day small talk is so pointless when you lived in a world for so long that didn't seem real to others but real to you. It makes everything they talk and worry about meaningless when you have witnessed such horrific things. I was abused several years almost killed a few times and it's like you say I feel like when I talk about it that it was someone else's nightmare. When I do feel anything it's like a sad feeling of emptiness I cannot explain and nothing can make it go away. \n\n I have thought a few times myself bout going to a therapist but really don't know how I would be able to share and lay everything out on the table that has happened. Sorry you had to go through what you did and what you are facing now. Thank you for your service and I pray 🙏 that you find what you need to move past the things that you feel now.",
      "created_utc": 1726160066.0,
      "score": 1
    },
    {
      "id": "lmskw8g",
      "body": "i’m sorry. on behalf of the “civilized” world, i sincerely apologize. So fucking infuriating",
      "created_utc": 1726160913.0,
      "score": 1
    },
    {
      "id": "lmu4ojt",
      "body": "i understand what you mean when you say talking about things won’t change anything. i came to that realization in my most recent therapy session. all of my therapist’s suggestions were honestly making me angry because it feels like it doesn’t matter. sure, i can do all these little things to give myself relief sometimes. and the more skills i learn the more relief i can get. but sometimes it feels like none of that matters. nothing will can change what has been done. the effects of my trauma are there, and sometimes all that i can really do is suffer. \n\nMy sister suffered sexual abuse as a very young child for years, she also felt like a part of her died. through therapy she feels that she has been able to reconnect with those parts of her that she thought were gone forever. they are still “damaged” she says, but she can connect with them and they are healing. little by little. \n\ni do think it is possible for you to feel again. i think you will be able feel good again, and also reconnect with your empathy and grief. EMDR might be something that is extremely helpful for you, and a good therapist. It’s okay to not feel anything right now. I do think it’s a good idea to see a therapist before you actually feel ready to talk or ready to feel your feelings. they could help by monitoring you in the meantime which I think is for the best.\n\nWhat you’ve gone through and what is happening in Gaza is so beyond comprehension, I can never find the words to describe how horrifying it must be to experience this. All I can say is i’m so sorry that humanity has failed you all. This is a great wound to all of humanity and lots of people around the world feel your pain as much as we possibly could without being there ourselves.\n I’m so glad to hear that you are now safe. I wish you all the peace and justice the universe can give you.",
      "created_utc": 1726178860.0,
      "score": 1
    },
    {
      "id": "lmv4f8i",
      "body": "Though I’ve never experienced anything like you have, I have gone through my little slice of traumatic events in the last few years including surviving a house fire. \n\nWhen my therapist told me my feeling of being disconnected was trauma related and possibly ptsd, I didnt believe her but now I see it.\n\nIve only gone through a fraction of what you have, and Id imagine your dissociation is very strong.  The good thing is that with time you will get a bit better, and with therapy or at the very least a strong focus on processing your thoughts, emotions, and the traumatic events that happened, you will feel alive again. It’s going to take time though, a lot of time probably. \n\nThe shit you went through is unreal even to those who didnt experience it, even when I see the explosions on the news I don’t believe it… its to horrible to not be some kind of movie or action scene. I begin dissociating just looking at reports of the events, but you going through it is something else. \n\nYou are experiencing dissociation and probably some ptsd even if you dont experience flashbacks or react to loud noises. You will get better but it will take time, and honestly it will take “accepting” and acknowledging the reality of what is happening. It will take a while though, but I believe a huge part of dissociation is just not accepting the awful realities that happened to you end people around you. It is so hard to accept something so horrible, so for now just keep doing as you are doing.\n\nYou are doing incredible given the circumstances, and with time and hopefully an eventual slow down or hopefully an end to the conflict you will be able to feel normal again. Its really a matter of time, stick around and in 5,10 and 15 years you will look back and see it more clearly and have accepted brutal reality. Its sad but this is the nature of trauma, shitty things happen and our brains disconnect the emotional part from the rest of you to keep you functioning, and to recover the emotions takes time and coming to terms with the trauma.\n\nIm still so sorry this happened to you, genuinely. I don’t know what to make of the conflict aside from how useless and stupid and cruel it is. People dying for nothing… its wrong. It’s so fucking wrong.",
      "created_utc": 1726192327.0,
      "score": 1
    },
    {
      "id": "lmw66tv",
      "body": "Shock is human. When you are able to process, you will. It's a long journey, full of backtracking & pain, but you will find the way.",
      "created_utc": 1726211071.0,
      "score": 1
    },
    {
      "id": "lmwvf50",
      "body": "I'm so sorry. Becoming detached is the worst. Just seeing the feed filled with violence and news of massacres is enough to make one helpless. I pray for Palestine and war torn areas every time I lift my hands. It's so frustrating how the world goes on when so much evil is happening. Do seek professional help. ",
      "created_utc": 1726227314.0,
      "score": 1
    },
    {
      "id": "lmxccbd",
      "body": "God- please show this person mercy and your love. Amen. ",
      "created_utc": 1726234312.0,
      "score": 1
    },
    {
      "id": "lmzarri",
      "body": "I can’t think of anything else to say except that I’m so sorry for what happened to you and I hope that one day, you heal enough to enjoy life again. I know the world is an ugly place, especially considering what you’ve been through but I hope so badly that at some point, you feel the goodness that I promise still exists. I don’t say this in way to pressure you into feeling good or finding something good but I hope that something wonderful comes across that brings some balance to all the heartache and sadness you’ve felt. My warmest thoughts are with you ❤️",
      "created_utc": 1726257458.0,
      "score": 1
    },
    {
      "id": "m659xd1",
      "body": "I have put in google search \"after the war I survived i feel flat no emotions\" as this is what therapist pointed out to me yesterday and a year ago. That i spoke about horrors completely flat showing no feelings. Your post came up. Everything what you describe about feeling like you have no empathy for people's day to day troubles. This happened 30 years ago to me and i still go into stages of disassociation after all that time.\n\n\n I will tell you something. From beginning of genocide in Gaza I cried every day for weeks on ends over lost lives and devastation. I felt pain for all your lives and all lives in other wars and all lives in my war and for every little child including little me trying to understand the pain surrounding us.\n\n\n I am sending you love and hugs from deepest place of my heart and i hope you find peace and joy in living among us!",
      "created_utc": 1736383314.0,
      "score": 1
    },
    {
      "id": "lmq5ddo",
      "body": "I'm so sorry. I don't  know what to tell you\n Take care of yourself and keep fighting for an end of genocide",
      "created_utc": 1726120546.0,
      "score": 1
    },
    {
      "id": "lmq996l",
      "body": "Many people in the comments are so kind, it warms my heart 💗",
      "created_utc": 1726123035.0,
      "score": 1
    },
    {
      "id": "lmqjys8",
      "body": "I'm sorry you have to experience this. I'm Israeli, I hope this war ends and we find peace.",
      "created_utc": 1726130563.0,
      "score": 1
    },
    {
      "id": "lmrtgmz",
      "body": "You’re still human… you are processing grief… I am sorry for your experience.",
      "created_utc": 1726152153.0,
      "score": 1
    },
    {
      "id": "lmrxa0e",
      "body": "Initially this definitely seems like your brain is trying to keep it together and you have a lot of unsolved trauma.\n \nOn the other hand I know many people who have either been in, escaped from or witnessed wars where I am from. Some describe their child self observing things with interest - they seem totally content, some are totally traumatised and event refuses to talk about it, some are in between aka. seem happy but they do bring the war up often and have been shaped by it. We all react differently.\nRegardless, for your own good it's still worth talking to a therapist who can evaluate you better.",
      "created_utc": 1726153399.0,
      "score": 1
    },
    {
      "id": "lmsdsb4",
      "body": "OP I’m so sorry you and yours are experiencing this. I left my country (Lebanon) during our civil war and went back during occupation as a much older adult. None of it seemed real nor even relatable to me until one day it all did, and I’m facing that now through uphill battles and a lot of work alone and in therapy, and now even a therapist myself. \nI am out here, I see you. I’m rooting for you. Reach out if you need to.",
      "created_utc": 1726158697.0,
      "score": 1
    },
    {
      "id": "lmse2rg",
      "body": "I hope one day all the perpetrators of this genocide face judgement and justice is done. I can’t imagine what you’ve seen. I hope you can heal one day, in some way. I’m so sorry.",
      "created_utc": 1726158790.0,
      "score": 1
    },
    {
      "id": "lmtm59j",
      "body": "That’s not an uncommon experience. Many survivors of genocide or war zones report the exact things your describing. They get desensitized—you have to be, it’s how you survive. Same reason you dissociate, it’s your body and brain’s way of protecting yourself. \n\nI really hope that you don’t expect yourself to heal in just five months. This is a weight you will carry with you, but just like a literal weight, the more you lift it, the lighter it gets. Healing isn’t linear and there’s no timetable for it. \n\nIf it means anything, I am so deeply sorry that you had to live through that.",
      "created_utc": 1726172802.0,
      "score": 1
    },
    {
      "id": "lmtt3p8",
      "body": "i’m sorry i don’t have any actual advice for you but i couldn’t just keep scrolling. i’m so sorry for everything you went through. i’m afghan and have seen my people oppressed for decades, i can’t imagine seeing it happen to my immediate family, especially at the scale of the palestinians. May Allah SWT grant you and your family the highest ranks of Jannah. ",
      "created_utc": 1726174991.0,
      "score": 1
    },
    {
      "id": "lmpujvz",
      "body": "[removed]",
      "created_utc": 1726114490.0,
      "score": -8
    },
    {
      "id": "lnq07v9",
      "body": "[removed]",
      "created_utc": 1726661741.0,
      "score": 0
    },
    {
      "id": "lmqt8n2",
      "body": "[removed]",
      "created_utc": 1726136919.0,
      "score": -2
    },
    {
      "id": "lmoynay",
      "body": "[removed]",
      "created_utc": 1726101166.0,
      "score": -32
    },
    {
      "id": "lmotwmn",
      "body": "This. \n\nOP, what you went through there is not to be taken lightly, and I strongly advise you to have yourself monitored over the long term by a psychologist specializing in post-traumatic stress disorder. \n\nFor the moment you think you're functional, but trauma is going to blow up in your face sooner or later.\n\nDo you have any associations for war refugees where you're living that can give you contacts ?",
      "created_utc": 1726099355.0,
      "score": 117
    },
    {
      "id": "lqmwnze",
      "body": "[deleted]",
      "created_utc": 1728231689.0,
      "score": 1
    },
    {
      "id": "lmv5jac",
      "body": "Definitely try EMDR, It could help tremendously.",
      "created_utc": 1726192754.0,
      "score": 2
    },
    {
      "id": "lmu59uw",
      "body": "Thank you for sharing your story, I hope a lot of people read it.. I don't know what else to tell you.. I just wish I could take your pain away.",
      "created_utc": 1726179071.0,
      "score": 1
    },
    {
      "id": "lmugaer",
      "body": "[removed]",
      "created_utc": 1726183176.0,
      "score": 1
    },
    {
      "id": "lmqe5op",
      "body": "[removed]",
      "created_utc": 1726126377.0,
      "score": 0
    },
    {
      "id": "lmrmu20",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. \n\n\nAll posts and comments on r/mentalhealth must be:\n\n1- directly related to mental health\n\n2- appropriate for any age (13+) \n\n3- written in English\n\n4- well formatted \n\n5- easy to read\n\n6- of reasonable length\n\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149906.0,
      "score": 0
    },
    {
      "id": "lnq2c8b",
      "body": "I honestly can’t believe you’re sitting there questioning the authenticity of my experience just because you can’t handle the details in a written post. \n\nLet me make something clear: I didn’t even scratch the surface of what I’ve been through, over 200 days of pure hell, and yet you’re acting like I’m making this up for attention. Do you know what it’s like to live through that? I doubt it, because if you did, you’d realize how ridiculous your accusations sound.\n\nAs for the deleted post, I have no clue why it was removed, but I didn’t mention politics or even talk about the brutal things I went through. I wrote in that most of my friends are either dead or unreachable, and that’s the harsh reality I’m living with. If that’s hard for you to comprehend, that’s on you, not me. It’s not my fault if the moderator deleted the post for their own reasons. I didn’t violate any rules or mention politics, so you trying to discredit me with lies is completely out of line. \n\nInstead of making baseless accusations, maybe try to understand the weight of what I’m saying and the reality I’ve survived. I don’t care that it was deleted, but I do care about people like you trying to spread false claims.",
      "created_utc": 1726662662.0,
      "score": 2
    },
    {
      "id": "lnsl2bu",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726692254.0,
      "score": 1
    },
    {
      "id": "lmrl125",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. All posts and comments on r/mentalhealth must be directly related to mental health.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149276.0,
      "score": 1
    },
    {
      "id": "lmqufw1",
      "body": "[removed]",
      "created_utc": 1726137645.0,
      "score": 1
    },
    {
      "id": "lmpxoaf",
      "body": "I went through a period of dissociation after my dad died. There was around a year of my life while he was hospice and right after he died that I have spotty memory- it’s like my brain wiped it all out bc I was not able to deal with the trauma. I hope you get better OP- it sounds cliche but time does help heal. Sending you the best and know you aren’t alone.",
      "created_utc": 1726116133.0,
      "score": 41
    },
    {
      "id": "lqmwya2",
      "body": "I feel awful for them too",
      "created_utc": 1728231783.0,
      "score": 1
    },
    {
      "id": "lmvqz36",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. \n\n\nAll posts and comments on r/mentalhealth must be:\n\n1- directly related to mental health\n\n2- appropriate for any age (13+) \n\n3- written in English\n\n4- well formatted \n\n5- easy to read\n\n6- of reasonable length\n\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726201998.0,
      "score": 1
    },
    {
      "id": "lmrmvu7",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. \n\n\nAll posts and comments on r/mentalhealth must be:\n\n1- directly related to mental health\n\n2- appropriate for any age (13+) \n\n3- written in English\n\n4- well formatted \n\n5- easy to read\n\n6- of reasonable length\n\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149923.0,
      "score": 0
    },
    {
      "id": "lmrl48a",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. All posts and comments on r/mentalhealth must be directly related to mental health.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149307.0,
      "score": 1
    },
    {
      "id": "lmr1occ",
      "body": "[removed]",
      "created_utc": 1726141436.0,
      "score": 0
    },
    {
      "id": "lmqxvu1",
      "body": "Thank you all for your thoughtful comments and for sharing your own experiences. It really means a lot to me that you took the time to offer your support and understanding.\n\nA psychiatrist recently reached out to offer me therapy sessions, but I politely declined. For me, words feel worthless at this point, and I don’t believe talking will change anything. I would feel uncomfortable sharing details, and my way of coping has been to stay busy and avoid overthinking. It’s how I’ve been able to manage so far, even though I know it’s not the healthiest. I’m starting to reconsider that now\n\nTo the second commenter, I can truly relate to your experience of loss. I lost my dad during everything that was happening, and he had cancer. Watching his health deteriorating and slowly dying because of the blockade and the inability to provide proper medical care is the hardest thing that I ever faced. I couldn’t even say goodbye to him.\n\nYour kindness and words give me a sense of solidarity, and for that, I am grateful. Thank you for being here.",
      "created_utc": 1726139544.0,
      "score": 49
    },
    {
      "id": "lmrl627",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. All posts and comments on r/mentalhealth must be directly related to mental health.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149324.0,
      "score": 1
    },
    {
      "id": "lmr3vcl",
      "body": "[removed]",
      "created_utc": 1726142449.0,
      "score": 0
    },
    {
      "id": "lmrtim6",
      "body": "I don’t want to jump to any conclusions since my trauma came from very different sources, but it might be worth looking into EMDR therapy (if you haven’t already). \n\nJust wanted to bring it up because it’s trauma-focused and it’s relatively light on the talking. The concept boiled down is that pairing eye movements that mimic REM sleep with traumatic memories can help to rewire your body’s constant trauma responses. Linking a website that explains it better than I can -> https://www.emdr.com/what-is-emdr/\n\nAnyway take this or leave it of course, but on the off chance it could help i wanted to share. Hoping for the absolute best for you 🖤🫂",
      "created_utc": 1726152171.0,
      "score": 12
    },
    {
      "id": "lmrta5s",
      "body": "I would suggest first seeing a psychologist…",
      "created_utc": 1726152092.0,
      "score": 10
    },
    {
      "id": "lmrvf3j",
      "body": "Hi. It's hard to find the right words, I am so sorry for what you've been through. What is going on right now is humanity at its worst. \n\nI hope I'm not out of place for saying this, but I would maybe suggest you reconsider your decision about therapy. As someone who dealt (and still dealing) with CPTSD, which also is a form of mental disorder caused by traumatic events, therapy helped a lot. It is mostly about helping you to live with the memories that you have. It's like \"rewriting\" the memory - your brain puts it away with other memories and stops bringing it up all the time. It doesn't mean you forget, it means that these memories, however painful they are, just stop ruining your life. You know, flashbacks (when you unwillingly remember things and see / hear them around you), nightmares, all this stuff, it can get a lot better. Obviously, what you have been through is unbelievable horror, it's a million times worse than my experience, but it's a similar disorder with different degrees of gravity. My flashbacks stopped. The nightmares, too. There's still some emotional cleaning up to do, but I'm more stable, and the past doesn't control my life anymore. \n\nIn any case, I wish you all the best in your recovery.",
      "created_utc": 1726152797.0,
      "score": 5
    },
    {
      "id": "lnz9n01",
      "body": "My condolences for your dad OP...\n\nYou do as you feel. Right now it may be too early for you, you need to \"digest\" everything that's happened before you can put it into words. When you'll feel ready, you can go and see a specialist in PTSD (and why not EMDR as a complementary therapy, as a fellow redditor suggested below). He'll help you to \"manage\" these multiple traumas over the long term without them having a negative impact on the life you're trying to rebuild.\n\nI wish good luck to you my friend 🕊️",
      "created_utc": 1726793255.0,
      "score": 2
    },
    {
      "id": "lmrl83l",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. All posts and comments on r/mentalhealth must be directly related to mental health.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149343.0,
      "score": 1
    },
    {
      "id": "lmr7mz3",
      "body": "[removed]",
      "created_utc": 1726144122.0,
      "score": 0
    },
    {
      "id": "lnb5abc",
      "body": "retire soup vast caption lush unpack intelligent office glorious truck\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1726433660.0,
      "score": 2
    },
    {
      "id": "lmra8z3",
      "body": "[removed]",
      "created_utc": 1726145204.0,
      "score": 0
    },
    {
      "id": "lmrlhsg",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. \n\n\nAll posts and comments on r/mentalhealth must be:\n\n1- directly related to mental health\n\n2- appropriate for any age (13+) \n\n3- written in English\n\n4- well formatted \n\n5- easy to read\n\n6- of reasonable length\n\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149437.0,
      "score": 1
    },
    {
      "id": "lmrlkju",
      "body": "Thanks for posting on r/mentalhealth. We have removed this post because we determined that it does not meet our posting criteria. All posts and comments on r/mentalhealth must be directly related to mental health.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1726149463.0,
      "score": 0
    }
  ]
}