{
  "id": "1kb8725",
  "title": "I literally hate it here, cause like... why am I like this?!",
  "selftext": "",
  "created_utc": 1745988120.0,
  "score": 730,
  "num_comments": 30,
  "url": "https://i.redd.it/c446owc3jwxe1.jpeg",
  "comments": [
    {
      "id": "mpsh0e2",
      "body": "Lack of self discipline. I’m in the same boat",
      "created_utc": 1745989024.0,
      "score": 40
    },
    {
      "id": "mpujnzl",
      "body": "I brush my teeth once every two weeks. Every day, in my head, it’s all “get up get up get up,” and I never do.",
      "created_utc": 1746024288.0,
      "score": 18
    },
    {
      "id": "mpuelia",
      "body": "Oh my God I have the same issue I now know what they mean by ignorance is bliss I was so much better off not knowing",
      "created_utc": 1746022776.0,
      "score": 14
    },
    {
      "id": "mpsg6qm",
      "body": "The reason why, you already know. You just haven't decided to listen to yourself yet. And you know that if you never do, the consequences are dire.",
      "created_utc": 1745988637.0,
      "score": 17
    },
    {
      "id": "mpuiv6a",
      "body": "well sometimes its not self aware, it's hyper critical of yourself and your flaws too, and that can keep you from completing things. Sometimes i have this intense focus, this microscope that 80 percent of the time could do wonders if it was only pointed in any other direction than at myself and my inabilities.",
      "created_utc": 1746024052.0,
      "score": 6
    },
    {
      "id": "mpx0r3e",
      "body": "This but also undiagnosed ADHD on top of it, takes me so long to get things done and so little time to ruin things",
      "created_utc": 1746050353.0,
      "score": 6
    },
    {
      "id": "mpvufr6",
      "body": "Most relatable thing I've seen all say. You can also see, understand and analyse all of your problems, including their origins and development, but you can't find any solutions for them.",
      "created_utc": 1746037822.0,
      "score": 5
    },
    {
      "id": "mpuflvy",
      "body": "Knowing better doesn’t always mean doing better. And that’s the worst part.",
      "created_utc": 1746023081.0,
      "score": 2
    },
    {
      "id": "mpvsc3c",
      "body": "I know the feeling.",
      "created_utc": 1746037209.0,
      "score": 2
    },
    {
      "id": "mpw54es",
      "body": "This is so true! Even though you know it's happening, it's like a train you can't stop even when you see it unfolding.",
      "created_utc": 1746040989.0,
      "score": 2
    },
    {
      "id": "mpwjz43",
      "body": "Ohhh I used to be this person.  That self-awareness feels like a curse when you're trapped in behavior patterns.  \n\nIt's really important to know this: 95% of our thoughts, feelings, and actions are subconscious patterns.  That means that will power alone really isn't enough, since it's coming from the 5% of your brain that you have conscious control of.\n\nThe GOOD NEWS IS...you CAN reprogram your subconscious mind.  It just has to be done intentionally.  We are ALWAYS being programmed, so if we're not being intentional about it, we're doing a combination of two things: playing the same programs on repeat (\"I know it's self-destructive, but I do it anyway\"), and being programmed by others (news, social media, etc.)  Also worth realizing that our brains are wired to seek out the negative as a survival mechanism, so if we're not mindful about the input, we're just taking in bad-bad-bad-bad-bad all day... and it's contributing to the negative programming.\n\nEasiest thing to do ASAP is start pruning your social media.  It obviously takes more than that to break out of those cycles, but it does help a lot to be mindful about the accounts you follow on social, the tv/movies you watch, books you read, etc.",
      "created_utc": 1746045306.0,
      "score": 2
    },
    {
      "id": "mpwxx0u",
      "body": "Lack of any sort of motivation. I understand because I'm a human slug",
      "created_utc": 1746049465.0,
      "score": 2
    },
    {
      "id": "mpst2dc",
      "body": "When my best friends trigger my ptsd and I suddenly dont trust them anymore eventho I know it aint their fault. So harsh when you know its hurtful to those around you, but you cant do anything about it either. Psychological problems are relentless",
      "created_utc": 1745995524.0,
      "score": 1
    },
    {
      "id": "mpys9eo",
      "body": "Fuuckkkk\n\n\nWait til you go into personal observation mode and it feels like a drug trip",
      "created_utc": 1746073069.0,
      "score": 1
    },
    {
      "id": "mq18pta",
      "body": "me and my depression",
      "created_utc": 1746113589.0,
      "score": 1
    },
    {
      "id": "mq95dss",
      "body": "Dude, you are among the lucky ones. You know and are aware of your doings. Look at the politicians. They are doing everything wrong but are not self-aware at all. Who is better? It has to be you.",
      "created_utc": 1746215340.0,
      "score": 1
    },
    {
      "id": "mqf0pnn",
      "body": "I’ve been in therapy for awhile, but major depressive disorder is hella rude 😭",
      "created_utc": 1746299046.0,
      "score": 1
    },
    {
      "id": "mqjzrnt",
      "body": "Its like I know whats wrong and the steps to heal but I still can't bring myself to do it",
      "created_utc": 1746374630.0,
      "score": 1
    },
    {
      "id": "mqjztod",
      "body": "Just like everything else its so much easier to just not do it",
      "created_utc": 1746374647.0,
      "score": 1
    },
    {
      "id": "mpv30es",
      "body": "Choices?",
      "created_utc": 1746029907.0,
      "score": 0
    },
    {
      "id": "mpsqfgb",
      "body": "It's like iam smart enough to know what's happening but not strong enough to change what's happening.",
      "created_utc": 1745993995.0,
      "score": 32
    },
    {
      "id": "mpvrnfo",
      "body": "I feel so very seen right now.",
      "created_utc": 1746037010.0,
      "score": 9
    },
    {
      "id": "mpwc449",
      "body": "oh gosh this hit home, ik this comment wasnt meant for me but i will take this to heart",
      "created_utc": 1746043027.0,
      "score": 8
    },
    {
      "id": "mpync53",
      "body": "Why did I read this with a William Shatner inflection?",
      "created_utc": 1746070929.0,
      "score": 1
    },
    {
      "id": "mqhfa2x",
      "body": "What is holding you from heading to a diagnosis?",
      "created_utc": 1746331266.0,
      "score": 2
    },
    {
      "id": "mqhft4l",
      "body": "\"Also worth realizing that our brains are wired to seek out the negative as a survival mechanism\" hit me so hard. I appreciate the comment tho.",
      "created_utc": 1746331515.0,
      "score": 1
    },
    {
      "id": "mpy3tmx",
      "body": "Let’s be smart enough to know that change will come, and not strong enough to stop it.",
      "created_utc": 1746063665.0,
      "score": 2
    },
    {
      "id": "mpylcvx",
      "body": "For real. I just took a shower today for the first time in a month, and I feel slightly less disgusted with myself.",
      "created_utc": 1746070102.0,
      "score": 7
    },
    {
      "id": "mqi3or4",
      "body": "The fact that the healthcare system is failing around me. My own health center doesn't do diagnosing ADHD because of lack of professionals to do so, and my school doctor is present one day per month and told me to go home and use an online guide for 3 months. I'm graduating now and nothing has been done because I've tried to use my right to free healthcare instead of paying thousands of euros :(",
      "created_utc": 1746344562.0,
      "score": 3
    }
  ]
}