{
  "id": "1k30crl",
  "title": "I saw a gore video a year ago and it still haunts me to this day",
  "selftext": "For context a friend showed me a video of a guy getting shot by a shotgun without telling me what the video was I told my parents but they just said forget about it I get distracted in class often by the thoughts what should I do \n",
  "created_utc": 1745080523.0,
  "score": 509,
  "num_comments": 151,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1k30crl/i_saw_a_gore_video_a_year_ago_and_it_still_haunts/",
  "comments": [
    {
      "id": "mnyh4s2",
      "body": "It traumatized you. I remember being traumatized by an animal abuse video when I was in middle school. I still think about it to this day (I’m 34). I couldn’t sleep because of it and when I did sleep I had nightmares. Accidentally seeing traumatizing videos was very common when I was younger and the internet was very unregulated. Some therapy sessions might help. If you can’t get your parents to take you, you might just need to hang in there until you’re old enough to go on your own. It might not bother you as much by then though. I’m sorry your “friend” was cruel enough to expose you to that without your consent. Be extra cautious in the future.",
      "created_utc": 1745083566.0,
      "score": 176
    },
    {
      "id": "mnygszm",
      "body": "Those kinds of videos and images can never be unseen. The best you can do for yourself is to find a good stopping thought that you can use when you find yourself being distracted by it, something like, \"I'm really sorry I saw that\". If you use \"Don't think about XYZ\", that's all you'll think about, so try to find a set of words that acknowledges your feelings about the memory of that video, without chastising yourself for having a memory. Then try to ground yourself in the present by looking around and identifying 5 or 10 things that are within your visible space. \n\nYou don't necessarily need to ditch the friend, but you definitely need to set a boundary like, \"we won't be friends any more if you show me something like that again\". Believe me when I say that life will carry with it enough memories you'll wish you didn't have to live with all on its own. You don't need people making that worse by rubbing your nose in the awfulness of humanity.",
      "created_utc": 1745083465.0,
      "score": 56
    },
    {
      "id": "mnyj9af",
      "body": "no because i used to have a group of friends who thought doing things like that was hilarious, meanwhile i couldn’t get the images they showed me out of my head. i don’t understand what makes someone enjoy or feel an ounce of dopamine from traumatizing someone. i’m sorry you went through that. but id recommend losing that friend. best thing i ever did was getting rid of that friend group.",
      "created_utc": 1745084222.0,
      "score": 42
    },
    {
      "id": "mnysws7",
      "body": "Here’s the truth... you can’t unsee it, but you can reframe it. The mind loops on what it hasn't resolved, what it hasn't brought meaning to. Right now, you’re seeing the video as a purely negative event, and because of that, it has power over you. But if you look deeper, you can start to ask: what did this experience awaken in me? Did it make me more conscious of how precious life is? Did it stir a desire in me to understand the human condition more deeply? Did it strengthen my resolve to never waste my days, to never take safety for granted, to be more discerning about what I expose myself to?\n\nWhen you bring meaning to a memory, it loses its grip. When you recognize the benefits that arose from it in you and for you, the fear dissolves and is replaced by clarity and direction.",
      "created_utc": 1745087207.0,
      "score": 30
    },
    {
      "id": "mnyaux4",
      "body": "First off ditch the friend, that's trauma you're reliving there. Secondly, learn from this video that there's more to life than these videos. Be pro life and let that video teach you to do the opposite - be kind, be nice, be a healthy individual.",
      "created_utc": 1745081600.0,
      "score": 492
    },
    {
      "id": "mnyh0t8",
      "body": "Try to consult a therapist or even text 988 (suicide hotline, dont call unless you're suicidal, texting is easier for non emergencies) to find someone to talk about it. I've been exposed to gore all the time, so I'm somewhat desensitized, but there's still shit that I see even on here that fucks me up. What I do is try reconnecting with nature. Step into the woods for a bit and just appreciate nature and stuff that we live with. I like to stay away from people for a bit if the gore video was of people. It weirds me out seeing that it could happen to them. Plants don't have that, thankfully. The eyebleach sub reddit helps, too. Lmk if I can help anymore",
      "created_utc": 1745083532.0,
      "score": 7
    },
    {
      "id": "mnymm2i",
      "body": "My brother showed me the budd dweyer video when I was very young.  I remember thinking \" this is life, I need to get used to this\"    don't know why people feel the impulse to spread this horror,  I've witnessed a boyfriend trying to do the same thing to his young nephew.  It's like a disease.  pretty sure it did a lot of harm to me and those first couple videos stay with you .  Stay away from it if you can and when you have the chance to talk about it to someone you trust,  do so.",
      "created_utc": 1745085248.0,
      "score": 5
    },
    {
      "id": "mnzep6j",
      "body": "My first serious boyfriend would send me videos of animal abuse/gore in gif form so that it was short enough to show the really bad part before I had time to react. It scarred me for life. \n\nThen the father of my children sent pictures of the pets we shared starved to death, blaming it on me for leaving. I think about these images often and I can’t not help an animal in need.",
      "created_utc": 1745094449.0,
      "score": 5
    },
    {
      "id": "mnyq18j",
      "body": "That sucks. There are certain kinds of counseling that work really well for this kind of thing. \n\nSomething like EMD/EMDR might work really well for something like this. EMD might be especially helpful if the thing that just haunts you is an image or part of the video. DM me if you want more info.",
      "created_utc": 1745086299.0,
      "score": 3
    },
    {
      "id": "mnyupqt",
      "body": "Your suffering is largely caused by your evaluation of the video. Or even better, by the evaluation of your memories of the video.\n\nYou can avoid thinking about it, and that may help temporarily, but that will not fix the core issue. The core issue is the amount of negative affect that is elicited by the retrieval of your episodic memories.\n\nYou can change that with mindfulness/acceptance exercises. They are painful in the short term, but progressively, they will provide more and more relief and reduce more and more the negative affect.\n\nYou can under the supervision of a registered therapist make the following type of exercise, and variations of it; you will imagine yourself watching the video in the present (and not in the past) with reduced detail; as you imagine it, you will simultaneously imagine yourself being indifferent to the video, like a rock. No judgement, no disdain, no pain, no pleasure, just neutral indifference.\n\nWith your therapist, you will iterate that and increase in the vividness, bit by bit, in a non-judgemental way. The negative responses will bit by bit get weaker.",
      "created_utc": 1745087795.0,
      "score": 3
    },
    {
      "id": "mnyvqdj",
      "body": "Yeah. I feel that. I stumbled upon one once and it was really bad. Hard not to think about it for a while and eventually I stopped thinking about it. I think one of my problems now is from watching all the horror movies I have with extreme violence, gore, ect… I have become so desensitized to that sort of thing. I could watch a new one and not feel any kinda way but sad for the person it happened to.",
      "created_utc": 1745088124.0,
      "score": 3
    },
    {
      "id": "mnyywo9",
      "body": "I've watched a small amount of graphic things online, extremely graphic. Funny how these videos will never be forgotten after viewing. I guess it's not really funny at all.",
      "created_utc": 1745089168.0,
      "score": 3
    },
    {
      "id": "mo0e59c",
      "body": "I saw alot of gore in the 90s starting at the age of 4. I cannot forget it. Maybe get some therapy or something. I never sought relief or talked to anyone about it so maybe that's why it's still crystal clear. Idk but good luck and I empathize.",
      "created_utc": 1745106680.0,
      "score": 3
    },
    {
      "id": "mo0ko7t",
      "body": "Yeah. There were gore videos spread around tiktok that started cute animal videos and would cut to a horrible thing happening to a kitten. Also a man who takes his life with a shot gun as his dog looks around confused and traumatized. I wasn’t on tiktok for weeks. \n\nThen that turned to months and now years. It’s a cruel and messed up thing to see, especially unknowingly. A stranger on the internet is one thing but a friend doing that to you? Please drop them. I recommend staying clear of social media too. Video games and movies are a form of media that can be controlled. I always look up what sort of violence is in a movie before I watch it. Maybe some CBT or even a counselor would probably help you too. I’m so so sorry.",
      "created_utc": 1745109100.0,
      "score": 3
    },
    {
      "id": "mo0mpa2",
      "body": "I remember scrolling on X (formerly twitter) and watching a guy blast the top of his head open with an ak-47 and it still haunts me to this day",
      "created_utc": 1745109858.0,
      "score": 3
    },
    {
      "id": "mnzdxng",
      "body": "Yeah no terrible friend. I went over to one of my friend's houses when I was 17, she was 15-16, and she told me to watch this video and when I looked it was that video of the guy shooting himself on stream. Never talked to her again",
      "created_utc": 1745094195.0,
      "score": 2
    },
    {
      "id": "mo0b626",
      "body": "Yeah... Saw a similar video 8 years ago and it still messes with me. Just do your best to put it out of your head.",
      "created_utc": 1745105636.0,
      "score": 2
    },
    {
      "id": "mnykf0o",
      "body": "Try to not have strong emotional responses to it when it bubbles up... it was disturbing content and seems it was a bit traumatic for you.. let it come and go. We all become old, sick and die.. for some of us, the way out can be gruesome. But we are not our mind or body... try to gently redirect yourself to something more pleasant and wholesome after. Whatever works emotionally... r/eyebleach if you need something new",
      "created_utc": 1745084583.0,
      "score": 2
    },
    {
      "id": "mnyrdwk",
      "body": "I'll never forget the shock value content that was seemingly around every corner back in the late 2000s into the early 2010s. There was one night where a group of my friends dared each other to get through all the snuff films and self torture videos on a specific website that was frequently passed around our school. It was awful. We're talking 2 guys one hammer, pain Olympics (this one was particularly unforgettable), one guy one jar, excessive forced vomiting videos, one guy one screwdriver (another one that I wish I could have scrubbed from my archive). I was never the same. Then a year later I walked into school a little early and a group of dudes were all crowded up watching a video on someone's phone. Naturally I got fomo as a 14 year old and wanted to see what they were watching. Luckily I made it just in time to watch a terrorist organization cut a guys head off SLOWLY with a pairing knife. I cannot emphasize how drawn out the beheading was and I don't know why they used such a small knife. I genuinely believe it wouldn't have been so bad if it was just a quick machete hack. I was ACTUALLY never the same after that. That shit lives in my head rent free to this day and I just have to deal with that. I've seen a lot of fucked up shit in real life, but none of it was comparable to the shit that I was shown on the internet back then. You'll eventually get over it, but for now you're going to have the imagery in your head. Eventually something better happens in your life and you'll forget about it long enough to get over it. Be glad you weren't around for the wild West of the internet where anything went. It was a terrifying time.",
      "created_utc": 1745086720.0,
      "score": 3
    },
    {
      "id": "mnyq9j3",
      "body": "I saw a really bad gore video of a factory worker having a fatal accident. It still haunts me to this day. People underestimate how the content you see online can actually traumatize you. Be very careful with how you browse online. Try to use filters as much as possible on videos flagged as NSFW content. Also, if people are talking about a graphic video, don’t give in to temptations to go searching it. Instead, try to see if you can find a written description of the video as opposed to viewing it yourself.",
      "created_utc": 1745086368.0,
      "score": 1
    },
    {
      "id": "mnyzsfq",
      "body": "I'm sorry that you had to see that at all young age, but don't let it traumatize you. That is real life. It should definitely teach you a few valuable lessons, one being that guns are not toys.",
      "created_utc": 1745089464.0,
      "score": 1
    },
    {
      "id": "mnz1jky",
      "body": "I think a lot of us wish our traumas were as simple as watching a video! You'll get through this, the more you try not to think about it the more it'll come into your mind. Learning to let it go could be helpful, it's easy to cling on to somewhat negative experiences and carry it further forwards unless you actively work through it/process it, obviously that's mostly suggested for more severe trauma, but it sounds like it could be applicable and helpful here too. You can move past this<3",
      "created_utc": 1745090054.0,
      "score": 1
    },
    {
      "id": "mnz8bvb",
      "body": "idk just watch 50 others till u get used it to it, there is no way to forget smth like that but there are ways to get over it",
      "created_utc": 1745092335.0,
      "score": 1
    },
    {
      "id": "mnzbnmj",
      "body": "I've had gore forced upon me so many times and it sucks, I'm sorry it happened to you as well. The good news is that the fact you're disturbed by it means you're a good person.\n\nLike everything in life, you'll learn to live with it. Shitty answer, I know. But it's true. I'd watch Disney or Studio Ghibli movies, sitcoms, funny cat videos, whatever I needed to distract my brain until the memory starts too feel more distant.\n\nBut I won't lie to you. Every now and then it'll pop up in your head again and you'll have to face it. But it's a lot easier when it's just sometimes rather than all the time as it is when the memory's fresh.\n\nAlso, please distance yourself from that \"friend\"",
      "created_utc": 1745093442.0,
      "score": 1
    },
    {
      "id": "mnzqtdx",
      "body": "I got traumatized by tons of stuff people were posting in the news subreddits for the last several years. It's been like half a year since I left those subreddits. I'm not going to say you'll get over it, but you have to focus on other stuff for a while.",
      "created_utc": 1745098528.0,
      "score": 1
    },
    {
      "id": "mo17c5n",
      "body": "I'm very sure you're young. It just takes time. I'm saw so many things I felt like I've never forget, including things in real life. Most I have forgotten, and the things that I haven't, it takes something specific to trigger the memory. Even then, it doesn't really move me",
      "created_utc": 1745117759.0,
      "score": 1
    },
    {
      "id": "mo1f56u",
      "body": "actually try to think about the content of the video without visualising it until you get more used to it, there are actually more horrific videos than that trust, I've been shown just like you without warning, I specifically hate the dog ones and it's always someone you can't just stop being around like a work colleague or something.",
      "created_utc": 1745121108.0,
      "score": 1
    },
    {
      "id": "mo1hakq",
      "body": "Hey. I’m really sorry that happened to you. You didn’t choose to see that video, and your reaction makes complete sense. When something disturbing gets burned into your brain like that, it’s not easy to shakeand it’s not your fault that it keeps coming up. I would distance yourself from that \"friend.\"\n\nIt sounds like you’re carrying trauma-related intrusive thoughts, like your brain keeps replaying something shocking it didn’t know how to file away. Some people call it vicarious trauma. Others experience it like moral injury. However you name it, what matters is: it’s real.\n\nThat’s when an image, memory, or feeling pops up in your mind without warning (usually something you don’t want to think about, but your brain latches onto it anyway). It’s super common after seeing something traumatic. Your brain basically went, “What the hell did I just see?” and never found a place to put it, so now it keeps holding it up like, “Is this still dangerous? Should I keep looking at it?”\n\nThat doesn’t mean anything is wrong with you. It means your brain is trying to protect you from something it didn’t know how to process. Totally human. It's totally unfair. Still really hard.\n\nIf it’s okay to ask (and no pressure if it’s not) can I gently offer a few questions? You don’t have to answer them here. Just something to sit with:\n\nWhat’s the part of the memory that comes back the strongest? The image itself, or how it made you feel?\n\nWhen the thoughts show up in class, what do you notice in your body? Are there any tiny signals it gives you?\n\nIf your brain is holding on to this as if it’s still happening, what might it be trying to protect you from?\n\nWhat would it look like if you didn’t have to fight the memory but also didn’t let it control you?\n\nWhat might it feel like to treat that part of yourself (the part that got hurt) as someone worth protecting?\n\nYou don’t have to have perfect answers. Just asking these questions can start to loosen the grip.\n\nIf you’re open to it, I can walk you through something that might help. it’s an exercise I use with people in my social work practice called Leaves on a Stream. The goal isn’t to erase the thoughts (because fighting them usually makes them louder), but to create a little distance so they don’t run the show.\n\nHere’s how it works:\n\nImagine you’re sitting beside a slow-moving stream. The water is clear. You’re safe.\n\nEvery time a thought pops into your mind (whether it’s the video, a memory, even the urge to push the thought away) picture putting it on a leaf and letting it float down the stream.\n\nYou don’t have to analyze it. You don’t have to push it away. You’re just noticing it, not judging yourself for having the thought, gently placing it on a leaf, and watching it drift past.\n\nIf the same thought keeps coming back, that’s okay. Just keep placing it on new leaves. Over and over. You’re not doing it wrong. You’re just practicing.\n\nThe point isn’t to “fix” the thought. It’s to remind yourself that you’re not the thought. You’re the one watching it. You get to decide how close it gets.\n\nThis won’t make everything magically better. But it can help create a little more breathing room inside your mind.\n\nThe fact that it’s still bothering you doesn’t mean you’re weak. It means you felt something when you saw it. That you care and that matters more than you know.",
      "created_utc": 1745122122.0,
      "score": 1
    },
    {
      "id": "mo1zi5p",
      "body": "Sounds like when I got shown “one guy one jar” video 😢 that was 12 years ago that I saw that and I still cannot forget it and get a severe panic feeling anytime it pops into my head. It’s not even something that would happen to me and hopefully anyone I know but it still scares the shit out of me for some reason.",
      "created_utc": 1745132201.0,
      "score": 1
    },
    {
      "id": "mo225a6",
      "body": "I found one such website on a whim and I keep going back to it, I don't know why. Not like I'm addicted or anything, just going back to it when I'm really down bad. I don't take pleasure in any of that.",
      "created_utc": 1745133813.0,
      "score": 1
    },
    {
      "id": "mo23n73",
      "body": "That's really messed up of him. I'm not sure how exactly to help you. I've seen a few videos similar to that in the past. Not because I enjoyed it but basically because I forced myself to watch them because they were relevant to the news and I didn't want to hide from the truth.\n\nAnd I can say that I'm not the same person after having seen some of those.\n\nWhat I can say though personally is that it doesn't haunt me in that way anymore. I still don't like thinking about it. But I think I gave it a place in my mind.\n\nWhich is that, yeah, there are people who do these kinds of things. And that's truly horrifying. And that's why I want to do my absolute best never to be a person like that, and to stand up in whatever way I can against things like war. If I can help it, as few people as possible will ever suffer stuff like this.\n\nI guess giving it a place like that helped me. Maybe it could help you?",
      "created_utc": 1745134752.0,
      "score": 1
    },
    {
      "id": "mo28el8",
      "body": "I've seen far worse where people were killed or tortured, ironically my exposure was from a group of friends, showing a bunch of people being executed and also washed up bodies that were filled and swollen with water. Getting away from those 'friends' was the best thing I ever did. It was online so it was far easier, probably more difficult if this is real life. \n\nThe other thing with it is trying to change your perspective. Where like these friends of ours probably get a laugh out of it, you need to acknowledge it as a tragedy and a bad situation. Since many of the people who watch it become very psychotic, especially going into adulthood. Take it as a learning experience too, like this is the reality we live in, and how you can empathize with the victim more because of it. \n\nI say that because a lot of people tend to walk away from it apathetic, no emotion what so ever. It's good to feel shocked and sorry for someone in the gore videos, because that means you have your heart and soul intact. (Note: I'm not spiritual)",
      "created_utc": 1745137748.0,
      "score": 1
    },
    {
      "id": "mo2hmel",
      "body": "In RN nursing school I realized I was ridiculously sheltered from gore, bodies, trauma, babies that won’t live long. I started watching all the gory stuff. But after a few weeks I felt much more confident after graduating and being hired. This worked for me, YMMV.",
      "created_utc": 1745143765.0,
      "score": 1
    },
    {
      "id": "mo2r30d",
      "body": "It was a canon event",
      "created_utc": 1745149197.0,
      "score": 1
    },
    {
      "id": "mo2r4lu",
      "body": "TLDR: Intrusive thoughts are difficult af to manage, and it just takes time and patience.\n\nWhen I was in high school, I learned a lot about the Saw franchise, and, while I was a little obsessed, it was (and still is) an intrusive thought for me due to traumas that I’d gone through earlier in life. My trying to convince myself it was an intrusive thought (and therefore “bad” to think about) came to a head when everything for that ghost movie *Unfriended* came out. All of this to say, even though gore is uncomfortable to me, those kinds of thoughts do go away after a while. (Yes, it is difficult to deal with even now.)",
      "created_utc": 1745149220.0,
      "score": 1
    },
    {
      "id": "mo308ec",
      "body": "How old are you? Gore videos and sites are there and will be, I was traumatised by a Cartel video, but now life has become so complex I rarely think about it.",
      "created_utc": 1745153452.0,
      "score": 1
    },
    {
      "id": "mo3atdi",
      "body": "Okay, there’s a fix for this: there is a therapy method called EFT - emotional freedom technique - also known as tapping. It was originally developed in VA hospitals specifically for resolving PTSD. I can attest personally and professionally to its efficacy, if you can find a good practitioner. The problem is that it’s been misappropriated by the “the Secret” and “abundance manifestation” groups, so it’s difficult to find someone. \n\nYes, I do it, and I focus exclusively on trauma and phobia release. And, yes, there are places you can learn to do it yourself, but from experience, especially with a trauma, you ABSOLUTELY must work with a pro first. I’m not sure what the rules of off-list contact are (I am available if it’s okay), but I can try to post a reputable practitioner list later if you like. \n\nEven though it’s mainly a hands-on therapy integrating acupuncture points (tapping, no needles) and EMDR, it’s highly effective in remote sessions, too. \n\nAnd, yes, DEFINITELY stay away from that “friend”.",
      "created_utc": 1745157530.0,
      "score": 1
    },
    {
      "id": "mo3o8s4",
      "body": "This is interesting.\n\nDuring the civil war in Yugoslavia there was a journalist who wanted to find out why some groups of soldiers and civilians tortured and executed others. \n\nHe made an interesting conclusion, a lot of the soldiers who did these things were almost always from smaller villages wich raised livestock and had a very physical culture.\n\nSome of these men had already as little boys butchered cows, sheep, lambs, bulls, ducks and hens with knives...it was almost second nature for them.\n\nBoys from the larger cities in yugoslavia had a lot harder time doing these things, as it was not normal for them. They got the meat from the supermarked and never had to relate to the butchering. \n\nCould this also relate to the gore videos? I cant stand watching anything like that and if I am in the countryside, even at 40 I look away if someone kills an animal. My friends from there dont even blink an eye, and seeing gore doesnt affect them in any way.",
      "created_utc": 1745162033.0,
      "score": 1
    },
    {
      "id": "mo3objs",
      "body": "I recently have seen a photo of that did this to me.\nFor context: in Brazil we have a amusement Park called 'hopi hari' (and it's near the City I Live in), and past week our school made a trip there, it was very cool n stuff but something was setting me off.\nIn 2012, an teenager died at the park because she was thrown out of a 'elevator' attraction (the one where you climb a tower to a huge height and you fall in a controlled manner from above) of 20 meters heigh, when I was at the park, I searched for the case In Google, (the tower where it happened was literally by my side) when I when I came across the photo of her face completely disfigured by the fall.\n Every time I looked at that giant tower I thinked of it, I couldn't sleep that night\n\n\nHere is the link of the wikipedia page about the accident (it doesen't have any gore) https://g.co/kgs/ibpuR8r",
      "created_utc": 1745162058.0,
      "score": 1
    },
    {
      "id": "mo3z3vq",
      "body": "You need to learn to let these thoughts come and go in your mind. Instead of trying not to think about it, change your mindset to “I’m thinking about it, but it doesn’t bother me”. The more you try to not think about it, the more you will.",
      "created_utc": 1745165553.0,
      "score": 1
    },
    {
      "id": "mo4rjks",
      "body": "What was so bad about seeing the video?",
      "created_utc": 1745174521.0,
      "score": 1
    },
    {
      "id": "mo5316s",
      "body": "I accidently saw a video a couple of weeks ago of a Russian soldier being blown up by a grenade dropped from a drone. I can't get over how graphic it was but also how helpless he was. Im in my 40s and can't get it out of my head. Bleh",
      "created_utc": 1745178330.0,
      "score": 1
    },
    {
      "id": "mo56id8",
      "body": "I watch gore videos sometimes. Just doom scrolling through WPD. Some things have stuck with me like that but I've become so desensitized to it that I can brush off a lot of it. It’s made me appreciate what life is even more and made me more empathetic. You'll eventually be able to go on with it but it's going to be engraved into your subconscious forever. Just try not to expose yourself to that kind of “material” since you are extra sensitive to it and a little cliche but try to zone in on “happy thoughts”",
      "created_utc": 1745179485.0,
      "score": 1
    },
    {
      "id": "moa7qko",
      "body": "Same thing happened to me 6-7 years ago. I saw some deep gore shit and that things scarred me so much I had panic attacks all the time to the point even getting off the bed gave me panic attacks. The only thing that helped me was that you have to ACCEPT that this is a part of life and you can do nothing about it. Do not resist. This is the one thing that helped me so much that I feel totally normal now. It was from a YouTube video and I still can't find that video but I want to thank that person who made that.",
      "created_utc": 1745254961.0,
      "score": 1
    },
    {
      "id": "modnf6q",
      "body": "Maybe ask your parents to talk to a counselor, or a school counselor, if that is an option. Counseling doesn't have to be some super extreme or massive thing. Counselors will talk with a patient as long as the person needs to process an issue. That could mean only a couple of sessions or so to help you manage the image. \n\nAlso, I'm right there with ya on seeing something that still bothers me to this day. It was close to 20 years ago when I saw Hostel. There is a scene that is etched into my memory that i can still see clearly. I've worked in the operating room during brain, back, hip, and knee surgeries, I worked on an ambulance for years, plus I was a medic deployed to Iraq/Afghanistan, yet this scene still bothers me more than anything I've ever seen in real life. As hard as it is normal (mentally/emotionally \"normal\") for it to bother you. If it didn't, that would be a bigger issue, tbh.",
      "created_utc": 1745295601.0,
      "score": 1
    },
    {
      "id": "modtmy2",
      "body": "I have a feeling we're thinking of the same video and I'm so sorry you saw it, because my friend showed me it too. I hope one day we can scrub that image from our memories",
      "created_utc": 1745298529.0,
      "score": 1
    },
    {
      "id": "modxhto",
      "body": "Hello, let me be the first to tell you that anyone who says that those kinds of videos don’t traumatize you are lying. When I was in my early twenties, I got addicted to that stuff. Now, for context, I was EXTREMELY depressed. The kind that has you obsessed with the concept of death to the point of falling into a cycle. It’s as if I got to a point where I was desensitizing myself so I could ‘commit the deed.’ I won’t get into what made me stop, but I did pull out.\n\nHowever, those images are extremely difficult to erase. Although I’m back to being sensitive to gore and death videos again, I’m permanently terrified of dying in some horribly painful or traumatic way. I’m not telling you this to make you feel worse, just to solidify that your feelings are COMPLETELY valid. You were traumatized. You saw something you weren’t expecting by a friend you trusted. You were betrayed and hurt and now your brain is trying to protect you by reminding you that you were scared. Take a deep breath and remind yourself that that wasn’t your fault. You couldn’t help that person in the video and you’re not a bad person for witnessing it. You are a good empathetic person and you deserve it to yourself to heal.",
      "created_utc": 1745300580.0,
      "score": 1
    },
    {
      "id": "mood0kj",
      "body": "I'm Sorry for that experience , create an hobby that can make you occupated even After classes , for example fishing , i Hope this helps ",
      "created_utc": 1745442040.0,
      "score": 1
    },
    {
      "id": "mor5xi3",
      "body": "Trauma is a normal part of life and almost necessary. You'll get past that incident. Maybe it needed to happen. Perhaps you will see for worse and that will help bridge the gap between butterflies and whatever you'll go through.",
      "created_utc": 1745482161.0,
      "score": 1
    },
    {
      "id": "mozwgxu",
      "body": "i watch gore once for like a week and it wasn't that regular,, and now after a year or year an half of not watching it i dreamt of people being slaughtered alive and being eaten in 4k.and that was horrifying",
      "created_utc": 1745599375.0,
      "score": 1
    },
    {
      "id": "mp8gtuq",
      "body": "Where can I find this video, I'm curious",
      "created_utc": 1745713144.0,
      "score": 1
    },
    {
      "id": "mrvm1pz",
      "body": "grow thicker skin kiddo.  Stuff like this?   Happens every second of every day.  \n\nBAM\n\nThere goes another one.\n\nDeath is a natural part of life, and when we die its never pretty",
      "created_utc": 1747035205.0,
      "score": 1
    },
    {
      "id": "mnymfte",
      "body": "RIP to the victim of murder and digital exploitation of his misery uploaded to entertainment networks without consent",
      "created_utc": 1745085196.0,
      "score": 1
    },
    {
      "id": "mnzi56i",
      "body": "Lmao seeing a guy get fucked with a shotgun is a canon event. You'll get over it kid",
      "created_utc": 1745095582.0,
      "score": 1
    },
    {
      "id": "mnz73pq",
      "body": "Smoke weed. You will forget about it. I’ve seen tons of such videos. Including ones like Funkytown and 3 guys one hammer. I still remember Parts, but most is forgotten or blurred.. however I never had deep issues with what I have seen in the first place..",
      "created_utc": 1745091926.0,
      "score": -1
    },
    {
      "id": "mo12wku",
      "body": "Christ is risen",
      "created_utc": 1745115965.0,
      "score": -1
    },
    {
      "id": "mnymqu9",
      "body": "You need to take it as a growing experience & realise the world isn’t all peaches & cream. Don’t be so weak & sheltered. Just grow some skin & move forward.",
      "created_utc": 1745085287.0,
      "score": -8
    },
    {
      "id": "mnyq7p5",
      "body": "Wow. I've never seen a better example of why people should use punctuation. \n\nYou know, a comma here, a period there, would've made the whole thing a lot easier to read.",
      "created_utc": 1745086352.0,
      "score": -8
    },
    {
      "id": "mnybrpv",
      "body": "[deleted]",
      "created_utc": 1745081887.0,
      "score": -44
    },
    {
      "id": "mnzken2",
      "body": "Every day or just sometimes ",
      "created_utc": 1745096331.0,
      "score": 18
    },
    {
      "id": "mo2eryd",
      "body": "There was some kid in school that was always showing me horrible animal abuse videos and I'm pretty sure it played a huge part in me going vegetarian initially, so I'd like to think some good came out of it at least.  There's a couple I still think about like 20 years later though.  Humans can suck sometimes.",
      "created_utc": 1745141922.0,
      "score": 3
    },
    {
      "id": "mnzygxh",
      "body": "This can also be done as soon as you see something traumatizing. If you're confronted with this situation again, or reminded of the video, it might be best to find something hands-on and engaging to do so your brain doesn't have mental room to obsess over the sight. Some doctors say Tetris is good for that.",
      "created_utc": 1745101181.0,
      "score": 11
    },
    {
      "id": "mnyp0z2",
      "body": "I always thought it was kind of like sexual abuse in the way they have to hand it over to someone.   Maybe it's just too dark for a mind to handle. I didn't ever want to introduce someone to it, but it's definitely a thing as my brother showed me these videos when I was pretty young and I had an ex who was intent on introducing his young nephew to it.   Gross.",
      "created_utc": 1745085982.0,
      "score": 13
    },
    {
      "id": "mo23zqa",
      "body": "Yeah, I don't get it either. I think it's sickening that anyone gets enjoyment out of things like this. Truly sickening. People like that are what's wrong with the world, tbh. If those people didn't exist I genuinely think the world would be a much better place with a lot less unnecessary suffering. Because, yes, here you're talking about them just watching it. But I can virtually guarantee a fair number of the people doing these awful things are the same way.",
      "created_utc": 1745134968.0,
      "score": 1
    },
    {
      "id": "mnzk4d0",
      "body": "Well yeah should me how fragile everything is and I shouldn’t take things for granted ",
      "created_utc": 1745096235.0,
      "score": 5
    },
    {
      "id": "mnyul6n",
      "body": "This is a great advice! Thank you",
      "created_utc": 1745087753.0,
      "score": 4
    },
    {
      "id": "mnzhhcr",
      "body": "Wow. This is deep. I need to read this a few times. But good stuff",
      "created_utc": 1745095363.0,
      "score": 3
    },
    {
      "id": "mo1syiy",
      "body": "Bring meaning to a memory. Never thought of it that way. Thank you",
      "created_utc": 1745128309.0,
      "score": 1
    },
    {
      "id": "mnym5nm",
      "body": "I don’t think you mean ‘pro life’ - that refers to anti-abortionists.",
      "created_utc": 1745085112.0,
      "score": 302
    },
    {
      "id": "mo23s5f",
      "body": "Yeah, I'm usually not one for encouraging people to get rid of a friend based on a single incident told second hand on the internet but... just sending a video like this to a friend with no warning whatsoever feels like a red flag. Obviously OP knows this person better than us, but that's at the very least not a very good sign. Definitely a fair reason to no longer be friends with that guy.",
      "created_utc": 1745134838.0,
      "score": 11
    },
    {
      "id": "mnydexw",
      "body": "wdym by \"pro life\"",
      "created_utc": 1745082404.0,
      "score": 95
    },
    {
      "id": "mo27txb",
      "body": "That's how I did it. While I still get a sense of dread when I think about the gore, the other part is that it's educational in the sense that it is what happens in life, and you can only get stronger from it.",
      "created_utc": 1745137382.0,
      "score": 2
    },
    {
      "id": "mnybtwg",
      "body": "[deleted]",
      "created_utc": 1745081905.0,
      "score": -52
    },
    {
      "id": "mo09jsa",
      "body": "I hope you called animal control on that manipulative POS. That’s particularly awful, and I’m so sorry that happened to you.",
      "created_utc": 1745105065.0,
      "score": 5
    },
    {
      "id": "mnywygb",
      "body": "i had a similar problem with recurring negative thoughts, and what really helped me was consistently practicing mindfulness, i actually built mindful buddy to help me stay consistent maybe it could help you too.\n\nhttps://www.mindfulbuddy.ai/home",
      "created_utc": 1745088522.0,
      "score": 2
    },
    {
      "id": "mo221zj",
      "body": "At 4 what how can such a young child get access to this 😦",
      "created_utc": 1745133757.0,
      "score": 2
    },
    {
      "id": "mo0l58a",
      "body": "I second this this commenter is right go seek some counseling",
      "created_utc": 1745109277.0,
      "score": 2
    },
    {
      "id": "mo226ui",
      "body": "Yes this right here that was a while ago but TikTok is not as safe as many people think .",
      "created_utc": 1745133840.0,
      "score": 1
    },
    {
      "id": "mo22gv2",
      "body": "Don’t really get that scared from animal ones just angry I’m kinda desensitised because my uncle used to take me hunting a lot with his shotgun ",
      "created_utc": 1745134010.0,
      "score": 1
    },
    {
      "id": "mo22i2d",
      "body": "Every day",
      "created_utc": 1745134030.0,
      "score": 1
    },
    {
      "id": "mnzjb7m",
      "body": "I think we watched the same video ",
      "created_utc": 1745095969.0,
      "score": 2
    },
    {
      "id": "mo0l1yl",
      "body": "Two guys one hammer… it ruined my life and desensitized me while also traumatized me in a way. I was a teenager, I can’t imagine that kids younger than me watched it too.",
      "created_utc": 1745109242.0,
      "score": 1
    },
    {
      "id": "mo6j38v",
      "body": "Those terrorist videos traumatized me too.  And various kitten ones.. God the internet those days, do not miss this. When things scare me I go full immersion (bears, earthquakes). I didn't watch any more of those videos but I got really into true crime trying to understand how people could do such horrible things. Do not recommend that route. It took probably 15 years of anxiety to come to terms with the fact horrible things happen in the world and start to appreciate that there is a lot of good in the world too, not just nightmares.\nI went from true crime to horror and it's kind a big part of my identity now. Those videos shaped who I am. So fucked. Do not do gore though. Never gore.",
      "created_utc": 1745196601.0,
      "score": 1
    },
    {
      "id": "mo275yg",
      "body": "Yes I already new that used to gun hunting with my uncle",
      "created_utc": 1745136959.0,
      "score": 1
    },
    {
      "id": "mo2780k",
      "body": "I think it already has I can’t remember a day when I’ve not thought about it after it has happened ",
      "created_utc": 1745136998.0,
      "score": 1
    },
    {
      "id": "mo234rg",
      "body": "This is what I’m confused about how I’m I so deeply effected by a (video) of a guy I never new ",
      "created_utc": 1745134427.0,
      "score": 1
    },
    {
      "id": "mo238za",
      "body": "I’m not gonna watch them intentionally but I’ve seen other but they have like zero effect like I just don’t think about them at all really",
      "created_utc": 1745134502.0,
      "score": 1
    },
    {
      "id": "mo23fnq",
      "body": "Ok thanks I’ve had other memories that have been bad turned to h\nJust memories almost felt like it didn’t happen ",
      "created_utc": 1745134619.0,
      "score": 1
    },
    {
      "id": "mo23od3",
      "body": "But it’s been a full year it was march 15 on a Friday and I still remember it went away then came back",
      "created_utc": 1745134773.0,
      "score": 2
    },
    {
      "id": "mo23wl4",
      "body": "Yes but I feel as if I’m weak because my dad had some very bad trauma when he was young but know he is the best guy I know I just feel as if my one is irrelevant because it was on a screen vs things happening infront of him",
      "created_utc": 1745134914.0,
      "score": 1
    },
    {
      "id": "mo2407n",
      "body": "Yeah human ones make me scared dog ones make me deeply sad",
      "created_utc": 1745134976.0,
      "score": 2
    },
    {
      "id": "mo247if",
      "body": "Yes but know I shield other people from his videos like he asked my should I show this girl and I grabbed his phone and wouldn’t give it back til he said he wouldn’t ",
      "created_utc": 1745135101.0,
      "score": 2
    },
    {
      "id": "mo24dk4",
      "body": "I think I’ve seen this one it was very disturbing ",
      "created_utc": 1745135204.0,
      "score": 2
    },
    {
      "id": "mo25dxu",
      "body": "Well quit while you still can it fries you dopamine receptor and can put in a constant state of depression ",
      "created_utc": 1745135835.0,
      "score": 1
    },
    {
      "id": "mo25hy5",
      "body": "Find something else to do go on a run play games go out anything but that I hope you get better soon ",
      "created_utc": 1745135904.0,
      "score": 1
    },
    {
      "id": "mo25rpg",
      "body": "That’s the thing it was only this video that well traumatised me because I’ve seen other video that were linked to the news like Isis executions and stuff from Guantanamo bay but they didn’t effect me like that did ",
      "created_utc": 1745136075.0,
      "score": 1
    },
    {
      "id": "mo3jbj1",
      "body": "14",
      "created_utc": 1745160425.0,
      "score": 1
    },
    {
      "id": "mo4vm1y",
      "body": "Probably because I didn’t k or what was going to happen I just thought it would be a funny clip plus it was very noisy ",
      "created_utc": 1745175834.0,
      "score": 1
    },
    {
      "id": "mpadgx1",
      "body": "I wouldn’t recommend watching it",
      "created_utc": 1745746672.0,
      "score": 1
    },
    {
      "id": "mrvxf6t",
      "body": "Wow from the time I posted this till now life just been getting Better it’s sunny and nice outside been playing football and have grown at least a little bit thicker skin thanks though ",
      "created_utc": 1747042623.0,
      "score": 2
    },
    {
      "id": "mnyozk9",
      "body": "It was most likely Ronnie McNutt suicide video so not murder and he was recording it",
      "created_utc": 1745085970.0,
      "score": 5
    },
    {
      "id": "mo23iek",
      "body": "My brother told me this (keep in mind he was their for the peak of shock sites)",
      "created_utc": 1745134666.0,
      "score": 1
    },
    {
      "id": "mo24fz9",
      "body": "Is this a video or are you religious ",
      "created_utc": 1745135246.0,
      "score": 1
    },
    {
      "id": "mo24md5",
      "body": "Your right this shows me not to take life for granted and to not be a bad person while I’m here",
      "created_utc": 1745135358.0,
      "score": 1
    },
    {
      "id": "mnz26lz",
      "body": "Bro stfu, this post is about a traumatic experience and you're complaining about punctuation? Be fr.",
      "created_utc": 1745090268.0,
      "score": 5
    },
    {
      "id": "mnyea0x",
      "body": "If you dont have anything meaningful to say just leave? Nothings keeping you here you know.",
      "created_utc": 1745082677.0,
      "score": 18
    },
    {
      "id": "mnyg7sm",
      "body": "average invincible fan, you’re a pos",
      "created_utc": 1745083282.0,
      "score": 6
    },
    {
      "id": "mnyeeyj",
      "body": "Guys, watch out… The sigma’s here! 🥶☠️💯",
      "created_utc": 1745082721.0,
      "score": 13
    },
    {
      "id": "mnyiirc",
      "body": "Everybody be careful where you’re stepping! The alpha is running around town and you’re walking on some eggshells! 🐺🐺😭🙏❓❓❓",
      "created_utc": 1745083993.0,
      "score": 7
    },
    {
      "id": "mnypw8b",
      "body": "Pay no mind to this, users post history shows he's obviously suffering badly.",
      "created_utc": 1745086256.0,
      "score": 3
    },
    {
      "id": "mnyr31s",
      "body": "That’s nice, Coming from the person who calls themselves a boy on their profile and just 30 days ago posted they were suicidal and tried to kill themselves. Why be hateful when you have mental health problems also?",
      "created_utc": 1745086623.0,
      "score": 3
    },
    {
      "id": "mnymu8a",
      "body": "I second this",
      "created_utc": 1745085314.0,
      "score": -2
    },
    {
      "id": "mnzkns1",
      "body": "When watching videos someone shows/sends you.",
      "created_utc": 1745096417.0,
      "score": 5
    },
    {
      "id": "mo3qa5j",
      "body": "Luckily I think that term is fading away and people are starting to say \"anti-abortion\" and \"pro-choice\"",
      "created_utc": 1745162704.0,
      "score": 21
    },
    {
      "id": "mnyktsc",
      "body": "videos that make you happy, standup comedy or great movies etc",
      "created_utc": 1745084710.0,
      "score": 60
    },
    {
      "id": "mnyfxzs",
      "body": "it is tho bros got actual fucking trauma from it most likely",
      "created_utc": 1745083198.0,
      "score": 28
    },
    {
      "id": "mnzihzm",
      "body": "Excellent!",
      "created_utc": 1745095699.0,
      "score": 1
    },
    {
      "id": "mo2v3fn",
      "body": "Unwatched kids/neighbors with older siblings surfing the web. Image board sites were lawless, and you had to click a link before you saw what the image was, some of them were misleading on purpose. I don't think adults fully understood what kids were able to access online at the time.\n\nI will say a strategy I use is actively reminding myself these aren't thoughts or images that I choose to imagine, and then I actively think of things and people I love and appreciate.\n\nEdit: also another way I deal with that is recognizing that there is messed up stuff happening on the planet and being thankful I'm not a part of it. It's not a bad thing to be aware of the negative things in life, they just suck to see.",
      "created_utc": 1745151151.0,
      "score": 2
    },
    {
      "id": "mnzx4pu",
      "body": "Ah geez man, in that case I'm real sorry that shit was horrifying. Dump that friend asap",
      "created_utc": 1745100728.0,
      "score": 2
    },
    {
      "id": "mo4k19h",
      "body": "Are you still traumatized ",
      "created_utc": 1745172129.0,
      "score": 1
    },
    {
      "id": "mo2g0yx",
      "body": "You should probably not let it get to you *that* much. So,e people see things like that every day. For some of us, that's just a work day.\n\nI think that it is good that you are sensitive to that, it shows that you instinctively value human life. Not everyone can say that. If your friend was amused by that video, he is probably very sick. You should keep in mind that you may have to also engage in brutal actions in the future, to protect yourself or your family. You shouldn't take it likely, but you don't need to be somewhat capable of it.",
      "created_utc": 1745142726.0,
      "score": 1
    },
    {
      "id": "mo2fgt4",
      "body": "what made this one so different?",
      "created_utc": 1745142367.0,
      "score": 1
    },
    {
      "id": "mo2wio5",
      "body": "Your trauma isn't irrelevant, but this is definitely temporary. We are in different times where mental fortitude isn't as high, but that's society, not just you and that's another conversation for another time. Feel your feels and process them. Stay busy and focused on advancing your future. This situation will NOT break you!",
      "created_utc": 1745151811.0,
      "score": 1
    },
    {
      "id": "mo24kfn",
      "body": "Oh no 😣 I’m sorry you had to see it too. It was absolutely horrifying.",
      "created_utc": 1745135324.0,
      "score": 1
    },
    {
      "id": "mo22v0t",
      "body": "Yes this it I’ve stumbled across other gore videos but this one was different, like I’ve seen cats get put microwaves and guys getting their head chopped off in white rooms but I don’t know this one just felt different maybe because it was suicide someone can do this to y\nThemselves I would never dream about it because I have a loving family but it just seems to easy \n\nSorry for bad grammar ",
      "created_utc": 1745134255.0,
      "score": 1
    },
    {
      "id": "mnz3k2a",
      "body": "A traumatic experience? Seeing a video? Come on. \n\nI hate the misery olymics and competing on who has it worse, but this has to be a joke. Either OP has underlying trauma that's being brought to the surface by seeing the video or the whole post is a 12-year-old'a cry for attention.",
      "created_utc": 1745090729.0,
      "score": -6
    },
    {
      "id": "mo4lop3",
      "body": "What did he say ",
      "created_utc": 1745172649.0,
      "score": 2
    },
    {
      "id": "mnyio6c",
      "body": "I literally have never came across an invincible fan that was not annoying or a creep like that anime invites the most miserable people",
      "created_utc": 1745084040.0,
      "score": 5
    },
    {
      "id": "mo1ht28",
      "body": "Ok this is tone deaf",
      "created_utc": 1745122376.0,
      "score": 1
    },
    {
      "id": "mo3brfr",
      "body": "He might have been referring to how often you still think about the video. It's probably not every day, right?",
      "created_utc": 1745157864.0,
      "score": 1
    },
    {
      "id": "mo4zj38",
      "body": "Definitely not everywhere. Never heard it used in any other context personally.",
      "created_utc": 1745177145.0,
      "score": 11
    },
    {
      "id": "mnz6ztj",
      "body": "Maybe go with “life-affirming.” Pro-life has very specific political connotations.",
      "created_utc": 1745091890.0,
      "score": 220
    },
    {
      "id": "mnykoks",
      "body": "exactly, he going to do it again until the material gets even worse?",
      "created_utc": 1745084666.0,
      "score": 12
    },
    {
      "id": "mnyrbs8",
      "body": "[removed]",
      "created_utc": 1745086701.0,
      "score": -27
    },
    {
      "id": "mo4w46t",
      "body": "I think I was a jr in highschool and now I am 32. I am no longer traumatized. But if I were to see it again as an adult or see the fucked up animal video, after having a cat for 10 years who just passed, I would definitely. The video involves a blender… thinking about that makes me tear up tho. I also have a fiancé who is a veteran. Combat medic. This was 10 years ago. He literally just woke up sweating right now actually. He saw his friends die in the most gruesome of ways, so he is traumatized since he was there. And hearing his stories… it makes me sort of desensitized when it comes to the hammer video.",
      "created_utc": 1745176001.0,
      "score": 2
    },
    {
      "id": "mo2g9d7",
      "body": "Not sure I think just cause it was suicide",
      "created_utc": 1745142873.0,
      "score": 1
    },
    {
      "id": "mnzjqir",
      "body": "I had no one else to talk to no one else cares ",
      "created_utc": 1745096109.0,
      "score": 3
    },
    {
      "id": "mo51cfw",
      "body": "He was bitching abt feelings bc they emasculate him or something.",
      "created_utc": 1745177764.0,
      "score": 1
    },
    {
      "id": "mnyljqu",
      "body": "literally omfg",
      "created_utc": 1745084927.0,
      "score": 3
    },
    {
      "id": "mo1j0aj",
      "body": "That’s funny you say my reply to your comment is tone deaf, Did you take a good look a yours again?",
      "created_utc": 1745122973.0,
      "score": 1
    },
    {
      "id": "mo4jbkt",
      "body": "This",
      "created_utc": 1745171904.0,
      "score": 1
    },
    {
      "id": "mo1alxf",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1745119091.0,
      "score": 2
    },
    {
      "id": "mo4wkmv",
      "body": "My uncle was in Afghanistan he has ptsd  also I hope your fiancé gets better",
      "created_utc": 1745176155.0,
      "score": 1
    },
    {
      "id": "mnzkdxs",
      "body": "Fair enough. Why do you think that video had such a huge impact on you?",
      "created_utc": 1745096324.0,
      "score": -1
    },
    {
      "id": "mo1j8lb",
      "body": "I know mine is also not great, but that’s why I deleted it. You think I give a shit about downvotes? But saying “why he hateful if you also have mental health issues” \n\nCome on man, most people I know with mental health issues take it out on the rest of the world. You clearly haven’t been there yet",
      "created_utc": 1745123088.0,
      "score": 0
    },
    {
      "id": "mo7vb61",
      "body": "Definitely not every day. A few times a year at this point, usually when I see something that triggers the memory.",
      "created_utc": 1745218103.0,
      "score": 1
    },
    {
      "id": "mo4yk5s",
      "body": "Thank you so much. I think over time you will get better, but every one is different. You will start to go through things in real life that are upsetting and I think losing my father to cancer, really made me feel like nothing can get worse. I still feel sick when I imagine him in hospice. And holding my cat when she got put down, and helping my friend who lost his cat to a coyote (very gruesome) it legit hardened me and left me jaded. So it makes the video feel like nothing now, if that makes sense. It’s like that trauma got check mated by my current issues. So long story short, yes, because things that happened in real life since 2009, trumped that video. I promise it will start to get better, but you won’t forget.",
      "created_utc": 1745176821.0,
      "score": 1
    },
    {
      "id": "mo268at",
      "body": "I don’t know that’s the thing I can’t comprehend why it had such a big impact for a digital video.",
      "created_utc": 1745136364.0,
      "score": 2
    },
    {
      "id": "mo1k2da",
      "body": "Lol funny you assume that. I was in the hospital in 2016 for 9 days for attempting suicide. I have Autism, Bipolar, Depression, Anxiety and PTSD",
      "created_utc": 1745123507.0,
      "score": 1
    },
    {
      "id": "mo8r5ma",
      "body": "Oh ok how long did it take to get to this point if you don’t mind me asking",
      "created_utc": 1745236706.0,
      "score": 1
    },
    {
      "id": "mopu032",
      "body": "It really bothered me for a few months. I wasn’t thinking about it much a year later. As the years went on I thought about it less and less.",
      "created_utc": 1745459702.0,
      "score": 1
    }
  ]
}