{
  "id": "1js4848",
  "title": "I chose not to die. I left loaded weapons on the table and walked to the hospital.",
  "selftext": "I’m 38. I’ve been sober since 2018, married with a child, and on paper I’m doing well—career, family, stability. But inside, I’ve spent years quietly falling apart.\n\nMy first serious crash was at 22. I had gotten a girl pregnant, and before we could talk about it, she had an abortion without telling me. That destroyed me. I fell into a depression I couldn’t explain to anyone. I stopped going to class. I isolated. I drank. A lot.\n\nOne night, drunk and desperate, I emptied my bank account ($3,000) and bought a one-way Greyhound ticket to L.A. I never made it—I got robbed at the terminal, then arrested. The cops took me to a psych ward instead of jail. That might have saved my life.\n\nEventually I finished college. In 2011 I worked in Afghanistan with the military. We got hit with rocket attacks regularly, but I barely reacted. I wasn’t brave—I was numb. Nothing outside felt as intense as what was happening inside me.\n\nAt 27, I lost my job and ended up hospitalized again after another depressive spiral. The suicidal ideation had become familiar by that point. It would creep in and take over until I couldn’t tell if I was in danger or just tired of existing.\n\nI didn’t stop drinking until I was 33. One morning, I left for the hospital with loaded weapons sitting on my coffee table. I made a choice not to die that day—and I’ve never forgotten it.\n\nA doctor told me I had cirrhosis. That scared me sober. A year later, a liver specialist told me it was alcoholic hepatitis and that I’d recovered. Somehow, my body gave me a second chance.\n\nSince then, I’ve stayed sober. I’ve been diagnosed with Major Depressive Disorder, and I’ve tried different meds. Some helped. Some triggered what I can only describe as months of euphoria. I spent thousands of dollars on Pokémon cards. I told myself it was “investing,” but really, I was spinning out.\n\nWhen I crashed again, I ended up in the hospital for a week. The idea of bipolar has been brought up, but nothing formal. I don’t know what I am—other than confused.\n\nNow, even with meds and sobriety, I’ve started raging at the smallest criticisms. It’s like this explosive anger just erupts from nowhere. I hate how it makes me feel. I hate the way it affects my wife and kid. I want to stop, but I don’t fully understand what’s happening inside me.\n\nI’m doing everything I can. Therapy. Psychiatry. Meds. Honest reflection. And still—some days I feel like I’m right back on the edge I was at 10 years ago.\n\nI guess I’m writing this because I needed to say it out loud. I don’t have a clean ending or an insight to offer. Just this:\n\nI’m still here. Still trying.",
  "created_utc": 1743861991.0,
  "score": 800,
  "num_comments": 44,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1js4848/i_chose_not_to_die_i_left_loaded_weapons_on_the/",
  "comments": [
    {
      "id": "mljilih",
      "body": "**Hello u/!**\n\nThank you for using a content warning. Your post is under review.\n\n---\n**If you are in immediate crisis:**\n- Visit [Find A Helpline](https://findahelpline.com/i/iasp) for local hotline info.\n- Check [Hotline FAQs](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) for guidance.\n- Consider posting on r/suicidewatch or messaging their moderators [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch).\n\n---\n**For suicidal thoughts or self-harm:**\n- [HelpGuide](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) offers coping tips.\n- You are not alone – see personal stories on YouTube.\n- Practice grounding exercises or listen to your favorite music.\n- Refer to [Find A Helpline](https://findahelpline.com/i/iasp) for more resources.\n\n**Take care and stay safe!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1743861991.0,
      "score": 1
    },
    {
      "id": "mljjty8",
      "body": "I'm so glad you're here. \n\nI have that, generally speaking, beneath anger you find sadness. Deep wells of grief. \n\nYou have much to grieve and I honor you and this hard journey. If you took a moment to find the origin of that anger, where do you feel it? In your body? Can you sense anything beneath the anger?\n\nMy chat and DMs are open if you'd like someone to listen. Keep moving. I'm so glad you're still here.",
      "created_utc": 1743862427.0,
      "score": 116
    },
    {
      "id": "mljv1f5",
      "body": "Hey OP,\nI just wanted to take a moment to acknowledge everything you’ve been through. You’ve shown incredible strength, and I’m genuinely grateful that you’re still here with us. I’m really proud of your resilience—keep pushing forward!",
      "created_utc": 1743866257.0,
      "score": 22
    },
    {
      "id": "mljqghc",
      "body": "Every time I get to a point where I’m not sure that I can handle what’s coming next, I’m gonna remember you. You came from your breaking point, stopped at a crucial point, and now you’re on a path to healing.",
      "created_utc": 1743864704.0,
      "score": 14
    },
    {
      "id": "mlkdcvr",
      "body": "That's some serious strength right there, know what it took to make that call and proud of you. \n\nPower of now is an excellent book if you can make it to about page 26 because it can seem a bit woo woo but there's some serious life advice and strategies in there that have saved me before xx",
      "created_utc": 1743872410.0,
      "score": 9
    },
    {
      "id": "mlk2kbq",
      "body": "Proud of you.",
      "created_utc": 1743868801.0,
      "score": 7
    },
    {
      "id": "mljn3m1",
      "body": "Im glad you're still here, still trying. You're so brave for making the decision to stay alive. Your life matters. I don't have much to say, but I'm really proud of you.",
      "created_utc": 1743863578.0,
      "score": 5
    },
    {
      "id": "mlk4bj6",
      "body": "You put words to things I didn't know how to say, and I will use going forward with therapy. I was right there beside you in Afghanistan mentally and possibly physically. I wonder how many of us are out there. \n\nThank you, I'm glad you're still here.",
      "created_utc": 1743869395.0,
      "score": 3
    },
    {
      "id": "mljmr48",
      "body": "Dude, that’s actually so fucking metal (no pun intended). But in all seriousness, I have bipolar (too?) and it’s a daily struggle to keep myself off the edge. I just wanted you to know that I see you and I may not know you personally but I’m so proud of you! Trying is honestly so hard but I commend your strength for it and the fact you’re trying to be better. I hope your family sees it too!",
      "created_utc": 1743863458.0,
      "score": 7
    },
    {
      "id": "mlk4mbt",
      "body": "I’m so proud of you, you’re so strong.",
      "created_utc": 1743869494.0,
      "score": 2
    },
    {
      "id": "mlk4tvb",
      "body": "I am so proud of you. Tomorrow needs you.",
      "created_utc": 1743869565.0,
      "score": 2
    },
    {
      "id": "mllj13m",
      "body": "Op thank you for adding to my motivation to keep going. I still have hope that one day we’ll look back and be so happy we kept fighting. Maybe we can come back here someday and write about that happy ending so someone else is motivated as well",
      "created_utc": 1743886356.0,
      "score": 2
    },
    {
      "id": "mljz1iu",
      "body": "Even though you're struggling, I'm glad you're getting help and still with us. It's not easy and some days it feels like there's no way out. So you should be proud for fighting for yourself and  asking for help. It's a tough thing to do.  You will get through this and it will take time, not gonna lie.  I get serious anger or loss of patience with my depression.  I have MDD too. You're not alone and you'd group is great for help and sometimes just to have someone listen",
      "created_utc": 1743867617.0,
      "score": 1
    },
    {
      "id": "mlk6212",
      "body": "Fight and win.",
      "created_utc": 1743869973.0,
      "score": 1
    },
    {
      "id": "mlk9o3s",
      "body": "happy for u.",
      "created_utc": 1743871190.0,
      "score": 1
    },
    {
      "id": "mlkpusq",
      "body": "i’m proud of you! i’m glad you’re still here!",
      "created_utc": 1743876484.0,
      "score": 1
    },
    {
      "id": "mllc2rg",
      "body": "As you can already see, so many people are proud of you! I’ve staved off over a decade of suicide with usefulness in the past, and taking that step is a radical act of self love that is so difficult to take.\n\nIn a previous reply, you mentioned detaching. That’s probably dissociation. Something I also felt for the longest time for long stretches. Please talk to a therapist about this, and know that articulating your feelings is a powerful and courageous thing to do, so I’m personally really proud of you for also doing that.\n\nPlease keep living, you deserve to reach that good space and have a happy life!",
      "created_utc": 1743884028.0,
      "score": 1
    },
    {
      "id": "mllkj6l",
      "body": "Thank you for sticking around.",
      "created_utc": 1743886864.0,
      "score": 1
    },
    {
      "id": "mllod2h",
      "body": "This gives me so much hope to be honest. You are my new proof that I too can keep going for as long as it takes to get better, that I can survive this life. Even though I'm barely an adult myself, I am so proud of you for choosing life so many times.",
      "created_utc": 1743888209.0,
      "score": 1
    },
    {
      "id": "mllukya",
      "body": "Hospital folk lobbed a bipolar diagnosis at me as well, but given they spent a total of 5min with me (probably less), I also don't know \"what\" exactly I am... OP we got this though, diagnosis or none :)",
      "created_utc": 1743890442.0,
      "score": 1
    },
    {
      "id": "mln6zyo",
      "body": "First I want to congratulate you on staying sober for so long. I'm an alcoholic in recovery right now and I always used alcohol to cover up the ugly person I thought I was. I've had mental health issues my whole life and severe anger has always been what got me in trouble. I can get angry at anything and it's destructive. I also do therapy, psychiatry, and self reflection. I'm also very involved as a member of AA and since getting involved was the first time in my life that I started to look at myself and give an effort to getting better. I'm still very early on (8 months no alcohol, and close to 5 and a half totally clean) and the progress I've seen is amazing, but I still see my old self sometimes and it really scares me. I just had that happen actually. My old explosive anger that doesn't come out nearly as much anymore came out and I feel horrible about it. I'm honestly not even sure why I clicked on your post and I've never even been on this subreddit, but I was searching for something. Reading what you said and seeing the similarities in mental health struggles involving alcohol too just really made me want to post. I'm happy that you're alive today and I just wanted you to know that this is something I really needed to read right now. We may have our struggles and snap even at the small things, but I do believe we can continue to get better. I may feel defeated by myself right now in a sense, but today I have hope that I can recover. Anyway I hope you're doing better than when you posted this and thank you so much for your courage. You're stronger than you may realize",
      "created_utc": 1743909387.0,
      "score": 1
    },
    {
      "id": "mlnqcl8",
      "body": "Hell ya! Good for you man!",
      "created_utc": 1743918777.0,
      "score": 1
    },
    {
      "id": "mlns2t9",
      "body": "you have so much strength",
      "created_utc": 1743919742.0,
      "score": 1
    },
    {
      "id": "mlns3a4",
      "body": "you have so much strengthm its incredible",
      "created_utc": 1743919749.0,
      "score": 1
    },
    {
      "id": "mlnyqt7",
      "body": "Thank you for staying!  Thank you for sharing your story and being a voice for those who aren't able to speak about it.   Big hugs & love to you!",
      "created_utc": 1743923499.0,
      "score": 1
    },
    {
      "id": "mlqqas7",
      "body": "I'm so happy to hear you're still going. It makes me feel like maybe there's hope for me too. I think I will be experiencing depression or depressive episodes until the day I die. But I want to keep going. It's just so hard sometimes",
      "created_utc": 1743965714.0,
      "score": 1
    },
    {
      "id": "mlqr9mk",
      "body": "I'm so happy you did. Great job, I wish you all the best ✊",
      "created_utc": 1743966024.0,
      "score": 1
    },
    {
      "id": "mm16llv",
      "body": "Good man. Proud of you!",
      "created_utc": 1744119590.0,
      "score": 1
    },
    {
      "id": "mm4c5b3",
      "body": "I’m so proud of you. Sending you all the love in the world! ",
      "created_utc": 1744153716.0,
      "score": 1
    },
    {
      "id": "mmgjrep",
      "body": "You’re absolutely incredible and amazingly strong. We’re here with you and we hear you, no matter what ❤️",
      "created_utc": 1744320381.0,
      "score": 1
    },
    {
      "id": "mmi50rz",
      "body": "I’m experiencing that right now.  I’ve started to think if I’m able to even recover or overcome this at all.  I’m feeling suicidal right now.  But no worries, my anxieties and extreme self-berating will exhaust me to a point of passing out.  I’ll just sleep it out.\n\nI have found my “acceptable” drink of choice.  I’m into wine now and I could finish 3 bottles in a day, 2-3 if my acid reflux is acting up. The only thing holding me back from being a full-blown alcoholic is my GERD.  Weed has been my go-to, but even that is starting to not make feel like anything.  I even switched to live resin now for a stronger kick.  I’d get high for 1H, then I’m sober.  The government also jacked up the prices so much, that it’s holding me back from buying more.  Also, finding a plug is too much work for me.\n\nMind you, I have been working towards bettering my overall health.  But, right now? On nights like this?  Man, dying would feel like ecstasy.  No more pain.  No more arguments and voices in my mind.  No more worrying if I’m too much or not enough.  No more hurt.  Just peacefully sleeping. \n\nBut, obviously, I can’t.  I can’t even get a gun like you.  Hanging won’t work cause I would have a likely chance of being saved.  So it goes with overdosing.  The body is predisposed to do whatever it takes to keep us from harm.  So no matter what I would do, even accidents, the chance of surviving is slim but not zero.\n\nSo I’m here.  Too fucking self-aware to kill myself\n\n I’m still here too.  Trying, so fucking hard.",
      "created_utc": 1744340917.0,
      "score": 1
    },
    {
      "id": "mljkiq6",
      "body": "I’m new to being able to articulate my feeling but when the anger hits it’s a wave in the body and almost feels like I detach or something. Whatever it is I always feel it in my body",
      "created_utc": 1743862671.0,
      "score": 28
    },
    {
      "id": "mlkfzc2",
      "body": "I second “the power of now” recommendation. Listening to that audiobook changed my life.",
      "created_utc": 1743873271.0,
      "score": 3
    },
    {
      "id": "mlk4mao",
      "body": "Was there in 2011 at BAF, KAF and Marmal. I’m so glad to hear from someone who was there too. Glad you’re also here.",
      "created_utc": 1743869494.0,
      "score": 3
    },
    {
      "id": "mljmzg2",
      "body": "Dude. Thank you. I think I’m realizing I may have bipolar as well. Feel like the picture is finally becoming clear",
      "created_utc": 1743863538.0,
      "score": 5
    },
    {
      "id": "mln9z7v",
      "body": "That’s first year is huge. Keep going!",
      "created_utc": 1743910721.0,
      "score": 1
    },
    {
      "id": "mljkugk",
      "body": "I’m just now working with my therapist to ID an origin",
      "created_utc": 1743862786.0,
      "score": 21
    },
    {
      "id": "mljnd8u",
      "body": "I’m glad! Understanding yourself is definitely a big step but don’t forget to give yourself some patience and a few graces. You owe that to yourself.",
      "created_utc": 1743863670.0,
      "score": 3
    },
    {
      "id": "mljn6gf",
      "body": "There's a book I recommend. It's not for everyone but if it hits it hits. No Bad Parts. Richard Schwartz. It helped me identify and make peace with many strong emotions.\n\nThe idea is if you allow yourself to approach these emotions and thoughts without shame but real curiosity, you can still the cycling within you. \n\nI also often recommend this TedTalk. 15 minutes.   \n[https://www.youtube.com/watch?v=gUV5DJb6KGs](https://www.youtube.com/watch?v=gUV5DJb6KGs)\n\nBig love to you",
      "created_utc": 1743863604.0,
      "score": 18
    },
    {
      "id": "mljsx3o",
      "body": "Thank you for this. I need to tattoo this on my hand",
      "created_utc": 1743865531.0,
      "score": 5
    },
    {
      "id": "mljspe8",
      "body": "Omg. This is great and why I came here. Much love back to you",
      "created_utc": 1743865458.0,
      "score": 11
    },
    {
      "id": "mljua8m",
      "body": "Good luck on your journey! It’s definitely lifelong but I hope it will all be worth it in the end. 💕 One last thing! Making it to 38 years is honestly a big feat in on itself! I am 12 to 13 years younger than you and hope to reach your age too, hopefully more!",
      "created_utc": 1743865998.0,
      "score": 3
    },
    {
      "id": "mljyyeg",
      "body": "You’re so welcome. And remember: you are making this effort. You are showing up and saying I’m doing this. \n\nThat’s courage. Keep showing up. ",
      "created_utc": 1743867589.0,
      "score": 10
    }
  ]
}