{
  "id": "1ewbc1u",
  "title": "If you’re reading this, I’m proud of you.",
  "selftext": "You woke up today, you won today. Let’s keep it going. Even if you didn’t step foot outside your home, you still did something powerful by opening up your phone to read this. This random internet stranger loves you and wants you to stick around. Feel free to message if you ever need to talk any time of day.",
  "created_utc": 1724097208.0,
  "score": 380,
  "num_comments": 36,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1ewbc1u/if_youre_reading_this_im_proud_of_you/",
  "comments": [
    {
      "id": "lixnog0",
      "body": "I wish I had been smart enough to export or save an audio message all my coworkers recorded for me.. but I didn't. ;\\\n\nBack when Covid19 first hit hard in the alpha-wave,. around March-April 2020, I spent 38 days in Hospital and 16 of those in ICU on a Ventilator. At one point while on the Ventilator, my vital signs got so weak the equipment was having a hard time sensing me (and the infiltration in my lungs and septic infection throughout my blood stream was basically killing me. (if you want to see longer description including Lung X-rays, go [here](https://www.reddit.com/r/AskReddit/comments/oi4b31/people_who_recovered_from_covid19_how_did_u/h4t9dek/?context=1) \n\nWhen my vital signs got borderline unreadable, Doctors recommended to my Employer that they schedule grief-counselors to be at my workplace that coming Monday morning to be ready in case I didn't make it and my coworkers needed therapy. \n\nAround that same time my Manager (who I highly respect) emailed out to our Dept and asked everyone to record audio-messages to me as motivation to fight my way out of the ICU coma. (I honestly don't know at that point how my body fought its way off deaths door.. but somehow it did)\n\nAfterwards when I got off the Ventilator and had all the other various tubes pulled out of me.. I started re-orienting myself and I was able to find the Microsoft Teams channel where my coworkers had uploaded the Audio-file they had edited together that had all their motivational messages in it. It totally made me cry. \n\nIt was a surreal experience for me because had I not pulled through,. I would have never been able to hear those messages. \n\nI just wanted to share that story, as someone who had struggled with dark depressive thoughts at different times in my life, we sometimes forget how much others around us appreciate and value us. We tend to spiral and think that we're \"worthless\",. but that's a lie. \n\nThere are people who care about you and would miss you if you were gone. Even if there hasn't been an overt opportunity for them to speak it.",
      "created_utc": 1724100785.0,
      "score": 27
    },
    {
      "id": "lixsjml",
      "body": "I was suicidal, depressed and in psychosis a few years ago. I've come so far since then. Thanks for making me smile a bit. Small changes really can add up over time.",
      "created_utc": 1724102346.0,
      "score": 19
    },
    {
      "id": "liy0xbw",
      "body": "You too! Actually showered today. It’s been longer than I’d like to admit. ",
      "created_utc": 1724105096.0,
      "score": 15
    },
    {
      "id": "liym1z9",
      "body": "Thank you. I just had to message the hotline 2 days ago to get some assistance. Things are just hard. People said it would be hard, but without reference it didn't mean a whole lot. Life isn't easy, no matter how bad we wish it were. It just means a lot to have people who are just nice to be nice. To make this existence less shitty. So truly, thank you.",
      "created_utc": 1724112474.0,
      "score": 6
    },
    {
      "id": "liysbwl",
      "body": "💖💖💖\nShine on,  Heroes.",
      "created_utc": 1724114766.0,
      "score": 5
    },
    {
      "id": "liz1mf3",
      "body": "Today has been especially rough. Spent most of the day napping and feeling numb.",
      "created_utc": 1724118107.0,
      "score": 7
    },
    {
      "id": "liza2u0",
      "body": "Lost my job today due to extreme anxiety and panic attacks leading to drinking. So I’m not proud of me today. Nearly wish I hadn’t woken up today. Certainly haven’t won.",
      "created_utc": 1724121202.0,
      "score": 3
    },
    {
      "id": "lixrjm8",
      "body": "You too",
      "created_utc": 1724102022.0,
      "score": 4
    },
    {
      "id": "liztazm",
      "body": ":(",
      "created_utc": 1724129527.0,
      "score": 2
    },
    {
      "id": "lj0914f",
      "body": "🥹💕💕",
      "created_utc": 1724138858.0,
      "score": 2
    },
    {
      "id": "lj0ao8m",
      "body": "THANK U",
      "created_utc": 1724139961.0,
      "score": 2
    },
    {
      "id": "lj0fop6",
      "body": "Thanks. I just came to from an episode of mania and am currently in severe chronic pain.",
      "created_utc": 1724143369.0,
      "score": 2
    },
    {
      "id": "lj1f57y",
      "body": "I am thinking of killing my self",
      "created_utc": 1724161038.0,
      "score": 2
    },
    {
      "id": "lixf9go",
      "body": "🫶🏻",
      "created_utc": 1724098168.0,
      "score": 2
    },
    {
      "id": "lixw8w4",
      "body": "TY !!!!!",
      "created_utc": 1724103554.0,
      "score": 2
    },
    {
      "id": "liy2bjf",
      "body": "Thank you",
      "created_utc": 1724105568.0,
      "score": 4
    },
    {
      "id": "liydjsx",
      "body": "Ya a great guy, mate 😀",
      "created_utc": 1724109423.0,
      "score": 3
    },
    {
      "id": "liyej91",
      "body": "Nice to read something encouraging and kind💕",
      "created_utc": 1724109771.0,
      "score": 2
    },
    {
      "id": "liyguvz",
      "body": "You rock. I cried at work today because I was stressed about wedding planning. You are worthy and you are loved too.",
      "created_utc": 1724110597.0,
      "score": 4
    },
    {
      "id": "liyqcj7",
      "body": "You have no idea how much I needed to hear this!",
      "created_utc": 1724114046.0,
      "score": 4
    },
    {
      "id": "lj0tqya",
      "body": "Waking up wasn't me winning. It wasn't my choice to wake up. It just happens, I unfortunately can't sleep forever. And even when I nearly did it wad the doctors who saved me, that definitely wasn't my choice.",
      "created_utc": 1724152023.0,
      "score": 1
    },
    {
      "id": "lj0vb70",
      "body": "Felt so nice to read this! Thank you 💕",
      "created_utc": 1724152800.0,
      "score": 1
    },
    {
      "id": "lj156cm",
      "body": "I needed to read this as last week was very challenging. Thanks. I appreciate you!",
      "created_utc": 1724157228.0,
      "score": 1
    },
    {
      "id": "lj17l51",
      "body": "Thank you 😊 🥰",
      "created_utc": 1724158211.0,
      "score": 1
    },
    {
      "id": "lj1nwm6",
      "body": "Thank you) I've read that after jogging and it's really made me smile and I want to say thank you :)",
      "created_utc": 1724164027.0,
      "score": 1
    },
    {
      "id": "lj0dd02",
      "body": "What an extraordinary and considerate idea from your employer and coworkers. Thanks for sharing this with us and for your final message, I have cried so much.",
      "created_utc": 1724141774.0,
      "score": 3
    },
    {
      "id": "lixvzdl",
      "body": "Thank you for sharing this and for making me cry as well. Your coworkers are so awesome.",
      "created_utc": 1724103469.0,
      "score": 7
    },
    {
      "id": "lj27gm7",
      "body": "Your story gave me chills. Beautiful coworkers. Sometimes it’s the smallest things that have the biggest impact. You are truly blessed to have them (and them, you). 🙏🏾❤️",
      "created_utc": 1724170153.0,
      "score": 3
    },
    {
      "id": "lj1gvfe",
      "body": "I'm glad you pulled through. That's quite a story you have about getting Covid 19. I for one had type 2 Flu Jan 2020 and had food poisoning in August from sweet chile sauce on chicken wings I got at Marcos Pizza. I looked it up on a website that people report food poisoning at restaurants or grocery stores. I have Microsoft Teams but haven't communicated with anyone on there yet. Last but not least I had Umbilical surgery repair last July 19th and one of the risks involved in the surgery was septic infection. Glad you pulled through because thats bad. Its the wrong response for your body to fight an infection. Septic shock is very bad. Thanks for your inspiring and uplifting message. God bless.",
      "created_utc": 1724161647.0,
      "score": 2
    },
    {
      "id": "lj6msb3",
      "body": "Now that is awesome. It's been a while for me too but you've made me want to try!",
      "created_utc": 1724232951.0,
      "score": 3
    },
    {
      "id": "lizggnd",
      "body": "I’m sorry that happened to you. Do you have anyone you can reach out to for help?",
      "created_utc": 1724123714.0,
      "score": 3
    },
    {
      "id": "ljftx53",
      "body": "Same",
      "created_utc": 1724359477.0,
      "score": 1
    },
    {
      "id": "liyjj9m",
      "body": "Thank you and congratulations on your upcoming wedding. I know it will be unforgettable.",
      "created_utc": 1724111561.0,
      "score": 1
    },
    {
      "id": "lj2chdv",
      "body": "I try to keep in touch with them,. but sadly that job (I was at for 15 years).. I ended up having to leave and I took another job halfway across the country. ;\\ (couldn't say no.. new job offered to double my salary). And now things being post-pandemic and work-from-home and other factors.. I'm finding it hard in a new city to meet friends or build that kinds of stronger bonds. Big picture I kinda want to move back to my old location,. although the pay-scales there (w/ inflation and all) probably won't support me doing that. \n\nSo I'm kinda biding my time and saving up money and brainstorming \"alternative life strategies\" to see if I can come up with maybe more of a \"digital nomad\" type job I can do from a Laptop that will allow me to pretty much work anywhere. Then I could just orient myself around friends.",
      "created_utc": 1724171740.0,
      "score": 2
    }
  ]
}