{
  "id": "1jy2pfq",
  "title": "I think my friend has killed herself",
  "selftext": "I was talking to her last night at 3 and she told me to go to sleep, she promised she wasn't gonna do anything bit at 4 I received this message \"i just wanted to say thank you for being my friend, i really appreciate it and thank you for letting me talk to you about deep shit, be safe and take care\" and now I'm worrying my arse off that she's done smth \n\nUPDATE: I got an update for yall. She's okay (thank god). It turns out I was just overreacting cos smth like that has happened to me before, and I didn't realise until they were in hospital. Im really thankful for your guy's support and help I really appreciate all of you ❤️",
  "created_utc": 1744531463.0,
  "score": 644,
  "num_comments": 105,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1jy2pfq/i_think_my_friend_has_killed_herself/",
  "comments": [
    {
      "id": "mmv4zvx",
      "body": "**Hello u/!**\n\nThank you for using a content warning. Your post is under review.\n\n---\n**If you are in immediate crisis:**\n- Visit [Find A Helpline](https://findahelpline.com/i/iasp) for local hotline info.\n- Check [Hotline FAQs](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) for guidance.\n- Consider posting on r/suicidewatch or messaging their moderators [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch).\n\n---\n**For suicidal thoughts or self-harm:**\n- [HelpGuide](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) offers coping tips.\n- You are not alone – see personal stories on YouTube.\n- Practice grounding exercises or listen to your favorite music.\n- Refer to [Find A Helpline](https://findahelpline.com/i/iasp) for more resources.\n\n**Take care and stay safe!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1744531464.0,
      "score": 1
    },
    {
      "id": "mmv5mhp",
      "body": "There are a few immediate options. Not sure which are available to you:\n\n* Go there.\n* Call her parents/family.\n* Call the authorities for a welfare check.\n\nI hope she is OK. I also hope this a prank, given your account is one-day old.",
      "created_utc": 1744531855.0,
      "score": 313
    },
    {
      "id": "mmv7qx7",
      "body": "I’ve often written messages like this without intentions, it’s a form of reassurance. It’s still important to check on them if you think there is something wrong, call their family for support and call authorities if you feel you need too.",
      "created_utc": 1744533223.0,
      "score": 105
    },
    {
      "id": "mmv9oj3",
      "body": "I'd have a wellness check done on her. That's a terrifying experience and I wish the best for you both",
      "created_utc": 1744534497.0,
      "score": 16
    },
    {
      "id": "mmvfnud",
      "body": "Please give us an update. If it’s an online friend, call police and tell them her handle (Online Name). Tell them you have serious indication that she wanted to kill herself. The text probably won’t be enough maybe say that she talked about killing herself. I hope she is well 🙏🏻. 🫂",
      "created_utc": 1744538419.0,
      "score": 25
    },
    {
      "id": "mmvprxs",
      "body": "UPDATE!?",
      "created_utc": 1744544323.0,
      "score": 9
    },
    {
      "id": "mmvjhxb",
      "body": "Please update us! We would love to know if your friend is safe and most importantly if you're okay",
      "created_utc": 1744540826.0,
      "score": 8
    },
    {
      "id": "mmv5hsn",
      "body": "If you really think that happened you need to call the police right now, they can track her through her accounts if it’s a online friend but either way.",
      "created_utc": 1744531773.0,
      "score": 16
    },
    {
      "id": "mmvuciv",
      "body": "tbh i’ve been in bad headspaces, i have deff told my friends that i love them if im having a tough night, it’s nice to hear that kinda stuff when your in a bad place but you won’t if you don’t put the effort to reaching out",
      "created_utc": 1744546541.0,
      "score": 3
    },
    {
      "id": "mn5rz68",
      "body": "PHEWWW THANK GOD THEY’RE ALIVEEE",
      "created_utc": 1744679233.0,
      "score": 3
    },
    {
      "id": "mmw2kr8",
      "body": "I’ve been there. I phoned the police and my biggest regret is id been asleep most of the day, so don’t delay. My best friend was sadly gone. I hope your outcome is different. Let us know.",
      "created_utc": 1744550062.0,
      "score": 2
    },
    {
      "id": "mn010nk",
      "body": "I had a friend start doing the \"thanks for being my friend\" shit and it was just dramatic for a bit.  Then it suddenly wasn't.  Keep tabs on your friend.",
      "created_utc": 1744598379.0,
      "score": 2
    },
    {
      "id": "mn3ax7q",
      "body": "Really glad she’s okay, OP. Good of you to be so concerned for your friend",
      "created_utc": 1744650686.0,
      "score": 2
    },
    {
      "id": "mmv68mp",
      "body": "Call in a wellness check, I mean go there if you must, but potentially seeing a dead body sucks, especially if it’s someone you care for . And then you have to take in account on how they “did it “ . But hopefully they just fell asleep and will ask you to go grab coffee in the morning!",
      "created_utc": 1744532246.0,
      "score": 2
    },
    {
      "id": "mmvax6e",
      "body": "I'm so sorry, this is a painful time for you. I don't know if I'm helpful \n\n\nI had a similar experience, an online friend became more and more erratic, with vaguely suicidal messages. Then he tells me \"goodbye friend\",  which just felt really off. He had *always* ended conversations with \"goodbye, see you later\". I know it's a small detail but it felt really important. I didn't know much about him except for the state he lives in. Just had to hope he was alright, tried to get more data about him but he didn't have any on him. Spent a few days thinking about the worst, that he killed himself. After a while, I was able to dig up a few possibile people who'd possibly know him. Eventually got in contact with his parents, tried to make sure he was alright (I did not disclose why I called or anything else). Turns out he was alright, but in a hospital from a stomach bug. Obviously a lie, he was Indian and people here would never ever let slip that someone's suicidal or mentally ill. Thought he made an attempt but was alright. When he was released, he told me he was in a psychiatric hospital for manic behaviour.\n\n\nBut I've also done this. Once I was talking to someone high, then talked about personal stuff like mental problems and pain. Our friendship was mostly around mental health, I met her on reddit, talking about ADHD. Told her that I feel suicidal sometimes, about the mental pain and regret for it all. Started not responding for a while or bringing weird nodding on opioids and benzos. She did get worried, and then I tried to make her less anxious, I told her I took too much painkillers and benzos, thinking that's somehow going to calm her. Then I pass out and wake up the next morning. Had several messages on reddit with those suicide help message things too.\n\n\n\nFelt too ashamed to talk to her again, hated how I just dumped this on her and made her worry thinking I offed myself. Took me a while to get the courage to talk again, but she understood.",
      "created_utc": 1744535306.0,
      "score": 1
    },
    {
      "id": "mmvwhhs",
      "body": "Is this a joke call the police not go too Reddit",
      "created_utc": 1744547506.0,
      "score": 1
    },
    {
      "id": "mmw4lio",
      "body": "I hope she is okay. Please get off of here and go do a wellness check. Call the police, her family, her friends. Omg get off of here and go help her.",
      "created_utc": 1744550840.0,
      "score": 1
    },
    {
      "id": "mmwboih",
      "body": "Call the parents or the police.",
      "created_utc": 1744553329.0,
      "score": 1
    },
    {
      "id": "mmwbpr5",
      "body": "So umm? Is she… is she okay now? Or…",
      "created_utc": 1744553341.0,
      "score": 1
    },
    {
      "id": "mmx4tyh",
      "body": "I read the update, I just want to say you are a really good friend, she is lucky to have you, I hope your doing okay too ❤️",
      "created_utc": 1744562609.0,
      "score": 1
    },
    {
      "id": "mmxj36y",
      "body": "[removed]",
      "created_utc": 1744566949.0,
      "score": 1
    },
    {
      "id": "mnpntwh",
      "body": "Im glad she is fine, you didn’t over react I’m sure you care a lot for her <33",
      "created_utc": 1744953196.0,
      "score": 1
    },
    {
      "id": "mnsq6ft",
      "body": "I'm so glad your friend is okay. You weren't overreacting given the nature of her message. It's good to be watchful and she's lucky to have you as a friend.",
      "created_utc": 1744999436.0,
      "score": 1
    },
    {
      "id": "mn5ah8c",
      "body": "So instead of visiting her or calling anyone close to her or calling cops you log in, typed this and waited for answers.\n\n\nGen zzz",
      "created_utc": 1744673055.0,
      "score": 0
    },
    {
      "id": "mo2tlns",
      "body": "I am glad she is okay!\n\nOn a sidenote, for some reason it makes me extra sad when I find out a woman has killed herself.\n\nAs a man I am not born to live, I am born to die. Wether it is in conflict, war, suicide or some foolish accident, I have no value as a man and it is very easy for anyone from an employeer or a woman to replace me.\n\nBut as a woman, thats whole different ballgame, you are very important for society, you keep families together, you nuture your sorroundings, you make things look better by plants, colors, make up. Its just a different level of heartbreak when a woman kills herself, so pointless.",
      "created_utc": 1745150440.0,
      "score": 0
    },
    {
      "id": "mmxbpg7",
      "body": "OP: “Oh man I hope my friend is alright but waitttt I have to post this on the internet for fake points aaaaalso can’t forget to respond to replies either teehee”",
      "created_utc": 1744564703.0,
      "score": -2
    },
    {
      "id": "mmv6l81",
      "body": "So you joined Reddit to make a post about it.",
      "created_utc": 1744532470.0,
      "score": -38
    },
    {
      "id": "mmvbde0",
      "body": "This unfortunately is not a prank I made this acc specifically to ask this cos i acc don't know what to do, calling the authorities seems like my best option right now",
      "created_utc": 1744535607.0,
      "score": 191
    },
    {
      "id": "mmv5y2s",
      "body": "Yeah I think this is the best option",
      "created_utc": 1744532058.0,
      "score": 19
    },
    {
      "id": "mmvhph7",
      "body": "What an insensitive thing to say",
      "created_utc": 1744539716.0,
      "score": -30
    },
    {
      "id": "mmvhysi",
      "body": "Yeah I write them too without intentions. But I don't know about her background. Maybe she is very suicidal and then it could indeed be written as a goodbye note.",
      "created_utc": 1744539875.0,
      "score": 8
    },
    {
      "id": "mmvbfvz",
      "body": "She's nrs to my calls or texts I just really hope she just sleeping",
      "created_utc": 1744535653.0,
      "score": 29
    },
    {
      "id": "mmvbglc",
      "body": "Thank youv",
      "created_utc": 1744535667.0,
      "score": 5
    },
    {
      "id": "mmywj7h",
      "body": "I've pit an update up on the post. she is okay(thank god)",
      "created_utc": 1744583013.0,
      "score": 5
    },
    {
      "id": "mn12g9z",
      "body": "I've put on an update",
      "created_utc": 1744618486.0,
      "score": 3
    },
    {
      "id": "mnuh0ia",
      "body": "They Updated!",
      "created_utc": 1745020158.0,
      "score": 2
    },
    {
      "id": "mmv8osw",
      "body": "You call the police on a mentally ill person when you want them to suffer more, not help them.  Come on now.  Try to contact people who actually give a shit about her before jumping to such a huge extreme.  The police have a terrible history with mental health calls.",
      "created_utc": 1744533842.0,
      "score": -27
    },
    {
      "id": "mmwclb9",
      "body": "Thankfully I was just overreacting. She's said she wanted to khs before this and I had a similar thing happen in January and didn't realise until the person was in hospital",
      "created_utc": 1744553641.0,
      "score": 4
    },
    {
      "id": "mn1252j",
      "body": "I will",
      "created_utc": 1744618286.0,
      "score": 2
    },
    {
      "id": "mmvbl0v",
      "body": "I really bloody hope they just fell asleep",
      "created_utc": 1744535750.0,
      "score": 1
    },
    {
      "id": "mmwcaq3",
      "body": "Yeah thankfully I was just overreacting cos she's expressed desire to khs before and smth like this happend to me in January and I didn't realise until the person was in hospital",
      "created_utc": 1744553541.0,
      "score": 3
    },
    {
      "id": "mmxac6j",
      "body": "Thanks that means alot to me, even if it's from some random person on reddit",
      "created_utc": 1744564287.0,
      "score": 1
    },
    {
      "id": "mmxjcbl",
      "body": "Thank u it means alot ❤️",
      "created_utc": 1744567026.0,
      "score": 1
    },
    {
      "id": "mnds1fj",
      "body": "I can't call anyone I'm in France right now and calls to the UK cos like a quid a minute and I have no money",
      "created_utc": 1744796922.0,
      "score": 1
    },
    {
      "id": "mmxeng9",
      "body": "Bro I was trying to get advice and it's polite to respond to people trying to help",
      "created_utc": 1744565591.0,
      "score": 3
    },
    {
      "id": "mmv6oyd",
      "body": "Given this is a bizarre thing to ask about on Reddit, it is a place for questions of all kinds. They’re probably afraid and are unsure what to do.",
      "created_utc": 1744532535.0,
      "score": 23
    },
    {
      "id": "mmvd03z",
      "body": "Read through the comments, they're in a different country to their friend and don't know their friend's address, I'm assuming maybe an online friend... if you don't have an address to send emergency services to and can't physically get there yourself then it's a bit difficult to know what to do",
      "created_utc": 1744536688.0,
      "score": 11
    },
    {
      "id": "mmvhqyd",
      "body": "And?",
      "created_utc": 1744539741.0,
      "score": 0
    },
    {
      "id": "mmvbo93",
      "body": "Do it ASAP.",
      "created_utc": 1744535810.0,
      "score": 42
    },
    {
      "id": "mmvi67t",
      "body": "What do you mean insensitive",
      "created_utc": 1744540005.0,
      "score": 16
    },
    {
      "id": "mmvi8qp",
      "body": "I was thinking about that and I’m really sorry if that’s the case, I was just trying to provide some form of reassurance. I don’t know this person, and I can only pull from my experiences which may or may not be helpful.",
      "created_utc": 1744540049.0,
      "score": 6
    },
    {
      "id": "mmwajx4",
      "body": "Yeah they were right it's just the last sentence that scared me alot cos take care is what she says when she says goodbye",
      "created_utc": 1744552937.0,
      "score": 2
    },
    {
      "id": "mmvbslq",
      "body": "I trust you but I really do think you need to check on them in person. If you know where they live knock on their door, if they don’t respond, call their family and the police. Wellness checks are so important, please don’t think that there isn’t people who can help.",
      "created_utc": 1744535888.0,
      "score": 23
    },
    {
      "id": "mmzrxhy",
      "body": "Thank you for the update! I hope you’re fine aswell!",
      "created_utc": 1744594745.0,
      "score": 2
    },
    {
      "id": "mniuh4g",
      "body": "I know that that's one of the most tariffing situations to be in, and I'm so glad she's ok",
      "created_utc": 1744858767.0,
      "score": 1
    },
    {
      "id": "mn1453z",
      "body": "I’m glad she’s okay and you’re okay ❤️",
      "created_utc": 1744619587.0,
      "score": 2
    },
    {
      "id": "mnul01i",
      "body": "Thank you for telling me!!",
      "created_utc": 1745021631.0,
      "score": 1
    },
    {
      "id": "mmvi2c1",
      "body": "as someone who has dealt with severe mental illness, in a situation where someone possibly killed themselves/attempted, you need to call 911 if possible. an ambulance will arrive first, and police will deal with the family after. \n\nwhile I agree police do have awful history with mental health calls , this is an exception, and again the EMTs will be the first on scene. 911 is NOT just cops , and this does not warrant cops on the scene",
      "created_utc": 1744539937.0,
      "score": 3
    },
    {
      "id": "mmvctrw",
      "body": "No, you call the police when someone may need protecting from themselves, as they are the only ones with power to section people who are unable to think straight at that moment.",
      "created_utc": 1744536574.0,
      "score": 9
    },
    {
      "id": "mmvgv4d",
      "body": "Who should be called in an emergency?",
      "created_utc": 1744539185.0,
      "score": 1
    },
    {
      "id": "mmw52s9",
      "body": "[removed]",
      "created_utc": 1744551019.0,
      "score": 0
    },
    {
      "id": "mmx9ojy",
      "body": "No, they don’t, not all police are the same. If you think someone’s killed themselves you call the police, if you’re even worried about them you can call the police. Police aren’t as terrible as the media makes them out to be.",
      "created_utc": 1744564088.0,
      "score": 0
    },
    {
      "id": "mmwde7f",
      "body": "With my friend I was phoning the police constantly. At times, she’d also be phoning them on me. Better to be safe than sorry.",
      "created_utc": 1744553911.0,
      "score": 1
    },
    {
      "id": "mmvhohq",
      "body": "any updates??",
      "created_utc": 1744539698.0,
      "score": 5
    },
    {
      "id": "mmwcn04",
      "body": "I’m glad she didn’t do it. But definitely don’t let this slip! As her friend, I’d suggest finding support for her. Maybe professional support",
      "created_utc": 1744553658.0,
      "score": 1
    },
    {
      "id": "mmvbmi5",
      "body": "I am thx for understanding",
      "created_utc": 1744535777.0,
      "score": 11
    },
    {
      "id": "mmvi7fe",
      "body": "“I hope this is a prank”",
      "created_utc": 1744540026.0,
      "score": -22
    },
    {
      "id": "mmviudq",
      "body": "You're fine! You're right, I also write these kind of appreciation notes all the time for friends just because I have to vent my love lmao. \nAnd you gave good advice! I was just trying to show the other side.",
      "created_utc": 1744540421.0,
      "score": 6
    },
    {
      "id": "mmvc0r7",
      "body": "I'm gonna try call her mother but I can't call the police cos 1 I don't know where she lives and 2 I'm in France right now",
      "created_utc": 1744536037.0,
      "score": 21
    },
    {
      "id": "mn1n2yd",
      "body": "Thank you I apriciate it ❤️",
      "created_utc": 1744630567.0,
      "score": 2
    },
    {
      "id": "mmvk1ty",
      "body": "EMTs only enter the scene once the police have made sure it's safe.  The police enter first, then the EMTs.  In my case, the EMTs didn't show up at all.  Just the cops.  \n\nAnd while I agree that there are exceptions to where sometimes the police should be called as a last resort, OP getting a message from a friend thanking them for being in their life isn't extreme enough.  OP needs to get in contact with whoever the friend lives with, or family, or even check on the friend themselves, before getting the cops involved. \n\nIf you read on in this thread, you'll see I also have dealt with severe mental illness, and I'm only speaking up here because I want to prevent other people from making the same mistakes my loved ones made when they were trying to help me.  \n\nI can't stress enough how much horrific damage my experience caused me.  It happened in 2013, and despite actively putting in the work to heal by doing lots of therapy, I'm still struggling over it more than a decade later.  I want to get better so bad but it's starting to feel like I'll be broken from it for the rest of my life.  \n\nIf I can try to help save someone else from going through that, I'm gonna speak up.  I have to.",
      "created_utc": 1744541162.0,
      "score": 1
    },
    {
      "id": "mmvdkh7",
      "body": "[deleted]",
      "created_utc": 1744537061.0,
      "score": 1
    },
    {
      "id": "mmvhpy3",
      "body": "Try to contact people who actually give a shit about her before jumping to such a huge extreme.  Does she live with roommates?  What about contacting her family?  If she lives alone, one could also try checking on her themselves, or asking a mutual friend who lives closer.  There are much better options to try before getting trigger happy strangers with no mental health training involved.  Cops should be a last resort only.",
      "created_utc": 1744539724.0,
      "score": 0
    },
    {
      "id": "mmw6wy0",
      "body": "Oh look, another \"professional\" that promotes locking people up in order to save them.  Because having your freedoms striped away over a text is so good for mental health!  You've not experienced the abuse I have at the hands of \"mental health professionals\" and aggressive cops.  You have no right to tell me I'm wrong.",
      "created_utc": 1744551687.0,
      "score": 2
    },
    {
      "id": "mmxmuoi",
      "body": "It doesn't matter if all cops are the same or not.\n\nWhat does matter is that they have qualified immunity, zero mental health training, very little training in general, and get paid vacation when they do things that would get regular civilians locked away.  \n\nThey're worse than the media make them out to be. So many cases of police brutality and misconduct never even make it to the headlines.  My story sure didn't.  \n\nCopaganda is so prevalent it's crazy.  It's so prevalent than even when I (and others like me) desperately try to warn people about what happens when you sic them on people in a mental health crisis, I'm still told I'm wrong, to be quiet, that this is how it's supposed to be, not all cops, and that things aren't as bad as the victims say it is.  \n\nIts so prevalent that despite having a countless supply of bodycam footage showing examples of them harming or even killing mentally ill people on welfare checks, mental health forums still recommend calling them at the first sign of distress, before even trying with the family or other loved ones first.  \n\nI really don't want to hear this \"not all cops\" shit in response to me opening up about bad cops.  Jfc.",
      "created_utc": 1744568110.0,
      "score": 1
    },
    {
      "id": "mmxt96t",
      "body": "Yeah I've added one",
      "created_utc": 1744570141.0,
      "score": 1
    },
    {
      "id": "mmwcufc",
      "body": "Yeah, I'm pretty sure she does therapy already but ima try talk to her about how she's doing a little more",
      "created_utc": 1744553728.0,
      "score": 2
    },
    {
      "id": "mmvie5b",
      "body": "I mean the account is 12 hours old so you never know whether it’s legit or not. But we always gotta assume the best as we should",
      "created_utc": 1744540143.0,
      "score": 17
    },
    {
      "id": "mmvdtls",
      "body": "I'm also speaking from experience, a professional standpoint as I've worked in supported living for mentally ill people for years. This is literally what you're supposed to do. I'm sorry that your experience was negative, but that doesn't mean it's the norm. Most mentally ill people aren't wielding weapons or threatening to do so when in crisis which makes a difference, I suppose.",
      "created_utc": 1744537230.0,
      "score": 1
    },
    {
      "id": "mmw5av2",
      "body": "Stop giving mental health advice to people when you clearly do not understand how it works. You are putting other people in danger because of your own feelings. now stop",
      "created_utc": 1744551106.0,
      "score": 0
    },
    {
      "id": "mmxadto",
      "body": "I’m not going to say you’re wrong, yeah calling a loved one could be a good idea, but what if they’re already hurt. Most of the time a loved one isn’t going to be able to do anything immediately like a EMT can. And I’m sorry you had a bad experience with the police and in a mental health facility, I’ve been in a mental hospital too, yeah it’s scary, of course it is, but all they did was try to help me.",
      "created_utc": 1744564300.0,
      "score": 1
    },
    {
      "id": "mmxnu1k",
      "body": "[removed]",
      "created_utc": 1744568422.0,
      "score": 0
    },
    {
      "id": "mmvifpc",
      "body": "The best being that it’s not a prank",
      "created_utc": 1744540169.0,
      "score": -18
    },
    {
      "id": "mmvevsx",
      "body": "I think it's really nasty that you work for this system and then go on to lecture me, a victim of it, on how it's \"supposed to work.\"  You are *not* speaking from the same experience I am.\n\nI am speaking from the experience of a person who actually was on the receiving end of this abuse.  I had no weapons on me.  I committed no crimes.  I didn't want to go with them.  I didn't get a choice.  I was locked up in an abusive mental health facility that has caused me extreme PTSD ever since.  I was striped of my rights and treated like an animal.  You don't know what it's like to be made aware of just how weak and powerless you are in a system that doesn't give a fuck about you.\n\nGo ahead and tell me my experiences aren't he norm.  Go ahead and tell me that I'm wrong and you're supposed to keep things the way they are.\n\nI'll keep telling my story anyway.\n\nDon't call the cops on people you love unless if you have absolutely no other options, and you're stuck between giving them lifelong trauma or them dying/hurting someone.\n\nThis scenario by OP?  Not cop worthy.  Contact people who actually care about the friend.  The people doing a job do not care and will only tell you you're wrong when you speak up on the atrocities they commit against you.\n\nEdit: I didn't mean to delete my previous response, I was trying to edit it.",
      "created_utc": 1744537919.0,
      "score": 2
    },
    {
      "id": "mmxp0re",
      "body": "I'm opening up to you about how I've personally been mistreated and you're using laughing emojis at me?  Telling me that the same shit doesn't happen in 2025?  That's honestly vile.  I don't know why I even try.  Holy shit.  Whatever.  Fuck it.  I don't care. I'm done. Fuck all of this.",
      "created_utc": 1744568798.0,
      "score": 1
    },
    {
      "id": "mmvj49m",
      "body": "\"The best being that it’s not a prank\"\n\nI'm going to make another leap of faith assumption that you did not understand the post correctly or had a bout of dyslexia: If it's NOT a prank, like OP asserted, then we are dealing with someone who may have actually killed herself.\n\nI do hope you are not one of the people who come here to actively prey on vulnerable people, hidden behind the anonymity of your keyboard.",
      "created_utc": 1744540591.0,
      "score": 15
    },
    {
      "id": "mmw787p",
      "body": "> Don't call cops on people you love unless you have no other option, and you're stuck between giving them lifelong trauma or them dying/hurting someone.\n\nThat. Is. The. Point. Lmfao 😂 You call the police when they're a risk to themselves. That's what I bloody said in the first place. You say OPs issue isn't cop-worthy but that's the exact issue. If her friend isn't dead, she may well be in five minutes without police attendance. I'm sure your experience with them sucked, but I can't help but notice you're still here.\n\nI was going to apologise again for your shitty experience and continue speaking in a nice/neutral tone, but you're one of those people who doesn't deserve it. It's _great_ to hear that you totally didn't mean to delete your first comment where you basically called me ignorant because you assumed I have no knowledge and experience of this subject.\n\nYou think it's nasty that I promote this, I think it's nasty that if someone you claim to love was telling you they're about to down a bottle of pills you wouldn't call the people who can get there the fastest and guarantee physically preventing such action. I'll leave it there.",
      "created_utc": 1744551796.0,
      "score": 1
    },
    {
      "id": "mmvhvjn",
      "body": "[removed]",
      "created_utc": 1744539819.0,
      "score": 0
    },
    {
      "id": "mmvj6rz",
      "body": "Oh my god, I would never 😅 I did misspell that, my bad!",
      "created_utc": 1744540635.0,
      "score": 16
    },
    {
      "id": "mmviq9f",
      "body": "Yet another \"professional\" talking over my lived experiences when I try to help save others from making the same mistakes I suffered.\n\nMy experience doesn't need to be everyone's.  The fact that it happens at all is enough.\n\nYou're wrong about it not being the norm.  I am far from the only person to have this happen to them.  And I am far from having experienced the worst of it.   In fact, it's so normal, stories like mine aren't even news worthy.\n\nAgain, it's real nasty for a person who works in this field to tell people who have suffered on the receiving end of it that our experiences aren't common enough to be worthy of consideration.\n\nGive me a downvote and tell yourself what you have to in order to be able to sleep at night, I guess.",
      "created_utc": 1744540352.0,
      "score": 0
    },
    {
      "id": "mmvj8em",
      "body": "I don’t have dyslexia, English isn’t my first language. I’m also not anonymous",
      "created_utc": 1744540662.0,
      "score": 12
    },
    {
      "id": "mmvpywv",
      "body": "How do you know that I haven't been on the receiving end though? Making a lot of assumptions. Yes, it is normal to call police for a welfare check, no it isn't the norm for police to then treat that person horribly. Again, sorry for your experience, but you're telling OP to not call in a welfare check on a friend they believe may have committed suicide? Who the hell are you helping?",
      "created_utc": 1744544421.0,
      "score": 1
    },
    {
      "id": "mmvjipg",
      "body": "Well you’re still giving him shit for no reason, if you ask me. That’s not a good thing to be doing here, ESPECIALLY when that person is in panic mode like he is right now",
      "created_utc": 1744540840.0,
      "score": 10
    }
  ]
}