{
  "id": "1iql0xw",
  "title": "I now understand why so many women hate men...",
  "selftext": "So basically I made a post about me being sexually abused from a young age and needing someone to tell my life story to.  I'm a male and I've gotten loads of dms from creepy dudes trying to get off by hearing  about my sexual abuse history because they thought i was a woman.  Like what the actual fuck.  I'm so sorry it's like this for women.  I literally just want to TALK to someone and it be an adult conversation. ",
  "created_utc": 1739683067.0,
  "score": 1227,
  "num_comments": 100,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1iql0xw/i_now_understand_why_so_many_women_hate_men/",
  "comments": [
    {
      "id": "md10ypa",
      "body": "**Hello u/!** \n\nThank you for tagging this post with a content warning! This helps greatly!\nIt can prevent other users from potentially getting triggered and it gives us the chance to provide you with some resources regarding this topic.\nGood to know is that using this flair automatically marks your post as NSFW.\n\n*Your post may not show up directly on our subreddit, please be patient, it is most likely in queue to be manually reviewed by our team.*\n\n\n---\n**Here are some resources:**\n\n* Rainn.org provides information on [the types of sexual violence](https://rainn.org/types-sexual-violence), [what to do after](https://rainn.org/after-sexual-assault) and the [effects](https://rainn.org/effects-sexual-violence) it can have.\n* Here are some helpguides if you are [recovering from sexual trauma](https://www.helpguide.org/articles/ptsd-trauma/recovering-from-rape-and-sexual-trauma.htm), this one is available in [multiple languages](https://survivorsnetwork.org.uk/resource/survivors-self-help-guide/).\n* If you want to talk to a professional, on [this website](https://findahelpline.com/i/iasp) you can find helplines for your country.\n* Some other good subreddits that check out are: r/rape and r/sexualassault. These are safe communities with good resources listed. \n* We also want to provide you with some information on how to [support survivors](http://www.tstresources.org/supporting-survivors/), in case you are looking for help for a [loved one](https://www.rainn.org/TALK).\n\n      \n---\n\n        \n**Take care and stay safe!**  \n\n*If you see any inappropriate comments, please report them and we will deal with them accordingly.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1739683068.0,
      "score": 1
    },
    {
      "id": "md12tdm",
      "body": "i don’t recommend any online spaces for venting on such things. this sub may sound great for this, but i’m sure half the people on here are just dudes or girls with morbid curiosity or worse, perverse thoughts about the victims here. it’ll always be a risk to get in contact with someone you really don’t want to be in contact with.\n\ni’m not even going argue about the whole “all men are bastards” debate, this isn’t the place or time. sending virtual hugs 🫂 hope you recover, i know what it feels like to be abused this way as a child.",
      "created_utc": 1739683950.0,
      "score": 409
    },
    {
      "id": "md13per",
      "body": "I once shared an account with a woman where we would post Q&A stuff. There's a HUGE difference between the way people experience the internet purely just because of whether they're perceived to be male or female. Men spend a lot of time hoping for a few messages, women spend a lot of time sorting through fucked up messages.",
      "created_utc": 1739684390.0,
      "score": 79
    },
    {
      "id": "md12dhc",
      "body": "(Me, F, old lady but been there). I'm so sorry to hear that you went through SA when you were a child. It's ROUGH for both males and females, and I imagine there's a different stigma for males. Please ignore the a\\*\\*holes. They are not worth your time or effort.\n\nGo over to r/askwomenadvice and type \"rape\" or similar in that sub's search box. The first comment that will come up (pinned) on any post will be a list of resources for survivors of rape and SA. Please contact them - any or all. Do NOT feel like you \"shouldn't\" or whatever because you are a guy. You are a human who deserves support. Some of those also should have contacts for online support groups that often are peer-led, where you can tell your story and BE HEARD.\n\nIf there's anything else I can do to help you find these resources, please let me know. You matter.\n\nAnd yes, some guys are sick fucks. Most are not, thank God.\n\nEdit: clarity.",
      "created_utc": 1739683737.0,
      "score": 28
    },
    {
      "id": "md14et7",
      "body": "Honestly, I'm largely ashamed of my own gender. The vast majority of men I've interacted with in my life have been disgusting humans when it comes to women.",
      "created_utc": 1739684741.0,
      "score": 194
    },
    {
      "id": "md2d4bx",
      "body": "Yep, the covert incest subreddit is filled with pedophiles trying to get off on peoples’s stories and reach out to them. It’s a sick sad world we live in.\n\nI posted about some sexual trauma on my Facebook that was done by an ex that I went to highschool with. Another guy I went to highschool with DM’d me to be like “oh my god, I’m so sorry you went through all of that, I had no idea, if you don’t mind me asking, what did so and so do?” And I explained a small portion of the abuse, and his response was, “oh my god, that’s so hot!! I had no idea you were a freak!! I know you have a boyfriend, and I hope it works out for you, but if not, PLEASE, you have to let me take you on a date!!” \n\nI blocked him and never talked to him again. He has also been arrested for rape, and the articles stated that HIS friends heard the girl screaming for him to stop and called the police. \n\nThis world is so fucked and rotted. \n\nI’m sorry that you were sexually abused, and I’m sorry people harassed you further for opening up about it.",
      "created_utc": 1739710535.0,
      "score": 17
    },
    {
      "id": "md1tlel",
      "body": "Guys, remember that we (men) are the difference makers in this situation. We all need to provide an example of positive masculinity for all other men and, especially, boys out there. They need to see that being a man should mean something other than being a selfish asshole. They need to see that it is truly more rewarding to be a man who respects the agency of all other people equally, who recognizes the historical and contemporary oppression of women in society, who represents true strength, which is the strength of your character. \n\nBeing good and being strong are synonymous in this context, imo. Misogynistic people don't address their own shortcomings, instead blaming femininity, or else the collective of all women outright. They are weak and stupid because they have been dominated internally by their own insecurities and gender dysphoria. They are *jealous* of women, in a way. Part of them deep inside envies the level of attention and objectification women are subject to. And here is the dark truth at the heart of it all: the social construct known as gender is what puts men and women (and enbies) in a position to hate one another because it is literally a divisive category. Women are not essentially different from men. We can point to primary and secondary sex characteristics, of course, but these things don't determine your character and choices. \n\nAbolish gender! Reject society's baseless, needless, pointless expectations of your posture and behavior in society, because that is not freedom, it's slavery.",
      "created_utc": 1739699324.0,
      "score": 78
    },
    {
      "id": "md14aac",
      "body": "That’s predatory, creepy and gross. Look into joining individual and or group therapy to help you process those complex emotions, you will have a much better experience than trying to share on the internet. Unfortunately, there are too many trolls and sick people that get to hide behind their keyboards for a true safe space to exist on an open forum internet.",
      "created_utc": 1739684677.0,
      "score": 45
    },
    {
      "id": "md1dtpf",
      "body": "Yeah, I got one recently cos I posted that I was lonely. Loneliness is not alone. It also doesn’t mean  hey- come hither and send 🍆 pics 🤬 unsolicited either. Thats just further abuse and adds to the trauma.\n(Edit- I love men btw)",
      "created_utc": 1739689809.0,
      "score": 33
    },
    {
      "id": "md2amar",
      "body": "Now you gotta see how many people are about to justify this behavior. Sorry dude.",
      "created_utc": 1739709325.0,
      "score": 6
    },
    {
      "id": "md6sacz",
      "body": "People like that genuinely need to be castrated, it’s gut wrenching people like that exist, i shouldnt even refer to them as people ngl",
      "created_utc": 1739761911.0,
      "score": 6
    },
    {
      "id": "md179vh",
      "body": "There are a lot of really sick people out there. Below are some resources that might be helpful.\n\n/r/MenGetRapedToo  is a very supportive sub for male survivors of sexual abuse\n\n\nhttps://1in6.org/ - A supportive site for male survivors\n\nIf you are in the US you can text 741741 for help - it is the crisis text line\n\nYou can also call or text 988 - this is the suicide and crisis text number in the US.\n\nBoth crisis numbers are very similar, the main difference is you can call 988 but only text 741741. \n\nI hope that you find the peace and recovery that you deserve.",
      "created_utc": 1739686205.0,
      "score": 18
    },
    {
      "id": "md1k9pw",
      "body": "Sorry to all the girls who have suffered due to men.",
      "created_utc": 1739693611.0,
      "score": 20
    },
    {
      "id": "md2kfd3",
      "body": "I’m so sorry that awful.💔 sometimes I also want to vent on Reddit too, but i usually end up not doing it, or if I do the post is immediately deleted after because while there are some good ppl on here, a lot of ppl on here are weirdos unfortunately.\n\nAgain I’m sorry that ppl were being creepy towards you when you were just trying to vent that’s so messed up.",
      "created_utc": 1739713689.0,
      "score": 5
    },
    {
      "id": "md15mfb",
      "body": "Ugh, I'm so sorry. People online are sick.",
      "created_utc": 1739685350.0,
      "score": 11
    },
    {
      "id": "md606mn",
      "body": "I’ve made a couple of posts related to my disability and I kept being messaged by people, some were blunt and some would wait to ask really disgusting questions I learned people have fetuses for women in wheelchair and it’s the power and control they have is what they love, it’s really weird knowing that now. ",
      "created_utc": 1739752010.0,
      "score": 5
    },
    {
      "id": "md21cf1",
      "body": "That's horrid, it's gross how people go for vulnerable people. Sadly I can't  control the behavior of other men as much as anyone else can. There are kind and emotionally mature men out there, dozens perhaps even. But I yes, I wish the world was better than it was.",
      "created_utc": 1739704085.0,
      "score": 3
    },
    {
      "id": "md53cgz",
      "body": "I'm sorry you had that experience,  and I'm glad you started to open up regardless. Men need to feel safe and heard too. Helps keep em from becoming another reprrssed pervert reaching out with false sympathy.\n\nI hope that you're doing okay. You're not alone in this and many people here want to help you. We apologize for the unfortunate idiots who think our trauma is their spank bank.",
      "created_utc": 1739741433.0,
      "score": 3
    },
    {
      "id": "md63wg5",
      "body": "Reddit is not the best place to share your trauma, even in a sub like mental health, I'm sorry this has happened to you, you should really find a therapist that way everything you need to talk about is confidential it would save you from creeps..",
      "created_utc": 1739753255.0,
      "score": 3
    },
    {
      "id": "md7g8xj",
      "body": "Yeah every time I talk to a woman about am experience with a man before it just makes me so upset and confused. Like why made these guys normalize that behavior. I wouldn't have even ever dreamed of doing or saying some of the things I've heard guys do.",
      "created_utc": 1739772132.0,
      "score": 3
    },
    {
      "id": "md1s3ep",
      "body": "Damn\nA little look into and reminder of what it's like. I'm someone that believes it's important to listen to and believe victims, but it's hard to remember how men can be sometimes",
      "created_utc": 1739698398.0,
      "score": 2
    },
    {
      "id": "md4m578",
      "body": "I've had the same on reddit, spoke about being groomed as a child. 4 people began messaging me for 'support'. 3 of those people began to ask me if I liked it, a 40 year old man attempting to rape a 15 year old. It really does make you feel disgusting.\n\nI'm sorry you experienced it, and I'm sorry for your own trauma. It's not all men, and it's men like you which make women remember that. Stay strong",
      "created_utc": 1739736267.0,
      "score": 2
    },
    {
      "id": "md1bjhb",
      "body": "i get what you mean like its disgusting with how many weird people there i,m sorry you had to go through that",
      "created_utc": 1739688529.0,
      "score": 3
    },
    {
      "id": "md17pv0",
      "body": "Well I feel better about myself right now because the thought never crossed my mind to message a woman to sexually arouse myself from their abuse. I normally don’t kink shame but in this case I’ll make an exception .",
      "created_utc": 1739686438.0,
      "score": 5
    },
    {
      "id": "md6bbin",
      "body": "Fuck men",
      "created_utc": 1739755834.0,
      "score": 2
    },
    {
      "id": "md1omox",
      "body": "I’m sorry dude that sucks",
      "created_utc": 1739696266.0,
      "score": 1
    },
    {
      "id": "md22ytd",
      "body": "That is a really really horrible thing to experience...",
      "created_utc": 1739705064.0,
      "score": 1
    },
    {
      "id": "md3lj0t",
      "body": "I'm sorry you had to experience both of these things. \n:/",
      "created_utc": 1739725752.0,
      "score": 1
    },
    {
      "id": "md5vqim",
      "body": "It sucks im sorry :( . People are creeps, definitely be careful about what you post online",
      "created_utc": 1739750547.0,
      "score": 1
    },
    {
      "id": "md60zpq",
      "body": "Aw hell no! What the fuck is wrong with people? Why have people never been decent?",
      "created_utc": 1739752277.0,
      "score": 1
    },
    {
      "id": "md68izl",
      "body": "As I was driving home today I saw a guy driving a truck that said “dads against daughters dating” and it made me think how sad I am that men don’t want their daughters dating other men because they know they can treat us terribly, but often those same men will treat other women like garbage. It really is frustrating dealing with men who don’t understand how misogynistic and hateful many men are towards us, so while I’m sorry you had this experience I hope it takes you forward into your relationship with women and how you relate to other men with different perspective and actions.",
      "created_utc": 1739754856.0,
      "score": 1
    },
    {
      "id": "md7i6jq",
      "body": "I'm so sorry OP that you had to go through that. I hope it gets better for you. All I can say is there are genuine humans who are still there to listen and just be there. \n\nThat being said it does suck ass that it gets this creepy for women",
      "created_utc": 1739773120.0,
      "score": 1
    },
    {
      "id": "md81c2v",
      "body": "Although it might be true what most of the replies are saying about venting online, I also think it's a shame that we collectively give up on helping people online. \n\nThis place was meant to be a place where people can seek support or help and I don't wanna give up on that.\n\nIf you need someone to talk to I'm ready to listen - or whatever you need.\n\nI know that it might now have become much more difficult to reach out to people online, and right now I'm not sure how to counter these malicious outreach and DMs. I just hope that it won't fully destroy the good we have in this community.",
      "created_utc": 1739784329.0,
      "score": 1
    },
    {
      "id": "md9m7wi",
      "body": "Brother you’re on gay Reddit mod breeding grounds asking for profound advice, don’t besmirch me to glaze others lol.\n\nAs a man, you need to do the serious effort of Therapy and internal adjustments to move past this.\n\nShame on you for expecting creeps not to be creeps",
      "created_utc": 1739808687.0,
      "score": 1
    },
    {
      "id": "me0edz0",
      "body": "Just a taster. ",
      "created_utc": 1740155052.0,
      "score": 1
    },
    {
      "id": "me7efr7",
      "body": "I’m so sorry this happened to you. Kudos to you for reaching out for help and showing empathy to others.",
      "created_utc": 1740248651.0,
      "score": 1
    },
    {
      "id": "meu3o97",
      "body": "try using this. It has an area where you can track your moods and write daily information.\n\n\n\n[https://calmvibeprints.etsy.com/listing/1880136243/self-care-planner-for-burnout-printable](https://calmvibeprints.etsy.com/listing/1880136243/self-care-planner-for-burnout-printable)",
      "created_utc": 1740545659.0,
      "score": 1
    },
    {
      "id": "mf3g4k1",
      "body": "I’m so sorry this happened to you",
      "created_utc": 1740674737.0,
      "score": 1
    },
    {
      "id": "md8h87y",
      "body": "It depends on the person.  Not all men are scum and some women are scum.  A girlfriend I had did some cocaine with her male cousin and he ended up repeatedly raping her while she kept screaming for him to stop. I took her to the grand jury hearing.  Charges were filed against him and her sister said she should drop the charges because he was family.  How sick is this from a sister?  The cousin offered her some money but she did not take it because she said she would feel like a whore if she did.  She dropped the charges since the DA said she would have a tarnished reputation for doing drugs with the cousin before the jury.  Of course how could she guess it was unsafe to do coke with her cousin?",
      "created_utc": 1739793698.0,
      "score": 1
    },
    {
      "id": "md1qnxq",
      "body": "🫂 I’m sorry, I hope you’re feeling better now at least",
      "created_utc": 1739697527.0,
      "score": 1
    },
    {
      "id": "md2z5yq",
      "body": "Hey love - I’d mean so much to me if you reached out! \nI’ve gone through the same & I’d love to be able to give you a safe space to talk about it. \nAlso, I’ve had read it for a while, but I just posted for the first time so it’d be nice to be able to message someone who’s gone through similar things. ♡",
      "created_utc": 1739719011.0,
      "score": 1
    },
    {
      "id": "mdu7tbx",
      "body": "It's understandable, but not excusable. They need to get help and learn that that's wrong if they hate men. It's getting ridiculous how hateful society is toward men. It's not making women's lives better either. It's just petty aimless toxic behavior that is constantly denied and covered up because of enabling. Society should work to make women's lives better, not make men's worse. Acknowledge, then turn those negative emotions into motivation to bring good into the world.",
      "created_utc": 1740073838.0,
      "score": 1
    },
    {
      "id": "md3zmbb",
      "body": "Hey, men aren’t the problem. If they were you would also suck. Glad you can’t relate to being a total creep and I’m so fucking sorry. It really sucks just..trying to heal and people come around trying to exploit your healing process for their gratification. Been there, I get it. I was also abused at a young age and I was also sexually abused in my adult life. You’re absolutely welcome to message me if you need someone to talk to who will just listen (and possibly relate occasionally).",
      "created_utc": 1739729807.0,
      "score": 0
    },
    {
      "id": "md1zbxv",
      "body": "[deleted]",
      "created_utc": 1739702873.0,
      "score": 0
    },
    {
      "id": "md1eews",
      "body": "At the same time though this is the internet and you are on Reddit. Just try to avoid posting on here all together. On my other account I got a lot of extremely creepy men and women messaging due to stuff I posted.",
      "created_utc": 1739690148.0,
      "score": -4
    },
    {
      "id": "md5uwue",
      "body": "I think generalization is a very dumb take on anything",
      "created_utc": 1739750277.0,
      "score": -4
    },
    {
      "id": "md23dv3",
      "body": "going to a mental health subreddit sounds great, until you realize it's full of mentally ill people",
      "created_utc": 1739705317.0,
      "score": -10
    },
    {
      "id": "md1fo2i",
      "body": "You have to understand the demographics, most of men are NOT like this. However, online (Reddit in particular) is a different story. I mean, most of the people here don't even see the sunlight so don't be worried about them, they have issues and you shouldn't see them as majority. Still, I'm sorry this happened to you but don't let that shape your view of literally half of the world.\n\nYou can prove this to yourself, would you do something like this? Would your friends/brothers/father/any other men close to you do this? Probably not!",
      "created_utc": 1739690885.0,
      "score": -18
    },
    {
      "id": "md30byu",
      "body": "While I have met some men who are selfish and will do or say whatever they can to get sex, I've learned that many women are manipulative and untrustworthy. That's why I have 3 female friends and the rest are men. Men don't usually care to gossip or share your bullshit.",
      "created_utc": 1739719380.0,
      "score": -9
    },
    {
      "id": "md6f0v1",
      "body": "Harboring hate for an entire class of people is enough to make anyone miserable. So, for **our own** sanity we need to devise a better way to deal with shitty situations like the one you describe, or else we're doomed.\n\nI know their behavior is lousy and unacceptable. I know how much it can harm or even retraumatise an actual victim. I'm sorry. The only thing I can say is to repeat after the other commenters: you need professional help. \n\nIf you have a gunshot wound to the chest, do you go to the guy next door or do you go to the ER?",
      "created_utc": 1739757143.0,
      "score": -4
    },
    {
      "id": "md1epk6",
      "body": "Im in a more serious issue than u , everything I do is power off my phone close the door , stay alone while relaxing myself and thinking what should I really do , I no need to burn my time and days anymore ,",
      "created_utc": 1739690320.0,
      "score": -5
    },
    {
      "id": "md3y3b4",
      "body": "[deleted]",
      "created_utc": 1739729374.0,
      "score": -7
    },
    {
      "id": "md14i7e",
      "body": "Literally an example of the good this sub had to offer. \n\nThe ability to not feel alone in our trauma can do so much.",
      "created_utc": 1739684787.0,
      "score": 77
    },
    {
      "id": "md13g7i",
      "body": "Thanks! I hope you're doing well.",
      "created_utc": 1739684263.0,
      "score": 24
    },
    {
      "id": "md1xv5t",
      "body": "Yeah same. I’d be having a good time talking with a dude and then they ruin it by dropping some weird remark about someone we know/ work with. It makes me really uncomfortable :/.",
      "created_utc": 1739701963.0,
      "score": 80
    },
    {
      "id": "md45e22",
      "body": "Same, they're the scums of humanity.",
      "created_utc": 1739731433.0,
      "score": 15
    },
    {
      "id": "md2icoj",
      "body": "Yep but I'm glad to say we ain't all bad.  Just sucks when u think u know somebody and they blindside u with some morally fucked up stuff.",
      "created_utc": 1739712838.0,
      "score": 32
    },
    {
      "id": "md8ndlg",
      "body": "Yeah, seeing posts like this just makes me feel even worse about being a guy. I'm not loud, shouty, boisterous, rowdy and disgusting like a lot of them are.",
      "created_utc": 1739796638.0,
      "score": 6
    },
    {
      "id": "mdon4u8",
      "body": "Yep and it doesn’t stop there. Gay men are just as gross",
      "created_utc": 1739998772.0,
      "score": 1
    },
    {
      "id": "md26qq1",
      "body": "<3",
      "created_utc": 1739707274.0,
      "score": 16
    },
    {
      "id": "md4vsz5",
      "body": "👏🏻👏🏻👏🏻",
      "created_utc": 1739739163.0,
      "score": 5
    },
    {
      "id": "md2ki9j",
      "body": "I agree with your view on what true strength in a person is.  Up until I seen this that sentence would have ended with man.  Unfortunately those types of strong people are few and far between.  I've strived to be that type and I know I am but dang being around nothing but toxicity has almost broken me.  Anyway I've never heard this reasoning for gender abolishing before and it's the only time I mostly agree with it, thanks for that.  However gender roles in regards to physical demands and many times the ways we deal with situations are always going to exist.  The last few years of the trans movement has proven that to me on the physical side.  There's always that diamond in the rough that do it all but it's not the norm and that's fine.  I don't expect to be able to do certain things as well as the women in my life.  I'd go crazy handling the day to day of my wife.  In the same breath she wouldn't do well with my duties.  As far as the treatment of others though, that is were the differences end for me.  Right and wrong is right and wrong no matter what as a human.  I got way off topic but ur post woke me up on the gender thing. Thank you!",
      "created_utc": 1739713722.0,
      "score": 6
    },
    {
      "id": "md23vsb",
      "body": "Unfortunately it is not only online. People are being pretty sick in irl too",
      "created_utc": 1739705612.0,
      "score": 17
    },
    {
      "id": "md7l85b",
      "body": "You shouldn’t feel better about yourself that’s the bare minimum this is so upsetting to read.",
      "created_utc": 1739774740.0,
      "score": 6
    },
    {
      "id": "mdvqn39",
      "body": "Fair point",
      "created_utc": 1740088931.0,
      "score": 2
    },
    {
      "id": "md22966",
      "body": "Nobody generalising it happens way more than what it needs to do it’s safe to say men do these things if you’re offended you’re probably one of them",
      "created_utc": 1739704633.0,
      "score": 4
    },
    {
      "id": "md22csj",
      "body": "At the same time this is the internet so they’re looking for support and vent. You can’t stop them from posting just because some creeps lurking around maybe they should keep it in and stop preying on young adults",
      "created_utc": 1739704694.0,
      "score": 8
    },
    {
      "id": "md5xizm",
      "body": "\"So many\" talking about I understand the group that do hate us.",
      "created_utc": 1739751140.0,
      "score": 3
    },
    {
      "id": "md2l6qr",
      "body": "Shit that what I'm here for.  To not be alone.  Not so much advice.  Waiting till I get insurance and a therapist for that.",
      "created_utc": 1739713996.0,
      "score": 8
    },
    {
      "id": "md1g79b",
      "body": "I'm a man, read the post.  I'm just stating that I now understand why so many women hate us.",
      "created_utc": 1739691197.0,
      "score": 20
    },
    {
      "id": "md1ezdi",
      "body": "I just wanted to talk about somethings.  The world's not ending for me.  Are you okay?  Are you in am emergency situation?",
      "created_utc": 1739690481.0,
      "score": 8
    },
    {
      "id": "md4awxy",
      "body": "I don't mind talking to men about it, I'd actually prefer that. It'd be a lot more relatable. \n\n It's just sad that as soon as they realize I'm not a woman they don't want to talk to me.  It's predatory to take advantage of vulnerable people and those are the men I'm talking about.  Those are the men that messaged me, they were very much trying to talk to a woman to get off.  If you go look at their page and look at their comments it's very obvious the type of men they are. \n\nI've actually found both men and women to speak to via reddit that were very helpful. Those are not the people I'm talking about.  \n\nMaybe find a book about reading comprehension.... well you'd have to be able to comprehend it instead of making an assumption about it for it to be useful.  \n\nBest of luck with your books mate.",
      "created_utc": 1739733000.0,
      "score": 4
    },
    {
      "id": "md2i0f4",
      "body": "That speaks volumes.  I'm beginning to try to fix myself and this is the first time just talking to random people like this.  It's helping. I myself feel like I want to help some of these people irl.  Typing that last sentence made me realize that may be why my mental health is so bad tho. Ill just stick to therapy and the threads for now lol.",
      "created_utc": 1739712693.0,
      "score": 19
    },
    {
      "id": "md4w42a",
      "body": "Avoid the internet for safe venting. Therapy/counseling is the best place to try.",
      "created_utc": 1739739257.0,
      "score": 6
    },
    {
      "id": "meexlvg",
      "body": "Lol even if this is an experiment, the number of upvotes proves its point",
      "created_utc": 1740347779.0,
      "score": 1
    },
    {
      "id": "me0njz6",
      "body": "Every guy says this.  Instead of thinking you're the one exception, you should try learning about women's history.  And listening to women without making it about you or taking it personally or blaming women.",
      "created_utc": 1740157604.0,
      "score": 1
    },
    {
      "id": "md2knm9",
      "body": "For sure.  Some of the worst are technology illiterate lol",
      "created_utc": 1739713782.0,
      "score": 8
    },
    {
      "id": "mdbp1ez",
      "body": "Sometimes I feel like im another horrible person and need to be reminded im only shitty towards myself not others.",
      "created_utc": 1739829628.0,
      "score": 3
    },
    {
      "id": "md22mqt",
      "body": "[deleted]",
      "created_utc": 1739704861.0,
      "score": 1
    },
    {
      "id": "md4t4n2",
      "body": "I’m not defending the actions of creeps. But my point is that those creeps aren’t going away. Especially on places like this on Reddit. Post if u want but if u post u should be ready for creeps to interact.",
      "created_utc": 1739738357.0,
      "score": -1
    },
    {
      "id": "md24av8",
      "body": "It's good to read that you now understand us. The other problem is, that you are the minority. I wish men would see their own fault and not blame it on women, because that is usually the case. I wish I could just talk to guys normally, without being afraid of some shit happening or getting insulted or some other crazy shit comes up. Yet they complain about being lonely and that it is women's fault.\nI wish more guys would see it like you, then we could probably have a world with less criminality too.",
      "created_utc": 1739705858.0,
      "score": 11
    },
    {
      "id": "md1gii3",
      "body": "I did read and I know you are a man that's why I said would YOU do something like this, no you wouldn't. You are hurt, that's reasonable, but it's irrational to be afraid of men. You should be cautious around strangers, but not be afraid of men",
      "created_utc": 1739691382.0,
      "score": -11
    },
    {
      "id": "md1f98c",
      "body": "I'm in a very serious like , do or die situation, when I think everything I did , I get a clear clarification, that's why I recommend u to , don't depend on anything, stay alone and think what should I really do next .",
      "created_utc": 1739690641.0,
      "score": 0
    },
    {
      "id": "me5b4h5",
      "body": "We have to fix ourselves before we can help others properly",
      "created_utc": 1740222964.0,
      "score": 2
    },
    {
      "id": "meexxuj",
      "body": "> Instead of thinking you're the one exception, you should try learning about women's history. \n\nThat reads like \"Oh, just start hating yourself already! I hate you! Why don't you hate yourself?!\"\n\nWomen's history has nothing to do with how he perceives himself. Moreover, women's history has nothing to do with how you perceive yourself, even though you might think otherwise.",
      "created_utc": 1740347881.0,
      "score": 1
    },
    {
      "id": "meuh8s4",
      "body": "Wasn't talking about me specifically although I'm not in the bad category.  After having 4 daughters and a wife they'd all tell u I stand up for what's right for them and others.  Idk why my post triggered u.  My bad.  I love and respect women my mom and dad made sure of it.",
      "created_utc": 1740552154.0,
      "score": 1
    },
    {
      "id": "md233as",
      "body": "Sad you got graped but as an grape survivor myself from an family member it is no unreasonable to men graping the most and doing the most lewd things for no specific reasons but to get off n be perverts",
      "created_utc": 1739705140.0,
      "score": 6
    },
    {
      "id": "md22xdj",
      "body": "Then the “good men” know who they are and shouldn’t be worrying about a shit post that doesn’t applies. People can say women cheat. I know I don’t cheat so I wouldn’t be offended. Men Cheat,k1ll,grape and SA ,can’t keep it in their pants. \n\nThe men that doesn’t do these things they know who they are. They wouldn’t be angry because they know it doesn’t applies. If you’re sensitive about this and protective then maybe something is a bit true off your end that’s all I’m saying",
      "created_utc": 1739705040.0,
      "score": 2
    },
    {
      "id": "md2fy40",
      "body": "\"Men\" literally does not mean \"all men.\" It's grammatically ambiguous. It could mean anything from just \"two men\" all the way up to \"all men.\" The actual quantity was never specified, and the fact that you subconsciously chose one interpretation over the other kinda says something about men being allergic to criticism, even when it is directed at masculinity in general rather than any individual man. You know how I know? I'm a man, lol. Everything i say here is something that I have identified within myself and other men and continually work hard to change.",
      "created_utc": 1739711807.0,
      "score": 3
    },
    {
      "id": "meeznyb",
      "body": "> I wish men would see their own fault\n\nOwn, _collective_ fault, you mean?\n\n> I wish I could just talk to guys normally, without being afraid\n\nHave you met any women are not afraid of that happening? Perhaps older women or somebody whom you could call a female mentor?\n\n> Yet they complain about being lonely and that it is women's fault.\n\nYup, people have an awful tendency for generalization.",
      "created_utc": 1740348409.0,
      "score": 1
    },
    {
      "id": "md2ak8t",
      "body": "Yall are nuts... everyone is afraid of men. Including men",
      "created_utc": 1739709296.0,
      "score": 7
    },
    {
      "id": "md22ffn",
      "body": "It applies if you’re this angry for this",
      "created_utc": 1739704738.0,
      "score": 8
    },
    {
      "id": "mev3044",
      "body": "Real talk.  I would give good advice tho and uplifting stuff.  I just never apply anything I know to do to my own life.  Currently trying to rewire my brain to think positive and proactive.  I was starting to take my sadness and turn it to anger but that ain't good either.",
      "created_utc": 1740565138.0,
      "score": 1
    },
    {
      "id": "md249x4",
      "body": "not against this comment at all, it was a man who did it too me…",
      "created_utc": 1739705843.0,
      "score": 1
    },
    {
      "id": "md245t7",
      "body": "Good point actually, I think I may be reading these titles too broadly and may be misconstrued, if this is the logic then yes this post literally doesn’t apply to me as I’m not one of those men, but as you can imagine, reading “all men” can come off a bit broad, appreciate the clear up",
      "created_utc": 1739705775.0,
      "score": 0
    },
    {
      "id": "md2aql5",
      "body": "I have yet to meet a man who is afraid of other men...",
      "created_utc": 1739709384.0,
      "score": 0
    },
    {
      "id": "md2aeji",
      "body": "Im not being angry, im just tired of \"men bad\" and \"women bad\" generalizations. Im trying to make him (and other people who hate or are afraid of the opposite gender) get over his trauma and see the real world so he can live a normal life in peace. Just because im having an argument doesnt mean I'm angry, you are projecting.",
      "created_utc": 1739709216.0,
      "score": -6
    },
    {
      "id": "md2s8im",
      "body": "🤣🤣🤣🤣",
      "created_utc": 1739716636.0,
      "score": 4
    },
    {
      "id": "md2q3iz",
      "body": "I have met plenty of women that are, though... also because YOU haven't met any doesn't mean they aren't out there. Men typically seek validation from other men. They're not going to express that they are and if they do its behind a computer screen.",
      "created_utc": 1739715862.0,
      "score": 5
    },
    {
      "id": "md2mwze",
      "body": "Shit there's a name for those type but I'd be a bully if I said it.  I'm more afraid of women.  Bitches be scary.  Bet I get attacked by one now.",
      "created_utc": 1739714673.0,
      "score": -6
    },
    {
      "id": "md38apf",
      "body": "I never said they don't exist, I said they aren't the majority, but it can feel that way since reddit has a lot of them. I'm aware that my experience isn't universal, what I'm saying is if it was in reality how it is represented online there'd be no way i don't know a person not scared of a man.",
      "created_utc": 1739721868.0,
      "score": 2
    },
    {
      "id": "md2q5of",
      "body": "Lol men can be bitches too...",
      "created_utc": 1739715884.0,
      "score": 8
    }
  ]
}