{
  "id": "1eme3qd",
  "title": "Breast exposed by doctor ",
  "selftext": "I was having chest pain and was brought in to the ER I was wearing clothes but obviously not wearing a bra. The doctor that examined me lifted my shirt all the way up exposing my left breast didn't use a stethoscope or anything and tried to do it a second time to my right. The curtain was open and patients saw me exposed. Was this nessasry?",
  "created_utc": 1723042998.0,
  "score": 311,
  "num_comments": 59,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1eme3qd/breast_exposed_by_doctor/",
  "comments": [
    {
      "id": "lgy9q4z",
      "body": "It's completely valid to be upset with how this was handled. The curtain should have been closed to give you privacy, and you should have been asked to lift your shirt, or the doctor should have made their actions clear before doing them. ER doctors can get busy, and are so used to the physical body they can forget people's need for some modesty.\n\nI can't say whether it was necessary or not, but a visual inspection of the effected area is common practice in the ER. There can be visual indicators to let them know what's going on. Because chest pain was your complaint, the breasts are in the area that is visualized.",
      "created_utc": 1723044142.0,
      "score": 740
    },
    {
      "id": "lgyq4w6",
      "body": "In my experience, chest pain or any concerns with the heart is treated as an emergent case and that means they treat as needed without really communicating and explanation.  This is because if chest pain (or heart concern) equals heart attack or something similar, seconds can be the difference between a good outcome and poor.\n\nIt doesn’t mean that you don’t have the right to be upset or even let patient services know.  It just means the doctors focus was probably more on making sure you were fine than a curtain.  If he came in calmly and just taking his time, after you’ve been there for awhile, definitely say something to patient services (you can usually email them), but if he came in immediately to clear you, I’d try to thankful you are fine.",
      "created_utc": 1723049192.0,
      "score": 184
    },
    {
      "id": "lgyyd4m",
      "body": "When you go to the hospital, especially for an emergency, you unfortunately need to be prepared to give up some dignity.  I think this could have been handled a little better by the doctor, but I wouldn’t get in your head about it. If you were in the emergency room, literally everyone in your vicinity has bigger concerns than a couple of breasts. \n\nLife’s too short. If you can let it go, I would try to let it go.",
      "created_utc": 1723051679.0,
      "score": 116
    },
    {
      "id": "lgzhdsm",
      "body": "It’s definitely valid to exam the chest and the tracheal area for signs of deviation, most commonly with the shirt removed, doing it with the curtain open and others in the area is definitely just not good practice and a sign of very poor bedside manner though and a valid complaint.\n\nhttps://www.lung.org/blog/chest-exam-explained#:~:text=Inspection&text=The%20use%20of%20accessory%20muscles,their%20hands%20on%20their%20knees.",
      "created_utc": 1723057456.0,
      "score": 19
    },
    {
      "id": "lgzylnc",
      "body": "If a visual check was going to be performed, you should have been informed, and closing the curtains takes only a few seconds. It's completely valid to feel terrible about this experience.",
      "created_utc": 1723062709.0,
      "score": 13
    },
    {
      "id": "lgyj44u",
      "body": "If you're upset by it, you can bring it up in a formal complaint. Not much will happen (I find that unless you can prove it was life threatening or caused serious physical harm not much happens anyway) but it might mean they send out a little reminder or something to drs so it's less likely to happen to others\n\nNot a dr so no clue what they were looking for",
      "created_utc": 1723047043.0,
      "score": 23
    },
    {
      "id": "lgyp51f",
      "body": "I work in the ER. You're fine. If it was busy this is normal. He probably wasn't expecting you to not wear a bra. Stop being offended by everything. You had a chest issue. Your boobs are on your chest.",
      "created_utc": 1723048889.0,
      "score": 84
    },
    {
      "id": "lgzmn0k",
      "body": "Wow for a mental health subreddit, a lot of these people are extremely inconsiderate to OP & their feelings about being exposed to STRANGERS outside of the doctors… jeez you may have awareness in the medical field but clearly lack human emotional awareness or empathy .\n\nYour feelings are completely valid. The doctor clearly doesn’t have enough awareness to consider your feelings probably because she’s desensitized because of how normal these things are. \n\nShe definitely should have been more vocal & clear & closed the curtain. But she obviously did not have enough awareness. \n\nI’m sorry you had an unpleasant experience. They always survey you about your trips to the ER. Maybe share there? Idk if it’ll help but it would have been nice to be considered as a human EVEN IF you were having chest issues. \n\nAtleast close the curtain, I would understand if blood was all squirting out but if you seemed pretty normal, I don’t get all the justification a lot of the people are commenting.\n\nIt’s totally understandable that the doctor may not be aware, or is use to her way of life, or is doing her job.\n\nBut it is ALSO understandable to not be comfortable or like your experience.\n\nClearly for a mental health subreddit a lot of people missed the mark on where you actually were probably looking for emotional support as well as expanding your awareness in this particular subject.\n\nYour experience was valid. I’m sorry that she wasn’t considerate. It wasn’t okay.\n\nIt’s understandable but it wasn’t okay.",
      "created_utc": 1723059079.0,
      "score": 19
    },
    {
      "id": "lgz8fc5",
      "body": "I get it but you’re in the ER. You complained of chest pains so they’re gonna go right to it. Your life is the priority over your comfort.",
      "created_utc": 1723054728.0,
      "score": 14
    },
    {
      "id": "lgza7iv",
      "body": "So u went to the ER with chest pains and ur upset that the doctor… looked at ur chest? In a perfect world the curtain would be down but doctors dont have time to ensure political correctness and comfortability when their patient could be having a heart attack.",
      "created_utc": 1723055270.0,
      "score": 24
    },
    {
      "id": "lgz6w0l",
      "body": "This wouldn't be the case in the UK you'd be in a closed room on your own with the doctor and possibly a trainee but that would be all \n\nNo other patients would see you because it breaks confidentiality rules",
      "created_utc": 1723054258.0,
      "score": 13
    },
    {
      "id": "lgz8w02",
      "body": "Maybe the doctor didn’t notice the curtain? Also in emergency I would just be happy to get help ASAP.\nAlso she was moving slowly. Yes. In a rush you might not notice something and/or make mistakes.\n. I have worked in emergency for pregnant women and even if there were dozens of patients and someone came in an ambulance the doctor and nurses would work very carefully to make sure they had not missed anything. \n\nI don’t know how is it there though.",
      "created_utc": 1723054868.0,
      "score": 6
    },
    {
      "id": "lgz7hk0",
      "body": "He should have closed the curtain before he touched you and explained what he was doing \n\nThat's how it would be done in the UK but then again \nNo.other patients are able to see you in your room because the doors have to be shut\n\n\nThey have a room and the bed with the curtains thing is in the corner then there's the rest of the room",
      "created_utc": 1723054443.0,
      "score": 14
    },
    {
      "id": "lgzs38j",
      "body": "Bro I'm sorry this happened and I'm extra sorry people are being dicks about it.\n\nYes, in the ER you're dealing with emergencies but how fucking long does it take to close a curtain, especially if the patient is conscious and alert? Y'all stop being dicks to people IN A MENTAL HEALTH SUB.\n\nI have medical trauma myself from undergoing unneceesary procedures when I was young so I'm sending you so much love as you recover.",
      "created_utc": 1723060733.0,
      "score": 13
    },
    {
      "id": "lgzntqr",
      "body": "They are looking at you as tissue and muscle and fat and organs in the ER. Your breasts are not what they're looking at in a chest exam. Your feelings are valid. With that said as someone who has been in and out of the ER many times they very likely are not checking you out in an inappropriate way.",
      "created_utc": 1723059441.0,
      "score": 5
    },
    {
      "id": "lgyt92e",
      "body": "I guess I just got used to being seen naked somewhere between giving birth (I can't begin to tell you how many people saw my lady parts on the process of labor and delivery) and taking showers at the homeless shelter (30 women, 2 shower heads; we had to line up naked and await our turn; no shower = no bed).",
      "created_utc": 1723050131.0,
      "score": 6
    },
    {
      "id": "lgzhdjg",
      "body": "In an emergency … seems perfectly ok to me. Doing things quickly might save a life",
      "created_utc": 1723057453.0,
      "score": 6
    },
    {
      "id": "lgzi2ro",
      "body": "The vast majority of the population would be annoyed by this for a moment and get over it after realizing it’s an ER and the doctor misjudged the privacy but needed to do what he had to do. You’re having an outlier reaction imo. Take from that what you will.",
      "created_utc": 1723057673.0,
      "score": 7
    },
    {
      "id": "lgzqpan",
      "body": "first I'm so very sorry you went thru that .I & my mom had a Dr liked throwing out nasty sexual innuendo at us .he later was arrested and jailed for writing illegal prescriptions for elderly ( they never admitted it was for sexual harassment) .",
      "created_utc": 1723060312.0,
      "score": 0
    },
    {
      "id": "lgzrwmk",
      "body": "Doctors & nurses have studied and see every part of the human body all the time. In what seems like potentially life threatening chest pains like yours, thorough & careful examination is essential. Heart/head/internal injuries/trauma/breathing etc could all be urgent conditions. If you noticed the curtain was open, you should have said something there. Trauma/ER (and the hospital, in general) is often a very busy and chaotic place. Be grateful for medical care.",
      "created_utc": 1723060677.0,
      "score": 1
    },
    {
      "id": "lgzvb2t",
      "body": "Yeah. You complained about chest pain so the doctor examined your external chest. What did you think would happen? You'd have the complaint and they just prescribe away?",
      "created_utc": 1723061719.0,
      "score": -1
    },
    {
      "id": "lgyuvnu",
      "body": "No. That is not okay. While it is \"common\", they should have asked first... For the exact reason.",
      "created_utc": 1723050627.0,
      "score": -17
    },
    {
      "id": "lgyjpnr",
      "body": "This happened to me in an ER situation and a male nurse walked in no biggie!! I however was traumatized!! I asked that he leave and that he not be allowed back in my room. He huffed away like he was the one offended😑",
      "created_utc": 1723047229.0,
      "score": -28
    },
    {
      "id": "lgykqt9",
      "body": "I wasn't aware that the visual inspection is common practice. Thank you.",
      "created_utc": 1723047549.0,
      "score": 217
    },
    {
      "id": "lgzze8h",
      "body": "She should definitely tell someone who works there, clearly the doctor just forgot that most people don't like having their breasts exposed to random strangers. It's not something to get worked up over, though.",
      "created_utc": 1723062953.0,
      "score": 7
    },
    {
      "id": "lgyub1r",
      "body": "She was moving pretty slowly up until she lifted my shirt so I don't know.",
      "created_utc": 1723050454.0,
      "score": -73
    },
    {
      "id": "lh004hn",
      "body": "At the last emergency trauma conference I went to there was someone selling T-shirts with the slogan \"Drive carefully otherwise I'll see you naked\".\n\nTotally inappropriate and I didn't buy, but it's true.  I'm a 50 year old fat hairy guy - I'm sure that me seeing you naked wasn't what you wanted... But drive like an idiot or get into a gang war then - yep... It'll happen!",
      "created_utc": 1723063176.0,
      "score": 25
    },
    {
      "id": "lgyl2hv",
      "body": "I don't remember the doctors name just what they look like. Also they aren't in my medical file. I searched the doctors in my file online and saw their faces.",
      "created_utc": 1723047648.0,
      "score": -6
    },
    {
      "id": "lgztu5n",
      "body": "Honestly, as a chronic illness human I agree with this. They definitely weren't trying to offend you or make you feel uncomfortable. Ideally the curtain would have been closed, but unfortunately it wasn't. I'm not trying to minimize your trauma in the slightest, but realistically no one was paying attention because they were all busy with their own stuff. \n\nI can tell you from personal experience, as someone who has been in the ER hundreds of times no one was paying attention.",
      "created_utc": 1723061269.0,
      "score": 40
    },
    {
      "id": "lgyusvd",
      "body": "Oh gross, you work in the ER with this attitude? Being upset by having your body exposed to others without your consent isn’t a simple case of being offended.\n\nEdit: just to clarify, I’m not an idiot, I understand one’s body would be exposed in front of other medical professionals for a million reasons. The thing I took issue with, and I am assuming OP is taking issue with, is that it was done with zero privacy so other patients could see",
      "created_utc": 1723050604.0,
      "score": -62
    },
    {
      "id": "lgz2r20",
      "body": "I'm not fine. Being treated like trash is still affecting me. It wasn't busy and she wasn't in a rush. She seemed to only be quick when lifting my shirt. I didn't know what she was trying to do since she wasn't vocal the second time she tried to lift my shirt I stopped her. As far as I know she didn't do that again.",
      "created_utc": 1723053003.0,
      "score": -58
    },
    {
      "id": "lgzrsys",
      "body": "your comment is 💩",
      "created_utc": 1723060647.0,
      "score": -42
    },
    {
      "id": "lgzan64",
      "body": "I don't care that the doctor looked at my chest. I care that I was exposed to patients.",
      "created_utc": 1723055403.0,
      "score": 27
    },
    {
      "id": "lgzzrhe",
      "body": "Why would you have to be naked when the stork delivers your baby?\n\nSeriously, though...sorry about the homeless shelter. Hope you're doing okay now!",
      "created_utc": 1723063065.0,
      "score": 2
    },
    {
      "id": "lgyxv9r",
      "body": "I don't understand what him being make had to do with it. Doctors and nurses are male and female. They have seen a million boobs, vaginas, penises that at this point unless if their own personal sexual partner they don't see them as sexual objects. They are part of a patient and that's literally it. \n\nWhat if he was the best nurse on the floor and you discriminated against him for being male? How would you feel if someone reacted like that because you are a female? \n\nThey are doing their jobs, your boobs, body and whatever parts are not special to them. They are there to treat you. \n\nUnless they do something serious, like touch you inappropriately or have a lot of trauma there's no reason to deny a person from doing their job. \n\nWhat if it was a serious emergency, and you were dying like would you still care? \n\nNever ever understood this.",
      "created_utc": 1723051530.0,
      "score": 26
    },
    {
      "id": "lgykkiw",
      "body": "I'm sorry that happened.",
      "created_utc": 1723047494.0,
      "score": -2
    },
    {
      "id": "lgzyk56",
      "body": "Part of all training for all emergency work is the ABC approach:  (This is admittedly for major trauma though which is my training and daily life)\n\nA - airway\n\nB - breathing\n\nC - circulation \n\nD- disability (not quite what it sounds like, but more about what might be affecting you at this time)\n\nE - exposure\n\n\nIt's the E in this case.  To see what is going on we need to see what is going on.  Even in cases where it might not be obvious we are taught to get eyes on in case there are things that we might not otherwise know about like bleeding.\n\nHOWEVER - there is no excuse for exposing a patient in front of non necessary staff or other patients EVER.  This was a major breach in protocol and respect.  I would suggest  (if you are in the UK) talking to the PALS team (Patient Advice and Liaison Service) who are actually very powerful at getting things changed.  I'm sure that there's a similar service in the USA, but I'll leave that other more knowledgeable people here...\n\nI work in ED / A&E and my wife was one of the people who set up PALS in one of the UK's largest hospitals about 25 years ago.  There are still consultants who go pale if I mention her name!  They have more power then most people think!\n\nAlso - I'm sorry for your experience, but hope that you are now well. \n\nNOTE: I just reread my comment before posting - NOT A DOCTOR.  Senior Nurse.",
      "created_utc": 1723062697.0,
      "score": 82
    },
    {
      "id": "lgyz2vd",
      "body": "Of course it is. You are in the ER, they are going to do everything possible to save your life. That's why you are there right? Because you thought you may be dying or have something seriously wrong? Right?\n\nIf we don't allow medical teams to do their jobs, then we can't expect to receive a diagnosis or treatment. They need to both do a visual inspection and then their other tests which include listening to your heart. \n\nIt sucks, but it's the ER. Their concern is your life.",
      "created_utc": 1723051893.0,
      "score": 219
    },
    {
      "id": "lgzfjrq",
      "body": "That may seem like it(that she was moving slowly) but rest assured examinations like that need time and to hear through a stethoscope they really can’t rush it. I’m sure she just didn’t think about it as it was the ER and the patients there are in emergency and not really in the best of health to communicate much. Saying that yes she should’ve pushed the curtains all the way through definitely.",
      "created_utc": 1723056895.0,
      "score": 56
    },
    {
      "id": "lgz1akm",
      "body": "[deleted]",
      "created_utc": 1723052564.0,
      "score": 37
    },
    {
      "id": "lgyyekv",
      "body": "Omg. They are boobs. Everyone has seen them a million times. \n\nIf you were actually having a heart attack you think they care if they expose your breast or save your life? Let me tell you, saving your life comes above all else. \n\nMy god people are so sensitive now a days and think they are so freaking special. \n\nYour boobs, and body aren't special. Everyone has em. You either got boobs and a vagina or a penis. \n\nThis is standard. You are in the ER. Their concern is your life.",
      "created_utc": 1723051692.0,
      "score": 60
    },
    {
      "id": "lgzh369",
      "body": "I see where your logic is coming from, but I think ur looking for reasons to be upset. I promise you people in a hospital emergency room are not paying attention to you. Also, when it comes to ur chest, courtesies kind of go out the window",
      "created_utc": 1723057363.0,
      "score": 21
    },
    {
      "id": "lgz9sun",
      "body": "I don't care about being exposed to medical professionals that are a part of my care team. The patients that aren't helping \"save my life\" seeing me naked is what bothers me.",
      "created_utc": 1723055146.0,
      "score": 18
    },
    {
      "id": "lgz3a7x",
      "body": "We’re going to get to the point where if you go to the ER for an actual emergency and you are unconscious, the staff is either going to wait until you can give consent or you’re dead. Maybe we’ll at least get to put the option on our DL and hope we have it on us while we are dying. OP is over here trying to file a complaint and get a payday over a boob. People are ruining this country and the government is placating them by passing silly laws. \n\nGo to Europe, they’re all over every gas station and at every beach. Boobs… and less sensitive people, that is.",
      "created_utc": 1723053162.0,
      "score": 4
    },
    {
      "id": "lgz3s23",
      "body": "I actually don't think I have a special body and never said that. It's because of how bad it is and how insecure I am about it that I don't want it being exposed. I don't go around showing my body to random people and I don't appreciate being put in a position to potentially be humiliated by having a photo taken of me or something. It would have taken a second to close the curtain. If she was that concerned about my life she shouldn't have only been moving quickly when lifting my shirt.",
      "created_utc": 1723053310.0,
      "score": -17
    },
    {
      "id": "lgzgtns",
      "body": "Bro. The trauma bay is visible. You're gonna have your clothes cut off if it's an actual emergency. Better get over this quick or you'll jsut end up dead bro",
      "created_utc": 1723057282.0,
      "score": 14
    },
    {
      "id": "lgza7kg",
      "body": "Who said anything about a pay day? You're making a lot of assumptions here.",
      "created_utc": 1723055271.0,
      "score": 14
    },
    {
      "id": "lgzgl1z",
      "body": "Guess what. If you came in with a heart attack or came in via ambulance, we will take siccors to your clothes. Cut them off. You'll be exposed to like 20 people. This is how it is. The ER is for EMERGENCY. If it's not an emergency and you want slower more intimate care, then go to the urgent care.",
      "created_utc": 1723057209.0,
      "score": 41
    },
    {
      "id": "lgz7ayu",
      "body": "No one is taking a photo of you in the ER.... They are there for their own health reasons. You are not the center of other people's world. I promise you. No one goes around showing their body to people. That's illegal. But you are in an emergency medical setting... \n\nYour insecurities unfortunately do not come before your life and you do not want a doctor that rushes. \n\nIt's not humiliating to see a breast. All women have them. Your boobs are not special, you are in an emergency room. The last thing others are worried about is seeing a breast. \n\nYou are way overthinking this and I think you would benefit with some therapy for how insecure you are with your body.  I hope one day you can learn to be comfortable with it. \n\nUnfortunately there's no much you can do here. People have their clothes ripped off in the ER all the time to save their life.",
      "created_utc": 1723054387.0,
      "score": 26
    },
    {
      "id": "lgzji6n",
      "body": "So there's no protocols in place to try and keep a patient covered as much as possible?",
      "created_utc": 1723058117.0,
      "score": 9
    },
    {
      "id": "lgzirzp",
      "body": "What I care about is \"WHO\" I'm exposed to. They could be 1,000 medical professionals coming in and out I could be naked and cold being touched poked and proded in stirrups Idgaf as long as you are a part of the people taking care of me. I don't need to be exposed to randos on the street or patients in the ER.",
      "created_utc": 1723057891.0,
      "score": -18
    },
    {
      "id": "lgzjub9",
      "body": "Why are you on a mental health sub Reddit if you are going call the other people sensitive, make assumptions about them being self centered, and make multiple long angry comments about them that are all based on random assumptions. They just asked a simple question, they are valid to feel what they feel. And if them asking a question or having feelings makes you so mad and unable to give a regular non-angry response without insults, maybe it’s time to take a break, and leave Op alone.",
      "created_utc": 1723058221.0,
      "score": 10
    },
    {
      "id": "lgz7rht",
      "body": "So many people have their phones on them in the ER though. Might be some paranoia on my part but definitely a possibility.",
      "created_utc": 1723054526.0,
      "score": 5
    },
    {
      "id": "lgzk90k",
      "body": "No. We are not concerned about your sensibilities. We are concerned about keeping you alive. That's what the emergency room is for. Not for a minor issue. People treat the ER as a primary care then are shocked when we don't kiss your ass. The ER is rough and tough save life. We definitely will be nice if it's an actual emergency, but if it's not, you're abusing the system.\n\nIf we get to this point of being concerned about people being shy, people will die. I'm not gonna fall into it",
      "created_utc": 1723058347.0,
      "score": 27
    },
    {
      "id": "lgzktpp",
      "body": "I will sat there ARE rooms for less serious cases. But chest issues are taken seriously. If you come in with a chest issue you're gonna get taken seriously quickly and emergently",
      "created_utc": 1723058523.0,
      "score": 17
    },
    {
      "id": "lgzkxwc",
      "body": "[removed]",
      "created_utc": 1723058558.0,
      "score": -1
    },
    {
      "id": "lgzjf2m",
      "body": "That's crazy bro. It seems it wasn't an emergency if you had time to be concerned about this.\n\nGo to urgent care next time.\nUrgent care: seen day of for non emergency acute concern. Private.\nEmergency: life threatening situation. Non private. \n\nDon't go to ER if it's not an emergency or threat to life. It's that simple.",
      "created_utc": 1723058091.0,
      "score": 44
    },
    {
      "id": "lgzlqaj",
      "body": "So I should be okay with my breast being exposed to random people?",
      "created_utc": 1723058799.0,
      "score": 12
    },
    {
      "id": "lgzoq2j",
      "body": "You are in a hospital with chest pain, If you for example had visible symptoms it would be important and the lack of visible symptoms it's also important.\nAlso, having your chest exposed gives you valuable seconds for chest compressions or a defibrillator.",
      "created_utc": 1723059711.0,
      "score": 18
    },
    {
      "id": "lgzpb5h",
      "body": "You’re not overreacting. I notice most of the replies are from men. As a woman I’d also be pissed. I’m a nurse and even in the OR I make sure patients are covered as much as possible when moving from bed to OR table. We also cover them as soon as the drapes come off to maintain dignity. The comments in here are really disappointing tbh.",
      "created_utc": 1723059889.0,
      "score": -1
    }
  ]
}