{
  "id": "1foybeq",
  "title": "my boyfriend k*lled himself in my apartment ",
  "selftext": "my boyfriend and i got into a bad fight where he ended up putting his hands on me. i told him to get his things and leave my place. i gave him 24 hours and his car was still there. police came, knocked on the door, no answer. i had the worst pit in my stomach, a really bad feeling something wasn’t right. no sounds or movement at all, not even a “fuck off”. i called for a wellness check today and the officers found him in my bedroom. i’m diagnosed bipolar and adhd and i’m having a really hard time. and please dont say ur sorry because i dont want to say “its ok” because its not. none of this is ok. our last interaction was a fight. i didnt answer his last attempts to reach me. he put the latch on the door so i couldnt have stopped him even if i knew. i wanted to be wrong so bad. i dont want this to be real. i cant do this.",
  "created_utc": 1727247272.0,
  "score": 1194,
  "num_comments": 193,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1foybeq/my_boyfriend_klled_himself_in_my_apartment/",
  "comments": [
    {
      "id": "lotho4c",
      "body": "**Hello u/!** \n\nThank you for tagging this post with a content warning! This helps greatly!\nIt can prevent other users from potentially getting triggered and it gives us the chance to provide you with some resources regarding this topic.\nGood to know is that using this flair automatically marks your post as NSFW.\n\n*Your post may not show up directly on our subreddit, please be patient, it is most likely in queue to be manually reviewed by our team.*\n\n\n---\n\n**Are YOU currently in an ACTIVE crisis?**\n\n* If you are in a dire need to talk to someone right now? On this [website](https://findahelpline.com/i/iasp) you can find a hotlines for over 130 countries. Yours is most likely there too.\n* We know calling a hotline can be be scary, you might be afraid of the questions you might get, this [wiki post](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) covers a lot of information regarding calling a hotline. \n* Please head over to r/suicidewatch and feel free to share you story there!\n* If you have active suicidal thoughts, you can also talk to the moderators of r/suicidewatch privately. You can message them [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch). At this moment our r/mentalhealth team does not offer this.\n\n---\n\n**Are YOU currently struggling with SUICIDAL THOUGHTS or do you feel like SELF HARM?**\n\n* Helpguide.org can give you [some information](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) on how to cope.\n* Know that you are not alone, many people have struggled with this. You can see some of their stories [here](https://www.youtube.com/watch?v=O_cCO7u5jYA&t=15s).\n* Try to [take a deep breath](https://www.youtube.com/watch?v=8vkYJf8DOsc), maybe [try some grounding exercises](https://www.youtube.com/watch?v=30VMIEmA114) or listen to some of your favorite music.\n* If you want to talk to someone, on this [website](https://findahelpline.com/i/iasp) you can find a hotlines/local resources for over 130 countries.\n\n\n---\n\n**Are you worried about someone else?**\n\n* Samaritans.org has a [page](https://www.samaritans.org/how-we-can-help/if-youre-worried-about-someone-else/) with different scenarios on what to do if someone isn't okay.\n* Check out [this post](https://www.reddit.com/r/SuicideWatch/wiki/talking_tips/) with talking tips. \n* Read through [this post](https://www.reddit.com/r/SWResources/comments/1c7nqf/worried_about_someone_who_may_be_suicidal_heres/) with info about how to assess risk.\n* There is also a [Reddit Help Page for what to do if you're worried about someone else](https://support.reddithelp.com/hc/en-us/articles/360043513931-What-do-I-do-if-someone-talks-about-seriously-hurting-themselves-or-is-considering-suicide)\n* Don't forget to think about yourself and your own mental health when you are trying to help someone.\n\n      \n---\n\n        \n**Take care and stay safe!**  \n\n*If you see any inappropriate posts or comments, please report them and we will deal with them accordingly.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1727247273.0,
      "score": 1
    },
    {
      "id": "lotiodo",
      "body": "That is seriously heavy stuff. Do you have friends or family that can support you during this time? Even a professional can help with what you're dealing with.",
      "created_utc": 1727247938.0,
      "score": 796
    },
    {
      "id": "lotiwxd",
      "body": "It’s not your fault this happened. I’m sorry your boyfriend made this decision. Suicide is almost always a spontaneous event, which can make us wonder what we could have done to prevent it. But the decision to end their life is not up to us no matter what we did or didn’t do. \n\n[suicide grief hotline](https://988lifeline.org/help-yourself/loss-survivors/)\n\nhttps://www.helpguide.org/mental-health/grief/coping-with-a-loved-ones-suicide\n\nConsider looking up “suicide grief” for more resources.",
      "created_utc": 1727248093.0,
      "score": 302
    },
    {
      "id": "lotk3tq",
      "body": "Holy shit dude. I would definitely say to put yourself in a safe space for yourself, none of this is gonna be easy to deal with, and none of this will ever truly leave you. But you can’t stay stuck like that, stay away from your apartment for a while, try to keep yourself with company. And although it’s a scary thought. Try going to a mental hospital. Just for your own safety, not saying you’re boss or anything, it’s just a safe route for yourself. As far as the actual nature of the situation, I am genuinely sorry for what happened, you do not have to say it’s okay cuz I wouldn’t even know how to digest that. I don’t know if you’re a person of faith, but I’m sending all my prayers for you and him. Please try to stay safe. And don’t do anything rash",
      "created_utc": 1727248897.0,
      "score": 109
    },
    {
      "id": "lotj11b",
      "body": "This sounds really bad and hard to digest. Were you guys sober when the fight happened?",
      "created_utc": 1727248169.0,
      "score": 78
    },
    {
      "id": "lotwmcf",
      "body": "This will sound weird, but play Tetris. It mimics EMDR therapy and will help your mind in a multitude of ways that help when you're under stress like this. Please try it ♥️ sending hugs if you want them",
      "created_utc": 1727257710.0,
      "score": 68
    },
    {
      "id": "lotnwdf",
      "body": "There’s no way you can blame yourself in anyway. There were obviously deeper more personal and serious issues going on. That was not fair or right of him to put this burden on you. I hope you heal and forgive yourself, there’s nothing you could have done different. Bless n take care 🧡",
      "created_utc": 1727251575.0,
      "score": 41
    },
    {
      "id": "lou3e74",
      "body": "My heart absolutely breaks for you. Sending you so much love ❤️   Is there somewhere else you can stay for awhile at least? It would be incredibly difficult for anyone to try to function in a space like that after something so horrific and earth shattering. I want you to know THERE IS NOTHING YOU COULD HAVE DONE. Read those words over and over. You did the best you could with the knowledge you had at the time   My DM’s are open if you’d like to chat in private. I’m a great listener 🫶🏻",
      "created_utc": 1727261787.0,
      "score": 16
    },
    {
      "id": "lotr1vq",
      "body": "Dbt, and act have helped me phenomenally over my so’s death (she passed at 21 to cancer, less than a month before her birthday), and all I can say is some days will feel a lot better than others, the only thing you can do is work on it one day at a time. I still get dreams but after asking god for help (I’m NOT religious, just nothing else was working) and quitting pills I’ve finally reached a sort of peace. Rip to your boyfriend and I hope you find your peace love. If you have any questions about my recovery plz dm. And if you aren’t feeling safe by yourself call a friend or family. They’d much rather have you cry too them than find out that they could have helped. I’ll pray for your peace, and his.",
      "created_utc": 1727253818.0,
      "score": 10
    },
    {
      "id": "lov9xvb",
      "body": "Someone in your life is gonna say “I’m so sorry.” And you absolutely do not have to reply that it’s ok. You can absolutely say, “yeah, it’s so fucked up and it’s really hard and I don’t know what to do,” or whatever else you’re feeling. \n\nWhen someone asks if you’re ok, you can totally tell them, “no, I’m not.” It’s ok to not be ok. It’s fucking normal to not be fine in the midst of a terrible situation, and you don’t need to worry about how they feel about what you are struggling with. \n\nPeople are idiots and try to fill the empty space with something that feels right to say, and those things do not require you to pretend you’re fine or ok.",
      "created_utc": 1727278026.0,
      "score": 12
    },
    {
      "id": "lou6in3",
      "body": "I just... fucking hell, I'm at a loss for words. I am genuinely devastated and sorry for you having to go to this nightmare. I'm not sure if it's appropriate to say but I feel like someone has to tell you This will stick with you for a while. It will for life. and starting to even process the reality of what you just experienced is surreal and it's going to be an extremely long confusing road to navigate and find something to process it,. Please find someone to talk to ASAP and if you suddenly lose it please don't do anything impulsive and harmful. This is serious stuff. even though you're a stranger I'm feeling this as I know what it's like to find a brother that overdosed on multiple substances and hanged himself and there were no warning signs. It's been 12 years and the thought will pop up randomly and scramble your brain. Don't stay alone and definitely not at the apartment. It's not your fault. Sadly his thought process at the time probably influenced by being drunk caused him to cause an act which was rash, irrational and there's no way to say it but it's permanent and incomprehensibly traumatic to close ones, you being affected by this. life is a motherfucker. I urge you to Seek professional help and support. Take care and my condolences for you and all those that will be hurt beyond words by this. Time blurs the memory but it's scarring. It will take time to feel and continue a version of what normal life is. I hope you don't stay alone with your thoughts right now.",
      "created_utc": 1727263390.0,
      "score": 9
    },
    {
      "id": "loxzywn",
      "body": "I am so sorry for your loss, OP. \n\nr/suicidebereavement has been a really helpful resource for me, please check it out even just to read through the posts and comments and see that this complex and traumatic grief is not yours alone to carry.",
      "created_utc": 1727309836.0,
      "score": 7
    },
    {
      "id": "loublz7",
      "body": "Hey. So i just want to say this as someone who lost a brother to suicide and has attempted it twice myself.\n\nThis isn't you. It's not your fault. There is nothing you did that caused this. There will be a million things running through your head because you have suffered a severe trauma. It's gonna cause mayhem for a bit but it will settle down. When it does then you'll be able to begin to process and heal.\n\nFor now, please concentrate on your wellbeing where you can. It doesn't matter if you don't look after yourself as well as normal. That will come when things settle. Just think of trying to settle. It's gonna be really hard but you can do it and there will be people willing to give you time, to help you heal. \n\nI'm sending all the love I can to you. This is really tough and no-one deserves to be put through this. You dont deserve to be put through this. You will get through it though. Anything you need, just ask ok. \n\nIt's gonna be ok.",
      "created_utc": 1727265781.0,
      "score": 4
    },
    {
      "id": "lout3el",
      "body": "My boyfriend also did the same thing while we were fighting… I’m so sorry. If you want to talk my PMs are open",
      "created_utc": 1727272553.0,
      "score": 5
    },
    {
      "id": "lowkvjx",
      "body": "I want to validate that this is a horrific and traumatic experience, and that it was entirely under his own volition- you caused nothing, he made his own choices. \n\nI am sorry this happened to you- but please *don’t* say it’s ok- it isn’t ok! People will say that to you a lot, but no one is asking for forgiveness. This is a terrible thing that no one can fix, and that is what I am sorry about. No need to respond, just know that we see your pain 💜",
      "created_utc": 1727292616.0,
      "score": 4
    },
    {
      "id": "lotskqs",
      "body": "I hate to be the one to be blunt here, but, if he put his hands on you.. just know that guy was not “the one”. He was not your soulmate, twin flame, ride or die, or anything that would mean he would be your perfect person forever. If god was real, he removed him from your life, unfortunately in this catastrophic way. If fate or destiny was real, it wouldn’t work out either. I don’t always use this phrase, but in this context I have to tell you that hurt people hurt people. It is not your fault. Whether it was you, or another girl, or the next, unfortunately it probably would’ve resulted in the same outcome as he was struggling with mental illness and domestic abuse anyways. Please don’t allow yourself to take the blame for this. You can absolutely hold space for him in your heart regardless of the abuse he put you through and grieve the loss any way you see fit, but do not accept responsibility for his actions. That is not your burden to bear. This is also something that is traumatizing you as we speak and I really need you to know that whatever you feel or think or do is a normal response to a very abnormal situation. Nobody needs this abuse and trauma in their lives.",
      "created_utc": 1727254900.0,
      "score": 33
    },
    {
      "id": "lou3pa8",
      "body": "As others here have said, i reaaally recommend surrounding yourself with family/friends. i understand how distressing this all is and you may actually be a danger to yourself. you need support and care now more than ever, just as any human being in your situation would.\n\nAlso, i know this is impossible to think about right now, and i don’t expect you to be even able to comprehend such a possibility, but that horrible torment you must feel will lessen with time. it won’t disappear completely i’m afraid, but it will lessen.\n\nIf you ever feel like you’re going to do something you’ll regret, call emergency services without hesitation. your life is worth much, much more than the police’s time. sending virtual hugs 🫂, i hope you’re able to heal from this terrible wound in your heart.",
      "created_utc": 1727261952.0,
      "score": 4
    },
    {
      "id": "loyp8ui",
      "body": "In case nobody’s mentioned it, join us at r/suicidebereavement\n\nIt’s the best club I never wanted to join, I hate belonging there but my irl support system is so small that I’m grateful to have the community.",
      "created_utc": 1727319568.0,
      "score": 3
    },
    {
      "id": "lovbk1o",
      "body": "It's not your fault. I know you want to blame yourself.  But it's simply not the case. He clearly was a troubled man.  Just from what you've said. \n\nAlso we'll balanced individuals don't do something like kill themselve in the home of their partner. \n\n\nMourn his loss if that is your feeling. . But understand he made the choice. You couldn't have known. And we're within your rights to ignore him especially after he got physically violent with you.  \n\nHe took the cowards way out and did so in such a manner to damage you as much as possible.   \n\n\nIt is not on you.",
      "created_utc": 1727278538.0,
      "score": 6
    },
    {
      "id": "lou6wdc",
      "body": "😢 I don’t even know how I’d begin to cope with that. Surround yourself with people who love you. That’s truly the only thing I could think of suggesting. Grief counseling as soon as you feel up to it.",
      "created_utc": 1727263579.0,
      "score": 2
    },
    {
      "id": "loujdun",
      "body": "There are no words to take your pain away, but I just wanted to let you know that none of this is your fault and you did nothing wrong. Like you said, none of this is okay, it is so so awful that you’re going through this.😔Just take it one day, one hour or one minute at a time. I didn’t know your boyfriend or you, but I can imagine that he wouldn’t have wanted you to follow in his footsteps, otherwise he would’ve asked you to do it with him. I am sending you so many hugs, I hope you are able to find someone to stay with for this week at least.❤️❤️",
      "created_utc": 1727268988.0,
      "score": 2
    },
    {
      "id": "loukykb",
      "body": "It’s really horrible and not ok. It’s gonna take a long time to get over this. Get a therapist u like and join a support group. Those things work!  Don’t just mask the feelings with substances. That will just prolong the pain",
      "created_utc": 1727269590.0,
      "score": 2
    },
    {
      "id": "lounb7q",
      "body": "I’m not the best in advice like this, but it is something that will come with a heavy journey acceptance and I’m sure you’ve heard it but it’s not your fault.\nI don’t wanna say much more because I don’t wanna sound generic or say useless words but please hang in there because things do get better. See some family and friends and take things slow",
      "created_utc": 1727270477.0,
      "score": 2
    },
    {
      "id": "lov5f2p",
      "body": "From your post, and your replies he clearly had other things going on within. Nobody kills themself over a small argument like that. There was something deeper going on with him. And I’m definitely not saying it had anything to do with you, it could’ve been something he was struggling with, and you didn’t even know about.",
      "created_utc": 1727276600.0,
      "score": 2
    },
    {
      "id": "love8mx",
      "body": "You don't need to be able to do anything right now. \nJust sit woth yourself, let it settle. \nRealizing what happened will take time and it will hurt.\nBut it will heal.",
      "created_utc": 1727279375.0,
      "score": 2
    },
    {
      "id": "lovfv5j",
      "body": "-hug-",
      "created_utc": 1727279880.0,
      "score": 2
    },
    {
      "id": "lovimg9",
      "body": "Holy shit..",
      "created_utc": 1727280748.0,
      "score": 2
    },
    {
      "id": "loxncps",
      "body": "I was having this fear of my roommate over the this summer. Things like this happened, but they ended differently...\n\nHowever long it takes, whatever you need to do, please be ojay eventually. No matter what the words mean to you right now, you have to let this go. Death is not the end we think it is, we live on in our actions. Seek help, seek support, you have to start over and for you. Live for YOU now, and live for a better life. His actions were his own and by his own doing, nothing will ever change that. Take care. So so so much love from so many sides for you.",
      "created_utc": 1727305202.0,
      "score": 2
    },
    {
      "id": "lozeiqs",
      "body": "OP hard as it may be to believe, this is not your fault. Couples fight every all the time and it’s not a common/normal occurrence for a partner to kill themselves due to a fight. There is absolutely no scenario in which that is a normal reaction. Sounds like your partner might have benefitted from some professional help of some sort. It’s not fair for you to carry the burden of what happened to them.",
      "created_utc": 1727332900.0,
      "score": 2
    },
    {
      "id": "lp10soa",
      "body": "My boyfriend took his life when I was 16. There is not one thing I can say to make it okay. It is not. But I feel for you immensely and if you need a stranger to talk to that gets it feel free to send me a message. What you’re experiencing is unimaginable and horrible. Please don’t be alone at this time. Talk to friends talk to family, reach out to whoever you need to. Stay strong and remember this is not your fault, no matter how much it might feel that way. You aren’t alone in this as awful as it is. Feel everything you need to feel, it’s going to hurt, it’s going to feel unbearable, but nothing he did was your fault. Please, please remember that if not anything else I’ve said. I’m here if you need to talk, messages are always open. You will make it through this❤️‍🩹",
      "created_utc": 1727362246.0,
      "score": 2
    },
    {
      "id": "louso5p",
      "body": "It’s not your fault. As much as it feels like it is to you right now, it’s not. That was his decision. He chose to take the easy way out for him. And it was pretty petty of him and shitty to do it where you lived. It was one more way to get at you and to hurt you. I will say I’m sorry that he did this to you, that he wasn’t able to be an adult and walk away. I understand being suicidal but it still doesn’t make it right for him to do it there. I’m sorry you’re having to go through this and deal with the aftermath of his decision and all that it’s going to entail for you now. The best thing you can do is probably going to be start therapy if you’re not already in it. I don’t feel bad for him, he made his choice, I feel for you though because you’re left to deal with the consequences of his decision. (((Hugs))) I wish you nothing but love and healing from this and that one day you truly understand it’s not your fault.",
      "created_utc": 1727272408.0,
      "score": 4
    },
    {
      "id": "lou11es",
      "body": "[removed]",
      "created_utc": 1727260467.0,
      "score": 6
    },
    {
      "id": "louvbwx",
      "body": "Firstly, don't blame yourself. You didn't kill him, he did, so while it is normal and right for you to grieve this loss, none of this is your fault.\n\nSecondly, you need to talk to someone IRL instead of Reddittors. Call 9-8-8, or find a therapist or counselor you can meet with IRL.",
      "created_utc": 1727273319.0,
      "score": 2
    },
    {
      "id": "lotojk9",
      "body": "Please find someone to talk to. I don’t have to tell you this but it will never be ok. You will look at the world differently. You’ll look at people differently. You’ll look at yourself differently. You will never be able to feel the same. You will go through grief in your own way. Nothing will stop this feeling it has to drag its way through you.\n\nBeing bipolar myself I’d assume you have some habits/coping skills you’ve developed over the years to help when things are rough and I’d say hold on to those skills tightly( if you don’t I have some that work for me I could share). Trauma changes your brain in a way like being neurodivergent does. You’ll have to find new coping skills aswell as using old ones.\n\nDon’t miss therapy(even if you just sit there and say nothing don’t miss it). Talk to people you trust. Not just someone that will talk things through but someone that will just listen to the whirlwind of emotions and thoughts without giving any input. Find someone you can vent to. DO NOT SIT WITH THESE FEELINGS! get whatever your thinking or feeling out in some medium either that’s verbally with a trusted friend/family member/therapist or write in a journal. As for the physical symptoms. Also get them out! Run, hit something(preferably without breaking something like a bed or something soft), lift weights if you do that, scream as hard as you can into your pillow or fuck it, just scream where you are let all that emotion flow out as it comes. If you want to cry. Fucking cry. Cry until you can’t cry anymore just don’t hold it in.\n\nYou will never be able to change what’s happened to you. Just like you can’t change that you’re bipolar.\n\nPlease say fuck you if I’m out of line for any of this reply  but I don’t want to tell you the bullshit most people say about trauma and disorders. They don’t under stand that it’s not just a memory, a feeling, a single thought but it’s part of our behavior. Every second of every day you feel the effects. Give yourself time. Your strong. You wouldn’t be hear now if you weren’t.\n\nUnfortunately tho I’m still human and I empathize a little so I’m sorry but I’m sorry(purely selfish).It’s amazing you were able to share that. No matter what you may think. Posting this is a way to cope and you’re already starting the process of learning to cope. you’re amazing.\n\nKEEP GOING",
      "created_utc": 1727252032.0,
      "score": 1
    },
    {
      "id": "lou9l32",
      "body": "I cant even start to imagine what that is like. I am glad that you made an appointment with a therapist. Be with someone who can support you. Don’t be alone. Do not blame yourself for this. It is a tough situation and it might take some time, but remember that it’s not your fault.",
      "created_utc": 1727264865.0,
      "score": 1
    },
    {
      "id": "loua6yl",
      "body": "Please take care of yourself as best as you can. Take some time off work. Be with family or friends if that helps. Keep taking your medications and keep going to therapy. I have bipolar and adhd too. This will probably trigger a long depressive episode so try to keep taking meds and eat something. Cry it all out and do whatever you need to do. Scream if you need to scream. Talk if you need to talk (even in the middle of the night there’s hotlines). Don’t for a second let the bipolar or anyone else tell you it’s your fault. It’s not.",
      "created_utc": 1727265142.0,
      "score": 1
    },
    {
      "id": "loudw6v",
      "body": "I may not have the words to make you feel better but please hang in there. Sending you prayers.",
      "created_utc": 1727266779.0,
      "score": 1
    },
    {
      "id": "loufrvy",
      "body": "This is....just crazy \nPlease get some help. Don't go to friends \nGo to a professional \n\n\nI wish you heal from this❤️ all love",
      "created_utc": 1727267560.0,
      "score": 1
    },
    {
      "id": "loug4iu",
      "body": "This happened to my good close family friend. Just know that it’s not your fault. He made that decision and you were well within your rights to ask him to leave. She will be haunted by it forever but she’s happily married now with a child. This is horrible that it happened to you and I’m so sorry you’re dealing with this.",
      "created_utc": 1727267705.0,
      "score": 1
    },
    {
      "id": "loukixh",
      "body": "[removed]",
      "created_utc": 1727269425.0,
      "score": 1
    },
    {
      "id": "louxq9l",
      "body": "Some horrible stuff happened in my life too. But I live my life and will not waste it if others did and didnt value their life .... Killing urself is last step to not solving thing and trying to make life even harder for someone. And that's what he is achieving right now... Hurting u.\n\nSo as before when he put hands on you.\nStay strong for yourself and live your life.\nAnd don't try to save everyone. \nSome are here just to make their life hell...\n\nSome times i think about if this would have happened to me 10 years in the past and i would be my age. What would i think about that event and how i want that i have responded then? \nHow would i advice my friend if something like that would happen to her and asked me for help.",
      "created_utc": 1727274120.0,
      "score": 1
    },
    {
      "id": "lov1lri",
      "body": "I'm glad you put that boundary up and told him to leave after he got physical. The relationship was over at that point and anything he did after is just his need to hurt you one last time. What he did was possibly the most selfish thing I've ever heard and I hope you don't allow yourself to think otherwise. He's not the victim, he did this to make you the victim. Fuck him.",
      "created_utc": 1727275386.0,
      "score": 1
    },
    {
      "id": "lov3jdv",
      "body": "It was his choice. You had nothing to do with it. It sounds like his last action on earth was to traumatize you on purpose. It’s not fair for you to suffer through this, but you will make it through. Hopefully in the future you can recognize what a piece of shit he was for doing this to you.",
      "created_utc": 1727276004.0,
      "score": 1
    },
    {
      "id": "lov6vmg",
      "body": "I am sorry you are going through this, it must suck so much.  Several years ago a friend of mine went through a similar situation (fight with husband at night, left for work and came home and found him).  It wasn't easy for her, and she still struggles.  Surrounding herself with family/friends and therapy was very beneficial.  There is a lot of grief and guilt there.  She also found a support group for grief/suicide loss and that really helped her too.  \n\nI know it's not the same, but I was in a very dark place and going through all the guilt after one of my kids survived suicide attempts and her therapist told me something that has stuck with me through the years and that I remind myself of daily \"You did the best you could with the information you had at the time.\"  \n\nI hope you find some relief to your grief eventually.  It won't be easy and it won't happen overnight, but I believe you will get there someday.  Just take things one day at a time for now.  Even if its just taking the day in 10 or 30 minute increments.  Juat little chunks of time, you will get through them.  💜",
      "created_utc": 1727277064.0,
      "score": 1
    },
    {
      "id": "lovitse",
      "body": "This is absolutely not okay, it’s a nightmare. I know from my own experiences that navigating a traumatic loss while also dealing with mental health issues is complicated and scary. It’s going to take time to feel any semblance of normalcy again, and you’re allowed not to feel okay right now. It may be helpful to try and find somewhere else to stay for the time being if you’re able to, just so you aren’t physically in the space that this all happened in.  \n\nNo amount of people telling you this isn’t your fault is going to lessen your feelings of guilt right now, that’s just going to take time and work with your therapist. Please try to lean on the good people in your life and take care of yourself the best you can. I haven’t been through your situation, but I’ve been grieving the loss of someone I love more than anything who died in a traumatic way. It might not be helpful from a stranger, but please feel free to message me if you need someone to talk to. I may not have any advice or words of wisdom, but I can offer some commiseration.",
      "created_utc": 1727280811.0,
      "score": 1
    },
    {
      "id": "lovj672",
      "body": "It will take so much time to heal. How you're feeling is the normal reaction. You're gonna be sad and mad and all these feelings of regret and shame all of it.\n\nYou're not gonna want to do anything for some time.\n\nBut it will get easier. It will always hurt but dealing w the pain will get easier.\n\nOne of my very first loves did this. And I looked for his face for years.. everywhere I would go.\n\nBut they're always with us even if we can't see them. \n\nIt's not your fault.. it happens to the best of us.",
      "created_utc": 1727280918.0,
      "score": 1
    },
    {
      "id": "lovkq5o",
      "body": "Hi there please do make sure u keep the appt for the therapy session. Please also consider leaning on friends and family that u trust to help u through this difficult time take care",
      "created_utc": 1727281406.0,
      "score": 1
    },
    {
      "id": "lovu85p",
      "body": "Damn that is intense. At that point you just accept that it happened then you tell yourself I couldn't stop him even if you wanted to. Then you say I'm sorry to his family. Then after that you mourn his death. Then you move on. This takes a lot of willpower a lot of courage but it's necessary and I believe in you. Stay strong and keep it pushing. May he rest in peace.",
      "created_utc": 1727284350.0,
      "score": 1
    },
    {
      "id": "lovxujf",
      "body": "Also Bipolar and ADHD. Call your care team, get yourself to the ER- have someone on the outside arrange getting your place cleaned up, or packed up, or whatever, while you take a voluntary to ensure you stay safe for the worst of it while coordinating with your care team. This sucks, go process it in a safe place. Just go do it instead of thinking about if it's worth it or not.",
      "created_utc": 1727285463.0,
      "score": 1
    },
    {
      "id": "low3q4w",
      "body": "I just want to say that you're not responsible for anyone else's actions. Good or bad. Everyone is responsible for their own selves. The solid facts are, he put his hands on you, and that is also not ok. Under ANY circumstance. You did everything exactly right. He CHOSE the actions he made. Men who put their hands on women, do not change. It escalates the longer you may have stuck around. And if you didn't do things the way you did them, it could have ended up being you and not him. Whether or not he would have gone and killed himself, is irrelevant to the fact you did what was right for you and your safety. My advice, find somewhere else to live. (Easier said than done, I definitely understand.) Get into or continue therapy. Lean on friends and family or us here as much as you need to. Never feel annoying or intrusive by having to talk. If you have something to say that's on your mind, get it out to someone some way. Rebuild. Everything is going to be alright. Most importantly, let yourself grieve. Feel all the feelings you have. They're okay.  They're valid.",
      "created_utc": 1727287264.0,
      "score": 1
    },
    {
      "id": "lowa0fq",
      "body": "He latched the door, you couldn't have stopped him. This was inevitable. \n\nIt's tragic when a life ends, but for some their own thoughts are too heavy to carry. Suicide is very rarely a sudden thought, it builds and builds until there is no other way out. This isn't on you, and you could have done nothing to prevent it\n\nTake time to process the grief but do not for one second blame yourself, he locked you out.",
      "created_utc": 1727289222.0,
      "score": 1
    },
    {
      "id": "lowdym5",
      "body": "🤍",
      "created_utc": 1727290458.0,
      "score": 1
    },
    {
      "id": "lowjvmi",
      "body": "It’s not your fault.\nI won’t say sorry because you asked for people not to, and I agree, it’s not ok, it’s sad. Really hope you have support to get through this. It is not your fault remember that.",
      "created_utc": 1727292312.0,
      "score": 1
    },
    {
      "id": "lowlbj5",
      "body": "Not sure if you have delved into mindfulness but it helps. Little moments you can be In without the world crashing.",
      "created_utc": 1727292754.0,
      "score": 1
    },
    {
      "id": "lowlynu",
      "body": "[removed]",
      "created_utc": 1727292953.0,
      "score": 1
    },
    {
      "id": "lowpbe5",
      "body": "For what it is worth, playing Tertris in the hours to days after a major traumatic event can help alleviate more long term effects. I don't have anything more to add other than wishing you well.",
      "created_utc": 1727293975.0,
      "score": 1
    },
    {
      "id": "lowvvkb",
      "body": "Spend time alone. \nAnd spend time with confidants. \nCry, get angry, sad. \nThere isn’t a “right” way to do what you’re doing, to go through what it is to grieve is a hardy process. \nDon’t focus too heavily on anything. \nI’m sure you close your eyes and behind the lids you think and think and think. \nIf you can…. Sleep. Wishing you the best..",
      "created_utc": 1727295989.0,
      "score": 1
    },
    {
      "id": "lowy4fz",
      "body": "Rest in peace. I’m not saying that for you, OP. I’m saying that for your ex boyfriend.",
      "created_utc": 1727296673.0,
      "score": 1
    },
    {
      "id": "lox5roo",
      "body": "I'm so sorry.",
      "created_utc": 1727299073.0,
      "score": 1
    },
    {
      "id": "lox786k",
      "body": "It's an awful thing to say, but you're gonna need to find another place to live. Start of small, at friends and family's place and as you recover start to look for another apartment.\n\nI've met people that stayed in the place and they sort of Bury themselves in there with the grief.\nYou can have all the grief you want but try your best to not make your loved ones grieve you because of stubbornness to it.\n\nGood luck 😥",
      "created_utc": 1727299555.0,
      "score": 1
    },
    {
      "id": "lox8kdz",
      "body": "My god, this is terrible. Take care 🥹",
      "created_utc": 1727300000.0,
      "score": 1
    },
    {
      "id": "loxjgt7",
      "body": "Please just know it wasn't your fault. I know it's easy to blame yourself but he made the choice in the end. Please please please understand that and I hope you  get therapy. I'm not saying that to be an asshole. I have ADHD/bipolar too and there's no way I could have made it till now without help. I can't know what you're feeling because I'm not you or in your exact circumstances but I do know it sucks and I do wish you the best. Scream into a pillow as loud as you can. Punch that fucker. Do what you need to do. (Safely) But again - it's not your fault.\n\nEdit: ok I just read you do have therapy, good. That's 1 huge step. Be really open and honest with them and if you need/can afford more appointments please let them know.",
      "created_utc": 1727303798.0,
      "score": 1
    },
    {
      "id": "loxl0fy",
      "body": "If you are in the US, 988 is not just for people who are having suicidal ideation. It is for anyone in crisis and my therapist has said to me even for anyone who just needs someone to talk to. That may give you an immediate person to talk to. Right now you may be in the stage of shock and talking to someone may or may not be helpful. ",
      "created_utc": 1727304359.0,
      "score": 1
    },
    {
      "id": "loxxbwy",
      "body": "It doesn't feel like it right now, but you will get through this. You will carry it with you, some parts of it might stay with you, but you will get through this. You are already an incredibly strong person for standing up for yourself when you did. You will get through this.",
      "created_utc": 1727308863.0,
      "score": 1
    },
    {
      "id": "loxyfck",
      "body": "This is some serious stuff to deal with please seek out some external help. This is something I feel you might need to talk about with a therapist  or grief counselor so you don't have any issues processing this entire situation.",
      "created_utc": 1727309265.0,
      "score": 1
    },
    {
      "id": "loy3lji",
      "body": "This is incredibly heavy and my heart breaks for you.  I could not begin to imagine the feelings you are experiencing right now.  What I do imagine though, is that you will be replaying the fight over and over in your mind wondering what you could have done differently, wishing that you could go back and change things, and that is very natural.  One thing you have to remember, and I know we always wish otherwise in these times, is that you can not be responsible for the actions of others.  \n\nRight now, you are at rock bottom, and you can’t even begin to imagine a future.  Right now, you have to sit in this pit and feeling.  Experience it, feel all of the emotions and don’t try to repress them.  Although there seems like no way out, please know that over time you will start to find a staircase out of this bottomless pit.  While it may be something you never fully escape, as time passes, you will grow stronger and resilient, and will be able to carry on with your life.  \n\nPlease surround yourself with all those you hold dear, and know that you are not a burden on them.  I’d highly recommend reaching out to a crisis counsellor or support network who can support you in your lowest moments.  \n\nStay strong.  Embrace every emotion.  You will make it through this.",
      "created_utc": 1727311170.0,
      "score": 1
    },
    {
      "id": "loy74uw",
      "body": "Venting here is a first step. Also, voluntarily checking yourself into a hospital could be an option for you. Please get help for yourself tonight.\n\nNot your fault. None of this is your fault.\n\nNamaste kind internet stranger, I am sending whatever good energy I can your way.",
      "created_utc": 1727312480.0,
      "score": 1
    },
    {
      "id": "loy8it1",
      "body": "Give yourself A LOT of grace moving forward. There’s a long journey of grief and processing ahead of you, don’t leave therapy. You’ll come through this, I’m sure. Still, I’m sorry it has to happen at all.",
      "created_utc": 1727313010.0,
      "score": 1
    },
    {
      "id": "loyauiu",
      "body": "I know you don’t want to hear it, am sorry and you may have to move",
      "created_utc": 1727313894.0,
      "score": 1
    },
    {
      "id": "loydgfa",
      "body": "I know you don’t want anyone to say that they are sorry, but I truly am so fucking sorry.\nI want you to be okay even when I know you aren’t because I just feel so fucking bad. \nI know everything is not okay but reach out to family or someone that can help you. I’m so sorry for your loss. I’m sorry for everything you are going through. Please be okay and everything soon.",
      "created_utc": 1727314884.0,
      "score": 1
    },
    {
      "id": "loye8fv",
      "body": "[removed]",
      "created_utc": 1727315185.0,
      "score": 1
    },
    {
      "id": "loyga9z",
      "body": "I don't know exactly what he was like, but don't blame yourself for his death. He shouldn't have put his hands on you like that.",
      "created_utc": 1727315979.0,
      "score": 1
    },
    {
      "id": "loylwqs",
      "body": "Despite what happened between you two, this is not your fault. Suicide is almost always the result of mental illness and once people have their mind made up and have a plan, there isn't much anyone can do. \n\nDefinitely keep your therapy appt but if your existing therapist is not a trauma therapist, I highly suggest getting one. I did regular CBT therapy for two years after two very important people died suddenly and it was just kinda a bandaid. I started trauma therapy this year and it has been life changing. I actually feel like I'm healing slowing but surely. Feel free to write me if you need some support. I'm here for you.",
      "created_utc": 1727318202.0,
      "score": 1
    },
    {
      "id": "loywvar",
      "body": "It’s not your fault.",
      "created_utc": 1727323001.0,
      "score": 1
    },
    {
      "id": "loywy2t",
      "body": "It's okay to not be okay. Let yourself grieve. Lay in bed for days. Eat takeout or hot pockets instead of cooking. Stare at the ceiling for hours. Wander aimlessly. A wound needs to bleed before it can heal. When you're ready, and only when you're ready, seek therapy. If you can't afford private therapy, there are many groups that are free. Take your time, the world will still be here when you get back.",
      "created_utc": 1727323039.0,
      "score": 1
    },
    {
      "id": "loz53y8",
      "body": "I've dealt with this first hand, and I wish I could tell you there was a magic fix to make it all feel alright.. but there isn't. grief is a process, but dealing with this is different than regular grief. counseling/therapy is absolutely the best course of action.\n\nit will get easier. eventually.",
      "created_utc": 1727327239.0,
      "score": 1
    },
    {
      "id": "lozabw9",
      "body": "That's awful and sucks. \n\nI moved in my GF, who later just became my friend after trying to make it work as we would have arguments and fights. We both loved each other unconditionally and trusted each other completely.  She even would hit me or throw glass at me, but i knew that wasn't really her.. She had bipolar, depression and a few other things, and that is one of the many reasons I wanted to protect her, and despite saving her life twice before, I couldn't save her in the end. Survivor's guilt. \n\n She was sick, so I was staying with family. I had a feeling something was wrong and drove through a blizzard to find her dead in bed. The last call I had with her was an argument about needing to move to a cheaper place as I was paying all the bills and was drowning financially. I didn't say a goodbye, or I love You. That was 4 years ago. Everyone is different, but it's hard to deal with, and sometimes life has a way of working out. It might be good to have someone to talk to. Family, friend, therapist. \n\nAlso, in that night, I was going to ram my SUV into a truck on the snow-covered road. I blamed myself and played the would-a, could-a, should-a, and only if games. But as she would tell me, you can never play those games, and you only drive yourself crazy if you do.\n\nSo please talk to someone, whether it be family, friend and/or therapist, and be open to people supporting you in this hard time. And don't play those 2 aforementioned games. I did that and lost.  I hope what I said helped you in some way. You are not alone. I wish you well.",
      "created_utc": 1727330262.0,
      "score": 1
    },
    {
      "id": "lozku3r",
      "body": "Well, I will not tell you it will be alright, you probably will have to carry with this the rest of your life, but hopefully you will learn to live with it.",
      "created_utc": 1727337217.0,
      "score": 1
    },
    {
      "id": "lozm2sl",
      "body": "Omg try therapy 🥲",
      "created_utc": 1727338110.0,
      "score": 1
    },
    {
      "id": "lozppn0",
      "body": "My God. This is a lot. Just know it’s not your fault though. I read that he was an alcoholic. It seemed like he was struggling with a lot more than you may have thought. I am so sorry about your loss🥺❤️",
      "created_utc": 1727340678.0,
      "score": 1
    },
    {
      "id": "lozt7g6",
      "body": "He gets physical with you and then threatens to kill himself if you don’t come back and let him do it again? Girl you’re free now honestly it sucks maybe you loved him and maybe there’s a part of you that feels like something is your fault but nah he was manipulating you, how many times did he threaten to hurt himself if you didnt want to stay in a toxic relationship? I don’t know that’s just not real love to me. You need to fly free get out of that place and find a new life with the past behind you. And maybe some therapy ? Think about it",
      "created_utc": 1727343154.0,
      "score": 1
    },
    {
      "id": "lozu8xm",
      "body": "The first thing you need to understand is this isn’t your fault. You two had a heated argument but he put hands on you. Your response was reasonable and warranted. Any time someone becomes physically aggressive it’s time for the fight to end and for them to leave for some small amount of time at the very least. Could answering his calls have saved his life? I don’t know. It’s just as likely this was a choice of pain and desperation as much as it was a way for him to manipulate the situation and not accept any consequences or responsibility for what was happening. Either way, he was not thinking about you in this moment. He was thinking about himself and escaping something, not the pain or torment it would leave you having your last interaction be him becoming aggressive towards you. Try to remember this while you are grieving and in pain, you do not deserve to be punished for protecting yourself and having a normal response to a significant other becoming violent. This was his choice and his way of handling how he treated you just before the end. \n\nI know you said not to say it, but I truly am sorry. You just went through a charged possible break up, and then the loss of someone you loved before you could even talk to them about what was going on with no chance of either reconciliation or closure. I hope you’re able to have people there to help keep you grounded while you mourn this genuinely horrific loss and to be there for you when you need to lean on someone",
      "created_utc": 1727343872.0,
      "score": 1
    },
    {
      "id": "lozwqge",
      "body": "That was his decision and not yours, however bad you feel right now you have to know that is not your fault \n\nHe put his hands on you, he killed himself in your apartment those are things you don't do to someone you love. \n\nI know I am struggling, and if I would ever decide to do such a thing (I wouldn't I am not suicidal)  it for sure would be far from home to avoid my wife and kid suffering. \n\nHim doing that at your place I see as his last \"fuck you\" and way to make you additionally suffer like some kind of revenge.",
      "created_utc": 1727345492.0,
      "score": 1
    },
    {
      "id": "lp0lget",
      "body": "It was a mistake, and he took himself from you, as well as your ability to feel peace. I hope you find it, though it will take some time.",
      "created_utc": 1727357050.0,
      "score": 1
    },
    {
      "id": "lp1g2r3",
      "body": "God damn I don’t wish this even to my worst enemy. What a nightmare. I can only send you a big hug. I hope you find help and can get over this",
      "created_utc": 1727367028.0,
      "score": 1
    },
    {
      "id": "lp1pat0",
      "body": "Sounds like my ex enter a reason x except there was heroin involved",
      "created_utc": 1727369856.0,
      "score": 1
    },
    {
      "id": "lp2nxle",
      "body": "omg i’m so sorry that your deal with this and it all happened. know that none of this is your fault and you can not have controlled his decisions. it will be hard to process and it won’t be easy so don’t be hard on yourself for grieving. grieve and try and process it in an health environment with support and do not be scared to admit you need someone if you do as dealing with this on top of your own mental health struggles is so difficult. i hope you find peace with it but it is okay to not be okay right now. maybe talking to someone will help or confiding in a friend for some company will benefit but please do not hold it in, cry, scream, be angry; let yourself feel those feelings bc the more you let them out the more space you have for peace and comfort over time. it will be okay eventually either time but right now, grieve and know you don’t have to be okay right now but don’t let it consume you.",
      "created_utc": 1727380661.0,
      "score": 1
    },
    {
      "id": "lp2tjmp",
      "body": "My friend went through the same hell. They had a big fight, and her bf stormed to balcony and jumped down. She had to see that. Of course she was shocked and devastated, and it took a long time to see any spark in her eyes, but it came back in a time. Now it's over 10 years. He did that on my birthday, and every year i remember that, and he wasn't a close friend to me. But that really left a mark on me too. I can only imagine what's it like to witness something like that. I hope you'll recover fast. ✊🏻 Because you will.",
      "created_utc": 1727382450.0,
      "score": 1
    },
    {
      "id": "lp3bdgn",
      "body": "Hi OP,   \nI feel compelled to respond to you based on my previous experience. I lost my baby sister to a fentanyl overdose earlier this summer. After the first month I was so sick of hearing \"I'm sorry for your loss.\" It's valid to not want to hear it anymore.  \nThe grief is so difficult but the guilt is a different beast in and of itself. I learned from my therapist that it is very natural for us to feel guilt with a sudden loss, but it is important to not dwell on it.   \nPlease take time for yourself and some self-care. DMs are open if you need someone to talk to or want any other info. \n\nTake care.",
      "created_utc": 1727388308.0,
      "score": 1
    },
    {
      "id": "lp3dwnx",
      "body": "My heart goes out to you. My boyfriend took his own life last December, and I know this is a nightmare to go through. You’re right—it’s not OK, so please know that it’s OK to be angry and whatever else you’re feeling.",
      "created_utc": 1727389196.0,
      "score": 1
    },
    {
      "id": "lp3rud2",
      "body": "Someone killings themselves is never your fault.\n\nThese things take time and likely he was thinking about this for a lot time.\n\nIt’s never just one situation that leads someone to take their own life. Suicide is the end stage of depression.\n\nThe poor guy had been struggling mentally for a long time; you didn’t kill him and you didn’t “make him kill himself”.\n\nPeople are responsible for their own decisions. Unfortunately he just no longer is able to learn from his mistakes.\n\nIf you had known what was going on in his head you might have been able to do something, but most people seriously downplay how bad they are because part of depression and suicide is often “not wanting to be a burden”.\n\nHe was experiencing pain for a long period of time, and his decision to take his own life was, unfortunately, an awful attempt to relieve himself of that pain.\n\nThis is not your fault.",
      "created_utc": 1727394279.0,
      "score": 1
    },
    {
      "id": "lp5m1ar",
      "body": "Hey, I know you might not want to hear it but it is not your fault. My aunt's husband killed himself after they broke up, I told her 'your not a mind reader, you couldn't have known' and so are you...your not a mind reader, nobody is really aware of what someone is feeling or not feeling. So, remember you; Kicked him out a valid reason, he placed the latch on the door so you couldn't come in even if you wanted to. Speak to someone if you're not already, I hope you find peace in your situation.",
      "created_utc": 1727425987.0,
      "score": 1
    },
    {
      "id": "lp6op45",
      "body": "Maybe this sounds heartless, but I think you need to look at it right now from a perspective that he was clearly very immature, and he was unable to take care of himself or control himself and you aren’t a babysitter. You are not responsible for the way somebody chose to deal with the consequences of their actions. You freaking out and being beside yourself was literally the whole point. He clearly wasn’t doing well mentally already to just go and off himself over something so small. It’s not your fault that he didn’t feel like his life had any worth idk I have bipolar but I also low-key think that I am a psychic and I’m not about to do some weird shit and give you a message or something don’t worry. For some reason though I feel like something isn’t right with the story and I’m not saying that you’re lying I feel like he was trying to do some shit to make you feel bad and then it went too far idk you could spend the rest of your life, crying and feeling bad about it or if you really cared that much build your life up and do something cool for his spirit. Energy never dies just morphs into something else we are literally made of the same carbon that’s been in the stars in the dirt, inside of millions of other living beings over millions and millions of years. Nobody’s ever really gone but the world’s a shit show anyway. I think we as a society need to redefine the way we look at suicide because the “ victims “ are often opting out of something much more painful. It’s like people want others to keep suffering so that they can avoid the grief and stay comfortable. Like when people just won’t let go of a super old dog, you know?",
      "created_utc": 1727445457.0,
      "score": 1
    },
    {
      "id": "lpff7ol",
      "body": "It's totally normal for you to be feeling so horrible. But just know it's not your fault at all there really isn't anything you could have done.",
      "created_utc": 1727573235.0,
      "score": 1
    },
    {
      "id": "ltiqkbw",
      "body": "It’s his choice. It’s not yours. He chose to waste his life on an argument. And as you can see life is going to continue to go on without him. Don’t blame yourself or feel sorry for him. He clearly didn’t even have the decency to take his life in a private location where atleast you would not find out. Why at your property? HE WANTED TO MAKE YOU SUFFER FOR NOT RESPONDING. Typical narcissist abusive behavior. And if it’s not you it would have been another girlfriend going thru this.",
      "created_utc": 1729781252.0,
      "score": 1
    },
    {
      "id": "md4z7qv",
      "body": "Hey I know it’s not the same but my sister’s boyfriend died in a car crash. He had dropped her off and as he drove home he skidded into a tree. She replays her last interaction in her head over and over. She blames herself for it. “If he hadn’t taken her home, he wouldn’t of crashed”, “if she had still been in the car she could of saved him or prevented it”, “if she had invited him in to stay he wouldn’t of died”. Their goodbye was not special or different than any other goodbye except he didn’t come back and that haunts her. But it wasn’t her fault and neither is it yours!\nShe has ADHD and has struggled with her mental health. When he died she took an overdose (survived) because she couldn’t cope with what had happened, it was really bad for a long time but Years later she fell in love with my brother in law and they got married. The message here is that she got through it!! even though it was really difficult, she came out of the other end, happy for the most part!\nPlease just don’t blame yourself because he made a choice to put his hands on you and the consequence was that you didn’t feel safe and you wanted him to leave. Anyone else would have done the same! \nPlease forgive me if I sound blunt because I think this is really awful and devastating for you and for him. I can’t imagine being in this position. He was obviously going through something horrible but no matter what the outcome, you didn’t do anything wrong. \nyou need to surround yourself with friends and family. Talk to a therapist that deals with grief and trauma specifically. Just give yourself time and be kind to yourself. \nYou will get through this even if you don’t think you can.",
      "created_utc": 1739740190.0,
      "score": 1
    },
    {
      "id": "lou7b7l",
      "body": "Not your fault \nMove quickly \nSeek therapy",
      "created_utc": 1727263780.0,
      "score": 1
    },
    {
      "id": "lou9d5f",
      "body": "THIS IS NOT YOUR FAULT. Everything in the way you acted was right, you were right to protect yourself first, you were right for asking him to leave.",
      "created_utc": 1727264763.0,
      "score": 1
    },
    {
      "id": "loumvya",
      "body": "This is just awful!  I know you must have a million thoughts racing around in your head. It’s gonna take a very long time to process, unpack and deal with this. Please don’t rush it. It’s the sane 5 stages of grief as any other loss. You may get to stage 3 or 4 and slide back to 1 or 2. That’s normal. Please take care of yourself and reach out for anything. Even if you just need a friend to come watch a movie with you. This is NOT your fault and I’m so sorry this happened. 💔",
      "created_utc": 1727270317.0,
      "score": 1
    },
    {
      "id": "loxcf2f",
      "body": "He put his hands on you. He was abusive. He tried to hurt you. He was unwell. You deserve better. Please don't blame yourself. It is not your fault. I'm very sorry for your loss, but it sounds like you're better off without him. I wish the outcome were different for your sake.",
      "created_utc": 1727301302.0,
      "score": 1
    },
    {
      "id": "loxm9lj",
      "body": "Its just survivors guilt, ride the wave amongst trusted people and you’ll pull through. Or you wont",
      "created_utc": 1727304809.0,
      "score": 1
    },
    {
      "id": "loxozi0",
      "body": "Sorry",
      "created_utc": 1727305804.0,
      "score": 1
    },
    {
      "id": "loxq14u",
      "body": "none of this is your fault but i wouldve called for help right away after he assaulted you. telling an unhealthy person you're leaving or they need to leave is a very dangerous situation to be in by yourself. i'm sorry this happened to you. even if you had the option to try to stop it i dont think it would've been safe for you.",
      "created_utc": 1727306183.0,
      "score": 1
    },
    {
      "id": "loy3x6q",
      "body": "Your boyfriend was a dick for doing this to you. Wtf.",
      "created_utc": 1727311290.0,
      "score": 1
    },
    {
      "id": "loyt07u",
      "body": "Had a bad altercation with my child’s mom & gotta go to court for it been going through it \n\n\nAlmost felt like I would end up like that too unfortunately",
      "created_utc": 1727321208.0,
      "score": 1
    },
    {
      "id": "lowcw5j",
      "body": "[removed]",
      "created_utc": 1727290125.0,
      "score": 0
    },
    {
      "id": "lou07jn",
      "body": "[removed]",
      "created_utc": 1727259974.0,
      "score": -8
    },
    {
      "id": "lou0861",
      "body": "[removed]",
      "created_utc": 1727259984.0,
      "score": -9
    },
    {
      "id": "loua2st",
      "body": "[removed]",
      "created_utc": 1727265089.0,
      "score": -5
    },
    {
      "id": "lowomp2",
      "body": "[removed]",
      "created_utc": 1727293766.0,
      "score": -1
    },
    {
      "id": "lowyvgu",
      "body": "[removed]",
      "created_utc": 1727296910.0,
      "score": -1
    },
    {
      "id": "loxqv15",
      "body": "[removed]",
      "created_utc": 1727306486.0,
      "score": -3
    },
    {
      "id": "lotlynw",
      "body": "[removed]",
      "created_utc": 1727250201.0,
      "score": -27
    },
    {
      "id": "lotjky1",
      "body": "yes all of that but i just dont know. i dont want to do this i tried listening to music and cant, cant watch anything, cant play games, cant eat… everything i do i’m reminded. but i have therapy thursday",
      "created_utc": 1727248543.0,
      "score": 405
    },
    {
      "id": "lovimcl",
      "body": "i just wish he would’ve given himself time to sober up and calm down before making such a rash and stupid decision. but its not that easy",
      "created_utc": 1727280747.0,
      "score": 115
    },
    {
      "id": "lotjr3z",
      "body": "he was drunk i was sober. i work at a bar and he came to see me but ended up getting shitfaced along w behavior that i called him out for when i got off work and thats when the fight started. he was an alcoholic. i kept trying to turn him into a stoner bc when he would get drunk he’d get angry and nobody gets angry when theyre stoned. for a while it seemed like we were ok. but i guess it was never truly ok to him",
      "created_utc": 1727248658.0,
      "score": 118
    },
    {
      "id": "lou02t3",
      "body": "Tetris",
      "created_utc": 1727259895.0,
      "score": 59
    },
    {
      "id": "lou9izv",
      "body": "Really? That’s really cool. I’ve never had EMDR but do find mindless games soothing.",
      "created_utc": 1727264838.0,
      "score": 16
    },
    {
      "id": "lup0z2g",
      "body": "Do you think it has something to do with it? How interesting!",
      "created_utc": 1730382277.0,
      "score": 2
    },
    {
      "id": "lovr2k9",
      "body": "[There is no actual evidence](https://www.madinamerica.com/2021/10/tetris-trauma-viral-twitter-thread-master-class-misleading-psych-research/) to suggest that playing Tetris helps with trauma. Please vet things like that before suggesting them in the future, especially to someone who has just experienced something very very serious. They need actual evidence based therapy from a trained professional, not junk science that went viral on social media.",
      "created_utc": 1727283376.0,
      "score": 0
    },
    {
      "id": "lovj9km",
      "body": "i’m hopping from friends and family’s houses. i dont think i can ever go back. i couldnt even go into the complex my friend had to get my car for me.",
      "created_utc": 1727280948.0,
      "score": 12
    },
    {
      "id": "lpknbjf",
      "body": "This… most people are good intentioned and don’t know what to say so they say “I am sorry”because deep down they really feel for you. You don’t have to minimize your experience by saying you’re ok. Be authentic. \n\nI am sending you love and light dear one.",
      "created_utc": 1727653369.0,
      "score": 1
    },
    {
      "id": "lovjwfx",
      "body": "i know he was an asshole and the relationship was toxic but i never wished this and i’d rather him hate me and be alive than this. its like two different griefs are hitting me: breakup and a death. its a complicated feeling. i went to the courthouse the morning before i found him to file a restraining order and when they set down the form i broke down because even though he had been so horrible to me, i still didnt WANT to do any of that because i still loved him. i just thought he was barricaded in my apartment, i never thought it would end up like this",
      "created_utc": 1727281148.0,
      "score": 31
    },
    {
      "id": "louys9k",
      "body": "Im not gonna downvote you or anything but I don’t think a lot of that’s helpful or what she said implied that she wanted to hear more about how he was a bad dude",
      "created_utc": 1727274467.0,
      "score": 15
    },
    {
      "id": "lov5hrd",
      "body": "Either way, what I’m saying is it’s not your fault. He made the choice, not you.",
      "created_utc": 1727276624.0,
      "score": 2
    },
    {
      "id": "louffkg",
      "body": "I understand you're trying to make OP feel better but you're being very unfair about people who commut suicide and you're making large assumptions here.\n\nHe doesn't deserve life? What a horrible thing to say. Stay away from people who are troubled? If everyone followed that advice it would further isolate people who need the opposite.",
      "created_utc": 1727267418.0,
      "score": 17
    },
    {
      "id": "lousrpr",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727272442.0,
      "score": 5
    },
    {
      "id": "louslmq",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727272384.0,
      "score": 1
    },
    {
      "id": "lp1ewgm",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366661.0,
      "score": 1
    },
    {
      "id": "lp1f4th",
      "body": "We do not permit requesting or suggesting the conversation move to another venue. Users who violate this rule may be banned from r/mentalhealth.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366734.0,
      "score": 1
    },
    {
      "id": "lp1fml0",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366888.0,
      "score": 1
    },
    {
      "id": "loun9pm",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727270461.0,
      "score": 1
    },
    {
      "id": "lou3krv",
      "body": "I hope you aren’t suggesting that OP could have prevented her partners suicide",
      "created_utc": 1727261886.0,
      "score": 8
    },
    {
      "id": "lp1gamq",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727367096.0,
      "score": 1
    },
    {
      "id": "lp1g6em",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727367058.0,
      "score": 1
    },
    {
      "id": "lp1fo4g",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366902.0,
      "score": 1
    },
    {
      "id": "lp1fpe1",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366913.0,
      "score": 0
    },
    {
      "id": "lp1fqni",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366924.0,
      "score": 1
    },
    {
      "id": "lotr7gj",
      "body": "Get help",
      "created_utc": 1727253927.0,
      "score": 6
    },
    {
      "id": "lou2knl",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727261339.0,
      "score": 3
    },
    {
      "id": "lotohg0",
      "body": "[removed]",
      "created_utc": 1727251989.0,
      "score": 1
    },
    {
      "id": "lotjqmf",
      "body": "Let's hope therapy can help. You must be in shock still. Glad you have that appointment though.",
      "created_utc": 1727248649.0,
      "score": 234
    },
    {
      "id": "lou3hiu",
      "body": " You need to let grief run it's course. Feel, see, and remember everything. It's the fastest way to recovery. Try not to blame yourself, even though you probably will. Understand once someone gets in the headspace to take their own life, it's up to them to talk themselves out of it. Been there.. DMs are open",
      "created_utc": 1727261837.0,
      "score": 56
    },
    {
      "id": "lotzqxd",
      "body": "Try to use your therapy appointment as something to look forward to. Think of it as a positive step to trying to heal. Even something small like this to look forward to can help.",
      "created_utc": 1727259696.0,
      "score": 65
    },
    {
      "id": "lou7m72",
      "body": "Hold on, friend. This is going to suck balls deep. It’s really focking shitty and it’s really focking bad too. You need to surround yourself with those you trust and love and put yourself in a space where you can just be. Without having to talk or feel or do. Sometimes we just become numb in times like this and whatever you’re feeling, or not, is okay too. When we lose people like this, speaking from personal experience, it can feel like an avalanche is suffocating you, but try to remember that it is not and to breathe. I know it sounds cheesy and stupid, trust me, I was angry that it actually worked, but breathing through anguish and misery can significantly increase oxygen to your brain, giving you a natural release. It really helps to think more clearly. Don’t give up. Put one foot in front of the other, or if it’s a centimeter at a time, that’s still progress. I know we’re all strangers here, but we do care about you, wherever you are, because many of us have been here, too.",
      "created_utc": 1727263930.0,
      "score": 28
    },
    {
      "id": "lovqjg3",
      "body": "Dying wish - until mourning comes , check it out.",
      "created_utc": 1727283215.0,
      "score": 7
    },
    {
      "id": "lozm5ek",
      "body": "You’ll be depressed for a while but it eventually gets better that’s just the brains trauma response you’ll feel numb and it will just randomly hit you eventually it can be regulated with medication and therapy etc.",
      "created_utc": 1727338162.0,
      "score": 3
    },
    {
      "id": "lp20l76",
      "body": "It’s hard but time heals. I’m very sorry for your loss.",
      "created_utc": 1727373354.0,
      "score": 3
    },
    {
      "id": "lozvcqj",
      "body": "So..I came here to discuss something similar that happened to me in 2021, but I’d rather focus my energy on you, now. I’ve read thru some of your comments. I’ve read some really great responses that I will take personal insight from. I don’t think I have anything new to offer. I just want to impart a little hope, maybe?\n\nComplex grief is so cruel. This will absolutely be a “before and after” moment in your life. You will probably carry the pain and unfair degree of remorse forever. It will lessen, of course. But it won’t leave. Again..I was up at some ungodly hour to post my own tragedy, just now. \n\nHere is a small difference that 3 years have brought. While I am up and hurting, I opted to sit with it vs. run for the Xanax. I sit with it more and more. It’s true what they say about how grief is like an ocean wave. You’re flailing in the undercurrent of a tsunami, rn. But the reality is, there is no water. \n\nHere is a big difference..this type of pain can be profoundly motivating. It reminds me of the motivation of terror. I experienced that, once. I still marvel at the speed I ran and the ground I covered. I am a stout, pokey thing, and I experienced a “lift the car off a child” moment. Only in this case, the terrifying thing has happened. It is real. The child is dead. Instead of a quick burst of super adrenaline to fix an immediate, but potentially FIXABLE issue, you will instead be numbed into a sort of functional death march..but believe me when I say this..if you can survive the death march, you will be an utterly changed person on the other side of it. \n\nPoor stranger, I dearly hope you can wait to meet that person.",
      "created_utc": 1727344604.0,
      "score": 2
    },
    {
      "id": "lozx9xt",
      "body": "Meds, the only way I got through it was medication and therapy group",
      "created_utc": 1727345833.0,
      "score": 2
    },
    {
      "id": "loy852v",
      "body": "You are not alone. 9 years ago my friend was with me texting her drunk alcoholic husband to reach out to his sponsor.\n\nShe was with us because he had a tendency to come home drunk and terrorize her. She chose to do what Alanon advised and wend no contact except telling her husband to contact his sponsor or go home to bed and they will talk in the AM.  \n\nHe didn’t make it but she rebuilt her life over the past 9 years. We celebrate the good times and forgive the disease. \n\nNamaste 🙏",
      "created_utc": 1727312864.0,
      "score": 43
    },
    {
      "id": "lovtpki",
      "body": "I understand. I’ve lost some beautiful amazing people to suicide. It took me a long time to feel at peace, and even then it still stings at times. Please take care of yourself ❤️‍🩹",
      "created_utc": 1727284191.0,
      "score": 1
    },
    {
      "id": "lpimf2s",
      "body": "Sadly even if he would've sobered up that night, there would've been another night like this and it's out of your control. it's like living in a hellish cycle. I hope you can find some peace soon OP \n\nsending love u got this. Will take time",
      "created_utc": 1727629491.0,
      "score": 1
    },
    {
      "id": "lourk2v",
      "body": "Alcoholism is hard. For everyone. \n\nI’m sorry. People have said it’s going to suck and it totally is. You sound pretty grounded. I hope you don’t blame yourself. We cannot control or predict another adults behavior no matter what.\nThis isn’t your fault. \n\nI wish we could waive a wand but this is going to be a **process**. Look up the stages of grief. Be patient and kind to yourself. \n\nI’m not sure you can feel it, but I’m mad for you. Substance abuse causes selfish behavior. I’m angry someone gave you this mess to endure. Just another feeling to deal with, on top of sadness. You will be ok, eventually. Please find your support network, or I hope they find you. Huge hugs",
      "created_utc": 1727272021.0,
      "score": 16
    },
    {
      "id": "loujxdc",
      "body": "People still get angry when they’re stoners they just get more angry when they’re withdrawing or not smoking. My ex was a stoner and he was actually the most angry person I knew. Smoking is a crutch not a medicine. Everyone needs a crutch once in a while and that’s okay, but just know that probably would not have saved him either. \n\nThis is not your fault. Suicide is a selfish choice, usually made from a place of deep “brain pain,” but it was 100% about him and not you.",
      "created_utc": 1727269195.0,
      "score": 51
    },
    {
      "id": "loviul6",
      "body": "So much I could say here..",
      "created_utc": 1727280818.0,
      "score": -5
    },
    {
      "id": "lovj32t",
      "body": "i do love me some tetris",
      "created_utc": 1727280891.0,
      "score": 45
    },
    {
      "id": "loxjc2o",
      "body": "Gotta love auto correct!",
      "created_utc": 1727303750.0,
      "score": 7
    },
    {
      "id": "loun7il",
      "body": "There’s this game on Switch (maybe other platforms too?) called Unpacking. You’re literally just unpacking boxes each time the character moves to a new home. They all have specific rooms they belong in, but it’s mostly just mindless activity. I find it soooo soothing when I’m stressed or upset.",
      "created_utc": 1727270438.0,
      "score": 26
    },
    {
      "id": "lovq7da",
      "body": "[no](https://www.madinamerica.com/2021/10/tetris-trauma-viral-twitter-thread-master-class-misleading-psych-research/). There was some initial (poorly done) research and resultant headlines at first but it didn’t stand up to scrutiny. There’s no evidence that Tetris has any benefit to people who have experienced trauma",
      "created_utc": 1727283111.0,
      "score": 1
    },
    {
      "id": "lp51lh4",
      "body": "I have had EMDR therapy and use Tetris as per my psychologist (when I'm out and need to use my therapy). Thankyou - my suggestion is based on life experience",
      "created_utc": 1727412976.0,
      "score": 1
    },
    {
      "id": "lovs0eq",
      "body": "That’s good I’m happy to hear you don’t need to stay at that place. That’s completely understandable. Surround yourself with loved ones (both friends and family) who can support you right now. And again, feel free at ANY time to reach out via DM’s. Id be so happy to support you however I can. Things will get better I promise",
      "created_utc": 1727283659.0,
      "score": 7
    },
    {
      "id": "lovog6i",
      "body": "I know how you feel babe. Trauma bonds are gut wrenching and extremely difficult to break away from. They do the absolute worst to you, and you still somehow see the good in them, even if they SA you or physically and mentally abuse you with malicious intentions. You have a big heart to wish he was still alive after everything you’ve been through. I just can’t stress this enough— it is NEVER your fault. A man can and will absolutely ruin your life and turn it upside down. The man that abused me happened to get me pregnant, and after I broke up with him, not only did I have to contact police to get him to stop stalking my friends and family and me- but I also almost died from the abortion due to bleeding. It was a huge wake up call for me to look deep within myself and figure out why I’m attracted to the toxicity, and what I truly wanted in life. It also taught me that I have to be extremely careful about who I give my mind, body, and heart to. Your love is SO precious as it is nearly unconditional, and it has to be earned. I can tell from my short interactions with you that you have a heart of gold, no doubt. Your mind and body is going to be stuck in survival mode for a while as you just experienced a harsh trauma. Your heart will be shattered to pieces, and understandably so. It’s gonna take a lot of time and self care to recover from this. After all you’ve experienced, you absolutely have the right to put your needs and wants first, regardless of what ANYONE tells you to do. Let this experience motivate and empower you to grow as a woman. Also, if you feel a little relieved in this mix of emotions- don’t ever feel shame for that. Any feelings you have during this time, or any time for that matter, are absolutely valid. My heart aches for you from a place of empathy. I hope it’s only up from here for you in your life. I am so sorry life is unfair",
      "created_utc": 1727282569.0,
      "score": 1
    },
    {
      "id": "lov0h94",
      "body": "[removed]",
      "created_utc": 1727275022.0,
      "score": 1
    },
    {
      "id": "lp8k94o",
      "body": "What did they say?",
      "created_utc": 1727467474.0,
      "score": 1
    },
    {
      "id": "lou016p",
      "body": "Rent A Girlfriend Anime PFP?\n\nRight?\n\nWhat happened in the manga at last?\n\nI haven't read it.",
      "created_utc": 1727259867.0,
      "score": -6
    },
    {
      "id": "lp1gew7",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727367132.0,
      "score": 1
    },
    {
      "id": "lotjup0",
      "body": "its 3 am where i am. i dont want to go to sleep. i dont want to dream.",
      "created_utc": 1727248726.0,
      "score": 159
    },
    {
      "id": "lotjwtw",
      "body": "i hope so. only time can really help anything imo. but i honestly dont know how im going to feel ok again",
      "created_utc": 1727248766.0,
      "score": 66
    },
    {
      "id": "lp2c48s",
      "body": "i had therapy yesterday and set an emergency appointment with my psychiatrist for friday because i cant sleep",
      "created_utc": 1727376958.0,
      "score": 3
    },
    {
      "id": "lowmk9x",
      "body": "i’m angry too. i can never go home again i dont even want to be in my hometown anymore. and im angry that i can’t talk to him or see him. i’m angry that he couldn’t love himself properly or see how much i and his friends and family love him.",
      "created_utc": 1727293137.0,
      "score": 9
    },
    {
      "id": "lovixce",
      "body": "thank u. i slept from like 7 am to 11am. i cant do anymore everytime i close my eyes i keep reliving what happened and having to answer the detective’s questions and shit. i heard his car down the road all night",
      "created_utc": 1727280842.0,
      "score": 23
    },
    {
      "id": "lovgxjh",
      "body": "Second this. I have had extreme anger from/while on weed, including throwing a dish at my partner",
      "created_utc": 1727280212.0,
      "score": 5
    },
    {
      "id": "lovj4nl",
      "body": "i have that game!",
      "created_utc": 1727280905.0,
      "score": 13
    },
    {
      "id": "loydn4o",
      "body": "That sounds relaxing! My favourite game since I was a kid was always Harvest Moon. The repetitive nature of the daily routine feeding  the animals, and watering the crops was so relaxing. Ironically I’ve never been able to maintain a real life routine but I love it in the game",
      "created_utc": 1727314956.0,
      "score": 4
    },
    {
      "id": "lpat4xa",
      "body": "Fair enough, I find I do need my mindless scrolling, game or tv time each day though. It helps me decompress and regulate but maybe that’s just my combination of ADHD, trauma and mental  illnesses.",
      "created_utc": 1727501042.0,
      "score": 1
    },
    {
      "id": "lp1d2zz",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1727366099.0,
      "score": 1
    },
    {
      "id": "lou2asu",
      "body": "I tried to read some chapters and I died of cringe \n\nThis is my ghost typing rn",
      "created_utc": 1727261188.0,
      "score": 1
    },
    {
      "id": "lotjx3p",
      "body": "You can write to me if you like.",
      "created_utc": 1727248771.0,
      "score": 166
    },
    {
      "id": "loxc3kr",
      "body": "Write your thoughts out. It does not have to make sense. Just put pen to paper and start writing ANYTHING that flows to your fingertips.",
      "created_utc": 1727301193.0,
      "score": 37
    },
    {
      "id": "low7dn1",
      "body": "Has anyone already suggested playing Tetris? Supposedly it can help immediately post-traumatic event to help ward off PTSD.",
      "created_utc": 1727288404.0,
      "score": 31
    },
    {
      "id": "low2kg7",
      "body": "One step at a time. \n\n\nMake sure you eat something and get some water.",
      "created_utc": 1727286912.0,
      "score": 9
    },
    {
      "id": "loxhxvl",
      "body": "It won't fade away overnight but a lot of things will become a bit numb for a bit. You've done a crazy amount of work already, and there's lots to go but in smaller chunks.  \n\nTake note to listen to your needs (including when the need is \"I don't fucking know I just don't want to think\"), and to keep in mind that no, this wasn't your fault. Because it's really not. We might suffer and influence each others, but you gave efforts and time and space (in the heart and in the physical world) to that person.  \n\nAs somebody who's been at that edge and back: he just chose differently, in his own confusion and pain in that moment. A lot of things oscillate in life, from the earliest moments to every instant, and sometimes the wave is too strong. You alone can't stop an ocean in somebody else, nobody can, not even him in this case. I just wish for you to treat your own oceans well. Hugs.",
      "created_utc": 1727303247.0,
      "score": 3
    },
    {
      "id": "lovjz3s",
      "body": "Well I’m so sorry you’re going through this. I’ve been through similar, though not in my own home. I can’t even imagine. Those closest to you often don’t know what to say, so you might notice people become a bit withdrawn. It’s okay to be sad, it’s okay to need time for yourself. Every single day won’t be hard, but many will. Just remember grief is not linear, peaks and valleys.",
      "created_utc": 1727281171.0,
      "score": 6
    },
    {
      "id": "loyi6hw",
      "body": "Oh i play story of seasons on switch as well. Same plot!",
      "created_utc": 1727316715.0,
      "score": 1
    },
    {
      "id": "lou2h88",
      "body": "Nice.\n\nYou need to read berserk now to get resurrected.",
      "created_utc": 1727261287.0,
      "score": 3
    },
    {
      "id": "loy8eix",
      "body": "Wow, really? Interesting.",
      "created_utc": 1727312964.0,
      "score": 3
    },
    {
      "id": "lozsgnz",
      "body": "Tetris specifically or video games in general? Never heard that one before!",
      "created_utc": 1727342632.0,
      "score": 1
    },
    {
      "id": "lpatbv4",
      "body": "Haha might need to get that. I have a few of the 3DS games which are so cute. Haven’t played for ages though, I go through phases. I also have my original 90s harvest moon and gameboy too but our parents sold the Super Nintendo 😭",
      "created_utc": 1727501156.0,
      "score": 1
    },
    {
      "id": "lournyn",
      "body": "Absolutely. On my way to resurrect myself.",
      "created_utc": 1727272059.0,
      "score": 1
    },
    {
      "id": "lozsisd",
      "body": "Tetris specifically!",
      "created_utc": 1727342673.0,
      "score": 3
    }
  ]
}