{
  "id": "1kduy16",
  "title": "I think my online boyfriend killed himself",
  "selftext": "I made an account because i need to talk about this. I'm closeted and gay, have been for a long time. and I met this guy my age, and we talked for a while, eventually he wanted to do a long distance thing. it was going great for months. last night I was sick and I went to bed early, just texting him goodnight and that I love him. I wake up to see that he said \"I'm killing myself, I love you, I'm sorry, but I cant take it anymore\". I don't know what to do, I feel its my fault since I didn't stay up, I wasn't there for him, and now I don't know what do to. I've tried to call him, and got nothing. I genuinely have just been curled up in bed bawling my eyes out.",
  "created_utc": 1746284414.0,
  "score": 545,
  "num_comments": 68,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1kduy16/i_think_my_online_boyfriend_killed_himself/",
  "comments": [
    {
      "id": "mqdpkd2",
      "body": "**Hello u/!**\n\nThank you for using a content warning. \n\n---\n**If you are in immediate crisis:**\n- Visit [Find A Helpline](https://findahelpline.com/i/iasp) for local hotline info.\n- Check [Hotline FAQs](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) for guidance.\n- Consider posting on r/suicidewatch or messaging their moderators [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch).\n\n---\n**For suicidal thoughts or self-harm:**\n- [HelpGuide](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) offers coping tips.\n- You are not alone – see personal stories on YouTube.\n- Practice grounding exercises or listen to your favorite music.\n- Refer to [Find A Helpline](https://findahelpline.com/i/iasp) for more resources.\n\n**Take care and stay safe!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1746284415.0,
      "score": 1
    },
    {
      "id": "mqdr2l1",
      "body": "I had a similar situation many many many years ago although I wasn’t dating the person he was 13 at the time and took his life because his parents told him he wasn’t good enough and it’s haunted me for awhile knowing I was the last person he talked to and I felt helpless like it was somehow my fault for not being there at the time unfortunately all you can do is wait a few days and hope they come back online remain positive and optimistic",
      "created_utc": 1746284895.0,
      "score": 208
    },
    {
      "id": "mqdqp07",
      "body": "You need to call a helpline asap",
      "created_utc": 1746284774.0,
      "score": 595
    },
    {
      "id": "mqdtyt2",
      "body": "Op- first and foremost, this isn’t your fault. Secondly, I’m so sorry that this is what you woke up to today. \n\nDo you know anyone in his area? Any mutual friends? You do not have to out yourself, but you can reach out to his friends or family as a concerned friend- they do not need to know the details if you’re not ready to come out. \n\nWhat I hope didn’t happen is that perhaps this was his way of cutting things off and he’s not committed suicide. I have heard several stories where online friends or lovers go ghost out of no where, sometimes faking their own deaths, in order to avoid awkward breakups. It is entirely possible that he is still alive. \n\nAnother possibility is that an attempt was made and they are hospitalized, but ultimately will survive. \n\nDo what is in your control, but if you have no one to call for a wellness check (i.e. if you don’t know his address or any friends/family of his), then try to get in a support group and work through this. Believe what you need to believe to make it easier on you. I sincerely hope you get closure. \n\nSending you a lot of love, dear.",
      "created_utc": 1746285811.0,
      "score": 98
    },
    {
      "id": "mqdu3km",
      "body": "first and foremost these things are NEVER your fault. i’m really sorry this is happening, and i hope he responds soon. Do you know of any other methods of contact to reach him or any friends/family?",
      "created_utc": 1746285852.0,
      "score": 43
    },
    {
      "id": "mqhkge1",
      "body": "You are all awesome, you people got me through the day and kept my hopes high, which they still are, goodnight you wonderful people, I’ll try to update this if I get any word from him",
      "created_utc": 1746333722.0,
      "score": 21
    },
    {
      "id": "mqe2yti",
      "body": "It's possible that he attempted, but maybe he got caught and taken to a hospital. Or he stopped before he could try and admitted himself. I think they do like 48-72 hour holds. And thats if they suspect you're okay and release you.\n\nHope he apologizes to you though, I cant imagine feeling so scared and helpless not knowing where he went. Especially that you were sick and may be blaming yourself. Not a good way to leave at all",
      "created_utc": 1746288619.0,
      "score": 13
    },
    {
      "id": "mqeqr9j",
      "body": "Oh honey please don't blame yourself. I went through the unexpected loss of a boyfriend, and I know how much it hurts. Granted, mine didn't attempt to kill himself, but it came out of nowhere and the pain was immeasurable. I blamed myself too for a long time. I thought maybe if I had seen the signs or stayed an extra night he'd still be alive.\n\nPlease hear me when I tell you this: This. Is not. Your fault. You couldn't have known this would happen. You had no control over him or anything he does. Someone told me something that has always stuck with me: \"It's easier for us to accept blame, than to just accept that things happen sometimes.\" It's a way for us to still somehow feel in control of the situation and make sense of things (even though we had no control over any of it in the first place).\n\nHopefully, he's just somewhere safe where he can't harm himself. I'm so sorry you have to go through this. Take your time with this and keep us updated. You're not alone. You are loved and supported here.",
      "created_utc": 1746295871.0,
      "score": 11
    },
    {
      "id": "mqep3hd",
      "body": "Look up the police number in his area. Call them, explain and give them what info you have (location, his number, full name, parents name, whatever you got). Tell them to do a wellness check. Do it now. If you need help looking this up, dm and I can try to help. This is not your fault. 💜",
      "created_utc": 1746295368.0,
      "score": 17
    },
    {
      "id": "mqdv04f",
      "body": "I'm really sorry fo you and your situation.❤️ It sounds horrible. Can you track any of your boyfriend's relatives or friends on social media to ask them about what happened? Maybe you could manage to get in contact with them and find out more. I think that you should see a professional therapist. However a very similar scenario once happened to me. It was a horrible experience but in my case it turned out that the person wasn't dead. I don't want to give you false hopes but maybe you should try to contact someone who knows him irl. If it actually happened then I'm very sorry and I hope you will be able to seek professional help and heal from this❤️",
      "created_utc": 1746286135.0,
      "score": 5
    },
    {
      "id": "mqdx3wo",
      "body": " if you know where he lives at, try contacting the nearest police department near him:(",
      "created_utc": 1746286791.0,
      "score": 5
    },
    {
      "id": "mqhrwwu",
      "body": "Is there any chance he isn’t who he say he is and he wanted to ghost you and this is how he did it? Have you been on video call with him?",
      "created_utc": 1746337650.0,
      "score": 6
    },
    {
      "id": "mqdxc64",
      "body": "No! It's not your fault. Get that out of your mind. How could you now? I'm so sorry for your loss :(",
      "created_utc": 1746286862.0,
      "score": 5
    },
    {
      "id": "mqff6k5",
      "body": "I would get someone to check on him, I saw in another comment that you don’t know his address but try finding people with the same last name as him, look on Facebook, instagram, any social media. Explain who you are and say you’re concerned. In the meantime I would recommend YOU call a helpline, this could be really stressful for you and might not be in the right state of mind and they could help you figure out how to him help and someone to check on him",
      "created_utc": 1746303854.0,
      "score": 3
    },
    {
      "id": "mqi563n",
      "body": "HI,\n\nFirstly, its not your fault - it is not your fault. Get that thought of your mind. \n\nSecondly, call an emergency line/helpline. That is the best thing you can do if you can’t reach him. Then you have done everything you could’ve possibly have.",
      "created_utc": 1746345467.0,
      "score": 4
    },
    {
      "id": "mqiau1v",
      "body": "What if he told you that to get you off his back because he’s alive but just lying to you? He might be avoiding something idk",
      "created_utc": 1746349006.0,
      "score": 4
    },
    {
      "id": "mqe05oe",
      "body": "Oh I hope not",
      "created_utc": 1746287736.0,
      "score": 3
    },
    {
      "id": "mqe321i",
      "body": "It's not your fault OP... you do need to call the police and send them to his house to do a welfare check and make sure he didn't actually do it. Most people say that and don't follow through so that is most likely what is going on. I pray and hope they didn't do that; Suicide is no joke though. Please call 911 and have them check on your BF. Do you have their address?",
      "created_utc": 1746288647.0,
      "score": 3
    },
    {
      "id": "mqelkv6",
      "body": "It's not your fault OP, if he really did it he was probably planning it for a while. With this I mean there's nothing you could do and you were nice and kind to him so you were (or are!) a great support for him. Do you know where he is from so you can locate him? Maybe call a few hospitals around.",
      "created_utc": 1746294320.0,
      "score": 3
    },
    {
      "id": "mqf24az",
      "body": "It is NOT your fault.",
      "created_utc": 1746299503.0,
      "score": 3
    },
    {
      "id": "mqfdx9p",
      "body": "Please call or text 988",
      "created_utc": 1746303442.0,
      "score": 3
    },
    {
      "id": "mqfiq0z",
      "body": "Call a mental health hotline. Since Trump shut down alot of LGBTQ rights hotlines try using the Canadian one. There are people who will try and go through everything with you, and help you find out if he’s okay or not. I know you probably hear it alot, but You Are NOT Alone.",
      "created_utc": 1746304998.0,
      "score": 3
    },
    {
      "id": "mqg1pes",
      "body": "It's not your fault. Whatever happens, his choices are his own and not yours. He gave you the courtesy of a goodbye text; that sounds like you are or were very beautiful to his life.",
      "created_utc": 1746311587.0,
      "score": 3
    },
    {
      "id": "mqghycz",
      "body": "if you can find his ip address nord vpn has a ip address look up. if not this option may take some time but if he has pictures on his instagram that shows he is outside you can find landmarks and find where he lives.",
      "created_utc": 1746317641.0,
      "score": 3
    },
    {
      "id": "mqkwf16",
      "body": "Do NOT blame yourself, it's not your fault. Please seek help from a trusted therapist or  support group",
      "created_utc": 1746384532.0,
      "score": 3
    },
    {
      "id": "mqvv65f",
      "body": "I know you sent this a while ago and you said there's been no update 2 days ago, any news yet? What area is he in? is he in the same country? \n\nI had a situation, 2015, where i had a friend i was chatting to online who said he was at a bridge about to jump. Now, he did this and i used all my energy and know-how which i picked up along the way, to try and talk him down from it, every trick you could think of i did. It was tiring, heartrending stuff, i could feel my blood pumping fast through my head, my heart was pounding, my neck was even twitching. Inside i was screaming.\n\nKnow what i did? i called the police to get a welfare check on him, and he was absolutely fine.. ie, he lied about the whole thing and blocked me shortly after. \n\nIt is always better to be safe than sorry. If you really think he is in danger, don't wait. Do something. It isn't fair that he put this on you, because in doing this he has made your health and wellbeing deteriorate. And if there's a chance he didn't do anything and it was all talk, you deserve to know. You need closure, that much is clear.",
      "created_utc": 1746539619.0,
      "score": 3
    },
    {
      "id": "mqfqsvv",
      "body": "Sorry to hear.\n\nCan you reach a helpline?\n\nI guess I'd like to say even if he did that and there's nothing a lot simpler going on, it's not your fault and you're not responsible for anyone but you.\n\nBut I've never been through anything like that. I'm sorry.",
      "created_utc": 1746307677.0,
      "score": 2
    },
    {
      "id": "mqo1v2v",
      "body": "I'm so sorry♥️. You're not alone. We are here",
      "created_utc": 1746427710.0,
      "score": 2
    },
    {
      "id": "mqe0ap1",
      "body": "OP, this is not your fault. \n\nPlease call the police. That is the best thing you can do for your boyfriend.",
      "created_utc": 1746287779.0,
      "score": 2
    },
    {
      "id": "mqeaz9b",
      "body": "[removed]",
      "created_utc": 1746291140.0,
      "score": -23
    },
    {
      "id": "mqdrfji",
      "body": "thank you, i hope he replies, i really do love him",
      "created_utc": 1746285008.0,
      "score": 83
    },
    {
      "id": "mqdrp1q",
      "body": "His parents carry the responsibility for this, not you.  You were only a child yourself and you were a kind and caring friend for him.",
      "created_utc": 1746285093.0,
      "score": 42
    },
    {
      "id": "mqdrcuq",
      "body": "i might if my thoughts spiral more, ty for replying",
      "created_utc": 1746284984.0,
      "score": 163
    },
    {
      "id": "mqdumlc",
      "body": "I sadly don't have any way to contact his family or friends, he would often talk about his parents not caring about him, and I would comfort him through that, I hope that god forbid he did do something, he is in the hospital right now, thank you, your reply means a lot",
      "created_utc": 1746286019.0,
      "score": 45
    },
    {
      "id": "mqdutsh",
      "body": "sadly no, I don't have a way to contact his friends or family. Thank you for your reply",
      "created_utc": 1746286080.0,
      "score": 13
    },
    {
      "id": "mqn6wuc",
      "body": "Just an update, no word from him yet, but I still have high hopes. If he truly is gone, then I hope he is happier now. I know his life was the easiest. But i do still hope that isnt the case",
      "created_utc": 1746412604.0,
      "score": 8
    },
    {
      "id": "mqlt4tv",
      "body": "Omg is he okay now? I really hope you and him are fine rn",
      "created_utc": 1746394852.0,
      "score": 3
    },
    {
      "id": "mqf5oqq",
      "body": "thank you, reading all these comments has eased me, im hoping to see a message from him, but ive just been occupying myself with other things.",
      "created_utc": 1746300696.0,
      "score": 3
    },
    {
      "id": "mqdvgxi",
      "body": "Thank you, I really hope he is ok, I sadly don't have any ways to contact people who know him, but thank you for replying",
      "created_utc": 1746286281.0,
      "score": 3
    },
    {
      "id": "mqdy5sb",
      "body": "Sadly I don't, thats why i feel so helpless",
      "created_utc": 1746287117.0,
      "score": 1
    },
    {
      "id": "mqdy8ee",
      "body": "thank you, im trying to just do other things but i just cant get him off my mind",
      "created_utc": 1746287139.0,
      "score": 3
    },
    {
      "id": "mqftwxh",
      "body": "do you even understand the concept of how a suicidal person thinks? because thats not how that works. hes not selfish, hes struggling. op isnt upset because he brough them into it, theyre clearly upset because theyre boyfriend mightve just fucking died. i dont understand how you can even think thats the right think to say in this scenario jesus christ.",
      "created_utc": 1746308759.0,
      "score": 10
    },
    {
      "id": "mqvkxaa",
      "body": "[removed]",
      "created_utc": 1746536145.0,
      "score": 1
    },
    {
      "id": "mqxc1eu",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1746554902.0,
      "score": 1
    },
    {
      "id": "mqdrlw5",
      "body": "I hope he comes back online too online or in person losing someone your close to sucks",
      "created_utc": 1746285064.0,
      "score": 28
    },
    {
      "id": "mqfe3wo",
      "body": "If you have his number I can call. I'll male up some misdialed number excuse but at least you'd know.",
      "created_utc": 1746303503.0,
      "score": 15
    },
    {
      "id": "mqdrya8",
      "body": "I think they meant for your friend.",
      "created_utc": 1746285173.0,
      "score": 313
    },
    {
      "id": "mqfemiy",
      "body": "The way you wrote this, implies he is in the hospital? But I have a feeling, due to the writing, it's not what you meant? Call a line where you can vent a bit, I'd recommend that, because your mind is now all over the place. Or maybe you have people around you who you can trust?",
      "created_utc": 1746303675.0,
      "score": 1
    },
    {
      "id": "mqe0hbl",
      "body": "of course OP. I know it’s really worrying, just try to do some small tasks to distract your brain. sitting in the anxiety will just make you feel so much worse, and realistically you’ve done all you can physically do for him in the situation. It hasn’t been days or anything so there is a chance he may be asleep. I don’t want to shove false hope down your throat but it is a possibility. i hope everything turns out okay <3",
      "created_utc": 1746287838.0,
      "score": 8
    },
    {
      "id": "mrlayve",
      "body": "Just checking in and really hoping he’s ok…praying for you both…",
      "created_utc": 1746886397.0,
      "score": 1
    },
    {
      "id": "mqxc2cg",
      "body": "Thanks for contributing on r/mentalhealth. We have removed your post or comment because we determined that it violates rule 2. \n\n>All posts and comments must clearly and substantively contribute to mental health and wellbeing for the community or for the person posting. \n\n>This rule explicitly prohibits \"sound-off\", DAE, and posts offering vague or general unsolicited advice. \n\n>You may link to established resources elsewhere on the internet if the resource is paywall free and does not serve to promote the interests of any enterprise or individual.\n\n>Moderator discretion on this rule is final.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1746554909.0,
      "score": 1
    },
    {
      "id": "mqdsdum",
      "body": "i would, but he sent the message 12 hours ago, i was asleep the whole time. i dont know where he lives, it was online, so i just feel helpless",
      "created_utc": 1746285310.0,
      "score": 114
    },
    {
      "id": "mqfv7yx",
      "body": "I think they meant god forbid he attempted suicide, but if he did, they hope he is in the hospital",
      "created_utc": 1746309221.0,
      "score": 22
    },
    {
      "id": "mqe1ef4",
      "body": "thank you, im trying to do other things, but im also sick, meaning i cant really do much right now other than lay in bed",
      "created_utc": 1746288128.0,
      "score": 9
    },
    {
      "id": "mqdzysh",
      "body": "Do it, they will try to find out things with you. You need to try your best to locate him",
      "created_utc": 1746287677.0,
      "score": 172
    },
    {
      "id": "mqf0xxp",
      "body": "Hey, former crisis line supervisor here. They can’t locate him themselves but they can help guide you in that process. If you and he both live in the US, you can also just go ahead and call 911. There’s a good chance they can help figure out his location based on his phone number and/or IP address if you have that.",
      "created_utc": 1746299121.0,
      "score": 40
    },
    {
      "id": "mqe4wie",
      "body": "They can probably use his phone number since you have it to figure that out and contact the local authorities in that area to do a wellness check. You could also probably accomplish this by giving the info to your own local police station and requesting a wellness check and they can track down the right area to make it happen",
      "created_utc": 1746289227.0,
      "score": 41
    },
    {
      "id": "mqe4n0k",
      "body": "You don’t know his name or where he lives?…",
      "created_utc": 1746289144.0,
      "score": 68
    },
    {
      "id": "mr7n7u4",
      "body": "no offense pls don't take this into offense but how don't u know where ur bf lives? I'm in a long distance rls with a girl I love very much and know basically her whole family and her address",
      "created_utc": 1746692841.0,
      "score": 1
    },
    {
      "id": "mqfz80j",
      "body": "[deleted]",
      "created_utc": 1746310662.0,
      "score": -27
    },
    {
      "id": "mqfzcil",
      "body": "Yeahh, I think the same. A double check wouldn't harm, though.",
      "created_utc": 1746310708.0,
      "score": 6
    },
    {
      "id": "mqeeqoo",
      "body": "Just remember, whatever you find at the end of this journey, it‘s not your fault.",
      "created_utc": 1746292267.0,
      "score": 207
    },
    {
      "id": "mqil19h",
      "body": "Unfortunately, this happens frequently online. Due to anonymity and non-specific identifiers it’s actually really hard locating a person in real life with minimal information. (Not impossible)\n\nI actually had this happen when I was a teenager multiple times; MSN and MySpace frequently had a number of people disclose attempts and active ideation. It’s so emotionally scary when it happens! You want to know if they are alive and well. \n\nUnfortunately, sometimes it’s maliciously done. I had a number of friends (fake accounts) that faked stuff like this (not saying it’s the case for OP) I spent years obsessing and fearing people died. It’s a horrible feeling to be this helpless and scared. I used to get relief from hearing from these people, I guess it’s the uncertainty that’s anxiety inducing. \n\nI’m actually pretty savvy with the whole process; usually age, vague location and potentially a few details are easy to follow up on—depending on nation and location",
      "created_utc": 1746355310.0,
      "score": 18
    },
    {
      "id": "mqgjzrt",
      "body": "911 dispatcher, phone number is typically only good if the jurisdiction has history with the number. If OP calls 911 they will get the local dispatch who won’t have records for anywhere outside of jurisdiction. Also, with VPN IP are next to useless. Not trying to be cynical but those are the facts.",
      "created_utc": 1746318434.0,
      "score": 15
    },
    {
      "id": "mqhwt6s",
      "body": "Ummm what. If you sat down next to a stranger on a bench and ended up having the conversation of your life felt a connection you hadn't felt in years or maybe ever. Everything is going great maybe you swap phone numbers or socials. You get home and see they were killed in a car accident on their way home. You'd just keep scrolling?",
      "created_utc": 1746340450.0,
      "score": 3
    },
    {
      "id": "mqfdz8m",
      "body": "Amazing comment, thanks for posting that. OP needs to hear this.",
      "created_utc": 1746303460.0,
      "score": 55
    },
    {
      "id": "mqhyvs2",
      "body": "In my experience they should transfer them to the correct jurisdiction based on the phone number - though I didn’t think about the fact that they may not be willing to ping the phone/contact the carrier for an address if it’s a an individual calling on their behalf as opposed to a crisis line. I know state laws vary on this. You’re right about VPNs. Totally worthless unfortunately in this case.",
      "created_utc": 1746341656.0,
      "score": 3
    },
    {
      "id": "mqi8jf7",
      "body": "Yeah, but if all you have is a phone number you might know a part of the country but not which particular local. Most area codes cover several jurisdictions so it would be a crap shoot to know which to transfer to. \n\nYou are spot on with pinging a phone. Very much up to the carrier and local jurisdictions policies. \n\nAlso if the number is not from a carrier but instead number spoofing apps and other talk apps pings are useless.",
      "created_utc": 1746347572.0,
      "score": 4
    }
  ]
}