{
  "id": "1dg7b44",
  "title": "can someone tell me that it's going to be okay",
  "selftext": "please ",
  "created_utc": 1718416949.0,
  "score": 634,
  "num_comments": 215,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1dg7b44/can_someone_tell_me_that_its_going_to_be_okay/",
  "comments": [
    {
      "id": "l8o8q78",
      "body": "It’s going to be ok.  I recently got out of a voluntary psych ward for suicide. I understand the overwhelming need to be told everything will be ok.  Big hugs.",
      "created_utc": 1718417857.0,
      "score": 378
    },
    {
      "id": "l8oid33",
      "body": "Thank you guys",
      "created_utc": 1718422559.0,
      "score": 101
    },
    {
      "id": "l8oae21",
      "body": "It’s going to be ok. You can’t see the sky when you’re facing down, but that doesn’t mean the sky isn’t there, and you’ll be able to pick yourself up again even stronger than before and see the sky. It’ll get better. 🫂",
      "created_utc": 1718418623.0,
      "score": 194
    },
    {
      "id": "l8ojkpi",
      "body": "As someone who has been ready to die many times, and never thought things would be ok again. I can tell you with certainty that it’s going to be okay.\n\nLife is difficult, complex, traumatic, and shitty. It’s also full of incredible experiences, happiness, beauty, and love. These are all part of the ebbs and flows of life, and none of it is linear and none of it is permanent. Including the pain and everything awful.\n\nYou are going to be okay. It may not be the same, or different from what you expected. But it will be okay. And at some point you may find yourself not okay again, in a different way. And you’ll find yourself back to a new version of okay. And you’re going to have many different little moments of happiness that are all worth experiencing if you can stick around for it.",
      "created_utc": 1718423223.0,
      "score": 90
    },
    {
      "id": "l8ocv47",
      "body": "It is going to be ok. This is just a rough patch for you but you shall overcome it. Sending hugs and strength.",
      "created_utc": 1718419774.0,
      "score": 40
    },
    {
      "id": "l8obtqs",
      "body": "It's gonna be ok, at the end of the day the sun shines, and when the sun don't shine, then the moon shines, even in darkness there will be light, and the next day comes the son.",
      "created_utc": 1718419291.0,
      "score": 27
    },
    {
      "id": "l8olvoy",
      "body": "It's going to be ok 🫂🫂 Please do something nice for yourself alright? Even something small like drinking a cup of water or tea, or having a snack.",
      "created_utc": 1718424533.0,
      "score": 22
    },
    {
      "id": "l8ootoz",
      "body": "Can’t promise that “it’s” going to be okay, but can say the emotions we feel are like the ocean tides. They come in and sometimes we feel like we’re going to drown and be overtaken by them. But then they slowly retreat and another emotion comes in. \n\nThis happens with all emotional states, good and bad. We can’t avoid this, but we can learn the skills necessary to manage them. So when the shit of life is on our doorstep, we can be ready to handle it.\n\nIf you feel unable to handle the stuff happening in your life, please consider seeing a good therapist to help you build the skills you need to move from just surviving life to thriving in your life. \n\nI wish you the courage, strength and love you need to get through whatever this is that you need to be okay.",
      "created_utc": 1718426298.0,
      "score": 15
    },
    {
      "id": "l8oqgp7",
      "body": "More than it will be ok - whatever it is you'll get through it. It may feel hard, impossible, confusing, stressful, embarrassing, awful. It may be all the feelings all at once. You'll only have to live this day once. And tomorrow is the next day and already a day removed from how bad it was before. \n\nThe way out is through. Always through. You'll look back at yourself even 2 years from now and you won't recognize who you are today. \n\nIt will not be perfect, and you will always be accountable to your decisions and how you respond to anything. But it will be ok.",
      "created_utc": 1718427326.0,
      "score": 14
    },
    {
      "id": "l8ov9c9",
      "body": "This was a wholesome thread to read for someone who also needed to be told that it'll be okay.\n\nIt's going to be okay OP. 🩷",
      "created_utc": 1718430438.0,
      "score": 14
    },
    {
      "id": "l8om8jv",
      "body": "It’s definitely going to be okay.",
      "created_utc": 1718424741.0,
      "score": 14
    },
    {
      "id": "l8oclh2",
      "body": "Everything will be ok 😊",
      "created_utc": 1718419649.0,
      "score": 13
    },
    {
      "id": "l8om9e4",
      "body": "It's going to be okay. I've been in the place where it doesn't feel that way, but it will.",
      "created_utc": 1718424755.0,
      "score": 14
    },
    {
      "id": "l8os8ur",
      "body": "This too shall pass. You’re going to be ok",
      "created_utc": 1718428486.0,
      "score": 11
    },
    {
      "id": "l8oki89",
      "body": "It’s going to be ok",
      "created_utc": 1718423742.0,
      "score": 8
    },
    {
      "id": "l8oq1yd",
      "body": "It's definitely going to be OK. You've made it through 100% of your days so far, you can keep going. It will be ok",
      "created_utc": 1718427069.0,
      "score": 9
    },
    {
      "id": "l8or9ch",
      "body": "You’re going to be fine. We are all here for you, it’s going to work out, most of the time what we think will happen doesn’t, as the stoics say don’t suffer before you have to. Your in a good place here, it’s going to be okay",
      "created_utc": 1718427838.0,
      "score": 8
    },
    {
      "id": "l8olokr",
      "body": "It really will be.  I promise you are stronger than you think you are.",
      "created_utc": 1718424418.0,
      "score": 6
    },
    {
      "id": "l8oot3m",
      "body": "Everything will be okay; all things work themselves out in time. I have been in your shoes more than once, and I look back now so thankful I didn’t give up. I would have missed so many good things I couldn’t see then. Take a moment to meditate and breathe. A really wise friend told me once.. “How do you eat an elephant? One bite at a time.” Just take it slow and breathe. Hang in there friend, please feel free to DM if you ever need a shoulder to lean on. 🫶🏼 Sendin you a big hug OP",
      "created_utc": 1718426288.0,
      "score": 5
    },
    {
      "id": "l8otw4y",
      "body": "It will always be ok. Maybe not today, but tomorrow is a whole new day. No matter how bad my day is the next day is always better. A month goes by and the bad day is already wiped from my memory. Same goes for you!",
      "created_utc": 1718429554.0,
      "score": 5
    },
    {
      "id": "l8ou7r1",
      "body": "Don't trust your feelings, everything will be okay. One small step at a time.",
      "created_utc": 1718429761.0,
      "score": 7
    },
    {
      "id": "l8pq9qx",
      "body": "I had a hard time growing up, especially when it came to adulting at 17 when I was put out on my own. Scariest time of my life. I was given no direction like how to pay bills and such. Not good. I fumbled through life a lot. Two failed marriages and a bankruptcy. \n\nAnywho, I had a daughter to take care of and I was able to get her off to college and after that I was on my own again trying to figure things out again. I’m happy to say at 56 I finally figured things out lol. \n\nI asked myself many times the same question that you do and I can honestly say it WILL be okay. You will stumble sometimes but you learn from these times and move on. There will be happy times as well as sad, take them as they come. You can do this I promise!\n\nTake care op!",
      "created_utc": 1718452675.0,
      "score": 5
    },
    {
      "id": "l8pyykd",
      "body": "Hey sweet pea. Everything is going to be okay. Really. You won’t feel like this forever.",
      "created_utc": 1718457340.0,
      "score": 6
    },
    {
      "id": "l8qnrla",
      "body": "You’re going to be fine. Deep breath. Baby steps.",
      "created_utc": 1718468586.0,
      "score": 5
    },
    {
      "id": "l8okxhp",
      "body": "Everything is going to be fine. You've just hit a bump. That's all. \nWe never know when things are going to go bad",
      "created_utc": 1718423981.0,
      "score": 4
    },
    {
      "id": "l8olnov",
      "body": "You’re going to be okay. If you need to talk to someone, my DMs are open ❤️ Regardless, you’ll be okay and are stronger than you think",
      "created_utc": 1718424404.0,
      "score": 4
    },
    {
      "id": "l8opmv3",
      "body": "Every time I have ever been on an edge, convinced things would never get better, they did. It's difficult to see that possibility when you're so deep in it, but things are going to get better and it's going to be okay. You will find your footing again soon, please hang in there. You've got thousands of people here rooting for you. It's gunna be okay. 💜",
      "created_utc": 1718426804.0,
      "score": 4
    },
    {
      "id": "l8oshfk",
      "body": "Hey, I want you to know that things will be OKAY! It might feel overwhelming right now, and that's completely understandable. Life has a way of throwing challenges our way, and it's easy to get lost in the struggles. But take a deep breath and remember that this moment is just a part of your journey, not the entirety of it.\n\nThere are brighter days ahead, even if they seem distant now. You're stronger than you realize, and each step forward, no matter how small, is a testament to your resilience. You have the power to navigate through this, and in time, you will find peace and happiness again.\n\nLean on those who care about you, and don't be afraid to reach out for support.(Even pm me if you want🫂) You're not alone in this. Hang in there. 💖",
      "created_utc": 1718428642.0,
      "score": 5
    },
    {
      "id": "l8oy22h",
      "body": "It’s going to be ok. I know it doesn’t seem like it right now, but you will be ok.",
      "created_utc": 1718432320.0,
      "score": 5
    },
    {
      "id": "l8oqtmh",
      "body": "You’re going to be just fine :)",
      "created_utc": 1718427557.0,
      "score": 4
    },
    {
      "id": "l8or52l",
      "body": "It’s going to be okay.",
      "created_utc": 1718427761.0,
      "score": 4
    },
    {
      "id": "l8os63b",
      "body": "ur going to be okay i believe in you",
      "created_utc": 1718428436.0,
      "score": 4
    },
    {
      "id": "l8ou01p",
      "body": "It doesn’t feel like it right now perhaps because you’re struggling, but remember, feelings are temporary. You won’t feel this way forever. It won’t be this way forever. You are not a fixed being. And it will be okay. 🙂♥️🫶",
      "created_utc": 1718429621.0,
      "score": 5
    },
    {
      "id": "l8oug58",
      "body": "Everything is going to be OK ♡",
      "created_utc": 1718429910.0,
      "score": 5
    },
    {
      "id": "l8owvew",
      "body": "It’s going to be okay :)",
      "created_utc": 1718431506.0,
      "score": 4
    },
    {
      "id": "l8oxjkh",
      "body": "it's good, limit social media. Take a walk, stretch, lay down. ",
      "created_utc": 1718431966.0,
      "score": 3
    },
    {
      "id": "l8oypcb",
      "body": "Seriously, it will be ok. Sometimes it seems like it won't, but I promise you it will get better.",
      "created_utc": 1718432769.0,
      "score": 3
    },
    {
      "id": "l8p16u1",
      "body": "It will get better just hang in there. You'll have an amazing story to tell once get through this, so just hang in there buddy.",
      "created_utc": 1718434518.0,
      "score": 4
    },
    {
      "id": "l8pfw5q",
      "body": "It’s all good brah. My entire mental is dependent upon the shit I do physically (let’s just say adrenaline and exhaustion hits different for me) and I broke my collarbone completely 5 weeks ago from a longboarding incident. It’s been torture not being able to vent on anything but there’s always positive sides to look at. Even at the hospital, on the verge of being knocked out for surgery, people were telling me I took it really well. There’s always something to smile about, you just gotta look for it man, and sometimes it’s the smallest things like the innocent smile of a stranger. See the beauty of life, and start enjoying it! \n\nRootin for ya",
      "created_utc": 1718445741.0,
      "score": 5
    },
    {
      "id": "l8pn0s1",
      "body": "Everything will be just fine. Talk to someone who could distract you from the awful thoughts and feelings.\n\nBig hugs from Spain <3",
      "created_utc": 1718450775.0,
      "score": 5
    },
    {
      "id": "l8ppa2l",
      "body": "Nothing is static so this won’t be this way, for you, for very much longer. It will get better.",
      "created_utc": 1718452105.0,
      "score": 4
    },
    {
      "id": "l8op9l7",
      "body": "Just popping in to say it's going to be ok. It always is.",
      "created_utc": 1718426572.0,
      "score": 3
    },
    {
      "id": "l8os34g",
      "body": "You’re bobs be okay 🫂",
      "created_utc": 1718428382.0,
      "score": 3
    },
    {
      "id": "l8ov0id",
      "body": "Everything is gonna be okay. 💜",
      "created_utc": 1718430279.0,
      "score": 3
    },
    {
      "id": "l8oy44b",
      "body": "A quote I love is “Suicide doesn't end the chances of life getting worse, it eliminates the possibility of it ever getting any better”. \n\nSomeone on quora said this about it, which I love “ is suggesting that while someone who is contemplating suicide may be thinking that it is a way to escape their current suffering or pain, the act of suicide doesn't actually resolve the underlying issues or negative experiences.\n\nIt highlights that there is always a chance for life to improve or for circumstances to change for the better, but by taking one's own life, that potential for improvement is permanently lost.\n\nThe quote serves as a reminder that even in the darkest moments, there is always hope for things to improve and that seeking help and support can lead to a better future, whereas suicide cuts off any chance for positive change or resolution.”  \n\nIf you’re religious at all there’s also the concept of hell or something similar if you end your life. And the suffering and grief you feel doesn’t disappear, it will be forwarded to all of your loved ones and those around you ten fold. \n\nWhen you’re feeling your lowest, that’s it. You’re already there at your lowest, and you’re surviving it, albeit begrudgingly. It can’t really get much worse, it just is what it is and that’s it. \nBut it can get better. \nAnd once it eventually does, it’s so worth it. \n\nWhen I reached points of happiness after a really deep depression, I remember waking up and being happy and just thinking “thank god I held on a little bit longer. This is so worth all the hard times I stuck it out and kept it pushing.” As corny as that sounds, it’s true. \n\nYou’ve got nothing to lose but everything to gain, so to say. \n\nEverything in the universe is working to reach equilibrium. Every action has an opposite and equal reaction and such. What goes up must come down yadda yadda. \nSo all the suffering you feel now, eventually, will be paid back with equal amounts of positivity. It make take a day, it might take a year. But eventually it will even out. So the more you suffer, the more good things you have coming your way. \n\n\nHere’s something I wrote recently, a short story or poem or something. Idk but hopefully it helps. \n\n\nI used to always tell myself “you can kill yourself tomorrow.” \n\nWhen I felt my lowest and really wanted to end it, I would think of all the things I needed to do first. \n\nI didn’t want my mom or siblings to find my body. Or my paraphernalia. Or my vibrator. Or be responsible for going through all my stuff and cleaning up my mess when they’re grief stricken. \nSo I’d have to get my affairs in order and clean up first today, and then tomorrow I can kill myself. \n\nBut tomorrow is my best friends birthday. I can’t ruin her birthday. I’m going to kill myself anyway and I’ve made it this far, so what’s one more day matter. \nI’ll make sure she has a great birthday and then tomorrow I’ll kill myself. \n\nShe loved the gift I got her. Im glad she’ll have it to remember me by. But that new show I really wanted to watch premiers tomorrow. \nIf I’m going to die I might as well watch it first, I’m going to kill myself anyway, what’s one more day matter. \n\nSo I watch the premier of the show and fall asleep. I wake up today and my grandma needs help clearing out grandpas stuff, it’s been a while since he passed and she’s finally ready to do it. \nShe’s old and doesn’t have much time left, I’m going to kill myself anyway, I should really spend a little time with her first, and it would be nice to go through some memories of grandpa before I’m gone too, what’s one more day? \n\nBut the look of pain and sorrow in my grandmothers eyes going through grandpas things breaks my heart. The emptiness and loneliness she feels now that he’s gone is palpable. \n\nWill my mother have that same looks once I’m gone? \n\nGrandma says she can’t bear the guilt feeling like it was her fault, if she had been home that day when grandpa fell maybe he would still be here. It eats her alive. \n\nWill my sister think that way about me? \n\nWe go through old photos and talk about memories. Grandmas face lights up and so does mine, as we laugh and go back and forth sharing stories. All the good times, all the hard times that we didn’t think we’d make it through but we did, I forgot what it felt like to laugh. \n\nI forgot how much I used to love riding my bike. I forgot how much I used to love painting. Grandpa taught me how to paint. \nMaybe I should try painting again. I wonder if my old bike is still in the garage, it’s a beautiful day outside. It would be really nice to go for a ride in the evening. \n\nGrandma sends me home with some of her chocolate chip cookies. I forgot how much I love these cookies. \n\n I can’t wait to wake up and go to the art store tomorrow for paints. And that bike ride felt amazing. I should go for a ride again tomorrow evening. \n\nA few weeks have passed and I’ve lost a few pounds from riding my bike. I forgot how it felt to look in the mirror and feel good about myself. \n\nI’ve been painting a lot, it feels so good to have an outlet for my emotions. I’ve posted some online and people are interested in buying them. Maybe I can finally get out of that office job I hate. I’ll look into making a website for my paintings tomorrow. \n\nI met an awesome guy at a local art show one of my paintings was in. We went out for coffee and ended up spending the whole days together. I haven’t laughed that hard in years. I haven’t felt this good about myself in such a long time. We made plans to go to the fair tomorrow. I forgot how much I love riding the rides. I’m so excited to wake up tomorrow I can barely sleep. \n\nWait. Didn’t I have something planned for tomorrow? \n\nOh well. I’m sure it wasn’t that important anyway. \n\n**I know you didn’t say anything about suicide and I hope hope hope you’re not feeling that way, but this all applies to even a general sense of depression or going through a tough time. The point is that it ***WILL*** get better. It has to. You just have to hold on a little bit longer. Minute by minute or hour by hour or day by day if you have to. But eventually it always gets better. Always.** 🖤🖤",
      "created_utc": 1718432361.0,
      "score": 3
    },
    {
      "id": "l8oypqv",
      "body": "It’s going to be okay, you will get through this",
      "created_utc": 1718432777.0,
      "score": 3
    },
    {
      "id": "l8oz8pj",
      "body": "It’s all going to be okay. You got this! 🤍",
      "created_utc": 1718433144.0,
      "score": 3
    },
    {
      "id": "l8p44w3",
      "body": "It will be okay, no matter what you're going through! I've had chronic depression since I was 11, and had a lot of trauma in most of my life. I'm 45, and my life is going okay. Not great, not bad...but I do have my days when I get very depressed and cry a lot. Due to my trauma, I don't reach out, and I deal with on my own (I recommend reaching out to someone)  I tell myself the depressive episode won't last, and i won't feel like this forever. I gotta keep going. Unfortunately, life is never perfect or easy, and sometimes it doesn't go the way we want it. But what would we learn or achieve if life was easy? You won't be in your current situation forever. \nYou gotta keep pushing through! Sending you love and light! 💗🌟💞 you got this!",
      "created_utc": 1718436660.0,
      "score": 3
    },
    {
      "id": "l8p46zj",
      "body": "Hey it totally will be ok, and that's coming from somebody who feels like shit every day. Stay strong.",
      "created_utc": 1718436701.0,
      "score": 3
    },
    {
      "id": "l8pxik6",
      "body": "things will be cool. we all will figure out what to do",
      "created_utc": 1718456588.0,
      "score": 3
    },
    {
      "id": "l8qczbx",
      "body": "It's going to be ok!",
      "created_utc": 1718463966.0,
      "score": 3
    },
    {
      "id": "l8qhbki",
      "body": "It’s always shitty, it’s always around us all and it can make it so fucking hard to just see the path ahead and feel the genuine support, love and comfort from people. No matter what you do, have done and so going forwards you are going to be ok. Shit around will still happen and that’s ok too. You matter! It’s going to get good! All the love and strength to you with things. You will do better than ok even when it doesn’t feel like it!",
      "created_utc": 1718465852.0,
      "score": 3
    },
    {
      "id": "l8qhlxw",
      "body": "It WILL be ok but you have to deal with your trauma!",
      "created_utc": 1718465974.0,
      "score": 3
    },
    {
      "id": "l8tob6c",
      "body": "I don't know what's going on, but you got this. it's going to be okay. you never realize how strong you are until you take a step back after calming down. I'm proud of you for carrying yourself this long. keep it up!",
      "created_utc": 1718516309.0,
      "score": 3
    },
    {
      "id": "l8vv9z2",
      "body": "You are strong. Things will be okay. Sending you love.",
      "created_utc": 1718558627.0,
      "score": 3
    },
    {
      "id": "l9a13zs",
      "body": "Hey, you must be a person who's really struggling and can't make yourself feel happy, safe, or assured no matter what you do. But it will be okay. \"Okay\" may seem like it'll be ages from now, but things will brighten up eventually. There will always be light somewhere in darkness. You'll find that light and start to feel okay, and that darkness will end. There's no guarantee it will end tomorrow, but this sinking feeling will pass. You can do it, just hold on a bit longer. It will be worth it, keep trying your best like it's your last time. Everything will be okay :) God bless you ❤️",
      "created_utc": 1718783190.0,
      "score": 3
    },
    {
      "id": "lacybon",
      "body": "Hey, \nIt's going to be okay. It might take a little time, it might be a little tough, there might be trouble along the way but it will eventually be okay. You are stronger than you think  and you can always get over anything you want.",
      "created_utc": 1719408055.0,
      "score": 3
    },
    {
      "id": "lollol4",
      "body": "All emotions are temporary! Try to think of a time you went through something really hard before and realize you made it through that and it’s not something you think about much anymore 💕",
      "created_utc": 1727130589.0,
      "score": 3
    },
    {
      "id": "l8omte2",
      "body": "It’s going to be okay. Jesus has a plan for you and He will take care of you and every detail of your life. (It’s okay if you don’t believe what I believe 💜)",
      "created_utc": 1718425081.0,
      "score": 4
    },
    {
      "id": "l8ouhv3",
      "body": "Its always going to be okay, and if it doesnt fell okay right now, your feelings are still valid and its gonna be okay either way. Cant stop it really.",
      "created_utc": 1718429942.0,
      "score": 2
    },
    {
      "id": "l8oun9d",
      "body": "It's gonna be okay",
      "created_utc": 1718430040.0,
      "score": 2
    },
    {
      "id": "l8oz7qf",
      "body": "Things will be fine. Sending hugs and strength. Someday in life when you look back , and even though you would feel these days were tough, you were tougher. You got this.",
      "created_utc": 1718433127.0,
      "score": 2
    },
    {
      "id": "l8p3c7h",
      "body": "It’s going to be okay. Anytime you feel like it’s not, remind yourself that it is until you don’t need to remind yourself anymore. Until you believe it and don’t doubt it. And the sooner you realize it’s going to be okay, the sooner it starts being okay",
      "created_utc": 1718436072.0,
      "score": 2
    },
    {
      "id": "l8p4to4",
      "body": "I have a legit question about this post. Not for the op but for everyone else. What if things aren't ok? Again not directed at op. This is how I feel about my life, people say things are gonna be ok and work out and I honestly dont think that will happen .  Sometimes doesnt life just fuck people?",
      "created_utc": 1718437169.0,
      "score": 2
    },
    {
      "id": "l8p50cw",
      "body": "Listen to music, take a walk outside, hang out in nature(even if it's one tiny park in a city), pet/love on animals, sit in the sunshine, write your thoughts down. \nThose are some of the healthy coping mechanisms I use. But everyone is different, and there's so many healthy coping mechanisms! Search for them online and you'll find a huge list of them.😊",
      "created_utc": 1718437308.0,
      "score": 2
    },
    {
      "id": "l8p8fx8",
      "body": "I wish you all the best.. <33",
      "created_utc": 1718439922.0,
      "score": 2
    },
    {
      "id": "l8p8kyz",
      "body": "You just need to survive the storm of death knocking at your door… I keeep having problems thinking about it happening to me this year or something worse and I’m struggling hard….. but I’m alive now and it’s been hard for 20 plus years now off and on but I learnt something the last 20 I didn’t even realize or understand or take seriously enough and that is why I’m so sad hurt and depressed angry and even at times ready for the worst and I’m not ready to take my pain and make it my own gain \n\nHowever I’m not going to be able to live anymore the way that I was and it’s not easy to do anything in this world right now yet alone by myself but if I don’t have any kind of peace of mind’s and acceptance that I am going to have to do my best find awy to break my comfort zone and do what I’ve been too scared to do and become more comfortable with not being comfortable and that’s what I’m going to be able to get better have some kind of change that will help get me through this time this time \n\nGood luck I believe in you you can do this \n\nStay strong and love yourself always be patient be happy be positive be persistent",
      "created_utc": 1718440030.0,
      "score": 2
    },
    {
      "id": "l8p93oa",
      "body": "It’s going to be okay",
      "created_utc": 1718440431.0,
      "score": 2
    },
    {
      "id": "l8qknj8",
      "body": "\"I am the sky, not the weather\"",
      "created_utc": 1718467252.0,
      "score": 2
    },
    {
      "id": "l9860ae",
      "body": "I’m here to talk to you if you need someone to talk to , you are not alone",
      "created_utc": 1718750619.0,
      "score": 2
    },
    {
      "id": "l9f0xwq",
      "body": "No matter what you’re going through, it’s gonna be ok",
      "created_utc": 1718857750.0,
      "score": 2
    },
    {
      "id": "l8ovaxn",
      "body": "Hi buddy, it is going to be okay if you don’t give up. \n\nI have felt really down sometimes, but now things are better. \n\nI have lost people that couldn’t keep going. That is extremely sad. \n\nI really want you to hang in there and I would like to share a video with you I just saw on YouTube that could help. \n\nPlease watch the whole thing. Brought a tear to my eye but great message to hear. Not my video.\n\nhttps://youtu.be/W_r8N5utEJU?si=eO5DbCtI9MOYf6WS\n\n🙏😊🤗",
      "created_utc": 1718430465.0,
      "score": 1
    },
    {
      "id": "l8p3xhq",
      "body": "Does it do any good if we don't know what's going on?",
      "created_utc": 1718436508.0,
      "score": 1
    },
    {
      "id": "l8p53yy",
      "body": "It's going to be okay, mate. When I go through tough times I remember what the guy in this video says\n\nhttps://youtu.be/WZ6VYoL7i70?si=_XtRhlvURvPhSD8F\n\nHope it helps",
      "created_utc": 1718437382.0,
      "score": 1
    },
    {
      "id": "l8p9mpm",
      "body": "Its gonna be okay this is just a chapter of your life and you can push trough I believe in you.",
      "created_utc": 1718440837.0,
      "score": 1
    },
    {
      "id": "l8pa1q9",
      "body": "My mother always used to tell me, so ill tell it to you. \n\nAs long as you dont kill someone or yourself voluntarily, with your actions... its only going to take realisation and repent. Itll be okay. It wont be the same, but itll be okay.\n\nLots of virtual hugs. All the best.",
      "created_utc": 1718441156.0,
      "score": 1
    },
    {
      "id": "l8pbp0p",
      "body": "It is going to be OK. Treat yourself tomorrow —  maybe a latte and a chocolate eclair? Or whatever works for you.",
      "created_utc": 1718442427.0,
      "score": 1
    },
    {
      "id": "l8pc4el",
      "body": "It could be",
      "created_utc": 1718442761.0,
      "score": 1
    },
    {
      "id": "l8pdook",
      "body": "All bad things shall pass, it’s going to be ok. I promise it won’t be like this forever. <3",
      "created_utc": 1718443916.0,
      "score": 1
    },
    {
      "id": "l8pds5n",
      "body": "I needed to hear this too. Thank you",
      "created_utc": 1718443998.0,
      "score": 1
    },
    {
      "id": "l8pe7kp",
      "body": "It's going to be ok. Life is full of ups and downs",
      "created_utc": 1718444358.0,
      "score": 1
    },
    {
      "id": "l8pec4k",
      "body": "It's going to be OK. I always say that everything will be ok in the end, and if it's not ok now, it's not the end yet. Keep going! Keep the faith that you will be alright.",
      "created_utc": 1718444465.0,
      "score": 1
    },
    {
      "id": "l8pekd3",
      "body": "Everything is going to be okay.",
      "created_utc": 1718444653.0,
      "score": 1
    },
    {
      "id": "l8pge8c",
      "body": "It's gonna be okay for real. You have reached this point as of right now and you encountered many obstacles and difficult experiences before and you will do it again because that's what you are and must be! A warrior that keeps fighting even when things are hard. You got this! Sending lot's of hugs in your way! ♡♡♡♡",
      "created_utc": 1718446147.0,
      "score": 1
    },
    {
      "id": "l8phhnp",
      "body": "It's so so hard to believe it in rough times. At my lowest I usually tell my friends and husband it feels like I'll always be this low and I'll never be happy again. They remind me I've said it before and I always have come out ok and I will again. Trust me, it's going to be ok. You're not alone. We are all here and have felt this and it's terrible but you will feel normal again. HUGE hugs. I am sending you grace and love.",
      "created_utc": 1718447010.0,
      "score": 1
    },
    {
      "id": "l8pifrv",
      "body": "I don't know enough about your life to say that it will be okay in the end, but I think people tend to get better at dealing with things the older they get.",
      "created_utc": 1718447745.0,
      "score": 1
    },
    {
      "id": "l8pixx5",
      "body": "It's going to be okay. It might not feel like it, right now. But it's going to be okay. Somehow, the thing, it passes. You don't think it will. And it just seems like it won't. But, somehow, it's going to be okay. Eventually.",
      "created_utc": 1718448128.0,
      "score": 1
    },
    {
      "id": "l8pjp0b",
      "body": "It’s going to be okay! Really! 💛",
      "created_utc": 1718448659.0,
      "score": 1
    },
    {
      "id": "l8pjv28",
      "body": "It’s going to be okay, you are stronger than you know. Even though I don’t know you, I’m sure you’ve done hard things before and I believe you can do it again. You’ll get through this hard time. 🤗",
      "created_utc": 1718448771.0,
      "score": 1
    },
    {
      "id": "l8plucs",
      "body": "It's all good man. It might suck now but it does get better.",
      "created_utc": 1718450046.0,
      "score": 1
    },
    {
      "id": "l8pohta",
      "body": "It's going to be okay. 6 months ago I reached a very low point in my life and I tried to take my own life and went to hospital. I almost got admitted to a psychiatric ward but managed to convince them I would be okay and my dad could look after me. \n\nEverything was already bad before this attempt, but afterwards, everything got so much worse. I lost most of my friends and people who I was close to, I dropped out of college, started doing drugs, lost all my parents trust, was in a cycle of starving a binging, self harming, stopped going to work. \nI stopped everything, hated everything, and had no joy in life. \n\nI couldn't stop thinking how all I wanted to do was make sure my next attempt was one that was quick and would 100% work. \n\nBut it got better. \nI started working again, I started doing martial arts, I'm going back to college and have a plan for my future,  I got sober, I'm slowly building a healthy relationship with food, I started going to the gym, going for walks, drawing, putting effort and energy into my therapy, journalling, praying, having faith.\nI have found a way to love myself and love life. \nI still struggle a lot sometimes, and some nights, I feel like I want to give up, but I don't, and in the morning, I feel okay again.\n\nI'm so happy that my attempt failed, \nAnd I'm so grateful to still be here, learning, growing, and experiencing. But most of all, I'm happy to be here with the people I love\n\nTrust me when I tell you, \nEverything is going to be okay.",
      "created_utc": 1718451649.0,
      "score": 1
    },
    {
      "id": "l8py51y",
      "body": "I wont start out with its gonna be ok but here is my take on things you gotta do things and make moves for life to be ok eventually. Take a day to get past the exhaustion and then take notes and write out a game plan. Things will come together and it will eventually be ok. 💯",
      "created_utc": 1718456911.0,
      "score": 1
    },
    {
      "id": "l8pybt5",
      "body": "Everything is going to get better.  It may take some time but it's all going to work out.  Your future is bright - keep moving forward, love.",
      "created_utc": 1718457008.0,
      "score": 1
    },
    {
      "id": "l8pz8ur",
      "body": "The last 4 1/2 half years have been some of the hardest of my life, but I’ve been around long enough to know it will change. Guaranteed. \n\nIt will change for you OP . It will be better soon. You will smile again and feel the sun, I promise you. Hold on.  <3,",
      "created_utc": 1718457489.0,
      "score": 1
    },
    {
      "id": "l8pzw00",
      "body": "❤️",
      "created_utc": 1718457825.0,
      "score": 1
    },
    {
      "id": "l8q1tiq",
      "body": "It’s going to be okay",
      "created_utc": 1718458805.0,
      "score": 1
    },
    {
      "id": "l8q39hu",
      "body": "Please look up polyvagal theory exercises on YouTube. It’s about regulating the state of your nervous system from defensive/shut down back into safe and connected. It will help you so much more than random strangers online.",
      "created_utc": 1718459516.0,
      "score": 1
    },
    {
      "id": "l8q44es",
      "body": "Yes, it will.",
      "created_utc": 1718459931.0,
      "score": 1
    },
    {
      "id": "l8q4i1l",
      "body": "it's all going to be ok.",
      "created_utc": 1718460114.0,
      "score": 1
    },
    {
      "id": "l8q5m8n",
      "body": "Biggest, hugest hugs to you my friend! The world needs you in it! So much love xoxoxo",
      "created_utc": 1718460642.0,
      "score": 1
    },
    {
      "id": "l8q6ell",
      "body": "Thank you for starting this thread. I am deep into darkness now and reading these responses has given me at least a thread of hope.",
      "created_utc": 1718461010.0,
      "score": 1
    },
    {
      "id": "l8q7qys",
      "body": "The world can be overwhelming and things might feel pointless, but I promise you it isn’t and things will be ok. We may take steps backward from time to time, but if we were able to take those steps forward before, we’ll be able to do it again and this time go even farther. You’re not alone.",
      "created_utc": 1718461628.0,
      "score": 1
    },
    {
      "id": "l8q8134",
      "body": "One way that I like thinking about it these days is less of \"everything will be okay\" and more of \"there are a lot of ways that this can be okay\". For me, that prompts me to see the fact that there are many different potential paths from here and I am not stuck.",
      "created_utc": 1718461756.0,
      "score": 1
    },
    {
      "id": "l8q8khz",
      "body": "Everything will be alright. One day at a time.",
      "created_utc": 1718462003.0,
      "score": 1
    },
    {
      "id": "l8q9vk4",
      "body": "Listen to Rainbow by Kacey Musgraves!! It will all be alright",
      "created_utc": 1718462595.0,
      "score": 1
    },
    {
      "id": "l8qaa34",
      "body": "It's going to be ok ... You woke up on the right side of the dirt. Can you move your limbs? If so, take a nice walk or a bike ride. If you can't do that then crawl ... any movement in the right direction is a **POSITIVE** thing.",
      "created_utc": 1718462773.0,
      "score": 1
    },
    {
      "id": "l8qeb53",
      "body": "It’s going to be ok",
      "created_utc": 1718464549.0,
      "score": 1
    },
    {
      "id": "l8qezx5",
      "body": "Just take a deep breath everytime it feel like it’s too much and take it step by step. It will be ok.",
      "created_utc": 1718464848.0,
      "score": 1
    },
    {
      "id": "l8qgozi",
      "body": "It’s gonna be okay and YOU’RE gonna be okay, and all your current worries will be a thing of the past.\n\nAs someone who has been divorced at 27yo, lost a house cause of it, pets split up, already lived 1000 miles away from home- my main support was just family through phone calls. Things eventually got better, I didn’t know it at the time but ‘I wasn’t always going to feel like that’. \n\nSince then I’ve had another 3 heart crushing relationships in 3 years. Every time sucks just as much but my mental willpower gets stronger, I know how to cope with life shifts, reason with myself that shit happens and my focus, journey.. story is about me.  \n\nNow whatever’s going on in your life that is unenjoyable rn.. our habits and friend group will shape your life. Take time to reflect if what you’re doing day to day is leading to who you want to be in 5 years. Are your people benefitting you?\n\nI’ve now gone through multiple promotions in my career, completely changed my body through bodybuilding, picked up various crafts/hobbies, seeked therapy, books that have helped me: The Body Keeps the Score, Atomic Habits, podcasts to keep the mind wandering: Theo Von, Jordan Peterson, Joe Rogan, Alex Fridman.\n\nStay blessed",
      "created_utc": 1718465582.0,
      "score": 1
    },
    {
      "id": "l8qtpgz",
      "body": "One of my favorite pieces of advice to people is that when they think of their problems, zoom out. The problem at hand may suck in the “today” scale of time. But the problems of today are not always the problems of forever. And if they are, then I’m sorry, but then you can consider ways to fix them or what can be done to make things better for you. \n\nBut often times, it calms me (and it seems like others as well) to “zoom out” on their problems and think in a longer term when they think about whatever is bothering them.\n\nI hope things get better for you OP. Keep your head up. Not every day can be bad, and someday you’ll look back and think “yeah that day really hurt. Thank goodness I made it through. Todays a beautiful day, and life is good.”",
      "created_utc": 1718470974.0,
      "score": 1
    },
    {
      "id": "l8qvhxb",
      "body": "Its gonna be alright. I made it out of overthinking . I overcame my OCD tendencies. So yeah it is gonna be okay. :)) \\*hug\\*",
      "created_utc": 1718471692.0,
      "score": 1
    },
    {
      "id": "l8qw01b",
      "body": "I feel you. Keep on keeping on friend",
      "created_utc": 1718471888.0,
      "score": 1
    },
    {
      "id": "l8qw1au",
      "body": "[removed]",
      "created_utc": 1718471902.0,
      "score": 1
    },
    {
      "id": "l8qw97d",
      "body": "It's going to be okay. Whenever you feel a burden we're all here. As a community. Reach out for help. Sending you all the love ❤️",
      "created_utc": 1718471991.0,
      "score": 1
    },
    {
      "id": "l8qzmus",
      "body": "Everything will be okay ♥️",
      "created_utc": 1718473340.0,
      "score": 1
    },
    {
      "id": "l8r07pc",
      "body": "It will. We dont really notice whats good in life until we hit the bottom and have to claw our way back up. You will slip, you fall again and again, but you will always get back up and you will, one day, you will be happy to be alive and to genuinely tell yourself that life is good. You will be alright friend.",
      "created_utc": 1718473564.0,
      "score": 1
    },
    {
      "id": "l8r0nka",
      "body": "You got this. It’ll be ok. It always passes. ALWAYS.",
      "created_utc": 1718473737.0,
      "score": 1
    },
    {
      "id": "l8r0rvd",
      "body": "I want to say that it will be okay with a plan.  \nHaphazard steps not so much. But even one step with a well thought plan, establishes a foundation for the rest of your life. And it may seem difficult but its possible and you have to keep working towards that with actionable steps to a goal. I have some inspirational links in my profile too.",
      "created_utc": 1718473786.0,
      "score": 1
    },
    {
      "id": "l8r0w06",
      "body": "You may need to give yourself the time and the space to allow things to become okay. \nIf you stay in a boiling pot, you’ll never cool down. \nUnplug from all devices for 24 hours ( more if you can ) \nNo tv \nNo hours of countless scrolling \nJust be in silence. \nAllow your mind to shut down a little. \nWith all the constant commotion going on around us all, our brains go into over drive which then causes chaos on the inside. \nYears of build up - \nTake some time to just truly let it go. \nCry \nScream\nCry some more \nLet it all out - \nAs much as you can get out right now. \nThat will be the first layer, I find the first layer is the hardest to peel, it’s become hardened, dirty, and protects our insides from all the trauma we face. If you can get that layer to peel off, you can begin working on the things you didn’t realize needed your attention. \n\nBecoming okay isn’t a snap of the fingers type of job, that is only masking, making our outer layer even harder to peel off. \n\nHowever - \n\nIt will get better. \nEven if you do nothing and just stare into the abyss at the moment, hang in there, hang in tightly and know that this too shall pass. \nIf you want it to truly get better, it takes work on your part. \nIf you’re unable to do any of the work right now, hug a pillow if you have no one to hold and just let it all out. \nIt’s okay to cry \nIt’s okay to not be okay \nLean on us - most of us are available to talk, willing to talk, and you won’t scare anyone away with those inner demons that are eating you alive. \nIf you believe in God, prayer and truly taking out all emotions with God works wonders - \nIf you don’t, use a person, but not a person who asks what’s wrong just to know, take it to someone who wants to know how they can help. \n\nWhat’s wrong and how can I help are two different questions that mean two entirely different things - \nBe wise with who you speak to ! \n\nAll of us here are cheering for you ! \n\nLarge group hug ! \nXx",
      "created_utc": 1718473833.0,
      "score": 1
    },
    {
      "id": "l8r1fks",
      "body": "In spite of everything, it’ll all turn out okay.",
      "created_utc": 1718474051.0,
      "score": 1
    },
    {
      "id": "l8r1mb6",
      "body": "\nIT'S GONNA BE OKAY!!!",
      "created_utc": 1718474133.0,
      "score": 1
    },
    {
      "id": "l8r36z0",
      "body": "It's even okay that everything is not okay.",
      "created_utc": 1718474775.0,
      "score": 1
    },
    {
      "id": "l8r3qki",
      "body": "Sending you hugs OP, everything’s gonna be fine. Remember crying, worrying and sobbing is not gonna change anything. Like I myself have cried so much when I was in your shoes only to realise this later that nothing changed but my eyes became hollower and my collagen tissue got worse. Please take care of yourself. Don’t be hard on yourself. I know it can hurt you but trust me, it’s gonna be fine💕💕",
      "created_utc": 1718474994.0,
      "score": 1
    },
    {
      "id": "l8r4x6d",
      "body": "This too shall pass. You got this. You are going to be okay.",
      "created_utc": 1718475467.0,
      "score": 1
    },
    {
      "id": "l8r54kg",
      "body": "It's going to be okay ❤️",
      "created_utc": 1718475550.0,
      "score": 1
    },
    {
      "id": "l8r5pn5",
      "body": "i hope my life will be okay too, i hope all of us will be okay",
      "created_utc": 1718475787.0,
      "score": 1
    },
    {
      "id": "l8r6b90",
      "body": "It’s going to be ok some days it seems like it isn’t but just don’t count those days. It’s going to be ok sometimes it feels like it’s the end but it’s not there’s always something else you haven’t done or your favourite meal you haven’t eaten recently or even just a song you haven’t heard in a while but whatever it is there is something you haven’t done. It’s going to be ok because there is always other things and people who can help even if you haven’t found them yet",
      "created_utc": 1718476043.0,
      "score": 1
    },
    {
      "id": "l8r7353",
      "body": "It's all going to be okay my friend!!",
      "created_utc": 1718476372.0,
      "score": 1
    },
    {
      "id": "l8r754f",
      "body": "You're gonna be alright. Hang in there sweetie ❤ and don't forget to breathe.",
      "created_utc": 1718476395.0,
      "score": 1
    },
    {
      "id": "l8r8bkw",
      "body": "it'll be alright buddy",
      "created_utc": 1718476886.0,
      "score": 1
    },
    {
      "id": "l8r8d03",
      "body": "it is i promise. i’m struggling right now too, but i listen to this song lyric everytime i feel worse. “this ain’t hell, it’s just high water” your flood will recede.",
      "created_utc": 1718476902.0,
      "score": 1
    },
    {
      "id": "l8r9ja4",
      "body": "It’s going to be ok. For a long time I thought it wouldn’t ever be again, and then one day it was. Hold on. Whatever happens, hold on. You’re not alone and the Sun will rise on you again my friend. Peace and love ❤️ ✌️",
      "created_utc": 1718477346.0,
      "score": 1
    },
    {
      "id": "l8r9tyu",
      "body": "It's going to be ok. My husband betrayed and left me over a year ago with a hoe with a lot of work needed and no family. I got a good new job to grow a future for myself and I asked for mental health services from them last week and got a lot of compassion. I have a good friend and if you asked me at the breakdown if I'd survive I really thought I wouldn't but here I am with things happening I could never have dreamed for myself. Your old life will cost you your old one and sometimes stuff needs to break down so you can build something better even if you don't know how to just yet",
      "created_utc": 1718477458.0,
      "score": 1
    },
    {
      "id": "l8rc5nx",
      "body": "You will be OK 👍",
      "created_utc": 1718478359.0,
      "score": 1
    },
    {
      "id": "l8re9bt",
      "body": "It’s gonna be okay. If it’s not a good day then a better ones just ahead.",
      "created_utc": 1718479178.0,
      "score": 1
    },
    {
      "id": "l8rfdew",
      "body": "it is ;) you waking up everday is proof that your incredibly strong and willing to push through",
      "created_utc": 1718479615.0,
      "score": 1
    },
    {
      "id": "l8rkdib",
      "body": "It’s going to be ok. It always gets better. I remember seeing something that said “there will be good times, and there will be bad times, but there will be good!” I thought my life would never look up after multiple psych ward stays and attempts over 10 years. Today, I can say I am genuinely happy and mentally stable. It takes times and it takes you wanting to get better. Look forward to the better days and you will be ok. Sometimes you have to go through it to get through it, but you can do it. Another quote that’s helped me: “whether you think you can, or you think you can’t, you’re right”",
      "created_utc": 1718481569.0,
      "score": 1
    },
    {
      "id": "l8rls9p",
      "body": "as someone who first tried to end their life at 9 and is still alive today at 20, it is 1 million % gonna be okay. accept help when you need it, surround yourself with people who accept you for who you are, know your worth, if you find comfort in religion, turn to it (it’s okay to not be religious), find hobbies you enjoy, and most importantly give yourself some grace. it’s your first time living, it’s all trial and error. you’ll find your peace. i’m proud of you. ❤️",
      "created_utc": 1718482112.0,
      "score": 1
    },
    {
      "id": "l8rqqlu",
      "body": "It’ll be okay.",
      "created_utc": 1718484027.0,
      "score": 1
    },
    {
      "id": "l8rqvk3",
      "body": "It'll be okay, it'll get better. Promise.",
      "created_utc": 1718484079.0,
      "score": 1
    },
    {
      "id": "l8rr1ju",
      "body": "The feelings will pass. You're going to be okay. Feelings are good servants but terrible masters.\n\nIt doesn't always rain and it won't be winter for all time.\n\n\nI know this is very easy for me to say. I hope in some small way it might help.",
      "created_utc": 1718484143.0,
      "score": 1
    },
    {
      "id": "l8rsu83",
      "body": "I've spent years crying. every time I broke down I would ask out loud why it's like this? when will it change? do I not deserve to be happy? I've asked myself a thousand times if I'm not worth the happiness. problems were always different. relationship, money, family, studies. but it was me who cried all night every night for years since I finished my school. \n\nI've recently finished my masters. life isn't perfect or at its best. I still don't have a job, have loans to payback. but it has become SO MUCH BETTER. shit does change. and it will be okay. \n\nyour body's ability to heal itself physically and mentally is absolutely miraculous, but sometimes it needs push. you just gotta believe that you will heal and watch the magic happen. I cannot tell you how soon, but you will be fine. it will get better! lots of love to you!",
      "created_utc": 1718484832.0,
      "score": 1
    },
    {
      "id": "l8rumrj",
      "body": "Everything is okay and it can/will get better. Congrats on asking for what you need!",
      "created_utc": 1718485527.0,
      "score": 1
    },
    {
      "id": "l8rx4lq",
      "body": "I promise it’s going to be ok. If day by day feels overwhelming, take it hour by hour. If even that is too much, take it minute by minute. Set very small goals for yourself (brushing your teeth, having a glass of water/meal, going for a walk). Baby steps. This is temporary. Be gentle with yourself. Sending heaps of love.",
      "created_utc": 1718486511.0,
      "score": 1
    },
    {
      "id": "l8s6uy5",
      "body": "It gets better. Sometimes it takes a lot of hard work. Getting to know yourself & work on past trauma.",
      "created_utc": 1718490530.0,
      "score": 1
    },
    {
      "id": "l8s9m14",
      "body": "You got people in your corner. You've got this!",
      "created_utc": 1718491708.0,
      "score": 1
    },
    {
      "id": "l8sb25n",
      "body": "i struggled with depression for so so long, and i still struggle. \ni recently got a job at a mental hospital. i help teens that were just like me. \nit gets better. it’s not good now, and that’s okay, but it GETS BETTER! \nyou did not wake up and choose to go through the pains of depression. no one wants that. you didn’t choose that, but you’re still here and you’re still fighting and i’m so proud of you, stranger. every breath you take is an achievement. every day you wake up is an achievement. every. little. thing. you do is an achievement.",
      "created_utc": 1718492330.0,
      "score": 1
    },
    {
      "id": "l8sdb2b",
      "body": "It'll be kk bb promise.",
      "created_utc": 1718493314.0,
      "score": 1
    },
    {
      "id": "l8se0n3",
      "body": "Everything is going to be okiii!!! Stay strong I believe in u ♡",
      "created_utc": 1718493621.0,
      "score": 1
    },
    {
      "id": "l8spb91",
      "body": "hey was in a bad spot for a year and unemployed and I just got a job after a year. and I feel like things might be turning for the better. I promise it will be okay",
      "created_utc": 1718498634.0,
      "score": 1
    },
    {
      "id": "l8su68b",
      "body": "It will be ok. One foot at a time, one breath at a time. We will go on.",
      "created_utc": 1718500869.0,
      "score": 1
    },
    {
      "id": "l8svqly",
      "body": "No. It's gonna be amazing. The road is rough as fuck though.",
      "created_utc": 1718501586.0,
      "score": 1
    },
    {
      "id": "l8sxcus",
      "body": "You’ll be okay,its been pretty rough for me lately,and ik ill be ok too",
      "created_utc": 1718502325.0,
      "score": 1
    },
    {
      "id": "l8t0xwt",
      "body": "It’s going to be ok.",
      "created_utc": 1718503969.0,
      "score": 1
    },
    {
      "id": "l8t6p0a",
      "body": "It's gonna be okay. I'm telling you definitely I don't know what u are going through right now but remember we always get back up, we are strong it's okay to be down sometimes and yeah u might feel like it's over or I can't have a good life or happy life from now but trust me it will be better. Just stand tall man, life is hard but you are harder...",
      "created_utc": 1718506690.0,
      "score": 1
    },
    {
      "id": "l8t6qox",
      "body": "You will be ok!",
      "created_utc": 1718506713.0,
      "score": 1
    },
    {
      "id": "l8t6tej",
      "body": "Sending love and light. Everything is going to be alright🩷",
      "created_utc": 1718506750.0,
      "score": 1
    },
    {
      "id": "l8t9tsh",
      "body": "It is going to be okay. And as my mom and grandma have said, this too shall pass. 💕❤😉",
      "created_utc": 1718508228.0,
      "score": 1
    },
    {
      "id": "l8tbnh9",
      "body": "Tell yourself it will be ok.  If you tell yourself it wont, you will believe that.  You are not your experiences, you are not your thoughts.  Life can be extremely difficult but thats ok you will be stronger after going through and gaining experience.  If it is only your thoughts on something you will be ok. If you are young and experiencing something new dont worry stuff happens but the initial shock is tough.  I dont know your situation but pain is pain and as a middle aged person I have come to a point where I dont give a shit as long as I can take care of myself its good.  Life is short so I recommend not giving a crap about the bad stuff and focusing on good stuff and making good stuff happen and enjoying it.  If its bad fight until its good.  Expect the worst hope for the best.  Even when it sucks, so what just keep it movin.  Your perception of your situation matters so are you a glass half full or empty? You got this you need to give yourself a chance.",
      "created_utc": 1718509132.0,
      "score": 1
    },
    {
      "id": "l8tddnz",
      "body": "Its going to be okay",
      "created_utc": 1718510027.0,
      "score": 1
    },
    {
      "id": "l8teqop",
      "body": "It is going to be okay. Take a nice little sleep with something you feel cozy in &/or with. Look at funny animal videos on YouTube. Remember that even when we feel not at our best, the sun will always rise and present new opportunities for the next day. \n\nYou are brave, you are strong, you are kind, you are loved, you are resilient, and most of all — you are WORTHY to be here.",
      "created_utc": 1718510746.0,
      "score": 1
    },
    {
      "id": "l8tifid",
      "body": "Everything will be okay, you just can't see that right now 🫂",
      "created_utc": 1718512776.0,
      "score": 1
    },
    {
      "id": "l8tlzci",
      "body": "I attempted suicide once when I was 20 and my body puked everything out. Since then, over 15 years afterward to today, I've slowly began trusting that your body and your mind operate independently of each other. They cooperate harmoniously, but the body will do what it needs to keep going. It's quite incredible how, if you feed it well and treat it well, it also takes care of your mind in phenomenal ways. Your mood changes (endorphins), your outlook changes, and so on. Your *mind* gets taken care of by your *body*. So, since a body does its own thing and just tries to keep going, I became fascinated by health, nutrition, and overall wellness...which does wonders for the mind. All that said, trust that your body is rooting for your brain to not just survive, but to live. To really *live* life. It can get better, and because every forthcoming day essentially resets literally every 24 hours, your life can reset, too. It's natural. And that's incredible to think about. If you trust that, then trust that it *will* get better.\n\nYou got this. Power and peace. Since you're human, too, and thus part of nature, you deserve to be happy. You got this ✊️✌️💫🤗",
      "created_utc": 1718514861.0,
      "score": 1
    },
    {
      "id": "l8tyfz9",
      "body": "It's going to be okay! I believe in you! I'm proud of you for getting through the day!",
      "created_utc": 1718523221.0,
      "score": 1
    },
    {
      "id": "l8u4h48",
      "body": "It's going to be okay ❤️",
      "created_utc": 1718527632.0,
      "score": 1
    },
    {
      "id": "l8u61sz",
      "body": "It’s gonna be okay 🫶",
      "created_utc": 1718528818.0,
      "score": 1
    },
    {
      "id": "l8uu6fc",
      "body": "It's going to be okay bro",
      "created_utc": 1718543855.0,
      "score": 1
    },
    {
      "id": "l8v0t7w",
      "body": "It's going to be okay",
      "created_utc": 1718546787.0,
      "score": 1
    },
    {
      "id": "l8vot7x",
      "body": "You are exactly where you are supposed to be. You will be okay. You are stronger than you may believe right now.",
      "created_utc": 1718556192.0,
      "score": 1
    },
    {
      "id": "l8vrms2",
      "body": "There there. It will be ok. If this many people are saying it already, that means there are people to care.",
      "created_utc": 1718557258.0,
      "score": 1
    },
    {
      "id": "l8xgqvj",
      "body": "It took me a few years! Just keep at it! Small wins build over time.",
      "created_utc": 1718580974.0,
      "score": 1
    },
    {
      "id": "l90auke",
      "body": "It’s 100% gonna be okay if you need to talk I’m here",
      "created_utc": 1718636011.0,
      "score": 1
    },
    {
      "id": "l90uhtu",
      "body": "It’s going to be okay. Maybe not now. But it will. Don’t trust your thoughts and emotions too much.  Someone is crying for you too. 🥹\n\n\n“For I know the plans I have for you,” declares the Lord, “plans to prosper you and not to harm you, plans to give you hope and a future. Then you will call on me and come and pray to me, and I will listen to you. You will seek me and find me when you seek me with all your heart. I will be found by you,” Jeremiah 29:11 - 14",
      "created_utc": 1718642805.0,
      "score": 1
    },
    {
      "id": "l91jbxf",
      "body": "Definately will be ok.\nI have been there its a long journey.\nGet med and CBT and things will be ok just do not rush.",
      "created_utc": 1718651081.0,
      "score": 1
    },
    {
      "id": "l91rjw9",
      "body": "You will be ok.. Grab ahold of God... he is for you. Take one minute by minute.  I am going through hellious stuff too. But,hanging on for dear life. We will get to the other side of this place we are in. Hunker down in the boat, ride out the waves... the shore and peaceful land is on the horizon.  Let Jesus tell the winds and waves \" PEACE.. BE STILL\"",
      "created_utc": 1718653860.0,
      "score": 1
    },
    {
      "id": "l92ncn5",
      "body": "I'm a suicidal 16y teenager. I was abused until I cried at the mere mention of going to my father's. I was exposed to pornography at 7 and I've had a rough addition since then. I have anxiety, trust issues, anger issues, depression, and suicidal thoughts. I tried to kill myself in second grade because I had no friends.\n\nBut more importantly. I have friends and family who will support me and have my back. And so far my life hasn't gone downhill. I don't have any criminal record. I help my friends with there problems and they help me. It's ok to not understand life. And sure sometimes I hate myself for stupid shit. But it's going to be ok. This is jsut a moment in your life that's really sucky. I've gone through hell and I found heaven. So keep fighting!",
      "created_utc": 1718665149.0,
      "score": 1
    },
    {
      "id": "l94x3gp",
      "body": "I been there and I'm 24 years old and my father slap my butt twice and I feel so uncomfortable everytime and I hope he doesn't do it again 💔 ",
      "created_utc": 1718708006.0,
      "score": 1
    },
    {
      "id": "l96eled",
      "body": "It's not going to be ok, but you are. Life will always throw curve balls at you and sometimes three at once but you will get hit, then catch them, than bat them out of the park (I've never made a sports reference so I hope that made sense). You are stronger than you know.",
      "created_utc": 1718729120.0,
      "score": 1
    },
    {
      "id": "l97x9r0",
      "body": "It’s going to be ok",
      "created_utc": 1718747304.0,
      "score": 1
    },
    {
      "id": "l985oeh",
      "body": "It’s going to be okay I promise. You are loved",
      "created_utc": 1718750490.0,
      "score": 1
    },
    {
      "id": "l98cbsm",
      "body": "It will be ok!!",
      "created_utc": 1718753115.0,
      "score": 1
    },
    {
      "id": "l98cf70",
      "body": "It'll be okay ❤",
      "created_utc": 1718753152.0,
      "score": 1
    },
    {
      "id": "l9916ox",
      "body": "You're alive, aren't you? You're fed at least once every 2 days, aren't you? You're surviving, aren't you? You're clothed, aren't you? So you aren't completely hopeless. And here's a bonus! If you are hopeless, know that there's no way to go but up. So, it'll get better. Time is attempting to kill you right now, but you're alive, aren't you? So live long enough for time to heal the wounds it caused. ",
      "created_utc": 1718763250.0,
      "score": 1
    },
    {
      "id": "l99cby7",
      "body": "Everything gonna be okay",
      "created_utc": 1718768221.0,
      "score": 1
    },
    {
      "id": "l9c9vg9",
      "body": "It’s gonna be okay. I bet that you’re a wonderful person and I know that you are brave and strong enough to get through this. You got this🫶",
      "created_utc": 1718819541.0,
      "score": 1
    },
    {
      "id": "l9cu4sy",
      "body": "It will be okay, you are not alone",
      "created_utc": 1718826388.0,
      "score": 1
    },
    {
      "id": "l9l8nkn",
      "body": "It’s going to be ok sweetie x I’ve had some really rough times with trauma and anxiety and depression and generally with my mental health but eventually I’ve been able to get through it x chin up and try and surround yourself with good family and friends xx",
      "created_utc": 1718960003.0,
      "score": 1
    },
    {
      "id": "l9pf4p5",
      "body": "hey!! would you like to join a mental health/ recovery server? we're brand new looking to build and looks like something that could be a good support for you 💗",
      "created_utc": 1719021103.0,
      "score": 1
    },
    {
      "id": "lp9yyxs",
      "body": "You’re going to be ok. I constantly have to remind myself of this… but the fact is, we’re going to be ok. Much love.",
      "created_utc": 1727486690.0,
      "score": 1
    },
    {
      "id": "l8oodn2",
      "body": "It is definitely going to be okay. <3 And Jesus definitely does love you and has a plan for your life. You might consider talking to him about whatever it is that has been bothering you. But my DMs are open as well. <3",
      "created_utc": 1718426022.0,
      "score": 1
    },
    {
      "id": "l8oargh",
      "body": "It’s going to be ok for you too. 🫂",
      "created_utc": 1718418796.0,
      "score": 122
    },
    {
      "id": "l8skzbz",
      "body": "Can you DM me and tell me what that is like? Did it help?",
      "created_utc": 1718496690.0,
      "score": 3
    },
    {
      "id": "l8soq5k",
      "body": "You will be fine.  Here's a hug!",
      "created_utc": 1718498366.0,
      "score": 3
    },
    {
      "id": "l8wa73y",
      "body": "“Hi- you GOT This your on the tend to mend!!”",
      "created_utc": 1718564198.0,
      "score": 2
    },
    {
      "id": "l8pqhqs",
      "body": "🫂",
      "created_utc": 1718452804.0,
      "score": 6
    },
    {
      "id": "l8q473g",
      "body": "Great saying . Love that",
      "created_utc": 1718459967.0,
      "score": 13
    },
    {
      "id": "l8uj4ot",
      "body": "Thank you, I needed to read that",
      "created_utc": 1718538045.0,
      "score": 2
    },
    {
      "id": "la5r4vg",
      "body": "That advice sounds like someone very dear to me would have said. Thank you 🤗",
      "created_utc": 1719288847.0,
      "score": 2
    },
    {
      "id": "l9zlmmh",
      "body": "This is you",
      "created_utc": 1719192994.0,
      "score": 1
    },
    {
      "id": "la8stsz",
      "body": "I hear this to often not percicely the way you worded it because your words are deeply felt. Thank you! I too been there hoping not to wake up if only to make the pain completely go away but I failed at that. I know there’s more to life I’m sure gods got a bigger plan something I’m missing I just wish I could better understand. I e been disappointed with the way people are how awful and selfish someone can really be. Knowing that people can be deceiving I was untrusting of the world not knowing the one I confided and lived the most my husband would be the one who would be hurting me the most.",
      "created_utc": 1719340248.0,
      "score": 1
    },
    {
      "id": "lc5u2u6",
      "body": "Beautifully written.",
      "created_utc": 1720425241.0,
      "score": 1
    },
    {
      "id": "l8ow66s",
      "body": "You and I both. It’ll be ok for us",
      "created_utc": 1718431035.0,
      "score": 10
    },
    {
      "id": "l91plss",
      "body": "Loved your wisdom... I needed to read it.   ",
      "created_utc": 1718653208.0,
      "score": 3
    },
    {
      "id": "l91pya8",
      "body": "You will be OK. One minute at a time.  God is with you. When you hit bottom He is already there. Hang in there, you got this.",
      "created_utc": 1718653324.0,
      "score": 3
    },
    {
      "id": "l8rgudq",
      "body": "If you're alive, you're going to be okay.\n\nI have chronic depression. Every day, I wish I wouldn't wake it (I'm not suicidal though). I'm just tired. My life has been full of trauma. Neglect and sexual abuse as a child. Then, I was in a physically and emotionally abusive relationship for 15 years. I left him 13 years ago and have been single since. I have huge trust issues. I don't have kids, I'm not close to family or friends, im disabled and can't work because I have severe scoliosis. I have a rare voice disorder called spasmodic dysphonia. All I have are my 2 dogs, which mean the world to me. I have Complex PTSD and feel numb 100% of the time, with the exception of feeling depressed and extremely lonely at times.\n\nI felt worthless for the longest time, and it took me 42 years to realize I am worthy. Some stranger on fb commented to me, and something instantly clicked in my brain. I actually felt i wasn't even worthy of receiving help. But what she said, it made me think, \"Why is everyone worthy except me? That's not right.\" It was weird, and since then, I feel like im worthy. Did it help with my numbness and depression? No, but it made stop the constant negative thoughts I had about myself. Every time I had a negative thought, I'd make myself stop. I always thought it would never work if i replaced my negative thoughts with positive thoughts. But shit, it does! I still have negative thoughts, but it isn't nearly as bad as it was. \n\nBut through all this, I know I'm okay. \n\nI've had a lot of trauma many people will never experience, but then I've never experienced certain traumas someone else might have gone through. I've been lucky and haven't lost anyone close to me. Except my dog 13 years ago. I cried for a month when he died and I still think of him and my other passed pets every day. Compared to some people's lives, my life has been easy. But we need to stop comparing ourselves to others! \n\nEveryone's life path is different. Yeah, some people may look like they have it easier, but really, we don't know what they're going through. Some people have it a lot worse. Look at the people in the Middle East or the countries full of poverty and war. Little kids with no parents or homes. Those are just a couple of examples. That doesn't include people who've lost loved ones, whose family doesn't speak to them, whose life instantly changed by an accident. Whose parents might be abusive narcissists. \n\nBut anyway, you might not feel okay and have a lot of shitty, negative thoughts in your head. But you will be okay. Humans are resilient. We can get through anything. We might not think so at the time, but wait, and it will eventually change. Plus, if life was easy, what would we learn? Life is about becoming stronger and learning. \n\nHave you ever heard positive energy attracts positive, and negative energy attracts negative? Like those days when you wake up in a bad mood, and everything goes wrong? You catch every red light, you spill your coffee, your laptop is being slow, stupid annoying things keep happening. Your negative energy is attracting more negative energy. Think about it next time it happens, it's interesting.\n\nSending you love and light!💗🌟💞 I don't know what you're going through, but you got this! You'll be okay! Please, reach out if you need to! There's so many reddit users who care!💜❤️💜",
      "created_utc": 1718480200.0,
      "score": 3
    },
    {
      "id": "l8rbg2r",
      "body": "We are not medical professionals and cannot diagnose you or give medical advice. If your mental illness is preventing you from doing things you want to do, or if you have started structuring your life around your mental illness, you should get evaluated by your doctor.\n\nIf you would like to discuss this removal, please contact the moderation team using the [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1718478086.0,
      "score": 1
    },
    {
      "id": "l8w7hl1",
      "body": "I tried, but it’s not letting me. I don’t know why. I’m sorry. Maybe try sending me one first.",
      "created_utc": 1718563180.0,
      "score": 3
    },
    {
      "id": "l8scuz8",
      "body": "Thanks. This actually helped a little",
      "created_utc": 1718493120.0,
      "score": 3
    },
    {
      "id": "l8v5m0x",
      "body": "Lmaoooo diagnose me is wild 😂😂 mf can’t do motivational speaking in 2024 I guess, talking about manifestation just like every motivational speech on YouTube does, probably cuz I said stop taking meds lmao, but the reality is big pharma profits off making you dependent on their overcharged services 🤷‍♂️ can’t believe you guys actually removed this comment, that’s ridiculous and is exactly why reddit is down the shitter with censorship, gfy",
      "created_utc": 1718548752.0,
      "score": 1
    },
    {
      "id": "l8y2w0z",
      "body": "Sent",
      "created_utc": 1718590985.0,
      "score": 3
    },
    {
      "id": "l8sktt1",
      "body": "Sometimes life just freaking sucks or/and our mood is shitty. We have to roll with it and try to cope. Just realize it will pass and won't last forever.",
      "created_utc": 1718496622.0,
      "score": 2
    }
  ]
}