{
  "id": "1dvnfbf",
  "title": "A Lush Employee bought me a bathbomb today and it may have saved my life.",
  "selftext": "I hit rock bottom a couple years ago and lost everything due to clinical burnout, mental illness, trauma, and multiple deaths in my immediate family. I had no income because everyday I was struggling to keep myself alive and couldn’t work, so my bills stacked up quick from only being able to make minimum payments; and sometimes having to delay payments so I could eat. \n\nThis year has been a huge turning point for me and I was able to get a job that I love, but it’s only part time and I had to do a slow-return to prevent burnout. I’ve been slowly paying back my bills, but I guess someone got fed up with me and the bank ended up taking all my money for this month. I found out in Lush when I tried to buy a single bathbomb for my aching muscles after long retail hours. \n\nMy card declined. I played it off and left the store in a panic trying to figure out why I didn’t have five dollars, and I saw that the bank drained my account. My face must have given me away, because the cashier ran out of the store with the bathbomb I’d failed to purchase and just put his hand on my shoulder and told me it was ok. I almost didn’t take it, I was so shocked, and asked if he was sure, and he said “it’s just a bathbomb”. \n\nI got into my car and started to sob, not knowing how I am going to eat and pay the rest of my bills this month, and I had moments where I wanted to drive somewhere and not return - but my mind kept coming back to this person who showed me such kindness and generosity, a stranger, and they in no way were required to help me. \n\nI’m still emotional over it; and I plan on thanking him when I get the bandwidth to do so. Let this be a message to show people small kindnesses when you can, because you may well be saving a life and giving hope. ",
  "created_utc": 1720146340.0,
  "score": 309,
  "num_comments": 14,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1dvnfbf/a_lush_employee_bought_me_a_bathbomb_today_and_it/",
  "comments": [
    {
      "id": "lbovzc5",
      "body": "[deleted]",
      "created_utc": 1720148521.0,
      "score": 37
    },
    {
      "id": "lboxcy7",
      "body": "I always say you never know what someone is going through so be kind whenever possible. You are going to get through this. It’s just a blip on your life radar. Thank you for sharing your story, There are good people in this world.",
      "created_utc": 1720149181.0,
      "score": 28
    },
    {
      "id": "lbp8gwk",
      "body": "Remember this and pass it forward one day. Not because you owe it but because it will feel good",
      "created_utc": 1720155001.0,
      "score": 16
    },
    {
      "id": "lbpet19",
      "body": "Such a sweet story ❤️ And I’m so sorry to hear you have struggled. Now you’ll have this amazing story to tell people from now on though!\n\nAlso, look up and see if Lasagna Love is in your area. They accept any reason listed as a reason to sign you up for a lasagna. They intend to help as many people as possible feel a bit of emotional and physical support that a home style meal can bring.",
      "created_utc": 1720158699.0,
      "score": 11
    },
    {
      "id": "lbrzllp",
      "body": "This is a super sweet and inspirational story. Please folks remember that if you are struggling and can't afford food try to check out your local food pantry. They are here to help people in need and it's normally no questions asked. Take that bill off your plate until you are stable again so. I know not everyone has a local food pantry available but if you do and you need help please go there, they will help you.",
      "created_utc": 1720202710.0,
      "score": 4
    },
    {
      "id": "lbrz8d0",
      "body": "[removed]",
      "created_utc": 1720202587.0,
      "score": 2
    },
    {
      "id": "lbvqu56",
      "body": "Awww, thanks for sharing it. We often forget that we are human beings, and some are going through difficult moments. \n\nI wish I could invite you for dinner 💜",
      "created_utc": 1720266654.0,
      "score": 2
    },
    {
      "id": "lbz5jbb",
      "body": "UPDATE: I’m a multifaceted artist and I made a bracelet for him that I’m taking tomorrow :)\n\nThe beads are pretty special - I’ve had them since I was a teenager, they were rescued from bracelets I wore that broke.\n\nhttps://preview.redd.it/uqf9lsi1xzad1.jpeg?width=1242&format=pjpg&auto=webp&s=9206d4de78e7971c2bfd43e68ad186a13985217c",
      "created_utc": 1720314099.0,
      "score": 1
    },
    {
      "id": "lc1rsp9",
      "body": "You are doing amazing, and I'm so happy that things started to look up for a bit. It'll happen again, you'll get there. \n\nKindness matters ❤️ \n\nThe smallest things can have the biggest impact.",
      "created_utc": 1720364907.0,
      "score": 1
    },
    {
      "id": "le4knyr",
      "body": "Hope things improve soon. Sometimes a little thing like this can make all the difference to your day",
      "created_utc": 1721505284.0,
      "score": 1
    },
    {
      "id": "lbszpsn",
      "body": "❤️",
      "created_utc": 1720215034.0,
      "score": 2
    },
    {
      "id": "lbszjio",
      "body": "Thanks. \n\nI have to figure something out, I have $1 in my bank account 🥲\n\nI hardly want to eat anyway when the depression sets in. It’s crazy what I can survive off of when I have no desire for anything.",
      "created_utc": 1720214974.0,
      "score": 1
    },
    {
      "id": "lbszn4l",
      "body": "I wouldn’t be alive without therapy. Thankfully I am getting that at least.",
      "created_utc": 1720215009.0,
      "score": 1
    },
    {
      "id": "lbz90p6",
      "body": "Aw thats so sweet 🥹",
      "created_utc": 1720315600.0,
      "score": 1
    },
    {
      "id": "lbvmhzg",
      "body": "Do check for lasagna love if your area - lasagnalove.org/zip-code   It’s a non profit of neighbors helping neighbors by preparing and delivering a homemade lasagna dinner to someone in need. And we do not quantify need. That feeling of a stranger doing a kindness is what they are about.  It’s not emergency food as it takes time to match with a volunteer however if it available in your area they allow repeat requests.",
      "created_utc": 1720264111.0,
      "score": 2
    }
  ]
}