{
  "id": "1k79faw",
  "title": "Realized I have irreversible gum disease at 25 and it has now completely destroyed my mental health and my life",
  "selftext": "About a month ago I started having problems with my gums , I decided to go to a dentist and was 75% sure that I had it. Dentist told me I don’t and then felt relived. Decided to post my diagnosis on a dental sub Reddit because of how happy I was and basically got told “nope you have it there’s no way you don’t “ and immediately fell back to step 1\n\nI was on the biggest health kick and was so high off life and now I literally go to work , cry all day, get drunk as fuck to forget and repeat. I stopped going to the gym and doing things I love. It’s all I think about and I genuinely do not enjoy my life any more.   I’m starting to get those “I don’t want to live anymore thoughts” except this time I have a chronic disease so it will be here for probably ever now . I don’t think I’d ever actually go through with something that far but man I just really hate life rn. Why did this have to happen to me at 25 \n\n\n",
  "created_utc": 1745545848.0,
  "score": 499,
  "num_comments": 147,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1k79faw/realized_i_have_irreversible_gum_disease_at_25/",
  "comments": [
    {
      "id": "mpse59f",
      "body": "**Hello u/!**\n\nThank you for using a content warning. \n\n---\n**If you are in immediate crisis:**\n- Visit [Find A Helpline](https://findahelpline.com/i/iasp) for local hotline info.\n- Check [Hotline FAQs](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) for guidance.\n- Consider posting on r/suicidewatch or messaging their moderators [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch).\n\n---\n**For suicidal thoughts or self-harm:**\n- [HelpGuide](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) offers coping tips.\n- You are not alone – see personal stories on YouTube.\n- Practice grounding exercises or listen to your favorite music.\n- Refer to [Find A Helpline](https://findahelpline.com/i/iasp) for more resources.\n\n**Take care and stay safe!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1745987689.0,
      "score": 1
    },
    {
      "id": "mowelg6",
      "body": "I'm sorry this is happening, but your dentist said you don't have it, and he was inside your mouth. I wouldn't take people off Reddit's opinions as total fact.",
      "created_utc": 1745546605.0,
      "score": 1095
    },
    {
      "id": "moweh3e",
      "body": "Im a dental hygienist and I saw you post. Its really not advanced, you have no pockets and it doesnt look swollen or red. From a dental diagnosis perspective, you should trust your dentist and follow their advice. Also dont skip follow ups!",
      "created_utc": 1745546564.0,
      "score": 481
    },
    {
      "id": "mowfby9",
      "body": "Wait but your dentist, who looked at your mouth, said you dont have it. Why would you believe people on Reddit? It sounds like you’ve just decided you have this thing and you’re determined to believe whatever confirms it.",
      "created_utc": 1745546852.0,
      "score": 208
    },
    {
      "id": "mowztfs",
      "body": "When I was 23 I had it (periodontal disease) worse than you have it now. I was sure I’d need surgery and was going to have all sorts of problems. Here I am 20 years later and totally fine. I never had surgery but I did have several unpleasant dental visits to clean under the pockets or whatever. I started treating it at that age and it never got any worse. Honestly my oral hygiene didn’t even improve that much, I never got in the habit of flossing but I did get an electric toothbrush and made sure to specifically brush the gums. I’m mid-40s now and I still don’t have a ton of gum tissue on the bottom but what I do have is healthy and pink, not loose/red/swollen like it was. It’s never sore, doesn’t bleed when I brush. Basically it’s been a total non-issue in my life for the most part and I haven’t even thought about it in ages.\n\nI think your anxiety might be the bigger issue right now. I wish I had gotten treatment for THAT at your age instead of waiting until my 30s.",
      "created_utc": 1745554587.0,
      "score": 46
    },
    {
      "id": "mowwb2q",
      "body": "Isn’t the worst case that you could eventually apply for implants or dentures. I know it’s not ideal, but it’s still an option.",
      "created_utc": 1745553081.0,
      "score": 22
    },
    {
      "id": "mowdcw2",
      "body": "This body that you have is temporary. your mind is what makes you beautiful.  I am 44 years old with unreverseable gum disease, doesn't matter.  Physical attraction is superficial and doesn't matter.  Mental health is more important, get your mind right, and you will be all right.",
      "created_utc": 1745546194.0,
      "score": 78
    },
    {
      "id": "mox0y8l",
      "body": "If this is messing up your functioning 1) get a second opinion. You’ve said mannyyy times that these doctors are verified. Don’t matter get one in person so you know a professional in person can then actually treat you. because they’ve diagnosed you unlike the first which didn’t and the ones online cannot. 2) you need to find  positive ways to go forward. I understand you need to accept that you may have it, and I can see why this would be very hard to process BUT you are driving your mental health down. How is that productive? How are you helping yourself navigate this in a better more healthy way? So what now you have this gym disease—how can we make this experience better and less painful? Or at least bearable so that you can drive yourself forward not downhill. 3) go to therapy. You need professional guidance to help you navigate the emotional and mental journey of having a chronic disease, which you are currently struggling on your own and need more support.",
      "created_utc": 1745555081.0,
      "score": 14
    },
    {
      "id": "mowv65p",
      "body": "Your mouth doesn't look terrible at all from the images you posted. It is so common to have this issue, kind of like how the majority of people have the herpes simplex HSV-1 virus in their body, which can occasionally cause cold sores, but it's not a big deal at all.\n\nYour dentist probably doesn't think your case is severe enough to warrant an official diagnosis, even if there are early symptoms, because they are manageable at this stage and shouldn't cause any further issues as long as you keep up with dental hygiene and periodic visits to the dentist for cleanings. This can also be an insurance issue - if you don't need specialized treatment, doctors will sometimes hold off making an official diagnosis so that it won't come up as a pre-existing condition later if you do ultimately require said treatment.\n\nEither way, your dentist is not worried and you shouldn't be either. \n\nIf it's any consolation, I just had 8 teeth pulled and now I have issues from sharp ridges of my gum bone sticking out of my gum on the lingual side of my lower wisdom sockets. After I get that sorted, I have to have braces put on for 18 months. And then I'm getting jaw surgery where they'll break my jaw and reset it and my jaw will be wired shut for 6 weeks. \n\nI'm not telling you this to play pain olympics, because I know that the anxiety and discomfort you are feeling right now is genuine and it's totally valid. I just want to give you some perspective. My dental issues are rare (I have a connective tissue/hypermobility disorder that effed up my jaw) and hard to treat. Still, I will take a deep breath and be fine. Your dental situation is extremely normal, very treatable at a maintenance level, and you will also be fine :) I wish you the best!",
      "created_utc": 1745552615.0,
      "score": 27
    },
    {
      "id": "mowxkus",
      "body": "I had a similar freak-out, except it was because a creepy dentist told me I have extreme gum recession and needed some $5k grafting treatment. I went to another dentist for a 2nd opinion and he suggested I do cleanings quarterly instead of 2x/year & add fluoride treatments which can help sensitivity. He also takes measurements & the recession has not gotten any worse over 10+ years. I recommend discussing a similar plan with your dentist.",
      "created_utc": 1745553613.0,
      "score": 14
    },
    {
      "id": "mox3o6u",
      "body": "Dude. Go to a periodontist. Dont let reddit play around in your mind like that. Anyway, I had some pretty bad gum disease, went to a periodontist (basically a dentist specializing in gum health) and we turned back the clock quite a bit with a procedure. Some much better flossing and oral hygiene on my part later, plus some regular dental cleanings at the dentist, and my gums are tip top thank you very much.",
      "created_utc": 1745556325.0,
      "score": 12
    },
    {
      "id": "moxjavz",
      "body": "Wait what? I've had gum disease since I was like 23 (I'm 35 now) and I don't even think about it. I think a lot of people have it. I also have TMJ disorder, a billion cavities (can't go to the dentist 'cause of the TMJ lollll), probably an ovarian cyst (doctors don't care), etc etc etc. I'm just living my life, these things don't make me depressed. Gum disease is the least of your problems, go get a deep gum cleaning.",
      "created_utc": 1745564818.0,
      "score": 11
    },
    {
      "id": "mowdtow",
      "body": "Its okay, I understand this is entirely hard to navigate and it can bring a lot of emotions.\n\nJust understand that the things you find happiness in will come soon after some work with acceptance.\n\nI have Crohns disease and was devastated. It took me a year and half to come to terms with my new life but with a bunch of medicine and help of my health care team I can live a relatively decent life without chronic pains.\n\nI am not sure the specific diagnosis here but I do hope you have the same outcome and that there's ways you can cope with a support group. You're free to chat with me if you need any support.",
      "created_utc": 1745546347.0,
      "score": 10
    },
    {
      "id": "mox3xss",
      "body": "dude, the pic you posted looks fine",
      "created_utc": 1745556450.0,
      "score": 10
    },
    {
      "id": "mox68gd",
      "body": "Gum disease is common and a very manageable health issue, def not something to self harm over",
      "created_utc": 1745557573.0,
      "score": 10
    },
    {
      "id": "mox7z9r",
      "body": "I’ve had many issues with my teeth for a long time, including gum disease. I’m 29, will be 30 this year. I say this with the most sincerity I can- there’s so much worse to deal with. Maintain taking care of your teeth and you should be able to prolong your dental health. \n\nI have many chronic illnesses in addition to my crap teeth. I would gladly deal with my teeth and gums only instead of dealing with chronic pain, chronic fatigue, and multiple autoimmune illnesses. You still have your whole life ahead of you and this isn’t the worst thing in the world, I promise. Especially if a dentist who has been inside your mouth has told you that it’s not something to worry about.",
      "created_utc": 1745558463.0,
      "score": 7
    },
    {
      "id": "mowty64",
      "body": "Regular use of a waterpik with periogen or the like has been known to reverse supposedly irreversible gum disease.",
      "created_utc": 1745552128.0,
      "score": 6
    },
    {
      "id": "mox6sx2",
      "body": "I’ve been battling compounded dental issues since 2020. I’ve easily spent $10k on my teeth in the last 5 years. It’s really overwhelming. I also got really down on myself about it. But don’t get stuck there. I got so stuck on how much everything was going to cost, and how badly I felt about myself and my smile, that I wasted time lamenting my dental issues, instead of handling them. Pushing off appointments for a few months can lead to rapidly increasing costs. \n\nIt sucks. Dental issues/work is painful, expensive, and embarrassing. But you gotta get over it and act swiftly. Find yourself a  good dentist who has a solid network of specialists they work closely with. Make sure you have the best dental insurance available to you. Get a water-pic, lots of floss, and a good tooth brush. I’m sorry you’re in this position, it sucks.",
      "created_utc": 1745557860.0,
      "score": 7
    },
    {
      "id": "moxdyc1",
      "body": "But like, so? You aren't going to die, and your life is ultimately unchanged, besides you personally taking it upon yourself to sabotage it. \n\nJust brush your teeth and prevent anymore avoidable damage to yourself that will cause you to repeat this all again.",
      "created_utc": 1745561687.0,
      "score": 6
    },
    {
      "id": "moxmrjw",
      "body": "hey man, take a second okay? hear me out for a second and think about it with logic and not your fear (i.e the fear of something life changing that you otherwise could have controlled if you’d worked on it).\n\nyour dentist said you are okay.\n\nbut you have really bad anxiety so the doctors on reddit said that you do have it, so your anxiety is latching onto this affirmation of your fear and it is making it hard for you to see any other angle. \n\nthe doctor that was physically inside your mouth and physically in their hands, saw your xrays. said that you are OK.\n\ntrust your doctor. it’s ok to be anxious and scared about something that can be permanent and life altering. but it probably doesn’t affect you physically. only in your head.\n\nget a second doctor’s opinion if you don’t trust your doctor.\n\nbreathe. your life isn’t ruined. it’s okay to be scared. it doesn’t make it real. and redditors don’t make it real either.",
      "created_utc": 1745566961.0,
      "score": 6
    },
    {
      "id": "mox7g1p",
      "body": "I understand where you come from. I want to tell you that unless it’s really really really bad, you can bounce back. I didn’t go to the dentist for 5 years and got told my teeth were bad; went to a doctor recently and got told my teeth were really clean for some you hadn’t come in 2 years. I also worry about gum recession but I’ve been told it’s fine. The only thing I can do is brush lighter on the gums. I understand you’re anxious, I get freaked out about any healthy thing too, but people on Reddit are assholes. I was nervous about going bald and I got told it was bad light and I was going bald despite having new hair growth. I promise you it isn’t as bad as you feel. If you’re still torn about in a few days, get a second opinion but all you can do right now is floss and brush regularly, don’t brush too hard. I recommend getting an electric toothbrush cause that did wonders for me like I can finally hit my back teeth cause it has a small head. You’ll be ok it’ll be ok",
      "created_utc": 1745558188.0,
      "score": 6
    },
    {
      "id": "moxggj1",
      "body": "For some perspective: I’ve had gum disease for 20 years. It has not progressed and I have not needed gum grafting or anything despite it being recommended to me. My gums haven’t gotten worse. I’ve altered my routine to have better gum health by using a water flosser, getting a dental scraper tool and scraping off plaque between cleanings, salt water rinses, and toothpaste with nano hydroxyapatite. (Not a dentist and not recommending anything but my life hasn’t changed and it hasn’t progressed. Note that I’ve only implemented the things I listed in the last 5 years.",
      "created_utc": 1745563139.0,
      "score": 5
    },
    {
      "id": "moxk1hz",
      "body": "I’d reccommend an anxiety therapist over the dentist. Just try it for a bit and see. ❤️ sometimes our thoughts mislead us and we lose touch with the real image",
      "created_utc": 1745565267.0,
      "score": 6
    },
    {
      "id": "moxkeq0",
      "body": "Dude, I studied dentistry for 2 years, get a second opinion, dental health is not as important as mental health I would reccomend seeing a psychologist first, also even if there is recession, there are plenty of solutions, also don’t take what u read online as serious as an in person consultation, 92. Percent of people have gingivitis, the people u talked to on reddit might have seen periodontitis, which is “irreversible” but honestly quite common and there are aesthetic solutions and im sure ur teeth look fine. Priority 1: mental health go chat to someone about it \nP2: see a dentist. Considering the dentist said there was no issue it may have just been mild gingivitis that has now progressed, get a consult, the mind can sometimes make things seem far worse than they truly are. I hope all is well, and I would encourage you to talk to people u trust about this and maybe see a psychologist- worry is like a rocking chair it’s fun to do but gets you nowhere ❤️",
      "created_utc": 1745565493.0,
      "score": 5
    },
    {
      "id": "moxaz4r",
      "body": "It's highly unlikely at the age of 25 you have irreversible gum disease. I've never even heard of such a thing. If a dentist told you you don't have it, get a second opinion then. If the second one says same thing, then see a psychologist.",
      "created_utc": 1745560047.0,
      "score": 5
    },
    {
      "id": "moxfria",
      "body": "I’m not judging you at all for being distressed. Navigating your own health is scary, complicated, and so overwhelming sometimes. But your response to being set back on your health was too… set yourself even farther back? You shouldn’t need to be “high off life” to take care of your body. People have chronic disease and still live full, happy lives. Are you bipolar? I don’t mean that to be derogatory. Genuinely, the flip from “high off life to suicidal is really intense and concerning",
      "created_utc": 1745562736.0,
      "score": 5
    },
    {
      "id": "moxpu5k",
      "body": "I was diagnosed with autoimmune arthritis at your age (possibly younger). The doctor was blunt about it and said it’ll get progressively worse as I age. There’s no cure. I was also morbidly obese and asthmatic. He was right because eventually it spread from my feet to my hands and more.\n\nYou know what I did? I decided to get into sports for the first time in my life. It was utterly crazy and I am not asking you or anyone to follow my example. I just needed to convince myself that my body was still capable. I overdid it for about 2-5 years before I burnt out due to personal reasons. \n\nBut in that limited time I did stuff I never imagined I’d be doing. 100+ Km rides, solo half marathons and more. I wasn’t fast and wasn’t setting any records. I just needed to prove to myself I could do it. Heck, I even tried to learn swimming for a month or so and nearly drowned. \n\nDepression got the better of me  for a few years after because I was also dealing with a lot of personal shit. But now I know what I am capable of if I put my mind to it. I am trying to get back. \n\nBecause trying is all we can do with what we are given. Death’s coming for all of us. What’s the point crying about it? Just do the best you can with what you have. Don’t worry about the rest.",
      "created_utc": 1745568871.0,
      "score": 5
    },
    {
      "id": "mowxciu",
      "body": "For what is worth I was able to significantly improve mine by getting a waterpik and filling it with mouthwash instead of water",
      "created_utc": 1745553514.0,
      "score": 3
    },
    {
      "id": "moxc8tg",
      "body": "Xylitol gum and coco floss was a huge game changer for me",
      "created_utc": 1745560733.0,
      "score": 3
    },
    {
      "id": "moxku96",
      "body": "Dude, I just looked at ur teeth, mine are just as bad u got a good white set of teeth with a tinsy tinsy bit of recession, ur teeth are in the top 10 percent of the population on the lower 3’s recession is so common and urs is mild, lowkey not as bad as mine, just get a dental hygienist for a clean if ur concerned, ur teeth look aesthetically fine, don’t worry about it, if u wanna brush a bit better maybe do soft circular motions into the gums but apart from that ur denture looks pretty healthy man",
      "created_utc": 1745565760.0,
      "score": 3
    },
    {
      "id": "moxpb7i",
      "body": "I have irreversible gum disease too. I go to a periodontist once every 6 months, brush my teeth and floss with all the little brushes, and use listerine - twice a day. I’ve been doing it for many many years and manage it just fine. It’s part of my regular healthcare routine.",
      "created_utc": 1745568541.0,
      "score": 3
    },
    {
      "id": "moy3m8f",
      "body": "I am not a dentist but this is what happened to me \n\n37 year old here with a similar story. I neglected the hell out of going to the dentist and didn't see a dentist from 18 to 25.  First dentist I decided to go see at 25 told me the same thing you're hearing right now. They told me that I was going to need thousands of dollars worth of work and they wanted to basically replace my real teeth because I had periodontitis.  \n\nFast forward 12 years and I am so grateful I did not listen to them. I went to a second dentist who told me the same thing but presented it in a much better way and told me that it could be maintained. I just had to go to the dentist a little more often and they do a little bit deeper of a cleaning. It's called periodontal maintenance. I pay a little bit extra for my visits and I go a little bit more often. I've had one or two cavities but I still have all my teeth and it is entirely manageable. \n\nNow I'm definitely not saying we're totally in the same boat but there is hope. Talk to another dentist. Ask about maintenance plans.",
      "created_utc": 1745577229.0,
      "score": 3
    },
    {
      "id": "moy7jpk",
      "body": "I'm the office manager at a dental practice. I'm begging you not to let this ruin your life. Your dentist said they're not concerned, I would trust that over people on the Internet. Image compression can really give the wrong idea of what's going on in an X-ray or gum tissue. If you're that concerned, get a second opinion from another dentist or ask for a referral to a periodontist. You're still young and you have all of your teeth, that's a great start. They're not broken or decayed or infected. Periodontal disease can be chronic for some people but there are a lot of treatment options.",
      "created_utc": 1745579190.0,
      "score": 3
    },
    {
      "id": "moym916",
      "body": "You need a regular therapist, not a dentist. Like another poster, I have MS and tons of chronic GI issues AND OCD and health anxiety and regular anxiety. This situation and your reaction are not reasonable, your level of distress is not proportionate to the situation, and you are discrediting real life medical advice and diagnosis in favor of a “worst case scenario”.",
      "created_utc": 1745585240.0,
      "score": 3
    },
    {
      "id": "moz0xb0",
      "body": "Go get a second opinion, and for Pete’s sake stop abusing yourself as a coping strategy. Drinking will only make your problems much worse and more painful over time. You want to solve this problem, not make it worse. \n\nThere will be a solution. Even if you do have this disease, you’ll find the best way to manage it and to do that you need to be healthy and focused.",
      "created_utc": 1745590128.0,
      "score": 3
    },
    {
      "id": "mozh83x",
      "body": "Dude, you should honestly see a therapist because there's no way periodontitis should make you want to SH and get drunk as f all day to forget. \n\nYou do not have cancer, Charcot disease, Chrohn disease, or anything that would affect drastically your daily routine.\n\nYou MIGHT have a condition - and your dentist said you did not. If you do have it, you need to care for your gums a bit better, but that is it. I had a beginning of it when I was about your age. I did root planing and after that, proper maintenance : flossing after each meal, electric toothbrush, etc.\n\nGuess what ? I am absolutely fine. It's just a change of habits. I go to my dentist twice a year now and take care of my gums.",
      "created_utc": 1745594920.0,
      "score": 3
    },
    {
      "id": "moydwec",
      "body": "Go to a different dentist to get another opinion or go back to the original one and see what treatments are available",
      "created_utc": 1745582012.0,
      "score": 2
    },
    {
      "id": "mozpfrw",
      "body": "OP, I mean this in the most caring way, I assure you — what you’re experiencing is a complete and total overreaction. \n\nWhether you have gum disease or not, you clearly struggle a lot with health anxiety, which will make your life far more difficult than your apparent gum disease. It should not be accepted as normal to respond the way you have to something so minor, and frankly, unlikely. \n\nYou’ve taken the opinions of Redditors (I couldn’t care less if they are actual dentists or not) over your own dentist. If you need to, go and get a second opinion in person with another dentist. Get all the facts before you continue to freak out over what is essentially nothing. \n\nYou can see from plenty other replies here that many, many people have lived with gum disease for half their lives and are managing just fine and often without extreme progression. And I’ll be real with you, you’re behaving as though you’ve been diagnosed with a terminal illness, and you need to snap yourself out of it. If you can find and access help and support for your health anxiety, please make it a priority.",
      "created_utc": 1745597315.0,
      "score": 2
    },
    {
      "id": "mozrfwc",
      "body": "I don’t think your fixation on the gum disease is causing your mental health issues, I think it’s a symptom of a current mental health situation.\n\n\nYou have multiple posts of licensed people telling you that your mouth is healthy and you’re obsessively fixated on proving you have a condition that you don’t.\n\n\nMaybe take a step back from the internet and meet with a psych professional. Because you must realize your post and comments don’t make sense…",
      "created_utc": 1745597905.0,
      "score": 2
    },
    {
      "id": "mp0vnxj",
      "body": "Stop drinking too",
      "created_utc": 1745609654.0,
      "score": 2
    },
    {
      "id": "mp14m38",
      "body": "Why are you so shaken up about this? Find a way to regulate or self soothe, because this is not normal, and your condition is hardly serious. Get out of your pity party, and go be normal. Have you never been through anything in your life? Why are you drinking? Why aren’t you taking care of yourself? You’re being the opposite of proactive. You’re making it worse. Do what you can, and suck up the rest. Get yourself together. I’m 19 with like 3 chronic conditions and I just treat them, take care of myself, and keep going.",
      "created_utc": 1745612397.0,
      "score": 2
    },
    {
      "id": "mp2a5bs",
      "body": "I don't think the problem is the gum disease (which is probably not there according to what i - and a lot of other people have been seeing and telling you)\n-- i think your problem is our good old friend hypochondriasis. And trust me, i get how you're feeling. Trust me, i understand that you are 1000% convinced and i know, even if your dr looked at it and told you, you don't have it, the relief will only be temporary cause \"\"what if they overlooked something\"\" mhmhm.. the typical stuff. Please get help for this. It's such a shit thing to deal with.\nAnd according to the gum thing, again, you seem fine. Relax and take care of your health anxiety. I mean it in the most understanding way possible. Wish you all the best dude",
      "created_utc": 1745625982.0,
      "score": 2
    },
    {
      "id": "mp2q13t",
      "body": "High vitamin C will heal and restore gums. Takes time. ",
      "created_utc": 1745631667.0,
      "score": 2
    },
    {
      "id": "mp39hdz",
      "body": "This wins as the most dramatic post I've seen on reddit.",
      "created_utc": 1745638984.0,
      "score": 2
    },
    {
      "id": "mowccea",
      "body": "**Hello u/!**\n\nThank you for using a content warning. Your post is under review.\n\n---\n**If you are in immediate crisis:**\n- Visit [Find A Helpline](https://findahelpline.com/i/iasp) for local hotline info.\n- Check [Hotline FAQs](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) for guidance.\n- Consider posting on r/suicidewatch or messaging their moderators [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch).\n\n---\n**For suicidal thoughts or self-harm:**\n- [HelpGuide](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) offers coping tips.\n- You are not alone – see personal stories on YouTube.\n- Practice grounding exercises or listen to your favorite music.\n- Refer to [Find A Helpline](https://findahelpline.com/i/iasp) for more resources.\n\n**Take care and stay safe!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1745545848.0,
      "score": 1
    },
    {
      "id": "moyyp5x",
      "body": "I use to be very self conscious about my teeth. They were breaking off and causing all kinds of problems. The final straw was when i lost 1 of the 3 teeth I had left in the front of my mouth. In November I started my denture journey. It hasn’t been easy but I’m happier about not having teeth currently than I was having jacked up teeth. Hopefully this Monday I get impressions done and in a couple weeks I’ll have my dentures. Don’t loose hope. There are options. I was in your place before I decided to do something. If you have any questions feel free to ask.",
      "created_utc": 1745589430.0,
      "score": 1
    },
    {
      "id": "mozeocm",
      "body": "To be honest people on reddit assume the worst so I wouldn't ask for any medical advice because it'll go straight to the worst or that you're dying. Like webMD",
      "created_utc": 1745594185.0,
      "score": 1
    },
    {
      "id": "mozfkv3",
      "body": "It's going to be ok. Take a deep breath and just get a hold of yourself. You can do things to help your smile. But, worst case scenario, you do have issues later on in life or earlier than typical people encounter. The fact remains, we all age and our bodies break down and don't look or work as well as they did before. We may have had a direct impact on speeding up the progress and ultimately, have to live with that regret. But it's not the end of the world. I bet you'll be better about taking care of your teeth going forward. So there are upsides. I think your teeth look very healthy and you just have some recession in your gums that, if treated, can probably be ok. You can also consider getting gum grafts once the gum disease, if you have it, is under control. I was bulimic for many years and my teeth look way worse than yours. I'm also a woman going bald, I've probably got an autoimmune disease causing it. Waiting to see my dermatologist now for confirmation. Youth is wasted on the young. It's a fact. Just try to look on the bright side of things or you'll drive yourself crazy. It could be much worse, you could be dying of cancer. Cheers!",
      "created_utc": 1745594447.0,
      "score": 1
    },
    {
      "id": "mozg8dv",
      "body": "There is a shit ton of happy, successful people out there who have full dentures. Just saying. There's a lot of good tech out there. The real issue is your funding for the best treatments.",
      "created_utc": 1745594635.0,
      "score": 1
    },
    {
      "id": "mozjbst",
      "body": "Just a suggestion - it’s important to ask for what you need. It seems like, after reading these comments and your responses, that you are not asking for advice or help. You simply needed to vent, and for the world to listen. Sometimes, all you have to do is say “I don’t need any advice or suggestions. I’m just looking to vent” - you’d still probably get some people giving advice, but you will find more people will respond better if you just tell them what you need.",
      "created_utc": 1745595528.0,
      "score": 1
    },
    {
      "id": "mozqg68",
      "body": "Get off Reddit, it’s clearly bad for you",
      "created_utc": 1745597612.0,
      "score": 1
    },
    {
      "id": "mozr262",
      "body": "Your mistake is not getting a second dentists opinion instead of posting in a sub.",
      "created_utc": 1745597792.0,
      "score": 1
    },
    {
      "id": "mozsczs",
      "body": "The dentist is a professional and he also saw you personally. I would take his word for it rather than the word of strangers on Reddit.",
      "created_utc": 1745598178.0,
      "score": 1
    },
    {
      "id": "mozszf1",
      "body": "I lost one of my front teeth, it really had me down and depressed, I thought I was gonna a feel like a freak. Then I remembered I actually don’t care and people probably thought I was a weirdo either way so why am I worried about what people think when I smile! If they are worried about teeth, they probably didn’t make me smile anyways! ",
      "created_utc": 1745598360.0,
      "score": 1
    },
    {
      "id": "mozyeb2",
      "body": "I’m 25 and have issues with my teeth too, I made a post about it on another account of mine, but I feel the exact same way. My teeth are very much acid eroded and I’ll need dentures soon. Just know you’re not alone",
      "created_utc": 1745599926.0,
      "score": 1
    },
    {
      "id": "mp00435",
      "body": "Posting health concerns on reddit is a bad idea. Highly unlikely that the people who comment are even educated in the field you need to actually diagnose you. If you went to the dentist and they said you don’t have it, you should believe them OR get a second opinion if you don’t agree. Spiraling based on reddit responses is a bad idea… \n\nAlso, I was told I had gum disease and I’ve seen a dentist every 6 months since I was 5. It’s often genetic and now they just moved my appts to every 3 to improve and then maintain my gum health.",
      "created_utc": 1745600409.0,
      "score": 1
    },
    {
      "id": "mp0asgz",
      "body": "I’m 29, I have periodontal disease and it used to be worse until I started using a waterpik. While more advanced stages you can’t reverse, you can certainly manage and stabilize the disease to prevent further progression.  If it’s early on you can reverse it, I have to go to perio check ups and they’ve said I’ve been doing great. I don’t have the best dental hygiene either I’ll admit. Keep up with daily maintenance and go to your dental cleanings.",
      "created_utc": 1745603448.0,
      "score": 1
    },
    {
      "id": "mp0fa0s",
      "body": "OP it sounds like you have serious health anxiety and/or OCD. I’ve been there. Sure keep good oral hygiene and get a second opinion from a dentist on what it is and what to do. But your mental health is what you really need help with. You might not see it now, I was in the same position. But everything is gonna be ok man",
      "created_utc": 1745604741.0,
      "score": 1
    },
    {
      "id": "mp0p4kf",
      "body": "Sounds like you have some very serious and irrational health anxiety. You need professional help.",
      "created_utc": 1745607661.0,
      "score": 1
    },
    {
      "id": "mp0pyv9",
      "body": "I would believe your dentist, not people of reddit.  He examined the inside of your mouth, and reddit did not, just saying.",
      "created_utc": 1745607917.0,
      "score": 1
    },
    {
      "id": "mp1brux",
      "body": "Get a grip. There are so many other worst things in life to get.",
      "created_utc": 1745614554.0,
      "score": 1
    },
    {
      "id": "mp1e07y",
      "body": "I don’t mean to be disrespectful but your reaction to this is unusual. Maybe talk to a therapist?",
      "created_utc": 1745615237.0,
      "score": 1
    },
    {
      "id": "mp1qllb",
      "body": "Hey there, I was diagnosed at 26 with Stage 3 oral cancer and had part of my tongue removed. Also have suffered with bruxism and clenching for all of my adult life to the point where I was once wearing nighttime AND daytime guards to try and keep me from ruining my teeth further. Hasn't totally worked and dentists have recommended I look into gum grafting soon to help; I'm just not ready to think about any more oral treatments yet. All that being said, I am good. I'm more social, more active, more happy than I'd been for a long time pre-oral cancer. In fact I still say I'd take the radiation therapy-induced hypothyroidism and the pain I suffered recovering what's left of my tongue any day over the depression/anxiety/eating disorder I'd suffered silently with for so much longer of my life. \n\nAll this to say... I think you posted on mentalhealth for a reason that you're slowly figuring out. Judging by your (deleted) post history and marked impairment, you may be suffering from OCD-like thoughts. Reassurance-seeking is an often overlooked compulsion that goes with the excessive intrusive thoughts about something you've already addressed with a professional (or many). Either way, thoughts of unalive are NEVER normal and those alone deserve addressing with a mental health professional. I can see you are definitely suffering, and hope you try this avenue as well to find relief.\n\nWhether it turns out to be oral or psychological, help IS out there and you CAN achieve peace.",
      "created_utc": 1745619308.0,
      "score": 1
    },
    {
      "id": "mp1qtpv",
      "body": "Periodontal disease isn't world ending. I'm really trying to not minimize how you're feeling but this is definitely an overreaction. Just get the more frequent cleanings and keep up with your dental hygiene and you'll be fine. I'm 26 with it, and guess what.... It's okay.",
      "created_utc": 1745619385.0,
      "score": 1
    },
    {
      "id": "mp1rnbn",
      "body": "I had lost a couple of teeth from bad gums, then got an appointment with a periodontist and they were able to completely stop it with some surgeries and deep cleaning. I had pockets everywhere some as deep as 10mm. It is treatable.",
      "created_utc": 1745619666.0,
      "score": 1
    },
    {
      "id": "mp2h2fs",
      "body": "I'm 67 and have had gum disease my whole adult life due to neglect as a child, also hereditary. Trust me, it has not destroyed my life. It's just expensive to get teeth pulled and implants and such. Hang in there, I know this is really hard.",
      "created_utc": 1745628441.0,
      "score": 1
    },
    {
      "id": "mp2pqy1",
      "body": "You shouldn’t believe literally anything people on Reddit say. This is the holy grail of stupid people cosplaying professionals.",
      "created_utc": 1745631571.0,
      "score": 1
    },
    {
      "id": "mp35sun",
      "body": "so we’ve studied people’s perception of life around the time of accidents like being fully paralyzed where usually the shock of the diagnosis and adjustment to their life makes people feel life is not worth living, but most people down the line rate their quality of life higher than you’d expect and generally find their lives to be worth living - and this is for extreme disability. Yes chronic health conditions suck but it is manageable!",
      "created_utc": 1745637477.0,
      "score": 1
    },
    {
      "id": "mpdx3o0",
      "body": "Respectfully, you're a complete and utter idiot taking redditors' advice over a medical professional's.",
      "created_utc": 1745791848.0,
      "score": 1
    },
    {
      "id": "mpsbwel",
      "body": "It sounds like you’re really blaming yourself for this because you feel like you didn’t go to the dentist “soon enough”. I know it’s really hard but I think if you can try to see it from a different perspective it will really help. You can try to think about what you’d say to a friend/loved one who had your feelings if that makes it easier to be kind to yourself. \n\nFrom my perspective: You went to the dentist once you thought there was an actual issue which is great! Plaque build up is very common and it’s one of those life admin things like servicing your car or checking smoke alarms that’s so easy to put off because it’s almost always boring and fine and time consuming. You’re 25, you’re still learning how to take care of yourself properly. As someone who is also 25 it’s so hard to try and balance the life admin stuff with work or/and study and with social life and with family life is really difficult and literally nobody I know our age has it down well. \n\nOne of my friends has just bought a house and is engaged and she also has been off her meds for 8 months because she needs to call her psychiatrist to ask them a question about insurance and that’s too big for her to do. It seems from the outside like such a tiny thing compared to where she is in her life but it’s big for her and that’s all that matters.\n\n If you going to the dentist is something that seemed difficult or annoying or too expensive or too time consuming that’s on and understandable and so common. \n\nYou aren’t at fault for health issues just because you didn’t do every single thing perfectly. You’re just a human same as everyone. Do you think drinking is going to help your health? In two years if someone tells you that you’re starting to show signs of liver failure because of drinking and not taking care of your body how are you going to feel? The exact same as you do now probably. \n\nContinue to take care of yourself and be PROUD that you are doing that and be PROUD that you have learned from this experience that you can be prioritising your health more. This is an opportunity for you to manage, treat and prevent other potential issues. Don’t waste that by making your health WORSE because you can get over your own guilt and depression. Focus on your health, focus on making sure you make those appointments and take care of yourself so that you can say you’ve done everything you can. ",
      "created_utc": 1745986674.0,
      "score": 1
    },
    {
      "id": "mpsqvxb",
      "body": "I kept telling myself I was going to go to the dentist to get my teeth cleaned the second I noticed plaque and kept pushing it off and it eventually led to this and I will never forgive myself for it … I’m sorry but that’s just what it is I guess. I would’ve took it way more serious if I knew it could progress to an irreversible disease. I feel way better since I made this post and received a lot of support from it but I just can’t get out of my head what I should’ve and wanted to do just not early enough. I just saw a pic of me 2 years ago smiling with friends and zoomed in where I have some gingival recession now and it back then my smile looked so perfect it’s really bothering me I started crying again",
      "created_utc": 1745994255.0,
      "score": 1
    },
    {
      "id": "mpwgs7j",
      "body": "Life is going to be up and down for every single person on this earth. If you place too much value in a life that isn’t perfect and try to make it perfect that you will by no doubt fail. The only place that is perfect is heaven believe it or not. ",
      "created_utc": 1746044396.0,
      "score": 1
    },
    {
      "id": "moz4jzc",
      "body": "I would like to say everyone in here definitely has made it feel easier for the time being at least. I’m still under the impression that I have it but I will get a second opinion from an IRL dentist to really figure it out . \n\nThe support I’m receiving definitely makes me feel a little bit better and I appreciate every one of you",
      "created_utc": 1745591224.0,
      "score": 1
    },
    {
      "id": "moxh0el",
      "body": "Time to get healthy ! 😉😁 \n\nShe'll be right 👍",
      "created_utc": 1745563461.0,
      "score": 0
    },
    {
      "id": "moyb6vk",
      "body": "Perio?",
      "created_utc": 1745580863.0,
      "score": 0
    },
    {
      "id": "mp0hyh6",
      "body": "No your dentist is correct and you need to follow the advice of your dentist.\nKnowledge will make you so much more comfortable with everything and nothing will then seem overwhelming.\n Also there is a marvelous dentist on YouTube and she has lots of great ideas for improving gums and enamel.\n\n\nI Neglected my teeth and gums and started to develop problems. I have a real problem with discipline and willpower. Eating candy and junk then being too lazy to brush my teeth. But I got them back on track and now everything okay within about a month using toothpaste for sensitive teeth and for enamel health. \nAt first my gums would hurt brushing but a warm salt water rinse at night or during the day did wonders. \nKnowledge will make you so much more comfortable with everything. Another tool to help and make you feel like someone is always in your corner is using AI like \ng r o k.  It's free and available on pretty much every platform I use it on Android.\n\n\nIt's like talking to a doctor or a friend and gives great advice of course always reminding you that it's not a doctor but I suggest that you try it it's an app or available from the x-platform.\n\n\nI've used it to get ideas and advice. And it's amazing how helpful it is. If you talk to it about your dental issues and you feel like your dentist is not addressing them grok will give you specific suggestions on how to speak to your dentist or doctor.\n\n\nGrok has been a great help to me dealing with my mother who is in a nursing home and has even written letters for me to print out in order to get her the help she needs and it has worked.\n\n\nSometimes it's difficult to talk to people because we get upset and I've even been able to get a lot of things out regarding the death of my brother by talking to grok.  Typing everything out at that time and getting written responses. There is a voice model in the beta mode right now that is pretty impressive.\n\n\nGod bless you",
      "created_utc": 1745605535.0,
      "score": 0
    },
    {
      "id": "moyfnqy",
      "body": "Also, OP I (27F) had periodontitis literally since I was 12 and I’m completely fine lol. It’s not a death sentence, I just might have to get implants at some point.",
      "created_utc": 1745582727.0,
      "score": 278
    },
    {
      "id": "mowglat",
      "body": "If you understood how gum disease works and is diagnosed you’d probably understand a bit more. The people who told me this aren’t just random people they were verified dentists in a subreddit",
      "created_utc": 1745547287.0,
      "score": -669
    },
    {
      "id": "mox3mg9",
      "body": "I have gum disease too.Im too scared to go back. They mentioned gum relining or something and it sounded awful.",
      "created_utc": 1745556302.0,
      "score": 57
    },
    {
      "id": "mowfuao",
      "body": "I’m trying to hold onto that tiny bit of hope that I was still in a gingivitis stage but I’m starting to come to terms that I’m not . I’m not necessarily scared about what’s going to happen to me(I mean a little bit for sure) since I’m in such a early stage where it can be stopped and not progress but i got it at 25 years old and will have it for life it’s so soul crushing",
      "created_utc": 1745547027.0,
      "score": -140
    },
    {
      "id": "mowfhyg",
      "body": "The people on Reddit that said I have it are verified dentists who looked at my x-rays",
      "created_utc": 1745546909.0,
      "score": -161
    },
    {
      "id": "mtiyid2",
      "body": "This has completely cured my anxiety of this disease.... thank you :)",
      "created_utc": 1747855319.0,
      "score": 1
    },
    {
      "id": "mowxh6u",
      "body": "Yea I’d rather not go that route and just control my current situation though 🤣🤣 obviously you never really know what’s going to happen in the future",
      "created_utc": 1745553570.0,
      "score": -9
    },
    {
      "id": "mowha8n",
      "body": "Thank you ❤️ I’m trying my best man it’s so fucking hard knowing I have this forever it’s really shattering. If I was older I think it would be easier to take in just because you know that’s life 🤷‍♂️ but something about being 25 with this is killing me inside and making me feel gross about myself",
      "created_utc": 1745547529.0,
      "score": -43
    },
    {
      "id": "mox38br",
      "body": "Holy shit man good luck with that! It’s nice to see such a positive attitude about such a long procedure. I believe in you and thanks for the chill vibes",
      "created_utc": 1745556117.0,
      "score": 9
    },
    {
      "id": "mp1ypo8",
      "body": "I called a bunch of periodontists in my city , all are booked for a few months …",
      "created_utc": 1745622105.0,
      "score": 1
    },
    {
      "id": "mowext1",
      "body": "I caught it as early as I could but I barely missed it before it could’ve been reversed/cured that’s where my depression comes from. With proper oral care nothing really happens and it shouldn’t progress but I’ll always “have it” and it disgusts me and grosses me out.",
      "created_utc": 1745546720.0,
      "score": -12
    },
    {
      "id": "mowv09m",
      "body": "It becomes irreversible after the initial stage (gingivitis) I have everything I need to take care of it now though",
      "created_utc": 1745552548.0,
      "score": -6
    },
    {
      "id": "moy12ue",
      "body": "It’s especially questionable since the actual dentist that was in OP’s mouth said they’re fine. What convinced OP that they’re at some rock bottom is that “verified” “dentists” on Reddit said they DEFINITELY have irreversible gum issues based on some pictures (even though there are a couple on HERE that are telling OP that it really doesn’t look as serious as they believe.)\n\nInstead of getting a second opinion from a real life dentist, they’ve decided to believe Reddit & allowed strangers’ opinions to destroy their mental & physical health to the point they’ve dropped even attempting to take care of themselves…\n\nI’m trying to be empathetic, but my confusion about the whole situation is getting in the way.",
      "created_utc": 1745575821.0,
      "score": 5
    },
    {
      "id": "moy7t8w",
      "body": "Also, dentists are legally not allowed to diagnose patients that they've never seen in person to establish care with. I love that there are professionals out there giving advice for free, but I would never take it as anything other than their opinion vs diagnostic advice.",
      "created_utc": 1745579316.0,
      "score": 2
    },
    {
      "id": "mp2ayek",
      "body": "There’s like no way I don’t have it I’m sorry. My gums have receded exactly where my inflammation and plaque build up was , that’s what happens with gum disease when it goes past gingivitis and becomes irreversible. I will get another opinion to try and ease my anxiety’s on my next day off of work but I’m like spiraling . I will say the support from this thread made today way easier however and I appreciate everybody for that .",
      "created_utc": 1745626265.0,
      "score": 2
    },
    {
      "id": "mozexmk",
      "body": "And the best way to solve or treat dental issues is primarily just continuing to have the best hygiene you can to slow it down",
      "created_utc": 1745594260.0,
      "score": 1
    },
    {
      "id": "mp1qtv6",
      "body": "Oh and also... stop taking it out on alcohol. Excessive drinking WILL ruin your oral health.",
      "created_utc": 1745619386.0,
      "score": 2
    },
    {
      "id": "mpdyojq",
      "body": "I take my dentists advice and am following everything he’s telling me. The redditors who told me otherwise however are also medical professionals. To be able to comment on people’s post in r/askdentist you must be verified as a true dental professional through the moderators",
      "created_utc": 1745792374.0,
      "score": 1
    },
    {
      "id": "mozk1j3",
      "body": "This. I’ve (25F) had massive issues with my gums my whole life too. It just might some (or a lot) of extra care. Like trust me I’m mad bc of my genetics screwing my teeth up plenty but it def ain’t a death sentence lol I just have to go extra miles to take care of my teeth & gums & keep them healthy",
      "created_utc": 1745595734.0,
      "score": 47
    },
    {
      "id": "mowuceq",
      "body": "Go get a second opinion from a second dentist (IRL)",
      "created_utc": 1745552286.0,
      "score": 709
    },
    {
      "id": "mowucg8",
      "body": "But they ain't verified dentist's who have been in your mouth, unlike your dentist.",
      "created_utc": 1745552287.0,
      "score": 383
    },
    {
      "id": "mowugm2",
      "body": "Then get a second opinion. In real life. Not on the Internet",
      "created_utc": 1745552333.0,
      "score": 242
    },
    {
      "id": "mox6mi5",
      "body": "There’s a phrase that’s supposed to circulate with healthcare professionals (and coincidentally, lawyers) on social media. “I’m a doctor, but I’m not *your* doctor.” What people know from your story online is not even remotely what would be covered in an appointment. *And* they don’t actually see it, feel it, or examine it up close, in person. Pictures are *not* adequate. Even teledocs will have a point where you need to be examined in person. This would be one of those cases and what it *really* warrants is a second opinion *in person.*\n\nEDIT: wording",
      "created_utc": 1745557771.0,
      "score": 55
    },
    {
      "id": "mox91pd",
      "body": "Stop getting health advice from the internet and trust the in-person medical professionals.\n\nThere is much that can appear one way in a photo and not in real life.",
      "created_utc": 1745559024.0,
      "score": 40
    },
    {
      "id": "moyvwic",
      "body": "OP, get off the fucking internet.",
      "created_utc": 1745588539.0,
      "score": 25
    },
    {
      "id": "mox30on",
      "body": "My gum disease isn't at the Advanced stage more in the middle range and trust me. There are far worse things in life to be upset about. \n\nTry going from being an active, fit person to becoming physically disabled and suffering from chronic pain. Worst case scenario you lose all your teeth and have dentures but you've got a long way until then so don't worry. My worst-case scenario already happened and I've lost the ability to run and walk long distances. I got injured when I was 19, I still have my whole life ahead of me and I'm already a freaking cripple. This wouldn't be so bad if I was born this way because I wouldn't know what I'm missing, but unfortunately, I know everything I'm missing and the happiness each thing brought me. I miss snowboarding, I miss rollerblading, I miss running. \n\nDon't go crazy before you lose what you have. Becoming physically disabled wasn't on my mind until it happened don't stress until you see the roots of your teeth because that's when I'd freak out.",
      "created_utc": 1745556019.0,
      "score": 107
    },
    {
      "id": "moym2hr",
      "body": "I found a deleted thread from your account and found people agreeing with your dentist bro, what are you even talking about",
      "created_utc": 1745585177.0,
      "score": 20
    },
    {
      "id": "moynhw1",
      "body": "Are you high? Get a second opinion from a REAL IN PERSON DENTIST!",
      "created_utc": 1745585678.0,
      "score": 22
    },
    {
      "id": "moxpbbc",
      "body": "You really want to have it, don't you?\n\nJust get a second or third opinion and you'll know. Physical inspection is better than written diagnosis.",
      "created_utc": 1745568543.0,
      "score": 39
    },
    {
      "id": "moyxi4r",
      "body": "Verified? Why because they're on a dentistry subreddit? That's not verification.",
      "created_utc": 1745589053.0,
      "score": 8
    },
    {
      "id": "moxotct",
      "body": "Well if the people on the internet says it’s true it has to be true!!!!! 😂😂",
      "created_utc": 1745568228.0,
      "score": 13
    },
    {
      "id": "moyzvlg",
      "body": "> The people who told me this aren’t just random people they were verified dentists in a subreddit\n\nRight.",
      "created_utc": 1745589802.0,
      "score": 5
    },
    {
      "id": "mozaxe2",
      "body": "But they did not see inside your mouth. Why would you take their word over someone that physically saw you? Get a second opinion.",
      "created_utc": 1745593097.0,
      "score": 6
    },
    {
      "id": "mozqg3q",
      "body": "Starting to wonder if the gum disease issue really came before mental health struggles… maybe take some time off Reddit and get more concrete info from IRL professionals.",
      "created_utc": 1745597611.0,
      "score": 4
    },
    {
      "id": "mp05s45",
      "body": "They are beings online that have not actually examined you. Sounds like you have a serious depressive episode going on and a really unhealthy relationship with alcohol which doesn't help your mouth in any way. \n\nMaybe listen to the actual doctor who was inside your mouth and not tandos who say they have degrees on the internet? \n\nYou need to get some serious mental health help and maybe think about stopping the drinking completely. There's no out of alcohol that's actually good for you.",
      "created_utc": 1745602025.0,
      "score": 3
    },
    {
      "id": "moyxcq0",
      "body": "Yourteeth will fall out and youll die bc you wont be able to eat. Im a verified dentist.",
      "created_utc": 1745589006.0,
      "score": 5
    },
    {
      "id": "moyv7kq",
      "body": "Yes but the person you saw was also a verified dentist. Get a second in person opinion",
      "created_utc": 1745588310.0,
      "score": 2
    },
    {
      "id": "mp2khch",
      "body": "Okay, as someone who literally had all my upper teeth pulled at once, get a second opinion ***IN PERSON***. Internet strangers cannot diagnose you. That is not how this works.",
      "created_utc": 1745629661.0,
      "score": 1
    },
    {
      "id": "moy2c69",
      "body": "Gingivitis and periodontitis are two similar but different issues, main difference is the teeth structures they affect. With gingivitis sometimes changing habits and having super perfect hygiene makes it go away as it's an inflamatory process in the gums, but periodontitis doesnt work that way. It will keep progressing if you don't go back and get whatever treatment your dentist says that you need even if it sounds awful. Teeth have such a big impact in your quality of life, take good care of yours.",
      "created_utc": 1745576529.0,
      "score": 32
    },
    {
      "id": "mp1g1i7",
      "body": "I can guarantee you that not going back is way worse than going back. Ignoring the issue won't make it go away but might actually allow it to get worse considering it's going untreated.",
      "created_utc": 1745615873.0,
      "score": 4
    },
    {
      "id": "mowzm57",
      "body": "Just saw your photo on the other post. If that's what your gums looked like before going to the dentist, then I'm seeing, like, no inflammation. You said little bone loss. No obvious rotting, bleeding, nothing.\n\nPeriodontal disease is essentially an infection. Your gums just aren't showing any signs of infection. Definitely possible you did have it, and it's now under control. You don't need to have this to have gum recession/gingivitis. Which is what I *am* seeing.\n\nIt sounds like you're going to need to maintain it, and that's the bit that's dragging you down.\n\nGood news!\n You have experience being in a body that needs maintenance. Said maintenance at this stage is basically just a really good oral hygiene routine.\n\nSoft bristled brush. No charcoal whitening products. Floss. Dental cleans every 6 months unless otherwise advised.",
      "created_utc": 1745554498.0,
      "score": 88
    },
    {
      "id": "mowur70",
      "body": "Don't listen to the goofballs in that dentist sub. Listen to the person who you visit irl.",
      "created_utc": 1745552448.0,
      "score": 129
    },
    {
      "id": "mox60gr",
      "body": "Not everything can be verified by xrays and some pictures. You need someone who can poke around in there, and you cant do that virtually...",
      "created_utc": 1745557463.0,
      "score": 43
    },
    {
      "id": "mozfodu",
      "body": "So I understand the fear because I also have anxiety about teeth, but take a step back. You’re catastrophizing the situation based on what people on the internet said. If they are really dentists it is unprofessional and unethical to make diagnoses over Reddit. \n\nI’ve had more fillings and root canals than I can count due to both genetics and not taking care of my teeth when I was young. I had a gum graft when I was 34, and have to be very careful to avoid further issues because I have a connective tissue disorder. It sucks that I’ve already had consequences, but since I realized how serious it could get I’ve taken very good care of my teeth. I haven’t had any new cavities or any further gum recession. I go to a university dental program where it’s way cheaper than a private practice. Whatever happens next, a huge part of it is within your control to manage. If you start acting like it’s the end of the world, you’re going to be less motivated to take care of your oral hygiene.",
      "created_utc": 1745594475.0,
      "score": 7
    },
    {
      "id": "mp009fz",
      "body": "\"verified\"...on Reddit ?? 🤣🤣🤣 In that case I'm a \"verified\" dentist too and say you should get a second opinion from a different in person dentist.",
      "created_utc": 1745600451.0,
      "score": 5
    },
    {
      "id": "mp1r8o4",
      "body": "But....your dentist physically examined your mouth and is, also, a verified dentist.",
      "created_utc": 1745619526.0,
      "score": 2
    },
    {
      "id": "moxn86t",
      "body": "Your teeth don't look bad. You have some recession but for example I have inflammation due to not being able to clean properly with braces, which you don't have. If you're concerned use a chlorhexidine mouthwash at night. If your teeth look brownish in some places when using it, it's normal and your dentist can remove the stains, although you can avoid them for the most part by cleaning with a mild whitening toothpaste. That's how I'm avoiding my gums from getting worse until I'm free from braces because a professional cleaning is not recommended yet as I've had several surgeries.\nBtw, do you have bruxism or clenching? Recession can originate due to that as well.",
      "created_utc": 1745567248.0,
      "score": 10
    },
    {
      "id": "mp38n5l",
      "body": "You do realize worrying and or getting drunk as fuck isn’t helping.  Having a plan is going to help you feel better.",
      "created_utc": 1745638647.0,
      "score": 1
    },
    {
      "id": "moy8epk",
      "body": "You just sound so ridiculous. I was diagnosed with multiple sclerosis in my 20s. I'm now in my late 40s and still living my life to the fullest extent that I can with a truly \"shattering\" lifelong, progressive disease. Get a hold of yourself man. You aren't even \"diagnosed\", your in person dentist told you you don't HAVE it. This is so melodramatic. I'm sorry for coming across as downplaying, but put shit in perspective.",
      "created_utc": 1745579601.0,
      "score": 38
    },
    {
      "id": "moyhymb",
      "body": "Mate, gently, I think you need to get yourself a therapist. If something like (the possibility of) gum disease has brought you to the point of thinking about killing yourself, I think there might be something else going on in the background.",
      "created_utc": 1745583631.0,
      "score": 33
    },
    {
      "id": "moxlcnd",
      "body": "Jesus Christ get a grip! It’s gum disease not terminal cancer.",
      "created_utc": 1745566073.0,
      "score": 112
    },
    {
      "id": "mp0utoe",
      "body": "You might find some help and kindred spirits in r/healthanxiety",
      "created_utc": 1745609396.0,
      "score": 7
    },
    {
      "id": "mp2kbsu",
      "body": "better to have an appointment in a few months that no appointment at all",
      "created_utc": 1745629605.0,
      "score": 3
    },
    {
      "id": "moyvoia",
      "body": "You seriously need a therapist",
      "created_utc": 1745588466.0,
      "score": 14
    },
    {
      "id": "mpe11v8",
      "body": "Yeah fair enough I had no idea it worked like that truthfully",
      "created_utc": 1745793151.0,
      "score": 2
    },
    {
      "id": "mp1fqqp",
      "body": "Why would they do that if they can just ignore an IRL dentist and trust a random redditor instead and cry for hours on end instead of just getting a real second opinion?\n\nI get that this is a mental health sub but op is literally choosing to believe an Internet stranger over a professional who actually saw his gums in person. Of course professionals make mistakes but op is choosing in whom to believe and is not going for a second opinion.\n\nEspecially considering that on his post, many were agreeing with the IRL dentist.\n\nOP is deliberately choosing suffering.\n\nAnd OP needs to get off the Internet.",
      "created_utc": 1745615779.0,
      "score": 43
    },
    {
      "id": "mozbf38",
      "body": "This! I cannot do stuff I want either. I wish people understood that if they have the abilities to do things they love without restriction they got it made. Former bodybuilder who can't now.\n\nI'm sorry for what happened to you.",
      "created_utc": 1745593239.0,
      "score": 11
    },
    {
      "id": "moz553i",
      "body": "I will , but I have slight bone loss in my lower incisor and it’s most likely from the inflammation my gums were going through, that is what makes gum disease permanent. I’m not just taking what other people say for no reason I’m now more informed on this topic and how it works. \n\nMy dentist told me the bone loss was very minimal meaning I didn’t have it but unfortunately any bone loss in the jaw bone from inflammation 100% makes it periodontitis(irreversible gum disease)",
      "created_utc": 1745591397.0,
      "score": -27
    },
    {
      "id": "moz4ak0",
      "body": "you need to verify with certification or license to be able to respond to people’s posts in that subreddit (r/askdentist if you want to check it out). I don’t think they’re wrong but I’m thinking about getting another IRL opinion. I’m convinced I have it just in a very mild and controllable stage.",
      "created_utc": 1745591147.0,
      "score": -9
    },
    {
      "id": "mp3ccny",
      "body": "I'm trying to get my courage up",
      "created_utc": 1745640193.0,
      "score": 2
    },
    {
      "id": "mp3cglu",
      "body": "I know. I'm trying to build up my courage.",
      "created_utc": 1745640241.0,
      "score": 2
    },
    {
      "id": "mox0fy3",
      "body": "That’s a pic of my teeth and gums now . I don’t even wanna send the before it’s terrible (in one area only) but yea I don’t have any inflammation or anything now I mean everything seems like it reversed as far as inflammation and bleeding",
      "created_utc": 1745554859.0,
      "score": -36
    },
    {
      "id": "moxo6ys",
      "body": "Right? I'm not trying to have a pissing match, but there was a time that the opposite happened to me. A doctor told me I had herpes, at 19. Different doctor told my girlfriend the same. We had broken up for a bit and I had sex with another girl, and it made total sense. I was shattered. But I came to terms with it, because I would have this forever and there was no changing that.\n\nAnd then the tests came back and neither of us had herpes. It was a bacterial infection. \n\nAnyway, 1: see another doctor\n2: if you have it, stop sulking and get on top of it \n\nC'monnnnn mannnn, get it together! Gingivitis?! Bro if you have it, a (second or third) doctor would tell you, and would help treat you to make sure it doesn't worsen. Boom, you've now got a very, very common health condition under control.",
      "created_utc": 1745567845.0,
      "score": 48
    },
    {
      "id": "mpe1tox",
      "body": "It’s all good man , I just want this episode in my life to end and my mind can go back to normal",
      "created_utc": 1745793393.0,
      "score": 1
    },
    {
      "id": "mp1hhnn",
      "body": "This. Exactly this.",
      "created_utc": 1745616337.0,
      "score": 11
    },
    {
      "id": "moz5s5q",
      "body": "I think a second opinion would be a good idea.",
      "created_utc": 1745591589.0,
      "score": 6
    },
    {
      "id": "mp1e4ev",
      "body": "They still haven’t been in your mouth. Can’t rely on advice from a dentist you haven’t seen in person",
      "created_utc": 1745615273.0,
      "score": 3
    },
    {
      "id": "mp4emaq",
      "body": "I believe in you, stranger. Be kind to yourself and find a dentist you feel comfortable with. If they're good professionals they will understand your fears and work through it with you to make it less hard.  Wish you the best of lucks!",
      "created_utc": 1745661467.0,
      "score": 2
    }
  ]
}