{
  "id": "1kjrmqy",
  "title": "My father told me he is attracted to me.",
  "selftext": "A bit of back story, my father tried raping me twice as a child, I am now 28. My grandparents had custody after 15 yrs old. After they passed and with no other family it was hard not to reach out at the funeral, hoping after 10 years it would be safe. Well it’s been 5 years since then. For the last year i have been sick and as of recent testing it is more than likely something terminal. I recently started the process of selling my home because i have no income. My father has set up his basement for me so i have somewhere to live. Over the last month or two he has gotten a bit handys and then today he told me he is attracted to me. He also said he would never go there but that he could see himself doing it but he wont. So now i have no income, barely any strength, and im stuck in a house with my abuser again. It makes it really hard to not listen to the darkness.",
  "created_utc": 1746934044.0,
  "score": 484,
  "num_comments": 41,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1kjrmqy/my_father_told_me_he_is_attracted_to_me/",
  "comments": [
    {
      "id": "mrp00y3",
      "body": "**Hello u/!**\n\nThank you for tagging your post with a content warning. This helps us share useful resources and prevent unintended triggers.\n\n*Your post may be held for review.*\n\n\n**Resources:**\n- [Rainn.org](https://rainn.org/types-sexual-violence) – Types of sexual violence\n- [Rainn.org](https://rainn.org/after-sexual-assault) – What to do after an assault\n- [Rainn.org](https://rainn.org/effects-sexual-violence) – Effects of sexual violence\n- [HelpGuide](https://www.helpguide.org/articles/ptsd-trauma/recovering-from-rape-and-sexual-trauma.htm) – Recovering from trauma (available in [multiple languages](https://survivorsnetwork.org.uk/resource/survivors-self-help-guide/))\n- [Find A Helpline](https://findahelpline.com/i/iasp) – Global helplines\n- Consider visiting r/rape or r/sexualassault for support.\n- [Supporting Survivors](http://www.tstresources.org/supporting-survivors/) – How to support survivors\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1746934045.0,
      "score": 1
    },
    {
      "id": "mrp11sq",
      "body": "Oh my god love please call a domestic violence service and ask them for help getting tf out of there. Evil man.",
      "created_utc": 1746934498.0,
      "score": 645
    },
    {
      "id": "mrp8mm5",
      "body": "There are resources available if you need help, please do some research and reach out to someone that will be able to help you",
      "created_utc": 1746937985.0,
      "score": 195
    },
    {
      "id": "mrpvasl",
      "body": "I can't even believe what I'm reading. I'm so sorry that you're going through this. What an evil man to say this to you. Especially when you don't have the strength to fight him back. I pray you find a way out of there and get some peace. Where are you located? Do you have friends that would house you? I know if my friend came to me with this they would be with me in a heartbeat over living in that evil den.",
      "created_utc": 1746950990.0,
      "score": 121
    },
    {
      "id": "mrpidio",
      "body": "That’s deeply dysfunctional and abusive. Get OUT of there ASAP. I’m sorry about your health diagnosis as well, hope you will be okay. Stay strong",
      "created_utc": 1746943161.0,
      "score": 224
    },
    {
      "id": "mrqg7x8",
      "body": "If you’re in the process of selling your home but you haven’t sold it yet can you still live there? Even if it’s just in one room with a very simple setup",
      "created_utc": 1746963681.0,
      "score": 31
    },
    {
      "id": "mrr5lqv",
      "body": "Your father is a fucking monster.\n\nPlease reach out to friends, or anyone. The fact that he would be attracted to his own daughter (ESPECIALLY WHEN SHE MIGHT BE DYING!?)…\n\nI understand you don’t want ill feelings, and I feel for you. I absolutely do. But protect yourself. Please.",
      "created_utc": 1746973868.0,
      "score": 35
    },
    {
      "id": "mrqoi2g",
      "body": "You need to get out of there. Idk how but you do.",
      "created_utc": 1746967460.0,
      "score": 13
    },
    {
      "id": "mrrufup",
      "body": "You need to go to a women’s shelter. You’re living with the man who raped you as a child and he is trying to touch you and saying he finds you attractive?\n\nHells bells!\n\nYes, he would ‘go there’ because he already did when you were a small child… what in the heck is going to stop him now?!?\n\nPlease get out ASAP. You. Are. Not. Safe.",
      "created_utc": 1746981832.0,
      "score": 12
    },
    {
      "id": "mrqt7rg",
      "body": "I'm so sorry you've had to go through this. I don't have any advice for you, but I just want you to know that I'll be thinking and rooting for you. You're stronger than you could possibly know and I believe in you to get through this. You are worthy of love, happiness, and safety.",
      "created_utc": 1746969381.0,
      "score": 8
    },
    {
      "id": "mrr1u6v",
      "body": "[deleted]",
      "created_utc": 1746972593.0,
      "score": 9
    },
    {
      "id": "mrqox5e",
      "body": "When you sell your place will you have some extra cash on hand? Could you afford medical hospice boarding and care?",
      "created_utc": 1746967635.0,
      "score": 7
    },
    {
      "id": "mrr0fzl",
      "body": "I live in an area with absolutely no social structure and we actually have a few different homes near us that shelter women and their children from abusive situations. I have volunteered at a few of them and they are extremely awesome and very helpful with getting you there. From what I've been told, these are somewhat common. It's worth a look.",
      "created_utc": 1746972105.0,
      "score": 5
    },
    {
      "id": "mrsp2xy",
      "body": "You could go to a nursing home.",
      "created_utc": 1746991699.0,
      "score": 4
    },
    {
      "id": "mrt6fb2",
      "body": "I'm sorry you're in this position, but I'm telling you, do not let the last time of your life be stolen and wasted by this monster. You deserve peace.",
      "created_utc": 1746997404.0,
      "score": 4
    },
    {
      "id": "mrrw606",
      "body": "Please leave asap… you are not safe, from what you have said here… I don’t want to over step and if I have I’m sorry",
      "created_utc": 1746982384.0,
      "score": 3
    },
    {
      "id": "mrs2876",
      "body": "Leave this person. You can’t do this to yourself. Do not go into that man’s home. It doesn’t matter what you he says. LEAVE THAT PLACE, seek shelter elsewhere by any means.",
      "created_utc": 1746984279.0,
      "score": 3
    },
    {
      "id": "mrs5hsq",
      "body": "My stepfather came on to me when I was 25 and married. He denied it when I told my mom and she chalked it up to him being drunk. He’d never acted that way before and it really freaked me out. What was worse is that no one held him accountable, it was a drunk thing.",
      "created_utc": 1746985298.0,
      "score": 3
    },
    {
      "id": "mrt270k",
      "body": "Can you try looking for a small job in a cafe or something? Or try content creating about something you ate good at. And LEAVE THAT FREAKING HOUSE. What happened to your grandparents' house? Why can't y live there?",
      "created_utc": 1746996027.0,
      "score": 3
    },
    {
      "id": "mrt3t4z",
      "body": "Man I am sorry you have to deal with this🫂",
      "created_utc": 1746996546.0,
      "score": 2
    },
    {
      "id": "msw3hoq",
      "body": "I am so sorry this is happening to you. My heart goes out to you.\n\n\nFor resources, you could dial 211 or go to 211.org and see if there are any programs available to you as far as housing or income.",
      "created_utc": 1747534108.0,
      "score": 2
    },
    {
      "id": "mrv4iff",
      "body": "Horrifying!!!",
      "created_utc": 1747025068.0,
      "score": 1
    },
    {
      "id": "mrv6zfv",
      "body": "Find the nearest shelter asap. Make as many calls as you can to all churches and local resources ASAP.",
      "created_utc": 1747026368.0,
      "score": 1
    },
    {
      "id": "mrvlqia",
      "body": "Take help from those on whom you trust",
      "created_utc": 1747035007.0,
      "score": 1
    },
    {
      "id": "msvcj6u",
      "body": "Don't let that escalate. I know you feel trapped, but trust me you aren't yet. Try and seek some help now before he gets truly abusive",
      "created_utc": 1747523495.0,
      "score": 1
    },
    {
      "id": "mswiem6",
      "body": "🙏🙏🙏❤️❤️❤️",
      "created_utc": 1747540675.0,
      "score": 1
    },
    {
      "id": "mt0tuq3",
      "body": "Go anywhere but your father's place it is just not safe. Any friends or family  you can live with for a short while as you sort things out.",
      "created_utc": 1747604763.0,
      "score": 1
    },
    {
      "id": "mrpwrap",
      "body": "Unfortunately, the people i called my friends stopped talking to me shortly after getting sick. I dont have a vehicle anymore and i dont have DV resources in my area.",
      "created_utc": 1746951919.0,
      "score": 75
    },
    {
      "id": "mrqh79k",
      "body": "My home is just a trailer in a trailer park and the landlord isn’t willing to work with me so i can’t. Utilities have already started getting turned off. I’m hoping to be able to put the money away so if i can get working again or get disability hopefully it can be used to get out. But that is going to take a while.",
      "created_utc": 1746964154.0,
      "score": 27
    },
    {
      "id": "mrvdbkt",
      "body": "Nn",
      "created_utc": 1747029907.0,
      "score": 1
    },
    {
      "id": "mrr88p0",
      "body": "In my state i can’t get any disability assistance until i have a formal diagnosis and have started treatment. I’m just getting to the right doctors to start getting answers so soon i should be able to get it. There aren’t resources in my area, i recently had a friend in a dv situation and they couldn’t even help her. She ending getting family to help her.",
      "created_utc": 1746974742.0,
      "score": 11
    },
    {
      "id": "mrqplah",
      "body": "I’m not confident i will get much for it but my hope is it will be enough to get somewhere once i have income",
      "created_utc": 1746967917.0,
      "score": 6
    },
    {
      "id": "mrr8hrb",
      "body": "I have looked into it. It is such a big issue in my area that everything is full and my situation isn’t as emergent as others in my area",
      "created_utc": 1746974825.0,
      "score": 6
    },
    {
      "id": "mrt4iqj",
      "body": "Once i start treatment and what not if i can work i will but as i am right now i cant. I definitely dont have the self confidence to do content creation. My grandma sold her house after my grandpa passed and she just traveled for her last little bit after helping me get this trailer.",
      "created_utc": 1746996777.0,
      "score": 2
    },
    {
      "id": "mrqk93q",
      "body": "Can you tell the hospital your home is unsafe?",
      "created_utc": 1746965582.0,
      "score": 52
    },
    {
      "id": "mrt7ih1",
      "body": "What about your friends? Can you live with them? Staying in a toxic household will only make your mental state worse and it'll be bad for your health too",
      "created_utc": 1746997768.0,
      "score": 1
    },
    {
      "id": "mrqpgkd",
      "body": "That didn’t cross my mind i will definitely bring it up at my next appt.",
      "created_utc": 1746967862.0,
      "score": 78
    },
    {
      "id": "mrt95g7",
      "body": "No. Other than my doctors i don’t have any other people in my life.",
      "created_utc": 1746998307.0,
      "score": 2
    },
    {
      "id": "mrungj9",
      "body": "They should be trained in how to respond. Based on the amount of time I've spent with my wife at the doctor/hospital, through pregnancy and cancer, they're all quite aware that they may be the only people most would trust to share this kind of thing.\n\nHaving said that, I can't imagine what this must actually be like for you. I'm sorry you have to deal with any of this.\n\nYou've asked for help here, that's good, but I highly recommend following through with discussing with your medical professionals.\n\nWishing you well, I hope things get better for you asap.",
      "created_utc": 1747017191.0,
      "score": 9
    },
    {
      "id": "mrtaen5",
      "body": "If your illness is terminal you'll need money for it. You dad doesn't sound like he'll pay. Do you have any money saved? Can you stay at your doctor's house for a while? Maybe help them with chores or something and earn ur way their.",
      "created_utc": 1746998729.0,
      "score": 1
    },
    {
      "id": "mrtllyc",
      "body": "I’ve been unable to work for 11 months so anything saved is gone now. Thankfully once i get disability there are a lot of resources for me. Just not much until then",
      "created_utc": 1747002657.0,
      "score": 2
    }
  ]
}