{
  "id": "1ekeu6v",
  "title": "I hate my boobs",
  "selftext": "The title says it all. I thought I’d eventually get over this, but it’s really been taking a toll on me. For reference, I’m a 34B.\nIt’s reached the point where I can’t go out without an extremely padded push-up bra. \nBut when I get home and take it off, I’m hit with the harsh reality of how I actually look. It’s like a constant reminder that no matter how much I try to boost my appearance, it’s just not the same.\n\nI feel less like a woman and genuinely believe that no one will ever love me because of how I look. What hurts the most is knowing that the only way to change this might be through a cosmetic procedure, but those are very expensive, and I don’t have the funds for that.\n\nI’ve tried everything—gaining weight (which is tough due to my fast metabolism) and supplements—but nothing seems to make a difference. I feel like I don’t deserve to be taken seriously by men, and while I know people say life isn’t all about men (and I wholeheartedly agree) I still want them to find me attractive because they’re my preferred gender, but I feel like I will never achieve that because of the way my body is.",
  "created_utc": 1722831563.0,
  "score": 322,
  "num_comments": 363,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1ekeu6v/i_hate_my_boobs/",
  "comments": [
    {
      "id": "lgkaljy",
      "body": "Some men love smaller boobs. Me, for example. \nBe you. There are plenty of men who like that.",
      "created_utc": 1722834189.0,
      "score": 54
    },
    {
      "id": "lgk70e9",
      "body": "[deleted]",
      "created_utc": 1722832261.0,
      "score": 369
    },
    {
      "id": "lgk7b8b",
      "body": "My boyfriend fell in love with my 34B cup. Your mindset is holding you back.  If you truly believe you don’t deserve love that energy will radiate out and that will be your reality. Maybe you’re comparing yourself to much to what you think is an ideal body but your body is yours and you only get one. \n\nI think daily positive affirmations will help with your self image and confidence because there’s absolutely nothing wrong with any size of boobs. I get wanting to have fuller boobs but I think loving yourself as is, is more important. \n\nIf you’re truly determined a boob job is probably the only way to make them bigger and keep them because if your weight fluctuates your boob size will too.",
      "created_utc": 1722832417.0,
      "score": 97
    },
    {
      "id": "lgkk1ha",
      "body": "https://preview.redd.it/5cwsj8fejsgd1.jpeg?width=480&format=pjpg&auto=webp&s=2a3e4c04c4e26d416cba6b213efd2793acda77e3",
      "created_utc": 1722839848.0,
      "score": 68
    },
    {
      "id": "lgk8656",
      "body": "Years ago I dated a woman whom did not have any boobs basically, and she said things similar to what you have. What I realized is that whatever you decide to do, do it for yourself not for what a man might think.\n\nAny man who wants be with you, will fall in love with all of you, you’re going to be perfect to them.",
      "created_utc": 1722832869.0,
      "score": 27
    },
    {
      "id": "lgke7d0",
      "body": "As an average dude a good amount of us do not care about the size or shape, real men and even \"boys\" just like boobs. Kinda instinctual 😂 I guarantee you're not being negatively judged like you think you are.\n\nMy girl has itty bitties. Not sure of the size but I know they're A's. Would I change em? Hell no. She even wanted enlargement for the same reason and I told her while I support what she wants I think she's perfect the way she is.",
      "created_utc": 1722836275.0,
      "score": 26
    },
    {
      "id": "lgke9ek",
      "body": "[removed]",
      "created_utc": 1722836308.0,
      "score": 21
    },
    {
      "id": "lgk6w8l",
      "body": "this is very relatable! I used to feel like this a lot but looking up to celebrities that look more like me has really helped me! Every guy I know is very attracted to Zendaya and she has a smaller chest!",
      "created_utc": 1722832202.0,
      "score": 36
    },
    {
      "id": "lgk91yd",
      "body": "Not all men interested in big or just “normal” breasts. \n\nI had my worries but my partner preferred small! I have small (like yours or smaller, don’t really good at this metrics) and he said that if they were smaller it would be perfect:))\n\nOther people were always… not really understating (eat more cabbage, oh you want to look like you have bigger tits, look at your moms breast). Smaller breast has its own positive sides: no back pain, no searching for bras that will be enough to hold it etc. So dunno who won the lottery you know:)) Anyway, I do like how bigger breasts look like, but for myself I am fine.",
      "created_utc": 1722833342.0,
      "score": 14
    },
    {
      "id": "lgkc8s5",
      "body": "I am a 44A cup at 5'6 and 230 lbs. Hopefully you learn to love yourself soon. We were born to be happy.",
      "created_utc": 1722835130.0,
      "score": 12
    },
    {
      "id": "lgkgz8j",
      "body": "Word! I did it and regret it! I wish I had invested the money elsewhere, done more therapy.... Now I have 2 plastic oranges instead of real boobs, ask around most men just like the look but don't like to fondle  dem plastic boobies..",
      "created_utc": 1722837938.0,
      "score": 8
    },
    {
      "id": "lgke2fj",
      "body": "Wow. This hit in the feels. I was you! I'm 40 now, have an amazing husband and life I wouldn't change for the world. My boobs are still a B cup BTW. And my hubby loves me and helped me learn to love my body and mysel. You ARE beautiful! The size of your breasts doesn't define who you are as a person, or even as a woman! Try to Think of positives about your breasts when thinking a negative thought. For each bad thought one equal good thought. That was something that really helped me",
      "created_utc": 1722836195.0,
      "score": 8
    },
    {
      "id": "lgkhre3",
      "body": "[deleted]",
      "created_utc": 1722838416.0,
      "score": 6
    },
    {
      "id": "lgk7ihf",
      "body": "Your thoughts are not permanent or unchangeable.. Your feelings are “real but not true”. Do everything you possibly can to train your mind to think differently- Cognitive Behavior Therapy.. In the meantime my advice would be… Try not to consume ANY  media that has people who look the way you wish that you did. Instead, fill your life with images of women who look like you that are beautiful. My mom had to have her implants removed and she felt so much more comfortable after seeing Poor Things because of Emma Stones small breasts. It helped her to realize that even conventional beauty standards love and esteem small breasts! I can’t say she’s totally over it but little by little I see a shift and she’s been wearing different clothes and going out more confidently. This feeling won’t last forever.",
      "created_utc": 1722832523.0,
      "score": 5
    },
    {
      "id": "lgki0d6",
      "body": "Hey girly,  I’m not sure how old you are, but I just wanted to mention that it is completely normal for your opinions on you’re body to fluctuate or to stick around for a while as you age.  Especially as our weight and hormones shift.  I also think the media has a big influence on how we as a society views beauty.  For example, when I was a kid it was all about big boobs and a small butt, then the Kardashians kicked us into the big butt exaggerated hourglass figure, and now it feels like we are in the middle of a shift again with so many people reversing BBLs.  I’ve personally noticed a shift towards the itty-bitty-titty community as well and I admire the HUGE variety of clothing styles that can be pulled off with a more modest chest size.  As a woman who leans a bit on the larger boob size I can say just how jealous I sometimes get seeing the outfits girls with A/B cups can pull off.  \nAlso, since you mentioned concern for how you are perceived in the eyes of men (who, I should point out, should never dictate how you conduct your life) I understand the initial concern.  It reminds me of how I felt when I hadn’t been in a relationship yet and had nothing to base it off of.  And I didn’t have my first relationship until I was 21, so it was a very long time of unnecessary panicking.  In regard to that I’ll point out that boobs are just one marginal part of the equation.  As long as you don’t date an a-hole, most guys don’t tend to limit their dating pool by breast size.  It’s more of a perk than a requirement, and if you meet the right person it won’t be of any consequence.  I’ve had my own insecurities about my boobs and those concerns are usually swept away after a good conversation. \nAllllll this being said, if it’s for you and not for men, someone else mentioned working out, that will help, specifically chest exercises.  I think exercise will also help with your self confidence overall and so, twobirds - one stone.   I suggest you could also try experimenting with your style.  I think a big part of being comfortable with yourself is expression through clothes that make you feel confident.  Try out those different styles, see what you like and don’t like.  Heck, go on a shopping spree at the mall and even if you don’t buy a single thing, at least you’ll have put some ideas into that beautiful head of yours. \nGood luck girly, I promise you’re doing great.",
      "created_utc": 1722838571.0,
      "score": 5
    },
    {
      "id": "lgkj3sn",
      "body": "Trust me as a man, most of us don’t care about breast size.  We love them all. Me personally prefer any size natural breast to fake ones.",
      "created_utc": 1722839255.0,
      "score": 5
    },
    {
      "id": "lgkht9m",
      "body": "OP. I’m not sure what your age is, but most men just don’t really care about boob size. If they get to touch boobs, they’re happy, no matter what size they are. Sure, they might state they have preferences, but when you meet someone who likes you, it won’t be an issue. If it’s really concerning you though, there are a few forums online about how trans women increase their breast size that may be helpful to you. There’s supplements like fenugreek etc that can naturally increase your oestrogen and this might help with some growth. There’s also vacuum machines that have been used successfully and you can probably get those on Amazon etc pretty cheap. Once you’re older, you’ll probably love the fact that you have a smaller bust, as that means less sagging. Obviously, talking to a professional is your best bet, as being ok with your body is the main priority. Hugs 🤗",
      "created_utc": 1722838448.0,
      "score": 3
    },
    {
      "id": "lgkhwv5",
      "body": "Men / women are free to like whatever they want to like. Some like them big, some like them small, some don't care. It's all good and everyone is free to have their own likes and desires and that's how it should be. \n\nEveryone needs to accept this and just be themselves. It's nobody's fault, there is no problem and no explanation is required. \n\nOP, love you, be you and just do you... everything will work out fine. Chuck the padding and rock those B's.",
      "created_utc": 1722838512.0,
      "score": 4
    },
    {
      "id": "lgkjjzl",
      "body": "I have gigantic boobs and I hate them. They get in the way and make me feel uncomfortable when I sleep. I get stares for them sometimes. I wish they were smaller, you should feel lucky",
      "created_utc": 1722839543.0,
      "score": 4
    },
    {
      "id": "lgkiomy",
      "body": "There are sub-reddits for everything, including breast size. I'm not saying to post pics, but perhaps you could get some reassurance and validation to read the comments on other people's photos.\n\nNot all men like big boobs. Some like them small and some like them in all sizes. I'm in the former category and it always makes me sad to read whenever someone say small boobs make them feel less of a woman. I hope you learn to like them.\n\nEdit: Formulating it more clearly.",
      "created_utc": 1722838993.0,
      "score": 3
    },
    {
      "id": "lgkjw6n",
      "body": "It’s easy to give into temptation. You’ll find people who overlook your looks and see you as what you were born as. Not what you were born with. You’re beautiful and even have an even more beautiful heart. Keep your head up.",
      "created_utc": 1722839754.0,
      "score": 3
    },
    {
      "id": "lgkkp40",
      "body": "For me it's less about boobs and more about how you think you are compared to other women and how you are perceived by men.\n\nI have an E cup and I hated the attention while I was younger. Like I was a bit of meat for one thing. It was actually really stressful for a bit going out. I really struggled in the complete opposite way because of it. Also back pain is horrid, boob sweat is horrid and bigger bras and swimsuits with support are more expensive. Don't get me started on trying to find nice summer dresses! My partner is a boob man I'm not going to lie but there are plenty of men who aren't. \n\nHaving bigger boobs isn't going to solve your problems. Every women thinks the grass is greener. Just wanted to provide some evidence that it's not all perfect",
      "created_utc": 1722840262.0,
      "score": 3
    },
    {
      "id": "lgklk5p",
      "body": "Trust me, most guys of any value aren’t gonna care about that.",
      "created_utc": 1722840808.0,
      "score": 3
    },
    {
      "id": "lgk83mx",
      "body": "Do pushups! 15x4, 90 second break between each, work from there. \n\nSide note: every person has a different preference for every size. If they don’t find you attractive because your boobs are “too small” or “unappealing”… well, that’s on them. It’s not really a you issue more than it is them. They don’t like you, they don’t like you. Can’t make them like you. Can’t make them like your boobs, either. All you can do at that point is focus on within and improve your quality of life. It’s yourself that counts. Your happiness and confidence, no one else’s. That’s the journey.\n\nAlso, there are plenty of people I’ve met and know that don’t really care for boob size. And if they do, they prefer smaller. The people that **do** like significantly larger tits are a VERY vocal minority, at least from my experience. Don’t tear yourself down and beat yourself up over a small group of people that don’t acknowledge your existence. It’s not worth it. It’s draining for no reason. Better to put the energy towards something that WILL be worth it, such as self-improvement mentally, for example. Once you do that, the physical stuff is much easier. Mindset and discipline is key.",
      "created_utc": 1722832832.0,
      "score": 7
    },
    {
      "id": "lgkkgj2",
      "body": "As weird as it sounds, you might benefit (if you’re so inclined) from watching some porn videos tagged “small boobs,” “tiny tits” etc. Or at least looking through some of the comments. There are TONS of dudes and chicks who love small boobs even MORE than large boobs. And as small goes, 34B really isn’t that small. Pretty sure that’s fairly average. \n\nWhen I was a teenager I was really insecure about my wang despite average size, because of how ridiculously-sized so many guys in porn are and how early in life I was exposed to it, like 5-6 years old. After moving away from professional porn where every part of every actor’s body is fake/enhanced/shown at just the right camera angles, (and getting more experience with real girls in my life) I got a lot less insecure. \n\nAs a straight dude, I can tell you for a fact that like 98% of us are just as thrilled by smol bobas as we are by cowmungous jugs. And a lot of us prefer smaller, too. From all the lesbian and bi girl friends I’ve had, women feel the same way. Boobs are boobs. They’re all nice in their own way\n\n\nDunno if that actually helps, but I can tell you right now that you are 600% overthinking it. A lot of men prefer small boobs because they’re just hot in a different way",
      "created_utc": 1722840111.0,
      "score": 5
    },
    {
      "id": "lgkbasi",
      "body": "My partner has 34B and they’re gorgeous",
      "created_utc": 1722834588.0,
      "score": 2
    },
    {
      "id": "lgkfnjf",
      "body": "Man here, my wife has a 34b cup, and I love them, tons of other men love the size too, stop being so hard on yourself, amd love yourself",
      "created_utc": 1722837137.0,
      "score": 2
    },
    {
      "id": "lgkkhyq",
      "body": "I don't care about boob size at all. I can understand why you would feel the way you do, given the societal standards and messaging in the media,  but I don't think that that reflects the reality of what a lot of men are attracted to.\n\nI think you should be confident in yourself and realize that a lot of men will find you and your boobs attractive just the way they are.",
      "created_utc": 1722840136.0,
      "score": 2
    },
    {
      "id": "lgkkxnk",
      "body": "I’m a 34B and I’m hurt 😀 (LMAO not really)",
      "created_utc": 1722840412.0,
      "score": 2
    },
    {
      "id": "lgkluqc",
      "body": "You can gladly have my boobs. I always get told how big my boobs are for my small body but I think they are disgusting/ugly I wished I was flat chested, it looks much better with the style that I have /oversized shirts, joggers. Point being; A human is never satisfied, everyone always wants what they don't have . All you cand o is to love and embrace yourself, try to find the good in what you have and the faults in what you want to have.",
      "created_utc": 1722840993.0,
      "score": 2
    },
    {
      "id": "lgkm0a4",
      "body": "imo small perky boobs are way cuter than big saggy ones, which, anyone who has big boobs evntually has sag just because gravity over time weighs them down & stretches skin. also big boobs often cause immense back pain.\n\n\n& hey, at least you don't have an A or AA cup! but anyone that truly values you won't give a fuck about your cup size. it's a blessing in disguise really, because people objectify women anyway, & dudes often objectify big boobs.",
      "created_utc": 1722841091.0,
      "score": 2
    },
    {
      "id": "lgkopdq",
      "body": "I'm a 40f/g and I wouldn't wish it on anyone tbh I'm looking for a reduction as my back and neck are killing me and I'm so sick of unwanted attention from idiots as I'm married but I was a 34b at 12 and hated it please try to look at your body as beautiful and the right man will love you for you",
      "created_utc": 1722842863.0,
      "score": 2
    },
    {
      "id": "lgksmql",
      "body": "If a guy only wants you because of your breasts, he's not the guy you want. When we fall in love, we fall. It wouldn't matter if she was in a wheelchair if it was real.",
      "created_utc": 1722845533.0,
      "score": 2
    },
    {
      "id": "lgoz3nf",
      "body": "34B is right at my idea of perfection. Don’t worry about men. There will be PLENTY of men who think you’re the perfect size.",
      "created_utc": 1722902578.0,
      "score": 2
    },
    {
      "id": "lgp2pnj",
      "body": "I'm a B-C guy... I promise you there are way more of us than there are guys who really like fake ones. Find other things to improve.  Boobs are usually beautiful how they are.\n\nIf you have a fast metabolism and b cups you are likely the classic version of attractive and that is still very very attractive.",
      "created_utc": 1722903934.0,
      "score": 2
    },
    {
      "id": "lgqcsjw",
      "body": "As a guy, I can guarantee that not all men care about the size of people's breasts.",
      "created_utc": 1722924546.0,
      "score": 2
    },
    {
      "id": "lgqoxhe",
      "body": "If you are looking for a man who only takes women seriously based off their cup size then sure. But the right man will see you. Not just boobs. You are not the sum of one or any of your body parts. You are a person with a wonderful mind and personality and many more important things to offer than just boobs. Try focusing on self love and acceptance. We all have things we dislike about ourselves and our bodies. I too was a b cup and I hated it and wished I had bigger chest. Years later I had kids and I'm now a F and guess what, I wish I could go back to perky B with no back and neck pain and not needing to wear a bra constantly. You only get one body, love the one your in, bodies do and will change throughout our lives and one day you may find yourself a older version of you, looking back and thinking wow I used to have great boobs.",
      "created_utc": 1722932512.0,
      "score": 2
    },
    {
      "id": "lorfuhw",
      "body": "Hi! I want you to know that you are NOT alone in this AT ALL. When I say I feel EXACTLY the same I mean it. And honestly it’s a relief because the amount of reddits, and google searches I’ve searched no one feels exactly what I’m feeling and I feel totally alone. So thank you so much for sharing and having the guts I don’t have.  I am a 32b and I can say I HATE IT. There is nothing attractive about it for me and it’s ok for you to feel the same way as well if you do. I am to the point where I’m exhausted trying to like it and I’m exhausted with everyone telling me it doesn’t matter, oh small boobs are pretty blah blah blah. I hate this “love yourself” culture. It’s honestly so unhealthy. There are things to love about yourself and there are things you want to change and I see no problem with that. People wear makeup, dye their hair, get tattoos, wear wigs like enough is enough with the “love yourself bologna” everyone is a hypocrite one way or another; all in all what I’m saying is no offense to the people out there but it’s really tiring to hear that BS.    One thing I want to say which is VERY important is: to make sure that you actually know YOU don’t like it. Don’t watch the movies or the shows and definitely don’t look at instagram. At the end of the day and I mean literally at the end of the day you have to know yourself that you don’t like it… and not because of men either. That’s a big NO NO. You should do nothing for no one, especially not men. I can not stress this enough that You YOURSELF is what matters most.  So definitely don’t care about what they think or like or want!  YOU have to know what YOU like and dislike. That’s important!!  On the topic of surgery, I have had the same issue. It’s very expensive and honestly the other main concern for me is the worry that something will go wrong health wise. I’ve been reading up on scares of side affects and long term problems etc but one thing my sister said to me that stuck is “well everyone is gonna get or have something bad, so you might as well love how you are and look everyday cause we only got so many days”  As for funds, you should look into your credit card and see about payment plan options. Some doctors have financing! So you can pay monthly! There are many options and if you want it do it!  HEY! Let’s go together! ❤️❤️❤️❤️  Sorry for blabbering and venting. Clearly I’m on one today but I hope I’ve said something useful to you! ❤️❤️❤️❤️",
      "created_utc": 1727215378.0,
      "score": 2
    },
    {
      "id": "lgknn4o",
      "body": "Guy here. I love tits - all kinds of tits. The teeny tiny ones, the big ones, the ones that sag, the ones that perk up.\n\nThere is no reality where I don’t like a pair of boobs. Small ones have their own sexiness, aesthetic, complementary look and appeal. There are literal subreddits dedicated to small boobs and petite bodies.\n\nYou’ve been fed this idea that the size of your boobs means something important. It might mean something but not something important. The reality is your body has a flow to it and your boobs probably complement that overall flow.\n\nThere is no reality where I’ve been with a partner based on the size of their boobs - and I’ve been with women of all body types.\n\nMaybe have a look at models, actresses, athletes with your style of boobs and see how they make it work for them - instead of push up bras, how do they style and compliment their actual shape and appearance?",
      "created_utc": 1722842154.0,
      "score": 4
    },
    {
      "id": "lgkbvp9",
      "body": "There are exercises that can help with breast tissue growth. But the size doesn't matter. Men can be assholes about it, yes. But, if they love you, then they will love every part of you. And love you just the way you are. XXX",
      "created_utc": 1722834921.0,
      "score": 1
    },
    {
      "id": "lgkgdtv",
      "body": "I don’t at all have a fast metabolism (I actually struggle with my weight a lot) and was 36B forever (different now because I have had a couple children).  The first time I was about to be naked in front of my now-husband (he was my first boyfriend and first person I was naked in front of) I rolled over on the my face on the bed and said “I’m not much and I don’t want you to be disappointed.” He actually giggled at me.\nI can tell you that that man freaking loves my breasts.  He even like them now in their post-nursing weird stretchy state that I’m getting used to. 🤣",
      "created_utc": 1722837578.0,
      "score": 1
    },
    {
      "id": "lgkjv4q",
      "body": "Sweet girl, the amount of cleavage you have doesn't make you more or less of a woman. What makes you a woman is you. Not what society and the media defines as \"the perfect woman\" or what the edited Instagram models look like. You are beautiful the way you are. The best thing you will ever do for yourself is to learn to love yourself and your body. \n\nBig boobs look fun in pictures, but there is a lot you don't know behind them. I myself am 52dd and because of that have neck and back pain and constant sweat rashes in the spring and summer. That doesn't even get me started on the price of bras ($50 plus for anything that won't break within 3 wears) and the random men who \"accidentally\" grab them in public.",
      "created_utc": 1722839737.0,
      "score": 1
    },
    {
      "id": "lgkkh67",
      "body": "I’m a woman as well… 34D. I feel this is a grass is always greener thing. I’m 27, but when I was in high school and up to about 21, I wished I was born with larger breasts as I saw photos of other girls or compared myself in size. \n\nIt’s social media bullshit honestly. Now that I’m older, I honestly wish I had smaller breasts even though mine aren’t big to begin with. \n\nThey suck! I just want to sit and relax, but the fat folds and I get lines from it… It’s super uncomfortable and honestly a bit painful. I couldn’t imagine it for girls with bigger breasts. \n\nThat being said, it’s my personal opinion against my own body. \n\nIf you want, plastic surgery is an option, or there are workouts to enhance the muscle in that area to make the breasts bigger. \n\nIf that’s what you need to feel comfortable in your own skin, do it! And tell anyone who says otherwise where to go. It is your body and you have every right to feel comfortable in it. \n\nIf you choose plastic surgery, I have my own story as well if you want to know: \nI’ve had plastic surgery myself for a part of myself I was bullied for as a kid. It was a mole on my face. I don’t regret it for a single day because it made me feel so much better about myself and I won’t forget that moment that I looked in the mirror and liked what I saw and the confidence I felt. Sure, I may have come to love myself as I was later on… but I can’t forget how great I felt back then. I haven’t regretted it. \n\nPart of me wonders if I hadn’t gone through the pain of having it removed. \n\nI only share this as so many people state their own opinions on the matter. I can tell you, you are beautiful! I don’t need to see an image for that. Everyone is in their own ways. Everyone looking the same would suck! But it is okay to want to change your appearance if you think it helps. \n\nMy suggestion, take a look at your family if you can. We take many features from them. \n\nHave you ever thought your mom was beautiful? How about a sister or cousin? They may have the same thoughts you do, but if they expressed them to you, would you be able to understand those thoughts? Or would you tell them how beautiful they are and compare yourself? They would do the same. \n\nI know I just did a lot of contradictory… sorry for that. \n\nBeauty is subjective to everyone. If you choose to do anything for your appearance, make sure it’s something that you want in the end.",
      "created_utc": 1722840122.0,
      "score": 1
    },
    {
      "id": "lgklzly",
      "body": "Yeah, bigger boobs aren’t a solution. They’re actually more pain. Mine aren’t that small anymore (not since my teens) and puberty decided to increase my bust more than I wanted. I’m at the stage of mammograms and they were swollen for 2 months 😑(cancer free btw, but my sister got it and my late aunt).",
      "created_utc": 1722841079.0,
      "score": 1
    },
    {
      "id": "lgkqyou",
      "body": "I'm smaller than you are, and it has never been a problem for my partner. The right person won't care and will love you for who you are. \n\nBefore thinking about other people, I encourage you to think more about how you view yourself and more consciously steer yourself to being positive about you! Every body is different and there is no right or wrong body. If you do decide to get surgery, I hope it's for yourself and not for anyone else or society.",
      "created_utc": 1722844389.0,
      "score": 1
    },
    {
      "id": "lgkr499",
      "body": "I misread the title of the post and thought you said, \"I hate my boss\" As you can imagine, I was super confused when I continued reading the description. \n\nThere are many men who are attracted to the body type you have. Not everyone is crazy for big boobs. As I person who has a bigger chest, I hated being objectified by people for it. The best thing is trying to accept our body and ourselves, instead of changing it while we are unhappy. I am 100% sure you have much more to offer than just your body. Focus on things that you love about yourself, and the boobs will seem less of a problem.",
      "created_utc": 1722844495.0,
      "score": 1
    },
    {
      "id": "lgkt3h9",
      "body": "Hey, I know this is a mental illness but try and stop being this obsessed. I have the same size of boob as you and I’ve had plenty of guys compliment them… and when they didn’t, they didn’t even notice anything. It’s truly all in your head. Take care x",
      "created_utc": 1722845852.0,
      "score": 1
    },
    {
      "id": "lgkt5u8",
      "body": "Go to r/abrathatfits and check your size, for a start. Ignore whomever measured you, especially if it was Victoria's Secret. Chances are you are not a 34B, especially if your dress size is smaller than a UK14 or US10. Being in the right size might help you feel better about them.",
      "created_utc": 1722845898.0,
      "score": 1
    },
    {
      "id": "lgkt98e",
      "body": "Boobs are boobs.",
      "created_utc": 1722845963.0,
      "score": 1
    },
    {
      "id": "lgktg4g",
      "body": "My personal opinion doesn't necessarily have to mean much to you, but if it helps you understand that it's not as detrimental to your attractiveness or chances for love or anything like that...\n\nMost guys, at least GOOD guys, ones you'd actually want to date and marry- they won't care. Some guys actually like breasts smaller, some like it bigger, and some like it inbetween- take it from a guy who talks to a lot of guys about plenty of hilariously generic guy things! The interests vary. But more than anything, we don't care ultimately, a girls breasts would never deter any guy I know from dating her if she was just a good person who loves us. That's what I'm willing to bet any decent man really wants, is a woman who loves them and treats them well.\n\nIMO, if a girl has a beautiful personality, it just makes any physical features she has immediately more attractive. Plus, if I'm going to be a little more shallow, I tend to prefer them small to medium; so dudes like me exist.\n\nYou're beautiful the way you are! There's much more to you than your chest, and I know for a fact there're actually girls who feel just like you- except they're jealous of YOU. That's not to say \"you should be grateful!\" or something stupid, I just hope you can take a little comfort in the idea that there are women out there who are jealous of you.",
      "created_utc": 1722846096.0,
      "score": 1
    },
    {
      "id": "lgkv2lo",
      "body": "As a man and a certified boob enjoyer, I can assure you that you are beating yourself up, the right person will love what you are and what you have.",
      "created_utc": 1722847205.0,
      "score": 1
    },
    {
      "id": "lgkwt9f",
      "body": "It's normal to want validation from the sex you're attracted to, but that much is a little bit toxic. You'll never make everyone happy, so best is to make yourself happy. It's important that YOU'RE satisfied \n\nPlus, it's a stereotype that guys only want physical looks, and making such a drastic decision based on that assumption would be deppressing imo. I'm not against those procedures, but you should be aware that you are loveable anyways.",
      "created_utc": 1722848394.0,
      "score": 1
    },
    {
      "id": "lgkxknv",
      "body": "Man I wish I was a B cup, I’m an A cup and it makes me so self conscious.",
      "created_utc": 1722848930.0,
      "score": 1
    },
    {
      "id": "lgkyqsq",
      "body": "I'll preface this by saying; I don't like my boobs, never have never will. Unless medically necessary I will not ever have any procedure performed on them.\n\nNow unto the important part; You are not your type. You don't date carbon copies of yourself with different appendages. Thus you're always going to be an unreliable narrator and judge. You're also letting the idea of, in your hetero stance, men finding you attractive (or not) dictate your happiness about your own body?\n\nThis mantra has stopped me obsessing about them. Hate is an obsession. Dislike is fine as it's not an extreme point and dismissible 99% of the time. As many already stated men don't really care when push comes to shove. Boobs are boobs and their top-brain will cease all functions when confronted by both personalititties unencumbered by layers of fabric (specially when emotionally invested in you). Top brain may say \"I like big boobs\" bottom head says \"booooooobies... *gurgle noises*\"",
      "created_utc": 1722849737.0,
      "score": 1
    },
    {
      "id": "lgkzem5",
      "body": "G cup and feeling the same damn way.\n\nClothes never ever fit right on me.\n\nThe grass isn't always greener on the other side.",
      "created_utc": 1722850196.0,
      "score": 1
    },
    {
      "id": "lgkzfst",
      "body": "Don't you worry, smaller boobs are usually more beautiful, to be honest ^^",
      "created_utc": 1722850219.0,
      "score": 1
    },
    {
      "id": "lgkzhdc",
      "body": "Hello…I’m…a 32A…My dad makes fun of me for having no boobs, I got made fun of for looking like a 12yr old boy by my ex (says more about him than me probably)….I keep getting the “when you have kids talk”…I get poked fun at by my friends…\n\nAs a flat chested gal, remember the fundamental truth, comrade: we won’t get bad back pain from big boobies! We can sleep on our stomachs better than big chested girls! \n\nMy best friend for a whole had a very large chest and the amount of unwanted attention she got…she hated having big breasts…It’s that constant problem of never quite being satisfied with yourself. I’d be jealous of her as a teen and she’d be jealous of me…I just sort of said sod it, I’m healthy. Everything works as it should, screw these negative feelings! \n\nRegarding men, yea, you get comments from assholes but everyone has a niche…I’m pear shaped, for example…so most of the guys that go for me are into that more so than my chest…there must be some beautiful features you have (whether that’s your eyes, your sense of humour…anything!), that’ll make the right lad go crazy for you…\n\nRegarding cosmetic procedures, ngl, I’ve considered it too…apparently, they give you more than you ask for because “most women regret not going bigger”, so I ditched the idea. I don’t wanna ask for Cs and wake up with DDs…also, who would you be getting this insanely invasive procedure for? Judgemental men who probably don’t deserve you or yourself?",
      "created_utc": 1722850249.0,
      "score": 1
    },
    {
      "id": "lgkzxxz",
      "body": "\n\nif you want i can give you a bit of mine, i don’t want them anyways, so",
      "created_utc": 1722850568.0,
      "score": 1
    },
    {
      "id": "lgl4bq0",
      "body": "I just want to chime in with someone who has larger breasts and am in my 20s, I have felt the opposite where I see my friends with smaller chests who can wear really cute dresses and tops with no bra and they are still perky and cute. It is so uncomfortable for me not to wear a bra, and my boobs really sag. I also feel like I get unwanted attention from men wearing certain things that I know I wouldn't if they were smaller. \n\nI'm assuming you're a teenager... when you're a teenager this stuff feels like the end all be all. You get older and (hopefully) realize that you are beautiful the way you are, as are your friends, and there literally is no one body type that attracts all men. You also get to a point when you're less concerned about whether men will be attracted to you, and more concerned about unwanted attention and finding a guy who is actually kind and considerate. ",
      "created_utc": 1722853411.0,
      "score": 1
    },
    {
      "id": "lgl4mv8",
      "body": "I HATE my boobs too and they're huge!",
      "created_utc": 1722853604.0,
      "score": 1
    },
    {
      "id": "lgl4pob",
      "body": "I have big boobs, and they're a pain! They get in the way of exercising, lying on my stomach, clothes fit me funny and also I've always hated how they look, since I was about 14. I'd love to have small boobs. Men who go for(any size of) boobs are only interested in sex anyway. \n\nI hope both of us can learn to love our bodies for how they are, small or long boobed.",
      "created_utc": 1722853651.0,
      "score": 1
    },
    {
      "id": "lgl6jkv",
      "body": "Show me so that I can suggest something.",
      "created_utc": 1722854752.0,
      "score": 1
    },
    {
      "id": "lgl6mvb",
      "body": "I think if you find a reputable counselor, they may be able to help unearth the deeper reasons you're unhappy.\n\nI hope you're able to work through this with a positive outcome 💙",
      "created_utc": 1722854804.0,
      "score": 1
    },
    {
      "id": "lgl6yct",
      "body": "Just get a titty job",
      "created_utc": 1722854984.0,
      "score": 1
    },
    {
      "id": "lgl7xjo",
      "body": "Smaller chests are actually very popular rn lol. I’m like you but opposite. I have double D’s and I feel like they’re disgusting sacks of fat hanging off my chest. I hate having them and I wish I was your size. Grass is always greener on the other side I guess :(",
      "created_utc": 1722855526.0,
      "score": 1
    },
    {
      "id": "lgl9h8c",
      "body": "I'm a natural E and went back up to an F because of pregnancy and I can tell you: big tiddies aren't as glorious  as the media make you believe.\n\nThey are super heavy, so they naturally sag a lot faster (I'm only in my early 20s and already have saggy boobs, because they are so heavy). They cause me serious back pains, especially if I am not wearing a bra, but when I am wearing a bra I cannot breathe properly cause it needs to be tight to support the weight. No sports bras offer the support I need and I can never just go to a department store and find a fitting bra there, but I have to go to stores that specialize in underwear to even find my size - and the bras there are 3x -4x as expensive.\n\nFurthermore I get sexualized and stared at by men a lot more than I would like to and I feel super self-conscious without a bra, so I can never wear anything strapless or backless. All my clothes have to have sleeves or straps that hide the bra straps, which is super annoying in summer.\n\nI don't mean to dismiss your insecurity in any way, you have every right to wish for more volume up there despite all these things and I am really really sorry you feel that way about your beautiful body. \nI just want to show you that the grass isn't all that much greener on the other side either.\n\nMy advice is to learn to love yourself and your body the way it is. You can start by watching body positive content, ordering a self-love workbook (I recommend \"My body is not an apology\") and doing some thankfulness/gratefulness exercises each day.",
      "created_utc": 1722856358.0,
      "score": 1
    },
    {
      "id": "lgl9hcy",
      "body": "If a guy is choosing you solely based on the size of your breasts then trust me you're better off without that guy!",
      "created_utc": 1722856360.0,
      "score": 1
    },
    {
      "id": "lglblmt",
      "body": "Omg I’m a 34B and mine are so saggy and I’m only 22. I feel you xx my biggest insecurity",
      "created_utc": 1722857450.0,
      "score": 1
    },
    {
      "id": "lglf6l4",
      "body": "I could have written this myself. I only take off my bra to shower. I can’t even bear to remove it for sleep. I’ve slept in a bra since I was 15 and refuse to buy anything that isn’t push up (not the crazy padded ones, but still push up).\n\nThere are plenty of men out there who will love your body as it is. However, even when you find one it does no good long term until you love your body. I wish I had a solution on confidence and feeling attractive, but you can love and appreciate your body without thinking it’s attractive. \n\nSociety doesn’t seem to care how mentally distressing this is. I’ve felt defective and incomplete for half of my life. I wish that after so much therapy that it would be permissible to get an augmentation as insurance covered, gender affirming care\n\nYou aren’t alone ❤️",
      "created_utc": 1722859163.0,
      "score": 1
    },
    {
      "id": "lglgjm5",
      "body": " I saw a subreddit where the majority of men said that they find big boots (or boobs that don't fit the rest body of the body sizewise, i mean slim body and perky D boobs) extremely unattractive",
      "created_utc": 1722859796.0,
      "score": 1
    },
    {
      "id": "lglgodi",
      "body": "I’m basically a negative A cup and in my 30’s now. I’ve always felt like less of a woman for most of my life. I’d wear push up bras to bed in highschool just to feel better about it. About 10 years ago I stopped wearing a bra and never looked back & it’s given me a strange confidence I never knew I had. De centering men has really helped as well <3",
      "created_utc": 1722859857.0,
      "score": 1
    },
    {
      "id": "lglgri6",
      "body": "As a man All i can say that when we want to get into a serious relationship, we don’t really put that in mind if we truly love the person",
      "created_utc": 1722859897.0,
      "score": 1
    },
    {
      "id": "lglh6ag",
      "body": "Trust me as someone with 36f. You don’t get the back ache ..boob sweat..rashes under boob and yours will stay perky!!!!",
      "created_utc": 1722860084.0,
      "score": 1
    },
    {
      "id": "lglhh5d",
      "body": "Go braless, sexy small titties are gorgeous especially if you can see some nipple through the clothing. Guys go mad for that .",
      "created_utc": 1722860220.0,
      "score": 1
    },
    {
      "id": "lglhrgf",
      "body": "on one hand, who cares about what men like? and btw this isnt boob obsessed 1992, most men arent as into boob size as u think and B is a normal size so im really confused about your perspective on this...like seriously confused.\n\non the other hand if YOU want boobs then f'ing start saving money and get some and stop complaining. \n\nyou need to go to therapy though bc you are weirdly hung up on that one body part.",
      "created_utc": 1722860349.0,
      "score": 1
    },
    {
      "id": "lglhxmr",
      "body": "I love my small perky boobs they are more aesthetic than the larger ones IMHO",
      "created_utc": 1722860426.0,
      "score": 1
    },
    {
      "id": "lgli84x",
      "body": "I dont think boob size matters as much as we think it does. I'm a women and I am a huge fan of women with smaller breats (mine are a 36 d and they are cumbersome lol). You can't really do much with more than a handful at a time anyway. You don't have to wear a bra. Your boobs aren't going to sag down to your knees and your clothes will fit. And you can always get implants if it is that bothersome to you.  A lot of ppl have a thing for smaller breasts anyway.",
      "created_utc": 1722860554.0,
      "score": 1
    },
    {
      "id": "lgliqnj",
      "body": "mine are bigger and i hate them. wanna trade? lol",
      "created_utc": 1722860779.0,
      "score": 1
    },
    {
      "id": "lglkfbg",
      "body": "I don't know how old you are but if you're younger than 30, give it time. I was your size in my early 20s and by the time I was in my 30s I went to a DDD, then had a reduction surgery. I understand you're disappointed in your breast size but it doesn't define you. And any man that does try to define you by your breast size isn't the one for you anyway. You're not disappointing anyone around you. Men like boobs of all sizes. If you choose to get a breast augmentation do your research of the dangers on doing that.",
      "created_utc": 1722861500.0,
      "score": 1
    },
    {
      "id": "lglpwoa",
      "body": "I've struggled with this for the longest time. \n\nCIS woman with close to no breast tissue, asymmetrical as well. I'm so flat I've had medical professionals comment on it when I went to get medical imaging done. She saw how old I was and commented on it. Then asked if I'd ever have kids then maybe I would get more breast tissue (I told her kids aren't in my future plans, so I guess I'm sol?)\n\nClothes I like don't fit me the way that I want. And I'm embarrassed to ever be topless in front of anyone.\n\nI was saving up for a boob job but after research and a lot of thought, the possible complications and requirements for maintenance would not be enough reason for me to sustain having implants (financially as well).\n\nI was also in a relationship for over 10 years where I felt really insecure about my appearance, where I was compared to other girls frequently. \n\n... But that relationship ended. I ended up really focusing on my mental health for the first time in my life, going to therapy. Body image issues got worse. After years of focusing on my mental health, getting professional support, I was in a decent head space. Found I had other things to offer outside of my appearance. Decided to start dating again. Met someone who never nitpicked my appearance, compared me to other people, let alone even comment on my appearance. He complimented me, never made me feel so ashamed about how I look. And I noticed I started focusing less on the value of my appearance. \n\nI've accepted how I look to a certain degree. Do I still wish aspects of my appearance were different, like how my body looks or the size of my boobs or aspects of my face? 100% yes. But does it eat away at me and take away from my enjoyment of my life like it used to? Not anymore. I've even learned to really find positives of it in a genuine way. I really value my sleep and I'm so happy I can sleep on my stomach without issue. I learned that acceptance doesn't have to mean loving my situation. Maybe that comes later, maybe not. But acceptance means this doesn't remain a debilitating part of my life. I was too scared to try new things, meet new people because I felt I was unattractive. I also used it as an excuse to not work on myself because \"what's the point, I'll just always be ugly.\"\n\nOn a separate note, I highly recommend checking out r/abrathatfits as I found so so many women (including me) never had the right bra size calculated for them. I always thought I was a AA cup but even those were too big for me. However, it's the smallest available at any storefront I'd go to. The bra calculator gave me a more accurate size and I've seen many other women sing praises for finally getting a properly fitted bra after years of going off big box store sizing (personally and unfortunately not many companies make my bra size, the smallest possible size it seems). However, it led me in the right direction to finding something that actually fits me better and made me feel better about myself too.",
      "created_utc": 1722863721.0,
      "score": 1
    },
    {
      "id": "lglrfx0",
      "body": "I totally get how you feel, for most of my life I believed 100% that no one would ever love me because of various aspects of my body that I hated.\n\nI always believed that loving myself as I am was impossible. I once went through a program that coached radical self acceptance, but no matter how hard I tried, a little voice in the back of my head said no way, you are undesirable and will die alone. \n\nOne day, I described myself to my therapist and she was appalled at how I talked to myself. I described myself as disgusting, I told her how I hated my very wide, very flat feet and how it was so disgusting that my thighs have touched my entire life, among other things. In essence, i told her I was unloveable and would never find a partner. She asked me, is how I was taking to myself fair? Was it helpful? She indicated that in essence, I was being abusive to myself. Then, she asked me: would I ever say any of these things to my mother? A friend? A sister? Further, what would I genuinely say if I heard a friend describing herself the way I was describing myself?\n\nWell. It made me think. Nothing I was saying to myself was helpful or fair. The things I found so unattractive and revolting about myself were things I absolutely could not change, short of hitting the lottery and going under extensive, painful and likely mutilating surgical procedures. \n\nDo I love myself completely? Honestly, no. But when I find my mind drifting towards thoughts like, oh, you are undesirable and gross, I ask myself: is this helpful? Is it something that can be changed? The answer is always no. I ask, would I ever say such mean things to another human being? Again, absolutely not. Finally, how would I respond if I heard a friend saying these things to herself? Well, I would be horrified and I would 100% tell her that she was selling herself short.\n\nAfter consistently challenging my thoughts like this, I've found peace with myself. For me, it started as simply not hating myself and has morphed into accepting myself. \n\nSo I don't know if it's helpful, but maybe ask yourself these things:\n\n1. Is what you are saying to yourself about being so undesirable and undeserving helpful? Is it fair to you, when what bugs you is something that just is, and cannot be changed?\n\n2. Would you ever say something like that to someone you care about? Would you go up to your friend and say ew, you have small boobs and no one will ever want you? I doubt it. \n\n3. What would you say to someone you care about saying such things to themself? \n\nYou absolutely deserve love. There are millions of people in the world. Everyone has different preferences and desires. Absolutely you can and will be attractive to some people. And anyone worth keeping and loving will not be so shallow as to simply choose a partner based on a single aspect of anatomy. \n\nConfidence and self-acceptance? If you can nature these in yourself, they are qualities that are endlessly attractive to many many people. \n\nBe kind to yourself, you are perfect as you are :)",
      "created_utc": 1722864313.0,
      "score": 1
    },
    {
      "id": "lglrnjn",
      "body": "I’ve been with my wife for almost 10 years. That’s her cup size. I think her boobs are fantastic! You wouldn’t want someone interested in you because of your boob size, as that’s shallow. The right person will be interested in you regardless of how “big” your boobs are. Maybe consider counseling to help work through these thoughts?",
      "created_utc": 1722864393.0,
      "score": 1
    },
    {
      "id": "lglu01r",
      "body": "Its all about the confidence. Appreciate yourself in the mirror. I also have small boobs, basically nonexistent and I used to feel this way too. But now I just love that about me. I love the way the small chest pulls together the rest of my look.",
      "created_utc": 1722865274.0,
      "score": 1
    },
    {
      "id": "lglumle",
      "body": "I get your sentiment, but im other side of the spectrum, I've been at DD almost E since I was a tween and I feel like you get objectified by people alot more with a larger chest, but I've  had friends who are in your situation and people always tell them they look like kids or are box shaped, I just think that it's all about how you present yourself and if your confident the people who look down on you will be quieter. And there's many more examples of people saying that others \"aren't real women\" and I think it's stupid, I'm so sorry for the essay, I just hope you know both sides of the coin kinda suck. Have a nice day or night!",
      "created_utc": 1722865502.0,
      "score": 1
    },
    {
      "id": "lglwvn3",
      "body": "[removed]",
      "created_utc": 1722866299.0,
      "score": 1
    },
    {
      "id": "lglx4rx",
      "body": "Prefer bs or smaller and there are plenty of us out there",
      "created_utc": 1722866388.0,
      "score": 1
    },
    {
      "id": "lglycmk",
      "body": "I had pretty little boobs for a while and wanted more. I gained a lot of weight and now I wish I could go back. They are falling without a painful bra, the boob sweat in summer is horrible. I find them less attractive naked and miss my old boobs. Sometimes you just want what you don't have",
      "created_utc": 1722866818.0,
      "score": 1
    },
    {
      "id": "lglzm4x",
      "body": "I'd say love is unconditional and once someone connects with you emotionally, he'll just love you for being you regardless of all the things you consider as a flaw.... \nBut until then, you have to have confidence in you. In the end, the only thing which is holding you back in life or pulling you down is your own mindset, wear something that suits on you the most.",
      "created_utc": 1722867261.0,
      "score": 1
    },
    {
      "id": "lgm0d58",
      "body": "I'll be the judge of that",
      "created_utc": 1722867520.0,
      "score": 1
    },
    {
      "id": "lgm0nkd",
      "body": "'I feel less like a woman and genuinely believe that no one will ever love me because of how I look'. So you believe that all the women in the world who are 34B or smaller will never find love even though all evidence points to the contrary? Also 34B is the average size for women. You need to work on your self esteem, this has nothing to do with your boobs. Also, men care vastly less about the size of your boobs than you do. It's your mindset that needs work.",
      "created_utc": 1722867619.0,
      "score": 1
    },
    {
      "id": "lgm0z5v",
      "body": "Big boobs are feminine and sexy. Small boobs are…also feminine and sexy. Smaller breasts look high fashion, classic, and beautiful. Lots of dancers and models have smaller boobs. Enjoy your perky titties! As a hetero-flexible girl I can say I appreciate boobs of all sizes and I’m sure most men agree",
      "created_utc": 1722867728.0,
      "score": 1
    },
    {
      "id": "lgm14kj",
      "body": "I felt the same! I had also a B cup. They werent in a good shape. But since I take the pill & antidepressiva They grew to a G cup & I'm very chubby now. I wish I could be back to being mid size or skinny & cup B... hard truth? Guys would choose a skinny girl with smoll titties over big girls... please be proud of yourself & your body. I bet you look stunning. Please go love yourself first before you do a surgery or something. Because after that you will find something else you dont like abt yourself. Don't let guys use you bcs you dont feel good in your skin. You deserve love & knowing your worth. Someday someone is gonna love you & your body!",
      "created_utc": 1722867779.0,
      "score": 1
    },
    {
      "id": "lgm48wy",
      "body": "I have the same problem as you. Everybody in my family has small boobs yet my aunt is married so is my mother and my other aunt so don't worry. If someone loves you it won't change if you have big or small boobs. I hope in the future you will feel less insecure",
      "created_utc": 1722868842.0,
      "score": 1
    },
    {
      "id": "lgm4p12",
      "body": "Big boobs small boobs all boobs are awesome!",
      "created_utc": 1722868993.0,
      "score": 1
    },
    {
      "id": "lgm4xnq",
      "body": "This makes me so sad. \n\"Can't go out without an extremely padded bra\" \n\"Boost my appearance\"\n\nGirl, I know there are certain things in the world that teach bigger boobs = better, but they're all complete bullshit. \n\nTake if from a formerly very horns teenager and now a reasonably horns adult married man.\n\nSmall boobs are great, they look good, won't cause you back ache and unlock a whole other fashion for you that just isn't available to bigger boobed women.\n\nMany of them look at you and wish they had smaller boobs.",
      "created_utc": 1722869072.0,
      "score": 1
    },
    {
      "id": "lgm8lv4",
      "body": "I think I speak on behalf of all men when I say there’s  no such thing as a bad pair of boobs.",
      "created_utc": 1722870284.0,
      "score": 1
    },
    {
      "id": "lgm8me3",
      "body": "I have seen very attractive women with smaller than a B cup and no push up or padded bras. They walk with confidence. Large breast do not make women attractive, just like big arms or thighs don’t make a guy good looking.  It’s always a package deal.",
      "created_utc": 1722870288.0,
      "score": 1
    },
    {
      "id": "lgm8olh",
      "body": "I’m in the same boat. However, I’ve recently been doing better with them. Instead of thinking of them as something a man would want me to have, I think about them in a survival sense. They’re human boobs. My small boobs allow me to run as fast as I can without pain. My small boobs don’t give me back issues. They allow me to sleep on my stomach. They will be just perfect for when I need to give my future babies food. They do what they’re meant to do. I am grateful that I don’t ~need~ a bra. I can wear a super comfortable bralette or nothing at all and I’m good. It’s easy to find tops that fit. I also considered surgery to have them bigger. But then, you can tell. And you won’t want to be known as the girl with the boob job. Love them for what they are and if a guy makes you feel bad about them, leave him immediately. You got this!!!!❤️",
      "created_utc": 1722870310.0,
      "score": 1
    },
    {
      "id": "lgmapoo",
      "body": "I’ve spent majority of my life as a 34B or 36B, only recently near my 30s did I finally gain weight and now have DDs…. Now I wish I was a B cup again. The attention isn’t any different, the same people that love the DDs also loved the B cups. Only difference is now I have more back pain and less bra options. \nAlso I’m bi, and boobs are boobs! Someone having such a deep preference they’d turn down someone just because they have a B cup is honestly insane.",
      "created_utc": 1722870978.0,
      "score": 1
    },
    {
      "id": "lgmcz4t",
      "body": "my ex hated her boobs as much as you do/did. and said most of the things you mentioned in this post too. but i was always happy with them. real men will go boobs are boobs all the time and I have never ever seen one guy for not liking a girl because of her boobs. and lastly, you are probably attracting multiple men everyday but are not aware of that.",
      "created_utc": 1722871710.0,
      "score": 1
    },
    {
      "id": "lgmd8gi",
      "body": "I just want to say that 95% of drop-dead gorgeous women are insecure about their appearance. They don't even know they are top 10% of the population",
      "created_utc": 1722871793.0,
      "score": 1
    },
    {
      "id": "lgmdgrj",
      "body": "If I am being honest, as a man, i love all types of boobs literally, saggy pointy, big small, it really doesn’t matter as long as you have boobs, probably its all in your mind but I respect that you want to look how you want to look for yourself, but it really doesn’t matter for most of men",
      "created_utc": 1722871867.0,
      "score": 1
    },
    {
      "id": "lgmdrwh",
      "body": "men love boobs. big ones, little ones, perky ones, droopy ones. sometimes people have preferences, but i’ve learned that most men just straight up like all boobs. the fact of the matter is somebody will love you and your insecurities. i used to hate mine, i’ve always had kinda bigger boobs but didn’t know how to take care of myself growing up so they’re really ugly IMO. i still hate them, but my bf loves them so much. i wish i had smaller ones tho ngl, there are so many cute tops that i will legitimately never pull off because of mines size.",
      "created_utc": 1722871967.0,
      "score": 1
    },
    {
      "id": "lgmevf2",
      "body": "Hello friend I can absolutely relate. I always had small boobs until I had a baby. They grew then immediately sagged, and now shrank. So now I have small flappy boobs and I feel so inadequate. I really miss my small perky breasts and see how attractive they were now. But of course I wish I appreciated them then and wish I could appreciate them now! \n\nSomething that motherhood has gifted me, other than my amazing child, is valuing myself beyond my appearance. You are SO much more than your looks. This pain is stemming from low self worth. You are over emphasizing your looks to signify your worth as a partner and human being. Let me tell you that you are even over emphasizing your looks yin regards to sexual appeal. There are so many attractive qualities about you beyond your breasts. Nobody has everything.\n\nI would consider therapy though because it sounds like an unhealthy fixation and you can overcome this.",
      "created_utc": 1722872327.0,
      "score": 1
    },
    {
      "id": "lgmfi2s",
      "body": "I'm not laughin at you, but for you. TRUST ME Plenty of men think smaller breasts are cute. Especially if your lighter either way it's the total package. Yes we may like different parts more than others. I'm a butt guy, but if the man finds you attractive. You not being huge busted won't run him off. Even if that's his favorite part as Long as he finds you attractive. Your self esteem seems low my advice work on making yourself look generally more attractive. And if a man's not interested Do not aggressively pursue him. If he senses your desperation he may try to use you. Don't lower yourself for any man. Small breasts can be Very cute in some cases.",
      "created_utc": 1722872529.0,
      "score": 1
    },
    {
      "id": "lgmghj1",
      "body": "Boob's are way down the list for most mature men. A nice smile will always be more impactful than anything about your body. Boob's are for babies and teenagers. Men consider body image as secondary. Energy, enthusiasm, compassion, and loyalty are the things that attract good men. Also, bere in mind what you wear. Something that is designed to show more Boob's may not be  as comfortable as something lass revealing. Just my thoughts as an older guy.",
      "created_utc": 1722872845.0,
      "score": 1
    },
    {
      "id": "lgmi3gy",
      "body": "This sounds like a sexist troll post (complaining about a fast metabolism? Not taken seriously by men) but I’ll bite. I have a literal deformity- tuberous breasts, which I tried to have corrected with breast augmentation and the surgery was botched (huge dents in my skin because of scar tissue and weirdly shaped areolas after they cut me apart) but my fiancé still wants to see my slow metabolismed body topless for some reason. Weight gain and weight loss doesn’t always affect breast size btw.",
      "created_utc": 1722873360.0,
      "score": 1
    },
    {
      "id": "lgmjx7x",
      "body": "im head over heels in love with my girlfriend and she’s a 32B, and for the record i feel the same way about her boobs. doesn’t really matter regardless though i love her for being her, and someone will do the same for you. and for the record, size doesn’t matter, many people feel that shape is more important/attractive",
      "created_utc": 1722873947.0,
      "score": 1
    },
    {
      "id": "lgmm185",
      "body": "I pushed off the surgery for years and regret that because it's the best thing that helped my mental health. I love them now.",
      "created_utc": 1722874629.0,
      "score": 1
    },
    {
      "id": "lgmos7u",
      "body": "Not all guys care or are attracted to large breasts honestly. If your attractiveness to men is your concern then try not to let it! I personally am more attracted to women with smaller chests vs the other extreme",
      "created_utc": 1722875511.0,
      "score": 1
    },
    {
      "id": "lgmpewl",
      "body": "What dose B stand for ?",
      "created_utc": 1722875715.0,
      "score": 1
    },
    {
      "id": "lgmpqhm",
      "body": "you will get married and have kids and the problem will solve itself, the right guy will choose you and marry you , focus on your personality men marry women with good personalities,",
      "created_utc": 1722875823.0,
      "score": 1
    },
    {
      "id": "lgmpvb2",
      "body": "I read that believing that you have some kind of gigantic boobs, and I was imagining how much pain that would be. Then I re-read the size. Small boobs are a blessing, the flatter the better.",
      "created_utc": 1722875867.0,
      "score": 1
    },
    {
      "id": "lgmqarh",
      "body": "I’m confused. Your upset they are small? Most men like Butts",
      "created_utc": 1722876005.0,
      "score": 1
    },
    {
      "id": "lgmqd4r",
      "body": "Small boobs are great. Ugh I’m a petite woman with a small body, 114 pounds and my chest is DD. So I can never find a freaking bra that works for me. A perfect bra for me is 32DD. Which is not easy to find. Wish i had smaller boobs. Smaller boobs look better in clothes and you can enjoy braless days without jiggling your boobs and getting stares",
      "created_utc": 1722876026.0,
      "score": 1
    },
    {
      "id": "lgmtg0c",
      "body": "Previously 36A/34AA here (5’7, 125lbs/135lbs back then), with menopause weight 65lbs heavier and I’m still only 40B. I can honestly say I’d rather have my 36As back. I know a number of men who genuinely prefer small perky ones, and I can assure you the saggy sweaty extra with weight gain is not comfortable. \nI also thought for the longest time I should get surgery. \nIt’s only as Ive gotten older/wiser that I realize now how much of that mindset is driven by societal expectations of women and a vocal subset of men. \nMy late husband was definitely one of those even tho he tried to hide it. He often said he would support me getting surgery, looking back I’m glad I never did. \n\nI’ve dropped 40lbs this summer, I’m a 38A with a little extra now, not quite a B and I never want to have big breasts - im comfortable with mine, they’re not as perky (breastfeeding does that), but a supportive push up works wonders for my self confidence. \nThere’s men for every size.",
      "created_utc": 1722877002.0,
      "score": 1
    },
    {
      "id": "lgmuieu",
      "body": "I wish my boobs were bigger too 😭",
      "created_utc": 1722877324.0,
      "score": 1
    },
    {
      "id": "lgmuiui",
      "body": "I wish my boobs were bigger too 😭",
      "created_utc": 1722877324.0,
      "score": 1
    },
    {
      "id": "lgmvuc9",
      "body": "You wanna trade? I honestly hate having bigger boobs. Clothes don’t fit right and look horrible, you can’t wear anything without a bra. They make me look fatter. Trust me, big boobs are not better. Especially once you have kids- completely ruined !",
      "created_utc": 1722877716.0,
      "score": 1
    },
    {
      "id": "lgmvywh",
      "body": "I dated a woman once and it came up that she had her breast done. She showed pictures of the before the operation (chest was entirely flat) and how much she loved her new breasts. Thinking back on her I don’t remember her breasts. I remember her. Her breasts is not something that I care about, and I kind of think I would like her more if she hadn’t done the operation.",
      "created_utc": 1722877756.0,
      "score": 1
    },
    {
      "id": "lgmw0v4",
      "body": "I love little perky boobs. I’m sure that many men feel the same, however here is the most important thing. The woman that I am madly in love with to me is the most beautiful woman in the whole world, and I know most men wouldn’t feel the same. I think she’s absolutely gorgeous though because of what she means to me. Take that for what it’s worth.",
      "created_utc": 1722877775.0,
      "score": 1
    },
    {
      "id": "lgmzge4",
      "body": "I think you will be surprised the qualities men will appreciate about you.  That can be healthy or toxic, but smaller breasts are more than enough when dating.  You will find men are interested, so try not to dread it.  Exercise will be good for you all around as others have mentioned, but you can also try listing parts of your body that you like or that you find \"acceptable,\" at least.  \n\nI focus on parts of my body that I like to take my mind off of the parts I want to change.  My hands are beautiful, so I have learned to focus on those when I feel bad about other part(s).  Eventually the \"lens\" we view ourselves through in the mirror can shift, but I understand feeling unworthy and unable to \"compete\" with other bodies.  You will break through!  Thank you for reaching out!",
      "created_utc": 1722878877.0,
      "score": 1
    },
    {
      "id": "lgmzt1f",
      "body": "Girl sorry but, this is not even \"small\" it is quite near average actually, men love that, trust me-a cup girl",
      "created_utc": 1722878988.0,
      "score": 1
    },
    {
      "id": "lgn28xi",
      "body": "I have huge boobs and I'd give anything to be an A or B cup. They're heavy and saggy and sweaty, worse with age. Can't wear lots of cute clothes, can't leave the house without a bra, and I have scoliosis because of them. It's really not all that good. \nI'm envious of you! And for sure there's plenty of men who will appreciate you for you. \nWear a halter top for me and enjoy the freedom :) the grass is always greener...",
      "created_utc": 1722879763.0,
      "score": 1
    },
    {
      "id": "lgn3ia0",
      "body": "Who started this insecurity for you? Family/friends/bullies?\n\nJust curious..",
      "created_utc": 1722880165.0,
      "score": 1
    },
    {
      "id": "lgn5q08",
      "body": "https://preview.redd.it/1985eylrwvgd1.jpeg?width=1242&format=pjpg&auto=webp&s=6100bbda67fa6842c3cfff2f8b71a188a61e392f\n\ni am a 34b and i have recently learned to adore my boobies. (did take a lot of work) you never have to wear a bra and in certain shirts personally that makes me feel super sexy. exhibit A. there is enough there to bounce & i think they’re a perfect handful size. like another person said, they stay perky! anyone, everyone has their own taste. there will be someone for everyone, surely there are many people who like boobs just like yours. and… boobs is boobs",
      "created_utc": 1722880860.0,
      "score": 1
    },
    {
      "id": "lgn5v60",
      "body": "I've seen all shapes and size and believe me I've never cared about how big women boobs are, we play with nipples more if anything. \nIt's all about personality these days and for a lot of men who's had bad experiences with women breast size is the last thing on our mind.",
      "created_utc": 1722880905.0,
      "score": 1
    },
    {
      "id": "lgn692v",
      "body": "As someone who works with older people when you get old they will still love decent. The really big ones are just bothersome.",
      "created_utc": 1722881028.0,
      "score": 1
    },
    {
      "id": "lgn8coj",
      "body": "I'm a 32A lol and I really wish I was different \n\nBut sometimes I see myself and it's like DAMN. \n\nSelf confidence isn't a linear thing, unfortunately \n\nI was lucky enough to find a boyfriend who loves what I have and that's helped a lot \n\nThere are good partners out there, you'll find someone who appreciates you for all that you are as a person \n\nIn the meantime, taking care of your body and loving yourself is the thing to work on because a good relationship with yourself can make a world of difference, you deserve to be happy!",
      "created_utc": 1722881697.0,
      "score": 1
    },
    {
      "id": "lgn8mrz",
      "body": "Bigger boobs turn gravity into enemy numero uno. \nThen there's the stretchmarks, boob-pain, back-pain, posture issues, heat rash, painful bras, needless comments, clothing not sitting right etc",
      "created_utc": 1722881785.0,
      "score": 1
    },
    {
      "id": "lgn9ka1",
      "body": "So just fing a man that has ass not boob fetish🤷",
      "created_utc": 1722882080.0,
      "score": 1
    },
    {
      "id": "lgncy14",
      "body": "Homey you just need to be happy. An find a guy who likes small boobs",
      "created_utc": 1722883153.0,
      "score": 1
    },
    {
      "id": "lgnddzb",
      "body": "Please remind yourself that the primary function of breasts is feeding babies. They aren't part of anatomy to attract a partner. A good partner will love your body the way it is. And, bodies change. Weight fluctuations will have long term effects on your breasts (weight gain followed by weight loss, etc. will stretch out your skin and lead to eventual sagging). \n\nI understand the self consciousness around breasts. I never wanted big breasts and was deathly afraid of getting them, which was one of the many reasons why I developed an eating disorder as a teen.\n\nSo, please remember that your breasts are perfect the way they are, and if you want to get augmentation, do it for you and no one else.",
      "created_utc": 1722883293.0,
      "score": 1
    },
    {
      "id": "lgndygk",
      "body": "I’ve always been the type of guy that says anymore than a handful is a waste. Don’t focus on looks so much, but I know that body dismorphia can be a bitch as well. You are probably absolutely prefect for body looks, as I’ve seen other redditors post, the right guy will find you attractive and love you no matter what you look like. Please try to be more kind to yourself and when your brain is being mean, try to remind yourself that you are amazing just how you are",
      "created_utc": 1722883474.0,
      "score": 1
    },
    {
      "id": "lgnffnd",
      "body": "Maybe it's what people around you are like, when I studied English everyone was just so superficial, they only ever cared about looks and I thought the world was like that, then I started studying music and everything changed, the exact opposite, nobody cared less about looks and only cared on how good you were on your instrument, maybe men around you might not like smaller boobs but you see men here love all types of boobs (small boob lover here) so that perception may change in another time of your life with somewhere  men who like smaller breast",
      "created_utc": 1722883944.0,
      "score": 1
    },
    {
      "id": "lgnhla2",
      "body": "As a former 34B who is now 38D, I would go back in a heartbeat. \n\nI thought I wanted tig-ole-bitties. But then I got them and realized I hate the feeling and appearance, but it’s too late to go back. The skin has stretched too much and even with surgery it’ll never be the same again. \n\nIf you can learn from my mistake, it’s to be careful what you wish for.",
      "created_utc": 1722884629.0,
      "score": 1
    },
    {
      "id": "lgnmtz4",
      "body": "gaze light plant truck absurd enter cake jellyfish noxious price\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1722886314.0,
      "score": 1
    },
    {
      "id": "lgnnfu8",
      "body": "Well I had lovely large boobs had a baby breastfed and they’re ugly now .. I always wished I had small boobs ! That would’ve never happened had they been small lol",
      "created_utc": 1722886509.0,
      "score": 1
    },
    {
      "id": "lgnnsmu",
      "body": "I have 34B as well (I’m super underweight it doesn’t help) and tbh small boobs are the hottest things to ever exist (my gf is a 28A and I want to eat them)",
      "created_utc": 1722886621.0,
      "score": 1
    },
    {
      "id": "lgnnyb9",
      "body": "Just want to say that I have fluctuated in between a DDDD, F, and G my entire adult life and I hate hate hate my boobs, I always have. They depress me so much and I wish they didn’t but there are just too many cons. I’d give anything to be your size. You can wear such a wide range of clothes with a smaller chest! As another commenter was saying, I feel my boobs make me look bulkier than I am depending on what I wear. I’d love to wear things bra-less or wear more revealing tops without it being “too much”. I also have to wear a bra like aaallllll the time and I have chronic migraines because of these bad boys. Try to love and embrace what you have because there are pros and cons to each and every size! And I will continue to try to take my own advice on that too :) I also encourage you to join the body positivity subs! They’ve helped me a lot.",
      "created_utc": 1722886670.0,
      "score": 1
    },
    {
      "id": "lgno6ll",
      "body": "If you are just judging yourself superficially, I can tell you a lot of us guys are leg guys, meaning we get excited by legs even more than boobs.",
      "created_utc": 1722886744.0,
      "score": 1
    },
    {
      "id": "lgnprj5",
      "body": "I had the opposite problem. I was a G cup and had horrible back problems. I heard horror stories about breast reductions and regrets and sadness from those that lost their breasts due to cancer or got enhancements. I was at a loss for what to do. \n\nEventually I threw my back out one too many times and said enough is enough. I got the reduction. I had a very good plastic surgeon that performed a damn masterclass in anchor incisions and he reconstructed my nipples to be appropriate size for my new boobs while preserving my milk ducts. Best possible situation from procedure to aftercare… but I still had scarring. One boob scarred more than the other and although the scarring is only noticeable if you lift the breast, I was still VERY self conscious about it for years. That, coupled with the fact that I am plus sized and my lack of boobs now made my belly look bigger, absolutely killed my self esteem. All this in spite of the fact that my back and neck no longer hurt and I was able to run for the first time since high school gym class, mind you. I could’ve sworn there was just no pleasing me and I was doomed to be unattractive forever. \n\nI gradually started to get over it. I hooked up with a few guys that were so happy to be getting laid that I could’ve had 4 nipples and it wouldn’t have phased them. Then I met my husband. The attractiveness of my boobs isn’t even on his radar. They’re MY boobs, and that’s why he likes them. And my god does he ever like them 🙄\n\nI can understand self esteem issues. I think the most frustrating thing about self esteem issues is that they hold you back due to reasons that only exist from your own perspective. Because when it comes to men finding you attractive, there is so much more to like about you than just your boobs (which I’m sure are actually fine). Each individual person brings something new to the table in both casual and long lasting relationships and there are many things about an individual that others can be attracted to (physical features, personality, sense of humor, etc). \n\nWhile I’m not trying to reduce attractiveness down to only physical attributes, the moral of the story is this- Don’t be so consumed with shame over your (perfectly fine) B cups that you don’t even notice the hot guy across the room that’s been staring at your ass all night.",
      "created_utc": 1722887248.0,
      "score": 1
    },
    {
      "id": "lgnq2w6",
      "body": "Try incorporating bee pollen in your diet, in oat meal or yoghurt, also eat more eggs. If nothing happens in 3 months, I will venmo you 300$ for giving false hope",
      "created_utc": 1722887348.0,
      "score": 1
    },
    {
      "id": "lgns518",
      "body": "I hope you're okay, but please don't be down on yourself. Boob size will have no bearing when the right guy comes along. \n\nI sent you a dm if you ever wanna chat, so feel free anytime\n\nOther than that, try to be positive about yourself, as I'm sure you're a great person",
      "created_utc": 1722887998.0,
      "score": 1
    },
    {
      "id": "lgnumwu",
      "body": "So.. it would seem you're quite young. But can i tell you something?. My partner has the same size bust. I dont see her as less of a woman. In fact, i personally prefer it myself.\n\nThe only thing that is making you feel like less of a woman is yourself. Whatever it is your consuming online is very obviously not good for your mental health. \n\nI'll tell you right now it's not about the \"right man\". I have found in typical conversation with my male friends that most guys genuinely do not care. Guys want someone who will love them for who they are, and girls want the same thing. \n\nWhatever perceived flaws you may think you see. Dont view yourself in such poor light. Seek therapy for this and do some reading. \n\nI hope everything gets better dont be so down on yourself.",
      "created_utc": 1722888794.0,
      "score": 1
    },
    {
      "id": "lgnv25x",
      "body": "eat bee pollen!!! it works!! both my sister and I are B cups i believe, and it took a couple weeks to work, but i swear we were finally solid C cups! \n\nthe reason bee pollen works, is because there is an inhibitor in your body that controls how much of a hormone is released, aka estrogen, and sometimes it doesn’t let out as much as it could let out, and bee pollen helps that.  totally natural, totally healthy, and 100% works.  \n\nas for how to ingest this, bee pollen tastes gross.  i won’t lie to you.  it’s nasty.  you’ll need to shake a bit into some yogurt or something and just eat it with that.  you will need to ingest this atleast once daily.  not an incredible amount or anything, maybe just a full, thin top layer of bee pollen on top of a cup of yogurt.  you won’t see results immediately.  it does take a week or two.  and since i’ve stopped eating it, my chest isn’t as big as it was when i was eating it, also another thing to take note of. \n\nbut seriously, eat bee pollen.  it’s good for you.",
      "created_utc": 1722888927.0,
      "score": 1
    },
    {
      "id": "lgnv4bc",
      "body": "My boobs are small.  And I'm tall.  All my sisters are like that.\n\nIt sucks when you are young, but eventually you learn that it just isn't that important.  If it's important to someone else, that's a sign that is a superficial person you don't need in your life.\n\nMy partner had breast cancer and had a double mastectomy.   It doesn't affect how much I love her or how attracted I am to her.\n\nYou just need to be looking for people that care what you are like inside, not outside.",
      "created_utc": 1722888946.0,
      "score": 1
    },
    {
      "id": "lgnvv7v",
      "body": "Alright, you might not like that trait, but surely there is something you do love about yourself. \n\nAnd if you focus on the positive stuff, others can appreciate that side of you as well",
      "created_utc": 1722889180.0,
      "score": 1
    },
    {
      "id": "lgnxsvx",
      "body": "[removed]",
      "created_utc": 1722889787.0,
      "score": 1
    },
    {
      "id": "lgnymja",
      "body": "Listen, I hate mine too. They’re significantly different sizes. Like, 3 cup sizes different. One doesn’t even hang over while the other one does by a lot. I’ve legitimately never seen any other woman with boobs such different sizes. I honestly would get a boob job tomorrow if I magically had the money to do it.\n\nBUTTT.. that doesn’t make us less of a woman. Someone will love your boobs regardless lol. I’ve never had any complaints. Most guys have picked a favorite boob, tbh, but never had a complaints or issues with the way they are lol.",
      "created_utc": 1722890047.0,
      "score": 1
    },
    {
      "id": "lgnzjm0",
      "body": "I'm a man.  Straight.  Love women.  Face is more important than boobs.",
      "created_utc": 1722890338.0,
      "score": 1
    },
    {
      "id": "lgo34pm",
      "body": "Coming from someone with larger boobs, it’s not always that great. I wish I didn’t have boobs and had basically none. I don’t feel beautiful sometimes because men treat me more like an object than a person. Plus I could get away with no bra (what I prefer and is most comfy) without it being as noticeable.\n\nIf you base your life on being good enough for men, you will be up and down. Up when someone likes you, down when they dont. If they love you based solely on your tits, that’s as far as the love goes— your tits….they would miss out on the actual person beneath surface or they wouldn’t care at all about you.\n\nWhat’s the point in getting surgery for attention that’s superficial? I agree you should accept yourself as who you are. You’ll live a more balanced life. I think you’re hot just because of your breast size 🤷🏻‍♀️The more confident you are in yourself, the more love and good men you would attract.",
      "created_utc": 1722891472.0,
      "score": 1
    },
    {
      "id": "lgo36f4",
      "body": "That’s just simply not true. One only has to review actresses that have less chest than you are describing to make a point. Demi Moore, Reese Witherspoon, Sandra Bullock, Goldie Hawn to name a few and there’s many more.  They are also women of substance, personality and ability. Women with a large chest and rear typically have to weigh more. Unless they go the expensive route. What kind of man are you looking for?  Do you want a man that is so busy rubber necking the women in the bar he can’t hold a conversation?  Read about actress Sharon Stone’s life. What you’re worrying about is shallow and fleeting. You can do whatever you are looking for with clothes, makeup and a little attitude. Go check out an old tv series called Monk. He had two assistants over eight seasons that were the beloved, sexy, love interests that worked with Monk. Both were short, cute, and barely had any chest. What they did have was plenty of personality and substance.  It’s on Netflix if you want to watch what I’m referencing and that’s really what gives a relationship longevity.  Do you want a relationship or do you want to score the most one night stands trophy?  Look at developing yourself with personal interests, joining groups of people with similar interests, or maybe supporting a nonprofit with your time. Get involved with a living a great life.  That what brings you confidence, substance and a feeling of self worth. Hanging around a bunch of guys rating T’s & A’s is witnessing the worst low life behavior ever. Go celebrate your awesomeness and look for a man with substance! 🥰🙏🏻",
      "created_utc": 1722891487.0,
      "score": 1
    },
    {
      "id": "lgo56tt",
      "body": "if it helps, there are smaller women who are desired.",
      "created_utc": 1722892130.0,
      "score": 1
    },
    {
      "id": "lgo5gdt",
      "body": "I love small boobs. They’re just right for sucking on.",
      "created_utc": 1722892214.0,
      "score": 1
    },
    {
      "id": "lgo6iom",
      "body": "Do you feel like your boobs are ugly because they're not perky? Natural tits are a thing and quite popular (heavy-low hanging boobs). I have the same (36B) and all my partners were absolutely mesmerized with them. If you read the comments under any porn with natural boobs, you'll see how people love them.",
      "created_utc": 1722892556.0,
      "score": 1
    },
    {
      "id": "lgo7qet",
      "body": "Don't forget about breast implant related illnesses if you're seriously considering it.",
      "created_utc": 1722892950.0,
      "score": 1
    },
    {
      "id": "lgo875r",
      "body": "I mean if it's any consolidation boob's on a more fit woman are naturally smaller, and rapidly trying to gain weight and take supplements or surgery in any case is not the right option, due to health implications it can cause. It doesn't make you any less of a woman, nor change what a guy who should be with you will like about you. I know it's hard to love yourself as you are but definitely talk to people about this (therapists or psychologists) because it's an insecurity, and insecurities don't make the person",
      "created_utc": 1722893100.0,
      "score": 1
    },
    {
      "id": "lgo9t91",
      "body": "You’re perfect the way you are.  I can safely say you will be taken seriously by men; I didn’t scroll through replies but I saw at least two that agreed with me.\n\nI wouldn’t jump to a cosmetic procedure as your answer.  I recently found out those have a life expectancy of 10 years before they have to get re-done. That’s a lot of effort and a lot of $ just to think it would make people like you more.\n\nAnyone that would only like you for bigger boobs is not worth knowing and certainly not worth your time or consideration.  There’s far more to you than your chest.  I hope that resonates in you and you start to appreciate yourself more.",
      "created_utc": 1722893628.0,
      "score": 1
    },
    {
      "id": "lgoafw5",
      "body": "There are a lot of guys who love b boobs.  And you will likely learn to love them as you get older when you realize that people with bigger boobs often get really nasty back pain over it, and nothing seems to ever fit them right.",
      "created_utc": 1722893837.0,
      "score": 1
    },
    {
      "id": "lgoaw4y",
      "body": "Look into therapy for body dysmorphic disorder and it's relation to ocd as well\n\nI hope you feel better :(",
      "created_utc": 1722893986.0,
      "score": 1
    },
    {
      "id": "lgob78w",
      "body": "Hey don’t feel bad about that. As a man I can honestly say there’s more to a woman than her boob size. Please don’t think less of yourself about that. 🙏\n\nToo much tit can actually be a hassle. Back problems, extra sweat, etc. You’re blessed with what you have, just think of it like that.",
      "created_utc": 1722894086.0,
      "score": 1
    },
    {
      "id": "lgodlzg",
      "body": "I personally prefer bigger boobs but prioritize connection and personality. If I find a girl I can talk with, connect with, and enjoy being around her, automatically, she becomes physically attractive. Any decent guy feels the same way. It's back to that old saying, \"Beauty is in the eye of the beholder.\"",
      "created_utc": 1722894896.0,
      "score": 1
    },
    {
      "id": "lgoev16",
      "body": "When I was younger i was a 32 DD and I hated that men only wanted me for my boobs I am now a 34B and whilst I do miss having bigger boobs my partner still loves them  to quote Boobs are Boobs as long as theres something to grab. I also wear Half cup push ups not fully padded but enough to give a little lift.",
      "created_utc": 1722895329.0,
      "score": 1
    },
    {
      "id": "lgogn82",
      "body": "I am a gay guy so can't speak for boobs but honestly I don't really care how someone looks. Okay for me if someone is very overweight (or very underweight) and not between the age of say 22-42 I am unlikely to be interested but what matters is that someone is nice to be around, kind and fun that sort of thing isn't it? For sure if someone is very attractive it's nice in one way isn't it but it doesn't really matter. I don't think any man worth your time would judge your for your boobs not being a certain way it sounds as though you look after yourself fairly well so just stick with the bras that make you feel good and clothing that makes you feel good and hopefully that confidence will eventually translate to your body. I know how you feel though I am very insecure about my body too ..too common isn't it!",
      "created_utc": 1722895949.0,
      "score": 1
    },
    {
      "id": "lgohbb2",
      "body": "Wrong. The only way to change this is through working on your mental health. How old are you? \n\nIf you ever want to get pregnant you’ll know what big tits feel like, and oh how you’ll be logging for your b-cups, I promise. The back pain isn’t worth it and clothes just don’t always sit right. We always want what we don’t have.\n\nps. guys literally do not care what size they are as long as it looks like a breast.",
      "created_utc": 1722896183.0,
      "score": 1
    },
    {
      "id": "lgok7dv",
      "body": "I have small boobs and I struggled with them for a long time. Until I watched Shakespeare in Love. I was like damn, if Gwyneth Paltrow is that confident in her small breasts to bare them on screen for the masses, I am totally cool with mine.\n\nThen I realized how much I appreciated how much easier it was to find a supportive sports bras cuz it don’t take a lot, have them not bounce all over during physical activity, them not being in the way when I sleep or need to reach into small spaces, minimal under boob sweat, the ability to go bra less on hot days (or any days), and many more things.\n\nI sometimes still envy more endowed ladies, but I wouldn’t trade mine.",
      "created_utc": 1722897199.0,
      "score": 1
    },
    {
      "id": "lgom6m4",
      "body": "Show yourself some grace, please. I (50m) am dating a lovely woman your size and I think she's gorgeous. She gets on herself for the same reason, but she is perfect for me. She now is showing more confidence in this space, because she sees that her insecurity in that one aspect is how she feels about it, but I think she's beautiful just the way she is.\n\nConfidence is sexy. The world we live in bombards is worth images and social media and we are constantly comparing things. Plus, we have a tendency of taking things we are least happy about ourselves, because we are in our own skin 24-7, and we assume others won't like it. This is folly. Those very things may be what someone thinks is gorgeous. I remind her, and my daughters of this all the time. \n\nEverything about you is a unique recipe. There are plenty of people out there who will love you as you are. This starts with self love.\nBe kind to yourself. Be well.",
      "created_utc": 1722897899.0,
      "score": 1
    },
    {
      "id": "lgomoil",
      "body": "Ma'am it's been said boobs are boobs. Just cuz ya got cupcakes don't mean they deserve any less love. I'll say it again boobs are boobs and boobs are great. Life hard, life cold, titty soft, titty warm.",
      "created_utc": 1722898073.0,
      "score": 1
    },
    {
      "id": "lgon19g",
      "body": "I feel like OP is probably fairly young. I have A cups and hated that fact about myself for a while in my youth. But I've never dated a guy who seemed to think anything at all about my small size, some that actively liked it, and I've come to not just accept my small size but love it. My friends with larger chests have back problems and need to wear extremely supportive clothing all the time. Meanwhile my boobs at near 40 are showing no signs of age (unfortunately not true of the rest of me!)\nI don't know how to help, OP, but it sounds like you haven't really dated much. Don't let your insecurity about any part of your body stop you from meeting someone. And really you don't want to date someone who is only focused on cup size as a key indicator for metrics in his dating life, anyway! I've found that most of the time in dating the biggest turn off is not a part of the body, but the way people can put themselves down and hold themselves in such a negative light. \nThink of it this way, when you meet a guy you like he's probably fairly attractive to you, but personality is much more important. Once you get to bed if he's a little less endowed than you would've thought you liked, it really doesn't matter because you're excited to just be having fun together!",
      "created_utc": 1722898197.0,
      "score": 1
    },
    {
      "id": "lgoovck",
      "body": "I always had a nice 36C and then I had my son and breast-fed. They went down quite a bit. So I got a boob job. Nothing wrong with that.",
      "created_utc": 1722898849.0,
      "score": 1
    },
    {
      "id": "lgoqowi",
      "body": "You don't want to be with a man who only judges women by their breast size. There are many beautiful women with smaller breasts. Your self-worth is not based on the options of others. \n\nI wasted my youth seeking the approval of people that I came to realize belittled me to boost their own   self image to feel superior. It took me a long time to learn self acceptance. There will always be someone who is doing better and judging myself against them is a sure away to feel inadequate. Learning to be my best self was key to self-acceptance.\n\nThe dating world has changed a great deal since I got married, you can't rely on men to make the first move anymore. You will need to put yourself out there and face the risk of rejection.",
      "created_utc": 1722899504.0,
      "score": 1
    },
    {
      "id": "lgoqpxj",
      "body": "I read the title and thought you were hating your boobs like I hate mine. I'm a G cup. Been big chested for a long time, and they are centered around trauma for me. The friends dad would always call me big tits, and then had his way with them as he molested me. Ever since that, I hate my breasts. Getting looked at as a sex object isn't what it's cracked up to be. I just wanna cut off my breasts and give them away. They can have them, just leave me alone.",
      "created_utc": 1722899514.0,
      "score": 1
    },
    {
      "id": "lgorsvj",
      "body": "Send me a pic ill judge em for you",
      "created_utc": 1722899904.0,
      "score": 1
    },
    {
      "id": "lgous9h",
      "body": "I feel like I've been in a similar boat. I'm a 32b and I used to be so jealous of all the girls at school. \n\nFast forward I am glad I got small boobs cause they never get in the way and won't look as saggy when I'm older. I've got such an amazing boyfriend. He doesn't care about the size. Tbf my ex's never said they didn't like that I didn't have boobs so it was Deffo all in my head...\n\nI still feel like I'm missing out from time to time, especially when I struggle finding my bra size in shops. But overall it's more than okay to have small boobs. It's tough to get your head round it but one day you'll wake up and be like \"I'm happy with these boobs\" and I hope that day comes to you soon. :)",
      "created_utc": 1722900987.0,
      "score": 1
    },
    {
      "id": "lgov2am",
      "body": "There's definitely nothing wrong with wanting to feel like you're more attractive in some way, because that does tend to make people feel more valuable and it's totally understandable. There's also nothing wrong with having a smaller bust, either. A lot of women are really self-conscious about bust size (myself included). If it makes you feel better there genuinely are guys who prefer smaller breasts, and smaller breasts stay perkier. They also cause less back pain.Regardless, you deserve somebody who appreciates you as you are.\n\nIf at some point you do seek surgery that's entirely ok, too. I know you mentioned gaining weight and taking supplements to increase your bust size, and you may have already tried this, but if you do pectoral exercises to build the muscle under your breasts, that can potentially make your bust more prominent. While it won't make breasts bigger it can certainly add some emphasis.\n\nBottom line: there's nothing wrong with you as you are!",
      "created_utc": 1722901089.0,
      "score": 1
    },
    {
      "id": "lgowa80",
      "body": "Take that fast metabolism, run with it, and know that for every five people complaining about their chest, there’s 15 more complaining about their metabolism. That and I echo the thoughts of most here when I say there will be less for you to worry about with the ol’ boobs as you get older, compared to the ladies who “got a lot.” Please do whatever you can to corral these bad thoughts because they are a complete and utter waste of your time. Trust me. Hugs to you.🫂",
      "created_utc": 1722901537.0,
      "score": 1
    },
    {
      "id": "lgowhpt",
      "body": "Id rather date someone with smaller breasts if i get the chance \nI wanna date someone that makes me smile , respects me i aint gunna lie when i was like 17 there were certain features i looked for looking back that is a regret of mine know doubt i let the right one get away \nYour boobs are fine go out ealk with confidence",
      "created_utc": 1722901615.0,
      "score": 1
    },
    {
      "id": "lgowk54",
      "body": "My friends ex once said \"any more than a handful is too much\". I'm 38B, i get self conscious too but my husband makes me feel better about it because they're in proportion to the rest of me, I'm sure you're the same 😊",
      "created_utc": 1722901640.0,
      "score": 1
    },
    {
      "id": "lgoyinv",
      "body": "I’m a 34B cup and my partner loves my boobs. He says they’re perky and perfect. The right person will accept you for who you are. Definitely recommend therapy.",
      "created_utc": 1722902360.0,
      "score": 1
    },
    {
      "id": "lgp01nk",
      "body": "Almost all supermodels have A/B cups ❤️",
      "created_utc": 1722902934.0,
      "score": 1
    },
    {
      "id": "lgp1al8",
      "body": "Consider getting them pierced when you’re ready! r/piercing has a ton of stories that sound like yours",
      "created_utc": 1722903399.0,
      "score": 1
    },
    {
      "id": "lgp1b9o",
      "body": "I’m the exact same bra size and I love my boobs. I hated them a few years ago but my confidence has grown exponentially. My boyfriend loves them, with push up bras I still get a little cleavage with the right tank tops, I’ve learned how to take sexy pictures in a way that makes them most appealing, and I’ve incorporated them into my sex life. Smaller boobs are way more sensitive than big boobs, or so I’ve heard. Would I rather be a C cup? Yes, I think that would look sexy and still look decent with my frame. Would I trade that for what I have through surgery? No. My sister is an A cup so I know it could be worse and I’m thankful for what I have. My boyfriend talking them up helped too. You’ll come to love them. I’m guess you’re young? Like maybe 20? Because that’s how old I was when I hated mine. I’m 25 now and obsessed.",
      "created_utc": 1722903407.0,
      "score": 1
    },
    {
      "id": "lgp6jzi",
      "body": "As a man, I would say that seems like one of the best sizes.\n\n\"A nice handful but not too big to sag or cause discomfort.\"\n\nLearn to love your body. Then, the right one will love you for who you are. \n\nYou'll be okay. Just be patient with yourself. \n\n👍",
      "created_utc": 1722905373.0,
      "score": 1
    },
    {
      "id": "lgp9sj0",
      "body": "As a man, I can promise you that boobs aren’t important. Obviously the only thing that really matters is whether or not you can vibe with somebody, and appearance doesn’t have anything to do with that. But also obviously, physical attraction usually precedes the vibing stage, and I promise you big boobs are not the draw you think they are (ass might be a little different, but that’s just me. Also still not important tho). I personally think 34B is a perfect size, and to be honest, big boobs don’t age very well lol.\n\nI don’t even know why I’m commenting on this😅, I never do shit like this but Reddit pushed this random post notification to me and I felt like I wanted to reply. Stay up 🤝",
      "created_utc": 1722906613.0,
      "score": 1
    },
    {
      "id": "lgp9y9d",
      "body": "To some extent I resonate heavily with how you feel. I really tried to accept my boobs for how they were for literal years but I ended up going through breast augmentation and feel so much more better about myself. I understand it can be expensive but it can be rewarding if you truly want to change the size. I am wishing you the best of luck on however is best for you!!",
      "created_utc": 1722906673.0,
      "score": 1
    },
    {
      "id": "lgpam3u",
      "body": "34b is where it's at, in my opinion.  You're good. \nWe don't all like women with large boobs.  I personally find it a turn off",
      "created_utc": 1722906923.0,
      "score": 1
    },
    {
      "id": "lgpgc2e",
      "body": "my medical stuff has been in need lately too, but i am much better, positivism and eating right is important to gendered types, binders are on my brain, and also i think about my pronouns and the statement of medical stuff, while i have been clean in mental health very much lately, i  do feel past negativity has kept me from attaining my true health and support in the system, my health is actually a turn on is what i tell myself, the fact that i have learned to be a caretaker for my life and body is from y experience the kind of thing people find attractive",
      "created_utc": 1722909126.0,
      "score": 1
    },
    {
      "id": "lgpi5iz",
      "body": "I'm sorry you're feeling this. But just be aware that there are all kinds of men. Some men like small breasts over large breasts. \n\nLots of women have gotten into trends like lip fillers, breast implants, hair extensions, fake eyelashes, BBL, etc... and I'm telling you honestly most men hate that stuff. \n\nSure some might find it sexy for a one night stand, but not many actually want to date women that look like that. It's way too fake and makes them look like prostitutes. \n\nNatural is best. You'll meet a great man. I'd actually look at it as good thing right now. The kind of men that suddenly fall in love based on your body looks, are not the men you want. They will just be thinking sex, nothing else.",
      "created_utc": 1722909833.0,
      "score": 1
    },
    {
      "id": "lgpig4k",
      "body": "There is nothing wrong with small boobs. Nothing. \n\nMany men find them very attractive. There are entire subreddits dedicated to small boobs. \n\nBut the most important thing is that there will be men who love YOU. All of you. Yes, including your boobs lmao. \n\nThis sounds extremely cliche, but confidence is also incredibly attractive. Not aggressive confidence, that's arrogance. \n\nKnowing your worth will go a long way. \n\nWe all wish we could say something that will be mind blowing and helpful. We all just hope you will be OK in the end... Because your boobs do not define you. As many have said, many of us - including me - LOVE small boobs. My wife is roughly is a 34 B lmao",
      "created_utc": 1722909945.0,
      "score": 1
    },
    {
      "id": "lgpind7",
      "body": "I’m a woman,,,, small boobs look nice. Than bigger boobs 😂😂 just my preference",
      "created_utc": 1722910022.0,
      "score": 1
    },
    {
      "id": "lgplbt5",
      "body": "I understand how that feels. I feel the same. Your words are what I've felt for a very long time. Once I had my son I just couldn't believe how horrible they looked. I don't even look in the mirror at them. But. I also recognize that I'm a whole lot more than my boobs. I know one day I'll be able to have the opportunity to have them lifted. I don't know when, but I know I will. Sometimes no  amount of words from others can take away what is deep rooted within. The only way to change the way we feel about ourselves is through finding a way to feel and think greater than what we do presently. I began using EFT to remove the self confidence issues etc and I've begun to accept my body for what it is. I know that you can to. You deserve to feel good about yourself with no reference to men. Also, many men prefer all the things that many women don't like..things we are insecure about..they find beautiful. You are 100% deserving of love. I know that. If you cannot change your boobs right now, then work on your perception of how you see them..how you see yourself. 😉",
      "created_utc": 1722911080.0,
      "score": 1
    },
    {
      "id": "lgplres",
      "body": "As a man - I imagine it's a very similar feeling to when I started losing my hair. Personally I felt that the level that it was affecting my self esteem - deemed worth the cost of a transplant. \n\nBest decision I ever made. \n\nHowever......I still have huge self esteem issues and generally dislike my body to this day. It's possible that surgery will help - but also possible that your focus will shift to something else you dislike if you don't work on self acceptance. \n\nThat being said - I guarantee blokes will appreciate your fast metabolism more than boobs. Maybe trying to develop an athletic physique might help things? Always pays to give focus to things you have control over 🤙\n\nBig boobs also don't age well 😉",
      "created_utc": 1722911253.0,
      "score": 1
    },
    {
      "id": "lgpmoqf",
      "body": "I have 34K size boob and I absolutely hate it. It’s so annoying. They don’t even look appealing. I would love to have smaller boobs. What in trying to say is that some people have it luckier than others. But don’t think so low of yourself, you are perfect just the way you are.",
      "created_utc": 1722911628.0,
      "score": 1
    },
    {
      "id": "lgpn523",
      "body": "I had a period of time where I hated my boobs too. I was 32B for the longest time (my 20s and early 30s). My boobs are spread wide too so I had no cleavage. I’ve always compared myself to those IG models and influencers. Took me a long time to accept my body the way it is. Reality is, we come in all shapes and sizes. Beauty is only skin deep. What’s helped me is working on myself, and the confidence helped me accept my body. I took heels classes and been going to the gym for cardio. Over time, I got more comfortable with myself and how I look. Now I’m in my mid 30s my metabolism has been slowing down and I been gaining weight. I’m almost a 34C and to be honest they are starting to get in the way. But I’m happy about them regardless. Keep your head up!",
      "created_utc": 1722911810.0,
      "score": 1
    },
    {
      "id": "lgpohmw",
      "body": "Half the people don't really care about boob size. I'm a 15 year old boy so basically all the boys my age think about is sex and sexual themed things but idk. I wouldn't really worry about it as long as you have a good personality someone will love you most definitely. Body image is something everyone struggles with, even people with large boobs, they think \"people don't take me seriously they just sexualize me or act nice to see if they can have sex with me\" so honestly it's just how the human mind works. We will always come up with \"flaws\" of our bodies because we're constantly looking at it.",
      "created_utc": 1722912360.0,
      "score": 1
    },
    {
      "id": "lgpomoc",
      "body": "Have you considered not wearing the bras that make them appear bigger? It seems that it is hurting your self image more than helping.\nMaybe it’s a first step to self acceptance—if you don’t accept yourself, how can the man you’re with accept you?",
      "created_utc": 1722912418.0,
      "score": 1
    },
    {
      "id": "lgpp1sb",
      "body": "I'm a 34b and honestly I don't like them. I wish I was an A cup. I think they're too big & make me look bigger weight wise. I would love to be a lot smaller! I used to be a C cup & that was pure torture for me. I'm glad I'm less, but not small enough in my opinion. I don't think we're ever happy with what we have. Unfortunately.",
      "created_utc": 1722912591.0,
      "score": 1
    },
    {
      "id": "lgpqmsh",
      "body": "I think small boobs are cute! Plus they don’t sag as much as you get older! I think you are over analyzing. Focus on other things, and I think you should stop wearing super padded bras too, it’ll make it more of an insecurity for you in the long run.",
      "created_utc": 1722913248.0,
      "score": 1
    },
    {
      "id": "lgpr4s3",
      "body": "Wow. \n\n\nBoobs change all the time...pregnancy, period etc.\n\n\nAlso never mind being disrespectful to yourself you are also disrespecting straight men as if their \"love mechanism\" only after boobs are a certain. Size.",
      "created_utc": 1722913459.0,
      "score": 1
    },
    {
      "id": "lgps1rk",
      "body": "I relate with you even though we are directly opposite of each other! I hated my chest ever since puberty- I want them gone. As flat as possible. And I grew up having my back hunched to hide it as much as possible because I hated them even though everyone tells me “you don’t really have boobs you know” bc they are very flat already. \n\nI guess we all have a part of our body that we hate but other people would see you differently. We have our reasons to hate our bodies but I find out that’s just us. So if that would make you feel any better your body does not define you or how attractive you are. At least to the right persons.",
      "created_utc": 1722913854.0,
      "score": 1
    },
    {
      "id": "lgpscql",
      "body": "samsamesame but trust me girl, you’re fucking beautiful inside and out. Women aren’t defined by their boobs",
      "created_utc": 1722913986.0,
      "score": 1
    },
    {
      "id": "lgpvcaw",
      "body": "Most truly beautiful women have smaller boobs. Just something i noticed",
      "created_utc": 1722915306.0,
      "score": 1
    },
    {
      "id": "lgpwvb8",
      "body": "Somw men do not prefer large breasts on a woman. Your bra size will have nothing to do with a man taking you serioisly. Dont sweat it. I know. Easoer said than done. But what im saying is absolutely true.",
      "created_utc": 1722916005.0,
      "score": 1
    },
    {
      "id": "lgpzvcc",
      "body": "I'll you've never heard the old saying, \"a man's favourite kind of boob is the kind he gets to see.\" \nSo, it doesn't matter, any guy that's not shallow will not care about breast size. \nIt's just like women who say they only find tall men attractive. That's just as shallow as saying only women with big boobs are attractive and they just aren't true, for decent people anyway. \nUnfortunately it is a reality for some people.",
      "created_utc": 1722917435.0,
      "score": 1
    },
    {
      "id": "lgq0b35",
      "body": "I have not seen any man looking at a women's breast before deciding to love her or not. And how can someone selectively love, unlove or dislove someone?\n\nIs 34B small or big in size?",
      "created_utc": 1722917650.0,
      "score": 1
    },
    {
      "id": "lgq51bn",
      "body": "if anyone thinks size dictates greatness then you are either 12 year old or very dull .",
      "created_utc": 1722920065.0,
      "score": 1
    },
    {
      "id": "lgq8qbg",
      "body": "I'm 34A (28F) asian girl. Never in a relationship, underweight. I do doubt if men find me attractive but in the end it doesn't matter if you have to pretend and try to be fixed into the standard. \n\nRn i just do what i love. Health and things that keep me grounded are my priority. If i wanna look cute and pretty, I just invest some money for make up and clothing. Get some info from people who know how to dress up. \n\nIn spirituality, your mind is your prayer. If you thinking  yourself is not good enough. It will manifest in your life. Be careful. If you're below 30 i won't recommend cosmetics surgery unless for health purposes.",
      "created_utc": 1722922133.0,
      "score": 1
    },
    {
      "id": "lgq9eso",
      "body": "I can 100% tell you the size of your boobs does not matter in the least as long as your a good and loyal person anyone that would ever leave you or cheat because of your breast size is a Piece of shit and should be treated as such.",
      "created_utc": 1722922526.0,
      "score": 1
    },
    {
      "id": "lgq9zmw",
      "body": "Lol I have the same size 😂. There were times when I wanted bigger, but seeing friends complaining about backpain, I was content. Then I also saw an A size influencer taking pride in her body, so I thought there's nothing wrong with me except the social constructs I was made to believe. Forget the insecurities and learn to love the natural than standards",
      "created_utc": 1722922864.0,
      "score": 1
    },
    {
      "id": "lgqalrh",
      "body": "Boob size has never been a consideration for me. I have loved  women for who they are and not their boob size. Boobs will not compensate for love and passion",
      "created_utc": 1722923222.0,
      "score": 1
    },
    {
      "id": "lgqbto7",
      "body": "if it makes you feel any better- as a woman on the larger side of this spectrum, i wish i was still your size. back pain is no fun and sometimes it lowkey ruins outfits💔\n\nlove yourself girl u got this💪🩷",
      "created_utc": 1722923961.0,
      "score": 1
    },
    {
      "id": "lgqda7g",
      "body": "I have the same size as you and I don't even think my boobs are that small. Like they're nice to hold, they have some bounce, it's not like we have nothin. If you want your boobs to get some attention try going out braless.",
      "created_utc": 1722924849.0,
      "score": 1
    },
    {
      "id": "lgqfde3",
      "body": "As long as your face is kinda okiesh and you have a good personality(mostly humour). There shouldn't be any other problem✌️",
      "created_utc": 1722926159.0,
      "score": 1
    },
    {
      "id": "lgqfomk",
      "body": " (im a guy) I am 25 and i want to say that its okay honestly i have a slender frame and i'm not really taken seriously. The reason for that is because i feel that some women will go for the muscular guy but its okay. Everyone has their insecurities and we are only human I say embrace who you are because at the end of the day if a guy is only with you for sex appeal then is it really love??",
      "created_utc": 1722926362.0,
      "score": 1
    },
    {
      "id": "lgqg5xf",
      "body": "I'm also a small boob haver. Good for aerodynamics!",
      "created_utc": 1722926669.0,
      "score": 1
    },
    {
      "id": "lgqjuyp",
      "body": "I had small boobs too i was 32b. But no men ever made me feel like it was too small or anything and i started going bra less and thats how i started loving myself again. Now im on bc pills so now im 32d but i dont like it anymore bcz i love going out bra less",
      "created_utc": 1722929077.0,
      "score": 1
    },
    {
      "id": "lgqpnl6",
      "body": "If you are on other forms of social media such as instagram etc you may wish to avoid them if that is where this stems from.\n\nComparing yourselves to others online (if that is what you are doing) will usually lead to upset.\n\nAllot of these people online live fake, edited, lives where you only see one side of the story.\n\nSocial media is really messing people up and I think is one of the biggest contributors to many forms of body dysmorphia.\n\nApologies if your issues are not social media influenced.",
      "created_utc": 1722933006.0,
      "score": 1
    },
    {
      "id": "lgqq43o",
      "body": "Everybody likes different things, and I can guarantee there will be a whole heap of men out there who will fall in love with your breasts for what they are. \nEverybody is different and nobody has to subscribe to the fact that there is a single image we must all portray \nLove yourself and be proud of what you have. You’ll get along just fine",
      "created_utc": 1722933319.0,
      "score": 1
    },
    {
      "id": "lgqqkrh",
      "body": "Hey girl! \nAs a bi woman I can tell you boob size really doesn't matter, everyone has their own preferences :))\n\nBut outside of that since it does a lot to your confidence and you feel less of a woman, what I think is very feminine and attractive is when small boobed girls don't wear a bra with a tight shirt or croptop, it shows that the titties are there and they don't have to be big to be noticeable!\n\nObviously that's quite an extreme dressing choice but in your case I would recommend trying to embrace your natural advantages instead of hiding them under padded bras. \nThink of it this way, girls with big breasts can't do that since they need constant support, while you have this amazing advantage of being able to show off your beautiful chest without having to constantly cover it up and wear uncomfortable bras. \nSame goes for bralettes and non padded bras, they are perfect for your situation and super comfortable :)\n\nAs a woman who also has a smaller breast size as well as a more of a muscular build I always wished to be petite and have an even smaller breast size or be curvier bc i felt like I was in this \"ugly\" middle ground. After time I learned that so many people are jealous of my looks as much as I am jealous of theirs. \n\nTo sum it up, embrace it, experiment with clothing styles and don't let anyone tell you how you should look. It's your body and you are and will always be a woman no matter how you look, dress or what your body type is :)",
      "created_utc": 1722933632.0,
      "score": 1
    },
    {
      "id": "lgqu3cz",
      "body": "OP I hope you find a professional to speak to because body dysmorphia is real and should be taken quite seriously. You need to make sure you take care of yourself in order to be able to love yourself",
      "created_utc": 1722936021.0,
      "score": 1
    },
    {
      "id": "lgquybl",
      "body": "I had small boobs, then I was pregnant and they got huge, and I breastfed for 22months and now I have envelope flaps. I helped my aged mil get dressed one day when she had dementia and when I was adjusting her waistband something brushed my hand…her boob was hanging that far down without a bra that it was in line with her waist. Dangling, unfettered boobs are now added to my list of what scares me about aging. When I tell my husband that I want a breast reduction and lift because these (.) (.) are now just something else to manage, he looks alarmed and tells me he likes me as I am. If I had the money, I’d fix them.",
      "created_utc": 1722936595.0,
      "score": 1
    },
    {
      "id": "lgqvmh2",
      "body": "are you kidding me im literally 32a",
      "created_utc": 1722937043.0,
      "score": 1
    },
    {
      "id": "lgqw2nu",
      "body": "If it helps at all, I have I think DDDD’s and I can’t stand Bras, so I have constant body dysphoria because of it, I look so weird all of the time and wish they were so much smaller. So many of us are deeply utterly unhappy with parts of our body because of social media weather or not we believe that’s the cause. I bet someone adores you. Be easier on yourself",
      "created_utc": 1722937340.0,
      "score": 1
    },
    {
      "id": "lgqzdh3",
      "body": "I don't have the same issue but I wish I had a smaller chest. While I can't share your issue, I do know have a mutual friend through my partner that is male. His partner had a small chest and he loved it, she didn't love it and even though he prefers small chests he still paid for an augmentation because she wanted it. He doesn't like her boobs now which is unfortunate.",
      "created_utc": 1722939398.0,
      "score": 1
    },
    {
      "id": "lgqzdjb",
      "body": "When I feel like this I look around the world I look at people with boobs like mine or less and have what I want and I realized it's not the thing I'm obsessing over that is keeping me from having it.\n\nAlso the world is set up, there will always be someone who finds you attractive just as you are, the keep saying men are attracted to certain types but that's only on people, on the ground it's different.\n\nI mean either the men you want to take seriously are jerks or your lack of acceptance and confidence is what makes them not take you seriously.\n\nNo by enhancing what you don't like you're calling to attention your insecurities instead accentuate your other features, the ones you like, your redeeming qualities. Attraction is not just on boobs. Sometimes it's just a smile. But someone did a number on you and it's ingrained.\n\nBeauty/attractiveness is not the price you pay to exist in the world and have all that you want! I hope you stop taking men seriously and liberate yourself, I hope that for all of us.",
      "created_utc": 1722939399.0,
      "score": 1
    },
    {
      "id": "lgr1xa9",
      "body": "You think there are no people that appreciate how you look? That they actually love your size? Be yourself ma'am",
      "created_utc": 1722940912.0,
      "score": 1
    },
    {
      "id": "lgr6hw2",
      "body": "this hurts sm because i’m so same… no matter what i do , how much i eat, im still barely at 43kgs as an 18yo female…. i cannot go out without a push up bra and when i look in the mirror, all i do is cry. i know that there are some men that actually love smaller boobs… but i cannot shake the feel of disgust of myself",
      "created_utc": 1722943357.0,
      "score": 1
    },
    {
      "id": "lgr7ki1",
      "body": "As a man, we dont care. Many of us love any boobs and we're always excited about boobs. Men don't like push-up bras usually, at least where I come from. We like it how it is and it's great. Don't compare to other women because maybe they hide the same insecurity as you have, many women have. Also if a man judges you on it, he probably watches too much porn or doesn't have a mom/sisters. Don't worry",
      "created_utc": 1722943892.0,
      "score": 1
    },
    {
      "id": "lgr80kv",
      "body": "Im a 34b and yes I wish they were a lil bigger but I like them the way they are .. you need to learn to love what you got because you only get one body in this world and nothing we can do about it. \nSome men don't like big boobs anyways",
      "created_utc": 1722944114.0,
      "score": 1
    },
    {
      "id": "lgr8xgm",
      "body": "I feel this. I've been obese, overweight, lowkey underweight,.. in each of these stages I just hated my body and specifically my boobs too. I already accepted that I'll get a boobjob.. but it sucks that we have to get to this point that we feel like we need to change ourselves to get accepted and be seen as attractive 😔",
      "created_utc": 1722944554.0,
      "score": 1
    },
    {
      "id": "lgr92he",
      "body": "Im also a 34B and struggle with this, push up bras were pretty much the only type of bra I bought, always hated my size especially when friends or hell even people younger than me got a bigger size. But to be honest I’m finally starting to feel okay with my size and the guy that I’m speaking to isn’t really bothered and loves them so it’s a win win. I hope you start feeling better about yourself, I promise you’re perfect as you can be, but also don’t ever change yourself for someone, the right person will come along and love you for what you are <3 :))",
      "created_utc": 1722944622.0,
      "score": 1
    },
    {
      "id": "lgr9kl3",
      "body": "As a man , i never cared about boobs or anything else in the body \nI didin't even care about ass or thighs ... \nThe only thing that makes me attracted to certain women , is the positive energy, So a woman who is so positive and.always laughing and respectful, is always the best choice for men \nbeing extra FAT is the problem that you can solve , but being extra skinny was never a problem \n\nBe cheerful and positive trust me , you can find a man , just don't focus a lot to find a man and be natural \nHave a nice day ❤️❤️",
      "created_utc": 1722944858.0,
      "score": 1
    },
    {
      "id": "lgrbme2",
      "body": "My wife is 34B and god damn I love those things!",
      "created_utc": 1722945796.0,
      "score": 1
    },
    {
      "id": "lgrrzfe",
      "body": "meanwhile me who’s favorite thing about my extreme weight loss is the fact that im now completely flat.",
      "created_utc": 1722952183.0,
      "score": 1
    },
    {
      "id": "lgrx2ex",
      "body": "A guy beat me saying the : boobs are boobs, so i will go into much more detail. They are perfectly fine and good. Personally i like them all sizes, usually my exes had smaller breasts except one, and they are equally atractive, meaning: when you are in love or at least really attracted to someone is not size shape color etc is the person is the intimacy you share with him/her that excites and attracts you. It doesnt matter if they are as big as my head or very very little, they will be boobs, and they will be my partner's. If someone says to you something on the line : i dont like this of your body, find someone else, why? Because they are not meant for u, everybody deserves someone that truthfully and genuinely loves you and your body the way they are",
      "created_utc": 1722953913.0,
      "score": 1
    },
    {
      "id": "lgs50ef",
      "body": "Large breasts are useless unless you just like turning on random strangers. But for intimacy nipples and sensitivity are the only things that matter. I am passionately oral so love sucking, large breasts or implants that sacrifice nipple size and sensitivity are a turn off.\nTC in Annapolis Maryland",
      "created_utc": 1722956500.0,
      "score": 1
    },
    {
      "id": "lgs7nhs",
      "body": "It’s all about the heart underneath them… and the shape… size doesn’t really matter at all. But honestly as the rhyme goes B is plenty for me. I got a 2 cm destroyer so we are all equal",
      "created_utc": 1722957345.0,
      "score": 1
    },
    {
      "id": "lgt8e7u",
      "body": "Everyones have diffrent preferences there's someone for everyone,  boobs are not everything. If your face is attractive, other body parts, you should be fine.",
      "created_utc": 1722968704.0,
      "score": 1
    },
    {
      "id": "lgtuvs2",
      "body": "Don’t count out 34B, \n\nTrust me a 34 B means your perfect sized.\nYou can wear a push up bra and they look great, they aren’t down near your belly button, non of those awkward photos where your shirts gets tucked up under a tit. In the summer you don’t get slippery tits that releases a distinct underboob sweat Oder.  \n\nYour body is what girls strive for remember that, especially being a 34, your body must be banging ( said non creepily by a woman) don’t discredit yourself I don’t know your age and am now concerned about the comment above but know your breast change throughout your life, there’s nothing saying this is what they will always be like since turning 18 my breasts have gone up and down, changed shape you name it, never underestimate your body they are amazing ever changing things trying hard to change them won’t work because they will change when they change, don’t worry so much.\n\nI know it may not feel like it but for men, women of your body type are often preferred to men because having large breasts usually comes with a large weight, you look nicer in clothes and correct me if I’m wrong are usually athletic or were as children. \n\n\nYour not looking for the men who care about that sort of stuff because if they did, you wouldn’t want them.",
      "created_utc": 1722975655.0,
      "score": 1
    },
    {
      "id": "lgtwpkv",
      "body": "34 b that's loads. I started as a 34b you'll get bigger as you age. I'm a 36 d now. Bet you look good.",
      "created_utc": 1722976212.0,
      "score": 1
    },
    {
      "id": "lgxh7du",
      "body": "Let me go ahead and tell you something about men....they like boobs of ALL sizes. Sure, they might have preferences just like anyone else, but most are just as excited by small ones as big ones. Boobs are boobs to a guy.",
      "created_utc": 1723034275.0,
      "score": 1
    },
    {
      "id": "lh4jego",
      "body": "All boobies are beautiful and should be loved",
      "created_utc": 1723132650.0,
      "score": 1
    },
    {
      "id": "lh4yfuj",
      "body": "I don’t know what to say but even tho I’m still a growing child\n\nI feel the opposite. I hate the fact that they’d get big because bras are very uncomfortable. I like the bras that looks like a sport bra or some sort. But I’m even more uncomfortable without bra so I just go everywhere wearing that thing on\n\nI guess I can only say. Having a small chest as a woman is fine. So don’t hate yourself for it. I’m sure some people like people like you too",
      "created_utc": 1723137254.0,
      "score": 1
    },
    {
      "id": "lh7nu4v",
      "body": "34 b or c ain’t that bad lol depends on your body shape and weight !!! Maybe that’s why you’re insecure. But I’ve never had any problem bring that size 😂 it’s still round and perky at 35 . It’s beautiful actually!!",
      "created_utc": 1723169646.0,
      "score": 1
    },
    {
      "id": "lia5a6k",
      "body": "small boobs benefit health! they don't look bad at all, it is mainly a toxic beauty standart probably set by men anyways. you can always hear big-chested woman experiencing disgusting amounts of back pain to the point where they get surgeries to get boobs just like yours(and mine!)",
      "created_utc": 1723747074.0,
      "score": 1
    },
    {
      "id": "lrhx187",
      "body": "Girl ones I was walking in the street felling beautiful and confident but those two guys was laughing and someone tell the other:\" look at her she is walking like a super model even though she is flat\" and that made me so insecure,I have two sisters and I'm the only flat one but it's okay the small boobs have their own sharme",
      "created_utc": 1728693297.0,
      "score": 1
    },
    {
      "id": "lz74etu",
      "body": "I know this is old but I am in the opposite boat. I hate my breasts. They’re huge! I’ve always had a big chest, even in elementary school. I was in 4th grade (9 years old) with bigger boobs than some of my teachers. It’s humiliating because they don’t match me at all. I have smaller legs and I feel like I can’t be perceived as anything but sexual or “seeking.” Nothing every fits right and there is an intense amount of shame that comes with them from childhood. My hubby says he likes them but sometimes I just want to get rid of the whole thing and be completely flat. I want to wear dresses and frolic without having to go up three sizes. I’d switch with you anyway.",
      "created_utc": 1732683749.0,
      "score": 1
    },
    {
      "id": "lgkp4d0",
      "body": "Far from it, you will be taken seriously not all men like large breasts. I myself prefer small ones and I’m not kidding either the thought of getting my hands on them sounds good 👍 x",
      "created_utc": 1722843140.0,
      "score": 0
    },
    {
      "id": "lgp3he9",
      "body": "You do not want big boobs. They are a nightmare! And heavyweight",
      "created_utc": 1722904224.0,
      "score": 0
    },
    {
      "id": "lgljqzp",
      "body": "B cups are the best though! B34 is my favorite size ever! They don't sag! There so nice an perky.. ugh I love b34😌🔥",
      "created_utc": 1722861213.0,
      "score": -1
    },
    {
      "id": "lgmb0hi",
      "body": "[removed]",
      "created_utc": 1722871077.0,
      "score": -2
    },
    {
      "id": "lgko8dj",
      "body": "Are they saggy?\n\nEdit: I didn’t mean to offend or troll. It was a genuine question without judgement from a stupid guy that doesn’t understand boob sizes lol",
      "created_utc": 1722842544.0,
      "score": -3
    },
    {
      "id": "lgmw72u",
      "body": "This is correct. I also love small boobs.",
      "created_utc": 1722877833.0,
      "score": 14
    },
    {
      "id": "lgkhdpc",
      "body": "Yes, I just need to accept that the right person will love everything about me , which is way easier said than done \nThank you for the advice",
      "created_utc": 1722838181.0,
      "score": 108
    },
    {
      "id": "lgnmev8",
      "body": "This right here is GOLD well said! As a man who's wife doesn't have large breasts I could honestly care less, I love her, she is the mother of my children and will always be the most beautiful woman on earth to me.",
      "created_utc": 1722886179.0,
      "score": 4
    },
    {
      "id": "lglomuv",
      "body": "oh how i wish the last sentence were true in my case",
      "created_utc": 1722863215.0,
      "score": 3
    },
    {
      "id": "lgplrd9",
      "body": "What?! I'm 40 and they do! I had my son young and was a 34 A. While pregnant I was blindsided when I went up to a G. Yes. A G!!! They were so big they were in my armpits. I didn't think such a thing was possible. When I had him they deflated like sand bags. I want to have them lifted badly. But, one day. \nIf only that non saggy part were true.",
      "created_utc": 1722911252.0,
      "score": 1
    },
    {
      "id": "lgkkh34",
      "body": "[removed]",
      "created_utc": 1722840121.0,
      "score": -3
    },
    {
      "id": "lgkjeky",
      "body": "Thank you for your thoughtful response. It’s reassuring to hear that your boyfriend fell in love with you just as you are. A person’s mindset really is everything, which is why I need to work on it. Hopefully I can focus on embracing and appreciating my body as it is instead of looking for what to change.",
      "created_utc": 1722839445.0,
      "score": 21
    },
    {
      "id": "lgkliiz",
      "body": "I agree with the part of belief and affirmations. We are what we believe.",
      "created_utc": 1722840779.0,
      "score": 2
    },
    {
      "id": "lgt9hhe",
      "body": "34B isn't even small?",
      "created_utc": 1722969037.0,
      "score": 1
    },
    {
      "id": "lgkk9li",
      "body": "Haha I guess so, but you’d be surprised how not everyone seems to think that way",
      "created_utc": 1722839989.0,
      "score": 1
    },
    {
      "id": "lori3rh",
      "body": "THANK YOU!! 🙏🏻🙌🏻🙌🏻🙌🏻🙌🏻",
      "created_utc": 1727216184.0,
      "score": 3
    },
    {
      "id": "lgkjvj4",
      "body": "Thank you so much for sharing your perspective. It’s really empowering to hear how much you embrace your body just as it is. Your confidence is inspiring and a great reminder that my worth isn’t defined by my physical attributes alone. I completely agree that loving ourselves is really the most important thing. Thank you for your encouragement and for reminding me to appreciate and love my own body❤️!!",
      "created_utc": 1722839744.0,
      "score": 7
    },
    {
      "id": "lgkj86x",
      "body": "I’m glad you’ve grown to feel more comfortable in your body!! And I think as long as a woman is pretty, everything else about her will be too",
      "created_utc": 1722839333.0,
      "score": 6
    },
    {
      "id": "lgkh76h",
      "body": "Sorry to hear, but glad to get such a real answer,,\nI know it’s a very risky procedure, both looks wise and health wise",
      "created_utc": 1722838071.0,
      "score": 3
    },
    {
      "id": "lgkjopz",
      "body": "Thank you so much for your heartfelt message. It’s incredibly inspiring and comforting to hear about how you’ve found happiness and self-love. Your advice means a lot to me. I’ll definitely try to focus on the positives and balance out negative thoughts with positive ones, just as you suggested!",
      "created_utc": 1722839625.0,
      "score": 2
    },
    {
      "id": "lgktfvv",
      "body": "Freya and Panache are great for sports bras in larger cup sizes. They go up to J!",
      "created_utc": 1722846092.0,
      "score": 3
    },
    {
      "id": "lgkk1jt",
      "body": "It’s really true that everything has its pros and cons and everyone kinda wants what they can’t have… honestly I’m sure you look great, focus on the pros more than the cons!! Hopefully both of us can learn to completely love ourselves ❤️ Thank you",
      "created_utc": 1722839850.0,
      "score": 1
    },
    {
      "id": "lgliwfs",
      "body": "I used to be the same as you. I’m short too at 5’ flat and was 244lbs at my heaviest. Had gastric sleeve surgery and went from a 40D to a 32/34B. I honestly like that they shrunk bc I don’t have to wear bras most of the time and I never wear them in winter unless I have a special occasion",
      "created_utc": 1722860847.0,
      "score": 1
    },
    {
      "id": "lgkj1ln",
      "body": "I’m glad to hear that your mother is learning to love herself, and I hope to do the same. In the end, I really believe that what we’re exposed to on our feeds often influences our thoughts, even subconsciously. Thank you for the advice",
      "created_utc": 1722839217.0,
      "score": 1
    },
    {
      "id": "lgkid16",
      "body": "Oh my god you’re so sweet genuinely, thank you so much!! I have thought of exercising but I thought it would make them smaller (?) or not as squishy (??) tmi I know but maybe you’re right. Honestly I really appreciate your advice and it was very thoughtful. Everything has its pros and cons, and everyone wants what they don’t have. Thank you so much for your kind words , again!🩷",
      "created_utc": 1722838792.0,
      "score": 3
    },
    {
      "id": "lgkirbr",
      "body": "Thank you so much! Unfortunately, I've tried supplements like fenugreek, and they didn't really have an effect, even after using them for over four months. I’ve also learned that for trans women to increase their bust size, it’s usually due to estrogen or hormone therapy, which isn't something you can get over the counter— You need to be prescribed it. Trust me, I’ve looked into it. I think I need to just accept myself for who I am. I really appreciate your advice and support❤️",
      "created_utc": 1722839039.0,
      "score": 2
    },
    {
      "id": "lgkiv3j",
      "body": "Accepting it is easier said than done tbh but that’s the only way. One day I will accept and love the body I’m in, thank you so much ❤️❤️",
      "created_utc": 1722839104.0,
      "score": 1
    },
    {
      "id": "lgoash8",
      "body": "Every girl I dated that had large boobs hated them and wanted breast reductions due to back pain.",
      "created_utc": 1722893952.0,
      "score": 1
    },
    {
      "id": "lgkbb2i",
      "body": "Don't forget to train your back when you train your chest. Otherwise you look like me at 17 (shortened chest muscles and overstretched back muscles = crappy posture and back pain)",
      "created_utc": 1722834592.0,
      "score": 5
    },
    {
      "id": "lgkl6q9",
      "body": "Omg no don’t be 😭😭😭 34B could look different on everyone I might have a different body shape, breast tissue distribution, and overall proportions than you",
      "created_utc": 1722840571.0,
      "score": 2
    },
    {
      "id": "lgl3y1b",
      "body": "[deleted]",
      "created_utc": 1722853173.0,
      "score": 0
    },
    {
      "id": "lgkgjbf",
      "body": "That’s actually really cute, I’m so happy you found a good man!!❤️ Hopefully I will meet someone very loving aswell— flaws and all lolol",
      "created_utc": 1722837670.0,
      "score": 1
    },
    {
      "id": "lgkzq9e",
      "body": "Honestly I’ve learned that everything has its pros and cons, and you’re right the grass isn’t always greener but everyone desires what they don’t have. Hopefully we can both come to loving ourselves entirely",
      "created_utc": 1722850421.0,
      "score": 2
    },
    {
      "id": "lgl096a",
      "body": "First of all, your dad even commenting on them is kind of odd let alone making fun of you?? I’m so sorry to hear that that’s horrible. But I totally get where you’re coming from I also used to get teased because of my small boobs, especially when i was literally in middle school (which literally makes no sense since our bodies aren’t even done developing by then, plus it’s not in our control ). You’re absolutely right— everybody has their own set of challenges and perks. People want what they can’t have 🤷‍♀️\n\nFocusing on what makes you feel good about yourself is definitely key, rather than focusing on the bad. And about the cosmetic procedure it’s just somehting that enters my head quite a bit but I’d never do it, no money and WAY too many risks… but thank you so much for such a personal reply I appreciate your advice ❤️❤️",
      "created_utc": 1722850785.0,
      "score": 1
    },
    {
      "id": "lgl0clu",
      "body": "Yes, please",
      "created_utc": 1722850850.0,
      "score": 1
    },
    {
      "id": "lgmjxje",
      "body": "Give me the money for it and I will",
      "created_utc": 1722873949.0,
      "score": 1
    },
    {
      "id": "lgoifj2",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722896573.0,
      "score": 1
    },
    {
      "id": "lgmq7oi",
      "body": "What does it stand for?",
      "created_utc": 1722875977.0,
      "score": 1
    },
    {
      "id": "lgmr716",
      "body": "I’d say it’s more 50/50 ; some guys are boob guys and some guys are butt guys",
      "created_utc": 1722876290.0,
      "score": 1
    },
    {
      "id": "lgn1ksk",
      "body": "I think on anyone else’s body, esp someone a bit shorter and diff proportions it would look average. But I’m 5’5 ft - 165 cm. And everything about me is quite long; my torso, my legs, my arms. So I feel like my proportions make them look smaller than they are. But thank you",
      "created_utc": 1722879549.0,
      "score": 1
    },
    {
      "id": "lgn4crf",
      "body": "I think it was mostly my friends, I used to get teased a lot in middle school because of my small boobs. Before then I didn’t even see them as something negative",
      "created_utc": 1722880431.0,
      "score": 1
    },
    {
      "id": "lgnqg0t",
      "body": "😭😭😭 this gave me a good laugh",
      "created_utc": 1722887464.0,
      "score": 2
    },
    {
      "id": "lgo0b6a",
      "body": "Promotion and advertising of products or services is strictly prohibited on r/mentalhealth. We also prohibit links and recommendations for social media and video hosting sites or the accounts of content creators or influencers. \n\nComments that explain *what a product helped you with* and *how it helped you* may also reference the product. Do not link to the product or suggest that someone seek it out. Moderator discretion on allowing comments of this nature is final.\n\nPosts and comments may relay helpful and accurate ideas and information obtained from social media or video sites, but do not link or suggest that a user seek the creator out.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722890581.0,
      "score": 1
    },
    {
      "id": "lgo43e2",
      "body": "If it makes you feel any better, my friend is the same. One boob is way bigger than the other but I’ve never thought “oh that’s weird”. You’re great the way you are and thank you for your thoughtful comment! Hopefully I’ll find a guy that’ll love me for me",
      "created_utc": 1722891776.0,
      "score": 2
    },
    {
      "id": "lgp1vnb",
      "body": "Thank you so much for your kind words!! And I guess everything really is just all in our heads, I’m making an issue out of something most people don’t even care about. But coming to accept myself and my body is way easier said than done. Hopefully one day I’ll love me for me, thank you again <3",
      "created_utc": 1722903617.0,
      "score": 1
    },
    {
      "id": "lgp1jye",
      "body": "Thank you so much for the advice, I’ll learn to actually apply this and think this way. Much love",
      "created_utc": 1722903496.0,
      "score": 1
    },
    {
      "id": "lgp1edx",
      "body": "Honestly I feel like 38B is perfect, not even just saying that. But I’ve heard that quite a bit, not from people i know tho so that’s why I tend to think people just say that and don’t really mean it. Thank you ❤️",
      "created_utc": 1722903439.0,
      "score": 1
    },
    {
      "id": "lgqvv9k",
      "body": "Everyone’s allowed to feel insecure, but in the end it’s all in our head and all our bodies are beautiful. It’s just hard to actually realize that most of the time this stuff doesn’t matter",
      "created_utc": 1722937206.0,
      "score": 1
    },
    {
      "id": "lgr8n1n",
      "body": "I’m so sorry to hear that honestly I know how hard it is, but I’m so glad to see someone in almost exactly the same place as me.. If I had to list the amount of times I’ve cried looking at my boobs we would never finish this conversation. I really think there’s nothing we can do but try and accept it, and even maybe consider therapy since both our cases are quite severe. Thank you for your personal comment",
      "created_utc": 1722944417.0,
      "score": 2
    },
    {
      "id": "lgp8o98",
      "body": "Doesn’t matter if you like them, op doesn’t",
      "created_utc": 1722906181.0,
      "score": 1
    },
    {
      "id": "lgp8m9a",
      "body": "[removed]",
      "created_utc": 1722906160.0,
      "score": 1
    },
    {
      "id": "lgp9n02",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722906554.0,
      "score": 1
    },
    {
      "id": "lgkoezo",
      "body": "Are you trolling or what?😭😭 34b is not big so no they are not saggy",
      "created_utc": 1722842667.0,
      "score": 2
    },
    {
      "id": "lgndrir",
      "body": "As a small boob lover I agree, true love will find you!!!",
      "created_utc": 1722883413.0,
      "score": 5
    },
    {
      "id": "lgkjmn8",
      "body": "Listen, I have small boobs too. I’m bi, and I prefer smaller boobs on women. People who value boob size above all else are not worth your time.",
      "created_utc": 1722839589.0,
      "score": 61
    },
    {
      "id": "lgkibuy",
      "body": "I have always preferred smaller breasts on a woman.  I just don’t find large breasts all that appealing. I guess I’m in the minority, but there has to be a decent guy for you out there who’d love you just as you are.",
      "created_utc": 1722838772.0,
      "score": 79
    },
    {
      "id": "lgldf9n",
      "body": "32A here. 36(f) I can fit my 10 year old niece training bra ha! But really, small boobs are great. Tbh, I don't even consider a  size B to be small. A's are tiny but there are some women out there even with AA. All I can say is, rock what you got. It doesn't matter what \"the right person\" thinks, it matters what you think. Acceptance is the first place and here you are. As for advice, Random AF but personally I hold my boobs and remind myself that they are still a pleasant handful. ❤️",
      "created_utc": 1722858335.0,
      "score": 32
    },
    {
      "id": "lgkxosp",
      "body": "I have seen men go crazy over female actresses with small boobs going topless.\n\nBig boobs gain a lot of attention yes, but that doesn't mean that small ones do not have its own audience.\n\nLastly, your problem with your boobs is not because of your boobs. It is because you are just so focused on them.",
      "created_utc": 1722849010.0,
      "score": 45
    },
    {
      "id": "lgl1tzr",
      "body": "Uhhhh as a man, I will tell you that you massively overestimated which trait we like more. I just need you to have boobs, Im not a fucking vegetarian. Sure some people will like bigger ones more but it's not like us men discriminate, boob is boob, so don't let that factor letting you down lol",
      "created_utc": 1722851829.0,
      "score": 22
    },
    {
      "id": "lglsau8",
      "body": "If it makes you feel better, I’ve been a 32A my whole life and I also used to be self conscious about them. But I’ve had nothing but extreme praise from men whenever they’ve seen them. Everyone has preferences, and big boobs aren’t what every man “wants”. (We’re all beautiful regardless). Sometimes I want a boob job because I like the way they look, but all of my boyfriends have begged me not to. So I’ve learned to embrace them and love them! But it takes time.",
      "created_utc": 1722864637.0,
      "score": 10
    },
    {
      "id": "lglgvg0",
      "body": "I would give anything to have smaller breasts instead of these giant... *things* that hang off me.\n\nMy husband loves them, everything about me, but I truly do despise them. I'm a DDD. It was fun for a bit, having larger breasts than most, until they began to sag as early as my mid-20s. Point being, the right person will love you just as you are, at every stage of your life, just as my husband loves my floppy fun bags no matter how much I wish I could be rid of them, lol.",
      "created_utc": 1722859947.0,
      "score": 16
    },
    {
      "id": "lgkxg4h",
      "body": "My fiancee said she has felt pretty self conscious about hers as well at a similar size. Idk. I feel like most men aren't nearly as fixed on big boobs anymore, but I could be wrong. Men love boobs in general, not just big ones. Size is not the most important thing. Hope this helps",
      "created_utc": 1722848840.0,
      "score": 8
    },
    {
      "id": "lgl4rgv",
      "body": "This was me when I was teens/early 20’s I never grew a y more but I did finally appreciate being able to go Braless and threw away my super padded bras…they were only whispering to me that I wasn’t enough. \n\nThrow away the stupid foam bras and enjoy a baby tee au natural…or with a lightly lined balconette bra 😊",
      "created_utc": 1722853682.0,
      "score": 5
    },
    {
      "id": "lgl7m86",
      "body": "[deleted]",
      "created_utc": 1722855351.0,
      "score": 5
    },
    {
      "id": "lgmmmhc",
      "body": "Look at how many women are talented, inspirational and beautiful with all size breasts! Small, medium, large… and none! Focusing more on looks and ‘beauty’, so many babes with very/small boobs and THEY ARE FUCKING BEAUTIFUL!! :)",
      "created_utc": 1722874817.0,
      "score": 5
    },
    {
      "id": "lgn4ksv",
      "body": "don’t overthink it. from a guy who could careless about boob size . anything more than a mouthful is too much. but we’re all our own worst critics. wish you well 🤞🏿",
      "created_utc": 1722880502.0,
      "score": 2
    },
    {
      "id": "lgn7pn3",
      "body": "I first thought of telling you that I and many of the men I know, prefer smaller boobs. And everyone I have ever talked to agrees that the most inportant aspect of boobs, is that they are there, and the boob you have access to is infinitely better than all other boobs : )\n\nBut that will not help you in any way. I think what has happened is that you have spent enough time to label this issue as infinitely heavy. The more you think of a problem the larger your brain will perceive it as.\n\nSo for you the answer is that any time you think about your breasts, you stop yourself. Not change the tone, not try to swith to being positive, just stop all thoughts about this. It will of course be hard to begin with. But with time you teach your brain to not go down this thought path.\n\nThen work on self worth and meaning in your life.\n\nI think you should definitely seek some kind of help with this.\n\nRumination focused therapy would be an obvious place to start\n\nSometime peoples worries are valid, some people have issues that are real barriers. Fortunately breast size is not one : ) For me at least, knowing that most of my perceived problems only exist in my head, helps tremendously.\n\nAnd if you use Instagram and look at a lot of SoMe profiles, delete those apps immediately, they especially make women and young girls mentally ill, check out Jonathan Haidt and what he says about instagram and girls",
      "created_utc": 1722881494.0,
      "score": 2
    },
    {
      "id": "lgn64q2",
      "body": "For many men, there is no such thing as a \"wrong\" or \"bad\"-sized breast.  Many of these same men fret over their penis size in the same manner thanks for years of being brainwashed by porn.\n\nPersonally, the only ones I never found attractive are the ones big enough to literally suffocate me.\n\nThere are plenty out there that will have absolutely no problem loving you exactly the way you are :)",
      "created_utc": 1722880989.0,
      "score": 1
    },
    {
      "id": "lgnci5w",
      "body": "I am 35m, I have literally never ever ever ever ever been disappointed by any set of breast's I have been shown",
      "created_utc": 1722883012.0,
      "score": 1
    },
    {
      "id": "lgnfh6r",
      "body": "I also have 34B breasts. Have most of my life. Not a single man I have ever been with has ever been upset with my breasts. Actually the opposite, if anything I've learnt that men just love boobs. All kinds of boobs, small ones, big ones, saggy ones, single ones, they just love boobs! \n\nNone of my partners have ever been anything other than excited to see my breasts and see me naked. Men are pretty simple, they just like boobies!;\n\nAnd if a man is anything but excited to see your boobs, he is not a man you need in your life. Those men are miserable, and have nothing better to do with their lives besides making others feel small.",
      "created_utc": 1722883958.0,
      "score": 1
    },
    {
      "id": "lgnoglm",
      "body": "34B is perfect and amazing. I'm not alone as a guy who feels this way.",
      "created_utc": 1722886832.0,
      "score": 1
    },
    {
      "id": "lgnp5fd",
      "body": "Honestly I like them all. The big thing is just finding someone to love and be loved.",
      "created_utc": 1722887052.0,
      "score": 1
    },
    {
      "id": "lgpd8os",
      "body": "The right person to love everything about you… is YOU. Stop waiting for the external love and find your inward love.",
      "created_utc": 1722907929.0,
      "score": 1
    },
    {
      "id": "lgpgybg",
      "body": "Sweetie trust me I feel the same way I have an A cup and want a boob job really bad but\n\nI'm a stripper and I promise you it does not matter how big your boobs are. I've never looked at Dancer and thought she looked less sexy than the other girls and I have to remind myself that too  \n\nI feel the exact same way less of a woman and it sucks so bad 😭 😔 they are just so much fun to play with I can't wait to get one",
      "created_utc": 1722909366.0,
      "score": 1
    },
    {
      "id": "lgs35k4",
      "body": "Everyone always talks about ass or boobs and I've never had a preference, as long as you look good in my eyes, there's no problem about what anyone else thinks.",
      "created_utc": 1722955907.0,
      "score": 1
    },
    {
      "id": "lgsw5xb",
      "body": "Also, not all men are big on breast's. Some guys like legs or 🍑 more",
      "created_utc": 1722964957.0,
      "score": 1
    },
    {
      "id": "lgtsx54",
      "body": "Just FYI, two weeks ago, I had to comfort my girlfriend (future wife) as she was literally crying because of her small breast size. But I truly love her breasts as they are, and I wouldn't like her to have bigger ones at all. No matter how much I've been trying to show her and persuade her that her breasts aren't just absolutely OK, but astonishing and perfect — she just cannot get past it. I indeed appreciate her small breasts, and she can see it every day. So, yeah, it's not about the size, it's about mentally getting past it. If you eventually come up with a smart way to get past it, please tell us as well, as I really cannot come up with ideas on how to persuade her =)",
      "created_utc": 1722975056.0,
      "score": 1
    },
    {
      "id": "lgl5h3a",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722854122.0,
      "score": 5
    },
    {
      "id": "lgo2yz5",
      "body": "34B is a really common size.",
      "created_utc": 1722891422.0,
      "score": 2
    },
    {
      "id": "lgs5jhw",
      "body": "I don't like big boobs. 34b is perfect.",
      "created_utc": 1722956672.0,
      "score": 1
    },
    {
      "id": "lgvn9no",
      "body": "They look small on me (?) if that makes sense",
      "created_utc": 1722998294.0,
      "score": 1
    },
    {
      "id": "lgle3yj",
      "body": "Well, I believe we are majority. Never have I met a guy who would turn down boob (any shape or size)",
      "created_utc": 1722858664.0,
      "score": 14
    },
    {
      "id": "lgmrx7e",
      "body": "But even if you had the boobs you wanted, you'd still never be *everyone's* type. No one is!",
      "created_utc": 1722876520.0,
      "score": 6
    },
    {
      "id": "lgnvxqd",
      "body": "Maybe it's an age thing? Boob size was a much bigger deal in high school because it's a bunch of teenagers who are horny and trying to impress their friends. I have *never* heard a guy complain about cup size, even when I was a teen. They don't actually care. If they do, you don't want to be around them anyways. \n\nUltimately, we're *told* that big boobs are more attractive. The statement gets parroted by guys and girls trying to act \"cool\" or gain attention. It's only a reflection of the porn industry, not reality. That's not to say that people don't prefer big boobs, but it's not as serious as it seems. No guy is going to lose interest because of your bra size. I promise. And trust me, you don't want the guys who go after a woman because she has a large chest. They're shallow and creepy and objectifying.\n\nBoobs are boobs, and you never complain about a pair of titties🤷‍♀️",
      "created_utc": 1722889202.0,
      "score": 2
    },
    {
      "id": "lgokt04",
      "body": "As long as a woman is _confident in herself_, everything about her is pretty.",
      "created_utc": 1722897410.0,
      "score": 5
    },
    {
      "id": "lgkhwin",
      "body": "Also sucks when I do yoga, can't really get into a position like i used too....i know what you're going through mentally, and with hindsight, falling in love with yourself and accepting yourself on a whole other level is key.",
      "created_utc": 1722838506.0,
      "score": 3
    },
    {
      "id": "lgljlx6",
      "body": "I have around 10 pounds that I would like to lose, but even when I when I was lighter I still had D cups. But because of them I never looked skinny, and I always felt bulky :S",
      "created_utc": 1722861153.0,
      "score": 3
    },
    {
      "id": "lgkm1va",
      "body": "❤️‍🩹❤️‍🩹❤️‍🩹 absolutely. You’re not alone",
      "created_utc": 1722841120.0,
      "score": 1
    },
    {
      "id": "lgkjzpm",
      "body": "working out will help improve the muscles lying under the breasts. this will help give them enhanced look, the tone , texture and firmness felt due to the muscles will make you feel confident. you might need to add some protein powder suppliments aimed at muscle building. you should easily make a gain of 1 inch with a decent regimen of 1 month exercises, focused on body muscle building on whole, with emphasis on chest .Just take care to not get injured.",
      "created_utc": 1722839816.0,
      "score": 3
    },
    {
      "id": "lgp68t2",
      "body": "You’re welcome hon. You’re right, but there are a few herbs and supplements that increase estrogen naturally, so if you haven’t looked at that angle, you could maybe do some research on those and give them a try just as an experiment. Obviously, if there was something that worked really, really well, implants wouldn’t exist, so you do have to rein in your expectations. \n\nI used fenugreek for breastfeeding and noticed some growth/firmness that was not associated with milk production itself (after taking it for a couple of months - it takes a while to work). Having said that, every body is different, so there’s no guarantees. It might be worth talking to your doctor. They likely wouldn’t prescribe you hormones just for increasing breast size, but they might get you to check your current hormonal levels and if there’s anything out of whack, prescribe you something to even out your levels. If you’re not currently on any birth control, they can help too (although, they might also cause generalised weight gain).\n\nAnyway, I wish you luck and just remember that boobs are boobs to guys, they’ll love them regardless and I’m sure you’ll find a partner who loves you unconditionally, even if your boobs literally fall off and run away 🤣🤗",
      "created_utc": 1722905260.0,
      "score": 1
    },
    {
      "id": "lgkmsql",
      "body": "Totally agree...I'm a bloke and have equal and opposite issues. I'm older, fatter (definitely dad bod+) and also have B cups!\n\nI am self conscious and plan to kick my own azz into shape...\n\nJust keep swimming swimming swimming... 😁",
      "created_utc": 1722841603.0,
      "score": 1
    },
    {
      "id": "lgkgueu",
      "body": "Ooof, that’s rough bro. Is it getting better for you now?",
      "created_utc": 1722837857.0,
      "score": 3
    },
    {
      "id": "lgkljb2",
      "body": "Yeah, I understand that. Sorry you feel that way though. It’s not easy to just be happy with yourself (I have my own issues), but I hope you will be happy one day. ✨",
      "created_utc": 1722840793.0,
      "score": 1
    },
    {
      "id": "lgl9i2a",
      "body": "i have aa cups too! im not saying they're bad at all, small breasts are the best imo. \n\ni just know that OP was wishing their b cups were bigger, so i was trying to point out that b's are actually a decent size. the \"hey at least u don't have\" was in regards to their specific dysphoria (& in comparison to what i have).\n\nsmall boobs are arguably better in many ways i already mentioned. but i understand wishing for more. kids would literally make fun of me calling me \"captin of the itty bitty titty committy\" growing up, & when my partner first saw my tits he said \"wow i didn't know they even came in this size\". i've always been self-conscious of it but learned to just embrace it.\n\nplus if someone genuinely cares abt u they wont care at all that ur a double a",
      "created_utc": 1722856370.0,
      "score": 1
    },
    {
      "id": "lgkgxqj",
      "body": "Don’t settle for anyone less. I feel very lucky to have such a great husband, and he’s great in so many ways, but I worry that people worry that good men are too few and far between to hope for. I think they are to only men to be considered!  \n\nAnyway, your chest size and anything else you dislike about yourself is not the flaw you think it is. I promise. ❤️",
      "created_utc": 1722837912.0,
      "score": 4
    },
    {
      "id": "lgl0yx3",
      "body": "Yea, he’s very like “old school”, and openly says what he thinks…I call it learning by fire 😅 and legit!!! In school, I’d wear massive push-ups and, when I got my first bf, it was a whole massive confession for me to tell him they’re not real 😅 horrendous day but I don’t think he minded. He was probably more happy to just have a girl at that point 🤣 \n\nYee, I’ve found that attitude has helped my mental health so much…even setting realistically obtainable goals for yourself and your appearance/ skills/ anything is amazing because you’ve got that constant sense of progress and fulfilment 😊\n\nAnd, no problem, I’m glad I could be of service, although I tend to ramble on quite a bit😁",
      "created_utc": 1722851264.0,
      "score": 1
    },
    {
      "id": "lgmriyy",
      "body": "i mean i’m bias, im bi and also had a traumatic dream about nipples once, that’s why if i do like boobies, they are As or Bs :pp",
      "created_utc": 1722876395.0,
      "score": 1
    },
    {
      "id": "lgn8qi0",
      "body": "idk where you live but 165 cm is exactly average for women all over the globe, not tall, I think you are suffering from Body dyspmorphia or some fool put in your head that you are \"ugly\". I don't know how you look, but from the description b cups look amazing for you, exactly perfect, more than that would look kinda weird for an average built body. You are prob very attractive, don't listen to media and trends, they want everyone believe that only fucking z cup is good enough, so you buy boob job from them. It's business sadly",
      "created_utc": 1722881819.0,
      "score": 1
    },
    {
      "id": "lgn6moy",
      "body": "Well you fall in a very average size. Are you comparing yourself to large breasted women? \n\nIt's the same as comparing yourself to someone who's a dress size smaller or someone who has the bone structure you wish you had. Some outside force always sparks the insecurity in us, but we have to learn to love our natural bodies.\n\nBreast implants are dangerous, and not all it's cracked up to be. I know many women who wish they never did it. There can be complications and big expenses years down the line when a leak/tear happens. Very painful as well.\n\nI have a million things I hate about my body but I try to stop comparing myself to other women who have the [insert physical feature here] that I wish I had. Have you tried therapy for this? That could really help",
      "created_utc": 1722881149.0,
      "score": 1
    },
    {
      "id": "lgnsmbr",
      "body": "Don't be harsh on yourself and don't put yourself so down and minimize yourself to boobies (don't get me wrong, boobies are great however they come), I am sure you are more than just this, you are a whole person with ideas, thoughts and dreams. And don't accept ideas that makes you hate the fact that how you look is something that needs to be changed to be accepted by others. EVER.",
      "created_utc": 1722888152.0,
      "score": 1
    },
    {
      "id": "lgo4g8s",
      "body": "Honestly it does, lol. Thank you. I’ve just never seen it before. I always wonder why they ended up the way they are lol. \n\nI’m sure your boobs are awesome! Can’t really go wrong with boobs 🤣",
      "created_utc": 1722891892.0,
      "score": 2
    },
    {
      "id": "lgp2hvk",
      "body": "I have a lot of trouble finding bras in that size bc normally 38 has a bigger cup size but I'm too small for a c cup.  Honestly I've given up underwire altogether and if you think about it if we were bigger we probably wouldn't be able to get away with that!",
      "created_utc": 1722903851.0,
      "score": 1
    },
    {
      "id": "lgp9xxb",
      "body": "Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722906669.0,
      "score": 0
    },
    {
      "id": "lgkohk6",
      "body": "Not trolling I’m just a stupid guy",
      "created_utc": 1722842715.0,
      "score": -1
    },
    {
      "id": "lgkooby",
      "body": "I adore smaller boobs. They never sag and they are always perfect. Don’t worry about it. You find someone like me one day. I promise\n\nEdit: that sounded narcissistic.. sorry for that",
      "created_utc": 1722842843.0,
      "score": -1
    },
    {
      "id": "lgkzgjf",
      "body": "Okay, saying big equals saggy? Harsh.",
      "created_utc": 1722850233.0,
      "score": -2
    },
    {
      "id": "lgncdiy",
      "body": "Youre not alone, while I'd date someone no matter the size of their chest, if asked, I'm more attracted to smaller breasts. I just find them more visually appealing",
      "created_utc": 1722882971.0,
      "score": 21
    },
    {
      "id": "lgqxvm3",
      "body": "[deleted]",
      "created_utc": 1722938482.0,
      "score": 2
    },
    {
      "id": "lgtpjoz",
      "body": "Yeah, same, as for me, small are aesthetic and… handy.",
      "created_utc": 1722974016.0,
      "score": 1
    },
    {
      "id": "lgs3vg6",
      "body": "Now that you mention it there does seem to be more Attention on big boobs when clothed and small boobs when topless, I've only just realised this.",
      "created_utc": 1722956135.0,
      "score": 1
    },
    {
      "id": "lgmfq5s",
      "body": "Hahaha exactly.",
      "created_utc": 1722872602.0,
      "score": 1
    },
    {
      "id": "lgmtnao",
      "body": "At least learn some\\* self-love first.  Seeing that others value things about you can be helpful, it just cannot be the only reason we feel good about ourselves.  Self-esteem takes more time than self-love, in my experience.  It starts with self-compassion, which takes deliberate practice.",
      "created_utc": 1722877066.0,
      "score": 3
    },
    {
      "id": "lorhwtk",
      "body": "Thank you ❤️‍🩹",
      "created_utc": 1727216115.0,
      "score": 1
    },
    {
      "id": "los52zl",
      "body": "Hi! I am watching Jonathan Haidt right now and god bless you. Thank you for being one of those rare humans of magic. Thank you for putting me on this and making me think I’m not alone thinking all of this :) ",
      "created_utc": 1727224574.0,
      "score": 1
    },
    {
      "id": "lgku1k6",
      "body": "Yes, but the Office job doesn't help xD. I'm going semi regularly to the gym now (a few months ago two times a week but now i dont have the time or desire to go as often😅) Warm-up and cool down stretching and proper execution + making sure that counter muscles are also trained helps a lot. \n\nBackpain in my everyday life is becoming less and less, but if i lift/carry something or use a backpack thats more than a few kilo's it still starts to hurt.\n\nI often have problems with people not understanding/believing me that i have real back pain from a backpack or carrying things and aren't just complaining about it because I'm lazy. Most of the time my strength would be more than enough but because of the pain I can't do it lol\n\nHappy cakeday",
      "created_utc": 1722846503.0,
      "score": 1
    },
    {
      "id": "lgkzma3",
      "body": "Ofcourse not all big boobs are saggy, I’m just saying they’re more prone to sagging than smaller ones",
      "created_utc": 1722850345.0,
      "score": 1
    }
  ]
}