{
  "id": "1kd8thp",
  "title": "My wife is pregnant and it feels like she’s living in a different world. I’m trying to be strong but I’m confused",
  "selftext": "Okay so I love my wife. Deeply. and now that she’s pregnant… she has become something else entirely. Like… I don’t even know how to describe it.\nShe won’t go outside. I mean that literally. Not to the store, not to touch grass, not even to church. She’ll say “the ground isn’t safe for the baby” or “they’re gonna wish bad on the baby” and she won’t let go of me until I take her home.\n\nShe won’t say hi to anyone, absolutely hates random men oh forget it… doesn’t like people just wants to go home \n\nShe eats in corners of the house. actual corners. facing away from me.. She eats full pizzas, bread, cookies, whatever she wants, gets it all over her face, and says “I’m not wiping it” if I try to help.\n\nShe cries and says “I’m pregnant” at random times like mid-text, mid-laugh, mid-anything and I just stand there like… yes baby, I know. She won’t let me touch her belly 99% of the time, but clings to me the rest of the day \n\nSometimes she tries to copy everything I do. One time I was smoking a cigar and she grabbed it out of my hand like “what’s that?” and tried to do it too\nShe makes me carry her into the house like royalty. If I say “let’s go inside,” she says she’s dizzy (she’s not), pouts, and won’t move until I pick her up. Then laughs like she won.\n\nShe says she’s happy. And I believe her. I’m not exhausted, just confused. I want to be the best partner I can, but I’m still learning how to navigate… this.\n\nIs this normal? ? I’ve never seen anything like it.",
  "created_utc": 1746212222.0,
  "score": 380,
  "num_comments": 318,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1kd8thp/my_wife_is_pregnant_and_it_feels_like_shes_living/",
  "comments": [
    {
      "id": "mq8zdhj",
      "body": "She needs to see a psychiatrist. Sounds like it could maybe be pregnancy induced psychosis",
      "created_utc": 1746213546.0,
      "score": 1659
    },
    {
      "id": "mq8ylkm",
      "body": "You need to take her to therapy.",
      "created_utc": 1746213313.0,
      "score": 310
    },
    {
      "id": "mq90jdt",
      "body": "Talk to her obstetrician at her next prenatal appointment.    This is serious stuff that needs to be looked into.",
      "created_utc": 1746213892.0,
      "score": 182
    },
    {
      "id": "mq98bri",
      "body": "I can see you think other commenters are being drastic by suggesting she may be experiencing psychosis, but as a mental health professional that’s worked with hundreds of people in psychotic episodes, what you’re describing isn’t far off at all from how I’ve seen people present. \nYou may be picturing some stigmatized, stereotypical version of what psychosis looks like, but I can tell you, it starts with small shifts in belief systems, isolation, anxiety with situations that wouldn’t typically cause the person to become anxious. Exactly everything you described. The hormonal shifts that occur during pregnancy can and do cause things like this to happen. Even my MANAGER, who’s the manager of all mental health services in the building I work in, experienced psychosis during one of her pregnancies, and she’s a very high functioning individual with no other history of mental health issues. \n\nThere’s no way for you to know for certain what’s going on without consulting with a mental health professional. These things don’t magically get better on their own, they almost always progress for the worse.",
      "created_utc": 1746216214.0,
      "score": 169
    },
    {
      "id": "mq95zhk",
      "body": "This has to be rage bait. But if it’s not, your wife and unborn child are in danger, it could be psychosis or at the very least agoraphobia which is also a mental illness. Be there for her by taking her to see a professional - urgently. Bring it up at her next doctors appointment and see what they say.",
      "created_utc": 1746215520.0,
      "score": 340
    },
    {
      "id": "mq95g7u",
      "body": "OP…It sounds like you’re delusional too? I get that you love her but you have several responses in here saying there’s something seriously wrong there.\n\nShe needs therapy/help. I’m not even one to go to doom&gloom but buddy none of that sounds remotely ok.",
      "created_utc": 1746215360.0,
      "score": 718
    },
    {
      "id": "mq917tk",
      "body": "This sounds like a serious shift, you need to have her seen asap. \n\nHow far along is she? \n\nHas she been going to her appointments? Can you go with her?",
      "created_utc": 1746214095.0,
      "score": 77
    },
    {
      "id": "mq92kd0",
      "body": "Agree with the other comments, you need to get her some help fast before this gets worse. She definitely needs to see a psychiatrist, therapist, or her OB as soon as possible.",
      "created_utc": 1746214499.0,
      "score": 81
    },
    {
      "id": "mq96jaj",
      "body": "She needs psychiatric help. She is having distorted thoughts and it’s not something to brush off.",
      "created_utc": 1746215684.0,
      "score": 77
    },
    {
      "id": "mq9h7m7",
      "body": "Wife behaves abnormally and husband still claims nothing is wrong…all in the mental health sub. \n\nOkay, Rusty Yates.",
      "created_utc": 1746218836.0,
      "score": 114
    },
    {
      "id": "mq96wkv",
      "body": "I know u said she’s usually stand offish, but her not letting u touch her belly, saying “they’re gonna wish bad on the baby”, and her EATING IN CORNERS sounds pretty wild to me. And also wanting to smoke the cigar??? I think the best thing to do for her safety is to get a psych screening",
      "created_utc": 1746215792.0,
      "score": 58
    },
    {
      "id": "mq9afev",
      "body": "Pregnancy induced psychosis is a real thing and it's very dangerous for mother and baby. Call her OBGYN and ask for an assessment for it.",
      "created_utc": 1746216838.0,
      "score": 34
    },
    {
      "id": "mq9fcvq",
      "body": "-Nobody is criticising you or your wife OP. Honestly.\n-The fact that you brought this to a mental health sub and you say you have never seen anything like it means you know there is something going on.\n-Please take some life advice from someone who has socks older than you- sometimes in life we have to do things that others may resent at the time because they are the RIGHT thing to do. They won’t thank us at the time and that hurts, but they will thank us later.\n-In the long run you have nothing to lose and everything to gain by just having your wife assessed by a Psychiatrist. A therapist at this point isn’t going to cut it. If she proves herself right, fantastic. If she needs help, she gets it.\n-After 26 years of mental health experience, I know this is hard, honestly I do, but let me tell you that the behaviour you describe is not normal and I think you know that. \n-Do the right thing, have the hard conversations; that’s how you are truly there for your wife. \n-Remember, no one on here has any reason to lie to you or to over-inflate anything, but when you know, you know with these conditions. \n-Sending you and your wife so much love. Xx",
      "created_utc": 1746218292.0,
      "score": 32
    },
    {
      "id": "mq9rmfb",
      "body": "Friend, after looking at some of your responses, I'm kinda confused about what you want us to say?\n\nYou came to a mental health subreddit asking questions about your wife who is clearly not acting like her normal self nor like a normal pregnant women and you are frustrated when people tell you that your wife is indeed not acting normal? \n\nAnd when people suggest that she should talk about it to a doctor because this could turn sour REALLY fast, you just laugh? \n\nI'm having a hard time understanding what it is you sought here? Confirmation that everything is peachy and rosy, nothing is wrong, and keep going, it will be over in about 18 months when her hormones finally return to normal after giving birth? Because that is in no way a guarantee especially after everything you described. \n\nYou'd better be safe that sorry and consult a doctor about this and hide nothing about her anxieties and delusions just to make sure it is not the beginning of something much more serious.\n\n\nOf course, it's impossible for us to know what is going on, people were recommending to consult a doctor to rule out the worst case scenario that we know about.\n\nPostpartum psychosis is a real thing. Despite the name, it can happen long before birth and it can happen in anyone, not just mentally ill or sad people. Healthy women can suffer from it for no reason aside from bad luck. And it is considered a medical emergency due to the very high risk of danger for the mother and baby. The danger doesn't stem from depression and the desire to end it. It's psychosis. It's not rational. It's delusions that leads to the false belief that death is the best outcome for the family. Like opening the gates to paradise, or defending the baby from an innocent bystander that was just walking by but the delusional mom perceived them as a threat. \n\nYes a woman can turn 'crazy' just by being pregnant. It's treatable, but it's better to act fast and not wait for bad things to happen. Which is why people suggested you get her checked out. Best case scenario, she is totally fine and we were wrong and it's something else. But at least you protected her from the worst",
      "created_utc": 1746222048.0,
      "score": 30
    },
    {
      "id": "mq9br8n",
      "body": "Gosh I fear for the baby. This is not normal and can get a lot worse after she gives birth. She needs help ASAP",
      "created_utc": 1746217232.0,
      "score": 27
    },
    {
      "id": "mq94ilp",
      "body": "If she’s unable/unwilling to leave the house, book an online appointment with a therapist for her/the both of you. Other comments are correct. Understand you’re trying to keep the peace in your marriage, but this is not normal behavior and absolutely WILL affect the baby who is helpless to advocate for themselves. Please take the advice and ask her to do what is best for your family.",
      "created_utc": 1746215080.0,
      "score": 19
    },
    {
      "id": "mq9ti9b",
      "body": "I thought she was weird but after reading your replies it seems like you're not that great either. You're in denial and refusing to take action is enabling her. What is your purpose posting here if you think seeking MENTAL HEALTH HELP is out of the question and \"overboard\"? If everything you mentioned is true, then your wife and the baby need real help, because she might hurt the baby for any random psychotic reason and you'll be an accomplice. Don't fuck up.",
      "created_utc": 1746222656.0,
      "score": 22
    },
    {
      "id": "mq9iwaw",
      "body": "I keep seeing the poster say “they invite family over” like an intervention. How overwhelming for the pregnant mother if she is already experiencing these other thoughts and symptoms. At the next pregnancy appointment is the appropriate time to be her advocate and talk to the doctor about mental health during pregnancy.",
      "created_utc": 1746219332.0,
      "score": 19
    },
    {
      "id": "mq9thqf",
      "body": "Ragebait",
      "created_utc": 1746222651.0,
      "score": 19
    },
    {
      "id": "mqajdyq",
      "body": "I’m almost entirely convinced that this is a troll post based on your responses alone, but as someone who works in mental health, this *does* sound like psychosis.\n\nThinking “the ground” is going to harm her baby and that people are going to harm her or wish ill on her, general paranoia, eating in corners of the house facing away, these are all pretty clear signs of psychosis. You keep saying she’s “joyful” but that does not have anything to do with psychosis, people in psychosis are often joyful because they *don’t know they are in psychosis*\n\nYou *need* to take her to a doctor or have one come over if you want her and the baby to be healthy. Pregnancy induced psychosis is not that uncommon and post-partum psychosis is not either so this could very well worsen after the baby is born.\n\nIf this isn’t a troll post, what did you hope to get out of this, exactly? You seem incredibly resistant to advice and resistant to do anything to step in and actually help your wife.\n\nShe needs more support than you’re capable of giving right now. She needs professional help.\n\nDo the right thing.",
      "created_utc": 1746231618.0,
      "score": 19
    },
    {
      "id": "mqah6t4",
      "body": "OP has some major Russel Yates vibes. You remember, the women who drowned all five of her children in the bathtub because she was so intensely out of her goddam mind with post partum psychosis? Meanwhile her husband just kept pumping babies into her, despite multiple suicide attempts and nervous breakdowns, the obvious complete crumbling of her mental state, and multiple doctors telling them both and particularly him that something horrible would happen if she kept having babies. But he didn’t listen, he “knew his wife”, and then one day his mom comes to their house to find that in the hour between him leaving for work and grandma getting there, she had drawn a full bath, and taken each child one by one into the bathroom and held them underwater under they were dead. \n\nBut I’m sure the eating in corners and absolute agoraphobia, spontaneous outbursts of inappropriate emotions, irrational beliefs, paranoia, and delusions are just funny little quirks with her, not desperate screams for help from a malfunctioning brain to the one person who is supposed to protect her and be there for her, always.",
      "created_utc": 1746230807.0,
      "score": 17
    },
    {
      "id": "mq9jaat",
      "body": "Please copy and paste everything you said and send it to a psychiatrist or psychologist",
      "created_utc": 1746219445.0,
      "score": 17
    },
    {
      "id": "mq9udut",
      "body": "OP what does mental illness look like to you? What do *you* think psychosis is? You came asking for help and are now mad at the people telling you there is 10000% an issue. Normal, healthy people aren’t scared of the *ground* hurting their babies, they don’t sit in corners and shun themselves to eat, and they don’t cut off their access to the outside world. Get her help or you’re going to find yourself making funeral arrangements for one (or both) of them before too long.",
      "created_utc": 1746222941.0,
      "score": 15
    },
    {
      "id": "mqa3erd",
      "body": "Comes to mental health subreddit, describes mental health issues about his wife, denies any mental health issues. \n\nWhy are you in this subreddit if it’s not mental? Go to pregnancy subreddit and see what answers you get. Betting they will be the same or similar.",
      "created_utc": 1746226029.0,
      "score": 15
    },
    {
      "id": "mq9r3k1",
      "body": "You're an active bystander to her meltdown... She needs acute attention.",
      "created_utc": 1746221880.0,
      "score": 14
    },
    {
      "id": "mq9zfma",
      "body": "Well, you might as well delete this post OP. You asked for help and don't like the advice. \nI feel bad that your wife has to rely on you and you're oblivious to see the symptoms.",
      "created_utc": 1746224645.0,
      "score": 12
    },
    {
      "id": "mqa4l4u",
      "body": "This poor child is gonna have to deal with two delusional parents.",
      "created_utc": 1746226436.0,
      "score": 12
    },
    {
      "id": "mqam9s1",
      "body": "I was also happy and bubbly as you put it, but when my son was born every time he’d fall asleep I’d freeze… deathly afraid to move…Convinced someone would come kill us or burglarize our apartment. I was losing so much sleep because of it. The mild psychosis plus the lack of sleep sent things into over drive. I started having super intrusive thoughts about my kid, not hurting him necessarily but it could’ve gotten to that point if I didn’t have such an amazing supportive partner to get me help. BE AN AMAZING SUPPORTIVE PARTNER and GET HER HELP. \n\nDo it, with her maybe a little annoyed with you or don’t 🤷🏻‍♀️ and risk something bad happening to her or your baby. And then live with that for the rest of your life. Thats your choice buddy.",
      "created_utc": 1746232667.0,
      "score": 12
    },
    {
      "id": "mq9w6qs",
      "body": "This has to be rage bait with the replies from OP",
      "created_utc": 1746223538.0,
      "score": 9
    },
    {
      "id": "mq94tdt",
      "body": "Before your next checkup, talk to midwife or doctor upfront so they could help arrange a professional during the checkup? He/she can ask questions to BOTH of you and TALK to her.that is how a therapy session starts. This way you don't look hostile because she doesn't know you started it? This sound really something to be discussed with a professional.",
      "created_utc": 1746215170.0,
      "score": 9
    },
    {
      "id": "mqa3qhv",
      "body": "Op comes here asking for advice. Gets real advice. Proceeds to double down and be a shit person.",
      "created_utc": 1746226143.0,
      "score": 9
    },
    {
      "id": "mqa5rzn",
      "body": "Based on this bizarre post and OP's ignorant asf responses to appropriate and helpful advice on the whole matter...I call bullshit on OP! Not even a real situation.....go kick rocks!",
      "created_utc": 1746226840.0,
      "score": 10
    },
    {
      "id": "mqa1w6t",
      "body": "From this post and all your replies to people giving genuine advice, it sounds like you BOTH need some help",
      "created_utc": 1746225502.0,
      "score": 7
    },
    {
      "id": "mqag5d4",
      "body": "I think she sounds like she needs to talk to her dr.. I’d be worried about her mental state and ppp… \nhttps://my.clevelandclinic.org/health/diseases/24152-postpartum-psychosis I had it, severely. It is postpartum psychosis before you give birth basically but.. plz talk to her dr. Edit: I understand that people always talk about pp depression or psychosis after, but during pregnancy is real… I know. First hand. She’s disillusioned it seems like…& fits ppp perfectly, plz talk to her dr. Even alone first if that’s best, idk but I know she needs help.",
      "created_utc": 1746230427.0,
      "score": 7
    },
    {
      "id": "mq9kv1k",
      "body": "Tell this to a psychiatrist, even on Reddit. Then you'll see what they'll tell you (hint: that she needs psychiatric evaluation) Otherwise this is just bait, judging by your comments. ",
      "created_utc": 1746219923.0,
      "score": 7
    },
    {
      "id": "mqa7360",
      "body": "If you’re not a troll and this is real, I have no idea how any of us can help you or what you wanted from posting this. In your post you cite concerning behavior and acknowledge that this isn’t her norm. But in your comments you act like it’s not a big deal. Which is it?  \n\nThere is really nothing you can do that will help her except get her help from a professional",
      "created_utc": 1746227289.0,
      "score": 8
    },
    {
      "id": "mqaem14",
      "body": "She IS living in a different world.  Her body and mind are being absolutely WRECKED right now.  And there’s the major chance it will never go back to “normal”, physically or mentally.  She potentially needs medical and psychological help.  But, most of the medication that could help she can’t take, because she’s pregnant.\n\nPregnancy isn’t sunshine and rainbows.  It’s not “cute”.  Your wife is currently and technically harboring a parasite that is leeching every available resource in her body and brain at all times to ensure its survival while harming her (the “host”) at all costs.  It will drain the calcium from her bones, rearrange her organs into places they were never intended to go, suck up every ounce of nutrients she consumes, and has the possibility to break her pelvis, spine, and completely rip her body apart from front to back “down there” (or the doctor can cut her with scissors from her vag up into her butt cheek - research “transverse episiotomy”) when it bursts out of her.   It’s not a “miracle” (happens daily hundreds of thousands of times across the globe) and it’s not “beautiful”.  It’s *brutal*.\n\nJust wait until the baby gets here.  You think it’s bad now?  *It gets worse.*\n\nPlease seek all the medical and psychological help she needs.  She is going to need a LOT of assistance after birth, as she’s going to have a wound the size of a dinner plate in her abdomen for months, among other injuries.  Do not pooh-pooh anything your wife is going through, take it seriously.  Gestating and birthing a baby can be an extremely traumatic experience, let alone having to endure being physically fed upon for years via breastfeeding (if she’s able).  One that she will be reminded of every single moment of every single day of the rest of her life.  Because “parenthood” is a permanent condition.\n\nAnd remember - this is *not* about you or your fee fees.  Once baby gets here, you are “back burner” at best, for the foreseeable future.  Your life is now making sure mom is okay, and baby is okay.  You both made an intentional decision to go through this.  All you did was orgasm.  She has to do literally everything else.  So support her, love her, help her.  Anything you think you’re going through does not compare one iota of what she’s about to go through.\n\nYour life as you knew it was over the moment she told you she was pregnant.  You will likely never get your “old life” back, and she most certainly never will.  Again, parenthood is permanent, and does not end after 18 years.\n\nI wish you and your wife all the best in your new lives as parents.  I hope baby is healthy and that your wife is able to emerge without lifelong trauma and ruin.  And if she doesn’t, for goodness sake please don’t abandon her to the existence you have half a hand in subjecting her to.\n\nYou should both peruse the Regretful Parents sub, there is much support there for both women and men who are struggling with the mental health issues they experience due to having children.  Even if you don’t regret the decision to birth babies, they are a safe place to seek advice with many sympathetic listening ears.  It’s a great support group for struggling parents of all stages.\n\nGood luck, OP.",
      "created_utc": 1746229887.0,
      "score": 8
    },
    {
      "id": "mqbc9pd",
      "body": "Whats the point of posting when you’re dismissing and laughing at everyone telling you your wife needs serious help??? Would you like us to just lie and tell you “no don’t worry that’s perfectly normal and fine behavior” or what‽ Your wife needs to seek professional help from a psychiatrist, that’s if this post is even serious..\n\nThis is either 1) stupid rage bait/trolling 2) you’re really young and too naive to listen to advice 3) you’re a full grown adult that’s being willfully ignorant",
      "created_utc": 1746242698.0,
      "score": 7
    },
    {
      "id": "mq9p48n",
      "body": "Have you ever heard of *science* ? \n\nAssuming you’re not married to a Robot, we (Humans) are a bit complicated .. we are controlled by *Hormones* .. (Mind Blown) !! \n\nYour wife is experiencing pregnancy induced psychosis .. \n\nDo you want to help her ? She needs to see a psychiatrist ..",
      "created_utc": 1746221247.0,
      "score": 12
    },
    {
      "id": "mqa676x",
      "body": "Either your wife is very immature and childish, or she’s having a psychotic break. This is not normal behavior. By you posting this OP, you have come looking for advice. People are giving it to you, and you’re denying anything is wrong, which contradicts you even posting here. Don’t post looking for others opinions, and then ignore them.",
      "created_utc": 1746226985.0,
      "score": 5
    },
    {
      "id": "mqa8ciq",
      "body": "Bait or actual hollowed out cranial cavity. Call it.",
      "created_utc": 1746227718.0,
      "score": 6
    },
    {
      "id": "mqachpf",
      "body": "This is fake or weird.",
      "created_utc": 1746229141.0,
      "score": 6
    },
    {
      "id": "mqa2nvs",
      "body": "It’s funny that you post this fake rage-bait story, and then so easily give yourself away in the comments as not being serious. Find something better to do, cuz you’re not good at this.",
      "created_utc": 1746225771.0,
      "score": 5
    },
    {
      "id": "mqadwqu",
      "body": "Dude asks for help and then shuts down every smart piece of advice given",
      "created_utc": 1746229638.0,
      "score": 4
    },
    {
      "id": "mqae8dl",
      "body": "Why are you even here if you're going to refuse to acknowledge that she's clearly mentally ill??",
      "created_utc": 1746229754.0,
      "score": 4
    },
    {
      "id": "mqaiwz3",
      "body": "Her eating behavior is from a horror movie. She needs help",
      "created_utc": 1746231444.0,
      "score": 5
    },
    {
      "id": "mqaqooe",
      "body": "Sounds like perenatial depression. Please talk with her doctor about this and get her help. Do you have a support system around you? You will need help once the baby is here.\nI am sending you so much love. This is normal.. it happens. You just need to get a hold of it. 🩷",
      "created_utc": 1746234270.0,
      "score": 6
    },
    {
      "id": "mqb2epq",
      "body": "I love how this guy has asked for advice, and is now ignoring all of the advice people are giving him.",
      "created_utc": 1746238671.0,
      "score": 6
    },
    {
      "id": "mqb3030",
      "body": "This has to be rage bait.",
      "created_utc": 1746238901.0,
      "score": 5
    },
    {
      "id": "mqb31fr",
      "body": "This is some kinda shit post.",
      "created_utc": 1746238916.0,
      "score": 5
    },
    {
      "id": "mqbk6vy",
      "body": "this has to be bait, no way you wouldn’t already be getting her help at this point, and no outside folk ( her friends / family ) are concerned about where their pregnant friend/sister/daughter/cousin went when she suddenly stopped going outside? idk",
      "created_utc": 1746246249.0,
      "score": 5
    },
    {
      "id": "mqcfs12",
      "body": "Why you putting an outrageous rage bate post on a mental health sub? Please go away",
      "created_utc": 1746264819.0,
      "score": 5
    },
    {
      "id": "mq9x2ug",
      "body": " This sounds very false.",
      "created_utc": 1746223839.0,
      "score": 4
    },
    {
      "id": "mqa8kz0",
      "body": "Both of you need help.",
      "created_utc": 1746227798.0,
      "score": 5
    },
    {
      "id": "mqae9fw",
      "body": "you asked if her behavior is normal (it’s not) and then get defensive in all your responses…",
      "created_utc": 1746229764.0,
      "score": 4
    },
    {
      "id": "mqajw7i",
      "body": "Russell? Is that you?",
      "created_utc": 1746231804.0,
      "score": 3
    },
    {
      "id": "mqamziw",
      "body": "u/bot-sleuth-bot",
      "created_utc": 1746232926.0,
      "score": 3
    },
    {
      "id": "mqanp8m",
      "body": "Three months ago I had to explain to my best friends family he was going through psychosis. I called the ambulance. I went to the ER with him. I watched him fall deeper and deeper into insanity for a year completely useless in helping him. \n\nHe hasn't gotten better. Cut me off, continued taking drugs and gets worse by the day.\n\nMy father committed suicide from psychosis when I was 6 years old. This is fucking serious you tosser.\n\nGrow the fuck up and take this seriously. Nothing you write here makes any sense and is extremely concerning, as in I'd have called the ambulance already. This is either a disgusting wind up from a nobody or you are genuinely the biggest sausage going. Go help your wife you saucepan.",
      "created_utc": 1746233185.0,
      "score": 3
    },
    {
      "id": "mqao2u2",
      "body": "I really hope this is a fake account and story because OP is in denial in every comment here. Not sure why he even asked for an opinion if he’s not even willing to consider the answers and advice some people gave here. A few resources, OP:\n\nhttps://www.oxfordhealth.nhs.uk/wp-content/uploads/2014/10/AM-021.14-EIS-Psychosis-associated-with-pregnancy-and-birth.pdf\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9864993/\n\nRemember, you have nothing to lose if she gets evaluated by a psychiatrist, but everything to lose if she doesn’t.",
      "created_utc": 1746233323.0,
      "score": 4
    },
    {
      "id": "mqat1pp",
      "body": "Op needs a shrink too",
      "created_utc": 1746235147.0,
      "score": 5
    },
    {
      "id": "mqaysy8",
      "body": "As a cis woman who's been pregnant twice, I thought that your post based on the headline alone was going to be way different than the reality of the situation. \n\nDefinitely take her to a psychiatrist ASAP. This sounds much more complicated rather than her just being more emotional than her usual, non-pregnant self.",
      "created_utc": 1746237289.0,
      "score": 5
    },
    {
      "id": "mqbk9hl",
      "body": "I beleive you need to consult a psychiatrist and gyne as well. They can guide you what's best",
      "created_utc": 1746246285.0,
      "score": 5
    },
    {
      "id": "mqcb5xn",
      "body": "even without knowing how she was before the pregnancy, this is no where near normal at all.\n\ntake your wife to a doctor, before things worsen.\n\nETA: after reading your replies to people trying to help you, your wife, and your unborn child .. why did you even post on here (a mental health sub ????) if you didn’t want any advice on a possible mental health issue that may be affecting both your wife and your unborn child ? very strange ..",
      "created_utc": 1746261844.0,
      "score": 3
    },
    {
      "id": "mq9ir53",
      "body": "Get her some help, or don’t. It’s up to you. \n\nWe really don’t care.",
      "created_utc": 1746219290.0,
      "score": 10
    },
    {
      "id": "mqa69o1",
      "body": "Look, I know you are worried and you don’t want to raise alarms if they are not needed. I know you also don’t want to see her as mentally ill because she is bubbly all around, as you say, but please keep in mind that everyone here is really trying to give you solid advice so you can navigate a new and confusing experience with the best assistance and in the best way, and the way to do it is take her to her OBGYN, which she might agree to see first (she has too anyway), and tell her everything you said here, proceeding from there (probably with therapy and a psychiatrist).\n\nJust try to keep an open mind about what people are telling you, ok? Hormones really make a huge difference, as you can see, and it’s just best to be safe than sorry. Also, being bubbly/happy and having a mental issue/episode are definitely two things that can coexist.\n\nYour wife just needs a lot of medical attention, and your way to support is to be the one to get her that attention now. Best of luck, OP!",
      "created_utc": 1746227009.0,
      "score": 3
    },
    {
      "id": "mqcd9ox",
      "body": "You need to get her help asap. I’m just recovering from postpartum psychosis and was so close to dying. There’s a reason it’s classed as a medical emergency. Whilst she’s not postpartum yet she could have a psychosis or other significant mental health issue.",
      "created_utc": 1746263187.0,
      "score": 3
    },
    {
      "id": "mqclc8w",
      "body": "I don't like how much you value your wife being \"joyful and soft\" like that's all that matters. or how you see her as very young. you want a younger, less experienced, compliant woman to mold into whatever shape is useful to you. you knocked her up bc why not, and you obviously don't give a fuck about the consequences of that. your wife cannot parent a baby in her mental state, and I doubt you'll help. you want a soft little homemaker or whatever. I'm more concerned with the wellbeing of your wife and whether or not you're going to respect her, but also, your baby is in danger. your wife is almost definitely experiencing psychosis, it won't magically get better, and you're fine with putting the most vulnerable of humans in her care. that's cruel to the baby.",
      "created_utc": 1746268218.0,
      "score": 3
    },
    {
      "id": "mqdk9dl",
      "body": "Not normal. She needs to see a doctor.",
      "created_utc": 1746282720.0,
      "score": 3
    },
    {
      "id": "mqfb5cb",
      "body": "OP is another Russell Yates in the making.",
      "created_utc": 1746302521.0,
      "score": 3
    },
    {
      "id": "mqhbaoe",
      "body": "Fyi, having psychosis can happen to anyone under right conditions. It doesn't mean \"something is wrong with her\" in general, it means something is making her sick right now.\n\n\nYou had plenty of good advice so far, she needs a professional help to assess her condition. \n\n\nPsychosis related to pregnancy can be lethal for both mom and the baby, because she is being delusional.\n\n\nAs a person that experienced psychosis, it is an altered state of mind and can be very dangerous because you're basically in your own world and see everything in a distorted way (like paranoia about getting harmed by random people, as you described). People in that state can be danger to themselves and/or people around. There's no \"normal\" logic in the behavior, you can decide to boil own hands because you feel cold, for example. You seem to take it very nonchalantly and argue nothing is wrong despite coming here to confirm something is indeed wrong.\n\n\nEither this or your house has a gas leak and you're both not in your right mind due to it (because you are in heavy denial about the situation).",
      "created_utc": 1746329453.0,
      "score": 3
    },
    {
      "id": "mqakhfm",
      "body": "You need to get her to a mental health professional. ASAP.",
      "created_utc": 1746232020.0,
      "score": 2
    },
    {
      "id": "mqakndh",
      "body": "This is textbook pregnancy induced psychosis. Like, your wife is in serious danger.",
      "created_utc": 1746232080.0,
      "score": 2
    },
    {
      "id": "mqay4ex",
      "body": "This is not normal. It’s not a joke, she needs medical intervention.",
      "created_utc": 1746237035.0,
      "score": 2
    },
    {
      "id": "mqboftr",
      "body": "Fiction",
      "created_utc": 1746248395.0,
      "score": 2
    },
    {
      "id": "mqbqtfu",
      "body": "Psychosis can happen to anyone. Even people who don’t have any warning signs or history of mental health problems can have a psychotic episode. Psychosis doesn’t mean she’s dangerous or wants to harm anyone and it can be caused by a change in hormones or even just chronic unmanaged stress. And even if this isn’t her first pregnancy and she wasn’t like this the first time it can happen, every pregnancy is different. Plus a lot happens to the body physically and hormonally in pregnancy, and it’s been scientifically studied that your brain physically changes during pregnancy. \n\nYou need to bring up what’s happening at her next OB appointment to the doctor directly and allow a medical professional to determine what course to take. It doesn’t make her a bad partner or mom, nor does it make you a bad partner or parent either. It also doesn’t mean someone is going to take away your child. Nobody wants to separate families and it’s important you address this while she’s pregnant before these behaviors continue or get exasperated by the stress of birth and motherhood after the baby is born.",
      "created_utc": 1746249657.0,
      "score": 2
    },
    {
      "id": "mqbwl38",
      "body": "No, this is not normal.  She needs help like yesterday.",
      "created_utc": 1746252900.0,
      "score": 2
    },
    {
      "id": "mr22u4l",
      "body": "She's over exasperating her condition cause she knows you'll respond how she wants with the carrying. The food eating is similar sure she wasn't eating like a hog when you were courting her. Her excuses about outside is totally unfounded. A pregnant woman needs exercise for good circulation throughout,  and avoid pre-eclampsia. There's a bigger mental issue going on with her that I don't have the professional freedom to state. But I've studied enough to straighten myself out.I see issues in other people like a book now. She just happens to be pregnant now, So it's over lapping, and she's using her baby as a crutch for herself and a tool of manipulation for you. I experienced similar but not to your extreme. I'm a pretty stern and serious man. So when the prego crutch foolishness started to bloom I called it just that. Kept that prego nonsense to a minimum.  I let her get away with the little stuff but if it got to outlandish I shut that down. Not in a way that made her feel bad but letting her know there's no reason to act so far different than usual because we're procreating. You keep close to your non prego routine won't break your back to return to normal. If anything it's time to become more active,now that a woman's pregnant,to maintain her mind, body, and HAIR. Remind about losing the hair from improper prego care. That'll get her studying, and actually caring for herself and the baby not falling into fantasy land. Being prego does play with brain chemistry and if there's already mental illness, it takes a field festival and turns it into a heavy metal guitar breaker. So be calm sit her down with the tools I gave you. Don't dismiss her just let her know there's a reason she's feeling so much and you two can take it by the reigns. Allow you to help her but don't flash drama or scenario you. Let the pregnancy happen  and control its outcome best you can don't let the pregnancy happen to you with nonsense and unbalanced thinking and raising drama causing misteps.  Play nice music on her tum. Classical was recommended to me but I used anything non violent, vulgar language or sexual yes it does effect the babies personality no devil spawns haha  That made my first kid smart ahead his age from birth. Make a routine to give her a WARM Not Hot  SHALLOW bath with a lot of pouring over her tum and naturist music see how all 3 of you feel before during after. That was. Great experience for us.",
      "created_utc": 1746622342.0,
      "score": 2
    },
    {
      "id": "mqavwvz",
      "body": "Yes!!! Please if you love your wife and your future unborn child, seek help asap. My friend and her husband refused medication at first, despite my friend having literal episodes where she was moaning and blacking out and not remembering. They were worried she would get addicted to the meds long term. I’m like there will be no long term IF YOU DONT SEEK help now! She saw a psychologist, psychiatrist and they put her on meds and now that she’s back to her homeostasis she looks back and says wow, I was really.l in a dark hole",
      "created_utc": 1746236219.0,
      "score": 1
    },
    {
      "id": "mqaw2qa",
      "body": "Please get her medical help ASAP",
      "created_utc": 1746236280.0,
      "score": 1
    },
    {
      "id": "mqb4nwg",
      "body": "Pregnancy brain is a thing but this is a extreme. I’d goto to doctor or some sort of specialist",
      "created_utc": 1746239561.0,
      "score": 1
    },
    {
      "id": "mqbou11",
      "body": "Post- partum psychosis imho. Get her to a good psych ER imho. Call 988.",
      "created_utc": 1746248599.0,
      "score": 1
    },
    {
      "id": "mqcc6df",
      "body": "It sounds like you're going through a really tough time right now, and it’s understandable that this situation might feel overwhelming. I’ve been in a similar place, and I know that supporting someone during pregnancy can sometimes feel like you're not being heard or that everything is changing too fast. It’s important to talk openly with your wife about how you’re feeling, but also make sure you're giving her space to express her own emotions. Pregnancy can be exhausting and emotionally draining for both partners, so acknowledging each other’s struggles can help a lot.\n\nWhat helped me in a similar situation was finding time for myself, even if it was just a few minutes to step back and breathe. It’s okay to not have all the answers right away. But supporting her and sharing your feelings with her, while also taking care of your mental health, will help both of you navigate this big change. It’s okay to ask for help too, whether from friends, family, or a professional.",
      "created_utc": 1746262484.0,
      "score": 1
    },
    {
      "id": "mqcucrt",
      "body": "The eating thing, so she will eat and not wipe her face or she’ll say she’s not wiping it expecting you to? This feels off",
      "created_utc": 1746272857.0,
      "score": 1
    },
    {
      "id": "mr0kwl4",
      "body": "Man… I really feel this. I’ve got a daughter myself, and while my situation is a bit different, I still remember that time being just as confusing as it was special. You’re not alone — pregnancy can totally transform someone, and it doesn’t always come with a user manual. 📑\n\nWhat you’re describing might seem wild from the outside, but a lot of it can actually be pretty normal — especially with all the hormonal shifts, physical discomfort, and emotional overload she’s probably feeling. The food, the emotions, the clinging, the boundaries — it’s all part of her trying to feel safe and in control in a time when everything about her body and world is changing. 🤰\n\nIt sounds like you’re doing a great job just being there. And honestly? That’s the most important part. Keep showing up. Keep loving her through the weird, the wonderful, and the “what is even happening right now?” moments. You’re doing better than you think. 🧡\n\nThis stage won’t last forever. But the love you’re building through it? That’s the part that stays. ☮️",
      "created_utc": 1746593744.0,
      "score": 1
    },
    {
      "id": "mr73fr7",
      "body": "She might have a mental disorder\nI would have her checked",
      "created_utc": 1746681104.0,
      "score": 1
    },
    {
      "id": "mr9zpzf",
      "body": "it’s clear you love your wife deeply and want to support her through this wild ride of pregnancy, which is awesome. What you’re describing—her refusing to go outside, eating in corners, clinging to you, and all the other quirks—definitely sounds intense and out of the ordinary. Let’s break this down together and figure out what might be going on and how you can navigate it.   \n  \nIs This Normal?  \n  \nPregnancy can absolutely turn someone’s world upside down. Hormonal shifts, physical changes, and the emotional weight of growing a human can lead to some pretty big behavioral changes. Things like heightened anxiety, mood swings, or even wanting to “nest” and stay safe at home aren’t uncommon. Your wife’s refusal to go outside because “the ground isn’t safe for the baby” or her paranoia about others “wishing bad on the baby” could be her protective instincts kicking into overdrive. The clinginess and copying you might be her way of seeking comfort or control when everything else feels chaotic.That said, some of what you’re describing—like eating in corners, refusing to wipe her face, and the extreme possessiveness—leans toward the more unusual side. It’s not “normal” in the sense of being typical for most pregnancies, but it’s also not unheard of for pregnancy to amplify someone’s personality or emotions in unexpected ways. Every pregnancy is different, and for some, it can bring out behaviors that seem totally out of character.Could It Be Something More?While a lot of this could just be her unique way of coping with pregnancy, the intensity of her actions—like not leaving the house at all, the paranoia, and the emotional outbursts—might hint at something deeper. Prenatal anxiety or depression can show up as withdrawal, fearfulness, or irritability. In rare cases, extreme behaviors could even point to prenatal psychosis, though that’s less likely since she says she’s happy and you believe her. Still, it’s worth keeping an eye on, especially if it’s affecting her quality of life or yours.What You Can DoYou’re already doing an amazing job by being patient and supportive—seriously, give yourself credit for that. Here are some steps to help you both through this:\n\n* Gently Suggest Professional Input: Encourage her to talk to her doctor or midwife about how she’s feeling and acting. You could frame it like, “Hey, I just want to make sure you and the baby are getting all the support you need—what do you think about mentioning this at your next appointment?” A healthcare pro can check if this is just pregnancy quirkiness or something that needs extra care.\n* Communicate with Empathy: Let her know you’re in her corner. Maybe say something like, “I love how much you care about keeping the baby safe—I’m just worried about you being stuck inside all the time. Can we figure this out together?” It shows you’re supportive without making her feel judged.\n* Support Yourself Too: You’re not exhausted yet, but this is a lot to handle! It’s okay to feel confused or overwhelmed. Talking to a friend, joining a group for expectant dads, or even seeing a therapist yourself could help you process this and stay strong for her.\n* Roll with It (When You Can): Some of this—like carrying her inside or her copying you—seems to bring her joy or comfort. If it’s not hurting anyone, leaning into those moments might keep things light. Pregnancy doesn’t last forever, and this phase will pass.\n\nFinal ThoughtsYour wife’s behavior is a lot, no doubt about it, but it sounds like it’s coming from a place of love, fear, or just pregnancy brain on overdrive. While it’s not textbook “normal,” it’s not necessarily a crisis either—yet. Keep being the caring partner you are, nudge her toward a chat with her doctor to be safe, and hang in there. You’ve got this, and soon enough, you’ll be laughing about the corner-pizza days with a little one in your arms.",
      "created_utc": 1746724647.0,
      "score": 1
    },
    {
      "id": "mqbsvde",
      "body": "She's taking the piss, just leave her alone for a few days",
      "created_utc": 1746250777.0,
      "score": 1
    },
    {
      "id": "mq99ui1",
      "body": "She sounds possessed.",
      "created_utc": 1746216667.0,
      "score": -23
    },
    {
      "id": "mqcziwd",
      "body": "It's okay, you have to be strong. This is because of her hormones, but soon this period will end. I', sure that she also feels bad about that",
      "created_utc": 1746275146.0,
      "score": -2
    },
    {
      "id": "mq9e3ce",
      "body": "maybe BPD, maybe smth else",
      "created_utc": 1746217918.0,
      "score": -15
    },
    {
      "id": "mqcwnfn",
      "body": "What you’re seeing is *heightened sensitivity + emotional shifts*—totally common in pregnancy due to hormonal + psychological changes. She’s seeking safety + control in her own ways right now. Keep steady, keep kind—it’s her way of coping. If you want to unpack this deeper, we can explore it together privately 💜",
      "created_utc": 1746273902.0,
      "score": -1
    },
    {
      "id": "mqhn32e",
      "body": "I was pregnant twice. Definitely the pregnancy hormones",
      "created_utc": 1746335056.0,
      "score": -1
    },
    {
      "id": "mq94trx",
      "body": "she isn’t going to talk to a therapist my best bet is adapting and learning how to be there for her",
      "created_utc": 1746215173.0,
      "score": -19
    },
    {
      "id": "mqanb33",
      "body": "This was literally my first thought too. This could be dangerous, for her, for OP, and for their child. Get professional help STAT.",
      "created_utc": 1746233043.0,
      "score": 360
    },
    {
      "id": "mqb7c40",
      "body": "Definitely, because she is going to need treatment well beyond giving birth.",
      "created_utc": 1746240633.0,
      "score": 112
    },
    {
      "id": "mqc5rka",
      "body": "I agree sounds like psychosis. I’ve experienced psychosis related to my ptsd. It’s a scary place to be in. You absolutely need to get her help. I almost really hurt myself in that state.",
      "created_utc": 1746258440.0,
      "score": 60
    },
    {
      "id": "mqa7tsl",
      "body": "Call MaxTac, just in case.",
      "created_utc": 1746227542.0,
      "score": 39
    },
    {
      "id": "mq921ht",
      "body": "🤣Ok man",
      "created_utc": 1746214343.0,
      "score": -640
    },
    {
      "id": "mqgsovg",
      "body": "No, this requires a medical doctor of psychiatry. Not some random therapist.",
      "created_utc": 1746321840.0,
      "score": 2
    },
    {
      "id": "mq920aa",
      "body": "Hm. I don’t think she will go/ doesn’t talk very much to strangers",
      "created_utc": 1746214333.0,
      "score": -123
    },
    {
      "id": "mq91xv1",
      "body": "I’ve noted her behavior to my family she got very mad and said she’s fine, she takes it as me talking shit about her",
      "created_utc": 1746214312.0,
      "score": -57
    },
    {
      "id": "mq996kq",
      "body": "She’d get very furious if I brought up the fact that she “might need” professional help. That’s why I’m against that right now",
      "created_utc": 1746216468.0,
      "score": -23
    },
    {
      "id": "mq99khc",
      "body": "Guys, I appreciate the concern, but she’s genuinely joyful, soft, and attached to the baby. I came here confused, not panicked. I’ll bring it up to her OB calmly, but she’s not dangerous",
      "created_utc": 1746216584.0,
      "score": -129
    },
    {
      "id": "mq9654s",
      "body": "This is either some weird ass rage bait or something is severely wrong",
      "created_utc": 1746215567.0,
      "score": 344
    },
    {
      "id": "mq91ssq",
      "body": "She’s in the second trimester and I go to most of her appointments with her and she’ll just tell everyone she’s fine but in public won’t really talk to other people besides me. Even shy with nurses and such",
      "created_utc": 1746214269.0,
      "score": 19
    },
    {
      "id": "mq93847",
      "body": "Ok",
      "created_utc": 1746214694.0,
      "score": 12
    },
    {
      "id": "mq98fgu",
      "body": "I’ve tried inviting family members over and we had a fight about it, she started crying and saying I was betraying her by having them over to talk to her",
      "created_utc": 1746216243.0,
      "score": -11
    },
    {
      "id": "mqbav41",
      "body": "This whole thing screams Yates...but at least he knew something was wrong and that his wife needed help. The system absolutely failed them...this dude is in for a world of hurt if he doesn't pay attention.",
      "created_utc": 1746242093.0,
      "score": 11
    },
    {
      "id": "mq9mquv",
      "body": "I fear for them both, this could be psychosis or ppd. it makes women do a lot of  irrational stuff, the way she’s acting is concerning and frightening. i feel worried for her especially. she’s gonna destroy her mental health.",
      "created_utc": 1746220506.0,
      "score": 14
    },
    {
      "id": "mqajs0b",
      "body": "Shes tripped and fell before while pregnant on a walk that’s why she doesn’t want to walk outside .. not because she’s possessed or whatever the hell Yall are saying",
      "created_utc": 1746231762.0,
      "score": -14
    },
    {
      "id": "mqfatoy",
      "body": "That man should have served time.  \n\nSelfish, religious freak.  \n\nHe cared nothing about his wife OR his five children and as far as I’m concerned, he is responsible for the drownings that poor woman carried out.  \n\nHe KNEW she had problems and he knew it for years before the incident.",
      "created_utc": 1746302415.0,
      "score": 2
    },
    {
      "id": "mqbkkaj",
      "body": "Update: my wife just ate a jar of dry minced onions with a spoon and told me the Nutella gives her psychic messages",
      "created_utc": 1746246433.0,
      "score": -23
    },
    {
      "id": "mqan0ay",
      "body": "Analyzing user profile...\n\nAccount made less than 1 week ago.\n\nAccount has fake default Reddit username.\n\nAccount has negative comment karma.\n\nSuspicion Quotient: 0.45\n\nThis account exhibits a few minor traits commonly found in karma farming bots. It is possible that u/Jumpy-Vacation-304 is a bot, but it's more likely they are just a human who suffers from severe NPC syndrome.\n\n^(I am a bot. This action was performed automatically. Check my profile for more information.)",
      "created_utc": 1746232934.0,
      "score": 13
    },
    {
      "id": "mqa6i9m",
      "body": "You know how unhelpful that is?",
      "created_utc": 1746227090.0,
      "score": 4
    },
    {
      "id": "mqdzv57",
      "body": "Thank you",
      "created_utc": 1746287646.0,
      "score": 0
    },
    {
      "id": "mqhnmar",
      "body": "Yeah, figured that’s what it is",
      "created_utc": 1746335337.0,
      "score": 1
    },
    {
      "id": "mq98ev0",
      "body": "And the point everyone else is making that you’re glossing over is that it seems like she needs professional help. You can adapt to be as supportive and considerate as humanly possible, it won’t change the advice you’re getting here.\n\nI get it’s uncomfortable and maybe not the answer you were looking for.",
      "created_utc": 1746216238.0,
      "score": 45
    },
    {
      "id": "mq9aul5",
      "body": "OP how old are you? Just curious.",
      "created_utc": 1746216963.0,
      "score": 20
    },
    {
      "id": "mqcri6i",
      "body": "r/unexpectedcyberpunk",
      "created_utc": 1746271489.0,
      "score": 6
    },
    {
      "id": "mq92m4g",
      "body": "What's funny about this? Pregnancy induced psychosis is very real and mothers have killed their children over it.",
      "created_utc": 1746214514.0,
      "score": 484
    },
    {
      "id": "mq95vxu",
      "body": "As a psychotherapist, do not ignore this suggestion. She sounds like she has textbook pregnancy-induced psychosis.",
      "created_utc": 1746215491.0,
      "score": 112
    },
    {
      "id": "mq9304a",
      "body": "This is real and can be terrifying and research it seriously as well as post partum. Your wife is potentially having an issue and you're brushing it off.",
      "created_utc": 1746214628.0,
      "score": 93
    },
    {
      "id": "mq9tpft",
      "body": "i know it is scary to hear about psychosis but it is a very real thing. usually psychosis can happen to women who already experience mental health issues when they give birth to the baby but in other cases women can experience psychosis while pregnant. it isn’t very common but it can happen. linked below is a guide to psychosis associated with pregnancy/childbirth and it shows signs to look for. from what you said in your post it seems your wife may be showing a lot of these signs already. i know you want to keep peace in your marriage but please consider seeking help before something damaging can happen. https://www.oxfordhealth.nhs.uk/wp-content/uploads/2014/10/AM-021.14-EIS-Psychosis-associated-with-pregnancy-and-birth.pdf",
      "created_utc": 1746222719.0,
      "score": 33
    },
    {
      "id": "mqa1dp2",
      "body": "I'm a little confused why you made this post if you're gonna laugh off the fact that your wife is experiencing some sort of psychosis. You asked if this is normal......no it isn't. Not only is it NOT normal but she needs actual help and fast before the baby is born.",
      "created_utc": 1746225321.0,
      "score": 34
    },
    {
      "id": "mqawgk9",
      "body": "If you love her get her help",
      "created_utc": 1746236422.0,
      "score": 8
    },
    {
      "id": "mqaz60j",
      "body": "Asks for advice. Laughs at the most helpful answer. Why are you even here?",
      "created_utc": 1746237425.0,
      "score": 7
    },
    {
      "id": "mqcmd6z",
      "body": "Let’s be real here. She’s showing signs of not acting right to an extreme level that you can barely understand/recognize her behavior. She’s having delusions. If you keep laughing and ignoring this then she’s going to take whatever opening she can to most likely take herself out along with the baby permanently. This is a very real situation you’re in. Laugh when it’s been proven by a psychiatrist it isnt the case. But don’t laugh when it can bite you in the ass later. Don’t you care for your wife and child? Take your pregnant wife to a psychiatrist ffs.",
      "created_utc": 1746268800.0,
      "score": 4
    },
    {
      "id": "mq92p3l",
      "body": "That's a problem. You need to sit with her and explain to her that you are worried, tell her YOU NEED for her to talk to a therapist just for your peace of mind.",
      "created_utc": 1746214538.0,
      "score": 204
    },
    {
      "id": "mq9cnn4",
      "body": "Why are you even posting in here if you’re going to ignore and refute every suggestion?",
      "created_utc": 1746217497.0,
      "score": 39
    },
    {
      "id": "mqa1owx",
      "body": "Psychiatrists do virtual appointments",
      "created_utc": 1746225431.0,
      "score": 10
    },
    {
      "id": "mqbg007",
      "body": "Are you freaking delusional? She’s going to hurt herself or you. None of this is normal or okay. Why is this taking you so long to even think about asking someone? On Reddit at that.",
      "created_utc": 1746244309.0,
      "score": 7
    },
    {
      "id": "mqbyluj",
      "body": "Is it possible to explain her situation to a therapist/psychiatrist and get her admitted that way because her case is definitely extreme and absolutely not normal at all. There’s no question she needs help",
      "created_utc": 1746254088.0,
      "score": 2
    },
    {
      "id": "mq93elo",
      "body": "Doesn't matter what she thinks about this. She needs help. What is more important than anything else is her and the baby's health. This is very very serious. If it's psychosis it could  very well continue after birth and mother's have killed their babies because of psychosis unable to control themselves or be rationale.",
      "created_utc": 1746214748.0,
      "score": 158
    },
    {
      "id": "mq93jou",
      "body": "Think of your baby.   Will you feel safe leaving baby with her? \n\n\nMental health issues are often not recognized by the person experiencing them.   Whether this is pregnancy related and fades or a longer term problem, this is not normal behaviour.  Not getting help now will only prolong it.   And will DEFINITELY affect your child.",
      "created_utc": 1746214791.0,
      "score": 33
    },
    {
      "id": "mqa8m53",
      "body": "So you decided to post it on Reddit while also trolling those who actually know what they’re talking about? *DUDE.*",
      "created_utc": 1746227809.0,
      "score": 13
    },
    {
      "id": "mqbpd1w",
      "body": "Your family isn’t a medical professional. You need the opinion of a medical professional and not the opinion of your family members if you want her to get better. Also, if my partner shared my private health struggles with family and I was pregnant I would probably be upset too.",
      "created_utc": 1746248877.0,
      "score": 4
    },
    {
      "id": "mqb8p15",
      "body": "that's paranoia.",
      "created_utc": 1746241184.0,
      "score": 1
    },
    {
      "id": "mq9bf6q",
      "body": "That’s totally understandable man, and it’s a tough spot to be in as a loved one. People that are experiencing distortions in their reality almost never respond well to someone telling them that something’s wrong with them. People are more likely to be accepting of seeing someone professionally if it’s framed around concerns about their mood or anxiety, rather than their bizarre behaviours. Are you able to reach out to the doctor that’s part of the prenatal check ins and ask for guidance around this situation?",
      "created_utc": 1746217131.0,
      "score": 75
    },
    {
      "id": "mqa4bi3",
      "body": "Because she's being paranoid and thinks people are out to get her. Her needs > her wants",
      "created_utc": 1746226344.0,
      "score": 36
    },
    {
      "id": "mqac94l",
      "body": "If you really can't talk to her directly then go above her straight to her ob or primary care provider",
      "created_utc": 1746229058.0,
      "score": 10
    },
    {
      "id": "mqbgszv",
      "body": "As someone who, once upon a time, was furious at the suggestion I needed mental healthcare... I get it, man. I do. But at a certain point, unfortunately, there isn't a lot of choice.\n\nIt took a few times, and at least once with me bellowing \"I'm not crazy\" (life pro tip, shouting that in a dorm and then refusing to open the door for an RA does not, in fact, make anyone believe that's true) before I even began to concede that I might need help, after a decade of, in retrospect, being wildly unwell. But I firmly believe I wouldn't be here anymore if everyone in my life had decided it wasn't worth me being mad at them. And I grieve the decade of my life spent suffering needlessly.\n\nAnd in the opposite direction, for an idea on how I feel about having not been told I needed help, I'll point you to my mother, who later admitted she was pretty sure I was mentally ill back when I first started struggling, but since I never complained, she decided to just not worry about it. I've come to peace with that and that she was doing the best she knew how to do at the time, but that conversation absolutely changed my relationship with my mother, and not for the better.",
      "created_utc": 1746244663.0,
      "score": 6
    },
    {
      "id": "mqa8irw",
      "body": "Hopefully there is a very gentle way to say you’re not judging, and in rare cases pregnancy hormones can just do weird things and for everyone’s well-being you’ll just get checked out?",
      "created_utc": 1746227777.0,
      "score": 3
    },
    {
      "id": "mqbgob1",
      "body": "That alone is evidence of how badly she needs it.",
      "created_utc": 1746244606.0,
      "score": 3
    },
    {
      "id": "mqbcpvz",
      "body": "Please just show the doctor your original post here. You don't have to say anything, just ask that they read it. I understand that you're worried about talking about it in an appointment in front of your wife. That makes sense. But you do need the doctor to know these details, and the sooner the better. As other people have said, these sorts of situations almost never get better on their own. We are all praying that you do this, OP.",
      "created_utc": 1746242887.0,
      "score": 2
    },
    {
      "id": "mqeyl8r",
      "body": "Who cares if she gets mad??? Are you scared of her????",
      "created_utc": 1746298356.0,
      "score": 1
    },
    {
      "id": "mq9ep02",
      "body": "Then if there isn't a problem, what is your question exactly?",
      "created_utc": 1746218096.0,
      "score": 185
    },
    {
      "id": "mq9j6ry",
      "body": "People with psychosis can still feel joy. They can still love. They can still form emotional attachments. You don’t know what psychosis is, you have a preconceived idea of what it *kinda* means. Please get your partner professional help because their behavior isn’t normal. Let a doctor diagnose them if they need to be diagnosed. Stop laughing at the idea of mental illness in a mental health sub, it makes you seem like a real POS.",
      "created_utc": 1746219418.0,
      "score": 159
    },
    {
      "id": "mq9z9ht",
      "body": "Please do not ignore behavioral changes in her and brush them off. None of that is normal. Even if it's just a bit of anxiety, she should treat the anxiety now before it gets a million times worse after birth. Postpartum anxiety looks more like her refusing to sleep or even let anyone else hold the baby, including you, out of fear.\n\nPregnancy and childbirth induced bipolar disorder for me. I too was normal until near the end of pregnancy and lost my damn mind after having my first born. Sometimes it's permanent like in my case and I wish someone had paid attention sooner.",
      "created_utc": 1746224586.0,
      "score": 40
    },
    {
      "id": "mqa3zmo",
      "body": "Being joyful, soft, feminine, compliant, sweet, and deferential do not equal being rational or competent to care for a baby. She doesn’t need to be combative or angry to be dangerous. However, you’ve said yourself that she’s resistant to talking to medical professionals.  Which means she’s a bit argumentative, or at least lacking self-awareness to the extent that she would resist clearing herself medically?",
      "created_utc": 1746226230.0,
      "score": 35
    },
    {
      "id": "mq9yyee",
      "body": "Hopefully you won’t regret ignoring all the red flags you’re getting and not actually acknowledging somethings very wrong. You’re wife deserves better.",
      "created_utc": 1746224482.0,
      "score": 24
    },
    {
      "id": "mqaewpj",
      "body": "What exactly do you think psychosis is “supposed” to look like?  Psychosis can look like many things, including being absolutely elated.  You’re describing unnatural and paranoid fears, rapid mood changes, and just flat out BIZARRE behaviour.  No.  This is not normal, this is not “just pregnancy”.  You want to help her and “be there” for her?  Go to her next dr appointment with her and describe all that stuff to her doctor and get THEIR opinion.",
      "created_utc": 1746229991.0,
      "score": 27
    },
    {
      "id": "mqai7dd",
      "body": "Then the hell you post here for…?!",
      "created_utc": 1746231182.0,
      "score": 17
    },
    {
      "id": "mqapfcm",
      "body": "Psychosis doesn't mean dangerous. When I experienced PTSD induced psychosis I had powers of telepathy so I barely spoke. I was a generally happy housewife to three kids, just dillusional AF. Hallucinated a good amount too; things like spiritual tattoos that glowed on my husbands skin. I sought help when it became obvious I was struggling to function and even then I didn't even realize what I was experiencing was abnormal. Telling a psychologist I was struggling to shower because I couldn't handle the idea of aliens watching me on their TV made seeing a Psychiatrist pretty simple LOL I hope you're not rage bait.",
      "created_utc": 1746233810.0,
      "score": 17
    },
    {
      "id": "mqbbwu0",
      "body": "Your nonchalant response to things is very concerning honestly. Something is very clearly wrong and you are choosing to ignore it and to believe that you are there for her by not asking for help. ~she needs help~. She is at the point she might very well need inpatient care. No, you can’t help her without finding her help.",
      "created_utc": 1746242541.0,
      "score": 9
    },
    {
      "id": "mqaiglg",
      "body": "Based on op’s responses, it’s definitely rage bait.",
      "created_utc": 1746231275.0,
      "score": 75
    },
    {
      "id": "mqe37yp",
      "body": "Carbon monoxide poisoning?",
      "created_utc": 1746288699.0,
      "score": 7
    },
    {
      "id": "mq95oo7",
      "body": "You need to speak up during your next appointment. \n\nBring up specific behaviors and things she’s said that are concerning, like *not leaving the house because she is afraid people will wish badly on the baby*, not going outside and not touching grass *because it’s not safe for the baby*. \n\nMy point is, don’t just be broad and say “she’s acting strange/different”. \n\nMention the specific *changes* in personality. \n\nLet the doctor know that she acts differently at the appointments than at home, and that you’re concerned for her wellbeing.",
      "created_utc": 1746215430.0,
      "score": 91
    },
    {
      "id": "mq9r8lg",
      "body": "My cousin was like this before he was admitted to the hospital 2 months ago",
      "created_utc": 1746221926.0,
      "score": 32
    },
    {
      "id": "mqfyzb1",
      "body": "Ask to speak with a doctor in private !!!!",
      "created_utc": 1746310573.0,
      "score": 1
    },
    {
      "id": "mq9bymg",
      "body": "I think we are trying to get you to understand the potential urgency here. I’m not saying she doesn’t love her baby or is attached to it. I’m hoping you can leave here with an understanding that you should be concerned.",
      "created_utc": 1746217291.0,
      "score": 80
    },
    {
      "id": "mqad4b2",
      "body": "A really close friend of mine became psychotic. The experience sounds a bit like what you’ve described. It wasn’t immediately obvious. It was subtle at first and then escalated.\n\nIt wasn’t like a “they are sad/upset/not joyful” type of thing. It was more like “something is broken in this person’s logic”.\n\nThey just seemed kind of erratic and off. But when I really dug and talked to them more, they started to come out of their shell and tell me that things weren’t real, their life was being controlled by a demon, etc.\n\nYou might try digging a bit more when she says stuff like “the ground is dangerous for the baby”. Try to be non-judgmental and truly curious about her perspective to show that it’s safe for her to open up and talk to you about those things.",
      "created_utc": 1746229361.0,
      "score": 18
    },
    {
      "id": "mq9bd9y",
      "body": "and doesn't that sound like a distorted thought?",
      "created_utc": 1746217116.0,
      "score": 109
    },
    {
      "id": "mqda8t7",
      "body": "No, Rusty Yates ignored medical advice and kept getting his wife pregnant when he knew it wasn’t good.",
      "created_utc": 1746279328.0,
      "score": 6
    },
    {
      "id": "mqaka1a",
      "body": "Okay you have to be trolling",
      "created_utc": 1746231944.0,
      "score": 24
    },
    {
      "id": "mqakdyd",
      "body": "Either that or you’re genuinely just a terrible partner and future father.",
      "created_utc": 1746231985.0,
      "score": 7
    },
    {
      "id": "mqbng22",
      "body": "I am convinced you’re trolling now. You made this account today, you are refusing any actual help/advice people have given you, and you are still going on about the crazy stuff your wife is doing. and if this is real… she is NOT okay & you need to help her. Take her to the damn ER and pull a nurse aside and say she’s not acting right. Do SOMETHING.",
      "created_utc": 1746247882.0,
      "score": 23
    },
    {
      "id": "mqde1fg",
      "body": "This makes me sad. There are people here who look for genuine advice for their loved ones, and you waste people’s time with this.",
      "created_utc": 1746280651.0,
      "score": 7
    },
    {
      "id": "mqbn1qs",
      "body": "You need to get her to a professional dude she’s not well. If you deny this then this has to be purely rage bait.",
      "created_utc": 1746247681.0,
      "score": 6
    },
    {
      "id": "mqex0r2",
      "body": "Hey, I don’t think you’re helping her at all if you are just here to make fun of her.. 🥺",
      "created_utc": 1746297851.0,
      "score": 3
    },
    {
      "id": "mqap4xy",
      "body": "I think it’s pretty helpful, actually. If this post is real, it mentions they’re religious. OP has straight up rejected the idea of his wife having a mental illness. A lot of religious people don’t believe mental illnesses are real. So maybe OP will believe demonic possession over psychosis, and maybe do something about it.",
      "created_utc": 1746233706.0,
      "score": -3
    },
    {
      "id": "mqfi2sk",
      "body": "If you think that poor advice is going to solve your problem, you are mistaken.  I hope you’re not that gullible and you don’t truly think that you are capable of taking care of your wife without any professional intervention.  Do the right thing.  Listen to the multitude of people giving you the exact same advice.  Get her professional help.",
      "created_utc": 1746304791.0,
      "score": 5
    },
    {
      "id": "mqhp05q",
      "body": "It's common in most women during pregnancy. Trust me, I had it worse than her when I was pregnant twice in a row.  \n\nDo the research after birth too. Postpartum depression and psychosis. It is better for her to see psychiatrist or psychologist. \n\nSince I didn't go to psychiatrist, I handle mostly myself but it is definitely not advisable. That thoughts of hurting someone and thoughts of killing myself on my part. I even tried so hard to distract myself. I gave birth to my second kid 4 months ago. Yea no, book an appointment to go see psychiatrist. She needs help.",
      "created_utc": 1746336075.0,
      "score": 1
    },
    {
      "id": "mq98sox",
      "body": "She’s not going to go see a doctor.. in fact that would make it worse and I don’t want her to end up resenting me",
      "created_utc": 1746216353.0,
      "score": -15
    },
    {
      "id": "mq9b0qq",
      "body": "She’s 20 and I’m 23",
      "created_utc": 1746217013.0,
      "score": -5
    },
    {
      "id": "mq931b6",
      "body": "That’s a little overboard",
      "created_utc": 1746214638.0,
      "score": -612
    },
    {
      "id": "mq935l9",
      "body": "She doesn’t have psychosis",
      "created_utc": 1746214673.0,
      "score": -85
    },
    {
      "id": "mq941e2",
      "body": "This was really just me asking how I can be there for her, maybe I should have stated that. But she’s happy and bubbly all-round. I understand the concern but she’s not mentally ill. She’s very young and has always been pretty shy and cautious",
      "created_utc": 1746214937.0,
      "score": -96
    },
    {
      "id": "mq94ht0",
      "body": "She’s always been stand off ish and very shy I should have stated that .  the psychosis thing is dramatic",
      "created_utc": 1746215072.0,
      "score": -80
    },
    {
      "id": "mq93rmp",
      "body": "Yes, I feel comfortable leaving our child with her",
      "created_utc": 1746214856.0,
      "score": -12
    },
    {
      "id": "mqaoem4",
      "body": "He’s rage baiting and y’all are falling for it.",
      "created_utc": 1746233440.0,
      "score": 5
    },
    {
      "id": "mqc7xjs",
      "body": "The only question I've seen in the post was at the end, 'Is this normal?\"",
      "created_utc": 1746259781.0,
      "score": 2
    },
    {
      "id": "mqgle0t",
      "body": "I use to think that too but Simon Whistler did a deep dive on his podcast about her story. Apparently they both kinda isolated themselves at the beginning, wanting more kids and Andrea believing she should be a happy mom, but she got more depressed thinking she was a bad mom (depressive thoughts). After Andrea’s first attempt, Rusty then listened to the medical professionals and was halfway caught between mental patients having the right to refuse treatment and her being a danger to herself. And then at the end the psychiatrist stopped her antipsychotics abruptly instead of tapering them. They were trying to find the sweet spot of not being psychotic and eliminating the anhedonia her meds induced. Rusty’s mom was supposed to come over that morning (as she had been doing) to help Andrea with the kids. But the mother was late getting there by 10-15 mins. \n\nRusty and Andrea might’ve not taken the depression seriously enough in the beginning (Depression awareness not being as big or as seriously back then). But once she had to be hospitalized he really tried. But it was too late. It was too much for him to know what he was dealing with",
      "created_utc": 1746318981.0,
      "score": 3
    },
    {
      "id": "mqakjar",
      "body": "I thought these people would read it as a common fear of being scared to walk because pregnant women are vulnerable not because she is actually SCARED of the ground .. like cmon… you people are nuts",
      "created_utc": 1746232039.0,
      "score": -19
    },
    {
      "id": "mqbnk5j",
      "body": "She’s absolutely fine",
      "created_utc": 1746247940.0,
      "score": -18
    },
    {
      "id": "mqar7pa",
      "body": "No its not helpful at all. That’s insane to say it’s helpful.",
      "created_utc": 1746234465.0,
      "score": 2
    },
    {
      "id": "mqavmvj",
      "body": "Like what? Have a priest over to sprinkle water on her and pray? She won't even go to church, so even just talking to a church counselor is out.",
      "created_utc": 1746236117.0,
      "score": 2
    },
    {
      "id": "mqg7dyt",
      "body": "She’s fine with me and only trusts me",
      "created_utc": 1746313704.0,
      "score": -1
    },
    {
      "id": "mq9ag10",
      "body": "Okay? Then your wife will likely continue to eat in corners, refuse to go outside, be paranoid of strangers, have drastic mood swings and cling onto you. You yourself described this behavior as “unlike anything I’ve seen” and the rest of us are agreeing with you.\n\nImagine if my wife broke her leg and I made a post in here saying “my wife is hobbling around the house, can’t stand up without help, is in constant pain, but doesn’t want to see a doctor. How can I be there for her without taking her to the doctor?”\n\n^ Do you get how bizarre that sounds?",
      "created_utc": 1746216843.0,
      "score": 53
    },
    {
      "id": "mq9aepe",
      "body": "[deleted]",
      "created_utc": 1746216832.0,
      "score": 34
    },
    {
      "id": "mq9ai0o",
      "body": "Better resenting you than hurting herself or your baby while in psychosis.",
      "created_utc": 1746216859.0,
      "score": 16
    },
    {
      "id": "mq9vdsr",
      "body": "Friend. I am a mother of four and have experienced my hormones and lack of sleep betraying me firsthand. I know that her being defensive and resistant to help is hard. I know that you don’t want to set yourself up as the enemy. \n\nHowever, I think it’s very important that you get at least one visit and an assessment under both of your belts before she needs to deal with the trauma of childbirth and newborn care on top of whatever is going on right now.\n\nHer clinging to you and being afraid is escalating it appears. Perceiving danger everywhere can make caring for an infant even more stressful. Her health is very important and at this point it sounds like lovingly and gently asking her to speak to someone who might help her rest and be calm is your best bet?\n\nInvolving other people is a mixed bag and might make her very defensive. Sleep deprivation, stress, and paranoia can go hand and hand and all exacerbate each other. So a group effort is likely not the way to go here? But I am not a professional. I do know that in my worst states I was not a good judge of what I needed. But gentle questioning went way better than people being forceful. And being lightly sedated enough to rest was a huge help to reset my brain. \n\nIf anything, maybe she would read some accounts of mothers who have gone through this? People are approaching with sympathy. And concern. Not judgment.",
      "created_utc": 1746223268.0,
      "score": 8
    },
    {
      "id": "mq9ciln",
      "body": "Well that explains a lot",
      "created_utc": 1746217456.0,
      "score": 56
    },
    {
      "id": "mq9v0dr",
      "body": "God help your wife and child...",
      "created_utc": 1746223145.0,
      "score": 8
    },
    {
      "id": "mqaymh4",
      "body": "I was 22 when my mental illness went full swing. I’m doing much better now because I got help. Your wife needs professional mental health help. It doesn’t matter if she likes it or not, if you want to help her then that’s what you have to do. Mental illness can onset at any time, it doesn’t matter that she’s young though they have a tendency to show up young. Get her help and stop resisting, it’s helping nobody.",
      "created_utc": 1746237223.0,
      "score": 3
    },
    {
      "id": "mq97237",
      "body": "Oh, your post is fake",
      "created_utc": 1746215838.0,
      "score": 160
    },
    {
      "id": "mq95wvb",
      "body": "Did you read your own post? Or is this just flat out made up rage bait?",
      "created_utc": 1746215499.0,
      "score": 91
    },
    {
      "id": "mq937ze",
      "body": "No, it's not. The drastic increase in hormones can cause all sorts of issues. Mothers have killed **themselves** because of it.\n\nMaybe she should get a divorce too while she's at it.",
      "created_utc": 1746214693.0,
      "score": 433
    },
    {
      "id": "mq9ravy",
      "body": "You're clearly not seeing what you've written with objectivity. Psychosis happens for lots of reasons, including in this medically well-known one.\n\nPsychosis is not weakness. Not of the mind or of the body. It's most often caused by large changes in brain chemistry, which is what happens during pregnancy. Large brain chemistry changes are SUPPOSED to happen when you're pregnant, and different brains handle these changes in different ways, especially when the body is under stress (again, pregnancy is a HUGE stressor on our physical bodies).\n\nIt sounds like your wife is not dangerous and not distressed in this moment. That's not abnormal with mild psychosis. Soon, the last who doesn't know what a cigar is or that the ground can't hurt her will be raising an infant. This is a big deal and you should treat it as such.\n\nMost psychosis is temporary and treatable. Consider her under the weather, not \"crazy.\" Please take the woman you love to a doctor. Please.",
      "created_utc": 1746221946.0,
      "score": 40
    },
    {
      "id": "mq9t40q",
      "body": "Dude. You asked for help and then laughed at the people who gave it. I hope you have to carry that woman everywhere you go for the rest of your life, while stepping on legos.",
      "created_utc": 1746222530.0,
      "score": 26
    },
    {
      "id": "mq9x0y4",
      "body": "read the post you just wrote and then think about that.",
      "created_utc": 1746223821.0,
      "score": 11
    },
    {
      "id": "mqae0jk",
      "body": "The thing with this kind of psychosis is that mothers can start feeling the outside world is very dangerous. It's not that they don't love their kids or aren't happy with their life. But the situation can get much worse VERY fast, so it's important to recognize warning signs and talk to doctors as early as possible. In the worst cases, mothers have killed their babies and themselves because they thought this was the only way to keep the baby safe. It's not rational but that's the point - as a \"healthy\" person, you can't truly understand or anticipate what she's thinking.",
      "created_utc": 1746229676.0,
      "score": 9
    },
    {
      "id": "mqao6v1",
      "body": "I had it. I tried to bargain with my “inner thoughts” - I didn’t tell the whole truth because I was convinced they’d take my baby.\n\nIt’s fucking real and it’s scary.",
      "created_utc": 1746233363.0,
      "score": 8
    },
    {
      "id": "mqaab09",
      "body": "It’s not. I suffered something similar.",
      "created_utc": 1746228388.0,
      "score": 7
    },
    {
      "id": "mqc89xm",
      "body": "It’s not overboard at all. Do some research and see how many perfectly lovely and formerly sane women experience psychosis during or in the first 20 weeks following delivery. Have you never heard of a mother drowning her children thinking she is protecting them? This is more common than it should be. How many of the dads in those scenarios do you think regret not acting on those red flags they saw? The red flags that sound overwhelmingly similar to what you’ve described here.\n\nIt’s not her fault and it doesn’t mean she is crazy. Please, for her sake and the sake of the baby, be overly cautious. Go overboard rather than not doing enough. If it turns out to be less serious, then great! If not, you’ll be grateful you were proactive.\n\nLaughing at us for begging you to please take this seriously is fucked up. Why would anyone make this up? We are trying to spare you from seeing your life fall apart.",
      "created_utc": 1746259999.0,
      "score": 4
    },
    {
      "id": "mq93rfc",
      "body": "Dude, your pregnant wife thinks the outside ground isn't safe for the baby and that people are going to wish ill on her. These are not normal thoughts, don't ignore this.",
      "created_utc": 1746214855.0,
      "score": 184
    },
    {
      "id": "mq9nvho",
      "body": "You, literally in the last line of your post: Is this normal?\n\nActual mental health professionals: NO!!!\n\nYou, again, verbatim: I've never seen anything like it. \n\nActual mental health professionals: WE HAVE!!!! 🚨🚨🚨🚨\n\nYou: lol\n\n\nYour poor wife. Your poor child.",
      "created_utc": 1746220855.0,
      "score": 124
    },
    {
      "id": "mq96qir",
      "body": "What do you think psychosis is?",
      "created_utc": 1746215743.0,
      "score": 93
    },
    {
      "id": "mq9mvwn",
      "body": "How do you know she doesn't ? Are you a qualified doctor ?",
      "created_utc": 1746220550.0,
      "score": 32
    },
    {
      "id": "mqabdil",
      "body": "This is psychosis. She needs help, and you are the only one who knows this is happening and can get her to a doctor. Please rise above your ego and any taboo you have against mental health treatment so she can get help. It is a temporary and treatable condition, but she may not survive without professional help",
      "created_utc": 1746228755.0,
      "score": 21
    },
    {
      "id": "mqa7v1q",
      "body": "You literally have a psychotherapist saying she has a textbook case and you are going to ignore it?",
      "created_utc": 1746227553.0,
      "score": 19
    },
    {
      "id": "mqa6x6u",
      "body": "Whatever you want to call it, it might be 100x worse during post-partum. That was the only time in my entire life that I actually had all the steps of un-aliving myself planned out in detail. She must have an OBGYN, right? Can't you at least start with that person?",
      "created_utc": 1746227232.0,
      "score": 14
    },
    {
      "id": "mqah86s",
      "body": "Rusty Yates said the same thing. \n\nIf you don't know who that is, I highly suggest you do a little research.",
      "created_utc": 1746230821.0,
      "score": 15
    },
    {
      "id": "mqanv3m",
      "body": "You’re not a psychiatrist. Take her to a professional. Don’t come on here asking for advice if you’re just going to ignore it and laugh.",
      "created_utc": 1746233244.0,
      "score": 12
    },
    {
      "id": "mq96103",
      "body": "she is showing signs of mental illness, and pregnancy can very well induce mental illness in otherwise healthy people. please do the right thing and try to get your wife psychiatric help. it is your job to help and protect her, and failing to get her help can cost her life.",
      "created_utc": 1746215532.0,
      "score": 227
    },
    {
      "id": "mq98e8q",
      "body": "Pregnancy can MAKE someone mentally ill. You seriously have no idea what all those hormones can do.",
      "created_utc": 1746216233.0,
      "score": 70
    },
    {
      "id": "mq9k4xh",
      "body": "How young is she?",
      "created_utc": 1746219699.0,
      "score": 49
    },
    {
      "id": "mq97hxa",
      "body": "Well, by your description you made it sound like she is struggling mentally. She might even get worse once she give birth, I personally think a therapist would be the safe bet. Still, wish you luck with whatever you decide to do.",
      "created_utc": 1746215968.0,
      "score": 49
    },
    {
      "id": "mq96wex",
      "body": "You’re here for a reason, you came to this subreddit for a reason. Now be open to feedback, you’re going to need to be open to this. That’s how you navigate…this.",
      "created_utc": 1746215791.0,
      "score": 83
    },
    {
      "id": "mq97jwa",
      "body": "Pregnancy can change someone a lot. All the hormone changes their body is going through. She probably is usually not mentally ill but since she’s pregnant, I wouldn’t rule that out",
      "created_utc": 1746215984.0,
      "score": 30
    },
    {
      "id": "mq9sdd6",
      "body": "Explain - why did you choose to come to this subreddit if you're 100% sure she's not mentally ill? I'm genuinely fascinated by your responses.",
      "created_utc": 1746222290.0,
      "score": 33
    },
    {
      "id": "mq9jvgb",
      "body": "At a point you are not going to be enough. You cannot 'be there' for everything. I don't suppose you are the one taking care of her scans, checkups and what not right? You delegate that to an actual professional. That's what the people here are telling you to do. Mental health, especially when under pregnancy hormones, need to be treated with as much seriousness as physical health. But you decide for yourself.",
      "created_utc": 1746219619.0,
      "score": 22
    },
    {
      "id": "mq9tekm",
      "body": "Being happy and bubbly doesn’t equate to her not being mentally ill. You know people can be both?",
      "created_utc": 1746222624.0,
      "score": 19
    },
    {
      "id": "mq9t7no",
      "body": "If what you typed in your post is true, her actions are not of someone who is mentally sound",
      "created_utc": 1746222563.0,
      "score": 12
    },
    {
      "id": "mqan092",
      "body": "You can be there for her by taking this seriously, getting her psychiatric help, and stop treating it like a joke every time someone here suggests that it’s serious. You’re about to have a kid. Grow up and get your wife help.",
      "created_utc": 1746232934.0,
      "score": 9
    },
    {
      "id": "mqahze9",
      "body": "You being there for her is doing the medically responsible thing. I really hope for your wife's sake that she is able to gain access to the medical care she needs.\n\nIf you want to flip it, wouldn't your wife think something was medically wrong with you if you started acting like this?",
      "created_utc": 1746231100.0,
      "score": 7
    },
    {
      "id": "mqa4ffw",
      "body": "Being there for her would involve getting her help. What you’re wanting to do is enable her to further sink into the mindset she’s in now, for whatever reason.",
      "created_utc": 1746226381.0,
      "score": 7
    },
    {
      "id": "mqac4zm",
      "body": "All of these people are telling you this is a legitimate problem. How do you not know that someone can be mentally ill (temporarily in her case) and still be bubbly? You’re not terribly bright.",
      "created_utc": 1746229019.0,
      "score": 6
    },
    {
      "id": "mqahriq",
      "body": "you don’t know that she’s not mentally ill. you’re not a mental health professional and a number of people who are are telling you she needs help. there’s nothing wrong with being mentally ill!! it doesn’t make you a bad person and it’s not a weakness. even if she’s never shown signs before, she is now. pregnancy can trigger or exacerbate mental health issues. she thinks the ground outside will hurt her baby. that’s not a healthy thought, that’s paranoia. the best way you can support and help her right now is getting her to see a mental health professional who can find out what’s going on and what she needs to feel better.",
      "created_utc": 1746231020.0,
      "score": 6
    },
    {
      "id": "mqb0thz",
      "body": "How young is she and how old are you?",
      "created_utc": 1746238052.0,
      "score": 5
    },
    {
      "id": "mqbm593",
      "body": "If she isn't \"mentally ill\" why are you posting on r/mentalhealth?",
      "created_utc": 1746247218.0,
      "score": 5
    },
    {
      "id": "mqavslu",
      "body": "Would you describe her as out of touch with reality?",
      "created_utc": 1746236175.0,
      "score": 5
    },
    {
      "id": "mqbn5od",
      "body": "You posted this in a mental health sub. She is absolutely mentally ill. People are telling you this and giving advice, which is exactly what you asked for. HELP HER. None of this is normal.",
      "created_utc": 1746247735.0,
      "score": 5
    },
    {
      "id": "mqa8a94",
      "body": "You need to 5150 her for the safety of your child. If something happens you will never forgive yourself. You need to take this seriously.",
      "created_utc": 1746227697.0,
      "score": 3
    },
    {
      "id": "mqbyzfn",
      "body": "You’re wrong. She’s definitely mentally ill and has pregnancy induced paranoia amongst other things. Being young doesn’t make her healthy. If she’s always had anxiety, pregnancy is definitely making it worse. Her symptoms are not normal",
      "created_utc": 1746254316.0,
      "score": 3
    },
    {
      "id": "mqb1hrh",
      "body": "Do you think this is just normal bubbly personality?",
      "created_utc": 1746238314.0,
      "score": 2
    },
    {
      "id": "mqc7zs0",
      "body": "How young is “very young”?",
      "created_utc": 1746259821.0,
      "score": 1
    },
    {
      "id": "mq9516v",
      "body": "If her behaviour has changed this much to the point you post on reddit then it is concerning.",
      "created_utc": 1746215235.0,
      "score": 142
    },
    {
      "id": "mqb97lq",
      "body": "she believes the grass is harmful. \n\nlook, I'm a licensed counselor. I've worked in mental health since 2008. i did crisis mental health assessments for 5 years. \n\nthe info you provided is very concerning for pregnancy-induced psychosis. it's a chemical imbalance in the brain, just like pregnancy-induced diabetes is a chemical imbalance in the pancreas. there's no shame in it, it's just a medical condition that happens and needs to be addressed. but it *does* need to be addressed.",
      "created_utc": 1746241398.0,
      "score": 24
    },
    {
      "id": "mqacir5",
      "body": "I’m starting to think you’re both about 17 years old",
      "created_utc": 1746229151.0,
      "score": 11
    },
    {
      "id": "mqa66yl",
      "body": "Just cuz she’s happy doesn’t mean it’s not psychosis, most people with psychosis think everything is fine… you obviously don’t understand mental illness",
      "created_utc": 1746226982.0,
      "score": 19
    },
    {
      "id": "mqhq9xs",
      "body": "She kept getting discharged, when she shouldn't have. They knew something was wrong, but the doctors wouldn't listen. It's fucking tragic. And now she's a poster-child for all the wrong reasons.",
      "created_utc": 1746336760.0,
      "score": 2
    },
    {
      "id": "mqalq1i",
      "body": "It’s not just the ground thing, it’s being fearful of strangers, being fearful of leaving the house. Eating food in corners and having residue all over her face and refusing to let you wipe it off?? Not recognizing what a cigar is and almost smoking it while pregnant?? These all sound like signs of significant *confusion* which is one of the main symptoms of psychosis. \n\nAs I said above, I work in mental health. I have worked with many people with psychosis. *this sounds like psychosis* whether you want to believe that and actually fucking do something to help your wife is up to you.\n\nPregnancy results in a massive release of hormones into the body which do all sorts of whacky things to people mentally. Until you have consulted with a doctor about this *you cannot know* that it is not psychosis.\n\nYour dismissiveness about this and calling it “possessed or whatever” and your refusal to actually do anything to help your wife gives me serious doubt about you being an actually capable father or husband. What happens later down the line if your child starts having significant mental health issues? Are you going to pretend they aren’t there? \n\nYou are genuinely being ridiculous.",
      "created_utc": 1746232470.0,
      "score": 28
    },
    {
      "id": "mqalvms",
      "body": "It's not a common fear.",
      "created_utc": 1746232526.0,
      "score": 27
    },
    {
      "id": "mqalkfs",
      "body": "Hey, if you don't believe what all these people are saying, then why are you responding? You should go do the work yourself. You have only been an adult for 5 years, yet you believe you know more than everyone here. \n\nChoices are permanent, so the choices you make now will affect your future. It may be wise to listen to others' feedback. \n\nAlso, you make the choice of enabling her behavior. Sure, you can't make her do anything, but is sounds like that's not the same when it comes to you.",
      "created_utc": 1746232413.0,
      "score": 9
    },
    {
      "id": "mqez1c3",
      "body": "Being scared to walk is insane.",
      "created_utc": 1746298502.0,
      "score": 2
    },
    {
      "id": "mqbnnqt",
      "body": "Noted. Troll.",
      "created_utc": 1746247993.0,
      "score": 20
    },
    {
      "id": "mqex3o8",
      "body": "Very uncool. Best of luck to your child❤️",
      "created_utc": 1746297877.0,
      "score": 3
    },
    {
      "id": "mqarz63",
      "body": "Have you read all of OP’s comments?",
      "created_utc": 1746234745.0,
      "score": 1
    },
    {
      "id": "mq9avze",
      "body": "She’s not going to go see a specialist and I can’t force her to",
      "created_utc": 1746216974.0,
      "score": -8
    },
    {
      "id": "mq9cogy",
      "body": "Um yeah exactly . Freaking out over nothing. She’s young",
      "created_utc": 1746217504.0,
      "score": -22
    },
    {
      "id": "mqb7ph7",
      "body": "Reading the post and then ops utterly neglectful comments, I would agree. Has to be",
      "created_utc": 1746240782.0,
      "score": 13
    },
    {
      "id": "mq93jmj",
      "body": "She’s a happy woman",
      "created_utc": 1746214790.0,
      "score": -502
    },
    {
      "id": "mqaj9my",
      "body": "I think that’s where the disconnect is with OP. He doesn’t understand what psychosis is. I’ve seen so many people that think psychosis is the same as being a psychopath or having schizophrenia or dissociative identity disorder.",
      "created_utc": 1746231573.0,
      "score": 31
    },
    {
      "id": "mqabtgo",
      "body": "I feel truly sorry for his wife",
      "created_utc": 1746228908.0,
      "score": 21
    },
    {
      "id": "mqa2ci8",
      "body": "Asking the real question... OP is giving some concerning context clues.",
      "created_utc": 1746225661.0,
      "score": 44
    },
    {
      "id": "mq95c3t",
      "body": "Sometimes you want advice not people telling you your wife might kill your child🤣🤣🤣",
      "created_utc": 1746215326.0,
      "score": -87
    },
    {
      "id": "mqbova7",
      "body": "you also don’t have to want to hurt the baby or anyone to have psychosis. i had PPP and thankfully never had a single thought of hurting my son",
      "created_utc": 1746248617.0,
      "score": 7
    },
    {
      "id": "mqamnox",
      "body": "He’s got to be trolling. I can’t possibly believe someone is THIS willfully ignorant when it comes to the health of his wife and child. If he’s not trolling, then he's not very bright and has a ton of growing up to do. I honestly hope he's trolling. 🤞",
      "created_utc": 1746232806.0,
      "score": 17
    },
    {
      "id": "mq9bb5d",
      "body": "[deleted]",
      "created_utc": 1746217099.0,
      "score": 27
    },
    {
      "id": "mq9eeay",
      "body": "lol I’m convinced you’re trolling now",
      "created_utc": 1746218007.0,
      "score": 61
    },
    {
      "id": "mq9eb18",
      "body": "it explains your lack of awareness, I hope you guys dont end up on the news",
      "created_utc": 1746217981.0,
      "score": 43
    },
    {
      "id": "mq9ejht",
      "body": "And not taking serious mental health advice/concerns for your wife after seeking it out is young...",
      "created_utc": 1746218050.0,
      "score": 28
    },
    {
      "id": "mq9w8ip",
      "body": "She's exactly the age when major mental illness, including psychosis, typically presents.",
      "created_utc": 1746223556.0,
      "score": 20
    },
    {
      "id": "mq9wjdw",
      "body": "They're not talking about her. They're talking about you. A naive person thinks their role in a relationship is to avoid conflict at all costs. Being mature is accepting the possibility of conflict when it's best for your wife and child. You're prioritizing yourself by trying to avoid this conflict. \n\nYou're a father now; even if it makes your wife mad, you must consider your child's well-being. The best thing for your child is to ensure that their mother is physically and mentally healthy.  \n\nIf she is experiencing a mental health crisis, she may end up resenting you for not helping her when she recovers. If you don't address it, and she continues to struggle with her mental health, there could be repercussions that she’ll have to address for the rest of her life. Don't be foolish and ignore what could be symptoms of a treatable illness. \n\nSo accept that she may be upset and bring this stuff up with her Doctor at the next check-up, which should be ASAP. It’s better to be wrong and certain she's okay than avoid an uncomfortable conversation and leave your wife and child in a potentially dangerous condition. ",
      "created_utc": 1746223657.0,
      "score": 11
    },
    {
      "id": "mq9w43g",
      "body": "She is a whole adult who is about to be in charge of the care of an infant. That is not for the faint of heart. She needs to have adult capacity. Her being this afraid and clingy is not cute. It is not safe. It’s not OK for you to be her whole world and for her to be actively afraid of other people, like medical professionals. And as you said in your post, it’s not typical. Please get her some help.",
      "created_utc": 1746223514.0,
      "score": 6
    },
    {
      "id": "mqan8lv",
      "body": "Trollololol as if you’ve had sex and impregnated someone.",
      "created_utc": 1746233018.0,
      "score": 4
    },
    {
      "id": "mqavdrl",
      "body": "Yeah she's young. You can just get a new wife if something happens! This isn't going to get better, post pregnancy hormones can alter behavior dramatically, and you need to be preparing her for it. What are you going to do if she acts like this with the baby? Won't let your family see it, maybe won't let you hold them or change their diaper or give them a bath. Maybe she'll get into crunchy mom conspiracy theories and decide she has to homeschool and avoid the doctor because they scrape their knee one time. \n\nI'm really curious what country you are from, based on the mental health biases you seem to have despite asking for help on the damn mental health subreddit.",
      "created_utc": 1746236022.0,
      "score": 3
    },
    {
      "id": "mqb10bx",
      "body": "And how young are you? Old enough to see these are issues where her telling you she is fine combined with your observations, tells you she's not fine but young enough to not buckle down and step up and get her professional help.",
      "created_utc": 1746238126.0,
      "score": 1
    },
    {
      "id": "mqbzd4p",
      "body": "Schizophrenia can start symptoms at 20-21 years of age! Not saying she has that but she definitely has paranoia and pregnancy makes her anxiety way worse.",
      "created_utc": 1746254544.0,
      "score": 1
    },
    {
      "id": "mq93q4w",
      "body": "You yourself said she's afraid to leave the house. Does that sound happy to you?\n\nWhy did you even post this if you aren't willing to accept the obvious answer?",
      "created_utc": 1746214844.0,
      "score": 427
    },
    {
      "id": "mq96r6p",
      "body": "So... you are coming into this sub. Describe how very unhappy and unwell your wife is... and after others give you a perfectly good explanation you write \"she's a happy woman\"?  \nAre you listening to yourself?",
      "created_utc": 1746215749.0,
      "score": 286
    },
    {
      "id": "mq983wf",
      "body": "Dude she sounds like her head is about to spin 365 degrees and she's gonna start speaking Latin from what you describe. This shit is actually concerning.",
      "created_utc": 1746216149.0,
      "score": 194
    },
    {
      "id": "mq9c4iv",
      "body": "I was a happy woman too.\n\nUntil postpartum hormones fucked me up and I researched putting my 3 months old up for adoption so I could kill myself because I wanted to make sure he would be taken care of and I didn't trust my now ex husband or his family to do that.\n\nShe NEEDS to see a psychiatrist.",
      "created_utc": 1746217340.0,
      "score": 185
    },
    {
      "id": "mq9pfm2",
      "body": "\"famous last words\"\n\njust go to the psychiatrist man, it's not a weakness.",
      "created_utc": 1746221347.0,
      "score": 75
    },
    {
      "id": "mq9am8n",
      "body": "She were a happy person.\nNo she is an ill person who needs help.",
      "created_utc": 1746216894.0,
      "score": 61
    },
    {
      "id": "mq9svpk",
      "body": "She is happy so is this a fake post then? What you described above does not sound like a happy woman lol",
      "created_utc": 1746222455.0,
      "score": 62
    },
    {
      "id": "mq9thhd",
      "body": "If she’s happy why are you posting all her business in a mental health sub asking if she’s okay? She’s obviously not happy and you very obviously do not give a single shit about her or her pregnancy. She’s experiencing a drastic change in hormones that could prove fatal, laugh all you want but don’t do it while you’re picking out matching set of coffins.",
      "created_utc": 1746222649.0,
      "score": 49
    },
    {
      "id": "mq9hgxf",
      "body": "What makes you think she's happy?",
      "created_utc": 1746218911.0,
      "score": 33
    },
    {
      "id": "mqa6ihx",
      "body": "She doesn’t leave the house and eats in corners? That can’t be a happy person",
      "created_utc": 1746227092.0,
      "score": 25
    },
    {
      "id": "mqa66rl",
      "body": "So you asked for help and advice and then laugh and dismiss the advice given…Jesus I feel bad for your wife and future kid.",
      "created_utc": 1746226980.0,
      "score": 23
    },
    {
      "id": "mqa9wff",
      "body": "She’s clearly not fucking happy, you came here because she’s exhibiting extremely concerning behavior and people are responding to you. The way she is behaving is literally psychotic. She needs help.",
      "created_utc": 1746228249.0,
      "score": 15
    },
    {
      "id": "mqah21r",
      "body": "she may be happy overall but the hormones involved in pregnancy can cause very sudden and extreme changes. the paranoia she’s experiencing sounds very much like it could be a sign of psychosis. please take this situation seriously. this is someone you love and she needs help. psychosis can get worse fast if left untreated. plus, she’s probably feeling very scared even if she’s not expressing it. it may not be psychosis, i’m not a doctor, it might be nothing! but whatever it is, a sudden change in behavior and personality is a sign she needs to see a psychiatrist just to see what’s going on and what can be done to help her feel better.",
      "created_utc": 1746230759.0,
      "score": 15
    },
    {
      "id": "mqai82c",
      "body": "How the hell you gonna ask to understand your wife and then dismiss the responses and severity of them.",
      "created_utc": 1746231189.0,
      "score": 13
    },
    {
      "id": "mqasd0l",
      "body": "Hi wife.",
      "created_utc": 1746234889.0,
      "score": 3
    },
    {
      "id": "mqas3gl",
      "body": "Agreed.",
      "created_utc": 1746234789.0,
      "score": 4
    },
    {
      "id": "mqaabdp",
      "body": "The more I think about it the more I’m concerned that she is *too young* or there is some sort of manipulation or abuse. Or it’s rage bait",
      "created_utc": 1746228392.0,
      "score": 37
    },
    {
      "id": "mq96b7x",
      "body": "Honestly your refusal to consider this as an option is telling enough as is. You could save your wife lots of heartbreak if you get her help now.",
      "created_utc": 1746215616.0,
      "score": 193
    },
    {
      "id": "mq95tgk",
      "body": "Listen, it's better to be careful and concerned in such a situation than to later regret it. It doesn't happen often but it does. Pregnancies are unpredictable. They change hormones and even brain structure.",
      "created_utc": 1746215470.0,
      "score": 93
    },
    {
      "id": "mq973t7",
      "body": "What they are telling you is advice.",
      "created_utc": 1746215852.0,
      "score": 43
    },
    {
      "id": "mq9v6ly",
      "body": "The fact that you've been given measured advice, warning you about symptoms that can occur that you are clearly undereducated about, & suggesting that you take your pregnant wife to the doctors so that you can loop in a professional who can make that determination & your ongoing response is to post laughing emojis speaks VOLUMES about just how in over your head you are. I'm not sure if it's immaturity, ignorance or hubris, but this is not the way you support your family through this transitional time.\n\n Being young & happy doesn't inoculate your wife against a  potential biological hormonal condition that can wreak havoc upon her mental health & by proxy, the physical health of your child. The way you can best support your wife through this dramatic & out-of-character mental shift is to bring aboard professionals who can help her through this. It only gets more complicated when this baby is born & if you can't muster the energy & courage to do what is in your wife's best interest now, how are you going to be an advocate for your family afterwards? \n\nMental health is not a stagnant state. MANY factors can impact it & a hallmark of many of these conditions can be a sense of shame & an inability to fully assess one's own level of struggle. You've recognized some concerning & odd changes & it's your duty as both a husband & a soon to be parent to act in a reasonable & responsible manner by bringing her to the doctors.",
      "created_utc": 1746223202.0,
      "score": 36
    },
    {
      "id": "mq98jyx",
      "body": "It’s not something funny. It’s not unknown for this to happen.",
      "created_utc": 1746216279.0,
      "score": 31
    },
    {
      "id": "mqa372y",
      "body": "That is something that *can* happen in extreme circumstances with pregnancy-induced psychosis. I think the people bringing that up are just trying to express how serious it can be. She doesn't have to attempt to kill anyone to need help.\n\nI experienced this type of psychosis. I didn't try to hurt anyone, but I did nearly kill myself and ended up hospitalized. I seemed happy a lot of the time despite acting abnormal like your wife, so my family didn't realize how bad I needed help. Neither did I because I wasn't in a sane state of mind. Then, I took an emotional nosedive that came on very suddenly and was so out of my mind that I tried to kill myself.\n\nThat experience is the most traumatizing thing I've ever experienced in my life. It's hard for me to talk about with people I'm close to, let alone a stranger online. I am only sharing this with you because I'm hoping and praying to God that your wife will get the help that I didn't get and won't have to go through the trauma that I did.\n\nAnd please stop laughing like it's a joke. The \"joke\" is actually other people's trauma and potentially you and your own wife's future trauma if you continue to make light of this.",
      "created_utc": 1746225955.0,
      "score": 19
    },
    {
      "id": "mq9w2yu",
      "body": "How old are you?",
      "created_utc": 1746223503.0,
      "score": 13
    },
    {
      "id": "mq9wm2v",
      "body": "Friend. This is the absolutely worst case scenario. Lots of people can be paranoid, but not violent. The maternal instinct tends to be strong. However. Getting so paranoid and exhausted that you lack judgment is not good. It is not safe. It is certainly not funny.",
      "created_utc": 1746223682.0,
      "score": 13
    },
    {
      "id": "mq9blug",
      "body": "I already know because I invited family over to regulate her feelings and she told me to tell them to leave and she doesn’t need sympathy",
      "created_utc": 1746217186.0,
      "score": -10
    },
    {
      "id": "mqbzf7w",
      "body": "Yes this exactly",
      "created_utc": 1746254578.0,
      "score": 3
    },
    {
      "id": "mqabz6h",
      "body": "At this point I hope it is rage bait...",
      "created_utc": 1746228964.0,
      "score": 21
    },
    {
      "id": "mq99j3d",
      "body": "I appreciate the concern, but she’s genuinely joyful, soft, and attached to the baby. I came here confused, not panicked. I’ll bring it up to her OB calmly, but she’s not dangerous",
      "created_utc": 1746216572.0,
      "score": -24
    },
    {
      "id": "mqbkjj8",
      "body": "And also: how old is the wife? He described her as \"very young\" in one of his comments and somehow this makes me feel worried",
      "created_utc": 1746246423.0,
      "score": 6
    },
    {
      "id": "mq9c135",
      "body": "How on earth do you see this as the same thing as you talking with her primary care provider?",
      "created_utc": 1746217312.0,
      "score": 48
    },
    {
      "id": "mq9vygk",
      "body": "Inviting family can be very daunting. She might feel put under a microscope and judged or attacked. However, just the two of you approaching this as a medical problem related to pregnancy might land much better.",
      "created_utc": 1746223460.0,
      "score": 10
    },
    {
      "id": "mq9c79r",
      "body": "famous last words",
      "created_utc": 1746217362.0,
      "score": 107
    },
    {
      "id": "mq9wv2c",
      "body": "You don’t have to be dangerous on purpose or have ill intent to be dangerous to a baby. OCD like behaviors about getting the baby very clean can be hurtful for skin. In your post you report her saying “the ground is not safe for the baby.”\n\nEdit to add - She’s not your cute, sweet, clingy, irrational life accessory. She’s a whole adult who’s about to be responsible for some important, stressful, and repetitive things that require judgment and responsibility. \n\nYou are both grown-ups and you’re about to be parents. Being a parent means doing hard things like recognizing your wife needs help.  \n\nZoning out into corners, not wiping your face, and wanting to be carried are not typical behaviors.  So either she’s always acted like this and you thought it was *so adorable.* Which it won’t be very soon, when you’re both exhausted. Or this behavior is severely out of character. In which case it’s even more important to put on those big boy pants & help her get assessed & stabilized before real ass life begins.",
      "created_utc": 1746223766.0,
      "score": 62
    },
    {
      "id": "mqcwbtw",
      "body": "!!!Speaking from experience!!! \nNot everyone having a psychosis is dangerous, but it still is a very serious condition that can have long lasting effects when not treated. Having a psychosis damages your brain, the longer it takes to get you out of one or if you have more than one in your life can be debilitating. But when taking the right medication most people will recover sometimes very quickly.\n\nPlease ask for help, even if your wife isn't dangerous!!",
      "created_utc": 1746273758.0,
      "score": 6
    },
    {
      "id": "mqbmjbl",
      "body": "I kinda get the vibe she isn't an adult yet",
      "created_utc": 1746247416.0,
      "score": 16
    }
  ]
}