{
  "id": "1kl2gg0",
  "title": "Helping my boyfriend cope after accidentally seeing cp",
  "selftext": "My boyfriend recently came across a CP website online. He reported it to everyone he possibly could and is trying to move on but it's effected him badly. He says he can't get the images out of his head and he will occasionally just break down in tears.\n\nI looked into it and I can't find any resources to help cope with this kind of thing. There's a lot about how to report it and a lot about legal recourse but nothing about coping emotionally. I wondered if anyone might know where to look? \n\nEdit- if you attempt to turn this into a general anti porn discussion you will be blocked. This is about supporting someone who has witnessed something traumatic and is actively struggling. \n\n\nUPDATE - He's doing a lot better. He managed to get out of the house for a drive on Thursday and I spent all of Friday and Saturday with him. The main thing affecting him was the fear that the children he saw are still in that situation and there's nothing he can do to help them. Fair. I told him that many of the children probably are outside that situation now and even the ones who are still suffering can have a normal life later down the line. People are resilient.\n\nI appreciate all the help people offered especially the personal stories. I didn't expect people to share them especially with some of the less helpful comments on the thread. I did end up telling him about the thread and I've screenshot a lot of the personal stories for him to help him feel less alone. He will be avoiding Reddit as well as some other high risk websites from now on so there's also no risk he'll see the nasty comments which I had been worried about.\n\nAnyway, thankyouu x",
  "created_utc": 1747080251.0,
  "score": 1100,
  "num_comments": 227,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1kl2gg0/helping_my_boyfriend_cope_after_accidentally/",
  "comments": [
    {
      "id": "msyby7j",
      "body": "**Hello u/!**\n\nThank you for tagging your post with a content warning. This helps us share useful resources and prevent unintended triggers.\n\n*Your post may be held for review.*\n\n\n**Resources:**\n- [Rainn.org](https://rainn.org/types-sexual-violence) – Types of sexual violence\n- [Rainn.org](https://rainn.org/after-sexual-assault) – What to do after an assault\n- [Rainn.org](https://rainn.org/effects-sexual-violence) – Effects of sexual violence\n- [HelpGuide](https://www.helpguide.org/articles/ptsd-trauma/recovering-from-rape-and-sexual-trauma.htm) – Recovering from trauma (available in [multiple languages](https://survivorsnetwork.org.uk/resource/survivors-self-help-guide/))\n- [Find A Helpline](https://findahelpline.com/i/iasp) – Global helplines\n- Consider visiting r/rape or r/sexualassault for support.\n- [Supporting Survivors](http://www.tstresources.org/supporting-survivors/) – How to support survivors\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1747575923.0,
      "score": 1
    },
    {
      "id": "mrzaq0z",
      "body": "So basically I wont dwelve into details about the stumbling upon the site, I will give you some advice.\n\nGet him to talk to a therapist, engage in outdoor activities that require a lot of moving, or if you are not able, encourage him to have fun with his friends, that way he won't have that much time to think about it, therefore he won't get triggers. It's hard but he needs to get over it whatever the price is.",
      "created_utc": 1747083828.0,
      "score": 647
    },
    {
      "id": "mrz3ydc",
      "body": "There might not be a specific resource to help with this kind of thing but I do recommend he speak with a therapist or any type of mental health professional so that he can get the help he needs.",
      "created_utc": 1747081780.0,
      "score": 898
    },
    {
      "id": "mrzdvhu",
      "body": "hi, this happened to me accidentally on twitter before. in retrospect i’m not sure if it was actual CP, it could’ve been a girl who looked younger (some people make that on purpose, ew), i didnt really look at it super intently. the initial shock of it had me in tears, shaking and wanting to throw up. all i can say is that time heals, time and distracting yourself. i still feel disgust when i remember it, but now the memories of that vid are obscured and any turmoil it brought has been forgotten. so, i’d say, have him preoccupy himself w something else (i had uni stuff), and just wait, be patient.",
      "created_utc": 1747084801.0,
      "score": 275
    },
    {
      "id": "mrzhgqz",
      "body": "Maybe not the exact same thing but I sound stills of CSA images on my ex boyfriends computer years and years ago.\n\nI nearly threw up and I cried and I hated him and felt disgusted in myself for ever going near him.\n\nMaybe it’s not having a very visual memory, but ie was more the emotions that got to me and like some others have said that truly it is time that heals these things the most. \n\nI’d also recommend he gets an appointment with a therapist who may have distraction techniques that may help with his symptoms. \n\nJust some things off the top of my head that can help with anxiety / panic / struggling with emotions:\n\n- Deep breathing. This slows your heart down and it gets more oxygen into the brain which can create a mildly euphoric sensation but it inevitably calms a racing heart.\n- Take a walk as fresh air and nature are both good for the body but also a visual distraction for the mind.\n- Research grounding techniques. One for example is naming 5 things you see, 4 things you can hear, 3 things you can feel, two things you can smell and one thing you can taste. \n\n\nThe said ex boyfriend filmed us being intimate at 17 and showed people we knew and for all I know, put it online. Your boyfriend did the right thing to get it taken down as swiftly as possible.",
      "created_utc": 1747085922.0,
      "score": 49
    },
    {
      "id": "mrzg0bw",
      "body": "I recommend he play Tetris. There's _some_ evidence suggesting it's helpful for intrusive images and the upset they cause. Worst case scenario, he played Tetris for 20 minutes. He could try journaling. He could try breathing or humming to help calm down his nervous system when the images pop back up in his mind (vagus nerve stimulation).",
      "created_utc": 1747085465.0,
      "score": 292
    },
    {
      "id": "mrzevpk",
      "body": "I understand how horrible this can be for your partner, whilst I've not experienced this myself, I have seen videos of people being killed and it absolutely can traumatise a person. \n\nI'd say the best thing you can do is to ensure that he knows he has your love and support, and that you aren't judging him like half the people in this comment section. I'd also recommend some sort of counselling service, a place for him to talk about what happened and work through it.",
      "created_utc": 1747085111.0,
      "score": 83
    },
    {
      "id": "mrzntp2",
      "body": "**this is just my opinion. Please do your own research into what I say. Don't just believe me.**\n\nJust to add to the conversation, a trauma-informed therapist can help.\n\nIf the images are functioning like flashbacks (getting triggered by things happening in his environment or by things happening in his brain), I'd recommend he goes to someone who is trained in EMDR and who can do EMD on the images. In my experience, that's a great way to forget/not be bothered by awful images I've seen.",
      "created_utc": 1747087967.0,
      "score": 25
    },
    {
      "id": "mrzptee",
      "body": "Back when I was in high school I would surf the dark web for fun and I accidentally stumbled on a gore site that included the bodies of some children. For clarification I actually only saw an image promoting the site as like a pop up. The brief glance was enough to give me nightmares for weeks.\n\nTime was the best healer. It gave me a greater appreciation for my very fortunate life. Time will help a lot.",
      "created_utc": 1747088632.0,
      "score": 22
    },
    {
      "id": "mrzav4u",
      "body": "as someone else said, resources for this kind of thing will likely be minimal. However, maybe research what has helped people who have witnessed things they didn't want to see, and having flashbacks as such-some of them may be of use?",
      "created_utc": 1747083872.0,
      "score": 39
    },
    {
      "id": "mrzln0v",
      "body": "I get all fucked up when I see pics/videos of dead animals. People are sick.\n\nThe only thing that helped me was time and lots of distractions.\n\nGL",
      "created_utc": 1747087245.0,
      "score": 38
    },
    {
      "id": "mrzkqb1",
      "body": "If you guys can afford a couple of therapy sessions, please do it. It might be helpful to research vicarious trauma, there's some info out there based on journalism and trauma. I'm not sure if there's anything out there specifically about this other than your typical advice from places like childline. Unfortunately, yes, content like this appears in very easy to access areas of the internet. It's not all hidden away how we'd like to believe. I'm sorry he's going through this. It does ease up in time, but it's very important to address it with a therapist now if you're able to.",
      "created_utc": 1747086952.0,
      "score": 12
    },
    {
      "id": "ms0vfzh",
      "body": "CP has become crazy all over twitter. I no longer use it for that reason. It’s literally a search away fuck that.",
      "created_utc": 1747102894.0,
      "score": 13
    },
    {
      "id": "mrzwhfh",
      "body": "i'm so sorry your boyfriend had to go through something like that. i've been in a similar situation before and i'm still struggling to this day to recover. i've gotten a lot better, though -- one thing i highly recommend is for your boyfriend to engage in more hobbies/find distractions to take this off his mind. i'd also suggest having him talk to a licensed therapist. though it might be embarrassing for him initially, it'll really benefit him in the long run. make sure you also tell him that you're on his side so he knows he's not alone.\n\ncp is incredibly evil and i can't imagine how sick someone would be to upload that kind of content. your boyfriend is a prime example of how people can get affected even if they didn't partake in the actual porn. again, i'm so sorry your boyfriend had to experience that and make sure you tell him that this was not his fault.",
      "created_utc": 1747090918.0,
      "score": 7
    },
    {
      "id": "ms0yl5i",
      "body": "I used to work with the police who used to have to grade CP for court. Someone needs to sit and go through every image and video for the case and say how many are level 1, how many are level 2… therapy was mandatory. I would recommend a therapist that specialises in a trauma therapist  that specialises in sexual abuse survivors.",
      "created_utc": 1747104034.0,
      "score": 8
    },
    {
      "id": "ms0ndss",
      "body": "As a counselor, I agree with everyone saying counseling asap.",
      "created_utc": 1747100139.0,
      "score": 5
    },
    {
      "id": "mrzr61i",
      "body": "EMDR, brainspotting, and/or somatic therapy",
      "created_utc": 1747089092.0,
      "score": 9
    },
    {
      "id": "ms37xen",
      "body": "You’re absolutely right, and your insight cuts to the core of what makes exposure to child sexual abuse material (CSAM) psychologically devastating. It’s not just the imagery. It’s the existential gut-punch that comes from seeing irrefutable proof that this kind of evil is real, systemic, and in many cases actively growing. You don’t just witness trauma, you confront the predator in the human species, and it rewires something primal in you.\n\nYour boyfriend didn’t choose this trauma, but now he’s bearing the psychological cost. What he’s experiencing is consistent with what’s often called vicarious trauma or moral injury. It’s common among detectives, forensic analysts, child protection workers... anyone exposed to human cruelty in a way that shatters their belief in safety, decency, or the moral fabric of the world. And yes, it can absolutely lead to PTSD symptoms: intrusive thoughts, emotional numbness, flashes of rage, guilt, even existential despair.\n\nThe best path forward is not generic talk therapy; it’s targeted, trauma-specific intervention. He needs to work with a therapist trained in EMDR (Eye Movement Desensitization and Reprocessing) or Cognitive Processing Therapy (CPT). EMDR, in particular, is powerful for this type of trauma because it helps the brain reprocess and de-charge the memory loops without requiring the person to re-live the experience endlessly. You can find qualified EMDR therapists via [https://www.emdria.org](https://www.emdria.org), and I strongly suggest looking for someone with experience treating first responders or moral injury trauma, not just general anxiety or depression.\n\nIn the meantime, reassure him that his reaction is sane. That sickening, hollow, world-breaking feeling he has? That’s not dysfunction; that’s what it feels like when a good man brushes up against real evil. Validate his rage. Acknowledge the grief. Let him know that the fact he’s shaken is not a weakness. It’s a sign of a strong conscience, still intact. And remind him: “You’re not weak for being affected. You’re strong for still giving a damn.”",
      "created_utc": 1747143399.0,
      "score": 9
    },
    {
      "id": "ms3cfg4",
      "body": "I accidentally clicked on link that led me to discord server with cp content. The sht I saw there OMG . I was hysterical. I panicked and closed everything. First 2 weeks I couldn't stop thinking about it. Pedo comments, the horror videos... I don't have advice, but just want to say that after 2 weeks I thought about it less and less. Give it time. Morbid side of humanity  is sick",
      "created_utc": 1747144848.0,
      "score": 4
    },
    {
      "id": "mrz7aie",
      "body": "[deleted]",
      "created_utc": 1747082789.0,
      "score": 15
    },
    {
      "id": "ms1smr0",
      "body": "At least he didn't do that on a site basically filled with it...like discord I ran into several malicious links that were literally just massive files filled with CP being spammed in non NSFW discord servers don't think that kind of thing is happening now tho (at least I hope not)",
      "created_utc": 1747117924.0,
      "score": 3
    },
    {
      "id": "mrz62yl",
      "body": "What is CP",
      "created_utc": 1747082425.0,
      "score": 6
    },
    {
      "id": "mryytvb",
      "body": "**Hello u/!**\n\nThank you for tagging your post with a content warning. This helps us share useful resources and prevent unintended triggers.\n\n*Your post may be held for review.*\n\n\n**Resources:**\n- [Rainn.org](https://rainn.org/types-sexual-violence) – Types of sexual violence\n- [Rainn.org](https://rainn.org/after-sexual-assault) – What to do after an assault\n- [Rainn.org](https://rainn.org/effects-sexual-violence) – Effects of sexual violence\n- [HelpGuide](https://www.helpguide.org/articles/ptsd-trauma/recovering-from-rape-and-sexual-trauma.htm) – Recovering from trauma (available in [multiple languages](https://survivorsnetwork.org.uk/resource/survivors-self-help-guide/))\n- [Find A Helpline](https://findahelpline.com/i/iasp) – Global helplines\n- Consider visiting r/rape or r/sexualassault for support.\n- [Supporting Survivors](http://www.tstresources.org/supporting-survivors/) – How to support survivors\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1747080251.0,
      "score": 2
    },
    {
      "id": "ms10kdx",
      "body": "Therapy \nTime and staying busy. At the end of the day, finally processing it is what will make it go away.\n\nTrauma emerges when something far beyond your conceptual understanding happens to you involuntarily.\nIn attempt to process it, your mind keeps going back to it\nIn the hopes it can handle it, may it happen \n\nRight now he is so shocked by it that emotions is associated with it and takes a hold of him and his thoughts while he flashes back. If he stay idle, god knows where this irrational state will take him when he overthinks.\n\nUnderstanding why one woukd react this way goes a long way. Just because you are reacting irrationally right now doesnt mean you were always that way, will remain that way or that you are weak. People get traumatised for less. And thats okay, you need to move forward.\n\nHe needs something else to take his focus. Something that will engage him emotionally in a different way. These emotions needs to calm down first before he can process it in a more objective way.\n\nHe needs to understand that he should not let something like this turn him jaded, lose hope or be grim. \nBeing brave is one of the biggest virtue of living.\nTo find joy, knowing how grim the world can be.\nTo be vulnerable, knowing you can get hurt.\nTo be strong, knowing you may not protect against everything. All that demands bravery.\nTo move forward eventhough you are afraid is the definition of courage, not the lack of fear.",
      "created_utc": 1747104783.0,
      "score": 2
    },
    {
      "id": "ms1u47f",
      "body": "this happened to my best friend and i years ago, i think we were 20/21ish? i'm now almost 26. we were on omegle (before it was shut down) and you know how people have like fake video camera overlays instead of their actual face? it was via that. the way we both gasped. i immediately skipped.. the several moments of silence between us was VERY loud. without being too graphic, i feel very lucky that it was only playing for 1-2 seconds and it was just something about to happen, but hadn't, but it was very clearly about to. some sick person had clearly WANTED people to stumble across a loop of this video. the experience has stuck w me but it gets easier w time. i am sorry this happened to someone you care about. it's not fair how common this is, both being abused as a child and witnessing it without meaning to. i just want peace for anyone struggling :((",
      "created_utc": 1747118784.0,
      "score": 2
    },
    {
      "id": "ms25hia",
      "body": "The thing about our memories is they are so much more connected to our bodies than we realize. Tell him to work on breathing and relaxing and maybe even meditating whenever he remembers these disturbing images so that his body trains itself to calm down. That’s something that’ll get easier to do over time.",
      "created_utc": 1747125777.0,
      "score": 2
    },
    {
      "id": "ms27l4h",
      "body": "Im truly sorry that he had to go through this; I've never been in this situation but I can say that just being there for him and having him talk about it when he needs it is the best thing to do. . . There arent alot of resources out there which sucks; but what he needs most is a support system because that shit fucks with you deeply. \n\nI hope he does move past this one day- but I cant imagine the emotional trauma and psychological trauma he's going through.  . .",
      "created_utc": 1747127098.0,
      "score": 2
    },
    {
      "id": "ms4le3q",
      "body": "I can tell you that I witnessed this sort of shit (photos) ~45 years ago and I can still see it..",
      "created_utc": 1747158039.0,
      "score": 2
    },
    {
      "id": "mrzr6gh",
      "body": "I saw something really fked up by an accident once. A woman I was hanging out with put on a site she posted on. It wasn't what your man saw thankfully, but it was bad. Still get goosebumps to this day. My suggestion would be to look into CBT therapy, and see if that works for starters.",
      "created_utc": 1747089097.0,
      "score": 4
    },
    {
      "id": "ms0ml2i",
      "body": "To reduce ptsd in general, lift weights, take walks through forests, and play 2d games that do not contain characters, that involve real time decisionmaking. Alternatively Getting Over It With Bennet Foddy (this is a brute force method tho).\n\nWeight lifting builds neurological strength which impedes the trauma recursiveness. The 2d stuff helps because if it has no triggers, the mind interrupts the old visual data with this new data trying to future-predict, and it knocks out all the triggering visual stuff (maybe not conceptual stuff tho). \n\nAnd if they are still bothered conceptually, activism.",
      "created_utc": 1747099864.0,
      "score": 3
    },
    {
      "id": "ms09g2d",
      "body": "There’s studies that show that playing Tetris after a traumatic event helps to prevent PTSD. Can’t explain to you why, but no harm in trying? You can play for free online on tetrio.io",
      "created_utc": 1747095228.0,
      "score": 3
    },
    {
      "id": "mrzfu9s",
      "body": "He's got what we call around here \"the horrors\", the images and trauma that pop back up randomly and throw you back into a Very Bad Place. Thus far, the thing that I've found that works consistently and with the least amount of \"slogging\" is EFT with EMDR, also known as Tapping. There aren't a lot of therapists who do it because it's been misappropriated by the \"the Secret\" crowd, but I can personally attest to its value as a trauma treatment. I do it for my community, and I think there might be some other resources at emofree dot com.",
      "created_utc": 1747085412.0,
      "score": 3
    },
    {
      "id": "ms2daa6",
      "body": "It sounds like he could benefit from brief counseling for trauma. Because he is having a trauma response--which is fairly *normal* for the brain to process it like that. \n\nWe might call it an Acute Stress Response (diagnostically; I'm not diagnosing him though). If the symptoms persist is where there can be longer lasting problems. Which is why processing the stressor may help",
      "created_utc": 1747130546.0,
      "score": 2
    },
    {
      "id": "ms0kzzy",
      "body": "I feel really sorry for your boyfriend. Sending thoughts and prayers. 🙏🏻\n\nMaybe a therapist would help?",
      "created_utc": 1747099303.0,
      "score": 1
    },
    {
      "id": "ms0xeoq",
      "body": "Therapists are trained in how to deal with second hand trauma and separate themselves from the really awful things that people have to tell them. Ideally he needs to find a \"higher ranking\" therapist who has experience with supervising and training other therapists and teaching the same skills that will help him. \n\nHigher ranking meaning advanced degree/license. An LPCC vs LPC or MSW vs LISW.  When you make an appointment or ask for a referral explain what the situation is and emphasize he needs help with second hand trauma.  \n\nEdit: My partner is an LPC and I asked him to double check my work. He says any trauma informed therapist should be able to help.",
      "created_utc": 1747103596.0,
      "score": 1
    },
    {
      "id": "ms10wyx",
      "body": "What is CP? 😵‍💫",
      "created_utc": 1747104918.0,
      "score": 1
    },
    {
      "id": "ms1bff6",
      "body": "This is one of my biggest fears, accidentally seeing something awful like that online. Do you mind how if I ask how it happened, like was he just randomly looking around online and a website featuring that vile content just came up?",
      "created_utc": 1747109259.0,
      "score": 1
    },
    {
      "id": "ms2eui3",
      "body": "I would be very careful about suggesting him to talk to a therapist about it when therapists are legally mandated reporters.\n\nIf you tell a therapist you saw CP online, there is a possibility they have to report that and your bf might get a knock at the door.",
      "created_utc": 1747131429.0,
      "score": 1
    },
    {
      "id": "ms2o3z3",
      "body": "What is CP?",
      "created_utc": 1747135946.0,
      "score": 1
    },
    {
      "id": "ms3nwvj",
      "body": "I was chatting to a guy and he was sending me memes and reels\nUnfortunately he had accidentally viewed the wrong reel of an individual playing with herself - especially her breasts \n\nAs soon as I told him the girl looked no younger than 16, he realised he’d clicked on the wrong link",
      "created_utc": 1747148323.0,
      "score": 1
    },
    {
      "id": "ms3sn8p",
      "body": "All I can think of is Trauma Informed Therapy and trauma focused therapy. One of them is to reframe intrusive thoughts and reduce stress. I’m sorry if I mixed them up",
      "created_utc": 1747149711.0,
      "score": 1
    },
    {
      "id": "ms3wz53",
      "body": "What I recommend is confronting the problem, ideally with the support of a therapist,  and using journaling as a tool. Journaling helped me overcome severe addictions and trauma. The key was facing the problem before it overwhelmed me. Escaping or suppressing issues might feel easier short-term, but it’s not sustainable and often harmful in the long run.\nThat’s been my way of dealing with problems, big or small — and it’s always worked for me.\"",
      "created_utc": 1747150957.0,
      "score": 1
    },
    {
      "id": "ms49v1l",
      "body": "Find a counselor who specializes in PTSD",
      "created_utc": 1747154728.0,
      "score": 1
    },
    {
      "id": "ms4h6lw",
      "body": "EMDR therapy would be great for this.",
      "created_utc": 1747156834.0,
      "score": 1
    },
    {
      "id": "ms4nme8",
      "body": "If there is a sexual trauma center near you (also called rape crisis center), reach out to them. They usually have a 24/7 hotline and should be glad to talk with you about how to support your partner. They also usually have therapists on staff and many offer free or reduced-cost therapy for survivors of sexual trauma, and they may agree to provide therapy to him as someone who has witnessed something so traumatic. \n\nAs someone in the support role, the main thing you can do is to really listen to him and validate that whatever he is feeling is okay and normal to feel. Everyone processes trauma differently, so however he is processing it is valid and unique to him. If you find him not participating in things he usually enjoys, offer encouragement for him to re-engage with those activities, maybe even by engaging in those activities with him or organizing some friends who enjoy those same activities. \n\nI knew an investigator who took a job investigating this exact crime, and his job often entailed studying these images. He lasted less than a year, even after all the specialized training he had to go through to do the job. He said that in just the few months he was doing the job, he will forever have those images scorched in his brain. I can't even imagine the horrors of seeing such a thing. I truly wish you both the best moving forward from this.",
      "created_utc": 1747158666.0,
      "score": 1
    },
    {
      "id": "ms4rora",
      "body": "i haven’t had this experience specifically, but as someone with OCD who experiences  insanely vivid intrusive thoughts, when they come up i literally say STOP loudly and shake my body and it kind of tears me away from that thought spiral. it doesn’t prevent them from happening but it prevents them from becoming overwhelming immediately. the physical movement tears me away from what’s going on in my head. this is just my 2 cents, it’s worked for me but that doesn’t mean it works for everyone! maybe worth a try tho",
      "created_utc": 1747159824.0,
      "score": 1
    },
    {
      "id": "ms51c57",
      "body": "Contrary to the advice most people give, psychotherapy too soon after a traumatic incident is actually harmful in many cases (see references). Most people recover from traumatic incidents after a period of difficulty with their mental health. Counterintuitively, the expression of distress shortly after the event is actually correlated with better long-term outcomes. People who have a numbing, or avoidance response or who withdraw from social support systems are the types who are statistically more likely to develop PTSD. The mechanism is basically that avoiding the disturbing emotional experience after the event, pushes it into the subconscious and it comes back to affect you intrusively. You must go through the period of distress and form a narrative around what you experienced so that it doesn't get stuck in the subconscious mind to haunt you. The suppression of fear and stress circuitry is not good for us. \n\nWhat your boyfriend experienced is bad. He is having a reasonable reaction to that. I think it's really good that he has your support at this point in time. The best thing you can do for him is to provide support as his partner. Help him meet his needs- whether that's providing meals, or holding him while he cries. Humans have a natural recovery process they go through after distressing experiences and seeking support from their loved ones is what helps that process progress. Help him externalize what his mind is doing. Help him find the words to describe his experience if he struggles to do that. If he continues to have problems certainly seek support, but in the short term (ie: \\~1 month) it's entirely normal to struggle. \n\n[https://pubmed.ncbi.nlm.nih.gov/14728094/](https://pubmed.ncbi.nlm.nih.gov/14728094/)\n\n[https://pubmed.ncbi.nlm.nih.gov/27710783/](https://pubmed.ncbi.nlm.nih.gov/27710783/)\n\n[https://pubmed.ncbi.nlm.nih.gov/14754765/](https://pubmed.ncbi.nlm.nih.gov/14754765/)\n\n[https://psycnet.apa.org/record/1994-97710-000](https://psycnet.apa.org/record/1994-97710-000)",
      "created_utc": 1747162584.0,
      "score": 1
    },
    {
      "id": "ms53svo",
      "body": "Are you US, Europe or UK based etc?",
      "created_utc": 1747163309.0,
      "score": 1
    },
    {
      "id": "ms6q4xs",
      "body": "Something similar happened to me but with like really dark gore videos, I could not get them out of my head for like weeks and the images kept flashing in my head, it made me nauseous. I don’t know much about resources and would imagine just talking about it with his therapist is probably the only thing, but for me it was just letting time pass and not going near anything like that again. Filling your head with other thoughts and trying to willfully forget the pictures jn your head.\n\nThere’s probably other underlying reasons it affected him so much",
      "created_utc": 1747181679.0,
      "score": 1
    },
    {
      "id": "ms6xcsk",
      "body": "Maybe therapy will help, tell him they won't judge him and it's not his fault.",
      "created_utc": 1747184272.0,
      "score": 1
    },
    {
      "id": "ms6xk6m",
      "body": "I had a similar experience but with animal cruelty. I have to remind myself, daily but less and less, that with technology as advanced as it is (Reddit won't let me use the a1 word) that it is possible some or all of the terrible things I have seen are not actually real. Theres no way to know for sure of course, but that fact gets me out of some bad spiraling sessions over the disgusting images I'll never be able to forget.",
      "created_utc": 1747184343.0,
      "score": 1
    },
    {
      "id": "ms7cv00",
      "body": "I haven't read through all of the replies but I do have an idea about who might be able to help. Contact the local Victims advocate in your area. Just search Victims advocate in blank county. This should give you a phone number. They work with people who are Victims of all kinds of crimes. They would have a wide variety of resources available. They might even be able to offer some free services considering your boyfriend is a victim of this crime. Just in a different way than most are. Give them a call. I hope they can help.",
      "created_utc": 1747189761.0,
      "score": 1
    },
    {
      "id": "ms88ibx",
      "body": "What's CP?",
      "created_utc": 1747204243.0,
      "score": 1
    },
    {
      "id": "ms9nqza",
      "body": "Look it was an accident everything will be ok. He will not get in trouble since it was an accident. Accidents happen no matter what it was. You can report the sites in. I don't know how,but it is possible. Almost everyone's had at least one bad accident happen to them. Have him talk to a therapist.",
      "created_utc": 1747229805.0,
      "score": 1
    },
    {
      "id": "msfu711",
      "body": "When I see scary stuff online I just tell myself it’s  probably ai and revert back to the whole “not everything online is real”",
      "created_utc": 1747312939.0,
      "score": 1
    },
    {
      "id": "msieh5p",
      "body": "If it’s bothering him that bad he should see a psychologist.",
      "created_utc": 1747340728.0,
      "score": 1
    },
    {
      "id": "msvbxdt",
      "body": "I didn't know what \"cp\" meant, so in the most tactful way possible I tried to get educated, and as soon as I saw the words I was sick to my stomach. I can't even imagine actually coming across something like that. \nI would highly recommend seeking out a therapist. I wouldn't be surprised if a large part of what he's feeling is guilt for having seen such awful (and illegal) content, and those emotions need to be worked through and vocalized.",
      "created_utc": 1747523278.0,
      "score": 1
    },
    {
      "id": "mt6f2jy",
      "body": "Someone once sent a CP GIF in a Discord group chat that I was in, and it scared the hell out of me. Had a great impact on me for several days, couldn't sleep well and I walked around super uptight in school. Everything turned out better eventually, and I'm sure that your guy will get better, as well.\n\nI don't really know how I can help, but I wish him the best. Some people in the comments got some good methods to deal with it.",
      "created_utc": 1747684475.0,
      "score": 1
    },
    {
      "id": "ms009vr",
      "body": "This is why even tho I’ve seen videos about exploring the dark web and stuff I’ve never done because I’m scared of accidentally stumbling upon something like this . I’m sorry he had to go through with it",
      "created_utc": 1747092219.0,
      "score": 1
    },
    {
      "id": "ms35g8i",
      "body": "A sex therapist who is trained in this kind of subject matter could be a really great place for him to process. I’m so sorry this happened.\n\nAlso, these comments are horrid. Y’all clearly need help if you’re trolling on a MH sub. Smh.",
      "created_utc": 1747142561.0,
      "score": 1
    },
    {
      "id": "mrz44ll",
      "body": "[removed]",
      "created_utc": 1747081832.0,
      "score": -34
    },
    {
      "id": "mrza968",
      "body": "[deleted]",
      "created_utc": 1747083685.0,
      "score": -5
    },
    {
      "id": "ms2hblr",
      "body": "Im sorry, but why is questioning how he came upon this lockable?",
      "created_utc": 1747132761.0,
      "score": -2
    },
    {
      "id": "ms2q08c",
      "body": "Iam not sure how much regular police enforcement can help considering that usually when it comes to things like trafficking or sex abuse on children there are specialised charities out there and units specifically for these things maybe do some research and try and find a group that's would work within this area. \n\nI was listening to lady from America explain how in her state calling the cops for this kind of thing was useless and she reccomned trying to call a specific unit for these kinds of things. \n\nOne of the dangers of reporting csam is that as long as those images remain on the web survivors have proof of their abuse so if it makes him feel better remind him that those images being up there and public for people to see then survivors have a catalog of there abuse that means should they go to court for what happened to them they have a much stronger case. So people wanting to do the right thing and get rid of those images dosent actually help survivors it just gets rid of evidence.",
      "created_utc": 1747136768.0,
      "score": 0
    },
    {
      "id": "ms78lws",
      "body": "Try reiki. It helped me stop my repetitive thoughts",
      "created_utc": 1747188214.0,
      "score": 0
    },
    {
      "id": "ms7gdin",
      "body": "How do you just accidentally stumble across it? Even search for adult P needs to have a specific word before google will generally land those results.",
      "created_utc": 1747191073.0,
      "score": 0
    },
    {
      "id": "ms8h9xq",
      "body": "You can report him to police and give them\nHis computer as evidence.",
      "created_utc": 1747209588.0,
      "score": 0
    },
    {
      "id": "msi6b4u",
      "body": "If it's actually CP (real minors being abused basically), because CP is not porn is always R*pe, literally report the site to the authorities. It's literally illegal ",
      "created_utc": 1747338350.0,
      "score": 0
    },
    {
      "id": "ms05r4q",
      "body": "[removed]",
      "created_utc": 1747093982.0,
      "score": -32
    },
    {
      "id": "mrzchzn",
      "body": "[removed]",
      "created_utc": 1747084378.0,
      "score": -79
    },
    {
      "id": "mrzchf0",
      "body": "[removed]",
      "created_utc": 1747084373.0,
      "score": -87
    },
    {
      "id": "mrzlt84",
      "body": "Are you sure he doesn’t just feel guilty? Or worried he’ll get in trouble?",
      "created_utc": 1747087301.0,
      "score": -40
    },
    {
      "id": "ms1xej6",
      "body": "[removed]",
      "created_utc": 1747120726.0,
      "score": -10
    },
    {
      "id": "ms09lp6",
      "body": "He needs to try to not have an intense emotional response to when it pops in his head... that just makes it worse. Horrible things happen to those of us unfortunate enough to have to endure it and it's awful even for others to witness... he did all he could. Time to let it go. He needs to calm down the parts in him freaking out over it from a place of compassion patience and no judgment. make gentle redirections to r/eyebleach style content",
      "created_utc": 1747095281.0,
      "score": -11
    },
    {
      "id": "ms0cn99",
      "body": "[removed]",
      "created_utc": 1747096337.0,
      "score": -36
    },
    {
      "id": "ms0a7r2",
      "body": "[deleted]",
      "created_utc": 1747095495.0,
      "score": -35
    },
    {
      "id": "mrzawwa",
      "body": "Thankyou. This is genuinely really helpful!",
      "created_utc": 1747083887.0,
      "score": 154
    },
    {
      "id": "ms0dg27",
      "body": "Like EMDR!  Also playing Tetris has been proven to help.",
      "created_utc": 1747096621.0,
      "score": 31
    },
    {
      "id": "ms2cifu",
      "body": "This is the best start. He can work from there.",
      "created_utc": 1747130103.0,
      "score": 76
    },
    {
      "id": "ms50bzd",
      "body": "Yup. Seek therapy. That is the resource to all mental health resources.",
      "created_utc": 1747162292.0,
      "score": 18
    },
    {
      "id": "mrzed7t",
      "body": "I really appreciate your insight in this. It's disheartening how many people are treating this like it isn't something that could happen to them. I don't think I will mention this thread to him but I will let him know that it will pass and he is justified in feeling disgusted.",
      "created_utc": 1747084953.0,
      "score": 84
    },
    {
      "id": "mrziagw",
      "body": "I'm sorry that happened to you. I appreciate your advice and I'll tell him about grounding techniques.\n\nWe have tried to access therapy for him before for unrelated mental health issues and have always hit a wall. I may look into it again to see if there are more specific options available this time.",
      "created_utc": 1747086180.0,
      "score": 16
    },
    {
      "id": "mrzrkw5",
      "body": "I had to play tetris after looking at certain war images from the past few years. It did calm my mind in the moment.",
      "created_utc": 1747089233.0,
      "score": 95
    },
    {
      "id": "ms0yxqh",
      "body": "As a person with C-PTSD and a high stress job, I second playing Tetris. It works",
      "created_utc": 1747104163.0,
      "score": 24
    },
    {
      "id": "ms0d5v4",
      "body": "I’ve heard of this too! Something about your eye movements being similar to how your eyes move during EMDR, which is a trauma based therapy. I’d have him try it!",
      "created_utc": 1747096521.0,
      "score": 19
    },
    {
      "id": "ms08p8s",
      "body": "I think according to the study you're referring to it has to be more immediate after the trauma.",
      "created_utc": 1747094980.0,
      "score": 28
    },
    {
      "id": "ms15u82",
      "body": "Crosswords and other soothing logic-style games have helped me with my anxiety too. Sudoku, Dr Mario, Marble shooter games, and merging games as well. They’re all simple, yet require enough of a level of cognition to distract me from more severe symptoms.",
      "created_utc": 1747106876.0,
      "score": 9
    },
    {
      "id": "ms2ys91",
      "body": "Yes ! It’s also great for elderly people, it helps with their memory and dexterity a lot. My great grandma used to play tetris on an old Game Boy when she was like 88, and she loved it. I actually have her game boy at home with me. I think she even played Super Mario Land sometimes. She didn’t have dementia but I think it can also help with that, as well as Alzheimer and other conditions that old people often have. It can be an amazing tool, I have a mild anxiety disorder and starting to play games again has only brought me positive things !",
      "created_utc": 1747140218.0,
      "score": 5
    },
    {
      "id": "mrzfhq0",
      "body": "Thankyou. I've blocked most of those people so I actually can't see what they're saying anymore but I can see you sticking up for me and my boyfriend which I appreciate. \n\nI will let him know.",
      "created_utc": 1747085302.0,
      "score": 37
    },
    {
      "id": "mrzb661",
      "body": "Thankyou. I think this is a good idea.",
      "created_utc": 1747083964.0,
      "score": 7
    },
    {
      "id": "ms1nmp5",
      "body": "[removed]",
      "created_utc": 1747115140.0,
      "score": -27
    },
    {
      "id": "ms75dzk",
      "body": "God, it’s really horrible to think about this. It’s not something that I ever really considered but now I feel so bad for those people who have to do it as part of their job. If you ever had to see any of it I hope you’re doing well.",
      "created_utc": 1747187095.0,
      "score": 2
    },
    {
      "id": "ms1d9o9",
      "body": "Came here to say all of those modalities could be helpful. OP, for somatic-based therapies, he may talk a little with the therapist about what he saw, but these approaches mainly work with body sensations. I haven't learned enough to use them with clients, but some of my colleagues talk about positive outcomes from EMDR and Brainspotting sessions that were entirely body-focused.\n\nIn the meantime, you can support him as he experiences triggers and struggles by validating his feelings. What he saw was horrible, it makes sense the thoughts would linger and be distressing. If he's a person who enjoys touch, maybe hold his hand. You can also get him things to tend to his body, like a blanket, glass of water, something to hold.",
      "created_utc": 1747110069.0,
      "score": 3
    },
    {
      "id": "ms4hfi6",
      "body": "THIS^^^^",
      "created_utc": 1747156907.0,
      "score": 1
    },
    {
      "id": "mrz7pm1",
      "body": "As stated he has reported it. He was looking for regular porn and happened upon the website. We are both shocked that this website was able to just exist on the internet but it did. I'm looking for mental health resources now as he has already done everything he can as far as reporting goes.",
      "created_utc": 1747082915.0,
      "score": 38
    },
    {
      "id": "mrz6z76",
      "body": "Child porn. Didn't say it cuz it's triggering for people and not a regular subject of this subreddit I assume.",
      "created_utc": 1747082695.0,
      "score": 38
    },
    {
      "id": "ms0qqk5",
      "body": "The secret crowd??",
      "created_utc": 1747101305.0,
      "score": 1
    },
    {
      "id": "ms0qzqk",
      "body": "NVM just looked it up",
      "created_utc": 1747101394.0,
      "score": 1
    },
    {
      "id": "ms1qow3",
      "body": "Child porn :(",
      "created_utc": 1747116816.0,
      "score": 1
    },
    {
      "id": "ms36qac",
      "body": "As a sex therapist, we are mandated to report when we find out someone is actively abusing a child or has knowledge of someone else actively abusing a child. I would report the website, but I would not have to report the client. The client is not creating nor distributing, therefore they are not involved in said abuse.",
      "created_utc": 1747142992.0,
      "score": 4
    },
    {
      "id": "ms2f6ki",
      "body": "He's already reported it so this isn't a concern",
      "created_utc": 1747131613.0,
      "score": 3
    },
    {
      "id": "ms2ohcy",
      "body": "Child porn",
      "created_utc": 1747136109.0,
      "score": 1
    },
    {
      "id": "ms3xp98",
      "body": "I don't understand this story. He sent you a video of a 16 year old girl playing with herself? Not being mean just genuinely not sure if I'm understanding.",
      "created_utc": 1747151165.0,
      "score": 1
    },
    {
      "id": "ms9u12k",
      "body": "Uk",
      "created_utc": 1747231811.0,
      "score": 1
    },
    {
      "id": "ms5waoh",
      "body": "You don't accidentally come across it on the dark Web. Only if you aren't using a trusted directory.",
      "created_utc": 1747171690.0,
      "score": 1
    },
    {
      "id": "mrzgk8b",
      "body": "It's easier than you'd think, unfortunately. I was browsing Bing image search for nudes, (to use as references for a drawing), and a surprising number of results were obviously trafficked girls under sixteen. I've seen small children once or twice, too. I reported them all and then became extremely upset-- the look in their eyes was haunting. I also got paranoid I would get in trouble for viewing them, despite reporting.\n\nHonestly? Time healed me the most, and advocating for victims in my own small ways when I'm able to. It still gets to me sometimes but it can be processed ig. Depends on your worldview. Empathy can be difficult sometimes. :(",
      "created_utc": 1747085637.0,
      "score": 24
    },
    {
      "id": "mrz79a0",
      "body": "easier than it looks, honestly. there's always a non zero chance the porn you see in websites anyone can post anything is illegal material without your knowledge.",
      "created_utc": 1747082779.0,
      "score": 46
    },
    {
      "id": "mrzpdhc",
      "body": "I accidentally found cp on snapchat when i was like 14, it’s a lot closer to you than you think",
      "created_utc": 1747088484.0,
      "score": 7
    },
    {
      "id": "mrz6s7e",
      "body": "He was looking for regular porn, clicked a new website, the website had cp, clicked back off it immediately, is now traumatized. \n\nPlease do not imply anything further about my boyfriend who is currently deeply struggling. Use your brain.",
      "created_utc": 1747082636.0,
      "score": 79
    },
    {
      "id": "mrzf2fk",
      "body": "Google image search scours the internet for anything it detects in the image that is relevant to your search. I’ve wound up on some strange webpages when looking up inspiration for clothing and costume design.",
      "created_utc": 1747085170.0,
      "score": 8
    },
    {
      "id": "mrzm6lx",
      "body": "The same way we are stumbling on your comment. You don't need to intentionally look for something for it to popup.",
      "created_utc": 1747087424.0,
      "score": 7
    },
    {
      "id": "mrzabtm",
      "body": "This is not mental health advice",
      "created_utc": 1747083708.0,
      "score": 16
    },
    {
      "id": "mrzehpo",
      "body": "This isn't remotely even helpful for the op, it's just full of judgement.",
      "created_utc": 1747084991.0,
      "score": 11
    },
    {
      "id": "ms2mzhw",
      "body": "I've explained this multiple times on this thread so I don't know what you're talking about? He was looking for regular porn, clicked a new website, the website was CP, he reported it to every group and authority he could think of and is now suffering emotionally. \n\nThe edit in my post is about the people who were using this as an avenue to peddle their anti porn views not people genuinely asking how he came upon it.",
      "created_utc": 1747135444.0,
      "score": 3
    },
    {
      "id": "ms2srvl",
      "body": "I appreciate you sharing your point of view on this but this discussion is about supporting my boyfriend after the fact. He's already seen the images and reported them to authorities as well as sting groups. We've moved past this now.\n\nDo you have any advice on dealing with the psychological aspect of seeing this imagery?",
      "created_utc": 1747137899.0,
      "score": 1
    },
    {
      "id": "ms9t18b",
      "body": "Did you read my post? We're trying to help him not have him arrested?",
      "created_utc": 1747231499.0,
      "score": 1
    },
    {
      "id": "msoaw43",
      "body": "He did...",
      "created_utc": 1747422486.0,
      "score": 1
    },
    {
      "id": "mu7viwh",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1748199810.0,
      "score": 0
    },
    {
      "id": "mrzr07j",
      "body": "Wow.. what a useless comment.",
      "created_utc": 1747089038.0,
      "score": 19
    },
    {
      "id": "mt0fna0",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747600195.0,
      "score": 1
    },
    {
      "id": "mrzjpam",
      "body": "\"if he wasn't so addicted\" lol nowhere does OP say he's an addict ? You're making a politicised assumption based on your anti porn stance ",
      "created_utc": 1747086625.0,
      "score": 28
    },
    {
      "id": "ms05wmp",
      "body": "While I’ve never stumbled upon full blown CP, I’ve seen content involving children that was incredibly suggestive before and I was just on regular social media sites and hadn’t sought out any sort of explicit content. You don’t always have to go digging to see fucked up shit, you can be an innocent bystander as well. Even if it’s not the case for him.",
      "created_utc": 1747094033.0,
      "score": 6
    },
    {
      "id": "mrze8kc",
      "body": "You're making a lot of assumptions from one post. A relationship is built on trust, and that trust can include both of you looking at, and sharing, prn with each other. \n\nThat being said, it's difficult to see how one stumbles upon a site like that by accident, but it CAN happen. I hope he's able to find help because this sort of thing really can be utterly traumatic. \n\nI also hope you learn how to not jump to conclusions and immediately gain assumptions from people you don't even know lmao.",
      "created_utc": 1747084912.0,
      "score": 16
    },
    {
      "id": "mrzdx7v",
      "body": "Porn has became a standard in society, most teens start watching porn like they would start watching a new cartoon at 12 or even younger sometimes.\n\nIt is way too over your face not to see or watch it,\n\nIt is now increasingly appearing in video games too.\n\nAlmost everyone gets addicted to it or think it's normal to fap every day to porn.\n\nCan't blame the person really, they need to have that wake up call and stop indulging that shit for the well being of their own brain.",
      "created_utc": 1747084816.0,
      "score": 6
    },
    {
      "id": "mu7vi0b",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1748199802.0,
      "score": 1
    },
    {
      "id": "mrzmikj",
      "body": "I need you to be serious. If he searched for child porn on purpose, watched it on purpose and was then worried he'd be caught why the fuck would he tell me about it at all? What an incredibly incentive and hurtful thing to say about someone who is struggling. \n\nI hope your heart softens and you mind develops cuz fucking hell.",
      "created_utc": 1747087534.0,
      "score": 22
    },
    {
      "id": "ms1xng3",
      "body": "Read the other comments please. It has happened to a lot of people on this thread in a variety of ways. It's upsetting that you lack the empathy to see how seeing something as horrific as that would have an effect on someone.",
      "created_utc": 1747120881.0,
      "score": 4
    },
    {
      "id": "mu7vjwu",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1748199818.0,
      "score": 1
    },
    {
      "id": "ms2hel3",
      "body": "Gorl I'm with you it's not adding up",
      "created_utc": 1747132803.0,
      "score": -4
    },
    {
      "id": "ms3aldp",
      "body": "LMAO WHAT",
      "created_utc": 1747144269.0,
      "score": 1
    },
    {
      "id": "ms34c0l",
      "body": "That is not true at all. People with PTSD for instance, may actively think about it, but that doesn't mean they like it. It is a trauma response that is very common. Before I repressed a lot of crap, all it did was play on repeat over and over",
      "created_utc": 1747142183.0,
      "score": 4
    },
    {
      "id": "mrzb9xd",
      "body": "No problem, those are methods that I use to cancel out anxiety triggers and it works about 60-70 percent of the time.",
      "created_utc": 1747083996.0,
      "score": 83
    },
    {
      "id": "ms0e8ej",
      "body": "ACT (acceptance and commitment therapy) could probably help. There's a technique the author calls \"dropping anchor\" that could help specifically : [https://survivorsofabuserecovering.ca/wp-content/uploads/2019/10/Dropping-anchor-handout-ACE-formula-Russ-Harris-2019.pdf](https://survivorsofabuserecovering.ca/wp-content/uploads/2019/10/Dropping-anchor-handout-ACE-formula-Russ-Harris-2019.pdf)\n\nEdit: u/meanregards I recommend these two books : \n\n\\- \"The happiness trap\" (here is the [free illustrated version](https://fliphtml5.com/kgzdz/twkh/basic)). It teaches how to handle difficult emotions and memories. A common mistake is to either avoid the memory - which makes it even more present because of the \"don't think about a banana\" effect, or ruminating/overthinking which doesn't work because emotions can't be \"solved\", they must be felt/acknowledged then pass freely.  \n\n\\- \"The moral injury workbook\". It's for PTSD from moral violations. It's possible that your boyfriend feels guilt and conflicted emotions about being unable to save the victims he saw suffering. This book teaches to reconnect with your values, and see that his life and identity is much more than these difficult memories he has now. One way to reconnect with his values could be to support an organism that protects kids, it's a way to make a difference by reframing this difficult experience, and that can help him move on.",
      "created_utc": 1747096898.0,
      "score": 45
    },
    {
      "id": "mrzremc",
      "body": "Sending love to you both. Commenter above gave good advice I just wanted to say I'm sincerely wishing him a swift healing journey from that.",
      "created_utc": 1747089174.0,
      "score": 20
    },
    {
      "id": "mrzrir5",
      "body": "[removed]",
      "created_utc": 1747089213.0,
      "score": -29
    },
    {
      "id": "ms1fou4",
      "body": "Damn forgot about Tetris! So useful.",
      "created_utc": 1747111155.0,
      "score": 7
    },
    {
      "id": "ms2yt5v",
      "body": "the tetris for trauma thing was actually debunked years ago",
      "created_utc": 1747140227.0,
      "score": 2
    },
    {
      "id": "mrzg2nn",
      "body": "no problem love, i’m glad i could offer some help.",
      "created_utc": 1747085485.0,
      "score": 29
    },
    {
      "id": "mt0lhzz",
      "body": "Does he have insurance? Call the number on the back of the card and ask for help finding an appointment with a therapist that takes the insurance. They can usually get it set up for you!",
      "created_utc": 1747602028.0,
      "score": 1
    },
    {
      "id": "msmstz5",
      "body": "I play solitaire while listening to a podcast. Usually helps me black out intrusive thoughts and distract from nighttime anxiety.",
      "created_utc": 1747406558.0,
      "score": 1
    },
    {
      "id": "mrzfwhj",
      "body": "I hope everything works out okay. It's not his fault this happened, he's been exposed to one of the darkest aspects of humanity, and it'll take him a while to recover. \n\nI wish you both the best, you'll get through this ❤️",
      "created_utc": 1747085431.0,
      "score": 11
    },
    {
      "id": "mrzgxk3",
      "body": "Playing Tetris is scientifically proven to help \"overwrite\" traumatic experience! Could be worth a G*ogle. ❤️",
      "created_utc": 1747085754.0,
      "score": 14
    },
    {
      "id": "ms1ra4m",
      "body": "Why are you here then in this Reddit sub? I hope you find the peace you need.",
      "created_utc": 1747117152.0,
      "score": 9
    },
    {
      "id": "ms1y9th",
      "body": "I wish you did, too. Some of us are just lucky to live in countries with public healthcare services. Good shrinks help you to process things instead of just agreeing with you",
      "created_utc": 1747121267.0,
      "score": 5
    },
    {
      "id": "msi6ql1",
      "body": "Can y'all just report this pathetic troll once and for all, please?",
      "created_utc": 1747338477.0,
      "score": 1
    },
    {
      "id": "msx648b",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747554007.0,
      "score": 1
    },
    {
      "id": "ms49fof",
      "body": "Who hurt you? Jesus Christ, there’s a time and a place and this ain’t it buddy.",
      "created_utc": 1747154605.0,
      "score": 1
    },
    {
      "id": "ms89w5j",
      "body": "I didn’t but I did need to go through police statements and investigations which were thorough. And you get every last detail. That was bad enough.",
      "created_utc": 1747205057.0,
      "score": 2
    },
    {
      "id": "ms1noyk",
      "body": "[removed]",
      "created_utc": 1747115173.0,
      "score": -40
    },
    {
      "id": "ms60xgv",
      "body": "I'm so curious but can only find a band... ?",
      "created_utc": 1747173140.0,
      "score": 1
    },
    {
      "id": "ms6bkdv",
      "body": "That’s great for where you are but where I’m from, you would have to.",
      "created_utc": 1747176672.0,
      "score": 1
    },
    {
      "id": "ms950ai",
      "body": "Omg",
      "created_utc": 1747222850.0,
      "score": 1
    },
    {
      "id": "msa4853",
      "body": "https://hubofhope.co.uk/services?org_id=a2fae154-2225-485e-b7a0-f2c5cb3f1ca1",
      "created_utc": 1747234844.0,
      "score": 1
    },
    {
      "id": "msa4ch2",
      "body": "Search for trauma support and narrow it down by location and age if he’s under 25",
      "created_utc": 1747234879.0,
      "score": 1
    },
    {
      "id": "mrzf1g6",
      "body": "That's why revenge porn sites exist despite most of those videos being posted without consent",
      "created_utc": 1747085162.0,
      "score": 13
    },
    {
      "id": "msgw4qn",
      "body": "Majority of porn sites have illgeal shit there’s a reason why barely legal is like the most popular genre  ",
      "created_utc": 1747324814.0,
      "score": 2
    },
    {
      "id": "mrzkc8q",
      "body": "It happened to me and I don’t even watch much porn at all. I was looking at some stuff that was advertised and then it linked me down a rabbit hole, and the cp wasn’t super obvious, and it was animated. Thankfully it wasn’t “real” and was just animated but still really made me sick. I also reported it as much as I could, and when I tried to post about it, everyone downvoted me and said it is technically legal if it’s animated and that there’s nothing I can do and to just get over it. I was pretty shocked. Both that it existed, and that nobody seemed to care.\n\nI think reminding your boyfriend that he is a sweet and kind person for having these emotions and that it proves how good of a human he is that it is something he didn’t think was ok or was able to just quickly get passed. It shows a lot of his character that he is so upset by something that is one of the most horrific things that happens in the universe. So as long as he needs, he should take it. And be easy on himself",
      "created_utc": 1747086827.0,
      "score": 9
    },
    {
      "id": "mrz7tb8",
      "body": "[removed]",
      "created_utc": 1747082947.0,
      "score": -69
    },
    {
      "id": "mrzblfe",
      "body": "I would argue that it absolutely is considering many people have porn addictions.",
      "created_utc": 1747084098.0,
      "score": -26
    },
    {
      "id": "msgv7c7",
      "body": "Ofc he’s a porn user makes sense why he found it so easily  ",
      "created_utc": 1747324545.0,
      "score": 1
    },
    {
      "id": "ms35gkk",
      "body": "Any advice I give regarding therapy techniques will likely be repeated in the comments below unfortunately I don't really think that any one size solution fits all regarding how to deal with the psychological fallout of a traumatic situation. Anything anyone offers that may work for them will not work for another. \n\nThat being said I suppose if I was to give advice on how to cope as someone who has gone through the same thing and been molested themselves. I think it might be helpful for him to understand how robust people are? Sexual abuse is horrifying and leaves huge psychological wounds onto people but those children that he saw will grow up ( we can hope for that at least) they will grow up they will become resilient to their pain they may add to the world's understanding of how these things happen and do immense good with their lives. I don't really know what his life exprince has been like wether he knows people who have been sexually abused or not if he's seen how people in the real world live their lives in spite of the horror of their childhoods. \n\nTo share a coffee with someone who's been through hell to see the way they can laugh and smile that is hope one of the benefits of being a survivor is being able to exprince being up close with this side of the human exeprince. \n\nBut if it helps for me when I feel I need something to cope I deliberately go out and find channels like cults to consciousness or life take two anything that puts me in touch with the stories of people who have survived immense hardship and listing to them laugh talk about their hobbies how they survived listining to the way they have become full fledged people in their day to day. \n\nThis may help dispel the idea that traumatized people are broken that truama is by its nature soenthing that thrusts people into a dark underbelly of the world from which they never escape from. Truama breacks people but it does not define the human condition. It's just as offensive to suggest that's someones truama is not good enough as it is to write truama survivors off as broken helpless and tainted. \n\nYou can't save all the children but you can support the ones that grew up the people who survive are the ones who would be best at knowing how to help. There are people who bust down rings every day and that's there calling but if he really really wants to get involved he's gonna have to accept that those children may not get saved by anyone not him and not the police this dosent mean he's helpless or those children are doomed. It just means that if he wants to feel like he's doing his part he will need to shift his focus slightly. \n\nFeeling proactive and likes he's making a difference might be the only thing that can help. Some things are too horrible to feel like they can be ignored he may not simply be able to move past what he saw. \n\nThat's the nature of truama itself. \n\nTalking to someone however that has seen the things he's seen and connecting to people who he can vent to may help along with seeing hopefully an expert. Along with something procative to do in his day day to feel like he might be making a difference in the world. \n\nHe isn't batman he dosent have to be either.  The good that holding space for a loved one can do who might have expeinced these things is as Important as any swat team kicking down doors. If everyone single person took little day to day steps in their lives to be educated open minded and caring to those around them in their communities. Then the world would be a safer place for children. \n\nIf he Isent part of the problem. If he's never molested anyone if he will and can hold space for the people he loves if they ever came forward with their own abuse puts him in the category of people who are the solution. Even of those actions seem minor in the boarder scheme of things. \n\nTell him all of this so he dosent feel useless or hopeless. \n\nAnd tell him that there will be children from that group he saw who will grow up go to uni fall in love and move past their truama some may even become advocates law enforcement people there are people today who survived as terrible if not even more terrible things giving speech's to the world at eu summits and calling for action . If there really lucky they might get saved but even if they don't. Children survive and always will. \n\nAnd he's done enough for all that he feels he can't do \nHe cares that alone is enough. The pain he's expeinciening is proof he cares and in a world that turns no matter the horrors that take place inside it to care is a gift even if it's uncomfortable. \n\nHe just needs to know find a way to keep his head from going under the water and not become tormented. \n\nWhat that looks like for him I don't know.",
      "created_utc": 1747142565.0,
      "score": 3
    },
    {
      "id": "mspx5ot",
      "body": "A few months in jail or in the legal system will fix this issue permanently",
      "created_utc": 1747442643.0,
      "score": 0
    },
    {
      "id": "mrzrnop",
      "body": "Also their profile has a quote, that I shan't repeat, that makes you wonder why they're on a mental health sub lmao",
      "created_utc": 1747089260.0,
      "score": 8
    },
    {
      "id": "mrzrh26",
      "body": "Honestly, people don't understand the meaning of words anymore I swear. You can watch porn and not be a porn addict, same as how you can drink alcohol and not be an alcoholic. \n\nYou can really see they have a chip on their shoulder about it, and are using it as a way to judge and belittle someone, it's shameful.",
      "created_utc": 1747089196.0,
      "score": 13
    },
    {
      "id": "msgwmxm",
      "body": "[removed]",
      "created_utc": 1747324965.0,
      "score": 1
    },
    {
      "id": "mrzq9vl",
      "body": "I don’t think that’s what he meant. I accidentally saw cp when i was 14 and while i never reacted as much as your bf did, i do still feel a bit guilty about it whenever i think back to it",
      "created_utc": 1747088790.0,
      "score": 8
    },
    {
      "id": "mrzqnyu",
      "body": "Okay calm down, your response is overreacting, the comment is a valid point and I assume it was not made in a negative or hostile manner. I don't think the comment was trying to say your boyfriend is a pedophile and watched it on purpose. The way I understood the comment is that your boyfriends feels guilty for seeing the content and potentially being worried about being in trouble for seeing it. It's nothing to do with the fact if he did it on purpose or not, people stumble upon CP or other dark shit on the internet nearly everyday and many of them do worry if it will get them a knock on the door because it's obviously super illegal.\n\nThere is also a subset of OCD called POCD, it's where you get intrusive thoughts thinking you are a pedophile even if you are not one, there is a chance your boyfriend saw CP and might now be having these thoughts that he's turning into one for example, I understand your response but I don't the comment was trying to be rude.",
      "created_utc": 1747088922.0,
      "score": 5
    },
    {
      "id": "mrzqv9t",
      "body": "Some people may see something they're not meant to see after innocently stumbling upon it, like your boyfriend has. He hasn't gone looking for it, but sadly, he found it and he could potentially be worried that some authority figure like the police may start asking him more questions which may lead him to feel accused, or guilty or being involved even though he was a passer by.",
      "created_utc": 1747088991.0,
      "score": 2
    },
    {
      "id": "msgwa35",
      "body": "Guilty conscious is a thing he obvi don’t have strong morals ",
      "created_utc": 1747324859.0,
      "score": 1
    },
    {
      "id": "ms2hpej",
      "body": "Amazing",
      "created_utc": 1747132959.0,
      "score": 0
    },
    {
      "id": "ms0i413",
      "body": "What a dramatic response to a simple question. 🙄",
      "created_utc": 1747098281.0,
      "score": -10
    },
    {
      "id": "msgve2p",
      "body": "Ofc it did this is Reddit most people shouldn’t be around schools here ",
      "created_utc": 1747324599.0,
      "score": 1
    },
    {
      "id": "ms1y4qp",
      "body": "He should just watch pornhub rather than looking at weird websites and clicking random links. Your bf is weird",
      "created_utc": 1747121179.0,
      "score": -11
    },
    {
      "id": "ms33u0b",
      "body": "Literally, what you're saying doesn't make sense. If you are clicking random links, then you have no clue what you may accidentally stubble upon. Accusing someone who is asking and needing help is only going to make others who have had a similar problem not come forward in fear of being accused by others with a similar mindset as yours. You don't know what happened. The best thing to do is actually help because it sounds like he desperately needs it.",
      "created_utc": 1747142011.0,
      "score": 5
    },
    {
      "id": "ms4gsd4",
      "body": "[deleted]",
      "created_utc": 1747156719.0,
      "score": -4
    },
    {
      "id": "mrzs6g9",
      "body": "Read the other comments please. People in this thread have come across cp through twitter, ads, drawing references. I appreciate your concern but you are not fully informed on the magnitude of cp on the internet.",
      "created_utc": 1747089439.0,
      "score": 58
    },
    {
      "id": "ms02pfm",
      "body": "Dark web has nothing on it nowadays. It used to have a lot of these in the past but they've all been shut down",
      "created_utc": 1747092990.0,
      "score": 9
    },
    {
      "id": "ms8asu3",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747205592.0,
      "score": 1
    },
    {
      "id": "ms1ml5l",
      "body": "I find if I play Tetris during an actual episode it is especially helpful in overwriting it while the images are fresh in my mind. My best friend was brutally murdered in February and I’m struggling to get the images from my head. The Tetris this really is helping. I will say this… a weird side effect I wasn’t prepared for? I started to feel guilt bc it was working. I felt like a dick that the images weren’t invading my brain as much and like a jerk that I was getting “better.” I don’t know if your bf will relate to that with his situation, feeling guilty for moving past it, but it was very unexpected for me and I didn’t know how to handle it at first.",
      "created_utc": 1747114587.0,
      "score": 16
    },
    {
      "id": "ms4j4nv",
      "body": "Have you got any sources on that? All I can find is articles saying it works",
      "created_utc": 1747157394.0,
      "score": 4
    },
    {
      "id": "msu7q2g",
      "body": "By whom?",
      "created_utc": 1747509431.0,
      "score": 1
    },
    {
      "id": "mt0meil",
      "body": "We aren't in America so he doesn't have insurance. Our medical system makes finding a therapist incredibly difficult especially if you live in a low income area",
      "created_utc": 1747602318.0,
      "score": 1
    },
    {
      "id": "ms0grpy",
      "body": "Is the word Google sensored? Lol",
      "created_utc": 1747097794.0,
      "score": 5
    },
    {
      "id": "msi6jk3",
      "body": "Dude, you are on a mental health subreddit, not on the R/imveryedgy",
      "created_utc": 1747338419.0,
      "score": 1
    },
    {
      "id": "msx64lb",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747554013.0,
      "score": 1
    },
    {
      "id": "ms31ofy",
      "body": "[removed]",
      "created_utc": 1747141252.0,
      "score": -16
    },
    {
      "id": "ms618vz",
      "body": "I googled \"the secret\" and it showed me a book about the law of attraction",
      "created_utc": 1747173240.0,
      "score": 3
    },
    {
      "id": "mrziscf",
      "body": "people will scroll through facebook reels and come across a clip from a live where someone k!lls themself on camera. fucked up people put fucked up things on the internet in places people can happen upon them all the time. doesn’t make it wanted.",
      "created_utc": 1747086334.0,
      "score": 27
    },
    {
      "id": "mrzi7h8",
      "body": "The only thing strange is the people who think it’s okay to make CP. That’s just downright weird that you didn’t say anything about that part.",
      "created_utc": 1747086154.0,
      "score": 10
    },
    {
      "id": "mrz8kaa",
      "body": "Yes obviously it doesn't happen to everyone and yes it is rare. Doesn't make it not an accident. What you're doing here feels pretty close to victim blaming. \n\nThis isn't like a pretend situation for you to cast theories on. He is actively struggling with huge bouts of anxiety and depression because of this event. I will stop responding to you if you have nothing of value to add.",
      "created_utc": 1747083172.0,
      "score": 42
    },
    {
      "id": "mrzcd5x",
      "body": "This isn't about porn addiction. This is about witnessing something traumatic. If you don't have any advice to add with regards to that I will block you. This isn't an avenue for you to talk about porn addiction and \"stop watching porn\" wouldn't even be helpful if it was.",
      "created_utc": 1747084336.0,
      "score": 18
    },
    {
      "id": "msrqdoh",
      "body": "So if we were pretending he was actually a nonse in you make believe world... A few months in jail and he's fixed? Back on the street? Do you actually have thoughts or do you just say things?",
      "created_utc": 1747475661.0,
      "score": 1
    },
    {
      "id": "mu7vkyn",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1748199828.0,
      "score": 1
    },
    {
      "id": "mrzrcay",
      "body": "I can see how my reaction was extreme. I don't believe the commenter meant well because of his statement. \"He just feels guilty\". As you have pointed out this is a serious situation with potential to affect him long term there's really no room in my opinion for \"he's just this\".  I don't think the comment was made with any intention of being helpful.",
      "created_utc": 1747089152.0,
      "score": 3
    },
    {
      "id": "mrzrnkk",
      "body": "As stated he has reported this already and isn't worried about police intervention since he was on the website for just seconds. His turmoil is coming from the horror of what he saw not concern for his own reputation or safety.",
      "created_utc": 1747089259.0,
      "score": 2
    },
    {
      "id": "ms3ofde",
      "body": "Was a stupid question honestly",
      "created_utc": 1747148476.0,
      "score": 1
    },
    {
      "id": "msgvmqn",
      "body": "Porn hub obviously don’t have his genre of content he likes ",
      "created_utc": 1747324669.0,
      "score": 1
    },
    {
      "id": "ms3ajte",
      "body": "thats what im wondering lowkey",
      "created_utc": 1747144255.0,
      "score": -1
    },
    {
      "id": "msgvv8l",
      "body": "Clinking on random porn links what could possibly go wrong with that u either gonna find no consent videos or cp or if ur lucky just a virus ",
      "created_utc": 1747324738.0,
      "score": 1
    },
    {
      "id": "ms4ijyu",
      "body": "It was an example of how something can stick with you not me saying he has ptsd at all. Yes the kids in the video are victims, but that doesn't mean he isn't. Not everyone deals with trauma the same way. Not everyone dissociates immediately or over the same things. Everyone has they're own limits. That's why people have different coping mechanisms and can develop different things because it's handled differently. It doesn't matter if it is a screen. Something fuck with people and some people can easily get over it because \"it was just a screen\". Everyone needs support no matter what you think they should be able to handle",
      "created_utc": 1747157232.0,
      "score": 2
    },
    {
      "id": "mrzsyti",
      "body": "[removed]",
      "created_utc": 1747089709.0,
      "score": -67
    },
    {
      "id": "ms2v88g",
      "body": "The familiarity of the awfulness can be scary to leave but you deserve to feel better.  A good friend would want that.  My cuz was also brutally murdered, about 4 years back now, and it took awhile.  Pace yourself",
      "created_utc": 1747138874.0,
      "score": 3
    },
    {
      "id": "mt0mnx1",
      "body": "Ah, im so sorry. Where are you guys located? Maybe we could try to find a place together?",
      "created_utc": 1747602400.0,
      "score": 1
    },
    {
      "id": "mu388qc",
      "body": "If you're by chance in Ontario, Canada I know kind of a general trick to get OHIP to cover some mental health stuff but I don't know if it would really work in this scenario since your bf has acute distress.",
      "created_utc": 1748129980.0,
      "score": 1
    },
    {
      "id": "ms0ijia",
      "body": "It's censored because I kept getting a warning when I included the word and I didn't want to chance it lol.",
      "created_utc": 1747098435.0,
      "score": 5
    },
    {
      "id": "msx6uat",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1747554460.0,
      "score": 1
    },
    {
      "id": "mrz8oc1",
      "body": "[removed]",
      "created_utc": 1747083206.0,
      "score": 31
    },
    {
      "id": "mrzffqz",
      "body": "Maybe he shouldn't watch \"regular\" porn in the first place",
      "created_utc": 1747085284.0,
      "score": -62
    },
    {
      "id": "mrzrh9b",
      "body": "Fair enough.",
      "created_utc": 1747089198.0,
      "score": 3
    },
    {
      "id": "ms4tlc5",
      "body": "[deleted]",
      "created_utc": 1747160374.0,
      "score": 0
    },
    {
      "id": "ms03bf7",
      "body": "As prior law enforcement myself that had to deal with these cases, there is a drastic amount of it on the surface web, it’s not only the dark web.",
      "created_utc": 1747093193.0,
      "score": 72
    },
    {
      "id": "ms0fr15",
      "body": "I don’t know that anyone is really “fully informed” on the magnitude of CSAM online, and I’d especially hope not at 16 years old. \n\nCSAM unfortunately is shared and circulated frequently on clear net sites, including mainstream social media. It’s difficult to know for sure what areas of the internet facilitate its distribution most frequently, but it’s widely accepted that the dark web isn’t the exclusive criminal network it was once perceived as. Illegal content, including child sexual abuse material, is not uncommon on chatting applications, social media sites, clear net forums (like Reddit!), YouTube, etc….\n\nThere are many limitations to research in this area, but one study found that [the dark web made up less than 10% of the most commonly used platforms to access CSAM](https://www.pure.ed.ac.uk/ws/portalfiles/portal/249852639/SteelEtal2022JDFSLTechnicalBehaviours.pdf) while P2P sharing sites & the open web accounted for over 75% combined. \n\nAs another very rough estimate, consider that the CyberTipline received 36.2 million reports related to online child exploitation & [Facebook alone accounted for 17.8 million of these.](https://www.missingkids.org/content/dam/missingkids/pdfs/2023-reports-by-esp.pdf)\n\n\n\n\nOP, if you’re reading this, NCMEC has a short brochure on [coping with CSAM exposure](https://www.nctsn.org/resources/coping-with-child-sexual-abuse-material-exposure), though it feels more geared towards caregivers. Other research echos what’s already been communicated in other replies, like “[the most promising approaches appear to be social support and seeking distraction.](https://pmc.ncbi.nlm.nih.gov/articles/PMC11922302/).” That study focuses specifically on the wellbeing of those who are regularly and consistently exposed to this content, including the worst-of-the-worst, but I think there are still some tidbits throughout that may be helpful. Best wishes.",
      "created_utc": 1747097431.0,
      "score": 30
    },
    {
      "id": "ms1fw2c",
      "body": "I used to volunteer with a reporting group (that included law enforcement specific to this kind of material) that spent hours a day on Facebook finding this stuff on public pages. We had some that would track down local authorities, some reported to the FBI, endlessly. Report and move on, report and move on. People burned out and we'd cycle through new volunteers constantly. Nobody wanted to see this, but the constant influx of people who stumbled on something and asked us to help was horrifying.\n\nThe amount of it on Facebook and Twitter, publicly, easy to accidently come across was so high it was infuriating. A good number of times the keywords were innocent and were something you'd expect a child to search. Which seemed to be the idea. \n\nIt is absolutely without question easy for someone to have it happen to them.",
      "created_utc": 1747111248.0,
      "score": 16
    },
    {
      "id": "mrzute2",
      "body": "I did not intend on coming across angry and I do appreciate your concern. You are incorrect in this case though. He wasn't on the dark web and neither were a lot of people in this thread. CP is on the internet not just the dark web and anyone can happen upon it.",
      "created_utc": 1747090341.0,
      "score": 34
    },
    {
      "id": "ms1a1vw",
      "body": "Oh sweet summer child.",
      "created_utc": 1747108663.0,
      "score": 12
    },
    {
      "id": "ms3pvfq",
      "body": "It is better if you keep your fingers still and stop typing nonsense, I’ve seen CP and reported it on Facebook, yes, on Facebook",
      "created_utc": 1747148904.0,
      "score": 2
    },
    {
      "id": "ms4b4qj",
      "body": "Daisy's destruction was actually filled on Reddit, it was a pretty alarming situation.",
      "created_utc": 1747155091.0,
      "score": 1
    },
    {
      "id": "ms3epb2",
      "body": "Thank you for that.",
      "created_utc": 1747145556.0,
      "score": 3
    },
    {
      "id": "mt0n2u6",
      "body": "It's alright. As mentioned in the update he's doing a lot better now anyway. We've looked through therapy options many times before it really just isn't very feasible where we are.",
      "created_utc": 1747602531.0,
      "score": 2
    },
    {
      "id": "ms0pti8",
      "body": "Yeah I noticed that too when I was typing my comment! I got scared like I was gonna get banned just for using the word Google 😂",
      "created_utc": 1747100989.0,
      "score": 3
    },
    {
      "id": "mrzfe8i",
      "body": "As is the boyfriend, two completely separate individuals can be victims of the same crime in very different ways and what you see can traumatize you as the human brain is great at freaking out when it dislikes something it sees.\nObviously the children are in a far worse situation than the boyfriend but that doesn't mean one should be callous about it.",
      "created_utc": 1747085271.0,
      "score": 50
    },
    {
      "id": "ms0b2ai",
      "body": "Are you dumb or what? Obviously the kids are victims, but that doesn’t take away the trauma of witnessing something so awful. Dick.",
      "created_utc": 1747095791.0,
      "score": 9
    },
    {
      "id": "ms4wpa5",
      "body": "There's a difference between not remembering shorts and remembering cp tf. The reason we don't remember reels and shorts well is because they don't stick out as much, if they did then you would remember them because they made an impression on you and I don't think much else can stick out as much as cp. It's not about forgetting. That's why you didn't get what I had said. Forgetting doesn't just happen with something traumatic. It's repressed, which is incredibly unhealthy both mentally and physically. Yes, trying to forget something usually does the opposite, and that's why I never said he should try to forget at all. He should process it by receiving support from others and most likely a therapist of some kind.",
      "created_utc": 1747161260.0,
      "score": 1
    },
    {
      "id": "ms5v3ao",
      "body": "Can you read? Calm down + read again.",
      "created_utc": 1747171300.0,
      "score": -4
    },
    {
      "id": "ms46hxq",
      "body": "If you need an ear to bend, I've \"been through it\", wrestling with her murder and the utter mockery of justice that followed for years.",
      "created_utc": 1747153742.0,
      "score": 3
    }
  ]
}