{
  "id": "1elhc84",
  "title": "Anyone in their 30’s + who still struggles significantly?",
  "selftext": "I’m 30 and I feel so stupid for still having the brain of a scared and lost child. It doesn’t matter how logical I try to be, it gets me by for the most part but after work, all I can do is stay home, have no relationship, hardly talk to my family or friends, and break down at things that adults should know how to handle.\n\nI can only write all my troubles in my diary, and I try to talk to myself through my diary.",
  "created_utc": 1722949674.0,
  "score": 468,
  "num_comments": 194,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1elhc84/anyone_in_their_30s_who_still_struggles/",
  "comments": [
    {
      "id": "lgrlyf0",
      "body": "There are plenty of issues that will effect people throughout their whole lives. You are not stupid or bad for still struggling, especially within a system that routinely mistreats people who have mental health issues.",
      "created_utc": 1722950029.0,
      "score": 135
    },
    {
      "id": "lgroqed",
      "body": "I will be 30 in a month and I'm still completely lost in life. Can't afford therapy because I'm struggling financially due to my mental illness, and I don't know how to improve my financial situation without therapy because I'm unable to focus on anything, hardly have motivation to even get out of bed and I have crippling social anxiety and lack of social skills and I'm unable to advance in my career because of that, so basically I feel completely stuck. Not to mention relationships, for a long time I was kind of content that I will be forever alone, but lately loneliness is really starting to hit me hard and I'm realizing that I'm loosing my youth and that there will be less and less chances to change anything.",
      "created_utc": 1722951037.0,
      "score": 69
    },
    {
      "id": "lgrsllu",
      "body": "I'm 35, and for whatever reason I thought by this age I'd feel more \"adult\" like how I once remembered my parents or other older people at this age to be. But honestly, I still feel like I didn't grow into what the world expects me to be, I'm... Still that young self that saw the world as a dream, where everyone was living out what they desired to do... I Remember seeing people working at coffee shops, or clothing stores, and thinking how those people are there because that's what they want to be doing... Not one part of me ever considered that perhaps they hate their job, and they're just trying to pay the bills, and they have anxiety, and struggle with depression... Like none of that went into the observation of seeing other people working their jobs... That's the lens of a child...\n\nYou know, if there is a heaven... I often wonder if the people who grew into \"adults\" would actually enjoy being in a place such as heaven? Because the cycle of conformity on earth is equally tied to survival... An addiction even .. and would heaven be too easy? I guess what I'm really asking is \"are those who grew into \"adults\" happy with it? Do they need their adult identity like a drug? Is it the perfect substitution to hide from all their problems they don't want to face?\n\nEveryone is different. But In a world that's influenced in the way it is, maybe that's why I still feel like a matured child?",
      "created_utc": 1722952396.0,
      "score": 35
    },
    {
      "id": "lgrn76x",
      "body": "I lost my dad when I was 15, mum last year. This is my first year dealing with shit alone (with no guidance) and even at 39 I still feel like a scared child. I just wish someone would put their arm round me and tell me its ok. I still feel like that 15yo because a shot like losing the old man killed both me, my mum, and my bro. We've never been the same since and now with mum gone and a whole host of responsibilities falling on both our shoulders I honestly don't know what keeps getting me out of bed each day. I'm celebrated for my work almost daily, so I think everyone sees me as a sound minded individual when the reality is I'm at an absolute breaking point.\n\nSomething tells though that one day me I'll be 50 and still struggling",
      "created_utc": 1722950485.0,
      "score": 18
    },
    {
      "id": "lgrw6ei",
      "body": "I read a book recently called New Happy. It's a really good explanation of how society today is set up to convince us that what we should do and should have and should be is really what keeps us miserable. Love and acceptance of yourself exactly as you are, self-compassion and kindness are absolutely pivotal for me in particular. I spent most of my life shaming myself for not being what I felt like I should be, where I felt like I should be in my life. Constantly struggling two steps forward five steps back. That kind of pattern. I do highly recommend seeking therapy if you're able. In Canada there are some free resources, I'm not sure where you are but going through whatever you can get without having to pay for it if that's part of it may involve a 6-month waiting list or longer but it's totally worth it if it's free. The other things I can say is if you can't do anything to feel like you can improve how you're feeling just focus on the bare minimum requirements of life. Self-care, hygiene, exercise, healthy diet and drinking lots of water. Oh and a healthy circadian rhythm. Start there. And maybe consider reading that book? You got this! ❤️",
      "created_utc": 1722953615.0,
      "score": 16
    },
    {
      "id": "lgrq8ar",
      "body": "I'm 42. I have ups and downs. I live with my family and I haven't answered my phone in 2 years.",
      "created_utc": 1722951572.0,
      "score": 14
    },
    {
      "id": "lgroyvj",
      "body": "41. Struggle is real.",
      "created_utc": 1722951120.0,
      "score": 11
    },
    {
      "id": "lgs4j0a",
      "body": "I don't know how to say this without it seeming to come off sounding insensitive (which it's absolutely not meant that way).. but the only thing that fixes \"not knowing how to do things\".. is to get out there and start trying to do things. \n\nThe cumulative life-experience people have once they get into their 30's, 40's, 50's etc.. is what gives people some marginal sense of \"Maybe I can do this !\" \n\nIt's also where the mantra of \"fake it till you make it\" originates from. At first you may stumble and fail and look like a fool doing things. Nobody goes from 0 to Olympic Champion in 1 step. \n\nSomehow you have to figure out what approaches work for you. Maybe the typical \"bar hopping on Friday nights with large crowds of people\" is not your thing. That's fine. There are other options. \n\nFind a particular goal that you want to do. The brainstorm or path-out different ways to get there. If you have to, start by making small steps. Even if that means it's a 6month to 5 year goal.\n\nDon't feel like you have to make all sorts of mega-changes all at once. Life is not a clean diagonal line upwards. Everyone has ups and downs, good days and bad days. Some days I feel like a million bucks. other days I feel like a failure and standing there eating ice cream out of a pint w/ the freezer door open. That's OK.",
      "created_utc": 1722956345.0,
      "score": 11
    },
    {
      "id": "lgrvlsb",
      "body": "[deleted]",
      "created_utc": 1722953422.0,
      "score": 4
    },
    {
      "id": "lgrpbi2",
      "body": "Yup, 30 and still struggling with the most basic stuff.",
      "created_utc": 1722951248.0,
      "score": 4
    },
    {
      "id": "lgs113u",
      "body": "Oh absolutely. You’re definitely not alone. Recently my dog passing kind of drove it all home for me. I got him at 20 years old when I was in university. I had crippling anxiety and grew up an only child in a loveless home. He was everything to me. My light in what felt like a life of darkness. However, back then I still had alot going on. I was ambitious and was in the process of finishing my undergrad, was young and had a thriving social life etc. still felt like there was so much hope & so many possibilities ahead of me (especially when you’re that age). My dog passed away recently (I’m in my early 30s)… and it almost felt like I was in a worse off position than when I got him at 20. Called off my wedding last year when I caught my ex cheating, I work a 9-5 I hate, and it feels like a lot of my friends my age are now married with kids. For some reason that comparison of, “oh man I was in a better place in life when I got him at 20 than I am now in my 30s” really felt like a punch in the gut. I thought “maybe if I was in a better place in my life or had a supportive partner or kids to keep me occupied like I hoped to have by this age, I wouldn’t be taking this loss so hard”. So yes, I still struggle significantly.",
      "created_utc": 1722955220.0,
      "score": 4
    },
    {
      "id": "lgt17mi",
      "body": "41 here. Deal with anxiety every day. Not as crippling as it used to be, thanks in large part to therapy I started at 35 and meds at 38.\n\nYou’re not alone. 🙏",
      "created_utc": 1722966500.0,
      "score": 5
    },
    {
      "id": "lgvlugw",
      "body": "(32M). The last 5 years I’ve tried psychologist’s, psychiatrist’s, therapy, exercise, healthy food, several anti depressants, my current doctor put me on Ritalin. Which I’m not stoked on but it’s helped me focus. Things i used to do easily, are now hard to make sense of. You could say I’ve really been dropping the ball. I’m starting to be really mad with myself. As I’m very aware of my decline. \n\nI’m big on spirituality. Meditation, mood tracking, earthing, philosophy, theology etc. In the last 2 years i have completely lost that feeling of connection with my surroundings. Totally detached and jaded. It’s quite severely affecting my life in every way. Never used to be angry, claimed to be pacifist. Might have been an exaggeration. But i tried. Now i have a hair trigger. \n\nI’ve tried just about everything trying to find it again. I’m pretty convinced the issue is rooted in the feeling of not wanting to participate in society anymore. I just can’t connect with people anymore. The way things are politically, economically, the trendy mentality, vanity and appearance being more important than intellect and skill. The list goes on. Just feels like world has become extremely radicalized. I really don’t agree with any of it. You can’t talk about it because if your views contradict another’s. The dissonance is too much for them to handle. \n\nI think the lockdown broke a lot of people, in a lot of different ways. Economically, our age group is the least well of financially in a long time. From college debt, to extremely low wages even with a degree. Having to rent because housing has become an unobtainable goal in most of the country. Prices in general these last 6 years. Really kills hope for the future when your 30+ and still live paycheck to paycheck. \n\nWhether you’re M or F. Dating has become unpleasant to say the least. Very few people cherish loyalty, honesty, and family values the way they were pre 2000s. And the whole war of the sexes going on, (man vs bear) (women vs tree). And still sex is just a casual thing. \n\nThe tension worldwide. All the wars. There’s just so much noise in the world right now. I grew up Catholic. At 17 i became agnostic-athiest. For 15 years i studied and learned. It’s hard to think this isn’t a holy war/spiritual war going on. There’s been a drastic shift in energy. Define that how you will. But there’s been a philosophical shift i haven’t pinned down. \n\nThese are just some of the things I’ve thought as part of the reason. Can’t say I’ve found anything that has really helped yet. Just hoping if i keep trying I’ll feel part of something again. No longer following politics, got rid of all socials except Reddit. Not sure if you relate to any of this. But you’re not alone.",
      "created_utc": 1722997732.0,
      "score": 4
    },
    {
      "id": "lgrmn0y",
      "body": "no worries, you are not alone in this .. I am 32 and still struggling, so no worries !",
      "created_utc": 1722950280.0,
      "score": 3
    },
    {
      "id": "lgs1zdp",
      "body": "35. It feels like I go one step forward and two steps backward.",
      "created_utc": 1722955527.0,
      "score": 3
    },
    {
      "id": "lgrwbhd",
      "body": "In my 30s and still struggling. Totally normal.",
      "created_utc": 1722953663.0,
      "score": 2
    },
    {
      "id": "lgs0q7n",
      "body": "I’m in my mid-40s I still feel the same way.",
      "created_utc": 1722955120.0,
      "score": 2
    },
    {
      "id": "lgsa96b",
      "body": "Yes",
      "created_utc": 1722958167.0,
      "score": 2
    },
    {
      "id": "lgsx6f6",
      "body": "31 and struggle..everyone says it gets better but I'm not seeing it",
      "created_utc": 1722965271.0,
      "score": 2
    },
    {
      "id": "lgsxd5x",
      "body": "yep. 31 and feels tough",
      "created_utc": 1722965328.0,
      "score": 2
    },
    {
      "id": "lgt0nr0",
      "body": "I’m 32 and barely keeping my head above water. Have made a lot of changes over the last year to try to improve but for every step forward there’s often 2 steps back. Have pretty much come to the realization that life is a daily battle, against societies constraints and our own mental health issues. I often think of the Eren Yeager quote “You must fight! If you win you live, if you lose you die.” I hope one day I can fight hard and long enough to be able to somewhat relax, but I don’t see that coming any time soon. Seems like life is about learning to live in the struggle, unless you are born with money or win some kind of lottery. I always try to give myself perspective though, at least I’m not being forced to fight in a war. That would be actual hell.",
      "created_utc": 1722966331.0,
      "score": 2
    },
    {
      "id": "lgt1ee5",
      "body": "I’m 36 and I’m now tackling the issues that fuel my depression and anxiety.",
      "created_utc": 1722966558.0,
      "score": 2
    },
    {
      "id": "lgt9llq",
      "body": "I’m almost in my 30s, and I actually feel like this everyday. I still feel like I’m a child, and have the mental of one. But, I get therapy and see a psychiatrist every 3 months.",
      "created_utc": 1722969071.0,
      "score": 2
    },
    {
      "id": "lgtah00",
      "body": "29. I used to be so constantly dissociated that nothing could phase me. Recently got medicated and have been going to therapy and while things are generally better (I’ve smiled this year which is new) I do find myself becoming over-sensitive, easily overwhelmed, and easy to bring to panic or tears. Turns out fixing the problem opened me up to a lot of negative emotions that I had not learned to handle. Some days I claim Im worse off medicated, but my friends (I have those now!) seem to enjoy the depth and breadth of my newfound emotions.\nI’d also say, working in a toxic job that was both physically and mentally draining definitely kept me in that pit of despair and cycle of work/rest/work/rest without ever going out and enjoying my friends company or pursuing hobbies. If that feels like your situation, look for a way out. I know finding a new job is scary, but there is nothing compared to the lifestyle difference that occurs when you don’t absolutely dread your job",
      "created_utc": 1722969345.0,
      "score": 2
    },
    {
      "id": "lgtnwct",
      "body": "I'm 35 and \"the brain of a scared and lost child\" is a really good way to describe the way I feel all the time, tbh. I feel you.",
      "created_utc": 1722973508.0,
      "score": 2
    },
    {
      "id": "lgtod4h",
      "body": "I'm 34 and am exactly how you described.  I do have a relationship but it is hard when I don't even feel like talking to him and we are sitting next to each other. He talks a lot and wants me to do the same but I just feel like I can't.",
      "created_utc": 1722973653.0,
      "score": 2
    },
    {
      "id": "lgu0ddr",
      "body": "Oh god yeah, hellooo me 🙋🏼‍♀️",
      "created_utc": 1722977341.0,
      "score": 2
    },
    {
      "id": "lgu2igo",
      "body": "I’m 42, at the age of 40 I finally understood my mental health/brain health issues. They are extensive, they however are NOT my fault. You are blaming yourself for a situation you aren’t responsible for causing. However, you do have the responsibility to YOURSELF to work towards a better life for YOURSELF! And it can happen at any pace you want. \nYou don’t mention specific issues so I’m not going to assume, as I find that’s more harmful than helpful, but if you are unable to get professional help, self diagnosis can get you started with diet, exercise, sleep, etc that all contribute to your mental well being. If you are just overwhelmed with all of it and what may be going on, pick one thing you can focus on helping. Maybe it’s get out 1x per day and walk for 10 min. Maybe it’s drinking a protein shake every day (protein is VERY helpful towards all well being, not just but it’s a solid place to start with diet). Dont try and change all at once or address it all at once. Just try 1 thing, give it at least a couple weeks, then add another. \nThis is a me thing but because I have OCD & ADHD journaling was causing me more issues of reliving that trauma over and over vs moving me to past it. So you can evaluate if journaling is keeping you stuck vs helping work it out.",
      "created_utc": 1722977998.0,
      "score": 2
    },
    {
      "id": "lgu39zv",
      "body": "I'm 35 and could have written this. No idea how to cope either. But you're definitely not alone 🫶",
      "created_utc": 1722978239.0,
      "score": 2
    },
    {
      "id": "lgunkyq",
      "body": "It is my 34th birthday and I barely have the motivation to get out of bed. No job or school right now, struggling on and off with addiction. Had a stroke two months ago that lightly paralyzed my face so now it droops so I am suffering from extreme insecurity over it. \n\n\nI'm at a loss I don't know what to do. I lit the interior of my new used car on fire, the only positive thing I've gotten this year from my brief stint at working before I had to quit because I was basically caught stealing Plan B. \n\n\nI'm struggling. Hard.",
      "created_utc": 1722985031.0,
      "score": 2
    },
    {
      "id": "lgurkdj",
      "body": "I'm 34. Still unemployed, living at home, no relationships, no experiences. I live with autism, adhd, cptsd, anxiety/panic, and bipolar. I'm now starting to develop auto-immune issues. Recently diagnosed with hEDS and looking at other compression syndromes. I have a lot of stomach issues.  \nJust managing the absolute minimum of life admin (tidying room, hygiene, feeding myself and grocery shopping, exercise and going outside/being in nature on a daily basis takes up all my time. Any stressors or demands immediately starts affecting my ability to manage my day, my sleep, and my tolerance to stress/overwhelm. I feel I am in a constant state of freeze, always on the precipice of overwhelm/overstimulation.  \nAlso, male presenting has caused a lot of rejection, \"serves you right,\" \"harden up,\" sort of attitudes leave people with little sympathy, empathy, compassion, or any real concern at all.\n\nI've been in therapy and on psych meds since I was 18. First 15 years were utter garbage that, for some of it, has caused more trauma, especially medical and systems trauma.\n\nI have finally found a therapist that I have connected with. In 2 years, I have made more progress than I had in 15 years. I am off most meds, I am leaving the house more, I am working through trauma and just starting to own my story again.\n\nI feel like a failure, and the people around me make that clear to me almost every time we encounter each other. I am always been measured by the standards/goals that I have not met. (e.g. don't live alone, no job, no partner, no marriage, no mortgage, no kids). It's like they have nothing to measure against other than the materialist bullshit we're taught will lead to a meaningful life.\n\nI call bullshit on our entire system. It is explicitly designed to abuse and exploit. The people who have accrued wealth can only be on top by standing on the necks of those they took their wealth from. There is no such thing as healing in this paradigm. Just get back to work!\n\nI don't want to heal anymore. I want to grow. I want bare my scars and make everyone uncomfortable. I want to lift veil on societal delusions, shed light on the pain and suffering that is literally happening on everyone's front door step. We step over unhoused people and shame them without even considering their humanity.  \nWe are so divorced from our own humanity. We are so far from what makes us human.  \nThis society is so toxic. We are social beings that have survived for hundred's of thousands of years, up until now, are a collective species. We need each other to survive.  \nYet, today, we celebrate individualism, we are not people, but economic units to compete against. We are more machine than human.  \nYet, most of society lives in this suspended belief that people are good, the world is fair, and victims are somehow deserving, because people wouldn't act that way against another person out of nowhere.\n\nPeople need to see the ugly. People need to stop sweeping ugly under the rug. The pain in this world has become too great. But everyone wears porcelain smiles.",
      "created_utc": 1722986449.0,
      "score": 2
    },
    {
      "id": "lguzky5",
      "body": "I completely relate to the first paragraph. I’m 32 and don’t feel like a proper adult. My emotions and moods were all over the place. I’ve gotten better with therapy and medication, literally just this month. I suggest considering talking to someone. Just know you’re not alone.",
      "created_utc": 1722989327.0,
      "score": 2
    },
    {
      "id": "lgv1byi",
      "body": "I'll be 39 in December... I have cyclic bipolar depression. Manic at the moment getting ready to cycle into a major depressive cycle. Every year between September or October I get incredibly depressed and it will last through till January. I have been unmedicated for the last 2 years so it's gonna suck.\nI won't have any motivation, it will be hard to even feed my family, I go completely numb. I will doom scroll endlessly, and stare at the TV without actually watching anything. It's awful but I've been doing it for like 25 years so it's like I'm a professional now. We prepare for it. Had a chat with my kids the other day about going back to helping around the house, understanding that it will be hard for me to follow through or socialize. I won't want to cuddle, or be lovey. I'm a teacher, I'm prewriting lessons, quizzes and exams. Anything to make the process easier. \nI'm between Drs, I can't seem to find a good practice, that doesn't piss me off with shitty customer service.",
      "created_utc": 1722989960.0,
      "score": 2
    },
    {
      "id": "lgv4kt3",
      "body": "Hey friend we all regressed in that pandemic. Kids in 4th grade are operating at a 2nd grade level. Milennials and gen Z got a raw deal. Don’t use it as an excuse, but use it to heal & do better.\nDon’t be so hard on yourself, life is traumatic in & of itself, let alone everything that happens along the way. You sound strong - stay that way.💙",
      "created_utc": 1722991159.0,
      "score": 2
    },
    {
      "id": "lgv9nsm",
      "body": "Oh boy, you have no idea how much company you have! \n\nIt's especially tough cause it's hard to feel like people can relate sometimes. But I know I can and I am pretty sure many more do as well.",
      "created_utc": 1722993063.0,
      "score": 2
    },
    {
      "id": "lgvlz23",
      "body": "I also feel like a scared and lost child. Absolutely exhausting!!! I try to put on a tough front but it really doesn’t work. I was abused as a kid and most of the time when I feel threatened, I freeze like a deer in headlights. And then I’m pissed off that I reacted that way, because freezing makes me feel weak.",
      "created_utc": 1722997780.0,
      "score": 2
    },
    {
      "id": "lgvo21p",
      "body": "35 and I feel this a lot. I have a therapist I talk to every week, and it helps, but it’s still frustrating to feel this way at my age.",
      "created_utc": 1722998608.0,
      "score": 2
    },
    {
      "id": "lgvs858",
      "body": "Your not alone. Iam not a professional but for me it was do important to understand that my amígdala had taken over. Try to learn about how your brain works. The fact that you are here willing to learn means the world. Keep going. You will get to a place where it all makes sense.",
      "created_utc": 1723000339.0,
      "score": 2
    },
    {
      "id": "lgw3nti",
      "body": "Ahhh my best mental breakdowns came in my 30’s. I feel I emerged stronger though.",
      "created_utc": 1723005606.0,
      "score": 2
    },
    {
      "id": "lgw483n",
      "body": "[removed]",
      "created_utc": 1723005891.0,
      "score": 2
    },
    {
      "id": "lgw8knq",
      "body": "I feel the same. Took a risk this year. Left my fulltime job to pursue drywall finisher apprenticeship program. It was for 3 months. If we graduated(i did) we would get signed up with the union, and they would help us look for a job. 1 week before graduation they tell us the industry is very slow, because inflation is still high, no one has money and there's no new projects. So my class of 14 graduate in june and since then i havent been working. I'm looking for jobs but everywhere is slow, cutting hours, or no one is hiring. Im also 30, i live in a rented home with my family of 4, i also help with rent , got my car finance/insurance, phone bill, i help with groceries. I've been feeling so helpless, useless, depressed but i try to smile and be positive but everyday i wake up beyond stress that its coming close to things getting worse. I dunno when things will get better but i hope it does sooner or later",
      "created_utc": 1723008213.0,
      "score": 2
    },
    {
      "id": "lgwdyk8",
      "body": "40 chiming in. It got better. But then got worse. Everyone around me lets me down in so many ways. When I get progress, everyone else regressed, pulling me down.",
      "created_utc": 1723011367.0,
      "score": 2
    },
    {
      "id": "lgwgfq6",
      "body": "I'm right there with you friend",
      "created_utc": 1723012902.0,
      "score": 2
    },
    {
      "id": "lgwj5yo",
      "body": "Honestly I'm 31 and I feel like I'll always be a teenager. I am 2nd in command at my job and have no idea what I'm doing.. And don't understand how I got the job 😭.. But fake it until you make it only goes so far. \n\nI've tried to embrace being a 31yo teenager 😂, I don't wanna feel old so I just tell myself I'm not. Be you Unapologetically ❤️",
      "created_utc": 1723014616.0,
      "score": 2
    },
    {
      "id": "lgwkvof",
      "body": "I think its pretty normal. We arent exactly set up for success, this generation. We were left to figure everything out in a world that is systematically built to feed from us and keep us oppressed. Just do your best to function, eat, observe hygiene try to find some things and maybe people you enjoy.",
      "created_utc": 1723015716.0,
      "score": 2
    },
    {
      "id": "lgwl03j",
      "body": "Yes. I’m 30, have a wonderful job and decent look and still mentally struggle with feeling like I failed in so many facets of my life. I have been through the upsides and downsides of people saying you have accomplished so much there’s no reason. To be unhappy and it kills ya worse. I just focus on me. Focus on staying healthy and don’t dwell on all the things I want in my life and instead place a position so when it falls into place it will. That’s what keeps me from stressing too often in my free time.",
      "created_utc": 1723015799.0,
      "score": 2
    },
    {
      "id": "lgwloen",
      "body": "I (M33) was the same, now i'm married and happy. the key is to idenifiy the source of the issue, for me it was my toxic family who i cut off 5 years ago. My mental health got better, but i had to keep working on it. 1. Cut toxic people 2 Exercise 3 sleep well 4 eat health. Do these agressively even if you dod not feel like, it will solve your mental gealth",
      "created_utc": 1723016246.0,
      "score": 2
    },
    {
      "id": "lgwr0lb",
      "body": "I turned 30 in July. I have BPD, Depression, Anxiety, and an eating disorder ive been dealing with for 17 years.\nI'm 8 years into a relationship with a guy with huge commitment issues. \nI just quit my second career to go back to school and am now unemployed for the first time since I was 16.\nI live in an apartment small enough to qualify as a closet.\nEvery day is a struggle to exist against the weight of all my failures and life's disappointments.",
      "created_utc": 1723019782.0,
      "score": 2
    },
    {
      "id": "lgx3ejm",
      "body": "Yes, it did not get better for me :/ ",
      "created_utc": 1723027614.0,
      "score": 2
    },
    {
      "id": "lgx8t0o",
      "body": "I'm 38 and it only seems to be getting harder. I keep having positive revelations and becoming more and more self aware but the spirals are just as common and they seem to be worse than ever. It doesn't matter what kind of support I have or what kind of material things I have, I'm a mess.",
      "created_utc": 1723030554.0,
      "score": 2
    },
    {
      "id": "lgx9aqq",
      "body": "I came down with anxiety in my late 30s, memory problems   thought i had dementia. My GP gave me a proper diagnosis of anxiety, put me on 3 antdepressant meds, referred me to a psychologist and psychiatrist.  \n\nAn accurate diagnosis is critical. Self diagnosis is a path to disaster.  Even expert  professionals can't reliably self diagnose. \n\nThe right diagnosis leads to the right treatment. \n\nI got put on 3 antidepressants for chronic anxiety and propanonol and diazepam for acute episodes. \n\nRunning really helped. But I got a fractured femur and diagnosed with low bone density in my femurs while my spine was normal. \n\nThen depression took over while I got anxiety under control mostly. Psychiatrist put me on ECT. That really helped, but is pretty full on. But later I got sacked from my job as a scientist as I was taking more sick leave than management wanted. That fucked me up badly for 3 months. \n\nTwo years later I'm feeling more stable and thinking about going back to work. I've been an inpatient 3 times at a mental health hospital. That really helped. \n\nBut I'm in Australia with an excellent public health system and private insurance too. \n\nTrust your doctors. Get the best care you can. People with mental health issues can be irrational about things like meds, when you're not in a good place to make rational decisions.  There's also a lot of misinformation out there. I'm lucky I'm a scientist and can check research and scientific papers on treatments and not get caught up in conspiracy theories which is easy to do if you are mentally ill, that's why it's so important to trust your doctors and ideally a psychiatrist, they are the experts on meds and other medical treatments like rTMS and ECT. Psychologists are good for talk therapy and working through problems.  But sometimes you need meds and treatments like ECT and TMS so you can get back to a place where you are rational enough to benefit from talk therapy with a psychologist or psychiatrist. \nGood luck.",
      "created_utc": 1723030794.0,
      "score": 2
    },
    {
      "id": "lgxoohd",
      "body": "I’m 40 and I’m going through year 2 of a midlife crises. Been in and out of work for the last year. I’m now working at Dominos part time. I worked at Pizza Hut 20 years ago so it’s hard not to feel like a massive failure.",
      "created_utc": 1723037156.0,
      "score": 2
    },
    {
      "id": "lgxslyi",
      "body": "35 years old and major ADHD so I struggle with shit like this everyday too. And I beat myself up as well because everyone else seems to handle themselves like a real adult. I don’t feel like I have an adult mindset and feel like I’ve failed to live up to potential. I feel your pain, truly.",
      "created_utc": 1723038558.0,
      "score": 2
    },
    {
      "id": "lgy2gos",
      "body": "[deleted]",
      "created_utc": 1723041844.0,
      "score": 2
    },
    {
      "id": "lgyatid",
      "body": "I asked my mum not too long ago if i was ever checked for adhd and autism and things when i was a kid. She said QUOTE \"we didnt really believe in it back then, plus we didnt want you to be bullied\" which when we got to the core of it was code for she didnt wanna deal with people knowing if i did have something neurological. Now i cant get a doctor to take me fucking seriously when i say theres something wrong with me.",
      "created_utc": 1723044482.0,
      "score": 2
    },
    {
      "id": "lgyff92",
      "body": "Im turning 31 and i am still lost and feel stupid most of the time.",
      "created_utc": 1723045907.0,
      "score": 2
    },
    {
      "id": "lgz25ji",
      "body": "Yup, same. I think it's because we live in a society that continuously treats us harshly, disabling us to heal. Personally, I find it too pressuring to hear people expect us to be \"adults\", because tbh I've been struggling alone all these times, and I'm clueless if I'm making any progress at all.",
      "created_utc": 1723052825.0,
      "score": 2
    },
    {
      "id": "lgz7lse",
      "body": "I feel you OP! I am in my mid-30s and recently went through a layoffs a lnd an international move as a result of that, back to my parents place. It's been hard. Dealing with massive insecurity and lack of self esteem even though the layoffs had nothing to do with talent or performance. Overall I've regressed significantly over the last year. Hopefully it will get better soon for us!",
      "created_utc": 1723054478.0,
      "score": 2
    },
    {
      "id": "lgrpwnd",
      "body": "logic is not the way. unreasonable optimism is. logic is what turns people into anxious pessimists.\n\nit's never too late to grow. don't lose hope 🫶🏼",
      "created_utc": 1722951456.0,
      "score": 3
    },
    {
      "id": "lgrtyur",
      "body": "There’s nothing wrong with seeking professional help. A lot of people feel this way. Seeking help is a good place to start.",
      "created_utc": 1722952863.0,
      "score": 1
    },
    {
      "id": "lgrvgrx",
      "body": "Yup! I didn’t even get in the correct medication until I was 32",
      "created_utc": 1722953375.0,
      "score": 1
    },
    {
      "id": "lgs0bpv",
      "body": "While I don’t personally deal with this, I have a couple close friends who do. I see it almost every day, and it’s a real thing. A lot of times they feel like they are failing at life because they can’t “get their sh*t together”. Our current society says it’s “abnormal” to be “acting” like this as an adult. I believe a lot of this is unhealed generational trauma, stigmatization, hyper individualism, lack of community and support, barriers to access for mental health, etc etc. so yes, there are people around your age that deal with these things, and you’re not a failure, nor are they.",
      "created_utc": 1722954986.0,
      "score": 1
    },
    {
      "id": "lgs18ib",
      "body": "Thank you for sharing how you feel. I’m 26 and I feel the exact same way, I don’t want to be like this the rest of my life. I want to psychologically change my mentality by eliminating my trauma, and completely erasing my anxiety and depression. It limits me in so many ways.",
      "created_utc": 1722955286.0,
      "score": 1
    },
    {
      "id": "lgs20ss",
      "body": "I'm turning 38\n\nI made a family, opened a small business, and bought a house at 33 3 3 months before Kobe Bryant died. Recently diagnosed with ADHD, mixed bipolar, anxiety, and PTSD. \n\nYes I still struggle. I don't feel like anything will last in my life. Income is still unstable. I have practically done business at a loss for the last 5 years except in 2021. How I still hold on to everything is sheer luck and lots of prayers answered. I try to be forgiving on myself since I started late in life due to my illness. It's hard when everyone around me is making 6 figures a month, and a few are younger than me. My wife thinks I am so much smarter than all of them, if only I had the opportunity earlier in life. Heh, her faith in me is how we're still together. Truth is, I'm just very average.\n\nI think of how much of an easier life I could have for me and my family if my talents could make up for my mental illness. Recently I've taken ADHD meds and I feel like I've improved. Let's see if my focus with will take me to millionaire status or age and chain smoking will catch up first.",
      "created_utc": 1722955540.0,
      "score": 1
    },
    {
      "id": "lgs2323",
      "body": "I agree with you about having a healthy circadian rhythm!! It helps out so much.",
      "created_utc": 1722955560.0,
      "score": 1
    },
    {
      "id": "lgs3s85",
      "body": "30 here and same",
      "created_utc": 1722956108.0,
      "score": 1
    },
    {
      "id": "lgs40p8",
      "body": "I think everyone struggles, at all stages of life. Some people are better at hiding it than others, some are better at coping with it than others, and some have a stronger support system than others. It is part of the human experience. As is the growth that comes with dealing with difficult times. Sending you love. You've got this!",
      "created_utc": 1722956181.0,
      "score": 1
    },
    {
      "id": "lgs6od8",
      "body": "Familiar. Talk to your doctor, try some meds, they’ve helped me. Talk to a therapist or your trusted family and friends.",
      "created_utc": 1722957033.0,
      "score": 1
    },
    {
      "id": "lgs71ey",
      "body": "How's that working out OP?\n\nI'm almost 50 and I still find myself struggling on many days.\n\nWhat helps me get through it isn't just journaling, but writing my thoughts down with a focus on analyzing my issue and seeing how I can find a better perspective or plan ways to make myself better.\n\nIt works for me, and I hope this could possibly work for you too.",
      "created_utc": 1722957149.0,
      "score": 1
    },
    {
      "id": "lgs83je",
      "body": "I'm 49 and still as anxious and confused as I was when I was 4.",
      "created_utc": 1722957488.0,
      "score": 1
    },
    {
      "id": "lgs8wud",
      "body": "I’m 41, and still struggle from time to time. I journal,  make art, and spend time in nature. These things help me through my dark times and remind me that  they (dark times) are temporary, and there’s always a way for things to improve.",
      "created_utc": 1722957744.0,
      "score": 1
    },
    {
      "id": "lgs9s1o",
      "body": "There is a U shaped curve with age as x axis and y as happiness. I think you can just Google u shaped happiness curve to see a Pic.\n\nIt basically says that research showed people were happier growing up for the most part, where happiness peaks early 20s and then quickly discends into depression that worsens a little more every year, hitting rock bottom around 40 and then increases into old age.\n\nPretty much most are happy horny teens, and older folks who just stopped giving a shit. Middle ages are rough for all, with mid life crisis and other things being a household name.\n\nI know ppl are different so curve may not apply to everyone, but I like a little logic for happiness to off set how I feel emotionally, which is pretty much same as you, not enjoying my 30s. I think it's worse for us, just with social media comparisons for those married or with kids. If you are alone, good luck finding a house or job you can afford. Good luck processing the trauma from covid and economic depression, etc\n\nNot to be all doom and gloom but I do think thigns will get better for all of us, but in meantime hell yeah 30s suck for me, so personally going to try to fix what I am in control over",
      "created_utc": 1722958018.0,
      "score": 1
    },
    {
      "id": "lgs9yc0",
      "body": "Many people struggle like this so please don't feel you're alone in your struggles. You can also find a way to improve your situation with the right support and approach. Have you considered getting professional support?",
      "created_utc": 1722958072.0,
      "score": 1
    },
    {
      "id": "lgsagz9",
      "body": "Your not alone I'm 28 and I constantly feel like a child in a adult's body faking my way through life.",
      "created_utc": 1722958236.0,
      "score": 1
    },
    {
      "id": "lgsfnc2",
      "body": "I'm 53 and boy do I struggle! You're not alone!!❤️❤️❤️",
      "created_utc": 1722959865.0,
      "score": 1
    },
    {
      "id": "lgsjyy8",
      "body": "Almost 37..... Feels like it's actually becoming more difficult each day.\n\nI wish you all the best.",
      "created_utc": 1722961214.0,
      "score": 1
    },
    {
      "id": "lgsl2cp",
      "body": "This is exactly how I describe myself. A scared 6 year old boy trapped in a mans body. Might check in to agoraphobia and panic disorder. I have them both along with a slew of other mental diagnoses.\n\nMy psychiatrist told me my brain stopped developing when I started drinking heavy, which was 15 years old. She said I could still learn things and be able to do a job but my emotions stopped developing.\n\nIt never really bothered me until I got sober last July. Guess I was masking a lot more than just ADHD. Now I'm a nutcase.\n\nEta: I just turned 31 in June.",
      "created_utc": 1722961550.0,
      "score": 1
    },
    {
      "id": "lgspbqc",
      "body": "I'm 37 and still have my cycles. I thought I was going to lose it a year ago, asked for help, did TMS, got back on meds (lamictal, Vyvanse, and emergency valium) am doing counseling 1x week, going to a NAMI Support groups 1xweek, and volunteering a couple times a week. I feel much much better now. Kinda wild how much better. I really believe I just can't give up and have to be open to trying to new treatments. Honestly I have had to kinda do my own treatment research. I found out about tms and found a doctor that did it, my psych didn't tell me about it. A lot of people I know have done TMS along with iv Ketamine and had fantastic results. My insurance doesn't pay for iv ketamine or I would be on top of that!",
      "created_utc": 1722962853.0,
      "score": 1
    },
    {
      "id": "lgsqqgo",
      "body": "You're far from alone, don't worry. I'm 38 and well.. this is the worst my life has ever been. Impressive considered my childhood was plagued with trauma. Now it's just.. loss. Lots of loss. And horrendous, emotional, long-lasting pain.\n\nTime goes on and I'm just drifting through a void that has no end. And I see no way out of it.",
      "created_utc": 1722963282.0,
      "score": 1
    },
    {
      "id": "lgsqsbb",
      "body": "At 29 I still struggle with being an adult. I've had jobs but never lasted in them. I am being assessed for AuDHD. Depression has delayed my personal growth since I was a teen. I am a decade behind most people my age. I have dreams that will never be fulfilled. I don't know how to be happy, and when I am happy it doesn't last long. You and I are just people who have fallen through the cracks of this ego centric, 'fuck you I've got mine' society. You are not alone in feeling left behind.",
      "created_utc": 1722963297.0,
      "score": 1
    },
    {
      "id": "lgt1nud",
      "body": "Maybe try self therapy by Jay Earley. Sounds like you have inner child healing that’s needed.",
      "created_utc": 1722966639.0,
      "score": 1
    },
    {
      "id": "lgt7bjp",
      "body": "[removed]",
      "created_utc": 1722968373.0,
      "score": 1
    },
    {
      "id": "lgtd3p5",
      "body": "2 years ongoing mental health issues here. I suspect I’ll have them the rest of my life.",
      "created_utc": 1722970155.0,
      "score": 1
    },
    {
      "id": "lgtms5x",
      "body": "I'm 30+ and I still struggle significantly.",
      "created_utc": 1722973162.0,
      "score": 1
    },
    {
      "id": "lgtulz2",
      "body": "I’m 40, working a stable entry level job in retail with a bunch of 20-somethings, many of which are getting into leadership while I’m stuck where I am because I’m working a people-friendly job as an introvert and possibly autistic person. But the health insurance is solid, and it’s what I know. \n\nOne of my extended family members asked me what I actually want to do for work and with my life. I had no real answer. I’ve been going from employer to employer doing what I know while trying to stay with employers who offer health benefits. What I really want? I just want to be normal. I want to be able to make friends easily like a normal person. Find a partner and get married like a normal person. Find a job that allows me to afford my own apartment or house. You know, like everyone else has that’s my age. What I actually want to do for work has always been and always will be completely irrelevant.",
      "created_utc": 1722975573.0,
      "score": 1
    },
    {
      "id": "lgtwpqz",
      "body": "Dear OP, I’m 52 and I have days where I feel like I need training wheels just to get through. \nI’m a widowed single mom, it was an abusive 21 yr marriage, I live in a different country than my homeland, and have no immediate family on the same continent. \n\nIt’s PERFECTLY OK to feel like you’re not grown up enough to hack life. I can guarantee you that of the 5 strangers you walk past in the next few days 4 have experienced the exact same feelings as you within the last few months and the 5th has the introspection of a teaspoon. \n\nIt’s part of being human, and part of having deep thoughts and pondering life. I get those days where I feel like this is too much, what am I doing, I’m going to mess this up, I’m going to lose control etc. where is my picture perfect normal adult life all the commercials and social media promised me - spoiler, they don’t exist.\n\nOn those days I just focus on the things I have to get done - feed the dogs, make sure my son eats something, walk the dogs, pick up the poop, put fresh water in the bowl, work, clock in, clock out… just the basics. Then I go to bed and sleep it off.\n\nJournaling as you already are is an excellent way to get intrusive thoughts out of your head. Talking kindly to yourself and giving yourself grace is SUPER important.  No one on earth has a secret manual for how to live life. Sure there are people who make it look like they know what they’re doing, they’re just good a faking it. \n\nIf it helps you, write goals for yourself, tangible things that you want to see/do/experience/achieve in life. Then take each item and put under it a brainstorm of ways to make it happen, even if they feel out of reach for now. Take time to think about them, and on the rough days when it seems impossible remind yourself that anything is possible. Give it time. \n\nAlso, do you go to therapy? Sometimes just a few visits is enough to learn great coping skills  to work through the difficult days. \n\nI wish you happy days ahead and all the good possibilities you can imagine.",
      "created_utc": 1722976213.0,
      "score": 1
    },
    {
      "id": "lgu8o26",
      "body": "Y'all wanna start a group chat? Let me know who's interested!",
      "created_utc": 1722979957.0,
      "score": 1
    },
    {
      "id": "lgucstb",
      "body": "I’ll be 60 next year.  Still struggling after decades with psychiatrists and therapists",
      "created_utc": 1722981305.0,
      "score": 1
    },
    {
      "id": "lguk2vi",
      "body": "I turn 37 this year and still struggle a lot, but its become massively better since I realized part of growth is accepting and sufficiently mourning the things you try to be, but aren't. The main source of my suffering has always come from my thoughts, feelings, and actions not being in alignment with each other and creating an internal struggle where all 3 think they are the hero or the victim, but never the villain lol. once I realized this I focused my energy on figuring out who I really am, instead of who I think I should be because of trauma, circumstance, and conditioning. the more of those things I drop from my idea of self, the less Mexican standoffs that happen in my psyche, the less I suffer.",
      "created_utc": 1722983809.0,
      "score": 1
    },
    {
      "id": "lgul3l3",
      "body": "Keep ur head up",
      "created_utc": 1722984165.0,
      "score": 1
    },
    {
      "id": "lgumiy1",
      "body": "I feel the same way",
      "created_utc": 1722984662.0,
      "score": 1
    },
    {
      "id": "lguqmu8",
      "body": "I remember being on a psych ward at age 31 with a lot of younger people. I felt like such a loser that I hadn't figured things out.\n\nNow I'm 57.  57! :-)  I'm still working on myself and unraveling stuff, but I'm much more comfortable with it. I've made a lot of progress and will continue, bit by bit, every day of my life.",
      "created_utc": 1722986118.0,
      "score": 1
    },
    {
      "id": "lguqr8u",
      "body": "I’m 33 and still struggling. But you can do things that help. I’ve recently got into gardening with my niece and it’s cute 😊",
      "created_utc": 1722986161.0,
      "score": 1
    },
    {
      "id": "lgut83v",
      "body": "[removed]",
      "created_utc": 1722987038.0,
      "score": 1
    },
    {
      "id": "lguwos7",
      "body": "37. Feeling more broken and lost than ever... despite years of therapy and medication. If you are on a right path, you'll progress. Slow and steady. Hang in there!",
      "created_utc": 1722988278.0,
      "score": 1
    },
    {
      "id": "lgvmrgd",
      "body": "Yup",
      "created_utc": 1722998092.0,
      "score": 1
    },
    {
      "id": "lgvt1b7",
      "body": "36 and yes. I’ve never had *any*thing resembling therapy. It’s fucking impossible as an adult, even with Medicaid. I just deal. I’ve had PCPs throw random meds at me but none of them work or I end up having the rarest side effects you can have on them.",
      "created_utc": 1723000686.0,
      "score": 1
    },
    {
      "id": "lgvtoao",
      "body": "My mental health was ok in my 20s but plummeted in my 30s; so I get it",
      "created_utc": 1723000960.0,
      "score": 1
    },
    {
      "id": "lgvuyrt",
      "body": "I’m 50 and have the same life. It’s a phase I’m going through but understand how you must feel. You seem much more mature than I at 30.",
      "created_utc": 1723001524.0,
      "score": 1
    },
    {
      "id": "lgw2jfj",
      "body": "I'm struggling the most in my 30s, it's very hard :(",
      "created_utc": 1723005043.0,
      "score": 1
    },
    {
      "id": "lgw9aty",
      "body": "🙋‍♀️😔",
      "created_utc": 1723008624.0,
      "score": 1
    },
    {
      "id": "lgwdqiz",
      "body": "i’m 31 and I’m a fucking hot mess, babes",
      "created_utc": 1723011231.0,
      "score": 1
    },
    {
      "id": "lgwfpez",
      "body": "I’m 37, married, w 2 kids. This feeling will never go away, just fyi. Therapy helps",
      "created_utc": 1723012445.0,
      "score": 1
    },
    {
      "id": "lgwj253",
      "body": "I get where you're coming from. I'm in my 30s and still face my fair share of struggles. It's easy to feel like we're supposed to have everything figured out by now, but life doesn't always work out that neatly. What’s helped me is embracing the journey and understanding that everyone's path is different. It’s okay not to have all the answers.\n\nSeeking support is crucial, too. [I’ve found therapy](https://click2pro.com/psychologists/top-psychologist-in-gurgaon-Richa-Shree-207), support groups, or just talking to friends and family can make a huge difference. Also, self-care is key – prioritize your mental and physical health. Things like exercise, meditation, hobbies, and taking time for yourself can help manage stress and keep you grounded.\n\nSetting realistic goals has been helpful. Breaking down big life goals into smaller, manageable steps and celebrating progress along the way can make things feel less overwhelming. Staying flexible and adaptable to life's unexpected twists and turns can also make navigating challenges smoother.\n\nRemember, struggling doesn’t mean you’re failing. It’s a part of being human, and you’re not alone in this. Keep pushing forward and be kind to yourself. You've got this!",
      "created_utc": 1723014549.0,
      "score": 1
    },
    {
      "id": "lgwjdvm",
      "body": "That lost child is a part of you. When I feel this way, as my adult self, I acknowledge that child, hug her, hold her and take her by the hand and tell her we can get thru it.  Let her know that you, as the adult are in charge and it will be ok. Xx",
      "created_utc": 1723014753.0,
      "score": 1
    },
    {
      "id": "lgx1cot",
      "body": "This one time I got high, and I felt like it too strong of a hit... And where I went was like... My perceptions, my belief systems, my internal beacon that's tracks things like where I am, what bills I have to pay, tasks I need to do tomorrow etc... all that vanished... And so all I was left with was this feeling of \"home\"... And it wasn't a new feeling... It was a very very familiar feeling... Like I remember feeling this feeling as a child... But it wasn't like a feeling that was derived from previous experiences here on earth, it wasn't a feeling that came from cause and effect, or comparisons, or relational comprehension of any sort... It was its own essence... It was \"me\"... Purity... Tracing the line of creation to creator and no separation...",
      "created_utc": 1723026425.0,
      "score": 1
    },
    {
      "id": "lgx9wxu",
      "body": "[removed]",
      "created_utc": 1723031087.0,
      "score": 1
    },
    {
      "id": "lgxlcdl",
      "body": "31F - all this yes",
      "created_utc": 1723035917.0,
      "score": 1
    },
    {
      "id": "lgyveg0",
      "body": "Yes",
      "created_utc": 1723050785.0,
      "score": 1
    },
    {
      "id": "lh2irql",
      "body": "You're not alone friend. I'm 35, own my own home, have a job that pays my bills and I'm still depressed as fuck. I used to be social but I've been so burned out for the past few years.  Maybe it's burn out for you? I've found therapy to be really helpful to get out of my own head.",
      "created_utc": 1723099539.0,
      "score": 1
    },
    {
      "id": "lh4q3gl",
      "body": "Yup. People who say **\"it's all in your head!\"** never had your life issues & wouldn't cope if they were in your shoes. People with horrible lives end up anxious & depressed. Those with good lives either given by family or born into or by chance, are happy & healthy. \n\nI know not only from observation but first hand experience- I was classified as mentally ill while being bullied throughout school, they said I had neurological probs- all suddenly evaporated when I moved area & was treated well. Then all came back when moving area & targetted again. When I had a well paid comfortable job, I was happy & productive. When I lost that, I got all sorts of mental health probs again. First hand experience confirms my observations.\n\nI'm in a unique position to notice this as I've lived in countless HMOs over the decades, having become close friends with large numbers of people in radically different life situations.",
      "created_utc": 1723134707.0,
      "score": 1
    },
    {
      "id": "likrryv",
      "body": "Don't feel silly. It's all of us. Our brains and our bodies were built for a world that doesn't exist anymore. Through our own doing, we are propelling our environment forward at a rapid rate of knots, so much so, that by the time we have reached adulthood, all the skills we learned in infancy and our formative years to prepare us for succeeding in the world are no longer relevant, the world has changed that much. This is the first time in history that we have reached that level of exponential progression at a speed we can no longer adapt to. \nYou are not alone. We're all feeling it and we're all very lost together. \nAnd it's sadly only going to get worse, unless people realise the path we as a species are on. \n\n\nSorry, got a little dark there in the end. My message was meant to be reassuring to you - it's not just you. And it's not your fault 🥰",
      "created_utc": 1723908519.0,
      "score": 1
    },
    {
      "id": "m0s1kne",
      "body": "Hey OP, know I’m late to the party on this but just wanted to add my voice to the chorus for you, and anyone else reading who’s going through the same.\n\nI’m turning 30 pretty soon. I thought I’d have it all figured out by now - relationships (family, friends and romantic), house, career but if anything I feel more lost and uncertain than I did when I was a kid. I’m doing okay in my career, but exhausted all the time and constantly questioning my aptitude for it (a lot of a typical week feels like an exercise in standing on the precipice of quitting and talking myself away from it).\n\nI’ve been in therapy for a long time - on and off since I was in my late teenage years, and pretty regularly since my early-mid 20s. Medications of all different kinds during that period. I’ve made a huge amount of progress, but I still find the process of navigating life and relationships with people to be painful and exhausting. I still feel very vulnerable and ashamed of who I am a lot of the time, and embarrassed about the way I’ve reacted to stressful life events. \n\nI say this as someone who has, and continues to struggle with this but I think parts of the key to holding on and getting through are in practising self compassion and avoiding comparison. Yes, how we heal and act in the future is up to us - but that doesn’t mean we have to beat ourselves up for making mistakes, struggling with difficult emotions  and having days, weeks, months, years where we don’t feel okay. Also consider that you’re surviving and doing well in a world that - at the best of times - is extraordinarily difficult to live in.\n\nYou’re loved and cared for by the people around you - and you deserve the same treatment from yourself.",
      "created_utc": 1733523592.0,
      "score": 1
    },
    {
      "id": "lgrl7ad",
      "body": "Who raised you?",
      "created_utc": 1722949751.0,
      "score": -7
    },
    {
      "id": "lgv9qcq",
      "body": ">especially within a system that routinely mistreats people who have mental health issues.\n\nThis is overlooked way too often. The world is simply not built for us.",
      "created_utc": 1722993090.0,
      "score": 29
    },
    {
      "id": "lgslbdb",
      "body": "Check into state insurance, Medicaid. Or a sliding scale clinic. There's help out there you just got to dig a little bit for it. I used to be in the same boat friend.",
      "created_utc": 1722961626.0,
      "score": 14
    },
    {
      "id": "lguwha9",
      "body": "I had no insurance from the time I was 25 until the end of last year. I’m 48. I went to a free clinic for just a checkup. I felt off.\nTurns out I was having a hypertension crisis. They sent me to the emergency room. I left the emergency room with full blown Medicaid.\n\nGo to your local free clinic. Sometimes it’s all about the individual you get assigned to your case. If you feel like your case worker isn’t hearing you…try someone else. You could start by reading your post to them.\n\nI talk about the specific person who is assigned to your case because in the emergency room, I’m not sure if I would’ve gotten Medicaid if it wasn’t for the angel of an administrator lady that tended to me. She gave me specific instructions to only call the woman at the phone number she gave me. Possibly a friend? I don’t know. The way it went down I think it’s a realistic possibility.\nYou know the saying “not what you know but who you know” oftentimes.\n\nGo to the free clinic! Read them that post! If you are denied keep going back until you make headway.",
      "created_utc": 1722988203.0,
      "score": 6
    },
    {
      "id": "lgv4ry2",
      "body": "I’m 25 & feeling the same, good to know that biological clock ticking just gets louder💔",
      "created_utc": 1722991233.0,
      "score": 3
    },
    {
      "id": "lgsqyv7",
      "body": "We are both lost together. 💀",
      "created_utc": 1722963352.0,
      "score": 3
    },
    {
      "id": "lgvsgjq",
      "body": "Have you looked up DBT. There are many free resource out there. Your not alone!! ❤️",
      "created_utc": 1723000440.0,
      "score": 3
    },
    {
      "id": "lgzeksq",
      "body": "See if there is a Unison in your area, I go through them and they can make it very cheap with financial assistance \nI’ve been seeing this amazing therapist with them weekly since November, have yet to pay anything but my total bill is at like $250",
      "created_utc": 1723056598.0,
      "score": 1
    },
    {
      "id": "lke851a",
      "body": "FYI for the 'Check into Medicare' advice. Fully disabled persons or a woman in custody of a child under 18 are the only ones who qualify for full Medicaid benefits, which would include mental healthcare.\nIf you have full disability already, go for it. If you are in possession of a child, go for it.\nI have neither and am SOL. They lady at Medicaid told me to get pregnant or find something on the marketplace.",
      "created_utc": 1724874994.0,
      "score": 1
    },
    {
      "id": "lgtqo1a",
      "body": "Hey friend I have been in a similar position, and I know that it feels kinda impossible. But! There are some cool cheap/free resources - there's Presbyterian Counselling Services in most cities/many towns, btw I'm not religious myself, and the church involvement is limited to only providing volunteers to do the admin stuff. I was a little freaked by the name, but the counselors aren't part of the church. The counselors volunteer their time and there's no 'churchy' vibe or dogma involved. They were *really* helpful when I was totally broke and having a difficult time. I wish you the very best!",
      "created_utc": 1722974359.0,
      "score": 1
    },
    {
      "id": "lgw2pyh",
      "body": "I'm the same age and feel the same way. Mental illness takes so much away from us, life experience as my mom calls it. I still feel like I'm living in the past.",
      "created_utc": 1723005133.0,
      "score": 3
    },
    {
      "id": "lgwjidg",
      "body": "i think we are all children, acting as adults",
      "created_utc": 1723014833.0,
      "score": 2
    },
    {
      "id": "lhdja7b",
      "body": "I’m 36 and I live with my family.",
      "created_utc": 1723255347.0,
      "score": 1
    },
    {
      "id": "lgs88wl",
      "body": "This is super pure and this person should be protected at all costs",
      "created_utc": 1722957535.0,
      "score": 2
    },
    {
      "id": "lgv9v5j",
      "body": "How are you now?",
      "created_utc": 1722993141.0,
      "score": 1
    },
    {
      "id": "lgvdke2",
      "body": "I worry what will happen to me when my cat is no longer with me, so your story deeply resonated. Sending you virtual hugs 🩷 I hope things gradually feel less heavy (saying this to both of us!)",
      "created_utc": 1722994546.0,
      "score": 3
    },
    {
      "id": "lh2ex7a",
      "body": "It’s like navigating through fog—therapy and meds can be like finding a lighthouse to guide you. Even though it’s still challenging, knowing you’re not alone can make a huge difference. Keep going; every step forward is progress. 🌟🙏",
      "created_utc": 1723097189.0,
      "score": 1
    },
    {
      "id": "lh2jbeq",
      "body": "Wow, it sounds like you’ve been on quite the journey, trying to piece together a sense of connection and meaning amidst so many shifts and challenges. It’s like we’re all trying to tune a radio to find the right frequency in a world full of static.\n\nIt’s really tough when everything around us feels out of sync and you’re left feeling detached and overwhelmed. It’s okay to feel like the world’s noise is too much, and it’s valid to struggle with finding your place in it all. Sometimes, it’s the small, consistent efforts that can help us slowly find our footing again.\n\nJust know that you’re not alone in feeling this way, and it’s admirable that you’re seeking solutions and striving to make sense of everything. Keep reaching out and exploring what resonates with you. Every step you take, even the small ones, is progress. 🌟",
      "created_utc": 1723099881.0,
      "score": 1
    },
    {
      "id": "lgu3lov",
      "body": "Same.",
      "created_utc": 1722978341.0,
      "score": 1
    },
    {
      "id": "lh2envp",
      "body": "I hear you. It’s like trying to navigate a stormy sea with a small boat—everyone says the waters will calm, but it feels like you’re still battling waves. Remember, even though the journey feels endless, every small step forward counts. Keep holding on, and be gentle with yourself. You’re not alone in this, and reaching out for support, like you’re doing now, is a sign of strength. 🌟",
      "created_utc": 1723097036.0,
      "score": 2
    },
    {
      "id": "lh2eowg",
      "body": "I totally get it—sometimes, life feels like climbing a really steep hill, even at 31. It’s okay to feel this way, and it doesn’t make you any less. Everyone’s journey is different, and it’s okay to take it one step at a time. Keep being kind to yourself and remember that even the toughest climbs eventually lead to a view worth seeing. 🌈",
      "created_utc": 1723097054.0,
      "score": 2
    },
    {
      "id": "lh2eqwb",
      "body": "It sounds like you’re in a real battle, and I’m sorry it feels so tough. Life can definitely feel like a relentless struggle, like trying to swim against a strong current. Your strength and persistence are impressive, even if it feels like progress is slow. It’s okay to take a breath and regroup—every small victory counts. Just like in Eren’s quote, keep fighting and believe that each step, no matter how small, brings you closer to a bit of peace. Hang in there, and remember that you’re not alone in this fight. 🌟💪",
      "created_utc": 1723097086.0,
      "score": 2
    },
    {
      "id": "lh2f06b",
      "body": "It’s great that you’re tackling those issues head-on. It’s like peeling away layers of an onion—each layer might bring a tear, but you’re getting closer to the core. Even though it’s tough, addressing these things is a huge step toward healing. Keep going—you’ve got this! 🌟🧅",
      "created_utc": 1723097238.0,
      "score": 1
    },
    {
      "id": "lh2gcut",
      "body": "It sounds like you’re really taking care of yourself, which is awesome. It’s like tending a garden—sometimes you might not see the blooms right away, but every bit of care helps things grow. Keep going with your therapy and check-ins; they’re like watering the seeds of progress. You’re not alone, and every step you take is a step toward feeling better. 🌱🌟",
      "created_utc": 1723098043.0,
      "score": 1
    },
    {
      "id": "lh2gmm9",
      "body": "It sounds like you’re going through a lot of changes and finding new ways to handle emotions. It’s like opening a door to a room you forgot existed—suddenly, there’s so much more to navigate. Your journey through therapy and medication is brave, and it’s great that you’re starting to find some joy, even if it feels overwhelming at times. And you’re right—finding a better work environment can make a huge difference. Keep being kind to yourself and reaching out for support. You’re doing an amazing job navigating this new terrain! 🌟💪",
      "created_utc": 1723098208.0,
      "score": 1
    },
    {
      "id": "lh2go12",
      "body": "I totally get what you mean—sometimes it feels like we’re stuck in a never-ending game of hide and seek with our emotions. It’s okay to feel this way, and acknowledging it is a big step. You’re not alone in this, and it’s comforting to know others are navigating similar feelings. Hang in there; every day is a new chance to take care of yourself. 🌈💪",
      "created_utc": 1723098232.0,
      "score": 2
    },
    {
      "id": "lh2gtso",
      "body": "I hear you. It’s like trying to have a conversation underwater—so much effort but not much gets through. It’s tough when you’re struggling to connect even with someone close to you. Remember, it’s okay to take your time and be honest about how you’re feeling. Sometimes just being there for each other in silence can be comforting too. 🌊💖",
      "created_utc": 1723098331.0,
      "score": 1
    },
    {
      "id": "lh2gveo",
      "body": "It sounds like you’ve put a lot of thought into managing your mental health, and that’s really inspiring. It’s like tending a garden—sometimes you need to start with just one plant and give it the care it needs before adding more. I love your idea of focusing on one small change at a time. And yes, finding what works best for you, whether it’s journaling or something else, is key. Your advice is really practical and thoughtful—thank you! 🌿💪",
      "created_utc": 1723098358.0,
      "score": 2
    },
    {
      "id": "lh2hk77",
      "body": "It’s like being on a long, winding road with no clear map—just knowing others are traveling the same path helps a lot. Hang in there, and remember we’re all figuring it out together. 🛤️💛",
      "created_utc": 1723098784.0,
      "score": 2
    },
    {
      "id": "lh2hn86",
      "body": "I’m really sorry you’re going through this—sounds like you’re dealing with a lot right now. It’s like being caught in a storm without a clear sky in sight. Remember, it's okay to feel lost and overwhelmed. Sometimes, taking it one small step at a time can help, like finding a safe place to start rebuilding. Even the tiniest bit of progress is still progress. Be gentle with yourself and know that you’re not alone. 💛🫶",
      "created_utc": 1723098838.0,
      "score": 2
    },
    {
      "id": "lh2hvb9",
      "body": "It’s like you’re seeing through a cracked mirror, revealing the deeper truths of our society and its flaws. It's brave to confront these issues and seek growth amidst the chaos. Healing isn't always linear, and it's okay to feel frustrated with the pace. Your desire to challenge the status quo and make space for real, unfiltered emotions is incredibly important. Keep using your voice and experiences to shine a light on these hidden struggles. You’re not alone in feeling this way, and your courage is a step towards making a difference. 🌟💪",
      "created_utc": 1723098975.0,
      "score": 1
    },
    {
      "id": "lh2ie9n",
      "body": "It’s like we’re all navigating the same stormy sea, each in our own little boats. I'm glad to hear therapy and medication are helping you—sometimes it feels like just keeping the boat afloat is a victory. Talking to someone could be really valuable, and it’s comforting to know we’re not alone in this. 🌈🚤",
      "created_utc": 1723099304.0,
      "score": 1
    },
    {
      "id": "lh2j7cx",
      "body": "It sounds like you’ve been navigating some really tough waters for a long time. Like you’re preparing for a storm you’ve learned to weather, it’s impressive how you’re setting things up to make it through. I hope you find a doctor who’s a good fit soon—having the right support can make a big difference. And it’s clear you’re doing everything you can to keep things together for your family. Just know that even when things feel overwhelming, you’re not alone in this storm. 🌧️⚓",
      "created_utc": 1723099811.0,
      "score": 1
    },
    {
      "id": "lh2j8qr",
      "body": "I really appreciate your kind words. It's like we all got hit with a wave during the pandemic, and it’s okay to feel like we’re still catching our breath. Healing takes time, and it’s cool to give yourself some grace. Thanks for reminding me that it’s all part of the journey. 💙🌟",
      "created_utc": 1723099835.0,
      "score": 2
    },
    {
      "id": "lh2j9ud",
      "body": "I hear you—sometimes it feels like we’re navigating a maze alone. But knowing there’s a whole crowd of us out there makes the journey a bit less lonely. Thanks for reminding me that there’s a whole community of people who get it. 💪💙",
      "created_utc": 1723099854.0,
      "score": 2
    },
    {
      "id": "lh2jpfv",
      "body": "I hear you. It’s like trying to be a superhero while feeling like you’re stuck in a never-ending haunted house. Putting on a tough front can be so draining, especially when inside you’re still that scared kid. Freezing in moments of stress doesn’t make you weak; it’s just your body’s way of trying to protect you. Be kind to yourself and remember, even superheroes need a break. You're not alone in this—hang in there. 💖",
      "created_utc": 1723100125.0,
      "score": 2
    },
    {
      "id": "lh2jqsf",
      "body": "I get it. Feeling like you're stuck in a tough spot can be super frustrating, no matter your age. It’s like you’re trying to navigate through a fog with only a flashlight. Therapy is a great tool, though—it’s like having a guide to help clear the path, even if the fog still lingers. Keep hanging in there; you're making progress, and you’re definitely not alone. 💪🌟",
      "created_utc": 1723100149.0,
      "score": 2
    },
    {
      "id": "lh2jsbi",
      "body": "It’s reassuring to know that I’m not alone in this. Learning about how the brain works is definitely a step towards understanding what’s happening inside. It’s like piecing together a puzzle—sometimes it feels overwhelming, but each piece brings clarity. I’m hanging in there and will keep moving forward, one step at a time. 😊🧩",
      "created_utc": 1723100175.0,
      "score": 1
    },
    {
      "id": "lh2jtq1",
      "body": "It’s amazing how the toughest times can sometimes make us stronger in the end. It’s like going through a storm and coming out with a clearer sky. I’m holding onto the hope that these struggles are shaping me for something better. Thanks for sharing your experience—it’s a reminder that even the hardest moments can lead to growth. 🌈💪",
      "created_utc": 1723100200.0,
      "score": 1
    },
    {
      "id": "lh2jxe2",
      "body": "It’s so comforting to know that we’re all in this messy, unpredictable boat together, even if it feels like we’re all paddling in different directions. Everyone’s got their own battles behind the scenes, even those who seem like they’ve got it all figured out. Thanks for sharing—it’s a reminder that we’re not alone in our struggles. 💛🚤",
      "created_utc": 1723100264.0,
      "score": 1
    },
    {
      "id": "lh2k10q",
      "body": "I’m really sorry to hear you’re going through this. It sounds like you’ve been dealt a tough hand, and it’s completely normal to feel overwhelmed. It’s like being on a rollercoaster that won’t stop—sometimes you just have to hold on tight and hope the ride eventually slows down. Keep pushing forward; your resilience is inspiring. I hope things turn around soon for you. Hang in there! 🌟💪",
      "created_utc": 1723100326.0,
      "score": 1
    },
    {
      "id": "lh2k3pb",
      "body": "I hear you—it’s like climbing a mountain only to find that the summit keeps moving further away. It’s so frustrating when you’re making strides, and others’ setbacks seem to pull you back down. Keep focusing on your own path, though; your progress is real and valuable. You’ve got this! 🌟🏔️",
      "created_utc": 1723100373.0,
      "score": 1
    },
    {
      "id": "lh2k4yk",
      "body": "I get it. Sometimes it feels like we’re navigating a stormy sea with no land in sight. Just know you’re not alone in this, and your courage to keep going, even when it’s tough, is something to be really proud of. 🌈🚢",
      "created_utc": 1723100395.0,
      "score": 2
    },
    {
      "id": "lh2k6g6",
      "body": "Haha, I totally get that feeling of being a “31-year-old teenager” – it’s like living in an endless coming-of-age movie! 🎬 Sometimes, faking it is just part of the adventure. Embracing who you are with all your quirks and uncertainties is like finding your own rhythm in a dance that never quite ends. Keep being unapologetically you! ❤️🌟",
      "created_utc": 1723100420.0,
      "score": 1
    },
    {
      "id": "lh2k7vi",
      "body": "I hear you! It’s like being in a beautiful garden but still feeling like the weeds are taking over. 🌱✨ Sometimes, no matter how much we’ve achieved, it’s hard not to focus on what’s missing. It sounds like you’ve found a great way to stay grounded by focusing on your well-being and letting things fall into place naturally. Keep tending to your garden; every little effort helps it flourish. 🌸💪",
      "created_utc": 1723100445.0,
      "score": 1
    },
    {
      "id": "lh2ka2w",
      "body": "It’s like cleaning out a cluttered room—once you clear out the old stuff, there’s room for new and better things. 🌟 I’m so glad to hear you’ve found happiness and made those positive changes! Cutting out toxicity, staying active, and taking care of yourself are all steps towards a brighter space. Keep shining and know that it’s okay to take it one step at a time. 🧹❤️",
      "created_utc": 1723100484.0,
      "score": 2
    },
    {
      "id": "lh2kbds",
      "body": "I totally get where you're coming from. It’s like trying to carry a backpack filled with bricks—everyday can feel heavier than the last. 🎒 But sometimes, taking a break and just acknowledging the weight can be a small relief. Even in that tiny apartment and during these tough times, you’re still making brave choices, like going back to school. 🌟 Keep hanging in there and know that every small step you take is a victory. You’re not alone in this struggle. 💖",
      "created_utc": 1723100507.0,
      "score": 2
    },
    {
      "id": "lh2kcl6",
      "body": "I’m sorry to hear that things haven’t gotten better for you. It’s like being stuck in a storm without a clear way out, and it can feel incredibly draining. 🌧️ Just remember, sometimes even in the darkest weather, there’s a break in the clouds eventually. It might not seem like it now, but every step you take, no matter how small, is a step towards finding that light. You’re not alone in this. 💕",
      "created_utc": 1723100528.0,
      "score": 1
    },
    {
      "id": "lh2kdsc",
      "body": "It sounds like you're carrying a heavy load, even with all your self-awareness and support. It’s like being a sailor on a turbulent sea—you can chart a course and have the best gear, but the waves still crash hard. 🌊 Your struggles are valid, and it's okay to feel like a mess sometimes. Remember, even in the stormiest weather, there's always hope for calmer seas ahead. Keep holding on and navigating through; you’re stronger than you realize. 💪🌟",
      "created_utc": 1723100549.0,
      "score": 2
    },
    {
      "id": "lh2kfph",
      "body": "Thank you for sharing your journey. 🌟 It’s like you’ve been navigating through a stormy sea, and though the waves have been relentless, you’ve found some calmer waters with the right support. 🌊 It’s crucial to have those guiding stars, like your doctors and treatment plan, to help steer through the rough patches. Even though the path is tough, having a reliable crew and the right tools can make a world of difference. Keep trusting the process and taking it one step at a time. You’ve got a lot of resilience and support on your side. 🌈💪",
      "created_utc": 1723100583.0,
      "score": 1
    },
    {
      "id": "lh2kh1t",
      "body": "I hear you. It’s like you’re trying to climb a mountain, but the path keeps shifting under your feet. 🏔️ Working at Domino’s now might feel like a step back, but it’s also a reminder of your resilience and willingness to keep moving forward. 🍕 Each step, no matter how small it feels, is a part of your journey. Remember, even the most successful people have had their own tough climbs. Keep your head up and your heart steady—you’re doing great, even if it doesn’t always feel that way. 🌟",
      "created_utc": 1723100607.0,
      "score": 2
    },
    {
      "id": "lh2kijr",
      "body": "I totally get where you’re coming from. It’s like trying to juggle a dozen balls while everyone else seems to have it all figured out. 🎪 Just remember, even if it feels like you’re not keeping up, that doesn’t mean you’re not doing your best. We all have our own rhythm, and sometimes it takes a little longer to find it. Be kind to yourself—you’re not alone in this, and your journey is just as valid as anyone else’s. 🌟",
      "created_utc": 1723100632.0,
      "score": 1
    },
    {
      "id": "lh2kjmz",
      "body": "I hear you! It’s like feeling like you’re still stuck in the sandbox while everyone else is building their castles. 🏰 Working on yourself can be a tough journey, but every step counts. Just because you’re not where you thought you’d be doesn’t mean you’re not making progress. Keep at it—you’re doing better than you think! 🌟",
      "created_utc": 1723100651.0,
      "score": 2
    },
    {
      "id": "lh2kkyi",
      "body": "I’m so sorry you’re dealing with that. It’s like trying to get a ship to dock when the dock is under construction—so frustrating! 😩 Sometimes it feels like we're navigating stormy seas alone, but you’re not alone. Keep advocating for yourself; your feelings are valid, and you deserve to be heard. Hang in there—your persistence will help you find the right support. 🌈",
      "created_utc": 1723100675.0,
      "score": 1
    },
    {
      "id": "lh2kmbf",
      "body": "I get it. Sometimes it feels like we're wandering through a foggy forest, even when we’re older. It’s okay to feel lost sometimes—it's part of the journey. Just remember, you're not alone in this, and even small steps forward can lead to brighter paths. 🌟 Keep hanging in there!",
      "created_utc": 1723100699.0,
      "score": 1
    },
    {
      "id": "lh2knon",
      "body": "I totally understand what you mean. It's like trying to navigate a maze where the walls keep shifting. Society can be really harsh, and the pressure to \"be an adult\" only makes it harder. Just know that struggling doesn't mean you're not making progress—it’s often the small, quiet steps that lead to the biggest changes. 🌈 You're not alone in this maze.",
      "created_utc": 1723100723.0,
      "score": 2
    },
    {
      "id": "lh2kowv",
      "body": "I totally get where you're coming from. It’s like being caught in a storm where everything feels like it’s spinning out of control. Moving back to your parents’ place and facing layoffs can feel like a huge step back, even though it’s not a reflection of your worth or skills. Hang in there—sometimes these storms are just temporary, and clearer skies are ahead. Sending you strength and hope for better days! 🌟",
      "created_utc": 1723100745.0,
      "score": 1
    },
    {
      "id": "lgu044t",
      "body": "Sometimes we remove posts that are too triggering, and unfortunately concluded yours is one of those triggering posts. It looks like you're going through a really tough time right now. There are better people to assist you with this situation, and you can find the support you so desperately deserve over at [r/SuicideWatch](https://www.reddit.com/r/suicidewatch).\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722977263.0,
      "score": 1
    },
    {
      "id": "lgutw2y",
      "body": "Promotion and advertising of products or services is strictly prohibited on r/mentalhealth. We also prohibit links and recommendations for social media and video hosting sites or the accounts of content creators or influencers. \n\nComments that explain *what a product helped you with* and *how it helped you* may also reference the product. Do not link to the product or suggest that someone seek it out. Moderator discretion on allowing comments of this nature is final.\n\nPosts and comments may relay helpful and accurate ideas and information obtained from social media or video sites, but do not link or suggest that a user seek the creator out.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1722987279.0,
      "score": 1
    },
    {
      "id": "lgy7oia",
      "body": "Promotion and advertising of products or services is strictly prohibited on r/mentalhealth. We also prohibit links and recommendations for social media and video hosting sites or the accounts of content creators or influencers. \n\nComments that explain *what a product helped you with* and *how it helped you* may also reference the product. Do not link to the product or suggest that someone seek it out. Moderator discretion on allowing comments of this nature is final.\n\nPosts and comments may relay helpful and accurate ideas and information obtained from social media or video sites, but do not link or suggest that a user seek the creator out.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1723043503.0,
      "score": 1
    },
    {
      "id": "lgx9c3w",
      "body": "I have c-ptsd and I also struggle with lots of things. But people other there say “everyone is traumatized”. Is me struggling more than others my fault, is me not trying hard enough? I am asking because you said the world is not build “for us”.",
      "created_utc": 1723030812.0,
      "score": 5
    },
    {
      "id": "lj5bj5l",
      "body": "I use a sliding scale clinic, I wouldn't be able to afford anything otherwise",
      "created_utc": 1724207216.0,
      "score": 2
    },
    {
      "id": "lkhb6x2",
      "body": "I'm not even from USA, I'm from a 3rd world country where unfortunately I'm on my own. My country doesn't really provide any kind of help like that anyway, in theory there is some kind of universal healthcare my insurance covers, but it's of very bad quality and it can basically do more harm than good honestly.",
      "created_utc": 1724927480.0,
      "score": 1
    },
    {
      "id": "lgvfkei",
      "body": "[deleted]",
      "created_utc": 1722995301.0,
      "score": 2
    },
    {
      "id": "lh2z06h",
      "body": "Thanks for your comforting comments they mean a lot. I'm going thru a struggle in my personal relationships bc I took ownership of handling a situation and decided to be an adult abt it...life goes on and the days don't stop!",
      "created_utc": 1723110130.0,
      "score": 1
    },
    {
      "id": "lh2iv46",
      "body": "thanks, i needed to hear this.",
      "created_utc": 1723099596.0,
      "score": 1
    },
    {
      "id": "lh2x2xz",
      "body": "sweetheart, thanks ",
      "created_utc": 1723108867.0,
      "score": 1
    },
    {
      "id": "lhe5yuv",
      "body": "Progress is still progress, you're correct. I'll just stay the course. This year will be much better, or I'll adjust my perspective more to reflect positivity. Thank you for the kind words.",
      "created_utc": 1723265745.0,
      "score": 1
    },
    {
      "id": "lhdgdmq",
      "body": "I definitely relate to the haunted house analogy… my life is a nightmare most of the time. I try my best to be stable but sometimes it just isn’t.",
      "created_utc": 1723254164.0,
      "score": 1
    },
    {
      "id": "lhjxjc6",
      "body": "Thank you! ❤️",
      "created_utc": 1723357859.0,
      "score": 1
    },
    {
      "id": "li4itmm",
      "body": "Absolutely! One step at a time. There might be days that are hard, but you can always wake up the next day and try again.",
      "created_utc": 1723664924.0,
      "score": 1
    },
    {
      "id": "lh72548",
      "body": "Thanks and i hope to wish you the strength to continue in your journey of mental health. Cheers",
      "created_utc": 1723161351.0,
      "score": 1
    },
    {
      "id": "lh2ujwl",
      "body": "Thanks . See you aren’t alone",
      "created_utc": 1723107193.0,
      "score": 1
    },
    {
      "id": "lh4s7mq",
      "body": "tbh, i feel like im only breathing and not living. It kinda feels like watching a bad tv series that you have to finish because you are already invested in it.",
      "created_utc": 1723135360.0,
      "score": 1
    },
    {
      "id": "lh1hpjk",
      "body": "It's not your fault at all. \n\nSometimes we feel like we messed up when in reality we are misunderstood, blamed, stigmatized etc. We don't always get the consideration and kindness we deserve because our world is built for people who don't have mental health issues. Same thing for some physical health issues too- lots of places provide terrible access for people in wheelchairs. The world isn't built for them. Is it their fault the world isn't built for them? No way. Same goes for mental health issues.",
      "created_utc": 1723081891.0,
      "score": 4
    },
    {
      "id": "lh2vjqi",
      "body": "Everyone is not traumatised. That's complete BS.",
      "created_utc": 1723107849.0,
      "score": 1
    },
    {
      "id": "lj5c02k",
      "body": "Nothing wrong with that! I used to be on the sliding scale at my clinic too. But then when I lost my job I was qualified for Medicaid and now it's free.",
      "created_utc": 1724207394.0,
      "score": 1
    },
    {
      "id": "lh1q1ep",
      "body": "It sounds like there has been some improvement then? \n\nAsking as a guy in his 30s struggling now, and as someone who hopes to see other people thrive!",
      "created_utc": 1723085125.0,
      "score": 1
    },
    {
      "id": "lh2wo7f",
      "body": "Hmm, good example. Thank you 🥹",
      "created_utc": 1723108598.0,
      "score": 2
    },
    {
      "id": "lh60cm4",
      "body": "I don’t know. Even birth is considered as trauma, maybe that’s why. But it leaves me thinking, what about the people who had happy childhood and healthy relationships with parents. I think that definitely makes difference. I lost my dad to cancer when I was 18, my mom has personality disorder. I feel bad when people say “everyone is damaged” because it triggers my conditioning as not doing enough.",
      "created_utc": 1723148687.0,
      "score": 1
    },
    {
      "id": "lh85j1o",
      "body": "I had a perfect childhood and life and I was suddenly struck down with anxiety and depression in my late 30s for no apparent reason",
      "created_utc": 1723177382.0,
      "score": 2
    },
    {
      "id": "lh8llmk",
      "body": "I see, so you never know. And sorry about your experience, wish you found support and helpful tools.",
      "created_utc": 1723186497.0,
      "score": 2
    },
    {
      "id": "lh8nyed",
      "body": "Thanks. Working on it. ECT and meds and therapy",
      "created_utc": 1723187997.0,
      "score": 2
    }
  ]
}