{
  "id": "1kjch4t",
  "title": "My girlfriend and friend keep saying I have adhd, but I don’t really see it?",
  "selftext": "",
  "created_utc": 1746889754.0,
  "score": 417,
  "num_comments": 107,
  "url": "https://i.redd.it/qe9r2pd40zze1.jpeg",
  "comments": [
    {
      "id": "mrlp3bw",
      "body": "i feel like you should go ask ur doctor instead of reddit",
      "created_utc": 1746891107.0,
      "score": 143
    },
    {
      "id": "mrlmlgz",
      "body": "friend, as a fellow adhd-er, i am often unable to get one task done at a time because i always run into another task i have to do in the middle of the first task.",
      "created_utc": 1746890286.0,
      "score": 404
    },
    {
      "id": "mrls7ps",
      "body": "I have ADHD and do this. If you feel like it’s something worth looking into, ask your doctor. My ADHD was undiagnosed for 19 years, which is really common for women who have it. I don’t know if this applies to you, but so much of my depression and anxiety were actually caused by the untreated ADHD.",
      "created_utc": 1746892116.0,
      "score": 60
    },
    {
      "id": "mrlul01",
      "body": "Had some people I lived with say this to me for autism/adhd, did the uk right to choose, absolutely aced both tests top marks!! \n\nFor some reason mum wasn’t as chuffed with my high test results :c",
      "created_utc": 1746892881.0,
      "score": 22
    },
    {
      "id": "mrmcf0s",
      "body": "All I know is that I’m not reading a wall of text without any punctuation",
      "created_utc": 1746898707.0,
      "score": 22
    },
    {
      "id": "mrm442v",
      "body": "Not necessarily. You might just be a bit scatter-minded. I'm the same way and more when I'm tired or stressed. It is what it is",
      "created_utc": 1746896030.0,
      "score": 13
    },
    {
      "id": "mrlvyy2",
      "body": "I think the question you should ask yourself is if this is a problem to you. Does it hinders you in living your life? Do you have other problems that makes it difficult for you to function daily? Interfere with job, school and tasks at home? Does things like these affect your emotions, sleep and relationships? \n\nAdhd does indeed get thrown around a lot, and a lot of people only see one symptom and says yeah that's adhd. It could be your friend just thought it reminded her of adhd without that you necessarily struggle with it. \n\nThings that look like symptoms of adhd is very normal, like forgetfulness, beging clumsy, explosive emotions, procrastination, sleep disturbances, restlessness etc. They can also be a part of other diagnoses.\n\nIf this worries you, I would go look at all the symptoms of adhd, and if a lot of them fits most of the time and you see that you struggle to live your life - then it could be good for you to see a professional. \nAnd if not, you have nothing to worry about. Everyone can do stuff like you described, it is just a normal part of being human.",
      "created_utc": 1746893343.0,
      "score": 6
    },
    {
      "id": "mrmmou1",
      "body": "As an AuDHDer with predominant ADHD, this is exactly how ADHD brains work and most NT people don't do it in the way you described except those I suspect to be neurodivergent.\n\nHowever you feel about it, positive or negative, I will say that knowing and having a \"label\" on it (despite some people saying that's a negative), it makes it way easier to find what works for helping you do better, accomplish more, etc. I had someone in my life scoff at me getting diagnosed because she doesn't like labels, and I told her it's like her breast cancer. Even if you know you have cancer, what type is it? What treatment is most appropriate? Some are genetic and some receptive to hormones. Throwing the wrong thing at it won't fix it if it's not the right treatment, and that's why I wasted years in the wrong therapy. I kept trying but didn't get out of it what I wanted. I was still \"broken.\"\n\nSo with you, I imagine this has caused issues in the past based on your glee at completing the tasks. You probably want to do better, but how do you know how to do better, to learn better skills, to find the right therapy, or to medicate if need be if you don't know what is up with your brain. Not being properly diagnosed, first with ADHD and then the next 20 years it took to be diagnosed with autism, took years of my life and threw it in the trash. I wish I'd known sooner why all the therapy I did wasn't effective (CBT isn't designed for ND brains), I wouldn't have wasted so much time and so many relationships trying to get it right, beating myself up... So I would look into getting an assessment if you can, bearing in mind not all therapists are equal, and those competent in assessing women, and especially autism and ND issues (like ADHD) in women, are hard to find. My own psychologist admitted I mask extremely well and it was tough even for her to pick it apart. ADHD hides autism symptoms, and that's why it took so long to get answers.\n\nTL;DR: You likely have ADHD, and that's totally okay. I suggest you get an assessment if you can. Some sites have self-assessment tools if it's not in the finances right now.",
      "created_utc": 1746902080.0,
      "score": 4
    },
    {
      "id": "mro09b6",
      "body": "Idk bruh, [you tell me.](https://www.instagram.com/reel/DAoS5Y8Pxj0/?utm_source=ig_web_copy_link)\n\n(Yes. The answer is yes. Head over to /r/adhd and have yourself evaluated)",
      "created_utc": 1746919777.0,
      "score": 5
    },
    {
      "id": "mrmku2e",
      "body": "Idk about adhd but that was a long run-on sentence",
      "created_utc": 1746901453.0,
      "score": 7
    },
    {
      "id": "mrlrveb",
      "body": "Get evaluated. It may help you out",
      "created_utc": 1746892006.0,
      "score": 4
    },
    {
      "id": "mrscge6",
      "body": "ADHD and a severe case of lack of punctuation",
      "created_utc": 1746987518.0,
      "score": 3
    },
    {
      "id": "mrmmlhn",
      "body": "As someone who got diagnosed with ADHD at 27 almost 2 years ago, this and your replies heavily imply ADHD symptoms with you developing coping mechanisms. You might not feel it yet but this might lead to severe depression and anxiety since compensating and masking takes a huge toll on one mentally. In the end it's up to you but I would suggest getting tested. I just don't want other ADHD patients, especially late diagnosed women, to suffer as much as I did by going undiagnosed for way too long.",
      "created_utc": 1746902050.0,
      "score": 4
    },
    {
      "id": "mrloiis",
      "body": "Questions ADHD but has a profile showing their wall of furbies and various hobbies. \n\nEmbrace it. 😂",
      "created_utc": 1746890919.0,
      "score": 6
    },
    {
      "id": "mrmz6kk",
      "body": "How would you approach your GP in the UK about potential adhd,? I'm seeing a lot of similarities to myself in these comments.",
      "created_utc": 1746906405.0,
      "score": 2
    },
    {
      "id": "mro2yib",
      "body": "Grocery shopping is a nightmare",
      "created_utc": 1746920780.0,
      "score": 2
    },
    {
      "id": "mrp1qi2",
      "body": "Everyone that responded has said what I was going to say already haha. But I will say that it’s worth possibly pursuing a diagnosis. Not saying you have ADHD, but finding out is nice because, at least for me and other people on this subreddit, you finally feel validated in your struggles. Like you’re expected to do things a certain way but when you can’t, it makes you feel awful. But by pursuing a diagnosis, you can figure out what things work for you and what don’t for your everyday life",
      "created_utc": 1746934801.0,
      "score": 2
    },
    {
      "id": "mrsb7tv",
      "body": "Uh the action is adhd, but so is the run on sentence lmao (I do this too)",
      "created_utc": 1746987116.0,
      "score": 2
    },
    {
      "id": "mrsw3te",
      "body": "\nIt seems to me that you might have some stigma around or aversion to having adhd? I just want to say that it can be really helpful to know how your brain works.\nAlso, if your girlfriend and friends are neurodivergent I don't know what else to tell you.\nDefinitely look into it. I'm AuDHD (Autism and ADHD, very common for them to coexist) and the experience you described is an everyday occurrence for me.",
      "created_utc": 1746994036.0,
      "score": 2
    },
    {
      "id": "mrlv7ya",
      "body": "So long as it doesn't get in the way of your life, don't worry about it. I see lots of people recommending you \"talk to a doctor\" which is fine if you think you need help, but if you feel like you're living your best life, don't worry about it. ADHD medications in my experience, don't necessarily improve the quality of life of those who get them.",
      "created_utc": 1746893093.0,
      "score": 1
    },
    {
      "id": "mrlwjcn",
      "body": "Some people have adhd for years and they don’t even know it",
      "created_utc": 1746893530.0,
      "score": 1
    },
    {
      "id": "mrn8wyl",
      "body": "It definetifly sounds like ADHD to me, but I only have ADD, so I'm not sure. If you have insurance for something like this or can afford it, just see a psychologist; they will tell you.",
      "created_utc": 1746909734.0,
      "score": 1
    },
    {
      "id": "mrombw8",
      "body": "You are not supposed to see it, you are supposed to feel it duh",
      "created_utc": 1746928372.0,
      "score": 1
    },
    {
      "id": "mrppj55",
      "body": "go to the doctor if you think you have adhd",
      "created_utc": 1746947424.0,
      "score": 1
    },
    {
      "id": "mrppqsc",
      "body": "Bestie I think you need to go to the doctor",
      "created_utc": 1746947551.0,
      "score": 1
    },
    {
      "id": "mrqdylz",
      "body": "What is so bad in haveing some adhd characteristics? Adhd is a spectrum not a stamp of being weird. \nIts just that your brain has some neurodiverse traits that are sometimes actually really useful, and sometimes distracting/ unhelpful. You lived your life with this until now, talking to a professional about it just makes you more aware and it can help to understand yourself and therfore struggle less in some ways.",
      "created_utc": 1746962547.0,
      "score": 1
    },
    {
      "id": "mrqof4u",
      "body": "ADHD side quests I think of them as",
      "created_utc": 1746967426.0,
      "score": 1
    },
    {
      "id": "mrrp6j7",
      "body": "Hey babes! Welcome to the club!",
      "created_utc": 1746980149.0,
      "score": 1
    },
    {
      "id": "mrs42b2",
      "body": "Probably do cheif",
      "created_utc": 1746984850.0,
      "score": 1
    },
    {
      "id": "mrsu410",
      "body": "No, that's executive function and carrying the mental load. Many people can't manage multiple things simultaneously. Adhd would be getting distracted from the first item by the second, never completing the second because of a third and so on.",
      "created_utc": 1746993381.0,
      "score": 1
    },
    {
      "id": "mss6azm",
      "body": "Tell them they can evaluate you when they become doctors",
      "created_utc": 1747484199.0,
      "score": 1
    },
    {
      "id": "mrlzio5",
      "body": "I don't think it's necessarily ADHD, which would be impossible to tell from a field of text. But you really need to start using commas and periods, punctuate your sentences. It seems ADHD because it all just runs together in one massive run on sentence.",
      "created_utc": 1746894518.0,
      "score": 1
    },
    {
      "id": "mrlr91j",
      "body": "ADHD for sure mate",
      "created_utc": 1746891803.0,
      "score": 0
    },
    {
      "id": "mrlnsof",
      "body": "Oh my 🤭 no shame honey. I'm pretty sure I'm undiagnosed ADHDer but I do this too!",
      "created_utc": 1746890683.0,
      "score": 0
    },
    {
      "id": "mrlwk0i",
      "body": "lmao yep!",
      "created_utc": 1746893536.0,
      "score": 0
    },
    {
      "id": "mrmp8a7",
      "body": "Me IRL 🤣",
      "created_utc": 1746902945.0,
      "score": 0
    },
    {
      "id": "mrlxvs2",
      "body": "Lol, a lot people those days goes to Dr. Reddit",
      "created_utc": 1746893974.0,
      "score": 40
    },
    {
      "id": "mrlr9ie",
      "body": "Idk how receptive he’d be to hearing “hey two people I know kind of think I have this condition that a bunch of teenagers convince themselves they have, can I waste resources looking into this?”",
      "created_utc": 1746891807.0,
      "score": -80
    },
    {
      "id": "mrlo06d",
      "body": "Isn’t it just common sense though? If I have extra tasks to do in the nearby area it’s easier to do them together while I’m in chore mode, rather than stopping and starting",
      "created_utc": 1746890751.0,
      "score": 132
    },
    {
      "id": "mrm8bse",
      "body": "Oh heck yeah, this ☝🏽 I remember things while doing other things, and start connecting the dots. I have inattentive type Adhd so one task can distract me from another but it leads to more multitasking often to make up for it.",
      "created_utc": 1746897391.0,
      "score": 3
    },
    {
      "id": "mrltfia",
      "body": "Oh maybe, I do have a LOT of anxiety in my life that I just started going to therapy for. Is it really that common for women to go under the radar as kids? From what I understood adhd is like autism where it’s most commonly diagnosed early in life because it’s so obvious most of the time",
      "created_utc": 1746892510.0,
      "score": 14
    },
    {
      "id": "mrmt5te",
      "body": "How did u finally get it diagnosed and treated? I’ve gone to doctors since I was in middle school. I’ve had many different therapists. I’ve never had a single one who suggested adhd. I do have diagnosed anxiety disorder. But what OP wrote fits me to a T this is exactly how life is for me.",
      "created_utc": 1746904302.0,
      "score": 1
    },
    {
      "id": "mrlwn65",
      "body": "Parents, man. They’re confusing lmao.",
      "created_utc": 1746893564.0,
      "score": 3
    },
    {
      "id": "mrm4d0o",
      "body": "Hey do you have any more info about the right to choose thing? \nSorry your mum wasn’t too happy, I hope you’re doing better now",
      "created_utc": 1746896110.0,
      "score": 1
    },
    {
      "id": "mrn68yj",
      "body": "real",
      "created_utc": 1746908828.0,
      "score": 4
    },
    {
      "id": "mrmdq1u",
      "body": "Thank you for sharing that",
      "created_utc": 1746899126.0,
      "score": -1
    },
    {
      "id": "mrt8jsg",
      "body": "Yeah no kidding. I thought I was having a stroke until I realized I was just reading a rant without punctuation",
      "created_utc": 1746998108.0,
      "score": 1
    },
    {
      "id": "mrm50tk",
      "body": "Oh I’m for sure scatterbrained, trying to get better with it by doing routines and checklists and stuff but man it’s hard",
      "created_utc": 1746896325.0,
      "score": 2
    },
    {
      "id": "mrmmysf",
      "body": "Yeahh, it was just a quick text to my gf while cooking so I wasn’t too bothered with punctuation. And then the message got loooong but it was too late to go back and correct",
      "created_utc": 1746902176.0,
      "score": 2
    },
    {
      "id": "mrqi2px",
      "body": "What does one have to do with the other?",
      "created_utc": 1746964572.0,
      "score": 0
    },
    {
      "id": "mrm5mnk",
      "body": "Wtf lol",
      "created_utc": 1746896522.0,
      "score": 0
    },
    {
      "id": "mrlue5r",
      "body": "“Hey two close people who know me deeply pointed out my behavior. I’d like to talk about that as their observations mean a lot to me.”\n\nFocus on the behavior, what you do, how you feel. It’s not a waste of time. \n\nAlso, ADHD can be over diagnosed but it’s also under diagnosed too.",
      "created_utc": 1746892820.0,
      "score": 40
    },
    {
      "id": "mrlsc63",
      "body": "It's not a waste of resources if you're using it with the right intentions. \n\nIf you're using said resources to try and understand yourself better, or to gain access to resources you may need (e.g. accommodations at school or work) then it's not a waste. \n\nIf you're just seeking a specific diagnosis and manipulating the results to gain said diagnosis, then it would be considered a 'waste'. Even then, the only thing being wasted would be your time and money, and it's your choice to use that how you please.",
      "created_utc": 1746892156.0,
      "score": 68
    },
    {
      "id": "mrm6qtu",
      "body": "Bruh how do you think people get diagnosed? By going to a doctor and getting assessed and tested. The doctors don't come to you and tell you that you have ADHD and need medicine. Literally tens of millions of people in the US live with undiagnosed mental illness - it's extremely easy to assume you're either neurotypical or don't need treatment. All you have to do is nothing at all. \n\nThere is no reason to not speak to a psychiatrist or other mental health professional - there's no \"wasting their time\" by doing their job and assessing you. That's what you SHOULD do.",
      "created_utc": 1746896882.0,
      "score": 19
    },
    {
      "id": "mrm1i1f",
      "body": "Then don’t say that. Say “Hi, I’m considering the possibility that I may have ADHD; could you test me for it please?” I mean, it’s literally what they’re paid to do.",
      "created_utc": 1746895176.0,
      "score": 11
    },
    {
      "id": "mrn0e70",
      "body": "That’s how lots of people get diagnosed though. It’s often the people around you who pick up on your behaviors and for an ADHD diagnosis it’s actually very important that the people around you also notice your behaviors.",
      "created_utc": 1746906827.0,
      "score": 2
    },
    {
      "id": "mrm1ba5",
      "body": "What i personally did. Tho only on the waiting list now. Was told my doc i wanted a adhd test coz \" I've had multiple people i know tell me i need to get tested. Especially now I've had a few changes in life and STRUGGLING to stay on top of everything. Though I don't think i need medication. I'd like to know if it's something I'm imagining or really just need help with proper ways to manage. \"\n\nPs. My doc asked me why I'm only looking into this in my 30s. And I could only answer that i didn't realize everyone didn't behave like this until recently. And when asked if im willing to wait a year on the list. I asked them if they think I'd be harder than the last 30 I've lived through. Then was given a simple test, and added to the list after that.",
      "created_utc": 1746895114.0,
      "score": 2
    },
    {
      "id": "mrm9kw5",
      "body": "If it helps I and many people that come to reddit are actually diagnosed. You can ask who is if you want to. People go to get check out so they can find out if they have it or not, that’s kinda how it works or no one would ever get diagnosed. Or end up like me, get diagnosed in your 30’s.",
      "created_utc": 1746897797.0,
      "score": 2
    },
    {
      "id": "mrloncn",
      "body": "not necessarily… a lot of people get one thing done at a time rather than doing several at once. \n\ni get really overwhelmed when i start one task, then remember another and another and get to a point where i can’t get anything done at all, so maybe that’s where it isn’t the same for you.",
      "created_utc": 1746890963.0,
      "score": 199
    },
    {
      "id": "mrm17ue",
      "body": "No, most people would recognise that other task, but complete the task they originally set out to do, before moving on to the next one.",
      "created_utc": 1746895084.0,
      "score": 17
    },
    {
      "id": "mrm0glu",
      "body": "Lmao.. no.. normal people can usually get through the first task all the way through before going to the next task and fully completing the next task.. one at a time.. and remembering all the things on the list.... we as adhders have trouble and usually only remember when we are walking by it lol",
      "created_utc": 1746894833.0,
      "score": 15
    },
    {
      "id": "mrm28ty",
      "body": "Yes- common sense for those of us with adhd 😄",
      "created_utc": 1746895420.0,
      "score": 10
    },
    {
      "id": "mrmfi5j",
      "body": "You did stop and start though. You were doing one thing then stopped doing that thing to do something else and forgot about the thing you were originally doing until you went downstairs and remembered and then went back up to do the original task.",
      "created_utc": 1746899698.0,
      "score": 3
    },
    {
      "id": "mro0cui",
      "body": "[Watch this](https://www.instagram.com/reel/DAoS5Y8Pxj0/?utm_source=ig_web_copy_link) lol",
      "created_utc": 1746919813.0,
      "score": 2
    },
    {
      "id": "mrpwryi",
      "body": "Yeah I mean I do the same. I try to do things at the same time so that I can have time for the other things I love to do",
      "created_utc": 1746951931.0,
      "score": 1
    },
    {
      "id": "mrrhud2",
      "body": "Yes, it's totally common sense to people with ADHD.",
      "created_utc": 1746977797.0,
      "score": 1
    },
    {
      "id": "mrlwyru",
      "body": "I was diagnosed in my late 20s. I wasn't hyperactive as a child but had a billion issues with attention, day dreaming, inability to start or finish projects, disorganization, etc. I also couldn't stand doing things wrong or being told I wasn't good enough so I developed massive anxiety to push myself into stress mode to get anything done, which developed into depression when that (shockingly) didn't work long term. I was so afraid of being difficult and a problem that I forced myself to get good grades, so no one thought I could have had a learning disability. I was never evaluated or diagnosed until I got to my 20s and realized I was literally killing myself to cope with the inability to focus, just so that I could work and function in life without feeling like a burden and failure.\n\nSo yes, girls aren't diagnosed as easily because we don't show the \"classic\" symptoms the way boys do, and we're conditioned by society to put ourselves and our needs last, so we develop coping mechanisms that are detrimental to our health just so we're not a problem to the people around us.",
      "created_utc": 1746893671.0,
      "score": 17
    },
    {
      "id": "mrlytp3",
      "body": "I got diagnosed as a woman with ADHD 6 months ago (at 25 yrs old). Before diagnosis, I was miserable, depressed, and barely able to feed myself. I found out 2 months ago I’m giving a TEDx talk. \n\nMy older brother also has ADHD and was diagnosed at 6 years old. He and I had near identical behavior patterns and interests as children but “girls don’t get ADHD” logic meant that I was just dumber than him, not also neurodivergent.\n\nI didn’t believe I had it despite my husband and several friends telling me they saw it. It took being hospitalized for SI and my therapist pointing it out to get evaluated. \n\nGet evaluated!!!!!!!!!!!",
      "created_utc": 1746894287.0,
      "score": 12
    },
    {
      "id": "mrm5e0y",
      "body": ">Is it really that common for women to go under the radar as kids? \n\nAbsolutely sooo common. Your post is textbook ADHD, and you've been just managing it your whole life because you had no other choice. \n\n35 and just got diagnosed last year and was like... omg I'm not just \"quirky\" it's literally how my brain works i found it to be suuuuch a relief.\n\nGood luck on this journey OP!",
      "created_utc": 1746896445.0,
      "score": 9
    },
    {
      "id": "mrm89jk",
      "body": "Very common to be missed in women and girls. Boys are mostly diagnosed in childhood but in adulthood the rate of ADHD is roughly equal between the sexes, suggesting girls are seriously under diagnosed. It's also under researched in females.\n\nWe're more likely to present as inattentive, or for the hyperactivity to be more in our thoughts rather than actions. The girl who's falling behind in class gets missed because she's quiet, but the boy gets diagnosed because he's loud and disruptive. The woman who masked her whole life because she has hundreds of coping mechanisms gets diagnosed after things fall apart due to menopause (dopamine levels are linked with oestrogen) or the pandemic (one reason for the surge in diagnosis). Many of us struggled and were diagnosed with depression/anxiety/BPD or have developed cPTSD, but the root cause was actually undiagnosed neurodivergance.\n\nAt least try to get screened if you can. In the UK we use the ASRS. Best I've scored in a test in years :)",
      "created_utc": 1746897371.0,
      "score": 8
    },
    {
      "id": "mrmm83o",
      "body": "A lot of things go undiagnosed/misdiagnosed in girls and women for the simple reason that we tend to present differently than boys/men. This goes for a wide variety of things forms ADHD and Autism to heart attacks, so much so that doctors used to say that boys were simply much more likely to have Autism than girls, even though we’re now realizing that statistic is false. The vast majority of research in history has been done with males being the default, without acknowledging that females just don’t present with the same symptoms OR are ignored even when having the same symptoms in favor of “female hysteria” or brushing things off as assuming you’re either pregnant or menstruating. Women and girls also tend to mask symptoms, both physical and mental symptoms, just to get through life. So yes, even now many girls and women continue to go undiagnosed for many different things including ADHD and Autism.",
      "created_utc": 1746901924.0,
      "score": 5
    },
    {
      "id": "mrmrb8v",
      "body": "ADHD and autism are most commonly diagnosed early in life for men. Most of the diagnostics are based on male presentation not female and women are also taught to mask better and more often. Just like doctors miss heart attack symptoms in women a lot because they are different. Almost our entire medical system is based on men.",
      "created_utc": 1746903659.0,
      "score": 3
    },
    {
      "id": "mrm03ko",
      "body": "You should be able to talk to your therapist about it! I know that mine gave me some kind of assessment/quiz to determine if I had it or not",
      "created_utc": 1746894711.0,
      "score": 2
    },
    {
      "id": "mrn7ayy",
      "body": "I’m very fuckin autistic, my family basically refuses to agree for whatever fuckin reason. I feel like it’s always been obvious, since I was a kid, and all my friends agree. But my family just doesn’t see it I guess (they’re also kinda weird and think autism = bad), so it’s not necessarily always obvious",
      "created_utc": 1746909188.0,
      "score": 2
    },
    {
      "id": "mrlx5rz",
      "body": "Truly man, don’t even live with them anymore, it’s only affecting me and for my benefit. Think their generation sees more stigma with it idekkk",
      "created_utc": 1746893736.0,
      "score": 2
    },
    {
      "id": "mrmfybe",
      "body": "thank you! I know a little bit what do you want to know?",
      "created_utc": 1746899842.0,
      "score": 2
    },
    {
      "id": "mrmaeje",
      "body": "Oh yeah I know. Also I loose stuff all the time. I've bought Bluetooth tags to put in my wallet, car keys, work keys etc. Because I'm great at loosing them. Also always try to put my car keys in my jacket, or else I leave without it even in winter.\n\nProbably not ADHD, because I don't have any problems focusing on a single task or impulse control but just being scatterbrained.\n\nBut it's like as soon as you mention having difficulties with focusing, everyone shouts ADHD.",
      "created_utc": 1746898061.0,
      "score": 6
    },
    {
      "id": "mrqraw2",
      "body": "They’re all traits of ADHD.",
      "created_utc": 1746968615.0,
      "score": 0
    },
    {
      "id": "mrlp6u2",
      "body": "M for me it’s like getting combo moves in a video game kind of. The energy it takes me to get started on something is sooo stupidly high it’s like I have to climb a wall in my head, but if I chain things together then I don’t get thrown back down the wall like if I do one thing, stop, have to start another thing",
      "created_utc": 1746891139.0,
      "score": 78
    },
    {
      "id": "mrmb0jo",
      "body": "Yes. I feel as if I’m in limbo and can’t do anything until the anxiety of not getting things done and everything I *need* to do gets overwhelming, then I’ll do everything at once.",
      "created_utc": 1746898257.0,
      "score": 5
    },
    {
      "id": "mrpua7j",
      "body": "Diagnosed ASD (used to be Asperger's), highly suspected of having ADHD as well. Yeah, this is totally me. I have to clean the rabbits' litter boxes ➡️ I have to water the plants ➡️ I have to pull weeds ➡️ I have to pick up after the dogs ➡️ I have to take out the trash, but before I take out the trash ↪️ I have to clean out the fridge ➡️ I have to wash the dishes ➡️ I have to do the laundry ➡️ I have to fold the laundry ➡️ I have to put away the laundry ➡️ I have to clean the floors ➡️ I have to clean the bathroom, wait I'm out of toilet cleaner ↪️ I have to go to the store ➡️ I have to get gas ➡️ I need an oil change/ my tires rotated ➡️ fuck I also need to take a shower.\n\nIt takes me a while to even get started on my chores because I think about ALL the chores I have to do and get completely stressed and overwhelmed and shut down and end up doom scrolling my phone instead of getting shit done, all the while getting more stressed about how much I have to do. I hate when I get \"stuck\" in chores limbo. It helps a bit if I force myself to just start one thing, and then when I'm in \"chores mode\" I'm able to keep going. Unfortunately \"chores mode\" does not include going into town, I have to get into \"go into town mode\" for that, and if I haven't showered then I REALLY don't want to go into town because I'm gross and don't want people to think I'm stinky all the time.",
      "created_utc": 1746950357.0,
      "score": 3
    },
    {
      "id": "mrm3wjw",
      "body": "I do usually try to make lists but I always either find more stuff I need to do that I didn’t list or I put way too much on the list and can’t get it all done in one day. I probably could get things done in one day but when I stop to do anything else it takes forever to get back on track",
      "created_utc": 1746895962.0,
      "score": 3
    },
    {
      "id": "mrmm0eg",
      "body": "That’s true, i don’t think I’m phrasing myself correctly. If I did the tasks one after the other instead of in the middle of eachother there’s usually a pause between them, and oftentimes that pause can completely crash my momentum. Like after putting the trash out, I had to do the dishes, but the pause between them lasted almost an hour. But if they’re nestled together it feels more like a flow than a checklist, once I finish one thing I can’t stop because I was in the middle of something else, kind of like Russian nesting dolls?",
      "created_utc": 1746901850.0,
      "score": 1
    },
    {
      "id": "mrmq8ra",
      "body": "From what I looked at it just seems like a way to get access to a specialist faster if you’re already on the road to a diagnosis? Like swapping to a private clinic. If you go that route, do you then have to stay with private instead of nhs for support?",
      "created_utc": 1746903293.0,
      "score": 1
    },
    {
      "id": "mrqrzj2",
      "body": "Hate to break it to you but being a collector of anything is not a trait of ADHD.",
      "created_utc": 1746968892.0,
      "score": 0
    },
    {
      "id": "mrlvhqi",
      "body": "Yeah, this 100% sounds like adhd coping to me.",
      "created_utc": 1746893183.0,
      "score": 180
    },
    {
      "id": "mrm8tlz",
      "body": "The need of a chore mode in general really and the energy you need suggests that it’s adhd also.",
      "created_utc": 1746897552.0,
      "score": 20
    },
    {
      "id": "mrm53cx",
      "body": "I'm not you and I'm not gonna speak for you, but I used to think of it like a superpower. Which is often a very helpful mindset, but is also delusional and conflicting with reality in many scenarios.\n\nWhen I was a kid, it meant that my days were jam-packed with a long sequence of me doing things that I felt I had to do before I could comfortably shut it off and play video games with my friends. \n\nIt was actually pretty awesome before adulthood - where you do not get to do what you want to do NEARLY as often. It became extremely difficult to find the time and energy to even think about the constantly-growing book of shit I need to get done, but can't do them when I feel like it, because preparing for work+working+driving home consumes 5am-5:30pm, I gotta clean up the house and litter boxes, I gotta cook dinner, I need to go grocery shopping, I gotta go to the county clerk's office for the newly required REAL ID, I gotta get an oil change, I need to get my suspension fixed etc...\n\nwhile simultaneously I have a partner to pay attention to, I gotta practice guitar, I gotta get some music recorded, I gotta get back to playing shows, I gotta make time for my friends, I gotta make time for myself, blah blah blah.\n\nI found that once I did not have enough time to, essentially, ADHD stim all day, it gets really exhausting to juggle all these thoughts and aspirations while being stuck in front of a computer - the list piles up and I simply don't have the time to knock out 10 things at once like I want to, and I don't wanna just do one thing, so I end up doing nothing. I wish I could just do one thing and be fine with that.",
      "created_utc": 1746896348.0,
      "score": 40
    },
    {
      "id": "mrmpzev",
      "body": "The energy to get started thing is also an adhd thing. It takes a lot more effort to start something when you have a depletion of dopamine. Dopamine is the thing that says start… literally it controls your executive function which tells you to execute an action. Taking advantage of your momentum is something neurotypical people do but they don’t rely on it to get things done. It’s just a bonus for them. Is it good sometimes to chain things… sure but often it’s more important to prioritize one task completely and then move on to the next. It means things get fully done rather than half done and then have to be focused on again just like you did. I don’t know how many times I’ve forgotten the first thing I was working on until it was a bad time or too late to do it. Prioritizing is important sometimes and the point is having the choice to do either or rather than NEEDING to to get things done.",
      "created_utc": 1746903204.0,
      "score": 14
    },
    {
      "id": "mrn1ezl",
      "body": "And that’s an ADHD coping mechanism. Lol",
      "created_utc": 1746907179.0,
      "score": 10
    },
    {
      "id": "mrmlout",
      "body": "I don't have adhd and totally feel the energy barrier, especially in my depression times, and I also cope by doing everything together. But for me that means doing one thing after the other without taking a break in between. The way you've done it would stress me because I need order in my mind 😅",
      "created_utc": 1746901742.0,
      "score": 4
    },
    {
      "id": "mro0hn9",
      "body": "That “climb a wall in my head” may be what’s referred to as the [“adhd wall of awful”](https://m.youtube.com/watch?v=Uo08uS904Rg)",
      "created_utc": 1746919861.0,
      "score": 2
    },
    {
      "id": "mrm95ig",
      "body": "Lmao... welcome to the club... I own every planner system.. I have written every list...etc.. that overwhelming feeling of not being able to get stuff done.... or to get back on track...adhd.. I'm so sorry.. BUT there are good things...\n\nWe tend to be more creative... we're compassionate.. more resilient.. when we are working on a task, we are able to hyper focus and get it done, and it's fine right and well... it's okay.. it's not the end of the world!",
      "created_utc": 1746897660.0,
      "score": 9
    },
    {
      "id": "mrmqm4y",
      "body": "The list thing is also very adhd it’s a coping mechanism to try and get us on track and often backfires by overwhelming us. I know there is a lot of stigma around mental health issues but accepting it really helped me to actually look at things objectively and eased my symptoms some. Medication helped even more but even when u don’t take it I’m more capable of reeling in my impulsive tendencies to task switch when something distracts me.",
      "created_utc": 1746903420.0,
      "score": 3
    },
    {
      "id": "mrmqu01",
      "body": "That is adhd coping in a nutshell we learn it without knowing we do just to help ourselves out. It’s just easier to manage when you go in with open eyes.",
      "created_utc": 1746903495.0,
      "score": 3
    },
    {
      "id": "mrr0z57",
      "body": "Hate to break it to you but one trait alone doesn’t qualify you for consideration of a diagnosis.",
      "created_utc": 1746972291.0,
      "score": 0
    },
    {
      "id": "mrmxbkd",
      "body": "bleh stop calling me out 😭",
      "created_utc": 1746905755.0,
      "score": 18
    },
    {
      "id": "mrmqq5q",
      "body": "Oh wow the dopamine thing makes a lot of sense, thank you for such a well written response. I’ve tried to explain to people before that I rarely get that feeling after doing a task of ‘wow good job me’, and looking it up I found about dopamine being the reward chemical, but I never knew it also was responsible for getting things started",
      "created_utc": 1746903458.0,
      "score": 8
    },
    {
      "id": "mrn2phm",
      "body": "I can’t believe I’m having my ass handed to me so fucking hard in this entire thread.",
      "created_utc": 1746907623.0,
      "score": 8
    },
    {
      "id": "mrmmfsw",
      "body": "For me that transition from the end of one thing to the start of another can completely crash my momentum and make me have to get over the energy barrier again, which suuuuucks because the way I do things stresses me out too lmao",
      "created_utc": 1746901996.0,
      "score": 3
    },
    {
      "id": "mrnczp1",
      "body": "And typically when there is something that really grasps one's full attention, the ability to hyper focus and go at an intense level is something that folks without that flavor of neurospicy can rarely hope to achieve.\n\nThere are silver linings.  But the downside is that the mundane things that we all have to do but nobody really gives much of a damn about are way harder.",
      "created_utc": 1746911127.0,
      "score": 2
    },
    {
      "id": "mrr4ygk",
      "body": "Agreed! So maybe don't try to diagnose strangers based off of two posts from their reddit profile.",
      "created_utc": 1746973652.0,
      "score": 1
    },
    {
      "id": "mrmy6zv",
      "body": "Yeah, it was a real eye opener for me. I also joined the r/adhdwomen subreddit and it helped so much to see that. In fact there were some studies with rats that had their dopamine blocked/depleted that without getting regular injections (this was a severe form) they would just starve rather than get up to go get food near them. It’s been a long time since I read the stuff on it but it was like…. Wow that is pretty intense.",
      "created_utc": 1746906059.0,
      "score": 5
    },
    {
      "id": "mrnz71h",
      "body": "You are learning something new about yourself lol 😂",
      "created_utc": 1746919378.0,
      "score": 6
    },
    {
      "id": "mrtbog1",
      "body": "Must be nice though, finally making sense of some things",
      "created_utc": 1746999160.0,
      "score": 2
    },
    {
      "id": "mrte408",
      "body": "Kind of? I started looking into it more and it’s starting to make a lot of sense why I’ve always felt so behind and different to others. Maybe I’m not just uniquely terrible at everything and actually there’s a reason for it? Definitely going to try seeking a professional opinion",
      "created_utc": 1746999999.0,
      "score": 1
    }
  ]
}