{
  "id": "1i7f8sr",
  "title": "My wife compared having sex with me to self-harm. I feel like there is no hope left for me.",
  "selftext": "My (34m) wife (38f) recently said something that has devastated me. We've been together for 12 years. We are each other's first and only relationship. On and off again for the last two or three years, we have been going to couples counselling because I often feel like she isn't attracted or interested in me, and sex is non-existent in our marriage. She was having a bad day a few weeks ago and came to me to ask for sex. Surprised, I asked, why now? She never wants sex. Her response made me want to vomit. She said since she can't cut or self-harm herself like I have to myself, she has sex with me instead. \n\nSHE COMPARED SEX WITH ME TO SELF-HARM!\n\nI understand that I am not a \"catch\" when it comes to relationships (or life). I have struggled with my self-esteem for a long time. As a child, I was diagnosed with the R-word, Autism/PDD, epilepsy, multiple learning disabilities, and a speech impairment. My diagnosis paperwork includes phrases like \"unlikely to succeed at life.\" I'm not the smart kind of autistic; I fail at school and struggle with the everyday things that come naturally and easily for everyone else. It feels overwhelming trying to conform to neurotypical standards. Consequently, I have struggled with Major Depression, Psychosis, and self-harm. Moreover, I am an ugly person. I have bad acne (possibly hidradenitis), I have crooked teeth, I am overweight, and I have enough scars from self-harm to frighten most people on sight.\n\nDespite all this, I am making a real effort to be better. I will be seeing a new dermatologist in June. I might be able to afford braces in a year or two. I exercise regularly, and I have so far lost between 50-60 lbs. in the last two years (not enough, but I am trying). I see a therapist 1-2 times a week. \n\nWhat's the use in ANY of this if I am so horrible of a person that sex with me is comparable to self-mutilation?! I feel like I might as well give up now. How will working out at the gym fix this? How will therapy fix this? I'm so bad that sex with me is the equivalent of self-harm. I feel like I might as well just unalive myself. It worked for my father and father-in-law. \n\nI can’t process there being anything more wrong with me than what there already is. \n\nI’m fat, ugly, r-word, and apparently the only woman to have had sex with me compares it to self-harm. WTF am I supposed to do about all this? ",
  "created_utc": 1737563703.0,
  "score": 387,
  "num_comments": 94,
  "url": "https://www.reddit.com/r/mentalhealth/comments/1i7f8sr/my_wife_compared_having_sex_with_me_to_selfharm_i/",
  "comments": [
    {
      "id": "m8k6uld",
      "body": "**Hello u/!** \n\nThank you for tagging this post with a content warning! This helps greatly!\nIt can prevent other users from potentially getting triggered and it gives us the chance to provide you with some resources regarding this topic.\nGood to know is that using this flair automatically marks your post as NSFW.\n\n*Your post may not show up directly on our subreddit, please be patient, it is most likely in queue to be manually reviewed by our team.*\n\n\n---\n\n**Are YOU currently in an ACTIVE crisis?**\n\n* If you are in a dire need to talk to someone right now? On this [website](https://findahelpline.com/i/iasp) you can find a hotlines for over 130 countries. Yours is most likely there too.\n* We know calling a hotline can be be scary, you might be afraid of the questions you might get, this [wiki post](https://www.reddit.com/r/SuicideWatch/wiki/hotline_faqs/) covers a lot of information regarding calling a hotline. \n* Please head over to r/suicidewatch and feel free to share you story there!\n* If you have active suicidal thoughts, you can also talk to the moderators of r/suicidewatch privately. You can message them [HERE](http://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch). At this moment our r/mentalhealth team does not offer this.\n\n---\n\n**Are YOU currently struggling with SUICIDAL THOUGHTS or do you feel like SELF HARM?**\n\n* Helpguide.org can give you [some information](https://www.helpguide.org/articles/suicide-prevention/are-you-feeling-suicidal.htm) on how to cope.\n* Know that you are not alone, many people have struggled with this. You can see some of their stories [here](https://www.youtube.com/watch?v=O_cCO7u5jYA&t=15s).\n* Try to [take a deep breath](https://www.youtube.com/watch?v=8vkYJf8DOsc), maybe [try some grounding exercises](https://www.youtube.com/watch?v=30VMIEmA114) or listen to some of your favorite music.\n* If you want to talk to someone, on this [website](https://findahelpline.com/i/iasp) you can find a hotlines/local resources for over 130 countries.\n\n\n---\n\n**Are you worried about someone else?**\n\n* Samaritans.org has a [page](https://www.samaritans.org/how-we-can-help/if-youre-worried-about-someone-else/) with different scenarios on what to do if someone isn't okay.\n* Check out [this post](https://www.reddit.com/r/SuicideWatch/wiki/talking_tips/) with talking tips. \n* Read through [this post](https://www.reddit.com/r/SWResources/comments/1c7nqf/worried_about_someone_who_may_be_suicidal_heres/) with info about how to assess risk.\n* There is also a [Reddit Help Page for what to do if you're worried about someone else](https://support.reddithelp.com/hc/en-us/articles/360043513931-What-do-I-do-if-someone-talks-about-seriously-hurting-themselves-or-is-considering-suicide)\n* Don't forget to think about yourself and your own mental health when you are trying to help someone.\n\n      \n---\n\n        \n**Take care and stay safe!**  \n\n*If you see any inappropriate posts or comments, please report them and we will deal with them accordingly.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
      "created_utc": 1737563703.0,
      "score": 1
    },
    {
      "id": "m8kdjug",
      "body": "Did you ask her what she meant by that?",
      "created_utc": 1737565525.0,
      "score": 165
    },
    {
      "id": "m8kc2rh",
      "body": "Speaking as someone who uses sex to self harm, this likely wasn’t a jab at you. At least for me, it’s not because it’s “bad” sex or something she doesn’t enjoy—just the fact that sex releases endorphins that make us feel good just like cutting does. It’s a way to regulate her emotions, it’s not saying sex with you is as bad as self harm. Please talk to her.",
      "created_utc": 1737565124.0,
      "score": 685
    },
    {
      "id": "m8k9x7y",
      "body": "Don't let her opinion affect the positive changes you're making in life. \n\nEven if it ends up that she doesn't stay with you, or you decide to leave, or it all works out, making healthy changes like you are is going to benefit you.",
      "created_utc": 1737564543.0,
      "score": 89
    },
    {
      "id": "m8km8fv",
      "body": "You write better that 95% of the people on here.",
      "created_utc": 1737567869.0,
      "score": 86
    },
    {
      "id": "m8kh4j3",
      "body": "Buddy, I wouldn't read too much into it. She didn't explain herself well at all, but I'm sure what she MEANT was that having sex releases endorphins in a crazy way and since she doesn't cut, that's her alternative.  There's nothing wrong with you. Therapy is amazing. Sounds like you could really benefit from some DBT. Going to the gym is admirable. You're doing things right so don't let a misunderstanding devastate your incredible self growth.",
      "created_utc": 1737566496.0,
      "score": 79
    },
    {
      "id": "m8ki6jb",
      "body": "If she has a history of self harm, one tactic they teach in therapy is action substitution. \n\n\nA generous interpretation of what she said is that she's looking for a healthier outlet to self harm through connection with you.\n\n\nHowever if she has a history of manipulative behavior and emotional nastiness she may have said it to hurt you. That doesn't make it true that sex with you is the same as self harm. It may be a control tactic because you're in couples therapy and she worries the relationship will end. \n\n\nIn either situation you are not the same as self harm. It's her mental health projecting things onto you, not anything inherent about you.",
      "created_utc": 1737566780.0,
      "score": 41
    },
    {
      "id": "m8kdlf1",
      "body": "That is understandably a really hurtful thing to hear from your wife, I'm really sorry she did that. Have you managed to talk about how this made you feel, with her? \n\nRegardless of your diagnoses, history and physical appearance you deserve a supportive, caring and loving partnership with someone. \n\n It sounds like you are making lots of healthy, positive changes in your life and reflecting on who you are. If this ends up being the end of your relationship, the work you have put into yourself thus far will undoubtedly help you in the future.",
      "created_utc": 1737565538.0,
      "score": 33
    },
    {
      "id": "m8kh2bj",
      "body": "If you went to better yourself, do it for you and only you.",
      "created_utc": 1737566480.0,
      "score": 13
    },
    {
      "id": "m8kwykj",
      "body": "As a couple of other people have mentioned, she admitted to you she uses sex for emotional regulation.  She did not properly develop the abilities to internally regulate her emotions and self-sooth.  \n\nWhat you should be upset about is her lack of empathy, and that she sees you as an object she can use (like a razorblade) to get her emotional needs met.",
      "created_utc": 1737570732.0,
      "score": 9
    },
    {
      "id": "m8kav2h",
      "body": "You deserve better. You are actively making an effort to be better and that's more than some people with less obstacles. You deserve love and appreciation currently.",
      "created_utc": 1737564796.0,
      "score": 23
    },
    {
      "id": "m8lb9ip",
      "body": "First of all, it is clear you are not compatible and are beating a dead horse. I’m sorry but you both need to live a little and build up your own self esteem and self worth before relying on another for it. Secondly, therapy. There is a a deeper issue at play here in regards to how you view yourself, specially the way you mentioned your father and father in law.",
      "created_utc": 1737574533.0,
      "score": 3
    },
    {
      "id": "m8le7gi",
      "body": "Omg man I'm so sorry that sounds horrible. This sounds like something you might need to discuss with her. Like did she mean in terms of them both being pleasurable activities, or in terms of them both being activities she dislikes",
      "created_utc": 1737575316.0,
      "score": 4
    },
    {
      "id": "m8llbdh",
      "body": "As a fat person 50-60 lbs weight loss over 2 years is incredible hard work. Pls don’t let her comments weigh you down",
      "created_utc": 1737577241.0,
      "score": 5
    },
    {
      "id": "m8n7awz",
      "body": "The answer isn't su*cide. You've come a long way. Trust me, please. I don't know you and you don't know me. You have no reason to pay any mind to what i'm about to say to you. But i will say it anyway because you deserve to know it.\n\nYou can deal with anything life throws at you. This isn't me regurgitating motivational poster bs. You are a living person. You deserve a chance, and no one can give you one but you. Look at what happens when you cut yourself some slack. You lost 60 lbs. Are you kidding me? Do you know how many people dream of being able to do half that? You're amazing! you should totally be proud of yourself. You've lived your whole life with these struggles, and you've fought through. You don't have to stop now. So what if you have crooked teeth? So what if you have autism? Is that enough to make you give up on life? does that mean you shouldn't keep on believing in yourself and trusting you deserve to fight to be happy?\n\nI don't know your wife and i don't know if she meant wrong by what she said. What i know is that we only give to other's what's inside of us. If she had a rough day, week, or month, maybe she just took it out on you. By saying a harmful thing (not that you deserve it, at all). Maybe it was just bad phrasing. Maybe she didn't mean it that way. You should talk to her. Either way, you can't value yourself according to what another person thinks you're worth. F*ck that. You're your own human being and you deserve love and respect even if someone close to you doesn't know it. Even if you don't know it.\n\nTake it a little bit easier. Try to understand yourself. That's what life is about. I know you've probably talked to many actual mental health professionals and i'm certainly not one. But if you really believe in this you'll realize that you're capable of doing amazing things. This is for real. You are alive. You can be happy. Alone or not. Your struggles don't have to limit you, let alone define you. The only person that has to accept you, and love you, is yourself. So please try. If you can't do it for yourself, do it in the name of the people that care, have cared, and will care for you. Don't pay no mind to the things that trouble you. Your life can be so much more than that if you decide it. Take care of yourself.",
      "created_utc": 1737594282.0,
      "score": 4
    },
    {
      "id": "m8laqh9",
      "body": "Im not going to tell you how to feel because it’s your situation and your feelings are 100% valid, but i think this could be a classic misunderstanding on both parts. I use to self-harm frequently and ive been a year clean. I’ve been in and out of hospitals for the past six years because of my MDD so ive met hundreds of patients that use stimulating actions (like sex) as a substitute for self harm. It’s like how drug addicts always look for a stronger drug once their current drug isn’t as stimulating anymore. I’ve had tons of psychiatrists and therapists say that “its also stimulating” so i know how annoying it is to not get an answer as to “how/why?”, but a couple of them did explain the ~science~ behind it; \nSelf harm activates the endogenous opioid system (a system that releases natural opioids that relieve pain and stress) and people who struggle with severe emotional distress/pain will do almost anything, if not everything, to relieve such pain. sex also does the same thing. Because of how stimulating sex is (usually when it’s good sex) it can become addicting just like self harm and drugs.\nSometimes i use it as a substitute with my boyfriend when i have urges to self harm! Of course theres “better” options like going to the gym or doing puzzles/games, but with sex theres also pleasure with the stress relief (with the right person of course). If this is what she means then she definitely worded it badly, but this is the reason as to why some people substitute self harm with other actions like sex. I strongly suggest that you should discuss this with your wife, as she is the only one who can truly tell you what she meant.\n\nEdit: typos.",
      "created_utc": 1737574392.0,
      "score": 6
    },
    {
      "id": "m8kksqb",
      "body": "Dude, ur better than that. Please don’t resort to ending urself. I hope u can find some way soon to bring up that self esteem.",
      "created_utc": 1737567485.0,
      "score": 3
    },
    {
      "id": "m8lc1vp",
      "body": "I usually don't do that as I think it is a bit weird, but checked ur profile and u are def not ugly. U Look quite good ngl\n\n\nMaybe sex is paintful for her? Or she's a victim of SA?",
      "created_utc": 1737574742.0,
      "score": 3
    },
    {
      "id": "m8md17d",
      "body": "This is honestly making me cry to read. Although I hope she meant it in the other ways mentioned here. You still obviously struggle greatly with your self esteem and I can relate to that it's really hard to get over. I'm sorry you're going through that .",
      "created_utc": 1737584785.0,
      "score": 3
    },
    {
      "id": "m8n137f",
      "body": "Hey man, I just want to say, you matter. Believe in yourself. Happiness comes from within and I know it’s hard.. I struggle too.. but be strong man💯 u got this",
      "created_utc": 1737592319.0,
      "score": 3
    },
    {
      "id": "m8opopj",
      "body": "Whether any of you believe sex is a release of some sorts or not, **I think we’re brutally skipping over the fact that OP feels incredibly hurt by his wife’s statement** of comparing sex with him to something horrendous like self harm. Never in my life have I heard such a statement of having sex with me being compared to self harm. \n\nI’d remind you all to check yourselves and what you’ve wrote immediately - we are in r/mentalhealth and many of these comments are not only incredibly invalidating to what OP has written, but especially insensitive around the subject of self harm, something OP clearly stated they struggle with. I am beyond horrified at a lot of these comments trying to normalize or validate OP’s wife’s statement.\n\nWhether OP’s wife meant this as an insult or was trying to just express how sex is a relief does not change how OP feels about the statement nor does it excuse the fact that such a statement was made.\n\nOP, I would encourage you to sit down and tell your wife how that comment made you feel. Healthy communication, like some have mentioned, is key to ensuring you get your feelings out and can fully understand the situation. If the intent was harmful, I would highly recommend getting out of your marriage - focus on your own growth and development. This comment is pretty insensitive and I do worry that your wife does not take your past into consideration/is a walking trigger for the very things you’re trying to work to improve upon. I wish you the best in this journey.",
      "created_utc": 1737615287.0,
      "score": 3
    },
    {
      "id": "m8phlis",
      "body": "I don't know what she feels\nI know what you expressed that YOU feel.\nI can only say that I'm sorry you are so deeply wounded by her words. ANYBODY would feel the same.\n\nHer intent is unimportant here.\n\nWhat IS important is YOUR self-care. Tending to YOUR feelings. Not about her words...about your feelings about yourself.\nNot everyone is born model-perfect with completely intact emotional regulation or Ivy League degrees. BUT, they can still possess self-respect, dignity, dare I say....self love.\nThe issue isn't fixing your teeth or weight. It's repairing your \"spirit\" -- interject whatever you view as your truest self, your life force, what makes you YOU.\nYour wife's words hurt bc they held a mirror to what YOU feel about YOURSELF. \nI don't want to \"therapize\" you. I'm quite certain you've had enough of that in your life. Yes, I know everybody makes it sound soooo easy. Nobody gets it.\n\nThis comes from someone with pretty serious mental health issues. With two decades on you. I've taken every pill, tried every therapy...none of it has been helpful. BUT I'M STILL IN THE FIGHT. Not to beat a \"disease.\" To accept & embrace my dis-ease. With myself. The world around me.\nIt's hard enough to deal with out own ever-changing, swirling emotions. Why take on another's?\nThis is your wife's issue to resolve.\nYou keep being the amazing person you are intended to be.\nYOU'RE AMAZING JUST THE WAY YOU ARE",
      "created_utc": 1737632085.0,
      "score": 2
    },
    {
      "id": "m8y60qv",
      "body": "Sorry for all the pain you're dealing with OP",
      "created_utc": 1737741508.0,
      "score": 2
    },
    {
      "id": "m8kbh3o",
      "body": "I’m so sorry this is happening to you. The only advice I can give you, is keep working on yourself. Don’t go backwards…I know it’s hard when you don’t have your own wife supporting you. But in the long run, only you can be the one to change and make your life better. You can’t count on other people to make you happy.",
      "created_utc": 1737564961.0,
      "score": 5
    },
    {
      "id": "m8kr1p8",
      "body": "Ask your wife why she married you. Did she give up on dating other men and “settled” with you? A close friend of mine literally did this and her husband is madly in love with her while she is repulsed by him. A few more girlfriends in my social circle resent their husbands for getting fat and ugly but will never admit it to them. I applaud you for going to the gym, therapy, and making an effort to improve your appearance. You’re doing great. Perhaps down the road you can find someone with a mutual attraction. Good luck OP",
      "created_utc": 1737569152.0,
      "score": 2
    },
    {
      "id": "m8nmsri",
      "body": "You’re misunderstanding. Sex & self harm both release endorphins.",
      "created_utc": 1737599317.0,
      "score": 1
    },
    {
      "id": "m8oma2u",
      "body": "Saying something like this to your partner is horribly emotionally abusive, no matter what her motivations behind it may be. And I say this as someone, who struggles with self harm myself, I would never say something like this to my partner and there is no way to legitimize this like people are trying to in the comments. Seems like your marriage really isn’t good. Maybe it’s time to go separate ways. This must have been really hurtful for you but try not to internalize it. You’re not a bad person or gross or anything like that and I‘m sure there is a lot of hope for a better life for you. I‘m sorry you have to go through that",
      "created_utc": 1737613483.0,
      "score": 1
    },
    {
      "id": "m8oslwc",
      "body": "That’s awful. I would try for some clarity regarding what she meant and let her know how is sounded to you/made you feel.",
      "created_utc": 1737616908.0,
      "score": 1
    },
    {
      "id": "m8ouxc0",
      "body": "Evaluate what relationships in your life make you happy and what don’t. Go from there. Also, you talk about yourself like you have no good qualities but from reading your post I can tell that isn’t true at all. You have lived 34 years being told you aren’t capable of succeeding and that you aren’t deserving of good things but you have persevered this long. Not everyone can do that, you have a lot of grit, determination, and dedication. Even if you aren’t where you want to be yet, you are well on your way. Just because others want to hold you to a neurotypical standard doesn’t mean that you should. There are people who will meet you where you are and support you while you meet your goals. Find those people by getting involved. You’ve made it this far! I hope you recognize all the incredible milestones you have met on your way to your goals. They are worth celebrating. You should be proud of yourself for getting through all you’ve been through. Write a list of things you like about yourself and try and treat yourself how you treat others. I know it might be miserable for a while longer but pick yourself up and keep going. It’s worth it, you have to trust that.",
      "created_utc": 1737618267.0,
      "score": 1
    },
    {
      "id": "m8oy1pt",
      "body": "Did you have any deeper conversation with her about that? \n\nFor me, SH was a way to take control, a way to FEEL something. Not something I did just because I hated myself. Sex with you can ABSOLUTELY be about those things, without it being about her putting herself through pain.\n\nYou need to TALK about this.",
      "created_utc": 1737620137.0,
      "score": 1
    },
    {
      "id": "m8p47wz",
      "body": "Ask for clarification on what she meant by that. It may just be a poorly communicated thought that wasn't offensive in her head.\n\nIf there _was_ malice behind it, then tbh I'd be looking to leave. Especially if you have no kids to complicate a split. Your partner should want to improve things and work with you on stuff. They shouldn't want to bring you down. If she said that just to neuter your self esteem, then she shouldn't be allowed close enough to hurt you imo.\n\nCongrats on the self-improvement, btw!! That's some really impressive weight loss. And improving your dental and derm health is always a good idea!!\n\n>I’m fat, ugly, r-word, and apparently the only woman to have had sex with me compares it to self-harm. WTF am I supposed to do about all this? \n\nIt's okay to entertain these thoughts sometimes, but you should resist them taking centre stage. I'm 25M, and AuDHD. I can't deny the privilege I have - I can hold down a job (barely, and only because of some real luck with amazing managers, but I can) and the ADHD helps somewhat manage the autism (though I'm really struggling rn since I'm on ADHD meds, so I'm experiencing unhindered autism for the first time in my life). Point is, I have a lot of privilege. But I hope this advice is still somewhat actionable: try to actively think nicely about yourself when you get negative thoughts like that. It feels really stupid at first, but over time it allowed me to damn-near mute that self-hating voice inside me. Actively challenging the thoughts I have has really helped me over the years",
      "created_utc": 1737624047.0,
      "score": 1
    },
    {
      "id": "m8qivuz",
      "body": "It sounds like you’re making a lot of wonderful strides to take care of yourself. Don’t let her comment get you down, I’m sure it was a misunderstanding. And if it wasn’t then you can do better than that. You deserve to be cared for, loved, treated with respect, etc. I hope you’re doing alright, don’t let what happened stop you from moving forward!",
      "created_utc": 1737645942.0,
      "score": 1
    },
    {
      "id": "m8qy2k1",
      "body": "Dude… did you just read what you typed? Your grammar is impeccable! Your spelling and apostrophes are where they need to be. I wouldn’t say you’re struggling with life! The fact that you can communicate effectively through typing is 👍🏼\nIf you have self-esteem issues, then focus on what you’re good at! Acne is normal, the majority of us has had them and I still get it from time to time too and I am in my 30s. \nThat’s a weird thing for your wife to say… but what does she mean by that? If she meant it in a way as a joke, then I understand how it could come off as hurtful! But if she meant some disrespect behind it, then maybe you and her need to talk about boundaries and why she won’t get what she wants by speaking to you in a demeaning manner. \nKeep going to the gym, keep going to therapy, keep trying to make friends, and keep progressing! You’ve gone to the gym, you’ve seen your progress! So you know that more progress is yet to come. This may sound cheesy but work to where you want to be, but you didn’t need me to tell you that, you already commenced that all on your own, by going to the gym, going to the therapist, and trying to work things out with your wife… practice self-compassion, know that you’re human and have limitations, and if in the end it turns out that no one loves you in this world, that you, yourself, have yourself to love!",
      "created_utc": 1737650265.0,
      "score": 1
    },
    {
      "id": "m8qyclq",
      "body": "Hey. I haven’t been through most of this be sure I am young. I’m a teenager. However, when I was younger I went through some terrible things too and I have been diagnosed with similar issues to you. But I can say is a lot of what people think is ugly is a. Subjective this is not my main point but it is a big part of it tbh. What I find attractive is very different to my best friends and were very similar in every other way. I’m sure there are people out there who will find you attractive. \nThat being said bettering yourself is a really good part of starting to see improvements in yourself it will change things for you. It has for me in recovery. But getting healthier and getting braces are really good steps in improving your life. You will feel better physically and hopefully 🤞 mentally too. My body overall is about 45-50% scarred. But I have many, many people in my life who love me all the same, I am just another person and they see that. You are another person too and some will see that. You seem like a strong and nice person so I’m sure some will see that. Things could already be starting to look up for you buddy. I really do wish you the best 🤍",
      "created_utc": 1737650341.0,
      "score": 1
    },
    {
      "id": "m8r14r3",
      "body": "I can assure yiu that there is absaloutly nothing wrong with you.....yiur wife on the other hand is a different story. Don't be around people who want to bury you. I would address's this very firmly. Communicate ur feelings with her. If she ain't for listeing then leave her. No one is worth ur own health all round. Take care of urself and know your own worth. Wish you all the best. Much love",
      "created_utc": 1737651090.0,
      "score": 1
    },
    {
      "id": "m8t3a3c",
      "body": "id just like to say sorry for what i said before 👍",
      "created_utc": 1737671396.0,
      "score": 1
    },
    {
      "id": "m92atq1",
      "body": "Omg extremely sad to hear your struggling through this. But she probably just uses sex as a torture mechanic for herself because of her childhood sex abuse. It’s not about you. I found your post specifically from googling my own traumas so maybe it’s a similar thing. You’re the best thing she has but she’s also struggling and hers isn’t just physical but also sexual. Idk I would show her this post maybe if you can… sending ya both love :( ",
      "created_utc": 1737794882.0,
      "score": 1
    },
    {
      "id": "m95jsup",
      "body": "Please don't kill yourself",
      "created_utc": 1737838491.0,
      "score": 1
    },
    {
      "id": "m9mat89",
      "body": "you both deserve to be loved and love! youre awesome for doing all the work you do on yourself and for the relationship. if you have the capacites, i can recommend learning more about non violent communication by rosenberg (there a lot for free on spotify) it can help a lot with listening (and truly hear the needs of the other person, instead of taking what they said as an attack) and also with voicing your needs and how they can be met. a wonderful tool to make life more wonderful!",
      "created_utc": 1738063300.0,
      "score": 1
    },
    {
      "id": "mfk4fbk",
      "body": "Keep on working out. You’ll get to a place where you like yourself :]",
      "created_utc": 1740892072.0,
      "score": 1
    },
    {
      "id": "m8kze0r",
      "body": "god damn dude . move it along . don’t wait for someone who is that cruel . you don’t deserve it",
      "created_utc": 1737571374.0,
      "score": 1
    },
    {
      "id": "m8l2btu",
      "body": "Things sound pretty good man. I don't think you're reading this correctly.",
      "created_utc": 1737572147.0,
      "score": 1
    },
    {
      "id": "m8mds2w",
      "body": "You leave. You leave and you live for you, now. Because you deserve better than her.",
      "created_utc": 1737585008.0,
      "score": 1
    },
    {
      "id": "m8krjgl",
      "body": "i'd bring it up in counselling in how it affected you honestly, its a safe place to kind of talk about those sort of things.\n\n\nand honestly, your wife sounds kinda lame. staying with someone who doesnt do anything for you, nor desire you, thats not how you better your life. keep continuing doing good for yourself, i'd honestly talk to her about having more sex, to find the real reason she doesnt like it. intimacy is important, but is there anyway she possibly isnt straight? i dont know why but i just feel like there's something here that she's not owning up to and thats one reason why she may self harm in the first place.",
      "created_utc": 1737569285.0,
      "score": 1
    },
    {
      "id": "m8lemcd",
      "body": "Hi i think it's a good thing she have sex with you. She just worded it wrong. And I think you are not dumb or anything. You are working to improve yourself and I think that is admirable! And keep doing it. It's not easy but it is worth it!",
      "created_utc": 1737575426.0,
      "score": 1
    },
    {
      "id": "m8llolx",
      "body": "Self harm is an outlet, just like cigarettes, alcohol or , for some, sex. Since I quit smoking I’ve been having more sex. It’s dopamine. It’s releasing energy. It’s an outlet. Do not read too much into this. Don’t feel bad.",
      "created_utc": 1737577340.0,
      "score": 1
    },
    {
      "id": "m8lltzd",
      "body": "I don't think that's what she meant.\n\nyou just think that because of your low self esteem.\n\nyou came a long way into improving yourself and you're going much further as time goes by. it will get better",
      "created_utc": 1737577381.0,
      "score": 1
    },
    {
      "id": "m8m3nu3",
      "body": "Please no one should listen that, It was a horrible coment you're right to feel Hurt and sad about it. Um Sorry that she was such a bitch to you",
      "created_utc": 1737582129.0,
      "score": 1
    },
    {
      "id": "m8m43w5",
      "body": "I wouldn't take it personally, like previous comments, she probably just associates sex with the same endorphins self harm causes for her. Doesn't mean you're bad in bed, probably means you're better than you assume. \n\nShe has a lot of stuff to work through it sounds like, does she go to therapy?",
      "created_utc": 1737582249.0,
      "score": 1
    },
    {
      "id": "m8mct0g",
      "body": "Yeah, I'm sorry but this doesn't seem to be about you. Your wife needs emotional release, and instead of the self-harm route, she tried to go a route for emotional/physical release that maybe has helped in the past, and is unequivocally healthier than self-harming...and does she need a reason to want to have sex? Do you always have only the best reasons? Or do you sometimes just want to get off? What is \"the right\" reason for her to want to have sex with you?\n\nWhat did you say to her when she told you this? And how did she explain it when you asked her what she meant? You spiraling about this probably won't make either of you feel better here.",
      "created_utc": 1737584716.0,
      "score": 1
    },
    {
      "id": "m8mn7ik",
      "body": "I just want to point out that you've been improving your life around the same time she started to be not attracted to you. Maybe she's got some kind of jealousy thing or she's angry that you are doing better and maybe she perceives that she's not doing better. \n\nLook, you seem like a good guy. I don't care what you have going on with you. You are lovable. There's somebody out there for you if this doesn't work out and it sounds like it's not. And from personal experience, I can tell you that being alone is such a brother fresh air after being in a bad relationship. I would much rather spend the rest of my life alone than in a bad relationship. I didn't get married till I'm 40. And I was fine with that. I would have been fun to be single longer to be honest.",
      "created_utc": 1737587962.0,
      "score": 1
    },
    {
      "id": "m8og428",
      "body": "Yeah that doesn’t sound good to me. I’m sorry man",
      "created_utc": 1737610484.0,
      "score": 1
    },
    {
      "id": "m8ktn6g",
      "body": "You two need to communicate better. You're projecting your insecurities onto her. She wanted to have sex for the emotional release, I'm assuming, but if she told you it's because you're ugly, it's time to be single.",
      "created_utc": 1737569851.0,
      "score": 0
    },
    {
      "id": "m8krohv",
      "body": "Been there , done that. Leave my brother. There's nothing left here for you. Sorry to say it.",
      "created_utc": 1737569323.0,
      "score": 0
    },
    {
      "id": "m8kj38v",
      "body": "Wow, that must be a hard pill to swallow my man, just don't let her get in your head.",
      "created_utc": 1737567024.0,
      "score": 0
    },
    {
      "id": "m8khs3g",
      "body": "[removed]",
      "created_utc": 1737566672.0,
      "score": -6
    },
    {
      "id": "m8lhwdj",
      "body": "Usually, when a woman says this, there is more than sex behind it. How is the relationship otherwise, because usually, something like this, comes from abuse.",
      "created_utc": 1737576303.0,
      "score": 0
    },
    {
      "id": "m8mc25b",
      "body": "I looked at your post history. I feel like it would've been relevant to mention that your wife is asexual. You also said in that same post that she seemed to use sex as a coping mechanism for the stress of life. I think that kind of clears up why she said that. I'm not saying your feelings of being hurt aren't valid but this post makes it seem like you're not giving the whole story.\nAlso you're not any of those negative things you said about yourself. You're a human being. Everyone has different struggles in life. Yours don't make you bad.",
      "created_utc": 1737584494.0,
      "score": 0
    },
    {
      "id": "m8o5kpr",
      "body": "Self-harm = release \n\nSex = release\n\nDon't take it that way. Better yet figure out why she is self-harming",
      "created_utc": 1737605985.0,
      "score": 0
    },
    {
      "id": "m8l2xke",
      "body": "You have to live her and cut all contact. You don’t try to bring down people you love. She will destroy you if you stay with her. You will become a people pleaser for her and she will hate you for that. You might even start to hate yourself. Get her out of your life asap. She meant everything to word of that",
      "created_utc": 1737572306.0,
      "score": -3
    },
    {
      "id": "m8ly0p4",
      "body": "People who self harm, often times we’re taught to seek out other stimuli that is maybe comparable, sensation aside, a lot of times, not for everyone, but a lot of times it boils down to someone needing to blow off steam, so perhaps you could consider what she said as her compelling you to help her blow off steam and help her let those bad feelings out in a more healthy manner, she’s reaching out to you for help.",
      "created_utc": 1737580632.0,
      "score": 0
    },
    {
      "id": "m8mhs18",
      "body": "Maybe she didn't mean it like that. Maybe she meant instead of doing that, maybe sex is the better option?",
      "created_utc": 1737586232.0,
      "score": 0
    },
    {
      "id": "m8sjfw4",
      "body": "Therapy. Now.",
      "created_utc": 1737665930.0,
      "score": 0
    },
    {
      "id": "m8kf60z",
      "body": "I'm sorry that you're not appreciated in your marriage. If I were you, I would definitely be considering divorce. Youre improving and she isn't so...find someone who wants to grow with you.",
      "created_utc": 1737565966.0,
      "score": -7
    },
    {
      "id": "m8la7is",
      "body": "She was having a bad day.  Women say stupid things.  Men do too.",
      "created_utc": 1737574250.0,
      "score": -1
    },
    {
      "id": "m8lo5gk",
      "body": "Start fucking medium class hookers and she will charge her mind.  You'll also up your testosterone a lot.",
      "created_utc": 1737578009.0,
      "score": -3
    },
    {
      "id": "m8ke96d",
      "body": "[removed]",
      "created_utc": 1737565719.0,
      "score": -10
    },
    {
      "id": "m8kfqcp",
      "body": "This prayer helps me with resentments,  bitterness and anger, especially towards those I love.\n  “Lord God, when we are assaulted by the troubles of life, and the deep waters of anger threaten to overwhelm us, do not let us sink. In your great compassion, hear us and help us. Deliver us from anger’s power over us. Lead us out of bitter silence and hurtful words so that we may speak the truth in love. Heal every heart set in vengeance, and show us the way to honesty and reconciliation” Amen. 🙏🏽",
      "created_utc": 1737566119.0,
      "score": -10
    },
    {
      "id": "m8log6w",
      "body": "Yeah, I think op misunderstood her a bit. Sex is a way to find relaxation and relief from everyday struggles. So is self harm. I don't find it that weird to compare them.",
      "created_utc": 1737578089.0,
      "score": 89
    },
    {
      "id": "m8kf7ql",
      "body": "This is the answer. Sex is a way of emotional release as much as it is a way to connect.",
      "created_utc": 1737565980.0,
      "score": 247
    },
    {
      "id": "m8kq09p",
      "body": "[deleted]",
      "created_utc": 1737568870.0,
      "score": 99
    },
    {
      "id": "m8m3cph",
      "body": "As someone who also uses sex as a form of self harm. This is very likely what your wife meant, OP. She is using sex as a way to cope",
      "created_utc": 1737582046.0,
      "score": 53
    },
    {
      "id": "m8r8mr1",
      "body": "I can see where you’re coming from, and I appreciate your perspective, but I have to disagree here. While it might not have been intended as a jab, the way she phrased it-comparing sex with her husband to self-harm-was incredibly hurtful and inconsiderate of his feelings.\n\nEven if her intention wasn’t to criticize him or their relationship, her words clearly struck a nerve and left him feeling devalued and devastated. Emotional regulation is complex, but that doesn’t justify framing such a vulnerable and intimate act in a way that deeply wounds her partner.\n\nShe has every right to express her struggles, but it’s equally important to communicate with care and consider the impact words can have on someone who’s already trying so hard to heal and improve. This is a conversation they need to have, but one where she also needs to take responsibility for how her words may have unintentionally hurt him.",
      "created_utc": 1737653156.0,
      "score": 7
    },
    {
      "id": "m8kssqa",
      "body": "This is the answer.",
      "created_utc": 1737569623.0,
      "score": 8
    },
    {
      "id": "m8lisg8",
      "body": "Yep this is probably what she meant",
      "created_utc": 1737576548.0,
      "score": 5
    },
    {
      "id": "m8pl599",
      "body": "Thats what I think too! Very intelligent!",
      "created_utc": 1737633853.0,
      "score": 7
    },
    {
      "id": "m8q48sa",
      "body": "\\*\\*Need to break this into shorter blocks since Reddit won't let me comment it\\*\\*\\*\n\nTHANK YOU! \n\nMy wife sucks at communication and expressing how she feels. However, she isn't malicious, and I don't believe her intent was harmful. She's extremely remorseful about what she said and how it has tanked my self-esteem. \n\nNonetheless, her choice of words devastated me in so many ways, not all of which I described in detail in my OP (I was venting, not meaning to write anything comprehensive).",
      "created_utc": 1737641330.0,
      "score": 1
    },
    {
      "id": "m8ospfy",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1737616965.0,
      "score": 2
    },
    {
      "id": "m8qtjad",
      "body": "Please be respectful, kind, and supportive. Do not insult, provoke, harass, or act disrespectfully; racist, discriminatory, or otherwise unsavory language is also not tolerated. Please ensure that your post or comment supports the person you are responding to and does not discourage or harm them. Please follow Reddiquette at all times.\n\nIf you would like to chat with the moderators, send us a [Modmail]( https://www.reddit.com/message/compose?to=/r/mentalhealth).",
      "created_utc": 1737649008.0,
      "score": 1
    },
    {
      "id": "m8lq7d2",
      "body": "Learned in therapy, literally SO MUCH internal heartache and anxiety can be prevented by just pausing a conversation and going \"what do you mean by that?\" It's corrected so many of my potential spirals.",
      "created_utc": 1737578557.0,
      "score": 20
    },
    {
      "id": "m8lqeh1",
      "body": "I think people are being really kind and sensitive to point out the technicalities behind what self harm typically means to people, but the truth of the matter is, is that we don't know what she actually meant by that comment and it absolutely could have been said with negative intent. \n\nTrying to give someone a pass for making a comment like this just because of the subject matter isn't really a good bit of advice, imo. He needs to sit down with her and ask her personally what she meant by that statement. If she meant it as in, \"I hate having sex with you so much that I want to use it as a way to punish myself,\" and not, \"I need a quick chemical adjustment,\" then OPs first step towards his own recovery will be to consider separation, even if just temporarily, from his wife. Especially considering their therapy does not seem to have improved their relationship. \n\nAlso, people are failing to realize that this comment, no matter how it technically could have been defined, was a jab at him engaging in self-harm, himself. She didn't need to include the, \"like you do,\" but she did. She intended to draw attention to his own actions with this statement. He needs to have a conversation with her, and ask her why.",
      "created_utc": 1737578609.0,
      "score": 55
    },
    {
      "id": "m8kz453",
      "body": "The way she worded it was awful and extremely hurtful...",
      "created_utc": 1737571302.0,
      "score": 107
    },
    {
      "id": "m8q4baj",
      "body": "I have struggled with self-harm myself, and I have for more than 20 years. A lot of people commenting didn't seem to read that part of me struggling with self-harm. I know what the \"release\" feels like, but I also know how damaging it is. I currently take prescription steroids to help me heal from self-harm injuries. \n\nI have struggled with my body image and weight for many years. When I experienced Psychosis, I developed an ED and was prescribed half a dozen medications, and I gained a lot of weight incredibly fast. Combined with my crooked teeth, bad acne, and self-harm scars, I feel extremely insecure about my body and how ugly I am. Add to this all my mental and developmental disabilities, such as Autism, PDD, a speech impairment, etc., and I generally feel inferior and broken. \n\nI've struggled with the trauma of repeated childhood sexual assault for most of my life. This makes sex a challenging and complicated subject for me. I am incredibly hypervigilant and easily triggered by what some might call \"normal\" behaviour, such as being attracted to someone, experiencing arousal, etc. I've always feared that inside of me, a rapist is waiting and ready to hurt someone, and I need to savagely kill that rapist inside of me before he hurts someone else. I realize this might sound incredibly ridiculous to a Redditor, but I'm unable to distinguish easily between \"harmful\" sex and \"healthy\" sexual behaviour. The fact is, I have had sex with two people in my life: my dad and my wife. It has been a long and painful therapeutic journey to heal my sexual trauma. \n\nWe have struggled with sex and intimacy in our relationship. When we first started couples counselling, it seemed like she never wanted sex or intimacy with me unless she was upset. If I ask for sex, I will indeed be rejected 100%. I feel like I don't exist until something is wrong or upsetting her. Combined with the above sexual trauma, this makes me feel on edge when she is interested in me because it is usually the harbinger of something wrong. Cuddles? = Something Wrong. Hug? = Something Wrong. She usually won't do these things unless she is upset about something. This is why I asked why she propositioned me for sex. She will most certainly reject me if I ask for sex, so a random request for sex from her raised a flag in my mind, like, \"Uh, oh! Something must be *really* wrong now!\"",
      "created_utc": 1737641353.0,
      "score": 1
    },
    {
      "id": "m8ltx9f",
      "body": "I agree with you on everything except I'm definitely not giving the girlfriend a pass. I'm giving her the benefit of the doubt which everyone should do in a relationship. This is a learning opportunity for OP to seek clarity instead of spiraling. The \"why\" would follow the \"what do you mean by that?\"\n\nEditing to say - obviously only give your partner the benefit of the doubt if they do not have a history of being manipulative or purposefully hurtful.",
      "created_utc": 1737579541.0,
      "score": 36
    },
    {
      "id": "m8q4c98",
      "body": "Her comment hit all four of these significant issues in my life like a missile. \n\nI know self-harm is a release, but I also have first-hand experience of the damage it can cause. \n\nSo, when I already feel fat, ugly, and insecure about my body and generally disabled, broken, and inferior, how am I supposed to handle my wife comparing sex with me, which involves my fat and ugly body, to cutting herself? How am I supposed to feel body-positive or neutral when my SO is comparing sex with me to cutting herself? \n\nSo, when I am still trying to heal sexual trauma, how am I supposed to handle my wife comparing sex with me to self-harm? I have had sex with two people: my DAD when I was CHILD, and then my WIFE, who compared it to SELF-HARM. Does this mean all sex is inherently evil? Am I not capable of having healthy sex? Is all sex some form of punishment? How am I supposed to heal sexual trauma when all sex is trauma? \n\nThis maybe wouldn't feel so bad if my wife also had sex for positive reasons, like she loves me or is attracted to me. A one-off: I like sex, and I feel bad right now; ergo, sex will help me feel better is fine. But she ONLY wants sex with me when she is upset. She ONLY wants sex when she is in a self-harm mood. \n\nI am less concerned with deciphering my wife's intent in making that remark—she is not malicious, so I am not worried about that—than knowing how to live with myself without that remark replaying in my head 1000 times a day and haunting me forever. I had an acne break out on my face a few days ago. I looked in the mirror angrily and thought, \"Yup, this is why sex with you is self-harm, you ugly POS!\" Last night, I told my therapist that maybe a fat, ugly, disabled loser like myself isn't supposed to want or have sex since the only people ever interested in having sex with me are a parent and a woman who wants to hurt herself. \n\nAgain, my wife isn't malicious, but it feels like that remark, malicious or stupidly insensitive, will haunt me for a long time, and I don't know how to deal with that.",
      "created_utc": 1737641363.0,
      "score": 1
    },
    {
      "id": "m8mcmca",
      "body": "I agree I wasn't necessarily and specifically saying YOU were giving her a pass but many people are in this comment section. Regardless of what that statement technically means, there isn't a person here who wouldn't personally attest to the fact that it would hurt them too if their partner said that to them in the same situation. Then you have to ask yourself, \"why would that bother me?\" Because the person saying it knows it's a hurtful thing to say, regardless of what it meant. Just knowing that it's a shocking statement, and choosing to answer with that kind of insensitivity, in itself would be hurtful to most people to have to hear. There is probably no situation where that kind of comment wouldn't offend or hurt the other person involved, no matter how it was meant. It hurts them to hear for their partner, and if they also self harm/ed, it hurts them for them. \n\n\nPoint is, is that instead of propositioning him for sex and then following up the why with that comment, she should have sat him down and discussed how she was feeling with him. What if he never asked why? Would she have still found a way to bring it up or mention it to him? Obviously, it was a discussion she wanted to have, but didn't know the mature way to initiate it, and instead chose to ask him to have sex knowing he'd want to know why. \n\nThe problem is that she chose this way to say it. And depending on how she meant it, that could also be a problem, too.",
      "created_utc": 1737584661.0,
      "score": 6
    },
    {
      "id": "m8q5ckw",
      "body": "Thank you. I wrote a response to someone else that might address some of the issues you raised. \n\n\\*\\*Broken into blocks because Reddit won't let me comment\\*\\*\\*\n\nMy wife sucks at communication and expressing how she feels. However, she isn't malicious, and I don't believe her intent was harmful. She's extremely remorseful about what she said and how it has tanked my self-esteem. \n\nNonetheless, her choice of words devastated me in so many ways, not all of which I described in detail in my OP (I was venting, not meaning to write anything comprehensive).",
      "created_utc": 1737641702.0,
      "score": 2
    },
    {
      "id": "m8q5efr",
      "body": "I have struggled with self-harm myself, and I have for more than 20 years. A lot of people commenting didn't seem to read that part of me struggling with self-harm. I know what the \"release\" feels like, but I also know how damaging it is. I currently take prescription steroids to help me heal from self-harm injuries. \n\nI have struggled with my body image and weight for many years. When I experienced Psychosis, I developed an ED and was prescribed half a dozen medications, and I gained a lot of weight incredibly fast. Combined with my crooked teeth, bad acne, and self-harm scars, I feel extremely insecure about my body and how ugly I am. Add to this all my mental and developmental disabilities, such as Autism, PDD, a speech impairment, etc., and I generally feel inferior and broken. \n\nI've struggled with the trauma of repeated childhood sexual assault for most of my life. This makes sex a challenging and complicated subject for me. I am incredibly hypervigilant and easily triggered by what some might call \"normal\" behaviour, such as being attracted to someone, experiencing arousal, etc. I've always feared that inside of me, a rapist is waiting and ready to hurt someone, and I need to savagely kill that rapist inside of me before he hurts someone else. I realize this might sound incredibly ridiculous to a Redditor, but I'm unable to distinguish easily between \"harmful\" sex and \"healthy\" sexual behaviour. The fact is, I have had sex with two people in my life: my dad and my wife. It has been a long and painful therapeutic journey to heal my sexual trauma. \n\nWe have struggled with sex and intimacy in our relationship. When we first started couples counselling, it seemed like she never wanted sex or intimacy with me unless she was upset. If I ask for sex, I will indeed be rejected 100%. I feel like I don't exist until something is wrong or upsetting her. Combined with the above sexual trauma, this makes me feel on edge when she is interested in me because it is usually the harbinger of something wrong. Cuddles? = Something Wrong. Hug? = Something Wrong. She usually won't do these things unless she is upset about something. This is why I asked why she propositioned me for sex. She will most certainly reject me if I ask for sex, so a random request for sex from her raised a flag in my mind, like, \"Uh, oh! Something must be really wrong now!\"",
      "created_utc": 1737641719.0,
      "score": 2
    },
    {
      "id": "m8q5gw3",
      "body": "Her comment hit all four of these significant issues in my life like a missile. \n\nI know self-harm is a release, but I also have first-hand experience of the damage it can cause. \n\nSo, when I already feel fat, ugly, and insecure about my body and generally disabled, broken, and inferior, how am I supposed to handle my wife comparing sex with me, which involves my fat and ugly body, to cutting herself? How am I supposed to feel body-positive or neutral when my SO is comparing sex with me to cutting herself? \n\nSo, when I am still trying to heal sexual trauma, how am I supposed to handle my wife comparing sex with me to self-harm? I have had sex with two people: my DAD when I was CHILD, and then my WIFE, who compared it to SELF-HARM. Does this mean all sex is inherently evil? Am I not capable of having healthy sex? Is all sex some form of punishment? How am I supposed to heal sexual trauma when all sex is trauma? \n\nThis maybe wouldn't feel so bad if my wife also had sex for positive reasons, like she loves me or is attracted to me. A one-off: I like sex, and I feel bad right now; ergo, sex will help me feel better is fine. But she ONLY wants sex with me when she is upset. She ONLY wants sex when she is in a self-harm mood. \n\nI am less concerned with deciphering my wife's intent in making that remark—she is not malicious, so I am not worried about that—than knowing how to live with myself without that remark replaying in my head 1000 times a day and haunting me forever. I had an acne break out on my face a few days ago. I looked in the mirror angrily and thought, \"Yup, this is why sex with you is self-harm, you ugly POS!\" Last night, I told my therapist that maybe a fat, ugly, disabled loser like myself isn't supposed to want or have sex since the only people ever interested in having sex with me are a parent and a woman who wants to hurt herself. \n\nAgain, my wife isn't malicious, but it feels like that remark, malicious or stupidly insensitive, will haunt me for a long time, and I don't know how to deal with that.",
      "created_utc": 1737641742.0,
      "score": 1
    },
    {
      "id": "m8q6z1c",
      "body": "I understand logically what she meant when she said what she said, but it still replays repeatedly in my mind, and regardless of her intent, it felt incredibly hurtful in so many ways.\n\nI am struggling to live with myself, knowing my wife compared sex with me to self-harm in those words. I already struggle with my self-esteem and liking myself. Those words hit me super hard, even if her intent wasn't malicious, and she expressed something innocent insensitively in the heat of the moment. \n\nThis is the crux of the issue for me. Her intent doesn't change the hurt and anger I feel towards myself.",
      "created_utc": 1737642240.0,
      "score": 1
    }
  ]
}