{
  "id": "1krj5wu",
  "title": "and im crying.",
  "selftext": "",
  "created_utc": 1747782905.0,
  "score": 296,
  "num_comments": 174,
  "url": "https://i.redd.it/h2ox3qetr02f1.png",
  "comments": [
    {
      "id": "mte4fdd",
      "body": "Oh.  Please, you deserve better.  A guy told me once \"I only dated you because I felt sorry for you!\"  I went from sad to mad and then relieved.  Cause I did not have to stick around!",
      "created_utc": 1747787310.0,
      "score": 224
    },
    {
      "id": "mtdxrsv",
      "body": "Please leave. Prioritize your self-respect and protect your peace and heart; you’re worth it, always. You didn’t deserve this, you deserve the best. Take care 🫶",
      "created_utc": 1747784935.0,
      "score": 362
    },
    {
      "id": "mtely86",
      "body": "Girl, you’re 5'3\" and still carrying the weight of his insecurity too? That’s superhero strength. Also, “I only chose you because of your boobs”. Sir, this isn’t Build-a-Girlfriend. She’s not a custom order, she’s a whole person.",
      "created_utc": 1747793541.0,
      "score": 172
    },
    {
      "id": "mtek52x",
      "body": "This sounds like something a high schooler would say.",
      "created_utc": 1747792876.0,
      "score": 105
    },
    {
      "id": "mte7924",
      "body": "Boy BYEEEEEEEE. You’ll find the guy who loves all parts of your body and mind.",
      "created_utc": 1747788324.0,
      "score": 104
    },
    {
      "id": "mte4ryh",
      "body": "You don’t deserve this, not now, not ever. No one has the right to make you feel worthless or ashamed of who you are. The things he said aren’t just cruel. They’re abusive. Please walk away. Protect your heart, your peace, and your future. The right person will never weaponize your insecurities or mock your body. You are worth love that feels like safety, not survival. Choose yourself. You owe that to the version of you that’s still trying to heal.",
      "created_utc": 1747787435.0,
      "score": 22
    },
    {
      "id": "mtese2m",
      "body": "Wow honestly you just have to laugh at him and his ability to put another down. He must hate himself\nSooo much more than you, OP, say you do. You’re openly saying you struggle with self esteem and he continues to bash you!!?? Lmaaooo what a pathetic human.",
      "created_utc": 1747795903.0,
      "score": 39
    },
    {
      "id": "mtej49c",
      "body": "Just remember that when people name call or insult it says more about them than you.",
      "created_utc": 1747792513.0,
      "score": 26
    },
    {
      "id": "mteyi23",
      "body": "Bro is projecting hard, leave this loser, you’ll be better off for it",
      "created_utc": 1747798327.0,
      "score": 18
    },
    {
      "id": "mtey561",
      "body": "Being a fat tall guy is not different lol.",
      "created_utc": 1747798176.0,
      "score": 16
    },
    {
      "id": "mtex0ce",
      "body": "Did he, a guy, just put himself on the “baddie” scale?",
      "created_utc": 1747797706.0,
      "score": 8
    },
    {
      "id": "mtefy4v",
      "body": "That is definitely a kthxbye moment.",
      "created_utc": 1747791391.0,
      "score": 13
    },
    {
      "id": "mtey9nu",
      "body": "Seems healthy",
      "created_utc": 1747798228.0,
      "score": 12
    },
    {
      "id": "mtf4cp0",
      "body": "Tf!!! \n\nGet away from that dude!",
      "created_utc": 1747800917.0,
      "score": 5
    },
    {
      "id": "mtepkmr",
      "body": "Never tell a man you hate yourself, even if it’s true, you don’t want to give him a free pass to talk to you like this",
      "created_utc": 1747794852.0,
      "score": 8
    },
    {
      "id": "mtf35ic",
      "body": "I don’t blame you for crying. It’s absolutely gut wrenching to have someone you are close to and have given a part of yourself to say something so cruel. In my experience, time is the only cure. One day, in the future you can look back and just be glad he’s not part of your life anymore.",
      "created_utc": 1747800368.0,
      "score": 5
    },
    {
      "id": "mtf5bxi",
      "body": "Why are we talking?",
      "created_utc": 1747801377.0,
      "score": 5
    },
    {
      "id": "mtf6pb2",
      "body": "he doesn't deserve any of your tears.. you deserve someone that will talk to you with respect kindness love affection and will make you feel beautiful everyday because you are.. and i know you will find this kind of person.. skip this one please",
      "created_utc": 1747802031.0,
      "score": 4
    },
    {
      "id": "mtf79g6",
      "body": "Coming from a dad, you deserve so much more respect than this. People will treat you how you let them treat you. Don’t ever let anyone treat you like this",
      "created_utc": 1747802303.0,
      "score": 4
    },
    {
      "id": "mte82i5",
      "body": "You deserve better than him, people who say things like that are miserable. You will find someone who will love for everything about you, don't cry over him. Stay strong",
      "created_utc": 1747788612.0,
      "score": 8
    },
    {
      "id": "mtfdo8t",
      "body": "this is honestly hilarious that guy is an idiot why feel sad because of that 😂",
      "created_utc": 1747805540.0,
      "score": 3
    },
    {
      "id": "mtfsjsx",
      "body": "Dude comes across to me like a shitty person. You deserve better.",
      "created_utc": 1747814278.0,
      "score": 3
    },
    {
      "id": "mtftwau",
      "body": "This dude's a whole charity case. A chocolate fireguard, if you will",
      "created_utc": 1747815136.0,
      "score": 3
    },
    {
      "id": "mtfw2vu",
      "body": "girl leave him! that misogynistic pissbaby isn't worth anyone's time and from his description you're still pretty, he just has unrealistic expectations of women and would rather bully you than work on himself. (Also, if he never liked you and he still dated you that's just pathetic and sad)",
      "created_utc": 1747816545.0,
      "score": 3
    },
    {
      "id": "mtg9ei1",
      "body": "This is how I got treated by a lot of dudes when I was a teen and in my 20s, thought it was normal so I would just try harder to be what they wanted\n\nIt actually isnt normal, its abuse.",
      "created_utc": 1747824439.0,
      "score": 3
    },
    {
      "id": "mtggi7z",
      "body": "I'm so sorry this person is in your life. I know it will probably be difficult, but they need to be removed from it. Beauty and sexiness come from the inside, it is the love felt for us that makes most humans desirable. You will find your guy or girl. I believe in you <3",
      "created_utc": 1747827720.0,
      "score": 3
    },
    {
      "id": "mtghnd8",
      "body": "Don’t go back and forth just block him. Fighting like this does nothing.",
      "created_utc": 1747828208.0,
      "score": 3
    },
    {
      "id": "mtgif1s",
      "body": "If i ever had such an interaction with a partner best believe it would be the last. Striaght ghost and blockage from all angles.",
      "created_utc": 1747828528.0,
      "score": 3
    },
    {
      "id": "mtgmvf4",
      "body": "What a fucking disgraceful POS. Leave this guy immediately",
      "created_utc": 1747830312.0,
      "score": 3
    },
    {
      "id": "mtgrwsc",
      "body": "What a dipshit.  You don't need to kid yourself staying with someone like that.  Some people are a literal waste of time to talk to.  He's not going to change for you, it's not going to be a healthy relationship.    \n  \nHe doesn't even like you, he just likes your tits.  He said so himself.",
      "created_utc": 1747832172.0,
      "score": 3
    },
    {
      "id": "mtgz6x3",
      "body": "I can tell you're a fighter and not a lover- in a good way. I'd use this experience to learn and grow as a person, but most importantly, for loads of energy to overcome your setbacks and achieve your goals.",
      "created_utc": 1747834658.0,
      "score": 3
    },
    {
      "id": "mthcgl0",
      "body": "What’s his number, I just wanna talk. Jk, but for real, this is giving the most insecure boy vibes ever. I’ve seen better bullying coming from a fifth grader. OP, you deserve so much better. This boy is a dime a dozen.",
      "created_utc": 1747838689.0,
      "score": 3
    },
    {
      "id": "mthnoxl",
      "body": "You can do better. He cannot.",
      "created_utc": 1747841926.0,
      "score": 3
    },
    {
      "id": "mteqi2y",
      "body": "he would’ve said anything in that moment to hurt you. i don’t know you but this man is evil and you are not ugly",
      "created_utc": 1747795193.0,
      "score": 5
    },
    {
      "id": "mtfb0fx",
      "body": "Hey love,\n\nI know you're hurting right now, and honestly? You have every right to be. What he did was shallow, disrespectful, and completely undeserving of the amazing woman you are.\n\nLet’s just call it what it is...he was a boy playing pretend, not a man ready to respect, love, or even see you beyond your body. Dating someone just for their boobs? That’s not attraction. That’s objectification. And it says everything about him, not you.\n\nYour body is beautiful, yes. But your heart...Your brain...Your fire...That’s the real gold. \n\nYou are not just a pair of boobs in a pretty dress. You’re the full damn package...and someone will show up who sees that and never lets you forget it.\n\nFor now, cry it out, block his number, wear that killer outfit anyway, and remember: **the trash took itself out**. You didn’t lose him...he lost you.\n\nI know it's easy to be on this side and be all preachy...but yeah, I've been there when I was fat and I am still 5 feet tall. I don't know how much I've cried and wasted a lot of time on such trash. \n\nI realize this now that I really wasted my time when I could've laughed a lot with my girlies, enjoyed life, gone somewhere to explore hidden gems, and more of that. Instead, I cried to sleep every night and drown myself in self-pity. \n\nI really don't want this for you. You can always choose to be happy, right now while ditching such trash people from your life. \n\nBig hugs and bigger self-love from my side to you...",
      "created_utc": 1747804166.0,
      "score": 5
    },
    {
      "id": "mtesu1n",
      "body": "I think both are wrong, should not have mentioned the guy is an exact copy of someone else and he for sure should not have reacted the way he did.",
      "created_utc": 1747796065.0,
      "score": 9
    },
    {
      "id": "mtf9uia",
      "body": "Cut this person out your life right now. Seriously. Block. And don’t look back. Fully. Make sure he can’t contact you one bit. (Also be careful, people like this can be dangerous. Especially if he seems to be actively seeking you out to cause harm.)\n\n(Also you could possibly report this to the police. Since it counts as harassment.)",
      "created_utc": 1747803576.0,
      "score": 2
    },
    {
      "id": "mtfa26j",
      "body": "What the fuck? LEAVE this sorry asshole! Abusive.",
      "created_utc": 1747803684.0,
      "score": 2
    },
    {
      "id": "mtfanby",
      "body": "Leave him where he stands",
      "created_utc": 1747803980.0,
      "score": 2
    },
    {
      "id": "mtfbo2w",
      "body": "Fuck that guy. Go respect yourself more! Don't let your negative thought overcome you! You need to appreciate to yourself more! I don't giving a fuck if my girlfriend fat or not. The most important is that familiarity to each other and respect each other!",
      "created_utc": 1747804496.0,
      "score": 2
    },
    {
      "id": "mtfc1x6",
      "body": "Leave him. He doesn't have an ounce of respect for you and is body shaming you. You deserve someone who values you for who you are, not someone who tears you down to feel better about themselves. Walk away and protect your peace.",
      "created_utc": 1747804693.0,
      "score": 2
    },
    {
      "id": "mtff4bs",
      "body": "Guy's projecting, he's been left out the exact same manner. But take into account his comments cause if they hold any truth in them (about your behavior) then you should capitalize on it and fix it. No big deal.",
      "created_utc": 1747806315.0,
      "score": 2
    },
    {
      "id": "mtfg1jn",
      "body": "It's particularly telling the kind of desperate and fragile individual this person has to be that when directly putting you down wasn't working, they had to resort to being so manipulative that they claimed to be such a shitty person that they secretly only ever chose you for some shallow reason just so that they could finally hurt you. \n\nYou're worth far more than the way they're trying to make you believe, and you're not responsible for their failure to see that. It's so much harder said than done (I'm currently dealing with similar behavior from an ex myself) but blocking all contact with them and giving yourself time to process things without that type of abusive and manipulative behavior to cloud your thoughts is so helpful and validating. \n\nAnyway I'm sorry to give you a bunch of advice you didn't ask for, the important takeaway is your self worth. Other than that if you need a friendly ear from a stranger who understands because they're in a similar situation themselves, I'm here to comment back and forth as long as you need.",
      "created_utc": 1747806817.0,
      "score": 2
    },
    {
      "id": "mtfh0bm",
      "body": "Is this b*tch 12 years old? Because he certainly acts like one. That right there is not a man.\n\nPlease, for your own wellbeing, get away from this rancid excuse of a human being. He does not deserve your time, effort or love. You deserve a thousand times better than what this douche is offering.",
      "created_utc": 1747807348.0,
      "score": 2
    },
    {
      "id": "mtfinqv",
      "body": "Narcissistic personality disorder. They are always in competition to feel superior to others. They lack empathy and manipulate.",
      "created_utc": 1747808290.0,
      "score": 2
    },
    {
      "id": "mtfksfd",
      "body": "You guys both said mean things to each other. You both need therapy and separation IMO.",
      "created_utc": 1747809541.0,
      "score": 2
    },
    {
      "id": "mtflb3m",
      "body": "Babe run.",
      "created_utc": 1747809844.0,
      "score": 2
    },
    {
      "id": "mtfq2yq",
      "body": "I'm going to be honest - I only see this tiny snapshot of your conversation, idk what happened before or after, don't have any context etc., but only taking what I see here at face value... you were both clearly trying to say things that would hurt the other the most. You were pretty ruthless in your comments, ngl, it's quite obvious you were trying to hurt him, and it seems like you aimed in a sensitive place (and hit); and then he retaliated, acted like a hurt child and tried to insult you back the best way he could (it doesn't even matter whether there's *any* truth whatsoever to what he said, he was only trying to hurt you back in this moment - so definitely don't take his words to heart). This whole exchange is just you two going back an forth insulting each other, hurling hurtful things at one another and trying to \"win\" that way... Which is how you both lose.\n\nHow old are you guys? I would guess young teenagers. Look, honestly, if you guys are dating, I don't understand why you still are. You clearly don't even like each other much. It seems like you have no respect for one another, and like you make each other miserable. Especially when I saw you mention in another comment that he has \"said worse\" - seriously, people who like and care about each other do not go out of their way to hit each other where it hurts the most. I think you would both be better off and happier single for a while. Do some growing on your own, work on your self-esteem. So my advice would be think about how that relationship and the way he treats you make you feel, how you feel in it, how it makes you feel about yourself, how you feel and what you think about him, and decide what to do. But just from this small exchange... this setting does not seem healthy or happy at all.\n\nWishing you luck.",
      "created_utc": 1747812734.0,
      "score": 2
    },
    {
      "id": "mtfqiw1",
      "body": "Hang in there! This guy is below you, apart from being downright rude. Please don't take his insults to heart. All he did was expose his shallowness. You're better off without someone like that in your life.",
      "created_utc": 1747813016.0,
      "score": 2
    },
    {
      "id": "mtfs0or",
      "body": "if the conversation starts showing hurtful comments that have nothing to do with the issue on hand, there is a different problem than the problem at hand. \n\nIt's about putting people down and asserting a validation in perspective by knocking the opposition down. \n\nAsk yourself if it's healthy to be an opposition party in a relationship? \n\nIt's a relationship, not politics. \n\nDraw a line.",
      "created_utc": 1747813948.0,
      "score": 2
    },
    {
      "id": "mtfvdf8",
      "body": "Send those messages to his mother",
      "created_utc": 1747816084.0,
      "score": 2
    },
    {
      "id": "mtg8581",
      "body": "Block that loser immediately",
      "created_utc": 1747823799.0,
      "score": 2
    },
    {
      "id": "mtgjjhm",
      "body": "Walk off if people insult you even in joking manner and if they are dumb it's even worse",
      "created_utc": 1747828989.0,
      "score": 2
    },
    {
      "id": "mthft4s",
      "body": "Unfortunately a text only provides a brief overview.  Self awareness is encouraged and leave the relationship asap…",
      "created_utc": 1747839664.0,
      "score": 2
    },
    {
      "id": "mthj3s6",
      "body": "Is this supposed to be your partner?",
      "created_utc": 1747840611.0,
      "score": 2
    },
    {
      "id": "mti0le6",
      "body": "I have had a guy ask me on date, we had plans to go for drinks. That’s when I realized I didn’t have my ID and asked if we could go for drinks the following weekend, like a rain check, and he immediately told me I was fat. Then I found out he did this to EVERY girl who turned him down. Please don’t take it to heart, I know it’s not easy, but just know he is only trying to hurt you with those words, and that’s the one way they know how to. That word is so hurtful for us, and they know it.",
      "created_utc": 1747845647.0,
      "score": 2
    },
    {
      "id": "mti4w0u",
      "body": "Post this on anything his family can see.",
      "created_utc": 1747846858.0,
      "score": 2
    },
    {
      "id": "mtijv8g",
      "body": "“Male loneliness epidemic” my ass",
      "created_utc": 1747851055.0,
      "score": 2
    },
    {
      "id": "mtjm83v",
      "body": "we can't judge by this because there is no context.. two people are insulting each other with their insecurities. .. both are wrong and no one is right here.",
      "created_utc": 1747861982.0,
      "score": 2
    },
    {
      "id": "mtjw40r",
      "body": "Leave that dude\n\nhttps://pin.it/jruAZjVxq\n\nWatch this all the way through trust me get him back",
      "created_utc": 1747864968.0,
      "score": 2
    },
    {
      "id": "mtk3we8",
      "body": "Honestly…he’s hilarious only trolls have the audacity honey. Don’t ever let a gremlin read you like that ever again. At the end of the day, if you cut him off completely I will bet you, he’ll come back for your attention. He needs you YOU DONT  NEED HIM. And baby please don’t admit to hating yourself, learn to love yourself. There are people who take pleasure in your pain and enjoy kicking you while you’re down, as shown in exhibit a. Trust you’ll find way better once you focus on you.\n\nP.s. when he does come back you better not give him the attention. Starve his bitch ass since he doesn’t know to how to come correct. Clearly his mother didn’t teach him manners",
      "created_utc": 1747867553.0,
      "score": 2
    },
    {
      "id": "mtkdlx6",
      "body": "You were both being quite nasty to be honest, seems like a toxic relationship and your both better off without each other",
      "created_utc": 1747870826.0,
      "score": 2
    },
    {
      "id": "mtkmktx",
      "body": "Disrespectful and bad grammar.\nNext!",
      "created_utc": 1747873949.0,
      "score": 2
    },
    {
      "id": "mtm0ebm",
      "body": "honestly the person you were talking to seems really really pretinsous and sounds like he only cares about one thing i honestly hope ur feeling ok and droped tallking to them and i hope they never find love",
      "created_utc": 1747894084.0,
      "score": 2
    },
    {
      "id": "mtoek9n",
      "body": "You both are wrong. You shouldnt point fingers to each other. You both want to be the bigger person rn so you maybe say things that arent true but yeah thats from me a stranger",
      "created_utc": 1747930415.0,
      "score": 2
    },
    {
      "id": "mtebm4w",
      "body": "Hey you’re kind in a way he will never be!!",
      "created_utc": 1747789851.0,
      "score": 2
    },
    {
      "id": "mtef85v",
      "body": "Eff that dude.  You deserve someone better than someone who talks down to you.  \n\nI hope you move on and give yourself the chance to find someone who lifts you up.",
      "created_utc": 1747791131.0,
      "score": 2
    },
    {
      "id": "mtejsj6",
      "body": "He. Is POS plz don’t ever go. Back to him !!",
      "created_utc": 1747792751.0,
      "score": 2
    },
    {
      "id": "mteoh2k",
      "body": "Girl he doesn’t even like you and you’re too good for him. Do us all a favor and ghost him",
      "created_utc": 1747794459.0,
      "score": 2
    },
    {
      "id": "mterfdi",
      "body": "I’d block him at this point fuck him",
      "created_utc": 1747795538.0,
      "score": 2
    },
    {
      "id": "mtexlda",
      "body": "Is he serious \nPlease leave he is not worth it",
      "created_utc": 1747797947.0,
      "score": 2
    },
    {
      "id": "mtey3h7",
      "body": "Oh, that's so sad... :/ \nI sincerely hope you get well. The problem is not with you.",
      "created_utc": 1747798156.0,
      "score": 2
    },
    {
      "id": "mteysji",
      "body": "Boy get fucked",
      "created_utc": 1747798450.0,
      "score": 2
    },
    {
      "id": "mtezx4z",
      "body": "As someone who is 5’3 and fat….AND? LOL\nTrust and believe me you will have no problem finding someone who will obsess over you, please don’t waste any more time on this person and spend that time on yourself 🖤",
      "created_utc": 1747798933.0,
      "score": 2
    },
    {
      "id": "mtf1ciu",
      "body": "You should be crying from relief you dodged this creep",
      "created_utc": 1747799555.0,
      "score": 2
    },
    {
      "id": "mtf5y06",
      "body": "[deleted]",
      "created_utc": 1747801667.0,
      "score": 2
    },
    {
      "id": "mtgivhk",
      "body": "You both behaved atrociously in this exchange.",
      "created_utc": 1747828715.0,
      "score": 2
    },
    {
      "id": "mtervcl",
      "body": "That guy is a CUNT you will find better!",
      "created_utc": 1747795706.0,
      "score": 1
    },
    {
      "id": "mtfbvbb",
      "body": "chopped vs choppette 🥀",
      "created_utc": 1747804598.0,
      "score": 1
    },
    {
      "id": "mtfccsw",
      "body": "Please block that piece of shit and never talk to him again. He's really not worth your time and I'm saying this from experience. I went through a similar situation a few years ago and kept replying and even coming back to someone who never even cared about me in the first place. There will be better people in your life, and one day you will meet someone who actually loves you and who would never treat you like this.",
      "created_utc": 1747804847.0,
      "score": 1
    },
    {
      "id": "mtfi0ps",
      "body": "Hello, everyone. full conversation and context is up on my page.",
      "created_utc": 1747807927.0,
      "score": 1
    },
    {
      "id": "mtfpr6b",
      "body": "I know that this is no time for a joke but this reminded me of that russian video (just wanted to cheer you up lol)\n\nhttps://youtu.be/L6HU2keljX0?si=p2URzp8Lf5GQYvSK",
      "created_utc": 1747812528.0,
      "score": 1
    },
    {
      "id": "mtfv28k",
      "body": "that sucks, for both of you......",
      "created_utc": 1747815881.0,
      "score": 1
    },
    {
      "id": "mti47us",
      "body": "Into the dumpster he goes!",
      "created_utc": 1747846669.0,
      "score": 1
    },
    {
      "id": "mti75rb",
      "body": "This hit hard. I’ve felt the same and i'm still learning about the self-love...",
      "created_utc": 1747847504.0,
      "score": 1
    },
    {
      "id": "mti7r9r",
      "body": "In the wise words of Hank Hill: HORSES ASS.\n\nYou deserve to be treated with respect and this ain't it.",
      "created_utc": 1747847670.0,
      "score": 1
    },
    {
      "id": "mticee0",
      "body": "Get away from that!",
      "created_utc": 1747848957.0,
      "score": 1
    },
    {
      "id": "mtimmo8",
      "body": "Are you guys 15? Two wrongs don't make a right and you were both being childish.",
      "created_utc": 1747851865.0,
      "score": 1
    },
    {
      "id": "mtiopmo",
      "body": "You both sound absurd in this.",
      "created_utc": 1747852468.0,
      "score": 1
    },
    {
      "id": "mtj47bu",
      "body": "So he’s a horny incel?",
      "created_utc": 1747856952.0,
      "score": 1
    },
    {
      "id": "mtj8epv",
      "body": "I hope this person gets everything coming to them and more. He is absolutely steaming trash and deserves to be ripped apart limb by limb. You deserve so so so much better OP",
      "created_utc": 1747858139.0,
      "score": 1
    },
    {
      "id": "mtk3e3m",
      "body": "Please tell me you're not dating this person anymore.",
      "created_utc": 1747867380.0,
      "score": 1
    },
    {
      "id": "mtk7mq9",
      "body": "Just tell him you'll have lost at least 13 stone by the morning and block him.",
      "created_utc": 1747868803.0,
      "score": 1
    },
    {
      "id": "mtk930r",
      "body": "Get out enjoy life",
      "created_utc": 1747869293.0,
      "score": 1
    },
    {
      "id": "mtkefbp",
      "body": "He sounds like a fucking loser. Show yourself kindness by binning him.",
      "created_utc": 1747871104.0,
      "score": 1
    },
    {
      "id": "mtkfq7t",
      "body": "He’s an idiot",
      "created_utc": 1747871550.0,
      "score": 1
    },
    {
      "id": "mtknxap",
      "body": "Don't talk to that guy again. Everything he's written there is intended to hurt you. Don't base your worth on the opinions of narcissistic jerks.",
      "created_utc": 1747874422.0,
      "score": 1
    },
    {
      "id": "mtl059j",
      "body": "LEAVE HIM! DUMP HIM! I I guarantee you there’s somebody else better who will be more than willing to be your partner and build you up instead of tearing you down. He is trying to bring down your self-worth. He is trying to make you think he is your only option so he can treat you any way he wants to. HE IS LYING! Leave! He was mad you called him out for being uncaring earlier, so he attacked trying to bring you down instead of addressing the issue at hand. You shouldn’t have to beg or fight  him to treat you with respect and kindness. DUMP HIS ASS",
      "created_utc": 1747878687.0,
      "score": 1
    },
    {
      "id": "mtl2skm",
      "body": "Leave him please!! He's not worth your time",
      "created_utc": 1747879621.0,
      "score": 1
    },
    {
      "id": "mtldwhz",
      "body": "Yall are both the problem",
      "created_utc": 1747883600.0,
      "score": 1
    },
    {
      "id": "mtlpq29",
      "body": "I hope you’re crying laughing vs sad crying. This person is a tool and doesn’t deserve your attention. Kick em to the curb!",
      "created_utc": 1747888638.0,
      "score": 1
    },
    {
      "id": "mtrk9oc",
      "body": "Girl that’s straight up like- manipulation and gaslighting. Don’t listen to them no matter what they say. Just RUN. That man is evil.",
      "created_utc": 1747966135.0,
      "score": 1
    },
    {
      "id": "mtyqvlu",
      "body": "Don't let this person bring you down, although that may be impossible at the moment. People say whatever they can sometimes to hurt others, but just know that you are pretty and that someone will come along one day that will love you the way you deserve to be loved.",
      "created_utc": 1748065252.0,
      "score": 1
    },
    {
      "id": "mtz2ctm",
      "body": "lol he’s upset dw he said all that out of hate and it’s probably not true (i don’t know you so i can’t fully tell) but telling that he typed o instead of i he was typing fast and pissed off so dw you hit the spot that pissed him off and he’s just mad nobody really cares if your 5’3 and fat he is also barley responding so i don’t think you should waste your time on him tbh people will say mean shit all your life you have to take it either make yourself better with that info or picture yourself shoving the words up there ass",
      "created_utc": 1748071940.0,
      "score": 1
    },
    {
      "id": "mu1vtgi",
      "body": "People like that will never admit they hurt people and don't care because to them they are perfect.\n\n\nAs I guy I get the same problem.about other issues. Not about my looks but my life. They will always put you down and every time you stand up for your self they will twist it and make you feel worse.\n\n\nLike others have said protect yourself end contact. You deserve better treatment.",
      "created_utc": 1748112778.0,
      "score": 1
    },
    {
      "id": "mucvs3s",
      "body": "In my opinion it is unhealthy communication on both sides here. Each attacking the other personally with black and white labelling. Tit for tat insults just fuelling the fire on both ends. \n\n\nFeel for you though nonetheless but that's not the way to handle negative people like him.\n\n\nHope youre ok. Big love",
      "created_utc": 1748273788.0,
      "score": 1
    },
    {
      "id": "mugfjgd",
      "body": "He proved your point exactly. Guys like that have no room in this world. Their heads take up too much space. I can guarantee you I could name at least twenty guys that are more attractive than whatever he thinks he looks like girl don’t worry😭❤️",
      "created_utc": 1748316227.0,
      "score": 1
    },
    {
      "id": "muh706z",
      "body": "Trust me. There are gonna be shit people in ur life just like him...but you will find someone who will admire for who you are u know just wait till then work on yourself so u don't need validation from ass*oles like these and you'll have to trust and believe yourself... I hope for your best in the future... don't fret it",
      "created_utc": 1748330074.0,
      "score": 1
    },
    {
      "id": "mtf0uwb",
      "body": "Tell them next they wanna come back they gotta scrape it from the back of they moms teeth",
      "created_utc": 1747799340.0,
      "score": 1
    },
    {
      "id": "mtff7nk",
      "body": "Are we ignoring the facts here? 1) we don't know if op is blue or grey 2) it's a slice of an entire chat 3) blue starts this grab by being insulting to grey?\n\nLook at blues first comment, hardly a nice person are they? Is grey wrong? Yes. Is grey reacting to blue? Also yes. Seems to me neither of these people are decent \n\nSeriously people get a grip and don't knee jerk support based on incomplete evidence. 300 years ago you lot would burn women for being witches.",
      "created_utc": 1747806366.0,
      "score": 1
    },
    {
      "id": "mtfqewa",
      "body": "\\>she's a whole person.\n\nWell said.",
      "created_utc": 1747812945.0,
      "score": 33
    },
    {
      "id": "mtghx63",
      "body": "OP is 15 years old according to their post history :(",
      "created_utc": 1747828322.0,
      "score": 26
    },
    {
      "id": "mtf69wm",
      "body": "He has said much worse.",
      "created_utc": 1747801826.0,
      "score": 12
    },
    {
      "id": "mtfhncw",
      "body": "So true. It’s a good reminder.",
      "created_utc": 1747807715.0,
      "score": 5
    },
    {
      "id": "mtho5ev",
      "body": "I am indeed not a lover. After him and I broke up almost two years ago I have not felt lovey to anyone, even him.",
      "created_utc": 1747842059.0,
      "score": 3
    },
    {
      "id": "mthod71",
      "body": "thank you!",
      "created_utc": 1747842120.0,
      "score": 2
    },
    {
      "id": "mtfg5fh",
      "body": "Thank you. <3",
      "created_utc": 1747806875.0,
      "score": 2
    },
    {
      "id": "mtf65p9",
      "body": "yes, I understand it was rude of me to say that but he genuinely is impossible to talk with. If I don't say something serious he will say things like \"L + ratio\" n stuff.",
      "created_utc": 1747801769.0,
      "score": 9
    },
    {
      "id": "mtfgixz",
      "body": "it is definitely a concern. He does go out of his way to put me down.",
      "created_utc": 1747807080.0,
      "score": 1
    },
    {
      "id": "mtfgc82",
      "body": "I do not consider myself full of myself. I have been put in many situations where I ended up being harmed mentally and physically because of being selfless. I have had therapy for about 6 years now and still struggle with believing I am not full of myself.",
      "created_utc": 1747806977.0,
      "score": 1
    },
    {
      "id": "mtfgdsu",
      "body": "please dont apologize, I appreciate it. <3",
      "created_utc": 1747807001.0,
      "score": 1
    },
    {
      "id": "mtfnubc",
      "body": "hey, I'm sure you didn't mean this in a harmful way but please check my account and other posts before saying this.",
      "created_utc": 1747811345.0,
      "score": 1
    },
    {
      "id": "mtftzky",
      "body": "Hellooo! thank you for the reply. I have all the ss and context on a recent post pinned on my pf",
      "created_utc": 1747815193.0,
      "score": 1
    },
    {
      "id": "mtfu5wy",
      "body": "hiii! I have way more context on my pf. I am not dating him",
      "created_utc": 1747815305.0,
      "score": 3
    },
    {
      "id": "mtfvl5f",
      "body": "like I said in the post, not even to really be mean, his mother is just like him. She even told me to go suck her fat dick when I was 14. Not to my face, but over text with him. She also called me crazy, a bitch, etc.",
      "created_utc": 1747816224.0,
      "score": 3
    },
    {
      "id": "mthomnr",
      "body": "he is my ex. it is a bit confusing so there is more context on my page. Second pinned if you would like to see it.",
      "created_utc": 1747842196.0,
      "score": 1
    },
    {
      "id": "mtlp5gn",
      "body": "his family is just as bad.",
      "created_utc": 1747888368.0,
      "score": 1
    },
    {
      "id": "mtlpash",
      "body": "I have more context up on my page! second thing pinned. I will say it again, I didnt expect this to go viral and I didnt hide my insults for a reason.",
      "created_utc": 1747888438.0,
      "score": 1
    },
    {
      "id": "mtlpdkz",
      "body": "hey! we are already broken up. There is more context on my second pinned if you wish to see",
      "created_utc": 1747888475.0,
      "score": 1
    },
    {
      "id": "mtsdao9",
      "body": "I am in no way trying to prove im better or the bigger person. Thats why I included what I said as well.",
      "created_utc": 1747978665.0,
      "score": 1
    },
    {
      "id": "mthn5n6",
      "body": "I agree. I wasnt expecting this to get as big as it did. I was assuming a few people would see it and could maybe give me advice",
      "created_utc": 1747841772.0,
      "score": 3
    },
    {
      "id": "mtffyww",
      "body": "I can post the rest of the screen shots. I was going too but not a lot of r/'s allow gallery's of images, aka more than one. Also, I am blue.",
      "created_utc": 1747806778.0,
      "score": 1
    },
    {
      "id": "mtfpe1j",
      "body": "Honestly yeah, this seems like an everyone's kinda being an asshole thing.\n\nI don't know their relationship, but it just feels like a shitty teenage lover's quarrel.\n\nBest of luck to OP. Regardless of who's right or wrong, this shit ain't healthy.\n\nEither learn to communicate better or just break it off.\n\n(I'd recommend the latter)",
      "created_utc": 1747812299.0,
      "score": 0
    },
    {
      "id": "mtgxyw6",
      "body": "Aww don’t listen to him OP! Guys mature a lot later than girls!",
      "created_utc": 1747834256.0,
      "score": 14
    },
    {
      "id": "mtfqgv2",
      "body": "And you deserve much better.",
      "created_utc": 1747812980.0,
      "score": 21
    },
    {
      "id": "mtfhej2",
      "body": "I am so sorry. I know what it’s like to struggle with self-esteem.",
      "created_utc": 1747807574.0,
      "score": 5
    },
    {
      "id": "mtkk1hf",
      "body": "Dump him. Don’t ever waste your time on someone like him.  There’s plenty of fish in the sea.  Meanwhile, hang out with your girlfriends or your family or your parents who would love to see you more.",
      "created_utc": 1747873055.0,
      "score": 1
    },
    {
      "id": "mtpjidg",
      "body": "I hope you have broken up with him. Please update us! You deserve so much better!",
      "created_utc": 1747942169.0,
      "score": 1
    },
    {
      "id": "mugfaeq",
      "body": "Why",
      "created_utc": 1748316125.0,
      "score": 1
    },
    {
      "id": "mtpk6ml",
      "body": "Are you still talking to him? After the break-up? He should not be in your life at all and you should not give him any time of day. No communication whatsoever! Please block his number",
      "created_utc": 1747942370.0,
      "score": 2
    },
    {
      "id": "mtfi48d",
      "body": "You're welcome, dear :)",
      "created_utc": 1747807983.0,
      "score": 1
    },
    {
      "id": "mtfm1s4",
      "body": "dear god how old is he??",
      "created_utc": 1747810284.0,
      "score": 5
    },
    {
      "id": "mtfsmzx",
      "body": "What you said was meanish maybe but also seemed like an accurate assessment from what little info I know about you guys just based off this short convo, he clearly proved you right in those later messages and the way he reacted and the things he said were way worse. Saying someone acting badly makes them a carbon copy of someone is mean and bad depending on context, saying someone is ugly and the only reason you chose them over other girls was because of their boobs is gross as fuck and never okay in any context, that's the kind of fucked up shit you purposely try hard to muster up because you want to hurt and degrade the other person as much as possible. I'm sorry you had to deal with him and you were crying because of this, please know his words are not true, he conjured up the worst sounding sequence of words to get to you. You deserve better than him, than someone of this kind of character.",
      "created_utc": 1747814332.0,
      "score": 5
    },
    {
      "id": "mtfhcpj",
      "body": "Gonna be honest. It sounds like this guy has the greatest inferiority complex in then world. He definitely hates himself so much he wants someone to seem worse than him",
      "created_utc": 1747807545.0,
      "score": 1
    },
    {
      "id": "mtg9ghq",
      "body": "You sound really kind and I don’t know if you’re feeling like he’s going through a hard time so you should be understanding. But he’s being abusive to you and will bring you down with all his comments and make you feel worse about yourself. He probably does need help of some sort but I don’t think you are the one to help him. He will hurt you and you don’t deserve or need that. You need to move on and have people round you who will bring you up and make you feel better about yourself and that’s not him. Protect yourself you’re not responsible for him and you really do deserve better.",
      "created_utc": 1747824466.0,
      "score": 1
    },
    {
      "id": "mtg2jfi",
      "body": "No… I’m not doing a deep dive on your profile. You posted here a conversation where you said something mean to your partner and he said something mean back. I think you’re looking for validation without taking accountability for the fact you were both mean. I’m not saying you shouldn’t leave them, but I think you both need to get therapy on how to treat people in a disagreement. \nI am married and we disagree but we never insult or attack each other in this way…",
      "created_utc": 1747820613.0,
      "score": 1
    },
    {
      "id": "mtfuojy",
      "body": "You're still engaging with him even though you're not in a relationship?\n\nWhat's the use in that?",
      "created_utc": 1747815638.0,
      "score": 1
    },
    {
      "id": "mtj4zyi",
      "body": "Oh okay, well I'm very glad he's your ex...\n\nIll go look it up yes, I'm curious!!",
      "created_utc": 1747857172.0,
      "score": 2
    },
    {
      "id": "mtlx7j7",
      "body": "Bringing acknowledgement at how terrible the whole family is would do some justice. Everything always thinks they can say and do what they want till People at their Places of business take wind or randoms on the internet. Even if they are oblivious to the embarrassment,the next person will see their true colors",
      "created_utc": 1747892364.0,
      "score": 1
    },
    {
      "id": "mtlpydv",
      "body": "I have mental health issues too so I get it, but you guys are better off without each other, thats not how you treat someone you care for",
      "created_utc": 1747888747.0,
      "score": 1
    },
    {
      "id": "mtsdnlk",
      "body": "For me you both just sound wrong and going here to get people who says you are right is just idk. You should keep this between you and him 🤷‍♀️",
      "created_utc": 1747978851.0,
      "score": 1
    },
    {
      "id": "mtx3q2r",
      "body": "Idk if this is some sexist shit but scientifically you’re correct although you should consider maybe adding more context to your comment instead of just outright blaming him for not maturing. Clearly that’s not the point it’s about the choices you make",
      "created_utc": 1748040992.0,
      "score": 0
    },
    {
      "id": "mtfoei0",
      "body": "17",
      "created_utc": 1747811688.0,
      "score": 3
    },
    {
      "id": "mtfulrt",
      "body": "I have more context and the whole conversation on my pf. I am not trying to make myself seem better in this conversation because I got defensive very quickly. While I know saying he is the exact same is rude, it is the truth and he really needs help.",
      "created_utc": 1747815588.0,
      "score": 2
    },
    {
      "id": "mtga5pw",
      "body": "he 100% needs help and has been going through a lot. Thats part of the reason I kept in contact. (despite the fact he ignored me when I was at one of my lowest points) but it's hard to keep excusing his behavior.",
      "created_utc": 1747824812.0,
      "score": 1
    },
    {
      "id": "mtg73u1",
      "body": "It is the second pinned on my profile :) but im okay with explaining it here again! I am 100% taking accountability and thats why I posted the whole conversation. I get defensive really quickly with him because of the things he has done. I am in therapy and have been for 6 years, since I was 9. He has told me before that no one would care if I died, including himself and that everyone at school thinks im fat and ugly and hates me. He also said it was a good thing I cut myself after being clean for months. I broke up with him almost two years ago and I keep responding because of trauma bonds.\n\nAlso, right after we broke up, he became friends with my old abuser and my rapist. He very well knew what they have done to me and he even admitted it was out of spite. (he is still friends with them). He also flirted with most of my friends and the worst part is, they flirted back. They are no longer my friends.\n\nNot only that, but he leaked my nudes and was found guilty but I didn't press charges because I wanted it to all be over since I left the school after a suicide attempt due to being bullied and stuff. \n\nNot to mention he would say shit like 'he could rape me so easily' because of our size difference.",
      "created_utc": 1747823241.0,
      "score": 1
    },
    {
      "id": "mtsej7w",
      "body": "I shared this in r/mentalhealth because I post on here about my struggles openly. I did not expect this to get so big.",
      "created_utc": 1747979315.0,
      "score": 1
    },
    {
      "id": "mth8pdo",
      "body": "My lovely, he may need help but that help can't and shouldn't come from you. Him needing help does not give him and excuse to treat you so badly. You need to look after and protect yourself, give yourself the love you deserve by leaving him. What he's doing is abusive. Please take care of yourself",
      "created_utc": 1747837570.0,
      "score": 3
    },
    {
      "id": "mtgbx37",
      "body": "I know it’s easy to say but please do see whether you can find the courage to say he is making me cry and feel really bad and I need to stop the relationship to not spiral down. He needs to find support elsewhere. He’s not respecting you at all and you are kind and even when he’s like this and that shows you are a lovely person but it can also mean people take advantage of your kindness. I hope for you that you can move on and not be hurt by him anymore. I really feel you aren’t able to help him when he’s treating you like this. Big hugs from an internet stranger to a really kind person who can I hope can consider how this relationship is effecting your mental health.",
      "created_utc": 1747825659.0,
      "score": 1
    },
    {
      "id": "mtwa0o3",
      "body": "This doesn’t change the fact you guys should separate though?",
      "created_utc": 1748031287.0,
      "score": 1
    }
  ]
}