{
  "id": "1j5d9co",
  "title": "My wife is about to die. We got married last month.",
  "selftext": "My wife is 27 years old. I am 31. We have no kids. She has lived with several conditions most of her life. \n\nTetralogy of fallot (heart), asthma, pcos etc. \n\nWe've been together 3 years. I married her one month ago. \n\nShe had a procedure to expand the valve on her heart... It was supposed to be a day surgery. Keyhole. Less invasive\n\nShe started coughing up blood. 2 days later they discovered they punctured a lung. She hasn't stopped since then. \n\nThey tried a second procedure to stop the bleeding. Apprently it was successful but she's still coughing up blood. \n\nEverything is happening so fast. All the doctors have become silent and avoidant of me as I started pinging fingers of negligence. I don't blame them fully. She's a complex case but they took too long to admit the mistake and act. \n\nYes she would have needed the procedure anyway but this was supposed to extend her life not shorten it. I wish we never agreed to it. I hate myself for the hope I thought it'd bring. \n\nMy wife is about to die. At 27. She's in a heart failure ward surrounded by people aged 65+.\n\nThis stage of waiting feels like the worst. I've been following her blood test results. Seeing her conditions change. Her body is shutting down. She's been a fighter most of her life. At 27 she's already had 4 open heart procedures. \n\nHer family and friends are all hopeful asking me when she's leaving. I don't know how to tell them that she's not.\n\nMy wife keeps taking about going home. The future. It's just not fair. I keep crying. We just started marriage. Planned the year. I feel robbed. I am scared of the void that is to come. The darkness. \n\nShe is everything to me. My best friend.. I've never met a woman like her. I never will.",
  "created_utc": 1741315144.0,
  "score": 7503,
  "num_comments": 267,
  "url": "https://www.reddit.com/r/offmychest/comments/1j5d9co/my_wife_is_about_to_die_we_got_married_last_month/",
  "comments": [
    {
      "id": "mgg1s0h",
      "body": "Much love and strength to you",
      "created_utc": 1741315649.0,
      "score": 3017
    },
    {
      "id": "mgg8hye",
      "body": "My mom’s chemotherapy resulted in her going into heart failure. I watched her slowly dying in a hospital over the course of a month. Finally, out of any other options, she was approved for a heart transplant. She received a new heart and is cancer free. She just got back from a trip to Italy. Your wife is a fighter, don’t give up on her. You never know what could happen and she needs every ounce of strength you have right now.",
      "created_utc": 1741318043.0,
      "score": 1121
    },
    {
      "id": "mgg6sn3",
      "body": "Hey. I'm really sorry you are going through this but I need you to understand a few things. And I am sorry if I come off as a bit harsh, I do not mean it that way. \n\nThat if the Dr has told you to prepare for the end of her life you should do so. But if they have not. It is for a reason.\nBeing on a heart failure ward is not a bad thing. It does not necessarily mean she is going to die. It means that she is in the place where the drs that she needs are. \n\nCoughing up blood sucks. But the amount she coughs up can makes a huge difference. Is she Coughing up streaks of blood in her sputum? Or is it dripping out of her mouth constantly?  \n\nPlease try not to stress too much. And make plans with her. Having goals to look forward to is a great thing.",
      "created_utc": 1741317429.0,
      "score": 2286
    },
    {
      "id": "mgg1w3u",
      "body": "I am very sorry you are going through this. I hope your wife’s spirit enriches the rest of your days. Be sure to secure an attorney soon. My sympathies.",
      "created_utc": 1741315689.0,
      "score": 705
    },
    {
      "id": "mgg60ax",
      "body": "Oh, honey. What a traumatic position to suddenly find yourself in. If the doctor(s) aren't communicating with you, run your concerns up to administration. This is unacceptable and leaves you in a vulnerable situation.  It may also be in your best interest to get proper legal advice. \n\nIn the meantime, savor your time with your wife. Tomorrow is never promised to any of us, but you happen to know time is moving quickly. Be there for her, comfort her, and make sure she feels all of the love that you've grown for her. Take moments to catch your breath, or cry, feel the anger of this unfair situation, and be ready to talk to a therapist. \n\nAnd when it feels like life is over, remember that you will always be better off for knowing and loving her. ♥️",
      "created_utc": 1741317147.0,
      "score": 169
    },
    {
      "id": "mgg23hn",
      "body": "I’m so sorry. Sending you and her so much love",
      "created_utc": 1741315762.0,
      "score": 107
    },
    {
      "id": "mggykos",
      "body": "Did someone tell you she is dying, or are you assuming that from her labs? Please don’t give up hope. If there was nothing they could do, they would likely talk to you about hospice. \n\nI had a family member end up on a ventilator after complications from sedation during a common procedure. She ended up in the trauma ICU and every day was up and down. The drs were honest with us that they were doing what they could, but couldn’t make any promises. The best advice I can give you is to note your questions in your phone and have them ready when the drs make rounds. Ask about her labs if they concern you, don’t assume anything. I know anxiety is high when you’re waiting for them and you can become forgetful or lose your nerve; a list can help with that. Also, be honest with her family and friends. They deserve a chance to say goodbye if she really is dying. I hope she pulls through.\n\nEdit: I meant to tell you that there were setbacks and it was hell, but my family member made it and was discharged after about 3 weeks.",
      "created_utc": 1741329335.0,
      "score": 49
    },
    {
      "id": "mgg1p4f",
      "body": "I am so sorry. There is nothing I can say to make things better.",
      "created_utc": 1741315620.0,
      "score": 170
    },
    {
      "id": "mgg38vo",
      "body": "I can’t fathom what you’re going through right now. My heart aches for you.",
      "created_utc": 1741316164.0,
      "score": 47
    },
    {
      "id": "mgg39v8",
      "body": "This is so sad. This is absolutely not fair man! Im sorry you are going thru this",
      "created_utc": 1741316173.0,
      "score": 70
    },
    {
      "id": "mgg65nf",
      "body": "So sorry to read this! Does the doctors think she's going home? Or unable to say? Say what you want to say to her, whatever you need to heal in the future. Don't wait too long to get family support too",
      "created_utc": 1741317201.0,
      "score": 23
    },
    {
      "id": "mgg8faz",
      "body": "Be with her. Read books with her, watch movies, share memes. Ask her if there's anything from home she would like like makeup, lotion, hair stuff, or even clothes. \n\n\n\n\nIf she is unable to do any that. Read to her.  Talk to her about anything.  \n\n\n\n\nYou won't get this time back with her. ",
      "created_utc": 1741318016.0,
      "score": 51
    },
    {
      "id": "mgg2szd",
      "body": "I am so very sorry you and your families are going through this.  I know it doesn’t mean much, but I will keep you and your wife in my prayers.  All we really have when things get tough is hope of better things to come, so I hope you aren’t too hard on yourself for hoping the surgery would help.  It sounds like you had every reason for that hope, and that things just made a left turn in ways you didn’t see coming.  This is truly heartbreaking, and your wife sounds like an amazing and strong person.",
      "created_utc": 1741316010.0,
      "score": 24
    },
    {
      "id": "mgg7rvk",
      "body": "Sending you both so much love — so sorry to hear what you’re going through.",
      "created_utc": 1741317782.0,
      "score": 12
    },
    {
      "id": "mgg4w34",
      "body": "I am so sorry. You’re right, this isn’t fair. At all. I wish I had the words to take away an ounce of pain. I’ll say a prayer for you and your bride.",
      "created_utc": 1741316749.0,
      "score": 10
    },
    {
      "id": "mgg5p66",
      "body": "I am so sorry, OP. Not sure if praying holds any weight but I will pray for her so hard and hope she pulls through..",
      "created_utc": 1741317036.0,
      "score": 10
    },
    {
      "id": "mgj05u4",
      "body": "Dear OP,\nI was born with a rare heart congenital heart defect. My parents thought they wouldn’t be able to take me home. Doctors didn’t think I’d survive.\nI’m in my mid 20’s now. I’m still limited by my heart, but I have a good life. I’ve had 9 open heart surgeries and plenty of others.\n\nWhat I mean to say is, even when everything seems dark and hopeless, there can still be a light at the end. I cannot say, that I know how you feel because I don’t, but I think I know how she feels.\nSo I’d like to thank you for being there for her. It means more than you can ever imagine.\n\nObviously, I can’t say what’s going to happen. I hope she will get through this. I’ve noticed that people, who has serious health conditions, is very hell-bent on making it through and live.\n\nPlease remember to talk with someone yourself. A family member, a friend, a nurse, whoever you feel like might be helpful. Not to get solutions, but to receive some comfort yourself. \nTry to talk with one of her doctors and tell them, that you need to know what’s going on. That you’re sick with worry. In my experience, most doctors and/or nurses will understand and answer you to the best of their ability.\n\nTry to laugh and smile with her aswell. It can be difficult, but watching a movie or something lighthearted might help. I usually do that, when I’ve been at the hospital for a longer time, or bring my Steam Deck. Anything to make the time pass and have some sort of fun.\n\nI wish you both the best of luck. Take care.",
      "created_utc": 1741362889.0,
      "score": 10
    },
    {
      "id": "mgg2vk4",
      "body": "Sending positive thoughts. I’m sorry you’re going through this. May peace find you.",
      "created_utc": 1741316036.0,
      "score": 8
    },
    {
      "id": "mgg4fps",
      "body": "my heart broke reading this. I'm so so so sorry that this is all happening right now. you really, really, love her. it's transcendent between you two, and inspiring. you won scoring such a strong wife. things are probably still unfolding tonight, and so many of us wish we can hug you.",
      "created_utc": 1741316587.0,
      "score": 8
    },
    {
      "id": "mgg5fz7",
      "body": "I am sorry for what you are going through \nSending lots of love and prayers for you and your wife\nYou can do it I believe in you, ik times are difficult rn but you gotta be tough rn for your wife\nAnd if you ever need anyone to talk everyone is here for you",
      "created_utc": 1741316945.0,
      "score": 8
    },
    {
      "id": "mgg5o8g",
      "body": "Praying for you both",
      "created_utc": 1741317027.0,
      "score": 9
    },
    {
      "id": "mgqconj",
      "body": "My mom died of heart failure last month. She died because she had a blood clot in her heart that they didn't feel like she would survive if they operated on her.  My husband, has congestive heart failure. He's had it for 10 years.  I say this to say that I know that things are bleak right now.  You are right. Your wife is dying. So are you. As am I.  She doesn't have a stamp on her heel saying when she is leaving this world.  You are her support.  I know that this is hard for you, but you have to be her support.  If she thinks she can make it home, plan with her, dream with her. You can help keep her going.  If you help her to overcome this, she will be your biggest advocate.  If you can't, you will be her best memory.  I'm praying for you friend. God listens whether you believe or not.  Stay strong dear friend.",
      "created_utc": 1741462259.0,
      "score": 6
    },
    {
      "id": "mgg4fsn",
      "body": "Im so sorry. Stay strong with her through her last memories. I hope you find a strong support system with you to go through this",
      "created_utc": 1741316588.0,
      "score": 10
    },
    {
      "id": "mgg2kjx",
      "body": "Sending you both lots of love, strength, and prayers.",
      "created_utc": 1741315927.0,
      "score": 9
    },
    {
      "id": "mgg3h8c",
      "body": "I’m really sorry. Nobody should go through something like this 😔",
      "created_utc": 1741316246.0,
      "score": 4
    },
    {
      "id": "mgg47er",
      "body": "🙏🏻🙏🏻",
      "created_utc": 1741316503.0,
      "score": 5
    },
    {
      "id": "mgg8p08",
      "body": "You are a very loving and caring husband. I am so sorry you’re going through this. It’s so fucking unfair. Sending you strength during this time. I am so very sorry.",
      "created_utc": 1741318114.0,
      "score": 5
    },
    {
      "id": "mghio20",
      "body": "Have they explicitly told you she’s going to die?",
      "created_utc": 1741341253.0,
      "score": 5
    },
    {
      "id": "mgj8x59",
      "body": "Has the doctor said she is about to die? This sounds like a fixable situation. I would expect her to continue coughing up old blood for awhile. New blood is different, and it might be reparable. \n\nDon’t point fingers at the docs. It won’t help anyone’s situation at all, and actually makes the communication situation worse as you have learned. Don’t do that to anyone on the team, your wife, or yourself.\n\nI’m sorry both of you are going through this.",
      "created_utc": 1741365412.0,
      "score": 6
    },
    {
      "id": "mgjuxb9",
      "body": "Give her all the love, warmth, and positivity you can, when you can, to her. It will mean so much to the both of you \"in the now.\" \n\nThat's all any of us have, is the now. Make the most of it. Much love and light to you and yours, OP.",
      "created_utc": 1741371673.0,
      "score": 4
    },
    {
      "id": "mgkynug",
      "body": "I am so sorry this sounds like a very difficult time for you!!! I hope she does get better. \n\nThe coughing up blood does not sound unreasonable. If they successfully repaired it, it might just be residual from the initial injury. Especially if she has trauma from being extubated and reintubated.\n\nHas the provider spoken to you about her dying or the general prognosis? As far as her labs, have you been able to speak with the people in her care and interpreting those results? I think we usually look for trends rather than singular values itself. Try to ask questions if you can! (Im assuming you have). That being said everyone is different so the doctors might not have the best bedside manner. Very difficult situation to be in",
      "created_utc": 1741383862.0,
      "score": 5
    },
    {
      "id": "mgg36jd",
      "body": "Sending prayers and strength 🙏🏽",
      "created_utc": 1741316142.0,
      "score": 5
    },
    {
      "id": "mgg2md2",
      "body": "Praying 🙏.",
      "created_utc": 1741315945.0,
      "score": 7
    },
    {
      "id": "mgg31eh",
      "body": "I'm so sorry",
      "created_utc": 1741316092.0,
      "score": 3
    },
    {
      "id": "mgg48uz",
      "body": "i'm so sorry.",
      "created_utc": 1741316517.0,
      "score": 3
    },
    {
      "id": "mgg4p2e",
      "body": "💔",
      "created_utc": 1741316679.0,
      "score": 3
    },
    {
      "id": "mgg57g4",
      "body": "I’m so sorry.",
      "created_utc": 1741316860.0,
      "score": 3
    },
    {
      "id": "mgg5to3",
      "body": "I'm so deeply sorry for you",
      "created_utc": 1741317081.0,
      "score": 3
    },
    {
      "id": "mgg6647",
      "body": "I’m so sorry. Sending you giant bear hugs and hoping you have a shoulder to cry on right now. I cannot begin to imagine how you feel, I hope you eventually find peace.",
      "created_utc": 1741317205.0,
      "score": 3
    },
    {
      "id": "mgg6tgc",
      "body": "I am so, so sorry to read this.  Watching someone decline while begging for medical professionals to believe you is truly a nightmare.  I have no words to make this better, but I am holding space for you both tonight.",
      "created_utc": 1741317437.0,
      "score": 3
    },
    {
      "id": "mgg6zhh",
      "body": "I am so, so sorry for you and for your wife. She sounds like an amazing person. I know her family thinks she’s leaving the hospital, but I think they need to know sooner than later what is happening so they can spend as much time with her as possible, if that is something she would want.",
      "created_utc": 1741317497.0,
      "score": 3
    },
    {
      "id": "mgg73d2",
      "body": "I’m so sorry and you’re doing your best.dont blame yourself for any of this.",
      "created_utc": 1741317536.0,
      "score": 3
    },
    {
      "id": "mgg76qw",
      "body": "I am so sorry.",
      "created_utc": 1741317568.0,
      "score": 3
    },
    {
      "id": "mgg7z3p",
      "body": "My heart goes out to you and your beloved",
      "created_utc": 1741317854.0,
      "score": 3
    },
    {
      "id": "mgg811k",
      "body": "sending you love hugs and thoughts..",
      "created_utc": 1741317873.0,
      "score": 3
    },
    {
      "id": "mgg84rn",
      "body": "Sending you a gentle hug.",
      "created_utc": 1741317910.0,
      "score": 3
    },
    {
      "id": "mgg8f3o",
      "body": "Sending you both much love, peace, and comfort.",
      "created_utc": 1741318014.0,
      "score": 3
    },
    {
      "id": "mggj49f",
      "body": "What is her name ? I will pray for her",
      "created_utc": 1741322185.0,
      "score": 3
    },
    {
      "id": "mggpihe",
      "body": "I don’t have any words; I’m so sorry. I just hope you’re able to find some comfort during everything going on",
      "created_utc": 1741324963.0,
      "score": 3
    },
    {
      "id": "mggt2te",
      "body": "I am so sorry it truly sucks my friend. She is too young to leave you.",
      "created_utc": 1741326587.0,
      "score": 3
    },
    {
      "id": "mggtst0",
      "body": "I’m so sorry for you and her. Sending a hug and strength to both of you.",
      "created_utc": 1741326934.0,
      "score": 3
    },
    {
      "id": "mggtzh5",
      "body": "Please let her family know what is going on. I’m sorry this is happening",
      "created_utc": 1741327022.0,
      "score": 3
    },
    {
      "id": "mghqo89",
      "body": "Let her family know they need to come. Don’t take that from them because you are hurting. There is an obligation to her to tell them.",
      "created_utc": 1741345990.0,
      "score": 3
    },
    {
      "id": "mgiuun7",
      "body": "I’m a nurse who works on a cardiac ward please inbox me if you need someone to vent to, thoughts are with you & your wife",
      "created_utc": 1741361344.0,
      "score": 3
    },
    {
      "id": "mgkaph0",
      "body": "Do not give up hope dude. I understand this is a scary time and it certainly is. But don’t give up keep fighting.",
      "created_utc": 1741376185.0,
      "score": 3
    },
    {
      "id": "mgkhbwu",
      "body": "I have heart failure amongst other heart problems, (a leaky valve, left bundle block, cardiomyopathy) don't think the worst or lose hope.\n\n I met a woman who had lived with it for 30 years at the hospital once. \n\nYour wife isn't old, the Drs will do all they can to keep her going as long as possible. Make plans with her and joke about it, don't write her off. \n\nModern medicine can do amazing things.",
      "created_utc": 1741378120.0,
      "score": 3
    },
    {
      "id": "mgkv4iz",
      "body": "I know you are in an impossible position. When mom was dying from sepsis and in a coma. They were preparing us to pull the plug. I spent every minute talking to her. I told her that what was going on and why. I would tell her, her stats. I would say her heart rate and blood pressure were good.  I told she needed to just rest. \n She pulled through",
      "created_utc": 1741382771.0,
      "score": 3
    },
    {
      "id": "mgld0it",
      "body": "Big hugs brother, this sounds damn tragic... i wish you all the best. It sounds hard but the best thing for you and your mental health is to accept it and even if its hard, you will get through this. You are a warrior and just like your love you will endure this, take her as an example and try to make the lives of yours and others a better one, so maybe you can heal from this one, you're a strong one keep it up my man!!!",
      "created_utc": 1741388366.0,
      "score": 3
    },
    {
      "id": "mgnd205",
      "body": "So sorry to hear this. Sending love and light💗",
      "created_utc": 1741417415.0,
      "score": 3
    },
    {
      "id": "mgg23ys",
      "body": "Praying",
      "created_utc": 1741315767.0,
      "score": 7
    },
    {
      "id": "mgg36yf",
      "body": "[deleted]",
      "created_utc": 1741316146.0,
      "score": 8
    },
    {
      "id": "mghqbr3",
      "body": "Please know that is fellow Redditors are hoping for the best regardless of the likelihood.  Please reach out to some of the kinder commenters if you need a friend to talk to.  Many would listen and support you.  As a widow, I know I would.",
      "created_utc": 1741345796.0,
      "score": 4
    },
    {
      "id": "mgg58tu",
      "body": "I am so sorry, this is incredibly difficult for you and i wish you and your wife peace, I hope you know you have done a lot and you can’t blame yourself for something like this. Like you said she would’ve needed the surgery no matter what, please don’t blame yourself And please consult with a Mal practice lawyer if you truly feel they did something out of negligence and note and save every interaction with them, I will pray for her and you. please try to seek therapy and see and talk to your family as much as possible. May god and the universe be with you.",
      "created_utc": 1741316874.0,
      "score": 2
    },
    {
      "id": "mgg5y82",
      "body": "I don’t know what to say OP but just know that we’re with you in spirit and strength. Much love to you and your wife! \n\n❤️",
      "created_utc": 1741317126.0,
      "score": 2
    },
    {
      "id": "mgg8rcw",
      "body": "I'm sorry.",
      "created_utc": 1741318138.0,
      "score": 2
    },
    {
      "id": "mgg8uze",
      "body": "I’m so sorry to read this, man. Strength and prayers to you.",
      "created_utc": 1741318175.0,
      "score": 2
    },
    {
      "id": "mgg97sv",
      "body": "My heart goes out to you and your wife.",
      "created_utc": 1741318306.0,
      "score": 2
    },
    {
      "id": "mgga49a",
      "body": "💐",
      "created_utc": 1741318639.0,
      "score": 2
    },
    {
      "id": "mgga8a2",
      "body": "I'm so so very sorry.... I have no words of comfort that would be able to pierce through the sorrow you must feel in your heart and soul.... I'm sending all my love to you and know we are all here for you...💝💕",
      "created_utc": 1741318680.0,
      "score": 2
    },
    {
      "id": "mggaxu8",
      "body": "Crying with you, I can’t imagine building a life with someone just for something to come along and tear it all down. Grieve but be strong and continue for her, it’s what your wife would have wanted. Sending love ❤️",
      "created_utc": 1741318944.0,
      "score": 2
    },
    {
      "id": "mggbci0",
      "body": "Sending you strength and grace and all the love for your wife…",
      "created_utc": 1741319097.0,
      "score": 2
    },
    {
      "id": "mggbxkd",
      "body": "I’m so sorry 🙏🏾please talk to the palliative care team at the hospital , it’s hard but they are great with resources and support",
      "created_utc": 1741319315.0,
      "score": 2
    },
    {
      "id": "mggclfp",
      "body": "It’s not fair, it’s so not fair. I’m so sorry. Cherish the time you are having together now just in case she doesn’t recover. God I am so sorry.",
      "created_utc": 1741319568.0,
      "score": 2
    },
    {
      "id": "mggcvm7",
      "body": "So sorry. Sending hugs and strength ❤️",
      "created_utc": 1741319677.0,
      "score": 2
    },
    {
      "id": "mggcvpd",
      "body": "I am so sorry.\n\nStay strong now. Grieve later. Find solace in friends and family.",
      "created_utc": 1741319678.0,
      "score": 2
    },
    {
      "id": "mggonaj",
      "body": "Fellow Tetralogy of Fallot baby here. Please don’t feel regret in your decisions. You made decisions based on the information given that is believed to help not hurt. I’m not sure if you or your wife have faith in God but I will keep both of you in my prayers.",
      "created_utc": 1741324573.0,
      "score": 2
    },
    {
      "id": "mggp0iw",
      "body": "I am so sorry you are going through this, but please, for your sake and her families sake, please tell them the truth, there will be extreme resentment if they find out you knew and didn’t give them the chance to say their goodbyes. You can also be supported in this grief sharing it with people who love your wife as much as you do.",
      "created_utc": 1741324737.0,
      "score": 2
    },
    {
      "id": "mggpavd",
      "body": "I am sorry you have to go through this. You might want to let family know what's going on so they can make their peace with it, and you all can support each other.",
      "created_utc": 1741324867.0,
      "score": 2
    },
    {
      "id": "mggpg8a",
      "body": "Your heart must be breaking. ((Big hugs)) from a stranger from across the world. I’m so sorry for you both to have to face this at such a young age. Sometimes life just isn’t fair. 💐💐",
      "created_utc": 1741324935.0,
      "score": 2
    },
    {
      "id": "mggriwk",
      "body": "I’m so sorry Buddy, and can’t even imagine the pain you’re going through. I sincerely hope and pray she starts healing and going in the right direction, miraculously beating any odds that seem to be stacking against her with these recent procedures.\n\nI know it’ll be VERY hard, but please stay strong for her, and feed into her optimism when she seems to have it. I don’t think people realize how important that aspect is….. the more she believes something good will happen, it’s more likely that it can! 🙏",
      "created_utc": 1741325870.0,
      "score": 2
    },
    {
      "id": "mggu8uj",
      "body": "This is so brutal. I’m glad you at least found love.",
      "created_utc": 1741327148.0,
      "score": 2
    },
    {
      "id": "mgh9k1f",
      "body": "You need to bring other people in. You need support. Please reach out to her family and come together. \n\nGrief is traumatizing without support and resources. \n\n\nI hope you find some peace of mind in this lifetime.",
      "created_utc": 1741335551.0,
      "score": 2
    },
    {
      "id": "mghdva3",
      "body": "I am so sorry this is happening to you both. I can't even begin to imagine how horrific this must feel. You clearly love her so much, and she's lucky to have a supportive and caring husband in her last moments. Take it day by day. Try not to grieve her in the time that she is still here. Do your best to get some therapy set up for when the time comes, because even when you know it's coming, death hits hard. \n\nI wish there was something we could do for you. You have every right to feel angry and cheated and robbed by life, but try your best to savour every moment you have left with her <3",
      "created_utc": 1741338239.0,
      "score": 2
    },
    {
      "id": "mghmrwc",
      "body": "I’m so very sorry.  How difficult for both you and her.  If the doctors haven’t told you she only has a few days left to live though, I wouldn’t assume she’s about to die.  Being in the heart failure ward might be to help her so she can get better.",
      "created_utc": 1741343761.0,
      "score": 2
    },
    {
      "id": "mghndhz",
      "body": "I’m so sorry for you and her.",
      "created_utc": 1741344112.0,
      "score": 2
    },
    {
      "id": "mgho245",
      "body": "I'm so sorry man",
      "created_utc": 1741344506.0,
      "score": 2
    },
    {
      "id": "mghsptc",
      "body": "Sending you so much love OP, this sounds horrible and I really really wish there was something I could do other than offering my sincere sympathy. I hope all our comments help you feel less alone ❤️",
      "created_utc": 1741347088.0,
      "score": 2
    },
    {
      "id": "mghvpo2",
      "body": "Heartbreaking, I can’t imagine man. Much love to you and her.",
      "created_utc": 1741348598.0,
      "score": 2
    },
    {
      "id": "mghzfqd",
      "body": "I say this not being trite - I empathise. The grief is unconscionable. People will say that grief is the price you pay for love and that the grief is proportionate to how much you loved. We cannot love half-heartedly. Please take courage knowing that she is so so so loved. As are you. \n\nI am devastated. Your wife has a broken heart and your heart is breaking.  \n\nThank you thank you for sharing yourself. Please keep connected here. We are here for you. It would be an honour to play a tiny part. ❤️",
      "created_utc": 1741350318.0,
      "score": 2
    },
    {
      "id": "mgjclzu",
      "body": "Some advice: I spent 2 months at the bedside of a friend in ICU, Looking back I can see clearly that I needed someone to be there for me also. Someone to help me make decisions and to help me hold on.  If you don’t have anyone you should talk to a patient advocate. Ask a nurse, they can direct you to one. A patient advocate is usually a nurse or social worker who can explain some of the details but also can find someone for you to talk to and bounce ideas off of.  You don’t have to shoulder this burden alone.",
      "created_utc": 1741366463.0,
      "score": 2
    },
    {
      "id": "mgjraf0",
      "body": "There is nothing anyone here can say that will lessen the pain you're going through. That said, I feel for you my friend. Life has been exceptionally cruel to you and your wife. I will offer you one idea which may give you some tiny amount of solace.  Change your frame of reference, do not look at this as we had so little time, but instead focus on the fact that you got to experience any of the joys of loving and living and marrying someone you feel was your life partner and your best friend. Give into the idea that a small amount of amazing joy is better that missing out on that experience.  I am sorry life put you in this situation and I hope it turns out for the best, but I also send you my best wishes and hopes for a conclusion that gives you some solace.",
      "created_utc": 1741370641.0,
      "score": 2
    },
    {
      "id": "mgk6o07",
      "body": "I am so sorry about this I can’t begin to imagine the depth of your pain right now. What you and your wife are going through is unfair beyond words, and I am so incredibly sorry. You’ve given her love, companionship, and devotion things that truly matter. She is not alone in this and that must bring comfort. I hope she’s not in a lot of pain and that you get every moment you can with her. Just know that your love for her is something real and powerful, and that matters",
      "created_utc": 1741375015.0,
      "score": 2
    },
    {
      "id": "mgl6o46",
      "body": "First of all big hugs brother. I hope your close family and friends are also asking how you are doing. \n\nYour response of pointing fingers is very normal from someone who may be grieving while your spouse is still battling to stay alive. However, most doctors if they think her prognosis is bad they will talk to you so you can be prepared. If this has not happened yet, don't assume she will die, think of it as her body just went through massive trauma and it needs time to heal. Don't lose hope just yet. Please take care of yourself, I look forward to a happier update.",
      "created_utc": 1741386342.0,
      "score": 2
    },
    {
      "id": "mgm90bq",
      "body": "Brother I'm so sorry.",
      "created_utc": 1741399537.0,
      "score": 2
    },
    {
      "id": "mgmrr1v",
      "body": "🤍🤍🤍",
      "created_utc": 1741406796.0,
      "score": 2
    },
    {
      "id": "mgn65lq",
      "body": "Many hugs, much strength and love.",
      "created_utc": 1741413599.0,
      "score": 2
    },
    {
      "id": "mgothww",
      "body": "Don't give up on her, she's still fighting which means there's still a chance. If you give up she might give up, and recovering requires her to have the fight. If there were truly no hope she'd be in hospice. I'm not even religious, but im saying a prayer for you. And sending so so so much love",
      "created_utc": 1741444993.0,
      "score": 2
    },
    {
      "id": "mgs0pha",
      "body": "I'm so incredibly sorry! My heart goes out to you both! I hope she has great comfort and peace as she goes through her dying process. I hope you have support and comfort as you grieve. I'm so sorry.",
      "created_utc": 1741482481.0,
      "score": 2
    },
    {
      "id": "mgt3bic",
      "body": "We're not promised tomorrow. But I hope like hell you get it!",
      "created_utc": 1741497665.0,
      "score": 2
    },
    {
      "id": "mgvkaz9",
      "body": "The situation sucks there's no way around it. It's absolutely terrible and I'm so sorry. One thing I will say about that void though... It's not quite as bad as you think it's going to be. You'll grieve. You'll have moments of incredible pain. But she's not just going to disappear into a vacuum when she dies. You'll still have memories you'll still feel her love she'll still send you signs that she's up there watching you and rooting you on. Someone told me that when my dad was dying and I thought they were crazy but it turned out to be true. I still have dreams that he didn't really die when he did and he's really been here all this time but now he's dying and I think it's because I was expecting the exact same thing you are when he died and it never came. I miss his physical presence here, but I still feel like I've had my dad all this time ❤️",
      "created_utc": 1741538993.0,
      "score": 2
    },
    {
      "id": "mgxy46j",
      "body": "Hello I am 24F with Fallot too and a med student. We ARE hell of a fighters so I am sending love and strength to you and your wife.",
      "created_utc": 1741566068.0,
      "score": 2
    },
    {
      "id": "mgynrtg",
      "body": "Any update OP",
      "created_utc": 1741575231.0,
      "score": 2
    },
    {
      "id": "mgz3oj6",
      "body": "This sounds similar to my sister's experience.\nShe (chronically ill, heart problems) went in for something and other things developed.  \nIt was hopeless and hard to remain optimistic, but I knew visiting brought her joy so I tried to keep things happy.\n\n\nI remember telling her that she was very likely not going to survive, which was very hard. She thanked me for being honest. \nA few days after that she slipped into a coma and died a week later, four weeks after being admitted.",
      "created_utc": 1741582028.0,
      "score": 2
    },
    {
      "id": "mh0mh49",
      "body": "I wish I could hug you, OP. I'm not a doctor or a lawyer or anything. I just want to reach out and wish you courage in the face of this adversity.\n\nKeep loving her.",
      "created_utc": 1741612531.0,
      "score": 2
    },
    {
      "id": "mhcbovc",
      "body": "My sister is dealing with heart problems. We are trying to get her in an herbal treatment routine before she has to call in again.",
      "created_utc": 1741758971.0,
      "score": 2
    },
    {
      "id": "mhfyunj",
      "body": "I’ll pray for her, even if you’re not religious",
      "created_utc": 1741809779.0,
      "score": 2
    },
    {
      "id": "mhjaamq",
      "body": "There is no ideal advice for a situation like this one. But I want to say: spend time with her. As much as you can. Talk to her if she can speak. You need to be with her more than you need to be worrying to no end about what could be done and what should have been done. All of this is not your fault. It may not be the doctors fault either. Now is the time to be there for her. And nothing else. ",
      "created_utc": 1741856226.0,
      "score": 2
    },
    {
      "id": "mggbzzj",
      "body": "I'm not using my strength or positive thoughts at the moment. They are both at the top of their game and won't let you down. I'd like you to have them, for as long as you need, my strength will keep you going for as long as you need, it won't weaken or ever run out. It's kept me going for 50 years. My positive thoughts are magical and come with Faith, Hope & Courage in abundance. Both of these I gift you and I know if you accept them, they will work for you like they have for me. 💙💛🧡💜",
      "created_utc": 1741319340.0,
      "score": 3
    },
    {
      "id": "mgg4ufc",
      "body": "I would definitely make sure they pay for puncturing her lung, a malpractice that is causing your love of your life to die is evil",
      "created_utc": 1741316732.0,
      "score": 7
    },
    {
      "id": "mgg8luy",
      "body": "May God give you the miracle you both deserve here.\n\nI'm sending all the positive and healing energy that God has granted me directly to her now.\n\nDo not **ever** underestimate the power of belief. Believe with all your heart that your wife will be saved. Try your absolute hardest to believe that; focus all your mental energies on it. Meditate on it.\n\nMay God grant you both a miracle.",
      "created_utc": 1741318083.0,
      "score": 3
    },
    {
      "id": "mgg3mlf",
      "body": "I’ll be praying that Jesus heals your wife.",
      "created_utc": 1741316298.0,
      "score": 1
    },
    {
      "id": "mghjbg4",
      "body": "Pray.\n\nI dunno if you believe there's a God, but it seems you truly love this woman. Try every possible solution, no matter how ridiculous it sounds, to save her.\n\nIt takes nothing away and it costs nothing.\n\nJust pray.",
      "created_utc": 1741341661.0,
      "score": 3
    },
    {
      "id": "mgg4grd",
      "body": "I’m so sorry. Life isn’t fair sometimes. Hugs and your wife will forever be with you. Just know that.",
      "created_utc": 1741316597.0,
      "score": 2
    },
    {
      "id": "mggasxv",
      "body": "As the others, I am terribly sorry for you and your wife. I almost lost mine during and immediately following the birth of our son, due to some poor decision-making and execution on the part of the doctors, but obviously that pales in comparison to your situation. I hope that whatever happens you're able to spend the time together",
      "created_utc": 1741318894.0,
      "score": 2
    },
    {
      "id": "mghctz3",
      "body": "im currently sick and i just bawled my eyes out to this post. i am SO sorry, my bf and i are currently going through some issues and i showed him this post and it makes you realize how important it is to cherish your loved ones. please stay strong.",
      "created_utc": 1741337587.0,
      "score": 2
    },
    {
      "id": "mgg6wkn",
      "body": "You are not alone. When you can? Talk to a lawyer. It doesn't fix this but if you are in the US this means you shouldn't eat the costs of losing your partner. For anywhere they need to cover the costs for this and in many places this is how you protect the next person. None of this fixes things because they cannot be. I find it helps me with my own grief to remember too that Grief is love without somewhere to go. That pain is because of how much you love her.",
      "created_utc": 1741317467.0,
      "score": 2
    },
    {
      "id": "mggd21p",
      "body": "I am so, so sorry, OP.  I am sending hugs to your and your wife.",
      "created_utc": 1741319744.0,
      "score": 1
    },
    {
      "id": "mggdbvc",
      "body": "This is going to be hard. The love of your life taken away so quickly. Please find love in family and express your emotions. Find the strength to love her till she fights and know that the love of her life stood beside her through everything.",
      "created_utc": 1741319849.0,
      "score": 1
    },
    {
      "id": "mggdnd7",
      "body": "I'm so sorry brother, I'll keep you both in my prayers.",
      "created_utc": 1741319971.0,
      "score": 1
    },
    {
      "id": "mgge3dm",
      "body": "Thoughts and prayers. What is her first name so I can pray for her.",
      "created_utc": 1741320141.0,
      "score": 1
    },
    {
      "id": "mggenb6",
      "body": "I am so sorry.  Be there for her, then take it one day at a time and don't make drastic changes at first.",
      "created_utc": 1741320357.0,
      "score": 1
    },
    {
      "id": "mggfnt1",
      "body": "Fuck OP, I know how much it hurts, I've lost half a dozen family members in the past 8 years. \n\nI know it seems hopeless right now, but it's not over til it's over. These types of things can change very quickly and you never know what could happen tomorrow. \n\nBe her strength in this time; love her, laugh with her, cry with her, and *hope* with her. Help her take care of herself, make sure she stays hydrated and eats. Don't tell yourself that this is the end, it'll just make things harder and trust me, she needs you to fight this just as much as she is. If that day does come, at least you know that you fought with her, and gave her comfort when she needed it most. \n\nThere is still hope, and it's important to grab onto it with all your might and use it to advocate for the woman you love.",
      "created_utc": 1741320758.0,
      "score": 1
    },
    {
      "id": "mggg78w",
      "body": "I’m so sorry.",
      "created_utc": 1741320973.0,
      "score": 1
    },
    {
      "id": "mgggzwe",
      "body": "Sending you love in this awful time",
      "created_utc": 1741321299.0,
      "score": 1
    },
    {
      "id": "mgghegu",
      "body": "Praying for you and your wife. No matter what happens you will persevere through",
      "created_utc": 1741321465.0,
      "score": 1
    },
    {
      "id": "mggi48f",
      "body": "Sending lots of love 🤍",
      "created_utc": 1741321762.0,
      "score": 1
    },
    {
      "id": "mggjh0n",
      "body": "This is heart breaking I’m so sorry",
      "created_utc": 1741322333.0,
      "score": 1
    },
    {
      "id": "mggm792",
      "body": "🙏🏻🐈",
      "created_utc": 1741323495.0,
      "score": 1
    },
    {
      "id": "mggnz73",
      "body": "I’m so sorry, I hope some miracle can happen to save her.. spend all the time you can together trying to create fun through this chaos. Sending you love !",
      "created_utc": 1741324276.0,
      "score": 1
    },
    {
      "id": "mggxtry",
      "body": "Please don’t give up hope. Tell your wife how strong she is and that you are not giving up on her!",
      "created_utc": 1741328938.0,
      "score": 1
    },
    {
      "id": "mggxx9y",
      "body": "please stay strong this is a very difficult heartbreaking situation. keep yourself together and enjoy the moment you have :(",
      "created_utc": 1741328989.0,
      "score": 1
    },
    {
      "id": "mgh3tsa",
      "body": "I'm so incredibly sorry. Being someone whose life has been riddled with pain and loss. The only thing that helped me through the dark transitions was to feel and live through the emotions, both good and bad and not letting illusions, conditioning, projections affect you much.",
      "created_utc": 1741332197.0,
      "score": 1
    },
    {
      "id": "mgha15k",
      "body": "Oh my darling. I hope you are okay. I am so sorry for what you are going through.",
      "created_utc": 1741335840.0,
      "score": 1
    },
    {
      "id": "mghbykn",
      "body": "Sending strength your way.",
      "created_utc": 1741337036.0,
      "score": 1
    },
    {
      "id": "mghqm7k",
      "body": "Absolutely heartbreaking. No pun intended. \n\nStay strong my dude ❤️",
      "created_utc": 1741345957.0,
      "score": 1
    },
    {
      "id": "mghqmf2",
      "body": "I wish you much love and strength in these very hard times. But I wanna give some advise. Call her family and tell them, I know that’s gonna be hard but if you don’t, you’ll regret it. When my grandmother was dying in the hospital and passed away a few months ago, my grandpa quickly texted all her brothers and sisters (she had like 8 and they all sadly never really cared about her) and they are still mad that my grandfather didn’t call them.\nSo call her family so they know what’s going on and so they can say goodbye to her",
      "created_utc": 1741345961.0,
      "score": 1
    },
    {
      "id": "mgi1erb",
      "body": "I’m so sorry OP. I can’t imagine how heartbreaking this must be for you. You’re already grieving, and that’s so incredibly hard. I hope you can give yourself grace in this moment—there’s no right or wrong way to feel. \nNo matter what happens, some things are beyond your control, but what you can do is cherish the time you have together. Focus on the love you share, the memories you’ve built, and being present with her. Thinking about the future without her may feel unbearable right now, and that’s okay. Just take it moment by moment. Wishing you strength and comfort.",
      "created_utc": 1741351171.0,
      "score": 1
    },
    {
      "id": "mgi1gnd",
      "body": "Sending love and positivity to you both.",
      "created_utc": 1741351193.0,
      "score": 1
    },
    {
      "id": "mgi4va5",
      "body": "I am so so sorry. This is heartbreaking. No one knows how u feel. Keep that ray of hope. She deserves it you deserve it. Miracles happen. Please take care sending you wishes and luck. ❤️🧿",
      "created_utc": 1741352582.0,
      "score": 1
    },
    {
      "id": "mgi7ffe",
      "body": "I cant even begin to imagine your pain op. Stay strong. I don’t know if you are a believer or not but I’d pray for your wife’s wellbeing and yours too ♥️ Don’t lose hope!",
      "created_utc": 1741353575.0,
      "score": 1
    },
    {
      "id": "mgidqd2",
      "body": "sending hope",
      "created_utc": 1741355835.0,
      "score": 1
    },
    {
      "id": "mgihqln",
      "body": "So sorry , this is heartbreaking and sending you both lots of love and prayers",
      "created_utc": 1741357208.0,
      "score": 1
    },
    {
      "id": "mgii0cw",
      "body": "So sorry... Sending you a massive air hug sir.",
      "created_utc": 1741357298.0,
      "score": 1
    },
    {
      "id": "mgik12f",
      "body": "I had my brother in icu and he recovered after a car crash when he was young. I was never close to him but this post reminds me of that. I think there’s a lot of posters who are saying good things to help you and I think to go with it. I also say if they aren’t telling you to prepare then maybe that’s a good thing. With my dad all I did was ask how long and they didn’t give us a straight answer but their face said enough. However you can tell with the mood of the person what they will talk with you about. Wish you well. Maybe they are trying to hope she recovers by not saying anything either… 🍀",
      "created_utc": 1741357969.0,
      "score": 1
    },
    {
      "id": "mgiko0s",
      "body": "This is very traumatic, but do not give up hope you guys just got married in this happened. This is going to make your marriage so solid! Prepare for your protection over both of you and that the surgeons and doctors and nurses hands are guided by God to heal her! Good luck I pray that this just gives your marriage to strong foundation!",
      "created_utc": 1741358177.0,
      "score": 1
    },
    {
      "id": "mgip94i",
      "body": "You feel robbed because you are being robbed of the life you would both have. I wouldn’t be able to handle the death of my wife, so I’m hoping you are stronger than me. I’ll be thinking about you and her.",
      "created_utc": 1741359636.0,
      "score": 1
    },
    {
      "id": "mgiqui4",
      "body": "Praying for you and your wife",
      "created_utc": 1741360133.0,
      "score": 1
    },
    {
      "id": "mgirdjc",
      "body": "You have made her life better and happier. Hang on with that.",
      "created_utc": 1741360296.0,
      "score": 1
    },
    {
      "id": "mgitl5y",
      "body": "I'm sorry for what you're going through.",
      "created_utc": 1741360967.0,
      "score": 1
    },
    {
      "id": "mgj44on",
      "body": "Sending my best wishes and I really hope she pulls through. \n\nI really, really hope that you won’t need this advice. That being said, document every communication, document labs, ask for copies of everything. Ask people to explain things in written communications (like email them through her chart). But don’t obsess. Spend your time with your wife.",
      "created_utc": 1741364043.0,
      "score": 1
    },
    {
      "id": "mgj85oc",
      "body": "nothing but love and hugs to you",
      "created_utc": 1741365194.0,
      "score": 1
    },
    {
      "id": "mgjn7pm",
      "body": "Sending you & your family warm thoughts during this challenging time.",
      "created_utc": 1741369493.0,
      "score": 1
    },
    {
      "id": "mgjrri0",
      "body": "🥺",
      "created_utc": 1741370778.0,
      "score": 1
    },
    {
      "id": "mgjzdf9",
      "body": "So sorry for this. It’s not fair. ",
      "created_utc": 1741372940.0,
      "score": 1
    },
    {
      "id": "mgk1914",
      "body": "I’m so sorry you are having to go through this. Sending over all the love and strength.",
      "created_utc": 1741373465.0,
      "score": 1
    },
    {
      "id": "mgke0as",
      "body": "i’m so sorry",
      "created_utc": 1741377149.0,
      "score": 1
    },
    {
      "id": "mgkpvd1",
      "body": "I think you should be asking how likely it is for her heart to recover and if it’s irreversible if she is a candidate for heart transplant.",
      "created_utc": 1741380658.0,
      "score": 1
    },
    {
      "id": "mgl63je",
      "body": "I’m so sorry OP",
      "created_utc": 1741386161.0,
      "score": 1
    },
    {
      "id": "mglcwln",
      "body": "Sending so much love to you and your wife, life is so cruel but to know love is the greatest gift of all <3",
      "created_utc": 1741388331.0,
      "score": 1
    },
    {
      "id": "mglg3q8",
      "body": "Brother😢",
      "created_utc": 1741389398.0,
      "score": 1
    },
    {
      "id": "mgmrwo6",
      "body": "I am SO sorry. :( Wishing you and your wife strength and much love.",
      "created_utc": 1741406862.0,
      "score": 1
    },
    {
      "id": "mgmupey",
      "body": "How is she doing today ? (Praying for the both of you constantly)",
      "created_utc": 1741408097.0,
      "score": 1
    },
    {
      "id": "mgmz0m4",
      "body": "I’m so sorry you’re going through this",
      "created_utc": 1741410085.0,
      "score": 1
    },
    {
      "id": "mgnktvo",
      "body": "My thoughts are with both of you.",
      "created_utc": 1741422097.0,
      "score": 1
    },
    {
      "id": "mgnn7lj",
      "body": "I am so sorry, for both you and your wife.",
      "created_utc": 1741423610.0,
      "score": 1
    },
    {
      "id": "mgny9ik",
      "body": "Sending you both love. I'm truly sorry you're going through this. ",
      "created_utc": 1741430633.0,
      "score": 1
    },
    {
      "id": "mgnycws",
      "body": "Brother hear me out: you will need to see a therapist. The sooner the better. This kind of conversation deserves a special place with a professional, and Reddit is ok to vent but treat yourself right and go talk to a specialist.",
      "created_utc": 1741430691.0,
      "score": 1
    },
    {
      "id": "mgo017p",
      "body": "What ever you do... Tell the family and friends now before it's too late. It's going to be hard, but not as hard as if people find out you knew she was dying and you didn't tell them.",
      "created_utc": 1741431703.0,
      "score": 1
    },
    {
      "id": "mgo4v93",
      "body": "So sorry for you.",
      "created_utc": 1741434521.0,
      "score": 1
    },
    {
      "id": "mgp76kx",
      "body": "The doctors are avoiding you because the know they screwed up. \nThis won’t help your wife but sue them for malpractice.",
      "created_utc": 1741449462.0,
      "score": 1
    },
    {
      "id": "mgpc8cc",
      "body": "So have the drs told you she is dying? Or is this a fear and you’re watching it happen?  I would look into a lawyer and see about them taking her case.",
      "created_utc": 1741451004.0,
      "score": 1
    },
    {
      "id": "mgptrye",
      "body": "This is a tragedy. But don't make it hell for yourself by thinking of the have nots and the injustice. This is your destiny and all you can do is focus on what you can control (which is a lot more than you think). She's already in so much pain, you should remain strong for her and stop thinking negatively like this, it will only prolong the suffering instead of either finding an alternative solution for her problem (best case), or alleviating her stress by being positive in her final moments (worst case). Being negative like this also makes you vulnerable to predatory practitioners, and you just can't allow that as her primary caregiver. Stay strong my friend, you can handle this. Your wife is young and resilient, you have to trust and support her and do your best to cover grounds on all fronts in giving her the best life possible.",
      "created_utc": 1741456423.0,
      "score": 1
    },
    {
      "id": "mgrfmpu",
      "body": "Sending my prayers to you.",
      "created_utc": 1741474970.0,
      "score": 1
    },
    {
      "id": "mgxk72k",
      "body": "My biggest condolences. I’m sorry she have to leave so early. ",
      "created_utc": 1741561282.0,
      "score": 1
    },
    {
      "id": "mhjqmat",
      "body": "Sending peace and love.",
      "created_utc": 1741865390.0,
      "score": 1
    },
    {
      "id": "mhk0ut2",
      "body": "It may not be likely that she recovers.\n\n\nBut miracles for happen. You , OP, are one yourself.\n Bless you sir.🙏🏾",
      "created_utc": 1741869697.0,
      "score": 1
    },
    {
      "id": "mhnwzlp",
      "body": "I'm sorry, I can't possible imagine the level of grief and stress you must both be going through.\n\n\n I worked for a Hospice for many years and I have one thing I want to pass on to take away at least one complication. You love each other terribly and obviously hope for more time, but discuss her wishes now.\n\n\n I made mine with my now husband at 28. Because Ive seen grief made so much worse by the complications of not knowing what they want of preparing of being forced to deal with the aftermath of losing someone without knowing what they wanted, with simple things just like getting passwords together for ins and other accounts...knowing funeral wishes knowing if they want to be resuscitated etc.\n\n\nAlso talk about comfort vs. Treatment. We never want to give up, but I've seen partners hang on and suffer through treatment that only prolonged suffering because they didn't want to hurt they're spouse by letting go. If it comes down to it you need to know what she'd choose.\n\n\nI hope to god you get more time, but have these conversations while you still can. Nothing is worse than grieving a spouse and trying to make arrangements and pick up the pieces, answer questions you didn't get a chance to ask.\n\n\nMy heart goes out to you both.",
      "created_utc": 1741911297.0,
      "score": 1
    },
    {
      "id": "mhpm5w9",
      "body": "mal practise \n\nfirst they puncture her lung\n\nnow they are barely communicating \n\nsmh",
      "created_utc": 1741937255.0,
      "score": 1
    },
    {
      "id": "mhttrjp",
      "body": "Just sue the doctor",
      "created_utc": 1741991573.0,
      "score": 1
    },
    {
      "id": "mgh1jor",
      "body": "My heart and prayers go out to you and your wife, OP.\n\nStay strong. You are loved and this is not your fault, saying yes to a hopeful procedure is never regretful. \n\nHug your wife and know that there are more people than you know on here who are praying/wishing/manifesting a miracle for her.",
      "created_utc": 1741330928.0,
      "score": 1
    },
    {
      "id": "mgh7yp3",
      "body": "Holy shit. I’m so fucking sorry, I can’t even begin to imagine how utterly devastating this is for both of you. Life can be so unfair and cruel sometimes, it fucking sucks. Much love to both of you. I hope with all my heart that she pulls through.",
      "created_utc": 1741334599.0,
      "score": 1
    },
    {
      "id": "mghlefr",
      "body": "Hang in there friend! I will pray for you 🙏🏼 sending hugs 🤗",
      "created_utc": 1741342940.0,
      "score": 1
    },
    {
      "id": "mgipuy6",
      "body": "I’m not a lawyer but I do work in the funeral industry and register death certificates constantly which requires a lot of coordination with medical facilities. In my experience, this has the potential to be a wrongful death lawsuit. Document everything. Get a PRIVATE autopsy done before you proceed with any disposition arrangements to determine cause of death outside of the medical facility she is currently in. \n\nA lot of the comments are really kind and encouraging and I’m hoping for a positive outcome, for her survival. Though if she doesn’t survive, the medical bills and funeral arrangements will fall on you as her husband, it might be wise to make sure there is a 3rd party determining her cause of death as opposed to the hospital that performed the surgery which punctured her lung. This would allow you to sue the medical facility for wrongful death, after all….they punctured her lung during surgery and didn’t notice until later…that is negligence. Don’t let them get away with it.",
      "created_utc": 1741359828.0,
      "score": 1
    },
    {
      "id": "mgh8zx3",
      "body": "I don’t know what to say…",
      "created_utc": 1741335210.0,
      "score": 0
    },
    {
      "id": "mggaf7d",
      "body": "These doctors man... I know from personal experience that I will never take their word for it or blanket trust them because they are doctors.  I'm sorry man.",
      "created_utc": 1741318752.0,
      "score": -6
    },
    {
      "id": "mgh0y10",
      "body": "I hope by some kinda miracle or something that she recovers but it sounds pretty bad, god I can't imagine losing the love of my life like that. Just know that we're all wishing you love and as much support as Internet strangers can",
      "created_utc": 1741330604.0,
      "score": 0
    },
    {
      "id": "mgh3nwy",
      "body": "my condolences, I love you brother. keep strong",
      "created_utc": 1741332106.0,
      "score": 0
    },
    {
      "id": "mgied6v",
      "body": "I don’t know if you’re religious at all, but I just want you to know that I’ll be praying for you and your wife tonight. I’m so sorry you’re going through this. Wish you the best and a full recovery. ❤️",
      "created_utc": 1741356049.0,
      "score": 0
    },
    {
      "id": "mggkn0l",
      "body": "My heart is so broken for you. 🥺🥺 I can’t imagine what you’re going through. How hard this must all be. How unfair I’m sure it probably feels. All I can tell you for certain is find a lawyer. Make sure you’re being heard as her partner. Take brakes to brake down away from her because there is no way anyone can do this alone and not take a moment. If you have a support system PLEASE reach out. But treasure your wife right now while you’re in her presence. Be there for her. Do things with her if she’s able. Distract her from what is most likely a terrifying situation. Bring her comfort items from home. Idk if she can eat but bring her a favorite meal if you’re allowed. Sit with her, hold her hand, allow her to cry if she needs to. As much as this is rough for you, both of you need each other. ❤️💕 I’m so sorry this is happening to both of you. Idk if it will get better but I’m glad you’re at least taking steps to reach out I’m even it’s just to strangers on the internet.",
      "created_utc": 1741322827.0,
      "score": -1
    },
    {
      "id": "mgi2frv",
      "body": "[deleted]",
      "created_utc": 1741351603.0,
      "score": -13
    },
    {
      "id": "mgin5tq",
      "body": "God can turn this situation around.",
      "created_utc": 1741358979.0,
      "score": -7
    },
    {
      "id": "mgid5h9",
      "body": "I would sue the shit out of them. They punctured her lung!",
      "created_utc": 1741355634.0,
      "score": -2
    },
    {
      "id": "mggk7v4",
      "body": "I thought it was “I could care less” and viewed it as talking oneself out of caring light hearted self admonishment. I should care less. I could care less. (Could gives you more agency and not the shame that sometimes linger around  “should”) If I could just care a little less, it would make the world feel less heavy. If I could care less than I actually do at this instant so fraught with consternation and conflict., I would then feel more ease. If we all just cared less, it might lessen some of the more intense negative things we feel. But we do care. One can not care less or more. Care just is. It’s not a choice. You can’t really alter you could care less and you couldn’t care less. But you care exactly as much as you and you can’t care more or lesser. As opposed to the what I have since learned is the correct way “I couldn’t care less” meaning I care as little as it is possible to care. I could not possibly care to a lesser degree. No care do I have to give. Well………Obviously you do care or you wouldn’t need to speak at all, let alone snarkingly declare to another human being that it’s impossible to care for them or their opinion any less than you already do. Soooo….to my ears “could not care less” is not only rude but is itself a demonstration that you do care an awful lot. The colloquialism is meant to hurt another. We long for care. We long to care. We care……..but we could care less.",
      "created_utc": 1741322646.0,
      "score": -5
    },
    {
      "id": "mgg9356",
      "body": "OP must read this. Please don't lose hope. We never know what miracle can happen the very next second.",
      "created_utc": 1741318259.0,
      "score": 294
    },
    {
      "id": "mgmiw48",
      "body": "This is good news. OP.  Consider a this example.   All is not lost.    Sending good vibes and love to you and the wife for a speedy recovery and discharge from the hospital.",
      "created_utc": 1741403220.0,
      "score": 18
    },
    {
      "id": "mgxk9fm",
      "body": "That’s amazing. Best wishes to your mom ",
      "created_utc": 1741561305.0,
      "score": 1
    },
    {
      "id": "mgghe6h",
      "body": "This is the questions they should be answering, coughing up blood may not always mean the worst, especially when it involves surgery of the heart. Understanding the whole picture is vital. even if she was coughing, the nurses and doctors would have been monitoring her blood levels. if blood started to fill her  lungs from the accidental puncture, there would be a gradual decline in her blood level. She would have trouble breathing because the blood is filling up her lungs. If this is the case, they would probably want to insert a chest tube to remove the fluids from the lungs. \n\nI don't have the full story from reading this post but I assume that since it's a heart surgery, Drs may have started the patient on blood thinners days after surgery to prevent pulmonary embolism (PE), or blood clots in the lungs. Even still just the surgery itself puts the patient at risk for a PE. Since the heart and lungs are connected, there is a higher risk of developing clots, especially after major surgeries involving the heart. \n\nThis may explain the reason why pt is coughing up blood.\n\n Edit: I forgot to add that the patient was intubated, then extubated before and after the procedure. This can also cause trauma to the throat and lungs, which could be another cause for coughing up blood",
      "created_utc": 1741321462.0,
      "score": 523
    },
    {
      "id": "mggp4t6",
      "body": "Joining the bandwagon on the coughing up blood. I have chronic bronchitis. Whenever I get sick I always cough up blood, mostly small amounts and sometimes mixed with sputum. Obviously if it's more than that, ignore this.",
      "created_utc": 1741324791.0,
      "score": 106
    },
    {
      "id": "mghkl0y",
      "body": "Here's the picture.\n\nThey tried 8 times to draw blood from her and failed. Circulation has slowed. They can't find her veins even with the xray machine.\n\nThe only monitoring they are doing is blood pressure every 4 hours. Paracetamol.\n\nHer hemoglobin is below 100. Her inflammation levels are high suggesting infection. They don't want to give her a PICC LINE due to the clot risks. Her troponin T serum level is 48. Max for a healthy woman is 14. Suggesting heart damage. \n\nI've focused on this woman for 4 years. When she's sick I focus more. I just needed a place to share this.",
      "created_utc": 1741342451.0,
      "score": 190
    },
    {
      "id": "mgi1did",
      "body": "I agree… based on the post it doesn’t sound like she’s actually dying. She would know, they’d tell her and she’d tell her family. She wouldn’t be dying there in secret and no one knows. That’s not how that works.",
      "created_utc": 1741351157.0,
      "score": 41
    },
    {
      "id": "mgj0x4e",
      "body": "I don’t agree with the Dr comment. My stepdad had late-stage very quick cancer, no one would have the talk at all. No one….",
      "created_utc": 1741363108.0,
      "score": 6
    },
    {
      "id": "mgg9tr6",
      "body": "Prayer absolutely holds weight.\n\nBelief, especially collective belief, actively affects reality. Recent advances in quantum physics research have proven this on a quantum level. The human mind plays an active role in shaping not just our perception of reality, but reality itself.\n\nIn practice, the key is to try and eliminate any doubt whatsoever. Focus all your energies into your belief. Meditate on it. Visualize what you want happening, until it's as vivid as if it were happening right in front of you. Imagine a white light surrounding her and engulfing her, and as that light increases in brightness, imagine it's healing every little thing inside that's wrong with her body right now. Imagine the light as though it were real enough to touch, focusing all the positive energy you have on it. Draw more of that energy from the collective Source. \n\nPrayer and belief absolutely make a tremendous difference.",
      "created_utc": 1741318531.0,
      "score": -7
    },
    {
      "id": "mgst4nj",
      "body": "Thank you so much. I will keep fighting for her.",
      "created_utc": 1741493215.0,
      "score": 4
    },
    {
      "id": "mggjmzr",
      "body": "\nThis situation is sad for op and his wife but the comments like this shows the ignorance people have with healthcare. Everyone is quick to throw around the \"sue\" words without knowing the whole story about what happened. We only have op's story to go by. This is why there is so much unwarranted blame in healthcare. When things go right people aren't as vocal as when something doesn't work towards their favor. \n\nI've explained it in detail in other post but to keep it short, complications such and accidental puncture or nearly tissue or organs does not necessarily be considered as malpractice. Unfortunately these situations happens more often than a person who does not work in healthcare may understand.   One is not likely to win malpractice case such as this one. A better example of malpractice is if the DR tells the PT that his infected Right leg has lost circulation and needs to be amputated, the Dr then writes and order for consent to amputate the Left leg. The pt has the surgery and the DR removes the wrong leg. This is a clear case of malpractice.",
      "created_utc": 1741322402.0,
      "score": 21
    },
    {
      "id": "mghzmpd",
      "body": "Thank you",
      "created_utc": 1741350402.0,
      "score": 3
    },
    {
      "id": "mggewms",
      "body": "This is not considered malpractice. in complicated surgeries which involve the heart, there are the possibilities of picturing other organs that are in the vicinity. You are dealing with very complicated tissues and organs, so many things can go wrong , the chances of everything going right is a miracle in itself. That's why when you sign a consent, it clearly states some of the risks of the procedures, which includes the possibility of accidentally puncture nearby tissues or organs. This has happened in many procedures that I have witnessed. You are not likely to win a case like this if you take this to court. This is the problem with people who are not versed in the medical field and will scream malpractice when something doesn't go right.",
      "created_utc": 1741320458.0,
      "score": 28
    },
    {
      "id": "mgg8532",
      "body": "I’ll be praying that Allah heals his wife. Good idea. The more the merrier.",
      "created_utc": 1741317914.0,
      "score": 5
    },
    {
      "id": "mgiwswy",
      "body": "This exactly. Every industry is out to exploit everyone if they can.\n\n“We accidentally punctured a lung. Sorry.” (If you even get the sorry). And if your surgeon is even nice, it’s still passive aggressiveness that they use to lead to your ruin. Why? Because he/she probably isn’t a friend that will keep tabs on you regularly with their personal phone number to make sure the medical debt is still crushing you.\n\nIt’s more likely your surgeon has a god complex since he/she needs one to even perform surgery in the first place, rather than valuing human life and understanding “if you ruin any piece of the human body to fix it, fix what you originally touched”.",
      "created_utc": 1741361919.0,
      "score": 2
    },
    {
      "id": "mgi85u6",
      "body": "Stfu",
      "created_utc": 1741353845.0,
      "score": -1
    },
    {
      "id": "mggb758",
      "body": "Jesus said if we truly believe that mountain in the distance will be picked up and thrown into the ocean, then it will be so. If we **believe,** truly ***believe, without doubt,*** then it shall be done for us.\n\nGod can literally do **anything.**\n\nI've seen someone come back from the literal dead, after having been dead for **hours.** I used to work in healthcare, and I've seen it with my own two eyes. God can literally move mountains, we just have to believe with all our hearts that He can.",
      "created_utc": 1741319041.0,
      "score": -317
    },
    {
      "id": "mggjjug",
      "body": "I agree with you… I’m an anatomist who dissects medically donated bodies at a cadaver lab for a living and I feel like if those questions would be answered I could provide some comfort to OP.",
      "created_utc": 1741322365.0,
      "score": 235
    },
    {
      "id": "mgn4zox",
      "body": "This is all true, but he says he’s been following her blood test results and he’s watching her body shut down. I don’t know what this statement means to him, but to me it means watching the billarubin levels get higher and higher …then the creatine numbers start to climb and you know there’s no coming back now…and you so there and you progressively watch the numbers that need to go up come down and the numbers that need to go down go up and the infernal clock on the wall won’t stop ticking away the time you have left and you want to say something, anything to make the person feel better, but what do you really say? \nOP, it’s hard, but if you can, keep talking those good things to your wife. Give her whatever peace and comfort you can offer her…. I’m sorry you have to go through this. I will remember both you, and your wife. For what it’s worth, I’ll pray for a miracle for you both.",
      "created_utc": 1741412998.0,
      "score": 19
    },
    {
      "id": "mggq0vt",
      "body": "That's why I wrote this. My husband has Cystic Fibrosis. Its not uncommon to cough up blood sometimes for weeks. But there is a huge difference between coughing up a bit of blood with sputum, sometimes for a few weeks after the bleeding has stopped. And drowning in your own blood. \n\nI think movies have led people to believe that coughing up any blood is the end of the world. While it is unpleasant and definitely scary as hell. Its not actually that uncommon.",
      "created_utc": 1741325197.0,
      "score": 76
    },
    {
      "id": "mghn6qh",
      "body": "I work in an ICU with these types of patients. Unless the providers have had a meeting with you and told you she’s going to die, these facts and numbers are not indicative of that, and rather, the fact that there isn’t higher escalation of care means she’s doing okay. Being sick and being in the hospital with complications is very scary, especially if you don’t fully understand what is happening.",
      "created_utc": 1741344002.0,
      "score": 286
    },
    {
      "id": "mghlda0",
      "body": "I get that. I wasn't trying to insult you or anything. I understand you are upset. \nThe way I read your post was of someone who didn't know what was happening or blinded by worry. As it seems some others did too. \n\nI was not trying to put you down or tell you that you don't know your wife. Of course you do. \n\nSo what's next? Share with me. Are they looking at transplant?  Are they giving her anything to stop the bleeding?  Are they giving her anti clotting meds?",
      "created_utc": 1741342920.0,
      "score": 65
    },
    {
      "id": "mghlpb0",
      "body": "I'm just sending you love. I'm so sorry. Thinking of both you and your wife xx",
      "created_utc": 1741343122.0,
      "score": 21
    },
    {
      "id": "mgln2hi",
      "body": "1.) your wife is a difficult stick. If they have an  ultrasound to help find a deeper vein it may solve the issue. \n\n2.) blood pressure monitoring Q4h is the standards unless in cases of higher level of care or ordered by the Dr. it means she's in stable condition. \n\n3.) HGB numbers are fine. HGB between 12-16 g/dl is normal range. 10 g/DL is not unusual for someone who just had a major procedure. Monitoring it daily to make sure it's not dropping by a whole point each day is ideal. Below 7g/dl would be considered abnormal and may required investigating and transfusion blood. \n\n4.) Infection levels are also not necessary abnormal due to the right risk of the procedure. Monitoring procalcitonin levels and WBC levels in addition to vital signs will determine the progress of the infection and need for antibiotics or not. Blood cultures maybe drawn to see if the infection has reached the blood stream. \n\n5.) serum troponin levels being high suggests how stressed the heart is or how damaged it is. With her predisposed diagnosis, it is not surprising. Her heart is already in a weakened state even before the procedure. Ejection fraction of the heart would help us understand how well her heart is perfusing blood, indication of how damage her heart is. Low EF suggests heart failure. \n\nI hope this information gives you a better understanding about your wife's conditions.",
      "created_utc": 1741391807.0,
      "score": 20
    },
    {
      "id": "mgi62f2",
      "body": "Im curious which country are you in? \nI’m sorry you’re going through all of this, but some of the details you’ve provided makes me think you may not understand her picture fully. \nNormal hemoglobin for a woman is 12-16. It shouldn’t be near 100… \nTroponin T is not specific to the heart like troponin I is. It’s released by other muscles in the body. An elevated level of troponin could mean so many things. All we usually care about is the trend, whether it’s going up or down. It may indicate heart damage, but believe me when I say the heart is resilient. Trop levels are not enough to tell you the extent of her heart issues. Hope this helps somewhat. Please find a doctor to explain everything to you.",
      "created_utc": 1741353051.0,
      "score": 20
    },
    {
      "id": "mgpxmd7",
      "body": "Has anyone actually told you she is dying….? You seem to think just because she’s on a “heart failure ward” it is the end for her and she is dying. The fact they are doing 4 hourly vital signs, she’s only on Panadol and not on maximum supports and her borderline blood results are NOT indicative of someone at the end of their rope. \n\nYour wife is sick but it doesn’t sound like they have given up on her.. speak to the doctors and listen to them.",
      "created_utc": 1741457600.0,
      "score": 4
    },
    {
      "id": "mgk8vex",
      "body": "it's possible the internal Medicine doctor not saying much about the prognosis, even if they don't feel like it's on them to discuss it with family, they should be consulting supportive medicine/palliative care/ hospice. Working in the hospital I can see that a lot of the doctors do not have a very good bedside manner.",
      "created_utc": 1741375655.0,
      "score": 5
    },
    {
      "id": "mgsxeo8",
      "body": "I'm a lifelong insomniac. I'm here if you need to talk or yell at an internet stranger.",
      "created_utc": 1741495013.0,
      "score": 2
    },
    {
      "id": "mggqyph",
      "body": "This. Thank you. I am also pretty sure that the doctors must have counseled OP regarding the complications of the surgery before he signed the informed consent forms. Some post-op adverse events are common and some are very rare. It doesn’t mean that it’s malpractice or gross negligence.",
      "created_utc": 1741325618.0,
      "score": 11
    },
    {
      "id": "mggbjwq",
      "body": "Absolutely! Where are all our other prayer warriors? I know that's a cliche concept, but it seems incredibly fitting here.\n\nWe need **everyone** who truly believes in the power of God to pray for this woman.",
      "created_utc": 1741319174.0,
      "score": 1
    },
    {
      "id": "mgmakto",
      "body": "It’s also about the medical facility preserving itself, they’re going to provide a cause of death that protects them from any lawsuit, and because most of the time people are in a hurry to handle the funeral arrangements they don’t think about getting a 2nd opinion and then the body is cremated or you have to pay tens of thousands of dollars to have the body excavated and then autopsied. OP needs to act quickly and clearly.",
      "created_utc": 1741400102.0,
      "score": 1
    },
    {
      "id": "mgh1mh7",
      "body": "Probably a good thing you don’t work in healthcare anymore. That type of thinking can be dangerous.",
      "created_utc": 1741330971.0,
      "score": 130
    },
    {
      "id": "mggnej8",
      "body": "God didn't save my friend's niece from Gliogastoma. She is a true believer also. Her prayers did jack shit.",
      "created_utc": 1741324024.0,
      "score": 125
    },
    {
      "id": "mggealp",
      "body": "Keep your religiousness off of this man’s post. You can have your religion without shoving it down others throats. Leave space for OP without bringing religious shit into it. By the way, god never did anything for me. And as someone who has lost innocent children when they could’ve been saved and weren’t, despite everyone’s pleads to this “god” you speak of, it quite upsets me reading “god can do anything”. Trust me, we believed without doubt, and it was NEVER given to us.",
      "created_utc": 1741320220.0,
      "score": 151
    },
    {
      "id": "mggdk8i",
      "body": ">! lol. No. !<",
      "created_utc": 1741319937.0,
      "score": 91
    },
    {
      "id": "mgl9mvt",
      "body": "Please don’t use this man’s terrifying experience to proselytize. If your faith is strong, just pray for him and let him make his own decisions about the rest.",
      "created_utc": 1741387282.0,
      "score": 23
    },
    {
      "id": "mginkie",
      "body": "So the people who lost their children or spouses just didn't ask god in the right way? Or didn't believe enough? You don't see how cruel and sick that is? Why would I worship a god like that? Gross.",
      "created_utc": 1741359109.0,
      "score": 48
    },
    {
      "id": "mgjlj2j",
      "body": "Yeah, no, that take is beyond effed up, sorry to say. \n\nMy grandmother was VERY religious (to the point of being fanatic to some degree even) and trusted in god more than anything, and yet she still was starving to death in front of our eyes for almost a year, suffering from pancreatic cancer and, as I said, literally starving to death over the course of MONTHS, looking weaker and weaker every passing week. Are you seriously implying that she deserved that because SHE didn’t believe hard enough in her own god, or even that she deserved this because of her apparent lack of “believing hard enough”?",
      "created_utc": 1741369015.0,
      "score": 27
    },
    {
      "id": "mgqvtfs",
      "body": "I highly doubt you have seen dead people come back alive after hours of being dead. Y’all have a necromancer at the old hospital you used to work at or what?",
      "created_utc": 1741468418.0,
      "score": 3
    },
    {
      "id": "mgqthu9",
      "body": "God has no place here.",
      "created_utc": 1741467672.0,
      "score": 1
    },
    {
      "id": "mhh1rv5",
      "body": "Get out of this sub lol",
      "created_utc": 1741821394.0,
      "score": 1
    },
    {
      "id": "mggkt5m",
      "body": "I can go on and on about other possibilities of what could have happened. Working as a bedside nurse, we as healthcare has dealt with our fair share of families who are difficult to deal with. That's not to say that op's situation doesn't have its truth in it, but when we have loved ones who are in the hospital and sick we tend to get in a tunnel vision and tend to find anything and everything to put blame on someone when something doesn't go right. When in actuality the situation may be very complicated from the start. Just from the diagnosis that op provided it is clear that his wife was already dealing with many complicated conditions that put her at risks for many complications before, during and after surgery.",
      "created_utc": 1741322899.0,
      "score": 100
    },
    {
      "id": "mhjh8dt",
      "body": "I don't pray myself. But, I too would send as much strength through the universe to OP as possible. I can't fathom being in his position.\n\nOP, please don't isolate through this. You'll want to, and certainly take the time you need to be alone with your thoughts and grief. But, lean on any support system you have hard, man. You're going to need those people.\n\nI am so, so sorry.",
      "created_utc": 1741860513.0,
      "score": 2
    },
    {
      "id": "mggsdxj",
      "body": "Yeah, it used to freak me out when I was younger, but now it's like 'oh great I'm getting sick.'",
      "created_utc": 1741326266.0,
      "score": 31
    },
    {
      "id": "mghuvm8",
      "body": "Thank you for your reassurance. Il remain optimistic but pragmatic. \n\nThey managed to find a vein about 30 mins ago and get some good blood. A small win from yesterday.\n\nHer chest still hurts and her left and right side are still in pain.. Her arms have pins and needles and numb.. all more than yesterday. \n\nPerhaps I'm just anticipating the worst but I can't explain the mood in the air. \n\nHer blood pressure remains below 90/60..\n\nIl see what her results are soon.",
      "created_utc": 1741348189.0,
      "score": 211
    },
    {
      "id": "mghy15y",
      "body": "I really don’t mean to be a downer, but is it possible that the doctors and specialists are avoiding OP due to possible negligence?",
      "created_utc": 1741349691.0,
      "score": 46
    },
    {
      "id": "mgirn0j",
      "body": "My hospital uses g/L rather than g/dL so 100 would be equivalent to 10.0.",
      "created_utc": 1741360374.0,
      "score": 16
    },
    {
      "id": "mgk54ha",
      "body": "Exactly.",
      "created_utc": 1741374569.0,
      "score": 1
    },
    {
      "id": "mggyzb8",
      "body": "I feel that.",
      "created_utc": 1741329551.0,
      "score": 17
    },
    {
      "id": "mgkhva3",
      "body": "Are you in a congenital heart disease centre? If not then it may be worth asking whether a second opinion or transfer is possible if she is stable enough. \n\nAlso I encourage you to ask about your worst fears so you can get the information that you need to understand properly what is going on, treatment plan, chance of progression or recovery. If there has been negligence this will need to be ascertained and dealt with later. For now concentrate on supporting your wife and getting her the best possible understanding of her condition so she can advocate for herself and make informed decisions.",
      "created_utc": 1741378277.0,
      "score": 50
    },
    {
      "id": "mgi3plm",
      "body": "No, I find it doubtful. Complications often happen and they are discussed as possibilities when you consent to the surgery. Sounds like she had a hemothorax but isn’t that critical as she’s not tubed and lined. If they are actually avoiding OP, it’s likely it’s because he’s overreacting and misunderstanding the situation and making statements that she’s dying when she is not. However, most likely they are just busy and have no need to attend to her (also a sign she’s ok — if there aren’t people constantly in the room doing assessments/procedures/treatments, that’s a good thing).",
      "created_utc": 1741352123.0,
      "score": 115
    },
    {
      "id": "mgj1cr9",
      "body": "I see, I’ve never heard of that. That’s why I asked for country. I assumed it may be different outside the US\n\n\nETA: with that being said, below 10 is something we see often. I don’t want these numbers to cause additional stress/anxiety. Her primary care team needs to do a better job explaining smh",
      "created_utc": 1741363234.0,
      "score": 12
    },
    {
      "id": "mhlhyda",
      "body": "This! I’ve had 9 open heart surgeries for a congenital heart defect. Not all heart doctors have dealt with congenital patients",
      "created_utc": 1741885929.0,
      "score": 2
    },
    {
      "id": "mgk6k0h",
      "body": "this is exactly it, nurses and doctors do not avoid informing the PT and family bc they think there's a possibility of a lawsuit. we get threatened quite frequently about lawsuits, it does not prevent us from caring for our patients. It's as this above post stated, usually family gets their emotions out of control which is understandable but sometimes it's hard to give information to family when they are irate. They usually have a mindset that no one is \"doing anything\" bc they dont see a nurse or a doctor come to the room to check on them every 10mins.",
      "created_utc": 1741374983.0,
      "score": 39
    },
    {
      "id": "mgj8fpe",
      "body": "She had a valve-in-valve procedure to help improve the flow to her right ventricle (which is failing) - open heart route is too high risk for now so opted for keyhole.\n\n  \nReally it needs to be replaced in full but we can't approach that point yet.",
      "created_utc": 1741365274.0,
      "score": 38
    },
    {
      "id": "mgktsci",
      "body": "\"It's likely it's because he's overreacting.\" People are oftentimes so callous when confronted with someone going through something traumatic. He's not overreacting, and you have zero clue why doctors may or may not be avoiding OP. Keep your conjecture in a personal journal. It is less harmful there. Show some empathy.",
      "created_utc": 1741382288.0,
      "score": 40
    },
    {
      "id": "mgjlumi",
      "body": "Forgive my ignorance, but why is a heart transplant not possible ?",
      "created_utc": 1741369106.0,
      "score": 14
    },
    {
      "id": "mgovg77",
      "body": "My experience in the industry says otherwise. Sorry if you don’t want to hear the reality. Hope is great! Reality is that she isn’t actively dying. Hope this helps.",
      "created_utc": 1741445671.0,
      "score": 6
    },
    {
      "id": "mgl3twk",
      "body": "Thank you.",
      "created_utc": 1741385454.0,
      "score": 10
    },
    {
      "id": "mgkfmob",
      "body": "I'm wondering the same. my sister has had 2 heart transplants in the past 5 years. the first one failed and she was very lucky to receive the second. she was not even 40 before the first. fingers crossed for you and your wife, op.",
      "created_utc": 1741377621.0,
      "score": 14
    },
    {
      "id": "mgma92h",
      "body": "how is she doing today?",
      "created_utc": 1741399979.0,
      "score": 3
    }
  ]
}