{
  "id": "1kmy2qe",
  "title": "My best friend died the morning after we had sex.",
  "selftext": "I (27f) was so close to my best friend (29m). He was everything to me. \n\nWe got so fucking drunk that night. Eventually we were lying on his bed. He told me through slurred words that how badly wanted me. That’s when we did it. He told me he loved me right afterwards.\n\nNow he’s dead. Went home to hang himself the morning after. \n\nI miss him.\n",
  "created_utc": 1747278467.0,
  "score": 5379,
  "num_comments": 161,
  "url": "https://www.reddit.com/r/offmychest/comments/1kmy2qe/my_best_friend_died_the_morning_after_we_had_sex/",
  "comments": [
    {
      "id": "msf44w4",
      "body": "Almost the same exact thing happened to me. One thing someone told me that helped was, you gave them comfort in their final hours. You shared a beautiful moment with them and gave them intimacy in their final moments of life. And nothing can take that away. \n\nPlease seek support. I didn’t. Still haven’t. It’ll tear you apart.",
      "created_utc": 1747300479.0,
      "score": 1647
    },
    {
      "id": "msdzz6s",
      "body": "I am so sorry. There is not much a reddit stranger can do but know that I feel for you and that someone cares.",
      "created_utc": 1747278866.0,
      "score": 2605
    },
    {
      "id": "mse8hk6",
      "body": "Goodness me that is so so sad. Please reach out to get some trauma therapy. Getting help early can make recovery less difficult.\nI am so sorry you are going through this!!",
      "created_utc": 1747282502.0,
      "score": 1822
    },
    {
      "id": "msdzm6n",
      "body": "So sad",
      "created_utc": 1747278720.0,
      "score": 618
    },
    {
      "id": "mse98al",
      "body": "Oh my god I'm so sorry. My condolences.",
      "created_utc": 1747282828.0,
      "score": 379
    },
    {
      "id": "mseham1",
      "body": "this was an horrific ending, getting drunk and then wanting to hang themselves?? that is out of the world\ni won't ask for the reasons, but i will give my full condolences to you, so so sorry",
      "created_utc": 1747286733.0,
      "score": 414
    },
    {
      "id": "mse6ogz",
      "body": "That’s rough. :/",
      "created_utc": 1747281705.0,
      "score": 196
    },
    {
      "id": "msepdd8",
      "body": "I’m sorry, that’s such a heavy thing to work through. I hope he left a note and was able to give his loved ones closure. It’d be so hard to go through this and always be left wondering why and if your encounter influenced it.\n\nWhen I was deep into my alcohol addiction, I’d black out almost every time I drank. I’d always wake up with so much shame, wondering what I did to embarrass myself the night before. It always sent me into such a dark and abysmal place mentally. I’m sorry for the loss of your friend.",
      "created_utc": 1747291237.0,
      "score": 59
    },
    {
      "id": "msern9s",
      "body": "This is awful. I can't imagine what you're going through. This isn't your fault. Be kind to yourself and seek help if you need it",
      "created_utc": 1747292573.0,
      "score": 27
    },
    {
      "id": "msf2nky",
      "body": "This unbelievably sad.",
      "created_utc": 1747299526.0,
      "score": 21
    },
    {
      "id": "mseapvz",
      "body": "y the fk did he do that",
      "created_utc": 1747283509.0,
      "score": 274
    },
    {
      "id": "mse9l63",
      "body": "Damn",
      "created_utc": 1747282989.0,
      "score": 26
    },
    {
      "id": "msf078j",
      "body": "I never told/realized my feelings for my best friend until after his death and that fucked me up a little bit.",
      "created_utc": 1747297954.0,
      "score": 26
    },
    {
      "id": "msegi0y",
      "body": "Oh no",
      "created_utc": 1747286319.0,
      "score": 11
    },
    {
      "id": "msgdjkr",
      "body": "I’m so sorry! I can empathise with your grief. My best friend of 10 years (besties from the age of 14-24) got drunk and drove himself off a cliff. Months earlier we were drinking at his parent’s house and he left suddenly. We went out looking for him and his mum and I found him near the cliff that he later drove off. The worst part was that he survived and became a quadriplegic. He’s now just a shell of who he was when he was younger. I spent my younger years envisioning spending my life with him, to years of caring for him, until we eventually drifted apart. About 2 years after his crash he admitted that he’d left both of those times to end it.\n\nI’ve basically said all of this to share some familiar pain, but to also let you know that it’s not your fault, even though it hurts so much. You can never truly feel other people’s pain. I’m sure he loved you.",
      "created_utc": 1747319351.0,
      "score": 9
    },
    {
      "id": "msexmbz",
      "body": "\"Eventually we were lying on his bed.\"\n\n\"Went home to hang himself the morning after.\"\n\nHis bed isn't at his house? Hmm..",
      "created_utc": 1747296285.0,
      "score": 170
    },
    {
      "id": "msfzfgx",
      "body": "Oh dear OP I'm so terribly sorry for your loss loving you so much ❤️ 🫂 🥹",
      "created_utc": 1747314798.0,
      "score": 5
    },
    {
      "id": "msfho42",
      "body": "So sorry for your loss, my condolences, it would seem strange but I understand how hard you have it right now, my best friend died a month after we confessed our love for each other.\n\nI hope you could seek therapy and I'm here if you need to talk.",
      "created_utc": 1747307819.0,
      "score": 5
    },
    {
      "id": "msec1qn",
      "body": "Looking for Alaska",
      "created_utc": 1747284136.0,
      "score": 26
    },
    {
      "id": "msfii9e",
      "body": "Oh my god. Why tho? My condolences :(",
      "created_utc": 1747308199.0,
      "score": 4
    },
    {
      "id": "mseinat",
      "body": "I am so sorry for your loss",
      "created_utc": 1747287457.0,
      "score": 8
    },
    {
      "id": "msfrspe",
      "body": "Fucking brutal. I’m sorry 😞",
      "created_utc": 1747312038.0,
      "score": 3
    },
    {
      "id": "msg3g0r",
      "body": "i’m so sorry OP",
      "created_utc": 1747316156.0,
      "score": 3
    },
    {
      "id": "msj6d4h",
      "body": "I’m so sorry. This is awful.\n\nI know a few partners of suicide victims and it never leaves your heart. I think suicide is brutal all around but I truly cannot imagine that pain. Please please get grief counseling. You can move forward and have a healthy happy life, but this can and will eat you alive if you let it. You will never ever get rid of the trauma and experience.\n\nI think of my friends at the most random times and it stops me in my tracks. I met a new friend recently and found out they went to third grade together when we were going through her year books and just started sobbing. It will take you by surprise sometimes. I see my friend’s children and they look just like their fathers. One of the families has a new baby brother now and their mom tells them stories of their daddy. Her husband is so kind and wants him to be a part of their lives. She has healed so much but the pain is a part of her soul now. The other is so fresh and traumatized. NY day. She found him and his condition was horrific. Time will only tell and no one can fault her for how she processes it. The wound has torn into her like a tornado and she will need so much time.\n\nHearts aren’t meant to go through this and it’s going to take some time to heal it. Just know that many strangers are sending you love. It is an unimaginable pain and I hope you are kind and gentle to yourself through this. I’m just so sorry sorry.",
      "created_utc": 1747349517.0,
      "score": 3
    },
    {
      "id": "msglboz",
      "body": "Straight to therapy, friend.",
      "created_utc": 1747321659.0,
      "score": 6
    },
    {
      "id": "msh3o73",
      "body": "Man someone posted this same shit yesterday. Now I’m questioning both of them.",
      "created_utc": 1747327059.0,
      "score": 6
    },
    {
      "id": "msglypr",
      "body": "I feel like I've seen the same story like 6 times in the last two months \n\nGet drunk has sex with best friend, friend then kills themselves or gets in a car accident the next day \n\nSurely this sort of thing doesn't happen that often",
      "created_utc": 1747321848.0,
      "score": 4
    },
    {
      "id": "msfhba4",
      "body": "Oh my gosh. I’m so sorry for your loss. 😞",
      "created_utc": 1747307656.0,
      "score": 2
    },
    {
      "id": "msgh1di",
      "body": "Omfg I'm SO sorry, my condolences. Somebody else posted something similar yesterday and all I have to say, is I understand as someone who almost got taken away by the Grim Reaper at her own hands 12 years ago. 😑  Wishing you love and healing. My good friend also committed suicide back in 2016 and I still miss him a lot. The happy memories at least remind me that genuinely good people still exist in this rotten world 🥲",
      "created_utc": 1747320400.0,
      "score": 2
    },
    {
      "id": "msglehg",
      "body": "I’m sorry, I lost a close male friend in my early 20s and also my teen idol.  No words I can say to make it feel better.",
      "created_utc": 1747321682.0,
      "score": 2
    },
    {
      "id": "msi4la5",
      "body": "Yooo I am so sorry that you had to experience that. I hope you are surrounded by people that can support you!",
      "created_utc": 1747337840.0,
      "score": 2
    },
    {
      "id": "msi7eg3",
      "body": "OP, I am so sorry.  I think he is with you in your memories always.  Sometimes the pain of depression/life is too much.",
      "created_utc": 1747338670.0,
      "score": 2
    },
    {
      "id": "msj00bg",
      "body": "I'm so, so very sorry for your loss! 😔",
      "created_utc": 1747347288.0,
      "score": 2
    },
    {
      "id": "mslolxh",
      "body": "Im so fucking sorry:((((",
      "created_utc": 1747391511.0,
      "score": 2
    },
    {
      "id": "msegcuo",
      "body": "I can’t imagine how you feel. I pray that the Lord gives you peace in this moment and that you feel His presence.",
      "created_utc": 1747286246.0,
      "score": 4
    },
    {
      "id": "msf9p5u",
      "body": "Hmm....I'm calling bullshit.",
      "created_utc": 1747303823.0,
      "score": 5
    },
    {
      "id": "msid8z1",
      "body": "I am thinking of you. I hope you have mental health resources at your disposal. In a pinch, even ChatGPT can be a terrific and sensitive confidant. \n\nI have never experienced something so awful. I hope you emerge from this trauma stronger than before. None of this is your fault. Focus on getting through the month of May. June will be better.",
      "created_utc": 1747340381.0,
      "score": 2
    },
    {
      "id": "msei3mk",
      "body": "Oh no. I hope you will be okay :((",
      "created_utc": 1747287162.0,
      "score": 1
    },
    {
      "id": "mseifw5",
      "body": "I’m so sorry 🥺",
      "created_utc": 1747287346.0,
      "score": 3
    },
    {
      "id": "msgt6dv",
      "body": "Sending you love.",
      "created_utc": 1747323956.0,
      "score": 1
    },
    {
      "id": "msgtjwn",
      "body": "Jesus OP that's awful. I hope you dont blame yourself or anything. I also hope you were able to get some therapy, thats very traumatic. I'm so sorry for your loss.",
      "created_utc": 1747324065.0,
      "score": 1
    },
    {
      "id": "msgxodr",
      "body": "That’s so.. , I can’t even imagine 😔 tragic. My condolences 🫂🫂",
      "created_utc": 1747325273.0,
      "score": 1
    },
    {
      "id": "msh1kfk",
      "body": "I'm so sorry.",
      "created_utc": 1747326427.0,
      "score": 1
    },
    {
      "id": "msh3ztl",
      "body": "my most sincere hug for you. I am SO sorry for tour loss, sweetheart. none of this is your fault, I hope you know that",
      "created_utc": 1747327154.0,
      "score": 1
    },
    {
      "id": "mshcwjj",
      "body": "I’m so sorry. I hope you get therapy. :(",
      "created_utc": 1747329714.0,
      "score": 1
    },
    {
      "id": "mshknxl",
      "body": "my condolences. you’re allowed to feel however you’re feeling, don’t be actually to reach out for help",
      "created_utc": 1747331908.0,
      "score": 1
    },
    {
      "id": "msikj80",
      "body": "I am so sorry for your loss. May his soul rest well. You should reach out to your love ones or a therapist about it. :[",
      "created_utc": 1747342478.0,
      "score": 1
    },
    {
      "id": "msipgag",
      "body": "Did you know he was suicidal?\nOMG, this sounds so sad, I can't even imagine how you're feeling. Tragic. I'm really sorry, hope you don't try to take any blame for what happened.",
      "created_utc": 1747343949.0,
      "score": 1
    },
    {
      "id": "msj6kn6",
      "body": "i am so sorry, that really did take me aback im so sorry this happened to you op like avocado said, there isnt much as us reddit strangers can do but i am so sorry you're going through this i hope you get better",
      "created_utc": 1747349591.0,
      "score": 1
    },
    {
      "id": "msjeazq",
      "body": "idk how to react to this but sending love, that sounds rough",
      "created_utc": 1747352301.0,
      "score": 1
    },
    {
      "id": "msjpgtt",
      "body": "Please don’t be afraid to seek out mental health medication from your medical provider <3",
      "created_utc": 1747356442.0,
      "score": 1
    },
    {
      "id": "mskcy3q",
      "body": "I’m so sorry I think energy healing may be a huge benefit to you. It’s common for family, friends, acquaintances to carry a fault that isn’t theirs to carry.  My mom didn’t die by suicide but she died suddenly and all of us kids have felt blame. We carry it still. I’m finally working on healing from this.",
      "created_utc": 1747365324.0,
      "score": 1
    },
    {
      "id": "mskf8p3",
      "body": "I'm so sorrry. I have no words, this is just so awful to hapen to anyone. Please seek help.",
      "created_utc": 1747366270.0,
      "score": 1
    },
    {
      "id": "msl1kek",
      "body": "Happened to my friend, she spent the night with her close friend from childhood then at the end of the night they kissed and he confessed how much he loved her. \n\nHe hunt himself two days after she got home on the bridge they kissed on. Absolutely shattered her in so many ways. Know you’re not alone in this and many people care for you.\n\nplease talk to someone this grief will be carried forever big or small but in the end talking will always help. I’m so sorry for your loss",
      "created_utc": 1747377511.0,
      "score": 1
    },
    {
      "id": "msl6lm5",
      "body": "Fucking sorry for your loss, man. May soil be light over him. Rest in peace.",
      "created_utc": 1747380559.0,
      "score": 1
    },
    {
      "id": "msm2gr4",
      "body": "Naiyak ako sobra. Seek professional help if needed, as someone like me na very empathetic, naiyak ako sa pag basa nito.",
      "created_utc": 1747397706.0,
      "score": 1
    },
    {
      "id": "msmffyq",
      "body": "Wishing you only peace in your loss and my confidence as well. Grief is not a linear process but it is your process. Take the time you need to grieve and definitely consider some grief counseling cause you deserve some support.💛💛💛",
      "created_utc": 1747402378.0,
      "score": 1
    },
    {
      "id": "msmq6b6",
      "body": "😨🫣",
      "created_utc": 1747405763.0,
      "score": 1
    },
    {
      "id": "msmst9i",
      "body": "thank care op, just remember you gave him the best time. keep hik in your memories",
      "created_utc": 1747406552.0,
      "score": 1
    },
    {
      "id": "msn24c6",
      "body": "If you think you were to blame for this, please try to give up that guilt.\n\nI think he had his mind made up, the mental illness demon had its grip. The fact that you gave him intimacy he probably desperately craved. You still think about him & you gave him a good send off. Like a prisoner’s last meal.\n\nHe knew well before all that, unfortunately, you didn’t, how could you. Those things aren’t spontaneous as we think. \n\nYou were the light in that darkness.",
      "created_utc": 1747409279.0,
      "score": 1
    },
    {
      "id": "msnml2d",
      "body": "Whoa yo!",
      "created_utc": 1747415233.0,
      "score": 1
    },
    {
      "id": "msnovoe",
      "body": "I’m so sorry",
      "created_utc": 1747415904.0,
      "score": 1
    },
    {
      "id": "msnphw8",
      "body": "I can’t imagine the pain you’re carrying right now. What you experienced is so heavy losing someone you loved in such a deeply personal, confusing, and emotional moment is beyond words. Please don’t carry this alone or let guilt try to make sense of something that was never your fault.\n\nHe told you he loved you. That means something. You were someone he trusted and felt safe with in his final moments, and that’s not something small.\n\nI hope you have people around you who can hold space for your grief. And if you ever need to talk to someone, there are people who care…even strangers like me who are just really sorry you’re going through this. You’re not alone.",
      "created_utc": 1747416082.0,
      "score": 1
    },
    {
      "id": "msnvs6u",
      "body": "I am so so sorry ❤️",
      "created_utc": 1747417909.0,
      "score": 1
    },
    {
      "id": "mswzb6e",
      "body": "I’m so sorry 😢",
      "created_utc": 1747549820.0,
      "score": 1
    },
    {
      "id": "msetbay",
      "body": "Damn, I knew post-nut clarity was real, but this man took it to the final level.🌚",
      "created_utc": 1747293583.0,
      "score": -31
    },
    {
      "id": "msf9jbp",
      "body": "Is the sex that bad?? :/ Kidding aside I think you need to get a schedule with a Psychiatrist. You need professional help and therapy to overcome this.",
      "created_utc": 1747303734.0,
      "score": -29
    },
    {
      "id": "msfcyv0",
      "body": "worst sex ever then lol",
      "created_utc": 1747305572.0,
      "score": -33
    },
    {
      "id": "msghz6n",
      "body": "Hang in there 😉😉",
      "created_utc": 1747320676.0,
      "score": -19
    },
    {
      "id": "msg70hz",
      "body": "Why did he hang himself ?",
      "created_utc": 1747317318.0,
      "score": -14
    },
    {
      "id": "msflwrb",
      "body": "Cap",
      "created_utc": 1747309688.0,
      "score": -17
    },
    {
      "id": "msezzns",
      "body": "You forgot the part where you revealed you're a guy after you had sex /s (sorry ik I'm a jerk but kinda had to crack that joke)",
      "created_utc": 1747297815.0,
      "score": -66
    },
    {
      "id": "msecthi",
      "body": "[removed]",
      "created_utc": 1747284492.0,
      "score": -22
    },
    {
      "id": "msgeq1n",
      "body": "Is this loss?",
      "created_utc": 1747319710.0,
      "score": -11
    },
    {
      "id": "msei7by",
      "body": "You can do this... Stay strong and pray for the best for him",
      "created_utc": 1747287217.0,
      "score": -25
    },
    {
      "id": "msem1yl",
      "body": "This isn’t your best friend….your best friend would have wanted better for you. \n\nIf he finally made love to you after being your best friend and having secret feelings for you, his first instinct would not be to go hang himself.",
      "created_utc": 1747289337.0,
      "score": -74
    },
    {
      "id": "msejmm2",
      "body": "I guess it was of good enough to die for.",
      "created_utc": 1747287986.0,
      "score": -69
    },
    {
      "id": "msedoe3",
      "body": "…",
      "created_utc": 1747284904.0,
      "score": -74
    },
    {
      "id": "msh2c5o",
      "body": "It's truly, genuinely, never too late. Follow your own advice.",
      "created_utc": 1747326659.0,
      "score": 469
    },
    {
      "id": "msizy88",
      "body": "Just broke my heart. I'm sorry for your loss.",
      "created_utc": 1747347269.0,
      "score": 41
    },
    {
      "id": "msneb9k",
      "body": "100% agree yea see a therapist. That is a a lot of weight to carry around with you it can eat you alive. Sending hugs",
      "created_utc": 1747412826.0,
      "score": 8
    },
    {
      "id": "mt3kn2v",
      "body": "I’m so sorry you went through that too. Being there in those final moments is a powerful gift that no one can take away. And you’re right—seeking support is so important, even when it feels hard. Sending you strength.",
      "created_utc": 1747650446.0,
      "score": 1
    },
    {
      "id": "msfjxmt",
      "body": "As someone who has lived through the suicide of a good friend, trauma therapy (EMDR for me) has helped me so much.",
      "created_utc": 1747308838.0,
      "score": 58
    },
    {
      "id": "msf3x7m",
      "body": "[removed]",
      "created_utc": 1747300341.0,
      "score": -109
    },
    {
      "id": "msekxph",
      "body": "Probably something he thought of for a long time. Getting drunk made confessing his love easier despite having already having decided to check out.",
      "created_utc": 1747288711.0,
      "score": 443
    },
    {
      "id": "msk9qbr",
      "body": "According to studies the likelihood of attempting or committing suicide increases drastically while drinking or the day after drinking…unfortunately the nature of the substance makes you more vulnerable and less reasonable…\n\nI hope he’s at peace and I hope OP doesn’t take responsibility on themself",
      "created_utc": 1747364042.0,
      "score": 35
    },
    {
      "id": "msezvrs",
      "body": "[removed]",
      "created_utc": 1747297746.0,
      "score": -50
    },
    {
      "id": "mseu0ja",
      "body": "Unless he wrote a letter specifying the exact reasons, we just don't know. Speculation is the most unhelpful thing here to do.",
      "created_utc": 1747294017.0,
      "score": 125
    },
    {
      "id": "msebv0x",
      "body": "do u want plausible reasons or are you rhetorically asking",
      "created_utc": 1747284047.0,
      "score": 139
    },
    {
      "id": "msl8dmv",
      "body": "Sometimes an especially uninspiring performance requires a greater boo",
      "created_utc": 1747381683.0,
      "score": 1
    },
    {
      "id": "msfoxwy",
      "body": "maybe he dropped OP off at home the morning after and went back home? maybe consider that OP is going through something horrific and is grieving and a comment like this over some wording and a missing detail that is most likely completely irrelevant is the last thing someone in this situation would consider writing in a post about grief? OP is sharing the pain of her best friend hanging himself and youre worried about whether his bed is in his house or not",
      "created_utc": 1747310930.0,
      "score": 77
    },
    {
      "id": "msfodoh",
      "body": "there are about three replies in the comments that are 100% AI bots, and these accounts all were created 2 days ago, and for some reason they act like there OP, saying thank you for the kind words that other real accounts are saying to tbem",
      "created_utc": 1747310703.0,
      "score": 28
    },
    {
      "id": "msfp5s4",
      "body": "Bullsh!t or not, with the only single gain being some useless Reddit points, you really think it's enough to take the risk of hurting even more to comment that thing?",
      "created_utc": 1747311018.0,
      "score": 14
    },
    {
      "id": "msf1154",
      "body": "What the fuck is wrong with you",
      "created_utc": 1747298489.0,
      "score": 46
    },
    {
      "id": "mseflh0",
      "body": "come on man",
      "created_utc": 1747285861.0,
      "score": 14
    },
    {
      "id": "msem5bh",
      "body": "That is an awful thing to say",
      "created_utc": 1747289389.0,
      "score": 42
    },
    {
      "id": "msem644",
      "body": "Actual. Human. Beings.",
      "created_utc": 1747289402.0,
      "score": 41
    },
    {
      "id": "msett2l",
      "body": "hey dude, really hope you could see people for what they are. they're just like you, they have feelings, thoughts, imagination. it hurts a lil when a life is reduced to a joke. wouldn't you be sad if someone says this to u? you might have people you care for too.\n\nik u might be having a rough or bitter day, but don't be mean, please?",
      "created_utc": 1747293889.0,
      "score": 18
    },
    {
      "id": "msij59q",
      "body": "this^^^",
      "created_utc": 1747342076.0,
      "score": 76
    },
    {
      "id": "msiytrh",
      "body": "Do that",
      "created_utc": 1747346887.0,
      "score": 37
    },
    {
      "id": "msfwcfg",
      "body": "If this is OP you might wanna switch back to your throwaway",
      "created_utc": 1747313715.0,
      "score": 43
    },
    {
      "id": "msgp8nh",
      "body": "Why are you pretending to be OP?",
      "created_utc": 1747322812.0,
      "score": 28
    },
    {
      "id": "msel8g4",
      "body": "eh, probably, but something tells me he didn't want to confess and maybe tried to keep it a secret",
      "created_utc": 1747288876.0,
      "score": 89
    },
    {
      "id": "mskpdfx",
      "body": "me too, although it's a really weird situation",
      "created_utc": 1747370885.0,
      "score": -2
    },
    {
      "id": "msgoscz",
      "body": "Are you the OP under a different account?\n\n\nSorry ppl are downvoting you. ",
      "created_utc": 1747322680.0,
      "score": 6
    },
    {
      "id": "msgzym8",
      "body": "i get what youre saying, but it might not be…esp for ppl who process tragedy by getting in their heads. OP may or may not be reading all the comments, but whenever ive suddenly lost someone close to me, the first thing i do is try to parse it out in my brain; so saying its “the most unhelpful thing here to do” is a bit presumptuous, IF ppl are being respectful in their sharing.",
      "created_utc": 1747325951.0,
      "score": 6
    },
    {
      "id": "msedq3t",
      "body": "I don't know about him, but I'd certainly like some plausible reasons.",
      "created_utc": 1747284927.0,
      "score": 192
    },
    {
      "id": "msfzdb0",
      "body": ">maybe he dropped OP off at home the morning after and went back home? \n\nThat’s what happened. Sorry for the poor wording. I’m just tired.",
      "created_utc": 1747314778.0,
      "score": 150
    },
    {
      "id": "mslahsd",
      "body": "Usually I would agree but this one is too obviously fake. I mean OP says they were laying on his bed and had sex. And then he went home to take his own like. But he would have already been home if they were laying on his bed. He wouldn't have had to go anywhere",
      "created_utc": 1747383008.0,
      "score": 3
    },
    {
      "id": "msgc467",
      "body": "no, hes right, i saw this exact post copy pasted yesterday",
      "created_utc": 1747318923.0,
      "score": 2
    },
    {
      "id": "msennks",
      "body": "If I had a secret crush on my friend and finally got the opportunity to be intimate with them, I would never repay them by hanging myself. And I’ve been suicidal more times than I can count so don’t tell me I don’t know what it’s like",
      "created_utc": 1747290250.0,
      "score": -45
    },
    {
      "id": "msfxmdy",
      "body": "Real human beans!",
      "created_utc": 1747314166.0,
      "score": -19
    },
    {
      "id": "msfhgl6",
      "body": "i’m really hoping he just used joking as a coping mechanism and tried to lighten the mood, and he’s just not an asshole. But eh, it’s reddit, it’s probably rage bait, or a downvote farmer, but they basically are the same thing",
      "created_utc": 1747307724.0,
      "score": 6
    },
    {
      "id": "msg09l0",
      "body": "There are some people pretending to be me under this post. Please ignore any replies claiming to be me that are not through this account. ",
      "created_utc": 1747315084.0,
      "score": 209
    },
    {
      "id": "msgzhwq",
      "body": "Yes, he probably felt guilty that he tainted his friendship with her somehow, some people can feel like they're losing that friendship or have done something unforgivable if they fall in love with a friend.",
      "created_utc": 1747325813.0,
      "score": 47
    },
    {
      "id": "msgqh9g",
      "body": "No. Just one of the people under this post pretending to be me. Please ignore any comments that aren’t under this username.",
      "created_utc": 1747323173.0,
      "score": 48
    },
    {
      "id": "msev3c0",
      "body": "First thing that comes to mind to me is he had planned on doing it for a while and maybe had a bucket list to go through before he ends it for good. Maybe the last thing he wanted was to sleep with his best friend and let her know he loves her.\nI'm just surprised he didn't stay to see how it would go.",
      "created_utc": 1747294700.0,
      "score": 136
    },
    {
      "id": "msenk3e",
      "body": "it's not guaranteed to even be anything to do with them sleeping together, it could be for something completely unrelated to this",
      "created_utc": 1747290193.0,
      "score": 82
    },
    {
      "id": "mselhof",
      "body": "Post nut clarity. That's not a joke. That was his best friend. He was crazy drunk. They hooked up drunk. He gets home thinking he fucked everything up because he was drunk and took advantage of her being drunk, or that she didn't want it. Their friendship is now ruined. His best friend hates him. \n\n\nMaybe that wasn't his mindset, but it's definitely plausible it was. ",
      "created_utc": 1747289021.0,
      "score": 189
    },
    {
      "id": "msgho3i",
      "body": "theres no need to apologise for the wording, you're going through so much pain right now its understanable that you didnt include it. i just wanted to tell the original person i replied to that they have no right to question your story or your pain if they arent at least going to do so respectfully and acknowledge that youre grieving.\n\n i know how tired you must feel as my friends passed away very suddenly a few months ago in a car crash, different circumstances but the driver was one of my close friends and i have spent the past few months arguing with people questioning him and questioning me about it when he isnt even alive to defend himself and i know more about the situation that them. the original comment reminded me of my own experience with people like this and i understand how awful it is to see how unempathetic people can be\n\nim so sorry for your loss, i hope you can find peace and surround yourself with loved ones. remember the good times with him and hold those memories close",
      "created_utc": 1747320585.0,
      "score": 32
    },
    {
      "id": "mshms8n",
      "body": "No need for you to apologise. I apologise and stand corrected. Take care of yourself OP.",
      "created_utc": 1747332526.0,
      "score": 11
    },
    {
      "id": "msjl4vu",
      "body": "If you saw the exact same post, please link it. It’s easy to find, you just need to copy and paste the text into Google and it should pop up. ",
      "created_utc": 1747354800.0,
      "score": 2
    },
    {
      "id": "msgi8zq",
      "body": "Again, not saying it isn't. Just saying I think basic respect is the least we can do true or not, because there is no gain lying. If she is for Internet point, then be it, \n\nbut if she isn't lying and going in Internet to get it off her chest accusing her probably hurt more than a silly internet point fraud.",
      "created_utc": 1747320755.0,
      "score": 1
    },
    {
      "id": "msezci0",
      "body": "Yeah it's not that simple, that's a very childish way to look at the whole situation. You have no context for why he did it, what internal conflicts he may have had about it, if he was drunk when he did it, etc. \nI will tell you that you don't know what it's like for everyone.",
      "created_utc": 1747297396.0,
      "score": 17
    },
    {
      "id": "msenutk",
      "body": "The person reading this thread is in pain and what you commented would in no way improve that pain. Be respectful to her. I’ve also attempt d suicide several times and I would never say such a thing",
      "created_utc": 1747290365.0,
      "score": 23
    },
    {
      "id": "msneqfr",
      "body": "God people are weird, I'm so sorry for your loss.",
      "created_utc": 1747412948.0,
      "score": 3
    },
    {
      "id": "msxcxbp",
      "body": "Did he leave a suicide note or a bucket list? Maybe, he experienced post coital depression on top of a hangover?  Maybe, he just got bored with it all, before he understood that there was so much more?",
      "created_utc": 1747558290.0,
      "score": 2
    },
    {
      "id": "msgvj4q",
      "body": "Thanks for clarifying. That's such a weird move from others. ",
      "created_utc": 1747324639.0,
      "score": 12
    },
    {
      "id": "msg2xz5",
      "body": "I want to add that, if he was taking any antidepressants, the alcohol messes with the way most or all of them work, intensifying the side effects. So, it could’ve contributed to him going through with it. Only he would know, really, but it’s certainly a risk factor",
      "created_utc": 1747315989.0,
      "score": 33
    },
    {
      "id": "msxdb04",
      "body": "For all we know, she could be pregnant.",
      "created_utc": 1747558527.0,
      "score": 1
    },
    {
      "id": "mserpoc",
      "body": "Wow .U guys couldnt have come up with story lines where he killed himself due to fucking post nut clarity in Ur DMS. U had to do this under her post",
      "created_utc": 1747292613.0,
      "score": 94
    },
    {
      "id": "msf1w53",
      "body": "exactly",
      "created_utc": 1747299037.0,
      "score": 0
    },
    {
      "id": "mseo96k",
      "body": "That's definitely plausible. I feel so bad. People live my worst nightmares here on reddit",
      "created_utc": 1747290593.0,
      "score": 68
    },
    {
      "id": "mseohzg",
      "body": "I think it would improve the pain, actually, to come to terms with the fact that anyone who would do that to you was never really your friend in the first place",
      "created_utc": 1747290733.0,
      "score": -38
    },
    {
      "id": "mset211",
      "body": "For real. I feel like it’s a huge stretch too. We have zero context and people are making ridiculous jumps to say something that would make OP feel bad. OP, don’t listen to these people.",
      "created_utc": 1747293424.0,
      "score": 41
    },
    {
      "id": "msg43ww",
      "body": "As someone who has also been suicidal a lot, no. Suicide is abnormal. It is not always stopped by thoughts of friends and family. It is diseased thinking. The person is literally not thinking right, which is the premise for this thinking in the first place.",
      "created_utc": 1747316377.0,
      "score": 6
    },
    {
      "id": "msg5xh1",
      "body": "Dude could have passed on some random std and just didn't want to face the fact that he needed to disclose it. I'm going to agree that if I had finally confessed my love (and successfully made it into bed) to my friend, my first reaction would not be to kill myself. Sure everyone's different.  Seems really selfish all around. I hope OP can bring themselves to get tested and grieve properly.",
      "created_utc": 1747316972.0,
      "score": -8
    }
  ]
}