{
  "id": "1izufd7",
  "title": "I asked my daughter what she wants to do for her birthday this weekend and her reply made me cry.",
  "selftext": "My wife died around Christmas, it wasn't natural or accidental. She lost her battle with depression and it's been hard on us but we have been doing our best to manage. I'm trying to be strong for my daughter. She is only ten years old and it was hard on her especially because it was around the festive season . My daughter's birthday is this weekend and while we were just chatting during dinner last night, I asked her what she wanted to do for her day.\n\nShe usually looks forward to her birthday like any other kid her age and loves choosing what she gets to do. Although this time I was secretly hoping she would say something I can afford at the moment like she wants to get McD's or something like that but her reply completely threw me off. She told me that the only thing she wants for her birthday is to see her mom just one last time then she burst into tears. That completely broke me, I could only hug her and comfort her all while fighting back my own tears.\n\nI know it will get better in time because we do talk about how she's feeling about everything often and she also talks to someone at school as well but it just tore me up and I will never forget that moment.\n\n\n\n\n\n\n\n",
  "created_utc": 1740700951.0,
  "score": 6451,
  "num_comments": 215,
  "url": "https://www.reddit.com/r/offmychest/comments/1izufd7/i_asked_my_daughter_what_she_wants_to_do_for_her/",
  "comments": [
    {
      "id": "mf5z5fv",
      "body": "Go through photos, saved home movies, etc. Talk about the good memories. Cry with her. Make sure she knows how much you love her, and miss her mom too. Find funny things to remember, family fun things .",
      "created_utc": 1740701347.0,
      "score": 5180
    },
    {
      "id": "mf61jky",
      "body": "Something you may want to try:  we found online special paper (similar to tissue paper).  You can write messages on the paper, and then light it with a match.  The paper instantly burns up, and the ashes go upward.  We use it whenever we want to send a message up to Heaven.",
      "created_utc": 1740702139.0,
      "score": 1090
    },
    {
      "id": "mf6328l",
      "body": "I lost both my husband and my only child within one year of each other recently.  I am now raising my grandbaby on my own.  To celebrate both of them, I donate monthly to a pet rescue in my husband's memory and they have a plaque with his name on it. For my daughter,  I had a magnolia tree planted in our local state park that she loved to walk in.  Maybe something like that would help your daughter?",
      "created_utc": 1740702640.0,
      "score": 554
    },
    {
      "id": "mf651ih",
      "body": "OP, my mom died the day after my birthday when I was a kid (fell into a coma when it was my birthday) and for most of the years following my birthday was overshadowed by her death and not celebrated. While I was understanding of this it wasn’t helpful for my healing. \n\nI’d say respect her wish and do some of the suggestions but maybe also make it a day before and then let her birthday be about her. Maybe not this year but plan it for future years. \n\nThe death anniversary will always be sad so make a happy mom memories day with pregnancy stories and photos and such.\n\nAlso, I’m so terribly sorry for the loss of her for both of you. Hugs. 🩶",
      "created_utc": 1740703297.0,
      "score": 213
    },
    {
      "id": "mf6doym",
      "body": "My mom killed herself on Valentine’s Day when I was 12. If you’d like to talk about anything I’d be happy to. I was an only child so it was just me and my dad after that. It nearly broke me but I got through it and your daughter will too 💜 wishing you both healing",
      "created_utc": 1740706249.0,
      "score": 78
    },
    {
      "id": "mf60v56",
      "body": "I'm sorry for your loss. Thank you for being so vulnerable and posting this sad story. It's really helpful to those of us who sometimes have darker thoughts",
      "created_utc": 1740701914.0,
      "score": 149
    },
    {
      "id": "mf6hu9y",
      "body": "When I lost my son I asked his classmates to write me a memory they shared with my son. I got a hundred responses.  I discovered a side of him I never knew.  Maybe your families n friends can do the same of memories of your wife n daughter",
      "created_utc": 1740707684.0,
      "score": 71
    },
    {
      "id": "mf63s3t",
      "body": "Maybe you could make her a scrapbook with family photos?",
      "created_utc": 1740702878.0,
      "score": 27
    },
    {
      "id": "mf63sdb",
      "body": "Get her a beautiful framed photo of her and her mom or you guys as a family",
      "created_utc": 1740702881.0,
      "score": 20
    },
    {
      "id": "mf6526t",
      "body": "I'm so sorry for your loss.  My best friend also lost her battle 2 days before Christmas leaving behind 2 beautiful little girls. Knowing how to comfort them feels impossible.  Sending hugs to you all 💜",
      "created_utc": 1740703303.0,
      "score": 20
    },
    {
      "id": "mf69dh9",
      "body": "And now I'm sobbing , this post hits hard",
      "created_utc": 1740704752.0,
      "score": 17
    },
    {
      "id": "mf69uir",
      "body": "You are an awesome dad/parent.\n\n\nI love how in tune you are with your daughter while also dealing with your own grief.\n\n\nYou are a rockstar \n\n\nWhen my son was younger, he loved hearing stories (especially the funny stories) about what he did when he was a toddler.\n\n\nHe also enjoyed hearing stories about the silly things I did in my youth \n\n\nHe also loved looking through photo albums of him throughout his life \n\n\n\nI had so many thoughts/suggestions/ideas for you as I read your post, many of which have already been posted.\n\n\n\nI think my favorite idea is to find a way for your daughter to share with you what her favorite picture is of her mom or the two of them together.\n\n\nTake that picture and have it printed on a blanket. The thought is that her mom is hugging her when she uses it.\n\n\n\nKeep doing what you are doing; you are rocking this!",
      "created_utc": 1740704915.0,
      "score": 12
    },
    {
      "id": "mf78lqo",
      "body": "op, all of these suggestions are really\nreally good. i’m a therapist who specializes in risk (suicidality and homicidality) assessment, crisis intervention, and depression and anxiety. i’m sure you know the genetic component to mood disorders (depression and anxiety fall into this category). however, a less known fact is:\nwhen a child has a parent or immediate family member complete suicide before the child is 13 yrs old, the chances of that child completing suicide themselves, increases by 50%.\n\ngrief and trauma counseling is vital for both of you. unless the school counselor specializes in grief and loss, specifically due to suicide, i recommend that you search for  a therapist who does, for both of you.\n\ngrief is complex, but grief due to loss by suicide can be vicious and chaotic. grief never ends, but the sooner one gets help with how to manage that grief, the greater the chances are that life will move\non without grief overtaking it forever. \n\ndepression and anxiety are not\nthe same as grief, but can develop if adequate support isn’t available. \n\nyou sound so supportive and loving, but you’re in the depths of this tragedy as well; you both need specialized professional support. i wish peace and comfort for you both. ♥️",
      "created_utc": 1740717601.0,
      "score": 15
    },
    {
      "id": "mf6t2dx",
      "body": "my dad also lost his battle, and i was 9 years old. always talk about her. look at pictures with her from her entire life and talk to her about those moments. keep as many videos as you possibly can so she can always remember her voice and listen to her when she needs her mama’s voice. see if she would like to go look into mama’s closet and take some sleep shirts or hoodies/jackets/sweaters. if she wore perfume, she can spray it on the shirt/hoodie/whatever when she just needs a mama hug. i’m sending you guys all of my love and so much patience and comfort. i am so so sorry for your loss. 🤍",
      "created_utc": 1740711655.0,
      "score": 9
    },
    {
      "id": "mf6tz14",
      "body": "Wonder if OP would let us send birthday cards to a PO box or something? This broke me. My youngest girl is 11, and I just can't imagine how lost your little girl must feel. Maybe an outpouring of love, advice from girls, and a reminder of the light in the world would help in some way .",
      "created_utc": 1740711980.0,
      "score": 9
    },
    {
      "id": "mf71x0k",
      "body": "There are some really beautiful ideas in this post already.           \n\nHere are mine:          \n\n* smell is the strongest link to memories. So if your wife had a perfume, soap, deodorant that she used regularly, get your daughter a mini sized one or pop some in a leakproof container so she can smell it anytime she wants to.           \n\n* in the tv show Criminal Minds one of the characters wives is killed and she left behind a young son and husband. They had a candle that lived by his son’s bed, they would light it and “talk to Mum”. I always thought it was beautiful as it’s like turning on a light to get mums attention so she can listen to whatever they have to say.            \n\n* ask anyone and everyone who knew your wife to write about her in whatever format (handwritten, typed, or even video) especially when she was younger - it’ll be a great thing for your daughter to read as she gets older. Let people know not to censor anything, that you’ll do that for your daughter - at 10 she’s a bit young to hear about drinking and skinny dipping for example. Also ask for copies of photos and anything else they have. It’s to build a memory book for your daughter and you. A way for you both to connect to her.         \n\n* any video or voice recordings you have of your wife get someone who’s good with tech to duplicate it on to multiple different cloud storage or usb sticks. People often comment they forgot what someone sounds like. This will give you both something to play/watch when that happens.           \n\n* While she’s grieving her Mum, you’re also grieving your wife, you need to allow yourself space and time to do so. It’s also good for your daughter to see you grieving. Not to the extent she feels like she has to care for you. So reach out to people to take care of your daughter while you go for a drive, see a friend, or a therapist, or a support group, both of you need support.           \n\n* I say this with deep compassion, given how she died, both of you may experience anger, even rage at her and that is absolutely normal. It’s incredibly normal, and healthy. Please remember to let it out in healthy ways - you can write her a letter, yell into the void, punch a pillow etc. Your daughter can express these emotions to you, and you need to be supportive but not judgemental or try to change her mind. Let her  vent, express herself and give her options for outlets. You however, need to find one or more safe people you can talk to about it. You can love your wife, know logically what happened and why, doesn’t mean you can’t be angry at her. It doesn’t mean you hate her, or miss her any less, it’s an emotion that will pass.        \n\n* this is off topic for birthday, she’s 10 so it’s likely she’ll start her period sooner rather than later. I’m not aware of any period products that expire so when you can start a little emergency kit. Pads - with and without wings, various sizes, tampons again various sizes, hot water bottle or heat pack you can pop in their microwave. If you’re not sure if your wife spoke to her about periods, in a few months you’re going to need to. This will likely be the first uncomfortable thing you need to talk to your daughter about, but you can do it and you’ll do just fine at it. Please tell her that while cramps are normal, so is a little pain but if she’s in serious agony, it impacts her ability to live her life to let you know so you can get her to a gynaecologist.              \n\nYou’re an amazing Dad, I know this by how open she is with you.            \n\nI’m sorry to both of you for your loss.",
      "created_utc": 1740714915.0,
      "score": 8
    },
    {
      "id": "mf64su1",
      "body": "Is there anything that belonged to your wife that your daughter could have as a reminder? I know she’s a bit young but for example a piece of jewelry?",
      "created_utc": 1740703217.0,
      "score": 9
    },
    {
      "id": "mf6fld7",
      "body": "I lost my dad when I was 10 also around Christmas. Please keep pictures up and talk about her. When she gets older she will go through an angry phase, that’s normal. Just talk about your wife and remind her how much she loved her.",
      "created_utc": 1740706909.0,
      "score": 8
    },
    {
      "id": "mf8hosu",
      "body": "This might be morbid to some, but if you laid her to rest, why don’t you have a picnic with her at the cemetery? You can get your daughter‘s favourite foods and bring some memories along to share. Take her to the mall and let her pick out a few things. Maybe she’ll find something there that reminds her of her mother or that she and her mom always talked about doing like getting her ears pierced.\n\nMy deepest condolences to both of you.",
      "created_utc": 1740742609.0,
      "score": 7
    },
    {
      "id": "mf64tmp",
      "body": "Maybe gather all digital photos of her mom and work together to put a photobook together? I use Shutterfly but there are other apps. You can customize each page. It is fun as you’ll see a photo and remember why it was taken - and it brings back good memories. ❤️❤️ so sorry for your loss",
      "created_utc": 1740703225.0,
      "score": 7
    },
    {
      "id": "mf6a997",
      "body": "Poor baby, I’m so very sorry for the loss for both of you x",
      "created_utc": 1740705056.0,
      "score": 7
    },
    {
      "id": "mf6bin3",
      "body": "Hi there, I’m so sorry for your loss. My mom committed suicide when I was 16 years old around the time of Thanksgiving. It was really really difficult as I’m sure you know, and I was dreading Christmas time because i couldn’t stand the thought of having to celebrate that day without her. My dad made it a time for me and my sister where we could all just come together, laugh, cry, and remember her and all the great traditions she brought into our lives. I definitely agree with going through happy photos and videos, and maybe if there’s something that her mom liked doing for her on her birthday, you could continue that tradition with her as well. This is such a difficult and unfortunate time, but she is so lucky to have you. You will have times where you feel helpless and like you are not doing enough, and I promise that you are. Sending you lots of love, I’ll be thinking of you and your daughter 💗",
      "created_utc": 1740705494.0,
      "score": 8
    },
    {
      "id": "mf64j9a",
      "body": "I had a friend recently lose their childhood pet. In the name of love for them I got them a specialty trinket that was designed around their pet. \n\nMaybe they have something similar for a lost too soon mom? \n\nMaybe y’all could fill up a box and call it the “we love mommy” box and have it with memorabilia or even just things that make y’all think of her and use that as a bit of a coping skill.\n\nGrief is meant to be shared and it’s really fucking hard. I’m sorry y’all are goin through this.",
      "created_utc": 1740703130.0,
      "score": 13
    },
    {
      "id": "mf6jl4i",
      "body": "Time to make a scrap book! Your gift to her could be the supplies and spending time with her making this!!",
      "created_utc": 1740708295.0,
      "score": 4
    },
    {
      "id": "mf6pw21",
      "body": "Maybe you could put a photo album together for her with pictures from moms childhood and growing up and your early years as a couple or get video clips of people telling their favorite stories of her mom.  Reach out to family and your wife’s friends to see if the might help with this gift for your daughter.",
      "created_utc": 1740710526.0,
      "score": 4
    },
    {
      "id": "mf7d1zl",
      "body": "I doubt you’re looking for advice, op, but maybe something nice and affordable could be to have a picnic at the gravesite? Bringing flowers and sharing your favorite memories might be somewhat comforting.",
      "created_utc": 1740719548.0,
      "score": 3
    },
    {
      "id": "mf7fwxq",
      "body": "My daughter lost her father, and I lost my husband, to his fight with depression. It's a terrible sickness and I won't give you the usual words of condolences. I am truly sorry for your pain, and your daughter's pain. If I could undo what's happened, I would, because no one deserves to feel it. All I can suggest is what I did for my own daughter: give her all your love, let her know that her mother lives inside her, and everywhere she goes she carries her mom with her. Be strong when you feel weak. Good luck",
      "created_utc": 1740720846.0,
      "score": 4
    },
    {
      "id": "mf6icyz",
      "body": "Cry with her. It’s okay to cry with her. Being strong doesn’t mean you can’t feel the feelings with her. She may need it. You’re doing great Dad, hang in there! ❤️",
      "created_utc": 1740707865.0,
      "score": 3
    },
    {
      "id": "mf6rkhx",
      "body": "I am so sorry for your loss. What was helpful for me after losing a loved one was actually sit down and talk about him. Maybe you and your daughter can revisit a special place that you guys went before?",
      "created_utc": 1740711121.0,
      "score": 3
    },
    {
      "id": "mf6z1af",
      "body": "Maybe make a mom day for her - take her to places you went when you dated your wife, or her childhood home….tell your daughter things she never knew about mom. Share funny stories. Maybe embarrassing ones. Even though mom isn’t around she can “see” mom through these experiences.",
      "created_utc": 1740713833.0,
      "score": 3
    },
    {
      "id": "mf6zd3f",
      "body": "Have her write a letter to her mom and get a Chinese lantern. If possible, take her somewhere special and release the lantern with the note attached. I don't know if the lantern will float with the letter on it, but maybe have her read the letter while it takes off.",
      "created_utc": 1740713956.0,
      "score": 4
    },
    {
      "id": "mf7ft2v",
      "body": "Invite people who loved her mom to make videos and tell stories on camera. Their favorite stories from when they met, it how she made them laugh, or something silly she did. Or her best qualities, things they admire about her. Especially have them share stories from when her mom talked about her. \n\nMemories fade. Grab those stories, freeze then in time, and give your daughter the gift of getting to know more about her mother through the eyes of those who loved her the most. She can take that with her always.",
      "created_utc": 1740720797.0,
      "score": 3
    },
    {
      "id": "mf80bdg",
      "body": "Plan a one last birthday evening with mom ( put together a video, her favorite takeouts, look at photos together, talk about her, write a letter to her )\n\nThis will help both of you towards closure whole it will a good memory for her. \n\nAlthough make sure you still have her favorite things planned for a little while ( her favorite cake/cupcake ) her favorite movie u can watch together. If you have good friends of your wife who you share good bond with they can come and share photos and stories from their archives too.\n\nKeep it about the kid but also owe it a little to the mother while making sure she realises that this is for her! And we won't do it every year!",
      "created_utc": 1740732132.0,
      "score": 4
    },
    {
      "id": "mf6iftg",
      "body": "Take her to build a bear and get a stuffed animal with a recording of her mom’s voice in it! If she’s turning 10 you can get the birthday bear which will be $10. Spend the day celebrating her and her mom - maybe by visiting a playground they’d go to together or something! Sending y’all love.",
      "created_utc": 1740707893.0,
      "score": 6
    },
    {
      "id": "mf666o2",
      "body": "I'm so sorry for your guys' loss. Maybe you could print off a bunch of pictures of your wife and her and you and get some craft supplies and help her make a scarp book/photo book while watching a favorite movie and having snacks and stuff. Then, if she ever wants to look back, she can just pull that out, and it can help with the grieving process, plus she has a keepsake.\n\nMy nephews lost their dad at a young age and looking at photo albums are their favorite.",
      "created_utc": 1740703673.0,
      "score": 3
    },
    {
      "id": "mf70n8m",
      "body": "I am so sorry for your family's loss. I lost my Mom at the same age, around the same time of year....Im now in my early 30s, my birthday just passed on Monday, and I sat at the cemetery for a long while with my mom. It's all i wanted to do. \n\nI know your daughter's birthday is this weekend and you were looking for more of an affordable gift; maybe together picking out her favorite picture of her Mom and getting it printed and framed for her nightstand or the fridge, or TV stand? Somewhere high traffic where she can see it often. I'm sure you can do this inexpensively at your local pharmacy like CVS or Walgreens for printing, Dollar Tree or Dollar General for a frame.\n\nAlternative or future gifts more on the costly side: a necklace with her mother's photo etched onto it (my siblings and I received these for xmas right after my mom passed, best gift ever), maybe getting your daughter a bottle of mom's perfume, or collecting some of mom's clothes/old tees to have made into a quilt or stuffed animal for her. There are so many creative sites for those kinds of things! \n\nSending you both so much healing prayer, comfort, and love!",
      "created_utc": 1740714433.0,
      "score": 3
    },
    {
      "id": "mfb7vxs",
      "body": "I know I’m late to this post, but it might be nice to get her a locket with a photo of her mom inside, so she can see her anytime she wants. Sending lots of love to you and your daughter ❤️",
      "created_utc": 1740773688.0,
      "score": 3
    },
    {
      "id": "mfbpyo5",
      "body": "I’m so sorry that you and your daughter have had such a tragedy. My sons were 5 and 8 when my husband took his own life and they unfortunately found him before I did. Get her in all the therapy you can, keep doing what you’re doing about keeping the communication going with her about her feelings. It never goes away unfortunately, but my boys are 20 and 23 now and I can say that some days are much easier than others and sometimes you get lucky to have a day or two where you don’t think about it, but please keep her in therapy and just keep being the best dad you can",
      "created_utc": 1740778755.0,
      "score": 3
    },
    {
      "id": "mfcmi1w",
      "body": "Your daughter is lucky to have a father like you. I'm sorry for your loss, I know how hard it can be. I hope you two find peace and happiness.",
      "created_utc": 1740788925.0,
      "score": 3
    },
    {
      "id": "mf6ciyl",
      "body": "I don't have any suggestions, I just wanted to say I'm sorry for your loss.",
      "created_utc": 1740705845.0,
      "score": 4
    },
    {
      "id": "mf67d1p",
      "body": "Make her a scrapbook or a video of al things mom. \n\nMaybe take to to a special place. \n\nLet her cry. Let her see you cry. Show her it's okay to have feelings.",
      "created_utc": 1740704069.0,
      "score": 2
    },
    {
      "id": "mf67nv0",
      "body": "Does she like to write? Do you like to write? like expressing yourself etc? I'm keeping my questions vague so I don't just dump onto you what I \"think\" might work. I lost my mom to natural causes at the age of 25. I'm almost 37 now. I still feel like a kid when I think about her and cry. To this day. \n\nThis really touched me. Either way, I really wish you and your daughter the best. I'm the father of a 3 year old daughter and yeah, I'll leave it at that for now. Much love.",
      "created_utc": 1740704167.0,
      "score": 2
    },
    {
      "id": "mf683ra",
      "body": "Maybe for her birthday, being that she is so young, you could take her for a picnic at her mothers favourite spot or place or somewhere nice like the river or beach, get some McDonald’s or whatever food of choice, reminisce over some favourite memories & let some coloured balloons off into the sky. You could talk about how proud of her you are & just how proud her mother would be of her. You could say that once they reach the top, her mother will get to share those balloons. \n\nMy heart goes out to you, this would be an extremely difficult & sad situation and experience. Sending you love, light & hope 💜",
      "created_utc": 1740704317.0,
      "score": 2
    },
    {
      "id": "mf6bfzy",
      "body": "OP I’m very sorry for your loss, I know how painful grief is and it’s not an easy thing. I hope the best for you and your daughter, please know you have a ton of support behind you whether you realize it or not.\n\nI lost my dad suddenly when I was 14, he was 41 I believe, back in August 2015. Some suggestions I think of is maybe you can create a tradition with your daughter. On my dad’s birthday for instance, I’d buy a dessert (usually cake, but I’ll get a pie or something instead depending on what’s going on) and have it as his “birthday cake” since he was a real sweet tooth. You can always do something similar, like buying your wife’s favorite sweet/dish/snack and doing something she would’ve loved; walking on the beach, favorite movie of hers, something to live her memory by. It can be a great way to remind your daughter of the good memories she has with her mother, and you can help remind her of your wife by sharing memories/stories. Sharing memories should be a regular thing of course, but doing a reminder is always good on the special days.\n\nAlso, this is something close family-friends did for my brother and I. Can’t remember when it happened, but they took two of my dad’s t-shirts (that were his favorite) and stuffed/sewn them into tshirt pillows. I still have mine, but when I missed him I’d hug the tshirt pillow since his hugs is a thing I miss. Do you have shirts or something that you can use to turn it into a pillow or even a blanket? I’ve seen families online make clothing of a passed loved one into a quilt as well, I’m sure it’d be a treasured item your daughter would love.",
      "created_utc": 1740705467.0,
      "score": 2
    },
    {
      "id": "mf6dyco",
      "body": "Depending on her age, you could do scrap booking with her. Go through magazines and find her mums favourite stuff and make a collage. You could make a book or make a poster board. It would be a nice memory and activity to talk about her",
      "created_utc": 1740706340.0,
      "score": 2
    },
    {
      "id": "mf6jh87",
      "body": "Just when I thought life was tough as a single dad… this was hard for me to not to cry for you sir. So sorry for your loss. So sorry for your daughter. I have a daughter and she is only 6. I couldn’t imagine…. Love her! Love yourself! Keep on being the good dad that you are being and good luck to ya.",
      "created_utc": 1740708257.0,
      "score": 2
    },
    {
      "id": "mf6obr3",
      "body": "Maybee put together a slide show of photos and videos and present it to her on her birthday. So sorry for your loss. You sound like an amazing dad and I am sending you and your daughter so much love.",
      "created_utc": 1740709971.0,
      "score": 2
    },
    {
      "id": "mf6rhkf",
      "body": "Is there maybe a special place (i.e.- a park, a curtain scenic spot local to you, ect) that you and your wife would go to often before you had your daughter? Maybe a spot you just kinda stopped going to as your daughter got older (life gets busy)? What I'm getting at is maybe take your kiddo to a spot that had meaning to her mom that maybe she hasn't been to? Hit up the dollar store and get some snacks your daughter likes and maybe some snacks your wife enjoyed. Pack a blanket or lawn chairs. Maybe fire wood for a small fire. And just sit. Talk if she needs to talk. Be silent if she needs to sit in silence. Cry with her if she needs to have a good cry. Make a day out of it. Pack her favorite things from around the house. Is she an artist? Bring her sketch pad. Is she a reader? Grab her favorite couple books off the shelf. You get where I'm going. Was her mom into playing cards? Maybe bring a pack of cards you have laying around. Budget friendly and super thoughtful.  It sounds like you are one of the good dad's out there, sir. I get the impression you know your kiddo well enough to make it an enjoyable day, despite everything going on. Keep up the great work buddy!",
      "created_utc": 1740711092.0,
      "score": 2
    },
    {
      "id": "mf6ynw9",
      "body": "Why fight back tears? Express your emotion - it doesn’t hurt children. I’m sorry for your loss bro",
      "created_utc": 1740713693.0,
      "score": 2
    },
    {
      "id": "mf700t4",
      "body": "Hugging and comforting her is exactly what she needs. I’m so sorry for you both.",
      "created_utc": 1740714201.0,
      "score": 2
    },
    {
      "id": "mf708gy",
      "body": "Please know it's ok and likely good for her to see you cry as well.",
      "created_utc": 1740714279.0,
      "score": 2
    },
    {
      "id": "mf760ze",
      "body": "Take her to a craft store and pick out scrap booking supplies and together make a memory book of the 2 of them together. You can also take one of your wife's old shirts and have it turned into a stuffed animal or a pillow for her to be able to cuddle. There are people that do this professionally, but if you don't don't have the funds, message me, and I could do it for free.",
      "created_utc": 1740716521.0,
      "score": 2
    },
    {
      "id": "mf7938f",
      "body": "I feel for her and completely understand.\n\nMy grandmother died in September, and I'd cut off a limb to have another day with her. \n\nI'm an adult, with adult and teen children, and hurt this much still.\n\nSending mum hugs ❤️",
      "created_utc": 1740717809.0,
      "score": 2
    },
    {
      "id": "mf7gfol",
      "body": "I get it. My mom died when I was 6. I’d like to see her again.",
      "created_utc": 1740721094.0,
      "score": 2
    },
    {
      "id": "mf7lgjp",
      "body": "Listen to Mom’s favorite song and dance and cry to it. Sending you love.",
      "created_utc": 1740723570.0,
      "score": 2
    },
    {
      "id": "mf7lz2i",
      "body": "I'm so sorry for your loss. She lost her Mom so young. Your daughter's response just shows how much she loves and misses her mom. For her birthday, maybe you could do something that honors her mom in a gentle and positive way like making her favorite meal or even writing a 'message to Mom' traditional. Write notes or draw pictures together then tie them to a balloon and let them drift into the sky. Or, if you want to keep them close, put the messages in a special ‘Mom Box’ where she can add thoughts, memories, or even small things that remind her of her. It gives her an outlet to express what she’s feeling in a way that’s both personal and healing.\n\nAside from that, try doing hobbies with your daughter like walking outside and riding a bike. I found them very helpful in coping with grief. What's important is that you're giving her the most important thing which is your love and support. Wishing you both comfort and healing <3",
      "created_utc": 1740723840.0,
      "score": 2
    },
    {
      "id": "mf7mrv9",
      "body": "Grief is all the live she has to give with nowhere to go. Go do some nice things for people. Honor Mom in some way. Wishing your daughter a birthday you both can enjoy together.",
      "created_utc": 1740724264.0,
      "score": 2
    },
    {
      "id": "mf7n0lc",
      "body": "if you have any saved voicemails, voice memos, videos, etc. of your wife, you can have the recording transferred to a build-a-bear (or something similar) which could be a meaningful gift to your daughter. \n\nwishing you both health and healing ❤️‍🩹",
      "created_utc": 1740724393.0,
      "score": 2
    },
    {
      "id": "mf7vty0",
      "body": "My mom died when I was 13. \n\nMany years later my mothers cousins wrote their memories of her, collected them together and gifted to me snd my sibling. Reading felt a bit like meeting mom again, since I learned something new about her. I got to read stories about how she was as a teenager, and what she was like before she became a mother.\n\nMaybe you could ask your wifes friends and relatives to write something about her?",
      "created_utc": 1740729382.0,
      "score": 2
    },
    {
      "id": "mf7w73v",
      "body": "You don't have to fight back your tears every time.  Good for you both to see that in each other, allows you both to feel and comfort each other appropriate with your relationship.",
      "created_utc": 1740729598.0,
      "score": 2
    },
    {
      "id": "mf81xyh",
      "body": "I am so sorry that you and your daughter lost someone so special....It takes a long time to get through the grief...Just be there for each other, share happy and funny memories and look at photos/videos! Take her to Mickey D's! I am keeping you both in my prayers...🙏🏻💙🤗",
      "created_utc": 1740733178.0,
      "score": 2
    },
    {
      "id": "mf8a6a9",
      "body": "Hey. I was your daughter. If you have any voicemails, or videos, or anything with her mother in them, especially if she’s speaking to your daughter, play them for her. Make sure she never forgets the sound of her mother’s voice. If you have some of her favorite scent, or her shampoo, save it. Take a tshirt of your wife’s and spray a little of the perfume into it, or wash your hair with her shampoo and rub your hair with the shirt. Anything to transfer the scent. Put the shirt on her favorite teddy bear and refresh the scent from time to time and tell her that any time she misses her mom, to hold the teddy close and tell her to smell it. Write down what her perfume smelled like, what her shampoo smelled like. Our sense of smell and our sense of hearing are the things that make us recall memories the most. I was younger than your daughter, and my mom’s perfume smelled like gardenias. I didn’t know that, just the brand. One day, when I was 19 years old, I walked by something that smelled of gardenias and I was like what on earth is that smell, why do I recognize it? It’s because of my mother. Go get a journal, a nice one, from Staples or your chosen office supply store. Write in it the memories you have of your wife. From how you met, all the way to before her death. If you can get your friends and her family to do the same thing it’ll matter. Save all the pictures and videos you have of your wife on social media for your daughter. Make a scrapbook. I hope you have home movies and hopefully she had home movies from before she met you. Watch them with your daughter. Tell her all the good things, and the bad things when she’s ready. But don’t be afraid to talk about your wife. Don’t be afraid to let your daughter see how sad you are. You’re mourning your wife, your partner, but she’s mourning her mother and she needs to see that you care. Hell, pick her up and hold her in your arms and cry together. Give her space to feel what she feels. Give yourself space. Get yourself and her into therapy, both family therapy together and individually. Hold your little girl tight. I’m so sorry. If you need anything or any more ideas, let me know. I’m here for you both. I was 8. I gave you the advice I needed my dad to have done for me. Tell your daughter her mother is her guardian angel and always watching her and won’t ever leave her. Hell, lean the fuck into it and buy an angel figurine for the house, like her room. If she asks what happened, please for the love of everything in this world do not lie to her. But make sure you tell her her mother loved her and wouldn’t have gone away if she wasn’t in the pain she was in. But even if she’s not there anymore, she’s still with her daughter in her heart and her mind and she can carry her with her everywhere she goes. My heart breaks for you. I never wanted another little girl to go through the hell I did. If anything I suggested helps, then good. I’m so sorry. Please tell me if there’s anything I can do. It’s okay, to break in front of her. Being strong is good, but it’s also important for her to see you sad. Sharing in the sadness is what you can do right now.",
      "created_utc": 1740738327.0,
      "score": 2
    },
    {
      "id": "mf8ekx3",
      "body": "A saying I’ve been leaning on more as I age is “talking about people who have passed means they’re not really gone”. Our Dad was KIA in Vietnam when my siblings and I were 18m - 12y. My mom basically had us stop talking and asking about him.  To this day, hearing any details about him is lovely. Tell the stories and share your grief. You’re both trying to figure out what life looks like now, do it together. Tell how you met, those things that were tiny but important to you, get counseling.  Admit you’re struggling too and promise you two will get to better times.",
      "created_utc": 1740740931.0,
      "score": 2
    },
    {
      "id": "mf8i428",
      "body": "Happy birthday to her. I hope you both find growth and a new way to honor her memories and continue on in this world despite the loss. \n\nNew traditions can always be applied specially if it brings you guys closer on a missing or enjoying the memory of a lost one. May she always RIP.",
      "created_utc": 1740742827.0,
      "score": 2
    },
    {
      "id": "mf8mga3",
      "body": "If you can, maybe see if there’s anyone local who can sew a memorial teddy bear out of a piece or two  your wifes softest clothing. I really wanted to do this for my girls when their nana died, but it was unfortunately too expensive to have 3 made. \n\nAnyway, it might make for a nice keepsake that she can cuddle when she misses her mama. \n\nIm truly so sorry for your loss. I can’t imagine being in your shoes , but i wish you and your sweet girl all the best",
      "created_utc": 1740744918.0,
      "score": 2
    },
    {
      "id": "mf8pfin",
      "body": "I am so sorry. My husband died a year ago so I get it. My son is 14 now. Hugs to both of you.",
      "created_utc": 1740746214.0,
      "score": 2
    },
    {
      "id": "mf8qjo3",
      "body": "I'm turning 47 tomorrow. I lost my dad last year. That's all I want too. 🩷💜🖤🩷💜🖤",
      "created_utc": 1740746678.0,
      "score": 2
    },
    {
      "id": "mf8u6is",
      "body": "I wanted to say that it’s okay to cry. My deepest condolences to you and your family.",
      "created_utc": 1740748118.0,
      "score": 2
    },
    {
      "id": "mf8ypo8",
      "body": "Go to the grave and spend time maybe take a few pics..  \nI really think suggesting looking at old pics and videos can do more damage than good. Kids are more empathetic and it can play on her mind. Maybe do that when she's older. What you want to do is make her comfortable and have her talk what's worrying her  if she wants to",
      "created_utc": 1740749786.0,
      "score": 2
    },
    {
      "id": "mf90ndn",
      "body": "OP did she or/and you are in therapy, that might be a good idea after such traumatic event. \n\nHope both get better in time and that she can enjoy her birthday even in grief.\n\nGood Luck.",
      "created_utc": 1740750463.0,
      "score": 2
    },
    {
      "id": "mf93f32",
      "body": "My deepest condolences on the loss of your wife",
      "created_utc": 1740751418.0,
      "score": 2
    },
    {
      "id": "mfbgebz",
      "body": "I lost my dad when I was 7.  It was accidental, sudden, heartbreaking.   Reading this made me tear up.  I know 100% that is the only thing that your little girl wants, and it’s heartbreaking not being able to do anything for her on top of processing your own grief.  I’m so sorry for your loss.  May she finally be at peace 🤎 \n\nMy nana (Dad’s mom) made me and my sister CD’s (this was 17 years ago) of all kinds of pictures and videos she and other people had of our daddy.  This was especially nice to hear his voice in some of the videos we have of him.  Ranging from baby pictures all up to the last known pictures of him.   I still have these CDS, photo albums, giant t shirts and sweat shirts of his.  I watch them whenever I feel like I need to.  When I was little, this was likely weekly that I watched these videos.  I didn’t obsess, but it gave me some grace in processing what had happened.  I was old enough to remember him and have memories together, but young enough that I didn’t fully grasp the weight and finality of what happened.  I grieved each year proceeding differently as I would continue to grasp what not having dad for the rest of my life would mean.   These CDs kept his and mine memories alive and well.   I will never be able to express how grateful I was that she did that for us.  She also made us each our own quilt out of his t shirts, jeans, sweaters.  Having items like these kept him alive in some ways and allowed us to always have a piece of him.   Maybe you have a friend who could if you have her things still, or could watch some youtube videos to learn to sow?    The CD was the best part though.   Hope you can find something to carry her with you guys.  Sending my love and condolences 🤎",
      "created_utc": 1740776085.0,
      "score": 2
    },
    {
      "id": "mfdb09n",
      "body": "I’m so sorry for your loss. Maybe you could buy a blank notebook and write down a bunch of things that you remember about your wife that she may want to know? Stories about your wife’s childhood, friends, and happy memories.\n\nIt could be a nice way to commemorate her and you could keep adding to it as time goes on and you think of more things to add.",
      "created_utc": 1740797430.0,
      "score": 2
    },
    {
      "id": "mfe67m0",
      "body": "Hey! As a parent of 5 kids that lost their dad the same way, but 5 years ago, please still make her day special, cake, a photo of mum, visit her grave, or a necklace with her ashes in it. The road you’re on his hard, and it’s not getting easier anytime soon. But you’ve got this! My kids and I wear their dad’s shirts, have necklaces with his ashes and regularly watch home movies etc with him in them to have a group cry. Let her see your hurt. It’s so hard; but I didn’t; and my kids thought I wasn’t grieving too",
      "created_utc": 1740810826.0,
      "score": 2
    },
    {
      "id": "mf671eb",
      "body": "Let her know that is also OK if she is mad as hell",
      "created_utc": 1740703960.0,
      "score": 1
    },
    {
      "id": "mf67d5s",
      "body": "Special occasions after a loss just highlights who is not there share them with you. This is especially true in the first year or 2. Hugs for you both",
      "created_utc": 1740704070.0,
      "score": 1
    },
    {
      "id": "mf67js5",
      "body": "Maybe if there is something of your wife's (like a piece of jewelry or something), that could be very sentimental, but maybe not super expensive (kids can lose even the most special things), put it in a nice box and wrap it up for her? Give her a piece of her mom for her birthday. Or maybe give her a book with photos and written out memories...from you, from other family, from mom's friends?",
      "created_utc": 1740704130.0,
      "score": 1
    },
    {
      "id": "mf6c4nc",
      "body": "Use your phone and take pictures of your wife and  and put some music to it and Make a video",
      "created_utc": 1740705707.0,
      "score": 1
    },
    {
      "id": "mf6fykb",
      "body": "Her reply made me cry too OP. There's some great suggestions here, hopefully you two have a very special day!",
      "created_utc": 1740707034.0,
      "score": 1
    },
    {
      "id": "mf6ik29",
      "body": "Damn 🙁",
      "created_utc": 1740707934.0,
      "score": 1
    },
    {
      "id": "mf6iru5",
      "body": "Follow a lot of the good suggestions here to honor her mother on her birthday. But also end the day by celebrating your daughter. Buy little Cesar pizza or a frozen pizza at Walmart. Get pop corn, chips, drinks, and candy from dollar tree or any dollar store and watch any movie.",
      "created_utc": 1740708008.0,
      "score": 1
    },
    {
      "id": "mf6jgh2",
      "body": "sending both sympathy and love, I wish you both the time to heal your hearts",
      "created_utc": 1740708250.0,
      "score": 1
    },
    {
      "id": "mf6kn3q",
      "body": "Maybe you could have a teddy bear made from an item of clothing that still smells like her mum. Something she can cuddle up to and keep forever. Also I'm so sorry for your loss, this must be such a hard time for you both.",
      "created_utc": 1740708673.0,
      "score": 1
    },
    {
      "id": "mf6lqa8",
      "body": "Im so sorry for your loss, I can’t even imagine what you are both going through. \n\nAs a mom of two young children (2&4) , Ive been battling PPD for 4 years. I’ve been close to calling quits many a time . This story will be one I go back to and read. \n\nSending virtual hugs to you and your daughter. Maybe make a collage of her mom? Do you have any recordings of your wife? Maybe a build a bear with her voice as the recording? \n❤️",
      "created_utc": 1740709056.0,
      "score": 1
    },
    {
      "id": "mf6mb3h",
      "body": "OP have you both done counseling? If yes? I applaud you. If not? This sounds like a great time because counseling is a place you can ask this stuff if it's too much to share with the Internet. Please note the if. I sometimes do both. You are not alone and you are doing an admirable job based on this post. You also have my condolences.",
      "created_utc": 1740709259.0,
      "score": 1
    },
    {
      "id": "mf6picx",
      "body": "I’m so sorry. You are a good dad.",
      "created_utc": 1740710391.0,
      "score": 1
    },
    {
      "id": "mf6qc8e",
      "body": "Condolences to you and your daughter. 💐",
      "created_utc": 1740710684.0,
      "score": 1
    },
    {
      "id": "mf6yxyo",
      "body": "My heart goes out to you and your daughter. I can’t even begin to imagine how tough this must be for both of you. It’s clear that you’re doing an incredible job supporting her and being there for her, even when it’s so painful. For her birthday, maybe you could find a way to honor her mom’s memory together, like looking through photos, sharing stories, or creating a special memory book. It might not be the same as seeing her mom again, but it could bring some comfort and help her feel connected. You’re both incredibly strong, and it’s okay to lean on each other and those around you for support.",
      "created_utc": 1740713798.0,
      "score": 1
    },
    {
      "id": "mf71dz5",
      "body": "My hearts hurts for you OP, I am so sorry for your loss, Take your daughter to places you took her mom, your first date, where you got married, etc. Tell your daughter some funny stories about her mom, sharing memories with her is a wonderful gift, Evan visiting her at the cemetery may be a happy (but tearful) experience-",
      "created_utc": 1740714713.0,
      "score": 1
    },
    {
      "id": "mf73zih",
      "body": "Any birthday traditions that her mom always made sure happened? Make sure you do them. Look back at pics if you need a reminder. Did she always go to a special restaurant? I always get my girls the number of balloons they’re turning and put them in their room while they’re sleeping and they wake up with a room full of balloons. Dollar tree is good for this. Did she always have a homemade cake? Remember the traditions but start new ones too. And if she doesn’t want to go out and do what she would normally want to do. Skip it. Stay home. Get food delivered, get her new jammies and watch a new movie and veg. \nYou’re a great dad to be thinking of her day coming up and being open to suggestions.",
      "created_utc": 1740715719.0,
      "score": 1
    },
    {
      "id": "mf7hvq4",
      "body": "My dad died when I was 11, my parents divorced when I was 2, and I saw him maybe once a month, but I loved him more than anything in the world.  When he died I remember crying myself to sleep so many times I lost count.  It went like that for several years.  I was left with vague memories of spending time with him, like waking him up from a couch nap, going fishing on his boat, him introducing me as his son (I felt so proud to be his son), and a few other good memories, but not much else.  He wasn’t present in my life, and I resented him for a long time in my early 20’s, but as I’ve grown into my own and surpassed him in living years (I’m three years older than he was when he died), I forgave him and now I understand life from his perspective.  It doesn’t make it right, but I think understanding his life as he saw it makes it feel better in some ways.  He had successfully beaten cancer in his early 20’s, and was in remission for about a decade when it came back.  He lived for another 7 years after that, and was constantly in and out of the hospital, tired, on and off chemo and radiation, flying out to Washington DC to take part in some experimental treatments (targeted chemo and radiation treatment).  Ultimately it ended by taking his life, I saw him one last time at his home when he was in hospice, he held my hand, I hugged him and we cried.  About a week later he passed away.  I have a lot of pictures and some things he kept from his childhood as well as mine.  For a long time I put them all away and refused to look at them, it just hurt too much.\n\nAll that to say, I wish someone had done that for me, sat down with me and my sister to go through old memories, tell stories about his life, talk about the good memories.  I did eventually do those things, but I feel like it would have been better to do that much sooner than I did.  My family was absolutely devastated by his loss, he was the baby of the family of size kids, everyone loved him so much, and it hurt all of us dearly to remember his life.  So we just shut it off, and eventually I had to navigate my grief by myself an adult.\n\nOP, you need to do something with your daughter, don’t let her forget the person her mother was, dedicate a special day, like her moms birthday, to remember her specifically, until you both feel like you’re ready to move on.  Don’t ever let your daughter feel like she can’t remember who her mom was.",
      "created_utc": 1740721787.0,
      "score": 1
    },
    {
      "id": "mf7idpc",
      "body": "Please, whatever you end up doing, don’t ever let her mom’s memory be swept under the rug. So many people try to ignore loss. It’s there, and hiding it makes it shameful and painful. You are a champion dad. Take care of you and your little. As your lives move on, don’t ever let your wife/her mom be forgotten. She is forever a part of you. \n\nSending you hugs from an internet friend in CA. 💕",
      "created_utc": 1740722027.0,
      "score": 1
    },
    {
      "id": "mf7sikm",
      "body": "This is one of the most sad things I heard a child say this is heartbreaking",
      "created_utc": 1740727427.0,
      "score": 1
    },
    {
      "id": "mf7u10v",
      "body": "❤️🥲",
      "created_utc": 1740728307.0,
      "score": 1
    },
    {
      "id": "mf7v6jz",
      "body": "Could you get a cushion with her Mum’s picture on it so she can cuddle it??",
      "created_utc": 1740728996.0,
      "score": 1
    },
    {
      "id": "mf7w1uh",
      "body": "I am a new parent and man did this make me cry like a baby.",
      "created_utc": 1740729512.0,
      "score": 1
    },
    {
      "id": "mf83q0f",
      "body": "Sending you and your daughter all the love in the world. I hope your wife is now unburdened and able to be a guardian angel for you both. Look for the little signs that she’s with you. It helps. ❤️❤️❤️",
      "created_utc": 1740734311.0,
      "score": 1
    },
    {
      "id": "mf887ic",
      "body": "My heart is with you all truly with so so so so much love 🤍🧿",
      "created_utc": 1740737139.0,
      "score": 1
    },
    {
      "id": "mf88yls",
      "body": "She would benefit from a grief therapist. You probably would too. It helps so much.",
      "created_utc": 1740737599.0,
      "score": 1
    },
    {
      "id": "mf89eyv",
      "body": "Do what the first comment said but also weather or not if it's the weekend maybe then explore the places close to you and make it like a memorable day of when it was a day with your wife and her mum like the park with the duck pond and be like this was the first time trying to feed the ducks and stuff like that",
      "created_utc": 1740737872.0,
      "score": 1
    },
    {
      "id": "mf8dij8",
      "body": "Widow with a son here and yes it's heartbreaking but it is also what healing looks like. A good piece of advice I got in  surviving spouse grief counseling group is When any milestone is approaching, share a story about your wife a couple days before and see if that's starts a conversation. Those types of conversations have their sadness but also they can be uplifting as well. They are probably already thinking about them because they do before an important day, it puts them in a healthier mentality that allows them to enjoy their big day and helps navigates missing them while celebrating. Good luck and happy Birthday to your daughter.",
      "created_utc": 1740740323.0,
      "score": 1
    },
    {
      "id": "mf8fyqc",
      "body": "My sincerest condolences to you both. Sending virtual hugs",
      "created_utc": 1740741692.0,
      "score": 1
    },
    {
      "id": "mf9abjh",
      "body": "I have a friend whose husband died when her daughter was a baby. She made a memory box, with photos, the perfume he wore, CDs he liked to listen to and other little things to remember her father. I think this could be a beautiful gift.",
      "created_utc": 1740753719.0,
      "score": 1
    },
    {
      "id": "mf9b42c",
      "body": "Be there for her. If getting McDonald's is a bday present I feel like financial strain may be affecting your ability to do this. But be there as much as you can. I also suggest, I don't have kids so I have no idea, but I suggest if you have a female friend that you invite her to join on her birthday. I know noone can ever replace her mother and she doesn't want anyone to try but she may need someone to help her navigate through the most challenging years of a young girls life. Please remind her everyday when she wakes up, when she goes to school, when you return from work, and when she goes to bed that you love her. Miss her together.",
      "created_utc": 1740753974.0,
      "score": 1
    },
    {
      "id": "mf9ptln",
      "body": "Please tell her to write a letter to her as if she is talking to herand state everythingshe wants to pour out. Believe me, it will reach her mom.",
      "created_utc": 1740758410.0,
      "score": 1
    },
    {
      "id": "mf9t3sw",
      "body": "Seconding the scrapbooking and sharing happy memories ideas in the comments. If your wife was buried, you could also ask your daughter if she would like to visit her mom's grave. I also agree that it would be good to do these things on a day not her birthday so that she can have fun on her special day.\n\nSide note: It sounds like your daughter is talking to a school counselor which is fantastic, but if you are able I would look into a therapist who specializes in grief. This can be individual for you and your daughter or it can be a family therapist who can see you together. (Or both.) School counselors are phenomenal and a crucial resource for students, but especially in a case like this a specialist would really benefit you both.\n\nYour school counselor may be able to help connect you with a therapist. I don't know where you live but if you’re in the US and your daughter goes to a public school, I'm guessing she is on either an IEP or 504 plan to let her see the counselor this often. If that's the case, you as the parent should be able to invite the therapist or family therapist to meetings, which would allow that grief specialist to have more direct input on how the school accommodates your daughter. (And if she's in a public school and NOT on an IEP or 504, that's a conversation worth having with the counselor.)\n\nTo be clear, you're already doing an incredible job as a dad and husband. Please do not take this as a \"you’re doing something wrong.\" Rather as someone who has experience with both the mental health and education system, I just want to point you towards as many resources to support you and your daughter as possible.",
      "created_utc": 1740759361.0,
      "score": 1
    },
    {
      "id": "mf9trsl",
      "body": "Stay strong, brother. Life throws you curve balls when you least expect it. You'll both get through this.",
      "created_utc": 1740759552.0,
      "score": 1
    },
    {
      "id": "mf9yo8x",
      "body": "I’m sorry that you are having a hard time and missing someone so important that you love so dearly. You’re an amazing parent & you’re doing a great job. Your daughter being held in that moment to be supported in processing emotions is the best thing you could have done for her.\n\nIs there anything that your wife and daughter used to do together that you can go do in remembering & honoring Mommy and feeling close to her? What are your spiritual beliefs? That could change the way the experience goes a little bit. You guys will be ok. I know you will. Remind each other of how much you love each other & you will be ok. 🤍\n\nI’m praying for you and I pray that her birthday ends up being a sweet experience for her, for both of you. I’m sorry that it’s feeling so hard. \n\nMuch love for your family ❤️",
      "created_utc": 1740760963.0,
      "score": 1
    },
    {
      "id": "mfa509u",
      "body": "My mother used to pick me up from school, we would go out to lunch, sometimes a movie or shopping. At the time it was just a reason to ditch school early for me but as an adult I look back as quality time spent with her. Now in her memory I continue this tradition with my children and will continue to do so until they no longer wish too. \n\nI’m sorry for your loss, best advice is what you’re already doing, be there for her, time is the best gift a parent can give their children. It’s the only thing money can’t buy back.",
      "created_utc": 1740762760.0,
      "score": 1
    },
    {
      "id": "mfajjik",
      "body": "Sending the 2 of you Love!",
      "created_utc": 1740766916.0,
      "score": 1
    },
    {
      "id": "mfajz5l",
      "body": "Spend the day creating new memories. Take her to her favorite places. Go to a park or trail and take a walk. We recently lost someone important and had a getaway scheduled. I wanted to cancel it but we ended up going anyway. Having a change of venue really helped. It gave us something else to focus on just for a little while. Grief will never go away but it does get easier over time. ",
      "created_utc": 1740767039.0,
      "score": 1
    },
    {
      "id": "mfauyi5",
      "body": "Love never dies. Her mom’s caress is the wind upon her face, the stirring of leaves, the ebb and flow of the ocean, the song of a birds song and the quiet gaze of wildlife. \nHiking is such a good coping measure and the recovery of one’s soul. \nPerhaps a hike and sack lunch where you can talk about and experience these things. My heart is with you both as you traverse these difficult times.",
      "created_utc": 1740770105.0,
      "score": 1
    },
    {
      "id": "mfb2wb7",
      "body": "My heart is with you both. If someone hasn’t already suggested it, try getting her involved with Experience Camps. It’s a week long summer camp for children who have lost a parent, sibling, or caretaker. All completely free to the families. As a girl who lost her mother very young who now volunteers with ExCamps, I wish it was around when I needed it most. It’s by far the most liberating experience I’ve ever been part of & I feel lucky to help kids learn to grieve, find joy, & express themselves. \n\nA lot of folks may tell you or her to be strong. I’d like to say that the beginning of my healing has happened when I am anything but strong. Sending all my love & warmth.",
      "created_utc": 1740772305.0,
      "score": 1
    },
    {
      "id": "mfb4hl6",
      "body": "First of all, I’m so sorry. That sounds incredibly difficult and it sounds like you’re doing a great job supporting your daughter. I can’t imagine the emotions she’s feeling so young. A gift suggestion, maybe get her a special piece of memorial jewelry either one that holds ashes (if you have them), or both of their birth stones, i have one from Amazon that was very affordable (i want to say less than $20) and it’s lasted me for years. It’s stainless steel. It’s a great physical reminder that her mom is always with her. They also make keychains, if that is a better fit. Maybe you two can start a new special birthday tradition.",
      "created_utc": 1740772741.0,
      "score": 1
    },
    {
      "id": "mfbb9l2",
      "body": "Was there something special her and her mom shared?  An activity, a song, a food?  I’m so sorry for your loss.  Be the light for your daughter.",
      "created_utc": 1740774640.0,
      "score": 1
    },
    {
      "id": "mfbf9ay",
      "body": "I just wanted to say how sorry I am. I hope that it will get better for you. I would try looking at videos pictures and going over your memories with her.",
      "created_utc": 1740775769.0,
      "score": 1
    },
    {
      "id": "mfbwy06",
      "body": "My mom passed when I was 7. She had cancer and stopped treatment. It was so hard because I felt like I wasn't enough to keep her here. It took years, probably 4 years, for me to stop wishing to see her again when I blew out the birthday candles. \n\nThe best thing you can do is be present, give her as much love as you possibly can and talk about her mom a lot. Talking about her is painful now but it gets better. Make her mom's favorite meal occasionally and listen to her favorite music together. \n\nI'm so sorry you are both going through this. I wish I could say the pain goes away but it doesn't, we adapt to it and live with it. She will be happier again but it will take time.",
      "created_utc": 1740780774.0,
      "score": 1
    },
    {
      "id": "mfc5eaq",
      "body": "Oh, that poor baby. Sending so many hugs to that sweet girl.",
      "created_utc": 1740783319.0,
      "score": 1
    },
    {
      "id": "mfcn82n",
      "body": "I'm so sorry you have to endure this loss. Hug your daughter, she needs you, and you need her. I hope one day you both can heal enough to feel real happiness again. It is cliche, but the price of love is ricking the pain we feel at the loss of it. Love and pain are the most human qualities we have. Keep being there for her. If you haven't already please try to find some counseling for both of you. You need support from each other, but also from professionals.\n\nPeace to you.",
      "created_utc": 1740789164.0,
      "score": 1
    },
    {
      "id": "mfct73z",
      "body": "i'm so incredibly sorry for your loss. i hope your wife's at peace now. sending all the love🩶",
      "created_utc": 1740791167.0,
      "score": 1
    },
    {
      "id": "mfd47dy",
      "body": "Hey man, I just lost a friend on New Year’s morning. Same battle. I cannot imagine what losing a spouse feels like. Both of the suicides I have experienced left kids and a spouse behind. That part haunts me. It does get a bit easier over time, from what I have seen, but never really better. You just learn to walk and breathe again eventually. But day one will have you on your knees. I think the loss brought both spouses to their knees and it certainly did that to me. The recent one is still hurting and she will for a while. New years is ruined for a lot of us. The other is remarried and has another child. She still talks about him and her new partner is super respectful. He loves his kids like his own but has never once tried to replace the memory of their father.\n\nI hope you and your daughter are both attending grief counseling. This is too much to bear on your own. The pain and the ripple will be felt for a long time. I’m sorry you both went through this. I wouldn’t wish this on my worst enemy. It stays in your heart. You will get through this. Just be patient and don’t try to rush yourself through the painful part. Mourning takes time.",
      "created_utc": 1740794970.0,
      "score": 1
    },
    {
      "id": "mfdikhk",
      "body": "Please don't fight back your tears. Grieve is love with no place to go. Don't push that love away give it a place together. I experienced this too. We stopped talking about her because they thought it was better for me to not make me sad and cry. Don't do this. Keep talking about her. My condolences.",
      "created_utc": 1740800231.0,
      "score": 1
    },
    {
      "id": "mfdjwa5",
      "body": "My heart breaks for you both. Losing a loved one, especially a parent, leaves a void that words can’t fill. I lost my dad young, and birthdays were bittersweet—celebrating while wishing he was there. Your strength and love for your daughter shine through, and I hope you both find moments of peace and healing together.",
      "created_utc": 1740800737.0,
      "score": 1
    },
    {
      "id": "mfdz1cs",
      "body": "I’m so sorry, sending you love and strength",
      "created_utc": 1740807202.0,
      "score": 1
    },
    {
      "id": "mfeimbk",
      "body": "I am so terribly sorry. My heart is breaking for you two.",
      "created_utc": 1740818007.0,
      "score": 1
    },
    {
      "id": "mff0uma",
      "body": "Make her a scrap book or something with all the photos you might have of her mum",
      "created_utc": 1740829301.0,
      "score": 1
    },
    {
      "id": "mff5s20",
      "body": "Mom passed from cancer when I was 11. In the beginning dad tried to take me out weekly to go shoot pool, and a weekly group therapy. That lasted about 2 weeks because it was \"to hard\" for him. He turned to drinking and things drastically changed from there. Please learn from his mistakes. \nIt's OK to let her see you cry and be vulnerable. Keep the pictures up, take her on dad/ daughter dates. It'll take time, a lot of time, but things will ease up. Encourage therapy (for both of you) \nShe's going to pass milestones without mom, and that's hard. But every step of the way keep reminding her \"mom would be so so proud of you\"\nIf you can find something somewhere, like a little more that mom might have written her? Heck, even let her wear mom's clothes (if she wants to) just keep the spirit of mom alive. She's with you there at home, you can't see her, but you can talk to her. She's listening",
      "created_utc": 1740831882.0,
      "score": 1
    },
    {
      "id": "mfgvrow",
      "body": "my heart goes out to you and your family.   Please get yourself and your daughter into therapy.  children who have a parent who committed suicide often  do it themselves.   Sending hugs and love to you both.",
      "created_utc": 1740852720.0,
      "score": 1
    },
    {
      "id": "mfhj62u",
      "body": "I can understand how hard this is on her and you been there myself. Take her to lunch and then go places where your wife liked to go and just talk about her. Getting the family photos out would probably be a great way to talk about her life and remember her too. Don’t be afraid to cry too but it’s important to stress that her mother wants her to be happy and to live her life to the fullest. ",
      "created_utc": 1740859774.0,
      "score": 1
    },
    {
      "id": "mfhxfbt",
      "body": "I’m 34 and lost my dad three years ago and I can understand every part of what she says. My dad died very unexpectedly. I think that makes it so hard because I never saw it coming. I imagine for a little girl that is especially hard to process. My son was about her age when my dad died. They were best friends and we lived with him so it hit hard. I let my son lead in his grief, when he wants to talk about it and whatnot. It has gotten better though with time. It really helps to talk about them and share memories. I’m sorry for your loss and especially hers.",
      "created_utc": 1740864259.0,
      "score": 1
    },
    {
      "id": "mfleks6",
      "body": "I’m so sorry. 😞 You’re an amazing parent and I’m so sorry you both have to go through this pain. It doesn’t get easier. You just start learning to live with it. All you can do is support each other. ",
      "created_utc": 1740918182.0,
      "score": 1
    },
    {
      "id": "mfqy6cc",
      "body": "MY heart breaks for you and your sweet child.",
      "created_utc": 1740988008.0,
      "score": 1
    },
    {
      "id": "mg1mkqw",
      "body": "I lost my mom to natural causes when I was fifteen.  The loss of a parent at a young age is awful no matter how it happens.  Can I recommend that you pick up a copy of the book Motherless Daughters by Hope Edelman.  It may help you both understand the path and challenges that will arise on the path ahead of you all.",
      "created_utc": 1741127758.0,
      "score": 1
    },
    {
      "id": "mg1uriw",
      "body": "I'm 36 lost my Mom just over 9 years ago. The loss of a parent is tough at a young age. My Mom was an accidental death. I never got to say good bye or even \"happy birthday\" I'd usually ring 6pm as a safe bet coming off or getting up. As she was a nurse/midwife. Wouldn't have spoken everyday I still thought the world of her. \nHold your daughter, cry with her,share her android pain.\n\nMy wife's father passed, it's a few weeks shy of 3years ATM. I had to hold her hand through it, I gave her the advice and things that helped me at the time, I told her do things that I know helped me. My wife got to say goodbye to her Dad, however she was told he'd less than 24 hours. \n\nNow that you've context, share with her, be open to her. Show her its OK and there's no wrong way to grieve,",
      "created_utc": 1741130235.0,
      "score": 1
    },
    {
      "id": "mg26bra",
      "body": "And shit like this is why I keep taking my antidepressants and talk to people when I'm really down.\n\n\nEveryone... Please talk to someone if you feel that bad. \n\n\nI'm so sorry op.",
      "created_utc": 1741133973.0,
      "score": 1
    },
    {
      "id": "mg6wsd0",
      "body": "I am so, so sorry. Every year, my boys would fight over the wish bone. Last year, after losing several years in a row, my son lost it. Absolute melt down. He said \"Momma, if I don't ever get to wish, how will we get my sissy Bella back?\" \nOh, my heart. Sweet baby boy. Any wish in the world, and for years, all he wanted was his sister 💔\nI am so sorry for your loss. It doesn't get easier, but we get more used to it and get stronger. Do whatever you both need to heal, don't worry about anyone else's opinion. Sending love to you and your sweet little girl",
      "created_utc": 1741200162.0,
      "score": 1
    },
    {
      "id": "mjwhhq8",
      "body": "I hope y'all did something",
      "created_utc": 1743023125.0,
      "score": 1
    },
    {
      "id": "mf8wn68",
      "body": "Hire a medium and do a reading with your daughter. It will help both of you.",
      "created_utc": 1740749043.0,
      "score": 1
    },
    {
      "id": "mf77a3w",
      "body": "Idk if this is appropriate, but I’m seeing AI technology everywhere nowadays and I feel like it can be beneficial in some situations. Could it be useful into creating a video of her talking to her daughter giving her a heart warming message? Not something to repeat or become dependent of, but more like a last goodbye? Maybe it could give her more sense of closure, see her one last time, and you can set up what’s being said in a way that it fits your daughter’s need, and desire for answers. I’m thinking about something very delicate, with lots of love, that could actually be therapeutic as a first step into grieving. Again sorry if this is inappropriate, but I’m seeing so much AI bs everywhere that people actually believe it’s true, why not using it for the purpose of helping a little girl get a better hang of the situation and start a process with a “last” message from her mom, which I’m sure loved her very much.",
      "created_utc": 1740717040.0,
      "score": -1
    },
    {
      "id": "mfcmg1d",
      "body": "Lost my partner last year to cancer I have an 8 and 6 year old for Christmas I had the same request only want a hug from daddy \n\nI get them gifts from ‘daddy’ I told them he ordered them beforehand doesn’t need to be fancy or expensive they’re happy daddy got it for them",
      "created_utc": 1740788907.0,
      "score": 0
    },
    {
      "id": "mf640a7",
      "body": "I think those are very good ideas, going through the funny and happy memories. Thank you for the suggestion.",
      "created_utc": 1740702954.0,
      "score": 2483
    },
    {
      "id": "mf64tff",
      "body": "Excellent idea. I'd only add grab some favorite snacks.",
      "created_utc": 1740703223.0,
      "score": 42
    },
    {
      "id": "mf67bje",
      "body": "This ⬆️ is beautiful; that's exactly how I'd do it. Maybe get some McDonald's as well, some favorite snacks, put on a funny movie in the evening, wearing your pajamas, having a cozy night in.\n\nI'm so sorry for your loss. And, for the magnitude of your daughter's loss. It's also tragic that your wife's battle felt so hopeless that it overtook her love for her child. That sounds like a scary, awful, place to be, and my heart aches for all three of you.\n\nMay your wife's memory be as a blessing. ❤️🙏🏻🙏🏻\n\nAlso, in case you are feeling any kind of way about your changed up role, I want to tell you, you're a good dad. ❤️",
      "created_utc": 1740704055.0,
      "score": 56
    },
    {
      "id": "mf6fg0b",
      "body": "Or a scrapbook (i think thats the name)\n\nWell sorry i got more ideas i hope It can help \n\n1 Dinner and cake you 2 (Better if its cook or bake with her)\n\n2 Scrapbook, Like a book or in a board old photos (copys) if its a book its better bcuz then can be a new tradition, her birthday, mothers day, moms birthday, chrismas, a new page, with that date\n\n3 all of 2DragonTats say\n\n4 Buy flowers (2 bouquets) one for her as gitf and one for her mother but that she can give It to her \n\n5 write a letter or a note and burn It outside that way the wind can take the letters to her mom",
      "created_utc": 1740706856.0,
      "score": 15
    },
    {
      "id": "mf6edbu",
      "body": "This is a great idea\n\nMaybe take some of her favourites or ones that make her smile, get them duplicated, and make a book or a memory box or something \n\nMy heart breaks for you and you daughter \n\nLive each other every moment of every day",
      "created_utc": 1740706484.0,
      "score": 6
    },
    {
      "id": "mf8yuq8",
      "body": "Go to the grave and spend time maybe take a few pics..  \nI really think suggesting looking at old pics and videos can do more damage than good. Kids are more empathetic and it can play on her mind. Maybe do that when she's older. What you want to do is make her comfortable and have her talk what's worrying her  if she wants to look at pics let her suggest it. Don't make her even more sad",
      "created_utc": 1740749835.0,
      "score": 2
    },
    {
      "id": "mf9ju4j",
      "body": "It’s amazing the healing effect of an old photographed memory…",
      "created_utc": 1740756664.0,
      "score": 2
    },
    {
      "id": "mfbqg0p",
      "body": "This, also maybe you can get some scrap booking supplies and you guys can craft a memory book of her Mama in your spare time.",
      "created_utc": 1740778892.0,
      "score": 2
    },
    {
      "id": "mf87kwd",
      "body": "Best reply ever 🥰",
      "created_utc": 1740736751.0,
      "score": 1
    },
    {
      "id": "mf64lsg",
      "body": "This really sounds awesome, I will look into it. Thank you ",
      "created_utc": 1740703153.0,
      "score": 433
    },
    {
      "id": "mf64rgv",
      "body": "Yes! I have a little roll of \"wish paper\" and it's just tissue paper and can vouch that it does this and adds a sense of magic to the release of the feelings and message",
      "created_utc": 1740703204.0,
      "score": 90
    },
    {
      "id": "mf6to6y",
      "body": "Your daughter will likely remember this birthday forever. She is old enough and it will be the first without her mom. Tread lightly and follow her lead. My dad passed when I was 12, I am lucky to still remember him all these decades later. I have tied notes to balloon strings and sent messages to the heavens. There is something therapeutic about the release and watching the balloon drift until you can no longer follow it. I am so sorry for your loss.",
      "created_utc": 1740711871.0,
      "score": 44
    },
    {
      "id": "mf8a37h",
      "body": "You can get this is magic stores—it’s called flash paper. And I love the idea!",
      "created_utc": 1740738276.0,
      "score": 7
    },
    {
      "id": "mf65dur",
      "body": "I'm really sorry for your losses, I can't imagine what it's like to lose two loved ones in such a short space of time. That sounds like a good idea and I will definitely look into doing that once things get a bit better and I am able able to.",
      "created_utc": 1740703409.0,
      "score": 291
    },
    {
      "id": "mf6onnn",
      "body": "I’m so sorry for all your losses. I love the tree. Magnolia trees are beautiful, fragrant, and strong. Just like love. And donating to a no kill shelter to help animals who seem to understand love better than most humans is awesome. I really wish I could give pieces of me to help others, or something that would make even a little bit of difference.\n\nI deal with depression since I was a child and if you don’t have it, it seems it’s almost incomprehensible to imagine that things would be better without you. But I’ve been there. Not that this is right, but it is a strong and vicious cycle in a sometimes and oftentimes extremely sad and cruel world.\n\nI hope your daughter knows that her mother loved her. That you love her. The people who don’t even know you guys, would do anything to make her feel better. If only we could. The world needs more love, kindness, and importance on those things rather than objects/possessions, SM, and things that don’t really mean anything in the grand scheme of things. \n\nI’ll be keeping you, OP’s daughter, OP, and everyone I read about here in my thoughts and prayers. If I can do more, please let me know. We may be Internet strangers, but love is love is love. And I hate seeing anyone hurting, sad, heartbroken, and grieving.",
      "created_utc": 1740710088.0,
      "score": 10
    },
    {
      "id": "mf66vkl",
      "body": "Thank you for this perspective. Her birthday will definitely be about what she wants to do and all about celebrating her. I wouldn't want her to feel like she can't celebrate, I just want her to have fun and enjoy herself. She deserves it after everything she went through.",
      "created_utc": 1740703906.0,
      "score": 98
    },
    {
      "id": "mf6ns4q",
      "body": "I’m so sorry. My condolences",
      "created_utc": 1740709779.0,
      "score": 14
    },
    {
      "id": "mf64hd7",
      "body": "Thank you. It wasn't easy but I just needed to tell someone and I'm glad it's helpful and I hope it gets better for you.",
      "created_utc": 1740703112.0,
      "score": 59
    },
    {
      "id": "mf681yl",
      "body": "What a lovely activity idea!  I'm going to suggest to my mom we do that for my late father's birthday that is coming up in March.  Thanks!",
      "created_utc": 1740704299.0,
      "score": 8
    },
    {
      "id": "mf6e36f",
      "body": "I would suggest getting a bunch of scrapbooking supplies, then setting aside some time each week to work on it together. Talk about all the memories you are adding to the scrapbook. Put those thoughts and feelings into the scrapbook. I think it will be good for both of you to go through your memories together.",
      "created_utc": 1740706386.0,
      "score": 7
    },
    {
      "id": "mf6tfcy",
      "body": "also, cry with her. be sad with her. eat ice cream for dinner with her when it’s a hard day. and get her (and yourself, if you’re willing) into therapy asap. i wish my mother had that for me - it would have saved me from a LOT of emotional pain. i don’t want that for her or for you. much love 🤍",
      "created_utc": 1740711783.0,
      "score": 6
    },
    {
      "id": "mf9php4",
      "body": "This is a very wholesome thing to do, along with a memory stick with any videos of him, especially with the daughter, would add to that special box",
      "created_utc": 1740758315.0,
      "score": 1
    },
    {
      "id": "mf66mfy",
      "body": "My son’s father passed away when he was nine. I made him a photo book of photos and 14 years later that’s still one of his more important belongings.",
      "created_utc": 1740703820.0,
      "score": 907
    },
    {
      "id": "mf6ak2f",
      "body": "My mom died, same way, same reason, when I was 9. The worst thing was nobody talking about her, my dad getting rid of all of her stuff, and acting like she'd never been there. \n\nTalk with your daughter about her mom. You both need it. Talk about stages of grieving. It took me 15 years before I got to the anger part, but it was necessary. Every part of it is. I'm so sorry she left you both in such a painful way. I'm glad you have each other to keep the memories alive. It will help you both heal so much.",
      "created_utc": 1740705160.0,
      "score": 460
    },
    {
      "id": "mf6nea1",
      "body": "Yes, this idea is great, if I may add one caveat? Have all the memories, pics etc be focused on your daughter. It IS her bday and it could be pics of her and mom. Memories of her and mom, things like that. This way, she is reminded on her special day how much she was loved and gets to see her mom too.",
      "created_utc": 1740709644.0,
      "score": 83
    },
    {
      "id": "mf6etty",
      "body": "Go visit fun places y’all visted together that have beautiful memories.",
      "created_utc": 1740706644.0,
      "score": 43
    },
    {
      "id": "mf6y80z",
      "body": "My dad recently passed away and his birthday was Valentine’s Day. We made his favorite weeknight dinner and told stories and watched Fellowship of the Ring which is a family favorite.  You’re doing a phenomenal job, OP.  Your daughter will remember these moments of bonding with you.  It will get better ❤️‍🩹",
      "created_utc": 1740713526.0,
      "score": 39
    },
    {
      "id": "mf772tx",
      "body": "Make a scrapbook with photos of her mom, her, and of you 3. But do it with her, and talk about the memories and the love. \n\n\nI lost my dad to cancer at the age of 9. I remember looking for hours at the albums, and trying not to forget him or his face, his smell. I still have pictures of him hanging on my wall, it has been 20 years, but I still miss him and comforts me seeing him.",
      "created_utc": 1740716955.0,
      "score": 38
    },
    {
      "id": "mf7c635",
      "body": "This might not make sense right away, but if you have a personal item (think item of clothing, piece of jewelry.  Not something very valuable at this age.) of your wife's bring it out to your daughter and let her wear it. And if you feel like it, give it to her.\n\nMy husband passed 2 months ago. A couple of weeks afterward, I was doing some laundry, and our 6 years old granddaughter was helping me. She saw some of his T-shirts. She asked if she could have a T-shirt that she could wear to sleep in. \n\nShe chose 3 and she loves wearing them. \nI think it helps her feel close to him.",
      "created_utc": 1740719150.0,
      "score": 24
    },
    {
      "id": "mf6v7mo",
      "body": "Could also ask her questions like “what were your favorite qualities about mom that you want to carry through life? What are some of your favorite memories … a silly time? A heartfelt moment? What’s a favorite picture of her or you three?”",
      "created_utc": 1740712423.0,
      "score": 22
    },
    {
      "id": "mf6wbv7",
      "body": "All I can say is you are doing great at navigating an impossible situation. Grief is a funny thing, and an extremely personal one at that. Healing isn't linear, and neither is Grief. Holding room for those feelings is important, and over time it slowly changes from \"she should be here for this\" to \"she would be so damn proud of me\" (at least, in my experience it did ❤️)",
      "created_utc": 1740712829.0,
      "score": 12
    },
    {
      "id": "mf8eff3",
      "body": "And ask friends and family and former coworkers to write or record stories about your wife at different times of her life. And you do this too.\nShe will never know her mom as an adult, but having a fuller idea of who her mom was can be so helpful.\nYou can also write things down too, while the memories are fresher. \nYou can save the harder stories for when she is older.\nBut having stories showing her as whole person, not a sugar-coated angel, is helpful later.  What quirks or habits did she have, but you still loved her, despite or because of them.",
      "created_utc": 1740740845.0,
      "score": 6
    },
    {
      "id": "mf9g438",
      "body": "Is she crafty or artsy? You could go to second hand stores in your area? Make a day of it, check them out. Buy rolls of ribbon, lace, clothing that you both like the pattern of. Go home, cut them up, decorate a scrapbook and add pictures of yourselves, pictures of her, drawing your daughter made when she was younger, new ones you make together. You can buy a dedicated hardback notebook, or just a binder that you can add regular three-hole punch paper to.",
      "created_utc": 1740755556.0,
      "score": 4
    },
    {
      "id": "mf6yrcn",
      "body": "It’s also a really good idea to digitise all the physical photos you can, so they’re safe in case of any physical damage to the printed ones.",
      "created_utc": 1740713730.0,
      "score": 6
    },
    {
      "id": "mf6qa89",
      "body": "  Yeah that’s a good idea. Have her remember the good times you guys had and the funny things. I’m so sorry for your loss.",
      "created_utc": 1740710665.0,
      "score": 3
    },
    {
      "id": "mf6zknh",
      "body": "Maybe order from a restaurant your wife really liked or do something that she enjoyed on or near her birthday, to feel closer to her mom",
      "created_utc": 1740714035.0,
      "score": 2
    },
    {
      "id": "mf9tkgv",
      "body": "Go to her grave if she’s buried and sit with your daughter and your wife, have a picnic maybe, bring cake and flowers. You could also do an offrenda around Halloween to continue to honor your wife and your daughter missing her. Just some thoughts. I’m so very sorry for your loss :(",
      "created_utc": 1740759493.0,
      "score": 2
    },
    {
      "id": "mf81xmo",
      "body": "also do stuff like \"remember when [insert funny/happy memory]?\" and talk abt stuff like that",
      "created_utc": 1740733172.0,
      "score": 1
    },
    {
      "id": "mf8f3e0",
      "body": "It also keeps her memories alive with you now.  Good plan. Bless you both. Sending love ❤️",
      "created_utc": 1740741218.0,
      "score": 1
    },
    {
      "id": "mfcfbve",
      "body": "You could even make a scrapbook with her of both your favorite memories, photos, things around the house etc. for her to look through when she misses her extra. I’m sorry for both of your loss. ❤️",
      "created_utc": 1740786524.0,
      "score": 1
    },
    {
      "id": "mgl0je4",
      "body": "fix or have a meal that your wife would have loved as well?",
      "created_utc": 1741384436.0,
      "score": 1
    },
    {
      "id": "mf6nnfn",
      "body": "Dollar (.25) tree has great candy options!",
      "created_utc": 1740709733.0,
      "score": 6
    },
    {
      "id": "mf7n0yg",
      "body": "This is traditional in Chinese Buddhism. You'll want to look up joss paper.",
      "created_utc": 1740724398.0,
      "score": 85
    },
    {
      "id": "mf8ansm",
      "body": "Can vouch for that. I can remember my 9th birthday so well. First one after my mother’s death.",
      "created_utc": 1740738625.0,
      "score": 9
    },
    {
      "id": "mf6noei",
      "body": "A lower cost option right now could be a garden or some houseplants. Anything in particular your wife may have liked? You and daughter could go get some plants or plant a garden. \n\nWhen my best friend died, I got a little baby tree from Home Depot. It’s still small and lives indoors. I write notes to her and print photos of us and tie them to the tree, and hung some of her jewelry from it. Watching it grow has been very healing.",
      "created_utc": 1740709742.0,
      "score": 64
    },
    {
      "id": "mf6q860",
      "body": "Things like that can be a great birthday gift - plant a tree together in her mom’s memory, create a photo book together, make her favorite foods together.  A friend had some of his wife’s clothes turned into a quilt for his daughter (the mom had a tshirt collection that he had turned Into a quilt.  The daughter took it to college with her and still says it feels like a hug from her mom).    \nshe can’t see her mom for her birthday can certainly feel her presence.",
      "created_utc": 1740710644.0,
      "score": 16
    },
    {
      "id": "mf67wa6",
      "body": "You’re very welcome. You’re doing the best you can while also grieving. It’s insanely difficult for a parent to go through with their child. There isn’t a right way through this except to do it together with as much grace and love as you can both give. \n\nHaving a happy day to celebrate the good memories and maybe do something mom loved to do could be a day to plan with her while also asking her what she wants to do on her happy day (her birthday). Maybe frame a photo of the two of them as one of her gifts. I have one of my mom at my last birthday that my aunt gave me and decades later I still have it. \n\nI know the pain is still so raw and the grief is so new so happy days will be a miraculous feat but try to plan them and they’ll get easier to enjoy as time passes.\n\nEdit: maybe a collage of photos of mom celebrating daughter’s previous birthdays if you have some.",
      "created_utc": 1740704246.0,
      "score": 16
    },
    {
      "id": "mf6vgws",
      "body": "Make sure there are duplicates of those photos, even if just in a cloud service should something happen to the album",
      "created_utc": 1740712516.0,
      "score": 321
    },
    {
      "id": "mf6ei8z",
      "body": "I'm so sorry you lost your mom that way. \n\nYour advice is so very good.\n\nMy mom shot herself in the head when I was 2 months shy of 10 years old. No one talked about it. It was really hard.\n\nIt would really help to someone would have done what you described.",
      "created_utc": 1740706532.0,
      "score": 189
    },
    {
      "id": "mf6bw4r",
      "body": "I'm sorry for your loss.",
      "created_utc": 1740705624.0,
      "score": 43
    },
    {
      "id": "mf6txtu",
      "body": "Wonder if OP would let us send birthday cards to a PO box or something? This broke me. My youngest girl is 11, and I just can't imagine how lost your little girl must feel. Maybe an outpouring of love, advice from girls, and a reminder of the light in the world would help in some way .",
      "created_utc": 1740711968.0,
      "score": 76
    },
    {
      "id": "mf8afex",
      "body": "I did that with my home movies. I would watch them forever. It was 27 years for me this last Saturday losing my mom. Not to cancer, but an equally fucked up disease that’s just a lot rarer. Hemachromatosis. I was 8. Two months shy of my ninth birthday. I can see her pictures right now. I miss my mom too.",
      "created_utc": 1740738482.0,
      "score": 12
    },
    {
      "id": "mfeou4q",
      "body": "And write all of that down together so she won't forget",
      "created_utc": 1740821825.0,
      "score": 2
    },
    {
      "id": "mf8co3x",
      "body": "You can have the photos printed on pages. I made one of my wedding photos at Walgreens but plenty of sites do them. You can customize the pages, layout of photos, color of the cover and all kinds of things. We did this with my kids senior pictures too.",
      "created_utc": 1740739830.0,
      "score": 61
    },
    {
      "id": "mf7os8d",
      "body": "Oof. That is such a rough age. I can sort of understand adults not wanting to get into some of it, but never talking about your mom at all does your head in. It's so hard to get support because **nobody** knows what to say. Nobody. Ever. How can you grieve or process or ever feel like the ground probably won't crumble under your feet without warning?\n\nPeople still don't know how to talk about parental suicide. I'd like to think that there could be a way for kids who've survived that to get help so they aren't scarred quite so badly.",
      "created_utc": 1740725346.0,
      "score": 46
    },
    {
      "id": "mfezcbr",
      "body": "My heart breaks for you and SaskiaDavies and any other child who experiences losing a parent in this way. It must have been so devastating not having anyone to talk to about it.\n\nTalking about a close family member or even a friend's death is hard, even more so under these circumstances. But no matter how hard it is, people need to find it in their hearts to talk about the parent, acknowledge the parent and find something positive to say. They don't need to focus on how it happened or why. The child/children need to know this wasn't their fault. They don't need to feel guilty or ashamed, they need to know they did not cause this to happen. \n\nMy friend hung himself in the family living room while the kids were at school and his wife was at work. Unfortunately his son was the one who discovered him. I can't even begin to imagine the trauma that young man felt.\n\nI hope you were or are currently able to talk to someone about your mom's death and are doing better now. Sending you warm thoughts and cyber hugs. Take care.\n\nEdited to correct spelling error.",
      "created_utc": 1740828412.0,
      "score": 1
    },
    {
      "id": "mfgwm6i",
      "body": "my dad died when i was 10 also.  an accident.  my parents were already divorced and my mom was remarried and they kind of just brushed it under the rug.  I didnt even believe it was really true until i was about 16.  I had a fantasy that he had picked up a hitchhiker and when the truck turned over he jumped out so the burnt body they found was the hitchhikers.  I was sure he ran away and found another family.  That was 55 years ago and I think it has affected my life ever since.  My stepmom was pregnant so i have a brother who was born 7 months after my dad died.",
      "created_utc": 1740852971.0,
      "score": 1
    },
    {
      "id": "mf7yz46",
      "body": "Yea I would love to do that too. Maybe some stickers or glitter or *something* she likes. \n\nI think you can set up wishlists on amazon too but I'm not sure how you hide your address on it.",
      "created_utc": 1740731290.0,
      "score": 20
    },
    {
      "id": "mfas1bc",
      "body": "I am so sorry. It is very hard to see them fade away from an illness, I cannot begin to fanthom a rare disease. I send you a very big hug, I am here if you ever need to talk. I bet she loved you a lot, and I am glad we are able to remenber them and have pictures of them. 💜",
      "created_utc": 1740769289.0,
      "score": 4
    },
    {
      "id": "mf9ggsm",
      "body": "A copy in a cloud service will be safe from any natural disasters or malicious acts as long as the hosting servers are intact.",
      "created_utc": 1740755663.0,
      "score": 25
    },
    {
      "id": "mfavpv0",
      "body": "Thank you. The worst thing is we didn’t even know until the last two months of her life. It’s so rare it’s not something that’s commonly discussed. It’s common enough to appear in an episode of Greys, but it’s not one of those diseases people know about commonly. She did love me a lot. My sister was younger and she has less memories than me, and it breaks my heart. I’m so sorry you’re in the dead parent club. It’s nothing I’d wish on my worst enemy. I send you a big hug, too. If you ever need to talk you can, or even just to have a friend who understands what it’s like to lose a parent.",
      "created_utc": 1740770318.0,
      "score": 3
    }
  ]
}