{
  "id": "1h0elzm",
  "title": "what the actual f*ck",
  "selftext": "i (18m) was in my sisters (8f) room at about 2 in the morning, petting my cat who was sleeping next to her and my dad walked in fully naked, closing the door before seeing me and then just leaving without saying a word. I’m freaked out and scared asf right now and don’t know wtf just happened ",
  "created_utc": 1732635231.0,
  "score": 7774,
  "num_comments": 1187,
  "url": "https://www.reddit.com/r/offmychest/comments/1h0elzm/what_the_actual_fck/",
  "comments": [
    {
      "id": "lz3728y",
      "body": "Do not ignore this. Be sure to call him out on it with witnesses",
      "created_utc": 1732635600.0,
      "score": 10311
    },
    {
      "id": "lz36ymv",
      "body": "Please contact a family member",
      "created_utc": 1732635569.0,
      "score": 3469
    },
    {
      "id": "lz3h2cj",
      "body": "i’ve posted a million comments on here by now sorry bud- but i also wanted to say that if she does come to you and tell you what’s going on your reaction is important and she will always remember it. be prepared to be VERY in control when she tells you. stay calm. if you react negatively she will automatically think SHE did something wrong. come up with a plan and do a google search into how to react when a kid tells you their being abused- and remember she won’t know it’s abuse. \n\nsorry for blowing up this thread but i know many people who would have wanted a big brother like you. stay strong. maybe sleep on her floor tonight.",
      "created_utc": 1732638713.0,
      "score": 1768
    },
    {
      "id": "lz3c2he",
      "body": "Was your sister awake? Now I’m wondering how “alert” the younger sister was. I was drugged and raped at this age  by my parents and now I can’t stop worrying about you and your sister.",
      "created_utc": 1732637177.0,
      "score": 856
    },
    {
      "id": "lz3h2ya",
      "body": "As someone who was raped by my step dad at this age, he would often walk in naked. Please, PLEASE, look after her and DO NOT just take him for his word. As a mother as well, this is absolutely not normal behaviour. I literally am begging you to stand up for your sister and protect her. If the worst is happening, she needs you now more than ever",
      "created_utc": 1732638718.0,
      "score": 774
    },
    {
      "id": "lz3k22t",
      "body": "I'm so glad she has 3 loving, protective brothers. Take care of the little one.",
      "created_utc": 1732639625.0,
      "score": 226
    },
    {
      "id": "lz556tq",
      "body": "Hey OP, you’re getting a lot of advice about how to investigate this or ‘prove’ things yourself. \n\nStop. Do not record them or try to engage them in discussion. You could completely impair the ability of the necessary professionals to do their job. \n\nDO NOT ask your sister if she’s been touched or if dad has done this before. You ABSOLUTELY SHOULD NOT attempt to discuss this with her. \n\nIf the worst is happening, you could get in the way of of police or child protection taking the necessary steps to protect your sister. Putting up cameras inside a bedroom is likely a crime, so please do not do this. \n\nI am an emergency doctor and part of my training was in responding to suspected child abuse. Here is what we are taught:\n\n**It is not your job to prove it. It is not your job to gather evidence. If you suspect child abuse may be occurring, your job is to report it to child protection and let them investigate.**\n\nYou are not a professional with the right kind of training to do any of this. Get the professionals involved to assess the situation. This is absolutely an appropriate reason to call child protection.",
      "created_utc": 1732657088.0,
      "score": 783
    },
    {
      "id": "lz3x58b",
      "body": "**OP, don’t investigate this yourself in any way.** Don’t confront your parents. Just go directly to CPS (or whatever the child protection agency is called in your area). They have experts there who are trained to investigate possible child sexual abuse and get to the bottom of what really happened as carefully as possible.\n\nIf you try to investigate it, you can mess everything up, making it much, much harder for CPS to protect your sister. You aren’t a trained professional, and you aren’t an objective outsider. By asking questions, you can influence what your parents and sister say — or you can create the appearance of influencing what your sister says. It’s incredibly important that CPS takes over (or the police, depending on what the procedure is in your area, but one way or the other you need a trained professional who knows how to investigate potential child abuse).\n\nIf your parents have done nothing wrong and are genuinely good parents, they’ll understand that you’re doing the right thing by protecting your sister. They might be embarrassed, but they’ll respect you for reporting it. I hope that’s the case. I hope it’s all got an innocent explanation.",
      "created_utc": 1732643605.0,
      "score": 500
    },
    {
      "id": "lz5ai1g",
      "body": "For the love of god do NOT put a camera in your sisters room. I can't believe people are being this dense. \n\nLet's say you set up a camera and the next day your parents find it and take it to the cops before they've done anything to her. Suddenly you have no evidence of them doing anything wrong but instead you have filmed your 8 year old sister undressing. Nobody is going to buy your story that you were trying to protect her. You spend the rest of your life on a list and have to tell all your neighbors that you are officially a pedo pervert. You can no longer testify for what you saw your dad do because you're not a credible witness so he doesn't go to jail, and finally your sister thinks that not even you are there to protect her but instead she's surrounded by harmful men. \n\nThis is a huge scenario you're dealing with, and you can't do it alone. Get others involved, especially CPS and law enforcement. They're the professionals who know how to legally collect evidence, you're not a cop. The only evidence you need to get things moving is your testimony for what you saw. Trying to get more proof risks ruining the case, not to mention the rest of your life.",
      "created_utc": 1732658744.0,
      "score": 110
    },
    {
      "id": "lz37sa3",
      "body": "He's up to no good please protect your sister",
      "created_utc": 1732635830.0,
      "score": 279
    },
    {
      "id": "lz3a2h2",
      "body": "Yeah no this is weird. I have two young daughters and I’m ocd as all get out to make sure I put on athletic shorts before I leave our bedroom for their sake. Definitely talk to somebody.",
      "created_utc": 1732636550.0,
      "score": 218
    },
    {
      "id": "lz3a74g",
      "body": "The way he came in sounds like this isn’t the first time either I’m sorry to say. This needs to be reported to the police. This isn’t normal in any way.",
      "created_utc": 1732636590.0,
      "score": 162
    },
    {
      "id": "m03u9uh",
      "body": "I've never checked in this much on a Reddit post in my life... I'm so worried ☹️",
      "created_utc": 1733177718.0,
      "score": 53
    },
    {
      "id": "lz3adn4",
      "body": "Jesus I hope it’s not what anyone is thinking please stay with your sister and I hope your parents have a really good explanation",
      "created_utc": 1732636646.0,
      "score": 93
    },
    {
      "id": "lz3c3mp",
      "body": "If this isn't some kind of a joke, involve police. There's no practical explanation. Don't ask around with your family, get the cops. Anything less and you're enabling a child predator.",
      "created_utc": 1732637187.0,
      "score": 50
    },
    {
      "id": "lzkmd0e",
      "body": "I keep coming back to this after every couple of hours for an update. OP please please update us. I hope to god you and your siblings are safe and doing okay.",
      "created_utc": 1732895274.0,
      "score": 41
    },
    {
      "id": "lz3dxz1",
      "body": "If you’re in the US tell a teacher or call cps directly. There’s absolutely no reason he should be going into your sister’s room naked. \n\nEdit: and if it really was innocent then they’ll close the case pretty quickly. They see things. ",
      "created_utc": 1732637760.0,
      "score": 37
    },
    {
      "id": "lz38t0g",
      "body": "This needs to be reported",
      "created_utc": 1732636151.0,
      "score": 70
    },
    {
      "id": "lz3fphe",
      "body": "You are now your sister’s advocate. Talk to a counselor about how to approach the conversation with her. Maybe the counselor can talk to her too. \n\nI hope you are now sleeping in her room every night. Seems like a normal thing already. It’s more important to prevent any further assaults than to catch him in the act. Your sister may pick up on the fact that you’re protecting her which could help her to talk with you about it. \n\nThis is very disturbing and needs to be dealt with immediately. I’m sorry that it’s fallen on your shoulders. Thank you for being such a great brother!\n\nPlease update.",
      "created_utc": 1732638299.0,
      "score": 94
    },
    {
      "id": "lz4efrt",
      "body": "A grown adult man has zero business walking into a child room’s (his child or otherwise) with no clothes on at 2am. Full stop. \n\nPlease keep your baby sister safe :(",
      "created_utc": 1732648841.0,
      "score": 36
    },
    {
      "id": "lz3lzjs",
      "body": "Your father’s actions are hard to explain without going straight to the devastating. \n\nIs there somewhere else you can take your sister to stay?\n\nI’d also be calling my brothers in the middle of the night (or the moment it hits 5am) to discuss and would talk calmly to your sister before confronting your dad. See if you can gather info on whether something has happened. Maybe even google the right way to ask these questions. \n\nWhen you speak with your father, do not back down on this. If he is doing this, he is likely very good at manipulating the conversation and gaslighting. There is NO plausible responses to entering a child’s room naked and closing the door. \n\nI am a parent and I have never walked naked around my kids out of the context of being in my room preparing for a shower. Checking on them naked (without some kind of a robe) is weird and inappropriate. \n\nPlease stay safe OP. You may need to prepare to take your sister and stay somewhere else. If your parents call the cops for “kidnapping” you’ll gladly explain why you removed her from their house. \n\nPlease keep us posted.",
      "created_utc": 1732640209.0,
      "score": 62
    },
    {
      "id": "lz3hsyi",
      "body": "I would talk to your sister before talking to dad/parents. Tell her what happened and ask her if it's ever happened before.\n\nThen, ask your dad what was going on.\n\nThe camera is tough, because you want your sister to have privacy when she's undressing and such, but also want to protect her from your dad.",
      "created_utc": 1732638940.0,
      "score": 191
    },
    {
      "id": "lz3728s",
      "body": "Put a camera in that room",
      "created_utc": 1732635600.0,
      "score": 624
    },
    {
      "id": "lz3hm93",
      "body": "Jesus Christ man. Every day there’s some disgusting shit like this. Fuck this world",
      "created_utc": 1732638883.0,
      "score": 29
    },
    {
      "id": "lz3k0ik",
      "body": "Keep us updated \nAnd protect your sister",
      "created_utc": 1732639612.0,
      "score": 26
    },
    {
      "id": "lzbwbjh",
      "body": "It’s been a day. Are you okay??",
      "created_utc": 1732753172.0,
      "score": 28
    },
    {
      "id": "m1eiwuq",
      "body": "2 weeks.. any update?",
      "created_utc": 1733857920.0,
      "score": 26
    },
    {
      "id": "lz3844c",
      "body": "This is horrible..  This is literally a life and death situation. People kill themselves from childhood abuse. Since it's a possible explanation, you need to rule it out, or your sister might pay the ultimate price for it later in life. Even people who don't kill themselves end up screwed up for life and their entire life in shambles.. I don't know how you can address this without a camera, but the camera might get YOU in trouble. This is a very difficult and fucked up situation. Unfortunately you can't believe anything your parents say since your evidence is very damning.",
      "created_utc": 1732635934.0,
      "score": 113
    },
    {
      "id": "lz3m4sx",
      "body": "This is absolutely not normal. Please keep her safe!\n\nEven if that means staying in her room with her or both of you having sleepovers in your room. Do not let either of your parents be alone with her at night if you can help it!",
      "created_utc": 1732640253.0,
      "score": 25
    },
    {
      "id": "lz7owhb",
      "body": "Hi OP. Any update for us? We’re all hoping for the best <3",
      "created_utc": 1732695254.0,
      "score": 21
    },
    {
      "id": "lzc7bd9",
      "body": "OP, is everything all right? 1 day has already passed and You havent updated.\n\nHave You talked with ur brother or other adults?",
      "created_utc": 1732757387.0,
      "score": 23
    },
    {
      "id": "m028zx6",
      "body": "Hey OP, we're worried for you. Please update us? It's been 6 days :/",
      "created_utc": 1733159773.0,
      "score": 21
    },
    {
      "id": "m22z9l3",
      "body": "I never checked a post as much as this one. \n\nI'm on the other side of the world and I'm still worried, hope all is well.",
      "created_utc": 1734215542.0,
      "score": 23
    },
    {
      "id": "m3hco9f",
      "body": "Checking back 27 days later, OP dropped off the face of the earth.",
      "created_utc": 1734982224.0,
      "score": 22
    },
    {
      "id": "lz3lg98",
      "body": "Don’t ignore this. This is not normal. \n\nMy sister was around that age when she started getting abused by my dad.",
      "created_utc": 1732640047.0,
      "score": 18
    },
    {
      "id": "lz3prkj",
      "body": "How is your sister? Did you ask her if she's OK?\n\nThe fact he walked in: NAKED. AT 2 AM. This shit is scary.",
      "created_utc": 1732641371.0,
      "score": 20
    },
    {
      "id": "lz4yhzk",
      "body": "Your best course of action is to take her to the hospital and have her checked out. CPS will be called \n\nYoure 18. You shouldn’t not be handling this alone. You need professionals. You can ask a nurse that you need a child advocate present and that you need help with the next steps. \n\nShit is gonna hit the fan regardless. To protect yourself - remove your important docs from the home. If your parents have access to a bank account. Remove them or remove the money. You are about to become public enemy #1. Be prepared for your phone to be cut off too if they foot the bill. DO NOT let anyone (no family) around your sister alone. You need to be present. If it’s not a cop or nurse or dr you need to be in the room. \n\nYou need family who is gonna support you and your sister. Not justify this disgusting behavior. From What you said - your mom knows and either doesn’t care or is encouraging it.",
      "created_utc": 1732655015.0,
      "score": 17
    },
    {
      "id": "lz5dt5b",
      "body": "Are YOU safe?",
      "created_utc": 1732659816.0,
      "score": 21
    },
    {
      "id": "lz7ayhv",
      "body": "**DO NOT put a camera in your sister's room.**\n\nBest case scenario, you record her undressing, someone finds the camera, nobody believes your story about wanting to protect her, YOU go to jail and ruin all chances of future employment and your dad is free to do all the disgusting shit he wants.\n\nWorst case scenario, you record and view something that will be truly traumatising. And because you're not a crime scene investigator, the whole thing could end up being inadmissible in court anyway. And then you'd still be the one who's prosecuted and whose life is ruined for filming it.\n\nYou're right to be concerned, but you're not the one who should be handling this, and neither is your brother. Go to the police.",
      "created_utc": 1732687039.0,
      "score": 19
    },
    {
      "id": "lz7gtla",
      "body": "Reported to Crime Stoppers South Australia because it's been 12 hours since OP has interacted and it was 4am his time when this was all happening.\n\nHope you and your sister are safe, OP.",
      "created_utc": 1732690291.0,
      "score": 21
    },
    {
      "id": "lzirxnl",
      "body": "Hey op, how’s it going? ♥️",
      "created_utc": 1732859247.0,
      "score": 17
    },
    {
      "id": "lznlkke",
      "body": "OP, do you have any update? I hope nothing bad and all is good. Hope your sister is ok, and was never harmed by her parents.",
      "created_utc": 1732934170.0,
      "score": 18
    },
    {
      "id": "m1nld4f",
      "body": "Mate? Any update?  Really hope you and your sister are OK!",
      "created_utc": 1733984158.0,
      "score": 17
    },
    {
      "id": "lz39l0g",
      "body": "Jesus christ, is there someone you can call or maybe stay with, cause your sister doesnt seem safe there",
      "created_utc": 1732636396.0,
      "score": 49
    },
    {
      "id": "m04oufv",
      "body": "Any updates, OP????",
      "created_utc": 1733188543.0,
      "score": 17
    },
    {
      "id": "m2tlf8u",
      "body": "Hey mate, still checking in.\nHope you and your sister are ok. Please update us when you can there are a lot of people worried for you",
      "created_utc": 1734616143.0,
      "score": 16
    },
    {
      "id": "lz3mdv2",
      "body": "OP please call CPS. There is only so much you can do at 18. He needs to be investigated by the proper authorities. Expect pushback from your family. I hope they don’t, but predators do not only groom children, they also groom their parents - his wife/your mom probably wasn’t an exception.",
      "created_utc": 1732640328.0,
      "score": 48
    },
    {
      "id": "lz6rp30",
      "body": "I’m going to keep checking this thread for updates, as a mother, who found out her little girl (6) was being molested by her half brother (7) at her fathers house, i know the feeling in your gut / the pit in your stomach. Biased off your comments I can tell you will not let anything happen to her. You’re doing an amazing job.",
      "created_utc": 1732678276.0,
      "score": 17
    },
    {
      "id": "lzu7jzx",
      "body": "Man, please, an update",
      "created_utc": 1733036809.0,
      "score": 17
    },
    {
      "id": "m0idr7r",
      "body": "8 days. please let us know you’re both okay.",
      "created_utc": 1733386886.0,
      "score": 17
    },
    {
      "id": "lz7bcat",
      "body": "Hi OP, back again today looking for an update if possible. Your sister has been on my mind all night & day. Sending so much love & support from a fellow Australian ❤️",
      "created_utc": 1732687243.0,
      "score": 15
    },
    {
      "id": "m24rgyh",
      "body": "Coming back to this post to check for updates. Nothing new from OP?",
      "created_utc": 1734242836.0,
      "score": 15
    },
    {
      "id": "lz4zq0z",
      "body": "Any updates, OP?",
      "created_utc": 1732655393.0,
      "score": 14
    },
    {
      "id": "lz7end5",
      "body": "please please please do something. I was that 8 year old girl.\n\nplease please do something",
      "created_utc": 1732689061.0,
      "score": 15
    },
    {
      "id": "lz7fphg",
      "body": "Y’all doin okay? Any updates?",
      "created_utc": 1732689659.0,
      "score": 16
    },
    {
      "id": "lz7hwcp",
      "body": "I need updates on this oh my god",
      "created_utc": 1732690921.0,
      "score": 14
    },
    {
      "id": "lzaym1k",
      "body": "OP it’s been over a day i hope you’re still safe",
      "created_utc": 1732741509.0,
      "score": 14
    },
    {
      "id": "lz3iyyr",
      "body": "If it was innocent, I unfortunately don’t think he would have left upon seeing you. He would have just said something to you like “just checking in.” At the very least, he knows how it looks, and if he knows how it looks why is he doing it? All wishes to you and your sister.",
      "created_utc": 1732639293.0,
      "score": 29
    },
    {
      "id": "lz4i7dj",
      "body": "Please update us OP. Still thinking about this hours later sending hugs",
      "created_utc": 1732650002.0,
      "score": 13
    },
    {
      "id": "lz7xrvh",
      "body": "Man.   I want an update on this.",
      "created_utc": 1732701164.0,
      "score": 13
    },
    {
      "id": "lz3kual",
      "body": "I'm sorry for my previous comment, OP. You sound like an amazing big brother. I past judgement too soon. Do whatever you can do to protect her and see nothing happens to her.",
      "created_utc": 1732639862.0,
      "score": 12
    },
    {
      "id": "lz5l4oj",
      "body": "Your father was there to rape or assault her keep her in your room and have her with you as much as possible",
      "created_utc": 1732662299.0,
      "score": 11
    },
    {
      "id": "lza0smg",
      "body": "Hey OP how are you? I really hope you and your sister are alright.\nWishing you a lot of strength 🫂",
      "created_utc": 1732730918.0,
      "score": 12
    },
    {
      "id": "lzbsls3",
      "body": "I was molested from age 5 to age 8 by two male family members. It started with \"accidentally\" touching me inappropriately and \"mistaking\" where my room was. \n\nIt is not a misunderstanding.  Please protect your sister.",
      "created_utc": 1732751753.0,
      "score": 13
    },
    {
      "id": "lzimi0w",
      "body": "Hey OP, how are you doing? Any news? I hope you and your siblings are well no matter what ❤️",
      "created_utc": 1732856444.0,
      "score": 12
    },
    {
      "id": "lz3jt4a",
      "body": "OH MY GOD TELL OTHER ADULTS\n\nthis is NOT normal. This is NOT okay.",
      "created_utc": 1732639548.0,
      "score": 23
    },
    {
      "id": "lz4b1k7",
      "body": "Honestly you should go wake your brother up. I wouldn’t wait. And honestly your dad, with the time you are giving him, might concoct a way to get out of it",
      "created_utc": 1732647800.0,
      "score": 13
    },
    {
      "id": "lz4iwk6",
      "body": "It seems like he was comfortable enough doing it and just didn’t expect you- which makes it sound like a habit… stay with your sister dude",
      "created_utc": 1732650218.0,
      "score": 10
    },
    {
      "id": "lz5xib7",
      "body": "I have a grown daughter now. Not once did she see me naked. Ever!!! Not a chance. No excuse for this, something is up here and it’s not good. You need to get to the bottom of it. Makes me sick just thinking of this.",
      "created_utc": 1732666829.0,
      "score": 11
    },
    {
      "id": "lz8pe3s",
      "body": "You sleep in your sisters room now.",
      "created_utc": 1732715478.0,
      "score": 12
    },
    {
      "id": "lzonkpv",
      "body": "As a victim of CSA, by a stepparent, NO. This was not a simple mistake. He planned to abuse your baby sister.  Call him out, and talk to your sister. And, CALL CPS, immediately.",
      "created_utc": 1732952790.0,
      "score": 11
    },
    {
      "id": "m78kgwz",
      "body": "It’s been almost 50 days and we’ve had no updates still, hoping everything is okay.",
      "created_utc": 1736925304.0,
      "score": 10
    },
    {
      "id": "lz3akdz",
      "body": "An abuser will not admit to their abuse, and can become dangerous when confronted about it. Please be careful if you decide to have a conversation with him, and I would avoid being accusatory for the time being.",
      "created_utc": 1732636703.0,
      "score": 47
    },
    {
      "id": "lz3f2k8",
      "body": "I am so sorry, this doesn't look good at   Stay strong",
      "created_utc": 1732638106.0,
      "score": 10
    },
    {
      "id": "lz3hfja",
      "body": "WTFFF",
      "created_utc": 1732638826.0,
      "score": 11
    },
    {
      "id": "lz3lbbk",
      "body": "Remember to have doubt in your mind also.\nOnce, I sleepwalked into my step-sisters (we did not know eachother very well, and I am a man) room, and I woke up standing in her room, just as she was waking up and looking at me. That was VERY embarressing, because I felt as I had «faked» my sleep-walking.\n\nBut sexual assault happen way to much, so I don’t have to say anything else, because of all the other comments",
      "created_utc": 1732640005.0,
      "score": 10
    },
    {
      "id": "lz4jfjn",
      "body": "Please do not leave your little sister alone with him at all. You saved her tonight",
      "created_utc": 1732650378.0,
      "score": 9
    },
    {
      "id": "lz4q6nb",
      "body": "Mate.. don’t let this slide, don’t you dare let this slide. Speak up NOW!!\n\nYour little sister is not safe.",
      "created_utc": 1732652461.0,
      "score": 8
    },
    {
      "id": "lz7clpy",
      "body": "3 sons and 1 daughter and he’s only done this to your sisters room and never you or your brothers?\n \nPlease stay with her at night. \n\nI have a feeling this is why she has asked you to stay in her room with her many times before!\n\nYou and your brothers will protect her at all costs! You know what you have to do. \nBest of luck mate!",
      "created_utc": 1732687926.0,
      "score": 11
    },
    {
      "id": "lz7ek2h",
      "body": "OP, we need an update here….",
      "created_utc": 1732689011.0,
      "score": 9
    },
    {
      "id": "lz7ek6o",
      "body": "Everyone saying maybe the dad went into the wrong room. Lol. So both parents must’ve been lost. And the mum let the dad go into the wrong room and shut the door.  Everything sounds suss.",
      "created_utc": 1732689012.0,
      "score": 11
    },
    {
      "id": "lz9qprt",
      "body": "Ummm. Call the police. A naked man walks into the room of an 8 yo for one reason. Thank goodness you were in there. And I’d not allow her to be alone with him.",
      "created_utc": 1732727821.0,
      "score": 10
    },
    {
      "id": "m34wf9z",
      "body": "I am so worried for OP. Can anyone from Australia check in?",
      "created_utc": 1734789296.0,
      "score": 10
    },
    {
      "id": "m4lg39f",
      "body": "I still check this post everyday hoping for an update from OP. I hope all is ok",
      "created_utc": 1735597094.0,
      "score": 11
    },
    {
      "id": "m4nktbo",
      "body": "Any update OP?",
      "created_utc": 1735625515.0,
      "score": 9
    },
    {
      "id": "mayjhal",
      "body": "it’s been 70 days, i hope you’re alright OP",
      "created_utc": 1738691715.0,
      "score": 11
    },
    {
      "id": "lz3jb55",
      "body": "Don’t listen to everyone saying “just put a camera in the room”. DON’T FREAKING DO THAT. Contact family members. Contact authorities. I know this is an extremely difficult situation and I cannot imagine how shocking and world upending seeing that was, especially without any proper explanation. Your sister could be in danger. Actively. If you were to set up a camera to try and capture evidence on your own, you very well could be capturing CSAM (intentionally or not) and that is going to be hard to explain to police, should you report after. Please don’t try and capture evidence on your own before contacting authorities.",
      "created_utc": 1732639396.0,
      "score": 37
    },
    {
      "id": "m0ic57o",
      "body": "He’s dead ain’t he. Dad gathered his thoughts and killed him. Someone in Aus contact the police.",
      "created_utc": 1733385820.0,
      "score": 27
    },
    {
      "id": "lz3chit",
      "body": "Keep a fucking eye on him.",
      "created_utc": 1732637304.0,
      "score": 19
    },
    {
      "id": "lz3it8l",
      "body": "I hate seeing that there are people questioning OP. \n\nOP, you’re doing fine. CSA is awful to go through and I know that first hand, but I couldn’t imagine how damaging it could be for it to happen via a parent because a stranger took advantage of me and not a family member. Your sister clearly trusts you if she used to seek comfort from you when she was scared by asking you to sleep on the floor next to her bed before. I’d recommend sleeping there every night until this is either proven to be a misunderstanding or until you’re able to put a stop to it and get her somewhere safe if that’s exactly what it was. \n\nEither way, don’t treat this lightly until you know for sure she’s okay and it was just some mishap. She’s lucky to have you, because my brother lived with our dad and I was too afraid to tell my mom until way too late so I didn’t have a big brother guarding me until later on down the line. The ones questioning you and being weird about it? Don’t listen to them. Just protect your little sister, and you be safe too.",
      "created_utc": 1732639245.0,
      "score": 19
    },
    {
      "id": "lz408f0",
      "body": "Keep us updated bro.",
      "created_utc": 1732644529.0,
      "score": 18
    },
    {
      "id": "lz40vj0",
      "body": "Hi. I know how you must be feeling. Trust me i do. And by all means, put a camera and do whatever else you think is needed to be done.\n\nJust a thought here, since your mom was behind him too. Is it possible that THEY were, you know, busy with each other... and then heard or saw something coming from your sister's room, and dad came to check and mom followed to make sure he had some back up? \n\nAnd maybe he COULDN'T say anything, because he was just shocked and embarrassed to have unintentionally flashed himself.\n\nAtleast i hope that's the case. Because it would absolutely suck if the other scenario were true, especially with your mom being there too.",
      "created_utc": 1732644723.0,
      "score": 21
    },
    {
      "id": "lz5i6cd",
      "body": "WHAT.  THE.  FUCK.  Are you safe?  Keep yourself and sister safe, so glad she has you.  This makes my stomach turn-please keep us updated, geeeezus…",
      "created_utc": 1732661279.0,
      "score": 8
    },
    {
      "id": "lz5v1el",
      "body": "I know you have a ton of advice here. But I say just call the police. And CPS. If it was innocent than it’ll be fine. I’m a mom and I would never be upset at one of my kids for protecting another one. Approaching them opens you up to gaslighting and even puts you in danger.",
      "created_utc": 1732665905.0,
      "score": 11
    },
    {
      "id": "lz6udnz",
      "body": "Update us when CPS/Authorities are involved.",
      "created_utc": 1732679360.0,
      "score": 11
    },
    {
      "id": "lz7bf61",
      "body": "whats the update here? is everyone okay?",
      "created_utc": 1732687286.0,
      "score": 8
    },
    {
      "id": "lz7ekrr",
      "body": "You poor guy. Something is definitely up and it sounds like kitty was protecting your sister with you.",
      "created_utc": 1732689022.0,
      "score": 9
    },
    {
      "id": "lz7ezyl",
      "body": "Any update?",
      "created_utc": 1732689257.0,
      "score": 9
    },
    {
      "id": "lz7kxfz",
      "body": "He walked in naked AND CLOSED THE DOOR. This is not a misunderstanding whatsoever! You know why he was there. Talk to your brother about this. Heck, talk to your sister too. But don’t ask too obvious questions …",
      "created_utc": 1732692758.0,
      "score": 9
    },
    {
      "id": "lz7n10y",
      "body": "Fuccck. Need an update please. I just saw this and I don’t think I can sleep now. Ugh.",
      "created_utc": 1732694065.0,
      "score": 8
    },
    {
      "id": "lz7y78z",
      "body": "I think you, your sister, your dad, your cat, and thousands of redditors all know exactly wtf happened. \n\nI have a foster child because of this very thing. Believe the truth literally dangling in front of you",
      "created_utc": 1732701442.0,
      "score": 9
    },
    {
      "id": "lznt45e",
      "body": "Any updates?????",
      "created_utc": 1732937280.0,
      "score": 9
    },
    {
      "id": "lzul4be",
      "body": "Hope all is well",
      "created_utc": 1733045726.0,
      "score": 9
    },
    {
      "id": "m4q3src",
      "body": "Checking for an update...still so worried..please OP give us something!!!",
      "created_utc": 1735667798.0,
      "score": 10
    },
    {
      "id": "mbdl914",
      "body": "Hey OP. I hope everything is okay.",
      "created_utc": 1738881466.0,
      "score": 10
    },
    {
      "id": "mm06cga",
      "body": "I've been revisiting this ever since it was first posted. Still no update. I really hope you and your sister are okay.",
      "created_utc": 1744102439.0,
      "score": 9
    },
    {
      "id": "lz3mw81",
      "body": "Take your sister to a doctor immediately. Call CPS and police. Do not listen to Dad's excuse. This is not normal!",
      "created_utc": 1732640483.0,
      "score": 18
    },
    {
      "id": "lz3qe5z",
      "body": "Op whatever it is this is not normal behaviour, keep an eye out for your little sister",
      "created_utc": 1732641566.0,
      "score": 8
    },
    {
      "id": "lz4l90x",
      "body": "God, please update. And please remember you can’t protect her from prison, so don’t get violent right off the bat. Please don’t let your father, brother or anybody talk you out of this without a damn good explanation or proof.",
      "created_utc": 1732650932.0,
      "score": 9
    },
    {
      "id": "lz5g37m",
      "body": "Your dad is a pedo or a TERRIBLE sleep walker. Confront him in front of the whole family so no one is in the dark.",
      "created_utc": 1732660579.0,
      "score": 8
    },
    {
      "id": "lz63ysr",
      "body": "Any updates? I hope you were able to talk to your brother and get some rest",
      "created_utc": 1732669239.0,
      "score": 7
    },
    {
      "id": "lz72to4",
      "body": "8 years old!? String him the fuck up🤬",
      "created_utc": 1732683015.0,
      "score": 8
    },
    {
      "id": "lz8ey3w",
      "body": "I just want to say in my experience with sleep walkers, NONE and I mean none of them would walk out of a room after noticing someone else or something different. They couldn't even notice anything going on with me yelling or talking to them let alone looking at them .  If you're still in school tell a teacher, if not go find someone that's considered a mandated reporter, or even report it yourself to her school! If you felt something was wrong and something made your stomach churn then you need to report it to an outside adult, too many spouses cover for the abuse their partner does, and too many family members have been abusers. Take caution and report immediately.",
      "created_utc": 1732711123.0,
      "score": 8
    },
    {
      "id": "lzc2oi9",
      "body": "hoping for an update soon. ❤️",
      "created_utc": 1732755597.0,
      "score": 7
    },
    {
      "id": "lzh29me",
      "body": "u/Oneforall100000 are you okay, dude? It's been a couple of days. Is your sister alright?",
      "created_utc": 1732832203.0,
      "score": 8
    },
    {
      "id": "lzltrlj",
      "body": "This account is 4 years old i’m pretty sure this is OP’s main account. If he’s safe eventually he’ll return. I hope for the best",
      "created_utc": 1732910174.0,
      "score": 8
    },
    {
      "id": "lzpgx3k",
      "body": "Is there any update on this. Been thinking of you and your sister",
      "created_utc": 1732971816.0,
      "score": 7
    },
    {
      "id": "m2w1d3e",
      "body": "Hope you're okay. Please let us know you're safe.",
      "created_utc": 1734645572.0,
      "score": 8
    },
    {
      "id": "m3riddj",
      "body": "op i am begging you to please update. your safety matters to thousands of people here. it’s been a month man",
      "created_utc": 1735150714.0,
      "score": 8
    },
    {
      "id": "m3vvuik",
      "body": "Any update on this, mate?",
      "created_utc": 1735227077.0,
      "score": 8
    },
    {
      "id": "m46qokn",
      "body": "Commenting to check again. It's been 25+ days. Is there anything you'd like to share with us? Vent? Text us back :)",
      "created_utc": 1735390954.0,
      "score": 8
    },
    {
      "id": "lz3fm0b",
      "body": "there is no way this has an innocent explanation. Literally none. Jesus christ im so sorry OP",
      "created_utc": 1732638269.0,
      "score": 17
    },
    {
      "id": "lz39s9r",
      "body": "Your sisters your priority. Your parents are pos. Please update us",
      "created_utc": 1732636461.0,
      "score": 22
    },
    {
      "id": "lz3gazt",
      "body": "I'm confused... \n\n1.  You said you saw your mom was behind him in the hallway.  You think your mom is just chilling and okay with your dad walking in her room naked?  \n\n2.  You were in your sisters room, with the door closed, at two in the morning?  Is there a possibility your parents thought that was odd, thought the worst, and barged in?",
      "created_utc": 1732638481.0,
      "score": 50
    },
    {
      "id": "lz41vp9",
      "body": "If you talk to her about it please for the love of god do not ask any leading questions. The cops and legal system will absolutely throw cases out if they feel like kids were spoonfed a story. Just ask her how she feels around dad, if anything strange is happening in her life, or just more general vague questions. Let her do the talking.\n\nIt’d be better to talk to your parents directly, tell a close relative the situation, and set up a camera if your alarm bells are ringing. This is not normal behavior. There’s no reason for your dad to be entering her room in that manner. Look up laws about recording in your state as well because you don’t want to get slammed with any issues if it turns out it’s illegal to record people without their knowledge in your state. You may even want to consider only using a voice recording device so you don’t get your sister on that camera because then that’s a separate and worse issue.\n\nDon’t ignore this please, please keep your eyes on this issue and tell trusted family members or adults.",
      "created_utc": 1732645027.0,
      "score": 5
    },
    {
      "id": "lz4a2gr",
      "body": "I'm not even religious but I'm praying for you. Please be careful. Some people would rather kill their kid then let it get out that they are up to that. Please tell someone outside your home ASAP. You may not be safe.",
      "created_utc": 1732647501.0,
      "score": 8
    },
    {
      "id": "lz4p8td",
      "body": "Does your dad sleep naked? \nMine does and something he gets up really early thinking no one is around so he waltz around the house and the garden naked to check on our animals and such.\nUnfortunately I witnessing him in his birthday suit a few times, (at least I didn't wear my glasses when it happened so everything was blurry, my mum told him off, not that it helped much).\n\nAnyways, this could still be a very messed up situation and I hope you can get to the bottom of this soon, just here to offer a possible explanation that isn't as f*cked up as my first thought about it.",
      "created_utc": 1732652166.0,
      "score": 7
    },
    {
      "id": "lz5e9ki",
      "body": "Unfortunately, it is incredibly likely that he is sexually abusing your sister. This will be a difficult situation to navigate for years to come, but your sister deserves to be protected. I genuinely hope you don't back down if he says it's a misunderstanding.",
      "created_utc": 1732659966.0,
      "score": 7
    },
    {
      "id": "lz5hsi7",
      "body": "It's sad that siblings have to take on parental roles when parents fail. If this actually is what we all hope it's not, then it's lucky you've got a chance to save her from further hurt and abuse. Protect your sister as best as you can, and remember abusers are good at manipulation and making the surface look clean. Dig deep, and you'll find the dirt. Don't stop until you are sure 100% she's safe. Any funny feelings or something seems off trust your gut.",
      "created_utc": 1732661149.0,
      "score": 7
    },
    {
      "id": "lz5lzv9",
      "body": "Either start sleeping in your sister's room or move her in with you, but do not leave her alone!\n\nUntil he is gone and she is safe.",
      "created_utc": 1732662607.0,
      "score": 6
    },
    {
      "id": "lz6vwdt",
      "body": "Protect her at all costs. Please open communication with someone you know you can trust. Make sure your sister knows you’re there to protect her.",
      "created_utc": 1732679976.0,
      "score": 6
    },
    {
      "id": "lz7fc6q",
      "body": "OP, I really applaud you for being so brave to post this here. I'm sure your first instinct was to brush it off or ignore it. Thank you and good for you for confronting a possibly horrible truth and for protecting your sister.",
      "created_utc": 1732689451.0,
      "score": 7
    },
    {
      "id": "lz7qqho",
      "body": "If you think your dad is pedo\nYou should do a doctor checkup on your sis and next you know :)",
      "created_utc": 1732696465.0,
      "score": 6
    },
    {
      "id": "lz7ywj8",
      "body": "Yo. Do not ever leave your sister alone again until this dude is in jail. There is no misunderstanding here, op. For him to be so casual about just walking in there naked, there is a history of abuse.\n\nPlease take this very, very seriously and act quickly.",
      "created_utc": 1732701906.0,
      "score": 7
    },
    {
      "id": "lz9lnp4",
      "body": "Sounds like it's time to go thru his phone.",
      "created_utc": 1732726255.0,
      "score": 7
    },
    {
      "id": "lz9mqhn",
      "body": "Please update when you can. This is not okay.",
      "created_utc": 1732726587.0,
      "score": 7
    },
    {
      "id": "lzcxk08",
      "body": "Did OP update?",
      "created_utc": 1732768085.0,
      "score": 7
    },
    {
      "id": "lzd2g16",
      "body": "Dude, update please!?! Are you alright?",
      "created_utc": 1732770364.0,
      "score": 7
    },
    {
      "id": "lzda1al",
      "body": "Op is there an update?",
      "created_utc": 1732774161.0,
      "score": 7
    },
    {
      "id": "lzfbwoh",
      "body": "Guys, is OP okay? 🥺",
      "created_utc": 1732811134.0,
      "score": 7
    },
    {
      "id": "lzi72wl",
      "body": "Has OP updated",
      "created_utc": 1732849386.0,
      "score": 8
    },
    {
      "id": "m029bal",
      "body": "Please see our comment and update us because you see, a lot of us have turned on notifications to this post.",
      "created_utc": 1733159873.0,
      "score": 7
    },
    {
      "id": "m0aya2p",
      "body": "Any update??",
      "created_utc": 1733278339.0,
      "score": 7
    },
    {
      "id": "m1qa8ec",
      "body": "Hope everything is okay",
      "created_utc": 1734027809.0,
      "score": 7
    },
    {
      "id": "m2vpije",
      "body": "In case you wanna talk about it: how is the situation rn?",
      "created_utc": 1734641819.0,
      "score": 8
    },
    {
      "id": "m48g6ia",
      "body": "Any updates?",
      "created_utc": 1735413296.0,
      "score": 8
    },
    {
      "id": "m6df96w",
      "body": "I’m seeing this 44 days later and I hope all is well and that you and your sister are safe.",
      "created_utc": 1736497105.0,
      "score": 6
    },
    {
      "id": "mdrblds",
      "body": "Any updates?",
      "created_utc": 1740031025.0,
      "score": 7
    },
    {
      "id": "lz3snmh",
      "body": "What was his facial expression like when he saw you and what was his body language? What about your mom's reaction? One explanation I can think of is he was checking to see where one of the pets was. If he was doing something harmless like that or checking a thermostat or something, he would leave embarrassingly because he was nude and just didn't feel like getting his kit on again to do such a small thing if the sister was asleep. Hope for the best but think of the worst.",
      "created_utc": 1732642252.0,
      "score": 32
    },
    {
      "id": "lz3h4zh",
      "body": "please tell someone ",
      "created_utc": 1732638736.0,
      "score": 4
    },
    {
      "id": "lz3joe2",
      "body": "Call police",
      "created_utc": 1732639506.0,
      "score": 8
    },
    {
      "id": "lz4kkzn",
      "body": "We have children a year-three years older than this and a one and three year old. We’re only naked if we’re darting from the bathroom to the bedroom (right next to each other) and even then it’s an emergency. I don’t think that was an accident or anything like it.",
      "created_utc": 1732650729.0,
      "score": 7
    },
    {
      "id": "lz51spr",
      "body": "This made me sick\nPlease don't leave your sister alone until something is figured out.",
      "created_utc": 1732656033.0,
      "score": 6
    },
    {
      "id": "lz5gwwb",
      "body": "Whatever happens, make sure she knows it’s not her fault",
      "created_utc": 1732660855.0,
      "score": 8
    },
    {
      "id": "lz5hijb",
      "body": "op talk to your little sister first. don’t use any sort of suggestive wording that could lead her to falsely answer your questions but don’t be so direct about it like “does dad come in your room naked at night” start with “does dad ever wake you up when you’re sleeping sometimes” and ask more questions like what he does when he wakes her up and see where it goes from there. if she gives any alarming answers, and even if not, talk to your brother immediately after and tell him everything.",
      "created_utc": 1732661056.0,
      "score": 5
    },
    {
      "id": "lz5kn6j",
      "body": "Update us when you can OP. I hope you are all ok.",
      "created_utc": 1732662127.0,
      "score": 4
    },
    {
      "id": "lz6wrv3",
      "body": "Did we need an update…",
      "created_utc": 1732680343.0,
      "score": 5
    },
    {
      "id": "lz7ck66",
      "body": "Coming in at 2 in the morning and then being surprised to see you is not good. He would have given you an explanation and not slithered away if there was a good reason.",
      "created_utc": 1732687903.0,
      "score": 5
    },
    {
      "id": "lz7cue9",
      "body": "At this point you are choosing between your dad & sister. Protect your dad by giving him the benefit of the doubt or protect your sister even if you aren’t 100% sure. If your dad is innocent, your accusation would hurt him, but he would likely be cleared after examinations. If something is happening to your sister, that would be a lot worse to me.",
      "created_utc": 1732688058.0,
      "score": 4
    },
    {
      "id": "lz7zqll",
      "body": "The only harmless scenario I can think of is mom & dad were just getting it on & went to get a drink & checked on the kids while doing so. But maybe that’s even a stretch. I really hope this is a misunderstanding for the sake of your family , but don’t downplay this OP. Regardless, you are an incredible protector for noticing and standing guard. I hope you come back with a positive update",
      "created_utc": 1732702444.0,
      "score": 5
    },
    {
      "id": "lz8cbtp",
      "body": "Still no updates?",
      "created_utc": 1732709856.0,
      "score": 6
    },
    {
      "id": "lz8i3o4",
      "body": "Please please raise this in front of witnesses and report to social services/CPS. This wasn’t a mistake and has likely happened numerous times before. I’m so sorry for what’s happened but your sister needs serious protection here first and foremost. Hope you’re all okay",
      "created_utc": 1732712523.0,
      "score": 7
    },
    {
      "id": "lz8o7u0",
      "body": "Updates please",
      "created_utc": 1732715022.0,
      "score": 6
    },
    {
      "id": "lz9idpf",
      "body": "I wonder what’s happening, I hope it’s going well",
      "created_utc": 1732725250.0,
      "score": 7
    },
    {
      "id": "lz9kahe",
      "body": "Please please get her out of the house until this is addressed. See if she can stay with your older brother or other family. Trust me when I say, it will break her soul and break her mentally, if it hasn’t already. (I’ve been there) She’s still young and seems to have a caring older brother. Please protect her. I had no one to protect me and it made me grow up without any self love or self respect. Don’t let that happen to her.",
      "created_utc": 1732725837.0,
      "score": 7
    },
    {
      "id": "lz9kp6y",
      "body": "1. Write down every single detail. Literally every detail that you remember from that night. \n2. If you can you should get a camera, like a google camera, and set up alert when anyone enters her room. They’re pricey but you can return it before 30 days is up. \n3. Tell your mom and check for reaction, but do not tell her about the camera. \n4. Call CPS\n\nYou’re a great brother and she is so lucky to have you.",
      "created_utc": 1732725961.0,
      "score": 5
    },
    {
      "id": "lzaffrp",
      "body": "OP, any updates?",
      "created_utc": 1732735460.0,
      "score": 6
    },
    {
      "id": "lzb9834",
      "body": "Please post an update!",
      "created_utc": 1732744843.0,
      "score": 5
    },
    {
      "id": "lzcjxe4",
      "body": "Please let us all know the outcome. We're so concerned about you and your sister. Please update us.",
      "created_utc": 1732762304.0,
      "score": 6
    },
    {
      "id": "lzcwc9n",
      "body": "Any update?",
      "created_utc": 1732767534.0,
      "score": 5
    },
    {
      "id": "lzdls6p",
      "body": "We are very concerned about you and your sister, are you all okay? Hope you and your brothers talked about it. Please update us when you can, OP.",
      "created_utc": 1732780927.0,
      "score": 6
    },
    {
      "id": "lzdt5lr",
      "body": "Inhope thats not an fucking click bait Troll Post with a serious topic ....",
      "created_utc": 1732785715.0,
      "score": 7
    },
    {
      "id": "lztlzkj",
      "body": "Can we get an update? What happened?",
      "created_utc": 1733025737.0,
      "score": 7
    },
    {
      "id": "lz3du9h",
      "body": "I don't think he'll come back, but yeah. Stay there. You should sleep if you can btw.",
      "created_utc": 1732637728.0,
      "score": 11
    },
    {
      "id": "lz5ec59",
      "body": "Im a father and my first thought is call the police",
      "created_utc": 1732659990.0,
      "score": 11
    },
    {
      "id": "lz3r8q3",
      "body": "Protect that angel at all cost! She's so lucky to have you, stay strong and please keep us updated!",
      "created_utc": 1732641825.0,
      "score": 4
    },
    {
      "id": "lz3zn24",
      "body": "Very bad! Make sure your sister is safe, but don’t deal with this yourself. If you can, tell CPS or another trusted adult who may or may not be your mom. You will have to be the judge on telling her or not. Don’t brush this off and don’t think it won’t happen again. It may have already happened and it may happen again. I’m so sorry you’re dealing with this but I’m thankful you did see, so you can stop any more from happening. Good luck to you and your sister",
      "created_utc": 1732644351.0,
      "score": 6
    },
    {
      "id": "lz41a2x",
      "body": "Get her out of there or with your older brother and talk with your sister if anything has ever happened ASAP",
      "created_utc": 1732644845.0,
      "score": 4
    },
    {
      "id": "lz41mbb",
      "body": "Please, please keep your sister safe.",
      "created_utc": 1732644948.0,
      "score": 7
    },
    {
      "id": "lz47zvm",
      "body": "do not leave her alone please",
      "created_utc": 1732646874.0,
      "score": 4
    },
    {
      "id": "lz4evc6",
      "body": "If you sister is comfortable with it (I read in the comments she has a floor mattress) I would sleep in her room on the floor from now on to make sure she is safe if she really is a heavy sleeper like you say. My 9 yr sister is a very hard sleeper to the point of sleep walking and peeing the bed still I couldn’t imagine something like that happening to her knowing she won’t wake up for it",
      "created_utc": 1732648975.0,
      "score": 4
    },
    {
      "id": "lz4hqom",
      "body": "Please update us, this is so weird I don’t see a good explanation for this other than checking up on her, but the fact that he saw you and walked out without a word is not a good sign, also be prepared that if your dad was up to no good, he will try to turn the tables on you, since you were also in her room in the early am.",
      "created_utc": 1732649858.0,
      "score": 4
    },
    {
      "id": "lz4iown",
      "body": "Unless by some very small chance your dad has a serious sleep disorder that is causing this, he's a creep and you need to do everything possible to protect your sister.\nHave a conversation with your parents, but make it very clear you will involve CPS.",
      "created_utc": 1732650153.0,
      "score": 6
    },
    {
      "id": "lz4q16s",
      "body": "i know it must feel like your entire world is falling apart right now, but protecting your sister is the right thing to do. i’m really sorry, but i genuinely cannot think of one good reason a father would need to enter his young daughter’s room naked. ESPECIALLY at 2 am. HELL, even if your parents were “getting busy” and decided to come check on her, dad didn’t have time to throw on a pair of underwear or wrap a sheet around himself before checking? and THEN, he needed to shut himself in your sister’s room, with no clothing on whatsoever?\n\nonce again, i am genuinely sorry you’re experiencing this, but this isn’t just a misunderstanding, no matter what they tell you. they’re taking this time to come up with a story to appease you with. telling your older brother is the best thing you can do right now, but please be prepared to act without him if he doesn’t take this seriously. there is absolutely no way this was just a simple mix up.",
      "created_utc": 1732652413.0,
      "score": 4
    },
    {
      "id": "lz56xvg",
      "body": "Is this a real story? Cause WTF",
      "created_utc": 1732657632.0,
      "score": 4
    },
    {
      "id": "lz5k07g",
      "body": "Do not leave that little girl alone at any point. If it were me, I would confront both parents and call CPS and the police. There is absolutely no reason a father walks naked into his little girls room and shuts the door behind him other than to molest her.  He saw you and left the room so seeing you stopped whatever action he was going to do- this time.",
      "created_utc": 1732661904.0,
      "score": 3
    },
    {
      "id": "lz5o8im",
      "body": "Call the police.",
      "created_utc": 1732663410.0,
      "score": 5
    },
    {
      "id": "lz5qair",
      "body": "Yeah there’s really no other explanation for this. If he was sleepwalking, he wouldn’t have been able to see you and react by getting out of dodge. If he was going to check on her, then why on Earth not slap on a robe really quick. Even if it’s urgent, unless she let out a bloodcurdling shriek, what parents checks on their kids naked? Not to mention, he closed the door behind himself, that’s not “checking” that’s entering to DO something. \n\nGenuinely skip calling family and go right to CPS, if it’s a misunderstanding then the case will be open and shut. If it’s not, you’ll have trained professionals be there to investigate. Please don’t try and investigate on your own, not only could that flub any case against your parents, but worse, it could put you or your sister’s lives in danger. I’m so, so sorry this has happened. It’s not something anyone should have to go through. But just know, you’re doing good by your little sister by looking out for her like this.",
      "created_utc": 1732664164.0,
      "score": 5
    },
    {
      "id": "lz73gj1",
      "body": "I saw my dad naked ONCE and it was on ACCIDENT. I didn’t know he had just gotten out of the shower and I went in their bathroom unannounced to go pee. THIS is NOT normal. My dad has always ever been clothed around me and my 8 brothers. My step mom was a nudist or well her parents were which she would be naked around me but not my brothers. This is not normal. I can’t say that enough. Put a camera in the room at night if you have to.",
      "created_utc": 1732683305.0,
      "score": 5
    },
    {
      "id": "lz74m4r",
      "body": "Won't the camera paint the OP in a pervert's light? The father can flip the story around the brother and use the camera as a blackmailing tool to silence him in case the father finds the hidden camera before it managed to record the father in the act.\n\nHe would say that the brother is a pervert who installs camera in his sister's room and he would have darn good evidence in the form of recorded material of that camera and OP would either go to jail, or would be forced to obey the father and be blackmailed into a permanent silence. \n\nJust a hypothesis",
      "created_utc": 1732683846.0,
      "score": 6
    },
    {
      "id": "lz752nd",
      "body": "Hey OP. Any updates on the situation? Have you talked with anyone yet?",
      "created_utc": 1732684066.0,
      "score": 7
    },
    {
      "id": "lz8cfnk",
      "body": "> It is not your job to prove it. It is not your job to gather evidence. If you suspect child abuse may be occurring, your job is to report it to child protection and let them investigate.  \n  \nJust repeating so that OP notice this",
      "created_utc": 1732709909.0,
      "score": 4
    },
    {
      "id": "lz8vxb0",
      "body": "“ if you see something, say something”\nPlease tell or call someone.",
      "created_utc": 1732717900.0,
      "score": 4
    },
    {
      "id": "lz8z3gf",
      "body": "update time buddy",
      "created_utc": 1732719022.0,
      "score": 5
    },
    {
      "id": "lz96jbu",
      "body": "Okay. It's been almost a full day now. Everyone should be awake. What's the update on this situation?",
      "created_utc": 1732721516.0,
      "score": 5
    },
    {
      "id": "lz9ksy5",
      "body": "Please file a report. Please. Talk to your sister. Ask her if it’s been happening. Be direct and explicit, not crude, but ask the hard questions clearly, using proper terminology. Your sister needs a hero right now…",
      "created_utc": 1732725994.0,
      "score": 5
    },
    {
      "id": "lzae7u3",
      "body": "So, you're staying in your lil sister's room every night from now on, right??",
      "created_utc": 1732735078.0,
      "score": 6
    },
    {
      "id": "lzah3u3",
      "body": "🚩🚩🚩🚩🚩🚩🚩 \nDO NOT IGNORE OR WAIT ON THIS!! \nTHAT ISNT NORMAL OR OKAY BY ANY MEANS!!\n\n\nDo not let him try and turn it around on you either, I guarantee  he will try to shift it and ask why you were in her room at that hour ect ect.  You have protected your sister thus far personally, I wouldn't let her sleep alone anymore or in her room by herself. Especially with that man in the house.",
      "created_utc": 1732735984.0,
      "score": 5
    },
    {
      "id": "lzayxcy",
      "body": "Update?",
      "created_utc": 1732741609.0,
      "score": 5
    },
    {
      "id": "lzb2n0s",
      "body": "any update op?",
      "created_utc": 1732742770.0,
      "score": 5
    },
    {
      "id": "lzd1w36",
      "body": "Trained (not licensed) counselor who is the older sister of an adult who was groomed and abused as a child.\n\nProtect your sister at all costs. \n\nWhat this means right now is two things:\n1. Physical Safety—Sleep in the bed with her every night if you have to right now, and don't let her out of your sight. If your brother is nearby and you can play it off as a sibling sleepover, take her over there and stay.\n\n2. Psychological Safety—Work with your brother to get your sister to see a counselor who has experience working with children & sexual abuse/trauma. Don't try to talk to her about her experiences even if you want to. Counselors will often allow someone to accompany a child at the beginning of an appointment if it's requested, and they will always debrief with you before and/or after. Tbh, you probably need to talk to the counselor as well because this will take some processing.   If you need help figuring out where to start, look for area resources like child advocacy centers (and if that doesn't help, message me, and I'll see what I can find).\n\nMy sister had her boundaries repeatedly tested by our father and never had the opportunity to process it until adulthood. It has fractured my family in irreparable ways because of how it was handled/not handled. My sister has developed major mental health issues because she was prevented from receiving the care she needed. I only found out about this a few months ago, and the abuse happened almost 20 years ago. \n\nAgain, protect that baby no matter how much you love and trust your parents. \n\n💜—a big sister slightly older than you",
      "created_utc": 1732770103.0,
      "score": 5
    },
    {
      "id": "lzisk1e",
      "body": "Any updates? 😥",
      "created_utc": 1732859582.0,
      "score": 5
    },
    {
      "id": "lzl5yzd",
      "body": "Update??? WTF?",
      "created_utc": 1732902032.0,
      "score": 5
    },
    {
      "id": "lzqrley",
      "body": "Any update on this catastrophe?",
      "created_utc": 1732989369.0,
      "score": 5
    },
    {
      "id": "m01re54",
      "body": "please update",
      "created_utc": 1733154125.0,
      "score": 5
    },
    {
      "id": "mkaoj9p",
      "body": "Holy fuck, that's crazy! I can't even imagine it's been a coincidence going all in and opening the wrong door by mistake. In his own freaking house! It's  been a while since OP posted that topic, I hope things have cleared up.",
      "created_utc": 1743215609.0,
      "score": 4
    },
    {
      "id": "lz3775w",
      "body": "wtf",
      "created_utc": 1732635645.0,
      "score": 8
    },
    {
      "id": "lz3agyj",
      "body": "Don’t expect truth from your parents. Talk to them separately first. I’d def get a camera. I’d ask your sister. Depending on what you feel, you could contact CPS. It is bizarre that your mom was right there. I am trying to think of a reason he’d enter and close the door.",
      "created_utc": 1732636674.0,
      "score": 10
    },
    {
      "id": "lz3v7ca",
      "body": "I hope he just had a hanky manky session with your mum in the middle of the night when everyone is asleep, and was simply on his way to the bathroom to wash up...",
      "created_utc": 1732643022.0,
      "score": 4
    },
    {
      "id": "lz3vidl",
      "body": "Protect your sister. At all costs. There’s nothing normal about what you saw. Every explanation will be a bad one. Please do not ignore what your guts told you, don’t look the other way. Whatever would have happened or already happened, show your sister that you are there for her. She’s only 8. I feel for you both and cannot comprehend what you’re going through right now. I’m supporting you from afar.",
      "created_utc": 1732643115.0,
      "score": 4
    },
    {
      "id": "lz43fy8",
      "body": "Please sleep in her room until you report this to someone!",
      "created_utc": 1732645500.0,
      "score": 4
    },
    {
      "id": "lz4dfav",
      "body": "Wtf",
      "created_utc": 1732648532.0,
      "score": 4
    },
    {
      "id": "lz4i0sa",
      "body": "Please update us!",
      "created_utc": 1732649945.0,
      "score": 3
    },
    {
      "id": "lz4k0mf",
      "body": "Any updates OP?",
      "created_utc": 1732650557.0,
      "score": 5
    },
    {
      "id": "lz4mphl",
      "body": "Please update us, I'm really worried for your sister and for you",
      "created_utc": 1732651380.0,
      "score": 4
    },
    {
      "id": "lz4od0d",
      "body": "I would suggest staying with your sister when she sleeps from now on.",
      "created_utc": 1732651889.0,
      "score": 3
    },
    {
      "id": "lz4oeaw",
      "body": "Protect your sister...man 🥺😭",
      "created_utc": 1732651900.0,
      "score": 4
    },
    {
      "id": "lz4okw0",
      "body": "Start sleeping your sisters room until you talk to your brother 😭",
      "created_utc": 1732651957.0,
      "score": 4
    },
    {
      "id": "lz4oz3l",
      "body": "You mentioned in a comment that you saw your mothers outline? Does this mean she was awake? I seriously hope this isn’t a sign of being complicit. I know it’s a horrible situation to be in but you cannot trust either them at all until you begin to piece the situation together. Best of luck and thank god you were there",
      "created_utc": 1732652083.0,
      "score": 4
    },
    {
      "id": "lz4rw7u",
      "body": "DO NOT BRUSH THIS OFF. Talk to your brother and other trusted adults outside of your parents who can help if things go sideways.",
      "created_utc": 1732652995.0,
      "score": 4
    },
    {
      "id": "lz4ujyw",
      "body": "CALL. THE. COPS. Do not let this slide with an explanation or a talk, call the cops. My best advice here -  CALL THE COPS. You are 18 - take your sister, tell all the adults, call the cops. Do not let that man around her at any costs. I am a father of three, two girls - You have a chance to save her now, and you will regret it the rest of your life if you don't. Advocate - because this was NOT A MISTAKE.",
      "created_utc": 1732653816.0,
      "score": 4
    },
    {
      "id": "lz5lfj2",
      "body": "Call the police",
      "created_utc": 1732662407.0,
      "score": 3
    },
    {
      "id": "lz5uwgb",
      "body": "Protect your sister",
      "created_utc": 1732665854.0,
      "score": 5
    },
    {
      "id": "lz5xdtq",
      "body": "Not sure where you live, but it’s been 8 hours since OG post. Has any conversation been had?",
      "created_utc": 1732666783.0,
      "score": 3
    },
    {
      "id": "lz6lgor",
      "body": "He will gaslight. Involve everyone, don’t let it go. This is very very sad. The fact that he left after seeing you means he was not sleepwalking .. he’ll claim that he was. Involve the older brother and mom!",
      "created_utc": 1732675859.0,
      "score": 3
    },
    {
      "id": "lz6lxhd",
      "body": "Hey.. Any update if you're up for it? Doesn't need to be detailed, just something short for those of us concerned 🥺 hang in there, it's necessary to confront this no matter how difficult. Thank you for loving and protecting your sister ❤️",
      "created_utc": 1732676034.0,
      "score": 4
    },
    {
      "id": "lz6oc2s",
      "body": "Do you have any updates for us OP?",
      "created_utc": 1732676958.0,
      "score": 4
    },
    {
      "id": "lz6q5pv",
      "body": "What’s the update??",
      "created_utc": 1732677665.0,
      "score": 4
    },
    {
      "id": "lz73izr",
      "body": "Take the girl to a therapist that knows how to investigate the incident and if this was a regular occurrence",
      "created_utc": 1732683335.0,
      "score": 5
    },
    {
      "id": "lz7dp9a",
      "body": "Any update?",
      "created_utc": 1732688534.0,
      "score": 4
    },
    {
      "id": "lz7kvsi",
      "body": "This sounds terrifying. Please call officials. Even if it was just a misunderstanding that is the best course of action. Please update us if possible OP, hope your sister is safe.",
      "created_utc": 1732692729.0,
      "score": 3
    },
    {
      "id": "lz7nmai",
      "body": "That has literally just made my stomach turn 😫 you need to do something",
      "created_utc": 1732694433.0,
      "score": 3
    },
    {
      "id": "lz7vgbl",
      "body": "update?",
      "created_utc": 1732699611.0,
      "score": 5
    },
    {
      "id": "lz87lhr",
      "body": "I haven’t seen anyone else mention this, be careful he/they do not try to turn it on you or gaslight you by asking why you yourself were in her room at 2am. Cornered people will turn to drastic ends not to go to prison or ruin their reputation. I agree that if your brother doesn’t want to help you will have to do it yourself by any means necessary. Be with her as much as you can, I know with work or school that could be hard. This has to stop. Now. Best of luck.",
      "created_utc": 1732707334.0,
      "score": 3
    },
    {
      "id": "lz95zhy",
      "body": "NO he wasn't sleepwalking.  He thought everyone was asleep.   He brought his nakedness to your sister.  Hes officially a pedo.",
      "created_utc": 1732721336.0,
      "score": 4
    },
    {
      "id": "lzahjjo",
      "body": "Please say something to someone and confront him about it. In front of his wife and everyone else. Report it if you can.",
      "created_utc": 1732736118.0,
      "score": 4
    },
    {
      "id": "lzaj6b2",
      "body": "Any updates? Really hope you’re okay op.",
      "created_utc": 1732736626.0,
      "score": 4
    },
    {
      "id": "lzakzvu",
      "body": "He’s more than likely abusing her 😪",
      "created_utc": 1732737197.0,
      "score": 3
    },
    {
      "id": "lzb5vac",
      "body": "I was sexually abused by my father. I never would have thought he was doing it to my little sister as well. Thank god I got the courage to talk to her, because he was. I pray that’s not the case here, but nothing else seems plausible. I’m so sorry, I know how much this must be fucking your world up. Hugs",
      "created_utc": 1732743780.0,
      "score": 4
    },
    {
      "id": "lzb8xzq",
      "body": "OP - Did you manage to speak with your brother?",
      "created_utc": 1732744754.0,
      "score": 4
    },
    {
      "id": "lzbdo1n",
      "body": "Your dad now knows that you know. I’m interested in what he says to you about this middle of the night meeting. What’s he defensive, cavalier or did he not say anything. That’s going to be pretty telling I think",
      "created_utc": 1732746316.0,
      "score": 4
    },
    {
      "id": "lzbkfbv",
      "body": "please come back to update us on this story i want to know your little sis is okay",
      "created_utc": 1732748683.0,
      "score": 4
    },
    {
      "id": "lzc0hwn",
      "body": "yeah I’d never let her sleep alone or be alone with him ever again. I’m so glad you were there 😫",
      "created_utc": 1732754756.0,
      "score": 5
    },
    {
      "id": "lzc2qs6",
      "body": "Need an update here",
      "created_utc": 1732755621.0,
      "score": 4
    },
    {
      "id": "lzc3ana",
      "body": "WTF. What happened update please",
      "created_utc": 1732755838.0,
      "score": 4
    },
    {
      "id": "lzd4wn1",
      "body": "Please update us, OP",
      "created_utc": 1732771549.0,
      "score": 4
    },
    {
      "id": "lzd72fm",
      "body": "Im so sorry, wish you the best, please update",
      "created_utc": 1732772621.0,
      "score": 5
    },
    {
      "id": "lzdmqs3",
      "body": "Can we have an update op",
      "created_utc": 1732781525.0,
      "score": 3
    },
    {
      "id": "lzhd1l0",
      "body": "Update pleaseeeee 🫶🏼",
      "created_utc": 1732836511.0,
      "score": 4
    },
    {
      "id": "lzi7sjf",
      "body": "Please give an update, OP!!",
      "created_utc": 1732849697.0,
      "score": 3
    },
    {
      "id": "lzmq4jd",
      "body": "It's been 3 days and no update,hopefully everyone is safe",
      "created_utc": 1732921639.0,
      "score": 4
    },
    {
      "id": "lzu8e32",
      "body": "Amy update?",
      "created_utc": 1733037329.0,
      "score": 5
    },
    {
      "id": "m012rkv",
      "body": "Any updates OP??",
      "created_utc": 1733144735.0,
      "score": 5
    },
    {
      "id": "m019zd4",
      "body": "Any updates, OP?",
      "created_utc": 1733147778.0,
      "score": 4
    },
    {
      "id": "m0ayako",
      "body": "Any update??",
      "created_utc": 1733278344.0,
      "score": 5
    },
    {
      "id": "mpwt4p1",
      "body": "Are you and your sister okay?",
      "created_utc": 1746047984.0,
      "score": 4
    },
    {
      "id": "lz37ekq",
      "body": "i’m planning on talking to my older brother who is 25 about this and go on from there i’m just hoping to god it’s all a misunderstanding",
      "created_utc": 1732635708.0,
      "score": 6686
    },
    {
      "id": "lz3787n",
      "body": "fuck man i saw my mum behind him too before he closed the door, i’m either going to get a heck of an explanation tomorrow and it’s a misunderstanding or my whole life is going to turn upside down, i have a damn amazing relationship with my parents",
      "created_utc": 1732635653.0,
      "score": 3517
    },
    {
      "id": "lz3ih1l",
      "body": "you’re okay, i’m prepared for the worst right now and i’m definitely really goddamn scared but i know i’m not alone. I have two brothers that would die for my sister and i’m ready to protect her no matter what.",
      "created_utc": 1732639144.0,
      "score": 1299
    },
    {
      "id": "lz3dgyj",
      "body": "she was asleep and she’s quite a deep sleeper. I’m extremely sorry about what happened to you and i wouldn’t wish that on anyone.",
      "created_utc": 1732637613.0,
      "score": 711
    },
    {
      "id": "lz6ab3n",
      "body": "By your parents? My God how horrible. I wonder how they get on the same page with something like this? Like who would ever go out on a limb to test the waters with something so evil?",
      "created_utc": 1732671613.0,
      "score": 9
    },
    {
      "id": "lz605ak",
      "body": "And yourself, too, OP, this is heavy shit.",
      "created_utc": 1732667813.0,
      "score": 66
    },
    {
      "id": "lz6vila",
      "body": "This is the best response. It needs to be higher up!",
      "created_utc": 1732679819.0,
      "score": 76
    },
    {
      "id": "lz85j82",
      "body": "U/oneforall1000000\n\nThis is essential. Let’s suppose something is happening;\n\n- camera footage (depending on where you are) can be deemed inadmissible if evidence is not approved with consent of all parties. Even if you catch them, it may not help any official case\n- approaching your parents directly may cause them to pivot methods and it will become harder to detect signs/catch\n\nYou’re an amazing elder brother. Please just be there for your sister and report the incident to the right authorities. There are trained professionals who can help who are experienced enough to avoid pitfalls that you might naturally fall into as you try to do the right thing. \n\nDo this with protest guidance and it will be a lot cleaner",
      "created_utc": 1732706103.0,
      "score": 29
    },
    {
      "id": "lz7yv49",
      "body": "i second this - this needs to be pinned!",
      "created_utc": 1732701880.0,
      "score": 4
    },
    {
      "id": "lz4y7cn",
      "body": "This is the most important thing.\n\nOne or the detectives on the “Small Town Dicks” podcast specialised in child abuse cases. He often says that parents and guardians should not try to find out specifics, to let the specialised interviewers do it. They know how to find out what happened without injecting possibilities into the child’s mind.\n\nHe said even he and other detectives do not do it, they wait for these special interviewers to come and do the interviews.",
      "created_utc": 1732654923.0,
      "score": 111
    },
    {
      "id": "lz64090",
      "body": "I'm inclined to agree with this and wish it was upvoted higher. You can call the Child Abuse hotline or CPS, whatever it may be in your area, and just state the facts. Where you were at what time, what did you see, hear, etc., and who else was around. Just like how you posted to Reddit. And write all the details down with paper and pen and save them, in case someone else tries to contradict your or twist the story later.\n\nEDIT: I work in healthcare and we receive training on how to report suspected child abuse",
      "created_utc": 1732669255.0,
      "score": 37
    },
    {
      "id": "lz6ilg1",
      "body": "YES this this 100x this. everyone commenting on this while maybe well intentioned is extremely wrong. i am in disbelief that anyone would encourage that OP record his child sister as an adult himself or investigate this further. 100% straight to CPS, law enforcement, or some other mandated reporter like a doctor.",
      "created_utc": 1732674753.0,
      "score": 12
    },
    {
      "id": "lz6541e",
      "body": "This. OP, please listen to this advice.",
      "created_utc": 1732669668.0,
      "score": 3
    },
    {
      "id": "lz38tmz",
      "body": "if he’s seriously up to that disgusting shit i don’t know if i can hold my anger back seriously, everything was going well too i just graduated and everything",
      "created_utc": 1732636156.0,
      "score": 294
    },
    {
      "id": "m03wmfl",
      "body": "same I literally turned post notifications on for this thread",
      "created_utc": 1733178498.0,
      "score": 18
    },
    {
      "id": "m03ufnt",
      "body": "I think a lot of us can agree with you",
      "created_utc": 1733177772.0,
      "score": 12
    },
    {
      "id": "m042ss7",
      "body": "same i’ve never turned on notifications for a post before either and im invested",
      "created_utc": 1733180606.0,
      "score": 10
    },
    {
      "id": "m04epsw",
      "body": "I am right there with you with all my anxiety and scary thoughts. Ugh",
      "created_utc": 1733184898.0,
      "score": 9
    },
    {
      "id": "m0h651c",
      "body": "Same, I've never been so invested in a stranger before. I keep checking every morning and evening to see if there's an update.\nI really hope OP and his siblings are ok",
      "created_utc": 1733365884.0,
      "score": 10
    },
    {
      "id": "m03vsh7",
      "body": "Same",
      "created_utc": 1733178221.0,
      "score": 8
    },
    {
      "id": "lzkq2rg",
      "body": "i subscribed to the post hoping i’ll get a notif when he updates. i really hope he does soon telling us they’re all okay.",
      "created_utc": 1732896574.0,
      "score": 22
    },
    {
      "id": "lzkn1tf",
      "body": "Me too",
      "created_utc": 1732895518.0,
      "score": 8
    },
    {
      "id": "lz5j63c",
      "body": "Op is in Australia",
      "created_utc": 1732661617.0,
      "score": 4
    },
    {
      "id": "lz6dsor",
      "body": "Please stay safe OP, go to the authorities for your and your sister’s safety.\n\nAnd let’s say it is a misunderstanding, it’s better to have been safe than sorry. And say it was a misunderstanding and your parents are furious and/ or gaslight you afterwards, you were still not wrong. Your parents’ behavior was reckless and irresponsible. I know that that can be hard to hear and you are probably going through a lot of emotions. I can imagine what you’re feeling, I found myself in the same situation when I found out that my daughter was possibly SA’ed by her nanny. I didn’t sleep the whole night and didn’t know what to do. I phoned family and they said it was probably a misunderstanding and nothing happened, but when you know, you know and I’m so glad I didn’t listen to them and when to the authorities anyway even though it was soooo hard. No one saw it coming because her nanny was amazing, so friendly and had a good relationship with everyone.\nYou are your sister’s voice.",
      "created_utc": 1732672922.0,
      "score": 2
    },
    {
      "id": "lz3rbvg",
      "body": "For the privacy thing with the camera: you could always set it up so there are places she can safely stand out of view, or tell her where it is and let her cover it with a blanket or something when she’s dressing (and just make absolutely sure she uncovers it), and it’s better than nothing. Better than not having the camera, at least",
      "created_utc": 1732641852.0,
      "score": 54
    },
    {
      "id": "lz3bjy7",
      "body": "I'm pro camera as well. OP is eighteen, and he can't be there all the time. I'd expect some gaslighting to come, to try and convince him that he's reading something crazy out of nothing: \"I was just checking on her\", \"I heard a noise\", \"I was sleepwalking\".\n\nPredators work in the space where they feel like they're not going to get caught - 2:00AM in the morning, car rides alone, sick days from school, while the other kids are at sports training, special camping trips or sleepovers. They make their victims protect them, making them feel like telling the truth will destroy the family. Abuse doesn't always leave physical marks, and nor is it necessarily recognised as abuse by its victim. Camera would be real, physical, *actionable* evidence...or could indicate innocence.\n\nTalk to your brother, OP. Or talk to a female relative, or a guidance counsellor, but also look after yourself. I don't know what will happen next...but these things can eat you up inside for a long time.",
      "created_utc": 1732637015.0,
      "score": 276
    },
    {
      "id": "lz39fao",
      "body": "let’s say he would like to avoid something happening rather than record it",
      "created_utc": 1732636347.0,
      "score": 55
    },
    {
      "id": "lz63pfi",
      "body": "[deleted]",
      "created_utc": 1732669142.0,
      "score": 7
    },
    {
      "id": "lz4mp1b",
      "body": "Idk about this. Camera should be facing the door if it’s in the room. If he accidentally gets his sister “indisposed” on camera then he technically would be committing a crime and it’d blow up in his face. Camera should be in the hallway at most. A voice recording device would be best most likely.",
      "created_utc": 1732651376.0,
      "score": 5
    },
    {
      "id": "lz6emnq",
      "body": "Is it a good idea for an 18M to put a camera in an 8F bedroom? You should get another family member quietly involved first.",
      "created_utc": 1732673234.0,
      "score": 3
    },
    {
      "id": "lzpg3u9",
      "body": "I am worried too, it has been three with no comments or posts.",
      "created_utc": 1732971408.0,
      "score": 3
    },
    {
      "id": "m02yugm",
      "body": "I was wondering if anyone in Australia can check out the missing 18 year olds with a 25 yo brother and a sister......",
      "created_utc": 1733167796.0,
      "score": 9
    },
    {
      "id": "lza4ikh",
      "body": "Good atleast it gives some relief",
      "created_utc": 1732732068.0,
      "score": 5
    },
    {
      "id": "lziu92x",
      "body": "I’m subscribed to this post hoping for updates too. 💔",
      "created_utc": 1732860516.0,
      "score": 14
    },
    {
      "id": "m1ohyrr",
      "body": "I'm glad I'm not the only one worrying about it",
      "created_utc": 1734004988.0,
      "score": 12
    },
    {
      "id": "lz39v85",
      "body": "it’s 3am right now and i am not leaving my sisters room until the morning, i’ll talk to my brother first chance i get",
      "created_utc": 1732636486.0,
      "score": 241
    },
    {
      "id": "lz71vkx",
      "body": "I am so sorry that happened to your daughter. Thank you for being a safe person for her to come to, for believing her, and for doing what was necessary to protect her from further abuse. She is extremely blessed that you are her Mom. \nI hope you and her are doing well now and that he is getting help.",
      "created_utc": 1732682585.0,
      "score": 6
    },
    {
      "id": "m0ii6uk",
      "body": "I’ve been thinking about them! I hope they’re okay too",
      "created_utc": 1733389874.0,
      "score": 11
    },
    {
      "id": "m288jd2",
      "body": "unfortunately not:( i’m really worried for them, i hope everything is ok.",
      "created_utc": 1734297666.0,
      "score": 10
    },
    {
      "id": "lz42vzo",
      "body": "Yeah if he was just checking in because he was worried for the sister or heard a sound and wanted to investigate in haste, hence why he was naked, then why didn’t he question OP about why he was in the room at 2am, explained why he was naked too and why did he close the door after him? To check in on a sleeping child and to see if the room is safe/clear you’d at least need some light source from the hall way to have basic vision. Closing the door would defeat the purpose of checking on the child and making sure the room is safe. The parent’s behaviour is extremely questionable.",
      "created_utc": 1732645332.0,
      "score": 20
    },
    {
      "id": "lz4zkq5",
      "body": "Yeah same. This is disturbing me",
      "created_utc": 1732655348.0,
      "score": 5
    },
    {
      "id": "m36bzx0",
      "body": "What would I even search for? I’m in Aus but it’s a big place. Not sure if any details of OP",
      "created_utc": 1734807955.0,
      "score": 4
    },
    {
      "id": "m0idk65",
      "body": "Either that or there’s an investigation going on and he can’t talk about it. Hopefully it’s that and not something worse.",
      "created_utc": 1733386757.0,
      "score": 30
    },
    {
      "id": "m0jrqzk",
      "body": "I contacted someone in the early comments that tagged him as an Aussie. The guy refused to assist in any way. \n\nMy first instinct said this was fake. Let's just hope none of this was real but if it is, that he and family are in the midst of an investigation and Dad is in jail. Maybe the kid is with little sister and they are with a grandparent with no internet. Please, please let them be at a grandparents with no internet.",
      "created_utc": 1733411798.0,
      "score": 14
    },
    {
      "id": "lzobb5o",
      "body": "It's driving me crazy too!",
      "created_utc": 1732945389.0,
      "score": 5
    },
    {
      "id": "lz3nxoa",
      "body": "for me, it’s the fact that he came in and closed the door behind him. i have much younger siblings that i take care of, and i’ve checked on the many times while they slept, but i never walked in and closed the door behind me to do it. they could have opened the door, saw what was happening, maybe asked OP why he was in there if they were concerned about that. there was no reason for naked dad to walk in and close the door behind him, even if he was just “checking on her”.",
      "created_utc": 1732640809.0,
      "score": 51
    },
    {
      "id": "lz3muyc",
      "body": "1. It's not looking good for mom either 😟 The most generous explanation I have is that maybe she's aware of the abuse and was trying to convince dad not to go in but he went anyway (which is obviously still not good enough to protect her daughter). Or maybe she is also involved in the abuse. Either scenario is not unheard-of, unfortunately. \n\n2. OP said his sister used to ask him to sleep on the mattress on the floor in her room when she's scared, so there is a precedent for this normal and sweet interaction. But if OP's parents suspected something, why on earth would dad go in naked?!",
      "created_utc": 1732640472.0,
      "score": 57
    },
    {
      "id": "lz3iw73",
      "body": "This leads me to ask do the parents usually sleep naked? Did they possibly check on the daughter because they may have heard something? I'm not condoning the dad going in naked. He should've at least put on a pair of shorts. But maybe he figured it was too dark for her to be able to see anything. The whole thing does seem odd, but more information is needed before drawing any conclusion.",
      "created_utc": 1732639269.0,
      "score": 28
    },
    {
      "id": "lzdaefs",
      "body": "Not yet. Very concerning",
      "created_utc": 1732774356.0,
      "score": 7
    },
    {
      "id": "lzfe241",
      "body": "I’m wondering this also, we never got an update",
      "created_utc": 1732811859.0,
      "score": 5
    },
    {
      "id": "lz3tfhe",
      "body": "he seemed speechless, he was covering his dick though even before he saw me if that means anything at all. I didn’t get to see my mums reaction just her outline as he was about to close the door.",
      "created_utc": 1732642488.0,
      "score": 117
    },
    {
      "id": "lz71840",
      "body": "I came to check for an update too!",
      "created_utc": 1732682289.0,
      "score": 7
    },
    {
      "id": "lz9k8rw",
      "body": "Yeah OP hasn’t commented for the last 22-23 hours now, this has been on my mind all day for some reason. I hope it’s not what we all are dreading.",
      "created_utc": 1732725822.0,
      "score": 13
    },
    {
      "id": "lziw8j0",
      "body": "Doesn’t seem like it! I keep coming back to check",
      "created_utc": 1732861634.0,
      "score": 6
    },
    {
      "id": "lz3fgp1",
      "body": "Brother, I have daughters that age and I can tell you that you can hope for whatever you want; but this is NOT a misunderstanding!  I do NOT walk around the house exposing myself to young children, this is NOT normal!  Please speak to your brother.  The two of you circle the wagons around your sister and keep her safe.  Cautiously approach your mother about this but make yourselves VERY clear that you WILL involve CPS if you don’t have her cooperation!",
      "created_utc": 1732638225.0,
      "score": 6746
    },
    {
      "id": "lz3yjkp",
      "body": "This may be my own experience as a CSA survivor speaking when I was a bit younger than she is now, but I genuinely do not see any potential for it being a misunderstanding. An adult man entered the room of an 8 year old and left when he realized there was another adult in the room. Even if he was not going into that room with the intent to assault your sister, he was *at best* going to potentially expose himself in the nude to an 8 year old girl.\n\nFor now you shouldn't leave her alone while he's around if you can avoid it. Protect her.",
      "created_utc": 1732644016.0,
      "score": 358
    },
    {
      "id": "lz3qucm",
      "body": "Mate, talk to your brother by all means but, as someone who was raped by her dad at 4 years old, DO NOT WAIT ON THIS…PLEASE. You need to call cps, even if it turns out it was a mistake, but it doesn’t look like it to me in all honesty. I’d say tell your mum, but my mum didn’t even believe me, it was on,y when I told my infant school teacher that cps and police were called. Please, I’m begging you, if there’s nothing that comes from it then fair enough, but do you want to take that risk?\n\nPlease Update us if you can, I’m very worried about you and your sister.",
      "created_utc": 1732641702.0,
      "score": 681
    },
    {
      "id": "lz3hv1y",
      "body": "Do not assume about safety. Your father shouldn’t be walking naked into the privacy of his daughter’s room at 2am. Naked. Again, naked.",
      "created_utc": 1732638957.0,
      "score": 214
    },
    {
      "id": "lz5elqk",
      "body": "Tw:community pedo, gets away with most of it :(\n\nTo add onto what that one guy said PLEASE don’t let this go, this is not a misunderstanding. One time when I was, actually 8 I think, I was at a friend’s house with a few other girls. We were all playing outside but I went inside for something and her dad (only adult in the house) called me into the living room. When I walked in he was standing there fully naked and fully erect. For some reason i felt like i walked in on him so i just freaked out and left. I told my friends bc I just had a feeling this was a common occurrence there and it was. I ended up telling my parents too but not bc I knew it was wrong, but bc i didn’t know anything obviously and I was confused about what happened. They never let me go over there again but unfortunately they didn’t do anything about it. I found out a year or two after that incident that he did something to one of my friends but unfortunately the case went nowhere. Then a couple years ago I was talking to a girl I went to school with and apparently he did it to almost all his daughter’s friends!!! He ended up finally getting arrested in 2020, I think, bc he was still doing stuff to his younger daughter’s friends. Grown men being naked around children is NEVER a misunderstanding, don’t say nothing like my parents and all my classmates parents did.",
      "created_utc": 1732660079.0,
      "score": 86
    },
    {
      "id": "lz3d0fo",
      "body": "Hope it's a misunderstanding, but please don't assume it is right now. Protect her. Keep her safe.",
      "created_utc": 1732637468.0,
      "score": 345
    },
    {
      "id": "lz3k3nz",
      "body": "I think you're being optimistic.  Thank god you were there, this time.  Please tell someone in some kind of authority, they will be able to arrange the right procedures so this doesn't happen again.",
      "created_utc": 1732639638.0,
      "score": 58
    },
    {
      "id": "lz482av",
      "body": "Unfortunately, it's not a misunderstanding. He was there for exactly what you think he was. Please save your sister. Don't keep quiet, she needs you big brother!",
      "created_utc": 1732646894.0,
      "score": 60
    },
    {
      "id": "lz4ri3x",
      "body": "If it was a misunderstanding, your father would have said something already. \n\nHis silence speaks for itself.",
      "created_utc": 1732652874.0,
      "score": 40
    },
    {
      "id": "lz416ur",
      "body": "Please talk to your mom/her mom. There's no way to misunderstand this. I am a survivor of sexual abuse at the same age and I am currently enduring some gnarly PTSD where in my brain is making me relive such things. It is very very very possible you acting like this isn't what it clearly is will condemn your sibling to this fate. It might be too late but acting with the benefit of the doubt is wrong this time",
      "created_utc": 1732644817.0,
      "score": 35
    },
    {
      "id": "lz4nknv",
      "body": "Hey, this is a mega mega emergency. I also hope for your sake it’s a misunderstanding, but I wouldn’t trust a thing that comes out of your dad’s mouth regarding this. Check on your sister, and I’m so sorry this is happening to you. Please update with what your brother says.",
      "created_utc": 1732651647.0,
      "score": 34
    },
    {
      "id": "lz3qzfh",
      "body": "At the age of 6 my SON has ZERO reason to see myself or my wife unclothed and those boundaries have already been set.  In all honesty, he is naturally setting his own with his body already.",
      "created_utc": 1732641746.0,
      "score": 55
    },
    {
      "id": "lz3db3h",
      "body": "The longer you wait the more time they have to come up with lies and excuses. You should have said something immediately imo.",
      "created_utc": 1732637561.0,
      "score": 163
    },
    {
      "id": "lz464t8",
      "body": "Don't let him gaslight you, open your eyes and make the connections. This could be one of many signs",
      "created_utc": 1732646313.0,
      "score": 20
    },
    {
      "id": "lz3o2bz",
      "body": "I’m really sorry this is happening to you and your siblings. There’s no way this is a misunderstanding.",
      "created_utc": 1732640849.0,
      "score": 20
    },
    {
      "id": "lz4xrfq",
      "body": "Are you absolutely certain your brother will take your side on this? He'll believe you over your dad? He'll be willing to take the right steps to protect your sister, even if it means appropriate consequences for your dad and separating the family? Because if he doesn't, it could make things much worse. It's better to directly tell someone like CPS or a mandatory reporter like their teacher.",
      "created_utc": 1732654790.0,
      "score": 16
    },
    {
      "id": "lz46o6v",
      "body": "There is no way in hell this can be a misunderstanding, no way please see my comment that I just posted, you need to tell your brother, tell her mom, you NEED to tell them. THEN you both confront him, y'all need to get her checked out as well. Omg!!!! 😱",
      "created_utc": 1732646474.0,
      "score": 9
    },
    {
      "id": "lz55e6h",
      "body": "It's NOT a misunderstanding. There is no scenario in which it would be. That is a grown man entering your kid sisters room , because he was going to abuse her. You need to be madder about this. Get her the fuck away from him NOW. RIGHT FUCKING NOW.",
      "created_utc": 1732657152.0,
      "score": 6
    },
    {
      "id": "lz3opp4",
      "body": "And your mom do not hesitate to tell her.",
      "created_utc": 1732641048.0,
      "score": 11
    },
    {
      "id": "lz50137",
      "body": "Honestly this requires you calling and reporting this. They then can check to see if your sister has been violated by your dad. I can’t think of a single reason a dad would come in naked to an 8 year olds room.  Not one. Please call",
      "created_utc": 1732655488.0,
      "score": 4
    },
    {
      "id": "lz55fxr",
      "body": "It’s not a misunderstanding. Don’t be naive.",
      "created_utc": 1732657167.0,
      "score": 5
    },
    {
      "id": "lz79fkg",
      "body": "He came in there for a reason and probably has before. Talk to brother, grandparents, aunts and uncles, and the counselor at school. I hesitate talking to your mother until you have people at least two or three to be there with you. I have seen mothers trying to sweep it under the rug or pretend it didn’t happen for the sack of the family. You do need to make her aware before too many people know. As a teacher, I am a mandated reporter, and sadly I had to report this before. She needs to be seen by a physician asap as well. They have to report if they see anything. We are all here for you, while you are here for her. You can do this. I am proud of you for not ignoring this. You are doing the right thing. Take care, OP.",
      "created_utc": 1732686241.0,
      "score": 4
    },
    {
      "id": "lz54yy2",
      "body": "That's reckless. You should report and let professionals deal with the investigation and determining any misunderstanding, not you or your 25 year old sibling.",
      "created_utc": 1732657020.0,
      "score": 4
    },
    {
      "id": "lz37fak",
      "body": "If their explanation doesn’t make perfect sense hide a camera in the room.",
      "created_utc": 1732635714.0,
      "score": 2566
    },
    {
      "id": "lz3wtoq",
      "body": "So your Mom was with your Dad in the hall while Dad was naked.  Then Dad alone walked into his 8 year old Daughter’s bedroom at 2:00am.  Then Dad saw you, then he turned around saying nothing, opened the door, and went back into hall.  All this time he was completely naked. \n\nDo I have that right? \n\nI f so, I honestly would call the police. \n\nPolice need to speak with each parent and daughter separately, then parents together. \n\nSOMETHING bad is happening here, and you will never get the truth. \n\nPlease protect your little sister by calling the police. \n\nYes your family will blow up.  There is no way to avoid that now. It is the only way to protect and defend your little sister who, in one way or another, is being victimized. \n\nHugs to you big brother.  I am so thankful you were hanging out petting the cat and chilling.  You saved your sister.",
      "created_utc": 1732643509.0,
      "score": 206
    },
    {
      "id": "lz3kq05",
      "body": "Your mom being there makes it even scarier. Like wtf—",
      "created_utc": 1732639826.0,
      "score": 42
    },
    {
      "id": "lz3c24x",
      "body": "Parent here.\n\nI have kids around that age, and I can tell you that when my wife and I go to bed, we usually briefly check on them. We go into their room to close their window or cover them up if it's too cold, etc. I don't know that we've ever been completely naked while doing so, but I guess it's conceivable? Like if we had already undressed and then realized we forgot to check on them? \n\nI'm not saying this is guaranteed what's going on, just that there's a plausible scenario where what happened isn't nefarious. You still definitely need to get answers here.",
      "created_utc": 1732637173.0,
      "score": 205
    },
    {
      "id": "lz3guwr",
      "body": "I’m sorry but she was in her room, right? There’s zero reasonable explanation as to why he would go in her room while naked. Please make sure she is safe.",
      "created_utc": 1732638649.0,
      "score": 35
    },
    {
      "id": "lz48sqq",
      "body": "Wtf?! Why was mom behind him??",
      "created_utc": 1732647115.0,
      "score": 14
    },
    {
      "id": "lz4myog",
      "body": "I hope they were just opening the door to make sure she was asleep because they, your mom and dad, just got done doing the nasty (being that he was naked) and wanted to make sure they didn’t wake her. I really freaking hope that’s why",
      "created_utc": 1732651458.0,
      "score": 5
    },
    {
      "id": "lz4zm39",
      "body": "Honestly, even if he had bad intentions I still can't wrap my head around why he's walking around the house naked while his son is home, and your mom is behind him. \nWas she naked too?\n\nIdk man, something is very weird here. I can't even come up with a single excuse for him or your mom.",
      "created_utc": 1732655359.0,
      "score": 4
    },
    {
      "id": "lz6m9aj",
      "body": "What was mom’s reaction? Did she see you? My concern is that they didn’t react to seeing you. Just kinda left. That’s odd to me. My dad slept nude and he got up to go to the bathroom once in the middle of the night just as I was coming back to my room from getting some water. He literally screamed “oh my God.” And I just ran past him. Told me my mom in the morning and she just laughed and said he mentioned it to her and was embarrassed. Luckily I wear glasses and couldn’t really “see” anything. \n\nThere’s really no good reason for him to be going to her room in the middle of night (especially unclothed).\n\nNow if he came in her room and she had like coughing or something. That makes sense. But it takes less than ten seconds to throw on some boxers.\n\nI’m sorry, OP. 🥺.\nI’m praying for clarity and strength during the time.",
      "created_utc": 1732676157.0,
      "score": 3
    },
    {
      "id": "lz78cui",
      "body": "Between 5-15% of mothers are aware their child is being SA and allow it.",
      "created_utc": 1732685694.0,
      "score": 4
    },
    {
      "id": "lz3ovgi",
      "body": "Your sister is very fortunate to have someone like you in her corner. I’m so sorry, I can’t imagine how you feel but good on you for fiercely protecting her.",
      "created_utc": 1732641097.0,
      "score": 383
    },
    {
      "id": "lz4p0uc",
      "body": "Seconding what u/Gailgail6959 said here. When my father was caught red-handed, I was 5 and confused as all fuck, and my mother's first words to me were \"it's not your fault\". I can't tell you how helpful that was as I grew up. Your sister is very lucky to have you, thank you for taking care of her when it counts the most!",
      "created_utc": 1732652097.0,
      "score": 198
    },
    {
      "id": "lz4x6p7",
      "body": "This made me tear up as an adult who spent years in therapy. I would have been so lucky to have a brother like you on my side when my abuse happened. \n\nIf it does end up being abuse, just know that healing is possible. It will take time. But the support of you and your brothers will make a world of a difference.",
      "created_utc": 1732654613.0,
      "score": 66
    },
    {
      "id": "lz4oxgn",
      "body": "OP you’ve received great advice! I’d like to add, **write down everything.** Start now by writing out every detail of what happened, time and date. Keep documentation of everything. If it is immediately documented, you will have better memory of the details for evidence. You are her guardian angel right now! Please let us know what transpires with all of this.",
      "created_utc": 1732652068.0,
      "score": 105
    },
    {
      "id": "lz587b4",
      "body": "after reading a lot of these comments i want to update that i am unsure about the camera in the room but camera in the hallway is smart but you can’t get caught. also, i think not talking to your parents sounds really smart. talk to your sister and brothers but don’t talk to them. i think a professional needs to do that. i saw someone comment and say it could potentially mess up the case with CPS if you interrogate them which i think i agree with- it would also give them a chance to practice being questioned. \nif i was in your shoes i would chat with siblings, call cps, and be there when they come, ideally have your brothers there too. reminder im not a professional, im just an advocate- i’ve never worked with cps. \nalso prepare for what might happen when cps comes.\nalso i want to say- your siblings will probably be shocked and may react with anger and at first take dads side- this is normal and because they don’t want to believe its true, not because they don’t trust you. \nact fast and act today. i think you’ve gotten a lot of good advice at this point so just keep us updated and we can help you navigate the next steps. this is one of the times where reddit really can be helpful and save lives.",
      "created_utc": 1732658023.0,
      "score": 19
    },
    {
      "id": "lz3v9bj",
      "body": "i’m glad you have them to help you. you got this.",
      "created_utc": 1732643039.0,
      "score": 36
    },
    {
      "id": "lz5kx9d",
      "body": "Please update us",
      "created_utc": 1732662227.0,
      "score": 8
    },
    {
      "id": "lz56k98",
      "body": "If she's a deep sleeper I'd be hella concerned that she's being drugged into a deep sleep especially if your parents were walking into her room naked. Major red flags please give an update",
      "created_utc": 1732657514.0,
      "score": 210
    },
    {
      "id": "lz74mpt",
      "body": "please, is everything okay? are you both safe?",
      "created_utc": 1732683853.0,
      "score": 15
    },
    {
      "id": "lz3bdx2",
      "body": "Just remember you can’t protect her from jail",
      "created_utc": 1732636961.0,
      "score": 245
    },
    {
      "id": "lz3io9f",
      "body": "Just as another person has said ,you've got to be smart about it .All the best",
      "created_utc": 1732639203.0,
      "score": 62
    },
    {
      "id": "lz3kx1j",
      "body": "You have to, for her sake.  Let the authorities handle things.  That's their job.  Your job is to be there for her, and going to jail for domestic assault or worse isn't going to do her any favors.",
      "created_utc": 1732639885.0,
      "score": 47
    },
    {
      "id": "lz6zzgg",
      "body": "Protect that girl at all cost please. But do it in a smart way. Dont let anger take her out of your sight. Record shit. Get your brother on board.\n\nAfter any dust settles, please find appropriate therapy for her and you too.",
      "created_utc": 1732681733.0,
      "score": 14
    },
    {
      "id": "lzlrobe",
      "body": "I keep going back to his last comment in addition....",
      "created_utc": 1732909437.0,
      "score": 9
    },
    {
      "id": "lzolrab",
      "body": "Oh man.. there still isn’t any update! Or is there one!? I am so worried and scared for the kids. Ugh",
      "created_utc": 1732951616.0,
      "score": 6
    },
    {
      "id": "lz3hps9",
      "body": "If you talk to a family member, maybe one on your mother's side might be a safer bet too. It'll be more objective.\n\nI hope you can get some sleep tonight.",
      "created_utc": 1732638913.0,
      "score": 38
    },
    {
      "id": "lz3c6np",
      "body": "Exactly.",
      "created_utc": 1732637212.0,
      "score": 6
    },
    {
      "id": "lz39str",
      "body": "I mean I agree. But he will need evidence as well.",
      "created_utc": 1732636466.0,
      "score": 35
    },
    {
      "id": "lza4zay",
      "body": "Yeahhh kinda concerned it's been a full day now 😟",
      "created_utc": 1732732212.0,
      "score": 6
    },
    {
      "id": "lzjad1u",
      "body": "Me too",
      "created_utc": 1732870523.0,
      "score": 8
    },
    {
      "id": "m1pk9d3",
      "body": "Nah, I keep coming back to check. It’s intense!",
      "created_utc": 1734019759.0,
      "score": 8
    },
    {
      "id": "lz3ag8u",
      "body": "Thats good, that sounded traumatizing, im so sorry for whats happening to you guys",
      "created_utc": 1732636668.0,
      "score": 50
    },
    {
      "id": "lz3lix2",
      "body": "I’d be talking to grandparents - moms parents, not dads, and brother.",
      "created_utc": 1732640069.0,
      "score": 12
    },
    {
      "id": "lz4xabo",
      "body": "Right, and if you happen to be naked at the time you hear a concerning noise/need to check on your kid in the middle of the night— you don’t certainly don’t walk in fully naked and close the door behind you.",
      "created_utc": 1732654644.0,
      "score": 8
    },
    {
      "id": "m0ids4u",
      "body": "i really hope this is it.",
      "created_utc": 1733386903.0,
      "score": 14
    },
    {
      "id": "m0ids81",
      "body": "Or he’s killed his dad and been arrested. Or more likely the whole things fake and he’s scared how much it’s blown up…",
      "created_utc": 1733386905.0,
      "score": 24
    },
    {
      "id": "lz41oa6",
      "body": "Totally agree. Major red flags here.",
      "created_utc": 1732644964.0,
      "score": 9
    },
    {
      "id": "lz4kew9",
      "body": "Yeah and my first thought was mom and dad were bouta go at it but wanted to make sure the kid was sleeping so she wouldn’t hear them or something…kinda surprised,but at the same time not surprised, most comments are accusing the dad but i mean yeah who knows nowadays ig it’s crazy",
      "created_utc": 1732650678.0,
      "score": 6
    },
    {
      "id": "lzfeff3",
      "body": "He's in South Australia if anyone close has the ability to try to get local law enforcement involved. I put in a crimestoppers report online but I'm in the US and can't follow up on it.",
      "created_utc": 1732811978.0,
      "score": 6
    },
    {
      "id": "lz42slz",
      "body": "He’s going to say he walked into the wrong room and it’s going to be a complete LIE.  Grown men do NOT walk around the house from room to room naked.  He also turned to close the door, meaning he knew EXACTLY which room he was in …. NAKED, covering his junk.",
      "created_utc": 1732645302.0,
      "score": 169
    },
    {
      "id": "lz3yup6",
      "body": "It's good you're writing this down because they are going to try and gaslight you in the morning",
      "created_utc": 1732644109.0,
      "score": 97
    },
    {
      "id": "lz6b04e",
      "body": "Are you positive that he was just „covering“ himself?",
      "created_utc": 1732671870.0,
      "score": 29
    },
    {
      "id": "lz7ejsc",
      "body": "Wait, your mom was there?",
      "created_utc": 1732689006.0,
      "score": 23
    },
    {
      "id": "lz9hpy1",
      "body": "Does your father sleep in the nude by chance? The fact that he was covering himself up, and your mother was there, well it makes me wonder if they heard someone (you) going into your sister's room at 2am and were panicked themselves so they checked?\n\nWhat was the follow up?",
      "created_utc": 1732725045.0,
      "score": 15
    },
    {
      "id": "lz3kxr2",
      "body": "Yeah, unless your dad sleeps naked and sleep walks, I don't really see how this can be a misunderstanding.  Please talk to your brother ASAP.",
      "created_utc": 1732639890.0,
      "score": 2854
    },
    {
      "id": "lz4uzea",
      "body": "Don't just have a talk - CALL THE COPS. Get CPS involved, that is not ok, and it isn't a thing that just happens. This is a huge red flag. Like, need a crane to lift it red flag.",
      "created_utc": 1732653947.0,
      "score": 258
    },
    {
      "id": "lz3zmta",
      "body": "In a comment, he said his mum was next to dad when they came in and closed the door",
      "created_utc": 1732644348.0,
      "score": 67
    },
    {
      "id": "lz76aun",
      "body": "They need to talk to CPS with or without her cooperation and not give her a heads up just in case.",
      "created_utc": 1732684662.0,
      "score": 22
    },
    {
      "id": "lz7s4fg",
      "body": "I'm a father with 2 daughters and I can not foresee any circumstance where I would leave my room/ensuite naked let alone enter their room.\n\nThere is absolutely zero chance this was some kinda mistake. That man doesn't deserve to be a father.",
      "created_utc": 1732697392.0,
      "score": 75
    },
    {
      "id": "lz3rk5y",
      "body": "yes i’m still awake and it’s 4 in the morning. My plan is to tell my older brother as soon as he wakes up and see what decision he makes as he is much older and mature then me i trust that he will make the best decisions for my sisters safety",
      "created_utc": 1732641921.0,
      "score": 775
    },
    {
      "id": "lz5ckak",
      "body": "This! Honestly it’s better to overreact and put it on the radar than to ignore and you can’t go back to fix it.",
      "created_utc": 1732659409.0,
      "score": 18
    },
    {
      "id": "lz4l3bz",
      "body": "With all due respect, there is absolutely no scenario I could think of that could constitute this a “misunderstanding”.",
      "created_utc": 1732650885.0,
      "score": 83
    },
    {
      "id": "lz3gtof",
      "body": "might not have been safe. op needs sister and themselves to be safe first.",
      "created_utc": 1732638639.0,
      "score": 91
    },
    {
      "id": "lz37wjr",
      "body": "yeah that will be the next step fml",
      "created_utc": 1732635868.0,
      "score": 2170
    },
    {
      "id": "lz4ph00",
      "body": "Best advice",
      "created_utc": 1732652238.0,
      "score": 14
    },
    {
      "id": "lz3d67f",
      "body": "Also a parent. Also have had this realization after I got out of the shower and was about to settle in bed. Still put on sweatpants before going to check.\n\nIf this was the situation for OP's father, I don't think he'd have walked out without saying a word.",
      "created_utc": 1732637518.0,
      "score": 169
    },
    {
      "id": "lz3lp8s",
      "body": "I think it’s totally normal for parents to check on their kids in the middle of the night…\n\nBut, he mentioned that his dad entered the room, closed the door behind him, and then left as soon as he saw his son. \n\nThat shit isn’t normal.",
      "created_utc": 1732640123.0,
      "score": 100
    },
    {
      "id": "lz3feaz",
      "body": "i totally understand this thinking but i think 8 is way too old to go in unclothed and shut the door. i think anything beyond a baby is too old. i can understand a desperate sleep training parent but this is an 8 year old. putting on sweatpants is easy, you know? but i understand why you’re hoping that’s the case",
      "created_utc": 1732638205.0,
      "score": 64
    },
    {
      "id": "lz3grm7",
      "body": "Never.  Never have I left the bedroom (even to pee) without clothes on.  I don’t parade around the house naked in front of young children.  I am constantly aware of my situations with my children and although it sucks, I draw lines to prevent even the APPEARANCE of any misdeeds.  No, there is no mistaking what this was.",
      "created_utc": 1732638622.0,
      "score": 20
    },
    {
      "id": "lz62bkj",
      "body": "My mum used to walk around naked if she got up in the night. She slept naked most of the time and had zero issues with her body and was very comfortable about it. If we went on holidays she’d always sunbathe topless. We thought nothing of it.\n\nShe is a very carefree person and lacked some boundaries when we were growing up. I remember her once waking my older brother (about 18 at the time) in the morning when his alarm had been going off for a very long time. She just stormed in there naked and told him to get up and turned his alarm off and went back to bed. He was mortified. I know it’s not usual and he would have preferred not to have seen it but my mum just didn’t think of nudity as a problem. \n\nAs an adult I can realise that it was borderline inappropriate at times but mostly harmless. She in no way was abusive with me or any of my siblings. I just don’t think she thought of her body like that. She’s free spirted. \n\nMy dad however did not walk around naked. When I was very young I can remember walking in on him nude and although he immediately got dressed he did not make me feel concerned about his nudity. He would occasionally go to the bathroom in his underwear sometimes but he wouldn’t enter our rooms undressed. Ever. \n\nWe were a comfortable family growing up and nudity wasn’t really something that alarmed us. They’re only bodies and it’s only weird if you make it weird. \n\nHowever \n\nOP knows his parents best so if it’s very unlikely for his parents to act in this way or be seen undressed I guess that should be alarming to him. This is such a difficult situation to assess. Go with your gut. \n\nIf OPs dad was just checking on his daughter and happened to be naked, maybe he slept naked that night, had just got out shower or he’d been up to it with mum. Those questions need to be asked? I still find it strange he didn’t acknowledge or address it with OP - apologise or laugh it off? Unless he just felt so awkward and embarrassed? It’s an incredibly uncomfortable situation. But it really depends on how this family interact with each other, how open they are and how they address nudity. I hope it is no darker than this and just a mere misunderstanding. \n\nI in no way am minimising this situation, but reminding of complicated family dynamics or uncommon behaviour that does still occur. Before going in with all guns blazing attitude. Keep a level head. It’s easy for an outsider to point the finger and opt with the most dramatic outcome. You know your family you know what is or isn’t normal. If your dad is not a free spirited person and you never seen him wandering round with his butt out this is alarming for sure. \n\nIs his bedroom door next to hers? Is it at all possible he mistook the rooms? Half asleep wandered into the wrong room?\n\nThere’s some really good advice on this thread tho. Speak with your sister in a non judgmental way. Listen to her and be mindful of your reactions. Do not leave her alone with him u til you feel safe again. Rally your siblings and maybe an auntie or uncle? Be cautious and like I said trust your gut. \n\nPlease keep us updated 💞",
      "created_utc": 1732668621.0,
      "score": 6
    },
    {
      "id": "lz7czft",
      "body": "OP is a great brother! When I told my brother his 30 year old friend SA’d me repeatedly when I was 15, he asked me if I REALLY needed to go to the cops. \n\nOP if you see this make sure your brothers help, you can’t do it alone, involve adults, do not let your sister be alone with him",
      "created_utc": 1732688135.0,
      "score": 50
    },
    {
      "id": "lz8c0m3",
      "body": "Yes. I realised as an adult that the jokes about moving me, making me talk and being around me as a very deep sleeper were actually confessions. As a result I can now only sleep sitting on the sofa and when I get in my bed, I can only sleep an hour before waking up panicked. I also can’t sleep naked or in my underwear because the panic keeps me awake.",
      "created_utc": 1732709699.0,
      "score": 28
    },
    {
      "id": "lzoo8hl",
      "body": "no update :( no posts or comments for 3 days. i’m worried too. i hope they’re just sorting things out privately & will come back soon🤞🏻",
      "created_utc": 1732953220.0,
      "score": 9
    },
    {
      "id": "lz3pomb",
      "body": "The mom was with the dad according to another reply by OP…",
      "created_utc": 1732641346.0,
      "score": 16
    },
    {
      "id": "lz4mjs6",
      "body": "Right? Perhaps the brother being in the room threw them for a loop.",
      "created_utc": 1732651331.0,
      "score": 7
    },
    {
      "id": "lz590md",
      "body": "I had thought the same until I reread the part where the dad came into the room and closed the door behind him. \n\n  \nThe most extreme conclusion is often the most unlikely but that bit is pretty suss",
      "created_utc": 1732658276.0,
      "score": 5
    },
    {
      "id": "lz44mn0",
      "body": "If he was sleepwalking, seeing OP wouldn’t have caused him to hurry and leave necessarily. He knew he was doing something wrong. I’m so sorry OP, thank you for protecting your little sister.",
      "created_utc": 1732645856.0,
      "score": 2229
    },
    {
      "id": "lz4bd8d",
      "body": "Also, I'm pretty sure but not positive,  but if he was legitimately sleep walking, I don't think his brain would be functioning at a high enough level of environmental awareness to notice you in the room, only to then turn around and exit like that.  Not an expert in psychology or behavior or mental health at all, by any means, but using sleep walking as an excuse just seems really out of the realm of possibility.  If I were you, I'd make sure to thoroughly research the topic, so you're armed and ready with truth, in case he does attempt to claim he was sleep walking as a defense.\n\nEdit for spelling and some easier reading, also:\n\nAdd:  wanted to add that the comment regarding going to bed clothed,  then self-nekkiding sounds absolutely bonkers.  Lastly, as I understand it, it's a long term pattern of behavior.  To have it all of a sudden start showing without any other concurrent symptoms, occurrences, or diagnoses recdntly or in the past is kinda bonkers.  Especially when you're talking nudity, minors, and the sudden \"OPE! Uh oh!\"  reaction.   \n\nYour sister deserves to feel safe, happy, and secure  in her room, while sleeping,  in her own  home.  Unfortunately , your dad has stripped her of that and lord only knows how much damage and destruction he has already done --- and this is is a fact that can be neither forgotten or forgiven.",
      "created_utc": 1732647901.0,
      "score": 438
    },
    {
      "id": "lz4lkxl",
      "body": "I used to sleepwalking. I would have full on conversations with people, clean the house, make plans for the next day (and not remember them), and sometimes I would bake goodies!\n\nBut i wouldnt notice things out of place. Like if i saw someone, i would say hi, but not think anything of them being there at 2 am. I don't think that is what dad was doing. He knew his son being there meant he should leave!",
      "created_utc": 1732651034.0,
      "score": 217
    },
    {
      "id": "lz3trjh",
      "body": "And tbh if he does sleepwalk, he shouldn’t be sleeping naked!",
      "created_utc": 1732642591.0,
      "score": 291
    },
    {
      "id": "lz41bk1",
      "body": "If he was sleep walking he wouldn't have left the room like that",
      "created_utc": 1732644857.0,
      "score": 122
    },
    {
      "id": "lz4o2ln",
      "body": "WTF??? The mom was coming in too??? Call CPS. Get this baby out of there. 😭",
      "created_utc": 1732651801.0,
      "score": 143
    },
    {
      "id": "lz3upu6",
      "body": "Don’t leave her alone in her room.",
      "created_utc": 1732642877.0,
      "score": 656
    },
    {
      "id": "lz4dsg0",
      "body": "Please do the right thing here. Your older brother wasn’t there and he may try and downplay it. People do that because it’s uncomfortable and hard to stand up to someone in any kind of situation like this. But especially when it’s someone you love. Never, ever leave your sister alone again for your dad to prey upon her.",
      "created_utc": 1732648645.0,
      "score": 223
    },
    {
      "id": "lz591zu",
      "body": "Many times--in fact, unfortunately--people go straight into denial when faced with a horrific truth such as this. You saw what you saw, and your brother may go into denial mode and make excuses, minimize it, or even get angry with you and claim that it's your fault. \n\n*You saw what you saw.* \n\nNo matter what anyone else says yoh *must* report this, to her pediatrician, to the police, to a teacher at school, or you can call CPS yourself. Just keep telling mandated reporters until some adult(s) take you seriously, no matter how angry anyone on the family gets. \n\nAlso, do not attempt to interview your sister about it right now. Let professionals do this, or whatever she says may not be admissible. \n\nIf she voluntarily mentions it, just listen and afterwards, write down whatever she says as accurately as you can.",
      "created_utc": 1732658288.0,
      "score": 144
    },
    {
      "id": "lz3uxpd",
      "body": "Has your sister been withdrawn at all? Not her usual self? Is she having behaviour problems at home or school? Acting out? Anything that isn’t normal for her?",
      "created_utc": 1732642942.0,
      "score": 271
    },
    {
      "id": "lz3vlo4",
      "body": "Yikes are you in Australia?? It’s the same time for me.",
      "created_utc": 1732643143.0,
      "score": 112
    },
    {
      "id": "lz4eaot",
      "body": "If he blows it off, then you need to take it on. Talk to cps, other family members, etc. Don't let brother talk you out of it just because he's \"older and more mature\"",
      "created_utc": 1732648799.0,
      "score": 67
    },
    {
      "id": "lz5nrv3",
      "body": "No, forget your brother. Tell an adult that isn't a family member. A teacher, a counselor, a police officer.",
      "created_utc": 1732663243.0,
      "score": 27
    },
    {
      "id": "lz41vsu",
      "body": "Don't just listen to him, he didn't see the situation.  If he doesn't take it seriously you need to call CPS or at the very least tell your mom.  \n\nI'd plan on sleeping on her floor from now on.  \n\nMaybe consider putting a hidden camera in the room if they don't take it seriously and if you get evidence, call the police.",
      "created_utc": 1732645027.0,
      "score": 188
    },
    {
      "id": "lz4wk89",
      "body": "please know that you are doing a great job trying to protect your sister right now and she will be very greatful to have you as an older brother. you’re doing everything right and it’s going to be okay no matter what the outcome is.",
      "created_utc": 1732654421.0,
      "score": 21
    },
    {
      "id": "lz67gcz",
      "body": "Please sleep in your sister’s room, or her in yours, until this is figured out. Make it sound like a fun sleep over or something",
      "created_utc": 1732670547.0,
      "score": 22
    },
    {
      "id": "lz4zw0i",
      "body": "Pleas also consider taking your sister to a child counseling professional. They will be able to approach the topic in a qualified manner. This also may be a critical part in discovering the truth. I wish you the best of luck. Please know that there are many support mechanisms for people in you and your families positions.",
      "created_utc": 1732655445.0,
      "score": 13
    },
    {
      "id": "lz4uuoh",
      "body": "I completely agree.",
      "created_utc": 1732653907.0,
      "score": 18
    },
    {
      "id": "lz3a1pc",
      "body": "Record the conversation so that later when calm can listen to it. Also ask sister if mom and or dad ever come in when we is sleeping.",
      "created_utc": 1732636543.0,
      "score": 1437
    },
    {
      "id": "lz3axi5",
      "body": "there honestly is no explanation that makes sense. you’re gonna want their answer to be true but it is your job now to protect her and get the right people involved. also, talk to her gently about it. before you talk to them so she has the opportunity to explain it to you before there’s a big fight between you and your parents. talk to her about it in a non-judgement way so she doesn’t feel like she’s broken any rules if something bad is happening. say things like “hey, i’m just curious, is this something that happens a lot?” instead of “hey are you okay what’s going on with dad coming in here”\n\nshe needs to feel safe talking to you. unfortunately like i said, i don’t there is any explanation for this that is acceptable. you will need to contact other family members and maybe get the police involved at some point. \n\ni’m sorry you saw this and im sorry your sister potentially sees this a lot",
      "created_utc": 1732636818.0,
      "score": 573
    },
    {
      "id": "lz3f8qc",
      "body": "As a kid who was abused in my family did nothing, thank you for caring. You may save her.",
      "created_utc": 1732638159.0,
      "score": 60
    },
    {
      "id": "lz4fzme",
      "body": "A teenage boy cannot put a camera in his little sister’s bedroom. How about the hallway?",
      "created_utc": 1732649316.0,
      "score": 40
    },
    {
      "id": "lz4iynd",
      "body": "DO NOT DO THIS. Instead, place a camera right outside of the room. If you place it inside, your parents might try to flip this on you",
      "created_utc": 1732650235.0,
      "score": 63
    },
    {
      "id": "lz3hsrx",
      "body": "Even if their explanation makes sense, do this. Honestly I don't think I would say anything to anyone just yet. I would just go ahead and get some surveillance going and see with my eyes what's going on. If you confront them then they might lay low for a bit until it blows over. OR they'll be overly confident in their lie (if it's a lie, that can't be known just yet) and continue on like they shook you. Just don't want to show your hand so early, it forces you into a box. And if you start mentioning this to family members and you're wrong then that's not a good look because to believe this even 1% part of you has to think your parents are capable of this sort of thing.\n\nSome people are good at lying. Some people are *really* good at lying. Don't rely strictly on your experience with them. If this has been happening then they've been lying to you the entire time and you haven't found out. You lack experience in this sort of thing (I'm assuming you're pretty young) and the mind is a strong beast that can hide things from you. Or other innocent behaviors can be misinterpreted. But raw camera footage can't lie. \n\nYou can use an old phone as a remote camera that notifies you when there's motion. If you go that route you can prevent it from happening again instead of having to rely on getting the footage the next day after the fact. But prepare yourself, when backed into a corner humans can do some stupid and surprising shit. Have your phone ready to call someone in the event this takes a darker turn. I would even recommend making that call before you confront anyone, and then remain not confronting anyone. Let the professionals do their job. **IF** (still a big if) this does end up being what it sounds like then that means your parents are okay with doing that to one of their children, meaning they are probably okay with other transgressions. Fuck it, I'll spell it out. If you confront them you may get attacked. idk if I would call it likely but it's definitely possible. You're playing with fire now, be careful. Be smart.\n\nedit: also if anyone walks in holding a phone like they're taking a photo of the room, that means they know about the IR light trick to detect hidden cameras. That's a pretty damning action. So keep an eye out for that.",
      "created_utc": 1732638939.0,
      "score": 41
    },
    {
      "id": "lz4nq4c",
      "body": "RECORD THE CONVERSATION for your safety and your sisters.",
      "created_utc": 1732651694.0,
      "score": 20
    },
    {
      "id": "lz4lvlf",
      "body": "Record the convo when you talk to them secretly. Open your phone, hit the record button in the voice memo section, and put it in your pocket so they don’t see. Do this DISCREETLY. But RECORD IT. even if this turns out to somehow be a misunderstanding, you’ll be glad you did this.\n\nStick to your guns, but let them do the talking. You want them to say too much in the case that something actually nefarious is occurring. Try to remain neutral. It’s hard. But if you come across as too panicked they may try harder to lie and dismiss you.\n\nGoing to your brother is a good idea but if he tries to downplay it, that doesn’t mean everything’s fine automatically. I’m 27, so around your brothers age. He wasn’t there so he’s not going to have the same experience as you. Please keep an eye out no matter what anyone says and record as much as you can.",
      "created_utc": 1732651125.0,
      "score": 28
    },
    {
      "id": "lz53vhq",
      "body": "Hiding a camera in your child sisters room is a very dangerous idea for you",
      "created_utc": 1732656673.0,
      "score": 7
    },
    {
      "id": "lz5l2me",
      "body": "hey, other commenters pointed this out too but PLEASE do NOT put a camera in her room. you will end up with child pornography charges if it’s what it seems like (and there’s not an explanation that makes this ok)",
      "created_utc": 1732662279.0,
      "score": 5
    },
    {
      "id": "lz3l1i0",
      "body": "The not saying a word part is super strange. As a parent, I could see the scenario where I could MAYBE be undressed and have been concerned enough about a noise to go investigate in a rush, but once I realized it was brother, I would have had some questions of my own, or at least felt a need to explain myself.",
      "created_utc": 1732639923.0,
      "score": 78
    },
    {
      "id": "lz4dj3p",
      "body": "It's the closing the door for me.\n\nIdk where OP is in Australia, but where I am, it's disgustingly humid. I think many folks are walking around their homes naked.\n\nBut the door... Yeah, that's pretty damning imo.",
      "created_utc": 1732648564.0,
      "score": 53
    },
    {
      "id": "lz3k2jc",
      "body": "Yeah, him closing the door is giving me pause as well. It's just... It doesn't fully track with what I'm saying, you know? \n\nBut the mother seemingly being aware of this adds a really weird dimension to the analysis. It makes an innocent explanation more plausible, but it makes a creepy explanation much creepier. It's (sadly) pretty common to hear about predatory dads, but predatory moms? I would think that would be comparatively much rarer. Maybe she's complicit in some way, like out of fear? This can go to a lot of really dark places very fast.",
      "created_utc": 1732639629.0,
      "score": 73
    },
    {
      "id": "lz3izkr",
      "body": "I agree. I know some families that are very comfortable with nudity in a purely innocent way. However, children don’t always understand what is acceptable versus what isn’t acceptable so I think it’s better to air on the side of caution with nudity. I want my kids to know that bodies are nothing to be ashamed of but that there are some things that aren’t appropriate because too much openness in that particular area can blur the lines for children & possibly make them more susceptible to abuse. I bathe with my two-year-old son because it makes things much easier but I feel like I’ll need to cut that off soon. I don’t want him having memories of what I look like nude.",
      "created_utc": 1732639298.0,
      "score": 21
    },
    {
      "id": "lz47wb7",
      "body": "Eh, depends on your culture.\n\nNudity isn’t as big of a deal in some places.",
      "created_utc": 1732646844.0,
      "score": 10
    },
    {
      "id": "lz7sndq",
      "body": "My step father in law molested a child in the family, was convicted of it but got to stay married to mother in law because “he was sleep walking”. It went on for years but “he’s a sleepwalker” so I don’t buy the sleepwalking shit for a minute \nOP- protect your sister please",
      "created_utc": 1732697746.0,
      "score": 349
    },
    {
      "id": "lz4cgok",
      "body": "Also, if he knows he is a sleep walker, he wouldn't sleep naked, especially with having young children.",
      "created_utc": 1732648239.0,
      "score": 248
    },
    {
      "id": "lz5x89s",
      "body": "I will say, and this is not me condoning this behavior. The self nakeding thing has happened to me a few times. But I don’t sleep walk when this happens. I do and have slept walked and even tho I can find my bed on my own, i don’t just stop abruptly when walking in a room. Someone has to tell me to go back to bed",
      "created_utc": 1732666725.0,
      "score": 11
    },
    {
      "id": "lz5pgb3",
      "body": "This is such a wholesome comment in a nightmare thread. Thank you for sharing ❤️",
      "created_utc": 1732663856.0,
      "score": 54
    },
    {
      "id": "lz4mrwl",
      "body": "Yeah, maybe in his sleep walking, he was checking on his daughter ( which most parents do), but he was naked, which if he knows he's a sleep walker, he wouldn't sleep naked. \n\nHopefully, OP gives an update.",
      "created_utc": 1732651401.0,
      "score": 9
    },
    {
      "id": "lz46xkm",
      "body": "I know",
      "created_utc": 1732646552.0,
      "score": 14
    },
    {
      "id": "lz8arze",
      "body": "I agree. Talk to a trusted adult at school. Possibly go to the police. Your sister needs to be heard.",
      "created_utc": 1732709065.0,
      "score": 12
    },
    {
      "id": "lzc3qtp",
      "body": "I experienced CSA from who-knows until I was 10. I was a straight-A student,  star piano pupil, winning lots of awards for music, started learning bassoon, science camp, music camp, there was no “indicators” what was going on at home in me behaviorally. I honestly think my music and academics kept me from losing my mind and gave me something to work towards to get out of that someday.",
      "created_utc": 1732756015.0,
      "score": 8
    },
    {
      "id": "lz7wru4",
      "body": "Girls who are sexually abused tend to become star pupils & behave like perfect angels, while boys who are sexually abused tend to act out aggressively.",
      "created_utc": 1732700500.0,
      "score": 34
    },
    {
      "id": "lz3z4md",
      "body": "yes. Australia",
      "created_utc": 1732644194.0,
      "score": 174
    },
    {
      "id": "lz5t5os",
      "body": "This post is one of the most terrifying and in 60 words or less. \n\nHoping against hope for a positive outcome. \n\nWishing you peace and sanity in your life",
      "created_utc": 1732665216.0,
      "score": 70
    },
    {
      "id": "lz4td1k",
      "body": "DO NOT put a hidden camera in her room! That's a sure fire way for OP to get child pornography charges on him if the parents find it or even OP uses it as evidence because it will catch her changing her clothes and being in various states of undress. \n\nOP needs to call CPS. He shouldn't even have to go to his brother he needs to call CPS so they can deal with the matter. His brother didn't see anything, and 25 year olds can make piss poor decisions too. He's got a huge amount of strangers telling him their experiences with CSA and the urgency in which he should call and OP is adamant...about talking to his brother.",
      "created_utc": 1732653449.0,
      "score": 132
    },
    {
      "id": "lz972z1",
      "body": "Don’t ask your sister this- get a trained professional to do it. If you speak to her first it could invalidate anything she says to a professional.",
      "created_utc": 1732721692.0,
      "score": 126
    },
    {
      "id": "lz3cbzo",
      "body": "i’m quite an observant person and i can tell when people close to me act different around others and i often see my sister and dad together and she seems super comfortable with him so i hope so bad this is a misunderstanding. i’ll still have a talk with her",
      "created_utc": 1732637257.0,
      "score": 626
    },
    {
      "id": "lz3yhgq",
      "body": "Yes, the fact that there was zero interaction, questioning or explanation for why everyone just happened to be in the sisters room and one parent was butt naked too, is just truly weird and awkward, to allow the awkward situation to go without anyone addressing the clear red flags. The mother also being present but didn’t say a word at all either. The parents definitely behaved extremely suspicious and out of character for parents that supposedly are out checking on their child out of concern and care. As there was zero signs of care by their behaviour once they had a witness to their actions.",
      "created_utc": 1732643999.0,
      "score": 40
    },
    {
      "id": "lz4e3sg",
      "body": "My mother was fully aware that my brother was raping me. She did nothing - unless you count punishing *me* for it. She also used to enjoy standing by and watching as my father beat my sister (usually at my mother’s insistence). Just because the mom was there doesn’t mean something awful wasn’t about to happen. Many mothers/wives have been complicit - or even active participants - in child abuse.",
      "created_utc": 1732648741.0,
      "score": 53
    },
    {
      "id": "lz3zek4",
      "body": "Exactly, if the mum was there fully clothed wouldn’t it be more appropriate and logical she be the person to come in to check and not the naked dad? It’s not like he was only the one parent that was up so he had to go check on the sister, it’s so odd that the mother was there too, but was happy to allow her husband to go in naked, close the door behind him just to check on their daughter! \nTruly major red flags.",
      "created_utc": 1732644278.0,
      "score": 36
    },
    {
      "id": "lz456kd",
      "body": "Unfortunately in cases of abusive fathers, it’s not uncommon for mothers to just standby them. \n\nThey don’t want to shake up their lives, admit they chose a predator, maybe it happened to them too and no one intervened so why should they? It’s so normalized, even at the expense of their own children.",
      "created_utc": 1732646023.0,
      "score": 30
    },
    {
      "id": "lz9zwvp",
      "body": "If you know you sleepwalk, you don’t sleep naked and lock your damn door. wtf.",
      "created_utc": 1732730649.0,
      "score": 68
    },
    {
      "id": "lz4v52v",
      "body": "Okay but to be fair I've seen someone sleep walk, went out the house for a stroll, and somehow came back naked...",
      "created_utc": 1732653994.0,
      "score": 72
    },
    {
      "id": "lz4tzl6",
      "body": "Besides, everyone in the house would know he's a sleepwalker!",
      "created_utc": 1732653642.0,
      "score": 17
    },
    {
      "id": "lzc5t7e",
      "body": "I’m so sorry to hear that. I was between 3 and 4 years old. According to family before it happened I was an outgoing happy little girl. After I was very withdrawn, acting out ect. I think it affects us all in different ways. I’ve not had any update from OP so I’m hoping police and cps have been called and they’ve not just confronted their dad, who will lie to save his own skin. Sending you a massive hug flower.",
      "created_utc": 1732756808.0,
      "score": 8
    },
    {
      "id": "lz94ynd",
      "body": "This is not exactly true. There’s several ways they can act as a result of abuse. There’s no certain or main way they tend to act based on their gender. It varies with each child and what I’ve heard from parents or those who work with abused children is to look at *any* noticeably sudden changes in them, because it can be anything from showing regression to perfectionism, from being withdrawn to being more clingy, being more timid to being more aggressive, being more fearful to not seeming afraid of their abuser (because they were conditioned to think it’s normal) etc.",
      "created_utc": 1732721002.0,
      "score": 20
    },
    {
      "id": "lz8ornq",
      "body": "Not always",
      "created_utc": 1732715237.0,
      "score": 12
    },
    {
      "id": "lz43mpf",
      "body": "Please report it. Even if it’s nothing it is better safe than sorry!!! And do not leave your sister’s side!!!",
      "created_utc": 1732645558.0,
      "score": 179
    },
    {
      "id": "lz6mef7",
      "body": "OP, if you need help with your next steps let us know. I am so sorry, this is awful for you all but the best you can do now is to make a plan and keep progressing with it. Just keep one foot in front of the other. It’s shit your so young yourself but you can do this, you’re the best big brother\n\nEdit: you can also call the child protection hotline 13 21 11 they are all very lovely and have handled calls I have made, and assisted others to make, very well. It’s scary to take the first step but you can do this\n\nEdit 2 as I typed the 2 and 1 backwards. The Child protection hotline is a national hotline for all of Australia, any member of the public can call this line if you are concerned and all mandatory reporters should already have this memorised. For anyone else reading this, if you are ever unsure, you can use the MRG decision tree, Mandatory Reporting Guide, this is a tool to help identify your next steps as a mandatory reporter or concerned member of the public.\n\nEdit 3: I’ve been seeing people in some comments sharing their own experiences with CSA \n- OP, please do your best to avoid these. Save your brain capacity for you and your family and keep physical notes somewhere like a notebook and date it. \n- EVERYONE ELSE - please refrain from sharing details of other CSA incidents, it is crucial OP is not influenced and also not further traumatised. The brain is very good at combining things and creating horrific thoughts and potentially warping memories.",
      "created_utc": 1732676213.0,
      "score": 80
    },
    {
      "id": "lz54gr6",
      "body": "Oh mate. I’m so sorry, this is an awful situation. But your brother may not know what to do. It’s really for the best if you tell your mum and if she doesn’t believe it tell a teacher at school. I’m sorry this is a terrible burden for you but you but someone has to protect your little sister. You saw it. You know.",
      "created_utc": 1732656861.0,
      "score": 82
    },
    {
      "id": "lz545e7",
      "body": "Please, mate, call the police right now. You can’t risk waiting for your brother to do something; you have to keep your father away from your sister.",
      "created_utc": 1732656761.0,
      "score": 66
    },
    {
      "id": "lz63okq",
      "body": "Any update mate?",
      "created_utc": 1732669133.0,
      "score": 20
    },
    {
      "id": "lzapktn",
      "body": "Update OP? Are you and your sister ok?",
      "created_utc": 1732738654.0,
      "score": 9
    },
    {
      "id": "lz9pr9r",
      "body": "came back to check on you and your sis. hope your older brother helped you guys. 😪",
      "created_utc": 1732727523.0,
      "score": 9
    },
    {
      "id": "lz89wzr",
      "body": "Any updates?",
      "created_utc": 1732708613.0,
      "score": 7
    },
    {
      "id": "lz8kg85",
      "body": "Do you have an update please?",
      "created_utc": 1732713524.0,
      "score": 6
    },
    {
      "id": "lz3cu7u",
      "body": "Sometimes, with CSA the kids are so used to it they feel like it’s just normal so they do not act scared or repulsed by the perpetrators.",
      "created_utc": 1732637414.0,
      "score": 692
    },
    {
      "id": "lz3dy0j",
      "body": "i totally trust that you are observant and know your family, it is important to keep in mind though that child abuse, especially sexual (i’m so sorry you have to even think about this) isn’t always gonna be obvious in day to day behavior. especially with young children who don’t understand sex and boundaries. i totally understand why you want to believe everything is okay and i do too!! but relying on how things look from the outside isn’t the best in this kind of situation even tho, i fully believe you know your family and are a very observant person. dynamics between abusers and their victim don’t always look the way we would expect them too. \npeople in my life were so close, best friends with their abusers. the mind is a tricky thing, victims often gaslight themselves or convince themselves they are the problem- or something even feel special because of the attention their getting. \n\nit’s all very complicated and way tooo deep for me to even feel equipped to explain but i need you to dig into this situation for your baby sister. don’t believe what is easy believe. you’re a great big brother. you can handle this.",
      "created_utc": 1732637761.0,
      "score": 151
    },
    {
      "id": "lz3n265",
      "body": "Hi, I was abused between 5-7 yrs old (perhaps younger) by a college boy at the church I was raised in and saw him as my best friend. Having flashbacks when I was older made me realize the horrific things I was subjected to which I had no concept of at that age - I didn’t even have words to describe what it was except that it was “a secret.” Please take this extremely seriously, as sexual abuse when exposed to children can be masked as play.",
      "created_utc": 1732640535.0,
      "score": 143
    },
    {
      "id": "lz3fgca",
      "body": "If something is happening, it is possible she has been groomed to the point where she doesn’t understand that it is abnormal. That’s what groomers do. They try to normalize their sexual behavior with children so that the children won’t tell.\n\nI was very close to my stepdad before I finally admitted something was happening:",
      "created_utc": 1732638222.0,
      "score": 49
    },
    {
      "id": "lz3dcdl",
      "body": "She's so young she might not know what is happening is wrong.",
      "created_utc": 1732637572.0,
      "score": 97
    },
    {
      "id": "lz3gwnz",
      "body": "It could also be because she is used to certain behaviors from him. She could have been groomed. No grown people who are naked should be going into a child’s room and if the intention was pure, they wouldn’t have immediately left without saying anything. Watch that baby like a hawk.",
      "created_utc": 1732638665.0,
      "score": 36
    },
    {
      "id": "lz3qrcg",
      "body": "This is part of what makes CSA so horrific. The kid trusts the adult and thinks it's a fun game or whatever and is plagued by shame once they get old enough to learn.",
      "created_utc": 1732641677.0,
      "score": 20
    },
    {
      "id": "lz5d1xn",
      "body": "Grooming takes care of that, though. “I really love you, and when people love each other, they want to make each other feel good.” If a child is told that enough, they believe their abuse is all about love. They love their abuser. Even in circumstances when they feel kinda iffy about the abuse, they can still love their abuser. \n\nI feel like I’m pretty good at picking up on things, too, but I would NEVER make the assumption that abuse isn’t happening solely based on if I’ve noticed a subtle change or not. There’s a lot here that is super fucking concerning, and it screams interfamilial sexual abuse. Protect your sister.",
      "created_utc": 1732659569.0,
      "score": 10
    },
    {
      "id": "lz4reoa",
      "body": "People close said that about myself and my bio dad and he was raping me from 6-10. I didn't even have the faculties to explain what was happening and even assumed it happened to all little girls. I'm sorry, but this is not something to trust your gut on.",
      "created_utc": 1732652845.0,
      "score": 7
    },
    {
      "id": "lza46e9",
      "body": "I’d chain myself to the damn bed before I let myself “sleepwalk” naked into a kids room",
      "created_utc": 1732731963.0,
      "score": 63
    },
    {
      "id": "lzb84e6",
      "body": "We sleep naked, but we live alone (just husband and I), but obviously that will change when we have kids. Also, when I sleepwalk it's always to the fridge. The amount of times I've came to naked gremlin hunching over a bag of cheese to my husband quietly laughing at me is more than I care to admit 😅 Sleepwalking mind wants what the waking mind wants. Thank God I'm just a fatty when I'm awake or asleep.",
      "created_utc": 1732744498.0,
      "score": 5
    },
    {
      "id": "lz8918y",
      "body": "Yeah sleep walking is weird. Our upstairs neighbour sleep walking fell over her balcony and landed in our courtyard. She was naked too. Just awful. \n\nObviously very injured but survived with broken bones.",
      "created_utc": 1732708141.0,
      "score": 19
    },
    {
      "id": "lz4uosc",
      "body": "I would think so, too.  I'm curious if OP noticed if his dad was acting differently today.",
      "created_utc": 1732653857.0,
      "score": 7
    },
    {
      "id": "lz81na7",
      "body": "I honestly I think moms are worse sometimes. Close their eyes because they don’t want to believe it’s true. Tell your mom but then involve whatever Aus’ version of CPS is",
      "created_utc": 1732703689.0,
      "score": 33
    },
    {
      "id": "lz4rru3",
      "body": "When it was happening to me at her age I just assumed it was a normal thing I didn't like but didn't understand it was even wrong.",
      "created_utc": 1732652958.0,
      "score": 153
    },
    {
      "id": "lz3g2f4",
      "body": "Agreed, especially during the grooming stages. i.e - cuddling seems like such an innocent thing...but, as adults, we know that something is wrong when an adult goes into a bedroom at night to cuddle naked with a child. And the added context of a closed door, then quickly leaving when there's a witness, adds further suspicion.",
      "created_utc": 1732638409.0,
      "score": 286
    },
    {
      "id": "lz6q2x1",
      "body": "Yeah, unfortunately, they fuck our minds so much that we believe they are safe for us. It's so fucked.",
      "created_utc": 1732677634.0,
      "score": 15
    },
    {
      "id": "lz3f6pr",
      "body": "yeah i need to know that my sister is 100% safe. I’ll definitely start digging into this tomorrow, i doubt i’ll get any sleep until then i’m really shaken up. Thank you for your help and information i really appreciate it",
      "created_utc": 1732638141.0,
      "score": 314
    },
    {
      "id": "lz3eyfe",
      "body": "i also want to add that now your parents have the opportunity to come up with some explanation for this. before you talk to them and they might be counting on you to want this to blow over and say nothing which honestly would be totally understandable. hang in there and if you have any questions,keep asking.  i’ll keep an eye on this thread, i have experience getting children help and away from abusers but it’s not my profession- i’m hoping someone with pro experience can help guide you. very proud of you.",
      "created_utc": 1732638071.0,
      "score": 60
    },
    {
      "id": "lz3qrf7",
      "body": "i’m so sorry you experienced that i can’t imagine how that must have felt as i feel sick right down to my very core right now. As long as i’m alive i’ll do everything possible to make sure my sister is safe",
      "created_utc": 1732641677.0,
      "score": 242
    },
    {
      "id": "lz3ho51",
      "body": "exactly. i’m so sorry this happened to you.",
      "created_utc": 1732638899.0,
      "score": 12
    },
    {
      "id": "lz6izm8",
      "body": "Be honest with yourself!  What could that ‘misunderstanding’ possibly be?  Can you imagine any situation where this is ok?  Try really hard to come up with an answer; I’m very sure you’ll realize there is NO ACCEPTABLE ANSWER for this act. Get off Reddit and call the cops now.  Let your parents answer to them. \n\nI realize this is a life changing situation.  But that’s on them. It is YOUR moral obligation to protect your sister, urgently. Better to be mistaken than harbor the slightest possibility that she is being sexually abused. And don’t guilt yourself or allow your parents or anyone else guilt you for doing the right thing.  Call the cops now.",
      "created_utc": 1732674907.0,
      "score": 6
    },
    {
      "id": "lz6as3b",
      "body": "I'm curious about what op and big bro did to handle this! And why mom walked right by!!\n\nPoor Lil girl!",
      "created_utc": 1732671787.0,
      "score": 4
    },
    {
      "id": "lz3z9tv",
      "body": "Has she ever had the talk? We don’t let anyone touch us in our bathing suit area talk. Start there and see what she says.",
      "created_utc": 1732644238.0,
      "score": 56
    },
    {
      "id": "lz5qmg5",
      "body": "Hey, I’m so sorry to hear about your little sister and that you are in this position now. \n\nPlease call Child Protective Services if there is any doubts about what is going on. You may not be equipped to handle a delicate situation like this. I trust that you have good judgment and intentions in digging into this further, but sometimes it’s best to let a professional handle this. \n\nI’m so sorry you’re having to deal with this. And my heart goes out to your sister. \n\nYou’re doing the right thing in supporting your sister. Stay strong and safe 💙",
      "created_utc": 1732664287.0,
      "score": 6
    },
    {
      "id": "lz3u4ps",
      "body": "Thank you, I’m so glad your little sister has such loving brothers like you 🫶🏼 Whatever your parents say, I would take her to a child psychologist and have your brothers all there to ensure it happens - what happened requires an explanation and investigation.",
      "created_utc": 1732642701.0,
      "score": 59
    },
    {
      "id": "lz6hvoq",
      "body": "It’s also important that kids know that no one should ever remove their underwear and that adults shouldn’t ask kids to keep secrets. Once they get older you can explain that it’s ok to keep secrets if it’s a birthday or Christmas gift, but that otherwise adults should never ask them to keep a secret.",
      "created_utc": 1732674475.0,
      "score": 28
    }
  ]
}