{
  "id": "1f35a3x",
  "title": "My cousin killed himself. It's like he chose to do it in the most selfish way possible. I can't mourn his loss because I'm absolutely fucking furious.",
  "selftext": "My cousin shot himself in the head on Saturday morning. Guns aren't a big thing in this country, so no idea where he even got it from. Police took it. He killed himself in his childhood room at my aunt's house while she's in hospital dying of cancer and was hoping to return home soon so she could die in comfort with the small family we have left. Woman looks like a skeleton already and is barely breathing. She's probably only got a couple weeks left in her at most and she knows it. She's had a hard life and just had to have her older brother tell her that her only child killed himself today. She had to be told how when her brother told her that she can't see the body. I know that losing a parent hurts. I've lived it. He couldn't have waited just a couple weeks to give that woman the tiniest comfort at the end? He left a note saying that he \"loves us\", mentioning us all by name, and saying that he's sorry he's \"going first\" and that it's \"not our fault\".\n\nThat's all well and good but you know who had to clean up his entire fucking head on Sunday? Me. I guess it makes sense that the police don't just handle that for you, but I didn't expect it all to just be left exactly as it was for me to handle by myself. I wasn't even aware that the mess was there the first time I walked in to the room. I knew he had died in there, and knew he had shot himself, but it was like a horror movie. I think I just froze. I called the police and they apologised profusely for the lack of forewarning and suggested cleaning services and gave contact details. I called them up and several were closed, and I was told I would have to wait three or four days due to backlog and the bank holiday. I've got a kid at home I'd much rather be spending time with before he has to go back to school next week, but it's been very warm lately and I didn't want to leave it for long in case it started rotting and attracting flies, or if my aunt needed to come back home, so I started cleaning up by myself. I just wanted to get it over with. As soon as I thought I had successfully cleared an area I would find bits or blood specks on a surface you'd have thought would be impossible to hit, or some almost cement-like dry clump clinging to something. I just gave up at some point on \"cleaning\" pretty much anything that wasn't a hard surface, and decided that throwing most things out made sense. So much of it felt like I was just diluting and smearing it around. Every time there was a chunk that wasn't water soluble I felt sick. Did not take the time to try to figure out what they were. I had to take apart photo frames with pictures of my family, and him and me as children, to clean bits out of the corners. Tore out and cut up the carpet, bedding, bagged up all of his clothes that were out in the open. Recoiled in disgust every time I felt something through the thin gloves. I'm in my 20s. I wish he was still here, we got along well, I loved him dearly, but it's all just being overwritten by the intense anger I feel at him leaving me and everyone else around him in a position where we have to handle this while we all have so much else going on. If she even manages to survive for that long, given how badly she took the news, he's made it so the final act of his mother's life is probably going to be attending his funeral.\n\nI wish I could have helped him more when he was here but even more than that I wish I could just scream at him \"if you're going to kill yourself at least do it in a way that won't fuck over everyone who you love and who loves you on the way out. \"",
  "created_utc": 1724834921.0,
  "score": 7785,
  "num_comments": 418,
  "url": "https://www.reddit.com/r/offmychest/comments/1f35a3x/my_cousin_killed_himself_its_like_he_chose_to_do/",
  "comments": [
    {
      "id": "lkb9byy",
      "body": "This broke my heart. I hope the healing process is a lot better. Sorry for your loss.",
      "created_utc": 1724835717.0,
      "score": 5880
    },
    {
      "id": "lkcyfk0",
      "body": "My dad drove drunk and got himself killed a night after I’d asked him “do you want to die?” After I found out he’d driven drunk for 45 minutes from his apartment to my aunts house. He drove too fast through a dirt road and lost control when he hit a pot hole and slammed into the back of a semi trailer and was partially ejected into it. \n\nI was just barely 20 years old. My brother was 17. I was *furious* with him. I contemplated not having a memorial because I was so goddamn angry that he’d deprived us both of a father and my mom of a partner right as her chronic disease was hitting its peak. I was angry with him, angry at the bar that over-served him and let him leave drunk, angry at my cousins and uncle who he was drinking with that let him drive away, angry that he could have killed someone l, and just angry at the world in general. \n\nIt took a long time for me to realize that anger is normal, but holding onto it for too long isn’t. I spent the first few years of my early twenties hating any mention of my dad because I was so mad about it. As a result, I missed out on a lot of experiences with friends and family, dropped out of college, and broke my relationship with my mom. \n\nI highly recommend professional therapy. Anger in grief can put you in a very toxic and depressing hole that’s difficult to get out of. Don’t let yourself fall into it.",
      "created_utc": 1724860669.0,
      "score": 376
    },
    {
      "id": "lkbb4fm",
      "body": "Please see someone re. Trauma counselling from the cleanup, even if you don't think you need to. And play Tetris, even if you don't think you need to. \n\nAnger is a phase of grief. You will probably go through all sorts of emotions, and there's no time scale to it. It's okay. \n\nI'm sorry you had to go through this, especially the clean up. Nobody should have to do that unless they're prepared and trained. 😞",
      "created_utc": 1724836946.0,
      "score": 1933
    },
    {
      "id": "lkbcmnf",
      "body": "Possibly one of the most haunting posts I've come across on this site. Truly sorry for your loss. I'm sure your cousin was going through a lot but I feel you. You and your family, especially your son, deserve better. To top it off, you having to clean up is sickening. And, your poor aunt..... Sorry for your loss.",
      "created_utc": 1724837972.0,
      "score": 783
    },
    {
      "id": "lkboy7h",
      "body": "That clean up will stay with you for the rest of your life; it’s like an assault on your senses that will replay. You’ve declined the need for counseling, but you’re currently fueled by anger. \n\nYou’re ’doing’ the things that have to be done, but you’re not yet ‘feeling’ the extent of the emotional range. Once the anger and resentment recede, you’ll be left with the deep, empty sadness of perpetual grief. You’d do well to talk to a professional, if only once or twice. \n\nSource: I’ve been a non clinical crisis counselor for almost ten years.",
      "created_utc": 1724844822.0,
      "score": 348
    },
    {
      "id": "lkb9uq3",
      "body": "First of all I'm sorry for your loss.\n\nYour feelings are valid. Allow yourself to feel the emotion.\n\nYou are obviously a pretty kind person who is putting their family first. Good on you for doing something difficult to help your aunt.",
      "created_utc": 1724836073.0,
      "score": 358
    },
    {
      "id": "lkbeb6t",
      "body": "At one point in my life I worked at a restoration company that also provided as a core service “decomposition cleaning” and I’ll tell you that while I don’t often think of the things I had to clean up since those days, they stay with you. I found that talking to someone about it often made my mind feel better, it’s ok to feel frustrated and angry, the act of taking one’s own life is selfish particularly where/when it occurs, there’s always something there in the background that drove them to it.\n\nFind other activities to keep your mind busy, ground yourself in your humanity and the thoughts will subside.",
      "created_utc": 1724839054.0,
      "score": 197
    },
    {
      "id": "lkbl504",
      "body": "Sorry for your loss. I think the thing to bear in mind is that he wasn’t in his right mind. He wasn’t making logical decisions because in that moment he was incapable of it. \n\nI’ve lost a partner to suicide and it was like this and the fact is humans and all animals have a built in survival instinct from millions of years of evolution, so for someone to be in such distress that it overrides *that*…they’re beyond capacity for normal thought. So as hard and brutal as it is, try not to hold onto the anger.",
      "created_utc": 1724842954.0,
      "score": 164
    },
    {
      "id": "lkbjeux",
      "body": "I'm so sorry for your loss. I have very complicated feelings on a close friends suicide as well. His wife was on a trip back home because her grandfather died and he decided that was the best time to call her + her family and tell them he was going to kill himself. He listened to them beg for 10 minutes and then did it anyway.\n\nIt absolutely changed my opinion of him as a person. It complicated destroyed my best friend because she was begging and pleading and he did it anyway, the day after her grandfather's funeral. I felt more rage towards him than grief over his loss, I still do. He always proclaimed how much he loved his wife and turned around and did it in such a fucked up, traumatizing way. I'll never forgive him for that.\n\nYour feelings are valid, even the negative ones. Don't let others tell you you're wrong for being hurt, pissed, enraged, disgusted, hatred, etc. It's all valid and 100% okay.",
      "created_utc": 1724842054.0,
      "score": 108
    },
    {
      "id": "lkbzmvw",
      "body": "OP. This sounds stupid but go play a game of Tetris right now. Or a video game. Or something to distract yourself. You’ve just been through a horribly traumatic event, and playing games like Tetris right away have been shown to negate the effects. I don’t remember why. I will look for the study.",
      "created_utc": 1724849312.0,
      "score": 121
    },
    {
      "id": "lkbdvei",
      "body": "Being from that country that *is* obsessed with guns, this is, statistically speaking, one of the more likely outcomes to gun ownership. They make it so fucking *easy* to make the choice to end it and not have to go through the risk of backpedalling on the decision. And it's a uniquely horrific way to go about this when you consider how much trauma and harm it does to the family of the victim.\n\nWhat you went through is horrible, and I'm so sorry you had to see the results of such a thing and clean up the horror that resulted from what your cousin did. I know in another comment you've mentioned you don't think you'd need therapy. But I would like to gently counter that notion. You may not *feel* like you do now. But confident as you might be in that assessment, you don't want to be 3 months out from now, losing interest in everything that once brought you joy, cloistered away in your home, not responding to loved ones, well on your way into depression or worse. Even if *in this moment* you don't need it, a therapist can provide a tool kit for use in the future to understand the warning signs and leverage techniques to help you through bad times.\n\nI'm speaking as both a survivor of suicidal compulsions and one who's been deeply affect by a loved one's suicide. You think you're good and then a year later you're self medicating with booze and spiraling and insisting you're still fine somehow. You blind yourself to it and avoid the plain truth in front of you. It's better to be armed against that eventuality and never need it than to be looking down the barrel of your own gun and have no tools to pull yourself away from the situation.",
      "created_utc": 1724838779.0,
      "score": 118
    },
    {
      "id": "lkbertn",
      "body": "I’m so sorry OP. This was devastating to read.  Please consider that people who kill themselves are usually not functioning mentally. They can’t and don’t think about consequences to their loved ones. When you’re severely depressed it’s literally like being in a dense fog and you just want the pain to end so desperately that you will do anything. You’re not thinking about others’ suffering because you’re just so overwhelmed by your own fatigue and pain. He probably didn’t think much about whether anyone would care, or thought they wouldn’t. I hope you are able to forgive your cousin in time. Either way, I’m so sorry you and your family are going through this.",
      "created_utc": 1724839342.0,
      "score": 97
    },
    {
      "id": "lkc4fg8",
      "body": "Im so sorry. You never should have had to do this. \n\nIn our case, here in the US the homeowners insurance company sent a cleaning crew that I arranged to clean up my FILs remains of his head from their family room. I had no idea that service even existed.\n\nMy husband insisted on seeing the room after the police cleared it, which I couldn’t stop but I wish he hadn’t. Some things aren’t needed but he said he needed to. \n\nPlease get some counseling. I know this is incredibly difficult as I’ve been through it with our family. \n\nCounseling can help, if it’s available. If it’s not, talk to a trusted friend.",
      "created_utc": 1724851095.0,
      "score": 22
    },
    {
      "id": "lkbaum2",
      "body": "I'm so so sorry for your loss. You having to clean it up sounds like a nightmare too! You deserve better. I wish I could say or do something to help but it sounds like a truly impossible situation. If you need to chat or anything my inbox is open for you and I hope your family will get through this alright.",
      "created_utc": 1724836761.0,
      "score": 42
    },
    {
      "id": "lkc0ykp",
      "body": "Please.please get yourself some counseling after this as that is a shit load of trauma you aren't going to be able to handle on your own.  You need to work through and decompress a lot of that 😯",
      "created_utc": 1724849812.0,
      "score": 18
    },
    {
      "id": "lkcr873",
      "body": "I'm so sorry for your loss OP.\n\nMy cousin also killed himself some years ago and wanted me to be the one to find him, which I did. It was terrible enough but I was spared having to do the cleanup. This is crazy the police left you to do it and did not even warn you. This is sick you had to do that.\n\nReminder you have every right to be angry, at him or the police, this is traumatizing in every way, believe it or not, anger is part of mourning too, everyone mourns differently. Take care of yourself and reach for professional help if you're struggling.",
      "created_utc": 1724858493.0,
      "score": 18
    },
    {
      "id": "lkbg3h6",
      "body": "I'm so sorry.   2 years ago my best friends brother,  30, dropped dead fromma heart attack.  He was never the same.   He shot himself in the head a year later.   I'll never forgive him.   I know that is selfish,  but it's true.  I'm a straight guy that can say I loved that man more than most things on this earth.   He went unto his room, walked past his parents .....  walked out to the middle of the road Infronr of their house and pulled the trigger.    I will never......ever.....ever.... forgive that dude.   We'd chat for hours and hours and hours.  I knew he had some ptsd from the usmc and so forth,  he was seeking help.  I told his parents to take his gun away, but they are gun people themselves.   As I'm typing this....I have watery eyes and am clenching my teeth",
      "created_utc": 1724840158.0,
      "score": 75
    },
    {
      "id": "lkchbyf",
      "body": "I've had two family members kill themselves. It's tough not to feel some anger bc it does seem like a selfish act. But, I've realized that they aren't thinking about it that way. When you make the decision to leave this life you're in a different head space from the standard \"What will others think about this?\" \n\nThey are that tortured that it transcends worrying about the impact their suicide will have on others. The way I see it, if that's the case then God bless them and I'm glad they're at peace now. I can tell them how it made me feel in the next life, but for now I'll choose to be at peace with it.",
      "created_utc": 1724855441.0,
      "score": 14
    },
    {
      "id": "lkdqn7e",
      "body": "I’m so sorry.\n\nI just want to say your anger is completely valid. This situation all around is horrible. \n\nAs a person who has felt suicidal and has been on the verge of follow through, there isn’t really logical thinking. It is this weird fog where your brain is not thinking clearly at all. It’s so sad to me that he wasn’t capable of seeing how much hurt and pain he was going to put your family through. \nWhether or not he was able to see it, suicide has elements of selfishness and you’re aloud to be angry about it.",
      "created_utc": 1724869401.0,
      "score": 14
    },
    {
      "id": "lkbm94v",
      "body": "Please, OP, please get in touch with a therapist soon. You don’t know yet how deeply this will affect you. I’m still dealing with deep rooted issues from Hurricane Sandy almost a decade ago. For your sake, and for everyone around, please talk to someone",
      "created_utc": 1724843516.0,
      "score": 13
    },
    {
      "id": "lkgc76w",
      "body": "It's funny the things we are never told/never consider until we're in that moment. My mom passed away from a cardiac arrest - my wife & I were there when it happened, we called 911, she talked to them while I did chest compressions, and the paramedics showed up in just a few minutes. We went to the back of the apartment while they worked on her in the front room. They called it, let me know she was gone, and then they left. Her body was still in the living room - I always assumed they transported the body to the local morgue. A sheriff was nice enough to let us know we should call a mortuary to pick up (he also stayed and waited with us). After the pick up, we had to clean up the discarded medical wrappers and all that. Never thought about that part of dying.\n\nSomething like that was bad enough OP, I can't imagine having been in your shoes. I'm so sorry.",
      "created_utc": 1724905905.0,
      "score": 14
    },
    {
      "id": "lkbaqb7",
      "body": "Sorry for your loss, i can imagine this anger. I would've felt the same. But I find it more revolting to know that there's no service arranged by the state to help out.",
      "created_utc": 1724836678.0,
      "score": 51
    },
    {
      "id": "lkg7oiq",
      "body": "Yes it’s a common statistic. Not all the time but Men who suicide tend to leave a mess. Hanging shooting jumping in front of a train. They don’t think of the people they leave behind. The family who will clean up their blood, the train driver traumatised, the passengers inconvenienced. Women think of the details. They tend to be neat. An overdose on pills, slit wrists but they get into the bathtub first. They think of who will have to clean up after them, how their families will feel, what they will look like in an open casket for their loved ones to say goodbye. Im not saying that to excuse him mind you. I’m sorry he did that to you and his poor mother. It’s absolutely justified for you to be angry and resentful of him.",
      "created_utc": 1724903693.0,
      "score": 12
    },
    {
      "id": "lkbo3jr",
      "body": "Sorry that happened to you.\n\nThis is one of life's lessons they don't tell you about: the cleanup.  Bear in mind, this is often true in greater or lesser degree, for example, in the case of a fatal confrontation with a home invader.  And what you probably don't need to hear, having been forced to learn it for yourself, is that you should just think about it as what it is: meat.  But I write in case it's helpful for you to think of it in memory, too, as just that: meat.  The material that made up the man, but which was not the same thing as the man, and which, in itself, is common and no big deal.  It can be easy to get overwhelmed when confronted with something laden with multiple meanings and fraught with emotion.  And *we don't talk about* the natural disgust and frustration of cleaning up a corpse, even of a loved one.  But the disgust is one thing, your loss is another, your moral indignation is still another, and so on.  The failure to untangle these different aspects from one another may have made the event, and may make the memory of the event, more traumatic than it has to be.  Anyway, this is something I think I would have benefited from hearing when I was in a situation a little bit like yours.  And your ambivalence is perfectly natural and as old as time.\n\nAs for your cousin's selfishness, you don't go into detail about the circumstances of his life or his relationship with his parents, and I won't pretend to have any insight there, but another of life's lessons is that we never really can know what goes on behind closed doors, or inside the minds, of even our closest relatives and loved ones.  We go through life buoyed by assumption and trust.  All of what you say may be true, about your aunt's hard life, about the selfishness of the form your cousin's suicide took, but there's probably no reason to think that this is all that's true.  There are often all kinds of subtleties in the relationships of parents to their children, children to parents, that are not only unknown, but incommunicable.  On the extreme end can be some pretty savage abuse.\n\nTry, if you can find a way, to use this experience constructively.  If nothing else, this will give you a heightened awareness of what to be thinking about, if down the road you have the advantage of seeing your own death coming.",
      "created_utc": 1724844414.0,
      "score": 23
    },
    {
      "id": "lkbu59x",
      "body": "This is horrific. I’m so, so sorry. Nothing I or anyone else can say will make this go away, I just hope you can get some professional support soon. And in the meantime, as odd as it sounds, there is research showing benefits of playing Tetris immediately following trauma. I’m a first responder and I have actually found it beneficial. It’s worth a try. I’m truly so sorry you and your family are going through this.",
      "created_utc": 1724847110.0,
      "score": 10
    },
    {
      "id": "lkfpg1m",
      "body": "I’m so sorry this happened. I had a similar, but less visceral experience a couple years ago. I have PTSD as a result and used to frequently dream about it, luckily my primary care provider listens.\n\nMy cousin hung himself in a way that made 100% sure that I would be the one to find him. We had a standing “date” every 2 weeks where I would come over to take him grocery shopping and then  we’d cook a meal together. He struggled with some substance abuse (former military, self medicating), so it was good for both of us to avoid him being isolated.\n\nI went to his house and knocked, got no answer. Repeat. I then used my emergency key and it was obvious something was wrong. It was too quiet, I could hear the fridge running. I found him hanging from a support beam. I ran, got a knife and cut him down, but he was already gone. He did it in the morning, so that when I arrived in the afternoon,it would be much too late. In his message to me, he apologized and said he did it that way because he didn’t want me to feel guilt for being “too late”. \n\nI have a lot of anger about the circumstances of his decision and how he went about it. He allowed me, his closest cousin/friend, to find him that way. What if my kids had been with me? I couldn’t stop thinking about it and that caused me to spiral a bit. Be kind to yourself, this is not something anyone should have to deal with. I hope your aunt’s pain is well controlled and that she will pass comfortably.",
      "created_utc": 1724896194.0,
      "score": 10
    },
    {
      "id": "lkbiu9k",
      "body": "[deleted]",
      "created_utc": 1724841745.0,
      "score": 21
    },
    {
      "id": "lkclzcq",
      "body": "I'm so sorry for what you are going through and that you had to clean it up. \n\nI lost a childhood friend, he was my sister's age and like an older brother to me. It was an accident but still a gun shot to the head and it's gruesome. \n\nJust know that if anger helps you right now, that's okay. It's okay to feel upset over how he did it. It's okay to be upset that he took something from your Aunt. It's okay to think he was selfish to leave that mess for you to clean. All of your emotions are valid and normal, so please know that. \n\nJust know that it's normal for those who plan to commit suicide to make plans or even get really \"loving\" before they do the deed. It wasn't on you to catch that he was going to do this, people who want it to go through are very good at hiding their intentions. You didn't miss anything, you were living your life in a family who is surrounding your Aunt while she is going through something horrific. You didn't know he was going to do this. \n\nI'm angry the police didn't prepare you and give you the cleaners information before you went in there. I'm so sorry. Please reach out to counseling services, I'm sure social services or the police can give you some information. It can help to talk about trauma before it sets in. Be kind to yourself and remember to get plenty of rest, eat balanced meals and get plenty of water. It's not selfish, it's self care and you need it.",
      "created_utc": 1724856891.0,
      "score": 9
    },
    {
      "id": "lke1flq",
      "body": "My cousin killed himself earlier this year too. He planned to do it in traffic, just hit a truck head on. He wanted to do it on the anniversary of his mothers death, but waited too long. He had run out of time and no trucks were coming so he just went straight into the other lane and hit another car. Family inside. Parents made it with injuries but two of the kids had to be hospitalized with life altering injuries",
      "created_utc": 1724872868.0,
      "score": 7
    },
    {
      "id": "lkbvf5j",
      "body": "My god. I’m so sorry.. it’s okay that you’re angry. Everyone grieves differently. Give yourself some grace & consider therapy",
      "created_utc": 1724847642.0,
      "score": 6
    },
    {
      "id": "lkca3rz",
      "body": "I am so so sorry for that you had to endure that. I had a similar experience, although not as gory, when I was in college. My cousin and I walked into a bloody trail all over our house into a tub where my uncle tried to commit suicide. We were shocked once the ambulance took him that we had to clean it all up and it was everywhere, on the walls, carpet, bathroom…it took forever to get that out. I remember finding specs of blood days/ weeks later after extensive scrubbing. I wouldn’t wish that type of experience on anyone, and I could only imagine how much more difficult it was for you since it was with a gun. I too felt angry at that time because of how traumatic it was for us to physically see it and to have to clean the blood from your own family member. I hope you know that your feelings are valid and you shouldn’t put yourself down for being angry. It is part of the trauma and grieving process, but it will get better over time. \nMy heart aches for your aunt too. I hope you and your family heal in peace after such a tragedy.",
      "created_utc": 1724853094.0,
      "score": 5
    },
    {
      "id": "lkcfby1",
      "body": "Brother in law shot himself on the porch after him and my partner got into it. Family friends cleaned him up off the porch and we haven’t really been back to that house in over a year. \n\nI’m sorry that you have to stay there and I’m sorry that you were the one to clean that up. At the end of the day the hate you hold is useless and you just have a different perspective than what he had. Learn from what happened and make sure it doesn’t happen again.",
      "created_utc": 1724854811.0,
      "score": 5
    },
    {
      "id": "lkcffva",
      "body": "My cousin did it a year ago last Sunday. I was sad last year. This year I am angry…angry that her parents failed her and didn’t help her until it was too late. Keep processing it and writing it out. It helps. Last year I wrote a poem but this year I can bear to think about it.",
      "created_utc": 1724854846.0,
      "score": 6
    },
    {
      "id": "lkcfi1f",
      "body": "I am gasping at what you went through while cleaning up; that must have been absolutely horrific and I don't blame you for being really upset! It must have been deeply traumatic for you and I really hope you're able to get help in recovering from it. \n\nAs much compassion as I have for your cousin, I have to agree with you on the timing and extremely brutal, graphic manner in which he decided to end it; it's awful!\n\nI'm so sorry and please believe me when I say I'm sending you hugs.",
      "created_utc": 1724854864.0,
      "score": 5
    },
    {
      "id": "lkcua4m",
      "body": "Wow I am so incredibly sorry, I would not even know how to process what you’re going through. Even if you think you don’t need it, please go to therapy. Therapy truly helped me through the hardest moments of my life, I think it will for you too.",
      "created_utc": 1724859415.0,
      "score": 7
    },
    {
      "id": "lkcz892",
      "body": "I lost my mom in the same manner.  I can't speak for everyone but for the few people I've  lost to suicide, they weren't fully functional.   It's common for depression to warp the way we see ourselves and the world around us but Mental illness can also screw up  impulse control and the ability to fully rationalize.  \n\n In my mom's case, she lost *her* own mother to suicide 8 years before and she was devastated and furious at her for it. My mom had struggled with depression and unmanageable pain for years and would often have the thought cross her mind.  It made sense when she it popped in her head but disintegrate when the rational part kicked in and she realized how terrible that would be.    She must have told me 20 times over the years that she'd never do that, but as time wore on and she started to understand her own mother better it scared the hell out of her.  She saw a Psychiatrist, took her medication and from the outside should have been okay.   Until the one day the thought crossed her mind and she didn't take the next step in time. \n\nAs parents, when a child gets upset and bites their siblings we try to teach them it's wrong.  They may learn it's not approved of but it's not until we get older that we can actually fully reason why.  Mental illness can screw up the ability to do that. \n\n\nThat's not to say there aren't rational people who do this and people are never selfish.   Did they normally knowingly do things to hurt others?  Did they care how people saw them? \n\nLast thought on this.  I've gotten flack for it, but I feel that sometimes anger helps. It's a little easier to have something to redirect all of that pain to rather than having it weigh your heart down.  I can't imagine doing what you did with nothing but grief and despair.   I suffer from depression and can understand my mom but every Mothers Day and on every birthday, I get angry.\n\nI'm sorry for your loss.  What you've done for his mother is incredible.",
      "created_utc": 1724860914.0,
      "score": 6
    },
    {
      "id": "lkd0cy2",
      "body": "I'm so sorry this happened to you and for your loss. \n\nI also had to clean up after a loved ones death.  I also was pissed later that no one told me about cleaning services and was so numb I just did it to be helpful.  None of my family could be in the room, so I just shut it off and did it.  But I couldn't unsee it later. \n\nMy biggest advice is to know that all of your feelings are valid, including anger.  Seek grief counseling, even just in the short term and they will give you things to do to help.  Tetris was recommended by others, it helps with avoiding repetitious thoughts about the traumatic event, and prevents it from permanently embedding in long-term memory.  You'll remember it always but it helps to not immediately reinforce those memory pathways.",
      "created_utc": 1724861271.0,
      "score": 7
    },
    {
      "id": "lkgaaj4",
      "body": "What a horrendous experience. I am so sorry for what you had to go through. \n\nLess explicitly fucked up, but related: A dear friend of mine lives in a rural area and lets a lot of people come through and stay at his place. One such person, who I had met a few weeks before and seemed fine and lovely to hang out with, decided to walk off the property and kill herself. The problem in this case is that no one could find her. She had left a note but there was no body. So then the police came and searched through the house and land and questioned everyone over and over again, on multiple visits over several weeks, because her family insisted that there must have been foul play. It was a nightmare for my friend, this girl's boyfriend, and everyone else around. They finally found the body a few weeks later. I suppose this girl wasn't thinking about the effect that her action might have on others but damn, she really fucked over a lot of people for a while. I wasn't even there for this fiasco but I heard about it every day and I am still angry thinking about it. Anyways, yeah, you've every right to be angry about the monstrous situation you're in. I wish you good healing and happiness going forward in your life.",
      "created_utc": 1724904954.0,
      "score": 6
    },
    {
      "id": "lkh3otl",
      "body": "OP, I just want you to know, I have bookmarked This Thread to come back and read whenever I feel like I just don't want to be here anymore. Unfortunately, I feel like that quite often and have since 11 years old. I'm 41 now, and it never got better, and I still don't want to be here. But one of the only reasons I still am here is because I can't figure out how not to impact someone to the extent I leave them with PTSD. I can't think of an easy sanitary non-traumatic for someone else way to leave this place, so I'm still here. As horrifying as this situation is, as much as I wish I could just hug your aunt and yourself, you're sharing this has given me one more thing to add to the list of things I refer to in the moment to hopefully stop me from completion. I don't know that that helps you to know, but it's true. Thank you for sharing this awful story with us. I pray that your cousin can rest in peace now, for what it's worth.",
      "created_utc": 1724922886.0,
      "score": 6
    },
    {
      "id": "lkd498n",
      "body": "This is one of the many reasons I support assisted suicide.  Even if you don't want someone to commit suicide, if they've made up their mind that they're going to, it should at least be something they can get help with doing in a dignified and pain-lite manner that won't scar the people they leave behind.\n\nI'm really sorry that you have had to deal with all of this.",
      "created_utc": 1724862484.0,
      "score": 11
    },
    {
      "id": "lkboa60",
      "body": "I am so sorry for your loss. Please contact the homeowner insurance company. They actually pay for professionals to come in and handle the cleaning. Family should not have to do this. Your poor aunt. What devastating news for her. Very sad",
      "created_utc": 1724844503.0,
      "score": 10
    },
    {
      "id": "lkc6as8",
      "body": "My heart broke many times reading this. I’m so sorry for your loss and what it’s doing to your family.",
      "created_utc": 1724851768.0,
      "score": 5
    },
    {
      "id": "lkcaoo6",
      "body": "They have many different outlets and specialist to help cope with the trauma, please seek help.\nBut, I wanted to let you know that talking care of this so your aunt/rest of the family doesn’t have to us so incredibly courageous. I’m so sorry you had to go through this. I’m so sorry that you’re aunt has to endure this. I wish you the absolute best. Please take all the time you need to rest and cope with this.",
      "created_utc": 1724853288.0,
      "score": 5
    },
    {
      "id": "lkda8x9",
      "body": "Op - I’m so sorry for you loss and i understand your anger. My brother committed suicide on my sister’s birthday in his car by shooting himself and my sister had to deal with it because everyone was out of town or lived in another state. \n\nThe anger I felt at the situation was huge. Grief didn’t even have room to hit for quite awhile because I was so fucking MAD.\n\nThen the grief and guilt hit. It’s been 10 years and I’m still mad and full of grief and guilt.\n\nI highly recommend therapy for all parties…but especially you. I’m so so so sorry you are dealing with this and i am sending all the love.\n\nBe gentle with yourself. Your feelings are valid and it’s ok to not be ok. Again, I’m so sorry for your loss.",
      "created_utc": 1724864344.0,
      "score": 5
    },
    {
      "id": "lkffl69",
      "body": "When you are at your deepest darkest place, you think of nobody or nothing else. It’s like your brain can ONLY think of a way to escape the dread and sadness and confusion, and in a split second it can happen- you can succumb to those awful thoughts. I think a lot of times when somebody is in a dark enough place to write a note, they are already convinced that there is no way out of that dark place.\n\nI am so sorry this happened to you and your family and I can’t even IMAGINE cleaning up your loved one’s remains. I hope that you are able to talk to someone about this. It is going to stick with you. I think you’re in shock. You’ve been through and are going through a lot. I imagine that when your auntie passes away, you will need somebody to talk to. Grief for the one you’re angry with may surface when his momma leaves this earth.  \n❤️",
      "created_utc": 1724892527.0,
      "score": 4
    },
    {
      "id": "lkfgsa4",
      "body": "I’m so sorry you’re dealing with this, I deal with this as part of my job & I have to remind myself that people truly believe no one will care because they are so depressed. Sometimes it helps & sometimes I’m overwhelmed by how selfish it seems. I had one where the guy texted his girlfriend that it was her fault and it will forever stick with me that she had to live with that blame. \n\nMy cousin also attempted and she has a child the same age as mine, I know she had a rough upbringing but I couldn’t imagine leaving my child behind like that. And then I realize I will never understand because I haven’t been there and I try not to be so hard on them. I hope you heal and don’t hesitate to get therapy for this, it’s more than anyone should ever deal with.",
      "created_utc": 1724892964.0,
      "score": 5
    },
    {
      "id": "lkfmjv3",
      "body": "Jesus Christ this needed a trigger warning like nothing I’ve ever read before.",
      "created_utc": 1724895107.0,
      "score": 5
    },
    {
      "id": "lkfvbb0",
      "body": "I don’t even have words for this. I am so sorry :( I can’t imagine having to go through something like this. If you need someone to just listen and not just shove therapy down your throat, I’m here. Hugs, friend.",
      "created_utc": 1724898428.0,
      "score": 6
    },
    {
      "id": "lkg5m5m",
      "body": "Wow. Just wow. I can’t even imagine what that was like. I’m so sorry for you. That must have been beyond traumatizing. I would 100% recommend seeing a counselor who specializes in trauma.",
      "created_utc": 1724902746.0,
      "score": 4
    },
    {
      "id": "lkc7hxd",
      "body": "I'm so sorry for your loss. My heart goes to you and your bereaved family. My sincere condolences. \n\nAs someone clinically diagnosed with severe depression who went through multiple failed S attempts, my heart aches knowing this is how a loved one would've felt about my death—anger. Please do not take this to heart negatively, I understand and respect how you feel. It's just heartbreaking from the point of view of someone like me.\n\nBecause it's always \"he was so selfish for unaliving himself\" and never \"I couldn't imagine how much he suffered before his last straw, how he tried to fight before finally giving up.\" It's also never \"the world must've have been so cruel for him to come to that point.\" It's always us, not who or what pushed us off the cliff. \n\nIf only there's a way we could disappear without hurting  those we that we love, we'd all choose to disappear that way.",
      "created_utc": 1724852195.0,
      "score": 25
    },
    {
      "id": "lkbehf5",
      "body": "I’m sorry it had to be you.  \n  \nFor the record, your feelings are totally valid.  Just because his story is sad doesn’t mean you can’t also feel he’s a total asshole for putting everyone through that.  It can be both.  You can miss him and want him back and also be furious.  You can love him and hate what he did to you all.  You can wish he were here in front of you so you can beat the crap out of him.  \n  \nIf he had died in a normal way, by the way, all of that would still be valid.  But that’s absolute bullshit that you had to live through all that.",
      "created_utc": 1724839162.0,
      "score": 10
    },
    {
      "id": "lkc3002",
      "body": "When I was a kid, my father committed suicide and my mother had to clean it up because we couldn't afford a cleaning service. I had to take the bloody mattress outside and burn it because the garbage truck wouldn't pick it up (understandably). A year later, we were still finding bits and pieces in places we never thought. My heart is with you and your family, OP.",
      "created_utc": 1724850573.0,
      "score": 8
    },
    {
      "id": "lkbl834",
      "body": "Sorry for your loss, reminds me of my cousin who shot himself in the head when I was around 10, if you have to go back to clean up try hydrogen peroxide spray cleaner as you can spray it then leave it for a bit then wipe away,",
      "created_utc": 1724842998.0,
      "score": 3
    },
    {
      "id": "lkbos4u",
      "body": "OP, are you okay? I can only imagine how traumatizing this situation could’ve been. Please take care of yourself and get familiar with the resources in your community should you struggle to move past this. So sorry for your loss btw",
      "created_utc": 1724844743.0,
      "score": 5
    },
    {
      "id": "lkdca0y",
      "body": "You’re a good soul for taking on the cleanup yourself. Please get some therapy to process these feelings, or they’ll eat you up over time. I’m sorry for your loss.",
      "created_utc": 1724864978.0,
      "score": 3
    },
    {
      "id": "lkdmst2",
      "body": "This also broke my heart. I thought cleaning my dead brother’s room was difficult. \n\nI send deep and wide sympathy and empathy for you. May you keep the good memories and may the terrible ones fade away. \n\nLove to you and your fam.\n\n💜✊🏽💪🏾",
      "created_utc": 1724868211.0,
      "score": 3
    },
    {
      "id": "lkdxn9m",
      "body": "You’ve had lots of supportive and useful comments and I fully echo all of them about getting therapy and reaching for support. Playing Tetris too to help with the shock. \n\nThis is just a note to inform the school that your kid goes to. I’m assuming from the details that you’re in the UK. They’ll have a Designated Safeguarding Lead (DSL). It’s usually a Deputy Head or similar level staff member. It’s really useful for them to know. They can monitor your child for signs they’re struggling and schools often have capacity to refer students to counselling. Equally, children often process loss and trauma through their writing or drawing. Teachers are mandatory reporters so, any concerning writing/art work your kid does, to help them process their emotions, their teacher would need to report. At least if the DSL is aware, it should save awkward, and potentially triggering, phonecalls back to you. \n\nWhilst your kid may externally be fine, or you may feel you’re able to “hide” your stress and grief from them, I assure you that they’ll pick up on it. Please make their school aware. \n\nSource: UK Teacher",
      "created_utc": 1724871547.0,
      "score": 5
    },
    {
      "id": "lke56c4",
      "body": "I'm so sorry. Your anger is completely valid and understandable. You should not have had to clean that up. What a compassionate person you are to do that for your aunt. My ex-husband did something similar. We had been estranged for a few years but I found out from a friend that he shot himself while his housemate was away on vacation. This poor guy found my ex days after, during the hottest part of the summer. I didn't know the housemate at all but like you, I was fucking furious when I found out. My ex was abusive so I didn't have a lot of good feelings left towards him but that final act of selfishness killed them all. I hope you can heal and move beyond this.",
      "created_utc": 1724874050.0,
      "score": 3
    },
    {
      "id": "lkf3r7s",
      "body": "OP, I am so sorry for your loss. Know that guns are not the problem.  If someone wants to kill themselves, they will find a way. \n\n3 years ago, my sister was dying of cancer. There was no hope. Her one and only child locked himself into his house. Took a bunch of drugs and alcohol the took a knife, slit his wrists, and then slit his throat. My sister found him.  He left behind twin boys.\n\nMy sister died a year later.",
      "created_utc": 1724888284.0,
      "score": 4
    },
    {
      "id": "lkfhceb",
      "body": "I’m so very sorry.",
      "created_utc": 1724893171.0,
      "score": 4
    },
    {
      "id": "lkfj6qy",
      "body": "I was going to call yta but holy s that's 🦆 up I'm so sorry and I don't even know you.",
      "created_utc": 1724893853.0,
      "score": 5
    },
    {
      "id": "lkg9ijd",
      "body": "I have never understood suicide myself as whenever I have felt low I always remember there is so much more in life to enjoy and that people would miss me, my best friend killed himself in 2010 and I had to go identify his body as his mum was in hospital, I felt so damn angry at him for it and in a way I still do",
      "created_utc": 1724904579.0,
      "score": 4
    },
    {
      "id": "lkgax6y",
      "body": "One of the most heartbreaking things I have ever read. I'm so sorry for your loss.",
      "created_utc": 1724905265.0,
      "score": 4
    },
    {
      "id": "lkgb3hg",
      "body": "The only reason I'm still here is because of me worrying about leaving my friends behind and my brother having to pack up my apartment. I haven't figured a work around yet, but that's what the meds are intended for.",
      "created_utc": 1724905352.0,
      "score": 3
    },
    {
      "id": "lkgbuwz",
      "body": "Your cousin is very brave and I'm very sorry for what he put you through. Thanks for stepping up for your family's sake.",
      "created_utc": 1724905733.0,
      "score": 3
    },
    {
      "id": "lkbg03g",
      "body": "It’s okay to be angry at him, you have to feel how you feel in order to move on. I can’t imagine the experience of having to clean that up you’re much stronger than me. I’m sorry for your loss I hope your aunt makes it through",
      "created_utc": 1724840101.0,
      "score": 10
    },
    {
      "id": "lkc5wqw",
      "body": "Imagine being so sick the only escape and relief is death. You can’t go on living for other people if your that suffering.",
      "created_utc": 1724851629.0,
      "score": 13
    },
    {
      "id": "lkbpxzb",
      "body": "I'm really sorry that happened to you. \nI want you to know that sharing this story might have helped others carry on.\nWhen I was suicidal, the only thing that helped me was the guilt I felt for leaving my family, and it helped to read others' stories.",
      "created_utc": 1724845283.0,
      "score": 6
    },
    {
      "id": "lkbrx2v",
      "body": "First Step: Anger.",
      "created_utc": 1724846163.0,
      "score": 5
    },
    {
      "id": "lkhw546",
      "body": "I don't understand all of the people calling OP a horrible monster for feeling angry. The cousin is allowed to do something that hurts his family terribly because he's hurting and that's not selfish, but when OP is angry at their cousin because they've also just gone through something very traumatic, \\*they're\\* selfish? I understand why you feel the way you do.",
      "created_utc": 1724936728.0,
      "score": 7
    },
    {
      "id": "lkbjx9y",
      "body": "I’m so sorry",
      "created_utc": 1724842324.0,
      "score": 3
    },
    {
      "id": "lkc22ki",
      "body": "I am so so sorry for your loss and for what you have just gone through, from the police failing to disclose that the mess was left for you to you having to clean that entire mess. It’s fucked up. And your poor aunt. FUCK.",
      "created_utc": 1724850229.0,
      "score": 3
    },
    {
      "id": "lkcmuqk",
      "body": "I’m so sorry this happened.  I think you should know that the trauma you are experiencing from what he did and the physical act of cleaning up the scene of his death are something you will likely need help working through.  Right now Anger with everything is normal. You may find that things that once gave you joy now feel useless. \nIt takes time and work to process this level of trauma.  If you can afford it seek help with a counselor.  The online therapist are good.  \nIf this isn’t an option for you seek out grief groups and trauma survivors groups.  \nYour energy now needs to be focused on getting yourself back to where you were before",
      "created_utc": 1724857156.0,
      "score": 3
    },
    {
      "id": "lkcxqtx",
      "body": "Holy shit man",
      "created_utc": 1724860463.0,
      "score": 3
    },
    {
      "id": "lkd010k",
      "body": "I'm so sorry for your loss and the pain your entire family, particularly your poor aunt, is feeling. It's awful that you had to deal with the clean-up with no forewarning and no support. This is a terrible situation and it's very unfair you had to navigate it on your own.",
      "created_utc": 1724861167.0,
      "score": 3
    },
    {
      "id": "lkd1sa6",
      "body": "I’m so sorry. Anger makes sense. Your poor Auntie, God help her. Please get some extra help for yourself.",
      "created_utc": 1724861718.0,
      "score": 3
    },
    {
      "id": "lkdamnq",
      "body": "Oh goodness, I'm so sorry, OP. That's a lot. I know from experience that type of cleanup is rough - I used to do autopsies at the medical examiner office while I studied forensic science - but I can't imagine it being for a relative.\n\nYou have my most sincere condolences for having to shoulder this responsibility while already processing your aunt's terminal illness. The degree to which you're considering how this must impact her is admirable. I hope you get to spend some relaxing quality time with your child after this is through.",
      "created_utc": 1724864462.0,
      "score": 3
    },
    {
      "id": "lkdc87h",
      "body": "It is ok to be angry but clearly your cousin’s mental health was not well.  People don’t think clearly through the fog of depression and grief.  Work through your anger so you can get to a place where you can be sad and accept what has happened. I had an amazing friend do the same thing.  It’s a hard thing to wrap your mind around.",
      "created_utc": 1724864963.0,
      "score": 3
    },
    {
      "id": "lkdfh7h",
      "body": "I'm sorry for your loss.  And I'm sorry you have to deal with the aftermath.  Every feeling you have about this is valid.  I'm sorry about your aunt, too.  I hope things get easier for you.",
      "created_utc": 1724865962.0,
      "score": 3
    },
    {
      "id": "lkdfvyx",
      "body": "My mom commit suicide just before my son’s first birthday. When you lose someone in this way, you go through a huge load of emotions, anger is definitely one of them. It is somewhat a selfish way to go and I still look back and wonder how she could do that to me and leave me here to live with the fact that I wasn’t enough for her to live. Then I remember she had her problems, her inner demons. When someone is going to do it, they just do it, in the easiest way possible which seems what your cousin did. They aren’t thinking about anyone else because they just want out. If they did think about family for one second, they may still be here.",
      "created_utc": 1724866088.0,
      "score": 3
    },
    {
      "id": "lkdlss7",
      "body": "I’m so sorry. My mom was the one who found my uncle when he killed himself in the same. I can’t even imagine the horror. I sneaked a glance over my mom’s shoulder and saw a single photo of the scene after they removed the body before my mom could hide her it a few days after the death. It was horrific. I’m so sorry you had to clean it up yourself. You are very strong and I really think you should seek professional therapy after this. It’s a traumatic experience and I’ve seen the fallout of my mom walking in on that scene years later. I cannot imagine the pain of then having to clean it up.",
      "created_utc": 1724867901.0,
      "score": 3
    },
    {
      "id": "lkdnh12",
      "body": "I am so sorry you had to go through this. You are so strong. And I agree, could he not wait for his mother to pass? What a jerk. Sorry for your loss.",
      "created_utc": 1724868421.0,
      "score": 3
    },
    {
      "id": "lkdnzu5",
      "body": "I can’t imagine how that was for you, I’m so sorry. It’s beyond fucked up to have to clean it yourself, idk why they didn’t have crime scene cleaners or something. I hope you can get some therapy or talk to a professional about it if you’re into that",
      "created_utc": 1724868584.0,
      "score": 3
    },
    {
      "id": "lkdxlgq",
      "body": "theres so much here that it just sucks. suicidal ideation is one of the hardest things to know about. and he probably didnt want the stress of dealing with his moms funeral and had already going all the way through severe grief.",
      "created_utc": 1724871532.0,
      "score": 3
    },
    {
      "id": "lkdydh8",
      "body": "I was furious when my niece killed herself.  Later I found out that was shot by her pos boyfriend",
      "created_utc": 1724871774.0,
      "score": 3
    },
    {
      "id": "lke0y7n",
      "body": "It’s natural to be angry with him. When it subsides, you will be able to see him in a different light. Anger is part of grieving.",
      "created_utc": 1724872695.0,
      "score": 3
    },
    {
      "id": "lke25t9",
      "body": "Anger is grief. Remember that, I’m very sorry for your loss",
      "created_utc": 1724873106.0,
      "score": 3
    },
    {
      "id": "lke704h",
      "body": "I am so sorry. I myself am someone who tends to feel anger before any other emotion. It almost seems easier sometimes. Your anger is valid. You're hurt, shocked, and the points you made are valid. \n\nIt's unfortunate that we can never truly understand the minds of those who take their own lives. If I had to guess, I'd say your cousin more than likely didn't think of your current circumstances when making the decision. I'd assume whatever else was weighing on your cousin was too heavy for him to think of anything else.  It doesn't make it less painful or frustrating, but keep an open mind when you start to fully process this. \n\nI'm wishing you and your family well, hang in there. ❤️",
      "created_utc": 1724874620.0,
      "score": 3
    },
    {
      "id": "lkectz7",
      "body": "Your cousin would not have been able to consider others at that point. He did what he believed was best for him and he didn't have room in his mind to consider the impact his passing - and the nature of his passing - would have on others. Your cousin will have planned this carefully - from accessing a firearm to no-one else being home etc. No-one will know for sure what his final thoughts were, but he did want to reassure you all that this was *his* decision and none of you were to feel guilty. But...\n\nBut to do this while his own mother is desperately clinging on to the little life she has left? That's really tough to hear.\n\nAnd I cannot imagine the hell you experienced in cleaning up his mess. This is a huge act of love for your aunt, and I can only hope that she is still able to pass in her own home if that is still her wish. You have allowed that option to be there for her despite the mental anguish this wrought on you. \n\nI know it sounds ridiculous, but playing a game like Tetris that needs lots of eye-movements and focused concentration can really help you get through some of the initial trauma. There will also be therapy groups for those bereaved by suicide. Seek counselling/therapy. It will help you work through what you are feeling while you are also dealing with a frail aunt who needs those who around her to be filling her last days with love.",
      "created_utc": 1724879254.0,
      "score": 3
    },
    {
      "id": "lkem7us",
      "body": "Damn bro.. I'm speechless. I don't know what to tell you yeah, that shit's fucked up it's never easy losing a loved one especially to suicide and what's especially fucked is that you had to clean up the crime scene.\n\nI can't imagine how traumatizing that must have been for you but you're a strong man I assume maybe something you identify as something else I don't know  but you're a strong person and you did what needed to be done, you cleaned all the shit so that you're ailing aunty could pass away in peace and yeah it is kind of fucked up and selfish what he did , offing himself shortly before your Aunt is due to pass away because as you said one the last thing your Auntie is gonna have to do is attend his funeral and brother that is beyond fucked yeah, I'm flabbergasted, I don't know what to tell you my guy, sorry for you lose, my condolences.",
      "created_utc": 1724882365.0,
      "score": 3
    },
    {
      "id": "lkeo8u3",
      "body": "You are a good person!!!! You should be proud how you handled the adversity... I would be pissed too",
      "created_utc": 1724883037.0,
      "score": 3
    },
    {
      "id": "lkesoz6",
      "body": "I couldn't finish reading this. I'm so sorry.. my words probably don't mean much to you right now but I genuinely hope you and your family get through this. Definitely lean on each other and consider professional help, this is a lot. Lots of love.",
      "created_utc": 1724884532.0,
      "score": 3
    },
    {
      "id": "lkesqmm",
      "body": "I feel the anger with you by just reading it. I can’t imagine how you even cope. I would be angry too.",
      "created_utc": 1724884547.0,
      "score": 3
    },
    {
      "id": "lket6cd",
      "body": "Im so sorry for your loss and what you and your family are going thru.",
      "created_utc": 1724884693.0,
      "score": 3
    },
    {
      "id": "lkewvpf",
      "body": "Wow. Horrible. Just horrible for everyone.\nRest in peace for your cousin. No one except him knew how terrible his mind was before he pulled that trigger. No one kills himself if it's not a never ending maze of pain. \nBut that also traumatized many people who didn't deserve it, also you. \nI wish you quick recovery and a stable mind.",
      "created_utc": 1724885934.0,
      "score": 3
    },
    {
      "id": "lkf13jo",
      "body": "My sisters boyfriend did this to her. Asked her to take the dog out and she came back and he had shot himself in the head. I still feel angry about it almost 4 years later. Sending you love and a reminder that feelings are there to tell you something! Don’t judge yourself for being mad, just feel the feels right now and take care of yourself.",
      "created_utc": 1724887372.0,
      "score": 3
    },
    {
      "id": "lkfadlk",
      "body": "Mental health professionals will tell you it is misguided to think a person who is experiencing suicidal ideation is capable of acting selfishly or unselfishly, as they are not in a mental state to be ae to consider their own feels or consequencesor their actions, much less the wellbeing of  even love of their parents,  siblings, children, spouses, please consider grief counseling. It is definitely difficult for loved ones who are suffering from mental illness and end in loss of life. I hope you are able to find peace in knowing he was truly not capable of considering anything other than most likely needing to end torment caused by a chemical imbalance in the brain. That he just couldn't control.",
      "created_utc": 1724890625.0,
      "score": 3
    },
    {
      "id": "lkfav77",
      "body": "why on earth would they leave it to you to clean the mess....wth, thats traumatizing shit.",
      "created_utc": 1724890802.0,
      "score": 3
    },
    {
      "id": "lkfg5bp",
      "body": "Being angry and furious is part of the grieving process",
      "created_utc": 1724892732.0,
      "score": 3
    },
    {
      "id": "lkfloep",
      "body": "Sorry for your loss",
      "created_utc": 1724894782.0,
      "score": 3
    },
    {
      "id": "lkg4prm",
      "body": "I had an extremely similar situation when i found my father at age 9, i didnt feel angry right away but as I matured and began to greive as an adult, I found it hard to control my anger towards him for leaving me so early. I am so sorry you were put into that position, therapy can be daunting but also extremely beneficial. I found that my local hospice has a family outreach centre for bereaved relatives, in my experience they had both groups and individual sessions, however i found it very beneficial, i hope this is of help to you in this extremely painful time.",
      "created_utc": 1724902341.0,
      "score": 3
    },
    {
      "id": "lkg4zeg",
      "body": "It sent goosebumps and then tears to me just reading it. I hope you heal well from this and get courage to be emerge as a stronger person…",
      "created_utc": 1724902463.0,
      "score": 3
    },
    {
      "id": "lkgjvtw",
      "body": "I am so sorry. I'm sure he didn't think about the mess. Remember the good times :(",
      "created_utc": 1724910096.0,
      "score": 3
    },
    {
      "id": "lkgnlby",
      "body": "This is rough... I'm so sorry... we never know how people are truly feeling unfortunately.",
      "created_utc": 1724912347.0,
      "score": 3
    },
    {
      "id": "lkgp2wz",
      "body": "I’m so sorry friend. Please consider seeking counseling.",
      "created_utc": 1724913285.0,
      "score": 3
    },
    {
      "id": "lkgp8wf",
      "body": "I found the term “complicated grief” helpful to describe conflicting emotions that can happen after the passing of a loved one, a simple term that it’s totally okay to have feelings that might conflict or not match what you “think” you should be feeling",
      "created_utc": 1724913392.0,
      "score": 3
    },
    {
      "id": "lkgrqpm",
      "body": "You got balls and nerves of steel for taking on that clean up process by yourself. Sweet Lord I could never. \n\nTake care of your loved ones closely, and most importantly, take care of yourself. \n\nThis will retain in your mind for a very, very long time. Keep some sort of professional care at reach, you may need it. \n\n\nI’m deeply sorry for your loss here. No one should have to go through this.",
      "created_utc": 1724914975.0,
      "score": 3
    },
    {
      "id": "lkh3qp0",
      "body": "He probably wasn’t thinking straight. If he could read this, or know he would’ve left you with the mess, he may have reconsidered. As someone who has contemplated I know that you’re not in a very rational headspace when you make the decision. I’m very sorry, but it was probably only parts of his mind, not the parts that were smiling and laughing with you in those photos that made the decision and pulled the trigger for him",
      "created_utc": 1724922920.0,
      "score": 3
    },
    {
      "id": "lkh6tgi",
      "body": "I’m so so sorry that you have to go through this. :(",
      "created_utc": 1724924893.0,
      "score": 3
    },
    {
      "id": "lkh6wkg",
      "body": "20? Goddamn, even people years into crime cleaning still get disgusted let alone a normal man, I can fully understand your perspective, after all it ain't your fault yet it became your responsibility ",
      "created_utc": 1724924947.0,
      "score": 3
    },
    {
      "id": "lkozgxe",
      "body": "I haven't read through all the comments, you may not even get to this one. But this may have already been covered. But if it hasn't, I hope it can help. \nI lost 2 of my dearest friends to suicide. Over 20 years apart. The first, he was like my brother. In some ways, my platonic soul mate. We had similar backgrounds of abuse, depression, and helped each other through a lot. In my yearbook, he actually wrote that I had saved his lige multiple times. Because he was already close to the edge and we talked it out. I can't express the guilt I felt at not being able to save him when he did it. \nBecause I was also suffering from depression, I never saw it as selfish. I truly couldn't understand how anyone saw suicide as selfish I had made one attempt myself, so I mean it when I say there is no selfishness involved. In that moment, or in the time leading up to the suicide itself, the person comes to believes some very specific things. \n1. They have no value. Of any kind to anyone. Not only will no one miss them, most of their friends and family will be...if not happy, then at least relieved they are dead. This isn't a passing thought. This has become a fundamental truth. The world will be better off without them in it. In a way, in their mind, they are being selfless. Although that thought isnt usually that clear. To them, they are removing a problem for everyone they love. This has such a hold, any positive words are just being said to be nice and anything negative, even the most diplomatic constructive criticism, is proof they should just move on and be done with it. So when people are trying to tell them they are really loved, no one actually means it in their minds. It's just the social expectation that kaes those words come out of anyone's mouth.\n2. There is zero possibility for the circumstances, the way people REALLY think (in their own minds), or life to get better in any way, shape, or form. If anything, things will only continue to get worse. The best case scenario is things stay exactly the same. Which are already unbearable. So what's the point of going on?\nWhat's important, and extremely difficult for people who have never felt suicidal to remember, is that this is a mental illness. Like a physical illness, it's not something you can wish away, talk someone out of, or even use reason and logic against. A type 1 diabetic can't tell their body \"Hey, I ate all the right foods, did the correct amount of exercise, didn't cheat with a soda do now you HAVE to produce insulin. I don't need the shot!\" A mentally well person can't lay out all the reasons suicide is a bad idea and it get through the mental illness barrier. For rhe reasons I explained above. \nAnd like physical illness, it's not a one shot fix. A type 1 diabetic needs insulin for life. A mentally healthy person can lead a more typical life, but only with the correct treatment. And if that treatment is removed, the illness is still there.\nGoing back to my best friend like a brother, he made a VERY serious attempt in HS. It's a genuine miracle he failed. His mother had a mom moment that saved his life. At least for a while. He got medication and a phenomenal therapist. He was good. For years. Until he aged out of his dad's health insurance. He was still in college, working part time at Target. No health benefits were (or are even now) offered to part time employees in most states. He couldn't afford his meds, therapy, and basically stopped everything cold turkey. So believe me, I'm mad. But not at him. At a health care system made for profit and not to care for people. Mayne I'm wrong, but I believe with my entire being he'd still be here if his care had continued, uninterrupted. \nThis is already so long, but I also want to mention a different type of suicide, although I don't think it applies to you. It's with someone with a terminal illness, usually some kind of cancer. This is specific and almost always done to protect the loved ones of the sick person. They want to spare their family amd friends the pain of watching them suffer and waste away. Especially if they experienced it once already and wa slycky enough to go in remission. I don't have personal experience on this one but I do know that the person isn't usually thinking of avoiding the suffering themselves. To them, its 100% about their loved ones being spared.\nWhat helped me in my personal battle happened at my soul brother's funeral. Seeing all the people that showed up. Seeing their pain at losing him. I realized that people would miss me. And I have never felt suicidal since then. But it took seeing that for me. \nI'm not sharing all of this to tell you not to be angry. What you feel is what you feel. I've said all of this to offer an insider perspective and maybe at some point, you can be open to being angry at the system that fails the mentally ill instead of your cousin. And if you can't, I sincerely hope you can find peace at some point anyway. Because you deserve it. No one should have to live with anger, hate, resentment, etc. Except maybe Hitler or other truly evil people. The can eff off.\nGood luck you 🩵",
      "created_utc": 1725034741.0,
      "score": 3
    },
    {
      "id": "lkc7jct",
      "body": "I’m really sorry, I’m not even going to pretend to understand what you must be feeling but I do relate in a couple of small ways. It was my uncle’s funeral yesterday who was only 45. He had very clearly told us that he would commit suicide the day his mother (my Nan) died. Looks like he didn’t need to because years of poor health got him before either my Nan or her partner went. We had a very strained relationship marred by years of his poor choices and behaviours but I did love him, especially when I was a child - I adored him. \n\nSo I also have all this anger and frustration and love and upset broiling up inside me. \n\nYours is so much more traumatic and I just wanted to say I understand why you’re so angry and I’m not going to tell you any wishy washy ohhh well you can’t be angry he was hurting!!! You CAN be angry, I’d be bloody angry too!!! But you’re going to have to find a way to eventually find the love as well & let go of the anger. But that’s eventually, right now you feel whatever it is you need to feel.",
      "created_utc": 1724852209.0,
      "score": 4
    },
    {
      "id": "lkd0w19",
      "body": "That’s F U get therapy please like yesterday.",
      "created_utc": 1724861438.0,
      "score": 5
    },
    {
      "id": "lkftwkn",
      "body": "[deleted]",
      "created_utc": 1724897881.0,
      "score": 6
    },
    {
      "id": "lkbydkg",
      "body": "While I agree he might have waited a few weeks, I think you are being extremely selfish and self centered honestly about HIS death. Suicide victims are in extreme mental pain and can't think straight, you are making a rant about how his death affected you just, when he literally took his own life just to stop feeling pain? I have been severely suicidal, people in that state are not exactly worried about leaving a mess, they aren't thinking about such trivial things when they are that mentally ill, and if we could choose to die by snapping our fingers non violently not making a mess, we would. You seriously need to grow some compassion for your cousin... You are seriously in that last sentence wishing you could scream at him?!?! If you were on fire physically, you would not be waiting calmly with small glasses of water politely, to put out the fire slowly, you would just be blinded by pain doing anything to stop the pain not thinking about if jumping into a well might splash others. OP is seriously selfish, wishing he could literally scream at a suicide victim, his uncle who just died???",
      "created_utc": 1724848823.0,
      "score": 19
    },
    {
      "id": "lkbqbfl",
      "body": "Thanks for sharing and getting this off your chest. Get all the anger off you somehow in a way that harms nobody. My condolences that you had this mess to deal with. Love and hugs.",
      "created_utc": 1724845453.0,
      "score": 4
    },
    {
      "id": "lkc2hol",
      "body": "Im sorry. Im so very sorry you had to do this. My heart breaks for you. This is something you are never going to be able to forget. If you feel overwhelmed by your feelings please reach out to someone, anyone. Suicide passes the pain of the person committing it onto the people who then have to clean up their life, and it is often a goddamn mess. Your aunt is already broken and this was unfair to her. A kick while she was already down. This was ALSO unfair to YOU. Internet hugs and your family will be in my thoughts.",
      "created_utc": 1724850386.0,
      "score": 4
    },
    {
      "id": "lkc42pu",
      "body": "I am so so sorry you had to deal with this OP.  Loss of a person is one devastating thing but having to put in the physical labor to take care of things adds to the landslide of emotions. I am sorry for your son, for your poor aunt!\n\nOn a personal note, coincidentally, I have been thinking of my cousin who died by suicide a few years ago in his father's newly constructed house. It's his birthday in a couple of days and we were born 3 days apart so I can never go through this time without thinking of him. He was married just a month before he died, and nobody has a fucking clue why. Though it was an arranged marriage, he was keen on it. \nI can only think of the years of depression he had endured after losing his mother really early in life, the lonely years after with a distant dad and interfering relatives in the name of caretakers but he had agency, having moved out of the home country. He was an excellent astro-photographer pursued several hobbies and had loving friends. However he went back home willingly, isolating himself, got married, and then a month later he was just gone. There is so much anger and resentment in the family, his bride widowed so young in a country that is superstious and regressive about that sort of thing. Her family though rightly angry, directed the anger to financially draining my cousin's father. The lavishly built large house sits empty except for the photos of my aunt and my cousin hanging side by side. Everyone blames my cousin for his suicide, I blame his undiagnosed mental illness that he probably hid for years and while I feel terrible for everyone, I just wish he had directed the amount of time he took to plan his suicide (more than a couple of days prep to procure items, cordon off the area etc etc) into talking to someone trusted. Sighh!!",
      "created_utc": 1724850965.0,
      "score": 4
    },
    {
      "id": "lkcneaq",
      "body": "Do you even know why he did it?",
      "created_utc": 1724857323.0,
      "score": 3
    },
    {
      "id": "lkcy9ax",
      "body": "As much as you were confused or \"did not know\" so too same for your cousin.\n\nTrying to be kind when deep down you are angry at life or being put here when you never wanted to be in a world or place like this. ..\n\nI know it hurts, but now take what you feel and multiply it by 100...you may still never feel what your cousin felt. As much as you hurt and are angry, so too, your cousin felt more.\n\nI myself have been in psych ward at least 4 times because of wanting it over.\n\nEdit: to add, I can't say how much help I truly needed. My own parents disowned me and my brother because I found many lies. In order for them to protect those lies. They tell more lies on us and make us look like we are just crazy. \n\nI've come close with a gun...the only thing that stopped was I did not want to do anything in front of my family and my husband had a suspicion and found it missing and after getting it back from me, called the cops to get me help \n\nThat was most recent, but I've also been found trying to hang from a tree, I've tried pills to being jerked away by unseen forces...evey time I tried, I was blessed something or someone stopped me.\n\nBut eventually. That runs out. I'm on 4 different medications and still have to do therapy because of childhood trauma and triggers that happen every day.\n\nWithout help, someone like that will fall....that's why it's pushed so hard for social help. My doctors actually called my parents only to after say \"we don't think being around your parents is a good idea.\" It really felt like they thought I was lying until they spoke to them themselves. And then realized I was completely honest. Happens with every new doctor. \n\nI'm just saying, I personally understand your cousin. And trust me, if it was to be a prick or backlash out of selfishness, your cousin would have thought more.\n\nYour cousin was sick and needed help. And no one was around when that split choice was made....a choice you cannot come back from. I still have days I wonder if my family would be better without me. Sure it would hurt, at first....but would 5hey really suffer or do better without me?",
      "created_utc": 1724860617.0,
      "score": 4
    },
    {
      "id": "lkdqhfx",
      "body": "I am so sorry.\n\nMy father passed away a few years ago.  On his deathbed, doped up on morphine, he started talking through the people he loved in his life.  He got to his father - the father that had taken his own life some 70 years before - leaving my father to find the body and feel the guilt - and leaving the family to decline into deep poverty. My father stopped, cried a little, and chokingly said, \"Dad, I still can't forgive you.\"\n\nJust heartbreaking the damage that suicide does to those left behind. Your cousin was in so much pain that he couldn't think of anyone else. Massively selfish, yes. But try to find a way to forgive. Don't hold on to this anger for the rest of your life the way my father did.",
      "created_utc": 1724869352.0,
      "score": 4
    },
    {
      "id": "lkfyr0x",
      "body": "I feel this so very deeply. My grandma passed away in 2016. I had an aunt (no husband or kids) that lived with her. She couldn’t afford the house herself and the rest of the family wasn’t going to just keep paying on it for her. We gave her a full year to try and find another place to live, no one wanted her to be homeless at all! She instead got too overwhelmed and shot herself in the head in the upstairs bedroom. So while finishing cleaning up the rest of the house trying to get it on the market, we had the added bonus of cleaning this up too. Getting that call from my mother screaming that her sister killed herself is a memory forever engrained. She must have used a small gun as there was only a small hole in her head. I had the fun of confirming that the funeral home hid it well and got to inspect her head because my family wanted an open casket. I do truly miss her but being annoyed at how much absolute pain she caused her siblings barely a year after losing their mom overrides a lot of it. I still get calls of my mom just sobbing over it.",
      "created_utc": 1724899802.0,
      "score": 4
    },
    {
      "id": "lkc6xcl",
      "body": "Did you even think for a second of his suffering outside of your inconvenience? People who think suicide or way its done is selfish, are selfish",
      "created_utc": 1724851992.0,
      "score": 18
    },
    {
      "id": "lkbj8qe",
      "body": "I'm sure you will never understand the pain he was going through.",
      "created_utc": 1724841964.0,
      "score": 22
    },
    {
      "id": "lkcyu0w",
      "body": "The method he chose was the least painful. Be angry at everything else.",
      "created_utc": 1724860791.0,
      "score": 5
    },
    {
      "id": "lkbpr4x",
      "body": "_To preempt any claims that I just don't understand mental health issues, yes, I do. I'm 44. These are just a handful of my professionally diagnosed issues:  Major Depressive Disorder since I was a teenager, Anhedonia (difficulty/inability to feel pleasure/happiness), Anxiety (social and general), chronic pain, and trauma that I'm not going to detail, because it is not relevant. My life is not fun. I very much understand_\n\nThis is awful, and I'm sorry for your loss, and for your impending loss.\n\nYour feelings are extremely valid. Anger at someone removing themselves from life is common and very normal even under normal circumstances where you don't have to clean it up.\n\nI cannot even fathom having to clean that up. This is not something anyone should ever have to do or see. I very much suggest that you seek therapy ASAFP so this doesn't fuck with you later. Seeing bodies can be traumatizing even if they're whole and cleaned up and you don't know them. Being forced to clean up the remnants of a loved one? Yeah, that's a therapy-needing level of trauma. Please protect your mental health, if not for yourself, for the sake of your kids. \n\nYour cousins actions *were* incredibly selfish. Unless your aunt was a horrible abusive monster to him, she didn't deserve this kind of sorrow in her last moments, and doing this to her is profoundly selfish. And doing it in this way is unspeakable; who did he think was going to clean this up? His nearly dead mother? Did he think it was going to be fun for her to walk past a room in her home that held such not and now have it just be steeped in pain? Did he think it was fine to traumatize a loved one with this job?\n\nPoint is, I would also be furious. Your feelings are very valid, and I'm sorry you experienced that.",
      "created_utc": 1724845196.0,
      "score": 6
    },
    {
      "id": "lkbjalj",
      "body": "We don’t think about the mess when we think about offing ourselves.  If I ever get the courage, I’ll be sure to lay some plastic down.\n\nMeanwhile, try to think a little better of your cousin, and also … it’s okay to be angry at them too.",
      "created_utc": 1724841991.0,
      "score": 16
    },
    {
      "id": "lkc1heg",
      "body": "The fact that this post is made out to blame him for the shit you’re going through probably says a lot about why he killed himself. Hope the afterlife treats him well.",
      "created_utc": 1724850008.0,
      "score": 17
    },
    {
      "id": "lkbt9ia",
      "body": "I'm so sorry. The way the police handled this is not ok either and you'd think they had specialist cleaning services to sort this out and also help for the family to deal with the aftermath. \nIt's ok to be angry. And feel however you need to feel. \nI'm so sorry you were left to clear up the mess. I'm not sure I would be able. That's so brave and thoughtful of you as that must be so distressing. Your aunty is lucky to have you. \nThere aren't any words I can say to make your situation any less painful and upsetting. This stranger is thinking of you. Please speak to someone impartial if you feel you need it.",
      "created_utc": 1724846738.0,
      "score": 2
    },
    {
      "id": "lkco2dy",
      "body": "Therapy = priority #1. \nYou are already going through so much. \nProcessing understanding and anger will definitively be forefront priority as it relates to your own growth and health, and that of those around you. I. feel for you, your aunt, and your cousin. My heart is with your family during this. Take care of yourself.  You are counting on you. 😭",
      "created_utc": 1724857531.0,
      "score": 2
    },
    {
      "id": "lkcqshf",
      "body": "I am so sorry for your loss. The grief you and your family were feeling towards your Aunt is understandable yet also incredibly challenging to accept and process. To suddenly lose another member and in the manner he died is a lot for one to have to go through. It is completely valid that you are angry as there couldn’t be any denial considering the scene you walked into in his childhood bedroom. Please take some time for yourself and with your family to process what has happened and will happen soon. We are human beings. While death is part of the natural life cycle to experience it in the manner that you have as of late is beyond what can be expected for a person to handle. Sending you and your family love ❤️",
      "created_utc": 1724858363.0,
      "score": 2
    },
    {
      "id": "lkcyoiu",
      "body": "Fuck man I’m so sorry I know it doesn’t help but it’s okay to feel resentment and anger. It will fade eventually and I agree it was terribly selfish. I hope you find peace eventually in this whole situation and your family will be in my thoughts. I can’t imagine having to clean up a loved one’s brains. You’re a tough one.",
      "created_utc": 1724860744.0,
      "score": 2
    },
    {
      "id": "lkd3og2",
      "body": "I'm so sorry for your loss.",
      "created_utc": 1724862305.0,
      "score": 2
    },
    {
      "id": "lkd3u17",
      "body": "Oh my lord I am so sorry and understand your anger entirely. I truly hope you and your aunt and everyone finds peace.",
      "created_utc": 1724862354.0,
      "score": 2
    },
    {
      "id": "lkd4fmq",
      "body": "My cousin did the same. \nNeed any support from a stranger, feel free to shoot me a dm.",
      "created_utc": 1724862538.0,
      "score": 2
    },
    {
      "id": "lkd6m7c",
      "body": "Thank you for posting this. Increasingly tragic but very insightful. I am sorry for your loss.",
      "created_utc": 1724863229.0,
      "score": 2
    },
    {
      "id": "lkd7y1y",
      "body": "I’m so sorry. There isn’t any other words than those.",
      "created_utc": 1724863639.0,
      "score": 2
    },
    {
      "id": "lkd92oj",
      "body": "I am so sorry for your loss. This is a horrifying and haunting task to have assigned to you, for so so many reasons. I hope you are able to connect with family, spend time with your loved ones, and reach out to a trauma therapist — even and *especially* if you don’t think you need it.",
      "created_utc": 1724863986.0,
      "score": 2
    },
    {
      "id": "lkde3ju",
      "body": "You're allowed to feel angry. Don't hate yourself for it. You'll be able to mourn it just might not be right now. I'm very very sorry",
      "created_utc": 1724865541.0,
      "score": 2
    },
    {
      "id": "lkdgvhn",
      "body": "I’m crying for u this is just awful and I’m so sorry u had to clean up that’s shocking, I really hope u have support and I’m sorry your aunt is poorly such a sad post all round but I’m also angry for u",
      "created_utc": 1724866390.0,
      "score": 2
    },
    {
      "id": "lkdkc39",
      "body": "God this is heavy shit. I'm sorry op. Your anger is valid. \n\nI hope things get easier for you soon",
      "created_utc": 1724867452.0,
      "score": 2
    },
    {
      "id": "lkdupps",
      "body": "Oh bless. Your poor wee auntie. And you, and well everyone involved. \n\nThe police are shite, I’m not surprised they did fuck all for clean up. They are spread so thin good genuine police work is hard to come by anymore. \n\nI’m so sorry you’ve had to deal with this, but please do not feel guilty for being angry. That is reasonable and justifiable. Do whatever suits you best during this process and if you can, try to be some light for your wee auntie during her last few weeks. xx",
      "created_utc": 1724870650.0,
      "score": 2
    },
    {
      "id": "lkdzoyg",
      "body": "I'm mad as hell, too.",
      "created_utc": 1724872234.0,
      "score": 2
    },
    {
      "id": "lke499u",
      "body": "I have no words except that I am so very sorry that you had to go through that. You and your family are in my thoughts and prayers for any kind of solace you can find.",
      "created_utc": 1724873766.0,
      "score": 2
    },
    {
      "id": "lke57yz",
      "body": "I’m so sorry you’ve had to deal with this. I second the commenter who suggested therapy / counselling to process the clean up. I also highly recommend getting one of those cleaning companies out anyway due to the bio-hazardous nature of blood etc. it’s really hard to clean a full room when, like you said, it seems like it gets into impossible areas. Particularly things such as carpet/ underlay/ floor boards as it can get in quite deeply and cause problems later on. Those types of cleaning companies are specialists with the proper equipment and will hopefully be able to provide peace of mind in the future.",
      "created_utc": 1724874064.0,
      "score": 2
    },
    {
      "id": "lke6l8o",
      "body": "I’m so sorry. Your anger is valid. Anger is ok. I had to clean up my bf’s mess after he decided to self delete in front of me. Double trauma for life. 10 years later I’m still angry. I know he wasn’t in the right state of mind but it was selfish to involve someone else. Sending you hugs & healing. Cry. Scream. Yell. It will help you heal.",
      "created_utc": 1724874486.0,
      "score": 2
    },
    {
      "id": "lke7i1e",
      "body": "I thought I clicked on one of the other topics on the front page. This wasn't a good one to read while eating sausage pizza. Ugh. \n\nEither way, so sorry for your loss. I couldn't imagine having to be the person to clean the mess up. I know my husband's aunt chose the same way out, but it was her 6 year old and 9 year old that found her after getting off the bus from school. It was awful and did a number on her kids. Folks can be selfish sometimes.",
      "created_utc": 1724874783.0,
      "score": 2
    },
    {
      "id": "lke7w38",
      "body": "I am very sorry for everything that you have had to go through. Cancer ruins lives. I feel really sorry about your loss - and it breaks my heart that your cousin felt that dying was easier than seeing his parent die. I lost my mum to cancer last year and I can understand how hard it has been for all of you. All I can say is that you have been an amazing brother, and an even more amazing human being. \n\nThere are a couple of IG pages like Untangle Grief, that do a great job at content that addresses grieving. It has given me a lot of solace in tough times. I hope it helps you too.",
      "created_utc": 1724874911.0,
      "score": 2
    },
    {
      "id": "lkeerja",
      "body": "I’m so sorry.",
      "created_utc": 1724879900.0,
      "score": 2
    },
    {
      "id": "lkegjzw",
      "body": "I’m so sorry OP. I hope you’re getting a lot of support & some counseling ♥️",
      "created_utc": 1724880500.0,
      "score": 2
    },
    {
      "id": "lkeq3uq",
      "body": "So much compassion for you.  I wish it were more.  That is terribly unfair.  You are truly an amazing human being to deal with all of this.  I am incredibly impressed with you.  Huge hugs.   I wish it were more.",
      "created_utc": 1724883661.0,
      "score": 2
    },
    {
      "id": "lkezine",
      "body": "I’m so sorry. This is so beyond heart-breaking. You are completely valid for how you feel. Truly speechless.",
      "created_utc": 1724886834.0,
      "score": 2
    },
    {
      "id": "lkf1zkr",
      "body": "You are mourning the loss. Anger is a valid emotion,  and it is a part of mourning.  \n\n*hugs* to you",
      "created_utc": 1724887675.0,
      "score": 2
    },
    {
      "id": "lkf7pfp",
      "body": "I'm really really sorry about this. My condolences...",
      "created_utc": 1724889672.0,
      "score": 2
    },
    {
      "id": "lkf8o77",
      "body": "i’m so sorry for your loss, as well as the fact you were the one to clean it up. it must’ve been absolutely terrible and i’m sorry.\nthe one thing that’s kept me from trying again after two failures was the fear of getting found by my loved ones, my younger brothers in particular.\nhis mental state must have been absolutely terrible, if he was unable to wait any longer. even at my worst, i couldn’t handle the thought. if he did it whilst having a dying mother… it must have been worse than awful.\nyou have the right to be angry. feelings are not a thing you can control (most of the time), so don’t let anyone make you feel guilty about it. it’s a part of grief, and in such a brutal way, after having to clean up the scene, i’d be more surprised if you were NOT angry.\ncondolences to all of you and may he rest in peace.",
      "created_utc": 1724890015.0,
      "score": 2
    },
    {
      "id": "lkff94j",
      "body": "This ripped through me, tore my very soul to shreds. I can't even begin to fathom how I'd hold myself together if I were in your shoes. It’s a raw deal, no doubt about it. Must've been hell, carrying that weight.",
      "created_utc": 1724892404.0,
      "score": 2
    },
    {
      "id": "lkghzns",
      "body": "I'm so so sorry :( you're all in my thoughts, especially your aunt.",
      "created_utc": 1724909012.0,
      "score": 2
    },
    {
      "id": "lkgqrgc",
      "body": "I’d be pissed too. That was extremely selfish of him all things considered. I hope your healing journey brings you peace.",
      "created_utc": 1724914349.0,
      "score": 2
    },
    {
      "id": "lkgrc1z",
      "body": "I am so so sorry oh my gosh",
      "created_utc": 1724914712.0,
      "score": 2
    },
    {
      "id": "lkgsg1p",
      "body": "I hear you OP. That's awful. I am so sorry",
      "created_utc": 1724915431.0,
      "score": 2
    },
    {
      "id": "lkgxv64",
      "body": "These are things that nobody ever talks about. My stepfather didn’t kill himself, but became suddenly very ill and my mom called paramedics and they did their best in their apartment to help him before he passed. She hadn’t been back in a week and I had her wait outside while I cleaned up needles and everything left behind just because I didn’t want her to see it. My father also died before my grandmother and telling her was literally the worst thing ever, far worse than finding out myself earlier that day, and it haunts me to this day. \n\nI’m so sorry for your pain and loss, and I would strongly, strongly recommend therapy as it’s helped me, but I do want to say that you did your family and your aunt an incredible service in this act—even if nobody is going to say it to you.",
      "created_utc": 1724919064.0,
      "score": 2
    },
    {
      "id": "lkhhfq9",
      "body": "I'm praying for you all",
      "created_utc": 1724930655.0,
      "score": 2
    },
    {
      "id": "lkioegt",
      "body": "I understand and I am so very sorry!  My best friend stood in front of a semi truck with her 10 year old son </3   I hate her so much but I love her so much.  People tell me I'm selfish for wanting her to come back because \"I don't know what type of pain she was in.\"  Yes I fucking do.   anyways, hugs.  i'm so sorry.",
      "created_utc": 1724945823.0,
      "score": 2
    },
    {
      "id": "lkisovc",
      "body": "I was a transfer driver for a while (now a funeral director) and there was one time where I picked up a decedent after the ME's cleared the scene, it was a suicide. I told the family that I will come back after my shift and clean up what I could for them. I could have gotten in a lot of shit for that, but I couldn't leave them to clean that up. It's not fair.\n\nThere won't be a next time for you, but if anyone else is reading this, if you are in a similar situation to OP, give your local funeral home a call and ask if they know any cleaning services, or if they know someone who will clean up for you. They might be able to help.\n\nI would be angry too.",
      "created_utc": 1724947106.0,
      "score": 2
    },
    {
      "id": "lkjf1x1",
      "body": ">I wish I could have helped him more when he was here but even more than that I wish I could just scream at him \"if you're going to kill yourself at least do it in a way that won't fuck over everyone who you love and who loves you on the way out. \"\n\n\nI'm so sorry for your loss. \n\nAs someone who has these thoughts sometimes, that part has been a large help in keeping me around. I didn't wanna fuck up my sisters, I didn't want to hurt anyone else. I didn't want my \"last act\" to inconvenience my family and loved ones, no matter how shitty they were to me.\n\nI'm so sorry you had to clean up. I'm sorry you weren't given adequate notice (who the FUCK does that? Cops are sometimes some of the dumbest fucks out here. As if *everyone* knows what to do with a crime scene/crime scene cleaning). I'm just overwhelming sorry you and your family are going through this. I'm sorry you can't spend what little of summer is left with your kid. I hope something magical happens somehow to you guys xo",
      "created_utc": 1724953851.0,
      "score": 2
    },
    {
      "id": "lkju16j",
      "body": "Wtf you need to \"clean\" up yourself ... Really????? Im sorry for you man! Wish you & your Family  alot courage!!!",
      "created_utc": 1724958473.0,
      "score": 2
    },
    {
      "id": "lkjv0q7",
      "body": "I'm so sorry for your loss .it's a terrible feeling you go from anger rage emotional guilt to I have no words to describe it probably for the rest of your life.i still do 25 years later I spoke to my sister my best friend my heart the morning of march 17,1999 at 230 am I was feeding my duaghter she asked what I was doing and I said feeding the baby she said ok call me back I said are you ok she said yeah .I said ok I'll call you back and we hung up I called her back I don't even remember if I told her I loved her but she didn't answer when I called back and the 5 am news came on and they found a body I immediately had a feeling and my phone rang a detective said my sister was gine they ruled it a suicide I still struggle with whether her boyfriend killed her or she did it .I TRULY FEEL FOR YOU THE EMOTIONS FEELING AND TIME DO NOT HEAL THIS WOUND ITS AN EVERYDAY BATTLE .BUT HOPEFULLY MAYBE IT WILL BE DIFFERENT FOR YOU AND HOLD YOUR LITTLE ONE TIGHT .SORRY I rambled and texted in caps this is a horrible thing that I don't wish on anyone ..all my.love",
      "created_utc": 1724958786.0,
      "score": 2
    },
    {
      "id": "lkk34jp",
      "body": "We have a very close family friend whose brother died in a drunk driving accident. It’s been 13 years now and they are all still furious with him. \n\nHe had mental health issues that got better when he took his meds, but he would get on and off of them often. \n\nThat night they were at the bar, and had sent him home bc he was drunk. He ended up driving his truck back to the bar and proceeded to get more drunk. When they tried to take his keys from him he literally bolted and hopped a fence to get away from his friends. \n\nHe flipped his truck into a creek and died instantly. \n\nEveryone there that night now has to live with the guilt of “what could I have done differently” \n\nIt’s also a small town so some of his friends were the ones that responded to the wreck and pulled his body out of the truck. \n\nJust because your cousin died doesn’t mean you don’t get to be angry. He was so wrapped up in his mental illness that all he thought about was himself. He was very selfish. \n\nYou can be mad and miss him at the same time. That would make you a very normal person actually",
      "created_utc": 1724961321.0,
      "score": 2
    },
    {
      "id": "lkk5fzq",
      "body": "My best friend passed suddenly, and the nature of the way he died left… a mess.\n\nI didn’t know it at the time, but his father was the one who did the cleanup. \n\nThe strongest man I think I’ve ever met broke down in front of me, telling me a similar story to yours.\n\nHad I known, I would have done the work in his place. When you hear ‘O.D.,’ you don’t think of anything other than the standard processes that occur at death.\n\nHe fell and hit his sink in such a way that had the fentanyl didn’t kill him, the fall definitely would have.\n\nNo relative should ever have to do that.\n\nI’m so sorry for you.\n\nRelating to your want to scream at him: when I was at the end of my rope and considering loosing myself of this mortal coil, I began scoping places out to do it in a way that would be least traumatic to family and friends.\n\nI was well past the episode and was doing self-care, one of the items being cleaning my car. I drove into the self-serve car wash and as I was soaping it up, I was watching the water go into the drain and thought “there it is. Easy mess to clean up, and no family would be around.”\n\nI don’t know why I shared this. Just know I’m thinking about you, and so sorry you had to deal with this.",
      "created_utc": 1724962023.0,
      "score": 2
    },
    {
      "id": "lkk5ieo",
      "body": "I always wanted to die before my parents and grandparents. I don’t even want to imagine that pain. I get where he’s coming from if he’s lived his whole life without losing someone that close. I get it. He knew he wasn’t mentally strong enough.",
      "created_utc": 1724962043.0,
      "score": 2
    },
    {
      "id": "lkluddh",
      "body": "He should have waited until your aunt had passed.",
      "created_utc": 1724983055.0,
      "score": 2
    },
    {
      "id": "lkmqrxd",
      "body": "My words might not reach you but I wish you and your family can find peace and clarity in such troubling time. From my experience working with suicidal individuals, I believe that their actions don’t make a lot of sense most of the time. Ending your own life is so extreme that it can’t be explained through normal or even “abnormal” human actions. If they wanted to and followed through with killing themselves they probably struggled with something no one was aware of (not even themself). Again I’m sorry if my words don’t mean much but I do Hope you can recover from such had times",
      "created_utc": 1724998389.0,
      "score": 2
    },
    {
      "id": "ll1paoj",
      "body": "I understand your anger. I really do. I get it. The only thing I can tell you is, he probably couldn't survive losing his mama. I understand that, too. I don't condone what he did, or how he went about it. But, I understand the pain and fear of losing one's mama. And while you may have been able to handle such a tremendous loss, and at such a young age, he clearly could not. Some of us are just not strong enough to handle that kind of loss. We just aren't. I have been surrounded by death my entire life, my entire life. But I still fear losing my parents, especially my mom. I've almost lost them countless times throughout my five decades on this planet. From the dangers of illness, to their job, to war, accidents, and so on. So that fear is tremendous. I know that when something happens, at the very least, I will have to be sedated. Because I will not be able to handle it. I'm crying now even writing about it. That's how deeply it affects me. So, maybe that's how your cousin felt about his own mom. Maybe he knew that he would never survive losing her. That's something I understand. I'm so sorry you have to go through this. I'm so sorry you had to be the one. And I'm so sorry she has to bury her son. I really am. I just think his heart couldn't take it and he believed you were all stronger than he was. ",
      "created_utc": 1725224168.0,
      "score": 2
    },
    {
      "id": "ll7704s",
      "body": "God bless you",
      "created_utc": 1725308374.0,
      "score": 2
    },
    {
      "id": "lm26kca",
      "body": "I feel an insane amount of grief, anger, and concern for you and your son—truly. Your aunt’s situation puts this knot in my chest. Wow, I just, I’m so sorry.",
      "created_utc": 1725766658.0,
      "score": 2
    },
    {
      "id": "lkdyb4x",
      "body": "you're not even thinking about how much he must have suffered. stop thinking about yourself.",
      "created_utc": 1724871753.0,
      "score": 5
    },
    {
      "id": "lkf2s0l",
      "body": "I feel angered by the thinking selfish way and focusing just on you. I had someone close in my life that committed suicide and 20+ years I’m still hurting from it. You need to stop and think more about him and his mental state. I get you are hurting. I get you are going through a lot with this sudden death and preparing for aunt to pass as well. It’s a lot on you! But to say selfish is very triggering. I do hope you can find a way to to cope and heal from this. It’s going to take time. Give yourself grace and time to grieve. If you can find a therapist, I highly recommend therapy. I have have gone off and on through my years and only stop mainly because I can’t afford too or I have too much going on that I need to focus on other things. We all grieve in different ways and take different amount of time to move on. I still have trouble 20+ years later. Mainly around the anniversary of that death. This will creep up on you, be kind to yourself. Make sure you have someone close you can confide in.",
      "created_utc": 1724887945.0,
      "score": 3
    },
    {
      "id": "lkbtwc9",
      "body": "When my brother killed himself, I was angry at him for YEARS. Putting our parents, his kids, and the whole family through that was horrible, and horribly selfish. It’s been six years and I am no longer as mad, but if he were here today, I would still slap the ever-loving shit out of him. In your cousins mind, he was doing everyone a favor, because when they are that deep in the depression, they actually think that everyone will be better off after they’re gone, that’s part of the mental fuckery that is suicidal depression. \n\nI am truly sorry for your loss, and letting you know that this anger is valid and you are not alone. Someday this anger will lessen and you will be able to remember the better times without mind-blowing rage.",
      "created_utc": 1724847008.0,
      "score": 4
    },
    {
      "id": "lkbqypf",
      "body": "Sorry for your loss.\n\nDespite how thoughtless or selfish you might see the act, do believe your cousin when he said it was not your fault.\n\nI urge you to get professional help for what you went through.",
      "created_utc": 1724845744.0,
      "score": 2
    },
    {
      "id": "lkbu403",
      "body": "I’m sorry you had to clean up this mess. But yikes. That would be like me killing myself while my dad was terminally ill. I had to stick around for the funeral.",
      "created_utc": 1724847096.0,
      "score": 3
    },
    {
      "id": "lkbyez1",
      "body": "Anger is a totally normal part of grieving.\n\nI'm sorry not only for your loss, but having to clean up afterwards.",
      "created_utc": 1724848837.0,
      "score": 2
    },
    {
      "id": "lkc6jk0",
      "body": "I'm so sorry. My brother did the same: shot himself at home, upstairs in the bathroom, with his 9 year old son downstairs with the nanny. I think he chose the bathroom for good reason: an easy place to clean up. I feel your pain. I know your anger and there is nothing anyone can say to make this better. I had to go and tell my 72 year old mother who'd had a stroke two months prior that our beloved son/brother was dead. Words cannot describe how that felt. All I can say neither your cousin or my brother were in their right mind or thinking clearly. They were deeply and terminally ill with a soul sickness that no-one who hadn't been there themselves, can understand or relate to. Take a huge, heartfelt hug from an internet stranger. I'll be thinking of you all and sending you love.",
      "created_utc": 1724851855.0,
      "score": 2
    },
    {
      "id": "lkchu2o",
      "body": "I’m so sorry for your loss OP",
      "created_utc": 1724855602.0,
      "score": 2
    },
    {
      "id": "lkcj86f",
      "body": "I understand this completely and I didn’t even have to go through any of that my best friend lost his life and a drunk driving accident and I was just pissed at him for getting in that car to begin with because he should’ve known better. \n\nI lost a whole bunch of friends in our group because they just didn’t understand my anger and we’ve never really connected iagain but that’s just how life went for me.\n\nI didn’t have to deal with half what you’re dealing with and i was pissed 😤 at my friend. Best of luck things will get better. ❤️‍🩹",
      "created_utc": 1724856038.0,
      "score": 2
    },
    {
      "id": "lkcnwo4",
      "body": "So sorry for your loss OP. Unfortunately it just seems as though your cousin just couldn’t do it anymore. Feeling angry is normal, so don’t feel guilty about it but remember how your cousin must have felt. I’ve been there, in that headspace, and it’s hard. I hope your aunty, you and your family are okay. Maybe seek some sort of counselling as you should not have had to clean the aftermath of his suicide. There is a reason there a professionals. Again, I hope you and your family are okay.",
      "created_utc": 1724857481.0,
      "score": 2
    },
    {
      "id": "lkcrb2f",
      "body": "Dammit dude,\nYou owe it to your future self and your future partners to talk to someone, anyone, suicide is tough, it impacts a lot of people….. unless your already dying it is just terrible, the last act you do hurts everyone that loves you….. incredibly selfish, self murder……",
      "created_utc": 1724858517.0,
      "score": 4
    },
    {
      "id": "lkbdaii",
      "body": "This is truly heart-breaking. There was a lot of agressiveness in his choice of how (and when) doing it, you are absolutely right. No responsability at all towards anyone but himself. I'm a psychiatrist  and I have seen a bunch of suicides and even being in that extreme situation a lot of people choose to be more caring about who is going to find them (and others act this way, trying to Hurt beyond death). \n\nI don't know if your family is going to say it aloud but Thanks for all the work you did trying to spare the others from the horrible work that had to be done. All the selfishness he casted gets overshadowed by your generosity and effort to take care of others. You are a genuine kind and generous person. I wish you nothing but the best. I'm pretty sure that you are going to be surrounded for life of good and generous people, because people with that kind of light attracts each other.",
      "created_utc": 1724838408.0,
      "score": 7
    },
    {
      "id": "lkdc0w2",
      "body": "I'm so sorry he left you to literally clean up his mess. That was a selfish thing for him to do. But suicide is inherently selfish. I hope you have access to emergency therapy, to help you process the trauma and emotions of this awful experience. I'm sorry for your losses of your cousin as a person, and of your memories of him, which have been tainted. ",
      "created_utc": 1724864899.0,
      "score": 3
    },
    {
      "id": "lkbj020",
      "body": "Why do you expect a person who's about to give up his own life to act in a manner that's fine by you? He would have reached a level of dejection and suffering to have made that decision and even then, you expect him to keep your preferences in mind while committing the deed? It's terrible that you had to clean up everything yourself but don't pin that on him.",
      "created_utc": 1724841834.0,
      "score": 8
    },
    {
      "id": "lkd24xf",
      "body": "I would be so ashamed if I have to type this story out of anger.\n\nGet SOME help",
      "created_utc": 1724861828.0,
      "score": 3
    },
    {
      "id": "lkd9cqf",
      "body": "you are so brave! I am sorry you have to go through this\nmy thoughts are with you",
      "created_utc": 1724864071.0,
      "score": 2
    },
    {
      "id": "lkdq2if",
      "body": "I am so sorry for you and your families loss. I’m sorry you had to clean that  up, that’s traumatic. I hope you and your family find comfort with each other.",
      "created_utc": 1724869226.0,
      "score": 2
    },
    {
      "id": "lkdqjmh",
      "body": "I have a high school acquaintance whose son killed himself in a similar way. He did it and arranged things so that his father would be the one to find him. This dude that I know, the kids father, is really an asshat. I am convinced the son did it this way due to his feelings about his father. I wonder if there could be similar sentiments in the situation you have been dealing with. Also, I am so sorry. I can't imagine how horrible this must be for all of you.",
      "created_utc": 1724869370.0,
      "score": 2
    },
    {
      "id": "lkdxggx",
      "body": "I'm so sorry for you. Completely inappropriate for the corner to leave behind any large pieces, bone or tissue. \n\nYou're completely justified in your anger. \n\nYour cousin must have been in a lot of pain to have chosen to do this to everyone else in such a manner. \n\nMy cousin knew I was very close to became a meth addict in her 40s. \nShe was killed by a train. She and another woman were sitting in the car on tracks. \nWe don't know if they were too high to move the car, or it was suicide.",
      "created_utc": 1724871490.0,
      "score": 2
    },
    {
      "id": "lkf25fp",
      "body": " As someone who has been affected by this, please know that the person who chooses to take their own life is often afflicted with psychosis. They are living in a nightmare and they can’t think rationally, just like when you are in a dream. It may have been a selfish act but it may have been someone blinded by grief, depression, or a chemical imbalance and they had no capacity to make a rational choice. I know how hard this is on you and I wish you the best.",
      "created_utc": 1724887730.0,
      "score": 2
    },
    {
      "id": "lkbeohy",
      "body": "I am so sorry. I would be angry at him too. Your poor aunt. Just show her as much love as you can while she is still here ❤️",
      "created_utc": 1724839286.0,
      "score": 2
    },
    {
      "id": "lkdiyvq",
      "body": "Always best to wait for.the professional cleaners even if there is a backlog. Also could you have done a russ Colombo and not told his mother? Don't feel bad about anger. The stages of grief work out of sync sometimes.",
      "created_utc": 1724867034.0,
      "score": 1
    },
    {
      "id": "lkdwp3a",
      "body": "I'm so sorry OP. I hope you are able to seek therapy for this. It must all be so traumatic for you. Just know that anger is a normal stage of grief that you will eventually get past. Don't let yourself feel guilty for feeling this way. Things must be overwhelming for you right now and you need to take the time for self-care as much as you can.",
      "created_utc": 1724871258.0,
      "score": 1
    },
    {
      "id": "lke7fr8",
      "body": "I’m so sorry you and your family are going through this. You have every right to be angry. It’s ok to feel the feelings you have. I highly suggest going to counseling and to a grief group. What you are experiencing is very traumatic. \nSpeaking from experience, when you are that depressed, you honestly do not feel selfish when you take your own life. You feel like you are helping others by not being here and not being a burden to them any more. \nThose voices we all hear in our heads that help us navigate life turn against when we are depressed/suicidal. They overwhelm you and lie. They have you honestly believing you don’t matter to anyone and everyone will be better if you aren’t here anymore. \nSome people show signs and some don’t. Some signs are so subtle that you don’t see them until after the fact. \nI fight those voices every day. I take medication and in counseling. I know several people are like me. \n\nAbove all, it is no one’s fault. It’s a disease, just like the cancer your Aunt is fighting. We aren’t weak, selfish, or any of the other buzzwords. We are stronger than people realize. Especially those who haven’t been in our shoes. \n\nAgain, you are most certainly allowed to be angry! You need to express your feelings. Don’t bury them to try be strong.",
      "created_utc": 1724874762.0,
      "score": 1
    },
    {
      "id": "lke8l13",
      "body": "Anger is a reasonable response. Take your time feeling it but seek professional help as you’re clearly traumatised by the cleanup and might be for a while.\n\nYour cousin must have been completely desperate to do it like this. He did not think about what comes after for those who stay, he just wanted to stop the pain. As another commenter mentioned, going beyond our survival instinct to do it savagely like this just shows the depth of what he was feeling and how much he was not in his right mind.\n\nI’m so sorry it happened to you.",
      "created_utc": 1724875143.0,
      "score": 1
    },
    {
      "id": "lkej9s8",
      "body": "Hi. First of all I’m sorry for you loss. Being mad is a part of the process when you lose someone to suicide unfortunately (not every time but most of it). I strongly advise you to seek help from a professional because you could develop PTSD after it , not only for cleaning but of course also because suicide is really traumatic for people who stay (I lived it 4 years ago when losing my best friend to suicide too, I wasn’t aware of what PTSD looked like, and wasn’t aware I could have it). As hard as it seems to us, sometimes they just take the first option available. I’m so so sorry you had to go through this.. but really, ask help from a therapist as soon as you can, it’s important 🖤",
      "created_utc": 1724881408.0,
      "score": 1
    },
    {
      "id": "lkelb5g",
      "body": "op, please play some tetris, it’s been known to help with trauma. \n\nadditionally i strongly encourage you to get therapy for this, you will need it.",
      "created_utc": 1724882070.0,
      "score": 1
    },
    {
      "id": "lkh031z",
      "body": "This is messed up. I can understand why you're mad. Your anger is totally valid. I personally am angry at my father for dying and leaving us (he died of cancer) but depression makes people do things they wouldn't ordinarily do. It's a demon that grabs your soul and shreds it to pieces leaving you as a husk. He likely thought he was worthless, that the world would be better off without him. He likely didn't fully grasp how much mess there would be. He just wanted it to be over fast. For the suffering to stop. When something inside you breaks, it takes some Superman level strength and resilience to put the pieces back together. Most people who break like this aren't able to put the pieces back together. It's not their fault, it's not our fault. \n\nMy only advice to you is to forgive him. Don't hold onto this anger, it won't do you any good to be angry, especially when the time comes for your aunt. Be there for her as much you can. Try to remember the good times. You never know when depression will show its ugly face again.",
      "created_utc": 1724920542.0,
      "score": 1
    },
    {
      "id": "lkivjvt",
      "body": "I am very sorry for your loss.  Please talk to a therapist.    This is extremely traumatic and you don’t have to deal with that alone.",
      "created_utc": 1724947982.0,
      "score": 1
    },
    {
      "id": "lkj7onh",
      "body": "My friend.\n\n It's okay to be mad. Your feelings are completely normal and justified. I hope you can get counseling for this, and the loss of your mom. \n\nYou are in my heart.",
      "created_utc": 1724951627.0,
      "score": 1
    },
    {
      "id": "lknc8i7",
      "body": "If it helps at all, he wasn't in a position to think clearly or make good decisions. Those functions were already gone when he did what he did. Mental illness can be silent and stealthy. People can appear to be functioning and capable and that can be a facade for what's really going on inside.\n\n\nI don't think he even considered or was capable of considering everything that would be a consequence of his actions. He probably just desperately wanted relief from how he felt.\n\n\nThat doesn't make your feelings invalid though. He had options to go to an ER and check himself in, ask people around him for help with the overwhelming feelings, call a hotline or get therapy long before it came to this. So yes you have every right to feel frustrated and angry...  but I hope among those feelings you can also find empathy in time. \n\n\nI hope you will consider getting some help in therapy for the trauma that you went through. Nobody should have to clean up their loved one's remains like that and to have to lose more than one person they love so close together. \n\n\nTake the time you need for self care and healing.I am not sure if you have access to this where you live but spending time in natural surroundings can help a lot of people de-stress, like a beach, forest, park, etc. ",
      "created_utc": 1725012280.0,
      "score": 1
    },
    {
      "id": "lkuzwyg",
      "body": "I'm not sure what country you're in, but I don't think you should have been the one to clean it. Praying for you, OP",
      "created_utc": 1725124979.0,
      "score": 1
    },
    {
      "id": "lkyadjw",
      "body": "[removed]",
      "created_utc": 1725172299.0,
      "score": 1
    },
    {
      "id": "llbpaox",
      "body": "Hey i know this is only sort of on topic and it is too late for OP, but: \n\n\nOn the topic of clean up it does not have to be you. The home owners insurance policy covers biohazard clean up like this so you don't have to try to grieve while cleaning up the mess. (You will still have to pay the deductible) Additionally it is best left to the professionals because they can actually get things looking back to normal compared to a regular person.  I'm sorry you had to go through this.",
      "created_utc": 1725379817.0,
      "score": 1
    },
    {
      "id": "lo18p3a",
      "body": "It’s funny how you’re all dismissing the pain he was in just because she has cancer is going to die anyways?\nHis pain isn’t any less valid than hers.",
      "created_utc": 1726831257.0,
      "score": 1
    },
    {
      "id": "m9bdm6v",
      "body": "Reading this just highlights the need for more intervention services and better post traumatic clean up services. You shouldn’t have to clean this. It is a biohazard and therefore you need to get a professional team in to clean and often it’s covered by the home owners insurance and/or life insurance.\n\nThe chemicals the pro cleaners use breaks down the organic material and they use indicator to find all of it enabling a thorough job. They also put down a sealer which acts as a barrier preventing lingering odor. \n\nBe there for your aunt and family at this time.",
      "created_utc": 1737919313.0,
      "score": 1
    },
    {
      "id": "mbdqwqi",
      "body": "People like your brother who only do this for their own sake are fucking losers and I have no sympathy. I'm incredibly sad that you and your mother has to go through this, while she is in the last few stages of cancer, her life even.",
      "created_utc": 1738883171.0,
      "score": 1
    },
    {
      "id": "lkf8e7b",
      "body": "this has got to be one of the most embarrassing posts i’ve seen. calling suicide selfish is selfish. you’re the problem here.",
      "created_utc": 1724889917.0,
      "score": 0
    },
    {
      "id": "lkc2nf2",
      "body": "Man. I’m so sorry OP. I had to clean a family members suicide once as well. It’s something I still think about. Talk to people. Your feelings are valid. It is a selfish act. It passes your pain to others. Spend time with your kiddo and hug them. Sunshine and kid time do wonders.",
      "created_utc": 1724850444.0,
      "score": 0
    },
    {
      "id": "lkc3wnr",
      "body": "Having had the experience of cutting someone down from their… *choice* before, I want to say - sorry in advance for all the people who are going to insist his act wasn't selfish. It was.\n\nSigned, a stranger who is thinking of you, and is wishing you the best healing possible for your circumstances.",
      "created_utc": 1724850905.0,
      "score": -3
    },
    {
      "id": "lkehsfj",
      "body": "My MIL did this. Left spiteful, angry, bitter messages to multiple children, wrote a crappy short suicide letter that left some of her children out and focused mostly on ensuring that the kids kept the house in the family and drained their finances because she wanted it to be an \"heirloom.\" Then shot herself in the head, in her bed, and left her oldest son to clean up the mess. Half of her kids were convinced, by the last things she'd written/left out/sent them, that it was their fault.\n\nSometimes fucked-up people do extremely fucked-up things. That's not an excuse at all, but sometimes when I'm angry, I try to re-shift my focus to remind myself that my MIL, by the end, was kind of crazy. Like, capital-C Crazy. People like that can make really horrible decisions. Doesn't mean you have to forgive your cousin, but it might help.",
      "created_utc": 1724880914.0,
      "score": 1
    },
    {
      "id": "lkdp1jj",
      "body": "Damn…",
      "created_utc": 1724868910.0,
      "score": 1
    },
    {
      "id": "lkj14jq",
      "body": "You deserve to be angry. You did not deserve what he put you through. Over time, this will turn into a sadness FOR him, but don’t try to push yourself into feeling a certain way now. He is so messed up for that. You are feeling the appropriate emotions and you will adapt as the circumstances change and time passes. I went through something similar w my uncle. I was a child and saw him leave with the gun. Did not know he was going to turn himself into splatter. I still feel angry for that little kid. I am so, so sorry you had to go through that.",
      "created_utc": 1724949658.0,
      "score": 1
    },
    {
      "id": "lkc43km",
      "body": "hey OP, my cousin also took his own life two years ago. the pain is still fresh and raw, and I am also very angry at what he did. i’m so sorry, sending you hugs 🤍",
      "created_utc": 1724850974.0,
      "score": -3
    },
    {
      "id": "lkderfi",
      "body": "I am so sorry, that's devastating.\nI hope that image engraved in your mind fades soon.",
      "created_utc": 1724865744.0,
      "score": 0
    },
    {
      "id": "lkci1r9",
      "body": "I'm grossed out and angry for you. Love on your aunt extra hard if you aren't already.",
      "created_utc": 1724855669.0,
      "score": -2
    },
    {
      "id": "lkbvwk0",
      "body": "[deleted]",
      "created_utc": 1724847839.0,
      "score": -7
    },
    {
      "id": "lke9kcx",
      "body": "That's fully understandable, timing aside if he really couldn't bear it anymore the dipshit could have at least blown his brains out in a field or something instead to be courteous.",
      "created_utc": 1724877985.0,
      "score": -1
    },
    {
      "id": "lkbus4z",
      "body": "It's perfectly reasonable to feel angry at someone for committing suicide. It's a very selfish act that leaves those you leave behind in incredible pain.\n\n\nIts disgusting that the police left you with so little help and information about how to clean up though. Don't accept their apologies, go to a newspaper and get it out there - it's the only way they'll really change and avoid putting someone in a similar situation as you through the same. \"Sorry\" over the phone just isn't good enough.\n\n\nYou might want to look into therapy too, an experience like this will have left damage.",
      "created_utc": 1724847377.0,
      "score": -11
    },
    {
      "id": "lkbkhyx",
      "body": "I'm so sorry.\n\nI'm angry for you. Why the fuck would you not just ride it out. I get how painful it is to lose a parent. But fuck me, it's so much harder to lose a child.",
      "created_utc": 1724842622.0,
      "score": -9
    },
    {
      "id": "lkbgvz7",
      "body": "So sorry to hear this. Suicide is the ultimate act of selfishness, leaving everyone else behind to deal with the aftermath.",
      "created_utc": 1724840630.0,
      "score": -30
    },
    {
      "id": "lkbi8tb",
      "body": "[deleted]",
      "created_utc": 1724841417.0,
      "score": -17
    },
    {
      "id": "lkdu0q6",
      "body": "I am very sorry for your loss but I can't rally see him as nothing but a complete waste of space. How selfish is it not to take your life in a way that almost seem desiged to make your cancer sick relative suffer even more. I know that people that kill themselves are usually not in their right mind but I still think that it is no exuse for what he caused to you all. Again I am very sorry for your loss",
      "created_utc": 1724870436.0,
      "score": -2
    },
    {
      "id": "lkbdqtc",
      "body": "This would make for a great book / short story. What a complex situation. I never thought things would be left as is. I knew cops didn’t handle it but I thought they outsourced that type of work, not leave it to the family. Maybe it’s different in every country or maybe I’m just not aware of how this works in my own country. My uncle kill himself recently, can’t imagine having to clean it all up after the fact. I understand your anger and frustration, you’re not wrong for it.",
      "created_utc": 1724838697.0,
      "score": -18
    },
    {
      "id": "lkbzngg",
      "body": "That was really fucking selfish of him, wtf.",
      "created_utc": 1724849318.0,
      "score": -15
    },
    {
      "id": "llc9ujn",
      "body": "[deleted]",
      "created_utc": 1725386378.0,
      "score": -1
    },
    {
      "id": "lkcjwxe",
      "body": "Not even going to comment on the gore scenario. I just think that guy is incredibly selfish. What he did is never ok but the timing seems deliberate, even diabolical. Don't mourn someone like that, be there for person leaving  that doesn't even want to.",
      "created_utc": 1724856252.0,
      "score": -10
    },
    {
      "id": "lkcg6l3",
      "body": "Suicide is a selfish act, in most cases. Don’t be surprised when the person does it in the most selfish manner possible. \n\nI’m really sorry that your family is experiencing this.",
      "created_utc": 1724855079.0,
      "score": -15
    },
    {
      "id": "lkbah14",
      "body": "Thank you. We spoke only a few days before and he seemed normal. We even had plans to meet up this week. I don't know what changed in the couple days after we last spoke, and I wish I had been able to help, but good GOD. So angry at every part of how he went about this, from timing to method to location. My kid already lost his whole immediate family once, and he grew close to my cousin and the rest of his new family over the last couple years. I'm so angry that he would put him through this again. This kid is 9 and has suffered more deaths in the family than me.",
      "created_utc": 1724836500.0,
      "score": 2256
    },
    {
      "id": "lkckr55",
      "body": "aha this. my heart broke reading this. my dad committed suicide this way. no note. no last words. brains n blood everywhere n left a hole in the wall. clothes n floor was soiled. i remember the moment i became angry. i was in shock for awhile at first though. but when the anger came, it was heavy. although, i have healed quite a bit over the past 4yrs. in one perspective, i do see it as selfish. in another perspective, it takes a certain strength to be able to pull that trigger while looking oneself in the mirror (how my dad did), let alone at all. do ppl understand what kind of head space one must be in to be able to take their own life? even if it was a spur of the moment. hm. ofc, grief is grief. i still experience a wide range of emotions on a daily basis due to this, some days are better than others. @ OP, i send my condolences. u aren't alone n i hope ur healing process flows smoother n u cope/grieve in healthy ways.",
      "created_utc": 1724856511.0,
      "score": 86
    },
    {
      "id": "lkbcsee",
      "body": "^^ this\n\nDenial\nBargaining\nAnger\nGrief\nDepression\nAcceptance\n These stages are non-linear and it's normal to go through all of them at different times. There's no true timeline or benchmarks. \n\nAND if you can, seek out specifically EMDR services to address the trauma. That's why Tetris works. Eyeballs moving activates both sides of the brain to get the \"logical\" parts to be able to \"reason\" with the excited part of our brains that's activated in traumatic experiences. Having a trained pro talk/walk you through it can help if you have resources. \n\nI am so sorry you went through that, OP & your feelings are completely valid. You should NOT have been the one to clean that up & all of this is just fucking awful 😞 🫂",
      "created_utc": 1724838076.0,
      "score": 277
    },
    {
      "id": "lkbc9ae",
      "body": "Thanks for the suggestions. I think I'm fine without counselling. The cleanup was mostly unpleasant just because it was *gross.* I'm angry that he'd make that mess on the way out, angry that it became my job to deal with it, and angry that he wouldn't leave a body for his mother, but it wasn't really any additional sadness on top of that of him already being gone. In a way it brought a kind of peace. When I heard that he had shot himself I imagined him in pain, or bleeding out, having time to regret it, but I could tell almost immediately from what I was cleaning up that his death would have been instant. That immediately put to rest all of the horrible scenarios that were floating around in my head.  \n  \nFunnily enough I have been playing Tetris to de-stress between trying to handle funeral arrangements with my uncle.",
      "created_utc": 1724837723.0,
      "score": 293
    },
    {
      "id": "lkbj0a8",
      "body": "Play tetris?  I've never heard of using that to help with grief.",
      "created_utc": 1724841837.0,
      "score": 31
    },
    {
      "id": "lkbkeee",
      "body": "Not everyone needs counseling. It's not recommended that everyone who experienced something traumatic immediately seek therapy. Trauma debriefing is actually harmful. A brief trauma response is normal and healthy. When it is prolonged, that is when therapy is helpful.",
      "created_utc": 1724842571.0,
      "score": 2
    },
    {
      "id": "lkcbbi3",
      "body": "The tetris thing has been debunked",
      "created_utc": 1724853499.0,
      "score": -15
    },
    {
      "id": "llcbh8e",
      "body": "[deleted]",
      "created_utc": 1725386902.0,
      "score": 1
    },
    {
      "id": "lkc7by0",
      "body": "⬆️⬆️⬆️⬆️ THIS.... \n\n\nas a person who had to deal the aftermath of my sibling's suicide by gun. Even with the police stating they don't do cleanup beforehand, it was nothing I could have prepared myself for.\n\n\nI didn't have to clean it since we were able to get professional cleaners, but being in that room and the smell before the cleaners... it still haunts me. ",
      "created_utc": 1724852136.0,
      "score": 95
    },
    {
      "id": "lkeqsf8",
      "body": "I was the first one on a suicide scene after the police recovered the body. I « only » untied the rope from my aunt’s suicide (I was 22), folded the ladder but it still stuck with me. I had to get therapy and EMDR to deal with the aftermath. Couldn’t get the image out of my head, it made everything so real. \n\nI even had nightmares of being in the room with her during her suicide/right after, having to crawl under her and not look. The brain is a powerful machine that is very easily disturbed.\n\nCan’t imagine being OP and cleaning up bits of brain. :(",
      "created_utc": 1724883892.0,
      "score": 50
    },
    {
      "id": "lkh8no5",
      "body": "Yk sometimes you would be having fun Messing around, and then you just sit in bed maybe to rest maybe to sleep and it all just comes rushing back after thinking a bit you forget it for a while and then it just comes back again, tormenting you \nLiving with it and accepting it is possible tho so one can find peace in torment ",
      "created_utc": 1724926003.0,
      "score": 3
    },
    {
      "id": "lkbfsxo",
      "body": "Cleaning up what I did is one thing, but having to do so with it well in to decomposition? Repeatedly? I can't even imagine. Even if it's not got the added discomfort of it being someone you know that sounds absolutely horrifying. I was worried how bad it would be if I left things any longer than Sunday. I have been unfortunate enough to have seen several human bodies well in to decomposition over the course of my life and didn't put much thought in to the person or people who have to clean up the spaces I found them in afterwards. I'm sorry you had to do that, but also thank you very much for saving other people from having to.\n\nI think I'll probably eventually be able to get to a point where I can try to think about what he must have been experiencing to push him to that. This one thing he did doesn't erase a lifetime of closeness, but this anger is just not subsiding at the moment. I can't think of a way he could have done this and caused more damage.",
      "created_utc": 1724839982.0,
      "score": 115
    },
    {
      "id": "lkh8wos",
      "body": "Honestly I respect you all who clean this stuff, having to go through with this just so others don't is quite noble and no amount of money is enough ",
      "created_utc": 1724926154.0,
      "score": 4
    },
    {
      "id": "lkg3k1h",
      "body": "As someone who went through the suicide of a lifelong, childhood friend and have attempted it myself, having to Jackie O your cousin is a repulsive layer of grief that throws a lot of formulas out the window. In complete and total honesty, they should make a suicide prevention campaign showing family members cleaning up after a suicide. Any hint of being a burden in death could at least delay some from happening.",
      "created_utc": 1724901828.0,
      "score": 16
    },
    {
      "id": "lkerkpn",
      "body": "I’m the first to say « people who commit suicide think it’s for the best, or don’t think at all, they just want the pain to stop » but calling them and let them plead is so fucked up. I can’t understand how you can do that and proceed with the killing yourself part.",
      "created_utc": 1724884156.0,
      "score": 32
    },
    {
      "id": "lkd4tjb",
      "body": "EMDR. It's all about the repetitive eye movement. I second this, OP, please play some Tetris, and also try to find a therapist that practises EMDR. You need a session or two. Believe me, it will help.",
      "created_utc": 1724862659.0,
      "score": 36
    },
    {
      "id": "lkdfgr6",
      "body": ">They can’t and don’t think about consequences to their loved ones.\n\nThey usually think that its for best, and that everyone would be better without them in their life, which is never ture, and survivors are left to deal with the consequence, it a moment of selfish grander with no consequence to the person.",
      "created_utc": 1724865958.0,
      "score": 19
    },
    {
      "id": "lkctk9u",
      "body": "I’m so sorry.",
      "created_utc": 1724859195.0,
      "score": 19
    },
    {
      "id": "lkg6r93",
      "body": "I’m so sorry. It’s so hard. \n\nI’ve lost a few family members to suicide - including a cousin who shot himself in the head. His dad, my uncle, ultimately took a similar route a couple years after. \n\nMy mom died in 05 from an embolism, my dad in 06 from cancer and then my cousin in 07. He was 20. \n\nI handled my grief differently. I understood that he had to be suffering so badly in order to do such a thing and instead of anger I felt deep sadness. I was so sad he didn’t feel he had someone he could reach out to and ask for help in those moments. The intensity of those kinds of thoughts and how alone you must feel. I thought he was great and I would’ve sat with him in the darkness had I known. \n\nHe was suffering in a way he felt no one could understand. I sympathize with that. Both my parents died when I was young and people my age especially couldn’t relate to me at all. Older people couldn’t relate to me either. And so, they just didn’t. They all just slowly faded after the funerals and after the mechanics were done. \n\nLife is cruel. Some people make it through and some don’t. We don’t always know a person’s most awful, traumatic event(s) - if one exists. Depression lies and lies well.  Support networks are so important. Community really matters.",
      "created_utc": 1724903268.0,
      "score": 7
    },
    {
      "id": "lkiulo0",
      "body": "This makes me so angry. I'm a funeral director, and when I was working as a transfer driver, I would see those stupid medical \"professionals\" leave wrappers, plastics, bloody sheets, etc. all around the room with the decedent for the family to find. Just made me sick. That's one of the reasons I came back after my shift one time to clean up for a family.",
      "created_utc": 1724947689.0,
      "score": 6
    },
    {
      "id": "lkcrn65",
      "body": "I think some homeowners/renters insurance will pay for a bio company to come in.",
      "created_utc": 1724858618.0,
      "score": 7
    },
    {
      "id": "lkgr5en",
      "body": "Yep. I know that was always a thought when I was considering “options”.",
      "created_utc": 1724914595.0,
      "score": 2
    },
    {
      "id": "lkejv8v",
      "body": "Wow. I'm sorry to hear that. That seems even worse than what I had to deal with. He could have killed those people and just didn't even care as long as he got to end it for himself. That's just awful.",
      "created_utc": 1724881603.0,
      "score": 4
    },
    {
      "id": "lkfy8x5",
      "body": "I'm so sorry for your losses. I lost my grandfather to suicide. I've been suicidal myself. The last time was following very severe post partum depression. I was at that point in the headspace that the world would be better off without me. During a call with my therapist she gave me a statistic (I don't remember the specifics) that a mother committing suicide exponentially increases the likelihood that her children will one day commit suicide. That very thought was just enough to keep me alive.... I had fully convinced myself that my children would be better off without me, but hearing that they might one day be feeling the exact feeling I was having at the time was enough to make me doubt myself! I'm so very thankful I was able to really hear that and that it opened the door for healing in my brain that had almost shut completely. \n\nI hope you have enough healing in your brain to know the world needs you here too 💗",
      "created_utc": 1724899599.0,
      "score": 3
    },
    {
      "id": "lkg5j16",
      "body": "Your first paragraph is so on target 🎯. People who have no experience of that place can’t make sense of it, and understandably so. It’s almost as if nothing is real anymore and everyone and everything looks so strange and uncomfortably foreign. It’s what true loneliness is. Loneliness in pain.",
      "created_utc": 1724902706.0,
      "score": 3
    },
    {
      "id": "lkcb6u5",
      "body": "This is what grief is. It's not simply compassionate sadness.\nIt's also anger, despair, or sometimes you just repress it because you need to function. \n\nMy father died last year in an accident. He fell from the roof. Of course, he didn't intend to die. But he left us suddenly, we barely had time and nerves to organise a funeral. Suddenly, we had a farm to run and leave our jobs to pick up his. All because once again, he didn't use safety equipment. \n\nSo yes, among other feelings, anger is absolutely in there.\n\nI think it's a normal and human response for op. They will grieve the cousin in other ways later. But with all that going on, all the practical stuff to take care of anger will be in there.\n\nMy mother has depression. I have likely have a mild case.\n\nLogically, I understand that someone with severe depression is not thinking right and can't just decide to pick themselves up.\n\nBut every time she would just vanish and I didn't know where she went or if she was at risk I would be so scared. And that made me furious. How could she tell me she loves me all the time and then have me ride my bike around, trying to find her hoping she didn't do anything severe.\n\nPeople with depression are not acting out of malice. But the people around them can't control what they feel either. That is important to remember. It's not your fault for going through it. But it's not their fault either",
      "created_utc": 1724853456.0,
      "score": 21
    },
    {
      "id": "lkixnll",
      "body": "I don't think this is an appropriate time to comment this. This post is not about you, and you're trying to make it about you. OP's loved one is dead and he left himself in a very traumatic way. You are still here. I would suggest making a separate post about your depression and feelings.",
      "created_utc": 1724948614.0,
      "score": 2
    },
    {
      "id": "lke3ehn",
      "body": "Thank you. I am in the UK. My kid's teacher is aware and will be passing it on to all the relevant parties at the school. I tried calling the school but couldn't get through on Sunday or Monday, so I just spoke to his teacher, who lives nearby, in person. I adopted him after the sudden loss of his father, a very close friend of mine, two years ago, so he is already being watched very closely by the school. He has a good group of friends, and knows he can come to me with anything. Thank you very much for the specific terms I would need. I didn't know the term \"Designated Safeguarding Lead\" before your comment.",
      "created_utc": 1724873495.0,
      "score": 4
    },
    {
      "id": "lke4btn",
      "body": "That's awful. I am so sorry that happened to your family. I hope he faced some kind of consequences.",
      "created_utc": 1724873789.0,
      "score": 1
    },
    {
      "id": "lkqjaic",
      "body": "Beautifully worded. Thank you for this🩷 As someone who lost my uncle to suicide and also was suicidal and had suicidal friends I feel this. Some feel anger towards themselves for not being able to stop it. Some feel angry at the person for doing it. I understand that there are different perspectives though I view suicide as neutral (not selfish and not selfless). Anger is a normal part of grief. This post kind of triggered the younger version of myself. But definitely open up to help and it’s good you’re at least typing this and getting it out of your system OP. If there’s something I regret was how I went about dealing with my grief and tried to mask up my feelings. Say how you feel, let it all out.",
      "created_utc": 1725052827.0,
      "score": 2
    },
    {
      "id": "lkfyyxo",
      "body": "We were raised almost like siblings. I was very close to him. I watched my father wither away in exactly the same way just over a year ago and tried now to give him the same support he gave me then. I had even invited him to stay with me but he refused. He would speak to me almost daily though, knowing that I could relate to a lot of what he was dealing with with his mother. There really wasn't a sign that he was doing any worse than you'd expect given the circumstances. I know I'll always wish I could have done more but I know that if he chose to do this there's not really any way I could have stopped him.  \n  \nHe was extremely close to his mother, and my kid, which makes me think that he probably didn't think it through. I know he wouldn't want her to suffer with his passing like she is. I'm realising that it was probably something he did in the moment and won't ever get the chance to take back. I wish he'd just called me up, or come to visit me in person instead. Wish I could have given him a hug at least.",
      "created_utc": 1724899891.0,
      "score": 11
    },
    {
      "id": "lkiyu21",
      "body": "You're not sorry for saying that, and what you just said is so disgusting to say to a person going through grief. There is a time and a place to reprimand people, and now is not one of them.",
      "created_utc": 1724948973.0,
      "score": 2
    },
    {
      "id": "lkc6df0",
      "body": "Totally agree. People can’t seem to wrap their head around how much psychological and/or physical pain someone has to be in to take their own life. The level of complete helplessness or desperation it takes to override our inherent instinct to survive is no trivial thing, and it doesn’t happen overnight. I can speak from experience when I say that depression is like a hot coal, it burns and aches relentlessly. So for someone who is suicidal that ache has become the only thing they can feel, and because none of us can withstand pain forever, they resort to the one thing they believe will end the suffering. Having a loving support system is essential for those who have reached that point mentally, and it sounds like OP’s cousin was about to lose his. Suicide is rarely about malicious intent. \n\nAnger is a completely valid part of the grieving experience, but I hope for OP’s sake that they do seek some sort of therapy for this level of trauma. Walking around with this much rage isn’t healthy for them either.",
      "created_utc": 1724851794.0,
      "score": 21
    },
    {
      "id": "ll2j8y3",
      "body": "I’m a little blown away by this response. I think you’re being way too harsh on OP. This had literally just happened. I could see you reacting this way if it was years later but we’re talking days. Did you miss the part where they had to be the one to clean up their cousin’s blown up head? And they’ve had to watch their aunt slowly die and waste away and now they have to feel her pain from having heard that her own child killed himself. She has to die with the recent knowledge of this. OP is not a bad person for feeling angry about it. It sounds like you need to seriously learn some compassion as well. OP’s cousin definitely deserves it because he clearly was in a severely fucked up mental state to do that. Most suicide victims aren’t trying to hurt anyone and even have the twisted belief that they’re doing everyone a favor. It’s mental illness at one of its most extreme points. Despite all of that though, OP’s feelings matter just as much. Just because they’re still alive doesn’t mean what they feel matters less. What they went through is enough to drive a person to the point of suicide as well. It sounds like they have no training or experience for them to be equipped to take on such a horrific task. I admire them because I would’ve lost my mind and probably left the bits there to rot because I couldn’t handle it. Like you, I’ve also been suicidal. But that’s not a good enough reason to ignore the whole other side of how those are affected in the aftermath of a loved one’s self inflicted death. \n\nI’m kind of shocked how you just brushed past the whole traumatic cleanup process that was described and are basically like “yeah, yeah, suicide victims can’t concern themselves with that.” While that may be true it doesn’t mean people aren’t allowed to feel temporarily pissed off because of it. Wanting to scream at their cousin right now is completely valid and understandable. Do you expect someone to be in a particularly compassionate mood right after having to clean up the fucking decomposed bits of the head of a loved one who killed their own self, an act that has shocked, traumatized, and put the whole family in even more pain? This was an extreme situation and they may be angry for quite some time before it passes. Again, maybe practice what you preach and grow some compassion yourself.",
      "created_utc": 1725235214.0,
      "score": 2
    },
    {
      "id": "lkel5cw",
      "body": "Yes. He was having a hard time with his mother's rapid deterioration. She's the last surviving member of his immediate family. He spoke to me about it for hours on the phone a few days before. We were going to have met up by now to talk about it in person. He mentioned his difficulty with it again in his note. He didn't put it in big bold letters or anything, but I am certain that's the reason.",
      "created_utc": 1724882018.0,
      "score": 1
    },
    {
      "id": "lkeixdr",
      "body": "my thoughts exactly; i was almost more sickened by the attitude OP has about suicide and his family member than by the suicide itself",
      "created_utc": 1724881295.0,
      "score": 11
    },
    {
      "id": "lkd39a9",
      "body": "Least painful for him, not anyone else. OP has every right to be angry",
      "created_utc": 1724862176.0,
      "score": -1
    },
    {
      "id": "lkc9wpv",
      "body": "Don’t you dare ever find that “courage”. It’s not courage. And besides, you don’t really want to die you just want to not be in pain anymore. But plastic wouldn’t help because OP said it was EVERYWHERE.",
      "created_utc": 1724853028.0,
      "score": -5
    },
    {
      "id": "lkelm2p",
      "body": "You don't know a thing about our relationship. We loved each-other dearly and I told him this every time we spoke. The primary reason for him taking his own life was his difficulty watching his mother deteriorate rapidly. He mentioned it in the note, and had spoken about it to me only days before. He was very clear about it being nothing to do with any of us. Out of here with your trying to push any blame on me.\n\nHe made the final thing his mother would experience be his death. He's made it so she might not even be able to die in her own home surrounded by family like she wanted to anymore. She might not even get to go to his funeral.\n\nMy adopted 9 year old grew very close to him over the last two years. He went out of his way to give that kid stability and comfort while he was struggling. We told him all the time how much we loved him, and how much his efforts meant to us. Now he has torn another family member away from this kid who had already lost everybody once before.\n\nHe made it so that I would have to spend hours chipping and scrubbing dry chunks of him off of walls and furniture with a paint scraper right after I read a note saying how much he loved me. Doesn't feel like love. Not a thought given to how that might affect those who would have to go in the room after him. Not just his family, but all the others who had to pass through before me too.\n\nI would love more than anything to be able to be sad about this, but he took away my ability to.",
      "created_utc": 1724882168.0,
      "score": -2
    },
    {
      "id": "lkiozo5",
      "body": "And that's a shame you had to clean it up.  Insurance covers professional clean ups in my country so families don't have to deal with that </3",
      "created_utc": 1724945998.0,
      "score": 2
    },
    {
      "id": "lkjvm5x",
      "body": "And they base it off of a note in her pocket with my phone number that said call my sister of something happens to me ...nevermind the fact of other details that I won't go into but yeah that's what I was left with and identifying her body",
      "created_utc": 1724958972.0,
      "score": 1
    },
    {
      "id": "lkf8fmw",
      "body": "why is this downvoted, it’s true.",
      "created_utc": 1724889931.0,
      "score": 8
    },
    {
      "id": "lkfts5r",
      "body": "OP is blaming the **guy that killed himself**, because he didn't put their needs in front of his? This guy was under so much pressure he killed himself.\n\nSeriously, by OP's tone, I think the \"it's not your fault\"s in the letters were him being nice, because it does sound like such an asshole move.",
      "created_utc": 1724897833.0,
      "score": 4
    },
    {
      "id": "lkyjknt",
      "body": ">I am so sorry for your loss, I really truly am. But am I seriously the only one that is a little bit disturbed by this post? Your cousin ended his life man.... And you've made that about yourself?\n\nYou're clearly not the only one. There have been a few comments like this. I don't get what you people aren't understanding though. I haven't made it about *myself*. Even after having to clean him up, which I am angry that he would leave for us to do, I'm pissed off on behalf of my family. If he had ended his life any other way, place, or time then I would have been able to mourn like I would want to be able to in this kind of situation. Even if I still, for some reason, ended up having to be the one to clean him up.\n\nThis caused the maximum possible harm to everyone we both love and I am left picking up the pieces. It could not have been more hurtful if he had tried. It's hard to feel anything else through all this.\n\n>And youre complaining that you have to clean his body remains up when you would rather be playing catch with your ruddy kid? Dude. Your kid isn't going anywhere man. This is so messed up to me.\n\nMy kid is adopted. Two years ago, at the age of seven, he was witness to the sudden death of his father, his only remaining family member, and one of my dearest friends. Both he and his father wanted him to live with me because I could offer him safety and stability. He was not coping well early on. He barely spoke. These last two years my cousin went out of his way to grow close to him. To comfort him, and to make him happy. I told him all the time how much I appreciated what he was doing, that I was so grateful that he would step in and make such an effort to give this kid a new family that felt present. Seeing him open up over time has been such a relief.\n\nHe tore himself away from this kid right before he's supposed to start school. If you really think that you could sit, like I had to, and tell this nine year old kid that his favourite new family member was dead, and not get angry that you had to put this kid through this loss all over again, then I don't know what to tell you.\n\nWhen he saw his father pass we debated intensely on whether or not it was right to let him see the body before he was buried. After some discussion with friends, social workers, and a medical professional we settled on him seeing his father looking peaceful in a comfortable environment at the funeral home likely being more comforting than upsetting given how he had last seen him. We let him do so, and it did bring the kid some peace. The nightmares calmed noticeably after that. I am happy that we were able to make it so that his last memory of his father wasn't the accident. When I sat him down and explained that my cousin had died he just deflated and accepted it like it was expected. It broke my heart. When he asked if he could see him to to say bye, I had to say that he won't be able to say goodbye the way he wants to. He didn't let it show, and I don't think he has the vocabulary to express it, but I can tell that it upset him. I hated having to rob him of any kind of closure. He's just had another person up and disappear on him.\n\n>Did you maybe think for one moment, in between playing hide and seek with your kid, that maybe he did not have the capacity to deal with the death of his mother?\n\nYes. We spoke about it only days before his passing. I also watched my own father wither and die the same way only a year ago. I know *exactly* how it hurts, and he spoke to me about it often because he knew that I could relate. I offered to let him move in with me, and offered to handle everything in his life for him during this time so he could do whatever he felt he needed to. We were extremely close and spoke almost every day. We were raised like siblings. I don't know where you've got the idea that we didn't deeply care about each-other from. I'd do anything to have him back. Doesn't mean I can't be mad about what he did.\n\n>I really don't want to he insensitive but you don't seem to really be concerned about much to do with the actual matter of someone's tragic self destruction so I doubt you will take this with more than a pinch of salt.\n\nThat's because he is dead and gone. If he were injured but alive I would be a mess. I'd spend every second by his side. But what good would me being a wreck right now achieve? Make his mother's final days even worse and more stressful for her than they already are? Traumatise my kid even more? Work myself in to such a stress that I can't push through the overtime I am forcing myself through nearly every day to pay for almost all of his and his mother's arrangements? They all need me right now, and it shouldn't be like this for any of them. For me either.\n\nI am not religious, I don't believe that he is looking down at me or anything. He is gone, and I would like to be able to focus on being sad beyond belief that he is not here anymore, but I have an entire lifetime to come to terms with that, so can process it later. Instead I am trying to carry my entire family which quickly is sinking in in the chaos he left us right now.\n\nI knew him well, *far better than you,* and can say without a fraction of a doubt that if he could see how distraught his mother is. How quiet my kid has been since he heard the news. Or how stressed and overworked I am handling all of this, he would not think that my anger was misplaced. **He'd be absolutely furious at himself for not thinking this through too.**",
      "created_utc": 1725178274.0,
      "score": 3
    },
    {
      "id": "ll2luvg",
      "body": "You’re ignoring the fact that OP went through something that could very well lead a person to kill themselves and possibly start a whole suicide cluster. I would like to know how you would feel about cleaning the blood and bits of your loved one’s head while also dealing with that loved one’s mother withering away and dying and, as OP pointed out, having one of the last things she does before dying be attending her son’s funeral. They’re dealing with a lot and carrying a massive weight on their shoulders. OP is not just dealing with their own feelings but also their dying aunt and their other family’s feelings as well. I’m sorry but the feelings of the suicide victim are not the only feelings that matter. I am saying this as someone who has been suicidal and has even attempted it once, so don’t tell me I don’t understand. \n\nWhy should OP set aside their feelings when they have gone through a trauma most people won’t have to face? They shouldn’t shove their feelings away, they should acknowledge them and talk about them like they’re doing now or otherwise they might blow up in a similar fashion as their poor cousin. You can’t possibly expect someone to have a benevolent sunshine and rainbows response to a situation like this, especially when it JUST happened! OP has every right to be angry about the very recent task of having to clean up their cousin’s blown up bits. My god, some of you are unbelievable. We can spare compassion for both parties, can we not?",
      "created_utc": 1725236247.0,
      "score": 2
    },
    {
      "id": "lkfag6a",
      "body": "Nowhere did I say that the act of suicide was selfish. Did you read the post, or just the title? If it was just suicide then I would be able to feel the loss and sadness that I want to be able to feel about this. It's the way that he did it that I said was selfish.\n\nIt feels like it was designed to hurt the family. It almost couldn't have been more hurtful. Hard to feel that him writing about how much he loved me was sincere when I am scraping him off of furniture so his mother can come home to die without him while I should be getting my kid ready for school in a week. Hard to read about how the deterioration of his mother upset him deeply and that he wished her a peaceful passing when his actions have robbed her of the one thing she wanted for comfort at the end. He went out of his way to grow close to my kid, who has already lost the entirety of his original family, only to tear himself away. \n\nYou'd be mad too if you were in my position.",
      "created_utc": 1724890651.0,
      "score": 2
    },
    {
      "id": "lkdnqy7",
      "body": "Let the guy just suffer alone. It worked great until then ! It’s never « how bad it must have been for them ? » but always « how dare they leave ME ! » yeah pass time with your kids because one days they are fine then the other day, they are selfish because they suffered for too long and decided to take matters into their own hands…",
      "created_utc": 1724868507.0,
      "score": 10
    },
    {
      "id": "lkc7du1",
      "body": "What a shitty take on someone expressing really difficult feelings.",
      "created_utc": 1724852155.0,
      "score": 1
    },
    {
      "id": "lkc1ka1",
      "body": "I'd argue it's also selfish to expect someone to live just for other's ease of mind.\n\nThat said the way the cousin did it here was. inarguably selfish.",
      "created_utc": 1724850038.0,
      "score": 15
    },
    {
      "id": "lkc9ob5",
      "body": "Bro this is someone’s *life*. I don’t think OP wants to hear “wow what a great story!”",
      "created_utc": 1724852949.0,
      "score": 7
    },
    {
      "id": "lkbe7id",
      "body": "Unfortunately a lot of people make plans they know they won't be able to follow through with. Helps to make people not worry about them. It is possible nothing had changed in those days, he may have already had a gun. There isn't anything you could have done better than what you did. I hope you heal and I hope your family finds peace.",
      "created_utc": 1724838989.0,
      "score": 811
    },
    {
      "id": "lkdpg6f",
      "body": "I understand your anger, my friend. I found my cousin after she killed herself as well. She was more like a twin to me than a cousin, as we were one month apart and grew up in the same household. We even looked alike, and everyone thought we were twins. We were 23 when it happened. I had to struggle to cut her down, try and give cpr even though I knew it was far too late, sit with her body for way too long. I also had no idea, she seemed completely normal and fine. We had gone out for a Canada Day party the evening before and had a great time. It took me a long time to get past the anger. She effectively destroyed our family with that action. Grandparents died shortly after due to increased drinking. Her father, my uncle and second father, has been a severe alcoholic ever since. The rest of the family splintered because they couldn’t deal. It’s a horrible, horrible thing. \n\nI’m 35 now. It’s only the last few years that I can say I’ve actually “got over” the anger of it really. Just be kind to yourself. Allow yourself the anger, and don’t judge yourself too harshly for it. A lot of people will tell you things like, it’s wrong to be mad, it’s not their fault, they were suffering and in a better place etc. That may all be true, but you are also allowed to feel the way you feel. You will process it as you need too. Hugs dude. ❤️",
      "created_utc": 1724869036.0,
      "score": 90
    },
    {
      "id": "lkdtuqb",
      "body": "You should go to therapy tho. Something like that will stick with you for some time. \n\nI cleaned up the room of my former best friend bc she slit her wrists and to this day I have the pictures in my head. This is roughly 10 years ago, I was younger than you are now but still I bet this will do smth with you.",
      "created_utc": 1724870385.0,
      "score": 32
    },
    {
      "id": "lkdnoai",
      "body": "I had a friend in my late teens who hanged herself while her kid was playing outside. \n\nThe kid tried to go in and found the door locked so went to get her aunt who lived close by… so this poor little girl (maybe 8 years old) and my friends sister had to find her, dead and hanging from the ceiling. \n\nHow TF can you do that to your child?! KNOWING they will be the one to find you. \n\nYour anger is entirely justified.",
      "created_utc": 1724868485.0,
      "score": 103
    },
    {
      "id": "lkdzjbg",
      "body": "my uncle committed suicide in 2005 by shooting himself in the heart. he made sure he would be found by his son who was home from college that weekend. he wouldnt have shot himself in the head because he was vain about his looks but i can only imagine how long he laid there aware he was dying before he actually did. i doubt it was instant. my mother is still angry about her brother doing this. my aunt arranged his funeral and everything and the look on her face when the preacher, who obviously didnt know who she was, called her his MOTHER at the service was absolutely shocking. i didnt have all that great a relationship with her but i really wanted to scream at the preacher. she looked like she wanted to join her brother. suicide will just mess your family up.",
      "created_utc": 1724872165.0,
      "score": 37
    },
    {
      "id": "lkez67e",
      "body": "I’m sorry 💔 Your feelings are not wrong.  My mom did the same thing and I was mad about it for a long time. \n\nDon’t beat yourself up.  It will be 25 years this Christmas and I’m actually pretty neutral about it now.  Time heals but the grieving process involved a ton of different emotions.",
      "created_utc": 1724886714.0,
      "score": 9
    },
    {
      "id": "lkddyuh",
      "body": "The way I got through it was, believing that's it was a second of stupid and selfish act carried out when they were at their lowest point.",
      "created_utc": 1724865501.0,
      "score": 16
    },
    {
      "id": "lkg5b9v",
      "body": "I’m sorry for your loss man. Been down a very bad place in my life where I had pushed away all the people who were closest to me and wanted to help me, I still can’t understand why it is that I found it difficult to reach back out to the people extending their arm for me. I understand your grief and frustration with the situation, but please do consider how cornered your cousin may have felt that he couldn’t see a better option than to take himself out. I’m not saying people around him could’ve led him to that, I’m just trying to say that despite being able to see that others want to help sometimes it is possible for one to feel very cornered and isolated. I’m just truly sorry for your loss. I got lucky that my girlfriend and my family were able to drag me out of the hole I had dug myself into (figuratively), else I wouldn’t be able to share this here. I understand how selfish it may seem in your eyes, but please try to see that some of us end up cornering ourselves without a clue as to what to do.",
      "created_utc": 1724902610.0,
      "score": 3
    },
    {
      "id": "lkhrb9w",
      "body": "You will need PTSD therapy ASAP.",
      "created_utc": 1724934907.0,
      "score": 3
    },
    {
      "id": "lkg80mc",
      "body": "It's ok to be mad as hell. A person isn't at fault for having mental health problems, but they are absolutely responsible for their behavior. It's also ok to be pissed at not only the act itself, but how he did it. He could have taken pills or something that wasn't messy. I'm so sorry that you had to clean that up. I used to work in EMS, and I think it's horrifying that families are left to their own devices when it comes to cleaning up a crime scene or death scene. You and your family didn't deserve any of this. It's total bullshit. And I am very sorry for what happened.\n\nI encourage you to find a grief or trauma therapist who can help you with some support in processing your experience. Having to see what you saw and do what you did can really fuck a person up, and it's far better to talk to someone now for some short-term solution-focused therapy instead of waiting. Plus, getting yourself some support now will allow you to be fully present for your son and your extended family. Please take care of yourself.",
      "created_utc": 1724903851.0,
      "score": 2
    },
    {
      "id": "lkgn998",
      "body": "What country is this ? Just curious and baffled they don’t clean up",
      "created_utc": 1724912137.0,
      "score": 1
    },
    {
      "id": "lkiof24",
      "body": "THANK YOU for saying this. So many people still think about the \"stages of grief\" and that they're not normal for what they're experiencing. I work as a bereavement counselor in hospice and even the most \"expected' deaths can be experienced as traumatic. Each person's journey with their grief is their own.",
      "created_utc": 1724945828.0,
      "score": 2
    },
    {
      "id": "lkbxpuo",
      "body": "I know I'm just some stranger on the internet, but please consider counselling, even if you don't think you need it. Just a session or two. If you really don't need it, you'll know for sure after those sessions.\n\nThe brain is really good at protecting itself when we experience traumatic events, which is why you feel fine right now. However, the way the brain protects itself in the immediate term can often cause us problems later down the track. Think of it like a physical injury: your body wants to close that wound ASAP so it doesn't get infected, and the fastest way to do that is creating scar tissue. A scar is better than an infection, but it's best if you get neither.\n\nTalking through what's happened with a professional isn't about helping you to feel OK now - your brain is already doing that. It's about helping your brain to process what's happened in a way that gives you the best chance of preventing that emotional scar tissue from forming and impacting you later in life.",
      "created_utc": 1724848565.0,
      "score": 235
    },
    {
      "id": "lkbdwwt",
      "body": "I will start by saying all your feelings are valid. I would still suggest therapy though, because shock and trauma come back in mysterious ways later in life.\n\nWhen my mother killed herself, it was humiliating. She left the house, took the car and drove to the countryside then took medicine and died looking at the sunset ... on someone else's private property. When she didn't come home, there was a police investigation and it was humiliating, the interrogations, the feeling of having intruded a stranger's property and left them traumatised.   \nI wasn't on good terms with my mother, she was mentally ill and my guess is she wanted to leave in a spectacular way that would make us feel the most guilt and shame for the longest time. At the time, everything went so fast and felt so wrong and gross (her body rotted in mud for 2 days before the police dogs found it), we also refused therapy.\n\nI still think we should have gone because it really is a lot to process, and it got worse for me as time went by. After  a year I decided to move away in shame, but it didn't work, so I moved again. I even changed my name. I think some therapy right after the suicide would have helped a little bit. And maybe our family would have stuck together longer, because we don't talk anymore.\n\nYou sound like a supportive family man and I respect that very much. I am so sory for your aunt and I wish for your family to recover from all this one day and stay strong.",
      "created_utc": 1724838804.0,
      "score": 207
    },
    {
      "id": "lkd07ye",
      "body": "I strongly suggest you seek counseling even if you think you at this time don’t feel it’s necessary. My parent had to clean the fall out from a murder/suicide. They were family members. It changed my parent profoundly. There is my “before” parent and my “post parent. They lived their life with a cloud that never dissipated. For your son’s sake, I can’t plead enough. Their trauma coping mechanisms were passed onto us.",
      "created_utc": 1724861227.0,
      "score": 29
    },
    {
      "id": "lkbgups",
      "body": "Oh, your poor uncle! Losing his son and wife in close succession is going to be so hard. Bless you for cleaning up the mess for them. Anger is appropriate for this situation imho.",
      "created_utc": 1724840610.0,
      "score": 49
    },
    {
      "id": "lkc2vz0",
      "body": "First I want to send my sincere condolences to you and your family. My husband experienced an extremely similar situation when he was 19 and although you feel like you don’t need it now, I would really urge you to speak to a trauma counselor, at least for a little while. I know second hand how difficult it is to process those emotions later in life and I know he wishes he would have seen a professional much sooner than he did once he finally did talk to someone about it all.",
      "created_utc": 1724850532.0,
      "score": 25
    },
    {
      "id": "lkd0xhr",
      "body": "Hey I'm gonna second that you should really, REALLY talk to someone, at least form a clinical relationship with someone you can trust so that when/if this shit does start to surface for you, you have an easier time reaching out.\n\nI have a similarish experience to yours(mine was a roomie I had known for over a decade), and I had to perform CPR while the ambulance came, it didn't matter he was already gone.\n\nLike it changed me, even when I was swearing up and down it wasn't a big deal. Even though it was years ago, when I think of it, I still feel like I'm in that room with him.",
      "created_utc": 1724861452.0,
      "score": 17
    },
    {
      "id": "lkbtmt5",
      "body": "Where do you live? I am surprised that the police and coroner left it there? In the US, they take a body even if it is suicide.",
      "created_utc": 1724846895.0,
      "score": 15
    },
    {
      "id": "lkdzd7m",
      "body": "You wont be okay, I won’t get into detail but i did the same thing you did when i was like 9 years old with my brother (19), when my uncle decided to leave this world, that shit scarred us",
      "created_utc": 1724872092.0,
      "score": 6
    },
    {
      "id": "lketovp",
      "body": "Totally fine if you don’t want to do counselling right now. The only benefit I could see is it could potentially be preventative? I went through something messed up a while ago and the first flashback didn’t come for a week. And then they stayed for a while. \n\nI’m 100% fine with it now unless there’s an exact 1:1 trigger (which is rare thankfully), but I definitely could’ve done with some warning, maybe someone to talk through everything with so some of the thought patterns didn’t hit as hard as they did. I also don’t think I’m completely the way I was either? But I was still basically a kid, so maybe adulthood did it to me lol.\n\nBut if you want to wait to see if you even do develop a trauma response, that’s okay too. Hell, some people never get one. At the end of the day it literally comes down to genetics, personality, and our environment up until the moment the traumatic event happened. \n\nEither way I wish you the best and I’m so sorry for your loss. Your grief and anger are valid <3",
      "created_utc": 1724884865.0,
      "score": 6
    },
    {
      "id": "lkectmz",
      "body": "There's a possibility it will hit you the moment the anger simmers. Please look into counseling if it does hit you",
      "created_utc": 1724879251.0,
      "score": 3
    },
    {
      "id": "lkg97up",
      "body": "You may be doing what I do …… I disassociate during a crisis. Basically just turn off all the messy emotions and feelings until the immediate crisis has passed. Being angry actually helps you do that. The problem comes when those feelings turn back on, because they all come back in a rush. When my cousin died (accident) I was fine until I went back to school. I ended up spiraling into a severe depression. Learn from my mistakes. It was never going to be easy, but it didn’t have to be nearly as bad as it was. Please see a trauma or grief counselor. \n\nI’m so sorry for what you’re going through. Losing someone you love to suicide sucks. You are absolutely entitled to your anger and every other emotion you’re going to feel. Be patient with yourself. There is no way you could have predicted what would happen so you couldn’t have prevented it.",
      "created_utc": 1724904433.0,
      "score": 2
    },
    {
      "id": "lkihvdt",
      "body": "I don’t want to come off rude given what you’ve been through, but those feelings are *exactly* why you should go to counseling/therapy. You keep going on about what he put you through, what he put your kid through, as well as your aunt, and it’s going to stay like that until you find a way to heal. Blaming the person gone is easiest, but never helps anyone",
      "created_utc": 1724943831.0,
      "score": 1
    },
    {
      "id": "lkbkgse",
      "body": "Really, on Reddit?! \n\nIt helps the brain to recover from traumatic events by simulating EMDR therapy.",
      "created_utc": 1724842605.0,
      "score": 104
    },
    {
      "id": "lkbrmom",
      "body": "Less for grief and more for processing trauma.",
      "created_utc": 1724846035.0,
      "score": 23
    },
    {
      "id": "lkh8bmo",
      "body": "Video games are oddly great for dealing with trauma and grief, Tetris itself in general is good for your brain",
      "created_utc": 1724925804.0,
      "score": 3
    },
    {
      "id": "llcwjj7",
      "body": "He had to clean or else someone else in the family would need to take on that responsibility. \n\nI see someone legitimately frustrated by someone else’s selfish decision. How do you know that he didn’t try helping his cousin? More importantly, who are you to cast judgement? Get off your fucking high horse.",
      "created_utc": 1725393628.0,
      "score": 4
    },
    {
      "id": "lkgl3f9",
      "body": "The police should handle the clean up in situations like this :( the family is already going through enough without having to deal with the cleanup. Even if the police were to just make the phone call to the cleaning company, and prevent the family from entering the room, it would protect them from further hurt",
      "created_utc": 1724910804.0,
      "score": 18
    },
    {
      "id": "lkgl8b9",
      "body": "Really hope you're doing okay. I'm so sorry you went through that",
      "created_utc": 1724910884.0,
      "score": 5
    },
    {
      "id": "lkfutpr",
      "body": "First I want to say I'm so very sorry you're experiencing so much loss, it's terrible. If you don't mind, I want to offer a different perspective:\n\nAs a PICU nurse, I have taken care of quite a few kids/teens who attempted/completed suicide. I took care of one particular girl who had hung (technically asphyxiated) herself in a way that would be physically impossible for an emotionally well/chemically balanced person  to perform. The neurologist who evaluated her for brain death explained to me that her mental functioning was so incredibly shut down from depression that her body didn't perform basic, lizard brain, reflexive instinctual actions to keep itself alive/prevent death. \n\nI had been suicidal in my life years before this and has always felt shame surrounding it. Hearing him explain it to me clinically like this shed light on the science behind depression and suicidalality that isn't often discussed. It may seem selfish and impulsive, but it may also be that his brain literally could not protect itself. \n\nIt's okay to feel anger, it's a shit situation that no one should have to deal with. Please consider seeking at least one or two sessions with a professional to help move beyond anger because it can be like a slow poison if not dealt with and it can change you fundamentally as a person.\n\nI am sorry you and your family are having to deal with this, I hope one day you are able to find peace ❤️",
      "created_utc": 1724898239.0,
      "score": 23
    },
    {
      "id": "lkghqzz",
      "body": "I have experienced losses but nothing was so hard to process as losing someone by suicide.  I didn’t witness any of it but still needed trauma therapy.  \n\nThe anger is a big part of what made it hard to process.  You are grieving and feeling a sudden loss that was intentional like a murder but the killer was the person you lost.  It really messes with the mind.  The anger is completely appropriate to be honest.  And all the other circumstances here make it even more so.  \n\nI’ve suffered from severe depression so I thought I’d be able to come to peace with it and sympathize with his pain but I honestly couldn’t.",
      "created_utc": 1724908879.0,
      "score": 5
    },
    {
      "id": "m5ow9ed",
      "body": "Yesss, kinda like how they put sick and dying people on packs of cigarettes. I would support this. 100%",
      "created_utc": 1736168733.0,
      "score": 1
    },
    {
      "id": "lkdke8s",
      "body": "idk i think them being dead is a pretty significant consequence",
      "created_utc": 1724867470.0,
      "score": 15
    },
    {
      "id": "lkg8543",
      "body": "I know.  I'm so sorry for everything you've gone through.  Obviously I know he was suffering.  I'll just never forgive him for not reaching out.   There was nothing he couldn't talk to me about.  We'd grown up together,  got into fights together,  played football together... joked around bare ass naked in the locker room together lol  there was literally no shame or pride standing between us , ya know?   I don't ever think \"I could have done something\" .... I'm not like that and I have accepted there was no way I could have.    I'm literally pissed at him.  I know it's wrong,  but it's one of the few things in my life that I can't let go.",
      "created_utc": 1724903913.0,
      "score": 1
    },
    {
      "id": "lkj8zm5",
      "body": "Our transfer driver & their partner were incredibly kind and helpful. I'm pretty sure they took away some of the bigger stuff for us.",
      "created_utc": 1724952023.0,
      "score": 3
    },
    {
      "id": "lkcwzyq",
      "body": "I hope so. Those kinds of insurances are not always available everywhere.",
      "created_utc": 1724860239.0,
      "score": 3
    },
    {
      "id": "lkd2u8x",
      "body": "Thank you for this. I really understand the presence of anger in grief. It just hit me real hard l, realizing how tormenting my death would be for my loved one. It's more than just guilt, I can't find the words to it.",
      "created_utc": 1724862048.0,
      "score": 8
    },
    {
      "id": "lkk7o7e",
      "body": "Only 4 1/2 years on a weapons charge.",
      "created_utc": 1724962700.0,
      "score": 2
    },
    {
      "id": "m64s8jm",
      "body": "I don't check her often, so I saw your reply 4 months later. I really appreciate your kind words.\nI should have added exactly what you said. That anger is very normal with grief. I hope I was clear that being angry isn't bad or wrong. \nI often hear the selfish mindset with suicide and wanted to offer a different perspective based on real experience. \nMy MIL passed last year from a heart attack and I'm still furious with her. Because she didn't take care of herself, because she ignored all the signs (she was a nurse and knew better). \nI also know grief and all emotions that come from it are not coming from a logical place.\nSo what you said was perfect. Feel what you feel and let it out however you can. \nThe ONLY wrong way to \"handle\" grief is to ignore it. \nIt always catches up.",
      "created_utc": 1736377393.0,
      "score": 2
    },
    {
      "id": "lkj0fuu",
      "body": "I just want to say, I've been reading this thread and I have seen a few comments like that telling you that you're selfish and wrong for feeling the way you do. I just feel like I need to say that they are absolutely wrong, and it is clear to me that these people are the selfish ones with a very narrow view on how people should react during traumatic situations.\n\nI am a funeral director and I see and deal with grief day in and day out. I will tell you with certainty that nothing that you did is out of the ordinary. It is not wrong, or strange, or selfish. What you are feeling and everything that you have written is justified. \n\nThe last thing that people need to hear when they're going through grief is reddit people telling them that they're selfish. Please ignore them, they don't know what you know.",
      "created_utc": 1724949453.0,
      "score": 1
    },
    {
      "id": "lkj4pyd",
      "body": "[deleted]",
      "created_utc": 1724950733.0,
      "score": 0
    },
    {
      "id": "ll2jju7",
      "body": "It’s not healthy but I think it will pass. We have to remember that this is very recent for them. It’s likely going to take some time for the anger to subside because this is a very extreme situation for anyone to be involved in unexpectedly",
      "created_utc": 1725235334.0,
      "score": 1
    },
    {
      "id": "ll31gm3",
      "body": "No, I meant what I said. Him talking about wanting to scream at a suicide victim instead of hugging them is what made up my mind.",
      "created_utc": 1725242469.0,
      "score": 1
    },
    {
      "id": "lkd3sv7",
      "body": "Of course she has. \n\nBut had him used the same method in the middle the woods it wouldn’t have created half of  the trauma or mess",
      "created_utc": 1724862344.0,
      "score": 7
    },
    {
      "id": "lkfwdv1",
      "body": ">The primary reason for him taking his own life was his difficulty watching his mother deteriorate rapidly. He mentioned it in the note\n\nJeez you really have no idea. Things aren't clear like that, it is one thing that pushes you over the edge, but it isn't one thing that puts you on that edge to being with, things aren't as simple as you're trying to make it out to be, and you clearly don't understand the situation as well as you think you do.\n\n>He was very clear about it being nothing to do with any of us\n\nHe literally was thinking about how all of you would feel whilst he was planning to take his own life, and you can't take the time to think about how he felt. That's so generous, I really hope he was being truthful when he said that, but I really doubt he was.\n\n>He made the final thing his mother would experience be his death. He's made it so she might not even be able to die in her own home surrounded by family like she wanted to anymore.\n\nDid you forget the last thing **he was feeling**? Do you know how much suffering do you need to be enduring to have the courage to take your own fucking life? Do you think he was fine? That he was thinking straight? And amidst all of this and he still thought about taking the blame out of your shoulders, do you how selfless you need to be to see through all that suffering and still put something in those letters to support the people you're leaving behind?\n\nSo fucking insensitive, omfg.\n\n>He went out of his way to give that kid stability and comfort while he was struggling.\n\nAnd he's still the bad guy? The fuck is wrong with people.\n\n>We told him all the time how much we loved him, and how much his efforts meant to us.\n\nIt meant so little, that him suffering was enough to make you do all this shitshow of a post.\n\n>Now he has torn another family member away from this kid who had already lost everybody once before\n\nThe kid lost someone, and HE LOST HIS LIFE. Do you understand how painting him, the victim of suicide, as the villain is just fucking absurd??\n\n>Doesn't feel like love. Not a thought given to how that might affect those who would have to go in the room after him.\n\nDo you know what doesn't feel like love? This whole post. He killed himself, and he even thought enough about you to put it in all letters that it wasn't your fault, and you're still asking for him to think MORE about you and less about himself. Do you know that this is exactly what drives people to suicide right? Him killing himself wasn't enough, you're still asking him to do more of the exact thing that took him to this path.\n \n\n>I would love more than anything to be able to be sad about this, but he took away my ability to.\n\nAnd the circumstances, and lack of support network literally took away his **life**\n\nYou're a horrible person, I hope you know that.",
      "created_utc": 1724898850.0,
      "score": 8
    },
    {
      "id": "ll2mf6r",
      "body": "I am so sorry OP. Don’t pay comments like this any mind. They’re ignoring a whole side of the situation and all of its layers and complexities and you don’t deserve that. I know you’re not religious but I will pray you and your family recover from all of this.",
      "created_utc": 1725236468.0,
      "score": 4
    },
    {
      "id": "lkfbe81",
      "body": "i would not. suicidal people do not think of others at the exact moment they’re committing, that’s not selfish. it’s hard to think. your cousin obviously was struggling and you’re angry at him? he literally killed himself. and you’re angry at him. that’s fucking stupid. your the selfish one. pitying yourself when you should be pitying your cousin. i understand losing someone to suicide is super hard, i’ve gone through it with friends and close family members as well, but that doesn’t mean you should be angry at them. that’s the selfish part of this. him leaving an emotional and physical mess is not his fault. don’t blame that on him. that’s terrible",
      "created_utc": 1724890994.0,
      "score": -8
    },
    {
      "id": "lkfwut7",
      "body": "Right? It's *so selfish* that they didn't bottle up their suffering **more** for my sake.\n\nSeriously crazy takes in these comments, and the post is just another level of unhinged.",
      "created_utc": 1724899037.0,
      "score": 4
    },
    {
      "id": "lkcbh2a",
      "body": "This is so weird, I wrote this for a different post entirely. I don't even know what happened. I would never for this post, what the heck Reddit app...",
      "created_utc": 1724853550.0,
      "score": 2
    },
    {
      "id": "lkec8ak",
      "body": "Clearly, all the people downvoting me haven't had to deal with the aftermath of a suicide. I have, in the last two months. It's awful. Taking the easy way out and leaving your family with lifelong trauma, but yeah, sure, downvote me.",
      "created_utc": 1724879046.0,
      "score": -4
    },
    {
      "id": "lkdkufb",
      "body": "People write about their lives all the time...  this memory they’re sharing with us is so intense and such a nuanced perspective most of us will never have first hand. He could write a book about his life and people would feel so much from reading it. My heart goes out to op and to the sick mother.",
      "created_utc": 1724867609.0,
      "score": 2
    },
    {
      "id": "lkbk686",
      "body": "Sometimes it's not even a case of they know they won't follow through, a lot of suicides are done impulsively. Something may have happened that caused him to spiral, and he did it as a spur of the moment thing.\n\nIt's actually one of the main causes of gun related deaths in America, a lot of people will have that bad day, decide to do it, and that's it. I believe if guns weren't so easily available there it would prevent 20,000 suicides a year, or something crazy like that.",
      "created_utc": 1724842453.0,
      "score": 461
    },
    {
      "id": "lkgcur2",
      "body": "Yup my aunt and I had made plans literally 4 hours before she killed herself. \n\nWe had so much planned for weeks ahead. But she knew she wouldn't be there.",
      "created_utc": 1724906240.0,
      "score": 4
    },
    {
      "id": "lkgnk1z",
      "body": "How I felt after my best friend died from a OD I was now key and still am a bit angry at him even though it’s not his fault.. just sucks I don’t have him to talk to anymore",
      "created_utc": 1724912324.0,
      "score": 3
    },
    {
      "id": "lkgnlq9",
      "body": "Ayahuasca ceremonies to the rescue lol",
      "created_utc": 1724912354.0,
      "score": 0
    },
    {
      "id": "lke543r",
      "body": "The whole act of suicide is so selfish and self centered. Not having a mom anyone and knowing they didn't love their family enough to want to see them one more day is just as bad as being careless about where to find the body. \n\nMy friend had a mom who committed suicide. Had one of those rare insurance plans that included it. Even though the  mom was conscientious about what she left behind it really messed up my friend and her brother.",
      "created_utc": 1724874031.0,
      "score": -28
    },
    {
      "id": "lkgpd3a",
      "body": "This was in the UK. They did take the body away, and if there were any larger pieces I suspect they removed those too since I didn't encounter any, so there was some effort made to make it less horrifying at least. I think normally they point you to a professional cleaning service. They were able to do so right away when I asked. The timing in my case just didn't allow for the wait.",
      "created_utc": 1724913466.0,
      "score": 3
    },
    {
      "id": "lke6hrf",
      "body": "I really hope OP heeds your advice. I was \"fine\" for 7 years following a life-altering trauma. It's like a blister; cushioned, sterile, and contained.\n\nBut the tiniest needle prick can break that barrier, exposing the raw tissue beneath.",
      "created_utc": 1724874454.0,
      "score": 100
    },
    {
      "id": "lkc6912",
      "body": "They take the body. They don't do the cleanup. ",
      "created_utc": 1724851751.0,
      "score": 56
    },
    {
      "id": "lkdwpcs",
      "body": "The corner should have taken all body parts. \nThey don't necessarily clean up but they should not have left skull or tissue behind",
      "created_utc": 1724871260.0,
      "score": 6
    },
    {
      "id": "lkbs5me",
      "body": "Studies I’ve read say that you have to do it within hours of suffering the trauma otherwise there’s no real benefit.",
      "created_utc": 1724846265.0,
      "score": 36
    },
    {
      "id": "lkdwt3e",
      "body": "Brilliant! I'm going to try that. I just usually get stressed out when the things start to pile up and I lose.",
      "created_utc": 1724871291.0,
      "score": 2
    },
    {
      "id": "lkh4lcv",
      "body": "It was 4 years ago. It was worth it despite how painful it was, at least it prevented my mum to be stuck with the image after she had to identify her own mother after her own suicide, years prior. She was already completely devastated from the news of losing her only sibling. Guess the urge to protect your parents the way they protected you is strong.\n\nI found myself in a very dark place for a while but I found myself again last year after starting anti depressants, changing countries, jobs etc. Life is finally okay again. Thanks for checking, kind stranger, take care 🦋",
      "created_utc": 1724923468.0,
      "score": 3
    },
    {
      "id": "lkdksp2",
      "body": "Yep thats what they count on.",
      "created_utc": 1724867595.0,
      "score": 9
    },
    {
      "id": "lkcz4iq",
      "body": "I just happened to hear that  the other day.  It really is something that should be handled by a company that knows what they are doing.",
      "created_utc": 1724860881.0,
      "score": 5
    },
    {
      "id": "m66v0b1",
      "body": "Honestly I so agree with what you said in the original comment because to be fair I often hear about the selfish mindset too and I’m tired of it- it often triggers me (not as much as before but still a bit) to be honest so seeing your comment was a breath of fresh air. Also don’t worry about it- your comment was perfectly clear that being angry wasn’t wrong too. Sorry to hear about your mother in law btw",
      "created_utc": 1736406887.0,
      "score": 1
    },
    {
      "id": "lxeebnp",
      "body": "The people criticizing OP are not wrong and I am not sure where you source the confidence from which you assert as much. I found this post via searching for another topic with similar keywords and the content disgusts me, OP's comments disgust me. The hypocrisy is also outstanding- but hey, at least OP gets to defend themselves..endlessly, unlike the deceased. It is a wonder how people like you offer compassion toward such a remarkably selfish display of grief (what you're labeling as grief anyway) while simultaneously chastising a dead person for acting out of grief in a way *you* deem selfish.",
      "created_utc": 1731741106.0,
      "score": 1
    },
    {
      "id": "lkj5saz",
      "body": "It is not about who \"needs my prayers\" more, and it is not about who you feel sorry for. Nobody cares who you feel sorry for, or who you want to extend your prayers to. It is about not making someone feel worse than they already are during a time of grief. You are trying to make someone feel even worse during a time when they sought out some comfort, just because you couldn't help but vocalize your feelings.\n\nFeel the way you feel, that's fine, but keep it to yourself. OP doesn't need this.",
      "created_utc": 1724951055.0,
      "score": 2
    },
    {
      "id": "ll38q7p",
      "body": "Like someone is going to be in the mood to hug someone right after the horrific cleanup they were forced to go through. You clean up someone’s brain matter while you’re already dealing with a dying family member and an adopted child who had recently developed a trust and attachment to OP’s cousin, then tell me how you feel right afterwards. You’re missing the full picture. I don’t know if you’ve seen some other things OP has shared that shed further light on the awful situation they’re in but whatever. Go on and have a one track mind and limited view",
      "created_utc": 1725245508.0,
      "score": 1
    },
    {
      "id": "lkgb1xk",
      "body": "Man I'm glad to know that there are people who understand the suicide victim's suffering. It's sad to know that people like OP are rife in this world but the existence of people like you give me a little hope in humanity.",
      "created_utc": 1724905331.0,
      "score": 4
    },
    {
      "id": "lxef7f3",
      "body": "Thank you. I came across this post and your rational and empathetic comment (toward the deceased) is a salve for the absolutely ludicrous takes supporting OP at the expense of a person-their memory-who doesn't even have the option to defend themselves any longer after reaching that delicate point of suffering..and who, by all accounts from OP themselves, was an exceedingly decent human being whilst alive.",
      "created_utc": 1731741650.0,
      "score": 2
    },
    {
      "id": "lkkj646",
      "body": "I think you are saying this only because you are on the wrong side of perspective. At least in this case... OP thinks about everyone, unt, kid, cousin... The Cousin has thought only about himself... And he hasn't lost his life, he TOOK it. He did it on purpose... Even dead people suffer consequences. Alive even more and it is even not their fault.",
      "created_utc": 1724966249.0,
      "score": 1
    },
    {
      "id": "lkgrf8n",
      "body": "Ever heard of the 5 stages of grief?",
      "created_utc": 1724914768.0,
      "score": 4
    },
    {
      "id": "lkbqcdv",
      "body": "This hits home. Decades ago, I struggled horribly with poor mental health. One day was particularly bad when I got up, ran to the gun my bf had in the closet, and alllmost got it to my head before he snatched it out of my hand. The impulsiveness was crazy... no forethought what so everrrrr. By the grace of whatever god there is or just dumb luck, I didn't blow my head off...Or worse because had he been a split second later, I'd be done for. I couldn't even tell you what set me off that particular day either..my crazy brain was in control of my body and I couldn't stop it. I refuse to have any gun in my house now..I still don't trust myself 35 yrs later.",
      "created_utc": 1724845465.0,
      "score": 306
    },
    {
      "id": "lkbzaix",
      "body": "This 100%, plus the main post, is the reason i didnt die when i was still in hs. It was just an awful month but i wasnt impulsive, and I just couldn't figure out the best way to go without causing more trouble than i thought i was worth.",
      "created_utc": 1724849180.0,
      "score": 84
    },
    {
      "id": "lkcu2kv",
      "body": "That's why \"most gun deaths are suicides\" isn't the anti-gun-control argument I think people assume. Yes, they are. And a gun makes it very easy to make a split second decision and carry it out before you've had time to calm down. I've been at the bottom of an anxiety/depression spiral. When it's that bad, you are not yourself and not in your right mind, and that weird feeling of rage is overwhelming.",
      "created_utc": 1724859350.0,
      "score": 118
    },
    {
      "id": "lkd3p43",
      "body": "The call of the void.  It’s crazy.",
      "created_utc": 1724862311.0,
      "score": 22
    },
    {
      "id": "lkf0amq",
      "body": "I had a gun in my twenties. I’m thankful I sold it because there have been a few times in my life where I might have used it on myself if it was there. I’m not suicidal by any means but like you said… impulses can get the best of people.",
      "created_utc": 1724887102.0,
      "score": 6
    },
    {
      "id": "lkh7btx",
      "body": "Exactly, it almost like addiction, it can be controlled m but if the substance is easily accessible abolishing it becomes hard  With a rope or whatever you have to prepare it and think about it and most end up backing out of it , but a gun? Put it in your head and you are no more, just a bloody mess for someone to puke at  You don't have to think much about it you just pull the trigger, which just makes impulsive episodes much more dangerous death shouldn't be that easy",
      "created_utc": 1724925210.0,
      "score": 3
    },
    {
      "id": "lkh99ed",
      "body": "Funny that you mention that as I hadn't considered it that way.\n\nI'm in the UK and would like to own guns for recreational purposes like shooting in a forest or target practice but I know if I ever did own one, it could just be one bad day like you said and I know I'd end everything in a second.  \n\nFor that reason I'm glad they aren't so easily accessible here",
      "created_utc": 1724926364.0,
      "score": 2
    },
    {
      "id": "ll4q812",
      "body": "Wtf, no it wouldn't, they'd just do it another way. ",
      "created_utc": 1725276788.0,
      "score": 0
    },
    {
      "id": "lkf83zt",
      "body": "No doubt suicide leaves behind a lot of pain. The decision isn’t necessarily made out of selfishness though. A lot of people who want to kill themselves think everyone will be better off once they’re gone.",
      "created_utc": 1724889816.0,
      "score": 19
    },
    {
      "id": "lkeinv5",
      "body": "Could've left that first sentence out, my guy. You just look like an asshole now. Didn't read the whole thing cause that first sentence is incredibly fucked up.",
      "created_utc": 1724881207.0,
      "score": 16
    },
    {
      "id": "lketn2x",
      "body": "Yeah, i had to put down my dog* earlier this year because of cancer and kidney failure. Watched it as well as i was going through a bit of a depressive episode again as i felt like i had no feelings or was \"dead\" inside. That psychologically scared me instantly and thought of death really lingered with me. Even now i can still remember a lot of it and what i told my parents when i got home. So now about a week ago when i thought of my grandfather who passed away 3 years ago it really hit me hard. Harder than back then thanks to this event. Then again it was good for me as i now appreciate life as much as i did when i was a kid. It also helped me to feel like myself again for the first time in nearly 6 years. \n\nExcuse my rambling. Just needed to vent out some of my thoughts even though I went way off topic. Point is, get counselling or therapy just as a safety measure.\n\nEdit: My aunt also committed suicide during the height of covid and she was always supportive of me and with tennis. So finding out she jumped infront of truck whilst my dad seeing it on Twitter but unaware it was her until the following day haunts me a little too. Fortunately i didn't see anything so i was less traumatised by it including me being extremely depressed and already cried my tears back in June the same year after dreaming and sensing it, 3 months prior mind you.\n\nEdit 2: Typos galore, must have really been digging deep  when i typed this.",
      "created_utc": 1724884848.0,
      "score": 13
    },
    {
      "id": "lkfxxrt",
      "body": "Brain vaporizes when hit by gunshot/shockwave. There IS no such thing as “leaving no skull or tissue behind.”",
      "created_utc": 1724899475.0,
      "score": 4
    },
    {
      "id": "lkbvaxe",
      "body": "Correct re. Tetris however at the end of the day, it still mimics eye flickering therapy and that is used beyond the first stage. Better than nothing if you're not indulging in the full form of therapy imo. \n\nPlus, it keeps someone engaged and gives their brains something else to think about which in my personal experience of trauma, counts for a lot.",
      "created_utc": 1724847593.0,
      "score": 39
    },
    {
      "id": "lkciggp",
      "body": "It’s within 48hrs",
      "created_utc": 1724855798.0,
      "score": 12
    },
    {
      "id": "lkd330w",
      "body": "Now that I agree with , it should be handled by such a company.",
      "created_utc": 1724862122.0,
      "score": 2
    },
    {
      "id": "lxnpzmx",
      "body": "I get my confidence from working funerals and dealing with grief all day every day 😂 just because you suffer from black and white thinking doesn't mean everyone else does.\n\n\nI hope your comment made you feel better, and I hope that you had a fantastic day - searching keywords and hate-reading posts and comments, seeing as that's all you're good for.",
      "created_utc": 1731880577.0,
      "score": 1
    },
    {
      "id": "lxefaer",
      "body": "Agreed.",
      "created_utc": 1731741703.0,
      "score": 1
    },
    {
      "id": "lkeqgkp",
      "body": "You get into a depressive episode like that there is some sort of chemical imbalance in your brain, and sometimes that balance can shift for better or worse extremely quickly. \n\nMy suicide attempt happened when I was on the upswing out of my depression. I'd had a good day, played with my dogs, bought myself a new sweatshirt....took a shower, started feeling dull, then sad, then pathetic and broken, and within two hours from feeling decent I took poison. \n\nI realized that I hadn't made a plan for my animals care after I died, so I went to the hospital and told them what I had done. Couldn't leave my soul dog without a plan, she saved my life. \n\nTo this day I am convinced something chemically wrong was happening to my brain, looking back it was like I was in a spell, like sure I had depression but this was *something else* so sinister and I couldn't shake it. And it went away pretty damn quick, I've never felt it since. \n\n\nMy heart absolutely breaks for OP. The world is unbelievably cruel sometimes.... Nobody should have to clean up their loved ones remains yet it happens all too often. I had a good friend die many years ago at the hands of her boyfriend in a similar fashion, and her mom was the one that had to clean the house...",
      "created_utc": 1724883780.0,
      "score": 143
    },
    {
      "id": "lkf3ojs",
      "body": "I’m glad you’re still here, my friend",
      "created_utc": 1724888258.0,
      "score": 16
    },
    {
      "id": "lkgnf4b",
      "body": "Yeah I almost shot my self years ago thankfully it just grazed me but it was so scary. I still sometimes wake up wishing I was dead and fight those tendencies but shits real, I’ll never forget almost ending it",
      "created_utc": 1724912239.0,
      "score": 3
    },
    {
      "id": "lkes1gy",
      "body": "Sorry if i ask but are you guys still together or unfortunately/fortunately not?",
      "created_utc": 1724884314.0,
      "score": 2
    },
    {
      "id": "lkj8f8g",
      "body": "Can second this.  It's the reason why I demand that all of my husband's guns are always in a safe and that the spare key and knowledge of the combo is given to our roommate instead of me.  I've tried to kill myself a couple of times and the big thing that stopped me is that I didn't have an immediate delete button - I know that all it would take is access and one bad day for me to make a decision that none of us would be able to live with for the rest of our lives.\n\nHe didn't believe me that it was that bad until I hit a major downspiral and he caught me, almost in a fugue state, trying to hurt myself.  \n\nThankfully I'm doing a lot better mentally now, but I don't think I'll ever be able to fully trust myself.",
      "created_utc": 1724951851.0,
      "score": 1
    },
    {
      "id": "lkf3xea",
      "body": "I’m very glad your imagination failed you at that moment. Big hugs for being so strong and getting through it",
      "created_utc": 1724888345.0,
      "score": 12
    },
    {
      "id": "lkecjo6",
      "body": "That's why when people point that out I just tell them: it could have been prevented too with stricter gun laws.\n\nNow I'm of the opinion it's too late because guns are everywhere",
      "created_utc": 1724879155.0,
      "score": 23
    },
    {
      "id": "lkczeks",
      "body": "💯",
      "created_utc": 1724860969.0,
      "score": 14
    },
    {
      "id": "lkh7wej",
      "body": "Guns will always end up causing something horrible if not regulated well, my country turned from one that had many guns in different households because of the revolution against France to one where guns are more rare than gold, why ? Terrorism it hit bad and hard, right now most cases of suicide are drugs related because over the counter drugs aren't that hard to get",
      "created_utc": 1724925552.0,
      "score": 3
    },
    {
      "id": "lkh80ac",
      "body": "Sometimes a bad day can you make you feel worse than trash, and then suddenly tomorrow it all sunshine ",
      "created_utc": 1724925616.0,
      "score": 1
    },
    {
      "id": "ll4zmqj",
      "body": "Did you miss the part about suicides being impulsive? Some people do plan out killing themselves, but a lot of suicides are spur of the moment decisions. It's estimated that *those* types of suicides would be reduced by 20,000 a year in America if guns weren't so common. This is because those people wouldn't have a way to kill themselves *immediately*, and the chances of them changing their mind goes up quite a lot, as well as the chances of people stopping them/saving them if they do attempt it by another method.",
      "created_utc": 1725281195.0,
      "score": 1
    },
    {
      "id": "lkffz67",
      "body": "“Something sinister” is the absolute BEST description of a depressive episode I have ever heard",
      "created_utc": 1724892670.0,
      "score": 45
    },
    {
      "id": "lkerool",
      "body": "I'm glad you're here❤️",
      "created_utc": 1724884194.0,
      "score": 51
    },
    {
      "id": "lkjdxjy",
      "body": "If it helps, upswings from very bad depressive episodes actually can have that dangerous moment for understandable reasons, so it is possible to know what is happening in the moment. It’s not that you start getting better and then suddenly drop down worse, it’s that you start getting better and you gain some energy back.  Making an attempt requires a massive amount of energy on a mental level, and in your lowest low you simply don’t have that. In this scenario, you hit the point where you’re capable of it specifically because you’re getting better. This is why a doctor may tell you to watch out for increased suicidal ideation when you first start antidepressants.\n\nI’ve personally pushed past this, and advised others on how to push past it, by ingraining the idea of waiting 24 hours before going through with anything. Once you’ve reached the point where you’re sure you’re going to do it, what’s one more day? Why even care about what happens during that day, and if you can manage it, why not do some small nice things for yourself “one last time”? You’ll feel like waiting a day is pointless, stupid, and won’t change anything, but then you don’t really have a reason to NOT wait that day. Might as well. This works when you’re not on an upswing as well, but it’s also shocking how quickly and how drastically you just start feeling good when you are getting better.",
      "created_utc": 1724953514.0,
      "score": 1
    },
    {
      "id": "lkhfljv",
      "body": "It's so scary. I'm glad you're still here..🩷",
      "created_utc": 1724929772.0,
      "score": 2
    },
    {
      "id": "lkf7i0n",
      "body": "We're not. It was a really bad relationship.",
      "created_utc": 1724889598.0,
      "score": 4
    },
    {
      "id": "lkh081h",
      "body": "I refuse to give up on the idea of gun control. They can be confiscated and melted down.",
      "created_utc": 1724920635.0,
      "score": 7
    },
    {
      "id": "lkfi6e2",
      "body": "I'm not religious at all, but I can see how believe in spirits and possession became a way to try and explain things like this.",
      "created_utc": 1724893475.0,
      "score": 22
    },
    {
      "id": "lkexf8p",
      "body": "Thank you 💚 I'm also glad I am here, mostly. I lost my soul dog last January, she was the light of my life, but I'm doing well these days rescuing other animals in her honor.",
      "created_utc": 1724886116.0,
      "score": 58
    },
    {
      "id": "lkiwkt5",
      "body": "Glad that you are no longer in that situation.",
      "created_utc": 1724948293.0,
      "score": 1
    },
    {
      "id": "lklligc",
      "body": "You can’t place logic on the illogical. \n\nWhen someone acts out of character, it’s easier to blame an outside source than to admit there was an underlying medical reason.",
      "created_utc": 1724979709.0,
      "score": 3
    },
    {
      "id": "lkf0pfr",
      "body": "Dogs are the best. I’m positive mine had saved me, or I should say kept me alive, more than a few times.",
      "created_utc": 1724887239.0,
      "score": 26
    }
  ]
}