{
  "id": "1fcfzyk",
  "title": "UPDATE III: I think my husband fathered his best friend's children, and now one of them is attracted to my daughter. ",
  "selftext": "First, a few points to answer from the comments. \n\n\n\nI don’t have any DNA test results back yet. That can take weeks. But now that I know Sophie is in no danger of dating a relative, the pressure is off. I’ll get into this momentarily, but, it frankly no longer matters if Luke fathered the children. \n\n\n\nI highly, highly doubt my father-in-law is having an affair with Amy. At worst, he might know (or even just suspect) the truth about Amy and Luke. But it’s also possible that he just refuses to believe they would do such a thing. I’ve been vague about details for privacy, but to put it very simply, Jim and Amy are both pretty white. Cat and Luke are not. Had Jim fathered Amy’s babies, they would look different than they do. \n\n\n\nNevertheless, I do have an update. While a stream of comments have called me spineless and naive, called me a “sister wife” (as an ex Mormon, that hits a particular nerve)  and most recently, a stream of comments have said my story is fake (fair enough, it’s the internet, but Luke is not the first scumbag husband to have two families.) Several other comments have been incredibly kind and supportive and I really appreciate that. Apologies if I haven’t responded to a comment or direct message that you sent. I covered as many as I could but I was literally getting hundreds, so I definitely missed several of them. \n\n\n\nFirst thing’s first. I discussed this in the comments, but our little “team” has (supposedly) recruited my mother in law. I say “supposedly” because Sophie and Tom were going to talk to her about getting help with submitting the DNA test and, at the advice of my lawyer, I am staying out of the process. Officially, I told Sophie not to do it, and she said she wouldn’t. MIL hasn’t contacted me about it either. (Though we have been in touch, I’ll get into that more in a moment.) The bottom line is that I can honestly say I had no knowledge of any DNA test. Loophole city. \n\n\n\nAnother bit of good news. I was digging through the paperwork in preparation for my divorce, wanting to get a head start against Luke, and one thing that came to my attention is that my name is on the paperwork for our home. Luke’s name is not. I was the one who bought the house and we always planned to add Luke onto the paperwork at some point, but we never got around to it and eventually the idea was forgotten. It was my lawyer, “Paige” who pointed this out to me, and it was like finding a winning lottery ticket on the ground. I don’t know where I’d be without Paige. She’s a dear friend from college who I reached out to, hat in hand, for help. She’s been there for me this past week not just as legal counsel but as a friend I really needed right now. \n\n\n\nThe thing is, she’s not “our” lawyer, me and Luke. We have our own “family” attorney who has helped us out of jams in the past (we clashed with our HOA a few years ago, not worth getting into right now) but Paige is a lawyer who specializes in family law and has handled divorces before. Luke remembers her from college and knows she went into law but doesn’t know she’s a divorce attorney. So I can have her over for coffee like we’re “catching up” and he has no idea anything is going on. Turns out, he’s not the only one who can harbor someone under his spouse’s nose under the guise of being a “friend.” \n\n\n\n**So. Onto the update…**\n\n\n\nThe last time I looked in Luke’s phone was three months ago, around the point Sophie and Tom began to go around claiming they wanted to date. I found nothing. While I know how to search for recently deleted photos and didn’t see any, my comments taught me how to find recently deleted messages. So, when Luke was asleep, I did just that. Swiped his phone and brought it downstairs, checked recently deleted. I am glad I did but I also wish I had not, because I’m still reeling from the pain. Sure enough, a conversation with Amy had been deleted. Recent texts talking about the conflict between her and me, with Amy describing me as a “problem” and Luke trying to pacify her - without defending me at all, to be clear. They both alluded to how they had “expected” this for a while and just hoped it would never happen - presumably me accusing them of having an affair. While the whole conversation and the fact that it was deleted was sketchy, nothing was actually admitted. So I scrolled a bit higher, to a few days before the fight. Amy’s messages got a bit more flirty. Then. I saw it. Five days before I confronted them, Amy had sent Luke a topless pic. A selfie with no shirt or bra. \n\n\n\nGuys, I teared up. I knew it was true, I knew it in my bones, but seeing the proof still cut me like a hot knife. (Doesn’t help that Amy’s always had bigger breasts than me.) I exited the messages app and checked Luke’s recently deleted photos. Sure enough, the same selfie was there, and others. Amy topless, Amy naked, in various poses to show off. There were pictures of the two of them together, cuddled and pressed close like a couple. In some of these, she was naked. In some, they both were. There were videos. Amy sent Luke a video message of herself topless, and I had to actually hear her voice talking to him in a tone that made me sick, about how she was sending him a quick video to “help him get through the day.” In more than one video, she called him her “boo” and, hearing her call him that, I almost vomited. Stopped looking at that point, I’d seen enough. For about five minutes anyway, then a strange compulsion to keep searching led me to check Luke’s laptop. I knew enough of his passcodes to access his iCloud storage and…yeah, basically more of the same. \n\n\n\nThere were letters, long letters between them. I didn’t have the heart to read past the first few lines of one of them, but I did read Luke mention “our children.” There were countless naked/topless selfies of Amy. Selfies of them together. Videos where Amy appeared to be masturbating. There were sex tapes. Of the two of them. Tom had previously offered to try and hide a camera in Amy’s room, but fuck, he never needed to. Luke was hiding a whole treasure trove under my nose all along. I scrolled, and scrolled, and scrolled. There were so many. Going back years. Not all of it was even sexual. There were some photos of Amy’s kids, too. One video was of Kaylee and the twins playing together when they were younger, and Luke and Amy’s voices from behind the camera. There were even old pictures of Luke and Amy from when they were younger. I’d even say teenagers. \n\n\n\nI snapped. All these years, I had been telling myself I had to be wrong, that it couldn’t be true. Well, it was true. I know that no one forced me to look at as much of the evidence as I did, but I’m still hurting very badly from having seen it and in that moment, I wanted to act, so I did. I called my lawyer, who is a remarkable woman. It was the middle of the night, so I had to call her twice, and she picked up. Though I had woken her, when I asked her to come by and said it was an emergency, she agreed. I also asked her to draw up the paperwork and have it ready. She told me that she’d already had it ready since I first reached out to her. As I waited for her, I went through the necessary channels on Luke’s laptop to make sure he wouldn’t be able to remotely disconnect our access to his little stash, changing passwords and all that. My lawyer (Let’s call her “Paige”) arrived, and I went outside to greet her in the car. Spent a good half hour in the passenger seat just crying, and she was great about that, before I passed her Luke’s phone and his laptop, with all the information she needed to use them. She warned me that this could be considered theft. So I asked her to forward and print out copies of everything she could and then bring the items back, because I just couldn’t bear to do it myself. She agreed. \n\n\n\nI went back inside, and then, I packed up Luke’s things while the house slept. At one point Owen got up to use the bathroom and asked me what I was doing, but I told him I was just cleaning. Luke stirred once or twice while I was in the bedroom but did not wake. I got all of his things packed into trash bags and I loaded up the car. That’s when I woke him up, and told him to come outside. He was confused and half asleep, but he did notice things were missing. I ignored his questions and just told him to come with me. So he followed me outside. Once we were by the car, I pulled out the divorce papers and officially handed them to him. That was about when he figured out what I was doing, and he tried to talk me out of it. Tried to be sweet with me, to be tender. He kept insisting that he loved me and that there had never been anything with Amy. Kept trying to persuade me not to tear our family apart. Even two weeks ago, I might have wilted under him because the manipulation and gaslighting were truly masterclass, but I can see through it now. I didn’t tell him that I knew he was full of shit, I didn’t tell him what I had seen, I just told him we were finished. He tried a different approach. He refused to go. Stated firmly that our children were his too, and that even if we were separating, I had no right to just decide the kids would stay with me over him. This was where I very coldly presented the paperwork reminding him that the house is in my name, and told him under no circumstances would my kids be staying with Amy. He argued a while longer, but in the end he decided to be the “bigger person” and “keep the peace.”At that moment I didn’t care where he went. Before he left, he did ask about his phone and laptop, and I waved him off by saying they were in one of the bags. Bought a little time. \n\n\n\nI couldn’t sleep for the rest of that night. I cried more. Eventually I realized I’d have to wake my children up early and explain to the extent that I could. Naturally, I woke Sophie first. I told her that I had kicked her father out, and that I had discovered evidence of an affair on his devices. I did not specify what kind of evidence and she did not ask. I woke up the others and gently told them that their Dad had gone to stay somewhere else for a while. That I wasn’t sure where, but from now on things were going to be different. Louise was the one to ask if we were getting divorced, and I couldn’t lie to her. I told her yes. Owen asked when they could see their father again and I wanted to cry. Sophie was a very big help, urging her siblings to be sympathetic to me right now and worry about Dad later. I knew better than to “poison” them against their father (Paige warned me against doing that as well) so I only told Sophie that the affair was confirmed since she had already been in the know. However, as the kids were getting ready for school, Owen approached me and asked me point blank if it was about Amy. If Luke was going to be with her instead of me. I couldn’t answer, but I suppose that’s an answer on its own. \n\n\n\nGot the kids to school, and my next step was calling to have the locks changed. I knew Luke would be back for his devices before long, but thankfully Paige returned with them before he showed up again. It was a very quick visit. She just told me that all was accomplished, and she had records of everything we would need in court. Sure enough, Luke turned up an hour later demanding to know where his laptop and phone were. I had set them back in our bedroom like they had never moved, and I just told him he had forgotten them. He insisted that I had said they were in one of the bags, so I just shrugged him off and told him I “must have been mistaken.” After he grabbed them, he tried again to reason with me, but I just showed him the door. I knew the kids would start to come home from school before long and I think he was trying to delay leaving so he could see them. I was not having it. I started shouting again and sent him on his way. I’m still just in absolute pain and despair for what I saw. I don’t know if he’ll realize that anyone went through his devices and made copies of the evidence, or if he suspects I saw anything, but he obviously didn’t say so. After he left, I cried once again. \n\n\n\nTalked to my mother in law that night. Apparently Luke did show up to his parents’ house, which was a surprise, as I was so certain he’d stay with Amy. But maybe even he knows how suspicious that would look to the children and doesn’t want to rock the boat as much. Maybe he knows I’m more likely to let my children see their grandmother than Amy at this point, and he wants to see them to give his version of events. That is not happening. Cat already shared his version with me, that he relayed to her and Jim. That I’m having some kind of mental breakdown, that he wishes he could help me, but my paranoia is causing me to lash out and turn violent. (I was never violent. I shoved him away when he tried to hold me, that is all.) And what’s so hilarious is that he didn’t mention Amy at ALL to his parents. He didn’t even frame it as me “falsely” believing he was having an affair. Even though that’s his story when talking to ME, he left Amy out of it when talking to his parents. Cat noticed that. She believes me. Jim doesn’t know what to believe anymore. According to Cat, he seemed very, very troubled by what he heard from all sides.\n\n\n\nAs for Amy, she’s radio silent. Tom has told Sophie that she’s acting like nothing is wrong but is clearly stressed out. That when her children ask, she makes the same sort of claims. That I am having some kind of emotional, nervous breakdown, and pushing her away, as well as Luke. She doesn’t mention anything about my accusing them of an affair, but still puts it all on me. Amy has not reached out to talk to me directly, and I have not tried talking to her since our big argument. I haven’t really told my kids anything, just that I’m having disagreements with Luke and Amy - though I was very clear that it is NOT a question of my mental health. Honestly, I think they all kind of know what’s going on. Sophie continues to be my rock, as I try to be for her and the others, and Tom continues to be our spy in the ranks. Right now, my biggest regret is the stress that all of this is causing on the children, which I knew it would, but it still needed to be done. \n\n\n\nMy life has fallen apart. But it was never my life. \n\n",
  "created_utc": 1725852071.0,
  "score": 11991,
  "num_comments": 1716,
  "url": "https://www.reddit.com/r/offmychest/comments/1fcfzyk/update_iii_i_think_my_husband_fathered_his_best/",
  "comments": [
    {
      "id": "lm9gofz",
      "body": "I’d be hiring a forensic accountant to see how much he has been spending on his other family. Stay strong, it will get better.",
      "created_utc": 1725882337.0,
      "score": 2686
    },
    {
      "id": "lm8547i",
      "body": "Owen asking if it was about Amy. All of your kids must have seen and heard things from them when they thought they weren't being observed. Please get them into counselling soon. \n\nYou are AMAZING!Stay strong and calm, that will negate all claims of you having a mental breakdown. You've got this.",
      "created_utc": 1725852982.0,
      "score": 5231
    },
    {
      "id": "lm8f4el",
      "body": "If this is fiction: nicely done. \n\nIf this is real: you got this.",
      "created_utc": 1725858063.0,
      "score": 2095
    },
    {
      "id": "lm8646m",
      "body": "Oh, OP. I think I was secretly holding out hope that this would all turn out okay. But... Life is not a fairy tale. It was a very brave thing you did, going through his devices and facing this truth.  Kind of like breaking your own heart,  you knew what you would find. I'm SO proud of you! I can't imagine the strength it took to quietly pack his things while he slept peacefully in bed. \n\nSounds like Luke is a master manipulator. The most recent convo with Amy even talked about knowing this would happen. He had a cover story to explain being kicked out locked and loaded. Curious to see how he can spin this into your fault once the truth comes out. \n\nI would inquire with your attorney about putting in a stipulation in your divorce decree that Amy not be allowed around your children or under the same roof during his custody times. Amy is a vile, disgusting woman and that's a hill I would be willing to die on. You can't do anything about Luke being around your children, but you can put any kind of stipulation like this built into your divorce decree. \n\nSeems you have done everything you could at this point...  No matter how difficult it has been, you faced the truth and now you will be able to live the rest of your life without a nagging thought at the back of your mind constantly. \n\nDon't stop updating!",
      "created_utc": 1725853418.0,
      "score": 1058
    },
    {
      "id": "lm86ndp",
      "body": "Is there a reason he never married Amy?! Especially since Amy has known him since childhood. Or do they just get off on the kink of cheating?",
      "created_utc": 1725853665.0,
      "score": 721
    },
    {
      "id": "lm8ea9u",
      "body": "I honestly don’t understand why Luke and Amy went through all this trouble. No one was stopping them from being together at the beginning. Why do all this? They’re literally psychotic. \n\nThey’re gonna start painting you as a crazy person to your circle / social media soon. Do you think you can get ahead of the curve and tell people the truth / social media? Without including the photos / videos but screenshots maybe? Ofcourse only if your lawyer approves. Or atleast once the divorce proceedings have started and Luke and Amy knows just how much evidence you have. \n\nIf not they’re gonna spin the story as you went crazy and divorced Luke and they looked for each other for support and fell in love. I know you think no one will believe that story but it’s important your narrative gets out.",
      "created_utc": 1725857589.0,
      "score": 1049
    },
    {
      "id": "lmcm1bu",
      "body": "If you do have to speak to Amy, please remind her that when a mistress gets promoted, she creates a job opening.",
      "created_utc": 1725921296.0,
      "score": 171
    },
    {
      "id": "lm8cybd",
      "body": "I'm sorry that you had to find out about their affair this way. \n\nNow that you know the truth, you can leave this marriage with a weight off your shoulders and start to rebuild the life that you and your children deserve.\n\nThis is terrible and it's probably going to require some therapy for you and your children, but I'm sure that with time and healing, things will start to hurt a little less until it's just a lost memory or moment from the past xxx",
      "created_utc": 1725856860.0,
      "score": 118
    },
    {
      "id": "lm8dtmi",
      "body": "What can I even say? Poor Owen, he's just 12, and his question broke me even more, and I can't even imagine what it did to you. Does Luke know what he did to his children? \n\nThat selfish man never thought past Amy and him. Please tell your lawyer what Owen asked you. Hell, one day, tell Luke maybe that might wake some consciousness in him, actually, tell FIL too. The secret is not even out yet, but the damage had already started, and you didn't even see it. \n\nMy heart breaks for you. No story has stayed with me as much as yours from day one. I cried, I think of it, I wake up in the middle on the night thinking how could people be so cruel and last time when you talked about Tom's plan with the cameras I was so scared that you will see something that will break you but I guess it's a cross you had to carry. \n\nI'm so sorry for what you had to see. I think I would have fallen apart if I had to go through even 2 videos. You can't even fall apart or cry to your heart's content because you have a battle to fight and children to take care of and millions of other things. \n\nYou and the children are in my prayers. Cry when you can it's normal to hurt. You were not wrong to trust them. We don't get married to be our partner's jailors. It wasn't your job to keep track of him and doubt everything about what he says. You freely gave your love, and that psycho and the shepsycho will reap the mess they have sown.",
      "created_utc": 1725857334.0,
      "score": 196
    },
    {
      "id": "lm87e6x",
      "body": "You should ask your lawyer if there’s any way to recoup money you guys sent to Amy during your marriage from Luke since it was very clearly under false pretenses. Also, I’m sure your lawyer is already on this but definitely get a forensic accountant to see if any additional funds have gone to her that should be marital property.",
      "created_utc": 1725854013.0,
      "score": 513
    },
    {
      "id": "lm8cqco",
      "body": "My question is if they’ve been having an affair forever then why did he stay with you? I don’t mean that in a negative way but if that’s the person he wanted why not be with her instead of continuing to lie? What’s the benefit here. We can say it’s the kids but what’s the difference if he left and couldn’t live with you and his kids isn’t that the same situation with his and amys alleged kids? this is so confusing",
      "created_utc": 1725856742.0,
      "score": 88
    },
    {
      "id": "lm8f4ge",
      "body": "I know you’ll probably never know, but I wonder why they stopped to such levels of deception instead of being together and or even attempting to form a blended family. \n\nI don’t even know how he’d have time to attempt to appease two families. Does he not have any friends or other hobbies!? Does he not do chores, work around the house? How does he have so much time!?\n\nYou don’t need to answer. I hope you are ok and am proud of you for what you did. You are a tough person and I wish you well 🙏🏽",
      "created_utc": 1725858063.0,
      "score": 73
    },
    {
      "id": "lm863rz",
      "body": "So sorry this is happening to you. But I can’t wait to see his and Amy’s face fall apart when they see all your evidence’",
      "created_utc": 1725853413.0,
      "score": 246
    },
    {
      "id": "lmcvg58",
      "body": "What I don’t get is why would Luke marry someone else (you) when he has been with Amy all along? Why would he knowingly put you and your kids through all of this misery when he could have just married Amy to begin with? He and Amy will hurt so many people with their affair. All the kids will be affected with this. Were they just hoping that all of this will never come to light?",
      "created_utc": 1725924723.0,
      "score": 60
    },
    {
      "id": "lm8ddqq",
      "body": "I love that you're being strategic with this. The longer they go on telling lies about you the worse its going to be for them when the truth is revealed.",
      "created_utc": 1725857093.0,
      "score": 130
    },
    {
      "id": "lneedrc",
      "body": "\"My life has fallen apart. But it was never my life.\"  \nThe married part, maybe. But you're still a mother to a bunch of cool kids, and that IS your life.",
      "created_utc": 1726489908.0,
      "score": 45
    },
    {
      "id": "lm8emcs",
      "body": "Do you make more money?  I'm just wondering how he's pulling this off with the other woman.  If they're so in love, I wonder why she's going along with being the mistress?",
      "created_utc": 1725857778.0,
      "score": 40
    },
    {
      "id": "lm8x1e4",
      "body": "Well done on taking the steps to find the proof you needed. You were never paranoid or crazy. That gut feeling never leads you astray. I always wonder what else has Luke and Amy gaslight you about. They have being at this for years. Why couldn't they have just married, instead of leading you down this path.\n\n\nInstall a ring camera at the front of the house so Luke can never say again you became violent if he turns up at the house. This will also come in handy if he attempts to do something in his state of mind. \n\n\nYour children must know what their dad and Amy have done all this time. Children see and hear a lot but they will be OK. Trust in that they will see you were not part of the trouple and playing sister wives. ",
      "created_utc": 1725869946.0,
      "score": 37
    },
    {
      "id": "lm8if72",
      "body": "Has he called you since you left? Has he asked why you woke him up to kick him out? BY THE WAY THAT WAS A HUGE BOSS LADY MOVE!!!",
      "created_utc": 1725860027.0,
      "score": 128
    },
    {
      "id": "lm866gh",
      "body": "I’m so sorry this is happening to you, OP. Try your best to remember that when this all comes to light in the divorce proceedings, he’s going to be significantly knocked down a peg. This entire situation says a lot more about him and Amy than it does about you, and frankly, I don’t think it’s fair that anyone criticised you for thinking the best of your partner and friend. *They* betrayed *your* trust, and you’re supposed to be able to trust your partner and friends.\n\nAlso, those poor kids. Amy’s kids had a dad who was right there the whole time and they never knew. That’s horrible. You, the IL’s and the kids have all been mistreated and lied to by the people you were supposed to trust the most.",
      "created_utc": 1725853448.0,
      "score": 174
    },
    {
      "id": "lm86how",
      "body": "Oh honey so so sorry you had to see all that, my heart breaks for you and the children! Big hugs! \n\nWhat absolutely POS Luke and Amy are!! I guess that was their plan all along to some how claim you mental health as the reason rather than them being disgusting lying cheating assholes (I think that is the worst word I’m allowed to use on Reddit). Of course they won’t say it’s actually an affair because that would make them at fault and not you. \n\nI hope Tom confront his mother at some point and tells her exactly what the thinks of her and Luke! \n\nWhen you are ready just say to Cat that all suspicions are confirmed! I bet she would know what you mean.\n\nBig hugs from an internet stranger who is in your corner!!!",
      "created_utc": 1725853592.0,
      "score": 65
    },
    {
      "id": "lm8i88s",
      "body": "Need to get all Amy's kids DNA tested... I'm  hoping that one or two aren't his and it turns out that Amy essentially \"cheated\" on him so that he gets to feel the pain and pay  an ass load in child support for all his kids..and Amy loses Luke and her cash cow..both getting the karma that they deserve.\n\nI'm sure they both know that you know about their affair... Nobody just decides to suddenly divorce for no good reason.. But I love that you're making them sweat about how much you know.. Lol",
      "created_utc": 1725859906.0,
      "score": 30
    },
    {
      "id": "lm8hajn",
      "body": "You’ve got this, stay strong! \n\nPlease stop involving your MIL 99% of them would support their sons regardless of the damage they’ve caused. There’s no guaranteeing she won’t feed the information to her son so he doesn’t lose access to the kids/house/finances.",
      "created_utc": 1725859334.0,
      "score": 99
    },
    {
      "id": "lm8nszk",
      "body": "OP - I applaud you! I do recommend you tell your children (when they are a bit older) the truth about what happened. They will respect you for standing up to a master manipulater.",
      "created_utc": 1725863455.0,
      "score": 27
    },
    {
      "id": "lm8bv51",
      "body": "Might be good to not be alone with either of them or at least text your lawyer as soon as either of them enter your vicinity even if the kids are present.\n\n\nCornered people aren't rational and as stupid for their case as it would be to act out in violence I'd be worried about it. Especially with Amy going silent.\n\n\nI think if they find out you have their stash of photos and videos one or both of them may act out of desperation to preserve their reputations, since it seems so important to them.",
      "created_utc": 1725856276.0,
      "score": 47
    },
    {
      "id": "lmbvy1q",
      "body": "How much you want to bet that Cat and Jim land up separating, or even divorcing over this? They previously had fought over this before OP brought up the idea, and every time Cat brings it up Jim shuts her down. I bet Jim knew about this, and got caught up in his son’s lies. That’s why he refuses to talk about it even now. Once it comes out to Cat that he knew and didn’t tell her, she leaves him at least temporarily. That’s why she is so supportive of OP, and not her son. Imagine suspecting they are your grandkids but you can’t say anything, then find out your husband knew that your son was disowning his own children, cheated on your DIL, and your husband was helping the coverup and didn’t tell you.",
      "created_utc": 1725912815.0,
      "score": 44
    },
    {
      "id": "lm84v1n",
      "body": "I truly hope for the best for you and the kids. This is surely a difficult time for you all, but I have high hopes that things can go smoothly for you so you can live a happy life with your kids. You got this OP!! ❤️",
      "created_utc": 1725852868.0,
      "score": 22
    },
    {
      "id": "lm8g4fu",
      "body": "Don't you think the kids need to know that they're most likely siblings?",
      "created_utc": 1725858644.0,
      "score": 23
    },
    {
      "id": "lm98qca",
      "body": "I heard a divorce attorney once say , if nothing else, make sure and ask for FIRST RIGHT OF REFUSAL. So if Luke has visitation but he is working or has something he needs to do and can’t watch the kids, then you get the first right to refuse them. Meaning you get to watch them before anyone else. Like he can’t say Amy can watch them bc it’s my day with them. Ask your lawyer about it!!! ",
      "created_utc": 1725878040.0,
      "score": 23
    },
    {
      "id": "lmvfcbg",
      "body": "Okay....so, as always, baffled by Amy. \n\nBy the way, did you pick Amy because of Gone Girl?  The manipulative witch who uses people?  \n\n\nAnyway, back to my questions. \n\n1) Why?  What did Amy hope to accomplish?  They know you have a lawyer. They really thought the only proof would be on your laptop.  They can't be that stupid\n\n\n2) what is she so worried about coming out?  Cause obviously his own parents suspected it, so your friends obviously would have. So, what does she have to lose?  Would his parents cut her off over it?  Cause if those are their grandkids, I doubt it. \n\n\n3) is her/his fear HIM being cut off?  Does he make less than you and now won't qualify for alimony/child support and needs mom and dad's money to maintain his preferred lifestyle?  \n\n\n4) has he gotten a lawyer? How long does he have to respond to the filing? \n\n\n5) have you seen his messages?  What does he have to say?  Obviously, they know you know.  He has to know she assaulted you. \n\n6) Are they still trying to tell people you're crazy? Or was there enough scoffing to shut that down?  \n\n\n7) is there any emergency order stopping him from getting the kids from school and refusing to hand them over?  \n\n\n8) what did the police tell you? How do they proceed?",
      "created_utc": 1726196550.0,
      "score": 20
    },
    {
      "id": "lm94md3",
      "body": "Does the lawyer know about these reddit posts? Because your posts are going viral, people in your life will find out soon. I'm not a lawyer but I'm just saying this because you are talking about loopholes, which can be used against you, in both legal and emotional situations. So just for safety, run these posts through your lawyer",
      "created_utc": 1725875366.0,
      "score": 17
    },
    {
      "id": "lm8vmjz",
      "body": "Does he know that you changed his passwords?\n\nDo you have any insight on why they did this for so long?",
      "created_utc": 1725868930.0,
      "score": 16
    },
    {
      "id": "lm9i111",
      "body": "I've followed this incredible story since it popped up on my front page. And like you OP, I wished it wasn't all true. \n\nI want to say sorry to you for going through this, but also how proud of you I am, as a stranger going through this practically alone. \n\nYou've done the best thing, and the right thing. Now it's time for you to live YOUR life, and fuck Amy and Luke. \n\nSending you good vibes and lots of love. 💜",
      "created_utc": 1725882983.0,
      "score": 19
    },
    {
      "id": "lmlsudk",
      "body": "First I’d like to say I am so sorry OP. I would be careful with everything you are sharing with us. A lot of people who post on here regarding legal stuff normally wait a while between updates so they can keep the cards in their hands hidden. Luke, Amy, friends or family could find these posts and then it’s used against you. You might want to consider taking the posts down until it’s safer to give us more updates. \n\nThat being said, I see a lot of people coming up with ideas where Amy schemed and forced Luke into an affair. I think it’s much simpler than that. \n\nI think Luke expressed from a young age how he wanted to get married but Amy was hard against marriage. So they came up with the arrangement that Luke could marry someone but still be with Amy. Amy is considered the primary partner even though Luke is married to OP. Now why didn’t they just have an open  poly relationship? That I can’t tell you, but I feel like if Amy wanted to marry Luke all she had to do was make it clear that she was pregnant with his child. So yeah there is probably more to it than that but that’s all I got",
      "created_utc": 1726063187.0,
      "score": 18
    },
    {
      "id": "lm8rktt",
      "body": "More power to you.\nOne thing I'd suggest you that, even though Sophie has been your pillar of strength till now, you're her mother. Make sure you don't rely on Sophie for emotional support, because you're her mother, and she's your daughter afterall. Luke is not her friend, he is her father. And you're not friends either. Get friends for your emotional support and emotional needs, and don't make Sophie that person. After all, she lost her father. So be careful and deal with Sophie as if you were to deal with the younger ones. I'm telling you all this from personal experience.",
      "created_utc": 1725866016.0,
      "score": 49
    },
    {
      "id": "lmgqoif",
      "body": "So… WHY would he do this? Why not just break up with you for Amy? This is all so stupid… are you super rich or something?",
      "created_utc": 1725987566.0,
      "score": 16
    },
    {
      "id": "lm87oge",
      "body": "I can’t WAIT for him to realize you have proof, and this SOB gets taken to the cleaners.",
      "created_utc": 1725854148.0,
      "score": 16
    },
    {
      "id": "lm9v4nx",
      "body": "Good for you, I'm sorry that your marriage is over but you got this! That POS can go bite a curb! \n\nAm I the only one who wants to hear the HOA story though? 😂",
      "created_utc": 1725888566.0,
      "score": 15
    },
    {
      "id": "lmc9puy",
      "body": "Finding out that you're both Asian I'm wondering if he married you because he couldn't marry her. Since she's not their race would it have been inappropriate for him to marry her. Have you just been his cover this whole time?",
      "created_utc": 1725917135.0,
      "score": 15
    },
    {
      "id": "lm88t1d",
      "body": "I’m sending you so so much love right now. Please get your kids into counselling ASAP as they more than likely are going to be dealing with major issues from this- on that note I would suggest counselling for yourself as well because it is going to be difficult to work through the fallout of this. Good on you for kicking him out of your life. You are such a strong woman.",
      "created_utc": 1725854697.0,
      "score": 29
    },
    {
      "id": "lm860yh",
      "body": "I don’t understand why Amy and Luke never got together before OP or why Amy is ok with the kids not calling Luke dad. This story doesn’t seem real but if it is, why can’t you tell Luke you know now that you have proof.",
      "created_utc": 1725853377.0,
      "score": 76
    },
    {
      "id": "lm891ro",
      "body": "Though it hurts I'm glad you got to see the actual proof because it seems like it was the push you needed to get things in motion. When I read that your second son asked if it was about Amy. I immediately thought even the kids know that their relationship isn't right. I hope you continue to find your strength during this difficult time. \n\nLuke continues to show you are not priority. Instead of saying he thinks the divorce is about his relationship with Amy. He rather spin the narrative that you are having a mental breakdown and is leaving Amy completely out of it. He is going to show his true colors during this divorce. \n\nIf you don't have separate finances I would suggest moving your money somewhere else now so he can't use it to support Amy. I really don't understand why he even got married to you he knew he had feelings for someone else. \n\nYou are strong OP and it's time to put yourself first.",
      "created_utc": 1725854817.0,
      "score": 50
    },
    {
      "id": "lm8367m",
      "body": "Woah no way this just updated, just came from tik tok but Hope you’re doing well OP ❤️",
      "created_utc": 1725852124.0,
      "score": 111
    },
    {
      "id": "lm878ec",
      "body": "I’m sorry to be a hater but there is no way this is real. \nFirst of all, no one would be on a viral thread admitting to knowing about DNA test when they are in the middle of divorce proceedings. \nSecondly, it’s just too well written to be real if she’s really writing this in real time under such duress. And updating and laying out my thoughts like this for the folks on Reddit would be the last thing on my mind in this crisis",
      "created_utc": 1725853937.0,
      "score": 151
    },
    {
      "id": "lm8h33h",
      "body": "I don't want to be too dark here but he isnt a benificiary on anything for you is he?   \n\nThey've shown that they're heartless, I'd be a little concerned.",
      "created_utc": 1725859211.0,
      "score": 11
    },
    {
      "id": "lm859wy",
      "body": "Of all the things I believe most about this whole thing, it's your very last sentence in this post.",
      "created_utc": 1725853053.0,
      "score": 73
    },
    {
      "id": "lm8a63l",
      "body": "Make sure to freeze your credit cards and separate any bank accounts. Make sure to ask your lawyer how to do this legally",
      "created_utc": 1725855386.0,
      "score": 22
    },
    {
      "id": "lm8ablk",
      "body": "Don't be afraid to talk to Sophie and even Tom about the situation. Obviously, keeping the intimate things private, but don't shut them out. They clearly love you and want to help you through this.",
      "created_utc": 1725855465.0,
      "score": 23
    },
    {
      "id": "lmhx5yn",
      "body": "I just want to know what Amy's excuse will be when the DNA test comes back...",
      "created_utc": 1726000909.0,
      "score": 11
    },
    {
      "id": "lmcqv62",
      "body": "[deleted]",
      "created_utc": 1725923052.0,
      "score": 10
    },
    {
      "id": "lm8tjg8",
      "body": "I love this mini series",
      "created_utc": 1725867420.0,
      "score": 10
    },
    {
      "id": "lmciq21",
      "body": "If it's not too personal -- you mentioned the \"sister-wife\" comments hitting harder as an exmo; is that just from growing up with the stigma around the church or were you actually from one of the sects that practice polygamy? I'd definitely still feel like sister-wife was a bit targeted from a mainline LDS background but I imagine it'd hit different from an FLDS/etc background",
      "created_utc": 1725920105.0,
      "score": 8
    },
    {
      "id": "lmdp72k",
      "body": "Have you spoken to him today or has he left any voice mails saying anything? Has Amy reached out & said anything? If I was her I’d be begging you not to let her secret out. Her name will be destroyed right next to Luke’s.",
      "created_utc": 1725935688.0,
      "score": 8
    },
    {
      "id": "lmhuvfq",
      "body": "Please update me. Your silence is troubling. ❤️",
      "created_utc": 1726000205.0,
      "score": 9
    },
    {
      "id": "lm86f9r",
      "body": "I’m so invested!\n\nWhat threw me off the cliff is your husband keeping all the evidence of their affair. He knew you were on to them why not wipe everything clean!",
      "created_utc": 1725853561.0,
      "score": 23
    },
    {
      "id": "lm872pv",
      "body": "Ruin him",
      "created_utc": 1725853863.0,
      "score": 24
    },
    {
      "id": "lm8p5ab",
      "body": "i applaud this very intriguing creative writing exercise 👏",
      "created_utc": 1725864364.0,
      "score": 25
    },
    {
      "id": "lm8fwef",
      "body": "One question OP that you don’t have to answer if it’s too personal - does he have nudes and sex tapes of you as well or only of Amy? If this is only with Amy I think you have your answer of why he did it; it’s some kind of incest fetish where he presents Amy as his sister to the world but goes home and fucks her in private.",
      "created_utc": 1725858514.0,
      "score": 16
    },
    {
      "id": "lm87zy4",
      "body": "The plus side to all this is, you aren’t crazy. You never were. It wasn’t a dark intrusive thought; it was your gut. And thankfully, you listened to it!",
      "created_utc": 1725854303.0,
      "score": 11
    },
    {
      "id": "lm9nfh5",
      "body": "You are doing great. I know it hurts but he wasn't worth it and still isn't. \n\nQuestion though, could you not show some of the evidence to your FIL?",
      "created_utc": 1725885397.0,
      "score": 12
    },
    {
      "id": "lm84yls",
      "body": "You are such a boss with the way you've handled the affairs and your emotions\n\nI've been there enamored with the story since the beginning but this post just cinched it.",
      "created_utc": 1725852913.0,
      "score": 28
    },
    {
      "id": "lm89d6c",
      "body": "Why why WHY do all the villains in life always default to the gaslighting lines of, “they’re just crazy/ you’re just crazy” to push their narrative?! Is it because literally NOTHING else will sound plausible?? Stay strong. Liars gonna lie. \nBut I WOULD love for the rest of the children to know the truth. Being lied to their entire lives so far is long enough. All of them deserve to know the truth before they have lifelong trust issues that affect all of their lives going forward.",
      "created_utc": 1725854979.0,
      "score": 29
    },
    {
      "id": "lm8ltv3",
      "body": "I’m very, very proud of you. You’ve done so much already but the only thing I’d add is tell your attorney he is telling people you’re unstable and that Amy is saying the same. You want your lawyer ahead of that when it comes to custody arrangements - more specifically, she can tell you if you should be doing anything now to counter that claim which is very clear to me Luke will try to make. Even if it’s recording convos with Luke, etc. I’d also suggest family therapy asap if your lawyer agrees. You want it documented by an independent party that your kids aren’t scared of you, and that you present as stable to a therapist in the kids accounts. As it sits right now, Amy & Luke are both lining up a “she’s not stable” case and telling others to try and shore up custody. You have the motherlode with the videos and texts and such, but an affair won’t in court negate a belief that a parent is unstable. \n\nYou’re being so smart about all this, keep it up.\n\nAlso, I know you love Cat and she is on your side, but be careful there because at the end of the day a mother will choose her son, especially if there are 2 sets of grand kids involved, no matter what that son has done.",
      "created_utc": 1725862159.0,
      "score": 7
    },
    {
      "id": "lmjmyc6",
      "body": "My question is why didn't they just get together if they have been doing this for so long? Why ruin your life if they really wanted each other?  Nothing was holding them back. All these kids and for what? Your husband is a sick man. A true pathological liar. And Amy! She never wanted to be a wife? This is all so sick and twisted.\n\nI wish you all the best. You are an amazing woman and mother. Your kids will  be OK as long as they have you. I hope you get through the divorce with few issues and that it is quick.",
      "created_utc": 1726022402.0,
      "score": 6
    },
    {
      "id": "lm8e0be",
      "body": "[deleted]",
      "created_utc": 1725857436.0,
      "score": 39
    },
    {
      "id": "lm895zh",
      "body": "Luke and Amy know their relationship with ALL of their kids is over once this is out. The level of sick betrayal they've forced upon everyone is disgusting. They can't be that delusional to think any of those kids will want anything to do with the., and yes esp her kids.",
      "created_utc": 1725854877.0,
      "score": 18
    },
    {
      "id": "lm9c0kd",
      "body": ">one thing that came to my attention is that my name is on the paperwork for our home. Luke’s name is not. ... It was my lawyer, “Paige” who pointed this out to me, and it was like finding a winning lottery ticket on the ground. \n\nThis is one point where I have doubts about this story. The fact that your name only was on the house means very little in a divorce. Marital assets would still be split. It's still Luke's primary residence so you can't just kick him out on a whim. Obviously he could leave on his own to keep the peace, but he's not obligated to. Your attorney should have told you this.",
      "created_utc": 1725879944.0,
      "score": 17
    },
    {
      "id": "lm9k6n7",
      "body": "This is more and more reading like a creative writing assignment.",
      "created_utc": 1725883969.0,
      "score": 20
    },
    {
      "id": "lm87ar1",
      "body": "All the best and good luck with the divorce.  I would tell your FIL that he can believe you, and you have proof, but its not something he would want to see.",
      "created_utc": 1725853967.0,
      "score": 10
    },
    {
      "id": "lm85kym",
      "body": "The effing audacity of your stbx and Amy. Holy moly I'm so sorry for everything you're going through. I've been checking each update as they have come through and my heart is breaking for your and I'm angry on your behalf. Wow.  And he's trying to make it sound like you're having a mental breakdown as if he's not the one who has caused you stress? Eff that. Good on you for putting yourself first.",
      "created_utc": 1725853181.0,
      "score": 21
    },
    {
      "id": "lmi3a0y",
      "body": "This woman is going through the hardest time in her life right now and I see so many people saying “this is so AI” “this is fiction” bro?? She doesn’t need to be hearing that rn and as for them pinning it all you, I can’t wait for the next update where you found proof of them cheating and making u seem like the crazy person. I wish you the best and good luck on this journey, I’m glad you have your family and Tom to rely on❤️❤️",
      "created_utc": 1726002814.0,
      "score": 15
    },
    {
      "id": "lm86slg",
      "body": "OP, this story is getting pretty viral and I worry it might be used against you if Luke finds it.",
      "created_utc": 1725853732.0,
      "score": 22
    },
    {
      "id": "lm88dyd",
      "body": "OHH WE EATIN",
      "created_utc": 1725854492.0,
      "score": 11
    },
    {
      "id": "lm87ujt",
      "body": "I'm so so so sorry you're having to go through all this. I can't even imagine. I wish you and your kids all the best🫂",
      "created_utc": 1725854230.0,
      "score": 7
    },
    {
      "id": "lm88fb0",
      "body": "Darlin', I wish you a fast, clear-cut divorce and a future full of peace.",
      "created_utc": 1725854510.0,
      "score": 6
    },
    {
      "id": "lm8bp5j",
      "body": "I want Luke to suffer the way you had to. Both of them. I’m so sorry. I’m so angry for your sake",
      "created_utc": 1725856188.0,
      "score": 4
    },
    {
      "id": "lm8u8ip",
      "body": "The accusation of a mental breakdown is him lining up a custody defence. However , he thinks because his laptop and phone where still where HE left them , then you have no proof of him and the gf... oh to be a fly on the wall when he finds out 🤣",
      "created_utc": 1725867921.0,
      "score": 5
    },
    {
      "id": "lm96ysr",
      "body": "Goodness PsychFactor, your life became a soap opera.  Super crazy but sadly for you and your children, very real.   I'm so sorry you are going through this.  I'm sorry it took a while for you to take action though you carried your suspicions for years.   I do have a question for you to pose for Paige.  Does your state permit you to sue Amy for Alienation of Affection?   Can you recover any tangible marital assets (like your money used to support Amy's lifestyle under false pretenses or theft?)   Maybe work out a settlement where you do not have to recover your $$ but in lieu thereof get Amy to publicly admit in court her active part in perpetuating fraud and deception against you (of course of you want reimbursement, she have to work out that arrangement).   \n\nI think Paige could mandate a psych evaluation on your husband to unravel (1) why he married you while carrying on a 2nd family; (2) rationale for perpetuating it for so long, (3) why he gaslighted you for years, (4) current mental state (is he mentally sane?)  (5) Does he understand basic right from wrong?  \n\nMaybe Paige can determine the following: Would his relationship with Amy be considered a common law marriage?  Are there sufficient grounds to assert a bigamy allegation against Luke?  Is Amy receiving government assistance?  \n\nBlows my mind as to why he sought to marry you and carry on with Amy.  And why Amy continued as a side chick for so long.   I'm so sorry that you're going through this but love how you sound stronger with each post and update.  Whatever you're doing to keep mentally sound is working.   You must be an incredible woman.  Clearly your children love you a great deal too.",
      "created_utc": 1725876930.0,
      "score": 5
    },
    {
      "id": "lm9cxh2",
      "body": "I think that Amy's kids are going to HATE him when they find out that they've had a Dad the whole time, not only that but that he's been in their lives this entire time!",
      "created_utc": 1725880440.0,
      "score": 5
    },
    {
      "id": "lm9elcl",
      "body": "Can I just say you need to be very careful here? Both Amy and Luke are exhibiting narcissistic behaviour and narcissists hate to lose. In fact them thinking they had pulled the wool over your eyes for so long might be what kept their sex lives going for so long.\n\nSuggest these to your lawyer before continuing. Asking Cat and Sophie to explain things to the kids. That would stop Luke from saying you were poisoning them. He couldn't really say the same things about his mother and daughter. Warn Tom and Sophie that they might try stopping him from seeing his siblings if they think he had anything to do with this.\n\nAlso, you might want to ask if Jim KNEW this was going on. He might have done and feared that revealing might mean he lose contact with some of his grand kids. That is a powerful motivation to stay quiet.\n\nGood luck",
      "created_utc": 1725881304.0,
      "score": 5
    },
    {
      "id": "lmah2hi",
      "body": "All of the children know. Whether or not they are aware of what they know is a different question. But they know. You have your kids, a good support system, and a whole life ahead of you. Don’t let two narcissistic, gaslighting, emotionally abusive cheaters make you think that you don’t. You’re the prize and they’re the trash.",
      "created_utc": 1725896125.0,
      "score": 4
    },
    {
      "id": "lmj729h",
      "body": "My heart is breaking for you and all the children.  Your husband is a heartless selfish monster.  I'm so sorry.  😪",
      "created_utc": 1726017022.0,
      "score": 6
    },
    {
      "id": "lmp8b69",
      "body": "Screen shot EVERYTHING & send them to yourself. The ballsy part it, don’t delete the texts. Let Luke see that you know everything & let him figure out how he’s going to handle that. He deserves to shoulder some of the stress from the shit show he caused.",
      "created_utc": 1726104895.0,
      "score": 6
    },
    {
      "id": "lmpnf9c",
      "body": "You know what the worst thing is to me? Not that they both were keeping it a secret for years, not that they lied about it when confronted directly. It's the fact that their first instinct was to protect themselves, not to protect their \\*children\\* from accidentally doing something that they would never be able to undo.\n\nThey had a choice between being honest, or possibly allowing their children to unknowingly commit incest, and they just took a fricking backseat. Sick, selfish assholes.\n\nMaybe since they're \"surrogate siblings\" they just didn't think it was that big a deal (/sarcasm)",
      "created_utc": 1726111093.0,
      "score": 5
    },
    {
      "id": "lm8h1h7",
      "body": "I can’t for the life of me understand why they just wouldn’t be together to begin with? Why drag you into this? Why have kids with you? Why pretend that he loves you? It’s so sick! I can’t wait until they see the evidence slapped in their faces and then how are they going to try spin the story?",
      "created_utc": 1725859185.0,
      "score": 9
    },
    {
      "id": "lm9kyox",
      "body": "You and Paige have the same mind.",
      "created_utc": 1725884319.0,
      "score": 1671
    },
    {
      "id": "lm87yfp",
      "body": "This, all the people who talked about keeping the kids together were off their rockers.  Her **12 - year old** knew there was something wrong and they have been constantly thrown into a situation that was uncomfortable for them.   OP has to start putting her kids first.",
      "created_utc": 1725854282.0,
      "score": 1846
    },
    {
      "id": "lm8e1lh",
      "body": "Well she and Luke did tell the kids that they went to visit his parents because her and Amy had a fight and needed time apart. (It’s paragraph twelve of update 1, for reference)",
      "created_utc": 1725857456.0,
      "score": 156
    },
    {
      "id": "lm87upc",
      "body": "Kids pick up on everything.",
      "created_utc": 1725854232.0,
      "score": 343
    },
    {
      "id": "lm8bftr",
      "body": "That's a fantastic idea.",
      "created_utc": 1725856050.0,
      "score": 13
    },
    {
      "id": "lmaicm3",
      "body": "You are right. Children aren’t stupid. When I was a kid I was astute at people watching and stupid adults take children for granted and tell on themselves all all of the time.\n\nEven the little kids more than likely see what has been going on.",
      "created_utc": 1725896563.0,
      "score": 7
    },
    {
      "id": "lm9772n",
      "body": "This is how I feel. There’s so much effort put into the story even if it was made up by her or AI, im all in.",
      "created_utc": 1725877076.0,
      "score": 708
    },
    {
      "id": "lma2xau",
      "body": "Yeah first two were more believable. Its still entertaining just less believable. We can pretty certainly expect Luke and Amy to attempt to use the alleged mental breakdown to try to get him custody and maybe get her locked up, it will be foiled though.",
      "created_utc": 1725891357.0,
      "score": 62
    },
    {
      "id": "lm8sukt",
      "body": "I think there are clear signs it is fiction. In update 2 she used the words \"shrugged\" and \"cackled\". Which feel unnatural.\n\nAlso, her lawyer would never take the phone and laptop. Ever. It just wouldn't happen. \n\nThirdly, her easily changing his passwords is doubtful at best. \n\nMaybe it's real, but I think more signs point towards compelling fiction.",
      "created_utc": 1725866922.0,
      "score": 424
    },
    {
      "id": "lm9csfy",
      "body": "It is absolutely fiction, and not even good at pretending not to be. “Luke stirred once or twice in his sleep, but did not wake”—what? Calling your lawyer in the middle of the night and she shows up to your house? Get real.",
      "created_utc": 1725880365.0,
      "score": 113
    },
    {
      "id": "lm8h1i4",
      "body": "It's totally fiction.",
      "created_utc": 1725859185.0,
      "score": 195
    },
    {
      "id": "lma1ty4",
      "body": "Its 100% fiction. Her name being on the deed doesn't mean she can just legally kick him out, not how the law works at all. And furthermore changing the locks on the house and not giving him a key would have any judge furious. Any lawyer telling you to do that is an absolute idiot lawyer, or a fictional one in this case.\nSeriously, if you find yourself in this situation DO NOT change the locks (unless he is a psycho and literally beating you, that is a different story). The judge will look very dimly on this and you will get off on the wrong foot. The judge will also immediately order you to give a set of keys to your husband, who by the way, has every legal right to live there and can't be kicked out.",
      "created_utc": 1725890968.0,
      "score": 52
    },
    {
      "id": "lmayorx",
      "body": "This update feels more like fiction than the previous updates but I'm still invested.",
      "created_utc": 1725902190.0,
      "score": 8
    },
    {
      "id": "lmays0f",
      "body": "Dude just look up the timeline of all this happening and it falls apart so fast.",
      "created_utc": 1725902219.0,
      "score": 6
    },
    {
      "id": "lm8zatc",
      "body": "It’s not real. They sell paternity tests on Amazon. Google says 3-5 business days to 2 weeks. All of this could have been solved by a DNA test 3 updates ago. ",
      "created_utc": 1725871582.0,
      "score": 23
    },
    {
      "id": "lm87zl6",
      "body": "Life is not a fairy tale indeed. \n\nYou're right, the nagging worry is at least gone. In a way, I think not finding anything would have been worse, because it would have perpetuated the ambiguity. After talking to Tom I was all but certain but it was still possible to be a misunderstanding, that it wasn't true. Now I know for sure. And I hate knowing, but at least the question isn't hanging over me anymore. \n\nIt's tricky, because them not being allowed to see Amy is going to impact their ability to see their best friends/half siblings. If being my husband's affair partner was all it took for me to demand she not be allowed to see the kids, I feel like a LOT of divorces would have clauses like that but I never hear about it. I don't want Amy seeing my kids but I'm not sure how realistic that is.",
      "created_utc": 1725854298.0,
      "score": 677
    },
    {
      "id": "lm86v6h",
      "body": "I still don't know, and it pisses me off.",
      "created_utc": 1725853765.0,
      "score": 636
    },
    {
      "id": "lm8de0p",
      "body": "This is what I don’t understand. No one was against the relationship. Luke and Amy could’ve married each other all along. I don’t understand why they had to drag OP into it and cause all this drama.",
      "created_utc": 1725857097.0,
      "score": 134
    },
    {
      "id": "lm8obbd",
      "body": "I think it’s the stigma, Amy is his foster/adoptive sister. I think both were concerned how it would look to outsiders",
      "created_utc": 1725863800.0,
      "score": 22
    },
    {
      "id": "lmaioyg",
      "body": "This is exactly what I don't understand. Why didn't they just date and get married from the beginning? Why do this to OP and then gaslight her? It's so incredibly fucked up.",
      "created_utc": 1725896681.0,
      "score": 5
    },
    {
      "id": "lm8fufd",
      "body": "If Amy and Luke try to start those kinds of rumors among their friends, most of them are probably going to nod and say to themselves \"She's *finally* figured it out\"",
      "created_utc": 1725858481.0,
      "score": 516
    },
    {
      "id": "lm8flrl",
      "body": "I'll talk to Paige about it. Not a bad idea by any means.",
      "created_utc": 1725858340.0,
      "score": 341
    },
    {
      "id": "lm8hy7h",
      "body": "Yes, i was thinking the same thing . Op have gone through ENOUGH, and now those two definitely should get their karma. Op have should be the 1st one to let her circle know about the  2 DECADE LONG AFFIAR between Luke and so-called sister.",
      "created_utc": 1725859735.0,
      "score": 62
    },
    {
      "id": "lm8p4z8",
      "body": "Don’t forget it’s likely Amy’s kids are his anyway. They won’t be able to deny the affair.\n\nOP won’t look bad in this situation. They can certainly try but it won’t work!",
      "created_utc": 1725864358.0,
      "score": 5
    },
    {
      "id": "lmdc47t",
      "body": "That is magnificent and I'll have to remember it!",
      "created_utc": 1725930751.0,
      "score": 99
    },
    {
      "id": "lm8dz64",
      "body": "That's why I went out of my way to get him out but keep them close. \n\nJust taking things one day at a time.",
      "created_utc": 1725857419.0,
      "score": 108
    },
    {
      "id": "lm8ejeu",
      "body": "And the only person who has actually been honest with all the children are u/PsychFactor!",
      "created_utc": 1725857733.0,
      "score": 25
    },
    {
      "id": "lm8f66e",
      "body": "Owen asking me that shattered my heart. I had to try not to cry on the spot. \n\nI was numb after the first three or four to be honest. \n\nThank you for your thoughts and prayers and kindness, internet stranger.",
      "created_utc": 1725858091.0,
      "score": 193
    },
    {
      "id": "lm88jpr",
      "body": "It was, and she is.\n\nBut Amy's savings, if she even has any, is money she'll need to look after her kids. If it was just her, I'd be more willing to clean her out, but as frustrating as it is, the children are a part of all this, and I do care about them, so I can't play hardball as much as I'd like to.",
      "created_utc": 1725854570.0,
      "score": 364
    },
    {
      "id": "lm8el9j",
      "body": "I don't yet know for certain if Tom is Luke's child but if he is, that means the affair predates all of our children, and based on the dates of some of the content I saw, it does.",
      "created_utc": 1725857761.0,
      "score": 146
    },
    {
      "id": "lm8g7ql",
      "body": "My guess is because OP is the safe and stable choice. Amy is a hot mess that is incapable of taking care of herself nor her child without the support and help from OP and Luke’s parents. Given she’s settled for being a mistress for decades he probably never saw her as wife material; just good for a quick lay. She’s probably always been this way that’s why Luke never committed to her.\n\nEdited for typo",
      "created_utc": 1725858698.0,
      "score": 46
    },
    {
      "id": "lm8gvdx",
      "body": "I wondered too. What was he thinking. Did he love both woman and wanted a poly lifestyle? Why didn't he just marry amy and not drag OP in all this for years. Mind boggling.  Its a pity it took OP so many years to realize the truth. I hope they get their upcommence for doing this to her.",
      "created_utc": 1725859083.0,
      "score": 15
    },
    {
      "id": "lm9rywp",
      "body": "I actually have an answer for that. I have a friend-ish. Let's call her Meg. Well, Meg's now-husband (who she married against everyone's recommendation, and we'll call him Josh) was married previously. \nDuring his previous marriage and into his engagement with Meg, he saw this side chick, Andi. \nHe still swears up and down than he's just friends with Andi, but the PMs Andi sent Meg say otherwise. As far as I know, he still refuses to cut Andi out of his life. \nAt the end of the day, Andi (and Amy) weren't the type they wanted to marry. The high of sneaking around while the comfort of having a more successful wife is something they can't beat.",
      "created_utc": 1725887278.0,
      "score": 12
    },
    {
      "id": "lm8gc4s",
      "body": "Our families were very entwined. Amy would come over to our place as often as we would go to hers. Because of a health condition, Luke cannot go outside very often. I'm now realizing that plenty of adultery took place in our house as well as hers.",
      "created_utc": 1725858769.0,
      "score": 127
    },
    {
      "id": "lm880m7",
      "body": "Oh, same.",
      "created_utc": 1725854312.0,
      "score": 191
    },
    {
      "id": "lmddw2i",
      "body": "Evidently that was their hope. I have no idea what the long term plan was.",
      "created_utc": 1725931397.0,
      "score": 60
    },
    {
      "id": "lm8dvhc",
      "body": "Here's hoping Luke perjures himself before this is over.",
      "created_utc": 1725857363.0,
      "score": 152
    },
    {
      "id": "lnhin9n",
      "body": "Thank you. That helps.",
      "created_utc": 1726527880.0,
      "score": 36
    },
    {
      "id": "lm8erd4",
      "body": "I make considerably more money. \n\nBut Luke's family is richer.",
      "created_utc": 1725857857.0,
      "score": 74
    },
    {
      "id": "lm8xs40",
      "body": "Actually we've already got a ring camera! So that's good.",
      "created_utc": 1725870481.0,
      "score": 44
    },
    {
      "id": "lm8iidc",
      "body": "I've ignored his calls and texts but I'm keeping them preserved just in case.",
      "created_utc": 1725860082.0,
      "score": 129
    },
    {
      "id": "lm8795w",
      "body": "That is validating, thank you, kind commenter. \n\nI haven't had a chance to talk to them directly but I wonder if some of them aren't wondering. Tom has suggested that he could share the idea with them without revealing his collusion with Sophie.",
      "created_utc": 1725853947.0,
      "score": 132
    },
    {
      "id": "lm872o8",
      "body": "I have told Cat that I saw absolute proof, but I asked her not to say as much to Luke for now. I once worried she would feel obligated to choose his side, but it seems like she isn't. I feel like she's staying out of this, but knows I'm right. \n\nThank you, kind internet stranger.",
      "created_utc": 1725853863.0,
      "score": 123
    },
    {
      "id": "lm8htrd",
      "body": "She doesn't even really want to be involved, which I respect.",
      "created_utc": 1725859659.0,
      "score": 97
    },
    {
      "id": "lm8o0dd",
      "body": "Oh, once the divorce is finalized and the children are old enough, I will absolutely discuss this with them.",
      "created_utc": 1725863593.0,
      "score": 51
    },
    {
      "id": "lm9gg19",
      "body": "They’re old enough now. She can tell them in an age appropriate way. Why wait years? Luke will have access to them and he will spin the story to paint OP as a monster. She needs to get ahead of it now.",
      "created_utc": 1725882222.0,
      "score": 7
    },
    {
      "id": "lm8c2d4",
      "body": "At Paige's advice, I'm going to begin recording on my phone if either of them approach me.",
      "created_utc": 1725856384.0,
      "score": 88
    },
    {
      "id": "lmc8vkw",
      "body": "I really hope none of this happens.",
      "created_utc": 1725916862.0,
      "score": 28
    },
    {
      "id": "lm8h4k5",
      "body": "They deserve to know. They have the right to know. \n\nBut at the moment, I don't have iron cast proof of that, and telling such young children these things, especially Amy's children, wouldn't be ethnically permissible and would make me look bad, to sow that kind of drama. \n\nThis is going to be a job for Tom and Sophie, really.",
      "created_utc": 1725859235.0,
      "score": 45
    },
    {
      "id": "lmvl396",
      "body": "Oh wow, the Gone Girl connection blew my mind. \n\nYeah, I get the sense that she was just panicking for one reason or another. I don't know what she's so worried about. I don't think Jim and Cat would actually cut them off, is the thing. They'd want to make sure all their grandkids are taken care of, and I'm not even sure that Luke and Amy's jobs together would be enough to support Amy's four. Especially since I'm not fronting a bill anymore. \n\nThat's the thing, he hasn't! Paige has already contacted him and asked for his lawyer's contact information but Luke didn't even try to get in contact with Zack. I don't know if he's still in denial or what, or trying to drag his heels. Maybe he thinks that if he doesn't play along, I won't be able to divorce him? I don't know. \n\nLuke has overall been very vague and evasive about everything. I half wonder if he isn't still trying to get his story figured out. For whatever reason Amy REALLY doesn't want people to know she had an affair. I've contacted the various schools and kept them in the loop. Police did take a report and told me to call them again if she came back, but since she was already gone, they didn't arrest her.",
      "created_utc": 1726199111.0,
      "score": 62
    },
    {
      "id": "lm8xosg",
      "body": "He's still signed in on his accounts and I deleted the email notifications. It will be a while before he figures it out. \n\nUnfortunately, no.",
      "created_utc": 1725870415.0,
      "score": 44
    },
    {
      "id": "lm9kq47",
      "body": "Thank you kind stranger.",
      "created_utc": 1725884215.0,
      "score": 13
    },
    {
      "id": "lmmf5oq",
      "body": "I've consulted with a couple of lawyers now and they actually think that, with the approach Luke is taking, documenting my \"sanity\" could wind up HELPING me if these posts are ever found. \n\nPoly relationships weren't as openly accepted twenty years ago. If you're right, that could be part of it. Of course without being open it's just cheating.",
      "created_utc": 1726070472.0,
      "score": 54
    },
    {
      "id": "lm8ru3u",
      "body": "No, trust me, I know better than that. I know she needs me more than I need her.",
      "created_utc": 1725866197.0,
      "score": 53
    },
    {
      "id": "lmgxcy8",
      "body": "Not richer than his family...",
      "created_utc": 1725989683.0,
      "score": 25
    },
    {
      "id": "lmhawwt",
      "body": "I don't think he wanted to be with Amy or love her, I think he's just a chest. Some men are just scummy, I also think Amy deliberately got pregnant after op got engaged possibly hoping he'd leave op for her but he didn't so she was happy to play mistress and have op and her husbands family both fund her lifestyle. And once they'd got away with it so long, I guess they just thought/hoped OP would never question it.",
      "created_utc": 1725993970.0,
      "score": 12
    },
    {
      "id": "lm9w2ck",
      "body": "Not much of a story, just multiple smaller conflicts over the course of a couple years, and nearly all of them were over unreasonable fines. The HOA president at the time just didn't like us for some reason. Luke speculated that it was at least partially motivated by racism, and it may have been, but I was never sure. In the end, we got the guy to back off, and he's not the president anymore (for unrelated reasons.)",
      "created_utc": 1725888948.0,
      "score": 28
    },
    {
      "id": "lmccijm",
      "body": "Jim's white, it isn't that. He and Cat always loved Amy and I think if they had started dating conventionally it would have been fine. Cat even predicted it would happen when they were younger.",
      "created_utc": 1725918037.0,
      "score": 45
    },
    {
      "id": "lm89ao6",
      "body": "I absolutely am going to.",
      "created_utc": 1725854944.0,
      "score": 32
    },
    {
      "id": "lm89d88",
      "body": "I’ve been thinking about this too. But I guess the only idea I can get at is that Amy is the perfect mistress but would never be the perfect wife. She’d never be enough for him because he needs a wife like OP. Someone strong and can deal with being a mother, wife, and breadwinner, whereas Amy is an unstable mess. There would be no way for Amy to take care of him the way OP does. OP provides stability for him, Amy provides sex for him.",
      "created_utc": 1725854979.0,
      "score": 52
    },
    {
      "id": "lm86pa2",
      "body": "Paige wants to blindside him with that once the divorce starts properly.",
      "created_utc": 1725853690.0,
      "score": 135
    },
    {
      "id": "lm89qtm",
      "body": "Oh, already done. I've gotten the locks changed, and I've gotten the bank situation sorted out.",
      "created_utc": 1725855170.0,
      "score": 80
    },
    {
      "id": "lm8ahtw",
      "body": "It's because it's not real",
      "created_utc": 1725855554.0,
      "score": 79
    },
    {
      "id": "lm8c9j9",
      "body": "I agree. The updates are coming too fast and everything is happening too neatly. Creative writing project for sure",
      "created_utc": 1725856489.0,
      "score": 85
    },
    {
      "id": "lm88ywu",
      "body": "Also no way he would have all that evidence for all these years right in his phone and computer and she never saw any of it? Why would he keep it all.  Nudes right on his phone when they knew she was getting suspicious? Also She didn’t say anything after the kid was born with the same rare condition? And doesn’t that condition usually affect extremely light skinned people and she keeps saying they aren’t light enough to be his dad’s kids. \n\nBut I will say it’s a great story and if this is an author trying out an idea then she should get it published. And I’m going to keep following it until the end.  It’s like a Lifetime Movie.",
      "created_utc": 1725854778.0,
      "score": 88
    },
    {
      "id": "lm8kue6",
      "body": "The entire process of throwing him out, changing the locks, etc., clearly shows that this is false. Simply put, that’s not the way it works. Being on the deed matters when it comes to selling the house, maybe… because depending on location, it’s considered marital property. Also, it’s illegal to throw him out and change the locks without going through the eviction process. Even if he left voluntarily, preventing him from accessing the house is illegal without formal eviction. He has the right to return and also to see his kids whenever he wants. There is no way that a legitimate attorney would support this or not inform their client of the legal consequences. The attorney taking the laptop home and searching for evidence? Nope, any evidence on there wouldn’t even be allowed in the divorce proceedings, not that it matters, because it wouldn’t be relevant. If OP wanted to make sure the photos and messages were saved she could have put them on a USB drive or simply emailed them to herself. An attorney with any sense would not have taken the laptop from the home. OP should have left out the attorney character because it proves that it’s fiction.",
      "created_utc": 1725861521.0,
      "score": 58
    },
    {
      "id": "lm8knyq",
      "body": "Did no one else notice that she talks about how great Paige is and then a few paragraphs later introduces Paige to us readers again? A few things make this seem so sus.",
      "created_utc": 1725861409.0,
      "score": 40
    },
    {
      "id": "lm8uefp",
      "body": "It's most likely fake, but the writing is good, and the story is gripping. I'll still be looking for updates until it's concluded.",
      "created_utc": 1725868040.0,
      "score": 14
    },
    {
      "id": "lm99ewv",
      "body": "Honestly I appreciate the creativity it probably took to keep this one going.",
      "created_utc": 1725878458.0,
      "score": 11
    },
    {
      "id": "lm8aga9",
      "body": "Cancelled my cards, transferred my savings, ran everything by Paige, so far so good.",
      "created_utc": 1725855531.0,
      "score": 55
    },
    {
      "id": "lm8anv2",
      "body": "No, I'm keeping them in the loop. They are old enough to understand, and they were already looking into this even before I approached them.",
      "created_utc": 1725855641.0,
      "score": 43
    },
    {
      "id": "lmjw74t",
      "body": "I'm guessing she'll insist it's a fake, or something else desperate.",
      "created_utc": 1726025891.0,
      "score": 35
    },
    {
      "id": "lmk9u2d",
      "body": "[deleted]",
      "created_utc": 1726032519.0,
      "score": 6
    },
    {
      "id": "lmdbxm5",
      "body": "Thank you, kind stranger. I appreciate you and all of the kind comments I have received.",
      "created_utc": 1725930686.0,
      "score": 10
    },
    {
      "id": "lmddcrb",
      "body": "I was FLDS. Was not fun.",
      "created_utc": 1725931202.0,
      "score": 19
    },
    {
      "id": "lmdtv3d",
      "body": "Amy is still radio silent. \n\nLuke has left voicemails but I haven't listened to them.",
      "created_utc": 1725937571.0,
      "score": 41
    },
    {
      "id": "lmjvo4g",
      "body": "I'm safe. The kids are safe.",
      "created_utc": 1726025676.0,
      "score": 23
    },
    {
      "id": "lm8d5nf",
      "body": "Luke is an idiot with no shame or sense of self-preservation.",
      "created_utc": 1725856972.0,
      "score": 13
    },
    {
      "id": "lm8ccqm",
      "body": "For a moment all I could think was, what an absolute moron.\n\nThen once I realized that for Luke, he has done this everyday for years. It’s just another day for him. OP has never voiced her concerns. She’s never made a stink about Amy. He’s not aware of the reality of the destruction he has inflicted on OP and his lives. Yet.\n\nI hope OP destroys him. He deserves to be miserable the rest of his life. Both do.",
      "created_utc": 1725856536.0,
      "score": 14
    },
    {
      "id": "lmaufhx",
      "body": "I want this as a show.",
      "created_utc": 1725900783.0,
      "score": 7
    },
    {
      "id": "lm8g2qz",
      "body": "I've given him a few naked pictures over the years, but I didn't find any of them on his iCloud.",
      "created_utc": 1725858616.0,
      "score": 45
    },
    {
      "id": "lm9nk5d",
      "body": "I had considered it.",
      "created_utc": 1725885452.0,
      "score": 19
    },
    {
      "id": "lm89ysf",
      "body": "I think they want to discredit me because I've got them figured out and they don't want me telling other people what's going on. \n\nWhich is ironic because it seems like just about everyone could tell, to some degree.",
      "created_utc": 1725855283.0,
      "score": 91
    },
    {
      "id": "lm9cgzo",
      "body": "A lot of people have commented this and maybe it won't be the smoking gun I had hoped but my lawyer is optimistic so I'm optimistic. She didn't say it was a done deal.",
      "created_utc": 1725880193.0,
      "score": 46
    },
    {
      "id": "lmahu8f",
      "body": "I’m a lawyer, and this was my comment up the OP!\n\n-It actually really depends on the state and how you got the property.  If it was a premarital asset or it was inherited, then he is far less likely to have any claim.  Your lawyer will know better and you should trust her advice over that of internet google lawyers!",
      "created_utc": 1725896388.0,
      "score": 5
    },
    {
      "id": "lmamxz0",
      "body": "This. Most attorneys advise their clients that they can’t change the locks or kick them out and to be very careful in how they talk about them leaving the home. But maybe where she lives the law is different? Exit plans take time to work through and there are details that require finesse.\n\nThe other part that I find odd is that her attorney knows about these posts and is okay with it. That makes no sense whatsoever. They would advise you to not talk publicly about it in any way, especially since so many specific details are identifying, and to keep things close to the vest so to speak. \n\nI also don’t get how she packed up everything of his in their bedroom, in plastic bags no less, and he just slept through that?",
      "created_utc": 1725898174.0,
      "score": 5
    },
    {
      "id": "lm88n5j",
      "body": "I had considered that. But outside of using that material as evidence in court, I feel like I shouldn't be showing anyone. Borders on revenge porn.",
      "created_utc": 1725854616.0,
      "score": 40
    },
    {
      "id": "lmjvksy",
      "body": "It's fine. The internet (and Reddit especially) is filled to the brim with people's personal anecdotes and with other people doubting they're true. It's the cycle of life.",
      "created_utc": 1726025637.0,
      "score": 24
    },
    {
      "id": "lm88t22",
      "body": "Thanks for reminding me. A few different comments have voiced this concern. But I showed the posts to Paige, and after reviewing them, she doesn't think there's anything in them I need to worry about.",
      "created_utc": 1725854697.0,
      "score": 48
    },
    {
      "id": "lmawlqp",
      "body": "And I’m sure Paige is on top of this as well, but make sure all evidence and documentation supports why you don’t owe his alimony!\n\nMy condolences on the loss of not only the marriage you thought you had, but also the friend and “nieces and nephews”. \n\nThat is a massive blow and when the dust settles, please take a little time for yourself to be kind to yourself!!!",
      "created_utc": 1725901498.0,
      "score": 588
    },
    {
      "id": "lmcq91y",
      "body": "Honestly? Telling your kids the (sanitized) truth isn’t “poisoning them.” It’s the TRUTH. You discovered proof that their dad has been having an affair with Amy for years. That is a fact. Not only that, it’s a fact some if not all of them already intuited!!! You trying to take the high ground just leaves HIM room to poison them against YOU.",
      "created_utc": 1725922829.0,
      "score": 562
    },
    {
      "id": "lm8swa5",
      "body": "Amy and Luke were aware of OPs kids liking each other, and they were just going to *let it happen even though they may be RELATED!?* That's fifty shades of fucked up!",
      "created_utc": 1725866956.0,
      "score": 772
    },
    {
      "id": "lm889y8",
      "body": "She's onto it. I have complete faith in OP.",
      "created_utc": 1725854439.0,
      "score": 462
    },
    {
      "id": "lmadp0g",
      "body": "Kids pick up more than most people give them credit for. \n\nEven extremely young kids (under 5).",
      "created_utc": 1725895011.0,
      "score": 7
    },
    {
      "id": "lm8f3nt",
      "body": "That's right, and they know Luke has been kicked out. \n\nOn the other side, Tom says his mum is playing it cool but I'm sure the kids are all on high alert in that household. I wonder when Luke will have the cheek to come a-visiting.",
      "created_utc": 1725858051.0,
      "score": 165
    },
    {
      "id": "lm8woj9",
      "body": "There's a religious comedian she talks about have much little kids put up on this they hear.\n\nSone of her lines are about this. 2 of my favorites are:\n\nJust because they're short  doesn't mean that they're deaf.\n\nLittle pitchers have big ears.\n\nHaving 3 of my own and have taught 100s  more. I know that all too well.\n\nOne 3 year old told me very proudly, \"My mommy calls my daddy 'Jell-O Buns.\" 🤣🤣🥰",
      "created_utc": 1725869688.0,
      "score": 109
    },
    {
      "id": "lm9by4o",
      "body": "I’m highly sus about ai. Imo - Ai can’t write like this. It always adds in unnecessary details & overloads the exposition with too much emotional insight instead of just moving the plot.",
      "created_utc": 1725879907.0,
      "score": 407
    },
    {
      "id": "lmbe8zo",
      "body": "Fake or not, OP will do well when she publishes. She writes well.",
      "created_utc": 1725907199.0,
      "score": 10
    },
    {
      "id": "lmbjjpa",
      "body": "I scanned the text for signs of AI help; it's human. And something tells me it's true",
      "created_utc": 1725908905.0,
      "score": 5
    },
    {
      "id": "lmeh975",
      "body": "[deleted]",
      "created_utc": 1725950247.0,
      "score": 20
    },
    {
      "id": "lm9e68d",
      "body": "The thing with the lawyer that I’m finding weird is that she took the laptop but then she approved this post? That makes no sense to me whatsoever. If she reviewed this post for OP, she’d have told her to remove that part about her taking the laptop and phone. OP can copy and save those docs because it’s family property until it isn’t but I don’t think the lawyer can do that. \n\nI don’t know, life is stranger than fiction sometimes. I think I want this to be fiction because it’s so messed up but if it’s real, then I feel really bad for OP",
      "created_utc": 1725881087.0,
      "score": 242
    },
    {
      "id": "lm8y1tz",
      "body": "The lawyer would also be making clear the home will still likely be considered community property. Also as a parent unless you’re a narcissist you wouldn’t want your bloody kids so involved in this drama.",
      "created_utc": 1725870677.0,
      "score": 96
    },
    {
      "id": "lmbdrvk",
      "body": "Her lawyer also just happened to bring divorce papers she'd already drawn up, in her free time of course. \n\nAnd Luke must be a heavy, heavy sleeper.",
      "created_utc": 1725907044.0,
      "score": 11
    },
    {
      "id": "lm9miiz",
      "body": "If she did change his passwords she would have needed to change them back, which she didn't mention, or he would have known immediately when he was locked out of his own devices.",
      "created_utc": 1725885002.0,
      "score": 10
    },
    {
      "id": "lmcm79b",
      "body": "Tbf, I use “cackled” all the time, because I cackle.",
      "created_utc": 1725921356.0,
      "score": 8
    },
    {
      "id": "lm9t1kq",
      "body": "and she packed up all of Lukes stuff in the bedroom and he slept through it? C'mon man!!",
      "created_utc": 1725887706.0,
      "score": 11
    },
    {
      "id": "lme0yav",
      "body": "Definitely fiction. You wouldn't write about a DNA test loophole admitting knowledge to it and post it publicly. You wouldn't write about your lawyer take the laptop after the lawyer advised you not to. His name not being on the house means absolutely nothing it is a marital asset since it was acquired post marriage. Even pre marriage if he paid any of the mortgage he will have a claim to it. The lawyer should absolutely know this and it's suspicious she point it out as a golden ticket. This is something they tell you if you have ever bought or sold a house without the spouse on the mortgage. So much more believable till this update. This update has too  many plot holes.",
      "created_utc": 1725940792.0,
      "score": 5
    },
    {
      "id": "lmal5o5",
      "body": "Then the fact that this is going viral on a popular web platform makes me wonder why either she or her lawyer would think it's a good idea to *continue* to write in the midst of a divorce. It's cathartic, but if he or his lawyer finds it and she words something wrong it might be used against her. She doesn't owe us anything, it looks like mostly negatives from where I sit.\n\nBut then I remember some bullshit from a while ago, a guy and gal were both anonymously posting about their halves of a break-up and both accounts went viral, dropping the masks so to speak and I think causing the feud to erupt here too. Stranger, juicier things have happened.",
      "created_utc": 1725897535.0,
      "score": 5
    },
    {
      "id": "lmckxb6",
      "body": ">  Amy. But maybe even he knows how suspicious that would look to the children and doesn’t want to rock the boat as much. Maybe he knows I’m more likely to let my children see their grandmother than Amy at this point,\n\n Known eachother since at least highschool. She didn't turn up that night as a lawyer, but as a friend.",
      "created_utc": 1725920894.0,
      "score": 6
    },
    {
      "id": "lmdzztw",
      "body": "Lost me when the lawyer was named at the beginning and then we got a “let’s call her Paige” line later on",
      "created_utc": 1725940327.0,
      "score": 12
    },
    {
      "id": "lmax8k4",
      "body": "I was pointing to lines like that in the last update. There is a clear difference between how people recount memory and how people tell stories. This is 100% fiction.",
      "created_utc": 1725901710.0,
      "score": 19
    },
    {
      "id": "lm93klk",
      "body": "Lost me at the line where she was talking about Amy's breasts always being bigger then got worse and worse from there. ",
      "created_utc": 1725874638.0,
      "score": 208
    },
    {
      "id": "lm8ouwv",
      "body": "I think so, too. OP is far too engaged with people invested in the story.",
      "created_utc": 1725864168.0,
      "score": 124
    },
    {
      "id": "lmbv56m",
      "body": "100% fiction and they are trying too hard to explain everything now. They are also trying too hard to have a \"normal\" reaction to this now, after so many people are telling them to react at all. I know I was one of the ones in the last update that made a comment about the kids would have told on the Dad and Amy at some point before this or they would have grown up in a \"sister wife\" situation and wouldn't have ever thought to keep it a secret. Let alone come up with a fake dating story to blow this whole thing up. I see now OP is fighting for their life to get away from that part, even claiming religious trauma to hope people will back down. Not backing down- this is a nice exercise in creative writing.",
      "created_utc": 1725912567.0,
      "score": 5
    },
    {
      "id": "lm88tb3",
      "body": "[deleted]",
      "created_utc": 1725854701.0,
      "score": 308
    },
    {
      "id": "lm8972i",
      "body": "I'd say it's unlikely you can prevent them from seeing Amy. However, you can teach your kids how to discern what is reality.  It's likely she will trash talk you and tell them lies about your mental health. \n\nThose kids are going to have a field day together figuring out what happened. They'll all have tales of busting them in various ways. Poor kids.",
      "created_utc": 1725854892.0,
      "score": 239
    },
    {
      "id": "lm8dufy",
      "body": "Probably not realistic at all sorry. If he chooses to give up the act and be with her then the reality is she might become your kids step mom and will be seeing them more than before.",
      "created_utc": 1725857346.0,
      "score": 52
    },
    {
      "id": "lm8frue",
      "body": "All I can think about is your soon to be ex husbands conversation with his lawyer.\n\n“She’s divorcing me because she’s crazy and having a mental breakdown. She thinks I’m sleeping with my friend Amy.”\n\n“Are you sleeping with Amy?”\n\n“Even if I was, she doesn’t have proof.”\n\n“Are you sure that she doesn’t?”\n\n“Of course. I’m far too smart to leave anything to be found.”",
      "created_utc": 1725858439.0,
      "score": 99
    },
    {
      "id": "lm8az15",
      "body": "Speak with Paige. You may not be able to completely keep them away from her, but you can make it damned difficult. I know you're being sympathetic to the children.... But they share a father. They can see their half siblings when they go to their dad's house along with millions of other children across the world. Doesn't mean Amy has to be there. You probably won't get that put in the divorce, but damn wouldn't it be nice. \n\nI'm solely an observer, but this woman (and possibly Luke) are going to do anything they can to undermine you. They are both already throwing you under the bus, acting as if you're having a mental breakdown. I can see that you are still trying to be compassionate, but they are not you. And they are not going to conduct themselves the same way. You've done a great job so far of protecting  yourself, but I do think more is to come.  They're going to do everything they can to ruin your reputation and good standing. I would go ahead and notify your job in case any anonymous complaints suddenly pop up. \n\nYou seem to be such a kind hearted, trusting person. Even now, in the wake of all of this destruction you're still acting with grace. I imagine having to kick him out, and have these difficult conversations has been eating away at you because it's not who you are or like to be. \n\nOnce all of this comes out, your kids relationships with their Dad may change drastically in a negative way.  It's going to bother you. That's not your fault and it's not your responsibility to fix those relationships. This is something he has done, and you are no longer cleaning up his messes. \n\nKeep your head up. It will get harder before it gets easier. You are strong. You are resilient. You CAN do this. \n\nProud of you!",
      "created_utc": 1725855804.0,
      "score": 78
    },
    {
      "id": "lm89e8u",
      "body": "Do you live in a state where alienation of affection is a thing? You might be able to get her to not be around your kids on that ground but you would need to ask your friend/lawyer.",
      "created_utc": 1725854994.0,
      "score": 49
    },
    {
      "id": "lm89sff",
      "body": "You’ve raised your daughter well to also be a kind hearted young woman and a protector of her siblings as well. She’s smart and no matter what will make sure you and your kids have the support and defense needed against anyone and any ideas they might try to push onto them. For now keep them at arms length but focus on what will be best for you, your kids, and especially your mental. You’re doing amazing don’t beat yourself down and be proud you made it this far against manipulative people. I’m wishing you so much luck and sending so much virtual hugs of love and encouragement!",
      "created_utc": 1725855192.0,
      "score": 32
    },
    {
      "id": "lm8hy4t",
      "body": "I think it’s very realistic. They won’t want to be around her anyways and their mental health matters. When Luke finally acknowledges his other children there’s no reason he can’t bring them along when he as parenting time with your kids.",
      "created_utc": 1725859734.0,
      "score": 8
    },
    {
      "id": "lm9zmyz",
      "body": "Well she and luke are both trying to paint you as crazy/violent. That should help in court, when it comes to custody. As soon as Luke gets ahold of the kids, he's going to try to convince them you're nuts. Sophie will be able to help prove this, when it comes to it.",
      "created_utc": 1725890187.0,
      "score": 7
    },
    {
      "id": "lm8aiu0",
      "body": "I think at some point, you kids will not want to see Amy (esp Sophie) as she is aware of the situation. It is very tough, but you should let them know about a 20 year affair when they are old enough. They should decide if they want to keep in touch with Luke and Amy.",
      "created_utc": 1725855568.0,
      "score": 15
    },
    {
      "id": "lm9bpuk",
      "body": "The good news is that you’ve hit rock bottom. The only way is up. Even the DNA results won’t hit you as hard because you already know what the results will say now that you have evidence of the affair.   As difficult as this time is, at least you can breathe and say that you’re not crazy! They’ve been gaslighting you for years and making you feel stupid for feeling insecure about their relationship. Now you know that you were the sane one all these years and they were the two disgusting and destructive ones. It may not feel like it right now but that is a huge load off your shoulders!",
      "created_utc": 1725879781.0,
      "score": 5
    },
    {
      "id": "lm8bbo2",
      "body": "There are some absolutely fucked up people in the world that find this type of affair hot and exciting. Good on you for everything OP. This is the update I wanted to hear. It hurts now, but the truth had to come out and you had to be strong.",
      "created_utc": 1725855989.0,
      "score": 225
    },
    {
      "id": "lm87eqh",
      "body": "Me too!! I hope when you do get to confront them with all your knowledge that you get everything out at them!! \n\nHugs to you!",
      "created_utc": 1725854020.0,
      "score": 84
    },
    {
      "id": "lmlwsz6",
      "body": "Is he morman, or ex? is she? Do her parents like him? Seems like he wanted it all and didn’t care about your consent. I’m so sorry OP 🤗\n\nDefinitely get the forensic accountant to see how much of your marital funds have gone to her over the course of your relationship.",
      "created_utc": 1726064546.0,
      "score": 36
    },
    {
      "id": "lm8imox",
      "body": "I have a little theory that he may have crossed the line with her, but she wasn’t exactly what he wanted in a life partner. She may have seduced him, he told her you were the woman for him. She felt jealous, kept pursuing him knowing what he likes until she became pregnant because of his carelessness, then maybe he had to keep it going to shut her up. He didn’t want her telling you and ruining the family he created with you. Of course he was enjoying himself but I think he just wanted her to stay quiet because he would regret getting caught. And he hasn’t told you this version yet because he’s still denying the affair. When the evidence comes out I think he will tell you this is the WHY and that he’s soooo sorry but Amy isn’t the kind of woman he ever wanted to be married to. In fact your divorce may ruin everything for Amy. He may not be able to look at her the same knowing she’s the reason he lost his family. Even though it’s all his fault.  This life he chose was his responsibility to honor, not hers.",
      "created_utc": 1725860153.0,
      "score": 164
    },
    {
      "id": "lm9a7o5",
      "body": "My guess is that they’re both narcissists who enjoyed the illicit nature of their relationship. They liked having this dirty little secret between them and didn’t care about the consequences because they thought they were so smart that they’d get away with it forever. \n\nI’m sorry to say this (and know I’m not saying this in a mean way) but they also thought it would be their secret forever because they saw you as a doormat who would never have the guts to stand up for herself. They took advantage of your (formerly) passive nature and they probably got some enjoyment out of it. \n\nIt’s truly sickening to think about. I’m so glad that your doormat days are done and that you will show them how badly they underestimated you. I can bet that their relationship is not going to be nearly as fun as soon as it is out in the light of day for everyone to see. \n\nPlease take control of the narrative before they do.",
      "created_utc": 1725878929.0,
      "score": 8
    },
    {
      "id": "lm9b7qu",
      "body": "My theory:  \n\nAmy always enjoyed being top dog in Luke’s life and she wanted a relationship with him but he wasn’t super interested at the time because he was young and wanted to date. \n\nThen anytime a woman got close, Amy got in the way and those relationships ended. \n\nEnter OP who’s nature was more passive but kindhearted. Amy tries to get in the way but OP doesn’t get threatened enough to dump Luke because she believes that he sees her as a sister. \n\nLuke starts getting more serious with OP and Amy feels very threatened at this point and starts getting sexually suggestive with him in a frog in boiling pot kind of way. Around the time of the wedding or shortly after, Amy and Luke finally start having sex and Amy gets pregnant. Luke is a newlywed and knows the baby will blow up his marriage so he tries to keep it a secret but every time he pushes her away, Amy threatens to tell OP. \n\nThen enough time passes that this becomes the new normal for them both and they both enjoy the illicit nature of it. They enjoy having their little secret and they get off on pulling wool over her eyes. \n\nObviously I don’t know these people but that’s how I can see how this happened.",
      "created_utc": 1725879498.0,
      "score": 71
    },
    {
      "id": "lm8g78d",
      "body": "Sure. But I’m petty and I’d hate for OP’s story to be twisted at all or left to interpretation. \n\nWhen wronged, I absolutely don’t believe that the victim must always be the bigger person and take the high road. Fuck em all tbh.",
      "created_utc": 1725858689.0,
      "score": 179
    },
    {
      "id": "lm8ol0f",
      "body": "Could it be possible he married you because you were from a well-off family or that you had more income potential to provide that much support for him and Amy?\n\nNone of this is your fault. Amy and Luke are downright psychotic users who should have not involved so many people in their dumbass charade. Sorry this is happening but I admire your strength and willpower to no longer be tied to a long-term cheater.",
      "created_utc": 1725863982.0,
      "score": 215
    },
    {
      "id": "lm917p2",
      "body": "As someone who tried to be kind by stepping back and giving my ex space after dumping him, only to have him own the narrative and spin me as a cheater... \n\n\nI urge you to get ahead of the narrative. He's already trying to spin this as you having a mental break, and that can reflect on you in the courts. Talk to Paige and find out what you can do to shut down this false narrative NOW. Don't wait, he will turn this on you. ",
      "created_utc": 1725872963.0,
      "score": 85
    },
    {
      "id": "lm974xp",
      "body": "Talk to your lawyer but I’m sure there’s no problem telling everyone that you’re divorcing him because he’s having an affair with Amy and that you have solid proof but due to the divorce proceedings, you can’t disclose more than that. \n\nI’d also, take all four of your kids to a therapist and tell them together. You may think you’re protecting the younger ones by being vague but Luke will have visitation with them and he will blame it on you and by then they won’t believe you. Your children are not toddlers. You can tell them in an age appropriate way that their father and Amy had an affair and you are leaving him as a result. \n\nAlso, therapy is extremely important for you because Sophie should not be your rock. I know she is right now and I really feel for you but that is a huge burden to put on a 15 year old. Don’t parentify her. I know you’re not doing it on purpose but please be mindful. Call a therapist as soon as you can!",
      "created_utc": 1725877038.0,
      "score": 75
    },
    {
      "id": "lm8vpy4",
      "body": "I agree get ahead of the narrative.  Get your story out there first. They’ve manipulated you and everything around you for years now it’s time for you to take it back.",
      "created_utc": 1725868999.0,
      "score": 24
    },
    {
      "id": "lm963fw",
      "body": "See if your state allows form alienation of affection suits. You should be able to sue Amy for mental distress regardless.",
      "created_utc": 1725876358.0,
      "score": 9
    },
    {
      "id": "lm8ibvk",
      "body": "Yeahhh I firmly believe cheaters should be called the fuck out! No need to worry about their reputation. Fuck their reputation. In most cases the cheaters will spin a sad story about how they felt abandoned that’s why they cheated or another crazy story.",
      "created_utc": 1725859969.0,
      "score": 32
    },
    {
      "id": "lmdle42",
      "body": "I’d tell her Luke hid not only you, but also your children. They will always be seen as his “other children.” She did that. \n\nAlso. I’d tell her. I gained a son in all this (Tom).\nYou know that will kill her. He’s been the pseudo dad when Luke wasn’t around.\n\n\nHow far do y’all live apart? I pray the kids go to different schools. 🥺",
      "created_utc": 1725934211.0,
      "score": 27
    },
    {
      "id": "lm8gbak",
      "body": "It's not just Owen, your 10-year old went straight to divorce too.  The children have been talking among themselves for a very long time.",
      "created_utc": 1725858755.0,
      "score": 103
    },
    {
      "id": "lm8l6bn",
      "body": "Yeah, tell FIL and Luke how he asked if it was about Amy. That's so messed up. Maybe they will understand what sort of damages they have done to the children and how they must have felt so insecure about their lives this whole time because they have always felt Luke's treachery. \n\nTrust me, the betrayal, you will not be the only one to feel it. You were never the only one who felt it. I'm talking from experience. Just look out for the children and for all their mental health. They will need a lot of help.",
      "created_utc": 1725861732.0,
      "score": 9
    },
    {
      "id": "lma66uk",
      "body": "If there is ANY silver lining to this, its that Luke's actions have made it impossible for you to really miss him. There's nothing to miss, as he was never faithful from the start. \n\nYou've got this OP. Im thinking about you multiple times per day, and probably will for a very long time to come. I cant help but wish i was your friend irl so i could be there for you as a support person. ❤️",
      "created_utc": 1725892485.0,
      "score": 7
    },
    {
      "id": "lm88tic",
      "body": "Oh I meant like in your divorce settlement from Luke. Use that number as leverage against him. Infidelity is hard to quantify, but that number will be loud and clear.",
      "created_utc": 1725854704.0,
      "score": 373
    },
    {
      "id": "lm8u6so",
      "body": "I know this is going to sound cruel but Luke and Amy know you too well, that’s why they disrespected you for so long. They knew that you would consider how retaliation would impact the children and even how it would impact them them before considering what is right for you. Please don’t worry about the kids, do the right thing for you and your own children and go ahead and clean Amy out, Luke will find a way to support her and their children, they’re his responsibility, not yours. If you don’t, Amy would continue her life as usual, without any repercussions and your life and the lives of your children have been turned upside down. \n\nThink about it, if you don’t do anything, nothing really changes for her, except she can screw around with your husband in the open and he just swaps houses. \n\nGo after Amy hard, her children have their wealthy grandparents to support them financially, they also have their father. Take back what’s yours and your self respect. It’s time you think about your own children now, not your husband’s affair partner and her children. A happy confident mom, makes happy confident children. Stop being a martyr, take back your dignity and self worth",
      "created_utc": 1725867888.0,
      "score": 86
    },
    {
      "id": "lmly04d",
      "body": "Can you sue her in your country/state for “alienation of affection”? Basically seducing him away from his marriage?",
      "created_utc": 1726064949.0,
      "score": 40
    },
    {
      "id": "lm8b2jz",
      "body": "Well, you should get what you deserve. Luke and his family already supporting her. Do not be nice on this, please.",
      "created_utc": 1725855855.0,
      "score": 55
    },
    {
      "id": "lm8a9xm",
      "body": "WTH!  Why do you keep doing that?   Amy is not going to be destitute -- Luke and his father have been supporting her all along and will continue to do it.   You on the other hand, have been supporting your family, paying the mortgage and bills because Luke can't work enough to support his family, yet he's been supporting her.  You've been financially abused and here you are talking about continuing to deprive your own kids because you care about hers?\n\nYour lawyer works for you, let her do her job.  If that means clawing back all the marital funds that have gone to Amy, let her do that.   Do not sacrifice your kids on the alter of getting along with Amy's kids any longer.",
      "created_utc": 1725855441.0,
      "score": 207
    },
    {
      "id": "lm8faob",
      "body": "I am concerned if Tom isn't his, but the other kids are since they are too young to check. But hell, Luke himself said \"our children \"",
      "created_utc": 1725858162.0,
      "score": 65
    },
    {
      "id": "lm9jik8",
      "body": "Do you think the affair began before your marriage? If so, the part that is really mind boggling is that Amy would be ok with this secret relationship and having her own kids be denied knowledge of their father. That would mean that she sat back and watched Luke propose and marry you all while thinking she was somehow his true love to be hidden away. She also had to be around the two of you living your relationship in the open pretending to just be a friend.",
      "created_utc": 1725883666.0,
      "score": 63
    },
    {
      "id": "lm8unou",
      "body": "You need to be prepared to learn that your children have witnessed things in their own house and kept silent.",
      "created_utc": 1725868227.0,
      "score": 69
    },
    {
      "id": "lm8gkfq",
      "body": "They suck so much!!! \n\nHugs!!!!",
      "created_utc": 1725858905.0,
      "score": 33
    },
    {
      "id": "lma7ore",
      "body": "I do agree that all the children have been exposed to inappropriate things over the years. They ALL need therapy.",
      "created_utc": 1725893000.0,
      "score": 19
    },
    {
      "id": "lm9fk24",
      "body": "Omg that’s so disgusting!! I hope you scrub it down as soon as you can. Barf",
      "created_utc": 1725881790.0,
      "score": 9
    },
    {
      "id": "lm8cclr",
      "body": "Holy shit, this update! You gonna go get evaluated by a mental health professional ahead of time to show how sane you really are? Take a damn drug test too, why not? I hate that they're trying to smear you like that, you're phenomenal! Like, so jealous of your intuition and resolve. Adopt Amy's kid's! (Joking) But thank you Op for trusting yourself and finding the strength to make moves. This all sounds so tough. The freaking audacity of those two is ridiculous. And big big hugs, I'm seriously rooting for you and your kids.",
      "created_utc": 1725856534.0,
      "score": 149
    },
    {
      "id": "lmfwcj2",
      "body": "My concern for you is I read they considered your behavior was becoming a \"problem\". Please keep yourself safe. Maybe consider some kind of self protection. That's a real concern that they worded it like that.",
      "created_utc": 1725977759.0,
      "score": 12
    },
    {
      "id": "lmdxa9k",
      "body": "Will you ask him? Do you plan to get answers out of him?",
      "created_utc": 1725939061.0,
      "score": 7
    },
    {
      "id": "lmer4ue",
      "body": "I just had a terrifying thought. OP have you ever considered the possibility that after all your kids went off to college, he had planned to divorce you and finally be with Amy in the open😳",
      "created_utc": 1725957349.0,
      "score": 12
    },
    {
      "id": "lm9f869",
      "body": "That said, I do think you have to take control of the narrative and not be too secretive. You should let people know that you have evidence of the affair but tell them you can’t say more about it because it is confidential at this time. Perjury in the divorce will be a minor offence compared to the damage Luke and Amy can do to your reputation in your community and even with his parents. Obviously you need to listen to your lawyer about what you can or cannot say about the evidence but don’t be so evasive that you’re waiting for some grand reveal. Divorce can take months if not years. You can be waiting and waiting and waiting while they’re controlling the narrative and turning people against you the entire time. It’s not going to be like it is on tv where you make this grand reveal and everyone gasps.",
      "created_utc": 1725881623.0,
      "score": 31
    },
    {
      "id": "lm8f5be",
      "body": "I think the odds of this are very high.",
      "created_utc": 1725858077.0,
      "score": 35
    },
    {
      "id": "lmbhuji",
      "body": "Heres hoping Tom tells his siblings the truth, that their actual dad was there and denied them",
      "created_utc": 1725908356.0,
      "score": 9
    },
    {
      "id": "lnhvc07",
      "body": "Just hopping on here to send you strength and a digital hugg. You are strong and you will survive this!",
      "created_utc": 1726532586.0,
      "score": 7
    },
    {
      "id": "lm8x5of",
      "body": "I bet his dad and mom have known this entire time. I can’t see supporting a woman who would keep having kids and not have the dads in the kids lives or supporting them. Someone had to have known and helped covered it up.",
      "created_utc": 1725870032.0,
      "score": 17
    },
    {
      "id": "lmcjfnp",
      "body": "Make sure to change your settings and control who can access it. ",
      "created_utc": 1725920359.0,
      "score": 10
    },
    {
      "id": "lm8j8t4",
      "body": "He must know that you went through his phone and laptop or at least be terrified that you might have. Especially after having to come back to the house to get it back. He is probably shitting his pants wondering what you saw.",
      "created_utc": 1725860526.0,
      "score": 83
    },
    {
      "id": "lm8irhg",
      "body": "Ohhhhh I can’t wait to hear what they all say! There’s NO way of talking his way out of any of this!\n\nJust crazy. He could have married her before you & no one would have probably cared. They weren’t blood related siblings. Why have a kid with her & then start a family with you when he had his own from the get go already???\n\nI hope when this is all over they tell you the whole truth. They owe you that much atleast!",
      "created_utc": 1725860235.0,
      "score": 26
    },
    {
      "id": "lma3uc6",
      "body": "He's a straight up scam artist.  He ran a scam on you for your whole relationship - that's a long con",
      "created_utc": 1725891676.0,
      "score": 8
    },
    {
      "id": "lm8p40h",
      "body": "Don't be surprised if Amy either directly or indirectly implants the idea in her children's head that you \"took Luke\" away from her. Remind Tom (and Sophie) that this is a possibility for ALL of the younger children - even your own - to say out of sadness/anger/frustration about this impossible situation, and the only thing you can say is (without bashing Amy and Luke) is \"Dad/Tom and Mom/Amy knew each other for years before I/mom/your name came around. There were countless opportunities for them to realise they loved each other ***- gag -*** before (your name) came around. (Your name) did nothing wrong by simply existing and loving Luke/Dad. She did not get in the way of anything - because when you get older and get into relationships, you learn to speak up, use your feelings/emotions/etc and say how you feel so that the other person can either reciprocate and end the relationship that they were already in - or say \"I'm not interested thank you\" and move on. Nobody owns somebody or can lay claim to somebody - it's not the movies\".",
      "created_utc": 1725864340.0,
      "score": 39
    },
    {
      "id": "lm880as",
      "body": "Oh I sitting here crying for you!! She might or she might not want to support Amy after this only the children!",
      "created_utc": 1725854308.0,
      "score": 22
    },
    {
      "id": "lmb72et",
      "body": "I hope you don’t allow Luke and Amy to continue spinning the narrative that you’re having a mental breakdown. Please tell me you’re gonna let everyone know you have concrete proof of their affair?",
      "created_utc": 1725904886.0,
      "score": 8
    },
    {
      "id": "lm8fepi",
      "body": "You should also try to keep all communication with Luke in writing (texts and emails). Try not to speak to him on the phone unless you can (legally) record it. Well, for your protection you can record him regardless, whether it’s admissible in court (should it come to that) is another thing. But definitely be vigilant as both Luke and Amy can become unhinged. They worked hard to keep their affair a secret for two decades at the detriment of your marriage and all the children so there’s no telling what they’ll do to keep the status quo.",
      "created_utc": 1725858227.0,
      "score": 47
    },
    {
      "id": "lm9j8vv",
      "body": "I can totally see Amy snapping and coming to your house.",
      "created_utc": 1725883542.0,
      "score": 45
    },
    {
      "id": "lm8eg47",
      "body": "Get a voice activated recorder and carry it in a pocket at all times.",
      "created_utc": 1725857681.0,
      "score": 8
    },
    {
      "id": "lm8qoy7",
      "body": "This should absolutely not be Sophie’s responsibility. She may be the oldest but she is still just a 15 year old and should not have these adult respnsibilities thrust on her. As difficult as this is, you have to be the one to do it",
      "created_utc": 1725865402.0,
      "score": 28
    },
    {
      "id": "lmw39ai",
      "body": "He hadn’t contacted Zack? But you’ve mentioned that he was livid that you have hired Zack on your legal team. I’m confused, has Zack served him any kind of papers now and that’s how he found out?",
      "created_utc": 1726209151.0,
      "score": 14
    },
    {
      "id": "lmvn3og",
      "body": "Why did your most recent post update get locked/removed?",
      "created_utc": 1726200085.0,
      "score": 10
    },
    {
      "id": "lmvq28a",
      "body": "OP, please tell the police you want to press charges/sign complaints. The police should be doing something other than letting this go. I had to make several police reports and press charges to get a protective order because the first 3 times I called the police they did the same thing, just let it go. I tried to get a protective order, but since the police didn’t really do anything, I was unable to at that time.",
      "created_utc": 1726201531.0,
      "score": 10
    },
    {
      "id": "ln0uyl3",
      "body": "Have you checked to make sure your marriage is legit since Amy performed the ceremony?",
      "created_utc": 1726278462.0,
      "score": 8
    },
    {
      "id": "lm99l5c",
      "body": "Yes. Start removing him from all documents. He’s no longer the person to call for an emergency. ☹️.\n\nALSO take Amy off your children’s registered school forms as far as being able\nTo be picked up. Notify the front office vaguely of this situation so they can keep you abreast.",
      "created_utc": 1725878562.0,
      "score": 37
    },
    {
      "id": "lm90sm8",
      "body": "Is he a beneficiary in your will, or IRA, or anything else?\n\nIf he is, remove him from these documents.",
      "created_utc": 1725872660.0,
      "score": 24
    },
    {
      "id": "lmn1b0v",
      "body": "I did have another theory… which is pretty dark and I don’t want to get banned so I’m not going to comment what I think it is. But if THAT theory is right then both Luke and Amy need to go to jail. (Also with all the digging you did, if the dark theory is correct I’m sure you would already know about it or at least your lawyer.)",
      "created_utc": 1726077509.0,
      "score": 6
    },
    {
      "id": "lmdank5",
      "body": "So why do you think they never dated?",
      "created_utc": 1725930215.0,
      "score": 13
    },
    {
      "id": "lm8hlg1",
      "body": "It could just be that OP makes way more money",
      "created_utc": 1725859516.0,
      "score": 14
    },
    {
      "id": "lm8ftur",
      "body": "You told his mother. He will not be blindsided.",
      "created_utc": 1725858472.0,
      "score": 48
    },
    {
      "id": "lm88x72",
      "body": "Have to wonder if this is the wrong approach. You’re giving them time to paint you as crazy, and once people are poisoned it’s very difficult to get them to even look at evidence. They’ll gaslight themselves into believing it’s all AI. Jfc look at how long they got you to gaslight yourself. You sat beside while she gave birth to your husbands children.",
      "created_utc": 1725854754.0,
      "score": 33
    },
    {
      "id": "lm8cifk",
      "body": "Take notes, y'all. THIS is how you handle shit in boss mode.",
      "created_utc": 1725856623.0,
      "score": 45
    },
    {
      "id": "lm8s5dd",
      "body": "Hi there, I'm just so, so, sorry, that you're going through so much. My ex his an entire other wife, and family, from me, and everyone knew, his mom, and siblings, my boss, his boss, our \"friends\", you name it. My whole world crumpled overnight the day I found out that everything in my life was a lie. \n\nIt was one of the single worst times in my life, and I thought my life was over. It took time, and a LOT of therapy, and hard work focusing on healing, but bit by bit I got stronger, and learned to love, and forgive myself, for so much of the self-hatred I directed within, and the terrible choices I made in those really dark early years. \n\nI made new friends, picked up new hobbies, and eventually became friends with a kind, and funny, man, who became my best friend, and later my husband. We've been married now for 18 wonderful years, and he's still my biggest cheerleader, and best friend. \n\nI look back now on how horrific everything was back then, and how the pain of so much betrayal, and abuse, turned me into such a grey ghost, and I don't even recognize the person I was back then anymore. \n\nSo many things changed, and I changed, and my dad excuse of a partner, and father, has lived a miserable life, full of every single drop of the karma he deserved, and brought on himself. \n\nI know you can't see it now, but one day in the future you will be able to look back, and be glad you got this toxic cloud of negativity, and selfishness, out of your life, as a husband, and you'll be able to come through the other side, stronger, and happier, and ready to rebuild your life, and your children's lives, into something wonderful together. I promise. \n\nI also wanted to mention that you should consider putting a freeze on your credit report through all 3 major credit bureaus. It's very easy to do, and it will prevent him, or anyone else, from opening a line of credit in your name. \n\nYou should also put a freeze on your children's credit reports, the same way. The freeze can remain in place on their credit reports until they turn 16. This will protect them from anyone trying to use their name, and social security numbers, to open a line of credit. \n\nYou can pause the freeze anytime you need a credit check, or need to open a line of credit. I'm not sure if links are allowed here, so just search for, \"how to freeze my credit through all 3 major credit bureaus\", and, \"how to freeze my children's credit through all 3 major credit bureaus\", you should see search results online with instructions. \n\nFeel free to run this plan by your lawyer, and get her opinion. She sounds wonderful, and I'm so glad you have someone so caring in your corner. \n\nJust take it one day at a time for now, and be patient with yourself. You've had a horrific shock, and your emotions are going to be all over the place for a while, and that's normal. \n\nYou'll get through this, one step at a time, and just keep reminding yourself that the pain you're feeling is better than continuing to live a lie with someone who only cares about their own selfish needs. \n\nYou, and your children, deserve better, and you've taken the first huge step towards taking back your power from this pathetic, self-involved, caricature of a man. \n\nYou're a strong, badass, woman, and you're done taking any shit from this lying hobgoblin. \n\nHang in there, sending lots of love, and invisible hugs, your way. \n\n🫂💜🫂",
      "created_utc": 1725866422.0,
      "score": 20
    },
    {
      "id": "lm8beu6",
      "body": "[deleted]",
      "created_utc": 1725856035.0,
      "score": 48
    },
    {
      "id": "lm8gq0b",
      "body": "Yep. This is a creative writing sob story. \n\nThe denouement of the storyline unraveled rather quickly. The mountains of hidden evidence. The secret, supportive characters. The conflicts. Not one but two antagonists. \n\n👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻\n\nIt was one of the better fake narratives in Reddit-land. \n\nSo OP is correct - the reality of this *life story* was never hers as it's fake, but at least take credit for the imaginative one.",
      "created_utc": 1725858996.0,
      "score": 86
    },
    {
      "id": "lm8xxxz",
      "body": "It’s definitely Days of our Reddit.",
      "created_utc": 1725870599.0,
      "score": 7
    },
    {
      "id": "lm9vb65",
      "body": "What throws me off is the frequency of the updates, as if they were written in real time but they don’t seem to line up with school days / weekend.",
      "created_utc": 1725888639.0,
      "score": 18
    },
    {
      "id": "lm8jqdf",
      "body": "It's a good read when not sober too if it were to be fake.",
      "created_utc": 1725860826.0,
      "score": 23
    },
    {
      "id": "lm8kn7p",
      "body": ">she keeps saying they aren’t light enough to be his dad’s kids.\n\nI didn't love that part, its not how genetics works.\n\nThis whole thing about her suddenly being the only one on the house title too, not how it works, he would still be entitled to half the house.\n\nMost of the \"evidence\" of Amys nudes wouldn't fly either.",
      "created_utc": 1725861396.0,
      "score": 28
    },
    {
      "id": "lm8yaaq",
      "body": "It’s absolutely illegal and no lawyer would recommend it for that reason. Agreed it also highly unlikely that the home wouldn’t be considered community property.",
      "created_utc": 1725870846.0,
      "score": 20
    },
    {
      "id": "lm8ytqs",
      "body": "Also the attorney definitely showing up in the middle of the night. ",
      "created_utc": 1725871239.0,
      "score": 20
    },
    {
      "id": "lm8xhi6",
      "body": "And her lawyer is neatly explained to be a former friend from college to explain the doubts people had about her being able to contact a lawyer so quickly in the first update. Which also comes in clutch when she wants a dramatic midnight rendezvous with her to gather up all the evidence. \n\nAll the evidence that goes back years and years on his phone.... Which makes no sense. For one, most apps only hold things in the trash bin for like a month before permanently deleting them. Secondly, once she brought up her suspicions to them, there's no way he didn't go in and manually permanently delete everything. Thirdly, she said she checked deleted pictures in the first post but now that someone taught her how to find deleted messages, that magically made deleted videos and photos appear where she has already checked too?",
      "created_utc": 1725870270.0,
      "score": 32
    },
    {
      "id": "lm9z2ff",
      "body": "True. I feel like we need a narrator saying something like:  \"Previously on Reddit \"...",
      "created_utc": 1725890013.0,
      "score": 14
    },
    {
      "id": "lm8b2n6",
      "body": "Sophie and Tom are going to burn Luke and Amy and I have a suspicion that those two will tell the other children in a way that the lying cheating assholes won’t be able to twist it around.",
      "created_utc": 1725855856.0,
      "score": 69
    },
    {
      "id": "lmk6voq",
      "body": "I doubt that.   She will own it all and say that she had him first and that you were never anything but a secondary figure to him.   \n\nThis was not an affair.  From the very beginning, yours was a bigamous marriage in all but name and that's the way Luke and Amy saw it.   Your role was to support her -- going to the delivery room, seeing to it that she had what she needed, etc.  She will relish the fact that she can say how little you counted to them.   She is going to be vicious.   You will be leaning on your therapist a lot.",
      "created_utc": 1726030885.0,
      "score": 20
    },
    {
      "id": "lmdsliw",
      "body": "Was he Mormon? Could this be an unconsentual polygamy thing to him?",
      "created_utc": 1725937047.0,
      "score": 5
    },
    {
      "id": "lmdvxua",
      "body": "You might just start forwarding them to your lawyer. If she's supposed to be handling all communication for you, just forward them. Make sure you set up with her a way that he can see the kids so he doesn't claim you're keeping them from him.",
      "created_utc": 1725938458.0,
      "score": 22
    },
    {
      "id": "lmehdtj",
      "body": "You need to be very, very careful about the two of them. They’ve had literal decades to come up with their version of events, as you saw when you confronted them recently. It appears part of their strategy is to paint you as mentally unwell. That means they not only disrespect you enough to lie to your face for years, but also don’t care if they publicly shame you, too. \n\nAmy’s lack of response is consistent with her general laissez faire attitude toward life, but that’s a façade. She’s actually been very, very calculated from the get-go. She didn’t mysteriously get pregnant right around the time you and Luke got married. That was intentional. Everything she’s done has been. \n\nHer getting pregnant when you were engaged was her last ditch effort to get him to marry her instead (or at least not marry you). When that didn’t work, she went forward with the pregnancy in order to keep her hooks in Luke in some capacity, even if it was just as his (secret) baby mama/mistress. \n\nShe’s always known she was only good enough for that role and she resents you because you got the role (as his wife) she felt was rightfully hers. That resentment has had years to fester into hatred that she easily hid under the guise of a friendship with you. \n\nTheir relationship is only partially based on their “love” for one another. The rest is based on her envy of you. She wanted your life and had to settle for a shadow of it. She convinced herself you looked down on her, but really it was just her insecurities. \n\nI’ve seen the “secret second family” thing happen IRL twice, although one was after the fact. Neither of them created a scenario where their wives became “friends” with the second family, though. \n\nIf you’d like to see what could have been you if you hadn’t figured it out when you did, you can look up one of the two real life examples I mentioned. I used to work for Charles Kuralt’s brother (yes, that Charles Kuralt) and the legal debacle that followed Charles’ death was appalling. If you’d prefer the tldr, his mistress of 29 years got land and a cabin after dragging his widow through a court case over it. His wife had no idea about the affair partner prior to that. \n\nIt takes a certain level of psychopathy to be able to not only have an affair, but successfully hide it for decades. Luke and Amy took it several steps further by creating their family and dragging you into their ridiculous mess as the oblivious wife. \n\nPeople have called you naïve, and perhaps that’s a part of it, but who would expect this? Most (normal) people wouldn’t expect that their partner and their longtime friend would do this to them. \n\nAs others have recommended, you need cameras, both interior and exterior. For the exterior, you’ll need to put them at all doors and all corners. Interior will need to be in all shared spaces, including your garage. \n\nOnce the forensic accountant has combed through the financials, you can see in writing how much money has been spent to subsidize Amy’s lifestyle. Luke wouldn’t have had as much money to fork over to her if you hadn’t been supporting him the whole time. \n\nPerhaps the accountant can provide a simplified version to Amy so she can see that she has very much benefited from your income, even if it was indirectly. I recommend crayons in case she needs it drawn out. \n\nYou also need to get ahead of their narrative asap. If your attorney recommends you avoid posting about it on social media, you can still give your friends (particularly the mutuals) a truncated version. I wouldn’t be surprised if some of them either knew or at least suspected before now. \n\nRegardless, you’re going to go through a divorce with a person you don’t really know. What you do know is that he is cold hearted enough to waste literal years of another person’s life. He got the love of two women and simultaneously prevented you from finding someone who truly loved you. \n\nGood luck with everything, OP, including going scorched earth on both of them.",
      "created_utc": 1725950335.0,
      "score": 18
    },
    {
      "id": "lmdw5r2",
      "body": "Oh, I wish I knew what he was saying!!",
      "created_utc": 1725938556.0,
      "score": 11
    },
    {
      "id": "lme2a1h",
      "body": "So smart of Amy to stay well away from you.  Send those voicemails straight to your lawyer, Paige can sift through them for anything she can use. \n\nAt this point nothing he says could make a difference. Justifications, excuses, blame, apologies. You're not in the right space to hear any of that and when you are you will only want to hear the answers to some very specific questions.",
      "created_utc": 1725941455.0,
      "score": 4
    },
    {
      "id": "lm8v9bv",
      "body": "OP won’t destroy Luke or Amy, she too concerned about Amy’s children. Amy’s life isn’t going to change much",
      "created_utc": 1725868664.0,
      "score": 5
    },
    {
      "id": "lm8hhul",
      "body": "She probably made him delete them. She’s his primary partner. She’s the one with full disclosure and had been granted the agency to make fully informed choices.",
      "created_utc": 1725859455.0,
      "score": 55
    },
    {
      "id": "lm9qsyu",
      "body": "wait for the attorney green ligth before doing it.",
      "created_utc": 1725886807.0,
      "score": 25
    },
    {
      "id": "lm9svp8",
      "body": "I would show him if he wants to see the truth, but maybe wait a bit to make sure that the laptop and phone are back in Luke’s possession. I would also make sure to not show anything that could be considered pornography just in case that could be a legal issue.",
      "created_utc": 1725887640.0,
      "score": 10
    },
    {
      "id": "lm8axla",
      "body": "[deleted]",
      "created_utc": 1725855782.0,
      "score": 33
    },
    {
      "id": "lm9dh7t",
      "body": "Especially if you aren't in a no-fault state.  If the end of the marriage is due to his infidelity (which it is), then you'll be looked on much more favorably.  And if you're the custodial parent, which is likely, then the family home is likely to be granted to you regardless.\n\nAnd if the money he's given Amy over the years can be tracked, then all that money should have gone to support your family, which might negate potential alimony (which his affair should also hopefully negate), and in a perfect world he'll be on the hook for child support as well, even if you out-earn him.\n\nI truly wish you the best of luck and the best outcome in all of this.",
      "created_utc": 1725880730.0,
      "score": 22
    },
    {
      "id": "lm9eiu0",
      "body": "When this all comes to light - he’s going to be open and move in with Amy. I don’t think he will care about the house. Especially since the children are involved. My main concern is alimony. You may be able to negotiate that, though. Tell you you’ll recoup the alimony money by during Amy for alienation of affection/emotion turmoil. \n\nBe careful with your MIL. She is technically on both sides. Try to get her to convince Luke to let go of the house and alimony if he goes after that. They have money to support them. \n\nMaybe she would be willing to tell Amy she will take away the house (bluffing) if Luke pursues to hurt you financially.",
      "created_utc": 1725881268.0,
      "score": 16
    },
    {
      "id": "lmaxaas",
      "body": "Does everyone that OP could argue he has another residence with Amy since he spent so much time there and paid so much towards the bills there all the time that OP should get a cut of that house if he wants a cut of \"their\" house.",
      "created_utc": 1725901727.0,
      "score": 4
    },
    {
      "id": "lm8kvlj",
      "body": "The letters where they discuss their children wouldn't convince him?",
      "created_utc": 1725861543.0,
      "score": 8
    },
    {
      "id": "lmjw7ga",
      "body": "You’re right. I hope all goes well for you and your family and I’ll keep you in my thoughts and prayers💘🙏🏽",
      "created_utc": 1726025894.0,
      "score": 10
    },
    {
      "id": "lmdbzem",
      "body": "You may be right.",
      "created_utc": 1725930704.0,
      "score": 285
    },
    {
      "id": "lma9vph",
      "body": "They knew OP took a hard stance against it so they didn’t have to. If they had, it may have looked more suspicious.",
      "created_utc": 1725893736.0,
      "score": 309
    },
    {
      "id": "lmb4pcm",
      "body": "Of all the piles of shit they people took and rolled in, that one was the most vile.",
      "created_utc": 1725904131.0,
      "score": 5
    },
    {
      "id": "lm8fk65",
      "body": "I wonder what Tom and Sophie have said to their siblings too. Owen asking about if it’s because of Amy can be hopefully in a way that he doesn’t know really what’s happening. They don’t need to be that involved in this kind of bullshit.",
      "created_utc": 1725858314.0,
      "score": 76
    },
    {
      "id": "lm99rtp",
      "body": "Oh he’ll be there before the day is out. They will meet up to try to take control of the narrative",
      "created_utc": 1725878670.0,
      "score": 10
    },
    {
      "id": "lm9iw48",
      "body": "That’s true. But if you use it enough you can ask it to write in your style. So instead it cuts out the fluff and sounds more like a normal person.",
      "created_utc": 1725883381.0,
      "score": 59
    },
    {
      "id": "lmc1mhv",
      "body": "I was going to say this isn’t likely AI as well no use AI pretty much every day in my job to have it write stuff (passages, poems, questions, etc.) and it’s really difficult to get decent writing out of it. There’s a lot to be said for the human factor when it comes to creative writing. \n\nThat being said, I doubt everything I read, especially on Reddit. LOL I want this to be fake, but it’s almost too crazy to be fake. If it is fake, she needs to write a book. If not, I wish her all the best and hope the nightmare passes quickly. At least she’s now walking into the storm instead of waiting for it to come.",
      "created_utc": 1725914573.0,
      "score": 8
    },
    {
      "id": "lma4gat",
      "body": "Yea, OP wrote about the DNA test “loophole” but these kinds of popular stories get around and are occasionally found by friends and family. I would never risk someone finding out about all the legal crap I’ve done from a *reddit post*. Even if OP thinks she can’t be traced to the account, it looks dirty as hell in court.",
      "created_utc": 1725891886.0,
      "score": 131
    },
    {
      "id": "lma3s13",
      "body": "OP is actively in the comments giving details. She said Saturday in replays that Luke was love bombing her and buying her flowers, being overly attentive, ect.. But she gets the kids off to school on Sundays update? It doesn't make sense. She has been active in the comments since the begining, but you are falling apart and answering questions and giving details holding this update in your pocket. Then OP is gonna claim she found iCloud storage with pics and videos of cheating, then says she doesn't have definitive proof for the courts. But you still had the laptop and phone and didn't make copies? ",
      "created_utc": 1725891653.0,
      "score": 11
    },
    {
      "id": "lm9bock",
      "body": "Depends where you live for community property.",
      "created_utc": 1725879758.0,
      "score": 14
    },
    {
      "id": "lm9cbx8",
      "body": "Maybe this is all just a male author's fantasy",
      "created_utc": 1725880115.0,
      "score": 99
    },
    {
      "id": "lm9enxz",
      "body": "Damn I forgot to include that in my essay comment about why this is fiction and the quality of the writing has dipped. It struck me too.",
      "created_utc": 1725881341.0,
      "score": 32
    },
    {
      "id": "lmha9ib",
      "body": "Yeah that was the minute the shark really jumped, and it got higher when the lawyer showed up at midnight.",
      "created_utc": 1725993768.0,
      "score": 8
    },
    {
      "id": "lm8q74x",
      "body": "I actually started hearing this being read to me like an old-fashioned mystery on an antique radio complete with the cool, crackling connection, tinny voice, and suspenseful music interludes.",
      "created_utc": 1725865065.0,
      "score": 100
    },
    {
      "id": "lm8ks4q",
      "body": "I’m of the opinion that you are who you surround yourself with. Even if they do not participate, you’ve shown me where you stand, and you haven’t given consequences. I don’t even associate with cheaters. If you can betray the person you supposedly love, how can I trust you just as a friend? \n\n*Not talking about the kids, just replying to the opinionated part of your comment. I agree!",
      "created_utc": 1725861483.0,
      "score": 77
    },
    {
      "id": "lm89k1i",
      "body": "I am so worried and sad for all of them.",
      "created_utc": 1725855075.0,
      "score": 214
    },
    {
      "id": "lm8fclr",
      "body": "Even just seeing Amy described as my children's stepmom gave me such a wave of nausea.",
      "created_utc": 1725858193.0,
      "score": 167
    },
    {
      "id": "lm8okmh",
      "body": "It's going to be much easier than that once his lawyer gets the actual story from the OP's lawyer...with receipts.",
      "created_utc": 1725863975.0,
      "score": 47
    },
    {
      "id": "lm9cjdw",
      "body": "“Of course. I deleted it off my phone after downloading it on my cloud. I’m not stoopid after all”",
      "created_utc": 1725880230.0,
      "score": 8
    },
    {
      "id": "lm8ogza",
      "body": "> hey can see their half siblings when they go to their dad's house \n\nThey don't have to go to their dad's house.   If she gets full custody, they can have visitation at his parents' house.",
      "created_utc": 1725863908.0,
      "score": 24
    },
    {
      "id": "lm8t6yp",
      "body": "I was looking for this. The alienation of affection sounds like a law that should be universal in order to make this kind of perverse fraud punishable by law.",
      "created_utc": 1725867168.0,
      "score": 14
    },
    {
      "id": "lmmffna",
      "body": "No, he was (lightly) raised Christian. \n\nShe was raised Jewish, I don't know how light that one was. \n\nShe doesn't talk to her parents. \n\nOh, trust me, that's on the itinerary.",
      "created_utc": 1726070560.0,
      "score": 41
    },
    {
      "id": "lm8ooti",
      "body": "That could 100% be the real reason! He dosent see her as a person he could marry. And considering that shes willing to sleep with married men i kinda get that. But Luke isent exactly marrige material either. So like, u dont even know. But i think everyone can say we arent shocked that Luke was cheating the entire time. But the fact he will actually go to his parents and lie about everything when the signs are all there. Is he really that dumb or just dosent know when to realise he fucked up and take it from there.\n\nI also firmly believe the only reason Amy is stressed is because she had an affair and it will most likely ruin her relationship with her kids, but another thing is that she is deffinetly gonna end up losing the money Lukes family was helping her with.\n\nI just hope ones everything is out, that the In laws minimize contact with their son.",
      "created_utc": 1725864053.0,
      "score": 91
    },
    {
      "id": "lm8mfg6",
      "body": "Stop. He’s a POS who just wanted to cheat. He’s equally as guilty as she is.",
      "created_utc": 1725862548.0,
      "score": 41
    },
    {
      "id": "lm9rszy",
      "body": "But Amy’s first child is 2 years older than OPs…so she had her first while OP was dating him or already married…",
      "created_utc": 1725887211.0,
      "score": 4
    },
    {
      "id": "lmexdyz",
      "body": "I’m so petty, I’d be telling her he admitted it all to me!! He begged me to stay he said he could never be with someone like her as how could he take her in public, that’s why he hid it from everyone and he feels disgusted with himself, but she had been blackmailing him all these years! When he denies it, I’d say of cause he could lie to you, he lied to me all these years! And then I’d say, how do you think I confirmed it! I’d like to put the torment in her head that had been going on in mine!",
      "created_utc": 1725961905.0,
      "score": 6
    },
    {
      "id": "lmayv8h",
      "body": "I think you’ve got it right… they enjoy the illicit nature of the relationship.  I wonder if they’ll actually work in an above board relationship, or if they’re both too toxic to make it work on a daily basis.",
      "created_utc": 1725902249.0,
      "score": 17
    },
    {
      "id": "lm904va",
      "body": "Tell them all to check reddit!",
      "created_utc": 1725872189.0,
      "score": 11
    },
    {
      "id": "lm8oufl",
      "body": "I don't talk to my family and at the time, I wasn't making a lot of money. But income potential, that's possible. He always knew I was going into a high income career.",
      "created_utc": 1725864159.0,
      "score": 243
    },
    {
      "id": "lm9l5qp",
      "body": "I think the DNA tests confirming his paternity will prove he has a long history of cheating. His big problem will be that OP won't be financing him and Amy anymore. Oh woe is them!",
      "created_utc": 1725884406.0,
      "score": 22
    },
    {
      "id": "lma2vmi",
      "body": "Yep. My greatest regret in my divorce was not getting ahead of the narrative and outing the asshole as a rapist and cheater to everyone we knew, thinking it would make me look petty and vindictive. Well, the story he gave everyone made me look worse than outing and shaming him would have. (Spousal rape meant i had literally zero evidence that couldnt be explained away as typical marital sex. Fucker was smart enough not to hit me and leave bruises). Its been several years and im still kicking myself for not getting ahead of it.",
      "created_utc": 1725891341.0,
      "score": 14
    },
    {
      "id": "lm9vbct",
      "body": "This is THE BEST ADVICE. I genuinely hope OP does every bit of this.",
      "created_utc": 1725888641.0,
      "score": 7
    },
    {
      "id": "lmaktil",
      "body": "Is there a way she can also sue for defamation in there. Going around telling people she’s having a mental breakdown is kind of character assassination",
      "created_utc": 1725897417.0,
      "score": 9
    },
    {
      "id": "lm8jz8g",
      "body": "That is so true. Here, these two could have just stayed together, but no, they chose to ruin so many years of op's life and the lives of the kids. They should definitely face the consequences of their actions.",
      "created_utc": 1725860979.0,
      "score": 7
    },
    {
      "id": "lm99azv",
      "body": "I agree. She needs to blast them. Obviously she can’t start telling everyone about the evidence she acquired for the divorce but she absolutely can tell people that she has evidence going back several years that he’s been having an affair with Amy and she’s had enough. That’s all she needs to say. She doesn’t have to get into the nitty gritty of any DNA tests or the evidence she’s seen - just that it exists and that’s why she’s divorcing him. \n\nIf she doesn’t get a handle on the narrative, Luke and Amy will make her out to be the crazy one and her younger kids are going to start believing it too because that’s what their community will believe. She needs to stop protecting Luke and start protecting herself",
      "created_utc": 1725878393.0,
      "score": 8
    },
    {
      "id": "lm8idqi",
      "body": "Yeah, divorce is one thing, but asking specifically if he was going to Amy means a WHOLE LOT. It means the kids have seen instability they shouldn't have needed to be aware of or observe at their age. I can't even think of what went through their brains. I don't think they were happy. They knew it was a house of cards. \n\nNo one should live like that. I wanna put my fist through those psychos and believe me, that's wild for me since I get angry like 3 times a year max.",
      "created_utc": 1725860002.0,
      "score": 73
    },
    {
      "id": "lm9dfmz",
      "body": "Absolutely. She needs to use it as leverage. Ie I won’t go after everything Amy has that I’ve contributed to if I don’t have to pay you alimony. \n\nNow is not the time to be nice. They’ve taken advantage of her for far too long",
      "created_utc": 1725880707.0,
      "score": 69
    },
    {
      "id": "lmmkmw1",
      "body": "Looking into that as well.",
      "created_utc": 1726072235.0,
      "score": 45
    },
    {
      "id": "lm8ggbb",
      "body": "I've been reviewing the letters. It's pretty damn clear to me now that they are. \n\nIn one letter, they talk about Kaylee, and explicitly mention her allergy and how she got it from Luke.",
      "created_utc": 1725858838.0,
      "score": 147
    },
    {
      "id": "lm9krhb",
      "body": "Yeah, about that. I kind of proposed to him...",
      "created_utc": 1725884232.0,
      "score": 53
    },
    {
      "id": "lmcf02y",
      "body": "Good point. ",
      "created_utc": 1725918848.0,
      "score": 7
    },
    {
      "id": "lm8djhm",
      "body": "I wanted to start therapy anyway. \n\nThank you, commenter. \n\nHah, I would, I would in a heartbeat, but I think Amy would sooner die then let that happen.",
      "created_utc": 1725857180.0,
      "score": 137
    },
    {
      "id": "lmesxvn",
      "body": "Ouch. That is a horrible thought but it could have been the plan given the evidence that OP has uncovered. Given the potential backlash they probably would have had to take things slow and give the illusion that one didn't have anything to do with the other. It just happened because his feelings for his childhood friend changed and grew as she helped him deal with the divorce and his vindictive paranoid ex wife.",
      "created_utc": 1725958708.0,
      "score": 11
    },
    {
      "id": "lm9jz8v",
      "body": "His mom thought they were. That's why they've been supporting her. Because those were probably their grandchildren. His dad was adamantly against him doing something like that. She had a conversation with his parents in one of her updates and she explains this. So either dad knew and was trying to cover or he's in for the shock of his life",
      "created_utc": 1725883877.0,
      "score": 23
    },
    {
      "id": "lma9ro8",
      "body": "People seem to forget or just never read that they raised Amy from age 11 on. So they most likely would have helped her regardless even though Cat had suspicions.",
      "created_utc": 1725893698.0,
      "score": 16
    },
    {
      "id": "lm8jopx",
      "body": "Let him sweat.",
      "created_utc": 1725860797.0,
      "score": 135
    },
    {
      "id": "lm9drdr",
      "body": "Cutting Amy off would mean cutting off the grandkids. She's not going to do that. But Luke won't be able to give her money anymore. OP makes more than him. He was using her money to give to Amy",
      "created_utc": 1725880878.0,
      "score": 10
    },
    {
      "id": "lm8grd5",
      "body": "Paige has actually sent him an email asking for his lawyer's information and telling him not to contact me except through her.",
      "created_utc": 1725859018.0,
      "score": 104
    },
    {
      "id": "lm9lj6t",
      "body": "A small savage part of me thinks \"bring it on.\" \n\nBut in reality that would be terrible for everyone involved.",
      "created_utc": 1725884571.0,
      "score": 66
    },
    {
      "id": "lm8r643",
      "body": "I'm not asking them to do anything. But if their siblings ask them questions, they'll know how to handle that with grace.",
      "created_utc": 1725865733.0,
      "score": 32
    },
    {
      "id": "lmw457f",
      "body": "Zack did sent him a message to let him know he was providing me legal counsel and could no longer represent him moving forward.",
      "created_utc": 1726209730.0,
      "score": 46
    },
    {
      "id": "lmvq88t",
      "body": "I don't know. Reddit didn't send me any notifications about it.",
      "created_utc": 1726201615.0,
      "score": 36
    },
    {
      "id": "lmn5c40",
      "body": "Dang it now I want to know what your theory is. Never tell me you can’t tell me something, because it makes me NEED to know, lol.",
      "created_utc": 1726078799.0,
      "score": 14
    },
    {
      "id": "lmddpwq",
      "body": "There are about a hundred people in the chat wondering the same question and I am one of them.",
      "created_utc": 1725931335.0,
      "score": 49
    },
    {
      "id": "lm8980e",
      "body": "Oh there is far too much of it for it to be AI, some of it dated to years before AI was really a thing. \n\nIt doesn't matter. Showing this content outside of the courts is ethically dicey, regardless of the circumstances that could still be considered revenge porn.",
      "created_utc": 1725854906.0,
      "score": 90
    },
    {
      "id": "lm9e2jv",
      "body": "Metadata disproves any suspicions of Ai.",
      "created_utc": 1725881034.0,
      "score": 6
    },
    {
      "id": "lm8g46a",
      "body": "Haha I was literally just telling my husband I don't care if it's real or not, I'm now so invested. I've been updating him 😂 I need to know the climax, I need to know Luke and Amy get flayed.",
      "created_utc": 1725858640.0,
      "score": 53
    },
    {
      "id": "lm9aj0v",
      "body": "Who is Liz? \n\nThere's a story here that I don't know about! Please share the details?!",
      "created_utc": 1725879109.0,
      "score": 8
    },
    {
      "id": "lmbi3sa",
      "body": "Taking kids out of school within the first couple of weeks of the new year seems wild. Also, taking Tom out of school? Would guardians not have been notified if he just left after first period? And posting that she picked him up is not an admission she should have made.",
      "created_utc": 1725908438.0,
      "score": 8
    },
    {
      "id": "lm8qrrz",
      "body": "Actually, it depends on whether they were together and how much he contributed to the downpayment/mortgage whether or not he would have any claim to the house, as well as state laws. Those types of things are different in each state and country. If he put anything into the house in MOST states the house and land itself would be considered a marital asset. But not in all.",
      "created_utc": 1725865457.0,
      "score": 10
    },
    {
      "id": "lmcjjb8",
      "body": "Right, all incredibly convenient for this compelling work of fiction.",
      "created_utc": 1725920395.0,
      "score": 5
    },
    {
      "id": "lm8bage",
      "body": "Is it wrong that I hope this happens.",
      "created_utc": 1725855971.0,
      "score": 80
    },
    {
      "id": "lmdtscg",
      "body": "No, he was raised Christian but his family didn't take it that seriously.",
      "created_utc": 1725937540.0,
      "score": 21
    },
    {
      "id": "lm8b19o",
      "body": "Of course they will. I don't think anyone will buy it, though.",
      "created_utc": 1725855836.0,
      "score": 56
    },
    {
      "id": "lm9tuok",
      "body": "Exactly that money was given under false pretenses which in case of if they are in a community property state it would fall under “fraud on the community estate,” sometimes living in a community property state has its perks depending on the scenario!",
      "created_utc": 1725888052.0,
      "score": 15
    },
    {
      "id": "lm9fg7f",
      "body": "This is alll very sound advice!!!!",
      "created_utc": 1725881737.0,
      "score": 7
    },
    {
      "id": "lm9h0cf",
      "body": "Right, I wouldn’t completely trust the  in-laws here…",
      "created_utc": 1725882499.0,
      "score": 8
    },
    {
      "id": "lmjwnbj",
      "body": "Thank you, kind stranger.",
      "created_utc": 1726026075.0,
      "score": 18
    },
    {
      "id": "lmdjll7",
      "body": "This comment is truth. Of course, you don’t have to vent your pain and anger endlessly. However, they need to understand why this is happening. Leaving space for questions can cause them to actually start taking some of the blame on themselves, for other parties to create a fake narrative, or for them to become angry when they finally do learn the truth that so much was hidden from them. \n\nThey need to know that Luke and Amy have been cheating. For your whole marriage. \n\nThe truth is that a large part of the adultery probably took place in your home. Some (or all) of the kids may have suspicions. Or they may have directly seen some very inappropriate things. They may be carrying the burden of what they know because they don’t want to hurt you. For you to say it out loud gives them permission to release that burden. ",
      "created_utc": 1725933540.0,
      "score": 192
    },
    {
      "id": "lmdkyjz",
      "body": "Yes and your children had suspicions. Definitely the oldest two…maybe even your third one.\nI would tell them in a factual, gentle way.",
      "created_utc": 1725934052.0,
      "score": 67
    },
    {
      "id": "lmdtf16",
      "body": "My kids' therapist (they have been in therapy since early elementary) told me to always tell my kids the truth. To only answer the questions asked, but to be honest. So if they child asks, \"Are you divorcing because of Amy?\" The answer is yes, but only yes. If Sophie asks if you have proof, the answer is simply yes. She doesn't need to know there's years of photos, videos, and letters. He said that the act of them asking the question means they need the answer and the door open to talking about feelings related to the answer.",
      "created_utc": 1725937383.0,
      "score": 77
    },
    {
      "id": "lmdmbiz",
      "body": "I'm so sorry this happened to you! Why your husband and Amy both insist they were innocent when they're not, and the nerve of him to say you're mentally ill!!! They're HUGE AHs! Why couldn't they just get together long ago, and leave you out of it? They ruined the lives of ALL the children and YOU when all this pain was unnecessary!!\n\nIf you're hoping to have a \"gotcha\" moment when you begin divorce proceedings with Luke and his attorney, don't tell your children yet (except Sophie, who obviously already knows). Just in case they see him and say something to him to tip him off. \n\nBTW I think you know Reddit wants a video (it's not legal, I know) when that gotcha moment happens. I'd bet a bunch of money he's telling his attorney you're \"bonkers\", paranoid, and need medication, and his attorney's strategy is proving you mentally incompetent. I'd love to be able to see Luke's attorney's face when he sees the videos, texts, and photos, and discovers his client is a big fat liar and the case is not, in fact, mental illness. \n\nYou have enough evidence, and I don't know if you live in an at-fault state, but you may want to hire a PI to put a cherry on top for your STBX's adulterous cake. I don't know who the PI would have more fun following: Luke or Amy? LOL\n\nGood luck.",
      "created_utc": 1725934561.0,
      "score": 19
    },
    {
      "id": "lmhra1c",
      "body": "I just want to say that my parents split because my father cheated on my mom. I was pretty young but I wasn't really told anything and for years I thought I was the reason. I was the youngest of 3 so in my kid brain that meant I was the cause of the divorce. My grandmother finally spilled the beans when I was about 13 and I instantly hated my dad. I was old enough then to realize what that meant to know that for years I thought I broke up my parents when in reality it was because my dad couldn't keep his dick in his pants? Absolute rage as a teenage girl. It never got better between my dad and I. I stopped seeing him as my dad. If anyone asks my dad is my stepdad, the guy that actually helped raise me and made me who I am. I didn't even invite my dad to my wedding. Hell I didn't even tell him I was getting married. I've been married for 5 years now, with my spouse for 7 and my dad has never met him. All I'm saying is that it would be better for them to know now(even if it is a very pg explanation) than for them to come up with their own reason cause their reason could potentially do some serious mental damage in the long run.",
      "created_utc": 1725999095.0,
      "score": 13
    },
    {
      "id": "lmdnk2o",
      "body": "I think I'd hold off on the affair part for now. Like you said, you don't want to be accused of parental alienation.  I think you can allude to it without saying it. Something like:\n\n “I found out Dad was lying about something, and I can't continue to be with him because of it. (or maybe kept some things from me) What happened between the two of us should stay between us. Maybe we can discuss the matter more when you are adults, but right now, it isn't appropriate. That all of you only need to know is that we both love you all. I would prefer if what has happened between me and your father doesn't affect whatever relationship you decide to have with him.” (here, you are not pushing them to keep a relationship with him but letting them decide what they want)\n\nYou want to come across as the level-headed one in all this. They are trying to paint you as having a mental breakdown, so the less you give them, the better. \n\nThey will know dad cheated, and they will find out the other kids are this sibling. It will come out, so I think it's best if you are not the one actually telling them. Heck, Sophie might spill the beans, but no one will be able to say you were vindictive if your only answer is, “What happened between your father and I should stay that way.” \n\nThere is no way to keep it quiet, so you just need to keep it classy. Heck, you'll even make both of them look worse for telling everyone you are going crazy if you keep it classy and claim. \n\nLet the trash take itself out.",
      "created_utc": 1725935040.0,
      "score": 16
    },
    {
      "id": "lmh18g5",
      "body": "Get some therapist to tell them the truth in a child friendly way. That way in court you can defend yourself.",
      "created_utc": 1725990910.0,
      "score": 5
    },
    {
      "id": "lmljz56",
      "body": "I remember reading a Reddit story a long time ago of  a man that was cheated on and the wife left for the AP. He and his ex decided to play nice as co-parents for their daughter but as the daughter grew up she sided more and more with the mom and her AP/ turned husband.  When the daughter was getting married, the father who made a concerted effort to be an involved parent was relegated to guest while the AP walked the daughter down the aisle.  The OP/father wished that he had told his daughter the truth about the wife/mom cheating.   \n\nCertainly not right away, but soon you and your children should do therapy together and that is where your younger children should be told the truth because they have a relationship with your AH's other children and neither set of kids deserve to be hurt by your soon to be ex and his AP's shitty behavior.  Maybe Cat will be the bridge for all the children in time. But kids need to understand with the help of a therapist how wrong their father and Amy have been to you and them.  Otherwise, it seems Amy and Luke already have a story they are telling people- that you are crazy.  You should also have your lawyer make it part of the divorce that your children are never to be around Amy or Amy and Luke together since they are working together to damage your reputation by questioning your mental health.  They probably think they will get your kids and be one big happy family.  I hope Tom tells his sibs what is going on.  \n\nBest of luck OP to you.",
      "created_utc": 1726059931.0,
      "score": 7
    },
    {
      "id": "lmrj90s",
      "body": "Especially when they're trying to run the narrative that you're having some kind of break down.\n\nSide note: Loved you using his well used gaslighting tricks against him with his laptop and phone.",
      "created_utc": 1726148640.0,
      "score": 5
    },
    {
      "id": "lmaeqn3",
      "body": "Okay but previously to this stance they liked each other, and they were going to allow it until that came up! Also kids meet and play outside of the house, who knows what the fuck they could've gotten up to?! That's crazy",
      "created_utc": 1725895356.0,
      "score": 101
    },
    {
      "id": "lm9ap5x",
      "body": "Ugh. I so badly want the kids to throw it back in their faces.\n\nLuke'll sneak in late at night and Tom will pretend he's a burglar and smack him with a baseball bat.",
      "created_utc": 1725879207.0,
      "score": 22
    },
    {
      "id": "lm9nrug",
      "body": "Fair enough, I forgot about that prompt.",
      "created_utc": 1725885541.0,
      "score": 7
    },
    {
      "id": "lma58st",
      "body": "Yeah. These kinds of posts can be brought in and used against her. In her replies she’s flat out telling everyone how she thinks she’s covering her tracks and is at the same time uncovering her tracks by talking about it here. If it’s not fake then she’s making some very foolish decisions.",
      "created_utc": 1725892159.0,
      "score": 52
    },
    {
      "id": "lmapbii",
      "body": "Exactly, and wouldn’t Luke be considered a tenant? I realize this varies by state though… I’m still all-in for this roller coaster!",
      "created_utc": 1725899018.0,
      "score": 9
    },
    {
      "id": "lma4bv6",
      "body": "I was thinking that too about the school update! Like, are they in Sunday school or what? It sounds like BS.",
      "created_utc": 1725891845.0,
      "score": 10
    },
    {
      "id": "lmawquo",
      "body": "That line honestly made me immediately think this was written by a man",
      "created_utc": 1725901546.0,
      "score": 81
    },
    {
      "id": "lm95isu",
      "body": "What got me was the idea that a 17 year old boy wanted to catch his mom cheating so badly he suggested he would put a camera in her bedroom to video her having sex? Ahhh no- kids do not want to know their parents have sex much less video the evidence. \n\nAnd now all of a sudden she has the epiphany to go through the phone and laptop? How many posts later? What? That’s “is my husband cheating” 101. You do this long before you have a confrontation with the cheaters or a sit down with the teenage kids to plot to get the cheaters. Or now plot twist the teens are in cahoots with grandma to do the DNA test together so OP is not guilty of anything. \n\nAnd-now,  magically in the middle of the night the lawyer has divorce papers all drawn up for legal execution and delivery by the wife at will? \n\nI compulsively have to finish reading this saga though because I started it and I’m vested to know how the writer ends it all.",
      "created_utc": 1725875977.0,
      "score": 195
    },
    {
      "id": "lm89wqa",
      "body": "Yeah the adrenaline will soon pass. Each child will have a different way of reacting and coping, all eight of them. At least they have each other. \n\nOh one final thing I just thought of. Please play your cards close to your chest with the in-laws. They could turn on you any moment and be gathering evidence for Luke and Amy.",
      "created_utc": 1725855254.0,
      "score": 190
    },
    {
      "id": "lm8ckv3",
      "body": "My dear I hug you tight, ignore those comments where they insult you, god Luke and Amy are trash. The question we all ask ourselves is: why didn’t he marry her in the first place? I am so sorry for all of this. Even though you already felt it, it’s painful, you didn’t deserve any of this, they just lost a valuable woman. Girl we support you. Consider therapy for you and your children, this process will be difficult for them and also for you, do not allow Luke to tell another version to your children, as a liar he can manipulate them. I was hoping this was all a mistake and that Luke wasn’t cheating on you, but as I read all your posts I knew he was a liar. \n\nPlease take care of yourself, you are important too, hug your children a lot and remember this: you are a strong mom. ❤️❤️❤️",
      "created_utc": 1725856660.0,
      "score": 42
    },
    {
      "id": "lm8ad4d",
      "body": "I really hope the kids are told the truth, and told SOON.  They have been lied to enough, especially if any/ all of them are siblings. Even with counseling, unpacking all those trust issues will likely take years if not longer. Sounds like Luke and Amy will die on their hill of lies- the kids will need SOMEONE they know is honest with them, and hopefully that is you.",
      "created_utc": 1725855485.0,
      "score": 35
    },
    {
      "id": "lm9bu3n",
      "body": "You need to take control of the narrative so that they know when they hear lies from Luke and Amy, that it has nothing to do with you and it has nothing to do with them. Please take all of your kids to family therapy so that they can learn to cope in age appropriate ways.",
      "created_utc": 1725879845.0,
      "score": 6
    },
    {
      "id": "lm9rrdt",
      "body": "You should start booking family therapy ASAP. They will be most suitable to help you telling them the truth in an age appropriate way and help them navigate what will come ahead.",
      "created_utc": 1725887192.0,
      "score": 5
    },
    {
      "id": "lm9klyq",
      "body": "I don't see your kids making things easy on either of them if that happens. They will probably make her and your exes life miserable",
      "created_utc": 1725884163.0,
      "score": 30
    },
    {
      "id": "lm8fz54",
      "body": "What's even worse is that you will be working hard with kids in daycare while you ex and his partner will be enjoying the relaxing high life on his parents' money.",
      "created_utc": 1725858558.0,
      "score": 34
    },
    {
      "id": "lmcw19x",
      "body": "Your kids can’t be near her as long as she’s openly claiming you are mentally unstable. I think your lawyer can stipulate this.",
      "created_utc": 1725924937.0,
      "score": 4
    },
    {
      "id": "lma3dsu",
      "body": "And lawyers hate to be lied to. It makes everything so much more difficult for them. And sometimes they lose because if it. They really hate that. Of course, in this case, he’ll deserve it",
      "created_utc": 1725891517.0,
      "score": 20
    },
    {
      "id": "lm8un1d",
      "body": "Nope, I think Amy is stressed for other reasons. It's very easy for her to twist the affair to her advantage, especially to her children. Maybe Tom won't be so gullible, but the rest will be no problem. \n\nShe knew him first: we were together, but OP came in and destroyed our relationship with lies, and I just wanted to get what was mine first. \n\nMIL preferred OP, so we had to keep it a secret yadda yadda...\n\nTrust me, Amy and Luke have shown that the only people that matter are Amy and Luke. They will stop at nothing to come on top, and it will be easy since Tom is the first child, and they have known each other longer. \n\nI guarantee it, Amy will poison her children against OP. To whom is she saying that OP is having a mental breakdown? To her children, I'm guessing. Is that truly something to say to children? At least Luke is only saying it to his parents. \n\nThank God, for all the proof that OP got. They would have made her into a crazy person easy, and they still might. They probably have plan A through Z",
      "created_utc": 1725868214.0,
      "score": 63
    },
    {
      "id": "lm8o5is",
      "body": "Didn’t say he wasn’t. My theory is what he may try to say to explain himself.  Sorry I wasn’t clear on that. Did you think I was defending him?  🙄",
      "created_utc": 1725863690.0,
      "score": 26
    },
    {
      "id": "lma7skx",
      "body": "Very true.  I still think in his own twisted mind he convinced himself Amy wasn’t good enough to be the wife. Either that or they just took some sick pleasure in destroying someone’s life. Not just OP’s life but 8 children too.",
      "created_utc": 1725893035.0,
      "score": 6
    },
    {
      "id": "lmazuq9",
      "body": "My guess is that they will scatter like the roaches they are once it’s out in the light of day. They might try to make it work for a bit but once the secret is out, it’s not gonna be sexy anymore.",
      "created_utc": 1725902570.0,
      "score": 21
    },
    {
      "id": "lmbzg8d",
      "body": "In that case, I'd love to know so I can leave Luke and Amy a personal message about my humble opinion of them.",
      "created_utc": 1725913898.0,
      "score": 5
    },
    {
      "id": "lm8plyh",
      "body": "It could be that they started cheating but didn't want to let go of your financial and emotional contribution to the family. They are like leeches and just didn't want to let go of all the benefits they were getting.",
      "created_utc": 1725864671.0,
      "score": 132
    },
    {
      "id": "lm9w637",
      "body": "I wouldn’t undersell yourself. If their affair predates you back to them being teenagers, then honestly, you were simply the one he wanted more. \n\nHe knew Amy wasn’t going anywhere and he wasn’t satisfied with her. He chose you to marry, to live with full time, to be his public partner. At any time, he could have walked away and chosen her and his other family, but he continued(/s) to want you. Even if this was a kink to somehow have an unknowing third party, he gave you his last child & his name which she doesn’t have. Do not let them drag you into believing this was solely about your income. You are clearly a beautiful spirit.\n\nNo matter what happens next, you walk away knowing that it was nothing about you and solely about them and their inability to be good humans. \n\nMy heart aches for you, but I have no doubt you will be able to live well and have the best revenge, which is to remove yourself from their lives.",
      "created_utc": 1725888988.0,
      "score": 83
    },
    {
      "id": "lm8rjqt",
      "body": "Or maybe they are half siblings? That's the only thing that makes sense to me at this point.",
      "created_utc": 1725865994.0,
      "score": 11
    },
    {
      "id": "lm8q2up",
      "body": "That's why I think all this talk about keeping the two sets of kids together is misguided.  Do these kids not have any other friends or have the families been so enmeshed that they have no one else?  Do they have other friends from school, scouts, sports?   They may need separation rather than being kept together.",
      "created_utc": 1725864983.0,
      "score": 11
    },
    {
      "id": "lmmscav",
      "body": "Am so very sorry OP for your situation, heartbreaking, hope so much that everything will go well for you in the future.  Wanted to ask as I am curious to know how your husband is taking all this? Is he sad or upset about the fact that you want to divorce him?",
      "created_utc": 1726074686.0,
      "score": 5
    },
    {
      "id": "lma79ah",
      "body": "In any of the early letters does Amy ever express her wanting to be with him instead of you or express dissatisfaction with their situation? I admire the way you’re handling this, OP. You bided your time and got your ducks in a row. Hell hath no fury like a woman scorned. I’m cheering for you.",
      "created_utc": 1725892856.0,
      "score": 39
    },
    {
      "id": "lm9lh3e",
      "body": "Well, he still dated you and agreed to marriage while apparently carrying on a relationship with Amy. Who proposed is really not the point. How was she fine with all of that?",
      "created_utc": 1725884546.0,
      "score": 63
    },
    {
      "id": "lma2hmy",
      "body": "OP, don't let anyone tell you that you've failed here. You have shown so many admirable qualities that these shitheads have taken advantage of: loyalty, trust, generosity, kindness, grace, compassion. Once you have the time and space to process this, (if you wish) you will find someone who will show you those qualities back rather than take them for granted. I'm so sorry you're going through this. No one deserves this. I hope that in time you can find peace in knowing you don't have to deal with their dysfunction anymore. They will get exactly what's coming to them.",
      "created_utc": 1725891203.0,
      "score": 22
    },
    {
      "id": "lmcreo6",
      "body": "Amy has willingly been his secret side piece all this time. Accepting scraps of his attention for her and her children, while watching him marry, live, and have a happy family with you. What kind of massive insecurities would you have to possess to tolerate that treatment?!? And she is saying YOU are crazy?!? \n\nTo be clear, I don’t feel sorry for Amy at all, she made her bed and has been laying in it. This is just something I will never understand about long term APs. \n\nOP, I’m so sorry you had to see the proof. I applaud your patience. I’m glad you had the self respect to kick him out and the dignity to handle this with grace. All of the children, whether yours or not, will hold you in high regard for the rest of their lives. You are doing great! Hugs to you!",
      "created_utc": 1725923249.0,
      "score": 10
    },
    {
      "id": "lm9xbd7",
      "body": "And he agreed & she was forced to marry and watch the two of you publicly be together for the last 18 years while hiding in the shadows. \n\nThere is nothing about their relationship or dynamic that is remotely healthy.",
      "created_utc": 1725889426.0,
      "score": 15
    },
    {
      "id": "lm8e2m8",
      "body": "But maybe Luke and Amy should have a psychological evaluation done!! I mean affair for over a decade and would have continued, manipulating, gaslighting, emotionally abusing not only you but the children and grandparents!",
      "created_utc": 1725857471.0,
      "score": 55
    },
    {
      "id": "lmatu4m",
      "body": "PS. When Paige drops the mic on them, don’t feel guilty for enjoying their “surprised pikachu” faces. It is the least you deserve",
      "created_utc": 1725900588.0,
      "score": 7
    },
    {
      "id": "lmaw7hu",
      "body": "For the divorce they'll probably require both sets of parents to get one when it comes to custody of the kids. Me and my ex had to do them and then I had separate therapy that wasn't going to testify in court. You should do that too OP. One for you and a court ordered one.\n\nThe court ordered one told me that he'd never seen anyone as hard on themselves as I was, he added that the Pshycological evaluation test also made me look very paranoid but when scored considering the ex's family had made death threats (in court no less) and had tried to run me over while walking with our son at a library fun fair and were heavily contesting the divorce (trying to keep me trapped with him) it made sense. \n\nIt's usually one parent blaming the other, but my ex was a narcissist who blamed me for everything constantly, so I was used to blaming myself.",
      "created_utc": 1725901367.0,
      "score": 3
    },
    {
      "id": "lmaamom",
      "body": "I get that, but helped her with all of her kids without even asking who the fathers were! Why she’s not getting support for them or even trying to get support from the father/fathers. Heck even a blind squirrel will find a nut every now and then. Looks like she found several NUTS.",
      "created_utc": 1725893985.0,
      "score": 6
    },
    {
      "id": "lm9064x",
      "body": "I hope karma beats the absolute crap out of Luke and Amy for doing this to you.",
      "created_utc": 1725872215.0,
      "score": 37
    },
    {
      "id": "lmar8qb",
      "body": "I bet, he's probably went thru his phone and laptop deleting as much evidence as he can.",
      "created_utc": 1725899705.0,
      "score": 6
    },
    {
      "id": "lm9ef7b",
      "body": "No she won’t! One can only hope she shows Amy that her actions are disgusting! \n\nAnd that will be his problem.",
      "created_utc": 1725881217.0,
      "score": 6
    },
    {
      "id": "lm92xrk",
      "body": "Paige is a god-send.  She's fantastic and has your back.  Good for her!!",
      "created_utc": 1725874196.0,
      "score": 35
    },
    {
      "id": "lm9p3wu",
      "body": "Time to consider adding Ring cameras inside your home’s main areas. Just in case the kids let dad in while you’re not home and you walk into that mess. He can’t lie because it will be recorded. \n\nI’m so sorry, OP. May they both live the life they deserve and you find the love, peace, and happiness that you deserve.",
      "created_utc": 1725886112.0,
      "score": 75
    },
    {
      "id": "lm9ngx7",
      "body": "You said you have ring camera's. I would just lock the doors, call the cops and then sit in there and watch her have a melt down while laughing. In that order. Seeing her get escorted off your property would be very satisfying.",
      "created_utc": 1725885414.0,
      "score": 6
    },
    {
      "id": "lm8saup",
      "body": "You need to be the one to let them know before they ask Sophie. This is very much a situation which a 15 year old should not be responsible for handling. I totally feel for you and this is a terrible situation but Sophie shouldn’t be the one to break that news.",
      "created_utc": 1725866530.0,
      "score": 25
    },
    {
      "id": "lm8utj2",
      "body": "Their only response should be to talk to you. You are the adult, the parent and those kids should not be responsible for revealing something so ADULT to their younger siblings, whether they are willing to or not. This situation, if it was real would be tough to deal with on your own and the fact that the 2 oldest kids are involved has been outside your control but you can control it from here on out. \n\nSophie being your rock is going to lead to Sophie needing serious therapy because her mother relied on her to step in and mother the children while she went through a divorce. Get therapy for yourself straight away and dont confide or converse with your daughter about this anymore. With all the knowledge that she does have, she is probably mourning the loss of the father she thought she had and if you are confiding in her with every new bit of new evidence that comes up then you are making that loss for her, worse. Also making sure that her future relationships will be hard for her to navigate.",
      "created_utc": 1725868344.0,
      "score": 34
    },
    {
      "id": "lmx37oy",
      "body": "Is your husband aware that you have proof of his affair with her? Is he still denying this? I’m glad you told his parents too",
      "created_utc": 1726230764.0,
      "score": 9
    },
    {
      "id": "lmvr9qm",
      "body": "You can post directly on your profile since the sub is now deleting your posts.",
      "created_utc": 1726202150.0,
      "score": 21
    },
    {
      "id": "lmvspa5",
      "body": "Yes, please repost it bc I would really like to read the latest update too. I’ve been thinking about you and hoping this nightmare you’re facing was getting better not worse but from your comments it doesn’t sound like it is.",
      "created_utc": 1726202894.0,
      "score": 9
    },
    {
      "id": "lmnl3vu",
      "body": "Well, good news, my friend has assured me that much worse things have been posted on Reddit and since the dark theory coincides with the title a little bit I should be fine to comment it. \n\nSo, the only reason this thought even came to me is because I found myself in a situation where I learned that my now EX was into this fetish/kink. And yes it was the reason I broke up with them. I might even make my own Reddit post going into detail but honestly I don’t think I will. \n\nOn to the dark theory. To keep it short and simple: Luke and Amy planned to have two families with half siblings in the HOPES/INTENT that the kids would date each other and result in “accidental” in**st. 🤮\n\nThe way OP wrote Amy and Luke’s reactions, that OP was more upset about it than they were, it just gave me a horrible yucky feeling in my stomach. It sounds far fetched but sadly there are people who are into that and my ex was one of them. I feel yucky just typing this out!",
      "created_utc": 1726083849.0,
      "score": 17
    },
    {
      "id": "lmdgo31",
      "body": "[deleted]",
      "created_utc": 1725932432.0,
      "score": 14
    },
    {
      "id": "lm8hj5r",
      "body": "I would let them paint you as crazy and use that as them slandering you in the divorce proceedings. The more they make you crazy and the calmer you are about it the harder they fall.",
      "created_utc": 1725859477.0,
      "score": 29
    },
    {
      "id": "lm9bc97",
      "body": "[deleted]",
      "created_utc": 1725879568.0,
      "score": 12
    },
    {
      "id": "lm8en3e",
      "body": "Nope! I can see Kaylee hating the both of them once she find out. The poor girl has been asking about her father and he’s been in her life the whole time lying to her. \n\nDidn’t you say in one comment a few posts back that Luke said he didn’t care the Kaylee was curious about finding her father? That just goes to show you how disgusting and vile both Luke and Amy are! May they rot and this end with them losing everything including the trust and love from all 8 children.",
      "created_utc": 1725857789.0,
      "score": 52
    },
    {
      "id": "lm8bldj",
      "body": "No because they’d just be dealing with the consequences of their actions, they lied to EVERYONE, not just you, but his parents, the kids, all your friends and relatives… literally EVERYONE!",
      "created_utc": 1725856133.0,
      "score": 16
    },
    {
      "id": "lm8bpni",
      "body": "nope! if it does, let it. they’re young adults that are finally grasping some agency against adults that have been lying to them their entire lives. they should be allowed to tell the truth.",
      "created_utc": 1725856196.0,
      "score": 5
    },
    {
      "id": "lm8e8dc",
      "body": "No, you haven't done anything wrong.  Hell, you even gave him a heads up that you knew and those fuckers not only tried to make *you* feel bad but continued on the affair like nothing happened.  \n\nI'd be tempted to out them in the most humiliating way possible. Like an adults-only wedding renewal ceremony friends, family and all of their coworkers, with her as your maid of honor.  Probably not a good idea but they deserve something like that.",
      "created_utc": 1725857560.0,
      "score": 6
    },
    {
      "id": "lmdvakt",
      "body": "Okay, then I have no clue why they did this. If it was some twisted \"I needed a sister wife to fulfill my religious needs\" thing, it's f'd up, but at least there's a reason. Though if he needed a sister wife, no vasectomy since part of that is having babies, isn't it?  \n\nSo, it boils down to them dragging you, all these kids, and his family into a hell they have built for 20 years. Just because they are cruel. It's a cold, cruel fraud.",
      "created_utc": 1725938177.0,
      "score": 7
    },
    {
      "id": "lm8bzyk",
      "body": "[deleted]",
      "created_utc": 1725856348.0,
      "score": 21
    },
    {
      "id": "lm9spao",
      "body": "Especially not if MIL has been suspicious but hasn't said anything.",
      "created_utc": 1725887569.0,
      "score": 5
    },
    {
      "id": "lmq6lqs",
      "body": "Kids know. They may not know the details, but they know that their dad doesn’t act the same with ‘Amy’ when their mom is around. They can tell the difference and that is so damaging to be around such two faced behaviour and can give a kid real stress. There’s too many kids for them not to have been caught. And no one is that careful for that long. They know.",
      "created_utc": 1726121315.0,
      "score": 88
    },
    {
      "id": "lmk8z9l",
      "body": "That doesn’t work because those other kids are technically their siblings and I don’t think this will just stay secret until the youngest is 18. Answering the questions with gentle, age appropriate honesty is what you have to do. And age appropriate is a lot more than you think a lot younger than you think. \n\nAlienation would be if she shit talks him in any way. This wouldn’t be that. The truth—that he had an inappropriate relationship with Amy and that he wasn’t honest about it—should come from their mom, especially if they are directly asking. Lying or skirting around it or treating them like they are babies won’t help them and it will just lead to resentment of her from them and it will mess with their heads.",
      "created_utc": 1726032029.0,
      "score": 9
    },
    {
      "id": "lmafrwv",
      "body": "That’s true but we don’t know if Luke & Amy may have had some other plan. All we know is what happened from OP’s perspective. If she hadn’t stepped up, they may have.",
      "created_utc": 1725895697.0,
      "score": 22
    },
    {
      "id": "lmbcdj7",
      "body": "They never actually liked each other. The kids themselves said they had suspected that Luke and Amy were a thing. So they came up with the plan to like each other to see if they'd rock the boat. They didn't expect OP to be against it. They wanted to show how suspicious Luke and Amy might be.",
      "created_utc": 1725906592.0,
      "score": 12
    },
    {
      "id": "lmad20z",
      "body": "I like this idea",
      "created_utc": 1725894799.0,
      "score": 5
    },
    {
      "id": "lma071s",
      "body": "I was 99% sure it was fake, til I read that she asked the lawyer to draw up divorce papers and the lawyer said “I drew them up the first night we talked”. Lawyers don’t do unnecessary work, especially not for free.",
      "created_utc": 1725890368.0,
      "score": 79
    },
    {
      "id": "lm9eh56",
      "body": "Thank you these were my exact thoughts. I pointed out the signs of this being fiction on the last post and it's ramped up even more. \n\nThere was no mention of her lawyer before, yet she has papers drawn up and ready?\n\nShe 'forgot' that her husbands name wasn't on the house? Which depending on when the house was bought could be completely irrelevant and will at least be contestable since he's lived there for a long ass time. All of which her lawyer would know. Which leads me to her eviction of him which was surely illegal and again would have been advised not to do by her lawyer. It doesn't matter if his name wasn't magically on the house, you cant just throw someone out of the place they live without formal notice. Her lawyer btw who according to this story engaged in some serious illegal activity re the phone and laptop? \n\nAlso the pics and videos....\n\nSo let me get this straight. OP last checked the pics and vids and the recently deleted 3 months ago, finding nothing. The recently deleted file empties every 30 days (rolling, not as a complete dump every 30 days).\n\nYet she checks first his messages, then his photos videos again now, and finds a veritable treasure trove. \n\nSo riddle me this. Either Luke was for some absurd reason more paranoid 3 months ago and actually emptying his recently deleted files, (which makes no sense given recent apparent events) or there were no exchanges happening for at least the 30 day period prior to her checking, compared to the pornhub sites worth of content being shared in the most recent 30 days.\n\nNeither makes any sense. Not to mention, while this is a weaker counterpoint, these two have supposedly been shacking up for like 18 years minimum and they're still sharing pics and vids at the frequency expected of a couple just entering the throes of sexual mania?\n\nShe also managed to find all of this evidence, make a theft exchange with her lawyer, pack up ALL her husbands belongings, including the stuff in the bedroom, without waking him? I'm sorry was he living out of a bug out bag??? A hard-core devotee of the uber minimalist lifestyle? It makes no sense!\n\nThen there's all the stuff I pointed out on the last posy re use of language and narrative style. This isn't a recounting of traumatic events this is a narrative story designed for an audience.\n\nI was enjoying the tale up til now but the logical holes are far too big in this installment 💀",
      "created_utc": 1725881244.0,
      "score": 120
    },
    {
      "id": "lmaoiwc",
      "body": "Yep. This is a creative writing sob story. \n\nThe denouement of the storyline unraveled rather quickly. The mountains of hidden evidence. The secret, supportive characters. The conflicts. Not one but two antagonists. \n\n👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻\n\nIt was one of the better fake narratives in Reddit-land. \n\nSo OP is correct - the reality of this *life story* was never hers as it's fake, but at least take credit for the imaginative one.",
      "created_utc": 1725898736.0,
      "score": 8
    },
    {
      "id": "lm8a542",
      "body": "At this point, I trust Cat, even if perhaps I shouldn't. \n\nI'm not sure I trust Jim.",
      "created_utc": 1725855373.0,
      "score": 179
    },
    {
      "id": "lm9vpj9",
      "body": "I wonder the same thing. I think in her previous post, someone commented that Amy probably didn’t want to be tied down or something, so OP ended up being a backup. If that was really the case, that’s effed up. If they have feelings for each other, why drag OP into this mess in the first place? Given that OP is a ex Mormon, there’s a chance Luke is or was also Mormon, which could explain the marriage thing. Not an excuse of course.",
      "created_utc": 1725888802.0,
      "score": 9
    },
    {
      "id": "lm9cbhh",
      "body": "Yeah, they’re old enough to be told in an age appropriate way. By acting like Luke just moved out and nothing to see here is also gaslighting them in a way. They know something is wrong and they probably have an idea but no one is telling them anything concrete. It’s scary for them. I hope she takes them to family therapy and tells them what is going on. A family therapist can really guide the conversation in an age appropriate way",
      "created_utc": 1725880109.0,
      "score": 8
    },
    {
      "id": "lm9oh70",
      "body": "That's what I think.  And teens/pre-teens can be NASTY.  Luke & Amy are in for a very rough few years.",
      "created_utc": 1725885837.0,
      "score": 25
    },
    {
      "id": "lm8gm2i",
      "body": "Unless they cut him off. I really hope they do.",
      "created_utc": 1725858932.0,
      "score": 60
    },
    {
      "id": "lm8ylvm",
      "body": "Honestly that would not suprise me, i just hope her oldest kids and in laws have Critical thinking. Because the whole if OP \"got in the way\" its still a dumb reason. You can freely break up with people before it gets serious. But as you say the evidence is Honestly the best thing because it shows no matter excuses that Luke and Amy are full of crap.\n\nThey could have at any given moment told their kids who their father was and they didnt. That itself is enough for me to not want any contact in the future. If Tom goes NC with his mom i bet Amy would trashtalk Op to the fullest. Honestly i just hope OP gets to live with some peace. But Honestly i bet that Luke will move in with Amy after. The in laws wont stop contact but will deffinetly feel shame. I hopr op goes public so they cant create rumors.",
      "created_utc": 1725871081.0,
      "score": 27
    },
    {
      "id": "lmbofjh",
      "body": "Exactly! I’m going to assume they enjoy the sneakiness of it all.  And they’ve never been together through the everyday.  The daily care for one another and the kids.  Dishes, laundry, yard work, parenting, in-laws, jobs, etc.  they’ve only been each other’s good time friends. This side chick has been a one woman show for her entire parenting career, will she be able to handle him coming in and being a partner? It’ll be different for them both and considering their entire 18+ year relationship has thrived in the shadows, can they handle the spotlight?  Doubtful, in my opinion.  I think they’ll crash and burn and I hope OP can enjoy her front row seat.. they deserve to be miserable for what they’ve put her through.",
      "created_utc": 1725910469.0,
      "score": 14
    },
    {
      "id": "lmgve07",
      "body": "This is my favorite theory. He was a selfish cake-haver-eater but he loved OP more. I’m so sad for OP. How awful. She needs to put the situation ON BLAST!",
      "created_utc": 1725989063.0,
      "score": 8
    },
    {
      "id": "lm8ranf",
      "body": "I don't know if separation is ideal or even possible, but trust me, OP will not have to do much about that. I have been in Sophie's shoes. Thankfully, I was 18 when I found out, so my damage is not as extensive, but as the oldest of 10 (5_5), let's say the youngest are something else. \n\nThey might not want to see each other as much. Blame each other. No matter what anyone says, the children will go through it in their own ways, and relationships may be fractured.",
      "created_utc": 1725865821.0,
      "score": 5
    },
    {
      "id": "lmatuf2",
      "body": "Their dad was probably worried that inviting over lots of the kids school friends would lead to them voicing in front of the kids or their mom how much the kids from both families look like brothers and sisters.",
      "created_utc": 1725900591.0,
      "score": 4
    },
    {
      "id": "lm9rov2",
      "body": "What if it was her idea. What if she wanted this life. Like she wants a man but doesn’t want to live with him. And she enjoyed it? I can see some people being like that.",
      "created_utc": 1725887163.0,
      "score": 23
    },
    {
      "id": "lma1uy5",
      "body": "What's with this Amy as victim meme?  She wasn't forced to do anything, she told Luke he could have his cake and eat it too.   She's essentially been blackmailing him and his parents for years.",
      "created_utc": 1725890979.0,
      "score": 17
    },
    {
      "id": "lm9pphu",
      "body": "...not the worst idea...",
      "created_utc": 1725886360.0,
      "score": 64
    },
    {
      "id": "lm8vax0",
      "body": "That's very wise. I will tell Sophie to pass on that message. Tom, unfortunately, is a little bit more on his own. I can't really talk to his siblings right now. \n\nI want to be very clear that I'm not relying on Sophie to do anything.",
      "created_utc": 1725868696.0,
      "score": 54
    },
    {
      "id": "lm9hxvb",
      "body": "I agree. I’ve made a similar comment as well. A 15 year old should never be a rock for her mother. I get it that OP is going through hell right now but she needs to rely on adult friends and a therapist. She should not be relying on a teenager. It will only damage her daughter in the long run, which is obviously not OP’s intent but that will be the result nonetheless",
      "created_utc": 1725882942.0,
      "score": 7
    },
    {
      "id": "lmvshcf",
      "body": "Yes please post on your profile",
      "created_utc": 1726202775.0,
      "score": 11
    },
    {
      "id": "lmdijor",
      "body": "2-3 years. When Amy first got pregnant, we were already engaged. It was right around the point we got married.",
      "created_utc": 1725933136.0,
      "score": 45
    },
    {
      "id": "lm8fund",
      "body": "I don't recall him dismissing Kaylee's feelings like that, at least not voicing such ideas. But through his inaction that is basically what he's done.",
      "created_utc": 1725858485.0,
      "score": 55
    },
    {
      "id": "lm8c0gy",
      "body": "Exactly!! I want for just once that those that did the lying, the cheating will actually face consequences from all around them!!",
      "created_utc": 1725856356.0,
      "score": 7
    },
    {
      "id": "lm8cbvd",
      "body": "Paige isn't worried about the house.",
      "created_utc": 1725856524.0,
      "score": 36
    },
    {
      "id": "lm8cnv5",
      "body": "I think he’s afraid his parents will turn on him and Amy and disown them and remove them from their wills.",
      "created_utc": 1725856705.0,
      "score": 17
    },
    {
      "id": "lmbd2p7",
      "body": "Luke and Amy didn't outright say \"yeah don't do it though\" until later on in one post where OP told them she doesn't want them dating/liking each other. Also there's been about 3 posts now but I thought the original was saying that the son actually did like her? Don't quote me on that I'm just wondering if I remember that part correctly.",
      "created_utc": 1725906817.0,
      "score": 10
    },
    {
      "id": "lma9240",
      "body": "Maybe she's had them ready for 15 years because literally everyone in OP's life has known that her marriage was a sham.\n\n(/s kinda, obviously this is fake)",
      "created_utc": 1725893462.0,
      "score": 27
    },
    {
      "id": "lm9mql3",
      "body": "the continuous use of “paperwork” when talking about how the house makes me think it’s a kid with a creative writing project. \n\nshe bought the house but her husband isn’t on any of the “paperwork.”\n\n“we had plans to add him to the paperwork after I bought the house”\n\ni feel like someone who has actually bought a house would have said mortgage / title.….",
      "created_utc": 1725885099.0,
      "score": 73
    },
    {
      "id": "lm8dmpo",
      "body": " You need someone to talk to...find a therapist.   Keep Cat on an information diet.   She doesn't need to know the details of what your lawyer is doing.",
      "created_utc": 1725857229.0,
      "score": 200
    },
    {
      "id": "lm8eyml",
      "body": "Just trust Cat to be a good person and mother in law after all these years. You don't need to tell her anything you found, it will all come out in court. As for Jim, he might just be one of those annoying dads who think their son can do no wrong. He might not actually know about the affair, but he may side with his son anyway because...boy dad or something, I don't know. I'm wondering if your (ex)husband is an only child? That's honestly the only reason I could think of that his father would turn a blind eye to such an atrocity. Please keep us updated! I honestly can't wait to hear about what happens when they find out you found all that evidence. Also using your husband's laptop isn't stealing because you're married, you could have been looking for something completely different (old family pics to remind you of good times perhaps? Then surprise! Undisputed truth he and Amy are sleezeballs!) and just stumbled unfortunately on all that information, after all!",
      "created_utc": 1725857971.0,
      "score": 54
    },
    {
      "id": "lm8xo7f",
      "body": "Did you tell Cat that you found irrefutable proof of the affair and children??",
      "created_utc": 1725870402.0,
      "score": 34
    },
    {
      "id": "lm8abkr",
      "body": "Please just keep it very straight with Cat and Jim. You have no idea how your words and actions could be twisted.",
      "created_utc": 1725855464.0,
      "score": 54
    },
    {
      "id": "lm99dsm",
      "body": "At the end of the day. That’s her son. 🥺. Only tell her things you wouldn’t mind getting back to Luke. I feel so sorry for Cat, too. \n\nShe’s in a really really tough spot in the middle\nOf this shitstorm. I hope she never speaks to Amy again. That woman helped hurt all 8 of her grandchildren. That’s sick. \n\nIt seems like their hidden relationship was very sexually perverse. Like that was the main theme of it.",
      "created_utc": 1725878440.0,
      "score": 12
    },
    {
      "id": "lm9c21k",
      "body": "I wouldn’t trust Cat, at least not as a confidant. She’s on your side now but be aware that she may turn on a dime. He’s her son at the end of the day. I would definitely stay on friendly grounds with her and try to keep her on your side but do not tell her anything that could be used against you in the divorce",
      "created_utc": 1725879967.0,
      "score": 8
    },
    {
      "id": "lm8qn0p",
      "body": "I also can’t help but worry about Tom turning. He and Sophie both have been incredible thus far but Amy is his mother after all, do you think there are possibilities he might eventually be persuaded by Amy etc.?",
      "created_utc": 1725865365.0,
      "score": 15
    },
    {
      "id": "lml155a",
      "body": "I hope they get a really hard time from Amy’s kids. For them is a double lie. It’s not just the affair, it’s also the fact they didn’t know Luke was their real father.",
      "created_utc": 1726051029.0,
      "score": 6
    },
    {
      "id": "lm8pb8k",
      "body": "The grandparents won't do anything to hurt their grandchildren so they'll keep supporting the household. But I REALLY hope they bypass Luke in their wills and settle their estate directly on all the grandkids.",
      "created_utc": 1725864472.0,
      "score": 55
    },
    {
      "id": "lm92sn3",
      "body": "It's dumb but possible. If you follow so far. It feels like to me the most important thing for them is to be together but secretly. So blowing that up is going to bring ugly heads. \n\nAmy can say all sorts of things. OP was threatening her, or the children. \n\nImagine they weren't that worried about Sophie and Tom. OP was more freaked than them. That's because them looking like the good guys is more, and continuing their relationship is more important. \n\nWe'll have to wait and see what lies they come up with to get out of this. OP and her lawyer need to cover all the bases so well that they will have nowhere to escape because this is too sensitive, and they are the ones with the most to lose. \n\nJust imagine the amount of shame. At least Luke's with his vampire disease can stay safely inside, but for Amy (if she even cares), and the children ( even OP's). This situation will suck for everyone, even MIL and FIL. \n\nHeaven, I can't sleep. I can't stop thinking about all sorts of things",
      "created_utc": 1725874096.0,
      "score": 10
    },
    {
      "id": "lma2tut",
      "body": "She enjoyed knowing that she could have Luke any time she wanted.  and she proved it when she got pregnant within weeks of their wedding and OP was right there in the delivery room.    She enjoys knowing that she has a much stronger hold on Luke than the OP ever did.",
      "created_utc": 1725891323.0,
      "score": 45
    },
    {
      "id": "lmcimsh",
      "body": "Wait, no to victimising Luke either. He wasn't blackmailed, he would have been a LOT more distant from Amy if that was the case. He wanted this, the photos, the recordings, the texts, the leaving his wife to comfort the affair. He's in no way the victim, and neither is Amy",
      "created_utc": 1725920073.0,
      "score": 10
    },
    {
      "id": "lma2vg2",
      "body": "And I wouldn’t tell anyone. Just do it. Still record on your phone but now you have an extra layer of protection inside your home in case he pulls the “violent” card again. 🙄  No hiding his lies with video evidence, plus, who knows what Amy is going to do when this all comes out. Better to be safe than sorry. \n\nYou got this!",
      "created_utc": 1725891339.0,
      "score": 26
    },
    {
      "id": "lmd9hba",
      "body": "[deleted]",
      "created_utc": 1725929784.0,
      "score": 16
    },
    {
      "id": "lmce2ln",
      "body": "Especially if he is saying that you’re getting violent. It’s more of a reason to get them.",
      "created_utc": 1725918546.0,
      "score": 6
    },
    {
      "id": "lm8wvke",
      "body": "Unfortunately, their parents are your stbxh and his mistress. If Tom feels the need to correct some misinformation then so be it. Those kids will either be misinformed and manipulated into thinking one thing or they will know all the details, either way, they will still be under the care of the mistress, so it wont really matter. Letting Tom know that you will always be there for him and his siblings, no matter the results and the divorce is the best you can do and he can let his siblings know that too. \n\nI have seen you say that the kids need the money that you and the in laws have given them but just remember that Amy and the stbxh had choices and decided to bring those children into the world. If they cannot afford to raise them and those kids are neglected because of it then they should be taken from their care. Amy choosing to not use protection and have babies that she couldnt afford was wrong but due to the support you all provided, she was enabled to keep going and she did that by betraying you. It is not the kid’s fault but she should have to face consequences for her actions. Also if the kids see her facing those consequences then they will be less likely to follow in her footsteps. The world does not need more Amy’s.",
      "created_utc": 1725869829.0,
      "score": 28
    },
    {
      "id": "lmdjbuc",
      "body": "[deleted]",
      "created_utc": 1725933435.0,
      "score": 58
    },
    {
      "id": "lmbyv11",
      "body": "He pretended to like her. Both teens knew about the affair, and that they were likely half-siblings. They were trying to trick Amy and Luke into confessing by acting like they wanted to date. Very clever kids.",
      "created_utc": 1725913715.0,
      "score": 16
    },
    {
      "id": "lmb5lpi",
      "body": "This reads like a Lifetime miniseries script. Every update pulls me closer to believing this is fiction",
      "created_utc": 1725904424.0,
      "score": 14
    },
    {
      "id": "lm8dqrp",
      "body": "I'm not telling her that kind of information, and she hasn't asked.",
      "created_utc": 1725857291.0,
      "score": 183
    },
    {
      "id": "lm8xw13",
      "body": "I didn't say what it was, but yes, I told her I could prove it.",
      "created_utc": 1725870560.0,
      "score": 85
    },
    {
      "id": "lm99cu5",
      "body": "Cutting off their son and giving the money to their grandchildren instead wouldn’t hurt their grandchildren. As for impacting their current living situation, the grandparents can teach their grandbabies to come to them when they need something i.e. new clothes, money for the soccer team, etc.",
      "created_utc": 1725878424.0,
      "score": 13
    },
    {
      "id": "lmdehri",
      "body": "I do have friends. Sophie does sports so I'm friends with the moms on the teams. \n\nI can also begin to tell who is in my corner as my mutual friend group with Luke and Amy begins to hear about this and fracture. I can tell from who reaches out to me to see how I'm doing, rather than supporting them.",
      "created_utc": 1725931622.0,
      "score": 64
    },
    {
      "id": "lmf1rum",
      "body": "Amy's pregnancy was intentional on her part.  It proved that his marriage would not change her hold on him.   She didn't need marriage and he could have them both.",
      "created_utc": 1725964694.0,
      "score": 25
    },
    {
      "id": "lmc6jdh",
      "body": "Thank you for clarifying, my memory is usually fine except I did chemo Friday and so it's been a bit off😅 that was smart of them wasn't it?",
      "created_utc": 1725916104.0,
      "score": 8
    },
    {
      "id": "lm9x9y5",
      "body": "Everyone is telling you to step away from the grandparents. You seem oddly stubborn on this issue. The grandparents are not your friends. They will be there more for your husband than they will ever be for you. The grandma is straddling the fence at best. Lean on friends or a therapist.",
      "created_utc": 1725889411.0,
      "score": 37
    },
    {
      "id": "lm9ak8y",
      "body": "It sounds like the grandparents were having to support the household more than just new clothing. Amy had no mortgage or rent, had a job yet still needed money from grandparents and  Luke/ OP. Luke might need to write a few more articles",
      "created_utc": 1725879129.0,
      "score": 11
    },
    {
      "id": "lmdngf2",
      "body": "Yes.\n\nMake a boundary for yourself before this happens (maybe in therapy).\n\n\nMy boundary would be I could only be friends with people who cut them off 100%.",
      "created_utc": 1725935000.0,
      "score": 14
    },
    {
      "id": "lmf50hu",
      "body": "I feel like not only was it intentional but it was also used to keep him in line. You know?\n\nOP - I know you will prioritize taking care of the children and yourself and I hope you know that the rest will fall into place. \n\nThese two master manipulators will be hella surprised when all 8 kids figure this all out and go no contact with the cheaters. \n\nThe universe will have its say.",
      "created_utc": 1725966517.0,
      "score": 12
    },
    {
      "id": "lmcaj3z",
      "body": "I was impressed! They seem very mature for 15 and 17 years olds.",
      "created_utc": 1725917398.0,
      "score": 9
    },
    {
      "id": "lm9y4li",
      "body": "They are my friends, and I believe they're good people. \n\nBut I don't know why people think I'm trusting them to have my back on this. I literally said from the first that if push came to shove, they would have to choose Luke. To an extent, I AM stepping back from them now, but there's no bad blood.",
      "created_utc": 1725889724.0,
      "score": 84
    }
  ]
}