{
  "id": "1gmpgtg",
  "title": "What is happening in this country?! Even the kids are getting unhinged. ",
  "selftext": "A friend’s daughter in 7th grade (they live in a red state) came home crying yesterday because several boys at her school laughed and told her she can’t get an abortion now and “we could make you have a baby whether you like it or not.” She’s 13! Fucking scary. Her parents are talking to the principal today with a list of those boys’ name and they’re pulling her out of school to be homeschooled. wtf is even happening. Who tf are these kids’ parents??? She said this is the first time anybody had said something like this to her. \n\nWhy are so many people, including kids are suddenly hating women? It makes me so mad. ",
  "created_utc": 1731090602.0,
  "score": 7868,
  "num_comments": 787,
  "url": "https://www.reddit.com/r/offmychest/comments/1gmpgtg/what_is_happening_in_this_country_even_the_kids/",
  "comments": [
    {
      "id": "lw4yc00",
      "body": "A boy at school threatened to take my daughter’s virginity on Wednesday. She’s 11. We need to be vigilant in protecting our kids from this sickness.",
      "created_utc": 1731097009.0,
      "score": 5143
    },
    {
      "id": "lw4jwde",
      "body": "I am not American but have many American friends.\nOne of my close friends is in Utah & was crying to me yesterday that her 16yo daughter & other girls in the school were being taunted by the boys following them around chanting \"Your body, My Choice\"\nIt is sick and disturbing.\nI feel very scared for young women in the US right now.",
      "created_utc": 1731092666.0,
      "score": 1758
    },
    {
      "id": "lw4fid9",
      "body": "I've heard this happening more this week, especially with men just claiming \"your body, my choice\" to women.\n\nIt's terrifying.",
      "created_utc": 1731091373.0,
      "score": 3498
    },
    {
      "id": "lw4h0di",
      "body": "I hate to be the one to say it, but we need to address that the younger generations like z and alpha aren’t always more progressive. They’re being fed stuff like Andrew Tate unsupervised. If we don’t fight like Hell to show them that they cannot say stuff like that without consequences, then they may actually get worse.",
      "created_utc": 1731091813.0,
      "score": 2611
    },
    {
      "id": "lw4naqn",
      "body": "“Oh you mean that it is my choice to cut your penis of your body, where is my scalpel.”",
      "created_utc": 1731093677.0,
      "score": 551
    },
    {
      "id": "lw4lu2r",
      "body": "No one has recently started hating women, they never liked women to begin with and now they feel emboldened to display misogyny",
      "created_utc": 1731093240.0,
      "score": 846
    },
    {
      "id": "lw4k7bf",
      "body": "They always hated us, they just aren't afraid to voice it anymore.",
      "created_utc": 1731092757.0,
      "score": 601
    },
    {
      "id": "lw4q94f",
      "body": "According to news reports, last year in Belgium, boys aged between 11 and 16 were identified as rape suspects. Don't look at any boy around your daughters as a child, educate both your sons and daughters.\n\nAt a time when access to the internet and porn is so easy, nothing is the same as it used to be. What we learned at the age of 16-17, maybe even later depending on which country and culture we live in, children now learn at the age of 9 or 10. It's really frightening.",
      "created_utc": 1731094564.0,
      "score": 329
    },
    {
      "id": "lw4yuzh",
      "body": "They always hated women and minorities. Just like last time, their true colors are revealed again. These pos learn from their racist and misogynistic family. I hope they rot in hell. \n\nPlease get them into self defense classes. Tell the girls it’s ok to fight back. \n\nImho, these pos dont learn anything until you fight back and win",
      "created_utc": 1731097172.0,
      "score": 314
    },
    {
      "id": "lw57b5d",
      "body": "We elected a mask-off psychopath rapist, so now all the others are taking their masks off too. And all the kids are seeing their parents mask-off, and are emulating the behavior.\n\nIt's going to get worse. It's _going_ to get _worse_. ***It's going to get worse.***",
      "created_utc": 1731099737.0,
      "score": 700
    },
    {
      "id": "lw5kw22",
      "body": "As an immigrant teacher,  I had kids asking me why I hadn’t been deported yet after the election",
      "created_utc": 1731103963.0,
      "score": 226
    },
    {
      "id": "lw4zto6",
      "body": "Kids will hate who you tell them they can.",
      "created_utc": 1731097468.0,
      "score": 65
    },
    {
      "id": "lw4ha0l",
      "body": "Let me repeat what we learned after 2016: misogyny, racism, vulgarism became very normalized after the closeted and not so closeted ones understood that their leader can do it and so they can with zero consequences. The country keeps rewarding his behavior, so what did you expect?",
      "created_utc": 1731091892.0,
      "score": 448
    },
    {
      "id": "lw5osmv",
      "body": "Put me in jail for aggravated assault because I WOULD solve that issue myself. It’s on sight with those parents. Teach your sons better. no excuse. They’re essentially threatening to rape that girl. That’s what that is. I will not argue about that.",
      "created_utc": 1731105221.0,
      "score": 58
    },
    {
      "id": "lw5i3f0",
      "body": "At this point we need to start reporting these children to the police",
      "created_utc": 1731103078.0,
      "score": 106
    },
    {
      "id": "lw5zxvo",
      "body": "My sister got pregnant by my ex-boyfriend when she was 13. He got her drunk and raped her. Boys are horrible be careful with your daughters.",
      "created_utc": 1731108993.0,
      "score": 50
    },
    {
      "id": "lw5mi5a",
      "body": "Some guy went viral on Twitter posting in response to some women considering 4B, “LMAO, like you have a choice.”",
      "created_utc": 1731104480.0,
      "score": 95
    },
    {
      "id": "lw4h59i",
      "body": "This is just the beginning... I'm terrified.",
      "created_utc": 1731091853.0,
      "score": 271
    },
    {
      "id": "lw4jj5f",
      "body": "It’s been a bit better here in blue states/areas, but I’ve been hearing from my friends in more rural/red areas that they are already seeing the consequences of this election. Such as kids telling immigrant children “your whole family is gonna get deported” and girls “your body my choice” and so on. Lot more people now saying the quiet stuff out loud and it trickles down to the kids.",
      "created_utc": 1731092557.0,
      "score": 160
    },
    {
      "id": "lw5ogtv",
      "body": "It’s people like Nick Fuentes saying women’s bodies belong to men.",
      "created_utc": 1731105116.0,
      "score": 37
    },
    {
      "id": "lw4i8ma",
      "body": "Really sad to know that in the future there's going to be people who will be less tolerant of others. I really thought when I was younger that the world was becoming more diverse and accepting, but it looks like there's been a wave of hateful thinking across the globe, not just the USA. \n\nWe as a society, especially me being Gen Z, need to start educating people about the importance of diversity. WE need to live in a world where people don't think of women as lesser than men, or make people fight each other about each other's skin color or culture.  We're literally all just skeletons inside. \n\nIf you are currently a parent, try to monitor your children's internet access and don't let them watch influencers or people who spew hateful messages. Try to introduce them to different cultures and ideas instead. Maybe even teach your kids to learn a new language or do a small easy research project on the opposite sex. Just try to educate them that there is more to this world",
      "created_utc": 1731092175.0,
      "score": 126
    },
    {
      "id": "lw4j89s",
      "body": "Well, leaning back toward child free again.",
      "created_utc": 1731092468.0,
      "score": 95
    },
    {
      "id": "lw7uxkc",
      "body": "This isn’t sudden.  It’s just out in the open now.",
      "created_utc": 1731137648.0,
      "score": 34
    },
    {
      "id": "lw51fsg",
      "body": "Time to teach my daughters the Lorena Bobbit wiener whack (the lion sleeps tonight) song",
      "created_utc": 1731097963.0,
      "score": 79
    },
    {
      "id": "lw4gp36",
      "body": "Those kids were definitely taught by, or picked up that behavior from their parents",
      "created_utc": 1731091720.0,
      "score": 185
    },
    {
      "id": "lw5cmpi",
      "body": "You need to show your daughter how to sucker punch someone.",
      "created_utc": 1731101380.0,
      "score": 70
    },
    {
      "id": "lw54w4w",
      "body": "Cause parents are slapping phones and tablets in front of their kids at an early age with zero restrictions. They are literally viewing material that isn’t even great for adults to view. \n\n7th graders being assholes isn’t new. 7th graders being assholes about adult material they shouldn’t even be aware of is. There is no reason a 7th grader should be culturally aware of abortion let alone how to use it as a verbal weapon. \n\nI personally hope TikTok does actually get banned. It will benefit society more than I think anyone realizes.  Moreover, parents need to start being held responsible. \n\nSome asshole 7th graders bully your child? Those parents need to be held responsible.",
      "created_utc": 1731099011.0,
      "score": 102
    },
    {
      "id": "lw4tyg5",
      "body": "Wondering where all the boy moms are now..",
      "created_utc": 1731095672.0,
      "score": 84
    },
    {
      "id": "lw5mitc",
      "body": "Those who deserve to be punished aren’t being held accountable.\n\nGo back to that school and demand they leave and face repercussions. The bullies. Their daughter shouldn’t have to alter her life because of these disgusting boys!",
      "created_utc": 1731104486.0,
      "score": 20
    },
    {
      "id": "lw61cxo",
      "body": "You can thank Nick Fuentes and other podcast bros.",
      "created_utc": 1731109492.0,
      "score": 25
    },
    {
      "id": "lw7pnzb",
      "body": "I’m actually shaking with rage right now after reading this post and these comments, children  like this should be expelled and the adults who do this shit arrested. \n\nI thought we were becoming more accepting as a society but looks like we’ve started going backwards:",
      "created_utc": 1731134410.0,
      "score": 22
    },
    {
      "id": "lw4myke",
      "body": "Well, set my britches afire and call me smokey! 😲🤠\n\nDo you mean to tell me that the folks who claim to want to \"protect life\" are saying they'll harm women? I'm shocked, I tell ya. You could bowl me over with a feather.  These fine young white males from \"good Christian homes\" are being rude?? Nah. You makin shit up now, not possible. 🤣🤣\n\n It would be terrible if a series of Cat 5 hurricanes, powerful tornadoes, and maybe a random asteroid wiped out all the MAGATS. I mean, not as sad as actual humans dying, but, it might affect our insurance rates, which would suck. 🙄",
      "created_utc": 1731093575.0,
      "score": 73
    },
    {
      "id": "lw5n4rl",
      "body": "[removed]",
      "created_utc": 1731104682.0,
      "score": 58
    },
    {
      "id": "lw6ik6x",
      "body": "i’m a senior at a catholic high school and some of the things i heard on tuesday in my classes were genuinely horrendous. people i considered my friends (not super close with, now i am thankful for that) were saying absolutely 100% racist things and i nearly lost it.",
      "created_utc": 1731115565.0,
      "score": 16
    },
    {
      "id": "lw4vqsv",
      "body": "This is not new, this thought pattern has existed for a long, long time. The difference is that now the mask has come off. \n\nGive them what they voted for with malicious compliance: no sex until marriage. And once porn is outlawed (as is planned in project 2025), they may begin to see the error of their ways/ their hypocrisy",
      "created_utc": 1731096215.0,
      "score": 35
    },
    {
      "id": "lw5j35x",
      "body": "And pulling girls out of school is ultimately their goal too, so harassing girls out of their education seems to be the plan.",
      "created_utc": 1731103390.0,
      "score": 36
    },
    {
      "id": "lw5ey24",
      "body": "So skwomen was right with their 4B (or 7B) movement after all",
      "created_utc": 1731102101.0,
      "score": 17
    },
    {
      "id": "lw5hnow",
      "body": "\"I learned it from you Dad!\"",
      "created_utc": 1731102941.0,
      "score": 15
    },
    {
      "id": "lw5yo62",
      "body": "Aaand an entire generation learns *just like that* how much males really hate them.",
      "created_utc": 1731108552.0,
      "score": 14
    },
    {
      "id": "lw6juxk",
      "body": "Ugh I hate this country. I don’t understand how boys and men think this is ok. They have no intelligence.",
      "created_utc": 1731116033.0,
      "score": 17
    },
    {
      "id": "lw70sfc",
      "body": "Time for that school to arrange a field trip for the boys to a local prison and have the inmates talk about what life is like there for sex offenders. Scare them straight. Wtf is wrong with parents these days to raise their sons like that?",
      "created_utc": 1731122395.0,
      "score": 17
    },
    {
      "id": "lw72dwn",
      "body": "It's so fked up to witness even young 13 year old boys are thinking about wanting to rape.",
      "created_utc": 1731123042.0,
      "score": 16
    },
    {
      "id": "lw4f8qa",
      "body": "[deleted]",
      "created_utc": 1731091294.0,
      "score": 77
    },
    {
      "id": "lw6jf7f",
      "body": " That’s threatening rape and they should be disciplined, sounds like warranting suspension or worse to me.",
      "created_utc": 1731115875.0,
      "score": 16
    },
    {
      "id": "lw55p5c",
      "body": "The parents of these children have always hated women. But now they have an excuse to be verbal about that hatred. The mask is off. We've been surrounded by this all our lives, we were just blind to it.",
      "created_utc": 1731099251.0,
      "score": 31
    },
    {
      "id": "lw6mepa",
      "body": "Starts with the adults .. the adult men",
      "created_utc": 1731116944.0,
      "score": 15
    },
    {
      "id": "lw4ieh2",
      "body": "They hear it from their parents and/or they all gained access to the internet WAY too early and see this rhetoric.",
      "created_utc": 1731092223.0,
      "score": 40
    },
    {
      "id": "lw5kmv4",
      "body": "It's not sudden. It's been beneath the surface for many years.",
      "created_utc": 1731103882.0,
      "score": 13
    },
    {
      "id": "lw608kk",
      "body": "This is a result of social media. Parents let their kids watch people like jake paul, and apparently never realized their kids kept going all the way down the pipeline to nick fuentes.",
      "created_utc": 1731109098.0,
      "score": 11
    },
    {
      "id": "lw6cssj",
      "body": "I've always been very open with my kids about human rights. Trying to teach my boys to be allies to others and to stand up for others.  Trying to teach my daughter to be strong, speak up, and take no shit.  I always worry they will be influenced by others as we live in a red state.  \n\nThis morning, my oldest son, 14, showed me he is listening.  We talked about the election,  women's rights, what's to come, etc.  He made me incredibly proud and told me how at school he always calls out misogyny, racism, etc.  My kids take no shit and do not allow bullies to override others.  I hope he continues this path and helps protect the rights of others. He asked to go with me to vote. He said he needed to learn.  He's also been doing his own research and asking questions. \n\nMany days as a mother, I worry I've messed up.  I was a teen mom and raised republican and religious.  I dropped that when my kids were very young.  I'm honest with them that I don't have a handbook , that I have made mistakes,  I get cranky, and I am trying to be fair and open. \n\nBut today I know something is working. I know my children are smart, kind, and want better for everyone. I just hope their generation there are more kids with the same mindset vs. what I've been seeing.  It's horrible.  My oldest was upset this morning and fully prepared to call anyone out if he heard it today. \n\nI want people to know that some parents are trying to raise good humans.  Unfortunately,  the ones who allow this disgusting behavior now feel like it's free reign to do as they please. \n\nSorry this is long. I've been in tears all day.  I'm sad for this country. I'm scared for my daughter. Listening to my son though has given me a drop of peace.",
      "created_utc": 1731113510.0,
      "score": 14
    },
    {
      "id": "lw4vydm",
      "body": "[removed]",
      "created_utc": 1731096279.0,
      "score": 23
    },
    {
      "id": "lw7fgme",
      "body": "My daughter (biracial)  has blonde hair and beautiful green/blue eyes, and my last name.(hispanic) She was told she was going to be deported back to Puerto Rico come February …….. technically we would be deported back to Ireland/Spain/africa  but who really knows anymore",
      "created_utc": 1731128882.0,
      "score": 28
    },
    {
      "id": "lw5j1an",
      "body": "Horrible parenting. Growing up as a kid I knew nothing about politics and the election outside of that it’s a thing and the process. I could never imagine growing up, with my parents in my ear, telling me the bad things about each candidate or that the opposite party is bad etc. I grew up with KIDS being KIDS. We live in a fucked up world with horrible parenting",
      "created_utc": 1731103374.0,
      "score": 12
    },
    {
      "id": "lw6rxqq",
      "body": "The irony that these imbeciles are the ones claiming to be protecting children. Be vigilant and protect any woman you see being harassed not just your daughters.",
      "created_utc": 1731118999.0,
      "score": 11
    },
    {
      "id": "lw4oird",
      "body": "This is absolutely horrible, but I don't know if it's exactly new. I mean, yeah, the specific thing they said  is obviously tied to recent events, but I remember kids saying and doing stuff just as bad or even worse when I was a kid. I may have just lived in a worse place or went to shittier school, but I can recall incidents very similar.  \n  \nFor instance, I made friends with this new girl when I was in 9th grade (mid-2000s). She had just moved and was nice and actually quite attractive. After a week or two, a bunch of the kids at school (boys and girls) started being exceptionally shitty to her. I didn't know why or what got their attention so focused on her until I saw some of it happen in person. Apparently, she had previously been at another school the next town over, and it turned out that her father had been sexually abusing her. It came out in some public way. He went to prison and she moved in with her grandparents in our town. The kids at school found out and were calling her a [sexist slur] and openly bullying her *to her face* for being a victim of SA. I even got shit for being friends with her. It became too much for her pretty quickly, and her grandparents pulled her out of school and I never really saw her again.  \n  \nI'm not saying this is just \"kids being kids\" or whatever. I'm just saying that kids always seem to reflect the worst parts of whatever is going on around them and take it to the next level. Also, of course, sometimes kids just get creative with how cruel and shitty they can be even if they aren't exposed to anything negative. But they're almost always at least at the low-watermark for how shitty we adults around them are.",
      "created_utc": 1731094044.0,
      "score": 34
    },
    {
      "id": "lw50xc2",
      "body": "this is why we kept my nephew home from school. He's dealing with this shit too just for being trans.",
      "created_utc": 1731097806.0,
      "score": 31
    },
    {
      "id": "lw73bh8",
      "body": "Unfortunately I think it’s another effect of the pendulum swinging the other way in a social power struggle. The feminist movement might be more popular than it ever was and men feel threatened and victimized by women talking about their personal experiences. It also happened with Black Lives Matter and me too. Funny that it also happens when abusers hear their victims repeat their actions back toward them. Thats called DARVO. People hear a group giving valid criticisms toward them and think they’re the real victims in the situation, even if the situation never applied to them in the first place. “If it doesn’t apply, let it fly”  isn’t a thing for people like that, they feel attacked because they don’t understand what it’s like to be marginalized and can’t understand that we don’t mean literally everyone.\n\nSocial media has really wrought havoc on our youth. Bullying is easier than ever and they’re very impressionable. Young boys  are being targeted by right wing propaganda too. It’s a problem. The good thing is they’re not stuck like that and a great deal of it is probably teenage edginess and being unable to take anything seriously.",
      "created_utc": 1731123429.0,
      "score": 11
    },
    {
      "id": "lw7sn62",
      "body": "Id bet a good bit of cash they are watching or listening to podcasts or vids from people in the tate realm and parroting ",
      "created_utc": 1731136209.0,
      "score": 10
    },
    {
      "id": "lw525h7",
      "body": "My son’s school had a mock election. I live in a blue state. \n\nFreshmen voted for that guy…72%!!!! SEVENTY TWO PERCENT!!! \n\n\nwhat happened to our next generation??? TikTok ruined our country.",
      "created_utc": 1731098181.0,
      "score": 37
    },
    {
      "id": "lw4pvlx",
      "body": "I’ve heard this from a few friends, I’m gonna be so upset if I hear it from my daughter and will probably turn momma bear on the principles ass",
      "created_utc": 1731094451.0,
      "score": 21
    },
    {
      "id": "lw5lgsf",
      "body": "Don’t pull her out of school, time to teach the girls to fight back.   Arm the girls with words, and martial arts/self defence training.  \n\nDon’t run and hide - that’s what they want you to do.  Look  at what the Taliban did and look at what is ‘’modesty police’ do in Saudi.",
      "created_utc": 1731104146.0,
      "score": 18
    },
    {
      "id": "lw5w9bh",
      "body": "This US election, it's like a rock has been lifted up and underneath is nothing but male scorpions.\n\nI'm glad the parents are taking pity on her. She's not being forced to stay in school with those monsters. \n\nBut it's a pity those boys aren't being punished and pulled out instead. Boys are so coddled.",
      "created_utc": 1731107716.0,
      "score": 21
    },
    {
      "id": "lw65ckf",
      "body": "My family and I are US citizens and survived a dictatorship in our home country. The level of vitriol and tribalism that I’m seeing here seems so much worse than anything we saw in our home country. \nWhat kind of horrible karmic lottery did we win to go through this twice in one lifetime?",
      "created_utc": 1731110894.0,
      "score": 19
    },
    {
      "id": "lw6qk6p",
      "body": "They think it’s Christian to see women as second class citizens compared to men….and as an Atheist I basically agree that THAT is the basis of Christianity- they’re just saying the quiet part LOUD now.",
      "created_utc": 1731118484.0,
      "score": 17
    },
    {
      "id": "lw681tu",
      "body": "If I had a daughter and some boys said that to her I'd go down there and beat their asses. Don't care how old they are. Disgusting.",
      "created_utc": 1731111841.0,
      "score": 10
    },
    {
      "id": "lw75hfy",
      "body": "I told my son that if he heard anyone talking like that he had full permission to deck them and I would check him out and we would get a treat. His response? BET.",
      "created_utc": 1731124346.0,
      "score": 26
    },
    {
      "id": "lw6173o",
      "body": "Oh my god. That's horrifying and disgusting.. I am so sorry, I can't believe that it's that bad (I can, I just don't want to). That's really depressing.",
      "created_utc": 1731109434.0,
      "score": 9
    },
    {
      "id": "lw6fy6f",
      "body": "But guys! No need to worry. Men are protectors, remember? /s",
      "created_utc": 1731114625.0,
      "score": 6
    },
    {
      "id": "lw88jpa",
      "body": "The outcome of the election has galvanized many people into being more brazen with their beliefs. The Reds voted for economic stability, but also ended up also endorsing crippling misogyny among other unacceptable attributes.",
      "created_utc": 1731146695.0,
      "score": 7
    },
    {
      "id": "lw4lo02",
      "body": "This is a learned behavior. Parents are just a guilty as the Boys.",
      "created_utc": 1731093189.0,
      "score": 27
    },
    {
      "id": "lw4i5p4",
      "body": "OMFG.",
      "created_utc": 1731092151.0,
      "score": 12
    },
    {
      "id": "lw89t05",
      "body": "They’re not suddenly feeling this way.  They’re suddenly feeling brave enough to show those feelings publicly. The thoughts and feeling were already there :(",
      "created_utc": 1731147536.0,
      "score": 12
    },
    {
      "id": "lw5rwka",
      "body": "It’s hard going out into society. I don’t trust people.",
      "created_utc": 1731106239.0,
      "score": 6
    },
    {
      "id": "lw6evkp",
      "body": "I'm a baby boomer (62 years old) and when I was in middle school I was told by a couple of male classmates that someone would going to SA me while I was asleep.  They had heard someone talking about this.  I was freaked out and came home crying..  My mom was so angry that the next day she went to the principal and told the principal what was said.  She even considered reporting this to the police.   It was seen as a joke and many people thought my mom overreacted by threatening to call the police as these boys didn't actually threatened to SA me, they said someone else might do this to me.  Everyone agreed that one shouldn't joke about that but it seemed no one took this seriously.  One of them did apologize to me.  They didn't get into trouble but were advised not to joke about something like that again. \n\nConsidering that this was 1974 or 1975 if the police were called, they probably would have said the same thing the principal said.  \n\n My mom more or less let it be known that she wouldn't hesitate to use a baseball bat on anyone who had any ideas about doing such a thing and she would have.  They would also have to content with my older brother who was a big guy.  My mother was a mild mannered person who seldom lost her temper or got really angry or upset and never talked about using violence against someone but an SA in her home or attempted one would be a different manner.",
      "created_utc": 1731114242.0,
      "score": 7
    },
    {
      "id": "lw6vuth",
      "body": "This is so repulsive. This stupid election has suddenly given all of the troglodytes permission to act out their worst, most inhumane impulses.",
      "created_utc": 1731120494.0,
      "score": 6
    },
    {
      "id": "lw78wmt",
      "body": "Not an American but what changed? Isn't the abortion laws state run? Or does the new president hold all the power of the entire country's abortion laws?",
      "created_utc": 1731125846.0,
      "score": 6
    },
    {
      "id": "lw7jjx1",
      "body": "I think they now feel safe to say what they want to say. What they’ve always probably thought. They know no consequences are being dealt out . It’s almost being encouraged to act as they do in some places. Please everyone be extremely safe. It’s just going to get more dangerous.",
      "created_utc": 1731130947.0,
      "score": 6
    },
    {
      "id": "lw4tftc",
      "body": "7th grade boys have been making misogynistic sex jokes for a long long time. The abortion ban is fueling a problem that has already existed",
      "created_utc": 1731095517.0,
      "score": 20
    },
    {
      "id": "lw609wk",
      "body": "I caught two boys (9) calling each other monkey slave n-words today. Apparently, they both had made comments about women yesterday. I am SO worried and deeply disturbed…",
      "created_utc": 1731109111.0,
      "score": 10
    },
    {
      "id": "lw6nnnq",
      "body": "....That's really scary. I'm really scared, especially for younger women and girls.",
      "created_utc": 1731117400.0,
      "score": 12
    },
    {
      "id": "lw4w75h",
      "body": "Kids that age have been evil for a long time already. They’re just feeling more comfortable to come out of the monster’s closet now that they know we no longer have a say in what happens to our bodies and that they won’t be punished for terrorizing other people. I’ve been sick to my stomach for days now. Life will suck for a LOT of us for a very long time starting soon. Enjoy your freedoms while you have them, cause dark days are ahead of us here.",
      "created_utc": 1731096354.0,
      "score": 9
    },
    {
      "id": "lw67s7q",
      "body": "The USA is basically speedrunning its way to The Handmaid’s Tale.",
      "created_utc": 1731111747.0,
      "score": 11
    },
    {
      "id": "lw59xft",
      "body": "That's so disgusting \nWhats happening I'm America\nEven kids!!!",
      "created_utc": 1731100533.0,
      "score": 4
    },
    {
      "id": "lw5kfuu",
      "body": "Wtf is happening in this country?",
      "created_utc": 1731103820.0,
      "score": 6
    },
    {
      "id": "lw5m60r",
      "body": "The problem is those boys learned that somewhere, & lack of parents teaching respect for women clearly shows.",
      "created_utc": 1731104371.0,
      "score": 4
    },
    {
      "id": "lw6ecq0",
      "body": "I’m not at all surprised but I am disgusted.",
      "created_utc": 1731114057.0,
      "score": 4
    },
    {
      "id": "lw6n987",
      "body": "I’m older gen z and I can tell you the kids have been like this since at least 2014-2015. It started with gamergate and it’s only gotten worse",
      "created_utc": 1731117253.0,
      "score": 4
    },
    {
      "id": "lw6rivb",
      "body": "Im like genuinely feeling murderous rn its crazy.",
      "created_utc": 1731118845.0,
      "score": 5
    },
    {
      "id": "lw6xt0j",
      "body": "This has infuriated me. I would have lost my shit on that boy. \n\nAnyone please intimidate and terrify any boy that does this until they cry. They need to suffer for their actions. Someone needs to teach them before it becomes too late and they think this is okay. We hopefully only have 4 years of this bullshit.",
      "created_utc": 1731121233.0,
      "score": 5
    },
    {
      "id": "lw7ungd",
      "body": "We’re going to have to resort to buying weapons arent we",
      "created_utc": 1731137470.0,
      "score": 5
    },
    {
      "id": "lw65e6q",
      "body": "Trumpers raise trumpers, the only thing they value is being bullies. My friends who are in higher Ed have had a bad week. Students who are POC are breaking down and it's taking a toll on the staff, who are considered safe to talk to. My friends who are in mental health have been bombarded with LGBTQI clients who are distraught. The worst part is trumpers love this, they like hurting other people and watching others suffer. It's sick. I have genz kids who are thankfully with a good group of friends, but they tell me about kids who are like this. The schools often do a shitty job dealing with bullying, so it's no surprise that with the bullies feeling more emboldened than ever that they would go on a targeting spree.",
      "created_utc": 1731110910.0,
      "score": 9
    },
    {
      "id": "lw65s4p",
      "body": "**Hitlerjugend** (the youth org) had some VERY eager beavers for Hitlers regime back in the days.",
      "created_utc": 1731111046.0,
      "score": 9
    },
    {
      "id": "lw88awb",
      "body": "What do we really expect from the children of people who prefer a rapist to a woman for president?",
      "created_utc": 1731146531.0,
      "score": 10
    },
    {
      "id": "lw7j026",
      "body": "Kids at my school are yelling \"you should be afraid\" and \"you have no way to stop us now\" at girls.",
      "created_utc": 1731130656.0,
      "score": 10
    },
    {
      "id": "lw5zyk0",
      "body": "Happening here in Arkansas to girls and POCs ready",
      "created_utc": 1731109000.0,
      "score": 7
    },
    {
      "id": "lw8tnsj",
      "body": "America loves rape and hates women \n\nWhy is anyone surprised",
      "created_utc": 1731158529.0,
      "score": 8
    },
    {
      "id": "lw5kc24",
      "body": "Are you honestly asking or just, as the name of the subreddit goes just getting it \"off your chest\" in a vent?\n\nCan appreciate the latter.  But you have to know the answer if it's the former.   That's what our culture in the US is like, folks just feel again yet more free to say (and do) things openly.",
      "created_utc": 1731103786.0,
      "score": 4
    },
    {
      "id": "lw6dxud",
      "body": "I don't understand politics in America. The voting system seems soooo messed up. It's scary that people who have backward views are \"winning\", without actually winning overall 🤯\nYour friend's daughter is currently experiencing the 'fall out' of this, and this is extremely sad. Unfortunately, I don't think it will get better because it's bred into kids to believe what their parents believe. Don't get me wrong, this happens in every country, but Americans seem to be next level in perpetuating it, it's scary",
      "created_utc": 1731113913.0,
      "score": 2
    },
    {
      "id": "lw6n1rx",
      "body": "It’s because tik tok and they see this in their feeds. If people would stop sharing it and bringing it up I’m hopeful it would go way down",
      "created_utc": 1731117178.0,
      "score": 2
    },
    {
      "id": "lw6xzpt",
      "body": "Time to get your daughters in self-defense classes and martial arts. \n\nThey have the right to protect themselves and throat and punch a dick for talking to them this way. \n\nAlso, a time to talk to them about learning about the walk outs. \n\nOutschool has on-line year around classes for all grades that is on-line and affordable",
      "created_utc": 1731121303.0,
      "score": 5
    },
    {
      "id": "lw76wxn",
      "body": "Some children are very sick and their parents have not been involved enough and taught them this isn't okay. But at this age group boys seem to enjoy tormenting girls. Happend to me in middle and high school.",
      "created_utc": 1731124966.0,
      "score": 5
    },
    {
      "id": "lw4x7hq",
      "body": "Kids learn from their parents.",
      "created_utc": 1731096663.0,
      "score": 9
    },
    {
      "id": "lw5rgzf",
      "body": "You really have to ask why? Hate is now sanctioned in America. It is beyond sad. We are a sick, ignorant nation.",
      "created_utc": 1731106098.0,
      "score": 9
    },
    {
      "id": "lw4uskx",
      "body": "Kids hear this shit from their parents. They hear this shit on social media.  This is a parent issue.",
      "created_utc": 1731095924.0,
      "score": 11
    },
    {
      "id": "lw4xswl",
      "body": "They've always hated women. They've hated for being independent and wanting our own lives and not being their servants. \n\nNow they have the permission to say it. \n\nIt's like in 2016 when they were given the permission to be racist again.",
      "created_utc": 1731096846.0,
      "score": 21
    },
    {
      "id": "lw6va21",
      "body": "Relax! No one is \"suddenly\" hating women. They've always hated women they're just saying the quiet part out loud.",
      "created_utc": 1731120272.0,
      "score": 5
    },
    {
      "id": "lw73vd5",
      "body": "This is Putin’s America now, thank you Fox News, Ronny  Reagan, newt Gingrich, the religious right and every good man and woman who looked the other way.  America will not recover from this, this is different",
      "created_utc": 1731123660.0,
      "score": 10
    },
    {
      "id": "lw7j5fo",
      "body": "As a teacher- we see this- we want to stop it- but it’s the parents. It’s those red parents and social media that are fueling this fire. And give how much of the US is now red and how little they care about education and teachers and schools….. we’re fucking screwed.",
      "created_utc": 1731130734.0,
      "score": 9
    },
    {
      "id": "lw93974",
      "body": "OP, what you are witnessing is the rise of a fascist regime in America.\n\nWelcom to the Fourth Riech.",
      "created_utc": 1731162400.0,
      "score": 5
    },
    {
      "id": "lw5os7w",
      "body": "When I was a kid a football player groped a friend's ass nothing happen to him",
      "created_utc": 1731105217.0,
      "score": 3
    },
    {
      "id": "lw5v2ym",
      "body": "Sexual harrassment.harassment. I hope this kind of bullying is addressed.",
      "created_utc": 1731107312.0,
      "score": 3
    },
    {
      "id": "lw5w70n",
      "body": "Nearly all children are the results of their surroundings.  They learn from their parents, teachers, other kids, neighborhood, church, etc.  You think those kids learned that on their own?  No, they were taught that.",
      "created_utc": 1731107695.0,
      "score": 3
    },
    {
      "id": "lw5xu9f",
      "body": "These kids are a bunch of brainrotter. I blame the parents for this. Im sorry for what happened to your daughter i hope she will get the justice she deserves.",
      "created_utc": 1731108260.0,
      "score": 3
    },
    {
      "id": "lw5zbzr",
      "body": "Our girls need woman self defence.",
      "created_utc": 1731108782.0,
      "score": 3
    },
    {
      "id": "lw67sfj",
      "body": "Teach your daughters to fight and fight hard. \nMy generation of women GenX...we could and still can throw a mean punch. There were a few guys in my Junior High that tried physically grabbing me and the other girls with big chests. I broke one guy's nose, my friend broke another guy's fingers, and another...well let's just say that after the girl he grabbed was done with him, his mama also whooped his arse.\n\nSeriously, it is scary out there and I fear for the young ladies right now. Teach them to fight, give them the tools they need to protect themselves.",
      "created_utc": 1731111749.0,
      "score": 3
    },
    {
      "id": "lw6bi0u",
      "body": "Radicalization starts at home and at a very young age sometimes, It's going to get worse. It's sickening. \n\nEdit: For Grammar.",
      "created_utc": 1731113055.0,
      "score": 3
    },
    {
      "id": "lw6caot",
      "body": "Kids need to go to self defense classes of some kind. Martial arts of some sort as they typically teach how to defend yourself without starting a fight.",
      "created_utc": 1731113333.0,
      "score": 3
    },
    {
      "id": "lw6felj",
      "body": "I fully understand why so many kids have to go to online school. I fully support it!!! Get away from the trauma. Just hermit.",
      "created_utc": 1731114433.0,
      "score": 3
    },
    {
      "id": "lw6lbir",
      "body": "Sh*tty entitled parents make sh*tty entitled kids.",
      "created_utc": 1731116558.0,
      "score": 3
    },
    {
      "id": "lw6o3l8",
      "body": "When I was in middle school (06-09) there was a group of kids on the bus that wanted to shove peanuts down another kids throat. He was deathly allergic to peanuts. It freaked me out so bad I told the bus driver (I was the last to be dropped off)",
      "created_utc": 1731117563.0,
      "score": 3
    },
    {
      "id": "lw6ti59",
      "body": "They are the children of the voters… they’ve been raised to hate women since birth. I saw this as a mother of only a son 🙃",
      "created_utc": 1731119596.0,
      "score": 3
    },
    {
      "id": "lwbhgg9",
      "body": "It’s not that they “suddenly” hate women, but that they suddenly feel it’s socially acceptable to hate women. Fun times ahead",
      "created_utc": 1731190786.0,
      "score": 3
    },
    {
      "id": "lwbice8",
      "body": "This is disgusting!!! Even if I don't agree with the majority of reddit on politics, this is NOT okay. I agree, who tf are that kids parents???!!!! Thats awful. I'm glad she's getting homeschooling though. Kids that young shouldn't even be thinking about that.",
      "created_utc": 1731191093.0,
      "score": 3
    },
    {
      "id": "lwddke3",
      "body": "People need to look up the tolerance paradox - essentially, that being tolerant and polite of intolerant assholes just lets the crazies win. We need to stop being so nice all the time. I’d be making a big, loud scene every time “that sounds like something a rapist would say! Are you a rapist? Are you threatening me?” Hope they subscribe to your body my choice when it’s my hands wrapped around their neck in self defense. \n\nWe’re half of the population. It’s time to be loud and united against the idiots thinking this situation is anything but deadly serious",
      "created_utc": 1731217197.0,
      "score": 3
    },
    {
      "id": "lw8wxct",
      "body": "They haven’t suddenly decided to hate women. They always have, and they’re emboldened to be more outspoken about it now that we’ve elected Fuckhead and Assbreath. \n\nI’m begging all of you with children, specifically sons, to not only be better than this but to call out bad behavior. We cannot and will not undo the damage of misogyny unless men and boys start holding each other accountable, because they’re not fucking listening to us.",
      "created_utc": 1731159886.0,
      "score": 5
    },
    {
      "id": "lw5vxrc",
      "body": "Have you read the handmaid’s tale? We are living it.",
      "created_utc": 1731107606.0,
      "score": 9
    },
    {
      "id": "lw7y8fv",
      "body": "I'd suggest getting your daughter in self defense classes so if they do that shit again she can beat their asses.",
      "created_utc": 1731139769.0,
      "score": 4
    },
    {
      "id": "lw8pc4d",
      "body": "Because the leader of this country is encouraging men in his cult to take their masks off. It's allowed to be racist, bigoted, sexist, etc. They're showing us who they are, so believe them and be ready to protect yourself and those you love.",
      "created_utc": 1731156593.0,
      "score": 4
    },
    {
      "id": "lw7nq8y",
      "body": "Not suddenly. Men have hated women for a long time.",
      "created_utc": 1731133272.0,
      "score": 7
    },
    {
      "id": "lw7oc4t",
      "body": "That's parenting not done right and has to be reported.",
      "created_utc": 1731133623.0,
      "score": 2
    },
    {
      "id": "lw9o8v7",
      "body": "This is one reason why abortion shouldn’t be involved in politics.  ITS A MEDICAL ISSUE.  Kids don’t understand things like this, but hear their parents.  This is a direct reflection of the parents",
      "created_utc": 1731169641.0,
      "score": 2
    },
    {
      "id": "lw9sz2w",
      "body": "I distinctly remember waiting for the OJ verdict in Middle School and my white classmates were laughing about how he should be lynched. They continued to talk about hanging people as if that ish is normal. So this honestly is par the course for a segment of the community exhibiting certain behavior patterns",
      "created_utc": 1731171158.0,
      "score": 2
    },
    {
      "id": "lwa3x84",
      "body": "They aren’t “suddenly” hating on women, they did that all along. But now that they’ve voted a literal fascistic rapist back in charge they think that they’re now allowed to go all in on the assaulting, the harassing and the hatred. Because if the president can, so can they, right?/s\n\n*This* is what you’ve voted for, America.",
      "created_utc": 1731174662.0,
      "score": 2
    },
    {
      "id": "lwa4it8",
      "body": "They're learning it from the adults in their lives, the lack of filter on social media, lack of consequences anywhere. The is a general lack of respect from all sides of the political spectrum and none of them should be tolerated. It's very sad",
      "created_utc": 1731174851.0,
      "score": 2
    },
    {
      "id": "lwab1c3",
      "body": "Holy. Shit.\n\nThis is fucking bonkers",
      "created_utc": 1731176927.0,
      "score": 2
    },
    {
      "id": "lwaez4d",
      "body": "This is only one type of behavior you will see and it will get worse. First term- Lying became ubiquitous. Entitlement shot up in triple digits, the term’Karen’ became normalized, racial violence, and mass shootings.\nBe safe and hyper vigilant, folks-the shitstorm is still over water and gathering strength.",
      "created_utc": 1731178176.0,
      "score": 2
    },
    {
      "id": "lwaxkuy",
      "body": "Rapist was elected to our white house, and his followers condone and spread these abuses.  Those boys have parents that have supported these ideas.",
      "created_utc": 1731184223.0,
      "score": 2
    },
    {
      "id": "lwb52qb",
      "body": "Saw a post were a teacher said one of her student punched a boy in the face cause the boy said “your body, my choice.” She got suspended ",
      "created_utc": 1731186676.0,
      "score": 2
    },
    {
      "id": "lwbb98o",
      "body": "What happens when kids are looking up to Andrew Tates of the world",
      "created_utc": 1731188716.0,
      "score": 2
    },
    {
      "id": "lwbcq6p",
      "body": "Good lord, that is horrifying.  I'm saying this first and foremost as simply a decent human.  But I also have a nephew in 7th grade and that made the story stand out even more.",
      "created_utc": 1731189195.0,
      "score": 2
    },
    {
      "id": "lwbvbcu",
      "body": "Its not sudden, they have finally felt comfortable enough to show their true side. It is only going to get worse",
      "created_utc": 1731195656.0,
      "score": 2
    },
    {
      "id": "lx38pzj",
      "body": "Last spring, when my daughter was 13, a boy in one of her classes exposed himself to her. In class, while the teacher was occupied with another student. When she got home from school, she broke down crying. She told me about it, and I asked her if she told the teacher or reported it. She didn't, she was so scared of retribution. She said she froze in panic, and she sobbed as she told me she can't get that image or of her mind. \n\n\nI took her to school the next day and we reported it to the vice principal. They investigated, but cited lack of evidence and nothing happened to the boy. However, he was a popular football player and told everyone about how my daughter \"lied\" to get him in trouble. She began receiving threats from his friends (male and female), and the school would do nothing to protect her. \n\n\nBoys would grab her chest and behind in the crowded hallways between classes, and girls constantly threatened to beat her up. She became withdrawn and sunk into a depression where she wouldn't leave her bedroom for weeks. \n\n\nLong story slightly shortened: she is now in therapy, and we pulled her out of school. She's learning online and doing so much better. She never wants to go back to school in person, and my husband and I support that. We make sure she can socialize with friends, and she knows we will always have her back.\n\n\nYes, we live in the USA.",
      "created_utc": 1731594056.0,
      "score": 2
    },
    {
      "id": "lw5pzwe",
      "body": "It’s a sh**hole country full of shi**ole people. Nothing normal folks can do but start throwing hands. Teach your kids to walk right up and land a face hug if anybody says something like that. Get your young daughters to karate and if they are old enough, buy them a weapon and a CCL. Nothing says “My Body” like a firearm. It’s the American way.",
      "created_utc": 1731105614.0,
      "score": 3
    },
    {
      "id": "lw6c1pn",
      "body": "wtf?! These parents need to be jailed for spreading this type of nonsense to their kids. Idgaf.",
      "created_utc": 1731113246.0,
      "score": 4
    },
    {
      "id": "lw7s7mj",
      "body": "I’m honestly terrified to stay and my family has made plans to leave. I don’t need my daughters existing in this climate.",
      "created_utc": 1731135940.0,
      "score": 4
    },
    {
      "id": "lw6vebo",
      "body": "If your identity as an adult is to be a fanatic of any politician you're gonna get trickle down to kids.\n\nI don't care what party you like, let's just be honest that they are all pieces of shit in some aspect and not idolize them like they can't do wrong.",
      "created_utc": 1731120318.0,
      "score": 4
    },
    {
      "id": "lw799ut",
      "body": "This is why my son will be taking martial arts to protect other girls… because wtf?",
      "created_utc": 1731126008.0,
      "score": 2
    },
    {
      "id": "lw7n7wc",
      "body": "The fucked up parents are the ones teaching their fucked up kids shit like this, they don't care because they think they're right. It's absolutely disgusting that *anyone* could even think/say things like that, and even more disgusting to say vile shit so often, your kids think it's totally okay to say in public/to their peers.",
      "created_utc": 1731132979.0,
      "score": 2
    },
    {
      "id": "lw7nhag",
      "body": "As a GOP voter if my kid said that shit to a woman they would be grounded for life.",
      "created_utc": 1731133129.0,
      "score": 3
    },
    {
      "id": "lw8cxe2",
      "body": "What the fuck am i reading?",
      "created_utc": 1731149585.0,
      "score": 4
    },
    {
      "id": "lw7l30m",
      "body": "I hope the majority of white women who voted for this enjoy their… lower gas prices? Concepts of plans? Deporting brown people? I’m not sure wtf they voted for, but I hope to god they have daughters, not because ANY girl deserves this, but because those specific women deserve to feel this terror alongside the rest of us.",
      "created_utc": 1731131777.0,
      "score": 4
    },
    {
      "id": "lw8r57d",
      "body": "Handmaid's tale suddenly seems possible and it fucking scares me",
      "created_utc": 1731157422.0,
      "score": 2
    },
    {
      "id": "lw90b0x",
      "body": "Im not in your country and find you lot bonkers but I would label that as bullying, i’d check the kids okay, If they’re scared shitless, i’d do something, if not I wouldnt turn it into a big deal. I’d probably give the kid some zingers back, kids are cruel and have no boundaries.",
      "created_utc": 1731161247.0,
      "score": 2
    },
    {
      "id": "lw570h6",
      "body": "I hope they expelled him. There is NO excuse.",
      "created_utc": 1731099648.0,
      "score": 1978
    },
    {
      "id": "lw53wrw",
      "body": "That's so sick.",
      "created_utc": 1731098714.0,
      "score": 60
    },
    {
      "id": "lw5n1c7",
      "body": "TAKE ACTION, when words aren’t enough.",
      "created_utc": 1731104652.0,
      "score": 56
    },
    {
      "id": "lw6ges2",
      "body": "The sickness has gotten worse.  If I had a daughter, I would afraid to put her in a public school in the area where I live.  I was in middle school during the mid-1970's.  There were comments that were made which were sexual in nature but those comments today would be considered to be very mild.  Now at the same middle school 50 years later, it's a lot worse as I've heard of girls being sexually harassed in ways that they weren't 50 years ago.  Most of my classmates were close in age and many of them had one or two brothers that attended the same middle school and they never were harassed or bothered by the other boys due to their brothers either confronting them or taking action against them for doing so.  That probably curbed a lot of this bad behavior or at the first least some boy is going to think twice before doing or saying anything because he doesn't want to have to deal with an angry brother.",
      "created_utc": 1731114792.0,
      "score": 47
    },
    {
      "id": "lw5ac9c",
      "body": "Omg",
      "created_utc": 1731100660.0,
      "score": 17
    },
    {
      "id": "lw6bigi",
      "body": "I’d make a police report just to start a paper trail of behavior. Not much can be done by threats but it behavior escalates there will be record of this not coming out of the blue.",
      "created_utc": 1731113059.0,
      "score": 5
    },
    {
      "id": "lw6dzpk",
      "body": "As in this motherfucker threatened to rape an 11 year old?!",
      "created_utc": 1731113931.0,
      "score": 3
    },
    {
      "id": "lw72dz0",
      "body": "I was told the same thing. I'm 18 and in college.",
      "created_utc": 1731123043.0,
      "score": 3
    },
    {
      "id": "lw7i32t",
      "body": "I grew up in the eighties, we’re going back to that mentality",
      "created_utc": 1731130178.0,
      "score": 3
    },
    {
      "id": "lw6ajpu",
      "body": "This makes me so angry. I have an 12 year old daughter and I’m so scared for her. She lives with her dad’s family so I’m not with her everyday.",
      "created_utc": 1731112715.0,
      "score": 2
    },
    {
      "id": "lw80107",
      "body": "As the mother of two little boys, I am so fucking sorry.",
      "created_utc": 1731140951.0,
      "score": 2
    },
    {
      "id": "lwf0xnf",
      "body": "Id be pressing criminal charges.\n\nhe could get harassment in my state at best at worst he could get terroristic threats and face juvenile placement or probation.",
      "created_utc": 1731250146.0,
      "score": 2
    },
    {
      "id": "lw4y3wx",
      "body": "That’s terrifying, I’m so sorry to them. I’m thankfully in a blue state so this hasn’t happened to me, but it’s seriously scary. I’m not moving anywhere near a red state, and possibly planning to move to a different country if this nation continues to get worse when I’m older.",
      "created_utc": 1731096940.0,
      "score": 367
    },
    {
      "id": "lw73r3o",
      "body": "Apparently planned parenthood have an IUD that lasts for 12-15 years and put it in with local anaesthetic. I’m in Aus but my cousin over there is taking her 16 and 15 year old girls in to see if they can get them put in.\n\nEdit: US doctors suck. Other  countries give locals or twilight sedation.",
      "created_utc": 1731123610.0,
      "score": 90
    },
    {
      "id": "lw7qmqa",
      "body": "Were that my daughter, I'd be telling her to come back with 'your penis, my scissors'.  \n\nTalk to your children about Saint Lorena Bobbitt -it's never too soon.",
      "created_utc": 1731134984.0,
      "score": 87
    },
    {
      "id": "lw72lk3",
      "body": "I am also in utah. My college campus has been terrifying. Not only have comments been made to me, but to other people while I'm in earshot. I hate to say it but I'm too scared to say anything back. Utah is terrible right now",
      "created_utc": 1731123131.0,
      "score": 34
    },
    {
      "id": "lw5a7gf",
      "body": "Whats going on in the states ?\nWhy is this word now trending",
      "created_utc": 1731100618.0,
      "score": 77
    },
    {
      "id": "lw8u6at",
      "body": "I'm so glad I'm not in school anymore bc idk if I would have the restraint to not beat the shit out of any guy who says that to me irl",
      "created_utc": 1731158748.0,
      "score": 5
    },
    {
      "id": "lw8kftg",
      "body": "No!! Oh my God that’s horrific!",
      "created_utc": 1731154137.0,
      "score": 3
    },
    {
      "id": "lw4nsor",
      "body": "[removed]",
      "created_utc": 1731093827.0,
      "score": 832
    },
    {
      "id": "lw4gsgu",
      "body": "I agree. I expected hate and vitriol on social media after this election, but to see it seeping in the school system and kids threatening girls with SA was not something even I expected. Idk how the school is going to handle that but my friends aren’t taking a chance.",
      "created_utc": 1731091747.0,
      "score": 654
    },
    {
      "id": "lw637jb",
      "body": "Someone says that shit to me they’re going to realize it’s my choice to beat the shit out of them",
      "created_utc": 1731110143.0,
      "score": 59
    },
    {
      "id": "lw4kd6j",
      "body": "Someone (or several people) have been tagging that all over my neighborhood. I hate to admit, it feels like… being terrorized",
      "created_utc": 1731092805.0,
      "score": 160
    },
    {
      "id": "lw4lmui",
      "body": "start replying with your body, my g\\*n or your body, my kn!fe",
      "created_utc": 1731093180.0,
      "score": 182
    },
    {
      "id": "lw4jmun",
      "body": "I'm not even a woman and I find that line incredibly uncomfortable. Stay safe ladies",
      "created_utc": 1731092588.0,
      "score": 133
    },
    {
      "id": "lw6zndy",
      "body": "I’ve been hearing this too from some of my mom friends. Awful.",
      "created_utc": 1731121937.0,
      "score": 6
    },
    {
      "id": "lw8r0lh",
      "body": "This is what happens when you put a convicted felon, rapist, misogynist, egomaniac in the highest position in the country.",
      "created_utc": 1731157365.0,
      "score": 4
    },
    {
      "id": "lw7438y",
      "body": "This seems like a very quick path to violence.",
      "created_utc": 1731123752.0,
      "score": 3
    },
    {
      "id": "lw4jylv",
      "body": "Parents aren't parenting, basically. They put kids in front of screens unmonitored, and they don't care what content is being consumed as long as the kids don't bother them. Screens are banned in my house unless necessary for school, and I don't care if I'm a... GASP... mean parent.",
      "created_utc": 1731092685.0,
      "score": 1162
    },
    {
      "id": "lw4zzz7",
      "body": "But I also think conservative people have a lot more children than progressive people",
      "created_utc": 1731097520.0,
      "score": 82
    },
    {
      "id": "lw4k71c",
      "body": "But 'boys will be boys'. You can fight this stuff with your own kids but I imagine this argument is going to be used a hell of a lot more over the coming years. I have a son and I worry about having to unteach him all of the indoctrinated misogyny that he'll be picking up from his peers.",
      "created_utc": 1731092755.0,
      "score": 132
    },
    {
      "id": "lw5a3fq",
      "body": "Exactly. All these young folks who think everything will get nifty when the boomers die are in for a rude awakening. When I try to explain that for most of my life the boomers *were* thought of as the most progressive generation, they think I'm defending the boomers. When the reality is that history is more nuanced. There is no guarantee that any future generation will be progressive or will stay that way. Lots of people hold a mixture of views, and many don't have strong political beliefs at all. Many people will parrot whatever their friends and TV tell them. Those same right wing pipelines will eventually capture younger people. Those who had liberal parents will be inclined to rebel against that in some way. And those who benefited from progress will get cushy and entitled, not realizing the fights that brought that progress. So the wheel turns, one step forward, five steps back.",
      "created_utc": 1731100583.0,
      "score": 50
    },
    {
      "id": "lw4pqd4",
      "body": "They also learned this week that you can be a felon convicted criminal and still be elected to the highest power in the world",
      "created_utc": 1731094406.0,
      "score": 127
    },
    {
      "id": "lw52sun",
      "body": "I live in SF Bay Area and it’s quite clear in one of the most progressive cities that my generation is the same old same old. Maybe worse wit phones",
      "created_utc": 1731098380.0,
      "score": 18
    },
    {
      "id": "lw5478a",
      "body": "Parents need to get their kids off the internet unsupervised",
      "created_utc": 1731098803.0,
      "score": 12
    },
    {
      "id": "lw50d77",
      "body": "Also to fight data collection, because the know exactly who to target with this shit, and whomever their connected too.",
      "created_utc": 1731097633.0,
      "score": 13
    },
    {
      "id": "lw6a5t2",
      "body": "Algorithms are poisoning young men and boy’s brains with far-right views and propaganda. Whether it’s X, YouTube, TikTok.\n\nI feel like Millennials knew to question sources and we got savvy with tech. We have some memories before the internet took off, then watching as it and social media developed over time. Many of us didn’t have smartphones for most of school and podcasts etc. weren’t a thing - it wasn’t just anyone with a loud mouth who could grab a microphone and impart their ‘wisdom’. Most of us seemed to want to progress, regardless of gender. We can also easily remember ‘normal’ politics before 2016.\n\nGen Z has seemingly created more division between age groups, claiming themselves to be superior. Young women seem to be doing well… but ‘Zoomers’ does seem one of the right terms for many of the guys.",
      "created_utc": 1731112579.0,
      "score": 5
    },
    {
      "id": "lw4rakf",
      "body": "This. More people need to spend time actually talking to their kids and teens. Everyone seems to just be assuming kids will find the way to being progressive on their own, and that’s not true with social media rn.",
      "created_utc": 1731094876.0,
      "score": 7
    },
    {
      "id": "lwbytjc",
      "body": "The problem is that the parents are too.  They think it's all ok.  They just voted in a rapist for a second time.       \n\nWe can't expect the kids to be better when the parents are horrible too.",
      "created_utc": 1731196894.0,
      "score": 2
    },
    {
      "id": "lw4pef9",
      "body": "Don’t bother with a scalpel, get a cigar cutter",
      "created_utc": 1731094306.0,
      "score": 201
    },
    {
      "id": "lw6hxme",
      "body": "Just use a gun. There is one right wing sentiment I am in agreement with, “bad guys leave in body bags.”",
      "created_utc": 1731115339.0,
      "score": 2
    },
    {
      "id": "lw5toku",
      "body": "Exactly. Now the mask is just coming off.",
      "created_utc": 1731106834.0,
      "score": 190
    },
    {
      "id": "lw66gsv",
      "body": "Yeah. I feel like white women have been duped into thinking men were more decent than they actually are. \n\nI’m Eurasian and frequently mistaken for Hispanic. I have a doctorate in statistics. Dudes have told me throughout my career that I was taking jobs from men. I’ve had my promotions mocked as being a “DEI quota.”",
      "created_utc": 1731111286.0,
      "score": 154
    },
    {
      "id": "lw751ke",
      "body": "Exactly! It’s always there. I worked in a male dominated profession and the amount of misogynistic vitriol that came out of men’s mouths on a daily basis was eye opening. Before then, I thought misogyny was a thing of the past. Joke was on me.",
      "created_utc": 1731124157.0,
      "score": 11
    },
    {
      "id": "lw56if6",
      "body": "When my mom was 10, in the late 50s, a 13 year old boy from her Catholic grade school raped her on school grounds after school was dismissed. Never underestimate what children can be capable of. My poor mother didn't even realize what had happened to her until she was much older and found out what sex was, she just knew she'd been hurt badly and her \"friend\" was not a good person.",
      "created_utc": 1731099497.0,
      "score": 191
    },
    {
      "id": "lw63gyz",
      "body": "It's something you can't really say on reddit but I'll go ahead and say it - I think porn is largely harmful to society. Millennials were the original super users, but we also grew up in a time when porn wasn't nearly so prevalent, accessible, and unrestrained. So I think you get millennials and older who can sort of use porn responsibility because they (mostly) grew up without it and understand how to distinguish it from reality.\n\nBut now you've got Gen Z and Gen Alpha who have been raised on unrestricted porn, potentially from a single digit age. I think it's hugely harmful to have kids with developing brains and no real world experience having porn as their formative sexual experiences. Not to even mention the hyper-stimulation aspect of it. They say there are record amounts of boys under 25 needing Viagra because they can't get hard with a real woman. Think of how crazy and maladaptive that is. \n\nAnd I think rampant misogyny is a byproduct of this culture. These boys grow up seeing women as commodities for their pleasure while also having no idea how to interact with a real girl or woman. That's a recipe for breeding resentment and hate towards women.\n\nI'm not an idiot. I know porn is here to stay. But jesus we have to do something about keeping young kids away from it.",
      "created_utc": 1731110235.0,
      "score": 98
    },
    {
      "id": "lw6g3t7",
      "body": "What's also frightening is parents have so much control over what their kids can view and do on the Internet and don't. Until my child starts paying their own phone bill, I will be monitoring everything and tracking their moves outside of the home\n\nEdited to add, obviously I can only do this on my child's phone and home Internet, but it's the best I can do and as long as other parents do this, there is a fighting chance hopefully",
      "created_utc": 1731114681.0,
      "score": 6
    },
    {
      "id": "lw8v269",
      "body": "when i was a kid(late 2000’s early 2010’s) i was sexually harassed, sexually assaulted, sexually abused and physically assaulted in what was, essentially, an abusive relationship. i was manipulated, i was guilted, i was love bombed, all of those things, while he would also use my empathy and naivety to assault me again and again. he was my age. he raped me when i was 14, coercively and using my weaknesses that he had spent years gaining access to, creating and maintaining. \n\nchildren are just as capable of horrible actions as adults, they can be equally as dangerous.",
      "created_utc": 1731159120.0,
      "score": 6
    },
    {
      "id": "lw6erpf",
      "body": "I am not American. I have loads of family in America, and I used to love visiting them. I don't want to anymore. I would actually be scared for my life going there now. My cousins school was shot up a few years ago, her best friend was shot dead in front of her. The current attitude of a lot of people and gun laws scares me to be completely honest",
      "created_utc": 1731114203.0,
      "score": 60
    },
    {
      "id": "lw5xk7j",
      "body": "\"We elected a mask–off psychopath rapist, so now all the others are taking their masks off too.\"\n\nYou are right. You are so right.\n\nPerhaps, in a twisted way, this election is a blessing? At least the masks are off now. We know who we are dealing with.",
      "created_utc": 1731108164.0,
      "score": 70
    },
    {
      "id": "lw7tx2h",
      "body": "Jesus Christ I'm so so sorry ",
      "created_utc": 1731137006.0,
      "score": 83
    },
    {
      "id": "lwbexbm",
      "body": "One of my co-workers who's a US born Hispanic keeps being asked if she's an illegal and is being called the N word by students.",
      "created_utc": 1731189926.0,
      "score": 7
    },
    {
      "id": "lw5alks",
      "body": "Yep. And this time around they’ve had four more years to get radicalized online, they’ve watched their idol be dragged into court, yet face not repercussions. These people are vengeful and full of hate and they don’t care one bit if you’re upset about it.",
      "created_utc": 1731100738.0,
      "score": 101
    },
    {
      "id": "lw62to3",
      "body": "💯",
      "created_utc": 1731110009.0,
      "score": 14
    },
    {
      "id": "lw6o5ym",
      "body": "The police are the same…",
      "created_utc": 1731117588.0,
      "score": 62
    },
    {
      "id": "lw6m8uh",
      "body": "See like a good idea as nothing else has worked.  Sometimes parents have after the school failed to do anything.",
      "created_utc": 1731116885.0,
      "score": 3
    },
    {
      "id": "lw9d9ur",
      "body": "I see chastity belts as top 10 Christmas gifts in 2024.",
      "created_utc": 1731166000.0,
      "score": 13
    },
    {
      "id": "lw5z29e",
      "body": "Use that fear as an incentive to get prepared. \n\nGet an education, get money. Learn how to defend yourself. Get all of your paperwork, like birth certificates and passport. You may need a male relative in the future to get one. Get birth control that can't be meddled with. Protect yourself and your allies.",
      "created_utc": 1731108687.0,
      "score": 51
    },
    {
      "id": "lw4x0a0",
      "body": "Don't be terrified,  be prepared.  Pepper gel.  Self-defense classes.",
      "created_utc": 1731096601.0,
      "score": 85
    },
    {
      "id": "lw5n581",
      "body": "My friends in my blue state (it did go red but supposedly not changing the laws on abortion) have just been telling me that I shouldn't let \"the trolls\" get to me because they don't know any men who think that way and that it'snot going to happen to me, so just don't worry about it at all, I guess? Like. I'm sorry that I care about other women besides myself??????",
      "created_utc": 1731104686.0,
      "score": 67
    },
    {
      "id": "lw6kgck",
      "body": "A lot of these comments came from the comments of adults that they heard about.  A middle school boy isn't going to think up the slogan, \"your body, my choice.\"",
      "created_utc": 1731116246.0,
      "score": 4
    },
    {
      "id": "lw7582g",
      "body": "Blue state that got bluer. My kid is in 8th grade, boy in her math class to her LGBT people won't have any rights, women won't have access to abortions and that's great. Finished off with 'all women should be deported, even my mom'. 😳",
      "created_utc": 1731124235.0,
      "score": 4
    },
    {
      "id": "lw5ii3t",
      "body": "> do a small easy research project on the opposite sex\n\nIf the problem is cynicism and apathy then I don't think that will help. Maybe these boys genuinely think women are lesser than men for some reason, which is a view that can be challenged and changed, but if the problem is they don't care then giving them some faux-progressive homework isn't going to do anything if they even engage with it at all.",
      "created_utc": 1731103206.0,
      "score": 26
    },
    {
      "id": "lw59z98",
      "body": "Thank you for voicing it like this. We can't fight fire with fire. It starts with better education, talking to eachother. Expowering empathy. What is going on now fuels even more divide between men and women. We seem to forget We were never meant to be enemies. Honestly, that text from that fascist triggers me as a SA survivor.  I'm nornally not easily triggered by what I read on the internet. I hope there will be attention towards this on schools. Not only punishment towards boys that spoud hatred they do not even understand the severity of. But also conversations about it.",
      "created_utc": 1731100548.0,
      "score": 22
    },
    {
      "id": "lw4kyoy",
      "body": "The world is becoming more diverse and accepting. \n\nJust not the USA. Among a few others.",
      "created_utc": 1731092981.0,
      "score": 10
    },
    {
      "id": "lw6ieo2",
      "body": "For any woman in the world with this economy? You should be child free for a while.",
      "created_utc": 1731115510.0,
      "score": 29
    },
    {
      "id": "lw9y37l",
      "body": "there's no way I would bring a child into today's world",
      "created_utc": 1731172799.0,
      "score": 5
    },
    {
      "id": "lwc19g9",
      "body": "I think I'd lean toward single too.   That or do some serious vetting.   \n\nI'd rather live with a few good friends and watch each other's back and share expenses than chance being with a guy right now if I were single.",
      "created_utc": 1731197761.0,
      "score": 2
    },
    {
      "id": "lw9p6h2",
      "body": "Agreed. It has always been this way, hence the bear.",
      "created_utc": 1731169939.0,
      "score": 2
    },
    {
      "id": "lwc1gx1",
      "body": "The child part of it is though.  Typically men don't start hating women and girls like this until they are much older.",
      "created_utc": 1731197834.0,
      "score": 2
    },
    {
      "id": "lw53ldw",
      "body": "And self-defense. \n\nIt's a sad thing that we have to do that. We shouldn't have to do so. Get some legal spray as well.",
      "created_utc": 1731098619.0,
      "score": 22
    },
    {
      "id": "lw4j1v7",
      "body": "A lot of it is being fed directly to them by Andrew Tate, Joe Rogan, et al. The manosphere is being pumped to young men and literal boys through social media. Those two were a huge part of the Gen Z shift hard red this election.",
      "created_utc": 1731092415.0,
      "score": 170
    },
    {
      "id": "lw58qfs",
      "body": "Can't agree with the take they shouldn't be aware of abortion when it's possible for 12 year old to get pregnant. \n\n\nThat's a normal part of sex education....or should be.",
      "created_utc": 1731100169.0,
      "score": 65
    },
    {
      "id": "lw6m0gs",
      "body": "As a 7th grader in 1974, I knew what abortion was because it was talked about so much.  Overheard adult women talking about it. When I got a little older, I was included in the conversation, so I knew about it long before high school.  The year before Roe was decided.  This however, was mostly talked about in private, not at the restaurant, not in the public square but at home.  It was talked about in public but more as a political issue.  In middle school none of my classmates talked about it.  In high school, it would come up from time to time but not very often.  \n\nNow it's talked about or brought up in conversations where it doesn't belong.  An example of this would be at an elementary school where those opposed to abortion showed these young kids pictures of abortions as they were walking to school.  Those opposed to abortion protesting in front of a school. This wasn't done when I was a kid as the protestors usually protested in front of an Planned Parenthood clinic or a clinic that they knew performed abortions.",
      "created_utc": 1731116803.0,
      "score": 8
    },
    {
      "id": "lwc2yo3",
      "body": "Most of them voted for a rapist twice.",
      "created_utc": 1731198367.0,
      "score": 4
    },
    {
      "id": "lw7ovj8",
      "body": "Everyone should at least try to learn some basic self Defence, and carry pepper spray if you can.\n\nIt’s like we are now progressing backwards, what’s next are they gonna take away our right to deny consent.",
      "created_utc": 1731133939.0,
      "score": 3
    },
    {
      "id": "lw6280b",
      "body": "And we have to stop this before they start hating themselves.",
      "created_utc": 1731109797.0,
      "score": 5
    },
    {
      "id": "lw4fs7w",
      "body": "Florida. 😡",
      "created_utc": 1731091451.0,
      "score": 70
    },
    {
      "id": "lw600pu",
      "body": "Exactly. Better to know the truth.",
      "created_utc": 1731109022.0,
      "score": 3
    },
    {
      "id": "lw9wo57",
      "body": "I wish I could give awards on this sub! I’m so glad your son is speaking out. His peers need a good peer role model. Thank you for the good work you are doing in raising the next generation!",
      "created_utc": 1731172343.0,
      "score": 2
    },
    {
      "id": "lw5k6e0",
      "body": "What unsupervised access to the alt-right and manosphere does to a generation",
      "created_utc": 1731103735.0,
      "score": 21
    },
    {
      "id": "lw5an3m",
      "body": "I'm confused myself",
      "created_utc": 1731100751.0,
      "score": 2
    },
    {
      "id": "lw5zx6t",
      "body": "That poor girl. Punished for her evil father.",
      "created_utc": 1731108987.0,
      "score": 12
    },
    {
      "id": "lw6nzmj",
      "body": "I remember people in one family being threatened with violence over something that they didn't do. Someone in the family did something very irresponsible which resulted in injury to one person and the other person died.   I was still in middle school I believe.  These individuals threatened were mostly adults who didn't attend the middle school or high school I attended.  I really believed that if they had, that someone would have beaten them up or someone who wanted to hurt someone would have used this as a excuse to harm them which is scary.  It wouldn't have been done at the school because the school was aware of the threat but would have been done if one of them was ever alone.  \n\nNo one in this family was harmed but I imagine in other cases like this, people who had nothing to do with the behavior of their family have been beaten up, verbally harassed or threatened.",
      "created_utc": 1731117522.0,
      "score": 3
    },
    {
      "id": "lw53okn",
      "body": "That's so awful.",
      "created_utc": 1731098646.0,
      "score": 11
    },
    {
      "id": "lw7zsti",
      "body": "I wish more people understood this. Why is it so obvious to us yet so many people are still blind? Now we have to get retribution because we dared ask for equality? They are all just so pathetic. I can’t deal with this world anymore.",
      "created_utc": 1731140799.0,
      "score": 6
    },
    {
      "id": "lw7ua94",
      "body": "Christian nationalism ruined our country ",
      "created_utc": 1731137239.0,
      "score": 20
    },
    {
      "id": "lw66adc",
      "body": "That’s a good idea. Teach these kids about the taliban and modesty police. No, maybe not. The boys may think it’s all good, and it will just give them someone to emulate. :(",
      "created_utc": 1731111224.0,
      "score": 7
    },
    {
      "id": "lw7011d",
      "body": "They surely need it.. because obviously if it’s gotten to this severe of a point then their parents are either teaching them this or they are just completely incompetent parents",
      "created_utc": 1731122086.0,
      "score": 6
    },
    {
      "id": "lw94iat",
      "body": "Youre the parent of the year. We need more people like that.\n\nMy dad always told me that men are terrible, and it's up to people like us to set a good example.\n\nHe told me that everything I have, everything I know, I owe to a women, because a woman brought us into this world.\n\nI'm GENUINELY, terribly sorry, for my half of the population. Women should never be treated like this, ever.",
      "created_utc": 1731162876.0,
      "score": 8
    },
    {
      "id": "lw53yop",
      "body": "So true.",
      "created_utc": 1731098730.0,
      "score": 3
    },
    {
      "id": "lw8b1b3",
      "body": "The conservatives want to keep people dumb so they keep voting conservative.",
      "created_utc": 1731148348.0,
      "score": 2
    },
    {
      "id": "lw6pu8a",
      "body": "Sadly girls who grow up in conservative environments aren't taught to fight back.  I never was.  Was told to try to get away or leave the situation.  Sometimes you can't always do this.  Was taught to only fight back if my life was threatened.  I was a baby boomer and sadly many baby boomer women put up with this crap in school.  Very few of them fought back.  Some were threatened with punishment if they did.  One classmate punched a guy in the arm and another slapped a guy across the face when he touched her bra strap. These two were sent to the principal office but didn't get punished but where told that they had overreached to the situation.  These didn't care as they weren't going to put up with this.",
      "created_utc": 1731118214.0,
      "score": 3
    },
    {
      "id": "lw6b6c9",
      "body": "I think this is truly the only answer. We need to fight fire with fire.",
      "created_utc": 1731112938.0,
      "score": 2
    },
    {
      "id": "lw57lah",
      "body": "He was suspended for 1 day. The school resource officers were notified and his schedule will be changed so my daughter does not have classes with him again.\n\nI wish it was a bigger punishment. 1 day of being suspended doesn’t feel like enough for threatening to rape someone.",
      "created_utc": 1731099822.0,
      "score": 2529
    },
    {
      "id": "lw72l50",
      "body": "I would agree, but apparently no consequences for vile reprehensible behavior is quite popular now.",
      "created_utc": 1731123126.0,
      "score": 2
    },
    {
      "id": "lw5o5z2",
      "body": "Thank you.  Match THAT energy.",
      "created_utc": 1731105018.0,
      "score": 23
    },
    {
      "id": "lw6o0ba",
      "body": "My daughter is a twin and she has a twin brother. The school doesn’t put siblings in the same classes but they have lunch together. \nSome of these boys are very cocky and don’t seem to know how to talk to girls respectfully.",
      "created_utc": 1731117529.0,
      "score": 6
    },
    {
      "id": "lw6jmy4",
      "body": "It's sad.  When I was growing up, you didn't have boys and men stalking and threatening girls like you do now.  I don't doubt that it did happen back in the day,  but certainly not of the scale that you see now. Most girls and young women who were baby boomers had siblings and most had at least one brother who was close in age to them.  I imagine this curbed this type of behavior or at the very least some boy or man would think twice about threatening girls and women especially if they had to deal with her brother or brothers or her dad who would confront them about their behavior.  Some of the brothers would have become physical with them and they certainly didn't want that.  Back then, people didn't call the police about these things.  Now if that happened, the brother would be arrested for assault.",
      "created_utc": 1731115953.0,
      "score": 90
    },
    {
      "id": "lw7spsa",
      "body": "I have that one (copper IUD) and you definitely do not get anaesthetic for it. So take a high dose of ibuprofen and hold on tight",
      "created_utc": 1731136254.0,
      "score": 55
    },
    {
      "id": "lw9nmq9",
      "body": "they do not do local for IUDs. maybe in australia but in america just like cervical biopsies it’s all done with no pain management just told to take tylenol beforehand",
      "created_utc": 1731169437.0,
      "score": 23
    },
    {
      "id": "lwcr2dv",
      "body": "The copper IUD, Paragard, lasts 12 years and is very effective! It does, however, cause heavier, longer, and crampier periods for most, so we don't typically recommend it. If open to hormones, Mirena lasts 8 years and is equally effective, and often lightens or takes away period symptoms altogether. Just putting it out there :-) {source: I work at Planned Parenthood}",
      "created_utc": 1731207335.0,
      "score": 2
    },
    {
      "id": "lw7uie8",
      "body": "I now want to get another Saint Lorena Bobbit t-shirt...",
      "created_utc": 1731137381.0,
      "score": 13
    },
    {
      "id": "lwe0796",
      "body": "So my partner is from Ecuador and Lorena Bobbitt is also Ecuadorian (didn't know that until we had this conversation Im about to mention). I remember her coming up in conversation one day, and thinking he wouldn't know who she was cause we were both little when that all happened, and he was still living in Ecuador. Well apparently she is extremely respected for taking action for everything that was done to her by her now ex, at least in the city my partner is from, and it was huge news over there back in the 90s to the point she's still very much respected for sticking up for herself and taking action. His family is mostly all females, and they absolutley adore her...basically don't mess with them or you might get Bobbitt'd lol.",
      "created_utc": 1731231091.0,
      "score": 3
    },
    {
      "id": "lw5qgkb",
      "body": "It was a tweet from some right wingnut, so now all of the cult members, including children, are saying it.",
      "created_utc": 1731105766.0,
      "score": 125
    },
    {
      "id": "lw5pid9",
      "body": "I saw the video on TikTok. Spoken by nick fuentes",
      "created_utc": 1731105453.0,
      "score": 52
    },
    {
      "id": "lwaz9nx",
      "body": "You can think Nick Fuentes for that.  Look him up, find his video post, and you will see.",
      "created_utc": 1731184774.0,
      "score": 2
    },
    {
      "id": "lw5gaub",
      "body": "And Andrew Tate.",
      "created_utc": 1731102518.0,
      "score": 131
    },
    {
      "id": "lw58x9p",
      "body": "Nick Fuentes thinks girls are icky.",
      "created_utc": 1731100227.0,
      "score": 66
    },
    {
      "id": "lw556t7",
      "body": "[removed]",
      "created_utc": 1731099099.0,
      "score": 178
    },
    {
      "id": "lw4scs2",
      "body": "[removed]",
      "created_utc": 1731095194.0,
      "score": 130
    },
    {
      "id": "lw63bfr",
      "body": "I'm very tired and I read \"Vic Fuentes\" and I thought \"damn what's the singer of Pierce the Veil got to do with this?\"\n\nI think I need to go to bed\n\n\nedit: typo",
      "created_utc": 1731110181.0,
      "score": 38
    },
    {
      "id": "lw605ca",
      "body": "It's wild how YOUNG they're starting too. When I was in middle school, boys were just making fart jokes and yelling about cooties. It blows my mind that middle school boys now freely talk about SA and even joke about it",
      "created_utc": 1731109067.0,
      "score": 168
    },
    {
      "id": "lw4wjrr",
      "body": "Check out the teacher's subs. It's rampant.",
      "created_utc": 1731096462.0,
      "score": 206
    },
    {
      "id": "lw52ncw",
      "body": "Kids have always been shitbag bullies and sadly the schools have never done shit to stop it. It's the status quo and don't you dare disrupt it.",
      "created_utc": 1731098335.0,
      "score": 79
    },
    {
      "id": "lw7ooda",
      "body": "If I heard another man say this to a woman in my presence, I'd break his jaw.",
      "created_utc": 1731133822.0,
      "score": 25
    },
    {
      "id": "lw5wmuj",
      "body": "You are.",
      "created_utc": 1731107844.0,
      "score": 61
    },
    {
      "id": "lw694tn",
      "body": "\"Your body, my choice\"?",
      "created_utc": 1731112218.0,
      "score": 17
    },
    {
      "id": "lw6foh3",
      "body": "no fucking way wtf :(",
      "created_utc": 1731114530.0,
      "score": 11
    },
    {
      "id": "lw54vd0",
      "body": "I’ve heard ”Dead Men Can’t Rape”, a quote from serial killer Aileen Wuornose being thrown around, and I gotta say, I like it.",
      "created_utc": 1731099005.0,
      "score": 316
    },
    {
      "id": "lw52oxo",
      "body": "“My mace, your face”",
      "created_utc": 1731098348.0,
      "score": 141
    },
    {
      "id": "lw50mgn",
      "body": "You can't say that at a school, you'll be suspended and labeled a school shooter. Only SA jokes are copacetic.",
      "created_utc": 1731097712.0,
      "score": 112
    },
    {
      "id": "lw4lyrc",
      "body": "I like \"your body, your grave\"",
      "created_utc": 1731093278.0,
      "score": 188
    },
    {
      "id": "lw4o1ro",
      "body": "Your groin, my knee seems to get the point across rather well, too.",
      "created_utc": 1731093903.0,
      "score": 125
    },
    {
      "id": "lw4qdf2",
      "body": "Or \"Your body, my knife, your choice.\"",
      "created_utc": 1731094601.0,
      "score": 52
    },
    {
      "id": "lw6z2ff",
      "body": "Hatpins need to come into fashion again.",
      "created_utc": 1731121710.0,
      "score": 26
    },
    {
      "id": "lw57dop",
      "body": "\"So, you're admitting that's the only way you can get some. It's not like any woman would actually want to do it with you.\"",
      "created_utc": 1731099758.0,
      "score": 42
    },
    {
      "id": "lw6hb5e",
      "body": "One thing good about 2A is at least women and vulnerable people have constitutional access to it.",
      "created_utc": 1731115115.0,
      "score": 6
    },
    {
      "id": "lw4kp0e",
      "body": "It’s not uncomfortable, it’s evil. And it doesn’t matter your gender, every human being should find it disgusting to hear that.",
      "created_utc": 1731092903.0,
      "score": 202
    },
    {
      "id": "lw8zjo8",
      "body": "It's not uncomfortable for women to hear. It's bone chilling for us. It's a direct threat that we know other men will do nothing to stop. It's something we know that no policing body will care about. The best we can do is carry a weapon with us, and hope we don't freeze when these men make good on their threats.\n\nWhile it's uncomfortable for you to hear, we hear it as a death sentence.",
      "created_utc": 1731160945.0,
      "score": 9
    },
    {
      "id": "lw7t8ow",
      "body": "I think you should find threatening a person with rape to be more than uncomfortable...",
      "created_utc": 1731136581.0,
      "score": 5
    },
    {
      "id": "lw4wgig",
      "body": "It terrifies me that my step kids mother has let them have unsupervised and unrestricted access to the internet their entire lives. The one time she asked my opinion on it after a dust up of my 10 year old daughter downloading discord which mom said no to and daughter continued to do so, I suggested mom either monitor the entire time or take away the screens completely when she can’t monitor. Her answer? “But I already told the kids they could use it whenever.” I tried so hard not to facepalm, had to remind this woman who is nearly TWENTY YEARS OLDER THAN ME and had two older children (not by my husband, different dads from each other, too) that she is the mother and makes the rules, sometimes the kids won’t like it but it is for their health and safety.  \n\nSurprise, surprise they continue to have unsupervised and unrestricted internet access. I’m lucky my conversations with my son and daughter about Andrew Tate consisted of “ew” and “he is awful”. I will just do my best to counteract what I can and keep lines of communication as open as possible considering they are 2k miles away and getting them to text back is like pulling teeth.",
      "created_utc": 1731096434.0,
      "score": 175
    },
    {
      "id": "lw4rhjv",
      "body": "Yep exactly. I have 4 sons and a daughter. iPads are only for class work, and the kids don’t have the passwords to the devices.",
      "created_utc": 1731094934.0,
      "score": 67
    },
    {
      "id": "lw5zlcv",
      "body": "IMO A large part of it is that most kids have 2 working parents. Most kids do not have a parent at home to closely monitor usage or their parents are just tired. I am not trying to make excuses but things are tough in dual income households.",
      "created_utc": 1731108872.0,
      "score": 13
    },
    {
      "id": "lw4ksaq",
      "body": "This.",
      "created_utc": 1731092930.0,
      "score": 14
    },
    {
      "id": "lw6d2r2",
      "body": "As a millennial parent, I can’t stand other people’s kids for the kind of crap that comes out of their mouths. I’m glad to have conversations with my daughter about these boys that talk crap trying to act cool but they’re not.",
      "created_utc": 1731113608.0,
      "score": 3
    },
    {
      "id": "lw6hsyk",
      "body": "Kids aren't being held accountable for bad behavior.  When I was a kid, there were consequences for bad behavior (you didn't get away with stuff in the schools that some of the kids do now).  Your parents told you this, warned you about bad behavior and most of them followed thru with punishment if you engaged in bad behavior. Just the threat of punishment was enough to keep most kids in line back in the day, but not now.  \n\nKids today don't care if they get suspended or expelled from school (being expelled from school back in the day was the worst thing that could happened, most kids avoided getting suspended from school because this was also bad as well).  The thought of going to a juvenile detention facility was scary to most kids.  Isn't at all now.",
      "created_utc": 1731115291.0,
      "score": 3
    },
    {
      "id": "lw4o2qm",
      "body": "You‘re right to worry. We raised two sons, same genes, same schools, same environment- one got into men‘s rights and dubious political affiliations in his teens and there was (is) no reasoning with him. He even lost his school friends due to his beliefs. We tried therapy (individual and family), education, so many talks, to no avail. If kids from right-wing families can turn left, the other way can happen too. I believe we let him have unsupervised YouTube time too early (~14).\n\n\n ETA: He‘s grown up and out of the house now.",
      "created_utc": 1731093911.0,
      "score": 95
    },
    {
      "id": "lw4p1ti",
      "body": "For real. I told mine, early 20’s and late teens, that I will not respond well should they think this is the time to make edge lord jokes about any of this. No, not at all.   \nHere is hoping they realize how serious I am about this.",
      "created_utc": 1731094202.0,
      "score": 34
    },
    {
      "id": "lwa42sx",
      "body": "Boys are being boys because people ALLOW them to. It needs to stop. NOW.",
      "created_utc": 1731174711.0,
      "score": 5
    },
    {
      "id": "lw5ble3",
      "body": "Yeah I mean. I was “young folks” (I’m a millennial) but I have had people my age think people younger than us are going to be automatically more progressive. I don’t know how else to explain to them that this isn’t the case- like you said, there is a mixture in every group. Somehow, things seem to be getting worse again. We need to just keep staying vigilant and actually do something, lest things really swing backwards further than they already are. This anecdote is an alarming example of where things are headed.",
      "created_utc": 1731101041.0,
      "score": 23
    },
    {
      "id": "lw653ys",
      "body": "Absolutely. I had hope for my children's generation. Then my son tells me that one of his friends said Kamala Harris shouldn't be president bc she's a woman. It's the same crap, same cycle repeating itself. These kids learn it from their parents or online. It's infuriating and it makes me feel hopeless at times.",
      "created_utc": 1731110809.0,
      "score": 15
    },
    {
      "id": "lw6cdlc",
      "body": "Most of the baby boomers parents were conservative which they rebelled against.  Now they are being rebelled against.  Seems to go in cycles but this cycle is a particularly bad one.",
      "created_utc": 1731113361.0,
      "score": 6
    },
    {
      "id": "lw5pr6k",
      "body": "But not a woman :( they learned that women aren’t *really* allowed to be president no matter what anyone says. I’m so disheartened. Not one, but *two* smart, qualified, experienced women were not elected, while a rich man who has done things that just 10 years ago would have ended a career in either party is given the job.",
      "created_utc": 1731105533.0,
      "score": 79
    },
    {
      "id": "lw85uv8",
      "body": "Who openly brags about being able to sexually assault women just for fun because you’re famous and can get away with it.",
      "created_utc": 1731144885.0,
      "score": 9
    },
    {
      "id": "lw4ykcv",
      "body": "Don’t bother with a cigar cutter, get a gun",
      "created_utc": 1731097080.0,
      "score": 97
    },
    {
      "id": "lw8u9fj",
      "body": "honestly i don’t even know how. i’m a white woman, born and raised in denmark. men, generally, are not safe. i have consistently been reminded of that my entire life, whether from words or actions. i still get told i’m being hysterical or emotional when i get passionate arguing about women’s rights and misogyny. how do you possibly get disillusioned about this!!! 90% of the time they don’t even try to disguise it!",
      "created_utc": 1731158785.0,
      "score": 20
    },
    {
      "id": "lw7kwie",
      "body": "White women want white men to stay on top because they also reap the benefits. ",
      "created_utc": 1731131678.0,
      "score": 8
    },
    {
      "id": "lw6d2j9",
      "body": "This is why comprehensive sex ed and reproductive biology (using correct terminology and not cutesy nicknames) are so important.",
      "created_utc": 1731113605.0,
      "score": 87
    },
    {
      "id": "lw7sle0",
      "body": "I'm so glad to see this post. \n\nI totally agree porn is a large part of the root of this evil. I, a female, was born in 1980 and I know porn was very difficult for my male peers to get hold of. However, this access has become all too easy in the digital age. This is affecting the way boys interact with the opposite sex. I live in the UK where secondary schools (high schools), have had incidents of boys SA'ing girls. This is extremely concerning. The there is the issue of that human garbage Andrew Tate who has managed to brainwash these young lads with his toxicity, with some boys saying to female teachers that they don't even need to listen to them and being female means they don't know anything and can't teach. I've even encountered a little scrote once: I was looking to get a bus and he was talking down to me, without invitation, telling me the bus was coming shortly, which wasn't the case. \n\nIf some of this is happening in the UK where we do not have a PM who has that type of attitude towards women, I really fear for the women and girls of the US.  It looks and feels like you are heading towards a theocracy and one that will make the Taliban look ultra liberal.",
      "created_utc": 1731136178.0,
      "score": 17
    },
    {
      "id": "lw81vzt",
      "body": "In my country years ago a secretly recorded sex video of a very famous model came out, I was in high school. It was such a big shock to be able to see something like that among my peers, I was so traumatized that I still remember the few seconds I saw, even years later. (A friend of mine shoved the phone in my face) Now anyone with a smartphone has access to it at any age. Watching videos of people having sex has become a daily routine for kids. \n\nEveryone knows someone with an OF account. It's never healthy for a child to have such easy access to videos of their neighbor, friend's brother or sister, or anyone they know having sex. There are teachers in this world who make money from additional work as OF. Can you imagine how it affects a teenager's sexual development to be able to see their teacher having sex whenever they want?\n\nAdults should be able to access whatever content they want, (except things like CA of course) but there has to be a way to protect children from this.",
      "created_utc": 1731142201.0,
      "score": 6
    },
    {
      "id": "lw8wles",
      "body": "as a gen z, i can’t help but agree. i have found healthy habits, but i honestly even struggled with a porn dependency at one time and i barely had a sex drive. i was shown internet porn for the first time when i was probably 9? maybe slightly younger. i do not believe it is healthy for anyone to have the access they do, much less the exposure since we were literal children. i am a huge appreciator of sex work, including films and OF work, but i do think there has to be better resources for both restricting the access to these sites but also therapy and help if the addiction hits.",
      "created_utc": 1731159753.0,
      "score": 3
    },
    {
      "id": "lw8052s",
      "body": "The problem is very deep and parents like you are in the minority. Parental education is absolutely necessary and unfortunately it is an utopia. Because the  institutions or governments that should provide this education also have a sick perspective.\n\nIn this era, little girls are exposed to things far above the usual  perversions (bitter irony) that we have been exposed to in our childhood. I congratulate myself every day for not having children but I am anxiously worried about the present and future of every single young girl.",
      "created_utc": 1731141027.0,
      "score": 4
    },
    {
      "id": "lw8xcgx",
      "body": "Oh honey🫂I'm so sick of the banality of evil. I'm so, so sorry. I hope you are doing well now.❤️",
      "created_utc": 1731160056.0,
      "score": 3
    },
    {
      "id": "lw65w76",
      "body": ">Perhaps, in a twisted way, this election is a blessing? At least the masks are off now. We know who we are dealing with.\n\nThat is the whitest thing I've ever heard anyone say. We have always known. People of color, women, lqbtq folx, immigrants, we have ALWAYS KNOWN. We've been telling you, but y'all didn't listen. It wasn't serious enough for you, it didn't impact you, that $1.99 gallon of gas and $5 for 5 at Arbys were more important than our lives.\n\n*This is not a blessing.*\n\nWhite women fucked around, and now all them Serena Joys gonna be finding out.",
      "created_utc": 1731111086.0,
      "score": 123
    },
    {
      "id": "lw6whh8",
      "body": "You know this happened just a bit ago too, right? \n\nFucking blessing!? Yeah, they did this nonstop for years, but mask off now.  Right",
      "created_utc": 1731120730.0,
      "score": 13
    },
    {
      "id": "lwbglq0",
      "body": "I’m so sorry she’s going through that, it’s awful how kids are turning out",
      "created_utc": 1731190494.0,
      "score": 7
    },
    {
      "id": "lw5d375",
      "body": "Absolutely, it’s going to be much worse than 2016.",
      "created_utc": 1731101523.0,
      "score": 37
    },
    {
      "id": "lw6ok72",
      "body": "I know they more often than not do nothing, but these kids are still young enough to be scared straight if the cops actually do their job. Also if they ignore it, thats more damning information to give to the news",
      "created_utc": 1731117735.0,
      "score": 21
    },
    {
      "id": "lw5n978",
      "body": "That’s not enough.",
      "created_utc": 1731104723.0,
      "score": 22
    },
    {
      "id": "lw574d2",
      "body": "Not gonna do shit when they have a gun.",
      "created_utc": 1731099680.0,
      "score": 12
    },
    {
      "id": "lw6i2as",
      "body": "Learn gun. Or get people who know gun.\n\nThen learn to run. It is better to run than to die.",
      "created_utc": 1731115387.0,
      "score": 2
    },
    {
      "id": "lw6q9hw",
      "body": "You don’t have to “know” anyone with that mentality. It can happen to anyone, at anytime, regardless of familiarity. The point I’d make to your friends is that it’s emboldening the people who previously kept these parts of themselves hidden; they feel enabled to act out, however they want, toward whoever they want.",
      "created_utc": 1731118374.0,
      "score": 19
    },
    {
      "id": "lw4m9q1",
      "body": "Eh you'd be surprised. Some countries \"look\" diverse and accepting but you'll still find a lot of people with ignorant beliefs. The USA is just more \"open\" about it. I'd say a positive about that is that at least people in the USA aren't afraid of educating others about different cultures since there's more immigration in the USA. In some countries in Europe and Asia you'll find more mono cultures that rarely see \"foreigners\".",
      "created_utc": 1731093368.0,
      "score": 27
    },
    {
      "id": "lw70ig0",
      "body": "I’m not some Joe Rogan stan but I have to say, he has never said something like this. I’m a woman who’s watched a lot of his content. I don’t think he’s even supportive of the pro life movement and he has several daughters.",
      "created_utc": 1731122281.0,
      "score": 2
    },
    {
      "id": "lwc2vrt",
      "body": "The thing that a lot of people don't seem to know or remember is that when Roe passed it have strong support, especially in the republican party.  It was seen as a way to save women's lives not a moral issue.   \n\nNow women will go back to dying more in pregnancy or due to unsafe abortions like before.  Our grandmothers fought so hard to save their daughters and granddaughters and it was for nothing.",
      "created_utc": 1731198338.0,
      "score": 3
    },
    {
      "id": "lw7lve3",
      "body": "Too late.",
      "created_utc": 1731132217.0,
      "score": 3
    },
    {
      "id": "lw4lrht",
      "body": "Florida needs to go underwater so it can be blue for once",
      "created_utc": 1731093218.0,
      "score": 142
    },
    {
      "id": "lw4oqi7",
      "body": "As a floridian this makes me so angry for her. Tell her that if they touch her she is allowed to go full Loraine Bobbbit.",
      "created_utc": 1731094109.0,
      "score": 34
    },
    {
      "id": "lw605hi",
      "body": "They are thinking like the previous generation of men, and the generation before that. It's just that social media makes it obvious.",
      "created_utc": 1731109068.0,
      "score": 5
    },
    {
      "id": "lw64ifm",
      "body": "Yeah, it was really fucked up. That was probably the first time I'd ever seen a person be so completely and harshly rejected by basically everyone for something that doesn't even make sense logically, much less morally. \n  \nIt was pretty much instant, too. IIRC, the other kids were acting like she initiated it or something. Hardly any of them even took a second to think about what they were asserting and how it didn't make any sense. I mean, she was like, 14 or so. Of course, it wasn't about that; they saw an opportunity to hurt someone so they did it because they wanted to. How it affected her didn't factor into their decision at all. It was the direct result of how their parents and the culture around them treated anything related to sex at the time. The fact that they were so ruthless was 50% the bad parents and external culture and 50% kids being shitty in that specific way only they are capable of.",
      "created_utc": 1731110599.0,
      "score": 8
    },
    {
      "id": "lw6mh3b",
      "body": "Definitely don’t teach them to emulate but don’t fall in the trap of hiding the girls.  Teach them to fight.",
      "created_utc": 1731116969.0,
      "score": 5
    },
    {
      "id": "lw7b6pr",
      "body": "If the parents teach them it then they should get their asses beaten too. In prison.",
      "created_utc": 1731126873.0,
      "score": 3
    },
    {
      "id": "lw5mvjb",
      "body": "If any offense is expel worthy, threatening to rape someone should be. The one day suspension will do nothing, all it’s taught him is that he can keep saying the same threats, the same words, and he’ll be out of school for a couple days at most on a “vacation”, he needs to be expelled for it to sink in that what he’s saying is wrong, and ideally all the schools in the area being told about him. Rape isn’t a “joke”, and 11 year olds shouldn’t even know what that is, the fact he does says *a lot* about his parents. If I even remotely threatened anything like that, my dad would have beat me black and blue for it. How are his parents okay with this behavior?",
      "created_utc": 1731104599.0,
      "score": 1144
    },
    {
      "id": "lw5nnid",
      "body": "If he continues put a restraining order on him if you can .",
      "created_utc": 1731104852.0,
      "score": 155
    },
    {
      "id": "lw5wsv0",
      "body": "But she could still meet him in the corridors. How is her academic life going to be affected when she's afraid of being violently assaulted at any moment?",
      "created_utc": 1731107902.0,
      "score": 82
    },
    {
      "id": "lw6nuv5",
      "body": "W H A T\n\nI got expelled for an entire week because someone accused me of drawing Care Bears on the bathroom walls and this kid gets 1 day ?? Tf..",
      "created_utc": 1731117475.0,
      "score": 67
    },
    {
      "id": "lw61mik",
      "body": "He needs to be expelled. Please fight for that to happen for your daughter. I would be so scared if I were her.",
      "created_utc": 1731109585.0,
      "score": 40
    },
    {
      "id": "lw6k2x5",
      "body": "[deleted]",
      "created_utc": 1731116111.0,
      "score": 40
    },
    {
      "id": "lw6gsqu",
      "body": "You need to take that shit to the school board or the local news. It sounds like the principle is incompetent",
      "created_utc": 1731114931.0,
      "score": 28
    },
    {
      "id": "lw7qhfp",
      "body": "Wow, that boy threatens to rape your daughter and gets a literal slap on the wrist. Thar 1 day suspension will reach him with no consequences. I suggest you sign  your daughter up for self-defense classes, and also get a lawyer to see of this can be pursued further. Lastly, I'm so sorry someone thought is was acceptable to say this to your daughter",
      "created_utc": 1731134901.0,
      "score": 3
    },
    {
      "id": "lw7x13f",
      "body": "I’d definitely pursue this further, maybe through your PTA equivalent. There have got to be lots of other concerned and outraged parents. Stand up, and insist that the culture of your school be changed by the administration, principals, teachers and parents. You need a program instituted that teaches respect for girls and women, starting in grade school. Our entire educational system needs this, nationwide!",
      "created_utc": 1731138991.0,
      "score": 3
    },
    {
      "id": "lw8vacj",
      "body": "One day of being suspended might as well just be a “mental health” day for that kid. That is absolutely unacceptable",
      "created_utc": 1731159214.0,
      "score": 3
    },
    {
      "id": "lw65dfh",
      "body": "It definitely does not feel like enough but it’s hard to be surprised when the criminal punishment isn’t enough either. If it happens at all.",
      "created_utc": 1731110903.0,
      "score": 2
    },
    {
      "id": "lw671bh",
      "body": "Sounds like he will be doing  time ,some  day.",
      "created_utc": 1731111486.0,
      "score": 2
    },
    {
      "id": "lw6q736",
      "body": "I got more than that for calling a teacher a dick - and for the record, I was right!",
      "created_utc": 1731118349.0,
      "score": 2
    },
    {
      "id": "lw71vsw",
      "body": "That was basically a reward. So fucked.",
      "created_utc": 1731122837.0,
      "score": 2
    },
    {
      "id": "lw72mxl",
      "body": "Time to contact an attorney and notify the school they are on blast.",
      "created_utc": 1731123146.0,
      "score": 2
    },
    {
      "id": "lw74h55",
      "body": "ONE DAY?!",
      "created_utc": 1731123916.0,
      "score": 2
    },
    {
      "id": "lw8a82a",
      "body": "How in the holiest of hells is threatening rape not a zero tolerance offence in *elementary/middle* school?! I would be lobbying to have the school investigated. I would go to the school board, the media, anyone who will listen. She doesn't have to be in any classes with him to be victimized by him. In fact, that's the *last* place where he would attempt to perpetrate anything. It's in the empty halls, locker rooms, bathrooms, where she could be ambushed. He and his family probably think it's a joke, and there will never be any repercussions because the school has shown that there won't be.",
      "created_utc": 1731147810.0,
      "score": 2
    },
    {
      "id": "lw8un02",
      "body": "Well, a rapist was just elected as president, it's not going to get any better.",
      "created_utc": 1731158944.0,
      "score": 2
    },
    {
      "id": "lw95cnb",
      "body": "Are there any martial arts schools near you? I think every girl, woman, LGBTQ+ person, and those who no longer feel safe should sign up. You can learn with your daughter. It can be a family activity. But give your daughter the gift of the ability to protect herself. Please. Never expect someone else to protect you or your children, those days are gone.",
      "created_utc": 1731163191.0,
      "score": 2
    },
    {
      "id": "lw9gdri",
      "body": "If this happened to my sister 20 years ago then my mum and dad would have scared off the child's parents and would have got the kid kicked out. \n\n\nThey are just too lenient in schools these days. \n\n\nI remember that a kid and his dad was aiming racist remarks about me when I was 7. My dad threatened to beat the rubbish out of the dad and then go to the news papers. The child left the school and they moved. \n\n\nMy parents were on point during those days. You can't do this nowadays. ",
      "created_utc": 1731167044.0,
      "score": 2
    },
    {
      "id": "lw9iq2j",
      "body": "One day suspension is a token punishment which communicates to boys that they can continue to pursue their dreams of being predators.",
      "created_utc": 1731167824.0,
      "score": 2
    },
    {
      "id": "lw9ndub",
      "body": "please see if you can get a restraining order on him for your daughter",
      "created_utc": 1731169357.0,
      "score": 2
    },
    {
      "id": "lw9t169",
      "body": "I would file a police report, too.",
      "created_utc": 1731171177.0,
      "score": 2
    },
    {
      "id": "lw9zs2y",
      "body": "I'd be finding out where he lives and making my presence known.",
      "created_utc": 1731173343.0,
      "score": 2
    },
    {
      "id": "lwa6bbw",
      "body": "I would contact the police and make an official complaint.  Consider contacting the media as well. The school will have no choice but to consider harsher consequences.",
      "created_utc": 1731175418.0,
      "score": 2
    },
    {
      "id": "lwcuz7l",
      "body": "Please raise hell. Kids are regularly given 3 days OSS for fighting. This is so much worse.",
      "created_utc": 1731208857.0,
      "score": 2
    },
    {
      "id": "lwf25si",
      "body": "I would be threatening to take this to local media if the school didn't extend that punishment",
      "created_utc": 1731250576.0,
      "score": 2
    },
    {
      "id": "lw6t3mg",
      "body": "Generally the siblings weren't in the same classes (exception was home room) but because the middle school was rather small sometimes their brothers whose classes were nearby would often walk with their siblings to class or they happened to be walking in the same direction.  Some of them would have lunch with their siblings but others would be with their friends.",
      "created_utc": 1731119442.0,
      "score": 5
    },
    {
      "id": "lwbxs9v",
      "body": "I have encouraged my boys to stand up to this kind of thing. I have told them they will never be in trouble at home for protecting someone or themselves, even if they have to get physical. I have told my daughter to grab a brother to help her. We need to be pushing our kids to stand up and fight for each-other and fight for whats right.",
      "created_utc": 1731196528.0,
      "score": 4
    },
    {
      "id": "lwrfxeb",
      "body": "I passed out it hurt so bad when they tried to shove it in only to wake up to be told that my uterus was too \"short\" and it wouldn't fit \nAlso woke up to the (male) doc telling me \"wow, if you can't handle that pain, DON'T get pregnant\".... Like no shit! What do you think I'm trying to do here? ",
      "created_utc": 1731425982.0,
      "score": 5
    },
    {
      "id": "lwcf76j",
      "body": "Ibuprofen doesn't do anything for it. Had it done no meds at all and they didn't give me pain meds for after. I tried Ibuprofen and the other one I don't remember right now but they didn't do anything for it and I had to go back and get a prescription pain med. Also it moved and was super painful so I'm never getting one again.",
      "created_utc": 1731202807.0,
      "score": 3
    },
    {
      "id": "lwb4lvh",
      "body": "Which is utter backwards, bullshit nonsense. It makes me so angry that women’s pain is not taken seriously in the medical field. This practice is based upon the completely false, unscientific belief that the “cervix does not have nerves” 🤬",
      "created_utc": 1731186518.0,
      "score": 16
    },
    {
      "id": "lwbb2oj",
      "body": "Geez that’s brutal. Here in Aus they get put in under twilight sedation",
      "created_utc": 1731188657.0,
      "score": 3
    },
    {
      "id": "lw74hck",
      "body": "Social media will be the death of us.",
      "created_utc": 1731123919.0,
      "score": 44
    },
    {
      "id": "lw87b4p",
      "body": "Wow \nWhy are men now saying they own women now ?\nHas America now regressed ?",
      "created_utc": 1731145868.0,
      "score": 6
    },
    {
      "id": "lw74mmg",
      "body": "That same Reddit post people on the right were commenting “just ignore this, this is just an extremist, this isn’t how all of us think.” Here we are mere days later and hearing stories about it being repeated everywhere. Social media is going to doom us all.",
      "created_utc": 1731123980.0,
      "score": 54
    },
    {
      "id": "lw5aspv",
      "body": "Dropping the right cross and following up with the left hook",
      "created_utc": 1731100798.0,
      "score": 57
    },
    {
      "id": "lw52ecv",
      "body": "Multiple, widely separated ones.",
      "created_utc": 1731098258.0,
      "score": 53
    },
    {
      "id": "lw5340x",
      "body": "Be careful, there was another thread where Reddit was removing comments saying stuff like this",
      "created_utc": 1731098474.0,
      "score": 25
    },
    {
      "id": "lw7syqd",
      "body": "Dawg I’m not even tired and I read it like that too and thought “NOT MY BOY Viiii¡¡¡¡iiC!”",
      "created_utc": 1731136407.0,
      "score": 2
    },
    {
      "id": "lw6cjvi",
      "body": "It’s because of the influences they have access to. It’s always the influences. \n\nThis means dads, uncles, other peoples parents, YouTube, internet, and any other influence that might share these sentiments; kids who play video games and fall into the trap of needing to talk like them to fit in,",
      "created_utc": 1731113422.0,
      "score": 107
    },
    {
      "id": "lw5qphf",
      "body": "Mind dropping a link?",
      "created_utc": 1731105847.0,
      "score": 26
    },
    {
      "id": "lwaos3c",
      "body": "Only his jaw?",
      "created_utc": 1731181329.0,
      "score": 2
    },
    {
      "id": "lw7egpa",
      "body": "There's also a song called that by Delilah Bon, really brings the rage that I've been feeling.",
      "created_utc": 1731128401.0,
      "score": 17
    },
    {
      "id": "lwces16",
      "body": "I still don't think she should have faced the death penalty. As a former escort it's really hard not to sympathise with her experience.",
      "created_utc": 1731202653.0,
      "score": 3
    },
    {
      "id": "lw61hvu",
      "body": "Deadass",
      "created_utc": 1731109540.0,
      "score": 7
    },
    {
      "id": "lw58qyh",
      "body": "Dead men don’t rape.",
      "created_utc": 1731100174.0,
      "score": 138
    },
    {
      "id": "lw93xhs",
      "body": "\" Your penis, my knife\"",
      "created_utc": 1731162658.0,
      "score": 5
    },
    {
      "id": "lw5wcd3",
      "body": "Be careful, don't sexualize rape - remember it's all about the violence ( dominating, subjugation, inflicting the most invasive pain and terror short of murder . )\n\n\nBut I certainly understand the temptation to use your retort!!!!",
      "created_utc": 1731107745.0,
      "score": 60
    },
    {
      "id": "lw53a8h",
      "body": "Yep. I'm a garbage human (in my mind) and I find this shit fucking disgusting.",
      "created_utc": 1731098526.0,
      "score": 54
    },
    {
      "id": "lw52lu2",
      "body": "> I’m lucky my conversations with my son and daughter about Andrew Tate consisted of “ew” and “he is awful”. \n\nI had to give the “this is why Andrew Tate is bad” a couple years ago to my then 11 year old son. Thankfully he seems to have listened, I don’t hear anything like that out of his mouth even to his friends (he plays games still under my supervision) and understands why the current president elect is, for lack of a better term, bad for America.",
      "created_utc": 1731098322.0,
      "score": 114
    },
    {
      "id": "lw5jg73",
      "body": ">kids don’t have the passwords to the devices.\n\nVery smart!",
      "created_utc": 1731103505.0,
      "score": 39
    },
    {
      "id": "lw8to5b",
      "body": "i mean, there wasn’t really consequences for it when i was a kid either. i get your point, but sexual harassment has a long history of being ignored. when i was a young child in the early late 2000’s, i was assaulted with multiple witnesses but no punishment because there were no adult witnesses. he would touch my breasts without consent, and even if a teacher saw it, at most he would get told off and often it was like they didn’t even register it was happening. so i stopped telling or calling it out, because no one seemed to actually care and that made me think that i was wrong for not accepting it or not being comfortable with it. sexual abuse involves so much shame and when you are so young, it is very easy to internalise it and believe that you shouldn’t be sharing these things. \nadmittedly i am not american, i’m northern european, but i doubt the culture of it is much different based on my insights.",
      "created_utc": 1731158533.0,
      "score": 3
    },
    {
      "id": "lw6inpz",
      "body": "Right now you are going thru a very bad cycle which strongly parallels what was happening in Europe in the 1930's and the unrest that you see today.  Most of those who were born in the 1920's and 1930's in Europe are either deceased or very old.  Many young people see this as ancient history even though the 1930's is less than a 100 years ago.",
      "created_utc": 1731115600.0,
      "score": 7
    },
    {
      "id": "lwa3oqj",
      "body": "This! Amendments need to be made, such as one can’t run for POTUS if they are a convicted felon and the POTUS is elected based on popular vote, not the electoral college. Hillary would have won if the results were based on popular vote.",
      "created_utc": 1731174589.0,
      "score": 6
    },
    {
      "id": "lw5fowd",
      "body": "I'm sure if you yank hard enough...",
      "created_utc": 1731102331.0,
      "score": 50
    },
    {
      "id": "lw6go9l",
      "body": "Blunt knife and a bit more effort would work too 😏",
      "created_utc": 1731114886.0,
      "score": 3
    },
    {
      "id": "lw9h6ti",
      "body": "Also a lot of people are outright lazy and would LOVE for someone to take care of them. Even if the price is losing their individual rights. Plenty of women constantly tell others there is nothing better than being a SAHM to 5 kids on welfare. Women hate women because they are lazy. Period. \n\nThey don't think far enough ahead to consider things like being abused, kids being abused, husband can't afford all the kids he wants, if he leaves you, you have absolutely nothing and zero skills or abilities to get work. If you can even get a job anymore. \n\nYou know what women like that did in the old days? They committed suicide. These women never consider it could happen to them.",
      "created_utc": 1731167312.0,
      "score": 4
    },
    {
      "id": "lw9igme",
      "body": "It's also why conservatives hate it.",
      "created_utc": 1731167736.0,
      "score": 15
    },
    {
      "id": "lw9kwa3",
      "body": "Yep. My kids have always known what everything is called and what touches are not okay.",
      "created_utc": 1731168540.0,
      "score": 6
    },
    {
      "id": "lw98uqf",
      "body": "it’s going to get worse in the UK. We had 14% reform voters. And men are getting worse",
      "created_utc": 1731164458.0,
      "score": 6
    },
    {
      "id": "lw8xnex",
      "body": "a lot better <3 it’s a battle but the first strike has to be education and awareness!",
      "created_utc": 1731160180.0,
      "score": 3
    },
    {
      "id": "lw7vg5d",
      "body": "all them Serena Joys 💀💀 perfect descriptor",
      "created_utc": 1731137975.0,
      "score": 7
    },
    {
      "id": "lw5nm56",
      "body": "I'd be fine with biting it off, myself.  Or biting his throat, ala The Walking Dead.",
      "created_utc": 1731104840.0,
      "score": 29
    },
    {
      "id": "lw57clt",
      "body": "Oh, guns are still legal for women to buy.",
      "created_utc": 1731099749.0,
      "score": 48
    },
    {
      "id": "lw6trwn",
      "body": "Exactly! That is my problem, and dismissing women, like usual, about their fears should NOT be the response. It doesn't matter if it's happening in this state or not, it shouldn't be happening anywhere and the women in those states are absolutely in danger. Their own fellow people are voting to keep things like this and /gloating/ about being allowed to get away with rape and forced pregnancy. How anyone can just say, \"don't worry about it\" to that hurts my soul.",
      "created_utc": 1731119698.0,
      "score": 13
    },
    {
      "id": "lw4t8ff",
      "body": "It used to be a swing state but the amount of red voters that have moved here during/since the pandemic has pretty much sealed it as red for the foreseeable future.",
      "created_utc": 1731095456.0,
      "score": 30
    },
    {
      "id": "lw6kjle",
      "body": "THE WAY I CHOKED LMAO",
      "created_utc": 1731116279.0,
      "score": 5
    },
    {
      "id": "lw64amh",
      "body": "OMG this gave me a desperately needed chuckle",
      "created_utc": 1731110523.0,
      "score": 3
    },
    {
      "id": "lw6b0w9",
      "body": "What a cruel culture! I hope that poor girl found a safe space later on.\n\nI bet people will be asking you why you don't attend school reunions.",
      "created_utc": 1731112884.0,
      "score": 5
    },
    {
      "id": "lw5o2ee",
      "body": "The principal told me his parents were appalled and very upset. I don’t think 1 day was enough myself. But, the principal believed he didn’t fully understand how what he was saying would be interpreted. She said she made it clear that comments like that would not be tolerated at the school and if anything like that were to happen again, the removal would be a permanent one. \n\nThe school resource officer also made a report (they are the police officer assigned to the school). The principal said that they would be following up with us.",
      "created_utc": 1731104986.0,
      "score": 615
    },
    {
      "id": "lw7lqvx",
      "body": "11 year olds should DEFINITELY know what that is. How do you expect them to know it’s wrong otherwise. Adults touch and rape children everyday. If they don’t know what it is they can’t speak up for themselves and get help. \n\nAnd yes he does need to be expelled.",
      "created_utc": 1731132148.0,
      "score": 5
    },
    {
      "id": "lw5po3a",
      "body": "That will absolutely be my next step. They are currently following an action plan and my daughter feels safe at school now. If that changes, I will be at the police station, calling the school board and doing whatever needs to be done to keep my daughter safe. I will not mess about when it comes to an issue like this. I do feel uncomfortable that the other moms of daughters don’t know what was said to my daughter. I hope that the school is being as firm as they are telling me they are. I only get so much information since it pertains to another student that is not my child.\n\nI dont know if buying her one of those alarms is going overboard. I didn’t think I would need to contemplate these things until she started dating.",
      "created_utc": 1731105506.0,
      "score": 180
    },
    {
      "id": "lw635bb",
      "body": "He has been warned not to have any contact with her. My daughter is very open with me, and I know she will tell me if she is feeling that way.",
      "created_utc": 1731110121.0,
      "score": 73
    },
    {
      "id": "lw6odej",
      "body": "That’s crazy… I agree- it’s not enough. I only know about it because he wasn’t in school. The principal won’t reveal punishments of a student to a non-parent/guardian- even if the punishment is due to something done to your child.",
      "created_utc": 1731117664.0,
      "score": 22
    },
    {
      "id": "lw88kns",
      "body": "To the kinds of people who prefer to have a rapist as president so they don't have a woman in charge, property damage is seen as much more serious than any kind of threat to a \"mere female\".",
      "created_utc": 1731146711.0,
      "score": 2
    },
    {
      "id": "lw8rru9",
      "body": "i used to get sexually harassed and assaulted at school, the closest to a punishment anyone ever got was a meeting, telling parents and/or requiring an apology. not even a suspension when a guy choked me with a room full of witnesses💀 unfortunately it’s not surprising",
      "created_utc": 1731157705.0,
      "score": 3
    },
    {
      "id": "lw7xpbs",
      "body": "Absolutely. That boy needs to be expelled.",
      "created_utc": 1731139423.0,
      "score": 2
    },
    {
      "id": "lw8y11p",
      "body": "I know, and it’s terrifying. I did not vote for him either time and I don’t know if I can keep living in the US after this. It’s so scary to be raising kids here. \n\nHow can we teach our children that it’s important to be honest, when the biggest liar, rapist and felon was elected to the highest office???",
      "created_utc": 1731160335.0,
      "score": 2
    },
    {
      "id": "lw99nfp",
      "body": "Someone else mentioned it and I am going to enroll both my kids: my daughter and her twin brother. I think I am going to take it too because I haven’t had a self- defense class since high school. great idea!",
      "created_utc": 1731164741.0,
      "score": 2
    },
    {
      "id": "lwa78ih",
      "body": "That is still something we are considering. My only issue is not wanting my daughter to be made uncomfortable. She has anxiety and what used to be called Asperger’s. Attention can be very overwhelming for her. I just want to do the right thing for her. \n\n I have not ruled anything out at this time, but I want to be sure to think it through and not make an emotional decision that could hurt her. I would be giving the same advice as you are though. The squeaky wheel does indeed get the oil, and I have no problem getting loud and making it uncomfortable for people who excuse this type of thing. It’s inexcusable.",
      "created_utc": 1731175711.0,
      "score": 2
    },
    {
      "id": "lwb6cnk",
      "body": "They told me to take this med to help dilate a little and be sure to take Tylenol and it wouldn’t hurt that much. A complete and utter lie. It was SO painful. I cried the entire drive home and hours into the evening. They didn’t even tell me not to drive myself back home because I would be in pain and that was very dangerous too. If anyone asks me about it I ask them what their doctor told them and offer the truth. Two people have thanked me for the warning because it was way worse than the doctors description.",
      "created_utc": 1731187101.0,
      "score": 4
    },
    {
      "id": "lwb5ipz",
      "body": "i’ve been getting biopsies for 3 years in a row, my last biopsy had me scream out in pain and almost pass out for the first time in my 26 years of life because my gyno had to do a deep one. the normal ones were something i could forcefully dissociate through but that last one had me seeing stars and feeling dizzy and shaky. my dr was dabbing my face and neck with a damp rag while i just laid there bc we both thought i was gonna pass out. when i had my consult for my leep surgery (which will be done on 12/16) i was fully expecting to be awake but thankfully she told me i would be put under anesthesia bc i was going to tell her if there wasn’t local at the least i would be refusing. my heart goes out to everyone who has procedures done raw dogged on their cervix bc it really is very intense pain",
      "created_utc": 1731186825.0,
      "score": 3
    },
    {
      "id": "lwbgbb0",
      "body": "i would have killed to have any sort of sedation for my biopsies",
      "created_utc": 1731190396.0,
      "score": 2
    },
    {
      "id": "lw91prk",
      "body": "Yes. We're living in 1860 while the rest of the world is living in 2024.",
      "created_utc": 1731161803.0,
      "score": 8
    },
    {
      "id": "lw64jf8",
      "body": "I think I would laugh and tell them how much a paternity suit might cost",
      "created_utc": 1731110609.0,
      "score": 3
    },
    {
      "id": "lwazwu0",
      "body": "I mean what else should I do at that point, sodomize him with a broomstick?",
      "created_utc": 1731184983.0,
      "score": 2
    },
    {
      "id": "lw7n8lx",
      "body": "Love it. Never heard it before, thanks for the rec.",
      "created_utc": 1731132990.0,
      "score": 5
    },
    {
      "id": "lwdzto5",
      "body": "Honestly, I agree. She never had a chance really, with her early childhood/early adulthood. If she got life in prison, she could have done something. Learned stuff, got a degree, made friends, stayed connected with her family that adopted her.",
      "created_utc": 1731230836.0,
      "score": 2
    },
    {
      "id": "lw9funv",
      "body": "I agree with you on the point of sexual harassment and I'm sorry that you had to go thru what you went thru.  I was a baby boomer so it was very common for classmates to have several siblings close in age, so many had brothers who were either a little bit older or a little bit younger who went to the same school.  Often they hung out with their sibling at school.  These classmates were rarely if ever sexually harassed as their brother or brothers wouldn't hesitate to throw a punch if their sister was verbally harassed. Usually they didn't at school but the threat of this happening after school or off school grounds was there.   Some classmate who took this further like touching was at high risk of getting beaten up by the male family members of that classmates. This most likely curbed some of the bad behavior towards some girls and women but not all of it of course. \n\nI grew up in the South and it wasn't uncommon for a family member to confront someone who was harassing or being very  disrespectful towards their wife, sister, mother or even cousin. Sometimes these confrontations would turn violent.  The police didn't get involved because during that time period (1970's), this would have been considered to be a family dispute settled among the parties.  Now people would be arrested for this.  \n\nMy older brother and I never attended middle or high school at the same time.  When I was entering middle school, he was entering high school.  I had sexual harassment directed at me but one time I fought back.  Normally I would not but I guess the years of having to deal with unwanted comments (mostly it was comments and a few times I was touched) and harassment made me quite angry.  I screamed at the former classmate  (who had no reason to be at the middle school as he was in high school) who touched me  and then punched him several times in the arm.  He was quite shocked of my reaction. I had never been so angry in my life.  \n\nThe baton teacher came out, told him to leave me alone and then told me that I needed to calm down because me yelling and screaming was disturbing her class.  No concern about me being touched inappropriately.  It was almost like I had overreacted to the situation.  I do know that if my brother was there or attending the same school, that probably never would have happened.   I will say after this incident I never was touched inappropriately again in school.\n\nI by no means advocate or support violence.",
      "created_utc": 1731166866.0,
      "score": 2
    },
    {
      "id": "lw7nm6c",
      "body": "It’s really depressing how many people think 100 years is ancient history. Things that happen in the past are always relevant. I’m quite lucky to have been partly raised by someone born in 1930s Europe so I heard a lot of horror stories growing up which helped shape my worldview and understanding of history. Those who do not learn about history are doomed to repeat it and it’s sad seeing how that saying gets proven right over and over again",
      "created_utc": 1731133207.0,
      "score": 5
    },
    {
      "id": "lw5o9q6",
      "body": "True. But a gunshot to the penis would incapacitate and emasculate your rapist while giving you time to call 911 and run ❤️",
      "created_utc": 1731105051.0,
      "score": 44
    },
    {
      "id": "lwbzbcw",
      "body": "Just finished the first season of Lioness.   They had a pretty good of dealing with a rapist.",
      "created_utc": 1731197069.0,
      "score": 2
    },
    {
      "id": "lw57nzh",
      "body": "Time to get familiar with them if you are serious about personal protection. Hope you’re in a stand your ground state.",
      "created_utc": 1731099845.0,
      "score": 14
    },
    {
      "id": "lw60jyu",
      "body": "At least the parents were appalled. Hopefully they have a long talk with him and give him serious consequences at home. If he really doesn’t understand what he’s saying, he needs to be told in detail what that means and how it’s harmful.",
      "created_utc": 1731109208.0,
      "score": 379
    },
    {
      "id": "lw8v6m9",
      "body": "You have a police officer assigned to your school‽\n\nWe got a visit once a year for them to give a presentation about crossing the road safely.",
      "created_utc": 1731159170.0,
      "score": 2
    },
    {
      "id": "lw9umm4",
      "body": "he didn't fully understand how it would be interpreted? How many ways could that be interpreted?",
      "created_utc": 1731171686.0,
      "score": 2
    },
    {
      "id": "lwaad1b",
      "body": "Good. These impressionable youth are being corrupted by lies and propaganda. It is heartbreaking",
      "created_utc": 1731176711.0,
      "score": 2
    },
    {
      "id": "lwbvx0i",
      "body": "I had a friend get expelled over having a paint ball gun in his car. \n\nI had a friend get expelled for doing an assignment about writing about one of your dreams & his (religious) school thought it was inappropriate, he got expelled.\n\nAnother friend, he wouldn’t cut off his dreadlocks (he is half Japanese), so they expelled him. \n\nI can’t think of any others I know that got expelled. They most likely dropped out before it got to that point but HS was like 20 years ago & was not a peak time of my life (:",
      "created_utc": 1731195871.0,
      "score": 2
    },
    {
      "id": "lwf16ep",
      "body": "Throwing him in Juvie might clear that up for him. He knows. They all know. At every age and stage. Take it for exactly what it is because if he carries through they'll say \"WhY dIdNt YoU rEpOrT it sOnErrr??!?\"",
      "created_utc": 1731250231.0,
      "score": 2
    },
    {
      "id": "lw5uvid",
      "body": "Buying her an alarm is not at all going overboard. I’d personally put her in a self defense class as well if I were you.",
      "created_utc": 1731107242.0,
      "score": 151
    },
    {
      "id": "lw6gv43",
      "body": "It's really sad that your daughter and other girls and teens have to go thru this.  A lot of this has to do with poor parenting and not teaching respect towards everyone.",
      "created_utc": 1731114954.0,
      "score": 46
    },
    {
      "id": "lw7hj89",
      "body": "Get the alarm and what ever else she needs to be safe. There is no such thing as going too far.",
      "created_utc": 1731129900.0,
      "score": 4
    },
    {
      "id": "lw68qo6",
      "body": "Watch her grades. Teenagers don't talk to parents. I was one once.",
      "created_utc": 1731112081.0,
      "score": 49
    },
    {
      "id": "lw6p1pt",
      "body": "Hopefully there was at least some other form of punishment like community service, extra homework, ect...",
      "created_utc": 1731117918.0,
      "score": 3
    },
    {
      "id": "lwjv9lh",
      "body": "Women’s treatment in medicine is designed for trauma. If these things were being done to men they would be appropriately medicated.",
      "created_utc": 1731312818.0,
      "score": 2
    },
    {
      "id": "lw91s7e",
      "body": "Well that's bad",
      "created_utc": 1731161831.0,
      "score": 5
    },
    {
      "id": "lw8qwh2",
      "body": "Anytime! And if you've been in the band scene for awhile and have been repeatedly let down by bands, there's 18+ by Scene Queen. We love female rage.\n\nEdit: Scene Queen has a lot, Pink Rover is another that sticks out.",
      "created_utc": 1731157313.0,
      "score": 2
    },
    {
      "id": "lw9l9ce",
      "body": "honestly, it was definitely not the norm to not have a sibling around! i was just unlucky in that i am the unexpected baby of the family! my sister is six years older, my brother ten. that, combined with the very unusual circumstance i ended up having of our school being rural and with low funding, so they slowly cut down grades and my sister had to transfer schools. my brother was also very close with my attacker’s(? i can’t think of the right word) older brother, and my sister was friends with his older sister. my case also included a lot of manipulation and love bombing, it was a rare case! i definitely have experienced the social effect of having siblings in your school! many of my friends had older and younger siblings in school and it was kind of just a hard, but mostly unspoken rule that you don’t mess with them. i was very unlucky, and it is not that you are incorrect at all! it’s just unfortunate that the threat of violence from an older peer is the only real concern and threat to a lot of them. like we have known and talked about for ages that schools aren’t strict enough on the right things, and it baffles me a little that i’m still hearing about the same issues that i had, that i know that people before me had too. schools are generally way too lenient on bullying or harassment, so it’s not surprising that they are on sexual harassment too, but it is surprising that it hasn’t changed despite decades of campaigns and events and whatever. like at some point the adults have some responsibility. it shouldn’t be such an issue that the adults, that teach our children and spend more time with them than we do, care about them. \n\nsorry, i ended up rambling a lot! i’m having a rest day and the spliff hit a little hard.",
      "created_utc": 1731168661.0,
      "score": 2
    },
    {
      "id": "lw8mwxs",
      "body": "My mother was born in 1930, six months after the Stock Market Crash in 1929.  Although she was born in the US, what was going on in Europe during that the 1930's later impacted everyone who lived in the US (World War II). This of course shaped her life, her viewpoint of the world.  If she were alive today, she would just be very sad at what you are seeing today.  \n\nI remember when my mother in 1974 got her own credit card. Prior to this, she could only get credit thru my dad or some male relative (her dad, my grandfather, uncle, her brother) had to sign for her after she and my dad split up.  She kept looking at the card, almost in disbelief that this was actually hers and joy at the same time.  She was 44 years old at the time. That was something she never took for granted as she said, \"Uncle Sam giveth, but he can also take it away at any time.\"",
      "created_utc": 1731155410.0,
      "score": 5
    },
    {
      "id": "lw5zuva",
      "body": "I used to get descriptive about the way they used to castrate male dogs by wrapping a rubber band over and over tightly around them u till eventually it got so tight they turned black and fell off… I said it calmly, matter of factly, and with a big grin and it scared most men from putting a hand on me that wasn’t approved by myself.",
      "created_utc": 1731108964.0,
      "score": 21
    },
    {
      "id": "lw6688k",
      "body": "I’m going to start going to a gun range to practice and get comfortable handling and shooting. I’ve only ever shot at circle targets but looking forward to getting full body ones and aiming for the crotch",
      "created_utc": 1731111202.0,
      "score": 6
    },
    {
      "id": "lw59fo5",
      "body": "“I’d rather be tried by 12, than carried by 6.”",
      "created_utc": 1731100383.0,
      "score": 39
    },
    {
      "id": "lw62cn6",
      "body": "At school: I'm appalled!\n\nAt home: fuck that little libatrad",
      "created_utc": 1731109842.0,
      "score": 387
    },
    {
      "id": "lw7xa03",
      "body": "He learned it from somewhere, first thought would be from home, js.",
      "created_utc": 1731139149.0,
      "score": 4
    },
    {
      "id": "lw9uwf9",
      "body": "I guess he didn’t realize that she would interpret that comment as a threat to rape her. I don’t know how else it would be interpreted?",
      "created_utc": 1731171774.0,
      "score": 2
    },
    {
      "id": "lwhn6mb",
      "body": "I agree with you. I think it’s naive to claim they don’t know. I think they know exactly what they are saying and what it means.",
      "created_utc": 1731279207.0,
      "score": 2
    },
    {
      "id": "lw5v4y2",
      "body": "That’s actually a great idea. I’ve been so shocked by everything this week that my brain is taking a break. I will see if I can find a local class!",
      "created_utc": 1731107330.0,
      "score": 92
    },
    {
      "id": "lw8kl20",
      "body": "I was about to say this. These boys that are saying these disgusting things are being learned somewhere, but they need to learn that someone won't take kindly to their threats. Learning any self defense and how to be safe is never wasted to learn.",
      "created_utc": 1731154214.0,
      "score": 3
    },
    {
      "id": "lw6i2l5",
      "body": "I agree. I make a point to talk about these things with the kids. I even explained consent with friends and making sure they want a hug when they were young. It’s important to have these conversations, even if they lead to bigger questions.",
      "created_utc": 1731115390.0,
      "score": 17
    },
    {
      "id": "lw698lu",
      "body": "I was one too- she’s still 11 and tells me everything. I am keeping a close eye on everything. Her grades are very good and we work on her homework together every night. I’m sure she won’t be as forthcoming in a few years like most teens.",
      "created_utc": 1731112254.0,
      "score": 46
    },
    {
      "id": "lw6779n",
      "body": "As long as you DONT have children—— \n\nI keep my gun with the safety off and one in the chamber at all times because in the case I actually need to use it to defend my life, I wouldn’t remember to take the safety off or cock the gun to load the bullet and those few seconds can mean the difference  between life and death. \n\nIf I had kids, Id lock my shit up but I’d also probably keep the safety on without one in the chamber because…kids are sneaky lol\n\nMy recommendation is definitely spend some time at the range. You will learn how to handle and shoot your firearm. Range instructors are always there to help.",
      "created_utc": 1731111544.0,
      "score": 6
    },
    {
      "id": "lw7k8pa",
      "body": "Amen to that",
      "created_utc": 1731131318.0,
      "score": 3
    },
    {
      "id": "lw69v3o",
      "body": "I am hopeful that they understood the gravity of what their son said… but I’m also skeptical like you. Kids learn this type of shit from somewhere, and maybe the kids parents weren’t the source. However, are they going to actually try and figure it out? Check what the kid is doing online? Internet safety isn’t a priority in a lot of homes, but… it should be.",
      "created_utc": 1731112474.0,
      "score": 178
    },
    {
      "id": "lw6jmxm",
      "body": "I'm not sure if this is comforting or not, but many of these people don't seem to have much shame at this point. So if they were thinking the latter, they'd probably have said it and laughed.",
      "created_utc": 1731115952.0,
      "score": 4
    },
    {
      "id": "lw8rdgz",
      "body": "That’s most likely, but he might have picked it up on YouTube and the parents didn’t know. I have a 9 year old son and I’ve seen some unpleasant  stuff pop up in his feed. If you allow YouTube at all, you’ve got to watch with them or regularly go check out what they’ve been watching. I don’t think everyone yet understands how this type of content is sneaky - it can be subtle and the kids don’t understand how bad it is.\n\nEdit to add an example I thought of that might be helpful to other parents. A video came on about the history of inventions/technological advancements. Non offensive and educational, sounds good. Then the content creator starting talking about how everything was created by men, while women sat around and did nothing to help. I had to stop it right there and explain that women were denied education and jobs, so there was no way for them to be out there inventing because men didn’t allow it. I think that’s how this has gotten so out of hand - things seems perfectly reasonable and true, but it’s missing important context and slighting women without outright saying it. That draws people in and skews their thinking and people don’t even realize they are being influenced, especially children.",
      "created_utc": 1731157525.0,
      "score": 6
    },
    {
      "id": "lw8kc7z",
      "body": "It might be something you can both do together :)",
      "created_utc": 1731154083.0,
      "score": 8
    },
    {
      "id": "lw8rc1w",
      "body": "i was 7 or 8 when i started getting harassed and assaulted, and i mostly just didn’t know how to talk about it(and didn’t until i was maybe 16 or 17? maybe older). this isn’t to say that she won’t talk to you, just a warning that sometimes the age isn’t the part that makes it difficult to talk about. you are doing everything you can and everything right !!! thank you for protecting your daughter, i was her at one time and it really is important.",
      "created_utc": 1731157507.0,
      "score": 7
    },
    {
      "id": "lw6zsli",
      "body": "100% no kids with me!",
      "created_utc": 1731121993.0,
      "score": 3
    },
    {
      "id": "lw73ljz",
      "body": "I am so glad I never wanted kids. I can’t imagine wanting to be a mom or dad in this world. It should be a beautiful thing; modern medicine, technology, knowledge ever expanding, understanding more about sciences. But it’s not, it just seems scary, unstable and difficult. Like you have to breath down your kids necks so they don’t become a Tate worshipper",
      "created_utc": 1731123545.0,
      "score": 93
    },
    {
      "id": "lw6zun2",
      "body": "If it's not the parents, that kid is absolutely watching some questionable streamers.",
      "created_utc": 1731122015.0,
      "score": 54
    },
    {
      "id": "lw8gvtm",
      "body": "A lot of it is YouTube. My kid said something totally out of pocket and against our values when she was 10 and when I checked her YT history, there it was. YT was banned until this year at 13. She's matured and knows if we see anything untoward, it's banned again. Kids are impressionable sponges and can sometimes run across content that runs counter to what their parents have taught them.",
      "created_utc": 1731152106.0,
      "score": 9
    },
    {
      "id": "lw9ffim",
      "body": "That is a damn good point 👉.",
      "created_utc": 1731166724.0,
      "score": 2
    },
    {
      "id": "lw8v34t",
      "body": "I am so sorry that happened to you- It can be very difficult to talk about it. I wish this world was not so horrible and kids got to be innocent and ignorant of this type of thing. But, I think not talking to kids about abuse and assault can make if easier for them to become victims of it themselves. I hope you are doing well now and know that nothing that happened to you was your fault. Sending you a hug.",
      "created_utc": 1731159131.0,
      "score": 5
    },
    {
      "id": "lw8h597",
      "body": "My 18 yo nephew became a Tate devotee. I am appalled. I love him and try to be patient with him but I have told him to leave my home when he spouts some of the more hateful stuff. I feel like I'm doing more to protect my kid at 13 than I had to at 2. It's truly exhausting making sure their mental health is sound, keeping them off social media, monitoring who they hang out with, all the while making sure you don't helicopter parent and hamper their development. Whew. I'm going back to bed lol.",
      "created_utc": 1731152265.0,
      "score": 43
    },
    {
      "id": "lw8u8ja",
      "body": "Same. I don’t know how many times I had that thought Wednesday morning. But, I also cried thinking of my niece and now I’m wondering what she is hearing at school…",
      "created_utc": 1731158774.0,
      "score": 6
    },
    {
      "id": "lw9allh",
      "body": "It is difficult. I really monitor what my daughter sees. There are limits to apps, she has to ask permission for pretty much everything, and YouTube is out of the question. She is not able to use safari to search for things, and if she does, she has to do it in the living room. She’s 8 and I don’t believe she’d search for anything inappropriate, but in the off chance that the search results are inappropriate, I’m there to either stop it or answer questions and we can process whatever she potentially sees. And at some point, I’ll have to ease up on things and hope that she’s able to see what is/isn’t appropriate. \n\nThe hard part then is what other homes allow! Like, what movies do they allow their kids to watch, or are they allowed to be on their computer/tablets with zero restrictions or supervision? And if my kid goes over there, what will she be exposed to? \n\nAnd don’t even get me started with TikTok, facebook, instagram, Snapchat and all that other shit. Parents must be responsible when they allow their children to open their world like that. Not only because of the content, but the potential for them to be exploited by predators. 😩 what a time to be alive.",
      "created_utc": 1731165076.0,
      "score": 3
    },
    {
      "id": "lwbn4tc",
      "body": "I’ll tell you, it is scary now, especially as the mom of neurodivergent, trans kids. I’m actually looking into taking my family away from here, like becoming an expat. That’s how scared I am for my kids.",
      "created_utc": 1731192744.0,
      "score": 3
    },
    {
      "id": "lw8i8x5",
      "body": "Or it’s his shitty little friends at school. This is the age where kids start to really lean into mob mentality and parents get blindsided when little Johnny starts calling them “libt*rds,” etc.",
      "created_utc": 1731152917.0,
      "score": 25
    },
    {
      "id": "lw7hvbz",
      "body": "I think that's likely. There's so much content out there aimed at kids his age that's meant to radicalize them. I grew up in the wild unregulated days of the early internet and I still think that was safer than current day because there was no absolute firehose of disinfo aimed straight at our little brains. I have no idea how parents, even if they're media-literate and internet savvy, can hope to keep their kids insulated from all of it.",
      "created_utc": 1731130068.0,
      "score": 15
    },
    {
      "id": "lw8vxds",
      "body": "thank you endlessly. truly. it took a long time for me to untangle it so i could even understand what happened. i do think being as open and honest with your child about these things is so incredibly helpful, sometimes they don’t even know that someone hurt them, sometimes they blame themselves so much that they are scared they will get in trouble, etc. talking about these things, as hard and uncomfortable as it is, really does armour them better for the risks of the world. you seem like an amazing parent and your kid is both lucky and deserving to have that. \n\ndoing a lot better and working on getting therapy for the trauma! i’ve never really talked about it in therapy, it’s taken a long time to be able to articulate myself about it and understand, but i hope that now that i can, i can start healing <3",
      "created_utc": 1731159476.0,
      "score": 4
    }
  ]
}