{
  "id": "1g4k5vu",
  "title": "I can't forgive my husband for what he did when our son died",
  "selftext": "I (41f) have been married 21 years to my husband (m41) we have several children.one of them was special needs. He was born with a genetic mutation that neither of us carry, it was random chance. He was sick most of his life and I was his primary care giver. He needed nursing home level care, I had a nurse that came to help me a few days a week. My husband--his father-- did not help much at all no matter how much I asked for his help. He was always \"to busy\" or \" to tired\" and complained of back pain. Our son lived 15 years. I carried him, took care of all his needs, did his meds his tube feeding stayed up with him at night ect. I had to take up body building to be strong enough to transfer him to and from his wheelchair or bed or couch or anything because my husband would not help. I suffered back injuries and even had to crawl on the floor at times to meet my son's needs. He still didn't help. He might change a diaper now and then and want a prize for doing so. \nI couldn't divorce him because I could not have a job while also caring for our son. His needs got greater and greater as he got older, by the time he died he was on 6 seizure meds and had several machines he had to use for part of each day. Still, he was a happy joyful child that loved life and was a joy to be around. He was always laughing and playing and very loved by me and his siblings. \nWhen he died we knew it was coming. I was in the hospital with him and he died in my arms, peacefully and not in pain. \nIt was the worst moment of my life \nAn hour after he died my husband started going on about how he wanted to spend my son's life insurance money on an expensive fourwheeler. He decided that because the policy was thru his work and under his name that the money belonged to him. I hated this idea and wanted to put the money towards our house. He spent it. All of it. \nHe knew I didn't want that, and he told everyone that I was \"on hard with it\" and then acted shocked when I screamed and yelled at him for spending the money. He told his family that I \"didn't tell him\" till after, but at this point even his family sees how awful he acted.\nHe never helped take care of our son and then blew all the life insurance money. To make matters worse he tricked one of our adult sons into paying for the cremation (I paid him back immediately when I found out) \nI can't forgive this man. \nI am so angry beyond words.\nI am also financially trapped as I have no work history for the last 21 years. \nI hate this. \n\n\n\n\n**Update***\nThank you all for your kind words. \nSince this post I have been working my tail off. My adult son got me a job working as a baker in the restaurant he worked in. It was only weekends but I quickly learned the job and excelled at it gaining confidence in myself and making friends.\nThen last week I got laid off. The weather hasn't been good and the restaurant hasn't had enough business to keep me employed \nI was scared that I wouldn't find anything but due to a strange set of circumstances ended up reaching out to my son's former caseworker and she recommended that I apply for two positions one as a caregiver and another as a special needs job advocate. \nI wasn't sure how it would go seeings as how all my bills were unpaid work I didn't think employers would take a look at me, but both interviews went really well. All my experience taking care of my son was praised and very relevant for the jobs. I'm now waiting for a call back after background checks are complete but it sounds like I have a really good chance at getting both of these jobs. They are both part time and flexible enough that I can be at home with my children during most of the day so I can continue homeschooling and doing all the things.\n\nAs far as my marriage....thats up in the air. Not much has changed there. Sometimes he seems like he's trying to be a better partner but his efforts are so small at this point it doesn't feel like enough. \n\nStill, I'm moving forward in every way that I can to carve out a new life for myself. Thank you so much for everyone that told me to write out a resume detailing my skills as a mother, homemaker, home cook and caregiver. It's been life changing.",
  "created_utc": 1729030985.0,
  "score": 5229,
  "num_comments": 301,
  "url": "https://www.reddit.com/r/offmychest/comments/1g4k5vu/i_cant_forgive_my_husband_for_what_he_did_when/",
  "comments": [
    {
      "id": "ls43tpq",
      "body": "You are entitled to spousel maintenance after divorce, you may not have any official work history, but you worked as a non-paid personal caregiver for all those years, that's work experience. \nI get that it feels like you are trapped, but you really aren't. Please talk with a divorce lawyer, you are strong and resilient, you will thrive when you leave him!",
      "created_utc": 1729032018.0,
      "score": 5936
    },
    {
      "id": "ls44lrt",
      "body": "I am so sorry for your loss. ",
      "created_utc": 1729032308.0,
      "score": 464
    },
    {
      "id": "ls448dl",
      "body": "Lawyer, divorce, half of everything",
      "created_utc": 1729032170.0,
      "score": 728
    },
    {
      "id": "ls42s0w",
      "body": "Tbh if I were in your position I would divorce him and move in with a close relative or trusted friend and claim money from the government until you can get a real job but it's not like I know much about this stuff. There's probably some way this wouldn't work but yk just an idea",
      "created_utc": 1729031628.0,
      "score": 1189
    },
    {
      "id": "ls4j1f8",
      "body": "You’re 41, your life isn’t over. I’m 43 and just finishing up nursing school. Sounds like you would make a fantastic nurse to me. Because I’m a divorced single mother I qualified for Pell Grants, Medicaid, and SNAP to get through school. You are not stuck with this useless, heartless man.",
      "created_utc": 1729037733.0,
      "score": 428
    },
    {
      "id": "ls4c09o",
      "body": "Now that your son has passed it is time to leave the deadbeat. You suffered so much already and he shared none of the burden.",
      "created_utc": 1729035080.0,
      "score": 142
    },
    {
      "id": "ls48wia",
      "body": "I am so sorry you lost your son.  Your story had me in tears.  I hope you can get away from him.  Whats the point of having a husband that acts like him?  I wish you the best.",
      "created_utc": 1729033908.0,
      "score": 241
    },
    {
      "id": "ls46uru",
      "body": "Go see a divorce lawyer.",
      "created_utc": 1729033141.0,
      "score": 64
    },
    {
      "id": "ls4ac9r",
      "body": "Divorce him, take the kids, half of everything and get child support (if there are any minor children remaining) and alimony. Fuck that guy.",
      "created_utc": 1729034446.0,
      "score": 53
    },
    {
      "id": "ls4hlaf",
      "body": "I hope you don’t ever expect him to care for you if you get deathly sick. Because he won’t. Remember that.",
      "created_utc": 1729037188.0,
      "score": 46
    },
    {
      "id": "ls4lm8r",
      "body": "(42 m) On behalf of my beautiful son who's autistic and struggled with sickness most of his life, Thank you. Thank you. You are beautiful and your son loved you. I hope you find peace and that your life is full. You will find a way. I'm in a pretty hopeless situation myself, but I have hope. You gave your son hope. You gave him so much. I'm just moved and I don't know what to say but I need to say something.",
      "created_utc": 1729038679.0,
      "score": 50
    },
    {
      "id": "ls4fbly",
      "body": "Yeah time to end this marriage. Hire a shark of a lawyer. Go for the throat.",
      "created_utc": 1729036339.0,
      "score": 39
    },
    {
      "id": "ls45lfv",
      "body": "Divorce. Now.",
      "created_utc": 1729032673.0,
      "score": 125
    },
    {
      "id": "ls49nlk",
      "body": "Are you in the US? Look into state government caregiving programs. My sister started doing this while taking care of our mom who has dementia. Mom was approved for a certain number of hours per month to have care services, which my sister was paid for. Now that our mom is in a facility, my sister does caregiving shifts for other special needs people as her job. You sound more than qualified.",
      "created_utc": 1729034190.0,
      "score": 33
    },
    {
      "id": "ls4brr5",
      "body": "Location is important to give advice in this situation. If in the US you will get spousal support in a divorce. Also, half his 401k and pension if he has one. Start preparing but don't tell him or anyone else anything until you are ready to serve him with papers. Contact a lawyer for a free consultation. Start gathering all financial information and keep in a place that only you have access too. If you have other underage children you will get child support and he will have to move out. You are strong! You have proven it! Take him to the cleaners. And please update us!",
      "created_utc": 1729034990.0,
      "score": 34
    },
    {
      "id": "ls47jlc",
      "body": "You are not trapped. You can get out of this you just have to work a bit harder to get there. Get out and try find a job, dont apply online, go out and walk into places. Let them know your history, you actually have a great work history because you spent 15 years looking after your son. All of that counts..and the right job will take you on.\nBut you need to actually go to these places so they can understand why you have been out if work cause it wont look good on paper.\n\nYou want out, your husband was not there when you needed him and you deserve to have the freedom from him. You can get this. One step at a time.\nI believe in you, you are such a strong person for all you did for your son, you are so awesome. Im so sorry for your loss. Remember him and use his strength to keep you going, he will be rooting for you too.\nGood luck.",
      "created_utc": 1729033396.0,
      "score": 126
    },
    {
      "id": "ls48quf",
      "body": "I’m so sorry to hear about your dear son’s passing.You certainly provided a wonderful life for him. It’s time for you to recover and believe you’d be better off doing so on your own. You will continue to resent your husband for his lack of compassion, love, support and rightfully so. You were consumed with caring for your son but now clearly see how little your husband contributed. Don’t lose another moment, find a relative to two you in and take time to heal and figure out what you want your tomorrows to look like. Good luck mama, you’ve got this!",
      "created_utc": 1729033848.0,
      "score": 20
    },
    {
      "id": "ls4gpv1",
      "body": "Please don’t assume you are trapped. Talk to a lawyer. I would bet a lot of money that you’d get a good amount of alimony and likely the house. Your husband can live in his 4 wheeler.\n\nWhat a selfish dbag he is.\n\nI am so sorry for the loss of your son.",
      "created_utc": 1729036860.0,
      "score": 18
    },
    {
      "id": "ls4lz3j",
      "body": "Listen, as a mom of a severely special needs kid, you’re the first person I would hire to take care of my son. You’re more than qualified. There are many out there who would pay a good buck for your kind of care and your work history. We need people like you. If you’re not ready, just dump that sorry ass of a man. You’ll lose the dead weight and at least be happier without him.",
      "created_utc": 1729038811.0,
      "score": 16
    },
    {
      "id": "ls4byk9",
      "body": "You are an incredibly strong human being. I’m so sorry for your loss. Your son seems like he was a joyful, loving soul and he was so lucky to have chosen you to be his mother. I’m sure he is looking down on you with love, gratitude and immense joy. \n\nYou are not trapped. You deserve happiness. You deserve freedom. You deserve respect. You deserve appreciation. Leave this man, get spousal support, and apply to be a home aid. You have the most relevant work experience you possibly could. There is a light. There is hope. \n\nPlease please please for the sake of your life and lives of your other children, show them that mutual respect and love is paramount in a healthy marriage.",
      "created_utc": 1729035062.0,
      "score": 16
    },
    {
      "id": "ls46ic5",
      "body": "His time will come. I don’t have any advice other than that I would be just as pissed if I was you. I understand the hesitation towards divorce because alot goes into it after that many years. If you have support and the means then yes. Otherwise try to put together a plan to eventually be able to divorce him. You’ll never see him the same and you’ll live a life of being resentful and bitter.",
      "created_utc": 1729033013.0,
      "score": 33
    },
    {
      "id": "ls4plk3",
      "body": "I understand that you feel trapped as you've been out of the official work force for 21 years. I was a SAHM for 30 years while my husband worked internationally. I was alone with the kids the majority of the time, we have no family nearby and I had to do everything - looking after the house, the car and the kids, by myself.  \n     \nWhen it came time to go back into paid work I had been out of the work force for so long I thought that I had nothing to offer. I wrote down all of the things I'd done over those years and came up with a pretty impressive skill set after all, and ended up getting hired as the Personal Assistant to a Financial Advisor.  \n  \nA quick google gives a run down of some of the skills that you may be able to use to build an impressive resume. *Skills management* - the practice of understanding, developing and deploying people and their skills; *Financial management* -  budgeting; *Motivational skills* - encouraging members to boost productivity and achieve successful results; *Time management* - successfully organizing and planning daily, weekly and monthly schedules for multiple people; *Problem solving* - achieving goals by overcoming obstacles; *Communication skills* - advocating with doctors, teachers and coaches; *Decision-making* - ability to work under stress and pressure. And with your extensive experience as a personal care-giver I'll bet you have way more options than you think you have.\n   \nYou've got this. *good luck!*",
      "created_utc": 1729040154.0,
      "score": 10
    },
    {
      "id": "ls5uj9a",
      "body": "You do have work history - that is looking after a severely disabled child with love and care. I know it’s not much but you could get a job in the care industry as a carer. You won’t have to do the heavy lifting. \n\nI’m sorry your husband is a an insensitive arse who couldn’t understand or accept his disabled son.",
      "created_utc": 1729058966.0,
      "score": 10
    },
    {
      "id": "ls4bg5v",
      "body": "you need to act, even if it’s slow action, but you need to act. if you can’t up and leave right now (and that’s completely understandable), start developing your skills and applying to jobs. do whatever you can in your power to become financially independent (take baby steps, you’ve been through a lot) and then eventually when you’re in a position to leave him, it goes without saying: LEAVE HIM. this is not sustainable. he’s clearly a piece of shit and this isn’t good for you and your kids in the long run. i know this may seem difficult right now; relationships often leave us feeling stuck, like we’re in quicksand, like there’s no option but to stay. but trust me, i promise, there is another option: leaving. and you CAN and WILL do it. for yourself and your family. sending love and power.",
      "created_utc": 1729034869.0,
      "score": 9
    },
    {
      "id": "ls4boey",
      "body": "I just want to validate something for you, you have extensive work history. You have been a caretaker, a skilled one. The level of dedication it took to care for your son is extremely impressive. I think the right job would see these qualities in you. But I do think you deserve a break before jumping into a new job. Like some others here have said, you should try to move in with a relative and collect whatever money from the state and your ex that you can take. You deserve it all.",
      "created_utc": 1729034955.0,
      "score": 17
    },
    {
      "id": "ls47apj",
      "body": "I’d divorce him and take half of everything",
      "created_utc": 1729033304.0,
      "score": 16
    },
    {
      "id": "lu0yk4i",
      "body": "Update: today is my birthday. I decided to apply for a job and had an interview this morning at the restaurant my oldest son works at. The boss is amazing and she told me she's been hoping I would apply there. I start on Saturday.",
      "created_utc": 1730045218.0,
      "score": 8
    },
    {
      "id": "ls4cbbu",
      "body": "I’m so sorry.\n\nI’d divorce him because otherwise I’d be charged with homicide due to cracking after years of pretending it’s okay and doing all you’ve done so far.\n\nIf you’d like to share a story about a positive time with your son, I’d love to hear it.",
      "created_utc": 1729035199.0,
      "score": 7
    },
    {
      "id": "ls5tt59",
      "body": "Speak to a lawyer and start planning your escape from him. Go after him for half of everything. Force the sale of his precious four wheeler.\n\nFuck his life right up.",
      "created_utc": 1729058514.0,
      "score": 7
    },
    {
      "id": "ls5y1vu",
      "body": "Divorce that SOB. Sue for alimony and child support, if you have any minors. \nGet yourself a lawyer. They will be better able to tell you if you should move out and get a job before your divorce is finalised. You might be able to get the house, and hopefully, your husband’s precious 4-wheeler. Screw that kunT",
      "created_utc": 1729061237.0,
      "score": 8
    },
    {
      "id": "ls55r8c",
      "body": "I couldn’t under any circumstance stay with a man like that. 🤷🏼‍♀️ you’re better off being the badass independent woman you already are and cutting out the stress of that sh*t human being.",
      "created_utc": 1729046407.0,
      "score": 7
    },
    {
      "id": "ls4aktr",
      "body": "You’re more powerful than you think. You gave your life for your son over the past 15 years.  You did whatever you needed to do to get through it and support him with love and grace.  Take that same ingenuity, grit and determination and apply it to getting away from your loser spouse.  He doesn’t deserve someone like you. Make a plan and get out.  I know you got this- good luck!",
      "created_utc": 1729034536.0,
      "score": 5
    },
    {
      "id": "ls4bjjl",
      "body": "You are so strong. You just wrote a whole post about your incredible strength. You are definitely strong enough to leave him. You carried your son in everything. And now it’s just you. You got this",
      "created_utc": 1729034903.0,
      "score": 5
    },
    {
      "id": "ls4bqd0",
      "body": "Consult a lawyer. You may be entitled to spousal support. In some areas, possibly for the rest of your life if you achieve the appropriate age + length of marriage factor. Be tactical.",
      "created_utc": 1729034976.0,
      "score": 5
    },
    {
      "id": "ls4mh0d",
      "body": "I’m so sorry for the loss of your beautiful son. You should not have to go through this. You’re not stuck. Divorce your idiot husband and take him to the cleaners. \n\nYou would probably make a great Certified Nursing Assistant. All you need is a High School diploma in the USA. Nursing Assistants work in hospitals and nursing homes providing hands-on care. Many hospitals and nursing homes have trajectories where they will pay for most of your tuition for nursing school or other medical-related fields. Unless you’re burnt out physically and mentally after caring for your son, this is a pathway you might consider.",
      "created_utc": 1729038996.0,
      "score": 5
    },
    {
      "id": "ls4re9m",
      "body": "Make it look like an accident.",
      "created_utc": 1729040839.0,
      "score": 4
    },
    {
      "id": "ls4mw3y",
      "body": "nobody else has said it so I guess I will\nFUCK HIM\nHe’s a pos. you and your children especially your son all deserve better. I am truly so sorry. I have been in similar situations and the longer you wait the worse it’s going to be in some aspects. I know it’s scary but do you want to spend the rest of your life looking at this man?  It’s going to be hard, you can do it and don’t let anybody tell you otherwise. \n\nI would wish you luck..but luck runs out . so I wish you love because love always finds a way.",
      "created_utc": 1729039150.0,
      "score": 4
    },
    {
      "id": "ls4nn2m",
      "body": "He is a POS who has been waiting for this day since your son was born. I would get as far away from him as possible. \n\nI am my adult daughters caregiver and it’s hard work 365 days a year. I am fortunate that there isn’t anything my husband and son won’t or can’t do to help care for her. She automatically looks to me for her needs, but understands that they can help her also. Your husband is really horrible. I hope you get freedom from him. You will definitely be awarded alimony….20 years of it easily!",
      "created_utc": 1729039426.0,
      "score": 4
    },
    {
      "id": "ls553tm",
      "body": "Go to a lawyer. You’re still entitled to half of what your husband has. Probably alimony too. If you tell a judge you didn’t work because you were a caretaker to your son, they won’t look too kindly on your husband not helping and spending that money on himself.",
      "created_utc": 1729046142.0,
      "score": 3
    },
    {
      "id": "ls556yc",
      "body": "When you divorce this piece of shit, there is no judge on this planet that will hear this story and rule in his favor. You will get everything you ask for and more. He will also  be forced to pay your attorneys fees. Talk with family, make a plan, file for divorce, and get the hell out of there. He doesn’t deserve you or your sweet son. \nI hope you find happiness, in whatever way it comes to you, and that the second half of your life is everything you want and more. You deserve nothing less for what you’ve been through. 🩷",
      "created_utc": 1729046178.0,
      "score": 4
    },
    {
      "id": "ls55t1t",
      "body": "divorce please while you’re still young. get a lawyer and make sure to get half of everything, that’ll secure you financially for a while until you get a job. if you have someone you can stay with until you find a job and find a place of your own, that would be ideal. please don’t waste your life with that man. you’re not trapped. leave.",
      "created_utc": 1729046428.0,
      "score": 5
    },
    {
      "id": "ls73p81",
      "body": "You have 15 years of work experience! Just because you have not been paid does not mean you can’t claim that as work experience. I used to be a hiring manager and we would get all kinds of applications that listed “X years full time caregiving for [person]” - for job duties I would list all of the duties you performed - feeding tube, bed transfers, bathing and hygiene, etc.\n\nYour local women’s shelter would be able to help you if nothing else point you in the direction of a lawyer who may do pro bono work or who would work contingent and get paid as part of the divorce settlement. Your husband will also likely have to pay you spousal support given that you’ve been unable to work outside the home.",
      "created_utc": 1729084893.0,
      "score": 3
    },
    {
      "id": "ls481uj",
      "body": "Thank you for sharing.  It must feel impossible sometimes.   God will make a way!  🙏",
      "created_utc": 1729033586.0,
      "score": 7
    },
    {
      "id": "ls4ag9p",
      "body": "How awful! I’m sorry that happened to you and your son. \n\nIf you want to be free of your husband, find out what your rights are where you live now. If you can, see a lawyer. You’re still young enough to start a career, and your experience in healthcare may help you there. since you have a bad back, you don’t want to do patient care, but you may be able to work in an office on billing or something like that. Sometimes there are work work from home jobs for things like that. Your possibilities still exist and you can make a future for yourself without that man if you want to.",
      "created_utc": 1729034487.0,
      "score": 3
    },
    {
      "id": "ls4bdd3",
      "body": "First, I’m so sorry for your loss. And for everything you’ve endured. OP, you definitely qualify for a job as a caretaker or assistant to someone with medical needs. Do you have a trusted friend or family member you can move in with? If you’re in the U.S., you can apply for food stamps and different states have other benefits you could look into.",
      "created_utc": 1729034839.0,
      "score": 3
    },
    {
      "id": "ls4cd1z",
      "body": "Wow, just wow. I don't have the proper words. I'm so sorry for your loss. It seems you are married to an unsuccessful narcissist. I agree with “petting peanut” and others expressing the same sentiment. Stay strong.",
      "created_utc": 1729035216.0,
      "score": 3
    },
    {
      "id": "ls4cqsq",
      "body": "I would not be able to forgive him either. He sounds like an insensitive piece of isht. \nHope he dies alone",
      "created_utc": 1729035364.0,
      "score": 3
    },
    {
      "id": "ls4dt7a",
      "body": "You seem like an incredible person. Your son has been so lucky to have you as a mom, wow. Now, you have to take care of YOURSELF. I’m not American/or English so I don’t know what help you can get but I’m sure you’ll get great suggestions here. You deserve it. People will want to help you, don’t be scared or ashamed to ask",
      "created_utc": 1729035772.0,
      "score": 3
    },
    {
      "id": "ls4f3wx",
      "body": "You do have work experience. Stay at home parents, caregivers, etc. can translate these skills into the workforce. Find a career consultant that can help you. Good luck - sorry for your loss and your husband being an A-hole.",
      "created_utc": 1729036260.0,
      "score": 3
    },
    {
      "id": "ls4l88x",
      "body": "You aren’t trapped. Spousal support is a thing. Talk to a lawyer.",
      "created_utc": 1729038537.0,
      "score": 3
    },
    {
      "id": "ls4look",
      "body": "I am so sorry for your loss. Divorce that piece of shit.",
      "created_utc": 1729038705.0,
      "score": 3
    },
    {
      "id": "ls4txkf",
      "body": "You gave 15 grueling but beautiful years of your life to loving and caring for your son. Do you want to spend the rest it trapped with this selfish POS? Do you think he would want that?",
      "created_utc": 1729041807.0,
      "score": 3
    },
    {
      "id": "ls4vsuo",
      "body": "I am so sorry for your loss! My wife and I lost our 1st at 3yrs old. Very special needs all that your son needed to a tee. I as his dad was there every minute. He passed 23yrs ago and a day does not go by that do not miss my son. I died that day with him. The strength that you have to go on is knowing you did all you could for your boy!! \nNow to your husband, he is a major POS! \nHe does not deserve you, you need to file for spousal abuse for all the years of parental abandonment. I hope you plan to divorce. You will have all the resources and assistance you need. If I ever had the chance to meet him he and I would end up in hospital beds together. I would love to take 23yrs of the loss of my son on him. He is not worth the mention here only to let the world know what a POS HE IS!! I wish you madam the best today and the days ahead. For you and I both have our special angels watching and guiding us! Peace for you and your family. May your loving little boy rest in peace. Please pray for my boy Philly! \nI am angry for you. I have no pity for him there is a special place on earth for men like him!",
      "created_utc": 1729042519.0,
      "score": 3
    },
    {
      "id": "ls4yihw",
      "body": "Alimony is a thing. IANAL, but I'd bet you have a solid case to take half of everything he has (liquid and leveraged) and half of everything he will make for the next many years. You've been married since you were practically kids. Nothing is \"his,\" it's all \"ours.\" Even his paycheck, retirement, other investment accounts, and any real property acquired during the marriage, I suspect, is half yours. It wouldn't have been possible without you handling his share of the parental responsibilities.\n\nContact some divorce attorneys. It shouldn't be hard to find one who will take your case on contingency.",
      "created_utc": 1729043559.0,
      "score": 3
    },
    {
      "id": "ls5et00",
      "body": "Most people have a heart and are empathetic, unlike your husband. Tell the story of how you took care of your son in your next interview. Anyone with half a brain is going to recognize that you’ve put in more work over the last 15 years than most put in their entire life.\n\nYour story is making my blood boil. It’s reminding me of my best friend growing up that had a rancid father. He and his 2 brothers (all 1 year apart) would tell me stories about how his dad would hit his mom, burn them with cigarettes, and just cause so much torment in their tiny apartment. This guy did whatever the fuck he wanted to do to harm his family for nearly 15 years. It finally came to an end when the oldest brother came home from basic training. Dad went on another one of his violent tantrums, hit his mom, and all 3 brothers decided enough was enough. Led by the oldest, they proceeded to severely beat 15 years of accountability into that man. Before calling the ambulance they told him to stay away from their mother or they would kill him next time. He was in the hospital for a week which gave them time to get away from that place. All these years later, buddy still has a pact with his brothers that if the dad shows up again he will die. The hate runs that deep. \n\nI know your husband isn’t the lunatic that my friend’s father was, but my point in sharing the story is this: Kids see everything. Your children saw the love and care that you gave their brother during his short life. They also see their father and the ways he chooses to act in each and every situation. As time goes on they will reconcile their thoughts and will see their father for who he truly is. They will also understand what you went through during this time. \n\nIm so sorry for the loss of your son. Based off of reading a paragraph of your life, the effort you put into family makes me believe you are more than capable of finding the clarity to know whats best for you and your kids, and the courage to act on it.",
      "created_utc": 1729050366.0,
      "score": 3
    },
    {
      "id": "ls5fot7",
      "body": "You aren’t trapped.  You can divorce and get alimony and half his pension/retirement.  You are only as trapped as you allow yourself to be.",
      "created_utc": 1729050784.0,
      "score": 3
    },
    {
      "id": "ls5ltv0",
      "body": "I’m so sorry that your husband treated your son that way when he was alive. It makes my heart sad for you to watch that and be left to live thru that as well as be the sole caretaker most of the time. I’m also sorry you lost your boy. I am so grateful he had a mom like you. Dedicated to him and showed him love his entire lifetime. He was blessed to have you. I too have been married 21 yrs and it hasn’t always been easy. I too have been at home so I understand the trapped feeling. I several years back met with a couple different family law attorneys. They said I would be able to have help until I didn’t need it anymore. They also told me that I would be ok. That they have seen it time and time again. Strong Women come out on top and they thrive better than they ever could have dreamed. \nUltimately my husband fought for our marriage and our family however it’s not typical. I just wanted to tell you I am sorry you’re in this position and the pain it is for all of you. \nHe doesn’t seem to even be anywhere near the level of human you are based only on the brief post here. Either way I am sending you love from one mama to another.",
      "created_utc": 1729053901.0,
      "score": 3
    },
    {
      "id": "ls5o6wl",
      "body": "Divorce. Take 50% of everything and don’t settle for a penny less. Accept spousal support until you get on your feet. You deserve to live whatever life YOU want. Go back to school, maybe become a nanny if you like kids? \n\nFuck that guy. (Not literally). \n\nI’m so sorry for your loss.",
      "created_utc": 1729055191.0,
      "score": 3
    },
    {
      "id": "ls5ss1q",
      "body": "Divorce this guy and get alimony please. Take the house from him.",
      "created_utc": 1729057871.0,
      "score": 3
    },
    {
      "id": "ls5z6lv",
      "body": "That’s insane. I’m sure you can find a job and build up enough to leave. It’ll be hard but it sounds better than staying where you are. I’m sorry all this happened to you and your kids.",
      "created_utc": 1729061981.0,
      "score": 3
    },
    {
      "id": "ls634a0",
      "body": "Make his life miserable if you can’t leave stop doing anything for him sleep in another room",
      "created_utc": 1729064692.0,
      "score": 3
    },
    {
      "id": "ls6797b",
      "body": "You are as trapped as you want to be! \n\nRe entering the workforce is scary but doable. Leaving him is scary but doable. \n\nYou could probably walk into a care job. Maybe even a live-in one with a nice oldie. \n\nYou will probably be entitled to all kinsa of alimony and marital assets, including his fucking truck. Please fight to get his fucking truck! \n\nSending you love and strength to do what you know you need to x",
      "created_utc": 1729067624.0,
      "score": 3
    },
    {
      "id": "ls6i5wu",
      "body": "1. You are an amazing mom. Your son was so lucky to have you, all the things you did to help him and all the sacrifices you made. \n2. I’m so sorry for your loss. I can’t imagine how hard it was to go through everything you’ve been through. \n3. Your husband sucks. He should have helped you with your son. It was terrible of him to immediately start talking about the money. And the money should have been used in a way that was mutually agreed upon if not just as your money since you were the primary caregiver. Divorce him. You deserve better. He doesn’t seem to care about much besides himself. I don’t see a way to repair a relationship with a person like him.",
      "created_utc": 1729074927.0,
      "score": 3
    },
    {
      "id": "ls6xnmo",
      "body": "Hi, first I want to say I am so sorry for your loss and everything you’ve been through. Now I want to say that I’m an older man and with my life experiences I’m gonna offer up just a different advice. With everything you’ve told here, You are a really, really good person and he absolutely doesn’t deserve someone like you, but before you make any decisions please consider going to school for one of the different Nursing degrees, you sound like you would be great for that. And do this at his expense, and then plan your exit. I wish you the best of luck and again I’m sorry for your loss and may God bless you absolutely deserve someone better.",
      "created_utc": 1729082507.0,
      "score": 3
    },
    {
      "id": "ls77qhm",
      "body": "Divorce him. You can leave him, there are always options. And there are plenty of jobs out there you would qualify for, despot not generating earned income. Ask for half and spousal support. You deserve better!",
      "created_utc": 1729086396.0,
      "score": 3
    },
    {
      "id": "ls7fbxy",
      "body": "Honey, it’s time you leave. He has shown you that he doesn’t care, probably at this point, never will. Lawyer up. Get petty and take him for everything he has, it’s the least he could do after years of abuse and neglect, because that’s exactly what it was.",
      "created_utc": 1729089044.0,
      "score": 3
    },
    {
      "id": "ls7kgo4",
      "body": "The doula field is really thriving & certifications are fairly financially accessible. You can absolutely use all your caregiver experience and get hired by an agency that will bring you families while you get started.",
      "created_utc": 1729090734.0,
      "score": 3
    },
    {
      "id": "ls7tstg",
      "body": "Because you closely worked with your son, he is your son. Since your husband didn't work closely with him, he did not feel like a son to him, rather a person that his wife took care of. There's no emotional attachment there. You worked to take care of him, and your husband worked to \\*not\\* take care of him.\n\nThis is what alimony is for. As a person example - my mom quit working to care of my brother with special needs growing up. My dad didn't have a lot to do with his care; he was working all the time.\n\nThey divorced and my mom was entitled to 30% of my dad's take home pay, even though they divorced after my brother turned 18. She did \"work\" - just not a paying job. Since my dad made a good salary \\*not\\* taking care of my brother, the alimony my mom received was enough to support her.\n\nThat's a very neat example of how the law tries to maintain fairness. I'm not sure if your husband makes enough that 30% of his salary would support you. Also, it differs between states. My state (MA) has pretty generous alimony laws.\n\nAlso, see a therapist. Really.",
      "created_utc": 1729093751.0,
      "score": 3
    },
    {
      "id": "ls82dvu",
      "body": "My condolences on the loss of your son. \n\nAnd apply for jobs. What is the worst that can happen? They say no? \n\nThey say women won’t apply for a lot of jobs because they think they are not qualified. You are qualified and even if you aren’t you can learn. They look at more than just qualifications - they look at who they need / who fits with the culture / attitude/ work ethic, etc. Give them the opportunity to consider you. \n\nDon’t miss out on the chance when they say yes. \n\nRemember the worst that can happen is they say no. \n\nYou are a dedicated, loving, strong, supportive person who never gave up and you are not going to give up now. You have made it through very difficult situations and made a medically challenged little boy able to live his best life and was able to love and be loved. \n\nTake it a day at a time. Get your life in order so you can leave. You have been there for 21 years - you won’t be able to change things overnight. But you will change them. \n\nYou got this. \n\nPs - Open your own bank account in your name only. \n\nConsider selling furniture, house stuff, etc. use Craigslist or facebook marketplace. Have a garage sale. You don’t need 4 tvs. 3 sets of china. 15 side table, 54 pairs of shoes. Look at the minimalism and declutter subreddits. \n\nWhile you are applying for jobs, get the house in order for you to leave and make some cash while you are at it. Tell your husband that you are redecorating and wanting to make changes to the house (i.e. you no longer living there). \n\nYou can also Get a small part time job at a coffee shop. Or anything that is entry level. The holiday season is coming and retail and food nneeeeeeddddd people. It’s work and a paycheck and it will get you started. \n\nAnd as others have said - you can look into home care since you have the experience, but it’s understandable if you don’t want that kind of job. Also get your back looked at. \n\nRemember you don’t need to make career choices right now. Just focus on yourself and getting out. And make sure you take time to mourn.",
      "created_utc": 1729096484.0,
      "score": 3
    },
    {
      "id": "ls830o2",
      "body": "What a horrible man, I am so sorry. It sounds like your kids are mostly grown or nearly so? If you can stomach the idea of a job in health care, look for programs in health care at community colleges near you. You might be able to get in on an apprenticeship program that will pay for initial training and pay you while you get trained, for a degree like LNA or LPN. Pay won't be great, but it is a job and you are on your way. Then once you have a job doing that, you can possibly use tuition reimbursement programs through your employer to get an RN. They are absolutely desperate for nurses, your employment gap will be a non-issue once you have the basic credential and especially with your personal history, and once you are a nurse you will make a solid income and if you choose to advance you can make quite a good income.",
      "created_utc": 1729096685.0,
      "score": 3
    },
    {
      "id": "ls8ilv4",
      "body": "Leave. He sounds like a horrible person the fact that you made it 21 years with him is mind blowing. Also you do have work experience. Caring for your son's needs I am sure taught you a lot about medical care and that should count for something. I would start applying at hospital for front desk or nursing homes are always looking for people. Or even something out of the medical field but caring for your child was a job, you weren't just a stay at home mom. I wish you the best and hope you get away from that selfish man.",
      "created_utc": 1729101560.0,
      "score": 3
    },
    {
      "id": "ls9mgi5",
      "body": "\nFind a lawyer and start making your plan to leave quietly. You deserve to live a life with dignity, respect, and joy. Hiring a lawyer will be you hiring an advocate  and someone who can do some heavy lifting on your behalf instead of you having to do it alone.",
      "created_utc": 1729114218.0,
      "score": 3
    },
    {
      "id": "lsacob2",
      "body": "I am sorry for your loss. Please leave this man.",
      "created_utc": 1729123804.0,
      "score": 3
    },
    {
      "id": "lsbjjag",
      "body": "Well, I'll tell you what you DO have - half that fucker's retirement/pension, half the house, and most likely alimony because you haven't worked all these years. And if you play your cards right, he'll have to pay for your divorce lawyer. Go on and get it girl....",
      "created_utc": 1729142098.0,
      "score": 3
    },
    {
      "id": "lsc6gza",
      "body": "Oh, you have skill mumma. You just don't know it yet! What you are describing being a nurse to a tee!!! You need to USE this POS man to get through nursing school, then leave his butt behind, and NEVER look back.",
      "created_utc": 1729157262.0,
      "score": 3
    },
    {
      "id": "ls4ha1o",
      "body": "I’m so sorry. I hate this. I hate this so much. I wish I could hug you and tell you it will be ok. I too am a mother of a special needs son and find myself alone a lot. You got this. You will be ok. You did work for 15 years as a loving devoted mother I would list that no bullshit in my application and all the duties you performed as well as how much you loved and enjoyed it how it didn’t feel like responsibilities at all. I wish I ran my own company I’d hire you on the spot. You went through hell. You can literally do anything. I believe in you! I’m going to hope and pray you gather the strength and wisdom to believe in you too! You deserve better! Your son deserved better but it seems he was more fulfilled that ever and blessed to have you as a parent and guardian angel. I know I said it but I’ll say it again. I BELIEVE IN YOU YOU BEAUTIFUL BROKEN YET RESILLIENT STRANGER. I BELIEVE IN YOU!",
      "created_utc": 1729037071.0,
      "score": 5
    },
    {
      "id": "ls4cgxe",
      "body": "I'm so sorry for you and I apologize for him, as a husband and a father. I know you have a long time in this marriage and you are obviously a strong woman, but I'm not going to lie and be honest. I couldn't stay with someone like that, he is neither a husband or a father. It takes a little more than a few dollars and a sperm donation to earn those titles. Good luck and I wish nothing but the best for you heading forward.",
      "created_utc": 1729035259.0,
      "score": 2
    },
    {
      "id": "ls4cprz",
      "body": "I am so sorry for your loss!!   Give yourself time to grieve!!! \n\nThen Get a great attorney and they can tell you what you can expect to take from this one sided marriage!   Get child and spousal support and 50% of assets!!! Kick him to the curb and don’t look back.   You have proven how strong you are!! Spend the rest of your life free of such a small and selfish man.",
      "created_utc": 1729035353.0,
      "score": 2
    },
    {
      "id": "ls4d2fm",
      "body": "I'm so sorry you didn't get the support you needed from your husband and he continues to be an asshole after your son died. My son was a medically fragile child, I know how hard it is to be a caregiver although I only did it for the 3 years he was alive. You should be entitled to some type of alimony no matter where you live, please don't tolerate this insufferable man any longer. Hopefully one day he will regret the way he acted.",
      "created_utc": 1729035488.0,
      "score": 2
    },
    {
      "id": "ls4ddsj",
      "body": "I’m very sorry for the loss of your beautiful son.  Cherish all of the sweet memories.  May he never be forgotten.\n\nI’m also sorry for the lack of a husband that you’ve had to endure.  How incredibly awful.\nYou are a great person, especially a great mom.  \n\nI hate that you’re dealing with so much pain.  I hope you are able to turn things around quickly.  I send you light, strength, and prayers for healing.  You deserve so much better.  {{Hugs}}",
      "created_utc": 1729035609.0,
      "score": 2
    },
    {
      "id": "ls4e2l6",
      "body": "I am so sorry for your loss.\nI am so sorry you are trapped with a husband that you do not respect and cannot love.\nAlthough you cannot leave now - you can develop a plan.\nSince your sweet child has passed away - maybe you can get a job or go to school?\nYou can put your money into an account until you have enough to move out and get a lawyer.\nYou deserve someone who isn’t excited about his son dying so he can buy a truck.\nI am rooting for you OP.",
      "created_utc": 1729035870.0,
      "score": 2
    },
    {
      "id": "ls4eqr1",
      "body": "Firstly I'm so sorry for your loss. Now us the time to get rid of the extra baggage your family has been carrying around. See a lawyer and take him for all he's got. That's the least he owes you.",
      "created_utc": 1729036123.0,
      "score": 2
    },
    {
      "id": "ls4gcjk",
      "body": "I'm so sorry, that's a story that got to me a little more than most would here.\n\nI know the word gets thrown around a LOT on Reddit, but divorce truly seems like the idea here. Even just to move on from this chapter a little. I hope things get easier",
      "created_utc": 1729036720.0,
      "score": 2
    },
    {
      "id": "ls4k5y9",
      "body": "I would leave him. Or if you can't to that, when he gets old, stick his ass in a nursing home. The crappiest one you can find.",
      "created_utc": 1729038149.0,
      "score": 2
    },
    {
      "id": "ls4kzqm",
      "body": "Sell the 4 wheeler.",
      "created_utc": 1729038450.0,
      "score": 2
    },
    {
      "id": "ls4l1mj",
      "body": "Fuck that guy. An hour after your son passed?! Sickening. So sorry for your loss.",
      "created_utc": 1729038469.0,
      "score": 2
    },
    {
      "id": "ls4n0at",
      "body": "Take half of his shit. He will soon have a two wheeler. I’m so sorry for your loss and I wish the worst on your soon to be ex. \nBtw many of the senior care jobs (if you choose to go that route) will be cakewalk compared to the job you were doing for your son. I hope you can find peace.",
      "created_utc": 1729039194.0,
      "score": 2
    },
    {
      "id": "ls4suwp",
      "body": "I've been my youngest's caregiver since he was born. He now has a paid caregiver that comes in 5 days a week, and she's been a lifesaver for me. He's 17, wasn't supposed to live beyond 7years old, that being said, what I've learned carrying for him if I need to go into the workforce after he passes i will most likely go into home Healthcare, it's what I've known for 17 years and what I have experience in now. You have that experience as well, use it. Get the certificates you need, some places will give you on the job training to let you earn the certifications as you work. Good luck!!! You deserve better than your husband. ❤️",
      "created_utc": 1729041400.0,
      "score": 2
    },
    {
      "id": "ls4tlts",
      "body": "This man is disgusting, his child dies and all he thinks about is what he's going to buy himself. I don't think I could get this. I'm a pediatric nurse and not really surprised that he didn't provide care, the dass that are equal care givers are the minority. \nI'm sorry about your son and I'm sorry that you have to deal with this vile man, I hope you have a good support system and the rest of your life is calm and peaceful.",
      "created_utc": 1729041684.0,
      "score": 2
    },
    {
      "id": "ls4y68c",
      "body": "I think you need to leave him. That’s disgusting",
      "created_utc": 1729043433.0,
      "score": 2
    },
    {
      "id": "ls4z41c",
      "body": "Why don’t you apply to become a CNA?",
      "created_utc": 1729043784.0,
      "score": 2
    },
    {
      "id": "ls5416i",
      "body": "2 words come to mind..Aqua Tofana",
      "created_utc": 1729045709.0,
      "score": 2
    },
    {
      "id": "ls54rsn",
      "body": "Bless you for all you did for your son.",
      "created_utc": 1729046008.0,
      "score": 2
    },
    {
      "id": "ls58m6j",
      "body": "Get a CNA License ASAP",
      "created_utc": 1729047591.0,
      "score": 2
    },
    {
      "id": "ls58r5d",
      "body": "You could probably start working at a nursing home tomorrow.  Start living your life. Your son would want that.",
      "created_utc": 1729047650.0,
      "score": 2
    },
    {
      "id": "ls5d2po",
      "body": "I am sorry about your son and your struggles. Unless you signed a prenup, you are entitled to half of everything and spousal support and his pension. He is a terrible person and you should consider leaving him. All the best to you and don’t forget: You got this! Don’t be afraid!",
      "created_utc": 1729049561.0,
      "score": 2
    },
    {
      "id": "ls5iswi",
      "body": "I also want to add a suggestion for work. Schools are so desperate for help. There are lots of positions that do not require anything but a GED and ability to pass background check. You can apply for substitute positions of all kinds or aides, or help in the kitchen. They love moms that have been SAHM. \n\nI'm sorry that man is scum. Nobody deserved his bullshit behavior.",
      "created_utc": 1729052322.0,
      "score": 2
    },
    {
      "id": "ls5mjkt",
      "body": "You're still young and will be able to get back on your feet.. go for spousal support and get the hell out of that one way marriage",
      "created_utc": 1729054284.0,
      "score": 2
    },
    {
      "id": "ls5poq6",
      "body": "I’m so sorry, your awful husband put you through this. Losing a son is terrible ( one of mine died by his own hand) and to have the grief compounded by such terrible behaviour is unimaginable to me. The suggestions of using your hard won experience to get work is a good one. Many places give carers a chance to qualify as they work. I know here in the UK one of my older siblings was a college teacher of such courses. May you find the freedom in life, your son found in death. I firmly believe that in heaven there are no disability’s.",
      "created_utc": 1729056025.0,
      "score": 2
    },
    {
      "id": "ls5re0l",
      "body": "If you needed a place to go, you may be able to claim financial abuse and go to a women’s shelter.  I’m sorry for your loss and empathize with your anger.",
      "created_utc": 1729057031.0,
      "score": 2
    },
    {
      "id": "ls5sid2",
      "body": "Yeah. Fuck this guy. I wouldn't forgive him.",
      "created_utc": 1729057708.0,
      "score": 2
    },
    {
      "id": "ls635tu",
      "body": "I am so sorry for your loss.  What your husband did is unforgivable.  How he neglected to care for you or your sons needs is unforgivable.\nI hope you find the strength to take care of yourself.  Seek therapy.  Seek a lawyer.  Speak with your family and friends.  When you are ready, it is time to find a job.  Whether he likes it or not.  And when it comes to employment.. depending where you live yes times can be difficult finding employment but think of all of the skills you've gained through the experience of caring for a medically complex child.  Believe me, you can find a job, don't doubt yourself!!\nStay strong ❤️",
      "created_utc": 1729064722.0,
      "score": 2
    },
    {
      "id": "ls6q4pt",
      "body": "You’ve really been let down. It sounds like your partner never really understood the investment you put in to your child’s life and happiness. A person as amazing as you should deserves a happy life. \nTime to lawyer up.",
      "created_utc": 1729079141.0,
      "score": 2
    },
    {
      "id": "ls6v82e",
      "body": "First of all, I’m so sorry for the loss of your beautiful boy. Second, your husband is the worst, it’s good that you’re leaving him. Just when I thought he couldn’t get any worse, he did. Again and again. Make sure you get a very fair spousal support!",
      "created_utc": 1729081470.0,
      "score": 2
    },
    {
      "id": "ls6vduo",
      "body": "Divorce him.",
      "created_utc": 1729081539.0,
      "score": 2
    },
    {
      "id": "ls6vwz1",
      "body": "All of this advice is amazing but damn it, you are an amazing person.",
      "created_utc": 1729081770.0,
      "score": 2
    },
    {
      "id": "ls7vmv3",
      "body": "This is horrific!!!! What a useless asshole! You actually have so much experience with caring for someone with this rare special needs and can probably get a license and people would love to hire you knowing how much empathy you have. \n\nDo you have access to back accounts? I would start putting money away while going to school for your license so you can prepare to leave. But act normal. Tell him that your back hurts or you’re too tired when he asks for sex tho. I’m sure you’re more than disgusted with him by now seeing how he treated you as a domestic servant til now. Look out for yourself, build yourself and gtfo of there!!! Wishing you the best life has for you",
      "created_utc": 1729094331.0,
      "score": 2
    },
    {
      "id": "ls7wxbd",
      "body": "My story is so similar (kiddo with LGS, home health, tube-fed) and my ex was more involved, but I still carried 80% of the care. My son died suddenly at 13. I left my ex 5 years later and moved in with my family at age 50+ and broke.\n\nIt's been humbling, and I've learned that my caregiving taught me so many lateral skills (advocacy, organizing, record keeping, communication, etc) that I included them on my resume. Yes, the job market sucks, and yes I now have a small business. Leaving allowed me the space and time to fully grieve, have that \"nervous breakdown\" and get the PTSD therapy I needed via our county MHMR.\n\nI also pay rent. I managed to receive a Pell grant and am back in school for the career I want for the rest of my life. It's in high demand, helping others without further wrecking my body and now I'm confident. I can say I love myself now.\n\nI want these things for you too, regardless of how long it takes you to get there. You're worth more than the selfish man in your life who adds to your grief.",
      "created_utc": 1729094740.0,
      "score": 2
    },
    {
      "id": "ls85aql",
      "body": "That's awful. I'd work on getting a divorce. You could always find part time work.",
      "created_utc": 1729097403.0,
      "score": 2
    },
    {
      "id": "ls8e96g",
      "body": "You're not trapped. There's nothing wrong with starting over. You don't want to spend the rest of your life like this. I'm not saying it won't be hard, but obviously you're tough and you're capable. You can do anything. Save some money girl. Even a job at Pizza Hut is doable at this point. Work a till at your local grocery. It doesn't have to be a big leap, but baby steps to freedom if that's what it takes. There are options, even online classes. Do what you have to do, just don't give up on yourself.",
      "created_utc": 1729100211.0,
      "score": 2
    },
    {
      "id": "ls8j4gs",
      "body": "Wow. What an awful “man”. 🤮",
      "created_utc": 1729101720.0,
      "score": 2
    },
    {
      "id": "ls8p1fs",
      "body": "You sound like an amazing mother. I'm sorry you got stuck with such a useless man. I hope he lives the rest of his life with people that spend as much effort into him as he did with his son.",
      "created_utc": 1729103589.0,
      "score": 2
    },
    {
      "id": "ls9it7i",
      "body": "I’m so sorry your husband did this to you. It’s such a deep betrayal. I hope you divorce his ass and take half, and that he has to step up with the kids part of the time so you can get some time for yourself because you absolutely deserve it. With your experience I would consider becoming a CNA or home health aide, lots of adult schools/vocational non profit schools have solid 4 months programs and will help you with job placement immediately after graduation so you can build more work experience and then if you want to switch jobs you will have X amount of field experience already. The non profit schools tend to only charge for materials, background and drug test. There are accelerated for profit programs too but they tend to be pricier and the education can be subpar as they tend to be something like 18-25 days. I started as a CNA and am now going to nursing school! You have tons of relevant experience already and you can take additional education units and work in a hospital setting aside from long term care etc. It’s not glamorous but the education tends to be practically free through your local adult schools or non profit medical college and it doesn’t require any degree. I hope again that you divorce his ass and get half and can focus on yourself and enroll into a program, I think you would do great with it because you have so much relevant hands on knowledge and after your initial job placement which the program will most likely help you with (it’s usually one of the sites you did your clinical rotations at) you don’t have to worry about that time gap. I had a big gap in employment too due to health reasons and I never struggled getting hired as CNAs are in high demand with our aging population. I absolutely cannot comprehend his absolute absence of any empathy. And I want to stress again how unacceptable and awful he has been and treated you and your son. But you got this. It’s not over! I saw so many varying ages both in my CNA class and nursing school so please don’t think you’re too old to start over because it’s not true.",
      "created_utc": 1729113004.0,
      "score": 2
    },
    {
      "id": "ls9kil3",
      "body": "I'm so so sorry for your loss, OP. Idk where you live, but in the US, some states will pay you to help people exactly like how you took care of your son. Retirement homes would also find your experience compelling. \n\nDrop the dead weight and move on. You'll be better off without him.",
      "created_utc": 1729113569.0,
      "score": 2
    },
    {
      "id": "lsa020q",
      "body": "Take a certified nursing assistant class, become certified to work in hospitals or rehab centers. It doesn’t pay much but it will give you independence from the piece of shit that you’re married to. How many kiddos do you still have at home?",
      "created_utc": 1729119060.0,
      "score": 2
    },
    {
      "id": "lsa18qg",
      "body": "You're by no means trapped. You have tons of experience with home health care & a lot of places are offering a sign on bonus( at least in PA). You're husband is a scumbag piece of trash. You're entitled to alimony etc.. A divorce attorney can tell you a lot more then me.",
      "created_utc": 1729119493.0,
      "score": 2
    },
    {
      "id": "lsb5e09",
      "body": "Work history or no, divorce that man immediately….sell the house and distance yourself as far as you can. What a POS human he is. You no doubt have people around you that can help you get on your feet",
      "created_utc": 1729135032.0,
      "score": 2
    },
    {
      "id": "lsbh0hi",
      "body": "I'm so sorry for your loss of your precious son. You were a wonderful mother to him and it's clear how much you loved him and always will.\n\nAs for that horrible husband of yours, there will be a special place in hell for him. Evil despicable human being. Like others gave said, get a divorce attorney and go for everything he has.\n\nDon't worry about work experience. You will be okay. You will find work. \n\nIn the meantime,  practice self-care and keep being the awesome mother that you are to your children.  You got this!",
      "created_utc": 1729140714.0,
      "score": 2
    },
    {
      "id": "lscqrwq",
      "body": "I work for a care community corporation that is all over the South. We would hire you immediately. No work experience required. You've shown you can care for someone with love and compassion. That's the most important asset you could have.",
      "created_utc": 1729168295.0,
      "score": 2
    },
    {
      "id": "lsctgjk",
      "body": "Sorry, he sounds terrible. \n\nI agree with the others. Who said you could do personal care assisting you could.  I will go back to school to be a nursing assistant. \n\nThe easiest area to work in a hospital is in psych. Most people are scared of the psych patients but honestly, you don’t need to be the people who get injured are the ones who don’t pay attention to the patient or the situation. Typically you do rounds every 15 minutes and that’s traded off with someone else so you’re not the only one doing it. You give out food trays you do vitals normally once or twice a shift you work three days a week 12 hour shifts . \n\nAfter a couple years of experience and then going into Case Management assisting, it’s an office job. \n\nIf you can work nights, you can study at work and go back to school, and be a nurse if that’s something you might be interested in or study for whatever, accounting maybe?",
      "created_utc": 1729169407.0,
      "score": 2
    },
    {
      "id": "lsdatzl",
      "body": "No reason to stay now. You get the house. He gets the four wheeler (being glib, but seriously…)\n\nYou’re over experienced with caretaking, get the job and get the marital financial support due to you ( your husband may not value your worth, but most countries’ courts will).\n\nThis is not the man who will be by your side if you’re ever incapacitated.",
      "created_utc": 1729175715.0,
      "score": 2
    },
    {
      "id": "lsdfihb",
      "body": "What an awful person",
      "created_utc": 1729177234.0,
      "score": 2
    },
    {
      "id": "lsee1ek",
      "body": "OP, I am terribly sorry about your son and your POS husband. \n\nBut I agree with the others, you are only 1 year older than me and have a TON more experience than you think. Your son gave you the experience and the strength to learn about patient care. I'm sorry you were injured in the process and maybe this isn't the job you'd want, but you could definitely take some of that divorce money and help others like your son, in his memory. \n\nI'm so sorry again, and I hope you have a much better life ahead of you.",
      "created_utc": 1729188137.0,
      "score": 2
    },
    {
      "id": "lsfkgdg",
      "body": "Go to school online ",
      "created_utc": 1729201793.0,
      "score": 2
    },
    {
      "id": "lsfym7p",
      "body": "I'm sorry OP. For what it's worth (and I think that it's worth a lot) - you sound like an amazing mother and person.",
      "created_utc": 1729206983.0,
      "score": 2
    },
    {
      "id": "lsjdq95",
      "body": "Good afternoon, I am Brazilian, my official language is Portuguese, so I used Google Translate.\n\n\nLook, I believe you could seek help from a divorce lawyer, because you have a great case against your husband, because at no time did he not help your son emotionally, and you have proof from both your children and from outsiders, from what I understand.\n\n\n\nTalk to your family members, on your side and some trustworthy ones on his side, to ask for support with the time you spent taking care of your son. The doctors themselves will help you find a job as a caregiver for people with medical needs. Here in Brazil, the course for elderly caregivers lasts approximately 6 months, and after 2 months you can already get jobs in the field. Due to the growth in job openings, I believe that where you live, the job openings will be like this too. I believe that if you get advice from a lawyer, with the support of your family, you will get a great alimony payment, in addition to the alimony for each child. They will be on your side because they know how much you sacrificed taking care of them and their brother.\n\n\n\nI wish you good luck, and may God bless you and your children, and may everything work out.",
      "created_utc": 1729264348.0,
      "score": 2
    },
    {
      "id": "ltj052q",
      "body": "I have tears in my eyes. I am so sorry. Besides the misuse of the money, the fact he immediately went to that line of thought when his child died is offensive. Your son had a good life because of you. I hope you are proud of that. I hope he still exists somewhere on another plane, content in your love. Bless you. ",
      "created_utc": 1729784176.0,
      "score": 2
    },
    {
      "id": "ltxvmlm",
      "body": "Thank you everyone for your kind words and support. I just applied for a job and have an interview in the morning. It's only part time, as I still have kids at home, but it's something. Taking baby steps I suppose.",
      "created_utc": 1729991210.0,
      "score": 2
    },
    {
      "id": "lub5bus",
      "body": "I can't find the words to express my deep empathy for you. What a selfish, self centered human. One of the reasons humanity is what it is a this point. \n\n\nHere I am complaining about my life as a sgl mom and how unfair it is. What a perspective shift. \n\n\nWhat you did for your son, you now have to do for yourself. It's unfair. And I truly wish that life will reward you in it's own way, however that may look. \n\n\nYou have it in your! Clearly you do. Set yourself free from this man.i wish you all the best, dear. If anyone deserves it, it's you. \n\n\nMuch love and endless hugs.",
      "created_utc": 1730182514.0,
      "score": 2
    },
    {
      "id": "ls7gfji",
      "body": "get a job at a restaurant. tips will help you save quick",
      "created_utc": 1729089415.0,
      "score": 2
    },
    {
      "id": "ls4nht4",
      "body": "Damn, husband for sure gonna have a tough deathbed. Sorry this happened to you.",
      "created_utc": 1729039371.0,
      "score": 1
    },
    {
      "id": "ls4nja7",
      "body": "Please contact your local domestic violence organization for advice on how to safely leave this financially abusive and emotionally abusive man. Even if he’s never hit you, that’s domestic violence. The DV organization may also be able to help you search for a job & affordable housing.",
      "created_utc": 1729039386.0,
      "score": 1
    },
    {
      "id": "ls4nlv7",
      "body": "You can probably get alimony, go talk to a lawyer. You aren’t trapped you just don’t know what you can get out of this divorce.",
      "created_utc": 1729039414.0,
      "score": 1
    },
    {
      "id": "ls4p0yf",
      "body": "Nurse/caregivers do God’s work and are truly blessed.  Get certified as a nurse/caregiver.  Your son and God are going to take care of you. ❤️",
      "created_utc": 1729039939.0,
      "score": 1
    },
    {
      "id": "ls4p7nz",
      "body": "Get a job now and then treat yourself to a divorce once you have some savings.",
      "created_utc": 1729040008.0,
      "score": 1
    },
    {
      "id": "ls4pen5",
      "body": "Divorce him.\n\nDepending on where you live, you may get half of everything, which means he will need to sell that ATV and you get half the proceeds. That, and the house.\n\nUnless you have other children, you don’t need a big house. Get a cute apartment (or buy a condo) and decorate it exactly how you want with no regards to him and hang up some pictures of your son. Go live your best life as a way of honoring your son and living the life he couldn’t and dishonoring your husband by showing him that you are beyond strong, resilient, and your life is happier and more beautiful without him in it.",
      "created_utc": 1729040082.0,
      "score": 1
    },
    {
      "id": "ls4pybo",
      "body": "I’d leave him… get some skills, a job, leave.  I am sorry this happened to you.",
      "created_utc": 1729040289.0,
      "score": 1
    },
    {
      "id": "ls4qiy7",
      "body": "You have more to offer than you think. You’d be shocked at what you think isn’t as marketable skill is, in fact, a marketable package many would hire \n\nIt’s time to advocate for yourself and take everything you can for your freedom",
      "created_utc": 1729040504.0,
      "score": 1
    },
    {
      "id": "ls4r34b",
      "body": "This isn’t hard. Get a certificate in either school for 6 months, you can do EMT, you can do CNa, LVN, you can do office like Microsoft. \n\nFind an insurance attorney and get a consultation on the insurance he was given and how he spent it. \n\nStart to work and sue him. Frankly you can do a lot.",
      "created_utc": 1729040718.0,
      "score": 1
    },
    {
      "id": "ls4r6l5",
      "body": "Let's hope the day never comes..where he needs u as his son did!👈 sarcasm 🙄 vile man! I hope u get through this op..sending good vibes and 🫂",
      "created_utc": 1729040756.0,
      "score": 1
    },
    {
      "id": "ls4saqz",
      "body": "Hopefully your kids know that their dad  is a total AH and will eventually turn their backs on him when he needs help.  Talk to a divorce lawyer and explain everything as you did in this message and your hubbies lack of care, concern and love for your deceased child.  See what the lawyer recommends.  Also make an appointment with a college counselor and tell them all the work that you did to being the only care giver for your son; they should be able to help you play your strengths into a degree that will help you get a job to become sole support for yourself.  \n\nYou are a strong, amazing woman and your hubby is a disgusting piece of crap who doesn’t deserve anything from you!",
      "created_utc": 1729041186.0,
      "score": 1
    },
    {
      "id": "ls4tzmq",
      "body": "I am so sorry for your loss.  I truly hope you are able to somehow find your peace.",
      "created_utc": 1729041829.0,
      "score": 1
    },
    {
      "id": "ls4wcvj",
      "body": "Absolutely disgusting excuse for a husband and father. Im so so sorry for your loss OP, and for the bullshit you’ve had to deal from someone who is supposed to have your back and support you, as well. Much love your way",
      "created_utc": 1729042734.0,
      "score": 1
    },
    {
      "id": "ls4wlni",
      "body": "Find a terrific lawyer and divorce this guy immediately. He sounds awful.",
      "created_utc": 1729042828.0,
      "score": 1
    },
    {
      "id": "ls4yaxq",
      "body": "You can seek advice from a lawyer to confirm your situation in case of divorcie. Also find out if there are institutions where you live that provide help to women in your situation.\n\n\nYou are an incredible mother~ and may that excuse for a husband of yours have his penis fall off.",
      "created_utc": 1729043481.0,
      "score": 1
    },
    {
      "id": "ls50c4d",
      "body": "Divorce. But plan ahead. What he did is financial abuse. You had a full time on call job for the last 16 ish years. Dont sell yourself short. Take half of everything. Stay safe.",
      "created_utc": 1729044250.0,
      "score": 1
    },
    {
      "id": "ls51ju1",
      "body": "Go talk with a good divorce lawyer. They’ll tell you what all your options are. And if your kids are adults? That makes things so much easier for you\n\nI have some choice words for your husband I won’t use, but they are NOT lady-like to say the least",
      "created_utc": 1729044725.0,
      "score": 1
    },
    {
      "id": "ls51yqx",
      "body": "Your story really pulled me out of all my other worries tonight. I wish I could just hug you, mama to mama. I wish I could do something to take away some of your grief. I am just so sorry you lost your son. \n\nI dont even want to discuss the other part (which enrages me on your behalf as well as the rest of your family's). It's just so ugly, and there need to be more words spent that are kind and gentle about your beautiful son and the amazing fifteen years you had together in this world. Nothing will ever pull that angel from your side. You're an amazing mama, and you gave your son  a wonderful life, and I'm so sorry you have to go through this pain now. Your son's memory deserves to be cherished, the same way you cherished his life.",
      "created_utc": 1729044888.0,
      "score": 1
    },
    {
      "id": "ls54o23",
      "body": "This was gut-wrenching to read. So much love and power through the digital world to you. \n\nCan any of your adult children help you? Or friends? This would definitely be easier with allies.",
      "created_utc": 1729045966.0,
      "score": 1
    },
    {
      "id": "ls58fy7",
      "body": "divorce and take every dang penny you can from this man",
      "created_utc": 1729047517.0,
      "score": 1
    },
    {
      "id": "ls58zoo",
      "body": "I'm so sorry about your son OP. Screw your husband!!! Idk, maybe I shouldn't say that because maybe it was his way of grieving, but I think it's horrible that he barely helped , tricked your son into paying , and then spent the money that you asked him to put towards the house . If you can, start looking for a job ASAP & also sue him for alimony .",
      "created_utc": 1729047750.0,
      "score": 1
    },
    {
      "id": "ls59mr9",
      "body": "You mean ex-husband soon, right?",
      "created_utc": 1729048025.0,
      "score": 1
    },
    {
      "id": "ls5e5ld",
      "body": "I can’t even think of reading all the replies but feel so inclined to tell you how very sorry I am and for your pain. You DID not deserve that. Hugs from afar as I shed a tear.",
      "created_utc": 1729050059.0,
      "score": 1
    },
    {
      "id": "ls5ekq4",
      "body": "If in the US you can get certified (free classes) with the state medicaid dept and or MRDD. Pay is based on level of care are qualified and certified for. Feeding tubes, various equipment use, medication handling all would have you making quite a bit per hour.   \nAre your children adults now? Do they live away from home? Maybe one could temporarily house you. There aren't jobs tougher than the one you had 24/7 for 15 years. You crawled across the floor for your son so I hope you manage to crawl out of your trap for yourself. If alimony is possible where your from you would definitely qualify because you couldn't work in order to take care of your disabled child. I don't like to bring up the \"D\" word but I don't see how you will ever really forgive him.  \nWell wishes to you!",
      "created_utc": 1729050257.0,
      "score": 1
    },
    {
      "id": "ls5fvkv",
      "body": "NGL, head over to the Legal subreddit and ask some questions. You might be entitled to quite a bit once you divorce him.",
      "created_utc": 1729050875.0,
      "score": 1
    },
    {
      "id": "ls5gfx7",
      "body": "Yes OP looking into working at a DDID building, an adult daycare, a special needs daycare, a home health, sometimes people pay for you to come sit with their elderly relatives. You have experience. I can empathize with you as a special needs parent myself, that’s a lot of experience most people don’t have. Also I’m sorry for your loss. I’m sending you lots of love momma.",
      "created_utc": 1729051147.0,
      "score": 1
    },
    {
      "id": "ls5hbs4",
      "body": "Make sure that four Wheeler gets sold and the profits split during the divorce.",
      "created_utc": 1729051578.0,
      "score": 1
    },
    {
      "id": "ls5icpw",
      "body": "ohh.. what a worst dad he's..",
      "created_utc": 1729052095.0,
      "score": 1
    },
    {
      "id": "ls5q5hq",
      "body": "That's so sad. I'm sorry. You're so strong to be able to handle those years for your children. You've lived for your children and husband, now, live for yourself. 🙂",
      "created_utc": 1729056298.0,
      "score": 1
    },
    {
      "id": "ls5r7kx",
      "body": "He should be  ashamed of himself. He's mo kind of father",
      "created_utc": 1729056924.0,
      "score": 1
    },
    {
      "id": "ls61gn0",
      "body": "Omg, I feel your pain! What was your son’s diagnosis? My daughter has sanfilippo syndrome.",
      "created_utc": 1729063535.0,
      "score": 1
    },
    {
      "id": "ls6btrc",
      "body": "You’re not old. I got my degree at 40 and it’s gave me a good career. Take some positivity out of this sad situation and start building an independent life for yourself. I don’t know if you’re planning on ending your marriage or not, but your husband has shown himself to be unreliable and selfish so you need to get yourself in a position that you can cope if you find yourself alone. \n\nI’m sorry for your loss.",
      "created_utc": 1729070832.0,
      "score": 1
    },
    {
      "id": "ls73izb",
      "body": "TIL children can be covered by life insurance",
      "created_utc": 1729084828.0,
      "score": 1
    },
    {
      "id": "ls7mevo",
      "body": "Look into your local college & see if they have CNA programs. My local college has a lot of scholarships to help pay & you can complete it in less than 6 months! They make decent money since you're required to do a lot of dirty work. But you taking care of your son for 15 years might help to get a job even without work experience, combined with being his caretaker & a CNA you shouldn't agree too hard of a time finding a job depending on your areas needs",
      "created_utc": 1729091375.0,
      "score": 1
    },
    {
      "id": "ls8xuc0",
      "body": "I have no words. That man is evil",
      "created_utc": 1729106361.0,
      "score": 1
    },
    {
      "id": "ls91044",
      "body": "Your husband doesn't deserve you. He needs to find out what a douche he is. it is unforgivable how he wouldn't help and selfishly spent the insurance money.  My advice to you is squirrel away as much as you can to help you get out of there.  Remember in the divorce you need to sue for alimony. \nAs for work, there is a need for respite workers.\nTo sit with and care for people who are taking care of aging parents or sick family members.  They need a break, even if it to have a day out.\nYou are more than capable of doing that. I'm sorry for your loss. \nbest of luck to you.",
      "created_utc": 1729107371.0,
      "score": 1
    },
    {
      "id": "ls939j3",
      "body": "Ma’am, you should 100 percent leave his ass and take everything from him. You spent 15 years as a caregiver to your son. A job most ppl get paid for but you didn’t. That is enough for the courts to rule in your favor.",
      "created_utc": 1729108092.0,
      "score": 1
    },
    {
      "id": "ls93k5v",
      "body": "I’m so sorry for your loss and I wouldn’t forgive  him either he doesn’t deserve you. Please find a way to leave him.",
      "created_utc": 1729108184.0,
      "score": 1
    },
    {
      "id": "ls9dh18",
      "body": "Please don't waste the rest of your life with this heartless man. You have a heart of gold and you seem so loving, with so much to give. I'm so sorry for your loss and so sorry that life was tough on you at such a young age! Your son was very very lucky to have you ❤️\n\nYou have the rest of your beautiful life ahead of you that you deserve to live in joy, peace, and happy memories of your son and other kids. Please leave the man, claim half of everything, and work on starting your new life. One that you will build yourself, around beautiful people you choose to surround yourself with. You're not stuck, the second half of your life is just starting! ❤️",
      "created_utc": 1729111301.0,
      "score": 1
    },
    {
      "id": "ls9kfoz",
      "body": "🙏🙏🙏",
      "created_utc": 1729113542.0,
      "score": 1
    },
    {
      "id": "ls9un1s",
      "body": "I'm so so sorry for your loss.I pray for strength for you, not only to bear such loss, but also to leave such a horrible horrible man. \n\nIf you look on indeed, you'll see lots of companies and agencies are in need of healthcare assistants or support workers. It's a job that is in constant need of workers. You will fit into the special needs sub category and they often don't need any formal training before you start, they'll train you. Moreso, everyone has done some kind of caring, be it looking after a loved one, family member or friend. I believe you've got a good shot at become a carer. \nPolish your résumé (use A.I or any resume builder to help give ideas). Get a good indeed and linkedin profile based on your experience caring for your son and write a good story on LinkedIn to help boost your profile. You've got this! I wish you all the very best.",
      "created_utc": 1729117062.0,
      "score": 1
    },
    {
      "id": "lsa1azq",
      "body": "I am so very, very sorry for your loss. What an amazing and loving mother you have been, especially with no help from your husband/child. SHAME ON HIM and his selfishness. Just reading about his behavior sickens and disgusts me!  Thankfully your son knew you would always be there for him and that he was loved. Taking care of someone with severe special needs 24/7 takes lots of patience, strength-both physically and mentally- and much love. I do know how difficult it can be as my husband became completely paralyzed from Multiple Sclerosis at the age of 27. I had three little boys 5 and under, with zero help from my family, and barely any from his. His parents would come by every two weeks to visit and would criticize everything single thing I did. I had six siblings and he had three sisters, with not one of them ever offering to help. Keep in mind that both families lived less than forty minutes from my home. His monthly Social Security Disability wasn’t nearly enough to pay bills and feed my family so I worked two part time jobs - one for three hours during the day, and one for four hours after midnight as I couldn’t leave him for more than a few hours. What always pissed me off was that his parents were fairly wealthy and had retired at the age of 53, yet had never once offered financial help. My husband was their only son and very much their pride and joy, the Golden Child. Like you, I severely injured my back, I could barely even walk for three weeks, but taking care of myself wasn’t even an option. So, if anyone knows just how difficult it has been for you I do!\n\nAs far as your work history - you have gained so much knowledge and experience as a care taker, you’re dedicated and driven, you persevere when the going gets tough, and what you’ve learned in the medical field is priceless. All of these facts and traits should make any potential employer interested in hiring you.  They’ll be lucky to have you!\n\nI wish only the best that life has to offer you, and I hope that you move on and are able to find peace and happiness - you deserve it.",
      "created_utc": 1729119517.0,
      "score": 1
    },
    {
      "id": "lsabndx",
      "body": "God bless you. You are truly amazing. I am sorry for your loss. I hope things get better for you and you divorce that guy. You undoubtedly deserve better.",
      "created_utc": 1729123414.0,
      "score": 1
    },
    {
      "id": "lsaofcw",
      "body": "Don’t forgive him. Divorce him.",
      "created_utc": 1729128291.0,
      "score": 1
    },
    {
      "id": "lsap5ax",
      "body": "Everything you did for your son can be added as experience towards getting a job. I think you should consider becoming a certified nurse aide (CNA) if that’s possible for you to do. Some hospitals/nursing homes will literally pay for your schooling if you work with them for a certain amount of time after graduation. These programs can also be a couple of weeks to months, depending on your needs. Maybe your adult children can also help you out. You seem like such a loving and caring mother. There are mothers out there that would love to have you as a healthcare provider bc you may understand a lot of what they’re also experiencing.",
      "created_utc": 1729128566.0,
      "score": 1
    },
    {
      "id": "lsaw169",
      "body": "You would get a job easily as a support person or in personal care. The field urgently needs amazing people like you. You have heaps of experience. Not only your care experience, you have raised your children and been there selflessly for your children. You are posting on Reddit so you have great computer skills ( lots of people do not). You have heaps of experience. You got this! Leave this man!",
      "created_utc": 1729131203.0,
      "score": 1
    },
    {
      "id": "lsb2pok",
      "body": "I’m so sorry for your loss. I’m sure it helps to know you gave your son the best care and life he could have had. He knew he was loved. ❤️💔\nI would not be able to forgive my husband either with the way yours behaved.",
      "created_utc": 1729133889.0,
      "score": 1
    },
    {
      "id": "lsb5sln",
      "body": "please leave this awful man please please",
      "created_utc": 1729135211.0,
      "score": 1
    },
    {
      "id": "lsbox6m",
      "body": "It's pretty easy to get your CNA and or your HHA license. Everything you did for your son is work experience and would be really well received when applying for jobs in those professions. Your husband sounds like a real asshole, and I'm sorry that you were the sole caregiver to your son for all of those years. It's not an easy thing to do to care for someone 24/7.",
      "created_utc": 1729145277.0,
      "score": 1
    },
    {
      "id": "lsbq7mw",
      "body": "My sisters a caregiver, been for a few years. She is in the states and all she needs to do each year is exams to make sure she knows what she is doing and what she needs to do for her patients. Before this, she worked at goodwill. She was technically unqualified. You have this experience of being a caregiver. You can get a job. You can get out of this marriage. Good luck with everything. O also my husband was a caregiver in the uk at a nursing home. His job before that was working with military equipment. You got this!",
      "created_utc": 1729146093.0,
      "score": 1
    },
    {
      "id": "lsbu4bn",
      "body": "Man fuck him.amd his attitude. Leave him and take him for whatever he has. ",
      "created_utc": 1729148604.0,
      "score": 1
    },
    {
      "id": "lsbvsct",
      "body": "You are too sweet to be with that man",
      "created_utc": 1729149726.0,
      "score": 1
    },
    {
      "id": "lsbwtbr",
      "body": "I'm so sorry for your loss OP. \n\nAnd I am so sorry you have to deal with such cold, indifferent cruelty from your husband. I'm with all the commenters who suggest finding a lawyer and a way out. My mum always says \"where there is a will there is a way\" and I think you've got this. You do have a wealth of experience as a carer, and as a mum, which is valuable. You probably have good knowledge of medical info, and understanding of various medical organisations and what you need to do to access equipment, funding etc. \n\nMay I suggest writing down all of the things you know how to do, as a starting point for creating a CV? Even things you think are insignificant. \n\nIn my country there are places where you can get help writing CV's, and prepping for job applications, I'm not sure if that exists where you are, but maybe that is something to look into? There are also online resources for this where you can input your knowledge and interests etc, and it will give you suggested career paths and requirements.\n\nPerhaps you can find a local grief support group? or a women's group? You could also inquire with a support group for parents of children with disabilities who might be able to help you find appropriate support. ( You may have such a group already, but I thought I'd suggest a support group)\n\nI believe you can find work, and you can find a way to resolve your situation. All the best.",
      "created_utc": 1729150430.0,
      "score": 1
    },
    {
      "id": "lszxley",
      "body": "I think you should go to school to be in a managerial position for a nursing home I know being a caregiver is what you've done for so many years but perhaps you need a break while still being near caretakers it's a good position with good pay and you can help a lot of people and help plan things for the nursing home even events ect I believe",
      "created_utc": 1729514952.0,
      "score": 1
    },
    {
      "id": "lt7aw2n",
      "body": "I'd venture to say that you have 15 years of solid care-taker experience.\n\n\nGo that route since it's what you know.\n\n\nAnd divorce your worthless husband.",
      "created_utc": 1729617554.0,
      "score": 1
    },
    {
      "id": "lupjm75",
      "body": "I'm not going to assume you're in the United states. Whatever country you're in, please see an attorney and find out what your options might be. \n\n\nYou gave your life to others. Your story made me cry. No one should have to be with someone as unfeeling and heartless as your husband. \n\n\nYou deserve some peace and happiness. I would urge you to also reach out to your adult children and talk to them. \n\n\nYou used to being strong and being the one who helps everyone. But it's okay to lean on others. Please talk to your kids. Please talk to an attorney. \n\n\nI'm praying for you \nI'm so sorry about your loss \n\n\nThere's some things that can't be forgiven and I think your husband has crossed that line",
      "created_utc": 1730388370.0,
      "score": 1
    },
    {
      "id": "lv6r96u",
      "body": "My wife has been bartending for a few years and was going to college for dental hygiene. She switched her major to help autistic kids because she had a change of heart when we found out our 8 year old is severely autistic and our 4 year old shows signs, even though the new career pays a lot less initially. She is going for an entry level position but is saying she doesn't have experience in the field and she's not sure how her current job of bartending will correlate to healthcare, even though she got her LPN or RN (I forget which one because I get them mixed up) 12 years ago and was a vet technician for years. I told her \"You have 8 years experience taking care of a severely autistic person through various stages; as a newborn, infant, toddler, and young child.\" In my opinion, it's better than a fresh green college graduate who has never dealt with an autistic child, let alone have a child of their own. It's real world firsthand experience, and you have well over a decade. Look into your options. Find a career path that you can jump into. Tell your story at the interview. It's ok to get on a personal level with the interviewer. Dealing with special needs kids is extremely taxing, but if you can do that for so long, you can achieve anything. I saw your story on YouTube, felt so bad, and wanted to let you know that you are capable of anything and once you get that in your head, you are no longer stuck.",
      "created_utc": 1730646465.0,
      "score": 1
    },
    {
      "id": "lv89ij5",
      "body": "Please get away from this horrible man.  You owe that to yourself and your son.  You were his light and gave him so much of yourself.  He wouldn't want you to suffer another moment being married to this selfish ogre.",
      "created_utc": 1730662871.0,
      "score": 1
    },
    {
      "id": "lwpc14y",
      "body": "Expose and divorce him",
      "created_utc": 1731387150.0,
      "score": 1
    },
    {
      "id": "lxu9qqq",
      "body": "I know reddit says this a lot, but you need to RUN from this man as fast as humanly possible and talk to a divorce lawyer IMMEDIATELY. I'm so sorry for your loss.",
      "created_utc": 1731972907.0,
      "score": 1
    },
    {
      "id": "m3ov6rf",
      "body": "Divorce him and move with a friend or relative you don’t need that scumbag in your life",
      "created_utc": 1735098355.0,
      "score": 1
    },
    {
      "id": "m6ryqob",
      "body": "I am so sorry for your loss.  Are you in the US?  If you are, and you are up to it, try to turn your experience into a job.  You have a wealth of knowledge because you have experienced loving and caring for a special needs child first hand.  New parents of a special needs child would love to benefit from your knowledge.  I work in social services.  Too often parents take the out-of-home option, but you didn't.  I am sure it gave your son an amazing quality of life.  Once you get on your feet, make the decision that you ultimately know you need to make.  I bet you are entitled to half the marital assets and spousal support.  If you have other children, throw child support in there too.",
      "created_utc": 1736703883.0,
      "score": 1
    },
    {
      "id": "ls6hr3q",
      "body": "Well you married the wrong person, don't you have friends or to host you temporarily? Or your sons?",
      "created_utc": 1729074680.0,
      "score": -4
    },
    {
      "id": "ls5cluu",
      "body": " Z   \n  \n.wlisojmjd zfftd",
      "created_utc": 1729049345.0,
      "score": -4
    },
    {
      "id": "ls4a1iv",
      "body": "Jumping off this thought, maybe look into becoming a Personal Care Assistant. My best friend does this and is considered “unskilled” since she doesn’t have a degree. She had no work history for over a decade since she was a SAHM, but was able to find a way into industry because of the skills she got being a mom. And you cared for your son in a much more relevant way than she did caring for her non disabled child. The work you did caring for your children is work and you can tailor a resume to reflect all the very real skills learned on the job. You have managed schedules, planned events, maintained your household, navigated your way through the healthcare system. It’s all in how you frame it.",
      "created_utc": 1729034335.0,
      "score": 1723
    },
    {
      "id": "ls4ei1e",
      "body": "Aged care is a growing area that gets a lot of government subsidies for training (in my country anyway)",
      "created_utc": 1729036032.0,
      "score": 79
    },
    {
      "id": "ls4v0lx",
      "body": "This is what I do for a living... I have no degree or licenses or certifications and I dont have any children. I had zero experience. Please, do this. People like you are very much needed in this field.",
      "created_utc": 1729042219.0,
      "score": 60
    },
    {
      "id": "ls7np6w",
      "body": "First, I want to say I’m so sorry for your loss. Your son seems like such a wonderful soul filled with joy and light and he was so lucky to be raised by a mother like yourself. I’m a Doctor of Physical Therapy but I can’t work anymore due to becoming disabled (I have over 20 chronic illnesses most related to having a connective tissue disorder) and there are so many jobs that people don’t know exist that you are 100% qualified for! You can work as a personal care assistant in a person’s home, nursing home, group home, etc., a rehab aid (you assist physical and occupational therapists from the outpatient to hospital to SNF settings). If you want to go to school at a community college for 6ish weeks you can become a CNA but this type of work is physically demanding; you can go to school for 8-9ish months and become a medical assistant which doesn’t require you to lift and do transfers, dress, etc. patients. Assisted living homes have positions called recreational/activities directors where you organize and choose various fun activities, games and events for residents (think of the people who lead bingo with residents). You can also work in a school and be a teaching assistant/aid but this may be too difficult and close to home as you’re helping disabled students often one-on-one. \n\n\nA different option for jobs you qualify for is working on “the other side” of healthcare aka working for an insurance company or disability services. This would be something you’re very familiar with and I think you’d also be a perfect job candidate. Insurance companies have care coordinators where you’re matched with families to help find doctors and services that would benefit them to see, help get people coverage for assistive devices like wheelchairs, walkers, etc., but you could also just be a regular insurance agent. Similarly, you could work in a disability service office where jobs consist of aiding them in applying for disability to organizing group activities people can come and participate in and/or teach people with a disability how to do various tasks (i.e. operate computers, find transportation, etc.). You can even become an office manager/secretary at a doctor’s office or physical/occupational therapy, SLP, psychologist office. \n\n\nI recommend reaching out to your son’s nurse because she may have some recommendations for jobs you qualify for. You can also use her as a job reference on your resume. The thing to make sure you do is do an excellent job writing a cover letter to submit with your resume where you can write the various day to day tasks you’ve done caring for your son. Make sure you include in your work history: personal care giver: (years X-X) provided care for disabled son tasks included… and house manager (or different title): (years X-X) then include a brief description (I’m sure you or someone else would have a better “action words” list (I.e. managed…(ex. finances, organized family schedules), completed household maintenance, etc). \n\n\nYou’re in your early 40s you’re still young so don’t give up hope for your future. I’m so sorry for the lack of support you received from your husband. I agree with other commenters you should consult with a lawyer (many have short, free consultations) because with the length you’ve been married you qualify for alimony. Grief counseling with a therapist would be really beneficial if you aren’t in it already so you have someone to talk to openly during this time.",
      "created_utc": 1729091794.0,
      "score": 22
    },
    {
      "id": "ls52h3s",
      "body": "Yes and you can put family caregiver on a resume!",
      "created_utc": 1729045090.0,
      "score": 15
    },
    {
      "id": "ls5tfdf",
      "body": "I’m not sure where you’re based OP, but in the UK there is always a demand for health care assistants and they will take on absolutely anybody most of the time, no experience needed. This may be similar in other countries as well. It may not be a career that you’re eager to jump into which is understandable but it’s just a suggestion. I hope this helps, keep your head up and I’m sorry for the loss of your son",
      "created_utc": 1729058274.0,
      "score": 16
    },
    {
      "id": "ls5fsyr",
      "body": "Also want to add in that even though you weren’t on the policy depending on what state you live in you were entitled to half of the money. You may be able to request it back in the divorce.",
      "created_utc": 1729050840.0,
      "score": 24
    },
    {
      "id": "ls69qy0",
      "body": "Seconding this, my dad is old enough that he needs help with many tasks but not old enough that he needs a specialised nurse. Me and my brother make sure his meds are correctly separated into the daily containers for the whole week. He lives next door to my brother which is a blessing.  We hired a person with no official work history or special degree to keep an eye on him a couple of days a week. This person cooks him a few meals, makes sure he took the meds we organised for him, opens the gate for the physiotherapist appointments etc. And most importantly, keeps him company during the day. Her experience caring for her Alzheimer dad was what sealed the deal for us among other people we interviewed because my dad has quite a temper and we needed someone patient enough. I'm positive lots of people would hire OP.",
      "created_utc": 1729069367.0,
      "score": 12
    },
    {
      "id": "ls8sm34",
      "body": "Don’t rely on that. Spouse support doesn’t exist everywhere. For her sake I hope that it does, but she shouldn’t put all of her eggs in one basket",
      "created_utc": 1729104705.0,
      "score": 2
    },
    {
      "id": "ls9ybjl",
      "body": "Great comments about work experience because that really is relevant experience, but know that not all places have spousal maintenance after divorce. OP should discuss things with an attorney in her jurisdiction.",
      "created_utc": 1729118417.0,
      "score": 2
    },
    {
      "id": "luehm2o",
      "body": "Girl you are not trapped. Get that spousal maintenance and get away. I'm so sorry for your loss, and the suffering your empty empty husband put you through for years. You deserve to be treated with the same amount of care and compassion that you gave your son for 15 years.",
      "created_utc": 1730231161.0,
      "score": 1
    },
    {
      "id": "ls51ybf",
      "body": "Thousands of dollars in court fees and 5 years later \"Yea im finally back on track...kinda\" and then the dead beat husband doesn't actually pay anything and boom now you are homeless.",
      "created_utc": 1729044883.0,
      "score": -27
    },
    {
      "id": "ls48ezr",
      "body": "I hope he has to sell the bike. What an asshole",
      "created_utc": 1729033724.0,
      "score": 338
    },
    {
      "id": "ls43sii",
      "body": "That’s heartbreaking OP. \n\nHow do you get money from the government???",
      "created_utc": 1729032006.0,
      "score": 119
    },
    {
      "id": "ls4kut5",
      "body": "If she's in the US, it's not so simple. Welfare is generally only available to those with minor children and unemployment is only available to those who have had a job recently from which they've been terminated/laid off (made redundant in UK terms). It sounds like OPs children are adults now and she hasn't had a job outside the home in over 20 years.",
      "created_utc": 1729038402.0,
      "score": 40
    },
    {
      "id": "ls6kwnr",
      "body": "She should claim money from her husband in the first place ",
      "created_utc": 1729076487.0,
      "score": 3
    },
    {
      "id": "ls8qu99",
      "body": "And if there’s something you’d like to do, you can probably get help to get an education.",
      "created_utc": 1729104149.0,
      "score": 1
    },
    {
      "id": "ls5cuxi",
      "body": "I second OP seeing if she can go back to school for a job she wants to do—even if it’s unrelated to caregiving. \n\nAlso thank you for choosing your career—it is such an important job. During two hospital stays in my life I don’t remember anyone except for the names of a few nurses who made the experience bearable! It meant so much.",
      "created_utc": 1729049461.0,
      "score": 40
    },
    {
      "id": "ls4x5jr",
      "body": "Congratulations to you! My daughter is going to UCONN(University of Connecticut) for nursing. She is in her 2nd year. There is nothing more noble is to help others when they need it most! Good luck to you!",
      "created_utc": 1729043041.0,
      "score": 46
    },
    {
      "id": "lyemdsg",
      "body": "Yeah op ditch him. He is just a black hole at this point. And quite frankly you deserve better after your son died your son would be happy for living your life without your husband.",
      "created_utc": 1732278979.0,
      "score": 1
    },
    {
      "id": "ls4bb3x",
      "body": "They act like that because they *think* their wives feel trapped and can’t leave. They think they can get away with it.",
      "created_utc": 1729034815.0,
      "score": 90
    },
    {
      "id": "ls4gsxd",
      "body": "I second this!!!",
      "created_utc": 1729036893.0,
      "score": 10
    },
    {
      "id": "ls4mgkn",
      "body": "And don't forget about alimony, OP. You would probably qualify for that as well.",
      "created_utc": 1729038991.0,
      "score": 42
    },
    {
      "id": "ls4eb07",
      "body": "Most all jobs are only about applying online (at least in the usa). The days of going into a place asking for a job and getting hired are over for a long time - but places DO exist. They'll let you know what their app process is when calling them.",
      "created_utc": 1729035958.0,
      "score": 37
    },
    {
      "id": "ls4brcl",
      "body": "remember you deserve to be happy and healthy. keep this in mind. you’re 41; you have an entire beautiful life ahead of you. spend it peacefully and happily.",
      "created_utc": 1729034986.0,
      "score": 8
    },
    {
      "id": "lu7y69w",
      "body": "Happy (belated) birthday.\n\n\nI’m glad you were born.",
      "created_utc": 1730141311.0,
      "score": 2
    },
    {
      "id": "ls7ihow",
      "body": "[removed]",
      "created_utc": 1729090094.0,
      "score": 2
    },
    {
      "id": "lsa2lde",
      "body": " Several kids under 18 and one that is just turning 18\nIt's hard to make another big change so soon after losing my son, I'm worried that it would hurt the kids to much if I changed things so drastically right now",
      "created_utc": 1729120000.0,
      "score": 6
    },
    {
      "id": "lsdcop4",
      "body": "I wish I could, the closest nursing school is almost 2 hours from where I live and I still have small kids at home....",
      "created_utc": 1729176321.0,
      "score": 1
    },
    {
      "id": "luciwof",
      "body": "Thank you so much. I've started taking baby steps in that direction. I had a job interview at the restaurant my oldest works at. I start Saturday. I will be working weekends to start off with as I'm home with the kids during the week. (I homeschool them and right now they don't want to change that so soon after losing their brother) \nMy older children have also told me that when I'm ready they want to help me get on my feet apart from their dad.",
      "created_utc": 1730209437.0,
      "score": 4
    },
    {
      "id": "ls54mg5",
      "body": "Tons of people would love to hire someone with your experience. \n\nIf there were ever a time for Reddit to say this tired trope- this is it. DUMP THAT ASS HAT and get the alimony you deserve. I’m not a fan of alimony in all cases but this is clearly indicated here.",
      "created_utc": 1729045948.0,
      "score": 630
    },
    {
      "id": "ls50wbq",
      "body": "Yes! Adding to this, I work as a caregiver, or Home Care Aid, and I make a decent living(not fantastic but I get by) and I had no experience prior to this, I was just looking to pay my way through school. It can be a very rewarding job and you definitely have more experience than a lot of people starting out in this field. There’s always a need, just look on indeed under caregiver and research the company/agency to make sure they’re a good fit.",
      "created_utc": 1729044469.0,
      "score": 130
    },
    {
      "id": "ls4qgim",
      "body": "Seconding this.\n\nMy friend does some of this work for my mother, and the facility is always offering more hours, with training.",
      "created_utc": 1729040478.0,
      "score": 101
    },
    {
      "id": "ls4cmst",
      "body": "Great suggestion!  I’ve also seen where it’s called a “companion”.",
      "created_utc": 1729035321.0,
      "score": 227
    },
    {
      "id": "ls5ivso",
      "body": "Yesss! This! I do the hiring at my job where we work with high risk youth, and I hire individuals without paid experience all the time. I'd rather hire something with experience like this, than say a degree in psych, which is what we often see with our applicants. In fact, even the adult side of our organization hires for the personal care positions without paid experience.",
      "created_utc": 1729052363.0,
      "score": 38
    },
    {
      "id": "ls63jh0",
      "body": "I would also like to add, as a care worker this would be a great opportunity for you because of the skills and empathy that you have.  Get the support from your husband (financially), get away from him, enjoy your family and your new freedom lovely lady.",
      "created_utc": 1729064991.0,
      "score": 28
    },
    {
      "id": "ls5brb4",
      "body": "If I were in that situation I’m not sure if I could handle doing something similar for someone else because it would remind me of my son who passed away. \n\nAnd she obviously had some physical issues but would do it anyway for her son. It may not be the best chords for OP mentally or physically.\n\nSometimes women end up being caretakers for their families due to no other choice, but then  it’s seen as their only skill set so they are stuck doing it for strangers when it’s not something they would ever have chosen to do in the first place, but then are stuck doing it forever.\n\nI totally get it’s a suggestion and I’m probably over thinking it.",
      "created_utc": 1729048962.0,
      "score": 96
    },
    {
      "id": "ls64s7m",
      "body": "Gosh reading this makes me think of all the ads I see looking for decent caring help with special needs children.\nYour husband is a breed of his own.",
      "created_utc": 1729065880.0,
      "score": 16
    },
    {
      "id": "ls73i7p",
      "body": "Depending where you are, they are also called Direct Support Professionals - helping people with ID/DD.  I used to hire for the role and would jump on someone with years of experience.  OP, I am so sorry for the loss of your son.",
      "created_utc": 1729084820.0,
      "score": 9
    },
    {
      "id": "ls8ix33",
      "body": "My roommate was a full-time caregiver for his quadriplegic girlfriend for 26 years.   She passed away and is now working at a local hospital as an assistant in the inpatient rehabilitation unit.   Good pay, full benefits, and ongoing education. \n\nYour experience is quite valuable.",
      "created_utc": 1729101655.0,
      "score": 3
    },
    {
      "id": "ls8l6yp",
      "body": "Sounds like this would fit pretty well",
      "created_utc": 1729102367.0,
      "score": 1
    },
    {
      "id": "lsaa4yo",
      "body": "Also end of life care. OP can get paid big money to help parents cope with the end of life of child. She’s live it after all.",
      "created_utc": 1729122836.0,
      "score": 1
    },
    {
      "id": "lsfwzry",
      "body": "I'm not sure if losing her lad is good for mum to be caring for others, what about allowing her time to greive, caregiving is physically and emotionally draining. Greive your dad, think about what you want to do about your selfish husband. Find the right path for you. Take care of yourself 1st x",
      "created_utc": 1729206378.0,
      "score": 1
    },
    {
      "id": "ls8zo3w",
      "body": "That's why I said she should talk to a divorce lawyer, they can tell her what she's entitled to after the divorce. For instance she's probably entitled to half of the matrimonial assets. \nAnd that's also why I told her, she could use her experience as a non-paid care giver, to find a job for herself so she can be financially independent.",
      "created_utc": 1729106942.0,
      "score": 3
    },
    {
      "id": "lsa1haj",
      "body": "I absolutely agree. I shouldn't have stated the part about OP being entitled to spousel maintenance as a fact, I should have said she might be entitled to spousel maintenance and that she should talk to a attorney to find out exactly what she would be entitled to after divorce.",
      "created_utc": 1729119580.0,
      "score": 2
    },
    {
      "id": "ls4akyz",
      "body": "Take the bike in the divorce. Sell it, take your other kids on a much-needed vacation or do what you had originally intended to do with it.",
      "created_utc": 1729034537.0,
      "score": 231
    },
    {
      "id": "lscz9qz",
      "body": "When she mentioned that he was talking about buying a bike AN HOUR after his death, I knew for sure that he never loved his son. It was obvious enough from the fact that he never cared for him when he lived, but this is just the icing on the fucking cake.",
      "created_utc": 1729171659.0,
      "score": 2
    },
    {
      "id": "ls43zz1",
      "body": "Idk how it works but here in the UK you can claim money of the government if your unemployed and have disabled children or if you just have children you can get some money off of the gov",
      "created_utc": 1729032082.0,
      "score": 132
    },
    {
      "id": "ls4447u",
      "body": "I'm not to educated on it as a 31 backwards year old tbh this is a major simplification",
      "created_utc": 1729032128.0,
      "score": 9
    },
    {
      "id": "ls529yo",
      "body": "Easy, you tell them you have no job and them boom you get 300$ a month for food and free health insurance. Then you do a housing application and get a section 8 apartment that is based on your income. Then you do utility assistance that pays for all your utility bills. Finally you get a part time job that requires minimal effort and that pays for your rent and booze.",
      "created_utc": 1729045010.0,
      "score": -43
    },
    {
      "id": "ls533ah",
      "body": "This is not true at all. I quit my job and applied for food stamps and medicare the next day and was approved. Literally all you have to say is \"I have no job\" and you will get accepted immediately. This is coming from a single 31 year old male that has no dependants. Yes you cannot get unemployment but you can get assistance with basically all of your needs, rent, utilities, food, medical. Yea if you want to own a car or have money to go out to eat you need a job but other than that the government will basically cover everything if you just say you don't currently have employment.  I've been on food stamps for 6 months so far and no one has asked for any update on my work endeavors or anything.",
      "created_utc": 1729045334.0,
      "score": -13
    },
    {
      "id": "ls5eoac",
      "body": "Great school! I graduated from there with the same degree many years ago!",
      "created_utc": 1729050304.0,
      "score": 10
    },
    {
      "id": "lsatjbm",
      "body": "But they make things harder for her and for himself\n\nIt’s interestingly wild how he could delude himself so much to think that it’s a better idea to string her along like that than be genuine, more heartfelt, and caring.",
      "created_utc": 1729130253.0,
      "score": 1
    },
    {
      "id": "ls4i8it",
      "body": "Where i live atm its about the only way to actually get a job these days weirdly enough lol. We have a massive job shortage here (new zealand) and online applications often receive hundreds of applicants. People who walk in show initiative, a lot of places dont advertise their positions. I actually got my job by walking in 5 years ago. I walked around town going into anywhere and everywhere asking if they had work. 3 places said they did. One of them is where i am currently. We arent advertising but we also need another worker, with the amount of people coming in asking for work we'll find one easily without advertising for the role.\n\nFor OP i think this is their best way to break into the job market cause their cv will not look good, but its clear they could do the work.\nDoing both walking in and online applications would be the best way though, try all avenues.",
      "created_utc": 1729037431.0,
      "score": 7
    },
    {
      "id": "ls7lfo9",
      "body": "Probably not, but it’s a pathway to finding work. It IS experience. I’m not sure what they were doing prior to having to be a full time caregiver, but it would provide a bridge to explain the employment gap and possibly allow her to work her way back into her previous career.",
      "created_utc": 1729091054.0,
      "score": 2
    },
    {
      "id": "lsa81i2",
      "body": "No. I would be impressed with my mom. Not only did he take the money for himself, but he stole from your other child while disrespecting your late son. You would show your children that they and you deserve better and that they shouldn't allow anyone to treat them like that. I'm so sorry for your loss and your situation, but you will do yourself and your children a favour by leaving. They might not see it today (I think they will but I don't know them) but I know they will thank you one day.\n\nI watched my mother-in-law leave a piece of shit this year and have never been more inspired. It was very powerful to watch her say \"hell no! I'm not dealing with this shit again\". She has bad taste in men and had just gotten out of a bad relationship before she met this poor excuse of a man. I was so proud of her and it was amazing to see her stand up for herself and I found myself thinking \"if she can do that I can do this\". And I'm +35! This would make an ever bigger impact on me if I was younger.\n\nIt's so unfair that he is doing this to you when all you should do is mourning you loss but use the anger to kick his ass. Talk to a lawyer. He might not have had the right to use the money like that if you are married.",
      "created_utc": 1729122049.0,
      "score": 9
    },
    {
      "id": "lsbymb3",
      "body": "Your kids know how he treats you. They saw, that YOU were there when needed and that HE is a deadbeat. Kids notice how their mom is treated!\n\nMy parents divorced when I was 9. I was a little afraid for a few days, because I didn't know what will be coming, but after that I saw my mom as a hero! I heard them fighting, even if they only did it at night when we were \"sleeping\". I knew she wasn't treated well. I knew she had to do it. She was a stay at home mom too and I knew it would be hard for her to afford the life we had.\n\nI truely love her for what she did and I NEVER thought it's HER fault. I always knew who was the bad one, even in my teenage years, when I hated everyone anyway 😅",
      "created_utc": 1729151700.0,
      "score": 5
    },
    {
      "id": "lsdb45y",
      "body": "My condolences on the loss of your son. \n\nIf you’re not up to the change at this very moment, that is one thing… but it’s already hurting your kids to see you going through this without your husband’s support.",
      "created_utc": 1729175808.0,
      "score": 2
    },
    {
      "id": "lvfk7k5",
      "body": "This. I know a lot of people get backlash when they say it's time to end the relationship but in some cases it is genuinely the best option.",
      "created_utc": 1730762125.0,
      "score": 2
    },
    {
      "id": "ls5q3fd",
      "body": "I think that’s a completely valid way to feel. I had that thought after I posted my comment and would absolutely understand if it wasn’t something that OP or anyone in her situation would want to do. More, I just wanted to empower her to know that there are options out there. I’m certain this isn’t the only one, it’s just the only one I thought of.\n\nFWIW, my friend doesn’t do anywhere near the amount of caretaking that’s talked about here. She works with elderly folks with mild to moderate disability, including cognitive impairment. She mostly does errands, like grocery shopping and going to the pharmacy, does some housework, keeps them company, and helps them continue to live independently for as long as they can. It’s my friend’s ability to treat them as a whole human being, rather than just their disability or treating them like a burden, that makes her exceptionally good at her job.",
      "created_utc": 1729056263.0,
      "score": 47
    },
    {
      "id": "ls8p7u6",
      "body": "I totally understand what you are saying. It doesn't have to be similar work, she could look into for instance as an office manager at a care facility. She has experience with the carefield, she has been managing all the appointments and care for her son. \nShe could talk with a career counselling professional, they could help her figure out what all her options are and what she would like etc.\nYou are never stuck doing something for ever if you don't like it. You can always change your career, it isn't easy but it's absolutely possible.",
      "created_utc": 1729103644.0,
      "score": 8
    },
    {
      "id": "lsfx2lr",
      "body": "Lad not dad",
      "created_utc": 1729206408.0,
      "score": 1
    },
    {
      "id": "ls4bl9k",
      "body": "[removed]",
      "created_utc": 1729034921.0,
      "score": -168
    },
    {
      "id": "ls57gnw",
      "body": "[removed]",
      "created_utc": 1729047106.0,
      "score": 12
    },
    {
      "id": "ls5etlz",
      "body": "You didn’t get Medicare, which is only applicable to people over 65 or disabled. \n\nYou received Medicaid because your state offers it based off of income. This varies from state to state.",
      "created_utc": 1729050373.0,
      "score": 18
    },
    {
      "id": "ls55li2",
      "body": "It varies by state, but most states require that you have a minor child living at home.",
      "created_utc": 1729046343.0,
      "score": 6
    },
    {
      "id": "ls6hunm",
      "body": "Whyd you quit your job",
      "created_utc": 1729074739.0,
      "score": 2
    },
    {
      "id": "ls7lx2x",
      "body": "True, there are probably many jobs like that with not a lot of physical activity. I just know OP has other kids they cared for as well. \n\nI’m probably just projecting because I find being a mom exhausting & I only have one child (I do work outside the home too though). I feel tired for OP and wish she could get away from her husband and be able to find something fulfilling and get some rest too.",
      "created_utc": 1729091214.0,
      "score": 11
    },
    {
      "id": "ls4bre9",
      "body": "Is it not called universal credit? And sure she could claim dla",
      "created_utc": 1729034987.0,
      "score": 49
    },
    {
      "id": "ls58v4j",
      "body": "I have lived in poverty my entire life and my mom lives in section 8 so I have little sympathy. I am in the same boat as a lot of people. I personally am happy with my life. I have food, a roof, and a computer. Literally all I need. I have no desire for anything else. Yes section 8 has a long wait period but everything else I said you can get almost instantly here in MA.",
      "created_utc": 1729047697.0,
      "score": -23
    },
    {
      "id": "ls5i7kf",
      "body": "Sorry you may be correct idk. I live in MA and have masshealth which covers 90% of all my medical and dental needs. The word might be wrong but the statement is still valid. At my last job making 60k a year (i know not a lot but still) with their health insurance I was spending 300$ a month and still had to pay out of pocket for prescriptions and doctor visits. With Masshealth everything is free..Working side gigs and collecting is honestly saving me more money than i was able to save working full time with no assistance... The exact reason I truly believe there should be a universal basic income.",
      "created_utc": 1729052024.0,
      "score": -1
    },
    {
      "id": "lxz497l",
      "body": "Based on his post history so he could stay home to play video games and smoke weed. He also has a budget of up to $400 for a chair while collecting government benefits",
      "created_utc": 1732044007.0,
      "score": 1
    },
    {
      "id": "ls4hf7w",
      "body": "In Australia there is a carer's allowance for people that are caring for a family member with significant disabilities or illness. There is also a national disability scheme that provides a set amount of funding each year if the person qualified. It can cover the cost of some of the individual needs of the recipient .",
      "created_utc": 1729037125.0,
      "score": 24
    },
    {
      "id": "ls4bz3v",
      "body": "I think the American term is that, but in the UK It's called jobseekers allowance (At least it was when I lived in the UK 16-17 years ago). Each country will slightly change the term, with the same principle.",
      "created_utc": 1729035067.0,
      "score": -27
    },
    {
      "id": "ls7ie3d",
      "body": "Yes because Massachusetts is a commonwealth state. So you pay a lot in taxes but also get better social services. Don’t try this in Texas.",
      "created_utc": 1729090061.0,
      "score": 6
    },
    {
      "id": "ls4cabb",
      "body": "I currently live in the UK I think it used to be job seekers and now it's universal credit",
      "created_utc": 1729035188.0,
      "score": 34
    },
    {
      "id": "ls4enib",
      "body": "It changed to universal credit a few years ago. I think a lot of benefits just merged into one to form universal credit.",
      "created_utc": 1729036089.0,
      "score": 21
    },
    {
      "id": "ls4fygb",
      "body": "Yeah, that’s right. It’s Universal Credit and then that leads to other benefits as appropriate.",
      "created_utc": 1729036573.0,
      "score": 10
    }
  ]
}