{
  "id": "1koe9te",
  "title": "Update: My husband was arrested this morning.",
  "selftext": "Thank you to everyone who read my first post and offered support. It feels like I’m living a nightmare. A lot more has happened, so I wanted to post an update.\n\nThe day I posted, they took my sister to the police. She admitted that the “relationship” with my husband began when she was 15. She also said things became physical when she was 16. They had exchanged inappropriate messages and images, and the content on her phone matched everything she told them. My soon to be ex knew she was pregnant. He was arrested at his job earlier today. Last night was the first time in a year that I went to bed and he wasn’t there. It felt surreal. \n\nMy dad, who is very religious, insists my sister keep the baby. My mom believes she should have the choice to end the pregnancy.\n\nI’ve already contacted a lawyer for the annulment and emphasized that I want no more contact with him. There’s nothing left to salvage.\n\nEven though my sister has apologized several times, she still believes she’s in love with him. My family is planning to start family counseling soon. It will be focused on figuring out how to move forward and what kind of relationship, if any, I want to have with my sister. There are no clear answers right now. \n\nThe support I’ve received from people here has helped me feel less alone. Thank you.",
  "created_utc": 1747436058.0,
  "score": 6069,
  "num_comments": 323,
  "url": "https://www.reddit.com/r/offmychest/comments/1koe9te/update_my_husband_was_arrested_this_morning/",
  "comments": [
    {
      "id": "mspjx83",
      "body": "He’s a monster. I’m glad he’s facing consequences, but I’m heartbroken for all of you who were impacted by how vile he is.",
      "created_utc": 1747437693.0,
      "score": 2398
    },
    {
      "id": "msph3jl",
      "body": "I remember this story. Yikes I’m so sorry you’re going through this but I’m glad he’s facing the consequences. Best wishes to you",
      "created_utc": 1747436642.0,
      "score": 1602
    },
    {
      "id": "mspie5y",
      "body": "I am just really sorry OP. That sucks. I hope things move quickly for you so that you can heal as soon as possible.",
      "created_utc": 1747437130.0,
      "score": 129
    },
    {
      "id": "msphv9b",
      "body": "Wow, this is just awful. Praying for your family. I hope your ex gets a long time in prison and that you and your family are able within time to get through this.",
      "created_utc": 1747436933.0,
      "score": 590
    },
    {
      "id": "msphzvw",
      "body": "oh wow. i hope you and your family can heal from this, and i think it may be better in the long run if your sister has an abortion.",
      "created_utc": 1747436981.0,
      "score": 259
    },
    {
      "id": "mspwt3p",
      "body": "I agree with your mother that you are sister needs to be allowed to have an abortion if she wishes to have one. I’m sorry this happened to you, but I’m glad that he was arrested and let’s hope that the justice system follows through and doesn’t just dismiss everything. Just give yourself time to heal and protect your peace, even if that means distancing yourself from your sister.",
      "created_utc": 1747442508.0,
      "score": 92
    },
    {
      "id": "msq2x8x",
      "body": "*Hugs!* I am so sorry for all of this OP. \n\nYour dad can ‘ef all the way off and him being “such a religious man” is probably a part of why all of this is happening, tbh. Misogyny will always affect our children in ways we can’t necessarily see until something horrible like this happens. \n\nThe only person who has a right to make a decision about whether or not to keep that baby is your sister. \n\nJust, *damn!* I wish you all of the most luck going forward OP. Hopefully your ex gets what he deserves in prison.",
      "created_utc": 1747444855.0,
      "score": 91
    },
    {
      "id": "mspwj97",
      "body": "I'm so sorry this happened to you.  The pain you must be feeling 💔  I really hope you find a way to heal from this betrayal.  \n\n\nI just want to remind you that your sister was/is a child and was groomed, molested and then raped. She may think she's in love ( she is, after all, a dumb teenager), but she's been conditioned and manipulated into believing that.  Please give her some grace in that.  \n\nWould I trust her again with my S/O ? No, personally, it would be too hard for me to get past it and be as close as before.  That relationship is forever changed.  \nThat being said, this is all his fault, and I hope he gets charged accordingly.  I hope your family presses all the charges they can.  \n\nI'd bet he has photos of her.  That would be CP and an additional charge, so it's something to look into.  \n\n\nYou are an incredibly strong woman . You will survive this.  🩷",
      "created_utc": 1747442406.0,
      "score": 442
    },
    {
      "id": "mspjpox",
      "body": "Praying for you and your family. Luckily this monster is where he belongs. ",
      "created_utc": 1747437615.0,
      "score": 37
    },
    {
      "id": "mspjpve",
      "body": "Your husband preyed on your 15yr old sister. She is also a victim in this situation. As hurtful as this whole situation is, I think it’s important not to lose sight of that. I’m so sorry he did this to you and your family. You deserve so much better.",
      "created_utc": 1747437617.0,
      "score": 763
    },
    {
      "id": "mspoe0u",
      "body": "Please take care if your mind and body during this. Im so sorry.",
      "created_utc": 1747439339.0,
      "score": 21
    },
    {
      "id": "mspjpdw",
      "body": "Omg I’m so sorry. That’s so awful. I’m glad you’re getting away from him. Please seek a therapist asap",
      "created_utc": 1747437612.0,
      "score": 21
    },
    {
      "id": "mspynd4",
      "body": "OP, I am so sorry. Please know that everything you feel is valid, and you are allowed to honor that. Also, you don't have to make any decisions today regarding the relationship with your sister—that is a topic for another day.",
      "created_utc": 1747443207.0,
      "score": 40
    },
    {
      "id": "msppnci",
      "body": "I hope that you can find happiness within yourself. You’ve been through so much. \n\nI am proud of you. Wishing you peace and strength. Much love.",
      "created_utc": 1747439808.0,
      "score": 14
    },
    {
      "id": "mspoksx",
      "body": "I understand your conflicted feelings on your sister. I was in a similar situation. When I was 16, I had a guy who was 21 and was interested in me. I wasn't interested in him as anything other than a friend. He made it seem as though he was OK with being friends. One day, my 14-year-old sister was with me at his house and I fell asleep on the couch. She went upstairs with him and they slept together. He took her virginity. When they came downstairs, she mad it a point to show me the blood on her pants from the situation and gloated that she slept with him. It's been over 20 years and I still vacillate between he groomed her and she knew what she was doing and it did to hurt me. Truth be told, it was a little of both.\n\nMany people will tell you that your sister is 100% a victim and to not be mad with her. She is a victim but she also actively made a choice. It is ok for you to be mad with her.\n\nETA: adding a little more context to my comment.",
      "created_utc": 1747439407.0,
      "score": 122
    },
    {
      "id": "mspoujk",
      "body": "OP … as awful as this situation is, I’m glad\nYour STBXH is behind bars and you’ve made steps to get the annulment.  It’s a start. \n\nThis is such an emotionally charged ordeal….. for everyone involved. \n\nHe has basically brought your entire “family unit” to their knees - it feels like he’s created this “make an awful choice” about a baby, about your relationship with your sister ….. and your parents HAVE to be FURIOUS with both of them.  \n\nIf your sister decides to have his kid ….. welp, that’s a major consideration.  \n\nWill she share custody of the baby with his family ? Who will pay to raise the kid ?  Can you imagine the life of a child - KNOWING they were not only a product of sexual assault…. But also, deception, fraud and depravity ?? No child should be born with the job to “fix” a situation - regardless of any religious beliefs.  \n\nI cannot imagine being expected to be a loving auntie under these circumstances….. nope. \n\nI’m sending you tons of support and some peace as you navigate things moving forward.",
      "created_utc": 1747439507.0,
      "score": 24
    },
    {
      "id": "mspi7ar",
      "body": "I’m so sorry. This is all terrible.",
      "created_utc": 1747437060.0,
      "score": 19
    },
    {
      "id": "msplpph",
      "body": "I am so sorry for what is happening. Make sure, as you go through this stressful process, that you give yourself a little extra TLC throughout this process. Self-care is so important, and having stress management skills (such as de-stressing through creative outlets and hobbies, deep breathing/mindfulness practices, leaning on social supports, etc) can help so much as you navigate this time. \n\nAlso, when things feel extremely overwhelming, sometimes taking it day-by-day helps. Sometimes, days are too overwhelming, so it can become hour-by-hour, or  moment-by-moment. But you got this, and you got us, okay?",
      "created_utc": 1747438354.0,
      "score": 16
    },
    {
      "id": "mspl9nh",
      "body": "I’m really sorry you’re going through this ❤️hugs",
      "created_utc": 1747438190.0,
      "score": 8
    },
    {
      "id": "msry39o",
      "body": "Your dad needs to butt out. When he’s the one pregnant, he gets to decide whether to keep it or not.\n\nYour sister is a grooming victim, and although she was manipulated to think it was love, she betrayed you big time and showed you that losing you is worth getting some pedo dick. I would not blame you if you are not able to get past this. Especially since she’s doing the whole “but I love him!” defence instead of grovelling.",
      "created_utc": 1747480203.0,
      "score": 7
    },
    {
      "id": "mst2zz5",
      "body": ">\\>My dad, who is very religious, insists my sister keep the baby. My mom believes she should have the choice to end the pregnancy.\n\nShe absolutely should.\n\nYour dad can study the Bible on what to do with your ex.\n\nI'm sorry OP.",
      "created_utc": 1747496182.0,
      "score": 7
    },
    {
      "id": "msppmpm",
      "body": "Your sister has been groomed from before the relationship officially started. She’s going to think she’s in love with him for a long, long time.\n\nI won’t go into too much detail, but I had a relationship at 17 with a man who told me he was 8 years older than me (he was actually 10-11 years older than me). It was a shorter relationship, but I thought I was in love with him. I didn’t find out his true age until my mom called the cops when she found out (the detectives met with me once and I didn’t hear anything until they tested my rape kit years later). It took visiting him once after I’d turned 18 and lots of therapy to realize that he was actually a very sick man and I wasn’t in love—what I was experiencing was actually closer to something like Stockholm Syndrome). Sent his sorry ass to jail and the registry in 2019, 7 years later. Haha, loser.\n\nMy point is—it may take longer because their relationship was longer, but she will eventually realize what really happened. She’s been groomed by a sexual predator. She needs to be in counseling though, seriously. Like immediately. You also should probably seek out support if you haven’t already. I’d highly recommend contacting a victim’s advocate that you can both speak to as well (the cops/sex crimes detectives should also provide you with this information). VAs provide valuable resources, help empower the victim, and are there for you every step of the way from investigation-prosecution. Your sister may not be into the whole VA thing (she might not see herself as a victim, but as a consenting adult), maybe you can phrase it as asking if she’ll come support you. You’re both victims here.\n\nI’m so sorry that this is your reality right now. Remember that there will eventually be an end to this entire chapter and your life will start again. You’ll have no doubt learned a lot more lessons from this than you ever asked to, but remember that what you gain will benefit you in the long-run and that what you lose you will heal from. So much love to you, hang in there and ask for help when you need it.",
      "created_utc": 1747439801.0,
      "score": 36
    },
    {
      "id": "msqfbco",
      "body": "Your sister needs therapy badly. And yes she either needs to end the pregnancy or give baby up",
      "created_utc": 1747449643.0,
      "score": 7
    },
    {
      "id": "mspn87l",
      "body": "I’m so sorry you’re going through this. I wish nothing but the best for you and your family moving forward 💕",
      "created_utc": 1747438911.0,
      "score": 4
    },
    {
      "id": "mspx5fq",
      "body": "So sorry this was happening to you. I imagine it was difficult for them to meet privately with you and your parents around. Hopefully there weren't that many encounters and your sister can heal more easily.\n\nSo basically this started from the beginning of your dating relationship? Do you think you were his means to get to his p\\*do ends?",
      "created_utc": 1747442641.0,
      "score": 6
    },
    {
      "id": "mssfkk0",
      "body": "Your sister is probably holding onto the belief that she loves him because if she doesn’t, she would have to admit this was all a big mistake (I wish there were a stronger word to use here), and she would have to admit to herself that she betrayed you in the worst possible way for nothing. \n\nI feel bad for her in some level, he 100% groomed her. I know it’s not what you want to hear right now but she is a victim in this too.\n\nI don’t blame you for one second for not  wanting a relationship with her though, that would be really difficult and painful for you. \n\nWhat an absolute POS this guy is. \n\nI’m so sorry, this is a rough one. Sending hugs OP. Find yourself a good therapist",
      "created_utc": 1747488061.0,
      "score": 11
    },
    {
      "id": "msplzzo",
      "body": "So many men get away with abusing young woman. I’m glad he’s caught but nothing will undo the damage he has caused to your sister.\n\nI’m so so sorry you’re going through this. I can’t imagine experiencing this level of betrayal. Just know that you will get through it.",
      "created_utc": 1747438459.0,
      "score": 9
    },
    {
      "id": "mspyjad",
      "body": "I’m so sorry.",
      "created_utc": 1747443164.0,
      "score": 6
    },
    {
      "id": "msq3b1v",
      "body": "I am glad you took time to think and dig some more. She is going to feel this way for a while until she is away from his influence for a while. It will take time. \nI’m sorry for your pain. Work through it and go live a little yourself!",
      "created_utc": 1747445001.0,
      "score": 5
    },
    {
      "id": "msq83ui",
      "body": "oh dear. virtual hug for you..\ni dont have words....",
      "created_utc": 1747446858.0,
      "score": 5
    },
    {
      "id": "msrdh9u",
      "body": "Instead of living with that guy called husband . Better to live single .sorry it's happened to you. It will be painful to forget him . carry your life for better and bright future",
      "created_utc": 1747467341.0,
      "score": 4
    },
    {
      "id": "msrh91g",
      "body": "I am angry for you. I hope he's in jail for a decade or more. Such vile POS.\n\nAfter annulment, maybe it will help if you move away for a few years. You dont want to hang around if sis keeps the baby.",
      "created_utc": 1747469715.0,
      "score": 5
    },
    {
      "id": "msrrtci",
      "body": "Make sure your sister knows that her dad has NOTHING to do with her choice btw.",
      "created_utc": 1747476557.0,
      "score": 6
    },
    {
      "id": "mstgmz6",
      "body": "Can I ask how old you are as well?",
      "created_utc": 1747500596.0,
      "score": 4
    },
    {
      "id": "msqwe5p",
      "body": "You aren't ready for family counseling. The chances are good that you will be pushed to \"forgive.\" Instead, get into individual therapy with someone who is expert in family trauma.  Family counseling can follow when your therapist thinks you're ready and preferably with someone your therapist recommends.\n\nYour sister is the victim of a predator. That guy you married is a monster. But you were the victim of both that monster and your sister. She of course knew what she did was wrong and that she could get pregnant.  That she was groomed by a monster doesn't change that. \n\nTherapy will help you figure out what you feel and what you need without regard to your sister or your parents, who will want things to be \"normal\" again. That's not going to be possible, ever. Your job is to take care of yourself.",
      "created_utc": 1747457493.0,
      "score": 14
    },
    {
      "id": "msrayoq",
      "body": "I know her sister is a kid but I would never be able to forgive either of them, call me a monster if you will but I just would never, especially if she kept the baby, ESPECIALLY if she then pursued a relationship with him later on. I would still distance myself from this entire mess if I were you. Let your parents deal with it and leave to heal yourself. You don’t need this.",
      "created_utc": 1747465767.0,
      "score": 14
    },
    {
      "id": "mspryx4",
      "body": "i really hope you take time to yourself! i hope your ex husband gets a long sentence and rots in jail. i’m so sorry this is happening to you and your family",
      "created_utc": 1747440679.0,
      "score": 7
    },
    {
      "id": "msq6cfy",
      "body": "Wow.\n\nI'm so sorry this  happened to you.\n\n\n🫂🫂🫂🫂🫂",
      "created_utc": 1747446179.0,
      "score": 5
    },
    {
      "id": "msusgxo",
      "body": "I'm so sorry all of this is happening. \n\nI hope your sister chooses abortion, because she is so young and she was groomed and raped. \n\nIt's understandable if you don't ever want to see or speak to your sister again, and it's also understandable if at some point in the future you can forgive her because she was a victim in all of this too. \n\nOnly you can decide if you want to continue having contact with your sister. If anyone pushes you to forgive her and have contact with her, tell them to back off because she didn't do to them what she did to you.",
      "created_utc": 1747516327.0,
      "score": 4
    },
    {
      "id": "msw5kb5",
      "body": "Your husband needs to be jailed for what he has done.\n\nHow are you holding up? Are you in therapy? You may need help to process your feelings.\n\nYou don't need to cave in for reconciliation with your sister if you are not ready for it.\n\nHope you are doing well.",
      "created_utc": 1747534979.0,
      "score": 3
    },
    {
      "id": "msrpxz7",
      "body": "OP please don't fall for the commenters telling you to be a better person and forgive your sister. if she gives a birth you probably would be expected to step up and take care of this child. the fact is, your sister is old enough to understand what she was doing. cut her off before she does this again.",
      "created_utc": 1747475387.0,
      "score": 13
    },
    {
      "id": "mspt061",
      "body": "If she doesn’t terminate the pregnancy then I’d never speak to her again honestly.",
      "created_utc": 1747441068.0,
      "score": 19
    },
    {
      "id": "mstszry",
      "body": "When your father finds himself raped and pregnant then and only then does he get to decide anything.",
      "created_utc": 1747504500.0,
      "score": 6
    },
    {
      "id": "msqj8vq",
      "body": "Damn Adelaide’s so small I got told this story by my co worker today. I hope you’re okay and life gets better for you.",
      "created_utc": 1747451279.0,
      "score": 3
    },
    {
      "id": "msx0yrm",
      "body": "Your sister needs therapy, so do you.\n\nShe thinks she loves him because she was groomed and she is a victim here too.",
      "created_utc": 1747550824.0,
      "score": 3
    },
    {
      "id": "msz8ur8",
      "body": "Thank you for the update and hopefully you’re very young sister will get her own counseling to help her realize the ‘love’ she feels for your soon-to-be ex is not healthy.",
      "created_utc": 1747586642.0,
      "score": 3
    },
    {
      "id": "mspplqy",
      "body": "I’m really sorry. I’m so proud of you for being so levelheaded and not blaming her. She’s a child, your ex is a monster. Your soon to be hopefully annulled marriage to a predator is going to take so much time to heal from and I’m so sorry. Also other male prisoners don’t take stuff like this well as many have kids who are your sisters age. Piece of shit will have a horrible time as he should. I hope they throw the book to him, he groomed her and ruined her childhood. I really hope she terminates the pregnancy but I know it’s her choice however she’s not in the right state of mind to make a great decision.",
      "created_utc": 1747439792.0,
      "score": 8
    },
    {
      "id": "msqk91a",
      "body": "My heart hurts for you. I’m so very sorry for all that has happened. \nYou both are victims of this monster. He used his relationship with you so he could have access to your sister. I would not be surprised if he did this to others as well. \nIt’s easy to say that a teenager understands right from wrong. However they have difficulty with emotions and how to deal with them. This is why so many parents say things like trying to raise a teenager is like trying to nail jelly to a wall. Predators like that monster are masters at manipulating and finding vulnerabilities right down to playing the long game to get what they want. He played you and your sister. He played everyone who trusted him including your parents. This is what predators do. I’m not surprised she still loves him, the spell people like him cast is strong. \n\nFamily counseling is a good thing for your sister and parents. They have a lot they need to sort out which includes her being pregnant and what to do about it. Aborting, keeping, and adopting are all hard decisions. \nOne thing to remember is that no matter what they decide about the grooming and your sister’s pregnancy,  you can decide how you choose to move forward for you. Close contact, low contact, no contact, or anything that you feel that works for you. There are no hard and fast rules. \n\nI suggest that you get your own therapy that is separate from the family therapy. Start there first and remember that you can join in family counseling only when you want to and are ready.",
      "created_utc": 1747451716.0,
      "score": 5
    },
    {
      "id": "msr679w",
      "body": "I said on your previous post I bet he’s groomed her. Yes she thinks she loves him, that’s how groomers work. Good for you for dumping him.",
      "created_utc": 1747462907.0,
      "score": 6
    },
    {
      "id": "msrhf7w",
      "body": "SHE WAS 15!?!?!? \n\nI think you need a clean break to clear your head!! At least until you decide if you want to cut ties or not. \n\nWow. I am so so sorry this is happening to you and I hope you can take everything from him! \nI hope everything moves along quickly and smoothly for you!",
      "created_utc": 1747469824.0,
      "score": 6
    },
    {
      "id": "msqyssy",
      "body": "Love and comfort to you 💚",
      "created_utc": 1747458758.0,
      "score": 2
    },
    {
      "id": "mswcuny",
      "body": "I’m so sorry OP. This is awful!",
      "created_utc": 1747538110.0,
      "score": 2
    },
    {
      "id": "mswwujo",
      "body": "Your sister was groomed by your ex. I am hoping you would be willing to listen to her side of things because I’m betting he said some pretty coercive things to get her to do what she did. But in the end, you are the one that was married to this creep. I just think you were both hurt by him in very different ways. Good luck OP.",
      "created_utc": 1747548336.0,
      "score": 2
    },
    {
      "id": "msydr4j",
      "body": "This is a horrible situation for you to go through. You're worth so much more than what's happened to you. \n\n\nYour family has a lot of healing to do. But you are carrying the full load. Your healing comes first. You can't move forward with things until you find peace.\n\n\nWhile I understand your feelings towards your sister, I do hope you can find some semblance of a relationship in the future. It seems as if she was groomed and may not know the reality of the situation yet. You both have a different side of the situation. He showed you he wasn't your true love while making her believe he was hers. I don't envy this decision you have to make and only you know the best choice for you. Whether you reconnect with her or not. She had to have known she was hurting you.\n\n\nMy only advice, take it slow. Take care of yourself. Eat something, no matter how small. Drink water. Shower. Trips to the park. Even if you're only able to handle eating a handful of crackers on a sunny Tuesday, that's enough. Take all the time you need to heal yourself. Then you can start working on moving forward.\n\n\nI wish you only the best and I hope you find something good at the end of this dark tunnel.",
      "created_utc": 1747576570.0,
      "score": 2
    },
    {
      "id": "mt22o1a",
      "body": "I was groomed, and what helped me was trauma counselling (because this is a court case, you’ll most likely have access to covered counselling through the court/police department).  The police provided one for me, and they were really educated on what I was going through. They even set me up to meet a woman who was about a decade older than me than went through a similar circumstance when she was younger too.      \nFamily counselling is an amazing idea, but please make sure she has some private sessions too, because it can be embarrassing to talk about what you need to in front of family.",
      "created_utc": 1747621150.0,
      "score": 2
    },
    {
      "id": "mt8lmwe",
      "body": "It wasn't an affair it was rape, she was groomed and manipulated. I understand the hurt but this wasn't her fault it was that disgusting man, please try to remember that. I'm so sorry you are going through this and I hope family therapy will help. Is she getting individual therapy as well?",
      "created_utc": 1747712022.0,
      "score": 2
    },
    {
      "id": "msqqv0u",
      "body": "I'm so sorry for everything you're going through, it's truly awful and your ex is a major AH and a disgusting POS. \n\nI also totally understand your hate and anger towards your sister right now. Although she was groomed by him, and he manipulated her, it's still a huge betrayal from your sister, and she should have known it was wrong. But that's the downside of being groomed, they manipulate them in such a way that literally controls and warps their mind into not really thinking clearly or logically. \nOn one hand she should have known its wrong, but on the other hand she was groomed and manipulated and played on her weakness. \nThe reason why groomers get away with what they do is because they focus on the child's weakness and vulnerability, often the need for love and attention and praise and being made to feel special etc. \n\nEither way, it's understandable you still have difficult emotions surrounding your sisters part in all this. And that will take time to work through in therapy. But whichever way it turns out, whether you manage to work things out and forgive her, or whether you are able to simply be civil around her, or whether you cut her out because it's too difficult for you to be around her and be reminded of what she did, any option is understandable, and its important to do what's best for you and your mental health. \n\nIn regards to her pregnancy, the best solution would be termination. She's still young, she'll be a single parent, hopefully your ex will go to jail, so she may not get child support unless he has a lot of savings etc. Although that will probably go on lawyers. \n\nPlus she needs to realise that baby is going to be a constant reminder for you of what he did. \nAnd she's got to realise people will come to learn the truth eventually, esp when it goes to court etc. Does she want everyone knowing she got pregnant by her sisters husband? And she's still young, it will affect her future. \nI think you should talk to your dad and let him know that this is a hugely different situation to her just getting pregnant young by a 'boyfriend'. She's been groomed by the father, and its a constant reminder of what you husband did, and their relationship behind your back for so long. The baby will be a reminder of how you were betrayed so badly. \nAnd that he can have his opinions, but reality is it would be the best option if she terminated, so you'd appreciate it if he could just not encourage her or pressure her to keep the baby. He doesn't have to encourage termination, but just stay quiet. \n\nAnd speak to your mum for support too, and hopefully she can make your sister see sense. Especially regarding how she'll be a single mother and cost of raising a baby with no help from the father, the stigma she may face from people, and whether your parents would even want to help with the baby etc. \n\nI hope you're getting some individual counselling for yourself, and your ex will stay somewhere else while waiting for his court case, unless he's being kept inside. \n\nI'm so sorry, but I'm glad he's been arrested and there's a lot of evidence against him. Hopefully he gets a long sentence.",
      "created_utc": 1747454742.0,
      "score": 5
    },
    {
      "id": "msr7rmk",
      "body": "Your sister got pregnant on purpose. Your impending marriage was the catalyst. She wasn't able to stop it, but she sure enough destroyed any chance he'd be with you. \n\n\nIndividual therapy is paramount for you. Your Dad is going to use religion against you. \n\n\nWho is taking care of you? Choose you, please. I know you are hurting. You were used too. ",
      "created_utc": 1747463847.0,
      "score": 7
    },
    {
      "id": "msqoo31",
      "body": "No one would judge you if you tell the prosecutor you don’t want this to deal. Put his ass on trial and let him really face the music of what he’s done to you and your entire family. Just saying.",
      "created_utc": 1747453704.0,
      "score": 4
    },
    {
      "id": "msrgj8p",
      "body": "I’m so fucking sorry you’re going through this mess. My heart is with you. Please take care of yourself. I hope you’ll gain comfort in sleeping alone knowing that you’re no longer sharing a bed with a cheating pedophile. \nI really hope that baby doesn’t come to. It might be wrong to say, but the last thing you deserve is for your future niece/nephew to be the product of your ex-husband and little sister. As for family counseling, I hope that you can move forward. Whether that means being no-contact, staying away for a few months/years, or some other 3rd thing. I want you to have peace and fight past this. You are not alone.",
      "created_utc": 1747469249.0,
      "score": 4
    },
    {
      "id": "msr77w0",
      "body": "So glad he got arrested, and that you found out now, rather than after having children with him. So sorry about your sister. She is a victim.",
      "created_utc": 1747463518.0,
      "score": 5
    },
    {
      "id": "msqz4ik",
      "body": "Eventually, your sister will look back on this and realise she was groomed and sexually abused for years. I'm so sorry this happened to you both, how traumatic. It makes sense for you to be upset with her, but please remember she is a child. I don't care what the legal age of consent is, a 15/16/17 cannot consent to a grown man with a fully developed frontal lobe. He is nothing but a predator.",
      "created_utc": 1747458934.0,
      "score": 3
    },
    {
      "id": "msqp5hn",
      "body": "This is all very devastating. Take care of yourself OP. I wish I had words of wisdom to share but I don't. I am sending support your way 💪❤️",
      "created_utc": 1747453929.0,
      "score": 2
    },
    {
      "id": "msvb8bz",
      "body": "He was a predator. She is a victim of his grooming. She needs treatment. Please remember that he was the criminal in this. Even if she pursued him, he knew better.",
      "created_utc": 1747523029.0,
      "score": 2
    },
    {
      "id": "msvhzbk",
      "body": "Keep in mind, your sister was groomed and a child. She thinks she was in love with him because that's what he made her believe. She is a victim.",
      "created_utc": 1747525458.0,
      "score": 2
    },
    {
      "id": "msqve26",
      "body": "I’m so sorry you and your family are going through this. I hope you and your sister heal from this monster. I’m glad he’s going to face the consequences.",
      "created_utc": 1747456980.0,
      "score": 3
    },
    {
      "id": "msrt8u5",
      "body": "I am so very sorry for the trauma. \nYou have an excellent sense of what to do for yourself. \n\n15-year olds do stupid stuff. It is really common for a younger sister to have a crush on her older sister’s guy. It is very rare for the guy to take advantage of that. It is his job to put her in “little sister” role. Of COURSE she feels she is still in love with him. However, since she is still underage, your parents should cut her off from him 100% to give her a chance to heal from the diagusting “spell” he put on her when he groomed her. \n\nCan you or your parents imagine being related to this creep?\n\nYou will know what to do for yourself in relation to your family and sister once they find their way through all this. I wouldnt worry about all that for now. Get someone who is professional and far away from this nightmare to help you grow from this horrific betrayal. My heart goes out to you.",
      "created_utc": 1747477441.0,
      "score": 2
    },
    {
      "id": "mss2879",
      "body": "Your dad needs to stfu and your sister needs to get an abortion. He wants to tie her down to her rapist forever? She will grow up and realize she was raped by your ex. \n\nI would say that you tell your dad these words and tell him to butt out. Talk to your mom separately and tel her she needs to convince your sister to get an abortion. \n\nIt’s up to you whether you talk to your sister, but if you do, try to be compassionate and tell her that you know she thinks she’s in love but he groomed and raped her. That she will look back on this in years and realize this and if she keeps the baby, she will tie herself to him forever. And that if she keeps the baby, it will be harder for you to have any relationship with her. The baby will always be a reminder of your ex’s betrayal. \n\nAlso tell her she is young and has a whole future ahead that she will be giving up. College, partying, travel, freedom, etc. \n\nBut I think it’s okay to not go to family therapy and to just stay away from her for awhile.",
      "created_utc": 1747482303.0,
      "score": 1
    },
    {
      "id": "msqg9iz",
      "body": "A heck of a lot of people not understanding OP’s sister being a child, going on about how she should know better, when the whole point of being a child is that you don’t. I thought I knew a lot of things at 15, but I didn’t know my ass from my elbow. Most 15 year olds don’t.\n\nThen there’s the grooming, which is just so hard to explain unless you’ve been through it. It’s emotional and psychological manipulation on another level. Your reality becomes what the person grooming you wants it to be. To condemn her sister for what happened is sickening. Ya’ll need to touch some grass.",
      "created_utc": 1747450024.0,
      "score": 2
    },
    {
      "id": "mssgr5v",
      "body": "Just sending you ❤️.  I am so sorry you have to deal with this.",
      "created_utc": 1747488522.0,
      "score": 1
    },
    {
      "id": "mstdtgg",
      "body": "We are here for you. ",
      "created_utc": 1747499687.0,
      "score": 1
    },
    {
      "id": "mstqa8o",
      "body": "I truly hope that you get the necessary support along with your sister. This is just sad and disgusting.",
      "created_utc": 1747503647.0,
      "score": 1
    },
    {
      "id": "msu4p1o",
      "body": "I’m so sorry this is happening n",
      "created_utc": 1747508406.0,
      "score": 1
    },
    {
      "id": "msu5zhi",
      "body": "This is just.... awful. No better word I can come up with. The trauma of grooming your sister will live with, the family torn apart. The trauma from not only being cheated on but in this way that you'll have to deal with. I'm so sorry. I don't have advice, but I wish you all (except him) healing. Sending you so so so much love.",
      "created_utc": 1747508841.0,
      "score": 1
    },
    {
      "id": "msuyc4x",
      "body": "Nothing but a woodchipper is what he deserves.",
      "created_utc": 1747518361.0,
      "score": 1
    },
    {
      "id": "msv5906",
      "body": "Thinking about you- I’m so sorry you are going through this",
      "created_utc": 1747520853.0,
      "score": 1
    },
    {
      "id": "mswln6v",
      "body": "Really hope you side with your mother here. Forcing a 17 year old to have an essentially child from assault will only be a cruel reminder.",
      "created_utc": 1747542262.0,
      "score": 1
    },
    {
      "id": "mswvqk2",
      "body": "I hope that your sister has individual counselling to talk realistically about what co-parenting with a paedo rapist is going to be like. Depending on jurisdiction he may well have full parental rights from birth. This means that she will have to have his permission to move with the child, have his permission to obtain a passport, he can take her to court to insist the child has his lastname represented within their legal name… if he is not jailed for grooming her and coerced sex with a minor, he will always be around. Their shared child would represent a connection for the rest of their lives.\n\nFrankly, if she was my child I would be encouraging her to have an abortion. She’s a child anyway, but nobody should be trapped in an eternal connection with their rapist. She might think she loves this man now, but she won’t always see it that way. It’ll be easier for her to move on if the evidence isn’t forcing her to meet her abuser every other week to hand over the child.",
      "created_utc": 1747547684.0,
      "score": 1
    },
    {
      "id": "msx5jmu",
      "body": "OP, tell your father to read \"My Dark Vanessa\". It's the story of a girl that was groomed by her teacher at age 15. The author went through it herself. It's an absolutely devastating book. See if he still thinks she should keep the baby. I don't think he understands that she was groomed, manipulated and that consent is not really a thing here.",
      "created_utc": 1747553649.0,
      "score": 1
    },
    {
      "id": "msxartp",
      "body": "So, you are seeking an annulment and your sister may be seeking family counseling with your ex?",
      "created_utc": 1747556926.0,
      "score": 1
    },
    {
      "id": "msxevk5",
      "body": "I’m terribly sorry you and your family are going through this 💜 you’re doing the right thing! Glad that gross man has been arrested and that you’re getting an annulment. Good luck with everything!",
      "created_utc": 1747559527.0,
      "score": 1
    },
    {
      "id": "msxf3vv",
      "body": "Praying for you",
      "created_utc": 1747559675.0,
      "score": 1
    },
    {
      "id": "msxrpyd",
      "body": "I’m sorry this is happening to you.  Even though this started when she was young you don’t have to forgive your sister. She was still old enough to know what she was doing was wrong to you.",
      "created_utc": 1747567195.0,
      "score": 1
    },
    {
      "id": "msxrscc",
      "body": "So sorry for you and your entire family.  I know it will be a lot of work but I hope you find peace and forgiveness toward your sister.  Also sending prayers, good thoughts to your sister so maybe she can now start seeing things for what it is.  Seems he likely groomed her.  She was/is a child and can easily be swayed and manipulated.",
      "created_utc": 1747567231.0,
      "score": 1
    },
    {
      "id": "msxxyuq",
      "body": "My heart breaks for you. Hold fast.",
      "created_utc": 1747570259.0,
      "score": 1
    },
    {
      "id": "mthegcs",
      "body": "Worst Husband Award!\n\nSo sorry for your struggle. Glad to hear you are so strong and clear in your head and heart.",
      "created_utc": 1747839271.0,
      "score": 1
    },
    {
      "id": "mtjabou",
      "body": "I  am so sorry to hear of this drama that was revealed so soon after you got married!!  \n\nGreat that you have a plan and you will soon start over!\n\nI hope you are able to work through this and heal from the betrayal.  ❤️",
      "created_utc": 1747858686.0,
      "score": 1
    },
    {
      "id": "mtoji6v",
      "body": "I am not saying you should forgive her or anything like that. I hope you understand that her brain isn't fully developed and that guy manipulated her.\n\n\nI don't think I would forgive a younger sibling for that, but I wouldn't think they did it maliciously. I think it just makes is slightly less worse. I think my feeling would be something along the lines of 'how could I mean so little to them' and not 'why would she do this to me'",
      "created_utc": 1747931871.0,
      "score": 1
    },
    {
      "id": "mtpdytb",
      "body": "I know you’re going through a lot, but consider ordering AidAccess abortion pills for your sister. It is extremely low risk, both health wise and legally. They send discreetly through USPS, which means the government would need a warrant to open it. \n\nEven if they found it, there would be no criminal charges because only the abortion provider is criminalized in Texas (for now) and AA operates outside the U.S. (and knowingly break laws to do what they do).\n\nAt most, your mom could be sued for the $10k bounty, but only if someone reports her. Again, without a warrant, very unlikely.\n\nIt’s also impossible to discern the difference between the abortion pills and a natural miscarriage. So she should report to the doctor as if she’s having a miscarriage since authorities already know she’s pregnant.\n\nObviously, going out of state is also another option. But if you or your family are financially strapped, AidAccess is another viable option available to your sister.",
      "created_utc": 1747940544.0,
      "score": 1
    },
    {
      "id": "mtt1j90",
      "body": "I am so so so sorry",
      "created_utc": 1747992750.0,
      "score": 1
    },
    {
      "id": "mtu0w4c",
      "body": "I commented!",
      "created_utc": 1748007637.0,
      "score": 1
    },
    {
      "id": "mtu5v8a",
      "body": "Was thinking about you this morning. I hope you guys are doing OK and you’re able to get the annulment you want. ((Hugs))",
      "created_utc": 1748009190.0,
      "score": 1
    },
    {
      "id": "mtv67na",
      "body": "Your sister was groomed. You will be feeling all sorts of emotions but hopefully one day you will be able to see she was a victim. Not an evil person who deceived you.",
      "created_utc": 1748019560.0,
      "score": 1
    },
    {
      "id": "mtvtmo2",
      "body": "Glad to hear that your husband is learning that actions have consequences.. especially if he started her that young.\n\nIt's your choice whether you want a relationship with your sister - no matter what anyone says. Just because you're related by blood doesn't mean you get away with shit - I've gone NC with my narcissistic parents and two of my siblings, and have created a 'family' who actually care for me like their own, even when we're not blood related.\n\nSending you internet hugs and best wishes moving forward.",
      "created_utc": 1748026303.0,
      "score": 1
    },
    {
      "id": "mtwitg0",
      "body": "I may get downvoted for this, but I’d cut ties with all them. He was having a sexual relationship with your sister and you simultaneously, possibly even on same days, i would’ve gotten violent with him, Of the domestic kind. I’m not a very reasonable person 😅. But reasonably I’d say therapy is a good start to this crazy chapter in all your lives. You could’ve never seen such absurdity coming, especially from someone you were willing to spend the rest of your days with.  Hoping your family can find peace and clarity and for you, love again that you never have to question,  after navigating through this rough chapter .",
      "created_utc": 1748033967.0,
      "score": 1
    },
    {
      "id": "mtxu5dr",
      "body": "This post brought back many horrible memories. I went through something similar I was the wife and the victims were my 4 and 8 year old nieces. It was a horrible situation all around and I can’t even begin to tell you the hell and heartbreak we all went through in the following days/months. It’s been 30 years and I still deal with the consequences of what that man did to my family. He destroyed so many lives and took the innocence of 2 little girls that can never get it back. I know you are hurting but know that he is to blame for what happened not you and not your sister you were both fooled by him and made to believe he was a good person but was nothing but a monster underneath. I hope for healing for you in whatever form that means for you. Please take care of yourself it does get better but it takes time.",
      "created_utc": 1748050840.0,
      "score": 1
    },
    {
      "id": "msqh4dt",
      "body": "I'm wondering if there were red flags the OP missed about her husband. Most cheaters aren't that good at hiding infidelity. Usually being super guarded about their phones gives it away. And groomers definitely exhibit red flags like being too interested in children. Maybe the husband and sister's eyes lingered a little too long at each other during family functions.",
      "created_utc": 1747450375.0,
      "score": 2
    },
    {
      "id": "msqiylx",
      "body": "Praying for you, and your little sister. Your story is so heartbreaking. 🙏🏼😭",
      "created_utc": 1747451155.0,
      "score": 1
    },
    {
      "id": "msrjb9y",
      "body": "What a rubbish situation to be in but thank goodness he is facing cnsequences for his actions. \n\nYour parents will probably be more focused on your sister's halth and wellbeing right now. She has been groomed by an abuser who presented a completely different face to you. She will have support, but you - too - need support. The future you saw has been ripped from you. The man you thought you knew - and whom you loved - turns out to have been living a double life. Your parents will want to protect you both, but your sister is still under their roof and it will be hard to avoid her or talk of her. \n\nIf you can take some time off try to get away for a few days. Somewhere nobody knows you. Find some calm amid the unbelievable storm in your life right now.\n\nYou have experienced the worst of betrayals, but the predator is now being held accountable for his actions. The fallout ripples far into the future, but you will be able to navigate each wave a bit more adroitly. \n\nBe gentle with your heart, and know that you are loved and cared for by your whole Reddit family.",
      "created_utc": 1747471054.0,
      "score": 1
    },
    {
      "id": "msunj2n",
      "body": "Just remember your sister was groomed by an adult man. She was a minor and holds no fault here. Children cannot consent, ever.\n\nKeep that in mind when thinking about your relationship with your sister. She was a child who was abused and victimized. He was an adult who conscientiously made a choice to prey on her innocence and naivety and abused her sexually and mentally. He’s the one you need to hold accountable and at fault.\n\nShe’s going to need love and support, even though you feel betrayed, because it was not a malicious betrayal by her. She was groomed by an adult a decade her senior into believing she’s in love and her raped her. Again, minors cannot consent. It may hurt, but if you both come together, you can both heal together. Cutting her out of your life for something she was manipulated into and suffered abuse through is harsh. You both lose out in that scenario.",
      "created_utc": 1747514678.0,
      "score": 1
    },
    {
      "id": "msv4o74",
      "body": "Your sister was groomed by him. He’s 100% to blame. He manipulated her and made her think it was ok. I hope you can forgive her, and whatever happens with the pregnancy, it’s going to wreck her either way. Best wishes (not enough, but not sure what else to say, good luck doesn’t seem appropriate)",
      "created_utc": 1747520639.0,
      "score": 1
    },
    {
      "id": "mswwgwq",
      "body": "I think I said this in your first post but take a lot of space from your sister and let yourself heal. Just because she's a victim doesn't mean that you have to be around her until you're ready to. At some point your sister will realize that her life was destroyed by a monster. (She likely already knows, but grooming is so evil that sometimes it's easier to live in a denial that you're in love rather than face the shame of the manipulations.) Whoever your sister would have been in life is gone and it will take a lot of therapy for her to rebuild who she is apart from the crime that was done to her. Your dad is wrong about forcing her to have the baby. Please take care of yourself first and find the best therapist in your area. You deserve to heal and move on and he deserves to rot in jail.",
      "created_utc": 1747548112.0,
      "score": 1
    },
    {
      "id": "msqkleh",
      "body": "I'm really sorry to hear about all you went through and I hope you can realize your sister is a victim who's been manipulated thoroughly by a criminal. You are as well. I hope all  of you can heal together, or separately if necessary. I'll refrain from sharing my thoughts about your husband as they're not productive and would likely get me banned. Take care of yourself and know that you have this random internet stranger's remote support for what little that may be worth.",
      "created_utc": 1747451867.0,
      "score": 0
    },
    {
      "id": "msptgle",
      "body": "You have to show grace to your sister. She is a victim and a child. \n\nHolding this against her and denying her an older sister for the rest of her life would be a tragedy.",
      "created_utc": 1747441242.0,
      "score": -12
    },
    {
      "id": "mspm5yj",
      "body": "Don't blame your sister she was groomed",
      "created_utc": 1747438520.0,
      "score": -15
    },
    {
      "id": "mstr7ci",
      "body": "Please forgive your sister. She was clearly groomed and isn’t thinking clearly yet.",
      "created_utc": 1747503934.0,
      "score": 0
    },
    {
      "id": "msqbyjb",
      "body": "Glad you are coping, don’t forget that you sister is a victim. She was groomed and It may take a while for her to realize it and will need your support. ",
      "created_utc": 1747448336.0,
      "score": -6
    },
    {
      "id": "msumxxt",
      "body": "#grooming",
      "created_utc": 1747514487.0,
      "score": 0
    },
    {
      "id": "msuwoj5",
      "body": "OP dont blame your sister. She was groomed by a monster. It will take time and therapy for her to realize this. Take time and space from her if you need to, because yes she did betray you with your husband. But recognize that hes spent years grooming her, and that he likely used you to get to her, and that he never really wanted to be with you.\n\nI'm not saying you need to act like all is forgiven right this second. But you need to get your own therapy and recognize that by blaming her you're just victim shaming.",
      "created_utc": 1747517785.0,
      "score": 0
    },
    {
      "id": "msrgh15",
      "body": "[deleted]",
      "created_utc": 1747469208.0,
      "score": -11
    },
    {
      "id": "msqhb00",
      "body": "Give your sister some time. Tell her if she has a child with him, the friends of her children won’t be safe from him.\n\nAnd he will also leave her for another one without children.",
      "created_utc": 1747450453.0,
      "score": -1
    },
    {
      "id": "msqq7a4",
      "body": "Just my little ol, easier said than done.\n\nPlease remember your sister was the victim of an older man grooming her.\n\nI'd ask for both of you get counseling with the hope you two can work through this.\n\nShe is your sister and essentially a victim of rape.\n\nWhether she terminates or keeps the baby is such a hard decision for someone so young.\n\nAs a person that that was a party of 2 abortions.\n\nYears later...30 years...I still think of it and it does weigh on my mind.\n\nWe made a decision at that time based on what we thought was right.\n\nNow, years later, I feel maybe it wasn't the right choice.\n\nBut damn, 16 and having to choose that. So many emotions...that has to the toughest choice ever.\n\nI hope that as time moves forward you and your sister can work through this.\n\nGood luck and all of my good thoughts a positive vibes are headed to you and your sister and family.",
      "created_utc": 1747454429.0,
      "score": -9
    },
    {
      "id": "msw46fu",
      "body": "This might make you feel better..... Have you ever had to defeat all evil in existence just to be around or raise your own children and wives??? 😂🤔🤞👼💯... But fr literally the situation I am dealing with at this point in time, smfh 🙄 lol.",
      "created_utc": 1747534395.0,
      "score": -2
    },
    {
      "id": "mssn01y",
      "body": "[removed]",
      "created_utc": 1747490856.0,
      "score": -121
    },
    {
      "id": "mssnczx",
      "body": "[removed]",
      "created_utc": 1747490980.0,
      "score": -65
    },
    {
      "id": "msq12mj",
      "body": "OP please update on sentence for our justice has been served moment because from what I know these cases usually only end up with like the person in prison for like 3 years for destroying the full life of someone. It’s fucked up. ",
      "created_utc": 1747444135.0,
      "score": 160
    },
    {
      "id": "mssnfyp",
      "body": "[removed]",
      "created_utc": 1747491009.0,
      "score": -44
    },
    {
      "id": "msufxci",
      "body": "Yeah. I’d feel very sorry for a child being born into this situation.",
      "created_utc": 1747512180.0,
      "score": 34
    },
    {
      "id": "mspl9ex",
      "body": "Same!!",
      "created_utc": 1747438188.0,
      "score": 31
    },
    {
      "id": "msqamo6",
      "body": "100% I thought the same thing when I read very religious dad thinking he has a say in if this 15 year old should carry, labor, and birth her rapist's baby.",
      "created_utc": 1747447828.0,
      "score": 29
    },
    {
      "id": "msq55qj",
      "body": "Yes, leave fairy tales and ancient superstition out of this. This isn't the Dark Ages anymore. Her dad should keep out of this personal decision.",
      "created_utc": 1747445719.0,
      "score": 27
    },
    {
      "id": "msvg8z8",
      "body": "It is against the law to have an abortion in Texas. The mother would have to take her out of state. What a mess. I feel so bad for that family.",
      "created_utc": 1747524822.0,
      "score": 4
    },
    {
      "id": "msrnmx3",
      "body": "Love your comment, the truth OP and his whole family needs therapy. OP will take time to heal and for the time being she will have to keep her distance for her mental health. I hope she heals and can understand her sister's situation. I am so happy that shit is in jail and hopefully he rots .",
      "created_utc": 1747473886.0,
      "score": 38
    },
    {
      "id": "msq3j90",
      "body": "Finally a reasonable response. It is incredibly disturbing how many people are willing to blame an obvious victim for being victimized.",
      "created_utc": 1747445089.0,
      "score": 147
    },
    {
      "id": "mstyzwz",
      "body": "One of the few responses I agree with. Thank you for not blaming the sister, but also not putting OP under obligation to completely repair the entire relationship. Their relationship is changed for the rest of their lives. This situation is sad all around for everybody except the husband. I hope he gets charged accordingly and faces severe consequences in prison.",
      "created_utc": 1747506480.0,
      "score": 16
    },
    {
      "id": "msrcwpw",
      "body": "I couldn’t have worded it better. She was a child and she was groomed.",
      "created_utc": 1747466981.0,
      "score": 32
    },
    {
      "id": "msx621b",
      "body": "I already made a comment about this but the book \"My Dark Vanessa\" is about a very similar situation of grooming and how it affects the girl, later woman, well into adulthood. By an author who experienced something similar herself. An absolutely devastating read. Highly recommend it to anyone who doesn't believe the sister couldn't consent or just wants more insight into the manipulation and grooming tactics. It's amazingly written, if the subject matter wasn't so heavy and depressing, it would be a classic already.",
      "created_utc": 1747553970.0,
      "score": 3
    },
    {
      "id": "msxbadk",
      "body": "Yes. Everytime she sees her nephew she will likely see a reflection of her ex.  The good news is, she won't have to explain to any of her own children that their cousin is their half brother, so long as she didn't have any kids by her ex 😔",
      "created_utc": 1747557258.0,
      "score": 2
    },
    {
      "id": "mtayhxz",
      "body": "💯❣️",
      "created_utc": 1747752465.0,
      "score": 2
    },
    {
      "id": "mtpbdc9",
      "body": "Op said effectively already said he has pictures starting when she was 16 and below the age of consent.",
      "created_utc": 1747939794.0,
      "score": 1
    },
    {
      "id": "mssnqdr",
      "body": "lovely comment you've left. someone out there will benefit from reading it for sure. bless you. but the account that made this post is karma farming. if you check you'll see",
      "created_utc": 1747491112.0,
      "score": -14
    },
    {
      "id": "mspnsxf",
      "body": "Her baby will live under this cloud its whole life, too. I really hope she’s allowed to terminate.",
      "created_utc": 1747439121.0,
      "score": 328
    },
    {
      "id": "mspyqo8",
      "body": "Yes, that’s important to remember but OP it’s also okay if you need some space from your sister. Especially until you figure things out and truly decide how you feel about your relationship with her. You don’t have to decide that any time soon and whatever you decide is up to you alone. \n\nThis is all fresh and it’s a lot to process. OP take care of yourself right now and just trust your parents will be looking out for your sister. You have to do what you have to do and if that means being at a distance from her, there’s absolutely nothing wrong with that. In fact, it’s probably for the best right now so you don’t get wrapped up in her situation rather than taking care of your own needs.",
      "created_utc": 1747443242.0,
      "score": 44
    },
    {
      "id": "mspnr7d",
      "body": "OP is also a victim and doesn't have any obligation to be the bigger person here. No one could blame her if she chose to distance herself from the sister.",
      "created_utc": 1747439103.0,
      "score": 406
    },
    {
      "id": "msqaryu",
      "body": "The sister is a victim and the villain in OP’s story. Both things can be true.",
      "created_utc": 1747447882.0,
      "score": 33
    },
    {
      "id": "mspxdgg",
      "body": "while this is 100% accurate, there does have to be some responsibility taken by the sister. unless it was forced, she did choose to sleep with her sisters husband. no victim shaming here, but there is some victim responsibility in this case. under like 12-14 (somehwere in this area) there is no victim responsibility, because the the child would barely even understand what they were doing; but after puberty starts they should know what sex is and means, and after that there should be a small amount of responsibility taken by the child that agrees (again this is not counting some form of force, physical or threats). this will not be taken well on reddit but there are plenty of stories where a young kid like 14 sleeps with an older person for a multitude of reasons. so it is 100% rape by the older person, and no direct punishment should be given to the kid in these situations, some responsibility needs to be taken by the kid if they chose willingly to sleep with the older person. \n\nin this situation the 15yr old girl chose to send explicit pictures and have conversations with her sisters husband. at 15 she knew full well that this was not correct behavior. so imo it is within OP's choice to shun her sister.\n\nthis gonna be downvoted into oblivion i bet.",
      "created_utc": 1747442725.0,
      "score": 72
    },
    {
      "id": "msq01yy",
      "body": "My first thought as well. That's a lot of chaos in a short period of time to emotionally adjust to. Give yourself grace & space right now!",
      "created_utc": 1747443742.0,
      "score": 17
    },
    {
      "id": "msq16gz",
      "body": "For sure, someone can be a victim, but also hurt someone deeply in the process and the person they've hurt is under no obligation to be a part of their recovery process.",
      "created_utc": 1747444175.0,
      "score": 44
    },
    {
      "id": "msq2uyy",
      "body": "Oh goodness neither of you should’ve been pursued by a 21 yr old at that age. She gloated because she was a child with a child brain. Oh my heart hurts for both of you and OP and her sister.",
      "created_utc": 1747444830.0,
      "score": 34
    },
    {
      "id": "msrt7ln",
      "body": "Oh honey, your conclusion is so far off base. You were *both* victims of grooming, and her of statutory rape.\n\nI’m not sure how old you are, but I’m in my 20s and I would never even think about going after 14 or a 16 year old. If I did, it’s because I know they are vulnerable and will go after each other instead of me…",
      "created_utc": 1747477420.0,
      "score": -3
    },
    {
      "id": "mspuqsf",
      "body": "Somewhat unrelated, and you can ignore this if you want, but I want to ask about my friend. She was groomed for a little over a year. Does that mean she’ll take a long time to realize what happened?",
      "created_utc": 1747441731.0,
      "score": 3
    },
    {
      "id": "msthr2a",
      "body": "24.",
      "created_utc": 1747500948.0,
      "score": 9
    },
    {
      "id": "mss0pjl",
      "body": "fr, grooming is real but the sister is absolutely old enough to know not to betray her sister like that, and the people telling OP to SUPPORT her are insane",
      "created_utc": 1747481552.0,
      "score": 10
    },
    {
      "id": "msqbmdv",
      "body": "I wouldn’t speak to her again, regardless, honestly. Yes, he was a predator and sister was a victim, but 15 is old enough to know you don’t do that to your own sister.",
      "created_utc": 1747448205.0,
      "score": 19
    },
    {
      "id": "mspzfwm",
      "body": "That's very unfair considering that she is a minor, and if she lives in the U.S., she may not have the money, resources, or legal ability to terminate unless both parents go out of their way to help her. RN it looks like OP's dad is going to force Sister her to have this tragically unwanted baby.",
      "created_utc": 1747443510.0,
      "score": -5
    },
    {
      "id": "msprmsl",
      "body": "Prison justice is a myth. They don’t care.",
      "created_utc": 1747440554.0,
      "score": 15
    },
    {
      "id": "mss7pex",
      "body": "[removed]",
      "created_utc": 1747484818.0,
      "score": 1
    },
    {
      "id": "msrp6sz",
      "body": "OP's sister knew what she was doing.",
      "created_utc": 1747474899.0,
      "score": 5
    },
    {
      "id": "mssg1np",
      "body": "I don’t think it’s OPs responsibility to tell the sister all that. The parents should be doing that. Sounds like they are at least taking this seriously and reported him, so hopefully sis will realize all this at some point. It’s just not the OPs job to tell her, she’s got enough to deal with",
      "created_utc": 1747488247.0,
      "score": 4
    },
    {
      "id": "msrdin4",
      "body": "Thank you for being the voice of reason, there are too many people in this post pointing blame at the sister as if she is a full grown adult that “hooked up” with OPs pedo ex husband, it’s absolutely wild.",
      "created_utc": 1747467365.0,
      "score": 2
    },
    {
      "id": "mspyult",
      "body": "OP does not HAVE to do anything.",
      "created_utc": 1747443284.0,
      "score": 30
    },
    {
      "id": "mspp904",
      "body": "While she was groomed 15 is old enough to choose not to sleep with your sister’s husband.",
      "created_utc": 1747439658.0,
      "score": 30
    },
    {
      "id": "msptcro",
      "body": "She was 15-16 and should know sleeping with her sisters husband is wrong and would deeply hurt her sister.",
      "created_utc": 1747441202.0,
      "score": 14
    },
    {
      "id": "mss092p",
      "body": "OP has no obligation to support her sister, she may want to distance and that’s absolutely okay after what they did to her even if she was groomed",
      "created_utc": 1747481320.0,
      "score": 10
    },
    {
      "id": "mssifnl",
      "body": "Listen, I GET that grooming is a thing. However at 15, you should know not to get involved with your siblings partner",
      "created_utc": 1747489167.0,
      "score": 12
    },
    {
      "id": "mssnw5s",
      "body": "What makes you say that?",
      "created_utc": 1747491167.0,
      "score": 45
    },
    {
      "id": "mssymi4",
      "body": "Have you ever heard of a throwaway?",
      "created_utc": 1747494772.0,
      "score": 31
    },
    {
      "id": "mssrmv9",
      "body": "It could be yeah. You never know. I once posted a story of my real experience and some commenters said it was fake and that my texts couldn’t have been what they were lol.",
      "created_utc": 1747492454.0,
      "score": 48
    },
    {
      "id": "mssy4dl",
      "body": "It’s called a throwaway. Her only posts and comments are related to this. Every post has someone claiming it’s fake with no proof. Sure, it could be, but none of us have any evidence so please stop spewing that shit while OP could be hurt.",
      "created_utc": 1747494605.0,
      "score": 35
    },
    {
      "id": "msss28t",
      "body": "I swear people believe anything on the internet",
      "created_utc": 1747492596.0,
      "score": -36
    },
    {
      "id": "msqgipb",
      "body": "She’s 17 now (the horrible relationship started when the younger sister was 15,) and that’s all the more reason it needs to be her decision. \n\nI think OP is just hurt and she will come around. She already definitely seems to understand at least some of it. \n\nI can’t say the same for some of the other people who commented though unfortunately.",
      "created_utc": 1747450127.0,
      "score": 20
    },
    {
      "id": "msq6k17",
      "body": "Agreed!",
      "created_utc": 1747446259.0,
      "score": 4
    },
    {
      "id": "mtpbk5c",
      "body": "Nah, you can easily order pills from AidAccess.\n\nSource: I live in Texas and distribute AidAccess pills to those in need here. Fuck the GOP.",
      "created_utc": 1747939849.0,
      "score": 1
    },
    {
      "id": "msq41m6",
      "body": "Thank you ❤️",
      "created_utc": 1747445285.0,
      "score": 17
    },
    {
      "id": "msxdb9v",
      "body": "Thank you for agreeing 🩷",
      "created_utc": 1747558532.0,
      "score": 2
    },
    {
      "id": "mspw1u0",
      "body": "I hope so, too. I don't think any relationship is possible if the baby is kept- victim or not",
      "created_utc": 1747442223.0,
      "score": 113
    },
    {
      "id": "msqy0it",
      "body": "More than just live under this cloud.  In my state, the father has rights.  He can refuse to approve/sign an adoption plan.  And if she raises the baby, he has parental rights.  So.... father/rapist will be a part of their lives.",
      "created_utc": 1747458340.0,
      "score": 13
    },
    {
      "id": "msr33o3",
      "body": "I hope so too, but if she thinks she's in love with him, she might keep it just to keep that connection.",
      "created_utc": 1747461123.0,
      "score": 6
    },
    {
      "id": "msprec1",
      "body": "Yep exactly. I wouldn’t be able to move on from this and I’d never speak to her again. Sure she’s a victim. But she’s also OPs sister. She was old enough to know how fucked up this is.",
      "created_utc": 1747440466.0,
      "score": 114
    },
    {
      "id": "msqcqjm",
      "body": "yes you can blame a wholeass adult for blaming her sister, a child, for being statuory raped by her husband.  \nshe sounds like the moms who kick their daughters out for \"stealing their man\" when they find out dad has been assaulting them.",
      "created_utc": 1747448634.0,
      "score": -12
    },
    {
      "id": "msvign4",
      "body": "Punishing a sexual abuse victim for being a sexual abuse victim is horrific, especially when it's your sister. This wasn't a grown sister sleeping with her man. This was a literal CHILD groomed and molested by her husband. Yes, I absolutely would blame her. She was betrayed by her husband. That's a terrible feeling. Her sister was sexually assaulted. Arguably much worse.",
      "created_utc": 1747525638.0,
      "score": 0
    },
    {
      "id": "msqgq2a",
      "body": "The husband is the villain.\n\nThe sister is only another victim.",
      "created_utc": 1747450211.0,
      "score": -14
    },
    {
      "id": "msqtylo",
      "body": "Thank you.  I'm so tired of seeing people say \"Children \" aren't developed until their brains are 25. I knew exactly what I was doing as a teenager. I was inexperienced in adult issues but I was able to make a choice. Again , not in any way that was forced. ",
      "created_utc": 1747456259.0,
      "score": 28
    },
    {
      "id": "msq98w8",
      "body": "The sister is a friggin child bro... she has no understanding of what went on for the time she was being groomed and to when she was SA'd, to now when he is being sent to prison, she has a form of Stockholm syndrome.\n\nShe cannot legally consent to sex with an adult at 16 or even 17, the grooming began when she was 14-15, you really do not understand this dynamic clearly.",
      "created_utc": 1747447306.0,
      "score": 2
    },
    {
      "id": "msq2hor",
      "body": "Also, room to just fall apart and be a goddamn mess if you need to. This is a super shitty situation and it's OK to not be strong. I hope you have someone outside the family that you can trust with your pain. I've appreciated someone checking in when I've been in shock and/or overwhelmed.",
      "created_utc": 1747444687.0,
      "score": 11
    },
    {
      "id": "msq9wx2",
      "body": "same the people acting as if a 16 yo is going to truly understand the situation should never have kids imo.",
      "created_utc": 1747447556.0,
      "score": 6
    },
    {
      "id": "mspzjlo",
      "body": "I was groomed at 14 up till I was 16 when a 40 yo man came to visit me to sleep with me, he ghosted me the next day and I was heartbroken and confused, he said loved me but then poof, it took me till I was 25 to say something to someone and even then It took me another 5 years to acknowledge I was groomed and SA'd.",
      "created_utc": 1747443548.0,
      "score": 15
    },
    {
      "id": "msquqx8",
      "body": "With age your friend will most likely realize what happened, but exactly how long until then is hard to know (and hard to speculate without details—don’t worry, not asking for any). Try to not hold any expectations, unfortunately a lot of the realizations that come with healing have to come from within her.",
      "created_utc": 1747456653.0,
      "score": 6
    },
    {
      "id": "msrtj2e",
      "body": "It literally depends. I knew what was happening to me was wrong a year before I came out with it. I was repeatedly told I would destroy my family and I didn’t want to do that 🤷‍♀️",
      "created_utc": 1747477611.0,
      "score": 1
    },
    {
      "id": "msyk9hb",
      "body": "If she has this baby do not help with it.\n\nBe prepared to go no contact with family.\n\nMake sure he gets put on the registered sex offender list.\n\nHe won't serve that much time. Child predators in the south rarely do. You're lucky if he even gets two years.\n\nWhen he is out. He will likely get partial custody. Yes, they allow this to rapists. The system is notorious for this. In the south.\n\nThen, your family will downplay the severity of what happened and invalidate everything you went through. They will make it all about your sister and paint it as him stepping up and being a good father or something similar. They will be supportive of a rapist if only to get out of the situation.\n\nThis is why it is best to cut contact before and not after. It will be especially painful if you do it after.",
      "created_utc": 1747578760.0,
      "score": 13
    },
    {
      "id": "msrp3hw",
      "body": "yes, i don't understant how so many people commenting on OP's sister being just a child, she is 16, not 7. at this age she definetly should have known that having 'a relationship' with your sisters husband is a no-no. if OPs husband started messaging her inappropriately, she definetly should have let OP know about this as soon as it started. people here would not be charitable to OP's sister if she was an adult.",
      "created_utc": 1747474841.0,
      "score": 14
    },
    {
      "id": "msq020k",
      "body": "It’s really not, but this would not qualify. The sister is not what they would consider a child, so nothing would happen to him.",
      "created_utc": 1747443743.0,
      "score": 12
    },
    {
      "id": "mst4lvq",
      "body": "I know. This creep literally used OP as cover to prey on her sister. There’s no timeline given, but I wouldn’t be surprised if their relationship began specifically because she had a young sister or young women in her life.",
      "created_utc": 1747496695.0,
      "score": -1
    },
    {
      "id": "msq0xh5",
      "body": "Somebody has to be an adult here. It is an untenable position to blame the 17 year old who was being groomed at 16 in this situation.",
      "created_utc": 1747444079.0,
      "score": -7
    },
    {
      "id": "mspu3jo",
      "body": "15 exactly dumb as a post 15 is a child still probably has teddy bears and posters in her room if he was into boys probably would have gotten the same result",
      "created_utc": 1747441484.0,
      "score": 6
    },
    {
      "id": "mspvb5y",
      "body": "How do you know she had a choice?",
      "created_utc": 1747441946.0,
      "score": 4
    },
    {
      "id": "mspzxlb",
      "body": "Def not old enough, peoples brains aren't fully matured yet till they're 25 or so, 15 doesn't know any better, I myself am an example of that and so are every other child that were 14-17 that have been groomed and SA'd.",
      "created_utc": 1747443697.0,
      "score": -4
    },
    {
      "id": "msrq1sb",
      "body": "finally somebody said this",
      "created_utc": 1747475453.0,
      "score": 0
    },
    {
      "id": "msqcsix",
      "body": "How would have she known if no one had taught her or explained it to her until this predator got a hold of her?",
      "created_utc": 1747448656.0,
      "score": -3
    },
    {
      "id": "msq015s",
      "body": "why are we blaming a teenager for the actions of an adult male pedophile?",
      "created_utc": 1747443734.0,
      "score": 4
    },
    {
      "id": "msu9tg3",
      "body": "im an idiot and i retract my statement",
      "created_utc": 1747510145.0,
      "score": 8
    },
    {
      "id": "msu9gvh",
      "body": "YO. i looked at op's account earlier on my lunch break. i now realize i must have accidentally hit the sub instead of op's username and that i was just scrolling through the fucking sub. im going straight to bed",
      "created_utc": 1747510025.0,
      "score": 12
    },
    {
      "id": "msu9pmi",
      "body": "no it literally is not fake. i checked op's history on my lunch break. i now realize i hit the sub instead of the username. i was just scrolling through the fucking sub, not his account. now that im home im going straight to bed.",
      "created_utc": 1747510109.0,
      "score": 8
    },
    {
      "id": "mst134i",
      "body": "Karma farming is the dumbest accusation like these people don't even use these accounts again. And getting karma isn't hard or a big deal.",
      "created_utc": 1747495563.0,
      "score": 27
    },
    {
      "id": "mtpwce5",
      "body": "As I said, it is against the law. It depends on their risk tolerance. All it takes is one offended person to blow the whistle for that reward money, and Ken Paxton is all over it and using you for his campaign rhetoric. I agree. Fuck the GOP and all the other hateful folks who live here.",
      "created_utc": 1747945916.0,
      "score": 1
    },
    {
      "id": "mtte0vs",
      "body": "While I agree with you from the safety of a foreign country, should you be saying such things openly on a public forum, given that (as I understand it) Texas has some kind of denunciation law against anyone involved in an abortion?",
      "created_utc": 1747999242.0,
      "score": 1
    },
    {
      "id": "msq6t5m",
      "body": "You’re welcome. \n\nIt just sucks how much *ick* a third hand account of this has given me. Poor OP! I just feel awful for her and her whole family. The world is so unfair and it’s such a dangerous place to be a woman/ girl.",
      "created_utc": 1747446356.0,
      "score": 37
    },
    {
      "id": "msqb39e",
      "body": "you do realize how difficult it is now to get an abortion in America, most states have laws against it no matter the age of the person giving birth, only in extreme cases, it can also be quite expensive, her father is trying to force her to keep the baby for religious reasons as well.",
      "created_utc": 1747448003.0,
      "score": 33
    },
    {
      "id": "mspruek",
      "body": "Yes. She was manipulated into being with him, an adult. That sucks. But one thing is believing she loves him and he's good and loves her (ew), but a different thing is believing it's ok to do that to your sister, for whatever reason.",
      "created_utc": 1747440632.0,
      "score": 81
    },
    {
      "id": "msq1i3n",
      "body": "she was groomed, it’s very hard for a 15 year old to “know” how fucked up it when you’re being preyed on",
      "created_utc": 1747444302.0,
      "score": 57
    },
    {
      "id": "msqct63",
      "body": "Okay",
      "created_utc": 1747448663.0,
      "score": 1
    },
    {
      "id": "msqb6jw",
      "body": "15 is old enough to know sleeping with her sister’s boyfriend would hurt her sister immensely.",
      "created_utc": 1747448038.0,
      "score": 46
    },
    {
      "id": "msqkw7u",
      "body": "Please don’t act like 15-16-17 year olds don’t know EXACTLY what they’re doing. They aren’t 5, they’re teenagers, they know right and wrong by this age. Stop making excuses for shitty behavior!",
      "created_utc": 1747452000.0,
      "score": 37
    },
    {
      "id": "msqwurs",
      "body": "Again I'm not saying in that case, she isn't 100% a victim. She is a victim. But at 15 you know enough about right and wrong that you should know sleeping with your sisters husband is not right.",
      "created_utc": 1747457735.0,
      "score": 25
    },
    {
      "id": "msr0dxy",
      "body": "Many of them may be quite young themselves. Or older and dealing with their own unprocessed trauma.",
      "created_utc": 1747459616.0,
      "score": -7
    },
    {
      "id": "mss0bsd",
      "body": "exactly, grooming is real but she was way old enough to know not to hurt her sister like that",
      "created_utc": 1747481358.0,
      "score": 11
    },
    {
      "id": "mst6ito",
      "body": "Mhm! That is how all these creeps be doing it.",
      "created_utc": 1747497309.0,
      "score": -1
    },
    {
      "id": "msqbp14",
      "body": "Let her parents be the adults, then.",
      "created_utc": 1747448233.0,
      "score": 23
    },
    {
      "id": "msrottd",
      "body": "It's not about blaming the victim, okay?  It's crucial to remember the OP is traumatized, and her sister played a big part in that.\n\nDon't tell the OP how to heal. If seeing her sister triggers her, she needs to protect herself.\n\nThat's not about blame; it's about how complicated trauma is.\n\nYou can't demand one traumatized person destroy themselves to help another heal..",
      "created_utc": 1747474665.0,
      "score": 10
    },
    {
      "id": "msqcmst",
      "body": "Groomed at 15.",
      "created_utc": 1747448595.0,
      "score": -2
    },
    {
      "id": "msqanal",
      "body": "grooming probably took place at 14 or 15 tbh.",
      "created_utc": 1747447834.0,
      "score": -2
    },
    {
      "id": "msqbx7p",
      "body": "She wouldn’t have claimed to be in love with him.",
      "created_utc": 1747448321.0,
      "score": 8
    },
    {
      "id": "mss44cq",
      "body": "Not blaming the sister, she was groomed and was taken advantage of. But she still chose to sleep with her sisters husband, still sent pictures and texts. Still went behind her sisters back. \n\nIt's not her fault that he went after her. But it was her choice to hurt her sister and \"fall in love\" with him. \nI hope she gets help, but OP doesn't need to forgive the betrayal.",
      "created_utc": 1747483199.0,
      "score": 10
    },
    {
      "id": "msrqhxi",
      "body": "op's sister betrayed op. at 15-16 she knew what she was doing.",
      "created_utc": 1747475734.0,
      "score": 10
    },
    {
      "id": "msq31hw",
      "body": "Because human beings are frikin terrible, apparently.",
      "created_utc": 1747444901.0,
      "score": 0
    },
    {
      "id": "msugcca",
      "body": "I genuinely wanted to know your perspective, maybe I'd missed some obvious clue.",
      "created_utc": 1747512317.0,
      "score": 3
    },
    {
      "id": "msujwri",
      "body": "One of those days huh? LOL",
      "created_utc": 1747513487.0,
      "score": 3
    },
    {
      "id": "mtttppl",
      "body": "That is correct. Everyone remotely involved with an abortion can be charged. The lawmakers are rabid when it comes to abortion.",
      "created_utc": 1748005264.0,
      "score": 1
    },
    {
      "id": "msq7m4i",
      "body": "So true.  I've been through far more than anyone should starting from early childhood until now.  \n\nThis is why when women were asked if they would rather be stranded in the wilderness with a man or a bear, most women chose the bear.  \n\nI hope the scumbag gets what's coming to him in jail.",
      "created_utc": 1747446669.0,
      "score": 21
    },
    {
      "id": "msr4tsl",
      "body": "Have you heard about the mom that they made an incubator in Georgia?",
      "created_utc": 1747462108.0,
      "score": 38
    },
    {
      "id": "msqow86",
      "body": "Well hopefully adoption is an option?\n\nY'all be hating on me for this comment,  but what if she lives in the US and can't get an abortion? She's 17! What if the parents are too old to parent the baby? OP probably ain't gonna take the baby from her sister. They have 3 options, which is the baby stays and stays within the family or goes to another family or, the pregnancy is terminated.",
      "created_utc": 1747453809.0,
      "score": -27
    },
    {
      "id": "mspyp3f",
      "body": "You both seem to not know what it is like to be groomed and SA'd at a young age, it warps your sense of self as well as how you view things, your brain isn't fully matured yet not until 25 or 26, the sister was still a child when all this was happening, and she really doesn't understand, I had a very similar experience, an older man groomed me when I was 14 then SA'd me at 16, said he loved me etc etc, he ghosted me the very next day and I was left heart broken and confused, I didn't seek help nor did I say anything to anyone for years not until I turned 25.",
      "created_utc": 1747443225.0,
      "score": 59
    },
    {
      "id": "msq9117",
      "body": "This\\^ it is wild for some people in here play mind gymnastics to blame the victim of the abuse especially when the victim is a child.",
      "created_utc": 1747447221.0,
      "score": 41
    },
    {
      "id": "msrcixa",
      "body": "They really don’t, especially after they were groomed for two years. You are sitting here blaming the victim of rape, btw she is not able to legally consent to sex with a full grown adult. She was raped and groomed, please google grooming so you have a better understanding how the dynamic and complexities that go along with that.",
      "created_utc": 1747466742.0,
      "score": 0
    },
    {
      "id": "msrc75d",
      "body": "You don’t though, at 15 you are pretty dumb on top of that she was fucking groomed… and statutorily raped, if you don’t know what it’s like to be groomed and SA’d then please move on.",
      "created_utc": 1747466537.0,
      "score": 3
    },
    {
      "id": "mst45i8",
      "body": "I understand what you’re saying, but OP removing herself from her sisters life for this set of circumstances is absolutely a form of blame. It is a punishment, whether intentional or not, for a decision that was made. \n\nTo hold that person to account for the act of being a victim is untenable. Going in this with a “I don’t know if I want a relationship with my 17 year old sister that I fail to recognize as a victim attitude is unbecoming.”",
      "created_utc": 1747496549.0,
      "score": -2
    },
    {
      "id": "msqhjul",
      "body": "That's literally what grooming does though.",
      "created_utc": 1747450557.0,
      "score": -4
    },
    {
      "id": "mst6y52",
      "body": "She didn’t sleep with an adult man, she was groomed and raped. Why is this so hard for you to grasp?",
      "created_utc": 1747497445.0,
      "score": -1
    },
    {
      "id": "mst7t0x",
      "body": "She really didn’t know because she was still a dumb teenager who was friggin groomed by a pedophile.",
      "created_utc": 1747497723.0,
      "score": -1
    },
    {
      "id": "msuzi85",
      "body": "i checked op's account on my lunch break. i accidentally hit the sub name instead of the username. i was just scrolling through the fucking sub. got home from work and i immediately took a nap lmao",
      "created_utc": 1747518768.0,
      "score": 8
    },
    {
      "id": "msuzav9",
      "body": "yes. came home from work and desperately wished i could take my brain out of my head and give it a quick rinse. coworkers driving me fucking insane im losing sleep over it lmfao",
      "created_utc": 1747518697.0,
      "score": 4
    },
    {
      "id": "msr8dk3",
      "body": "That poor woman. I read as well that the fetus is 9 weeks? I mean, it’s a horrific practice in any situation but I could understand the logic a bit more if the baby was like 38 weeks or something. 9 weeks isn’t a baby.",
      "created_utc": 1747464212.0,
      "score": 35
    },
    {
      "id": "msqvvdk",
      "body": "That does sound like a lovely option. Let’s start with why should a groomed minor have to carry that child to term and experience birth. Maybe they do want to. Maybe instead of living as a mother at that age, adoption is their path.        \n\nHow many do you know who adopt before trying traditional/biological, then IVF, etc? No, I don’t have data on this, just my own observations that adoption is almost always last after that including surrogacy and donors. Humans have far more ego than the ideal, we’ve gotta have our mini me we’ve had a say in. If we’re paying a lot, which is the case for all those paths, why not have it be “part of me.”        \n\nNot everyone shares if their family is fueled by adoption, and I’m not saying my lived experiences are all encompassing. I’ve just only known of one publicly adopted kid (outside of re-married type situations) ever.       \n\nAgain, a victim shouldn’t have to carry their predator’s offspring. If they want to, who is footing the bills if they choose to birth and go for adoption? How many active and qualified adoptive parents are out there vs undesired pregnancies?      \n\nYour comment is a possible reality while also sounding idealistic. I wish more people would adopt. Reality is they don’t.",
      "created_utc": 1747457226.0,
      "score": 23
    },
    {
      "id": "msq0622",
      "body": "Yeah that's bad and she's a victim of what he did to her. There's still what she did to her sister though and while the sister shouldn't be mean to her, she also doesn't have an obligation to be nice or close.",
      "created_utc": 1747443786.0,
      "score": 54
    },
    {
      "id": "msr71rk",
      "body": "\"Your brain isn't developed until you're 25\" is misinformation brought about by people misunderstanding a study on brain plasticity, which is now being weaponized by assholes worldwide to deny young adults agency because \"look! this study says you're still Really Children! therefore you can have your autonomy disrespected or revoked!\"\n\n***The study ENDED when the participants were 25***, it did not \"conclude\" that that was when their brains \"stopped maturing.\"\n\nYour brain NEVER \"stops maturing\" unless you stop LEARNING. It is not a static organ, it is always changing with every book you read, every skill you practice, every problem you solve.\n\nPlease, for the love of God, stop spreading that nonsense.",
      "created_utc": 1747463417.0,
      "score": 25
    },
    {
      "id": "msqjgxu",
      "body": "It’s decision making and impulse control that isn’t developed yet, not understanding. The sister is most definitely a victim- he took advantage of this to influence her decisions and actions, which is not her fault. But she definitely knew it was wrong (maybe not in the moment).",
      "created_utc": 1747451376.0,
      "score": 8
    },
    {
      "id": "msqow2k",
      "body": "I might come up as a monster here but at 15yo you know that fooling around with someone else's boyfriend is not ok, let alone a married man, let alone YOUR *sister's* husband. You don't need to be 40 to know that.\n\nHe was predatory and disgusting and deserved to be arrested because what he did was illegal but she knew what she was doing was wrong. \n\nI would find it very hard to forgive her or have a normal relationship with her",
      "created_utc": 1747453807.0,
      "score": 51
    },
    {
      "id": "msqb1wo",
      "body": "15 is old enough to know that hooking up with your sister’s so is not going to be cool for your sister.",
      "created_utc": 1747447988.0,
      "score": 49
    },
    {
      "id": "mstxlcg",
      "body": "This is true. But in my opinion OP isn’t under any obligation to continue any kind of relationship with her sister.",
      "created_utc": 1747506007.0,
      "score": 5
    },
    {
      "id": "msrehzs",
      "body": "I don’t need you to tell me to Google terms I understand, thanks though, I think there is plenty of room to hold a nuanced view in that yes it was wrong she was groomed and the guy is wrong, she is ALSO WRONG for being grown enough to know that fucking her sisters husband would not end well and would be hurtful toward her sister. Maybe Google “nuance” and two truths can be true at the same time.",
      "created_utc": 1747467979.0,
      "score": 15
    },
    {
      "id": "mst5ouz",
      "body": "Trauma, including one-time, multiple, or long-lasting repetitive events, affects everyone differently. \n\nSurvivors’ immediate reactions in the aftermath of trauma are quite complicated and are affected by their own experiences, the accessibility of natural supports and healers, their coping and life skills and those of immediate family, and the responses of the larger community in which they live. Although reactions range in severity, even the most acute responses are natural responses to manage trauma.\n\nPrioritizing one sibling's trauma over another's is inappropriate; each individual's experience requires acknowledgment and support.  Dismissing a person's natural responses to trauma is not conducive to healing.\n\nYou're basically saying that the OP is not allowed to her natural responses to trauma and you're basically saying she's not allowed to heal if healing requires going no contact with her sister.",
      "created_utc": 1747497041.0,
      "score": 4
    },
    {
      "id": "mstd7z7",
      "body": "so op's sister is dumb enough not to know anything about relationships at all? at age of 15-16? either she thought that this is normal which i highly doubt or she knew what she was doing. teenagers might be unexpirienced and naive but they are definetly capable of malicious intent.",
      "created_utc": 1747499492.0,
      "score": 7
    },
    {
      "id": "msv0vj5",
      "body": "Ah, gotcha lol",
      "created_utc": 1747519255.0,
      "score": 3
    },
    {
      "id": "msr9kwe",
      "body": "Last I heard,  the woman went brain dead when she was 9 to 11 weeks. Which is insane.  A fetus doesn't even have a proper heart until like week 10. The woman has been like this since February and is 21 wks. I would want someone to just commit to unplugging everything at that point.",
      "created_utc": 1747464927.0,
      "score": 27
    },
    {
      "id": "msr4qwz",
      "body": "I'm not saying that she should carry the baby/fetus, but depending on where she lives, (cause the USA suuucks) she might not have a choice.  And I know that the foster care system also sucks.  But we don't know how likely it is that anyone in that situation will want that baby because of who the sperm donor is. And unless they terminate or put it up for adoption,  the sperm donor (unless they stay in jail/ prison for a good long time) will have a foothold in that familys life.",
      "created_utc": 1747462061.0,
      "score": 9
    },
    {
      "id": "mst1065",
      "body": "Yeah if she’s in Tennessee she’s fucked. She HAS to keep that baby. Speaking as a woman who lives in this hell hole. Hopefully they aren’t in the USA and if they are somewhere she can get an abortion if that’s what she wants.",
      "created_utc": 1747495537.0,
      "score": 1
    },
    {
      "id": "msq7xfs",
      "body": "No one should be blaming the victim of sexual grooming, everyone should be blaming the adult aka pedo ex-husband for his abuse of this child.",
      "created_utc": 1747446789.0,
      "score": 23
    },
    {
      "id": "msvj0vb",
      "body": "She was groomed. What part of that is escaping your grasp?",
      "created_utc": 1747525849.0,
      "score": 1
    },
    {
      "id": "msqkouu",
      "body": "Right. At 15 we know cheating is wrong, let alone with your SISTERS HUSBAND. Grooming aside, she knew and knows it was wrong to do. Sister isn’t wrong to distance herself.",
      "created_utc": 1747451909.0,
      "score": 47
    },
    {
      "id": "msqgm7l",
      "body": "15 yos are some of the dumbest people on the planet , with good reason as they are still CHILDREN .",
      "created_utc": 1747450166.0,
      "score": 28
    },
    {
      "id": "msqum3w",
      "body": "She didn't hook up, she was *groomed* and *statutory raped* by him. 15 y/os and blackout drunk 25 y/os have similar levels of understanding long-term consequence, decision-making skills, and ability to consent. Which is none.",
      "created_utc": 1747456585.0,
      "score": 14
    },
    {
      "id": "mswzq8s",
      "body": "This whole conversation is wild. \n\nThe whole purpose of grooming is to override the victim's own moral judgements and replace it with whatever ideas will further the groomer's plan. It's a non-violent technique in which the groomer use the victim's vulnerabilities to gain control over them. Without that psychological coercion, it wouldn't be grooming. It would just be violence and rape. \n\nI'm sure OP's sister still believes cheating is wrong. But she's been the victim in a years-long manipulative campaign that has probably positioned her as the \"true partner\".\n\nOP's sister didn't \"hook up\" with anyone. She's a victim of child sexual abuse. She now has a significantly increased risk of poor general health, mental health disorders, self-harm, suicide, substance abuse disorder, etc.",
      "created_utc": 1747550077.0,
      "score": 3
    },
    {
      "id": "mst803u",
      "body": "You really do not understand tbh, you truly don’t.",
      "created_utc": 1747497787.0,
      "score": -8
    },
    {
      "id": "mstdzn4",
      "body": "She was groomed is that hard to understand, she doesn’t know any better because the grooming took place when she was even younger.",
      "created_utc": 1747499743.0,
      "score": -1
    },
    {
      "id": "mth9aqu",
      "body": "That's so monstrous. ",
      "created_utc": 1747837746.0,
      "score": 1
    },
    {
      "id": "msxo3i5",
      "body": "Texas.   It doesn’t get any worse.",
      "created_utc": 1747565223.0,
      "score": 3
    },
    {
      "id": "msq85fx",
      "body": "No one is blaming her for what he did to her though.",
      "created_utc": 1747446875.0,
      "score": 32
    },
    {
      "id": "msvlafi",
      "body": "I agree wholeheartedly. She is still capable of understanding what she did hurt her sister. Doesn’t mean she should be blamed",
      "created_utc": 1747526726.0,
      "score": 1
    },
    {
      "id": "msrc23t",
      "body": "The ones blaming the child in this situation are the same weirdos who would ask “what was she wearing.”",
      "created_utc": 1747466450.0,
      "score": 14
    },
    {
      "id": "mstzkjq",
      "body": "You don’t know anything about my life so cut the condescending crap. Life has more nuance that this.",
      "created_utc": 1747506675.0,
      "score": 5
    },
    {
      "id": "mstix6o",
      "body": "well it's not like op's sister's brain is not developed enough to not understand a concept of sex and that the guy whom she claims to 'love'  was her sister's husband and not some random dude.",
      "created_utc": 1747501324.0,
      "score": 4
    },
    {
      "id": "msr6yzu",
      "body": "Lots of people are, actually.",
      "created_utc": 1747463371.0,
      "score": 10
    },
    {
      "id": "msq8rzj",
      "body": "[deleted]",
      "created_utc": 1747447121.0,
      "score": -15
    },
    {
      "id": "msviwbh",
      "body": "They absolutely are. And you're one of them. You're taking out both sides of your mouth here about her. She's a victim. She didn't DO anything to her sister. She was victimized by a child predator. Fuck anyone in here blaming her, including people in her family.",
      "created_utc": 1747525801.0,
      "score": 0
    },
    {
      "id": "mstj95i",
      "body": "Her sisters husband pursued a young girl, he is a pedophile who groomed a child to the point where she thinks she’s in love, you’re really going to sit here and act as if the young sister pursued this freak.\n\nWhy have you not called OPs husband a pedo?",
      "created_utc": 1747501432.0,
      "score": 0
    },
    {
      "id": "msq9vya",
      "body": "She's not blaming her for what he did to her. She's just rightfully upset for what her sister did to her. Which are two different things. She was manipulated into believing she was in love and she was loved and that it was right. That's apart from the betrayal that OP feels which is justified. She does have an obligation to forget what was done. \n\nThe sister wasn't in a position to consent and she didn't think she was being taken advantage of and was being hurt herself, but she must have known that it would hurt her sister. She needs therapy and her parents' support. And for the guy to be locked up because if the dad is as conservative as OP said, he might think it's ok for them to be together for the baby. But OP doesn't have to do anything other than think of herself rn",
      "created_utc": 1747447546.0,
      "score": 37
    },
    {
      "id": "mstjzep",
      "body": "ok, if op's sister saw the guy trying to pursue her, why didn't she tell this to op? op claims it started with inappropriate messages, what was stopping op's sister from telling this to op? at 15 years old she was not old enough to tell if those messages were inappropriate or not?",
      "created_utc": 1747501665.0,
      "score": 5
    },
    {
      "id": "mstkctm",
      "body": "also why having private messaging with your sisters husband at all?",
      "created_utc": 1747501785.0,
      "score": 2
    }
  ]
}