{
  "id": "1g6dv6p",
  "title": "Im tired of being famous, and it’s not what i want anymore",
  "selftext": "Hoping this doesn’t backfire on me.\n\nI’ve been out of the spotlight recently but I’ve been doing this for over a decade now. Tours, albums, etc. It’s exhausting and I don’t know if I’m ready to go back. I still love making music, but I used to love performing and interacting with fans. Now I feel like I’m trapped. I know a lot of people dream about being in my position but I’ve been just so burnt out. I wish I could walk down the street without feeling like everyone is watching me. I wanna go to the grocery store without a hoodie and sunglasses pretending I’m someone else just to avoid being “spotted.” The constant pressure to be perfect, always “on,” always performing. it’s exhausting.\n\nDon’t get me wrong, I’m incredibly grateful for everything but damn the personal cost feels soo heavy. Having a real conversation with someone outside the industry feels impossible. Everyone is either in it for the clout or some connection. It’s hard to tell who’s genuine and that’s a lonely place to be.\n\nLately I wonder what my life would’ve been like if I’d never gotten famous. Would I be happier? More grounded? Guess I’ll never know but I can’t help but think about it more and more lately. \n\nAnyway thanks for reading, I’ll prob delete this soon.",
  "created_utc": 1729242995.0,
  "score": 7106,
  "num_comments": 1642,
  "url": "https://www.reddit.com/r/offmychest/comments/1g6dv6p/im_tired_of_being_famous_and_its_not_what_i_want/",
  "comments": [
    {
      "id": "lsib7j4",
      "body": "This is what Avicii felt, too.\n\nI'm not sure if there are therapists that specialize in this sort of stuff but I've often thought \"why don't these people break from the pressure?\" Turns out they do.\n\nGet help, because it can get worse.",
      "created_utc": 1729249401.0,
      "score": 4872
    },
    {
      "id": "lsi72re",
      "body": "I dunno. There are plenty of celebs who manage to stay out of the lime light. Can you maybe contact others in your field who arent and see how they manage things?",
      "created_utc": 1729247040.0,
      "score": 655
    },
    {
      "id": "lsi1plu",
      "body": "I live under a rock and if I saw you I guarantee I would have no idea who you are! Hope this helps",
      "created_utc": 1729243580.0,
      "score": 6111
    },
    {
      "id": "lsi5hhk",
      "body": "You can get burnt out doing something that you love. That's okay.\n\nJust because you've succeeded and many others would love to be in your position doesn't make your hard work any less valuable OR you any less tired. \n\nIf you're able to, perhaps explore other talents you have. I'm sure you have many. Pour into things that make you feel well rounded and grounded. And reach out to your trusted circle.\n\nIf you need to step back, there is NO shame in that.",
      "created_utc": 1729246058.0,
      "score": 1388
    },
    {
      "id": "lsinjcr",
      "body": "I got over 100 Facebook friends, so I know exactly how you feel.",
      "created_utc": 1729255124.0,
      "score": 2166
    },
    {
      "id": "lsincql",
      "body": "tell us who you are and we can cancel you",
      "created_utc": 1729255047.0,
      "score": 6782
    },
    {
      "id": "lsi970i",
      "body": "I wonder if OP really is famous. Imagine, we all contributing to someone's LARP. :D",
      "created_utc": 1729248284.0,
      "score": 2062
    },
    {
      "id": "lsifgi8",
      "body": "My Brother was famous in the 90’s for music but he is kind of an introvert so now that he’s older he’s a guitar tech and tours with different bands. Most of the bands are people he personally knows from the industry, he has side projects just making music. This seems to work for him. If you are making good money, invest it wisely so you are in a position to do something else. Money is power- you can just reinvent yourself. \nFame is pretty toxic and attracts toxic people to you- I wish you happiness.",
      "created_utc": 1729251541.0,
      "score": 306
    },
    {
      "id": "lsiki2h",
      "body": "i mean look at kate bush or bjork, super famous, super low profile. its possible",
      "created_utc": 1729253831.0,
      "score": 651
    },
    {
      "id": "lsix1d5",
      "body": "I ignore famous people whenever I see them in public.  It just feels weird approaching them. They're total strangers to me.  Just because they did some stuff doesn't mean I should bother them.",
      "created_utc": 1729258771.0,
      "score": 265
    },
    {
      "id": "lsi8i0n",
      "body": "Heaps of famous people move to Aotearoa new Zealand. People won't recognise you here. If they do, they probably won't care much about your fame. If they do, they'll most likely have the decency to leave you alone. Tall poppy syndrome n all that.",
      "created_utc": 1729247886.0,
      "score": 349
    },
    {
      "id": "lsia0r9",
      "body": "Move to Japan. No one will recognize you.",
      "created_utc": 1729248754.0,
      "score": 281
    },
    {
      "id": "lsir4zt",
      "body": "Being on the other side of fame, I can say it looks awful. I’ve had a very small version of this for other reasons and it makes you start to isolate and when you’re not “on” you like to be at home and not go out. The worst part is no one wants to listen to you complain because you have the success and money. So you isolate more. I hope you find the right answer and peace.",
      "created_utc": 1729256552.0,
      "score": 88
    },
    {
      "id": "lsivs1h",
      "body": "Move to New York and be one of the crowd. There's a reason why so many live here and putter around. Go back to school if you desire something different, be creative and write or paint, or find meaning in charity work helping to make the world a better place. You can be the next David Lee Roth who was a paramedic, or John BonJovi who is puttering around in his restaurant, at his kid's game (back in the day), or saving people on bridges. Ehh, celebrity rarely phases us. Don't you see Ed Sheeran walking around trying to get attention? New Yorkers are so blasé about celebrity most of the time that actually takes him a while to gather a crowd - and most of them are tourists. And if you are Ed Sheeran, please stop that, it's holding up sidewalk traffic.",
      "created_utc": 1729258303.0,
      "score": 83
    },
    {
      "id": "lsi6c7d",
      "body": "[deleted]",
      "created_utc": 1729246592.0,
      "score": 162
    },
    {
      "id": "lsi4j2z",
      "body": "Couldnt do it. If moneys no object, just stop/ reset.",
      "created_utc": 1729245445.0,
      "score": 99
    },
    {
      "id": "lsiwxwx",
      "body": "Alot of famous people just move to small towns where the \"oh my god it's that famous person\" novelty wears off pretty quick and yeah everyone in town knows they live there but nobody treats them any different.",
      "created_utc": 1729258736.0,
      "score": 89
    },
    {
      "id": "lsi8d0o",
      "body": "You could write songs and sell them for other famous people to sing. \n\nHonestly, you may need to look at your surroundings as others are saying.\n\nI likely wouldn’t know you. I’m middle aged, don’t care who you are or what you do. And I grew up with groupies going after my dad and would never behave in such a way 🤢. \n\nFind an area of the country/world that has a low % of your target demographic and visit. Or wear a disguise (a good one)?",
      "created_utc": 1729247803.0,
      "score": 187
    },
    {
      "id": "lsipmjd",
      "body": "I personally don’t get why people obsess over celebrities. Everyone is living whatever life they’re living, I don’t care what people in my life are doing everyday… why would I do that to someone I don’t know? It’s wild. \n\nFunny thing is tho: I served Willie Nelson once in a bar and just assumed his familiar face was the usual regular bar fly in the place. One of the funniest stories I have to tell people. Natalie from the Dixie Chicks lived near my grandma before she had her downfall. I looooved their music and didn’t recognize her in person at the Christmas party.",
      "created_utc": 1729255967.0,
      "score": 80
    },
    {
      "id": "lsix97q",
      "body": "Chappell roan is that you",
      "created_utc": 1729258851.0,
      "score": 385
    },
    {
      "id": "lsj6pcz",
      "body": "This is why I’m obsessed with Reddit. \n\nI’m pretty well known too. I’m not a celebrity but I have a big social media presence and Reddit is where I thrive and talk ahit.\n\nI totally understand",
      "created_utc": 1729262085.0,
      "score": 70
    },
    {
      "id": "lslyc9z",
      "body": "please take in the recent death of liam payne. it is incredibly tragic and shows how little the industry cares about its artists. i’m not saying quit music forever, but remember that you are YOURSELF and you are a person before the music, albums, tours, etc. of course, liam’s death is extremely tragic, but it shows how over the years, fame can become too much to handle. it’s happened with plenty of other celebrities before too. \n\ni think the most important thing to take from this is communication is key. tell people how you are feeling. make amends. start arguments. i’m not sure how knowledgeable you were of one directions fandom, but i was a part of it and we are completely in shambles. it is so. important to tell people how you feel because you have no idea if that day is their last. \n\nyes, no one outside your bubble will ever understand, but know that they care. they acknowledge your talent, work ethic, kindness, all of the above. i think had i been at that hotel and liam wanted to talk, or you were on a random bench and wanted to vent, and i knew for a fact who you were, i would sit there and listen as your peer. despite your fame, you are still YOU and no amount of money or followers can change that. not everyone will think the same as me, but i think in light of recent events, people are starting to realize how incredibly difficult it is to be famous. i cannot even begin to imagine the work you do. \n\nhave you ever thought of moving to a smaller town? i have several BIG name celebrities that live in my town and are often seen about, and i myself have served them at work and sat next to them at the nail salon. it seems that most people have a sense of respect, because we know they’re people too. you’re here to live a normal life, not hide in a sweatshirt to walk two blocks to get a coffee, and i think small town folk tend to understand that. just something to consider. going somewhere smaller might help with that feeling of being watched by everyone. going along with this, i have a friends that attended college with a celebrity. at first, everyone wanted to be their friend, but by the end of the first month, everyone realized they’re just. another. person. they just also are extremely talented and are recognized for that talent. maybe establishing yourself somewhere not work related can help create relationships outside of the industry. \n\nmaybe i have too much faith in people, but i truly believe if you were to tell this to someone, they would respect you. i hope that you’re able to find relief from your - i’m sure, very hectic - life, and create true connections outside of your fame. know that there are people out there that want to know you for YOU and not your status. you just have to find them, but i promise they’re out there.",
      "created_utc": 1729295273.0,
      "score": 643
    },
    {
      "id": "lsi8b6b",
      "body": "I live in an area w a few older famous people\n\nI was behind one of them at a shop the other day and had a nice convo w another 2 weeks ago as she was heading to her daughters 40th bday.\n\nyour line of work sucks. connections and clout u said it.\n\nbut u be the genuine person and find stuff outside of work maybe\n\nthese older people. no one recognises them any more. I do. but im 40s. the youngens dont have a clue.\n\nalso there's places out there where u can be pretty anon. that's why these people settled here all those years ago. people didnt bother them nor gave 2 shits about their jobs.",
      "created_utc": 1729247774.0,
      "score": 34
    },
    {
      "id": "lsi9co8",
      "body": "Is it possible to play music under a totally different name. Not like Garth Brooks did but like super low key, like Duke Silver from Parks and Rec? \n\nMy uncle is in the E Street Band but he isn’t Steve V, he replaced him back in the 80’s. I always thought he had the just the right amount of success. He lives comfortably off music but can walk around like a normal person. He does get recognized but only by musical diehards. \n\nAnyway, maybe a Duke Silver thing could work? Sorry you’re feeling so stuck and isolated. Reddit is a great place to connect even if it’s virtual.",
      "created_utc": 1729248375.0,
      "score": 53
    },
    {
      "id": "lsigw16",
      "body": "How about a break? Take all that money and get a university degree. Could widen your horizon and later you can still continue to do music if you want.",
      "created_utc": 1729252207.0,
      "score": 22
    },
    {
      "id": "lsj2005",
      "body": "J- as in Justin Bieber ?😏",
      "created_utc": 1729260508.0,
      "score": 19
    },
    {
      "id": "lsilvh6",
      "body": "To be honest, life is pressure. If you had a different career you might not be able to pay your rent, living in poverty, you might be in an unhappy relationship with or without fame. You just get to experience the ups and downs of life with the ability to be recognised for your art, and paid handsomely for it. Sure the grass is greener but ultimately sounds like you’re probably extremely lucky.",
      "created_utc": 1729254424.0,
      "score": 19
    },
    {
      "id": "lsjy4hi",
      "body": "Zayn?? It's you, man??",
      "created_utc": 1729270793.0,
      "score": 14
    },
    {
      "id": "lsikdkt",
      "body": "I don’t know if this will help?  I’m not in your position but I understand feeling burnt out and needing to keep a face of perfection on all the time.  \n\nSometimes that feeling is a warning - so, take some time, remove the pressures!  You’re still in control of you!  And your success may suffer but you did it once so maybe go back when you’re ready or choose a new path x \n\nYou don’t have to punish yourself because what other people perceive as success or the ideal!  \n\nIf it’s too much now bow out x don’t let yourself be consumed with these feelings because in the end it catches up on you x \n\nTake care x",
      "created_utc": 1729253777.0,
      "score": 13
    },
    {
      "id": "lsi8nhb",
      "body": "To you, whoever you are. \nI look up to you and what you’re doing. You’ve got this and you’re strong. I’m 30 years old and when I grew up, I went through a lot of trauma. I’m lonely in this world, and this year I’ve decided I would start taking music lesson, so that one day I can bring my music out, and let the world know about my story, and to inspire, and to condemn the bad.\n\nArtists like you are people I wish to become. You have done great for the world, and so got what others dream to have. Everything comes with a cost. To be a nobody like me is to go to bed, thinking about all the dreams I could not achieve, and to face the judgement of my own self. To be successful and famous like you, comes with troubles no one else understands. We all share the same pain, and that is loneliness. We must carry the cross behind our back and continue walking up the hill. Living requires sacrifice. I salute to you for having made it, and I hope one day I will become like you. Remember, you made a choice, and you are successful. You inspire people, and for that you are great! Please continue being a legend. Be strong for us, show us you have hope, so we all have hope. You have got this!! And we are/I am here for you.\n\nMay peace be with you!",
      "created_utc": 1729247973.0,
      "score": 75
    },
    {
      "id": "lsilq8o",
      "body": "Why do I get the impression that you are a Country Music artist?",
      "created_utc": 1729254362.0,
      "score": 10
    },
    {
      "id": "lsipj8x",
      "body": "[removed]",
      "created_utc": 1729255931.0,
      "score": 12
    },
    {
      "id": "lsi88p2",
      "body": "Is it possible to pick up and move somewhere obscure?  Figuring could not be anywhere Los Angeles, Nashville , Chicago etc.  but small towns, mountains, could be escape. Maybe travel a bit under radar and search for a peaceful place.",
      "created_utc": 1729247733.0,
      "score": 34
    },
    {
      "id": "lsirvyh",
      "body": "This sub should be renamed r/creativewritingpractice",
      "created_utc": 1729256842.0,
      "score": 37
    },
    {
      "id": "lsiidv7",
      "body": "I always have such a hard time with this. I sympathize and empathize with mental health and burnout, but I know that level of fame and recognition very seldom just falls into your lap.\n\nI spent a decade pursuing this very life. Almost 2, if you count learning the instrument, song writing, and developing a stage presence/persona. Romantic, friend, and familial relationships sacrificed in pursuit of the dream. I slept 4 or 5 hours a day for that entire period. Every waking hour was spent revolving around making it. If I wasn't booking a show, I was writing a song. If I wasn't writing a song I was planning a stage show to make us stand out, working social media, networking, or working a dead end job to pay my bills and take merchandise from the store *for the show*.\n\nMe and the guys didn't have backup plans because we needed to be in an all or nothing situation. We didn't want to have an out when things got too hard. Eventually, they just resented me because they all did the same following my lead, and there was nothing to show for it. One day the bottom fell out and I landed on my fucking face. It took me 4 years to figure out who I even was because my formative years and entire adult life up to that point were spent chasing the dream. I had no money, no savings, no marketable skills, and my credit was absolute trash. \n\nMental health issues don't go away just because there's no fame or recognition. You just question everything in the opposite when you're down.\n\nIf you're not, OP, please work with a health professional to work through your feelings. You've worked very hard and sacrificed to be where you are.",
      "created_utc": 1729252891.0,
      "score": 11
    },
    {
      "id": "lsiniqc",
      "body": "I was unknowingly an a-list music legend’s barista for about a year. He’d come in right when we opened (small enough coffee shop where it was usually just me working the morning shift) in sunglasses and a hoodie. I thought he was just an erratic older gentleman that didn’t like being in public but wanted his morning fix. I’ve seen what the toll of being famous has taken on him. I could imagine me being clueless was a reprieve. He eventually opened up and started talking about every random thing under the sun once I assume he realized I genuinely didn’t know who he was.\n\n I hope you find this kind of relief. I’m sorry you’re going through this. I can imagine it’s pretty lonely. I’m not going to pretend I know what it’s like to be in your type of situation, I’m just sorry it’s happening. ",
      "created_utc": 1729255117.0,
      "score": 10
    },
    {
      "id": "lskl5lt",
      "body": "Have you tried wearing a disguise like this 🥸?",
      "created_utc": 1729278149.0,
      "score": 11
    },
    {
      "id": "lsiu5s1",
      "body": "I always say I’d hate to be a celebrity. Can’t scratch your ass or just have a bad day without it becoming a massive thing. The pressure and attention ain’t worth the money. Fk fame",
      "created_utc": 1729257695.0,
      "score": 21
    },
    {
      "id": "lsi7vvi",
      "body": "I feel for you. It’s crazy how little boundaries are respected these days, it feels like everyone is just trying to take what they can get in every situation for as long as they can and they don’t care what it does to you. Money and time. \n\nSounds like you have done what is best for you and taken some steps back but it also sounds like you want to be back. \n\nIs there anyway that you can get in behind the scenes or slowly expose yourself? \n\nThe more barriers in place as you start to tread back in the more you can check in with yourself. I don’t know you or what you have been through or tried. I do think that putting this message out there means that you have hope that you will find a way. Don’t let go of it ❤️\n\nAnd worst case scenario, try something completely new. Take an online college class, learn another language with a private tutor, write music and don’t go in tour for a  bit, start a farm (in house or out of house).  \n\nI hope that you find a way ❤️",
      "created_utc": 1729247523.0,
      "score": 17
    },
    {
      "id": "lsicv6z",
      "body": "There's always going to be struggle on any path we choose to walk...or is chosen for us. Find your good people and lean on them now. I'm sorry you're having a hard time now friend.",
      "created_utc": 1729250263.0,
      "score": 8
    },
    {
      "id": "lsilgcb",
      "body": "Fame sounds terrible. I enjoy my anonymity. I hope you find peace in whatever way you can get it.",
      "created_utc": 1729254243.0,
      "score": 15
    },
    {
      "id": "lsi91h9",
      "body": "I’m sorry that you’re feeling this way.\n\nI think my biggest take away from Liam Payne passing away wasn’t his addiction but the constant phones in his face and how impersonal and isolating “fame” actually is. Everyone seems to be chasing fame nowadays.\n\nI agree with other comments that some celebrities seem to find a balance or reach a point where it’s time to walk away and be happy and I think that comes from realising external validation isn’t healthy.\n\nHopefully you can find that balance and happiness.",
      "created_utc": 1729248195.0,
      "score": 8
    },
    {
      "id": "lsimlax",
      "body": "No. You wouldn’t be more happy if you didn’t get famous. You’d still be grinding trying to make it. I’m choosing to believe you’re not just larping here. \n\nI’m curious what part of the industry you’re actually in that you feel so disconnected in. I promise if you talk to some hired musician making $300 a show for more than five minutes you’ll discover some grounding.",
      "created_utc": 1729254726.0,
      "score": 8
    },
    {
      "id": "lsjhe3a",
      "body": "Nice try Diddy",
      "created_utc": 1729265516.0,
      "score": 26
    },
    {
      "id": "lsikhxh",
      "body": "Everything has a downside.",
      "created_utc": 1729253829.0,
      "score": 5
    },
    {
      "id": "lsj1v73",
      "body": "Move to a small town and that will take care of that issue. Good luck",
      "created_utc": 1729260462.0,
      "score": 7
    },
    {
      "id": "lsj0wh9",
      "body": "[removed]",
      "created_utc": 1729260127.0,
      "score": 20
    },
    {
      "id": "lsjjfgx",
      "body": "[deleted]",
      "created_utc": 1729266160.0,
      "score": 17
    },
    {
      "id": "lsio39a",
      "body": "Being totally serious about this: I'm assuming you're fairly young. Get an apartment or a house near a 55-plus community. i think you'll find you'll be able to walk around without being recognized. \n\nAside from that, if you don't want to go back to doing it and have the means to live comfortably, don't. Write songs under a pseudonym, do something else that feeds your creative energy.",
      "created_utc": 1729255352.0,
      "score": 12
    },
    {
      "id": "lsi2uzr",
      "body": "Read Rick Rubin (your field) or watch his YouTube videos on Ways of Being.",
      "created_utc": 1729244358.0,
      "score": 6
    },
    {
      "id": "lsi4u0e",
      "body": "I can’t imagine the toll it must take to live a life where anonymity is near impossible in your day-to-day life. Having lightly grazed the music industry a couple times, I figured out early on I wasn’t built for it. I hope beyond hope that you have an opportunity at some point to find peace, find people who will be able to be honest with you— I know there are way too many “yes” people in the industry and I can’t imagine being content being told yes not because I’m right but because they gain something from it. Regardless, take a breath, evaluate and take stock of the good things you’re afforded by your status. You might not ever get an answer to the “what ifs” you have, but there’s a good chance you’re living someone else’s “what if” and for all the bad that brings, it brings a lot of good. Wishing you luck and peace moving forward.\n\n**edit: I realize reading that over that it sounds like it’s your responsibility to be the “what if” for others and it absolutely isn’t. You’re a person-person first, a public-person second. Who you are is rooted in who you are when you’re not being viewed. Your value will be there whether or not you produce for the benefit of others.",
      "created_utc": 1729245637.0,
      "score": 5
    },
    {
      "id": "lsirgz1",
      "body": "Hozier? Is that you?",
      "created_utc": 1729256681.0,
      "score": 5
    },
    {
      "id": "lsitr3q",
      "body": "Please don't be Tobias Forge, but also if you are, then it's ok and we will understand and we will still love you.  And that goes along with whoever you are and whatever band you are with.  Your fans will understand if it's just not for you anymore.  It's better to go out with grace rather than disappoint your fans by putting on crappy shows because your heart isn't there any longer.  Do what is best for you and your family.  Take a vacation and clear your mind.  Go somewhere where people won't recognize you and if they do they won't care.  Just relax, and heal, and enjoy some freedom from the spotlight. The answer will come to you.",
      "created_utc": 1729257542.0,
      "score": 5
    },
    {
      "id": "lsivuwr",
      "body": "Do you think you would be happier if you had never gotten famous? I don’t know any famous people but I know a lot of unhappy people. At this point in your life if you weren’t famous, would you still be chasing fame or would you have been able to come to terms and be content? \n\nI imagine there contractual obligations that keep you working and in the public eye but once those are met you don’t owe anyone anything. If it’s financially feasible find a quiet place and tap out for a little while.",
      "created_utc": 1729258332.0,
      "score": 5
    },
    {
      "id": "lsix8jl",
      "body": "You wouldn't be the first person to walk away from the spotlight. Even if people think it's selfish do what you need to for your own mental health. You only get one shot at life so if you aren't happy with things currently make a change to find that inner happiness and peace.  Much love!",
      "created_utc": 1729258845.0,
      "score": 5
    },
    {
      "id": "lsm6mvn",
      "body": "Who else thinks this is made up and OP is a regular person wishing they were famous? I’ve read a story almost identical to this a while ago. Especially the whole “I wish I could go to a grocery store without being spotted”. That’s what they make famous people under disguise do in all those movies. \n\n\nPeople on here make things up for Reddit karma and attention all the time. Pretty sure this is BS.",
      "created_utc": 1729298530.0,
      "score": 4
    },
    {
      "id": "lsjzd9a",
      "body": "Hi, Justin ❤️",
      "created_utc": 1729271188.0,
      "score": 8
    },
    {
      "id": "lsj0rog",
      "body": "As a normal person I can’t ever tell who’s real or genuine with me either., there’s always users. That Wouldn’t be different if you weren’t famous.",
      "created_utc": 1729260081.0,
      "score": 4
    },
    {
      "id": "lsk8pic",
      "body": "Move to Jackson hole Wyoming. I can’t say exactly who I know that lives there, but he and his wife moved there before a huge world tour.  He wanted to pay less in taxes so he got residency there and officially moved there half the year.  When he needs to do recording he goes back to LA.",
      "created_utc": 1729274128.0,
      "score": 3
    },
    {
      "id": "lsnqrli",
      "body": "Get rid of all social media. All of it (except Reddit) do your own thing. Keep making music.",
      "created_utc": 1729328280.0,
      "score": 3
    },
    {
      "id": "lsom24g",
      "body": "Move to Vegas. Everyone else is \"famous\", but nobody cares. It's the entertainment capital of the world. \n\nWe all live and work here. We can go to the grocery store and people might say \"hi\" to you but that's it.\n\nWe all work in the industry here in one capacity or another. Everyone is pretty respectful  of your privacy.\n\nTry it! You might like it!",
      "created_utc": 1729345084.0,
      "score": 4
    },
    {
      "id": "lsiak3l",
      "body": "So I’m not sure about how I feel about this. Part of is like screw off, this is so first world. The other half of me feels sorry for this guy, here’s why: I used to work in news and covered the death of one of the most famous musicians ever. He OD’d. We wnt to his house and his “best friend” said all the musician wanted to do was be able to go grocery shopping like a regal at person. Not be mobbed and scrutinized by every form of media at that time. You don’t know who your real friends are. It’s gotta get in your head.",
      "created_utc": 1729249050.0,
      "score": 9
    },
    {
      "id": "lsjs6lf",
      "body": "[deleted]",
      "created_utc": 1729268937.0,
      "score": 9
    },
    {
      "id": "lsieu56",
      "body": "If fame and fortune do not bring the things you want from life, walk away. \n\nIt sounds like music brings you joy but the industry does not . Time to rethink who you are and who you want to be. \n\nChange is ALWAYS possible, not always easy but break away for a while and give yourself some perspective. You are not trapped although I could see how you would be made to feel that way. \n\nYou are not responsible for anyone's happiness but your own!",
      "created_utc": 1729251240.0,
      "score": 3
    },
    {
      "id": "lsits6i",
      "body": "peep OPS profile, plenty of bait post like this",
      "created_utc": 1729257553.0,
      "score": 3
    },
    {
      "id": "lsjtso1",
      "body": "Come to Finland. Central Finland is high enough. Nobody gives a fuck who you are.\nF1 drivers walk around in grocery store and nobody gives a shit",
      "created_utc": 1729269444.0,
      "score": 3
    },
    {
      "id": "lski7pp",
      "body": "I'm sorry. Just thinking about how much time people in the entertainment industry have to be \"on\" makes me exhausted.\n\nI hope you have a home full of love to go home to at the end of the day. A place to be you and recharge. For me it's at home with my kids.\n\nMy teeth are ruined for various reasons (eating disorder, pregnancy), so I don't like to talk much outside, and it's a constant thing in my head. I never appear in photos and have a lot of anxiety around it. When I am home with my kids though, they don't care. I'm mum and they love me with everything and that's my safe space. My partner, kids and pets are my peace and I hope you have your own peace whatever that looks like.",
      "created_utc": 1729277195.0,
      "score": 3
    },
    {
      "id": "lsobull",
      "body": "There’s some fascinating psychological studies about how fame affects us, as humans. Basically, we’re not physically, mentally or emotionally equipped to deal with it. \n\nSorry, but I wouldn’t trade places with you. I’m quite happy acting in my local theatre once in awhile! Maybe you should think small. Get back to your roots. Please follow-up, OP!",
      "created_utc": 1729340652.0,
      "score": 3
    },
    {
      "id": "lsom2cp",
      "body": "This reminds me of when Michael Jackson would disguise himself with prosthetics and go to Disneyland just to have an experience as a normal human. I mean appreciate an artist but FFS we don’t have to worship these people. Give them their damn space!",
      "created_utc": 1729345087.0,
      "score": 3
    },
    {
      "id": "lspg0my",
      "body": "Seems like if you’re famous in the USA sometimes you can move abroad and live more normally.",
      "created_utc": 1729355700.0,
      "score": 3
    },
    {
      "id": "lss439b",
      "body": "I used to have a fairly successful youtube channel in a place where the community was super tiny. It got to a point where I couldn't go to a bar in my local area without getting recognized and while everyone was super nice, it felt exactly as OP described. It's like I wasn't allowed to have a bad day or someone would post online that I was a complete b\\*$#@. And forget just having a good time because phones would come out and people would start recording. I realized how much I missed my anonymity and quit. I'm lucky enough that once I left that community I went back to being completely unknown and now I cherish it so much. My point is there are people out there who recognize that whatever your public persona is, you're a complex individual who should be allowed to write your own narrative every time you meet someone new. Being in the public eye takes that away from you and it's so taxing. I hope you find your peace and know you have my support OP.",
      "created_utc": 1729389954.0,
      "score": 3
    },
    {
      "id": "lt44s6a",
      "body": "I really hate saying this, but I bet you this is Justin Bieber",
      "created_utc": 1729565405.0,
      "score": 3
    },
    {
      "id": "lsi8z5o",
      "body": "Leave to somewhere where nobody knows your name. I suggest leaving for a while and taking a break. Walk this earth where TV and internet is a luxury. May I ask what industry you are in? Like you'd be surprised what a month in the middle of nowhere will show you that you are not known everywhere. Unfortunately, it comes with the job, but don't let it get you down OP because everyone gets burnt out in every job, in different ways. Don't delete this post because a lot of people in fame related industries seem to turn to drugs or alcohol to deal with this, it could be a source of help for them too.  Many of us don't know how lucky we are that we can live our daily lives with our privacy, I'd hate it if I couldn't go to the shops without someone bothering me. But pack a bag get out of here, go see the world and go somewhere in the world that is not touristy keep a low profile you'll find a few places you can get away to when things get too much back where you are. ",
      "created_utc": 1729248158.0,
      "score": 5
    },
    {
      "id": "lske8nh",
      "body": "Move to Ireland. They couldn't give a shite if you're famous or not. \n\n\"Who the fuck does that bollox think he is?\" Is a sentence I hear about 6 times a day.",
      "created_utc": 1729275910.0,
      "score": 6
    },
    {
      "id": "lsijiq5",
      "body": "Scrolling thru a current music playlist and I recognize not one artist!",
      "created_utc": 1729253401.0,
      "score": 4
    },
    {
      "id": "lsi6z1p",
      "body": "Seems like you have a lot of opportunities at your doorstep. Plan some time out of the country where you live when you're not touring. I'm sure there's a lot of places in the world where no one knows who you are.\n\nConsider some charity work?",
      "created_utc": 1729246979.0,
      "score": 2
    },
    {
      "id": "lsi8dch",
      "body": "If this makes you feel any better, I can guarantee you that if you walk right in front of me I would not know who you are.",
      "created_utc": 1729247809.0,
      "score": 2
    },
    {
      "id": "lsih9tz",
      "body": "If you’re financially well off. Just retire bro. \n\nAnd if you want to continue making music. Just start your own Music label company and help new artists. Do it from the background rather than the “spotlight” and before you know it. The world will forget about you but not entirely.",
      "created_utc": 1729252381.0,
      "score": 2
    },
    {
      "id": "lsik0cy",
      "body": "I hope you have a cathartic hobby that’s just for yourself.\n\nMaybe it’s learning how to make a mean loaf of sourdough, or it’s wheel throwing in a private pottery class, whatever lets the tension out and let’s you take a little time for yourself.\n\nAnd I would hate being famous so deepest sympathy that you literally can’t leave the house without a disguise or being done up. Besides these tabloids are wild and will publish the worst pictures and act like you’re having a breakdown when you’re clearly trying to not be noticed.",
      "created_utc": 1729253617.0,
      "score": 2
    },
    {
      "id": "lsil9ix",
      "body": "It’s tough to actually understand what you’re going through. On an intellectual level, sure, but not truly. People know what being burnt out feels like and what it feels like when people nag you when you just wanna be alone. However, almost no one really knows what it feels like to be truly successful and famous for what you do. All I can say is I hope you find the balance you seek. Be strong.",
      "created_utc": 1729254161.0,
      "score": 2
    },
    {
      "id": "lsilb5s",
      "body": "Why don’t you just move to a small town and just relax. Plenty of celebrities do it, and you don’t see them plastered everywhere all over the place, which in turn gives them a lower profile. \n\nI used to live in a small town where a massively famous celebrity lived. Now, he lived there before my time, but from what I understand he surely was considered the “local celebrity” but everyone knew each other in the town, and he was able to live his life pretty normally. It didn’t matter if everyone knew his name because everyone knew each other’s name. \n\nThere are many celebrities that keep a low profile, but it also is a choice you have to make.",
      "created_utc": 1729254181.0,
      "score": 2
    },
    {
      "id": "lsinjny",
      "body": "Just move to the Midwest....Iowa nice is a thing.",
      "created_utc": 1729255128.0,
      "score": 2
    },
    {
      "id": "lsioz60",
      "body": "You need to live somewhere that allows you to be normal, like Kansas or something.  Where no one cares, and will protect you. Like Brad Pitt in Springfield, mo.",
      "created_utc": 1729255711.0,
      "score": 2
    },
    {
      "id": "lsiozs1",
      "body": "I always liked the way George Harrison managed himself after the Beatles. He did what he wanted on his terms. You probably need to close your circle and focus on what makes you happy. You can’t change who you are but you can change the way you handle your life.",
      "created_utc": 1729255718.0,
      "score": 2
    },
    {
      "id": "lsipmjw",
      "body": "I have actually thought about this a lot ironically. I never understood paparazzi or tabloids. It always felt so abusive to me. I’ve been in Trader Joe’s just wandering around looking at things pre-Covid with my face mask on (chronic illness) and I got a lot of stares and comments, some even took pictures of me, laughing. It honestly would make me think about how intrusive it must be for people in your position. How hard it would be, just to be normal. \n\nLittle things we all take for granted like walking your dog or just popping down to the corner store for an ingredient you were missing for dinner. Forgetting to get gas the night before and having to stop on the way to an appointment in the morning is irritating for anyone but for someone in your position… a nightmare of proportion none of us in the comment section can truly identify with. \n\nWith money comes an inability to really know who has your back and who is just holding their place in line waiting to be picked. Add fame to that and I imagine it’s an iron weight in your gut, the inability to be vulnerable with anyone that wasn’t there from the beginning. Maybe not even them or especially not them. \n\nYou are allowed to mourn parts of your life, parts of yourself. You are human just like anyone else and you deserve the safety and ability to form real and lasting connections with other people. You shouldn’t have to sacrifice something you love for that. I’m sorry you feel you do. I’m sorry we have a society that makes you (and others i‘m sure) in your position feel they have to. My hope for you is that you find a way to protect both your privacy and autonomy while you make the lasting and genuine connections we all need.\n\nSee you at Trader Joe’s.",
      "created_utc": 1729255967.0,
      "score": 2
    },
    {
      "id": "lsiqdwi",
      "body": "I am very sorry to hear that you have to embrace these feelings. I do not understand how individuals do not respect you more. You might be famous, but you're a human being like the rest of us. People should respect you and your space. I have met a good bit of famous people and they always thanked me for not treating them any differently than the person next to them. I wish you could enjoy life more without this looming over you and I hope some how you find the peace that you deserve. \n\nWe only live once and you deserve to enjoy it to the fullest extent.",
      "created_utc": 1729256261.0,
      "score": 2
    },
    {
      "id": "lsisi4m",
      "body": "I hope you live somewhere that you can blend in and exist how you want. \n\nI wish you the best.",
      "created_utc": 1729257074.0,
      "score": 2
    },
    {
      "id": "lsitytg",
      "body": "If you live in LA, that's the culture, and you're fighting not only your own thoughts but you probably really are being pursued. Nonetheless, if you really want to change your life and the way people react to you, you absolutely can. I remember seeing Robin Williams walking down the street in SF. He was friendly, not hiding who he was, people were acknowledging him but letting him be. I was amazed (as I walked by and nodded and then giggle with my friend bc I was in my 20s).\n\nIt takes a lot of internal work and persistence but is 100% achieveable. The odds of success with this are much higher than becoming a famous musician because you are not relying on anyone else for your success, just little old you. I am sure you can create the response from the public that you are comfortable with. As the GS Warriors and Ted Lasso reminded us - Believe!\n\nThe \"how\" is more detailed than a Reddit post on a Friday morning, but it is not complicated. I can give you recommendations if you'd likr. Good luck, soldier. You got this.",
      "created_utc": 1729257623.0,
      "score": 2
    },
    {
      "id": "lsj1keu",
      "body": "It sounds like you’re feeling burnt out and also lonely - which is a horrible combination. \n\nBut please remember that when you’re exhausted, perspective can be the first thing to go! It takes time to recover…\n\nHave you had any opportunities to get in touch with your inner self? With hopes and dreams and ideals that you might have put on the shelf, as your life became frantic and your responsibilities grew? \n\nDo you have any space to do that now? Maybe with a therapist / acupuncturist / life coach / astrocartographer / whoever, you could explore different parts of yourself, and perhaps find a way to step back from public life, to try something new or someplace different. It could really change the energy for you!\n\nRelentlessly performing for others can take a heavy toll on the psyche.\nI wish you healing, and the the peace and happiness that you deserve ♥️",
      "created_utc": 1729260358.0,
      "score": 2
    },
    {
      "id": "lsj4o6o",
      "body": "I always feel bad for celebrities because so many people feel entitled to a part of them. I always told myself even if I saw my biggest idol I wouldn’t ask for a picture but just a basic conversation of hello nice to meet you from them and then let them go on their way. I don’t even think I would bother someone if they looked busy or trying to hide. I always feel like celebrities could use a genuine friend.",
      "created_utc": 1729261410.0,
      "score": 2
    },
    {
      "id": "lsj5dao",
      "body": "I hope you get to your goal happiness soon. To feel trapped is a terrible thing, just know you spent alot of time making thme happy.  It's ok to do the same for yourself. Wish you the best!",
      "created_utc": 1729261641.0,
      "score": 2
    },
    {
      "id": "lsj5vec",
      "body": "Move to the middle of nowhere",
      "created_utc": 1729261807.0,
      "score": 2
    },
    {
      "id": "lsj614z",
      "body": "Just move somewhere super low key and just vibe",
      "created_utc": 1729261859.0,
      "score": 2
    },
    {
      "id": "lsj7kbv",
      "body": "It makes sense you’d feel that way. I feel that way leaving my house and that’s just cause I’m a woman and dudes be creepin. Lol  It’s dehumanizing and while yours is a different flavor I know that feeling sucks.  Maybe try making friends online (not on this account now that you’ve posted this) on forums and stuff so you have anonymity. Then maybe reveal who you are to them after a year or two of friendship/when you feel comfortable. \n\nEdit: I was thinking. I have internet friendships where I’ve been friends with the person for over a decade and they have no idea what my name is or what I look like. I also have friendships of the same length where I’ve gone to their weddings. There is no reason to reveal yourself unless you want to and real friends won’t care. All my internet friends, whether they know my real name or not, still just refer to me by the nickname for whatever username I had when we met. ",
      "created_utc": 1729262367.0,
      "score": 2
    },
    {
      "id": "lsj7quw",
      "body": "Take care of yourself.",
      "created_utc": 1729262426.0,
      "score": 2
    },
    {
      "id": "lsja0qq",
      "body": "Feeling isolated like this is shit on top of being burnt out from something that you used to love. I don't know if you have a good support system or something, I hope no one around your inner circle is shaming you for feeling this way or calling you \"ungrateful\". \n\nI hope you do get support and the courage to do what's best for your emotional and mental health, rather than feel pressure to do something you don't want to do. \n\n  \nWhen I feel overwhelmed I have this knee-jerk reaction to just go running into a forest or try to look for a less overwhelming place in nature where I can just breathe. Hope you get to find that place for yourself where you can just breathe.",
      "created_utc": 1729263160.0,
      "score": 2
    },
    {
      "id": "lsjc2zf",
      "body": "Just pretend you’re normal and make some friends online? Like idk, play a MMO or something.",
      "created_utc": 1729263818.0,
      "score": 2
    },
    {
      "id": "lsjcq20",
      "body": "I don't really pay attention to fame. Honestly I don't really understand how we put people who entertain on this weird pedestal. If I see a famous person I'd probably just say \"I really like your work/art\" just like I'd do with anyone else. I understand that you need to be a normal person outside your art. I truly hope you get to do that. Everyone deserves peace and everyone deserves to be able to turn off \"work\" and just live in reality <3",
      "created_utc": 1729264025.0,
      "score": 2
    },
    {
      "id": "lsjctud",
      "body": "Come to Winnipeg, nobody cares or expects to see you here. You can probably play a few tiny cafe’s as well if you still want to flex your music. You don’t have to tour if you don’t want to. Nothing heals like music, so physician, heal thy self!",
      "created_utc": 1729264059.0,
      "score": 2
    },
    {
      "id": "lsjctzx",
      "body": "I often think how lovely it would be if celebrities could just be treated as normal people. Freedom",
      "created_utc": 1729264060.0,
      "score": 2
    },
    {
      "id": "lsjcy2o",
      "body": "Fame snd the wealth it can provide sounds amazing. Sacrificing your privacy as though you “owe” others must be terrible \n\nI’d move somewhere where it’s not the end all be all. I’ve seen actors, musicians out and about while filming, touring or visiting family… it’s really neat to see and recount later.  I’m not going to bother them - it’s just so rude and disrespectful. \n\nIn the end, you’re allowed to have peace and privacy in your own life - you don’t need to live full time where you are. You only need to have proximity to an airport, internet and peripherals for meetings… \n\nI hope you are able to find it",
      "created_utc": 1729264096.0,
      "score": 2
    },
    {
      "id": "lsjha5k",
      "body": "if this is gambino i love u man",
      "created_utc": 1729265481.0,
      "score": 2
    },
    {
      "id": "lsjl0fu",
      "body": "While others would love your level of fame and notoriety, they would not love the pressure and loneliness—that is a human universal. You deserve a break. There are many stars who quit the spotlight and chose to go for a more wholesome, grounded life in order to happiness. You deserve happiness. Take what you’ve earned, in terms of money and also peace of mind, and go get the life you want. You’re entitled to a break. No one is entitled to YOU. Your fans—if they’re real fans—will understand and support you.",
      "created_utc": 1729266656.0,
      "score": 2
    },
    {
      "id": "lsjmnxr",
      "body": "Assuming this is real and OP is widely known as stated, OP has made some money. I always have a hard time understanding people that reach the threshold of financial freedom and continue even if unhappy. \nYou have a few million set aside? That's enough to generate a decent passive income. Tired of the limelight? Rent a beach hut in some island in southeast asia, or a cabin in Patagonia and spend some time away till people forget. Use that time to explore another skill or talent.",
      "created_utc": 1729267171.0,
      "score": 2
    },
    {
      "id": "lsjou5a",
      "body": "To be honest I'm happy with a roof over my head and food in my stomach. Good luck whoever you are",
      "created_utc": 1729267859.0,
      "score": 2
    },
    {
      "id": "lsjp0wz",
      "body": "As Itchy and Scratchy once said, \"Wanti wanti can't get it, getti getti no want it.\"\n\nBe careful what you wish for. Also, count your blessings. I've been married to a musician for a long time now and I'm sure I wouldn't recognize you if I saw you. Hell, I don't even recognize my neighbors when I'm out and about because I'm not looking for them.\n\nMaybe don't go out looking like the unibomber with the hoodie and sunglasses and people won't look twice at you.",
      "created_utc": 1729267919.0,
      "score": 2
    },
    {
      "id": "lsjp5vp",
      "body": "Your welcome to come to my African home, if u know African parents u know 😂ul feel normal in no time, just get ready for African conversations and stories, 👌🏽",
      "created_utc": 1729267964.0,
      "score": 2
    },
    {
      "id": "lsjqz8i",
      "body": "Don't believe the hype. \n\nMost people are not concerned with the lives of celebrities. No one cares who you are.  Seriously. My neighbor is a makeup artist for a TV station and she'll sometimes mention people she's worked with & I'm like 'huh? who is that?' \n\nI don't really watch mainstream TV or listen to mainstream music, and I think a lot of people who have a job, kids & a house to take care of don't really care. And that's like the majority of the country. \n\nAdditionally, it's worth taking a step back & realizing that you probably existed in your own bubble during the peak of your fame & you just thought you were more famous than you really were. You & your team hyped you up and you just believed the hype.",
      "created_utc": 1729268552.0,
      "score": 2
    },
    {
      "id": "lsjrc7k",
      "body": "Ay I'll switch with you lol",
      "created_utc": 1729268668.0,
      "score": 2
    },
    {
      "id": "lsjwfgt",
      "body": "Didn’t that band Good Charlotte write a song about this? Wounded. Or the corny one I just wanna live. Make some anonymous internet friends. Move to somewhere that isn’t Los Angeles.",
      "created_utc": 1729270268.0,
      "score": 2
    },
    {
      "id": "lsjwnvt",
      "body": "Can I tell you something? \n\nYou don’t have to downplay your feelings because others would like to be in your position. Your feelings are so valid and I could never ever imagine being in the public eye. Because people don’t see famous people as people. They are some idealized version of who THEY think YOU should be. It’s not real life. \n\nTake some time for you. If you have the funds, find a cabin/beach house. Immerse yourself. You just gotta realize that the only person who is gonna be there for you every second of every day is you and you need to make THAT person happy. \n\nSigned, \nSomeone who DGAF about clout. Maintain your own peace, my friend. \n\nThere are always going to be clout chasers. And it’s  REALLY HARD to figure out who has your back in that type of environment. You need to get back to you. What makes YOU happy. What drives YOU. \n\nMake music for you. You don’t have to put it out if you don’t want to. As far as other people go, you owe them nothing. Do you boo.",
      "created_utc": 1729270342.0,
      "score": 2
    },
    {
      "id": "lsk2q57",
      "body": "This is what I hate about how society treats entertainers- I will not call you or people like you celebrities because it's too worshiping for my liking. Anyway society has forgotten that entertainers are workers and that they should be treated as workers. They should be able to clock out like any worker and they should be able to have rights to their own privacy like any worker. Unfortunately, society believes that just because fans give entertainers money then the general public has the right to be basically spy cams and viruses to the entertainer's life, controlling them, watching them, and invading their privacy and that isn't right. You can't argue oh but that's the same with anybody with wealth that is not true because they're plenty of extremely wealthy people that the general public have no idea about it's just entertainers their no longer humans in the eyes of the general public because hi, their only entertainers.",
      "created_utc": 1729272244.0,
      "score": 2
    },
    {
      "id": "lsk7xj8",
      "body": "Just yesterday I had a conversation with friends along the lines of we're all glad our skills and passions have led us to 'ordinary' lives, that the cost of fame is too high.\n\nIf you still feel the love for music, could you maybe shift into a more supportive role? Writing and selling your stuff to other performers? Or backing, managing, mentoring? Obvs I'm not in your line of work so these suggestions may be utter crap, but I really hope you can find a way to keep what you love and ditch what's hurting you.",
      "created_utc": 1729273883.0,
      "score": 2
    },
    {
      "id": "lsk8ek7",
      "body": "My grandma always pressured me to go on American Idol, but what you're feeling is exactly why I didn't. Being a celebrity always seems exhausting and draining to me. I'm sorry people suck and can't just treat you like a human",
      "created_utc": 1729274032.0,
      "score": 2
    },
    {
      "id": "lsk8mwy",
      "body": "Big hugs. A friend of mine since childhood is in your same position. They have to hide all the time and people treat them differently. I’m sorry you’re going through this. Just take things one day at a time is what my friend does. If you have friends from before the fame, reach out to them. Maybe you will find some sense of normalcy by interacting with them.",
      "created_utc": 1729274106.0,
      "score": 2
    },
    {
      "id": "lsk98m7",
      "body": "ugh. same. i got recognized at a club awhile back by a group of popular girls i went to high school with. it was AWFUL. \n\nin all seriousness, buy a house on a mountain and just disappear for awhile.",
      "created_utc": 1729274297.0,
      "score": 2
    },
    {
      "id": "lsk9945",
      "body": "John Mayer needs a new therapist.",
      "created_utc": 1729274302.0,
      "score": 2
    },
    {
      "id": "lskhq7h",
      "body": "Weird connection. Lemme’splain.\n\nI remember telling my dad that I wanted to grow up and be Tracy Chapman. Not actually, but you know what I mean. He pushed me to school because he didn’t want me to be upset at not making it or only having one pathway in life, and I got my degree and have a great job. I eventually did start playing music professionally for fun, but I always have that feeling I’m too old or I have so much to learn still.\n\nI had so much energy and motivation when I was younger. Now I feel motivated but there’s not enough time in the day, in the week, and there’s always something I don’t know. I start working with someone I like and then something happens in their lives so we can’t work together anymore, or weird people wanna work together and their work is mediocre, or I just don’t like them as a person, that’s not a bad thing to stay away from.\n\nI guess what I’m saying is you did it and it wasn’t for you. You have the option of pulling back and trying something different—use your earnings to start that new chapter. Some of us are still reading our journals of shoulda coulda wouldas. \n\nIt’s nice every once in awhile for people to say my name and know my music around town, or to promote a show and have fans attend, but I’ll never probably get bigger than my state. That’s just where I’m at now until I can learn more about the industry and how to expand my reach.",
      "created_utc": 1729277038.0,
      "score": 2
    },
    {
      "id": "lskirb9",
      "body": "Disappear for a while. Come live in my village where no one cares if someone is famous.. 😂",
      "created_utc": 1729277370.0,
      "score": 2
    },
    {
      "id": "lskndrq",
      "body": "Justin beiber is that you🥹",
      "created_utc": 1729278875.0,
      "score": 2
    },
    {
      "id": "lskr0us",
      "body": "I wish I could have been Liam’s friend. An actual friend. I look at his last videos with fans outside the hotel and all I see between the smiles and laughter is a deep sadness. He didn’t look well and I’m not sure if the fans picked up on anything because they were too excited or whatever but I sure as shit picked up on it just by the videos. \nI couldn’t give two shits about the fame. I’m an introvert anyway. \n\nI don’t know if this is just a shitpost begging for upvotes but just in case it’s not, please reach out to a mental health professional. Quitting anything including being in the limelight can be quite the adjustment. Even if it’s something you want or need. If you also have the financial means to reinvent yourself, then go for it. I wish you well.",
      "created_utc": 1729280061.0,
      "score": 2
    },
    {
      "id": "lskte34",
      "body": "After everything that happened with Liam payne the last few weeks (not saying what he was accused of was okay by any means but he is still a human being and didn't deserve to die) this post hits a bit harder. People forget celebrities are real people with their own struggles. Just know op you are seen and heard whether or not you show you're struggling. If you aren't already trying it, I recommend seeing a therapist to try and work through how you're feeling because even if you don't figure out why you feel this way right away it will give you great tools to use for the future.",
      "created_utc": 1729280833.0,
      "score": 2
    },
    {
      "id": "lsl08tf",
      "body": "I kinda understand how you must feel. I grew up in a family business that was fairly well known in my town and everywhere, and I mean everywhere I went, ppl would stop to ask me about something business related. I couldn't get dinner with my kiddo uninterrupted!\n\nI remember telling my ex that this was as close to famous as I would ever want to be. You have my sincere sympathy!",
      "created_utc": 1729283071.0,
      "score": 2
    },
    {
      "id": "lslgie8",
      "body": "I have a friend that is very famous and her life is out there all the time. A lot blown up, bad reporting. I've had instances where people have realized I've known her and her family since childhood and they've tried to work that as an angle to get \"in\". My hat goes off to you because I don't think anyone realizes how bad the personal impact can be.",
      "created_utc": 1729288601.0,
      "score": 2
    },
    {
      "id": "lslibd4",
      "body": "Is that you Taylor?",
      "created_utc": 1729289260.0,
      "score": 2
    },
    {
      "id": "lslkqwp",
      "body": "I am mildly curious who you are, but for me, that doesn't matter. What matters is the person. Sometimes people forget about the person inside. It is easy to forget that everyone just wants to live a life with comforts, but especially live and passion.\n\nYou mentioned burnout. It seems like you love your job but can't escape from it. It follows you everywhere. \n\nIn addition to therapy, which I can wholly recommend, I would suggest a different approach to your passion. Maybe put out some different type of music. Just one song. Maybe book small venues that no one expects that allows you to connect on a personal level. You can also try different projects (aka hobbies) that let you venture into different things. Even small things can revitalize you. Hell, maybe even take a college class that gets you discover new knowledge. \n\nI get burn out. I think that is a core part of your current issue. I'm an air traffic controller and it can cause incredible burnout. We have an early retirement for a reason. While we are working, most of us find different hobbies and passions that keep us from going nuts.",
      "created_utc": 1729290141.0,
      "score": 2
    },
    {
      "id": "lslmrwp",
      "body": "Move to Finland. People will leave you be.",
      "created_utc": 1729290892.0,
      "score": 2
    },
    {
      "id": "lsm399s",
      "body": "Move to a new country where you are less known and start a new life.",
      "created_utc": 1729297194.0,
      "score": 2
    },
    {
      "id": "lsmfltg",
      "body": "Hey I don't even know who you are but I'm just a normal blue collar dude. I'll have random conversations about whatever u want.  And no (industry shit)",
      "created_utc": 1729302184.0,
      "score": 2
    },
    {
      "id": "lsmfrh4",
      "body": "🫂 🫶🏻 \n\nYer feelings are super valid. You don't have to be happy just because someone else would be if they had the same things, that's ridiculous and completely invalidates you and your experience and you and your experiences are valid as are your feelings about it 🫶🏻\n\nDo things for YOU, keep your morals about you, keep your boundaries (and don't be crossing them yourself)... don't do things because other people dream about doing them, do things you dream about and that make you happy.",
      "created_utc": 1729302249.0,
      "score": 2
    },
    {
      "id": "lsmg6jw",
      "body": "Move to Alaska. People don’t really keep up with pop culture and media much, everyone is too busy hiking and doing outdoor activities. Plus it’s absolutely beautiful. Even if you get noticed, there are so few people who actually live there it wouldn’t be as often",
      "created_utc": 1729302424.0,
      "score": 2
    },
    {
      "id": "lsmio7x",
      "body": "I always feel so bad for famous people. I feel like there should be laws against harassing them and invading their private lives. Famous people are the only people who do not get a separate work/private life. They are always being observed and judged and people feel entitled to their time. It’s pretty cruel if you ask me. I can’t say I’ve ever been tempted to interrupt anyone’s day and ask for autograph or picture or even go up to them in general. I just genuinely feel bad for them. You can have all the money and success in the world but it comes at a very large cost. At the end of the day you’re a person just like anyone else and you deserve the same respect. You deserve to go about your day like anyone else. It’s no wonder so many celebrities suffer from depression and addiction. It must be so isolating. It’s crazy because with musicians, music helps so many people through difficult times but unfortunately it doesn’t help the artist. Follow your heart and find your peace. If you want out of the spotlight you have to do what’s best for you, you deserve to have peace and love your life. I can’t imagine what you have to deal with and I think you’re extremely brave for posting and talking about the struggle that comes with being in the spotlight.",
      "created_utc": 1729303455.0,
      "score": 2
    },
    {
      "id": "lsmit2l",
      "body": "It’s okay to feel tired, your feelings are valid too. Many who are in the limelight feel similar or the same way (go back to backstreet boys song larger than life or aviciis music) it’s a lot of pressure and to not have a personal life that you can keep private would send most people insane. \nIf you have close friends who aren’t all about the fame and luxury, try and spend some time with them to ground yourself. Maybe take a trip to somewhere that isn’t a usual destination and reconnect with nature. To be honest, this time of year is really nice for the islands in australasia. Even some bush walking or rainforest walking gets you closer to nature.\nPulling away from social media and the use of technology may also help. \nBut please if you start getting worse thoughts or feel like there’s no escape please reach out to help, don’t face those feelings alone.\nWish you the best dude/dudette! I hope things look up for you soon",
      "created_utc": 1729303512.0,
      "score": 2
    },
    {
      "id": "lsmk0y4",
      "body": "I don't have advice, I just want to say hmu in reddit chat if you don't have many friends you can consider \"genuine\". I'd be happy to just have a few chats with you and talk about what's going on, no need to tell me who you are if you worry that would cloud things. Happy to listen to your problems bro :)",
      "created_utc": 1729304022.0,
      "score": 2
    },
    {
      "id": "lsmk52f",
      "body": "Does not matter your career or what not, I think your life has been driven by pleasing others, rather than doing what you love.  Lots of us mix up our goals and happiness with other people’s goals and their happiness.\n\nRemember what brings you joy and passion, stay focused on the people you love, the folks that are good in your life and follow a path that lets you choose you.  Not many of us get that opportunity.",
      "created_utc": 1729304070.0,
      "score": 2
    },
    {
      "id": "lsml9y6",
      "body": "A Movie narrative posted here and people are still finding this shit genuine.",
      "created_utc": 1729304554.0,
      "score": 2
    },
    {
      "id": "lsmm4zd",
      "body": "Find a gig playing a villain in a movie/animated movie. Not kidding. You'd be amazed how different it becomes. Fans are glad you aren't setting them on fire or siccing a dragon on them for the least acknowledgement. Hang in there and enjoy your gifts!",
      "created_utc": 1729304920.0,
      "score": 2
    },
    {
      "id": "lsmp9hv",
      "body": "I hope you find your peace. Or at least a happy medium.\nYou could come to Saskatchewan. We are pretty laid back and respectful.",
      "created_utc": 1729306253.0,
      "score": 2
    },
    {
      "id": "lsmqp9s",
      "body": "Hope you smile and feel happy soon friend.",
      "created_utc": 1729306885.0,
      "score": 2
    },
    {
      "id": "lsmrhi9",
      "body": "Hang in there Chappell!",
      "created_utc": 1729307230.0,
      "score": 2
    },
    {
      "id": "lsmszc5",
      "body": "Please OP, whoever you are, seek help. \n\nThere is no shame in asking for it. I'd much rather read that you checked yourself into a program and not that you're gone because whoever you are there are millions of people who love your music (who knows probably myself as well).\n\nIf you just want a random Helpful Canadian Support Person to talk to OP (or anyone) my DMs are open ❤️",
      "created_utc": 1729307891.0,
      "score": 2
    },
    {
      "id": "lsmtxyf",
      "body": "There seems to be a large rift between two staunch camps on whether famous people \"owe\" their fans for their celebrity. At least in the circles I run in it very much seems to be leaning towards \"If someone famous wants privacy outside of what they're famous for, leave them tf alone.\"\n\nYou hear the stories of people showing up at the wedding Taylor swift attended, or trying to find there way to celebrities homes, wanting to meet them when they're having dinner. I'd say 20 years ago that would have been met with, \"Well yea, they're famous.\" \n\nAt least today, there's a conversation. So it seems to be moving in the right direction. If you went back to being famous and set boundaries, there would certainly be some people, and a good number,  that would say your selfish and don't deserve it. But you would also find a good number of people backing you up on your right to your own life. Especially if that's what is needed for you to continue doing what we love about you in the first place.",
      "created_utc": 1729308321.0,
      "score": 2
    },
    {
      "id": "lsmwscj",
      "body": "Don’t delete it. I have questions. If you are the peak of your fame and success why don’t you just give up? I always wonder this. What motivates people to keep wanting to be famous?! You’ve already had success and are probably good to fade in to obscurity and live off your millions. Why don’t you just do that? Write music still and maybe profit off of that if you’re still miserable. But other than that why don’t you just go do something you enjoy in another country. Learn a new skill. Idk this industry seems miserable to be in and being famous lowkey sounds like it sucks",
      "created_utc": 1729309631.0,
      "score": 2
    },
    {
      "id": "lsmwxzw",
      "body": "Frank Ocean we all know it’s you",
      "created_utc": 1729309709.0,
      "score": 2
    },
    {
      "id": "lsmyf0k",
      "body": "I’ve wondered if someone like you would appreciate people like me who truly don’t give a flying rats ass about celebrity and treat everyone the same regardless.    \n\nLike put your own plate in the sink.    I’ll get mine kinda, genuinely people all matter.",
      "created_utc": 1729310426.0,
      "score": 2
    },
    {
      "id": "lsn08me",
      "body": "I could not imagine the lack of privacy. The paparazzi are scum and I know it's more than just them, but everyone deserves to live a normal life, without people constantly in their face and constantly being judged. You're famous, that shouldn't mean a life of hiding and judgement. Good luck",
      "created_utc": 1729311350.0,
      "score": 2
    },
    {
      "id": "lsn1e13",
      "body": "Burnout is burnout no matter how it happened.  Take a nice long rest and self care self love for awhile.  Maybe a couple years if you can afford it",
      "created_utc": 1729311944.0,
      "score": 2
    },
    {
      "id": "lsn1pxn",
      "body": "I mean, fame isn’t the gift. Getting to do what you love is. You lose to gain. \n\nMoney buys you a lot of peace. If you can make the best of things now, you’ll never have to do this later.",
      "created_utc": 1729312119.0,
      "score": 2
    },
    {
      "id": "lsn3ct1",
      "body": "I say this all the time, I can’t think of anything worse than being famous. Rich, yes, I would love that, but I have no interest in being famous, it seems awful. I love just going about my buisness.",
      "created_utc": 1729313001.0,
      "score": 2
    },
    {
      "id": "lsn5pmf",
      "body": "I don’t know if anyone has said this but, you don’t have to do this anymore. No amount of money or fame is worth your emotional and mental well-being. You have permission to stop. Move to a country that doesn’t care so much about famous people and teach music lessons for a new career change, or make music under a new moniker and hidden face, or you can just find something else entirely new to do and make music in your home without anyone ever hearing it. You don’t have to do this anymore.",
      "created_utc": 1729314312.0,
      "score": 2
    },
    {
      "id": "lsnaz5b",
      "body": "Lay low for a while lets people forget about you but make sure you are good with your money \n\nLive a simple life good luck for your on your future endeavors",
      "created_utc": 1729317471.0,
      "score": 2
    },
    {
      "id": "lsnblr7",
      "body": "I’ll be your friend :) I don’t give a shit that you’re famous. I don’t need anything from you but friendship. Simple as that.. I think sometimes just being seen as you and having space to be human is really important. If you need a friend or someone to reach out to, message me. Gosh honestly you don’t even have to tell me who you are.",
      "created_utc": 1729317872.0,
      "score": 2
    },
    {
      "id": "lsnbrl6",
      "body": "Buy a farm like Clarkson has",
      "created_utc": 1729317976.0,
      "score": 2
    },
    {
      "id": "lsncw0w",
      "body": "IMAGINE IF THIS IS RIHANNA",
      "created_utc": 1729318708.0,
      "score": 2
    },
    {
      "id": "lsnfasd",
      "body": "Have you thought of maybe focusing on more of a writing/producing aspect? That way you can still create music but there’s less pressure on you to perform.",
      "created_utc": 1729320306.0,
      "score": 2
    },
    {
      "id": "lsnff15",
      "body": "Sending you all the love in the world and I sincerely hope that you can achieve the level of privacy and normalcy that you want. Can’t imagine the feeling of not being able to the simple things that I do every day without being recognized. Not to mention how scary this world is!",
      "created_utc": 1729320384.0,
      "score": 2
    },
    {
      "id": "lsnfvh9",
      "body": "Honestly? \n\nIt’s hard to make friends, without fame too. Reddit is the perfect place to meet and ghost people. \nThe ideal place to lie or scam, but also face all of your demons head on. \n\nI fully believe in the internet is a cesspool of living a breathing shit, but you have to use that shit to power yourself a bit. lol clean energy 😂 \n\nI would try making friends here. Leave out your occupation and just message ppl and have a nice chat. Don’t like em? Ghost or tell them no thanks and keep it pushing. It gets pretty silent if you don’t keep searching for corners of Reddit where you might be able get what you need. \n\nBe careful. Every corner of the world is dark, and we’re all just holding onto little candle that make our worlds bright. \n\nFind the light!",
      "created_utc": 1729320685.0,
      "score": 2
    },
    {
      "id": "lsnhgha",
      "body": "ive always wondered how people who become famous would feel about this stuff. Balance is key OP. be yourself and genuine connections will come ur way",
      "created_utc": 1729321752.0,
      "score": 2
    },
    {
      "id": "lsnp69i",
      "body": "Is there a place you could go to for a break? \nThere are some villages in the UK where I swear half the people don’t know who they are let alone anyone else? \n\nMaybe cultivate some online friendships where people just know you as you. You don’t need to lie but you can omit? I don’t know if that’s a terrible idea though. \n\nI’m sorry. It’s one thing that made me never want to explore more things as I grew. (I probably wouldn’t have got anywhere but I did well as a child in some areas).  \nI can walk around Tesco with a greasy bun and looking like trash and no one would bat an eye ans there is definitely something freeing in that. \nTo feel you can just exist without that background fear of being gawked at must be awful. \n\nI’d have a wig and a prosthetic nose or something so I could wander around and no one would care. 😂 but that’s also be a hassle I’m sure. \n\nBut I’m sending hugs. I really hope you’re ok. I hope you have therapy or someone to talk to so you don’t have to feel so alone. \nI’m sure many people feel the same way who gained success in music and on screen.",
      "created_utc": 1729327145.0,
      "score": 2
    },
    {
      "id": "lsnqoij",
      "body": "You should consider launching a new music career as an anonymous artist! It’ll be a fun challenge to see if you can do it from scratch, give you a new creative freedom, and give more time for your current status to fade more.",
      "created_utc": 1729328219.0,
      "score": 2
    },
    {
      "id": "lsnybxz",
      "body": "None of us can relate to being unable to go do normal things without the anxiety of being trapped by fans, but I’m sure all of us will say regardless of industry pressure.. if you feel done, be done. If you were this honest with fans, they’d ALL understand. If you said this publicly, your management and staff will have no choice but to back down. There will be a lot of pressure from those in positions of higher authority, but it’s YOUR life. If you want to retire, you have the means by now, do it. Take a much needed vacation or staycation with NOTHING planned. Put a mustache on and draw thick eyebrows (regardless of gender) and go grocery shopping and try to feel normal. Good luck, and know that everyone wants what’s best for you, especially those closest to you.",
      "created_utc": 1729333300.0,
      "score": 2
    },
    {
      "id": "lsoahxi",
      "body": "If you are flush financially.. maybe there is a different country you can go to where you are not so popular and unlikely to be recognized. Maybe you can buy a place there and visit when you need to decompress and be a regular human for a while before returning to the spotlight.  I'd say someplace light and tropical but thats just because im friggin freeeezing.",
      "created_utc": 1729340017.0,
      "score": 2
    },
    {
      "id": "lsodkr6",
      "body": "It sounds exhausting, like being a zoo animal. I hope you can find a way to separate your life from your job, because it is that a job.",
      "created_utc": 1729341456.0,
      "score": 2
    },
    {
      "id": "lsoghey",
      "body": "Chappel Roan is THIS YOU???",
      "created_utc": 1729342726.0,
      "score": 2
    },
    {
      "id": "lsoh0eo",
      "body": "I'd love to know who you are.",
      "created_utc": 1729342951.0,
      "score": 2
    },
    {
      "id": "lsoq8xj",
      "body": "Idk if you'll see this, but location matters when you're famous.\n\nZayn moved to a suburban town in Pennsylvania to get away from it and give his child a \"normal\" upbringing. \n\nI also ran into a famous Mexican singer at a costco in a predominantly white neighborhood. I just asked him if he was who I thought he said yes, and I told him I loved his work and kept it pushing . My husband kept telling me to go bug him for a picture, and I told him no, if he's here, it's because he wants to be left alone. This man was literally bickering with his wife about trash bags. Such a mundane experience I didn't want to ruin it for him, especially because his family has been going through a lot of media BS at that point.",
      "created_utc": 1729346720.0,
      "score": 2
    },
    {
      "id": "lsou6mf",
      "body": "Nice try diddy",
      "created_utc": 1729348181.0,
      "score": 2
    },
    {
      "id": "lsovepa",
      "body": "Hope you find the peace you’re looking for man. I couldn’t imagine being in your shoes.",
      "created_utc": 1729348621.0,
      "score": 2
    },
    {
      "id": "lsoy9of",
      "body": "There is a total give and take relationship with the entertainment industry. You give so much of your personal artistry and they just want to monetize it to sell merch and records so you feel like an observer of your own life. I remember listening to Garrett/i_o in an interview talking about how twitter and social media is a toxic  nightmare but he felt compelled to interact with his fans on a personal level. When he died almost everyone just made assumptions that because he had a dark sense of humor that he killed himself (which would never have happened...he was on track to becoming a huge artist when the pandemic hit). Build yourself a solid fan base who know who you are and they will support you forever. Don't tap out before the good out weighs the bad side of commercialism. Also interested in what type of music you make. I see a lot of Aviici references in the comments but for all I know you could be in a totally different genre and have no idea who I am talking about with G/i_o. That's just my uneducated advice.",
      "created_utc": 1729349620.0,
      "score": 2
    },
    {
      "id": "lspbi2i",
      "body": "Frank Ocean, that you?",
      "created_utc": 1729354163.0,
      "score": 2
    },
    {
      "id": "lsphncs",
      "body": "Consider doing some session work with a pseudonym? You won’t have to be in the spotlight as much yet you still get to write and play music? \nOr start doing technical, cuz y’know, they’re the real stars of any show 😉😂",
      "created_utc": 1729356245.0,
      "score": 2
    },
    {
      "id": "lspimli",
      "body": "I just watched that doc by kid laroi. Some of these kids get famous so fast and then get burnt out and wish it never happened. I can't comment on what it's like to be famous, but I can comment on making sure you take your mental health seriously. If you don't need to go back into the industry, don't. Stay true to yourself and do what feels right.",
      "created_utc": 1729356571.0,
      "score": 2
    },
    {
      "id": "lspmkmm",
      "body": "I’ll tell you one thing…happiness comes from having all your needs met financially, the ability to do what you want when you want, surrounded by people who love and appreciate you, etc. ok maybe it was multiple things…🙂\n\nPeople want to be famous but have no idea the cost or the other things that come with it. They can’t even problem solve simple solutions meaning they can’t look at every detail and determine if this is something they truly want. Be careful what you wish for when you don’t think of all the things that may come with it. \n\nI honestly would just hire a therapist and do some inner work on myself and try to readjust my perspective on everything I’ve been blessed with. Perspective is everything. I understand what you’re saying but, your mindset can be shifted to where you don’t feel burnt out. It’s truly miraculous what our thoughts can or can’t do for us.",
      "created_utc": 1729357852.0,
      "score": 2
    },
    {
      "id": "lspmxqa",
      "body": "It's a lot, and it's completely valid to not want that anymore. You don't owe the world or people anything, least of all a piece of yourself, no matter who you are.\n\nIf you want to step back and live a quieter life, do it.\nPeace of mind is so precious. Take it while you can.",
      "created_utc": 1729357968.0,
      "score": 2
    },
    {
      "id": "lspvcur",
      "body": "Well if this is real then you’re probably rich enough to retire and not do it anymore, and move to whatever small town takes your fancy or another country and live your life out of the spotlight. You could even still release music if you want to, many of my favorite recording artists live completely non-public lifestyles away from the spotlight but still drop an album every few years or so, with little promo. Maybe you don’t realize you have a lot more mobility and resources than the average person.",
      "created_utc": 1729360734.0,
      "score": 2
    },
    {
      "id": "lsqp1vz",
      "body": "I dunno if my reply will help. Of course, most people assume being famous equals easy life. When i was younger, I used to think that way about famous people. Maybe financially, but it can take a toll mentally and physically. Can you walk away or some way work behind the scenes (i.e. producing, writing)? At the end of the day, your mental and physical health is more important. You're still human, after all. I think alot us forget that in regards to celebs.",
      "created_utc": 1729370758.0,
      "score": 2
    },
    {
      "id": "lsrmowd",
      "body": "Come to Iceland. Celebrities are basically not a thing here because we're such a small community and we're insanely anti-social so we usually leave each other alone. You might get recognised and interacted with in some way but we're usually pretty respectful. I obviously don't know who you are but I think very few people would be exempt from this. \nI've heard countless stories of celebs just hanging out at bars with normal people. Also, noone expects celebs being here so there is also just a big chance of not getting recognised.",
      "created_utc": 1729383128.0,
      "score": 2
    },
    {
      "id": "lss6l0b",
      "body": "I hope this isn't a sick joke due to a recent circumstance",
      "created_utc": 1729390965.0,
      "score": 2
    },
    {
      "id": "lss89sw",
      "body": "Would people recognize you if you move for example, a small city in a rural province in Canada?\n\nIf I was somewhat famous I would do that. \n\nIt would ve hard not to be recognized if you are too famous(justin bieber for example, just to name someone), but looking forward to have some peace its a good option to be in a quiet place where everyone minds their own bussiness.\n\nIts so curious, I have been fan of linkin park all my life, I have been really close to Mike Shinoda couple of times and I never even asked for a photo 😅, in my mind we're all equal and deserve peace.",
      "created_utc": 1729391604.0,
      "score": 2
    },
    {
      "id": "lssxbfq",
      "body": "hey :) just wanna lyk there ARE people out there that you can meet that will treat you like a real person, and not just like a celebrity, or like you are clout bait. they dont usually live in cities. never stop making music if thats what makes you happy! you can always change the direction of who you allow into your life and out of it.\n\nbeing in your position IS TOUGH. but you make all the rules. wishing you godspeed on ur journey and i hope you come into real friendships soon",
      "created_utc": 1729403368.0,
      "score": 2
    },
    {
      "id": "lt6ikvq",
      "body": "Moved to someplace remote for a few years grow a beard or color your hair whatever if you really want to get away from that you can and you know it",
      "created_utc": 1729608781.0,
      "score": 2
    },
    {
      "id": "mfg9py9",
      "body": "I’m late in the convo and you will prob not read this but I understand. Not that I was ever famous but I get that it get go easily to being as alone as anyone. I had so many friends in my life. So successful, with school and sports… and then career. It all changed really fast though… anyway. You ever want to talk. I’m here.",
      "created_utc": 1740846159.0,
      "score": 2
    },
    {
      "id": "lsjl0pz",
      "body": "Hang in there, Taylor.",
      "created_utc": 1729266658.0,
      "score": 5
    },
    {
      "id": "lsj4u79",
      "body": "\\*wipes tears with money\\* \"why wont they just leave me alone?!\"",
      "created_utc": 1729261465.0,
      "score": 3
    },
    {
      "id": "lsjxcy7",
      "body": "\"Wake Me Up\" is the saddest song. Especially since I've associated it with a pretty huge tragedy in my personal al life. It's difficult to hear.",
      "created_utc": 1729270558.0,
      "score": 946
    },
    {
      "id": "lsk8fs2",
      "body": "I'm not famous in any way, shape or form, but I was invited by a friend to go to a smaller more isolated town in China that doesn't normally get tourists and I had one of the strangest experiences of my life.\n\n As a very white, decent looking, blond woman, people were taking pictures everywhere. As soon as we left the hotel, someone would take pictures, ordering food at a food court, walking up to me in the park and stealing a selfie, etc. \n\nI can not stress enough how weird that feels. At first you think it's kind of fun and flattering, then after walking for a whole day and you're sweaty, tired and grungy, you start to get annoyed. That then builds up, and you get paranoid, which makes you more tired and exhausted. People think you're special, but inside, you feel like you always have. Like you're a normal person doing normal things.\n\nAfter TWO WEEkS I was happy not to have to take another picture ever again and not have people staring. AND IM NOT FAMOUS! I get to go home and say bye bye to a surreal vacation into stardom. I can not imagine that being my life. It lost its novelty quickly.\n\nMoney and fame does not shield you from feeling the pressure. I'm sorry OP if you're struggling.",
      "created_utc": 1729274043.0,
      "score": 967
    },
    {
      "id": "lsk0yma",
      "body": "There are people who do this kind of work. I’m one of them. It also depends on how young the person is when they got into entertainment and where they live too. Not every city has a “paparazzi” culture, where I live does not, which is why a lot of famous people have second homes here.",
      "created_utc": 1729271690.0,
      "score": 85
    },
    {
      "id": "lsiltod",
      "body": "It breaks my heart bc some of his music saved me at my lowest points (along with meds and therapies), yet it couldn’t save him. 💔",
      "created_utc": 1729254403.0,
      "score": 423
    },
    {
      "id": "lskmact",
      "body": "I think Avicii was mostly under intense pressure, had an agenda filled to the brim and didn't want to disappoint anybody. Basically his friends also relied on him financially. I don't think a huge part of his problem was being recognized everywhere he went.\n\nBut I did hear Trevor Noah talk about this yesterday, how it's tough to not be anonymous anymore. How people in public come up to you and expect you to be \"on\" and nice, while they want selfies or whatever.  He also said sometimes he wanted to go out to diner, but his friends didn't want to because they didn't want all the attention or their pictures taken. So basically, you can only really go out if you feel good and are ready for all of that, which I totally understand can be exhausting.",
      "created_utc": 1729278518.0,
      "score": 141
    },
    {
      "id": "lsjr316",
      "body": "I think about the song Hold the Line more often than I should and it is really because of him I am still here in so many ways. It breaks my heart when I think about his death every time.",
      "created_utc": 1729268586.0,
      "score": 49
    },
    {
      "id": "lslvyvv",
      "body": "I’m a therapist, many of us offer telephone sessions. I’ve had clients for well over a year and I honestly would never be able to tell you what they look like. Yes during intake we request name/ address/ contact info but it’s not like we verify the information. I imagine there’s plenty of people seeing therapists under an alias. The real therapy would begin when the client feels comfortable and safe enough to eventually reveal their identity and works toward addressing their initial hesitation. Therapists are also bound by confidentiality.",
      "created_utc": 1729294358.0,
      "score": 44
    },
    {
      "id": "lsjljsy",
      "body": "There are def therapists who specialize in this, particularly in LA.",
      "created_utc": 1729266824.0,
      "score": 137
    },
    {
      "id": "lsku686",
      "body": "I love Avicii. His music truly brings happiness to my spirit.",
      "created_utc": 1729281085.0,
      "score": 24
    },
    {
      "id": "lsmvsxa",
      "body": "I would recommend this person move to a rural area. I maintain 2 residents and bounce between them one in a suburb of a medium sized metro where I'm able to access all the luxuries of a decent sized city and can still blend in but then also maintain a residence in a town of only 2k individuals that stay year round. I live on the edge of what is considered the resort area of a beautiful lake. My property backs up to the headwaters of the lake and borders the wilderness area near a trailhead that goes back for many dozens of miles and if you're willing to work for it offers views and access to 20 more highland lakes. This area is easy to maintain a low profile with very little effort and is so amazingly peaceful. There is a small airport (and I mean very small) within 7 miles of my home that can be used security free to access larger airports. So easy to come and go wether driving or flying. It's certainly possible to have it all. The public persona when you want it and maintain anonymity when you don't. There are plenty of others who do just that in my area.",
      "created_utc": 1729309168.0,
      "score": 11
    },
    {
      "id": "lsk5zgz",
      "body": "It seems to me that Phil Stutz or someone with similar methods could be of service here as far as therapy goes.",
      "created_utc": 1729273264.0,
      "score": 8
    },
    {
      "id": "lsm0aet",
      "body": "i think liam payne's death really put into perspective (for gen z) how badly these things can break people. elvis, michael jackson, judy garland, they all got tired of the limelight but people kept pushing until they broke",
      "created_utc": 1729296035.0,
      "score": 5
    },
    {
      "id": "lsjm8du",
      "body": "Man, that was tough and really hit me hard, especially considering what his music is all about.",
      "created_utc": 1729267037.0,
      "score": 5
    },
    {
      "id": "lsnt1qi",
      "body": "I’m sure there must be therapists for this gravity. The show Billions has a kind of “therapist” to help all these stock guys get their head back in the game and they’re all filthy rich in that show in that job.",
      "created_utc": 1729329848.0,
      "score": 2
    },
    {
      "id": "lsoy1m7",
      "body": "I often think if only Avicii could have held out until covid. Covid would have given him the break he needed from his relentless managers and friends.  \nRip Avicii you were the best. 🥲",
      "created_utc": 1729349544.0,
      "score": 2
    },
    {
      "id": "lsj9h0j",
      "body": "this is a good idea!",
      "created_utc": 1729262983.0,
      "score": 68
    },
    {
      "id": "lsq22i5",
      "body": "Start with Lindsay Lohan because she made it work for years!",
      "created_utc": 1729362932.0,
      "score": 9
    },
    {
      "id": "lsi8qlw",
      "body": "I’m terrible with faces. Even if I knew who they were, chances I’d recognize them is so slim.",
      "created_utc": 1729248023.0,
      "score": 1465
    },
    {
      "id": "lsimbi2",
      "body": "I was thinking the same thing. Unless you are a band from the 90s or early 2000s you’re probably safe coming and having a beer at my house",
      "created_utc": 1729254611.0,
      "score": 188
    },
    {
      "id": "lsiljyg",
      "body": "This is me as well. Any time I hear about a \"new\" artist for the first time, I usually learn from a friend that said artist has been around for 3-5 years and already has like 5-6 hits.",
      "created_utc": 1729254287.0,
      "score": 77
    },
    {
      "id": "lsiumpk",
      "body": "I'd probably recognize them but I'm cripplingly polite and would pretend I didn't.",
      "created_utc": 1729257870.0,
      "score": 80
    },
    {
      "id": "lsk6gqc",
      "body": "I also love under a rock. I worked at a restaurant/hotel  that hosted famous people a lot of time. I was a hostess for Fleetwood Mac’s event. I asked this blonde woman who was walking past me into the restaurant  “are you part of this private party?” She said “yes I am part of the private party😟”.  It was Stevie Nicks 😑.\n\nEdit: spelling",
      "created_utc": 1729273417.0,
      "score": 62
    },
    {
      "id": "lsi80au",
      "body": "haha.  same.  I have no idea what new music is anymore, I fell into my spotify playlist bubble and haven't really taken in anything new in years.  I come across apparently huge names I've never heard of all the time, involved in various scandals.  I don't do social media either, unless being anonymous on reddit counts.",
      "created_utc": 1729247596.0,
      "score": 102
    },
    {
      "id": "lsjjr24",
      "body": "Same. All this talk of Liam in One Direction dying and I genuinely wouldn't recognise any of the band members if they came up and spoke to me.",
      "created_utc": 1729266261.0,
      "score": 25
    },
    {
      "id": "lsjwwwb",
      "body": "I don't live under a rock, but I can assure and guarantee I would have no idea either 😂 I work in a niche sports industry and one day this dude steps into our gym like he owned the place and struck up a conversation as if I should know who he was. I left the conversation wondering why he talked in the manner he did, and if I should know him... Only for another member to step in a couple hours later with a \"Woah, that's such and such champion\" reaction. That's when I knew he's \"someone\", did I ever care afterwards or treat him any higher or differently? Nope... In fact, I told my then manager how I didn't know and how uneasy I felt at first (for not recognizing someone if felt like I should've) - My then managers response was to not worry about it and that said champion probably felt delighted to have a simple conversation and be simply recognised as and treated like a normal person. \n\nFor as long as I can remember, I have had friends in music on stage as well. I've always found it weird how people would follow my friends and place them on a pedestal... i'm sure seeing that has had a huge impact on how I see and how I treat people who stand in whatever spotlight. \n\nThat just goes to show that there are people outside of fame, who can be capable to treat people in fame like regular people. \n\nThen again, many people (and obv I myself included) simply do not recognise - and that's it. \n\nI understand you're tired. It is exhausting. But it's not worth keeping by yourself in consequence.  Keep your cards close, but do engage... and when you feel things don't aline (e.g. wrong intentions/motivation of the other party), move on.",
      "created_utc": 1729270420.0,
      "score": 14
    },
    {
      "id": "lsijjcw",
      "body": "Yeah they could have posted under their real name and I likely would t recognize it lol",
      "created_utc": 1729253409.0,
      "score": 28
    },
    {
      "id": "lsizjmw",
      "body": "I've worked in venues where I've come in contact with celebrities. Gave zero Fs! Lol they're just regular people. Some are AHs and some are decent. I treat them accordingly and could care less.",
      "created_utc": 1729259658.0,
      "score": 17
    },
    {
      "id": "lskpjuj",
      "body": "i used to work in a pretty big city that would often host events that had famous people there. it was no LA, but a few celebrities definitely passed through my workplace.\n\nmore than once, i had a coworker go \"wait im pretty sure that's (insert famous person here)\" and i would kinda look over, be like \"maybe,\" and continue about my day.\n\ni had someone outright ask me once how i wasn't fangirling when a member of a band i was openly a fan of and literally wearing merch for was standing in front of me... i was like \"if it is them, they gave me a fake name, so they probably don't wanna be percieved right now.\" (funny enough, i went to their concert right after my shift LOL)\n\ncelebrities are people too, and they deserve to be able to live their lives freely.\n\nheck, i wasn't even famous by any means, but at one point back in the day i was a fairly popular tumblr user (not one of the iconic/famous accounts, but known enough in the fandom spaces i frequented). someone walked up to me and was like \"hey are you (tumblr username)?\" and after i got home i deleted my account because i did NOT want to be percieved publicly like that",
      "created_utc": 1729279579.0,
      "score": 6
    },
    {
      "id": "lsl0jee",
      "body": "It’s not that everyone recognizes, it’s that there’s enough who do to make it an issue.",
      "created_utc": 1729283168.0,
      "score": 5
    },
    {
      "id": "lsj2qcr",
      "body": "I think OP is fantasizing and trying to be relevant lol",
      "created_utc": 1729260759.0,
      "score": 31
    },
    {
      "id": "lsjff4j",
      "body": "Unless they were strolling down the street or store isles while singing, I wouldn't know who they were. Even then, there's a 95% I wouldn't because I listen to music but often don't know what the singer/artist looks like.",
      "created_utc": 1729264889.0,
      "score": 4
    },
    {
      "id": "lsikt8w",
      "body": "Same",
      "created_utc": 1729253966.0,
      "score": 3
    },
    {
      "id": "lskq00f",
      "body": "I'm the same. The only social media i use is reddit so i don't know any insta celebs or trending music etc. Plus i have very little interest in movies and the entertainment industry in general.\n\nWe recently had some Gen Z folks join our office and they see me as a boring ancient person. This was making me a little anxious until i read your comment and the replies.",
      "created_utc": 1729279725.0,
      "score": 3
    },
    {
      "id": "lskqksw",
      "body": "This is why celebrity obsession and constant coverage, I think, is so toxic.  Think of all the news programs, magazines, and sites all dedicated to celebrities and making them something to be worshipped.  They can never live normal lives.  I don’t get the worship culture of anyone famous, it’s so weird to me.",
      "created_utc": 1729279914.0,
      "score": 3
    },
    {
      "id": "lsik6dq",
      "body": "On EVERYTHING!! 😂😂",
      "created_utc": 1729253689.0,
      "score": 4
    },
    {
      "id": "lsivq6m",
      "body": "To be fair, this post is about people who do exactly that and won't leave them alone.",
      "created_utc": 1729258284.0,
      "score": 2
    },
    {
      "id": "lsj0f98",
      "body": "Then there’s people like me who DGAF about famous people and wouldn’t even bother if I did see them. There’s literally no “famous” person I would approach if I saw them. Sorry OP…you’re just like me except you have more money.",
      "created_utc": 1729259962.0,
      "score": 2
    },
    {
      "id": "lsjmunh",
      "body": "Agreed. I feel like all of us who don’t know who any celebrities are should all vacation at the same place and famous people can come too so they can act like normal people.",
      "created_utc": 1729267230.0,
      "score": 2
    },
    {
      "id": "lsk18x9",
      "body": "Same. I don’t follow artists like others do. I used to work in high profile places and had no clue the stars that were there until someone pointed them out. In hindsight, I guess that’s why they gravitated to me.",
      "created_utc": 1729271782.0,
      "score": 2
    },
    {
      "id": "lsk2ent",
      "body": "Me too. I can and have visited LA and not recognize anybody, even when I went club hopping. I'm just oblivious.",
      "created_utc": 1729272150.0,
      "score": 2
    },
    {
      "id": "lskg4n6",
      "body": "Same i barely recognize my own coworkers i see every day. I connect peoples names with the experiences ive had with them thats all my brain can take.",
      "created_utc": 1729276518.0,
      "score": 2
    },
    {
      "id": "lskgygg",
      "body": "Hahahaha same. This is the only social media I partake in and I think that's why I like it. It's because it weeds out a lot of the vapid attention seekers. I get to look at cool rocks, vent, learn without having to hear about Becky's life story.",
      "created_utc": 1729276788.0,
      "score": 2
    },
    {
      "id": "lsmd5c0",
      "body": "I once went to a meeting that is similar to AA. It was my first time, I didn’t know anyone and was paranoid about seeing someone from my professional life. Standing around the front of the church before it started there was a woman who I kept stealing glances at because she looked vaguely familiar. She smiles at me, kind of inviting me to say something but I averted my gaze and went inside. Did the whole bit of people speaking then someone said, “and tonight we have a guest speaker! Please welcome [tv actress] who is here to share her experience. And I was like oooohhhhhhh 😂 I didn’t watch her main tv show, so I’d only seen her face in promos and stuff so I thought she was someone I’d worked with or something. I’m great at being rude to strangers lol.",
      "created_utc": 1729301165.0,
      "score": 2
    },
    {
      "id": "lsi8hza",
      "body": "That is funny, did not see your response until after I posted mine, it’s almost exactly the same response.",
      "created_utc": 1729247885.0,
      "score": 4
    },
    {
      "id": "lsjkdrc",
      "body": "This is pretty much what Lorde has done and I respect the hell outta her for it. To the world, she dropped off the face of the earth and her career is “in decline”. To her, she’s the happiest she’s ever been since having personal time to work through her own stuff, and to hell with what other people think.",
      "created_utc": 1729266457.0,
      "score": 141
    },
    {
      "id": "lsj7az7",
      "body": "This! Exploring different talents can give you a renewed sense of purpose and really prove to ourselves we are capable of so many things. I hope OP finds the peace they deserve. Being in the spotlight 24/7 is rough.",
      "created_utc": 1729262281.0,
      "score": 109
    },
    {
      "id": "lsjqjkf",
      "body": "Very good. Pretty applicable to anyone who’s worked hard to advance in a career that can be demanding. Often after a decade of devotion and personal sacrifice, the job can become part of your identity and you need to take a step back to reassess. Identify what truly brings you happiness and contentment.",
      "created_utc": 1729268411.0,
      "score": 27
    },
    {
      "id": "lsjsb84",
      "body": "Oftentimes turning a passion into a career backfires. It’s a sad, but true reality.",
      "created_utc": 1729268977.0,
      "score": 3
    },
    {
      "id": "lsix28k",
      "body": "So true, once I crossed 100 I knew, it would never be the same again… but we chased this dream didn’t we? It’s important we remember to be ourselves and stay grounded, be strong king!",
      "created_utc": 1729258780.0,
      "score": 247
    },
    {
      "id": "lsjntl2",
      "body": "One of my a Reddit posts got like a thousand likes, so…",
      "created_utc": 1729267538.0,
      "score": 93
    },
    {
      "id": "lsitsl9",
      "body": "I have 2000 so I'm super famous 😂",
      "created_utc": 1729257558.0,
      "score": 32
    },
    {
      "id": "lsn5pxr",
      "body": "I got over 4k likes on a reddit comment and weeks later I saw my comment in one of these reddit commentaries YouTube videos.  \nCurrently looking for another apartment to escape all the fame.",
      "created_utc": 1729314317.0,
      "score": 4
    },
    {
      "id": "lsj8twb",
      "body": "🤣🤣🤣",
      "created_utc": 1729262778.0,
      "score": 6
    },
    {
      "id": "lsm3677",
      "body": "💀",
      "created_utc": 1729297161.0,
      "score": 3
    },
    {
      "id": "lsm0gy5",
      "body": "i see that diamond background.... the fame really gets to us 1%ers",
      "created_utc": 1729296107.0,
      "score": 2
    },
    {
      "id": "lsm58ar",
      "body": "101 now😂",
      "created_utc": 1729297972.0,
      "score": 2
    },
    {
      "id": "lsnvevc",
      "body": "Why i gotta read that comment when people and dogs in my house are still sleeping.  I cackled out loud until i remembered i want the dogs to stay asleep so i don't have to get up lol",
      "created_utc": 1729331422.0,
      "score": 2
    },
    {
      "id": "ltb7e8a",
      "body": "Lmaoo",
      "created_utc": 1729671766.0,
      "score": 2
    },
    {
      "id": "lsisplq",
      "body": "Reddit avengers assemble lmao",
      "created_utc": 1729257153.0,
      "score": 2019
    },
    {
      "id": "lsjpw1c",
      "body": "Unexpectedly wholesome",
      "created_utc": 1729268199.0,
      "score": 521
    },
    {
      "id": "lsj7y98",
      "body": "You woke up and chose violence today 😂😂",
      "created_utc": 1729262492.0,
      "score": 706
    },
    {
      "id": "lsjfvrb",
      "body": "This response is hilarious",
      "created_utc": 1729265037.0,
      "score": 193
    },
    {
      "id": "lsiqvwa",
      "body": "yoo 😂",
      "created_utc": 1729256453.0,
      "score": 233
    },
    {
      "id": "lsj3umk",
      "body": "Just doing our part lmao",
      "created_utc": 1729261137.0,
      "score": 122
    },
    {
      "id": "lsj25bs",
      "body": "So clever! 🤣🤣",
      "created_utc": 1729260559.0,
      "score": 36
    },
    {
      "id": "lsn1l5y",
      "body": "I hope OP finds this funny cause I’m screaming 🤣",
      "created_utc": 1729312049.0,
      "score": 32
    },
    {
      "id": "lsismd4",
      "body": "Yes 🙌😄",
      "created_utc": 1729257119.0,
      "score": 47
    },
    {
      "id": "lsl9ruf",
      "body": "okay guys let’s be real, what are we canceling them for? like we have to make it believable!!!!!!",
      "created_utc": 1729286259.0,
      "score": 24
    },
    {
      "id": "lsitslj",
      "body": "10/10 advice",
      "created_utc": 1729257558.0,
      "score": 50
    },
    {
      "id": "lsiryf3",
      "body": "This is the way",
      "created_utc": 1729256867.0,
      "score": 91
    },
    {
      "id": "lsj0kk4",
      "body": "☠️☠️☠️",
      "created_utc": 1729260012.0,
      "score": 23
    },
    {
      "id": "lsjfk2g",
      "body": "best comment 😂😂😂",
      "created_utc": 1729264933.0,
      "score": 26
    },
    {
      "id": "lsmaxcp",
      "body": "I don’t need to know- cancelled it already",
      "created_utc": 1729300252.0,
      "score": 9
    },
    {
      "id": "lsitvs5",
      "body": "😆",
      "created_utc": 1729257591.0,
      "score": 20
    },
    {
      "id": "lsjtzuk",
      "body": "Hahahaha",
      "created_utc": 1729269507.0,
      "score": 8
    },
    {
      "id": "lsjjl7o",
      "body": "Oh my god this is so hilarious! 🤣🤣🤣",
      "created_utc": 1729266210.0,
      "score": 25
    },
    {
      "id": "lsl8evf",
      "body": "Pete wentz",
      "created_utc": 1729285794.0,
      "score": 5
    },
    {
      "id": "lsjtpg1",
      "body": "It’s Taylor Swift",
      "created_utc": 1729269416.0,
      "score": 25
    },
    {
      "id": "lsjyo6m",
      "body": "Lmao",
      "created_utc": 1729270967.0,
      "score": 3
    },
    {
      "id": "lskaz2o",
      "body": "Hahaha. The only way",
      "created_utc": 1729274855.0,
      "score": 3
    },
    {
      "id": "lslb2ak",
      "body": "I’m in, let’s do it.",
      "created_utc": 1729286705.0,
      "score": 2
    },
    {
      "id": "lsm30hu",
      "body": "💀",
      "created_utc": 1729297098.0,
      "score": 2
    },
    {
      "id": "lsmnvxe",
      "body": "Chapel roan probably",
      "created_utc": 1729305669.0,
      "score": 2
    },
    {
      "id": "lsnly2p",
      "body": "Ah yeah. Being hated and recognized is the solution lol",
      "created_utc": 1729324872.0,
      "score": 2
    },
    {
      "id": "lsiqsqm",
      "body": "[removed]",
      "created_utc": 1729256420.0,
      "score": 543
    },
    {
      "id": "lsj88di",
      "body": "I feel like 80% of this sub is made up stories. Especially the sexual confessions.",
      "created_utc": 1729262583.0,
      "score": 99
    },
    {
      "id": "lsj51h3",
      "body": "These “I hate being famous,” posts pop up every few months. I'm not buying.",
      "created_utc": 1729261532.0,
      "score": 122
    },
    {
      "id": "lsiueb5",
      "body": "What if it is Taylor Swift or Billie Eilish venting here lmao.",
      "created_utc": 1729257783.0,
      "score": 142
    },
    {
      "id": "lsjxjhe",
      "body": "Feels like a cosplay \"Liam\" thing, after what happened this week.",
      "created_utc": 1729270614.0,
      "score": 32
    },
    {
      "id": "lsky9nq",
      "body": "This is 1000% a larp",
      "created_utc": 1729282423.0,
      "score": 13
    },
    {
      "id": "lsjsprm",
      "body": "I highly doubt OP is actually famous. There’s no way an actual famous person is going go Reddit to complain. ",
      "created_utc": 1729269103.0,
      "score": 18
    },
    {
      "id": "lsirzdh",
      "body": "What’s  that?",
      "created_utc": 1729256877.0,
      "score": 7
    },
    {
      "id": "lsilttb",
      "body": "That would be a first!",
      "created_utc": 1729254404.0,
      "score": 11
    },
    {
      "id": "lsj30qt",
      "body": "Right, people are so gullible lol",
      "created_utc": 1729260858.0,
      "score": 6
    },
    {
      "id": "lsl6yah",
      "body": "I’m okay with that tbh if it helps them feel better about life",
      "created_utc": 1729285288.0,
      "score": 3
    },
    {
      "id": "lsjc6zl",
      "body": "If it makes them happy, then so be it.",
      "created_utc": 1729263854.0,
      "score": 3
    },
    {
      "id": "lskk2lg",
      "body": "they 100% are not",
      "created_utc": 1729277796.0,
      "score": 2
    },
    {
      "id": "lsl2n59",
      "body": "Yep. WTF goes on REDDIT (and don’t say “it’s anonymous!”) to make this claim.\n\nYou famous? \nGet a therapist.",
      "created_utc": 1729283857.0,
      "score": 2
    },
    {
      "id": "ltb7g5w",
      "body": "Yeah",
      "created_utc": 1729671803.0,
      "score": 2
    },
    {
      "id": "lsiuwie",
      "body": "Or Enya. One of the top selling global artists in history; no one has a GD clue what she does in her mysterious castle all day.",
      "created_utc": 1729257973.0,
      "score": 399
    },
    {
      "id": "lsj302s",
      "body": "Or Adele, she's super famous and always lives under a rock, even after releasing an album",
      "created_utc": 1729260851.0,
      "score": 89
    },
    {
      "id": "lsjxj2q",
      "body": "But isn't the sacrifice there just deciding to never go in public? Celebrities that are low profile are typically celebrities that just stay home. It sounds like OP is specifically frustrated about wanting to go in public and make genuine connections with people without their status coming into play.",
      "created_utc": 1729270610.0,
      "score": 37
    },
    {
      "id": "lsk6m1f",
      "body": "Bjork had a pretty creepy stalker though.",
      "created_utc": 1729273464.0,
      "score": 20
    },
    {
      "id": "lsiyofb",
      "body": "It's a heavy penny to be \"low profile\" just FYI. Everything will cost you when you're famous, it boils down to where you want to sacrifice most...",
      "created_utc": 1729259354.0,
      "score": 34
    },
    {
      "id": "lslgkbi",
      "body": "PJ Harvey",
      "created_utc": 1729288620.0,
      "score": 3
    },
    {
      "id": "lsmbblb",
      "body": "Also, Shania Twain.  When you want to get away, you can.  If you stop promoting yourself, people do forget, and quite quickly.",
      "created_utc": 1729300412.0,
      "score": 2
    },
    {
      "id": "lsjy510",
      "body": "Same.  Someone just going about their day isn't on the clock.  Meet someone at an event or a meet & greet.  Not on the sidewalk or restaurant.",
      "created_utc": 1729270798.0,
      "score": 49
    },
    {
      "id": "lskn97u",
      "body": "Yep, I feel so obnoxious even thinking about approaching celebrities.  The times I've seen them in public I've definitely noticed and maybe taken a slightly longer glance but then go about my day.  It does feel a little exciting to be in the proximity of someone famous, but the thought of bothering them just isnt appealing to me.  There's maybe a list of 3 celebrities where if I saw them I'd consider approaching under the right circumstances and even then if it was at the grocery store or something it might be a head nod acknowledging them at best.",
      "created_utc": 1729278834.0,
      "score": 14
    },
    {
      "id": "lsn1zd5",
      "body": "Yes, they’re STRANGERS!! People tend to forget that just because it’s a familiar face. You don’t know those people, just let them live their lives.",
      "created_utc": 1729312259.0,
      "score": 3
    },
    {
      "id": "lsmvi23",
      "body": "I think the problem now is selfies, it must be super annoying having to take a photo every minute.",
      "created_utc": 1729309028.0,
      "score": 2
    },
    {
      "id": "lsnyxu3",
      "body": "The problem is not everyone shares the same opinion. Loads of people have no filter and no social awareness or manners. I would hate to be famous. ",
      "created_utc": 1729333686.0,
      "score": 2
    },
    {
      "id": "lsk930o",
      "body": "Same with Scotland. Even if people recognize you they are chill about it.",
      "created_utc": 1729274248.0,
      "score": 87
    },
    {
      "id": "lslpe0f",
      "body": "I remember when I was living in Auckland, Katy Perry and Russell Brand were walking down Queen St in the city, and people were just walking past them not giving a single fuck. I saw probably 2 people stop and say something like \"omg hi\" but that was it. I didn't even see any photographers around.",
      "created_utc": 1729291869.0,
      "score": 19
    },
    {
      "id": "lslv4k7",
      "body": "Literally have seen celebrities I'm a huge fan of on Queen Street the day before I was due to see them live. I just waved and kept walking 😂",
      "created_utc": 1729294037.0,
      "score": 4
    },
    {
      "id": "lspwx4u",
      "body": "what if this is Lorde...",
      "created_utc": 1729361249.0,
      "score": 4
    },
    {
      "id": "lsmpf9d",
      "body": "[deleted]",
      "created_utc": 1729306322.0,
      "score": 3
    },
    {
      "id": "lskmnc6",
      "body": "Not as bulletproof as you think if the celeb is American, 90% of media in Australia is US made.",
      "created_utc": 1729278636.0,
      "score": 5
    },
    {
      "id": "lslf4nv",
      "body": "Was going to comment just move to NZ. Honestly, it’s great, and yeah if you do get recognised people will either leave you alone or give you a light ribbing - either way the ego will always stay in check in our tall poppy nation 😛\nSurf, ski, hike, eat a million mince pies. \nThe food is mean as (kiwi slang for really good). Welcome to your wholesome future life.",
      "created_utc": 1729288115.0,
      "score": 5
    },
    {
      "id": "lslidd7",
      "body": "Canada also decent for this",
      "created_utc": 1729289281.0,
      "score": 2
    },
    {
      "id": "lsja91f",
      "body": "or move to sweden. people will recognize you but approaching a stranger is against the law there /s",
      "created_utc": 1729263233.0,
      "score": 203
    },
    {
      "id": "lsjnxl9",
      "body": "Or move to Ireland, we tend to ignore famous people when we see them in case their already massive head gets even bigger. Especially if they’re Bono.",
      "created_utc": 1729267573.0,
      "score": 98
    },
    {
      "id": "lskbfh1",
      "body": "Or New Zealand, we would possibly recognise you but we wouldn’t care",
      "created_utc": 1729275003.0,
      "score": 29
    },
    {
      "id": "lsmy0ou",
      "body": "Or to a village in East Europe. Unless you are not super super famous they will not recognize you.",
      "created_utc": 1729310229.0,
      "score": 2
    },
    {
      "id": "lsj5139",
      "body": "This.  100%.  Famous people walk around NYC, take the subway, etc and no one seems to bother them.  Get yourself an oversized pair of headphones and wear them. That seems to be the move so that no one talks to them.",
      "created_utc": 1729261528.0,
      "score": 48
    },
    {
      "id": "lsnr5ps",
      "body": "They are of course in it for the money. If they were not concerned about their perceived marketability, they would not be complaining, they would just be living. Famous people who bark back at paparazzi and tell obnoxious fans to GTFO do not sell. If they truly wouldn't care about the money, they could easily pull a Robert Pattison. \n\nComplaints like these amuse me because the solution is so simple. Just live your life and act like a regular person. Someone is in your space? Yell and tell them to piss off. You're not obligated to be polite to an obnoxious stranger just because you're famous & they are supposedly a fan.",
      "created_utc": 1729328565.0,
      "score": 3
    },
    {
      "id": "lsn5t6b",
      "body": "This. My hometown has former premier league footballer Robbie Savage as the head coach/part owner of our local football club. We all know that he used to play football professionally, but we literally just ignore the fact that he did and whenever we see him around town we let him go about his business, no matter how bad or good our team plays. Honestly, if he wasn't pointed out to me once by a family friend I wouldn't have recognised him as my hometown football club's part owner/head coach. And from what I can gather, one of the next towns over has a lot of footballers, both current and ex players, living there and they go about their daily business without being bothered by fans.",
      "created_utc": 1729314368.0,
      "score": 4
    },
    {
      "id": "lsjmo37",
      "body": "Whose your dad. 👀",
      "created_utc": 1729267173.0,
      "score": 22
    },
    {
      "id": "lsj95jq",
      "body": "They live a life where they became incredibly successful following their passions, which is a dream billions of people share. \n\nSeeing a celebrity surrounded with adoring fans also appeals to the common human desire to be loved and respected. \n\nFew see the world behind the scenes, with nights of little sleep, next to zero privacy or time to decompress, stalkers, negative media attention, and opportunistic people looking to ride their coat-tails on some grift or get a similar record/studio deal.",
      "created_utc": 1729262882.0,
      "score": 12
    },
    {
      "id": "lsjyiqp",
      "body": "Same.  It's really weird, in a way.  You're not falling for the actual person, but the persona or character they play to the crowd.  The person and the character are two very different beings....and meeting one often ruins perception of the other.",
      "created_utc": 1729270919.0,
      "score": 3
    },
    {
      "id": "lsjhbg9",
      "body": "i was just about to comment that 😭",
      "created_utc": 1729265493.0,
      "score": 25
    },
    {
      "id": "lsj3gig",
      "body": "A thought I also had but they all feel this way hahs",
      "created_utc": 1729261006.0,
      "score": 68
    },
    {
      "id": "lsjmhh7",
      "body": "Lol my first thought but she blew up in the last two years.",
      "created_utc": 1729267116.0,
      "score": 33
    },
    {
      "id": "lskbog1",
      "body": "Fr I almost said \"alright chappell roan\"",
      "created_utc": 1729275082.0,
      "score": 14
    },
    {
      "id": "lslojsr",
      "body": "No way … they have certainly NOT been out of the spotlight for a few years like OP indicated",
      "created_utc": 1729291554.0,
      "score": 5
    },
    {
      "id": "lsjmtxy",
      "body": "I'm convinced this is Chappell.",
      "created_utc": 1729267224.0,
      "score": 23
    },
    {
      "id": "lsjvjvl",
      "body": "I’m gonna figure out who you are and cancel you also sorry for your loss",
      "created_utc": 1729269995.0,
      "score": 51
    },
    {
      "id": "lsow9kp",
      "body": "hawk tuah girl?",
      "created_utc": 1729348922.0,
      "score": 3
    },
    {
      "id": "lsjhlu2",
      "body": "I live in the same kind of place, and I was going to post the same kind of thing. Aging celebrities just living out their lives in virtual anonymity.\n\n\nIt’s quiet enough out here that you can definitely grocery shop on the regular without randos tracking you down, and without having to hide your face everywhere you go. \n\n\nWe’re close enough to a place where celebrities are ubiquitous that seeing one isn’t ASTONISHING so nobody really makes a huge spectacle about it. \n\n\nWe all just sort of gracefully ignore “who they are”, but every once in a while some schmuck will shout from across the room at the club “OMG it’s _____” and it’s like come on man, don’t you know not to do that? It’s rare but it happens. Idk, depends on whether you’re willing to live in suburbia or not. But something like this may be an option for you.",
      "created_utc": 1729265584.0,
      "score": 9
    },
    {
      "id": "lsknszt",
      "body": "That is pretty much the only acceptable level of fame I could live with.  I'm sure your uncle knows other famous musicians and has some credibility in those circles, but like you said he can walk around like a normal person.  Perfect.",
      "created_utc": 1729279012.0,
      "score": 3
    },
    {
      "id": "lsjxjxy",
      "body": "I honestly thought the same too lol.",
      "created_utc": 1729270618.0,
      "score": 4
    },
    {
      "id": "lsizvp2",
      "body": "I read the part where you said that you've decided to start taking music lessons. I just want to commend you for that. It is so daunting to pick up a new instrument in adulthood and a lot of people don't try new instruments because they are afraid that they're going to suck and they want to avoid the pain of being new at something. I just want to say that I think it's super commendable that you're stepping outside of your comfort zone and that you are doing everything that you can to make sure that the music inside of you gets out for the rest of us to hear. It would be such a tragedy for you to die with the melody still inside of you. I am so glad that you have listened to your hearts calling and picked up an instrument and I wish you all of the best in your musical journey. \n\nAfter being burned tf out on classical vocal studies from college, after a long hiatus from music I just picked up bass 2 years ago and I'm having a blast. I wish you the same my friend. 💜",
      "created_utc": 1729259774.0,
      "score": 13
    },
    {
      "id": "lsjw8pj",
      "body": "Ohhh I forgot about him. I didn’t even realize he went ghost till I saw a random video about it 2 weeks ago.",
      "created_utc": 1729270209.0,
      "score": 2
    },
    {
      "id": "lsid9hw",
      "body": "true, small town folks wouldn’t recognize a celebrity very easily at allll, and there are some beautiful small towns in colorado, montana, maine, etc.",
      "created_utc": 1729250465.0,
      "score": 15
    },
    {
      "id": "lsjws6i",
      "body": "Even for creative writing this one is kinda short on the details that would give it verisimilitude.",
      "created_utc": 1729270379.0,
      "score": 8
    },
    {
      "id": "lsme2ml",
      "body": "I agree",
      "created_utc": 1729301544.0,
      "score": 2
    },
    {
      "id": "lsi7zgy",
      "body": "Lmao “lurking”",
      "created_utc": 1729247583.0,
      "score": 2
    },
    {
      "id": "lsn2rsj",
      "body": "Being famous for any reason would be my nightmare. I want the world to leave me alone lol.",
      "created_utc": 1729312686.0,
      "score": 2
    },
    {
      "id": "lsj9bew",
      "body": "Dead internet theory",
      "created_utc": 1729262934.0,
      "score": 12
    },
    {
      "id": "lt3e5ck",
      "body": "It’s domd, couldn’t be less of a bot😭",
      "created_utc": 1729555495.0,
      "score": 2
    },
    {
      "id": "lsjjnj4",
      "body": "If OP doesn’t wanna play DND I have been wanting to get into it, what do you play on?",
      "created_utc": 1729266230.0,
      "score": 10
    },
    {
      "id": "lsmo9cq",
      "body": "This is what I wanted to say. If OP really is famous, I don't feel sorry for them. They have the money to do whatever they want. Don't want to be recognized? Go somewhere where people won't recognize you. Simple. They have the money to do it. Imagine the perks you would have being famous.",
      "created_utc": 1729305826.0,
      "score": 2
    },
    {
      "id": "lskn5by",
      "body": "Its probably for attention",
      "created_utc": 1729278800.0,
      "score": 2
    },
    {
      "id": "lsjxz1s",
      "body": "Looks like they deleted everything else they had, there’s nothing on there besides this post. What other topics did you see?",
      "created_utc": 1729270747.0,
      "score": 4
    },
    {
      "id": "lslwfp6",
      "body": "Listening to this song at Lululemon as I read your comment",
      "created_utc": 1729294536.0,
      "score": 89
    },
    {
      "id": "lsksqlc",
      "body": "The same thing happened to me in Korea. I thought someone was offering to take a pic of me and my friends for me, they handed their camera to someone else and took pictures with me. \n\nI am not petite. I don't look like anyone. I do have visible tattoos which was pretty rare there (at the time, almost 15vyears ago) and I have red hair. Some of the people just ran their fingers through my hair. \n\nA very strange experience.",
      "created_utc": 1729280620.0,
      "score": 306
    },
    {
      "id": "lslb96e",
      "body": "This also happened to me in India and I felt exactly like you explained. It was fun at first and I thought \"oh! This must be how it feels to be famous\" At one point I remember visiting the red fort and I broke down due to the extreme amount of people, specifically children, everywhere living in such desperate poverty. I started to cry and then I felt a girl tap me on my arm wanting to take a picture with me with her friends and I tried to quickly wipe away tears and smile with her friend group for pics. I was only there for 2 weeks, I can't imagine living like that all the time.",
      "created_utc": 1729286768.0,
      "score": 70
    },
    {
      "id": "lskirzx",
      "body": "This happened to me when I was in France and Italy. I’m a petite redhead and idk if they thought I was Lindsey Lohan or something (she was still popular at this time) but I’m betting I’m on a lot of Asian peoples walls and they probably think I’m someone I’m not 😂",
      "created_utc": 1729277377.0,
      "score": 87
    },
    {
      "id": "lslnxs8",
      "body": "I get this. I spent three years as a white kid in Myanmar which was interesting but definitely had a lasting effect on my self-perception",
      "created_utc": 1729291326.0,
      "score": 16
    },
    {
      "id": "lsodw3s",
      "body": "I studied abroad in China with a group of 8 other Americans - mostly white or white hispanic.  Every “field trip” to major tourist attractions was met like this.  It was SO weird.",
      "created_utc": 1729341599.0,
      "score": 4
    },
    {
      "id": "lsmbas1",
      "body": "My brother got married in Vegas. And people, random strangers, were randomly stopping us, to try to take pictures of my niece dressed up to be the flower girl. It was sooo strange",
      "created_utc": 1729300403.0,
      "score": 3
    },
    {
      "id": "lsnmf2d",
      "body": "I'm about the same age as Alyssa Milano. As a teenager, a lot of people would comment that I looked like her, but nobody ever actually thought I *was* her - at least, not until I traveled outside the US for the first time. When I went to spend a week in Trinidad, I got quite a few autograph requests! (I probably should've just gone along with it.) I was maybe 15 or 16, so I thought it was pretty cool at the time, but if I was actually a famous actress and I had to go through that every day, I'm sure it would get old.",
      "created_utc": 1729325204.0,
      "score": 3
    },
    {
      "id": "lso6mbp",
      "body": "Same thing happened in China, because I'm black and I was around white people and Chinese friends and I was the odd one out. People wanted to take pics with me and of me. It was definitely an out of body experience. Sounds like your experience was more extreme.",
      "created_utc": 1729338085.0,
      "score": 2
    },
    {
      "id": "lsomqba",
      "body": "We had this situation here in Australia, in a tourist spot while we were on holiday. Japanese tourists would photograph my blonde toddler and asked to take photos with him and it was just so weird.  It wasn’t once or twice, it was relentless.  Years later I worked for Japanese company and they were constantly asking for photos of my son with our products and they were just fascinated with him.  They just love blonde caucasians.",
      "created_utc": 1729345355.0,
      "score": 2
    },
    {
      "id": "lsk2vo8",
      "body": "r/[Responsible-Pie-703](https://www.reddit.com/user/Responsible-Pie-703/) maybe you can start here? If not for sessions then perhaps to get into touch with a professional who may be able to guide you to the next step?",
      "created_utc": 1729272295.0,
      "score": 49
    },
    {
      "id": "lsk6mqo",
      "body": "These feels for Avicii and Chester Bennington. It sucks.",
      "created_utc": 1729273471.0,
      "score": 188
    },
    {
      "id": "lslarjf",
      "body": "Yeah it sounds awful and I’ve never understood why people want fame. I get wanting to be good at what you do and love but just to be known sounds like hell. I deleted my Facebook account after the first time I met someone in real life who recognised me just from a friend of a friends pictures. It’s creepy even when it means nothing really!\n\nI can’t imagine having this image of yourself that’s so connected to you but not you. I imagine it might start to feel like you don’t even own yourself anymore or like you’re an avatar that belongs to the ‘sphere.’ Plus there’s the fact that no one really actually cares about you. You’re more like a curiosity or a character that people find interesting for a bit but then they go back to their day to day lives with the people who really matter to them and you’re not really anything. I don’t know how you’d reconcile being so big and so empty at the same time, trying to be a real person when you’re also so tied to this giant caricature balloon that everyone else sees. We know ourselves through others, so I can’t imagine how impossible it would become to really BE if all the people you know have this giant ‘famous ghost’ hovering over their impressions of you and your relationship.",
      "created_utc": 1729286600.0,
      "score": 40
    },
    {
      "id": "lsogj75",
      "body": "I had an encounter with Cameron Diaz in Eataly years ago where she had a piece of toilet paper on her shoe. my friend whispered her name to get her attention and pointed to her shoe. She saw it, kicked it off and that was it. We didn’t engage her otherwise as it looked like she was just doing what we were doing - grocery shopping.\n\nShe made it to the end of the aisle before a group of girls bombarded her asking for pics. She was so sweet and gracious about it but earnestly said she was just trying to run an errand and if it would be ok to not do pics. That resonates with me to this day. I can’t imagine always having to be “on” or glam, even if your goal was to be famous.",
      "created_utc": 1729342747.0,
      "score": 5
    },
    {
      "id": "lsmyit0",
      "body": "I second this persons opinion. This is good advice. Also your life sounds dope. I want a city house and to escape to a farm or mountain house in the middle of nowhereville to just chill and veg out in nature.",
      "created_utc": 1729310478.0,
      "score": 6
    },
    {
      "id": "lsk7u37",
      "body": "One of the main reasons Robin Williams decided to live in Marin county was that people would leave him alone there. They knew it bugged him to be spotted, so they left him alone most of the time. \nSame with Tracy Chapman and Noe Valley in San Francisco",
      "created_utc": 1729273853.0,
      "score": 251
    },
    {
      "id": "lsisq4p",
      "body": "I'm the same. It doesn't compute with me that I'd see a famous person on the street. I was in vegas decades ago when Criss Angel was popular. He had that Mind Freak residency.  We even watched his show on tv back then. I ran/bumped into him I think at the Luxor. We had a brief 'hello.. sorry, my bad, no worries'' and continued on. It didn't even register in my brain who it was until my husband made a comment about it.",
      "created_utc": 1729257159.0,
      "score": 257
    },
    {
      "id": "lsm53zq",
      "body": "My partner is too. He saw Kesha once while he was taking a smoke break near his office (which happened to be across the alley from her hotel). He actually *let her use his lighter* and STILL didn’t recognize her. Several hours later, a lightbulb went off in his head, and he told me “I think I met Kesha today.” After asking him a couple of questions, I was able to confirm that he did, in fact, meet Kesha.",
      "created_utc": 1729297925.0,
      "score": 18
    },
    {
      "id": "lsjb6y0",
      "body": "Yup. Me too. According to friends I've walked by Rhys Ifans and James McAvoy. You know... there are so many really famous people that ride the underground in London or the subway in NYC that it can be easily managed. FFS I saw a photo of Ed Sheeran on the NYC subway. I bumped into Sir Ian McKellen in my gym and didn't do anything. \n\nBTW, I'm sure with the celebrity you also have financial security. A lot of people would love to be financially secure. \n\nYou may want to sit down and do a gratitude journal to find the things that you're grateful for... That might help with the way you're feeling.",
      "created_utc": 1729263534.0,
      "score": 67
    },
    {
      "id": "lsjbplb",
      "body": "This is me too.  When I watch a TV show and they cut to a character doing something, I have to try to figure out who that is.  Like I guess we're supposed to know by seeing them, but I have no idea.  I've been leaving the captions on because sometimes that helps me figure out who is who.",
      "created_utc": 1729263698.0,
      "score": 12
    },
    {
      "id": "lsnp3j5",
      "body": "This! When I was a kid my parents divorced my father stayed in Hawaii ( he actually started dating one of  Don Hos daughter in Hawaii I also had no clue who he was and being a bratty kid of divorced parents told my dads girlfriend that a lot of) my mother lived in Vegas so I traveled a lot back n forth, anyways I was in line with my dad waiting to check in (this is the 90s) and this giant tall black man is in front of us his girlfriend or wife was with him and she was at his waist I had NO  clue who he was when all of a sudden people from everywhere start running up to the man jumping to try to touch his head even and I’m like “who is this” it was Shaquille O’Neal! I had no clue, anyways he was in the same plane as me and I ended up talking to him as I was like 12 he saw I was a scared girl flying by myself and was very kind. But yes he’s very tall. But I’ve always been this way, in like 08-09 I was in New York with my husband on a trip and we were in the parking garage getting our rental car we had parked there and this beautiful woman and man were finishing giving their ticket in and I say to the lot attendant “wow that woman is stunning is she famous or something ” (she was like beyond beautiful) he says “she no but he’s Pitbull” (the singer). I’ve had many times this has happened to me 😂",
      "created_utc": 1729327091.0,
      "score": 3
    },
    {
      "id": "lsmjugk",
      "body": "Even if I knew who they were I wouldn't give two shits.  \nI'm guessing they refuse to leave LA or NY and actually take meaningful steps to lose their celeb status.",
      "created_utc": 1729303946.0,
      "score": 2
    },
    {
      "id": "lsp5x1m",
      "body": "I once actually BUMPED into a well known celebrity and did not know until my friend punched me and said, do you know who you just ran into? I'm the same way. I can't recognize faces easily.",
      "created_utc": 1729352258.0,
      "score": 2
    },
    {
      "id": "lspv1sa",
      "body": "Gloria Estefan was on the next treadmill by me and I didn’t notice her at all until someone spoke to her and I recognized her voice. This was around 20 years ago when she was more famous. It was weird.",
      "created_utc": 1729360633.0,
      "score": 2
    },
    {
      "id": "lsk1kc8",
      "body": "I'm sorry, but I have to ask. If bands from the 90s etc wouldn't be safe coming to your house... what the heck would you do to them!? 😆",
      "created_utc": 1729271883.0,
      "score": 42
    },
    {
      "id": "lsn72p9",
      "body": "I am 38, and feel more like this every day.",
      "created_utc": 1729315104.0,
      "score": 2
    },
    {
      "id": "lskheqx",
      "body": "My dad and I ran into Common in DC once and I thought I was playing it cool pretending I didn’t know who he was/didn’t care..later my dad told me I looked like I was bursting at the seams to say hello 😂",
      "created_utc": 1729276934.0,
      "score": 20
    },
    {
      "id": "lsmgz7m",
      "body": "Famous people grateful to all the ignorant or shy people.",
      "created_utc": 1729302757.0,
      "score": 7
    },
    {
      "id": "lskyg7h",
      "body": "Now Stevie I’d definitely recognise 😂",
      "created_utc": 1729282482.0,
      "score": 8
    },
    {
      "id": "lsojwid",
      "body": "ugh I would’ve lost my shit if I saw Stevie Nicks 😭❤️❤️",
      "created_utc": 1729344185.0,
      "score": 2
    },
    {
      "id": "lsjbz0j",
      "body": "My iphone is filled with mp3's I downloaded from Napster.",
      "created_utc": 1729263783.0,
      "score": 34
    },
    {
      "id": "lsicbaq",
      "body": "I often use the number radio option. Same vibes, a lot of familiar songs but often some great new songs too!",
      "created_utc": 1729249980.0,
      "score": 12
    },
    {
      "id": "lsn0f0n",
      "body": "Me too, like I know who one direction is. I can sing along to a couple of their songs. But seeing the news of his death I had no clue who he was. I thought if I looked up a picture from when he was younger that I’d recognize him better but no. No disrespect intended, I just really don’t recognize his face.",
      "created_utc": 1729311443.0,
      "score": 4
    },
    {
      "id": "lsow8ua",
      "body": "Literally was so confused when they said he was “ex-1D member” LIKE WHAT",
      "created_utc": 1729348915.0,
      "score": 2
    },
    {
      "id": "lskwjzo",
      "body": "I don't know who Lorde is but if you mean Rick Moranis you're dead right.",
      "created_utc": 1729281862.0,
      "score": 8
    },
    {
      "id": "lssvxsc",
      "body": "I was thinking OP might be Lorde, a lot of the details match up",
      "created_utc": 1729402547.0,
      "score": 2
    },
    {
      "id": "lssvy57",
      "body": "I was thinking OP might be Lorde, a lot of the details match up",
      "created_utc": 1729402552.0,
      "score": 2
    },
    {
      "id": "lsl40qn",
      "body": "Absolutely.\n\nWhen I was a kid, I wanted fame **so badly.** Now I'm like, \"Oh thank God I never became famous!\" Looks and sounds just as exhausting as OP describes it to be.\n\nOP, if you happen to read this: I totally agree  that taking a step back sounds like a great idea.\n\nIf you think you might just need a break, and don't want to disengage with The Industry atm...I assume and hope you have someone at least helping with your socials--maybe turn them over to that person entirely, and ask them to make regualar \"vaguebooking\" posts: \n\n\"I ❤️ all you guys so much!\" \"I saw the *cutest* bunny on the grass in a random parking lot today!\" \"OK: vote time. *Leave it to Beaver* or *Bewitched*? (Yes, I have been marathoning vintage shows in my downtime lately, lol.)\"\n\nLet yourself be seen in public ever so occassionally: like, once a month, if that doesn't seem like too much. For 15 minutes, ya know?\n\nAnd, if you *do* decide to keep going in the entertainment biz, maybe start increasing the difference between your stage persona and yourself--so that, instead of *you* having to go out in a hoodie and sunglesses, your *persona* would have to dress like...someone everyday, like YOU. That is, make yourself and your stage you increasingly visually separate from each other.\n\nTHEY dye their hair purple (if you're a brunette), or THEY dye their hair blonde (if yours is purple). Like, lean into a style that you don't *hate,* but that YOU you would never get into.\n\nEventually, you'll have to dress as your persona to be \"seen;\" you can then go back to dressing & styling yourself however you like. \n\nThen if you get the stray, \"OMG, you look sooooooo much like [you!],\" you can say, \"haha, people used to tell me that all the time, so, thanks! Now that [persona] has changed their look so much, people hardly ever say it. Have a good day.\"\n\nIn any case: I hope you find a thing you love to spend your time on without simultaneously giving away every ounce of your energy and a good chunk of your selfhood--that's no way to live.\n\n❤️",
      "created_utc": 1729284312.0,
      "score": 2
    },
    {
      "id": "lsn6f62",
      "body": "I once posted an original joke that got 20 ppl smashing that laugh emoji. Lorne Michaels asked me to come write for SNL. He was *incessant*",
      "created_utc": 1729314721.0,
      "score": 12
    },
    {
      "id": "lsmuato",
      "body": "*gasp* is that u/letmbleed from the 1,000 up vote post! Please take a pic with me real quick!",
      "created_utc": 1729308478.0,
      "score": 23
    },
    {
      "id": "lsmw04a",
      "body": "One of my Tik Tok comments has over 17,000 likes, so I know how you feel. It’s so lonely at the top.",
      "created_utc": 1729309260.0,
      "score": 6
    },
    {
      "id": "lsn89vy",
      "body": "Violence with a wholesome cause",
      "created_utc": 1729315813.0,
      "score": 53
    },
    {
      "id": "lsqpg5r",
      "body": "Cancel isn’t violent",
      "created_utc": 1729370894.0,
      "score": 3
    },
    {
      "id": "lsp3fqr",
      "body": "They definitely kick puppies!",
      "created_utc": 1729351400.0,
      "score": 6
    },
    {
      "id": "lspl5r7",
      "body": "Just get a few minutes on camera with that interviewer who tried to take down Blake Lively and Anne Hathaway then watch said interviewer splice the responses in a negative way all over TikTok. DONE! No actual scandal needed.",
      "created_utc": 1729357398.0,
      "score": 6
    },
    {
      "id": "lsju71b",
      "body": "They said that they've been out of the spotlight for a couple of years so definitely not her.",
      "created_utc": 1729269570.0,
      "score": 111
    },
    {
      "id": "lsjyy48",
      "body": "Travis Kelce's girlfriend?",
      "created_utc": 1729271055.0,
      "score": 28
    },
    {
      "id": "lsk91tf",
      "body": "My bet is John Mayer.",
      "created_utc": 1729274237.0,
      "score": 19
    },
    {
      "id": "lsizmml",
      "body": "Making shit up and the internet go hand in hand. \n\nI too am a has been celebrity - don’t question it.",
      "created_utc": 1729259686.0,
      "score": 255
    },
    {
      "id": "lsk823b",
      "body": "Yeah. People are so weird. Just start a journal for your creative writing…",
      "created_utc": 1729273924.0,
      "score": 44
    },
    {
      "id": "lsk9jzb",
      "body": "Yeah its probably bs",
      "created_utc": 1729274399.0,
      "score": 16
    },
    {
      "id": "lsizcvz",
      "body": "What if it's Beyonce or *Britney* or Xtina?\n\n*Edited because my autocorrect hates me.*",
      "created_utc": 1729259592.0,
      "score": 58
    },
    {
      "id": "lsj82mo",
      "body": "or diddy?!?!!!",
      "created_utc": 1729262532.0,
      "score": 25
    },
    {
      "id": "lsiuifa",
      "body": "It’s a J apparently… is it Jordana? I love her.\n\nOr maybe Janet Jackson?",
      "created_utc": 1729257826.0,
      "score": 5
    },
    {
      "id": "lsno51l",
      "body": "It's possible - might be the only anonymous place they can let their feelings out. A LOT of celebs used reddit/twitter/insta etc under fake names/accounts.",
      "created_utc": 1729326417.0,
      "score": 18
    },
    {
      "id": "lsssvzk",
      "body": "Where else would be the ideal place to anonymously do it? Celebs use the same social media we do lol",
      "created_utc": 1729400881.0,
      "score": 2
    },
    {
      "id": "lsisdj1",
      "body": "Live Action Role Play",
      "created_utc": 1729257025.0,
      "score": 11
    },
    {
      "id": "lsiw1k9",
      "body": "Honestly this would be my moves, too. What a dream, to make enough money to just disappear and become mysterious.. 😩",
      "created_utc": 1729258402.0,
      "score": 151
    },
    {
      "id": "lsjat9j",
      "body": "[deleted]",
      "created_utc": 1729263413.0,
      "score": 37
    },
    {
      "id": "lsjxrf4",
      "body": "You know how long it takes to clean an entire castle?  And they're drafty as hell.  Can't keep the dust out to save your life.",
      "created_utc": 1729270682.0,
      "score": 7
    },
    {
      "id": "lsjvqqf",
      "body": "*alright boys, let's sing the Halo theme again...*",
      "created_utc": 1729270054.0,
      "score": 5
    },
    {
      "id": "lsj3i56",
      "body": "I hope she enjoys that, but it does feel lonely, living in a castle :(",
      "created_utc": 1729261021.0,
      "score": 14
    },
    {
      "id": "lsmdzo9",
      "body": "I’ve decided she’s a vampire",
      "created_utc": 1729301510.0,
      "score": 4
    },
    {
      "id": "lsnwvch",
      "body": "I read she had a ton of cats, so she’s probably busy playing with them and being happy! 😊 Definitely living her best life!",
      "created_utc": 1729332370.0,
      "score": 2
    },
    {
      "id": "lsplp2k",
      "body": "Meditate, smoke weed, stare longingly at the ocean and hum to the piano while tinkering out new sounds. I’m guessing!",
      "created_utc": 1729357570.0,
      "score": 2
    },
    {
      "id": "lsjyjj5",
      "body": "you can be public and be famous, going into small towns or countries. plus, if you dont want to move to bumfuck nowhere you can stay on the low for a few years and the public will eventually forget you. new stars come up all the time",
      "created_utc": 1729270926.0,
      "score": 9
    },
    {
      "id": "lsqln4m",
      "body": "That's putting it mildly. That guy was an absolute psychopath.",
      "created_utc": 1729369595.0,
      "score": 2
    },
    {
      "id": "lsn9tau",
      "body": "There's maybe 3 people I would approach in the right setting.  I once got upgraded to first class for free and sat next to a very famous person from a show I have watched my whole life.  (Star Trek TNG/DS9) When we landed I just told them I really appreciated their work on the show and they were incredibly nice to me.  I could tell they genuinely appreciated my quick comment and it made me feel warm fuzzies for a week.  (Colm Meaney). I didn't even realize it was him until halfway through the flight when I recognized his voice.",
      "created_utc": 1729316740.0,
      "score": 2
    },
    {
      "id": "lsle746",
      "body": "This is definitely true to an extent, depending on where you are.\n\nThere's a fairly well known Scottish actor who has lived around my area (semi-rural) on/off for years and, for the most part he went about his life unbothered, could go for a beer or meal with minimal interference. The exception was when he was part of the cast of an international hit TV series - definitely got a bit more attention during that time period. The locals who knew he was pretty private were always very respectful/protective of him though. \n\nI worked in a pub in Finneston (Glasgow) for a while and a very well known Scottish comedian was a regular. Generally he called ahead and would request a table tucked away in a corner and, occasionally, he would be able slip in unnoticed with his partner and friends; have a meal and a few drinks then get out without any fuss. More often than not he would be noticed. Some folk would be over at the table asking for pictures while he was actively eating his food, some would try to take sneaky pics without his permission, and so many people would just...stare at him. Very disconcerting...I fully understand why Bjork bought that remote island home at the height of her paparazzi attention!",
      "created_utc": 1729287789.0,
      "score": 55
    },
    {
      "id": "lsnpct2",
      "body": "Ireland can be similar. You won't really get paparazzi like you do in other places. Most people just leave you alone even if they recognise you. Especially in quieter areas of the country. They might say hello as they walk past you, but that's it.\n\nMileage may vary, though, depending on how truly famous someone is and the age range of their fans. The younger the fans, the more insane reaction you'll get. I mean, I'm pretty sure Taylor Swift can't just be chill anywhere in the world at this point?",
      "created_utc": 1729327274.0,
      "score": 2
    },
    {
      "id": "lss4ycc",
      "body": "Just about to say this. Probably one of the few that would be recognizable. Her and the LOTR cast.",
      "created_utc": 1729390305.0,
      "score": 3
    },
    {
      "id": "lsn5ow7",
      "body": "I definitely do 😂 I'd bet $20 i have no clue who OP is",
      "created_utc": 1729314300.0,
      "score": 2
    },
    {
      "id": "lsjin3b",
      "body": "Move to South Pole, having interaction with pinguins is special",
      "created_utc": 1729265913.0,
      "score": 66
    },
    {
      "id": "lsjsdcw",
      "body": "Or McGregor, the wanker.",
      "created_utc": 1729268996.0,
      "score": 34
    },
    {
      "id": "lsm900p",
      "body": "Ahh, so this is where Australia got our tall poppy syndrome problem from! Makes sense.",
      "created_utc": 1729299477.0,
      "score": 3
    },
    {
      "id": "lsk4mot",
      "body": "I’m convinced this is someone pretending to be Chappell",
      "created_utc": 1729272829.0,
      "score": 49
    },
    {
      "id": "lsl6xw5",
      "body": "Thank uuu ❤️",
      "created_utc": 1729285285.0,
      "score": 13
    },
    {
      "id": "lskq4um",
      "body": "His address book would be amazing to look through but I agree, I think he’s got the best of both worlds. I don’t know how he feels about it though. Maybe he wishes for more, although at his age hopefully he’s past that. Either way, I hope OP can find a way. I think Tracy Chapman retired from music for the same reason and I feel so bummed as a human that I’ll never get a chance to see her perform. But, also as a human, I’m glad she found her boundaries.",
      "created_utc": 1729279769.0,
      "score": 3
    },
    {
      "id": "lsil1en",
      "body": "Yeah my town in Maine is mostly old rich people and hippies one group is too concerned with themselves to care and the other is too concerned with climate change to notice someone would be pretty safe around here 😂",
      "created_utc": 1729254063.0,
      "score": 14
    },
    {
      "id": "lsimftv",
      "body": "Honestly, depending on the age of a musician, most small towns with older demographics won’t know this person.",
      "created_utc": 1729254662.0,
      "score": 8
    },
    {
      "id": "lsjk2z9",
      "body": "[deleted]",
      "created_utc": 1729266365.0,
      "score": 6
    },
    {
      "id": "lsjmesk",
      "body": "Altrole on discord! Best online dnd",
      "created_utc": 1729267093.0,
      "score": 6
    },
    {
      "id": "lsocino",
      "body": "I’ve had people use me for $15 , my time, my attention it’s no different if I had the money shit I’d be able to disappear where I want to ya know",
      "created_utc": 1729340965.0,
      "score": 2
    },
    {
      "id": "lsqm26e",
      "body": "*uncomfortable laugh*",
      "created_utc": 1729369735.0,
      "score": 11
    },
    {
      "id": "lslamkd",
      "body": "Black ppl in Asian countries have this happen, all the time, and you can’t get mad or show your irritation cuz then they will say “all black ppl are…blah blah blah” it’s like being in a zoo that you can’t get away from, until you leave anyways, and if your famous I can’t imagine, probably feels like your trapped and can’t get away and feeling guilty that you even want to escape when most would kill for what you have. I can’t imagine the pain of it.",
      "created_utc": 1729286553.0,
      "score": 216
    },
    {
      "id": "lslq1fk",
      "body": "This has happened to me in Korea many times.",
      "created_utc": 1729292114.0,
      "score": 30
    },
    {
      "id": "lsmqklw",
      "body": "lol.. same thing happened to me in Korea. Had some older ladies stalk me and want a selfie.. they were about 4’11” and I am 6’8”. I felt like I was an absolute giant over there.",
      "created_utc": 1729306827.0,
      "score": 8
    },
    {
      "id": "lsmnr5u",
      "body": "A friend of mine, back when she still had a beard and whatnot, visited Japan, and she was propositioned *multiple* times by multiple women.  She doesn't even look that unusual by American standards!",
      "created_utc": 1729305615.0,
      "score": 5
    },
    {
      "id": "lsp27w2",
      "body": "Exactly my experience in India.. I have in-laws there but have never wanted to return. I feel bad that my husband hasn’t seen his grandma again since then but I’ve not been keen to return. Especially, with more young children. I haven’t stopped him going back himself but he doesn’t want to go without us..",
      "created_utc": 1729350979.0,
      "score": 5
    },
    {
      "id": "lslamio",
      "body": "This happened to my sister while she was in France too! I think they assumed she was a rockstar because she's covered in tattoos and piercings, and her hair is dyed wacky colors all the time haha and people trying to take selfies with her or snapping candids of her just set off a domino effect of other people not wanting to 'miss out' on a potentially famous person even though they had no idea who the heck she was. They were probably all so bummed when they found out she was just a nobody masshole from a tiny town in east bum",
      "created_utc": 1729286553.0,
      "score": 67
    },
    {
      "id": "lslaydo",
      "body": "It’s the hair. That happened to me in Thailand, they all wanted to touch my hair.",
      "created_utc": 1729286667.0,
      "score": 39
    },
    {
      "id": "lskvoqg",
      "body": "I’m having flashbacks to Jedi Jesus lol",
      "created_utc": 1729281576.0,
      "score": 2
    },
    {
      "id": "lsozkl1",
      "body": "Kurt Cobain",
      "created_utc": 1729350064.0,
      "score": 3
    },
    {
      "id": "lsnmyct",
      "body": "\n\nDamn, this is so eloquent- it's almost poetic. You certainly have a way with words. I especially love and resonate with, \"I don’t know how you’d reconcile being so big and so empty at the same time, trying to be a real person when you’re also so tied to this giant caricature balloon that everyone else sees.\"",
      "created_utc": 1729325586.0,
      "score": 12
    },
    {
      "id": "m4d8d99",
      "body": "You explained this very well. Great job.",
      "created_utc": 1735487366.0,
      "score": 2
    },
    {
      "id": "lsn0ae5",
      "body": "I will say it's pretty awesome!",
      "created_utc": 1729311376.0,
      "score": 4
    },
    {
      "id": "lskerje",
      "body": "I knew a girl in HS who claimed to have dated the son of one of the members of Green Day, she had no idea who his dad was until they'd broken up.",
      "created_utc": 1729276076.0,
      "score": 123
    },
    {
      "id": "lsmjl8z",
      "body": "Aspen used to be like that.  Berkeley is.",
      "created_utc": 1729303839.0,
      "score": 3
    },
    {
      "id": "lsiuwfs",
      "body": "Not as big as a deal but I've done this with Jontron and that tik took girl who does swirly paintings as home decor and then got mad at everyone for copying her even though she sold wallpaper that was well....designed by her. \n\nJontron was at Chipotle and parked next to me and it didn't register until he was pulling away, and the other girl I just was aggravated at because I kept seeing her at every thrift store and she would buy the whole place out I assume for video content. But it was wicked annoying. Took me almost 3 weeks of thrift store war to figure it out.",
      "created_utc": 1729257972.0,
      "score": 69
    },
    {
      "id": "lsj44d1",
      "body": "I didn't even watch his show and this is the first time I have heard of his name. I would just smile, nod and then go on my way.",
      "created_utc": 1729261227.0,
      "score": 17
    },
    {
      "id": "lsj3m9d",
      "body": "Same here walked right past Criss Angel, didn’t say one thing to him",
      "created_utc": 1729261059.0,
      "score": 10
    },
    {
      "id": "lsmklzj",
      "body": "Did you check your pockets after y'all ran into each other?",
      "created_utc": 1729304271.0,
      "score": 5
    },
    {
      "id": "lso429g",
      "body": "My husband and I went to see our favourite band last year in London, sitting outside the pub having a pre drink, we spotted two of the band members walk out the side entrance and got jumped on by some fans doing the same as us, husband asked if I wanted to go say hello, but I felt really uncomfortable. They had less than an hour before the show, one had a bloody Boots pharmacy bag in one hand, it felt really impolite, we turned away from them so they had less people staring..it felt so weird",
      "created_utc": 1729336700.0,
      "score": 3
    },
    {
      "id": "lskmh7s",
      "body": "Just meaning I would recognize them",
      "created_utc": 1729278580.0,
      "score": 18
    },
    {
      "id": "lsort6o",
      "body": "Lol just vibrating like a chihuahua",
      "created_utc": 1729347309.0,
      "score": 5
    },
    {
      "id": "lskbpdb",
      "body": "wow how long ago was that!",
      "created_utc": 1729275090.0,
      "score": 2
    },
    {
      "id": "lsikges",
      "body": "I usually listen through discover weekly and release radar on Spotif each Monday. It gives a bunch of relevant recommendations to add to the lists. If one wants such a thing.",
      "created_utc": 1729253812.0,
      "score": 12
    },
    {
      "id": "lskzpg6",
      "body": "He means Randy Marsh.",
      "created_utc": 1729282894.0,
      "score": 14
    },
    {
      "id": "lskzguy",
      "body": "Rick Moranis quit to be there for his kids after his wife died.",
      "created_utc": 1729282814.0,
      "score": 5
    },
    {
      "id": "lt0sjun",
      "body": "This made me laugh, like really laugh and I am grateful because I really needed it. Thank you!",
      "created_utc": 1729525676.0,
      "score": 2
    },
    {
      "id": "lsn6y0k",
      "body": "Sigh. I just want to eat my dinner in peace.",
      "created_utc": 1729315027.0,
      "score": 13
    },
    {
      "id": "lsokp6d",
      "body": "What does the comment say?",
      "created_utc": 1729344516.0,
      "score": 2
    },
    {
      "id": "lslx13z",
      "body": "Their username on their profile is J, so I’m guessing maybe Joji. That kind tracks a little with the history too.",
      "created_utc": 1729294766.0,
      "score": 21
    },
    {
      "id": "lsl9kuf",
      "body": "That would be awesome if it was the case. Unfortunately, the OP said he or she has been out of the spotlight for two years. JM had been touring with the DEAD as of late, so probably not the case, sadly.",
      "created_utc": 1729286193.0,
      "score": 13
    },
    {
      "id": "lsjaohi",
      "body": "I'm a football playing king in space.",
      "created_utc": 1729263371.0,
      "score": 100
    },
    {
      "id": "lsjqz0p",
      "body": "I am a god. Trust me.",
      "created_utc": 1729268549.0,
      "score": 11
    },
    {
      "id": "lsj8pp8",
      "body": "It’s Britney, bish",
      "created_utc": 1729262740.0,
      "score": 62
    },
    {
      "id": "lsjl6yx",
      "body": "LEAVE BRITNEY ALONE!!!",
      "created_utc": 1729266712.0,
      "score": 28
    },
    {
      "id": "lslnj1z",
      "body": "In which case ‘thank you beyonce’ 👀",
      "created_utc": 1729291174.0,
      "score": 4
    },
    {
      "id": "lsjw3ar",
      "body": "Dare I say... Justin Bieber??",
      "created_utc": 1729270162.0,
      "score": 20
    },
    {
      "id": "lsj1x9c",
      "body": "Jessie J? 😍",
      "created_utc": 1729260482.0,
      "score": 7
    },
    {
      "id": "lssocjh",
      "body": "IN A CASTLE. Hells ya.",
      "created_utc": 1729398580.0,
      "score": 2
    },
    {
      "id": "lskks76",
      "body": "She sailed away on the Orinoco flow",
      "created_utc": 1729278026.0,
      "score": 36
    },
    {
      "id": "lsk7qt4",
      "body": "How would you know...? 🤔",
      "created_utc": 1729273823.0,
      "score": 4
    },
    {
      "id": "lsqnljs",
      "body": "Very mildly. I'm not sure if I'm remembering the right psychopath or not but didn't he play her album and then kill himself on the last song?\n\n\n\nYep. Looked it up.  Same guy.",
      "created_utc": 1729370261.0,
      "score": 3
    },
    {
      "id": "lslfxlp",
      "body": "I used to live in Glasgow and I would see very famous actors in my local shops etc. Household names for sure, acted in some of the most successful movies ever, but nobody bothered them. However if OP is at the kind of mega star level of having rabid fans who camp outside of hotels etc, that might be a different story even in Scotland.",
      "created_utc": 1729288399.0,
      "score": 7
    },
    {
      "id": "lske2au",
      "body": "Chappell would post with her full chest",
      "created_utc": 1729275853.0,
      "score": 39
    },
    {
      "id": "lslxmxy",
      "body": "I had to Google who that was. First I thought you were talking about Dave. He dipped out when it got too much for him.",
      "created_utc": 1729295003.0,
      "score": 3
    },
    {
      "id": "lslintb",
      "body": "I'm sorry for anyone who is demonized or lumped into categories for trying to maintain their autonomy. I met up with a Black friend while in Korea and I definitely saw firsthand what you speak of.",
      "created_utc": 1729289387.0,
      "score": 72
    },
    {
      "id": "lspuj0q",
      "body": "I studied a semester in China with a bunch of African students and they related stories like this. Sounds exhausting. At least in a big city I  wasn’t  a huge novelty like the black guys were.",
      "created_utc": 1729360458.0,
      "score": 3
    },
    {
      "id": "lslips5",
      "body": "That makes sense. Although my hair was more strawberry blonde at that point but whatevs. lol",
      "created_utc": 1729289408.0,
      "score": 3
    },
    {
      "id": "lsozte1",
      "body": "Aw man, yeah. It’s unfortunately not an uncommon occurrence and it’s such a tragedy. They give so much to their fans and help so many of us through issues all the while suffering.\n\nThis happens in other industries too. Robin Williams is the obvious first to come to mind.",
      "created_utc": 1729350147.0,
      "score": 3
    },
    {
      "id": "lsn0lgh",
      "body": "It's so freaking peaceful out there. Just the sound of water from the river and no sirens and just absolutely peaceful. Tons of wildlife.  Even my dog is so much happier out there. I cook my own food and don't go out in public but do go out in nature a ton. I just got back to metro area and immediately caught covid on my return. I'm already wishing I stayed there but will be returning soon.",
      "created_utc": 1729311536.0,
      "score": 5
    },
    {
      "id": "lsl2j9x",
      "body": "The members of Green Day live in the Oakland hills and Piedmont (Billie Joe lives in Piedmont). Houses there are all well over $1 million for even a starter home.",
      "created_utc": 1729283822.0,
      "score": 32
    },
    {
      "id": "lsnb251",
      "body": "Green Day are old enough to have kids in HS? Fuck me, I'm old and constantly forget until something like this comes up to remind me.",
      "created_utc": 1729317524.0,
      "score": 6
    },
    {
      "id": "lsl4la3",
      "body": "I normally don’t recognize anyone. The one I did was in Aspen. Mike Douglas. Ate at the table next to me. Smiled and left him alone, as did the others in the restaurant.",
      "created_utc": 1729284502.0,
      "score": 2
    },
    {
      "id": "lsm3sqy",
      "body": "A long 20-something years ago.",
      "created_utc": 1729297407.0,
      "score": 2
    },
    {
      "id": "lsj8yy1",
      "body": "I love the discover weekly playlists. found a lot of great songs that way",
      "created_utc": 1729262823.0,
      "score": 2
    },
    {
      "id": "lsn8ia9",
      "body": "Omg, letmbleed replied to me! I can't wait to show this screenshot to my grandkids someday!",
      "created_utc": 1729315950.0,
      "score": 15
    },
    {
      "id": "lsmzkrr",
      "body": "Could be a red herring. It's right in the center of the keyboard. Whole thing could be fake.",
      "created_utc": 1729311010.0,
      "score": 15
    },
    {
      "id": "lsmzyak",
      "body": "My first thought was Justin Bieber, haven't really heard anything about him in a while",
      "created_utc": 1729311202.0,
      "score": 10
    },
    {
      "id": "lsjd1qm",
      "body": "This comment better blow up, best spongebob reference I've heard in a while",
      "created_utc": 1729264128.0,
      "score": 34
    },
    {
      "id": "lsn8bom",
      "body": "…. With a mustache. I love SpongeBob",
      "created_utc": 1729315841.0,
      "score": 3
    },
    {
      "id": "lsmdiqd",
      "body": "Now that is a coincidence because I, too, am a god.",
      "created_utc": 1729301318.0,
      "score": 2
    },
    {
      "id": "lskdpc9",
      "body": "We collectively will ignore Justin just because he asked us to at this point. Poor dude went through too much.",
      "created_utc": 1729275738.0,
      "score": 9
    },
    {
      "id": "lsxdfur",
      "body": "Seriously!!",
      "created_utc": 1729468345.0,
      "score": 2
    },
    {
      "id": "lskhlhd",
      "body": "Sometimes staying at home in my small flat for the Sunday feels lonely, so I can just imagine.",
      "created_utc": 1729276996.0,
      "score": 13
    },
    {
      "id": "lsl42tu",
      "body": "Houses in Hayward, Fremont, and the greater Bay Area also run a million easy, out here is crazy high COL.",
      "created_utc": 1729284332.0,
      "score": 26
    },
    {
      "id": "lsoj9vk",
      "body": "I’m gonna break some news too. Joey Armstrong, Billie Joe’s son, is/was in a band called SWMRS and was accused of sexual abuse by a member of the Regrettes and when he was 22 and she was 16. People were trying to get a statement out of Billie Joe Armstrong so badly but I’m pretty sure they got nothing out of him. It was a whole thing in 2020",
      "created_utc": 1729343918.0,
      "score": 5
    },
    {
      "id": "lsm4c7n",
      "body": "I remember being on there all the time on my dad's computer, prior to the Metallica thing.  Maybe around 97 or so!  Surprised it lasted so long afterwards.",
      "created_utc": 1729297618.0,
      "score": 3
    },
    {
      "id": "lsn2y8w",
      "body": "Could be. Guess we'll never know. Whoever it is, if it is real, I hope they find peace.",
      "created_utc": 1729312783.0,
      "score": 5
    },
    {
      "id": "lspec9o",
      "body": "As a former Bieber fan, he does not type this way lol",
      "created_utc": 1729355135.0,
      "score": 2
    },
    {
      "id": "lsjou63",
      "body": "Best I can do is one updoot",
      "created_utc": 1729267859.0,
      "score": 12
    },
    {
      "id": "lsnx3l6",
      "body": "Their comment was the best setup for it. 🙂",
      "created_utc": 1729332515.0,
      "score": 2
    },
    {
      "id": "lsnkqen",
      "body": "I happened to have 1 Metallica song in my downloads and I was included in the Napster ban. I'm still salty about that lol",
      "created_utc": 1729324024.0,
      "score": 3
    },
    {
      "id": "lskd1bc",
      "body": "And i shall give one upsploot",
      "created_utc": 1729275522.0,
      "score": 9
    }
  ]
}