{
  "id": "1it4n6y",
  "title": "Stopped a rape last night",
  "selftext": "I went to a deli around midnight last night for food. I see this really young girl (she’s maybe 21 or 22) who is incredibly intoxicated. She can’t even stand up. I look over and I see this creepy delivery guy, who is in his late 50s or 60s, literally telling her “let me take you somewhere to feel better.” He keeps trying to give her something she does not want. I’m too far away to see what it is. Moments later, he sits her down in a chair and is clearly trying to coax her into leaving with him. I call the police and they claim they’ll be there soon. 10 minutes pass and no one arrives.\n\nI go outside, and all of a sudden, I see this guy HOLDING HER UP and dragging her through the streets of New York. He is aggressively making out with her and she has no idea where she is.\n\nI called the police again to no avail. I follow them and finally, the guy gets to his apartment and I had to intervene. I asked him if he knows this girl. He gets startled and backs away. She grabs me for a drunk hug. The guy panics and says he is the police, then changes his story to that’s his sister. He reaches in his pocket to make it seem like he had a badge or gun. I completely ignore it because adrenaline had taken over at this point. I wasn't going to let this POS intimidate me. I asked the girl if she knew this dude or if she knew where she was, and she says no, they were going to have a “fun time.” I then asked her if she wanted that and she told me no, she just wanted to go home. I snatched the girl’s stuff from his hands and we walk away. The loser pulls out his phone to record us. I suspect he was going to flip and say I was the one harming her.\n\nWe go into a bodega down the street to kill time. She is a mess — crying and saying she wants to call her dog to pick her up. The bodega owner steps in to keep her calm. That’s how drunk she was. A small crowd gathers inside the store because no one knows what’s going on. Luckily, a bystander intervened because he saw the fucking loser STILL lurking outside waiting for her to leave. This idiot finally comes in the store and acts as if he knows her. The police show up (after 20 - 30 minutes) and questions him. He can’t keep track of his lies, so they kick him out and warn him to stay away from her. The police eventually orders her an Uber from her phone to send her home.\n\nI am a little shaken up by it. I know it’s 2025, but I cannot believe this guy was going to sexually assault this girl if I had not intervened. The one thing that still bothers me were the cops telling me afterwards that it was no big deal because people get drunk all the time in the city. Yet they thanked me anyway. No, this was going to be rape. Blatant rape.\n\nI feel like I fucked up because this guy has footage of me and I don’t have footage of him. I don’t know. I guess I’m venting at this point. I feel like this should not be traumatic for me in any way, but I’ve been thinking about it ever since. So fucked up, man.\n\nEdit: Thank you everyone for the kind words. It truly means a lot.",
  "created_utc": 1739969162.0,
  "score": 8229,
  "num_comments": 350,
  "url": "https://www.reddit.com/r/offmychest/comments/1it4n6y/stopped_a_rape_last_night/",
  "comments": [
    {
      "id": "mdmkadm",
      "body": "Good work!  Have a story from my late aunt who was a very butch dyke.  She was getting gas in the middle of nowhere and nobody was at the cash register - she start looking around finds someone trying to rape the cashier in the back - she proceeds to grab the guy off her and stomp his dick repeatedly.  He was prob bigger than her but the shock and pain was too much - she kept stomping him while the cashier called the cops.\n\n\nCops came and the rapist literally ran towards them saying get this lady away from me - they had to hold my aunt back she kept wanting to obliterate his manhood.\n\n\nI often think about her in this vein. Just a great lady with awesome empathy and compassion - she was the best.  Hope you're resting wherever you are Linda.",
      "created_utc": 1739978558.0,
      "score": 1843
    },
    {
      "id": "mdlw9de",
      "body": "If it makes you feel better, depending on how worried you are - he might have footage of you walking away with the victim (jfc thank you....) but now you know where he lives. You say he's a delivery driver, for who? You might be able to find out where he works. JS. But again, good work.",
      "created_utc": 1739970577.0,
      "score": 2832
    },
    {
      "id": "mdltws5",
      "body": "Wow this is so scary, I really appreciate you for stepping in and helping her She’ll forever be grateful for this and I am grateful on her behalf. It’s just so sick that there are still people like this and it doesn’t seem to be changing any time soon.",
      "created_utc": 1739969674.0,
      "score": 1693
    },
    {
      "id": "mdm9hsp",
      "body": "Bro.  As someone who drunkenly got assaulted by two men \"trying to help me\", thank you.  My \"best friend\" at the time let me walk home one drunken night and these two men took advantage of that. You stopped that for that girl.  Wish I could give you a big hug of gratitude on her behalf.  We need more people like you",
      "created_utc": 1739975200.0,
      "score": 897
    },
    {
      "id": "mdmbfn6",
      "body": "Why did the police order her an Uber rather than drive her home themselves? Great work though man you’ll be fine",
      "created_utc": 1739975827.0,
      "score": 303
    },
    {
      "id": "mdlwc35",
      "body": "Thank you for doing that. You saved her from more trauma. The officers seem to be useless... She was lucky to have someone like you around.",
      "created_utc": 1739970607.0,
      "score": 391
    },
    {
      "id": "mdlv9ge",
      "body": "Omg that’s so scary. You’re so brave for intervening. Thank you, and hope you’re ok!!! ❤️🙏",
      "created_utc": 1739970197.0,
      "score": 150
    },
    {
      "id": "mdmc5vi",
      "body": "It is a traumatic experience, you saw the worst of human nature and it might have even have been worse than a rape, he might have killed her, I work in criminal defense, it happens! Truly you are a Hero and I mean that, you saved that young woman the ruination of her life, and possibly her life. \n\nYou were her Hero and Guardian Angel that night and believe me if her family and friends knew what had happened you'd be showered with intense love and thanks. So let me express it for them, as they will never know. 🕊👑\n\nThe police perhaps are blase and seem to have underreacted as they see everyday the heinous aftermaths of what you so incredibly prevented, so anything under that level doesn't garner their attention, to survive. Believe me they do know what could have happened, but because you intervened, they didn't have to deal with yet another horrible crime scene but certainly will in another place, another day, every day.  \n\nBless you a million times, you forever have changed her life for the better. Now, you need to take care of yourself, indeed you are shaken up, because indeed it was traumatic, your flight or fight, adrenaline was in full force (and you think brilliantly and bravely under intense stress!) and you were under threat as well, it was a genuine emergency, you both witnessed and prevented a crime, yes, you are going to feel things afterward and might need to talk to a professional to process your feelings but at a minimum allow yourself to have them and don't let them hurt your life, your feelings now are entirely appropriate and normal and expected considering what you just experienced, take care of yourself. \n\nMuch respect, admiration, appreciation and best wishes to you Hero! 👑",
      "created_utc": 1739976057.0,
      "score": 135
    },
    {
      "id": "mdlxkfs",
      "body": "Everything aside what matters is you saved that girl from a traumatic experience, thank you dude. You're a hero",
      "created_utc": 1739971067.0,
      "score": 115
    },
    {
      "id": "mdmg6uc",
      "body": "People who are roofied act the same way as people who are extremely drunk. This is why a lot of roofied people get treated really shitty and not taken seriously. I've seen it happen to a friend who had one drink at a party, then we left to get pizza. At the pizza place she was fucked, like she had drank a quart of straight liquor. \n\nThank God you were there for that girl and actually interviened. The police did not seem to care or take her seriously, as well as taking so long to respond that if you hadn't interviened that girl would not have gotten the help she needed.\n\nOr even if she hadn't gotten assaulted, the police might've thrown her in the drunk tank like they did to me when I was roofied. My university was a big party school with a significant rape culture, so most of us girls at that school were roofied and/or assaulted at least one or two time when we were undergrads ages 17-22. That was 12 years ago but I can't imagine that it would be much different now. This issue is so widespread I don't know if I know any women who have not experienced sexual assault. \n\nI don't know how aware of the scope of this issue that most men are, but it's definitely good for men to know this. And for men to understand what the effects of roofies look like & to always keep their hands covering their drinks and never let their drinks out of their sight for a second because men can be victimized too, and because men and boys in undergrad might not be aware that they might need to be careful too because they can be victims too.",
      "created_utc": 1739977326.0,
      "score": 111
    },
    {
      "id": "mdm06lj",
      "body": "Your a hero and brave. He was definitely going to rape her and who knows what else he could have done to her if you didn’t step in!! Thank you OP I wish there was more people like you in this sad world",
      "created_utc": 1739972029.0,
      "score": 80
    },
    {
      "id": "mdm4o8c",
      "body": "You don’t have footage of him, but you know where he lives. That’s probably worse.",
      "created_utc": 1739973594.0,
      "score": 47
    },
    {
      "id": "mdmynq1",
      "body": "I’m from the #metoo crowd. PLEASE KNOW, you are such a HERO!! You have NO IDEA, what you have done. You have not just stopped a rape, YOU SAVED THAT GIRLS LIFE. Are you listening to me? YOU SAVED THAT GIRLS LIFE. Her LIFE. Because she literally would have been dead without you. Dead on the inside if not actually dead in the future. Every night, for the rest of her life, for the first few minutes in the dark as she falls asleep that would be what she lived. You are a HERO.",
      "created_utc": 1739982584.0,
      "score": 49
    },
    {
      "id": "mdm47xf",
      "body": "Most people would’ve just walked away and ignored the situation. You should be very proud of yourself for actually getting involved.",
      "created_utc": 1739973439.0,
      "score": 40
    },
    {
      "id": "mdmh4zl",
      "body": "Can't count how many drunk people I have put in an Uber just to get them away from creepers.  \nOur local pub recently set up a general \"bar\" account for this specific purpose.  \nWelcome to the Club, dude!  \nWe are glad to meet you and so is she.  \nEven if she never realizes it.",
      "created_utc": 1739977621.0,
      "score": 42
    },
    {
      "id": "mdlygx6",
      "body": "You’re a good and selfless human to put yourself in harm’s way like that. Good job!",
      "created_utc": 1739971402.0,
      "score": 31
    },
    {
      "id": "mdm4lwp",
      "body": "Thank you for not keeping silent. This is how we stop evil.",
      "created_utc": 1739973572.0,
      "score": 29
    },
    {
      "id": "mdmf2m1",
      "body": "no man you did not fuck up… You saved her… You are a hero!!",
      "created_utc": 1739976976.0,
      "score": 22
    },
    {
      "id": "mdlzbb8",
      "body": "Thank you for doing that",
      "created_utc": 1739971712.0,
      "score": 18
    },
    {
      "id": "mdma1q1",
      "body": "Good men step in xxx",
      "created_utc": 1739975380.0,
      "score": 18
    },
    {
      "id": "mdmcv70",
      "body": "1. It makes sense that this would be traumatizing for you\n2. You probably don’t need to worry about footage. He probably won’t do anything with it. If he does, there is also footage of you in the bodega and the police can identify you as the hero\n3. Thank you for intervening",
      "created_utc": 1739976280.0,
      "score": 18
    },
    {
      "id": "mdmnmcu",
      "body": "Ask the bodega owner if he has CCTV of the guy? Tell him you’re worried and you’d feel better if you had him on camera?",
      "created_utc": 1739979517.0,
      "score": 16
    },
    {
      "id": "mdqije1",
      "body": "As a victim of sexual assault, thank you for being there for this woman and keeping her safe. Our imagination can predict what this scumbag was going to do to her.  You have saved her from a lifetime of horrific dreams and feelings.   You’ve saved her from the awful insecurities that result from these vile actions.  Hopefully she will cut back on her drinking to keep herself out of these situations.   You are a genuine hero!",
      "created_utc": 1740019433.0,
      "score": 16
    },
    {
      "id": "mdo2tr8",
      "body": "You saved a chemically incapacitated young woman from being assaulted. You stood up for a stranger in crisis. You focused on her safety. \n\nThat’s hero behavior, sir. You are her hero. Whether she knows it or not. A+.",
      "created_utc": 1739993363.0,
      "score": 14
    },
    {
      "id": "mdn7kxs",
      "body": "as a victim of SA — I cannot thank you enough for keeping her safe. Not everyone has the guts to intervene after police didn't show up.",
      "created_utc": 1739984994.0,
      "score": 13
    },
    {
      "id": "mdohj1l",
      "body": "He has footage. You have his address.",
      "created_utc": 1739997291.0,
      "score": 10
    },
    {
      "id": "mdmirw7",
      "body": "This is why women chose the bear. 🐻\n\nThank you for being one of the good one. ❤️",
      "created_utc": 1739978114.0,
      "score": 40
    },
    {
      "id": "mdmfgh4",
      "body": "You saw something and said something with a stranger. I had literal friends see what was happening to me and did nothing. \nI'm crying. Thank you for being good and taking care of her. I don't know you, but I'm so incredibly proud of you for keeping her safe. It's healing to know someone out there is a better choice than the bear.",
      "created_utc": 1739977097.0,
      "score": 11
    },
    {
      "id": "mdm2956",
      "body": "This makes me sick",
      "created_utc": 1739972762.0,
      "score": 9
    },
    {
      "id": "mdma6sz",
      "body": "Not all heros wear capes.\nLeast you know where the sleeze ball lives. Maybe you could go stomp a mud hole in his ass some Sunday and then go out for brunch.",
      "created_utc": 1739975427.0,
      "score": 7
    },
    {
      "id": "mdnjzg9",
      "body": "I was once a drunk 20-something with questionable decision making skills. On behalf of women everywhere, thank you for your vigilance and concern.",
      "created_utc": 1739988316.0,
      "score": 7
    },
    {
      "id": "mdmec82",
      "body": "And he thought you'd be cool with it. Like he was blatant about it in front of you at first, until he realized you weren't ok with it. BC that's how abusers have gotten away with shit forever.",
      "created_utc": 1739976745.0,
      "score": 6
    },
    {
      "id": "mdmzbgq",
      "body": "U are a hero my friend. \n\nA damn good one. Thank u for standing up to sickos and doing the right thing.",
      "created_utc": 1739982765.0,
      "score": 6
    },
    {
      "id": "mdnjqzv",
      "body": "On behalf of drunk girls all over the world, thank you. It was me once and no one saved me, you did the right thing. Thank you.",
      "created_utc": 1739988252.0,
      "score": 5
    },
    {
      "id": "mdohoqy",
      "body": "As someone from dealing with the fall out from a sexual assault, I cannot thank you enough for helping her. While I can only imagine even this will be a traumatic memorial when she sobers up, the kindness of a stranger here made an insane difference in her life. You changed her life. Period. I am not overstating anything here, preventing that kind of trauma is life changing. Thank you for the reminder that there are still kind people in the world.",
      "created_utc": 1739997332.0,
      "score": 6
    },
    {
      "id": "mdonhqz",
      "body": "I might have saved one of my best friends from something similar on her 21st birthday.  I was the only male there that wasn’t drunk and trying to get her to go home with them.  I told them “she’s done, we’re going back to her place” and took her along with her girl friends back to her place.  Her friends thanked me so much for standing up for her, I could tell they were worried - all of the guys were big guys, and I am not.  Was pretty sure I was going to get my ass kicked, but I was young and didn’t care.  Maybe her friends would have stuck up for her, in fact they probably would have (I don’t want to give myself too much credit I suppose), but I’m glad I proved to myself if anything that I could do the right thing in a bad situation.\n\nI don’t think I would have been courageous enough to do what you did by myself though, OP.  Huge props to you.",
      "created_utc": 1739998865.0,
      "score": 6
    },
    {
      "id": "mdplg6u",
      "body": "Me and my husband are always hawkeyed about “men trying to help drunk women”. It’s something you can peg when you have experience. Thankfully he’s wide and tall and can usually very quickly scare off a creep",
      "created_utc": 1740008546.0,
      "score": 7
    },
    {
      "id": "mdps5t2",
      "body": "In the name of all the women, thank you. We need more people like you",
      "created_utc": 1740010664.0,
      "score": 6
    },
    {
      "id": "mdq2746",
      "body": "If only I’d run into you on my many too-drunken nights “letting” men do stupid things to me in my 20s… you did the right thing. The police have your report, not his, so you’re in the clear. Police in general do not care about the safety of drunk women. If anything they’ll take advantage. You are a good person. It is rare to find that. Please don’t ever change or allow anyone to try to change you.",
      "created_utc": 1740013890.0,
      "score": 7
    },
    {
      "id": "mdmd9ub",
      "body": "Shout out to OP. You’re a hero. I don’t think you know how many people would’ve kept it moving in a situation like this. A truly commendable act.",
      "created_utc": 1739976411.0,
      "score": 7
    },
    {
      "id": "mdmgk6r",
      "body": "Can the police search the house or they need a warrant? What if he is a serial killer? What if he does this often? If he had the audacity to wait and lie to the police, it means that he had done it before 😞",
      "created_utc": 1739977443.0,
      "score": 6
    },
    {
      "id": "mdn2a1t",
      "body": "Even if he tried to do something with the footage. You have a police call on file and officers who saw you help her. The deli should have camera footage and there were bystanders. The guy even got caught in lies to the police. You should be fine.",
      "created_utc": 1739983566.0,
      "score": 5
    },
    {
      "id": "mdo2pt4",
      "body": "Thank you. \n\nYou were aware, you took action, and you stood by your convictions. For many reasons, lots of people fail at one or more of these things. You may not feel like a hero, because in your mind you “only” did what was right. But you are a hero to that young woman, and to many women who think this should be the norm. \n\nSee something. Say something. Do something.",
      "created_utc": 1739993335.0,
      "score": 6
    },
    {
      "id": "mdo7y55",
      "body": "That sounds really scary, you’re really brave and this Reddit stranger is very proud of you.! Thank you for stopping him and standing up for her. I’m sure she genuinely appreciates you (if she remembers lol)",
      "created_utc": 1739994736.0,
      "score": 7
    },
    {
      "id": "mdoltg6",
      "body": "From someone who was raped while I had been drinking, thank you. I wish someone was brave enough to stop what happened or to stop and see this girl is not okay. You did a really good thing here❤️",
      "created_utc": 1739998425.0,
      "score": 7
    },
    {
      "id": "mdqsh4c",
      "body": "God damn. You’re a hero, full stop. And a very brave one at that. You should be forever proud of yourself for this. You could have fucked up a shit ton of stuff in your life up until this point or sometime later in the future. No matter what, you did this great thing here. Own it. Take pride in it. Don’t ever let anyone take it away from you. You are a great person. That being said, take some time to process your thoughts and feelings. Don’t ignore them completely. Because you do need to process this. Just know that you didn’t do anything wrong or fuck up in anyway. Quite the contrary actually. Just don’t let this traumatic experience—and yes, it was also traumatic for you—mess with your life. That’s what the processing is for. As great as internet stranger can be, please find someone close to you who you can share this with. If you have the dough/insurance, I’d consider finding a therapist in your local community who you can see and talk this through if you feel that would be something you’d like and benefit from.\n\nYou won’t get the recognition for this from people in your life. At least not nearly enough. The girl you saved is someone you probably will never get to know and so her gratitude most likely will not be expressed to you after what happened happened. But you should absolutely take away from this experience a new, ironclad boost in self-esteem within yourself. It is more than deserved tenfold. The hypothetical (and highly suspect) idea that plenty of other people could, or even would, do what you did in the same exact situation does not diminish the greatness and admiralty of your actions. It’s the fact that you DID THEM, the positive impact those actions had, and the fact that you did all this in spite of the **ridiculous** amount of unknown risk inherent to the situation—these are the only things that matters. You should be immensely proud. You may not feel it now. You may feel more stressed or angry or whatever myriad of negative emotions. It’s all understandable. But you should in time feel immensely proud of yourself and good about what you did and the person you revealed yourself to be when it counted most, when you were forced to act on your own instincts. As important and understandable as it is to feel and process the negative emotions stemming from this event, you should absolutely take the time to intentionally let yourself feel the positive emotions from it as well.",
      "created_utc": 1740022978.0,
      "score": 7
    },
    {
      "id": "mdmoyez",
      "body": "Any situation like this would be traumatic. Try to remember this: you helped someone who couldn’t help them selves.  You did the right thing, and there are people out there that wouldn’t have stepped in.  That girl would’ve had trauma forever— had you not intervened. Thank you.",
      "created_utc": 1739979896.0,
      "score": 5
    },
    {
      "id": "mdmro1v",
      "body": "As a woman, thank you.",
      "created_utc": 1739980651.0,
      "score": 5
    },
    {
      "id": "mdmsxit",
      "body": "You’re a hero",
      "created_utc": 1739981002.0,
      "score": 5
    },
    {
      "id": "mdmw6zm",
      "body": "Thank you so much for stepping in for that girl. We need good people to be good people and take action when they see things like this. There may be cameras from shops in the area that caught him walking with her and you following. Most likely nothing will come of it unless that guy tries to press some kind of charges on you, but that's unlikely. This is a sad state of affairs but happens DAILY even in 2025. Thank you again for doing something!!",
      "created_utc": 1739981908.0,
      "score": 4
    },
    {
      "id": "mdmw74s",
      "body": "Thank you so much for helping her. Lord only knows what would have happened if you hadn't stepped up. She could have been raped, murdered...who knows?!?!",
      "created_utc": 1739981909.0,
      "score": 5
    },
    {
      "id": "mdmw91t",
      "body": "You’re a hero!",
      "created_utc": 1739981924.0,
      "score": 6
    },
    {
      "id": "mdn3rmb",
      "body": "Please accept a thank you from the bottom of my heart. You not only stopped a rape and possibly something else, you stopped her from having to live a life with a SA on her mind all the time.",
      "created_utc": 1739983968.0,
      "score": 5
    },
    {
      "id": "mdn4i9k",
      "body": "Thank you ❤️ as a mom, a daughter, a sister, a woman. Thank you. ❤️",
      "created_utc": 1739984166.0,
      "score": 4
    },
    {
      "id": "mdoafcr",
      "body": "WTAF? I mean, creepy dude aside - the police ordered her an Uber? How the hell do they know she got home safe? If that were here in Scotland the police would have brought her for a welfare check and taken her home themselves.\n\nETA - well done for looking out for her! It’s sadly shocking how many people would turn a blind eye to this.",
      "created_utc": 1739995396.0,
      "score": 4
    },
    {
      "id": "mdoc72q",
      "body": "You are a HERO!!! Good job!!",
      "created_utc": 1739995870.0,
      "score": 6
    },
    {
      "id": "mdoktdr",
      "body": "We need more heros like you.",
      "created_utc": 1739998163.0,
      "score": 5
    },
    {
      "id": "mdol2bc",
      "body": "You’re a hero. I would take 20 years off my life right now if I could go back in time and have someone like you to save me from that. Thank you for protecting women <3",
      "created_utc": 1739998229.0,
      "score": 5
    },
    {
      "id": "mdovr6g",
      "body": "You’re a HERO. You saved someone from a lifetime of pain and trauma. Thank you.",
      "created_utc": 1740001069.0,
      "score": 5
    },
    {
      "id": "mdovzvl",
      "body": "You are an amazing human being! Thank you for looking out for someone that was too inebriated to look out for themselves! Wish there more people like you!  🫶🏻",
      "created_utc": 1740001135.0,
      "score": 5
    },
    {
      "id": "mdox4l2",
      "body": "You are amazing! 👏 the world is messed up and people like you make it better - plz don’t change",
      "created_utc": 1740001439.0,
      "score": 5
    },
    {
      "id": "mdptal7",
      "body": "You intervened and your subconscious knew that it was dangerous. You did it anyway. Good for you! Once you calm down and reason through the incident, you'll realize that it wasn't horrible, and you did a good thing. Let that knowledge keep you strong and continue to do good things. Awesome, dude!",
      "created_utc": 1740011017.0,
      "score": 5
    },
    {
      "id": "mdptzyp",
      "body": "You did the right thing.",
      "created_utc": 1740011244.0,
      "score": 5
    },
    {
      "id": "mdpva3f",
      "body": "Where is that award button when I need it!!! Lol you are lucky you are still alive, you just never know!",
      "created_utc": 1740011660.0,
      "score": 5
    },
    {
      "id": "mdpz0i1",
      "body": "As a survivor of date rape, thank you. I wish someone like you would've been there before what happened to me happened :( ",
      "created_utc": 1740012854.0,
      "score": 6
    },
    {
      "id": "mdq5pfo",
      "body": "You’re an amazing person who stepped up to do what’s right when so many others willfully choose to ignore situations like which you found yourself in. Thank you for being a good human being 🫶🏻",
      "created_utc": 1740015056.0,
      "score": 5
    },
    {
      "id": "mdq5w2b",
      "body": "We need more people like you",
      "created_utc": 1740015118.0,
      "score": 5
    },
    {
      "id": "mdqfvlq",
      "body": "You’re truly amazing. I know it must have been scary for you, but think of it this way. Now you understand from experience that rapists are cowards. They prey on the weak and vulnerable, but when confronted, they don’t know what to do and choke. The more people who know that, the more who will intervene just like you did. You might not have just saved her, but by sharing your story, you might inspired others to stand up. \n\nAlso, as a woman who has very fortunately never been SA’d but nearly every woman in my life has, it’s crucial for people to be aware of these situations and to have a plan of action. If it’s a scenario like this with a drunk woman on the street, pull out your phone, yell at the top or your lungs that the police are on their way and your live streaming this right now. Name your location, time of day and describe the rapist. \n\nUnfortunately most cases of SA happen behind closed doors and perpetuated by someone the victim knows that has some kind of power over them (such as family member, husband, teacher, coach, pastor…etc). This can be harder to identify, but there are signs and if you’re close with the person that you suspect something is going on, always check in with them in a safe environment away from the suspected rapist.\n\nThat’s my two cents, I get that many people wouldn’t want to put their own safety on the line, but I really believe rapists are just cowards at heart and are little threat to able bodied and minded people who take the time to confront them.",
      "created_utc": 1740018508.0,
      "score": 6
    },
    {
      "id": "mdqmyos",
      "body": "\"I cannot believe this guy was going to sexually assault this girl if I hadn't intervened\"\n\nI can........ Most women can. Thank-you for being the person the world needs.",
      "created_utc": 1740020989.0,
      "score": 5
    },
    {
      "id": "mdqymku",
      "body": "On behalf of women everywhere, thank you.",
      "created_utc": 1740025347.0,
      "score": 4
    },
    {
      "id": "mdn7689",
      "body": "I commend you for intervening. But I don't get a real warm, fuzzy feeling knowing that the police just ordered her an Uber and sent her on her way. WTF.",
      "created_utc": 1739984884.0,
      "score": 8
    },
    {
      "id": "mdm6nbl",
      "body": "most cases of rape don’t have any footage from the raper, you are not to blame. I’m sure she’s very thankful for what you’ve done.",
      "created_utc": 1739974260.0,
      "score": 4
    },
    {
      "id": "mdm6tgd",
      "body": "Omg thank you..... honestly even in 2025 we still need good people",
      "created_utc": 1739974319.0,
      "score": 6
    },
    {
      "id": "mdmbzs2",
      "body": "Thank you",
      "created_utc": 1739976004.0,
      "score": 3
    },
    {
      "id": "mdmekfe",
      "body": "Well done! You did the right thing 100%. So often even men with bad intentions would be stopped if someone with good intentions stood up to them.",
      "created_utc": 1739976816.0,
      "score": 5
    },
    {
      "id": "mdmkvbi",
      "body": "thank you for stepping in. if you are looking for footage to make you feel better, a lot of stores have security, contact them and get a copy. Do it as soon as possible before the footage is recorded over. Thank you again for what you did!",
      "created_utc": 1739978726.0,
      "score": 3
    },
    {
      "id": "mdmnoeo",
      "body": "The world needs more people like you, thank you for saving that young lady the lifelong trauma",
      "created_utc": 1739979533.0,
      "score": 4
    },
    {
      "id": "mdnf9n0",
      "body": "I wouldn't worry about the footage, it's on record that you called the police and started with her until they arrived and that he's the creep who couldn't get his story straight. Sounds like you did a good thing.",
      "created_utc": 1739987057.0,
      "score": 3
    },
    {
      "id": "mdnggs6",
      "body": "Thank you so much. I was raped and this means so much to me. Thank you so much. May Jesus bless the crap out of you. Thank you for having the courage and insight to see what was going on and fighting for that woman. We need more people like you",
      "created_utc": 1739987379.0,
      "score": 4
    },
    {
      "id": "mdnkx4x",
      "body": "Thank you for helping her. I'm so angry the police did shit all and let him walk away. He should be in prison- he's going to try this again...",
      "created_utc": 1739988567.0,
      "score": 3
    },
    {
      "id": "mdo6fai",
      "body": "cops so lame they can’t even escort a drunk SA victim home anymore?",
      "created_utc": 1739994330.0,
      "score": 5
    },
    {
      "id": "mdo8j8w",
      "body": "YOU ARE AN AWESOME HUMAN! Thank you for standing up for her and doing what was right 💜",
      "created_utc": 1739994891.0,
      "score": 3
    },
    {
      "id": "mdo96ur",
      "body": "You are my hero, don’t give a flying fuck, you are my hero and for sure hers.",
      "created_utc": 1739995066.0,
      "score": 4
    },
    {
      "id": "mdoapai",
      "body": "Thank you.",
      "created_utc": 1739995471.0,
      "score": 5
    },
    {
      "id": "mdoq2yo",
      "body": "Similar story happened when out for a friend’s bachelorette years ago. We were staying at a hotel downtown and heading back to our suite after being out all night. Elevator door opens on our floor, there’s a girl on the floor and a guy trying to get her up to go to his room. Bride-to-be’s sister is an off duty paramedic and sees what’s going on and asks the guy what’s going on. He says it’s just his sister who had too much to drink. They don’t look related to she can’t even sit or stand. Borderline unconscious. Bride’s sister’s brain flicks a switch and she goes into paramedic mode. Calls 911. Cops come. Not a brother. We didn’t watch the whole thing unravel but sister told us that the girl’s stomach would likely need to be pumped and they suspected she was drugged. It was scary.",
      "created_utc": 1739999561.0,
      "score": 5
    },
    {
      "id": "mdozvs0",
      "body": "Thank you for saving her.",
      "created_utc": 1740002183.0,
      "score": 4
    },
    {
      "id": "mdp07iv",
      "body": "Hell yeah dude. Thank you for stepping up and standing up for someone who needed the help. \n\nYou are one of very few who would do that.",
      "created_utc": 1740002270.0,
      "score": 4
    },
    {
      "id": "mdp490n",
      "body": "Thank you thank you thank you!!!!",
      "created_utc": 1740003393.0,
      "score": 4
    },
    {
      "id": "mdpaoz0",
      "body": "This *is* traumatic for you. You also got a huge adrenaline rush to help you deal with this situation and follow a potentially violent man - on your own - because you cared about the welfare of a stranger who was unable to help herself. \n\nPlaying a game like Tetris can help distract your brain and keep it focused on tasks involved the same part of your brain that otherwise take you in directions you don't want to go in.\n\nYou did a good thing. But it is still taking a toll on you. After an adrenaline rush comes the slump and possibly the shakes alongside all those 'what if' thoughts. You may have bad dreams and flashbacks, but know that you did an incredibly brave and selfless thing.",
      "created_utc": 1740005240.0,
      "score": 4
    },
    {
      "id": "mdpc7gc",
      "body": "You are a hero!!! Thank you!",
      "created_utc": 1740005683.0,
      "score": 4
    },
    {
      "id": "mdpfh0w",
      "body": "Thank you so much. Too many of us wish there was a hero like you around when this happened to us",
      "created_utc": 1740006671.0,
      "score": 5
    },
    {
      "id": "mdpkh66",
      "body": "Probably drugged unfortunately. I'm so glad you were there to save her!!!",
      "created_utc": 1740008234.0,
      "score": 4
    },
    {
      "id": "mdpwcgj",
      "body": "Why couldn’t the cops take her home? They should’ve. Even Uber isn’t safe these days especially for a wasted girl by herself?!!!",
      "created_utc": 1740011999.0,
      "score": 4
    },
    {
      "id": "mdpwzu7",
      "body": "This dude is taking advantage of a drunk girl. What an asshole. 😠😠",
      "created_utc": 1740012208.0,
      "score": 4
    },
    {
      "id": "mdpxlmi",
      "body": "Thank you for going above and beyond to keep this girl safe. We need more like you.",
      "created_utc": 1740012401.0,
      "score": 3
    },
    {
      "id": "mdq88g9",
      "body": "I'm once again shocked how cops and others keep releasing predators into the streets. That man should be in jail now, not roaming free.\nI want a world where predators are stopped and punished, not released with a wink 🤢🤮\nAt least there are some decent humans out there",
      "created_utc": 1740015910.0,
      "score": 4
    },
    {
      "id": "mdq8f9a",
      "body": "Thank you for helping her.",
      "created_utc": 1740015973.0,
      "score": 3
    },
    {
      "id": "mdqa19d",
      "body": "Thankyou so much",
      "created_utc": 1740016517.0,
      "score": 5
    },
    {
      "id": "mdqb21r",
      "body": "I had something eerily similar happen to me in college. A couple guys saw him on me in the alley, but when he told them I was his wife (I was clearly drugged and coming in and out of consciousness). The guys believed him and left. It wasn’t their fault but I’ve spent a lot of time wondering how things would’ve gone differently if they had tried to help me. Thank you for being that guy. Truly. You saved her a lot of trauma and self-doubt. You are a good person- people like you are becoming increasingly rare",
      "created_utc": 1740016859.0,
      "score": 4
    },
    {
      "id": "mdqcjv4",
      "body": "I don’t have the right words to express it other than thank you for intervening. The world can be a very scary place. I’m glad this story had a good ending.",
      "created_utc": 1740017367.0,
      "score": 5
    },
    {
      "id": "mdqcyhi",
      "body": "Sir. You did the right thing 👏",
      "created_utc": 1740017507.0,
      "score": 3
    },
    {
      "id": "mdqo6qp",
      "body": "Ty for protecting her. I was physically assaulted while screaming at him to get away the whole time during crowded karaoke in november (not the first assault in my life) so unfortunately im not surprised",
      "created_utc": 1740021425.0,
      "score": 4
    },
    {
      "id": "mdqq2a1",
      "body": "I love you for being  you and daring.",
      "created_utc": 1740022097.0,
      "score": 4
    },
    {
      "id": "mdr014p",
      "body": "What a badass you are. Thank you.",
      "created_utc": 1740025913.0,
      "score": 5
    },
    {
      "id": "mdr4job",
      "body": "Thank you for stepping in. You did as best as you could in that situation. If you had a gut feeling and acted on it. Good on you. Give yourself a pat on the back. \n\nDon't worry about not having a video of the guy. I'm sure there's enough surveillance of the guy in the act in multiple areas. Plus you know where he lives and maybe where he even works. Hopefully, that's enough to scare him away. \n\nThe world needs more people like you. Stay strong.",
      "created_utc": 1740027792.0,
      "score": 3
    },
    {
      "id": "mdv7642",
      "body": "You possibly saved her life. Thank you for stepping in. A lot of others wouldn’t/didnt.",
      "created_utc": 1740083482.0,
      "score": 4
    },
    {
      "id": "mdml7y3",
      "body": "Trust me after a few years ago i realized anything is possible i dont have any expectations for anyone or anything",
      "created_utc": 1739978826.0,
      "score": 3
    },
    {
      "id": "mdmqvb0",
      "body": "Thank you so much. Speaking as someone who was coerced, it's a frightening experience. Having someone to protect you is always very heart warming. I hope you have a good day, and a ton more.",
      "created_utc": 1739980431.0,
      "score": 3
    },
    {
      "id": "mdmr2kj",
      "body": "Thank you so much for being a hero to that girl! You are a good person and I know as a woman, I appreciate that there are good men out there.",
      "created_utc": 1739980487.0,
      "score": 3
    },
    {
      "id": "mdmwaul",
      "body": "This makes me sick to my stomach",
      "created_utc": 1739981938.0,
      "score": 3
    },
    {
      "id": "mdn5x62",
      "body": "Helped her, without asking for anything. There are heroes in real life, well done and be safe. May you be blessed.",
      "created_utc": 1739984545.0,
      "score": 3
    },
    {
      "id": "mdna2ot",
      "body": "You’re a good person",
      "created_utc": 1739985662.0,
      "score": 3
    },
    {
      "id": "mdncqr6",
      "body": "I'm happy to see that there's still good people in this world that helps people. You're a great person",
      "created_utc": 1739986376.0,
      "score": 3
    },
    {
      "id": "mdng5yn",
      "body": "Yeah the fact that the guy so brazenly came back and I try and take her again is insane. Some guys really are twisted af. You did good and sorry you are a bit shaken. ",
      "created_utc": 1739987298.0,
      "score": 3
    },
    {
      "id": "mdnlfcu",
      "body": "You’re an angel. Thank you.",
      "created_utc": 1739988704.0,
      "score": 3
    },
    {
      "id": "mdnn7fg",
      "body": "Thank you for stepping in.",
      "created_utc": 1739989184.0,
      "score": 3
    },
    {
      "id": "mdnpw01",
      "body": "you are a hero! I hope you are okay! what you did was amazing! one of my friends was raped at a party ( I left early that night after dinner and I always wish someone would entered that room or stayed with her)",
      "created_utc": 1739989895.0,
      "score": 3
    },
    {
      "id": "mdnpycu",
      "body": "Thank you for stepping in!!!",
      "created_utc": 1739989913.0,
      "score": 3
    },
    {
      "id": "mdnvt3m",
      "body": "Angel.. For your observation, time, care and compassion... Such a shame that people with such morals and heart are so rare. Thank you for sharing. I hope your okay mate 🙏 thank you for caring. ",
      "created_utc": 1739991480.0,
      "score": 3
    },
    {
      "id": "mdnvy9r",
      "body": "Thank you for doing what you did. We need more men doing what you did",
      "created_utc": 1739991519.0,
      "score": 3
    },
    {
      "id": "mdnwfd7",
      "body": "Kudos to you. Shitty of the police to not even give her a ride, who knows who the uber driver was and what they would have done to “help” her once they arrive at her home.",
      "created_utc": 1739991646.0,
      "score": 3
    },
    {
      "id": "mdo0kgx",
      "body": "You are incredibly brave and awesome!  Most bodegas have cameras, and it's apparent that you were trying to save her, not harm her.  Also, if he was carrying her down the block, a camera somewhere got that on video.  Also, remember, he was on the clock, so he can't use an excuse that this wAs a date.  Also, the bodega owner must have seen the delivery guy before, and it can be confirmed that he wasn't on a date with her.  You did the right thing.",
      "created_utc": 1739992761.0,
      "score": 3
    },
    {
      "id": "mdouoka",
      "body": "Thank you for stepping up 🙏 thank you for helping that poor woman 🙏 thank you for calling the cops 🙏 thank you for being a a decent man 🙏 you should be really proud of yourself, please don't underestimate just how much of a hero you are for your actions 🙌",
      "created_utc": 1740000781.0,
      "score": 3
    },
    {
      "id": "mdp13p9",
      "body": "Wow this is terrifying. We really appreciate people like you. Just WOW",
      "created_utc": 1740002517.0,
      "score": 3
    },
    {
      "id": "mdp8t1w",
      "body": "Thank you, OP. Thank you for doing the hard but right thing and stepping in. Let's all follow this example...it's not longer see something, say something. It's see something, DO something. The cops would not have saved her...YOU did.",
      "created_utc": 1740004696.0,
      "score": 3
    },
    {
      "id": "mdpivps",
      "body": "You’re a great human being. Thank god you were there to help the poor girl. God bless you.",
      "created_utc": 1740007726.0,
      "score": 3
    },
    {
      "id": "mdqnsbs",
      "body": "Thank you for keeping her safe. You saved her. That could’ve been damn near any of us.",
      "created_utc": 1740021283.0,
      "score": 3
    },
    {
      "id": "mdqsga2",
      "body": "I don't know for sure but i assume you're a dude because you say the would be rapist tried to flip it on you. This is what dudes need to do instead of crying \"not all men\". We know not all men. good men exist. But unless they're doing what you did, they're a part of the problem. good job not being a part of the problem.",
      "created_utc": 1740022969.0,
      "score": 3
    },
    {
      "id": "mdr6sci",
      "body": "Thank you for saving this woman from an assault and all the trauma that w would have come with.   \n\nYou are a hero you are a modern day superhero and I am thankful to you for saving her from a lot of pain and hurt.  \n\nYou did the right thing when you could have ignored it all.   Bless you!",
      "created_utc": 1740028785.0,
      "score": 3
    },
    {
      "id": "mds1qed",
      "body": "Thank you.",
      "created_utc": 1740046029.0,
      "score": 3
    },
    {
      "id": "mdse4rs",
      "body": "You did good! \n\nYou saved a girl from getting raped or worse.\n\nBe proud of yourself.\n\nBeing shaken up is normal. Go and follow up with the police, Waving hands and shooing him away is not enough in my humble opinion.",
      "created_utc": 1740052864.0,
      "score": 3
    },
    {
      "id": "mdursbi",
      "body": "Thank you for saving her, if you go back to the store you were in maybe they might have footage and perhaps ask in your local Facebook group to see if anyone has pictures of the incident",
      "created_utc": 1740079252.0,
      "score": 3
    },
    {
      "id": "mdvibh9",
      "body": "Thank you, we need more people like you. Really",
      "created_utc": 1740086586.0,
      "score": 3
    },
    {
      "id": "mdmqcq5",
      "body": "Excellent response time from the cops /s",
      "created_utc": 1739980288.0,
      "score": 2
    },
    {
      "id": "mdmtqyx",
      "body": "Thank you. I wish someone would have intervened (in this way, specifically) when it happened to me 18 years ago. The workers at the first (few? I can't remember) hotels did turn him away when they saw me come in, but the second one didn't, or didn't see me in the state I was in.",
      "created_utc": 1739981230.0,
      "score": 2
    },
    {
      "id": "mdmurn5",
      "body": "Thank you 🩷",
      "created_utc": 1739981512.0,
      "score": 2
    },
    {
      "id": "mdmw5as",
      "body": "Thank you so much for stepping in for that girl. We need good people to be good people and take action when they see things like this. There may be cameras from shops in the area that caught him walking with her and you following. Most likely nothing will come of it unless that guy tries to press some kind of charges on you, but that's unlikely. This is a sad state of affairs but happens DAILY even in 2025. Thank you again for doing something!!",
      "created_utc": 1739981895.0,
      "score": 2
    },
    {
      "id": "mdmyixo",
      "body": "You are a Hero. Thank you for standing up for those who may not be able to defend themselves.",
      "created_utc": 1739982548.0,
      "score": 2
    },
    {
      "id": "mdn2lq3",
      "body": "You are a good person op🙌🏻",
      "created_utc": 1739983652.0,
      "score": 2
    },
    {
      "id": "mdn54sx",
      "body": "I’d buy you a drink or dinner if I could OP, mad props.",
      "created_utc": 1739984334.0,
      "score": 2
    },
    {
      "id": "mdn6u9i",
      "body": "This could have been dangerous for you, but you did the thing anyway. Amazing. The world, and this girl's life specifically, is better bc of ppl like you in it. Thank you for being so brave. May all good things happen to you for the rest of your days❤️❤️",
      "created_utc": 1739984795.0,
      "score": 2
    },
    {
      "id": "mdoti1a",
      "body": "Op i hope that good karma does you some good in life.",
      "created_utc": 1740000468.0,
      "score": 2
    },
    {
      "id": "mdoxzhh",
      "body": "Just a thought- she may have had a drink but not have been “drunk”.  \n\nRufies, spiking, etc are still happening everywhere.  Take care of yourselves out there.  \n\nIt’s the scariest thing to realize you’ve been drugged. \n\nIt happened to me 48 years ago by a boyfriend. I met him at his closed business - got drugged - with all his Pals watching me with a weird concentration in their eyes. I immediately felt the drugs start to go thru my system and jumped into my car, despite him begging me to stay, and prayed I would make it the 30 minute drive home. It’s just like it happened yesterday. I was awake for about 24 hours which is why I think it was PCP (but ? It was my first and only time with that drug) and was numb from head to toe but wide awake. That jerk had the nerve to call me after!\n\nI have had several family members drugged - some back in the 80s and one who is already a grandmother was drugged by a coworker. Both were quick to get out of the situation also.  \n\nWe were lucky.  Teach your kids to seek a way out the second they feel the drugs. That’s what save all of us.  \n\nThanks for saving her!",
      "created_utc": 1740001671.0,
      "score": 2
    },
    {
      "id": "mdozn07",
      "body": "Wish I was as brave as you",
      "created_utc": 1740002118.0,
      "score": 2
    },
    {
      "id": "mdp1k59",
      "body": "Thank you so much for saving her! He might have filmed it to sell to websites or even killed her. Please pay yourself in the back. I’d buy you coffee if I could.",
      "created_utc": 1740002646.0,
      "score": 2
    },
    {
      "id": "mdphmie",
      "body": "Salute 🫡",
      "created_utc": 1740007331.0,
      "score": 2
    },
    {
      "id": "mdqwpv4",
      "body": "Wow thank you so much for not just watching and doing something. Thank you.",
      "created_utc": 1740024588.0,
      "score": 2
    },
    {
      "id": "mdr5y0o",
      "body": "It’s really meaningful to know that there’s someone like you! You’re so brave!!",
      "created_utc": 1740028405.0,
      "score": 2
    },
    {
      "id": "mdrde79",
      "body": "Great job",
      "created_utc": 1740031914.0,
      "score": 2
    },
    {
      "id": "mdrey5a",
      "body": "Why the fuck wouldn't those lazy cops take her home themselves? A Uber taking someone that drunk home is another potential rape situation.",
      "created_utc": 1740032702.0,
      "score": 2
    },
    {
      "id": "mdrhf76",
      "body": "In '06 a guy who was a friend of a friend tried to rape me.  I had been drugged and was paralyzed but could still see and hear.  My roommate's friend, who I didn't know, told the guy to leave.  The guy kept insisting that he would stay and \"take care of\" me.  The horror i felt....  But roommate's friend ended up physically kicking the guy out of our apartment.  He then stayed up all night to make sure I was okay, and in the morning he helped me hobble to my bed and gave me water.  The next time I saw him I couldn't stop thanking him and he didn't understand why I was so thankful.  He thought what he did was what anyone would do.  It wasn't.  I will never, ever forget him.  You're now that guy in someone else's story.  The guy who saved her and who she will remember that, when one man wanted to hurt her, there WAS another man who she didn't even know who protected her.",
      "created_utc": 1740034020.0,
      "score": 2
    },
    {
      "id": "mdruk3a",
      "body": "It’s traumatizing and you are my hero. Thank you for being one of the few people who actually steps in and does something in these circumstances and situations. Angel wings for you. Truly.",
      "created_utc": 1740041700.0,
      "score": 2
    },
    {
      "id": "mdrygaj",
      "body": "I'm sorry you're so traumatized by this and feeling the lingering thoughts of \"what if\" and \"how could they\". I recently helped out two strangers in West Hollywood, Cal. One was entirely trashed and his friend was sobbed but couldn't handle his friend (very tall guy). I asked if they were OK, and I could see/ hear the desperation of the poor guy. Turns out his friends had ditched them and he didn't have money for an Uber (assuming) or just  didn't know what to do. Luckily, I was out with my two guy friends and called them over. I'm a female and still don't trust  male- strangers regardless of their sexuality. So my friends ended up helping them out and took them home. The guy blessed me and was so grateful, and I told him to find some new friends and fuck the ppl that left them stranded like that. ANYTHING can happen, which is also another reason, especially as a female that I don't get absolutely shit faced when I'm out. Stay safe my fellow clubbers, and party goers! ❤️",
      "created_utc": 1740044065.0,
      "score": 2
    },
    {
      "id": "mdrynro",
      "body": "So he impersonated a cop & didn't get arrested for it??",
      "created_utc": 1740044192.0,
      "score": 2
    },
    {
      "id": "mds03vr",
      "body": "Legend",
      "created_utc": 1740045062.0,
      "score": 2
    },
    {
      "id": "mds1lid",
      "body": "He was determined too. Thank you for doing that.",
      "created_utc": 1740045950.0,
      "score": 2
    },
    {
      "id": "mdsgayk",
      "body": "You did a good thing. I know it can be scary to put yourself on the line and intervene when you see something happening, but you should be proud of yourself. Not everyone would do what you did, and it shows compassion and bravery.\n\n\nMaybe take a second and write down everything you remember about what happened. Include details about what this guy looks like, what he was wearing, where everything happened, whatever you remember. I'm not sure if it'll be helpful to you to get this stuff off your chest, or just to help you remember details if something happens with this guy again. You can send copies of this information to the police, or your loved ones if anything happens to you, or you notice someone following you. It's likely that this dirt bag won't do anything to you to retaliate, but just in case, it wouldn't hurt to be prepared.",
      "created_utc": 1740053865.0,
      "score": 2
    },
    {
      "id": "mdtngh5",
      "body": "Way to go! She was probably drugged. I wished they’d taken her to the hospital to be tested for date rape drugs. When I was a licensed drug and alcohol reduction specialist, you would not believe how many people had been drugged. I had bar tenders telling me they knew other bar tenders drugging people on top of numerous disgusting people like this. They also said things like this happen almost every night in most busy bars. Unfortunately, cops will give a girl a DUI for being under the influence even though she blows below the legal limit due to her mental and physical abilities being compromised. They assume it’s Special K, MDMA or Molly, etc. IF ANYONE SEES A GIRL BEING DRAGGED OR LEANING ON SOMEONE BECAUSE THEY CANT WALK ON THEIR OWN THEY HAVE PROBABLY BEEN DRUGGED. Call the police!!!!  I would say 90% are drugged and 10% are actually drunk. The deviant will put something in your drink, even if you are with friends. You just have to turn your head to speak to someone and a half a second later your drink has been sabotaged. They wait until you feel sick, dizzy, or just out of it. They’ll grab them when they go to the restroom by themselves. They need to go to a hospital to have a blood test. Unfortunately, cops put them in jail and it’s too late to be tested for a date rape drug by the time they are out. If you are a cop, it should be standard procedure to have their blood tested. You are a hero, sir! For parents out there, please talk to your children about this. Only drink from a covered drink, go with friends (even that doesn’t stop them), do not stay till the end of the night, and report anyone that is stumbling with someone else’s arm around them. If your child is going to college, you really need to have a long talk. Also, tell them every time they get drunk, a person gets closer to alcoholism. Okay, I’ll get off my soap box, now. Stay safe!",
      "created_utc": 1740068215.0,
      "score": 2
    },
    {
      "id": "mdtq36y",
      "body": "Talk about courage. Good for you. The young lady probably won’t remember a thing the next day. Hopefully the Uber took her home",
      "created_utc": 1740068949.0,
      "score": 2
    },
    {
      "id": "mduj2sn",
      "body": "When I was SA the drink I got from the bar was laced with something. I had 1 drink but felt like I had 6-7",
      "created_utc": 1740076872.0,
      "score": 2
    },
    {
      "id": "mduvluz",
      "body": "Don't be worried about the guy with footage of you. He has footage, you have a police report. Request a copy if it's available so you have your defense, however, I doubt he'll do anything. He sounds like an opportunist, and a dumb one. He stayed around while the police came, he really thought they would release her into his custody? He's dangerous yes, but moreso to women and anyone standing in his rapey way. He's most likely already forgotten about you. So forget about him and talk to a counsellor because you did an amazing and brave thing in a horrible situation and some help sorting out your thoughts and nerves after this is useful. Thank you from the bottom of our hearts.",
      "created_utc": 1740080284.0,
      "score": 2
    },
    {
      "id": "mdx5olg",
      "body": "You are an amazing human! ♥️",
      "created_utc": 1740105943.0,
      "score": 2
    },
    {
      "id": "mdy0hck",
      "body": "This would have been traumatic for me too. I saved a girl running down the street from her abusive boyfriend who was caught cheating. If I hadn’t seen what was going on and yelled at the top of my lungs to get this girl in my home she would have been killed. You did good and these feelings will be less invasive in time. You’re a good person.",
      "created_utc": 1740117567.0,
      "score": 2
    },
    {
      "id": "mdz9l4c",
      "body": "It's terrible that this thing happens. \nOnly a few months back me and a friend came to the aid of a young lady who'd been assaulted. Even when we were trying to get her to safety there were people trying to move in on her.\nSociety at its worst.",
      "created_utc": 1740141931.0,
      "score": 2
    },
    {
      "id": "mdomapz",
      "body": "Fantastic work, are you batman? If not have you considered a career being batman?",
      "created_utc": 1739998552.0,
      "score": 4
    },
    {
      "id": "mdsq1jt",
      "body": "Thank you. As a woman, thank you.",
      "created_utc": 1740057803.0,
      "score": 3
    },
    {
      "id": "mdmq6fn",
      "body": "Thank you for not backing down!  Earth Angel",
      "created_utc": 1739980238.0,
      "score": 1
    },
    {
      "id": "mdniszi",
      "body": "🫶☝️👍🏼🎉",
      "created_utc": 1739987997.0,
      "score": 1
    },
    {
      "id": "mdov7u1",
      "body": "as always, the cops are useless",
      "created_utc": 1740000924.0,
      "score": 1
    },
    {
      "id": "mdqdzdi",
      "body": "Even if you did have footage, not sure how much you could do since he didn’t harm you, unless the girl wanted to press charges",
      "created_utc": 1740017857.0,
      "score": 1
    },
    {
      "id": "mdqwlrv",
      "body": "Ummm, fuck the cops for not seeing her home. This is sus AF.",
      "created_utc": 1740024543.0,
      "score": 1
    },
    {
      "id": "mdr3z9q",
      "body": "I swear i read this story before.",
      "created_utc": 1740027555.0,
      "score": 1
    },
    {
      "id": "mdrk8tp",
      "body": "The police is useless at this point. <.<",
      "created_utc": 1740035563.0,
      "score": 1
    },
    {
      "id": "mdrle3b",
      "body": "“Not a big deal” …. Useless pigs, if it was a love one related to them, you bet your ass they’d be actually doing their job and not dismiss it as easily",
      "created_utc": 1740036209.0,
      "score": 1
    },
    {
      "id": "mdssw0h",
      "body": "If you're traumatized just imagine how that woman feels waking up this morning. The world is a little better place because of your actions that night.\n\nJust goes to show how useless the police are.\n\n#We keep us safe.",
      "created_utc": 1740058846.0,
      "score": 1
    },
    {
      "id": "mdt1bp2",
      "body": "Well done. I stopped a rape nearly 40 years ago. I still think about it and am proud of what I did.",
      "created_utc": 1740061714.0,
      "score": 1
    },
    {
      "id": "mdtfr7d",
      "body": "You are awesome. An absolute hero.  Thank you for being a good person and intervening",
      "created_utc": 1740066047.0,
      "score": 1
    },
    {
      "id": "mdtgx78",
      "body": "Thank you sir for your bravery and persistence!",
      "created_utc": 1740066376.0,
      "score": 1
    },
    {
      "id": "mdtina0",
      "body": "You didn't just stop a rape, you stopped a traumatic event that would have changed that girls whole life. You didn't f up, you're a hero. Imagine what that poor girl would be dealing with today if it wasn't for you!",
      "created_utc": 1740066863.0,
      "score": 1
    },
    {
      "id": "mdtkot3",
      "body": "Thank you thank you thank you thank you , as a woman in this fucked up country, THANK YOU.",
      "created_utc": 1740067438.0,
      "score": 1
    },
    {
      "id": "mdtvry8",
      "body": "From a woman- thank you so much",
      "created_utc": 1740070520.0,
      "score": 1
    },
    {
      "id": "mdu8i2u",
      "body": "Thank you for being an amazing human being! Thank you for taking care of someone’s daughter, sister or friend! You ROCK OP!!!!",
      "created_utc": 1740074022.0,
      "score": 1
    },
    {
      "id": "mduiag8",
      "body": "🙏🏽",
      "created_utc": 1740076660.0,
      "score": 1
    },
    {
      "id": "mdybpx5",
      "body": "You Done Good.",
      "created_utc": 1740123451.0,
      "score": 1
    },
    {
      "id": "mdzmd1x",
      "body": "YOU ARE A FUCKING HERO MAN!!!!!!!!!!!!! Holy fuck I am so thankful for & proud of you 🩷🩷🩷🩷🩷🩷🩷🩷🩷🩷🩷🩷🩷🩷",
      "created_utc": 1740146625.0,
      "score": 1
    },
    {
      "id": "me0i82l",
      "body": "Not all heroes wear capes my friend. ",
      "created_utc": 1740156121.0,
      "score": 1
    },
    {
      "id": "me3j4hm",
      "body": "Thank you for what you did. It shows that you are a man, though. All of us women know full well how often things like this happen.",
      "created_utc": 1740191710.0,
      "score": 1
    },
    {
      "id": "meav880",
      "body": "I'm glad there are people like you out there, that choose to take action (and not just be a passive bystander) to do what's right. Thank you!!!",
      "created_utc": 1740291784.0,
      "score": 1
    },
    {
      "id": "mebj1qi",
      "body": "Nothing to worry about",
      "created_utc": 1740305487.0,
      "score": 1
    },
    {
      "id": "meca3wr",
      "body": "People like you help me keep going",
      "created_utc": 1740318999.0,
      "score": 1
    },
    {
      "id": "mecb8ri",
      "body": "Straight up hero",
      "created_utc": 1740319430.0,
      "score": 1
    },
    {
      "id": "mefzjwz",
      "body": "That guy should be executed. The cops are useless per usual. Thanks for caring.",
      "created_utc": 1740360227.0,
      "score": 1
    },
    {
      "id": "megdq3j",
      "body": "That POS got what he deserved. \nKudos to you. ",
      "created_utc": 1740365267.0,
      "score": 1
    },
    {
      "id": "meheldq",
      "body": "Thank you for doing the right thing. Who knows what horrors that creeper had planned for this girl.\n\n\nDon't beat up on yourself for not thinking about things you wish you'd done. If you wish, you can work out a script in your head to follow, should this ever happen again.",
      "created_utc": 1740382022.0,
      "score": 1
    },
    {
      "id": "mei384i",
      "body": "first things first i want to say i’m proud of you for showing empathy and stepping in to help that girl, most people would’ve ignored it (and this is coming from someone who did survive sexual assault as a nonbinary person) she will remember that for a long time \n\nand i hope you are taking care of your mental health as well after that, even though it didn’t transpire, it still is extremely traumatic and i hope you (and the girl) are taking care of yourselves.",
      "created_utc": 1740396896.0,
      "score": 1
    },
    {
      "id": "mekodub",
      "body": "From someone who has experienced being raped before believe me when I say you being the true hero you are is amazing. I wish there were more people like you out there you saved someone from something that could've scarred them for life!! I commend you for it and you should pat yourself on the back. There are truly disgusting humans in this world believe me.",
      "created_utc": 1740426856.0,
      "score": 1
    },
    {
      "id": "mf5g7b2",
      "body": "Thank you for saving her from that. You’re awesome man.",
      "created_utc": 1740695224.0,
      "score": 1
    },
    {
      "id": "mi9snyu",
      "body": "Thank you for being a good person and it's because the police really don't care if we're being honest ",
      "created_utc": 1742224740.0,
      "score": 1
    },
    {
      "id": "mtsc75s",
      "body": "You did an amazing, incredible thing. Thank you for your bravery and your determination to do the right thing. \n\nAs a woman who has been *that drunk* in public in NYC, this sent a chill down my spine. I don’t drink like that anymore but I’m so grateful I didn’t experience any life changing trauma. \n\nYou saved her life.",
      "created_utc": 1747978093.0,
      "score": 1
    },
    {
      "id": "mdo5gts",
      "body": "You, Sir, are a fucking legend. A lot of people would have just ignored it, but you stepped up and helped the girl. May your freshly earned karma bring loads of positive things in your life",
      "created_utc": 1739994073.0,
      "score": 2
    },
    {
      "id": "mdny10e",
      "body": "Wait what? This reads kinda sus, like you following the guy to his apartment before intervening? Even though you had plenty of time to be the hero but you waited till you were at his doorstep? Seems like a karma farming attempt",
      "created_utc": 1739992078.0,
      "score": -1
    },
    {
      "id": "mdo54l2",
      "body": "It’s not really the right time to ask this and I’m glad you stepped in and got her to safety but if you’re going out to drink (ppl in general), why can’t people be responsible and drink in moderation? How do you let yourself get hammered to the point you can’t even stand? It’s honestly a genuine question because I feel like there’d be less cases like this if people just learn to drink responsibly, for me i wouldn’t know because I haven’t drank (since I’m underage but people my age still tend to drink) and don’t really plan to since I don’t see the appeal in drinking. I mean no disrespect or anything with these questions",
      "created_utc": 1739993983.0,
      "score": -6
    },
    {
      "id": "mdrx92q",
      "body": "Idon’tbelieveyou.gif",
      "created_utc": 1740043336.0,
      "score": -2
    },
    {
      "id": "mdt2nk4",
      "body": "[deleted]",
      "created_utc": 1740062142.0,
      "score": -3
    },
    {
      "id": "mdo91tg",
      "body": "I feel similarly. I was at the grocery store today and the wind was blowing a cart across the parking lot and i grabbed it just before it smashed into the side of someone's car. Look at us do-gooders!",
      "created_utc": 1739995028.0,
      "score": -11
    },
    {
      "id": "mdqetik",
      "body": "What was the ethnicity of delivery guy and the girl?",
      "created_utc": 1740018143.0,
      "score": -5
    },
    {
      "id": "mdobtm0",
      "body": "Aunt Linda sounds like a total badass",
      "created_utc": 1739995770.0,
      "score": 546
    },
    {
      "id": "mdocsb4",
      "body": "Please tell me your aunt didn’t get into any trouble!",
      "created_utc": 1739996029.0,
      "score": 240
    },
    {
      "id": "mdqd93i",
      "body": "I love you aunt Linda. May she have her pick of kick ass boots",
      "created_utc": 1740017608.0,
      "score": 152
    },
    {
      "id": "mdqhkc6",
      "body": "Your Aunt Linda sounds amazing!  May she rest in peace.",
      "created_utc": 1740019094.0,
      "score": 82
    },
    {
      "id": "mdrcgvk",
      "body": "HELL YEAH LINDA RIP!! <3",
      "created_utc": 1740031450.0,
      "score": 39
    },
    {
      "id": "mdsacs0",
      "body": "WWALD.\n\nWhat Would Aunt Linda Do",
      "created_utc": 1740050965.0,
      "score": 41
    },
    {
      "id": "mdrkkhg",
      "body": "I love aunt Linda ❤️",
      "created_utc": 1740035743.0,
      "score": 23
    },
    {
      "id": "mdsqcu6",
      "body": "HELL YEAH AUNT LINDA!!! We need more of her!!",
      "created_utc": 1740057919.0,
      "score": 18
    },
    {
      "id": "mdsoy9y",
      "body": "Love this! Thanks for sharing!!",
      "created_utc": 1740057398.0,
      "score": 15
    },
    {
      "id": "mdr905a",
      "body": "Bloody brilliant!!! What an amazing lady!! 🥰",
      "created_utc": 1740029783.0,
      "score": 27
    },
    {
      "id": "mdtl370",
      "body": "I love her holy fuck. That is the kind of rage my crazy ass would meet with his package as well 🥰",
      "created_utc": 1740067551.0,
      "score": 8
    },
    {
      "id": "mdw7fqp",
      "body": "I love your aunt so much right now. I wish we all had someone like her around when we needed it. I am sorry for your loss.",
      "created_utc": 1740093927.0,
      "score": 2
    },
    {
      "id": "mdwbwoc",
      "body": "Holy sh** Aunt Linda RIP!!! Amazing 🥲",
      "created_utc": 1740095357.0,
      "score": 2
    },
    {
      "id": "me1kydy",
      "body": "My grandma once chased a man with a butcher knife still dripping with blood from cutting up meat. The guy saw a neighbour's daughter walk home from highschool and cornered her while stripping down. Grandma heard her scream while food prepping and rushed out the kitchen backdoor, saw the situation and proceeded to chase the bottom-naked man with the knife. I'm not sure what happened after that cause grandma only told me until that part😅",
      "created_utc": 1740166891.0,
      "score": 2
    },
    {
      "id": "megdjji",
      "body": "Bless you, Aunt Linda. RIP\n🙏",
      "created_utc": 1740365199.0,
      "score": 2
    },
    {
      "id": "menixg7",
      "body": "The guy shares this whole story and the next thing you think of saying is \"hey I have a story too! my aunt blablabla\" lol I’m definitely not reading that ",
      "created_utc": 1740459863.0,
      "score": 0
    },
    {
      "id": "mdlxoe7",
      "body": "He was a local delivery guy. Unfortunately, there was nothing specific on his jacket. My hunch is he worked for that deli and the girl stumbled in looking for a place to go and/or food. I will def look into that more. Thank you.",
      "created_utc": 1739971108.0,
      "score": 1471
    },
    {
      "id": "mdnuka1",
      "body": "Watch true crime sometime and you’ll see how many times this happens and just how many men will do this. Especially the ones that are caught on cctv cameras in big cities like London where there are cameras everywhere. They don’t care. They make a point of loitering around pubs, nightclubs and bars and try and find a young girl who is intoxicated and follows her. So many. Way too many men do this.",
      "created_utc": 1739991148.0,
      "score": 203
    },
    {
      "id": "mdmjj84",
      "body": "Came here to say something very similar. Biggest hugs to both of you!!",
      "created_utc": 1739978340.0,
      "score": 194
    },
    {
      "id": "meawz6n",
      "body": "That's awful 😖 and I'm so sorry that happened to you. Were your ever able to identify them to police so they could be charged? Not a good friend to let you walk home drunk....",
      "created_utc": 1740292718.0,
      "score": 1
    },
    {
      "id": "mdmnf5q",
      "body": "This is purely my assumption and based on knowledge of police work from my country (not American), where they claim they're not a taxi. They provide safety, but if the person has money and can order a taxi with some help, they usually let them go.",
      "created_utc": 1739979460.0,
      "score": 106
    },
    {
      "id": "mdnmuej",
      "body": "I have no idea tbh. I don’t know the protocol at all, but yes, to me they should’ve taken her home.",
      "created_utc": 1739989085.0,
      "score": 62
    },
    {
      "id": "mdq0w18",
      "body": "The amount of cops that rape vulnerable people, probably better they got her an Uber.",
      "created_utc": 1740013461.0,
      "score": 34
    },
    {
      "id": "mdnb6cq",
      "body": "Cops are useless until someone kills a CEO, then they’ll search high and low for CEO killers",
      "created_utc": 1739985957.0,
      "score": 279
    },
    {
      "id": "mdsplyx",
      "body": "Beautifully, perfectly written.",
      "created_utc": 1740057642.0,
      "score": 2
    },
    {
      "id": "mdmz9nf",
      "body": "I did not know this, so thank you for the information. Based on her behavior, I assumed she was drunk, but she could’ve easily been roofied beforehand. I just know she wasn’t in a state to consent to anything whatsoever.",
      "created_utc": 1739982751.0,
      "score": 77
    },
    {
      "id": "mdpf6ye",
      "body": "This is so true. Years ago I was out for New Years Eve on a first date. I had exactly one drink. The next thing I remember is waking up at home extremely out of it with a broken foot and someone knocking at my door. When I answered the door, it was a taxi driver. He said he was waiting outside the bar and saw me fall down the front steps. There was a guy there who picked me up and started kissing me and I was trying to push him away. The taxi driver asked a bunch of questions...enough to apparently scare the guy off after I slurred that I didn't't know him. I was so out of it that the driver looked at my ID in my purse to get my address and drove me home. He said I got inside ok but he was so worried that he came back the next day to check on me. He refused to let me pay him for the ride home. When he saw my foot he drove me to the hospital. Not only was it broken in a couple places but my blood work came back with rohypnol in it. \n\nI also ended up getting a message from the guy I was on a date with. From the way I was acting he thought I just got trashed and started hooking up with another guy so he left me there. The guy told him he was my ex. (He wasn't)\nThe police never ended up following up on anything after I reported it. To this day, that taxi driver is my absolute hero. I have no clue what could have happened to me if he hadn't intervened. \n\nReading this post gave me absolute chills. OP is no doubt a hero.",
      "created_utc": 1740006584.0,
      "score": 57
    },
    {
      "id": "mdno7rc",
      "body": "Yeah this is exactly what I was thinking, that girl was roofied. Probably by the guy stalking her.",
      "created_utc": 1739989454.0,
      "score": 21
    },
    {
      "id": "mdsnh83",
      "body": "As someone who had the other outcome happen, no the police don't take it seriously or care. I reported right away and it never went anywhere the detective said it was my fault and I consented by asking about protection even though I was drugged and probably drunk, and I remember saying no. We're pretty sure for me it was GHB.",
      "created_utc": 1740056837.0,
      "score": 2
    },
    {
      "id": "meay5uf",
      "body": "What college did you attend? This sounds nurse awful!",
      "created_utc": 1740293363.0,
      "score": 1
    },
    {
      "id": "mdove2e",
      "body": "Was just about to comment that we need more people willing to step in!!",
      "created_utc": 1740000970.0,
      "score": 16
    },
    {
      "id": "mdozu2x",
      "body": "100 percent",
      "created_utc": 1740002170.0,
      "score": 3
    },
    {
      "id": "mdrko69",
      "body": "This was what would have happened! I mean even if she had survived whatever nightmare he had in store. She might have wished she hadn’t!  It could have gotten beyond bad & I could totally see her making a police report , law enforcement might have said,  “she asked for it” Or worse, “she is probably lying” . He could have had 3 buddies in his crib waiting to take turns! No telling! So yeah like the person said  YOU SAVED HER LIFE!   Life would have never been the same for her …. You are a rockstar! I’m sure you were terrified too but you still chose to swoop in and got the job done! But those cops…. What a disgrace…",
      "created_utc": 1740035800.0,
      "score": 2
    },
    {
      "id": "mgziby5",
      "body": "As a taxi driver, I wish people would stop doing this. As much as I have no problem driving people home after a good night out, if they are in that bad condition, they may need medical care, they may not be able to pay (unless you pay the fare), you don't know whether the driver is a creep or not, and you don't know what the person may end up doing (for example, if they vomit in the car, that's going to be a really expensive bill. But worse, if they decide to open the car door and hop out while on the expressway...)\n\nRule of thumb, if they can't provide an emergency contact, and don't know their address while they are in that state, call 911 instead. You could be saving their life for a number of possible reasons. If they're not sober enough to make decisions as a passenger in a cab, they need to be assessed by a paramedic, and/or driven home by the police.\n\nAlso, if you are going to call a cab, request a female driver. At least that way the chance of it being a creep plummets dramatically. I don't know if that's a feature on Uber, but my taxi company had actual coding for this if requested by a customer.",
      "created_utc": 1741590413.0,
      "score": 1
    },
    {
      "id": "mgzilkz",
      "body": "Also 4. I can't think of many police forces in the US that don't have a body cam of some sort. It may not hurt for OP to contact the police and ask for the body cam footage to be backed up.",
      "created_utc": 1741590584.0,
      "score": 1
    },
    {
      "id": "mgzimsf",
      "body": "The police should have body camera footage as well.",
      "created_utc": 1741590606.0,
      "score": 1
    },
    {
      "id": "mdsqls7",
      "body": "The \"bear\"? Forgive me, I am clueless...",
      "created_utc": 1740058011.0,
      "score": 2
    },
    {
      "id": "mei4nd0",
      "body": "i went through something similar and i wanted to say i’m so sorry you went through this, you didn’t deserve what happened to you and fuck those “friends” that ignored and dismissed you \n\ni hope you’re in a better place mentally and physically now 🙏🏾",
      "created_utc": 1740397635.0,
      "score": 2
    },
    {
      "id": "mgzj73y",
      "body": "I hope you have better friends now, because all of my friends would probably beat the living crap out of somebody who SA'd someone in our circle. I'm sorry you went through that. 🥺",
      "created_utc": 1741590972.0,
      "score": 2
    },
    {
      "id": "mdsqqw2",
      "body": "I'm really sorry that happened to you.",
      "created_utc": 1740058062.0,
      "score": 2
    },
    {
      "id": "meazag5",
      "body": "I'm sorry that happened you you as well. There are many is us that wish we could save you from that. ",
      "created_utc": 1740293975.0,
      "score": 2
    },
    {
      "id": "mdrbs99",
      "body": "You’re a good friend. She was lucky to have you there.",
      "created_utc": 1740031116.0,
      "score": 2
    },
    {
      "id": "mgzjjt3",
      "body": "At least nowadays it's a lot harder to be like that with the advent of body cameras on most police officers. I've been watching a lot of body camera footage lately on YouTube, and there's been a few very questionable officers that have been caught red-handed because of them.",
      "created_utc": 1741591203.0,
      "score": 1
    },
    {
      "id": "mdsqwzl",
      "body": "I'm sorry that happened to you.",
      "created_utc": 1740058126.0,
      "score": 1
    },
    {
      "id": "mdsr7zw",
      "body": "Yes, yes, yes!!",
      "created_utc": 1740058239.0,
      "score": 1
    },
    {
      "id": "mdocm85",
      "body": "Here in Denver, the cops would have driven her themselves. There's no ordering an Uber on one's behalf. They just load her up and drive her home in the shop",
      "created_utc": 1739995983.0,
      "score": 4
    },
    {
      "id": "mdsrhqh",
      "body": "I'm so sorry that happened to you.",
      "created_utc": 1740058338.0,
      "score": 1
    },
    {
      "id": "mdsrq5k",
      "body": "Especially in 2025, seems like apathy runs deep.",
      "created_utc": 1740058425.0,
      "score": 2
    },
    {
      "id": "mdss8la",
      "body": "I'm sorry that happened to you.",
      "created_utc": 1740058610.0,
      "score": 1
    },
    {
      "id": "mdstoe0",
      "body": "Oh my goodness, you were so smart to jump in your car!!",
      "created_utc": 1740059128.0,
      "score": 1
    },
    {
      "id": "mdsu8g3",
      "body": "Great advice!",
      "created_utc": 1740059326.0,
      "score": 2
    },
    {
      "id": "mdtkw22",
      "body": "Like FUCK why is it so uncommon for people to step in and do something in this country. You are quite literally a hero, and have bigger balls than most men I’ve known",
      "created_utc": 1740067494.0,
      "score": 1
    },
    {
      "id": "mdorg37",
      "body": "Why would I karma farm? That makes no sense. I made a dummy account to vent. Nothing more, nothing less. I was on the phone with the police giving them updated streets and cross streets as I was following them. I had already called twice and was hoping they’d show up soon. Clearly, they did not. I didn’t know where they were going until he got to his apartment.",
      "created_utc": 1739999925.0,
      "score": 5
    },
    {
      "id": "mdoktlz",
      "body": "Or building up nerve? Doing the right thing isn’t always easy especially if you don’t know you’re stronger than the other person.",
      "created_utc": 1739998164.0,
      "score": 3
    },
    {
      "id": "mdokjvj",
      "body": "There’s lots of ways. You’re young and don’t yet know your limits. You drank on an empty stomach. Your friend you were gonna have a sleepover with hooked up with somebody and now you’ve gotta make it home alone, drunker than Cooter Brown. You tried a different liquor than you usually drink and it hit you like a ton of bricks. You’re a young, attractive woman, so the bartender was heavy with the pours. The drinks were so weak mixed you couldn’t taste the liquor. Plenty more reasons. \n\nThere’d be less cases like this if some people weren’t trying to rape others, period. Even if that young woman was sober she could’ve been attacked and there’s no way of knowing that she’s been taught the self defense necessary to keep that guy from victimizing her. So again, back to the if people didn’t rape others part, this wouldn’t happen.",
      "created_utc": 1739998094.0,
      "score": 7
    },
    {
      "id": "mdt5qdh",
      "body": "rot slow",
      "created_utc": 1740063109.0,
      "score": 3
    },
    {
      "id": "mdoocd4",
      "body": "Awww your self-esteem is so low you had to put someone else down. How sweet!",
      "created_utc": 1739999094.0,
      "score": 8
    },
    {
      "id": "mdvr3bo",
      "body": "Good-on her.Thats the right attitude any girl in jeopardy should take,Show No Mercy to Perverts & help increase the peace & show other woman how to get The Upper Hand on Weirdo's.",
      "created_utc": 1740089061.0,
      "score": 29
    },
    {
      "id": "mdoxo5b",
      "body": "Absolutely not!\n\n\nCops did right by her and the rapist was put in state prison I do believe.  Would love to read the police report though!",
      "created_utc": 1740001586.0,
      "score": 362
    },
    {
      "id": "mdv60wi",
      "body": "Omg.",
      "created_utc": 1740083166.0,
      "score": 2
    },
    {
      "id": "meawiuq",
      "body": "Your grandma sounds like a badass too! I wonder how far she chased him!",
      "created_utc": 1740292472.0,
      "score": 2
    },
    {
      "id": "mietsty",
      "body": "???",
      "created_utc": 1742292088.0,
      "score": 1
    },
    {
      "id": "mdp2t1u",
      "body": "Ladies you have to be careful with delivery guys. My friend ordered delivery once. She told me the guy kept coming back for a few days trying to get into the apartment and buzzing her bell when she didn't even order anything.",
      "created_utc": 1740002990.0,
      "score": 412
    },
    {
      "id": "mdqjb9k",
      "body": "You can request the audio from your police call because you know what time you called, and the report will have your name in it. I promise you won't get in legal trouble. He also likely won't try anything because he knows he's guilty. You def did exactly the right thing.",
      "created_utc": 1740019707.0,
      "score": 53
    },
    {
      "id": "mdqokn7",
      "body": "Amazing you did an amazing deed!  Hope she doesn’t plan on being intoxicated ever again.  She might not even recall or be aware of what’s happened.  Too bad you don’t know how to connect with her to let her know.\n\nIf you’re able to try to check and if he does work for the deli, speak only to the owner and they should have security cameras.  Maybe ask the police first if they can assist in this situation first, but they probably won’t since they only ordered her an Uber.",
      "created_utc": 1740021563.0,
      "score": 14
    },
    {
      "id": "mdqb7sl",
      "body": "You did good",
      "created_utc": 1740016912.0,
      "score": 2
    },
    {
      "id": "mdvvaji",
      "body": "Sue him if he uploads it.",
      "created_utc": 1740090274.0,
      "score": 1
    },
    {
      "id": "me0km3j",
      "body": "Yes, you should definitely pursue finding his employer! People are buzzing this man into their buildings and unlocking their doors to receive their food. That’s really scary.",
      "created_utc": 1740156785.0,
      "score": 1
    },
    {
      "id": "meawn53",
      "body": "Ugh so disgusting! ",
      "created_utc": 1740292535.0,
      "score": 1
    },
    {
      "id": "mef98va",
      "body": "No.  We have a father large east Indian population coming in so there's no way I could have identified them. My former friend passed out on the bench apparently. City police know who I am since my dad works for the courts. Even if they could do anything, it's long passed now.",
      "created_utc": 1740351406.0,
      "score": 1
    },
    {
      "id": "mdmqzzz",
      "body": "In the state she was in they should have taken her home and escorted her to her front door",
      "created_utc": 1739980467.0,
      "score": 190
    },
    {
      "id": "mdpbaa1",
      "body": "In America, they are explicitly NOT there to provide safety, they are NOT there to prevent crime. The Supreme Court ruled on this. \n\nIf you call the cops and tell them \"Billy Williamson, that lives at 123 Avenue Rd, City, ST 00000, recorded himself promising to come murder me in 5 days, i have all the proof, can you please stop it?\", they are completely allowed to say \"meh, we don't care\" and your family can't even win a lawsuit about it, because they aren't \"supposed\" to protect people, only arrest after a crime is already committed.",
      "created_utc": 1740005412.0,
      "score": 85
    },
    {
      "id": "mdspcb0",
      "body": "Uber drivers do the same, unfortunately.",
      "created_utc": 1740057543.0,
      "score": 9
    },
    {
      "id": "mdop52n",
      "body": "They're really just attack dogs for the rich.",
      "created_utc": 1739999309.0,
      "score": 115
    },
    {
      "id": "mdr5i0f",
      "body": "A roofie and drunk looks like a coma. A roofie and sober looks drunk.",
      "created_utc": 1740028208.0,
      "score": 8
    },
    {
      "id": "mgzhm9g",
      "body": "I have more to add to this, and I have a somewhat similar situation happen in my time is a taxi driver, where a Good Samaritan called the cab for a woman who was so blackout drunk (or, which I more suspect, had her drink roofied) that she didn't remember where she lived or what a phone number for someone she knew was. She also had no ID or phone.\n\nWithout any other options, and spending about an hour trying to help her get home myself, I ended up driving to the police station, parking under their big CCTV camera, and called the police and ask them to come out to help her get home. Took them what felt like a long time, and I kept the doors locked so she wouldn't walk out and get herself hurt somewhere in her severely compromised state. \n\nEventually, when they did show up, I explained the situation, told them I was waving the fare, and that I just wanted her to be home safe.\n\nI sometimes wonder what happened after that, but I know that it was certainly better than leaving her on the side of the road, or leaving her where she was (in front of a bar downtown).\n\nI also learned a valuable lesson that women and Good Samaritans should know: Don't order an Uber/Taxi if you're that intoxicated or see someone that intoxicated. There are some bad apples out there in the business, and on top of that, the woman could end up being charged for transportation fraud if they're unable to pay. It also puts the taxi driver into a very uncomfortable situation. It's far better to call 911, and let them figure out the best way to get them home safely, or to a hospital, depending on their health at the time. I'm sure a police officer would rather drive someone home safely than to be investigating a sexual assault or, heaven forbid, a homicide.\n\nGranted, with the police in your city, the old creepy guy aside, if she were alone and in that condition, it may be better to just call for an ambulance and say you suspect alcohol poisoning. As mandatory reporters, the medics and/or the hospital will get the police involved if necessary (assuming I'm not incorrect on the mandatory reporting bit).\n\nAlso, if you do call a cab for a woman, request a female driver. At least that way the chance of it being a creep is significantly lower. At least with my company, dispatchers could specifically code calls for female drivers. I don't know if Uber or other rideshare programs do that, but local taxi companies *should* if you call in. I know that any company with TaxiLinq can code calls, and I'm sure other kinds of Taxi software can do the same.",
      "created_utc": 1741589961.0,
      "score": 1
    },
    {
      "id": "mdrb0f0",
      "body": "What a horrifying experience! Your taxi driver was definitely a hero.",
      "created_utc": 1740030741.0,
      "score": 10
    },
    {
      "id": "mdsq0hh",
      "body": "Wow! Thank goodness for the taxi driver!",
      "created_utc": 1740057792.0,
      "score": 5
    },
    {
      "id": "mgzhzj5",
      "body": "I had a similar situation, but from the perspective from the taxi driver. Had a Good Samaritan call for a cab for a woman who was in a similarly bad condition (although thankfully she wasn't assaulted), but she had no ID, and couldn't remember where she lived or the phone numbers of people she knew. I eventually had to take her to the police station, parked under their CCTV, and call 911 to have them take her home because I was fearful for her life. I hope she was okay afterward, because I never heard back from the police, or heard back from my company about the situation.",
      "created_utc": 1741590193.0,
      "score": 2
    },
    {
      "id": "mdxwhsj",
      "body": "I don't know if you read my comment above, \n but the police did nothing for me either. I even had a toxicology report from the hospital showing Rohypnol in my system and a video from the camera in front of the bar I was assaulted at that showed a man kissing me while I was rejecting his advances. The police told me that they couldn't identify him from the footage. They really didn't even try. They also asked me so many gross questions about whether I \"may have led him to think I wanted him to kiss me\" and \"did I act in a way that he thought touching was ok?\" \n\nI'm so very sorry for what you experienced. You deserved so much more from someone \"sworn to protect\". What a joke.",
      "created_utc": 1740115758.0,
      "score": 2
    },
    {
      "id": "mh0zyt4",
      "body": "Some really weird assumptions here so I will clarify.  \n1.  NEVER send or have sent a woman home alone in a cab/uber nor would I let it happen.  \n2.  Ubers are always paid by the caller (me, the bar, whatever)  \n3.  If I can't get an address out of someone they obviously aren't going to reach home.  \n4.  It is ALWAYS made clear to the driver what the situation is before the person is even put in the vehicle.",
      "created_utc": 1741617202.0,
      "score": 2
    },
    {
      "id": "mdssbt6",
      "body": "It was a thing on social media a few months ago about how women would chose being stuck in the woods with a bear than a man. We feel safer around a fucking bear than a man.",
      "created_utc": 1740058642.0,
      "score": 2
    },
    {
      "id": "mh0qpse",
      "body": "It always takes internet strangers telling me it was messed up for me to really get it. It took over a year but I but them all off awhile ago. I'm not great at making friends, I have trouble trusting new people now but I've been trying to focus on the ones I still have, and myself. Lol and thats done wonders for me! I'm okay now ^_^.",
      "created_utc": 1741614070.0,
      "score": 1
    },
    {
      "id": "mdvnghy",
      "body": "Thank you",
      "created_utc": 1740088025.0,
      "score": 1
    },
    {
      "id": "mec9r0m",
      "body": "Thank you, unfortunately it’s a very real thing that happens to women and girls everyday. We need more people willing to stand up and say something.",
      "created_utc": 1740318862.0,
      "score": 1
    },
    {
      "id": "mdocztv",
      "body": "Yeah like, that’s insane to me that they just put her in a cab and sent her home?!!!! What happens if she’s lost her keys or she gets stuck outside?",
      "created_utc": 1739996085.0,
      "score": 2
    },
    {
      "id": "mdstjvc",
      "body": "For real",
      "created_utc": 1740059085.0,
      "score": 1
    },
    {
      "id": "mdostn9",
      "body": "See it still doesn’t make sense. You don’t need to reply to me since this is your story but even the fact that you did a good thing and “made a dummy account to vent”? Like what? And it still makes 0 sense for me that you clearly understood early enough into the situation that the guy had nefarious intentions but you followed him to his apartment cuz you “didn’t know where they were going”? You don’t need to know? You should just intervene while they’re out in public and call attention to a crime happening in front of your eyes? The whole thing just seems farfetched, like a badly written novel to me. That’s just my opinion. Even the way the cops acted sounds like something out of a TV show, like they didn’t get his info? Didn’t even run his name? Just asked him a few questions and let him go like there’s no protocol around that. Ok I guess.",
      "created_utc": 1740000290.0,
      "score": -2
    },
    {
      "id": "mdomp0g",
      "body": "So you’re telling me he was building up the nerve to intervene while the girl was getting harassed in public, where it’s easy to shout and get attention but courage didn’t find him until he was isolated with the attacker at his apartment? This happened in NYC for crying out loud, do you know how many people live there? Idk if you lack real life experience or what, but this does not read like something that actually happened. At least to me.",
      "created_utc": 1739998657.0,
      "score": -6
    },
    {
      "id": "mdst7qo",
      "body": "And don't forget someone could have roofied her drink.",
      "created_utc": 1740058962.0,
      "score": 3
    },
    {
      "id": "mea98c0",
      "body": "Such a nice feeling to see people agree with my basically 'That's The Spirit' comment.Thankyou for agreeing with me.",
      "created_utc": 1740282077.0,
      "score": 1
    },
    {
      "id": "mdpdrge",
      "body": "That’s why I use the leave at door option. Luckily my name can be misinterpreted as a guy so it helps, but not always.",
      "created_utc": 1740006146.0,
      "score": 217
    },
    {
      "id": "mdqquwj",
      "body": "Yeah, I had a delivery driver find my FB by getting my name off my receipt (online order) and stalk me that way. What's worse is that I had two people I considered friends tell me to \"just give him a chance.\" Disgusting.",
      "created_utc": 1740022386.0,
      "score": 51
    },
    {
      "id": "mdpddto",
      "body": "How do we “be careful” tho 😔😔😔by not ordering food?",
      "created_utc": 1740006030.0,
      "score": 109
    },
    {
      "id": "mdrhma0",
      "body": "Yeah trust me we know 👍",
      "created_utc": 1740034126.0,
      "score": 2
    },
    {
      "id": "mdrp4vc",
      "body": "This makes me grateful I only ever order food to my workplace.",
      "created_utc": 1740038398.0,
      "score": 1
    },
    {
      "id": "mds5emv",
      "body": "We know. Remember when we all chose a bear over a man.",
      "created_utc": 1740048208.0,
      "score": 1
    },
    {
      "id": "mdsmqo4",
      "body": "Her being intoxicated was not what caused that issue. Also for all we know maybe she was drugged. It happens a lot more than you think.",
      "created_utc": 1740056554.0,
      "score": 5
    },
    {
      "id": "mdnk9rf",
      "body": "And they still believe themselves to be thankless heroes.",
      "created_utc": 1739988392.0,
      "score": 106
    },
    {
      "id": "mdrnvfh",
      "body": "Yikes what the fuck?",
      "created_utc": 1740037644.0,
      "score": 17
    },
    {
      "id": "mdv3zau",
      "body": "Just like with Healthcare. The U.S.’ attitude towards these things is reactive.",
      "created_utc": 1740082594.0,
      "score": 2
    },
    {
      "id": "mdpav84",
      "body": "Literally the police origin story",
      "created_utc": 1740005291.0,
      "score": 66
    },
    {
      "id": "mhbe90x",
      "body": "You are an angel. Thank you.",
      "created_utc": 1741744602.0,
      "score": 2
    },
    {
      "id": "mh5rq4l",
      "body": "I'm glad you say this, because I was unfortunately put in the #1 situation as a taxi driver, and didn't have payment, not an address, nor was I explained how badly intoxicated they were until I had already left. It wasn't until many days later that it occurred to me that she had likely been roofied.\n\nVery good set of rules to go by, and hopefully more people will follow them. It put me in a very awkward situation which I was thankfully able to resolve positively, but it's a situation I hope to never be put into again.",
      "created_utc": 1741672630.0,
      "score": 1
    },
    {
      "id": "mdt802j",
      "body": "Wow, thank you. 🐻",
      "created_utc": 1740063789.0,
      "score": 2
    },
    {
      "id": "mgzj1uy",
      "body": "That's a terrifying thought. As a guy, I'm mostly blind to what happens to women by virtue of being a guy, and I don't usually go to places where most guys go to. But what I *can* say is that I hear enough awful comments from men that I can't stand most of them. 😣 As a cabbie I've had some pretty disgusting guys in my car. Their comments were quite revolting. Ugh. I'm so sorry all of you have to put up with that sort of stuff. 😔",
      "created_utc": 1741590878.0,
      "score": 1
    },
    {
      "id": "mh5rvyv",
      "body": "I'm happy to hear! ^_^",
      "created_utc": 1741672724.0,
      "score": 1
    },
    {
      "id": "mdodttv",
      "body": "It blows my mind too! First time in my 36 years I've heard of cops ordering an Uber for someone in distress. Like wtf?!?! Those were lazy cops or looking for some bigger bust to boost their records for end of month. I know NYC is a jungle of trash compared to Denver but fuck.... Take care of people.....",
      "created_utc": 1739996307.0,
      "score": 5
    },
    {
      "id": "mdoxdch",
      "body": "I replied because I don’t like being called a liar.\n\nhttps:// ibb.co/75sL0LX\n\nSo now are you gonna say I made up a story just to post the image above?",
      "created_utc": 1740001506.0,
      "score": 3
    },
    {
      "id": "mdosppl",
      "body": "You’re right. I should’ve been an expert at this and handled it exactly the way you would’ve. 🙄",
      "created_utc": 1740000261.0,
      "score": 7
    },
    {
      "id": "mdqqkxb",
      "body": "In my almost four decades on this planet, I can count on one hand the amount of men I've seen instantly tell another men he's in the wrong when he clearly is, much less physically intervene to stop another man from victimizing a woman.\n\nAt 5'3\" as a woman, I've stepped in between man-woman domestic disputes where the guy was going after the woman, before the 6 foot plus dudes stepped in. So yeah, I think building courage to step in is a thing. You can call for help on the street anywhere and people will do nothing--it's called the Bystander Effect--so the NYC location means nothing. If what you're saying is correct, Kitty Genovese would still be alive. I've been to NY many times and my family used to and still do live there, so what you say is very unconvincing to me. I'll believe OP til it's disproven.",
      "created_utc": 1740022284.0,
      "score": 2
    },
    {
      "id": "mdumhdq",
      "body": " you sound suspicious why be mad that the creeps address is known??????????? 🤨 Clearly it would help to file a police report and have some kinda information on him to report him to the police “This happened in NYC for crying out loud, do you know how many people live there?” not one person did a thing but OP and the creep was seconds away from succeeding in his plan. Sounds like your just like the creep and trying to gaslight the experience to pretend these things don’t happen.",
      "created_utc": 1740077794.0,
      "score": 1
    },
    {
      "id": "mdtyvbo",
      "body": "Very true",
      "created_utc": 1740071378.0,
      "score": 1
    },
    {
      "id": "meav02v",
      "body": "Ugh! What friends!",
      "created_utc": 1740291664.0,
      "score": 3
    },
    {
      "id": "mdpkj99",
      "body": "Get a no contact delivery",
      "created_utc": 1740008253.0,
      "score": 40
    },
    {
      "id": "mdpih6f",
      "body": "I use my brother’s account. I guess it could deter potential creeps into thinking my brother’s around and it’s his delivery. Sad though really.",
      "created_utc": 1740007599.0,
      "score": 79
    },
    {
      "id": "mdss290",
      "body": "Change your name to something male and choose no-contact delivery. Wait until they leave to open your door.",
      "created_utc": 1740058547.0,
      "score": 11
    },
    {
      "id": "mdue4q6",
      "body": "No but if he had her info he can let her know what happened.  She likely might not recall and what if the guy returned to her home?  Plus, Uber drivers can be sketchy too.  She might or might not want to know what happened and how she got home.",
      "created_utc": 1740075537.0,
      "score": 1
    },
    {
      "id": "mdwocci",
      "body": "That's America for you.",
      "created_utc": 1740100260.0,
      "score": 2
    },
    {
      "id": "mhbkt0o",
      "body": "You're welcome. I'm glad I was able to help her. 😊",
      "created_utc": 1741746866.0,
      "score": 2
    },
    {
      "id": "mdta3fb",
      "body": "You are very welcome. Check it out on TikTok if you are interested. Plenty on the topic there.",
      "created_utc": 1740064412.0,
      "score": 1
    },
    {
      "id": "mdp2eeh",
      "body": "lol what? Dude why are you doing this when you got this many gullible people giving you props for being a brave savior? Ok sure you have a pic of some cops in a bodega, this automatically proves that you followed some creep to his apartment and then saved the day like some kinda 90s flick? You don’t need to prove anything, you shared your story and I choose not to believe it based on the details you shared. That’s, that. I don’t actually have anything against you, I just don’t believe you and it feels like karma farming to me. People do that on this sub all the time.",
      "created_utc": 1740002878.0,
      "score": -7
    },
    {
      "id": "mdt5t1j",
      "body": "Thanks for missing my point.",
      "created_utc": 1740063131.0,
      "score": 0
    },
    {
      "id": "mdur3dx",
      "body": "You sound like you need to grow up for at least 5 more years before you can try to understand what’s being said and string a sentence together.",
      "created_utc": 1740079062.0,
      "score": -1
    },
    {
      "id": "mdqv288",
      "body": "I use my husband’s. Creeps are too common.",
      "created_utc": 1740023948.0,
      "score": 38
    },
    {
      "id": "meofywt",
      "body": "I understand and agree with that, I was commenting on the \"hoping she never plans on being intoxicated again\" part.  Just because something bad happened while intoxicated does not mean she should abstain from alcohol if she was drunk. If she was drugged I'm sure she didn't intentionally do that especially at a deli.  My previous comment was focusing specifically on the victim blaming part because she was intoxicated.",
      "created_utc": 1740478346.0,
      "score": 1
    },
    {
      "id": "mhbqxt1",
      "body": "I'm glad too. Insanely.",
      "created_utc": 1741749150.0,
      "score": 2
    },
    {
      "id": "mdtx6kr",
      "body": "Ditto and you're welcome 🫡",
      "created_utc": 1740070907.0,
      "score": 1
    },
    {
      "id": "mdsj5qf",
      "body": "I use my husbands name too",
      "created_utc": 1740055110.0,
      "score": 3
    }
  ]
}