{
  "id": "1jtrn1d",
  "title": "I don’t miss my sister, and everyone thinks I’m grieving",
  "selftext": "My sister died a year ago. Drunk driver, middle of the night, gone instantly. She was 24. Beautiful. Kind. Everyone loved her. The golden child. The angel.\n\nAt the funeral, I gave a eulogy. People told me it was moving. They hugged me. Cried on me. Said I was so strong. So brave.\n\nBut here’s the truth I can’t say out loud:\n\nI don’t miss her.\nI don’t even feel sad.\nIf anything… I feel free.\n\nMy sister made my life hell. No one saw it. Not our parents, not her friends, not the teachers who adored her. She wore sweetness like armor. Like a weapon. But behind closed doors? She made me feel like nothing. Picked me apart. Made fun of my body. Told me I was stupid, weird, a burden.\n\nShe once convinced me to tell her my biggest fear just so she could use it against me later in front of people I liked. She said I was “too sensitive.” She laughed when I cried. Called me “the backup kid.” Said if I died first, she’d wear red to my funeral “because black’s too boring.”\n\nI tried to tell people. Once. They didn’t believe me. Said she was just teasing. That she loved me. That I was imagining things.\n\nSo I shut up. Let the lie live. Let her be the saint.\n\nAnd now she’s gone. And I pretend to be broken. I let people think I’m devastated. But the truth is, I sleep better. I breathe easier. There’s a quiet in my life that I never had before.\n\nAnd I hate myself for feeling this way.\nBut I don’t wish she were still here.\n\nAnd I don’t think I ever did.\n\nEDIT: I just wanted to thank everyone for the support. I really appreciate it. All the comments have helped me out a lot.",
  "created_utc": 1744048548.0,
  "score": 5967,
  "num_comments": 164,
  "url": "https://www.reddit.com/r/offmychest/comments/1jtrn1d/i_dont_miss_my_sister_and_everyone_thinks_im/",
  "comments": [
    {
      "id": "mlwgl2j",
      "body": "I get it.  It's okay.  Just change the subject and refuse to engage when they bring her up, even with your parents.  If they push, just say everyone processes things differently and I don't want to talk about it.\n\nLet them think whatever they want, and fly.   \n\nHugs to you.",
      "created_utc": 1744049220.0,
      "score": 2680
    },
    {
      "id": "mlwf6qj",
      "body": "You’re not an AH for not missing your abuser.",
      "created_utc": 1744048794.0,
      "score": 3192
    },
    {
      "id": "mlwhcwd",
      "body": "I think you should quietly seek therapy to heal the wounds she left behind. The relief you are feeling sounds very normal and valid, but the damage she did to your soul is still there and you deserve a chance to heal that.",
      "created_utc": 1744049455.0,
      "score": 1007
    },
    {
      "id": "mlx6nfx",
      "body": "I went through something a little similar when my dad died a year ago. \n\nHe was a pillar of the community. So many people showed up at his memorial service and talked about how he helped them, supported them, made them feel valued, turned their lives around. \n\nIronically, even people whose lives he touched when they were in jail for domestic violence and he inspired them to change (he was a mental health specialist in the county jail). \n\nBut at home? He was a wife beater and a child abuser. \n\nI was prepared to just keep my fucking mouth shut at his memorial service, which I only went to to support my mom. Someone commented to me after that they knew we had a complicated relationship and he wasn’t really there for me, and I just couldn’t keep up the ruse. I said no, he was there for me, the problem was he was abusive. So then they tried to excuse it with oh, that’s unfortunate but Vietnam really damaged people and—- and I cut them off and said he was beating my mother before he ever went to Vietnam, and that while I’m sure his war experience didn’t help anything it wasn’t an excuse either. \n\nThey finally shut the F up.",
      "created_utc": 1744057276.0,
      "score": 156
    },
    {
      "id": "mlwkmxe",
      "body": "Babe, do not hate yourself.\n\nMy Aunt was horrifically abusive to me. Sometimes she was good, but, she was pretty freaking deranged.\n\nSo when she died, it was SUCH A RELIEF.\n\nI did cry and grieve the good things...but for the most part, it was just me being thankful, and being in pain because I was grieving what COULD have been.\n\nWhat I WISHED had been.\n\nMy Mom asked if I could ever forgive her and I honestly told her no, my aunt never showed an ounce of remorse. Forgiveness is for people who decide to change and make sure they do something about it, not people who gave no shits about the consequences.\n\nSo don't feel bad.\n\nWhat you feel is valid. What you feel is NORMAL.\n\nDon't hate yourself for being thankful the pain has stopped and things will get better now...",
      "created_utc": 1744050458.0,
      "score": 290
    },
    {
      "id": "mlwoath",
      "body": "I think we should normalize speaking ill of the dead. OP don't feel a bit of guilt she might have been loved by some but she made your life hell. I'm very willing to bet you were not the only one.",
      "created_utc": 1744051586.0,
      "score": 126
    },
    {
      "id": "mlwsjvx",
      "body": "I talked to my therapist about feeling relief after my mom and sister died. There's nothing wrong with feeling relief that you don't have to face that person any longer. You don't have to be devastated by that death.",
      "created_utc": 1744052891.0,
      "score": 55
    },
    {
      "id": "mlwgccv",
      "body": "Ohmygosh like seriously, I can't imagine dealing with that kind of toxic crap from a family member! Your sister sounds like a total nightmare and honestly... good riddance girl, you got rid of the worst part of your life",
      "created_utc": 1744049147.0,
      "score": 90
    },
    {
      "id": "mlwz4mn",
      "body": "She left you with nothing to miss. Thats not your fault.",
      "created_utc": 1744054948.0,
      "score": 42
    },
    {
      "id": "mlwmte4",
      "body": "I hope you wore red lipstick to deliver that eulogy. No one else would know. But you would.",
      "created_utc": 1744051136.0,
      "score": 75
    },
    {
      "id": "mlwkaj1",
      "body": "Nta. She bullied and abused you. So don't hate yourself for feeling like this.",
      "created_utc": 1744050354.0,
      "score": 39
    },
    {
      "id": "mlwl42x",
      "body": "I would recommend you ask your parents if they could help you get therapy.  They'll assume it's because of your sister's death, but really the goal would be to come to terms with her emotional abuse and manipulation.  \n\nLet people believe what they want to believe.  You are unlikely to convince anyone what she was like behind closed doors now that she's dead.  If people bring it up, just tell them that talking about it is still painful.  At important dates, ask your parents not to bring up your sister because you \"want to focus on the positives, and not lose your composure.\"  Hopefully time and distance will grant you some perspective.",
      "created_utc": 1744050604.0,
      "score": 32
    },
    {
      "id": "mlwk3bc",
      "body": "Girl... I can't even imagine how messed up this must've been for you. Losing a sibling, but also dealing with the emotional baggage of an abusive relationship? That's like, not something I could ever go through (obviously, since I'm just a woman and we don't have drama like that), but I feel for ya. My cousin went through some crazy stuff with his sister, always calling him names and treating him like crap... until one day she just vanished without a word. He was devastated at first, but looking back, he realized how much happier life is now without her toxic presence. So yeah, I get why you don't miss your sis even though it's weird to say out loud. It's like... relief? Gah, I'm no expert, just saying what my cousin said makes sense, ya know?",
      "created_utc": 1744050293.0,
      "score": 19
    },
    {
      "id": "mlwy0bn",
      "body": "It's perfectly fine not to mourn someone who has been nothing but awful to you your entire life. Not even if she's blood related.",
      "created_utc": 1744054600.0,
      "score": 19
    },
    {
      "id": "mlxcnw1",
      "body": "Her behaviour was typical of abusers. The good ones are wonderful people in public and nasty to a select one or two people in private\n\nAs others have said, please see a therapist ASAP the sooner you get started on dealing with your abuse, the better off you’ll be in the long run\n\nYour reaction, or lack there of is normal for victims of abuse\n\nAnd I’m sorry your family didn’t believe you or thought you were over reacting to simple teasing from a sibling",
      "created_utc": 1744059129.0,
      "score": 19
    },
    {
      "id": "mlx7mu5",
      "body": "Some people don’t deserve to be missed. I don’t miss my mother. She’s been dead for 5 years now and I don’t care. When people hear that she’s gone they tell me how sorry they are, how wonderful she was, and I thank them and agree all the while thinking ‘you didn’t know the real her.’ She was cruel and narcissistic and I’m glad she’s gone",
      "created_utc": 1744057581.0,
      "score": 15
    },
    {
      "id": "mlx1x99",
      "body": "Honestly, I can relate.\n\nMy grandfather was similar. He criticized me a lot. Always reminded me that I need to be more, do more. Work more. Try harder.\nWhen I admitted my struggles to him, he looked me dead in the face and said it was all bullshit.\nHe scoffed when I would explain how hard things were for me. (I have a myriad of mental health issues. And I'm deemed disabled due to it.)\n\nI've never been able to accomplish the things my aunt has. I've never had anything of my own. Never been able to work for long. And I struggle every day and suffer a lot.\n\nHe was diagnosed with pancreatic cancer in Nov of last year. \nOn his deathbed last month he said \"when I'm gone, someone else will be bearing your burdens\"\n\nHe passed last month. My relatives are shattered and devastated. But it doesn't bother me. Like you, it's one less thing I have to deal with. I feel lighter bc its no longer hanging over me. I'm not grieving.",
      "created_utc": 1744055810.0,
      "score": 13
    },
    {
      "id": "mlxigio",
      "body": "Don’t feel bad about not missing someone who abused you. \n\nBut don’t pretend you’re grieving for anyone’s sake. Life your life free from her crap.",
      "created_utc": 1744060992.0,
      "score": 13
    },
    {
      "id": "mlz3iih",
      "body": "It's a thing about abusers.\n\nThey are wonderful, charismatic, and kind people.\nMy adopted mother was fantastic. She was funny, generous with her time, and helper to those in need.  People adored her.\n\nBehind closed doors. She was cruel, manipulative, and violent. Her job was to break me and believe me , she did.\n\nWhen she died, everyone was sad and so upset. I was pissed and relieved at the same time.  I was confused because of how I felt also.\n\nIt's ok to feel the way you do. Others may never understand because that's how she wore her mask.\n\nI'm sorry you went through this . I am glad you are doing well.",
      "created_utc": 1744081366.0,
      "score": 11
    },
    {
      "id": "mlxy1ac",
      "body": "She sounds so much like my older brother in the way she treated you. My older brother’s still alive but he’s already 100% dead to me.",
      "created_utc": 1744066276.0,
      "score": 10
    },
    {
      "id": "mly19yu",
      "body": "My sister died 30 months ago. Shinedowns \"Bully\" and Boboflex \"I'm glad you're dead\" we're the songs I played the days after her death. \n\nI can't say I don't miss my sister. But I can say I understand.",
      "created_utc": 1744067374.0,
      "score": 10
    },
    {
      "id": "mlwt458",
      "body": "It's so important to acknowledge that while family ties are significant, they don't obligate us to endure mistreatment. It makes perfect sense that if someone who wasn't your sister had acted this way, you would have naturally created space for your own well-being. Growing up together meant you were in a situation where you had to navigate her hateful behavior for a long time, which must have been incredibly painful.\n\nNow, you have the chance to move forward and create a life that feels truly good for you. I sincerely hope you can open yourself to the positive experiences that await and recognize that any guilt you feel might be a lingering effect of your sister's bad intentions. I encourage you to find your inner strength and take back the joy that you deserve.",
      "created_utc": 1744053068.0,
      "score": 8
    },
    {
      "id": "mlwya1n",
      "body": "Don't hate yourself. Go be free! 100% free. No guilt. No hate. Move away if you need to.",
      "created_utc": 1744054684.0,
      "score": 7
    },
    {
      "id": "mm3kylg",
      "body": "Makes sense. I wouldn’t miss anyone who treated me horribly either, family or not. \nYou’re not bad for feeling this way. ",
      "created_utc": 1744145048.0,
      "score": 7
    },
    {
      "id": "mlxlt1x",
      "body": "As a sister to one who mentally abused me for years, I totally feel you. Mine's not dead literally, just to me since last year and it's been so nice not having to deal with her.",
      "created_utc": 1744062094.0,
      "score": 8
    },
    {
      "id": "mly1ruw",
      "body": "I am glad my Dad died so I feel you! Breathe easier knowing you are not alone in these feelings. Enjoy the freedom and try to do something that would make her roll. Now live!",
      "created_utc": 1744067544.0,
      "score": 7
    },
    {
      "id": "mlzcp9e",
      "body": "She sounds narcissistic or very toxic and can understand if that’s the case.",
      "created_utc": 1744085281.0,
      "score": 7
    },
    {
      "id": "mlzi1ri",
      "body": "My sister is still alive and I went no contact with her. That also meant no contact with my niece and nephew who I love very much. It meant that much to me that I had to give up those two kiddos. Worth it. I think I would feel similar to you if she passed. \n\nI say all of this to acknowledge that the situation you are in sucks, it shouldn’t be this way between people, and I’m sorry that you feel hate for yourself for feeling like this. What happened to you should have never happened.",
      "created_utc": 1744087893.0,
      "score": 7
    },
    {
      "id": "mm0qs5q",
      "body": "I can relate to this so much. I also grew up with an elder sibling who ridiculed me, beat me, and made fun of me in front of others all the time for no reason. Growing up with a bully is hard, especially when you share a house with that bully and the bully is also the favourite kid. I couldn't tell anyone how relieved I was when he moved out of the house. He visits our family home every once in a while, and whenever he does, my anxiety soars up immediately, and I try to avoid him as much as possible. I can't wait to get out of this home forever. Your feelings are justified. Some people are just shit. Death can't excuse the awful things they did when they were alive.",
      "created_utc": 1744113621.0,
      "score": 7
    },
    {
      "id": "mm1jh0l",
      "body": "i hear ya. signing my mom’s DNR was the most relief i’ve ever had.. it was over. finally. \nshe died 16 years ago.. i finally visited her grave last fall for the first time. it’s scary to verbally admit it, but it’s been so much nicer. she was an alcoholic and drug addict my whole life. i always worried about her killing someone with her drunk driving. \nnow, i sleep better, and don’t panic everytime the news alerts me of local drunk driving fatalities.",
      "created_utc": 1744123676.0,
      "score": 7
    },
    {
      "id": "mlxriji",
      "body": "I think more people should express feelings like this. So many believe you can’t speak ill of the dead but if not then, then when?! If it couldn’t be said prior it should DEFINITELY be said post.",
      "created_utc": 1744064014.0,
      "score": 5
    },
    {
      "id": "mlxvn60",
      "body": "She sounds like one of my siblings that would do the same shit to me (I'm no contact with them).\n\nLet people think what they want. I'm happy you're free.",
      "created_utc": 1744065452.0,
      "score": 6
    },
    {
      "id": "mly8zk1",
      "body": "Well congrats. Your feelings are valid.",
      "created_utc": 1744070062.0,
      "score": 7
    },
    {
      "id": "mlyli50",
      "body": "NTA. Fucking narcissists",
      "created_utc": 1744074632.0,
      "score": 7
    },
    {
      "id": "mlytm83",
      "body": "My brother has been my silent abuser for our entire lives. We’re both in our 40’s now and it’s never gotten better. I’ve learned to be stoic around him or be overly accommodating just to avoid the abuse. But everyone in our lives only sees it as “normal sibling rivalry.” When we were younger he was also physically abusive and I was always terrified of him. Now we have kids and live close but he makes zero effort to be in my life, and I have learned to look at this as a blessing. You aren’t wrong for your feelings or a bad person. She was abusive to you and it makes perfect sense that you feel relieved. ❤️",
      "created_utc": 1744077582.0,
      "score": 7
    },
    {
      "id": "mm0em0l",
      "body": "I totally hear and validate you. My sister was unnecessarily cruel throughout my entire childhood. My parents wouldn’t listen but one teacher and my friends believed me. She hasn’t died but we’ve been estranged for 8 years and everything you’ve described resonates. I’m sorry you suffered and I’m pleased you have peace.",
      "created_utc": 1744107666.0,
      "score": 6
    },
    {
      "id": "mm0rqoi",
      "body": "You grieved her a long time ago. When she wasn't the sister she could have been.",
      "created_utc": 1744114023.0,
      "score": 5
    },
    {
      "id": "mlxbizf",
      "body": "I’m just wondering why you didn’t own that red outfit she bragged about at her funeral lol.",
      "created_utc": 1744058774.0,
      "score": 6
    },
    {
      "id": "mly903e",
      "body": "Oh this is how I feel about someone right now. I wish they were gone. Everyone thinks they are sweet mousy an nice. Nope they are the most evil person I’ve ever met.",
      "created_utc": 1744070068.0,
      "score": 5
    },
    {
      "id": "mlyki0r",
      "body": "It is not your fault. It is only natural to feel this way after all that happened.\n\nMissing being bullied? Missing being vulnerable? Missing being scared? This things shouldn't be missed. Too bad that they even were there at all. It is only natural to not miss being abused, turned down, even played down. \n\nDon't blame yourself for not feeling remorse, sadness, devastation, as it is your sister's doing, not your own. Seems like you didn't feel being treated fairly, so why mourn her?\n\nYou are wonderful. No matter, what others think of you.",
      "created_utc": 1744074261.0,
      "score": 5
    },
    {
      "id": "mlymym9",
      "body": "I can't be the only who thinks this looks like ChatGPT wrote it..",
      "created_utc": 1744075166.0,
      "score": 5
    },
    {
      "id": "mlzdm2l",
      "body": "Oh honey! You experienced textbook narcissism from your sister. Rage against it. It is healthy for you. I’m sorry you dealt with this. Don’t feel guilty for the loss of your sister. She was a bully, not a sister.",
      "created_utc": 1744085707.0,
      "score": 5
    },
    {
      "id": "mlzfk2t",
      "body": "Hey, don’t feel bad. That sounds like an incredibly toxic person and relationship that destiny has now freed you from. You are ok to breathe and to smile. You’re free. Enjoy the moment. You are allowed. Your sister sounds like she may have been a sociopath. You sound like a genuinely good person. I’m sorry for the loss of good times that you didn’t have on account of her tyranny. You didn’t deserve that.",
      "created_utc": 1744086647.0,
      "score": 4
    },
    {
      "id": "mlzmb47",
      "body": "How old are you compared to her ?",
      "created_utc": 1744090156.0,
      "score": 5
    },
    {
      "id": "mm08ove",
      "body": "I get it. I’m glad there is no chance that your sister can bully you anymore. You are free. I’m rooting for you to thrive. \n\nThe only sibling my parents didn’t kick out as a teen was the one who bullied me through my whole childhood, As much as I complain about my parents, this sibling still fills me with dread and was able to get away with everything. I still am working through resentment towards my parents for not protecting me.",
      "created_utc": 1744103997.0,
      "score": 5
    },
    {
      "id": "mm0w1s7",
      "body": "There was a video I saw once where I woman was left with a young child, bc her husband died. She found out from her very young child that while he was alive he was drinking and driving and told his little son \" not to tell mom\". She found this information after he died and had to take the child to therapy, bc the child stated that all those times \"daddy drank and drove scared him for his life\". Sometimes it's hard to respect people doesn't matter if they are alive or dead. Some people cause so much damage in life, no one should be expected to baby them even in death. I know a few ppl with family members that have passed and are not missed or no one went to their funeral simply bc of how terrible of human they were to everyone while alive.",
      "created_utc": 1744115774.0,
      "score": 4
    },
    {
      "id": "mm1zpg8",
      "body": "Very random, but you write beautifully 💓 \n\nAlso, life is complicated and it’s not like a recipe book, no matter how much people would like it to be. It’s okay for you to feel this way and it’s also okay for that feeling to evolve through time. It’ll also be okay for you to love your life to the fullest. \n\nIt’s really good right now is that you’re introspective and self aware; big life events and feelings like this need to be understood and processed properly so you can heal what you need and move on.\n\nAll the best. And keep writing (other than Reddit posts as well)!!!",
      "created_utc": 1744128491.0,
      "score": 4
    },
    {
      "id": "mm2wygz",
      "body": "A guy that so many people loved died in my small town, hes portrayed as such a great guy, but i have the nastiest messages from him. I never met him and he used to send me hateful things. I still have the messages. He was a bully",
      "created_utc": 1744138083.0,
      "score": 5
    },
    {
      "id": "mlx8zmb",
      "body": "I can 100% relate. \n\nAll the very best.",
      "created_utc": 1744057993.0,
      "score": 4
    },
    {
      "id": "mm08bip",
      "body": "My sister is the golden child too, so that made me the black sheep. Recently I heard another name for it, black butterfly. Fly free butterfly.",
      "created_utc": 1744103754.0,
      "score": 3
    },
    {
      "id": "mlxbpls",
      "body": "I hope you wore red to her funeral.",
      "created_utc": 1744058831.0,
      "score": 7
    },
    {
      "id": "mlyqz3o",
      "body": "The feelings we have after death of someone near us are more complicated than people let on. My grandma died last year, over 100, and I know my mom was relieved. But I know she felt bad about it, and didn’t want anyone to know. I knew, and tried to let her know I didn’t think less of her for it.\n\nIf you can find someone to talk to about it, it helps",
      "created_utc": 1744076621.0,
      "score": 3
    },
    {
      "id": "mlz0rsq",
      "body": "Thank you for writing this. I can’t tell you how hard I relate.",
      "created_utc": 1744080276.0,
      "score": 3
    },
    {
      "id": "mlzlgub",
      "body": "Grief is complicated. It doesn’t look the way it does in the movies; it could hit you at a time when you least expect it, or not at all. My dad died 20 years ago. We had a complicated relationship, and I focused on helping my mom get settled. I still haven’t cried, and I don’t think I will. As long as you are taking care of yourself, feel how you feel.",
      "created_utc": 1744089693.0,
      "score": 3
    },
    {
      "id": "mlzm1la",
      "body": "I had to make amends with My older brother, to make My Mom feel better. Don't judge My Mom, she was in bad Health, and I did it to make her feel better. Mom was gone for several years when my brother died. I didn't go to His funeral, nor did I have anything good to say about Him.  I hated/loved My brother, but he was the ONE, not Me. So I just avoid the subject when I talk to His wife, and kids.",
      "created_utc": 1744090009.0,
      "score": 3
    },
    {
      "id": "mm0iy75",
      "body": "why do people feel this need to hate yourself for being yourself? if you don't feel bad for her death, it is not a sin or crime you know? unless you're the one that cut her breaks, you did and are dooing -nothing wrong-. you are entitled to your feelings, if you don't love her or miss her, good. Even if she was a saint for you, even if she protected and cherished you, and you didn't miss her, its all right. No one can force you to feel. Your head is your realm.  \n  \nand you're just following life's social protocol that you will get grinded in stone if you don't follow. smart kid. keep up. you're dooing great. stop feeling guilty, you dont need that! just live your life, try to be a good person, pay your bills and take care of yourself and your business in life, and that is fine.\n\nbreath, kido, it is allright.",
      "created_utc": 1744109998.0,
      "score": 3
    },
    {
      "id": "mm11pub",
      "body": "Please do not hate yourself. Easier said than done, lots of self work and therapy may be needed to heal those old wounds and deep hurt. \n\nI can relate - at some point you just start to feel numb to the idea of that person and you emotionally remove yourself. That’s ok, you are protecting yourself and your emotions from getting hurt. Sending lots of hugs and peace your way. Your grief is not required for anyone!!",
      "created_utc": 1744117873.0,
      "score": 3
    },
    {
      "id": "mm1sso1",
      "body": "She made it her mission to make you feel like less of a person.  Your feelings are valid.  Do not hate yourself.",
      "created_utc": 1744126446.0,
      "score": 3
    },
    {
      "id": "mm36453",
      "body": "Just saying, but consider therapy to work through all of this. You were gaslit by her growing up, and it takes time to unpick a lot of the harm that was done on an insidious level, drip by constant drip. \n\nAs long as you can accept her being sanctified by all your family members then I suggest you don't share the torment you suffered, and just remain 'stoical' in your grief. Counselling/therapy can be interpreted by family in whatsoever way they like but you don't need to divulge - and should not divulge - what is said within the privilege of the session. \n\nGolden children will always be viewed as such no matter what their behaviour actually is. You can't win, especially due to her passing. Just live your best life and know that you know the truth but that she can no longer directly hurt you.",
      "created_utc": 1744140826.0,
      "score": 3
    },
    {
      "id": "mm3i32i",
      "body": "Went through the same thing with my father as soon as he passed i cried and everyone thought it was through grief but it was through massive relief like a weight had been lifted off my shoulders.\nAnytime anyone mentions I'm I try not to respond or sure smile and nod no point in causing issues when he's dead now but I did go to therapy to talk about it and it was a great help.\nThis is going to sound weird to people that don't understand but I'm happy for you and hope you get to move on with your life.",
      "created_utc": 1744144249.0,
      "score": 3
    },
    {
      "id": "mm6kmya",
      "body": "I've heard the saying many times, but I think it is especially applicable here: the best revenge is a life well lived. Don't blame yourself for these feelings, they are yours and they are valid. You sister sounds aweful and this life you lived sounds lonely. It may not be the ideal way for this to have happened, but I'm glad you get to be free.\n\nIf it's possible for you, I would look into finding a therapist, just to have a neutral party not involved in either of your lives to talk about it all. It's very helpful in my experience.",
      "created_utc": 1744189826.0,
      "score": 3
    },
    {
      "id": "mlwteih",
      "body": "She sounds like a narcissist",
      "created_utc": 1744053160.0,
      "score": 7
    },
    {
      "id": "mlyzmij",
      "body": "Please tell me you wore red to her funeral.",
      "created_utc": 1744079834.0,
      "score": 3
    },
    {
      "id": "mly5ygw",
      "body": "It’s completely understandable. Let yourself off the hook.",
      "created_utc": 1744068995.0,
      "score": 2
    },
    {
      "id": "mlychfm",
      "body": "You don't need to pretend. People bring it up less over time. You're under no obligation to act counter to how you feel. If people don't understand you, it's their problem. Of course, if the facade is sometimes necessary, then do whatever is necessary.",
      "created_utc": 1744071326.0,
      "score": 2
    },
    {
      "id": "mlyf2wb",
      "body": "I really needed to read this post. I've been feeling guilty for feeling freedom by the passing of some people in my life and now I don't feel alone. Thank you",
      "created_utc": 1744072281.0,
      "score": 2
    },
    {
      "id": "mlyiirf",
      "body": "I also feel this way about my only sibling (younger). Except they are dying from a terminal disease which seems to be taking its sweet time, over 10 years. Nobody can see how manipulative they have been, how horrible they have been, and how they believe they are the victim and everyone believes them. \nI don't want them to suffer, because I am not a horrible person I wish they would pass away peacefully in their sleep. For my parents sake as well \n\nBut like you, I won't miss them. I've already grieved the sibling I wish I had. This is just someone I happen to know. \n\nAlso I am older and am well into my \"No fucks to give\" Era so I really don't care what people think. \n             \n\nBe free, live your best life. You know she's going to be so pissed looking up/down at you seeing you thriving.",
      "created_utc": 1744073529.0,
      "score": 2
    },
    {
      "id": "mlyqok4",
      "body": "Don't hate anything about your feelings. While I won't say I'm glad she's gone, I will say I'm glad that you don't have to deal with that abusive behavior anymore. I'll leave it at that and wish you a bright future.",
      "created_utc": 1744076514.0,
      "score": 2
    },
    {
      "id": "mlyre35",
      "body": "YOUR FEELINGS ARE VALID!!!! YOUR FEELINGS ARE YOUR OWN, AND NO ONE GETS TO TELL YOU DIFFERENTLY! ( My apologies for yelling, but I wanted to drive the point home.)\n\nYou were abused, ignored, bullied, and left to live a lie. That is absolutely horrendous, but you're free of that now. YOU get to decide how to move forward. (I suggest therapy. It's helping me tons with a similar issue, but it was a parent.) You don't owe telling anyone how YOU feel.\n\nFeel your feelings. You have nothing to mourn. LIVE your life starting NOW.",
      "created_utc": 1744076775.0,
      "score": 2
    },
    {
      "id": "mlyrknl",
      "body": "This is understandable. Your feelings are absolutely valid. I’m sorry for what you went through. I’ve personally thought about this this too: How would I feel when my stepfather passes? The first answer that comes to mind is relieved. I would feel relaxed and at ease. I would feel reassured that my mum is safe. He is not a good person, he is physically and emotionally abusive. Filled with hate and rage. There has been multiple accounts of domestic violence and nobody knows except me and my siblings. You aren’t alone with how you feel, it is understandable. I hope you’re doing okay.",
      "created_utc": 1744076841.0,
      "score": 2
    },
    {
      "id": "mlywj6c",
      "body": "I'm glad you're free.\nHugs.\nTry to let the feelings of guilt go, they're just feelings.",
      "created_utc": 1744078659.0,
      "score": 2
    },
    {
      "id": "mlz628i",
      "body": "Karma has a way of dealing with us all. Good and bad.",
      "created_utc": 1744082388.0,
      "score": 2
    },
    {
      "id": "mlz6suj",
      "body": "I hope you wore red to hers",
      "created_utc": 1744082692.0,
      "score": 2
    },
    {
      "id": "mlz9reb",
      "body": "This is an amazing post. I’m so fascinated. Thanks for sharing!",
      "created_utc": 1744083958.0,
      "score": 2
    },
    {
      "id": "mlzfzt4",
      "body": "Drunk driver actually hit the right person for once.",
      "created_utc": 1744086864.0,
      "score": 2
    },
    {
      "id": "mlzyhpq",
      "body": "Congrats 🎉🍾🥳 you are free and a horrible human being is gone! No need to be sad or angry with yourself. F that! What I’d suggest is seeking therapy to heal. Heal from the abuse she did to you and the abandonment of everyone around you when you needed them. You got this bud! You will be alright :)",
      "created_utc": 1744097172.0,
      "score": 2
    },
    {
      "id": "mm04mtf",
      "body": "That was not your sister but an absolute demon. I’m happy you are finally getting the relief and peace of mind you deserve",
      "created_utc": 1744101285.0,
      "score": 2
    },
    {
      "id": "mm07i0h",
      "body": "Don’t hate yourself. That is completely understandable and relatable.",
      "created_utc": 1744103212.0,
      "score": 2
    },
    {
      "id": "mm21iko",
      "body": "I feel the same about my father. I acted sad, I said the right things, I “grieved”, but in reality I feel so free. Finally free.",
      "created_utc": 1744129034.0,
      "score": 2
    },
    {
      "id": "mm301q4",
      "body": "I feel the same way but towards my Mom. She passed a few months ago and I am numb to it. She was loved by the community as she volunteered and raised money for different non profits, etc. \n\nBehind closed doors she constantly belittled me and my son. She turned people against me by playing victim. The nail in the coffin (no pun intended) was when I found out that she left money for my niece and not my son. To her dying day, she loathed my son for no other reason than she was jealous that I loved him more than I loved her.",
      "created_utc": 1744139004.0,
      "score": 2
    },
    {
      "id": "mm4mesp",
      "body": "God damn",
      "created_utc": 1744157220.0,
      "score": 2
    },
    {
      "id": "mm4pt1v",
      "body": "Please give yourself grace. \n\nDo you have access to mental health support or positive people in your life you can lean on?\n\nFeelings are not right or wrong, good or bad. They just are, and you need to allow yourself to feel your feelings without shame and then move on to doing constructive things to heal yourself in a positive way.\n\nYou matter, you are enough and you are loved.\n\nI wish you all the unconditional love, happiness, good health and positivity!",
      "created_utc": 1744158422.0,
      "score": 2
    },
    {
      "id": "mm5t06t",
      "body": "This makes me think of the song “Requiem” from Dear Evan Hansen.\n\nThe sister of a young man that died sings about how she can’t pretend to be broken-hearted that her abusive brother is gone.\n*“When the villains fall, the kingdoms never weep”*",
      "created_utc": 1744173437.0,
      "score": 2
    },
    {
      "id": "mm5tzor",
      "body": "I hope you wore red to *her* funeral!\n\nNo, but for real, of course you don't feel sad. When someone drags you down repeatedly like that, they are *not* your friend. Your sister was a bully. You have every right not to feel sad about her death, but to, in fact, feel free.\n\nDon't feel bad about not feeling bad. She sounds like she sucked as a person.",
      "created_utc": 1744173917.0,
      "score": 2
    },
    {
      "id": "mmdnlm4",
      "body": "I think you possibly need to grieve the relationship you should have had with your sister. \n\n\nOther than that, it's obviously not going to go down well with the family and friends if you start telling them how it really was, but it's not helping to bottle things up.\n\n\nCould you, perhaps, write these feelings down and then burn or bury the paper? It might seem dated these days, but the old ways still work and at least things aren't forever on the Internet to come back and haunt you in the future.\n\n\nI wonder if there isn't at least one other person out there that she treated, if not as badly as you, then certainly unkindly, and is also having to keep quiet. Don't approach anyone yet, but give it some consideration.\n \nTake care of yourself.",
      "created_utc": 1744288983.0,
      "score": 2
    },
    {
      "id": "mlyfv46",
      "body": "Big Hugs. I hope you continue to enjoy your newfound peace.",
      "created_utc": 1744072568.0,
      "score": 1
    },
    {
      "id": "mlyibpp",
      "body": "Live the best life you can.",
      "created_utc": 1744073458.0,
      "score": 1
    },
    {
      "id": "mlynm4h",
      "body": "You deserve to be free. Therapy might help you to process your feelings tho but they are valid and your not a monster for having them.",
      "created_utc": 1744075403.0,
      "score": 1
    },
    {
      "id": "mmaqbd0",
      "body": "We always think that any kind of a death is a bad thing but times (it is hard to say it but ) it is a blessing. I thanked the God that my cousins finance was in a car crash and yeah gone in an instant. We later learned who he really was and my cousin had no idea about it . I really believe that the God (if there is ) saved her from that man. I’m sorry for his family and their loss. Also I’m thankful about my cousin. \nSometimes it is for a better cause \nMaybe just like you did here you could go to a therapist and it would also help to feel better with your feelings toward your late sister and what is left inside you. It may be better to find a therapist that doesn’t have a link to your parents. \nWho knows maybe one day your family will be ready to hear the truth about your relationship with your sister. I think parents can see their children in their their true form, it is just sometimes they do not wish to see the hard truth and prefer that everything is alright. I don’t know if that is the case or not. I hope one they will be ready to see your truth as well \nAnd please love yourself and take care too\nWe are all valuable sooo much okey love \nEven if she wasn’t any good to you a loss is a loss so my condolences to you and your family \nTo a better brighter future :)",
      "created_utc": 1744240221.0,
      "score": 1
    },
    {
      "id": "mmgkpyu",
      "body": "Honestly, if I was you in this situation, I'd immediately start talking sh\\*t about her. Sure, I'd probably get disowned in the process, but considering no had believed you when try to speak up about her, I think it wouldn't really matter to much me.\n\nBut, then again, I guess that just makes you a better person than me. Family as a concept doesn't really matter much to me personally at this point of my life, though I think that's no fault to either me or my bio-fam.\n\nWhat I'm trying to say is, your sister treated you like sh\\*t and didn't feel like family, so she shouldn't matter to you. But the people that tried to console you in the wake of her death probably matter so much more to you than what your sister ever would.",
      "created_utc": 1744320687.0,
      "score": 1
    },
    {
      "id": "mmjcqsy",
      "body": "I have similar issues with my parents.  Hatred is too nice of a word.  They pretend to be Christians at church and then once they get home are the two most miserable old farts I've ever met.  Because of this my sister doesn't understand what I mean when I look at my father and tell her I can't wait.\nSo I get it.  ",
      "created_utc": 1744365400.0,
      "score": 1
    },
    {
      "id": "mmjwl0v",
      "body": "Yeah, you’re at no fault here. you have no reason to miss her.",
      "created_utc": 1744374799.0,
      "score": 1
    },
    {
      "id": "mmpjc22",
      "body": "Is this a confession?",
      "created_utc": 1744451527.0,
      "score": 1
    },
    {
      "id": "mmv66yi",
      "body": "Don't hate yourself! You have EVERY RIGHT to how you feel. Let others think what they want. If you are 'at peace' with yourself that's good enough for me. ",
      "created_utc": 1744532216.0,
      "score": 1
    },
    {
      "id": "mmv8gwm",
      "body": "I am very late to the party and Im here to drop a controversial take, but try to bear with me. \n\nNow that she’s gone, you’re also free to see her as who she truly was: a broken human being like all of us. She built that armor to protect herself from her own traumas and any pain she faced in her own life. For some reason she felt safe taking it all out on you. \n\nYour feelings are valid and kind of natural given the situation, but burying and trying to forget a relationship so close and significant never ends well. Take your time, feel it all. Just don’t run away from the pain of truth as it will eventually catch on to you. \n\nIt feels unfair that she left you with the tedious task of figuring out how to love and forgive her without having her around for it, but you’ll get there if you try. You can’t yell at her now and tell her how horrible she is, that’s unfair! But that’s life for us man, love will always be a choice. \n\nYou’ll get there, my friend. I know it. Sorry if anything I said comes off as insensitive, I’m only trying to help.",
      "created_utc": 1744533698.0,
      "score": 1
    },
    {
      "id": "mmyq9b7",
      "body": "I totally get it. My sister is alive, but, if she were to die I would feel \"free\" like you said. We are old now but she still plays the same games, the silent treatment when you don't know what you've done, playing the victim whenever she can. She inherited almost 1 million dollars in insurance money when her husband died and blew it in a couple years. She lives for free at our dad's house. We are supposed to split the house when he dies but whoever lives there gets to stay. She moved in, then her daughter, her daughter's BF, and now her granddaughter. None of them offer our dad a penny ... he's not wealthy and retired ys ago.",
      "created_utc": 1744580863.0,
      "score": 1
    },
    {
      "id": "mmz0iur",
      "body": "just coz they're family, doesn't mean you have to love them.  i have cut off at least 95% of my blood relations.\n\nrejoice in your freedom",
      "created_utc": 1744584412.0,
      "score": 1
    },
    {
      "id": "mn1rig3",
      "body": "It's ok, OP. I am sorry for all of the pain your sister caused for you, the cruelty she inflicted on you. \n\nI am reminded of when my father died; he was cruel at times, cold and distant, using the \"silent treatment\" when he was the one who should apologize! He was physically abusive, as punishments, when I was growing up, even beating me with a wooden cutting board once. I guess the hair brush wasn't handy! Or the belt! \n\nWhen he died, I felt so much relief; I was a fully grown, married mother, with an amazing husband. I had moved away but my parents moved 1,000 miles to be near me because of their love for my daughter, their grandchild. \n\nBecause of my sweet mother it was hard to be NC. She wasn't aware of most of the beatings, the worst ones, because she was at work. He was always home 2-3 hours before her. I never told her until after his death. She was so sorry, but she didn't do it... he did. He never once apologized, ever. He never once told me he loved me. Ever. I was in my 50s when my older sister helped me stop trying to win his approval. She had \"escaped\" six years before I did. \n\n He was well loved and charming to outsiders, but behind closed doors he treated his family the opposite. He was a narcissist, and he was a very different person behind closed doors; outsiders saw a kind, caring, funny, good man. I walked on eggshells, in fear of upsetting him, not wanting to be hit. Or have my hair pulled, or yanked by my ears, or whatever.\n\nYou don't have to say it out loud to anyone if you don't feel comfortable doing that, but have peace within yourself and enjoy that peace. You don't have to tell anyone the truth if you know they will brush it off; you know the truth. \n\nI wish you much peace and happiness in your freedom from her abuse. Be good to yourself; surround yourself with kind, loving people. It's over; sigh with relief. Enjoy.🫂❤️🪬",
      "created_utc": 1744632542.0,
      "score": 1
    },
    {
      "id": "mn2nd22",
      "body": "Totally valid sentiments",
      "created_utc": 1744643612.0,
      "score": 1
    },
    {
      "id": "msnwr0e",
      "body": "Get therapy. Not for hating your sister; sounds like you have plenty of reasons.\n\nBut so you can work through feeling guilty about your feelings.\n\nYou need someone to talk to, and clearly it can't be family or friends. And make sure the therapist is someone helping you. With a situation this intense, you need the right therapist, not someone trying to make you sorry your abuser died.\n\nYou can always drop a therapist and get another.",
      "created_utc": 1747418192.0,
      "score": 1
    },
    {
      "id": "mm12gea",
      "body": "I think your feelings are valid. I also think your hardened response to her death sounds like a bit of a defense mechanism. I'm not going to excuse her behavior because she died, but people grow, and change. I think in time, you will probably come to realize that there was potential there that can never be realized now. I think you already know this deep down, and your callousness is a kind of armor that's shielding you from the fact that you've lost someone close to you. On top of it, she was the victim of a reckless asshole - she serves as a tragic reminder that life is fleeting and sometimes horrible injustices happen through no fault of the victim whatsoever.\n\nI'm not suggesting your feelings are wrong or you should change the way you think about this. I'm just concerned that you're actually burying your sadness instead of confronting it, because this method of coping often manifests itself in harmful, unintended ways. Drinking problems, anger issues, latent fear and anxiety, trouble maintaining relationships, etc...\n\nI'm sorry for your experience in this, and I hope you don't shy away from talking about it with a professional.",
      "created_utc": 1744118136.0,
      "score": 0
    },
    {
      "id": "mm0an2h",
      "body": "I've never voluntarily attended anyone's funeral and I would not, and I get it. Refuse funeral invitations if you don't want to go, develop Münchhausen's for a while and pretend that you're suffering from COVID-19, which is entirely feasible, even probable, if you attend a funeral and GET COVID.",
      "created_utc": 1744105261.0,
      "score": 0
    },
    {
      "id": "mlz0sj1",
      "body": "You both were very young. People change and grow as they get older and you were cheated of that opportunity to know your sibling. ",
      "created_utc": 1744080284.0,
      "score": -6
    },
    {
      "id": "mm1rxhl",
      "body": "absolutely!  great advice.  lived whole life w/narcissist, who are cruel, are two different personas in public & how they treat those they emotionally abuse.  Others don't see their cruelty, bc they are master manipulators!!  I bet u do feel relief & ur entitled to ur feelings & peace u now have.  I wish u the best sweetie❤️",
      "created_utc": 1744126186.0,
      "score": 75
    },
    {
      "id": "mm6cz4x",
      "body": "This is a good way to avoid having to deal with others pressing you, but pleasr look out for yourself and find a therapist to work through this.  Abuse takes a toll, especially when no one listens to you and you have no one to share it with.",
      "created_utc": 1744184797.0,
      "score": 12
    },
    {
      "id": "mlwh9s7",
      "body": "This is what it comes down to.",
      "created_utc": 1744049428.0,
      "score": 468
    },
    {
      "id": "mly70cf",
      "body": "This 100%.  \n\nThere's this attitude in Western society that if someone dies, we may never speak ill of them again.  It's crap.  The fact is, some people are actually awful.  Not every dead person was a little angel while alive.  There are people where the world is better off without them in it.  And there are people where *specific other people* are better off without them in it.  \n\nI have no idea if your sister was toxic to everyone or just you.  But it's okay to say that your life is better off now that she's dead.  \n\nNot everybody would understand that though.  So I suggest when people talk about her just change the subject and say you don't really want to talk about it.",
      "created_utc": 1744069361.0,
      "score": 380
    },
    {
      "id": "mlwumos",
      "body": "Exactly.",
      "created_utc": 1744053543.0,
      "score": 54
    },
    {
      "id": "mlyzt5b",
      "body": "I hope OP wore red to her funeral.",
      "created_utc": 1744079904.0,
      "score": 17
    },
    {
      "id": "mlzwx6z",
      "body": "This.",
      "created_utc": 1744096146.0,
      "score": 3
    },
    {
      "id": "mm5diod",
      "body": "Definitely this ^",
      "created_utc": 1744166805.0,
      "score": 2
    },
    {
      "id": "mlwpot8",
      "body": "Definitely! Also, there’s a strain that comes from having other people view an abuser as an “angel” and a “golden child.” It’s even worse here because family members tend to idealize the deceased.\n\nOP, I hope you’ll follow u/threebeansandfish’s advice. It will free you to have someone believe you and support you.",
      "created_utc": 1744052007.0,
      "score": 190
    },
    {
      "id": "mlzm3gy",
      "body": "My dad was a marine fought in Vietnam he was a radio man.  He was not abusive. He came back from war and wouldn’t hunt anymore.  He wouldn’t even kill bugs. He always picked them up and took them outside.  That’s some straight up bullshit when people use war to explain being abusive.  I’ve heard a lot of people use it as an excuse though. 😑",
      "created_utc": 1744090038.0,
      "score": 58
    },
    {
      "id": "mmjkeo4",
      "body": "My uncle uses the war excuse for his dad (my grandpa). Grandpa is long dead now. But still to this day when we talk about how mean grandpa was, my uncle slips in “I think the war did it to him”. Little does he know.. that we know.. not only did he beat and kick his wife.. but r***d her little girl that wasn’t his (he was the second husband as her dad died in the war). He did this to her from the age of 8 til her teens. War does not cause someone to be that person. \n\nAt his funeral.. I didn’t shed a tear. My Aunty (his victim) smiled the whole way through. People were angry at her, not realising why she was happy. Even as he was being lowered into his grave, she kept smiling. I knew why. I wanted to give her a hug and a high five, but she also doesn’t know we know. \n\nIt’s more than ok to feel relief.",
      "created_utc": 1744369563.0,
      "score": 6
    },
    {
      "id": "mlwmxlp",
      "body": "Something sort of similar with me and an uncle. Idk what was up with that man but he just never seemed to like me much. People always brushed it off as “oh that’s just Chet” and I’m like no? Why is it normal to make comments about your looks. Told me I wasn’t pretty enough to be a caddy girl. Which I mean I wasn’t but I also wasn’t looking to be a caddy girl? I had brought up that I saw some jobs on indeed and that I couldn’t believe how much they were paying for that kinda job and he took it upon himself to knock me down when I wasn’t even trying to be on top.\n\nAnother time we were all out to eat and I I was sitting next to him and he started going on and on about how my Aunt B is his favorite niece. That she was up here *motions with hands* and everyone else is “down here”. His wife tried to tell him to stop and that he loves all his nieces and he was like no no no B is way above them. And I was like…k while eating my dinner.\n\nHe was also pretty racist so there’s that. I didn’t hate the man and he was apparently my godfather for some fuckin reason. But he just never seemed to like me. When he died I didn’t really feel much. Just damn…that sucks. And then I felt bad for not feeling more upset . But like he just wasn’t very nice to me. Why would I be shedding tears over it?",
      "created_utc": 1744051172.0,
      "score": 78
    },
    {
      "id": "mlytko7",
      "body": "My grandma was this way. She came and lived with us after my mom died to help my dad with me and my sister and brother. She immediately changed things around and was so mean to us. She was not what 3 tiny children (2, 7, and 10) needed while mourning their mother. Once, she asked me when I was 17 why I was mean to her when I was little and I told her that I wasn’t the mean one, that she was a horrible person while I was mourning the death of my mom. I don’t know that I will go to her funeral. If I do, it will be for my dad and I won’t be sad.",
      "created_utc": 1744077566.0,
      "score": 19
    },
    {
      "id": "mm43azu",
      "body": "My husband’s uncle has been slowly dying for months now from metastatic melanoma (everywhere, get annual skin checks everyone; it’s everywhere including half of his brain which has triggered a bunch of strokes and seizures), he was so insanely abusive to him, his 3 step sons, his daughter, one son will talk to him cuz he’s a fuck like he is but the other doesn’t, even his grandson; nobody except his Stockholm syndrome’d wife is upset about what’s happening here. Even outside of the ones that were kids I mentioned, he’s always just been the most massive piece of shit to everyone around him (one example was his wife’s daughter being born with a heart condition, needing surgeries really young, got a pacemaker at 12, and he said to her parents “idk why you’re wasting all that time and money, just let her die” but the mf could get a pacemaker himself at 75), I could write a book and I don’t think I know anywhere near everything he’s done. Old FL cop and former Marine (I say it that way in particular cuz I know it pisses him off hahaha), he’s been in home hospice for over a month, last ate 3/20, hasn’t had water in 3 days now. The amount of healing that is happening from him departing this astral plane is wild and is something we all should strive to not achieve\n\nEveryone pls pour one out to celebrate him no longer taking up oxygen soon 💅",
      "created_utc": 1744150713.0,
      "score": 5
    },
    {
      "id": "mlzz36u",
      "body": "I had my nails painted red.",
      "created_utc": 1744097563.0,
      "score": 79
    },
    {
      "id": "mlwv4nv",
      "body": "How old was the sister when she disappeared? And how long has it been since then?",
      "created_utc": 1744053698.0,
      "score": 3
    },
    {
      "id": "mm2da1b",
      "body": "This is absolutely written in the format of a ChatGPT story",
      "created_utc": 1744132484.0,
      "score": 3
    },
    {
      "id": "mlzyye9",
      "body": "I'm two years younger then her",
      "created_utc": 1744097478.0,
      "score": 6
    },
    {
      "id": "mmbenu4",
      "body": "People like these are dangerous.\n\n\nPsychologists use the term \"vertical split\" to refer to this type of divided personality.\n\n\nIf interested Google \"vertical split\" and \"forensic\" \"abusive.\"\n\n\nTypes like this recruit a posse of admirers and the other side of themselves viciously abuses vulnerable people. When the victim tries to get help, they get shamed and shouted down by the admirers.\n\n\n(Note: this is **not** multiple personality. That's something quite different.",
      "created_utc": 1744248801.0,
      "score": 5
    },
    {
      "id": "mlyv2uc",
      "body": "Thank you! I absolutely hate the societal expectation of not speaking ill of the dead, especially when their actions in life still have a negative impact on the people left behind. It is hypocrisy. People victimised by the dead have a right to express their feelings, mainly for their own wellbeing. They should not be made to shut up.",
      "created_utc": 1744078121.0,
      "score": 83
    },
    {
      "id": "mlz00rx",
      "body": "The next and last time I plan on seeing my FiL is at his funeral, and that’s only to make sure he’s actually dead. I’d really hate to get my hopes up.",
      "created_utc": 1744079986.0,
      "score": 29
    },
    {
      "id": "mm1st80",
      "body": "well said!",
      "created_utc": 1744126451.0,
      "score": 4
    },
    {
      "id": "mm328h0",
      "body": "idk, some of us where I'm from still call the A holes A holes bc they deserve it lol",
      "created_utc": 1744139662.0,
      "score": 3
    },
    {
      "id": "mn8r00w",
      "body": "In India we have the same concept. We cannot speak ill of the dead. But that dead person could be a full fledge nightmare. ",
      "created_utc": 1744728862.0,
      "score": 2
    },
    {
      "id": "mm0jp06",
      "body": "Yup. And the physical abuse / anger issues were only the icing on the cake. He was so emotionally abusive to all of us — and I’m sorry but that can’t be explained away as war ptsd. Childhood trauma, likely, but war isn’t what gave him a pathological drive to be the supreme dictator of the home.",
      "created_utc": 1744110371.0,
      "score": 21
    },
    {
      "id": "mlwsvya",
      "body": "Exactly. Like... you don't have to hate someone to feel no loss at their death.\n\nA therapist I had a few years ago told me \"You don't have to feel bad for not grieving someone horrible.\" and it stuck with me.\n\nIt wasn't about my Aunt in that case, it was about my Bio-dad... and I was in a panic because I must be a horrid person if I couldn't grieve him. Nevermind that I didn't know him, or that he inflicted a shit ton of trauma on me.\n\nIt finally made me put it into perspective. I could grieve the relationship that I wish we had. But I couldn't grieve the man himself. I can feel compassion for the shit that he went through, but I can't grieve a thing I didn't have.\n\nIt ain't wrong to feel relief when you're safe, finally.",
      "created_utc": 1744052996.0,
      "score": 31
    },
    {
      "id": "mlyuucj",
      "body": "I'm so sorry that you had to suffer through that.\n\n\nI don't think I'll ever understand the logic of people who are mean to little kids. :(",
      "created_utc": 1744078035.0,
      "score": 8
    },
    {
      "id": "mmzcjpo",
      "body": "badass",
      "created_utc": 1744588813.0,
      "score": 1
    },
    {
      "id": "mm2m3ou",
      "body": "[deleted]",
      "created_utc": 1744134938.0,
      "score": 4
    },
    {
      "id": "mmngwa2",
      "body": "I never knew what this was, but I lived with this. My ex would have what I called his puppies, because they would follow him around. He hated them all behind closed doors, but in the public eye he was Mr Charming. He was abusive to me, broke me down and made my life hell. People would tell HIM that he deserved better because they would only see my reaction to his abuse. \n\nGetting out was the best thing I ever did. His family has cut him off because he couldn't keep up the facade. I'm getting married in two weeks to the most wonderful and caring man, who shows me a love like I never thought I'd have.",
      "created_utc": 1744415309.0,
      "score": 2
    },
    {
      "id": "mlz16ic",
      "body": "I generally agree, BUT with one caveat- the needs of the deceased's loved ones matter too.  So while the deceased may have been an asshole, very few people are assholes to *everyone* and there's usually *someone* who's sad they're gone.  Saying bad things about the deceased should not be done where they could upset the deceased's loved ones.",
      "created_utc": 1744080437.0,
      "score": 17
    },
    {
      "id": "mlz0tfy",
      "body": "Unfortunately at open coffin funerals, it's considered poor form to stab the deceased 'just to be sure'.",
      "created_utc": 1744080294.0,
      "score": 28
    },
    {
      "id": "mm2nebk",
      "body": "Oh I understand, I'm sorry for asking.",
      "created_utc": 1744135293.0,
      "score": 4
    },
    {
      "id": "mm2nf4u",
      "body": "Oh I understand, I'm sorry for asking",
      "created_utc": 1744135300.0,
      "score": 3
    },
    {
      "id": "mmnpzog",
      "body": "Mazel tov!\n🎆🎇 🎆 🎇 🌈 🌈 👍 👍 👍 👍 ",
      "created_utc": 1744418727.0,
      "score": 1
    },
    {
      "id": "mm0pda6",
      "body": "I'm on the fence about this, and I think it matters what kind of connection we're talking about.\n\n\nWhen my abuser died I openly talked to one of his friends about it (she had an idea things were off and even had told him in the past to not talk to me the way he did). I think I even admitted I'm more shocked than anything and feel bad for the people that actually miss him. \n\n\nI think the world is better without him. \n\n\nI spoke to his father briefly, and merely voiced my condolences. Had a brief talk, father mentioned how they're grieving, etc. I simply complimented some stuff they did, and even when the father said the guy is better off dead (he was ill and suffering) I didn't mention that I am too. I made no mention of my feelings. I had no extended contact with him. (but father knew his son would yell at me, but I doubt there was an understanding it was abusive). \n\n\nI won't protect my abuser's image, but I do respect some people's grieving. \n\n\nAnother abuser in my life also passed recently. Part of my family this time. There is nobody I would put above my own feelings in this case, because there's nobody that's left that was closer than me. To be fair, rest of family knew. But if I came across one of his friends, while I respect their PoV (not their fault they were lied to), I wouldn't go out of my way to speak fondly of him. I'll speak the truth, because he damaged my life permanently. That's a fact. If friend or coworker was sad I wouldn't tell them their grief is invalid, but I would be frank that personally I feel relieved because of what he's done. As a victim it's not my job to perpetuate my abusers lies (because acting nice to other people is part of the strategy). It'd be like gaslighting myself for him, which would be ridiculous. I'm not gonna keep his lies alive to protect his image. His existence tainted my life, but his death made it better, and I refuse to not break free from it. ",
      "created_utc": 1744113016.0,
      "score": 17
    },
    {
      "id": "mm0xccs",
      "body": "As someone who has had friends, take their own life. And have had therapy for it. It is actually normal for people to be angry during grief, just bc the person is dead does NOT absolve them of ALL the wrong doing they caused for the ones still alive. The ones left living are the ones that still have to deal with all the bs the person caused or left behind.",
      "created_utc": 1744116267.0,
      "score": 5
    },
    {
      "id": "mm0ktdc",
      "body": "I disagree with your exception. If someone was hurt by the deceased, they have every right to open up about the wrongdoings. No matter if the loved ones left behind want to hear it or not. Of course, I don't mean confronting directly out of nowhere without good reason, but the victims shouldn't have to go out of their way to please the mourning and prevent them from hearing the truth. The loved ones have the right to mourn and shouldn't be blamed for that. But that is all. Just because they don't want to hear about and accept the flaws, doesn't mean they don't exist and can't be addressed. And they don't have the right to keep a picture perfect image. If they still want to fool themselves that's on them, but they can't expect for others to keep silent. An exception could be, if the news is too devastating for someone in poor health. Like hospital patients or people with severe heart decease. Though their protection from the news is the responsibility of their next ones and not the victims. And the culprit would still be the deceased.",
      "created_utc": 1744110923.0,
      "score": 9
    },
    {
      "id": "mmjdelh",
      "body": "I have spent years keeping my feelings regarding my parents to myself.  When they're gone the floodgates are going to open.  If sis doesn't want me to tell her what an asshole her precious daddy was, she can steer clear of my ass.  ",
      "created_utc": 1744365789.0,
      "score": 2
    },
    {
      "id": "mmr62qm",
      "body": "She can share anything she wants. Leave her alone.,",
      "created_utc": 1744474977.0,
      "score": 2
    },
    {
      "id": "mlzejrs",
      "body": "What about holding a mirror under their nose and putting a pulse ox on their finger?\n\nAnd then just leaving it there for the duration",
      "created_utc": 1744086153.0,
      "score": 10
    },
    {
      "id": "mmdleuj",
      "body": "That made me smile.\n\n\nDid you ever watch Dawson's Creek? There was a part where the town mean girl drowned and someone said \"I don't know whether to grieve for the loss of her life, or sing 'ding dong, the witch is dead\". \n\n\nExactly how I felt when my MIL died.\n\n\nWell, apart from the first bit, obviously....",
      "created_utc": 1744288145.0,
      "score": 2
    },
    {
      "id": "mm41nn2",
      "body": "> As a victim it's not my job to perpetuate my abusers lies\n\nOn that I agree 100% without reservation.",
      "created_utc": 1744150164.0,
      "score": 8
    },
    {
      "id": "mms6cft",
      "body": "Wasn't criticizing.  Was speaking in general.",
      "created_utc": 1744486464.0,
      "score": 1
    },
    {
      "id": "mlzevmn",
      "body": "Wouldn't register if he's a zombie- no warmth, no pulse.  \n\nMaybe some kind of spring loaded gadget that shoots a tiny silver pin into the heart?  :P",
      "created_utc": 1744086313.0,
      "score": 4
    }
  ]
}