{
  "id": "1f9lbgb",
  "title": "UPDATE: I think my husband fathered his best friend's children, and now one of them is attracted to my daughter. ",
  "selftext": "Reddit won't let me post a link, so you'll have to find the original post on my account page, sorry for the inconvenience. I could summarize the original, but these posts are already quite long as it is, and frankly, the TL;DR is in the title anyway. So here goes: \n\n\n\nFirst of all, wow. I did not expect my post to get as much traction as it did. I was half worried that someone in my family or social circle might find it, especially when someone alerted me that the post had been shared to facebook. But, as far as I can tell, no one in my family has seen it. I want to thank all of the kind commenters who wished me well. To those who were more frustrated with my indecision, I get it. But I was operating with an uncertain situation and the stakes were incredibly high. I feel like no matter what choice I made, something could and likely would go wrong. I’ve spent the last five years imagining different scenarios based on different ways I could go about this if I ever decided to act on it. To everyone who was clamoring for an update, I have one for you. \n\n\n\nI previously said that I was going to do a secret DNA test, that I had decided on that course of action. In the end, I couldn’t go through with it, and now I am regretting that, because the window to do so has essentially closed. I just felt like it would be out of line for me to do that to another person’s child behind their back. Ethically, it was dicey. I’ve since consulted with my lawyer as many commenters suggested, and she advised me against doing so, because no matter what the results were, it would make me look bad in a potential divorce proceeding. But I really wish I had done it anyway, and just not told anyone. Because I really, badly need to know, and I still don’t know for sure. Likewise, I wanted to tell Sophie in confidence, but the more I thought about it…even that seemed over the line. Like I had no right to plant such ideas in her mind about her father without even talking to him first. \n\n\n\nSo, what I ended up doing was confronting Luke and Amy. Many comments suggested this as well. I finally told both of them that we needed to have a serious talk. It felt counterproductive to approach just one of them, because I figured they would tell the other about what happened in their own words before I could prepare my own. I wanted them both to hear what I had to say. Once all the kids were at school, I laid down all of my suspicions and the reasons. I made it clear how much I love both of them, but a combination of clues had led me to notice the similarities between Luke and Amy’s children - and I didn’t even list all of them in the original post. (For example, Luke has been a sleep-walker in the past. So have Sophie, Tom, and Adam) I said over and over, how much they meant to me and how I didn’t want to believe it, but the thought had crept into my mind in the past. How I had dismissed it before, but now, with Tom and Sophie having crushes on each other, it became necessary to pose the question. So I asked if they had ever crossed the line, if Luke had ever been unfaithful, if there was even the slightest possibility that any of Amy’s children were his. I was just trying not to cry. \n\n\n\nWell, they reacted exactly as I would have expected. Their responses were perfect and so very well rehearsed. I genuinely can’t tell if it was honest emotion or powerful gaslighting. Amy was more upset than Luke, or at least more outwardly upset. She was angry, offended at the accusation. Luke just seemed heartbroken by it. Maybe they were just acting, but I don’t know. Somehow, they had reasonable responses to all of the points I brought up. They asked questions I didn’t know how to answer. I had never objected to them having alone time before, why did it suddenly bother me now? Do Amy’s children really resemble Luke that much, or are things like hair color pretty basic traits to have in common? The whole family had always treated Amy and her kids as part of our unit, and I had previously commended Luke for stepping up and being a father to Amy’s kids since they didn’t have one…why was I now saying it was a bad thing? What exactly did I want them to do? How could I think such a thing about them? Why had I waited so long to say something? \n\n\n\nLuke was more understanding than Amy. He respected my feelings, or at least he acted like he did. Amy appeared to feel more betrayed by what I said. I ended up apologizing several times even though I’m not sure I did anything wrong. Luke also apologized for “anything he’d done” to indicate he was unfaithful. I asked Amy more pointedly that, if not Luke, who HAD fathered her children? She snapped back that it was none of my business, and I could tell she was in no mood to get personal or vulnerable with me after my accusations. I’m not proud to say that I lost my temper, and said that after everything we had done for her and her children, such information was not a lot to ask and perhaps she owed it to us. I regretted the words as soon as I said them, but Amy shouted back that \\*I\\* had never done anything for her, that it was Luke and his parents who had kept her afloat all these years, not me. She went on a longer tirade about how I had always acted superior to her, which I don’t believe I did, though it’s possible that I gave off that vibe unintentionally. Luke did his best to calm her down, but the room was still fraught with tension.  \n\nI don’t know, Reddit, I just don’t know. It’s driving me to the edge of madness. There is a way to be certain, of course. Not certain of my husband’s fidelity, but of the paternity of Amy’s children. So I asked Luke, for my own peace of mind, for the sake of our daughter, and for our family unit, if he could please get a DNA test done, a paternity test. I went on to say that I knew he disliked and distrusted such things, but that I really needed this. I could see the pain in Luke’s eyes. Maybe it was an act, but he did seem genuinely hurt that I was asking for this, that him giving me his word that he had always been faithful was not enough for me. But he very reluctantly agreed to participate in a DNA test. Unfortunately, Amy did not, and that’s where we hit a roadblock. I was afraid of this. But Amy was infuriated at the whole concept and told me in no uncertain terms that I would not be getting samples of her children’s DNA and basically told me to fuck off for asking, several times in several variations. I pressed Luke, and honestly he was a bit useless but probably right. He tried to convince Amy but she wouldn’t hear of it, and he kind of shrugged to me when I pushed him for further support. Because he can’t force her to get the tests done, if she refuses, that’s really a dead end. Trust me, it is, I looked into this quite a bit and consulted with my lawyer. \n\n\n\nThe problem is, Luke could, in theory, petition the court to demand a paternity test for Tom and the others. The issue is that, to do this, he’d essentially be claiming he slept with Amy and he believes her children to be his. That would be the version of events he’d be maintaining. But Luke has staunchly insisted that nothing ever happened with Amy. That he never cheated on me. Whether or not he’s being honest about this is another story, but he’d essentially have to go on record and make a claim that he isn’t prepared to make. He is quite certain the children aren’t his and he has no intention of fighting for custody of them. So no judge is going to compel Amy to submit samples of her children’s DNA. Tom is also old enough that his consent would be a factor. If both he and Amy refuse to participate in the test, it’s unlikely that Luke would have a case. He’d have to “target” one of Amy’s younger children, like say, one of the twins. But he doesn’t want to do that. He doesn’t want to take his best friend to court to prove something that, in his words, he already knows isn’t true. Luke is asking me to please just let this go, and trust him, because pursuing this will fracture everything. And according to my lawyer, it’s not realistic anyway. For Luke to establish paternity, he would need to admit to an affair in the first place, and he’s not doing that. And if he did, that would pretty much be all the proof I needed to be certain, even if I’d need more in a court case. \n\n\n\nI pestered him further about Tom and Sophie. Insisted that I didn’t want them dating. Luke agreed, and apparently Amy still agrees. Luke plans to have a talk with Tom and activate protective papa bear mode. Among other things, he’s going to remind Tom that in a couple of months when he turns eighteen, him being intimate with Sophie will literally be a crime. I…wouldn’t actually press charges against him as I know he’d never do anything against Sophie’s will, but I’m not above implying the threat. Thankfully, Luke isn’t either. I did ask him if he’d be open to potentially swiping a sample of Tom’s DNA to do a private paternity test, but he was very hesitant about the idea. Like me, he viewed it as unethical. He also pointed out that if we were to do this and Amy found out, it would mean the end of our friendship with her, most likely. Things are, Luke believes, still in a salvageable state, where Amy and I could reconcile and become friends again, and I can see how much he wants this to happen. But, if I did a DNA test on Tom behind Amy’s back and she found out, I think she would hit the roof and I wouldn’t entirely blame her. Though I’d be very interested to see the results. Luke ended up going to see Amy and spending the night. I know all of you are cringing and throwing up your hands, and trust me, I wasn’t happy about it. That was a very long conversation. But he was adamant that he needed to perform damage control. So they spent the night together. With Luke maintaining that nothing happened. I did not sleep a wink and I kept texting him for updates. So far as I can tell, Amy will cool off, but she needs a little time. \n\n\n\nLuke and I talked things over when he came back the next morning. It was an emotionally fulfilling conversation and we ended up agreeing to take the kids (our kids, not Amy’s) to visit their grandparents for a few days. It was an impromptu visit but we’ve done it before and they were delighted to have us. I just really wanted our family to spend some time together away from Amy’s “side” of the family, so to speak. I always love getting to see my in-laws. (I’ll refer to them as “Jim” (75 M) and “Cat” (67F) . I know Reddit is famous for stories about the “MIL from hell” but in my life that couldn’t be further from the truth. I feel safe with them. To the point that, when they took notice of how distant Luke and I were from each other, I finally relented and confessed my fears. I told them of my anxiety that Amy and Luke were having an affair, and that Amy’s children might be his. Here’s where things got a little bit interesting. When I told them what I was feeling, Cat just gave Jim this pointed look, and did a big, dramatic sigh. \n\n\n\nSo it turns out, Cat has had similar misgivings to mine and genuinely suspected over the years that Luke and Amy were closer than they’d ever admit, that they had crossed the line in the past. Jim, on the other hand, simply refuses to even consider the idea. He has always insisted that Cat is seeing things that aren’t there. He maintains that Luke and Amy are “like siblings” and would “never” do such a thing. Cat thinks his stance on this is naive and that, even if she and Jim had taken Amy in and loved her like a daughter, that didn’t mean Luke viewed her as a sister or that she viewed him as a brother. But Jim just continued to insist that this is what they are and had always been. I could tell that he and Cat have already had this conversation before, and they kept going in circles, with Cat getting exasperated. She pointed out that, surrogate siblings or not, Luke and Amy were not actually brother and sister, so nothing was stopping them from being physical together if they felt a mutual attraction. At that point, Jim just sighed and walked away from the conversation. So yes, Cat has privately wondered if Amy’s children weren’t fathered by Luke, which is part of why she has always treated them as her grandchildren. Which was never something that I minded, to be clear. I also don’t mind that Cat never voiced these concerns to me. She had no proof, and she saw far less of Luke and Amy’s closeness in our adult lives than I did. \n\n\n\nAs for the kids? They’re doing alright. I don’t know what Amy told her children, but I think the general consensus, the “official” version of events, is that Amy and I had a “fight” and need a “break” from each other. That’s what Luke and I told our children, and when pressed for more information, Luke did defend me and shut down the questions, saying it wasn’t their business. I don’t know if Amy kept to that version of events, but my children and her children have each other’s phone numbers and social media, so they’ve presumably still been in contact over the last two days. I think my kids would have kept Amy’s kids in the loop on the updates, and if Amy had told them anything else significant, they would have relayed that information to my kids. After all, we know Sophie and Tom are very close. I did try and talk to Sophie about that more, but the timing was off, because Sophie rejected my counsel and interpreted my reinforced reluctance as being attributed to my fight with Amy. She maintained that she wasn’t dating Tom (to what degree that’s actually true…I don’t know.) But she was going to remain close friends with him and while she isn’t usually a disobedient child, she made it very clear that she was putting her foot down on this one, and, to be fair, I can’t really justify trying to separate them or forbid them from being friends. They’ve known each other for years. Luke has my back on them not being allowed to date, but he wouldn’t have my back on them not hanging out anymore. \n\n\n\nI wish I had a more definitive update. If anything significant happens in the next few days, I can let you guys know. I’m mostly just kicking myself for not having done the secret test, even for my own peace of mind, as now I feel like I’m locked out of the only way to get definitive proof one way or the other. ",
  "created_utc": 1725539589.0,
  "score": 8884,
  "num_comments": 2709,
  "url": "https://www.reddit.com/r/offmychest/comments/1f9lbgb/update_i_think_my_husband_fathered_his_best/",
  "comments": [
    {
      "id": "llmt1z6",
      "body": "Honey, maybe the kids aren't Luke's but he's definitely cheating on you with Amy, even if it's emotionally. Being honest with you, I firmly believe that they do have an affair and it's not just emotional, even you know another person who sees everything directly also believes that the kids are his and that he has a thing for Amy.\n\nI think it's time to put your foot down and reconsider your marriage, you expressed your feelings to both of them and he ran to spend the night with her to make sure she could get over this, do you realize how disrespectful it is that your husband would rather put another woman before you when you told him you feel insecure and paranoid about her?",
      "created_utc": 1725546178.0,
      "score": 981
    },
    {
      "id": "llme4g8",
      "body": "He had to do damage control by staying the night with her? That's because she's his girlfriend. I really don't see any other interpretation of that.",
      "created_utc": 1725540761.0,
      "score": 8972
    },
    {
      "id": "llmfna6",
      "body": "They spent the night together? OP come on. That’s not acceptable. They’re definitely a couple. ",
      "created_utc": 1725541345.0,
      "score": 3145
    },
    {
      "id": "llmelcg",
      "body": "After all this he spent the night with Amy and somehow there’s still doubt that they’re sexual and the kids are his.",
      "created_utc": 1725540941.0,
      "score": 3268
    },
    {
      "id": "llmjfw3",
      "body": "When I confronted my ex's 'friend' about having an inappropriate relationship with him, she drove off without a word, looking upset. I confronted him as she drove away, and he got defensive. \n\nAfter the fight my ex called and comforted HER first and foremost. He tried to maintain their affair was only close friendship, but I'd already seen \"I love you\" and \"I miss you\" texts on his phone-- didn't even have to snoop, he would text her sitting right beside me. \n\nOnly once he realized I was serious about leaving  did he cut her off, but as you may have guessed it still didn't work out in his favor. \n\nThat the man you married put comforting this woman over your feelings is painfully telling of where you all stand. Even if they're not having an affair, that action alone shows he has no respect for you. I'm sorry, you don't deserve this and his relationship with his friend is at the very least inappropriate.",
      "created_utc": 1725542744.0,
      "score": 2058
    },
    {
      "id": "llmf9xe",
      "body": "He spent the night with her??????!?!?? I mean… I’m still on the fence. I really don’t know if he’s the father or not. But what I do know is - at minimum, Luke is stupid as fuck. \n\nHis wife literally feels insecure & paranoid and suspicious. And what does he do? Immediately spend the night with the woman that his wife feels insecure, paranoid and suspicious about. \n\nI mean - literally stupidest thing he could’ve done. He should’ve spend the night calming his WIFE down not Amy. Like… so insanely stupid.\n\nI mean even if he never cheated on you, he definitely doesn’t respect you or your marriage. Because that is not the behaviour of someone who loves his wife and respect the marriage.",
      "created_utc": 1725541203.0,
      "score": 3067
    },
    {
      "id": "llmgf1e",
      "body": ">Luke ended up going to see Amy and spending the night.\n\nI wouldn't need a DNA test to divorce this man. Who the fucks spends the night at his \"friend's\" house to \"calm her down?\" What about you? Who was calming you down? Reassuring you? \n\nOP, you need to realize that he fathering her kids or not is not the only problem here, and your relationship is far from the dream you painted on your first post. The only way I'd consider staying married would be if he cut Amy from our lives and if that's \"impossible\" then I'd bow out.",
      "created_utc": 1725541638.0,
      "score": 1216
    },
    {
      "id": "llmsusc",
      "body": "I think you’ve been so used to their BS that you’re blinded to the fact that your husband sleeping over at his best friends house to appease HER feelings is complete and utter bullshit and inappropriate. In a marriage, wife wishes come first especially when the wife has a long list of valid suspicions. For Amy to feel betrayed is wild. She should have no access to your husband so for her to feel that she has the right to have your husband sleep over to appease her is evidence enough of cheating to me.",
      "created_utc": 1725546096.0,
      "score": 644
    },
    {
      "id": "llmjzis",
      "body": "I’ve been waiting for the update and boy was it a roller coaster even for me as a stranger. I am so sorry you’re going through this but please for the love of your sanity I think a divorce should definitely be on the cards. I got gaslit just by reading that. My darling from one random Australian woman on the internet, I hope you can soon find peace soon with whatever decision you make. Again my love I hope you have a support network around you. If not inbox is always open.",
      "created_utc": 1725542939.0,
      "score": 816
    },
    {
      "id": "llmes6f",
      "body": "Your husband spending the night with her was already odd and concerning, but he absolutely should not have done that after you confronted them. That in and of itself is a huge red flag and says more than any words can say. I don’t care how much they’re like siblings, that was over the line. Add on the fact that you’re not the only one with these concerns, I would be asking for a separation at the very least with some marriage counseling. It’s great you have an amazing MIL (you’re truly blessed with that) so maybe she can help get some more answers now that the thought is out there for all of the adults.",
      "created_utc": 1725541013.0,
      "score": 977
    },
    {
      "id": "llmrkty",
      "body": "He went to console his real wife for the night she admitted as much she’s jealous of you and your relationship status, she hates you and hides it because she wants your husband to herself.",
      "created_utc": 1725545581.0,
      "score": 725
    },
    {
      "id": "llmiaig",
      "body": "Just tell your daughter that until you’re certain there’s no genetic link between her and Tom you’ll never support the relationship. And offer to buy them tests.",
      "created_utc": 1725542331.0,
      "score": 179
    },
    {
      "id": "llmehxk",
      "body": "Why are you letting him sleep over there, that’s ridiculous and there is no need for him too! You are really naive and need to put a hard stop to that.",
      "created_utc": 1725540904.0,
      "score": 756
    },
    {
      "id": "llmiqji",
      "body": "If I was Amy and the whole situation really was only misinterpreted, I would have been furious, yes. I also would have done the damn test, just to throw it in your face, OP. The fact that she refuses to do it is suspicious, and no, I many cases I don’t think like that. If a man accuses his wife out of the blue, I'd totally understand if she refuses out of anger. But in this situation? Hell no. I would want to clear my name. \n\nAll the best, OP. I hope Tom and Sophie will be able to make a test when both of them are over 18. If they turn out to be half siblings, you have your answer.",
      "created_utc": 1725542493.0,
      "score": 603
    },
    {
      "id": "llmf7de",
      "body": "So ... Everyone is trying to stop them dating in case they are half-siblings?",
      "created_utc": 1725541176.0,
      "score": 309
    },
    {
      "id": "llmgx48",
      "body": "The fact that he chose to spend the night comforting Amy instead of comforting you, his wife, seems damning to me.  That alone feels like a nail in the coffin.\n\nWhen combined with the fact that his mother shares your suspicion...idk. it seems even MORE like he is actually Amy's children's father.\n\nThis is one of those things where I just wish people would admit to things.  If they DO have a romantic relationship, it's already more or less out in the open, and lying about it at this point isn't making anything better.  If they'd just admit it and have a real conversation with you, there might be something to salvage here.  If they keep refusing, eventually the uncertainty is going to drive you away.  There's little worse than being in a relationship where you're sure the other people involved are keeping secrets.  Even if it's not true, that doubt eats away at you.  \n\nWould it be at all helpful to ask Cat to talk to your husband privately?",
      "created_utc": 1725541828.0,
      "score": 386
    },
    {
      "id": "llmj2e1",
      "body": "even if amy was his biological sister it wouldn’t be right for him to go do ‘damage control’ for his relationship with her over his relationship with his wife. he’s prioritising her over you. what is he doing to reassure you and to maintain and improve his relationship with you and with your children?",
      "created_utc": 1725542610.0,
      "score": 465
    },
    {
      "id": "llmh5wn",
      "body": "They spent the night together!!!???? I‘m extremely confused. How can either of them not think that is a red flag?",
      "created_utc": 1725541916.0,
      "score": 102
    },
    {
      "id": "llnm0jg",
      "body": "If you can get your husband to cut off his financial support for her, I'd put real money on her showing up in a couple months with a summons petitioning for child support",
      "created_utc": 1725555598.0,
      "score": 102
    },
    {
      "id": "llmrv55",
      "body": "The fact that MIL has noticed means that it isn't just you, it IS that noticable to others. I'd be honest with my daughter in this scenario, lay everything down and be honest, because if he is your husbands son and you daughter is \"dating\"/seeing her half-brother in a romantic way...well let's just say she deserves to know it could be a possibility. Hell being honest would probably make getting a DNA test done more likely. I think the biggest issue is saying \"oh well\" and ignoring it when everything is pointing to your husband being the father....",
      "created_utc": 1725545693.0,
      "score": 203
    },
    {
      "id": "llmy0g2",
      "body": "Hi OP, my heart truly breaks for you. Whether you believe them or not, I know you have been living with those doubts for a long time, and no one should carry such heavy loads in their marriage. That's why I think that Amy is the one who thinks that she is superior to you. \n\nIf she truly values your friendship and sees how much pain she is causing you, she will come around and tell you who the father is even if the father is a serial killer. Think about friendship in general, and if you were in her shoes and saw what type of pain a secret was causing someone you claim to love and be friends, almost family with. Wouldn't you tell them the truth in confidence and swear them to secrecy? \n\nShe calls herself your friend but says you were never the one who did anything for her, but your husband and his family meaning: what she enjoys has nothing to do with you, she deserves it because she has known them longer and she might also think that she was entitled to sleep and have children with your husband because she sees that YOU ARE THE OUTSIDER. \n\nI really hope that your husband is not the father. At this point, for Sophie's sake, since she's the very innocent one in all this, at least for you we can argue that you have suspected it for a long time but turned a blind eye so you kind of made your choice but the children didn't. \n\nDid you tell the grandparents why it became urgent to know the truth? About Sophie and Tom?",
      "created_utc": 1725547947.0,
      "score": 99
    },
    {
      "id": "llmoafm",
      "body": "Amy is shitting bricks. She knows the jig is almost up and she’s probably terrified that she’s going to get cut off from the absolute lifeline she’s had all these years. How dare she say that you didn’t do anything for her and her children? \n\nDoes she not realize that *you* are the reason she’s even HAD this kind of support? Most women, myself included, would have seen to that relationship being neutered (no pun intended) years ago, definitely long before MY husband and his family raised not one, not two, but ALL of her children. She makes me sick. Even if those kids aren’t your husbands. As a woman, we don’t claim her.",
      "created_utc": 1725544453.0,
      "score": 181
    },
    {
      "id": "llmjg09",
      "body": "Please don't just let this go OP. All of your concerns from the original post are still valid even though Luke and Amy have denied the allegations. If a physical relationship between Tom and Sophie starts there could be SERIOUS consequences. You shouldn't be worrying about \"damage control\". You should be worrying about incest.\n\nTheir response was rehearsed. They're lying to you and you shouldn't just let it go, for your children's sake.",
      "created_utc": 1725542745.0,
      "score": 155
    },
    {
      "id": "llmh50t",
      "body": "Truly that the overnight stays have been accepted in this marriage.  Your husband needs to stop period if for nothing but the respect for you and your marriage.",
      "created_utc": 1725541908.0,
      "score": 74
    },
    {
      "id": "llmt8ag",
      "body": "You asked a direct question: Did Luke father your children? \nAmy: That's none of your business! \n\n1) Yes it is your business\n2) They correct and easy response should have been, \"Absolutely not!\"\n\nI think Luke is the father. Hopefully, Granny Cat can help you get to the bottom of this.",
      "created_utc": 1725546250.0,
      "score": 71
    },
    {
      "id": "lln19h6",
      "body": "Honestly? Your greatest asset may be the entire catastrophe you’re trying to prevent for your daughter and pseudo-nephew.\n\nBe honest with them. They keep asking why they can’t date, what’s wrong with their ages - why not tell them that if Luke and Amy have been honest with you, then all of your fears are invalid and you can support them dating?\n\nTurn Luke and Amy into the gate keepers. Make them the bad guys. “Luke and Amy say no.” Let the oldest kids know that you were scared by not knowing who Tom’s father is. Your argument with Amy was about trust and the history of the family - it has nothing to do with the kids directly, but does affect how protective you feel as a mother. There needs to be trust and honesty if people start a new relationship, after all (a little ironic advice to hand down to these kids).\n\nPresent it as a mutual problem. If Tom can find that out, if Sophie feels motivated to help him, things may unravel in your favor.\n\nYou don’t have to be overt and say that you think Luke is Tom’s bio-father - that would be a nuclear bomb on this scenario that I assume you don’t want to set off. But if Tom suddenly starts pressing for info about who his father is, will that be so easily shut down? What if he catches wind about a DNA test - maybe he’d offer willingly?\n\nHave ANY of Amy’s children wanted to know about their biological father? I find it odd that in all of this none of them (especially the older son) have wanted to do DNA testing to learn about potential health benefits and risks. DNA testing offers valuable information beyond parentage (that could be another way to spin it).\n\nI bet if you make it sound that simple and covertly provide the cash, Tom and Sophie could both do a 23 and Me together…but that would really be directly involving the kids.",
      "created_utc": 1725549002.0,
      "score": 143
    },
    {
      "id": "llmflmf",
      "body": "Do the grandparents still provide support for Amy? \n\nCan Granny talk to Amy and convince her to go ahead with paternity (if she’s nothing to hide) to save her son’s marriage or cut off support if Amy refuses?",
      "created_utc": 1725541327.0,
      "score": 211
    },
    {
      "id": "llmf6vc",
      "body": "You should still try to get that dna test either with hair or saliva sample. And PLEASE DO NOT LET YOUR HUSBAND STAY AT AMY’S HOUSE OVERNIGHT. How can he choose to stay with her after your fight? Doesn’t he think about you at all? You being disappointed? Even his mom is suspecting.",
      "created_utc": 1725541171.0,
      "score": 60
    },
    {
      "id": "llnou4a",
      "body": "have you consulted a family law attorney about what/how to handle your situation?  Are you considering a separation?   Is he going to stop the bs of spending the night at Amy's?  My husband (married now over 30 yrs) had a very close female friend - and while he may not have been interested in more, it was obvious she was.  I'm not a ultimatum kind of person, but i let him know i didn't like it and why.  He opted to distance himself from her.   \n\nPlease know your worth and you are more than whatever they may be feeding you.\n\nI wish the best for you and your children.",
      "created_utc": 1725556492.0,
      "score": 60
    },
    {
      "id": "llmi02n",
      "body": "He should have spent the night doing damage control with *you!* Not her! Who knows what the hell those two cooked up to further cover their asses!",
      "created_utc": 1725542226.0,
      "score": 52
    },
    {
      "id": "llmo53g",
      "body": "You are right to be suspicious. This is a very unconventional arrangement. None of it really makes sense. The only explanation is that they’re having an affair and he’s the father of her kids. I would demand the DNA test to put it all to rest. Maybe when Tom turns 18? And the sleeping over at her place? Yeah, that’s not normal behavior. \n\nThe whole situation has been normalized. It’s a very odd arrangement. Trust your instincts and fight for the DNA test. The fact that neither of them want your kids together says a lot, IMO.",
      "created_utc": 1725544403.0,
      "score": 53
    },
    {
      "id": "llmv5tr",
      "body": "OP, do you feel that Luke or Amy are either unaware of or okay with the issues that would result from Tom and Sophie having a sexual relationship if they are half-siblings? Do you truly believe that they would allow their children to develop an incestuous relationship in order to keep their own secret?  If you believe this of them, what does the future of your relationships with them look like?\n\nYou may need to consider finding a good therapist to help you work through a) why you stayed in a marriage for years after coming to believe that your husband was unfaithful, without discussing it with him, b) how best to protect your children from your suspicions and/or the reality of the situation, c) whether or not you want to remain in the marriage, d) if not, how to minimize damage while extricating yourself, e) if so, how to rebuild trust and repair the damage already done. \n\nYou need to know the truth, but you need to be ready to accept the truth, even if it hurts. If you are right about what you suspect, you can’t afford to let the kids be hurt in this way. If you are wrong, you have a lot of work to do to make up for the years of suspicion and silence-for Luke and Amy, but also for yourself and your children.",
      "created_utc": 1725547008.0,
      "score": 50
    },
    {
      "id": "llmimk8",
      "body": "HE SPENT THE NIGHT THERE?!?!?   Red flag city.   Even Luke’s Mom thinks there is something going on.",
      "created_utc": 1725542453.0,
      "score": 40
    },
    {
      "id": "llmoy77",
      "body": "Kind of curious that Amy reacted so strongly about her kids' father(s). If both families are so close, how has this topic never come up? Do the kids ever talk about their bio dad never being around or not knowing anything about him? \n\nAnd Luke spending the night to \"calm Amy down\" instead of his own wife? C'mon.",
      "created_utc": 1725544680.0,
      "score": 38
    },
    {
      "id": "llmz90a",
      "body": "How far do yo think you can take your MIL? Would she be able to pressure Amy to take the test?",
      "created_utc": 1725548348.0,
      "score": 41
    },
    {
      "id": "llqtr8b",
      "body": "I'm so sorry.  It now makes it stand out even more why she said, \"She's always been unlucky in love,\" and why you never saw anything more than her chatting at the bar with anyone.  She didn't need anything more because she already had it in secret, but let you wing-man for her to hide suspicions.  \n\nI hope I'm wrong, but that's what I am getting just from reading this and having dealt with an ex cheating on and off for 10 years.",
      "created_utc": 1725595487.0,
      "score": 32
    },
    {
      "id": "llmcrdl",
      "body": "Yeah I’m not convinced either way. Sorry you’re going through this OP, if I’m spinning loops in my head trying to figure this out, I can only imagine what you’re feeling. Perhaps you can enlist MIL to talk to your husband. If he knows maybe other people have suspected, then he will be more open to testing (and able to convince Amy as well.)",
      "created_utc": 1725540223.0,
      "score": 106
    },
    {
      "id": "llmmsdk",
      "body": "Wtf. You expressed intimate fears about the state of your relationship with your husband and he went and spent the night with the woman you are concerned about? Umm… 🤔 \n\nHe is more concerned about her feelings than yours. Period.",
      "created_utc": 1725543935.0,
      "score": 28
    },
    {
      "id": "llmn1tk",
      "body": "I say this with the utmost respect and sympathy for your situation…. You need to step away from the situation and handle it the way you would recommend to a friend, child, sister, or loved one. \n\nI understand that you are hesitant and rightly so about imploding your marriage and what your future looks like. But it’s one of those things where you have to decide if you’re going to stay with a man who continuously chooses his best friend over you. He chose to spend *several* hours whether it was overnight or not instead of helping you, soothing you, restoring his relationship with you, healing you, loving you, appeasing you, and at the very least helping you feel more secure. He did none of that but instead did those things with her. \n\nIf his own mother, the one who birthed him and loves him unconditionally has questioned his relationship with her. That may be the biggest red flag of all. \n\nHow would you want your daughter to handle this situation if she was in your shoes? Would you want her to continue a relationship with her husband, stay friends with Amy, and encourage the relationship between her husband and Amy? \n\nAt the very least y’all need to get into therapy immediately. At least the professional can help Luke with his priorities and having healthy boundaries with friends. \n\nI’ve been married almost 15 years. I can honestly, wholeheartedly say, there is not a single person in my life or my husband’s that he would choose over me. Not his brother, not our parents, not even his (our) kids. There is no way he would go stay the night at his brother’s house to “repair” our friendship or our children’s house if I had a fight with one of them (we have 4 so there’s a good chance lol). There should be no reason a spouse stays the night in anyone’s house unless they are traveling and visiting long distance. People are just asking for bad situations. There’s a reason committed couples have their own place… it’s a part of the maturity process and starting their own lives. \n\nBest case scenario that he and Amy are platonic and never crossed the lines sexually, it’s still unhealthy and inappropriate as a married man. Codependent even. Most people don’t have this type of relationship with blood family, let alone surrogate family. \n\nHow is your relationship with Luke right now? Does he feel like you’re going to go back to normal, and that he’s going to continue his inappropriately close relationship with Amy? \n\nYou need to stop worrying about upsetting Amy. If she gets mad and loses Luke’s family money… that’s on her. She can try to restore that relationship with them. He married you and not her. If she gets mad and stops her friendship with Luke, you’re better for it. If she gets mad and Luke chooses Amy, well now you know. If she gets mad and tries to throw it in your face, thanks for the info! \n\nSomething has got to give, OP. You’re dying (or your marriage is at least) a little everyday without knowing.",
      "created_utc": 1725544027.0,
      "score": 33
    },
    {
      "id": "llmntcg",
      "body": "Your husband and Amy have had years of practice on how to control you.  So, basically, Amy is your sister wife you didn’t know you had and by his actions, she is the favorite wife.  You need to go all crazy mode and demand answers.  You don’t need to involve Amy but your husband.  Give him an ultimatum!  Let him know how neglected you have felt in this marriage and how you feel he has crossed the line many times.  NO MARRIED MAN SHOULD BE SPENDING THE NIGHT AT A ANOTHER WOMAN’S HOUSE.  Why did Amy get so defensive about who was the father of her children.  And her screaming that you were not the one to support her was magnanimous consider she says it was your husband and his family who supported her.  What single woman has four kids with no father around?",
      "created_utc": 1725544292.0,
      "score": 31
    },
    {
      "id": "llmoqo8",
      "body": "He acted sheepish, Amy got big mad.\n\nYep, there's your confirmation right there.",
      "created_utc": 1725544607.0,
      "score": 29
    },
    {
      "id": "llmovyj",
      "body": "I haven’t seen this mentioned yet, but I’m outraged for you that she said *you’ve* done nothing for her. *You* have shared *your husband* with her. I don’t have any more to say that isn’t already been said, but that comment further underscores her lack of respect for you and your marriage.\n\nSending you hugs and wishing you peace",
      "created_utc": 1725544658.0,
      "score": 32
    },
    {
      "id": "llms02f",
      "body": "Please keep us updated and please take care of yourself. This whole thing would have me in such an awful place mentally with all of the uncertainty.\n\nI would make sure to really talk with your husband and let him know what a strain this has been putting on you mentally. And the day that you really needed him, he went and spent the night with Amy. It is possible all could be recovered and go back to normal, but only if he actually steps up and acts like a husband, not a man stuck in the middle.",
      "created_utc": 1725545749.0,
      "score": 85
    },
    {
      "id": "llmpwn5",
      "body": "I remember your first post and I commend you for not going behind your husband and Amy’s back to DNA test her kids. If it ever got out and you were wrong then your marriage would probably be damaged beyond repair. \n\nI’m not going to say anything about your husband going to spend the night at Amy’s immediately after the blowup because I see many other posters already did and I’d just be echoing their sentiments. I just have 1 question, does your husband know who the real father/fathers of Amy’s children are? It’s very, VERY sketchy that after all this was brought up she refused to just come clean about who got her pregnant and just paints your husband as more guilty.   \n\nYour husband needs to understand how bad all of this looks when even his own mother thinks his relationship with Amy has been inappropriate. I’m not one to believe in giving ultimatums, but I think hard boundaries need to be set. 1. You need to tell your husband that until Amy is transparent and can give concrete proof that your husband isnt the father of her children, that she is out of your lives. 2. If your friendship with her ever does get repaired, the overnight stays at her house end, period. 3. Your husband needs therapy to deal with his feelings for Amy and her children and MC for the 2 of you.",
      "created_utc": 1725545006.0,
      "score": 54
    },
    {
      "id": "llmikac",
      "body": "Put a voice activated recorder in his car.",
      "created_utc": 1725542430.0,
      "score": 25
    },
    {
      "id": "llmk3jn",
      "body": "His first thought was to basically spend the night consoling her instead of staying with you, his wife, and reassuring you?  I'd be needing to move out of the area and put real distance in that relationship.",
      "created_utc": 1725542978.0,
      "score": 26
    },
    {
      "id": "llmkp16",
      "body": "Your MIL sees it too so you aren’t over reacting. No more sleep overs or being alone with Amy. There really is no coming back from this but maybe his mom needs to explain that to him. Even if there wasn’t an affair he has taken this best friends thing too far and they don’t act like siblings. That’s just weird at this point. Tell him that after your conversation with your MIL, and the lack of paternity test that you are seriously considering taking your daughter as she has a right to know before she commits accidental incest. Tell him that he is not to warn his sister until after you have spoken to your daughter. Have your MIL tell her what you suspect with you. Explain that you love her dad and have looked the other way because you never had concrete proof. Have MIL explain that she also suspected this but again lacks proof. However lay out everything objectively, make a list, including the rare allergy. Either aunt Amy is dangerously obsessed with her dad and is seeking out men who resemble him beyond casual coincidence or she’s been flirting with her half brother. Maybe involve a therapist. Your child cannot be the victim of accidental incest.",
      "created_utc": 1725543195.0,
      "score": 28
    },
    {
      "id": "llmmxs8",
      "body": "I don’t understand why you would want a relationship with Amy if she won’t agree to the DNA test? The DNA test wouldn’t reveal who the father is if it is not your husband. I’d tell Tom the truth and I think he would submit to a DNA because I’m sure he doesn’t want to date his half sister. It’s really unfair to keep this from the kids especially if they are related. I think you know in your gut what is best and if it means sacrificing your friendship with Amy, so be it. Good luck OP.",
      "created_utc": 1725543988.0,
      "score": 29
    },
    {
      "id": "llqngk8",
      "body": "Hey OP, first and foremost thank you so much for coming here for support. I know it was not easy and you had no where to turn for support or advice. I hope this community has given more support than criticism. You are doing your best under the circumstances, I get that. I have no idea what you have been living with and stress you've had.\n\nI commend you for fighting for the safety of your child. You are a great mother to put your children first. I’m so happy to see you protect your kids. Sophie is at risk but there could be potential romantic interests for 2 other pairings with the younger ones too later. Regardless of how long it took, you are here now and that much closer to the truth and relieving all your worries. Don't give up on protecting your kids and standing up for yourself. You deserve an incredible man, you are an amazing woman, wife and mother and friend. You were horribly taken advantage of by 2 people who didn't/doesn't deserve you. I know after this comes out and you divorce Luke, you will find a worthy husband that will prioritizes you and won't split his time or efforts with another woman.\n\nI'm so proud of you as a woman and the steps you’ve taken so far! Your story is bring these situations to light that we need to know as woman and how to protect ourselves and others we love. You are not the first to have this experience and won't be the last but it will raise awareness that there's men that live double lives and fathers children outside of their marriage. Men living a double life are disgusting and women need to keep exposing this type of behavior.\n\nPersonally, this reinforces my boundaries that I would be uncomfortable with my boyfriend/husband having a female close/best friend. I’ve seen so many posts with betrayed partners/spouses dealing with that type of dynamic. Please keep us updated and don’t leave/delete your account. You are doing the right thing. I hope you are getting more positive support. I honestly wish you the best outcome for your sanity and children. I pray for your mental health and sad that the 2 other adults aren't advocating for the safety of all kids involved. Incest is a crime and horrific act that could has severe harm to Sophie and Tom. Thank god that they have you to support their well-being and know right from wrong.\n\nI have some questions after reading your previous posts and comments:\n\nDid Luke and Amy directly say that “they have never slept together” before? Did they openly deny nothing has happened since they’ve known each other. They never kissed?\n\nDid you tell the in-laws that you are worried that Tom and Sophie getting together?\n\nAre you the same race as Amy or Luke?\n\nDo your kids and Amy’s kids look like siblings? Like if Luke took a picture with all 8 kids, would people believe that all 8 are his? ",
      "created_utc": 1725592819.0,
      "score": 27
    },
    {
      "id": "llmlskx",
      "body": "I blew up in the last comment because I’m just… so shocked by his behaviour. Like I felt so disrespected for you. If I feel this way, can’t imagine how you’re feeling. \n\nBut.. on a calmer note. I know people think you’re being too slow and cautious… but it’s real life. You’re scared. You don’t want to blow up everyone’s life. And you’re hurt. If easy for us to type on our little phones telling you to leave his ass immediately, secretly get dna samples and whatever. Much harder to process and do when you’re living in it. \n\nBut it seems like you are still thinking clearly for the most part. You can see where the issue is you’re just not clear on how to proceed. But you’re ok. You’re still ok. \n\nTake some time out if you need it. Just… I don’t even know. Do something you enjoy that can take your mind off everything even if for an hour. The anxiety must feel terrible. A nice massage maybe? Anything.",
      "created_utc": 1725543585.0,
      "score": 85
    },
    {
      "id": "llme1vx",
      "body": "Yeah, get a DNA test. This is sus AF.",
      "created_utc": 1725540734.0,
      "score": 80
    },
    {
      "id": "llmi8lv",
      "body": "Perhaps a way to get around it is through the grandparents and wills. Your MIL, especially,  could want to split any inheritance between the son and ALL of their grandchildren and want to be clear how many they have. And OP,  you need to start putting some deal breakers down especially when your husband leaves you to support Amy. Where was your support? Or you need to divorce. This would be eating away at my soul and I think you need to focus on you rather than the 3 of you.",
      "created_utc": 1725542312.0,
      "score": 84
    },
    {
      "id": "llmpmey",
      "body": "Bad news OP... Your husband is 100% banging his friend. My wife would divorce me immediately if I ever asked to sleep over at another woman's house. The fact he slept there after you informed him of your suspicions should be the final nail in the coffin for you. Your husband is an asshole. Good luck OP.",
      "created_utc": 1725544908.0,
      "score": 42
    },
    {
      "id": "llmf2e2",
      "body": "Tbh, I don’t think your husband and Amy should have kept up such a close friendship after he married you. Friendship is fine, but the closeness of it all and the fact that it’s not just you who realizes their relationship is…odd… is a little suspicious. \n\nI feel like a clean break of friendship would be best (and watch how your husband reacts to that. Wouldn’t be surprised if he chose her over you), but I realize that’s probably asking for too much. If they really aren’t his kids the ending of the friendship shouldn’t matter as much as if they were. It would still be painful because there’s history whether platonic or not, but in the end you are his wife and your kids come first. \n\nAlso he should NOT have stayed the night at her home. If my husband ever did that, immediate separation. That is hard line to cross. Why isn’t he staying and doing “damage control” with his wife? you know, the person he’s married to? \n\nEither the DNA tests need to happen or the friend is cut off or worse, you divorce his weak butt. What kind of man goes to another woman’s home when his wife is in the state she’s in? I just absolutely cannot wrap my head around that. \n\nTbh the ultimatums need to come sooner rather than later because this is absolute nonsense.",
      "created_utc": 1725541123.0,
      "score": 142
    },
    {
      "id": "llmlqhu",
      "body": "The fact that his first inclination after the fight was to go over there and save the friendship rather than stay with you and work on the marriage is such a red flag. I'm sorry it is. \n\nI don't care how close they are. They are not siblings. And if my spouse had even a smidgen of doubt I'd want to make them trust me. Not sow more doubt. \n\nYou and your husband need counseling. And definitely keep that lawyer on speed dial.",
      "created_utc": 1725543565.0,
      "score": 23
    },
    {
      "id": "llmmccs",
      "body": "Have you checked his phone? I'd be reading their texts asap with no concern about violating his privacy. I wouldn't ask him to see the phone either, he'd just delete incriminating messages. Not a lot of situations where I would suggest that but right now he's basically choosing her over you, with his little sleepover and all. That's not ok and you deserve answers.",
      "created_utc": 1725543780.0,
      "score": 22
    },
    {
      "id": "llmnpvm",
      "body": "i’m sorry are you seriously this naïve? I’m trying to be gentle because you’re clearly going through a rough time but he left your house to go SLEEP OVER at HER house. you’re living in this emotional turmoil and all you have to do is get a divorce. \n\nserve him with papers and say the only way I’m staying with you is if you and Amy’s children get a test done to prove paternity. At that point I’ll be willing to sit down and therapy and work on our marriage. But if you are going to continue being secretive and lying to me, I’m leaving.\n\nyou just accused your husband of having a decades long affair, and in response, he ran to his “FRIENDS” house to salvage THEIR relationship instead of sitting down with his WIFE to fix his marriage. Do you need any more signs? How long are you gonna live in this emotional turmoil? i’m exhausted reading this. \n\nleave. him. The answer is in front of you and you don’t wanna see it.",
      "created_utc": 1725544259.0,
      "score": 21
    },
    {
      "id": "llmnsq1",
      "body": "Thanks for the update!! \n\nAmy’s reaction, I think, says what she really thinks of you and that is a thing I think you should have a talk with Luke about! \n\nSo he would rather do damage control with her than making sure you were okay?! He actually did what you have told him you are not comfortable with, spending nights with her! He couldn’t just talk with her and then come home?! \n\nHave you and Luke gotten a chance to talk more and repair some or at least not be so strained in your relationship? \n\nThe fact that you are not alone in your thoughts says it all!! Was Luke present when the talk with the in-laws happened? \n\nI think you need to put your feet down and say no more sleepover and that he needs to put more efforts in to your relationship!! \n\nHugs to you!",
      "created_utc": 1725544286.0,
      "score": 24
    },
    {
      "id": "llmo9vn",
      "body": "It's strange that he spent the night there. But I guess you're his wife, and you know him better.\n\nStill, his father seems adamant that Luke and Amy aren't a thing. That sounded strange to me, perhaps he knows something... It is a VERY far-fetched suggestion, but maybe Amy is your FIL's kid, and Luke's sister? Kids tend to take after their grandparents, which would explain why all the children look alike. \n\nOr, even worse 😬 Maybe the FIL is the father of Amy's children? Which would explain why she doesn't disclose who the father is. \n\nHonestly, it would be best to be all a simple coincidence. If Tom continues to go after your daughter, you could tell him in private your doubts. I guess he wouldn't want to sleep with his sister and he would be willing to do a DNA test. Still, these are extreme possibilities and the best for you would be to keep an eye on Luke, and find a way to care for yourself and the kids, just in case.",
      "created_utc": 1725544448.0,
      "score": 22
    },
    {
      "id": "llmp2ov",
      "body": "“So they spent the night together”?  What? Are you nuts? There are 3 people in this marriage and one of you needs to go! \n\nAt a minimum, you need to have some self-respect. He cared more about Amy being upset than you.",
      "created_utc": 1725544721.0,
      "score": 22
    },
    {
      "id": "llmpyp6",
      "body": "Do all of Amy's kids look like your husband or could be fathered by the same man? \n\nHonestly OP what would have you done if they did admit that he was the father of her kids? Would you continue the relationship? \n\nDo you even want a friendship with Amy even if you feel this way? \n\nI feel like if he didn't father her kids, they are least having an emotional affair. And who has sleepovers with the opposite sex at this age especially when married?!\n\nThe fact that he went to sleep over at her house after you confronting them should be a huge red flag for you. He picked her over you.",
      "created_utc": 1725545025.0,
      "score": 21
    },
    {
      "id": "llmt9k0",
      "body": "I still can’t get over that you expressed to your husband that you thought he is having an affair and his solution was to go spend the night with her. You need to see a lawyer.",
      "created_utc": 1725546266.0,
      "score": 20
    },
    {
      "id": "llmtyvy",
      "body": "Luke was willing for a DNA test because he knew Amy wouldn’t consent. That is how they rehearsed it. They had this good cop bad cop routine down pat cos they had 18yrs to perfect it. \n\nYou may love that man but he has been cheating on you and fathered a whole other family right in front of your fucking eyes. Divorce this dude because he after that big confrontation he went to stay the night with HER, instead of staying with YOU, HIS WIFE. That says everything we need to know about who he loves more. \n\nAlso fuck Amy for having all those kids and having 2 families to help her raise them!",
      "created_utc": 1725546568.0,
      "score": 24
    },
    {
      "id": "llmy5yw",
      "body": "He's her best friend, they spend the night together, super close, but she also doesn't tell him who the fathers are? Seems odd. \n\nShe refuses DNA test to save her best friends marriage, to clear her name, to clear his name, to prove your kids can safely pursue a relationship.  Odd.\n\nShe says you do NOTHING for her as a friend, but your shared finances go to her, your husband is always taking care of her, you are always ensuring her needs are met, yet she acts like it's only your husband. Odd if she sees you like a close friend. \n\nYour husband knows you feel this way and still wants to stay the night with her??! Super odd. \n\nI think you know what's needed. You just have to stop ignoring all these bright red flags.",
      "created_utc": 1725547998.0,
      "score": 24
    },
    {
      "id": "llx87sv",
      "body": "I already read update part 2 but something to keep in mind is Luke and Amy have had decades of figuring out how to approach this story and likely in many ways.\n\nI am curious why Luke wanted both relationships for that long and Amy is clearly unhinged for letting it continue in such a way. Luke is married to OP which makes Amy the side chick; why on earth would you want that title for decades. Maybe Luke doesn't treat Amy like a side chick but nonetheless its still weird she is just fine with it",
      "created_utc": 1725692979.0,
      "score": 19
    },
    {
      "id": "llmoxzs",
      "body": "OP this situation is all sorts of weird. \n\nEven with no hard evidence, is the suspicion not already so great things just can't continue as they are? The paranoia, the fear, the possibility of betrayal.... it could drive you mad. \n\nEven if you accept the version of events they put forward on the surface, some part of you will never really feel at ease with all of this.",
      "created_utc": 1725544678.0,
      "score": 20
    },
    {
      "id": "lln0ibd",
      "body": "Luke + Amy like the sexual tension between them and they ENJOY triangulating you.\n\nThey are at least cuddling, kissing and fondling. \n\nYou don't spend the night with someone to spend it at opposite sides of the house. \n\nThey are having an emotional affair IN YOUR FACE.\n\nPlease have some backbone.",
      "created_utc": 1725548757.0,
      "score": 19
    },
    {
      "id": "llp1x5a",
      "body": "[deleted]",
      "created_utc": 1725571946.0,
      "score": 18
    },
    {
      "id": "llmt2gl",
      "body": "OP I don’t know if you know much about the Charles / Diana / Camila love triangle. I have watched a lot Princess Diana documentaries including the one in her own words. Princess Diana said that Prince Charles (still Crown Prince at that time) also dismissed her suspicions and prioritised consoling Camila whenever shit went down. Even if your husband hadn’t been physically cheated on you, his action shows who he care about.",
      "created_utc": 1725546183.0,
      "score": 38
    },
    {
      "id": "llmkif3",
      "body": "She owes the family, therefore, she was paid to keep her mouth shut.  You answered questions you didn’t know.  You went in clueless and unprepared for your confrontation.  Your husband knows you better than you know yourself and knew how to confidently handle you.  You should have done the DNA test for your own sanity and information not to broadcast to everyone and handle getting a valid divorce.  There will be another opportunity to get the test done since your husband is adamant the kids/ siblings hang out.  You just have to be smarter than this.",
      "created_utc": 1725543128.0,
      "score": 18
    },
    {
      "id": "llmr1pd",
      "body": "1. He spent the night \"doing damage control\" with her rather than comforting you, his wife\n2. His mother is suspicious of their relationship as well\n3. Amy's anger seems way out of proportion to the point it's suspicious - is it not perfectly reasonable to have reservations about their relationship given how long they've known each other, her mystery baby daddy(s), and how much time alone they spend together? Obviously I'm just an outsider looking in, but it seems like she's using how furious she is at your \"outlandish\" assumptions to avoid a conversation about this.",
      "created_utc": 1725545395.0,
      "score": 18
    },
    {
      "id": "llmusml",
      "body": "Your husband is NOT this sweet supportive person you believe him to be.\n\nHe’s a MASTER MANIPULATOR who is living a double life with you and Amy. \n\nHe’s a terrible HUSBAND who leaves his wife in her time of need. Period. \n\nHe’s a piss poor excuse of a FRIEND/BROTHER to Amy by leading her on with their weird relationship and never intending to leave his wife. \n\nHe gets PRAISE for taking care of all 7? of his children he’s fathered by 2 women. \n\nHE IS NOT WHO YOU THINK HE IS! That man needs an Oscar for his performances! \n\nMy only question is what do the sleepovers look like? Is he giving baths, making dinners, reading bedtime stories? Most importantly what are the sleeping arrangements and what does that morning after look like?",
      "created_utc": 1725546884.0,
      "score": 18
    },
    {
      "id": "llzi9je",
      "body": "Why wasn't your marriage over when he just had to spend the night with her after you confronted them?  He was most worried about his relationship with the woman you just said you worried was his side piece and not his wife. That was the moment you needed the divorce. He showed you exactly how little he respected or cared about you.\n\n\nDoes your husband know his Mom also suspects him?",
      "created_utc": 1725731080.0,
      "score": 18
    },
    {
      "id": "llmhe03",
      "body": "R u n",
      "created_utc": 1725541999.0,
      "score": 17
    },
    {
      "id": "llmmqmk",
      "body": "The fact that he was in her house, spent the night to comfort her, calm her down, and not you, his wife, that needed reassurance, just left you with more thoughts and doubts is enough proof for me that he simply doesn't care, they are scared shitless that this will come out and blow up in their faces. There are 2 people saying and seeing the same thing. You and your MIL. I couldn't, maybe I'm that type of woman but the way I would leave his ass high and dry would be faster than a flash. That guy doesn't have your back, if he did he would try his hardest to do anything that would prove his innocence in this story. I wish you luck, a lot of deep breaths because you're gonna need them.",
      "created_utc": 1725543919.0,
      "score": 17
    },
    {
      "id": "llmpkoi",
      "body": "If I went to sleep at my girl-friend's (i.e a friend who happens to be female) house after my girl-friend and my wife had had a fight then I wouldn't be allowed to enter the house. Period.\n\nYou are either very naive or Luke has some kind of leverage over you.",
      "created_utc": 1725544891.0,
      "score": 17
    },
    {
      "id": "llu0ovm",
      "body": "I honestly find the most difficult part of this story to accept is that the kids themselves don’t suspect that Luke is their dad.  At least the older ones.  I would assume they suspect but don’t want to ask or bring it up, but Tom wanting to date Sophie suggests that neither of them suspect (or it’s part of an elaborate ruse by the kids to see how the parents will react, and they aren’t buying the “age gap” argument, so they are keeping it up to try to coerce the parents into explaining the real reason for their disapproval.  I mean, since they are forbidden from dating, they don’t have to do anything like kiss or touch each other sexually to play the long game).\n\nActually, after typing that out, I suspect when you tell Sophie of your suspicions that Luke is also Tom’s father, she won’t be all that surprised.",
      "created_utc": 1725646853.0,
      "score": 17
    },
    {
      "id": "llwn9yk",
      "body": "Amy was pissed and probably threatened to spill the beans if Luke didn’t spend the night, I just fucking know it.",
      "created_utc": 1725681092.0,
      "score": 16
    },
    {
      "id": "lm8fls5",
      "body": "Tom is nearly 18?  You may want to make sure he knows your home is a safe space. In case they figure out about he and Sophie.",
      "created_utc": 1725858341.0,
      "score": 17
    },
    {
      "id": "llmimf4",
      "body": "His job is to comfort you and make you comfortable.  She is expendeble. It doesn’t matter that they’ve been friends forever. Hire a pi and dig in his phone. Now that he’s been warned he’ll have covered his tracks but keep digging. .",
      "created_utc": 1725542451.0,
      "score": 35
    },
    {
      "id": "llnw0q4",
      "body": "Could FIL be Amy’s father? \n\nFIL is adamantly denying that anything could happen between Luke and Amy. They grew up together. What if he is adamant because he doesn’t want to consider the possibility that his half sibling children are in an incestuous relationship??? And / or because he doesn’t want his wife to know he cheated???\n\nOP, do you know enough about Amy’s family and background to be certain that FIL could not be her father? \n\nIf FIL is Amy’s father that could explain similar traits between her children and your husband, their uncle. Maybe Amy and Luke are not cheating. Maybe they are actually siblings and keeping it secret for FILs sake. Maybe one of them knows that they are half siblings and the other doesn’t. If FIL is Amy’s father and she has been told to keep it secret from the rest of the family, it could explain her reaction to your confronting her. Or what if FIL is Amy’s father but neither Luke nor Amy know?\n\nBut the scary possibility - What if Luke and Amy are half siblings and are knowingly or unknowingly in an incestuous relationship???? \n\nThat would make it even more important that Sophie and Tom not be in a relationship. A child who is the product of two generations of incest is far more likely to have genetic defects and deformities. \n\nOP, I’m sorry to bring this up because I feel sick thinking about this possibility. But you absolutely need to know if there is a genetic relationship between Tom and Sophie. \n\nI’m sorry to bring it up because if it’s true, it would absolutely blow up your whole life. And Tom and Amy’s lives. But you need to know.",
      "created_utc": 1725558745.0,
      "score": 35
    },
    {
      "id": "llnxofa",
      "body": "Has anyone asked Amy’s kids what happens when he stays the night? Tom is almost adult and I doubt he’s that oblivious to anything that might be going on in his mother’s bedroom.\n\nThis whole crush scenario could be the kids way of trying to find out the truth.",
      "created_utc": 1725559263.0,
      "score": 48
    },
    {
      "id": "llmn9lf",
      "body": "[removed]",
      "created_utc": 1725544102.0,
      "score": 17
    },
    {
      "id": "llmnqzg",
      "body": "Even if he’s bing entirely honest, the fact is that his complete lack of boundaries with his friend is effecting his relationship and he’s *still* prioritizing her.\n\nYour husbands behavior is inappropriate. **He agrees with that point, *yet still is having slumber parties or save his friendship?**\n\nRespectfully, wake up. It’s glaring and clear where your husband priorities. **He is not willing to create space from her. That’s a choice. He is choosing her comfort above all, because that’s easiest for him.\n\nStop ruminating on this woman, you have a husband problem plain and simple. She can only be as close or prioritized as he allows. Moreover, would he be so cool if he had the same suspicions (and slumber parties) with a male friend??",
      "created_utc": 1725544269.0,
      "score": 15
    },
    {
      "id": "llmre3z",
      "body": "Op I don’t have any advice, but I’m pulling for you. I truly hope that you get whatever piece of mind you can, this whole situation wild. You deserve the truth.",
      "created_utc": 1725545513.0,
      "score": 16
    },
    {
      "id": "llmwxn6",
      "body": "100% they were sleeping together. Luke went into damage control mode and Amy is trying to be so angry to scare off any further questions. If it wasn't true, she'd do the test just to throw it in your face once and for all. \n\nPeople often act outraged and offended when you call out the things they've done. \n\nIf Cat has her own suspicions too, then you know you aren't crazy, you aren't seeing things. Other people are noticing too.\n\nLuke 100% slept with her.",
      "created_utc": 1725547594.0,
      "score": 16
    },
    {
      "id": "llmgcin",
      "body": "The fact that Amy won’t give you piece of mind by dna one of her kids is a shame. Also I can’t believe he spent the night there. Like really!  We does he keep choosing her over you. You go to them distressed and he stays with her and comforts her. When her oldest son is 18 go to him with a dna kit and swab him and your daughter. \nIt’s also so weird that she won’t give you their father’s name. \nYou need to press your husband for a dna test. I would be like a dog with a bone. \nYou know them spending the night together they had time to really sort their story out and your hubby’s like calm down don’t over react this will pass. She has no proof. Keep asking him for the truth. It’s too obvious\n That he’s the father. Like who else could it be. You know he can’t sleep there anymore. And I’d ask the family to cut her out until she gives you proof the kids aren’t his. \nGet the dna test done.",
      "created_utc": 1725541612.0,
      "score": 86
    },
    {
      "id": "llms5jj",
      "body": "Talk to your daughter about your suspicions. They are very reasonable. Ask her to do the test herself.  She is almost 18.  Ask for her help. It’s in her own best interest.",
      "created_utc": 1725545812.0,
      "score": 16
    },
    {
      "id": "llmm71e",
      "body": "I would leave just because he left you alone, knowing your suspicions and worries, and chose Amy over you. Even if everything is platonic to chose a friend over your wife is ridiculous. I could see him taking her home and staying half an hour or so but to sleep over?! Absolutely not.",
      "created_utc": 1725543728.0,
      "score": 14
    },
    {
      "id": "llp0r1m",
      "body": "I refuse to believe this is real. \n\nI was on the fence until you said he went to spend the night with HER. Not only did you write that with your whole chest, you carried on with your story almost as if it were a side note. Like it was normal. \n\nI guess I'm just having a hard time understanding how anyone can not see gigantic red fucking flag that after you confronted them about your suspicions of them not only having an affair, but YOUR HUSBAND being the father of her kids - his first course of action was to *checks notes* go to her house, alone, and spend the night with her. \n\nTo \"save\" *your friendship* with her...... \n\nThat is wild. \n\nI promise you, this man would have come home to changed locks and his clothes in the driveway. \n\nIf this is real and not some wild creative writing project then girrrrrl.... Denial isn't just a river in Egypt. \n\nI understand that you don't want this to be happening, but it's happening. *At the very least* this man doesn't love you, doesn't respect you or your marriage. If he did, it wouldn't matter how long he's known her or his role in her kids lives, he'd do whatever he had to to calm YOUR fears and insecurities. He'd cut her off, or at the very least set rules and boundaries to make you more comfortable. \n\nLike... Why is it so damn important to him that you have a friendship with her? Why isn't giving you the attention, affection, and loyalty you clearly are craving his top priority? \n\nGirl. GIRL. The likelyhood of this not being a romantic/sexual affair is so slim it might as well be a unicorn. Looking at all the evidence you laid out..... It's like hearing hoove beats and thinking \"unicorns!\" instead of horses.",
      "created_utc": 1725571568.0,
      "score": 15
    },
    {
      "id": "llwgcye",
      "body": "The fact that you told your husband you believe he is having an affair… and then he went to spend the night with the alleged affair partner…. Girl. This man does not love you. You deserve better. Get out of there.",
      "created_utc": 1725678067.0,
      "score": 14
    },
    {
      "id": "llmhcij",
      "body": "So instead of staying with his wife he spent the night at his affair partners house up do damage control. Bet they are trying to figure out how to rig a dna test.",
      "created_utc": 1725541984.0,
      "score": 30
    },
    {
      "id": "llmjfab",
      "body": "Divorce is literally the only way forward here. Your wife is upset as fuck and you spend the night at another woman’s house? What is he even thinking? He is prioritising another woman.. that alone is enough for me to say nope",
      "created_utc": 1725542738.0,
      "score": 28
    },
    {
      "id": "llmw2qj",
      "body": "DARVO. Deny, Attack, Reverse Victim and Offender. This is a *classic* manipulation tactic.\n\nAnd it’s exactly what they did to OP. The process was complete once they had her apologizing to *them.*\n\nThey’re his kids, OP. Be real with yourself, even if they won’t. What a mess.",
      "created_utc": 1725547315.0,
      "score": 12
    },
    {
      "id": "llquhnp",
      "body": "I don't know what kind of trauma you endured early in life that would make you tolerate this level of manipulation and betrayal, but you need a therapist to help you see clearly and build a spine.\n\nHe knows you'll let him get away with anything, so of course he abandons you yet again after you accused him of cheating to spend the night with his girlfriend. Your husband is one of the worst husbands I've ever read about on Reddit. And that's saying a lot because Reddit is made up of the world's worst husbands.\n\nThe truth always comes out. Allowing this behavior to go on is teaching your daughter what to accept from her partners. Get a lawyer and your dignity.  Living like this cannot feel good.",
      "created_utc": 1725595818.0,
      "score": 13
    },
    {
      "id": "lngeli8",
      "body": "[removed]",
      "created_utc": 1726514452.0,
      "score": 13
    },
    {
      "id": "llmo39u",
      "body": "Does it even matter if they are having/had an affair at this point? \nI mean they are already in a relationship even without the sex and you are going to be sharing him with this woman and never know the truth for the rest of your life.\nYou are never going to get rid of the suspicions even with a paternity test, the doubts are always going to be there and he is obviously prioritizing her anyway. \nChoice seems clear, but I sympetize. Hope it all works out one way or another, hang in there!",
      "created_utc": 1725544386.0,
      "score": 12
    },
    {
      "id": "llmqbb9",
      "body": "They spent the night together. Girl, you’re a doormat.",
      "created_utc": 1725545144.0,
      "score": 11
    },
    {
      "id": "llq44lm",
      "body": "Luke...\"respected your feelings, and then apologized for anything he'd done to indicate he was unfaithful\"...and then IMMEDIATELY spent the night at another woman's house to comfort her and do damage control...while you..HIS WIFE..were in a vulnerable and distressed state. \nOP...seriously??? He LEFT YOU...he's doing damage control with the wrong person!\n\n In this tirade, Amy let you know how she REALLY feels about you (you think your superior..you've done nothing for her, insert her tirade here). When Amy was yelling and Luke  tried to calm the situation, did he say I know your upset, but please don't speak to my wife that way; or did he let her speak her mind regardless of how spiteful it was towards you and then say ok, relax... Because if he's not defending you and how she speaks to you, then he's condoning her...so far his loyalty is not to you.\n\nWhat DID happen was he left you...what DIDN'T happen...was Amy sending him home to check on you. In that moment, they both let you know who is most important in this relationship. And it's not you. Your husband formed a united front with another woman emotionally AND physically...and let you fly solo. My best friend is a guy, and I've known him longer than he's known his wife...And I would mediate the hell out of that conversation till I knew they were good. And if it's because of me...believe I would step back without him even having to ask...and I would make him stay and fix things, not  let him sleep over --especially if his wife thought we were having an affair!\n\nAt this point, regardless of whether he is the father or not...what Amy let you know by not sending him home that night is she knows which woman is the priority ...and by him leaving, he has shown you whose heart he protects. It's not you. \n\nAnd in all that gaslighting, why would they respect you enough to be honest about anything else?\n\nAs a girl best friend to a married guy, it makes me so angry for you...",
      "created_utc": 1725585495.0,
      "score": 13
    },
    {
      "id": "llnjtxx",
      "body": "I understand this is a very, very distressing and sad situation for you, and I'm really sorry for it 😔 \n\nBut I just wanted to say I've never been more excited to receive an update on tea as much as this, lol.  You're very articulate, it felt watching a long-awaited tv episode.\n\nThat said, I'm wondering, where does Luke sleep when he's \"spending  the  night\" at Amy's?",
      "created_utc": 1725554915.0,
      "score": 26
    },
    {
      "id": "llmpmek",
      "body": "OP, what are you even doing? At this point your marriage is over and outside of the question about Tom and Sophie, it truly doesn't matter who fathered Amy's children or if your husband has been unfaithful either physically or emotionally. It doesn't matter at all if your suspicions are right or wrong because if you're right then the only answer to this mess is divorce. If you're wrong, he still has made it clear he prioritizes her over you by going to her after the worst argument you've ever had. And if you have somehow conjured all of this up in your own head and they are entirely blameless, there is no way to repair this relationship after your accusation.\n\nFrankly, the marriage should have been over as soon as you started to think your husband might have not only been cheating for years and years, but cheating and willing to rub your nose in it by making his possible affair partner \"part of the family.\" How could you want to stay married to someone you believe might actually do that to you?",
      "created_utc": 1725544908.0,
      "score": 11
    },
    {
      "id": "llmsrxk",
      "body": "He slept with her. He sleeps with her. They’re gaslighting you.",
      "created_utc": 1725546064.0,
      "score": 10
    },
    {
      "id": "llmubqd",
      "body": "Where was your husband when you talked to FIL and MIL? Did he even travel with you and the children?\nAnd where does he sleep at Amy's place? Does he have his own room with her, in the living room or you don't know?",
      "created_utc": 1725546712.0,
      "score": 11
    },
    {
      "id": "lln9flm",
      "body": "Girl I don’t even care if he is having the affair at this point, this man does not respect you either way.",
      "created_utc": 1725551623.0,
      "score": 11
    },
    {
      "id": "llnlj0g",
      "body": "I am sorry OP I am not trying to be mean, but you are a doormat. \n\nI say this as a lifelong people pleaser. You need to stand up for yourself more. Even IF there is no affair, which I mean come on… there is, your husband should have never gone to stay with her that night. Actually, he should NEVER stay there again and the fact that he did THAT NIGHT?! My god girl, they’re basically mocking you at this point.",
      "created_utc": 1725555445.0,
      "score": 11
    },
    {
      "id": "llolwr3",
      "body": "So, to summarize:\n\n1) Wife confronts husband and \"friend\" about a potential long-term affair.\n\n2) Fight ensues; nothing is resolved. \"Friend\" goes home.\n\n3) Husband follows friend and SPENDS THE NIGHT with her, since he is more concerned with controlling the damage with his friend. \n\n4) Wife is left home alone. ALL NIGHT.\n\nOP, at this point it doesn't even matter whether the kids are his. He has chosen his relationship with her over you. I think there is no going back.",
      "created_utc": 1725566927.0,
      "score": 11
    },
    {
      "id": "llmzrx6",
      "body": "Reddit will probably have my ass for this because it's 'backwards' but men and women just aren't THAT close as friends without there being more, generally.\n\nWe all like to pretend in reality that everything can be platonic, but 9 times out of 10 it isn't, at least for one person.\n\nWhether they've done anything or not. He treats her like a girlfriend. He left you to go be with her that night.\n\nIf they aren't his kids then genuinely they have no reason to reject a relationship between the kids. Especially if the boy is a good egg. I don't think you mentioned the age gap, but I can't imagine it being too bad with the way you talk about it. Often you use the gap as more of an 'excuse' to deny them rather than an actual truth.\n\nEither way, the only doubt I have is that he's known her longer? If they really are his kids then it'd be weird she's settled in to this life of being the 'mistress'. Not something I understand personally. If he's known her longer and there was something there, it doesn't make sense to me that they never committed. \n\nReally hard one to pick.",
      "created_utc": 1725548519.0,
      "score": 36
    },
    {
      "id": "llmh9n4",
      "body": "Regardless, a divorce should happen. You're never going to be able to move past the uncertainty unless you sneak a DNA test, which kinda warrants a divorce anyway. I'd say just wipe your hands clean and leave but to help the kids, you should do that test. You cannot trust your husband and shouldn't. Anyone who cares about you would see that your concerns are valid, especially if that creep opts to spend the night with her after you confronted them. If they aren't banging already, I can bet that this situation will have them come together even more.",
      "created_utc": 1725541954.0,
      "score": 20
    },
    {
      "id": "llmq2hl",
      "body": "So now we know - the grandparents support Amy cuz they suspect it’s their grandchildren.   \nHe spent the night with her … stop being gaslit hun",
      "created_utc": 1725545061.0,
      "score": 19
    },
    {
      "id": "llq181x",
      "body": "Something is definitely not right about all of this. I personally would've just done the DNA test behind her back, but that's because I think ethics go out the window on a subject like this when they're acting the way they are. \n\nHim sleeping over at her place to console her is absolutely outrageous. Whose bed do you think he was sleeping in? \n\nMoreover, he wasn't truly concerned about your thoughts, feelings and so forth. My most recent ex would do things like this where I felt like he valued the feelings of other women in his life over mine and pretty much wasn't there emotionally for me. He would gaslight me into saying that I was jealous and insecure meanwhile he just wasn't acting appropriately. \n\nIt's a glaring red flag even if they aren't his children. \n\nThe fact that his own mother thinks the same thing you do is also telling. Most parents aren't THAT willing to believe their kids would cheat on their wife without good reason. \n\nEither way, you deserve better.",
      "created_utc": 1725584453.0,
      "score": 19
    },
    {
      "id": "llmw087",
      "body": "Question: if they are having an affair and the kids are siblings… what will you do?",
      "created_utc": 1725547292.0,
      "score": 18
    },
    {
      "id": "llmp2ww",
      "body": "[deleted]",
      "created_utc": 1725544723.0,
      "score": 7
    },
    {
      "id": "llmu81w",
      "body": "> So they spent the night together. With Luke maintaining that nothing happened.\n\nThe fucking audacity. There is no reason he needed to spend the night over there to do \"damage control.\" I think it's clear he cares more about Amy than he does about you. He should have been spending that night with YOU. Allaying YOUR fears, comforting YOU, his WIFE.",
      "created_utc": 1725546672.0,
      "score": 8
    },
    {
      "id": "lln43r1",
      "body": "Wait wait wait! He left YOU to go spend the night with her after a fight? He's fucking her. Why is he staying the night? There's literally no need. Why did he need to sleep there to smooth things over???? What can he do in his sleep? I think you're being a bit too lenient here....",
      "created_utc": 1725549920.0,
      "score": 9
    },
    {
      "id": "llna8wu",
      "body": "OP. C'mon.\n\nYou know. In your heart, you know the truth but you're clinging to this relationship. \n\nHe doesn't care about you. \n \nYou are not his priority. \n\nLeave. \n\nHe isn't going to change and you don't deserve to remain in a situation like this.",
      "created_utc": 1725551879.0,
      "score": 9
    },
    {
      "id": "llnbs2y",
      "body": "The fact that he spent the night with her would have been an absolute deal-breaker in my book. There is absolutely no reason a married man should have to spend the night with a woman he's just been asked about cheating with, unless he is cheating. By doing this one thing, he has shown you that you do not matter, but she does.",
      "created_utc": 1725552367.0,
      "score": 8
    },
    {
      "id": "llnm8g0",
      "body": "PLEASE for the sake of your daughter’s mental health tell her of your concerns. She will tell Tom- so you’re not crossing that line and it can be up to them to do the tests. You can offer to pay.  Finding out after the fact that they slept with their sibling or relative could traumatize them for the rest of their lives!!  17 yrs-15 yrs is not a huge difference and plenty of 15 yr old girls are sexually active. Decide about your marriage later but don’t delay a single day to let your daughter know. I would never forgive my mother if she let me be in a situation to sleep w my brother.",
      "created_utc": 1725555668.0,
      "score": 8
    },
    {
      "id": "llol5p2",
      "body": "You have to be the biggest idiot in the world to take back your husband for sleeping at her house after you accused him of having an affair.\n\nThey fucked. End of story.",
      "created_utc": 1725566691.0,
      "score": 9
    },
    {
      "id": "llopdh9",
      "body": "They spent the night together?\n\nJFC woman are you nuts? Or is the gas lighting that strong?\n\nThere is not a woman on this planet my husband us spending the night with. Likewise I wouldn't spend a night with a man! \n\nWTAF",
      "created_utc": 1725568001.0,
      "score": 9
    },
    {
      "id": "llpw8kd",
      "body": "Wtf did DAMAGE control mean he needed to stay the entire night? \n\nYeah go over, talk to her, even spend a few hours. By why on EARTH would he go over overnight, leaving his wife home alone, after she just accused him of having an affair with her. \"No I'm not having an affair, but I do need to go over RIGHT NOW and spend the entire night\"",
      "created_utc": 1725582689.0,
      "score": 9
    },
    {
      "id": "llqorx5",
      "body": "I’ve said “what the *fuck*” so many times during this and the previous post. I genuinely do not have anything to say after the fact that he spent the night with Amy instead of his wife. I am appalled, and I hope OP gets some actual answers because this is *fucked*.",
      "created_utc": 1725593373.0,
      "score": 7
    },
    {
      "id": "llszyya",
      "body": "This is a mess. Holy hell. The fact that someone so close to you won’t tell you who the kids fathers are or for your husband to demand of his lifelong friend to tell them the father is really suspect. I do not envy you and I have some really close female friends that are completely platonic and my wife loves. She trusts me and I trust her. I could see you spirally and what set you off would be what got to me as well. This is such an easy fix and a DNA test isn’t a big deal and Amy if she was that much of a friend should have no problem helping quell her “brothers” wife’s concerns. Has she ever been that stubborn about anything before? Why not help to mend the situation with a simple test that will put your mind at ease? If this was fiction it’s a great story but I know real life is stranger than fiction. I hope you get a good update soon and you are able to move on and all be happy together again.",
      "created_utc": 1725635144.0,
      "score": 8
    },
    {
      "id": "llnd2w7",
      "body": "Been following since the original post and after your conversation with the in laws, mostly focusing on how adamant Jim was on the relationship between Amy and Luke, it crossed my mind that there’s a possibility that Jim fathered those children. It would also explain their likeness to Luke, Amy’s inability to tell you who the father is even though it seems like a small matter, and Luke being in the middle of it all and knowing both sides yet still seeming secretive, which I’d say is more so what his behavior indicates rather than infidelity. As far as Luke is concerned, if hes trying to hide the affair, it really wouldn’t make sense to go to Amy’s house after this argument. Him consoling her might be more of a “caretaker” role to his half siblings and helping Amy deal with the emotions that this may have brought up (who knows how those children were fathered). Of course this is the more taboo variation, but after reading both of your posts this version of events makes more sense to me. What is Amy’s relationship like with Jim?",
      "created_utc": 1725552781.0,
      "score": 16
    },
    {
      "id": "llmjl1t",
      "body": "I can read anymore about this. Lady, how blind can you be? YOU LET HIM SPEND THE NIGHT WITH HER AGAIN?!?!?\n\nHe didn't give you one single thought. Only her. And, you're eating that shit sandwich, then asking for seconds with a smile.\n\nJust divorce him so they can finally be together out in the open. Even his OWN MOTHER agrees with you. Get a divorce and find some self respect.",
      "created_utc": 1725542795.0,
      "score": 21
    },
    {
      "id": "llnvsel",
      "body": "What do you mean Luke and Amy crossed the line in the past? If they have done anything sexual or made out, like, that is it girl. We are all being gaslighted now about their relationship, until now.\n\nAlso, between this and his spending the night at Amy's house the night of the fight, shows you have valid reason to have Luke do a court order to check if Tom is his. If not, you're happy Tom and Sophie are happy. The only person unhappy, is Amy.",
      "created_utc": 1725558674.0,
      "score": 15
    },
    {
      "id": "llmjlfb",
      "body": "Those are his kids and He and Amy are willing to let their kids date each other to hide their affair. Sick…",
      "created_utc": 1725542798.0,
      "score": 7
    },
    {
      "id": "llmmx0u",
      "body": "What a wild read. I can’t imagine what you’re going through. The mental gymnastics are insane. I’ll skip the “your hubby stayed the night with her” since everybody is already red flagging it. The biggest thing that stuck out to me was that Cat had obviously had the same thoughts. It’s strange that you both had the same thought about Luke fathering Amy’s children. Girl, don’t back down now. If you’re wrong, great, but if you’re not? You deserve to know and so does your family. Get your answers. You need to know.",
      "created_utc": 1725543980.0,
      "score": 8
    },
    {
      "id": "llmoe4o",
      "body": "Ma'am. You need to have a frank sit down with your husband and tell him clearly that you are no longer ok with the closeness of their relationship. If those kids aren't his, he needs to back off all together and prioritize his wife and kids.. \n\n\nI'd ask Cat to have Amy's kids over and feed them and keep the silverware and glasses and figure out who could pull DNA off them. Do the same for your kids and send it in. \n\n\nGood lord. Please get some courage to lay down perfectly acceptable boundaries.",
      "created_utc": 1725544487.0,
      "score": 7
    },
    {
      "id": "llmqis2",
      "body": "Let Grandma test her grandkids and be done with it! Your gut instincts are correct, you’re in an open marriage.",
      "created_utc": 1725545217.0,
      "score": 7
    },
    {
      "id": "llmvpsr",
      "body": "I haven't read the og post, but the way they keep rejecting a DNA test is crazy, add in the fact your HUSBAND spend the night with the woman you are doubting because of \"damage control\" instead of staying with his WIFE, you, CONSOLING YOU, it makes it even more clear that they are having an affair. \n\nWhy would someone reject a DNA test when their partner/friend is suspecting them, when its a clear way to proof them nothing is happenig? To me, a rejection after such accusations automatically means there is something going on behind the scenes. If my partner or friend would question me I would take the test just to proof them wrong. And I'm also going to be honest about this: If I had cheated, I would try everything to avoid doing the test just like them. \n\nNow also adding in the fact that even Cat had the same suspicions... That's two. That's his own mother suspecting her own son to have an affair. And that's where I would ABSOLUTELY go and trust all the gut feelings I have. Stop doubting yourself and stop caring what the fuck Amy wants or feels. That woman isn't your friend, especially not after the things she's said to you.",
      "created_utc": 1725547195.0,
      "score": 6
    },
    {
      "id": "lln03pl",
      "body": "He has two families, and even his mom knew it. He spent the night over there... to comfort her after the fight, not you. \n\nWanna know why she got so mad? Because you found out. She says you think you're better than her. No, that's her insecurities coming out. Because she knows that you're the wife and she's just the \"best friend\". Her reaction to you asking says it all. \n\nI'm telling you, MIL and I would be sneaking DNA and just keeping it to ourselves.",
      "created_utc": 1725548625.0,
      "score": 7
    },
    {
      "id": "lln7nze",
      "body": "You really don’t mind being your own husband’s mistress? They have an emotional connection that he doesn’t have with you. This is very disrespectful to you, your marriage and your children. ALL of the children. You have to see this……",
      "created_utc": 1725551063.0,
      "score": 7
    },
    {
      "id": "llnc4ms",
      "body": "Woah girl... WOAH!!! Come onnnn.....",
      "created_utc": 1725552478.0,
      "score": 7
    },
    {
      "id": "llnca6g",
      "body": "If you think your husband isn't having an affair with her you need your head examined after he left your home to go chasing after her. You KNOW they are. He PICKED her.  Not you. You are a fool if you stay in this marriage. Their entire relationship is inappropriate and abnormal. It's to the point that outside people are questioning and have concerns. You need to grow a spine for your children because you are teaching them to stay in relationships and other situations where they are lied to and gaslit. You also need to grow one for yourself.  It's beyond time to file for divorce. \n\nYou HAVE to tell your children your suspicions. Confirmed or not. You know damn well that regardless of what your daughter says she and what could very possibly be her half brother have entertained the thought of being romantically involved. They will not be children that you can forbid to date forever. Those holds end the moment they figure out how to be sneaky or they turn 18 or move out. You cannot allow them to become involved, to have sex, or worse become married or pregnant.  You need to nip it in the bud NOW.",
      "created_utc": 1725552527.0,
      "score": 8
    },
    {
      "id": "llnh15f",
      "body": "This right here has me convinced Luke is the father...\n\n> \"I’m not proud to say that I lost my temper, and said that after everything we had done for her and her children, such information was not a lot to ask and perhaps she owed it to us. I regretted the words as soon as I said them, but Amy shouted back that \\*I\\* had never done anything for her, that **it was Luke and his parents who had kept her afloat all these years, not me.**\"\n\nYes, Luke and his parents supported Amy. Of course they'd want to support their kids/grandkids. What other reason would there be for these people to completely support another woman and her children? There's never been another \"father\" to go after in terms of support. I hope OP gets out of this insane marriage.",
      "created_utc": 1725554032.0,
      "score": 6
    },
    {
      "id": "llni20h",
      "body": "All I can say is that I made the mistake of dating a man with a female bff that is \"like his stister\". Claimed their feelings were only platonic, \"ew gross I would never\".\n\n\nWell, they had fucked in the past, I'm sure they are or will again, and she was the factor in the breakup. Never again.",
      "created_utc": 1725554359.0,
      "score": 7
    },
    {
      "id": "llnvohv",
      "body": "I would just do a secret DNA test because I would have to know. Call it wrong, unethical or whatever. I would have to know for my own peace of mind. No one need know unless the results were that they are his children and then the fall out would be massive BUT I would have to KNOW!",
      "created_utc": 1725558640.0,
      "score": 8
    },
    {
      "id": "lln0x0s",
      "body": "I have been reconsidering a great many things these past few days, especially since the fight.",
      "created_utc": 1725548890.0,
      "score": 490
    },
    {
      "id": "llnt63w",
      "body": "Yeah, maybe Amy doesn’t even know who the father of her kids is.",
      "created_utc": 1725557856.0,
      "score": 9
    },
    {
      "id": "llmo84u",
      "body": "Seriously. Husband knows wife has been living this belief that he’s cheating with friend, and rather than stay with wife to reassure her and do “damage control” *WITH HIS WIFE*, he finds it more important to stay with friend and do “damage control” with her, leaving wife alone all night? That’s so gross.\n\n\nI absolutely do not believe Amy & Luke. Amy is being gross and could put this all behind them SO easily by just doing the DNA test (she wouldn’t even have to tell her kids why!), but adamantly refuses? And Amy can’t understand OP’s thought process or reasoning *at all*, instead just explodes? With no good defense other than the gaslighting? Yeah, nah, I hope this story is either fake/exaggerated, or OP gets the truth soon and can move on.",
      "created_utc": 1725544431.0,
      "score": 4305
    },
    {
      "id": "llmw4r6",
      "body": "DARVO. Deny, Attack, Reverse Victim and Offender. This is a *classic* manipulation tactic.\n\nAnd it’s exactly what they did to OP. The process was complete once they had her apologizing to *them.*\n\nThey’re his kids, OP. Be real with yourself, even if they won’t. What a mess.",
      "created_utc": 1725547333.0,
      "score": 534
    },
    {
      "id": "llmfdxa",
      "body": "I wondered why he had to spend the night and why op was okay with it.",
      "created_utc": 1725541246.0,
      "score": 1036
    },
    {
      "id": "llmjed4",
      "body": "When I got to this part, I was flabbergasted. His wife has just accused him of carrying on a decades long affair and he has to do damage control with her?! Nah, they spent the night game planning for how to handle this going forward, getting their lies straight, determining how long she’s going to stay mad, amongst other things. \n\nYou need to do the dna test somehow. Him staying the night with her and his mom’s suspicions would seal the deal for me.",
      "created_utc": 1725542729.0,
      "score": 807
    },
    {
      "id": "llmfod2",
      "body": "When reading this update, that stood out to me like it was flashing in neon!! 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
      "created_utc": 1725541357.0,
      "score": 563
    },
    {
      "id": "llmkkbt",
      "body": "I think their \"damage control\" was less about OPs relationship with Amy and more about getting their stories straight...",
      "created_utc": 1725543147.0,
      "score": 441
    },
    {
      "id": "llmsba1",
      "body": "More likely coming up with a plan & getting stories straight with his girlfriend.",
      "created_utc": 1725545877.0,
      "score": 112
    },
    {
      "id": "llmwdq5",
      "body": "They had ONE LAST ROMP. I bet they're breaking up now that the wife's talking this way and wanted one last night together.",
      "created_utc": 1725547414.0,
      "score": 93
    },
    {
      "id": "llmjuy9",
      "body": "It's looking exactly like that. There's no doubt about it in my mind.",
      "created_utc": 1725542893.0,
      "score": 89
    },
    {
      "id": "lln90si",
      "body": "Wow yes, OP has been carrying this weight for years, appears vulnerable and taken a lot of emotional damage already. What does the husband do? Go be with the girlfriend (or second wife I guess) and stay the night there. He couldve gone, talked, and come back if he needed to control Amy's damage. I guess he was controlling something more there. He showed his priority is not your life, but Amy's. Bro, you are getting played so bad... sorry about this. Two women's instincts are going off like crazy, but still everyone follows what the men say. Fuck the patriarchy fr",
      "created_utc": 1725551493.0,
      "score": 79
    },
    {
      "id": "llnzcen",
      "body": "OP I'm sorry to tell you this but you're a doormat. YOUR husband just chose to do damage control for her and not you. He cares more for her than you. Why are you not seeing this?\n\nIf my husband did left to spend a night with the woman I suspected him to have an affair with he wouldn't be coming home again. That would be all the confirmation I needed that he did not give a shit about me.\n\nHis actions should have escalated this argument a hundred fold, but you're just taking it. You're just placidly accepting that he is choosing her.\n\nOP, listen closely. I would never accept this disrespect. If they care about their relationship with you, it's their job to put your fears to rest. I value myself and my integrity far too much to let myself be treated like this. Why don't you?\n\nWhat future do you have from this? You will never stop suspecting your husband if they don't make an effort to prove you wrong. So you'll live a life with agonising resentment and suspicion building up to unbearable levels, eventually leading to divorce. Every touch between them will register in your brain, every call and text, every time he spends time with her. Where can you possibly go from here if you don't demand proof other than divorce. \n\nPlease for the love of all gods don't let him put a higher price on her peace of mind than yours.",
      "created_utc": 1725559796.0,
      "score": 19
    },
    {
      "id": "llnarsp",
      "body": "Yeah, wow, this shocked me. I could barely even read the rest. That says it all right there. This huge bombshell went off, and he had to go spend the night with not-his-wife??? Yeahhhhh, that’s his other wife.",
      "created_utc": 1725552045.0,
      "score": 14
    },
    {
      "id": "lloardh",
      "body": "Yeah I’d be telling her kids personally. I think my husband is your dad and your mom is upset and refusing to allow us to DNA test you. That’s why I don’t want my daughter dating you Tom. So if you want me can do a DNA test and if it comes back not then I have no problems with you guys dating.",
      "created_utc": 1725563424.0,
      "score": 14
    },
    {
      "id": "lloc7q8",
      "body": "This.\n\nHe didn’t see it as a priority to do damage control with his wife. With whom there is clearly a high level of distrust.  He did see it as a priority to do damage control with his “friend.” He spent the night with her! Knowing how his wife feels about their relationship.\n\nPeople say all kinds of things. It’s their actions that let us see their true priorities.        \n\nUnfortunately, in this case, his actions are telling us that the OP is the side piece in her own marriage. \n\nWhy are “salvaging” attempts taking place by Luke? OP still thinks it’s very probable that this woman has been having a decades long affair with him. \n\nI would also like to add that his willingness to have DNA testing doesn’t mean anything. They may have planned all along that if this came up Amy would refuse. So he’s perfectly comfortable saying he will have the testing because he knows Amy will never allow it to take place. \n\nThe bottom line is this…\n\nOP, I’m so very sorry. This has to be a crushing weight. I deeply wish we could help carry some of it for you in a practical way. In real life I would be cooking food for you, and your family, like a whirlwind. Because I’m a southerner and we feed pain. It’s our first solution. \n\nThe future of your marriage is in question. Two people you should be able to trust the most have wronged you at a level that is incomprehensible. So many people will be impacted by the outcome of parentage conversations. However, the truth really does set us free. I think your goal should be to do what needs to be done to reveal the truth. It may be painful to know for certain Luke has had an entire other family right under your nose, but it would free you from wondering. It may be painful for Tom to know his father was right beside him this whole time, not claiming him as a son, but it would free him from wondering about the identity of his biological father. It may be painful if this situation ends in a divorce, but it would free you from being in a relationship with a person who doesn’t care enough about you to prioritize you.\n\nAgain, I’m so sorry. You don’t deserve this. Your children don’t deserve this. Amy’s children don’t deserve this. ",
      "created_utc": 1725563889.0,
      "score": 14
    },
    {
      "id": "lln4jdl",
      "body": "Honestly, do you really think he’s sleeping on the sofa? Why is he sleeping over there if there is nothing going on? You go to your friend’s house and talk and then you go back home to YOUR WIFE AND KIDS! WTF?! What about your kids? He doesn’t give a shit about any of you. Time to have another chat with the lawyer and you really need to get more angry about this! You are waaaaay too understanding. This woman has wrecked all yours lives and even your in laws have been suspecting the same all along!!",
      "created_utc": 1725550059.0,
      "score": 1130
    },
    {
      "id": "llng3wq",
      "body": "Luke* and Amy are a couple and OP is the sidepiece at this point.\nEdited got names wrong",
      "created_utc": 1725553737.0,
      "score": 392
    },
    {
      "id": "llog3wa",
      "body": "This is the biggest red flag to me.\n\nAs a partner you should NEVER EVER sleep over at a best friends house of the opposite sex.\n\nThey fucked. You can’t convince me otherwise.",
      "created_utc": 1725565121.0,
      "score": 182
    },
    {
      "id": "llo1ofn",
      "body": "I’m cringing for OP. I really wish she’d stop being a doormat. She’s being a terrible role model for her poor daughters",
      "created_utc": 1725560530.0,
      "score": 82
    },
    {
      "id": "llox9te",
      "body": "Forreal after a huge ball dropping like this he spends the night THERE to damage control. What about OP and damage control with her?! She didn't want him to go and he just didn't care.",
      "created_utc": 1725570450.0,
      "score": 16
    },
    {
      "id": "lloy55l",
      "body": "I know the backstory of how Luke and Amy were close most of their lives and how she was also close to Luke's parents... Could Jim 75M be the dad and Amy and Luke are trying to keep OP, Cat, and the rest of the world from finding out? Luke might not be all that afraid about paternity because he knows he ain't the father... But maybe that's because he knows who is 👀",
      "created_utc": 1725570729.0,
      "score": 13
    },
    {
      "id": "llmxsf0",
      "body": "^^^\n\nImagine your WIFE who is basically suppose to be your best friend and partner in life, comes to you with these alarming concerns and nope, you go stay at 'besties' house for the night to do 'damage control'... What in the actual fuck.",
      "created_utc": 1725547875.0,
      "score": 1809
    },
    {
      "id": "llno6d3",
      "body": "I am FLABBERGHASTED. Thank goodness the MIL was there to speak with OP because I can't imagine this not eating her up, and she is honestly handling this incredibly given most would be going scorched earth a long time ago.",
      "created_utc": 1725556285.0,
      "score": 169
    },
    {
      "id": "llnt6od",
      "body": "You can damage control without spending the night. Are these adults? I can't imagine having my best guy friend coming over while his wife is at home, and not feel weird and telling them to go back home to his wife. Amy feeds on this I think.\n\nThe fact your husband said *damage control=spend the night* with Amy feels so fked up. What about you? How is Amy okay with this? Did Luke start this sister wife stuff?\n\nSomeone started the blurred boundary lines. Just because, you went with it for friendships, which is understandable, but doesn't make it less odd. This set up is not normal and this conversation is the product of that being the abnormality. And I am pretty weird. \n\nBoundaries are blurred and normality keeps getting shifted. Luke is starting to sound pretty manipulative. Like, you're getting conditioned. Now is Amy part of it, or was she also conditioned?\n\n*Luke going to Amy's for damage control and STAYING THE NIGHT is NOT OKAY NOR NORMAL*",
      "created_utc": 1725557861.0,
      "score": 112
    },
    {
      "id": "llnprww",
      "body": "Yep, this is what I thought too. And he obviously cares more about the friend than the wife. He should be staying home to console and reassure his wife yet he spends the night with the “friend”. OP, your gut is right on this.",
      "created_utc": 1725556787.0,
      "score": 39
    },
    {
      "id": "llnngz5",
      "body": "Thank you for writing this cause I spaced out and just read here and there after OP said she didn't do the test and just confronted them.\n\nI just...noped out of caring. And seeing this comment where her husband spent the night with Amy just...how much can OP disrespect herself to take this situation sitting down?\n\nAnd she suspected all this for like 5 years but didn't act cause it was \"soooo hard\" and there were \"soooo many consequences\". Literally \"fck me and my feelings, everyone else would be devastated if I ever dared stand up for myself\"\n\nI'd use the word gullible for her but honestly there's a harsher word I'm thinking of. Guess I'm a big ole meanie.",
      "created_utc": 1725556061.0,
      "score": 148
    },
    {
      "id": "llnp9wl",
      "body": "And the 1 thing he has her back on is his daughter not dating Tom. Because he knows they are siblings",
      "created_utc": 1725556630.0,
      "score": 20
    },
    {
      "id": "llo09e7",
      "body": "Yes!!! I won't be wasting my words to advise on someone that is just so blind like OP ,so many red flags and gaslighting and she just tried to make excuses for them and tried to believe all that Bull crap they spilled out  , sister wifes vibes.",
      "created_utc": 1725560085.0,
      "score": 7
    },
    {
      "id": "llmk6k9",
      "body": "This hit me like a pile of bricks, to be honest, because they definitely are that close. \n\nI think in my heart I know the affair is happening, I just latch onto any trace of evidence that it might not be because I wish it wasn't.",
      "created_utc": 1725543009.0,
      "score": 1543
    },
    {
      "id": "llmr7a7",
      "body": "And even though he might not have physically cheated on OP, he most certainly has cheated on her emotionally!!",
      "created_utc": 1725545448.0,
      "score": 50
    },
    {
      "id": "llmqtmg",
      "body": "Cheating or not, that would be the last straw for me. Even if he thought he needed to do damage control, why did it involve sleeping there? He couldn’t have just had a conversation and then come home? Or talked ok the phone? Or met up the next day? Or done literally anything that a normal person would do in this scenario? He showed who his priority is, and who his priority definitely is not.",
      "created_utc": 1725545319.0,
      "score": 713
    },
    {
      "id": "llmmesx",
      "body": "Fr!!!! Honestly that itself would be it for me. And to me its a signal he might be cheating. I would 100% leave him and demand a paternity test, if they could or i would ask the kids. Because if they are old enough to date they are old enough to make up their own minds.",
      "created_utc": 1725543804.0,
      "score": 381
    },
    {
      "id": "llmt366",
      "body": "I would literally be done with him after that alone.",
      "created_utc": 1725546192.0,
      "score": 14
    },
    {
      "id": "llmrvbv",
      "body": "That would be a deal breaker for me!",
      "created_utc": 1725545695.0,
      "score": 6
    },
    {
      "id": "llnwbk5",
      "body": "My blood pressure is literally rising, I wanna punch this man so hard 😭😭 OP you deserve to be loved and to be someone's first priority. You definitely need to set firm boundaries regardless of continuing this relationship or not. These people have long made you and your concerns small but a married man would NEVER sleep at another woman's house SPECIALLY if she's single. Even if they never had sex, the lines between platonic and romantic are clearly blurred, can you think of your children - who are siblings - acting the same way your husband does with her? I will personally come to your house and slap some sense on him. Be strong.",
      "created_utc": 1725558839.0,
      "score": 156
    },
    {
      "id": "lln0dko",
      "body": "I think you're right honestly.",
      "created_utc": 1725548714.0,
      "score": 273
    },
    {
      "id": "lln6b7d",
      "body": "He has, and continues, to tell OP and Amy who he prioritizes with his actions. Leaving OP for the entire night to console Amy under the guise of trying to salvage OP and Amy's relationship clearly shows whose feelings he values more. Plus, he has selfish reasons to mend the friendship because then he won't have to choose between the two women.\n\nI don't see things ending well for OP, unfortunately. She'll need a lot of therapy to help resolve this mess.",
      "created_utc": 1725550630.0,
      "score": 9
    },
    {
      "id": "llmkq19",
      "body": "Oh, it's in the cards. It's not a sure thing but I'm very much looking into it at the moment. Thank you for the kind words.",
      "created_utc": 1725543205.0,
      "score": 450
    },
    {
      "id": "llo4so9",
      "body": "Not only did he spend the night with his affair partner but OP was left apologizing to them!! My god.",
      "created_utc": 1725561521.0,
      "score": 17
    },
    {
      "id": "llmygii",
      "body": "This is my nightmare.",
      "created_utc": 1725548093.0,
      "score": 349
    },
    {
      "id": "lln96wz",
      "body": "Exactly. The kids need to know WHY you’re against them dating.",
      "created_utc": 1725551547.0,
      "score": 108
    },
    {
      "id": "llnt28v",
      "body": "Honestly. Daughter is old enough to learn about this if her father isn’t willing to solve the problem himself.",
      "created_utc": 1725557822.0,
      "score": 20
    },
    {
      "id": "llobzmp",
      "body": "Yeah and OP doesn't need to be the only 'bad guy' here. She should really go talk to MIL again, just the two of them, lay everything out, and ask for her support and advice. sounds like she's really close with MIL and that they share the same suspicions. OP needs someone on her side. She's being manipulated right now and needs someone else to back her up.",
      "created_utc": 1725563816.0,
      "score": 13
    },
    {
      "id": "llmktfh",
      "body": "100% this.  I don't care how close they are. Sleeping over is a hard no.  And doubly so after what just happened.\n\nLike that needs to be a hard rule moving forward.",
      "created_utc": 1725543239.0,
      "score": 125
    },
    {
      "id": "llmfqrz",
      "body": "100% this!!!",
      "created_utc": 1725541382.0,
      "score": 58
    },
    {
      "id": "llmoy28",
      "body": "Using “naive” to describe it is quite a generous understatement. The last time me and my partner had an argument resulting in one sleeping elsewhere for the night was the night I decided to get divorced…",
      "created_utc": 1725544679.0,
      "score": 22
    },
    {
      "id": "llmvtrc",
      "body": "He's hanging himself with his own rope. Emotional affairs are still affairs",
      "created_utc": 1725547232.0,
      "score": 12
    },
    {
      "id": "llmmoir",
      "body": "I don’t think I’d have my actual brother sleep over at my place if i got into a fight with his wife. That’s so inappropriate.",
      "created_utc": 1725543898.0,
      "score": 29
    },
    {
      "id": "llmjk7k",
      "body": "This is a good point, thank you. I might use it against her if we end up clashing over this again.",
      "created_utc": 1725542786.0,
      "score": 302
    },
    {
      "id": "lln1kg4",
      "body": "Exactly!!! If I was truly innocent in that situation, I would do what I could to prove it.",
      "created_utc": 1725549099.0,
      "score": 17
    },
    {
      "id": "llmfs3e",
      "body": "I certainly am. Luke and Amy claim it's because of the age gap.",
      "created_utc": 1725541396.0,
      "score": 273
    },
    {
      "id": "llmhex1",
      "body": "It might be, I don't know. I'm willing to try anything at this point. \n\nYou're right about the uncertainty. It's killing me.",
      "created_utc": 1725542009.0,
      "score": 207
    },
    {
      "id": "llmja5u",
      "body": "Supposedly he was trying to save my friendship with Amy and yes, I feel incredibly stupid now.",
      "created_utc": 1725542687.0,
      "score": 330
    },
    {
      "id": "llmyzpl",
      "body": "It would genuinely be a way to get the test done on Tom if he were to find out and then agree to take it. I assume his interest in Sophie would fizzle out at that point.",
      "created_utc": 1725548266.0,
      "score": 121
    },
    {
      "id": "lln4y77",
      "body": "No, it didn't come up, but perhaps I should fill them in on that.",
      "created_utc": 1725550192.0,
      "score": 106
    },
    {
      "id": "llmr5qz",
      "body": "I don't know that Jim and Cat would cut her off, come what may. If nothing else, they'd want to make sure the children are taken care of. \n\nNo, I don't think she sees it that way at all. In her mind, she was in Luke's life first, so if anyone was going to go, it would have been me, not her. She definitely never viewed me as someone with the power to \"get rid\" of her. To be fair, I never wanted to be that kind of girlfriend either.",
      "created_utc": 1725545434.0,
      "score": 38
    },
    {
      "id": "lloba7b",
      "body": "Why would she be shitting bricks? Luke went running to her instead of taking care of his wife. If anything, she feels like she won",
      "created_utc": 1725563591.0,
      "score": 15
    },
    {
      "id": "llmjzad",
      "body": "I want to believe them because they're so important to me but I think everyone saying this is probably right.",
      "created_utc": 1725542936.0,
      "score": 84
    },
    {
      "id": "llnb9o1",
      "body": "Yes, this is the most important thing. Stopping the relationship between Tom and Sophie until it is absolutely certain that they are not siblings. I don’t know why so many commenters are focusing mostly on Luke spending the night at Amy’s house. OP wrote the original post because she was concerned about her daughter’s well-being, and preventing an incestuous relationship between the children is more important than anything else.",
      "created_utc": 1725552204.0,
      "score": 9
    },
    {
      "id": "lln1btd",
      "body": "I mean, she DID deny that Luke was the father. She didn't avoid that question. She just refused to say who the father actually WAS, but she very definitively stated that it wasn't Luke.",
      "created_utc": 1725549023.0,
      "score": 67
    },
    {
      "id": "lln7r9v",
      "body": "Kaylee really wants to know. She always gets shut down. \n\nTom has explicitly said that he doesn't care.",
      "created_utc": 1725551093.0,
      "score": 88
    },
    {
      "id": "llmg0rd",
      "body": "I can ask Cat to do that, but something tells me Amy wouldn't like it if she knew or suspected that I talked to Cat about this.",
      "created_utc": 1725541488.0,
      "score": 132
    },
    {
      "id": "llmlvyo",
      "body": "Why? What's the difference, they've been sleeping together for years.",
      "created_utc": 1725543620.0,
      "score": 28
    },
    {
      "id": "llnp4on",
      "body": "I have, yes. At this point separation is very likely. \n\nHe's agreed to go low-contact with her for now (or low-ish, I guess) and to not be alone with her.",
      "created_utc": 1725556585.0,
      "score": 69
    },
    {
      "id": "llmqtmc",
      "body": "Thank you for reinforcing that I am not insane, I really need that right now.",
      "created_utc": 1725545319.0,
      "score": 28
    },
    {
      "id": "lln3fry",
      "body": "My fear is that they would. That they'd bury their heads in the sand and let sleeping dogs lie, in the hope that it would be a brief and insignificant high school romance, or in the hope that between the three of us, we could prevent anything from ever happening. It's just a suspicion, though. I don't know enough of the proper details.",
      "created_utc": 1725549707.0,
      "score": 43
    },
    {
      "id": "llmvmpt",
      "body": "It has. She's never given conclusive answers, not even to her kids. It's something they've just had to accept over the years.",
      "created_utc": 1725547166.0,
      "score": 26
    },
    {
      "id": "lln66pn",
      "body": "She could try.",
      "created_utc": 1725550589.0,
      "score": 28
    },
    {
      "id": "llqykg7",
      "body": "Unfortunately I think you're right.",
      "created_utc": 1725597801.0,
      "score": 14
    },
    {
      "id": "llmlcrw",
      "body": "The rare allergy has me convinced. That alone makes the suspicion reasonable enough for anyone to at least ask. That’s a big deal and they should have seen this coming at a minimum. It looks so bad they almost have no right to be upset.",
      "created_utc": 1725543430.0,
      "score": 74
    },
    {
      "id": "llmgw8k",
      "body": "Also you can ask Luke to talk to his parents and remove Amy’s kids from their will. I wonder what would be his reaction to that.",
      "created_utc": 1725541819.0,
      "score": 42
    },
    {
      "id": "llmz1zu",
      "body": "Thank you, and trust me, I have let him know.",
      "created_utc": 1725548286.0,
      "score": 51
    },
    {
      "id": "llmwleb",
      "body": "He doesn't. Or if he does, he's never told me. So far as I'm aware, he doesn't know. \n\nI don't like ultimatums either but I agree that some sort of boundaries need to be set.",
      "created_utc": 1725547484.0,
      "score": 31
    },
    {
      "id": "llmj1sg",
      "body": "It already has a dash cam. I've look at it. Nothing significant.",
      "created_utc": 1725542604.0,
      "score": 22
    },
    {
      "id": "llqzr0w",
      "body": "You, stranger on Reddit, are wonderful yourself for what you said. Thank you. I really needed it. \n\nLuke and Amy flatly denied having ever done anything intimate. Never slept together. I didn't specifically ask if they had ever kissed, but they told me years ago that they hadn't.\n\nI didn't mention Tom and Sophie to my in-laws, but that's another potential step I'm considering. \n\nI'm the same race as Luke, not Amy. Culturally, emotionally, I don't think it's affected anything to do with out relationships, I only bring it up because of genetics and paternity. \n\nIn picturing all of them, the answer is...yes and no. Some of them look more like they could be related than others. Some of them take after their parents more than others. Kaylee for instance, looks a lot like Amy, but Sophie is kind of a mix of me, Luke, and our other relatives? It's kind of a spectrum.",
      "created_utc": 1725598421.0,
      "score": 29
    },
    {
      "id": "llmmc54",
      "body": "Thank you for understanding. It feels like no matter what I do, if I want to actually escape this situation, I have to blow up my life and the lives of everyone I love. I don't want to do that, but I don't think this status quo can continue.",
      "created_utc": 1725543778.0,
      "score": 71
    },
    {
      "id": "llmil5g",
      "body": "I don't know that Amy would admit to anything, even at the threat of her children being cut out of the will. She can be stubborn. It's an idea, though.",
      "created_utc": 1725542439.0,
      "score": 44
    },
    {
      "id": "llmnor6",
      "body": "I've looked in it before, found nothing. If I get the chance, I'll do it again.",
      "created_utc": 1725544248.0,
      "score": 15
    },
    {
      "id": "llmpvcd",
      "body": "We have, we talked a lot the following morning and have since we arrived to stay with my in-laws. That's what gave me hope, is that these talks went well. \n\nLuke was...not there, when the talk with the in-laws happened. They checked in on me privately. \n\nHe's agreed to set more boundaries with Amy.",
      "created_utc": 1725544993.0,
      "score": 26
    },
    {
      "id": "llmx42c",
      "body": "There's a lot of resemblance. Kaylee has an allergy that, if it wasn't inherited from Luke, the odds of my meeting two people who have it are just...really slim. \n\nI don't know anymore. I miss her friendship but I hate how she handled this. \n\nAn emotional affair, yeah, I think in the very least, it is that.",
      "created_utc": 1725547654.0,
      "score": 59
    },
    {
      "id": "llx8d1i",
      "body": "I doubt she sees herself as the sidepiece or \"other woman.\" The vibe I get is that she thinks of me that way and thinks I should \"know my place.\"",
      "created_utc": 1725693077.0,
      "score": 58
    },
    {
      "id": "llxdi5m",
      "body": "Actually, I think you have it backwards.   Amy has what she wants, it's Luke who is \"unhinged\" to have let it continue.   Amy gets pregnant whenever it looks like Luke is getting too committed to his own wife, pulling him back to her.   Amy complains about the OP in a manner that makes it clear she thinks that she is just as important as the OP and should not be making any demands at all about her own husband.   Luke is the weak one here.",
      "created_utc": 1725696612.0,
      "score": 9
    },
    {
      "id": "llmvrye",
      "body": "Things cannot continue as they are, no.",
      "created_utc": 1725547215.0,
      "score": 19
    },
    {
      "id": "llp4bib",
      "body": ">You need to be like 50x more angry. I want to shake you and hug you at the same time. Smh.\n\nTHIS IS THE VIBE",
      "created_utc": 1725572737.0,
      "score": 11
    },
    {
      "id": "llnf5bh",
      "body": "Yep and who did he end up with? There's your answer. And Mama Queen KNEW he was after Camilla too.",
      "created_utc": 1725553434.0,
      "score": 15
    },
    {
      "id": "llzr1q9",
      "body": "Because denial is a river in Egypt and I'm an Olympic swimmer. \n\nHe does not know, and I am not planning to enlighten him.",
      "created_utc": 1725734041.0,
      "score": 36
    },
    {
      "id": "llu89lz",
      "body": "Funny you should say that.",
      "created_utc": 1725649291.0,
      "score": 11
    },
    {
      "id": "lm8go82",
      "body": "He knows.",
      "created_utc": 1725858967.0,
      "score": 27
    },
    {
      "id": "llmkvm3",
      "body": "I would tell my daughter my suspicions and have her talk to the son and have her convince the son to do a dna test.",
      "created_utc": 1725543261.0,
      "score": 18
    },
    {
      "id": "llnx957",
      "body": "Honestly, I do not know enough about Amy's background to be certain. It doesn't seem like the kind of thing Jim would do, but then, there was a time I'd have said the same about Luke. \n\nIt just isn't compatible with Luke and Amy likely having an affair unless neither of them know. But I feel like Jim would have told at least them if he had even an inkling of that and there's been more than an inkling. \n\nAlso, Amy's children are all pretty much healthy, apart from Kaylee with her allergy, but Luke has that too. \n\nWithout getting into specifics, Luke and his parents are all one particular race, and Amy is a different race. In Amy's children, I can see features that suggest they are a blend of both races. That said, it's not IMPOSSIBLE that Amy is biracial. She could be. \n\nBut it's still pretty far fetched.",
      "created_utc": 1725559129.0,
      "score": 48
    },
    {
      "id": "llmy6lt",
      "body": "Thank you, I appreciate this.",
      "created_utc": 1725548003.0,
      "score": 17
    },
    {
      "id": "llmzhze",
      "body": "No, she's 15. It's Tom who's almost 18. \n\nTelling her would cause another implosion. But I may have to do it anyway.",
      "created_utc": 1725548429.0,
      "score": 36
    },
    {
      "id": "llqyis6",
      "body": "I was bullied as a child. I don't know if that's relevant.",
      "created_utc": 1725597779.0,
      "score": 12
    },
    {
      "id": "lngk7a5",
      "body": "I understood that reference.",
      "created_utc": 1726516229.0,
      "score": 11
    },
    {
      "id": "lln6t8t",
      "body": "It's close to 3 years, my daughter is 15. But, Tom is basically a \"good egg.\" \n\nI don't understand why, if Luke loves Amy this way, he didn't just date/marry her conventionally.",
      "created_utc": 1725550790.0,
      "score": 42
    },
    {
      "id": "llq50th",
      "body": "Normally I would have thrown ethics out the window too, but, there were children involved. That gave me pause. \n\nSupposedly he slept on the couch. Supposedly. \n\nI agree that I do deserve better.",
      "created_utc": 1725585818.0,
      "score": 32
    },
    {
      "id": "lln40sk",
      "body": "Ultimately I think we'll have to divorce. I don't want the two sets of siblings to lose each other, they'll still keep in touch (Though Tom and Sophie might want to spend some time apart...) but the life we all knew is going to be gone.",
      "created_utc": 1725549894.0,
      "score": 66
    },
    {
      "id": "llmvq1h",
      "body": "A grand total of nothing. She's very evasive about this.",
      "created_utc": 1725547197.0,
      "score": 16
    },
    {
      "id": "lltpopy",
      "body": "Amy is quite stubborn and has always been private about certain things (such as the father of her children) which I always have respected but this is the first time she's been THIS cagey about something, that I've seen. \n\nI will have an update later today. I didn't expect to have one this soon but things have happened.",
      "created_utc": 1725643336.0,
      "score": 38
    },
    {
      "id": "lln3698",
      "body": "I think your relationship has no future because it is consuming you, I am sorry to tell you this because you are a wonderful person who puts up with a lot for the people you love, but now is the time to prioritize yourself🫶",
      "created_utc": 1725549622.0,
      "score": 172
    },
    {
      "id": "llq41d2",
      "body": "Keep in mind that the two of them ganged up against you in that fight. They had each other's backs while you had no one. Keep in mind you had no one. When push comes to shove you have no support. You are on your own. \n\nIf you are going to divorce you need to do it before any DNA tests because you will have child support based on just your children. If her kids were declared to be his and child support was established then your children would get much less. The first children don't get a lesser amount when the parent has other children with another partner. Your children need to be the only legal children.",
      "created_utc": 1725585464.0,
      "score": 61
    },
    {
      "id": "llq9f21",
      "body": "Also OP, Luke might not be the father to all 4 kids, but I would bet ANYTHING that's he's the father to at least 1 of them.",
      "created_utc": 1725587404.0,
      "score": 13
    },
    {
      "id": "llnvcza",
      "body": "I'm sure that may be the reason and because he knows that if she admits that he may be the father of the kids they would no longer have the same lifestyle since separating from OP he would have to pass on alimony along with several other things (if you add up the kids Amy has, that man is screwed XDD)",
      "created_utc": 1725558541.0,
      "score": 11
    },
    {
      "id": "llnh618",
      "body": "I was on the fence until then. OP if you see this he just told you who he values more.",
      "created_utc": 1725554075.0,
      "score": 1864
    },
    {
      "id": "lloaybq",
      "body": "Right!   OP needs to open her eyes.  She knows it’s true and just won’t admit it.   Why else would husband be against Tom and Sophie if he didn’t have suspicions.  He could solve it by DNA or through actions - cutting Amy out and saying “You know I’m not thrilled about Sophie dating but Tom is a good dude and I am ok with this.”    \n\nInstead he gaslights and spends the night with his affair partner instead of being a husband and father.",
      "created_utc": 1725563485.0,
      "score": 296
    },
    {
      "id": "llozlxz",
      "body": "Even his mother thinks it and that Amy’s kids are her grandkids. This is going to hit the fan. I can’t believe he went and spent the night at her house. Like what the actual fuck is that!",
      "created_utc": 1725571201.0,
      "score": 236
    },
    {
      "id": "llojagf",
      "body": "u/PsychFactor\n\nThe 2 above comments are on point\n\nI find it VERY suspicious that he stayed all night with her and not with you",
      "created_utc": 1725566114.0,
      "score": 217
    },
    {
      "id": "llo33zh",
      "body": "The wife doesn’t even register as 10th priority in this marriage. First it’s Amy, then his kids with OP, then Amy’s kids, then the family dog probably, then the Starbucks barista, then maybe just maybe he’ll give OP a second thought",
      "created_utc": 1725560985.0,
      "score": 331
    },
    {
      "id": "llp964w",
      "body": "I can't agree more! Amy and husband have so much to lose from doing a DNA. If there was nothing to hide Amy would have agreed right away to prove her innocence and show that the wife is crazy, which she is not. She is spot on!!!",
      "created_utc": 1725574378.0,
      "score": 67
    },
    {
      "id": "llo3nej",
      "body": "💯💯",
      "created_utc": 1725561157.0,
      "score": 18
    },
    {
      "id": "lln7oli",
      "body": "There's no reason that damage control for a conflict in a *friendship* would need to take place between midnight and 8 am.",
      "created_utc": 1725551069.0,
      "score": 630
    },
    {
      "id": "llmsd8v",
      "body": "She's been ok with him sleeping with Amy for years and having a second family so what's one more night right? \n\nSeriously though, my eyes rolled so freaking hard, I have a headache now. She has zero self esteem to allow them to do this. For real, why would you care if Amy doesn't want to be friends anymore? She's stomping on familial boundaries. Even her MIL knows it. Even if those kids aren't his, Amy is way too intertwined with her gross husband. \n\nUgh, get a spine OP",
      "created_utc": 1725545898.0,
      "score": 936
    },
    {
      "id": "llnnzj2",
      "body": "Because they have spent years manipulating her and likely also years perfecting their defence that surely was ripe with gaslighting. I mean she clearly still believes it and they still made her apologise, repeatedly, and let him go there to spend the night. She is so brainwashed it’s honestly a miracle that she is seeing past it to form suspicions.",
      "created_utc": 1725556225.0,
      "score": 9
    },
    {
      "id": "llnfth2",
      "body": "[removed]",
      "created_utc": 1725553646.0,
      "score": 120
    },
    {
      "id": "lln7l07",
      "body": "“Damage control” was making sure the girlfriend would keep her mouth shut and not decide to crack and tell his the truth about the affair he’s been having.",
      "created_utc": 1725551036.0,
      "score": 191
    },
    {
      "id": "llrk5ym",
      "body": "Hell no they aren't breaking up!!! That's about as naive as OP. They've been with each other for decades!! She wants to continue to be taken care of financially and he wants to keep fucking her and keep his first family.",
      "created_utc": 1725611294.0,
      "score": 8
    },
    {
      "id": "llnzh0f",
      "body": "Bro, that's not patriarchy. Amy and Luke doing their thing, planning skimming, Amy and Luke are both off. \n\nEquality in this responsibility in gaslighting the OP. Amy has two families helping her out a lot and a surrogate husband. She gets the attention, if she storms off. It is sexist to assume Amy can't think for herself and only Luke is the mastermind. Amy has been a pro at this. Chicken or the egg between Amy and Luke here. Both guilty and have nothing to do with the patriarchy imo. Amy is not helpless as she portrays it. She is tactful. I can't tell who manipulates best, Amy or Luke.",
      "created_utc": 1725559836.0,
      "score": 12
    },
    {
      "id": "llp7k24",
      "body": "Oh, I'm sure they were just talking in bed and HAPPENED to fall asleep. It's all innocent!",
      "created_utc": 1725573821.0,
      "score": 82
    },
    {
      "id": "llo3hby",
      "body": "Luke and Amy. Tom is Amy’s son",
      "created_utc": 1725561104.0,
      "score": 10
    },
    {
      "id": "llovk1s",
      "body": "They've BEEN fucking ***",
      "created_utc": 1725569906.0,
      "score": 89
    },
    {
      "id": "llnnj5d",
      "body": "Yeah that’s his second wife. And that’s why neither him nor Amy want her eldest and their eldest to date. Because they know for a fact that they are siblings but they want to not be caught more than they want their children to not fuck a sibling unknowingly.",
      "created_utc": 1725556079.0,
      "score": 461
    },
    {
      "id": "llnjl6h",
      "body": "…and that they can still be friends.\n\nLike this guy demands his wife and his mistress are “friends”. Like a sister wives situation. Ick.",
      "created_utc": 1725554839.0,
      "score": 373
    },
    {
      "id": "llo2a6u",
      "body": "Her husband has no idea how she could possibly think that Amy’s kids are his…and then he proceeds to spend the night with Amy 😳",
      "created_utc": 1725560722.0,
      "score": 84
    },
    {
      "id": "llo13l3",
      "body": "Right? \n\nI wonder what damage control entails in this situation? \n\nWhat, like, let me massage your shoulders that have become stiff from all this \"stressful situation\"?\n\nOr let me sleep on this your couch and guard your house to keep you safe in case my wife comes and tries to, I don't know, bash you in your sleep?\n\nWhat is he doing exactly?",
      "created_utc": 1725560347.0,
      "score": 18
    },
    {
      "id": "llonpv1",
      "body": "This is it OP. If my husband came at me with these accusations, I’d be desperately trying to comfort him and invalidate them. Not traipse off and sleep with my AP and masquerade as “damage control”",
      "created_utc": 1725567488.0,
      "score": 15
    },
    {
      "id": "llo2k6a",
      "body": "Honestly, I was just sad. I hope that this is a creative writing experiment for OP because this was depressing as hell to read. This woman has no spine and she’s teaching her daughter’s that their needs won’t matter when they get married eventually because women have no value. That’s what she’s teaching them. I hate it",
      "created_utc": 1725560810.0,
      "score": 48
    },
    {
      "id": "llo2tf5",
      "body": "How about damage control to your freaking marriage? If you’re at the point where your wife thinks you’re leading a double life and had kids with another woman, your marriage is in the toilet. Your #1 and only priority should be fixing your marriage. But no, go ahead and sleep with your affair partner, I mean girlfriend, I mean friend.",
      "created_utc": 1725560891.0,
      "score": 46
    },
    {
      "id": "llmqfr9",
      "body": "You are creating fake lines on what constitutes an affair. It's clear that his emotional closeness with her is not appropriate for YOUR definition. It doesn't matter if they gave sex, what matters is if you think you can trust him. You know you can't.",
      "created_utc": 1725545188.0,
      "score": 738
    },
    {
      "id": "llmz2ps",
      "body": "You both were upset. He LEFT YOU to go to her. To make sure SHE WAS OK. Let that sink in. Your needs do not matter to him. YOU don't matter to him.",
      "created_utc": 1725548293.0,
      "score": 518
    },
    {
      "id": "llmtmdc",
      "body": "I'm sorry.  But is this the type of marriage you want to model for your kids?  One where the father leaves to see another woman and family often while mom puts all her needs and wants aside?  This is not normal at all.  Dad is basically raising two families and living a lie.  You've been swallowing your feelings for YEARS for their sakes but what about what you want and need?  This is fucked up!  A divorce will hurt everyone but it's the choices of them not you that caused the hurt.",
      "created_utc": 1725546420.0,
      "score": 296
    },
    {
      "id": "llmy731",
      "body": "He spent the night there to comfort her when you were so upset and wounded. For me, that is clear evidence. I cannot understand why you let him back in the next day. It's just bizarre to me that you accept his spending the night with this other woman whenever he wants, even in the middle of a big marital crisis. \n\nOP, I am a mom, and I want to hug you and then give you a little shake. I think you could use some therapy. Why do you accept this???",
      "created_utc": 1725548008.0,
      "score": 135
    },
    {
      "id": "lln1h2f",
      "body": "Hopping on here to suggest having MIL do the paternity test. If those kids ever spend the night over there, you can use one of those “discreet” toothbrush tests and find out if the boy is your husband’s son. \n\nI think the uncertainty and anxiety will eventually destroy your marriage anyway so finding out for peace of mind will help you sort out what you want to do. They are running the narrative here and boxing you in which seems coordinated and frankly, slightly diabolical. Like your husband said he’d do the DNA test while knowing that she would say no (because they planned it that way), getting him off the hook. \n\nIf it’s true he’s the father, you don’t ever have to admit you did the test or even say you know the truth. You just say their emotional closeness and the fact they won’t cooperate with the tests has made it too difficult to continue in the marriage. \n\nThe painful thing will be telling your daughter if they pursue a relationship but it has to be done if your husband is the boy’s father. You can be honest and tell her your “worries” without admitting you did the test and not feel guilty because your husband and his “best friend” put you in that position with their actions.",
      "created_utc": 1725549069.0,
      "score": 91
    },
    {
      "id": "llmyleu",
      "body": "Even if they’ve never kissed or had sex and all they do when he stays over is just sit up chatting or watching movies, it’s way too much. It’s at least a sort of emotional affair. She’s using him as a surrogate husband and father even if those kids aren’t his and even if they’d never been  intimate. And he’s using her as a supplementary wife. The fact he stayed with her after what you revealed about your concerns is insane.\n\nEven if he thinks she’s the one who needed comforting because you’re the one who hurt her feelings with this accusation, that just shows he puts the two of you on equal footing at least. You’re his wife he’s meant to put you first. That means in a situation like that even if you hurt her feelings with an accusation (even if it was false) the fact you’re upset and worried and need reassurance means he stays with you. The fact you didn’t want him to go with her means he stays with you. Even if they never slept together, at the very least he definitely sees her as another wife figure, someone whose feelings and needs he has to address and accommodate at least as much as he does yours and that’s just wrong!",
      "created_utc": 1725548137.0,
      "score": 228
    },
    {
      "id": "llmtvrm",
      "body": "There’s always been an Emotional Affair between them, which still is disrespectful to your marriage.",
      "created_utc": 1725546531.0,
      "score": 111
    },
    {
      "id": "llnh0g0",
      "body": "Not to put to fine a point on it, but talking to them did absolutely nothing but give her an extra night of cuddling and consoling by your husband. Their response tells you everything you need to know though.\n\nHim sighing and looking hurt wasn't because you were accusing them of things they didn't do. It was because he thought the two of you had an unspoken understanding not to talk about his longstanding affair and the whole other family he spawned right under your nose. He realized the gig was up, BUT HE LIED TO YOU SOME MORE ANYWAYS.\n\nAnd his affair partner going nuclear was because she's spent her entire life accepting that she was the other woman with diminished standing and less time and attention from him even though she had multiple kids with him. She believed that was the price of getting to keep him in her life, getting taken care of and for their affair to continue literally for years unabated. You're threatening to blow up her life. Will his parents still want to support her? Will her kids hate her? Most likely the two who are falling in love will go scorched earth on her for all the lies and cheating? That's the reason she will burn in hell before she allows DNA testing. It will explode her life and permanently change everything.\n\nI'll let you in on a little secret. THIS WOMAN HAS HATED YOU ALL ALONG because you had everything she wanted in life. She had to live her whole life on your leftovers. She said you have never done anything for her. I disagree. You shared your husband with her and allowed his parents to divert resources to an affair partner and the kids they had together. If you had objected after the first, she would not even have the children she does right now. I think you did quite a bit for her.\n\nOf course you husband wants the two sister wives to reconcile. He's spent a lifetime having it all his own way on his parent's dime. He doesn't want to give up his side piece, nor does he want to be sued for child support, even though his parents would likely pay it. He wants both of you and all his legitimate and illegitimated children to be one big happy family. He'd have married you both, but since polygamy is illegal and you might not have agreed to it, this is the best he can do.\n\nI will reiterate my former advice. You and CAT need to meet up with Tom and just tell him what you believe his happening. Tell him, he's the oldest and you trust him to help you do the right thing. Tell him that if he takes the DNA test and there no relationship, that you would be delighted to see him with your daughter. If not, you know that he doesn't want to end up being in a relationship with his own biological half sister. That boy will allow you to swab him so fast it will make your head spin. Then you will know. Maybe wait until he turns 18 though. Then his mother won't have anything to say about it.\n\nAlso, you need to sit down with your husband one on one and tell him that you know all the way down to your bones those kids are his and because you love him, you will always love his children, even the one's you didn't carry. HOWEVER, it's the lying that tearing your up inside. Tell him that you are giving him one chance to come clean and if he does, you'll the whole thing with Amy go. Tell him that everyone deserves honesty, even the kids. Honesty is what separates decent people from indecent people. Tell him that if he won't or can't be honest with you that you are reconsidering the relationship. Tell him you've talked to his mother and she already knew those kids were his and that's the reason his parents have treated them as such. Tell him it's disrespectful to you and his parents to keep up this travesty of a lie. Remind him that Amy's kids deserve to be acknowledged by him and even that they deserve a place in his parent's will. You have to give him a reason to finally come clean after all these years.\n\nOnce he admits to it, then start talking to him about why when both of you were upset and YOU WERE THE AGRIEVED PARTY that he went and spent the night at her house instead of staying with his wife and making sure she was okay? Talk about what he intends to do moving forward. Tell him no more alone time with her behind your back. That the affair has to stop.",
      "created_utc": 1725554026.0,
      "score": 15
    },
    {
      "id": "llne21u",
      "body": "There is NO reason for him to EVER need to stay over. You clearly express how they relationship affected you and they gaslight you to the point YOU had to apologize for how their inappropriate behavior made you feel. Then he LEFT you alone, and spend the night with her... right after you told them you believe they been having an affair for years.\n\nIF they truly were like siblings, she would have jump to doing the test to clear the air and avoid this imploding your relationships. Why she refused? Because it will implode it. \n\nI would draw hard boundaries: 1) No more staying over at her house 2) If she is ever to enter your family dynamics again, it will be AFTER the DNA test are done. 3) If your husband refuses, divorce.\n\nThis level of toxicity will kill you if you stay in this family with this dynamics. Again, if you can´t do it for yourself, do it for all the kids.",
      "created_utc": 1725553090.0,
      "score": 13
    },
    {
      "id": "lln9xai",
      "body": "HE SLEPT AT HER HOUSE the night you confronted him. That should tell you EVERYTHING! Lady, come on. You're just hurting yourself by believing the BS they're serving up. Even his own mother thinks this. YOU apologized? WHAT?!!! I hope your post reaches the children so they can start asking the right questions because you do not. Have you checked their messages? Did you ask for his phone? I know people advised you to do this in your last post. Stop burying your head in the sand.",
      "created_utc": 1725551778.0,
      "score": 13
    },
    {
      "id": "llmrjkz",
      "body": "I’m with you 100%. The moment he stepped out that house to comfort another person over his wife is the moment the marriage ended. It’s such a fucked up thing to do. \n\nBut they have kids so I understand OP not going nuclear immediately. But I wouldn’t have allowed him back the next day to have some calm discussion. I’d rip him to shreds first until he understands how fucked up he behaved. Coz I don’t think Luke even knows he’s an asshole, he’s that dumb.",
      "created_utc": 1725545568.0,
      "score": 367
    },
    {
      "id": "llnepqq",
      "body": "Fifty bucks says \"damage control\" was them getting their story straight. Also sleeping together.",
      "created_utc": 1725553298.0,
      "score": 95
    },
    {
      "id": "llmz3u0",
      "body": "Exactly this. It doesn’t matter if they’ve never had sex. Luke’s priority is Amy. That’s all the info I’d need. \n\nThis isn’t monogamy. Which could be okay. Not everyone prioritizes or wants strict nuclear family monogamy. The problem is that it isn’t consensual. \n\nI’d maintain that there is still some gaslighting going on here. Honesty from Luke and Amywould have sounded something like:\n\n*Huh OP, I had no idea you felt that way, that must feel awful. I’m a little hurt by the accusation. But I can see how you could think that. We do have an unusually close friendship and we are each other’s primary person emotionally. You’re not imagining that and it is definitely unusual.*",
      "created_utc": 1725548302.0,
      "score": 146
    },
    {
      "id": "llq0rm5",
      "body": "A conversation over the phone would do it. A conversation his wife could hear. No need to go spend the night with the other woman. It's as if he felt the need to confirm it was an affair and needed to console the affair partner.",
      "created_utc": 1725584295.0,
      "score": 8
    },
    {
      "id": "llmniuh",
      "body": "Honestly… that’s enough to divorce for me. It’s my own personal boundary though. Obviously everyone has their own boundaries, but I’d never be ok with my husband spending the night with another woman (who’s not family) unless it’s absolutely necessary (like life & death or something serious). \n\nBut to add on to that, he spent the night with another woman when: \n\n- his wife asked him not to\n- he’s having the worst night of his marriage \n- his wife feels hurt, vulnerable and In distress \n- the woman in question is the reason for his wife’s hurt and distress \n- he should’ve prioritised his wife and their marriage instead of ‘his wife’s friendship with the other woman’??? Like huh??\n\nLike, I mean… I take it back. Once i list it all down. He wasn’t being stupid. He was straight up cruel. Like what he did was BRUTAL. \n\nShit I’m angry again",
      "created_utc": 1725544191.0,
      "score": 552
    },
    {
      "id": "llmtmua",
      "body": "I think he’s definitely cheating.",
      "created_utc": 1725546425.0,
      "score": 56
    },
    {
      "id": "llmyyh8",
      "body": "Feels like he spent the night to get their story straight.",
      "created_utc": 1725548256.0,
      "score": 8
    },
    {
      "id": "lln18nt",
      "body": "Not just that but YOU should be his best friend!!! When you get married that is your ride or die person and he’s made you believe it’s ok to do that with you and Amy. As a married woman I am so pissed at Luke for treating you this way!",
      "created_utc": 1725548995.0,
      "score": 152
    },
    {
      "id": "lln4hhx",
      "body": "I don't get how your husband can justify spending night over at Amy especially after the affair accusations unless he was having an affair and they think you're dumb enough to accept it",
      "created_utc": 1725550042.0,
      "score": 23
    },
    {
      "id": "lln1oz1",
      "body": "Stop worrying about it! \n\nYou’re so used to all this that it’s only when someone says something to you that you realize it’s really weird!\n\nDon’t let him get away with anything now that you’re his wife, let him behave like a husband!\n\nYou know what’s right and wrong, but I want to protect everyone’s feelings, not yours!\n\nYou have to stop your feelings first!\n\nYou’ll end up cracking up and who’s going to be there for your kids! \n\nNot emy because in real life everyone takes care of their families with everything!\n\nSo now the most important thing is your 4 children and you the rest is not your problem!\n\nIf they’ve sinned, let them take responsibility, no more, no less!",
      "created_utc": 1725549141.0,
      "score": 10
    },
    {
      "id": "llmky30",
      "body": "Well just know you have a bunch of internet strangers behind you in whatever decision you make my love! Take it one day at a time and remember to breathe. You are stronger than you think!",
      "created_utc": 1725543285.0,
      "score": 133
    },
    {
      "id": "llmu8ud",
      "body": "Have you mentioned to your husband that you're considering divorce? \n\nAlso, while ideally it would be avoided, at what point do you have a plain talk with your daughter about your concerns?",
      "created_utc": 1725546681.0,
      "score": 115
    },
    {
      "id": "lln5kho",
      "body": "OP I feel so angry in your behalf. You are being betrayed and you are allowing this to happen because it seems less painful than the alternative. \n\nThe next time he goes to Amy’s house overnight, you should change the locks on your house and hand him divorce papers when he knocks on the door. \n\nYou aren’t blowing up your life if you walk away from your husband and Amy, you are blowing up a lie.",
      "created_utc": 1725550391.0,
      "score": 235
    },
    {
      "id": "llnammg",
      "body": "Bottom line it's time to be proactive for yourself and your children. \n\nYour husband has grossly crossed boundaries. Your oldest children are mature enough to understand. They need to be aware. The *age gap* excuse by your husband and Amy is totally stupid.\n\nHave a sit-down meeting with Cat, Luke, Amy, and yourself (FIL optional), and your parents and lay out your hard-line boundaries. Luke spending the night with Amy was disrespectful and inappropriate, considering everything, and watch Cat's reaction. Cat needs to voice her suspicions, too. I'd also tell them that you're going to tell your daughter.\n\nExplain that all this could be resolved with paternity tests, and their refusal incriminates them.\n\nPersonally, I'd demand a separation, but if he decides to stay at Amy's, he made his decision.\n\nStop being a doormat. This whole thing is just nasty. Two selfish, lying assholes need to have the spotlight on them. Get your supporters in your corner (including your parents) and call the meeting. Inaction is a choice.  You deserve answers.  You deserve better. You deserve the truth.",
      "created_utc": 1725551999.0,
      "score": 133
    },
    {
      "id": "llni2hi",
      "body": "This isn't your nightmare. This is your actual reality. Like genuinely, truly, this is the life you are living every day.",
      "created_utc": 1725554363.0,
      "score": 76
    },
    {
      "id": "llnlqeh",
      "body": "This is exactly what happened based on what you wrote, penis in vagina or not. You shared your insecurities with them. Her response was to tell you just how little you mean to her, and his response was to leave you to be with her alone again. My unsolicited advice is to be brave, and imagine what your life would be like free from this. Trust what your gut is telling you to do.",
      "created_utc": 1725555510.0,
      "score": 48
    },
    {
      "id": "llnqelp",
      "body": "I’m sorry, but this isn’t your nightmare honey. This is your current life situation.",
      "created_utc": 1725556986.0,
      "score": 16
    },
    {
      "id": "llo6tw4",
      "body": "And your reality. Wake up sis.",
      "created_utc": 1725562169.0,
      "score": 12
    },
    {
      "id": "llohsqz",
      "body": "And offer a genealogy test if they would like to know for certain. The older kids are old enough to consent to it. If it’s negative, then they get to be together.",
      "created_utc": 1725565650.0,
      "score": 10
    },
    {
      "id": "llr5v2y",
      "body": "The only thing that could stop them would be the suspicion that they are sibblings. Never in the history of humanity have teenagers stayed away from someone they liked because their oarents told them so.",
      "created_utc": 1725601852.0,
      "score": 9
    },
    {
      "id": "llq4ool",
      "body": "Tbh, I think her refusing is the only thing left to protect her pride. \n\n\"She went on a longer tirade about how I had always acted superior to her, which I don’t believe I did, though it’s possible that I gave off that vibe unintentionally.\"\n\nWhen the truth comes out about the decades long affair with multiple children, it'll confirm that you are superior to her. She's speaking out of jealousy and insecurity. Only mistresses are resentful of the wife and being claimed by their husband and his kids with his wife. \n\nIf you guys get into, you need to goad her and hopefully she slips up. You need to throw in her face that you are his wife and mother of his kids! \"Mother of his kids\" might trigger her and she might reveal she is also the mother of his kids.",
      "created_utc": 1725585697.0,
      "score": 139
    },
    {
      "id": "lloh35n",
      "body": "Yeah honestly I would be the same. If i 100% knew those kids weren’t his, what is the harm in a test? Nothing to hide here, swab all you want",
      "created_utc": 1725565428.0,
      "score": 18
    },
    {
      "id": "llq4tpp",
      "body": "You don't need to clash with her. Your husband and Amy are just waiting for you to calm down so that they go back to the status quo. They are ensuring that you are so uncomfortable with this topic that you won't bring it up again. I'd refuse to have anything to do with her. I'd be done. I think it is time to tell your husband to choose, it is either her or you. Tell him to choose carefully because this is a one-time choice. No do overs. \n\nYour husband isn't protecting your marriage. When you protect a marriage it comes first and the children of the marriage come first. You don't give even the appearance of anything like cheating. You certainly don't go spend the night with the friend. You don't come first and your children don't come first.",
      "created_utc": 1725585747.0,
      "score": 9
    },
    {
      "id": "llmk6fi",
      "body": "Just thought this: if you wanna speed this up you tell your husband that you will be telling Tom when hes 18 and expecting him to do the test then at his request. His reaction will be telling and him telling Amy and her reaction will be telling. Thats how you can get your answers faster. But I think you know the truth now you are just stuck on needing the proof.",
      "created_utc": 1725543008.0,
      "score": 381
    },
    {
      "id": "llmlf6e",
      "body": "What if you say you are fine with them dating? Tell Amy and Luke you are going to give your blessing and see how they react…. Would be interesting to see if they are still adamant about them not.\n\nThings that stick out: \nAmy is against the DNA and I’m guessing your husband and her probably planned this response ahead of time. It lets him make you think he has nothing to hide by saying he is fine with it, because he knew she would refuse. As long as she is refusing I would assume it’s because they are his kids. She has no real reason to refuse. If she cares so much about her “best friend” she would want to save his marriage. \n\nYou are “so close” but it’s none of your business who fathered FOUR of her children? No. \n\nYour MIL thinks the exact same thing as you, and has for a long time. A mother knows her son. Your MIL told you everything you need to know. I would spend your energy and time getting her to help you. She already agrees with your suspicions. \n\nAnd last, shit hit the fan and he ran to her. Yikes. I think all signs point to you were right all along!",
      "created_utc": 1725543454.0,
      "score": 214
    },
    {
      "id": "llmj3v4",
      "body": "And the day Tom turns 18 you tell him the truth. Tell him he shouldnt pursue your daughter without a DNA test. He will be an adult and can make his own choice. You tell him \"you want my daughter ever, you need to prove youre not related and my husband agreed to the test before.\" Then you will see the truth when Tom wants it. Either it will be easy or Luke will try to get out of it 🤷",
      "created_utc": 1725542625.0,
      "score": 200
    },
    {
      "id": "llmlsml",
      "body": "There isn't really an age gap. And, better check age of consent in your state. That argument may not fly. Kids have probably looked it up already. And, since you let them hang out already, they're more or less dating anyway.",
      "created_utc": 1725543586.0,
      "score": 18
    },
    {
      "id": "llmjsa2",
      "body": "You need to tell Amy & Luke you are going to give permission for the kids to date, see what their reaction is.",
      "created_utc": 1725542866.0,
      "score": 23
    },
    {
      "id": "llmo7yw",
      "body": "Did your MIL offer an opinion on how Luke went to console Amy instead of you and spending the night there?",
      "created_utc": 1725544430.0,
      "score": 115
    },
    {
      "id": "llmotww",
      "body": "What do you need to do? The proof is there he spent the night with another woman who is constantly in your lives. His “best friend” has a kid that looks like him. Great. And the fact that Amy refuses to get a dna test is also questionable.\n\nNothing will change because you have no boundaries with your husband when it comes to this woman. He comforted her an entire night instead of staying by your side.",
      "created_utc": 1725544638.0,
      "score": 50
    },
    {
      "id": "llmjpvb",
      "body": "You can still confront him again and tell him what he did was absolutely wrong and he disrespected the marriage and made you feel like you’re not the priority. Let’s see what he has to say.",
      "created_utc": 1725542842.0,
      "score": 317
    },
    {
      "id": "llmnj9k",
      "body": "You’ve been deeply, deeply manipulated. Shame and feeling stupid is understandable but I only have compassion and empathy for how awful a situation you’re in and what a mindfuck it is. Sending love and compassion AND keep listening to your gut and prioritizing your perspective and feelings, not just for yourself but for your children.",
      "created_utc": 1725544195.0,
      "score": 165
    },
    {
      "id": "llmpj8g",
      "body": "Honey, what friendship? Apparently you all are so close that you never asked or discuss who was the father of her children. How is that not the first question if she wasn’t in a relationship with someone? Outside of an emergency situation, do you know anyone who’s partner regularly spends the night with a friend if the opposite sex? Or with any friend for that matter? On a regular basis? Why on earth would he need to? How was that explained?",
      "created_utc": 1725544877.0,
      "score": 157
    },
    {
      "id": "llmr1wb",
      "body": "Perhaps it's time to accept that your friendship with Amy is over and so offending her with the paternity test is irrelevant. \n\nI'd push for that paternity test above all else.\n\nTheir reasons for not doing so are a joke.\n\nRemember, the test only confirms he isn't the father, it doesn't tell you anything else personal about the child.",
      "created_utc": 1725545397.0,
      "score": 36
    },
    {
      "id": "llmtjyf",
      "body": "Theres no reason to spend the night for him to talk to her. Their friendship needs to stay in the daytime.",
      "created_utc": 1725546390.0,
      "score": 9
    },
    {
      "id": "lln253q",
      "body": "You all are totally focused on the wrong people. \n\nI said this in the last post - I’ll say it again - forget your husband in all of this. You could be forever f-ing up your relationship with your child. If they find out you suspected they are siblings and you DID NOT do anything to protect them - I just could never forgive my parent for that level of betrayal. \n\nYou need to tell your suspicions to these almost adult children who for sure are sleeping together that they need to decide for themselves if they want DNA testing. Just lay out the facts without emotion and let them decide. I just can’t even imagine how betrayed I would feel by my parents arguing for months about this while I’m likely still sneaking off with my potential sibling. Best case outcome - they are not siblings and all the adults can step out of the way and let them date. Worst case - they are siblings and next steps can be taken. \n\nFinding out the truth doesn’t make it true. Meaning - if you have cancer you already have it. The test for it doesn’t make it true. If they are siblings, the damage has already been done. Finding out the truth from a test doesn’t change the reality.",
      "created_utc": 1725549288.0,
      "score": 8
    },
    {
      "id": "llqqt12",
      "body": "Honestly, no matter what answer you go for, Sophie needs to know about the potential relation. You don't even need to give Sophie all the details of thinking about cheating, just say you had a discussion with the in-laws a while ago and you are concerned they could be related. Could be cousins or siblings, you don't have to be specific because you don't know and you can even be honest that you don't want to tell her exactly what you think in case you ruin her perception of someone. Fess up that you're only concerned about them dating because you want to make sure they're not related. Let her decide if she wants a DNA test and let her make the decision of whether to bring it to Tom. But make it clear that you are telling her in confidence. If you give children valid reasons and trust them to make the decision, they will be more likely to respect you and either stop dating, or find a way to get the test done.",
      "created_utc": 1725594213.0,
      "score": 48
    },
    {
      "id": "lln8s0c",
      "body": "That's what I am thinking! It would settle the issue because honestly keeping something like that from both kids given the dynamic is just going to make things worse",
      "created_utc": 1725551416.0,
      "score": 30
    },
    {
      "id": "llnhpbf",
      "body": "All you have to do is get them 23 and me tests. Pretty sure that would get around any need for parental consent.",
      "created_utc": 1725554248.0,
      "score": 14
    },
    {
      "id": "llojjvm",
      "body": "I agree and think Tom and Sophie should know what you think. You have tried to not rock the boat with Amy and Luke for too long. It’s time to stop thinking about what they want and to do what is necessary for your own mental health. You deserve to be treated as the only family, not the second family to Amy and her kids. He showed you are second when he spent the night with Amy the night of your argument.\n\nAmy is not going anywhere, do you really want to deal with her constantly for the rest of your life?",
      "created_utc": 1725566195.0,
      "score": 12
    },
    {
      "id": "llnzjgv",
      "body": "Please do. Imagine what it would do to her if she even kissed him already? Talk to MIL about Sophie. Maybe she can come up with a very practical solution. You know that age. The more you say no, the more it means, please do. \n \nAlso, you and MIL should talk to Sophi together.",
      "created_utc": 1725559858.0,
      "score": 39
    },
    {
      "id": "llodb2p",
      "body": "Call your mil and see how she feels about the kids being interested in each other in a romantic way and get her reaction to your husband “saving the friendship” by having a sleepover. She’s the only one you can really compare notes with",
      "created_utc": 1725564235.0,
      "score": 34
    },
    {
      "id": "llpkcby",
      "body": "Omg why didn’t you tell your in-laws about the kids wanting to date?  Wouldn’t that have made your point more urgent?  You held back a lot of info from them that they also deserved to know. Not just that you suspect your husband of having an affair.  It’s much more serious than that!  You intentionally held back. Not cool",
      "created_utc": 1725578366.0,
      "score": 16
    },
    {
      "id": "llmsxv7",
      "body": "It doesn’t matter if she sees it that way or not. It’s the truth. Even if you personally would never see to her actually being cut off, just know that you’re the wife. You do have that power. She says you’ve always acted superior, but that’s her having conflict with herself because she knows she’s not the wife and she’s not at the top of totem pole. You are. She envies you, it’s clear as day. \n\nJim and Cat are amazing people, obviously. Shoot, they’re financially raising someone’s children that, as far as anyone knows, aren’t blood. So I imagine that wouldn’t change if they turned out to be Luke’s after all. My point was that Amy knows she doesn’t truly have a pot to piss in without you and your husband’s family. \n\nYou need to take some of your power back. I do admire how patient and understanding you’ve been but it truly angers me to consider that perhaps you’ve been played a fool all these years, and nobody deserves that. Don’t let her bully you out of your own happiness. Regardless of Amy and how all that plays out, please protect your heart and be logical. You’ve rolled over too much, it’s time to stand up.",
      "created_utc": 1725546132.0,
      "score": 60
    },
    {
      "id": "llmwdni",
      "body": "But she obviously has no respect at all for your station as Luke's wife.  Otherwise she wouldn't ever have asked or allowed him to sleep over.\n\nYou say she isn't a leech, but it takes an incredible level of entitlement to accept so much financial support, and especially to keep having \"fatherless\" children without a care in the world.",
      "created_utc": 1725547413.0,
      "score": 37
    },
    {
      "id": "llmlwy0",
      "body": "You don't want it to be true and that's totally understandable. Your heart and your head are saying two different things and in this situation it seems listening to your head is the way to go",
      "created_utc": 1725543629.0,
      "score": 31
    },
    {
      "id": "llnp7bc",
      "body": "Abusers have a way of making themselves your entire support system so that cutting them off feels like cutting off everyone in your life. Just putting that out there.",
      "created_utc": 1725556607.0,
      "score": 9
    },
    {
      "id": "lln3io0",
      "body": "If that's truly the case, & she actually truly cares for your husband as an important friend, wouldn't she be willing to make more of an effort to help her friend's (your husband's) marriage?  Especially considering how much you both seemto have helped her & the kids out over the years?",
      "created_utc": 1725549732.0,
      "score": 69
    },
    {
      "id": "llnwfoy",
      "body": "I don’t even know how to ask this tactfully, but is there any chance at all that your FIL is the kid’s dad? It would explain some of the traits/characteristics that Luke shares with them *as half siblings*. I know that’s a wild question, but that is unfortunately the ride you seem to be on. \n\nFurther, how is Amy supporting her kids without any child support/partner? Are you subsidizing her lifestyle? Barring not knowing who the kid’s dad really is on her part (which seems unlikely as they share both parents from what you describe) why would she not pursue financial support from him? I get that maybe the “dad” ran off so she didn’t have support or a chance to pursue it for the first, but to get pregnancy again and again makes no sense if there is a third party and he’s a deadbeat. If anything Luke should be upset with her for supporting her financially while this sperm donor slacks on his responsibility. \n\nNone of this adds up. I completely understand how you reached these conclusions because there is a lot of unanswered questions out there.",
      "created_utc": 1725558874.0,
      "score": 16
    },
    {
      "id": "llo1a8h",
      "body": "What if your husband’s dad is the father?",
      "created_utc": 1725560407.0,
      "score": 9
    },
    {
      "id": "llnost6",
      "body": "Then you guys need to cut off all financial support until she answers the questions. If your husband doesn't support you on this then there is your answer.",
      "created_utc": 1725556481.0,
      "score": 8
    },
    {
      "id": "llnb771",
      "body": "Sounds like Kaylee is your weak link.  Especially since she's the one with the allergy that matches Luke.",
      "created_utc": 1725552182.0,
      "score": 112
    },
    {
      "id": "llnpfdh",
      "body": "Maybe something like this will make him care. I wish you luck in your endeavors, and I do not envy the choices you have to make.\n\nAnd for the record - Amy saying you’ve never done anything for her or her family is the most laughable thing. You’ve ignored your inner voice in favor of peace for years, a whole decade it sounds like. That has been out of kindness and love for her family, your family. That’s huge. And now she can’t act with kindness and love back during a moment of vulnerability? It’s more telling than I think you know.\n\nThe fact that you’re thinking of her kids even now shows how much you care. And if you’re right about all of this, then her kids deserve to know the truth too. Why have they been deceived all these years?",
      "created_utc": 1725556677.0,
      "score": 72
    },
    {
      "id": "llog2cm",
      "body": "My sister in law is a \"product of r*pe\". We recently found out that was a lie. Mother in law will never tell her who her real father is and let me just say it's absolutely horrible of her to do that to her child. Amy is hiding a huge secret and it will come out one day and her kids will demand it from her. All of them. And if she doesn't fess up they WILL be angry with her.",
      "created_utc": 1725565107.0,
      "score": 11
    },
    {
      "id": "llpzc4c",
      "body": "as someone around Tom's age... he might have suspicions too... i don't know how sharp he is but i think he would have put the pieces together by now. i think the thought would have crossed my mind, especially if your MIL noticed it too.\n \nhe might just refuse the test because he's in complete denial and doesn't want to open that can of worms, and i don't blame him. his life sounds pretty good right now and this would definitely fuck a lot of things up.\n\nhim liking Sophie might also be a way to subconsciously try and deny his suspicions. maybe he wants to see how his Mom and \"Dad\" react to it... slowly pushing the boundaries to see how far they'd let him go...",
      "created_utc": 1725583794.0,
      "score": 7
    },
    {
      "id": "llmi6j1",
      "body": "Who cares what Amy thinks?\n\nOP you and Amy aren’t friends, you think she’s sleeping with your husband and you’ve said it out loud. \n\nEven if she’s not actually sleeping with your husband, the best relationship you could have going forward would be civility. You need to accept that whatever relationship you had with her is over for good. \n\nAsk Cat to intervene.\n\nETA is there any chance (I feel like I’m going crazy trying to work this out) that Luke is the sperm donor? So they didn’t actually sleep together, but he is still the father? Maybe she did really want kids. \n\nI think reason he spent the night with her (despite the blatant stupidity of it)  was because they absolutely needed to get their story straight and plan ahead. Whether the were sleeping together or not, that night 🤷🏻‍♀️",
      "created_utc": 1725542291.0,
      "score": 339
    },
    {
      "id": "llmhokv",
      "body": "Why do you care so much what this woman thinks? You are literally the front for their disgusting relationship. They have been using you this whole time. If I’m wrong-then I’d be happily wrong, but we both know I’m not.",
      "created_utc": 1725542108.0,
      "score": 95
    },
    {
      "id": "llmmqki",
      "body": "OP you are so deeply entrenched in being manipulated by Amy’s emotions and Luke is complicit in it all. I am so sorry but they are playing you so hard. You need a really good therapist to help you tune into your inner knowing and stop being manipulated. I am so sorry your trusting nature has been used against you by people you love.",
      "created_utc": 1725543918.0,
      "score": 62
    },
    {
      "id": "llmik2e",
      "body": "Cat can tell Amy the truth, which is that she suspected it independently all along. But the timing is because you voiced your suspicions.",
      "created_utc": 1725542428.0,
      "score": 34
    },
    {
      "id": "llmnk5b",
      "body": "At this point i wouldnt even care. Honestly i hope you leave him, he spend the night with another woman who made you feel unsure of your relationship. He choose her. That itself is a huge dealbreaker. I dont even care about the dna results but honestly i would 100% tell the kids. If my mom suspected that my potentiel bf was related to me i would want to know.",
      "created_utc": 1725544204.0,
      "score": 20
    },
    {
      "id": "llmpuj1",
      "body": "Like is worried enough about Amy. Worry about yourself and your kids because he sure doesn’t.\n\nOr did he not spend time with Amy after your fight? Shit is Weird.",
      "created_utc": 1725544985.0,
      "score": 7
    },
    {
      "id": "llnpwh4",
      "body": "Does he know that you plan on separating?",
      "created_utc": 1725556826.0,
      "score": 34
    },
    {
      "id": "llnz299",
      "body": "So him spending the night at hers was a ‘goodbye for now but be back soon’ shag?",
      "created_utc": 1725559708.0,
      "score": 15
    },
    {
      "id": "llmsec4",
      "body": "If you’re crazy to then we are more than 1000 people who find themselves crazy then",
      "created_utc": 1725545911.0,
      "score": 15
    },
    {
      "id": "llmwyoj",
      "body": "A simple DNA test would mitigate so many issues, so why is Amy refusing?",
      "created_utc": 1725547604.0,
      "score": 12
    },
    {
      "id": "lln35at",
      "body": "Demand that your husband is not to come over Amy's and be around all the time until both parties can do the DNA test. Put your foot down. You are nowhere near insane as even your MIL shared the same suspicions.",
      "created_utc": 1725549614.0,
      "score": 8
    },
    {
      "id": "llnioaj",
      "body": "Does she say they were all ONSs or...? No father's name on any birth certificates? That seems really unfair to the kids.",
      "created_utc": 1725554555.0,
      "score": 17
    },
    {
      "id": "lln7gfz",
      "body": "She should threaten to withhold financial support until she does.",
      "created_utc": 1725550996.0,
      "score": 35
    },
    {
      "id": "llp5pao",
      "body": "What she needs to do is tell that woman that she won't be getting a lick of support from her family or her children in their will until she submits that damn DNA test. \n\nShe needs to put her entire foot down. I wouldn't be surprised if Father knows and has simply been covering for his son's transgressions. \n\n\"I don't know what to do, pop. I love these two women so much and I love my children!\" \n\nI bet Dad was your husband's second call after Amy. Check the phone records. 🔦🔦🔦",
      "created_utc": 1725573196.0,
      "score": 13
    },
    {
      "id": "llq69nd",
      "body": "Will he go to marriage counseling. You need to make him answer the hard questions that he is avoiding and he needs someone to say that his extra relationship is highly inappropriate.",
      "created_utc": 1725586271.0,
      "score": 16
    },
    {
      "id": "llo1fjn",
      "body": "How has your husband responded when you have told him you are thinking to divorce him?",
      "created_utc": 1725560452.0,
      "score": 11
    },
    {
      "id": "lln8ys1",
      "body": "How is that possible? Has he never asked? Never pushed? If my unmarried sister was living off of my dime getting pregnant over and over and having me help raise her kids I would not stop asking who the father is. Child support anyone?",
      "created_utc": 1725551476.0,
      "score": 41
    },
    {
      "id": "llmj7w2",
      "body": "Ever notice that trips are deleted when you know he was in the vehicle?",
      "created_utc": 1725542665.0,
      "score": 24
    },
    {
      "id": "llr0a1u",
      "body": "Do you think Luke knows you have pretty much come to end because of his and Amy’s relationship throughout y’all’s marriage?",
      "created_utc": 1725598706.0,
      "score": 12
    },
    {
      "id": "llr2w9z",
      "body": "I'm glad that I could give support. No one can know how you feel, we all need to be supportive and sympathetic to the situation. You can't be blamed for being trusting and loving, period. Hang in there, we're here for you. My DMs are open if you need to chat, no pressure.\n\nAt this point, who knows if they are telling the truth. Amy can't even \"tell\" her best friend who the father is (even though he knows and playing dumb and lying) and not even telling her own kids who their father is.\n\nI would love to hear both of their reactions to that news. I can imagine MIL will be very concerned. But, I'm more curious about FIL's reaction. If he knows about the affair or is involved with Amy, I bet his reaction might be telling.\n\nOkay, that makes sense. You did mention that the kids look biracial too.\n\nAh, okay. That does happen. I'm a mix of my parents but I was already told I looked like my Dad.\n\n--\n\nI know you are now closer to the truth. Stand your ground and no one will ever fault you for picking your children over Luke and Amy. You are a mother first, there's nothing more important even over being a wife and especially a friend.\n\nI think both Luke and Amy are thinking you will back down and let it go. Don't! Tell Luke that you will not consider a friendship with Amy unless you get DNA tests. As far as you are concerns, the friendship is over. Tell Luke you are ready to accept the consequences to get the truth no matter what the truth is even if it means giving up your friendship with Amy for the sake of your kids as well as risk your marriage to have peace of mind. You may have to ask for a separation to show how serious you are. And, if Amy still resists that shows that if it's not true she would rather you guys marriage dissolve than help Luke.",
      "created_utc": 1725600153.0,
      "score": 9
    },
    {
      "id": "llmpb7m",
      "body": "I say this in the gentlest way possible. But… the lives are blowing up already. It was a small explosion. But it’s done. \n\nYou can’t remain in this limbo forever. It’s not good for you. And if you guys sweep it under the rug now, either the marriage will end anyway or you’ll stay married and both are miserable. \n\nYou kinda have no choice but keep trudging forwards. \n\nFrom the sounds of it, if the affair wasn’t physical. It was still emotional. At the very least - the relationship is inappropriate. \n\nIf he honestly isn’t cheating in any form (that he believes) it is still HIS JOB to reassure you. He’s failing on all fronts right now. \n\nI’m sorry but even I don’t know what the RIGHT next action is… but hopefully someone super smart is in the thread right now with the best solution for you. \n\nAll we can hope for is a gentle explosion and not nuclear at this point.",
      "created_utc": 1725544801.0,
      "score": 51
    },
    {
      "id": "lln3gqi",
      "body": "You are not the one blowing up lives. You responding to this situation is like uncovering a bomb that Luke and Amy set to blow up everyone’s lives—you did not set that fuse yourself. None of this is your fault. I fully respect you wanting to keep everything comfortable and not blown-up for the kids of course, and it really shows how good of a person you are, and how self-sacrificing you are, that you’ve dealt with this silently for their sake. But please just know that anything that comes of this is not your fault just because you’re the one who uncovered it.",
      "created_utc": 1725549715.0,
      "score": 16
    },
    {
      "id": "llnewx6",
      "body": "Girl, please say it with me. YOU ARE NOT BLOWING UP ANYTHING. YOU HAVE DONE NOTHING WRONG. If the truth comes out and it blows up your family YOU did not do this. YOU didn’t do anything. YOUR HUSBAND and AMY blew up your life. They blew up THEIR lives",
      "created_utc": 1725553361.0,
      "score": 12
    },
    {
      "id": "lln8p0v",
      "body": "My hope is that Tom and Sophie would want to know.  Hopefully they will decide to take a test together. I know they are not aware of what the \"fight\" was about, but these things have a way of getting out.   My marriage was almost destroyed by a woman named Amy and just the name leaves a bad taste in my mouth.  I Pray you find out the truth eventually.  Whatever that truth may be!  HUGS !",
      "created_utc": 1725551390.0,
      "score": 12
    },
    {
      "id": "llmyzmd",
      "body": "Look for a second phone as well.",
      "created_utc": 1725548265.0,
      "score": 16
    },
    {
      "id": "llmqp30",
      "body": "I think your decision is already set, stay with him, seek therapy and forget about this or\n\nDivorce either way, if what you think is true there’s no going back, if what you think it’s not true you believe it is any way, so again there’s no going back",
      "created_utc": 1725545276.0,
      "score": 8
    },
    {
      "id": "llmyvx4",
      "body": "Why would you want to be friends with someone like her? A good friend would listen to your concerns and then alleviate them. Not exacerbate them. Which is exactly what happened. I would have told my husband there's nothing for you to salvage with that friendship. If you go over there and stay the night we are done and I'm telling the kids my suspicions. I will not have my daughter saying her brother.",
      "created_utc": 1725548232.0,
      "score": 39
    },
    {
      "id": "llnvk3t",
      "body": "I just… excuse me?\n\nThey look like him\nHave his uncommon allergies\nHe stays over the house to help parent them\n\nGirl he has 2 families.",
      "created_utc": 1725558603.0,
      "score": 28
    },
    {
      "id": "llnc0dw",
      "body": "She's not your friend. She never was.",
      "created_utc": 1725552442.0,
      "score": 19
    },
    {
      "id": "llx9ogx",
      "body": "And her reaction when they were first confronted kind of confirms that! I mean she said you had done nothing to help her and Luke running to ‘comfort’ her. \n\nI am curious to how MIL will react to the betrayal and cheating they have done especially her view on Amy.",
      "created_utc": 1725693975.0,
      "score": 32
    },
    {
      "id": "llxn75m",
      "body": "She is like a cancer in your life. What she thinks doesn’t matter. She’s the side piece who settled for sloppy seconds and let her kids grow up thinking that their father didn’t love them enough to stay in their lives even a little bit. She’s so selfish that she was willing to damage her own children just so she could keep a married man in her bed. She’s a worthless human being. \n\nEven though some of her kids may be suspicious, they’re going to be livid when they learn what she did. She betrayed them too and frankly, so did your husband. He allowed them to grow up thinking that they don’t have a father. How sick is that?",
      "created_utc": 1725703488.0,
      "score": 23
    },
    {
      "id": "llx9nub",
      "body": "Well she has very weird mental gymnastics on this still. Seems like a great way to ensure a very uncertain future and life. \n\nRetain all physical and digital records. If the kids come back as being siblings you can use that to improve your divorce position. I would keep the MIL out of it until the ducks are in a row",
      "created_utc": 1725693963.0,
      "score": 9
    },
    {
      "id": "llzvg4d",
      "body": "My ex cheated a lot. He was a really good liar. I can't wrap my head around him getting me to believe him spending the night with another woman, especially after that conversation, was okay. \n\n\nI feel awful for the 2 kids. They've been carrying around this weight for so long. Sophie is having this color how she views men going forward. It's got to be awful for them. \n\n\nWhen will you file?",
      "created_utc": 1725735538.0,
      "score": 9
    },
    {
      "id": "lm8ifrt",
      "body": "Good. I'd hate for him to think that things change while the divorce proceeds. He's about old enough to decide where he sleeps at night. \n\n\nThough he may want to fill his siblings in on the Maury Povich show their life is",
      "created_utc": 1725860038.0,
      "score": 11
    },
    {
      "id": "llml1qt",
      "body": "I’m afraid they had all this planned in case you got suspicious. Him going to her house to console her is really him going to decompress from being called out",
      "created_utc": 1725543321.0,
      "score": 16
    },
    {
      "id": "llowirk",
      "body": "What’s far fetched is Amy having a secret baby daddy to four of her kids you’ve never met or heard anything about, who happens to have the same ethnic makeup as your husband, in addition to passing on allergies and sleepwalking. \n\nEither Jim is her father or her childrens father, or Luke is. He spends the freaking night! You’ve got to be kidding me.",
      "created_utc": 1725570211.0,
      "score": 64
    },
    {
      "id": "lln7jnp",
      "body": "She needs to know the possability. The truth will come out eventually and she will feel absolutely disgusted if she slept with her half brother.\n\n\nAlso Sophie was wrong that you haven't helped her, you have sacrificed and not demanded that your husband be devoted to you and your family. So that he could go help her. You sacrificed a lot for her.",
      "created_utc": 1725551024.0,
      "score": 26
    },
    {
      "id": "llnqce7",
      "body": "Does Tom know you don’t approve?  I think you tell Tom when he turns 18 that you are afraid that Luke is his father and that his mother had Luke donate sperm (aka don’t make his mom the bad guy for cheating) and that you don’t want them dating unless he is willing to get a DNA test to ensure they aren’t siblings and if your suspicions are wrong, you will give them your blessing, but you need to protect your daughter.  You can tell him why and tell him that his mother won’t prove it or explain who the father is and all the similarities are too unusual to be a coincidence.  Tell him that’s what the fight was about and that Sophie can’t be the victim because his mom wants to keep secrets.  \n\nYou won’t get anywhere with Amy and there is now a breach that isn’t going to repair here.\n\nEdited to add:  I would also tell him that if he loves Sophie, he will want to protect her too.",
      "created_utc": 1725556967.0,
      "score": 18
    },
    {
      "id": "llnmlet",
      "body": "You need to tell her, I know she’s still your baby, but she is old enough where she needs to know the risks of entering any form of relationship with her potential brother.",
      "created_utc": 1725555784.0,
      "score": 8
    },
    {
      "id": "llr2gmh",
      "body": "Unfortunately, it’s very relevant. As adults we tend to repeat patterns we experienced as children. Both because even though they’re uncomfortable they’re familiar and also because our subconscious wants us to break the pattern so we can heal and move on. I’m so sorry you have to go through this but it’s time to get your power back and become the person you were always meant to be. Sending you strength and the perseverance to get through this.",
      "created_utc": 1725599910.0,
      "score": 13
    },
    {
      "id": "llnbmsi",
      "body": "Because some people want to have their cake and eat it too.",
      "created_utc": 1725552321.0,
      "score": 24
    },
    {
      "id": "llnescr",
      "body": "I can think of a couple of reasons: 1) They were scared of what your MIL & FIL would think given that they consider her their daughter 2) Your husband truly loves both of you and his solution was to have 2 families, he knew you´d never accept it so he never told you (he wouldn´t be the first man to do this).",
      "created_utc": 1725553321.0,
      "score": 25
    },
    {
      "id": "llq8sia",
      "body": "Have you ever considered that the reason Amy doesn’t have her own spouse is because no guy is gonna tolerate this inappropriate relationship she has with Luke? \n\nLuke has it made in the shade, he gets dependants at tax time I bet! Something is OFF!\n\nMaybe that’s why they don’t want paternity. She claims a single mom with government and gets to fuck whoever she wants and get freedom to do what she wants and has you guys to fucking babysit. \n\nHe gets to make money and claim you on taxes! \n\nIf you have a job too even better! He can use his own income to pay Amy child support while she gets her single mom benefits! \n\nI can’t!",
      "created_utc": 1725587176.0,
      "score": 22
    },
    {
      "id": "llnc60c",
      "body": "Unfortunately, this has gone on long enough. I’m sorry you’re going through this but it’s better to get out then stay in this weird relationship where he is literally disrespecting and disregarding you - making you feel crazy. An ultimatum wouldn’t work because their lives are too enmeshed and because the boundaries were never set early on.",
      "created_utc": 1725552490.0,
      "score": 24
    },
    {
      "id": "llncai6",
      "body": "That really sucks OP, but you'll be doing the right thing. For you and the kids. Your husband is not even able to comfort you or do damage control for you - he seems to be really irrelevant to your life at this point. I am sorry you are enveloped in this web of lies and deceit, my heart goes out to you. But you will make a new life, one on your own terms. And the liberation from this darkness will be your fuel. You got this OP. Compassion and love your way.",
      "created_utc": 1725552530.0,
      "score": 10
    },
    {
      "id": "llo83pc",
      "body": "Please be sure to have a trauma informed therapist lined up for yourself and your children. Don't wait and try to organize that while in the midst of the separation. Get it lined up now while you're talking to lawyers.",
      "created_utc": 1725562573.0,
      "score": 7
    },
    {
      "id": "lln1vmh",
      "body": "If her kids are all coming from one night stands then why do they all look similar. Aside from them looking like your husband. \n\nYour husband continually chooses Amy. This is unacceptable.",
      "created_utc": 1725549202.0,
      "score": 22
    },
    {
      "id": "lluhczg",
      "body": "His parents are supporting her and her children. OP makes the money in her household.",
      "created_utc": 1725652236.0,
      "score": 11
    },
    {
      "id": "lluhgr9",
      "body": "They ALL look like him. And one of them shares his same rare allergy.",
      "created_utc": 1725652269.0,
      "score": 11
    },
    {
      "id": "lloqq53",
      "body": "This is the exact problem, he does not put OP (his wife!) first. Just because he needed to do some “damage control”, he did not need to spend the night. He chose soothing Amy’s feelings over what that overnight visit would do to his WIFE’S emotions. \n\nWhether they’re cheating or not, that choice to stay overnight with Amy made his priorities very clear. Amy comes first, before OP. So sorry, OP. Please don’t beat yourself up for your feelings or suspicions. Whatever is going on, something is amiss. Even if Luke did not father Amy’s children, he has put his relationship with her before his relationship with you. Don’t feel guilty about any of this. I think most people would’ve been more suspicious than you and been unwilling to tolerate their relationship, whatever it may be. You deserve to be your husband’s priority. Period.\n\nEdit- one word for spelling",
      "created_utc": 1725568429.0,
      "score": 708
    },
    {
      "id": "llnqpge",
      "body": "Happy Cake Day!",
      "created_utc": 1725557081.0,
      "score": 18
    },
    {
      "id": "llqrg4h",
      "body": "Exactly that is such a blatant show of disrespect and evidence of which relationship is more important to him. OP you are always going to be the third wheel in this three way marriage. Even if their relationship is platonic (Its not), she is still part of your marriage because he will always choose her over you when push comes to shove. If you gave him an ultimatum to cut his friendship with her and go no contact or you will file for divorce. Who do you think he would choose? It wouldn't be you based on the information you have provided. The question is after putting up with this for so long are you willing to continue to turn a blind eye and just accept a future with what you feel and what you know.",
      "created_utc": 1725594492.0,
      "score": 14
    },
    {
      "id": "llr1mj6",
      "body": "OP’s the other woman in her own marriage",
      "created_utc": 1725599446.0,
      "score": 14
    },
    {
      "id": "llt24gb",
      "body": "I think OP should change her stance on Tom and Sophie dating and then see how her husband and friend feel about it. OP say since both your husband and friend are so adamant Amy’s kids are not your husband’s kids, you believe them and have changed your mind about them dating. OP doesn’t have to actually be okay with it, just in Amy and her husband’s view.",
      "created_utc": 1725635830.0,
      "score": 13
    },
    {
      "id": "llpsqit",
      "body": "He knew Armageddon was coming, and needed time alone with the partner who is in on the deception to get their stories straight and figure out how continue gaslighting OP",
      "created_utc": 1725581411.0,
      "score": 174
    },
    {
      "id": "llpqvb4",
      "body": "☝️☝️😹😹😹😹",
      "created_utc": 1725580728.0,
      "score": 17
    },
    {
      "id": "llrupfd",
      "body": "Betting Amy's kids come first.",
      "created_utc": 1725618379.0,
      "score": 10
    },
    {
      "id": "llro3v7",
      "body": "Super upvote",
      "created_utc": 1725614037.0,
      "score": 9
    },
    {
      "id": "llnhysa",
      "body": "Oh Amy is upset, guess I'll talk to her about that tomorrow. Actually wait, let me go sleep at her house tonight instead? Wtf?",
      "created_utc": 1725554331.0,
      "score": 408
    },
    {
      "id": "llob70d",
      "body": "He should be more worried about losing his wife than affair partner I mean “friend”",
      "created_utc": 1725563563.0,
      "score": 83
    },
    {
      "id": "llnfaao",
      "body": "I have to say, that is an A-Level of nonsense I just read...\n\n\n\n\nIt is Amy's world; she is the Main Character and OP is just hanging around in it.\n\n\n\n\nSad situation.",
      "created_utc": 1725553477.0,
      "score": 229
    },
    {
      "id": "llnllg0",
      "body": "Let's be real OP is the second family. Amy is his main woman SHE (Amy) just doesn't want to be tied down so dear old shitty hubby found a broken woman (OP) who he and his family gaslit into accepting the position as back-up show wife. I need OP to get some real girlfriends so they can talk her out of this sunken place crappy life she has settled for. Fuck at the very least she needs to clue in her oldest daughter so she can stop fucking her half brother. If OP doesn't care about her own mental health she could atleast care about the kids mental health.",
      "created_utc": 1725555466.0,
      "score": 220
    },
    {
      "id": "llnl0vv",
      "body": "OP has been gaslit and manipulated for a long time. There are probably lots of red flags that she did not share in her first post because years of gaslighting and manipulation have made her colorblind. \n\nOP please take care of yourself and free yourself from this horrible situation.",
      "created_utc": 1725555287.0,
      "score": 234
    },
    {
      "id": "llnh9md",
      "body": "OP is so spineless *she would let her daughter potentially commit incest* rather than get real answers. Edit: (In) what sane universe would a man accused of adultery *spend the night at the home of the woman he was accused of sleeping with*!  \n\nWTF is this? OP must have been a rug in a previous life, because her husband and his girlfriend is stomping all over her. \n\nI hope this is fake, because it is sad and disturbing any woman would choose to live this way.",
      "created_utc": 1725554107.0,
      "score": 421
    },
    {
      "id": "llnb8bs",
      "body": "Seriously. ",
      "created_utc": 1725552192.0,
      "score": 31
    },
    {
      "id": "llo3axc",
      "body": "One more night until the next one and the one after that. OP has no say in this marriage. It’s beyond sad. I wish she’d show some spine if not for herself then for her daughters.",
      "created_utc": 1725561047.0,
      "score": 9
    },
    {
      "id": "llpf2uh",
      "body": "They could explain to Tom that they had been discouraging him and Sophie because of this concern, and if he had a DNA test and it proved they were not half siblings then they would no longer try to block their relationship. Win win.",
      "created_utc": 1725576472.0,
      "score": 57
    },
    {
      "id": "llp0kay",
      "body": "OP can tell Sophie and Tom her fear and why she doesn’t want them to date. He’s old enough now to go get a test himself and send it in.",
      "created_utc": 1725571508.0,
      "score": 36
    },
    {
      "id": "llozdpu",
      "body": "I feel so bad for OP. I’m so angry on her behalf.",
      "created_utc": 1725571126.0,
      "score": 9
    },
    {
      "id": "llqxwwd",
      "body": "That’s truly fucked. We obviously (ETA: Don’t)  know exactly what OP was like when she confronted them. She said she was nervous and upset but it honestly sounds like she handled herself pretty well and she had an incredibly urgent reason to bring this up now. The husband and friend should have just taken the opportunity to fess up. The straight out lying makes an impossible situation even worse now.\n\nThey need to stop covering their asses now that they know they’ve been caught and do what’s best for the children.",
      "created_utc": 1725597471.0,
      "score": 62
    },
    {
      "id": "llr321k",
      "body": "And if they don't tell the children, they will fuck a sibbling unknowingly. There is no way that parents' opinions with sway teenagers on their first crush. If anything, they will push them more towards each other.",
      "created_utc": 1725600243.0,
      "score": 17
    },
    {
      "id": "llp0jbd",
      "body": "Non-consensual sister wives *yikes*",
      "created_utc": 1725571499.0,
      "score": 43
    },
    {
      "id": "llp9txc",
      "body": "She should have bashed both of them in their sleep.\nIf I were on that jury, I wouldn't convict her",
      "created_utc": 1725574609.0,
      "score": 10
    },
    {
      "id": "llra74f",
      "body": "And for the record….they have had sex. And are probably still continuing.",
      "created_utc": 1725604546.0,
      "score": 22
    },
    {
      "id": "llra9xq",
      "body": "He clearly went to comfort his girlfriend….OP, wake up!!",
      "created_utc": 1725604596.0,
      "score": 13
    },
    {
      "id": "lln71w6",
      "body": "Yeah, seriously this is like a sister wives situation.",
      "created_utc": 1725550867.0,
      "score": 55
    },
    {
      "id": "llo639n",
      "body": "Yep. She claims to be doing this for her daughter but then continues to live a lie as if that isn’t teacher her daughters how a wife should be treated in a marriage. Quite honestly, that would probably be more damaging than the incest in the long term. These girls will grow up to lose their sense of self worth with the man they marry because that’s the model they saw at home",
      "created_utc": 1725561933.0,
      "score": 12
    },
    {
      "id": "llo4cx7",
      "body": "Amy is his affair partner (AP), sex or no sex. This is an emotional affair in the least. Maybe physical, maybe not but most definitely an affair. You do not run after a third party to your marriage to worry about their feelings while your own marriage is in the toilet. He simply does not care because he knows OP isn’t going anywhere.",
      "created_utc": 1725561384.0,
      "score": 34
    },
    {
      "id": "llmtd5q",
      "body": "My crazy, petty ass-he would have came back home and the locks would have been changed. With a note on the door - “go stay with ur woman - you’re no longer welcome here”",
      "created_utc": 1725546309.0,
      "score": 160
    },
    {
      "id": "lln08y5",
      "body": "Eh... Luke was just protecting the feelings of and doing damage control with the most important woman in his life. OP knew what the response was going to be when she confronted them because she has spent the last 20 years being gaslit that she's crazy for being upset that her husband treats her like she's \"the other woman\".  \n\nI think OP and her MIL are 100% correct that Amy's kids were fathered by Luke, but for argument's sake, lets just say there is nothing physical that has ever happened between them:\n\nEVEN IF there has never been anything physical, the dynamic between Luke, Amy, and OP is COMPLETELY unhealthy.  For Luke to go stay the night at Amy's house as a part of his routine means he regularly left OP on her own to manage his \"official\" family so he could go play Dad for his friend's kids.  If sleeping over at Amy's house is a completely innocent and normal part of their relationship dynamic, just to help Amy, it seems like OP would have done so a time or two, instead of this being an exclusive behavior to Luke.\n\nI have a ton of brothers who I am exceedingly close to, and this level of enmeshment between even biological siblings would be WAY over the line. \n\n10/10 when Op finally gets the confirmation that her suspicions were right all along about the paternity of Amy's kids, the narrative will change to \"there was never anything romantic between us! We just never told you that Luke was helping Amy out when she wanted children, because we knew you would react like this!\"",
      "created_utc": 1725548673.0,
      "score": 116
    },
    {
      "id": "llmrkeo",
      "body": "I’m definitely one of them!! Inbox always open!!",
      "created_utc": 1725545576.0,
      "score": 9
    },
    {
      "id": "lln2efw",
      "body": "Sooner than later, honestly. She needs to know.\n\nI haven't used the word \"divorce\" with Luke yet, but I've alluded to the idea.",
      "created_utc": 1725549373.0,
      "score": 187
    },
    {
      "id": "llqkpqy",
      "body": "Many comments are suggesting that this is where she was coming from when she said this. Unfortunately, it makes the most sense. I mean, is it possible that I gave off a judgmental vibe without meaning to? Yes. \n\nBut I don't think I did. I have been nothing but patient with Amy, for years. Adored that woman despite her quirks and shortcomings, treated her like a sister.",
      "created_utc": 1725591719.0,
      "score": 81
    },
    {
      "id": "llqz4et",
      "body": "THIS ONE! I’d brag right in her face that he put a ring on my hand and committed to ME, created a home and family with ME. And, even if they did get together at any point in time past, present, or future, I’ll always be the one he vowed to first. Guarantee she slips out of anger.",
      "created_utc": 1725598090.0,
      "score": 10
    },
    {
      "id": "llmmz8r",
      "body": "Many people suggested that in the last post but I don't think it's feasible for a number of reasons, especially not now that I've voiced my suspicions.\n\nThe idea that they planned it this way is my nightmare, yeah. I mean, unless Amy has some deeper reason for hiding the paternity of her children and thinking it to be a personal subject But who the hell could it be if not Luke, that she would react this way?",
      "created_utc": 1725544002.0,
      "score": 129
    },
    {
      "id": "llmm7lm",
      "body": "Okay, this is good. It didn’t even cross my mind, but drastic times (siblings accidentally dating) call for drastic measures (dude, you could be lusting after your sister…stop!!)",
      "created_utc": 1725543733.0,
      "score": 49
    },
    {
      "id": "llmqf1g",
      "body": "I didn't mention that part, but I can already guess she wouldn't like it.",
      "created_utc": 1725545181.0,
      "score": 158
    },
    {
      "id": "llml6de",
      "body": "I very well might.",
      "created_utc": 1725543366.0,
      "score": 220
    },
    {
      "id": "llmpeic",
      "body": "Thank you for your kindness, I really appreciate it.",
      "created_utc": 1725544832.0,
      "score": 78
    },
    {
      "id": "llmwrhu",
      "body": "I asked. She shut me down every time. \n\nMostly it was him looking out for her children but not exclusively. Sometimes I would stay over with Amy too, but more often it was him.",
      "created_utc": 1725547539.0,
      "score": 68
    },
    {
      "id": "llnm7fs",
      "body": "Right! \"the test only confirms he isn't the father\" is for the kids' sake. We can already see he's a terrible husband.",
      "created_utc": 1725555659.0,
      "score": 9
    },
    {
      "id": "llqytui",
      "body": "I agree with this.",
      "created_utc": 1725597937.0,
      "score": 24
    },
    {
      "id": "llnayzx",
      "body": "This right here.  I want the people *I love* to be happy.  If my best friends' partners were upset about something having to do with me, I would do my level best to reassure them however I could.  If I felt they were being unreasonable, I would simply take a step back, because it isn't my place to upset their marriage.",
      "created_utc": 1725552109.0,
      "score": 35
    },
    {
      "id": "llptguw",
      "body": "THIS. I had steam coming out of my ears when OP mentioned Amy said she’d never done anything for her.",
      "created_utc": 1725581675.0,
      "score": 16
    },
    {
      "id": "llmo19k",
      "body": "Honestly with the way Amy talked to her, I doubt she was ever really OP's friend and more saw her as an necessary annoyance.",
      "created_utc": 1725544367.0,
      "score": 158
    },
    {
      "id": "llmp119",
      "body": "Plus the things she said about OP shows that she doesn’t see OP as a friend",
      "created_utc": 1725544705.0,
      "score": 47
    },
    {
      "id": "llmpgz8",
      "body": "Yeah, and their whole response was rehearsed. He could agree to the DNA test, but Amy would refuse. They’re playing her.",
      "created_utc": 1725544855.0,
      "score": 36
    },
    {
      "id": "llntymu",
      "body": "Why are you acting like an intruder in your own marriage? Right it seems like everyone has put Amy as the most important person in this marriage.",
      "created_utc": 1725558105.0,
      "score": 21
    },
    {
      "id": "llmmuw4",
      "body": "They are even pulling the good cop bad cop routine with Luke “agreeing” to the paternity test and Amy not so Luke knows it won’t go through. If they had nothing to hide they wouldn’t have anything to hide!!",
      "created_utc": 1725543960.0,
      "score": 36
    },
    {
      "id": "llmpmqw",
      "body": "Yeah, and who cares if you spoke to Cat? Let it all out!",
      "created_utc": 1725544911.0,
      "score": 20
    },
    {
      "id": "llnqdu8",
      "body": "He doesn't even know I've seen a lawyer.",
      "created_utc": 1725556979.0,
      "score": 95
    },
    {
      "id": "lln25ax",
      "body": "Not to mention, the secrecy around her children’s father. If they’re all that close, why is it such a big secret? Luke is the father.",
      "created_utc": 1725549290.0,
      "score": 13
    },
    {
      "id": "llqk5xk",
      "body": "We're probably going to see a counselor this weekend, but at this point, I feel like it's already a foregone conclusion. I'm basically done. I'm just afraid to be done, if that makes sense.",
      "created_utc": 1725591494.0,
      "score": 44
    },
    {
      "id": "llnr157",
      "body": "That part never made any sense to me. Best friends since childhood and in 18 years, since she got pregnant the first time, it’s never been brought up? Nobody’s ever met any of the boyfriends? He’s never asked? That doesn’t seem possible. That makes it look suspicious.",
      "created_utc": 1725557185.0,
      "score": 23
    },
    {
      "id": "llo00rc",
      "body": "He stays the night, he doesnt need a second phone. He can just walk over to her",
      "created_utc": 1725560009.0,
      "score": 19
    },
    {
      "id": "lln3ls5",
      "body": "A good friend would understand how inappropriate everything looks and do her best to save her brother/best friend's marriage.",
      "created_utc": 1725549759.0,
      "score": 22
    },
    {
      "id": "llxdnbt",
      "body": "It seems to me that she found the perfect way to ensure a life where she has no accountability to anyone while always being financially supported by her lover and his family.",
      "created_utc": 1725696711.0,
      "score": 12
    },
    {
      "id": "llqjcda",
      "body": "If they did all this for the *tax benefits* I will probably laugh, cry, or both.",
      "created_utc": 1725591160.0,
      "score": 12
    },
    {
      "id": "llq41gb",
      "body": "[deleted]",
      "created_utc": 1725585465.0,
      "score": 203
    },
    {
      "id": "llqm2x6",
      "body": "Doesn't make sense that'd he'd have to spend the night to do damage control anyway. He could have just gone over there, talked to her for however long it took and just gone home and talked to her. \nLike how would him sleeping on her couch help with the damage? He's obviously sleeping with her.",
      "created_utc": 1725592267.0,
      "score": 95
    },
    {
      "id": "llqczjr",
      "body": "What about damage control for OP??",
      "created_utc": 1725588698.0,
      "score": 37
    },
    {
      "id": "llr53cr",
      "body": "Even if it was his real sister no man is going to stay overnight for any reason ever. Amy can get a real partner if her own if she needs that sort of support. Fuck her.",
      "created_utc": 1725601406.0,
      "score": 22
    },
    {
      "id": "llnqv2r",
      "body": "Thank you",
      "created_utc": 1725557131.0,
      "score": 12
    },
    {
      "id": "llnn0l6",
      "body": "Yeah, exactly.",
      "created_utc": 1725555917.0,
      "score": 75
    },
    {
      "id": "llte7sx",
      "body": "The problem is he isn’t worried about losing his wife. He’s worried about losing his long term girlfriend. She’s the priority.",
      "created_utc": 1725639656.0,
      "score": 8
    },
    {
      "id": "llojksk",
      "body": "So true. When you’re told something over and over and made to feel crazy for not believing it, it becomes sort of easier to believe. Even if you have your doubts. Happens little by little until you’re like “okay I shouldn’t be crazy. I shouldn’t believe what I’m seeing and experiencing, I have to believe my husband.” You convince yourself eventually.",
      "created_utc": 1725566203.0,
      "score": 19
    },
    {
      "id": "llo3k2e",
      "body": "She’d let her daughter commit incest and at the same time learn that it’s ok for your husband to treat you like a second or third class citizen because your needs don’t matter. He can cheat on you if he wants and you’ll end up apologizing. I’m so sad for poor Sophie",
      "created_utc": 1725561128.0,
      "score": 118
    },
    {
      "id": "llnox1e",
      "body": "I think it’s pretty good fiction.",
      "created_utc": 1725556518.0,
      "score": 32
    },
    {
      "id": "llp33tw",
      "body": "Honestly I am too.... I keep coming back to this thread because of it",
      "created_utc": 1725572338.0,
      "score": 11
    },
    {
      "id": "llnbu1v",
      "body": "Assuming you'd like to avoid that conversation with your daughter, could try one more conversation with your husband along the lines of: \"I still have considerable concerns about this, & you really haven't done anything to resolve them. In the continued absence of more information, I feel I will need to have a conversation with our daughter about these concerns in hopes that she doesn't unknowingly commit incest. I would anticipate that conversation could lead to a line of questions from our daughter/children that I might not have all the answers for, but I can't sit silent with my concerns any longer when my daughter's safety & sanity is threatened.\"",
      "created_utc": 1725552384.0,
      "score": 232
    },
    {
      "id": "llnmp8e",
      "body": "You said he “ate humble pie” after spending the night with Amy, but you haven’t used the word “divorce”???\n\nHe is not humble at all, he is just appeasing you.  The fact that he and Amy had you apologizing for your very valid concerns and suspicions shows how expertly you’ve been manipulated.\n\nThey are actively hurting you. Please start getting angry at them and protect yourself.\n\nI hope the only reason you’re not using the word divorce is because you are getting your ducks in a row before you pull the trigger ( hand him divorce papers). Especially if your finances are combined or if you are a stay at home mom or lower income/wealth than your husband. \n\nPlease do everything you can to protect yourself, the children, and your financial well-being.",
      "created_utc": 1725555817.0,
      "score": 121
    },
    {
      "id": "llngan1",
      "body": "What was Luke’s reaction to you alluding to divorce? Does he even grasp the seriousness of this situation? Does he understand how hurtful ii is for him to go to her house, his wife is upset, insecure and hurting and still he goes to her?? Is he that stupid? Or was it more important to him to go comfort his girlfriend over comforting his wife… \n\nIf he did have an affair and fathered her children, then he needs to come clean and tell the truth, ALL OF IT! \nIf he (like a commenter suggested) was the donor via IVF (also a huge betrayal), he still has to tell you all the facts. \n\nThis is an extremely difficult situation, I don’t know what to believe. Im unfortunately leaning towards Luke cheating. My head is spinning, I can only imagine the pain and stress you are feeling right now. \n\nI’m sending you all the love and best wishes, I’m here if you need a friendly chat, a cyber hug or just to vent. Cyber hugs from my (middle aged lady in Denmark)",
      "created_utc": 1725553797.0,
      "score": 21
    },
    {
      "id": "llqls9c",
      "body": "Girl, they look like your kids!!! Why aren’t you putting enough pressure ON YOUR HUSBAND?!? You let his spend the night with another freaking woman??? What in the sister-wives? \n\nIf you don’t do something about this, it’ll never change.\n\nDivorce him and split custody of the kids unless there is a paternity’s test done… HIS OWN MOTHER THINKS THISE ARE HER GRANDKIDS!!!\n\nYou’re letting somebody’s dusty son walk all over you and play in your face!!!!! \n\nPlease stand up and refuse to tolerate this any longer.",
      "created_utc": 1725592150.0,
      "score": 53
    },
    {
      "id": "llrz2sv",
      "body": "She’s saying that nonsense about you being judgmental because she’s pulling DARVO. She’s denying and deflecting and turning it around on you. She’s the one who’s been judging you and finding you lacking - as she basically admitted when she says you’ve done nothing for her. \n\nNext time do not apologize by any means. It makes you look weak to someone like her and she will treat it as an admission of guilt. You did nothing to feel guilty about so do not apologize to her. You demean yourself and your children every time you apologize to this woman who is at the very least having an emotional affair with your husband.",
      "created_utc": 1725620849.0,
      "score": 10
    },
    {
      "id": "llmno6h",
      "body": "Yeah, she won’t share the father of her child with you, won’t provide a dna test, and his solution was to sleep over at her house. All signs point to your husband.",
      "created_utc": 1725544242.0,
      "score": 150
    },
    {
      "id": "llmnrir",
      "body": "Ask your MIL what she would do if she were you.",
      "created_utc": 1725544274.0,
      "score": 69
    },
    {
      "id": "llr8q68",
      "body": "Idk how you didn't counter her saying \"you didn't help me they did!\" With \"I make more than him! You think he could do all this without me supporting so much of this family?!\"\n\nAlso yes you can still do so much even after voicing your concerna. You can still get a secret DNA test. You can still find support in your MIL. Stop fucking making excuses.\n\nBe ok with Tom coming over. Tell Sophie you're over it. Let your husband his girlfriend figure out how to be the bad guys. Odds are they cave and then you have access to his DNA. \n\nTell them you're ok with them dating and see how they react. \n\nSee if the MIL is ok with confronting your husband. See if she'll bring up 23 and me. \n\nJust go nuclear and tell everyone. \n\nStop being so damn passive.",
      "created_utc": 1725603612.0,
      "score": 64
    },
    {
      "id": "llo33zo",
      "body": "Is there anybody in Amy's life that 1) Looks like your husband enough that they could brothers 2) Would Amy be open to using a donor three times 3) Is she obsessed with your husband so much that she would want them to be his in her head. Or your husband is cheating and they are his kids. I don't know.",
      "created_utc": 1725560985.0,
      "score": 23
    },
    {
      "id": "llms18m",
      "body": "This is a wild card… but could it be your father in law? Who else would have such a close link biologically and  personally?",
      "created_utc": 1725545763.0,
      "score": 21
    },
    {
      "id": "llmuubm",
      "body": "The only other thing I can think of is that your FIL is the father of her children that’s why he’s so certain they aren’t having an affair.. but that doesn’t explain why after your husband had a vasectomy (if that’s correct think I read it in your first post) why she’s stopped having children? \nTo me all even if they’re not sleeping together they’re (especially your husband) prioritizing each other over you.. that would be a huge dealbreaker for me..\nI’m so sorry OP and really hope you get your answers for your own peace of mind and sanity (because I can imagine it must be making you feel crazy) \nSending you lots of love and if you need anything or to talk I’m always available xx",
      "created_utc": 1725546900.0,
      "score": 17
    },
    {
      "id": "llmv3t0",
      "body": "Do you know why you didn't mention it, honey? It's because you knew she wouldn't like it, and you subconsciously didn't want that really big part to be out in the open. Even your FIL would have raised his eyebrows at that, I promise you. \n\nHugs to you at this awful time. <3",
      "created_utc": 1725546989.0,
      "score": 174
    },
    {
      "id": "lln0e0l",
      "body": "Mention it. Call her and tell her. You can't live like this.",
      "created_utc": 1725548718.0,
      "score": 67
    },
    {
      "id": "llmylu1",
      "body": "Please stop covering up for your husband. It's bad enough that you accept his mistreatment of you, but you also help him put on a front. \n\nAt this point, avoiding conflict is not helpful. You're already in it.",
      "created_utc": 1725548141.0,
      "score": 82
    },
    {
      "id": "llns271",
      "body": "Stop protecting him. You’re allowed to mention ALL THE THINGS AND WAYS he has shown preferencial treatment to her and inappropriate actions he’s done that support your reasoning.\n\nThis last thing- that was a slap in the face. Send him to his parents or his girlfriend’s house. You are under reacting.",
      "created_utc": 1725557509.0,
      "score": 33
    },
    {
      "id": "llmqht2",
      "body": "I think you should and so many hugs your way! \n\nThe not knowing is eating the mental health!",
      "created_utc": 1725545208.0,
      "score": 66
    },
    {
      "id": "llmtix9",
      "body": "I think you need to let him know that he doesn't need to repair your friendship with Amy. If ever it was to be repaired, Amy needs to repair it. If you two were actually friends, she would be apologizing for making you feel she wanted your husband, assuring you nothing untoward was going on, being thankful that you were okay with your husband giving so much of his time and money to her. Instead she made it clear you have never been friends, she tolerates you and repeatedly proves that he will choose her over you. You may be the wife but she is still number one.\n\nI am guessing Amy never had therapy to cope with her childhood. Your husband is probably her de facto therapist and probably makes sure to prove to her he wouldn't leave her. Even if their is no affair, their relationship is unhealthy. If he feels like he has to save her, he does.\n\nEveryone needs therapy.\n\nGood luck OP. The second you decide on at least a trial separation, file for child support.",
      "created_utc": 1725546378.0,
      "score": 66
    },
    {
      "id": "lln294r",
      "body": "You seem very passive, and that's why your husband and Amy are treating you this way. Put your foot down. Don't worry about upseting Amy. They're the ones overstepping boundaries. It's insane for your husband to sleep at another woman's house, period. Then, to go comfort HER after the fight. What about you? You're the one who needs comfort and reassurance. Even your MIL thinks their behavior isn't right.  \n\nPlease stop being so passive and trying to people please. You wanna do a secret DNA test for just yourself, do it. You don't have to tell anyone. But you're not gonna like the results. Because by Amy's reaction, you already know who the father of her kids are. You're not stupid. You know what days her kids were born on versus when they had a little sleep over. I'm sure you did the math already. \n\nBut above everything, respect yourself and stop letting those two walk over you like a doormat. You don't deserve that.",
      "created_utc": 1725549324.0,
      "score": 37
    },
    {
      "id": "llmy2ht",
      "body": "YOU NEED TO GROW A SPINE AND STAND UP FOR YOURSELF. YOU ARE BEING MANIPULATED AND TAKEN ADVANTAGE OF.",
      "created_utc": 1725547966.0,
      "score": 9
    },
    {
      "id": "llo9l88",
      "body": "I also wanted to point out - when Amy said that you have done nothing for her, it was just your husband and his family - the fact that you let her invade your life as much as you have is a sign of your generosity. Most women would not be that generous with their husbands and families. She has abused the generosity and now it’s time for you to revoke it. You were a lot more understanding than most people would be and she completely took advantage of you so now you need to lay down the law with your husband and the visits need to stop. \n\nI know you’re afraid but you need to make him choose his marriage or his affair. He can’t have both. If he chooses his affair, do you really want to spend the rest of your life on the sidelines looking in? One of my mom’s friends is single now in her 60s and she met an awesome guy at the gym last year. She’s living her best life and she’s two decades older than you. You still have so much life ahead of you. If your husband actually commits to his marriage, great. But if he continues to choose his affair (and each time he’s prioritizing her feelings over yours, he’s choosing the affair), he’s not invested in your marriage. You deserve so much better than that!",
      "created_utc": 1725563046.0,
      "score": 35
    },
    {
      "id": "llmzaa5",
      "body": "Who does this? Who is okay with their husband spending the night with another woman?\n\nEither this is all fake or you have a seriously dysfunctional relationship.\n\nWith as many kids between the two of you, your kids would start to be resentful of the time he is spending with theirs. We have two kids and between the two of us there are times we can’t get enough quality time with each other or our kids because older kids have busy schedules, we have busy schedules and working full time.\n\nUnless none of you work and are all independently wealthy it’s weird you had quality time with your husband alone without any kids and he somehow still had time to spend with all of your kids and somehow hers.\n\nIf this is real, hire an attorney who is good and has a good PI.",
      "created_utc": 1725548359.0,
      "score": 67
    },
    {
      "id": "llnlsfa",
      "body": "How long do you plan on continuing to live without a spine? Your replies are all \"I may do that\" \"I'm not that person but\" \"hopefully it doesn't come to that\" \"they wouldn't like that\" \"I don't want to be the bad guy\".... lady, this is YOUR life. What does your future self look like? This same naive, insecure woman? Do you see yourself continuing to be second place to your husband? Even if these kids aren't biologically his (or his dad's), what the hell is making you stay? Your husband sleeps with another woman. He puts their relationship above yours. You are being lied to and you KNOW IT. You aren't respected at all. Your children see you as an example... is this what you would want for them in their futures? \nCome on. This is coming from a place of love and compassion: please get your big girl pants on and respect YOURSELF. Leave. You will read all this back in about a year, when everything has come to light, and know you should have trusted YOURSELF.",
      "created_utc": 1725555527.0,
      "score": 20
    },
    {
      "id": "llmyw9e",
      "body": "Yea and Amy telling OP she always acted superior, sounds like jealousy on Amy’s part….OP is superior cause she’s actually his wife. This woman was never her friend. \n\nHeartbroken for OP though.",
      "created_utc": 1725548235.0,
      "score": 69
    },
    {
      "id": "lln5wco",
      "body": "I have a feeling the DNA test scenario was already discussed between Luke and Amy with the birth of Amy's first child. I'm sure they are both surprised that it's taken this long for OP to suggest it. As someone else said....if it were true that they are NOT Luke's kids, then I would want that thrown in OP's face.  Amy already knows the answer and that's why she is refusing. The jig would be totally up and ruin Luke's life.  She loves Luke and doesn't want to see that happen.",
      "created_utc": 1725550498.0,
      "score": 17
    },
    {
      "id": "llnqtel",
      "body": "I’m glad that you are waking up from this nightmare and learning to prioritize yourself.",
      "created_utc": 1725557117.0,
      "score": 67
    },
    {
      "id": "llnt95z",
      "body": "My grandma always used to say “what’s done in the dark will always come into the light”. It’s almost like Tom and Sophie’s relationship is the catalyst that will finally bring Luke and Amy’s years affair to the light (yes I firmly believe your suspicions are correct). The thing is both of them are willing to sacrifice Tom and Sophie to maintain their secret. It’s disgusting and immoral. \n\nShort of telling Tom and Sophie they’re (suspected) siblings, nothing will really stop them from being together if that’s what they truly want. Once they become adults then it’s game over. You parents (well really Luke and Amy) will not be able to do anything about it without revealing the truth.   \n\nThe fact that he spent the night after the confrontation is sooooo insane! I truly feel bad for all of the kids involved in this mess and you too. \n\n At this point you might as well have your lawyer draft the divorce papers. Stay strong OP.",
      "created_utc": 1725557883.0,
      "score": 51
    },
    {
      "id": "llocicn",
      "body": "Are you planning on telling him this?\n\nI can't help but feel it's in their hands to put an end to this. Your relationship with either of them won't survive if nothing changes. You needed to voice your concerns, it's also fair to you. Things are in limbo now. Shrugging it under the rug is not going to make this go away. Everyone needs closure here. I can only imagine your anxiety RN ❤️\n\nEven if you're utterly wrong, and they feel betrayed and devastated, they can shut this whole thing down very quickly.\n\nIf he knows losing you is a real threat, maybe it forces his hand to take some action. He'll convince Amy to do it. If I am Amy, and I am not guilty, and I can see that my BFF's wife (and friend) is freaking bananas over this and about to ruin their marriage and it was within my reach to help them, I would swallow my anger and do it.\n \nBut also, I would very desperately want to clear my name, if I wear Amy. And I would come at you, pissed as hell, with the results and tell you *choke on them*.\n\nAsk him to prioritize being your husband for once. And if you have to, you'll spend every day of the rest of your life apologizing and making up for it to him and her. But *HIS WIFE NEEDS THIS*.",
      "created_utc": 1725563982.0,
      "score": 17
    },
    {
      "id": "llpcdg6",
      "body": "What concrete plans have you made to separate and when do you intend to let him know?   Also, you need to set up some individual counseling for yourself to help you negotiate the separation?\n\nNote:  The fact that he isn't alone with her means nothing.  They are communicating constantly.   And that's the thing, even if the kids are not his, he has given too much of himself to Amy and that's left a hole in your marriage.   Fidelity is not just about sex, it includes boundaries with people outside the relationship.  Luke and Amy have been operating with few boundaries for so long, that they operate as a couple and you've been a side chick.   Whether or not the kids are his, the fact that it's been an issue for you for so long, speaks to a fundamental problem between you and your husband as well as between him and Amy.",
      "created_utc": 1725575500.0,
      "score": 8
    },
    {
      "id": "lln7ar6",
      "body": "Luke is the only man that is always around her.  If they are close enough for bestie sleepovers, how are they not close enough for Amy to tell Luke who the children's father is?",
      "created_utc": 1725550946.0,
      "score": 18
    },
    {
      "id": "llnmhds",
      "body": "This is what I’m not understanding. They’re all good friends, yet nobody knows any of her (ex)boyfriends or who the father(s) is/are? That’s bizarre.",
      "created_utc": 1725555748.0,
      "score": 11
    },
    {
      "id": "llqs5t1",
      "body": "The problem I'm having is that there is too much focus on the paternity of Amy's children and no discussion of the effect that his involvement with Amy has had on your marriage.   This is not a marriage that nurtures the partners, it's just a relationship of convenience with a third wheel.   That's what you need to be thinking about.",
      "created_utc": 1725594804.0,
      "score": 50
    },
    {
      "id": "llo0xcp",
      "body": "Yea the more details that come out(or don’t come out) make the husband look more and more suspicious",
      "created_utc": 1725560294.0,
      "score": 11
    },
    {
      "id": "llthv3p",
      "body": "She should have divorced him the second she realized he was acting like the main character from Big Love!  He treated Amy like a second wife and even stayed the night at her house without OP on a fairly regular basis.",
      "created_utc": 1725640838.0,
      "score": 50
    },
    {
      "id": "lm05f2x",
      "body": "I would have booted his ass the first time he stayed the night ages ago. I don't give a shit how good of a friend they are to each other. If she had a husband or bf there then that would be hugely different but no way my man is staying the night at some other woman's house if her man isnt there",
      "created_utc": 1725738986.0,
      "score": 9
    },
    {
      "id": "llw0hz4",
      "body": ">him sleeping on her couch\n\nWait - *couch*? What couch?",
      "created_utc": 1725671684.0,
      "score": 12
    },
    {
      "id": "llqpk2b",
      "body": "Exactly. He either doesn’t think OP will ever stand up for herself and leave, or he doesn’t care about OP feelings as much as he does about Amy’s. Messed up.",
      "created_utc": 1725593696.0,
      "score": 37
    },
    {
      "id": "lltiaoq",
      "body": "I could see a brother staying over if there was a real reason, like a medical reason or he had been drinking.  But to “smooth things over,” nope!  Especially since the person he needed to be smoothing things over with was his wife!",
      "created_utc": 1725640978.0,
      "score": 11
    },
    {
      "id": "llnsqjt",
      "body": "Great suggestion, very well worded!",
      "created_utc": 1725557720.0,
      "score": 38
    },
    {
      "id": "llo6zts",
      "body": "He didn’t eat any humble pie. He probably came home and acted mildly contrite when he saw that OP was upset but he came with the good news that Amy can one day forgive OP. He does not give two figs about OP",
      "created_utc": 1725562221.0,
      "score": 28
    },
    {
      "id": "lln3f1x",
      "body": "Like…that’s all you need to justify how weird and wrong this is. Show anyone those three points and I’d think they would agree (like the in-laws to start).\n\nKeep it simple, OP!",
      "created_utc": 1725549700.0,
      "score": 11
    },
    {
      "id": "llngc36",
      "body": "You’d think her kids would ask who their dad/dads is/are",
      "created_utc": 1725553810.0,
      "score": 10
    },
    {
      "id": "llmyljt",
      "body": "Great advice",
      "created_utc": 1725548138.0,
      "score": 9
    },
    {
      "id": "llp02k1",
      "body": ">The fact that he spent the night after the confrontation is sooooo insane!\n\nIt was their fair well fuck. They knew everything was about to get blown up and decided to have one last night together. I would have told his ass if he walks out that door and goes to her tonight to not come back. OP is terrible at establishing boundaries.",
      "created_utc": 1725571349.0,
      "score": 27
    },
    {
      "id": "llqyra7",
      "body": "Oh I am thinking about that too.",
      "created_utc": 1725597901.0,
      "score": 20
    },
    {
      "id": "llr09lh",
      "body": "I’m also seeing the other aspects as unforgivable, whether the children are his or not. Sleeping over at her house at ANY point is bizarre (?? are their houses that far??), and then also after an emotional confrontation with your wife, she shouldn’t have let him back into the house after that. And their codependency, his insistence on spending so much time outside the house with a woman who “isn’t” his wife and children that “aren’t” his when he has both at home is just cruel. OP I hope can take the plunge, for you and your kids ❤️",
      "created_utc": 1725598699.0,
      "score": 11
    },
    {
      "id": "lls3dmk",
      "body": "Probably both.",
      "created_utc": 1725622963.0,
      "score": 10
    },
    {
      "id": "llq37ky",
      "body": "Yay! Amy can one day forgive her. Poor Amy./s\n\nShe needs to tell her husband that since Amy won't allow a DNA test she will have to tell their daughter what she suspects because she can't allow them to date. If there was nothing to hide then they wouldn't mind DNA tests so that pretty much confirms what she suspects.",
      "created_utc": 1725585164.0,
      "score": 11
    },
    {
      "id": "llr1aum",
      "body": "I hope you update us after the counseling session. Lay it all out there. Hell, is even being up that you aren’t the only one questioning things",
      "created_utc": 1725599265.0,
      "score": 11
    }
  ]
}