{
  "id": "1kfwlhr",
  "title": "What the fuck is with the rise of racism in gen-z???",
  "selftext": "I saw this girl post \"never mix your snow with dirt\". I see so many guys talking about white purity. Insane dog whistles for Jewish hate are all over the internet too. I know there are racists in every generation, but I feel like there's... a lot in gen Z. Has anyone else noticed this??? Are we simply not learning from history or something??? It's actually crazy. I don't get what's going on. \n\nEdit: This post is not an opportunity for you to justify your racism. It was a question about the culture we've created, not your biases. Please do not come here with that shit. ",
  "created_utc": 1746508018.0,
  "score": 5005,
  "num_comments": 707,
  "url": "https://www.reddit.com/r/offmychest/comments/1kfwlhr/what_the_fuck_is_with_the_rise_of_racism_in_genz/",
  "comments": [
    {
      "id": "mqw76fl",
      "body": "Just to be clear - racism is not tolerated here. Please help the mods out by reporting any racist comments you see. ♥️",
      "created_utc": 1746543252.0,
      "score": 1
    },
    {
      "id": "mquk8vx",
      "body": "Stupid internet rabbit holes are to blame 100%.\n\nPeople end out being contrarian their entire personality",
      "created_utc": 1746516955.0,
      "score": 3635
    },
    {
      "id": "mqv5nl4",
      "body": "No joke, memes help normalize a lot of extreme thinking and views.",
      "created_utc": 1746529839.0,
      "score": 1608
    },
    {
      "id": "mquiimn",
      "body": "I feel like Gen Z is becoming more and more radicalized instead of \"just racist\" and for whatever reason it's becoming more and more socially accepted that racist statements are \"allowed\" to be said without any resistance. And one of the biggest problems for this are short format videos, as it is precisely the most racist and right-wing parties that have the strongest presence there and then try to push as much populism as possible.",
      "created_utc": 1746515833.0,
      "score": 2309
    },
    {
      "id": "mqvf3he",
      "body": "The internet raised them and the culture online is pretty racist. I think about gaming online and slurs are thrown around like it’s nothing",
      "created_utc": 1746533918.0,
      "score": 62
    },
    {
      "id": "mqub98n",
      "body": "It’s the same in India. They have taken it up a notch.\nThey are racist as well as filthy casteist so much so that they say casteist slurs openly which are punishable by law. They wanna bring back the historical caste discrimination. They don’t get any heat for that because they are the supporters of the people in power (the govt).",
      "created_utc": 1746511449.0,
      "score": 701
    },
    {
      "id": "mqwakt8",
      "body": "Society has stopped making racist feel uncomfortable about being racists openly. That's the safest answer I have. The amount of casual blatant racism I see on a daily, and not just on the internet but at my damn job or just having outings, is disgusting.",
      "created_utc": 1746544226.0,
      "score": 57
    },
    {
      "id": "mqu6wf6",
      "body": "It’s a mix of closeted racists and people who think being outrageous is edgy or cool. Hate is being slowly normalized.\n\nTake the woman who called a little boy a racial slur—she raised $650,000. That’s not just disturbing, it’s a glimpse into what some people are quietly preaching. \n\nAnd as this kind of behavior gains traction, it’s starting to show its true colors.",
      "created_utc": 1746509063.0,
      "score": 837
    },
    {
      "id": "mqud7ae",
      "body": "geez i fucking hate tiktok it's a petri dish of flith",
      "created_utc": 1746512580.0,
      "score": 1051
    },
    {
      "id": "mqufmku",
      "body": "I've been seeing a lot more of it lately and it's honestly sickening. I wouldn't talk about an animal the way I've seen some of these people talk about each other, or even how they'll talk about children",
      "created_utc": 1746514034.0,
      "score": 168
    },
    {
      "id": "mqugjpb",
      "body": "The internet exposed everyone to open confrontation every day. It makes it harder to see the good in people",
      "created_utc": 1746514593.0,
      "score": 99
    },
    {
      "id": "mqv2b07",
      "body": "They dont read and lack empathy.",
      "created_utc": 1746528183.0,
      "score": 95
    },
    {
      "id": "mquz5x5",
      "body": "People are poor, unhappy and lacking hope. There's no surefire promotion to pursue, no great war to win, no loving community to preserve, no money to build etc. Shitty, malicious people use this to their advantage and influence the public into believing this is the fault of whoever doesn't look or act like them. Be that people from other countries, ethnicities, genders or whatever. The truth is and always has been that we have more in common with these groups than we do with our ruling elite.",
      "created_utc": 1746526477.0,
      "score": 33
    },
    {
      "id": "mqvangk",
      "body": "Challenging to develop empathy or at a more basic level, a personality if you’ve been force fed through a screen your whole life. A gross generalization but watching families at restaurants with screens in their faces and no familial interaction is likely not a positive.",
      "created_utc": 1746532090.0,
      "score": 30
    },
    {
      "id": "mquryac",
      "body": "Bro my gen-z coworker changed our computer password to hitlers bday. What is going on?",
      "created_utc": 1746521990.0,
      "score": 73
    },
    {
      "id": "mquo417",
      "body": "Instagram has turned horrid these past few years. Very brazen racism against Black people. Anyone who says that “no one ever says anything about Black people!” Need only open instagram. Calling us ugly, n*****s, apes, asking us to be killed, etc. Saw a video of some random guy saying “everything is nicer in Black except women”. A BLACK MAN responded “i’m a Black man and I approve this message” with 11K likes and there were tons of other people up and down agreeing and pulling the whole “it’s just a PREFERENCE” crap. \n\nI’m over it either way. Certainly doesn’t inspire me to want to help or interact with anyone I don’t know extremely well. Every man for themselves",
      "created_utc": 1746519467.0,
      "score": 125
    },
    {
      "id": "mqv5iq3",
      "body": "Social media is a plague upon society and empowers the absolute worst dregs of society, giving them a platform and way to gain and spread influence",
      "created_utc": 1746529775.0,
      "score": 22
    },
    {
      "id": "mquy519",
      "body": "It's certainly not all of GenZ, but I think the answer you are looking for can be spotted within every generation at this present moment. Trump has set off it being socially acceptable to be racist, to be a white supremacist, to have no empathy for others, the list goes on. Once it's deemed socially acceptable by the \"masses\" then people that are just shitty individuals will use that opportunity to be shitty as they assume there will be no social consequences.",
      "created_utc": 1746525889.0,
      "score": 103
    },
    {
      "id": "mqun782",
      "body": "there was a huge dip in the economy whenever the world goes through some type of economic hardship extremely right leaning views start to form",
      "created_utc": 1746518873.0,
      "score": 47
    },
    {
      "id": "mqusncs",
      "body": "I THOUGHT I WAS THE ONLY ONE WHY IS NO ONE TALKING ABOUT THIS",
      "created_utc": 1746522449.0,
      "score": 41
    },
    {
      "id": "mqv557e",
      "body": "gen Z are basically boomers 2.0 - the media frames them as ecological, conscious and \"a breathe of fresh air\", and like with the boomers they will end up racist, misogynist and turbo-consumerist.",
      "created_utc": 1746529595.0,
      "score": 84
    },
    {
      "id": "mqwly58",
      "body": "I blame a lot on Covid, gen z went from being incredibly empathetic and kind, to being the actual worst after isolation. Like how did the generation that thanked the bus driver become *motions erratically* this nonsense.",
      "created_utc": 1746547507.0,
      "score": 13
    },
    {
      "id": "mqv0yk5",
      "body": "wow i really do live in my algorithm bubble huh?",
      "created_utc": 1746527474.0,
      "score": 12
    },
    {
      "id": "mqvavff",
      "body": "It only seems that way because that entire age group is on the Internet, so the likelihood of coming across an awful/loud one is much higher.",
      "created_utc": 1746532185.0,
      "score": 10
    },
    {
      "id": "mqug5eo",
      "body": "Ummmm hello, look who is running the US??? An openly racist POS who says it's okay for others to think and feel the same way he and his buddies do. That certain people are beneath them.",
      "created_utc": 1746514354.0,
      "score": 130
    },
    {
      "id": "mqv75x1",
      "body": "And I’m so sick of people acting like their kids could never do this kind of stuff, like high schoolers are the main ones! They’re always saying something racist, white peoples becoming friends with black peoples so they can get an “N-word pass” like what?? Love your kids but don’t forget that they’re still human and can be garbage ones at that, whether it’s your fault or not.",
      "created_utc": 1746530544.0,
      "score": 17
    },
    {
      "id": "mquczjk",
      "body": "Just remember OP. Knowledge is what free us from being bound to such stupid and outdated ideas. They are scared or idiots who truly can’t comprehend how much better this world would be if we were more accepting of others as long as resect is mutual. They’re miserable people who lack any peace.",
      "created_utc": 1746512454.0,
      "score": 46
    },
    {
      "id": "mqveg99",
      "body": "This is so longwinded but this always fascinates me, being a black woman in Gen Z! \n\nI’m Gen Z (27) and black. IMO dealing with racism in my area openly and often, it is often the younger people who end up sticking up for me (think: 25 and up?). I think the bullies on the internet are the much younger Gen Z into Gen Alpha, and some of my generation. The people who are 15-22?? On instagram at least it’s SO bad. That’s what I’ve noticed. That being said - I’ve seen an uptick in racist behavior and comments from literally every single group including millennials. The amount of millennial racist content I see is actually astounding to me lately, and about half of millennials and Gen Z are pointlessly calling each other out. We point at boomers and they’re bad, but holy shit Gen X is absolutely not getting a pass. In my lived experience that’s actually been one of the absolutely worst generations I have dealt with for racism, consistently. Online they’re unbelievably loud about the white race. Conservatism and hyper religiousness are on the rise, and these two things breed bad behavior. The shame in my home town for not being religious was unreal, and a lot of the young girls in my school were finding every way to be a regular teenager without upsetting god & their family. This didn’t end well, and always included racism. The ideas I heard perpetuated “by god” were insane. \n\nNonetheless my point being that I feel we’re assigning it to generations and it’s not a generational thing. I think it’s a whiplash because really others expected different.  The assumption was, my generation started out less so that way, with Obama as a president for 8 years of our childhood which was a good example. Don’t be fooled though - the racism I faced from my peers back then was absolutely astounding. Going through school my parents said the stuff I went through sounded like it came from a time before them. Their generation raised us 🤷🏾‍♀️Many houses of friends I couldn’t go to because their parents wouldn’t stop saying horrific things. It is often taught, and sometimes found. \n\nRemember, people often don’t do the work. Many of us here are no better than our parents were, who are no better than their grandparents were. This is how this stuff continues to perpetuate. I also see a rise of Gen Z bros who are absolutely fighting the patriarchy and fighting their peers every single day. I follow at least five of them, and I don’t look for that type of content, with many more popping up. Don’t lose hope because hatred is loud. My generation got bashed from the get go and it felt bigger & louder because the internet is here, and some people definitely use that as an excuse to be an apathetic piece of shit. It’s an amalgamation of things for Gen Z imo but knowing the homes so many people came from, I called this like 15 years ago! As a kid lol. I will say my generation has done wonders being more accepting to gay folk (and often times trans too) and although that’s unfortunately turning with the rise of conservatism, I do think it’ll also go back. \n\nThings won’t be drastically different until people realize we really need to fight for them to be. Many people who aren’t a minority and, honestly, aren’t *black* especially don’t understand how much needs to be done to insure children are not raised this way. It starts at home, yes by my experience it is absolutely perpetuated and allowed in school, and it continues in adulthood as racism is routinely awarded. A new generation doesn’t just fix it if the ideals are around and accepted.",
      "created_utc": 1746533660.0,
      "score": 42
    },
    {
      "id": "mqvwdpz",
      "body": "I don’t personally subscribe to those beliefs as a Gen Z, but I think it has to do with that many of us have millennial older siblings (like me), a generation that’s much more left wing and believe in social justice compared to previous ones. Pair that with a lot of us were dumb gullible kids in 2015/2016 during the edgy era of the internet with the “check your privilege” meme shit. So a lot of Gen Z just wants to be contrarian and edgy for the sake of being contrarian and edgy.",
      "created_utc": 1746540003.0,
      "score": 8
    },
    {
      "id": "mqysiwm",
      "body": "Besides typical edgy young person behavior, I think there are two explanations:\n\n* Social media as an alt-right, edgelord pipeline has always been a thing \n\n* Many of them grew up during the whole “don’t say gay” (as stupid) PSAs and people were hyper militant regarding triggers, offending people, and being PC during many of Gen Z’s formative years, so they view edgy humor as a “fun” taboo.",
      "created_utc": 1746570170.0,
      "score": 8
    },
    {
      "id": "mqukuc7",
      "body": "It’s really sad to be honest. It’s like we are reverting back to Jim Crow days (from what I read when I was a child) the only difference is that there are no freedom fighters.",
      "created_utc": 1746517344.0,
      "score": 21
    },
    {
      "id": "mqup1lj",
      "body": "from what i’ve seen, it’s because not being racist is starting to be called “too woke” which is fucking insane to me personally. what’s so woke about treating someone with respect and not being a piece of shit? that’s not being too woke or wtv. that’s just being a normal person.",
      "created_utc": 1746520083.0,
      "score": 35
    },
    {
      "id": "mqzvwdq",
      "body": "I think it has more to do with white guilt. It’s almost being pushed down people’s throats and it’s creating resentment. I am a person of colour and I see it every day. \n\nI feel sorry for young white men. They have been marked as the problem even though many of them weren’t born when issues started. They are lashing out against a world that tells them they are trash.",
      "created_utc": 1746583619.0,
      "score": 7
    },
    {
      "id": "mqvj13q",
      "body": "I don't think there's more racism. \n\nI think there's more social media, amplifying the message.",
      "created_utc": 1746535444.0,
      "score": 13
    },
    {
      "id": "mqv6g8t",
      "body": "Millenials grew up in the wake of the Civil rights movement. Gen Z grew up with a black president in.a \"post racial\" time, racism is trivial to them",
      "created_utc": 1746530213.0,
      "score": 13
    },
    {
      "id": "mqw9kbg",
      "body": "Simple answer - unfettered internet access. I’m\na ‘95 baby and grew up alongside the explosive rise of the internet. I was the same as Gen-Z is now when I was their age. I thought it was cool and funny to be an edgy asshole. People didn’t like that I swore and used slurs so causally. I didn’t care then because I thought somehow I was superior for being unfiltered and unapologetic. It wasn’t until I went to college, met people outside of my home town, learned so much about life, the human experience, and history, that I finally came to the realization that my thoughts and words were toxic and damaging. While I hope that Gen-Z eventually “grows out” of their edgy asshole years, I doubt it’ll happen any time soon. Today’s climate just caters to their toxicity.",
      "created_utc": 1746543937.0,
      "score": 5
    },
    {
      "id": "mquwvsn",
      "body": "I was discussing this with my geography teacher the other day. Basically this is a common cycle of humanity where one generation is liberal, one in between is mixed and the next generation will have more conservative people. \n\nThis is a result of young people seeing the world today, hearing how \"great\" were the times before (they weren't, we just tend to remember the good times) and want to go back to them. A given example was that before, people fought for equality and for other races to enter x country and now kids see a mix of different people and with a slight push of one conservative grandfather, there are suddenly 3 racist teenagers. \n\nThe cycle will continue, with the next generation being mixed and the one after being more liberal. It's sad but that's life.",
      "created_utc": 1746525148.0,
      "score": 10
    },
    {
      "id": "mqur0oe",
      "body": "Rise of fascism.\n\nThese people always existed, always have, and to some degree, likely always will.\n\nWhat you're seeing isn't that they're WAY more common (though they are getting more common), but rather that the ones that are there are more open and proud of their bigotry.\n\nWhen in doubt on how to handle them, look up \"Richard Spencer gif\"",
      "created_utc": 1746521388.0,
      "score": 9
    },
    {
      "id": "mqw7hc8",
      "body": "Unmonitored internet access from a young age will push people into extremes on any viewpoint. \n\nYour parents were mildly racist? Well if you grew up with that viewpoint, you could meet some dude online named xXWhiteHaterXx or some shit who sends you some made up graph about crime statistics and tells you that it’s secret knowledge ‘they’ don’t want you to know. Rabbit hole from there. Now you’re seig heiling at 16 or whatever. Many such cases.",
      "created_utc": 1746543338.0,
      "score": 4
    },
    {
      "id": "mqyz5wl",
      "body": "I said that racism skipped millennials and went straight to Gen Z and someone said that GenZ were the most progressive 😂. Not saying that there are Millennial racist but all we cared about was AOL and who removed us from the top 5 on MySpace lol. We used to say when the boomers die off as would racism but Gen Z is keeping it alive. The next generation will probably be another version of Millennials.",
      "created_utc": 1746572359.0,
      "score": 5
    },
    {
      "id": "mqztvl6",
      "body": "I feel like many of us Millenial aunts/uncles, older brothers/sisters were either too hands off in helping to raise Gen-Z out of fear of messing them up like we were, or we pushed our optimism and social justice narrative too hard and they are rebelling like youmg people are wont to do. Im not sure what we *should* have done, but I feel like we are partially responsible.\n\nI think a lot of them see us a suckers for believing so hard that we could make a change ('07-'15) only for the backlash to be so hard that it broke the country ('16- now). Shit, truthfully, all we have left is our craft breweries, burger joints, and bullshit pop folk that they make fun of us for. All the legislation and change we fought for is on fire right now.",
      "created_utc": 1746582930.0,
      "score": 5
    },
    {
      "id": "mquez26",
      "body": "It’s because of Trump",
      "created_utc": 1746513636.0,
      "score": 85
    },
    {
      "id": "mqv49vo",
      "body": "Saw somewhere that they are using roblox/fortnite/etc to target the youth. Their media is normalizing and encouraging this kind of behavior.",
      "created_utc": 1746529170.0,
      "score": 8
    },
    {
      "id": "mqw5av9",
      "body": "I’ve heard them called “zoomers”. They’re young boomers. They’re miserable, think everything is cringe, and hate other people.",
      "created_utc": 1746542709.0,
      "score": 12
    },
    {
      "id": "mqvcajq",
      "body": "YouTube rage bait creators.",
      "created_utc": 1746532776.0,
      "score": 8
    },
    {
      "id": "mqvlv5c",
      "body": "Government and rich elites in Kahoot, stifle society (housing, job, not arresting criminals), the upcoming generation needs someone to blame and as such lash out at what is in front of them but as with everything as soon as that is removed they’ll see the problem goes deeper",
      "created_utc": 1746536484.0,
      "score": 3
    },
    {
      "id": "mqvvi6r",
      "body": "The internet plays a really big role in this in more ways than one. Perhaps it really is making people racist because over the internet your actions have little to no consequences, or it could also be a perspective thing. Maybe it just seems like there are \"more\" racist gen-z'ers because they're compressed and have their own little corner of the internet where they can say whatever they want and have others openly agree with them, and you just happened to come across that corner. Keep in mind there are 2+ billion gen z in the world, and it's likely the amount you've come across hasn't reached 1k.",
      "created_utc": 1746539725.0,
      "score": 4
    },
    {
      "id": "mqw7if0",
      "body": "Gen Z is a generation that grew up with social media. The amount of garbage fed to them via FB, IG, tik tok etc is revolting. Not to mention the rabbit holes of “alpha/sigma”, Andrew Tate and other garbage.\n\nBut a lot of times it’s just them morons thinking it’s funny fOr tHE mEmEZ",
      "created_utc": 1746543347.0,
      "score": 4
    },
    {
      "id": "mqwbbbs",
      "body": "I think it’s definitely politics and influencers, but also a lot of gen z has great grandparents (even grandparents) that were raised during a time where it was more acceptable to be racist. Gen Z overall is definitely more accepting than the ones before then, but there’s still going to be some that don’t outgrow that.",
      "created_utc": 1746544437.0,
      "score": 5
    },
    {
      "id": "mqwrx6i",
      "body": "The Washington Post put out an interesting opinion piece that the pandemic created two different cohorts of Gen-Z. There's the older ones that graduated high school and maybe did a couple years of university pre-covid. They are more progressive, protested the policies of Trump's first term, and I'd argue received a higher quality education. \n\nThe younger ones who experienced the pandemic in their coming-of-age years grew a deeper mistrust of all institutions; Government, universities, science etc. They also grew more isolated leaving them vulnerable to hateful online rabbit holes. They likely received a lower quality online education, that is if they chose to show up or participate in online schooling at all. I think broad social trauma like that can lead people to find someone to blame, and that often lands on minority groups.",
      "created_utc": 1746549246.0,
      "score": 4
    },
    {
      "id": "mqzcfok",
      "body": "I promise it ain’t all of us. Hell I’m southern and I know better 😭",
      "created_utc": 1746576833.0,
      "score": 4
    },
    {
      "id": "mr0my5m",
      "body": "Cause being “edgy” and “against the machine” is more popular than ever. And with people actually you know, criticizing racism online often, they see it as being rebellious by being racist. It’s stupid and ironic and I hate my generation.",
      "created_utc": 1746594770.0,
      "score": 4
    },
    {
      "id": "mquymu7",
      "body": "I've noticed it. I'm a reserve deputy and the last disagreement between a white and Black guy the white dude dropped the N with a hard r. I'm like ya know what? Disturbing the peace. I've got kids around, you're yelling it, we're not playing these games anymore.",
      "created_utc": 1746526173.0,
      "score": 12
    },
    {
      "id": "mqv8l5e",
      "body": "I think everything is becoming normalized, which can be considered good or bad. There is racism but not bullying, there are offensive jokes but no one attempts to make it real. I don't know if I like this but people only being aggressive on social media instead of real life is fine for me.",
      "created_utc": 1746531192.0,
      "score": 7
    },
    {
      "id": "mqv6uv6",
      "body": "When the economy is shit people try to find someone to blame",
      "created_utc": 1746530402.0,
      "score": 7
    },
    {
      "id": "mqvlyt7",
      "body": "Mate, every generation is racist, Gen-Z is more active on social media, maybe that’s why we’re seeing it more",
      "created_utc": 1746536522.0,
      "score": 6
    },
    {
      "id": "mquzj9s",
      "body": "It's not that there is more racism, it's that more people feel comfortable saying the first \"thought\" that comes to mind and share it on the internet. Meaning you're seeing/hearing opinions from the whole world. Where as before the internet you didn't get everyone's opinion, you only got the opinions of those around you.",
      "created_utc": 1746526685.0,
      "score": 3
    },
    {
      "id": "mqv61lf",
      "body": "Gate groups have been found to have grooming tactics out in the open online to turn people into racists and other forms of prejudice. However, nobody is interested in stopping them, and most cannot recognize them. A lot of these \"ranked competitive racism\" memes are made by people who are racist, btw. ",
      "created_utc": 1746530022.0,
      "score": 3
    },
    {
      "id": "mqw102v",
      "body": "I blame the internet for a lot of these problems. When I was a kid, if you said something racist, you got called out and there was no online safe haven to go hide in and let your ideas grow. Now, you can find a group that supports pretty much any opinion, so people largely live in an echo chamber where their ideas are just reinforced instead of challenged. I think there’s also just a tendency for younger people to be racist because it’s edgy and cool, and also I mean look at conservative politics these days. Being racist is more or less mainstream. Again, when I was a kid it was incredibly taboo to be racist, and now you’ve got the president of the United States talking about immigrants eating dogs. The political and cultural climate we live in is very accepting of racism unfortunately. ",
      "created_utc": 1746541418.0,
      "score": 3
    },
    {
      "id": "mqw1lt6",
      "body": "Honestly I think it's just that the minority (racists) are a bit more vocal, overall I don't think they are more racist, if anything I think they're a lot more accepting of other races and that's coming from a millennial",
      "created_utc": 1746541601.0,
      "score": 3
    },
    {
      "id": "mqwerkq",
      "body": "We're seeing the first generation that's grown up with mobile phones and social media dominating people's lives. It's bound to fuck some shit up, it's one of the most marked change in lifestyle in human history and nobody seems to remember that.",
      "created_utc": 1746545429.0,
      "score": 3
    },
    {
      "id": "mqwgisj",
      "body": "myspace tom was the oppenheimer of his generation",
      "created_utc": 1746545941.0,
      "score": 3
    },
    {
      "id": "mqwh4ry",
      "body": "You can see Reddit rife with hatred and vile comments towards Indians and that subcontinent. Like it’s so normal and normalized that they’re considered sub-human. Even from the ones who say they’re not racist! But I digress because that applies to all generations and not just gen-Z.",
      "created_utc": 1746546117.0,
      "score": 3
    },
    {
      "id": "mqwis5u",
      "body": "I think being chronically online creates this echo chamber and some of these younger folks forget that there is a real world outside the internet/social media. Racists feel more comfortable being racist online, and some of them feed off the attention and outrage. I saw that “snow” girl on TikTok and just blocked and reported her. Don’t give them the attention they want. \n\nI have also noticed how hyper critical gen Z are of each other and everyone else, especially about appearance. There’s this unhealthy obsession with not aging, too. It feels so suffocating in comparison to how social media was when I was a teen and young adult (I’m 36).",
      "created_utc": 1746546594.0,
      "score": 3
    },
    {
      "id": "mqwn9xq",
      "body": "I feel like it has to do with how the internet becomes an echo chamber for your own believes and keeps people with different views out of your view. They see people agree with them and feel more justified to keep going.",
      "created_utc": 1746547899.0,
      "score": 3
    },
    {
      "id": "mqwolsh",
      "body": "Not racist but I've also noticed it and even without some friend groups I used to be a part of. From what I've noticed, a lot of people have been blaming the rise in immigration and refugees for our economy failing and once you click a few \"articles\" or sources with that narrative, the algorithm just feeds you this type of content so they feel more and more justified.",
      "created_utc": 1746548288.0,
      "score": 3
    },
    {
      "id": "mqwxplh",
      "body": "All the ignorant ass parents donating over 600k to trash calling a child a racial slur should be a big indication. \n\nThis country utterly disgusts me and so many are completely missing the assignment.",
      "created_utc": 1746550870.0,
      "score": 3
    },
    {
      "id": "mqx347h",
      "body": "Maybe could be the live genocide happening in realtime.",
      "created_utc": 1746552377.0,
      "score": 3
    },
    {
      "id": "mqx44pc",
      "body": "Chronically online teens who don't have real people experience yet tend to fall into the racist or right wing rabbit holes. Its been a consistent problem since I was in my early teens",
      "created_utc": 1746552662.0,
      "score": 3
    },
    {
      "id": "mqx90sn",
      "body": "On one hand the kids are impressionable\nOn the other-admittedly you can’t lump vastly different groups of people in together without some negative feelings and sentiments developing between or towards each other",
      "created_utc": 1746554047.0,
      "score": 3
    },
    {
      "id": "mqxktj5",
      "body": "Stupid internet rabbit holes, lack of critical thinking, and the normalization of being cruel as humor. It’s so fucking embarrassing to be an elder gen Z rn",
      "created_utc": 1746557436.0,
      "score": 3
    },
    {
      "id": "mqy1b0w",
      "body": "Definitely! live in a very predominant “race” or “light color” area, never had a problem while growing up and I’m part of gen-z. Now 2024 I had my “first” racist encounter from someone YOUNGER than me. It’s very concerning tbh. Like I thought this place was different as I had no issues while growing up but dang now I’m just like “I thought we got a long” “why does my color bother you when yours doesn’t bother me??” Times are weird yall",
      "created_utc": 1746562185.0,
      "score": 3
    },
    {
      "id": "mqybaec",
      "body": "Too many algorithms that lead kids to rabbit holes , a nephew of mine was getting really into alt right stuff and it was because it was all in his suggested stuff on YouTube .\n\nThat being said , I’m in America and we have literal internet trolls running this country - so if this is the “example “ for the youth to follow it’s a pretty shit one .",
      "created_utc": 1746564989.0,
      "score": 3
    },
    {
      "id": "mqyjfy3",
      "body": "Yeah I never thought I’d see people giving legitimate serious arguments as to why “race-mixing” is bad. Holy shit.",
      "created_utc": 1746567387.0,
      "score": 3
    },
    {
      "id": "mqzrbej",
      "body": "One of the most racist, anti-black people I know is a Filipino workmate of mine. When I (also Asian, but not Filipino) asked him why that was, he said that his sister was apparently SA-ed by a black man and forced to carry the baby due to family conservatism (christian stuff, I believe), and his mom was apparently randomly attacked by yet another black man at random while she was walking home from work (fell on the side walk and hit her head, causing some kind of problem, I forgot). So, he chose to blame black people as a whole and now thinks they're all physically violent grapists. \n\nI didn't wanna argue, but there's also probably a good chunk of unfair generalization going on.",
      "created_utc": 1746582093.0,
      "score": 3
    },
    {
      "id": "mqzzbpx",
      "body": "Id say the ability to research. It’s incredibly easy to find data and accurate historical information nowadays. They are just making their informed decision, whether is a good one or not is a different matter.",
      "created_utc": 1746584817.0,
      "score": 3
    },
    {
      "id": "mr01ax0",
      "body": "Monkey's can perceive unfairness, Gen Z grew up on tablets and media telling them everything is racist, sexist, phobic, etc, and it's their fault(race/skin).\n\nThey also partake in contrarian and edgy media that is mainly non-liberal since they're not hip with the kids.\n\nBasically they don't give a fuck about anything past face value, equity? That's not equality, get that shit out of here! The world has decided some bad things are allowed because x or y but the kids?\n\nThey DON'T care, bad is bad, and if people are allowed to be bad for ANY reason then they're allowed to be bad.\n\nThis is the result of people becoming racist in the name of stopping racism, we've come full circle and now we have ACTUAL racism back in.",
      "created_utc": 1746585531.0,
      "score": 3
    },
    {
      "id": "mr09i54",
      "body": "She got clowned on through all of TT the real crazy one is that “lady” who got 600k in donations after saying horrible things to a child",
      "created_utc": 1746588697.0,
      "score": 3
    },
    {
      "id": "mr0dh9c",
      "body": "Charlie Kirk and other alt-right influencers are to blame",
      "created_utc": 1746590351.0,
      "score": 3
    },
    {
      "id": "mr0irte",
      "body": "Hmm... Well, blame social media algorithms. All it takes is a couple of \"informational style\" AI speaking clips that sound like it is an intellectual argument, but its chest propagandized nonsense generated to sow hate. It's like people have never been on the internet and don't know how to be like \"okay I call bullshit,\" then the bot farms. People with 100s of phones in front of them help that narrative stick by making an echo chamber of the bullshit/hate that they want sown, and the rest is history. \nThe head of the CIA in the 80s said, \"Tell/ spread a lie long enough, where people will end up defending that lie as if it were truth, that's when you know your job is done\" or something along those lines. \nI just wish people were more objective on the content they consume and stronger willed to not allow it to consume them. Sadly, though, we have quite the timeline going on right now\n\n-Heywoodjablowme",
      "created_utc": 1746592708.0,
      "score": 3
    },
    {
      "id": "mr0r31z",
      "body": "Shitty. Parents.",
      "created_utc": 1746596963.0,
      "score": 3
    },
    {
      "id": "mr0scxe",
      "body": "gen-z often makes fun of millenials, but millenials are probably the most progressive generation. it's so disturbing to see how far we've regressed.",
      "created_utc": 1746597667.0,
      "score": 3
    },
    {
      "id": "mr1toqt",
      "body": "It's easy to understand, it depends a lot on the country and city you live in. For example, it's not the same to live in a town in the USA where people are respectful, than in the south of Italy in a city full of immigration and crime. People aren't racist because it's trendy (unless you're 12 lol), but because of experiences. If you see a certain group of people causing a lot of crimes, you end up having prejudices. \n\nIt's easier to understand if you travel more, that's why people in Tokyo don't like tourists, or why people in Spain are disgusted by immigrants.",
      "created_utc": 1746618820.0,
      "score": 3
    },
    {
      "id": "mr1x5th",
      "body": "Been to twitter lately? (I refuse to fucking call it X), it’s beyond right-wing, it’s just weird",
      "created_utc": 1746620223.0,
      "score": 3
    },
    {
      "id": "mr6opzo",
      "body": "They're not racist, the kids are just clowning everyone and most will even tell you lol. ",
      "created_utc": 1746674347.0,
      "score": 3
    },
    {
      "id": "mqw1ovc",
      "body": "and not just racism! Homophobia, fascism, sexism, bigotry, misogyny etc...",
      "created_utc": 1746541626.0,
      "score": 6
    },
    {
      "id": "mqvkgv4",
      "body": "Trump",
      "created_utc": 1746535977.0,
      "score": 5
    },
    {
      "id": "mqw83rt",
      "body": "In case you haven't been paying attention, there is a general rise of right wing values pretty much globally at this point, and its been happening for almost a decade now. This is because most people will do nothing of substance when faced with this level of discrimination, especially if it is not directed at them. \n\nBe the change you want to see. If someone is being racist, call their ass out. Embarrass the hell out of them. But you need to do it to EVERYONE who is being bigoted. You can't give your parents, friends or partners a pass. Make sure they know its not acceptable, ever.\n\n(To be clear this is a general statement, not directed soley at OP)",
      "created_utc": 1746543516.0,
      "score": 5
    },
    {
      "id": "mqwf9uh",
      "body": "Not just racism, misogyny too. The Andrew Tate type alpha male shit. It's all very alarming.",
      "created_utc": 1746545577.0,
      "score": 4
    },
    {
      "id": "mqwnxee",
      "body": "After a quick Google, I just learned I'm in Gen-Z. Despite going to a segregated school and being educated to have a racist mindset, I grew out of it by like 14/15ish in a nonsegregated school across the country, and very much developed a just let people live their life mentality.\n\nI personally feel like a lot of it started when Trump became president and showed off his racism and people thought well since the president is racist its ok now, and it started just a downward spiral in just about every where. \n\nHe became president when I was in high school, and the students in my grade all started using slurs and saying racist things by the end of that year, and the kids starting the highschool the following year were even worse.",
      "created_utc": 1746548090.0,
      "score": 5
    },
    {
      "id": "mqxku5v",
      "body": "They are Making America Great Again, don’t you know? /s\n\nEdit:\n\nAdding sarcastic tag.",
      "created_utc": 1746557441.0,
      "score": 4
    },
    {
      "id": "mqytac1",
      "body": "Their media consumption is 95% far right racist podcasters and manosphere streamers.  That’s pretty much the story",
      "created_utc": 1746570421.0,
      "score": 4
    },
    {
      "id": "mqueebt",
      "body": "Delete your socials and go talk to some Gen z kids in real life - in my experience they are more emotionally mature and unprejudiced than any other age group. The internet is just full of garbage. Don't spread it by quoting awful terms/phrases etc.",
      "created_utc": 1746513286.0,
      "score": 39
    },
    {
      "id": "mqug96b",
      "body": "They think they’re being funny and edgy, unaware of the actual harm behind it…”fOR tHe mEmeZ”",
      "created_utc": 1746514418.0,
      "score": 12
    },
    {
      "id": "mquz3pu",
      "body": "Look what they consume on social media. On top of that, they know saying something racist will make them go viral and get paid.\n\nThey're dumber than other generations, making it easier for them to become racist.",
      "created_utc": 1746526441.0,
      "score": 6
    },
    {
      "id": "mqvr5hb",
      "body": "The techbro billionaires are using online propaganda and other manipulation tactics to further their agenda of making sure White Supremacy doesn't die a well-deserved death.\n\nThey're terrified of becoming the minority because of how they've treated minorities in this country. They think they will face the same things if they ever lose their top dog status. \n\nThis is an extinction burst, albeit a very loud and destructive one.",
      "created_utc": 1746538339.0,
      "score": 6
    },
    {
      "id": "mqvga41",
      "body": "Appalling media literacy and an ignorance of where this kind of attitude gets you.",
      "created_utc": 1746534385.0,
      "score": 5
    },
    {
      "id": "mqvn8zl",
      "body": "Video game / music and social media culture is taking a horrible turn. Kanye, Asmongold, StaySafe, Joe Rohan , Tim Poole, those handful of butt hurt racist country artist scared of pronouns. XQC, TimTheTat, Ninja, Andrew Tate- they have horrible role models. Trump, Putin, Kim Jong-Un, the other dictators across the Middle East. They have support their own nationalist agenda - women being secondary, controlling people, Trump, etc.",
      "created_utc": 1746536983.0,
      "score": 4
    },
    {
      "id": "mqvncwg",
      "body": "As a person of GenX, I thought we had put a big distance behind us when it came to racist issues in my generation but our tolerance of the little hate speech out there, made a breeding ground for it.",
      "created_utc": 1746537021.0,
      "score": 4
    },
    {
      "id": "mqvrynk",
      "body": "They think it'a funny because it's edgy and dark humor:/",
      "created_utc": 1746538609.0,
      "score": 2
    },
    {
      "id": "mqvuxiv",
      "body": "Those who want to spread racism, cannot go on TV so they go on YT, I sra, FB and so on\n\nAlso probably some of them think they are funny",
      "created_utc": 1746539545.0,
      "score": 4
    },
    {
      "id": "mqxy70u",
      "body": "Its the internet + covid. The alt-right pipeline has existed for years now. I almost fell down it as a teenager. But I had friends and real life experiences that prevented me from falling. These kids had alot of their important years during Covid. The kids were isolated and alone with only the internet to entertain them. The kids fall into the pipeline and then when back at school, enough had the same thing happen that its normalized.\n\nImportant to note however that this is Gen-Z from around 2006 and after. The Gen-Z born from 1997 to 2005 like myself are mostly extremely left wing. We hold alot of socialist and communist views which just make the difference even more noticeable.",
      "created_utc": 1746561295.0,
      "score": 4
    },
    {
      "id": "mqussu5",
      "body": "'Cause these pos think that it's cool being racist. I fucking hate my generation.",
      "created_utc": 1746522548.0,
      "score": 7
    },
    {
      "id": "mquvzro",
      "body": "It’s definitely a mix of younger gen z and gen alpha. For me atleast a lot of older gen z basically don’t consume social media as much anymore, but because a lot of them made videos about how we shouldn’t be racist or homophobic etc. a lot of the younger generation felt restricted in how they act online.\n\nWith that they felt the need to “rebel.” I mean it’s not even the younger generation who feels this way, even adults and older gen z feels this way too. I remember one of the comments saying “we’re just tired of being politically correct” which doesn’t make sense. It gets a bit dicey too cause some people who felt this way would come out and be like “everybody is too woke” “my generation sucks” and eventually influence a good amount of people.",
      "created_utc": 1746524603.0,
      "score": 5
    },
    {
      "id": "mqwzh8q",
      "body": "The absurd amount of hate towards South Asians in particular is very disturbing",
      "created_utc": 1746551370.0,
      "score": 2
    },
    {
      "id": "mqxk6ib",
      "body": "I am black/white mixed and gen z, and seeing this stuff has been hurtful to me since childhood, and it continues to hurt as an adult.",
      "created_utc": 1746557250.0,
      "score": 2
    },
    {
      "id": "mqxt8el",
      "body": "Yes exactly, I see that girl on tiktok all the time and the people in her comments are agreeing with her. It’s so weird and digusting that people actually agree with that",
      "created_utc": 1746559876.0,
      "score": 2
    },
    {
      "id": "mqxw17i",
      "body": "yes!! my friends and i were just talking about the increase in casual racism on tiktok?? facebook comments have always been old people coded with judgmental/misogynistic/homophobic type comments, after Twitter got turned into X it started doing the same, now Twitter replies (X replies i guess??) are just as bad as the facebook comments while the facebook comments have gotten worse. \n\ntiktok was always a safe haven, somewhere i could say “okay finally people my age, they’ll get it” but like a month and a half ago i saw an asian chef teaching people how to make the most delicious mexican rice i’ve ever seen and someone in the comments responded “are you sure that’s the right kind of rice you should be cooking?” as a joke ?? \n\nabout a week later, someone posted a video about a celebrity or influencer who fumbled their career due to transphobic remarks and when someone commented that they stopped supporting that celebrity after finding out, someone else responded to their comment that said “if being transphobic is the only reason [celebrity name] is cancelled then i’m right there with her! 👍” and it had more likes than the original comment?? \n\nit’s so weird how the younger parts of my generation (Gen Z) and Gen Alpha seem to lean so much more conservative and close minded ?? it feels like i’m in an era where we need to start doing “don’t say gay” ads and have anti smoking commercials again",
      "created_utc": 1746560690.0,
      "score": 2
    },
    {
      "id": "mqycm8i",
      "body": "Take a look at what politicians are leading this country and what their views are. I think that has a big play in how much racism has risen in the newest generations.",
      "created_utc": 1746565361.0,
      "score": 2
    },
    {
      "id": "mqzzf1i",
      "body": "Facebook has gotten WILD the last year especially. I was in this group that was very \"People of Walmart\", just to LOL at that wild shit you see at Walmart sometimes and it quickly became VERY racist. Anytime the post involved POC the replies were \"Fascinating Behavior\" Jane Gooadall pics and slurs. Just open racism and if you called someone out on it you were a (insert r word). Awful fucking people.",
      "created_utc": 1746584850.0,
      "score": 2
    },
    {
      "id": "mr1up94",
      "body": "It’s not just technology. Gen z grew up in the trump era. All the racists suddenly we’re a lot louder. It’s not weird that kids then think that’s “normal”.",
      "created_utc": 1746619237.0,
      "score": 2
    },
    {
      "id": "mr21klx",
      "body": "Their parents are anti racist and they're rebelling. That's how the pendulum swings.",
      "created_utc": 1746621889.0,
      "score": 2
    },
    {
      "id": "mr24z1w",
      "body": "i heard there more and more young people turning conservative not sure what the exact root cause is but conservatism and racism often go hand in hand so im guessing thats why they are getting more racist",
      "created_utc": 1746623091.0,
      "score": 2
    },
    {
      "id": "mr38dos",
      "body": "Gen z?? I thought we were the most hyper aware generation of them all wth\nbut I do agree with some comments saying the edgy dark humor and memes normalized this shit and they're mostly to blame here",
      "created_utc": 1746635055.0,
      "score": 2
    },
    {
      "id": "mqvqyrh",
      "body": "Another thing I see normalised online is the hatred for indians in general",
      "created_utc": 1746538276.0,
      "score": 4
    },
    {
      "id": "mqvx68k",
      "body": "Not only racist, but every \"-ist\" you can think of\n\nI caught a train the other night and was so shocked at how many Gen Z are throwing around the r-slur, in public no less!\n\nI have Gen Z sisters and it's like something has exploded in the past year or two. It's like that age range has become nastier, more intolerant, bitter, and hateful. I pity them",
      "created_utc": 1746540251.0,
      "score": 4
    },
    {
      "id": "mqurdhh",
      "body": "I'm old gen Z (1997) and it's a real PITA.\nI do ask myself, what happened. I considered gen z to be rather social & accepting, denying -isms and stuff like that.\n\nBoy, was I wrong. Disappointed. It's frustrating to a core level.\n\nI'm glad I've got my social bubble with people that share the same values but I can't even take a bus or a train, without some - I guess - younger gen Z or older gen alpha (I worry for my son, at this point - however so far he seems to adapt my values, he's only 8 tho) just bashing the ever loving fuck out of anything/anyone that could be considered foreign.\n\nIt's a shame in a country that propagates being multi-cultural. We are, still, however I see that endangered if that trend to the right keeps on pulling.",
      "created_utc": 1746521618.0,
      "score": 6
    },
    {
      "id": "mqupifv",
      "body": "Social media and AI only giving one sided voice to their experience",
      "created_utc": 1746520395.0,
      "score": 3
    },
    {
      "id": "mqvpo7n",
      "body": "I feel like they're kind of removed from it, desensitized so they do or say things for shock value. Also the rise of right wing media in places like YT and TT. It will look like formal news, and then the streamer will sprinkle in some quick, biased, \"fact\" or opinion and move on quickly but the seed is planted so that the receiver is more receptive next time.",
      "created_utc": 1746537831.0,
      "score": 4
    },
    {
      "id": "mqw3h8w",
      "body": "Andrew Tate, Asmondgold (somehow), etc etc take your pick",
      "created_utc": 1746542164.0,
      "score": 3
    },
    {
      "id": "mqvnuzt",
      "body": "check out london and germany. wake up fkers 😂",
      "created_utc": 1746537199.0,
      "score": 8
    },
    {
      "id": "mqup94f",
      "body": "Idk I think sometimes its just a \"counter action\". Since millennials went all out \"cancel culture\", \"safe space\" and \"diversity\", some parts of gen is going to the other extreme cause they are sick of that and going the complete opposite direction.",
      "created_utc": 1746520219.0,
      "score": 4
    },
    {
      "id": "mquhs3n",
      "body": "I've not experienced this at all. If anything the younger generations have been more tolerant and accepting than any of the other generations I've interacted with online.",
      "created_utc": 1746515363.0,
      "score": 4
    },
    {
      "id": "mqvvj3d",
      "body": "From a Scandinavian perspective; there has been intense anti-white racism for the last ~20 - 30 years, being spread not only by people of color but also by white liberals, state institutions and most of all by media. Just lots of blaming white men for everything thats wrong, portraying white men as ugly, boring, evil and soulless and heavily pushing white women to date black men and have mulatto children. \n\nId say that more or less every single ad showing a couple that I see here in Sweden is portrayed by a black man and a white woman, majority of male models selling clothes and whatever for companies are black men, our national teams in Europe range from 20 - 90 % black despite the black population of each country being 0 - 5 % black. \n\nI think that most if not all european countries that has had a big influx of immigrants during the last decades also experienced how society changed for the worse due to it, largely due to islam spreading, crime increasing, corruption increasing, violence increasing, sexual assaults of our women increasing. \n\nWhen Trump won (and Musk bought X) the liberal media lost a part of its monopoly on the internet, and lots and lots of white people have had enough of constant humiliation and working to pay welfare for immigrants. There is heavy ethnic tensions in Europe between natives and arab/african immigrants.\n\nThese immigrants are showing lots of dominance behavior towards the native europeans, often talking about how they are fucking our women, being loud and aggressive in public, showing no respect for natives, demanding we adapt to their cultures and just behaving all around aggressively.",
      "created_utc": 1746539733.0,
      "score": 8
    },
    {
      "id": "mqve275",
      "body": "The new generations are more and more dumber and are more easily radicalised. Just my opinion.\n\nI also think generations will be shorter as time goes on. God help us all",
      "created_utc": 1746533501.0,
      "score": 4
    },
    {
      "id": "mqv8amf",
      "body": "covid and cancel culture started this bullshit and i’ll die on this hill",
      "created_utc": 1746531063.0,
      "score": 5
    },
    {
      "id": "mquu5am",
      "body": "Sadly, the POS, tRump, has not only normalized ignorance and racism, but encourages it among his cult followers. Miserable people like him want to bring everyone down to their level.",
      "created_utc": 1746523427.0,
      "score": 4
    },
    {
      "id": "mqv18k4",
      "body": "The rise of fascism is global and not bound by generation.",
      "created_utc": 1746527621.0,
      "score": 2
    },
    {
      "id": "mqvmcon",
      "body": "Go research social trends. Anecdotes can sound compelling but you cant use them as objective evidence of anything. You could just be echoing nonsense.",
      "created_utc": 1746536659.0,
      "score": 2
    },
    {
      "id": "mqvv0zv",
      "body": "For one, the racists from the previous generations never stopped teaching racism, they just taught their kids to hide it. In 2016 many people felt like they could come out and not feel like the bad guy for being racist. Also algorithms. It's so much easier to go down the racist rabbit hole now than it was before. Before, you had to already be racist to go down that hole. Imagine your algorithm being flooded with bigotry during the quarantine during important developmental years in your life. Many millennials (not all unfortunately) would break away from their parent's racist views and maybe call it out. Imagine if you're parents are also racist and you're influenced by your algorithm. You've got no chance at this point.",
      "created_utc": 1746539576.0,
      "score": 2
    },
    {
      "id": "mqwp7w5",
      "body": "There is something that really tickles me about genZ leaning conservative and becoming classist.  Conservatives tend to be impoverished, after all.  The term \"liberal elite\" is used for a damn good reason...",
      "created_utc": 1746548466.0,
      "score": 2
    },
    {
      "id": "mqwp81q",
      "body": "No counterculture whatsoever, that’s why. Every decade till the 2010s had some counterculture movement that was always anti-racist and these approaches gradually became more progressive. But the 2010s and 2020s where gen z like me grow up, we’re living in a world where social media dictates our standing and makes any kind of lifestyle “mainstream” in a way that pushes the desired agenda unto us. With the right wing extremism we see today, the agenda’s pretty obvious: huge example is elon musk",
      "created_utc": 1746548468.0,
      "score": 2
    },
    {
      "id": "mqwqwlk",
      "body": "Insecurity and echo chambers, really the gist of it",
      "created_utc": 1746548951.0,
      "score": 2
    },
    {
      "id": "mqv1x8i",
      "body": "Make racists afraid again. \n\nIf you see it, speak up and dog pile the dude. Don't actually jump him unless you can then go for it, but rip on him for how he has his own problems. Like how his mother or father were abused as kids so they direct their hate to the people who don't deserve it.",
      "created_utc": 1746527984.0,
      "score": 4
    },
    {
      "id": "mqv55bq",
      "body": "If you tell someone they’re raciest for years eventually they’ll give up and just own it.",
      "created_utc": 1746529597.0,
      "score": 5
    },
    {
      "id": "mqw0iie",
      "body": "I blame the home school/charter school movement.\n\nInstead of kids learning ideas that challenge the status quo, they began to mimic the crap their parent’s repeated.",
      "created_utc": 1746541271.0,
      "score": 1
    },
    {
      "id": "mqw299o",
      "body": "i don’t see a rise. it’s been like this",
      "created_utc": 1746541796.0,
      "score": 2
    },
    {
      "id": "mqugv5v",
      "body": "So basically the same level of racism as it always has been. ",
      "created_utc": 1746514788.0,
      "score": 2
    },
    {
      "id": "mqv2ktk",
      "body": "As a gen z from the Philippines this is quite new to me. Most if not all gen z here would not tolerate this. However, we did have a viral post some time ago (around 1-2 years back) wherein this boy who just graduated senior high posted a grad photo of himself wearing a Nazi costume and doing the Nazi salute. He got heavily bashed for it lol",
      "created_utc": 1746528324.0,
      "score": 1
    },
    {
      "id": "mqvf7wk",
      "body": "Well there are a lot of factors, but I would say the combination of algorithms feeding and reinforcing bias. People in general really struggle to properly weigh evidence in their minds. So when they feel like everywhere they look they get single datapoints confirming something they will believe it’s true, even if it contradicts logic and science.",
      "created_utc": 1746533967.0,
      "score": 1
    },
    {
      "id": "mqw4j4i",
      "body": "Professional journalism has been eroded by social media's influence.  The result, Idiocracy.",
      "created_utc": 1746542479.0,
      "score": 1
    },
    {
      "id": "mqw61sp",
      "body": "> Insane dog whistles for Jewish hate are all over the internet too.\n\nCould you link to an example?",
      "created_utc": 1746542928.0,
      "score": 1
    },
    {
      "id": "mqwbv1l",
      "body": "Racism will never leave. EVER. It may have been more passive for a few decades, but that doesn’t mean the sentiment ever left nor that it ever ceased being taught. Of course it’s more prevalent now everyone has a phone to record everything. There is just more visability  now. Just be diligent in being a person that isn’t if that’s not what you ascribe too.",
      "created_utc": 1746544594.0,
      "score": 1
    },
    {
      "id": "mqwkdkk",
      "body": "Access to historical records and Internet Rabbit Holes.",
      "created_utc": 1746547049.0,
      "score": 1
    },
    {
      "id": "mqwkq6c",
      "body": "Racism didn't rise as much as insulated communities popped up to breed terrorists. \n\nYou can point to an increase in antisemitic messages but you cannot, should not, will not see a Peyton Grendon situation. That community will not face a Sandra Bland situation, Tamir Rice situation, or a Jon White situation nor should they.\n\nWhile incidents are on the rise, extremist violence primarily targets one group in particular.",
      "created_utc": 1746547150.0,
      "score": 1
    },
    {
      "id": "mqwmnl6",
      "body": "Absolutely  the internet and the algorithm.\n\nCompounded by the political economic aspects going on for them and the lack of opportunities and economic power (never own a home cant even rent, etc) and the finger is pointed at other disenfranchised communities as to why it like this rather than the upper classes utilizing cheap labor(vulnerable people who will do what it takes to have some income, poverty stricken, easier to control).",
      "created_utc": 1746547716.0,
      "score": 1
    },
    {
      "id": "mqwt2z2",
      "body": "Many reasons imo\n\nOn social media like twitter you're more likely to engage with other people if your takes are \"hot\" which can mean a whole lot of things. No wonder people are more polarized and extremist by the day. Even if it's a meme, some people will take it seriously\n\nThis then leads to desensitization. People will blurt out increasingly insane posts for engagement\n\nRight wing propaganda on tiktok is pretty big here in brazil. And then it occasionaly leads to some weird rabbit holes with, once again, extremism",
      "created_utc": 1746549577.0,
      "score": 1
    },
    {
      "id": "mqwvvhs",
      "body": "I feel like the \"edgy memes\" kids from middle school split two ways: kids who were making fun of racist people, and kids who were repeating what they heard and taking it way too far until they knocked themselves into believing it.",
      "created_utc": 1746550359.0,
      "score": 1
    },
    {
      "id": "mqww1nl",
      "body": "Misinformation and propaganda rampant online and kids addicted to being online",
      "created_utc": 1746550406.0,
      "score": 1
    },
    {
      "id": "mqwwd6o",
      "body": "it’s not only that but I (as a gen z) noticed going all throughout school saying the “N word” has been almost completely normalized?? like you’d have Mexican Kids saying it, White Kids, Black kids, Literally any race just saying it and nobody cared?? but a few years beforehand if anyone not Black had said it they’d get beat up",
      "created_utc": 1746550495.0,
      "score": 1
    },
    {
      "id": "mqx02km",
      "body": "the internet. i’m lucky i have good critical thinking skills bc i fully went down an aliens rabbit hole on youtube when i was a young teenager and ended up in some freaky places. it was just for fun and i got out the second i ran into anti-Black and antisemitic overtones (i’m talking, white people come from godly holy aliens, but X ethnicity comes from Y animal/evil alien), but only really because i was a tumblr user and had been inoculated by years of reading antiracist blogs to KNOW that it was racism and KNOW it was wrong. if i didn’t know about the racism and antisemitism in conspiracy circles, and didn’t know that that’s a big red sign to stop, or i tried to keep my mind “open” to such possibilities, i could’ve fallen in too. and once your brain is all twisted up in conspiracy there’s kind of no going back without intervention, and you don’t know how it’ll impact your other views \n\ni also think cancel culture is part of it. the first time your favorite youtuber gets publicly ousted, you can probably shuffle back from it and try to learn. but the fourth time? the tenth? you might decide to choose the side of the canceled just to protect your own ego",
      "created_utc": 1746551535.0,
      "score": 1
    },
    {
      "id": "mqx3fqk",
      "body": "Social media - internet rabbit + Influencer are 100% to blame.",
      "created_utc": 1746552467.0,
      "score": 1
    },
    {
      "id": "mqx5cjr",
      "body": "Meme culture probably and especially if they have a gullible mind.  Maybe also the times. Media is not making it better. It feels like everyone hates everyone on the news.",
      "created_utc": 1746553006.0,
      "score": 1
    },
    {
      "id": "mqx860j",
      "body": "It's many different reasons. \n\n1. First, it has never been so easy to be racists as it is now. The Internet hides your identity, and you can say whatever to whoever and not get found out. And it's easier to find memes and such that are racist.  \n\n2. Trump\n\n3. Immigrants in Europe, especially germany and sweden there have been an extreme influx of Arabic and Somalian immigrants. Where they are statistically worse citizens than natives. And dont get me started on how some radical whats to change the country.",
      "created_utc": 1746553807.0,
      "score": 1
    },
    {
      "id": "mqxabfj",
      "body": "It’s not a rise in racism. Sadly, the racism has been there all along. It’s a rise in feeling free to speak it aloud because we have a President who wants it normalized again.",
      "created_utc": 1746554410.0,
      "score": 1
    },
    {
      "id": "mqxdo6d",
      "body": "Honestly I think it’s the rise of content creators like Andrew Tate etc who promote the racist, sexist views. Younger kids are impressionable, if they’ve been seeing that stuff on YouTube (or other social media) since they were young teens or potentially even younger, it’s going to mould their views into early adulthood. I really hope they’ll “grow out of it” but unfortunately I feel like the general public don’t do a great deal of critical thinking and just accept things at face value a lot of the time. It’s sad, honestly.",
      "created_utc": 1746555367.0,
      "score": 1
    },
    {
      "id": "mqxfe94",
      "body": "The extreme left and extreme right keep provoking each other into getting more and more extreme. Lots of overcorrections of overcorrections. Many gen-z are chronically online and feel a line has been drawn in the sand between whites and blacks. You're either for white power or black power. The extreme left believes a black republican is a race traitor and the extreme right believes a white democrat is a race traitor. They're both wrong and stupid and fostering a lot of evil in our country right now.",
      "created_utc": 1746555859.0,
      "score": 1
    },
    {
      "id": "mqxfl7s",
      "body": "Racists have more platforms these days and social media is helping them. As a gen-z, I can't count how many racist ideas/sayings I've heard over the years just from social media.",
      "created_utc": 1746555914.0,
      "score": 1
    },
    {
      "id": "mqxhs2e",
      "body": "It doesn’t take much dehumanizing in the zeitgeist to allow it to come out big time. Gen Z is probably less racist than previous generations overall but there doesn’t seem to be any great moral narrative of equality. Perhaps the closest progressive narrative arc is the understanding of trauma on human experience. The anti-woke insistence on individualism and narcissism and lack of empathy is the antithesis. A Freudian explanation would be coddling parents producing anal expulsive children.",
      "created_utc": 1746556550.0,
      "score": 1
    },
    {
      "id": "mqxmxa4",
      "body": "I mean, as a Millennial on the younger side myself....I can only speak to the experiences that made me who I am. In school we didnt use computers in the classroom or iPads or anything other than textbooks that we would have to read out of. The history there wasn't mixed in with the rest of the world online. The vocal online minority just wasn't present to skew our view of society in a positive or negative way.  There was a clear message in all those textbooks, and it was one of \"where we have been, and how not to make the same mistakes\".  Sometimes we would go to the computer lab or library to study things but it wasn't necessary or always the case, more or less special occasions. I used computers to go into chat rooms and play games, surf the net...whatever...however there wasn't a slew of political views the way there is today. There is so much that our younger GEN Z generation has been overexposed to in their younger formative years that has influenced their minds and thoughts. Whereas Millenials didn't truly have that exposure until they were older and were maybe not as easily influenced....and had maybe already solidified ideas of things in their head. It's why so many DEI and left or liberal ideologies are spearheaded by Millenials...most school systems were about changing us for the \"better\" future...to not see others as.....\"other\"...and how that had affected us as a society in a negative way. I went to school in 3 different states...there was never any difference in this ideology...however...kids and young adults were influenced greatly by who they came from...and you could tell so much easier. Im not sure...how everyone else's experience differs.",
      "created_utc": 1746558039.0,
      "score": 1
    },
    {
      "id": "mqxp8ps",
      "body": "I don’t blame Women for being afraid of Men. Doubt a Woman wants to be alone in a group of Men, Men do more crime to women than women do to women.\n\nSo why do y’all treat it differently when it comes to race?",
      "created_utc": 1746558714.0,
      "score": 1
    },
    {
      "id": "mqxq9h3",
      "body": "Part of it are people wanting to be edgy thinking it’s funny and cool for attention. Not caring = cool apparently, so it’s “cool” to not care \nwhat people think about what you say.\n\nIt’s hard to tell how much of it is genuine and how much of it is just edgy attention seekers.",
      "created_utc": 1746559013.0,
      "score": 1
    },
    {
      "id": "mqxsq6t",
      "body": "REAL, blatant and plain racism disguised as \"dark humour\" got my classmates now, including the guy I like. He thinks It's cool to insult me and call me the n-word when I try to talk to him while i'm not even black and he's as white as milk",
      "created_utc": 1746559728.0,
      "score": 1
    },
    {
      "id": "mqxvhns",
      "body": "Social media Algorithms actively reinforce bigotry",
      "created_utc": 1746560539.0,
      "score": 1
    },
    {
      "id": "mqxwl5w",
      "body": "Hate is more popular than love. Until that flip flops, we are all doomed.",
      "created_utc": 1746560844.0,
      "score": 1
    },
    {
      "id": "mqxyyht",
      "body": "Narcissistic sociopaths pushing an agenda.",
      "created_utc": 1746561511.0,
      "score": 1
    },
    {
      "id": "mqy2klf",
      "body": "I think a lot though not all is due to the rise if social media. The jerks have an easier time finding each other. \n\nI also suspect some of it if not a lot has to do with the generations who lived and fought in in WWII are gone. Concentration camp survivors are gone. Participants and founders of the civil rights movement are gone. People are no longer exposed to those who lived through and fought against racism and genocide. Because people are no longer hearing directly from those who went through that, it’s become a much more abstract concept. \n\nNow we have openly racist politicians. Because these people get elected, people think racism is normal and acceptable. It used to be that verbalizing your racism used to make you a target. Now it can attract people to vote for you. \n\nAt least in the US, there have always been racists and white supremacists. There are many towns and states that were sundowner towns where people would be beat up or lynched, or jailed in trumped up charges if they dared do more than pass through certain areas. There a racist militias that haven’t been shut down. I am specifically thinking of the Proud Boys. The Ku Klux Klan hid their identities. The Proud Boys give public speeches, speak in public and have a large online presence. \n\nPeople can be really dumb and don’t think critically, don’t think for themselves. If someone around them has convictions and can offer anything appealing, people will go along with it. The concepts of being powerful and part of a group can intoxicate people.",
      "created_utc": 1746562545.0,
      "score": 1
    },
    {
      "id": "mqy4umq",
      "body": "To much time spent on the internet.",
      "created_utc": 1746563173.0,
      "score": 1
    },
    {
      "id": "mqy85uk",
      "body": "Every generation wants to rebel against the previous. Millenials were aggressively anti-racist but we're no longer counter-culture, we are the culture. Young people want to be counter-culture and thusly they'll take the opposite stance of millenials as a way to rage against the machine until like us they become the machine. Either they'll change the system to fit what they're saying now or, much more likely, fade into what it already is and that attitude will fade away.",
      "created_utc": 1746564113.0,
      "score": 1
    },
    {
      "id": "mqya96z",
      "body": "Gen Z is full of radicalization of both sides. Where we see a lot of racism we see also the aggressiveness of calling out those same people. Though unfortunately it is the same as in the older generation to where the bigots are always louder and prouder and that’s because no one taught them to be afraid in any gen. We let people get away with things for too long and now this is the mess that was created. Not to mention hate gets more views, it’s more outlandish, rage bait works. So anything else gets suppressed as well so it’s a double downer on anything that tries to combat racism and anything else negative.",
      "created_utc": 1746564703.0,
      "score": 1
    },
    {
      "id": "mqyda46",
      "body": "They’re not my kids. There must be gen x parents out there that have let me down",
      "created_utc": 1746565558.0,
      "score": 1
    },
    {
      "id": "mqydb41",
      "body": "my own theory is that the people that are super far left have turned the newer generations away from being progressive",
      "created_utc": 1746565566.0,
      "score": 1
    },
    {
      "id": "mqyey65",
      "body": "I think it’s probably attributable to a lot of things, and a large slice of those things are specifically rooted to the fact that GenZ are (mostly) the first generation that was chronically online since birth. \n\n1. Less face-to-face time and social training means less negative feedback. When you actually get most of your socializing in online spaces, there’s no threat of direct and perhaps violent correction when you step outside the bounds of what’s acceptable to the “average” person. You get no moment of being ostracized, you get no moment of being punched in the mouth with no one to back you up. All that happens is you either get blocked and continue on your way, or you move on and find another thread where people agree with you. \n\n2. Online extremists are now easier to find and interact with. Growing up, I also had “bad” media to influence me (e.g. late night Comedy Central, SpikeTV) but those sources had to balance commercial interests with being approved for broadcast through a larger company. There was always money in appealing to extremist, but when you had a public-facing company to work through, the juice isn’t worth the squeeze. When you move the content, and everyone in the audience, online, then it becomes a lot more profitable and easy to make cash pushing content that appeals to the actual lowest common denominator.\n\n3. Regrettably, I think liberal media did fail in casting any sort of net to the cishet white guy crowd. The background assumption has always been that that these people feel they belong everywhere, so we’ll specifically message to everyone else and then we’ll have a nice cohesive group. Unfortunately, a lot of that messaging and a lot of the culture that came up around revolved at least partially around the idea that being in those groups was a “bad” thing, or at least not a thing to be proud of. Understandably, that lead to a popular judgement that liberals were more unfriendly to you the more straight, white, and cis man you were. When that happens, you make enemies, and when you make enemies, the other side picks them up pretty easily. When those people the other side has picked up already happen to be the ones who take up most of the cultural space, then you have problems.",
      "created_utc": 1746566048.0,
      "score": 1
    },
    {
      "id": "mqyi5u5",
      "body": "ever since trump was elected, I've noticed the country has been shifting to the right ever so slowly",
      "created_utc": 1746567003.0,
      "score": 1
    },
    {
      "id": "mqyjy43",
      "body": "Society as a whole is nowhere near as racist is it ever has been. Most people making those jokes are not actually racist, but find humor and enjoyment in the shock factor. Most black people I know go along with the stereotypical jokes, because they are pretty funny if not pushed to the limit. I come from middle eastern descent and I have experienced all throughout my highschool experience being called a terrorist and I really don’t get offended at all, and I thought the jokes were pretty funny (until they got old) . Racism is hatred, and it should stop where it causes people to not be included, harmed (physically or mentally), and disadvantaged. There is still true racism, but I don’t believe Gen Z is becoming progressively more racist",
      "created_utc": 1746567541.0,
      "score": 1
    },
    {
      "id": "mqyo88h",
      "body": "We do tend to fail to learn from history. History doesn't have the same impact once the living survivors are gone. WWII generation is gone and now we have people openly reappraising Hitler.",
      "created_utc": 1746568804.0,
      "score": 1
    },
    {
      "id": "mqyocoy",
      "body": "Has Gen Z really been taught anything other than to draw a line in the sand and dehumanize dissident voices? Thought policing has its side effects and radicalization on both sides is one of them. It's gonna take forever to undo the damage.",
      "created_utc": 1746568842.0,
      "score": 1
    },
    {
      "id": "mqyqfq2",
      "body": "I think some of it has to do also with them just being dumber in general. Being able to conduct critical thinking seems to be a skill possessed by 1/5000. So I think this, along with then asking their god chat gpt for everything, possibly the pandemic, and their ample internet content which a few other comments explained very well - all these things contribute to them being a stupid population. A percentage of them might see the light, but it will be small, and come with age (possibly). Lack of critical thinking > not understanding nuance, empathy > these will be scary people when they reach adulthood and places of power",
      "created_utc": 1746569498.0,
      "score": 1
    },
    {
      "id": "mqys178",
      "body": "Question: do you think it's racist if an Indian woman or man immigrates to a western country but will only date other Indians? Or even won't date but returns to India to marry the person chosen by their parents? This is very common in many Asian countries, not just India. This is also spoken very.... bluntly.... among many black cultures, especially in the US. ",
      "created_utc": 1746570011.0,
      "score": 1
    },
    {
      "id": "mqyui0g",
      "body": "As a member of Gen Z, unfortunately it appears that we are witnessing “the boomerification of Gen Z” (idk who came up with that phrase but I feel like it very accurately describes a common phenomenon in our generation)",
      "created_utc": 1746570826.0,
      "score": 1
    },
    {
      "id": "mqyvugx",
      "body": "Honestly I feel crazy seeing it so casually everywhere too. Like there’s nothing we can do. I thought the majority of us agreed with each other but I think a lot of people definitely have had these racist ideals ingrained into them from young ages. There’s some who don’t see anything wrong with racism bc they saw it in their parents (parents who they idolized or felt they needed to listen to all the time). (And there are others who thankfully saw that it’s wrong/disgusting)",
      "created_utc": 1746571273.0,
      "score": 1
    },
    {
      "id": "mqyw2o7",
      "body": "Kids are stupid, and we created a safe space for saying hateful things as long as you say it’s a joke or “social experiment” afterwards.",
      "created_utc": 1746571348.0,
      "score": 1
    },
    {
      "id": "mqyydbl",
      "body": "Its not just racism, its also homophobia and other things. Im gen z too, and im horrified to see this. We were so accepting in like 2020 and we keep on going backwards ever since. Its sad to see such open minded people change into racist robots.",
      "created_utc": 1746572100.0,
      "score": 1
    },
    {
      "id": "mqyyu3u",
      "body": "Gen zer here, I hate my generation mainly because of that so if anyone would like to switch generations with me I'll be happy to switch in a heartbeat.",
      "created_utc": 1746572253.0,
      "score": 1
    },
    {
      "id": "mqz1t4m",
      "body": "A lot are also super homophobic/transphobic and just generally ignorant af. It's odd too because I feel like we were headed in such a idk open direction for a while there. Now there's a big resurgence of trad-wife/life stuff in my specific age group. It's confusing too because most of the ones going towards that were definitely NOT that growing up.",
      "created_utc": 1746573234.0,
      "score": 1
    },
    {
      "id": "mqz3k0h",
      "body": "When injustice gets overlooked for money or loyalty and natural law gets punished for correcting hostile action that the laws of man will not correct. The people will take the path of least resistance and become terrible people and will thrive in a system designed where good people will feel bad for \"taking advantage\" of resources while the terrible will exploit everything and more",
      "created_utc": 1746573815.0,
      "score": 1
    },
    {
      "id": "mqz4fx7",
      "body": "Normalised because of “dark humour”",
      "created_utc": 1746574109.0,
      "score": 1
    },
    {
      "id": "mqz69p4",
      "body": "Thought this today",
      "created_utc": 1746574721.0,
      "score": 1
    },
    {
      "id": "mqzbw6b",
      "body": "Fucking what?! I’m gen Z and the only racism I’m finding is what my dad says and other stupid high school kids.",
      "created_utc": 1746576644.0,
      "score": 1
    },
    {
      "id": "mqzcoo0",
      "body": "you see how it’s all online right? just kids being dickheads because they can get away with it. none of them would dare say sumn in public",
      "created_utc": 1746576920.0,
      "score": 1
    },
    {
      "id": "mqzdajh",
      "body": "Kanye is probably the culprit rn ngl",
      "created_utc": 1746577136.0,
      "score": 1
    },
    {
      "id": "mqzgh33",
      "body": "They are stupid kids influenced by the internet save misinformation far too much.",
      "created_utc": 1746578269.0,
      "score": 1
    },
    {
      "id": "mqzj4n7",
      "body": "It's niche to them brings out attention",
      "created_utc": 1746579205.0,
      "score": 1
    },
    {
      "id": "mqzktl7",
      "body": "History repeating itself again.",
      "created_utc": 1746579806.0,
      "score": 1
    },
    {
      "id": "mqzpn01",
      "body": "They were raised by racists and cannot think for themselves",
      "created_utc": 1746581521.0,
      "score": 1
    },
    {
      "id": "mqzu8pw",
      "body": "They’re watching stupid YouTubers that spout racist conspiracy theories and political ideas and they believe it without doing any other research into it.",
      "created_utc": 1746583053.0,
      "score": 1
    },
    {
      "id": "mqzz3jt",
      "body": "Mostly targeted social media and the shitty religious racists are having more kids than the rest of us.",
      "created_utc": 1746584737.0,
      "score": 1
    },
    {
      "id": "mr032cr",
      "body": "It's getting bad with racism. Just this year I was sent more death threats than I could count simply for existing as a black person. Day by day it gets more normalized, and nobody does anything about it.",
      "created_utc": 1746586177.0,
      "score": 1
    },
    {
      "id": "mr0bfjv",
      "body": "Remember everything you see online is not everything that is happening. Gen Z is also the most racially diverse generation",
      "created_utc": 1746589494.0,
      "score": 1
    },
    {
      "id": "mr0cvbi",
      "body": "Honestly it’s all the internet everyone is being made to think they are the victim and everythig. I live in Montana and I’m still a kid but every kid here is just blatantly racist at least at my school (it’s because there are no black people here and even the ones that are here don’t give a crap)",
      "created_utc": 1746590098.0,
      "score": 1
    },
    {
      "id": "mr0hmk5",
      "body": "they’ve always been racist but now we have an administration that encourages it and the racists feel safe to show their true colors",
      "created_utc": 1746592168.0,
      "score": 1
    },
    {
      "id": "mr0l65t",
      "body": "\n\nI think we're just about as racist as any other generation. If anything maybe we're less bad on the account that I don't hear gen-z joining the clan. The issue is that the internet kinda makes us all sorts of extreme. Especially since no matter what you are, you will find a group to justify you. Then social media caters to your interests and helps you link up with groups you normally wouldn't get close to. ",
      "created_utc": 1746593875.0,
      "score": 1
    },
    {
      "id": "mr0mdr2",
      "body": "So tbh I think it has a lot to do with people feeling disenfranchised especially men and so they fall down these echo chambers and get lost in the sauce but tbh it’s only a loud minority of people if you go outside more a lot more people are more chill than you think i think the internet just allows people to give out their dog shit opinions in full display idk I might be biased since I live in a blue state and most of the people in my city are either democrats or immigrants or liberals and it’s pretty chill for the most part",
      "created_utc": 1746594482.0,
      "score": 1
    },
    {
      "id": "mr0qj24",
      "body": "Lately I've been seeing people say race mixing has ruined the culture and alot of aggressive posts against mixed people. It makes me scared and all my friends think I'm overreacting.",
      "created_utc": 1746596660.0,
      "score": 1
    },
    {
      "id": "mr0s7i0",
      "body": "Is it? I feel like it's gen z that are trying really hard to break racism. There's more mixed race relationships nowadays, starting from millennial/Z as I observed",
      "created_utc": 1746597584.0,
      "score": 1
    },
    {
      "id": "mr0twxq",
      "body": "Because we live in a shitty time, economically first of all. Whenever you have poor people who hate their jobs and life and are also uneducated (all of these things go hand in hand) you will unfortunately get racism/conservatism etc. They need \"someone\" who they need to direct their hate towards, politicians really do make use of that and use it for their points and direct the hate towards other nations and migrants or whatever so ppl wouldn't direct their anger towards them. And then it just becomes a trend which with social networks and media is really easy... it's textbook political propaganda",
      "created_utc": 1746598545.0,
      "score": 1
    },
    {
      "id": "mr0veyw",
      "body": "Racists raise their children to be racist so it's a cycle that won't be ending anytime soon. It's just that it's more documented now because of the internet, but it has always been this bad.",
      "created_utc": 1746599414.0,
      "score": 1
    },
    {
      "id": "mr0xr86",
      "body": "My little brother keeps asking me if I care that I’m lighter than all of our siblings (we’re all mixed with half black). He’s 13 and I’m 24 and I’m just so lost as to how that crap should even matter 😭",
      "created_utc": 1746600787.0,
      "score": 1
    },
    {
      "id": "mr12fil",
      "body": "unfortunately, as a gen z with a younger gen z brother..it’s definitely becoming a thing. he’s made lots of n@zi jokes and anti semetic jokes and i’m beginning to question the people he hangs around and if this is just a phase..he’s 16 and im just so confused..\ni had my “edgy” phase when i was like 12, i didn’t understand the meaning of certain words and threw them around loosely..once i found out a year later, i stopped saying those words and realized my wrong doing. but no matter how much i explain, it doesn’t stick with him..my parents are also confused why he’s acting this way",
      "created_utc": 1746603656.0,
      "score": 1
    },
    {
      "id": "mr14enl",
      "body": "They’re dumb and pathetic",
      "created_utc": 1746604886.0,
      "score": 1
    },
    {
      "id": "mr14f5i",
      "body": "I think generally everyone is way more radicalised nowadays. Also social media is designed to push more radical views now than ever. Likely more than anything, the social media platforms you're using are pushing you more radical views now too.\n\nIn pushing more radical views you also start to believe that there are only radical views, so it seems like more of gen-z is racist, but in reality it is more that social media algorithms push more racism.",
      "created_utc": 1746604894.0,
      "score": 1
    },
    {
      "id": "mr15hcf",
      "body": "Just two hours ago I saw a facebook profile of an indian teen with nazi symbols everywhere and a selfie which showed his swastika phone case, I think people think they can be racist with their own race or with other races thinking they are better, it's crazy to see how delusional people are",
      "created_utc": 1746605571.0,
      "score": 1
    },
    {
      "id": "mr199pk",
      "body": "It is about the environment/political period they are growing up in. As a millennial, the big message was love everyone. Basically, don't be racist. Now the message is you aren't American if you're not racist. It is a messed up time.",
      "created_utc": 1746608026.0,
      "score": 1
    },
    {
      "id": "mr1cmlo",
      "body": "I blame social media and the algorithm. They show you things you seemed interested in. If you watch one of those “Save Europe” insta posts it’s going to be everywhere. It makes you believe society is a specific way. And they portray a completely warped picture of society. \n\nId even go as far as saying Social media and the algorithm is somewhat capable of hypnosis and imprinting ideas into minds. Especially to younger audiences who now get access to social media easily. I’m not saying someone is trying mind control people, but that someone can be directed into a specific extremist ideology, regardless of left and right wing. I noticed this on myself too.\n\nSomething I noticed is the rise of ragebaiting too. They state a completely racist thing and you interact with the post, and the algorithm recognizes your interest and will Continue showing you similar posts. And at some point you may end up believing what you hear countless of times, even if they are supposed to be memes or jokes. But maybe I sound like a conspiracy theorist now.",
      "created_utc": 1746610169.0,
      "score": 1
    },
    {
      "id": "mr2cvie",
      "body": "There was a research which got popular last year. In a lot of countries, gen z women tend to become more liberal and gen z men tend to become more conservative",
      "created_utc": 1746625737.0,
      "score": 1
    },
    {
      "id": "mr2nyeu",
      "body": "I don't think it's always the kids' faults. obviously a few of them are assholes on their own. but a lot of it is older creators and influencers. they make things like racism and misogyny funny and cool, and kids want to be funny and cool, so a lot of them copy. then they get introduced to ideas and it spirals from there.\n\nthey're being poisoned and I hate when people act as if they're entirely to blame and should just be seen as hopeless and stupid. they're navigating the world for the first time and still growing. it's up to parents, guardians, mentors, etc to set good examples and *tell them when they're out of line*, not encourage it, without making the kid feel like they're being treated as stupid. condescension doesn't work. talking it through does.\n\nwe also need to focus on being kinder. I'm being dead serious. I know cynicism is cool and whatnot but I think we need to be nicer to one another, especially on the internet. everything you post, someone with fresh eyes could be learning from.\n\nprobably doesn't help that the world feels more and more unstable and people are desperate to group together. which makes gen z a prime target for racists because they prey on that loneliness and confusion. and it's not because the kids are less intelligent. it's because racists are awful and manipulative.",
      "created_utc": 1746629126.0,
      "score": 1
    },
    {
      "id": "mr2pv8q",
      "body": "Seriously, every other post on instagram and TikTok are straight race wars. It started as immature jokes/memes but now people are taking it seriously.",
      "created_utc": 1746629689.0,
      "score": 1
    },
    {
      "id": "mr3md16",
      "body": "I'd personally blame the gamergate crowd for a decent chunk of it. I fell into the rabbit hole along with a solid half of my peers with the old \"feminists wrecked\" type of videos when I was in middle school. I'm grateful that I and a few of my friends snapped out of the hatred around high school, but around a third of my peers only went deeper into the rabbit hole.",
      "created_utc": 1746639055.0,
      "score": 1
    },
    {
      "id": "mr3tm6y",
      "body": "There's a bunch of spheres people are getting caught up in. Everybody feels down on their luck and they can feel the pressure and just like in Nazi Germany, it's a lot easier to feel like other people are somehow your problem and so I think this is just how all these things start with what appears to be light racism or sexism or otherism of any kind. \n\nIf you give people permission to believe that their suffering is someone else's fault or doing, then it makes it a little less painful and you don't have to take accountability or just admit that life is hard and that it sucks. It gives you an idea that you're not actually weak it's that you're being held down. That your life would be a lot better if only this other thing wasn't there trampling all over you.",
      "created_utc": 1746641089.0,
      "score": 1
    },
    {
      "id": "mr4q7vo",
      "body": "As a gen z, it’s entirely social media. Memes are often racially based. I remember being in middle/high school and a lot of popular youtubers and influencers were horribly racist, homophobic and all that jazz. Filthyfrank, pewdiepie, the popularity of “cringe compilations” of people just enjoying life. Being racist was peak comedy in the 2010s and most of us didnt grow out of it to realize how fucked it all was\n\nI think a lot of people also act and say things outlandish because anyone can be recording anyone at any time, and a lot of viral videos are of people unaware they are being recorded. \n\nAnd having the president be an openly racist asshole gave a lot of people more courage.",
      "created_utc": 1746650487.0,
      "score": 1
    },
    {
      "id": "mr4ttbf",
      "body": "Racism is acceptable now! Racists are no longer shunned and shamed. They can hold positions of power in the government again.",
      "created_utc": 1746651493.0,
      "score": 1
    },
    {
      "id": "mr4xisu",
      "body": ">\"if you don't agree with me don't reply\"\n\nWhy did you even post this thread then? Just punch your question into an AI if all you want is slavish agreement.",
      "created_utc": 1746652561.0,
      "score": 1
    },
    {
      "id": "mr5lqfa",
      "body": "I am curious if it actually IS a growing percent; or if we are seeing a combination of the REACTIONS, for and against, and visibilty magnifying a loud minority. That segment has always existed, but now does not hide. And backlash is simply folded into the same numbers.\nJudging how anti-anti-DEI pushback is affecting companies and schools, and how many exposed racist businesses suffer, it is curious if we are just seeing it more because they cannot hide.",
      "created_utc": 1746660477.0,
      "score": 1
    },
    {
      "id": "mr5o0ol",
      "body": "Pattern recognition was frowned upon for millennials",
      "created_utc": 1746661242.0,
      "score": 1
    },
    {
      "id": "mr5v7se",
      "body": "I see it in my 4th graders . I'm a white female and idk how to handle it half the time... I'm also a young, new teacher for context.",
      "created_utc": 1746663777.0,
      "score": 1
    },
    {
      "id": "mr8fvem",
      "body": "It's fucked. I have friends who have migrated to Germany from latam and are voting for the ultra right parties even tho they migrated themselves. It's the algorithms just making people turn against eachother",
      "created_utc": 1746707460.0,
      "score": 1
    },
    {
      "id": "mr9rxgy",
      "body": "I believe some of the blame can be from the \"changes\" for history lessons. They want to teach the the country was full of \"good guys\" and not let students learn the bloody history behind the wins, because showing how ruthless the country was in the past \"promotes disloyalty to the country.\" \nCommon sense is gone.... sadly I don't see it coming back anytime soon. ",
      "created_utc": 1746722397.0,
      "score": 1
    },
    {
      "id": "mregqa8",
      "body": "It’s social media. When you consume media and it can convert you in less than a minute and you consume multiples of that daily for a day or month, just imagine what you can do.\n\nAnd then you have politicians who feed into the narrative. It’s legit a circle.",
      "created_utc": 1746789709.0,
      "score": 1
    },
    {
      "id": "mrk1t7t",
      "body": "It’s honestly so exhausting and depressing, going on Twitter is DIABOLICAL, on match, a Black Husband posted his Black Wife getting matched for anesthesiology. The comments were BADDD with one saying they wouldn’t trust cause she’s black and the other saying she only got it due to DEI.  That girl who said that apparently is house arrest for threatening  to you know what to her school ",
      "created_utc": 1746864231.0,
      "score": 1
    },
    {
      "id": "mrkmi5v",
      "body": "Retaliation, most of y all think that just white people are racist...",
      "created_utc": 1746876486.0,
      "score": 1
    },
    {
      "id": "mropb8t",
      "body": "It has to be rare.  Those people are nuts. Genuine friends that make you happy are rare.  People can’t afford to be picky about race.",
      "created_utc": 1746929561.0,
      "score": 1
    },
    {
      "id": "mrozowo",
      "body": "Are your sure they're really racist or just trolling? Trolling is almost a full time job for some people. ",
      "created_utc": 1746933898.0,
      "score": 1
    },
    {
      "id": "mrpfurl",
      "body": " Same also the racism towards indians so normalized it's so annoying ",
      "created_utc": 1746941756.0,
      "score": 1
    },
    {
      "id": "mrpqpl3",
      "body": "The world was violently pushed to the left, now that’s the answer",
      "created_utc": 1746948148.0,
      "score": 1
    },
    {
      "id": "mrqp8v9",
      "body": "It’s media I’m not surprised about anything from Gen Z",
      "created_utc": 1746967771.0,
      "score": 1
    },
    {
      "id": "mrx3de7",
      "body": "Brain rot",
      "created_utc": 1747060323.0,
      "score": 1
    },
    {
      "id": "mryioc8",
      "body": "Well I think being exposed to echo chambers of people sharing the same opinion pushes people to further extremes of their existing opinions.\n\n\nSo while there may be more extreme hateful people, there are also more people who are empathetic and caring.\n\n\nEven if the Overton window hasn't necessarily moved much, it feels like there are more people sitting outside of the window of what is considered \"normal\" and uncontested to believe.",
      "created_utc": 1747075395.0,
      "score": 1
    },
    {
      "id": "mrzn6je",
      "body": "i think a lot of it is because of these rabbit holes, I'm a gen zr myself, i almost fell down a far right rabbit hole when i was younger. people like andrew tate, sneako, any extremist political content creator, etc, are ruining children's minds, and I wish parents would monitor what their kids are watching online. \n\nI also think some of it is because of parents trying to instill an extremist view into their children, my extremist conservative mother tried to \"teach\" me (convert) to view certain demographics of people as lesser, especially when she would have a full freak out when i dated anyone non white. \n\nmemes can also be an issue, i dont think they're as large as rabbit holes but a lot of memes are insensitive and making light of situations that aren't supposed to be funny or agreeable, and for someone who sees these things and intakes most of their information through this mean, it will definitely be an issue into developing minds.\n\nif you think gen z is bad, wait till gen alpha gets old enough to voice their opinion, my little sister is 10 now and she's got some extremely racist views, and she's only TEN. not only did gen alpha have more time to be exposed to this bad behaviour (most gen alpha kids are ipad kids, legit given an ipad or phone before 5, i got my first phone at 11 and it was a flip phone) but the content they could possibly be consuming is a LOT worse nowadays",
      "created_utc": 1747087753.0,
      "score": 1
    },
    {
      "id": "ms1vrm8",
      "body": "The George Floyd memes, YNs, etc etc. I just want to bury my head.",
      "created_utc": 1747119744.0,
      "score": 1
    },
    {
      "id": "ms2at07",
      "body": "There isn't a rise.\n\nCurrent events have made a disgusting minority feel bold enough to be obnoxiously racist.\n\nThe majority are normal people and don't think or behave this way.",
      "created_utc": 1747129100.0,
      "score": 1
    },
    {
      "id": "ms5be49",
      "body": "Nothing new. It was that way during the mid 2010s and the intrusiveness of smartphones and the internet just makes it seem more apparent.",
      "created_utc": 1747165548.0,
      "score": 1
    },
    {
      "id": "ms6f93a",
      "body": "In my opinion, there is a rise in racism everywhere. Not just North america. In the past, it was more hidden and slight. Now, it feels like every bigot and racist are more free with their words and actions. It's not just race. Religion and cultural superiority are being used. Hate is on the rise. Economy is falling. People are going to pop. Push back and keep that ember of hope burning, before the light ebbs away.",
      "created_utc": 1747177951.0,
      "score": 1
    },
    {
      "id": "msilya0",
      "body": "The pendulum swings back and forth, progress isn't a straight line. Also any time either \"side\" starts to pull a little ahead, they always go apeshit and piss the center off. The right will do it soon enough.",
      "created_utc": 1747342897.0,
      "score": 1
    },
    {
      "id": "mqv0oo2",
      "body": "I'm pretty sure that this is simply the consequence of libleft talking points dominating and dictating the social discourse and politics for the past decades, \n\nPeople getting put down for being cis, white and/or male, \n\nGetting drowned in hatred and buzzwords for not 100% complying with those ridiculous, increasingly unhinged positions, \n\nbeing told that we're at fault for everything and some asshole shooting and stabbing people gets protected by the government because he's soo oppressed and misunderstood \n\nWe are always expected to bring empathy, tolerance and understanding for those who actively work on our downfall \n\nThere's a hundred more reasons, people are fed up and the pendelum is swinging back",
      "created_utc": 1746527322.0,
      "score": -18
    },
    {
      "id": "mqvn9mq",
      "body": "I think this is the answer more than anything else. These kids were raised by YouTube where the algorithm is based on engagement alone and has been shown to suggest more and more controversial videos the longer someone watches (the rabbit hole). \n\nRacist, sexist idiots are getting to speak directly to Gen z and Gen alpha without context or contradiction. Often parents don't know it's even happening",
      "created_utc": 1746536989.0,
      "score": 855
    },
    {
      "id": "mqwn044",
      "body": "This and propaganda and fear mongering around election times, it's unfortunately the same in every country btw",
      "created_utc": 1746547819.0,
      "score": 31
    },
    {
      "id": "mr1wexw",
      "body": "this but racism is socially acceptable even between minorities on social media",
      "created_utc": 1746619930.0,
      "score": 2
    },
    {
      "id": "mrb10cb",
      "body": "There used to be 1 village idiot per town, but now the idiots have an Internet forum to coagulate and think they are a force.",
      "created_utc": 1746735558.0,
      "score": 1
    },
    {
      "id": "mqwzw05",
      "body": "Exactly this. People don't understand how much meme culture influences kids at first it's just a joke until it turns into just blatant racism out of habit",
      "created_utc": 1746551485.0,
      "score": 354
    },
    {
      "id": "mqvv0ic",
      "body": "Your profile picture tho 😭",
      "created_utc": 1746539572.0,
      "score": 204
    },
    {
      "id": "mqxzj8w",
      "body": "The pyramid of hatred and the pyramid of racism. It starts out as jokes but almost always works its way up to something much more sinister",
      "created_utc": 1746561675.0,
      "score": 28
    },
    {
      "id": "mqyn5ng",
      "body": "Yeah this is why jokes are a slippery slope to me. I hate being the buzzkill but when people are too comfortable making certain kinds of jokes, I start to wonder about them.",
      "created_utc": 1746568479.0,
      "score": 14
    },
    {
      "id": "mr2mgb7",
      "body": "we all joke about \"memes the dna of the soul\" but it's actually correct, jokes are built on ideas and ideas can be easily reinforced. making people happy by laughing or enjoying something is a very easy way to indoctrinate them.",
      "created_utc": 1746628680.0,
      "score": 3
    },
    {
      "id": "mqxgyax",
      "body": "You ever wonder if they'll censor memes and brainrot content like how they do with dark web content? At least put it behind that part of the web?",
      "created_utc": 1746556307.0,
      "score": 13
    },
    {
      "id": "mrlz3if",
      "body": "UHF username",
      "created_utc": 1746894377.0,
      "score": 2
    },
    {
      "id": "mr9xicc",
      "body": "My ex's change started with him listening to \"funny\" shows all night when he worked the night shift. Then the Hillary jokes became less and less \"funny,\" and were more overt, weirdly saying she was a weak and stupid for staying with Bill after all the mess became public, but also somehow responsible for the breakdaown of the family, like Bro, WHAT? Then  the gay jokes, and then the race jokes but it wasn't serious and I need to \"relax,, it isn't cruel because he's just joking,\" until he wasn't and it was really bad because he's a cop. The steep decline from there was breathtaking to behold.",
      "created_utc": 1746724003.0,
      "score": 1
    },
    {
      "id": "mqv5zfj",
      "body": "Technology which only provides tailored content and reinforces negative emotions",
      "created_utc": 1746529994.0,
      "score": 461
    },
    {
      "id": "mqv6xw2",
      "body": "We've perfected algorithms for mental manipulation. All the young folks are still impressionable. We used to only use this to sell products with advertisements, but the new product is power. Without any safeguards and defenses like critical thinking, they're going to be swept away by the shiny convincing people on their phones. Those that want power have the easiest tools to grasp it now.",
      "created_utc": 1746530440.0,
      "score": 109
    },
    {
      "id": "mqv7ink",
      "body": "Because 20 years ago youd be afraid to be shot or stabbed talking shit to people.\n\nThe combination of omnipresent camera safety and internet anonymity has led to a generation of adults who are both terminally online, and desensitized to casual cruelty.",
      "created_utc": 1746530709.0,
      "score": 219
    },
    {
      "id": "mquine0",
      "body": "100% agree",
      "created_utc": 1746515919.0,
      "score": 119
    },
    {
      "id": "mqvd1p4",
      "body": "Media literarcy, history, politcal sciences need to be taught more.\n\nI'm not from the US, and my daughter already is an adult, but when she was still in school I felt those were all things on the curriculum, but with not enough time for it. \n\nThose short format videos get really dangerous when they meet people not educated enough in those fields.",
      "created_utc": 1746533089.0,
      "score": 41
    },
    {
      "id": "mqv6px7",
      "body": "The lady who just raised $600 thousand (*sorry just woke up) after calling a 5 year old the n-word comes to mind when really encapsulating how being racist is not just allowed but becoming celebrated.",
      "created_utc": 1746530339.0,
      "score": 78
    },
    {
      "id": "mqv73f1",
      "body": "For whatever reason? I’d say unlimited access to the internet + an incredibly popular super racist POTUS for what will be 8 years of their lives? Whatever reason? lol!",
      "created_utc": 1746530512.0,
      "score": 44
    },
    {
      "id": "mqvn6vn",
      "body": "Social Media and targeted algorithms.",
      "created_utc": 1746536962.0,
      "score": 9
    },
    {
      "id": "mqvkinv",
      "body": "The problem is that hate speech is being allowed unfettered because “muh free speech” despite the fact that it’s not only criminal, but criminal because of what it always leads to when left to fester long enough.\n\nIt incites hate crimes, it creates hate groups and fascists, and it needs to be shut down at all points.",
      "created_utc": 1746535996.0,
      "score": 31
    },
    {
      "id": "mr1sopf",
      "body": "If you tell this to boomers, they’ll say the world is too soft and that “you can’t say anything anymore without someone getting offended”..",
      "created_utc": 1746618402.0,
      "score": 3
    },
    {
      "id": "mr08zao",
      "body": "The world is becoming one big xbox live CoD chat from 2006.",
      "created_utc": 1746588483.0,
      "score": 16
    },
    {
      "id": "mqubotz",
      "body": "My old roommate was telling me about this the other day (she's from India and came to the US for college). It's crazy that this is a global phenomenon. I'm from the USA and there is talk of deporting legal migrants. I know the alt-right party in Germany is growing in popularity too. They are pushing for \"remigration\" and discussing who has the right to be in the country— legal or not. There were massive protests months ago. It's all genuinely terrifying.",
      "created_utc": 1746511698.0,
      "score": 335
    },
    {
      "id": "mqweejk",
      "body": "I’m reminded of my old friend from middle school, a first generation American. In India for summer break and she was bored one day and gave me a call. She says to me “I just wanna go make myself a sandwich, but the servants won’t let me.”  I couldn’t help but laugh a little because I was confused and no framework in my upbringing to even begin understanding the caste system.",
      "created_utc": 1746545325.0,
      "score": 1
    },
    {
      "id": "mqwm07v",
      "body": "100% this. They see politicians and billionaires being openly racist, and so they think it's cool now.",
      "created_utc": 1746547524.0,
      "score": 20
    },
    {
      "id": "mquln2y",
      "body": "Yeah, I saw a post about some guy who years ago had worked with someone and they were talking about another incident involving a racist and a black person and how the racist went off and he had thrown a bunch of slurs and as a result when it blew up, he lost his job and the guy talked about how his coworker was going \"he shouldn't have lost his job. I mean we all say slurs in our home\" and the poster was a black man so he understandably was \"speak for yourself\" and it really shook him how this person had probably said this about him and would go to work with a smile on his face and say that it's ingrained, Which it 100% is ingrained in the US especially with how history is whitewashed so you don't find out about how a lot of horrible racist shit happened in our grandparents lifetimes and how whole cities were flooded and razed to the ground because they were predominantly cites filled with POC and racists didn't like that. It's also why they put the pictures of the Civil Rights Movement with MLK in black and white instead of color to give the illusion it was so long ago when chances are, at least 1 (if not more depending on where you live) person you know who's over 60 was probably a part of that movement and up until recently, they would've lied about what side they were on, but if you're the right complexion, they would tell you.",
      "created_utc": 1746517863.0,
      "score": 104
    },
    {
      "id": "mqv32bm",
      "body": "I also think a part of why this behavior is occurring is because some people are so against cancel culture and \"wokeism\" to the point that they'll be so racist, sexist, etc just to \"rebel\" against the system, when in fact they are just swinging to the other extreme end of the spectrum. Man I wish people find a balance someday",
      "created_utc": 1746528572.0,
      "score": 97
    },
    {
      "id": "mr2iy3k",
      "body": ">Take the woman who called a little boy a racial slur—she raised $650,000\n\nWhat about the black guy that stabbed a white dude to death in cold blood and raised even more than that",
      "created_utc": 1746627631.0,
      "score": 5
    },
    {
      "id": "mrk224h",
      "body": "Their reasoning for donating that money is due to the stabbing incident at that track meet, it’s even sad when you find out the family of the victim who killed that meet are asking ppl to stop being racist to black ppl",
      "created_utc": 1746864379.0,
      "score": 1
    },
    {
      "id": "mrofa8x",
      "body": "Are you gonna say what the boy did to her son or leave that part out?",
      "created_utc": 1746925616.0,
      "score": 1
    },
    {
      "id": "mqujamw",
      "body": "Not just TikTok, see one black Person on Instagram and you will see at least one time the N-word with an -a at the end or as Gif Comments with a -er. TikTok and Instagram have clearly a racism and a far-right problem, i saw fucking Nazi Swastikas on Instagram comments.",
      "created_utc": 1746516338.0,
      "score": 433
    },
    {
      "id": "mqvi8cc",
      "body": "if it makes you feel any better (or realistically worse) reddit is the same. any social media platform has this",
      "created_utc": 1746535142.0,
      "score": 13
    },
    {
      "id": "mqw9dqd",
      "body": "If you think tiktok is bad, instagram and twitter is worse like a lot.",
      "created_utc": 1746543884.0,
      "score": 19
    },
    {
      "id": "mqvuohd",
      "body": "Twitter/X as well…",
      "created_utc": 1746539468.0,
      "score": 8
    },
    {
      "id": "mqyg2nc",
      "body": "Never had it, never will. Dodged that bullet Thank the Almighty. I'm on board for more guardrails to keep kids off of Social Media.",
      "created_utc": 1746566383.0,
      "score": 3
    },
    {
      "id": "mqzulnx",
      "body": "It’s all social media not just tik tok",
      "created_utc": 1746583173.0,
      "score": 3
    },
    {
      "id": "mr0ykz7",
      "body": "You are very naive to believe it’s not also on this very platform as well… it’s arguably just as, if not more, rampant here. I’m curious as to why you singled out Tik Tok of all the platforms…",
      "created_utc": 1746601278.0,
      "score": 1
    },
    {
      "id": "mr2op4o",
      "body": "how people talk about children these days is honestly disgusting",
      "created_utc": 1746629345.0,
      "score": 3
    },
    {
      "id": "mqvpw9z",
      "body": "I was the supervisor to a Gen-Z coworker. I'm not trying to generalize Gen-Z but this guy was blatantly anti-homosexual to the point where I was telling him to stop saying offensive shit on the daily. Probably 19 year old kid.  \nAnd it was like he thought we would all agree with him, it didn't feel like it was out of hate or towards any particular person. Just saying shit that he thought we would all legitimately laugh at and agree with. Stuff about trans people, constantly talking about \"disgusting drag shows.\" Saying shit out of nowhere.\n\nIdk wtf his problem was but he got fired within a month for it. I genuinely don't understand why he couldn't just stfu and not be an asshole at work. Kid was unhinged in a creepy, subtle way.\n\nAgain, I don't want to generalize and put people in groups but it's weird to see a young kid be such a prejudice asshat in 2025",
      "created_utc": 1746537908.0,
      "score": 64
    },
    {
      "id": "mqz3eqg",
      "body": "As a Gen Z who was born in 2004, it's a real problem. In 8th grade, I had a kid put his name in my contacts as \"that n-word jacob,\" obviously not censored. There are many people i know who think it's \"funny\" to say slurs. I had a friend who was excited to come out as bi because it \"meant she could say slurs.\" I've never seen someone so excited to say something like that.\n\n\nIt's become more common to call gay people the f slur because it's \"funny\" as long as you're also gay. So many are using gay as an insult again.\n\nI genuinely believe that having access to the internet and phones so young screwed with so many people. I'm only about a year older than youtube and reddit, only six years older than Instagram. I cant really say I knew a world without social media.\n\n\nI also believe I'm very, very lucky that I had parents who did not get me a phone the second they came out. Plus, when I did get a phone, it was a blackberry, but I knew four year olds when I was just 10 who had iPhones, and it absolutely baffled me. Now I absolutely wanted a smartphone, so my mom would let me use hers for some things like Snapchat filters. Our computer was a family one in the kitchen. I spent most of my youth outside and on bikes, which even for people my age is exceedingly rare. My mom encouraged me to read, and I was reading her college books in third grade, and we had vhs players and movies.\n\n\nThe lack of encouraging reading, writing, tactile hobbies like biking, painting, hiking, playing instruments, and many other common hobbies are becoming more expensive, harder to do, or simply people don't see a reason. I've seen a rise of anti intellectualism since I was a kid. No one wanted to be \"the nerd.\" Also the constant gutting of our public school system. My education didn't teach me much of anything important. But we had to watch 9/11 videos every single year starting in kindergarten.\n\n\nI had to get after one of my fellow Gen z coworkers who thought referring to a customer as a \"sand n-word\" was funny. I had to straight up tell him racism wasn't funny, and he tried so hard to defend himself it was insane.\n\n\nAlso, I am from a very red state and red county in the US. It was never legally seen as a sundown town, but it was 100% a sundown state that has never really tried to correct that assumption.",
      "created_utc": 1746573767.0,
      "score": 16
    },
    {
      "id": "mqzvt3o",
      "body": "i'm sorry this is very sad but it's also hilarious cause it's also just 4:20 and i am so amused by the thought of a stoner being accused of racism for that (i know this is not the case but i couldn't help but imagine this)",
      "created_utc": 1746583587.0,
      "score": 11
    },
    {
      "id": "mrw2hhx",
      "body": "420 also means weed fyi",
      "created_utc": 1747045634.0,
      "score": 1
    },
    {
      "id": "mqvco9u",
      "body": "Instagram and Facebook have both gotten so much worse in the last few years, and neither platform cares.  I’ve reported Facebook comments that encourage aggression and hostility towards minorities, and every time without fail I get a response that says “this does not violate our TOS.”  \n\nI’ve also been seeing graphic violence on Instagram that doesn’t get removed.  Both apps are slowly turning into Twitter.",
      "created_utc": 1746532935.0,
      "score": 35
    },
    {
      "id": "mqvlkq2",
      "body": "Hey. The ones who would shout that shit down in your defense irw are here. We just don’t spend our time on those channels. Keep the faith.",
      "created_utc": 1746536380.0,
      "score": 9
    },
    {
      "id": "mr2pgwg",
      "body": "misogyny and racism are a horribly pervasive duo. I think the intersection is called misogynoir?",
      "created_utc": 1746629571.0,
      "score": 3
    },
    {
      "id": "mqyphxj",
      "body": "Yup, this is what I've been saying for years. It was going away, but Trump showed people it was ok to be racist, sexist, homophobic, etc.",
      "created_utc": 1746569199.0,
      "score": 13
    },
    {
      "id": "mr3o0wj",
      "body": "People switch from social mode to survival mode pretty fast when they are hungry.",
      "created_utc": 1746639525.0,
      "score": 2
    },
    {
      "id": "ms7fnpf",
      "body": "But those extremely right leaning views are why the economy is having a huge dip.",
      "created_utc": 1747190799.0,
      "score": 1
    },
    {
      "id": "mrmtubv",
      "body": "Singaporeans are already pretty racist against indians",
      "created_utc": 1746904537.0,
      "score": 1
    },
    {
      "id": "mqvgh94",
      "body": "They're already turbo-consumerist. Look at haul culture",
      "created_utc": 1746534462.0,
      "score": 44
    },
    {
      "id": "mqued4q",
      "body": "Problem is the racists are causing serious damage to the lives of innocent people. They're not just miserable, scared, or idiots, they're dangerous.",
      "created_utc": 1746513266.0,
      "score": 75
    },
    {
      "id": "mr3901g",
      "body": "I totally agree with you. I (gen-x) have a stepson who is 18, and what I see in real life is outrageosuly different than what I see online. Overall, I think your generation is WAY more tolerant and mindful of others than all generations  before (I am like 70% gay and still cringe over the fact that I used to say \"that's gay\" in a derogatory way because it didnt offend ME). \n\nI think one big issue is that it's really easy to jump on a harmful bandwagon online, and your generation happens to be currently young/figuring out who you are and simultanously more online than previous generations. And then, like you said, rebelliousness kicks in for everyone else and they go against the status quo because it's edgy.\n\nI know my 47 paragraphs makes my age show, but all that to say your generation is doing great in the big picture, and I'm very proud of you all :)",
      "created_utc": 1746635234.0,
      "score": 2
    },
    {
      "id": "mqv82ju",
      "body": "There are freedom fighters, but they are usually rebranded terrorists. Depends what side people are looking from",
      "created_utc": 1746530962.0,
      "score": 6
    },
    {
      "id": "mqupia4",
      "body": "RIGHT!!! God forbid I don't condone white supremacy and I don't have hatred for others taking up space in my mind. Guess I'm woke now.",
      "created_utc": 1746520392.0,
      "score": 21
    },
    {
      "id": "mr2pvzs",
      "body": "I'd much rather be woke than asleep and unaware of how to be respectful",
      "created_utc": 1746629694.0,
      "score": 1
    },
    {
      "id": "mqvkm2j",
      "body": "There's no excuse for it, they have heard the stories and should be able to use their brain to connect the dots.",
      "created_utc": 1746536031.0,
      "score": 7
    },
    {
      "id": "mqzcmby",
      "body": "RIP AOL dial up and Top 5. RIP Tom.\n\nEdit: The next generation is Gen Alpha, our (Millennial) kids. So that checks out I guess?",
      "created_utc": 1746576897.0,
      "score": 2
    },
    {
      "id": "mqum4v5",
      "body": "As much as I would love for one person to be the cause so that when they are gone we can pretend it will get better… he wasn’t the cause. He’s just a symptom.",
      "created_utc": 1746518179.0,
      "score": 67
    },
    {
      "id": "mqw7ytv",
      "body": "Yeah. Zoomers are boomers 2.0\nSpoiler grandchildren, a spitting image.\nFrom self rightousness to moral bancrupcy.",
      "created_utc": 1746543477.0,
      "score": 3
    },
    {
      "id": "mqvz8dj",
      "body": "Thank you! If we don't keep them in check, this behaviour will continue to escalate. I'm proud that you stood up for what's right",
      "created_utc": 1746540886.0,
      "score": 3
    },
    {
      "id": "mqyszjc",
      "body": "Ok, but the second you put that person in real life with their learned experiences….",
      "created_utc": 1746570321.0,
      "score": 3
    },
    {
      "id": "mr1mujt",
      "body": "The only reason she ever got money was due to the karmleo Anthony give send go",
      "created_utc": 1746615806.0,
      "score": 3
    },
    {
      "id": "mquixec",
      "body": "what??? u do realise the people who seem normal irl are the ones making the comments on these platforms. we all understand there are consequences for being hateful in real life, but not on the internet, so people let out their true self on the internet",
      "created_utc": 1746516099.0,
      "score": 83
    },
    {
      "id": "mqujwhz",
      "body": "I talk to people from Gen Z in real life and they are significantly less tolerant and more openly racist than Millennials by a landslide.",
      "created_utc": 1746516732.0,
      "score": 59
    },
    {
      "id": "mr1mk3q",
      "body": "This is a natural reaction to subhuman beliefs like communism and socialism rising, the pendulum swings left and right",
      "created_utc": 1746615667.0,
      "score": 2
    },
    {
      "id": "mqw5zah",
      "body": "German here, what point exactly are you trying to make here?",
      "created_utc": 1746542907.0,
      "score": 2
    },
    {
      "id": "mqwnjqc",
      "body": "> From a Scandinavian perspective; there has been intense anti-white racism for the last ~20 - 30 years\n\nAre you sure you aren't just Swedish and trying to speak for the Norwegians because the Norwegians are more credible people?\n\nEdit: I finished reading your comment.  I am kind of proud of myself for being able to tell you were from Sweden.  Even in America, we can see the weird disconnect that has formed between Norway and Sweden.  Norway is like Canada, Sweden is like America.  The victim-complex in Sweden reminds me of America around 2009-2010.  It just gets worse from there, I promise.  People use it to justify worse and worse behavior as they chase phantoms. \n\nI do agree religion is a primary problem though.  Islam and Christianity being the biggest offenders of sending society backwards.\n\n>When Trump won (and Musk bought X) the liberal media lost a part of its monopoly on the internet, and lots and lots of white people have had enough of constant humiliation and working to pay welfare for immigrants. \n\nAt least in America, the left hasn't been represented in the media in about 25 years.  All news is owned by the same 3 billionaires who are conservative.  It's...real easy to see that.  I will also say in the US both the native liberals and the newly minted immigrants tend to have more money than native conservatives who are themselves a drain on our society and our resources.  See above: victim-complex.",
      "created_utc": 1746547979.0,
      "score": 6
    },
    {
      "id": "mqw077r",
      "body": "“They’re stealing our women…”\n\n🤣🤣🤣🤣",
      "created_utc": 1746541176.0,
      "score": 6
    },
    {
      "id": "mqw3sep",
      "body": "This is true, normies refuse to understand. I've been tracking it for decades as a non-white person. The thing that really shocks me is the \"native\" (the Sami peoples were natives in Sweden) white politicians allowing mass immigration from hostile immigrants (I support immigration from people who are respectful of the host country/culture, seek to assimilate and share the best parts of their original cultures). Your own betrayed you leading to what is going on today. When I heard about this in my early 20s I knew it was a shit idea that would have dire consequences. All it does is keep us working classes fighting each other, INCREASES racism, all while the ruling classes get away with their evil plots and plans.",
      "created_utc": 1746542257.0,
      "score": 5
    },
    {
      "id": "mqxkw4y",
      "body": "REAL",
      "created_utc": 1746557458.0,
      "score": 1
    },
    {
      "id": "mqw1hxz",
      "body": "As opposed to, you know, stopping the racist behaviour and comments 🙄\n\nAs a white woman, there have been - and will continue to be - so many elements of white privilege and racism that have been unconscious to me. I've had to shut up and listen, and continue to learn and evolve. When a diverse range of people share their stories and experiences with you - providing you with so much opportunity for growth - it's actually an honour.\n\nIt's disappointing that some people would rather buckle down and \"own\" being pieces of shit.",
      "created_utc": 1746541568.0,
      "score": 6
    },
    {
      "id": "mqx94ve",
      "body": "In high school people were always saying wild shit racially, even the other minorities I was friends with",
      "created_utc": 1746554079.0,
      "score": 2
    },
    {
      "id": "mquj00q",
      "body": "I feel like there was a good wave of activism in millennials and older gen-z. The culture shifted and went back.",
      "created_utc": 1746516147.0,
      "score": 27
    },
    {
      "id": "mqx0ari",
      "body": "I have a little brother who is 14. He lives with his mom, I don’t see him all that often, but I picked him up to come over and hang out like a month or so ago and he started with that shit. Just saying it “as a joke” so casually. I yelled at him for it and told him it’s not ok, that it’s not a joke, that jokes are supposed to be funny and I don’t see anything funny about this. He tried to justify it because “everyone says it” and “it’s not a big deal anymore.” And I told him it still was a big deal and I would take him home if he said it again. He didn’t say it anymore. But later on, he made some comment making light of the holocaust. So I made him watch a holocaust documentary with me. I’m sure I didn’t change his mind on anything. But that’ll be the day when I just allow racism to become a “normal” thing around me. But I agree that you’re right, kids now think that it’s just normal and funny. I don’t know when things changed. It’s sad and it worries me. Like we’re supposed to get better and more accepting as time goes on and these younger generations make me scared that that isn’t happening.",
      "created_utc": 1746551598.0,
      "score": 1
    },
    {
      "id": "mqyzj89",
      "body": "Bro, (they don’t have lasts years data yet but) according to the FBI, more white people were arrested than POC. So idk it’s kinda of like all races commit crimes? Or maybe you mostly see POC be brought up in your conversations.",
      "created_utc": 1746572481.0,
      "score": 1
    },
    {
      "id": "mqzeif6",
      "body": "By that logic Gen X was racist and Boomers weren't racist. I understand what your saying but I don't think it's so black and white or cyclical.",
      "created_utc": 1746577567.0,
      "score": 1
    },
    {
      "id": "mqzdrxf",
      "body": "Eh, not as slowly as you think, but I also know the loud minority is all we hear about.",
      "created_utc": 1746577305.0,
      "score": 2
    },
    {
      "id": "mr55c7u",
      "body": "Never said that. I said it's a conversation about the culture not your beliefs. Glad you're comfortable outing yourself as a racist though 👍",
      "created_utc": 1746654965.0,
      "score": 1
    },
    {
      "id": "mqvgjbx",
      "body": "Please you people are so dramatic. Just don’t be racist and hateful, this has nothing to do with being liberal. It’s about common decency. White cis males weren’t being “put down” SOLELY because of their identity.",
      "created_utc": 1746534485.0,
      "score": 39
    },
    {
      "id": "mqvr0te",
      "body": "Your side raised over half a million for a woman calling a 5-year-old the hard R.\n\nIt has nothing to do with being \"put down\" for being cis, white, or male.\n\nIt has everything to do with putting down trans and non-white people and seeing them suffer, increasing their pain. That's what you're for. That's what you vote for. That's what makes you happy.",
      "created_utc": 1746538296.0,
      "score": 11
    },
    {
      "id": "mr0hvmm",
      "body": "As a straight white male with basically every privilege you could ask for I wanna say that y'all listening to people too much, don't live your life how other people want you to live it. Be kind and accepting to people, you'll find it will pay off soon.\n\nNo one is getting protected by the government for unnecessary murder because their miss understood, your just regurgitating what you heard someone else say without thinking about it.\n\nAs a person who is friends with multiple LGBTQ people I can comfortably they are all chill, yeah there will be weird ones, but their will always be a weird one in any group of people. Y'all just talk about them more cause it suits your political opinions.\n\nId like to see some of those 100 more reasons\n\nPS I also doubt that you see many people attacking you for being cis or white anymore.",
      "created_utc": 1746592285.0,
      "score": 1
    },
    {
      "id": "mqwcb1a",
      "body": "Divide and conquer.  \n\nCorruption wants to divide and conquer.  \n\nYou have more in common with your neighbour’s no matter their skin colour, than a fat corrupt millionaire thief.  \n\nBut divide and conquer, there is hate propaganda to hate everyone, men, women, gay, short, tall, black, Asian, white all on lists to be targeted.",
      "created_utc": 1746544723.0,
      "score": 178
    },
    {
      "id": "mqw6rcx",
      "body": "Yep, YouTube funnels a huge alt right pipeline speaking as a former edgy kid. Funnily enough YouTube also got me out of the pipeline though lol.",
      "created_utc": 1746543133.0,
      "score": 227
    },
    {
      "id": "mr0mlsf",
      "body": "I think another reason why is people feel disenfranchised and end up in echo chambers because there isn’t enough positive role models on the internet unfortunately",
      "created_utc": 1746594595.0,
      "score": 2
    },
    {
      "id": "mqxbebj",
      "body": "its not even just racism. Its anything dark.",
      "created_utc": 1746554718.0,
      "score": 68
    },
    {
      "id": "mqycb9m",
      "body": "Gahd danggit Bobby, this shit is straight gas 🍃 💨",
      "created_utc": 1746565272.0,
      "score": 35
    },
    {
      "id": "mr44d4l",
      "body": "OMG I had to check it and it took me OUT!",
      "created_utc": 1746644183.0,
      "score": 3
    },
    {
      "id": "mr2ofyj",
      "body": "I want you to tell me how that would work and who would enforce it.",
      "created_utc": 1746629270.0,
      "score": 2
    },
    {
      "id": "mtzpfnk",
      "body": "Hello cousin",
      "created_utc": 1748085671.0,
      "score": 1
    },
    {
      "id": "mqvlnz6",
      "body": "Not to mention politics in spaces that weren’t typically political before. So much gym content and fitness influencers are right wing grifters these days for example.",
      "created_utc": 1746536412.0,
      "score": 150
    },
    {
      "id": "mqvffpj",
      "body": "Hard to keep people engaged with content that doesn’t piss you off",
      "created_utc": 1746534054.0,
      "score": 89
    },
    {
      "id": "mqvg9fo",
      "body": "Echo chambers working strong",
      "created_utc": 1746534378.0,
      "score": 40
    },
    {
      "id": "mqvj681",
      "body": "This is half of it.  The other half is that young people do not feel like they have a future and they are looking for someone to blame.  Those are the major ingredients.",
      "created_utc": 1746535496.0,
      "score": 51
    },
    {
      "id": "mqvelvk",
      "body": "That whole bullshit to \"it's just a joke. Don't be sensitive\" is actually desensitizing themselves",
      "created_utc": 1746533723.0,
      "score": 119
    },
    {
      "id": "mqx5za6",
      "body": "I mean, was it that really? Considering it's also rising in parts of the world in which weapons were not commonly held, even then (or in which violence does go unpunished today). \n\nA lot of people in the US are afraid every day that an entitled idiot, empowered with a gun, might enter any space that they're in; and radicalization is, still, very much rising.\n\nI'm sure it does not have anything to do with algorithmic feeds furthering all of us away from a common thread of 'reality' (presenting us with deeper and deeper confirmation of our biases / pipelines and the content that's most likely to elicit a reaction; stereotyped thinking being relatively common in younger, still very impressionable, people with little access to actual information and exposure to people with different experiences than them) and/or any dissenting opinions. /s",
      "created_utc": 1746553189.0,
      "score": 3
    },
    {
      "id": "mqv7u3s",
      "body": "She received $600k",
      "created_utc": 1746530855.0,
      "score": 24
    },
    {
      "id": "mqvypfp",
      "body": "“Muh free speech!” I was raised in a conservative Christian household, this was used a lot as a talking point but my father always reminded me **I also had those rights**.\n\nI got married to a human who happens to be darker than I am. You would not believe how many of my friends ended up being racist AFTER we got married and not during the like multiple years we were together. Then they acted shocked when I literally instantly blocked them because I didn’t want to talk about it. Atleast FOUR people who I was once friends with was texting my “non-racist” friends who “didn’t want to get involved” (they’re also no longer my friends because they did nothing) “it’s just my opinion, I just don’t think blah blah blah, it’s my right to say what I want.” Yeah, and it’s MY RIGHT to literally never talk to you again. It’s my right to tell you to your face you’re kind of a racist POS. \n\nFreedom for me but not for thee.",
      "created_utc": 1746540725.0,
      "score": 44
    },
    {
      "id": "mr1x5nu",
      "body": "Here in germany, many old people are offended that they can't call a candy that is called \"Schokokuss\" (Word by word translation Choclate kiss) a \"N-word kuss\" (word by word translation N-word kiss with a -er at the end of the full spoken N-word).",
      "created_utc": 1746620222.0,
      "score": 2
    },
    {
      "id": "mqup0n8",
      "body": "Man and I would have thought the Internet and increasing connectivity/exposure to different people's lives and more multicultural media/populations would of decreased racism over time. \n\nTbh it's probably still better today than 30-50 years ago but this uptick lately is disheartening. The optimist in me is saying it's just a counter trend push back with no lasting power.",
      "created_utc": 1746520066.0,
      "score": 95
    },
    {
      "id": "mqvhs6j",
      "body": "I feel so bad for my labmate. We're both in grad school, and of course it's the stereotype of being so busy we don't have to visit family. I'm lucky (??) to be a US citizen, so I can just take a weekend trip to visit my parents, but my labmate's family is all the way back in India. She hasn't gone back to visit in 3 years. She was planning on going this summer before all this shit started happening, and now she's worried that if she goes back, she won't be allowed back into the country to finish her degree. I feel so bad for her, no one should be feeling those feelings.",
      "created_utc": 1746534970.0,
      "score": 46
    },
    {
      "id": "mquno68",
      "body": "> I'm from the USA and there is *talk* of deporting legal migrants\n\nYour government is already deporting US citizens.",
      "created_utc": 1746519180.0,
      "score": 145
    },
    {
      "id": "mqucdmh",
      "body": "One interesting fact is that the people who are representing India globally (as a minority being the people of colour) mostly come from filthy rich upper caste families who practice all sorts of dehumanising caste practices back home but play victim in the west. Even their activism towards caste system is so performative because in reality they cannot eliminate a system they benefit immensely from. It is intertwined in their day to day practice. So it’s impossible for them to give up the caste practices. It is only now that people from the erstwhile untouchable castes have started to go the west for studies.  \nEven the rise communal issues that you see these days where Hindus are hateful towards Muslims globally has a lot to do with their caste positions in the social hierarchy.",
      "created_utc": 1746512096.0,
      "score": 53
    },
    {
      "id": "mqyufbl",
      "body": "There have always been laws on the books of EVERY country that state if a migrant (someone who does not intend to settle or seek citizenship within the country but is just there for education, temporary work assignment or medical treatment) breaks any laws, they are subject to immediate deportation without the right to re-enter. These people are not being picked up and deported for no reason. When you are a guest in another country, you follow their laws, no exceptions. Also, you do know that many migrants are white, right? \n\n\nLegal immigrants are people who have the legal right to permanent residency and may or may not be seeking citizenship. The process is different, but they can also be deported for breaking the law. \n\n\nNaturalized citizens - people who immigrated to the US and followed the process to become American citizens cannot be deported. ",
      "created_utc": 1746570801.0,
      "score": 1
    },
    {
      "id": "mqvh6np",
      "body": "Disagree, these people will find any excuse to be racist and blaming the left is a way to do it without taking personal responsibility for their own morals. \n\nIf people telling you racism is bad makes you more racist, the problem is you. Let’s not feed into the right-wing narrative that they’re all just victims of “wokeism” aka “being a decent person”.",
      "created_utc": 1746534737.0,
      "score": 50
    },
    {
      "id": "mqun1ha",
      "body": "no fr. A black person even just breathes on social media, the comments and subliminal racist remarks are always fucking ridiculous. It's sick. It's literally the norm now.",
      "created_utc": 1746518769.0,
      "score": 265
    },
    {
      "id": "mqul257",
      "body": "Yeah. It's all social media. One of my friends got SA threats on twitter and called countless racial slurs. She had to get the authorities involved. Internet is a scary place.",
      "created_utc": 1746517485.0,
      "score": 175
    },
    {
      "id": "mqvaqz1",
      "body": "Idk what it is about IG but the comments are always a cesspool of losers that think they’re tough. Even on TikTok you can look at the comments and they’ll say cringe nonsense like, “I bet you’re not brave enough to post this on IG.”",
      "created_utc": 1746532132.0,
      "score": 22
    },
    {
      "id": "mqv698b",
      "body": "Honestly at this point I no longer bother to even look at comments on instagram or tiktok since there’s almost always some racist comments.",
      "created_utc": 1746530122.0,
      "score": 34
    },
    {
      "id": "mqv8mhq",
      "body": "I don’t see it in TikTok as much but I did on Instagram. No threats or insults just blank people saying the n word to each other.",
      "created_utc": 1746531209.0,
      "score": 15
    },
    {
      "id": "mr0yq6l",
      "body": "Every single post on Instagram I see that isn’t some old lady baking cookies the comment section is “why is *insert topic of post* on my racism app” and it really doesn’t feel like an ironic joke.",
      "created_utc": 1746601366.0,
      "score": 2
    },
    {
      "id": "mqx45uh",
      "body": "Yeah honestly idk if it’s because my for you page is pure, but instagram is MUCH worse with it than TikTok, at least from what I’ve seen.",
      "created_utc": 1746552671.0,
      "score": 1
    },
    {
      "id": "mr2om3j",
      "body": "a lot of people don't realise that reddit is VERY racist outside of the \"safe\" subs. it's like an iceberg really.",
      "created_utc": 1746629321.0,
      "score": 3
    },
    {
      "id": "mr4jk61",
      "body": "It is, especially if those children happen to be neuro divergent. I just can't believe some of the things people are willing to say to/about each other",
      "created_utc": 1746648618.0,
      "score": 3
    },
    {
      "id": "mqvslx9",
      "body": "That’s disgusting. Glad he was fired. I’m so genuinely confused and horrified, because on the other hand, I know this generation to be incredibly fluid and open too! I can relate to your anecdote about the hate towards marginalized people too. The same coworker that changed the computer password also made hateful comments about the lgbt community.",
      "created_utc": 1746538816.0,
      "score": 19
    },
    {
      "id": "mqwflw1",
      "body": "Probably he was never punished in school, or he was never taught about empathy and kindness, or he simply lacks critical thinking ability so he relies on fox news for his ideas.",
      "created_utc": 1746545674.0,
      "score": 10
    },
    {
      "id": "mr2qwse",
      "body": "There goes his references",
      "created_utc": 1746629992.0,
      "score": 3
    },
    {
      "id": "mrgjqg6",
      "body": "You know hitlers birthday is 4/20 right? lmao",
      "created_utc": 1746814487.0,
      "score": 1
    },
    {
      "id": "mr2p81d",
      "body": "also a 04 lad, I agree with a lot of this even though I'm not in the US at all. I spent most of my childhood between reading, my bike with the neighbours and my nintendo DS. although it probably doesn't help that it's getting more inaccessible for kids to hang out without paying.",
      "created_utc": 1746629499.0,
      "score": 3
    },
    {
      "id": "mqzxyy7",
      "body": "Hahaha that would be hilarious. Unfortunately,  it also included hitlers name, so that kind of removed reasonable doubt from the equation 😂",
      "created_utc": 1746584339.0,
      "score": 8
    },
    {
      "id": "ms7i18s",
      "body": "the ultra right lean started after the first covid recession in 2021",
      "created_utc": 1747191725.0,
      "score": 1
    },
    {
      "id": "mrgk5bn",
      "body": "touch grass",
      "created_utc": 1746814612.0,
      "score": 1
    },
    {
      "id": "mqzd0ho",
      "body": "Tom said “Thanks for the money” and dipped 😭",
      "created_utc": 1746577036.0,
      "score": 2
    },
    {
      "id": "mquwsyv",
      "body": "Trump uncorked something that was already there.  He raised the heat.",
      "created_utc": 1746525101.0,
      "score": 47
    },
    {
      "id": "mquweio",
      "body": "He was definitely the cause because he made it ok to be racist openly. People were still covert racists before he took office in 2016. Generation Z was still very young and impressionable and easily molded at the time. If that generation of white children are more racist he is a direct cause of it",
      "created_utc": 1746524858.0,
      "score": 17
    },
    {
      "id": "mr43noc",
      "body": "I quit playing that game about 2 years ago. I don't wanna hear it, people around don't wanna hear it, and kids shouldn't hear it. It also doesn't do ANYTHING but escalate a situation. So we just go with disorderly conduct at that point.",
      "created_utc": 1746643981.0,
      "score": 3
    },
    {
      "id": "mquly1l",
      "body": "Exactly, people don't realize if you give someone the mask of anonymity, they get really horrible really fast. That's why there is that whole public knowledge fact that Xbox live chats back in the day were full of kids using the hard r word because they were taught that's how you insult people either by other gamers or by family. They probably would've been nice kids when you meet them on the street but would gladly call you a slur when your back is turned. \n\nPlus, there are so many instances where people can appear \"nice\" but can vote or do things that basically put out in the world that they want you dead. Like people who seemed \"nice\" until they voted for Trump in 2016, 2020, and 2024.",
      "created_utc": 1746518057.0,
      "score": 21
    },
    {
      "id": "mqvf3ec",
      "body": "This definitely depends on what region of the US you live in. I find that boomers and anyone born after 2005/2006 tend to be a lot less tolerant than Gen Z. But to be fair, I live towards the west coast.",
      "created_utc": 1746533917.0,
      "score": 5
    },
    {
      "id": "mqy9mft",
      "body": "Many Europeans have had increased immigration rates and, coincidentally, increased crime rates",
      "created_utc": 1746564527.0,
      "score": 3
    },
    {
      "id": "mqwytzq",
      "body": "Just gotta correct you there, Swedes are the natives of Sweden, our ancestors came here 15000 years ago, when the ices covering Scandinavia melted and settled in the middle/central and the south of Sweden. The sami came later, and they settled in the north of Sweden.",
      "created_utc": 1746551188.0,
      "score": 3
    },
    {
      "id": "mqzkuf6",
      "body": "exactly. i’m a black girl from utah. none of this is new",
      "created_utc": 1746579814.0,
      "score": 2
    },
    {
      "id": "mqx9gqy",
      "body": "I feel like nowadays it’s not even the fact that they don’t care. It’s the fact that it’s so normalized that they don’t even know it’s actually a really bad thing to do.",
      "created_utc": 1746554171.0,
      "score": 1
    },
    {
      "id": "mqza5o3",
      "body": "Cool, I don’t live in USA but I can imagine that would be the case as USA is a Hellhole. Wouldn’t touch the place even if you paid me. \n\nGiven if your data is true it would be completely fair for the average person to be wary around white folks.",
      "created_utc": 1746576035.0,
      "score": 1
    },
    {
      "id": "mqzi0zr",
      "body": "What every generation rebels against will be different. In this case I'd argue Millenials really identify with that and have been more aggressive about policing people in regards to that than other generations have. The cyclical nature is just the sheer act of rebellion not what they were rebelling against. For the Gen Xers they were rebelling against was the ideals and hypocrisy of Boomers who went from being Hippies to ReaganRepublicans. It's what birthed the punk movement which was the big rebellion for Gen Xers.",
      "created_utc": 1746578816.0,
      "score": 1
    },
    {
      "id": "mr55uu5",
      "body": ">Glad you're comfortable outing yourself as a racist though 👍\n\nUh that's a really weird assumption to make, but you do you I guess.\n\nWhat I'm saying is that you're asking \"why is gen z racist?\", and then gen z comes in and says \"well I'm racist because of x y z\" and then you're going \"I don't want to hear why you're racist!\". You understand the flaw here, right?",
      "created_utc": 1746655129.0,
      "score": 1
    },
    {
      "id": "mqw6xbs",
      "body": "i mean liberals make generalizations about the entire “cis male” demographic because of a few bad actors, even you acknowledged this. how is that any different than genz making generalizations about people of other races and sexual orientations? you dont get to pick and choose which identities its okay to criticize and belittle and then clutch your pearls when someone does it back to you.",
      "created_utc": 1746543180.0,
      "score": 5
    },
    {
      "id": "mr00d8t",
      "body": "And people also raised half a million for a black kid who stabbed another kid to death and is going to jail, it was reactionary.\n\nIF people are going to be racist don't be surprised when people are racist.\n\nHell even Luigi has what like 700k?\n\nEither ALL bad behavior is bad, or none of it is and this is the result of playing favorites.",
      "created_utc": 1746585195.0,
      "score": 2
    },
    {
      "id": "mqz6sra",
      "body": " I don't follow any of the awful people, and yet I get so many ads for hateful garbage spewing people and groups. It doesn't matter that I say I don't want them and down vote and block them, I just get more. And they're shown in such a way that makes you think they're not about hateful racist people, but they absolutely are. It's maddening!",
      "created_utc": 1746574897.0,
      "score": 30
    },
    {
      "id": "mqx3e5z",
      "body": "Had that phase too up until ~2021, scary how easily you can be sucked in without realizing it.",
      "created_utc": 1746552454.0,
      "score": 34
    },
    {
      "id": "mr8j3u6",
      "body": "It’s so disgusting",
      "created_utc": 1746708661.0,
      "score": 1
    },
    {
      "id": "mr3gqgz",
      "body": ">who would enforce it.\n\nGovernment agencies most likely. The dark web was separated from the normal web by someone of course the context of who did it remains anonymous.\n\n>I want you to tell me how that would work\n\nThe same way you can't go on the normal web and buy illegal goods and services like you can on the dark web. To access certain sites like that you need TOR, (The Onion Router). Be advised though I speak against illegal activity , and as a warning of precaution, going there may lead the feds breaking down your door and tracking your IP, if you're not careful. So, what I'm saying is don't screw around with that. Especially if you don't know what you're doing. They were categorized this way by someone.\n\nThose who did that can do this process.\n\nThe who, what, when, how, and why behind that remains classified for obvious reasons.",
      "created_utc": 1746637458.0,
      "score": 1
    },
    {
      "id": "mqwaz6f",
      "body": "Also the eco and yoga fashists. What is up with these people? There's a huge divide between modern pagans too, they either swing super far right or left. Everything is becoming radicalized and turning into hyper-capitalism.",
      "created_utc": 1746544340.0,
      "score": 65
    },
    {
      "id": "mqzmgyh",
      "body": "Me and my brother remember feeling like that in the 70s. So it’s not new. ",
      "created_utc": 1746580396.0,
      "score": 3
    },
    {
      "id": "mqvmvgf",
      "body": "I think that was a big part of it. Front what I saw over 8 years helping raise one of them, it started with YouTubers saying/doing racist fucked up things to be edgy. Then kids repeat the noise to be edgy/impress friends/get a rise out of parents & teachers. Till eventually the edgy fucked shit became normalized to them, and then the conservative white nationalists' talking points seem less and less like outlandish inbred fantasy brainrot.",
      "created_utc": 1746536847.0,
      "score": 48
    },
    {
      "id": "mqw3fqi",
      "body": "I mean, that was a big issue with Gen X too. The idea that \"Words can't hurt you and shouldn't be taken seriously\" is something that Millennials started to move away from and older Gen Z moved further. But younger Gen Z and older Gen Alpha now feel like their behaviour is policed because being reflective and considerate turned into ideological purity culture and every bad thing they've ever said is preserved online in amber to haunt them.\n\nSo they go back to the Gen X model of \"Not a racist\" racism.",
      "created_utc": 1746542151.0,
      "score": 28
    },
    {
      "id": "mr1jeez",
      "body": "It's less mass violence and more individual, I mean. In the moment\n conflicts are less likely to have lasting outcomes over being a douche to people.\n\nIm going to also agree theres more to it than that, but the sense behind the youngest adult generation is this level of irrational smugness that nothing will happen when they act like an asshole.\n\nIE - Prank videos, cutting in line, tripping or fucking with people, saying out of pocket disrespectful shit, etc\n\nTheres this disconnect from basic respect for convention or politeness that people usually display int he anonymity of the internet, but in real life.",
      "created_utc": 1746614103.0,
      "score": 3
    },
    {
      "id": "mr2ea0x",
      "body": "God damn..",
      "created_utc": 1746626182.0,
      "score": 3
    },
    {
      "id": "mr0c1yf",
      "body": "It's worse now than it has been in the last 40 atleast. But at this rate, it won't take long to take us back 40 more.",
      "created_utc": 1746589756.0,
      "score": 7
    },
    {
      "id": "mr2qbff",
      "body": ">The optimist in me is saying it's just a counter trend push back with no lasting power.\n\nThe optimist in you needs recalibrating. This *can* go on indefinitely and has gained power while decent people have passively hoped for it to fizzle out. Instead, the optimist should believe that if they and enough others like them rise up together they can pressure the algorithmic overlords to stop promoting hateful content to everyone using their services.\n\nThe only way that this ends within the lifetimes of all the decent bystanders is if the global fascist movement speed runs the \"autocannibalization\" phase, at which point we'll have probably lost a few billion humans along the way and nearly all the ones we have left will be traumatized.",
      "created_utc": 1746629819.0,
      "score": 2
    },
    {
      "id": "mr3a5pq",
      "body": "It has. the bubble works both ways and magnifies the racism that does exist.\n\n\nTo compare it to previous generstion where casual racism was accepted in polite conversation is ridiculous",
      "created_utc": 1746635575.0,
      "score": 1
    },
    {
      "id": "mquof6i",
      "body": "Talk as in media coverage, sorry",
      "created_utc": 1746519671.0,
      "score": 49
    },
    {
      "id": "mqvr1at",
      "body": "I do agree with you that they are really not victims, and my hypothetical reasoning behind their reason is more of an observation on their reasoning that I've been seeing on IG.",
      "created_utc": 1746538300.0,
      "score": 12
    },
    {
      "id": "mqum49s",
      "body": "Im sorry for your friend, hop the authorities can help.",
      "created_utc": 1746518168.0,
      "score": 45
    },
    {
      "id": "mr2k92h",
      "body": "Racism just goes hand in hand with sexism (from my experience) you're a woman or talk about women's rights and you're randomly DMed about how women don't deserve rights or that men have it harder and the male loneliness epidemic and either if you do engage or not you end up getting SA threats.",
      "created_utc": 1746628024.0,
      "score": 5
    },
    {
      "id": "mqvfo1s",
      "body": "Same. I’ve lost enough faith in humanity",
      "created_utc": 1746534144.0,
      "score": 9
    },
    {
      "id": "mr0yvtz",
      "body": "I rarely see it on Tik Tok, whereas I’m *constantly* seeing it on Instagram",
      "created_utc": 1746601459.0,
      "score": 2
    },
    {
      "id": "mrgk99e",
      "body": "That's a good point I bet that's what happened lol",
      "created_utc": 1746814645.0,
      "score": 1
    },
    {
      "id": "msdtt3c",
      "body": "As a result of ultra right governments being in power. ",
      "created_utc": 1747276470.0,
      "score": 1
    },
    {
      "id": "mqzd5n6",
      "body": "That's Millennial life wrapped up in a small statement.",
      "created_utc": 1746577087.0,
      "score": 2
    },
    {
      "id": "mr07ve7",
      "body": "Thanks, I did a bit more research and both Swedes and Sami are natives, in different parts of Sweden. Thanks for educating me, I love to learn ☺️.",
      "created_utc": 1746588045.0,
      "score": 2
    },
    {
      "id": "mqzm2cq",
      "body": "Yeah,Kids are always gonna be full of piss and vinegar until they mellow out a bit",
      "created_utc": 1746580253.0,
      "score": 1
    },
    {
      "id": "mr0ch5d",
      "body": "Ohhh I see. But nah, we’re wary of white people because of their racist history that still carries on today.",
      "created_utc": 1746589936.0,
      "score": 1
    },
    {
      "id": "mqzkymp",
      "body": "I see. That's fair and makes more sense.",
      "created_utc": 1746579857.0,
      "score": 1
    },
    {
      "id": "mr5el9z",
      "body": "It's not about your personal opinions though. I'm not asking people, \"hey, why are you racist?\". I'm asking, \"what do you think is causing an increased influx of racists in Gen Z in comparison to the previous extremely progressive generation of millennials?\". It's not a discussion about any individual belief but rather what has caused the change.",
      "created_utc": 1746658049.0,
      "score": 1
    },
    {
      "id": "mqwn2jh",
      "body": "> i mean liberals make generalizations about the entire “cis male” demographic because of a few bad actors\n\nI'm not arguing with you, but wanted to share my position.  As a white, cis, straight guy who finally went to therapy to deal with the dysfunctional parenting the average white, cis, straight guy receives during childhood, the generalizations are pretty accurate.  \n\nBUT, they don't FEEL accurate, because most white, cis guys don't realize how badly off they are.  The sadness and anger and confrontational feelings just start to feel normal, and you don't realize how much happier you could be if you just...weren't like that.  And it IS fixable.  That's what no one really tells you.  It's fixable with a bit of work, especially EMDR, and within a year you won't recognize yourself.\n\nThere is a cultural failing in how many young men are raised, and it's not their/our fault.  But we do have to fix it if we want to get along and be happy, emotionally fulfilled, and meaningfully partnered. \n\nI would go so far as to say the hard truth is that you need to replace \"liberals\" with \"reality\" in your paragraph above.  Liberals aren't \"right\".  They are just what normal people look like without generational trauma and poverty.",
      "created_utc": 1746547839.0,
      "score": 14
    },
    {
      "id": "mqyxxoc",
      "body": "For me, there’s a big difference between doing it out of fear of being assaulted/harrassed/verbally abused and doing it out of genuine racism and homophobia (the majority being people who never interact with POC/the queer community daily).\n\nI think it’s okay for certain individuals to prepare themselves for people who might be racist or homophobic towards them. How they go about it? Maybe it’s gotten to be a lot? I haven’t seen that personally, but I think we see most opinions online about white people or cis men, so idk, to me it’s not as harmful as someone being racist or bigoted in person. \n\nLet’s think about it realistically, there are far more people who have had to hear racist/gay jokes, seen causal hatred in the media and most importantly, seen it in their daily lives and for decades too. So, I don’t know, for me it’s kinda like, suck it up? Idk\n\nEdit: And yes, I agree w Tech_Philosophy. If you’re not the bad white people we talk about, then it’s not about you. And if you witness this behavior in your community, I think it’s part of “the good ones” job to help in correcting that behavior.",
      "created_utc": 1746571957.0,
      "score": 3
    },
    {
      "id": "mr0qn0h",
      "body": "If you interact with content you'll get it recommended more, even if it's a negative reaction you show",
      "created_utc": 1746596718.0,
      "score": 11
    },
    {
      "id": "mr3o8di",
      "body": "\"Dark web content\" isn't a synonym for \"dangerous and/or illegal online content\", it's just a subset of the stuff that people set up online that isn't indexed in a way that standard web browsers can access. It's not really something that was established by any centralized entity like you seem to be suggesting. Anything that's there is as legal as identical content on a surface website (assuming jurisdiction can be established in either case), it's just way harder (though not impossible) to track down and prosecute someone without all of the identifying features present on the surface web. If surface web law enforcement is like playing whack-a-mole, dark web law enforcement is doing the same but while blinded and deafened and in the middle of an indeterminately large field of play. There's no agency or organization that actively shunts things to the dark web, it's just more likely for criminal activity to continue undisturbed in a purer state of anonymity.\n\nBanishing memes from the surface web is, put simply, impossible. Law enforcement is already unequipped to completely purge the surface web of stuff that's currently illegal (which is why your average emulation site or manga aggregator can exist untouched indefinitely) and those tend to be far more centrally based than memes -- a class of content entirely defined by its tendency to propagate across the internet like a virus spreads through a vulnerable population. You'd be asking the surface web whack-a-moler to slam down a million moles a second, with the understanding that the moles will disguise themselves when possible and any mole that survives the time limit will make a million more.",
      "created_utc": 1746639583.0,
      "score": 2
    },
    {
      "id": "mqvniuz",
      "body": "I find ever increasingly the need to eventually truly retire from this social media shit, and to really dissociate from people who are of those calibre",
      "created_utc": 1746537079.0,
      "score": 26
    },
    {
      "id": "mqusuob",
      "body": "Don't be sorry ! It was more of a community note.",
      "created_utc": 1746522581.0,
      "score": 26
    },
    {
      "id": "mquoloe",
      "body": "Luckily she's alright. The situation subsided afterwards.",
      "created_utc": 1746519792.0,
      "score": 33
    },
    {
      "id": "msdz9ry",
      "body": "[deleted]",
      "created_utc": 1747278580.0,
      "score": 1
    },
    {
      "id": "mr0cvml",
      "body": "Two sides it the same coin. Call it racism to be wary of a group that commits violet crime, call it racism to be wary for a group for their actions. \n\nYou’re as racist as I am, or you’re as logical as I am. Take your pick on the wording, the outcome is the same.",
      "created_utc": 1746590102.0,
      "score": 2
    },
    {
      "id": "mqzyw85",
      "body": "No worries. If you want a good movie about this kind of thing I'd recommend SLC Punk. One of Matthew Lillards best works",
      "created_utc": 1746584664.0,
      "score": 1
    },
    {
      "id": "mrbvte1",
      "body": "Right. And then people are telling you what has caused the change because the increase in racism isn't just some vague faceless specter but is instead made up of the individual personal opinions of the people in the generation. \"Gen z\" isn't some arbitrary abstraction, it's actual people. So if actual gen z people come in and say \"I am racist because x y z\", they are answering your question. You just don't like the answer.",
      "created_utc": 1746745507.0,
      "score": 1
    },
    {
      "id": "mr3r5k7",
      "body": "I don't know about that, you have people getting shadow banned where they post and only they see it. Do that to publishers over and over and it would deter them because quite frankly it becomes a pain . \n\nThere are banned political cartoons that are censored and footage from tragic events that get published online and gets censored too. Someone has to do that too.\n\n>it's just a subset of the stuff that people set up online that isn't indexed in a way that standard web browsers can access\n\nThe question here is who did that? Someone has to index it, it didn't just magically appear there in its own category. There is a way to do it.",
      "created_utc": 1746640398.0,
      "score": 1
    },
    {
      "id": "mse4vck",
      "body": "I forgot to add, \"before 2021\".",
      "created_utc": 1747280920.0,
      "score": 1
    }
  ]
}