{
  "id": "1frrkv0",
  "title": "Update V: I think my husband fathered his best friend's children. ",
  "selftext": "Hey everyone. This may very well be my last update for a while. I'm in therapy now, as are my children. (And, from what I hear, Amy's children are as well, so that's good.) So I should probably be focusing on healthier ways to expel my feelings. Nonetheless, I have talked to my therapist about these posts and according to her, venting anonymously online can be healthy, up to a point. If I do talk about my life again, I may do it in different sub-reddits or something, I'm still not sure. \n\nI have also met with the Judge now. Many were worried about how these posts might come back to bite me in the ass, legally speaking. The short answer is that they won't. The long answer is that because they're anonymous, there's technically no risk of defamation or \"slander.\" I've changed enough of the meaningless details and given everyone fake names. The posts aren't going to be relevant in the case, and I'm clear to keep writing them if I so choose, so long as I don't discuss the details of the actual case itself. Though I think the Judge would prefer I just stop writing these altogether, one of the reasons I may do so. \n\nWithout divulging the specifics, I went ahead and reported what I had learned, and all hell broke loose. I knew I had to do so, because Amy and Luke had changed gears after Jim passed. They began to make the case that Luke and I had always had an open marriage. That there could be no such thing as an affair, and any instances of Luke sleeping with Amy could not be counted against him. It is no accident that they chose to do this after we lost Jim. As far as I can tell, he was the only other person who knew about what Luke and Amy did, and would have done something about it. Now that they don't have to worry about that, I think they wanted to claim I always knew about the affair and that it was no true affair. When I didn't report them, they must have assumed I didn't know the truth, and they changed their story. But I knew. I reported it, and now they're fucked. \n\nWhich unfortunately means everyone else found out. There was no way the children wouldn't learn the truth through the grapevine. I told Sophie and Tom personally because I figured they would learn of it anyway. The others did. Tom was pretty shell shocked. I know I'm just the messenger, but I felt terrible and I wanted to comfort him, but there wasn't a whole lot I could do. Poor Kaylee did not handle it well. I'm told she had several meltdowns, and then tried to run away. I know she tried to run away because she came to our house for sanctuary. And literally, I had to give her back. I knew all the reasons I had to but I was sorely tempted to give the middle finger to all of them and let Kaylee stay with us against Amy's wishes. But no, I had to relinquish her and honestly...nothing has been harder than that was. I know it isn't my fault but I still feel like I betrayed her. \n\nSophie's also been dealing with a lot of anger toward her father, especially after he and Amy forced Kaylee to come back to stay with Amy again. All of this... It hit Sophie and Kaylee the hardest. Luke wanted to see Sophie again and she refused. She wouldn't come out of her room. Technically, I was supposed to let him see her, but she's fifteen years old. I told her to come out of her room, she wouldn't. So in my book, I tried. This was after Kaylee's incident so when Luke pressed me to force Sophie out of her room, I'm not proud to say I shouted at him to leave. My blood was boiling by that point. Throughout all this, my soon to be ex husband and his affair partner are still acting like I'm the bad guy. \n\nLuke and Amy are angry with me, and that's putting it lightly. They have no right to be but they are, or at least they're acting angry. I now have a restraining order against Amy because I was quite certain she would confront me after the fact, and she did. After I reported them, and before Kaylee came over, Amy came to the house while my kids were home, banged on the door and screamed. She was furious with me for what I had done. But I don't know what she expected me to do. I called the police, but Amy was gone by the time they showed up. They were just as useless as last time, to be honest. When Kaylee came to me for asylum, Amy came after her, but I wouldn't let her in until she called the cops herself. I would only let one of them take Kaylee, Amy was not setting foot in my house. I was very clear to explain the situation but it didn't matter. \n\nAmy later smeared me on social media and framed me as a kidnapper. I set the record straight without divulging too much about the circumstances of the situation, which I was tempted to do. Luke also gave me the lecture of a lifetime when I saw him, but I just kept cutting him off and spitting the facts in his face. I don't know if it's been my time away from him, but I'm learning to recognize his bullshit now where previously I fell for it every time. He always sounds so reasonable and sweet but what he's actually saying is often circular and evasive. Honestly, I am so angry with him for what he's done to his children, ALL of them. Kaylee especially. I want to adopt that girl. I know I can't, but I want to. \n\nCat and I had a long talk as well. So far as I can tell, she didn't know, and she's genuinely sorry for her earlier deception. Trust takes time to rebuild, but I also understand that she was in an awful position. But now that certain things have come to light, she's kind of in shambles herself, so I pity her. Not to mention, if Amy loses custody of her children, and she very well might, I'll need all the help I can get. I can't take all of them in, I don't have the space. Cat will need to do some of the leg work. So I'm trying to give her the chance to earn my trust back, sort of out of necessity.  I can't speak to the long term but if all goes as it should, Luke's not even going to be getting visitation of my kids. We'll know soon enough though, and it will be on record, if Amy's children were fathered by him. All I know is, they've always been quite certain Kaylee was, though they never had her tested. So far as I can tell, Amy hasn't really been intimate with anyone other than Luke for a long time. For the record, Cat is still supporting Amy financially, and by that I mean, she's supporting Amy's kids. I don't mind that. If Amy loses custody, that all goes away anyway. \n\nAs to the how and why of Luke and Amy getting together? From the letters, I've put the pieces together as best I could. Amy was sexually abused as a child and Luke was apparently the only person she felt \"safe\" exploring her sexuality with when they were in high school. It was a very bad idea and they both knew the reason it was a very bad idea well before they made that choice. As to the lie about them being \"surrogate siblings,\" apparently they always DID have that kind of relationship emotionally...but they also did this. After Tom was born (they also believe Tom to be theirs, going off the letters) the bond took on more romantic aspects as well. Amy describes Luke as \"my person\" and he says the same about her. I did read the letters in more depth for as much as it sickened me, I wanted to understand. \n\nI'm doing better overall, though. Personally, I'm doing better. Which makes me feel kind of guilty because nobody else is. My kids are miserable, which makes me miserable, but I know there's light at the end of the tunnel and I want them to see it. Luke and Amy are miserable, which, honestly...I'm not gonna say I'm glad about, but, I don't know what they were expecting. They've been playing a monstrous game for decades, it was always going to have consequences sooner or later. Amy's kids are miserable, especially Kaylee. I wish I could reach out to her again, but I absolutely can't except through Tom, and he needs to play this carefully. Cat is miserable too. We're all still reeling from the loss of Jim, and honestly the Kaylee incident really tore my heart in half...but I think I'm over the hump and am taking comfort in how I'm actually choosing myself for a change. \n\n",
  "created_utc": 1727567740.0,
  "score": 8013,
  "num_comments": 1693,
  "url": "https://www.reddit.com/r/offmychest/comments/1frrkv0/update_v_i_think_my_husband_fathered_his_best/",
  "comments": [
    {
      "id": "lpf5n8f",
      "body": "When you say report,  did you call the cops or just tell everyone in your circle that you weren't in an open marriage and that they are sibs?\n\n\nIs Luke still with his mom or are him and Amy just shacking up at this point?",
      "created_utc": 1727569399.0,
      "score": 938
    },
    {
      "id": "lpf2sae",
      "body": "You couldn't help what happened with Kaylee, but I get your pain. I'm so sorry you're going through all of this, and I wish you and the kids well.",
      "created_utc": 1727568256.0,
      "score": 1363
    },
    {
      "id": "lpf3ye2",
      "body": "I wondered if Jim's passing would embolden Luke and Amy. Well, at least now we know why they weren't super alarmed at the possibility of Tom and Sophie hooking up. So sorry for all of your losses, I hope the kids can recover in time.",
      "created_utc": 1727568729.0,
      "score": 846
    },
    {
      "id": "lpf4pye",
      "body": "OP, The explosion was inevitable, and you handled it as best you could, which was far better than most of us would be able to. \n\nDon’t take on blame that rests squarely on Amy and Luke’s shoulders. The darkness has been revealed and hopefully the necessary steps to healing can begin. \n\nPlease know that there are many of us hoping and praying for the best for you and the kids.",
      "created_utc": 1727569033.0,
      "score": 241
    },
    {
      "id": "lpf8hjo",
      "body": "You doing better *is* the light at the end of the tunnel. Understandably, the kids are having a rough time, but when they’re ready to start healing, you’ll be ready to help them through it. You’re so incredibly strong, OP 💜\n\nETA: have you considered writing letters to Kaylee and keeping them for a time when it’s safe to give them to her? I’m sure she must be so lonely and confused through this, maybe having those letters ready for her if/when the time comes will also serve as a light at the end of the tunnel for both of you.",
      "created_utc": 1727570515.0,
      "score": 217
    },
    {
      "id": "lpf7lrc",
      "body": "now we all wait for the true update once the case is over 👏 I think everyone just wants to know if they are half siblings at this point...but we may never know, and that's fine to!",
      "created_utc": 1727570172.0,
      "score": 475
    },
    {
      "id": "lpfskxu",
      "body": "Don’t forget that adult adoptions are a thing. You may be able to adopt Kaylee one day, and you may get your chance to tell her that. Even the expression of love might help her, since she’s lost so many people at once here. \n\nLuke must have been unbelievably frustrated to not be able to pull the wool over your eyes anymore. How funny to think of.",
      "created_utc": 1727578905.0,
      "score": 197
    },
    {
      "id": "lpf35oe",
      "body": "Thank you for the update. \n\nIf you are doing better, it is better for the children and Cat. Not that you can shoulder all of this burden, or should expect that of yourself. Based upon your previous updates, I suspect it would weigh on you in the future of you were up to doing all you could do. \n\nContinue to be kind to yourself and best of luck on this new leg of your journey!!",
      "created_utc": 1727568410.0,
      "score": 395
    },
    {
      "id": "lpf7hnc",
      "body": "I will forever ask myself why bring an innocent party into their spider web? They are gross vile human beings. All of this could have been avoided if he never bothered you to begin with. I'm happy you're doing better.",
      "created_utc": 1727570126.0,
      "score": 314
    },
    {
      "id": "lpfurcl",
      "body": "How does your son Owen feel about this? Has it changed how he feels about this father? I remember you saying he was quite upset when Luke was kicked out.",
      "created_utc": 1727579839.0,
      "score": 75
    },
    {
      "id": "lpj1mn8",
      "body": "Imagine thinking, \"It's really best Dad is dead, now we can lie about the woman I've screwed over for years and years and bring our disgusting selves out into public!\"  \n\n\nAlso, not sure how they thought the \"it's an open marriage\" would fly when Amy's meltdown at your house was on camera. \n\n\nYou should push for assault charges to be filed. Maybe if Amy gets charged, those kids can get out of that very unhealthy home. \n\n\nWhat does Cat say now that she knows and they are living together?",
      "created_utc": 1727634076.0,
      "score": 66
    },
    {
      "id": "lpf49q9",
      "body": "Wait are Luke and Amy possibly related?",
      "created_utc": 1727568854.0,
      "score": 179
    },
    {
      "id": "lpfw4ko",
      "body": "In this moment, my heart breaks for Cat. I'm not trying to minimize your suffering it just seems like you have a clear way forward. For Cat, losing a husband who kept a secret love child hidden, only to move that child into their home, and then discovering that the child had four children with their half-sibling. Never truly knowing the full extent of this madness until her husband, faced with his actions, dies of a heart attack. It's so wild. That poor woman being lied to for her entire marriage, too. I guess the apple doesn't  fall far from the tree.",
      "created_utc": 1727580471.0,
      "score": 214
    },
    {
      "id": "lpfxm5c",
      "body": "Knowing you’re half siblings and having sex is one thing. \n\nKnowing you’re half siblings, having sex, AND reproducing is insane. These two need to be studied.",
      "created_utc": 1727581161.0,
      "score": 102
    },
    {
      "id": "lpfi440",
      "body": "Didn’t Tom basically already know though? I thought he heard Amy & Luke when he would stay over?",
      "created_utc": 1727574442.0,
      "score": 53
    },
    {
      "id": "lpf6a4s",
      "body": "Ok, when will someone just say those two are half-siblings? This is nasty. Poor kids.",
      "created_utc": 1727569649.0,
      "score": 45
    },
    {
      "id": "lphc5ke",
      "body": "I know it’s a lost cause and everything is still fresh, but do you have any happy memories with Luke? Did you ever feel loved? Did you think he did love you or was it all false?",
      "created_utc": 1727612373.0,
      "score": 41
    },
    {
      "id": "lpitvh1",
      "body": "[deleted]",
      "created_utc": 1727631738.0,
      "score": 43
    },
    {
      "id": "lpmay33",
      "body": "so this luke asshole is living with Amy? are they remorseful ? you're only a prop they used to disguise their relationship with? does he claim to live you in court? are y'all getting church involved?.... will you update once case is over?",
      "created_utc": 1727682725.0,
      "score": 41
    },
    {
      "id": "lpndbnk",
      "body": "I feel like I missed something. Did we find out that Amy was Jim's affair child? And with whom? How are Luke and Amy related by blood. Sorry I just can't remember and it gets a little tough coming in late and the updates.",
      "created_utc": 1727704022.0,
      "score": 41
    },
    {
      "id": "lrhrp6b",
      "body": "Hope you & the kids are doing ok. You all have been in my thoughts. \n\nAlso hope Cat is doing ok. Does she have anyone staying with her or checking in on her. I know you have a lot on your hands & I can imagine how all this is probably a huge toll on her right now.",
      "created_utc": 1728691091.0,
      "score": 42
    },
    {
      "id": "lpfl9fo",
      "body": "How is Tom doing with all of this? Those poor kids. All of the kids will be massively damaged from this but Amy’s kids will be disgusted, embarrassed and humitiated. amy and Luke are awful people. I hope karma hits them as hard as it should considering all of the lives they’ve f’ed with.",
      "created_utc": 1727575756.0,
      "score": 112
    },
    {
      "id": "lpg5n2n",
      "body": "It's been a wild ride but this is a good final update. I don't think there's much left to tell; the next chapter is about OP moving on with her life, sans drama.\n\nThe only update I'd care for :\n\nOnce the paternity tests are in, is which of Amy's kids are Luke's.\n\nIf OP ever gets any of the money Luke sent to Amy over the years back as part of the legalities.\n\nThe phat child support Luke will be paying OP from now on- if he'll agree or if his wages end up getting garnished 🙂 and whether OP will indeed get to keep the house just because Luke was never on it. \n\nWhat legal repercussions Luke + Amy face. Fines, jail time, custody. \n\nAside from my schadenfreude towards those cheaters, obviously the least disruptive result would be for Jim to have been lied to about Amy's paternity and that the kids can at least have the relief of coming from a 'merely' immoral affair rather than a much more disgusting incestuous affair. Luke and Amy can live unhappily ever after while their kids are at least less impacted, until they reach adulthood and can finally cut off ties now that they've seen all the pain their parents were willing to inflict on them and others. As it is, I wish OP all the best. Though I'm an internet stranger who is easily entertained and words are cheap, I admire a heroine who models poise, clarity, and strength that I would certainly never have been able to showcase in the same position. Celebrate all the wins. Pop some champagne when the divorce officially goes through; when Tom reaches adulthood; when you have little break throughs in therapy. You've done well.",
      "created_utc": 1727585232.0,
      "score": 34
    },
    {
      "id": "lpgb830",
      "body": "I know you said you would step back from this for a while but when it’s all said and done, will you please update us all on the still missing details? (After the legal stuff is done?) Just for closure for us who are completely invested and hoping things work out in your favor? You deserve the longest vacation after all this bull and stress! ❤️",
      "created_utc": 1727588427.0,
      "score": 37
    },
    {
      "id": "lpffpuz",
      "body": "For those who don't know OP did confirm in a comment of a previous post once that the cheaters are half siblings. Now I'm way too lazy to search OPs commenting history, also I don't know if they deleted that comment or not, also I think it's better to leave it on the air as a rumor than a proven thing, for legal reasons. But for those of you who are still curious and missed the comment yes, sweet home Alabama.",
      "created_utc": 1727573445.0,
      "score": 182
    },
    {
      "id": "lpf64fd",
      "body": "Wait, Amy could lose custody of her children ? What did she do. You hinted she and Luke did something bad but I assumed it was being half sibling with Amy being the affair daughter of Jim, but it doesn't warrant a removal of custody.\n\nIt's obvious you don't want to talk about that specific so I won't ask. But I have to admit I am very curious ...",
      "created_utc": 1727569587.0,
      "score": 99
    },
    {
      "id": "lq93pya",
      "body": "Has the court taken DNA tests on all the children or just Amy's? \n\nI feel the worst for the kids - all of them. No matter their parentage, they are victims and don't have the maturity and tools to deal with it all. I sure hope Kaylee is getting the help she needs. Are Amy's kids getting counseling? \n\nWhat they did to OP is and was horrible, but OP sounds like a smart, resilient woman who is going to therapy to help her. She sounds like she'll bounce back.\n\nKeep on truckin', OP. 😊",
      "created_utc": 1728015354.0,
      "score": 50
    },
    {
      "id": "lpf3ebg",
      "body": "[deleted]",
      "created_utc": 1727568506.0,
      "score": 67
    },
    {
      "id": "lpfofjg",
      "body": "I can't wrap my mind around the question of... why would Luke bring you into this messy situation? Why did he date and marry you when he was already involved with Amy? Why do that to you? Why use you if she was \"his person\" (yuck!), literally a partner in crime? He could have remained single and had this secret relationship. Was he trying to prove to his family that he moved on from whatever they had or was he trying to convince his parents that he didn't father her children by getting married to someone else? Then again the children are around the same ages, but I just do not understand why the double life... Whatever law they broke together, why did Jim hold it secret from everyone? Did they do this as teens or more recently? Why didn't he tell you? There is so much that you were in the dark about that Jim could have shed light on and didn't. Even if it was the true twisted nature of his son.",
      "created_utc": 1727577100.0,
      "score": 22
    },
    {
      "id": "lpheiq1",
      "body": "TLDR —- OP just found out that her husband Luke has two families; OP’s and a family with affair partner Amy.\n\nLuke and Amy are allegedly half siblings, both being fathered by Jim. Jim is OP’s FIL. Amy is allegedly Jim’s affair child.\n\nCat, Jim’s wife, admitted she lied about negative children’s DNA test results to protect her marriage/legacy. The kids paternity is still uncertain.\n\nThe emails indicate that Luke and Amy are aware that Luke is the father of at least some of Amy’s children (they referred to Amy’s children as “our children”).\n\nAmy’s children are allegedly fathered by Luke or possibly Jim (Amy’s biological father)?????\n\nConjecture here: there’s likely going to be court ordered paternity testing as a result of legal proceedings and “other allegations”.\n\nOMFG. I feel horrible for everyone involved except Luke and Amy. Everyone needs therapy. \n\nEdit: I mistakenly switched names Tom and Jim, it’s now fixed above. Reposted this to main thread.",
      "created_utc": 1727613544.0,
      "score": 21
    },
    {
      "id": "lpjqdsm",
      "body": "> When I didn't report them, they must have assumed I didn't know the truth, and they changed their story\n\nKinda strange their assumption. Amy attacked you to get the documents deleted. They should have known that you still had all the information",
      "created_utc": 1727641748.0,
      "score": 21
    },
    {
      "id": "lqpl7ns",
      "body": "Was Amy ever married in all of this? I’m trying to figure out since you all were friends for several decades who she said the father was of the kids? Just curious. Wishing you all the best of luck in a horrible situation. ",
      "created_utc": 1728264070.0,
      "score": 21
    },
    {
      "id": "lpf48i2",
      "body": "I'm glad you're standing up for yourself and not duped anymore. Hang in there.",
      "created_utc": 1727568840.0,
      "score": 39
    },
    {
      "id": "lpixwck",
      "body": "I am very sorry for you and all of the kids involved. Especially Cat too. Its so dumb to me that the cops are doing nothing, HOWEVER i see CPS is a potential option? She tried to attack you infront of your kids. That shows shes not stable and CPS might want to know that. Either way good luck on that front, and i hope you and Cat are able to rebuild your relationship so co-parenting the kids can go well. \n\nOn a side note, im not sure you can mention this for legal reasons, but are you suing Amy or Luke personally for fraud, emotional damages and for taking and using marital assets? Because anything your marital assets went towards is also your legal property right? Not to mention any money that went towards the kids too.  It may be different state per state though. \n\nAgain, i am so sorry you and everyone (except Luke and Amy) are going through so much anguish. Good luck, and heres to hopefully being on the easiest road there could be in this situation to recovery! You are strong! You are a great mother to your kids, and kids who arent yours! You got this!",
      "created_utc": 1727632937.0,
      "score": 18
    },
    {
      "id": "lpfn5kn",
      "body": "Sounds as though it’s easier to blame you than themselves, a common tactic of weak people. The mental gymnastics required to do that must be huge. I’m hoping legally you can protect your children from them in the future, though sometimes the courts can facilitate the harmful parent to continue to harm the children. \n\nI hope you are able to let Kaylee know that even though you were obligated to give her back right now, that she always has a safe space with you and her children. This could be immensely valuable to her when she’s able to voice her own choices, as Sophie is. The fact that you are able to push your own hurt aside and put children who aren’t even yours first is beautiful and I think it’s clear Kaylee recognises this already.\n\nRE: getting a restraining order against Amy, did you end up showing the police the photos/video you have of the attack and the aftermath? I recalled you didn’t but couldn’t tell if what you were reporting was The Very Bad Thing or the attack… if not, please consider doing so. I worry about this woman’s mental stability.\n\nI do hope you update, but understand if you don’t.",
      "created_utc": 1727576554.0,
      "score": 17
    },
    {
      "id": "lpg8ekz",
      "body": "[deleted]",
      "created_utc": 1727586776.0,
      "score": 17
    },
    {
      "id": "lpfb0wg",
      "body": "OP, you might feel guilty, but i’m honestly glad that at least you are feeling better. so that you can be there for your kids. \n\nit’s awful what Luke and Amy has done. they will reap what they sow. i’m glad you are no longer deceived by them and will be able to lead a happier life. like you mentioned, there is light at the end of the tunnel. i really hope it’s not that far away and the kids, yours and amy’s, will be able to see it soon. \n\nwishing you nothing but the best. take care.",
      "created_utc": 1727571527.0,
      "score": 33
    },
    {
      "id": "lpfc7z8",
      "body": "I'm not a religious man, but I'm praying you come out very much on top with the very best results.\n\nMy sympathies to the kids is all I can offer",
      "created_utc": 1727572015.0,
      "score": 48
    },
    {
      "id": "lpfh5n1",
      "body": "When you say everyone else found out, you mean like people in the community like neighbors and stuff or just you guys? \n\nKaylee's meltdown: Am I to understand that she knows about the incest or is she just having a meltdown finding out that Luke was her dad all along? \n\nIf it's about the incest, does that mean all the children, even the very young ones, not only know that Luke had two families but one was with his half sister? \n\nOP, I pray you and the kids can find peace. All my love 💓",
      "created_utc": 1727574043.0,
      "score": 48
    },
    {
      "id": "lpg0i9e",
      "body": "I am glad you're feeling a bit better and mentally stronger, Im sure all of the kids really need that from you right now. Luke and Amy have spent years making excuses in their minds and lying to themselves about the situation and its consequences, so they have brainwashed themselves into really believing they aren't the bad guys, so you must be.  Or anyone else must be the bad guys... I wonder if they'll ever snap out of their delusions. Regardless though, I am glad you brought the truth to light- because they were going to rip you apart in court if you didn't know and Jim's gone now and wont be able to set the record straight.\n\nHang in there",
      "created_utc": 1727582553.0,
      "score": 18
    },
    {
      "id": "lq21hyo",
      "body": "Amy & Luke basically “cersei and jaime” literally.\n\n(Game of thrones reference for those who don’t know)\n\nEdit. In terms of relation, but also incest love and extreme passion and thinking its appropriate while still hiding it. Since literally people are not getting the reference.",
      "created_utc": 1727911671.0,
      "score": 16
    },
    {
      "id": "lpfmmsm",
      "body": "When my grandfather passed it really allowed my abusive father to not hide his true nature anymore he then went full abusive toward his own mother. I would expect the same from Luke.",
      "created_utc": 1727576330.0,
      "score": 14
    },
    {
      "id": "lq4dtdf",
      "body": "Why did he even marry you?",
      "created_utc": 1727955564.0,
      "score": 32
    },
    {
      "id": "lpfbfj5",
      "body": "[deleted]",
      "created_utc": 1727571689.0,
      "score": 97
    },
    {
      "id": "lpfofpo",
      "body": "When you met with the judge, who was in the room with you?",
      "created_utc": 1727577102.0,
      "score": 21
    },
    {
      "id": "lpgk29y",
      "body": "This is the best saga on all of reddit right now",
      "created_utc": 1727594053.0,
      "score": 21
    },
    {
      "id": "lpgfmat",
      "body": "If this is real (sorry, but I have to question everything I read on this site), you are one of the strongest women I've read about on this site. No one should have to struggle with the horrid things these people, who should be the people who have your best interest, do to you and those you love. The strength of your character shows in how you've handle everything they've done to you and everything that's happened to you. I hope and pray that you are rewarded for the sacrifices you've made. You deserve the absolute best this life has to offer. Good luck with the divorce and everything connect with it.",
      "created_utc": 1727591159.0,
      "score": 8
    },
    {
      "id": "lq4iywy",
      "body": "can anyone explain further to me why Kaylee was so singled out? is it because of the genetic disease factor or did something else happen? i read she ran away I was just curious as to if something specifically happened to her in all this",
      "created_utc": 1727957933.0,
      "score": 18
    },
    {
      "id": "lpfxpgo",
      "body": "Welcome back to days of our lives; staring Luke, Kaylee, Amy, Sophie and Tom. Of course Jim who was killed two episodes ago. \n\nIn finals Luke and Amy were exposed in their affair and kids were exposed in their possible incest or child relationship. \n\nAs OP comes to her final scenes we at Days of our lives wish the best for their future endeavors",
      "created_utc": 1727581205.0,
      "score": 51
    },
    {
      "id": "lpfszys",
      "body": "OP, I think you should have called the police and pressed charges when you were assaulted. Might have helped you get an order of protection against Amy. I am sorry you are dealing with all of this.",
      "created_utc": 1727579092.0,
      "score": 7
    },
    {
      "id": "lpq5a9r",
      "body": "I don’t want to see the children severely punished for their parents horrible decisions  but they will pay for their parents mistakes. This is the saddest part.  When child protective services come in those kids may well end up in foster care and separated from their siblings. The older ones could get out of it this but the younger ones may have to live in the foster care system for a while. The foster care system can vary in quality from state to state. \n\nThat is a very bad punishment to have to  face for your parents crimes. The parents will get out of jail one day but the children will suffer the scars of all of it and get separated from their family. \n\nI understand the OP for posting but I hope these posts don’t hurt the children’s chances of escaping the foster care system. Why punish them when the parents are truly the bad people.\nThere is no justice in that…",
      "created_utc": 1727736873.0,
      "score": 7
    },
    {
      "id": "lpf4pkf",
      "body": "I’m sorry you are going through all of this. Hopefully, Luke won’t get visitation so you never have to see him.",
      "created_utc": 1727569029.0,
      "score": 21
    },
    {
      "id": "lpg8iwx",
      "body": "They deserve to have this all crash down on them. They have ruined multiple lives with their bs. Why not just be a couple from the get go or the birth of thr first fucking kid who was around before you married him! People like those two dont care about the damage they do unless they pay a price ",
      "created_utc": 1727586845.0,
      "score": 6
    },
    {
      "id": "lpgcdbp",
      "body": "🤗 hugs.\n\nI don’t understand why Luke would date and then marry you if he had Amy?  If they’ve been together since they were kids.   You were an innocent party on all of this.  \n\nI still can’t get over how they don’t think what they have done is wrong.  What is wrong with Amy and Tom ? \n\nAre Amy’s kids getting therapy? Would group therapy help with all the kids? \n\nDo you think getting the paternity tests/DNA tests now would help the kids ?",
      "created_utc": 1727589117.0,
      "score": 6
    },
    {
      "id": "lpg8kgn",
      "body": "This sounds like a telenovela lol",
      "created_utc": 1727586871.0,
      "score": 28
    },
    {
      "id": "lpfe53w",
      "body": "Wow! The things you have had to slog through in the past 6 weeks. In the state I live in Amy could be sued for alienating affection in your marriage.  I’m just vengeful enough to want to make her suffer in every way possible.   Good luck to you and your children. You have many hills to climb before you are all through this mess.",
      "created_utc": 1727572794.0,
      "score": 12
    },
    {
      "id": "lq214z0",
      "body": "What in the VC Andrews?",
      "created_utc": 1727911533.0,
      "score": 6
    },
    {
      "id": "lrzj5t5",
      "body": "I wish we could get another update .... it's been 16 days :(",
      "created_utc": 1728963179.0,
      "score": 6
    },
    {
      "id": "m6k8ud8",
      "body": "And OP's account is suspended. Shocking.",
      "created_utc": 1736595112.0,
      "score": 6
    },
    {
      "id": "lpf5757",
      "body": "Stay strong OP. I admire you for still having the heart to look out for Amy's kids. I hope your kids will be okay.",
      "created_utc": 1727569220.0,
      "score": 10
    },
    {
      "id": "lphnnos",
      "body": "nice let me know when u write ur next novel.",
      "created_utc": 1727617508.0,
      "score": 9
    },
    {
      "id": "lpg4xij",
      "body": "You doing better is definitely better for your children. The more that comes out, the more the children will need you. Not just yours, but Amy's as well. I hope you're able to find a little solace in knowing Luke and Amy are getting everything they deserve for ruining so many lives. I don't see how these children will ever forgive them.\n\nI hope writing this has been therapeutic for you. This has been great to read, but also sad because your world is crumbling around you. If you come back, we'd love an update. If you decide not to, we respect that, wish you all the best, and appreciate what you did share with us.",
      "created_utc": 1727584848.0,
      "score": 4
    },
    {
      "id": "lphefhc",
      "body": "All things considered, you sound like you are doing really well. I don't know how I would be able to be even half as strong as you have been throughout this whole ordeal. I just wanted you to know that I totally think you are badass and a true inspiration to not only your kids, but other women who have been lied and deceived to. \n\nAs far as Cat goes: it isn't a horrible idea to have some support that's family throughout what you have to deal with in the future. She completely broke your trust, and I agree it needs to be earned back. Maybe some therapy with the two of you so she can truly come to realize how she hurt you and what it would need to look like going forward would be a good idea. \n\nAs far as Kaylee: I don't quite remember her age range. But hopefully if she is upper teens she will be able to get away soon. The best thing you can do for her is be a kind, safe, loving place she can turn to whenever she needs help or a trusting ear. As someone who struggled with my home life growing up, the thing that got me through it was having friends parents I was really close to that I could just talk to and open up about everything with no judgement. They let me feel and express what I needed to and I felt safe. \n\nAs for the children: I know they seem miserable right now. But the most important thing to remember is that you didn't do this to them, and there is nothing you can do to magically fix it for them. Being there for them, getting them help when they need it, and being the kick ass rockstar mom you are, is the important parts. They may never forgive their dad, and they may have scars to carry through life because of this. But you didn't cause this pain for them. And you are setting an amazing example of what a great person should be to get through and showing how to pick up the pieces. \n\nAs for Luke and Amy: the best thing you can do for to them is just speak the truth. All the lies, deceit, and harm they have caused the people closest to them, will have to be their burden to carry. You don't have to wish bad for them, just wish them the karma a life they deserve. You are 10 times the person either of them could ever wish to be. I always believe that what you put into life, is what will come back to you. \n\nMost importantly, if you never update again: I hope you find peace and end up having an amazing life filled with love hope. Even though it feels like you are drowning right now, you will definitely make it through this. You are such a great aspiration for the kind of person everyone should strive to be. And the love and respect your kids will have for you will be more than you will ever need. I hope things get better soon .",
      "created_utc": 1727613500.0,
      "score": 6
    },
    {
      "id": "lpl47xq",
      "body": "About the open marriage and you knowing about the paternity of the kids, I would have asked if this is common knowledge then why don’t Amy’s kids know Luke is their father? Why doesn’t Amy’s kids have Luke’s last name? Why isn’t Luke on Amy’s kids’ birth certificates? His lawyer can’t be stupid enough to believe the open marriage lie if all of these questions are not answered.",
      "created_utc": 1727660079.0,
      "score": 5
    },
    {
      "id": "lq8m4f3",
      "body": "JFC I hope you get a Hefty hallmark movie deal out of this when it’s all done and said & take that money and the kids (ALL of them!!) & get the hell out of dodge!!",
      "created_utc": 1728007847.0,
      "score": 6
    },
    {
      "id": "luszkdx",
      "body": "Came back here after the latest update. I STRONGLY suspect they had this as a back-up plan from the beginning. A set up if you will. You Get drugged and assaulted and pregnant. They arranged this all this time ago so in the event their secret was out, they could say some off the wall stuff and everything would go their way in the divorce. I mean they thought they were half siblings and continued to boink each other so this isn't too far off track (at least in my opinion). That's the only reason he married YOU instead of Amy...because of appearances. (Omg he is married to his HALF SISTER! *gasp*, (yes I do believe it is wrong on all levels)) \nI hope I'm making sense here. \nI do wish you well and I hope you come out of this with a sense of how strong you really are because damn this is...a lot.",
      "created_utc": 1730431405.0,
      "score": 5
    },
    {
      "id": "lpf5dt9",
      "body": "I’m really sorry how things turned out… once everything is settled and there’s no more legal matters to deal with (divorce is finalized), you should confirm the horrible secret. Cause you know we’re all dying to know (although I think we already know).",
      "created_utc": 1727569294.0,
      "score": 12
    },
    {
      "id": "lpg36sj",
      "body": "I know this might be way off base. And you probably shouldn't confirm or deny this. Is Amy abusing Kaylee? Like, because of jealousy?  If she has no problem sleeping with her half-brother, then she's going to be in the mindset that anyone can do it. No matter the relation.",
      "created_utc": 1727583940.0,
      "score": 16
    },
    {
      "id": "lpg555o",
      "body": "Whether this is real or not, you have a good manuscript here. I can see someone writing a solid screenplay that would interest the Lifetime network. They could do a miniseries or a series with it,  depending on the strength of the characters. You'd need to add the usual abused woman to fit with their brand, but other than that, it looks good. \n\nKathy Bates could play your MIL",
      "created_utc": 1727584962.0,
      "score": 11
    },
    {
      "id": "lpfaqsx",
      "body": "Why might Amy lose custody of her own kids because of your divorce? She didn’t abuse them unless I forgot certain details.\n\nI’m also keen to see how Jim’s inheritance is distributed.",
      "created_utc": 1727571415.0,
      "score": 7
    },
    {
      "id": "lpg4y8m",
      "body": "So are luke and Amy half siblings?",
      "created_utc": 1727584859.0,
      "score": 4
    },
    {
      "id": "lpg5aoy",
      "body": "i’m so sorry op, i really hope you and your kids recover from all of this, especially sweetheart kaylee, i understand how you feel, this can’t be easy for you or your kids especially, losing someone you loved is so hard especially when you find out this way, sophie and tom are soldiers for remaining by your side, even when they’re going through their emotions. please make sure you’re there for your kids, and try and confide in sophie, not a lot but just girls day you know? even though you may be in a hurricane, there will always be a rainbow and clear sky after. everyone in the comments is sending their love and support, especially with amy’s past. the one thing i don’t really understand is why they couldn’t have just stayed friends with you while they did what they did, or why they couldn’t have gotten together instead of they considered each other “their person” i can’t even imagine how sick that must’ve made you feel. we are sending every ounce of our hearts to you, and we all hope the divorce and any other legal proceedings that need to be done are health with, if you haven’t, please consider a restraining order against amy and luke, amy specifically. after her getting physical with you, you have enough evidence for even something temporary before you get something permanent. wishing you nothing but love, peace, and support 💘",
      "created_utc": 1727585046.0,
      "score": 3
    },
    {
      "id": "lpge77d",
      "body": "Edit: sorry for the novel!!\nThank you for the update and I’m glad you and the children are getting therapy! \n\nThem saying you knew because of open marriage wouldn’t change the fact they are related! I really am disgusted by them and I hope the consequences on them both will include therapy because there’s something wrong in their heads to think what they did is ok! I do understand your feeling of betraying Kaylee and my heart breaks for her, you, all the children and Cat. But you didn’t betray Kaylee, you are the only person who haven’t lied to her for years and this too was something you were honest about! \n\nIt is definitely not your fault but Amy and Luke’s!! They were the ones that kept the paternity hidden from the children and also the fact they and your children are related in more ways. \n\nSophie is pissed off, the two people doing the hurt continues to do so! They can act angry and hurt all they want!! They are just pissed their “perfect happy family life” is in shambles and all because of themselves!! I totally understand why she doesn’t want to see him!! \n\nAmy seriously needs therapy and Luke too!! They are still claiming to be the victims rather than just f*** own up to their disgusting actions! I hope all the children are taken from them. Cat might not be allowed to take them since she is getting older (not sure about the rules where you are) but maybe with help she will be granted custody. \n\nI think Cat realized that her image of her son and Amy would be shattered and that she couldn’t face the truth with the results (I’m only thinking the affair) but that all shattered when she realized the magnitude of it all!! Trust takes time and I do hope you and Cat’s relationship will heal because I think you two are going to need each other! \n\nDid he ever tell you why he married you or was his reasoning only the fact he could never be with Amy? \n\nIt’s only good you are doing better because the children needs you more than ever and I know you are one strong woman but you can’t give your best if you are not in a good or at least a better place than those that needs you! It’s like they say during safety before takeoff on the plane, you need to help yourself first before you help others. It sounds mean but it’s not!!\n\nDid you get in contact with friends because I think you are going to need emotional support! \n\nYou my dear has handled everything with so much grace and dignity and with a lot of care for all people involved even those two who shouldn’t have it!! \n\nUpdate when you can, want and have the strength to do so.\n\nHugs from a total internet stranger!!",
      "created_utc": 1727590259.0,
      "score": 4
    },
    {
      "id": "lpgi4gy",
      "body": "Read the states that have the highest imprisonment, I really hope you're in one of those. If you're, Luke and Amy's game will literally end their whole life. There's a punishment of max 50 yrs. No wonder they went to this cruel length to hide their affair.",
      "created_utc": 1727592795.0,
      "score": 4
    },
    {
      "id": "lpgu108",
      "body": "Girl, I'm so sorry about all this, like everything since post 1. I've been following and waiting for updates. I love that you are in the space to see that you need to choose yourself first as things progress from here on. Do give an update after all the proceedings are done. I wish you and your lovely children well 🤗 I also wish well on Amy's children as they didn't choose to be a part of this charade.\n\nMay peace be your portion as you navigate this tough time. Sending you love and hugs 💕 🤗",
      "created_utc": 1727600918.0,
      "score": 2
    },
    {
      "id": "lphnupo",
      "body": "I’ve been here since the first post and i still can’t understand why they didn’t just get together. Why pull innocent OP into their mess and ruin her life? why waste so many years of her life when they clearly want to be together?",
      "created_utc": 1727617586.0,
      "score": 4
    },
    {
      "id": "lpwhsvn",
      "body": "I’ve been following this post since day 1.  I cannot believe how it has spiraled.  You’re doing the right thing by bringing it to a head.  I can’t even imagine what the horrible thing is that you won’t share on here because what you have shared about them is pretty damn horrible.  \n\nI wish you and all the kids peace and comfort throughout this ordeal.  Luke and Amy can go kick rocks.",
      "created_utc": 1727829316.0,
      "score": 4
    },
    {
      "id": "lpwvpi4",
      "body": "Is there any indication why Luke and Amy decided to have all these children, when they knew they were siblings??",
      "created_utc": 1727834476.0,
      "score": 4
    },
    {
      "id": "lrvnzb5",
      "body": "OP, I understand you can not give us any additional info due to court case, but could you let us know how you are doing? I think of you often and hope you are getting the love and support you need to get through this mess. \n\nSending you positive energy and thoughts <3",
      "created_utc": 1728915666.0,
      "score": 4
    },
    {
      "id": "ltvp0xi",
      "body": "Any updates? Sending love and prayers to you and your family",
      "created_utc": 1729963829.0,
      "score": 4
    },
    {
      "id": "luded36",
      "body": "How are you all holding up?",
      "created_utc": 1730219414.0,
      "score": 3
    },
    {
      "id": "lx3anwn",
      "body": "Did I miss any indication as to why they never became an official couple and why Luke has lived this double life with OP",
      "created_utc": 1731594749.0,
      "score": 3
    },
    {
      "id": "lpf61d7",
      "body": "I went through legal channels, not social. \n\nAs of now, he's staying with Amy. But I don't believe it's going well. Her children aren't happy with him. Or with her.",
      "created_utc": 1727569554.0,
      "score": 1211
    },
    {
      "id": "lpfc0ql",
      "body": "My heart hurts for the children. They are innocent but they pay the most.",
      "created_utc": 1727571932.0,
      "score": 341
    },
    {
      "id": "lpf882e",
      "body": "That's what I tell myself. It doesn't help much.",
      "created_utc": 1727570415.0,
      "score": 550
    },
    {
      "id": "lpg2ern",
      "body": "[removed]",
      "created_utc": 1727583527.0,
      "score": 34
    },
    {
      "id": "lpgdc6r",
      "body": "I've been following this since the first post, but I think I may have missed something.  What actually happened?  Why couldn't/didn't Amy and Luke just be together and be a normal couple?",
      "created_utc": 1727589715.0,
      "score": 156
    },
    {
      "id": "lpfd8vg",
      "body": "They could have been good parents but also be hypocrites... Considering everything ",
      "created_utc": 1727572432.0,
      "score": 88
    },
    {
      "id": "lpf89tl",
      "body": "Thank you.",
      "created_utc": 1727570434.0,
      "score": 98
    },
    {
      "id": "lpfeybs",
      "body": "A very good idea, thank you.",
      "created_utc": 1727573129.0,
      "score": 141
    },
    {
      "id": "lpf835j",
      "body": "Legally I'm not supposed to answer that question but I am very aware that many people are asking it, don't worry.",
      "created_utc": 1727570361.0,
      "score": 477
    },
    {
      "id": "lpg1nyh",
      "body": "Half-siblings or first cousins.",
      "created_utc": 1727583141.0,
      "score": 12
    },
    {
      "id": "lpfz0y7",
      "body": "Thank you, you are absolutely right.",
      "created_utc": 1727581828.0,
      "score": 122
    },
    {
      "id": "lpf86sx",
      "body": "Thanks, kind stranger.",
      "created_utc": 1727570401.0,
      "score": 132
    },
    {
      "id": "lpf7zla",
      "body": "They figured one of them should find a stable long term relationship but Amy didn't want to be the one to do it. \n\nI suspect they chose me because they expected me to make money in the future/they could tell straight away I was gullible. \n\nOr maybe Luke's claims that he loves me have at least some kernel of truth to them. Don't know. Don't care.",
      "created_utc": 1727570323.0,
      "score": 438
    },
    {
      "id": "lpfyrub",
      "body": "He doesn't really understand the extent of what's going on, so far. He will come to grasp it more thoroughly in the days to come, I'm sure, and we will all stand by him. As it stands, he knows Luke has essentially \"left\" me for Amy, and that's upset him for sure.",
      "created_utc": 1727581706.0,
      "score": 148
    },
    {
      "id": "lpmdqp8",
      "body": "She believes me. I showed her the proof. She's pretty shell shocked.",
      "created_utc": 1727684781.0,
      "score": 79
    },
    {
      "id": "lpf59mc",
      "body": "Based on the other posts and OP's comments on them, there is a strong possibility that Amy is Jim's affair child. That would explain why he was so adamant on helping a \"non-family\" member in the way only a parent would. Cat obviously suspects the same thing which is why she didn't actually send the DNA tests in. She suspects but doesn't know for certain. And if the results come back that the kids are related, she has damning proof that her marriage was built on a lie.",
      "created_utc": 1727569248.0,
      "score": 592
    },
    {
      "id": "lpf5cg4",
      "body": "Only thing that makes any sense right now is that Amy and Luke are half siblings, if they could not legally marry and they knew exploring sexually as teens was not okay and a bad thing for them to do. I legit can’t think of anything else",
      "created_utc": 1727569278.0,
      "score": 180
    },
    {
      "id": "lpf68ec",
      "body": "[deleted]",
      "created_utc": 1727569630.0,
      "score": 123
    },
    {
      "id": "lpf64ac",
      "body": "I think they are siblings, maybe half siblings.",
      "created_utc": 1727569586.0,
      "score": 36
    },
    {
      "id": "lpffv6h",
      "body": "OP comfirmed in a comment of a past post. I'm way too lazy to search and maybe the comment has been deleted, but I did read it freshly posted maybe a week or more days ago.",
      "created_utc": 1727573506.0,
      "score": 24
    },
    {
      "id": "lpf5dzj",
      "body": "if you read between the lines more you’ll get your answer",
      "created_utc": 1727569295.0,
      "score": 27
    },
    {
      "id": "lpfyjl7",
      "body": "Cat is definitely going through a lot, and she's always been a good MIL to me and grandma to my kids, so I want us to get past this. I can only imagine how lonely she feels right now.",
      "created_utc": 1727581597.0,
      "score": 217
    },
    {
      "id": "lpijbv9",
      "body": "I’m curious about how Luke and Amy found out they were siblings…then all of them just kept that secret from Cat?",
      "created_utc": 1727628506.0,
      "score": 3
    },
    {
      "id": "lpg8tyn",
      "body": "People in their situation would have moved far from anyone who knows them or their sibling relationship. So not only did they stay near their father, commit incest but also had children, lol. \n\nSelf-destructive combines with so much more. They really are behavioral psychologists' wet dreams.",
      "created_utc": 1727587021.0,
      "score": 34
    },
    {
      "id": "lpjiv20",
      "body": "There's more!\n\nThey knew they were half siblings and had sex.\n\nThey knew they were half siblings, had sex, and reproduced.\n\nThey knew they were half siblings, had sex, reproduced, and then were willing to let their children have sex so their secret didn't get exposed!",
      "created_utc": 1727639447.0,
      "score": 11
    },
    {
      "id": "lpfkl5i",
      "body": "He knew they were sleeping together and that Luke was likely his father.\n\nBut there are other things they did that I can't really talk about that he didn't know.",
      "created_utc": 1727575472.0,
      "score": 142
    },
    {
      "id": "lphitea",
      "body": "Oh, loads. We were happy, or at least I thought we were. I certainly felt loved. \n\nI have no idea how much of it was real to him.",
      "created_utc": 1727615488.0,
      "score": 115
    },
    {
      "id": "lpmdvuk",
      "body": "Initially, he did. He tried very hard, I ignored all of his messages. \n\nBut I believe he's since realized our marriage is damaged beyond repair, that I'm not coming around, and so he's switched all of his attention to Amy. \n\nSo far as I can tell, Cat was clueless.",
      "created_utc": 1727684887.0,
      "score": 96
    },
    {
      "id": "lpmboic",
      "body": "Yes. \n\nNo. \n\nSeemingly, yes. \n\nNo. \n\nNo. \n\nYes.",
      "created_utc": 1727683263.0,
      "score": 116
    },
    {
      "id": "lpnaexe",
      "body": "Children can be cruel. Once this gets out, and becomes public knowledge, other kids will come for yours and Amy’s kids. They will be subjected to bullying and teasing. You might have to move, change schools at the least. Amy and Luke are both very selfish people. They should be ashamed of themselves ( their obviously not but they should be)",
      "created_utc": 1727702888.0,
      "score": 4
    },
    {
      "id": "lppx3gx",
      "body": "Amy's mother was one of Jim's students. (He was a Professor.) Luke and Amy are half siblings.",
      "created_utc": 1727733934.0,
      "score": 202
    },
    {
      "id": "lrka7ij",
      "body": "She and I talk every day.",
      "created_utc": 1728739922.0,
      "score": 77
    },
    {
      "id": "lrlezms",
      "body": "Same with me. I include them in my prayers and send them positive vibes/thoughts randomly throughout my day. She, nor the children deserved to be involved in this debauchery.",
      "created_utc": 1728754173.0,
      "score": 6
    },
    {
      "id": "lpfllki",
      "body": "Not well. Apparently he won't talk to Amy or Luke. They blame me for that too. \n\nI'm pretty sure he's going to come stay with us the second he hits eighteen. Though he might stick around to look out for Kaylee.",
      "created_utc": 1727575896.0,
      "score": 211
    },
    {
      "id": "lpkg94q",
      "body": "I definitely need to know if Luke and Amy end up serving time, and also what will happen to their kids, poor things.",
      "created_utc": 1727650691.0,
      "score": 6
    },
    {
      "id": "lpfkuay",
      "body": "This is the most common theory and I hesitate to confirm it but maybe it doesn't even matter at this point, I don't know.",
      "created_utc": 1727575579.0,
      "score": 189
    },
    {
      "id": "lpglght",
      "body": "Amy doesn’t want it know that she’s a brother f@#ker! 😂",
      "created_utc": 1727594983.0,
      "score": 15
    },
    {
      "id": "lpg1st1",
      "body": "Amy and Luke are half siblings. Amy is Jim’s affair child. Amy and Luke are having an incest relationship which has apparently been happing for YEARS, they for sure have 1 child out of this relationship (Kaylee) she has the same allergy as Luke… once the dna has been fully tested and if it is confirmed that they did this horrendous thing (incest) this is grounds for the legal system to take action and throw them to jail for a few years and remove child custody. Which they fully deserve. I’ve been following OPs posts from the first time she posted, and I want to say you go girl! You’re blossoming into a brave and courageous woman, love that you’re finding your voice 🥹👏🏽",
      "created_utc": 1727583208.0,
      "score": 91
    },
    {
      "id": "lpf6llo",
      "body": "Not that I'm saying this is it, but, that COULD result in her losing custody.",
      "created_utc": 1727569773.0,
      "score": 175
    },
    {
      "id": "lpficgk",
      "body": "Can't you lose custody just because of the incest? I believe so. Because the court will basically question the parents' judgment, emotional stability, and ability to provide a healthy environment. So, for the welfare of the children, they can be removed\n\nNot counting the illegality of incest which might land them in jail or is it prison? Lol.",
      "created_utc": 1727574537.0,
      "score": 84
    },
    {
      "id": "lpgeb8s",
      "body": "It's illegal to have kids with your siblings whether they're half or not so she would definitely lose custody of her kids especially if they say that she's abused them in any way.",
      "created_utc": 1727590331.0,
      "score": 15
    },
    {
      "id": "lpi02dt",
      "body": "If they are half siblings, it’s illegal for them to be together. Knowing they are half siblings and then having children together, multiple times, calls into question their ability to make good decisions and be parents. I commented on this in another post, but there are huge medical and mental for children born of relationships like this and it’s why it’s illegal. Those medical implications are not inconsequential. To not have done anything to prevent pregnancy and then not have been proactive in their medical care after is a huge problem. Again, there is a reason it’s illegal and it’s not because of moral reasons, it’s because of science and the repercussions on children born of those relationships.",
      "created_utc": 1727622105.0,
      "score": 13
    },
    {
      "id": "lpicgdu",
      "body": "OP likley lives in a state that actively still prosecutes and has jail time for offenders of incest, even when consensual. Below are those states and the terms for the crime, kids would be taken if they go to jail. \n\nArizona: 1.5-3 years (2.5 years presumptive)\nFlorida: up to 5 years\nIllinois: 2-5 years\nMassachusetts: up to 20 years in state prison, or up to 2.5 years in house of correction\nMissouri: up to 4 years\nPennsylvania: up to 10 years\nTexas: generally 2-10 years (2-20 years if committed with ancestor or descendant by blood or adoption)\nWashington: up to 10 years (if sexual intercourse); up to 5 years (if sexual contact)",
      "created_utc": 1727626320.0,
      "score": 9
    },
    {
      "id": "lq94q7u",
      "body": "Can’t discuss that. But thank you, kind stranger. ",
      "created_utc": 1728015868.0,
      "score": 62
    },
    {
      "id": "lqvfy0v",
      "body": "In this case of questioning paternity for all of Amy's kids plus the question of whether or not Amy & Luke are siblings, plus the legalities of the paternity of OP's kids (not that anyone is questioning who fathered OP's kids, but it would come up for future child support, etc), I'm \\*guessing\\* that DNA tests were ordered for all 4 of Amy's kids, all 4 of OP's kids, and for Luke and Amy.",
      "created_utc": 1728350823.0,
      "score": 4
    },
    {
      "id": "lpfc8rp",
      "body": "the lie to save themselves, saying that it’s an open marriage, was really disgusting. and to neglect the hurt they are inflicting on EVERYONE just because they want to be together… that part baffles me. they are clearly morally bankrupt and nothing else matters other than themselves. \n\ni wish they get what they deserve, but i also feel sad for the kids who had to bear the cost for what they had done. :(",
      "created_utc": 1727572024.0,
      "score": 31
    },
    {
      "id": "lpipevr",
      "body": "I think that's exactly why they brought OP into it, she was the cover for them to continue being together without suspicion. Which, fuck, they still made pretty damn obvious but I guess it's one of those things that's SO outlandish you think it couldn't possibly happen until it's confirmed",
      "created_utc": 1727630416.0,
      "score": 15
    },
    {
      "id": "lpmdzej",
      "body": "I never actually confirmed that I had or didn't have anything, because Amy wouldn't clarify what it was she thought I had.",
      "created_utc": 1727684960.0,
      "score": 69
    },
    {
      "id": "lqqhe1v",
      "body": "Never married. She was always evasive about that. She implied they were one night stands.",
      "created_utc": 1728278389.0,
      "score": 51
    },
    {
      "id": "lqqkqdn",
      "body": "I’m really curious to know if you ever watched Game of Thrones together and what was Amy and Luke’s opinion about it",
      "created_utc": 1728280360.0,
      "score": 7
    },
    {
      "id": "lpmdwx9",
      "body": "I have been in touch with CPS.",
      "created_utc": 1727684909.0,
      "score": 48
    },
    {
      "id": "lpicqae",
      "body": "OP Likely lives in the below states that still actively prosecute and give jail time for the offenders of incest crimes even when consensual. At the minimum CPS would be involved, at the most the kids are taken if amy and Luke go to jail.\n\nArizona: 1.5-3 years (2.5 years presumptive)\n\nFlorida: up to 5 years\n\nIllinois: 2-5 years\n\nMassachusetts: up to 20 years in state prison, or up to 2.5 years in house of correction\n\nMissouri: up to 4 years\n\nPennsylvania: up to 10 years\n\nTexas: generally 2-10 years (2-20 years if committed with ancestor or descendant by blood or adoption)\n\nWashington: up to 10 years (if sexual intercourse); up to 5 years (if sexual contact)",
      "created_utc": 1727626405.0,
      "score": 8
    },
    {
      "id": "lpkmwmr",
      "body": "Being gay and being in an incestuous relationship are not comparable at all for many reasons. Least of which, an incestuous relationship can result in procreation which has biological repercussions for the children.",
      "created_utc": 1727653204.0,
      "score": 4
    },
    {
      "id": "lpmdhrm",
      "body": "Thank you. I can't reach them all, but I appreciate each and every comment like this one.",
      "created_utc": 1727684595.0,
      "score": 39
    },
    {
      "id": "lpfdqjk",
      "body": "Thanks and god bless.",
      "created_utc": 1727572632.0,
      "score": 35
    },
    {
      "id": "lpfkpzb",
      "body": "It's mainly just us who know, but word is spreading. \n\nFor Kaylee, it's both her paternity, and the other stuff I had to report. As far as I know, the kids have all heard about it now.",
      "created_utc": 1727575529.0,
      "score": 103
    },
    {
      "id": "lpmdry8",
      "body": "Thank you, kind commenter.",
      "created_utc": 1727684806.0,
      "score": 18
    },
    {
      "id": "lq93c4p",
      "body": "If anything they’re actually a lot more like Jon and Arya.",
      "created_utc": 1728015160.0,
      "score": 23
    },
    {
      "id": "lq92hqg",
      "body": "Still don’t have a clear answer on that. ",
      "created_utc": 1728014743.0,
      "score": 55
    },
    {
      "id": "lpfdu8s",
      "body": "As far as I can tell, it wasn't like that, but I wasn't there.",
      "created_utc": 1727572673.0,
      "score": 84
    },
    {
      "id": "lpgjucu",
      "body": "Don't forget that Amy absolutely refused any form of birth control (and possibly contraception, too). What did she expect would happen? I'm highly suspicious that she did it intentionally to baby trap Luke, since they were on and off before Tom.\n\nI feel really bad for OP and all the children involved, but I also can't imagine what Cat's going through if Luke and Amy are half-siblings. I don't get the sense that she ever knew or had an inkling that Amy was (possibly) Jim's affair child. Cat has been housing and caring for her husband's (possible) affair child from a young age; everyone in her family kept this massive secret from her for decades; her only son knowingly fathered children with his (possible) half-sibling; she's been financially supporting the (possible) affair child in raising their own family; and she's very likely going to be these children's legal guardian and full-time carer soon in her older age and without her husband to help her raise them. If she's just finding out about everything now, it's a lot to take in. All the victims have been so thoroughly fucked over and betrayed. I'd feel like my family simultaneously crumbled around me if I were in their shoes.",
      "created_utc": 1727593907.0,
      "score": 23
    },
    {
      "id": "lpgadw0",
      "body": "Yes my thoughts exactly. I was on the fence before as to whether this story was bullshit, but as soon as I read this part of the update, I knew for sure.",
      "created_utc": 1727587928.0,
      "score": 19
    },
    {
      "id": "lq92dff",
      "body": "She just took it harder than the others. She always wanted to know her father’s identity and where she came from. ",
      "created_utc": 1728014686.0,
      "score": 55
    },
    {
      "id": "lpqd1qk",
      "body": "There's no need for them to go into foster care. They have relatives and family friends who can take them in, who will gladly do so.",
      "created_utc": 1727739722.0,
      "score": 59
    },
    {
      "id": "lpmdmnx",
      "body": "As far as I know, Amy isn't abusing Kaylee. Not as such, anyway. I don't think they're getting along at al right now, and Amy can be vicious when she's in a fight with someone, but Tom is still our little spy behind enemy lines and he hasn't reported things getting to that level.",
      "created_utc": 1727684696.0,
      "score": 61
    },
    {
      "id": "lpfcar4",
      "body": "My guess is Incest. They knew they were half-siblings and had an affair anyway. And then reproduced. Although legally OP can't confirm or deny anything it seems.",
      "created_utc": 1727572048.0,
      "score": 14
    },
    {
      "id": "lphrn4h",
      "body": "Because it's illegal. People have been marrying beards for a long time to cover their illegal activities. Unfortunately most beards aren't aware that they are the beard.",
      "created_utc": 1727619074.0,
      "score": 6
    },
    {
      "id": "lpf73tc",
      "body": "For those kids, this cannot get out to their peers or it is the end of any normal shot at a normal childhood. Luke should not be staying there at all! Basically screams incest city. \n\n\nDo you think Amy keeps showing up bc Luke is trying to gain your forgiveness? She probably thought she finally got her man. How did people react to her social announcements about the open marriage and luke being her baby daddy?",
      "created_utc": 1727569973.0,
      "score": 608
    },
    {
      "id": "lpfr8g0",
      "body": "I cannot believe Jim knew his kids were sleeping together and procreating and he just shrugged his shoulders and said \"just don't tell your mother\"",
      "created_utc": 1727578306.0,
      "score": 137
    },
    {
      "id": "lpfsmfe",
      "body": "Him staying with her is going to look so bad in court. I hope the kids are able to cope. It must be difficult seeing that disgusting man openly with Amy there.",
      "created_utc": 1727578923.0,
      "score": 116
    },
    {
      "id": "lpg1hgl",
      "body": "I’m sorry truly sorry for the pain and stress this is causing you and those you love. As an outsider who could never truly understand your turmoil or the grief that has been inflicted wish all the best for you, Cat and all the children.\n\nI am a bit curious as to why Child Protective Services hasn’t been involved thus far for Amy’s children as psychological trauma can be used to enforce separation while this is all sorted out. I realize it doesn’t always seem the best solution but letting her children see the continuation of them living together cannot be healthy for their mental well being! Maybe this could be a catalyst for them staying with Cat while this goes through the court system and I feel certain it would give the children, Cat and you a little more peace of mind in the interim.",
      "created_utc": 1727583048.0,
      "score": 165
    },
    {
      "id": "lphar3a",
      "body": "Or course it’s not going well. Their children are all old enough to understand their father hid them away because their existence is actually a crime!!!!!! Legally and morally wrong. \n\nHe pretended to step into the role of father when in reality he was their father all along. He missed their childhood. He may have spent the night weekly, but that’s not a father. He never CLAIMED them ever. That’s messed up. He wasn’t proud to be their father because he was also their uncle. \n\nThey need to watch Kaylee. She might try to unalive herself. Someone in this mess is going to try - I suspect her or Amy (especially when everything comes out). \n\nLuke values himself too much. If he didn’t have mommy’s money - he’d be screwed. Instead of screwing his sister, he’d actually have to be a man and get a real job. I know he has that medical condition that basically makes him a vampire but there are night jobs. He’s been spoiled for too long. He needs to be knocked down to reality. Same with Amy. She’s a grown woman with four children and lives off of her daddy’s money. How shameful. \n\nCat needs to a grow a spine. And tell\nThem straight up - I’ll take the kids.\nYou two F off…..no more money for them.",
      "created_utc": 1727611651.0,
      "score": 168
    },
    {
      "id": "lpf8xdn",
      "body": "He’s an idiot for staying with Amy and just shows how selfish he is. Not even thinking about his kids and what’s best for them… All of them. He truly needs to get his head out of his ass. \n\nCat lost Jim in no ways than one and that’s so tough but wow.",
      "created_utc": 1727570684.0,
      "score": 89
    },
    {
      "id": "lpvhg7w",
      "body": "They're a match made in hell. Their reservations are booked. Only question is their eta.",
      "created_utc": 1727816423.0,
      "score": 5
    },
    {
      "id": "lpfxxng",
      "body": "So what was the secret written in the letters Amy attacked you in order to protect?",
      "created_utc": 1727581311.0,
      "score": 159
    },
    {
      "id": "lpj21h4",
      "body": "It’s better they know. I hope Cat tells them they have to let go of any child that wants to leave unless they want their money supply cut off. Tom and Kaylee need to be away from them. The twins should be away from them too. They are sick individuals. They were going to allow Tom and Sophie to date if it meant keeping their secret. That’s diabolical.",
      "created_utc": 1727634206.0,
      "score": 21
    },
    {
      "id": "lpfux64",
      "body": "Therapy will help with this",
      "created_utc": 1727579913.0,
      "score": 22
    },
    {
      "id": "lpmj6wb",
      "body": "Depending on the state/country you're in, once Kaylee turns 16yo, the police may turn a blind eye and refuse to return her to Amy if she speaks to them and says she's happy where she is (your house). It happens.",
      "created_utc": 1727688767.0,
      "score": 5
    },
    {
      "id": "lq38fig",
      "body": "The YouTuber \"RSlash\" just made a video on your story, he reads posts from here a lot. Of all the stories I've listened to him read over the years, yours was the first I was interested to find the original post myself.\n\n\nA, because I wanted to let you know the video exists in case you didn't know (and know, basically everyone in the comments of his videos are supporting you and wishing you well).\n\nB, as a random internet stranger, just I wanted to give you some words of encouragement myself. You're brave for sharing with the world, and you're handling your situation with incredible grace all things considered. Your ex husband f'd up and missed out on an incredibly strong and powerful woman, that's HIS loss. Just keep in mind your life isn't over, you just gotta give yourself time to heal. You and your children are better off!",
      "created_utc": 1727929126.0,
      "score": 4
    },
    {
      "id": "lpg3o5d",
      "body": "The way this was written had me immediately thinking it was fake.   \nThanks for the confirmation.   \nI wish people would stop the bs-ing.",
      "created_utc": 1727584179.0,
      "score": 67
    },
    {
      "id": "lpg3gft",
      "body": "Proof? I mean this has been clearly fake for a while, but what you're saying could be a lie as well if you didn't take screenshots or anything.",
      "created_utc": 1727584067.0,
      "score": 23
    },
    {
      "id": "lpg2yng",
      "body": "ooooh is the comment on this post, hope you screencapped",
      "created_utc": 1727583818.0,
      "score": 10
    },
    {
      "id": "lpgehnx",
      "body": "Op didn't say it herself but it was guessed that Amy and Luke were half siblings or somehow related to each other",
      "created_utc": 1727590443.0,
      "score": 256
    },
    {
      "id": "lpzn4xk",
      "body": "Totally second that. You HAVE handled this so well. This is a disaster decades in the making: none of it due to you. That includes Jim’s unfortunate passing. Everything you have said has been measured and considered, few could have been as graceful as you have been. The kids are lucky to have you. Saying that, you are going to keep needing that strength for a while. All power to you!",
      "created_utc": 1727883110.0,
      "score": 4
    },
    {
      "id": "lpfph6w",
      "body": "Not anytime soon, but when Tom and Kaylee are ready, maybe show them your posts and our comments (certainly not all of them, maybe take screenshots of certain ones), showing support for them. I can imagine how horrible they must feel and must feel that everyone in the world thinks or see them a certain way. I’d like to think our comments would show them that the world doesn’t think any less of them, that they aren’t broken. Sure, they might not have came into this world in the most conventional way, but they deserve to be here, they deserve to be happy and we do not wish to punish them for the sins of their parents. And the same goes for your kids too OP. If you ever decide to show ANYONE these posts and comments, I hope that they take comfort in what you did to help them and keep them safe. You couldn’t shield them from everything, but you did what you could. You did the absolute most for them. They will recognize and remember that.",
      "created_utc": 1727577544.0,
      "score": 31
    },
    {
      "id": "lqfrhif",
      "body": "I HIGHLY recommend this.",
      "created_utc": 1728125428.0,
      "score": 5
    },
    {
      "id": "lpfrx9s",
      "body": "Op no answer is an answer and I’m picking up what your putting down 😂😂\nSorry for your situation (take ur loser husband to the cleaners and go for full custody with supervised visitation)",
      "created_utc": 1727578615.0,
      "score": 254
    },
    {
      "id": "lpf93w2",
      "body": "after following your posts you explained several times why you couldn't answer certain questions so most people following understand, but we will all still be curious and hope for the update once its all over.... I honestly think a lot of people are hoping it was fake, only because of the fact neither you or any children should have to deal with a shit show like this, truth is stranger than fiction sometimes, good luck and I hope everything goes in your favor! we all stand in disgust with you over what Amy and luke have done!",
      "created_utc": 1727570755.0,
      "score": 131
    },
    {
      "id": "lpfaik7",
      "body": "Are you legally not supposed to answer that question because it isn't a legally established fact? Meaning there is slight chance that *they* are wrong about being siblings which could (possibly) make the accusation libelous or defamation as incest is considered a crime in your jurisdiction or your libel/defamation laws have a immorality clause?",
      "created_utc": 1727571324.0,
      "score": 40
    },
    {
      "id": "lphqvj2",
      "body": "Blink twice if that’s the answer 👁️👁️",
      "created_utc": 1727618777.0,
      "score": 4
    },
    {
      "id": "lpg2hcy",
      "body": "Yes tell Tom and Kaylee your home is always open. Maybe the coins emancipate themselves. 🥹",
      "created_utc": 1727583565.0,
      "score": 40
    },
    {
      "id": "lph9mj2",
      "body": "Did they write that out in the letters? Or even mention using you financially or as a cover. That alone could help your case tremendously.\n\nDid he ever speak about you to Amy in the letters or texts? I’m just curious on how far their evilness went. Did he ever say he loved you to Amy? It’s just so strange she was able to maintain a facade of being your friend for literally 20 years. She was obviously jealous of you. That came out the moment you confronted them directly. \n\nTruthfully, I hope the entire community and friend group turns their backs on them.\nI hope they’re blacklisted. It’s actually “better” in a way that they are related because a “regular” affair wouldn’t garnish this much disgust. Some people would even believe their lies of an open marriage or somehow blame you for turning a blind eye to everything. And he basically would have been able to make Amy/her kids his primary family and your kids would have become second. \n\nNow, that’s not possible. The hurt, shame, and anger of their children will be their biggest punishment. Tom and Kaylee will never have a “normal” relationship with either parent. In fact, they are going to choose you. The twins are going to struggle, as well. \n\nLike and Amy need to move far far away. Maybe to Alabama. They never really cared about the children’s well-being. They lived off their parents’ (and your) money while they had their perverse fun. Cat needs to cut off their money and take the children in. She needs to let go of her son and her husband’s affair product. \n\nLet Luke and Amy go live in a dilapidated shack in the woods somewhere.",
      "created_utc": 1727611062.0,
      "score": 82
    },
    {
      "id": "lpf9r04",
      "body": "Or possibly because they could use your religious upbringing against you, to argue that open marriage or polyamory was normalized for you?",
      "created_utc": 1727571012.0,
      "score": 75
    },
    {
      "id": "lpfzvib",
      "body": "Oh man, I’m sure this all has to be tough on him and your other kids as well. Stay strong Mama! They’re lucky to have you. We’re all rooting for you and your kids happiness.",
      "created_utc": 1727582243.0,
      "score": 42
    },
    {
      "id": "lqhtlho",
      "body": "I'm curious to learn more about Cat, and how she became OK with Amy being in the home. \n\nHow would she be OK with Jim showing up and being like \"I am so close with a horribly abusive family that I am going to adopt their kid, OK? No, I've never mentioned them, and you don't know them. They live in Canada.\"\n\nI'd love to know how Jim explained all of this, and whether that explanation was good enough for her to just accept it, or whether (and how, and why) Cat made herself believe it. Surely, unless she's a literal cat, she must have suspected that Jim was closer to Amy than just \"kindly friend to the abusive monsters who were her parents.\"\n\nAnd what about Amy? She never suspected that Jim was her father until much later, when he told her?\n\nOP, I am going to have to request more backstory, here. I'm just that invested. Also, please hire me as your editor when you receive your hefty divorce settlement and sit down to write your bestseller.",
      "created_utc": 1728152941.0,
      "score": 22
    },
    {
      "id": "lpf853n",
      "body": "Oh I've missed a lot of the updates, is this what OP reported, and why they might lose custody of Amy's kids? Intentional incest kind of thing? I don't know the legality around any of that, especially in another country. Or was it all something else?",
      "created_utc": 1727570382.0,
      "score": 199
    },
    {
      "id": "lpfpb57",
      "body": "Wait but didn't the two older kids get a DNA test and it came back that they weren't related at all?? I think i read that in the 3rd update. If Amy and luke are half siblings then wouldn't the kids be cousins?\n\nETA: Sorry it was the 4th update not the 3rd and heres what was said exactly\n\n>The test results came back! Sophie and Tom tested their DNA against each other to see if they truly are blood siblings. Here’s a surprise - according to the test, they’re not. They don’t share any DNA.",
      "created_utc": 1727577472.0,
      "score": 34
    },
    {
      "id": "lpf7cmo",
      "body": "So two generations of incest if im understanding correctly?",
      "created_utc": 1727570071.0,
      "score": 54
    },
    {
      "id": "lpfajbv",
      "body": "i’m honestly a little confused about the entire amy of it all tho. who was amy living with before? her mother & the mothers partner? how did she get brought into Jim’s house? How did Jim keep Cat from knowing Amy is his child but Amy & Luke knew? so many questions",
      "created_utc": 1727571333.0,
      "score": 19
    },
    {
      "id": "lpfakmo",
      "body": "So I've been reading between, but I need someone to outright confirm this pls",
      "created_utc": 1727571347.0,
      "score": 14
    },
    {
      "id": "lpg2q0w",
      "body": "[deleted]",
      "created_utc": 1727583691.0,
      "score": 127
    },
    {
      "id": "lpieqlx",
      "body": "Hi OP, do you think Cat was somehow aware of the illegal thing you mentioned? I mean did she know her husband’s part in it or did she learn this with you?",
      "created_utc": 1727627036.0,
      "score": 28
    },
    {
      "id": "lpiikr4",
      "body": "as a criminal & behavioral psychology major, i’ve never been so intrigued & also baffled",
      "created_utc": 1727628268.0,
      "score": 20
    },
    {
      "id": "lpit4w1",
      "body": "What they’ve done is  so dangerous  and could have horrendous implications for not only the current generations but also for future generations as come.  I wish the best for  OP.",
      "created_utc": 1727631525.0,
      "score": 8
    },
    {
      "id": "lqv86w2",
      "body": "They also destroyed an entire woman's life, using her as their \"beard\" for decades, thereby ruining HER children's lives too once all of this came out! The \"body count\" on this one is so disturbing. And every act premediated too!!! ICK.",
      "created_utc": 1728347993.0,
      "score": 4
    },
    {
      "id": "lpgjc7w",
      "body": "I am glad you are in therapy same as the kids. I hope once the case is over you can divulge more info to put things into prospective some of the missing pieces .",
      "created_utc": 1727593578.0,
      "score": 23
    },
    {
      "id": "lpi9fqq",
      "body": "Do Tom and Sophie know the “extra” secret now? Do all the children?",
      "created_utc": 1727625315.0,
      "score": 11
    },
    {
      "id": "lphja8r",
      "body": "Maybe he did love you in his own twisted way but that doesn’t change his betrayal and as I said before, I’m so sorry for all the losses you have had these past weeks! \n\nAnd I bet that you a second guessing every happy moment; hugs to you!!",
      "created_utc": 1727615691.0,
      "score": 27
    },
    {
      "id": "lpnf9qh",
      "body": "Been following this since your first post OP. I feel for you and your family greatly. (minus Luke and Amy for obvious reasons) I can only imagine how shocked you still must feel. But you've taken action and done everything you could to protect your children and yourself, and as I see- still trying to protect Amy's children as well, which shows how big of a heart you truly have. I'm so sorry these two vile people took advantage of your kindness and love for all these years. You, your children, hell- all of the children, do not deserve this. But they are so very lucky to have you in their corner whether some of them know or it not yet, they will and it will not go unnoticed. Sending you the biggest hugs OP, and hoping you are doing okay. Give yourself grace, you have done nothing wrong here, not a single thing and don't let anyone, especially those idiots, make you believe otherwise. I'm very glad to read to that you see the light at the end of this horribly vile tunnel, because you are so very strong and you are an outstanding human being, and mother. You deserve nothing but peace from here on out my dear. Wishing you, your children and your loved ones the best through all of this. (And hoping to eventually hear all is doing well)  \nXO",
      "created_utc": 1727704734.0,
      "score": 9
    },
    {
      "id": "lpml4fq",
      "body": "Poor Cat, losing her husband and then discovering the secret he kept right under her nose, a secret that didn't just betray her, but also set the stage for this adaptation of Flowers in the Attic that you're all trapped in now. I really do hope that you two are able to reconcile fully, not just for the kids' sake, and not just because it would make things easier for you (especially if you end up caring for Amy's kids). I also hope you two reconcile for Cat's sake. I'm sure she's feeling ALL the feels, including blaming herself for all this. I'm not saying she's at fault, AT ALL, just that people do tend to blame themselves when shit hits the fan, especially if they're simultaneously seeing old red flags they wish they'd noticed years before. \n\nAs an afterthought, before I hit \"post\", I just want to stress that, as an outside observer I hope you two reconcile... But IN NO WAY am I suggesting that you owe it to Cat, or owe anyone forgiveness or reconciliation, for that matter. You've been wronged. Profoundly. And you don't owe anyone shit. I'm just hoping for some kind of \"happily ever after\" for you, Cat, and the kids.",
      "created_utc": 1727690123.0,
      "score": 20
    },
    {
      "id": "lpn8tdc",
      "body": "I would think in some way, he has to be relieved it’s all out. I can’t imagine how exhausting it would be to maintain two romantic relationships and eight children, four of whom you cannot claim. Perhaps this is why he gave up after only a week or so. Obviously he made his own bed, but I think this would explain his quick capitulation of the situation.",
      "created_utc": 1727702258.0,
      "score": 7
    },
    {
      "id": "lpoar4g",
      "body": "I know it may be a long process, but I think that I can talk for all of us.\nWe can't wait for the update\nAnd wish you and your children the best",
      "created_utc": 1727715241.0,
      "score": 28
    },
    {
      "id": "lq1wtsj",
      "body": "I don’t know why, but this response has made my feel some type of way. Sad, I guess. The matter of factness in which you respond to questions 3 & 4 hurt my heart for you. I just can’t believe he’s not fighting for you!!! All of the wonderful things you believed him to be as a man, husband, father, and friend when you first shared with us, is now so far from any sort of reality, and I think THAT’S what makes me so sad when I see how far he truly is from the man you believed him to be. I don’t know…I truly think she’s got some crazy ass hold on him, or knows things that she’s threatening to make public if he doesn’t stay with her, bcuz what he’s doing is such a bad look for the courts, and it’s not going to help is case. The divorce case nor the social services case! \n\nIt definitely seems as though you are getting stronger, which is good to see! I imagine finding out he’s not the man you thought he was, can help move your process along a little quicker. You seem to be staying focused on what’s truly important, which based on what we’ve seen of your character, doesn’t surprise me at all. Those kids are incredibly lucky to have you! I do hope you are finding time for some self care, as well. Remember you gotta put your mask on first, before you can take care of the kids! Sending love strength and prayers to you all including your MIL!",
      "created_utc": 1727909855.0,
      "score": 8
    },
    {
      "id": "lpqe3n9",
      "body": "The sad thing is Luke kept this hidden from his mom. I assume Cat didn’t know Amy was his affair child. ☹️",
      "created_utc": 1727740110.0,
      "score": 71
    },
    {
      "id": "lpq3847",
      "body": "When did Amy and Luke find out? I'm assuming Jim told them when they were teens. ",
      "created_utc": 1727736129.0,
      "score": 30
    },
    {
      "id": "lppyu6l",
      "body": "Duuuuude, a student?? Damn...",
      "created_utc": 1727734574.0,
      "score": 18
    },
    {
      "id": "lpq8l8q",
      "body": "Wow. Thanks for replying. This is unreal. You need to write a book before someone else does",
      "created_utc": 1727738073.0,
      "score": 9
    },
    {
      "id": "lpqzw7s",
      "body": "Omg I had a feeling they were half siblings but I’m still shocked OP. How are you? Are you feeling better? How are the kids? Does Cat know Amy is Jim’s affair child?",
      "created_utc": 1727748192.0,
      "score": 6
    },
    {
      "id": "lqdwmqr",
      "body": "As a person working in academia and a former grad student who was SA’d by a professor, this is so fucking gross. Any respect for Jim is gone. Putting aside everything else he did (lying, cheating, claiming ignorance), he abused his position. Sorry to speak ill of the dead, but also not sorry. This just changed the ‘was he a good person or not?’ to ‘NOT’.",
      "created_utc": 1728087677.0,
      "score": 6
    },
    {
      "id": "lpz9ifi",
      "body": "That explains why he was so adamant that there’s no way that there was anything between them, ever. And the realisation must have been..",
      "created_utc": 1727878635.0,
      "score": 5
    },
    {
      "id": "lpqds79",
      "body": "Wowwwwwwwwww. Welp. We knew it.",
      "created_utc": 1727739993.0,
      "score": 4
    },
    {
      "id": "lptecna",
      "body": "Well, did not see that coming.  So, Luke is father and uncle.  Wow!  A little disgusting, but maybe they did not know?  But if you found out, I am sure they knew as well, and continued relationship?  Yikes!  Don't know how you manage all this.  Stay strong!",
      "created_utc": 1727792654.0,
      "score": 4
    },
    {
      "id": "lrqfiel",
      "body": "How are you doing, OP? Is Luke staying away or is he still trying to see the kids?",
      "created_utc": 1728834319.0,
      "score": 15
    },
    {
      "id": "lrqf16q",
      "body": "Can you tell us the results of the paternity tests? Is Luke the father of all of Amy's kids, or is there another sperm donor involved ?",
      "created_utc": 1728834167.0,
      "score": 15
    },
    {
      "id": "luj5qwx",
      "body": "It does my heart good knowing so many of us keep checking in. I hope her and ALL the kids are doing ok. And her mil.",
      "created_utc": 1730300527.0,
      "score": 6
    },
    {
      "id": "lu9faaz",
      "body": "Still praying and sending positive vibes your way. 🥹",
      "created_utc": 1730157841.0,
      "score": 4
    },
    {
      "id": "lud9pd3",
      "body": "Hi OP.  Just checking in with you.  I hope you and your family are finding your way to a better place through all this.  Just please check in every once in a while to let us know you are ok!",
      "created_utc": 1730217984.0,
      "score": 4
    },
    {
      "id": "lpflxb0",
      "body": "It amazes me how Amy and Luke dare to blame you for anything when this whole mess was created by them! They played you hard and have the audacity to be mad at you. The nerve",
      "created_utc": 1727576033.0,
      "score": 111
    },
    {
      "id": "lpfmwhy",
      "body": "Their continued denial, gaslighting and blaming you for the shit storm that THEY created is truly mind blowing and evil. They are very sick people. Tom and Kaylee are old enough to petition for emancipation. Considering the circumstances, I can’t see a court denying their requests.",
      "created_utc": 1727576446.0,
      "score": 64
    },
    {
      "id": "lpgpj77",
      "body": "The adasity Amy and Luke have to blame you for their actions. Regardless of what have happens we all know at least one of their kids will go NC with Amy or Luke. I honestly hope they lose everything. If it comes out that Luke is indeed half brother to Amy, then i hope they loose their kids. That means 1 or 2 was consiced from incest and i feel terrible for the kids if thats true. I cant even imagine finding that out about yourself, its disgusting. \n\nI understand respecting the dead, but if Jim really just let this be for so maney years is insane and kinda fucked up. I feel the most for Cat, i cant even imagine spending most of your life in a lie.",
      "created_utc": 1727597755.0,
      "score": 56
    },
    {
      "id": "lph7sd5",
      "body": "He could petition for guardianship of Kaylee when he turns 18 as well.\n\n*Especially* if Luke and Leia (ugh) are still living together and playing house.  That would be pretty traumatizing to children of incest, and they shouldn't be normalizing that around minors.",
      "created_utc": 1727610060.0,
      "score": 20
    },
    {
      "id": "lpfm2pm",
      "body": "He's almost 18, isn't he? Is it still this year? He must be dying to leave, poor kid",
      "created_utc": 1727576096.0,
      "score": 16
    },
    {
      "id": "lphtaek",
      "body": "He might be able to sue for custody of Kaylee and maybe more of his siblings and move all of them in with you.",
      "created_utc": 1727619686.0,
      "score": 7
    },
    {
      "id": "lpp3k8r",
      "body": "Can Kaylee request to live with her brother if he moves out to you or to Cat? My bf took in his sister when she was under 18 y/o because she did not feel safe at home with her birth mom. I don’t know what it’s called legally but surely Kaylee and Tom can go a place better for their mental health.",
      "created_utc": 1727724325.0,
      "score": 5
    },
    {
      "id": "lpfozqd",
      "body": "Too bad Jim didn't take responsibility all those years ago.  Confess to his wife, and raise those kids like siblings from the beginning.  Maybe things would be different.",
      "created_utc": 1727577339.0,
      "score": 132
    },
    {
      "id": "lpgg201",
      "body": "How are Cat holding up with all the new information about Jim, Luke and Amy and all the other things with cheating, betrayal and stuff?",
      "created_utc": 1727591442.0,
      "score": 16
    },
    {
      "id": "lpkwjpp",
      "body": "Do you mean Alabama literally or as in like a joke? I would assume (perhaps wrongly) the laws on sibling relationships wouldn’t be that strict…not knocking on Alabama, as I’m in a state next door (Tennessee) so I have no place to be condescending about lack of incest laws. I actually expected OP was in a more blue state because authorities are taking this so seriously (as they fucking should).\n\nI have been one of those weirdos that has checked for updates often and has in fact gone through OP’s comments. This story is fascinating and I’ve been emotionally invested for weeks. OP is strong as hell for dealing with all of this. Hopefully the worst is over, but I have a feeling it’s not, sadly. All the luck to you and the children, OP. We hope you guys gets through this. And fuck those other mother fuckers.",
      "created_utc": 1727657032.0,
      "score": 9
    },
    {
      "id": "lpfrbim",
      "body": "Yes, if they knew they are legally liable.  They would literally have had to write down- I know you’re my brother but I don’t care, I want to sleep with you still. And then dna from the kids proves knowledge and the  guilt.",
      "created_utc": 1727578343.0,
      "score": 43
    },
    {
      "id": "lpw3h9b",
      "body": "You’re right. Especially while continuing to live in the incestuous relationship. No judge would leave them there. That’s so unhealthy for them.",
      "created_utc": 1727823994.0,
      "score": 4
    },
    {
      "id": "lpiq8tx",
      "body": "That is diabolical. He robbed her of having someone who really loves her and having a good family life. Luke and Amy are insane, just mentally ill.",
      "created_utc": 1727630665.0,
      "score": 11
    },
    {
      "id": "lpr4bqd",
      "body": "Smart.",
      "created_utc": 1727749829.0,
      "score": 6
    },
    {
      "id": "lr1uf05",
      "body": "I think Amy always felt she was married to Luke, maybe not legally but spiritually.",
      "created_utc": 1728451517.0,
      "score": 18
    },
    {
      "id": "lpfqlme",
      "body": "Let's hope that word keep spreading like wildfire until they have no excuse or other stupid cra* like open marriage excuse. \n\nAre you thinking about switching the children's school? Because if it spreads not only Amy's children but yours too, they will have a hard time. \n\nI'm very curious about your and Cat's conversation? Like what was her thought process when she learned Amy was her husband's child, and all three kept it from her and not counting the voluntary incest?",
      "created_utc": 1727578030.0,
      "score": 47
    },
    {
      "id": "lpigvdl",
      "body": "[removed]",
      "created_utc": 1727627725.0,
      "score": 20
    },
    {
      "id": "lpfrror",
      "body": "I couldn’t imagine finding out my parents were recreating Flowers in the Attic, I hope they work through all of that!  Uou are an amazing woman",
      "created_utc": 1727578546.0,
      "score": 17
    },
    {
      "id": "lqbdpsl",
      "body": "Jon is Arya's cousin, and they are never romantically linked. How would they not be Cersei and Jaimie who are siblings who have kids?",
      "created_utc": 1728056498.0,
      "score": 13
    },
    {
      "id": "lrchoxn",
      "body": "I apologize if you already talked about your family of origin and if they’re in the picture or not, but how are *your* loved ones taking the news? How are they feeling about what’s been done to you?",
      "created_utc": 1728610323.0,
      "score": 16
    },
    {
      "id": "lpffalu",
      "body": "[deleted]",
      "created_utc": 1727573268.0,
      "score": 31
    },
    {
      "id": "lpkpkpo",
      "body": "Oh my theory is they wanted a family together and all the weird ramblings about why she wouldn’t use contraception were just a made up story. These two wanted a full life together all along and they made it happen under the radar thanks to OP, their poor beard. They’re just awful people for what they did to her and their children. So much deception, so much pain. So incredibly selfish. ",
      "created_utc": 1727654268.0,
      "score": 8
    },
    {
      "id": "lpgghop",
      "body": "[deleted]",
      "created_utc": 1727591724.0,
      "score": 10
    },
    {
      "id": "lqlepva",
      "body": "With DNA kits becoming popular, a lot of people are discovering their biological parents are closely related (and that children born by incest are much more common than previous estimates led us to believe). The geneticist who specializes in identifying the related parentage in DNA, CeCe Moore, also holds a sort of private online support group for the affected children to process together and not feel as isolated. Hopefully, you can get Amy's kids in touch with Moore or the online group.\n\nNone of this is their fault. I can't imagine how they must be feeling, especially at their young age. Kaylee is at that stage where everyone already feels awkward, cringe-y, overly self-conscious, weird, and anxious as it is. If you didn't feel like enough of a freak during middle school, imagine how you'd feel after learning this bombshell at that age. They are not their parents. However they came into this world and whomever their parents are, none of that dictates what kind of people these kids **choose** to become. They get to decide what qualities and characteristics are important to them and that they want to emulate. No one else can force or decide that for them.",
      "created_utc": 1728208425.0,
      "score": 9
    },
    {
      "id": "lpqg4cb",
      "body": "Thank you for the response! That makes it better for the children if they stay with relatives who love them. I am sorry for all the pain that this has caused you and your family.",
      "created_utc": 1727740851.0,
      "score": 12
    },
    {
      "id": "lqfsm2i",
      "body": "Kinship is always the preference. Likely for Cat to be the option.",
      "created_utc": 1728126116.0,
      "score": 3
    },
    {
      "id": "lpnj8j2",
      "body": "I am now worried about Tom as you've mention in one of your comments that the 2 are aware of your posts. They could hurt him because now they know Tom was telling you stuff that's happening at their home. I also doubt Cat didn't know about Amy. She would somehow have some resentment with Amy after finding out Amy was an affair baby and hold financial support for a while until she could clear her mind... but she kept supporting her.",
      "created_utc": 1727706155.0,
      "score": 25
    },
    {
      "id": "lpfw014",
      "body": "I’m not familiar with laws around that in the US. Do you automatically lose your children if they are the product of incest?",
      "created_utc": 1727580411.0,
      "score": 5
    },
    {
      "id": "lpf7oi2",
      "body": "She only made posts accusing me of kidnapping Kaylee and \"lying\" about her and Luke. Which caused a lot of commotion even after I cleared the air. Most people seem to believe me, or believe that it was a \"misunderstanding.\" \n\nAs far as her claims of an open marriage, that was only the statement from Luke's lawyer, it's not widespread. At least not that I've seen.\n\nNeither of them have confirmed the paternity of Amy's children. She's maintaining that they aren't Luke's, and even if they were, that's between the two of them, and no one else. DNA tests will sort that out, they'll sort everything out. As to my reporting, she and Luke are maintaining that they don't know anything about what I accused them of. But I have proof that they did know.",
      "created_utc": 1727570202.0,
      "score": 760
    },
    {
      "id": "lpzs3jj",
      "body": "Basically? That’s EXACTLY what it screams lol. This honestly just shows that Amy and Luke have no one on their side, as anyone with a half functioning brain (even those riddled from the diseases brought on by inbreeding) would tell them no way in hell that this is a good idea and is exactly the kind of idea of whatever a dealbreaker would be for those few who are unimaginably still on their side throughout all of this.",
      "created_utc": 1727884701.0,
      "score": 4
    },
    {
      "id": "lpg0nfb",
      "body": "I don’t think Jim knew Amy and Luke were sleeping together. From what I’ve gathered, Jim took Amy in when she was a child and neither Cat or Luke knew she was his affair child. Then when they got older, Amy and Luke began to show interest in each other, and Jim told them they absolutely could not be together because they were half-siblings. He probably believed them having this knowledge would be enough to prevent them from ever taking it any farther, because ew. Whether or not he was just in denial about the possibility of them having procreated once Cat brought up her concerns later, I’m not sure, but I don’t think it was a secret he was *willingly* apart of. He probably worried about it but didn’t know for sure (and didn’t want to). Then when the proof was presented to him, it likely upset him so much that it led to his heart attack.",
      "created_utc": 1727582626.0,
      "score": 195
    },
    {
      "id": "lplwrr1",
      "body": "I don’t think Jim knew. He refused to believe that they would knowingly sleep together when OP started questioning Luke being Amy’s kids father. I think it triggered his heart attack.",
      "created_utc": 1727673275.0,
      "score": 4
    },
    {
      "id": "lpmiorg",
      "body": "Jim was in denial. When it all blew up and Jim found out, the stress of it is probably what killed him. Our OP heard him yelling at Luke when she was talking to Cat on the phone.",
      "created_utc": 1727688402.0,
      "score": 4
    },
    {
      "id": "lpg9uvz",
      "body": "It may yet come to that.",
      "created_utc": 1727587616.0,
      "score": 147
    },
    {
      "id": "lphiy9a",
      "body": "That crossed my mind as well. Tom is keeping an eye on her for the time being.",
      "created_utc": 1727615546.0,
      "score": 160
    },
    {
      "id": "lpkknpf",
      "body": "I have that same medical condition, and I work. Now I work from home, but I used to have to drive to an office, get into the building while dragging a craptom of stuff I needed for the day (company provided *nothing* - not even a laptop), and do the same to get back home. I still go shopping and run other errands. I have to use a parasol everywhere I go, and I wear sunblock even in winter, but I do it and I'm not a homebody. Luke is just a lazy, spoiled asshole who made excuses.",
      "created_utc": 1727652333.0,
      "score": 15
    },
    {
      "id": "lplx7zj",
      "body": "This is some Cersei and Jaime Lannister business here.",
      "created_utc": 1727673544.0,
      "score": 9
    },
    {
      "id": "lpmvhvz",
      "body": "I also have a problem with this. How can you get pregnant in the 21st century accidentally? If they knew they were half siblings and did not take contraceptives or use them then they are sick ba\\*\\*\\*\\*s.",
      "created_utc": 1727696294.0,
      "score": 4
    },
    {
      "id": "lpg6spo",
      "body": "They’re half siblings.",
      "created_utc": 1727585869.0,
      "score": 200
    },
    {
      "id": "lpg1e1x",
      "body": "They're probably first cousins or Jim had a kid behind his wife's back.",
      "created_utc": 1727583001.0,
      "score": 148
    },
    {
      "id": "lpix4bz",
      "body": "According to Op, the letter stated that Amy and Luke tried to get married before OP and Luke got together, but they couldn’t because of moral and legal reasons. We have all presumed there’s really only one thing that could feasibly be= close blood relation.",
      "created_utc": 1727632706.0,
      "score": 41
    },
    {
      "id": "lpgzbfo",
      "body": "I knew this was fake when OP said she took his phone and laptop and sent it with the attorney and the husband just left he house with trash bags full of his stuff without even caring he didn't even have his phone.",
      "created_utc": 1727604663.0,
      "score": 33
    },
    {
      "id": "lpgj1xa",
      "body": "The story became stupid. \n\nKill off the father-in-law, Luke is a sexual fuck-a-bout, Amy is psycho, OP is a super sleuth - it just gets old.",
      "created_utc": 1727593396.0,
      "score": 32
    },
    {
      "id": "lpictf4",
      "body": "If they were half siblings, it would’ve been reflected in any of the kids test results.",
      "created_utc": 1727626432.0,
      "score": 5
    },
    {
      "id": "lpg49uf",
      "body": "[deleted]",
      "created_utc": 1727584499.0,
      "score": 14
    },
    {
      "id": "lpg3bu9",
      "body": "[deleted]",
      "created_utc": 1727584009.0,
      "score": 23
    },
    {
      "id": "lpgo2rn",
      "body": "That makes sense, Jim could not believe that his two children would sleep together. Denial Denial Denial  .",
      "created_utc": 1727596764.0,
      "score": 180
    },
    {
      "id": "lpgjo57",
      "body": "Where did you get that from?",
      "created_utc": 1727593796.0,
      "score": 16
    },
    {
      "id": "lpggn1a",
      "body": "That's what I thought but assumed I missed it since I didn't remember reading it.  Also can see from some of the posts on here that OP managed to out herself as this being fake?  Think we all really knew that, but it's made for entertaining reading so I can't be mad at that.",
      "created_utc": 1727591821.0,
      "score": 58
    },
    {
      "id": "lpfpqag",
      "body": "Actually… there is a comment I would like to edit. I did not choose my words very well, out of anger and I’d rather they not see that. I apologize for that. My anger was never directed towards the children but my choice in words were very poor.",
      "created_utc": 1727577652.0,
      "score": 17
    },
    {
      "id": "lpfyayh",
      "body": "Screw visitation, if he is capable of even HALF of the shit that he’s “rumored” to have done he doesn’t deserve any visitation just on the whole potential Alabama aspect of it all and very well may be in prison soon enough because of this regardless. The authorities do not take this shit lightly ESPECIALLY when there are reproduction(s) involved with it.",
      "created_utc": 1727581485.0,
      "score": 117
    },
    {
      "id": "lphllxx",
      "body": "I think she said her lawyers and the judge are ok with her making these posts because they are anonymous, names changed, etc, but advised her to NOT specify that one detail. I might have misconstrued, but I think that's why she's not directly stating it.",
      "created_utc": 1727616675.0,
      "score": 24
    },
    {
      "id": "lphtdji",
      "body": "Does it matter at this point? She shouldn’t give any details until everything is said and done. No matter if there’s evidence and it’s just for her own case or if it’s because there isn’t evidence and it needs to be sorted out. But the fact that she only mentioned DNA tests of the kids, I‘d say there is something that makes DNA testing Amy and Luke unnecessary.",
      "created_utc": 1727619718.0,
      "score": 5
    },
    {
      "id": "lpmdgfz",
      "body": "This!!! Tom is almost 18 so he could legally move  in with OP but I definitely think Kaylee should try emancipation.",
      "created_utc": 1727684569.0,
      "score": 6
    },
    {
      "id": "lphj6yg",
      "body": "Their references to me in the letters were entirely robotic. I was there, I existed, and they maneuvered around me. Judging by the letters, I found no contempt toward me, but I didn't see much love either. Luke didn't express love, but neither did Amy express jealousy.",
      "created_utc": 1727615652.0,
      "score": 151
    },
    {
      "id": "lpjigfu",
      "body": "What did the good folks in Alabama do to deserve THEM???",
      "created_utc": 1727639325.0,
      "score": 6
    },
    {
      "id": "lph42lv",
      "body": "I was thinking her religious upbringing goes a long way to explaining why OP had poor boundaries and could be easily gaslit (with apologies and sympathy towards OP for my bluntness)",
      "created_utc": 1727607855.0,
      "score": 25
    },
    {
      "id": "lpgdk2f",
      "body": "Polyamory is not normalized in the Mormon religion, at all. It was outlawed a long time ago and the church broke off into two sectors. Mainstream Mormonism is extremely against polyamory and it’s considered super taboo. Fundamental LDS is different, but OP specified polyamory was a trigger growing up Mormon and that’s because of the stereotypes.\n\nI’m not Mormon myself, I’m just married to an ex Mormon and come from a super LDS community.",
      "created_utc": 1727589851.0,
      "score": 14
    },
    {
      "id": "lqjse8f",
      "body": "Amy was Luke’s best friend. According to Cat, she and Jim -both- wanted to get her out of that situation. Amy never wrote anything about suspecting the truth before she was told.",
      "created_utc": 1728177231.0,
      "score": 43
    },
    {
      "id": "lql1xf1",
      "body": "I couldn’t help but share that my Grandfather brought my Aunt home with him as an infant, and handed her over to my Grandmother and said, “This is my daughter, and you will raise her.” PERIOD! My Grandmother was an incredibly strong woman, and when I think of what it must have took for her to be able to do that, not to mention stay with my Grandfather AND forgive him, I struggle to wrap my head around it, but my point is that you’d be surprised.😳🤷🏻‍♀️",
      "created_utc": 1728199582.0,
      "score": 8
    },
    {
      "id": "lpf975e",
      "body": "Yup. So you can always check what other people have posted by clicking on their user name and then choosing View Profile. It shows you their past posts and comments. (Idk if you already knew that but there may be someone out there that those instructions help.) Incest is illegal in all 50 US states  but the penalties vary by state. As far as other countries, I believe it is illegal in most countries, but I don't know anything about penalties.",
      "created_utc": 1727570790.0,
      "score": 155
    },
    {
      "id": "lpfqyn6",
      "body": "In \"Update III\" OP said her lawyer advised for her to not get the DNA test done because of something to do with the case. Sophie and Tom were getting Cat's help to do the DNA test as the \"loophole.\" In \"Brief Update,\" OP advised that Cat admitted she never sent the DNA tests in and that she lied about the test results being negative.",
      "created_utc": 1727578187.0,
      "score": 159
    },
    {
      "id": "lpfqz98",
      "body": "Didn’t op then say that cat admitted she hadn’t really done any dna testing on the kids and had lied to her about this so she is back in the dark again",
      "created_utc": 1727578194.0,
      "score": 34
    },
    {
      "id": "lpftpn5",
      "body": " Cat, their grandmother, lied about sending in the DNA tests. The evidence OP found on Luke’s computer conclusively shows that Amy and Luke are half siblings.",
      "created_utc": 1727579408.0,
      "score": 31
    },
    {
      "id": "lpfsh6l",
      "body": "In a post after that she says that Cat admitted to never sending in the test and lying about the results. She didn't feel right going behind Luke's back. That's the reason op needs Cat to earn back her trust.",
      "created_utc": 1727578859.0,
      "score": 13
    },
    {
      "id": "lpfu0bi",
      "body": "The grandmother (Cat) didn't actually send the test in. She says that in a later update",
      "created_utc": 1727579534.0,
      "score": 9
    },
    {
      "id": "lpfd4rc",
      "body": "No, what I gather is Sophie and Tom were never interested in each other. They just used that as a ruse to get to the bottom of their parents affair. \n\nPoor kids must be blaming themselves for how this whole thing has blown up. On top of their grandfather's death.",
      "created_utc": 1727572386.0,
      "score": 113
    },
    {
      "id": "lpf9350",
      "body": "No.  Tom and Sophie were acting their relationship (they say) to force Luke and Amy to fess up to their affair based on Tom's suspicions.",
      "created_utc": 1727570746.0,
      "score": 67
    },
    {
      "id": "lpf9g0w",
      "body": "I think they are saying that Jim's affair baby is Amy which would make her Luke's half-sibling.\n\nWhat I don't understand is why they would be hesitant to explore a romantic relationship if they weren't aware Jim was Amy's father.\n\nWhy not just date normally?\n\nIf they did know, they engaged in incest.",
      "created_utc": 1727570889.0,
      "score": 45
    },
    {
      "id": "lpfhjeh",
      "body": "Amy lives in her own home but Jim gave her money which leads us to believe she is his affair baby",
      "created_utc": 1727574200.0,
      "score": 21
    },
    {
      "id": "lpgffwk",
      "body": "According to Op: think Amy’s bio mom was a family friend who Jim had an affair with. Amy was being sexually abused so Jim and Cat decided to adopt her. Cat didn’t know Jim was biologically Amy’s dad. Kinda like op was helping Amy’s kid. At some point, Jim caught Amy and Luke either in the act or close to it, and told the two that they were related hence why he was so adamant that they weren’t sleeping together as a adults because they already knew they were siblings and “allegedly” committing incest",
      "created_utc": 1727591046.0,
      "score": 6
    },
    {
      "id": "lpfuxf1",
      "body": "If you want to know the whole story you need to read all the updates as well as OP’s comments. Otherwise you’re just going to stay confused.",
      "created_utc": 1727579916.0,
      "score": 15
    },
    {
      "id": "lpg9fm6",
      "body": "That's actually not the worst idea...",
      "created_utc": 1727587371.0,
      "score": 142
    },
    {
      "id": "lpmcn18",
      "body": "I don't think she knew what Luke and Amy were doing. \n\nI don't think she found out what Jim did until I told her.",
      "created_utc": 1727683974.0,
      "score": 61
    },
    {
      "id": "lpikw9p",
      "body": "I bet you want an interview with both of them, lol 😆 . I'm sure you'll get inspired to write so many papers and forget about struggling to find a subject for a PhD. I'm sure they will give you answers that will feed and inspire your career for years.",
      "created_utc": 1727629005.0,
      "score": 6
    },
    {
      "id": "lpwnaui",
      "body": "I think he kept his two lives separate in his head, that’s why when he talked to Amy about OP it was robotic. Whatever little bubble he had with Amy didn’t intercept with his real life.",
      "created_utc": 1727831390.0,
      "score": 11
    },
    {
      "id": "lpnaq9x",
      "body": "I feel so sorry for Cat, too. OP was living with a lie for 20 years while Cat was living more than 40 years…",
      "created_utc": 1727703011.0,
      "score": 20
    },
    {
      "id": "lpzr4cl",
      "body": "Or he only tried to salvage the marriage to keep the REAL secret hidden and when it was obvious he wasn't going to be able to manipulate OP anymore, he decided to switch tactics and team up with Amy to discredit OP before she could stumble on anything that could actually do damage to them (which she did, and they deserve it).",
      "created_utc": 1727884391.0,
      "score": 7
    },
    {
      "id": "lpqfmch",
      "body": "She was totally clueless about that part.",
      "created_utc": 1727740666.0,
      "score": 117
    },
    {
      "id": "lpqd5s9",
      "body": "As far as I can tell, yes. They first slept together when they were seventeen, and by that point, they had known for a while.",
      "created_utc": 1727739764.0,
      "score": 88
    },
    {
      "id": "lpq1gon",
      "body": "I wonder if Amy's mom told her.  If Amy told Luke, they might have asked Jim about it. He would have to come clean and ask them not to tell Cat.",
      "created_utc": 1727735492.0,
      "score": 10
    },
    {
      "id": "lqh0elu",
      "body": ">And the realisation must have been..\n\nEnough to give him a heart attack... or a stroke... or something like that...",
      "created_utc": 1728143615.0,
      "score": 6
    },
    {
      "id": "lup6dsa",
      "body": "Thank you, kind stranger.\n\nWe’ve been better but today I just want them to have fun.",
      "created_utc": 1730384102.0,
      "score": 21
    },
    {
      "id": "lpfojw2",
      "body": "Personally I can’t see a court seeing that it’s fit for Amy to continue to be a mother. She (allegedly) committed incest and birthed children from said incestuous union REPEATEDLY. There are confirmed letters, videos, photos, proving the affair and what OP and her lawyers discovered. Amy came to another person’s home where she assaulted them and destroyed property (side note: I believe OP has audio of her desperate to get OP to delete whatever she might have found which will help in court to hopefully rule out the “it wasn’t an affair but an open marriage). Then she committed slander (or if it was a text post I think it’s liable) by telling everyone online lies about OP. This woman is getting backed into a corner and she knows it. Any further action Amy or Luke does is not going to look good for them and it’s just going to provide more damning evidence. I only hope whatever they do… it doesn’t involve hurting the children.",
      "created_utc": 1727577152.0,
      "score": 62
    },
    {
      "id": "lpgqnfq",
      "body": "Jim's hands are not clean, but, Amy and Luke are responsible for their own actions.",
      "created_utc": 1727598522.0,
      "score": 106
    },
    {
      "id": "lpiik39",
      "body": "Jim got an easy out, tbh",
      "created_utc": 1727628262.0,
      "score": 35
    },
    {
      "id": "lpfxsvf",
      "body": "I wonder who's gonna be throwing who under the bus, because I doubt neither of them would be claiming they knew and still went through with it. My bet's on Luke. He sounds like a little weasel.",
      "created_utc": 1727581249.0,
      "score": 38
    },
    {
      "id": "lpftjet",
      "body": "I think that's what in those letters. Maybe not as simple but maybe something like \" it's too bad we are related because if we were not we could have gotten married in Italy and honeymoon in Iceland. Ah i wish dad didn't know I was his daughter blablabla...\"",
      "created_utc": 1727579330.0,
      "score": 35
    },
    {
      "id": "lpfs55r",
      "body": "In the future, changing schools is something I may discuss with them. But for the time being, there's been enough change.",
      "created_utc": 1727578712.0,
      "score": 79
    },
    {
      "id": "lpmd0lm",
      "body": "Luke and Amy are now aware of the posts, but only because, at the direction of my attorney, I disclosed their existence to Luke and to the Judge.",
      "created_utc": 1727684248.0,
      "score": 71
    },
    {
      "id": "lqg8y9h",
      "body": "If OP is a casual GoT fan, I think she’s referring more to the early-series Stark family dynamic where Jon was raised as a half-sibling- before Jon’s actual parentage was revealed. In that context, it makes sense to say Luke and Amy are more like if Jon and Arya were a couple (half siblings), than Jaime and Cersei (full siblings).",
      "created_utc": 1728134099.0,
      "score": 21
    },
    {
      "id": "lre9w4v",
      "body": "My family’s not in the picture. \n\nMy other friends don’t know everything, but they’re being supportive. They believe me 100%",
      "created_utc": 1728646007.0,
      "score": 69
    },
    {
      "id": "lpfhjj2",
      "body": "That was my thought too. Amy was obviously damaged by her childhood, so this behavior makes sense; doesn’t excuse it, but certainly tracks with CSA. I just do not understand how Luke got into that position. It just does not compute in any scenario.",
      "created_utc": 1727574201.0,
      "score": 38
    },
    {
      "id": "lpl0zny",
      "body": ">my theory is they wanted a family together and all the weird ramblings about why she wouldn’t use contraception were just a made up story\n\nFully agreed! I think the children were definitely planned, at least on Amy's part. I'm still a little caught up on the detail OP stated earlier about Luke and Amy being off and on until she became pregnant with their eldest. The level of manipulation needed to think up this plan and rope OP into this predicament is sociopathic. Neither Luke nor Amy could find a consenting beard for their respective lavender marriage/relationship?",
      "created_utc": 1727658792.0,
      "score": 6
    },
    {
      "id": "lqm4r85",
      "body": "Like, imagine she already has to deal with shitty kids picking on her because of a condition she had no choice about. It doesn't bear thinking about what she might also face once the rumour mill warms up. Luke and Amy were already shit stains on society for their behaviour but imagine being so self absorbed to knowingly have a child through incest, knowing how that could affect them physically and socially, and not give a single fuck is just inconceivable.",
      "created_utc": 1728222206.0,
      "score": 7
    },
    {
      "id": "lppwcpa",
      "body": "That's been taken care of. A number of comments are worried about Tom. They don't need to be, under the circumstances. Sorry, this is tricky to talk about without getting more into the details of the case.",
      "created_utc": 1727733661.0,
      "score": 62
    },
    {
      "id": "lpo58bb",
      "body": "I was just thinking of Tom’s safety as well after I saw OP’s comment about Luke and Amy’s awareness of these posts. I truly hope his 18th birthday isn’t too far off so he can more authority and autonomy to do things outside of Amy and Luke’s control.",
      "created_utc": 1727713461.0,
      "score": 9
    },
    {
      "id": "lpg3tyr",
      "body": "I'm sure it shows you have shitty decision making skills.",
      "created_utc": 1727584263.0,
      "score": 5
    },
    {
      "id": "lpf8abt",
      "body": "Wow so she alluded to the incest in her post by saying your lying about a bet provable thing? She's going to be in for a huge shock. Honestly,  this seems like a possible self harm situation developing.  \n\n\nI know Amy doesn't work,  but is this affecting Luke's employment at all? You say Cat is supporting Amy, where is Luke's money going?",
      "created_utc": 1727570439.0,
      "score": 310
    },
    {
      "id": "lq1rhqn",
      "body": "OP, how did you discover that Luke and Amy are half siblings? Was it mentioned by Luke and Amy in their messages to each other?",
      "created_utc": 1727907554.0,
      "score": 69
    },
    {
      "id": "lpg1rwq",
      "body": "So they are both still under the impression you didn't see anything on the laptop she broke? And assuming you are the one making assumptions on their relations?",
      "created_utc": 1727583196.0,
      "score": 113
    },
    {
      "id": "lphglgw",
      "body": "If they are Luke's, that's between the two of them? How delusional can someone be?! YOU. ARE. HIS. WIFE!! It has everything to do with you! Amy is truly a crazy psycho",
      "created_utc": 1727614507.0,
      "score": 114
    },
    {
      "id": "lpgyy6v",
      "body": "Why's the lawyer talking about open marriages? That's not a defence for infidelity, legally.",
      "created_utc": 1727604404.0,
      "score": 66
    },
    {
      "id": "lplnbkz",
      "body": "I’ve been following your story for some time and they definitely took advantage of your sweet and loving nature, sadly now you know you can’t be the nice girl anymore, especially not in this instance because with everything that has happened, the things they’ve done and said, they’ve shown you that they will absolutely show you no mercy no matter how hard you try to make this cordial, time to play fire with fire.",
      "created_utc": 1727668150.0,
      "score": 27
    },
    {
      "id": "lpus1fs",
      "body": "Incestous relationships often result in health problems down the line, so it's not only their problem, the kids are now scarred for life",
      "created_utc": 1727808600.0,
      "score": 11
    },
    {
      "id": "lpuuaou",
      "body": "I would respectfully disagree that if any of Amy’s children are Luke’s that it is solely between them. Unfortunately since he did cheat on you and this is now part of your imminent divorce proceedings it is now a court matter that involves you and them! I realize it’s not this forums business but as with any court filing this will become public knowledge should this information be identified as discovery in your eventual court case. I’ve been through a divorce and unfortunately the good, the bad and ugly come up whether we like it or not. \n\nIn my transparency I was the one cheated on and it’s not easy to see that laid out in court!",
      "created_utc": 1727809295.0,
      "score": 10
    },
    {
      "id": "lpz0fnr",
      "body": "You could use Sophie and Tom as witnesses to prove the open marriage is not true.",
      "created_utc": 1727875373.0,
      "score": 6
    },
    {
      "id": "lqw3aro",
      "body": "You mean they lied to their attorney? Worse yet to the JUDGE? OMG",
      "created_utc": 1728360459.0,
      "score": 6
    },
    {
      "id": "lpiee7f",
      "body": "FTN Kayleigh has the same rare condition that OP's ex has you cannot tell me that the one person who knew they were half siblings and knew their history of attraction didn't suspect something? Even when his wife brought it up multiple times through the years her suspicions. Jim could not have been that obtuse. ",
      "created_utc": 1727626927.0,
      "score": 76
    },
    {
      "id": "lpihza3",
      "body": "Amy was Jim's affair child? When did that happen? Didn't we just assume it? I am confused now.",
      "created_utc": 1727628078.0,
      "score": 41
    },
    {
      "id": "lpuum23",
      "body": "is it safe to assume Jim heart attack was caused by the stress of the incestuos revelation? And yet Luke doesn't feel remorse about it and saw it as an opportunity to hide the truth? OP your soon to be ex husband is a really twisted man who doesn't care about anyone but himself and his relationship with Amy",
      "created_utc": 1727809394.0,
      "score": 10
    },
    {
      "id": "lpvjmrx",
      "body": "So his infidelity and betrayal ultimately, directly or indirectly,  became the death of him.",
      "created_utc": 1727817124.0,
      "score": 8
    },
    {
      "id": "lpmi08f",
      "body": "Most likely he case here but, Amy had 4 kids and no daddy to come and claim any of them, alarm bells should have been ringing",
      "created_utc": 1727687905.0,
      "score": 9
    },
    {
      "id": "lpoab5q",
      "body": "Honestly, I thought that he had a heart attack because his house of cards was about to come tumbling down. With OP's divorce looming his wife (Cat) would finally find out that for the last 20+ years he's been using marital assets to take care of his affair child and her kids. But your assumption could be true too. While I think Cat is shitty for supporting Amy's kids because she thought her son had been cheating on OP, I still feel sorry for her because she is basically the older version of OP. Her husband used marital funds to take care of his affair, child and did it blatantly (just like her shitty son). And now that Jim's dead she doesn't even get the satisfaction of spitting in his face and divorcing him like OP can. ",
      "created_utc": 1727715101.0,
      "score": 8
    },
    {
      "id": "lph73ar",
      "body": "I’d call myself once everything comes out in court. Both Luke and Amy are cruel to their core. They put their perverse sexual desires over their children. All four of them were hidden and without a father that claimed them. Literally they were part of the secret…not to mention the medical issues they subjected their children too. Kaylee already has her father’s condition. I am sure other issues will come up with the other three. \n\nI’m so proud of you for telling the truth.\nI know that took courage due to wanting to protect the children from shame. But it’s better this way in the long run. \n\nPlus. The monsters are still scheming. It’s sick that they probably saw the “advantage” of Jim passing away because then they could spin more lies. They thought you didn’t know about their blood relation…they didn’t even want others to believe they had an affair. Instead they wanted to make it seem like you were the vindictive, bitter one. They probably were going to say you got mad because he finally wanted to be with only Amy. They still were holding on to the fake image they created. \n\nI hope Cat eventually cuts them off especially if their children get taken away.",
      "created_utc": 1727609662.0,
      "score": 91
    },
    {
      "id": "lqfr2i8",
      "body": "I've worked within Child Protection. 110000% it WILL happen. Child Protection/Child Safety will definitely be involved. My specialisations are children and young people, grief, crisis, trauma and early intervention. 15 years experience. \n\n\nI'm not a practicing counsellor atm due to medical leave. But, I can give some guidance regarding this. Please reach out to me if you want to. Offer is always there. I've been thinking about you and your family.",
      "created_utc": 1728125165.0,
      "score": 7
    },
    {
      "id": "lpmnhkd",
      "body": "Tom has my support and love 😭 I can't imagine what that kid is feeling right now especially his siblings. The children don't deserve this. You have the reddit community behind your back, OP.",
      "created_utc": 1727691703.0,
      "score": 40
    },
    {
      "id": "lq9a3qg",
      "body": "Tom is a good kid. I hate that he and his siblings are having to go through this. All this happened because his parents were selfish.",
      "created_utc": 1728018771.0,
      "score": 9
    },
    {
      "id": "lpgethi",
      "body": "Has she said that or is it a guess? There’s so much to read I may have missed that bit lol",
      "created_utc": 1727590652.0,
      "score": 65
    },
    {
      "id": "lpgaput",
      "body": "I can’t see their username. It just says deleted. 😕",
      "created_utc": 1727588126.0,
      "score": 6
    },
    {
      "id": "lpgobkm",
      "body": "And if he realized what they were doing the implications would be huge. I don't think, from what OP has told us about Jim, that he would be able to keep quiet on that matter.",
      "created_utc": 1727596930.0,
      "score": 63
    },
    {
      "id": "lpgjqex",
      "body": "Previous posts from OP, the comments and a comment OP made which basically confirmed it",
      "created_utc": 1727593837.0,
      "score": 64
    },
    {
      "id": "lpggtbi",
      "body": "No clue about that but I'd rather it be fake, and those kids wouldn't go through these things because that must be one hell of a trauma",
      "created_utc": 1727591937.0,
      "score": 58
    },
    {
      "id": "lphy0wf",
      "body": "Not that I don't think that this is fiction, but the person shouting most loudly about the \"proof\" took a screen shot of a comment that is written from the perspective from OP, but posted by an apparent alt account, which is clearly not the account of someone who could be in OP's position. The problem with accepting that as proof is that anyone, including you or I, could make a post that appears to be from OP. It doesn't mean that it was OP posting from an alt.",
      "created_utc": 1727621394.0,
      "score": 9
    },
    {
      "id": "lqv3y4g",
      "body": "Considering the illegal activity that her parents have been engaged in for decades it sounds like a judge could/would grant this.",
      "created_utc": 1728346438.0,
      "score": 5
    },
    {
      "id": "lphmzke",
      "body": "I'm sure this detail is the least of your worries at the moment, but... I'm so sorry, I can imagine how that hurts. You seem to be handling this nightmare with a level head, and I'm glad for ALL the kids that they have you. Even if Amy's kids can't lean on you right now, and I know it hurts to not be able to comfort them right now, they still have you in the long run. And if the youngest ones don't realize it yet, I'm sure Tom would be able to reassure them that they have YOU in their corner.",
      "created_utc": 1727617239.0,
      "score": 53
    },
    {
      "id": "lpi171k",
      "body": "I think Luke played her just as much as she played you and everyone else. I don’t think he’s “in love” with her completely. If so, he wouldn’t have married you and had four children. He could have been single. Unless they explicitly thought he needed a cover in a form of a successful, kind woman.\n\nIn that case, he and she deserve to rot in the lowest level of hell.",
      "created_utc": 1727622502.0,
      "score": 39
    },
    {
      "id": "lpnyv3e",
      "body": "Kant's definition of evil is essentially \"treating people as means rather than as ends.\"  This fits your description of these two.  You are doing the right thing by taking the power and fighting them.  May you emerge from this victorious, and remember that the best revenge is living well.",
      "created_utc": 1727711389.0,
      "score": 16
    },
    {
      "id": "lpokdjg",
      "body": "I don’t say that to hurt you, only to keep you clear eyed, as I think you already are. You were a prop in their theatre. Not your fault, if not you, it would have been someone else. They are both master manipulators, they both faked their relationship with you, just as they faked their own relationship to their father and their children. Nothing in their lives was real and you are not the only one they lie to. They are sociopaths. Keep your children away from them. \nThat being said, I still hope none of this is real. This is just a well told intriguing tale and no one would really have to deal with this kind of evil and heartbreak.",
      "created_utc": 1727718282.0,
      "score": 9
    },
    {
      "id": "lpi13ps",
      "body": "Where is your side of the family in all of this? Do they know the details of the situation?",
      "created_utc": 1727622469.0,
      "score": 5
    },
    {
      "id": "lpmha6s",
      "body": "In a way, he used you as a sort of “lavender marriage” just in a different sense.",
      "created_utc": 1727687378.0,
      "score": 7
    },
    {
      "id": "lpge5cv",
      "body": "OP confirmed her family was FLDS in a very early comment, that's why she is NC with them.",
      "created_utc": 1727590227.0,
      "score": 27
    },
    {
      "id": "lpfrbpc",
      "body": "Ah ok I just saw it. Damn I had my hopes up that this was fake and a bunch of kids weren't dealing with this fcked up situation:/",
      "created_utc": 1727578346.0,
      "score": 29
    },
    {
      "id": "lpfre3f",
      "body": "Yes she did in the brief update, I just went back and read it again. My bad.",
      "created_utc": 1727578376.0,
      "score": 8
    },
    {
      "id": "lpfar9n",
      "body": "I mean tom and Sophie are half siblings like Luke and Amy right \nThat's what i was trying to understand",
      "created_utc": 1727571421.0,
      "score": 28
    },
    {
      "id": "lpfajh9",
      "body": "I think Amy and Luke KNEW they were half siblings but still did all of this",
      "created_utc": 1727571334.0,
      "score": 93
    },
    {
      "id": "lpgf1el",
      "body": "They were aware they were siblings. Based on OP comments, Jim told Luke and Amy when they were getting closer that they were siblings that’s why Jim was so sure that nothing was going on between the two when  they were adults. Amy came from abused home, so Jim and Kat decided to adopt her without Cat realizing Jim cheated and was biologically Amy’s dad.",
      "created_utc": 1727590791.0,
      "score": 18
    },
    {
      "id": "lph7d6m",
      "body": "Maybe Kaylee could emancipate herself.",
      "created_utc": 1727609817.0,
      "score": 39
    },
    {
      "id": "lpn0r1y",
      "body": "But then why would she lie about the paternity test? I thought Jim might have found out about this and saw that he had to tell her the truth, she then realized the mess it all actually was and so decided to lie",
      "created_utc": 1727698823.0,
      "score": 16
    },
    {
      "id": "lpnbxu0",
      "body": "What exactly did Jim do?",
      "created_utc": 1727703499.0,
      "score": 10
    },
    {
      "id": "lpqfyys",
      "body": "And her beloved son knew. He kept it hidden from his mom.",
      "created_utc": 1727740796.0,
      "score": 39
    },
    {
      "id": "lpqhidk",
      "body": "Did Amy's \"father\" knew she wasn't biologically his? What are her parents true story?  \nAnd why did Jim told them to begin with? Did Amy's mom had something to do with it? Did she tell Amy something which forced Jim to spill? (I understand that there's a lot you don't know yet or can't say, so answer what you know/can)",
      "created_utc": 1727741365.0,
      "score": 26
    },
    {
      "id": "lpqiydu",
      "body": "If you can/want to would you mind explaining how Jim got Cat on board to raise a random little girl from no where? Like what did he tell her/lie to her when that came up? Did she come out of no where and then he explained or did he explain about her to Cat and then brought her? Genuinely just curious bc I can't figure out how that just happened.",
      "created_utc": 1727741899.0,
      "score": 26
    },
    {
      "id": "lpqrkkm",
      "body": "You need to write a book (or a series of books). \n\nGenuinely, even if it is not for publishing, for your own catharsis. \n\nYou seem to be indexing the information well, but there are so many threads and aspects to this situation, I’m not sure how you’re managing so well\n\n(Congrats again on holding it together for the kids)",
      "created_utc": 1727745089.0,
      "score": 20
    },
    {
      "id": "lpfreyv",
      "body": "All true. Kaylee and Tom are suffering though from being forced to be in Amy’s home. Amy is going to fight to keep her children. A lengthy court proceeding over whether she should keep custody or not could be even more traumatic for them. If they both file for emancipation it could speed up the process.",
      "created_utc": 1727578387.0,
      "score": 31
    },
    {
      "id": "lpzppo8",
      "body": "Reading your comment just made me very worried for the kids to have it all spelled out like that… this is a family annihilator situation to me…",
      "created_utc": 1727883941.0,
      "score": 5
    },
    {
      "id": "lpw2ppi",
      "body": "Jim was a better human when he told his two kids when he noticed them sharing feelings. When Luke and Amy noticed your Sophie and Tom having feelings, they didn’t do the same. They are disgusting. At least Jim knew his secret couldn’t  be kept from them and he came clean",
      "created_utc": 1727823714.0,
      "score": 13
    },
    {
      "id": "lpgmgou",
      "body": "Both of them will go down as the letter proved both of them are aware. I still do want to know what is in that letter.",
      "created_utc": 1727595664.0,
      "score": 5
    },
    {
      "id": "lph1jjp",
      "body": "My dear, I’m very sorry that you’re going through so much, a warm and huge hug. You are not guilty of anything, I am glad that you are in therapy and you are dealing with all your emotions. All this is just the result of the stupid actions that Amy and Luke took, what did they expect to happen? They are so unpleasant, they have broken all the trust and illusions not only of you but also of your children. My God!! You are a strong mom, keep supporting your children, I am glad that you have prioritized your mental health, little by little  you and your children will overcome this horrible situation and keep moving, at the moment it will be difficult for them, but with your love they will be able to overcome it.. Take good care of yourself",
      "created_utc": 1727606211.0,
      "score": 10
    },
    {
      "id": "lpmlr0q",
      "body": "I wonder if Amy has been scrolling the comments like most people would. I kinda hope so, cuz maybe some 3rd party perspective will wake her up to what a scumbag she is",
      "created_utc": 1727690551.0,
      "score": 67
    },
    {
      "id": "lqhdir3",
      "body": "Twins, at that",
      "created_utc": 1728147773.0,
      "score": 8
    },
    {
      "id": "lreuyo6",
      "body": "I’m happy you have people in your corner besides us internet strangers!! Hugs!",
      "created_utc": 1728654916.0,
      "score": 16
    },
    {
      "id": "lrfdh88",
      "body": "Now is probably not the time, but one day I bet you could do a heck of an AMA on “I was adopted and raised by an FLDS family.” There is no way you’ll ever run out of topics to discuss with your therapist.",
      "created_utc": 1728661185.0,
      "score": 10
    },
    {
      "id": "lpfkzo0",
      "body": "My understanding is that she initiated. Doesn't mean he wasn't preying on her, but they were the same age and had always been equals, so it seems unfair to just assume he took advantage.",
      "created_utc": 1727575643.0,
      "score": 97
    },
    {
      "id": "lpq2u9k",
      "body": "Thank you for letting us know we don’t have to worry about Tom.   You seem to be made of some pretty strong stuff, and know what you need to do to get to the other side of this.    The kids, especially Amy’s, are innocent victims in this.   Your world got rocked down to the foundation.   Theirs has outright imploded.    I know you have said you are seeking therapy for you, and your children.   I hope between you and Cat, you are able to get Amy’s kids some counseling.   It doesn’t sound like Luke or Amy will do what they need to help those kids through this.   Because the first thing they would need to do is not stay under the same roof.   That’s not just clueless, it’s cruel to the children.   Adds insult to injury, so to speak.",
      "created_utc": 1727735989.0,
      "score": 12
    },
    {
      "id": "lq0w2cl",
      "body": "Such a burden to carry at such young age... Sophie and Tom just became adults overnight. Tom was almost there but still ❤️❤️",
      "created_utc": 1727897333.0,
      "score": 6
    },
    {
      "id": "lpf8fye",
      "body": "They both work, and so far as I know, it hasn't affected their employment.",
      "created_utc": 1727570498.0,
      "score": 274
    },
    {
      "id": "lppl0yb",
      "body": "Incest? Is Amy Jim's?",
      "created_utc": 1727729784.0,
      "score": 7
    },
    {
      "id": "lq93ivz",
      "body": "They discuss in their letters to each other. \n\nAnd one of their sex tapes, apparently.",
      "created_utc": 1728015254.0,
      "score": 162
    },
    {
      "id": "lpg9nw6",
      "body": "They know what I found.",
      "created_utc": 1727587503.0,
      "score": 199
    },
    {
      "id": "lq82ps5",
      "body": "Right? Not to mention the children themselves having the right to know!",
      "created_utc": 1728000607.0,
      "score": 17
    },
    {
      "id": "lpm5aft",
      "body": "Luke’s lawyer argued that this wasn’t infidelity because OP was always aware of the relationship. OP’s lawyers countered with their recent discoveries of communications discussing both hidden infidelity and (apparently) incest. If the court finds this relevant, everybody’s gonna get a court-ordered twenty-three-and-me.",
      "created_utc": 1727678722.0,
      "score": 48
    },
    {
      "id": "lq6y7lh",
      "body": "If he uses that as a defense it will  hopefully put to bed the possibility that there was an affair. Luke is STILL trying to protect Amy in this mess, he doesn't give a damn about OP.",
      "created_utc": 1727986521.0,
      "score": 13
    },
    {
      "id": "lpvj6t2",
      "body": "And apparently he's unaware that Luke's having relations with a sibling...Under those circumstances I wouldn't be slinging accusations regarding an open relationship.  I'd have my mouth shut and my head in the sand.",
      "created_utc": 1727816982.0,
      "score": 16
    },
    {
      "id": "lpik437",
      "body": "I hear you; I think he likely was in denial, it’s a powerful thing. Sort of like a “don’t ask, don’t tell” type of situation. I mean, all of us strangers are totally horrified at the situation and can’t believe it… could you imagine being in Jim’s shoes? I wouldn’t want to believe it was possible either. Whether it was just his brain blocking out the horrible possibility or him willingly being unaware… idk, that’s just the read I got on the situation!",
      "created_utc": 1727628754.0,
      "score": 68
    },
    {
      "id": "lpj1kry",
      "body": "He probably thought Kaylee got the gene from him since that’s his granddaughter.",
      "created_utc": 1727634060.0,
      "score": 45
    },
    {
      "id": "lpla2be",
      "body": "He likely would’ve gone for the more obvious assumption of Kaylee inheriting from himself, not his son.",
      "created_utc": 1727662404.0,
      "score": 18
    },
    {
      "id": "lpplear",
      "body": "I guess he could have reasoned to himself that the allergy was a recessive gene that skipped Amy.\n\nOr maybe he just refused to acknowledge it.",
      "created_utc": 1727729904.0,
      "score": 5
    },
    {
      "id": "lpij6nb",
      "body": "It hasn’t been confirmed by OP because she can’t speak on it legally but she’s basically all but confirmed it to some people who have commented that theory!",
      "created_utc": 1727628461.0,
      "score": 59
    },
    {
      "id": "lpvcf8o",
      "body": "I’m not sure if it’s “safe” to assume the heart attack was solely caused by this news coming out because I don’t know what other health issues Jim might have been dealing with at this time. But it seems to be pretty convenient timing for the heart attack to occur shortly after the information is learned. I would at least suspect the stress surrounding the situation was a factor if not the sole cause.",
      "created_utc": 1727814880.0,
      "score": 5
    },
    {
      "id": "lpvoaop",
      "body": "I would say that’s the ultimate example of karma if there ever was one!",
      "created_utc": 1727818644.0,
      "score": 6
    },
    {
      "id": "lpkmx1v",
      "body": "So it’s been confirmed that they are blood related?",
      "created_utc": 1727653209.0,
      "score": 12
    },
    {
      "id": "lpgiknd",
      "body": "She’s never come out and said it, but this post is more than enough to read between the lines. Jim must have cheated on Cat, she didn’t find out until after he died.",
      "created_utc": 1727593087.0,
      "score": 187
    },
    {
      "id": "lpicikf",
      "body": "She def confirmed it in a reply in a comment like 22 posts ago haha.",
      "created_utc": 1727626340.0,
      "score": 8
    },
    {
      "id": "lq08eef",
      "body": "Good point. She was a pawn. They were indifferent to her and Luke is a sociopath if he can be that good of an actor for 20 years. I feel for OP. She escaped an LDS abusive childhood, is NC with her family, is recovering from that tragedy and thinks she meets a great guy! Who happens to have a great and loving and accepting family! Not knowing she’s a pawn in some bizarre twisted incest world.",
      "created_utc": 1727889808.0,
      "score": 11
    },
    {
      "id": "lpshwec",
      "body": "Definitely sociopaths. Truly. I hope Cat cuts them both off, changes the will, and gets their children. I hope OP finds the true love of her life and has the best years ahead of her.",
      "created_utc": 1727778540.0,
      "score": 8
    },
    {
      "id": "lpiokjm",
      "body": "OP is NC with her family, she was brought up in a polygamous LDS family which was traumatic for her.",
      "created_utc": 1727630153.0,
      "score": 17
    },
    {
      "id": "lpfvtoo",
      "body": "This is definitely fake. None of the “legal advice” OP talks about is real.",
      "created_utc": 1727580327.0,
      "score": 70
    },
    {
      "id": "lpfdiur",
      "body": "Tom & Sophie share the same dad & grandfather on BOTH sides. \n\n\nWhatever Alabama defines that as",
      "created_utc": 1727572547.0,
      "score": 86
    },
    {
      "id": "lpfc7zh",
      "body": "There was no relationship between Tom and Sophie. They told their parents they wanted to date as a trick to try to get them to admit that Tom and Sophie are siblings.",
      "created_utc": 1727572015.0,
      "score": 30
    },
    {
      "id": "lpfkdex",
      "body": "Tom and his siblings are cousins to each other…actually they are half siblings to Sophie and her sibs, as well as cousins to them! \n\nAND Tom is his own cousin…\nWowzers",
      "created_utc": 1727575382.0,
      "score": 25
    },
    {
      "id": "lpfsp2y",
      "body": "It's why Amy went batshit- she didn't want anyone to know",
      "created_utc": 1727578956.0,
      "score": 35
    },
    {
      "id": "lpj398g",
      "body": "She's 14. She would have to establish that she can care for herself without assistance. That won't happen",
      "created_utc": 1727634583.0,
      "score": 11
    },
    {
      "id": "lpn2jql",
      "body": "Apparently she felt guilty doing the test behind Luke's back is all.",
      "created_utc": 1727699641.0,
      "score": 49
    },
    {
      "id": "lppx50s",
      "body": "He cheated on Cat.",
      "created_utc": 1727733949.0,
      "score": 54
    },
    {
      "id": "lpo332s",
      "body": "Based on the few most recent posts and OP’s comments, it’s speculated the Jim is Amy’s biological father (she was an affair baby) therefore making Amy and Luke half siblings and all of their children siblings/cousins (worse is Amy’s children are essentially inbred). At one point, possibly when Luke and Amy were younger,  Jim confessed to them about their paternity to prevent them have pursing a romantic relationship (it’s speculated he suspected they were fooling around that’s why he told them) but that knowledge obviously didn’t stop them. Cat was seemingly unaware of all of this until recently.",
      "created_utc": 1727712763.0,
      "score": 14
    },
    {
      "id": "lpqgzjk",
      "body": "Technically he had no reason to tell her. Telling her would have jeopardized his incestuous relationship with Amy. He was more concerned with fucking his sister than having his mother’s back in his father’s betrayal.",
      "created_utc": 1727741171.0,
      "score": 56
    },
    {
      "id": "lpr8h2s",
      "body": "I couldn't say what her official father knew or didn't know. If he knew Amy wasn't his, he never let on. \n\nAll I know is he sexually abused Amy and her mother allowed it to happen, until he was arrested for owning illegal content (take a wild guess what kind) and has been in and out of jail ever since. \n\nBased on the timeline, Jim told Amy and Luke the truth when she came to live with them more consistently, but Cat was never told.",
      "created_utc": 1727751450.0,
      "score": 116
    },
    {
      "id": "lpr83hd",
      "body": "She was Luke's best friend from school, Cat would have already known her at the point she came to stay with them.",
      "created_utc": 1727751297.0,
      "score": 65
    },
    {
      "id": "lpfs1dg",
      "body": "I 100% agree. I wish the younger kids could leave with them if they decide to go that route. I know they can’t. But it would be nice.",
      "created_utc": 1727578665.0,
      "score": 10
    },
    {
      "id": "lpgnek4",
      "body": "Yep. But they don't know OP has evidence right? So their lawyers will come up with a defense strategy. Right now they think it's just divorce proceedings, but it will soon be a criminal case once it's revealed that they knowingly participated in incestuous acts. Their only recourse would be to go down together or turn on each other.",
      "created_utc": 1727596306.0,
      "score": 6
    },
    {
      "id": "lpnaan9",
      "body": "I think those scumbags are happy to be scumbags. It has been 20 years since they have been doing this (at least), I don’t think they will feel bad at all. \n\nI actually don’t think they will feel bad about losing their kids (8!of them). If they did, they shouldn’t have done these in the beginning.",
      "created_utc": 1727702841.0,
      "score": 42
    },
    {
      "id": "lpn9ipf",
      "body": "I don’t think Amy cares at this point",
      "created_utc": 1727702535.0,
      "score": 19
    },
    {
      "id": "lrfds35",
      "body": "I think I wrote this before - I would buy that book series.",
      "created_utc": 1728661282.0,
      "score": 5
    },
    {
      "id": "lpfuael",
      "body": "He did take advantage, of you. He used you as a cover and shield, fathered still more children by you, all while neglecting his other biological children by Amy. I cannot even begin to describe my ick at his behaviour toward you and those babies. \n\nSo many therapists are needed. Amy’s kids know he’s their father now, a father that willingly chose not to live with them, raise them, or be a family with them. Instead his other kids got his time. \n\nThey have destroyed all those kids lives. Imagine going to school, turns out the man I thought was our close friend that we considered an Uncle, is actually our Dad, but is also our biological Uncle. But we just found out, while they have always known. He and my mum have engaged in an illicit and illegal affair for years and years….. the heck \n\nAnd then there’s you, who stood by, supported, birthed children, loved this toxic toxic man who had this hidden life in the background and knew he was playing you for a fool….. \n\nWhat a piece of crap.",
      "created_utc": 1727579648.0,
      "score": 73
    },
    {
      "id": "lpfcxin",
      "body": "This level of stress must make their work performance diminish I would think. Why have you been giving Amy money over the years if she works?",
      "created_utc": 1727572304.0,
      "score": 162
    },
    {
      "id": "lphxewi",
      "body": "Ironically now that Luke isn’t living a double life, he should be able to dedicate more time to work. \n\nTruthfully, it’s likely in everyone’s best interest if they upped their work hours - it gives them less time to make up stories in their brains and blame the victim. \n\nHopefully the courts will mandate individual therapy for everyone, especially Amy’s kids who are living with reality deniers!",
      "created_utc": 1727621181.0,
      "score": 52
    },
    {
      "id": "lppl705",
      "body": "Yes",
      "created_utc": 1727729838.0,
      "score": 7
    },
    {
      "id": "lq96km1",
      "body": "[deleted]",
      "created_utc": 1728016828.0,
      "score": 149
    },
    {
      "id": "lqgf0um",
      "body": "I hope every single person in their lives shuns them. I hope they go to prison and lose custody. I hope your children never speak to him. And his other children never speak to him or Amy again. \n\nThey are SICK.",
      "created_utc": 1728136388.0,
      "score": 28
    },
    {
      "id": "lqab7q6",
      "body": "God I hope they were actually discussing it in one of the tapes, not using it as a turn on factor 🫠",
      "created_utc": 1728042430.0,
      "score": 16
    },
    {
      "id": "lqjnvyv",
      "body": "Holy shit! Those poor kids are going to need serious therapy and genetic screenings to check for doubled genes.",
      "created_utc": 1728175483.0,
      "score": 15
    },
    {
      "id": "lr9mlzj",
      "body": "that’s just so weird… but then again they probably made a fetish out of it because they are inherently disgusting people. Especially after willingly potentially fathering children which have an increased chance of genetic disease, defects and physical/mental disorders. \n\nFull offence to the lovely couple, but blood is not thicker than water in this case - more like… the Habsburgs.",
      "created_utc": 1728575126.0,
      "score": 12
    },
    {
      "id": "lqkl1v4",
      "body": "Jfcccc no",
      "created_utc": 1728189592.0,
      "score": 5
    },
    {
      "id": "lqz3m0o",
      "body": "Eew, just ewwww",
      "created_utc": 1728410712.0,
      "score": 5
    },
    {
      "id": "lpiuuz3",
      "body": "What did you find? I’m so lost",
      "created_utc": 1727632032.0,
      "score": 28
    },
    {
      "id": "lpluu18",
      "body": "I’m waiting for this revelation. Amy has been losing it because she knows what OP found.",
      "created_utc": 1727672147.0,
      "score": 14
    },
    {
      "id": "lqg48f0",
      "body": "Oh shit when Tom did the DNA test, even though Luke wasnt his father (iirc) did it still show a portion of shared DNA?? Was that the initial tip off? \n\nMan I know a lot of people think this is fake, but as another person with in-laws out of a telenovella…this kind of shit absolutely does happen in real life 😩",
      "created_utc": 1728132177.0,
      "score": 5
    },
    {
      "id": "lq2ym41",
      "body": "Right, when you are in denial, you look for all possible reasons except for the most obvious one.",
      "created_utc": 1727924508.0,
      "score": 13
    },
    {
      "id": "lpimvsj",
      "body": "Damn, this shits get way too crazy. Did the husband know?",
      "created_utc": 1727629640.0,
      "score": 14
    },
    {
      "id": "lpkovac",
      "body": "No. She hasn’t confirmed it. But it’s kinda obvious. She said they could never conventionally get married. They committed a crime knowingly….",
      "created_utc": 1727653987.0,
      "score": 15
    },
    {
      "id": "lq99td1",
      "body": "Check OP's comments. They confirmed they knew they were half siblings in letters, and also when they were filming a sex tape. Luke and Amy are not very smart.",
      "created_utc": 1728018606.0,
      "score": 8
    },
    {
      "id": "lph2qmy",
      "body": "In a comment on the previous post she essentially confirms it by saying that a lot of people have guessed what the real reason they couldn't just be legitimately together all this time instead of the decades of secrets and deception, and loads of the comments in there were about them being half siblings.",
      "created_utc": 1727607006.0,
      "score": 145
    },
    {
      "id": "lpgr9aj",
      "body": "Would that really make them both lose custody of the kids like OP thinks will happen?",
      "created_utc": 1727598957.0,
      "score": 58
    },
    {
      "id": "lphrnwz",
      "body": "Cat had to have known though, right? Why else would Jim have taken in Amy?",
      "created_utc": 1727619082.0,
      "score": 11
    },
    {
      "id": "lpg0kq8",
      "body": "I am looking forward to the next update, in like 3 days: \"So we just finished all of the trial, the judge ruled everything in my favour and also gave me a 100 dollars, so now that I am finally free to talk about things....\"",
      "created_utc": 1727582588.0,
      "score": 70
    },
    {
      "id": "lpfyjk2",
      "body": "[deleted]",
      "created_utc": 1727581596.0,
      "score": 33
    },
    {
      "id": "lpfj0ry",
      "body": "Is this how you get three quarter siblings?",
      "created_utc": 1727574817.0,
      "score": 36
    },
    {
      "id": "lpzog80",
      "body": "I was just thinking about how fucked up it is that Amy’s kids only have one biological grandfather 😭",
      "created_utc": 1727883538.0,
      "score": 6
    },
    {
      "id": "lpj3ich",
      "body": "Maybe she can live with Cat.",
      "created_utc": 1727634660.0,
      "score": 5
    },
    {
      "id": "lpn7nhl",
      "body": "OP did she treat Amy’s kids like grandkids. Like equal to yours?",
      "created_utc": 1727701794.0,
      "score": 17
    },
    {
      "id": "lq097wm",
      "body": "Is she angry and Jim, Luke and Amy for deceiving her all these years? I can imagine what she is going through.",
      "created_utc": 1727890065.0,
      "score": 5
    },
    {
      "id": "lpqik43",
      "body": "Exactly. Cat needs to cut them off. \n\nAmy, Luke, and Jim made her their fool all these years.\n\nJim had to suspect something. Why else would he tell them?",
      "created_utc": 1727741750.0,
      "score": 39
    },
    {
      "id": "lq6eauv",
      "body": "This is weird, that in the same household Jim, Amy and Luke all knew the truth of Amy's paternity but Cat did not. From what you have reconstructed, Amy and Luke weren't little kids, apparently more like 15 or 16 years old. However, it's still weird to think about Cat being mother and pseudo-stepmother to two teenagers while they were hiding such a big secret from her. \n\nDo you actually know that Jim informed both Amy and Luke, or is it possible that he only confided to Amy, and then she shared that secret with Luke?",
      "created_utc": 1727980224.0,
      "score": 35
    },
    {
      "id": "lq8t44q",
      "body": "We know Cat didn't know about the specifics, but did Cat know about Jim's cheating at all? She suspected nothing? Do you think he hid it from her because he knew she'd divorce him? When you told her, did you show her any proof, or did she believe you?",
      "created_utc": 1728010645.0,
      "score": 12
    },
    {
      "id": "lpwqsyx",
      "body": "do you think that Amy might have been a target of her dad’s abuse because he knew that she wasn’t biologically his? seems like a twisted way to get back at your wife for cheating on you, and Amy’s mom letting Amy be a scapegoat shields her from domestic violence and “proves loyalty” to husband. either way, yuck.",
      "created_utc": 1727832697.0,
      "score": 17
    },
    {
      "id": "lprb9fb",
      "body": "Wait omg did her mom put her in the same school on purpose? Did Jim ask her to so that his kids could be close still? Or was it just a coincidence bc the mistress also lived nearby? Also thank you sm for explaining that at. It makes sense then that Luke/the family just noticed signs of abuse and decided to take her in then. (Assuming that's how it went given what I've read)",
      "created_utc": 1727752578.0,
      "score": 35
    },
    {
      "id": "lpgnr85",
      "body": "I think OP stated that she reported everything she knew... in one of her comments, she mentioned both Luke and Amy are aware that OP knows about the letter... and that the letter was given to her Lawyer, that would be an evidence. Either way, they are both going down if the DNA proves Luke is Amy's kids father.",
      "created_utc": 1727596543.0,
      "score": 7
    },
    {
      "id": "lq0cra2",
      "body": "I think both Amy and Luke have been deep in the river of denial this whole time and are probably just starting to surface at this point. I do hope they both go to jail because of the damage they’ve willfully done to their families, including OP and Cat.",
      "created_utc": 1727891181.0,
      "score": 11
    },
    {
      "id": "lq6o96o",
      "body": "I bet Amy considers this a win, but it isnt. That tyoe of relationship is tanoo for a reason. I bet Amy thinks that now the secret they have been hiding is exposed, they can finally be together. \nI hate to be the one to break it to her, but the decision to sleep together that they made so long ago is going to come back and bite them in the a$$. \nThey didn't care how their kids would feel about the truth coming out. The kids now ha e a stigma attached to them that they didn't deserve.\n How in the world did he think that spending the night over there was a good idea? Because he was clearly thinking with his dick all these years. \nMy heart breaks for OP, her children, Amy's children, and Cat. Such a tangled web to try to traverse. \nIt is sick that they started sleeping together AFTER Jim told them they were his children. No amount of cloroxx is going to wipe this situation clean. I was always worried since he went out of his way to provide for Amy and her children, not just the loan for the bar, but always taking care of them. I really hoped I was wrong. \nOnce this is over and done, please update us one last time. I want things to work out for you so much. Tom made numerous bad decisions. I am sure he loved you, just not enough to give up his sister side piece.",
      "created_utc": 1727983372.0,
      "score": 10
    },
    {
      "id": "lpgqq8o",
      "body": "For real, not saying amy isent terrible either but Luke is straight up diabolical. The fact he is okay with doing such hurtfull things to ALL HIS KIDS. Its crazy and makes me wonder is he has mental illness or something because that not normal behavior. \n\nAmy is just as bad though. She willing birthed a child that could potentiel be incest and could have had severe dissabilities if anything went wrong. Lucky it didnt, but even if she was in a bad place she still continued this entire thing into adulthood. I hope they take those kids, so they can start fresh.\n\nI just know Tom will go NC with his mom once he turns 18. I also hope they testify against both her and Luke. But what Luke did is messed up.",
      "created_utc": 1727598577.0,
      "score": 17
    },
    {
      "id": "lpfdp6c",
      "body": "Her job wasn't enough to support her family on it's own. And I thought she was my dear friend.",
      "created_utc": 1727572617.0,
      "score": 273
    },
    {
      "id": "lq9hy8o",
      "body": "This makes me think they definitely fetishized it and got off on that fact as well 😭 if not prison I think they need to go to a psych ward and be studied or something I stg",
      "created_utc": 1728023584.0,
      "score": 66
    },
    {
      "id": "lq980m2",
      "body": "Exactly! I can’t imagine what was even said 🙉",
      "created_utc": 1728017607.0,
      "score": 24
    },
    {
      "id": "ltk3ekr",
      "body": "For real. They shouldn't be allowed custody of those kids. The fact they knew they were siblings and still did the deed for YEARS shows they aren't capable of good choices or being trusted to raise a child.",
      "created_utc": 1729795845.0,
      "score": 4
    },
    {
      "id": "lpiysra",
      "body": "That Luke and Amy are siblings as well as lovers. And knew that they were related.",
      "created_utc": 1727633210.0,
      "score": 117
    },
    {
      "id": "lq1tvdw",
      "body": "How on earth did you ever restrain yourself when Amy was trashing you on social media? It would’ve been so tempting to out them as brother and sister since Amy is so willing to air your dirty laundry!\n\nNot only knowing that they were brother and sister, but went on to have children together! Completely unhinged.",
      "created_utc": 1727908586.0,
      "score": 11
    },
    {
      "id": "lpmiuq3",
      "body": "I am too. This post has been straight up crazy. I feel bad for OP and what she and the kids are going through.",
      "created_utc": 1727688522.0,
      "score": 11
    },
    {
      "id": "lqgv3g5",
      "body": "I think it was confirmed by OP that Cat never sent in the DNA for testing because she felt it was wrong",
      "created_utc": 1728141922.0,
      "score": 11
    },
    {
      "id": "ls6a1m3",
      "body": "Cat didn't send in the DNA testing because she didn't want to go behind her son's back.",
      "created_utc": 1729069577.0,
      "score": 5
    },
    {
      "id": "lpivvwx",
      "body": "There were comments speculating and OP basically confirmed it without outright saying “yes that is the situation” in comments a few updates back.",
      "created_utc": 1727632338.0,
      "score": 19
    },
    {
      "id": "lpiocul",
      "body": "Well that’s what my initial comment was speculating about, lol. I think the FIL knew that Amy was his daughter, but didn’t know that Amy and Luke were procreating/sleeping together. Was probably in denial about it, if anything.",
      "created_utc": 1727630088.0,
      "score": 15
    },
    {
      "id": "lpmivcd",
      "body": "Everyone knew. Amy's parents crashed and burned and Jim slowly brought her home, moved her in and she grew up in their home. He was paying for her schooling even before that.",
      "created_utc": 1727688535.0,
      "score": 6
    },
    {
      "id": "lps5tp0",
      "body": "OP has now confirmed it in a comment.",
      "created_utc": 1727770181.0,
      "score": 11
    },
    {
      "id": "lqfu4tf",
      "body": "Which would also explain why Jim was *so* adamant for *so* long that Luke and Amy weren't together, even though everyone else who knew them (including their own kids!) suspected something was going on.",
      "created_utc": 1728127014.0,
      "score": 10
    },
    {
      "id": "lpgu5ac",
      "body": "Probably yes, in most countries it is illegal to have relationships with close relatives and in this case there are children involved, which is terrible, inbreeding can cause damage to genetics and governments are aware of that. I think OP is from the USA and there they will do it almost 100% for sure.",
      "created_utc": 1727601002.0,
      "score": 138
    },
    {
      "id": "lpg1evd",
      "body": "Very fake but supremely entertaining 🍿",
      "created_utc": 1727583012.0,
      "score": 81
    },
    {
      "id": "lpj4soo",
      "body": "Which would require consent of Amy or Amy losing custody. Amy doesn't seem to care about the best interests of her kids",
      "created_utc": 1727635069.0,
      "score": 12
    },
    {
      "id": "lpn7z8q",
      "body": "More or less. Cat came to suspect over the years that perhaps Amy's children were Luke's, but she never had proof and she never knew the full story.",
      "created_utc": 1727701925.0,
      "score": 65
    },
    {
      "id": "lq0athb",
      "body": "Jim, a professor, slept with his student, Amy’s mom. Clearly ethics and moral integrity are a bit lacking in that group.",
      "created_utc": 1727890569.0,
      "score": 15
    },
    {
      "id": "lpqva1m",
      "body": "I think Jim suspected but was in denial that they’d actually do it. It’s a hard pill to swallow thinking your children are having a sexual relationship with each other 🤮",
      "created_utc": 1727746472.0,
      "score": 22
    },
    {
      "id": "lpzl57q",
      "body": "maybe he saw them fooling around, like Tom and Sophie.",
      "created_utc": 1727882463.0,
      "score": 9
    },
    {
      "id": "lq91xkm",
      "body": "It may have happened as you describe it, the letters never went into detail. ",
      "created_utc": 1728014473.0,
      "score": 46
    },
    {
      "id": "lq91cxv",
      "body": "She had no idea he had cheated. I showed her the proof at the same time I told her. ",
      "created_utc": 1728014197.0,
      "score": 54
    },
    {
      "id": "lq0a150",
      "body": "He was a pedophile either way.",
      "created_utc": 1727890319.0,
      "score": 11
    },
    {
      "id": "lprcmtu",
      "body": "I have no idea. It could have been coincidence, it could have been engineered, or anywhere in between. \n\nAs far as I know, yes. Luke's family was aware of the abuse for a long time and trying to gradually move Amy into their house.",
      "created_utc": 1727753140.0,
      "score": 89
    },
    {
      "id": "lq0d8em",
      "body": "Ya the amount of collateral damage because of their selfishness is sad",
      "created_utc": 1727891330.0,
      "score": 9
    },
    {
      "id": "lpfr9j6",
      "body": "Not to be rude to anyone,  including Amy, but if her job couldn't support her and her kids and she has you,  Cat, Jim and Luke giving her cash.... why is she working?",
      "created_utc": 1727578319.0,
      "score": 161
    },
    {
      "id": "lplrz2s",
      "body": "Can you share the circumstances & lead up to showing Jim the evidence of the affair? I’ll re-read to be sure but I don’t remember seeing that covered in the main post.",
      "created_utc": 1727670562.0,
      "score": 6
    },
    {
      "id": "ltvqczi",
      "body": "But do we think this is why they didn’t react when Tom and Sophie were showing interest? Instead of covering their own ass with the affair, were they just not bothered by the sibling aspect?",
      "created_utc": 1729964259.0,
      "score": 5
    },
    {
      "id": "lpmigs5",
      "body": "Half-siblings. Jim was both of their father.",
      "created_utc": 1727688241.0,
      "score": 36
    },
    {
      "id": "lpj0gy1",
      "body": "Through Jim or Cat? Was Amy an affair baby?",
      "created_utc": 1727633714.0,
      "score": 13
    },
    {
      "id": "lpkb4jn",
      "body": "I’m also slightly confused. Did OP explicitly say this? Or is this the assumption of the readers",
      "created_utc": 1727648788.0,
      "score": 25
    },
    {
      "id": "lq6x9uo",
      "body": "OP has been able to restrain herself, because she thinks of her children as well as Amy's children and the damage it will do to their poor little minds.",
      "created_utc": 1727986228.0,
      "score": 13
    },
    {
      "id": "lph31ce",
      "body": "What do they gain by ketting the parents lose custody? That damage is already done because they are born already. I don't understand (and I am not from the US)",
      "created_utc": 1727607199.0,
      "score": 24
    },
    {
      "id": "lpj6c2m",
      "body": "Cat pays for everything and owns the house amy and the kids live in….i think Jim\nOwned the bar Amy manages too…so. I think she may be more willing to let Kaylee go.",
      "created_utc": 1727635552.0,
      "score": 11
    },
    {
      "id": "lpne1hf",
      "body": "You’ve probably already mentioned this so I apologize, but what specifically do you think prompted Jim to confess to Luke and Amy that Jim was Amy’s father? Do you think Jim just suspected that Luke and Amy might make their relationship physical, or do you think Jim heard/saw something and decided to tell them? Jim had been keeping that secret (Amy’s paternity) for many many years by that point so I’m thinking he must have, at the very least, had a very strong suspicion that Luke and Amy were developing non-sibling feelings. Then after Jim confessed, wouldn’t you think Luke and Amy would have been extremely upset with Jim? Luke, because Jim cheated on Cat. And Amy, because she lived in an abusive household for many years before Jim finally “rescued” her. As Amy’s biological father, Jim should have removed her from that house years earlier. Even if Amy was seven, that’s seven years too long. Whatever abuse she endured has clearly caused permanent damage. \n\nThat brings me to the real point of this whole line of questioning - there must have been a major shift in Luke and Jim’s relationship once Jim admitted to Luke that he had cheated on Cat with Amy’s mother. Didn’t Cat notice that? And how did Jim explain why his son was suddenly so angry with him? Wouldn’t Cat have questioned Jim and Luke constantly about why they were distant, angry, etc?  Did Jim and Luke make a decision together that they wouldn’t tell Cat? If I were Jim and I had just confessed to my teenage son that I had been unfaithful, I don’t think I would trust that son not to tell my wife.",
      "created_utc": 1727704286.0,
      "score": 32
    },
    {
      "id": "lqj344y",
      "body": "Tom, who is already the product of half siblings, messing around with his own half sibling. (We know he really wasn’t but still) Did Jim want extra fucked up great grandkids ala Hapsburgs??  Christ these people are awful",
      "created_utc": 1728167918.0,
      "score": 7
    },
    {
      "id": "lq9giun",
      "body": "Either way, it must be hard on Cat looking back at her family life and realizing everyone was keeping secrets from her. I'm sure you can sympathize. 💔",
      "created_utc": 1728022660.0,
      "score": 21
    },
    {
      "id": "lq97asx",
      "body": "Wow that triple blow must've hit hard. I feel so sorry for Cat. All of this at once!\n\n🤗 To all, except Amy and Luke.",
      "created_utc": 1728017218.0,
      "score": 21
    },
    {
      "id": "lq2apjp",
      "body": "yuck was my PG attempt at “fuck that guy.”",
      "created_utc": 1727915188.0,
      "score": 8
    },
    {
      "id": "lq3nfmf",
      "body": "Out of curiosity, what did Jim leave Amy in his will? Did she get the bar? Or was everything left to Cat?",
      "created_utc": 1727938152.0,
      "score": 29
    },
    {
      "id": "lpfro69",
      "body": "This is why I always insisted she wasn't a leech, that she was trying, whenever anyone would ask over the years.",
      "created_utc": 1727578502.0,
      "score": 258
    },
    {
      "id": "ltxechj",
      "body": "I mean if it doesn't bother them...and they even decided to have children several times...",
      "created_utc": 1729984604.0,
      "score": 5
    },
    {
      "id": "lpmtjrm",
      "body": "Correct. Still nasty that they knew. And continued on.",
      "created_utc": 1727695273.0,
      "score": 22
    },
    {
      "id": "lssiz9t",
      "body": "So Jim was a cheater too????? I guess it runs in their family",
      "created_utc": 1729396117.0,
      "score": 12
    },
    {
      "id": "lppl834",
      "body": "Where was this confirmed? I missed this",
      "created_utc": 1727729848.0,
      "score": 12
    },
    {
      "id": "lpj0zhv",
      "body": "Looks like Amy was a an affair baby through Jim.",
      "created_utc": 1727633876.0,
      "score": 39
    },
    {
      "id": "lpm4n9v",
      "body": "No, OP has not explicitly confirmed it, but she has not denied it either. She has explicitly denied all other reader theories, and is implicitly letting the incest speculation stand by not rebutting it.\n\nEdit: She has explicitly confirmed it now elsewhere in the comments on this post.",
      "created_utc": 1727678285.0,
      "score": 52
    },
    {
      "id": "lpkll33",
      "body": "She has said it in comments",
      "created_utc": 1727652691.0,
      "score": 15
    },
    {
      "id": "lph932t",
      "body": "Who’s to say either of the parents won’t start a romantic relationship with any of the children? They already proved they’re okay with incest. Just my assumption but I’m probably wrong.",
      "created_utc": 1727610773.0,
      "score": 84
    },
    {
      "id": "lpk2ad7",
      "body": "I'm not from the USA either, but in my country (Spain) custody would be withdrawn anyway, the damage is done in part (genetics) but can you trust people who have crossed a line as serious as incest so that raise your children? There is a real risk that they will grow up believing that incest is okay and bonding with each other, plus it is a serious social problem for children to be children of close relatives...imagine at school, incest and endogamy damage the part social too.",
      "created_utc": 1727645629.0,
      "score": 17
    },
    {
      "id": "lpj4rvg",
      "body": "It’s mainly in order to try and protect the kids and get them out of that environment. The issue is they don’t want kids to think that kind of thing is normal and potential do or encourage that. You’re right it’s not a great solution but in this situation there is not really a great solution.",
      "created_utc": 1727635062.0,
      "score": 11
    },
    {
      "id": "lpjbfxp",
      "body": "Hopefully Cat is willing to wield that weapon.",
      "created_utc": 1727637165.0,
      "score": 15
    },
    {
      "id": "lppwzjr",
      "body": "Honestly, I can't speak to much of any of this. I wasn't there, and it isn't recounted in the letters a great deal. But I do know that he told both of them, and he did so like a year before anything happened between them, so it wasn't like he was \"trying to stop it.\"",
      "created_utc": 1727733894.0,
      "score": 80
    },
    {
      "id": "lptnlky",
      "body": "\"And how did Jim explain why his son was suddenly so angry with him? Wouldn’t Cat have questioned Jim and Luke constantly about why they were distant, angry, etc?\"\n\nIf Jim told them because he thought they were developing feeling/an attraction, they were probably teens at that point. Does anyone ever need an explanation about why teens are angry or growing distant?",
      "created_utc": 1727795743.0,
      "score": 7
    },
    {
      "id": "lqm20xm",
      "body": "RIGHT!! Could you even begin to imagine!!?\nIt's one thing to learn that your son and the woman you opened up your home for to provide a better life for, lied in your face for 15 years. But to quickly learn, you've also been deceived by your husband for 43+ years for him to then pass, robbing you of a chance to confront it all... all in such a short time, is something else completely.\nThat poor woman is likely going to need therapy to digest this whole mess.",
      "created_utc": 1728221109.0,
      "score": 8
    },
    {
      "id": "lq92q8u",
      "body": "She got the bar. It was always something he considered to be “hers” in the first place. ",
      "created_utc": 1728014860.0,
      "score": 59
    }
  ]
}