{
  "id": "1i0drsp",
  "title": "My Stepdad Lied About Me Being Pregnant to “Teach Me a Lesson,” and It Traumatized Me",
  "selftext": "When I was 15, my stepdad decided to “teach me a lesson” about responsibility in the most cruel and manipulative way imaginable. He lied and told me I was pregnant. It has come out that i had had premarital sex. He made me pee in a cup and claimed he “tested” it. I didn’t see what he did, but he came back and said I was pregnant. I had no reason to doubt him.\n\nFor roughly five months, 18 weeks, I believed I was going to have a baby. My body even seemed to respond—I gained weight, had morning sickness, cravings, and even felt what I thought were kicks. I mentally prepared for this child. I grieved the life I thought I’d lose as a teen mom but also grew to love the baby I thought was growing inside me. My reputation at school took the expected hit. And then the hit you'd expect when i don't end up having that baby. Yep, i became that girl.\n\nWhen I finally asked about getting prenatal care, he laughed and told me he’d lied the entire time. It was at the dinner table and I'll never forget my mental state shattering. I was devastated among many other things. To make things worse, he found the pregnancy journal I had been writing in every week for the baby to one day read. He confiscated it and quoted it back to me laughing at my thoughts and feelings for weeks afterward.\n\nIt felt like I had lost a child, even though there was never a baby. It always felt wrong to say i suffered a miscarriage so i never felt like i could talk to somebody about the kind of grief i felt.\n\nThis experience has haunted me for years. It’s left me with trust issues, trauma, and a lingering grief that’s hard to explain to anyone who hasn’t been through something similar. I’ve tried to find others who’ve had an experience like mine, but I haven’t found anything.\n\nI wanted to share my story here because I feel like this kind of thing hasn't been talked about. If you’ve been through something similar, I’d love to hear from you. And if not, thank you for letting me get this off my chest. \n\nETA - The first time i ended up actually pregnant, they ended up being twins. This feels symbolic. Like i was given the child i ended up not having in addition to the one i was to have then. It's comforting when i look at it that way. Like my love for them was real even if they weren't. So real that the baby just HAD to come into existence. ",
  "created_utc": 1736774431.0,
  "score": 7986,
  "num_comments": 354,
  "url": "https://www.reddit.com/r/offmychest/comments/1i0drsp/my_stepdad_lied_about_me_being_pregnant_to_teach/",
  "comments": [
    {
      "id": "m6x0cra",
      "body": "How's your relationship with your mom after that? Obviously he's a piece of shit but I'd have a hard time forgiving her for letting it go on like that",
      "created_utc": 1736774965.0,
      "score": 4649
    },
    {
      "id": "m6x24a6",
      "body": "This is simply appalling. I'm guessing you're NC with either of them? I'm so sorry you were put through this and I hope you've been able to find some peace. Have you been to therapy? This feels like something anyone would struggle with on their own.",
      "created_utc": 1736775665.0,
      "score": 1466
    },
    {
      "id": "m6xbs5y",
      "body": "My dad lied about me having cancer when I was 16.\n\nIt was a Friday night and he was upset at the fact I had the *audacity* to go out to the movies with my then boyfriend at the time. I had just had my yearly physical and bloodwork a day or so prior to this. \n\nAnyway, it’s the middle of the movie and I get a bunch of missed calls and a “call me now” text from him. On that call, he explained to me that they found something in my bloodwork that indicated cancer.\n\nI went home that night sobbing and he told me to prepare to go to the hospital the following week for more tests. He was dead serious. And it really hit me; like holy shit. I’m going into the hospital. I’m probably getting chemo. I’m gonna lose my hair. I could literally DIE. The next morning (after a sleepless night of you know, freaking out about the fact I likely have cancer), he admitted to me that he had lied. His excuse was he was “drunk” and feeling “sad” at the fact I was “growing up”. \n\nAnd yet, he still doesn’t understand why I went no contact with him. 🫠",
      "created_utc": 1736779248.0,
      "score": 1389
    },
    {
      "id": "m6wzo2s",
      "body": "This is child abuse.",
      "created_utc": 1736774686.0,
      "score": 2772
    },
    {
      "id": "m6x6cgo",
      "body": "The ETA is a beautiful way to end the post. \n\nStepdad sounds absolutely horrible. And I bet he has a position of authority smh",
      "created_utc": 1736777273.0,
      "score": 544
    },
    {
      "id": "m6x4ryg",
      "body": "Few posts give me secondhand violent thoughts... your parents... should be ashamed of themselves, and be infested with fleas, lice, and mosquitoes, and no ability to do a thing about it.",
      "created_utc": 1736776681.0,
      "score": 365
    },
    {
      "id": "m6x6x7d",
      "body": "I'm sorry this happened to you.\n I don't know if anyone told you about it already or if you just already know but there are cases where women who really want children end up having a false pregnancy with all the symptoms but not the baby.\n\nIf you're searching for women with the same experience (which not really the same here because you were lied to, but about the loss of a child who was never here), I think it's called Pseudocyesis, I don't really know if there's support groups or anything but maybe with the name it will be easier.\n\nAnyway if you already knew about all that sorry for my little paragraph and I hope you'll find women to share your feelings with.",
      "created_utc": 1736777489.0,
      "score": 231
    },
    {
      "id": "m6x1whe",
      "body": "Your parents are abusive,  I'm so sorry!",
      "created_utc": 1736775580.0,
      "score": 157
    },
    {
      "id": "m6x4zyt",
      "body": "I'm so sorry you experienced that, OP. What they did to you was horrible. I hope you're in a far better situation now 🙏",
      "created_utc": 1736776766.0,
      "score": 101
    },
    {
      "id": "m6xhnmz",
      "body": "I’m so sorry. I’ve been through something similar but not to that extent. My mother found out my period was late and made me take a pregnancy test. I was 14 at the time and a virgin, barely knew anything about sex since my mother felt there wasn’t anything to say besides don’t get pregnant.\n\nAfterwards she starts to “cry” and her friend told me it came back positive. I start to cry because Im in shock and don’t know how I could be pregnant. \n\nHer friend enters and starts questioning me about sex. I tell her I haven’t done anything. She says “well then why are you crying? You know you can get pregnant using your mouth too.” I’m sure this was to manipulate me into admitting to having sex. However what it did was skew my view of sex and I made bad decisions from there (thankfully no lifelong consequences). Im older now and scared to have kids while my mother is begging for grandkids. We are LC tho. \n\nAnyways I say all that to say I can somewhat relate. It’s abusive, manipulative and traumatizing. However for him to not tell you for months then pull out your journal? I understand why you’re NC.\n\nETA: my period came on that same night.",
      "created_utc": 1736781228.0,
      "score": 92
    },
    {
      "id": "m6x1tpy",
      "body": "I am so sorry. That is disgusting.",
      "created_utc": 1736775550.0,
      "score": 86
    },
    {
      "id": "m6x8qk7",
      "body": "I’ve never actually hated people I didn’t know existed beforehand, but here we are. I’m so sorry for what they put you through, OP. Please, if you have the means at all, go to therapy. A good therapist can and will help you work through the trauma inflicted by your “parents”. \n\nAnd OP, you did lose a child. That man said you were going to have a baby and your mind was so convinced that your body prepared for the growing baby. You were preparing diligently. Everyone else around you thought you were having a baby. Then, you get told it was all a lie AND get laughed at for believing it. OP, you lost that child you had been preparing for in that moment. Something doesn’t actually have to exist for you to lose it completely. \n\nI’m glad you are in a better place now, but please, if you are able, get therapy to help resolve that grief you feel.",
      "created_utc": 1736778152.0,
      "score": 85
    },
    {
      "id": "m6x4ucm",
      "body": "That's fucking psychotic",
      "created_utc": 1736776707.0,
      "score": 113
    },
    {
      "id": "m6x38ht",
      "body": "That's not a mom, he's not even your dad, and she thought it was a good idea to play with your mental health like that? How about talk? Give advice to your own child about sex? That's humiliating and traumatic. I'm so so so sorry. \nKarma is gonna hit them one day, and I hope there's a special place for these types of people. \nI'm so sorry you had to go through this, and I hope you can use that trauma to do great things in your life, and to make you the strong person you already are, and I hope you're safe and happy now ❤️",
      "created_utc": 1736776097.0,
      "score": 98
    },
    {
      "id": "m6x5k7k",
      "body": "[deleted]",
      "created_utc": 1736776977.0,
      "score": 48
    },
    {
      "id": "m6x3men",
      "body": "That’s severely not ok, especially laughing about it afterwards. That was such an intense mind game. Glad to see you’re doing much better now.",
      "created_utc": 1736776246.0,
      "score": 43
    },
    {
      "id": "m6x56av",
      "body": "Im so sorry.\n\nPlease know that your grief is valid. I know this was in the past, but it was still correct and normal to mourn the loss of the baby you had expected to have. It doesn't matter that the baby didn't exist, your attachment and affection for it did.\n\nIm glad youre NC now and ecstatic for you to have twins. Congratulations :)",
      "created_utc": 1736776832.0,
      "score": 30
    },
    {
      "id": "m6x84aw",
      "body": "I'm sorry, but surely what he did is some form of crime, right? That's psychological abuse, maybe even bordering on torture for the extra shit he done after and that fact that it lasted as long as it did and affected you physically as well as mental \n\nexternal issues that arose, such as the issues at school and the pseudo-pregnancy symptoms - which exists btw and is an actual mental illness/condition that affects the body physically. Many women have been hospitalised because they've been adamant that they're pregnant even when professionals have said that they're not to a point where they became mentally unwell as volatile [not to say you were btw, but he put you in a mental state were this could've been a possible outcome for you!]",
      "created_utc": 1736777928.0,
      "score": 31
    },
    {
      "id": "m6xa547",
      "body": "5 MONTHS?! Im so glad you are NC with those monsters! \n\nI don’t think your comment about feeling like miscarriage is wrong at all! Like it basically was, you thought you were going to have a child and then didn’t. While fortunately you didn’t have to pass an actual child, I would say psychologically you did miscarry. Those feelings were and are so real and valid. \n\nI’m glad you are able to have your kids in a better environment and twins is definitely so symbolic. Hope you and your family the best!",
      "created_utc": 1736778659.0,
      "score": 34
    },
    {
      "id": "m6xh4xb",
      "body": "I'm sorry, but what lesson? Even if they found out you had premarital sex, a serious deep talk and a few educational tips about havings protected sex would be sufficient. You were 15, I am pretty sure you would have understand the consenquences of premarital sex if they could just talk to you about it without judgement.\n\nI dont see how what they did you teaches responsibility. It only taught you that you can never ever trust them nor go to them when you need something.",
      "created_utc": 1736781059.0,
      "score": 31
    },
    {
      "id": "m6xjvsv",
      "body": "Darling, I am so very fucking sorry you went through that; that that cruel man put you through that, and that your monster of a mother LET HIM do it.  For MONTHS.  Then laughed at you and humiliated you.\n\nI am so, so very sorry. <3\n\nI once dreamed I was pregnant and had a baby. I even lay in my own bed (in the dream) idly rocking a little bassinet next to my bed. I remember everything about her, even her name - and then I woke up. \n\nIt was *shattering*, and I never told a soul until I posted about it on reddit the other month, in response to some poor woman who'd had a similar experience. The sorrow is intense, my lovely, and I definitely see you. \n\nI was always worried that people would see it as silly or crazy to be so grief-stricken over a child that never existed in the first place, so I never said anything - just like you. However, I didn't have the heaping of humiliation and betrayal and cruelty on top, like you did. \n\n\nBig hugs, sweetheart. I am incredibly happy you had your twins, and I love the way you think about that. That's actually really moving. <3",
      "created_utc": 1736781948.0,
      "score": 25
    },
    {
      "id": "m6z4wt2",
      "body": "I’m sorry this happened to you. \n\nSomething similarly crazy happened to me with my father. \nMy parents found out I was having premarital sex when I was 16 or 17. I had just been accepted into a 4 year university and was planning to move away. They told me that they had pulled me out of school and I was no longer allowed to go to college. Then they told me that my only choice was to marry the guy I had sex with. They convinced me that if I didn’t marry him then I was going to go to hell for it. The guy for some reason agreed to marry me (he was like 22 and I was 16/17, that’s a story for another time). They had even convinced people at my church that it was what I wanted and they had set aside a date. Honestly caused a lot of trauma. I’m 23 now and just now coming around to being able to talk about marriage without having a trauma response. \n\nI stand in solidarity with you and crazy religious trauma caused by parents.",
      "created_utc": 1736798672.0,
      "score": 20
    },
    {
      "id": "m6x92pz",
      "body": "He should've gone straight to PRISON",
      "created_utc": 1736778275.0,
      "score": 20
    },
    {
      "id": "m6xzca8",
      "body": "Oh sweetie, I'm so sorry. What he did was cruel beyond measure. \n\nOf course your body responded to what you thought was real. The mind is very powerful, it can do so many amazing things. \n\nI hope him and anyone who backed him are out of your life and your families life. \n\nYou did lose a child in that sense. You started to shift your life for the addition of a child. While you didn't physically miscarry, you mentally and emotionally did. That is powerful. That is impactful. That changes a person. \n\nI would highly encourage you to seek out some therapy. I would recommend a childhood trauma specialist. I've suffered a lot of trauma myself and I reached a point where my old tools were not working anymore. It's not an easy road but it's one I'm glad I've taken. \n\nI wish you nothing but love and healing. Please be kind to yourself. I wish I could give you an auntie hug and tell you everything will be okay.",
      "created_utc": 1736786631.0,
      "score": 18
    },
    {
      "id": "m6xcy6j",
      "body": "Im so sorry you experienced that. I know it technically wasn't a miscarriage, but emotionally, it was. You fully belived in your heart that you were bringing a life into the world only to find out that was no longer your truth, even more so that someone else had control over that narative to begin with. That can be violating on its own. You lost the future you'd been planning for months.\n\nThank you for sharing your story. It makes me happy to see that now you seem to be thriving with a happy family on your hands. I hope you are able to continue moving forward with your lovely twin. Congratulations!",
      "created_utc": 1736779655.0,
      "score": 17
    },
    {
      "id": "m6x9p7k",
      "body": "It sounds like your body went through “Phantom Pregnancy” - you believed you were pregnant and your body responded accordingly \n\nI’m sorry your parents did this to you & I hope they never find a moment of peace. \n\nGood to hear you are NC",
      "created_utc": 1736778500.0,
      "score": 14
    },
    {
      "id": "m6yv697",
      "body": "Your stepdad is an asshole and your mother is the biggest piece of shit in existence.\n\nThe reason your body responded is because you thought you were pregnant. The mind is a very powerful thing. Which is why placebos work. \n\nYou may not have had an actual miscarriage. But you had a mental miscarriage nonetheless. And at the same time the realization that your mom wasn't your protector as she should've been. You were mentally tortured for 5 months. Your body responded for 5 months. You were humiliated by him reading your journal. Your privacy was invaded. You had to endure bullying and rumors for the rest of your high school career. All because your stepdad wanted to \"teach you a lesson\"? That is not teaching. That's abuse. And your mother is just as complicit. She is just as guilty as if she had done those things herself. \n\nI'm glad you're no contact. I hope you're healed/healing. Love those babies and be the mother you wish you had. \n\nHave a blessed life. \n\nP.s. I have not gone through what you have. But my heart aches for anyone who's parents treat them like yours did. (Mine weren't so great either)",
      "created_utc": 1736795852.0,
      "score": 16
    },
    {
      "id": "m6xpd3p",
      "body": "So I want to say I dealt with something similar but that is up for you to decide, OP. When I was in high school I had someone who always questioned if I was pregnant and just decided one day that I was pregnant. At the time I was still lacking in my mental health and it was easy for people to manipulate me. She pushed it so much that I started to believe. My body reacts to stress quickly so I started believing I was experiencing symptoms as well. Eventually I did get my period but it was excruciating and (TMI) had a lot of blood clots. I thought the worst thing happened and my boyfriend (now fiancé) was left to pick up the pieces and tell me that what I thought happened didn’t happen. I couldn’t even handle the heavy periods I got after that point because I would remember the grief that wasn’t even supposed to be going through me. I stopped talking to that person after that and so did my partner. \nI actually wrote a paper on it my freshman year of college and I had people come up to me and ask if I was okay. It was almost like the final nail in the coffin telling me that the situation was not just a funny memory. That person did some other manipulative shit to other people but that is not my place to talk.\nI was very happy to see at the end of this post that you ended up with twins! It was like a sigh of relief and I hope your life is much brighter now!",
      "created_utc": 1736783647.0,
      "score": 29
    },
    {
      "id": "m6xdr5y",
      "body": "The stepdad is a psychopath.",
      "created_utc": 1736779930.0,
      "score": 12
    },
    {
      "id": "m6xfren",
      "body": "that’s absolutely cruel and heartbreaking. I’m so sorry that happened to you, OP. The idea of being a teenage parent, raising a kid, and losing it—all of it was real, even if there wasn’t a physical baby. I can’t imagine the roller coaster of emotions you went through.\n\nI’m proud of you for overcoming that and going nc with them. I hope the world treats you better.",
      "created_utc": 1736780599.0,
      "score": 13
    },
    {
      "id": "m6x9gby",
      "body": "How abusive. Your mom allowed this. I hope you never speak to them again",
      "created_utc": 1736778412.0,
      "score": 13
    },
    {
      "id": "m6xh35e",
      "body": "This is one of the worst things I’ve heard. I am so sorry you were made to feel so scared and helpless by your own father, for something you didn’t do wrong. The twins thing is also crazy and I would see it as symbolism too.",
      "created_utc": 1736781043.0,
      "score": 12
    },
    {
      "id": "m6xbbfl",
      "body": "Do you have a relationship with your bio dad?  This story is one of the worst things I've ever read.  I'm sitting here with my mouth wide open.  I am so happy you got the fuck away from those psychotics and are living a good life.",
      "created_utc": 1736779083.0,
      "score": 25
    },
    {
      "id": "m6xmg6p",
      "body": "This is truly disgusting and twisted, just, on an unimaginable level. And reading your journal afterwards to mock you? Incredibly sick way to treat someone, especially so young and vulnerable.\n\n\nI'm so sorry this was the way you were treated, and that it's something to this day you are still having to recover yourself from. There was nothing you did that could ever have deserved it.\n\nI hope freedom from your family can eventually bring you solace, although, you should never have had to live without a proper safe and loving family to begin with.",
      "created_utc": 1736782753.0,
      "score": 12
    },
    {
      "id": "m6xxei9",
      "body": "Your dad HATES women. And he’s possibly a psychopath. That’s sosososososo wrong.\nSending an ::::internet hug::::",
      "created_utc": 1736786062.0,
      "score": 13
    },
    {
      "id": "m6x9jqn",
      "body": "OP my heart breaks for you. This was such a horrible thing to do to anyone let alone a teenage girl in high school. And your mother being in on it.\n\nThey are both disgusting excuses of parents. \n\nI’m sorry your mum failed you. I’m sorry she let him do that to you. Most of all, I’m sorry she was in on it and didn’t protect you like a mother should.",
      "created_utc": 1736778445.0,
      "score": 10
    },
    {
      "id": "m6xc4ed",
      "body": "Your stepdad was a monster, and your Mother was no better. Congratulations on your twins!",
      "created_utc": 1736779367.0,
      "score": 11
    },
    {
      "id": "m6xlemk",
      "body": "This is just plain CRUEL. I can see why you have trust issues and honestly your family sounds like trash. I went through something similar when I was in 9th grade. Just moved to a new town and thought people were my friends turned out they printed papers saying I was a lesbian (even though I was not, but no offense to those that are). Passed them all around the school. People are assholes plain and simple. At the end of the day though I have hope that what goes around comes around and one day they will eventually reap what they sow.",
      "created_utc": 1736782427.0,
      "score": 11
    },
    {
      "id": "m6xvkqa",
      "body": "Hi OP. This is one of the cruelest, most twisted things I’ve ever heard of. What kind of parents would do this to their own child? I hope you have a kind and loving partner and have sought therapy for the trauma your parents purposefully imposed on you. My parents told me that if I ever came home pregnant that they would kick me out and never speak to me again. I thought that was mean - but what your parents did arose to a whole other level of cruelty. For your father to then steal your diary and throw your kind and loving thoughts back into your face as if it was some sort of a joke is psychotic. I am so sorry your parents did this to you. I am glad to see you’ve gone NC with them. They don’t deserve to have a loving family after doing something so cruel.",
      "created_utc": 1736785520.0,
      "score": 9
    },
    {
      "id": "m6xzxs0",
      "body": "I want to beat that guy up so bad. It never ceases to horrify me what people do to their kids with no shame, and then wonder why their kids will never speak to them again",
      "created_utc": 1736786804.0,
      "score": 11
    },
    {
      "id": "m6yqcej",
      "body": "You don't say how old you are, but along with seeking help from a therapist, I also suggest you speak with a lawyer about a potential civil case against your parents.  What they did was horrible and torturous. They need to be held accountable.  Best to you.",
      "created_utc": 1736794449.0,
      "score": 10
    },
    {
      "id": "m6xa5s3",
      "body": "Damn, people should get a psych evaluation before they’re allowed to procreate",
      "created_utc": 1736778666.0,
      "score": 19
    },
    {
      "id": "m6yk78r",
      "body": "Me thinking this is psychotic that someone would do that for the day... then I read 5 MONTHS... that is just diabolical.",
      "created_utc": 1736792670.0,
      "score": 9
    },
    {
      "id": "m707e3z",
      "body": "If my husband did this I'd divorce him so fucking fast it's unreal. \n\nI'm sorry you have a sorry excuse for a mother who allowed this to happen. I'm sorry her husband is a POS who thought it was a good idea.",
      "created_utc": 1736810213.0,
      "score": 9
    },
    {
      "id": "m6xn58y",
      "body": "Omg this is one of the cruelest things I have ever heard. I am so sorry you went through this. \n\nWhen your parents do things this horrific, it really fucks with your head. Your reactions are completely valid. I want to just give you a big hug. \n\nWhat an absolutely shit human being. And your mom going along with it? Horrible.",
      "created_utc": 1736782967.0,
      "score": 9
    },
    {
      "id": "m6xsp9b",
      "body": "So your SD is a sociopath and your mom went along with it?! WHAT THE FUCK?\n\nI hope you went full no contact first chance you got?",
      "created_utc": 1736784661.0,
      "score": 9
    },
    {
      "id": "m6xvfz2",
      "body": "What was done to you is horrifying. I wonder if he even considered that he was potentially setting you up for a very real pregnancy. No reason for birth control if you were already \"pregnant\". \n\nAs far as grief over the lost pregnancy, it is very real even if it was based on a lie. I don't see any difference between what you went through and someone having a miscarriage on an emotional level. That baby may not have been real but it was real to you. The absolute betrayal by the ones who should live you the most, plus the humiliation you suffered makes it even more traumatizing. I am so happy for you that you are finally getting the baby you were preparing for.",
      "created_utc": 1736785481.0,
      "score": 9
    },
    {
      "id": "m6xz4sc",
      "body": "The fact that he bullied and laughed at a 15 year old is disgusting, what a gross man. You weren’t even his actual daughter for him to overstep in such a way, and make fun of it at the end of it, pathetic being really, probably had nothing else better to do with his life.",
      "created_utc": 1736786571.0,
      "score": 8
    },
    {
      "id": "m6y273c",
      "body": "I'm....so sorry. I can't even imagine. This is so beyond fucked up. I hope you're safe and stable enough to be NC with those monsters. Hold your twins tight, they waited so long to meet you. Again I'm so sorry, I can't even imagine the trauma of going through this and then being laughed at. You know when people say \"I wouldn't wish this on my worst enemy\"? I wish all of those things on your stepdad. I hope he suffers. I'm sorry.",
      "created_utc": 1736787464.0,
      "score": 6
    },
    {
      "id": "m6y4zn4",
      "body": "Holy shit, that is so fucking traumatic. I'm so sorry this man did such an evil thing to you.\n\nI've heard there's a culture that believes babies need to be dreamt into existence to be born, so I very much believe that you had twins because you'd loved your dream baby so much. I hope you have a fantastic life because you deserve it!",
      "created_utc": 1736788282.0,
      "score": 8
    },
    {
      "id": "m6ybk9q",
      "body": "This man better not be still in your life. What an abusive monster.",
      "created_utc": 1736790188.0,
      "score": 8
    },
    {
      "id": "m6ye5vy",
      "body": "I’m so sorry you went through this. What your stepdad did was incredibly cruel, and your feelings of grief and shock are completely valid. I had a different but hurtful experience when my family joked I was adopted—it only lasted a day, but it deeply affected my trust. I can’t imagine the pain of believing you were pregnant for five months.It’s beautiful how you’ve found comfort in reinterpreting your experience with your twins. The love you felt was real and shows how big your heart is.\n\nWere you ever able to confront your stepdad about what happened? If so, how did he respond? Wishing you peace and healing ❤",
      "created_utc": 1736790929.0,
      "score": 7
    },
    {
      "id": "m6yl497",
      "body": "Oh my goodness! I am so sorry you experienced this. I can’t even fathom why a parent would consider doing this, let alone actually going through with it. I cannot imagine the pain and confusion this caused you! \n\nI have never been pregnant, but I have been a Labor & Delivery RN for the majority of my 8 years as a nurse. I see how devastating that ANY loss can be. From an ectopic pregnancy to a miscarriage at any point in the pregnancy. I wouldn’t expect it to be any different if you weren’t pregnant but thought you were. And 15 is pretty young from a mental/emotional standpoint. I am so sorry this happened. \n\nIf you haven’t already, I think speaking to a therapist about how you are feeling would be helpful. Even though you don’t physically experience a loss, the emotional toll of what you through is very real. \n\nI hope you find support and can begin to heal. ☺️",
      "created_utc": 1736792934.0,
      "score": 8
    },
    {
      "id": "m6ynt5s",
      "body": "Seriously, fuck him. I hope terrible shit happens to both your parents regularly.",
      "created_utc": 1736793713.0,
      "score": 7
    },
    {
      "id": "m6xbu79",
      "body": "Omg he's a horrible person I can't believe your mom went along with this too.",
      "created_utc": 1736779268.0,
      "score": 6
    },
    {
      "id": "m6xceq2",
      "body": "This was terrible \n\nI can’t believe he did this or your mother allowed it.  I would never let either of them be alone with your children.",
      "created_utc": 1736779468.0,
      "score": 5
    },
    {
      "id": "m6y6r3o",
      "body": "just genuinely some of the craziest shit ive read on here",
      "created_utc": 1736788797.0,
      "score": 6
    },
    {
      "id": "m6yasfd",
      "body": "This is so incredibly deprived and unthinkable. It’s 1,000% pure child abuse. Psychological torture. Defamation of character. I am so sorry you had to go through this.",
      "created_utc": 1736789962.0,
      "score": 6
    },
    {
      "id": "m6yq80j",
      "body": "As a mother, and someone that is only now discovering childhood traumas, I’m so, so sorry. That is sick and twisted and I wouldn’t be surprised if this has happened elsewhere - many times - and there’s also feelings of great shame and no one wants to disclose. I really, truly hope you find someone who went through this! And I absolutely LOVE how you had twins and kind of got that baby “back”. 🥹",
      "created_utc": 1736794414.0,
      "score": 6
    },
    {
      "id": "m6z8b4x",
      "body": "Im so incredibly sorry this happened to you. That is horrendous manipulation and psychological abuse. Glad to see from the other comments you are NC. \n\nYour ETA is so beautiful and I think it is so fitting you are having twins. Those babies will be so very loved. Wishing you all the best.",
      "created_utc": 1736799677.0,
      "score": 7
    },
    {
      "id": "m6zh9t8",
      "body": "I’m so sorry you went through this; it’s the worst type of emotional abuse I’ve ever read. Doing this to a child is unimaginable, and LAUGHING at you afterwards? I hope he gets what’s coming to him. I’m so glad to hear you’re NC with him and your mother. I hope you manage to heal with time and lots of therapy 🖤",
      "created_utc": 1736802286.0,
      "score": 6
    },
    {
      "id": "m6zv0ge",
      "body": "That is fucking horrifying. As a twin though- welcome to the club! Or… well… more appropriately, good luck lol. Have you been able to find a counselor to talk to about this? It’d be nice to process the pain. It wasn’t a physical miscarriage, but you still lost so much. Social life, you grieved your future, you lost a child. That’s hard to process for a kid, much less an adult!",
      "created_utc": 1736806311.0,
      "score": 6
    },
    {
      "id": "m6zwosb",
      "body": "your father is unhinged. I can't imagine this kind of cruelty. I'm glad you're NC. I love your ETA! You willed that baby into existence!",
      "created_utc": 1736806822.0,
      "score": 5
    },
    {
      "id": "m6xhr81",
      "body": "This is unbelievably cruel. I'm so sorry OP.",
      "created_utc": 1736781260.0,
      "score": 4
    },
    {
      "id": "m6xj2oa",
      "body": "Jesus, OP.  I'm so sorry your stepdad is a monster.  I hope you've found some healing.  It might be worth it to see a therapist to help you process the trauma.",
      "created_utc": 1736781689.0,
      "score": 5
    },
    {
      "id": "m6xjs61",
      "body": "I am so sorry this happened to you. I do not understand how or why your mom could have gone along with this. I saw in the comments that you are NC with them. I hope you are surrounded with better people and all the love and support you deserve.",
      "created_utc": 1736781916.0,
      "score": 5
    },
    {
      "id": "m6xsuxl",
      "body": "**Please find a way to get some counseling.**\n\nYour trauma has been living rent-free in your head for too long.",
      "created_utc": 1736784709.0,
      "score": 5
    },
    {
      "id": "m6ynwve",
      "body": "The part where you mentioned the baby journal made my heart so sad. My stepmom read my “invisible ink” journal, and quoted it while making fun of me. She was my first bully. \n\nI’m so sorry this happened to you. You’re not alone, you are so strong, and you will recover. I hope the family you’re creating right now is the one you’ve always needed. ❤️",
      "created_utc": 1736793743.0,
      "score": 5
    },
    {
      "id": "m6zewh7",
      "body": "This is one of the most fucked up things I have ever read on here, and that’s saying something. My god what a monster.",
      "created_utc": 1736801602.0,
      "score": 5
    },
    {
      "id": "m6zwp5i",
      "body": "I’ve never heard of a parent doing something like this. Such a psychological abusive tactic and I’m so sorry you went through that",
      "created_utc": 1736806825.0,
      "score": 6
    },
    {
      "id": "m70jh5q",
      "body": "That was a lot of twists and turns to make M. Night Shyamalan stories seem pretty straight forward.  Your mom and stepdad are PoS and don't deserve to be in your life.  Life lessons are one thing but not only did they go entirely too far with their initial action but your stepdad mocked and belittled an emotional teenager... This story feels like it should be listed under a very specific forum on Reddit but holy shit never speak to those monsters again.",
      "created_utc": 1736814269.0,
      "score": 4
    },
    {
      "id": "m72lzru",
      "body": "This is reason enough to go scorched earth.",
      "created_utc": 1736846212.0,
      "score": 5
    },
    {
      "id": "m72p4w9",
      "body": "I would have been funny if he said it's a joke a few seconds after saying it. Giving you 5 whole months of mental torture is insane! Did your period stop for those 5 months? Cause it takes a crazy amount of stress for your body to actually do that. Hope you get therapy and move past this horrible event",
      "created_utc": 1736848316.0,
      "score": 5
    },
    {
      "id": "m72q0os",
      "body": "Oh sweetheart… this is so unbelievably cruel. \n\nI have no words.",
      "created_utc": 1736848890.0,
      "score": 5
    },
    {
      "id": "m72qp9g",
      "body": "What the F did i just read? I'm so sorry OP I have no words that can express what I'm feeling for you right now.\nThis is incredibly sick! And your so-called mother and her potato with eyes of a husband are lucky you don't sue them for the number they did on your poor mind!",
      "created_utc": 1736849336.0,
      "score": 5
    },
    {
      "id": "m72r0ek",
      "body": "I am literally crying for you right now. I am so sorry. This is evil beyond words. I don’t even know what to say. I am so glad you have two beautiful babies now. You deserve that and more. ❤️",
      "created_utc": 1736849537.0,
      "score": 4
    },
    {
      "id": "m73ihs7",
      "body": "Ooft no. Giving you a shock for a _night_, yeah sure, but nearly half a year? That’s psychopath territory.",
      "created_utc": 1736862940.0,
      "score": 6
    },
    {
      "id": "m75kia6",
      "body": "That’s probably one of the more head fuck twisted “let’s teach her a lesson” I’ve read in a long time. I’m so sorry, that’s unbelievably cruel. And then wanted to taunt you with your diary?? 😞 I assure you someone who thinks this way is not playing with a full deck",
      "created_utc": 1736885403.0,
      "score": 5
    },
    {
      "id": "m6xjw8t",
      "body": "What an incredibly cruel thing to do.",
      "created_utc": 1736781952.0,
      "score": 4
    },
    {
      "id": "m6xkzkp",
      "body": "This is psychological torture. I'm so devastated for you. ",
      "created_utc": 1736782296.0,
      "score": 3
    },
    {
      "id": "m6xl9ms",
      "body": "Wowwwww I am so sorry for you holy shit. That is unbelievable. I can’t even wrap my head around what you must have gone through mentally.  Bless you and your sweet set of angels!",
      "created_utc": 1736782384.0,
      "score": 4
    },
    {
      "id": "m6xlll6",
      "body": "This is so incredibly cruel OP, I’m so sorry you went through this. Glad you are NC. Hope things are good for you now. 💜",
      "created_utc": 1736782489.0,
      "score": 4
    },
    {
      "id": "m6xpx31",
      "body": "This is horrific.",
      "created_utc": 1736783814.0,
      "score": 5
    },
    {
      "id": "m6xu2j6",
      "body": "I’m at a loss for words. This is so awful. So abusive. Just heartbreaking you went through that. 💞",
      "created_utc": 1736785073.0,
      "score": 4
    },
    {
      "id": "m6xwkyi",
      "body": "That’s some psychotic shit; I’m glad you’re doing better now. Congrats on your family.",
      "created_utc": 1736785817.0,
      "score": 4
    },
    {
      "id": "m6xy7fx",
      "body": "This is flat out insane.",
      "created_utc": 1736786300.0,
      "score": 4
    },
    {
      "id": "m6y2nhd",
      "body": "That’s such a sick thing to do.",
      "created_utc": 1736787595.0,
      "score": 4
    },
    {
      "id": "m6y5u50",
      "body": "What a horrible thing to do to a child!!! That is wrong on so many levels. I am sorry you had to go through that and I hope you find comfort in telling your story (at the very least). \n❤️‍🩹",
      "created_utc": 1736788529.0,
      "score": 5
    },
    {
      "id": "m6y88o1",
      "body": "Wow. I can’t believe how insane your stepfather is. I’m so sorry.",
      "created_utc": 1736789228.0,
      "score": 4
    },
    {
      "id": "m6yk370",
      "body": "It sounds like he induced you to have a hysterical pregnancy. A hysterical pregnancy is when your mind believes so strongly that you are pregnant that your body begins to change as if you were actually pregnant.\n\nMaybe try to find a therapist or support group for this specific mental health struggle.",
      "created_utc": 1736792639.0,
      "score": 4
    },
    {
      "id": "m6ypa4r",
      "body": "That. Is. Horrific. That’s beyond horrific and I’m so sorry they did that to you.",
      "created_utc": 1736794140.0,
      "score": 5
    },
    {
      "id": "m6yrgeb",
      "body": "What happened with your period?",
      "created_utc": 1736794771.0,
      "score": 3
    },
    {
      "id": "m6yrud7",
      "body": "OMG one of the most messed up things I’ve ever heard. I can’t even imagine how to process that kind of grief and I’m so sorry you had to go through this. Sending you positive vibes and since it sounds like you do have children now, I hope they can bring you some comfort even though they can’t change what your evil stepfather did.",
      "created_utc": 1736794883.0,
      "score": 4
    },
    {
      "id": "m6yt81m",
      "body": "PLEASE tell me you are no contact with that man & he has no access to you or your children",
      "created_utc": 1736795287.0,
      "score": 3
    },
    {
      "id": "m6ywcpd",
      "body": "Fuck stepdads.",
      "created_utc": 1736796195.0,
      "score": 3
    },
    {
      "id": "m6yznsw",
      "body": "I want to give you the biggest hug. Fuck him for torturing you this way. It takes an extra level of evil to do things like this!! May he rot in hell and your mom can join him too. NC is the way to go. Do not even look back.",
      "created_utc": 1736797153.0,
      "score": 5
    },
    {
      "id": "m6z7mhm",
      "body": "Wow, that's messed up😲",
      "created_utc": 1736799475.0,
      "score": 5
    },
    {
      "id": "m6ze29g",
      "body": "The way my stomach twisted into knots while reading this! I can’t even begin to imagine the trauma you’re still feeling over it. What an absolutely horrific experience and to have your own mother stand by these actions is sickening! \n\nI’m so sorry for your anguish. Sending you loving healing thoughts. ❤️‍🩹❤️",
      "created_utc": 1736801358.0,
      "score": 3
    },
    {
      "id": "m6zqrli",
      "body": "So you’ve had enough feedback about how utterly unhinged and abusive that was … so I’m just going to point out how fucking stupid it was on his part! If you’re pregnant you don’t think you can GET pregnant so why would you use protection from that point?! Could have backfired massively for him. I’m sorry you went through that, it’s unspeakably fucked up.\n\nEdited for typos",
      "created_utc": 1736805046.0,
      "score": 4
    },
    {
      "id": "m76pvgm",
      "body": "OP, I’m a patients’ rights attorney for clients with mental health issues and I’ve had to hear many, many fucked up stories over the years and I read this and was like, damn, that’s so fucked up. \n\nVery glad you’re nc and would strongly recommend any therapy since I also saw you’ve been private about this. Also glad you’ve been doing better! You have nothing to be embarrassed about; you overcame and left horrible people to move on with your life and become a stronger person. Be kind to yourself!!",
      "created_utc": 1736898528.0,
      "score": 4
    },
    {
      "id": "m6ymva1",
      "body": "I can relate a little to the trauma that comes from a parent shaming you when it comes to sex, and the physiological trauma that manifests into. Nothing to your extent OP, so I really feel for you. \n\nMy experience was more physical abuse from my adopted mom, and I had this weird suspicion for years that my body was so traumatized that I wouldn’t be able to have kids. A few years ago that proved true when I had a brutal miscarriage I thought would kill me (I didn’t even know I was pregnant for months cause I lost a lot of weight actually). When I got checked they proved my suspicions right. Id probably never have a kid without it killing me way before. \n\nI really appreciate you sharing this story. Ever since I found out it’s this hard thing to explain to people that I know the trauma I went through is the reason I can’t have kids. I’ve known so many people say it just has to be some hormonal imbalance. It always feels reassuring to know people who understand just how deeply rooted trauma can fuck up someone in ways that seem unimaginable. \n\nProud you’ve gone NC, and bless your kiddos for having such a strong mama",
      "created_utc": 1736793441.0,
      "score": 7
    },
    {
      "id": "m6xhxbl",
      "body": "It’s not the same as what you went through at all but when I was pregnant with my youngest they told me she was a boy at first. I fell in love with “him” and was preparing for a little boy that didn’t exist. Later when it was determined that she was a girl, I grieved and felt really guilty about it. It wasn’t that I didn’t love my daughter but the son that didn’t exist was very real to me and it was really hard. I also felt like I couldn’t tell anyone.\n\nHaving been through that, I can’t imagine how devastating what you went through would be.",
      "created_utc": 1736781316.0,
      "score": 7
    },
    {
      "id": "m6xvs0f",
      "body": "Thank you for sharing your story. I’m so sorry you went through this. Would you ever consider discussing this with a trauma informed therapist? It won’t make it magically better, but it can help you process your thoughts and feelings. \nBest of luck to you and your family! 💜",
      "created_utc": 1736785579.0,
      "score": 3
    },
    {
      "id": "m6yl7v4",
      "body": "This is sick. I’m so sorry op",
      "created_utc": 1736792962.0,
      "score": 3
    },
    {
      "id": "m6ylsvs",
      "body": "I am so infuriated for you. Many internet hugs, and many warm wishes for your little ones.\n\nMay all your former parents' floors be lego pieces!",
      "created_utc": 1736793132.0,
      "score": 3
    },
    {
      "id": "m6za29t",
      "body": "This is unbelievable cruelty. I’m so sorry you suffered this x",
      "created_utc": 1736800190.0,
      "score": 3
    },
    {
      "id": "m6zamnv",
      "body": "that's a genuine evil move. there's nothing productive to gain from it. your dad's evil, in the most pathetic way. he punched down.",
      "created_utc": 1736800354.0,
      "score": 3
    },
    {
      "id": "m6zao0s",
      "body": "This story literally gave me chills. I am angry for you. What a way to torture a child. And, yes, at 15, you were still a child. I hope you have sought out help to recover from such horrendous psychological abuse.",
      "created_utc": 1736800365.0,
      "score": 3
    },
    {
      "id": "m6zaomc",
      "body": "Yo wtf",
      "created_utc": 1736800370.0,
      "score": 3
    },
    {
      "id": "m6zbper",
      "body": "This is so insane. Im so sorry that the people in your life you're supposed to trust and love betrayed you such a horrendous way. I couldn't imagine doing this to anyone let alone my child. I'm glad you're NC they don't deserve a relationship with you or your children.",
      "created_utc": 1736800668.0,
      "score": 3
    },
    {
      "id": "m6zgtwb",
      "body": "The rage I feel within my heart… May both of them become hosts for worms.",
      "created_utc": 1736802157.0,
      "score": 3
    },
    {
      "id": "m6zpxzz",
      "body": "Your stepfather is a cruel monster! My goodness! I'm not a therapist and I don't know your stepdad personally (I wouldn't want to meet a guy like that either) but that is **psychopathic**! He has enjoyed his cruelty towards you to the fullest. DISGUSTING! Run!",
      "created_utc": 1736804807.0,
      "score": 3
    },
    {
      "id": "m709k14",
      "body": "I bet you’re the best mum to those twins!  I’m sorry people are so shitty xxx",
      "created_utc": 1736810932.0,
      "score": 3
    },
    {
      "id": "m70ayjn",
      "body": "I don’t have anything to say other than this is awful, and he’s a horrible person",
      "created_utc": 1736811407.0,
      "score": 3
    },
    {
      "id": "m70ceyc",
      "body": "This is so unbelievably twisted, the psychotic cruelty of such an action is deeply horrifying. I hope you've been able to recover as best you can.",
      "created_utc": 1736811903.0,
      "score": 3
    },
    {
      "id": "m70e8db",
      "body": "This is so heartbreaking to think of you being so young and going through so many emotions and feelings for the entertainment of someone who was supposed to love and protect you. Not to mention having to deal with the social side of it. I’m sorry that happened to you and I hope you can find peace. Hopefully your sweet babies help you because I agree with you that one of those twins was the baby you grew to love before.",
      "created_utc": 1736812515.0,
      "score": 3
    },
    {
      "id": "m70fk4h",
      "body": "This is absolutely horrible. I’m sorry he put you through that trauma.",
      "created_utc": 1736812961.0,
      "score": 3
    },
    {
      "id": "m70fpvf",
      "body": "Congratulations on your twins. Of course your love for the baby you thought you were going to have back then was real. I hope giving that love to the babies you do have now can be healing in some way. You never deserved to be put through what he put you through. No one deserves that, but it's an especially cruel thing to do to a child.\n\n\n>It always felt wrong to say i suffered a miscarriage so i never felt like i could talk to somebody about the kind of grief i felt.\n\n\nYou are not wrong if that is how you feel about it. You thought you were going to have a baby. Then you were told you wouldn't be. That is the essence of a miscarriage, really, isn't it? Not only that but you were also deceived and betrayed by the people who were supposed to be your caregivers and protectors. Your trauma and feelings about it are valid.",
      "created_utc": 1736813016.0,
      "score": 3
    },
    {
      "id": "m70i8wb",
      "body": "This is psychotic behavior. And your mom being onboard makes me even more upset. I’m glad you’re NC with them. They’re monsters.",
      "created_utc": 1736813861.0,
      "score": 3
    },
    {
      "id": "m70je2i",
      "body": "Oh man, this is horrible!  such a horrible traumatic experience. I will never understand how parents do this kinda of twisted awful things to their children to teach them a lesson.. like whaaaat. Horrible human being. I am so sorry that happened to you.",
      "created_utc": 1736814241.0,
      "score": 3
    },
    {
      "id": "m714v6f",
      "body": "I am SO sorry OP. I can't imagine the pain, confusion, and just utter despair that put you through. Your step-dad (and mum) is a disgusting excuse for a human being. I have no words I can share other than I hope you continue to heal and find happiness, that I believe you, I see your pain, and know that you aren't alone. \n\nMy mum is a pathological liar due to some pretty heavy untreated mental health problems, and has told me things I believed and shared as true, that turned out not to be, making me look and feel like a liar. I know it's not the same, but I do know how horrible that feeling of being made out to appear like a liar because you trusted your parent, your guardian, to protect you and be honest. It's such an isolating experience. \n\nI hear you, I feel your hurt, I support you. You should never have had to go through that 💕",
      "created_utc": 1736821271.0,
      "score": 3
    },
    {
      "id": "m72lk33",
      "body": "Your kids are so lucky to have you.  Your parents are mentally ill, you deserve some time in therapy to process and put this in its proper place as you go through more adulting stages.  I am humbled by your final paragraph.  You are a good person.",
      "created_utc": 1736845921.0,
      "score": 3
    },
    {
      "id": "m734zgo",
      "body": "That's pretty abusive behaviour imo, from mom as well as stepdad",
      "created_utc": 1736857389.0,
      "score": 3
    },
    {
      "id": "m6x8skj",
      "body": "I would go no contact with your stepdad.",
      "created_utc": 1736778172.0,
      "score": 3
    },
    {
      "id": "m6yod1v",
      "body": "So did you not have a period that entire time or what?",
      "created_utc": 1736793872.0,
      "score": 3
    },
    {
      "id": "m6xub14",
      "body": "Is this for real? 🤯😲\n\nGlad you're nc with these psychos.\n\nI'm going to tell my now grown son about this. Maybe the time he lied to me (a pretty major lie) at age nine, and his consequence was, I made him write me five book reports over Christmas vacation, won't seem as comparable to him to living in a Khmer Rouge camp in comparison. (I was the meanest mom, you see.) \n\nYour stepfather, (and your mother is not blameless here!), messed with a lot of fundamentally important things. Your ability to listen to your body. Your normal budding sexuality. Your maternal instinct. Your place in the cutthroat society of school, your reputation, your sense of self.\n\nYour trust in other humans.\n\n\"Gaslighting\" gets tossed around so much, it's become almost meaningless, but this is that, distilled to its purest form and kicked up to 11. I was a fifteen year old girl, too. She is feeling all your feelings. 😭  I'm so sorry this happened. ❤️",
      "created_utc": 1736785143.0,
      "score": 6
    },
    {
      "id": "m6xmza5",
      "body": "Bless you, your best revenge is to have a good life without the",
      "created_utc": 1736782915.0,
      "score": 2
    },
    {
      "id": "m6xrjnu",
      "body": "This is a heartbreaking story. I'm glad you got your little family in the end, and I'm sure your children love you, you sound like a loving mom. <3",
      "created_utc": 1736784311.0,
      "score": 2
    },
    {
      "id": "m6y1uzq",
      "body": "there are some fuckin insane people in this world",
      "created_utc": 1736787366.0,
      "score": 2
    },
    {
      "id": "m6ypw8t",
      "body": "What an evil thing to do to you. I can only imagine how much that traumatized you. If you haven't already, please consider getting treatment to help with the trauma you've suffered.",
      "created_utc": 1736794319.0,
      "score": 2
    },
    {
      "id": "m6yymf3",
      "body": "i am so sorry",
      "created_utc": 1736796852.0,
      "score": 2
    },
    {
      "id": "m6z04xt",
      "body": "Thanks for getting it off your chest, and unfortunately your father wasn't the greatest in that moment. \n\nI do hope you seek some sort of support for this, and even this in itself, you writing  this out, probably helps somewhat.",
      "created_utc": 1736797291.0,
      "score": 2
    },
    {
      "id": "m6zfg9w",
      "body": "Just came to say I'm so sorry you had to go through this! Also to say i LOVE how you look at your twins! Good for you mumma. Keep your head up queen xx",
      "created_utc": 1736801759.0,
      "score": 2
    },
    {
      "id": "m6zib4m",
      "body": "Best choice OP.  Your stepfather IMO was deranged.",
      "created_utc": 1736802586.0,
      "score": 2
    },
    {
      "id": "m6zrx54",
      "body": "That is grief. It is completely okay to grieve that",
      "created_utc": 1736805378.0,
      "score": 2
    },
    {
      "id": "m70mek0",
      "body": "I can’t relate to this exactly, but your last paragraph resonated with me because my mom died a year and a half ago from breast cancer (I was 19). I found out I was pregnant almost exactly a year after she died, and they also ended up being twins. I am 29 weeks along with identical girls and to me it just felt like God blessed me through them and these girls are now everything to me. I’m so glad you got two children and I honestly believe that you are getting the child you grieved over. I cannot believe someone would do something that horrible to you and even laugh about it. I hope you find healing, even though it may take a while, and that your twins will help you in that healing. Much love💞",
      "created_utc": 1736815244.0,
      "score": 2
    },
    {
      "id": "m70mpdn",
      "body": "When it comes time for you to pick a nursing home or caregivers ... remember what he did to you.",
      "created_utc": 1736815345.0,
      "score": 2
    },
    {
      "id": "m70pttr",
      "body": "I’m so sorry, girl. This is nightmare material. I’m really glad you got it off your chest and told us. Congrats on your twins. Wishing you all good things.",
      "created_utc": 1736816383.0,
      "score": 2
    },
    {
      "id": "m714gdb",
      "body": "Right. I haven’t even read to the end and I am FURIOUS with that piece of shit “man” - is there any way that you can get legal help to sue his abusive, sick ass right off the planet??? I have rarely heard a more cruel story than yours. I am SO sorry that you were put through this, OP. Your stepfather’s behaviour was actually heinous. Someone like him should be tattooed on the forehead with the word ABUSER.",
      "created_utc": 1736821133.0,
      "score": 2
    },
    {
      "id": "m71bqjj",
      "body": "Your mom and step dad are both disgusting in this scenario. I’m so sorry that happened to you.",
      "created_utc": 1736823462.0,
      "score": 2
    },
    {
      "id": "m71eb79",
      "body": "This has got to be one of the craziest things I’ve ever heard. That must have been horrific",
      "created_utc": 1736824315.0,
      "score": 2
    },
    {
      "id": "m71fgsv",
      "body": "I’m so SO Sorry OP! I hope you find the way to get through this and live your BEST life EVER! This was totally wrong and uncalled for! My heart hurts for the 15 yr old you and the new you… I know you’ll be the BEST mom ever and love your children with all your heart! \n\nI truly believe in KARMA! Please seek counseling… you deserve to trust and hope and have Faith… Good luck OP… wishing you All the Best in Life…",
      "created_utc": 1736824718.0,
      "score": 2
    },
    {
      "id": "m7266om",
      "body": "I am so sorry you had to go thru that. I am shocked someone could be that cold hearted. I am also so angry your mom did not stand up for you (I had a\nstepfather who was mentally and emotionally abuse and my mom stayed quiet so I know that betrayal) I am so glad you had twins and are experiencing that love",
      "created_utc": 1736836366.0,
      "score": 2
    },
    {
      "id": "m729tvk",
      "body": "That is horrible. Your stepfather was abusive to do this. I hope you have kicked him out of your life forever. Your mother should have kicked him out the moment she found out he treated you like this. Congratulations on your twins 👏",
      "created_utc": 1736838457.0,
      "score": 2
    },
    {
      "id": "m72a3ed",
      "body": "Two, well, three books I highly recommend:\n\n1.\t⁠Adult Survivors of Toxic Family Members by Sherrie Campbell\n2.\t⁠Adult Survivors of Emotionally Abusive Parents by Sherrie Campbell\n3.\t⁠Healing From Hidden Abuse by Shannon Thomas\n\nHFHA I was instructed to listen to “on a loop” by my therapist in 2020 when my life fell apart and I couldn’t find an alternative to moving back in with my parents for a few months. It’s amazing at helping to resist getting disoriented, brainwashed, and mindfucked when exposed to old  abusers or triggered by exposure to new ones, like in a job for example.\n\nA few weeks ago, while visiting, my mom acted out in a way that I haven’t experienced since I was a child (I’m 34 now, I’ve had low/no contact for a year from both parents). It was destabilizing and retraumatizing to a startling degree and behavior that I’d forgotten she was capable of.\n\nI experienced a pretty severe dissociative/trauma paralysis shutdown for 36 hours and then started googling for any new-to-me books on covert parental narcissistic abuse.\n\nDr. Sherrie Campbell’s books are brand new. 2022 and 2024. They’re heavy, but I don’t know if anything has ever validated my experience to the degree that her books have.\n\nPeople who have not been abused by their parents really struggle to be able to accept the depths of cruelty that are possible. It can be so lonely.\n\nAnyway…just wanted to chime in and share her books in case any other fellow members of the shitty parents club could benefit from the resources. They’re both on Audible, I rented mine from my library audiobook apps.\n\n1000/10 recommend. Therapy, too, of course. These are great books to keep you company while screening for a therapist who understands that this type of parental abuse exists. I cannot overstate the importance of working with a clinician who has had experience working with survivors and does not have a cognitive dissonance response when this type of sadistic and, at times, covert pathology is disclosed to them.\n\nWishing you peace and healing <3",
      "created_utc": 1736838611.0,
      "score": 2
    },
    {
      "id": "m72e7d1",
      "body": "My goodness what an asshole...",
      "created_utc": 1736841131.0,
      "score": 2
    },
    {
      "id": "m72fhci",
      "body": "This is unbelievably fucked up. I’ve got no words",
      "created_utc": 1736841925.0,
      "score": 2
    },
    {
      "id": "m72t007",
      "body": "That’s deeply fucced up\nSo so cruel",
      "created_utc": 1736850798.0,
      "score": 2
    },
    {
      "id": "m732aj4",
      "body": "That is utterly horrific, how could anyone do that is beyond me. Your best revenge will be to live your life without them.",
      "created_utc": 1736856086.0,
      "score": 2
    },
    {
      "id": "m7332x5",
      "body": "That is **immensely** fucked up. I’m glad you were able to go NC and find peace.",
      "created_utc": 1736856478.0,
      "score": 2
    },
    {
      "id": "m73cii1",
      "body": "So i hope for you that you went no contact and that he will never see your kids. That is so toxic and manipulative i felt sick reading this. How can anyone do this and actually laugh all the while...i hope you're doing better now <3",
      "created_utc": 1736860653.0,
      "score": 2
    },
    {
      "id": "m73j8an",
      "body": "I have no advice because I'm a guy, but I love your last paragraph!",
      "created_utc": 1736863210.0,
      "score": 2
    },
    {
      "id": "m73jpjl",
      "body": "I'm sorry your stepdad is a horrible, cruel jerk. But your edit was so beautiful,  a great way to think of it. I hope you're in therapy too. Much love. ",
      "created_utc": 1736863389.0,
      "score": 2
    },
    {
      "id": "m73lqdv",
      "body": "If these were my parents, I would’ve gladly risked the gallows by taking them out myself",
      "created_utc": 1736864132.0,
      "score": 2
    },
    {
      "id": "m73u94b",
      "body": "Child abuse at its finest. I’m so very sorry. NC was/is a great idea. I hope you become the opposite parent of what you had. \n\nI pray you have the best life filled with everything you need and enough of what you want. \n\nGood luck and God bless you and yours.",
      "created_utc": 1736867046.0,
      "score": 2
    },
    {
      "id": "m755oc6",
      "body": "Your nc parents are insane. So glad you are out. \n\nThat's the one of the most psychologically traumatic thing I've read on here.",
      "created_utc": 1736881093.0,
      "score": 2
    },
    {
      "id": "m75khwv",
      "body": "The cruelty of that man is breathtaking. I feel sick. The grief and fear you've endured - let alone during childhood/adolescence. My heart hurts for the little girl you were. I can only imagine what else you had to endure, and I'm so sorry.\n\nY'all need a grandma, say hey. 🧡",
      "created_utc": 1736885400.0,
      "score": 2
    },
    {
      "id": "m77duwc",
      "body": "I'm so proud of you for protecting yourself (and your kids) by going no contact with your abusers. Best things I ever did!",
      "created_utc": 1736906682.0,
      "score": 2
    },
    {
      "id": "m786jg1",
      "body": "Your mother and step father are literal monsters.",
      "created_utc": 1736917804.0,
      "score": 2
    },
    {
      "id": "m786xmu",
      "body": "I'm proud of you. I love the symbolism of the twins. I agree.",
      "created_utc": 1736917992.0,
      "score": 2
    },
    {
      "id": "m78y19d",
      "body": "There is a special place for your step dad and mum in hell.\n\nWho the hell does this to a teenager?! Holy shit.\n\nHonestly, I'd be tempted to sue for emotional distress. And make sure to tell everyone you know so nobody supports them!",
      "created_utc": 1736934072.0,
      "score": 2
    },
    {
      "id": "m7b3yvb",
      "body": "It's not often that I see something that pisses me off this much. It was an unimaginably cruel POS thing to do. The disruption of trust is because his actions gave you relational PTSD and I am very pleased you have good relationship and kids now. It's actually a betrayal trauma perpetrated by an emotionally and psychologically abusive person who lacks empathy (the pisstaking suggests that) NC is a good decision 👌",
      "created_utc": 1736964036.0,
      "score": 2
    },
    {
      "id": "m70m2o8",
      "body": "What a cruel man, he would be dead to me, never speak to that abuser again.",
      "created_utc": 1736815134.0,
      "score": 1
    },
    {
      "id": "m70uc4s",
      "body": "Uh \nThat’s some horrific emotional abuse\nI would understand if maybe he let you believe it for a few minutes to make a point, but a MONTH is diabolical. I am so sorry and I hope you find some peace",
      "created_utc": 1736817868.0,
      "score": 1
    },
    {
      "id": "m714ti1",
      "body": "Sorry. I was too angry to read to the end before I made my first comment. I think that it is absolutely lovely and very meaningful that you had twins.",
      "created_utc": 1736821257.0,
      "score": 1
    },
    {
      "id": "m718w20",
      "body": "Oh my fuck. I’m so, so sorry. ❤️",
      "created_utc": 1736822533.0,
      "score": 1
    },
    {
      "id": "m71ncge",
      "body": "I’m so so sorry. That was so cruel of him to put you through. \n\nCongratulations on your twins 💕",
      "created_utc": 1736827577.0,
      "score": 1
    },
    {
      "id": "m71oqw2",
      "body": "That is absolutely horrible - what an evil man. OP I’m so sorry that happened to you.",
      "created_utc": 1736828116.0,
      "score": 1
    },
    {
      "id": "m71oslb",
      "body": "Oh my dear, I hear your grief and wow I’m so happy you had twins. That baby you loved still chose to come to you, how beautiful! I do hope that overshadows the pain, I cannot even begin to imagine how earth shattering that experience would be. That should have never happened to you.",
      "created_utc": 1736828134.0,
      "score": 1
    },
    {
      "id": "m71plan",
      "body": "Absolutely brutal and cruel. I can not even fathom what kind of assholes do this to their daughter. I am heartbroken for you. I'm also glad to read that you're NC with them.  I am so sorry this happened to you. It taught you absolutely nothing except to not trust the adults that were supposed to love and guide you.",
      "created_utc": 1736828441.0,
      "score": 1
    },
    {
      "id": "m71riuz",
      "body": "This is absolutely horrible. And your mom thought it was a good idea? WHAT?!?! I am so sorry you have to live with these people, focus on your future and your independence. Get out of that environment as soon as you can because that’s not a good home. I’m so sorry you’re going through that.",
      "created_utc": 1736829232.0,
      "score": 1
    },
    {
      "id": "m71yatc",
      "body": "How cruel \n\nAnd now congratulations on your twins. Your positive spin is beautiful to read.",
      "created_utc": 1736832278.0,
      "score": 1
    },
    {
      "id": "m721xzq",
      "body": "The things that some parents  and grandparents (step, natural and adoptive) would use and twist and turn into pure blatant psychological and mental manipulation to the children they are supposed to love and care for and about is ridiculous and heartless AF. I'm so very sorry you had to go thru that, OP. 🥺😢 And not only that, the parent who SHOULD have protected you, your Mother, didn't. I am the oldest of 8 at age 44 now, with my own two adult kids, have been blessed enough not to experience this -from my Mother or myself! My deadbeat Father low-key tried the mental and psychological manipulation and Mother didn't allow this at all!!! And addressed it and made sure we knew we didn't have to be subjected to it! Parents are supposed to nurture, guide, protect, care for and love the children entrusted to them! I am so upset for you, yo. I was actually a teen parent in my junior year old HS. My Mother and my Dad (Step) NEVER made me feel No kind of way and supported me. Never shamed me, or embarrassed me. I can't even imagine experiencing what you did and there wasn't even an actual baby, yo! I'm happy you were blessed with twins, I agree that you got back the baby you \"lost\", and I am quite sure you are being a great Mom to them!",
      "created_utc": 1736834083.0,
      "score": 1
    },
    {
      "id": "m72afxl",
      "body": "I cannot unread the tittle anymore.  Ahhhhhhhhh!",
      "created_utc": 1736838820.0,
      "score": 1
    },
    {
      "id": "m72xh5x",
      "body": "In before Smosh reads this in a video \n(In all seriousness though, I am so so sorry that happened to you. With the way you described your recent twins though, it seems like they couldn't have been born to a more deserving and loving mother, who I'm sure will make them feel all the love in the world and then some)",
      "created_utc": 1736853482.0,
      "score": 1
    },
    {
      "id": "m73x73v",
      "body": "Un-effing-believable! Have you had any therapy after you moved out?  Good on you for going NC.",
      "created_utc": 1736867986.0,
      "score": 1
    },
    {
      "id": "m74084s",
      "body": "Psychotherapy would help you!! please consider this.",
      "created_utc": 1736868938.0,
      "score": 1
    },
    {
      "id": "m74eiuy",
      "body": "This is absolutely horrific.",
      "created_utc": 1736873242.0,
      "score": 1
    },
    {
      "id": "m74fojk",
      "body": "Your stepdad is a demon.",
      "created_utc": 1736873579.0,
      "score": 1
    },
    {
      "id": "m74fpaz",
      "body": "That's... a very creative form of abuse, I'll give him that. Sadly you don't get points for creativity when you're an abusive piece of sh!t though. Hope he has exactly the life he deserves",
      "created_utc": 1736873585.0,
      "score": 1
    },
    {
      "id": "m74hkk4",
      "body": "Holy shit, that a mental mind fuck. Especially being 15 and not knowing. It sounds like you believed them so much you actually had symptoms. Thats really messed up, they could have done damage because I heard \"mental pregnancy\" is a thing, I forgot what the word for it was. But basically its the person beliving they are pregnant and they go through harmon changes that will mimic pregnancy symptoms. Or something like that. \n\n\nI would never talk to my mom again because one why she let that go on for months and two why didn't she tell you about your body and pregnancy? ",
      "created_utc": 1736874129.0,
      "score": 1
    },
    {
      "id": "m74tdct",
      "body": "Sooo you didn’t get your period? I don’t believe this lol",
      "created_utc": 1736877553.0,
      "score": 1
    },
    {
      "id": "m74uohx",
      "body": "I'm so so sorry 😔 I had a dad who constantly pranked me especially as a small, gullible child. It was so dramatic and traumatic for me that at 48, I still have some trust issues. I've had to work through it in therapy. You may likely have PTSD. I hope you seek therapy if you haven't already. ((HUGS))",
      "created_utc": 1736877932.0,
      "score": 1
    },
    {
      "id": "m75bo34",
      "body": "this is abhorrent, it’s the reading out your journal that’s the final straw blatantly violating your privacy but i guess any trust between you was lost even before that, but i’m assuming there were personal things written not only about your mental state but physically and the fact he is so able to not just brush this off but MOCK IT makes me furious so happy for you now op congratulations on ur twin little squishes",
      "created_utc": 1736882839.0,
      "score": 1
    },
    {
      "id": "m776bw2",
      "body": "Wow OP, I’m so so sorry. 😞 \n\nI hope you got appropriate care and therapy afterwards.",
      "created_utc": 1736904079.0,
      "score": 1
    },
    {
      "id": "m7b99ep",
      "body": "What POS! I'm so sorry! I hope you're slowly finding peace with everything you've gone through. You are so incredibly strong. Going NC was the best thing to do. ",
      "created_utc": 1736965558.0,
      "score": 1
    },
    {
      "id": "m7gvzrm",
      "body": "WTF!\n\n\nSO SORRY THIS HAPPENED TO YOU",
      "created_utc": 1737043463.0,
      "score": 1
    },
    {
      "id": "m7k6446",
      "body": "Please tell me you’re now no-contact with your stepdouche now!",
      "created_utc": 1737079279.0,
      "score": 1
    },
    {
      "id": "m7mwon1",
      "body": "Wow, seriously insane and hurtful. So sorry and thanks for sharing.",
      "created_utc": 1737125711.0,
      "score": 1
    },
    {
      "id": "m7wccdv",
      "body": "I haven’t spoken to my mom for much less. I’m so sorry that happened to you, can’t begin to understand the feeling. Even when I dream of having a baby and wake up to none is devastating enough!",
      "created_utc": 1737247895.0,
      "score": 1
    },
    {
      "id": "m7wrznw",
      "body": "That is so messed up! I’m so glad you had wonderful twins that you love. Screw the adults in your life. I hope they have the end they deserve.",
      "created_utc": 1737253163.0,
      "score": 1
    },
    {
      "id": "m81vzvz",
      "body": "I’m not given to superstition but I really appreciate the symbology of twins after your experience.\nI don’t have the words. He was cruel, not just needlessly in the spur of the moment, but calculated, willfully, purposefully cruel. That’s a level of psychological torture I couldn’t fathom existing.\nI assume non contact, honestly there should be a prison sentence for that.",
      "created_utc": 1737322239.0,
      "score": 1
    },
    {
      "id": "m867e2h",
      "body": "That's horrifying, I'm so sorry you went through that. I can't imagine how the lie must've felt, but I do relate to the part about thinking you're pregnant and then finding out you're not.\n\nWhen I was a teenager I thought I was pregnant as well, like missed periods, all of the symptoms, everything. I planned out how to provide for the baby, thought about names and really grew to love this baby (who ended up not being real). I was ready to drop out of high school, fully grieving the loss of my own youth but excited to bring a little life into the world.. and then I found out after around 2 months that I wasn't pregnant after all (I can't even imagine how you felt after 5!!). My period also didn't come back for another few months, which made it even harder to really accept. I've never met anyone else who really understood that grief, and I was told by a lot of people that I shouldn't be sad because there was never a baby there to begin with. My partner at the time even called me crazy for being heartbroken and needing to grieve. This all happened 5 years ago but I still think about that baby, and I'm not a mother yet but it made me realise that I want to be someday. I think it was also part of what finally made me realise that I needed to leave the abusive people I was around back then.\n\nAnyway, I guess I just wanted to share and let you know that you're not the only one and that it's completely understandable and normal to grieve. Hearing your story helped me feel seen as well, so thank you for sharing",
      "created_utc": 1737386598.0,
      "score": 1
    },
    {
      "id": "m8k0ipf",
      "body": "Never have I ever wanted to\n\nA) reach through the screen and give someone a hug so badly and\n\nb) find the absolute excuse of a human being who did this and give them an absolute chewing out",
      "created_utc": 1737561931.0,
      "score": 1
    },
    {
      "id": "m9kdh6w",
      "body": "I’m so sorry OP. I hope you got out of that house ASAP and immediately went NC. Did the school authorities never get involved when they heard there was a teen pregnancy?? I wish they had so your evil parents (yes mom too) could’ve been outted & investigated. Do you have any siblings? I hope you have a tribe you can lean on. That’s pure evil. While I’ve never been through that situation, I have miscarried twice & I believe fully that you willed your lost baby into existence.",
      "created_utc": 1738029796.0,
      "score": 1
    },
    {
      "id": "m9kf4nw",
      "body": "I know it’s probably too much to put on you, but I’d absolutely love you to spread this story around to all their family, friends, parish, etc…I’d love for your high school friends and their parents to know the truth finally. Maybe one day, you’ll feel like it’s the right thing for you to put the social shame back on them where it belongs. Not that you ever have too or are weak if you don’t. You have to do what’s right for you. I’d just love if it did.",
      "created_utc": 1738030332.0,
      "score": 1
    },
    {
      "id": "m9qi4dy",
      "body": "This is truly evil. I’m very sorry that this happened",
      "created_utc": 1738110035.0,
      "score": 1
    },
    {
      "id": "m9tfc82",
      "body": "You should write a book about this and send the first copy to the stepfather lol ",
      "created_utc": 1738156721.0,
      "score": 1
    },
    {
      "id": "maxwghb",
      "body": "If you need to talk, please do. \n\nListen, I get it. When I was in my early 20’s, we were about to adopt (difficulty conceiving). Long story, but she dropped contact after we refused to give her $2000 for a down payment on a new car.  \n\nWe went to counseling and we were told that we had to grieve THE SAME AS IF WE LOST OUR OWN CHILD!  \n\nI can’t stress this enough. I’m sure other commenters are saying the same thing. You did loose a child, and you need to grieve in the same manner. \n\nI’m so sorry this happened to you. Get counseling and help.",
      "created_utc": 1738685267.0,
      "score": 1
    },
    {
      "id": "mb0uin0",
      "body": "I've been in a situation that's not quite the same, but similar enough for me to share here. Almost two years ago, my ex and I were together and a few months in she tells me she is pregnant and that the baby is mine. After about a month she tells me she lost the baby and practically ghosted me a few days later. Flash forward to two ago when I find out that 1. she did not lose the baby. 2. it was the baby's first birthday. 3. she was raising the baby with guy she was with before me.\n\nIt is incredibly weird to have mourned the loss of multiple futures with this woman within just a few months, just to now know that everything was a lie.",
      "created_utc": 1738716510.0,
      "score": 1
    },
    {
      "id": "mic3xyk",
      "body": "Sorry to hear this that's absolutely horrific.",
      "created_utc": 1742248867.0,
      "score": 1
    },
    {
      "id": "m6yg55n",
      "body": "Chatgpt, is that you?",
      "created_utc": 1736791503.0,
      "score": -6
    },
    {
      "id": "m7drdw7",
      "body": "WHAT IN THE WORLD!!! I'm so sorry that is WRONG!",
      "created_utc": 1736993047.0,
      "score": -1
    },
    {
      "id": "m6x0kbx",
      "body": "She thought it was a good idea at the time and has been very much \"oh good grief\" about my feelings. We are nc",
      "created_utc": 1736775048.0,
      "score": 5196
    },
    {
      "id": "m6x2c1x",
      "body": "Honestly I've been too embarrassed to utter a word to anybody beside my husband until now. It's just been marinating in the ol noggin for 10 years",
      "created_utc": 1736775748.0,
      "score": 1474
    },
    {
      "id": "m6x2rbz",
      "body": "Also yes I've been NC with both of them for years. I discovered i had cancer two years later and basically said I'd refuse treatment if they didn't let me move out. The rest is history",
      "created_utc": 1736775912.0,
      "score": 552
    },
    {
      "id": "m6xcg4u",
      "body": "Omg, what kind of support group should we make? This level of abuse is so creative, there's not even a name for it. I'm so sorry you had to go through that, i was diagnosed with cancer two years after this happened and I used it as my golden ticket opportunity to get out and told them I'd refuse treatment if they didn't let me move out. I'm so glad you're NC with them and we got out 💖",
      "created_utc": 1736779482.0,
      "score": 762
    },
    {
      "id": "m6y0qh0",
      "body": "This is actually fucking insane. I’m so sorry for your and op.",
      "created_utc": 1736787038.0,
      "score": 109
    },
    {
      "id": "m6zsjeh",
      "body": "Your dad is scum.",
      "created_utc": 1736805562.0,
      "score": 22
    },
    {
      "id": "m729h2l",
      "body": "Two, well, three books I highly recommend:\n\n1) Adult Survivors of Toxic Family Members by Sherrie Campbell\n\n2) Adult Survivors of Emotionally Abusive Parents by Sherrie Campbell \n\n3) Healing From Hidden Abuse by Shannon Thomas\n\n\nHFHA I was instructed to listen to “on a loop” by my therapist in 2020 when my life fell apart and I couldn’t find an alternative to moving back in with my parents for a few months. It’s amazing at helping to resist getting disoriented, brainwashed, and mindfucked when exposed to old  abusers or triggered by exposure to new ones, like in a job for example. \n\nA few weeks ago, while visiting, my mom acted out in a way that I haven’t experienced since I was a child (I’m 34 now, I’ve had low/no contact for a year from both parents). It was destabilizing and retraumatizing to a startling degree and behavior that I’d forgotten she was capable of. \n\nI experienced a pretty severe dissociative/trauma paralysis shutdown for 36 hours and then started googling for any new-to-me books on covert parental narcissistic abuse. \n\nDr. Sherrie Campbell’s books are brand new. 2022 and 2024. They’re heavy, but I don’t know if anything has ever validated my experience to the degree that her books have. \n\nPeople who have not been abused by their parents really struggle to be able to accept the depths of cruelty that are possible. It can be so lonely. \n\nAnyway…just wanted to chime in and share her books in case any other fellow members of the shitty parents club could benefit from the resources. They’re both on Audible, I rented mine from my library audiobook apps.  \n\n1000/10 recommend. Therapy, too. These are great books to keep you company while screening for a therapist understands this type of parental abuse. I cannot overstate the importance of working with a clinician who has had exposure to this type of sadistic and, at times, covert pathology. \n\nWishing you peace and healing <3",
      "created_utc": 1736838246.0,
      "score": 17
    },
    {
      "id": "m6x3ubc",
      "body": "Child abuse and psychological torture.",
      "created_utc": 1736776328.0,
      "score": 1674
    },
    {
      "id": "m6x670e",
      "body": "[deleted]",
      "created_utc": 1736777216.0,
      "score": 330
    },
    {
      "id": "m6x6l2d",
      "body": "Thank you 💖  I gave the first twin the name of the \"father\" of the baby i thought i was having",
      "created_utc": 1736777363.0,
      "score": 364
    },
    {
      "id": "m6yxl8b",
      "body": "And may they perpetually smell sweet to attract even more.",
      "created_utc": 1736796555.0,
      "score": 51
    },
    {
      "id": "m70ykls",
      "body": "May their pillows always be the wrong temperature and may they find legos under their feet.",
      "created_utc": 1736819241.0,
      "score": 16
    },
    {
      "id": "m73weta",
      "body": "May they have frequent diarrhea and no bathrooms anywhere near them.",
      "created_utc": 1736867738.0,
      "score": 6
    },
    {
      "id": "m7wplcc",
      "body": "May their water heater run out of hot water halfway through their every shower.",
      "created_utc": 1737252358.0,
      "score": 1
    },
    {
      "id": "m6x7gv3",
      "body": "I've struggled with whether or not my experience falls into that category over the years given that I was specifically told I was pregnant but I think I will give the community a try. Thank you for the push 💖",
      "created_utc": 1736777690.0,
      "score": 178
    },
    {
      "id": "m6x5ege",
      "body": "After I cut them off, my life just kept getting better and better. I always felt like I was destined to be this mentally screwed up person that would one day end up dead or on the streets. I have a lot of trauma now but I've learned that a lot of my issues were from my environment",
      "created_utc": 1736776916.0,
      "score": 218
    },
    {
      "id": "m6x6aip",
      "body": "So he was on a lot of drugs at the time. He's clean now and a completely different person and is a great dad to my ex step sisters. It doesn't change what he did or how I feel about him but knowing he's better now adds a lot of complexity to my emotions. And not in a good way.\n\nMy mom, she orchestrated the restriction I was on, she was actually the badder guy while I was \"pregnant.\" At least up until the chirade was up.",
      "created_utc": 1736777252.0,
      "score": 112
    },
    {
      "id": "m74dkh7",
      "body": "I don't know about the US - assuming OP is from there - since I'm Italian, but here it would DEFINITELY be considered a crime and her parents would both be on trial for child abuse, psychological abuse, and possibly other crimes as well.",
      "created_utc": 1736872962.0,
      "score": 4
    },
    {
      "id": "m72o43b",
      "body": "Please tell me you didn't marry him or you divorced him at some point?",
      "created_utc": 1736847644.0,
      "score": 6
    },
    {
      "id": "m72d173",
      "body": "It's crazy the things our minds can do. Make someone believe they're pregnant and have all the physical signs and changes, without a baby. Grieving a DREAMED UP child. \n\nIn my case, I had an irl miscarriage almost 7 years ago... my mind was processing that long before my conscious awareness of what happened sank in. I had PPD for 3 years undiagnosed, and my mind's coping skill was to give one of the story characters I created who lived in my mind find out she was pregnant and had a healthy baby boy a few months after my miscarriage... I only learned the name and gender of this child literal days ago while processing memories and connections to my imagination as part of my therapy work o.O \n\nAnd of course it was a boy. So my \"imaginary\" sister and her teen hood best friend both had little boys less than a year apart who would end up being best friends haha. (I say \"imaginary\" because while yes the sister I created at almost 5 years old has always been fictional, she has grown up alongside me and been there in every way a real person would be, without actually being on this plane of reality)",
      "created_utc": 1736840409.0,
      "score": 2
    },
    {
      "id": "m72dbb4",
      "body": "I was trying to remember the proper term for it!",
      "created_utc": 1736840582.0,
      "score": 2
    },
    {
      "id": "m6zs515",
      "body": "I think so too.",
      "created_utc": 1736805444.0,
      "score": 4
    },
    {
      "id": "m6xbv3f",
      "body": "I was alienated from him and we got to reconnect for a short time before he unfortunately passed away when i was 18. We had so much to talk about, i hadn't brought it up to him. But it's better that way, id hate for him to have known what I went through due to circumstances that weren't his fault. I was so precious to him 💖",
      "created_utc": 1736779276.0,
      "score": 66
    },
    {
      "id": "m73znqk",
      "body": "Psychotic ≠ Psycopath",
      "created_utc": 1736868760.0,
      "score": 1
    },
    {
      "id": "m6zr9jw",
      "body": "I agree!",
      "created_utc": 1736805190.0,
      "score": 1
    },
    {
      "id": "m72e687",
      "body": "Judging by the comment about this happening 10 years ago, I'd guess OP is somewhere between 25 and 27",
      "created_utc": 1736841112.0,
      "score": 2
    },
    {
      "id": "m6zquh6",
      "body": "It is.",
      "created_utc": 1736805069.0,
      "score": 2
    },
    {
      "id": "m72dnzw",
      "body": "OP went NC with them 2 years later, with an ultimatum about not treating the cancer she found out about AT 17 unless she could leave. That's one hell of a FU if you ask me",
      "created_utc": 1736840799.0,
      "score": 5
    },
    {
      "id": "m72f0x2",
      "body": "Raised by narcissists? \"Just no\" stepparents? I can think of a lot of subs to throw this in xD",
      "created_utc": 1736841637.0,
      "score": 3
    },
    {
      "id": "m7vra20",
      "body": "The correct term is \"psychosomatic\", this isn't the 19th century.",
      "created_utc": 1737241163.0,
      "score": 2
    },
    {
      "id": "m72ebuy",
      "body": "This being a phantom/hysterical pregnancy, her mind convinced her body it was pregnant, and so I'd assume it responded accordingly with not giving her periods while she was \"pregnant\"... thought being irregular at 15 is common even without mental health getting involved",
      "created_utc": 1736841209.0,
      "score": 2
    },
    {
      "id": "m72ffry",
      "body": "100% what I'd recommend.  I'm currently seeing a trauma-informed clinical social worker intern (with 10 years social work experience), and working through my (what's starting to seem more like) run-of-the-mill childhood trauma alongside my 11 years of being in abusive relationship trauma... and it's made such a difference in the 4 months I've been seeing her!!",
      "created_utc": 1736841898.0,
      "score": 3
    },
    {
      "id": "m6xeoyg",
      "body": "She has. And with her mother.",
      "created_utc": 1736780242.0,
      "score": 7
    },
    {
      "id": "m72fvb9",
      "body": "Not just A MONTH, but ALMOST FIVE",
      "created_utc": 1736842175.0,
      "score": 1
    },
    {
      "id": "m72fzsn",
      "body": "She fortunately got out 8 years ago",
      "created_utc": 1736842254.0,
      "score": 1
    },
    {
      "id": "m76y2rk",
      "body": "Many women still bleed/get periods while pregnant. Additionally, when younger and first getting cycles they are extremely irregular and you can go months without one and then it's just shows up.\n\nThat's also assuming she had been taught all the proper info about sex and cycles, and as OP said, it was her Dad, what reason did she have (until that point) not to believe him.\n\nYounger kids are nieve and very trusting....",
      "created_utc": 1736901256.0,
      "score": 2
    },
    {
      "id": "m72ob8i",
      "body": "Wow rude much?",
      "created_utc": 1736847774.0,
      "score": 1
    },
    {
      "id": "m6x3x22",
      "body": "Make sure neither one of them ever get access to your children.",
      "created_utc": 1736776358.0,
      "score": 2760
    },
    {
      "id": "m6x3sni",
      "body": "That really sucks op :( not the same situation but my mom enabled a lot of abuse too and it's a different kind of betrayal that hurts. I hope you have better people around you now you really care about your feelings and experiences",
      "created_utc": 1736776311.0,
      "score": 157
    },
    {
      "id": "m6xhgju",
      "body": "Sounds like NC is the way to handle that.  Instead of talking about sex as a teen in a rational, adult manner, let's traumatize our teen!  Yeah, I'd walk away from them too.",
      "created_utc": 1736781165.0,
      "score": 128
    },
    {
      "id": "m6x6k5x",
      "body": "[deleted]",
      "created_utc": 1736777354.0,
      "score": 105
    },
    {
      "id": "m6yyz2i",
      "body": "What your stepdad did and your mother went alone with is just horrible.\n\nHow did they find out you had premarital sex?\n\nI can’t blame you at all for going no contact with your mother. What kind of parent does that to their child.\n\nI’m so sick of females only value still being what’s intacted in between their legs.",
      "created_utc": 1736796953.0,
      "score": 55
    },
    {
      "id": "m6xrqyk",
      "body": "My goodness, what an awful thing to do to your child. I love the thought that you had twins and now you have both of the babies you were meant to have. What a lovely thought. Have you been to therapy to work through this? Also, if you need another mom/grandma, please reach out. I would be happy to chat. Hoping you find the peace you deserve soon. <hugs> 🤗",
      "created_utc": 1736784372.0,
      "score": 82
    },
    {
      "id": "m6zpw59",
      "body": "You where psychologically abused and she’s like meh…. Fuck her so hard",
      "created_utc": 1736804791.0,
      "score": 36
    },
    {
      "id": "m6yf7kj",
      "body": "Good. Your mom deserves it.",
      "created_utc": 1736791231.0,
      "score": 28
    },
    {
      "id": "m72jboe",
      "body": "No contact is a way of saying, no more. \nWho knows what more mental abuse they would cause. \nCongrats on the multiples!",
      "created_utc": 1736844433.0,
      "score": 3
    },
    {
      "id": "m6x5wxh",
      "body": "I’m so sorry you went through that. That is horrible child abuse!! \nI don’t think you should be the one embarrassed, they should. How awful for them to do that to you! \nI think finding a the right therapist would be so healing for you. I really hope you look into that option. I’ve been through some embarrassing things myself,  talking to a therapist helped immensely!!",
      "created_utc": 1736777111.0,
      "score": 303
    },
    {
      "id": "m6xcmow",
      "body": "You have no reason to feel bad what they did was horrendously abusive but not your fault",
      "created_utc": 1736779545.0,
      "score": 83
    },
    {
      "id": "m6xjyzd",
      "body": "Psychologist here. If you are worried, get a therapist with at least five years experience. That will GUARANTEE they don’t even half flinch at this. It was a horrible thing to do to you, and the first time I heard this specific experience. \n\nBut is this the worst story I have heard? Honey, it doesn’t even make top ten. People are terrible sometimes. And talking to a professional could help you a lot.",
      "created_utc": 1736781977.0,
      "score": 327
    },
    {
      "id": "m6zqfki",
      "body": "Don’t ever be embarrassed about it again, you where a kid that was being abused by the ones that should have protected and loved you! \nYou did absolutely nothing wrong!",
      "created_utc": 1736804949.0,
      "score": 26
    },
    {
      "id": "m711ybo",
      "body": "You have nothing to be embarrassed about.\n\n You were a child, and you were psychologically tortured by two disgusting sadistic sick fucks. For months. They have no business to be near children: you, your kids, any other child. They should be embarrassed, now and then. They should be *that people*, not you be *that girl*.\n\nI can assure you, when/if you share this story, majority of people would have no question why you are NC with them. People will be disgusted with your so called parents and angry for you.\n\nI hope you can get some therapy, or at least support groups. It could help a lot. I wish you, husband and your kids all the happiness you can get!",
      "created_utc": 1736820328.0,
      "score": 14
    },
    {
      "id": "m6ylhye",
      "body": "That was some of the worst psychological abuse I've ever heard of from anyone who isn't a cult survivor. \n\nIt's good that you're talking about it. That was unbelievably cruel. \n\nI suspect there's a lawsuit in there.",
      "created_utc": 1736793043.0,
      "score": 47
    },
    {
      "id": "m716rle",
      "body": "I’m so sorry you went through that, and that your mom let it happen. As a mother myself, I would never allow someone to do that to my kids. Never. How incredibly cruel, manipulative, and abusive.\n\nI don’t think you have anything to be embarrassed about, personally. I’ve lost a baby in utero, and I can imagine the grief you felt was very similar to mine. You were grieving the life you thought you would have, and you loved the baby you thought you were growing, and that is completely understandable to me.\n\nCongratulations on your twins!",
      "created_utc": 1736821867.0,
      "score": 7
    },
    {
      "id": "m73uoy0",
      "body": "You have nothing to be embarrassed about. I hope you see this now. What they did to you... i don't have any words to describe how awful it is. It would have been awful for 5 min, but 5 months is diabolical. The grief isn't less just because it wasn't a baby because for 5 months, you were adjusting to the reality where there was a baby.\n\nI think it's wonderful that you had twins. It's inspiring how you heal some of the loss with the additional love when having two babies instead of one. In some way, it seems meant to be.",
      "created_utc": 1736867189.0,
      "score": 2
    },
    {
      "id": "m6x5381",
      "body": "Absolute baller move. Good job getting out.",
      "created_utc": 1736776800.0,
      "score": 190
    },
    {
      "id": "m72lqiy",
      "body": "Kudos to you! Well played",
      "created_utc": 1736846040.0,
      "score": 3
    },
    {
      "id": "m72o280",
      "body": "Proud of you for this!!",
      "created_utc": 1736847609.0,
      "score": 3
    },
    {
      "id": "m7we1as",
      "body": "So glad you made it out safely",
      "created_utc": 1737248469.0,
      "score": 1
    },
    {
      "id": "m7wr0z8",
      "body": "I was hoping he had died a horrible painful death",
      "created_utc": 1737252844.0,
      "score": 1
    },
    {
      "id": "m6zty6j",
      "body": "Have you managed to get therapy? You mention in another comment only your husband knows so I'm thinking you haven't had any yet or not disclosed it. I highly recommend getting into therapy. It's SO f*CK UP what he and your mother allowed/did!!! What did your other relatives say? \n\nI've not felt so angry reading a post before. I'm so sorry this happened to you. Sending you hugs 🫂",
      "created_utc": 1736805987.0,
      "score": 77
    },
    {
      "id": "m711n7w",
      "body": "It's almost like Munchausen by Proxy, except the end goal is the psychological torture of the victim rather than getting attention from outsiders. I'm so sorry for what you both went through; it's such an awful form of abuse.",
      "created_utc": 1736820228.0,
      "score": 52
    },
    {
      "id": "m72cw22",
      "body": "there definitely needs to be a support group. idk that my “parents” did anything this cruel, although I wouldn’t put it past them or my brain that has blocked out most of the years with them. I am however raising their other child (my sister) because our mom wasn’t  capable and our dad just doesn’t give a shit about anything other than himself. i’m so glad you both got out too!",
      "created_utc": 1736840324.0,
      "score": 10
    },
    {
      "id": "m76jaqa",
      "body": "Both sets of parents should be imprisoned",
      "created_utc": 1736896349.0,
      "score": 5
    },
    {
      "id": "m708xcn",
      "body": "Don’t insult Scum.",
      "created_utc": 1736810720.0,
      "score": 30
    },
    {
      "id": "m72dc9a",
      "body": "Also: “betrayal trauma”. It gets lumped in a lot with infidelity recovery, but its most basic definition is trauma perpetuated by someone(s) the survivor is dependent on for survival. \n\nI started working with a therapist who specialized in betrayal trauma in fall of 2019. I found her after a lengthy online search. cPTSD is still not an official DSM diagnosis (yet), but it’s real and getting more and more recognition. She was a “betrayal trauma” and cPTSD researcher. \n\nChronic mistreatment by the people who are supposed to keep you safe creates cPTSD and betrayal trauma and affects…everything. \n\nThe recovery is long and not without very real challenges, but OP I read other comments that confirm you are living proof that there can be a new story on the other side of this type of abuse. There can be joy and hope and a different future. \n\nI wanted to add the betrayal trauma concept because I saw the comment about your stepdad now being (or seeming) like a reformed father to his bio-daughters and that it further complicates your experience of his abuse and trying to maybe make sense of things. I think this is really common with betrayal trauma and covert parental abuse. \n\nTL; DR: Thank you for telling the truth about the abuse you survived. That’s not easy to do. Not everyone will understand (griefy), but there will be people who do (different flavor of grief). All my best to you on your recovery journey. \n\nAnd congratulations on your twins <333",
      "created_utc": 1736840598.0,
      "score": 11
    },
    {
      "id": "m6xe817",
      "body": "He’s obviously a sociopath and wasn’t at all bothered by tormenting a child. I doubt he even thinks about what he did now.",
      "created_utc": 1736780086.0,
      "score": 285
    },
    {
      "id": "m6zarjg",
      "body": "he's clearly an evil person, physical retribution is the only way he'll truly suffer",
      "created_utc": 1736800393.0,
      "score": 23
    },
    {
      "id": "m6x86a2",
      "body": "may I ask, how did the father of the child you thought you were having respond to everything?",
      "created_utc": 1736777949.0,
      "score": 185
    },
    {
      "id": "m6x88f8",
      "body": "For me you totally fit into the category, you had symptoms of pregnancy and more importantly you started to think of a life with this baby, you've also started to love the baby.\nI think you went through what all these women also went through, which is the loss of someone who was never here.",
      "created_utc": 1736777970.0,
      "score": 125
    },
    {
      "id": "m6y2lj5",
      "body": "Good on you, just keep on growing. Don't let your past hold you back.\n\nGood luck!",
      "created_utc": 1736787580.0,
      "score": 20
    },
    {
      "id": "m6xfgqn",
      "body": "Has he offered to make amends for how he treated you?  I know you're NC, but since you know now he's doing better for your step siblings, I thought there's still some avenue of possibility for contact. If he did AA or NA to get clean, he should have tried to make amends. \n\nNot that you have to forgive him or even accept any apology. But it is telling if he hasn't acknowledged that what he did traumatized you. \n\nI still think you could talk to a therapist or consider a grief support group. You thought you were pregnant. The fact you had a false pregnancy means it was real to you. Your feelings were very much like someone who had a miscarriage. I've never had one, so I can't speak to that specifically, but as a compassionate human being, I feel like you effectively are the same as someone who had a physical miscarriage. If any therapist or support group treats you otherwise, they're just not the right fit.\n\nAlso, consider just trying to get help dealing with all of your emotional trauma from growing up with emotionally abusive people. That I do have experience with and I know how it can have a lifetime impact. \n\nSounds like your husband is a good person, at least, and you have a better life now.",
      "created_utc": 1736780499.0,
      "score": 23
    },
    {
      "id": "m6xaq3p",
      "body": "I pray that you get counseling for this horrible abuse and betrayal.  It doesn’t matter that it’s been so many years.  This requires a professional to unpack.",
      "created_utc": 1736778871.0,
      "score": 13
    },
    {
      "id": "m72xkbz",
      "body": "My dad finally relented and I did not marry him. This whole situation caused too much damage to our relationship. We dated for a year after that and then the guy cheated on me and got another girl pregnant (thank god we weren’t married). I did go to college and move out because I realized they couldn’t just pull me out of college the way they said they did.",
      "created_utc": 1736853533.0,
      "score": 10
    },
    {
      "id": "m746328",
      "body": "I'm so sorry for your loss. The mind truly does protect us when we need it. I created worlds in my head to escape to during childhood, I still visit them but it's more for discovery and less for survival. \n\nThere is no need to let go of things that help us. I'm learning that coping mechanisms like you describe (and mine) are very sane and very common. \n\nI vaguely remember having an imaginary friend growing up but I think I hid them so they would be safe and just never found them again. It's strange to miss someone that wasn't real in the sense you and I are, but was very much part of my life.",
      "created_utc": 1736870718.0,
      "score": 2
    },
    {
      "id": "m6xdj7u",
      "body": "💔 glad you reconnected before he passed.  Your kids are lucky to have you (and vice versa).  The universe was looking out for you giving you twins!  Love that part of the story.  You're a survivor girlfriend!",
      "created_utc": 1736779855.0,
      "score": 19
    },
    {
      "id": "m9vw7vq",
      "body": "Girl I’m sorry that this happened to u but that man wasn’t good to u at all and if u we’re precious to him he wouldn’t have done that to u at all cause that’s just abuse",
      "created_utc": 1738182483.0,
      "score": 1
    },
    {
      "id": "m737s2h",
      "body": "The ability to file suit would depend on her age and the statute of limitations in her jurisdiction. That can vary widely and there are often exceptions made for child victims that provide extra time to file. (Thanks to laws written as a result of the Catholic sex abuse scandal.)",
      "created_utc": 1736858668.0,
      "score": 4
    },
    {
      "id": "m72jr50",
      "body": "lol ok you got me there, I'm still learning Reddit so I suppose this could be under SEVERAL other threads.  Well said bud. :D",
      "created_utc": 1736844715.0,
      "score": 1
    },
    {
      "id": "m74iucy",
      "body": "No way. I don't buy it. All she would have had to do was get a test or go to a doc. You can get a test at 711. Too much doesn't add up.",
      "created_utc": 1736874507.0,
      "score": 1
    },
    {
      "id": "m6xf024",
      "body": "That's great. He sounded super toxic.",
      "created_utc": 1736780343.0,
      "score": 4
    },
    {
      "id": "m6x43r0",
      "body": "Oh absolutely, that's a big ✅",
      "created_utc": 1736776429.0,
      "score": 2561
    },
    {
      "id": "m6x4a34",
      "body": "“Kids? What kids? Oh, I lied about that. Who are the baby clothes for? What baby clothes? You must be lying again.”",
      "created_utc": 1736776495.0,
      "score": 371
    },
    {
      "id": "m6x701x",
      "body": "i was my biological mother and father's only child. It was lonely growing up, but I take comfort knowing there's not another person walking around fucked up the way I specifically am",
      "created_utc": 1736777519.0,
      "score": 404
    },
    {
      "id": "m71wugr",
      "body": "I agree! Also, I can't pull specific details from my brain right now, but I know I've heard/read about cases where a person  has such a along desire for a pregnancy, or been lied to convincingly/got the wrong test results, and the brain actually tricks the body into thinking it pregnant and acting accordingly. Psychosomatic pregnancy, basically. I also saw it happen to my horse, which sounds crazy, but we all, including the vet, thought she was pregnant until about 2/3 through. \n\n\nOP, you *technically* didn't have a miscarriage physically, but it's highly possible you did go through similar changes in your hormones and body, and it's 1,000% true that you experienced a mental miscarriage. I think you would definitely benefit from talking to someone about it. \n\n\nDo not be hard on yourself and give yourself some grace. Your stepfather intentionally deceived you in order to hurt you, damage your reputation, and cause you emotional pain and distress. Perceived loss is STILL loss. You went through something hugely traumatic. And then, your mother betrayed about as badly as is possible, twice. Once by not standing up for you and protecting you. Again, by completely dismissing your feelings. This is major. Please, *do NOT* be ashamed of your feelings or think what you suffered is somehow less awful because of the circumstances.",
      "created_utc": 1736831595.0,
      "score": 26
    },
    {
      "id": "m6yz5ej",
      "body": "Now I’m imagining her telling a therapist with 4 years of experience. “Oh god they said not to worry about this until 5 years of experience. Holy fuck I can’t deal with this.”",
      "created_utc": 1736797005.0,
      "score": 124
    },
    {
      "id": "m6xnqtf",
      "body": "If he does think back to it, it’s a nostalgic and fond memory like “hey remember that joke I played on op? Classic” he chuckles at.",
      "created_utc": 1736783148.0,
      "score": 134
    },
    {
      "id": "m6x8k2d",
      "body": "This is the worst part. \n\nAfter it came out that I wasn't pregnant that whole time, he spiraled into addiction and committed suicide 3 years later",
      "created_utc": 1736778087.0,
      "score": 634
    },
    {
      "id": "m6x8q7f",
      "body": "Unfortunately there are no support groups, only articles 😔",
      "created_utc": 1736778148.0,
      "score": 58
    },
    {
      "id": "m735emg",
      "body": "Good I am glad you got away",
      "created_utc": 1736857586.0,
      "score": 7
    },
    {
      "id": "m860tb9",
      "body": "I assume you are now LC or NC?",
      "created_utc": 1737384568.0,
      "score": 1
    },
    {
      "id": "m7vrmo2",
      "body": "How would she be able to do either of those things with such controlling adults in her life? You're making a lot of unreasonable assumptions about her situation, and you have no good reason to do so. Trying to retraumatise someone because you don't want to believe them is abusive too. I hope you don't have children, you need to do a LOT of growing up before that! ",
      "created_utc": 1737241281.0,
      "score": 0
    },
    {
      "id": "m6xxnx7",
      "body": "It's not often I am this angry any more but fuck do I want their names and addresses to ruin their lives. This is absolutely depraved, I'm so so so so so sorry.\n\n\nYour last paragraph is beautiful and I hope your life is as happy and peaceful as you want.",
      "created_utc": 1736786141.0,
      "score": 1048
    },
    {
      "id": "m7172gb",
      "body": "I am really sorry that this happened to you. I was a teacher and if there is anything I cannot stand, it is cruelty to children. I also cannot bear cruelty to animals and the elderly. In fact, let’s face it - all cruelty is appalling. What that hideous creature did to you is the worst act of mental cruelty I have ever heard of. Please look into taking legal action against him.",
      "created_utc": 1736821963.0,
      "score": 27
    },
    {
      "id": "m718389",
      "body": "I can relate so much to this. I'd have loved to have someone to be with me as a child, standing up against my abusive mother, but now as a grownup I think the price for this would have been too high. \n\nI'm sending you hugs.",
      "created_utc": 1736822285.0,
      "score": 8
    },
    {
      "id": "m72zyak",
      "body": "As an only who went through hell with my dad, this statement hit me hard because I have always felt the same way.",
      "created_utc": 1736854873.0,
      "score": 2
    },
    {
      "id": "m7ssia4",
      "body": "Is your bio dad still in your life?\nHow old are you now? Best of luck to you, I can't even imagine what that awful man and your own mom put you through. Lots of love to you and those babies.",
      "created_utc": 1737207436.0,
      "score": 1
    },
    {
      "id": "m748yw6",
      "body": "I have ptsd from a miscarriage, and when I get bad triggers, I get cramps so bad that I actually have some spotting. \n\nThankfully, that’s very rare these days as I’ve been in trauma therapy and have healed significantly. EMDR is a blessing. \n\nBut, all that to say, I would not at all be surprised about someone having psychosomatic pregnancy. If I end up spotting just because of a flashback, I’m sure there’s got to be some sort of physical effects to believing so thoroughly that you’re pregnant",
      "created_utc": 1736871593.0,
      "score": 7
    },
    {
      "id": "m6zj3c9",
      "body": "Honestly good advice though. It was so awkward when my therapist sobbed when I told her my story and I was 14 years old comforting her.",
      "created_utc": 1736802811.0,
      "score": 78
    },
    {
      "id": "m718hsp",
      "body": "🤣🤣🤣\n\nHonestly, most of us hear so many horror stories about what can happen to people during our time at uni, that we have our perfect game faces from day one. \n\nBut I assumed no one would truly believe that. And of course, if you get a patient that has actually been tortured your first week you might be a bit wobbly. So I said five years since I figured that makes sense and would make everyone feel safe. \n\nAt the start, all therapists are way more focused on doing and saying things right anyway. It’s usually not until a few hours afterwords the actual experiences of the patients sinks in. Yep, we are human too.",
      "created_utc": 1736822408.0,
      "score": 3
    },
    {
      "id": "m6x9dkl",
      "body": "playing with your emotions and body like that was one thing, but causing a young man to commit suicide? I honestly hope that evil pos reaps everything he has sown. what did your step father do when he was told the young man died?",
      "created_utc": 1736778384.0,
      "score": 366
    },
    {
      "id": "m6xm77u",
      "body": "This is so sad. Seeing the damage that was done all because it was “funny” at the time. 😡",
      "created_utc": 1736782676.0,
      "score": 62
    },
    {
      "id": "m6x9phs",
      "body": "that's horrible i'm so sorry. i'm glad you are NC with your parents. i hope you have found a good support system to surround yourself with now",
      "created_utc": 1736778503.0,
      "score": 50
    },
    {
      "id": "m6z30lq",
      "body": "What the fuck? Did his parents ever say anything to yours??",
      "created_utc": 1736798120.0,
      "score": 29
    },
    {
      "id": "m714pv3",
      "body": "Jesus Christ this is so messed up",
      "created_utc": 1736821223.0,
      "score": 10
    },
    {
      "id": "m74aqvs",
      "body": "Not only did he forever traumatize his daughter, the man couldn't even think for a second how he'd ruin another boy's life. What depraved, actual scum",
      "created_utc": 1736872121.0,
      "score": 9
    },
    {
      "id": "m86w7ya",
      "body": "Jesus:(",
      "created_utc": 1737393596.0,
      "score": 1
    },
    {
      "id": "m9tfoa2",
      "body": "And your monster of a mother and stepfather had no guilt? Shame on them",
      "created_utc": 1738156845.0,
      "score": 1
    },
    {
      "id": "m6xduir",
      "body": "My bad, I really thought there would be something like that on Facebook or even reddit but I guess you can't finf everything even on the Internet",
      "created_utc": 1736779961.0,
      "score": 41
    },
    {
      "id": "m86oam6",
      "body": "LC. I still talk and visit my mom which means I have to see him. I can’t leave my mom all alone. She is so brainwashed from years of his abuse. Me and my sister have hope that one day she will leave him if we keep trying. She deserves so much better.",
      "created_utc": 1737391416.0,
      "score": 2
    },
    {
      "id": "m7wpfqa",
      "body": "You're making a lot of unreasonable assumptions about her situation, and you have no good reason to do so\n\nso are u",
      "created_utc": 1737252304.0,
      "score": 1
    },
    {
      "id": "m7wpn5l",
      "body": "Your name is presumptuous Pauline",
      "created_utc": 1737252375.0,
      "score": 1
    },
    {
      "id": "m7wpvga",
      "body": "There you go, calling random strangers abusive again. When will you ever learn Pauline?",
      "created_utc": 1737252457.0,
      "score": 1
    },
    {
      "id": "m6z4i1m",
      "body": "Hard same. Depraved is the only word for it.",
      "created_utc": 1736798551.0,
      "score": 257
    },
    {
      "id": "m6zq971",
      "body": "I don’t think I’ve ever wanted to punch someone so badly as this awful cruel stepdad.",
      "created_utc": 1736804897.0,
      "score": 96
    },
    {
      "id": "m716bcr",
      "body": "Ikr? I am an older lady and am disabled but I want to rip that horrendous man to shreds. I thought that the worst I had seen was when a pupil of mine turned up at school one morning with all of her long hair shaved off. She was completely bald. She had her poor head down and couldn’t meet anyone’s eye, not even mine and tbh I was known as a really kind teacher. I did of course ask her what had happened and she told me that her father had done it to teach her a lesson because she had been “cheeky” to him. That little girl was only 11 years old. I was furious then and I am furious now.",
      "created_utc": 1736821722.0,
      "score": 60
    },
    {
      "id": "m719611",
      "body": "Yikes. That should NEVER happen! EVER! I know it’s probably years too late, but I hope that you know that if your country has any sort of licensing board, this could have been reported at the time. And should have. You were 14 so of course you didn’t know that. But if someone ever tells you they just been through the same, tell them to report it. That behaviour is wrong on all levels and should not happen even if it’s the therapists very first day!",
      "created_utc": 1736822621.0,
      "score": 27
    },
    {
      "id": "m716jyx",
      "body": "Idk what happened to you but I want you to know that I, a random Reddit stranger, is so incredibly sorry for whatever it is you endured. I am angry that there wasn’t someone to protect little you. I’m sending you so much peace, all of my love and huge, warm bear hugs. ✌🏼❤️",
      "created_utc": 1736821798.0,
      "score": 8
    },
    {
      "id": "m6x9glp",
      "body": "We were no longer in contact at that point",
      "created_utc": 1736778415.0,
      "score": 318
    },
    {
      "id": "m6xg41p",
      "body": "I'd imagine people might be embarrassed to join the groups. And i guess the whole point of pseudocyesis is that you don't believe you have it so why would you join a group for it. I just need therapy ig",
      "created_utc": 1736780718.0,
      "score": 50
    },
    {
      "id": "m6z84tm",
      "body": "Yep same.\nThis if absolutely horrible in ways I can't put to words, and I don't even want a child!\nBut whether she wanted one or no, she mentally prepared for one, and suddenly got the whool pulled out under her feet. \nThis is the stuff of nightmare and trauma for years to come....\nThankfully she NC with those \"parents\"",
      "created_utc": 1736799626.0,
      "score": 123
    },
    {
      "id": "m7vw6bx",
      "body": "Oh my gosh! That’s awful! Wow that father was horrible. That poor girl. That’s abuse.",
      "created_utc": 1737242773.0,
      "score": 2
    },
    {
      "id": "m72eygf",
      "body": "Why is it so wrong for a therapist to cry during a session? Obviously the patient's thoughts and feelings should be the focus but I don't get why this is such a professional failing",
      "created_utc": 1736841594.0,
      "score": 4
    },
    {
      "id": "m6x9ivy",
      "body": "I’m so happy you got out",
      "created_utc": 1736778437.0,
      "score": 140
    },
    {
      "id": "m6z5o02",
      "body": "May I ask how his parents responded if they found out your SF lied?",
      "created_utc": 1736798896.0,
      "score": 58
    },
    {
      "id": "m6zvgo5",
      "body": "This might qualify as light weight murder, right? I'm not in a position to know this for sure so I could be wrong but.... He basically killed someone and manipulated and tortured his step daughter.\n\nI mean.... I know in Ohio, US, they have a ten year time frame from when trauma memories that were repressed resurface. At least they did. Not sure about now. But if OP got professional help and then took that assessment to a lawyer maybe....? Idk. It just seems like this is so extreme that is can't be legal, right? Maybe some places but.... Wouldn't it be child abuse at a minimum?\n\nCould someone out there with more experience maybe chime in?",
      "created_utc": 1736806447.0,
      "score": 45
    },
    {
      "id": "m6xhno7",
      "body": "Yeah, therapy seems like a good idea, especially with the kind of adults you had in your life.\nI hope you're happy now without them in your life!",
      "created_utc": 1736781229.0,
      "score": 28
    },
    {
      "id": "m6zhbvc",
      "body": "Oh shit you never got therapy?????? Girl get you some therapyyyyy",
      "created_utc": 1736802302.0,
      "score": 10
    },
    {
      "id": "m6y6nw3",
      "body": "I want to create one. My experience isn't exactly the same as yours, but I was in an extremely abusive relationship, while also dealing with the pressure of being in a narcissist family structure as the scapegoat and an equally toxic 'friend group' that dropped me for my abusive ex.",
      "created_utc": 1736788770.0,
      "score": 12
    },
    {
      "id": "m6zj9hy",
      "body": "It’s like she miscarried without the actual miscarriage. To know that was all a lie and laughed off by the parent that did it… that’s some intense trauma. I’m so angry for OP, and I want to go back in time to comfort them. I’m going to be thinking about this for a long time.",
      "created_utc": 1736802859.0,
      "score": 142
    },
    {
      "id": "m7zut3n",
      "body": "It most certainly is abuse. I took it to our head of child protection and she said that she didn’t want to make a case of it because she didn’t want the school to be seen as interfering in “their culture…” Bollocks.",
      "created_utc": 1737301499.0,
      "score": 1
    },
    {
      "id": "m72qsha",
      "body": "The whole point of therapy is for the therapist to work with the client on their feelings, sorting out how’s the best way to help them overcome their trauma and be a safe space for the person to vent their feelings and life story. No client should feel like they have to comfort their therapist (the therapist can be emotional after when they are alone). Often clients go to therapists, instead of their friends and close ones, because they don’t want to deal with other people’s emotions when they are struggling with theirs.",
      "created_utc": 1736849395.0,
      "score": 10
    },
    {
      "id": "m72sypb",
      "body": "I agree with the other bloke who replied.\n\nI also want to add is that one of the main services you supply as a therapist is the container function. You listen to emotional stories and CONTAIN them. You can get slightly glassy eyed when it is a patient you know well, but basically this is about modelling. You show them that their stories might be horrible, but they can be managed. \n\nIf I as a therapist feels awful just HEARING about this, that means that you should…basically give up, right? Because this is too horrible to handle.\n\nNO! I can manage this. So YOU can learn! \n\nBut we can show emotions. But only vague ones. And only when we actually think that is good for the patient. This is all about them. In that room I am a therapist. I am not a person, I do not count. It’s all for them.",
      "created_utc": 1736850777.0,
      "score": 12
    },
    {
      "id": "mogl0xp",
      "body": "It isn’t wrong for a therapist to cry in theory. A therapist is human and it would be normal to shed a few tears when someone shares something deeply upsetting. However, it should never be to the point where the patient feels they have to comfort the therapist. A few tears in empathy is understandable, breaking down and needing comfort from a patient is not",
      "created_utc": 1745341304.0,
      "score": 1
    },
    {
      "id": "m7vp7gc",
      "body": "More likely to be manslaughter, if you have that charge in the US. ",
      "created_utc": 1737240482.0,
      "score": 3
    },
    {
      "id": "m7wp8ch",
      "body": "There is precedent in the US for people facing criminal charges for bullying and abuse that led to a person's suicide, but unfortunately, it would probably be very difficult to establish beyond a reasonable doubt that OP's stepfather's deception was the proximate cause of the young man's death, given that it happened three years afterwards. His family might have had some luck seeking civil damages, though, since the standard of proof is lower in civil court.",
      "created_utc": 1737252235.0,
      "score": 1
    },
    {
      "id": "m75zkuh",
      "body": "Thank you for being a good therapist.",
      "created_utc": 1736890331.0,
      "score": 1
    },
    {
      "id": "m7w58jl",
      "body": "there is manslaughter in the US but I’m not sure what the statutes/requirements are in each state and my legal experience is literally just watching Law & Order since before I had eyes 🫠 IANAL",
      "created_utc": 1737245587.0,
      "score": 2
    }
  ]
}