{
  "id": "1fan4x4",
  "title": "UPDATE II: I think my husband fathered his best friend's children, and now one of them is attracted to my daughter. ",
  "selftext": "(You can find the original posts on my account page, Reddit won't let me link them.)\n\n\n\nI didn’t expect to have another update so quickly, but after posting my first update I did a lot of thinking about my kids. I ultimately decided that whatever else happened, I needed to warn Sophie about the situation, and do so immediately. To hell with Luke and whatever that meant for him. To hell if that meant all of the kids learned of the situation. She needed to be aware of what she might be getting herself into. \n\n\n\nSo I discreetly kept her out of school. We went back home, to our home, last night, and this morning, I dropped everyone off and saved Sophie for last, before driving right past her school and telling her that we needed to talk. Always a frightening thing for a teenager to hear from a parent, but I was quick to establish that she was not in trouble, but she needed to know the truth about why Amy and I were fighting, why her dating Tom was out of the question. I very gently explained that because of Luke’s closeness to Amy and Tom’s resemblance to him, I had come to suspect that perhaps Luke and Amy were intimate at some point over the years. If that was true, and there was any chance Tom’s father was actually Luke, that would be a significant problem. \n\n\n\nSophie was quiet during all of this, and even after I had stopped talking to let her respond, she paused for quite a while, before she finally said that we needed to get Tom and discuss this with him as well. I had no objections, so she texted him to meet with us. They’re both skipping school today, but Sophie gets straight As and this is extremely important, so I looked the other way. Tom came to meet us, and Sophie had me relay what I told her to him as well. I apologized to him for any indication I might have given that I didn’t think he was “good enough” for my daughter, and to both of them for not telling the truth sooner. \n\n\n\nTom and Sophie just gave each other this oddly knowing stare.\n\n\n\nAnd, Reddit, that’s when they blew my mind. \n\n\n\nSophie spoke first, with Tom backing her up. They revealed to me that in fact, they had already known about Luke and Amy, or at least they had strongly suspected. Apparently Tom has overheard conversations that are…questionable. As well as overhearing the sounds of sex from Amy’s room, sounds he would just as soon forget, but all signs point to Amy’s lover having been Luke. Tom had wondered for a very long time, and back in January, he finally voiced his fears to Sophie. She agreed with them. She could also see a strange sort of closeness between her father and his mother. They agreed that Luke was likely having an affair. They agreed that, because of Kaylee’s allergy, Luke might very well be her father. And if Kaylee was Luke’s daughter, the rest of Tom’s siblings could be Luke’s as well. Tom could be Luke’s kid himself. The math led them to the same places as me. \n\n\n\nSo Sophie and Tom came up with a little plan. As it turns out, they are not in love! They never were. They’re still just best friends. But they had the same instinct as me, that they didn’t want to blow up our entire family and social unit without more direct evidence (which Tom has been working on acquiring) and though Sophie very badly wanted to tell me the truth, she was hesitant because she knew it would shatter me. She had no idea I was already suffering in silence. Sophie apologized for not voicing her suspicions sooner. Honestly, we both cried, and I made sure she understood that none of this was her fault, and that I loved her very much. \n\n\n\nSo, the bottom line is, Sophie and Tom already know they could be half-siblings and aren’t actually interested in being a couple. That was their idea for how to rock the boat. To force Luke and Amy to do something about the situation rather than just keep making a fool out of me. I also think it was Tom/Sophie’s way of punishing them for their affair. Teenagers can be vindictive. So they concocted this idea that they wanted to date. Every flirtation I’ve witnessed, every inappropriate touch - all staged, apparently, and for the benefit of Luke, Amy, or both. This was supposed to make them sweat and Sophie/Tom expected they would jump out of their seats to forbid it from happening. When I was the one who did instead, that kind of threw the kids for a loop. They couldn’t understand why I cared more than the actual cheaters. They began to suspect that maybe I knew. Tom confronting me that one time about “Why can’t I date Sophie” was him trying to gauge if I knew or not. \n\n\n\nMaybe I shouldn’t be surprised. Sophie and Tom have always been close friends and confided in each other. Maybe I should be a little more concerned at how sneaky they’ve been, but honestly I’m just so relieved they’re not dating. (Sure, they could be lying to throw off the scent, I guess, but they apparently already knew that they’re likely related, they didn’t blink at all when I told them.) We even had a bit of a laugh together when Tom mentioned how he had been “a little offended” that I was so against him dating my daughter before. I kind of jokingly asked him, “So you don’t think she’s gorgeous?” And Tom, bless his heart, shrugged it off. “She is. But so is my English Teacher, and I’m not asking her out either.” \n\n\n\nEither way, the question now is…where to go from here? We have to figure that out. I will say that it is such a relief to have told Sophie and I feel like an elephant has taken one of its feet off my chest. Having her in my corner, and Tom in my corner as well, means a lot to me, and even though I basically just got it absolutely confirmed that Luke is sleeping with Amy…I kind of already knew that anyway. So now it’s just a question of how to proceed. Tom has already volunteered to submit his DNA so I can compare it to Luke’s, and both he and Sophie advise me not to tell Luke and Amy when I do this, which I agree with. They’re both completely on my side, which means more to me than I can ever express to them. Tom has also been trying to set up a camera in Amy’s room to catch her and Luke in the act. Sophie told me flat out that I needed to divorce her Dad, and hearing that from my own daughter made it clearer than it’s ever been. She’s right. ",
  "created_utc": 1725649461.0,
  "score": 13259,
  "num_comments": 2193,
  "url": "https://www.reddit.com/r/offmychest/comments/1fan4x4/update_ii_i_think_my_husband_fathered_his_best/",
  "comments": [
    {
      "id": "llud5az",
      "body": "Okey doke. Tom and Sophie have to be sitting on the couch when Luke comes home and drop the bomb that Sophie is pregnant.\n\nOr, to say that they had the same thoughts and did their own DNA tests and SURPRISE! You ARE the father",
      "created_utc": 1725650874.0,
      "score": 7148
    },
    {
      "id": "lludx96",
      "body": "Was Tom home the night your husband stayed over to \"calm things down\" with Amy?",
      "created_utc": 1725651128.0,
      "score": 1158
    },
    {
      "id": "llugv3k",
      "body": "This is some Days of Our Reddit Lives shit.",
      "created_utc": 1725652077.0,
      "score": 1532
    },
    {
      "id": "llumwhp",
      "body": "I might be on the kids side of manipulation \nCause I think the best bet would be for you to give Sophie and Tom \"your blessing\" since Luke and Amy had \"reassured you so well\" and see what they do",
      "created_utc": 1725654006.0,
      "score": 799
    },
    {
      "id": "llud2bo",
      "body": "I don't even care if it's fictional or not, these updates have me hooked.",
      "created_utc": 1725650846.0,
      "score": 6581
    },
    {
      "id": "lludjjd",
      "body": "Or Sophie and Tom do the tests together to see. \n\nI’m kinda a fan of you telling Luke + Amy that you realized that you were wrong and honestly believe Tom is great for Sophie. You want her to be with someone who will treat her with respect and be her best friend. Let Tom + Sophie do the rest.",
      "created_utc": 1725651003.0,
      "score": 247
    },
    {
      "id": "llubfgc",
      "body": "So, Tom knew about the affair. He heard it happening. I'm glad you finally got the answers you needed. Just need to find out why he is having an affair and didn't just be with Amy instead. Why put you and your family through this. You need to find a good lawyer tomorrow. Interview a bunch of them so he can't use them. He cheated on you, had a second family then used your money to support said family. I'd take him for everything. Hopefully you live in an at fault state and can sue for alienation of affection.\n\nETA- I was right. Him leaving you the night of the argument was their goodbye fuck...they know the jig is up.",
      "created_utc": 1725650311.0,
      "score": 703
    },
    {
      "id": "llumbtg",
      "body": "Just have the two kids do the DNA. If they share a dad they will pop as siblings.",
      "created_utc": 1725653823.0,
      "score": 188
    },
    {
      "id": "lluz2ji",
      "body": "I had a feeling when she was so over the top “offended” about your suspicions that they were accidentally giving you the answer. Anyone who was innocent would have AT LEAST told you something about the father of the kids. Add in that your husband stayed the night with her and Tom heard them…they are both seriously garbage human beings. \n\nI’m not sure how they thought this would be able to stay hidden forever. I’m also puzzled how they don’t think this will negatively affect ALL the kids involved. Not one of those kids is going to be okay that A) their dad didn’t want to claim them as his kids and let them wonder who their dad was while he was in their faces this whole time or B) their dad cheated on their mom literally their entire lives and had the audacity to do it in everyone’s face. \n\nIn your shoes, OP, this is what I would do:\n\n- Do the DNA test in secret. When the results come back, show them to his parents BEFORE you talk to him or Amy. Let them in on what has happened so that they can know the unvarnished truth. \n\n- Orchestrate a get together with the two kids and you three adults. Casually tell Tom & Sophie that you’ve thought about it and you’ve realized that you have been over thinking their relationship. That Tom is a great guy and you’d be honored to have him date your daughter. \n\nIf you’re feeling really vindictive (which given the magnitude of their deceit and betrayal would be understandable) Tom and Sophie should look at each other and then Tom should say they’re so glad to hear you say that because they haven’t known how to tell you guys that Sophie is pregnant. \n\nThen, watch them scramble. Before they get too far, Tom can hand Luke the DNA results and ask Luke to explain why he has denied being his dad his whole life. Sophie can ask her dad how would he feel if his kids had in fact had sex and gotten pregnant because he was too selfish to say anything. \n\nDon’t let them gaslight you or make you feel bad for anything. Don’t accept any responsibility for their selfish actions. Tell them how disgusting it is that they not only had a secret relationship for so long but that they willingly deprived 4 kids of knowing who their dad is or all 8 kids knowing who their siblings are. That is despicable and they are scum. \n\nThen have your ILs come in from whatever room they were waiting in to tell Luke and Amy that they know everything and that MIL has suspected for a long time. Let those two feel blindside after blindside and be so shocked and discombobulated that they aren’t given enough time to get their stories straight. Take away their power to twist the narrative to his parents by preemptively bringing them the truth first.",
      "created_utc": 1725657989.0,
      "score": 172
    },
    {
      "id": "lluddif",
      "body": "If they both do an ancestry dna test, that can link them without having to go through doctors and getting permission.",
      "created_utc": 1725650949.0,
      "score": 296
    },
    {
      "id": "llujd10",
      "body": "Question: are you planning on divorcing him?\n\nIf so, wouldn’t it be better if you divorced him first for the infidelity and then asked Tom and Sophie to do the DNA test? If it turns out that he is the father, then he will be liable for child support. Not to be an AH but you need to worry about yourself and your children first. Make sure you get your alimony and child support before Amy is legally entitled to anything. \n\nI think you should talk to a lawyer about how all of that would work before you get any tests done. \n\nAt the end of the day, you know he cheated on you. That’s reason enough for divorce.",
      "created_utc": 1725652871.0,
      "score": 131
    },
    {
      "id": "llujr32",
      "body": "Can't wait for the next episode of Everyone Hates Luke and Amy",
      "created_utc": 1725652998.0,
      "score": 128
    },
    {
      "id": "lluebug",
      "body": "Yo…. Just test their DNA against each other!!!!!!!  Tf ? Why wait for Luke??? All you need is to see if THEY are related!! \n\nI can’t believe this update!!! I hope it’s at least a relief to not feel crazy anymore",
      "created_utc": 1725651258.0,
      "score": 291
    },
    {
      "id": "llud2rj",
      "body": "Girl, just get a divorce and take everything.  They have laughed at you throughout your entire relationship and your father-in-law knows it, listen to your daughter and get divorced, but like now!!!",
      "created_utc": 1725650851.0,
      "score": 180
    },
    {
      "id": "llub9n4",
      "body": "Go get the test done today between Tom and Sophie. Then pack your STBX husbands bags and kick him out. \n\nAt this point, you have been lied to and cheated on for a bare minimum of 18 years. He doesn´t deserve to share your bed even for one more day.",
      "created_utc": 1725650259.0,
      "score": 436
    },
    {
      "id": "llurndn",
      "body": "[removed]",
      "created_utc": 1725655546.0,
      "score": 75
    },
    {
      "id": "llu9xj3",
      "body": "Wow, those teens are incredibly self aware.",
      "created_utc": 1725649830.0,
      "score": 486
    },
    {
      "id": "llurrq1",
      "body": "Okay this has now officially become the most compelling story on the internet.  Like \"make it into a movie\" level.\n\nSince Tom and Sophie are now colleagues, you can DNA test them easily with a 23-and-me.",
      "created_utc": 1725655585.0,
      "score": 71
    },
    {
      "id": "llucb3j",
      "body": "What do the kids think about Luke and Amy? Are they mad?",
      "created_utc": 1725650598.0,
      "score": 66
    },
    {
      "id": "llwnjer",
      "body": "With situations like this, why don't the \"we're like siblings\" people just get together from the start? Why do all this and drag someone else into their shit? They obviously started sleeping together before his marriage so why not marry eachother?",
      "created_utc": 1725681212.0,
      "score": 60
    },
    {
      "id": "lludecl",
      "body": "So in addition to your MIL suspecting that Luke has been cheating on you all this time, your own children think so too.   That's what you need to say in any counseling session.   Go to \"counseling\" and tell the counselor that the only thing you are interested in is figuring out a co-parenting plan that will ensure that Amy will not be in your live in any form whatsoever.   She is not your friend and you will no longer tolerate being/having a third party in your marriage.\n\nIf the kids suspect it, they know that Amy and Luke are too enmeshed for Luke to ever be able to maintain a sustainable marriage with you.\n\nAlso, in front of the counselor, you should ask him why he got a vasectomy -- it was probably because he didn't want to risk having another child *with her*.",
      "created_utc": 1725650956.0,
      "score": 92
    },
    {
      "id": "lluffki",
      "body": "I hope Luke is loaded, because he’s about to pay out the nose for child support and alimony.",
      "created_utc": 1725651616.0,
      "score": 43
    },
    {
      "id": "llue8dt",
      "body": "I don't understand, if Luke is indeed the father of Amy's children, why didn't he leave you when Amy got pregnant for the first time? That would have been the \"right time\" to tell you the truth.",
      "created_utc": 1725651227.0,
      "score": 111
    },
    {
      "id": "llwobne",
      "body": "Get the concrete proof of the afair, get that money and run. The disrespect is unreal and the sadness you feel is palpable. Fuck Luke and fuck Amy, if there was any situation to go scorched  earth and ruin both of them, this is it. Sending you strength and a GOOD lawyer that works at a reasonable commission rate.",
      "created_utc": 1725681576.0,
      "score": 35
    },
    {
      "id": "llumc74",
      "body": "This update is encouraging, as you’ve made significant progress, but it’s disappointing to have Luke and Amy’s betrayal confirmed. Curious if Tom clarified if Luke actually sleeps on the couch when he stays over at Amy’s?",
      "created_utc": 1725653826.0,
      "score": 102
    },
    {
      "id": "lluaowr",
      "body": "I can't believe I saw this so quickly, it all sounds pretty insane and unbelievable but I'm glad that Sophie and Tom aren't actually at risk of incest. above all that's a huge win. I'm so sorry for everything you're going through but glad you have the kids on your side. ETA: definitely don't let Tom set up a camera in his mom's room, it's most likely illegal and having a sex tape of Luke and Amy sounds extremely disturbing for you and the kids... there has to be a better way to catch him. Like just doing a DNA test?",
      "created_utc": 1725650074.0,
      "score": 134
    },
    {
      "id": "llub52p",
      "body": "[removed]",
      "created_utc": 1725650217.0,
      "score": 690
    },
    {
      "id": "lludwds",
      "body": "I'm so invested in this even if it's not real. Just do the dna testttttt girl asap!",
      "created_utc": 1725651120.0,
      "score": 27
    },
    {
      "id": "llukqlo",
      "body": "This is what I came for. \n\nI’m not deleting Reddit for a while now.",
      "created_utc": 1725653316.0,
      "score": 27
    },
    {
      "id": "llukyzv",
      "body": "Question- in the first post you mention you make good money and Lukes parents are wealthy- so does Amy and Luke work?   Or are you bank rolling them along with Luke’s parents?",
      "created_utc": 1725653391.0,
      "score": 25
    },
    {
      "id": "llunvzu",
      "body": "Man, Tom and Sophie should sit everyone down and tell them she's pregnant with Tom's baby, and she's keeping it. Really hit this teen love affair home. Mom, you suppoort their \"love\" whats done is done. You were only against it because you thought they might be siblings, but since Amy and Luke swear they're not you don't need to worry about them being together anymore. Isn't it better to support their love. Then, after having them sweat, slap Luke with divorce papers after that fun",
      "created_utc": 1725654327.0,
      "score": 27
    },
    {
      "id": "llublvi",
      "body": "Now, go have an in depth talk with your MIL, ASAP! Tell her the kids know, what they’ve heard, everything…you have to get everyone in line before you go scorched earth on the cheaters. My God!",
      "created_utc": 1725650370.0,
      "score": 51
    },
    {
      "id": "llucudy",
      "body": "What a mess, but couldn’t the kids do a 23 and me test and find out they are siblings… if asked it’s because they heard Sophie and Tom in the bedroom. They suspected… they concocted the whole dating thing… so they ran with it. The kids obviously are not stupid. They wouldn’t need a dad to compare their genetics. \n\nThis sucks, good luck 🍀",
      "created_utc": 1725650774.0,
      "score": 23
    },
    {
      "id": "llue7dd",
      "body": "I think the more you update, the more my heart breaks. I'm glad you guys talked because you could've let your daughter go on thinking that her mother thinks it is okay to live with a man knowing that he was cheating with her best friend. \n\nI'm so sorry that Luke betrayed you in this way. He didn't have to involve you in his sick relationship with Amy. Now, you need to be strong for you and Sophie and the rest of your children. Amy and Luke have done some serious damage, and some you will uncover the more you live, so while you go through all this, keep your head up. Don't let them take any more of your dignity, pride, love, time, forgiveness, or any part of you. \n\nI promise you, you can do this. It will hurt like hell, but you won't die, you will want to, but you won't. You need any clever ideas, Hit me up. Nobody does revenge classier and better. Or if you just want to vent or talk. \n\nFor the DNA, you don't necessarily need Luke's. You can just use Sophie's. In case you can't stomach that man anymore and can't find a way to obtain his DNA. \n\nAmy was never your friend. You should start treating her as such. Take off the gloves.",
      "created_utc": 1725651218.0,
      "score": 21
    },
    {
      "id": "llugujx",
      "body": "OP, pack your husband’s bags, drop them off on Amy’s front porch and send him a picture and let him know that he can live with his second wife from now on because his first wife is done with him. \n\nYou should also tell his parents everything. No more gaslighting. Nothing. \n\nDo not listen to any excuses. He was living a double life and he did it under your nose the entire time.",
      "created_utc": 1725652073.0,
      "score": 24
    },
    {
      "id": "llujqd3",
      "body": "I smell a book deal in the future",
      "created_utc": 1725652991.0,
      "score": 20
    },
    {
      "id": "llwxgms",
      "body": "Let’s MFing go!!!\n\nI’m so happy for you OP! How does it feel to be validated? I’m glad that you connected with Sophie and Tom and shared the same suspicions and are allies in this situation. \n\nYou should be very proud of Sophie! She’s awesome and so smart! YOU raised her right! I’m so glad that she supports you divorcing Luke! I screamed when I read halfway through and I had to race home to read the rest. \n\nYou are so much more closer to getting definitive proof with the DNA tests. At this point, it’s very clear that Amy and Luke are together and Tom and his siblings are Luke’s kids. \n\nLuke is officially a scumbag! Him and Amy are fucking disgusting! Even tho Tom and Sophie were acting like they were interested in each other to provoke a response from Luke and Amy, they allowed it! They did not give AF about potential incest. Please tell your lawyer that they put the well-being and safety of Tom and Sophie to keep their affair hidden at the risk of incest which they would have allowed a crime to take place. You need to get full custody, Luke can’t be trusted with children. Luke clearly has poor judgement and not fit to be a safe and responsible parent. He had several years and opportunities to come clean but choose not to. You brought up your suspicions multiple time and when you confronted them they played in your face. \n\nI know this is a big revelation. You are still processing this while pretending things haven’t changed. Please get individual therapy and start to grey rock Luke. He doesn’t deserve anymore tears or love. The only consellation was that he gave you 4 beautiful children and that’s it. He was a horrible husband since the beginning and for however long before that when they started their affair. Everything he has done and said has been a lie. He was never the man you thought he was. \n\nI'm proud of you OP! Your strength and courage is inspiring. Ignore the criticism and childish names, you did not give consent to be in this situation. You did the best you could at the time. You are only guilty of is loving and trusting a man you thought was loyal to you. I know you will find a man that truly values you. (see thread)",
      "created_utc": 1725686330.0,
      "score": 22
    },
    {
      "id": "llyn2yn",
      "body": "Please update, I completely become obsessed with finding out the truth",
      "created_utc": 1725720576.0,
      "score": 20
    },
    {
      "id": "llz7jxp",
      "body": "That must be a huge weight off your heart.  \n\nKick him to the curb.  She can have him.  Divorce him. Keep the house and everything you can. Get it all. Take as long as you want to heal. \n\nThen find a boyfriend   And have a great life.  Living your best life is the absolute best revenge. (I know!)\n\nPs I would bet if he moves into her place - she will be  kicking him out after 6-8 months because he’s cheating again….. lol.  \n\nYou deserve better.",
      "created_utc": 1725727561.0,
      "score": 24
    },
    {
      "id": "lm3hs87",
      "body": "I just don't understand why Luke didn't just marry Amy if this is real.   And why would amy choose to have children with someone who married someone else rather than actually find her person.  \n\n\nDefinitely not ethical polyamory going on here ",
      "created_utc": 1725794571.0,
      "score": 20
    },
    {
      "id": "lluepkt",
      "body": "Sounds like one of these wacky Lifetime movies",
      "created_utc": 1725651382.0,
      "score": 18
    },
    {
      "id": "lluhgst",
      "body": "And now back to Days Of Our Lives, Starring; Luke, Sophie, Tom and Amy.",
      "created_utc": 1725652269.0,
      "score": 40
    },
    {
      "id": "lluqq2r",
      "body": "Were you married to Luke when Tom was born? I only ask because it really doesn’t make sense that he would get Amy pregnant then marry someone else. If a child was thrown into the mix, and he wasn’t yet married, it seems like he would not have pursued marriage with you but with her. The mother of his first child.\n\nIf they’ve been this close all along why would he include you into this mess at all? Currently, it is pretty obvious he has no respect for you as his wife or regard for your feelings. Amy is his priority now. If he felt that way all along why would he have married you?\n\nIs there a possibility Tom is not his son? That his affair with Amy did not start until after Tom was born? When whoever Tom’s father was abandoned Amy to be a single mom and Luke began stepping into that role of father for Tom by default as the closest man to her. He began parenting with her and their already very close relationship reached another level. Then they started an affair. Then they went on to have kids together.\n\nI only mention this because I think there may be a chance Tom and Sophie’s DNA might not match as siblings. However, the DNA of the rest of the children would match with Luke.  Luke and Amy haven’t been as firmly against Tom and Sophie being a couple as the OP. It might be because they know they’re not siblings. However, they have joined with the OP in expressing concern, because while those two are not blood related everyone else in the family is connected biologically. Which could feel uncomfortably close to incest for some people.\n\nThis may be one hundred percent speculation. However, I thought it worth mentioning. ",
      "created_utc": 1725655247.0,
      "score": 40
    },
    {
      "id": "llw57iu",
      "body": "Oh honey, you are carrying a heavy weight. I’m in awe at how poised and considerate you’ve been in the face of a complex situation. In your shoes, I’m not sure I’d handle this so gracefully.\n\nI hope you have some loved ones outside of this mess you can lean on. Have you reconnected with that friend who suspected this a few years back? Maybe they could be a resource for support, if you trust them with this. \n\nI’ve been thinking about your story a lot in the past few days. I hope you find some relief soon. Until then, your gut will continue to be your best ally.\n\nFrom a random person on the internet: I believe in you — you’ve got this.",
      "created_utc": 1725673533.0,
      "score": 39
    },
    {
      "id": "lluzs4p",
      "body": "Leave town for a weekend, announce it ahead of time. Say you're going to visit your friend or whatever. \nTake Tom and Sophie secretively. \nRig up wifi enabled hidden video cameras at both houses to record audio and video.\nHave Tom and Sophie send back a message that they both eloped and got married.\nLog into the wifi cameras and make some popcorn.",
      "created_utc": 1725658233.0,
      "score": 18
    },
    {
      "id": "lluavl3",
      "body": "I think you could easily back them into a corner to confess and you might want to try this approach before going down the DNA route if you lawyer already advised that could cause problems (I know toms given you his permission but he's a minor so not sure if that's as issue still) \nApologise to them..say it was just stress related and you're devastated you caused this rift. That your eyes are now open and you can't believe you could ever doubt them both.That you'd also had a separate heart to heart with Sophie and that her and tom are serious about each other and you see know reason why they shouldn't date (add on the proviso no alone time or something so it make it realistic so it doesn't seem you've completed flipped a switch...Obviously also get the kids in on the plan) Then sit back and wait and watch it  unfold",
      "created_utc": 1725650133.0,
      "score": 34
    },
    {
      "id": "llufprv",
      "body": "Dang I was still unsure if these were real or not but I feel this update gave away the creative writing aspect. Well done though, I'm still looking forward to updates either way, your writing is super entertaining and keeps me reading fast till the end.",
      "created_utc": 1725651707.0,
      "score": 61
    },
    {
      "id": "llv0llj",
      "body": "I no longer believe this to be real, but I kind of wanted it to be.\n\nMuch better than Bold and the Beautiful. OP needs to start writing books.",
      "created_utc": 1725658513.0,
      "score": 14
    },
    {
      "id": "llz3pgp",
      "body": "On a brighter note, I hope you see how much these children love you and would concoct such a wild plan to expose Luke and Amy to you. It’s honestly really bittersweet to see considering the situation but really shows how great of a mom you are. I know it’s probably frustrating for other people to see why you turned a blind eye, but it’s clear to see you love your children very much and want to protect them as much as you can. They most definitely see how much you love them and they love you just as much to go at such lengths. I wish you the best for you and your family in this situation.",
      "created_utc": 1725726299.0,
      "score": 16
    },
    {
      "id": "lm6z3oj",
      "body": "OP, I have been following your posts and comments since I came across them. My heart hurts for you SO much. You seem to be such a strong woman. I commend you for realizing that all of the children involved are innocent and you're not resentful of them. Sounds as if you have raised (and I'm talking about Amy's kids too) some intelligent children. I wish you the best with all of this, and will keep following from afar. Those children are lucky to have you in their lives. Luke and Amy both have some deep seated issues and I hate that you were subjected to such betrayal. We're rooting for you!!",
      "created_utc": 1725836402.0,
      "score": 15
    },
    {
      "id": "llud9w9",
      "body": "What a brilliant couple of kids. How much damage your husband and Amy have done to these kids is unbelievable. \nYour husband hopefully ex is the most disgusting person I have read about on here. I hope the children disown him I really do. Amy will be ecstatic when you divorce him. Make sure everyone knows and name her in the divorce. Kick that SOB out and tell his mum, because he dad already knows. Good luck in your divorce",
      "created_utc": 1725650916.0,
      "score": 14
    },
    {
      "id": "llvd3vo",
      "body": "OP should be hired to write a soap opera",
      "created_utc": 1725662891.0,
      "score": 14
    },
    {
      "id": "lm29d9v",
      "body": "Now if the test comes back positive which is very likely(SO SO SORRY) WHY didn’t Luke just married Amy in the first place WHYYYYYYYY",
      "created_utc": 1725767920.0,
      "score": 14
    },
    {
      "id": "llv81q8",
      "body": "I would watch this Netflix documentary.",
      "created_utc": 1725661074.0,
      "score": 13
    },
    {
      "id": "llue72z",
      "body": "Yeah, I suspected it with the first post but this one confirms this is fiction. \n\n\nReally good by the way! Please continue with the updates. Hopefully one day you will be able to sell a novel. \n\n\nNo sarcasm.",
      "created_utc": 1725651215.0,
      "score": 76
    },
    {
      "id": "lluajk7",
      "body": "Them running a covert op was not on my bingo card with being said the dna test would be a lot less damaging in court now that you have two willing participants and a 17 year affair with a second family is way more detrimental in court then you being “sneaky” I wish the best for you and I hope you find your truth sooner than later whatever it may be",
      "created_utc": 1725650026.0,
      "score": 84
    },
    {
      "id": "lluj9hr",
      "body": "Even not believing it's real I'm still hooked. Hope there's another update!",
      "created_utc": 1725652839.0,
      "score": 12
    },
    {
      "id": "llue4ie",
      "body": "This is better than an episode of Jerry Springer",
      "created_utc": 1725651192.0,
      "score": 25
    },
    {
      "id": "llulozj",
      "body": "Plot twist: we find out Luke & Amy were half siblings, and that is why the FIL was so adamant about how they could NEVER be intimate with each other",
      "created_utc": 1725653620.0,
      "score": 23
    },
    {
      "id": "lluen8i",
      "body": "Omg I called that in the previous update that they knew and were trying to get the truth. I’m glad you basically got confirmation on the affair, I just want to know why, why start a whole family with some else instead of the person you clearly want to be with. He is that selfish that he needed to ruin your life.",
      "created_utc": 1725651361.0,
      "score": 12
    },
    {
      "id": "llug146",
      "body": "Switch it around on Luke and Amy, say you're okay with the kids dating and see what happens. If Luke defies it then pry",
      "created_utc": 1725651809.0,
      "score": 10
    },
    {
      "id": "llughf1",
      "body": "I LOVE these two kids!!!!!   You raised an amazing daughter and I am so happy that you have some support- even if you aren’t their responsibility just knowing they have your back and you don’t have to worry about them dating has got to be a huge weight off your back!",
      "created_utc": 1725651955.0,
      "score": 12
    },
    {
      "id": "llx7xt4",
      "body": "I hope you get your kits quickly and your results back soon…I know they took a few weeks for my dna results to come back when I took them.",
      "created_utc": 1725692795.0,
      "score": 10
    },
    {
      "id": "lluc2g5",
      "body": "I'd call the lawyer first and discuss the DNA test. Because he's a minor there may be issues there, especially if used in court. It'd be better to do forced DNA tests through the court. I personally would go nuclear and tell him straight up you know and it's over. You don't deserve any of this. I can't even imagine having to deal with this and looking back at all the happy memories in a marriage and wondering when he was with her. Don't force yourself to play pretend and put up with him a moment more. Put your mental health first. Children are resilient and will cope and heal faster than you can imagine. It's time to put yourself first for once.",
      "created_utc": 1725650520.0,
      "score": 10
    },
    {
      "id": "llukclr",
      "body": "there's no way this is a real story but i'm so invested rn pls lmk when you publish a book or smth",
      "created_utc": 1725653190.0,
      "score": 9
    },
    {
      "id": "llveg85",
      "body": "This story is the best thing I’ve read on Reddit in awhile \nI can’t wait for the next installment!",
      "created_utc": 1725663375.0,
      "score": 9
    },
    {
      "id": "llw7mic",
      "body": "Now that you confronted them about the affair and they denied it, decide you were \"being paranoid\" and start siding with the teens about dating. Stage them going on dates and advocate for them since \"you were getting between them over nothing\"",
      "created_utc": 1725674497.0,
      "score": 9
    },
    {
      "id": "llugxux",
      "body": "Liz, you mad genius, what in the nutter butter mcfuckkkkkk?? I can’t help but love you. YOU ALMOST GET ME EVERYTIME!",
      "created_utc": 1725652101.0,
      "score": 16
    },
    {
      "id": "llujawg",
      "body": "Now that the kids are in on it,  they should  announce a pregnancy. When you hear that you have a change of heart,  realizing that you're not going to keep two people in love apart.",
      "created_utc": 1725652852.0,
      "score": 8
    },
    {
      "id": "llw3lkx",
      "body": "Damn OP, you're an amazing writer. Can't wait for this made up story to be resolved.",
      "created_utc": 1725672894.0,
      "score": 7
    },
    {
      "id": "llwdobt",
      "body": "Welp, *slaps knees*, I’ve had enough.",
      "created_utc": 1725676951.0,
      "score": 8
    },
    {
      "id": "llwpclu",
      "body": "Have you thought about “dropping” your objection to Sophie and Tom dating to see what Luke and Amy’s reaction would be?",
      "created_utc": 1725682064.0,
      "score": 7
    },
    {
      "id": "llz9890",
      "body": "Ask your lawyer the following. Technically Tom is still a minor. but he is a few months away from his 18th. Sometimes the law provides a little leeway making it legal for Tom to give consent to the DNA test before his 18th. \n\nIf that is the case, test Tom against Sophie. If it comes out as them being half-siblings, you have your answer.",
      "created_utc": 1725728114.0,
      "score": 8
    },
    {
      "id": "lluing6",
      "body": "OMHW! If this is a fantasy story, it's one extremely good one. However, I have always found, that the stranger the story, the more true it may very well be.",
      "created_utc": 1725652643.0,
      "score": 7
    },
    {
      "id": "lluy2sk",
      "body": "Real or not, well written. \nAlso this mofo is living two lives 100%. \nThis has happened in history as I had a relative with multiple lives at once(yes, it happens however this was well over 100 years ago).",
      "created_utc": 1725657652.0,
      "score": 6
    },
    {
      "id": "llvqakh",
      "body": "Like sands through the hourglass…",
      "created_utc": 1725667849.0,
      "score": 7
    },
    {
      "id": "llvxzrx",
      "body": "This writing exercise keeps getting more and more chapters!\n\nY’all are helping OP develop their novel - you should pat yourselves on the back!",
      "created_utc": 1725670718.0,
      "score": 8
    },
    {
      "id": "llvycla",
      "body": "Damn, these are good. You need to write for the CW channel, with all this drama!",
      "created_utc": 1725670855.0,
      "score": 7
    },
    {
      "id": "llvz3t5",
      "body": "I just feel like this is the story line of a book you are writing at this point. If this is in fact 100% real, holy shit OP, write the damn book.",
      "created_utc": 1725671153.0,
      "score": 7
    },
    {
      "id": "llwe13w",
      "body": "Bro, you should be a screenwriter or something. I’m hooked for more goofy soap operas.",
      "created_utc": 1725677096.0,
      "score": 8
    },
    {
      "id": "lm1tap4",
      "body": "We want the results!",
      "created_utc": 1725761081.0,
      "score": 7
    },
    {
      "id": "lluei7s",
      "body": "Tom and Sophie seems like great kids. I honestly would just divorce him, but i’m scandinavian and cheating doesn’t really affect the divorce here. \n\nI don’t really have any tips for you in this matter, but I hope tou get out of this marriage asap. I am so sorry for you and the fact that you’ve given your full heart to a man that’s been with another woman the whole time. He’s stolen at least 17 years from you, where you could’ve found someone who genuinely loves and cares for you. At least you got four wonderful children out of it❤️",
      "created_utc": 1725651316.0,
      "score": 5
    },
    {
      "id": "lmvlfpt",
      "body": "You could tell Amy that you will drop the cheating allegations as soon as she proves Luke didn't father her children. \n\nTerms include, you pick the clinic and test results get mailed to your house",
      "created_utc": 1726199273.0,
      "score": 6
    },
    {
      "id": "lly4pcu",
      "body": "Ok first of all, I apologize for the long response. I haven't been this invested in a reddit update in so long! Forgive me if my two cents is unwelcome. Noone but you can ever understand your situation, but we're on Reddit & Im bored so 🤷‍♀️:\n\nOP this is your real life so the scheming to 'trap/catch' Luke & Amy doesn't seem like a very productive use of your time, nor Tom & Sophie's. They're both young teenagers that should be focusing on teenager things! SATs, driver's licenses, post-high school plans, extracurriculars, tomorrow's lunch special etc.. They shouldn't be as invested in the dynamic between you, your husband, & Amy as they are. I understand they're not children. They literally witness the inappropriate or absent boundaries Amy & Luke have & the genetic similarities between all of the children.. in a YA novel sort of way, it's kinda cute that pretending to want to date each other was their solution to this complicated situation. But for you, as the one adult(!!) privy to Tom & Sophie's plan: \n\nIf it has gotten to the point that you, a 17y old, & your 15y old daughter have talked about their ideas to record explicit sexual acts between their parents (!!) without consent, or any recording without knowledge & consent, its gone too far. Full stop. This is wrong & you need to squash this thought train before it becomes reality. Clearly I, & many others, find your story fascinating, we're simply a third-party observing from our virtual sidelines. As a humble third-party I will reiterate.. you are the adult. \n\nOf course it's comforting to hear your suspicions are not unfounded & others close to you all have their doubts. You're only human! But you have a responsibility to still point the moral compass in the right direction for these kids. Like I said naturally theyre both invested in finding out the truth, but this isnt the way. You need to discuss all of this with Amy & Luke, just you 3. Then with your respective(?) children once you are all on the same page. \n\nHonestly, I want to ask whats after the \"gotcha\" moment? \n\nIf not true: can you move forward with Luke &/or Amy despite the obvious lack of trust in your relationships? Do you even want to? Would Tom & Sophie's scheme just be a hushed secret between you 3?? Could Luke or Amy forgive this? \n\nIf it is true: are you prepared to separate? Financially, emotionally, and physically? \n\nAgain, I'm word vomiting my thought train on a situation I haven't experienced first-hand. But if it was me performing mental gymnastics &  lamenting with teenagers over any issue regarding my partner, I would see no way back to \"normal.\" Regardless of the outcome, I would be getting my ducks in a row to leave. Im sorry you're in this position, genuinely. You should have never had to question their relationship in the first place, but hard reality is that: you are... so whats next?",
      "created_utc": 1725713316.0,
      "score": 18
    },
    {
      "id": "lluaoev",
      "body": "Thanks for keeping us in the loop. This is so messed up. Im sorry you're going through this and im glad the kids are so smart.",
      "created_utc": 1725650070.0,
      "score": 10
    },
    {
      "id": "llubo3r",
      "body": "I’m really sorry but he has so many questions!\n\nWhy did he marry you?\n\nIl Avais déjà tom when he got married he’s taller than Sophie?\n\nWhy be your friend when she’s fucking your husband?\n\nHow could they stay like that for so many years? He knew that sooner or later it would all come out!\n\nNow I think your father-in-law knows that’s why he’s always given money to Amy - no one supports a woman for so many years with nothing in return!\n\nNow it’s your turn to get revenge on Luke, but small revenge!\n\nDo it!\n\nKeep him from going to Amy’s just to piss him off \n\nIs starting divorce proceedings!",
      "created_utc": 1725650390.0,
      "score": 11
    },
    {
      "id": "llv4d4u",
      "body": "This can’t be real",
      "created_utc": 1725659796.0,
      "score": 11
    },
    {
      "id": "llw95m4",
      "body": "This is one of the biggest troll post ever and yall will just eat it up every time. This is so clearly trolling it’s insane",
      "created_utc": 1725675108.0,
      "score": 12
    },
    {
      "id": "llzdv4i",
      "body": "Idk if it’s just me, but I have a weird feeling that Luke’s dad could be the father of Amy’s children?? It would still explain the genetic similarities in both sets of kids and also explains how weirdly adamant he(Luke’s dad) was about nothing going on between them. Luke could also be aware of the affair which would explain their weird conversations.🤷🏼‍♀️I could be so far off base, but it would be an insane plot twist.",
      "created_utc": 1725729639.0,
      "score": 10
    },
    {
      "id": "llubypv",
      "body": "OMG! I hope you feel relieved even thought you have the pain of the years long betrayal. Please contact with your MIL after getting the dna results and have their support. I am sure they will back you up. \n\nI wish you have a smooth divorce and spend the rest of your life happy with your kids!",
      "created_utc": 1725650486.0,
      "score": 6
    },
    {
      "id": "llue55n",
      "body": "Well if any of this is true, I’m super proud of these smart kids. Not a bad plan honestly",
      "created_utc": 1725651198.0,
      "score": 6
    },
    {
      "id": "lluh6ll",
      "body": "I’m so glad you decided to talk to Sophie and Tom. It was absolutley the right call. Good luck to all of you.",
      "created_utc": 1725652179.0,
      "score": 4
    },
    {
      "id": "lluh9as",
      "body": "Why can’t Tom & Sophie take DNA tests to see if they are related? Wouldn’t that be easier? Hmm",
      "created_utc": 1725652202.0,
      "score": 5
    },
    {
      "id": "llujson",
      "body": "So have Tom and Sophie do an DNA test. Easiest way to confirm or deny your suspicions once and for all. Don't bother with cameras and all that other bullshit. You have all you need now.",
      "created_utc": 1725653013.0,
      "score": 5
    },
    {
      "id": "lluoo7u",
      "body": "TLC is absolutely eating up these updates",
      "created_utc": 1725654584.0,
      "score": 5
    },
    {
      "id": "lluzn4m",
      "body": "You need to blow these two decades-cheaters out of the water!!  Seriously, I would go scorched earth on the two of them.  All of the kids are old enough to understand what cheating is so it's about time those two had consequences for their actions.  I mean, they've played you for a fool for YEARS!!!\n\nThey weren't even TRYING to be discreet over at Amy's if the kids have heard them having sex FFS!!!  UGH!!! \n\nHe will leave you for her anyway and his parents (especially his father who KNOWS) will think this is just fine and support the two of them.",
      "created_utc": 1725658186.0,
      "score": 6
    },
    {
      "id": "llv39sv",
      "body": "A lot of people are pointing out that why didn’t the kids just do an ancestry test.  But here’s my thought on this:\n\nMaybe they weren’t as interested in the DNA issue.  Tom had heard noises and was pretty sure they were having an affair.  And honestly, I think they felt they already knew they were siblings.  I think they weren’t as focused on finding out if for sure if they were siblings, but were more interested in getting Amy or Luke to admit it.  Also, Sophie didn’t want to voice suspicions that would hurt her mom abs might not be believed, and wanted confirmation from Luke and Amy that would pressure them to tell OP the truth.  And when OP was the one most opposed to the “crush,” they probably then wondered if this was some arrangement that OP was in on somehow.\n\nI think the kids were more interested in learning the truth about the relationship than in the dna results.",
      "created_utc": 1725659424.0,
      "score": 6
    },
    {
      "id": "llveoo8",
      "body": "Can’t wait for tomorrow!!!! Or whenever the next update drops. Idc if it’s real or not. I’m here for it.",
      "created_utc": 1725663461.0,
      "score": 5
    },
    {
      "id": "llwdvdm",
      "body": "Thank you Reddit for continuing to keep me in the loop of this novella. OP, take Luke and Amy’s ass down!!",
      "created_utc": 1725677030.0,
      "score": 5
    },
    {
      "id": "llwfwci",
      "body": "I am so ashamed I believed this story. Should’ve stopped when you were ahead OP.",
      "created_utc": 1725677876.0,
      "score": 5
    },
    {
      "id": "llx946w",
      "body": "This whole 3-part saga reads so suspiciously like creative writing. Way too many writerly turns of phrase instead of getting to the point. You’re not seeking advice, you’re building drama. I know because I write for a living.",
      "created_utc": 1725693587.0,
      "score": 5
    },
    {
      "id": "llxos3d",
      "body": "My question is . . . Tom is 2 years older than Sophie. Why didn't Luck just marry Amy? Instead he put you through almost 20 years of heartache, lies, gaslighting, manipulation  . . .  All of it. \n\nANNNNDDD . . . . They were willing to risk Tom and Sophie being romantic to keep their secret. \n\nThey are terrible people!",
      "created_utc": 1725704571.0,
      "score": 5
    },
    {
      "id": "llygcx1",
      "body": "What is the allergy Kaylee has that keeps being brought up? I have not seen anything about what it might be (though i haven’t read all of the comments)",
      "created_utc": 1725718117.0,
      "score": 5
    },
    {
      "id": "llufi4o",
      "body": "Actually, that was something they had considered doing before. \n\nNow that the three of us are on the same page, it's not the worst idea.",
      "created_utc": 1725651638.0,
      "score": 4865
    },
    {
      "id": "llupjww",
      "body": "MAURY POVICH GET YOUR ASS IN HERE",
      "created_utc": 1725654867.0,
      "score": 138
    },
    {
      "id": "lluf0hj",
      "body": "But Sophie has been flirting with someone else and Tom wants a DNA test to confirm that he's the father.",
      "created_utc": 1725651481.0,
      "score": 96
    },
    {
      "id": "llugcny",
      "body": "Omg YESSSSSS!",
      "created_utc": 1725651913.0,
      "score": 12
    },
    {
      "id": "llufon0",
      "body": "Yes, and according to him, he heard...things. \n\nThat was a punch in the gut.",
      "created_utc": 1725651697.0,
      "score": 1469
    },
    {
      "id": "llvrwkb",
      "body": "I can't wait for the amnesia plotline!!!",
      "created_utc": 1725668464.0,
      "score": 237
    },
    {
      "id": "llukjmq",
      "body": "Like sands through the hourglass…",
      "created_utc": 1725653254.0,
      "score": 217
    },
    {
      "id": "llvy1oi",
      "body": "Am just amazed so many believe this garbage telenovela shit and are offering serious advice",
      "created_utc": 1725670739.0,
      "score": 196
    },
    {
      "id": "llvftjw",
      "body": "I expect Stefano to appear at some point.",
      "created_utc": 1725663874.0,
      "score": 30
    },
    {
      "id": "llunefp",
      "body": "We're considering that.",
      "created_utc": 1725654168.0,
      "score": 488
    },
    {
      "id": "llujkgk",
      "body": "I finally understand why my Granny used to watch those God awful drama shows. It's super fake, but damn if it isn't entertaining. These posts are just new age soaps",
      "created_utc": 1725652938.0,
      "score": 1001
    },
    {
      "id": "lluhy2f",
      "body": "Feels like one of those Lifetime series on the television lol",
      "created_utc": 1725652420.0,
      "score": 1489
    },
    {
      "id": "lluipvb",
      "body": "I know I'm getting invested here. Like, will they think k to do a 23&me? Or pull up their files at the doctors and see if their blood types are a certain type that would lead them to know they are actually half siblings?",
      "created_utc": 1725652666.0,
      "score": 263
    },
    {
      "id": "lluo5sb",
      "body": "Suggestion for the author of this definitely fictional story.\n\n\nAfter the DNA results are in, have Sophie and Tom fake a pregnancy and tell Amy and Luke about it. For fun. ",
      "created_utc": 1725654415.0,
      "score": 484
    },
    {
      "id": "lluiwwj",
      "body": "I love these episodes.",
      "created_utc": 1725652727.0,
      "score": 110
    },
    {
      "id": "lluts1t",
      "body": "Did… Did we become soap opera fans without knowing it?",
      "created_utc": 1725656228.0,
      "score": 101
    },
    {
      "id": "llulxzr",
      "body": "100%, when I saw there was an update I was sooooo excited!",
      "created_utc": 1725653699.0,
      "score": 74
    },
    {
      "id": "llupgf1",
      "body": "This is the most absurdly fictional story I've ever heard. There are so many things, but the fact that Amy has four kids, all with unknown fathers and no one in anyone's family blinks an eye is what gets me.",
      "created_utc": 1725654837.0,
      "score": 207
    },
    {
      "id": "lluit92",
      "body": "Me too. OP needs to do the DNA test ASAP. I need to know more.",
      "created_utc": 1725652695.0,
      "score": 88
    },
    {
      "id": "llunk80",
      "body": "Same here. I saw the update and my heart skipped a bit",
      "created_utc": 1725654220.0,
      "score": 28
    },
    {
      "id": "lluj5sj",
      "body": "Me too. Wow. And if I’m assuming this is real, OP even though I’m ‘hooked’ i am very sorry for you. This sucks for someone to go through.",
      "created_utc": 1725652806.0,
      "score": 72
    },
    {
      "id": "lluquc7",
      "body": "OMG me too. If it’s fake bring it on, I still need a conclusion!!! I almost hope it is as I love this lady too much for her to be disrespected like this!!!!",
      "created_utc": 1725655286.0,
      "score": 73
    },
    {
      "id": "llusm8u",
      "body": "I always say I don't watch and reality TV but I do eat up AITA on reddit.",
      "created_utc": 1725655855.0,
      "score": 37
    },
    {
      "id": "llup84t",
      "body": "It's based on a Law & Order SVU episode 🥱",
      "created_utc": 1725654762.0,
      "score": 39
    },
    {
      "id": "llulm1x",
      "body": "Lmao, it's fake for sure. Honestly, I just think it's kinda lame, but at least there isn't any trans hate or evil gender/racial stereotypes. \n\nThen again, I'm 45 years old. So I've seen this story a gazillion times. For all you youngins, it's probably riveting. \n\n\nAnyway, plot twist. These kids probably would have just gotten a 23 and me kit, but that's nowhere near as interesting. Lol.",
      "created_utc": 1725653594.0,
      "score": 75
    },
    {
      "id": "llusus2",
      "body": "As an avid reader I’m more invested in this then the lasted Nora Roberts trilogy. I really hope it is fake cuz this poor family.",
      "created_utc": 1725655931.0,
      "score": 15
    },
    {
      "id": "lluv10r",
      "body": "Absolutely. Great tale. Far out. So well told.\nI’m going to believe it.",
      "created_utc": 1725656638.0,
      "score": 7
    },
    {
      "id": "llv665r",
      "body": "It’s absolutely fictional but I’m invested 😂",
      "created_utc": 1725660414.0,
      "score": 7
    },
    {
      "id": "lluow3n",
      "body": "I really want to know what the food allergy is and if it’s truly rare because until they get a paternity test that’s the biggest link\n\nEdit to add: if you look at the timing of all the kids he is getting one of the women pregnant while the other is recovering from pregnancy and delivery. It’s borderline clockwork if you take into account recovery and when you shouldn’t be having sex etc.",
      "created_utc": 1725654655.0,
      "score": 9
    },
    {
      "id": "llv0yr5",
      "body": "When my husband had an affair, it was seriously more like a soap opera.  If I hadn't lived it, I would swore it wasn't real life. \n\nCrazy thing in small town how word travels there way noway to dispute it all. \n\n28 years later, it's still hard to believe how crazy it was.\n\nI'm just glad my kids and I have been able to survive it and have good, happy lives.",
      "created_utc": 1725658634.0,
      "score": 9
    },
    {
      "id": "lluto5n",
      "body": "This was always my question for my ex. He had a best friend from childhood like this and I just didn't understand at ALL why if he hated me so much and wanted to be with her why he was with me. It made absolutely no sense.",
      "created_utc": 1725656194.0,
      "score": 181
    },
    {
      "id": "llujdha",
      "body": "Because Amy wants to have her pie and eat it too! Claiming single to get governments benefits and food stamps and doesn’t have to pay his WIFE alimony and child support all the while he claims his wife and kids as dependants come tax time! Win win for Luke!",
      "created_utc": 1725652875.0,
      "score": 172
    },
    {
      "id": "llvywfx",
      "body": "This is actually bad legal advice, no offense. Judges are wise to the tactic of consulting multiple lawyers (in an effort to bar your stbx from utilizing them) and don’t take kindly at attempts to manipulate the judicial system. They will actually hold it against you in how they adjudicate your case and may rule against you as a result. \n\nBest thing for OP to do is get a reputable local divorce lawyer and take Luke to the cleaners the right way.",
      "created_utc": 1725671073.0,
      "score": 9
    },
    {
      "id": "llunab1",
      "body": "We're already doing that too.",
      "created_utc": 1725654131.0,
      "score": 151
    },
    {
      "id": "llvvwkv",
      "body": "Oh please please do it just like this OP",
      "created_utc": 1725669937.0,
      "score": 24
    },
    {
      "id": "llwkk6z",
      "body": "FILM IT",
      "created_utc": 1725679890.0,
      "score": 9
    },
    {
      "id": "lluj7io",
      "body": "This! Why haven’t the kids looked into this if they’re aware they could be siblings. You don’t need Dads DNA if they submit and it shows them as half siblings.",
      "created_utc": 1725652822.0,
      "score": 110
    },
    {
      "id": "llum13r",
      "body": "Oh I'm calling my lawyer ASAP",
      "created_utc": 1725653727.0,
      "score": 161
    },
    {
      "id": "llug6cs",
      "body": "Oh we're testing everyone. I'm doing one, Sophie's doing one. I'm going to swab Luke in his sleep. (He already agreed anyway.)",
      "created_utc": 1725651856.0,
      "score": 268
    },
    {
      "id": "lludhdb",
      "body": "That's what I was thinking! Wait until Tom is 18, then check the 2 kids and see if they are siblings.",
      "created_utc": 1725650983.0,
      "score": 80
    },
    {
      "id": "llul1a6",
      "body": "Then EXPOSE THEM BOTH to everyone and everywhere",
      "created_utc": 1725653411.0,
      "score": 21
    },
    {
      "id": "llurrd7",
      "body": "Oh I'm going to.",
      "created_utc": 1725655582.0,
      "score": 92
    },
    {
      "id": "llvd76f",
      "body": "Well it’s easy to be when you’re made up",
      "created_utc": 1725662925.0,
      "score": 19
    },
    {
      "id": "lluh695",
      "body": "[removed]",
      "created_utc": 1725652176.0,
      "score": 174
    },
    {
      "id": "lluk07v",
      "body": "[removed]",
      "created_utc": 1725653080.0,
      "score": 52
    },
    {
      "id": "llufu05",
      "body": "Very.",
      "created_utc": 1725651745.0,
      "score": 85
    },
    {
      "id": "llx0974",
      "body": "When all of this is out in the open, I want to ask Luke that very question. But that's assuming he'd tell me. That he ever admits to his affair in the first place. Part of me feels like he'll go to his grave insisting that I'm wrong and nothing ever happened.",
      "created_utc": 1725687976.0,
      "score": 60
    },
    {
      "id": "llur9za",
      "body": "In the first post OP mentioned Luke's family is very wealthy.  They've been funding Amy's life since long before OP even met her husband, and support Amy's kids as well (in the last update the MIL said that was actually partly because she suspected the kids were her son's).",
      "created_utc": 1725655427.0,
      "score": 8
    },
    {
      "id": "lluihow",
      "body": "Why would he? He gets two wives this way. OP let him sleep over at Amy’s and knowingly supported her and the other kids financially. Sweet deal for him",
      "created_utc": 1725652593.0,
      "score": 126
    },
    {
      "id": "llugnte",
      "body": "Because he convinced himself it was a one-time \"mistake\".   Then they kept making mistakes so as someone else said, he got a vasectomy to be sure that Amy wouldn't get pregnant again.",
      "created_utc": 1725652011.0,
      "score": 54
    },
    {
      "id": "llug147",
      "body": "I wish I knew.",
      "created_utc": 1725651810.0,
      "score": 57
    },
    {
      "id": "llvdw7r",
      "body": "amy's first child is older than op's i think this relationship has been going on way longer than we think",
      "created_utc": 1725663176.0,
      "score": 10
    },
    {
      "id": "llx02ba",
      "body": "Very basically, that is my plan. \n\nBut my lawyer has told me that full custody would be a reach, and as much as I'd rather just never see either of them again at this point...my kids still have close friendships (and shared blood) with Amy's kids. Some kind of coexistence with limited contact will be necessary even after our marriage is dissolved.",
      "created_utc": 1725687861.0,
      "score": 41
    },
    {
      "id": "llun718",
      "body": "I asked, and he said yes, he does. However, many times Tom has gone to bed while Luke was on the couch, and later gotten up in the middle of the night and found that Luke wasn't there anymore, and wasn't in his car either.",
      "created_utc": 1725654102.0,
      "score": 202
    },
    {
      "id": "llugqsh",
      "body": "Most likely a fake story, but this one is easy. When he's staying over, where is he supposedly sleeping? These kids look up to him like a father, so wouldn't Tom want to talk man to man about his budding relationship/feelings and just happened to wait til after his mom went to sleep to go talk to Luke privately? You know, wherever he is sleeping in this totally platonic sleepover.\n\nBut yeah, no cameras in mom's room or a guest room. Office, hallway or livingroom, maybe. Bathroom and bedroom are off limits.",
      "created_utc": 1725652039.0,
      "score": 63
    },
    {
      "id": "lludft4",
      "body": "This story is definitely fake. But entertaining none the less",
      "created_utc": 1725650970.0,
      "score": 167
    },
    {
      "id": "lluu36n",
      "body": "The camera idea is gross either way. Let's say their suspicions are wrong, or at least not provable. So what then, Tom just ends up with a bunch of footage of his mom changing?",
      "created_utc": 1725656328.0,
      "score": 8
    },
    {
      "id": "lluejt4",
      "body": "[removed]",
      "created_utc": 1725651330.0,
      "score": 162
    },
    {
      "id": "llufj3d",
      "body": "[removed]",
      "created_utc": 1725651647.0,
      "score": 74
    },
    {
      "id": "lluc279",
      "body": "[removed]",
      "created_utc": 1725650518.0,
      "score": 343
    },
    {
      "id": "llud3dk",
      "body": "[removed]",
      "created_utc": 1725650856.0,
      "score": 40
    },
    {
      "id": "llud2z5",
      "body": "[removed]",
      "created_utc": 1725650853.0,
      "score": 116
    },
    {
      "id": "lluctz1",
      "body": "[removed]",
      "created_utc": 1725650770.0,
      "score": 33
    },
    {
      "id": "lluiu2q",
      "body": "My life is this fucked up just in different ways. I totally believe it",
      "created_utc": 1725652702.0,
      "score": 9
    },
    {
      "id": "llug3nz",
      "body": "[removed]",
      "created_utc": 1725651832.0,
      "score": 32
    },
    {
      "id": "lluepfh",
      "body": "[removed]",
      "created_utc": 1725651381.0,
      "score": 7
    },
    {
      "id": "lluwqng",
      "body": "Shut your face child, our soap is on!",
      "created_utc": 1725657201.0,
      "score": 9
    },
    {
      "id": "llumrfi",
      "body": "Somewhat believable on the OG post, but getting increasingly fictional feel. Nevertheless, fun to read. When there is this serious of a life issue and the person takes the time to write flawless, well thought out prose, that's usually the give away.  A real person wlwould be shitting themselves and stressed out and their story would just be a disorganized text wall.",
      "created_utc": 1725653961.0,
      "score": 7
    },
    {
      "id": "lluliha",
      "body": "They both work, though Amy's job would not be enough to support her family on it's own. \n\nLuke also makes far less than I do, but he comes from a richer family than me.",
      "created_utc": 1725653563.0,
      "score": 55
    },
    {
      "id": "llur2tx",
      "body": "Can you imagine how MIL will feel that she has also been gaslit this entire time? \n\nI hope this story ends in two divorces.",
      "created_utc": 1725655362.0,
      "score": 17
    },
    {
      "id": "llufvlo",
      "body": "Technically, yes they could.  An Ancestry or 23andMe test would answer the question.\n\nThe issue arises however, that all the DNA testing companies require the tester to either be at least 18, or to have parental consent.\n\nNow I suppose technically Tom could lie about his age, and not tell anyone when he does the test.\n\nThat absolves OOP of culpability, and since Sophie is her child, then she (Sophie) obviously has parental consent.",
      "created_utc": 1725651760.0,
      "score": 17
    },
    {
      "id": "llulsmy",
      "body": "I know everyone thinks this is fake, but when this is all over, I could very well write an autobiography.",
      "created_utc": 1725653653.0,
      "score": 102
    },
    {
      "id": "llwzcq7",
      "body": "It feels strange and surreal, but also good.\n\nI am so proud of my daughter!\n\nLuke is absolutely disgusting. I'm trying to emotionally divorce myself from him (as I move through the process of actual divorce) and let go of any residual desire to reconcile, because I now know it's not going to happen. I know some comments have been frustrated with my naivete and restraint, but it's been hard for me. Even so, my daughter telling me point blank to leave her Dad was an eye opener. I am a slow learner, it seems, but I have learned my lesson.\n\nMy lawyer is up to date on everything. She thinks we're going to have a good case, but has also warned me against secret DNA tests. She basically told me in so many words that Sophie and Tom would need to do that on their own without my \"aiding and abetting\" them. So we're going to figure that out.\n\nFull custody is my goal, but, according to my lawyer, it's not realistic, when all Luke has done is have an affair. He's never hurt our children. (Not in the conventional way.) Though it pains me to say so, he was a very good father to all of them apart from the business with Amy. My lawyer does think that primary custody is likely, though, as I make more money, plus the sexism bias. (Mothers usually DO get custody even now, which isn't fair, but for me it is a very good thing.)\n\nTherapy is a very good idea, and among other things I'll be looking into that for myself, and for Sophie.\n\nYou are very kind, Reddit commenter, thank you!",
      "created_utc": 1725687437.0,
      "score": 61
    },
    {
      "id": "llzm1qh",
      "body": "It may be a while before the next update, unless something significant happens before the results come back.",
      "created_utc": 1725732345.0,
      "score": 40
    },
    {
      "id": "llzpofn",
      "body": "Probably am going to do that as soon as I get my ducks in a row. \n\nCheaters gonna cheat, but even his Mom seemed to think that he was only unfaithful because the other woman was Amy.",
      "created_utc": 1725733573.0,
      "score": 26
    },
    {
      "id": "lm3qhln",
      "body": "Honestly that's the biggest unsolved mystery for me. I want to know why they would do this to another person when nothing was stopping them from just being together. \n\nAt this point, the paternity of Amy's children is superfluous. I'd like to know because I've wondered for years, but what I was really wondering was whether Luke and Amy had crossed the line, and on that I have my answer.  But now the question gnawing at my insides is WHY.",
      "created_utc": 1725798502.0,
      "score": 54
    },
    {
      "id": "llurmdr",
      "body": "We were married. But her pregnancy with Tom happened very shortly after our wedding. \n\nI suppose we'll find out when we get the results back.",
      "created_utc": 1725655538.0,
      "score": 70
    },
    {
      "id": "llx18ge",
      "body": "I haven't, but that's a very good idea, thank you. \n\nYou are very sweet, Commenter, I appreciate the kind words.",
      "created_utc": 1725688552.0,
      "score": 30
    },
    {
      "id": "lluln4z",
      "body": "Couldn’t the Tom and Sophie just do an ancestry and me together, and see if they’re siblings if they already had suspicions?",
      "created_utc": 1725653604.0,
      "score": 7
    },
    {
      "id": "llv9eas",
      "body": "It’s the hidden camera plan that really stretched my credulity. If this is in fact fiction, that was not the smartest move to include",
      "created_utc": 1725661554.0,
      "score": 14
    },
    {
      "id": "llzowj8",
      "body": "That's very kind of you to say, thank you. I do feel loved and blessed to have Sophie and the fact that Tom is taking my side also has me emotional. My heart breaks for him.",
      "created_utc": 1725733311.0,
      "score": 29
    },
    {
      "id": "lm7r89l",
      "body": "Comments like yours do help me feel a little better, thank you.",
      "created_utc": 1725847194.0,
      "score": 13
    },
    {
      "id": "lm2j2ux",
      "body": "I'll probably never know.",
      "created_utc": 1725772802.0,
      "score": 9
    },
    {
      "id": "lm2u1fc",
      "body": "I feel so so bad for op and have been feeling anxious,  i keep on checking for updates. The whole situation feels so unfair, does amy have no moral and ethical values at all, and also, the husband, how could they do such thing to op. For so many yrs they might have been betraying her and to think amy got preg after or during op's pregnancy means husband cheated on his preg wife everything is so unfair. Amy has been getting all the financial help from inlaws and the couple that, too, seems so wrong and unfair. How could that man do this.... so pathetic. Does op earn more than luke , because then, it makes he not only cheated but have been using her money to keep his mistress, aka sister frd wealthy. I just want those two selfish people to get their karma and for op to move and live a life she deserves.",
      "created_utc": 1725779432.0,
      "score": 6
    },
    {
      "id": "llumtp2",
      "body": "Me too. I need to know the cheaters get busted. \n\n This must be how pro wrestling fans feel.",
      "created_utc": 1725653981.0,
      "score": 12
    },
    {
      "id": "llx8hc5",
      "body": "Exactly. I'd love to find out tomorrow and finally have the answer I've been waiting for these many years but I'll have to wait a while longer.",
      "created_utc": 1725693159.0,
      "score": 30
    },
    {
      "id": "llwzxbt",
      "body": "We discussed that, and Sophie even offered to pretend she was pregnant. (She and Tom had been toying with that idea before.) But at this point, I've kind of lost any credibility I could have to claim I no longer care if they date. At this point I'm just getting my ducks in a row to properly divorce Luke. I don't care if he and Amy admit the truth anymore. My plan is to acquire proof however I can.",
      "created_utc": 1725687779.0,
      "score": 35
    },
    {
      "id": "llzpw60",
      "body": "I've talked to her. She said there's a good chance the test is admissible but NOT if I knew anything about it. This could be a \"turned up on my doorstep\" situation.",
      "created_utc": 1725733645.0,
      "score": 24
    },
    {
      "id": "lly5han",
      "body": "You are correct, and I appreciate you offering a voice of reason. Many comments seem to grow frustrated with me for trying to take what, from where I'm standing, is a slower but more realistic path. \n\nTom has been trying to gather evidence for a while now, well before the three of us talked. However, there will be no \"gotcha\" moment except at my discretion. I basically did reroute him from trying to \"catch\" them onto the DNA sample plan. \n\nI have no intention of leading Sophie or Tom astray. But they have already been looking into this for months. They're willing to now defer to me as the \"leader\" of this \"investigation\" and I intend to make responsible use of that. As for whether or not his parents \"forgive\" that I honestly couldn't give a damn right now.",
      "created_utc": 1725713661.0,
      "score": 48
    },
    {
      "id": "llzqnsj",
      "body": "This is what a lot of comments seem to suspect, but it really doesn't make sense to me. I've never noticed any kind of vibe between Jim and Amy. He views her as a daughter. Plus, why did Amy stop getting pregnant after Luke's vasectomy? No. It's him. It has to be him.",
      "created_utc": 1725733910.0,
      "score": 32
    },
    {
      "id": "llzld4b",
      "body": "I was intentionally vague in the interest of privacy, but the hell with it. It's not like \"Kaylee\" is her real name.\n\nIt's called solar urticaria. The long story short of it is that Kaylee (and Luke) get severe rashes when exposed to sunlight. Insert \"vampire\" jokes here, our family has made them all. It makes life very difficult for them, especially Kaylee.\n\nI've checked. It's very rare, and it CAN be hereditary. That's the only known cause of it.",
      "created_utc": 1725732114.0,
      "score": 36
    },
    {
      "id": "llull1n",
      "body": "Why not just DNA test the 2 kids against each other and stop dragging it out? The test will let you know if they share the same father and then it would be clear your husband is the father of both.",
      "created_utc": 1725653586.0,
      "score": 3186
    },
    {
      "id": "lluhi6g",
      "body": "Pleaaaaaase give us the update whenever you do what y’all decide to do.",
      "created_utc": 1725652282.0,
      "score": 66
    },
    {
      "id": "llufu7w",
      "body": "Or simply say that Tom saw them and that he told you or let Tom confront his mother while Sophie is there.",
      "created_utc": 1725651747.0,
      "score": 94
    },
    {
      "id": "lluk781",
      "body": "Well, its your fake story, take it any direction you want.",
      "created_utc": 1725653143.0,
      "score": 236
    },
    {
      "id": "llz3n4v",
      "body": "I'm sorry you're going through this nightmare, but I have to say, you've raised some decent human beings. Don't be bothered by their sneaking around, be impressed! They've got problem solving skills like Scooby Doo and the gang, a great sense of humor, and a good moral compass.",
      "created_utc": 1725726277.0,
      "score": 12
    },
    {
      "id": "llz5srg",
      "body": "You also need to start an exit plan. Like now.\nAlso keep all evidence hidden and get ready for NASTY ending.",
      "created_utc": 1725726985.0,
      "score": 7
    },
    {
      "id": "lluisvr",
      "body": "OP, you gotta get out of this situation. I feel that if your MIL has even had these suspicions herself, Tom “hearing things” and the excessive amount of times your husband has decided to spend the night with Amy… it just doesn’t match up. You don’t deserve to deal with this, get outta there girlie!!!",
      "created_utc": 1725652691.0,
      "score": 542
    },
    {
      "id": "lluqauh",
      "body": "This was the part of the story (which if it's real I'm so sorry for you OP, if it's not it's still incredible fiction I'm honestly hoping it's fake just because it sucks so much for you if it's real) that I never understood...\n\nYour husband was staying over at Amy's but her kids live there too...I don't see how he's visiting her bedroom at night without the kids seeing/hearing something unless it's a castle.  But you said your husband sleeps on the couch or in his car, which means the house isn't that big (no spare bedroom) and so the kids would definitely be aware of where your husband was actually sleeping.\n\nFrankly it makes a lot more sense that the son already knows, because how could he not have noticed anything?\n\nI'm so sorry OP, I hope you get all the support you need to get out of this super shitty situation.",
      "created_utc": 1725655111.0,
      "score": 236
    },
    {
      "id": "llul5j8",
      "body": "This comes at a surprise to absolutely no one here!! Next time he leaves to go to be with her, tell him don’t come back and if he still goes then pack his shit and drop it off at her place while he’s still over there. This man is lower and low. Both of them actually. \n\nMilk his ass for every penny and asset he has. And before you come with the “I don’t want his money” well just remember you have 4 kids to raise so put it towards their future. This is your time to be selfish. Your time to put you first. Your time to go scorch earth on Luke and Amy!!! They deserve every bad thing that happens to them from this point on. Mercy should not be a word in your vocabulary!",
      "created_utc": 1725653448.0,
      "score": 123
    },
    {
      "id": "llulrcq",
      "body": "have tom and sophie take a dna test to compare to eachother and have it be their idea. you had “no idea”",
      "created_utc": 1725653641.0,
      "score": 44
    },
    {
      "id": "lluigoj",
      "body": "What the f",
      "created_utc": 1725652584.0,
      "score": 19
    },
    {
      "id": "llumoqw",
      "body": "those kids need to say, in front of both Luke and Amy (with you there), about what they have seen and heard.  It'd be nice if grandma and gramps were there too.....",
      "created_utc": 1725653938.0,
      "score": 13
    },
    {
      "id": "lluprfe",
      "body": "I’m the petty one here, if the kids are in on it rip their stitches out! With a wonderful “well I thought your weren’t fucking”",
      "created_utc": 1725654936.0,
      "score": 8
    },
    {
      "id": "llxkc9s",
      "body": "One of them will have EXPLOSIVE AMNESIA !",
      "created_utc": 1725701478.0,
      "score": 17
    },
    {
      "id": "llyr871",
      "body": "Screw that—I’m waiting for the demonic possession storyline!",
      "created_utc": 1725722029.0,
      "score": 13
    },
    {
      "id": "llxi5pt",
      "body": "Yes total BS",
      "created_utc": 1725699901.0,
      "score": 30
    },
    {
      "id": "llzjazq",
      "body": "Right?! The average IQ on here is a negative number. They love a story time.",
      "created_utc": 1725731427.0,
      "score": 19
    },
    {
      "id": "lluric3",
      "body": "I really think you, the cheaters, Tom and Sophie should sit down where the kids inform you all of Sophie being “pregnant”. I would also like to have that on video!\n\nIn all seriousness, you really need to hire a forensic accountant to go through your entire financial portfolio so that you can get the money your husband manipulated you into spending on his mistress and their affair babies back in your divorce settlement. I realize they don’t make as much as you, but Luke comes from wealth, so let FIL pay for it since it’s likely he’s been part of the coverup this entire time. Oh, and also insist on NO alimony!",
      "created_utc": 1725655501.0,
      "score": 330
    },
    {
      "id": "llv5orz",
      "body": "I still think you should put him through the lie detector ordeal as a bit of revenge. Make him go through the WHOLE thing.",
      "created_utc": 1725660247.0,
      "score": 8
    },
    {
      "id": "lluqb2z",
      "body": "Yes!!! These ARE new age soaps and I’m here for it all!!!",
      "created_utc": 1725655113.0,
      "score": 230
    },
    {
      "id": "llvx1qc",
      "body": "I Loved watching Maury and Jerry Springer. So did my grandma 😂",
      "created_utc": 1725670356.0,
      "score": 7
    },
    {
      "id": "llunnfu",
      "body": "I am waiting for the part where it turns out Luke's twin wears an eye patch and is evil",
      "created_utc": 1725654250.0,
      "score": 764
    },
    {
      "id": "llv1ux7",
      "body": "Also... I have no idea how this hasn't been said - but if the DNA test is possible then Tom needs to say\n-\n\n\n\"LUKE... YOU ARE MY FATHER\"",
      "created_utc": 1725658938.0,
      "score": 8
    },
    {
      "id": "llv03qf",
      "body": "They can't get a 23 and Me, the wait for the results would take too long and these updates are rapidfire. \n\nThey'll catch them cheating and force a confession, it's quicker.",
      "created_utc": 1725658343.0,
      "score": 158
    },
    {
      "id": "llv2bea",
      "body": "Doesn’t OP need to go back to the lawyer with the new development?\n\nAnd doesn’t that put to bed (pun intended) why her husband went and spent the night after the accusations at his “friends” place to do “damage control”? Also, I don’t care how close they are or that they grew up together or whatever fucking bs they’ve contrived, for a grown married man and father to regularly go and spend overnights at another woman’s house is absurd — absurd to do, absurd to accept — just all round absurd.\n\nOh boy.",
      "created_utc": 1725659095.0,
      "score": 84
    },
    {
      "id": "lluv967",
      "body": "They need to do an Ancestry test.  OP needs to manage both accounts.",
      "created_utc": 1725656712.0,
      "score": 30
    },
    {
      "id": "lluysam",
      "body": "Yes! And Tom and Sophie act shocked and upset but then come around to making it work while going to school, etc. Then as “pregnancy” proceeds, the fetus seems to have genetic issues, blood tests required from both the mom and the dad. Wait, what do those blood tests reveal?!!!?!",
      "created_utc": 1725657892.0,
      "score": 101
    },
    {
      "id": "llv1vsy",
      "body": "Yes! She can fake morning sickness and really give her dad a scare! 😂",
      "created_utc": 1725658946.0,
      "score": 20
    },
    {
      "id": "llush1s",
      "body": "💯💯💯",
      "created_utc": 1725655810.0,
      "score": 35
    },
    {
      "id": "lluv6at",
      "body": "Brilliant",
      "created_utc": 1725656686.0,
      "score": 14
    },
    {
      "id": "llvhjya",
      "body": "I think we all secretly are. If we watch reality tv shows or read dramatic Reddit stories, just two sides of the same coin. Anyone who says they don’t like gossip/news whatever you wanna call it, is a big fat liar (usually)",
      "created_utc": 1725664522.0,
      "score": 7
    },
    {
      "id": "llv76ke",
      "body": "I think weeeee diiiiid!",
      "created_utc": 1725660768.0,
      "score": 6
    },
    {
      "id": "llv5o6j",
      "body": "Same. I don’t care if it’s fake.",
      "created_utc": 1725660241.0,
      "score": 7
    },
    {
      "id": "llustp3",
      "body": "Yes I agree and if the husband was such great friends with her wouldn’t they both be like so what’s up with all these guys drilling you then taking off- don’t any of these guys pay child support?",
      "created_utc": 1725655921.0,
      "score": 141
    },
    {
      "id": "llvbo1n",
      "body": "I actually know a woman personally that had 5 children with 5 different fathers. None stayed around much longer than the sex for mom, but one was a good dad who paid child support, spent a lot of time with his daughter and Even one of his daughter's siblings who was fatherless. He would pick them both up for weekends and stuff. So, it does happen.",
      "created_utc": 1725662368.0,
      "score": 11
    },
    {
      "id": "llwjjod",
      "body": "Well apparently they were all blinking their eyes, they just never talked about it. Every new update will be OP confiding in another person around town, and each one gives a sigh of relief that she finally knows.",
      "created_utc": 1725679446.0,
      "score": 8
    },
    {
      "id": "lluxe20",
      "body": "Which one?  I love that show",
      "created_utc": 1725657419.0,
      "score": 9
    },
    {
      "id": "llvkp5q",
      "body": "The thing that always makes me roll my eyes and is a dead giveaway that these stories are fake is that the writers always have to overdo it with perfectness of the protagonists.\n\nThey are always:\n\n- all super good looking \n- not rich but super duper rich  \n- earning dream wages without having to actually work for it since there seems to be a lot of  free time \n- kids? All straight A‘s, super popular and smart as Einstein\n- have the best friends and environment they are all super lovely\n\nThe Life is always PERFECT and the marriage is so amazing and super duper extremely great but then there is this small detail which rips apart the whole marriage. \n\nWhy can no one write a story with believable characters? Why can’t there be any averageness? It’s just another 50 shades of grey lol",
      "created_utc": 1725665700.0,
      "score": 16
    },
    {
      "id": "lluv1wy",
      "body": "I hope she enjoys that pie all by herself when her kids realise how disgusting a person she and their dad, who knew he was their dad and never told them, are.",
      "created_utc": 1725656646.0,
      "score": 80
    },
    {
      "id": "llusozw",
      "body": "You think every single person with kids is on government assistance? That’s not how it works.",
      "created_utc": 1725655879.0,
      "score": 48
    },
    {
      "id": "llvvk7u",
      "body": "What ever you do, do not throw the kids under the bus.   In other words, do no reveal the kids' suspicions before you have the test results.",
      "created_utc": 1725669808.0,
      "score": 57
    },
    {
      "id": "llv6zoi",
      "body": "Because then that would ruin the suspense and drama that OP has been building in this creative writing exercise.",
      "created_utc": 1725660701.0,
      "score": 104
    },
    {
      "id": "llumdxu",
      "body": "[removed]",
      "created_utc": 1725653842.0,
      "score": 13
    },
    {
      "id": "llvlbcd",
      "body": "In the OOP, Amy and Luke were very against it when the kids brought it up in the past",
      "created_utc": 1725665935.0,
      "score": 7
    },
    {
      "id": "llwazl3",
      "body": "Because this is fictitious nonsense. Absolutely ridiculous. I love the author claiming a fake pregnancy scare isn’t a bad idea now as if any parent would put their kids through that. \n\nYou would be devastated your kid had been carrying this burden not conspiring with them. You’d be worried about their emotional state.",
      "created_utc": 1725675850.0,
      "score": 9
    },
    {
      "id": "lluojn5",
      "body": "Take him for everything he's worth. In some places you could  sue Amy too. Also tell his parents and everyone you know. Shame the hell out of them. They clearly didn't have a problem embarrassing and hurting you so don't worry if about hurting them. They deserve all the pain in the world. ",
      "created_utc": 1725654543.0,
      "score": 58
    },
    {
      "id": "lluo0pf",
      "body": "have you seen other lawyers so that luke or amy cannot use them?",
      "created_utc": 1725654370.0,
      "score": 30
    },
    {
      "id": "llujaf7",
      "body": "You don't really need to do everyone -- tests on Tom and Sophie will indicate any consanguinity.   You can consent for Sophie, Tom will be trickier (basically a forged guardian consent).",
      "created_utc": 1725652848.0,
      "score": 242
    },
    {
      "id": "lluhrgr",
      "body": "Don’t swab Luke in his sleep. He might use it against you in a divorce. Since he already agreed on doing one, have him do it. He’ll say there’s no point since Amy won’t agree and say that’s fine you’ll wait until Tom turns 18 but in the meantime, he’s doing it",
      "created_utc": 1725652363.0,
      "score": 277
    },
    {
      "id": "lluh14p",
      "body": "Those two are so despicable and selfish they would actually rather risk their kids getting involved in **vest instead of  coming clean, if this is all true they deserve each other.  At least now if it turns out it isn’t true then all three of you can share blame in relief.  I’m hoping yall are wrong so bad.  Not be cause I think poorly of you but because this would make them so evil.",
      "created_utc": 1725652131.0,
      "score": 68
    },
    {
      "id": "llx3ixv",
      "body": "NO!! Only Tom and Sophie test!! They can then say they did this on their own and you can’t be blamed for being involved (lie. You have no idea they knew. Why would you want to break your kids heart?) if they do it on their own you can have plausible deniability that you didn’t put this in their heads (you also didn’t! So it’s backing the truth)",
      "created_utc": 1725689946.0,
      "score": 48
    },
    {
      "id": "llunwml",
      "body": "If the tests come back positive, you can tell Amy her feeling that you acted superior is because you are.",
      "created_utc": 1725654333.0,
      "score": 58
    },
    {
      "id": "llulblz",
      "body": "Or just test Sophie and Tom.",
      "created_utc": 1725653502.0,
      "score": 24
    },
    {
      "id": "lluvc5n",
      "body": "You don’t need Luke and don’t do that. It’s assault. All you need is Sophie and Tom.",
      "created_utc": 1725656740.0,
      "score": 9
    },
    {
      "id": "lluhkvw",
      "body": "Why are you doing a DNA test? And how are you swabbing Luke in his sleep without waking him up?",
      "created_utc": 1725652306.0,
      "score": 16
    },
    {
      "id": "llujapv",
      "body": "Even if he’s not Amy’s kids’ father, now that Sophie and Tom have suspicions of an affair, their friendship should end. Amy and Luke’s friendship have ruined so many innocent people’s lives.",
      "created_utc": 1725652850.0,
      "score": 24
    },
    {
      "id": "llv2hg9",
      "body": "That doesn't even make sense why would you do one? And why would you go through the trouble of trying to get Luke to do one? All you need is Sophie and Tom.",
      "created_utc": 1725659153.0,
      "score": 6
    },
    {
      "id": "lluz2cd",
      "body": "Why wait if Tom is willing? They don’t have to tell Amy",
      "created_utc": 1725657987.0,
      "score": 35
    },
    {
      "id": "lluu2l5",
      "body": "Update us after you talk to her!",
      "created_utc": 1725656323.0,
      "score": 34
    },
    {
      "id": "llusti8",
      "body": "[removed]",
      "created_utc": 1725655920.0,
      "score": 37
    },
    {
      "id": "llw1yra",
      "body": "I'd be careful with mil. Her son is her baby",
      "created_utc": 1725672262.0,
      "score": 6
    },
    {
      "id": "llutb2w",
      "body": "I knew about my dad's affair before anyone else. Kids see more than you realize.",
      "created_utc": 1725656076.0,
      "score": 135
    },
    {
      "id": "llutqli",
      "body": "I hope it's fake. However, I've witnessed some sordid family dynamics before. \nCrazier than this.",
      "created_utc": 1725656215.0,
      "score": 77
    },
    {
      "id": "llv3wuq",
      "body": "A girl I once dated was studying in the medical field - for the sake of the story call her Jessie.\n\n\nShe told me why her ex (let's call him Jay) broke up with her & it's genuinely crazy but funny (well to me not to him).\n\n\nThey invited her over for Christmas & Jays dads brother joined them with his kids. One of them - Tom - has a rare genetic condition & needs blood transfusions regularly. So they were complaining as neither parent is a match & how expensive it is.\n\n\nJay asks what blood types are a match. The cousin has O negative.\nThe mum is A & the dad B...\n\n\nJays dad has 0 negative \n\n\nBUT Jessie can't keep her mouth shut. And basically states that it's impossible for Tom to be O - as he's mom is A. The only way he can be O is if his biological dad is O....\n\n\nShe still couldn't understand why Jay was upset with her. After she pretty much imploded his immediate family...",
      "created_utc": 1725659644.0,
      "score": 60
    },
    {
      "id": "llumdz2",
      "body": "[removed]",
      "created_utc": 1725653842.0,
      "score": 42
    },
    {
      "id": "llunk5t",
      "body": "Rightfully. They both selfish cheaters and destroyed 8 kids’ lives and yours.",
      "created_utc": 1725654220.0,
      "score": 37
    },
    {
      "id": "llvpzcq",
      "body": "Listen. She may “get your husband” in the end (he will have no place to go) but her beloved son is siding with you. That’s awesome. I’m sure the other ones will follow suit soon enough.",
      "created_utc": 1725667729.0,
      "score": 13
    },
    {
      "id": "llz944h",
      "body": "I feel especially sorry for Kaylee (the one that wants a father, correct?). This man pretended to be her father figure when in reality he IS her father. \n\nThat would hurt deeply. He hid Amy’s children. He claimed yours. That’s sick. \n\nHe’s ruined the relationship with both of y’all’s older children. That’s going to be his punishment. \n\nOpen your home to Tom. \n\nAlso- indirectly see if he can look through his mom’s deleted Messages. If you need \nMore proof. \n\nTom should tell Kaylee. She’s old enough to suspect too.",
      "created_utc": 1725728077.0,
      "score": 12
    },
    {
      "id": "llv25tr",
      "body": "Im surprised they didn’t call you over to the house to catch him and Amy in the act…",
      "created_utc": 1725659042.0,
      "score": 10
    },
    {
      "id": "llxfzek",
      "body": "It’s been over 20 years, a divorce, multiple remarriages, AND a previous phone call confirming my Mom’s suspicions at the time from one of his mistresses, but my father STILL won’t admit he cheated. 🤦🏻‍♀️",
      "created_utc": 1725698364.0,
      "score": 24
    },
    {
      "id": "llxo716",
      "body": "Also wanted to add - you have every right to ask Luke all of the questions you want when this is out in the open. I agree that he’s not going to be honest with you but you should ask him regardless. Ask him ALL of the questions. Make him as uncomfortable as he’s made you feel. Most of all, ask him if it was worth traumatizing his children for his affair because that’s what he did - he traumatized 8 kids for his own selfishness. He traumatized you to the point where you accepted behaviour that you know in your soul was not ok and he traumatized all of the children. \n\nDo you have a space space where you can hide stuff? Maybe on your phone? If so, I strongly suggest encourage you to write down all of your questions as they pop up so that when you do have the conversation, you don’t forget to ask him anything you wanted to ask. Keep a running list and use it to focus you when your nervous system tells you to run away.",
      "created_utc": 1725704173.0,
      "score": 10
    },
    {
      "id": "llyeyli",
      "body": "He’s going to have to. I think* there’s a chance that Tom is not his son. But not the others. Tom should definitely get a camera or get ahold\nOf his mother’s phone. He needs to go through her deleted texts.\n\nMessages- edit in top corner- recently deleted texts.",
      "created_utc": 1725717582.0,
      "score": 15
    },
    {
      "id": "lm4vtm1",
      "body": "But “luckily” I think Tom and Sophie are both old enough to take care of the their siblings without your presence so maybe eventually Tom can be the one driving the siblings to see each other and stuff instead of you.",
      "created_utc": 1725812432.0,
      "score": 11
    },
    {
      "id": "llx0kty",
      "body": "I’m so sorry, and while it’s life, I hate that for you. You shouldn’t live with any of the torture or pain, the two of them should be exiled to some far off country where you never have to hear from them again. This is a betrayal that goes beyond the pale.  You wouldn’t be wrong by severing these friendships, blood or not, it doesn’t matter, it’s not healthy due to the nasty situation Luke and Amy caused. \n\nAs adults, hopefully they cut contact and side with you, because you’re the only adult with any substance or morals in this whole situation. ",
      "created_utc": 1725688162.0,
      "score": 8
    },
    {
      "id": "llx8krg",
      "body": "See, this is why you need to be in therapy right now.  You have to stop making up reasons to remain in this swamp.  Families move all the time, the kids will survive without seeing each other.   There is absolutely no reason for you to tolerate having Amy in your life.  You need to take your kids as far away as possible.   If their grandparents want to come and visit, they can figure it out.   They've been supporting Amy all these years, let them pay for you to go somewhere else.",
      "created_utc": 1725693222.0,
      "score": 8
    },
    {
      "id": "lluo518",
      "body": "Another point to confront them with.",
      "created_utc": 1725654409.0,
      "score": 47
    },
    {
      "id": "llusgya",
      "body": "He actually went out and checked the car for him?",
      "created_utc": 1725655809.0,
      "score": 51
    },
    {
      "id": "llxoikb",
      "body": "The next time your husband sleeps over at Amy’s, can you ask Tom to walk around the house when he gets up in the middle of the night and take a video to show that your husband isn’t there?\n\nI’m a fairly bold person so if I were Tom, I’d walk into their bedroom, turn the lights on and take pictures or a video and then run into the bathroom to lock myself in so I could send them to you. But I realize that not everyone is that bold lol. I’d have no problem with it. They don’t deserve any loyalty from him. Luke and Amy betrayed her children along with yours. They betrayed everyone.",
      "created_utc": 1725704392.0,
      "score": 10
    },
    {
      "id": "lluobs5",
      "body": "Yeah actually now that you mention it, I think OP should just come over and catch them in the act next time it's happening... Tom seems willing to let OP know if something is happening and to let her into the house..",
      "created_utc": 1725654471.0,
      "score": 26
    },
    {
      "id": "llv87rp",
      "body": "It was only a question in the back of my mind until the hidden camera part",
      "created_utc": 1725661134.0,
      "score": 11
    },
    {
      "id": "llvtyg2",
      "body": "If it's fake, I hope OP start writing more and write novels, I'll buy ha ha... pretty good page turners.",
      "created_utc": 1725669230.0,
      "score": 17
    },
    {
      "id": "lluitns",
      "body": "[removed]",
      "created_utc": 1725652699.0,
      "score": 7
    },
    {
      "id": "llueaxs",
      "body": "[removed]",
      "created_utc": 1725651250.0,
      "score": 164
    },
    {
      "id": "lluf2bf",
      "body": "[removed]",
      "created_utc": 1725651497.0,
      "score": 108
    },
    {
      "id": "lluf5y7",
      "body": "Thanks for making me feel even stupider about that.",
      "created_utc": 1725651530.0,
      "score": 79
    },
    {
      "id": "lluwsby",
      "body": "Is it odd? Sure, but we don't know what it's like to be inside this situation, so being so blindly judgmental/callous kinda sucks. I love my husband and knowing what I know about him, if he had a close female friend he went to go spend time with, I would trust him. I'd just hope I wouldn't have to go through OP is going through AND also be proven wrong. Either way, it's heartbreaking to say the least.",
      "created_utc": 1725657216.0,
      "score": 10
    },
    {
      "id": "lluejlu",
      "body": "[removed]",
      "created_utc": 1725651329.0,
      "score": 10
    },
    {
      "id": "lluk9jt",
      "body": "[removed]",
      "created_utc": 1725653163.0,
      "score": 8
    },
    {
      "id": "llum9dn",
      "body": "Is she getting regular money from you and inlaws or asking for help for this and that?   I love my bff, but I just can’t imagine asking her for money to help raise my kids.   You seem way too nice - I get you felt she was a friend and you were happy to help but I would be super weirded out if my friends expected me to pay for their kids.   I make 4x’s plus more than any of my friends and they don’t even let me pay for their dinner.",
      "created_utc": 1725653801.0,
      "score": 24
    },
    {
      "id": "llyg1td",
      "body": "What kind of work does Amy do.   It doesn't really matter who makes how much,none of your marital funds should be going to support another woman and her kids.    You probably want to do some accounting of the total amount of money that has gone from your marriage to Amy.",
      "created_utc": 1725717999.0,
      "score": 17
    },
    {
      "id": "llun6av",
      "body": "I wish your in laws could cut the money (also remove from the inheritance) they send to both Luke and Amy. They deserve to live in poverty",
      "created_utc": 1725654095.0,
      "score": 8
    },
    {
      "id": "llv1ckd",
      "body": "I think it's just the *speed* of the updates. Frankly, I could care less either way. I actually HOPE it's fake but if it's real... fuck.. you're living a life as if Maury and Jerry Springer had a love child. \n\nOnly advice would be to put on a smile and keep Luke and Amy fooled until the DNA results come in. you don't even need Luke's swab. You know Sophie is yours. If her and Tom share ANY DNA you'll know that Luke was involved regardless",
      "created_utc": 1725658765.0,
      "score": 28
    },
    {
      "id": "llumauy",
      "body": "Well I didn't mean it like that lol. Ever hear of dirty john? I meant like that. Podcast story, book deals. Based on a true story.",
      "created_utc": 1725653814.0,
      "score": 18
    },
    {
      "id": "llur6ed",
      "body": "Please do. I would 100% buy it, read it, watch it... whatever way you go. And please keep giving us updates",
      "created_utc": 1725655394.0,
      "score": 7
    },
    {
      "id": "llyfv4f",
      "body": "Let’s see if he fights for your marriage now.  He got too comfortable with his double life and barely hid it. \n\nHowever, Amy has never been his wife. Ever. No matter how many years they’ve known each other. \n\nShe can convince herself all she wants - the secret was to “protect” your marriage - not their relationship. She really deduced herself\nTo nothing. That’s really sad. \n\nYour husband is at the center of this and he’s the ring leader monster.\n\nBe prepared to lose friends. Some have already accepted their relationship dynamic - I am sure. \n\nGood riddance to them.",
      "created_utc": 1725717929.0,
      "score": 23
    },
    {
      "id": "llyx5sd",
      "body": "I e been following your story and have been thinking about you. I cannot imagine this being my reality. You’ve been very level headed in your approach and that is incredible. I think I would have burned it all down by now. \nHow is Luke acting towards you right now? He must be able to sense you pulling away and the change in your demeanor. Is he love bombing and hoping to reel you back in?",
      "created_utc": 1725724072.0,
      "score": 23
    },
    {
      "id": "lly5hpo",
      "body": "You could say you were naive, but you could also say you were a good wife who made vows, trusted your husband, had faith in him, and did everything you could to believe he was a better person than he was.\n\nYou're a good person, OP.  It's hard to see deception when you are not deceptive.  It's hard to see lies when you aren't telling them.  You did everything right and none of this is your fault.",
      "created_utc": 1725713666.0,
      "score": 11
    },
    {
      "id": "lm1wjg1",
      "body": "u/PsychFactor Dear, I am so sorry, this whole situation is a very big stress for you and to be discovering more things is a stronger blow. Try to rest, I know it is not easy because this is a mental exhaustion, but you have to do it for your other children. Big hugs. The situation with your daughter and tom is a great relief because they are also on your side, it is one less worry. God I hate how they try to trick you and minimize their actions. Girl stay strong, take good care of yourself and best of luck. You are worth too much to let them disrespect you, you and your family are not a game.",
      "created_utc": 1725762400.0,
      "score": 13
    },
    {
      "id": "llzoh2w",
      "body": "We’re all invested in your story and are dying for updates but at the end of the day, we’re random redditors. When you have an update you want to share with us, awesome, we’re here for you. But you don’t owe us anything. Just focus on yourself and the people who matter to you 🙏",
      "created_utc": 1725733165.0,
      "score": 9
    },
    {
      "id": "llzregq",
      "body": "Did the test already take place, and if so with whom?",
      "created_utc": 1725734159.0,
      "score": 9
    },
    {
      "id": "lm0mo5y",
      "body": "Even if they get together and get married - they will never have a happily ever after due to this betrayal. \n\nTheir selfish need for this diabolic pleasure caused so many innocent lives pain. Eight children. You. Both of your families. Friends. ☹️\n\nI wouldn’t be able to live with myself if my was either of them. Especially your husband.",
      "created_utc": 1725744940.0,
      "score": 12
    },
    {
      "id": "lm3ruyf",
      "body": "When you eventually confront him about the affair, be prepared for him to BS and say he went for a walk when Tom came by. He’ll say he was stressed out and couldn’t sleep so he went for a walk. He’ll gaslight regarding the noises that Tom heard and will say he has no clue what Tom was talking about. \n\nMaybe Luke will finally man up and admit to the affair but he has been lying for 20 years so I would not expect him to be honest now. Just be prepared for lying and gaslighting. \n\nIf you want to catch him with receipts, install a voice activated recorder in his car. u/gentlemanlyadvice can give you pro level advice on how to install one properly.",
      "created_utc": 1725799058.0,
      "score": 19
    },
    {
      "id": "lm757ga",
      "body": "Here's what you do to cover yourself and control the narrative.\n\nSecretly record him with your phone and tell/ask your husband the following:\n\n\"Honey, I am doing some self reflection in the past few weeks on my performance as a wife and partner.  I'm really taking a personal inventory and I want to ask you some serious questions and I'd like honest, serious answers from you.  Do you feel I've abused you in ANY WAY during our marriage and time together? (wait for answer, it's NO right??) Have you ever felt that I've cheated on you or slept with another person outside of our marriage? (wait for the answer again)\"\n\nYou want to get this on recording because the first thing in the cheater playbook after they get caught and exposed is to spin things so that they are the victim.  \"I was abused! They were abusive! I was ignored and neglected! I had no choice but to flee to the arms of another person!\"\n\nYou want to take that ammo out of their gun.",
      "created_utc": 1725838623.0,
      "score": 8
    },
    {
      "id": "lm4gno5",
      "body": "Just put recording devices in your home. You'll get your answers if you're patient.",
      "created_utc": 1725807686.0,
      "score": 7
    },
    {
      "id": "llusrqp",
      "body": "My mind just can’t fathom why he included you in this dynamic if they were that “in love” with one another. Why wouldn’t he have just married her? Why drag you into the role of unsuspectingly being in a threesome? For years and years. \n\nIt’s just so incredibly cruel. \n\nI am so, so sorry. ",
      "created_utc": 1725655904.0,
      "score": 67
    },
    {
      "id": "llzpfgu",
      "body": "It will take years for Amy to repair her relationship with her children, especially Tom. That’s her problem, but just know this.",
      "created_utc": 1725733489.0,
      "score": 8
    },
    {
      "id": "lm0q1h6",
      "body": "You gained another son. ❤️. View it that way.",
      "created_utc": 1725746139.0,
      "score": 6
    },
    {
      "id": "llzrbxs",
      "body": "What are you going to do now? Are you going to let Luke know that you know or highly suspect still? Are you going to tell him how upset you are that he went to spend the night with Amy when he should’ve been with you?",
      "created_utc": 1725734135.0,
      "score": 9
    },
    {
      "id": "llzr59c",
      "body": "Have you told Tom and Sophie that you cannot be involved in their testing; that you don't want to know any details about what they may or may not decide to do along those lines?\n\nProper tests can be ordered by the court at the request of a child over 16 or so.   That can come after you file.",
      "created_utc": 1725734074.0,
      "score": 12
    },
    {
      "id": "llya8kk",
      "body": "Have you checked out TheBiggestBetrayal story yet? She found out about her husband’s long term affair (I think it was around 8-10 years) and collected evidence for several months. She served him divorce papers when he was on a romantic cabin getaway with his AP and he came running back immediately with his tail between his legs. Her story was incredible. She took her time and did what she had to do to protect herself.",
      "created_utc": 1725715693.0,
      "score": 28
    },
    {
      "id": "llzs2vx",
      "body": "And also the noises Tom heard and the fact Luke weren’t where he were supposed to be when he was there",
      "created_utc": 1725734381.0,
      "score": 19
    },
    {
      "id": "llzrbbs",
      "body": "It also doesn’t answer why Luke wasn’t on the couch or in his car when Tom went looking or why he heard noises unless commenters think she was banging both of them 😅",
      "created_utc": 1725734130.0,
      "score": 10
    },
    {
      "id": "llzo27x",
      "body": "Damn. That’s a very rare allergy. The chances of both Kaylee and your husband having it and being unrelated…not very high",
      "created_utc": 1725733024.0,
      "score": 24
    },
    {
      "id": "lluvgl0",
      "body": "Getting two Ancestry test kits is simple.  They are on Amazon.",
      "created_utc": 1725656781.0,
      "score": 877
    },
    {
      "id": "lluytf3",
      "body": "That seems to be the plan.  Before, it was an issue because they weren’t trying to tell the kids until they could confirm he’s not the dad.  But Amy refused to let her kids be tested.  They are minors.  But Tom is nearly 18 and is willing to do so. Now that the kids and OP understand each other!\n\nAlso, OP felt it was unethical to get a sample by stealth.\n\nI was actually one who theorized that the kids were playing a trick to get to the truth in a comment.  I just found it really hard to believe the older kids weren’t suspecting this, but I could see them acting like they like each other to smoke out the truth!",
      "created_utc": 1725657902.0,
      "score": 188
    },
    {
      "id": "llvvs9g",
      "body": "No the best way for this story to continue is if Jim, is actually the father of the kids and Amy has been sleeping with both the husband and the husbands dad but neither of them know about the other.",
      "created_utc": 1725669892.0,
      "score": 81
    },
    {
      "id": "llv67ou",
      "body": "Because this story is fake. That would be too easy and ruin the drama.",
      "created_utc": 1725660428.0,
      "score": 1029
    },
    {
      "id": "llugbo2",
      "body": "Agree. Just confront them that Tom told you and you know. The jig is up. There’s no moral high ground here",
      "created_utc": 1725651903.0,
      "score": 74
    },
    {
      "id": "llvfwt3",
      "body": "I wondered here and there reading it that it’s likely fake. That’s ok I’m invested now. Lie to me. Tell me the story 🤣",
      "created_utc": 1725663908.0,
      "score": 189
    },
    {
      "id": "llvv1dg",
      "body": "Yeah, I pointed that out on the last post. \n\nThe careful attention to the *readers* and drawing them in with *well Reddit* is an obvious give-a-way. \n\nMy friend and I had a bet which direction this story would go. \n\nWe both agreed that Sophie and Tom would magically know - even more so than Cat.\n\n**It's kinda weird how many people have caught the creative writing bug in Reddit-land.**",
      "created_utc": 1725669620.0,
      "score": 52
    },
    {
      "id": "llznkwy",
      "body": "Thank you, I'm quite proud of them!",
      "created_utc": 1725732863.0,
      "score": 11
    },
    {
      "id": "llzpcb3",
      "body": "Exit Plan is being prepared for as we speak.",
      "created_utc": 1725733460.0,
      "score": 23
    },
    {
      "id": "llure1p",
      "body": "I very much wish it were fake, because the life I knew and loved is gone now.",
      "created_utc": 1725655464.0,
      "score": 285
    },
    {
      "id": "llvdvv5",
      "body": "Drop his stuff in front of his mom’s house.",
      "created_utc": 1725663172.0,
      "score": 16
    },
    {
      "id": "lm0fm01",
      "body": "Poor Marlena. I think she died and got brought back to life like 3 times.",
      "created_utc": 1725742466.0,
      "score": 6
    },
    {
      "id": "lmfk2by",
      "body": "Well isn’t it fun to read even if it’s not true🙃",
      "created_utc": 1725973293.0,
      "score": 19
    },
    {
      "id": "llvheyw",
      "body": "I hope the OP sees your comment!",
      "created_utc": 1725664471.0,
      "score": 21
    },
    {
      "id": "llxftvp",
      "body": "At least we're reading, right?!",
      "created_utc": 1725698253.0,
      "score": 15
    },
    {
      "id": "llvzc46",
      "body": "My granny LOVED maury and Jerry springer, haha. She also watched these incredibly dramatic Spanish soap operas. I would like to point out that the show was entirely in Spanish and without subtitles. \n\nMy granny was an elderly southern woman that did not speak nor understand a fucking word of Spanish. She'd still tell you to hush cuz her soaps were on tho.",
      "created_utc": 1725671240.0,
      "score": 10
    },
    {
      "id": "llv1ssv",
      "body": "Also... I have no idea how this hasn't been said - but if the DNA test is possible then Tom needs to say\n-\n\n\n\"LUKE... YOU ARE MY FATHER\"",
      "created_utc": 1725658918.0,
      "score": 1062
    },
    {
      "id": "lluttbh",
      "body": "Dr Luke Ramoray? Dr Drakes evil twin",
      "created_utc": 1725656239.0,
      "score": 199
    },
    {
      "id": "llvfg76",
      "body": "Can someone let me know when the next update comes out. I almost lost this post due to a random refresh and was DEVASTATED. I am so invested.",
      "created_utc": 1725663735.0,
      "score": 54
    },
    {
      "id": "llvb6x3",
      "body": "Do you think they go with that old cliché? They could also use the kids somehow, like have the the son confront the mother and the daughter confront the father. Or better yet fake pregnancy",
      "created_utc": 1725662194.0,
      "score": 7
    },
    {
      "id": "llveveu",
      "body": "Fuckin’ genius since you can extend this ruse and make them sweat for as long as it requires OP to get her documents and life in order before telling her husband they’re done (fiction or not). \n\nOne would hope Luke & Amy get it together and tell the truth for the sake of their kids & shared “grand-fetus” ASAP rather than waiting it out, but if they don’t, let them suffer. 😊",
      "created_utc": 1725663527.0,
      "score": 51
    },
    {
      "id": "llvpli0",
      "body": "And get AI to generate a realistic looking ultrasound picture of a fetus with a tail and three arms or something.",
      "created_utc": 1725667580.0,
      "score": 9
    },
    {
      "id": "llv6jy6",
      "body": "Yeah, OP/husband and the super lovely in-laws all just happily contributed to keeping her afloat while never wondering where all her child support was??",
      "created_utc": 1725660549.0,
      "score": 66
    },
    {
      "id": "llyg81x",
      "body": "It’s not the quantity of kids, it’s the fact that none of the fathers are known to anyone outside of Amy and no one seems to care about that or make any stink about the fact that she kept doing it. \n\n“Oh well, I guess Amy is pregnant again from an anonymous fling.”",
      "created_utc": 1725718065.0,
      "score": 9
    },
    {
      "id": "llxefnd",
      "body": "Exactly!! I would be pissed if i had gone my entire life without a father, just to discover that he basicly lived nextdoor, knew i excisted and never said anything. The same with my mother, the fact she did nothing. Like missing out on a parent can be traumatizing for some kids, not all of course, but still. Both Luke and Amy are worldclass AH not just for cheating but also for lying to their kids. I would feel so betrayed that shit happend to me, if i was a the kid. That would make me feel super unloved and unwanted. \n\nBut also how tf, can Luke turn a blind eye to his kids dating. Like wtf, thats beyond gross, same with Amy.",
      "created_utc": 1725697258.0,
      "score": 9
    },
    {
      "id": "llv1jqe",
      "body": "Amy is a leech who has been financially supported by OP's husband and in-laws for the last 20 years. It's not too much of a stretch to think that she would also be taking advantage of public assistance.",
      "created_utc": 1725658832.0,
      "score": 34
    },
    {
      "id": "llxgiu1",
      "body": "Yes, very important. Don't make them the scapegoat.",
      "created_utc": 1725698746.0,
      "score": 7
    },
    {
      "id": "lluo8v9",
      "body": "She's already agreed to represent me.",
      "created_utc": 1725654444.0,
      "score": 46
    },
    {
      "id": "llv6t6h",
      "body": "Now there’s a word you don’t hear everyday!",
      "created_utc": 1725660637.0,
      "score": 62
    },
    {
      "id": "llvnk4g",
      "body": "Tom is almost 18. He can do it then.",
      "created_utc": 1725666794.0,
      "score": 36
    },
    {
      "id": "llx4dha",
      "body": "Very good points.",
      "created_utc": 1725690484.0,
      "score": 27
    },
    {
      "id": "lly1czw",
      "body": "Especially since their motivation to do so was literally hearing Luke and Amy fuck.  They have reasons independent of OP and that absolves OP of getting Luke tested without Amy's consent.",
      "created_utc": 1725711756.0,
      "score": 8
    },
    {
      "id": "llv4ynu",
      "body": "This is so dumb. Next update is gonna be \"Luke woke up when I swabbed him and freaked out...\"",
      "created_utc": 1725659998.0,
      "score": 18
    },
    {
      "id": "llzqah1",
      "body": "Thankfully, Tom at least will be a legal adult soon and free to do as he pleases. He will always have a place in my home. The younger ones though, I wouldn't be surprised if Amy tried to stop them from seeing me once this all blows to hell. \n\nI feel so bad for Kaylee. She may be the one I feel the worst for. Her life is not and has never been easy.",
      "created_utc": 1725733784.0,
      "score": 23
    },
    {
      "id": "llziyue",
      "body": "I wouldn't put it past him to stick to his guns in the face of proof. \n\nThank you for the messages tip, and thank you to everyone else who said it as well. The next time I can get my hands on his phone you can bet I'll be doing that.",
      "created_utc": 1725731316.0,
      "score": 31
    },
    {
      "id": "lm5uted",
      "body": "That would be helpful.",
      "created_utc": 1725823290.0,
      "score": 9
    },
    {
      "id": "llv1j18",
      "body": "Don't confront until she has more evidence. I mean if Sophie and Tom are willing to take a DNA test that's gonna basically unravel all this anyways.",
      "created_utc": 1725658825.0,
      "score": 27
    },
    {
      "id": "llusszv",
      "body": "A couple of times, yeah.",
      "created_utc": 1725655915.0,
      "score": 92
    },
    {
      "id": "llw0b3p",
      "body": "Tom and Sophie, the true OGs",
      "created_utc": 1725671611.0,
      "score": 20
    },
    {
      "id": "llugsf0",
      "body": "I'm enjoying it so much 🤣🤣 I want a satisfying conclusion! I hope they don't stop",
      "created_utc": 1725652053.0,
      "score": 48
    },
    {
      "id": "llun8wy",
      "body": "I believe you, and I'm fully invested. Get that DNA test!",
      "created_utc": 1725654118.0,
      "score": 22
    },
    {
      "id": "llw1sw1",
      "body": "You're not stupid. It is a tough situation that you subconsciously wanted to avoid and hope for the best. But the reality of the situation, is that you deserve better. You can do it!!",
      "created_utc": 1725672195.0,
      "score": 5
    },
    {
      "id": "lluf48z",
      "body": "[removed]",
      "created_utc": 1725651515.0,
      "score": 21
    },
    {
      "id": "llunnd1",
      "body": "Amy has never -asked- for help, but our family has always insisted on providing it. Which is why I always dismissed the idea that she was a leech before. But yes, she has been getting money sent by us and by Luke's parents.",
      "created_utc": 1725654249.0,
      "score": 63
    },
    {
      "id": "llzk5f0",
      "body": "Amy runs a bar. Luke writes articles. I'm a Nurse Practitioner.",
      "created_utc": 1725731708.0,
      "score": 30
    },
    {
      "id": "llur3wp",
      "body": "Unfortunately that will affect all their grandchildren.  They were already suspicious of Amy's kids so they sent her money.",
      "created_utc": 1725655372.0,
      "score": 9
    },
    {
      "id": "llzj66l",
      "body": "Unfortunately I think you're right. Some of our friends had to have known or suspected as well.",
      "created_utc": 1725731384.0,
      "score": 27
    },
    {
      "id": "llzngub",
      "body": "That's exactly what he's trying to do but I'm not falling for it anymore.",
      "created_utc": 1725732825.0,
      "score": 33
    },
    {
      "id": "lm2ihmi",
      "body": "Thank you, internet commenter. Message like yours are uplifting.",
      "created_utc": 1725772478.0,
      "score": 19
    },
    {
      "id": "llztemp",
      "body": "Tom and Sophie went to Cat to get her help in testing their DNA against each other. \n\nTechnically, Sophie needs someone with \"parental authority\" to be involved as she is under sixteen and Cat counts. \n\nCat and I haven't talked about this because the loophole for my divorce is that I wasn't part of it.",
      "created_utc": 1725734834.0,
      "score": 62
    },
    {
      "id": "llutyip",
      "body": "Money. She makes more than him.",
      "created_utc": 1725656286.0,
      "score": 32
    },
    {
      "id": "lluv17f",
      "body": "I think they are not that in love (at least Luke is not). If he was, he already left his wife for Amy. Because his family would not objected his marriage with Amy, but he still chose OP. \n\nHe just kept Amy as a mistress/alternative just in case. He did not even fathered his kids from Amy. Poor kids grew up not knowing who their dad is, suspecting Luke or any other man, not spending time with their father and now they will continue their lives with resent to those 2. \n\nAmy is a very pathetic woman that she accepted to be a mistress for 20 years. I can’t believe how a woman can accept to live like that.",
      "created_utc": 1725656639.0,
      "score": 15
    },
    {
      "id": "llv2u6d",
      "body": "I mean maybe his FATHER would disown him for \"banging his sister\". Remember Jim (I think that was his name) was staunchly against even believing his son could be intimate with Amy because they were like \"siblings\". Maybe didn't want to upset the gravy train from dear old dad OR even \"shame\" the family with it being taboo in town about how he was banging his \"sister\". Needs OP as a beard so that everything was on the level. Then over time it was just eating your cake and having it too for those two",
      "created_utc": 1725659277.0,
      "score": 9
    },
    {
      "id": "llztgzh",
      "body": "He knows how I feel at this point.",
      "created_utc": 1725734856.0,
      "score": 23
    },
    {
      "id": "llztt1g",
      "body": "We've covered our bases there.",
      "created_utc": 1725734970.0,
      "score": 20
    },
    {
      "id": "llwealp",
      "body": "No, don’t do Ancestry. They have my dad listed as my dad and my sister’s dad but has my sister listed as my 2nd cousin 🙄 \n\nWhen I asked Ancestry about it, they told me they’re not always accurate. I would either recommend 23 & Me or a different company that only does DNA and is not a genealogy website.",
      "created_utc": 1725677207.0,
      "score": 424
    },
    {
      "id": "llzekeo",
      "body": "Or Jim caught them in the act, after his son was already married and O.P. and Amy both had 1 kid. Amy begged him to not expose the affair because she has trust issues from being trafficked in her tweens/ teens. She has needs to have sex but her best friend is the only person she feels comfortable enough with, UNLESS, Jim would like to help her work through her trust issues too.... O.P. and MIL find out Amy been screwing both husbands. They petition for custody of kids on behalf of the STBXHs, because Amy's unstable mentally, and has been placed in psych unit with newly diagnosed borderline personality disorder, caused by PTSD from being trafficked. Amy needs to work on herself before caring for her kids. MIL is wealthy from generational inheritance, leaves Jim, and Luke penniless and living in homeless shelter.MIL is the actual shell corporation that owns business Jim and Luke worked for. MIL fires them for activity unfit for employees of the company. MIL moves O.P. and all the kids into a brand new home where they raise the kids. MIL eventually sets up O.P. on a blind date with her  architect who designed their home. Turns out he is the baby MIL was forced to place for adoption as a teenager of a high society family. They live happily ever after.... Meanwhile, Jim Luke and Amy have been seen panhandling for spare change.",
      "created_utc": 1725729869.0,
      "score": 27
    },
    {
      "id": "llzfylj",
      "body": "Can you imagine if they find out Luke is not Tom's father and Luke finds out Amy was cheating on Luke as well as Luke cheating on OP?",
      "created_utc": 1725730325.0,
      "score": 13
    },
    {
      "id": "llvy5ly",
      "body": "😂😂",
      "created_utc": 1725670781.0,
      "score": 11
    },
    {
      "id": "llvs3o7",
      "body": "Yeah I admit this one had me going until this update. It’s now like someone is testing out the script for a Lifetime movie.",
      "created_utc": 1725668543.0,
      "score": 119
    },
    {
      "id": "llvic0p",
      "body": "Agreed. It was a fun read, though.",
      "created_utc": 1725664811.0,
      "score": 425
    },
    {
      "id": "llvkhwe",
      "body": "Yea, about halfway through the last update, I paused and thought, \"This is a nice creative writing exercise\" because there is no way. I just had the same reaction to this update. There is no way.",
      "created_utc": 1725665623.0,
      "score": 575
    },
    {
      "id": "llvjyg5",
      "body": "Someone tag me when they get to the update with the twins. These are getting more formulaic than Marvel movies.",
      "created_utc": 1725665417.0,
      "score": 146
    },
    {
      "id": "llvhw83",
      "body": "God I hope so bc this is sad af otherwise",
      "created_utc": 1725664648.0,
      "score": 68
    },
    {
      "id": "llvqtce",
      "body": "Yeah, I agree. But I’m going to keep reading updates bc I want to know how the story ends 😂",
      "created_utc": 1725668047.0,
      "score": 35
    },
    {
      "id": "llw8hra",
      "body": "My dad is a pathological narcissist with a decades-long habit of convincing women to get pregnant so he could dump them and run away laughing. He'd use me and my siblings to go along on dates with new women so they could see what a great dad he would be. He was quite successful and always delighted in how much havoc he'd wreak on these women's lives, bodies, careers, psyches. And that ain't even the weirdest of the shit. Women calling and sobbing their hearts out to me, a teenager, was just extra giggles for him. \n\nThis whole \"her kids look an awful lot like my husband\" thing seems tame. If it's fiction in this instance, it's not out of the realm of possibility for a lot of people.",
      "created_utc": 1725674845.0,
      "score": 10
    },
    {
      "id": "llw9g2r",
      "body": "The last update was the clue for me. Tom went to console Amy and spent the night with her and OP didn’t serve him with divorce papers.",
      "created_utc": 1725675226.0,
      "score": 9
    },
    {
      "id": "llwdye5",
      "body": "I kinda hope it is fake so it keeps getting juicier",
      "created_utc": 1725677065.0,
      "score": 8
    },
    {
      "id": "llwfkyb",
      "body": "Enjoyable though. I'm definitely coming back for the next chapter",
      "created_utc": 1725677746.0,
      "score": 7
    },
    {
      "id": "llw9z0y",
      "body": "In the next episode, OP, Sophie, and Tom together conspire to hatch the following plan: \n\nSophie and Tom fake a pregnancy, yes. But wait, there's more! After revealing the pregnancy, they also reveal to Amy and Luke that they suspected long ago that they might be half siblings. So in order to prevent issues, they went ahead and did a 23andme in secret. And that's the great news, Luke and Amy! Turns out, Tom and Sophie are not related at all! Luke *isn't* Tom's father! They are so sorry they ever doubted them!\n\nCue Amy's panic and Luke's anger, as he now believes Amy cheated on him. End scene.",
      "created_utc": 1725675438.0,
      "score": 91
    },
    {
      "id": "llwje2u",
      "body": "Same.  It takes me away from my surgery pain, so please, keep me entertained!  Fake or real, I no longer care.  Spoonfeed me!",
      "created_utc": 1725679376.0,
      "score": 9
    },
    {
      "id": "llymile",
      "body": "Also the hyper accurate details in the retelling, the way people actions and reactions are meticulously described, the adverbs even. This is not an emotional recounting of memory, the is a story being told. Liars often think the addition of more detail makes something more believable but it doesn't, it makes something better written. \n\nI'm both a writer and someone who has survived and recounted very stressful and traumatic events and there is a huge difference between the two.\n\nThat being said this is a fun story and no one is getting hurt so have at it OP",
      "created_utc": 1725720375.0,
      "score": 16
    },
    {
      "id": "llus27n",
      "body": "Again, I'm so sorry for you.  Brace yourself for the DNA test results, and I hope you're lawyered up already with a firm plan for what to do when the truth comes out.  As soon as your husband knows he's cooked he'll go into defensive mode, make sure you nail his ass to the wall before that happens.",
      "created_utc": 1725655680.0,
      "score": 98
    },
    {
      "id": "llux7lu",
      "body": "You will make a much better life OP. Grieve for what is being destroyed now, but with all the lies and deceit out of the way, you will have a stability you never knew before. Sending so much strength and joy.",
      "created_utc": 1725657359.0,
      "score": 28
    },
    {
      "id": "llvdi56",
      "body": "This should be a moment of relief and action. You have your  daughter, Tom and MIL backing you up. You have the moral high ground. Now you can start planning your new life ; free from lies,\n deceit and gaslighting. 🙏🏽",
      "created_utc": 1725663036.0,
      "score": 10
    },
    {
      "id": "llutw8b",
      "body": "Please do not resent the years you have been married, at least you lived a happy life with your husband and the kids. The betrayal is very hard, but you can get over it. You are still young and even can find the true love of your life. \n\nAlso, I believe although all the things he did, your husband loves you that he spent more time with you and your children and did not leave you for Amy. She was always an inferior (even in her own family)",
      "created_utc": 1725656266.0,
      "score": 25
    },
    {
      "id": "lovcj58",
      "body": "It definitely was to a certain point. Now it’s just getting too fantastical and I’m rolling my eyes at everything.\n\nAlthough I’m for sure reading the next part lol",
      "created_utc": 1727278842.0,
      "score": 8
    },
    {
      "id": "llv3zio",
      "body": "10/10",
      "created_utc": 1725659670.0,
      "score": 139
    },
    {
      "id": "llvaznb",
      "body": "I feel like OP chose those names for this reason - I am hooked.",
      "created_utc": 1725662120.0,
      "score": 72
    },
    {
      "id": "llxo8k7",
      "body": "Holy shit. That would be priceless. If we could actually arrange that, I would die with laughter.",
      "created_utc": 1725704202.0,
      "score": 41
    },
    {
      "id": "llva38j",
      "body": "That's Hans. Hans Ramoray.",
      "created_utc": 1725661799.0,
      "score": 12
    },
    {
      "id": "llvbnot",
      "body": "Apparently \"Tom\" is talking about setting up a nanny cam to catch his parents in the act, lol",
      "created_utc": 1725662365.0,
      "score": 11
    },
    {
      "id": "llvdp9z",
      "body": "I was thinking a fake pregnancy announcement would be awesome....or even just have the kids lock the door to his room and sound like they're banging and come out all mussed up...",
      "created_utc": 1725663107.0,
      "score": 7
    },
    {
      "id": "lluombz",
      "body": "Not the point. Once you do a consultation with other lawyers, they can’t represent Luke bc of conflict of interest. You should do a carousel of free consultations with lawyers in your area",
      "created_utc": 1725654567.0,
      "score": 81
    },
    {
      "id": "llwrx38",
      "body": "I don't think the OP should wait that long.   She needs to get an answer asap, at that's probably going to be the genetic genealogy route.",
      "created_utc": 1725683332.0,
      "score": 5
    },
    {
      "id": "llzr2mo",
      "body": "All of those kids are going to be traumatized when they learn that their father was right under their nose but he never claimed them. As a child, that would be traumatizing. They will feel so unloved and unworthy. That is what Luke and Amy did to those children. I feel bad for them too. However, you’re doing the right thing because the longer they live a lie, the worse it’ll be",
      "created_utc": 1725734049.0,
      "score": 9
    },
    {
      "id": "lm06ecz",
      "body": "I’d reach out to Kaylee (she’s old enough) or get Tom to bring her to you before you unleash this… give her a hug and let her know you love her and will always be there for her. Communication can always be open if she chooses. I’d honestly tell her the truth day you serve your husband. \n\nAmy is already your enemy. She’s not a good mother. She is selfish. She denied her children a father due to her selfishness. \n\nHer pleasure is going to cause her children immense pain.",
      "created_utc": 1725739317.0,
      "score": 9
    },
    {
      "id": "llzrl5d",
      "body": "I so want for Tom to start asking questions about his father. That he wants to know him and meet him. \n\nI do want for Tom to confront Amy on what he heard and maybe let Sophie be there for that confrontation.",
      "created_utc": 1725734220.0,
      "score": 6
    },
    {
      "id": "lm0703w",
      "body": "Check with your provider as well and line it up with his phone. If he has a bunch of calls and texts going to that one phone number on the phone bill but you check his phone and it’s not there, you’ll know he’s deleting stuff. \n\nYou also need to check apps because there are tons of apps nowadays where people chat and it doesn’t show up on messages or call logs. Try to get it when he’s sleeping so you have lots of time",
      "created_utc": 1725739522.0,
      "score": 7
    },
    {
      "id": "llutjwq",
      "body": "Why didn’t you ask him? \n\nOr was he ?",
      "created_utc": 1725656156.0,
      "score": 7
    },
    {
      "id": "lluooam",
      "body": "THIS is why she played nice with you and became your “friend” and the ugliness you seen when you confronted her was her real face because she knows the jig is up.   I would immediately cut her off.   No more money from you.   \n\nActually cut them both off if you can.  See them scramble",
      "created_utc": 1725654585.0,
      "score": 94
    },
    {
      "id": "lluogun",
      "body": "It could be funny if you said that do to her reaction to your suspicions that you can’t with good conscience support her financially.",
      "created_utc": 1725654518.0,
      "score": 27
    },
    {
      "id": "llv5ckd",
      "body": "But she had the audacity to say you never helped her!",
      "created_utc": 1725660130.0,
      "score": 19
    },
    {
      "id": "lluob29",
      "body": "So being so close she told you all her financial woes and worries and you being the kindest woman ever with the means gave the money and she didnt feel guilty because they are Luke’s kids and he should help raise them and provide for them and so should his parents.   And now - what has lawyer said about things financially?  If you prove they are his kids can you get away from financially bankrolling her and him in future?",
      "created_utc": 1725654464.0,
      "score": 10
    },
    {
      "id": "llwc1ns",
      "body": "Do Luke’s parents know? Because that would add another level to this.",
      "created_utc": 1725676282.0,
      "score": 8
    },
    {
      "id": "llzuh7h",
      "body": "Excuse me?   You are saying that you have been raising family of ~~four~~ SIX on those two incomes and also sending money to Amy every month?  If your in-laws are also giving her an allowance, her net income (which would be largely unreported) is probably greater than your household's.  \nYour own children's opportunities have been limited because of her.\n\nWho owns your house?   How about hers?    I hope you are talking to your lawyer about the finances because your husband has been spending a significant amount of *marital* income on another family.   You have paid taxes on money that she is receiving tax free.",
      "created_utc": 1725735203.0,
      "score": 38
    },
    {
      "id": "llzm1ia",
      "body": "Tell Luke that do to Amy’s reaction and comments regarding you that think the financial support needs to stop",
      "created_utc": 1725732343.0,
      "score": 17
    },
    {
      "id": "lm0or6u",
      "body": "Just establish what your boundary is with this and stick with it. Mine would be - you can be their friends - but I can no longer be your friend then. \n\nI would tell your friends first before even telling your husband. I struggle with being vindictive. So, I am going to send you some suggestions that keep you clean but that will sway your friends to you.",
      "created_utc": 1725745677.0,
      "score": 7
    },
    {
      "id": "lm2luvu",
      "body": "As women we must support each other and not destroy each other, what a shame that these scumbags just lost a valuable woman. You are a strong mother I’m proud of you, you’re acting the right.  They will make you feel guilty, cheaters always cover their backs, they will pretend to be victims and want to blame someone else. Take good care of yourself, you deserve better, there will be hard times, but life will smile on you. Blessings ❤️❤️❤️",
      "created_utc": 1725774361.0,
      "score": 7
    },
    {
      "id": "llzyosn",
      "body": "So the test has taken place already? Just the wait for results?\n\nI admire your strength, OP. I am so sorry for everything you are navigating. I am fully invested here, wanting so much for you to know the truth, wanting so much to read the future updates when you are on the other side and thriving.",
      "created_utc": 1725736654.0,
      "score": 17
    },
    {
      "id": "lm07o44",
      "body": "  \nNote: I'm on your side and rooting for you. I have a curiosity question.\n\n>Cat and I haven't talked about this because the loophole for my divorce is that I wasn't part of it.\n\nFor my own information, could you please explain this loophole? I'm assuming that this is to your favor, I'm curious as to how that works.",
      "created_utc": 1725739745.0,
      "score": 10
    },
    {
      "id": "lluuoga",
      "body": "But Luke is from a very wealthy family. He doesn’t need a wife to support him. ",
      "created_utc": 1725656522.0,
      "score": 18
    },
    {
      "id": "lluxll4",
      "body": "This doesn’t seem to be the case. Amy is his priority. As evidenced by him going to her after the confrontation by his wife. His actions tell us that Amy is the one he was most concerned about. He has the strongest feelings for her.\n\nI don’t know why Luke and Amy have allowed the OP to be a part of this dynamic. It makes no sense from an outside perspective.\n\nI just know that Luke and Amy are cruel. Unbelievably cruel. To have done this to a wife. A best friend. For so long.\n\nI also know Luke and Amy are accomplished liars. Truly. Deception is second nature to them. They lie often. They lie easily.\n\nAll in all this is a next level kind of manipulation and destruction. What they’ve done to OP is absolutely offensive. What they’ve done to these children is beyond what my mind can fathom. Tom will never get over what he’s experienced because of their deception. Nor will Sophie. Or any of the rest of these innocent babies.\n\nOP, I know you’ve said you are entering therapy. Which is a very good thing. Try your best to be mindful of self care as this unfolds. I know it’s going to be hard to do, but you are brave and strong. You are going to make it through this nightmare. Please be on the look out for a good child psychologist as well. Your family is going to need their services.",
      "created_utc": 1725657490.0,
      "score": 13
    },
    {
      "id": "llwouca",
      "body": "NO, NO, Amy is not some pitiful mistress.   She's in the driver's seat here.  She keeps him ensnared in a very extreme codependency relationship.   She's kept her hooks in him by getting pregnant whenever he should have been paying attention to his wife and who knows what other kind of manipulative antics.   There is no way anyone would have offered to support her without her hinting that she needs it and how awful it is that OP has so much while she has no one/nothing.  \n\nLuke is no prize but Amy has exactly what she wants.",
      "created_utc": 1725681819.0,
      "score": 8
    },
    {
      "id": "llw4pc1",
      "body": "The twist in the story…the real “siblings” are Amy and Luke. That’s why dad finds it so off putting to think it’s true.",
      "created_utc": 1725673331.0,
      "score": 11
    },
    {
      "id": "llwi61y",
      "body": "So you have both of the same parents, and it says cousins? I ask because I had a similar issue with a siblings' results, and it did a number on us. So maybe that was all a huge mistake, hopefully",
      "created_utc": 1725678838.0,
      "score": 130
    },
    {
      "id": "llwjqkk",
      "body": "Best to ask your local police department which company they use for DNA analysis and use them.",
      "created_utc": 1725679530.0,
      "score": 13
    },
    {
      "id": "llzc89z",
      "body": "Doctor here! It is legally more correct to perform this type of test in the hospital for situations such as divorce. I think OP also should talk with a lawyer. The relationship between two children can be checked in a DNA test. Also, it might not be difficult to get a sample of Luke's hair. I am not in the same country as OP. I don't  know laws and regulations. Firstly, she needs to talk to a divorce lawyer.",
      "created_utc": 1725729099.0,
      "score": 5
    },
    {
      "id": "lm6vaju",
      "body": "This is not true and you misunderstood. The dna is 100% correct. What is not accurate is the LABEL because it's based on a range. So for example cousin and half sibling are in the same range of DNA % overlap. Ancestry has to pick one so if your sister shows as your cousin it means that she is either not related to your mom or your dad... Most likely your dad. What you need to look is the cm shared and then make your own conclusions using a tool like DNA painter based on the people you're confirmed to be related to via DNA as shown, not via alleged families trees / relationship.",
      "created_utc": 1725835048.0,
      "score": 6
    },
    {
      "id": "llzrpji",
      "body": "Do you write movie scripts for a living or just as a hobby?",
      "created_utc": 1725734260.0,
      "score": 20
    },
    {
      "id": "llvpqx9",
      "body": "10/10 on the entertainment scale. My new favorite author.",
      "created_utc": 1725667638.0,
      "score": 354
    },
    {
      "id": "llw6st9",
      "body": "so juicy tho 😂😂 i get why granny was always watching her soaps 😂",
      "created_utc": 1725674167.0,
      "score": 271
    },
    {
      "id": "llw7vih",
      "body": "The quote about the English teacher being gorgeous is what gave it away for me",
      "created_utc": 1725674597.0,
      "score": 169
    },
    {
      "id": "llwd3wu",
      "body": "The last update had me thinking that this is a plot from a 1980’s soap opera.",
      "created_utc": 1725676719.0,
      "score": 12
    },
    {
      "id": "llwga87",
      "body": "yeah i’m having a blast reading but it’s fake :/",
      "created_utc": 1725678034.0,
      "score": 8
    },
    {
      "id": "llvyax1",
      "body": "They had me going, too! Ngl",
      "created_utc": 1725670837.0,
      "score": 14
    },
    {
      "id": "llw16aw",
      "body": "There's already twins!  Amy's two youngest are twins.  \n\n\nThe twist here is that when they dna test the kids the twins will have two different dads. ",
      "created_utc": 1725671943.0,
      "score": 60
    },
    {
      "id": "llwcidp",
      "body": "Same. If it ends up being fake it has been a great read.",
      "created_utc": 1725676474.0,
      "score": 11
    },
    {
      "id": "llxmzwi",
      "body": "That would be massively soap opera-ish. That Luke now suspects Amy of cheating. Lol.",
      "created_utc": 1725703349.0,
      "score": 12
    },
    {
      "id": "llv6inr",
      "body": "11/10",
      "created_utc": 1725660536.0,
      "score": 71
    },
    {
      "id": "llvc047",
      "body": "If Tom has a breathing problem then and takes deep breaths between his words...",
      "created_utc": 1725662488.0,
      "score": 43
    },
    {
      "id": "llup8f7",
      "body": "You have to at least pay the consultation fee for that to work- but yes $1000 for 10 consultation fees for the 10 best lawyers in the area, leave him in the lurch.",
      "created_utc": 1725654764.0,
      "score": 41
    },
    {
      "id": "lluoun8",
      "body": "I don't think that would actually work, but it does sound fun.",
      "created_utc": 1725654642.0,
      "score": 41
    },
    {
      "id": "llx0oo9",
      "body": "His mother has been suspicious over the years but never had proof. His father is very insistent that it isn't true. I suppose he might be in on it. But I truly doubt she is.",
      "created_utc": 1725688226.0,
      "score": 34
    },
    {
      "id": "llzvcmh",
      "body": "Her house is owned/paid for by Jim and Cat.\n\nBut here's a funny thing. I'm the one who bought our home and I've just gone through the paperwork - his name was never added to it as an owner.\n\nMy lawyer and I cackled like witches when we figured that out.",
      "created_utc": 1725735504.0,
      "score": 151
    },
    {
      "id": "llzr4ug",
      "body": "It's a good idea, but Jim and Cat will still support her.",
      "created_utc": 1725734070.0,
      "score": 16
    },
    {
      "id": "lm0ari0",
      "body": "Because I never participated in it and can claim I had no knowledge of it.\n\nRight now, all I -know- is that Sophie wanted to ask her grandma for help. Officially, I told her not to. In reality, I know she and Tom did just that.",
      "created_utc": 1725740805.0,
      "score": 50
    },
    {
      "id": "lluuu8n",
      "body": "Family wealth. Not his. At least not until his inheritance",
      "created_utc": 1725656575.0,
      "score": 19
    },
    {
      "id": "lluv6f6",
      "body": "Sure he does if he’s not making much money himself. His parents aren’t going to give him an allowance for the rest of their life",
      "created_utc": 1725656688.0,
      "score": 6
    },
    {
      "id": "lluym5g",
      "body": "I think the reason he spent the night with Amy is that OP is a very resilient woman and Amy has some mental problems. Apparently, OP can handle everything by herself while Amy will always need support. OP is even very resilient while writing the commentary and handling the situation. I am sure the reason for this affair is that Luke feels inferior to OP. He feels more capable with Amy because she is a needy woman. \n\nSimilar to Luke, Amy also feels inferior to OP and she takes the revenge but having an affair with her husband. I think the reason behind that affair is not a soulmate kind of love, but looking for a psychological comfort. Note that Luke has a disease that prevents him to have a high paying job. Although his family is wealthy, still he  is not capable of taking care of his wife and kids alone, but OP can (the same with Amy). \n\nNobody feels sorry for those 2 cheating idiots, but if they had enough level of mental capability, they would have understood that their affair is not benefiting them. Can you imagine having an affair for 20 years? Fathering 4 kids from that affair and not being able to be a decent parent to your own kids, not telling the kids who their father is etc. This is also very draining situation for both POS. \n\nAt the end of the day, both Amy and Luke need an intensive psychological  treatment even more than OP and the kids.",
      "created_utc": 1725657833.0,
      "score": 21
    },
    {
      "id": "llxr2g1",
      "body": "We have the same dad, different moms. And yes, I told my dad we had to do a DNA test on him because his almost 50 year old daughter might belong to his brother 🤦‍♀️ Thankfully it showed she was his daughter too, but Ancestry still won’t fix it. They don’t think it’s a problem because, as they reminded me, their tests aren’t always accurate.",
      "created_utc": 1725706083.0,
      "score": 31
    },
    {
      "id": "llykg5u",
      "body": "They estimate whether you are a sibling or a cousin based on how much DNA you share. If two siblings, by random chance, got a low amount of shared DNA then the estimate would go to cousin. My sister and I ended up sharing 56% of our DNA so more than half.",
      "created_utc": 1725719634.0,
      "score": 10
    },
    {
      "id": "llwp25d",
      "body": "If OP wants to divorce the a$$, then that is the best idea.",
      "created_utc": 1725681924.0,
      "score": 8
    },
    {
      "id": "lm0em6c",
      "body": "Neither!!! Used to take care of an elderly lady that watched her 'shows' and would tell me all about it!  I could just hear Edna saying what I wrote...",
      "created_utc": 1725742124.0,
      "score": 20
    },
    {
      "id": "llw1d8u",
      "body": "I just told my husband how invested I am in this fake story lol",
      "created_utc": 1725672017.0,
      "score": 165
    },
    {
      "id": "llvrobd",
      "body": "For real, I would watch this show or read this as a full book in a heartbeat!!!!",
      "created_utc": 1725668374.0,
      "score": 127
    },
    {
      "id": "llwek2v",
      "body": "Is it weird that I don’t even care if it’s real at this point? I just want to know what happens next lol.",
      "created_utc": 1725677316.0,
      "score": 359
    },
    {
      "id": "llwd5yv",
      "body": "Not the adult BFF sleepovers that only happen with OP’s husband and the BFF even though OP is a BFF as well?",
      "created_utc": 1725676742.0,
      "score": 61
    },
    {
      "id": "llx8tm3",
      "body": "The teenagers hatching the elaborate plot and pretending to flirt is what finally convinced me this is fake. I tend to read everything as if it's real though, more fun that way.",
      "created_utc": 1725693390.0,
      "score": 17
    },
    {
      "id": "llweqrg",
      "body": "Luke is one twin’s dad and Luke’s dad is the other twin’s dad?",
      "created_utc": 1725677392.0,
      "score": 13
    },
    {
      "id": "llv7hwi",
      "body": "Real",
      "created_utc": 1725660879.0,
      "score": 11
    },
    {
      "id": "llvdehl",
      "body": "Obviously the kid has to have asthma",
      "created_utc": 1725662999.0,
      "score": 17
    },
    {
      "id": "lluqvw7",
      "body": "Or at least the few who are a threat. Her lawyer friend would know which ones",
      "created_utc": 1725655300.0,
      "score": 9
    },
    {
      "id": "llvgggf",
      "body": "TERRIBLE advice. Judges don’t view tactics like this favorably.\n\nTalk with your attorney about a PI and forensic accountant. Depending on where you live, money spent on Amy or to support an affair may be able to be deducted from his portion of the marital equity. But it depends on where you live and many other factors.p",
      "created_utc": 1725664112.0,
      "score": 19
    },
    {
      "id": "lluty11",
      "body": "Actually that’s bad advice (though definitely a fun idea). In the end it slows down the process (because they can’t find a lawyer) and it makes you look crazy/vindictive. People need to stop giving that advice out 🤦🏼‍♀️.",
      "created_utc": 1725656282.0,
      "score": 48
    },
    {
      "id": "llupcxj",
      "body": "Ask your lawyer friend if it would work. Until you sign a retainer with her, you can do all the consultations you want\n\nEdited: ask her which lawyers are a threat and go to those",
      "created_utc": 1725654806.0,
      "score": 15
    },
    {
      "id": "llx2n07",
      "body": "In your first update you said your husband agreed to the DNA test. Is it possible that this response was planned in advance because of your mother-in-law's suspicions?",
      "created_utc": 1725689401.0,
      "score": 8
    },
    {
      "id": "llzwjhi",
      "body": "So you have been paying your mortgage and supporting your family while he has basically been sending his income to Amy?    Did you grow up in straightened circumstances?   I ask because it's hard to understand why you would have agreed to limiting your own children's options by sending money to Amy all the time.   Do Luke's parents pay for extras for your kids  -- things like music lessons, camps, tutoring?  What about college funds?",
      "created_utc": 1725735911.0,
      "score": 24
    },
    {
      "id": "llzvy78",
      "body": "This is amazing. At least you and the kiddos won't have to leave what's familiar. Can't wait to hear about his reaction to that. 👏",
      "created_utc": 1725735709.0,
      "score": 13
    },
    {
      "id": "lm1o4b9",
      "body": "How are your in laws involved in housing Amy and her children and yet say they don't know about the secondary relationship their son has been having with Amy.",
      "created_utc": 1725759029.0,
      "score": 8
    },
    {
      "id": "llzridc",
      "body": "But at least YOUR money isn’t going to her after everything she’s done to take your marriage and sanity down.",
      "created_utc": 1725734195.0,
      "score": 21
    },
    {
      "id": "lm078ig",
      "body": "What Jim and Cat think or do is secondary to what you need to do for yourself.   Stop sending money to Amy, just stop.   You don't need anyone's permission or agreement to offering money.   If Amy asks you about, don't respond.   If Luke asks, tell him you are not going to fund his second family anymore.  Talk to your lawyer about how to shut it down.",
      "created_utc": 1725739600.0,
      "score": 11
    },
    {
      "id": "lm0cicz",
      "body": "It's not about strangling Amy's money supply, it's about safeguarding *yours.* I've been reading your replies and I see so much (however rapidly diminishing) concerns to what Amy might be thinking/feeling/reacting and concern as to how she might be affected by your actions. \n\nI get that this has been your normal for an incredibly long time, defering to Amy/Amy's importance in Luke's life. That shit gets carved into your very bones. \nBut try to gently correct yourself if you catch yourself doing it. The steps you take now are only for you and your kiddos. It is wise to consider how Amy might be affected in a... like, bad car metaphor incoming but you're not gonna plow her with your car, more \"mind your own car but keep tabs on the other lanes\" because Amy's life is likely gonna tank and you need to see it to swerve.\n\nBut if her feelings are hurt, so fucking what? If Amy will be angry, boohoo. Think only of yourself and your kiddos now, and as far as she's concerned... like, in your shoes, I wouldn't piss on her if she were on fire. You're not out to get her, she's already fucked. Her relationship with her kids is fucked. Her money supply will be affected. Luke is gonna be a husk by the time your lawyer's done with him. When this story breaks in your town --- and it will --- her reputation is fucked. She might lose her job and/or need to move. You don't *need* to gun for her. All you need to do now is get yours and take Luke to the cleaners.",
      "created_utc": 1725741406.0,
      "score": 8
    },
    {
      "id": "lm0blkz",
      "body": "Let me tell you this don’t be scared to be selfish. Please get your revenge take them for everything they got cause they been playing in yo faces entire time that is not right.Y'all kids could’ve got together about that. Don’t let somebody treat you like that so take him and that homewrecker for every thing they ever work for. I want them miserable and alone",
      "created_utc": 1725741092.0,
      "score": 25
    },
    {
      "id": "lluzcsq",
      "body": "Hah, I hope they settle all of their wealth directly on all 8 grandkids. Luke deserves to get dad's collection of ties.",
      "created_utc": 1725658087.0,
      "score": 22
    },
    {
      "id": "lluxyes",
      "body": "They’re giving Amy, someone who is not their biological child, an allowance. I can’t imagine why they wouldn’t do the same for their own son. ",
      "created_utc": 1725657611.0,
      "score": 7
    },
    {
      "id": "lly69ap",
      "body": "Apparently it's not uncommon for half siblings to read like cousins. My husband and his brother share the same mom and different dad's and it reads first cousins.",
      "created_utc": 1725714003.0,
      "score": 41
    },
    {
      "id": "llz2v53",
      "body": "Ah, I see. I was hoping to hear you shared both parents and confirmed a mistake on ancestry's part. \n\nMy presumed full sibling ended up only sharing one parent with me, and the results read as 2nd cousins or half siblings. I think it was something like 23% shared DNA... I really hoped to hear that something was just way off, but I think our situation is just what it is..",
      "created_utc": 1725726014.0,
      "score": 17
    },
    {
      "id": "llydj4n",
      "body": "Same. My husband said “they got you, huh?” I said “they got a lot of people!”",
      "created_utc": 1725717024.0,
      "score": 15
    },
    {
      "id": "lm06cj7",
      "body": "I held off eating dinner for like 30 minutes, I was so into it!😆",
      "created_utc": 1725739300.0,
      "score": 7
    },
    {
      "id": "llxqbi1",
      "body": "Well good news. It's an episode of Law and Order SVU called \"Families\".",
      "created_utc": 1725705601.0,
      "score": 8
    },
    {
      "id": "lm3jzz6",
      "body": "Halfway through reading this \"update\", I sighed..... I thought, it's obvious it's a fake story but it is entertaining and 10/10 I would watch this show or would love to read the book.... 🤣🤣🤣🤣",
      "created_utc": 1725795642.0,
      "score": 6
    },
    {
      "id": "llwnab5",
      "body": "No cuz if it is then i’m weird too and this is our weirdo book club",
      "created_utc": 1725681096.0,
      "score": 104
    },
    {
      "id": "llx60a8",
      "body": "Some of these made up ones are awful, and written so badly, but this one... It's keeping me on tenterhooks! I'm all in for OP, and can't wait to find out how she gets even.",
      "created_utc": 1725691525.0,
      "score": 59
    },
    {
      "id": "llwpxm2",
      "body": "SAME",
      "created_utc": 1725682349.0,
      "score": 9
    },
    {
      "id": "llwdua8",
      "body": "That also gave me pause, but I do know several couples with “non traditional” relationships who wouldn’t bat an eye at sleepovers 😬😬😬",
      "created_utc": 1725677018.0,
      "score": 14
    },
    {
      "id": "llxo0p9",
      "body": "I literally said that I sometimes stay over (or used to) at Amy's as well lol",
      "created_utc": 1725704053.0,
      "score": 16
    },
    {
      "id": "llw8uzq",
      "body": "Kaylee can do it while she's having an allergy attack.",
      "created_utc": 1725674992.0,
      "score": 8
    },
    {
      "id": "llv21p9",
      "body": "The issue is... it came up ONCE on Reddit and some idiot tried it. Like, YES talk to a FEW lawyers but don't go fucking insane and talk to ALL of them. \n\nSo, anyways, dude did that and talked to all the lawyers in his area. When it came time for his wife to find one the lawyers couldn't help her. Thing is... they still TALK. They figured out what the dude did and basically wanted him to pay for HER lawyer and some other things. I don't think much ever truly came of it (in terms of him getting in trouble) but they were absolutely willing to make an example of him for making a mockery of the process",
      "created_utc": 1725659001.0,
      "score": 10
    },
    {
      "id": "llx2xj4",
      "body": "She didn't tell me of her suspicions until after Luke had agreed. As far as I know, he isn't aware of her suspicions.",
      "created_utc": 1725689579.0,
      "score": 22
    },
    {
      "id": "lm2gk8v",
      "body": "I think my father in law is in deeper denial than I was.",
      "created_utc": 1725771474.0,
      "score": 16
    },
    {
      "id": "lluzggl",
      "body": "They were giving Amy money because they felt sorry for her as an allegedly single mother who is down on her luck. Amy and Luke manipulated his entire family.",
      "created_utc": 1725658122.0,
      "score": 9
    },
    {
      "id": "lmbctp8",
      "body": "The label close family to 1st cousin does not include 1st cousins. You have to look at the amount of DNA you share to see if it’s the correct amount for the suspected relationship. There are several possibilities for that category.",
      "created_utc": 1725906736.0,
      "score": 8
    },
    {
      "id": "lm0i4ox",
      "body": "According to Dr Google it is possible to only share that much with a full sibling, but it's very unlikely.",
      "created_utc": 1725743329.0,
      "score": 7
    },
    {
      "id": "llz3xrh",
      "body": "[deleted]",
      "created_utc": 1725726377.0,
      "score": 15
    },
    {
      "id": "lm4cwqf",
      "body": "I think it’s likely your in laws have always known the truth. Thats why they help so much, they know those kids are their grandchildren ",
      "created_utc": 1725806500.0,
      "score": 10
    },
    {
      "id": "lm11p4o",
      "body": "That was our unfortunate conclusion also. Not even worth bringing back up now to delve back into..",
      "created_utc": 1725750429.0,
      "score": 7
    },
    {
      "id": "llzq11b",
      "body": "It sounds like he pretended to sleep on the couch and then went to bed with Amy after the kids went to sleep and then woke up before everyone else and went back to the couch. \n\nAlthough it is risky and weird that no one ever caught onto it, especially when they were growing up. Kids sometimes go to their parents room in the middle of the night if they have a nightmare and it would’ve been a massive risk if he was in bed with Amy",
      "created_utc": 1725733692.0,
      "score": 7
    },
    {
      "id": "lm5voiz",
      "body": "Cat suspected. \n\nJim either knew or was in complete denial.",
      "created_utc": 1725823567.0,
      "score": 21
    }
  ]
}