{
  "id": "1ff1hs9",
  "title": "UPDATE IV: I think my husband fathered his best friend's children, and now one of them is attracted to my daughter. ",
  "selftext": "In my last post, there were a number of criticisms toward Paige. (You guys will like this update as it turns out, you weren’t the only ones who had a problem with her.) \n\nAs far as the deed being in my name, it’s not an absolute hook, line, and sinker, but Paige is convinced that between that and my having been the one paying the mortgage, I stand a very good chance. It could be interpreted as a common marital property, but I’m going for primary custody with supervised visits anyway. I’m playing hardball. People also questioned whether I should still be posting these, but so long as it’s all anonymous, I am in the clear. Doesn't even matter if someone who knows me could figure out I posted this. I didn’t use any real names, or reveal my location, or anything like that. As for the laptop, even Paige admitted that was questionable, but technically I gave permission and she was only doing what I could have easily done on my own. I just really didn’t want to go through all of that content. As far as the divorce papers, Paige had them filled out after the very first time I contacted her. My ‘serving’ them to Luke was ceremonial, she still contacted him later to “officially” serve him and request his lawyer’s details. \n\nBut before he could respond, I had already done something a little sneaky. I reached out to our “family” attorney, the one who has always been on call to represent me and Luke during our marriage. (He helped us out of a jam with the HOA a while back.) I’ll call him “Zack.” Now, contrary to some of the comments’ suggestions, I cannot just go around town consulting with every lawyer in the area, with the explicit purpose of locking my husband out of hiring them. That is bad faith and judges don’t look too kindly on it. However, this was Zack. He had been \\*my\\* attorney (and Luke’s) for years. I feel like I had just as much right to him as Luke did. And I got there first. So I was able to nail down our family’s lawyer. Met with both him and Paige, and boy howdy, do they not like each other. Zach brought up some of the same problems as some of my comments. He argued that Paige’s activity was in the “gray” area and urged me to hire him to represent me in the divorce instead. That caused a bit of conflict as Paige is explicitly a “family” attorney and this is her specialization. So I’m going to be consulting both of them from here on out. Zach actually thinks it’s a good thing that I made these posts as they can’t really do much other than prove my sanity when Luke and Amy try to argue otherwise. \n\nOverall, I am doing better. I’ve been talking to a friend in real life, the mom of one of Sophie’s friends. I also have therapy scheduled for myself, and I intend to look into family therapy as well. When my kids ask me what’s going on, I simply tell them that their father and I are having adult problems and it’s nothing they need to worry about. That worked for about a day. Sophie warned me they were planning to confront me as a group, and they did, asking if Dad had cheated on me with Amy. Obviously, they’ve been talking about this, and perhaps they have been for longer than I had anticipated. Perhaps they’ve been wondering. Again, even though I had absolute proof, I was hesitant to tell them as much, and let me explain why. I naturally wouldn’t tell them about the pornographic content I found, I would simply say that I found messages between Luke and Amy revealing their affair. But, with the exception of Sophie, they wouldn’t be satisfied with that. I already know Carter, curious little sweetheart that he is, would want to see these messages. So instead, when I was asked directly by my kids if their Dad had cheated on me, I simply said “I believe he did, yes.” With as much sincerity as I could muster. I think they believe me. Tom and Sophie are texting nonstop, and from what I can gather, there’s doubt among Amy’s children as well, that this is about me “losing my mind” and not about their mother being too close to my husband. \n\nI think it’s slowly sinking in for poor Jim that what he didn’t want to believe was possible is very much possible, and it’s happening. I haven’t shown him or Cat any letters or anything. They’re hosting Luke, so I haven’t had much of any contact with them at all. But I did have one phone call with Cat where we wished each other well, that was nice. In the background, I could hear shouting and though Cat quickly went outside, I did hear what sounded like Jim shouting at Luke. He doesn’t usually shout, he’s the calmest man I’ve ever met, so in a way I’m worried about him but also relieved that the wool is being pulled off of his eyes. According to Cat, Luke is still staunchly denying everything. He was pretty upset when he found out that I had poached Zach, though. Which gave me a kind of grim satisfaction. \n\nThe test results came back! Sophie and Tom tested their DNA against each other to see if they truly are blood siblings. Here’s a surprise - according to the test, they’re not. They don’t share any DNA. To everyone who believed Jim had fathered Amy’s babies, here is definitive proof that he did not, because the test would have revealed that too. But I never believed it anyway. Sophie has her doubts and wonders if the results weren’t faulty and if we shouldn’t take another test to be absolutely certain, but I’m not really worried about that. More confused than anything. I was so certain Tom had to be Luke’s son. He was too. Now he doesn’t know what to think and I don’t either. I obviously now know the affair happened and lasted years, and I know from the letters that Kaylee is Luke’s child, or at least both he and Amy seem to believe she is, which confirms they were intimate fifteen years ago. Now I’m just wondering for Tom’s sake. Who, if not Luke, is his father? He does kind of look like Luke, but that might just be coincidence. \n\n**In general, everything was quiet for a few days, until it wasn’t. Until she finally showed her face. My “best friend” Amy.** \n\nI am so happy I installed ring cameras everywhere as you are about to understand. Sure enough, Amy turned up on my doorstep and asked to talk. She had a relaxed demeanor and did not raise her voice. Assuming she was approaching me on Luke’s behalf, I told her that I wasn’t interested in talking to her and to just go away. She did not leave, but she didn’t make a scene either. She persisted in telling me we needed to have a conversation. The kids weren’t home, and did have cameras inside - I was also recording her on my phone and being discreet about it - so eventually I relented and let her in. I don’t know if she realized she was on camera. We sat down on the couch, and she instantly got into the reason for her visit. Turns out, she and Luke know (or suspect) that I procured damning material from his laptop. Amy accused me of going through his devices and told me that anything I found was not my business and I needed to delete it. That was all she had to say. No apology, no admission of guilt, didn’t take responsibility for her own behavior. Hell, she might have known I was recording her, because she didn’t even directly acknowledge what the “sensitive material” on Luke’s laptop actually *was.* \n\nSo I confronted her, letting out some of my anger. I asked how she could have the nerve to make demands of me. I asked her why she and Luke would do a thing like this in the first place. Why had they seen fit to spend all these years betraying me? I posed the question that I’d been wondering about for a long time, and as I expected, I got no answer. Literally, Amy didn’t seem to really hear me even as I confronted her. She seemed like she was stressed. Panicked, even. But she was keeping it under wraps. She ignored my questions and accusations, and just kept telling me to delete whatever content from Luke’s laptop that I had. She said that if I wanted to divorce Luke, that was my call, but not to “drag her into it.” Oh, that made me so mad. I kept my temper, but I did snap back that she was already very much in it. Amy just kept repeating herself. Telling me to delete whatever I found. So I just refused. I asked her, point blank, why I should. Why did I have any reason to? \n\nAmy got more aggressive, raising her voice. She was trying to intimidate me but I held my ground. She told me that this wasn’t about me, and that I needed to just do as she said. That it was very important. So, I asked again: Why? And yet again, she would not answer. So I asked her if Luke had sent her to do this or if she had shown up on her own. No answer to that either. It was like talking to a brick wall. So I asked her to leave. Just as I’d been afraid of, she wouldn’t go. She refused to leave until I had deleted everything I’d found “in front of her.” I couldn’t help laughing. I told her no, that wasn’t going to happen. This is where I could see her starting to freak out more. In another moment, she got up, ran into the other room, and grabbed my laptop. Before I could stop her, she smashed it on the floor. I really don’t know why she thought that would work or get her the outcome she wanted, I think she was just panicking. Obviously, I still have everything (except now I need to buy a new laptop..) and, sadly, her doing this was out of frame of the camera, but it’s fine. All of my important files are backed up, and at that moment, I was more concerned that Amy would do something else drastic. She looked like she was going to have a breakdown. I tried again, very calmly, to tell her that she needed to leave or I would call the police. She refused *again,* and just kept repeating her demand that I drop this whole “cheating” angle and divorce Luke without trying to argue that an affair took place. \n\nAt that point I just stared at her. At the woman I had considered one of my dearest friends in all the world. And I told her that I didn’t owe her anything, but she owed her children the truth. That they had the right to know where they came from. Who Luke really was to them. Amy bristled and told me it was none of my business - that I didn’t understand her family and I needed to back off. She kept going back to this idea that I could divorce Luke, but I must not claim he’d had an affair with her. I just told her that I didn’t need her permission to handle my divorce how I wanted, and told her again to leave. She got more and more desperate, and her anger accelerated to the point that she physically attacked me. I did not expect her to actually do this. I’m not much of a fighter but I do know the human body pretty well, and where it’s weakest. She hurt me pretty badly, but I got her off me. That part was very much *on* camera, and the whole audio was recorded on my phone. \n\nShe finally left after that, and I immediately called to file a police report. I had the strangest feeling she’d try something similar and wanted to beat her to the punch. I was able to clean myself up by the time I had to face my kids, and while I downplayed the story, I did not lie to them about why I had a black eye. I told them, for their own safety, to steer clear of Amy. I also sent the footage to Paige and Zack, as well as pictures of my injured state before I cleaned up. They’ve also printed out the letters that reference Kaylee as Luke’s child. \n\nI really feel like Amy just screwed herself over on all this. I don’t know what her motives were. Was she protecting Luke? Was this his idea? Does she just really not want the world to know she’s a homewrecker, is she covering her own ass? As if people didn’t know already? The more of my social circle I talk to, and inform of the basics, the more people are confessing that they had wondered in the past if Luke wasn’t cheating on me, but didn’t have any concrete proof. I suppose Amy doesn’t want her kids to know who fathered them, which does line up, but…I’m still not sure about Tom. I didn’t ask Amy about him in particular. \n\nI don't know why you guys are so eager for these updates but I don't mind posting them. I've never blogged about my life before, I'd imagine it feels something like this?",
  "created_utc": 1726144585.0,
  "score": 9768,
  "num_comments": 1474,
  "url": "https://www.reddit.com/r/offmychest/comments/1ff1hs9/update_iv_i_think_my_husband_fathered_his_best/",
  "comments": [
    {
      "id": "lmrd29h",
      "body": "Oh, to be a fly on the wall when Luke finds out that the children he thought were his actually belong to someone else and that his mistress has been cheating on him for years! It would be sooo satisfying. He will lose not only his wife and mistress but also some of his \"children.\" Not to mention losing the respect of the children he had with you. He’s headed straight for the downfall.",
      "created_utc": 1726146311.0,
      "score": 5590
    },
    {
      "id": "lmrakv2",
      "body": "I'm so sorry that she had gone to your home and attacked you. Glad you still have the evidence and didn't back down. I have a feeling that she is wanting you to delete the stuff because maybe your in laws have threatened to cut her off financially if it is true? Thank you for the update. Hope you are healing.",
      "created_utc": 1726145335.0,
      "score": 2000
    },
    {
      "id": "lmrbf9v",
      "body": "Well... I need a drink",
      "created_utc": 1726145671.0,
      "score": 430
    },
    {
      "id": "lmrdf1d",
      "body": "It sounds like she has some other man paying for her children, and he agreed without DNA tests for all of them, meaning she will have to face the consequences of him finding out that she lied and at least one of her children isn't his.",
      "created_utc": 1726146450.0,
      "score": 799
    },
    {
      "id": "lmrdjnw",
      "body": "Something else is definitely going on with Amy. I’m not sure if it has anything to do with Luke or not but there’s some piece of the puzzle missing here. I suppose fear of a ruined reputation could be enough to motivate someone to behave like that, but…not denying the affair while insisting that you not “drag” her into it makes it seem to me as though there’s something else going on. Someone who was concerned with being labeled a homewrecker would just continue to flat-out deny the affair, imo. We live in an age where she could even tell other people that your evidence is just Photoshop or AI. If she were just concerned with her rep she’d be doing damage control with friends, family, her kids…not with you.  I don’t have any theories or any real help to offer here, but fwiw I feel like there’s more to the story that you don’t know yet.",
      "created_utc": 1726146499.0,
      "score": 397
    },
    {
      "id": "lmrarh7",
      "body": ">Luke actually thinks it’s a good thing that I made these posts as they can’t really do much other than prove my sanity when Luke and Amy try to argue otherwise.\n\nYou mean Zack? Why would Luke think it's a good thing?",
      "created_utc": 1726145408.0,
      "score": 554
    },
    {
      "id": "lmrb85s",
      "body": "i feel bad being entertained by what is the end of your marriage, but you’re doing so well and you’re being so so strong. i hope you end up coming out of this feeling liberated and refreshed ",
      "created_utc": 1726145592.0,
      "score": 496
    },
    {
      "id": "lmrdyd4",
      "body": "That aside, I’m so sorry she attacked you. I hope you and your children stay safe! Also I hope her kids get removed from her house. Maybe they can live with Cat?",
      "created_utc": 1726146660.0,
      "score": 122
    },
    {
      "id": "lmrfb0z",
      "body": "It is so strange that Amy does not want you to mention her in legal documents. She specifically insist on protecting herself. What is she protecting herself from? She already has an affair with Luke, that is obvious. \n\nI wonder if she also has another man apart from Luke and does not want him to know about these? Maybe Tom’s father?",
      "created_utc": 1726147176.0,
      "score": 109
    },
    {
      "id": "lmrf267",
      "body": "[deleted]",
      "created_utc": 1726147082.0,
      "score": 310
    },
    {
      "id": "lmrhtfc",
      "body": "For what ever reason the person who if the father cannot be known.  Maybe it’s someone in her family.  Maybe she’s blackmailing someone but if this gets out they can have revenge? \n\nAll I know is.. this is deeper than the affair.  She was willing to attack you over it.  I would ask Paige to review for hints at something other than the affair. \n\nShe is most concerned about the affair and her family finding out.  I gotta go back and read the background but, is she in contact with them? Is there a possibility that they are giving her money and revealing this affair would take that away? \n\nThe sensitive information is “none of your business” makes me wonder.  If she’s not on drugs or in the middle of a psychotic break, why wouldn’t the affair information have anything to do with you. Why is she fine with talking about the affair but the actual details of the affair, are too sensitive to even mention, as if she knows you’re recording.  But she has no hesitation in attacking you, even though she seems t know, you’re recording.  \n\nI wish you the best.  I hope this doesn’t continue to escalate.  I am hoping for a quick and speedy divorce. But I there’s at least one more blow up going to happen if the details of the divorce get out.",
      "created_utc": 1726148116.0,
      "score": 98
    },
    {
      "id": "lmrcxn0",
      "body": "What DNA test did the kids use? That was super fast. \n\nAmy sounds like she has mental problems. No accountability for her actions. Zero remorse. No empathy. She thinks she can’t do any wrong. Sue her for the laptop & press charges for battery or assault.",
      "created_utc": 1726146259.0,
      "score": 253
    },
    {
      "id": "lmrds79",
      "body": "could she be in a relationship with someone, cheating on Luke, therefore she doesn’t want to be involved? someone who is supporting her financially? is she working?",
      "created_utc": 1726146593.0,
      "score": 136
    },
    {
      "id": "lmrj0bw",
      "body": "Did the police go after her after the assault was reported? Do Luke and his relatives already know about this?",
      "created_utc": 1726148553.0,
      "score": 65
    },
    {
      "id": "lmtkjuy",
      "body": "This unhinged behavior by Amy is what Luke feared when he decided he needed to go do damage control after you first confronted him. He must have known that she would be on the verge of hysteria that the secret was about to be exposed. Whatever that secret is beyond the affair.",
      "created_utc": 1726172292.0,
      "score": 49
    },
    {
      "id": "lmrc1gu",
      "body": "You and your babies are priority and i’m glad you are making them aware to stay clear of Amy. \nAfter everything that has just happened I do recommend getting/ looking into a protection order against Amy to keep your kids safe and away from her. \nKeep being the bigger person and let her screw herself over.",
      "created_utc": 1726145909.0,
      "score": 128
    },
    {
      "id": "lmrf1q0",
      "body": "I bet her kids have more than one of her friends' husbands as a dad. \n\nOP, how many other friends of Amy's have hubs that her kids look like? She's probably protecting them and her relationship with Luke because he probably thinks he's the only one she's been having flings with.",
      "created_utc": 1726147077.0,
      "score": 89
    },
    {
      "id": "lmrcg5v",
      "body": ">I don’t know what her motives were.\n\nMy guess is that she wants to get with Luke after all this blows over and if it's public that they were having an affair, it would make her look bad to the family and she doesn't want that.",
      "created_utc": 1726146068.0,
      "score": 82
    },
    {
      "id": "lmu79bz",
      "body": "OP, folks are invested in this for a few reasons:\n\n1) To offer support ( at least that is mine)\n\n2) The sheer outrageous behaviour and resulting drama is captivating.  I mean, I am almost 70 years old and your entire saga makes me want to punch Amy and Luke, and I am not a violent person.\n\nI think everyone  here wants the best outcomes for you and the children, both sets.  Best thing is to clear the air and move forward in life without lies and subterfuge.  \n\nGood luck OP.  I am rooting for you",
      "created_utc": 1726179788.0,
      "score": 36
    },
    {
      "id": "lnbg2jy",
      "body": "But what I can't fathom is if they(Luke & Amy) is involved so early then why the hell did he marry OP!!! 🤔 🙄",
      "created_utc": 1726437271.0,
      "score": 36
    },
    {
      "id": "lmrd7ia",
      "body": "I have to wonder if Luke and her are involved in some type of illegal financial shenanigans and there’s evidence on that laptop.",
      "created_utc": 1726146367.0,
      "score": 152
    },
    {
      "id": "lmrblxu",
      "body": "Amy is a silly sausage.",
      "created_utc": 1726145744.0,
      "score": 91
    },
    {
      "id": "lmrqlez",
      "body": "This was my theory from the beginning. That Tom was not their shared child. He started getting more closer to her than ever in the aftermath of that birth. Stepping into the empty space because the man who is Tom’s father is not in the picture. \n\nI think every move she’s made has been very deliberate. \n\nMy personal thought is that she’s always wanted Luke in this way, but he’s not always wanted her. So she inserted herself in every way possible in his relationship with you. Going so far as to marry the two of you because she that desperately needed to be a part of every significant moment in his life. \n\nThis has been so calculated. She deliberately picked someone who looked like Luke to have a fling with and that ended in a pregnancy. Since she couldn’t have him at that time she wanted someone who looked like him. She deliberately kept that man out of the picture. Leaving a gap she wanted Luke to fill. Hoping to tie herself even more closely to him by putting him in a “father” type role in Tom’s life. His real father was probably never even told about the pregnancy. She deliberately made sure you both were heavily involved in her pregnancy with Tom. Pulling him further and further into her fantasy of a family with him. \n\nNot only do I think she’s always been in love with Luke but she’s also always been in love with his money. When you both, and Luke’s family, started taking care of her financially she wanted more. If the family lavished that much care for Tom imagine what she could get if Luke was biologically tied to the child? He would push harder for even more support. \n\nShe went in hard at this point. Luke clearly opened a door. Was there a family crisis? A miscarriage? Were you really sick during your first pregnancy? Did she play on that? Something happened in this time period and Luke responded by giving her exactly what she wanted. From the first time he had sex with her he’s been her patsy. She’s called ALL of the shots. Because she could tell you what he’s done and destroy his life. He’s weak. He allowed himself to be played. At some point fully giving into to it. Is it from genuine love for her on his part? Is it him playing the role he knows she wants him to play to keep her crazy contained and his cheating hidden? Were they both addicted from the adrenaline high of doing this hidden and forbidden thing?  Who knows? \n\nI think she’s played the long game here. Ultimately, getting him and his money. I think she was the aggressor. Coming onto him hard. I think she’s controlled him with sex and secrets. Which had given her a lot of power in this situation. I think she’s liked having this “hidden” authority over you. Knowing things that could destroy you emotionally. She’s gotten quite comfortable in a position of power in his life. Getting her way in all things. \n\nSuddenly, you’re not being passive. You have the power. She doesn’t know how to act in this dynamic. Thus her freaking out. Losing it. \n\nShe doesn’t have anything to hold over Luke’s head any more. You know. If it’s not hidden anymore the thrill of that is removed. She is definitely not getting any more money from you. She is scared of his family’s response. Last, but not least, her children are going to hate her. She’s never been honest with any of them about their parentage. \n\nShe’s acting like a terrified woman because that’s exactly what she is. \n\nShe’s evil. I genuinely believe that. This has been one move after the other of highly thought out manipulation and deceit. Please be careful. Please protect your kids. Desperate people do desperate things.  ",
      "created_utc": 1726151196.0,
      "score": 65
    },
    {
      "id": "lmrmqus",
      "body": "It sounds like you are doing all the things you need to be doing/thinking about, and doing it with style. Give yourself some grace if your choices of how to handle it with the kids have some bumps in the road. There’s no good choices, just the least bad at this stage. \n\nA couple of considerations\n\n1) Amy’s familial background and her actions make her sound like she has some real unresolved issues. She in not only losing you, but potentially her whole family (Jim and Cat, and maybe even Luke), which likely makes her dangerous. The danger extends in all directions, including to herself\n\n2) Luke may think he is the father to all of her kids and is going to find out that Amy was “cheating”- lying to him \n\n3) she may be getting child support from someone else, who think the kids are his\n\nNone of these are your problems or concerns, but may give some context to things as they unfold \n\nPS - Amy’s nerve and absolute disconnect from reality about what in YOUR marriage concerns YOU is top level delusional.",
      "created_utc": 1726149875.0,
      "score": 30
    },
    {
      "id": "lmrprdg",
      "body": "What an absolute twist it would be if Luke and Amy are half siblings. Might explain Jim’s initial denial and also why he has been supporting her all these years. Definitely would explain why Amy wouldn’t want the affair to be acknowledged.\n\nThis is like something straight out of a VC Andrews book.",
      "created_utc": 1726150915.0,
      "score": 32
    },
    {
      "id": "lmrdwu3",
      "body": "munching my butterscotch popcorn and i want more",
      "created_utc": 1726146644.0,
      "score": 56
    },
    {
      "id": "lmrj2o5",
      "body": "I am so sorry that Amy violated the safety of your home and attacked you. I think Amy has gotten  away with a lot and thinks she is above everything. I hope you are able to press charges against her. Amy seems unhinged and terrified about the truth getting out. I have a few theories about why, but I won't write them out as they are pretty unkind.\n\n\nI do think you should tell your in-laws what happened. Amy isn't safe and seems like she wants to protect her secret at all costs. Your soon to be ex-husband is an idiot. I think you are handling everything so well OP. \n\n\nOn a side note, I do wonder why your family lawyer dislikes Paige so much. That would make me a bit nervous, but as long as they have your best interest at heart and are willing to fight for you and your kids, it should work out well. Good luck OP. The best revenge is to love a beautiful life.",
      "created_utc": 1726148576.0,
      "score": 60
    },
    {
      "id": "lmv8slx",
      "body": "We want a book with a movie deal. Seriously,  OP, we are invested because so many of us, men and women, have been on your end of relationships. My heart goes out to you, and I am praying for the happiest of endings for you and all the children involved!",
      "created_utc": 1726193990.0,
      "score": 27
    },
    {
      "id": "lnj67tf",
      "body": "OP, I haven’t gone through all the comments but from what I’ve seen, I haven’t read anything about why Luke and Amy didn’t just marry each other. Any thoughts yourself on this since you know them? I’m so baffled why they’d have such a long love affair but not just marry each other. Unbelievable. \n\nI’m so sorry you’re going through this! My heart was racing reading all of your posts, I felt like I was going through it myself.",
      "created_utc": 1726553307.0,
      "score": 26
    },
    {
      "id": "lmromby",
      "body": "Tom is not Luke's son! Called it. Amy was stepping out on Luke, because of course she was, that shameless, unhinged dirtbag. Looking forward to her getting charged and arrested.\n\nLooking forward to Luke getting a taste of his own medicine when he feels what it's like to be cheated on and betrayed. Also hoping Cat and Jim will clearly denounce his behavior. And the kids ultimately see him for who and what he is.\n\nHe has enjoyed the support of Amy, Cat, Jim, and the kids for his entire life, but only through baldfaced lies and deception. Please let there be justice. May they all abandon and reject him as the veil fails and they finally see him for who he really is. Years from now, when he looks around and finds himself utterly alone, with only himself to blame, maybe he'll have a moment of reflection. But I won't hold my breath.",
      "created_utc": 1726150522.0,
      "score": 21
    },
    {
      "id": "lmtnv5c",
      "body": "Amy is becoming unhinged because her house of cards is falling apart.  I said before that Luke and Amy had years of controlling OP and  the kids by gaslighting and manipulating the scenario of a brother/sister relationship.  What they didn’t count on was the kids and eventually OP realizing what was the actual truth.  I think they were always in a romantic relationship and OP was the perfect cover.  Luke and Amy are about to lose all financial support and most likely, Luke’s inheritance.  Not to mention how the kids will most likely react to the news, even though they had suspicions before now.  So, they will lose most of their family.  Another twist could be that her family could be involved.  She may have been supporting her family with money received from Luke’s family.  Her family may have sent her to Luke’s wealthy family for them to take care of her, then in turn she takes care of her poor family.  Her and Luke have been honest with each other about whose children she thinks are his children.  Luke knows who the dad is for the other children and Amy may be blackmailing these people to keep quiet.  OP saw all the evidence on the laptop between two people who love one another.  Was there any evidence of a relationship like this with OP?",
      "created_utc": 1726173343.0,
      "score": 22
    },
    {
      "id": "lmu12zy",
      "body": "Gotta wonder if Cat somehow faked the dna test between Tom and Sophie to save her son. Time for round two.",
      "created_utc": 1726177607.0,
      "score": 22
    },
    {
      "id": "lnfepe6",
      "body": "I have to ask.. during Amy’s births to the children.. Kaylee and the twins, was Luke present? Did he treat her similarly to how he treated you when you were giving birth to your kids?",
      "created_utc": 1726502935.0,
      "score": 24
    },
    {
      "id": "lmtplj1",
      "body": "OP we are wishing the best for you. This is heartbreaking. We hope “justice” is served - Luke is such an a*^%!  Is he the father to the twins as well? Their affair seems to be the biggest open secret in town. I’m just sorry you have to deal with this. Prepare yourself for when he decides he no longer has to keep their relationship a secret and they openly become a thing- brace yourself.  \nYou deserve so much better.",
      "created_utc": 1726173884.0,
      "score": 18
    },
    {
      "id": "lmrdp7s",
      "body": "I mean daaaaamn Amy is becoming unhinged",
      "created_utc": 1726146560.0,
      "score": 16
    },
    {
      "id": "lmrk4z3",
      "body": "Ok so hear me out. What if Amy doesn’t want the evidence to get out because she has a guy that she fathered her kids with and she doesn’t want him to question if the kids are his. Like he gives her money for the kids but doesn’t see them. And if he finds out she will be screwed because he will stop paying and question everything",
      "created_utc": 1726148960.0,
      "score": 46
    },
    {
      "id": "lmru715",
      "body": "This feels like season 2 of 'Who the F did I Marry'! \n\nI mean, attacked you in your own home and destroyed your property?! She needs to be in jail! \nTom isn't Luke's son?! Poor Tom. Does he think the test was faulty as well? \n\nYou are one courageous woman and I'll say it again, I'm glad you have Paige and now even Zach. This is heavy and you need good people in your corner to lean on. It's great that you're also looking into counseling for everyone as well.  They'll need it once everything comes to light. I hope Amy's children have someone stable in their corner. She doesn't seem willing to tell them the truth under any circumstances. I know this is difficult for all kids involved because everyone was the best of friends, now being split up. Just know, you're doing the right thing.",
      "created_utc": 1726152397.0,
      "score": 17
    },
    {
      "id": "lmt799t",
      "body": "Algorithm missed this update so now I’m just gonna subscribe to your account because I am literally on the edge of my seat. \n\nAmy’s crazy, Luke is a POS, your kids are smart as fuck and you should be very proud of how they’re handling this.  \n\nSending you nothing but strength. Bring it the fuck home. 🏠",
      "created_utc": 1726168003.0,
      "score": 16
    },
    {
      "id": "lmtm6mc",
      "body": "So it's clear there is something on those kids that Amy is scared about.   It's at least about her affair with Luke being proven to someone else.   \n\nI'm interested in her family.   Where do they play into this saga.    \n\nDoes this affect her job?   Is the owner of the bar Tom's Father?  Or some shadowy underworld figure?  \n\nThat was a quick turnaround for the DNA.   \n\nGet the rest of your kids done, OP.  This will help set the base line for Luke's DNA - both male and female.   You might turn up some more of Luke's kids to other women!    He is a cheater and cheaters cheat!\n\nYou also need more cameras.   And I think pressing charges for assault should be done.  This will help if you want to get custody.",
      "created_utc": 1726172814.0,
      "score": 16
    },
    {
      "id": "lmuuku8",
      "body": "So... been following your \"journey\" since your first post... It's a little odd that Amy's saying to divorce Luke but not say it was an affair and to keep her name out of it... Do you think maybe she's worried that her, Luke and her kids will be cut-out of whatever inheritance they were expecting from Luke's parents? Luke's parent are well off right so it sounds a bit suspicious Amy is saying to divorce Luke but not say it was an affair 🤔🤔",
      "created_utc": 1726188592.0,
      "score": 16
    },
    {
      "id": "lmt3j2d",
      "body": "I don’t even care if this is real not, this is my new favourite telenovela",
      "created_utc": 1726166792.0,
      "score": 15
    },
    {
      "id": "lmv9jto",
      "body": "Are you sure about using your friend to be your lawyer, considering what your family attorney said? this is a huge deal, and i don’t think that having your future ex husband catch things that she did or will do in the “grey area” of her work would help you in the process after all, maybe even make it harder for you to “win” the case after all. ",
      "created_utc": 1726194261.0,
      "score": 15
    },
    {
      "id": "lmukgq8",
      "body": "I know it’s not easy, but I’m glad you made the first step in leaving him! You are strong—don’t forget that! I’m sooo happy your okay and thinks weren’t worse. Just please be careful!!!! What I really want to know is, how often would he sleep over at Amy’s house? Would he show you affection around Amy? Were you two affectionate with each other when she wasn’t around?",
      "created_utc": 1726184743.0,
      "score": 13
    },
    {
      "id": "lmrbk2u",
      "body": "Bro I am hooked on these updates for real. Granny was tight, shit like this is entertaining.\n\nBesides that point, can you really hire both family lawyers like that? I'm not a law expert but hiring two lawyers that both have history with your family sounds sketch, especially when both want to represent you alone... also I'm surprised you can pay for both.... anyways keep us updated\n\nAlso: I'm an sorry for your divorce and dont condone cheating at all but the whole custody thing. I honestly of the opinion that as long as both parties are good parents they shouldn't punish their kids by limiting time with the other. But you do you ofc",
      "created_utc": 1726145723.0,
      "score": 117
    },
    {
      "id": "lmtqbqb",
      "body": "The question is, what did Amy actually hope to accomplish by showing up at your place? If she wasn’t there to offer an apology, what was she actually therefore?",
      "created_utc": 1726174109.0,
      "score": 12
    },
    {
      "id": "lmrd35l",
      "body": "Utterly captivated by the updates.",
      "created_utc": 1726146321.0,
      "score": 23
    },
    {
      "id": "lmrdsjl",
      "body": "I worry for the people that are buying OPs creative writing endeavor.",
      "created_utc": 1726146597.0,
      "score": 177
    },
    {
      "id": "lmtlc50",
      "body": "\"I don't know why you guys are so eager for these updates\"\n\nBecause this is a crazier, more compelling drama than a lot of fiction lol",
      "created_utc": 1726172546.0,
      "score": 10
    },
    {
      "id": "lmu9964",
      "body": "The only thing that comes to mind over Amy's reaction to end up assaulting you is that she put in a claim for child support to some other guy and if the affair comes out that will lessen the support she gets from the other guy. Even though it would now go to Luke. \n\nHowever, Luke's parents and you were both helping. But maybe that extra child support put her completely in the black. \n\n\nMy other theory is that Luke told her if details come out and the truth about him being the dad come out he would cut her off.",
      "created_utc": 1726180522.0,
      "score": 12
    },
    {
      "id": "lmrhr81",
      "body": "Looks like Liz is back at her creative writing again.",
      "created_utc": 1726148093.0,
      "score": 47
    },
    {
      "id": "lmros1k",
      "body": "We are eager for the updates because this is one of the most INSANE things we’ve ever come across. And like you, we all have to know how this ends. Who is the father? Why are they so adamant to deny what there is physical proof of (why create such evidence if you don’t want to be involved)? Why carry out the affair for this long, in this way? There are countless questions that you need answers to and we also need said answers. While I am sorry this is actually your life right now and I hope you’re overall okay from the assault, I do appreciate you updating us because again, this is all INSANE.",
      "created_utc": 1726150576.0,
      "score": 19
    },
    {
      "id": "lmryoid",
      "body": "Man this is a real life telenovela 🍿 \n\nI’m sorry Amy turned violent, but I’m glad you were able to get it on video. To say her insistence of not implying she and Luke had affair is sus is an understatement. I truly hope you find out why that’s so vital. I’m also glad you poached Zach—suck it Luke! Take care OP, and keep serving us tea 😂",
      "created_utc": 1726153857.0,
      "score": 7
    },
    {
      "id": "lmsmjvr",
      "body": "Time to get the boy a 23andme so he can find out who his family is. It will take 6 weeks or more, but there will be more answers for him.",
      "created_utc": 1726161429.0,
      "score": 8
    },
    {
      "id": "lmsmpd7",
      "body": "Ok, I’ve been following this since the beginning, and I started thinking a couple updates ago that Luke and Amy are actually related (not just foster/adopted siblings). \n\nI’m saying it with my whole chest. Luke and Amy are related and this is some Flowers In the Attic shit. \n\nWow, I’m sorry for what you’re going through. I have all the confidence there is that you’re going to be just fine when all is said and done, though.",
      "created_utc": 1726161476.0,
      "score": 10
    },
    {
      "id": "lmsoyin",
      "body": "Bro!!!! $5 on Amy getting knocked up with Tom and not liking who the father was, so she somehow manipulated Luke, (whether it was easy or not), to sleep with her and pin him as the father. I see her blackmailing him like, \"you got me pregnant, you need to do what's right or I tell your wife!\" And that's how their affair started. \nWho knows, maybe she went as far as, \"Tom needs a sibling to play with. You already fathered Tom...\" Her knowing if he ever DNA tested Tom, Tom isn't his and he could deny sleeping with Amy. BUT if they purposely have a kid, then she has him! \n\nI feel like a teenager again guessing what's going to happen next in the soap opera!!",
      "created_utc": 1726162173.0,
      "score": 7
    },
    {
      "id": "lmujmqj",
      "body": "Dear OP, I came to your story only today and read it all from the beginning. I admire your wisdom, grace, intelligence, and strength. Well done! Couple of things stood out. \n1. You earn a handsome salary. \n2. Luke’s parents are wealthy. \n3. Amy requires finances from others. \n\nIs Luke self-sufficient financially? Or his main support comes from you and his parents? \n\nAmy does not want to be involved in the case as she is afraid of losing money. As Luke lost your handsome salary, he can’t help her as much as before. And since his parents never been treated with respect of knowing about their additional grandkids, they might become a little bit tricky with financial support, so the dollars will go to kids directly and not into Amy’s pocket. \n\nLuke looks like a psychopathic type as his grand scheme is too grand and his actor skills are just too polished. He obviously gets off from manipulating and I would highly doubt he has feelings for Amy or anyone at all. I would advise to be super cautious about him and let him believe you are just heartbroken over his “cheating”. Obviously, it is much more than “cheating”. \n\nYou are going towards right direction. You need to free yourself from the toxic duo. All kids respect you.",
      "created_utc": 1726184429.0,
      "score": 9
    },
    {
      "id": "lmuofrl",
      "body": "I wonder if Amy has been collecting some sort of child support from another man too and that she might not even know who fathered which of her children. It seems like she might have another long-term man on the side and she doesn't want him and Luke finding out about each other for she will lose both of her meal tickets and end up with child support that's a lot less than I'm assuming what she's getting. Especially if she's collecting support for all of her children from both.",
      "created_utc": 1726186273.0,
      "score": 9
    },
    {
      "id": "lmupzys",
      "body": "I know I shouldn’t speculate wildly, and I know this pretty far-fetched, but I can’t help but wonder if Luke and Amy might’ve tied the knot—officially or unofficially. I once knew someone who had a small ceremony but skipped the paperwork to keep receiving alimony from her ex. It wasn’t legally binding, but it got me thinking… could something like that have any real legal consequences?",
      "created_utc": 1726186874.0,
      "score": 9
    },
    {
      "id": "lmuq9bw",
      "body": "I am so sorry you are going through this. I'm assuming Sophie told Tom what Amy did to you. He is still just a kid, but he can keep his siblings safe. I'm afraid of what Amy may do next. She is out of control now. \n\nYou are so unbelievably strong. I wish I had just an ounce of your self-control and restraint. I wish you all the best for a swift and just divorce.",
      "created_utc": 1726186975.0,
      "score": 9
    },
    {
      "id": "lmreevg",
      "body": "I wonder if there's something else in there that she's afraid of coming out? It would have to be worse than the affair- so I don't know. But it's really fishy. So glad you did the cameras. It still blows my mind she could come to you like she did, and try to make demands. What kind of shitty shitty person doesn't even feel bad about fucking around with her friends husband FOR YEARS- I just can't understand it.",
      "created_utc": 1726146836.0,
      "score": 9
    },
    {
      "id": "lmrhwp5",
      "body": "Amy just gave you another tool against your soon to be ex husband. \n\n\nI can't believe her entitlement and the way she had behaved. \n\n\nAnd from Tom and Sophie... They should repeat the test, and, from my point of view, Tom has the right to know who's his father.\n\n\nEdit: misspelling",
      "created_utc": 1726148150.0,
      "score": 9
    },
    {
      "id": "lmro3dm",
      "body": "I think Amy is getting money from a bunch of other men and she’s afraid that if the 15+ years of being with Luke comes out all the men will question paternity and sue her for their money back which is why she doesn’t want to be involved.",
      "created_utc": 1726150342.0,
      "score": 7
    },
    {
      "id": "lmrqvr7",
      "body": "I have a really bad feeling that there’s something hiding in the dark. Do your divorce and stay away as far as possible from the whole Amy drama. Your kids can still see hers, if they come over or meet at a neutral place with you somewhere around, but they sure as hell shouldn’t be anywhere near her. And your stbx can take the little ones with him on the visits, so he’s around to keep an eye on them to „protect them from you“. I guess she doesn’t want you around her kids either. But her kids are safer with him around you than yours are with him around her.\n\nSeems like the real shitshow is just about to start. Keep an eye out and stay safe. And I’d talk to Zach about making her buy you a new laptop.\n\nI don’t know if your IL‘s have seen the kids since the blow up, but if not, maybe invite them over. Even if they decide not to come atm, there’s still the possibility and you showing that you don’t pull them into this and you won’t deny them to see the kids or the relationship you have with them. You respect them being Luke’s parents, and you won’t discuss anything related to him or the divorce, but you still love them as the people they are and your kids grandparents and there are other things you guys can talk about. Just put the invite out there.\n\nHave you heard from Luke directly or is he hiding in the shadows?",
      "created_utc": 1726151294.0,
      "score": 8
    },
    {
      "id": "lmsd5eb",
      "body": "Sounds like Amy has more secrets then just her affair with Luke 🤔",
      "created_utc": 1726158494.0,
      "score": 9
    },
    {
      "id": "lntfdju",
      "body": "I wonder if Amy is getting child support or something where is says someone else is the child’s father and it’s going to come back on her that she lied to someone else. Or if Amy has someone else on the side that doesn’t know about Luke. That’s the only thing I can come up with of being so afraid it’s going to come out about the adair or that Luke’s the father. I am sorry she is going through this though. ",
      "created_utc": 1726702774.0,
      "score": 8
    },
    {
      "id": "lmrel4f",
      "body": "Idc if this is fictional anymore. I’ve been checking every day for an update. Keep us updated!!!! I need to know why that homewrecker is having a “mental breakdown”. lol! Take both of them down, mama! So glad Jim is giving Luke a piece of his mind. You are so brave and she is so lucky it was you that she attacked in YOUR home and yet you let her walk out in one piece. Let it be anyone else and she would’ve been made a “pew pew” example. She such a selfish prick and delusional. I want to know wth Luke has to say whenever he gets to it. That jerk.",
      "created_utc": 1726146903.0,
      "score": 48
    },
    {
      "id": "lmrmjmw",
      "body": "Please keep in mind that since Zach has provided legal advice to both you and to Luke, he owes a fiduciary duty to both of you. It's possible that he cannot maintain confidentiality as to your communications because of the dual representation. At the very least, he absolutely cannot represent you in litigation adverse to Luke. Tread carefully there.",
      "created_utc": 1726149806.0,
      "score": 11
    },
    {
      "id": "lmrhcik",
      "body": "Any chance she has been supported by someone who believes they are the father and that could cause her problems if it is proven to be not be true?",
      "created_utc": 1726147941.0,
      "score": 4
    },
    {
      "id": "lmrojux",
      "body": "OMG.   I can’t wait for the next instalment",
      "created_utc": 1726150499.0,
      "score": 6
    },
    {
      "id": "lmruuzi",
      "body": "Any chance Amy is an illegitimate child of your FIL? Hence.. half sister to Luke? That would certainly explain her insane behavior.",
      "created_utc": 1726152615.0,
      "score": 7
    },
    {
      "id": "lmrwfmt",
      "body": "Now Tom really needs to do a 23 and me to see who his dna is linked to. Let’s find the baby daddy.",
      "created_utc": 1726153124.0,
      "score": 7
    },
    {
      "id": "lmuehj6",
      "body": "What about the other children? You mentioned that they had conversations about \"their children\".\n\nLike others, I am wondering whether Amy cheated on Luke.\n\nThe only way you could know is for Tom to get something from his siblings like hair.\n\nIf Tom chose to do this on his own, you could not be held liable.",
      "created_utc": 1726182504.0,
      "score": 7
    },
    {
      "id": "lmuezj4",
      "body": "Okay, You found evidence dating from when they were teenagers so they started their relationship before ever meeting you.\n\nYet they never officially dated, never married or anything and now Amy is desperate about you keeping the affair hidden.\n\nAlso there's the comment about you not understanding how her family works.\n\nI don't remember you speaking about Amy's relationship with her family (parent, sibling or anything) Is it possible that the reason they never officaly dated and the reason she asked you to hide the affair come from her family ? (Like her father threatening to disown her if she ever dated \"That filthy Luke boy\" or something alike ?) Overall, I don't know anything about the situation but I do believe that the reason they never dated and the reason she's asking you to hide the affair are the same. Both have the same purpose, keep their relationship hiden.\n\n  \nOn top of that, there's the paternity test, proving that Tom isn't Luke's son, and if Luke and Amy have been \"together\" since they were teenagers, then that imply \"unfaithfulness\" from Amy (it's highly ironical for Luke to be cheated on by the affair partner he's cheating on you with) I don't know what his reaction will be when he'll learn the news.",
      "created_utc": 1726182692.0,
      "score": 5
    },
    {
      "id": "lnzntuc",
      "body": "She doesn’t want you to acknowledge the affair so that he doesn’t end up paying through the nose for alimony and she doesn’t lose her meal ticket. There’s a name for women like that in my native language and that’s a “muerta de hambre”.",
      "created_utc": 1726798671.0,
      "score": 7
    },
    {
      "id": "lmrcxq1",
      "body": "So proud of you and the way you are handling this. Stay strong! You are finding the perfect combination of taking the higher ground and still seeking justice.",
      "created_utc": 1726146260.0,
      "score": 12
    },
    {
      "id": "lmrddng",
      "body": "Dammit!  I had 3 to 1 odds on Jim being the dad.  It was already looking slim with the last update but I guess I'm out now.  \n\nSo I guess Tom and Sophie can hook up now.  She may be his half siblings half sibling but there's nothing stopping the two of them.",
      "created_utc": 1726146435.0,
      "score": 22
    },
    {
      "id": "lmrdul8",
      "body": "OMG OP. I don’t want to say it… but I think those conversations that you didn’t fully go through really has more darker sh*t in it and that’s why she’s spiraling and desperate. It’s going to expose her and Luke’s demented plan. I don’t think she’s scared about being dragged in the dirt about being an AP… I think she’s scared that her messed up disgusting and very illegal KINK is going to get exposed. (For those who are curious I commented it in the previous update) I know you aren’t ever going to give into her demands, SHOW NO MERCY!!!!",
      "created_utc": 1726146619.0,
      "score": 27
    },
    {
      "id": "lmrgt22",
      "body": "Holy he'll I missed the last update and I've got to go back and read it..... sounds like your going to have a good handle on this.... side note... do not let either one of them into the house again. Change tue locks. Bar the windows. Hide the laptop info. I watch and listen to a lot of true crime, and it's not out of the realm of possibility that either one of them would do something worse than a black eye. Again, good luck.",
      "created_utc": 1726147740.0,
      "score": 3
    },
    {
      "id": "lmrnwpu",
      "body": "I had a feeling Any was gonna pop up at the house and do something unhinged. \n\nI hope Tim finds his father and Amy and Luke pull their head from their asses and take accountability for all the chaos they've created. \n\nLooking forward to the next update!",
      "created_utc": 1726150278.0,
      "score": 5
    },
    {
      "id": "lmrxfqg",
      "body": "I really hope Amy was charged with assault. File for a restraining order. \n\nIm so glad you have a great lawyer. Please be cautious with your family lawyer. He may not have YOUR best interest at heart.",
      "created_utc": 1726153451.0,
      "score": 6
    },
    {
      "id": "lms9zyu",
      "body": "Skanks don’t want other people to know they’re skanks, Amy knows there is no way she makes it out of this looking good, she’ll lose the respect of almost EVERYONE. Imagine everyone in your life finding out you were the desperate side chick who FOR YEARS sat and watched their baby daddy with his real family and she was just there, desperate to lap up whatever sloppy seconds she could get from you. \nUgh. She’s trash, they both are. I say press charges and don’t back down. She’ll try to bully you again to drop the charges, so will Luke, and I wouldn’t be shocked if your in-laws also went after you to drop it all. \nDon’t let them win, drag them both thru the mud, make sure everyone knows who these people truly are. Good luck, OP.",
      "created_utc": 1726157492.0,
      "score": 6
    },
    {
      "id": "lmt3mhd",
      "body": "You know, when this is all over and done with, you should really write a book. This has best seller vibes and could make you a substantial paycheck. Change the names to protect the guilty and exorcise those demons. You’re being extremely classy about the whole situation, I’m so very impressed. I’m sure I couldn’t have handled it as well. My go to move is scorched earth.",
      "created_utc": 1726166822.0,
      "score": 4
    },
    {
      "id": "lmt8dhs",
      "body": "I don’t know if this is a real story or not but I am 100% here for any and all updates.",
      "created_utc": 1726168369.0,
      "score": 5
    },
    {
      "id": "lmtcs06",
      "body": "I stopped watching The Young and the Restless years ago, but I would happily read these types of threads daily to get my soap opera fix.",
      "created_utc": 1726169801.0,
      "score": 5
    },
    {
      "id": "lnx8r1s",
      "body": "Awww, poor Amy will have to get a JOB to support her 4 children!! Bummer! This woman is a nut-job!! She has so much to lose now that the truth has come out!! I wish I could be a fly on the wall too when Luke finds out his mistress has been cheating on him while he’s been supporting her and “his” children!! 😂. Sorry not sorry, I have to laugh! Luke and Amy’s covert life is blowing up in their faces! \nOP, Amy telling you that the “sensitive material” “isn’t your business”?! She was sleeping with your HUSBAND!! That is VERY MUCH your “business”!!! The audacity! I very much hope Cat will throw her out of that house as the truth continues to be revealed!! Now, she has an assault and battery charge to deal with too. She has very much dragged herself into it!! So stupid!!",
      "created_utc": 1726765187.0,
      "score": 5
    },
    {
      "id": "lmrwpk4",
      "body": "I see Liz is out for the Pulitzer prize for fiction 2025",
      "created_utc": 1726153214.0,
      "score": 12
    },
    {
      "id": "lmrtslm",
      "body": "I don’t know what’s worse! This “story” or the fact that so many people seem to believe that it’s real",
      "created_utc": 1726152264.0,
      "score": 18
    },
    {
      "id": "lmrqrs7",
      "body": "This is the best creative writing I’ve read on reddit. Every update is something new and salacious.",
      "created_utc": 1726151256.0,
      "score": 15
    },
    {
      "id": "lmrd918",
      "body": "God... I hope everythings is going to be okay for you.\n\nAmy is scared because she know you have her video of pornography, proof of what her and Luke have done.\n\nShe's scared for her ass and probably to tell her childs and face consequences. She's scared for her reputation... What she did just make me sure about this.\n\nYou're truly strong.. And I was hoping for an update to be sure you and your children are fine.",
      "created_utc": 1726146384.0,
      "score": 9
    },
    {
      "id": "lmrit0r",
      "body": "Very intriguing. OP, I am so happy you are handling this like a boss lady. Pls go scorch earth on that POS Amy and loser STBX husband of yours! All the best. Damn I am so invested in your story, and I am terrbily sorry that for so many years you were deceived. We are rooting for you!!!",
      "created_utc": 1726148478.0,
      "score": 5
    },
    {
      "id": "lmrq3xc",
      "body": "You know...I wonder if she tricked him into thinking the kids were his and he believed it and the DNA would destroy her lies.\n\n\nShe is also probably getting threats from her family if she really did have the affair...losing all support and inheritance can cause people to go crazy. \n\n\nThere are so many possibilities. \n\n\nI would redo the DNA though just to be sure. And just because Tom isn't doesn't mean the others aren't. \n\n\nEither way they are having an affair and that is clear.",
      "created_utc": 1726151032.0,
      "score": 4
    },
    {
      "id": "lmru61e",
      "body": "Ehhh. The part about your and husband’s attorney now representing you? \n\nYou were BOTH his clients. It’s unethical for him to represent you against him. \n\nWeird.",
      "created_utc": 1726152388.0,
      "score": 4
    },
    {
      "id": "lmrvkqt",
      "body": "I wonder if that DNA test can tell how likely it is that they are not brother and sister, but rather uncle and niece.",
      "created_utc": 1726152847.0,
      "score": 3
    },
    {
      "id": "lms43sz",
      "body": "She doesn’t want her kids knowing the truth and hating their home wrecking mother. Her kids and yours love each other. Their affair will make all the kids look at the two of them differently. And your kids forever seeing you as less than would be heartbreaking. \n\nShe doesn’t want her kids to band together and get dna tests. She obviously knows who the daddy’s are, maybe the others are also by married men 🤷‍♀️",
      "created_utc": 1726155622.0,
      "score": 5
    },
    {
      "id": "lms46qr",
      "body": "OP, have you gotten yourself tested for any STD’s? Both Amy and Luke have been cheating. You may also want to ask your lawyer about SA consent, informed consent and r**e by deception? You may be able to press charges against him as well if you want to.",
      "created_utc": 1726155648.0,
      "score": 3
    },
    {
      "id": "lms85dz",
      "body": "[deleted]",
      "created_utc": 1726156909.0,
      "score": 4
    },
    {
      "id": "lmsba6t",
      "body": "Amy is the queen of all pickmeshas. All\nHail queen A-me",
      "created_utc": 1726157900.0,
      "score": 3
    },
    {
      "id": "lmsch1j",
      "body": "She probably doesn´t want your STBX to find out that not ALL her children are his... that is my best guest. Also, I don´t think your ILs will continue to be as generous and see her in the same light, as soon as everything is confirmed. Not to mention her kids... \n\nShe might have destroyed your family, but her carefully constructed web of lies that was the basis of her life, it is about to be blown to pieces. Wonder if she will have anything left, once the dust settles.",
      "created_utc": 1726158279.0,
      "score": 4
    },
    {
      "id": "lmsdzfk",
      "body": "Could the attack also help you in your custody case? Could you ban Amy for being around your kids permanently? \n\n\nShe's desperate because now it's going to be confirmed to everyone that they have been cheating and she could lose support that she has now. Too bad, maybe she shouldn't have been a shitty person.",
      "created_utc": 1726158760.0,
      "score": 4
    },
    {
      "id": "lmsfscd",
      "body": "Why are we eager for updates?  Well, you are an incredible writer of a story.  I am going to tell you the truth, I do not know if any of this is real. I am sure you saw my previous post doubting, but your writing is incredible and sucks us all in.  You have a gift with words.  I want to slap Amy & Luke myself. lol.  What a horrible thing.  I hope once this is all over, story or not, you start writing.  You definitely have a gift for it.  Good luck and keep us updated.",
      "created_utc": 1726159327.0,
      "score": 5
    },
    {
      "id": "lmsgdmy",
      "body": ">I don't know why you guys are so eager for these updates\n\nBecause, we feel for you and we want to see everything work out in your favor. You could be anyone of our friends.\n\nI also believe it's good for you to get it out and not keep it bottled up.\n\nAmy is actually the one \"losing her mind\". She's also scared of something or someone knowing she's a homewrecker.",
      "created_utc": 1726159511.0,
      "score": 2
    },
    {
      "id": "lmsn6ae",
      "body": "amy wants you to delete evidence of her sleeping with luke and won’t tell you why. the only reason i can think of is because she has another (or multiple others) partner. maybe she’s secretly married or engaged or dating around?",
      "created_utc": 1726161621.0,
      "score": 5
    },
    {
      "id": "lmsu6q7",
      "body": "Could she be getting child support from another guy she has convinced is the father of some of her kids and that this coming out could prove he wasn't the father at all and end up with her being sued for the child support payments?",
      "created_utc": 1726163796.0,
      "score": 5
    },
    {
      "id": "lmsyow5",
      "body": "New genre coming through - creative writing with a pinch of fan fiction that finds its way in every new update, clever...",
      "created_utc": 1726165233.0,
      "score": 3
    },
    {
      "id": "lmt4sqx",
      "body": "I think she's panicking for a couple of reasons.\n\n 1. As you mentioned, your FIL is starting to doubt his son, and MIL already believed you, so now both her and her children's relationship with their grandparents are going to change drastically. \n\n2. Her and your ex have kept the fact that they're together secret from their kids for a reason, and she's probably freaking out because her children will probably turn their backs on both of them in some way. \n\n3. If your ex really wanted to be her, he would have/ could have married her at any point, and he didn't cause he doesn't actually want that. She knows that with your relationship ending, whatever she has with him, is gonna be negativity impacted, especially since his parents and kids are all mad at what he did. \n\n4. If the kids know, then that means the wider community will know at some point, and her reputation is gonna go to hell.\n\n5. She knows some of her kids aren't your exs and that its gonna come out from paternity tests from either the court or her kids taking them themselves and now all of her lies are catching up to her all at once. \n\nFinally 6. Both she and your ex are the type of ppl who want to eat their cake and have it too(?) Meaning that if they really wanted to be official, either one of them would have tried it at one point, but they didn't. Now, the house of cards she built is falling down on her, and her lies are being exposed to everyone. Bringing down the facade of the perfect life she had and burning all of her personal relationships as well. She has all to lose with your divorce and nothing to gain, which is why she has become so unhinged to try and save herself.",
      "created_utc": 1726167203.0,
      "score": 4
    },
    {
      "id": "lmtbaeq",
      "body": "If this whole faking on Reddit doesn’t pan out, you could always go and write shit for the bold and the beautiful. A+ for effort",
      "created_utc": 1726169317.0,
      "score": 4
    },
    {
      "id": "lmtwjox",
      "body": "This creative writing exercise has really gotten out of hand",
      "created_utc": 1726176087.0,
      "score": 4
    },
    {
      "id": "lmu1w2w",
      "body": "I can only speak for myself hon but I’m eager for more to hear how you are handling this all and how you’re having your Phoenix from the flames moment. You deserve to leave this marriage head high with your kids and what’s pissed me off is how much they gaslit you. \n\nI’m here for your story, f Amy and Luke.",
      "created_utc": 1726177883.0,
      "score": 5
    },
    {
      "id": "lmucyb6",
      "body": "She is maybe trying to cover for Luke.  But I’ll bet money she’s also terrified all this will result in paternity tests for her kids.  I think she’s let Luke believe they are all his, when we know at least one of them isn’t.  Her level of desperation doesn’t match just being outed in court as the other woman.",
      "created_utc": 1726181925.0,
      "score": 3
    },
    {
      "id": "lmuiitb",
      "body": "You are SO, SO smart for having the wherewithal to have cameras in the house and for recording the conversation. I know I don’t know you but I am so proud of you. You are handling one of the hardest things someone can go through with such grace and intelligence.",
      "created_utc": 1726184010.0,
      "score": 4
    },
    {
      "id": "lmuin4k",
      "body": "Is Luke old enough to get an Ancestry or similar DNA test? That might help him figure out who his father is. There are groups that will help him figure it out just based on distant cousin matches. \n\n I assume the test the kids did is a “sibling test.” Be aware there are a lot of false negatives on those for half siblings. A more complete ancestry test would be more revealing.",
      "created_utc": 1726184056.0,
      "score": 5
    },
    {
      "id": "lmuk5q9",
      "body": "Op, what is Amy's relationship with her family, and what is Amy's relationship with Luke's family?",
      "created_utc": 1726184629.0,
      "score": 4
    },
    {
      "id": "lmur1nq",
      "body": "I would have called the cops the second she wouldnt leave. She seems unhinged. Get an ro and let her know you will be subpoenaing paternity test for her children",
      "created_utc": 1726187270.0,
      "score": 5
    },
    {
      "id": "lmvc70n",
      "body": "My thoughts on amy and Luke's actions \n\n1: Tom's real father is in the know and has set parameters on her receiving money from him that includes no public drama. He is likely married or somehow related to amy or Luke.\n\n2: Luke threatened amy because he is afraid that his parents would dis-inherit him and cut off BOTh of their current funds. You said in a comment that he is pretty reliant on everyone else.\n\n3: Amy had the power and is now losing it. Some people canNOT handle losing power. Even if they go public together, they will be judged and looked down upon. \n\n4: Luke was never interested in being with her as a couple. I think he wanted his cake and eat it too. In his mind, you are his wife, and she is his mistress. That's it. I don't think he is interested in messing with this and threatened her that she goes and not you...if it came to that. He just underestimated you and overestimated himself.\n\n5: Luke's parents are more involved than you think. Having said that now that everything is out, they might still side with you, but hear me out:\nThink about it, when this is out, THEIR son and \"adopted daughter\" (for lack of a better term) destroyed the family, and how many kids? Seven? They don't want that on their reputation or the family name. I felt good about Cat at first, but she never even hinted until you came to her. Did she ever confront Luke? Surely, a mother would. She told her husband, so why not take steps....I think she did take steps and therefore is more involved than you think.",
      "created_utc": 1726195281.0,
      "score": 4
    },
    {
      "id": "lmve6a2",
      "body": " First, I am so sorry that you were in the situation. Second, I am sorry that there are people who accuse you of making this whole story up for karma on Reddit.  Now onto my thoughts about Amy and her family: you’ve said that she doesn’t have a relationship with them because they were abusive, but what proof do you have that she wasn’t lying about this? She seems like the type would make up horrible lies about her family if it was further her own agenda.",
      "created_utc": 1726196073.0,
      "score": 5
    },
    {
      "id": "ln6v2fo",
      "body": "Amy being so adamant about it not getting out that she and Luke had an affair is peculiar. As is your FIL's behavior. Are we 100% sure Luke and Amy aren't half siblings? That your FIL knows, Luke and Amy know, and that's why they didn't just get together? Maybe it's nothing, but the behaviour here is super sketchy.",
      "created_utc": 1726368984.0,
      "score": 3
    },
    {
      "id": "lnaohf8",
      "body": "“I don’t know why you guys are so eager for these updates” she says.. THIS IS A SOAP OPERA! I COME BACK FOR EVERY EPISODE!!💀",
      "created_utc": 1726428473.0,
      "score": 4
    },
    {
      "id": "lnj3x0g",
      "body": "After reading everything back to back, when OP first confronted them it seemed like Luke had kind of resigned himself to the cat being out of the bag with the DNA tests. He said yes, it was Amy that was vehemently against it. It could be a planned way of keeping Luke out of hot water by her being the one saying no. BUT what if it’s Amy that has something to hide… What if Tom was her golden ticket into the family? What if Tom happening was an oops OR a planned second family for Luke (Who Knows?!) What if Luke is under the impression that all of her children are his, but she knows that either they are not or at least knows there’s a chance some aren’t (or maybe just Tom) Guessing how messy divorce over affairs can get, maybe she is scared that it will lead to a DNA test of all children and losing Luke (and his family) over the one(s) that are not his..? \n\nTim seems to be getting absolutely wrecked by this news. He’s obviously had this fight with his wife and probably others as well that Amy and Luke are his children, brother and sister. Thinking everyone else around him were just being negative. Imagine having that mindset about two people you love and defending them anytime someone said something like this Just to find out you were the only one that believed them. I think Tim may have threatened to cut them off is he finds out this is true. Which he would if the affair made it to court with all the evidence found on his laptop. Amy seems to be behaving like a cornered animal, definitely be extra cautious.\n\nOne thing that has confused me is your lawyers being weird about you getting your evidence from his devices. At the time, they were devices in your marital home to be construed as marital property. Cops told my sister over and over again that anything inside a shared home is considered marital property, therefore her husband was free to break or do as he pleased with whatever he wanted as long as it didn’t injure anyone. She was told this multiple times by different officers. So either it’s shared marital property or everything in couples homes needs labeled and properly recorded, yk..",
      "created_utc": 1726551855.0,
      "score": 5
    },
    {
      "id": "loqwr7m",
      "body": "Hmmm I feel like Amy has someone else believing he is the father of her kids and this information would put that “income” in jeopardy. Plus maybe Tom’s Dad was also married 🤷🏽‍♀️",
      "created_utc": 1727209151.0,
      "score": 4
    },
    {
      "id": "lmus26x",
      "body": "Amy might have another man on the hook for money also. At least one of her children is Luke’s. \n\nDid she tell someone else they are the father and is she collecting money to “stay away” from him and his family. She may be double dipping on funds. \n\nShe may be collecting twice as much. \n\nMy ex husband paid child support for a child for 5 years. He went to court for custody, a paternity test was ordered as standard, we had no suspicions. He was NOT the father. It was also exposed in court, another man was paying child support. She was collecting money for one child from two men! No, he wasn’t the father either. Turned out was his friend’s child. Sad all the way around.\n\nThe judge said to file fraud charges with the State’s attorney’s office. We did. She skipped off to another state, the child went to the bio father.",
      "created_utc": 1726187655.0,
      "score": 10
    },
    {
      "id": "lmrhzq2",
      "body": "Ooh I had not considered this angle! How interesting. Another poster said they thought Amy might be so insistent that she be left out of everything because the in laws will cut her off, and I still think that’s a strong possibility but even more so if the kids aren’t actually Luke’s.",
      "created_utc": 1726148181.0,
      "score": 2274
    },
    {
      "id": "lmrk4bm",
      "body": "Amy having another long term man fathering some of the children without his knowledge was also my thought.\n\nEdit for typo",
      "created_utc": 1726148953.0,
      "score": 203
    },
    {
      "id": "lmrosxb",
      "body": "Imagine none of Amy's kids are his, now that would be a real hell of a twist.",
      "created_utc": 1726150585.0,
      "score": 196
    },
    {
      "id": "lmt7eve",
      "body": "[deleted]",
      "created_utc": 1726168054.0,
      "score": 28
    },
    {
      "id": "lmsz5zx",
      "body": "That was my first thought reading this update. Luke likely believes Tom is his son. Luke didn’t want the test because he thought the results would reveal he was the dad, and Amy didn’t want the test because she didn’t want Luke to know he might not be. \n\nSo now he gets to find out that his AP will likely end up with charges against her, and that she was sleeping around. \n\nAnd she also may have been lying to him about the other kids. While they reference him being the father, they don’t really know for certain, do they? Will definitely be called into question once he hears about Tom.",
      "created_utc": 1726165385.0,
      "score": 11
    },
    {
      "id": "lmtcdqt",
      "body": "Amy and  Luke are in for a major comeuppance.  The older children will want nothing to do with them. Same likely with the younger,  as they get older\n And OP, DO NOTHING TO SAVE THEIR INTEGRITY/REPUTATION IN THE COMMUNITY. \n\nPeople ask, be honest. Let them wallow in the morass they created. There's a place in hell reserved for the two of them.",
      "created_utc": 1726169672.0,
      "score": 9
    },
    {
      "id": "lmtnchr",
      "body": "Since we know that Luke isn't his, I would wonder about the remaining three. Any one of those three could easily be his. Too bad, they can't be DNA tested too.",
      "created_utc": 1726173181.0,
      "score": 8
    },
    {
      "id": "lmuc84z",
      "body": "Omg. I hadn’t thought of that. \n\nAmy is terrified that Luke will find out the kids ARE NOT his. \n\nJesus. \n\nI so need to know the results of the other kids.",
      "created_utc": 1726181652.0,
      "score": 4
    },
    {
      "id": "lmsvwle",
      "body": "Oh yea !! I didn’t think of this angle. And the fact she was always helped throughout the years by Luke and OP. She will end up losing her “cash flow”",
      "created_utc": 1726164340.0,
      "score": 6
    },
    {
      "id": "lmu9rir",
      "body": "Or she has someone else thinking they are the father and if they find out Luke is of at least the one she might lose a meal ticket.  Maybe a married man that doesn't want it known he fathered kids outside of his marriage and was willing to pay to keep it quiet.",
      "created_utc": 1726180717.0,
      "score": 5
    },
    {
      "id": "lmrb0uo",
      "body": "I could see that being the case.",
      "created_utc": 1726145511.0,
      "score": 887
    },
    {
      "id": "lms9gco",
      "body": "There’s someone specific she doesn’t want knowing about Luke. Another married man she’s been sleeping with for years? An ex? The elusive other baby daddy? It’s not just “everyone” she doesn’t want knowing. For that level of unease and fear she has a detailed scenario in mind that she’s terrified will play out. Not just a generalised fear of her life imploding, although I’m sure that’s there too. \n\n“It’s not about you” “this is very important”. OP constantly mentioning how panicked Amy was. If this was fiction I’d say this was bread-crumbing, setting us up for the next chapter by gently leading us to where it’s revealed that Amy has a secret life and is married and her husband has been led to believe Luke was her brother or something for all these years.  \n\nI really hope this is fiction, for OPs sake, and if it’s not, I absolutely feel for her. Reality can be stranger than fiction and this certainly fits that bill. All the best OP. I’ll be keeping an eye out for the next update. Stay safe.",
      "created_utc": 1726157321.0,
      "score": 108
    },
    {
      "id": "lmsme2n",
      "body": "This was going to be my comment, I think the financial support from his parents is what she's worried about here. \n\nPlot twist, Amy is Luke's half-sister and they have no idea, neither does Cat....👀\nDad took in a stray (Amy) because she's his. Dad can't believe they'd get together and is in complete denial about the incest that he could have prevented.",
      "created_utc": 1726161378.0,
      "score": 39
    },
    {
      "id": "lmsr7tx",
      "body": "Or she's having a second affair with Luke's dad 🤣",
      "created_utc": 1726162874.0,
      "score": 5
    },
    {
      "id": "lmrf1bi",
      "body": "And a ciggy, but I gave them up lol",
      "created_utc": 1726147073.0,
      "score": 122
    },
    {
      "id": "lms2js0",
      "body": "I’ll join you with a drink and have a ciggy for all of us.",
      "created_utc": 1726155119.0,
      "score": 38
    },
    {
      "id": "lmu08qf",
      "body": "Let’s crack one open together!! I live for these updates!",
      "created_utc": 1726177319.0,
      "score": 4
    },
    {
      "id": "lmrkq2k",
      "body": "OMG! COULD BE IT LOL AMY IS CHEATING ON LUKE BUT ALSO CHEATING WITH HIM!",
      "created_utc": 1726149168.0,
      "score": 361
    },
    {
      "id": "lmtkjz9",
      "body": "I'm with you on this one,  she's not only afraid her kids will find out but also all the baby daddies will find out too.",
      "created_utc": 1726172293.0,
      "score": 8
    },
    {
      "id": "lmsljdy",
      "body": "I think this might be it",
      "created_utc": 1726161115.0,
      "score": 6
    },
    {
      "id": "lmsmbtg",
      "body": "That's what I think too!",
      "created_utc": 1726161360.0,
      "score": 4
    },
    {
      "id": "lmrilnb",
      "body": "After reading some of these comments, my two cents is that she had convinced Luke all her kids were his, and at least one of them is not. I also think she fears being cut off financially by Luke’s parents, but I think that’s even more probable if the kids aren’t actually his.",
      "created_utc": 1726148404.0,
      "score": 372
    },
    {
      "id": "lmrh5va",
      "body": "She doesn’t want him to know she’s been cheating on him since he probably thinks he’s the father of her kids.",
      "created_utc": 1726147873.0,
      "score": 123
    },
    {
      "id": "lmsnkkl",
      "body": "Sounds like Amy is collecting child support from someone else who didn’t get a paternity test.",
      "created_utc": 1726161743.0,
      "score": 30
    },
    {
      "id": "lmrnm9m",
      "body": "She’s probably terrified of her homemade pornos getting out, which is a valid concern. Even if she is an absolutely disgusting homewrecker, no one wants revenge porn. That said, the way she dealt with it is completely insane and I hope OP presses charges and does not relent whatsoever. I wouldn’t want that woman anywhere near my children if I were her",
      "created_utc": 1726150177.0,
      "score": 56
    },
    {
      "id": "lmuunjn",
      "body": "She probably remembers all of the intimate photos and videos she/they took and is worried they may be shared/talked about. That would be embarrassing for friends, family and community to learn of. I mean, she took at least one video of herself masterbating and sent it to a man she told everyone was a “brother.”",
      "created_utc": 1726188620.0,
      "score": 6
    },
    {
      "id": "lmraufe",
      "body": "Shit, you're right, better fix that lol. My brain is still frazzled.",
      "created_utc": 1726145440.0,
      "score": 588
    },
    {
      "id": "lmrh648",
      "body": "GRRM had a big list of all characters in his fictional stories to stop himself from mistaking two characters",
      "created_utc": 1726147875.0,
      "score": 160
    },
    {
      "id": "lmrfdto",
      "body": "I know what you mean but I don't feel bad though. I just feel like we are all listening and hopefully encouraging her to keep going and believe in her own strength to get through this mess she was put into. Except for the few that have nothing better to do than argue that it's fake.",
      "created_utc": 1726147204.0,
      "score": 53
    },
    {
      "id": "lmsafrs",
      "body": "Me too. OP, you are handling yourself so well. You are the hero and all of us want downfall of luke and amy in the biggest possible way.",
      "created_utc": 1726157633.0,
      "score": 3
    },
    {
      "id": "lmreen6",
      "body": "That would be nice, wouldn't it? I feel like that's somewhat out of my hands, though.",
      "created_utc": 1726146834.0,
      "score": 86
    },
    {
      "id": "lmtulj6",
      "body": "This is my guess. She’s convinced Luke that Tom is his son, and if that comes out it will be hell, also if her name and evidence it was her comes up in trial her other partner(s) who fathers at least one of her other kids will find out. She’s probably got a serious gravy train running right now and if it comes out that she has had multiple partners and all the others don’t know, it will dry up and she will be super eff’d. I mean, she basically sealed her fate when she attacked OP.",
      "created_utc": 1726175461.0,
      "score": 11
    },
    {
      "id": "lmutffs",
      "body": "I wouldn't be surprised if she's been double dipping so to say. collecting child support on her children from two men. Luke and whoever she has on the side and that child support is a lot more than what she'd get through courts. Especially if Tom's father has a marriage of his own that he doesn't want blown up by Tom's existence. I suspect that she doesn't want to work. she knows she won't be able to get a job anywhere good with no working history. She's realized she's about to lose her meal ticket and that will drive people insane. She's also been in control of the narrative between her and Luke for so long. she doesn't have any of the responsibilities of being the official wife and that is so much easier especially amongst these yuppie families. she gets to play single woman and Luke can't say a word about it unless he wants the affair exposed.",
      "created_utc": 1726188167.0,
      "score": 4
    },
    {
      "id": "lmrf8m5",
      "body": "One of the first things I did! But thank you for thinking of it, kind stranger.",
      "created_utc": 1726147151.0,
      "score": 268
    },
    {
      "id": "lmrib1b",
      "body": "She's not in contact with her family and hasn't been for many years. They abused her. Luke's family became her family. \n\nShe never actually admitted to having an affair, actually. I noticed that too.",
      "created_utc": 1726148295.0,
      "score": 115
    },
    {
      "id": "lmsjvtc",
      "body": "Maybe Amy and Luke killed Tom's dad and buried him somewhere and details are in the laptop. Thinking a bit out of the box here but it does seem like there are details on the laptop that reveal more than the affair. At least Tom and Sophie can date now if they want! Best wishes, OP, and keep the updates coming!",
      "created_utc": 1726160595.0,
      "score": 25
    },
    {
      "id": "lmrds29",
      "body": "Literally just one of the over-the-counter paternity tests you can buy at a drugstore. If it gets to the point of having tests done in court, those are likely to be more reliable. \n\nOh you read my mind, kind stranger, that's exactly what I want to do. Laptop is likely to just be small claims court but it's another charge on the pile.",
      "created_utc": 1726146591.0,
      "score": 259
    },
    {
      "id": "lmre12u",
      "body": "Maybe, though I don't see how neither of us would know about it. Between Luke and I, we spent a lot of time with her. \n\nShe does work, but also got support from our family.",
      "created_utc": 1726146688.0,
      "score": 122
    },
    {
      "id": "lmrj8qo",
      "body": "I sent word to Cat. As far as I know, Amy hasn't been arrested.",
      "created_utc": 1726148637.0,
      "score": 83
    },
    {
      "id": "lmv8tm8",
      "body": "I think you're probably right about that!",
      "created_utc": 1726193999.0,
      "score": 34
    },
    {
      "id": "lmrcvhw",
      "body": "Way ahead of you.",
      "created_utc": 1726146235.0,
      "score": 93
    },
    {
      "id": "lmrfeuf",
      "body": "Just Luke, at least that I've seen. But Amy spent most of her time with \"our\" family, so if she did have another man that fathered Tom, I have to assume he's long gone.",
      "created_utc": 1726147215.0,
      "score": 84
    },
    {
      "id": "lmrexa2",
      "body": "I expect another unhinged plot twist.",
      "created_utc": 1726147030.0,
      "score": 71
    },
    {
      "id": "lmrgbt6",
      "body": "I'm wondering if she's two timing luke with someone else who wants to keep it quiet and thinks all the kids are his 👀 maybe he's even paying a hefty fee for her silence\n\nOohh the suspense!!",
      "created_utc": 1726147561.0,
      "score": 33
    },
    {
      "id": "lmv2zim",
      "body": "1: Thank you. It does mean a lot to me. \n\n2: I guess it could be from the outside. From the inside I just feel numb.",
      "created_utc": 1726191776.0,
      "score": 22
    },
    {
      "id": "lnhime5",
      "body": "He had his reasons.",
      "created_utc": 1726527871.0,
      "score": 37
    },
    {
      "id": "lmrdj5t",
      "body": "Not that I saw, and I don't have it anymore, but that's an intriguing thought.",
      "created_utc": 1726146494.0,
      "score": 105
    },
    {
      "id": "lmrkqt0",
      "body": "It seems more and more plausible with each update that something illegal/immoral is going on with Amy, and perhaps Luke, and that’s why they’re scared and desperate for OP to delete everything. The paternity of at least Kaylee will come out in the divorce proceedings, so, if Amy doesn’t want that to happen, they have to say why at this point. \n\nWhy are they so scared of that material being presented at court? Embarrassment doesn’t seem to explain the extreme behavior, assault, destruction of property, and the vague but dire warnings.",
      "created_utc": 1726149176.0,
      "score": 46
    },
    {
      "id": "lmrh1ul",
      "body": "I wonder about that too.  A comment on one of the other posts noted that Amy has been receiving money from Luke an his parents and she's probably not reported it as income.   She also manages a bar, a situation rife with tax evasion/money laundering possibilities.",
      "created_utc": 1726147830.0,
      "score": 28
    },
    {
      "id": "lmscmx9",
      "body": "I don't understand why Amy went after the OP's laptop.  It was Luke's laptop that contained the problematic material.  If she thought the OP copied something, it would still be available to the OP through backups or whatever.   I understand she doesn't know that the material was actually copied elsewhere but it makes no sense.   It's too bad Paige didn't just clone his disk and cloud.",
      "created_utc": 1726158330.0,
      "score": 5
    },
    {
      "id": "lmrh2ip",
      "body": "Oh Amy you silly sausage!",
      "created_utc": 1726147837.0,
      "score": 31
    },
    {
      "id": "lmswos7",
      "body": "This is exactly what I think too.  She played Tom. He’s stupid and I think he still loves his wife but is trapped with Amy.  He got caught in it all and there was no way out.  Wonder if he liked someone taking control and that made it easier for Amy to take over and him to be drawn in? Either way they’ve know each other for ever so she knew what strings to pull to get her way.",
      "created_utc": 1726164591.0,
      "score": 8
    },
    {
      "id": "lmvfyer",
      "body": "Since I’m sharing my speculations I’ll add a few more thoughts. From a common sense perspective it would have been a much easier thing to leave the OP when she got pregnant with their first child together…if Luke truly loved Amy. I have no doubt Amy pushed for that originally.\n\nHowever, I think a combination of factors kept that from happening. 1. His shame from his horrible behavior. 2. His fear of his parent’s response. Emotionally he was fearful because he doesn’t want to face them being disappointed in him. Financially he was fearful because he and Amy need the parents to keep funneling money their way. They aren’t high earners and will struggle if funds are cut off or reduced. (These two things would be a fear for Amy as well.) 3. OP shared that Luke has a serious condition that has had significant impact on his life in a negative way. I think this affair did something for him emotionally. He liked having two women vying for his attention. 4. OP is the highest earner in this situation. Which is something I think he simultaneously wants and also deeply resents. This affair gave him an outlet to “get back” at her. 5. Luke and Amy’s mutual addiction to the “thrill” of it. Over time I think they both started growing a strong kink for the forbidden factor of it. It fed their sexual energy to have to keep this hidden. 6. At some level he does/did have some form of feelings for the OP. I have no doubt Amy tried to take her relationship with Luke to an intimate place of ongoing sexual and emotional connection many times before it actually happened. He resisted for a reason. 7. After having kids together, and never telling the kids the identity of their father, it became imperative to go all in on keeping this secret. They have to know the kids will be deeply wounded by the fact that their father has been right in front of their faces this whole time yet has never claimed them. 8. He’s a weak man. Led by his penis and unable to take ownership for any of his actions.\n\nPoint 8 leads me to the thought that he is going to push the “she is crazy” angle with passion. In his mind he NEEDS the OP to be the villain in this story. Because he can then tell himself he’s a hero for sticking with her for as long as he has and there’s a “real” reason he “had” to have an affair. He is desperate for an excuse for his awful actions.\n\nWhile I do think Luke would adamantly proclaim to “love” the OP AND “love” Amy AND “love” all of his kids from both women, ultimately, I don’t think Luke loves anyone more than he loves himself.\n\nHe’s selfish and she’s the queen of manipulation/deceit. A deadly combination ",
      "created_utc": 1726196810.0,
      "score": 5
    },
    {
      "id": "lmsv67t",
      "body": "This would also play into her explaining in the last update that Jim and Amy are white and Cat and Luke aren’t.  Or she could have just told us that because people were asking.  The earlier updates she just said the children were biracial and didn’t really say which way it skewed. And we really didn’t need to have it clarified.",
      "created_utc": 1726164104.0,
      "score": 6
    },
    {
      "id": "lmrvkaa",
      "body": "Where do you get butterscotch popcorn... Two of my favorite things!!!",
      "created_utc": 1726152843.0,
      "score": 3
    },
    {
      "id": "lmrjjs9",
      "body": "Eh, seemed like a professional rivalry forming more than anything. \n\nBut thank you, commenter, you are very kind.",
      "created_utc": 1726148749.0,
      "score": 51
    },
    {
      "id": "lmu94wc",
      "body": "OP said it's because Paige works in the grey. But let's be real I would rather a lawyer that works in the grey on my side of a court case than against me ",
      "created_utc": 1726180478.0,
      "score": 5
    },
    {
      "id": "lmv9p8x",
      "body": "Glad to know I'm not alone.",
      "created_utc": 1726194319.0,
      "score": 24
    },
    {
      "id": "lnj6gp8",
      "body": "I spent a very long time wondering that. \n\nThank you for your kindness.",
      "created_utc": 1726553467.0,
      "score": 30
    },
    {
      "id": "lmv75h9",
      "body": "From what I've seen, they really do love each other. A lot. And it stings.",
      "created_utc": 1726193368.0,
      "score": 31
    },
    {
      "id": "lmvc34i",
      "body": "But then why wouldn’t Luke and Amy just marry each other? That’s really the biggest mystery in this whole thing.",
      "created_utc": 1726195238.0,
      "score": 19
    },
    {
      "id": "lmv3r82",
      "body": "I had not considered that. I suppose in a pinch, she might be willing to do that.",
      "created_utc": 1726192070.0,
      "score": 21
    },
    {
      "id": "lnhhclz",
      "body": "Kaylee, yes, and Tom as well. \n\nTo be honest, the way he treated her, in hindsight, was over the line. I kind of brushed it off in the moment because childbirth is emotional, but now knowing the truth I can see things more clearly.",
      "created_utc": 1726527397.0,
      "score": 50
    },
    {
      "id": "lng511m",
      "body": "Good question!",
      "created_utc": 1726511375.0,
      "score": 6
    },
    {
      "id": "lmv4xi6",
      "body": "I would assume he is but now I'm questioning whether or not he's Tom's father so I don't know.\n\nI'm braced for it.",
      "created_utc": 1726192520.0,
      "score": 25
    },
    {
      "id": "lmrkllm",
      "body": "Unless she and Luke really are poly, unless he's fully aware of this and okay with it, I don't see how that works. And I don't see how I wouldn't have been aware, either. There's no way she spent enough time with this guy for it to be a real relationship, if he does exist.",
      "created_utc": 1726149124.0,
      "score": 68
    },
    {
      "id": "lmszv3y",
      "body": "Luke almost certainly fathered the girl with the same rare severe allergy.  But she may be concerned that he  might not be the father of all her kids.  It looks like he is not the father of Tom, but he may already know that.  The affair might not have started until later.\n\nThat said, I wouldn’t set much store in the results of an over the counter dna test.  It would have been better for them to use 23 and me.",
      "created_utc": 1726165608.0,
      "score": 4
    },
    {
      "id": "lmv8pl5",
      "body": "It may just be the confirmation about Kaylee, but I already suspected that and accused them. She seemed more focused on the affair so perhaps it was the porn? Maybe she thought I'd like, send that to everyone in her social circle. Obviously I wouldn't, but maybe she doesn't know that. \n\nAmy's family is not in the picture.\n\nFar as I know, Amy owns the bar herself. But Jim did give her money to help start it up. \n\nIt was a pretty cheap test, and someone also suggested that maybe Cat sabotaged it or lied. I'm still not sure about Tom's paternity tbh \n\nI'm all over the cameras and everything else. Mama bear mode has activated.",
      "created_utc": 1726193963.0,
      "score": 45
    },
    {
      "id": "lmuzmk3",
      "body": "I don't know that she necessarily was saying that she wanted me to divorce Luke, but she REALLY didn't want me to say they were having an affair.",
      "created_utc": 1726190510.0,
      "score": 32
    },
    {
      "id": "lmv8uhy",
      "body": "Ohhhhh there might be stipulations in Cat & her husbands will as far as what’s left to like when he passes. Like if he isn’t faithful he looses out & it might be the same for Amy if she’s in there too. But I feel like Cat would have said something like “Luke & Amy really screwed themselves over by being together unfaithfully.”",
      "created_utc": 1726194007.0,
      "score": 4
    },
    {
      "id": "lmvafht",
      "body": "I've actually been talking to Zack today and he agreed it -could- be dicey for *either* of them to represent me. He's given me the contact details for another attorney he knows/approves of, and I'm going to meet with her and see how it feels.",
      "created_utc": 1726194591.0,
      "score": 47
    },
    {
      "id": "lmv0zlx",
      "body": "It varied. Sometimes as often as once or twice a week, sometimes it would be more like once every few weeks. Occasionally, I came over myself. Sometimes, she would come over to our place. \n\nHe was affectionate with her but (usually) nothing that raised my alarm bells. He was also affectionate with me, seemingly more so than with her.",
      "created_utc": 1726191014.0,
      "score": 25
    },
    {
      "id": "lmrd4gx",
      "body": "Having more than one attorney is definitely a thing. \n\nThe trouble is, if Luke gets unsupervised access to the kids, so does Amy.",
      "created_utc": 1726146334.0,
      "score": 139
    },
    {
      "id": "lmv4tye",
      "body": "I don't know what she thought was going to happen or why it would break her way.",
      "created_utc": 1726192482.0,
      "score": 22
    },
    {
      "id": "lmrls12",
      "body": "The idea that someone would actually consult a lawyer about posting this on Reddit, and that the lawyer would say that it’s a good thing OP did, in order to document their “sanity”, is just so ridiculously dumb - it’s hilarious. But, this is just some mindless and quick entertainment. 🤷🏻‍♀️",
      "created_utc": 1726149537.0,
      "score": 91
    },
    {
      "id": "lmsgvoq",
      "body": "Definitely fake. Who the hell would be okay with their husband and his parents financially supporting another woman? Best friend or not. It’s also overly-detailed which fake stories always are. It’s entertaining, but certainly fake.",
      "created_utc": 1726159668.0,
      "score": 42
    },
    {
      "id": "lmrhh0s",
      "body": "This is the most entertaining story I’ve read recently. Who cares if it’s fake! It’s good and I’m hooked.",
      "created_utc": 1726147988.0,
      "score": 128
    },
    {
      "id": "lmrngkf",
      "body": "I think people are more entertained, like watching your favourite soap opera on tv!",
      "created_utc": 1726150122.0,
      "score": 17
    },
    {
      "id": "lmrhbpk",
      "body": "I guess it’s entertaining for some people regardless of the reality of it. It’s obviously fake from the way it’s written",
      "created_utc": 1726147932.0,
      "score": 57
    },
    {
      "id": "lmrlix6",
      "body": "I love it. lol",
      "created_utc": 1726149447.0,
      "score": 15
    },
    {
      "id": "lmssefk",
      "body": "Yeah, what the hell? If anyone was in this situation there's no way in hell they'd be narrating the whole thing on reddit replying chipperly to comments",
      "created_utc": 1726163244.0,
      "score": 13
    },
    {
      "id": "lmv6tn1",
      "body": "This story appears to be a work of fiction for several reasons:\n\n1. **Highly Dramatic and Complex Plot**: The narrative includes multiple plot twists—secret affairs spanning years, hidden paternity, legal maneuvers, physical altercations, and surprise DNA test results. The series of events feels designed to continually escalate tension and surprise, which is characteristic of fictional storytelling rather than real life.\n\n2. **Stereotypical Characters and Reactions**: The characters in the story—like the best friend who turns out to be the antagonist, the loyal but conflicted family lawyer, and the protagonist navigating through one dramatic revelation after another—are archetypal and behave in ways that fit neatly into familiar drama or soap opera tropes. Their actions seem exaggerated and less nuanced than what you would expect from real people in such a complex situation.\n\n3. **Narrative Pacing and Structure**: The updates are structured like chapters in a novel, with cliffhangers, emotional peaks, and well-timed revelations to maintain reader interest. The OP's writing style is highly polished and detailed, with a strong sense of storytelling rhythm, which suggests a fictional narrative crafted for entertainment.\n\n4. **Unlikely Legal and Logistical Scenarios**: Several aspects of the story, like the quick and easy acquisition of multiple lawyers (including \"poaching\" a family attorney), the presence of incriminating evidence on a laptop that no one thinks to secure or delete, and a sudden violent confrontation with OP's \"best friend,\" strain credibility. Real-life legal proceedings are often slower, more mundane, and less dramatic than portrayed.\n\n5. **Overly Convenient Details**: Key pieces of evidence, like the DNA test or security camera footage, appear at just the right moment to advance the plot. The inclusion of a physical altercation caught on camera feels overly convenient for both narrative purposes and legal strategy, creating a tidy path for OP to continue her case.\n\n6. **Over-the-Top Conflicts and Escalations**: The confrontation between OP and Amy, which escalates into a physical fight over a laptop, feels contrived and melodramatic. In reality, such a confrontation would likely be less theatrical, and there are usually more consequences to publicizing details of ongoing legal disputes.\n\nThese elements combine to suggest that the story was crafted to entertain and engage readers, rather than to relay real-life events.",
      "created_utc": 1726193253.0,
      "score": 8
    },
    {
      "id": "lmss737",
      "body": "It's literally just an amalgam of an episode of Law & Order and House.",
      "created_utc": 1726163181.0,
      "score": 6
    },
    {
      "id": "lmt7rgq",
      "body": "It reminds me of a similarly written post about a bridezilla and a bridesmaid was giving updates. There were about 5 updates and then OP confessed it was fictional.",
      "created_utc": 1726168169.0,
      "score": 5
    },
    {
      "id": "lmv7lkk",
      "body": "They do say life is stranger than fiction.",
      "created_utc": 1726193532.0,
      "score": 14
    },
    {
      "id": "lmv2pry",
      "body": "I don't even know why she'd need another man to string along. We were supporting her and so were Luke's parents. The risk of adding someone else into the mix wouldn't be worth the payout.",
      "created_utc": 1726191672.0,
      "score": 15
    },
    {
      "id": "lmv1hht",
      "body": "Luke pretty much isn't self sufficient in general. Which isn't entirely his fault, he has health issues that prevented him from pursuing the career he would have wanted. \n\nI wouldn't be surprised if this wasn't at least partially about the money. \n\nThe more I listen to Luke's voicemails, the more I find him pathetic more than frightening, but he is a masterful actor, so who even knows.",
      "created_utc": 1726191203.0,
      "score": 40
    },
    {
      "id": "lmv0dff",
      "body": "Luke would have to have been in on it, there's no way she kept it from both of us.",
      "created_utc": 1726190781.0,
      "score": 12
    },
    {
      "id": "lmv046g",
      "body": "I don't see how. I mean, unofficially, sure. But officially, that would conflict with our own marriage.",
      "created_utc": 1726190685.0,
      "score": 16
    },
    {
      "id": "lmv0aw0",
      "body": "Sophie and Tom are pretty much texting nonstep. \n\nI don't believe Amy would hurt her own children, but then again, I don't really know her, I only thought I did.",
      "created_utc": 1726190755.0,
      "score": 20
    },
    {
      "id": "lmrjt79",
      "body": "Something like Jim being Tom's father? What if that's true, he could hardly have objected if she got with Luke. It's the one thing that would truly implode her world. Cat would cut her off so fast it would make her head spin. Luke would be disgusted and probably want nothing to do with her and the money she was getting from the family might disappear or she would have to fight them in court for child support.",
      "created_utc": 1726148843.0,
      "score": 5
    },
    {
      "id": "lmrmv97",
      "body": "Or do one through ancestry or 23 & me to see who he is linked to via dna. He is old enough that he does not require his parents consent.",
      "created_utc": 1726149918.0,
      "score": 8
    },
    {
      "id": "lmrqc2w",
      "body": "Same, even if this might not be real, i love reading it😂",
      "created_utc": 1726151109.0,
      "score": 13
    },
    {
      "id": "lmrxob4",
      "body": "I’ve been ignoring the series up till now, thinking it was fake halfway through the first one. Is it worth getting into anyway?\n\nSide note, it’s hilarious seeing people writing first person advice to the heroine genuinely believing this all to be real after 5 posts💀",
      "created_utc": 1726153530.0,
      "score": 15
    },
    {
      "id": "lmry1yi",
      "body": "Wouldn’t that have come up in the DNA test between Tom and Sophie, though? If Tom is Amy’s, Sophie is Luke’s, and Amy and Luke are Jim’s, Tom and Sophie would’ve come out as second-cousins or something.",
      "created_utc": 1726153654.0,
      "score": 7
    },
    {
      "id": "lmv1swu",
      "body": "I need to go through more of the letters, there are probably answers in them. It just hurts.",
      "created_utc": 1726191322.0,
      "score": 26
    },
    {
      "id": "lmv24oy",
      "body": "Technically I haven't seen proof that they were involved as teenagers. It might be there, but I haven't wanted to look too deeply. \n\nAmy's relationship with her original family was god awful, they were monsters from what I heard. I don't know what the family's position was on Luke, Jim, or Cat. But Amy hasn't been in contact with her family in decades so I don't know why it would matter now.",
      "created_utc": 1726191449.0,
      "score": 21
    },
    {
      "id": "lmre835",
      "body": "Nah, he's an idiot, but not a guilty one. \n\nHah, I guess they could. He's still too old for her though :/",
      "created_utc": 1726146764.0,
      "score": 60
    },
    {
      "id": "lmrmx2h",
      "body": "I went and checked your comment history, and them having the kids just hoping for accidental incest is way too far of a reach to be realistic to me.\n\nI think it's way more realistic what someone else here wrote, that if Jim and Cat sees the evidence of the affair they'll stop supporting her financially. Amy might also just be freaking out that the kids might see it.\n\nSure, there might be some other stuff OP didn't see, but planning for their kids to hook up several years down the line? Nah... if they did they would have just been OK with them dating",
      "created_utc": 1726149935.0,
      "score": 19
    },
    {
      "id": "lmri67s",
      "body": "I’m not trying to push propaganda, just every time I think about my ex or see stuff that remotely reminds me of what I saw and ended up learning, I get so angry and disgusted. Like WHY would you do that shit? Anyways hopefully I’m wrong, but they still should have been more adamantly against the possibility of a relationship between the kids.",
      "created_utc": 1726148246.0,
      "score": 7
    },
    {
      "id": "lmv1nux",
      "body": "Thank you, sweet stranger.",
      "created_utc": 1726191268.0,
      "score": 5
    },
    {
      "id": "lmv1m7t",
      "body": "We'll likely have tests done on all the children in due course.",
      "created_utc": 1726191250.0,
      "score": 14
    },
    {
      "id": "lmv15ny",
      "body": "Her relationship with her family is nonexistent and very much traumatic. She was abused by her father and her mother allowed it to happen. That's about the extent of what I know. \n\nJim and Cat treated her like one of their own and she's always been very fond of them from what I could tell. I think she viewed them as her parents even more than they viewed her as a daughter.",
      "created_utc": 1726191077.0,
      "score": 18
    },
    {
      "id": "lnjf350",
      "body": "Holy cow, A+ plot summary and analysis. You covered this like an investigative reporter. Bringing in Tim's support and marital home we're the chef's 💋 SWAK❣️",
      "created_utc": 1726559408.0,
      "score": 4
    },
    {
      "id": "lmuzuel",
      "body": "Kaylee is definitely Luke's. As for the others, I don't know.",
      "created_utc": 1726190590.0,
      "score": 26
    },
    {
      "id": "lmrmt14",
      "body": "Sweet life. Amy has buy herself a house with these peoples help and receives regular financial support every month. She has hooked a sick man, who struggles to leave the house (according to one of OP's comments), and made him her puppet. Even if Luke suspects something, he can't confront Amy, because if he does, Amy could spill everything. \n\nShe's been in the control of narrative until now, and suddenly the whole world she's built is going to be turned upside down. I think that's why she's freaking out. There's also being humiliated, yes, but she can always leave the city she lives in. Hell, even the country! But as long as the children are the grandchildren of this rich family. But if they're not, she's fucked.",
      "created_utc": 1726149896.0,
      "score": 1071
    },
    {
      "id": "lmrqgoq",
      "body": "Could also be that she’s getting benefits or child support for some of the kids from another source and that’s going to dry up as well.",
      "created_utc": 1726151152.0,
      "score": 237
    },
    {
      "id": "lmskfhn",
      "body": "I'm kind of wondering if maybe Luke and Amy had an agreement? Like she wanted to be a mother, but wanted to do it alone. Like a screwed up donar situation. Maybe she needed to have kids to stay in a will or something? It all sounds so wacky that maybe there's some weird \"logic\" here. Or, maybe she doesn't want a commitment, and get the financial and emotional support from Luke and his family. She doesn't want to lose her meal ticket. I bet that there will be more paternity questions from Luke's family.",
      "created_utc": 1726160766.0,
      "score": 62
    },
    {
      "id": "lmszs08",
      "body": "Possibly, but for sure OP would have revealed why they were getting divorced either way, no matter if it came up in the courts or not. \n\nPretty certain she just doesn’t want to be brought up in court because the judge may request her children are tested, and she doesn’t want Luke to know the truth That he’s been paying for at least one kid that wasn’t his.",
      "created_utc": 1726165580.0,
      "score": 47
    },
    {
      "id": "lmsmq7c",
      "body": "I wonder if Luke's family lives in the same town or close to, she could be messing around with someone from his family side for Amy's kids to look like him, imagine her messing around with Luke's male side of the family..so desperate Amy.",
      "created_utc": 1726161483.0,
      "score": 32
    },
    {
      "id": "lmtail9",
      "body": "Nah, I disagree. The MIL specifically said they’ve been supporting Amy BECAUSE they suspected her kids were their grandkids. They aren’t going to cut her off. She has other motives. They’re even more sinister. I don’t know exactly what they are… but they’re sinister.",
      "created_utc": 1726169068.0,
      "score": 23
    },
    {
      "id": "lmtbato",
      "body": "I think Luke was with Amy way before his wife and way before cell phones. Now I think Amy always knew about it being a triad. I think Luke broke it off with Amy many times and Amy wanted him so bad she cheated on Luke or just fucked around to get back at him. Luke not being the father of the first child is 100% not something he knows. One of his parents knows way more than they are leading on and that's why there was so much support for her as a \"single mom best friend forever\".  Amy gets a bay she is more special. Phy gets a baby... Amy needs one more baby... 100% Amy has one BAKING AS WE DOOM SCROLL!",
      "created_utc": 1726169321.0,
      "score": 17
    },
    {
      "id": "lmsto1l",
      "body": "Real or not I feel like we’re being set up\nto find out Luke’s father is the baby daddy and that’s why she is trying to hush up the Luke affair or maybe I just spend too much time on Reddit!",
      "created_utc": 1726163635.0,
      "score": 11
    },
    {
      "id": "lmuoyod",
      "body": ">Another poster said they thought Amy might be so insistent that she be left out of everything because the in laws will cut her o\n\nAh, yes! This is the one.\nExplains her inability to answer. What's she going to say, 'because I want free money and to keep duping the people who support me'?",
      "created_utc": 1726186476.0,
      "score": 4
    },
    {
      "id": "lmsmxuc",
      "body": "Which is why she is so mad about the thought of the affair being revealed",
      "created_utc": 1726161548.0,
      "score": 59
    },
    {
      "id": "lmrq777",
      "body": "Ugh! It would be fucking perfect! But at least one of them is his, because of the allergy thing. \nBut it's going to be very traumatizing for the children on both sides. I hope that Amy takes as much care of her kids as the OP does.",
      "created_utc": 1726151062.0,
      "score": 130
    },
    {
      "id": "lmsbkdj",
      "body": "Well, it seems like one isn't, and one is. Who knows about the others. Imagine if the kids are Jim's, and that's why he couldn't believe Luke was f*cking Amy?",
      "created_utc": 1726157991.0,
      "score": 8
    },
    {
      "id": "lmtc4rx",
      "body": "This woman may have intentionally slept with similar men, even if they were not her type, just to avoid suspicion.",
      "created_utc": 1726169592.0,
      "score": 25
    },
    {
      "id": "lmrkxnz",
      "body": "Is she getting child support from another man or claiming orphan benefits for them or something? \n\nHer reaction is really bizarre, like she doesn't care what happens to her beloved Luke even. She just wants any evidence involving *her* gone.",
      "created_utc": 1726149244.0,
      "score": 376
    },
    {
      "id": "lmrfjco",
      "body": "In most states, destroying the laptop is felony vandalism, and her attacking you is misdemeanor or felony assault. Amy is probably going to prison for at least a year. If she has no prior convictions, the charges might be reduced. the charges might be reduced, but it’s unlikely that she gets out of this without a criminal record and sometime in jail. \n\nShe absolutely deserves whatever she gets, but she has bigger problems than whether or not Luke’s family cut her off.",
      "created_utc": 1726147262.0,
      "score": 750
    },
    {
      "id": "lmrgvar",
      "body": "Is she getting arrested for assault?",
      "created_utc": 1726147763.0,
      "score": 88
    },
    {
      "id": "lmroqah",
      "body": "They should have cut her off already.  Supporting her financially is utter ridiculous.     at least you can tell your in-laws that maybe they can force Amy to do the paternity test in order for them to keep supporting her",
      "created_utc": 1726150560.0,
      "score": 83
    },
    {
      "id": "lmrl4i3",
      "body": "[deleted]",
      "created_utc": 1726149309.0,
      "score": 159
    },
    {
      "id": "lmrg8dc",
      "body": "Nah, she wants it deleted for self-preservation. She doesn't want *her* life blowing up, and she doesn't want to be exposed. Desperate people do crazy things. If this is real and not some creative writing exercise, then you should be careful, OP.",
      "created_utc": 1726147525.0,
      "score": 261
    },
    {
      "id": "lmswbq6",
      "body": "Do you think Luke has been busy cleaning his laptop and phone.  Based on Amy's visit I would say he knows or at least suspects since he had to come back for them.",
      "created_utc": 1726164474.0,
      "score": 5
    },
    {
      "id": "lmt8dgd",
      "body": "Agree with the others. With evidence of an affair dating back years, she doesn’t want the judge to require a DNA test for her children. She isn’t aware that her oldest son has already taken one. I’m guessing Luke fully believes the children are his, and she doesn’t want him finding out the truth.\n\nShe’d lose the money from him, as well a his parents. The mom was fine paying when she thought the children might be his, but knowing the girl they watched grow up not only has been having a longterm affair with their son, but was also cheating on him and telling him all the children were his when at least one wasn’t…. There’s no way to come back from that. She’s completely trashed the only family who ever cared about her, using them for money and other selfish reasons for all this time.",
      "created_utc": 1726168368.0,
      "score": 50
    },
    {
      "id": "lmtbm57",
      "body": "The smashing of the computer is cute. SO MANY things Amy has done show she’s just… a not smart person. It’s 2024. The cloud exists. What was she going to do, ask OP to give her the images on microfiche?",
      "created_utc": 1726169424.0,
      "score": 26
    },
    {
      "id": "lmtgc7x",
      "body": "Jim.",
      "created_utc": 1726170940.0,
      "score": 5
    },
    {
      "id": "lmtm4nx",
      "body": "I was wondering if she might be married somehow.",
      "created_utc": 1726172797.0,
      "score": 3
    },
    {
      "id": "ln9hz8d",
      "body": "I'm also super invested in the reason why Amy feels so strongly about deleting the evidence, and would love for someone to let me know when there's an update, as I don't often come on Reddit!",
      "created_utc": 1726415357.0,
      "score": 4
    },
    {
      "id": "lmswpc4",
      "body": "Such a great plot twist, but the DNA test the kids took would have show that :/",
      "created_utc": 1726164597.0,
      "score": 22
    },
    {
      "id": "lmrgliv",
      "body": "Yeah, me too... I'm definitely going for a drink tho, and maybe therapy 🤦🏻‍♀️",
      "created_utc": 1726147662.0,
      "score": 54
    },
    {
      "id": "lms9tzz",
      "body": "Great!! The more the better ...",
      "created_utc": 1726157441.0,
      "score": 5
    },
    {
      "id": "lmse3ej",
      "body": "Cheaters gonna cheat...\n\nAmy's life is about to implode.",
      "created_utc": 1726158796.0,
      "score": 119
    },
    {
      "id": "lmsivnz",
      "body": "My mama always said “ if they’ll cheat with you, they’ll cheat on you”",
      "created_utc": 1726160282.0,
      "score": 51
    },
    {
      "id": "lmsrqto",
      "body": "See, my brain goes far more nefarious. \n\nPerhaps they were making *plans*. Pillow talk planning. Plans that involved OP. Or their money. *Her home*. \n\nI want to know if all these videos have been viewed in full. Have they been transcribed? Cause I'd be on that 1.2 seconds after she was out the door.",
      "created_utc": 1726163040.0,
      "score": 97
    },
    {
      "id": "lmursgc",
      "body": "I think it's likely that she's been collecting double child support claiming all four children belong to another long-term partner and perhaps that long-term partner has a reason to keep Amy quiet about her children perhaps a wife of his own.",
      "created_utc": 1726187551.0,
      "score": 9
    },
    {
      "id": "lmsrjkm",
      "body": "But deleting whatever he has on his laptop doesn't change that surely",
      "created_utc": 1726162977.0,
      "score": 2
    },
    {
      "id": "lmrb84t",
      "body": "You did the same thing here, too:\n\n>He was pretty upset when he found out that I had poached Luke, though.",
      "created_utc": 1726145592.0,
      "score": 301
    },
    {
      "id": "lmrwdk1",
      "body": "When/If Amy goes to court I'm pretty sure the judge will add extra time when he hears why she wouldn't leave, broke your computer, and then attacked you. I hope you landed a couple of blows of your own, it was self defense after all.",
      "created_utc": 1726153105.0,
      "score": 67
    },
    {
      "id": "lmsars8",
      "body": "I'm just now reading all your stories and Im not gonna read all the comments, but!... have you asked them why they didn't just be together and have a life? Why did they feel the need to carry on a decades long affair and have children together while Luke married and had children with someone else? It just doesn't make sense, I'm sure that Luke's parents would've been happy about it since they'd been close their whole lives. It's just so baffling that they obviously love each other and want to be together why they didn't just do that in the first place? Why drag other people and especially two sets of kids into their relationship that no one would've tried to stop?!",
      "created_utc": 1726157739.0,
      "score": 35
    },
    {
      "id": "lms8i7x",
      "body": "Hahaha it does seem a little fantastic, doesn't it?",
      "created_utc": 1726157022.0,
      "score": 34
    },
    {
      "id": "lmstwpd",
      "body": "The fact that people are still engaging with OP as if this is real is hilarious, lmao.  They don't need advice about what to do, because they can take this story wherever they want!",
      "created_utc": 1726163709.0,
      "score": 9
    },
    {
      "id": "lmtfi3i",
      "body": "Does cat know Amy assaulted you?",
      "created_utc": 1726170675.0,
      "score": 7
    },
    {
      "id": "lmtzp68",
      "body": "I agree with you. Luke is not the brightest one, most probably thinks Amy only sleeps with him.",
      "created_utc": 1726177135.0,
      "score": 2
    },
    {
      "id": "lmrjl8h",
      "body": "You definitely have your proof that she and Luke has been in contact for how else would she know that you have anything on them. \n\nThey abused her and now she does it to the family that took her in.",
      "created_utc": 1726148764.0,
      "score": 47
    },
    {
      "id": "lmrtozh",
      "body": "That’s a bit understandable.  For her to admit the affair to you is giving you the upper hand.\n\nGiven she doesn’t have her own biological family for support, she’s desperately trying to hold onto Luke’s.  It’s one thing if there’s no concrete evidence of the affair.  She can gaslight her way out of it.\n\nBut having concrete evidence of the affair means she can’t lie to everyone - especially Luke’s family.",
      "created_utc": 1726152229.0,
      "score": 36
    },
    {
      "id": "lmtqnt1",
      "body": "Because she considers Luke's family as her own, she may get desperate (actually MORE desperate!) than she already has been and may take drastic measures. An RO is a piece of paper. Please be careful, OP! Be careful of an ambush outside of your home!",
      "created_utc": 1726174216.0,
      "score": 5
    },
    {
      "id": "lmrimxy",
      "body": "A Family Tree DNA test could help Tom identify his father.   He may have been a casual hookup Amy used to keep Luke close.   Whether she let him believe he was the father or just made it seem that she couldn't survive without him, it was the first step in ensuring that she would always play a major role in your marriage.",
      "created_utc": 1726148417.0,
      "score": 97
    },
    {
      "id": "lmrggy7",
      "body": "Oh good. Glad you are going to add it to the pile. Just let them keep burying themselves. \n\nAlso if you need anything on that laptop you can just have it cloned onto another laptop at one of the many computer repair places. Our cat broke the screen of our main business computer recently and we just took in a different new computer and they cloned it all over.",
      "created_utc": 1726147614.0,
      "score": 50
    },
    {
      "id": "lmrjp5a",
      "body": "I know nothing about those over-the-counter paternity tests other than that I've heard from Americans that they exist. Are you sure you can test siblings with those and get a correct answer? Did you ask at the pharmacy, or does it say so on the box? If not, maybe consider having them do one of those online heritage tests like 23andme or My Heritage. Tom might want to do one of those anyway. Even if Luke isn't his bio dad, which I really believed he would be, he can still find other relatives to find out who actually is his father. If he wants to.",
      "created_utc": 1726148803.0,
      "score": 29
    },
    {
      "id": "lms7to1",
      "body": "For anyone questioning this, google \"at home over-the counter paternity test\"\n\nThis is from the listing for one sold at CVS, it has a two business day turnaround time:\n\nHomeDNA Paternity Test for At-Home Use\n\n1.00 Kit, 0.15 lbs. Item # 180746\n\nBring peace of mind by answering paternity questions with DNA science. With decades of experience and over 20,000 locations nationwide, it's easy to see why HomeDNA is America's #1 paternity test brand. Simply buy this kit, use the painless cheek swabs, and send in samples with the $139 lab fee. You'll get results online just 2 days after all samples arrive at the lab. Get your kit today, and see for yourself why so many people choose HomeDNA to answer one of life's most important questions.\n\n* Fast Online Results in 2 Business Days\n* Strict Confidentiality\n* Painless cheek swabbing\n* Trackable Return Mailer for Sending DNA Samples to Our Lab",
      "created_utc": 1726156806.0,
      "score": 18
    },
    {
      "id": "lmrgh7x",
      "body": "Make sure you protect your children and yourself. Also, wouldn’t hurt to ask your lawyers if they can demand psych evals for both Luke and Amy.",
      "created_utc": 1726147616.0,
      "score": 18
    },
    {
      "id": "lmrow22",
      "body": "What is Amy has an actual bf or something you guys dont know about. She knows he might discover or maybe she told Luke her kids were his and now that 1 of them deffinetly isent, shes freaking out because he will discover he wasent the only guy she was seeing. \n\nBut i hope when all this is over you get to have your peace. I bet Luke will come back running when he realises how crazy Amy is.",
      "created_utc": 1726150615.0,
      "score": 12
    },
    {
      "id": "lmrkdcx",
      "body": "Not sure what state you’re in, but I’m pretty sure destruction of property is also a criminal offense when coupled with the assault.",
      "created_utc": 1726149044.0,
      "score": 9
    },
    {
      "id": "lmtycsh",
      "body": "I feel the need to point out that testing different-gendered children to see if they're siblings can give misleading results.\n\nDNA comes in chunks. And while full-blood siblings will, on average, have 50% of their DNA in common, the range is 0% to 100%, simply because there's no way to tell which half of their parents DNA they inherited. \n\nI like to use the analogy of card decks. Take two decks of cards, the same size but with a different pattern on the back so you can tell them apart. Lets say one deck has a green back, and the other is blue. Shuffle both, and take the top 26 cards from each deck. Combine them, so you have a deck that's half blue and half green. Do the same with the remaining halves. Both of these \"inherited\" half their cards from each parent. But, do they both have the same number of red 9s?\n\nThat analogy oversimplifies it a lot, but most people seem to understand it better than other analogies I've tried.\n\nWith half siblings, the range is zero to 50%, with an average of 25%. \n\nNow, add another complicating factor: DNA tests don't compare the entire genome. They pick out a handful of data points, and depending on which \"chunks\" are included and how many points there are, it's entirely possible for a test to miss the parts they have in common.\n\nIf you're testing to see if they're half-siblings, try and test two of the same gender. That way you can be sure that at least one chromosome will be the same, even if the rest that they inherited happen to be different.",
      "created_utc": 1726176680.0,
      "score": 5
    },
    {
      "id": "lmrjvfg",
      "body": "If Tom’s DNA test is correct, I suspect she either had a brief relationship with/one night stand with someone who looks like Luke, or went the sperm donor route (considering her financial position, I think this is I likely). I’m not sure if the original intent was to try to pass Tom off as Luke’s, or if it was more of a jealousy thing where if she had a kid that looked like Luke, she could pretend it was is. \n\n\nIf we exclude Tom for the equation, I do wonder at what point exactly the affair started and how many kids have to potential to be Luke’s. Regardless, I think she has told Luke they are all his. By continuing to push all of this, it might make Luke question paternity. Which will make him and his parents disinclined to continue bankrolling her life.",
      "created_utc": 1726148865.0,
      "score": 78
    },
    {
      "id": "lmrefvg",
      "body": "no one knew who impregnated her with Tom either. feels like she hides a lot of things? \n\nbut agree with other redditors that she might be mentally unstable now. please take extra precautions and stay safe!",
      "created_utc": 1726146847.0,
      "score": 72
    },
    {
      "id": "lmrjzms",
      "body": "Maybe it would be better to send the recording of her attacking you, because if they didn't know there were cameras in the house, Amy and Luke might try to tell his parents that it was you who had the outburst, hit her and broke the laptop. And honestly, I think it's time to get a restraining order for her, since she literally hit you.",
      "created_utc": 1726148906.0,
      "score": 58
    },
    {
      "id": "lmrkbno",
      "body": "I hope she does!",
      "created_utc": 1726149027.0,
      "score": 8
    },
    {
      "id": "lmtbxck",
      "body": "OP please make sure the police know that you would like to press charges/sign complaints. Not sure what state you’re in, but i had to be very proactive with the police reports I made against my ex-husband’s girlfriend (she did something similar). My husband is a police officer and he said to ensure the police know you’d like to move forward with charges or they won’t do anything.",
      "created_utc": 1726169526.0,
      "score": 6
    },
    {
      "id": "lmshfdh",
      "body": "Hopefully you get her for the laptop to. Even if it was out of view of the camera you should see if you at have audio of it.",
      "created_utc": 1726159837.0,
      "score": 5
    },
    {
      "id": "lmtti94",
      "body": "Tom sounds like a grounded kid, in spite of his mother's behavior. \n\nHe now knows Luke isn't his father. Does he want to find out who is?",
      "created_utc": 1726175118.0,
      "score": 11
    },
    {
      "id": "lmrma9n",
      "body": "[deleted]",
      "created_utc": 1726149714.0,
      "score": 6
    },
    {
      "id": "lmshu8l",
      "body": "OP, I want to let you know how sorry I am that you and these kids are going through this. You, your children, and Amy's children deserve answers. \n\nSending so much love and compassion to you right now.",
      "created_utc": 1726159962.0,
      "score": 6
    },
    {
      "id": "lmrjsm9",
      "body": "Me too. Maybe there is another man in a long term situation that doesn’t know about her affair with Luke.",
      "created_utc": 1726148837.0,
      "score": 19
    },
    {
      "id": "lmrhs7w",
      "body": "Or there’s a secret baby daddy who thinks all the kids are his and she gets money from him too",
      "created_utc": 1726148104.0,
      "score": 26
    },
    {
      "id": "lnjyqhk",
      "body": "Oh? So you found out the big \"why?\" then?",
      "created_utc": 1726572338.0,
      "score": 40
    },
    {
      "id": "lni8mv0",
      "body": "There's not enough reasons to do so much damage to a person and not just one person in this case. I'm sorry OP keep being strong ",
      "created_utc": 1726537513.0,
      "score": 16
    },
    {
      "id": "lnhzb24",
      "body": "He’s truly a dark soul. I’m so happy you are away from that monster….they both are monsters.",
      "created_utc": 1726534039.0,
      "score": 14
    },
    {
      "id": "lmriey8",
      "body": "Did you contact his parents to let them know what Amy did?",
      "created_utc": 1726148335.0,
      "score": 55
    },
    {
      "id": "lmre9in",
      "body": "If the hard drive is in one piece you might be able to retrieve some if not all your data",
      "created_utc": 1726146779.0,
      "score": 36
    },
    {
      "id": "lmrieh2",
      "body": "I hate to ask this but could she have been sleeping with his father and playing the kids off as being Luke's? There is something driving this desperation of hers.",
      "created_utc": 1726148331.0,
      "score": 30
    },
    {
      "id": "lmrp0cy",
      "body": "As in your lawyers have the proof not that Amy destroyed it right?",
      "created_utc": 1726150657.0,
      "score": 5
    },
    {
      "id": "lmt804l",
      "body": "No, I don’t think it has anything to do with that type of situation. I think it’s purely the videos that she sent of them together or the stuff that she sent to him of herself. Amy is spiraling, as evidenced by her getting physical with you. I’m glad you reported her and keep it up. They will bury themselves.",
      "created_utc": 1726168247.0,
      "score": 4
    },
    {
      "id": "lmrm4cx",
      "body": "Agreed. I’ve ran the gamut of scenarios, and finances seems the most plausible. Op should probably lock down her credit at the bare minimum. It’d probably be interesting to see if she can contact Lexus Nexus and see if she or Luke are covered on any surprise insurance policies. As either beneficiaries or covered individuals. \n\nAnd has Luke been radio silent? He’s not communicating with the kids?",
      "created_utc": 1726149657.0,
      "score": 30
    },
    {
      "id": "lmru93z",
      "body": "Or they dislike each other because of attraction???",
      "created_utc": 1726152416.0,
      "score": 16
    },
    {
      "id": "lnj7ovo",
      "body": "[deleted]",
      "created_utc": 1726554276.0,
      "score": 24
    },
    {
      "id": "lnj6q5z",
      "body": "It really is baffling. I’m curious if you came up with any theories why they didn’t? My only guess would be problems with his parents supporting the marriage but from what I’ve read, they seem like they would have supported it. So what the heck 🤦🏼‍♀️ \n\nThank you for your updates and really hoping this “ends” for you soon so you and your kids can try and heal from it. I know it’ll never really end but at least this messiness hopefully will from Amy.",
      "created_utc": 1726553641.0,
      "score": 4
    },
    {
      "id": "lmvbasq",
      "body": "It doesn't save him though. She knows you have proof. She may not know the dirty details, but she knows there's proof",
      "created_utc": 1726194925.0,
      "score": 5
    },
    {
      "id": "lmvawxz",
      "body": "Has Cat responded to you after you're fight with Amy?",
      "created_utc": 1726194776.0,
      "score": 4
    },
    {
      "id": "lmrwvhm",
      "body": "Ah!  BUT!\nWhat if he’s (Amy’s other dude because we know there’s at least one more) also married? It’s like Amy’s thing and she doesn’t want Luke finding out about it? \n\nSounds like Luke is proud of his situation; I am thinking of the time you guys were at the dinner table and he gaslit you into thinking he loved you AnD wOuLd NeVeR cheat BUT AMY GOT MAD. She didn’t want you to go down the rabbit hole to figure out anything else. \n\nI would plant the seed to Cat that the eldest ISNT but you know at least one of them is. Don’t say which one ☝🏽 because he may admit to another one.",
      "created_utc": 1726153267.0,
      "score": 36
    },
    {
      "id": "lms2ghq",
      "body": "I think she's reacting like this because Luke is upset with her and blaming her and she obviously doesn't want that.   She wants you to divorce without any blame on cheating so she and Luke can finally be together, if not Luke might not want anything to do with her.  Could also be Luke is now scared his father will disinherit him because of the cheating, now that Jim knows it's true, this could also be an added factor especially when you heard the shouting between Jim and Luke.  Luke could be scared.",
      "created_utc": 1726155089.0,
      "score": 24
    },
    {
      "id": "lmu0wpj",
      "body": "By chance, does she receive any governmental assistance for her kids???  If your in-laws are helping her out financially, it seems reasonable that she qualifies for assistance and probably gets it. If that’s the case, she definitely doesn’t want to be “involved” in the divorce and for that matter, your soon to be ex too. Why? Because there’s at least a decent chance that one of her kids is his and now he’ll be ordered by the courts to pay for every child that is his, including those that are hers AND she’ll lose some, if not all benefits.",
      "created_utc": 1726177546.0,
      "score": 8
    },
    {
      "id": "lmvghqf",
      "body": "Zack seems to be completely on your side and want the best for you. If Paige is against you choosing an unbiased attorney then do not keep her in the loop with anything.",
      "created_utc": 1726197038.0,
      "score": 22
    },
    {
      "id": "lmv2o7q",
      "body": "How was he affectionate with her? Like hugging often? How are you doing now? Do you miss him?",
      "created_utc": 1726191656.0,
      "score": 7
    },
    {
      "id": "lmv7k0e",
      "body": "Was he affectionate with you when Amy was around?",
      "created_utc": 1726193515.0,
      "score": 6
    },
    {
      "id": "lmrfsei",
      "body": ">The trouble is, if Luke gets unsupervised access to the kids, so does Amy.\n\nAll the more reason to get a restraining order in addition to the police report etc. At least this way you will be showing even more how unstable Amy is and that maybe she shouldn't be allowed around the kids.",
      "created_utc": 1726147357.0,
      "score": 94
    },
    {
      "id": "lmrl0bj",
      "body": "This is why you need to stand firm about the assault charges. Do not waiver because you feel sorry for her kids. She is a menace and I wouldn’t put it past her to abuse your kids to hurt you.",
      "created_utc": 1726149269.0,
      "score": 45
    },
    {
      "id": "lmrg1v9",
      "body": "[deleted]",
      "created_utc": 1726147457.0,
      "score": 30
    },
    {
      "id": "lmrgywz",
      "body": "No, the trouble is that Zach may have a conflict of interest because his former client is an adverse party. Any real lawyer would know that. I don’t know of any jurisdictions where that isn’t at least a serious potential problem.\n\nI’m concerned about *many* legal details you’ve written about either presenting ethical issues or simply being nonsensical.",
      "created_utc": 1726147800.0,
      "score": 27
    },
    {
      "id": "lmsu089",
      "body": "Well thankfully, the fact that she attacked you violently now makes that unlikely. You’ll be able to get a restraining order against her, and you’ll be able to demand a clause in the divorce paperwork demanding Amy have no access to your children without you coming across as merely vindictive.\n\nAlso (I’m sure Paige has this on lock already) make sure that you claim Right of First Refusal in your paperwork, too- that way if your ex can’t watch your kids, he can’t just hire a babysitter- he MUST call you to offer you the chance to watch them first.\n\nKeep playing hardball. You’ve got this!",
      "created_utc": 1726163740.0,
      "score": 6
    },
    {
      "id": "lmtam4d",
      "body": "Not if she is a threat to you and your children’s safety. Get a restraining order. Sue her for alienation of affection, property damage, and battery.",
      "created_utc": 1726169100.0,
      "score": 3
    },
    {
      "id": "lmv5fdh",
      "body": "The audience didn’t like the first lawyer, so she was written off in the latest episode. Give the people what they want!",
      "created_utc": 1726192711.0,
      "score": 10
    },
    {
      "id": "lmrk7cm",
      "body": "I'm here with you, I'm always ready with the popcorn wondering where OP is taking the story next. Obviously we are heading towards the reveal of Amy's secret and I do wonder what that twist is going to be. I'm hooked and on the edge of my seat. ",
      "created_utc": 1726148983.0,
      "score": 56
    },
    {
      "id": "lmrx8ou",
      "body": "Honestly I didn’t have the attention span to read the first one when I saw it and updates 1, 2 and this one crossed my feed, officially convincing me this is fake…\n\nBut now I’m seeing people saying I should read it anyway because it’s a cool story, so should I?",
      "created_utc": 1726153387.0,
      "score": 14
    },
    {
      "id": "lmv6gmf",
      "body": "Could it simply be that she is afraid of his parents cutting her off? Also, even though they could be together after the divorce, maybe Luke doesn't want that, and she will lose him to a point as well.",
      "created_utc": 1726193112.0,
      "score": 8
    },
    {
      "id": "lmvas4f",
      "body": "It is all about money, dear. All of it",
      "created_utc": 1726194725.0,
      "score": 12
    },
    {
      "id": "lmv697u",
      "body": "What is he saying in the voicemails if you don’t mind sharing some? I’d love to know what he’s thinking about everything that’s going on right now. Also has he asked about the kids at all?",
      "created_utc": 1726193031.0,
      "score": 10
    },
    {
      "id": "lmv401p",
      "body": "May still be another man making child support payments, with no contact with Amy or Tom. Not a long-term man, but a one night stand who wasn’t interested in being a dad.",
      "created_utc": 1726192166.0,
      "score": 5
    },
    {
      "id": "lmrluxf",
      "body": "I don't think so. I think he just wanted to believe his son wasn't a piece of shit.",
      "created_utc": 1726149565.0,
      "score": 6
    },
    {
      "id": "lmretml",
      "body": "I have no idea why I'm so invested in this whole saga but I'm here til the end.",
      "created_utc": 1726146992.0,
      "score": 21
    },
    {
      "id": "lmslrov",
      "body": "Oh, that may be why Amy wasn’t all that worried, if she knew Tom wasn’t Luke’s. Well, who is Tom’s father!?!?",
      "created_utc": 1726161188.0,
      "score": 3
    },
    {
      "id": "lmt06ka",
      "body": "I’d want a more reliable test than that too!",
      "created_utc": 1726165708.0,
      "score": 4
    },
    {
      "id": "lmv1hnt",
      "body": "Maybe that's why he was like this, he probably thinks that if everything comes to light that relationship with them and their support will burst into flames and there will be nothing left.",
      "created_utc": 1726191205.0,
      "score": 6
    },
    {
      "id": "lmv9mbi",
      "body": "How can you be certain without DNA testing? Because of a shared allergy? You were confident that Tom was Luke’s son and that appears not to be the case.",
      "created_utc": 1726194288.0,
      "score": 8
    },
    {
      "id": "lmt7fk5",
      "body": "Baaaabbyyy! This! Thiiisss!! She has been in control of the narrative until now. That gave her such a high! And when the truth is revealed, maybe all them kids aren’t his and she has been lying to him the entire time! Omg!!",
      "created_utc": 1726168060.0,
      "score": 274
    },
    {
      "id": "lmrnwsm",
      "body": "💯",
      "created_utc": 1726150279.0,
      "score": 114
    },
    {
      "id": "lmsjsuk",
      "body": "Well darn, I'm even more invested now 🍿",
      "created_utc": 1726160568.0,
      "score": 177
    },
    {
      "id": "lmsm6oj",
      "body": "I find this most likely. The evidence or lack thereof is all that’s keeping Luke in a home paid for by the Amy’s parents and possibly Luke’s family, and jim is there in the picture the entire time?",
      "created_utc": 1726161316.0,
      "score": 52
    },
    {
      "id": "lmtrrv0",
      "body": "This sounds like the most logical reasoning for her freak out.\n\n\n She was living cushy being mistress to someone from a wealthy family and suddenly after all these years everything is turning upside down and she now stands at risk of losing it all.\n\n\n Especially now that she's on video assaulting the legal spouse of her AP. She just made her bed and the court system is (hopefully) going to make her lay in it.",
      "created_utc": 1726174569.0,
      "score": 12
    },
    {
      "id": "lmu3cir",
      "body": "I just love when people get the comeuppance they deserve. Or more succinctly, FAFO.",
      "created_utc": 1726178386.0,
      "score": 9
    },
    {
      "id": "lnv9jwt",
      "body": "Depending on what state they are in OP can sue Amy as the AP for alienation of affection of her husband. I think it should be law everywhere that you can sue the AP for stepping out with a man they know is married. It won’t be cheap for Amy with all the proof if they are in an eligible state.",
      "created_utc": 1726735239.0,
      "score": 5
    },
    {
      "id": "lmsveq6",
      "body": "But think of it this way, the oldest looks like her ex right? But isn’t his child… he could well be his brother…",
      "created_utc": 1726164181.0,
      "score": 10
    },
    {
      "id": "lmsjkv8",
      "body": "And sued for financial recompensation. Bye bye cushy life made by deceiving an elderly couple.",
      "created_utc": 1726160498.0,
      "score": 124
    },
    {
      "id": "lmufzba",
      "body": "Yeah, OP has no way of knowing that nobody was paying child support for any of Amy's children.",
      "created_utc": 1726183061.0,
      "score": 7
    },
    {
      "id": "lmti05n",
      "body": "If it was just a donor situation they wouldn’t be flirting with each other and send each other sex tapes so I definitely think it’s an affair. He probably told her that if his family( His Parents) ever finds out he will cut contact and that’s what she is worried about",
      "created_utc": 1726171473.0,
      "score": 53
    },
    {
      "id": "lmslro5",
      "body": "Yep, I’m right there with you. Not sure about any hidden motive like a will, but I definitely think there was an arrangement between them and she using him for the financial and emotional support.",
      "created_utc": 1726161188.0,
      "score": 33
    },
    {
      "id": "lmuimiv",
      "body": "Everyone needs to get DNA tests on this situation. Lol",
      "created_utc": 1726184050.0,
      "score": 7
    },
    {
      "id": "lmuz30t",
      "body": "But Amy & Luke had been carrying on a sexual affair with each other till they basically got caught & Luke had tons of pictures of Luke & Amy having sex at her house & his as well as emails talking about it too. So it wasn’t just helping her get pregnant & then getting back to his own life & family it was him carrying on 2 full families & having sex separately with both woman & only Amy knowing & Luke’s wife having no clue!",
      "created_utc": 1726190307.0,
      "score": 5
    },
    {
      "id": "lmvhrhc",
      "body": "Having kids to get money is super crappy. Same with having a child to trap a spouse or to live out a selfish fantasy.",
      "created_utc": 1726197587.0,
      "score": 5
    },
    {
      "id": "lmttpaq",
      "body": "No only that , what if Amy is telling Luke they are his kids ,but probably they are someone's close to him and she doesn't want any one from the family to know and as I see , she doesn't work and she  has been supported  by his family , what if she is been supported by someone else from his family as well , Without anyone else knowing ,She is a Leech..",
      "created_utc": 1726175178.0,
      "score": 10
    },
    {
      "id": "lmszeu2",
      "body": "If Luke’s father was the baby daddy there would have been a partial match on the DNA not a 0 match.",
      "created_utc": 1726165463.0,
      "score": 21
    },
    {
      "id": "lmsvjop",
      "body": "I’m here for whatever happens next - I’ve got extra popcorn!",
      "created_utc": 1726164225.0,
      "score": 9
    },
    {
      "id": "lmrqfz0",
      "body": "It could be a coincidence, I can't remember off the top of my head, but unless it's something that's super rare and only comes from genetics and can't be a randomly developed allergy, it's still possible.",
      "created_utc": 1726151146.0,
      "score": 51
    },
    {
      "id": "lmt4s5h",
      "body": "And I think I remember the younger two being twins. Still, may just be a coincidence. Fingers crossed!",
      "created_utc": 1726167197.0,
      "score": 5
    },
    {
      "id": "lmsx9a3",
      "body": "But familial DNA would still be present unless Luke isn't Jim's son!",
      "created_utc": 1726164775.0,
      "score": 10
    },
    {
      "id": "lmrvsmp",
      "body": "I feel like she is, and the court DNA tests will prove it and she'll have to pay back thousands for fraud.",
      "created_utc": 1726152917.0,
      "score": 229
    },
    {
      "id": "lmrwnyv",
      "body": "And her focus on repeating herself for the end goal….irs like listening to my managers when they know the expectations are a big ask….",
      "created_utc": 1726153200.0,
      "score": 71
    },
    {
      "id": "lmv3rhz",
      "body": "Haha oh man I didn't think of this. You're probably right, there is at least one other father and he's probably paying support. On the other side, Amy is probably saying all the children are Luke's so he's been overly forthcoming with extra support, at the cost of his own \"legal\" family. \n\nThe biggest thing I'm getting from this is that Amy is literally a mess. I need to know what happens next!",
      "created_utc": 1726192073.0,
      "score": 8
    },
    {
      "id": "lmt3qga",
      "body": "and on top of that, lack of evidence does become evidence in that case. If you were so insistent on destroying the evidence, then the court will assume the evidence paints you in the worst light possible\n\nChatgpt calls it: \"Adverse inference instruction\"",
      "created_utc": 1726166859.0,
      "score": 117
    },
    {
      "id": "lmtn6py",
      "body": "Also, bc many states have a money limit for felony as opposed to misdemeanour vandalism. Laptops get expensive. Plus, the idiot assaulted her so it may already be a felony again, depending on state or area. OP I'm sending you all my biggest hugs and well wishes for resilience, inner peace, and for things to work out on the best way for you and your beautiful kids.",
      "created_utc": 1726173130.0,
      "score": 20
    },
    {
      "id": "ln8tba4",
      "body": "That is why OP needs to ask Zack and Paige to explore all the criminal routes Luke & Amy have taken. Perhaps they will need a third lawyer whose expertise is fraud or even other criminal conducts (never forget the manipulation, the gaslighting and them trying to publicly discredit OP's sanity. Now there's even assault and destruction of property).\n\n\nOP don't treat this just as a simple divorce due to a long-term affair suit. They are a huge threat to yours and your children's safety.",
      "created_utc": 1726407595.0,
      "score": 7
    },
    {
      "id": "lmrlgnw",
      "body": "I included it in my report. \n\nThe sound of the laptop breaking is definitely on my phone and should be on the camera as well. \n\nSo far as I know, she hasn't been arrested, but I am aiming for a restraining order now.",
      "created_utc": 1726149425.0,
      "score": 403
    },
    {
      "id": "lmtah74",
      "body": "I was wondering if this is real, too. But whatever, it's actually a great set of stories whether it is true or not. I'm choosing to believe it is real",
      "created_utc": 1726169055.0,
      "score": 34
    },
    {
      "id": "lmuotqf",
      "body": "I wouldn't be surprised if she's been collecting child support of some sort from two different men. Luke and whoever she has on the side and that if they find out that only a certain amount of the children belong to them she'll miss out on the double child support she's been getting. Amy doesn't work. Amy doesn't want to work. losing her meal ticket would make her extremely desperate. Especially considering any official child support would probably be significantly less than what she's been using to support being a \"single\" stay at home mom.",
      "created_utc": 1726186423.0,
      "score": 4
    },
    {
      "id": "ln5vrl6",
      "body": "Oh that's a great idea. I never would have thought about that.",
      "created_utc": 1726355153.0,
      "score": 6
    },
    {
      "id": "lmt9eqd",
      "body": "But the judge may demand a DNA test from her in the divorce when OP comes to court with evidence of an affair dating back this many years.",
      "created_utc": 1726168708.0,
      "score": 5
    },
    {
      "id": "lmrd7ab",
      "body": "Damn it, thank you.",
      "created_utc": 1726146365.0,
      "score": 261
    },
    {
      "id": "lmtqtop",
      "body": "I was awww too bad so sad lukie poo. They are so used to doing bare minimum to hide their affair, they didn’t realize OP was capable of doing right for herself.",
      "created_utc": 1726174266.0,
      "score": 3
    },
    {
      "id": "lmsw449",
      "body": "The judge should also evaluate whether she is fit to be a mother. She's violent.",
      "created_utc": 1726164407.0,
      "score": 11
    },
    {
      "id": "lmux697",
      "body": "I had that same question about my ex. He cheated on all the women he'd ever been in a relationship, including me, with the same woman. I didn't, and still don't, understand why wouldn't he just be with her if he couldn't leave her the fuck alone?",
      "created_utc": 1726189573.0,
      "score": 4
    },
    {
      "id": "lmusmyz",
      "body": "Could be that Amy doesn't actually care about Luke just his money she doesn't want the responsibility of being the official wife being the mistress is much more convenient she gets to play single woman and Luke can't say a word about it without worrying about blowing up his life being the mistress means she was in control of the narrative and had something to hold over Luke",
      "created_utc": 1726187874.0,
      "score": 4
    },
    {
      "id": "lmsdrmx",
      "body": "Lol it does, but to be fair, anything is possible in this crazy world, and these events are certainly possible. Also, let's keep in mind that even if this story is true, these names are all fake! So it kinda makes sense that OP would have trouble keeping them straight--she has to keep coming up with more fake names to rename all her family members and acquaintances :D",
      "created_utc": 1726158691.0,
      "score": 26
    },
    {
      "id": "lmtb12x",
      "body": "I, for one, am waiting for the next chapter :D",
      "created_utc": 1726169233.0,
      "score": 4
    },
    {
      "id": "lmslrud",
      "body": "Oh man.  And she’s spiraling at the idea of losing the only family she has left.  Because her kids will be pissed too, but they don’t have another parent to go to. She’s ruined so many lives she can’t face it.. and to think about doing so.. *alone* is could be something",
      "created_utc": 1726161189.0,
      "score": 12
    },
    {
      "id": "lmsbv76",
      "body": "Thank you, I was going to mention that \"smashed\" laptops generally sustain damage to the screen, keyboard, and case. Usually you can pull the hard drive, pop it in a case with a USB dongle, and retrieve all the data from it.  Laptop hard drives are surprisingly robust, especially if they're SSD (solid state drives).  I'll bet that everything important on the computer is retrievable.",
      "created_utc": 1726158086.0,
      "score": 15
    },
    {
      "id": "lmsg3e8",
      "body": "I remember a case of a woman that was a chimera, and her ovaries were her siblings DNA, her blood and her saliva had different DNA.\n\nThe DNA tests during her divorce said that she was not related to her kids and didn't say that she was the aunt of her kids. It took a lot of time to finally figure out that her blood and saliva had different DNA, and they ended up testing her blood and it finally came back that her kids were hers. \n\nIf they are only looking for parent & child relationship in the paternity testing, they might say that two half siblings are not related as parent and child.",
      "created_utc": 1726159422.0,
      "score": 17
    },
    {
      "id": "lmsszua",
      "body": "He’s just as crazy to be able to lie that consistently and pathologically. I’m waiting for his melt down next.",
      "created_utc": 1726163428.0,
      "score": 5
    },
    {
      "id": "lmrkc3h",
      "body": "Maybe. But if there was evidence on the laptop that Tom isn't Luke's son, then he would know that, right? If Amy has lied to Luke about Tom's paternity, I don't see how she could know that I know Tom isn't Luke's son, when the last time we spoke of this, I asked her and Luke point blank if he was.",
      "created_utc": 1726149031.0,
      "score": 97
    },
    {
      "id": "lmrg2vt",
      "body": "And if Luke goes after custody demand psychological evaluation of both Amy and Luke!",
      "created_utc": 1726147468.0,
      "score": 37
    },
    {
      "id": "lmrkovb",
      "body": "Nah, that's evidence, I'm not sending it to anyone without the a-okay from my lawyer.",
      "created_utc": 1726149157.0,
      "score": 130
    },
    {
      "id": "lmv4ih7",
      "body": "He does.",
      "created_utc": 1726192361.0,
      "score": 17
    },
    {
      "id": "lmt68yq",
      "body": "Yeah, my impression is that Tom comes from some one night stand, but the rest might be Luke's.",
      "created_utc": 1726167674.0,
      "score": 4
    },
    {
      "id": "lmrj525",
      "body": "Do I smell a conspiracy?? 😂",
      "created_utc": 1726148600.0,
      "score": 7
    },
    {
      "id": "lnp6pfz",
      "body": "I'll get into this more when I post a longer update but yes I did.",
      "created_utc": 1726643441.0,
      "score": 90
    },
    {
      "id": "lnjd1vv",
      "body": "Exactly. There’s nothing I can think of to justify Luke and Amy’s infidelities.",
      "created_utc": 1726557930.0,
      "score": 10
    },
    {
      "id": "lmrj0un",
      "body": "I texted Cat. She hasn't responded.",
      "created_utc": 1726148558.0,
      "score": 109
    },
    {
      "id": "lmsegl7",
      "body": "The laptop that was smashed was her laptop, not Luke’s, she doesn’t have Lukes laptop anymore",
      "created_utc": 1726158912.0,
      "score": 8
    },
    {
      "id": "lmriyob",
      "body": "If Jim had been the father, the test would have told us that.",
      "created_utc": 1726148536.0,
      "score": 61
    },
    {
      "id": "lmrwiit",
      "body": "That’s a completely different novel.",
      "created_utc": 1726153150.0,
      "score": 44
    },
    {
      "id": "lnjad83",
      "body": "I wasn't making nearly as much as I am now, but, I was going into medicine so it's not like we couldn't foresee that I would be. \n\nYou are very sweet, commenter, thank you.",
      "created_utc": 1726556076.0,
      "score": 46
    },
    {
      "id": "lnkchz5",
      "body": "I'm curious if a condition of Luke's family support to Amy is that they are friends only and never cross the line. Seems like a reason why Amy insisted on the no affair and why they would nit marry.\n\nI'm so sorry OP for your situation.",
      "created_utc": 1726578386.0,
      "score": 4
    },
    {
      "id": "lmu18rb",
      "body": "Luke is scared of all that child support he’s going to be paying when all the DNA tests are done.",
      "created_utc": 1726177661.0,
      "score": 13
    },
    {
      "id": "lmskza6",
      "body": "Or abuse your children as a way of hurting Op.",
      "created_utc": 1726160939.0,
      "score": 10
    },
    {
      "id": "lmrgfcf",
      "body": "Some of them are old enough. Not all of them. \n\nI've been as honest with them as I feel like I should be. I can't exactly tell them that I've seen a video of Luke and Amy having sex.",
      "created_utc": 1726147598.0,
      "score": 72
    },
    {
      "id": "lmrmu5q",
      "body": "Unless Luke goes for some sort of emergency order, the OP has total control over the children until there is a formal custody order.   She doesn't have to let him in the house and she controls the circumstances under which he can see his kids.   In other word, it can be *supervised* visitation at his parents house with his mother present.    They know that Amy beat her up, they don't want anything to do with her right now.   What happens with the custody terms down the road can be worked out with her lawyers. \n\nThe issue now is the interaction between the two sets of children.   If they go to school together, that will pose some problem.   If they don't, the OP can say that they are taking a break from Amy's family for the time being.",
      "created_utc": 1726149907.0,
      "score": 13
    },
    {
      "id": "lmrhchq",
      "body": "It'll be fine. He's \"second chair\" anyway. Paige will be the one appearing in court. I already discussed this with him. \n\nI don't know why everyone thinks my representation is acting so unethically. Maybe I'm just an idiot about the law, but thus far I feel like my team has done very well.",
      "created_utc": 1726147940.0,
      "score": 72
    },
    {
      "id": "lmsv4vu",
      "body": "I’m a lawyer.  It’s not necessarily a conflict if the work he did for Luke is complete and is not in any way related to the current case.  All we know of is him representing both in a dispute with an HOA.  That is unlikely to cause a conflict.\n\nPeople get a little too hung up on what they think creates a conflict of interest, but if the rules were as rigid as all that, no one in a rural area could get an attorney for anything without traveling to a much bigger city.  I know several small town attorneys and they do represent people who are in a legal issue opposed to a former client.  That alone just isn’t enough to create a conflict.",
      "created_utc": 1726164092.0,
      "score": 5
    },
    {
      "id": "lms67gn",
      "body": "No, I just did the same thing and I regret it.",
      "created_utc": 1726156293.0,
      "score": 10
    },
    {
      "id": "lmvca6m",
      "body": "But his parents are wealthy",
      "created_utc": 1726195315.0,
      "score": 6
    },
    {
      "id": "lmrxpnr",
      "body": "Because it’s a fascinating story.",
      "created_utc": 1726153542.0,
      "score": 6
    },
    {
      "id": "lmva8mo",
      "body": "They've confirmed it in the letters.",
      "created_utc": 1726194520.0,
      "score": 31
    },
    {
      "id": "lmtbiar",
      "body": "Who in their right mind would be the mistress of the son of a family that takes care of them like a daughter? For years! Money and comfort are the only motivation, I can't find any other explanation. Luke's family wouldn't welcome their marriage, Amy is not in love with Luke, she doesn't want to be tied to him anyway. But the money and the sense of security are sweet. She just enjoys the comfort this family gives her by having sex a couple of times a month. And without the burden of marital responsibility.",
      "created_utc": 1726169390.0,
      "score": 180
    },
    {
      "id": "lmv80ua",
      "body": "Army has a shit ton to lose. And I'm here for it!!!",
      "created_utc": 1726193693.0,
      "score": 10
    },
    {
      "id": "lmtcmds",
      "body": "I know right? Op should sell the rights. I would love to see it on tv",
      "created_utc": 1726169751.0,
      "score": 82
    },
    {
      "id": "lmso7eg",
      "body": "I reckon Jim is  suspected it for years (like OP and Cat) but couldn't put his finger on it, maybe didn't want to. Maybe he has been thinking for a long time that what's done is done, everyone has settled down, no need to ruffle feathers. After his wife brought it up, it's impossible for him not to think about the possibility, when OP's friends, even the kids, were suspicious.",
      "created_utc": 1726161940.0,
      "score": 65
    },
    {
      "id": "lmuyg7p",
      "body": "I think I remember seeing her say Amy’s mum either passed when Amy was young or she left when Amy was young & Amy’s dad has been in & out of jail her whole life. Don’t hold me to this but I swear I saw it commented on the last update to a comment that was left to her. (I’m invested in this! Way more twists & turns than Jerry Springer ever had!!!)",
      "created_utc": 1726190065.0,
      "score": 4
    },
    {
      "id": "lmsx2tt",
      "body": "DNA test would have linked the boy to Jim.",
      "created_utc": 1726164718.0,
      "score": 11
    },
    {
      "id": "lmtk7rs",
      "body": "Or Amy has a type.",
      "created_utc": 1726172185.0,
      "score": 8
    },
    {
      "id": "ln8rvxo",
      "body": "OP hopefully can use all the evidence that is non-sexual to expose her. \nThe sexual videos and photos would just be revenge porn which is not OK under any circumstances. She just needs to patiently wait until the divorce and any adjacent possible lawsuit (marraige scam, defamation, their attempt at mental incapacitation of OP) is over to coldly let them know she saw all that and suddenly realized they are nothibg but 2 disgusting psychos.",
      "created_utc": 1726407086.0,
      "score": 5
    },
    {
      "id": "lmtkwqi",
      "body": "Yeah, but maybe it started that way? It's not likely, it's just a weird idea that kept coming to mind. \n\nHope she gets what she deserves",
      "created_utc": 1726172407.0,
      "score": 8
    },
    {
      "id": "lmv6m77",
      "body": "Yes!! Court is going to be meeeessssy!",
      "created_utc": 1726193173.0,
      "score": 6
    },
    {
      "id": "lmt55zv",
      "body": "unless Luke wasn't his dad's baby. Oh how the turn tables.",
      "created_utc": 1726167324.0,
      "score": 12
    },
    {
      "id": "lmrtqb7",
      "body": "Not necessarily. In my sil family a raw egg allergy is VERY common. Cooked or processed has no issue but all my neices/nephews have it but 1 or 2 out of 5. The allergy is on her side so while it's not guaranteed to happen, the odds are higher for the rare allergies to be passed on and developed after a couple of exposures.",
      "created_utc": 1726152242.0,
      "score": 26
    },
    {
      "id": "lmu6oge",
      "body": "There is also the phone recording of her doing it. So that would benefit OP's case ás well",
      "created_utc": 1726179581.0,
      "score": 12
    },
    {
      "id": "lmrn2wd",
      "body": "[deleted]",
      "created_utc": 1726149990.0,
      "score": 155
    },
    {
      "id": "lms159w",
      "body": "We are eager for these updates OP, because we truly cannot fathom what you are going through and how this situation is so heartbreaking.  You are incredibly strong and hope that everything will go really well for you.  Sending you hugs and praying for you.",
      "created_utc": 1726154664.0,
      "score": 100
    },
    {
      "id": "lmsrbgp",
      "body": "Have your attorneys personally viewed *all* of the content? Her absolute obstinate insistence to speak of *nothing* else makes me think there's something else there to be seen/heard. Something *worse* than just affair porn. \n\nHave these videos been transcribed? I wonder the conversations that were had, the plans that could be made accidentally on video.",
      "created_utc": 1726162907.0,
      "score": 38
    },
    {
      "id": "lmrrqpo",
      "body": "You should be pressing charges for assault. A police report is not enough.",
      "created_utc": 1726151581.0,
      "score": 85
    },
    {
      "id": "lms3fa8",
      "body": "So smart for having those cameras! I know you must be going through. I wish you so much healing. Fight in that divorce and drag her through the mud as well!",
      "created_utc": 1726155403.0,
      "score": 10
    },
    {
      "id": "lmu5eiu",
      "body": "Get an order of protection. It’s free. Just go to the magistrate. I’ve done one before and it’s sooooo much better than a restraining order. You see, with an OP she would get arrested for coming around you or your kids. With a RO she won’t get arrested for coming around you and your kids. A RO takes longer to get. An OP took me maybe 2 hours to create and then become enforced. Good luck! Oh and I hope she has to buy you a new laptop.",
      "created_utc": 1726179117.0,
      "score": 3
    },
    {
      "id": "lmuoe38",
      "body": "Try to have your kids protected in the order too if you can, that way Luke, won’t be able to legally take them around her when he has them even if you are unsuccessful in keeping his custody time to supervised only. If he were to take them around her anyway, they would both be in legal trouble and he could very well lose any and all custody he has of them.",
      "created_utc": 1726186255.0,
      "score": 3
    },
    {
      "id": "lmvjbkn",
      "body": "Amy works.  OP said she runs a bar.",
      "created_utc": 1726198286.0,
      "score": 5
    },
    {
      "id": "lms20q8",
      "body": "I’m so sorry you were attacked by Amy but the silver lining is that it’s all recorded and can be used in your divorce proceedings; the irony is they’re trying to make you out to be the unhinged one. So much for her want to not be involved. Did Tom say anything about Amy after her attack? Has Luke tried to reach out, I’d imagine Cat told him by now?\n\nAnyway, many of us are invested in your story because it’s gut wrenching and we’re rooting for you (and the kids)! We’re hoping you’re victorious and that Luke and Amy suffer the worse of the worse for what they’ve done to you and all of the children because they’re vile creatures. Following along real time with you gives us the opportunity to support you even though we’re all strangers. \n\nOn a side note, there’s another poster on Reddit that has an ongoing 3+ year long account of her discovering her ex husband’s affair. She pretty much uses her account to document her journey navigating the divorce, custody, coparenting, finding love again, etc. She says she plans to write a book about her experience and is glad she had documented it as it preserved her perspective while it was happening versus trying to remember years later. Maybe when all of this is over you will look back and see how far you came and know that you’re strong and can overcome any adversity. You’ll see our comments supporting you and our theories in trying to decipher Luke and Amy’s true intent behind all of this, and hopefully smile.",
      "created_utc": 1726154949.0,
      "score": 159
    },
    {
      "id": "lmst7fx",
      "body": "It’s hard to keep them straight when you are using fake names for everyone!",
      "created_utc": 1726163492.0,
      "score": 8
    },
    {
      "id": "lmsh7s3",
      "body": "Also, if it’s fake, who cares? This story has me hooked, line and sinker. I’m invested and need to know how it ends!",
      "created_utc": 1726159773.0,
      "score": 59
    },
    {
      "id": "lmtaqax",
      "body": "Not sure if this is the same case as there have been a few chimera cases but a woman had to have a court ordered monitor in the delivery room to prove that she was the bio mother of her children because she was being accused of faking her parenthood.",
      "created_utc": 1726169138.0,
      "score": 6
    },
    {
      "id": "lmrn9vo",
      "body": "Given Tom’s interest in getting a paternity test and it previously getting shot down hard by Amy, I’m betting she was paranoid about that to begins with.",
      "created_utc": 1726150058.0,
      "score": 70
    },
    {
      "id": "lmrsn9w",
      "body": "Get another dna test done, officially with the court!",
      "created_utc": 1726151882.0,
      "score": 18
    },
    {
      "id": "lmroq1s",
      "body": "Or maybe with the divorce involving her and Luke being the father of the kids, it means they can get a test through the court, and that test could prove that Tom isn't Luke's son, and if she lied to him that he was, so she \"cheated\" on Luke in their strange relationship, so the thing with the laptop may be because of the evidence of their affair, and then it will turn against her in this point. I don't know, it could also be so many things",
      "created_utc": 1726150557.0,
      "score": 11
    },
    {
      "id": "lmrpf9s",
      "body": "They knew Tom wasn’t Luke’s which is why they didn’t care if he dated Sophie",
      "created_utc": 1726150800.0,
      "score": 15
    },
    {
      "id": "lmrv2np",
      "body": "Nothing to do with the laptop but now I wonder if she told Luke that Tom was his from the beginning and that’s why she was so adamant that she didn’t want him tested with Luke. Maybe she didn’t want Luke to know. And of course I still feel Luke agreed to the test because he’d\nPracticed that answer to seem honest. He wanted you to just believe him.",
      "created_utc": 1726152685.0,
      "score": 7
    },
    {
      "id": "lmtaqj1",
      "body": "Pick up one of your kids with your eye in full view.   When someone asks what happen, just shake your head and say that Amy came to your house attacked you.   Don't give any details, just say that the police are dealing with her.   One person is all it will take for narrative about you that Luke has been promoting to go out the window.",
      "created_utc": 1726169140.0,
      "score": 18
    },
    {
      "id": "lmrr9mi",
      "body": "You should post it on social media the second you get the ok from your lawyer. There’s really no reason you can’t cut out the portion where she’s attacking you and post it so long as you give police access to the original.",
      "created_utc": 1726151422.0,
      "score": 30
    },
    {
      "id": "lmrn4oz",
      "body": "Yes, but you also have to consider that she may be on the path to having a psychotic break, because if she gradually became more violent when she didn't get what she wanted, it seems like it's only a matter of time before she completely explodes. I know you are also thinking about the well-being of her children, but this means ensuring their safety as well. If she has already reacted like this to you, imagine how she might react to Tom if she found out that he took the test behind her back, she could very well feel betrayed. If something happens to her, who these children will stay with? Maybe it's time to tell Cat and Jim that there is a possibility that one of them really are Luke's children, since you confirmed it and have proof of the case. Talk about this situation with your lawyers, because if Amy is arrested, the children can stay with their parents, and perhaps this will also help with full custody of your children. Oh and last thing, as a precaution, notify your children's school that no one other than you can pick them up, let them know that Amy and Luke are prohibited from trying to pick up any of them. Anyway, good luck, I hope you can get out of this. (sorry if the text is a bit incoherent, I ran it through the translator, lol)",
      "created_utc": 1726150007.0,
      "score": 26
    },
    {
      "id": "ln52bx0",
      "body": "I’d sent a picture of your back eye to your in laws, and possibly even your soon to be ex, saying “call off your dog, keep Amy away from my house”. He needs to be made to feel like shit, even if he doesn’t feel guilt about his affair he should about the fact that she attacked you.",
      "created_utc": 1726345722.0,
      "score": 4
    },
    {
      "id": "lmv93wl",
      "body": "It says so much about you that you are helping and supporting Tom. You have the strength of moral character with a sound motherly instinct. I applaud you in this specific part of this insanity. (Though you are handling this all with intelligence and grace) You don't take it out on her children and even speak of them with a protective nature. I have a feeling Tom will leave his mother behind because of this, and he will need you more. His siblings will likely follow him, and kaylee and potentially the twins will need their other siblings in this as well. Also, I am worried that his real father is a smoking gun in all of this.",
      "created_utc": 1726194094.0,
      "score": 11
    },
    {
      "id": "lnpnjc6",
      "body": "Did Luke tell you, or did Amy? Or did you find out through the letters?",
      "created_utc": 1726655323.0,
      "score": 5
    },
    {
      "id": "lnqevm6",
      "body": "When will this update be I'm checking back daily at this point lol",
      "created_utc": 1726667484.0,
      "score": 13
    },
    {
      "id": "lnpj0qe",
      "body": "Wish you the best of luck",
      "created_utc": 1726652348.0,
      "score": 3
    },
    {
      "id": "lnqp3ct",
      "body": "I mean she attacked you and destroyed you computer in an effort to force you to do what she wants am not sure what could stop you from pressing charges against this toxic person.",
      "created_utc": 1726670934.0,
      "score": 4
    },
    {
      "id": "lmrjymu",
      "body": "Good and you told your lawyers?\n\nHugs!!",
      "created_utc": 1726148897.0,
      "score": 50
    },
    {
      "id": "lmrxdyn",
      "body": "OP did your lawyer get a full back up of the phone and laptop just photos and texts?",
      "created_utc": 1726153435.0,
      "score": 5
    },
    {
      "id": "lmseu6w",
      "body": "I know that 😊 I was just in a similar situation with mine for work. Not it being shamed by an AP but we needed the info on the harderive. I know the evidence wasn’t on it but her personal stuff like family photos and documents she might need",
      "created_utc": 1726159031.0,
      "score": 4
    },
    {
      "id": "lmrkang",
      "body": "Crap. I got nothing then. Amy's is becoming unhinged. Please be careful with  your safety.",
      "created_utc": 1726149017.0,
      "score": 17
    },
    {
      "id": "lmtv0q6",
      "body": "If anything once Tom is 18 you can gift him an ancestryDNA kit or something. It could be a way for him to find family if he wants to. Or he can purchase it for himself.",
      "created_utc": 1726175597.0,
      "score": 5
    },
    {
      "id": "lms3h5t",
      "body": "lol",
      "created_utc": 1726155420.0,
      "score": 4
    },
    {
      "id": "lmsqum7",
      "body": "and i would gladly read that too xD",
      "created_utc": 1726162759.0,
      "score": 6
    },
    {
      "id": "lmrmypq",
      "body": "You can tell them that you now know, beyond a shadow of doubt, that Amy and Luke were engaged in an affair. That you will not show them the proof of that as it would be inappropriate. Tell them straight up that you want to be as honest as possible but that you never want to bad mouth their dad. That you love all of them (your kids) and will always be there for them. I think you should tell them directly as it is likely someone at school will talk about it.",
      "created_utc": 1726149950.0,
      "score": 36
    },
    {
      "id": "lmsvmfy",
      "body": "It’s actually probably not a conflict of interest.  If he isn’t currently doing any legal work for Luke and his past work for you both was unrelated to this matter, it isn’t likely to be an issue.  People don’t understand the rules of ethics on these points, but if they were as rigid as this commenter thinks, there would be an even greater problem in rural areas finding anyone who could represent you!",
      "created_utc": 1726164250.0,
      "score": 7
    },
    {
      "id": "lmsqy76",
      "body": "I assume almost every story is fake, but am down to read if well written. I'd say the first post was good and believable, but it's gotten really bad, really fast. Starting to get into too many places to screw up(laws, timelines, details, etc.). I'm guessing that them replying to comments is also influencing the story.",
      "created_utc": 1726162790.0,
      "score": 15
    },
    {
      "id": "lms8zqh",
      "body": "Lmao thanks for taking the bullet",
      "created_utc": 1726157176.0,
      "score": 4
    },
    {
      "id": "lmvdlzr",
      "body": "Got it.",
      "created_utc": 1726195847.0,
      "score": 8
    },
    {
      "id": "lmtd3j3",
      "body": "Right! She’s been having her cake and eating it too. And honestly girl has been tolerant until now. She rocking her boat and she is big mad. This makes sense! She is going lose everything and is desperate. As she should lose everything because it was built off the backs of others.",
      "created_utc": 1726169903.0,
      "score": 121
    },
    {
      "id": "lmu8gb2",
      "body": "If for some reason Jim had actually fathered Amy's children, maybe she's blackmailing him which is where all the money was coming into play!!!",
      "created_utc": 1726180223.0,
      "score": 7
    },
    {
      "id": "lmu8h2m",
      "body": "If for some reason Jim had actually fathered Amy's children, maybe she's blackmailing him which is where all the money was coming into play!!!",
      "created_utc": 1726180231.0,
      "score": 3
    },
    {
      "id": "lmtu576",
      "body": "I would prefer book format.  I could read it in peace.",
      "created_utc": 1726175318.0,
      "score": 68
    },
    {
      "id": "lnxc4dk",
      "body": "Or Jim didn’t want to believe his son would do that!\nDe-nial is a river in Egypt.",
      "created_utc": 1726766237.0,
      "score": 4
    },
    {
      "id": "ln9wgy9",
      "body": "Tom and Sophie would still match some DNA from their mutual grandma, Luke’s mom. Which they don’t. I lean towards Luke not knowing Tom is NOT his son.",
      "created_utc": 1726419984.0,
      "score": 4
    },
    {
      "id": "lmurw76",
      "body": "Lol my grandpa was allergic to corn, wheat, any grains basically then my uncle and my mother are allergic to corn, wheat, any grains basically. My uncle got a chocolate allergy to add on and my mother got a tree nut allergy to add on.\n\nAs a child I was allergic to corn, wheat, egg, basically any grain, chocolate, and tree nuts. Now I’m only allergic to tree nuts. (I’m probably allergic to the other stuff mildly as opposed to anaphylaxis, but I’m in the “Chuck it in the fuck it bucket” era of my life) \n\nWe are definitely all related for sure. 😂 Besides all being basically the same personality distilled into different vessels. Also, sooooo much ADHD. Just rampant, florid ADHD 😂",
      "created_utc": 1726187591.0,
      "score": 9
    },
    {
      "id": "lmsor32",
      "body": "I’m banking on different fathers who are also married to other women in the community.",
      "created_utc": 1726162109.0,
      "score": 106
    },
    {
      "id": "lmsrh4a",
      "body": "Or maybe he's the only one that was not fathered by Luke.",
      "created_utc": 1726162956.0,
      "score": 29
    },
    {
      "id": "lmt46rt",
      "body": "Agreed. You're doing amazing in your handling of this terrible situation, OP. Kudos to you for your strength and integrity. My heart is with you and the kids.",
      "created_utc": 1726167005.0,
      "score": 28
    },
    {
      "id": "lmtompk",
      "body": "Yeah, I'm wondering if there's something on the messages and videos that could be worse than an affair.\n\nMaybe child support fraud, some kind of sketchy business dealings. SOMETHING. \n\nMaybe it's simply the affair, but her reaction of panic and desperation really makes me curious as to what she THINKS is on there!",
      "created_utc": 1726173580.0,
      "score": 28
    },
    {
      "id": "lms5opd",
      "body": "The district attorney is the one who determines charges. An individual can only file a police report.",
      "created_utc": 1726156128.0,
      "score": 44
    },
    {
      "id": "lmsijeb",
      "body": "There’s also the woman whose name I can’t remember who was married to Ted with several brothers, one of whom did something very toxic. (I believe it was referred to as PeeGate). She’s also both a very talented writer and has used it to process. I don’t believe she’s posted in a while. I really felt for her and hope no update is the best.",
      "created_utc": 1726160179.0,
      "score": 20
    },
    {
      "id": "lmusdfb",
      "body": "And now OP will be able to put in her divorce proceedings that Amy is not to be around her children when Luke has custody as Amy assaulted her so she's worried for her children's safety",
      "created_utc": 1726187774.0,
      "score": 10
    },
    {
      "id": "lmu6c8j",
      "body": "Do you remember which post or user it was?",
      "created_utc": 1726179457.0,
      "score": 5
    },
    {
      "id": "lmu8036",
      "body": "I loved her story read the entire thing.  She rocked!",
      "created_utc": 1726180057.0,
      "score": 3
    },
    {
      "id": "lmrotxa",
      "body": "It's possible Amy claimed Tom was Luke's to get some degree of control over him at the beginning. She may be hiding Tom's paternity from Luke.",
      "created_utc": 1726150595.0,
      "score": 59
    },
    {
      "id": "lmrym39",
      "body": "I think this is what Amy fears and why she wants OP to keep her name out of the divorce.",
      "created_utc": 1726153836.0,
      "score": 17
    },
    {
      "id": "lmrpx27",
      "body": "Hmmm…maybe you’re onto something. \n\nI was thinking that they both knew that Tom wasn’t Luke’s which is why they didn’t care about Sophie dating Tom but maybe, you’re right that they slept together early into Luke’s marriage and then Amy turns up pregnant and tells Luke it’s his. He wants to keep it quiet and she threatens to tell everyone unless he continues the affair. If that’s the case then Luke is gonna feel like the dumbest mo fo when he finds out 😂",
      "created_utc": 1726150968.0,
      "score": 20
    },
    {
      "id": "lmrqhdg",
      "body": "This is the angle I believe it’s more than likely the case.",
      "created_utc": 1726151159.0,
      "score": 11
    },
    {
      "id": "lmsrx4a",
      "body": "The adults all agreed that Tom and Sophie *shouldn't* date.",
      "created_utc": 1726163094.0,
      "score": 2
    },
    {
      "id": "lnqozi7",
      "body": "Be patient. This is a real human being going through this. She will update when she’s ready. I think it’s important for us to understand this is not entertaining to OP. So let’s be considerate.",
      "created_utc": 1726670899.0,
      "score": 33
    },
    {
      "id": "lnqp20x",
      "body": "Be patient. This is a real human being going through this. She will update when she’s ready. I think it’s important for us to understand this is not entertaining to OP. So let’s be considerate.",
      "created_utc": 1726670922.0,
      "score": 12
    },
    {
      "id": "lmrkrnj",
      "body": "Literally within five minutes of her leaving lol",
      "created_utc": 1726149184.0,
      "score": 115
    },
    {
      "id": "lmujyk4",
      "body": ">She’s been having her cake and eating it too.\n\nAnd now she's so bloated they'll have to roll her ass to the streets where she belongs. 😂\n\nKinda hard to run when you're obscenely overweight.",
      "created_utc": 1726184553.0,
      "score": 45
    },
    {
      "id": "lmv8ac8",
      "body": "Amy wants OP to just divorce without spilling the T so she can continue living her best life. Buh bye Amy!",
      "created_utc": 1726193798.0,
      "score": 16
    },
    {
      "id": "lmuy0hm",
      "body": "But she has the videos of Amy & Luke recording themselves over years having sex at their house & Amy’s!",
      "created_utc": 1726189898.0,
      "score": 7
    },
    {
      "id": "lmu3e4y",
      "body": "BOTH!",
      "created_utc": 1726178403.0,
      "score": 10
    },
    {
      "id": "lmt6h1r",
      "body": "She was pretty adamant about Tom not being tested and he isn't Luke's son ...so who is his Daddy?",
      "created_utc": 1726167748.0,
      "score": 42
    },
    {
      "id": "lmtj83c",
      "body": "This is that I think. And Luke knows it.",
      "created_utc": 1726171868.0,
      "score": 8
    },
    {
      "id": "lms653o",
      "body": "I stand corrected!",
      "created_utc": 1726156273.0,
      "score": 22
    },
    {
      "id": "lmrs385",
      "body": "Yeah, whatever pathology that Amy has and included Luke in, I’m sure there is some sort of mutual logic that isn’t going to make sense when exposed to the light of day. \n\nFor those saying Amy may not be a homewrecker and it isn’t really cheating… I say, Amy was virtually raised as Luke’s sister and the OP acted on that in good faith. Whatever pathology Amy/Luke have should not allow for blaming the OP",
      "created_utc": 1726151696.0,
      "score": 29
    },
    {
      "id": "lmsht30",
      "body": "Most states, and mine as well require one even if no one is disputing paternity",
      "created_utc": 1726159953.0,
      "score": 5
    },
    {
      "id": "lmrw9w9",
      "body": "One of my theories is that they were already making out while he was dating OP, and maybe Luke had decided to end the affair or something when they were getting married (I know it was op who proposed), and then Amy \"trapped\" him with the baby. And since she was pregnant and he had literally just gotten married, the guy must have accepted having both families, he continued with the affair and Amy had his bio child, which would be Kaylee, who also inherited Luke's condition, so Luke must have suspected even less that Tom wasn't his son. Regarding the issue of Tom and Sophie, as disgusting as it is, maybe Luke didn't end up being so strict so as not to lose his facade, maybe the thought was \"As long as they don't get married and have children\", since it would be just a little teenage fling in case they actually ended up secretly hooking up. Which is extremely disturbing, since in this scenario he would be aware that his children could end up having an affair. But then Amy would know that Tom is not in fact Sophie's brother, and that should ease her conscience even more, but she agreed to be against the relationship to continue HER facade for Luke. But anyway, I made this up in my head and it's just a theory, but to me the idea of ​​her keeping Luke with Tom until she has biological children with him makes a lot of sense lol",
      "created_utc": 1726153072.0,
      "score": 7
    },
    {
      "id": "lmrkvlb",
      "body": "You rock!!!!",
      "created_utc": 1726149224.0,
      "score": 33
    },
    {
      "id": "lmutclj",
      "body": "Has Luke contacted you after the attack?",
      "created_utc": 1726188138.0,
      "score": 16
    },
    {
      "id": "lmuyaf3",
      "body": "But...that still doesn't mean she wasn't ALSO with Jim.\nFace it, Amy doesn't seem like the most ethical person",
      "created_utc": 1726190004.0,
      "score": 9
    },
    {
      "id": "lmtohrr",
      "body": "I suspect they didn't know that Tom wasn't related to Luke. They didn't want him dating Sophie for that reason.",
      "created_utc": 1726173539.0,
      "score": 12
    },
    {
      "id": "lmsjiw6",
      "body": "It’s ok. A lot of people don’t understand the mechanics of it all. The police take a report and then that plus any information from an investigation gets submitted to the DAs office. They analyze everything to see what criminal statutes the crimes fall in to and then file charges based on that.",
      "created_utc": 1726160481.0,
      "score": 27
    },
    {
      "id": "lmrtw1c",
      "body": "Whoever said that completely missed the part where OP found YEARS of emails, pictures and videos. If people don’t read all the updates and OP’s comments they shouldn’t ask questions or post opinions because theyre just very repetitive and I’m sure, to OP, annoying.",
      "created_utc": 1726152295.0,
      "score": 30
    },
    {
      "id": "lmsyf78",
      "body": "Who the hell would say it’s not cheating?! Luke lied about the nature of his relationship with Amy for nearly two decades and OP was led to believe she was in a monogamous relationship!",
      "created_utc": 1726165148.0,
      "score": 7
    },
    {
      "id": "lmuzoo8",
      "body": "Left two more voicemails. I haven't listened to them yet.",
      "created_utc": 1726190531.0,
      "score": 31
    },
    {
      "id": "lmu5tel",
      "body": "Or did Amy know that he wasn't the father? Which is why she didn't want him tested. \nMaybe she was just going along with Luke so he wouldn't suspect anything either.",
      "created_utc": 1726179268.0,
      "score": 15
    },
    {
      "id": "lmu1fsz",
      "body": "Yes, but victims can absolutely speak with the DA and push for charges. However you are correct that the DA has the final day in any criminal charges.",
      "created_utc": 1726177729.0,
      "score": 8
    },
    {
      "id": "lmrwa2f",
      "body": "Agreed! OP treated Amy like close family. That should be applauded!",
      "created_utc": 1726153073.0,
      "score": 8
    },
    {
      "id": "lmt7vlr",
      "body": "I scratched my head on it, but a small subset were throwing out the “I wouldn’t call it home-wrecking”, talking about polygamy, and how being close to Amy invited this in. \n\nI was putting my (less than) 2 cents in because that’s the last thing the OP needs, in my opinion. It appears that OP and Cat/Jim acted super honorably, adopting Amy into the family. \n\nWe need more people like OP, Cat and Jim in the world, not less.",
      "created_utc": 1726168206.0,
      "score": 6
    },
    {
      "id": "lmvafqk",
      "body": "I am surprised he hasn't drove to your place to check on you if he knew that you got hurt from the physical fight. Husband of the year isn't he.",
      "created_utc": 1726194593.0,
      "score": 15
    },
    {
      "id": "lmv8et8",
      "body": "Can you tell us what his voicemails said or like a watered down version of what he said? I’m sure Amy probably told him that she either ended up snapping & attacking you or that you snapped & attacked her. Just don’t let them know how monitored you have your house now. You also might want to put a camera down your hallways. I know with our ring camera’s in the house I turn them on & off as needed. Like if someone comes to the door I turn the inside camera on before I open the door just incase. Or if the dogs are alone in the house I turn it on to make sure they don’t loose their minds & destroy the place. (I have 1 dog that got upset with use & at the whole middle top half of the couch. Down to the springs & wood. )",
      "created_utc": 1726193846.0,
      "score": 29
    },
    {
      "id": "lmu5w95",
      "body": "All guesswork and speculation of course",
      "created_utc": 1726179297.0,
      "score": 7
    },
    {
      "id": "lmvd7qa",
      "body": "100%. It’s just really common to see people say that the person themselves should press charges. I always feel sad that it’s so much more complicated than that.",
      "created_utc": 1726195683.0,
      "score": 6
    },
    {
      "id": "lmvaxs9",
      "body": "A lot of lies. A lot of emotional manipulation and sweet-talking. Basically, more of the nonsense he gave me when we separated. \n\nHe apologized for what Amy \"losing her temper\" but acted like I shared responsibility because I \"started all this.\" That I had \"violated her privacy\" and I needed to just delete whatever I found, if I found anything. (He didn't sound AS certain that I had been through the laptop. I almost got the sense that he wished Amy hadn't made the accusation.)",
      "created_utc": 1726194785.0,
      "score": 85
    }
  ]
}