{
  "id": "1dum7jp",
  "title": "I recorded my wife cheating on me and I can't stop watching it. ",
  "selftext": "A couple weeks ago I decided I wanted to surprise my wife with a kid-free night out. My parents live about an hour and a half away from us and I arranged for the kids to stay with them for the weekend. \n\nUsually, when I go to my parents I am gone until later in the evening. We spend all day there and leave around dinner time. This time, I was dropping the kids off and immediately going home so I could surprise my wife and we could go out as soon as possible. I had made reservations at a nice restaurant and was hoping to go to a few places for some drinks first.  \n\nI left at 8:30 and was back in our housing plan before 12:30. As I pulled onto my street I saw a truck parked in front of my house. I did not recognize it. I assumed it was someone seeing the neighbors though because it's not that unusual for someone to park in front of our house. \n\nI parked a few houses away thinking I would sneak into the house and surprise my wife instead of pulling in the driveway and going in the garage. \n\nI went in through a basement door. I was as quiet as possible but as soon as I walked in I heard her making sounds from the floor above.  When I first heard it I thought she was just by herself, maybe having some personal time.  I didn’t want to interrupt her privacy and embarrass her so I was going to go back to my car and just go in the garage so she would know I was home.  Then I heard a man’s voice.  I immediately felt sick. My heart felt like it was going to explode out of my chest. \n\nIt is hard to describe how I felt in this moment.  I decided to go upstairs.  I had no desire to confront them, I just wanted to see what was going on.  I moved slowly and quietly and went up the stairs.  The door was halfway open. The kitchen was empty but I could tell they were in the living room.  It was obvious what was going on at this point by the sounds.\n\nThere was no way for me to look in the living room without them seeing me. I pulled out my phone and opened my camera app. I put my phone just around the corner of a wall.\n\nThis part is so hard to write.  I could see my wife with a man I didn’t recognize.  I won’t go into detail on what they were doing but I think you can figure it out.  I started recording it, I was thinking that I needed a record of it for whatever I decided to do in the future.  I just stood there in my kitchen, watching this all unfold on my phone screen.  I felt like I could just scream at any moment but for some reason I just froze completely.  This went on for several minutes.  \n\nShe finally jumped off of him and made a comment about going to the bedroom and they went upstairs.  She even made a comment about how much time they had left.\n\nI walked into the living room and found the guy’s pants. I took his wallet out and took pictures of his driver's license. I know his name and his address now. I've never met him. I have no idea how my wife knows him. \n\nI left the house the same way I entered. I went back to my car and cried like the pathetic man I am. I decided to watch the video to make sure it recorded. I watched it all. \n\nI'll spare the details but I sat in my car for at least half an hour. I couldn't drive to my parents and get the kids as I would have to explain why. I decided that I would pull in the driveway, open the garage, and just pretend like I was there to surprise her. I took my time getting into the house. I made a lot of noise.  When I saw her she was very flustered asking me why I was home, etc.  She was in a robe and said she was just getting ready for a bath. \n\nI told her about my plans and she seemed excited.  She poured us both a glass of wine and said we should pregame before getting ready.  I don’t think I talked much really.  She took me into the living room.  I’m not proud of what I let happen.  I could faintly see the guy sneaking downstairs and going to the basement stairs but I didn’t say or do anything, I just let my wife continue doing what she was doing to me.  \n\nSince that day, I have watched the video of her repeatedly.  I can’t bring myself to make any decisions on what I should do next.  She seems to know something is wrong with me because she’s asked a few times if I’m ok.  \n\nI feel worthless and every time I hit a low point I watch that video again.  I feel like I've watched it at least 10 times a day since I caught them. \n\n",
  "created_utc": 1720033038.0,
  "score": 5112,
  "num_comments": 670,
  "url": "https://www.reddit.com/r/offmychest/comments/1dum7jp/i_recorded_my_wife_cheating_on_me_and_i_cant_stop/",
  "comments": [
    {
      "id": "lbhurb9",
      "body": "Dude, get tested. Do a full panel.\n\nHow young are your kids? I'm so sorry this happened to you. That was very traumatic. Do you have friends or family you can talk to?",
      "created_utc": 1720037648.0,
      "score": 3756
    },
    {
      "id": "lbhk5vv",
      "body": "If you haven’t told her yet I suggest you talk to a lawyer first and prepare the divorce",
      "created_utc": 1720034073.0,
      "score": 6228
    },
    {
      "id": "lbhoej8",
      "body": "Your comment ‘like the pathetic man I am’ made me so so very sad for you. You have every right to be upset, to be hurt, and to cry. I am so sorry this happened to you.",
      "created_utc": 1720035504.0,
      "score": 2662
    },
    {
      "id": "lbi26ro",
      "body": "First of all, don’t do anything that will put custody of your kids and your finances at risk. And yes, that involves dealing with AP. He isn’t your problem right now. Your problem is your cheating wife. You can deal with AP later after you’ve secured your future.\n \nHere are your next steps.\n\n1. Get tested. \n\n2. Find a therapist and seek counseling now. Please know none of this is your fault. Even if she tells you later that there were issues in your marriage. Repeat after me: This is not my fault. \n\n3. Sort out your finances. \n \n4. Find a lawyer.\n \n5. Give her the divorce paperwork.",
      "created_utc": 1720040147.0,
      "score": 616
    },
    {
      "id": "lbhrm1g",
      "body": "There are 2 things you SHOULD NOT do in this situation:\n\n\n1. Don't look for \"revenge\" against her and/or the guy, it'll just hurt you more and worst case, put you in jail. \n\n\n2. Don't let her hurt you like this again, because if you stay with her, she will.",
      "created_utc": 1720036586.0,
      "score": 1736
    },
    {
      "id": "lbiakn3",
      "body": "Back up the file to the cloud. Remove it from your phone. You don’t want her to find it before you’re ready to confront her and you don’t want her to delete your evidence.",
      "created_utc": 1720043069.0,
      "score": 185
    },
    {
      "id": "lbhtrcp",
      "body": "You at least check for cash in his wallet?",
      "created_utc": 1720037309.0,
      "score": 546
    },
    {
      "id": "lbho3ir",
      "body": "Lawyer up and get to the gym. So sorry but that’s all the advice there is to give",
      "created_utc": 1720035402.0,
      "score": 768
    },
    {
      "id": "lbhuyym",
      "body": "Please talk to a lawyer and go through divorce proceedings. For the love of God get your ducks in a row before doing this (make multiple copies of said video so there’s no way she can tamper with it) and DO NOT let her convince you to “work things out”. She’ll throw the book of excuses at you “this was the only time” “but the kids”. Ignore all of that and get out while you can. Thank God you had the wherewithal to record the evidence because lord knows how much money you would’ve lost if it was a “he said she said” situation. It’s gonna be hard with the kids and all but I’m sure they’ll side with you when you decide the time is right to tell them the real story. I feel for you heavy man, I wouldn’t wish this on my worst enemy. But for the time being you have to power through and put your emotions at bay so you can file for divorce.",
      "created_utc": 1720037722.0,
      "score": 87
    },
    {
      "id": "lbhsnvr",
      "body": "Props to all the people who caught their SO cheating and say they can go home and act like they know nothing",
      "created_utc": 1720036940.0,
      "score": 207
    },
    {
      "id": "lbho7bq",
      "body": "Divorce . Honestly please tell what you saw after you get a lawyer and this just hurts after seeing your wife cheat on you. I honestly dislike cheaters  I just don't get why they don't communicate their issues but resort the cheating. Saying as a child whose dad who cheated muliple times. You deserve better.",
      "created_utc": 1720035437.0,
      "score": 146
    },
    {
      "id": "lbhwl9v",
      "body": "My heart broke for you while reading.\n\nI kind of do the same with the letters my father wrote me which made me cut contact with him. I think I do it to validate my emotions when I doubt them. That my decision was good and that it’s alright to be angry and hurt.\n\nMaybe it’s the same for you although I think  you still have to process all those emotions. It’s ok to feel how you feel. You’re allowed to cry, scream and mourn what you once had and now is gone and destroyed.\n\nYou’re not pathetic. You are human and you are allowed to have all these emotion.",
      "created_utc": 1720038270.0,
      "score": 57
    },
    {
      "id": "lbhwevz",
      "body": "Go to a lawyer, immediately! Get STD tested! I’m so sorry!",
      "created_utc": 1720038209.0,
      "score": 31
    },
    {
      "id": "lbivih4",
      "body": "OP. The minds job is to protect us from pain. In your case seeing your wife having sex with another man was painful on many levels. So, the mind sexualized it as a coping mechanism to deal with the trauma. \n\nThe mind is a beautiful servant, but a dangerous master …",
      "created_utc": 1720051182.0,
      "score": 29
    },
    {
      "id": "lbhijf4",
      "body": "My friend it’s okay to feel everything you’re feeling as you’ve been betrayed, hurt, and lied to by someone who you’ve devoted your life to. My advice is you need to confront her. It feels\nThat you’re in denial about the whole thing — and I can’t blame you. You may never rfeel ready to talk to talk to your wife about what you know but you should do it soon and have a very real conversation about your next steps. Sending you so much support though.",
      "created_utc": 1720033530.0,
      "score": 83
    },
    {
      "id": "lbi2kyk",
      "body": "First and most importantly - you’re not worthless. Please always remember this. Your value is not related to what someone else does.\n\nYou know what you need to do in regards to her. But what you also need to do is take that video off of your phone. I speak from experience, though mine is a little more dated in the medium. I dated and lived with a man for four years and he cheated on me. He took Polaroids of her wearing my BDSM gear and my sleep mask. I threw up when I first saw them. Yet I kept looking at them. I had to get rid of them. I actually sent them to her since I knew who she was.\n\nMy husband cheated, too. But emotionally - and I was given their chats by her when he broke up with her. I read them over and over. There were things in there about him not liking me and other things that gutted me. I kept referring back to them. Finally I just scanned the papers (she gave them to me in my mailbox as printouts) with a password and stored them somewhere I wouldn’t look at them regularly.\n\nIt will take a few weeks until you won’t feel the need to watch it repeatedly. You need to tell a friend or therapist what happened. Someone who you can talk to and cry about it. Then, move on and serve her with divorce papers.",
      "created_utc": 1720040279.0,
      "score": 23
    },
    {
      "id": "lbixaox",
      "body": "Back up the video, so she can't erase it.",
      "created_utc": 1720051913.0,
      "score": 23
    },
    {
      "id": "lbjrj4s",
      "body": "1. Talk to a lawyer\n2. Cancel any joint accounts, or take your name off them and record current balances.\n3) take half of any joint savings, checking, etc and put the money in separate, passworded accounts\n4) have your paycheck deposited in the new account\n5) get counseling \n6) divorce her\n\nYou're not pathetic, you're traumatized.",
      "created_utc": 1720065165.0,
      "score": 23
    },
    {
      "id": "lbhtkeh",
      "body": "So what happened to his pants and truck? He run out without his pants? What did wife say about the truck in the driveway? Wife kick his pants under the couch?",
      "created_utc": 1720037244.0,
      "score": 52
    },
    {
      "id": "lbhs13j",
      "body": "You are NOT pathetic. You have just been punched in the face. All of your emotions are raw and painful. You need to get logical and talk to a lawyer and get your money straight. You do need to remember thar she is still the mother of your children and to be sure that they don't suffer. But she did you dirty.",
      "created_utc": 1720036729.0,
      "score": 47
    },
    {
      "id": "lbiw58s",
      "body": "You aren’t pathetic for feeling emotions. You deserve kindness from yourself",
      "created_utc": 1720051443.0,
      "score": 17
    },
    {
      "id": "lbhrros",
      "body": "She will continue with this affair as long as you don’t inform her that you have red caught handed. She will deny that she had done any such thing and try to make you believe you are mistaken until you president the video and photos of his license. If you don’t want to save your marriage I suggest you obtain a lawyer and make sure she doesn’t have any financial gain from you as well as for the children this is your decision to make and only yours.",
      "created_utc": 1720036639.0,
      "score": 29
    },
    {
      "id": "lbibzho",
      "body": "She's for the street bro",
      "created_utc": 1720043576.0,
      "score": 26
    },
    {
      "id": "lbi2q6v",
      "body": "I claim BS.",
      "created_utc": 1720040327.0,
      "score": 58
    },
    {
      "id": "lbhxxd8",
      "body": "DABDA: Denial, Anger, Bargaining, Depression, Acceptance.\n\nOP, what you're doing is grieving. And that is a one hundred percent normal response. Take the time you need.\n\nRemind yourself that you are not worthless. You are a strong man who showed remarkable restraint in the moment. A lesser man would have let his lizard brain take over and done something he'd regret, and possibly got him locked up. You played it smart (whether you thought so in the moment is irrelevant; it was smart), gathered evidence, and kept the situation under control. You have conducted yourself admirably.\n\nTake the time you need to grieve. Then find a lawyer. Follow his/her guidance. Don't rush to confront your wife or show her the video. There will be time for that later. Make sure you get yourself organized and protected first, because when she finds out that you know, it's likely to kick off. Make sure you have prepared everything you can before that happens; it will minimize her chances to make additional trouble, and leave you better positioned to deal with whatever trouble she does make.\n\nThere are kids involved: it goes without saying that they are the top priority here. What might not be obvious is that you can't look after them if you are a shambles. You know how in the airplane they tell you to put your own mask on first, then your child's? Same here. Put your own mask on first. Take care of yourself, make sure you have the support you need to come through this more or less intact. You'll be a much more effective advocate for your kids that way.\n\nI'm so sorry she did this to you, OP. I wish you best of luck as you deal with the mess she made here.",
      "created_utc": 1720038720.0,
      "score": 10
    },
    {
      "id": "lbi1xwe",
      "body": "1 you need to get away from her. \n\n2 take a test to see that you have not been infected with a rare disease. \n\n3 do not delete the video under any circumstances. have backup.",
      "created_utc": 1720040063.0,
      "score": 8
    },
    {
      "id": "lbhwm6u",
      "body": "Contact the attorney and take the video put it on a stick and give it to him for evidence and then take it off your phone. Actually leave it there to show her from when you tell her if you want to do that if not, I would just ghost her.  Maybe put it on a stick and leave it with your ring somewhere where she can find them.",
      "created_utc": 1720038279.0,
      "score": 8
    },
    {
      "id": "lbinypo",
      "body": "Why do you feel worthless? \nYou’re not the lying piece of shit.\n\nDude this is a very traumatic moment, of course you’re shocked out of your mind and have no idea wtf to do with yourself— that doesn’t make you worthless, it makes you so mind blown that you’re in a state of wtf.\n\nIt takes time to come to terms with it before deciding what to do next, and it’s hard. \n\nBut you’re not worthless at all, she’s the badguy, not you. This isn’t your fault and it’s not fair.",
      "created_utc": 1720048153.0,
      "score": 8
    },
    {
      "id": "lbhptoc",
      "body": "The angry part of me says to play the long game and get revenge. Logically, get a lawyer. I’m so sorry",
      "created_utc": 1720035984.0,
      "score": 35
    },
    {
      "id": "lbk4cn5",
      "body": "Marriage is over whether you choose to accept it or not. You don’t work for her anymore. Time for scorched earth. There’s no going back to the way it used to be. You’re officially broken. Her recent actions are the cause. \n\nYeah, first thing first. Remember you still have the element of surprise. You also have lots of leverage. Talk to a lawyer. Pay a 1 hour consult of a decent FEMALE lawyer. I repeat FEMALE. Women know how to deal with women. Preferably one that has a hard spot for adultery. Understand your position in a court of law. What you (as a male in your state) stand to gain/lose. \n\nTHERE IS NO WORKING THIS OUT. If you stay wife will lose even more respect. She will be dormant for a bit until the coast is clear then later The shit will get much worse. Don’t think about the kids. It will BLUNT your resolve. Get them OUT of that situation. She tore up the family and cheated on them too. She doesn’t care. She doesn’t deserve any of you. \n\nNext, the moment you decide to alert her you know of the affair and that you have a lawyer and filed for divorce, get your ass in touch with select family and friends— CONTROL THE NARRATIVE. If you don’t get to them first she MOST definitely will. You will be the villain. Believe that. \n\nAny close friends she has assume they already know that she’s been cheating. They are also the enemy. Chances are they cheat too. Be careful who u tell your divorce plans. \n\nTime to cowboy up. Take no prisoners",
      "created_utc": 1720072025.0,
      "score": 7
    },
    {
      "id": "lbj85c4",
      "body": "Beautiful work of fiction, I especially loved the “crying like the pathetic man I am part”. \n\nYou have a good future ahead of you in creative writing, keep it up 👍🏻",
      "created_utc": 1720056458.0,
      "score": 27
    },
    {
      "id": "lbi3raz",
      "body": "You're NOT pathetic, you are frozen, some people fight, some people flee, you the kind that freeze and that's ok, you just need time to process things, more than others and that's ok too. Take your time to figure out your next steps, first one is secure that video in the cloud, and then talk to a lawyer, even if divorce is not in your immediate plans, having someone on your side and that maybe get the ball rolling when you are in no condition to play ball yet, drafting divorce papers and knowing what your options are moving forward with divorce will help you start the making decision process. Then you'll decide what you want to do.",
      "created_utc": 1720040677.0,
      "score": 6
    },
    {
      "id": "lbihs75",
      "body": "This sounds like a fantasy. What man worth their weight wouldn't go to the garage for a baseball bat and beat the hell out of the dude.",
      "created_utc": 1720045755.0,
      "score": 11
    },
    {
      "id": "lbhp81o",
      "body": "Contact a lawyer and be civil dont do anything stupid to risk being damaged in the divorce",
      "created_utc": 1720035782.0,
      "score": 14
    },
    {
      "id": "lbkv9qq",
      "body": "I’m sorry but almost sounds like it’s not true. Why would you need to park down the street when you can park in your driveway or garage or whatever? The surprise would have been when you came back early. But even more to the point. You heard your wife having sex with another man and decided to take your phone out and record it? Not burst in yelling WTF or whatever? This sounds more like a porn fantasy about watching your partner sleep with someone else. But I could be totally off base and maybe all these random actions are what happened and that’s awful and I hope you leave and find someone better",
      "created_utc": 1720089905.0,
      "score": 10
    },
    {
      "id": "lbl0isf",
      "body": "This sounds like a fantasy",
      "created_utc": 1720092982.0,
      "score": 10
    },
    {
      "id": "lbhumfp",
      "body": "Sad",
      "created_utc": 1720037603.0,
      "score": 5
    },
    {
      "id": "lbin7ti",
      "body": "Having been divorced and also have watched a video of my ex cheating over and over, let me say that you shouldn’t let yourself believe you are guilty or like a loser for your feelings and what I’m sure is a compulsion to rewatch the video. \n\nHowever to echo other advice already given:\n\n1) lawyer up\n2) get to the gym\n3) prepare for a custody agreement",
      "created_utc": 1720047855.0,
      "score": 5
    },
    {
      "id": "lbizdmq",
      "body": "Just know that she will give an excuse. She will cry. She will apologize. You should actually practice what you will say after meeting with your lawyer. Be calm bc that tells her you’ve had time to think and have made up your mind. Don’t stay for the kids or financial purposes. You get one life and it goes fast. Make sure that life is full of love, trust, and honesty. Grief is love with no place to go, and she doesn’t deserve that love any longer. It’s normal to be upset and feel that loss. Don’t let anger and the words you say come back to haunt your memory of this life changing moment. That’s why I say practice what you will say. And lastly, I’m sorry you went through this—no one deserves this.",
      "created_utc": 1720052774.0,
      "score": 4
    },
    {
      "id": "lbo38q6",
      "body": "1. Get tested. She could give you the pox.\n2. Don’t have sex with her again, it could legally be considered forgiveness.\n3. Talk to a lawyer. If you don’t want to divorce her, you could still use this to extort her into signing a prenup.\n4. If she chooses to lie with dogs, let her. Just don’t let her give you the fleas.",
      "created_utc": 1720135294.0,
      "score": 4
    },
    {
      "id": "lbiq9jo",
      "body": "🧢🧢🧢🧢",
      "created_utc": 1720049070.0,
      "score": 9
    },
    {
      "id": "lbjv7x4",
      "body": "I’m calling cap on the whole thing",
      "created_utc": 1720067029.0,
      "score": 11
    },
    {
      "id": "lbi2zmo",
      "body": "I think rewatching the video is not an abnormal reaction. When I found the texts my cheating ex was sending to the girl he was seeing behind my back, I reread them endlessly, for weeks on end. It was 8 years ago but I still know them by heart. It's like I thought that if I kept reading them they'd stop hurting at some point ? And I also couldn't believe it at all.",
      "created_utc": 1720040415.0,
      "score": 4
    },
    {
      "id": "lbi5ftr",
      "body": "Have you ever seen Ozark because this reminds me of the beginning of the show",
      "created_utc": 1720041256.0,
      "score": 4
    },
    {
      "id": "lbiapn1",
      "body": "Wow OP that is so dark and cruel.  My jaw dropped while reading.  \n\nYou don’t deserve this.  You are not stupid.  \n\nYou are worthy.  I hope you are blessed with all the support and love and strength that you need to see this through.",
      "created_utc": 1720043119.0,
      "score": 4
    },
    {
      "id": "lbknvsk",
      "body": "Get tested immediately. \nYou keep watching it because your world has just been destroyed. You have the physical proof of what destroyed you. It’s the car accident you can’t look away from. \n\nYour wife sucks. You need to put you and your children first. That does not mean you have to stay with your cheating wife. You need to find happiness",
      "created_utc": 1720084896.0,
      "score": 4
    },
    {
      "id": "lbm64e0",
      "body": "Get 12 tons of rock delivered to the guys house tell them to dump it in the driveway",
      "created_utc": 1720109817.0,
      "score": 4
    },
    {
      "id": "lbmakpo",
      "body": "Man up and take action dude. Show her the video and tell her to get the fuck out of your house. Simple.",
      "created_utc": 1720111396.0,
      "score": 4
    },
    {
      "id": "lbmufwg",
      "body": "OP, seriously need to talk to someone to get things moving. This sounds like a suicide waiting to happen, you need to get a hold on this",
      "created_utc": 1720118366.0,
      "score": 3
    },
    {
      "id": "lbniiv3",
      "body": "A few years from now you gonna be sorry you didn't stole his money.  \nI wouldn't even call it stealing. It's compensation.",
      "created_utc": 1720127032.0,
      "score": 4
    },
    {
      "id": "lbhrfm9",
      "body": "And once again Reddit validated my worst fears",
      "created_utc": 1720036526.0,
      "score": 26
    },
    {
      "id": "lbip4p2",
      "body": "After she is served- like within minutes I would make sure the video is given to the wife. You know his name and address- social media shouldn't be too hard.\nI'm so sorry this is happening to you and your kids.",
      "created_utc": 1720048619.0,
      "score": 4
    },
    {
      "id": "lbhwq2p",
      "body": "Maintain the high ground so you don’t lose your kids. Demand and fight for at least 50/50, and don’t leave the house. Ask her to leave some the kids stay in their home. Contact a lawyer and follow their instructions to the letter. Also look into therapy for yourself and your kids. It’ll be hard, but don’t speak ill of your wife to your kids, ever. When they’re older, they can know the truth, but don’t be petty. Being petty can be used against you. \n\nOP this is hard, and no one wants to face a divorce from the one who was supposed to be your forever partner. I cried for hours when I knew my marriage was over and had to ask my ex for a divorce. It’s hard, but you will come out the other side. Your children will one day understand the situation, and they’ll see how strong you were if you take the necessary steps. Start with a lawyer, then a therapist.",
      "created_utc": 1720038316.0,
      "score": 3
    },
    {
      "id": "lbi0t2w",
      "body": "Post an update when you can. Sorry you’re going through this.",
      "created_utc": 1720039685.0,
      "score": 3
    },
    {
      "id": "lbi17ic",
      "body": "I have been in your shoes before only I didn’t catch them in the physical state but I read all the messages and seen all the money he was sending her and taking care of her and her two kids while he would leave me and his kids with little to nothing. He was making plans to move in with her and everything she knew all about me because I had been with him almost ten years at the time and she didn’t care that he had a family and at that time not only did I just have a baby five months before that but I had also miscarried twins. Do what I didn’t have the courage to do myself in that moment get as far away as possible toxic is toxic not only did she betray you but she was been lying and being disloyal as well. Idk how long you and her have been together but what I learned was this wasn’t the first time it was just the first time she got caught. He may not even be the only man she has cheated with in the relationship but you have every right to feel the way you do and if I was you I would stop looking at the video it’s just re-traumatizing you but it’s causing you to feel horrible about yourself when you did nothing wrong I’m so sorry you have to go through this but I can promise one thing it will get better ❤️‍🩹",
      "created_utc": 1720039819.0,
      "score": 3
    },
    {
      "id": "lbi71qu",
      "body": "Hey man, I am so sorry this happened.  By no means are you pathetic.  It sounds like you are trying to process what you saw because it feels like a nightmare.  The response you had is how some people react when they experience trauma.  You witnessed the woman you love and trust betray you in the most awful and intimate way.  There is no wrong way to feel about this because it is so difficult to come to grips with.\n\nHave you heard of the fight or flight or freeze response?  If not, read up on it, but basically your brain reacted in a way that would keep you safe by freezing in that moment.  It sounds like you made some good choices about gathering info even though this horrific thing happened. \n\nEveryone is saying get a lawyer, which you should do, but please find a therapist to help you process what you saw and what will happen moving forward.  It is going to be hard, but it will get better. \n\nYou sound like a good guy.  Please look after yourself.  You did nothing wrong, she did.",
      "created_utc": 1720041817.0,
      "score": 3
    },
    {
      "id": "lbiacd1",
      "body": "Sorry to know what you’re going through but thank you for sharing it with us. I have to ask, did you get yourself checked after being with your wife? This clearly wasn’t the first time, just the first time she was caught. If you haven’t, you should. All the best.",
      "created_utc": 1720042986.0,
      "score": 3
    },
    {
      "id": "lbidvxh",
      "body": "I'm not sure how you let her blow you and or have sex with her after watching that. Idk I've never been in that situation but I would imagine that with all those feelings that it wouldn't even get hard. You are nicer than me. That's for sure",
      "created_utc": 1720044272.0,
      "score": 3
    },
    {
      "id": "lbijtdm",
      "body": "This wasn’t her first time, just the first time you caught her. Remember that.",
      "created_utc": 1720046536.0,
      "score": 3
    },
    {
      "id": "lbioxcj",
      "body": "You are not at fault!!! You probably keep watching it because you can’t believe what you are really seeing! Your brain and heart will soon catch up and I would imagine anger won’t be too far away. While you seem a bit calm right now this is the most perfect time to contact an attorney. That is if you want to leave. Or you sit down and talk to her and tell her you feel an open marriage is something you may want. Tell her someone you’ve met has taken an interest in you and you’ve thought about perhaps having sex. Stay calm while you are saying this and see what she has to say about that. She probably will put her foot down say no way she is sharing you with anyone else. At that second you can say casually well I thought because you are screwing ..insert name of guy… I thought it would be ok for me too? I tend to be more sarcastic when I get hurt and I am sure many will disagree with me here But how good it would it feel to stay so calm during this. Or you get straight up angry tell her you are done and you want a divorce but whatever you decide be gentle on yourself you’ve done nothing wrong!!! I am sorry you are going through this!!! It is a terrible thing.",
      "created_utc": 1720048538.0,
      "score": 3
    },
    {
      "id": "lbip3p9",
      "body": "I want to give you a hug, bro. This is the type of pain that’s hits deep.",
      "created_utc": 1720048609.0,
      "score": 3
    },
    {
      "id": "lbir5dz",
      "body": "This happened to me, worse, it became a fetish. I think our brains try to protect us from certain things, and this is one of the ways that it does so. I have since realized that it is an unhealthy fetish, so if you can avoid it, do try.",
      "created_utc": 1720049421.0,
      "score": 3
    },
    {
      "id": "lbj2421",
      "body": "OP, I'm so sorry. Please get tested for STDs then get your important documents and finances in order. Talk to a divorce lawyer.",
      "created_utc": 1720053905.0,
      "score": 3
    },
    {
      "id": "lbjh7p2",
      "body": "Do not show this video to anyone. Assuming you were in the U.S., it could well be a criminal act to record people without their consent, if they have a reasonable expectation that their communications were private. You need a lawyer YESTERDAY.\n\nIf you live in Hawaii, Mississippi, New Mexico, North Carolina, South Dakota, or Utah, you may be able to sue her AP for alienation of affection. Do not leave a single penny on the table during settlement.",
      "created_utc": 1720060373.0,
      "score": 3
    },
    {
      "id": "lbjiaha",
      "body": "> I went back to my car and cried like the pathetic man I am.\n\nOne thing you should never ever forget, is that you don't HAVE to stay that man. You can and should change. Lawyer up first. Follow everything they say to a T.",
      "created_utc": 1720060852.0,
      "score": 3
    },
    {
      "id": "lbjkd08",
      "body": "Wow I'm so sorry that you went through this. This was incredibly painful to read. I don't have much advice besides leave. She isn't worth it.",
      "created_utc": 1720061779.0,
      "score": 3
    },
    {
      "id": "lbjlfma",
      "body": "My SO who is a male says to LongPlay it. He says to give her enough rope and behave like you behave, knowing what you know. No need to rush anything since you have kids. But definitely LongPlay it and see what she does. This will all come into the light but first see how beastly and inferior she acts. You deserve to let her writhe.",
      "created_utc": 1720062274.0,
      "score": 3
    },
    {
      "id": "lbjvofm",
      "body": "First of all, you crying is NOT pathetic. That is an extremely emotional surprise, that hurts in so many ways. I can’t believe you even had the strength to go back and act like all is good. Her behavior is not ok. \nUnfortunately once trust is broken, it’s almost impossible to repair. This is going to play in your head for awhile. I suggest a good therapist, to sort your emotions. But I would recommend leaving. There’s no way you get over that. And it sounds like she’s been doing this awhile when you think about it. Her lying so smoothly, that’s just insane. I hope you find the healing and peace that you need. And I hope it’s not messy for the kids sake.",
      "created_utc": 1720067270.0,
      "score": 3
    },
    {
      "id": "lbk57cr",
      "body": "If it were me, I'd get a divorce. You have video proof and the man's identity. There won't be any issues with the judge granting you a divorce. I hope your children are old enough to understand what is going on.\n\nI've been cheated on too. It's devastating... Sorry this happened but all I can say is that time helps. Good luck with everything.",
      "created_utc": 1720072529.0,
      "score": 3
    },
    {
      "id": "lbk5xax",
      "body": "If she gets pregnant by that guy. She's totally going to claim  you're the daddy. You need to protect yourself.",
      "created_utc": 1720072961.0,
      "score": 3
    },
    {
      "id": "lbki9nk",
      "body": "I'm so sorry this happened. Pls get an STI test and give us an update when things are looking better",
      "created_utc": 1720080935.0,
      "score": 3
    },
    {
      "id": "lbkk9os",
      "body": "Go get tested ASAP!! Syphilis is on the rise.",
      "created_utc": 1720082321.0,
      "score": 3
    },
    {
      "id": "lbp927u",
      "body": "You should've lost your shit on her.. what's the deal?",
      "created_utc": 1720155333.0,
      "score": 3
    },
    {
      "id": "ldj7nd2",
      "body": "I'm so sorry. You didn't deserve this. You didn't do anything to earn it. You are not the problem here. She is. You are **not** pathetic.  \n\nI'm going to echo everyone else here and say get a lawyer and maintain the charade until you have all your ducks in a row. At least you have evidence. Don't overthink it, the lawyer will tell you what you need to do. Don't confront her until you're ready for things to go nuclear. When you do confront her, tell everyone you know what happened. Her family, your family, and any mutual friends. Otherwise, she could turn this on you. Get an STI test. Get a paternity test for your kids. You seem like a good man so I know you probably won't care if they're actually yours, as far as loving them goes, but do it for your own peace of mind. And look into therapy.   \n  \nI've been cheated on and I know how much this hurts. Even reading your story brings back that sick, powerless feeling. I wish I could offer more comfort. Just know that I'm with you in spirit.",
      "created_utc": 1721174418.0,
      "score": 3
    },
    {
      "id": "le6nsf0",
      "body": "My man, I'm sorry this happened, but you're not the wrong guy here. Don't blame yourself.",
      "created_utc": 1721537466.0,
      "score": 3
    },
    {
      "id": "lbie85u",
      "body": "I mean.. my first thought reading this was that you'd awakened a kink.",
      "created_utc": 1720044399.0,
      "score": 9
    },
    {
      "id": "lbi7paz",
      "body": "Everyone here is screaming “run!” but none of them know you or your marriage prior to this. You’re heartbroken and clearly need time before doing anything. I don’t blame you one bit. You have a lot to process. Your feelings are totally valid and it could be days, weeks or longer before you feel prepared to move forward.\n\nYour future is yours to make. It is totally reasonable and fair if you decide you no longer want to be in this marriage. It is also totally fair and reasonable if you decide to see if the marriage can be saved. Don’t let anyone convince you that there is only one way forward.\n\nRegardless what happens, I want you to be okay. It’s very easy to crawl into a hole and let the darkness surround you—I know because I’ve done it myself. I’ve given in to my worst impulses and in the end, I was the only one who suffered. I hope you’ll learn from my mistakes.\n\nYou deserve to be okay. Please, please consider getting yourself a therapist. I know you aren’t ready to talk to people in your life, especially because sharing this with others makes it more real. Still, it would be healthy for you to have a sounding board and a therapist is just right for that.\n\nPlease care for yourself. If you’re physically active, main your fitness. If you aren’t, now is a good time to treat your body right. You don’t have to dive right into the gym; simply being outside and breathing fresh air, enjoying the sunshine, taking walks around the neighborhood can both give you a boost mentally & physically and provide valuable personal time for thinking and processing.\n\nIt can be especially difficult to get the appropriate amount of sleep when dealing with something like this. Most people find themselves either getting way too little or far too much. When I am feeling especially pressed, I engage in spiritual time that includes prayer and meditation. \n\nAs a tightly wound person I can struggle to relax, so I have found guided meditation is what works best for me. There are a number of apps that offer this, with and without a religious component. There are also loads of free videos online.\n\nBest of luck, OP.",
      "created_utc": 1720042048.0,
      "score": 6
    },
    {
      "id": "lbht8hb",
      "body": "I am so sorry :( you don’t deserve this",
      "created_utc": 1720037133.0,
      "score": 4
    },
    {
      "id": "lbibxyu",
      "body": "You are not pathetic, weak, or any less of a man for having real human emotions to the betrayal you witnessed from your wife. You did nothing to deserve this. Her actions are a reflection on her, not you.",
      "created_utc": 1720043561.0,
      "score": 4
    },
    {
      "id": "lbiqj21",
      "body": "She doesn’t respect you. You owe it to yourself to respect yourself.",
      "created_utc": 1720049174.0,
      "score": 4
    },
    {
      "id": "lbhxdem",
      "body": "Time for an attorney.\n\nYou’ve been betrayed and your feelings are valid.\n\nDon’t take time on getting this started. Talk to an attorney and move on it. You’ve got the evidence you need. So at this point it’s about what you feel you can do - stay and try to work it through or go because that was a line crossed you can’t forgive. \n\nI’m sorry this happened to you.",
      "created_utc": 1720038534.0,
      "score": 2
    },
    {
      "id": "lbhy44m",
      "body": "I’m so sorry this happened to you. That sounded like a great date night you had planned. \nFocus on your family. When you focus on what your kids need it highlights where you need to put attention to in your life. Like health wise and mental state since this is very damaging. Talk to a therapist and find a way to get you back to a balanced mindset. Nothing will be easy at first.",
      "created_utc": 1720038784.0,
      "score": 2
    },
    {
      "id": "lbhyjn5",
      "body": "I’m so sorry friend. I’m so so sorry.",
      "created_utc": 1720038929.0,
      "score": 2
    },
    {
      "id": "lbhyli6",
      "body": "man you did nothing wrong and you are not pathetic! i understand how easy it is to feel that way, but this was entirely her decision that was made based on something that we will never really know. you can feel whatever you need to feel and react in whatever way feels right",
      "created_utc": 1720038946.0,
      "score": 2
    },
    {
      "id": "lbhzsn9",
      "body": "Don’t torture yourself anymore by obsessing over the guy and the questions and the why me’s. Channel your inner strength and confidence and leave. You are only pathetic if you stay and let it continue to happen to you. Because at that point you’re doing it to yourself",
      "created_utc": 1720039348.0,
      "score": 2
    },
    {
      "id": "lbi25zf",
      "body": "No one here can know your whole personal situation, but your gut will tell you what you know is the right decision to make. I wish you well and hope ypu get through this and realise your worth.",
      "created_utc": 1720040139.0,
      "score": 2
    },
    {
      "id": "lbi2e3o",
      "body": "I am so sorry, OP. You are definitely not pathetic or worthless. You had your heart suddenly ripped out and your brain is trying to process this in the best way that it can. She betrayed you and seemingly has no problem lying and manipulating you to hide what she is doing. This new discovery about your wife knocked you to the ground and no one should have to go through this.\n\nHaving said that, you need to do what is best for you and your kids. Put the phone down and stop watching the video, there is no good reason to remind yourself over and over again of what happened. Right now, that entails talking to a lawyer and finding a good therapist. You caught them in the act and have proof, so there is nothing that she can say or do to gaslight you into thinking nothing is going on and you are just being paranoid. Save the video to a USB drive and put it somewhere safe in case you need to give it to a lawyer or to show your wife if she denies doing anything, but get it off your phone.",
      "created_utc": 1720040215.0,
      "score": 2
    },
    {
      "id": "lbi2m38",
      "body": "I’m so sorry your wife did this to you, OP- I think it’s time you tell her what you discovered and start preparing divorce papers and a lawyer. You don’t deserve to be treated like this",
      "created_utc": 1720040289.0,
      "score": 2
    },
    {
      "id": "lbi33uj",
      "body": "One, talk to a lawyer, provide the evidence and separate, second, see if the guy is married, tell his wife everything, a little revenge.",
      "created_utc": 1720040454.0,
      "score": 2
    },
    {
      "id": "lbi42gp",
      "body": "What a nightmare!! I’m so sorry u had to go through this, and proud of the composure you held and are still holding! Unless you’re comfortable w her doing this again (she’s clearly very comfy doing so in your shared home and doesn’t bat an eye between lovers) I’d be making arrangements for a divorce immediately!",
      "created_utc": 1720040782.0,
      "score": 2
    },
    {
      "id": "lbi47a2",
      "body": "You aren’t pathetic. You’re a good man who went home\nto show your wife how loved she is with a lovely date and plans to make time specifically for her. She violated the trust. It doesn’t matter if she felt you weren’t enough, she ripped up the marriage when she decided to have the man to your house and have an affair.\n\nI wouldn’t confront it until you figure out how you want to proceed. Talk to someone you can truly trust and an attorney would be wise.\n\nWishing you healing as you try to move forward.",
      "created_utc": 1720040828.0,
      "score": 2
    },
    {
      "id": "lbi4c80",
      "body": "You’re not pathetic. I’m so sorry.",
      "created_utc": 1720040876.0,
      "score": 2
    },
    {
      "id": "lbi59gr",
      "body": "You are not pathetic.",
      "created_utc": 1720041196.0,
      "score": 2
    },
    {
      "id": "lbi5t62",
      "body": "You definitely need to lawyer up",
      "created_utc": 1720041383.0,
      "score": 2
    },
    {
      "id": "lbi5xua",
      "body": "First thing first, stop watching the video. You’re just gonna tramautize yourself over and over again. Don’t delete it thought but keep it for your divorce attorney. \n\nHonestly OP you should probably leave the house for a bit, and distance yourself from her. And listen you’re not a pathetic man, and you’re not a weak man. Everyone processes things differently. A different man might be in jail right now for double homicide, another man might have ignored it and just went and got a side piece, another man might have made a scene etc…\n\n\nDon’t worry about what you did in the situation what’s important now is determining if your marriage is worth saving (that’s your decision and no one else’s), and what you need to do if it isn’t worth saving. Keep your head up King, and most importantly, DO NOT BE AFRAID TO SEEK THERAPY!!!! I cannot stress this enough.",
      "created_utc": 1720041428.0,
      "score": 2
    },
    {
      "id": "lbi6ki4",
      "body": "Man you just made sure that if the guy had something now you have it too",
      "created_utc": 1720041648.0,
      "score": 2
    },
    {
      "id": "lbi6m6s",
      "body": "This sounds quite traumatic. And how you deal with trauma is how you deal with trauma. There isn’t a right way. Sounds to me like you’re doing as ok as you could be doing while your life falls apart around you.",
      "created_utc": 1720041664.0,
      "score": 2
    },
    {
      "id": "lbic4eo",
      "body": "Man, I felt... So sad, so empty, reading this.  I could feel it, viscerally.  This is a terrible, terrifying thing you went through, and I'm beyond sorry your did.\n\nPlease do as others have said and speak to a lawyer and a therapist even if you have no idea what you're going to want to do.  Better to be prepared.\n\nIf you speak to a therapist, they'll be able to help you make a decision and help you decide how to approach this with your wife.  I think, no matter what you ultimately decide to do, the step after seeking outside support is to tell her what you know.  \n\nWishing you the best.  Be strong, get support in place, protect your kids.  ♥️",
      "created_utc": 1720043625.0,
      "score": 2
    },
    {
      "id": "lbidmjb",
      "body": "I’m so sorry OP.",
      "created_utc": 1720044175.0,
      "score": 2
    },
    {
      "id": "lbie5dh",
      "body": "I’ve forgiven my partner for none sexual cheating. It was fucking hard but it was worth it. We’re both in better places. Deciding to forgive all depends on how the confrontation goes and how much she shows that she wants it as well as yourself. However. If I found out my partner had sex with someone else, least of all in my home and bed then nothing could ever come back from that and I would 100% divorce. It’s the ultimate betrayal.",
      "created_utc": 1720044370.0,
      "score": 2
    },
    {
      "id": "lbif3i9",
      "body": "Dude snap out of it. For the love of god leave this woman immediately before you explode.",
      "created_utc": 1720044724.0,
      "score": 2
    },
    {
      "id": "lbiijwp",
      "body": "First, you are not pathetic OR worthless. At all. You're allowed to cry about this kind of betrayal - seeing it with your very eyes and freezing up means your nervous system was overwhelmed, and that is a kind of jolt that you can't just gloss over. It can be a source of trauma if it really takes hold. You're going in that direction by rewatching this and avoiding confrontation - plus, you are reinforcing those feelings of worthlessness by watching this repeatedly to punish yourself; over time, your subconscious is going to believe that mean little voice, even though it's a liar. Please put the video somewhere safe in case you decide to divorce (even if it means leaving it on a usb drive with a friend, like physically away from you), and delete it from your phone. Or, every time you hit a low point and feel tempted, take a walk or go to the gym and literally move those feelings out of you. Talk to a therapist if only to have space to grieve the loss of your reality. If you have any trusted friends or family, reach out to them for support and help starting the process of separation or mediation, if that is what you choose - this is all a lot to process and handle. For now, take some time away from her, from your home (but please don't forget about your kids! they are going to catch on pretty quickly that something is wrong), and focus on what brings you joy. Just you. \n\nI hope you are able to challenge these negative feelings about yourself, because this betrayal is in NO way a reflection of you. You deserve so much better!",
      "created_utc": 1720046048.0,
      "score": 2
    },
    {
      "id": "lbij5wn",
      "body": "You should go somewhere for the weekend. While she away on a Friday night, just send her the video and then leave your phone on the kitchen counter for her to find password protected. Then you leave for the whole weekend she’ll go crazy when she can’t get a whole of you.",
      "created_utc": 1720046282.0,
      "score": 2
    },
    {
      "id": "lbijfpz",
      "body": "Contact a lawyer. Number one. They will talk you through the rest.",
      "created_utc": 1720046388.0,
      "score": 2
    },
    {
      "id": "lbim9gz",
      "body": "You have to end the marriage. There's no coming back from that. See a lawyer first and prepare. Tread carefully. You need to act in a cold, caluculated manner and avoid doing anything rash. Goal one should be to extracate yourself from her in the least painful way possible.",
      "created_utc": 1720047478.0,
      "score": 2
    },
    {
      "id": "lbimjj5",
      "body": "OP, you are NOT pathetic, you are NOT weak, and it is NOT your fault. She is the one who is pathetic, weak and at fault for choosing to betray her marriage vows.",
      "created_utc": 1720047588.0,
      "score": 2
    },
    {
      "id": "lbin752",
      "body": "Lawyer up. Take everything and leave her nothing. Keep the kids. Good riddance.",
      "created_utc": 1720047847.0,
      "score": 2
    },
    {
      "id": "lbin8r8",
      "body": "I’m the type that would tell her we are going to plan a romantic dinner in and let her think something great is coming and then when id send her a copy of the video while we are hanging out as if all is well.   She will most likely not react well.  I prob wouldn’t even say anything and would just listen.  This is an unpopular opinion but some relationships can make it thru this kind of stuff.  It sucks and is a lot of work and effort.  Only u know if u want to be done w her or try counseling together.  Might start with seeing her reaction.  She doesn’t deserve u tho.",
      "created_utc": 1720047866.0,
      "score": 2
    },
    {
      "id": "lbizfch",
      "body": "Being level headed and hurt and processing what happened doesn't make you pathetic. It makes you a good man that was fucked over. Scream if you have to you have every right.",
      "created_utc": 1720052794.0,
      "score": 2
    },
    {
      "id": "lbj2xp9",
      "body": "Brother, you need to handle this. DO NOT let it fester, the pain will grow tenfold. You are not pathetic, you are a human and this is horrible. methodically and carefully get your affairs in order and tackle this shit now. Have your defenses built beforehand. Idk what your intentions are but protect yourself first no matter what. But I repeat, don’t sit on this or you will go mad.",
      "created_utc": 1720054247.0,
      "score": 2
    },
    {
      "id": "lbj3v52",
      "body": "Omg this is so intense. I read the whole thing with my mouth hanging open. I am so sorry , OP. God that's fucked up on so so many levels.",
      "created_utc": 1720054634.0,
      "score": 2
    },
    {
      "id": "lbj90xb",
      "body": "Back the video and photos up multiple places like a thumb drive or external hard drive but make sure it doesn’t upload to a shared album ie google or Apple.",
      "created_utc": 1720056833.0,
      "score": 2
    },
    {
      "id": "lbjcmyj",
      "body": "Get tested for any STDs.",
      "created_utc": 1720058380.0,
      "score": 2
    },
    {
      "id": "lbjeac7",
      "body": "You are very disciplined and commended.    In addition to a lawyer, seek out some 1 on 1 therapy.  No doubt you experienced trauma on many levels.  Hang in there.",
      "created_utc": 1720059104.0,
      "score": 2
    },
    {
      "id": "lbjews4",
      "body": "Save the video. Get a lawyer asap and make sure to get everything of yours",
      "created_utc": 1720059373.0,
      "score": 2
    },
    {
      "id": "lbjf0f5",
      "body": "This is a nightmare.  I'm sorry you're going through this.  I think you're just in some state of shock, you need to get a chance to snap out of it.  Find an excuse and get away for a night, away from the kids and your horrible wife.  You need to decompress and think.\n\nPersonally, I'd have gone ballistic and would have ensured I became the villain.  I'm glad you didn't do that, and that makes you stronger than I am.  But now you have to fully accept what happened and contemplate what comes next.",
      "created_utc": 1720059416.0,
      "score": 2
    },
    {
      "id": "lbji2zm",
      "body": "OP, you aren't pathetic. Please be kinder to yourself - what you went through was traumatic and you are experiencing normal feelings that any of us would have. \n\nTruthfully, if I was you, I'd calmly and collectively take the evidence to a divorce attorney and start the process. You don't owe her much of an explanation - you can tell her your attorney will be in contact with her attorney. \n\nYou don't deserve a miserable life and I'm sorry this happened. Fuck her. Good luck and know you are not wrong here.",
      "created_utc": 1720060758.0,
      "score": 2
    },
    {
      "id": "lbjj2mz",
      "body": "What are you doing to yourself? The worst part of this story for me is your reaction all to this or lack thereof. A couple of weeks ago and you’re still letting it go on? \n\nI feel for you man I really do. Must be in a world of pain or maybe numb now. But you know what needs done here and it’s the best for your kids to actually face it head on like a man. Help yourself",
      "created_utc": 1720061200.0,
      "score": 2
    },
    {
      "id": "lbjl1lz",
      "body": "Damn I almost cried myself reading this",
      "created_utc": 1720062093.0,
      "score": 2
    },
    {
      "id": "lbjmjyt",
      "body": "I felt sick reading this, I’m so sorry, this is truly nightmare stuff. You don’t deserve to be treated this way and I hope you find the love in yourself that you should feel. I love you and you are worthwhile",
      "created_utc": 1720062793.0,
      "score": 2
    },
    {
      "id": "lbjrct5",
      "body": "Find out if she has hidden assets with joint property. Often people hide money before announcing divorce",
      "created_utc": 1720065079.0,
      "score": 2
    },
    {
      "id": "lbjsfd2",
      "body": "What a fucked up situation. My man, all I got to say is this is all on her. Don't start blaming yourself or finding fault with yourself. It's all her. Start from there.",
      "created_utc": 1720065607.0,
      "score": 2
    },
    {
      "id": "lbjxf6l",
      "body": "Some pretty good advice in here, but let me add: stop watching that video. You're just hurting yourself. Save it for the divorce, but don't do that to yourself.\n\nI'm sorry.",
      "created_utc": 1720068188.0,
      "score": 2
    },
    {
      "id": "lbjz2bg",
      "body": "[deleted]",
      "created_utc": 1720069064.0,
      "score": 2
    },
    {
      "id": "lbjzui1",
      "body": "You are not pathetic! Your wife is, that guy is! There is never a reason to cheat. Get a lawyer so you can figure out what your options are. And stop watching that movie!",
      "created_utc": 1720069491.0,
      "score": 2
    },
    {
      "id": "lbjzx6r",
      "body": "Talk to a lawyer. Get tested for STDs. Surprise her with serving her divorce papers and let her know if she fights you in the assets and kids you will show her video to family and friends. I’d also see if the guy was married and send wife the information",
      "created_utc": 1720069532.0,
      "score": 2
    },
    {
      "id": "lbk5a05",
      "body": "I’m so so sorry, OP. Don’t torture yourself anymore with the video. Please find a trusted friend or family member to lean on and start letting go of some of this pain and go from there. \n\nGood luck, friend.",
      "created_utc": 1720072573.0,
      "score": 2
    },
    {
      "id": "lbkb3xj",
      "body": "Sir divorce immediately, unless you're watching the video coz it unlocked an inner kink like cucking of something.",
      "created_utc": 1720076142.0,
      "score": 2
    },
    {
      "id": "lbkbzvj",
      "body": "I just want to add that when the time comes, the soon to be ex wife should be moving out of the family home, not OP or the children.  She betrayed the family, she can move out.  The kids need stability and seems like OP is the person to provide it.",
      "created_utc": 1720076707.0,
      "score": 2
    },
    {
      "id": "lbl1ei5",
      "body": "Aslo go thrugh her phone now that you no shes cheating you have a right to",
      "created_utc": 1720093462.0,
      "score": 2
    },
    {
      "id": "lbldqbl",
      "body": "1. STD Panel\n2. Lawyer\n\nIf she was callous enough to go straight to you with some guy’s cum inside her 10 minutes after the fact without missing a beat, all bets are off. She has zero respect for you. Be calm when you confront (because you do need to confront) and be ready. Make copies of the video. Save it to a cloud or encrypt it with a password only you know. Don’t touch her again because many STIs tend not to transmit from just one contact. The more you do, the more you increase your chances of catching something. Get arrangements for her for after you drop the bomb (because she is the one who needs to leave). \n\nI’m sorry she’s doing this to you so easily and with such little remorse. You can and will get through this.",
      "created_utc": 1720099306.0,
      "score": 2
    },
    {
      "id": "lbllbhw",
      "body": "Posts like these make me so scared to get married.",
      "created_utc": 1720102365.0,
      "score": 2
    },
    {
      "id": "lblo3iv",
      "body": "I might be wrong here, but I‘m feeling 90% certain, that I read this exact story here years before and that it’s just copied.",
      "created_utc": 1720103408.0,
      "score": 2
    },
    {
      "id": "lblp9ga",
      "body": "Get a backup of that video!!!!",
      "created_utc": 1720103840.0,
      "score": 2
    },
    {
      "id": "lbls21k",
      "body": "Don’t forget to change your life insurance beneficiaries and let her know that it’s done. It’s awful but sometimes people do drastic things when confronted with a big life change like divorce. You have to protect yourself in every way.",
      "created_utc": 1720104854.0,
      "score": 2
    },
    {
      "id": "lbmbo0n",
      "body": "I am sorry this happened to you but you have to stop watching that video don’t delete it keep it but stop watching it, you also need a therapist to help you make clear headed choices. I’m not here to tell you what to do but I do think you should get tested and look for a lawyer you will never be able to truly reconcile you won’t be able to get the images out of your head in order to move forward. Again I’m so sorry this happened to you. Last but not least don’t call yourself a pathetic man you’re not your a hurt human just because you didn’t go off doesn’t make you weak or pathetic it’s actually shows that you have way more strength in you than you have realized.",
      "created_utc": 1720111777.0,
      "score": 2
    },
    {
      "id": "lbmuh6j",
      "body": "So why are you allowing someone to make you feel less then you are. She is the one who is not worth a dime to cheat on her husband in the home you built together. She don’t respect you or your children. You need to talk to someone and get it together not only for yourself but your children. She ruin her family not you. Nothing you did made her cheat that is all on her. I hope you smarten up and get it together. This really had nothing to do with you and all her.",
      "created_utc": 1720118378.0,
      "score": 2
    },
    {
      "id": "lbn04tz",
      "body": "Wow you handled that oh so very calm.. I believe if I would have walked into my home especially after dropping kids off and making beautiful plans oooh no they both gonna hear what ingot to say. I'm so sorry your going through this😔 my question now is bow long has this been going on. You should confront her.. and then tell her to get the %%$# out!",
      "created_utc": 1720120386.0,
      "score": 2
    },
    {
      "id": "lbnnyhw",
      "body": "Fight the man",
      "created_utc": 1720129094.0,
      "score": 2
    },
    {
      "id": "lbq9mlr",
      "body": "Immediately get tested for STDs and talk to a divorce lawyer. You do realize your wife is absolutely vile, right? She's garbage. How can you let yourself be insulted in such a way? Throw her out of the house and tell everyone what happened. I feel so sorry for the kids. Her? She's made her bed and now she'll lie in it.",
      "created_utc": 1720179127.0,
      "score": 2
    },
    {
      "id": "lbqa76z",
      "body": "I'm not unique in being someone who was cheated on but I learned along the way not to hate the guy she cheated with. Even though we all knew each other, were classmates, etc., she was the real asshole in the situation. He was just getting laid. Yeah it doesn't make him some upstanding citizen but don't get caught up on taking things out on him. He's not the one who made a commitment to you; she is.\n\n  \nIs there any other detective work you can do? Or anyone you can get info from? I guess I'm thinking it might be good to get an idea of what else is going on and for how long before confronting her and asking those questions.",
      "created_utc": 1720179440.0,
      "score": 2
    },
    {
      "id": "lcg87ez",
      "body": "What did you do about it?",
      "created_utc": 1720577731.0,
      "score": 2
    },
    {
      "id": "lcnbnsg",
      "body": "Any update",
      "created_utc": 1720688069.0,
      "score": 2
    },
    {
      "id": "ldpyroy",
      "body": "I would’ve stole his wallet, his money and his pants…",
      "created_utc": 1721274584.0,
      "score": 2
    },
    {
      "id": "lbhzs8c",
      "body": "Man up and do what you need to do. She betrayed you, put her in her place (not physically you dorks) and let her know you're leaving her.",
      "created_utc": 1720039344.0,
      "score": 2
    },
    {
      "id": "lbisyhh",
      "body": "Show us the video so we know it’s real. Jeez",
      "created_utc": 1720050144.0,
      "score": 5
    },
    {
      "id": "lbjk3td",
      "body": "post the video or it didnt  happen",
      "created_utc": 1720061662.0,
      "score": 5
    },
    {
      "id": "lbjxp76",
      "body": "Pathetic",
      "created_utc": 1720068336.0,
      "score": 3
    },
    {
      "id": "lbkfcgc",
      "body": "OP this sounds made up.",
      "created_utc": 1720078940.0,
      "score": 4
    },
    {
      "id": "lblxlvy",
      "body": "Get tested. Get a lawyer. Give the lawyer the video, then delete it from your phone. Get a divorce. Once a cheater always a cheater. Move on. Sorry this happened to you. It happened to me as well.",
      "created_utc": 1720106820.0,
      "score": 4
    },
    {
      "id": "lbi3ewv",
      "body": "This didn’t happen because of something you did. This happened because of a choice she made. You are not pathetic. Please be kind to yourself.",
      "created_utc": 1720040559.0,
      "score": 2
    },
    {
      "id": "lbi6otl",
      "body": "I would go again to the parents, but this time put some hidden cameras around the house.",
      "created_utc": 1720041690.0,
      "score": 2
    },
    {
      "id": "lbi7boz",
      "body": "Bro my story is a bit different because my ex was a pornstar and I found her videos. I know how it feels to see the videos, you watch repeatedly because you don’t want to believe it. I am so sorry what you went through! Go see a lawyer, get everything ready then only when the lawyer says so you can tell her.",
      "created_utc": 1720041914.0,
      "score": 2
    },
    {
      "id": "lbitfq8",
      "body": "It's time for her to face consequences . Expose her affair to everyone who must know.Family and friends，check with a lawyer your obligations and options. She decided to cheat, so nothing is your fault. Kick her out some days. And the most important thing, never take back a cheater.",
      "created_utc": 1720050337.0,
      "score": 2
    },
    {
      "id": "lbjuye8",
      "body": "Nah, I can't just support you on this. You just let yourself be miserable and now watching it over and over, just to feel the pain like an addict. Like a martyr some kind. Should have confronted them right there. Should have confronted her today. This is huge betrayal, she couldn't keep it together knowing what day it was. Talk to lawyer, take care of finances and just divorce. She's should be one of the worst human being by your judgment and youre here feeling no anger, just enjoying to succumbing to pain by watching that video.",
      "created_utc": 1720066892.0,
      "score": 3
    },
    {
      "id": "lbkmc20",
      "body": "Man unfortunately once a cheater always a cheater. Some people think that shits fun until their life turns upside down. Don't let her victim blame you either. My ex wife was raped in Alabama by 2 men which unfortunately I felt like it was bound to happen because she screwed around on me our whole marriage and I was too naive to see it. She blamed the rape on me and said it was all my fault. Like I had something to do with it. A few months later she left me for a coworker. I understand what you are going through.",
      "created_utc": 1720083780.0,
      "score": 2
    },
    {
      "id": "lbm60cz",
      "body": "OP just wanted to let you know that the freeze you had was a stress response.  Some people fight, some people run and some of us freeze.  Make sure you find a therapist to help you manage all of this. Take care of yourself.",
      "created_utc": 1720109776.0,
      "score": 2
    },
    {
      "id": "lbn23k7",
      "body": "I know why you are watching it. You are building your resolve because deep down you want to not only fuck this guys life up but scorch the earth. \n\nThe long term trauma will be unbearable. So first thing first talk to a lawyer. Then contact that assholes family/spouse if he has one. \n\nRegardless of the pain you feel the only way to get better to ensure that you push the rock called inaction down the hill. Commit to standing your ground cause it's not only disrespectful to you but also your kids.",
      "created_utc": 1720121101.0,
      "score": 2
    },
    {
      "id": "lbncjv2",
      "body": "I believed this until the part about you seeing him sneaking out and leaving lol. If you made a lot of noise, she would know you were home. She would’ve been ushered him out, not waited until you were settled and can see him out your peripherals",
      "created_utc": 1720124885.0,
      "score": 3
    },
    {
      "id": "lbiblmk",
      "body": "Did you get laid after the date?",
      "created_utc": 1720043438.0,
      "score": 3
    },
    {
      "id": "lbk1hko",
      "body": "Congrats you found a hidden kink! Now just pull up a chair in the corner of your room and invite them both to go to pound town and have fun. Seeing it in person is bound to be better than the video… At least make this somewhat believable",
      "created_utc": 1720070402.0,
      "score": 2
    },
    {
      "id": "lbi5x4m",
      "body": "wow, that is soul crushing. So sorry.",
      "created_utc": 1720041421.0,
      "score": 1
    },
    {
      "id": "lbiepgg",
      "body": "I'm so sorry OP",
      "created_utc": 1720044579.0,
      "score": 1
    },
    {
      "id": "lbiepwz",
      "body": "Hey man! My response is mostly just what I would do in your situation:\n\nDon’t do anything rational, go and seek legal help and be 100% honest about what is going on and get a divorce ASAP! \n\nReach out to someone you trust like a brother or someone along those lines and tell them!! But most importantly make sure this is someone you can really trust who will help you get through it mentally. If you don’t have that no worries you got us here on reddit.\n\nDo not tell her or confront her and just act like everything is normal until you sort your shit out regarding a divorce !! If you can, just act normal. \nI don’t believe in Revenge but the saying goes that it’s best served cold.\n\nYou deserve to be happy my guy!! No matter what, just think about your kids future and most importantly, YOUR future!! I would do the same thing as you watching the video. Your brain is trying to accept the reality and that’s totally normal but it’s not doing you any favours. Just accept it man it’s happened, you can do something about it…the longer you do nothing about it, you might just end up ‘popping’ bro so take some HEALTHY action and get a divorce.\n\nGood luck in your situation. Again this was all just me in your shoes, I hope you figure it out though. All the best ❤️🙏",
      "created_utc": 1720044584.0,
      "score": 1
    },
    {
      "id": "lbiew80",
      "body": "As outsiders, it's easy for us to see this as a black and white issue. Very hard for OP to not be blindsided, in complete shock and very confused after the person they've built a life and family with betrays them so terribly.\n\nOthers have given you a lot of good, practical advice and things to think about as you work through your feelings and decide what to do. \n\nI understand that you need time to process how you're going to approach this and move forward. However, I suspect that you run the risk of really damaging your self-esteem and self-worth if you actively keep this in much longer, and keep ruminating and rewatching the video, which seems to feed negative feelings towards yourself. Totally human reaction, but you don't deserve to feel that way. You weren't the one cheating. \n\nYou won't get any new information from doing that. Things won't move forward until you confront her. \n\nAgain, take your time figuring things out, but know that  you'll keep putting yourself down subconsciously and will stay in a mental state of being focused on your pain and insecurities, rather than figuring out how to avoid that pain going forward. \n\nI'm sorry. You have a lot to think about. You don't deserve this. Your kids don't deserve this. She cheated because of her issues, not because there is anything wrong with you. You did not deserve this. \n\nHow did you manage to go out with her that night? That must've been hard!",
      "created_utc": 1720044648.0,
      "score": 1
    },
    {
      "id": "lbif79z",
      "body": "It feels sad and pathetic but you did the right thing. You didn’t create a scene, lead to violence or anger. You have proof and details on the adultery. Leverage what you have to make a clean favourable break and look for happiness elsewhere. You didn’t do anything wrong here, you just ended up with someone who did.",
      "created_utc": 1720044764.0,
      "score": 1
    },
    {
      "id": "lbifoi3",
      "body": "Dude I’m so sorry u went through this but you have the upper hand now and she can have that same disgusting stomach turning feeling when ya hand get the divorce papers.",
      "created_utc": 1720044948.0,
      "score": 1
    },
    {
      "id": "lbii5i4",
      "body": "You are not pathetic.  You are not pathetic.  Your trust was betrayed and honestly, in disgust & outta curiosity, I woulda watched the video, too.  Seek a divorce lawyer consultation.",
      "created_utc": 1720045895.0,
      "score": 1
    },
    {
      "id": "lbiitvg",
      "body": "I am so sorry!!!!",
      "created_utc": 1720046155.0,
      "score": 1
    },
    {
      "id": "lbiiu27",
      "body": "It's natural to freeze like that when encountered with a life-changing situation. Very smart to record and take pictures of his drivers license though, more than enough evidence.\n\nDon't sink into this state, make a decision on how YOU want to move on. What you want and how you wanna move forward. Staying in this indecisive state could only damage your mental health and soon the kids will be effected. I hope you find a path forward that is the best for you 👍",
      "created_utc": 1720046157.0,
      "score": 1
    },
    {
      "id": "lbiivej",
      "body": "What a horrible thing to experience.",
      "created_utc": 1720046171.0,
      "score": 1
    },
    {
      "id": "lbiktnf",
      "body": "I'm so sorry that happened. \n\nYou're still processing, which is why you're watching the video over and over.\n\nAnd you're not pathetic. You're a good dad and husband. This is on her.",
      "created_utc": 1720046919.0,
      "score": 1
    },
    {
      "id": "lbil45g",
      "body": "Im sorry this is your reality and with kids also. Please seek a therapist besides a lawyer bc your comments calling yourself pathetic and the fact you KEEP rewatching the video says that there is something wrong, especially since you seem to rewatch it when you're already low or defeated. Feeling sorry for yourself is one thing but playing into it to make yourself feel worse are signs you need some professional help. Please for your psychological and mental health get evaluated, just in general bc your response is very worrisome.",
      "created_utc": 1720047032.0,
      "score": 1
    },
    {
      "id": "lbj2dt2",
      "body": "I’m so sorry this happened to you. Your feelings are valid and you’re experiencing trauma. Been there before with an ex boyfriend, we’re still in college that time. I studied in the university in our city so I wasn’t around all the time. He would cheat on me every chance he’ll get. He’ll have sex with different women,even the women I know. I’m not proud of my responses. I was in shock and my brain just decided to switch off and accepted everything. There was a point I was thanking him for not cheating. I know it sucks I was young back then. It made me question my self worth and who I am as a person. When we broke up I never entered any relationship because of trust issues.\n\nWhat I’ve learned was that cheaters will never change. No matter how you love them. Before they even cheat everything’s justified in their head. To them it was right and there’s nothing you can do about it. This wasn’t a hook up in a bar or anything she brought the man in your house. And it with that I think she has cheated numerous times already because she’s bold & confident enough to take someone into your home. \n\nYou have to get the upper hand. You have evidences and she still doesn’t know that you already know. You have to talk to a lawyer and make sure you’re the first one to inform your family and friends. She’ll try to control the situation. She will gaslight you, she’ll cry crocodile tears. You knew what you saw and that’s the truth. Don’t let her change your truth. She’ll put the blame on you saying she was lonely and hurting. Don’t even try to get counseling, she won’t change. You don’t have to suffer anymore, you’ve suffered enough. \n\nDo this for your kids and for yourself. This will be hard but staying in a home with betrayal is harder. It will drown you. It will impact your kids as they grow. Please go to therapy, I wish I did sooner.\n\nWin this time OP. Cheaters are losers!",
      "created_utc": 1720054016.0,
      "score": 1
    },
    {
      "id": "lbj2tmh",
      "body": "This broke my heart reading. I’m sorry OP 😔",
      "created_utc": 1720054199.0,
      "score": 1
    },
    {
      "id": "lbj31rh",
      "body": "Man, please don’t be so down on yourself. You haven’t done anything wrong. You’re in shock. It’s perfectly ok. Everything that you’ve done so far is ok. There’s no script for this nightmare. I think you should tell her and then try to determine what’s next. Work through or get a divorce. One thing you’re definitely NOT is worthless or pathetic.",
      "created_utc": 1720054294.0,
      "score": 1
    },
    {
      "id": "lbj43j9",
      "body": "I’m so sorry. I can’t imagine. I hope you’re able to find some peace for yourself and for your kids",
      "created_utc": 1720054733.0,
      "score": 1
    },
    {
      "id": "lbj53xf",
      "body": "Ima give you some advice delete the video if you can’t control yourself enough to not watch it. Then delete it you’re unnecessarily watching something you didn’t wanna see in the first place an causing more damage then if you’d had see it with your own eyes. An please get checked having her preform acts on you literally not seconds after having another man was the worse decision anyone could have made",
      "created_utc": 1720055165.0,
      "score": 1
    },
    {
      "id": "lbj5on6",
      "body": "You have to protect your mental and physical health. Get STD tested, get some therapy, make some prudent financial decisions, and get a lawyer and discuss your options.",
      "created_utc": 1720055409.0,
      "score": 1
    },
    {
      "id": "lbj608s",
      "body": "I’m so sorry mate. You must be feeling so destroyed, I can’t imagine what you’re going through.\n\nYou’re wife didn’t just break your trust, she absolutely and utterly destroyed it. It’s understandable if you don’t want to prepare filing for a divorce right now as the wound is still fresh, you are likely in denial, hoping you can reconcile your relationship and everything will be okay. Maybe you can, but she has shown complete disrespect for you and your marriage, I would say the best choice for both of you would be separation. \n\nTake your time processing your feelings, talk to anyone you can, or a therapist if you want to be more confidential. Maybe make up an excuse to tell your wife you need some space/going to visit family for a few days, going on vacation etc. so you can gather your feelings.\n\nSo sorry she has done this to you, I don’t know you or your relationship, but I dont believe anyone deserves that happening to them.\n\nAll the best",
      "created_utc": 1720055545.0,
      "score": 1
    },
    {
      "id": "lbj7dqs",
      "body": "get the book “after the affair” and dump her",
      "created_utc": 1720056131.0,
      "score": 1
    },
    {
      "id": "lbj7i3u",
      "body": "You seem to be self sabotaging. I would seek therapy. Just because she is a POS cheater does not mean you are any less of a man. This is all on her. All on her.",
      "created_utc": 1720056184.0,
      "score": 1
    },
    {
      "id": "lbja7w6",
      "body": "because you don’t want to accept everything you think about yourself is in fact just a lie, you dont want to accept she is just using you all this time. I have gone through similar situations all you can do is to accept things as they are the process will be painful but hopefully you will be better.",
      "created_utc": 1720057346.0,
      "score": 1
    },
    {
      "id": "lbjcwvg",
      "body": "I could feel your pain just by your wording OP. Take care of yourself and get a good lawyer. Do not delete the video out of emotional break down. The way you have written this down makes me worry about your mental health. Please go to a therapist as soon as possible.",
      "created_utc": 1720058501.0,
      "score": 1
    },
    {
      "id": "lbjdkss",
      "body": "Sweetie, your feelings are valid. You are many things, but pathetic is not one of them.",
      "created_utc": 1720058792.0,
      "score": 1
    },
    {
      "id": "lbjdrui",
      "body": "Prepare for the divorce dude and talk to a lawyer",
      "created_utc": 1720058879.0,
      "score": 1
    },
    {
      "id": "lbje16p",
      "body": "You aren’t pathetic for crying. She’s pathetic. My heart breaks for you. She doesn’t deserve your thoughtfulness.",
      "created_utc": 1720058994.0,
      "score": 1
    },
    {
      "id": "lbjefzt",
      "body": "Maybe you have been unhappy in this marriage too. Maybe you and your wife have been on different pages and not real partners. Since you have kids keep in mind that those kids deserve to have parents that will keep them first. And the kids need to know the split has nothing to do with them. Hopefully both of you will be happy again being exactly the persons that you are.",
      "created_utc": 1720059172.0,
      "score": 1
    },
    {
      "id": "lbjfc2d",
      "body": "You're not stupid of pathetic.\nShe's low and vile and doesn't deserve the marriage or the home because she was so willing to jeopardise them.\nDivorce her. You have the video as evidence.",
      "created_utc": 1720059554.0,
      "score": 1
    },
    {
      "id": "lbjha26",
      "body": "Fuck, dude. Everyone’s given you all of the advice there is to give at this point. If you can’t verbally start the confrontation I’d suggest writing it out, perhaps even writing a rough draft to get out all of your feelings. You’re a sweetheart and a good man and I’m really sorry that your kind and big hearted plans turned into you finding betrayal. You didn’t deserve that. I wish I could give you a big hug. It’s gonna be okay. Don’t do anything to land yourself in jail with that other dude. Get your stuff in order. You’re gonna make it through this. And someday, I hope someone loves you the way you deserve. I hope someday you’ll have someone shower you with love and surprises, and if you surprise them you find them waiting for you, missing you, and so excited you’re home early because all they want is to be with you. Big big hugs from this stranger.",
      "created_utc": 1720060402.0,
      "score": 1
    },
    {
      "id": "lbjoeiv",
      "body": "[removed]",
      "created_utc": 1720063662.0,
      "score": 1
    },
    {
      "id": "lbjq2xf",
      "body": "Don't think that you will never find another person to love. You will!!\n\nUnless you're watching that video over and over again because you are getting aroused,  then you need to take the advice of everyone here and get a lawyer.\nDon't let anyone do that to you!",
      "created_utc": 1720064459.0,
      "score": 1
    },
    {
      "id": "lbjq3p9",
      "body": "Did you ever determine who he is? Maybe a tinder rando?",
      "created_utc": 1720064469.0,
      "score": 1
    },
    {
      "id": "lbjrl8p",
      "body": "Stranger sir, you are not pathetic for crying.",
      "created_utc": 1720065193.0,
      "score": 1
    },
    {
      "id": "lbjs1l8",
      "body": "When she hopped off of him and suggested they go upstairs, you should have popped around the corner and asked if they needed any help. Maybe that's just me, but I wouldn't have been able to stand there and just let them go. \n\nI'm so sorry OP. Get everything in order, and get her out of your house. 😔",
      "created_utc": 1720065419.0,
      "score": 1
    },
    {
      "id": "lbjwz89",
      "body": "Can I just say: \n\nKudos on being so calm, actually recording evidence and even taking a pic of the guys license, rhat is som seeious logical thinking in such a moment! \n\nNo way can she ever deny it, that and you have leverage for negotiations!\n\nYou 100% have the upper hand here",
      "created_utc": 1720067956.0,
      "score": 1
    },
    {
      "id": "lbjy4ij",
      "body": "How is it that no one is saying that what you did took a lot of restraint and guts? Be proud of yourself for being the bigger person. Keep that same energy and get her out of your life. No need for an explanation or anything, just lawyer up and bounce. She’s not who you thought she was so the sooner she’s out of your life the better. A snake bit you and you went and got some medicine and moved on with your life, you didn’t go chase after the snake and tried to even reason with it. That takes balls man.",
      "created_utc": 1720068562.0,
      "score": 1
    },
    {
      "id": "lbk0e41",
      "body": "Send a copy of the video to your email or cloud, or someone you trust, don’t delete it.",
      "created_utc": 1720069790.0,
      "score": 1
    },
    {
      "id": "lbk89jh",
      "body": "I'm just gonna say if AP is married or with someone else inform them once you start the divorce process.",
      "created_utc": 1720074383.0,
      "score": 1
    },
    {
      "id": "lbk9676",
      "body": "You’re processing. That’s normal reaction and behaviour.",
      "created_utc": 1720074940.0,
      "score": 1
    },
    {
      "id": "lbkdn50",
      "body": "When you said you couldn’t describe the feeling, I get it man. I know the sickening feeling, the feeling of your heart pumping out of your chest. You never forget it.",
      "created_utc": 1720077791.0,
      "score": 1
    },
    {
      "id": "lbkdozi",
      "body": "\nThis piece of writing is extremely descriptive. There's quite a bit of time taken to reach the scene.\n\nFew people don't have the ability to feel when another individual is in their space. Yes, they were distracted. You made no sounds? \n\nI wish you healing.",
      "created_utc": 1720077824.0,
      "score": 1
    },
    {
      "id": "lbkf2zz",
      "body": "Get rid of the video man. You won't stop watching it if you don't. If you want to use it as evidence or something if you divorce, lock it away on an SD card with a lawyer.. just stop torturing yourself with it. Talk to your wife, tell her you know and go from there. I personally couldn't forgive cheating, but I won't tell some internet stranger to just give up on their marriage either. I will tell you that keeping it bottled up isn't good for you or your children. Best of luck to you!",
      "created_utc": 1720078763.0,
      "score": 1
    },
    {
      "id": "lbkgya2",
      "body": "Crying doesn't make you weak or pathetic. Be kind to yourself, please 🩷",
      "created_utc": 1720080032.0,
      "score": 1
    },
    {
      "id": "lbkhnlh",
      "body": "Man, my soul breaks for you. Reading this was hard... I could never imagine my wife, seeing that... You're not pathetic at all to cry over something like that. Hell, I cry all the time. \n\nDon't let her know you know, get the evidence together, find a lawyer, take out cash (don't spend your legal fees on your card if she has access to your bank info), go to the gym for mental clarity, don't meet anyone new yet (you don't need her using anything against you to get any sort of upper hand), and when you're ready, hand those divorce papers over my friend. \n\nI only heard of a small minority of couples surviving infidelity. There will always be a rift, though, in their marriages. An uncertainty. A betrayal. They have undergone intense therapy, and all of them were informed by their partner, themselves, of the wrong doing. None of the betrayed had to \"find out\" if you will. \n\nYou got this. I believe in ya champ.",
      "created_utc": 1720080516.0,
      "score": 1
    },
    {
      "id": "lbki4fh",
      "body": "I'm sorry dude. She's a selfish piece of shit. Don't let anyone guilt you or make you feel bad about it. Don't believe a word she says. Goto a lawyer. Talk to a friend. Checkout for STDs. It's hard, but do a DNA test on your kids without anybody knowing about it. You've been livin' a lie. You don't deserve it. You need to get ahead of this situation before she gets a chance to plan ahead. Do everything the civil way. You have proof. You got time. A good revenge is the one served cold. Talk to your lawyer, go to a friend, join the gym. Fuck her, you don't deserve it bro.",
      "created_utc": 1720080834.0,
      "score": 1
    },
    {
      "id": "lbkub83",
      "body": "When trust & loyalty are broken it is sickening to your soul. Situations have turned out worse with crime of passion. Once you get over the shock you will think more clearly. This really sucks, I am sorry you went through this issue. It makes me sick the lack of respect & loyalty. I could not go back in that bedroom. Hurts bad when you think everything is fine & this sheeite happens!!",
      "created_utc": 1720089295.0,
      "score": 1
    },
    {
      "id": "lbkwvgl",
      "body": "Get a divorce, she’s probably done this before for awhile. Use it against her in court and take her for everything.",
      "created_utc": 1720090896.0,
      "score": 1
    },
    {
      "id": "lbkzah6",
      "body": "Contact a lawyer, separate finances and get her to sign a post-nup somehow without her realising that you’re going to leave her.",
      "created_utc": 1720092305.0,
      "score": 1
    },
    {
      "id": "lbkzk2x",
      "body": "You’re not pathetic my brother, she is. She is the one cheating, you are the one that maintained your dignity.",
      "created_utc": 1720092452.0,
      "score": 1
    },
    {
      "id": "lbkzl73",
      "body": "Send the guy a message and ask was my wife good in bed say i saw your wallet and i have video proof you was in the house so how do you no my wife if you dont its inly going to keep on happening",
      "created_utc": 1720092471.0,
      "score": 1
    },
    {
      "id": "lbkzxwr",
      "body": "S ay were was you at this time if she says at home so  was i is there anything you want to tell me send it vy text if its easier for you",
      "created_utc": 1720092667.0,
      "score": 1
    },
    {
      "id": "lbl1n58",
      "body": ".",
      "created_utc": 1720093591.0,
      "score": 1
    },
    {
      "id": "lbl5end",
      "body": "Op…. You deserve better, I’m sorry you’re going through this.",
      "created_utc": 1720095527.0,
      "score": 1
    },
    {
      "id": "lbl5f41",
      "body": "1) you are not a pathetic man or human. Your wife is cheating on you and you deserve a healthy release for those emotions. \n2) take a day to yourself and work out what you want. I suggest a clean break and divorce but I’m hard against cheating and wouldn’t tolerate it.",
      "created_utc": 1720095533.0,
      "score": 1
    },
    {
      "id": "lbl61ie",
      "body": "You’re not pathetic at all!\nPlease accept my condolences as you process this trauma and work through the grief.\nYou didn’t deserve what she did to you.\nSide note- bringing someone into your home?! That’s extra disgusting and disrespectful.\nPlease lawyer up ASAP and get checked for any STI’s.\n\nSending you positive thoughts, peace and comfort ❤️",
      "created_utc": 1720095834.0,
      "score": 1
    },
    {
      "id": "lbl9zr1",
      "body": "I’m confused on why he let her do sexual stuff to him after she was literally with another guy. I hope op takes actions, it will bet worse if you don’t.",
      "created_utc": 1720097679.0,
      "score": 1
    },
    {
      "id": "lblcq6l",
      "body": "Absolutely stop punishing yourself, you did nothing wrong. It may feel like you did because you ask yourself, “was it something I did to cause my wife to be unhappy and cheat?” She made that choice. Stop watching the video, take some time to process how YOU actually feel about this. If you need to be alone for a little while, do that. Just don’t keep it bottled inside. Eventually, you’ll either need to let it go(don’t recommend that) or talk to her about it. At the very least you need to talk to her and confront her about it. From there, decide if what she did was a dealbreaker to your marriage or not. So either you reconcile or you don’t. That’s your personal choice, not ours. No one truly knows how you feel, only some of us can relate. Good luck and keep us posted!",
      "created_utc": 1720098877.0,
      "score": 1
    },
    {
      "id": "lblg7f6",
      "body": "I would have taken his wallet then when I was sitting in the living room (after speaking to a lawyer)act like I found it and make her confess",
      "created_utc": 1720100341.0,
      "score": 1
    },
    {
      "id": "lbli2gv",
      "body": "I am so, so sorry this happened to you. You are not pathetic, at all. Keeping your composure while entering your own house to find what you did took balls of steel, and not beating the living shit out of the AP requires a strength not many understand. \n\nI uncovered a lot of content my ex was sending her AP too. (Don’t send sexts when you share an iCloud account, idiot!) It was traumatic, and the best thing for me was to delete everything so I wouldn’t torment myself by looking at it. BUT, If you think you may need this as evidence for custody or anything like that, get it off your phone and put it on a Zip drive somewhere safe. \n\nEach situation requires a unique solution, but if you leave the marriage, do your best to be 100% done with it and focus on the kids. Be a stone wall (grey rock) even if you’re faking it at first. Easier said than done, but try anyway. Somebody who has done something so despicable, so disrespectful, so careless, does not deserve you. \nWhether you decide to work it out or not, make sure she realized how she’s permanently altered hers and her kids lives with her selfish actions. \n\nGood luck. I hope all the best for you.",
      "created_utc": 1720101095.0,
      "score": 1
    },
    {
      "id": "lblkzof",
      "body": "I just want to say you are NOT a pathetic man. You showed incredible self restraint, or froze from an awful realisation of what was going on. She was very lucky to have such a thoughtful man and she abused the trust you had in her and the relationship. Is it up to you if you stay but either way she needs to know you know. If you decide you should separate (honestly it sounds like you should) go to a lawyer to discuss divorce before you confront her. When you do confront her I would suggest you have a trusted friend in another room in the house or do it in a semi-public area. Not somewhere where people can overhear but somewhere where it will hopefully prevent either of you from raising your voices or her potentially accusing you of attacking her or lashing out. Once she knows you videoed it she may try to change the narrative so she doesn't have to admit what she did or can cast doubt on your version of events. \n\nI'm sorry she has done this to you, your children and wider family. She should feel nothing but shame and she has lost a good man down to her own selfish actions. \n\nThis is not your fault and for the love of god stop watching the video. You are hurting yourself for no good reason. I would suggest exercise or throwing yourself into a hobby - anything to try and get happy hormones pumping. Don't let her betrayal form the direction of the rest of your life and derail the thoughtful, kind man you are.",
      "created_utc": 1720102237.0,
      "score": 1
    },
    {
      "id": "lbls381",
      "body": "You should have co confronted them. They should have felt the pain in of being caught in the moment. Stop watching that video. Get yourself away from women as soon as possible. SHE needs to leave the house, NOT you. She’s disgusting and reprehensible. She has no respect for her own kids even. She’s desecrated your home. I wish you all the best in this. It can’t be easy. Betrayal is a double ended sword.",
      "created_utc": 1720104866.0,
      "score": 1
    },
    {
      "id": "lblstdv",
      "body": "Hey I am sorry that happened. I can’t imagine how you can feel like you can trust anyone right now. Sending good wishes",
      "created_utc": 1720105127.0,
      "score": 1
    },
    {
      "id": "lbmdrlm",
      "body": "Let it go , do what you need to do to get past it, separate your money. At least you know you don’t owe her anything",
      "created_utc": 1720112505.0,
      "score": 1
    },
    {
      "id": "lbmjsvt",
      "body": "I know it’s hard, but talk to a therapist if you’re not ready to navigate with friends, or family. This is something that has dire consequences and implications.",
      "created_utc": 1720114618.0,
      "score": 1
    },
    {
      "id": "lbn3b73",
      "body": "At least you'll win custody of your kids",
      "created_utc": 1720121540.0,
      "score": 1
    },
    {
      "id": "lbpjohe",
      "body": "I'm not sure I can add too much to the advice, the legal advice, the sti advice etc etc is good. However, after being in a similar situation my main pieces of advice are stay calm, do you homework, don't let on to her how much you know and what your plans are (apart from your plan to divorce her). Back up all your evidence, keep everything, every communication you've ever had with her in writing and anyone else possibly with knowledge of what she's doing, download all your social media data. Give it all to your lawyer and keep a copy in a safe place she doesn't know about. \nAnd I'll repeat, as much as possible stay calm. Don't do anything rash. Think through every action. If you feel your temper rising remove yourself from the situation. Record every face to face interaction with her. \nGood luck my friend, the road is bitter and brutal you are about to walk but it does get better. It's been 18 months for me now and things are looking up",
      "created_utc": 1720161757.0,
      "score": 1
    },
    {
      "id": "lbq1ohe",
      "body": "good lord this sent chills down my spine",
      "created_utc": 1720174237.0,
      "score": 1
    },
    {
      "id": "lbqpeuh",
      "body": "My heart hurts ❤️‍🩹  I cant imagine yours.",
      "created_utc": 1720186503.0,
      "score": 1
    },
    {
      "id": "lbs0kbx",
      "body": "No matter how much you might get annoyed in next few weeks especially if it’s blows up. Do not mention that tape.. ever. Talk to a lawyer first",
      "created_utc": 1720203036.0,
      "score": 1
    },
    {
      "id": "lbtl7et",
      "body": "I second every piece of advice everyone is giving you 100% so I will not say what has been said and what you already know. I will say I am so so very sorry for what is happening and even the way you had to find out. You have every right to be upset and hurting and you should not feel ashamed of crying. She broke your trust in the absolute worst way and I know that the pain is unreal. Please don’t be ashamed that you feel feelings like any other human being. It’s okay to feel, it’s okay to cry, it’s okay to feel conflicted on how to proceed",
      "created_utc": 1720223395.0,
      "score": 1
    },
    {
      "id": "lbxbk5f",
      "body": "I hope this is just rage bait.. no one should be this lame of doormat",
      "created_utc": 1720289060.0,
      "score": 1
    },
    {
      "id": "lbzflmk",
      "body": "Sorry, but this story began to sound made up at \"I parked a few houses away\". Also, no woman is going to be with her husband immediately after just being with another man. The nose knows. Kind of early for wine too. Anyway, decent story I guess.",
      "created_utc": 1720318448.0,
      "score": 1
    },
    {
      "id": "lbzoae2",
      "body": "Send the video to her parents and all her siblings. Aunts, uncles who cares. \n\nFuck her.\n\nIf possible get the man fired from his job or find out if he has a wife and let her know.",
      "created_utc": 1720322328.0,
      "score": 1
    },
    {
      "id": "lc05vg1",
      "body": "Hey, that might have been painful to watch.\nFirstly, you are none of how you described above. You are a trusting man who believed he was in a healthy monogamous realtionship. The cheating has nothing to do with you, it is a choice your wife made. Please don't feel anything negative fir yourself.\n\n\nThe freeze response is natural (and I believe in this case better than fight or flight) \n\n\n\n\nAs per the next steps, \nA) Don't get gaslighted or manipulated. If your wife tries to turn it back on you, listen and distinguish what is actually about you and what her defensive self is projecting \n\n\nB) I know kids are involved, but that does not mean you let go of the pain and betrayal and disblief you are facing. Talk to your wife but go prepared. Also keep yourself safe. Don't rush. \n\n\nC) You don't have to make sense of it. The disbelief is obvious and I am sorry right now you might be feeling so confused and foggy , but see it as it is. If yours is a monogamous realtionship then it is a cheating .\n\n\n\n\nPlease take care . Lots of strength to you ",
      "created_utc": 1720331800.0,
      "score": 1
    },
    {
      "id": "lc50gkw",
      "body": "Legal advice and get all your ducks in a row, especially in terms of financial. Make sure you get a clear picture of your current debts and assets so she doesn't do something like tank your credit. \n\n\nYou don't have to do anything else. You don't have to file papers or tell people. You can take time to make decisions. You can take care of yourself. \n\n\nI bet you feel stuck and powerless. That's hard. Concentrate on what you can control. \nYou can take care of your health. \nYou can keep yourself financially safe and well. \nYou can decide what is important to you. \nYou can take time. \n\n\nNo one ever regrets that. They never regret putting their own well being and their children first. They often regret rash, half thought out actions though. \n\n\nPlease put the video away. Stop watching it for your own health. ",
      "created_utc": 1720408302.0,
      "score": 1
    },
    {
      "id": "lc58p7d",
      "body": "I am so sorry for what you have endured and this incredible trauma that has really shown you this person‘s true colors. \n\nI would also suggest to make a copy or a back up of this video in case she tries to look into your cell phone, discovers it and deletes it. I would email a copy to yourself or also download it on a thumb drive.\n\nI’ve been through a similar incident before and Trust is like glass, once it breaks..it is never the same when you try to put it back together with someone willing to do this behavior.\n\nI’m hoping that you have a close friend or even family that you can also confide in. Can’t imagine what it would be like continuing to live on knowing what you know and seeing what you saw. Stay strong, I believe karma always comes full circle, and I am sending you abundance and light in this difficult moment.",
      "created_utc": 1720412232.0,
      "score": 1
    },
    {
      "id": "lcc4e17",
      "body": "At some point and soon you have to confront it. Like I been in the SAME position as you I almost offed myself because of it. You are traumatized and trying to treat it like a walk in the park…you have to confront her and divorce her that lady did not honor your vows to each other. Adultery isn’t just a struge your shoulders with. It sucks it hurts, it’s going to take a long time to heal but you have to start TODAY. Unless you think you’ve unlocked some sort of kink there is no reason for you guys to stay together NOT EVEN THE KIDS. It’ll fester into anger and then rage and you could possibly go off the deep end. Confront it now. Dont let them dark thoughts trick you King! Lift your head",
      "created_utc": 1720525100.0,
      "score": 1
    },
    {
      "id": "lccz4y7",
      "body": "To the op, if you leave.the marital home it isn't going to look good for you. I would recommend to sleep in separate rooms instead of leaving. When I was separated for a little while, I had a consultation with a lawyer. I was not at our home and, he recommend to move back in. This is in PA, I don't know what state you are in but, I would consult a lawyer before doing anything. ",
      "created_utc": 1720537359.0,
      "score": 1
    },
    {
      "id": "lce2zl3",
      "body": "Get your ass to a family lawyer. They will go through what all your options are. Divorce, Separation reconciliation the whole lot. But know this. 60% of marriages involved in infidelity such as your reconcile. But most are not through love. They are through financial reasons, no where to live, loneliness. A family lawyer worth their pay will go through all of this.\n\nBut here are something's you need to do before you continue.  \nFull spread STD. Shes brought a man in your house. You need to know it wasn't just him.   \nConversation with a lawyer.\n\nThen make a decision.",
      "created_utc": 1720550287.0,
      "score": 1
    },
    {
      "id": "ld3ci9u",
      "body": "If I were you, I'd have taken his wallet.",
      "created_utc": 1720930489.0,
      "score": 1
    },
    {
      "id": "ld6x06e",
      "body": "Dont delete the video, download tinder or start going out with other women, if she complains or wants to make a fuss about it show her the video and ask for a divorce",
      "created_utc": 1720989739.0,
      "score": 1
    },
    {
      "id": "lf6hymg",
      "body": "I hope OP stopped feeling sorry for himself and acted",
      "created_utc": 1722083698.0,
      "score": 1
    },
    {
      "id": "lf6i45n",
      "body": "my wife of 25 years had multiple affairs starting when we first got married. I had no idea this was going on until about 15 years in. I tried to forgive her for what i thought was the first time. over the next ten years she kept cheating and i kept finding out about older affairs. We stayed married but separated the last 3 years. They do not change just get out early. She cheats on her current boyfriend who she met when she cheated on the guy before him.....",
      "created_utc": 1722083770.0,
      "score": 1
    },
    {
      "id": "lf6ro70",
      "body": "If you haven’t confronted yet, they’re most likely doing it again, so you’d have your chance to explode like you missed before\n\nRepeat same steps and gather evidence, talk to a lawyer and divorce her.\n\nGet kids and all.",
      "created_utc": 1722087947.0,
      "score": 1
    },
    {
      "id": "lf801wy",
      "body": "damn she’s evil af",
      "created_utc": 1722103906.0,
      "score": 1
    },
    {
      "id": "lf8y38r",
      "body": "Test, lawyer and that is it. Sorry for what happened to you., some people are just lousy humans.",
      "created_utc": 1722116549.0,
      "score": 1
    },
    {
      "id": "lf9tjf8",
      "body": "I found a video on my bf’s old phone of him having a 3 way.  The video wasn’t taken while we were together but just watching it really messed me up, but I couldn’t stop watching it over and over again for some reason and I would be crying my eyes out.  I ended up having to delete it.  I was mad at him as if he had done it while we were together.  It took me a little while to get over it. I would not delete that video in case you do decide to divorce her.  Honestly, I would edit the start of the video so she can’t tell that it’s you that’s recording it and I would send it to her from another number just to fuck with her.   Her not knowing who recorded it is going to mess with her head so many different ways and it’s not like she can ask you.",
      "created_utc": 1722129321.0,
      "score": 1
    },
    {
      "id": "lg6ubuf",
      "body": "Send her a copy of the video via text and see how she reacts.",
      "created_utc": 1722627304.0,
      "score": 1
    },
    {
      "id": "lbi031n",
      "body": "I don't want to talk to anyone about it yet",
      "created_utc": 1720039443.0,
      "score": 1169
    },
    {
      "id": "lbmgz0p",
      "body": "in addition to this get a DNA test on the kids too.  May not be the first time she cheated.",
      "created_utc": 1720113630.0,
      "score": 3
    },
    {
      "id": "lbhlqab",
      "body": "I second this comment, OP. Have a consultation with an attorney so you can go into a discussion with your spouse with all your tools ready to go, even if you are able to reconcile. \n\nYour pain is valid, OP. You are experiencing a traumatic response. You are not pathetic. You are not weak. You trusted her and she broke that trust. I would also recommend that you consider seeking out a therapist to help you deal with this as well.",
      "created_utc": 1720034599.0,
      "score": 1553
    },
    {
      "id": "lbhmsm2",
      "body": "I know I need to do this",
      "created_utc": 1720034959.0,
      "score": 978
    },
    {
      "id": "lbhv00d",
      "body": "And go get an STI test asap.",
      "created_utc": 1720037731.0,
      "score": 52
    },
    {
      "id": "lbjkyl2",
      "body": "Friend I’m so sorry this happened to you. But just adding weight to this comment here. Your exit plan is essential. Line up money, a place to stay, a plan for the kids etc. Don’t execute on anything until you got those bases covered",
      "created_utc": 1720062054.0,
      "score": 9
    },
    {
      "id": "lbixwkt",
      "body": "Send the video to a different email account you have. Don’t let her go into your phone and delete it. That’s your evidence. And please divorce her. She’s not worth your time money or love anymore.",
      "created_utc": 1720052166.0,
      "score": 2
    },
    {
      "id": "lbk6lpd",
      "body": "I think OP should schedule a therapy appt and lawyer at the same time tbh",
      "created_utc": 1720073372.0,
      "score": 2
    },
    {
      "id": "lblp0f2",
      "body": "Talk to a few of them, honestly. That way, if you decide to move forward, she has to go shopping a little harder for one, too.  \n\nPlease get tested for STIs, and I second (third?) getting the DNA testing on the kids. Your trust in her is shot and you need to know once and for all or you will always wonder. It won’t change how you feel about them, I hope, but you will know and that’s important for their health.",
      "created_utc": 1720103748.0,
      "score": 2
    },
    {
      "id": "lbixys1",
      "body": "Right!?! She hurt him. Just because you're a man doesn't mean that you can't feel hurt, can't try, and can't mourn a relationship that's been a huge part of your life. Repressing those feelings can be more damaging to you than letting yourself feel them.",
      "created_utc": 1720052190.0,
      "score": 354
    },
    {
      "id": "lbjc2t2",
      "body": "I agree- this broke my heart. You are the farthest thing from pathetic. This is kind of like a car accident where you can’t look away, morbid curiosity. I know you can’t see it now but whatever lies on the other side of this will give you clarity. Best of luck OP.",
      "created_utc": 1720058141.0,
      "score": 55
    },
    {
      "id": "lbk7cv0",
      "body": "Agreed. He is a loving honest man looking at his post, and he reacted in a way a genuine and sensitive man would. He should be proud of doing the right thing.\nAnd now of course talk to a lawyer so he can get justice. This woman doesn't realise his worth apparently. I'm heartbroken for this decent man that OP is.",
      "created_utc": 1720073827.0,
      "score": 18
    },
    {
      "id": "lbm00j7",
      "body": "Exactly. SHE is the pathetic one, not him.",
      "created_utc": 1720107655.0,
      "score": 10
    },
    {
      "id": "lbidkjj",
      "body": "This is what you need to do. Do not sleep with your wife under any circumstance. When you consult with a lawyer bring all the proof of cheating and your finances. Follow his advice to the letter. Do not say anything to your wife about what you are doing. It is better to surprise her with the divorce papers. You cannot force her to leave but you can tell her that divorce takes time and if there is any chance of reconciliation you want her to pack her stuff up and go stay somewhere else till you decide what to do. In the interim share the kids 50/50 until you divorce or reconcile. Let her give you a written confession of everything she has done. Tell her if she lies the marriage is over. Then find the guy. Tell him to confess everything or you will tell his wife if he is married. Once he confesses everything blow up his life and tell his wife. You owe him nothing. Follow your attorney's advice to the letter.",
      "created_utc": 1720044154.0,
      "score": 95
    },
    {
      "id": "lbhrwu6",
      "body": "I have spent multiple hours looking up this guy. And so considering options from the ultp sub",
      "created_utc": 1720036689.0,
      "score": 585
    },
    {
      "id": "lbiwtko",
      "body": "Agree! Back it up, email it to yourself or something and write, if you’re able to, a record of when and how it happened to refer to which is also backed up for evidence",
      "created_utc": 1720051717.0,
      "score": 34
    },
    {
      "id": "lbhwvoz",
      "body": "I should have",
      "created_utc": 1720038368.0,
      "score": 344
    },
    {
      "id": "lbinfpi",
      "body": "I would have taken his id  , money and maybe his undies.  I would then get myself food and while looking for the best divorce lawyer. \n\nWhy take all those things ?! Because they will both be fuming and scared !!!",
      "created_utc": 1720047943.0,
      "score": 133
    },
    {
      "id": "lbjp2m7",
      "body": "💀",
      "created_utc": 1720063978.0,
      "score": 11
    },
    {
      "id": "lbhs60v",
      "body": "Thank you",
      "created_utc": 1720036774.0,
      "score": 236
    },
    {
      "id": "lbi4q8p",
      "body": "Yeah this is the best piece of advice so far",
      "created_utc": 1720041010.0,
      "score": 27
    },
    {
      "id": "lbjms8s",
      "body": "The workouts you get after being cheated on are unmatched. I got in the best shape of my life after I channeled all my rage at the gym! And it felt so fucking good to rub it in my ex’s face how much better off I am without him.",
      "created_utc": 1720062902.0,
      "score": 27
    },
    {
      "id": "lbieq2o",
      "body": "why gym?",
      "created_utc": 1720044586.0,
      "score": 8
    },
    {
      "id": "lbi8pfv",
      "body": "Right?! I'd be all up in the bedroom with the two of them, letting them know I see them",
      "created_utc": 1720042402.0,
      "score": 75
    },
    {
      "id": "lbidytm",
      "body": "This has never happened to me (thank God) so I can't say for sure how I'd truly react but I don't understand how people can just do this. How do you witness something like this and just... Do or say absolutely nothing? Is it shock? I feel like I would be raising hell.",
      "created_utc": 1720044302.0,
      "score": 32
    },
    {
      "id": "lbi0b2h",
      "body": "His truck was on the street. I don't know where the clothes went to but I assume she panicked as soon as she heard the garage open.",
      "created_utc": 1720039518.0,
      "score": 54
    },
    {
      "id": "lbhxxlb",
      "body": "All valid questions that I was wondering about myself.",
      "created_utc": 1720038722.0,
      "score": 16
    },
    {
      "id": "lbiuc3n",
      "body": "Right all this advice and this is sooooo clearly fake!!",
      "created_utc": 1720050701.0,
      "score": 38
    },
    {
      "id": "lbl6c4u",
      "body": "Agree. This is all too perfect. It’s written like a scene from a movie.",
      "created_utc": 1720095976.0,
      "score": 14
    },
    {
      "id": "lble5v3",
      "body": "Agreed",
      "created_utc": 1720099491.0,
      "score": 7
    },
    {
      "id": "lbncuo6",
      "body": "I would hope most men don't react to emotional turmoil by getting physically violent",
      "created_utc": 1720124993.0,
      "score": 3
    },
    {
      "id": "lbl0fgl",
      "body": "I agree, sounds made up",
      "created_utc": 1720092930.0,
      "score": 6
    },
    {
      "id": "lbhwyub",
      "body": "Don't be. This is beyond fake as fuck.",
      "created_utc": 1720038397.0,
      "score": 91
    },
    {
      "id": "lbjpmt1",
      "body": "Lucky to have chanced upon this comment thread.\n\nFell for it, even wrote a long ass post. \n\nThis terribly affects reddit as a safe space for genuine ones",
      "created_utc": 1720064244.0,
      "score": 3
    },
    {
      "id": "lbiji84",
      "body": "Honestly, I sort of thought the same thing. It wouldn't be the first time it has happened. This might be something he would want to talk to his wife about and continue to explore; with counseling. I know couples like this that are very happy.",
      "created_utc": 1720046415.0,
      "score": 4
    },
    {
      "id": "lbjqtxs",
      "body": "Same. If this isn't fake, then this is an awakening!",
      "created_utc": 1720064823.0,
      "score": 3
    },
    {
      "id": "lbijofs",
      "body": "Something like that is implied, but ffs delete this question",
      "created_utc": 1720046482.0,
      "score": 3
    },
    {
      "id": "lbjs225",
      "body": "I know who he is and what he does. I don't know how they met yet",
      "created_utc": 1720065425.0,
      "score": 5
    },
    {
      "id": "lbio69l",
      "body": "What you are doing is pain shopping. Stop watching the video you probably have it memorized by now and you will never find any answers watching it over and ovet. Every time you watch it you are self inflicting emotional pain on yourself and that is a form of self harm. Stop punishing yourself you did nothing wrong this is all on her choices it has nothing to do with who you are as a person or what you did or didn't do during the relationship. She broke the marriage and essentially killed the relationship the first time she emotionally or physically cheated and has lost the right to blame you for problems with a relationship that no longer exists.  You are now in a new relationship with her and you are in complete control as to whether the relationship continues or ends. This is your decision unless she just gives up and walks out.\n\nSteps\n\nTalk to lawyer even if you decide to reconcile prepare divorce filing you can always not finalize it and serve her but she needs to know you are serious and starting the process will show her where she stands. \n\nGet tested for STI'S.\n\nGather info on the AP and if he is married you need to tell his partner bit get advice from lawyer when to disclose .\n\nPlan carefully when and how to have the confrontation. You could start by  you feel something is off is there anything you need to tell me. If she stonewalls or denys demand to look at her phone. If she refuses then clearly state if you won't let me see then I have to assume you are hiding something probably an affair so I will be contacting a lawyer to start the divorce (don't disclose that you have already talked to a lawyer). If she blows up and continues to deny state calmly I know about AP (Full Name) now is there anything you want to tell me. Then you listen and when she half truths you play your trump card and show her the picture of his drivers license and then the video. Then just stop talking and listen to her freak out. Make sure a copy of the video is stored in a secure location. Don't say anything. Don't get in an argument over privacy or whose fault it is just listen to her until she winds herself down and then tell her your going to stay at your parents so you can think about things and make a decision or she can leave either way. Tell her you want a period of NC where you only discuss the children. Tell her you expect her to cut off all contact with the affair partner immediately and if you find out she has talked to him or seen him the marriage is over.\n\nYou need to establish other boundaries and how to monitor each other to show boundaries aren't being crossed I am sure a dozen posts here will give you ideas. Sorry you deserve better and honestly the chances of reconciliation are extremely low because you will never be able to unsee thar video but you have to decide if it's worth trying to build a new relationship.",
      "created_utc": 1720048238.0,
      "score": 991
    },
    {
      "id": "lbiacba",
      "body": "I don't think there's going to be a time when you want to do that at all. It's horrible and hard and despairing. You won't want to do it ever. You still have to though. Good luck. I wish you strength and bravery to do what you have to do.",
      "created_utc": 1720042985.0,
      "score": 293
    },
    {
      "id": "lbidse2",
      "body": "I know you don’t but you need to or you will explode. Bottling things up is never good. And you are just delaying the inevitable. \n\nIn the meantime when she asks are you okay, I’d ask her whether there was a new laundry detergent in the house as you’ve developed a nasty rash and lumps on your genitals and you need to make an appointment with the dr to get it looked at.",
      "created_utc": 1720044236.0,
      "score": 83
    },
    {
      "id": "lbjc0s2",
      "body": "My husband cheated on me 10 years ago and I have never talked about it to anyone except here and to a therapist. We are still together (still shaky after 10 years) and still nobody knows.",
      "created_utc": 1720058118.0,
      "score": 52
    },
    {
      "id": "lbi488g",
      "body": "It’s time to stop feeling down and time to start taking action. Protecting you and your kids is what is most important.  Go talk to a lawyer immediately.",
      "created_utc": 1720040837.0,
      "score": 204
    },
    {
      "id": "lbjxdyz",
      "body": "In my 20's, i cheated and I was cheated on. Cutting off all emotions for a life partner is not just as simple as,call an atty,stop having sex, etc etc.\n\nI wish you strength and much self love. She has betrayed you. You do deserve love. You are not responsible for her actions-she is. There's no knowing what she is thinking and I'm sure you're trying to figure out what caused her to do this to you n your family. There's never going to be a rationale that can explain this betrayal in a way that hurts less.\n\nTake time for yourself to realize what you can do with the info you have.\n\nMaybe work on shrinking or cutting that video a few seconds each time you watch it so it becomes only a few seconds long and you don't have to relive this \" 1/2 hour\" of traumatic stuff per sitting.  \n\nAlso,consider counseling with a person that handles post traumatic response stuff. Tapping and NLP are very good resources for trying to reduce the neurological pain you feel. Victims of SA have gotten very good results using that technique with professionals.\n\nIf you ever need to talk,reach out. I'm happy to chat with you in DM.\nBe good to yourself. We often relive our painful experievces-- it cayss a more lasting imprint.  But you can choose to not torture yourself.  It's almost obsessive/compulsive to hurt yourself. Like to remind yourself of the hurt when you start to worry you're forgiving her.   Try to avoid adding pain. :(",
      "created_utc": 1720068171.0,
      "score": 38
    },
    {
      "id": "lbk5q0r",
      "body": "You might not want to right now; but you’d probably feel better knowing your friends are around you and supporting you. Stranger validation is nice but it’s frankly not the same. Get help before something more difficult happens.",
      "created_utc": 1720072839.0,
      "score": 15
    },
    {
      "id": "lbj8vou",
      "body": "I am so sorry you are going through this.",
      "created_utc": 1720056772.0,
      "score": 13
    },
    {
      "id": "lbk9867",
      "body": "I’m so sorry, that’s devastating. Please go see a therapist, that is a safe place to lay this all out without any judgement. They can help you develop a plan that works for you, based on what you ultimately decide to do. Once you decide, then take appropriate action to protect yourself. Whether that’s talking to a divorce attorney, protecting your finances, etc. or trying to work it out. \n\nI sadly have been through the cheating partner dance myself. And for me, there was no going back as all trust was lost.",
      "created_utc": 1720074973.0,
      "score": 9
    },
    {
      "id": "lbks66t",
      "body": "Talk to a divorce lawyer or a therapist before you talk to anyone — depending on the route you may want to take.",
      "created_utc": 1720087890.0,
      "score": 7
    },
    {
      "id": "lblephv",
      "body": "Just send her the video. Say nothing, do nothing. But then in your home.. your bed.. the amount of disrespect. The lying in your face. This is not the woman you love. The woman you love would have never done this.",
      "created_utc": 1720099721.0,
      "score": 16
    },
    {
      "id": "lbhsxwc",
      "body": "I'm so sorry for what you are going through. \n\nYou were betrayed in your own home by one of the people you love the most. Your reaction is totally acceptable because you went through something traumatic. Please start seeing a therapist to support you during this difficult time.\n\nBefore confronting your wife, get a lawyer to know your rights and find out how you should proceed. When confronting your wife, make sure to record everything to protect yourself. You should stop having sex with her and, after confronting her, tell both your family and hers what is happening in order to not let her control the narrative, play the victim, and paint you as the bad guy.\n\nBy now, you already know that she doesn't love you and is likely with you just for the lifestyle you are providing her. She doesn't care how her infidelity will damage your mental health and self-esteem, and she definitely didn't care if she passed you an STD - you need to get tested ASAP. In addition, she didn't care about your and your kids' safety because she brought another man into your home - change the locks and get a security system. You should start family therapy and make sure that your kids don't already know that man - she might have been keeping your kids around him when you aren't around.\n\nThat woman is a disgusting human being who wasted years of your life, so don't have mercy on her or give her another chance. Fight for your rights, try to get full custody of your kids or at least 50/50, and until you are more mentally strong, use a mediator or a co-parenting app instead of keeping in contact with her.\n\nYour wife is a cheater, and her boldness in bringing another man into your home shows this isn't her first time cheating on you, so you need to make sure your kids are actually yours. Also, don't even waste your time and money on marriage counseling because that will only be good for her, and she will keep cheating on you but hiding it better.\n\nDon't stay with your wife just for your kids because the only thing you'll accomplish is building a toxic environment for them to grow up in, making them believe that infidelity isn't a problem, which might lead them to cheat on their future partners. Or worse, they might grow up having trust issues and allowing themselves to be treated as doormats because that's how they saw you being treated by your wife.\n\nPut yourself and your kids first, because you deserve so much better than her. What she did wasn't your fault, so don't give her the power to gaslight you, manipulate you, and destroy your mental health.",
      "created_utc": 1720037034.0,
      "score": 721
    },
    {
      "id": "lbhztof",
      "body": "You also need to get tested for STIs. This may not be the only man that she has done this with. I am so sorry.",
      "created_utc": 1720039357.0,
      "score": 86
    },
    {
      "id": "lbhpxv7",
      "body": "You aren’t pathetic, she betrayed you.",
      "created_utc": 1720036023.0,
      "score": 615
    },
    {
      "id": "lbi20zi",
      "body": "I've read your comments and I know you're beating yourself up and feeling pathetic but allow me to put another spin on this.\n\nIn a stressful situation you didn't act like a gorilla and burst into the room to confront them, you did what most men couldn't, you coldly gathered evidence and gained the upper hand. Break ups and divorces are horrible and stressful and men typically lose their cool and create evidence to be used against them, they lose their shit and create credible evidence to point them out as abusers or neanderthals, the woman comes out on top this way.\n\nYou have the hard, credible evidence and you need to stay cool with it, don't share it with others or damage your position by being brought up on revenge porn charges, show this to a legal representative and get legal advice.",
      "created_utc": 1720040092.0,
      "score": 137
    },
    {
      "id": "lbhx2gd",
      "body": "Op, you need a lawyer and a therapist. This kind of betrayal needs to be addressed in a safe space.",
      "created_utc": 1720038431.0,
      "score": 101
    },
    {
      "id": "lbia8dg",
      "body": "You’re allowed to feel what you’re feeling. Take the first step: contact a lawyer and set up an appointment — even if you’re on the fence, knowledge is power. Get the information that you need to help you decide. \n\nShe’s the pathetic one. I’m sure she knows deep down. \nCan you start going to a therapist and help you process? \n\nPetty me for when you are ready to confront her and if you’re going the divorce route: do another take the kids to grandparents, get back early. Wait until they go upstairs and just leave the divorce papers next to his pants with a post-it “We’re done.” Then if you can spent the day with a close friend who you can vulnerable with.",
      "created_utc": 1720042947.0,
      "score": 32
    },
    {
      "id": "lbi29l5",
      "body": "Use your brain now OP\n\n\nPrepare the divorce papers. Get your financials sorted. Keep that video backed up. It's leverage.\n\n\nIf you ever watched army movies growing up then this is \"behind enemy lines\".\n\n\nMove carefully & strategically.\nProtect yourself.\nDon't have sex with her as she may have an std or try honey pot you.\n\n\nHave a plan. Execute your plan. \n\n\nYou can do it. ",
      "created_utc": 1720040173.0,
      "score": 61
    },
    {
      "id": "lbicwac",
      "body": "STD testing. Document document document for if/when you need it. Don't put your physical health at risk, you can control that at the very least.",
      "created_utc": 1720043906.0,
      "score": 28
    },
    {
      "id": "lbhtvql",
      "body": "A divorce should be the next surprise. Don't give her any time to prepare, turn the narrative, or kids against you. Backup the video. Show an attorney. Get the divorce all finalized and serve her the papers. Show her a copy of the video you have. Show her parents. Show your parents. Tell the kids.",
      "created_utc": 1720037350.0,
      "score": 94
    },
    {
      "id": "lbior7x",
      "body": "Also, STD test asap",
      "created_utc": 1720048471.0,
      "score": 14
    },
    {
      "id": "lbjn8yh",
      "body": "So OP I’m a bit confused here. You were still able to go through with your plan to take her out on a surprise date and were able to look her in the face, eat dinner and act like there’s nothing wrong?",
      "created_utc": 1720063119.0,
      "score": 22
    },
    {
      "id": "lbigrx0",
      "body": "Consult with multiple top divorce lawyers in your region. You want to make sure you get good representation. As an added bonus, they’re not going to talk to your wife after talking to you.",
      "created_utc": 1720045365.0,
      "score": 8
    },
    {
      "id": "lbih103",
      "body": "You may also want to talk to a therapist because you’re going through a lot. I can’t even imagine. But talking to a third party who has your back and can help you talk about it and figure out what you want to do and how to proceed would be really beneficial.\n\nTalk to a lawyer even if it’s just to get information. Just find out what the process is - do you have to have a legal separation first or marital counseling, what to expect, how it would work with kids and custody, ballpark figure for costs, so you can have all the information to make an informed decision. \n\nThat way if you decide that you want to pursue divorce, you know exactly what needs to happen and you also have a therapist who is on your side helping keep you stable and grounded.",
      "created_utc": 1720045461.0,
      "score": 9
    },
    {
      "id": "lbhnqn4",
      "body": "I hope you find the strength to deal with this problem. Can't imagine after all the thing men go through they have to face this surprise here and there.",
      "created_utc": 1720035280.0,
      "score": 31
    },
    {
      "id": "lbitium",
      "body": "Agree with the other posters that you aren’t pathetic.  IMO you had an appropriate reaction to the trust you had in the one person who you trusted above all others destroyed.  \n\nPlease do get a really good divorce lawyer and understand your options.  A therapist might be good to help yourself as well as your kids if you decide to move forward with a divorce.  \n\nOne thing I’m sure you know absolutely not to do is post that video online.  I suspect there are laws doing so would break and the last thing you want it to go to jail.",
      "created_utc": 1720050372.0,
      "score": 2
    },
    {
      "id": "lbj2tdt",
      "body": "I needed to go to a therapist to help me leave my cheating ex. I knew what I had to do, but it just seemed so insurmountable that I would freeze up too and I felt so stupid and useless. Also, I’m sure you know this, but her cheating is a reflection of her lousy character, not any failing on your part.  I hope your next wife appreciates a surprise date night.",
      "created_utc": 1720054196.0,
      "score": 2
    },
    {
      "id": "lbkkc7q",
      "body": "It’s been a couple of weeks and she’s probably cheated a lot since. You need to do something about it",
      "created_utc": 1720082369.0,
      "score": 2
    },
    {
      "id": "lbhqexy",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1720036182.0,
      "score": -1
    },
    {
      "id": "lbjbhke",
      "body": "Sometimes I feel like men are expected be violent and explosive in situations like this, pure bullshit. The way he reacted to this traumatic event will probably be better for himself and his kids in the future.",
      "created_utc": 1720057889.0,
      "score": 105
    },
    {
      "id": "lbj1zmo",
      "body": "people don't usually cheat with better people, just convenient ones. please stop trying to figure it out. took me years to figure out after it happened to me.",
      "created_utc": 1720053855.0,
      "score": 136
    },
    {
      "id": "lbid9op",
      "body": "Do not seek revenge against him. Yes, he probably knew your wife was married, and yes, he's douche for it, but it's not worth using energy on him. Get a lawyer, and go after your wife. She is the one who broke your trust, and she knows better than to cheat. The best you can do is get rid of her and protect your assets with the video in court",
      "created_utc": 1720044041.0,
      "score": 350
    },
    {
      "id": "lbi2j7f",
      "body": "It's not worth it.\n\n\nTrust me.\n\n\nEnergy is finite. Use it to be better.",
      "created_utc": 1720040263.0,
      "score": 321
    },
    {
      "id": "lbhttgw",
      "body": "You can’t blame the guy, you don’t know if he knew you existed or not…your wife is fair game though. Unfortunately there’s kids involved, so just lawyer up n hit the gym like the others have said.",
      "created_utc": 1720037329.0,
      "score": 107
    },
    {
      "id": "lbidvhz",
      "body": "If he has a wife or a girlfriend, you should probably let them know also.",
      "created_utc": 1720044267.0,
      "score": 11
    },
    {
      "id": "lbi2tr9",
      "body": "It's probably true he knew you were married. It's also probably true she would have cheated with someone else if he had refused. Not saying he's guiltless at all, but he isn't the one to blame imo.",
      "created_utc": 1720040360.0,
      "score": 18
    },
    {
      "id": "lbk4xco",
      "body": "The best revenge is to live a good life. Keep your head up king, she doesn't deserve you.",
      "created_utc": 1720072363.0,
      "score": 3
    },
    {
      "id": "lbit8ms",
      "body": "There are just terrible and lost men out there in any matters relating to sex.\n\nThey could be lovely otherwise but they have no care in the world when it comes to pleasure, like a child has no care in the world as long as it satisfies their immediate need. \n\nYou don’t sound like a child to me. So do the grown up thing, protect your family, extricate your family, and start over. \n\n ",
      "created_utc": 1720050257.0,
      "score": 2
    },
    {
      "id": "lbjrj4h",
      "body": "Not healthy to assume this guy is trying to inconvenience you in life. For all we know maybe your wife said she has permission to hook up outside the relationship. It’s useless to fixate on the guy. \n\nSolve the problem with your wife. Think hard whether you want to go out in dramatic fashion, weeping even, or if you want to show no vulnerability and just take it straight forward. I just worry you’ll replay how you ended up confronting her and let it stress you out and scar you the same way the video affected you. Focus on making this easier for you.  ",
      "created_utc": 1720065165.0,
      "score": 2
    },
    {
      "id": "lbki90h",
      "body": "Id just be gone. Id pack all ny shit and leave without even acknowledging this bullshit until she worried for a bit. Or have her shit on the curb. Or just change the locks and dont answer the door til youre ready",
      "created_utc": 1720080923.0,
      "score": 19
    },
    {
      "id": "lbixlm9",
      "body": "Welcome gymbro. Gym and therapy. Quick road to recovery.",
      "created_utc": 1720052039.0,
      "score": 63
    },
    {
      "id": "lbifohe",
      "body": "It's a healthy way to release aggression, and endorphins help you to feel better. Plus, it's a healthy way to start seeing a life after a big change, and it gets you investing in yourself. It's hard to feel hopeless when you're taking care of your body and seeing yourself make progress. I know some people suggest it just for spite, like get a \"revenge body\" to make your ex sad, but I don't like that because it still centers your ex, the pain, and negative feelings. Looking at it as self-care is healthier.",
      "created_utc": 1720044947.0,
      "score": 75
    },
    {
      "id": "lbifiv6",
      "body": "It’s a physical outlet for the emotional crap as well\nAs making sure he doesn’t become housebound by depression. Exercise will improve his mental health",
      "created_utc": 1720044888.0,
      "score": 65
    },
    {
      "id": "lbimhbk",
      "body": "It might be a reference to a classic piece of advice given in Reddit in these situations. \"Delete Facebook, Lawyer up, hit the gym\". It might be a lil dated now that I think about it.",
      "created_utc": 1720047564.0,
      "score": 2
    },
    {
      "id": "lbl3tl8",
      "body": "This whole story sounds fake.",
      "created_utc": 1720094730.0,
      "score": 12
    },
    {
      "id": "lbin39l",
      "body": "Right? Parks a few blocks away, sees strange truck in front of his house, decided to \"surprise his wife\" with a kids free evening. Feels very writer prompt lol",
      "created_utc": 1720047804.0,
      "score": 37
    },
    {
      "id": "lbiw9si",
      "body": "My first instinct was this is fake too.",
      "created_utc": 1720051495.0,
      "score": 24
    },
    {
      "id": "lbifrpk",
      "body": "No doubt. Next time OP say that you left defeated and reviewed the house security cameras, it would be more believable than this",
      "created_utc": 1720044982.0,
      "score": 14
    },
    {
      "id": "lbjs7cq",
      "body": "Is his business relevant? Like your wife may have interacted with him?",
      "created_utc": 1720065497.0,
      "score": 2
    },
    {
      "id": "lbkui4v",
      "body": "DNA Test kids too!!  Even there & got surprised",
      "created_utc": 1720089418.0,
      "score": 216
    },
    {
      "id": "lbks8nq",
      "body": "What is an AP?",
      "created_utc": 1720087933.0,
      "score": 22
    },
    {
      "id": "lbohj26",
      "body": "Please listen OP - this is great advice",
      "created_utc": 1720141635.0,
      "score": 4
    },
    {
      "id": "lxowg3u",
      "body": "Just had to say, this is excellent advice. Sounds very professional/educated on the matter. Curious if you are in this line of work or just have personal experience",
      "created_utc": 1731895473.0,
      "score": 2
    },
    {
      "id": "lbkni8o",
      "body": "So sorry to hear that. So damn painful!!!!",
      "created_utc": 1720084624.0,
      "score": 20
    },
    {
      "id": "lbotso2",
      "body": "You guys deserve better than this pain",
      "created_utc": 1720147475.0,
      "score": 2
    },
    {
      "id": "lbmimup",
      "body": "No never do this. You need that hidden so she can't come up with something in court when he divorces her. Never ever show your full hand when you're getting divorced",
      "created_utc": 1720114211.0,
      "score": 16
    },
    {
      "id": "lbi2e45",
      "body": "This comment needs to be at the top.",
      "created_utc": 1720040215.0,
      "score": 93
    },
    {
      "id": "lbj1hig",
      "body": "he should tell his parents first I think..... someone needs to watch the kids when the fallout happens.",
      "created_utc": 1720053644.0,
      "score": 52
    },
    {
      "id": "lblmqgj",
      "body": "The fact that she lied to his face while the other guy was still there tells you everything you need to know about how much she cares about him. 100% he needs to get in front of her bs because she will blame it on him for sure",
      "created_utc": 1720102902.0,
      "score": 22
    },
    {
      "id": "lbjjoh5",
      "body": "Im very thankfull that you really thought through it, and took time on this response. I hope someone do the same for you.",
      "created_utc": 1720061470.0,
      "score": 8
    },
    {
      "id": "lbjda24",
      "body": "🏅",
      "created_utc": 1720058662.0,
      "score": 4
    },
    {
      "id": "lbj53a4",
      "body": "A lot of what you are saying makes sense, but don’t hurt OP further by saying his wife doesn’t love him. She probably does, but she absolutely broke trust and all the love in the world can’t fix that for some people (if my spouse did that to me it would be a deal breaker I would NEVER be able to trust them again, there would be no chance to rebuild trust and respect.) Stupid people make stupid mistakes; it doesn’t mean she doesn’t love OP. She’s just an untrustworthy *****.",
      "created_utc": 1720055157.0,
      "score": 18
    },
    {
      "id": "m40i2cm",
      "body": "Amen",
      "created_utc": 1735294849.0,
      "score": 2
    },
    {
      "id": "lbisccx",
      "body": "Not only that ~ I’d be getting a DNA test for the children.",
      "created_utc": 1720049896.0,
      "score": 39
    },
    {
      "id": "lbi3nqq",
      "body": "Right?! How is OP pathetic when his wife is screwing some guy behind his back so he is, ofc, extremely upset?!? \n\nLike they promised eachother to be faithful it's not pathetic to be upset that she lied/ didn't uphold her vows!!!",
      "created_utc": 1720040642.0,
      "score": 158
    },
    {
      "id": "lbinxmw",
      "body": "100% don't have sex with her or don't show her any affection and avoid her as much as possible. This will eat away at her until the hammer drops. Maximize her anxiety and unease in the meantime.",
      "created_utc": 1720048141.0,
      "score": 26
    },
    {
      "id": "lbisiko",
      "body": "I’d get all my ducks in a row and notify the families of what’s going on and then send HER a copy of the video. She can’t deny that.",
      "created_utc": 1720049965.0,
      "score": 21
    },
    {
      "id": "lbjh2ug",
      "body": "Jesus Christ. Why would you tell little kids and bring them into adult issues? That is the worst thing you could do. He has a right to be pissed off at her, but he doesn’t have a right to hurt his children to get back at her.Ffs’s.",
      "created_utc": 1720060314.0,
      "score": 39
    },
    {
      "id": "lbjq1ol",
      "body": "Not really. We didn't stay out late and went home early. She asked a few times if something was wrong. I tried getting drunk to get through it but was just too hard",
      "created_utc": 1720064443.0,
      "score": 51
    },
    {
      "id": "lbjicl7",
      "body": "Nope. Don’t share the vid with anyone except a lawyer.",
      "created_utc": 1720060877.0,
      "score": 11
    },
    {
      "id": "lbio7l7",
      "body": "Don't do this OP as it could run afoul of revenge porn laws. Speak to a lawyer about this before you do anything with it. If you're going to send it to anyone, send it to the guy's wife (if he has one) but not until you've discussed it with a lawyer and informed her you wish to separate.",
      "created_utc": 1720048252.0,
      "score": 14
    },
    {
      "id": "lbjbnok",
      "body": "1000%. No matter how justified he would have felt, being violent in that situation would have just put him in prison for assault or worse.",
      "created_utc": 1720057962.0,
      "score": 44
    },
    {
      "id": "lbjd8dm",
      "body": "> people don't usually cheat with better people, just convenient ones.\n\nThis deserves repeating.",
      "created_utc": 1720058642.0,
      "score": 101
    },
    {
      "id": "lbimp51",
      "body": "After the OP's divorce is finalized, he could send the video to the other man's spouse if he's married.",
      "created_utc": 1720047649.0,
      "score": 7
    },
    {
      "id": "lbhz7ee",
      "body": "He was in their house, and he snuck out with op there…. He knows",
      "created_utc": 1720039152.0,
      "score": 170
    },
    {
      "id": "lbhyna8",
      "body": "But he knew how  to sneak out, and he said she made a comment about how much time they had, he knew.",
      "created_utc": 1720038963.0,
      "score": 280
    },
    {
      "id": "lbhzamt",
      "body": "She made a comment on \"how much time they have left\" and he was in OPs home. He knew he existed. That being said, I also lean towards blame the one who took the vows.. but AP DEFINITELY knew OP existed.",
      "created_utc": 1720039182.0,
      "score": 80
    },
    {
      "id": "lbjywja",
      "body": "He snuck out, of course he knew!",
      "created_utc": 1720068978.0,
      "score": 10
    },
    {
      "id": "lbibx2l",
      "body": "Are you kidding? He didn't have to be there having sex with her, knowing she's a cheater. He just as guilty.  Your comment is typical of the cheaters handbook, \"if it wasn't me it would have been some other guy\".",
      "created_utc": 1720043552.0,
      "score": 3
    },
    {
      "id": "lbj0st8",
      "body": ">homebound by depression\n\nmaybe I need to hit the gym...",
      "created_utc": 1720053360.0,
      "score": 13
    },
    {
      "id": "lbl6edk",
      "body": "Honestly. It’s like if I asked chat GPT to write it.",
      "created_utc": 1720096005.0,
      "score": 8
    },
    {
      "id": "lbjaemx",
      "body": "I don’t know how anyone believes this.",
      "created_utc": 1720057425.0,
      "score": 18
    },
    {
      "id": "lbjsl7e",
      "body": "Yep. I have a good idea how they met. It is just crazy a simple call could turn into this",
      "created_utc": 1720065687.0,
      "score": 8
    },
    {
      "id": "lbkz4xe",
      "body": "Yep Affair Partner. Sorry i forgot this wasn't one of the relationship or infidelity subs where 0there are a lot of specific Abbreviations and it can get confusing if you're not used to it.",
      "created_utc": 1720092219.0,
      "score": 72
    },
    {
      "id": "lbkwqe7",
      "body": "Apparently it’s an affair partner, TIL",
      "created_utc": 1720090808.0,
      "score": 20
    },
    {
      "id": "lxp1ene",
      "body": "I guess you could say that my job as a mental health  and substance abuse counselor has given me experience with a lot of people who face traumatic family experiences. I also have to admit that reading this sub and other relationship subs as I guess you could call research has taught me even more about infidelity focused problems and how individuals have successfully navigated them. I also have direct experience with a few individuals I know. It's an occupational hazard that I always tend to have part of my brain focused on how I can integrate experiences into practical applications.\n\n Unfortunately, sometimes, when I have arguments with my wife I need to be careful how I word things. For instance one of the classic techniques when having a hard conversation in a relationship is to use \"I statements\". Like I feel x .... instead of you make me feel x... My problem is that sometimes when I use use this technique my wife has in the past accused me of manipulation because I was using counseling language. Luckily we have worked out that issue. Thank you for the compliment it's nice to know that sometimes I come across as knowing what I am doing 😀.",
      "created_utc": 1731897322.0,
      "score": 2
    },
    {
      "id": "lbp6x8x",
      "body": "Agreed but untangling everything is not something I am capable of at the moment and I don’t know when that will be.  Besides he’s been going to therapy since 2021 and is a changed person. I am just hoping I will catch up. And things are stable right now.\n\nBut really that was for OP just to say, you don’t have to tell anyone that is not obligated to not share that info. The embarrassment and humiliation of just knowing the AP knows was enough people outside of my marriage for me. I am a very private person.",
      "created_utc": 1720154144.0,
      "score": 2
    },
    {
      "id": "lbi40cj",
      "body": "Agreed",
      "created_utc": 1720040762.0,
      "score": 25
    },
    {
      "id": "lbjxcvc",
      "body": "Your definition of love and mistake are quite messed up in my opinion.\n\nWhen you love someone, you don't cheat on them and put their mental and physical well-being at risk. You also definitely don't lie to them.\n\nIf she loved and respected OP even a little and had feelings for another man, she should have been honest with OP and worked on their marriage in couples therapy instead of cheating on him, or divorced him amicably to ensure a good co-parenting relationship so their kids wouldn't be impacted. However, she is just a narcissistic cake-eater who didn't care how her infidelity would affect OP and their kids.\n\nAlso, what she did wasn't a mistake - she didn't just trip on her own feet and fall on some guy's dick. She didn't just cheat on him; she deliberately brought another man into their home to have sex in their bed. What she did is the ultimate betrayal. He also doesn't know if she has been keeping that man around their kids and if those kids are actually his.",
      "created_utc": 1720068154.0,
      "score": 35
    },
    {
      "id": "lbkzhhj",
      "body": "You don’t live someone you cheat on,  by romping another guy in your marital home.",
      "created_utc": 1720092413.0,
      "score": 10
    },
    {
      "id": "lbjhgkm",
      "body": "She will already know. She’s waiting for his next move to confirm it. The fact he hasn’t made a move must be messing with her head big time. He should keep it this way and get the lawyer thing and therapy organised before the first shot is fired.",
      "created_utc": 1720060482.0,
      "score": 18
    },
    {
      "id": "lblwqlk",
      "body": "100% kid should nto be involved in a adult bullshit, the only time the kids need to know is if she is lying and trying to alienate him or when they are older and want to know",
      "created_utc": 1720106517.0,
      "score": 5
    },
    {
      "id": "lblevgp",
      "body": "Just tell me you didn’t sleep in those sheets.",
      "created_utc": 1720099791.0,
      "score": 8
    },
    {
      "id": "lbj8hkx",
      "body": "Panzer is correct about this",
      "created_utc": 1720056606.0,
      "score": 6
    },
    {
      "id": "lbinnac",
      "body": "If OP is in the U.S. this would be considered revenge porn and is illegal.",
      "created_utc": 1720048026.0,
      "score": 50
    },
    {
      "id": "lbiqg5e",
      "body": "Absolutely not. OP - DO NOT share or send that video to anyone, that would absolutely land you in hot water and also just morally be a disgusting thing to do.",
      "created_utc": 1720049144.0,
      "score": 41
    },
    {
      "id": "lbjzisu",
      "body": "Plus, that there has to be pictures of her and her husband and them with their children around the house.",
      "created_utc": 1720069315.0,
      "score": 10
    },
    {
      "id": "lbi2no9",
      "body": "hear ya, but we just don’t know. what is known, the wife is a pos. She planned for an overnight stay, while her husband was dropping off the kids. Not even at a hotel either, she has no respect for not even her own children who also reside & play in that house.",
      "created_utc": 1720040304.0,
      "score": 36
    },
    {
      "id": "lblmazh",
      "body": "I'm saying the random guy is not the one who betrayed the trust of OP and shattered his whole life, that would be his wife. I'm not saying the AP is a good guy, or guiltless like I said, I'm just saying it's very common for people to hyperfixate on the AP when it's their own partner that ruined the relationship. Sleeping with a married woman is bad, I didn't think that needed to be said.",
      "created_utc": 1720102741.0,
      "score": 4
    },
    {
      "id": "lbj4svi",
      "body": "Legit, the gym will be positive in a lot of ways you don’t expect.",
      "created_utc": 1720055034.0,
      "score": 12
    },
    {
      "id": "lbjstjg",
      "body": "Do you have any idea when it started based on what you know? Did you give her \"kid free\" time a lot? Maybe this was a first. ",
      "created_utc": 1720065801.0,
      "score": 3
    },
    {
      "id": "lzgvo7q",
      "body": "Sorry for the late reply! Appreciate your message and knowledge, glad you've managed to navigate things better with the wife haha not always easy! Cheers friend",
      "created_utc": 1732829773.0,
      "score": 2
    },
    {
      "id": "lbjk79a",
      "body": "Not the video but just let the spouse know about that would be better. Tell her he has it but it would be revenge porn or something. Also the video will be evidence of the case and anything else...",
      "created_utc": 1720061706.0,
      "score": 25
    },
    {
      "id": "lbiqagx",
      "body": "We do know though, we know that he was sneaking out as OP’s wife and OP were together. He absolutely knows she’s a married woman. I’m not saying that makes him any worse or bettter and I certainly don’t think OP should waste any precious energy on stalking or hurting him. But it’s safe to say the guy knows she’s not a free and single woman.",
      "created_utc": 1720049081.0,
      "score": 21
    },
    {
      "id": "lbj6g61",
      "body": "Thanks stranger, I actually did make a major change and started doing intense cardio beginning early January.  That along with counting calories, I was able to drop a good 40 lbs!  But then I kind of fell off.  Its hard to keep that level of intensity up.  I need to get back to it... I honestly miss how mentally and physically energized I was after a workout. Even with my weightloss I'm still in the obese category so I really need to get back at it.  Thanks for the reminder.",
      "created_utc": 1720055733.0,
      "score": 7
    }
  ]
}