{
  "id": "1kndtyv",
  "title": "My husband had an “affair” with my little sister.",
  "selftext": "My life will never be the same after this. We’ve been married for two weeks. My 27 year old husband has been sleeping with my little sister behind my back. She’s 17, legal age of consent, but she’s still a baby. We just found out she’s one month pregnant, but she refused to say who the father is. Yesterday my parents asked me to come over. Apparently, they installed a monitoring app on her phone and that’s how they found out he’s the father. My sister is saying she is sorry over and over again. My husband also apologized, saying he made a mistake and wants us to go to counseling and stay married. I didn’t say much. I told him I’m filing for divorce. I’m not changing my mind. \n\nI know for sure I’ll never speak to him again after everything’s over. As for my sister, I don’t know. I honestly don’t know.\n\n*An update has been posted.*",
  "created_utc": 1747329569.0,
  "score": 6764,
  "num_comments": 613,
  "url": "https://www.reddit.com/r/offmychest/comments/1kndtyv/my_husband_had_an_affair_with_my_little_sister/",
  "comments": [
    {
      "id": "mshrggd",
      "body": "Check whether you can file for annulment rather than divorce - he married you under false pretences while fathering a child with another woman. The dates will support the annulment.\n\nAlso, although you won't want to hear this, get an STI test as you don't know who else he's been cheating on you with and it is obvious he wasn't using protection. \n\nSending you a hug to help hold you together a little bit.",
      "created_utc": 1747333917.0,
      "score": 2045
    },
    {
      "id": "mshiz54",
      "body": "Two weeks? Can you get an annulment?",
      "created_utc": 1747331433.0,
      "score": 5976
    },
    {
      "id": "mshfnck",
      "body": "What the hell? (Like, really?) That's just... Wow.",
      "created_utc": 1747330489.0,
      "score": 1228
    },
    {
      "id": "mshjqji",
      "body": "You could probably get an annulment since it’s so new",
      "created_utc": 1747331646.0,
      "score": 240
    },
    {
      "id": "mshdz26",
      "body": "She was 1000% groomed by him.  He knew what he was doing.   If I were u I’d move away for a good while",
      "created_utc": 1747330016.0,
      "score": 3694
    },
    {
      "id": "msieaug",
      "body": "Of course he wants to stay married and get counseling - that’s the only way he can save face and convince himself that he’s not a terrible person. Run and never look back.",
      "created_utc": 1747340678.0,
      "score": 130
    },
    {
      "id": "mshgxbu",
      "body": "So im really sorry. I am. I do want to throw this out there. when i was 17 i was groomed by someone 10 years my senior too. I didn't even want the relationship but was still groomed into it.\n\nYou have every right to be livid with both parties because shes still a human who did something she knew damn well was wrong. But theres no way this wasn't grooming. There just isn't. The most I can say is, if you have the ability to get a therapist, please do. Working on this on your own is gonna be hard and well meaning family will likely try to push you to under or over react and respond. Often its them trying to make you get over it quickly. Feel all your feelings, they are valid, but also try to find non bias help with what you're going through.\n\nYour Husband on the other hand, didn't make a mistake. He made a choice and got caught. Im glad you are divorcing him, but im sorry that he put you in this situation. im so sorry.",
      "created_utc": 1747330854.0,
      "score": 1328
    },
    {
      "id": "mshd484",
      "body": "damn what the fuck, 17 and 28 is not normal at all, what are you going to do with your sister?",
      "created_utc": 1747329775.0,
      "score": 574
    },
    {
      "id": "mshge15",
      "body": "Divorce.  Ditch. Done.  Not like dig a hole and put in a ditch. Although I'm sure you may feel that way.  Hug.",
      "created_utc": 1747330702.0,
      "score": 126
    },
    {
      "id": "msicxvr",
      "body": "She's a month pregnant but you're two weeks married. So he's been cheating for a while. Your sister mightve not been the only person that he's cheated on you with. You should get tested.",
      "created_utc": 1747340293.0,
      "score": 115
    },
    {
      "id": "msjs2ck",
      "body": "Your husband is a predator. Get an annulment as soon as you can. I’m sorry you’re having to go through this.",
      "created_utc": 1747357422.0,
      "score": 52
    },
    {
      "id": "msht8zp",
      "body": "Annulment. Immediately.",
      "created_utc": 1747334459.0,
      "score": 35
    },
    {
      "id": "mshrk0c",
      "body": "your husband is a creep who is sleeping with a teenager.\n\nno sane dude would want to stick his dick in a child no matter the semantics of \"age of consent\"",
      "created_utc": 1747333946.0,
      "score": 120
    },
    {
      "id": "mshgpzg",
      "body": "I'm so sorry OP.\n\n\nHow long has he known your sister?\n\n\nIf they recently met, they are both disgusting. Full stop. If he met her as a child, he probably groomed her. The fact that she was still trying to protect him after she got pregnant says a lot. Regardless, he's a predator. \n\n\nI also have an older sister and could never imagine doing this to her unless I absolutely hated her. I can't understand why she would do that to you smh.",
      "created_utc": 1747330796.0,
      "score": 228
    },
    {
      "id": "mslg1nk",
      "body": "It wasn’t an affair. He groomed your underage/vulnerable sister. Make sure everyone knows what type of person he is. And get an annulment",
      "created_utc": 1747386518.0,
      "score": 27
    },
    {
      "id": "mshpyvi",
      "body": "if youve only been married one week, you might be able to get it anulled due to infidelity. I'm so sorry this happened to you",
      "created_utc": 1747333470.0,
      "score": 24
    },
    {
      "id": "msic9r4",
      "body": "Your sister was groomed, I highly doubt this affair just happened to start when she was 17, it takes the average couple approximately a year to have a baby *when they are trying*.\n\nHe's probably been sleeping with her for some time now and you're just now finding out.\n\nI'm so sorry this is really fucked up.\n\nIf you've only been married a few weeks, you can probably get the marriage *annulled* which is better than a divorce if you're able. It literally says \"the marriage NEVER happened\" which is important for some things.",
      "created_utc": 1747340099.0,
      "score": 23
    },
    {
      "id": "mshkzg1",
      "body": "I would honestly blast this business all over social media. You don’t have to say it was your sister or whatever but you could say he likes to sleep with an impregnate 17 year-old.\n\nBut I would do this after the divorce",
      "created_utc": 1747331998.0,
      "score": 72
    },
    {
      "id": "mshtkx1",
      "body": "I wouldn’t be able to be physically in his presence anywhere but the court house where we’re divorcing. \n\nThis is so so awful. You also have the right to take a lot of space from your sister and family.",
      "created_utc": 1747334558.0,
      "score": 16
    },
    {
      "id": "mshfni0",
      "body": "Get rid of him and tbh I would go NC for the time being with your sister. I get that she’s young but even a 17 year old should know that it is not normal to sleep with the HUSBAND of her SISTER. No matter the age. I know people will say he groomed her and that’s most likely true but grooming does not mean she is not able to think for herself that it’s wrong to sleep with the husband of her older sister.",
      "created_utc": 1747330491.0,
      "score": 209
    },
    {
      "id": "msiomtf",
      "body": "Depending on where you live, after being married for 2 weeks, you might be able to get an annulment of the marriage instead of a divorce. It might be faster.",
      "created_utc": 1747343702.0,
      "score": 15
    },
    {
      "id": "mshojns",
      "body": "So, and I’m sorry to be so blunt OP, it sounds like he wanted your sister all along but settled on you because she was 15 (so far as you guys know) and you were the legal and therefore logical option….. for the time being. This man is a pedophile. Absolutely involve the police and have them check his hard drives while they’re at it. He will 100% move on to another young victim after he’s done with this situation if he’s let off easy.",
      "created_utc": 1747333050.0,
      "score": 29
    },
    {
      "id": "msi34qe",
      "body": "Yeah this one is difficult bc 17 is old enough to know right from wrong and sleeping with your sisters husband is pretty clearly WRONG. But also, she is literally still a teenager and it’s just really not that hard to groom a teenager.\n\nGlad you’re throwing that weird predator of a man away tho, at least that part is pretty clear.",
      "created_utc": 1747337404.0,
      "score": 13
    },
    {
      "id": "mskasho",
      "body": "I’d sit down with my sister and ask her some very difficult questions. \n\nStarting with how long your husband had been grooming her. Or if she ever fully consented. \n\nSomething doesn’t feel right here. \nYour husband is a predator.",
      "created_utc": 1747364456.0,
      "score": 12
    },
    {
      "id": "mshnc0t",
      "body": "Annul the marriage, move away, and change your name. This is the kind of situation that calls for a complete redo for yourself. I would 1000% separate myself from these people and pretend I didnt even know them.",
      "created_utc": 1747332689.0,
      "score": 23
    },
    {
      "id": "msjg56p",
      "body": "Ew. Even if the age of consent is 17, he’s still 10 years older and obviously interested in kids aged 17. \n\nThat’s gross. Get an annulment. Wash your hands of him before you end up pregnant too.",
      "created_utc": 1747352954.0,
      "score": 9
    },
    {
      "id": "msk4rb3",
      "body": "This happened between my older sisters 3 years ago. They still don’t talk.\n\nYour husband is gross and your sister is old enough to understand what they did. I’m so sorry this happened to you. I don’t give a shit if 17 is the age of consent, you’re right, she’s still a baby. She can be sorry all she wants to be, but both parties involved are disgusting.\n\nShe wasn’t sorry when the ‘affair’ was happening, she’s only sorry they got caught.",
      "created_utc": 1747362145.0,
      "score": 12
    },
    {
      "id": "mshcyuw",
      "body": "Get rid of the man. The sister is somewhat innocent. She probably was groomed into it. Ngl you got every right to be uoset and not talk to her sister if all you wanna do is scream at her. It’s best to take a step back from her and sort yourself out.",
      "created_utc": 1747329733.0,
      "score": 153
    },
    {
      "id": "mshszk6",
      "body": "First off, I'm so very sorry you have such a terribly selfish sister and spouse.  They truly are lousy excuses for human beings and you deserve so much better then these two.  I'm glad your parents were decent enough to tell you what was going on and from what little you've shared at least, have chosen to not support their infidelity and told you what was going on once they figured it out.  That's a point in their favor.  \n\nI don't know if there is any coming back from this with your sister TBH.  It really depends on you and the circumstances behind this relationship.  As someone pointed out, this very well could have been a grooming situation.  Under those circumstances, that might possibly earn her some leniency but not much given that your parents seem to be on top of things and sound like the kind of folks that would easily have stepped in to fix things had your sister told them she was being pushed into a situation she didn't want to be in and needed help.   Some people are perfectly comfortable cutting family off forever and never give them another thought.  Personally, I don't think I have that in me.  I might blow up in a major way initially and let someone that has hurt me have it with both barrels but eventually I might (depending on who they are and how they chose to behave going forward) start to allow some kind of relationship to re-develop.  \n\nAs for the spouse, pretty sure, there isn't any point in saying anything about this since you've clearly made your choice and in all honesty, his isn't the most painful part of all of this.  It's your sister's betrayal, I imagine that cuts the deepest, and that will take the most time to sort out however you choose to do so.  \n\nGive yourself that time and allow yourself to feel however you feel about this situation.  If your sister chooses to have this child that means things will get a hell of a lot harder before they get better for you so you will need to give yourself a LOT of grace to sort through those complicated feelings you are bound to have so seeking out a professional to help you isn't a bad idea.  I hope things work out for you when this is all said and done.  Also, I wonder if you would be able to have your marriage annulled given how short your marriage was before his infidelity was discovered.  It's worth looking into if you care anyway.",
      "created_utc": 1747334379.0,
      "score": 22
    },
    {
      "id": "mshnqfo",
      "body": "Yes..Don’t..Change..Your..Mind..",
      "created_utc": 1747332807.0,
      "score": 7
    },
    {
      "id": "msi2nds",
      "body": "OMG. How long has he known her? He made a mistake? Grooming your sister isn't a one time mistake. That takes planning and time. How long was she legal before he made his \"mistake?\" What a total AH!",
      "created_utc": 1747337261.0,
      "score": 8
    },
    {
      "id": "msixfs4",
      "body": "Yeah F your sister and the ground she stays on but I’m so sorry to hear that.",
      "created_utc": 1747346426.0,
      "score": 9
    },
    {
      "id": "msjk4pl",
      "body": "Has anyone asked how long OP was dating her husband? How long has husband known the 17 Y.O. Sister??",
      "created_utc": 1747354418.0,
      "score": 10
    },
    {
      "id": "mshm0u1",
      "body": "Just be thankful you found out before YOU had kids with him. Also I would encourage your parents to contact the police even if it is legal age of consent.",
      "created_utc": 1747332300.0,
      "score": 16
    },
    {
      "id": "mshhzfl",
      "body": "I think it’s best to cut ties with her. 17 isn’t a baby she isn’t a toddler who didn’t know completely what is wrong from right in fact she hid the knowledge about who is the father because she knew it’s wrong.\n\nI’m backing you up on the divorcing your husband.",
      "created_utc": 1747331151.0,
      "score": 32
    },
    {
      "id": "mshftos",
      "body": "Oh... Wow. I can't even imagine what you're going through right now. It's like, who does he think he is? Our sister deserves better, and so do you.",
      "created_utc": 1747330540.0,
      "score": 22
    },
    {
      "id": "mshik2c",
      "body": "firstly, im so sorry, op. while i do believe your sister was groomed, at 17 you still know not to sleep with your sibling’s partners. unless this was something that’s been going on for several years, i think you have a right to be angry at her too. \n\nyour husband belongs in the garbage, however.",
      "created_utc": 1747331315.0,
      "score": 23
    },
    {
      "id": "mshggq2",
      "body": "He’s a disgusting predator who probably groomed your sister. How old was she when it first started \n\nWhatever future relationship you have with your sister, he definitely needs to be booted out of your life. How on earth would your marriage ever come back from that. He was sleeping with her whilst planning your wedding and getting married.",
      "created_utc": 1747330723.0,
      "score": 38
    },
    {
      "id": "msjdje7",
      "body": "She's 17. That's not ok. And it's not the legal age in my state. Makes him a pedophile in my eyes",
      "created_utc": 1747352029.0,
      "score": 7
    },
    {
      "id": "msjuc7n",
      "body": "Divorce! Immediately!",
      "created_utc": 1747358272.0,
      "score": 6
    },
    {
      "id": "mshs7sd",
      "body": "What on earth does a 26 year old man see in a 17 year old girl. I was hit in a LOT when I was that age but older man and they all seems immature and dumb.",
      "created_utc": 1747334147.0,
      "score": 13
    },
    {
      "id": "mshjg4d",
      "body": "This is how my now 85 year old mother was conceived. She found out after her parents died. They brought a “baby they were adopting” home and told her siblings never to tell her. My grandmother never had any more contact with her sister. My mom never met her biological mom. Different times in the 1930’s.",
      "created_utc": 1747331565.0,
      "score": 12
    },
    {
      "id": "mshlwbt",
      "body": "I'm so sorry OP. That is sickening.\n\n\nYour sister is only 17, so there is a chance that your soon-to-be ex-husband may have been grooming her before you two got married. But with that said, a 17-year-old girl should know that it's not normal to have sex with their brother-in-law. \n\n\nAs for the husband? Go no contact with him and possibly file charges if he has been grooming your sister for a while. He is a predator.",
      "created_utc": 1747332263.0,
      "score": 5
    },
    {
      "id": "mshmah8",
      "body": "I don't know what you've been told, but It's Not Your Fault. No. Not your. Whatever you think. Still Not Your Fault.",
      "created_utc": 1747332380.0,
      "score": 6
    },
    {
      "id": "msi9x77",
      "body": "Please don’t shoot the messenger here because this is just an opinion I am putting out there BECAUSE I see everyone saying how she has been groomed, everyone can only see how he is at fault and she has been groomed. \nI 100% agree the husband is at fault he is the one who married you knowing he was already having sex with your 17 year old sister. Apparently un protected sex with your little sister. Have you been tested for any std’s because little sister or not… she was unscrupulous enough to have sex with your fiance then your husband and vise versa. Is she the only one he has been having sex with besides you? \nMy heart breaks for you, I cannot even imagine the pain you are going through right now and will continue to go through every time you look at your little sister and her baby. I know it has been mentioned for you to move if you can and start over, I agree. No matter how hard they try your family are going to try and make you forgive and forget, they will try to get you to accept the baby because it’s not the baby’s fault ( and it’s not the baby’s fault. But that doesn’t mean you have to have anything to do with anyone you don’t want too in your life. ) For your mental health and well being please take care of yourself first and foremost and everyone else and I do mean EVERYONE ( pregnant little sister included ) can kiss your foot. No one was putting your feelings first when they were getting their rocks off. When they were enjoying themselves. \nIf this does prove that he did groom your sister I’m sorry for bringing the other stuff up but I just want you to think of all sides and possibilities. I will be praying for you. For whatever reason you had to go through this horrible pain you will find the real man of your dreams, he is out there just waiting for you. Good luck to you!!",
      "created_utc": 1747339411.0,
      "score": 8
    },
    {
      "id": "msia2rf",
      "body": "They're not sorry! They're just sorry they got caught! File that divorce and raked both of them through the coals!",
      "created_utc": 1747339456.0,
      "score": 6
    },
    {
      "id": "msia3gy",
      "body": "Honey. I'm glad your parents had the guts to tell you the truth. Don't stay with the man who fucked your baby sister. \n\nDon't be an aunt to his baby, either.\n\nI hope your parents can talk to her about an abortion. \n\nYour family needs to try to snip every single point of contact you've had with him if your every going to heal as a unit\n\nWhat he did to you seems life-ruining \n\nBut I promise you, you're life isn't ruined\n\nHe's really ruined your sister's life though",
      "created_utc": 1747339462.0,
      "score": 7
    },
    {
      "id": "msiklfg",
      "body": "I only see one victim here. That's YOU.",
      "created_utc": 1747342496.0,
      "score": 8
    },
    {
      "id": "mshk6cq",
      "body": "This is enormous breach of trust with your husband AND sister. It is unclear if your sister keeps this baby or not. If she does, it is one scenario, if she doesn’t, it is a different one. Being close to a child of this despicable dude will be very hard. Especially if your sister marries the dude. \n\nThe healthiest thing in my opinion is to move away from this cluster and start over. If possible. I would keep very low to no contact with the sister as any contact will be painful for both parties. In case, she decides to abort and break up with the dude, here, I potentially can see you joining forces with her in healing from this drama.",
      "created_utc": 1747331769.0,
      "score": 20
    },
    {
      "id": "mshnp4m",
      "body": "Divorce.\n\nAs for your sister, yes she was probably groomed over the two(?) years she’s known him, but even 15 year olds know that their siblings’ partners are off limits. \n\nShe refused to say who the father was because she was still actively planning on deceiving you and protecting their affair. Neither of them are sorry they did it, they’re sorry they got caught.\n\nIf she won’t abort, then I really recommend distance - seeing their child will hurt a lot, and he’d likely still be around because of the child. I’m so sorry you’re going through this. Talk to lawyers, start detangling your life based on their instruction. Be good to yourself, take distance and start healing while away.",
      "created_utc": 1747332796.0,
      "score": 23
    },
    {
      "id": "mshinso",
      "body": "I'm pretty sure what ur husband did is a fucking crime. Even if your sister is 17. \n\nHonestly your husband is digusting",
      "created_utc": 1747331344.0,
      "score": 16
    },
    {
      "id": "msl9139",
      "body": "Hey so your sister was groomed by your preditor husband. You need to take all the facts and get this annulled really fast. \nHe's going to say everything in his power to keep you, but at the end of the day he took advantage of a child (17 is a child I dont care about age of consent)\n\nYour sister is a victim and it's going to be hard but you need to be there for her.",
      "created_utc": 1747382091.0,
      "score": 14
    },
    {
      "id": "mshh8wc",
      "body": "It sounds like grooming, I have to say.  Whether it's legal or not, if you jus got married, I'd assume about a year long engagement, and a year of dating prior to that, so he came into her life 14-15?  Your sister was both old enough to know better, and young enough to be manipulated.  100% get the divorce - or an annulment might be easier depending on where you are.\n\nAs for your sister - I don't know long term, but I think a year or two of no-contact plus low-contact with your parents is justified.  See where you are from there.  Your ex is a real POS.",
      "created_utc": 1747330944.0,
      "score": 25
    },
    {
      "id": "mshh276",
      "body": "They are both trash! I’m so sorry. People can say she was groomed, but unless she’s incredibly stupid to the point that she can’t live on her own, she knows it’s wrong to have an affair with someone, especially to hurt her own sister. ",
      "created_utc": 1747330892.0,
      "score": 29
    },
    {
      "id": "mshmm7i",
      "body": "There’s no going on with him from this. \n\nHe didn’t make a “mistake”, he made a full conscious Choice which takes many steps to do. \n\nAnd I’m sure they did it many times for him to get her pregnant Two Weeks Before your wedding. \n\nI know everyone talks about grooming and I’m sure I’ll get down voted But, when I was 17, I KNEW this type of thing was wrong and Knew Not to do this!  \n\nTeens, especially older teens are more mature in the ways of the world now, than when I was her age, so you can’t let her off the hook for being naive. \n\nI go NC with her and since you’ve only been married for just two weeks, get the marriage annulled. It’s much cheaper. \n\nI could Never look at them the same and would keep any new man I have in my life Away from the sister. \n\nShe knew what she was doing.",
      "created_utc": 1747332476.0,
      "score": 36
    },
    {
      "id": "mshjkah",
      "body": "17 age of consent? Where do you live. \n\nHere it’s only consent if the age gap can’t be more than 6 years.",
      "created_utc": 1747331597.0,
      "score": 15
    },
    {
      "id": "msiia83",
      "body": "Yeah…that’s not your sister, run away from her. Those are the type of people that end up poisoning or stabbing someone they are close to. 17 is young, she was definitely groomed. But she still knew right from wrong, it was not a random men, but YOUR husband.",
      "created_utc": 1747341826.0,
      "score": 10
    },
    {
      "id": "mshjyen",
      "body": "Better at 2 weeks and not 10 years?",
      "created_utc": 1747331708.0,
      "score": 6
    },
    {
      "id": "mshtze5",
      "body": "i’m begging for this to be bait",
      "created_utc": 1747334678.0,
      "score": 4
    },
    {
      "id": "msiaxlz",
      "body": "You married a predator. Thank goodness you aren’t falling for his crap.\n\nGo through everything because somewhere there’s someone even younger that he’s victimized.\n\nAs for your sister…what’s the choice re the pregnancy? The topic needs to come up asap. There’s not an unlimited runway for those sorts of decisions. Else, y’all going to be tied to this creep forever.",
      "created_utc": 1747339710.0,
      "score": 5
    },
    {
      "id": "msibdel",
      "body": "I would be done with both of them.  I mean you know her and u probably will be able to tell after talking to her why she did it.  Not sure what kind of relationship u have with her.  Is she jealous of you and did this to spite you? Or did she just like the attention and was just taken advantage of.  Take your time and be true with your feelings.  Maybe one day u can forgive her but not right now.  She is 17 and should have known better.   Instead she got herself pregnant.  I would honestly get divorced and move away.",
      "created_utc": 1747339838.0,
      "score": 6
    },
    {
      "id": "msik2cu",
      "body": "You can distance yourself from your sister until you figure out how to feel. You don’t have to decide right now what your relationship will look like forever",
      "created_utc": 1747342342.0,
      "score": 4
    },
    {
      "id": "msiq1th",
      "body": "Get an annulment. Any lawyer worth his salt will tell you this.",
      "created_utc": 1747344130.0,
      "score": 5
    },
    {
      "id": "msisd0b",
      "body": "I couldn’t have a relationship with her either. LC at best, and I certainly wouldn’t trust her again.",
      "created_utc": 1747344828.0,
      "score": 5
    },
    {
      "id": "msj0wd9",
      "body": "Wow. This is so devastating. 2 weeks. I'm so sorry. Your sister may be young, but how could she not consider you at all???",
      "created_utc": 1747347588.0,
      "score": 5
    },
    {
      "id": "msj4aa6",
      "body": "RUN!!!!",
      "created_utc": 1747348772.0,
      "score": 5
    },
    {
      "id": "msjbr54",
      "body": "17?! how long have you guys been together? seems like this could be a grooming situation unfortunately if you’ve been together for a while and he’s known your family for a while…",
      "created_utc": 1747351405.0,
      "score": 5
    },
    {
      "id": "msjlt2j",
      "body": "......big question but how long they been fuckin? Cause 17 may be legal but 16...15?",
      "created_utc": 1747355057.0,
      "score": 5
    },
    {
      "id": "msk2l9f",
      "body": "He's a groomer. 17? And he's 27? He'd definitely go younger if given the opportunity.  Gross. Annulment immediately.",
      "created_utc": 1747361320.0,
      "score": 4
    },
    {
      "id": "mshh2o2",
      "body": "Only thing I'd advise you to advise your parents of is that your stbx has likely groomed your sister and she needs to see a therapist to see when this \"relationship\" started, when it went from platonic to serious, and if she understands that the relationship was inappropriate not just because he's married to you, but because he's known her since she was a minor aswell.\n\nWith regards to your relationship with your sister, only you and her can figure that out in the long run. For the time being you should concentrate on how you're going to get through what's happened. You've had your life as you knew it flipped upside down. Fair play to you for filing for a divorce. \n\nI really hope you find the peace you deserve. One day someone will come along and give you everything you want, if you decide you want someone again. Take your time and heal.",
      "created_utc": 1747330896.0,
      "score": 11
    },
    {
      "id": "mshppge",
      "body": "WOW\n\nGet as far away from this man-child as you can.\n\nYes, your sister is 'Legal' but only just.\n\nBut she is an adult so they are both responsible for this so how you negotiate a future with your sister is going to be difficult.\n\nI honestly dont know where you will go after this because its heartbreak from all angles 💔",
      "created_utc": 1747333394.0,
      "score": 8
    },
    {
      "id": "mshgld9",
      "body": "Ask him how impregnatinga seventeen year ld after grooming her is a mistake.",
      "created_utc": 1747330759.0,
      "score": 12
    },
    {
      "id": "msigu9z",
      "body": "17 isn't a baby, OP. Thats one year off from being considered a whole ass adult.  \nI'd get an annulment and run. He groomed her, there is no way they just decided to have sex one day and if that is what happened, he should have said no and immediately told you that your sister tried to have sex with him.",
      "created_utc": 1747341408.0,
      "score": 10
    },
    {
      "id": "mslco7d",
      "body": "I’m kind of shocked at how many comments here are putting so much blame on her sister. A child. A child who was very obviously groomed.\n\nYes, she knew OP was married to him. Who knows what he said to manipulate her, though, and who knows when this all started? \n\nOP, I’d try to find out from either your parents or your sister if he was grooming or having relations with her before the age of consent.",
      "created_utc": 1747384397.0,
      "score": 13
    },
    {
      "id": "mshgi8h",
      "body": "Divorce yourself from your husband AND your sister. If Mom & Dad push back talking about \"support\" and \"family\", NC is the ONLY WAY to go.\n\nOP, your family sucks, and you deserve FAR BETTER.",
      "created_utc": 1747330735.0,
      "score": 23
    },
    {
      "id": "mshkx8w",
      "body": "you don’t owe forgiveness  \nyou don’t owe closure  \nyou owe *yourself* protection from the people who tore your entire reality apart\n\nwhat he did wasn’t just betrayal  \nit was predatory  \nit was calculated  \nand no amount of “mistake” or counseling will rewrite that\n\nyou’re already doing the strongest thing—cutting him off, filing, choosing yourself  \nhold that line  \nbecause everything in the aftermath will try to wear you down: family guilt, apologies, pressure to “heal” too fast\n\nas for your sister—don’t rush a decision  \nshe’s 17  \nshe made a choice  \nbut he knew exactly what he was doing  \nyou can grieve both of them  \nyou don’t have to keep either one in your life\n\nburn it all to the ground if you have to  \nyou’ll build something cleaner from the ashes",
      "created_utc": 1747331981.0,
      "score": 12
    },
    {
      "id": "mshh9hx",
      "body": "You are doing great, sorry for your situation but yeah that is rough.",
      "created_utc": 1747330949.0,
      "score": 9
    },
    {
      "id": "mshv5pe",
      "body": "Only 2 weeks into the marriage? Discuss with a divorce lawyer what works best for you: annulment, or going for the throat and divorce on adultery charges and get that (money) bag. Be mercenary in the divorce. \n\nMake sure to lock down your financials, governmental stuff and any electronics or digital stuff you have. Change passwords, enable 2FA, disable fingerprint or facial recognition, sign out of everything on all devices after changing passwords.\n\nFor the rest? Be cold as ice. Sister may be groomed considering the age gap, but if texts show she was a willing (if naive) participant? She's dead to you. Niece or nephew is dead to you. Parents take her side? Grey rock and low contact, if not full no contact depending on your mental state and needs.\n\nAside from that: if hubby dearest is humping 17 y/o jailbait, he's humping other people. STI test incl. all the trimmings. Remember to schedule a follow up appointment a couple weeks later.",
      "created_utc": 1747335030.0,
      "score": 8
    },
    {
      "id": "msilwiv",
      "body": "I'm not sure what country you're in, but I remember learning in high school that while age of consent is 16 in the US, charges can still be filed for \"corruption of a minor\", and it only really goes within a three year gap to be considered legal with the age of consent (yes, this was explained in the sex-ed class because the teacher wanted us to be safe). Being that he is ten years older than the minor, this doesn't fall under \"age of consent\" laws, and your family can charge him for *corruption of a minor*. There may be other things he can be charged with, but that's a big one, and the most obvious. \n\nAlso look into getting her therapy. She seems to understand this is wrong and might blame herself for being prey to this predator. Try not to pressure her into doing anything with the child that she doesn't want to, though.",
      "created_utc": 1747342882.0,
      "score": 9
    },
    {
      "id": "msk51jn",
      "body": "I'm so sorry. That's messed up in all sorts of levels. You're doing the right thing.",
      "created_utc": 1747362252.0,
      "score": 4
    },
    {
      "id": "msk5igc",
      "body": "He should be in jail, 17 is a minor in any sane part of the world. This is absolutely wild. I'm so sorry this happened to you, but honestly your sister is a groomed victim here too. Your presumably soon to be ex husband is a pedo in my eyes, there's no excusing him at all.",
      "created_utc": 1747362427.0,
      "score": 3
    },
    {
      "id": "mskpcdf",
      "body": "Get that mess of a marriage annulled, and find a good therapist for yourself and your sister.",
      "created_utc": 1747370870.0,
      "score": 4
    },
    {
      "id": "mskqohy",
      "body": "You might be able to get an annulment. Save the evidence and consult a lawyer.",
      "created_utc": 1747371534.0,
      "score": 4
    },
    {
      "id": "msktvqk",
      "body": "your husband got a child pregnant. annullment, abortion, and therapy.",
      "created_utc": 1747373200.0,
      "score": 4
    },
    {
      "id": "mslg4yw",
      "body": "I recently read a similar post so I thought it was similar but apparently not. \n\nYou can go and make peace with that info, or have your revenge through the legal route which is kinda lengthy. If you’re petty, giving your partner that kind of stress for a very long time is worth it. in my country, you can apply this as a formal complaint and have your husband sent to jail. Our country has a lot of family laws and it mostly sides with women. Yes we can also send a man who knocked up a woman to jail if they refuse to pay child support. We can also file for qualified seduction (since your sister is the age of consent but still a minor). \n\nWhichever you feel is right is the right path OP.",
      "created_utc": 1747386575.0,
      "score": 4
    },
    {
      "id": "msmeizj",
      "body": "Lorena Bobbitt figured out how to deal with dudes like this js",
      "created_utc": 1747402069.0,
      "score": 4
    },
    {
      "id": "msmjjpo",
      "body": "Im so sorry this happened to you but I’m also relieved that you are going to divorce him and cut him out of your life. Nothing changes the fact that he is a predator and deserves to face consequences for his actions. You are so strong.",
      "created_utc": 1747403721.0,
      "score": 5
    },
    {
      "id": "msmwrzg",
      "body": "This man is a predator.",
      "created_utc": 1747407723.0,
      "score": 5
    },
    {
      "id": "msoljjf",
      "body": "100000% leave him. I’m honestly concerned with him still being around since he got your sister pregnant. I would probably have to cut them both off because the level of betrayal and sneakiness it took to do this behind your back is borderline unforgivable. Sorry this happened to you.",
      "created_utc": 1747425766.0,
      "score": 3
    },
    {
      "id": "msi1skg",
      "body": "Even if your sister has/had feelings for him, even if she was willingly participating, he's the one who should've set the boundaries, he's the one who should have acted like an adult, not to mention he's the one who should've had the utmost respect for your marriage, he definitely, absolutely took advantage of you both. Obviously it will take a lot for you to recover, and I know it's hard to see, but your sister has also been abused. Hope the best possible outcome for you and her.",
      "created_utc": 1747337007.0,
      "score": 6
    },
    {
      "id": "msjed3m",
      "body": "Why is the word affair in quotes. \n\nIt’s not an “affair,” it’s a full blown affair!",
      "created_utc": 1747352322.0,
      "score": 8
    },
    {
      "id": "msm68yr",
      "body": "Your sister is 17. Even thought that is legal where you are doesn’t mean it isn’t disgusting - she is a damn MINOR! Wtf!! \n\nDon’t blame your sister for this, she is a damn child and she was groomed and manipulated by your disgusting ADULT husband. Who knows how long this has been going on for. This poor girl. \n\nGlad you are getting divorced, but please don’t be mad at your sister. She is a victim here as well.",
      "created_utc": 1747399157.0,
      "score": 6
    },
    {
      "id": "mshipkx",
      "body": "Cut off your husband entirely, as for your sister. I think space is very much needed for some time.",
      "created_utc": 1747331358.0,
      "score": 7
    },
    {
      "id": "mshpoll",
      "body": "Ain't no way. I could not begin to comprehend this, let alone forgive this. I'm sorry. I'm so, so sorry. Your husband is a predator, and while I don't think your sister is at fault, I could not look at her the same.",
      "created_utc": 1747333386.0,
      "score": 8
    },
    {
      "id": "msht8mg",
      "body": "He got the best of you and your sister resulting in a niece or nephew for you.  You shouldn't feel sorry for them. Divorce and start your life new elsewhere. Cut them all off.",
      "created_utc": 1747334455.0,
      "score": 5
    },
    {
      "id": "msi3usq",
      "body": "Divorce might work in ops favor depending on state and laws..if its an at fault state. You get some financial backing.\n\nBut an annulment would be idea. Quicker. \n\nKick your brother and sister to the curb. She was aware. She knew actions have consequences. She knew she could've talked to you about it.  I hope they aren't expecting you to help cause its family. \n\nI love that your parents found out and told you instead of hiding it from you.",
      "created_utc": 1747337619.0,
      "score": 7
    },
    {
      "id": "msi8kl1",
      "body": "I couldn’t even deal with my sister if this happened to me. She is at fault too, I don’t care if she is 17.",
      "created_utc": 1747339013.0,
      "score": 6
    },
    {
      "id": "msib7m5",
      "body": "Don’t speak to your sister also.",
      "created_utc": 1747339791.0,
      "score": 6
    },
    {
      "id": "msjng08",
      "body": "i think, after you get over your (ex)husband, you will able to forgive your sister. i don’t blame you for being angry and feeling betrayed by both.\n\neta: oh gosh, you’ve only been married 2 weeks? how long has this been going with your sister? which means she could’ve been even younger when this started…",
      "created_utc": 1747355681.0,
      "score": 5
    },
    {
      "id": "mshrazq",
      "body": "Your sister was groomed by him. How long has this been going on? I hope your parents push for her to get an abortion. Good for you for getting a divorce.",
      "created_utc": 1747333871.0,
      "score": 3
    },
    {
      "id": "msht9cp",
      "body": "Can you get an annulment? You've only been married for two weeks.",
      "created_utc": 1747334462.0,
      "score": 3
    },
    {
      "id": "msi86xu",
      "body": "Eeeewwwww omg! He is super gross. This is… omg I’m so sorry. Like was it a one time thing or do u think grooming was involved?",
      "created_utc": 1747338902.0,
      "score": 3
    },
    {
      "id": "msibp2g",
      "body": "Ideally you need to get her family to agree to abort the baby or this man has access to your lives forever",
      "created_utc": 1747339932.0,
      "score": 3
    },
    {
      "id": "msieuce",
      "body": "Everyone involved is real young. I couldnt have imagined having these problems at that age.",
      "created_utc": 1747340833.0,
      "score": 3
    },
    {
      "id": "msijuk1",
      "body": "Disgusting predator.  I hope you can get the marriage annulled.  Your sister is about to learn some big life lessons.",
      "created_utc": 1747342279.0,
      "score": 3
    },
    {
      "id": "msixd6e",
      "body": "That sounds like a personal nightmare OP, i am so sorry. You let someone you thought you could trust around your family and he severely betrayed that and is a shitty, disgusting person. You and your sister need therapy, she is underage and just a child. As an older sister myself I’m extremely angry for you and hope you may both get through this. He however belongs in jail. At the very least cut him off and don’t let him disturb you and your family ever again.",
      "created_utc": 1747346402.0,
      "score": 3
    },
    {
      "id": "msj0rcf",
      "body": "Op I hope you're doing alright an ik it might be hard to deal with your sister but I have a feeling ur husband groomed her and should be reported :[\n\nBest of luck to you, are you gonna talk with her or cut everything off? By the sounds of it you dont blame her \n\nYour husband made a full concious choice, not a mistake, and he knew it was wrong in mutiple ways.",
      "created_utc": 1747347541.0,
      "score": 3
    },
    {
      "id": "msjlaxy",
      "body": "Why the fuck did he even marry you?? Jesus, I’m sorry. He’s a moron.",
      "created_utc": 1747354865.0,
      "score": 3
    },
    {
      "id": "msltno2",
      "body": "Apparently the age of consent is differently in other countries. Here (Belgium) age 17 can only consent to having s*x with people that are close in age, up to 4 or 5 years older I think. With a 27 year old would not be legal. \n\n16 year olds can consent with people up to 18 years. \n14 year olds up to 16.\n\n\nIt is possible that this isn't true but it is what I have been told for years.",
      "created_utc": 1747393960.0,
      "score": 3
    },
    {
      "id": "msm9mow",
      "body": "After your annulment, you need some space. Find somewhere to go, so you are not at ground zero dealing with this. No matter your feelings for this man, he isn’t, nor will he ever be, trustworthy.",
      "created_utc": 1747400383.0,
      "score": 3
    },
    {
      "id": "msmffng",
      "body": "I’m sorry you are going through this. He is 100% wrong and does not deserve anything from you not a chance in hell. \n\nIs your sister naive or is she showing signs of borderline personality disorder?  Is she jealous of you? I know 17 is young and he is a predator but she slept with your husband and no matter how old that person knows it’s wrong.  \n\nThankfully your parents are helping you.",
      "created_utc": 1747402375.0,
      "score": 3
    },
    {
      "id": "msmmeo5",
      "body": "I would try to get an annulment instead of a divorce. It might be easier.",
      "created_utc": 1747404622.0,
      "score": 3
    },
    {
      "id": "msq596e",
      "body": "OP- I’m so sorry you’re going through this. I hope you find healing from such betrayal.\nIt’s incredibly disturbing how many have commented that are ignorant as to how grooming works and how rape actually occurs in real scenarios such as this. \nI was groomed and raped by my father from the ages of 15-17 and the result was the conception of my son.\nTrial will start in about a month. I’m not going to lie, after reading a lot of the comments here I have extreme anxiety over it and what is going to be said to me.",
      "created_utc": 1747445756.0,
      "score": 3
    },
    {
      "id": "msrq7qv",
      "body": "everytime i come on reddit, i get more disgusted of men",
      "created_utc": 1747475557.0,
      "score": 3
    },
    {
      "id": "msio96r",
      "body": "She was groomed and that is disgusting that that’s the legal age of consent. A 17 year old is not old enough to consent to sec with an almost 30 year old man. That makes me wonder if he has a darker history to be honest. I’m sorry this happened to you as well, but I also feel for your sister to be manipulated into sex with a man that age and to get pregnant as well. That’s so many years of trauma for her and your entire family.",
      "created_utc": 1747343587.0,
      "score": 7
    },
    {
      "id": "mskykxn",
      "body": "This man is a predator. He groomed a teenager. That is disgusting behaviour. \n\nGood job getting a divorce. You might even be able to get an annulment. \n\nI’m so sorry this happened to you. Please get some therapy if you can afford it. \n\nI think, even though it will be really hard, you’ll need to come around to forgiving your sister. She’s still a minor. She was groomed and manipulated. She’ll regret this forever. \n\nIt might be worthwhile looking into the actual laws though. In a lot of places the first few years after the age of consent have an age limit on them. For example, sex with a 16 or 17 year old is legal if the sexual partner is X years older than them but not if they are older than that. \n\nBest of luck.",
      "created_utc": 1747375795.0,
      "score": 6
    },
    {
      "id": "mshgegk",
      "body": "Sis was playing adult games. Adult consequences. Dump them. You really want to baby sit the affair baby?",
      "created_utc": 1747330705.0,
      "score": 26
    },
    {
      "id": "mshiwol",
      "body": "Uh…. That’s statutory rape. Report him. Block your sister.",
      "created_utc": 1747331413.0,
      "score": 10
    },
    {
      "id": "mshgx7y",
      "body": "Your husband is disgustingly. Why are you even entertaining the idea of a future with him? If you have kids with him, those kids will have a sibling who is also a cousin. That’s disgusting",
      "created_utc": 1747330853.0,
      "score": 5
    },
    {
      "id": "msj9u5s",
      "body": "These replies kind of suck.  If she slept with your boyfriend and all of you were 17, everyone would say to never speak to her again.  The fact of the matter is, betraying your sister is a different choice entirely from being groomed.  She may have been groomed into thinking an age gap relationship is okay and may be legitimately too naive to know the hazards.  But you can’t say the same for the decision to fuck her sister’s partner.  Everyone knows that is wrong. \n\nMaybe with some time and some real growth and reflection from her you could come to forgive her, but you’d be well within your rights to cut her off.  \n\nAs for your husband- he is an irredeemable piece of shit",
      "created_utc": 1747350742.0,
      "score": 4
    },
    {
      "id": "mshmmmb",
      "body": "She was groomed, starting surely after they met, you and her need therapy. Your now ex is a disgusting pedo",
      "created_utc": 1747332479.0,
      "score": 2
    },
    {
      "id": "msho9nr",
      "body": "You could probably get the marriage annulled, as opposed to going through a divorce, if he's been unfaithful to you since before the wedding.",
      "created_utc": 1747332967.0,
      "score": 2
    },
    {
      "id": "msi1i14",
      "body": "I'd say this was grounds for an annulment instead of a divorce. Either way, get a lawyer to go over the options.",
      "created_utc": 1747336921.0,
      "score": 2
    },
    {
      "id": "msi6rcu",
      "body": "I have no words for this. Go ahead and divorce him. Hoping that your parents are on your side!",
      "created_utc": 1747338483.0,
      "score": 2
    },
    {
      "id": "msi7reg",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1747338775.0,
      "score": 2
    },
    {
      "id": "msiaanp",
      "body": "Is your sister planning to keep the baby? And are your parents going to support her during pregnancy and be grandparents. \n\nI’m so sorry OP. Stay strong.",
      "created_utc": 1747339520.0,
      "score": 2
    },
    {
      "id": "msimjjx",
      "body": "JFC. That’s horrific, I’m so very sorry. Despicable betrayal.",
      "created_utc": 1747343075.0,
      "score": 2
    },
    {
      "id": "msk8eti",
      "body": "The hardest thing will be for you to ever trust a man again.",
      "created_utc": 1747363529.0,
      "score": 2
    },
    {
      "id": "mskl17o",
      "body": "you should be able to get an annulment !Good luck with everything .",
      "created_utc": 1747368819.0,
      "score": 2
    },
    {
      "id": "mslkjzw",
      "body": "Sounds like your sister needs alot of counseling but I’d personally have a hard time ever acknowledging her existence if I was in your position.\nThis really sucks and I wish you all the best.",
      "created_utc": 1747389262.0,
      "score": 2
    },
    {
      "id": "msllsdy",
      "body": "He has major issues.",
      "created_utc": 1747389965.0,
      "score": 2
    },
    {
      "id": "msn9yq2",
      "body": "oh my god. i’m so sorry if this is true",
      "created_utc": 1747411547.0,
      "score": 2
    },
    {
      "id": "mspcx18",
      "body": "Omg I hope she doesn’t keep it 😭",
      "created_utc": 1747434522.0,
      "score": 2
    },
    {
      "id": "mspdgfw",
      "body": "Divorce annulment shmulment. There’s another option that’s also a type of spider. Are your parents healthy? Are they expected to live another 20 years?  Anyone in the family close and need a friend for the journey?",
      "created_utc": 1747434712.0,
      "score": 2
    },
    {
      "id": "mspjoe5",
      "body": "I wouldn’t care if my 17-year-old sister, niece cousin or whatever got him , got naked and gave him my husband a lap dance I would give him the lead cure. I would expect the same consideration if I lost my mind and became a pedophile.  Competent me would want that version of me dead: thanks for your help.  And I’m pretty damn sure who I’m married so this will never happen, but if it did the version of him without the parasite or maggot or whatever making him act like that would want me to kill it.",
      "created_utc": 1747437602.0,
      "score": 2
    },
    {
      "id": "msrrk50",
      "body": "I’m sorry you are going through this, I hope you can find the right way and things to do. \nI would recommend therapy, talking to someone helped me out in a similar situation. Find new hobbies you can do that will take you’re mind off both of them.  \n\nHonestly. If you’re husband is the father I would re consider the contact with you’re sister. He will always be around and it will be much harder for you to heal and move on. Like you said she was 17 and legal age of consent so she knew exactly want she was doing and who with. \nIt will take time but you will heal. It’s taken me a while to heal from my love trauma but I’m nearly there and ready for a new love. It gets better. But for now I do recommend you give you’re self space. I wish you the best in you’re healing journey.",
      "created_utc": 1747476398.0,
      "score": 2
    },
    {
      "id": "msuski6",
      "body": "How long was he in your sisters live? Grooming should be a huge concern here. He is a predator. \nGet an annulment if at all possible. This should be erased from the records instead of a divorce.",
      "created_utc": 1747516361.0,
      "score": 2
    },
    {
      "id": "msvp3vf",
      "body": "Please God. Let's this be AI",
      "created_utc": 1747528245.0,
      "score": 2
    },
    {
      "id": "mswwyyv",
      "body": "your husband is a creep, i’m so sorry OP",
      "created_utc": 1747548411.0,
      "score": 2
    },
    {
      "id": "msi2n55",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1747337259.0,
      "score": 3
    },
    {
      "id": "mshvj2d",
      "body": "   First, get out of the marriage quickly and safely. You may even be able to obtain an annulment if not just get a divorce. But the first step is to remove yourself from the situation. If your husband is willing to sleep with your minor sister, who knows what else he is capable of doing? Treat him like the stranger that actually he is. \n   Your husband has probably been sleeping with your sister for quite a while. Although possible, I doubt she got pregnant the first time she had sex with him. He probably not only groomed your sister, but he also probably you and your parents. \n   Although your sister is also a victim, you are entitled to feel frustrated by the situation. None of this is your fault. Keep your head up high and don’t allow anyone to pull you down while you are working through this difficult situation.",
      "created_utc": 1747335141.0,
      "score": 2
    },
    {
      "id": "msn7mj7",
      "body": "I'm a big advocate for victims of paedophilia and this is obviously one of those situations. However looking back at when I was teenager I could not for the life of me be manipulated or groomed into having an affair with my siblings husband. So in that situation the only way I could justify it was if he was physically SAing her without her consent and that's why she didn't speak up. I think in this situation you need to cut her off for a few years and your family will need to send her to therapy and have her try to reconnect with you after a long break from eachother. Bc if this situation was actually mutual on your sister and husbands end despite the fact she was groomed you definitely need time apart. The most important thing though is you acknowledge she is a child and she was groomed but due to circumstances you just can't forgive her like that. Your victim in this too and you deserve to heal from this too.",
      "created_utc": 1747410862.0,
      "score": 2
    },
    {
      "id": "msnm1r6",
      "body": "your sister is basically a child and was groomed by your STBX. She did you wrong but she's also a victim in this, I'm not saying to just forgive and forget, just that compassion can help her heal from the damages he did to her psyche.",
      "created_utc": 1747415074.0,
      "score": 2
    },
    {
      "id": "mskd5hc",
      "body": "Few things:\n\n1. As others have said get an annulment. \n\n2. Your sister is not a \"baby\", don't infantilize someone who's capable of having a child. She knew he was your husband and she knew they didn't use protection and you know damn well she knew this was wrong and chose not to say anything. That doesn't mean there wasn't some grooming/rape potentially involved (the messages would be a good indication here), but if there isn't you should be fucking livid at her too. She's not sorry she did it... she's sorry she got caught and has to face the concequences.\n\n3. This is precisely what abortions were made for. I'm normally all for the \"she needs to deal with the consequences of her actions\" method, but don't bring an actual baby into this situation, it's not fair on them. It gives your sister a second chance at a life too rather than subjecting her to what will (statistically speaking) likely be a life of poverty and struggle. Just make sure she learns from it. And get her in therapy ASAP.",
      "created_utc": 1747365405.0,
      "score": 4
    },
    {
      "id": "mshwp57",
      "body": "That’s awful. They both have revealed their characters to you. I’m so sorry.",
      "created_utc": 1747335487.0,
      "score": 2
    },
    {
      "id": "mshofcd",
      "body": "Even if the age of consent is 17: that is still a child. Old enough to probably know better that this was wrong but definitely did not end up in this situation on her own. If you have access to them, I would try to pull up any kind of text records between the two and see how far back this goes. Unless this started extremely recently, it sounds like a situation of grooming.\n\nAnd if you get any kind of evidence indicating this all happened before it was legal: I’d go full scorched earth and take his ass down and make him pay. For not only your sister but for you. People like him do not do this more than once, it’s a repetitive behavior and if he can’t have access to you and your sister anymore, he’ll do it to someone else.",
      "created_utc": 1747333014.0,
      "score": 2
    },
    {
      "id": "mshy8sg",
      "body": "I’m sorry you’re going through this. \n\nYour sister is of consent age, but still very young.  \n\nIMO - your (ex)-husband knew what he was doing and manipulated your sister. \n\nHe’s definitely only “sorry” because he was found out. I truly believe this would’ve gone on had he not been exposed.  \n\nYour (ex)-husband knew exactly what he was doing. \n\nI know you are hurting but you may consider standing by your sister during this time. \n\nShe’s a victim too.\n\nGood luck.",
      "created_utc": 1747335957.0,
      "score": 3
    },
    {
      "id": "msiik4s",
      "body": "Annul the marriage!\n\nGet your sister into counseling.\n\nThat’s not an affair, that child molestation.\n\nGod only knows how long he’s been grooming her, likely as long as you’ve known him.\n\nShe’s a victim here too and he didn’t even use a condom or give her plan B!!!\n\nHe deliberately ruined her life hoping you all would throw her out so he can capture her.\n\nHe’s a monster!",
      "created_utc": 1747341905.0,
      "score": 2
    },
    {
      "id": "mshot9q",
      "body": "Your ex is disgusting ",
      "created_utc": 1747333129.0,
      "score": 2
    },
    {
      "id": "mshpg3w",
      "body": "It might have started long before she was 17 which would make him a pedo.  In that case he should be charged.",
      "created_utc": 1747333316.0,
      "score": 2
    },
    {
      "id": "mshpqhl",
      "body": "How long has she known him??? Grooming could have happened early on. As a teen who was molested I know how hard it is to be manipulated or to stand up for myself. She is a child and it’s hard to blame a child for any part in this. But it still would damage my relationship, especially if she is gunna have the baby.",
      "created_utc": 1747333402.0,
      "score": 2
    },
    {
      "id": "mshujup",
      "body": "Your husband is a pervert, definitely divorce him. \n\nThat said, I’d take a break from your sister for the time being. Maybe he groomed her or maybe she was a fully willing participant. Either way, I’d make a point that she needs to get therapy before re-engaging with her. I mean, is she keeping the baby? How is that relationship going to work? I also think you need to get therapy for yourself because this whole situation is traumatic",
      "created_utc": 1747334850.0,
      "score": 2
    },
    {
      "id": "mshv5vp",
      "body": "Get an annulment!",
      "created_utc": 1747335032.0,
      "score": 2
    },
    {
      "id": "msitqb1",
      "body": "Babe this sounds like grooming and your husband is pedo",
      "created_utc": 1747345245.0,
      "score": 2
    },
    {
      "id": "msiwzwc",
      "body": "You need to find out exactly when this began, and possibly follow up with law according to the evidence. I truly hope she is not keeping this child. I'm sorry for both of you.",
      "created_utc": 1747346282.0,
      "score": 2
    },
    {
      "id": "msj4e4t",
      "body": "Get marriage annulled",
      "created_utc": 1747348811.0,
      "score": 2
    },
    {
      "id": "msja1p8",
      "body": "Ewww some one call the police he could be charged for that",
      "created_utc": 1747350814.0,
      "score": 2
    },
    {
      "id": "msjl9r1",
      "body": "Just because 17 is the legal age of consent doesn’t mean she’s not a minor??? What the fuck lol",
      "created_utc": 1747354852.0,
      "score": 2
    },
    {
      "id": "msjpiph",
      "body": "Even if it’s the legal age of consent, in some states that’s still statutory rape if there’s a 5 year difference and one is under 18.",
      "created_utc": 1747356462.0,
      "score": 2
    },
    {
      "id": "msjr4i7",
      "body": "Yikes, in my country 17 is still a minor.",
      "created_utc": 1747357069.0,
      "score": 2
    },
    {
      "id": "mskyrre",
      "body": "NTA. Divorce and tell everyone in his life including his job that he got your 17 year old child sister pregnant. Everyone deserves to know. Let all your sisters friends & class mates know. She was groomed but she knew she was wrong.",
      "created_utc": 1747375902.0,
      "score": 2
    },
    {
      "id": "msm1xrk",
      "body": "Why is affair in “”? \n\nRun! From both of them.",
      "created_utc": 1747397497.0,
      "score": 2
    },
    {
      "id": "msmj01f",
      "body": "I would annul the marriage immediately.  \n\nYour sister is old enough to now that sleeping with her sister’s fiancé is wrong.  At the same time, she is young enough to be manipulated by an older man.  I know I couldn’t be in my sister’s life if she had my husband’s baby.  That is just too painful.\n\nLook into counseling for yourself.",
      "created_utc": 1747403546.0,
      "score": 2
    },
    {
      "id": "mspc8vm",
      "body": "Do you have kids?  Are you in a death penalty state? What kind of life insurance does he have?  Have an idea",
      "created_utc": 1747434287.0,
      "score": 2
    },
    {
      "id": "msqg1dg",
      "body": "That’s not just betrayal it’s the kind that makes your chest cave in.\n\nWhen it’s the person you built a life with and someone from your own bloodline, it doesn’t just break your heart it shakes your sense of reality. You probably question everything: your past, your instincts, even your worth. And honestly? That’s completely human.",
      "created_utc": 1747449932.0,
      "score": 2
    },
    {
      "id": "msia44l",
      "body": "I would be questioning when this started. Your sister is a victim and was most likely groomed by him. Honestly she should prob abort and your ex be cut off by everyone. If she keeps the baby he will be in her life forever.",
      "created_utc": 1747339468.0,
      "score": 2
    },
    {
      "id": "msk83mm",
      "body": "[deleted]",
      "created_utc": 1747363409.0,
      "score": 3
    },
    {
      "id": "mslokj2",
      "body": "Baby throw the whole family away",
      "created_utc": 1747391489.0,
      "score": 2
    },
    {
      "id": "mshxygi",
      "body": "She was GROOMED. I seriously hate to say this but honestly he may have been ~more interested in you because of her (if it is the case).\n\nYou have a right not to forgive anyone but if you were to forgive anyone I think your sister is the only one who you could forgive. \nGive her time to be unbrainwashed, give yourself time to recover and heal.",
      "created_utc": 1747335869.0,
      "score": 2
    },
    {
      "id": "msi55td",
      "body": "Commenting to come back for updates",
      "created_utc": 1747338011.0,
      "score": 1
    },
    {
      "id": "msibww8",
      "body": "Yeah no if her parents can still put a monitoring app on her phone omg...your to be ex husband is a creep. ",
      "created_utc": 1747339996.0,
      "score": 1
    },
    {
      "id": "msie0wa",
      "body": "I guess I can't use the bot, so this is my return for information comment.",
      "created_utc": 1747340600.0,
      "score": 1
    },
    {
      "id": "msiginp",
      "body": "Eww what a groomer..",
      "created_utc": 1747341314.0,
      "score": 1
    },
    {
      "id": "msijlxv",
      "body": "Damn",
      "created_utc": 1747342209.0,
      "score": 1
    },
    {
      "id": "msijvv5",
      "body": "17?! Your husband (hopefully ex soon) is sick! However, I understand your frustration and pain.",
      "created_utc": 1747342290.0,
      "score": 1
    },
    {
      "id": "msiuviu",
      "body": "Legal doesn’t mean moral! Annulment and sue for damages.",
      "created_utc": 1747345604.0,
      "score": 1
    },
    {
      "id": "msjp6f7",
      "body": "Wow. I’m so sorry for you. What is wrong with these people, both of them?!!! Remember it’s not your fault. You’ve been lied to. I hope you get a divorce right away. This is so sad.  and also your parents monitoring their teen daughter’s phone? Something is very wrong here.",
      "created_utc": 1747356334.0,
      "score": 1
    },
    {
      "id": "mskx0g2",
      "body": "Is she keeping the pregnancy? I'm so sorry. I agree with divorce.",
      "created_utc": 1747374915.0,
      "score": 1
    },
    {
      "id": "msl1ya1",
      "body": "Yes, try and annulment first",
      "created_utc": 1747377739.0,
      "score": 1
    },
    {
      "id": "msl23w8",
      "body": "What the actual fuckk…",
      "created_utc": 1747377831.0,
      "score": 1
    },
    {
      "id": "msm77uy",
      "body": "Annulment if you can. Wipe your slate clean of this man.",
      "created_utc": 1747399514.0,
      "score": 1
    },
    {
      "id": "msmjhpi",
      "body": "My heart aches for you",
      "created_utc": 1747403703.0,
      "score": 1
    },
    {
      "id": "mspdwny",
      "body": "I would have to help him get to where he’s going.  I could not live with thinking I brought this thing around my sister.  It’s not technically a “crime” and he will forever have access to my niece or nephew.  If brought you in this family then I’m gonna escort you to your next destination.",
      "created_utc": 1747434869.0,
      "score": 1
    },
    {
      "id": "mspmer6",
      "body": "Pretty sure legal age of consent is only legal if the age difference is a couple years. Charges should be filled. \n\nWasn't that something about Romeo and Juliet law or something?",
      "created_utc": 1747438609.0,
      "score": 1
    },
    {
      "id": "mspqx0x",
      "body": "I am not sure I could forgive her.",
      "created_utc": 1747440285.0,
      "score": 1
    },
    {
      "id": "mspuvnn",
      "body": "Your husband groomed her.",
      "created_utc": 1747441782.0,
      "score": 1
    },
    {
      "id": "mspyqsy",
      "body": "\"a mistake\" will always make me laugh\n\nMorons.",
      "created_utc": 1747443243.0,
      "score": 1
    },
    {
      "id": "msqwcjx",
      "body": "Where's the update? Somewhere in the comments?  \n\nI hope she checked for grooming because with a teenager it's always grooming.",
      "created_utc": 1747457470.0,
      "score": 1
    },
    {
      "id": "mst4j5r",
      "body": "Wow that’s crazy 😭",
      "created_utc": 1747496671.0,
      "score": 1
    },
    {
      "id": "msus47i",
      "body": "I'm so sorry you’re going through this. What your husband did is a massive betrayal—not just to your marriage, but to your family and your trust. It’s beyond inappropriate, and your instincts to stand firm on divorce are more than valid.\n\nIt’s also completely understandable to feel torn about your sister. She’s still very young, and while what she did was deeply wrong, it’s clear she’s not emotionally mature enough to grasp the full weight of what’s happened. That doesn’t excuse it, but it might help explain some of it.\n\nYou're showing a lot of strength by standing your ground and putting your well-being first. No one deserves this kind of pain, especially so early in a marriage. Please take care of yourself and don’t be afraid to lean on support systems—friends, family, therapy—anything that helps you heal.\n\nWhatever you decide regarding your sister, give yourself grace. You don’t have to have all the answers right now.",
      "created_utc": 1747516205.0,
      "score": 1
    },
    {
      "id": "msz4e87",
      "body": "This is devastating. I'm so sorry for you and your family. That man is a walking disease.",
      "created_utc": 1747585212.0,
      "score": 1
    },
    {
      "id": "mt0bfmx",
      "body": "When you would think that men can't get any lower. Your husband comes along and sleeps with your underage sister and gets her pregnant. How painful and traumatic. \n\nI hope you can face this and move on. Be strong and distance yourself from him and your sister.",
      "created_utc": 1747598853.0,
      "score": 1
    },
    {
      "id": "mt6e51o",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1747684197.0,
      "score": 1
    },
    {
      "id": "mtcqflv",
      "body": "Please stick to your guns, metaphorically speaking lol",
      "created_utc": 1747771104.0,
      "score": 1
    },
    {
      "id": "mteslgo",
      "body": "Sorry to hear this OP. I hope your soon to he ex-husband rots in hell.\n\nAnd as for your sister, nung 17 ako, yes I was immature but I know what I was doing, and kung mahal ko yung kapatid ko, di ako makikisiping sa asawa nya. \n\nSister is forgivable depende sa details, maybe she was manipulated by the husband. We don't really know.\n\nPero one thing for sure OP, Please take your time. Para magalit, malungkot, or both. Take as much time as you need.",
      "created_utc": 1747795977.0,
      "score": 1
    },
    {
      "id": "mthvhze",
      "body": "How was it?",
      "created_utc": 1747844168.0,
      "score": 1
    },
    {
      "id": "mtjxo2p",
      "body": "Gosh. Im sorry to hear this. Terrible.",
      "created_utc": 1747865471.0,
      "score": 1
    },
    {
      "id": "mtksliw",
      "body": "File for annulment and divorce, I am so sorry. this is horrible.",
      "created_utc": 1747876040.0,
      "score": 1
    },
    {
      "id": "mtm6jqc",
      "body": "The term men are dogs squarely applies here .. we tend to sniff and lay anything that’s easily available by nature and we only regret when we release it’s not worth hurting the ones we love … best way is you decide knowing that the fucker can be unpredictable and is too young to resist temptations and probably you can do better by getting someone with a lot of respect for you",
      "created_utc": 1747897599.0,
      "score": 1
    },
    {
      "id": "mty3i7a",
      "body": "What is going on with all the invisible comments?",
      "created_utc": 1748054400.0,
      "score": 1
    },
    {
      "id": "mub5cfa",
      "body": "In my country it can still lead to chriminal charges because of power imbalance and familial closeness for your husband. He is in fact a pervert.",
      "created_utc": 1748247064.0,
      "score": 1
    },
    {
      "id": "msivj18",
      "body": "You have every right to be angry at your sister. You have every right to cut contact with her. I’d just remind you that she, too, is a victim in all this. She’s 17, and while she’s able to legally consent, she was also likely groomed by your ex. \n\nAbsolutely file for divorce, or an annulment. Find a lawyer to best direct you to the best option for you. Also, take time for yourself. You don’t need to make big decisions right now (aside from detaching from your ex). You should also look into therapy to help you through this betrayal.",
      "created_utc": 1747345812.0,
      "score": 2
    },
    {
      "id": "msl5ijn",
      "body": "I don't think I could forgive my sister. Every time you see her you'll be reminded that it's your ex-husbands kid that she's carrying, that your sister and ex destroyed you, and your dreams. I'd move far away and choose a new family, and new parents. They are going to coddle your sister, and welcome your ex when he picks the kid up, unless, God forbid, they end up getting married for \"the baby.\"\n\nYou didn't deserve this betrayal. I'm really sorry you're going through this.",
      "created_utc": 1747379882.0,
      "score": 1
    },
    {
      "id": "mshwrkb",
      "body": "I am so sorry to hear that. Get an annulment. \n\nYour sister was probably groomed. Consider whether you want to keep the baby.",
      "created_utc": 1747335507.0,
      "score": 1
    },
    {
      "id": "msj2j1f",
      "body": "Pfff, that is really bad. What an absolute coward and piece of garbage he is. Annul the marriage as fast as you can. Try to get the full story of your sister: this is too awful but would be much worse if this causes a break between you and your sister. With this much age difference and her being 17 I would fully put the blame on him.",
      "created_utc": 1747348149.0,
      "score": 1
    },
    {
      "id": "msk49xo",
      "body": "Your sister was prey for your pedo-soon to be ex husband. She is 17 years old. Forgive her for her part in the whole ordeal because she is a CHILD who was groomed. Treasure your relationship with her and completely get away from that man. \nAnd I pray there is something legally that can be done to him now that she is pregnant. I hope he won’t have access to that baby and that your poor sister never has to talk to him again. He should be in prison.",
      "created_utc": 1747361961.0,
      "score": 1
    },
    {
      "id": "mskz6gs",
      "body": "Annulment, or divorce and get everything. \n\nHim impregnating your sister is obvious signs of infidelity and you deserve a loyal partner and spouse, and your sister broke the silent rule of sisters before misters, so she killed the sisterly bond. \n\nIf you’re feeling really petty, name and shame them to everyone in your shared social circles, hell even show evidence of their dirty little fling. Reveal it to your family, yours, your sister’s and his friends, colleagues of your sister and husband, and whoever else your husband and sister are seeing.",
      "created_utc": 1747376133.0,
      "score": 1
    },
    {
      "id": "mshoa3k",
      "body": "Dang. If I was your father I would be going back a little farther in time and see when this started. \n\nI would also advise you to look back and think about this as an adult and it not being your husband and your sister and what you would say if this was someone else's family. Of course what the sister did is horrible. But this could be something that she didn't even know she had no control over.\n\n  \nStand up for yourself. Find out all the facts and then if your sister needs an advocate you should do the right thing. IF this started years ago, she has not been a willing participant and should be treated accordingly.",
      "created_utc": 1747332971.0,
      "score": 1
    },
    {
      "id": "mshq4zb",
      "body": "Also if there is ANY proof that there were relations prior to 17 then PLEASE report him to the police. Any type of solicitation or physical contact. Even if she sent him photos or vice versa. Then you can both get some justice for what he did.",
      "created_utc": 1747333521.0,
      "score": 1
    },
    {
      "id": "mshy0e2",
      "body": "Try to get an annulment, and as for your sister, is it possible she was groomed by your husband? Like yes you can get pregnant after the 1st time but what if it wasnt.... and there are so many 'what if' in my mind so im so sorry idk how yall feel. If you're able to get proof or video your sister saying if it was sooner than 17 (17 is still bad  I dont care of its legal, your husband is a grown man with his own wife to take care of...wtf is he doing with a child?) Im so sorry for all of yall",
      "created_utc": 1747335886.0,
      "score": 1
    },
    {
      "id": "msi5nsy",
      "body": "Wait, so you are two weeks married and she is one month pregnant? Pregnancy is counted from the start of you period, around two weeks later is your fertile window. This means she conceived around the time of your wedding? This is some sick shit OP. Get you marriage annulled and move to some place far away",
      "created_utc": 1747338157.0,
      "score": 1
    },
    {
      "id": "msiz00w",
      "body": "He is a predator. When did this start, before the age of consent in your state?",
      "created_utc": 1747346946.0,
      "score": 1
    },
    {
      "id": "msjgl31",
      "body": "Ditch the bum. I hope you can reconcile with your sister. She’s a kid. He’s a creep.",
      "created_utc": 1747353111.0,
      "score": 1
    },
    {
      "id": "msjo56b",
      "body": "Your husband is a predator. She’s not an adult I don’t care about the “legal age of consent” he’s a sicko.",
      "created_utc": 1747355943.0,
      "score": 1
    },
    {
      "id": "msn4lhn",
      "body": "Go scorched earth on his ass. The sister was preyed upon so give her some grace, but keep at arms length. The man tho, destroy.",
      "created_utc": 1747409990.0,
      "score": 1
    },
    {
      "id": "msm5vco",
      "body": "I don’t disagree at all with what you’re saying, and she should 100% file for annulment. I just wanted to point out something about the dates. It’s tricky to say for sure she was pregnant before the wedding. If she’s 1 month pregnant, that means the first two weeks of her pregnancy were before conceiving, then she would have ovulated and conceived (around the wedding), and she has been pregnant for 2 weeks in terms of having a live embryo inside her. I know it sounds ridiculous, but I’ve had two kids and both times it confused me how the first 2 out of 40 weeks of pregnancy are before conception. \n\nHowever, this also means he cheated within a couple days of the wedding. Gross.",
      "created_utc": 1747399018.0,
      "score": 269
    },
    {
      "id": "msod5fq",
      "body": "What difference will an annulment mean rather than a divorce?",
      "created_utc": 1747423178.0,
      "score": 47
    },
    {
      "id": "mspjih6",
      "body": "This. Get out legally if at all possible and have you filed the license yet because if not hold that bad boy. Yikes.",
      "created_utc": 1747437542.0,
      "score": 4
    },
    {
      "id": "mshsz7k",
      "body": "This right here OP. Try to get an annulment vs a divorce.",
      "created_utc": 1747334376.0,
      "score": 2734
    },
    {
      "id": "msicl3y",
      "body": "This!  Most divorce lawyers have a free consultation.  Call up several and find out about an annulment.",
      "created_utc": 1747340190.0,
      "score": 598
    },
    {
      "id": "msj2k8p",
      "body": "Tacking on here to say there is usually a very short timeline for an annulment so don't wait OP!!",
      "created_utc": 1747348160.0,
      "score": 29
    },
    {
      "id": "msk791x",
      "body": "For sure they can. This is crazy. I understand 17 might be the age of consent but like…. How?",
      "created_utc": 1747363079.0,
      "score": 20
    },
    {
      "id": "msn0z2n",
      "body": "Annulment? At this point, I’d be filing for an exorcism. Dude’s clearly possessed by audacity.",
      "created_utc": 1747408943.0,
      "score": 23
    },
    {
      "id": "mshug5p",
      "body": "Came here to ask this!?",
      "created_utc": 1747334819.0,
      "score": 89
    },
    {
      "id": "msibzw6",
      "body": "It’s extremely unlikely she would qualify for an annulment. Infidelity is cause for divorce, not annulment.  \n\nThe only alternative is if they haven’t filed their marriage certificate with the court yet - She could shred it instead and it will be like it never happened if there aren’t other copies.",
      "created_utc": 1747340019.0,
      "score": 297
    },
    {
      "id": "msiksvt",
      "body": "He's a pedo and a predator. He needs to go. Stay close to your family, and try to work things out with your sister. There's no need to break up your family for some dirtbag. You deserve so much better than him. Best of luck!",
      "created_utc": 1747342556.0,
      "score": 191
    },
    {
      "id": "mskddlt",
      "body": "Especially if he started sleeping with her before the wedding, she can claim fraud as an excuse for annulment.",
      "created_utc": 1747365498.0,
      "score": 13
    },
    {
      "id": "mshkkmt",
      "body": "YES. Get the hell out of dodge before your family guilt you into being okay with your sister and this baby. \n\nGet out and create a new life fo yourself somewhere else, if you can afford it. Best of luck Xx",
      "created_utc": 1747331882.0,
      "score": 1000
    },
    {
      "id": "mshntgf",
      "body": "Could be that he got together with you so he could get to her. Someone need to look at his devices in case he has CSAM. I'm so sorry you're going through this, OP.",
      "created_utc": 1747332832.0,
      "score": 449
    },
    {
      "id": "msj6o74",
      "body": "I'm glad to see this comment. There's a massive power imbalance here, and I wouldn't be surprised if this started before the sister turned 17.",
      "created_utc": 1747349626.0,
      "score": 135
    },
    {
      "id": "mskqm4c",
      "body": "Was going to say the same. I still wouldn't blame OP for distancing herself from her sister though but her parents need to take her to therapy. BRUH",
      "created_utc": 1747371500.0,
      "score": 33
    },
    {
      "id": "msjrgvv",
      "body": "And keep access to the kid",
      "created_utc": 1747357198.0,
      "score": 39
    },
    {
      "id": "mshvuks",
      "body": "And I wonder if this is the first time— he decided to keep it close to make his lover available. Omg\nOP I am so sorry for this. How utterly devastating.",
      "created_utc": 1747335237.0,
      "score": 232
    },
    {
      "id": "msjvezd",
      "body": "I’m also curious if this started before she was 17. He’s a predator and I want there to be a chance of accountability",
      "created_utc": 1747358675.0,
      "score": 42
    },
    {
      "id": "mspl5n4",
      "body": "Genuinely asking, how were you groomed into it if you didn't want it?\n\nIsn't the entirety of grooming that the lesser is being manipulated (unbeknownst to them) into agreeing, wanting, and validating whatever is happening? Essentially gaslighting",
      "created_utc": 1747438149.0,
      "score": 1
    },
    {
      "id": "mshhps2",
      "body": "I don’t know yet. On one hand she knew she was doing something wrong, but on the other she’s just a kid. I don’t know how to feel or what to do.",
      "created_utc": 1747331076.0,
      "score": 591
    },
    {
      "id": "msjnu72",
      "body": "He deserves it, or prison. Prison if the \"relations\" started before she was 17.",
      "created_utc": 1747355828.0,
      "score": 19
    },
    {
      "id": "mshjytf",
      "body": "He’s known her since we started dating, so about two years. She was just 15. I’m sick to my stomach thinking about how long this may have been going on.",
      "created_utc": 1747331711.0,
      "score": 426
    },
    {
      "id": "mshjvku",
      "body": "Well, unless they were married within a year of meeting, then probably AT LEAST two years.  Regardless, she was definitely under age either way.  \nThe sister was 100% manipulated/ groomed by the husband and this will ruin her life even if she decides not to keep the baby.",
      "created_utc": 1747331686.0,
      "score": 33
    },
    {
      "id": "msi7qfl",
      "body": "I have an older sister I actively dislike and still, I would never. Gross.",
      "created_utc": 1747338767.0,
      "score": 18
    },
    {
      "id": "mshk9ne",
      "body": "A 17 year old is still a kid",
      "created_utc": 1747331796.0,
      "score": 29
    },
    {
      "id": "msnq8ub",
      "body": "The 17 y/o doesn’t “hate” the older sister, *she was groomed, so she probably mistakenly believed she was “in love with” this predator.*",
      "created_utc": 1747416300.0,
      "score": 3
    },
    {
      "id": "mshh741",
      "body": "The thing we don’t know is how long ex has been in the family’s life. Let’s say they dated for 3 years and he was around… that could put sister at like 14 y/o. We don’t know if he threatened her. Doesn’t make it right, doesn’t mean OP has to do anything, but I have a feeling that this may have many layers. I bet this guy had dirt on sister and made her scared she’d lose her sister forever if she told anyone. This is horrifying for everyone.",
      "created_utc": 1747330931.0,
      "score": 73
    },
    {
      "id": "mskt1gh",
      "body": "Nah she was groomed for sure. From age 15.",
      "created_utc": 1747372755.0,
      "score": 3
    },
    {
      "id": "mslt198",
      "body": "I mean if she was groomed it kind of does mean she wasn't able to think for herself. Theres a massive power imbalance here, and she was preyed upon using emotional and psychological manipulation in order to sexually abuse her. People who are being abused often don't think rationally (i.e. average number of attempts before successfully leaving an abusive relationship is 7), let alone a literal child in this situation.",
      "created_utc": 1747393671.0,
      "score": 2
    },
    {
      "id": "msou2z5",
      "body": "the sister may have been groomed but that’s still her SISTERS husband after all so she’s not fully innocent and the sister has every right to be mad or even cut contact",
      "created_utc": 1747428362.0,
      "score": 6
    },
    {
      "id": "msjpvh5",
      "body": "op said 2 years",
      "created_utc": 1747356596.0,
      "score": 3
    },
    {
      "id": "msjpt5q",
      "body": "2 years.",
      "created_utc": 1747356572.0,
      "score": 9
    },
    {
      "id": "mskgwh3",
      "body": "OP said the husband knew the sister since she was 15, very possible this was going on for years",
      "created_utc": 1747366977.0,
      "score": 4
    },
    {
      "id": "msi88q4",
      "body": "They see an easy target.",
      "created_utc": 1747338917.0,
      "score": 12
    },
    {
      "id": "msovl77",
      "body": "exactly, grooming is real but it’s not just about the sex, it’s about betraying her sister",
      "created_utc": 1747428816.0,
      "score": 2
    },
    {
      "id": "mso861n",
      "body": "I agree aside from the fact that she needs to be there for her sister. That depends entirely on how OP heals and the circumstances that follow. OP can try to not lay blame on her sister but still take time to heal and acknowledge their own hurt.  Both are victims and this is fucked up. It would take a saint to forgive and forget everything and be there for their pregnant sister instantly.",
      "created_utc": 1747421657.0,
      "score": 3
    },
    {
      "id": "msotpj2",
      "body": "absolutely not, im not denying she was groomed but 17 is old enough to know now to sleep with ur sisters husband and OP can be upset with her and even cut contact if she feels like it",
      "created_utc": 1747428250.0,
      "score": 3
    },
    {
      "id": "mshl9he",
      "body": "Why the parents? Seems like they did the right thing?",
      "created_utc": 1747332077.0,
      "score": 13
    },
    {
      "id": "mshww3u",
      "body": "I absolutely agree with you.\n\nJust because she is a teenager people jump to grooming. Not all teenagers are naive ir groomed. Some teenage girls are very very promiscuous. Her parents had her monitored, shows they knew she was doing something dodgy.\n\nAnd not excusing him, but some males are very immature in their behaviors and thinking compared to their actual age.\n\nShe needs to get her marriage annulled. She needs to kick hubby and her sister completely out of her life.\n\nIf the sister keeps the child and the parents support her with the baby, I would be cutting off the parents too.\n\nEdited for grammar",
      "created_utc": 1747335545.0,
      "score": 15
    },
    {
      "id": "msme6sk",
      "body": "Actually, one month pregnant means the child was conceived around the wedding date…",
      "created_utc": 1747401955.0,
      "score": 2
    },
    {
      "id": "mshkhns",
      "body": "Texas. From what I’ve read, kids 14-16 can consent to someone up to 3 years of age, while 17+ can consent to anyone.",
      "created_utc": 1747331859.0,
      "score": 51
    },
    {
      "id": "msjqcod",
      "body": "selfish people are selfish from the beginning",
      "created_utc": 1747356778.0,
      "score": 4
    },
    {
      "id": "msjom88",
      "body": "She's legal as far as statutory rape goes (IF relations started at 17, it was probably earlier) but she isn't an adult.",
      "created_utc": 1747356121.0,
      "score": 6
    },
    {
      "id": "msour2z",
      "body": "im shocked how many people think 17 is too young to know not to betray a sibling like that and that OP should forgive and someone even said she should BE THERE for her, however OP feels is valid",
      "created_utc": 1747428562.0,
      "score": 2
    },
    {
      "id": "mshi4t7",
      "body": "Idk that her FAMILY sucks. They did communicate their findings and were caring enough to have her come in person rather than inform her by text. \n\nThe sister is 17. She was groomed by a grown ass man in a position of trust. \n\nDivorce the husband for sure. I'd encourage an abortion for more than one reason but that decision is for the sister to make, hopefully with the guidance of her family and doctors.",
      "created_utc": 1747331194.0,
      "score": 20
    },
    {
      "id": "msoi8sk",
      "body": "I hope her sister can cut him out of her life aswell. I just know that groomer is going to file for joint custody or custodial rights if she gives birth to that child…",
      "created_utc": 1747424751.0,
      "score": 2
    },
    {
      "id": "msouwmv",
      "body": "OP has every right to be mad and cut contact with her sister, 17 is not a baby, you guys need to stop with this",
      "created_utc": 1747428609.0,
      "score": 1
    },
    {
      "id": "msm5qco",
      "body": "It varies depending on the country and region. ‘Romeo and Juliet’ Laws only apply when someone is below the age of consent but the other person is still within a few years of age, and they’re not a thing everywhere. Generally the age of consent means few or no consequences in situations like these.",
      "created_utc": 1747398965.0,
      "score": 1
    },
    {
      "id": "msouf8b",
      "body": "absolutely not, people need to stop telling OP to forgive her sister, even if she was groomed, 17 is old enough to not betray your sibling like that, OP can respond however she wants",
      "created_utc": 1747428464.0,
      "score": 2
    },
    {
      "id": "mshh1i7",
      "body": "That’s such a gross take. Weird that you focus on the sister rather than the vile husband",
      "created_utc": 1747330887.0,
      "score": -1
    },
    {
      "id": "mspjqiw",
      "body": "-***got him drunk",
      "created_utc": 1747437624.0,
      "score": 1
    },
    {
      "id": "msrls4k",
      "body": "I don't think any of them deserve forgiveness. atleast not from OP.",
      "created_utc": 1747472657.0,
      "score": 1
    },
    {
      "id": "msqzzc7",
      "body": "Update can be found on OOPs profile page...",
      "created_utc": 1747459396.0,
      "score": 1
    },
    {
      "id": "msoj320",
      "body": "I hope that the family doesnt do that. To side with the ex luggage of one daughter to support that luggage getting with your other, much younger, preyed upon daughter? Someone has to be a moron to do that. The family better cut that man out of their life, and then the “healing” could start. He doesnt deserve a place in their lives at all!!!",
      "created_utc": 1747425013.0,
      "score": 2
    },
    {
      "id": "msvpbwy",
      "body": "I think she ought to do whichever one allows her to get as much alimony as possible. This trash bag. He's the lowest of the low. Hard to imagine he wasn't having sex with her sister when she was a child",
      "created_utc": 1747528336.0,
      "score": 3
    },
    {
      "id": "mtt93mu",
      "body": ">However, this also means he cheated within a couple days of the wedding. Gross.\n\nTo be fair, the sister was probably AT the wedding, and he wouldn't want to be rude.",
      "created_utc": 1747996919.0,
      "score": 1
    },
    {
      "id": "msov3jf",
      "body": "I'm not 100% sure but I think annulment is implying that the marriage wasn't valid, and therefore is erased as if it never happened. Divorce on the other hand means the marriage was valid, however is now ended. Legally I assume this means the partners can still be bound after a divorce, such as by property or money, while annulment erases all such responsibilities.",
      "created_utc": 1747428668.0,
      "score": 172
    },
    {
      "id": "msovu9n",
      "body": "It can make a difference in terms of remarriage for religious reasons (e.g. the marriage is null and void and the person is free to marry whereas sometimes there are problems with divorcees remarrying). It also gives an emotional 'clean slate' as the cheating partner did not enter into the marriage in good faith, and the wronged partner does not have the stigma (if there is any in their community) of being divorced.",
      "created_utc": 1747428893.0,
      "score": 64
    },
    {
      "id": "mspwqex",
      "body": "Much cheaper and easier.",
      "created_utc": 1747442480.0,
      "score": 3
    },
    {
      "id": "msqw0nc",
      "body": "With an annulment it basically states the marriage was never legally valid in the first place.\n\nA divorce acknowledges that a marriage existed and is now over",
      "created_utc": 1747457301.0,
      "score": 3
    },
    {
      "id": "msrg4io",
      "body": " My ex’s uncle once said divorce is like a late stage abortion and an annulment is finding out she was never even pregnant. As crude as that is, it’s kind of true and unfortunately it stuck in my head.",
      "created_utc": 1747468988.0,
      "score": 3
    },
    {
      "id": "msrwesf",
      "body": "An annulment means a clean slate so she won’t be a divorcee. So her next marriage will be the first.",
      "created_utc": 1747479289.0,
      "score": 3
    },
    {
      "id": "mt0mh3s",
      "body": "If you have a divorce you can’t get married in a church. If you have an “annulment” the Catholic religion deems this “acceptable” to be part of a church and possibly get remarried again without ever having to say you were married.",
      "created_utc": 1747602340.0,
      "score": 2
    },
    {
      "id": "mswaf9q",
      "body": "Annulment:  seen as the marriage never legally happened.  \n\nDivorce:  marriage was legal and is being dissolved.",
      "created_utc": 1747537047.0,
      "score": 1
    },
    {
      "id": "mt3khe6",
      "body": "Sure! An annulment means the marriage is considered never to have legally existed, while a divorce ends a valid marriage. So annulment wipes it clean; divorce just ends it.",
      "created_utc": 1747650356.0,
      "score": 1
    },
    {
      "id": "mskf8iy",
      "body": "Is there an advantage of an annulment vs divorce?",
      "created_utc": 1747366268.0,
      "score": 210
    },
    {
      "id": "msl97bl",
      "body": "act on this one as fast as possible OP.\n\nFamily fallout later, prioritize yourself first",
      "created_utc": 1747382198.0,
      "score": 138
    },
    {
      "id": "msik8fg",
      "body": "Fraud is a basis for annulment and infidelity is a type of fraud, especially infidelity with a minor resulting in a concealed pregnancy concurrent to the vows. If she accepts the infidelity by virtue of marriage counseling or staying in the marriage that is one thing but his infidelity could very well qualify for annulment if she files now. She was not aware that he was cheating nor was she aware that the cheating had resulted in a pregnancy. It’s worth exploring.\n\n>*Concealing a pregnancy at the time of marriage can be grounds for annulment, particularly if the other party was unaware of the pregnancy and would not have entered the marriage had they known. It's considered fraud or a misrepresentation that goes to the heart of the marriage, as the intent to procreate is a fundamental aspect of marriage.*",
      "created_utc": 1747342391.0,
      "score": 534
    },
    {
      "id": "msim2jv",
      "body": "Not true! My SIL was able to do one easily after he cheated",
      "created_utc": 1747342933.0,
      "score": 107
    },
    {
      "id": "msji1qc",
      "body": ">annulment\n\nSome locations allow annulment if the marriage is less than a year old regardless of cause. My mother got an annulment from her first husband for exactly that reason.",
      "created_utc": 1747353641.0,
      "score": 54
    },
    {
      "id": "mslrp2b",
      "body": "Annulment can also be if it was under false pretenses and this sure was. My sister got one.",
      "created_utc": 1747393043.0,
      "score": 4
    },
    {
      "id": "mso76p9",
      "body": "I'm going to agree because sister is a child, she's a victim",
      "created_utc": 1747421359.0,
      "score": 6
    },
    {
      "id": "msixvoa",
      "body": "Nah, ex and little sister can both go to hell. OP isn’t the one breaking up the family.",
      "created_utc": 1747346571.0,
      "score": 93
    },
    {
      "id": "msix4oh",
      "body": "Her sister knew they're together, not sure how he's the only dirtbag here.",
      "created_utc": 1747346326.0,
      "score": 61
    },
    {
      "id": "msrrswv",
      "body": "Dirtbag will be around for at least 18 years now.",
      "created_utc": 1747476549.0,
      "score": 3
    },
    {
      "id": "msj1qd6",
      "body": "He’s a predator for sure but she knew what she was doing too. Don’t keep in contact with the sister either. To edit: It would depend for me how long it’s been going on with the little sister. If it’s been years then she’s definitely been groomed. If it was a one time thing or recently started then she definitely knew what she was doing and is trash too",
      "created_utc": 1747347872.0,
      "score": 29
    },
    {
      "id": "mskxqoc",
      "body": "I’ve heard this many times. That some men prey on single mothers (in your case, older sister), just so they can get access to their kids.",
      "created_utc": 1747375320.0,
      "score": 91
    },
    {
      "id": "msqy2hi",
      "body": "What’s CSAM",
      "created_utc": 1747458369.0,
      "score": 1
    },
    {
      "id": "mshyfof",
      "body": "Definitely not the first time in my opinion. I'm betting it started when she was WAY younger and he probably was her first. Which is even sadder",
      "created_utc": 1747336015.0,
      "score": 150
    },
    {
      "id": "mspozt1",
      "body": "Respectfully I'm not gonna answer that question. I offered it up to op as something I hoped might help. Not for any other reason.",
      "created_utc": 1747439563.0,
      "score": 5
    },
    {
      "id": "mshl8ed",
      "body": "Is abortion off the table it would be so fucked up for her to go through with this pregnancy and now you have both of them in your lives forever\n\nIf she keeps that baby, you need to leave that family alone",
      "created_utc": 1747332068.0,
      "score": 430
    },
    {
      "id": "mshhxk9",
      "body": "totally fair, i wouldn't know what to do either",
      "created_utc": 1747331137.0,
      "score": 115
    },
    {
      "id": "msilpqw",
      "body": "You don’t have to know what you feel yet. OP, first take care of your mental health.",
      "created_utc": 1747342827.0,
      "score": 36
    },
    {
      "id": "mshyi4d",
      "body": "She was groomed. How long have you known him, and what is the age of consent where you live? Is she keeping the baby? Where I live he raped her.",
      "created_utc": 1747336035.0,
      "score": 153
    },
    {
      "id": "mshk7jv",
      "body": "You two will probably have a lot of healing to do over the years, because you are family. But your husband? He wasn’t a kid and he knew what he was doing. I would get rid of him. He doesn’t have any loyalty at all",
      "created_utc": 1747331779.0,
      "score": 111
    },
    {
      "id": "msk5nr8",
      "body": "She is a kid who was likely heavily manipulated by someone she thought she could trust and who was in a semi authority figure role. She is a victim here. \n\n\n\nThat being said, that doesn't mean you have to immediately absolve her. Or be the one to help and support her. You would absolutely be justified in distancing yourself. Just maybe give ~some~ grace.",
      "created_utc": 1747362483.0,
      "score": 21
    },
    {
      "id": "msin6jr",
      "body": "I would 100% assume, your husband has been grooming her for this since she was younger and she can't really see that it is wrong. When she turned the age of consent he made his move. \n\nI'd wager she is a victim here too, but she doesn't know it because she is just a kid.",
      "created_utc": 1747343267.0,
      "score": 37
    },
    {
      "id": "msi3cep",
      "body": "She was groomed but stabbing your sister in the back is a choice you can’t be groomed into. Brad Pitt himself couldn’t have gotten me to betray my sister even if he successfully groomed me using his best efforts during his Legends of the Fall phase.",
      "created_utc": 1747337468.0,
      "score": 66
    },
    {
      "id": "mshpz0g",
      "body": "17 is old enough to know what's right & wrong..",
      "created_utc": 1747333472.0,
      "score": 119
    },
    {
      "id": "mshst9l",
      "body": "Shes not a kid, shes a young adult.  She doesnt get a full pass here, understanding yes, but pass, no.  \n\nGood for your parents for letting you know!  Hopefully they are supporting both of you.\n\nYou need a break, permanent from your wasband (read that on Reddit, love it), but at least a temporary one from your sister.\n\nGood luck to you.",
      "created_utc": 1747334327.0,
      "score": 59
    },
    {
      "id": "msj6y7w",
      "body": "Just take a break from your sister. Let your parents deal with her from now on. Maybe in the future you can try and have a relationship with her but right now she is too in the moment to realize how bad it this is.",
      "created_utc": 1747349727.0,
      "score": 6
    },
    {
      "id": "msm3hgk",
      "body": "OP if you can afford it, please get yourself a therapist - this is something best worked through with a professional.",
      "created_utc": 1747398104.0,
      "score": 3
    },
    {
      "id": "msnol20",
      "body": "Yeah, I am really sorry for all of this but your little sister was groomed so she will definitely still need your support. Please understand that your ex is a predator and he took advantage of your younger sister because he is a despicable human being. \n\nEspecially because if she’s pregnant now, there is a good chance their affair started when she was a minor. \n\nHopefully she, indeed, does the sensible thing and gets an abortion. But if not try to be there for her anyways and remember to love her. \n\nIf anything, I feel like your second priority after getting this marriage annulled and this POS permanently out of your life should be to get your sister into therapy ASAP, and to make sure you stand between this horrid man and your little sister. \n\nDo not let him near her from this point on! He will continue to abuse her if he can get away with it, so you and your family have to do whatever you can to help your sister out of this very messed up situationship!",
      "created_utc": 1747415819.0,
      "score": 3
    },
    {
      "id": "mso8sn8",
      "body": "Tell her he was grooming her. \n\nShe's a kid. Dont forgive her right away because tell her \"my feelings are destroyed. But you're a CHILD. And you dont think you are, but to the rest of us, including the soon to be ex, you're a kid\"\n\nDont let her run to him itll destroy her life further.\n\nTell her She's been groomed. Then give yourself time to process and ask everyone to back off until you're ready to ever talk to em again.",
      "created_utc": 1747421844.0,
      "score": 3
    },
    {
      "id": "msozutg",
      "body": "Sounds to me like she was groomed. Get her therapy if you can.",
      "created_utc": 1747430141.0,
      "score": 3
    },
    {
      "id": "mspl2ug",
      "body": "She’s a kid, this guy 100% has been grooming her for years. Don’t blame your sister, give yourself time and space to feel angry but you will have to find a way to forgive her because she’s a victim here",
      "created_utc": 1747438121.0,
      "score": 3
    },
    {
      "id": "mshk4nk",
      "body": "The feelings that you are having are perfectly valid. But with the child in the mix, take it from someone who’s down the road a little bit, your life, your sister‘s life and his life are going to be deeply interconnected for a long time. It’s just a fact of the circumstance that being said, take care of yourself.",
      "created_utc": 1747331756.0,
      "score": 14
    },
    {
      "id": "msib39z",
      "body": "It's okay not to know how you feel, it's very normal. \n\nTake some time, get some therapy, process your divorce or an annulment if you can. \n\nThen, work on your feelings with your sister. It's okay to need time and space. Take as much of both as you need. \n\nI'm so incredibly sorry. My sister who is 3 years older than me slept with someone I was dating, I get the hurt that causes. \n\nI do want to say that \"legal age of consent\" is just a legal term, we all understand that 17 is a child. I'm sorry but your sister was groomed. She still did something wrong and knew it was wrong. I'm not saying to forgive her but remember that while she hurt you, she is also a victim. It's complicated and I'm just so very sorry.",
      "created_utc": 1747339755.0,
      "score": 9
    },
    {
      "id": "msr6clt",
      "body": "WoOoOoOoOoOoOoOoOoOoW....",
      "created_utc": 1747462995.0,
      "score": 2
    },
    {
      "id": "mtl4n28",
      "body": "Don’t put pressure on yourself to be the bigger person. Listen to your heart.\nPeople can be victims and selfish at the same time you don’t owe anyone forgiveness.",
      "created_utc": 1747880268.0,
      "score": 2
    },
    {
      "id": "msjte3f",
      "body": "It is easy, so unbelievably easy to manipulate a 17 year old girl. By and large they are so desperate for validation and to feel adult. And that's the sole reason he went after her--because he knew how to get her to do almost anything. \n\nI don't blame you for resenting her, but the overwhelming share of the blame belongs to your husband. He is a hardcore predator. \n\nIn fact, consider that maybe he pursued you so that your family would trust him and he could gain access to your sister, because that's how predators operate.",
      "created_utc": 1747357913.0,
      "score": 4
    },
    {
      "id": "mshkeej",
      "body": "This might sound crass but is abortion on the table? Her, a just barely legal teenager, getting groomed by an adult man since she was 15, then carrying his baby? Yikes.\n\nAlso could you get the law involved? If he's been grooming her since she was that long he could be in trouble",
      "created_utc": 1747331833.0,
      "score": 260
    },
    {
      "id": "mshpzi6",
      "body": "Definitely sounds like he groomed your sister from the start if the messages go that far back. He took advantage of a child. It may be hard to not be mad or resentful at your sister, but all the blame lies on him. Sorry you're going through this and dealing with this.",
      "created_utc": 1747333476.0,
      "score": 47
    },
    {
      "id": "mslugy3",
      "body": "Ok, so since your little sister was not safe from this guy, no child will be safe from him, including future daughters, and perhaps sons. Pedos dont change. Get as far away from this guy as you can, and tell your parents to get your sis away too, and don’t let him near that baby if she has to keep it. The baby won’t be safe. It’s just a matter of time before he loses control, if he even bothers to try to control his urges. He’s already groomed your sister to the point where she was lying for him. That’s what they want. Someone always willing to lie for them. For future alibis.",
      "created_utc": 1747394334.0,
      "score": 8
    },
    {
      "id": "mshnk3m",
      "body": "And still a sister.",
      "created_utc": 1747332755.0,
      "score": 24
    },
    {
      "id": "msphbys",
      "body": "I get that and totally agree. But did her sister disappear? Was he somehow no longer her sister's boyfriend/fiance/husband? It's still a horrible betrayal. Unless she is differently abled mentally she's old enough to know that. \n\nHE IS A PREDATOR. And...\n\nHer age doesn't totally take away that betrayal to me. That's all I'm saying. When I was 15/16/17 I would have protected my sister with my life. I just don't get that part.",
      "created_utc": 1747436731.0,
      "score": 1
    },
    {
      "id": "mshloeg",
      "body": "Husband has known sister for 2 years according to a comment from OP.",
      "created_utc": 1747332198.0,
      "score": 51
    },
    {
      "id": "mshifv9",
      "body": "Of course that could be. But it also could be that her little sister wanted to be rebellious. Always assuming that someone is innocent because the person is a minor is wrong IMO because there are asshole minors out there who love to make a ruckus. Not saying that’s the situation here, just in general. \nWe simply don’t know the circumstances and I answered from the information we got from OP 🤷‍♀️\nAnd if the parents installed a monitoring app they probably could’ve seen if he’s threatening her, just saying.",
      "created_utc": 1747331282.0,
      "score": 29
    },
    {
      "id": "msou612",
      "body": "Agreed",
      "created_utc": 1747428387.0,
      "score": 2
    },
    {
      "id": "mshloz4",
      "body": "I agree the parents did the right thing; I was assuming they'd be helping the sister with the newborn, and that the whole family dynamic will be bad for a while.  If I was in that position, I'd want to distance myself from everyone involved, just for my own mental health.",
      "created_utc": 1747332202.0,
      "score": 11
    },
    {
      "id": "msjf194",
      "body": "It sure sounds like you’re excusing him, and you saying “some teenaged girls are very promiscuous”? How gross. Have you ever once called a teenaged boy promiscuous? Or a cheating husband promiscuous? You know how a real man would respond if he felt a teenaged girl was interested in him? He’d be put off, and keep his distance and hope she got help. No real man exploits a teenager and then excuses it by saying “they came on to me”. That is what scumbags and perverts and pedophiles say. Sort yourself ALL the way out.",
      "created_utc": 1747352562.0,
      "score": 2
    },
    {
      "id": "mshyku8",
      "body": "But he waited until she was 17 to start sleeping with her? I’d bet not. So statutory rape can apply.",
      "created_utc": 1747336058.0,
      "score": 40
    },
    {
      "id": "mshnols",
      "body": "Wow, this is just wrong. Illegal or not. \n\nYou need to file for a divorce or annulment. I personally would divorce your sister as well. \n\nI’m so sorry",
      "created_utc": 1747332792.0,
      "score": 21
    },
    {
      "id": "mskx8sn",
      "body": "Suppose that was my daughter - holy hell fire. Your soon-to-be ex-husband would be in jail. How long has this been going on?",
      "created_utc": 1747375044.0,
      "score": 7
    },
    {
      "id": "msjxdsm",
      "body": "You're right. Just *how selfish* people can be continues to destroy my view of humanity.",
      "created_utc": 1747359408.0,
      "score": 3
    },
    {
      "id": "msp12ow",
      "body": "At 17, she’s a victim of grooming. Even more true if this started sooner.\n\nGrooming is not betrayal. It’s for all intents and purposes pedophilia. If he could have legally gotten her to sleep with him willingly sooner, he would have. Had there not been a significant amount of buildup and manipulation leading to those incident, it would have been way easier for her sister to say no. He almost definitely did not take that gamble and instead planted his seeds sooner.",
      "created_utc": 1747430525.0,
      "score": 1
    },
    {
      "id": "msqt54z",
      "body": "I don’t think you understand grooming.",
      "created_utc": 1747455855.0,
      "score": 1
    },
    {
      "id": "mshjns9",
      "body": "Yeah, she was groomed, but she knew better. And, does OP want to babysit her affair partner's baby? You know the parents are going to cave. She'll divorce but still be tied to the predator forever. They may even marry. Lil Sis doesn't deserve any slack from OP.",
      "created_utc": 1747331625.0,
      "score": 24
    },
    {
      "id": "msvr0cj",
      "body": "Yes, I agree she should get all the alimony, I was simply commenting on when she got pregnant. When I got pregnant the first time I couldn’t wrap my head around the fact that my “pregnancy” started approx 2 weeks before I conceived. Because it seemed that no one else I told understood this, apart from people who had given birth, I thought it was worth mentioning. I’d think the majority of people would hear 4 weeks pregnant and assume they had sex 4 weeks prior to that date. \n\nBut ya, she should get an annulment or a divorce and ask for all the money. Depends what her priorities are. She may want to cut off all ties and walk away. \n\nSometimes when you think about cutting someone off it seems like there will be a big loss. But when someone is toxic, removing them from your life can be a weight off your shoulders. My husband and I cut off a large chunk of his family and at first, I expected it to be really hard, but it turns out to be very easy! Out of sight, out of mind. And when they aren’t adding anything positive to your life, removing them just makes you exponentially happier and makes your life lighter.",
      "created_utc": 1747529011.0,
      "score": 3
    },
    {
      "id": "msqc5k4",
      "body": "also annulments usually are less costly than divorces",
      "created_utc": 1747448412.0,
      "score": 80
    },
    {
      "id": "mspepf4",
      "body": "Yes. In the Catholic Church, an annulment (under Church authority, not Civil), means one can (re)marry in the Church, as it renders the first marriage \"quasi non factum esset\", as though it never happened. \n\nI'm not much of a practicing Catholic these days. But, in a case such as that of OP, I think I'd want the (Civil) annulment for \"psychological\" reasons. ❤️  That man entered into the Civil contract of marriage under fraudulent circumstances, and thinking of it as a marriage that never was real in the first place, as opposed to one that ended, would be beneficial for me insofar as moving on.\n\nOP, I'm so sorry this happened to you. ❤️  The feeling of betrayal... I cannot even. And, despite 17 being legal age where you are, it's still creepy AF that he had sex with a teenager. He's a broken person, and a pox on your life. Goodness only knows what other little \"treats\" life would have in store for you, down the line, had you not learned of this. I'm not going to call it a blessing in disguise because that would be flippantly dismissive of the very legit, very real, very understandable pain I'm guessing you're feeling right now. But, as your life goes on and you put time between yourself and this steaming pile of horseshit, I hope it feels more as such. \n\nGood men abound. And you'll either live happily alone, or find one of these good dudes. Mine was living halfway around the world 😁😁 but, somehow, we found each other. He is terminally ill; I probably won't have him around for Christmas. My mom, either. But... I've known the amazing love of a flawed but wonderful, loving, beautiful mother. And the unconditional love of a man who sees me and meets me where I'm at on every level. Not everybody gets that in this life. It took a lot of pain, a lot of missteps, a lot of shitty hands dealt to me. I get it. Never have been through what you're contending with, but, I've had a lot of monkeys fling a lot of poo my way over the years. \n\nWe dodge the poo. We rinse off. We bend to the winds, but we don't break. ❤️\n\nYou will survive this. \n\nAll shall be exceedingly well. Prayers offered up, if welcome. 🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻  much love",
      "created_utc": 1747435525.0,
      "score": 18
    },
    {
      "id": "mspxvw4",
      "body": "Except, typically a legal annulment doesn't mean anything for the religion. She would have to go through the religious process of getting an annulment in that faith.\n\nIn the US, annulments are typically more expensive and legally don't mean much for people who have been married this short of a time. Other countries, an annulment might make more legal sense. \n\nOne exception would be if the marriage also included a path to citizenship. Then an annulment would be a way to ensure the spouse can't stay in the US. \n\nOP needs to talk to a family lawyer ASAP and do everything the lawyer says. Don't let emotions get in the way. On that front, if the sister is planning on keeping the baby, she will also need a family lawyer to discuss with her her legal options and what lies ahead for her.",
      "created_utc": 1747442920.0,
      "score": 7
    },
    {
      "id": "mskgad5",
      "body": "An annulment effectively makes it as if a marriage didn’t happen, a divorce is subject to your state’s rules relating to separation length (some states have a waiting period of up to two years), division of assets (home, retirement accounts, cash), allocation of deemed joint debt, and payment of spousal support, etc. In some religions an annulment ensures you can re-marry and remain in the church in the future.",
      "created_utc": 1747366716.0,
      "score": 614
    },
    {
      "id": "msirfl9",
      "body": "What jurisdiction is this law from?\n\nI didn’t say impossible. I said extremely unlikely. It is hypothetically *possible* that they live in a place where the concealment of the pregnancy could be grounds for an annulment if she can actually prove he knew about it before the marriage, but it still isn’t likely.",
      "created_utc": 1747344545.0,
      "score": 15
    },
    {
      "id": "msiqz9h",
      "body": "A legal annulment or a Catholic Church annulment, because those are very different things?\n\nAnd if a legal annulment, what country/state and what were the legal grounds for the annulment? Because it probably was a different reason other than the adultery.",
      "created_utc": 1747344407.0,
      "score": 19
    },
    {
      "id": "mslq266",
      "body": "Curious what country that is true in.",
      "created_utc": 1747392256.0,
      "score": 1
    },
    {
      "id": "msk2yu8",
      "body": "There was definitely a power imbalance at play here.",
      "created_utc": 1747361464.0,
      "score": 47
    },
    {
      "id": "msj46tj",
      "body": "Yeah I’d be done with both of them. Nothing anyone could do or say would get me to change my mind.",
      "created_utc": 1747348739.0,
      "score": 65
    },
    {
      "id": "msjzr3m",
      "body": "Minor, grooming \n\nThose two factors change things. I can understand being pissed and needing time, but she’s a victim too.",
      "created_utc": 1747360262.0,
      "score": 52
    },
    {
      "id": "msj2l50",
      "body": "Oh yeah. Sister is done but there isn’t legal paperwork to file with that one.",
      "created_utc": 1747348169.0,
      "score": 25
    },
    {
      "id": "msk7fuh",
      "body": "He’s not. 17 is old enough to know right and wrong.",
      "created_utc": 1747363153.0,
      "score": 8
    },
    {
      "id": "msnrnqe",
      "body": "That’s how grooming works. It’s not immediately to assault, they GROOM them to be okay with crossing boundaries slowly.  That’s the meaning of the word.",
      "created_utc": 1747416708.0,
      "score": 9
    },
    {
      "id": "mt0774n",
      "body": "Yep, literally the whole plot of Lolita",
      "created_utc": 1747597484.0,
      "score": 4
    },
    {
      "id": "mt4n9nt",
      "body": "*Child sexual abuse material* former know as *child porn*.",
      "created_utc": 1747665608.0,
      "score": 3
    },
    {
      "id": "mshykom",
      "body": "I agree sad and criminal given the 10 year difference. And a baby now. I hate this.",
      "created_utc": 1747336057.0,
      "score": 65
    },
    {
      "id": "msifpns",
      "body": "me too. its statutory r\\*pe",
      "created_utc": 1747341083.0,
      "score": 72
    },
    {
      "id": "msr5vgq",
      "body": "💯❣️",
      "created_utc": 1747462716.0,
      "score": 2
    },
    {
      "id": "msqx83i",
      "body": "There’s an update!",
      "created_utc": 1747457926.0,
      "score": 3
    },
    {
      "id": "msot6zg",
      "body": "this doesn’t mean that OP has to keep contact with her if she doesn’t want or can’t be upset with her",
      "created_utc": 1747428093.0,
      "score": 2
    },
    {
      "id": "msih4qr",
      "body": "THIS. I keep seeing people say she was groomed, and I will not under any circumstances deny that she very well may have been. But the ONE person who would have never been able to get this opportunity with me would have been my sister’s partner. No. She still has culpability for sleeping with the man who was attached to her SISTER.",
      "created_utc": 1747341492.0,
      "score": 50
    },
    {
      "id": "mshqq2q",
      "body": "But the perfect age to be groomed",
      "created_utc": 1747333695.0,
      "score": 214
    },
    {
      "id": "mshyvcn",
      "body": "Yes but this could have started off as rape. I think this wasn't thr first time. Like 2 weeks after you're married you just happen to cheat on your new wife with her child sister? I'm betting this started when she was probably 15 or 16. Hopefully not any younger but hopefully we get an update if the parents go through their history via phone.",
      "created_utc": 1747336145.0,
      "score": 105
    },
    {
      "id": "msl27p9",
      "body": "how about 15? cuz that's when it started according to op",
      "created_utc": 1747377893.0,
      "score": 11
    },
    {
      "id": "mshudvp",
      "body": "It definitely is, you’re right. However, a 17 yo can be very easily persuaded with the right actions and words. We don’t know how well he knows the sister, but I assume well enough to have possibly strategically went for her insecurities in a way that made her feel special, seen, confused, and blurred of any common sense. \n\nIn that case I do feel empathy for the girls in this situation. It’s a hard one. OP should 100% remove herself from the situation, but harboring resentment from her sister will likely be worse then eventually forgiving her and showing her empathy from afar.",
      "created_utc": 1747334800.0,
      "score": 72
    },
    {
      "id": "msi8jii",
      "body": "That’s what I’m saying",
      "created_utc": 1747339005.0,
      "score": 5
    },
    {
      "id": "msnph83",
      "body": "I mean she doesn’t have to “get a full pass” for OP and her family to step in and ensure the sister also gets away from an abuser.",
      "created_utc": 1747416077.0,
      "score": 3
    },
    {
      "id": "msife7u",
      "body": "she is a child. read the law.\n\ndoesnt mean she should get instant forgiveness but she is not an adult. the man who groomed and abused her is.",
      "created_utc": 1747340991.0,
      "score": 22
    },
    {
      "id": "mshl1by",
      "body": "The messages go far back so my parents are still looking into it. Once we find out how long it was going on we’ll get the police involved. The topic of abortion hasn’t come up yet. ",
      "created_utc": 1747332013.0,
      "score": 379
    },
    {
      "id": "msnk4p6",
      "body": "Not in Texas. They only have an exception for health of the mother.",
      "created_utc": 1747414516.0,
      "score": 2
    },
    {
      "id": "mssm7we",
      "body": "Not in texas",
      "created_utc": 1747490576.0,
      "score": 2
    },
    {
      "id": "msioiec",
      "body": "I don’t agree. Reading through the thread that OP’s sister let her ex husband when she was 15. That means he knew her for a while and knew she was young. That is grooming, and while you can blame the sister - she is a victim too. She was groomed and potentially sexually assaulted if this was happening before she reached the age of consent.\n\nOP also said that the messages between the 2 go far back and the parents are investigating. Also sounds like they may get law enforcement involved.",
      "created_utc": 1747343665.0,
      "score": 17
    },
    {
      "id": "msk62pl",
      "body": "Oh I see what you mean! Fair enough.\nI get why the parents would do that because it’s not the baby’s fault. Parents could still spend time with OP away from the child though and avoid talking about. It’s hard because the parents are in an impossible situation but proved they can be trusted because they at least told OP straight away.",
      "created_utc": 1747362639.0,
      "score": 3
    },
    {
      "id": "msnjuhs",
      "body": "Easy enough to prove if the kid was conceived before her 17th bday, or if there are text messages about it far enough back. The usual problem is the dad can't really pay child support if he's in jail, and that gets used as a reason he should stay out. (Yes, it's gross)",
      "created_utc": 1747414433.0,
      "score": 10
    },
    {
      "id": "msp2buc",
      "body": "it’s not abt the sex, she’s way old enough to know that betraying her sister like that is wrong, she’s less than a year away from being an adult",
      "created_utc": 1747430929.0,
      "score": 2
    },
    {
      "id": "msqxfud",
      "body": "all im saying is OP has every right to be very upset with her and even cut her off, she’s knows damn well how that would affect her sister at 17",
      "created_utc": 1747458037.0,
      "score": 1
    },
    {
      "id": "msxyw7k",
      "body": "Why the need to say, “Im not much of a practicing Catholic….”  How is that relevant, nor do we care. Do you think it makes a difference?",
      "created_utc": 1747570679.0,
      "score": 1
    },
    {
      "id": "msk55jt",
      "body": "If they got married in the Catholic Church they could be granted an annulment through them, right?  But only if you pay them lots of money lol",
      "created_utc": 1747362293.0,
      "score": 9
    },
    {
      "id": "mskdzz6",
      "body": "Kim kardashian got one iirc",
      "created_utc": 1747365754.0,
      "score": 4
    },
    {
      "id": "msjtdn5",
      "body": "Sister is a minor, high possibility of being groomed by this man.",
      "created_utc": 1747357908.0,
      "score": 94
    },
    {
      "id": "msjzn0q",
      "body": "Sister is a victim too. She was groomed. There is no reason a 27 year old should be sexually involved with a child.\n\nEdit: all of you blaming the child instead of the predator are wild and your children deserve better.",
      "created_utc": 1747360221.0,
      "score": 69
    },
    {
      "id": "mskdx3j",
      "body": "I mean yes and no. You know right and wrong but don’t have the brain development and practice to get it right all the time at that age. Plus, most adults I know don’t always do the right thing, even if it isn’t as big as this. 17 year olds are still very much children in many ways. I’m not saying her sister should instantly forgive her and have a relationship with her right now, but this kid is pregnant from a guy with 10 years experience over her who she should have been able to trust to not be a creep. \n\nHe very likely started being friendly to her, giving her a sympathetic ear and gaining her trust. He probably complimented her and made her feel beautiful and mature during a super insecure time. He then probably pushed the envelope physically then immediately went into an “I feel so guilty but you just understand me like no one ever has” spiel and made her feel desirable and like he needed her. I know this because it happened to me at that age and to many of my friends (not with married/attached men in our cases). It is absolutely predatory, calculated, and causes long lasting damage. She can be both a victim and have made a shitty moral decision, they aren’t exclusive concepts.",
      "created_utc": 1747365721.0,
      "score": 29
    },
    {
      "id": "mslat20",
      "body": "Exactly!",
      "created_utc": 1747383204.0,
      "score": 6
    },
    {
      "id": "mtp7uy3",
      "body": "It is still legally known as the latter, not formerly known. But CSAM is the preferred term for victims and advocates.",
      "created_utc": 1747938776.0,
      "score": 2
    },
    {
      "id": "mshzkzi",
      "body": "Yea im so sad for her. But angry thinking about the husband doing this to OP and violating the trust of the entire family. Awful, awful. Awful",
      "created_utc": 1747336356.0,
      "score": 41
    },
    {
      "id": "msj7g6w",
      "body": "You can just say rape btw. In the uk age of consent is 16 regardless of partners age unless the older party is in a position of trust",
      "created_utc": 1747349905.0,
      "score": 40
    },
    {
      "id": "msr5z0f",
      "body": "Where is the update?!?!?!?",
      "created_utc": 1747462774.0,
      "score": 2
    },
    {
      "id": "msk881u",
      "body": "Remove the age from the situation. Fucking your sisters husband is wrong. End of story.",
      "created_utc": 1747363456.0,
      "score": 22
    },
    {
      "id": "msnpatw",
      "body": "A literal crime in many places yet people are still trying to convince themselves of how morally bad a literal victim of sexual abuse was. 🫠",
      "created_utc": 1747416026.0,
      "score": 8
    },
    {
      "id": "msrmc75",
      "body": "So? the sister was still 17, op said they met at 15 which is still old enough to know its wrong.\n\nEven if he did target her sisters insecurities... hellooooo the sister knows its her own sister's boyfriend/husband. stop justifying her actions. \n\nSometimes i wonder if people on reddit are just A.I bots. \"yes, let me stab my sister in the back for 2 years because this much older guy is being really nice to me and telling me exactly what i wanna hear\"  im actually in shocked by some people in this post lol\n\nThe guy is a pedo, but the girl does not deserve forgiveness.",
      "created_utc": 1747473024.0,
      "score": 3
    },
    {
      "id": "mspbexf",
      "body": "Exactly.",
      "created_utc": 1747433996.0,
      "score": 3
    },
    {
      "id": "msj7jxg",
      "body": "‘The law’ is different in different countries so wtf are you talking about",
      "created_utc": 1747349941.0,
      "score": 9
    },
    {
      "id": "msknz2h",
      "body": "All \"children\" are not the same.  You don't treat a 6 month old the same way you treat a 5 year old the same way you treat a 17 year old.  \n\nWhat I was saying was, at 17, the sister is old enough to know better about sleeping with the (ex)spouse.  \n\nShe's not going to magically gain \"adult\" faculties the day she reaches whatever age you think is adulthood.  Her sister should meet her at her developmental level with respect to the affair.\n\nThe (ex)husband is a creep, and there are all kinds of ick factors to consider.  He should be met at his age appropriate level and dealt with accordingly.  \n\nHe bears the brunt of responsibility no doubt,  but she shouldn't get a pass because she's a \"child.\"  \n\nAnd the sister should not feel like she has to do a damn thing for her because she's a \"kid.\"",
      "created_utc": 1747370207.0,
      "score": 4
    },
    {
      "id": "msiy914",
      "body": "According to the law she is of the age of consent.",
      "created_utc": 1747346694.0,
      "score": 5
    },
    {
      "id": "mshlagl",
      "body": "I do hope your parents also explain to her why this is really bad for her. And preventing her from interacting with that freak. It's such a terrible situation for you and her.",
      "created_utc": 1747332085.0,
      "score": 176
    },
    {
      "id": "mshlwgw",
      "body": "Is the family/your parents open to abortion? This is a great reason to have one, not to be linked to her groomer. Also your parents are going to end up raising that kid.",
      "created_utc": 1747332264.0,
      "score": 93
    },
    {
      "id": "mshzu7r",
      "body": "Your parents are handling the situation commendably. There are subreddits that work to get medication abortifacients to people in heartbeat states. Also, if a month is accurate, that is still 2 weeks away from a heartbeat.",
      "created_utc": 1747336430.0,
      "score": 72
    },
    {
      "id": "mshq98p",
      "body": "Abortion isn’t an option in Texas.",
      "created_utc": 1747333557.0,
      "score": 13
    },
    {
      "id": "msjpvtg",
      "body": "Your parents aren't going to do diddly-squat.",
      "created_utc": 1747356600.0,
      "score": 5
    },
    {
      "id": "msjo98b",
      "body": "I truly hope so. This piece of shit predator needs to be in prison.",
      "created_utc": 1747355985.0,
      "score": 8
    },
    {
      "id": "msnkppt",
      "body": "I agree that it probably won’t be hard to determine when the relationship started; parents already found texts to reveal that. \n\nAre you suggesting that this man isn’t turned over to the authorities, out fear from lack of child support?? Once she files for support it’s already in the court system and this will all get sussed out. \n\nUnfortunately he will probably not spend the remainder of his life in prison for the rape of this child, therefore at some point he will have the ability to earn income and support the baby.",
      "created_utc": 1747414684.0,
      "score": 5
    },
    {
      "id": "msxeqr4",
      "body": "[removed]",
      "created_utc": 1747559442.0,
      "score": 1
    },
    {
      "id": "mspfq62",
      "body": "You’re completely missing the point of grooming. Like, entirely.\n\nIt’s not betrayal if they’re being abused. Grooming is abuse.\n\nIt’s not betrayal for the same reason why a 16-year old sleeping with her mom’s 45-year-old husband is not the teenager’s fault.",
      "created_utc": 1747436107.0,
      "score": 1
    },
    {
      "id": "msz2i0w",
      "body": "Find a hobby! 🤣🤣",
      "created_utc": 1747584603.0,
      "score": 1
    },
    {
      "id": "mskcsfa",
      "body": "Yes but that is not a LEGAL annulment. It only has meaning if either of them wanted to remarry in the Catholic Church.",
      "created_utc": 1747365262.0,
      "score": 6
    },
    {
      "id": "msjyygs",
      "body": "Well that’ll be up to my parents to figure out. Cause I’m noping out.",
      "created_utc": 1747359976.0,
      "score": 39
    },
    {
      "id": "msk7ar8",
      "body": "Gtfo here with that. She knew what she was doing.",
      "created_utc": 1747363098.0,
      "score": 4
    },
    {
      "id": "mskefyo",
      "body": "Stop. Fucking your sisters husband is wrong no matter the age. 17 year olds know this.",
      "created_utc": 1747365938.0,
      "score": 4
    },
    {
      "id": "mst5v2b",
      "body": "17 is a child. Some are more mature and developed mentally then others, yeah. But nobody at 17 has a fully developed brain yet. I’m not saying her actions are justified, she is not innocent I agree. That doesn’t mean she doesn’t deserve forgiveness though. Nobody’s talking about giving her a free pass and babying her.",
      "created_utc": 1747497096.0,
      "score": 3
    },
    {
      "id": "msrgx1x",
      "body": "im not trying to argue, but its incredibly dangerous to say that a child (ANY AGE) should 'know better' about sleeping with an adult. children need to be protected properly from things like this happening and that includes not blaming them or holding them accountable for being groomed by a adult who knew they were doing this with a minor. let children be children and do not blame them or hold them accountable for getting groomed and preyed on by an adult. otherwise society harbours a culture of guilt for children who are actually the victims. they become unable to reach out to their caregivers, when adults should be safeguarding children from this - NOT blaming them or holding them accountable. the law is 18 and over is an adult, 17 and under is a child. sorry if this comes across aggressive but its coming from a personal place. let kids be kids.",
      "created_utc": 1747469501.0,
      "score": 3
    },
    {
      "id": "msjnlps",
      "body": "The law is rarely moral.",
      "created_utc": 1747355740.0,
      "score": 15
    },
    {
      "id": "msj7eq1",
      "body": "but was she at the age of consent when the relationship started? seems unlikely. and he almost definitely met her when she was underage. even if he waited until she was 17 that’s sus. but let’s be real, there’s no way he waited.",
      "created_utc": 1747349890.0,
      "score": 14
    },
    {
      "id": "msk3vcm",
      "body": "Texas...nuff said",
      "created_utc": 1747361805.0,
      "score": 30
    },
    {
      "id": "msilpyl",
      "body": "Going to add to this, the topic of abortion needs to be discussed pronto for this exact reason. It really should be considered because this man can fight for custody and make her life (and the rest of your family’s life) a living hell. Nobody should have any ties to a disgusting person like that man.",
      "created_utc": 1747342828.0,
      "score": 48
    },
    {
      "id": "mshqife",
      "body": "[deleted]",
      "created_utc": 1747333632.0,
      "score": 23
    },
    {
      "id": "msnncli",
      "body": ">Are you suggesting that this man isn’t turned over to the authorities, out fear from lack of child support\n\nI'm not suggesting it's what should happen. I'm saying it's what often happens. Even when the family does cooperate & the DA's office decides to press charges, it can be enough to sway a judge into giving a much lighter sentence, like monitoring instead of any jail time at all.",
      "created_utc": 1747415458.0,
      "score": 3
    },
    {
      "id": "msq0c4h",
      "body": "two things can be true at once, that man grooming her was wrong, but she still betrayed her sister and she’s less than a year away from being a full adult, OP has every right to be very mad and even cut contact",
      "created_utc": 1747443851.0,
      "score": 2
    },
    {
      "id": "mt3topx",
      "body": "Obviously, you should take your own advice.😜😜",
      "created_utc": 1747654905.0,
      "score": 1
    },
    {
      "id": "msm0eo4",
      "body": "17 may be the age of consent but she’s a 17 year old who apparently needs her phone monitored by her parents, so it’s clearly known that she’s not very mature- besides the fact that by age her brain isn’t fully developed.",
      "created_utc": 1747396875.0,
      "score": 21
    },
    {
      "id": "msp9oe2",
      "body": "Dude there’s a reason the law considers it to be predatory for an adult to be getting with a child, even a 17 year old one. I’m past his age now, but definitely wasn’t checking out literal children. It’s not that hard to understand - yes, she did wrong, and yes, she is a child who is a victim.",
      "created_utc": 1747433387.0,
      "score": 6
    },
    {
      "id": "msljoi9",
      "body": "Exactly.",
      "created_utc": 1747388758.0,
      "score": 3
    },
    {
      "id": "mskeurd",
      "body": "I literally said that.",
      "created_utc": 1747366109.0,
      "score": 9
    },
    {
      "id": "msugxrk",
      "body": "Well i dont think the developed brain matters much cause a 22yr old also doesn't have a fully developed brain. but eather way i get ur point.\n\nDoes not deserve forgiveness was mybe a bit harsh, its up to OP obviously. but i just mean that she is not owed forgiveness and if OP chooses not to forgive her thats completely reasonable and fair.",
      "created_utc": 1747512513.0,
      "score": 5
    },
    {
      "id": "msrmv40",
      "body": "You are focusing on the wrong things. i don't think anyone would blame the sister if it was some random older guy. \n\nBut you absolutely should be developed enough at 17 to know you are betraying your sister by fucking him.",
      "created_utc": 1747473374.0,
      "score": 3
    },
    {
      "id": "msj9gpf",
      "body": "The OP said that she's the age of consent and hasn't added any disclaimer.\n\nI believe that if she had been 16 at the time of conception, the OP would have mentioned it.\n\nWhat does \"almost definitely\" mean?  That you're hoping for it to be even worse than it was?",
      "created_utc": 1747350612.0,
      "score": 1
    },
    {
      "id": "mslgpvs",
      "body": "Fucking brutal place to be a woman. No idea how they hang in there, or why. ",
      "created_utc": 1747386944.0,
      "score": 23
    },
    {
      "id": "mspeg9h",
      "body": "Yes!! Stand your ground! No need for a divorce or an annulment.",
      "created_utc": 1747435189.0,
      "score": 2
    },
    {
      "id": "mshvsk1",
      "body": "Not an option either. Colorado or New Mexico.",
      "created_utc": 1747335221.0,
      "score": 11
    },
    {
      "id": "mshqlif",
      "body": "I wouldn’t say that in public.",
      "created_utc": 1747333657.0,
      "score": 28
    },
    {
      "id": "mshvz0x",
      "body": "[deleted]",
      "created_utc": 1747335273.0,
      "score": 11
    },
    {
      "id": "msmbi3s",
      "body": "She could be tried as an adult. She is at the age of consent. She knew what she was doing was wrong. That’s her sister bro.",
      "created_utc": 1747401040.0,
      "score": 2
    },
    {
      "id": "msuikl2",
      "body": "I agree with you. I suggested OP distance herself. But I still stand by putting the main responsibility behind the husband.",
      "created_utc": 1747513052.0,
      "score": 4
    },
    {
      "id": "msjnhuw",
      "body": "Op probably doesn't know when it started, her parents likely don't either. That predatory soon to be ex-husband knows for sure, though I doubt he'll be honest. Parents need to find that out from their teenage daughter.",
      "created_utc": 1747355701.0,
      "score": 13
    },
    {
      "id": "msn94cn",
      "body": "At some level of course she did. But the last part of the brain to fully develop is decision making and impulse control, and teens can easily be swept away or influenced by others. That’s why we’ve coined the word “groom.”",
      "created_utc": 1747411296.0,
      "score": 12
    },
    {
      "id": "msp9w2e",
      "body": "She didn’t murder someone. Her life was fucked up from this too. She also has damages here be it raising a child.",
      "created_utc": 1747433461.0,
      "score": 5
    }
  ]
}