{
  "id": "1epstxp",
  "title": "I proposed to my girlfriend of 10 years yesterday, and she said no because I took too long.",
  "selftext": "Basically, the title. \n\nI was so excited. I proposed. I handed her the ring. She looked like she was going to cry. \n\nThen she said \"Sorry. I don't think we should get married.\" I asked her why and she said something along the lines of \"I'll always be the girl you took a decade to decide if I was wifey material. I don't know how to be happy with that reality\" \n\nI really fucked up. Now the woman I love isn't willing to be my wife. I don't know what the fuck to do.",
  "created_utc": 1723403546.0,
  "score": 8888,
  "num_comments": 2570,
  "url": "https://www.reddit.com/r/offmychest/comments/1epstxp/i_proposed_to_my_girlfriend_of_10_years_yesterday/",
  "comments": [
    {
      "id": "lhmti7q",
      "body": "Had you both talked about getting married before you proposed?\n\nOr was it something that yous did talk about years ago and the discussions slowed?",
      "created_utc": 1723404480.0,
      "score": 4204
    },
    {
      "id": "lhn4sp0",
      "body": "When the fighting stopped, the resentment set in.",
      "created_utc": 1723408271.0,
      "score": 9023
    },
    {
      "id": "lhnvtbb",
      "body": "A few months ago, there was a similar post. He told her that he is not interested in marriage and she could take it or leave it. She took it. Years passed, and now he is ready to get married. She isn't interested. She doesn't even want to move in with him. He was here looking for help because he wanted a family with her but she told him that she gave him what he wanted and why was he upset.",
      "created_utc": 1723417834.0,
      "score": 429
    },
    {
      "id": "lhn3ibg",
      "body": "She’s got sunken cost fallacy and dropped marriage talk and settled. Not sure you can come back from that unless you beg and grovel.",
      "created_utc": 1723407843.0,
      "score": 765
    },
    {
      "id": "lhmwolr",
      "body": "Yeah, after 5 or 7 years and nothing new has advanced, developed, or changed in the relationship, it would made anybody think that this is just how the relationship will continue to be from now on. ",
      "created_utc": 1723405554.0,
      "score": 3205
    },
    {
      "id": "lhmw2vo",
      "body": "Your answer should have been “I always knew you were wifey material, but it took ten years for me to become husband material”",
      "created_utc": 1723405348.0,
      "score": 13631
    },
    {
      "id": "lhp0557",
      "body": "Info: what are the ages?  If you got together at 16 and are 26 a decade is more than appropriate time to wait. If you’re 40…. Shes got a point",
      "created_utc": 1723434347.0,
      "score": 326
    },
    {
      "id": "lhmthne",
      "body": "Well, have you ever had any discussion about marriage or anything?",
      "created_utc": 1723404475.0,
      "score": 1432
    },
    {
      "id": "lhmrn43",
      "body": "Info: Why did you wait so long? ",
      "created_utc": 1723403845.0,
      "score": 1574
    },
    {
      "id": "lhnksmi",
      "body": "I simply don’t buy the “ADHD made me do it” bullshit. \n\nShe spent 10 years by your side dealing with your bullshit. She argued to get married YEARS ago. You told her all the reasons why she shouldn’t, and then dropped the subject for YEARS. She came to terms with the fact that she won’t ever be married if she wants you. She grieved that loss without you.",
      "created_utc": 1723413749.0,
      "score": 549
    },
    {
      "id": "lhn0syq",
      "body": "From your comments it’s clear you neglected to acknowledge her feelings about this properly a long ass time ago. You didn’t fuck up when you asked her, you fucked up the moment she stopped asking you.",
      "created_utc": 1723406943.0,
      "score": 1242
    },
    {
      "id": "lhnm30c",
      "body": "Damn dude. Idk what to tell you. At 38 after 10 years she clearly doesn't feel like you wanted to commit to her, from your comments it seems she tried years ago and you took the lack of continued conversation as a resolution for some reason. Because clearly it didn't end with her agreeing to wait longer for valid reasons so that wasn't a resolution. \nShe's entitled to her feelings, especially after such a lack of communication on the topic for years. Sorry but that's the consequences of your actions. 🤷 I find it especially hard to sympathize with you because you blamed your anxiety and ADHD for the delay in other comments, which is bs. Those are completely separate from this issue and it's gross to try to weaponize them like that.",
      "created_utc": 1723414210.0,
      "score": 223
    },
    {
      "id": "lhpt1pl",
      "body": "I bet you’re reading the comments and having a heart sinking feeling because I’m sure everyone said harsh truths you never even considered but are spot on, because this is a situation that continues to happen.\n\n\n\n1. You robbed her of her youth.\n\n\n2. You made having kids (if she wanted them) a very costly decision (+35 years old pregnancy is usually IVF).\n\n\n3. You made her feel like this is a “shut up proposal” “a might as well” “a placeholder turning into a permanent solution”.\n\n\n4. You navigated life fine but anxiety and ADHD shows up when it’s about her.\n\n\n5. She adjusted her entire life for you and healed herself from a very very normal and natural desire, then you came in and wrecked all her hard work with what I bet you considered a grand gesture and she should feel grateful you proposed.\n\n\n6. Failed to update your understanding about relationships and learn to better, at almost 40 you ignored that when a person stops fighting means they’re mentally checked out? Ignored all her pleas to see her point?\n\n\n\n7. What’s sad is that you WILL marry the next person within a year or 2, like you should have with your current partner, and it will hurt her on unspeakable levels.\n\n\n8. This is not TikTok or IG, you don’t get cookie points for being quirky and blaming brain differences like ADHD on your behavior, you lived with your partner 10 years just fine.\n\n\n9. You don’t know what was going on for the past 10 years with her, how many people she lost, how many people hurt her or she hurt, how many times people who hate her knew exactly how to wound her, using this, banking on the fact that she’s a 10-year girlfriend, a forever girlfriend, a placeholder, how many arguments she had with those close to her to convince them and herself that you do love her and you will propose, and she did that long enough until it became too long to even be worth mentioning. You humiliated her on levels you can’t even begin to imagine.\n\n\n10. You failed to notice the contempt, the tolerable level of unhappiness, and possibly the scattered resentment, and made it 10 times worse by being happy she stopped talking about marriage a “couple of years ago” like you put it. When was talking to your partner about anything in life less and less ever a good sign?\n\n\n11. You both stayed out of convenience, not wanting to uproot your lives, I’m sure there’s love in there as well, but love is not enough to sustain living in this world.\n\n\n12. What’s worse is that you never had a proper or valid reason not to propose for that long, let alone 10 years, you lived with her everyday, you were completely fine.\n\n\nETA\n\n\n13. You could have gotten courthouse married, then spent a millennia planning a wedding it would’ve been okay, if being center of attention at your wedding was too much for your anxiety, the wait would have been justified since you’re legally married, can take practical life risks/decisions. A wedding ceremony is a social and an emotional experience.\n\n\nCountless solutions, you chose none.",
      "created_utc": 1723451766.0,
      "score": 348
    },
    {
      "id": "lhoh471",
      "body": "That’s a large part of the reason why I also declined a proposal after dating a guy I was madly in love with for 10 years. By that point I knew it wasn’t something he wanted and I had zero desire to force someone into something. She likely feels the same ",
      "created_utc": 1723426141.0,
      "score": 155
    },
    {
      "id": "lhmwwnz",
      "body": "It sounds like the 10 year thing is just one reason, but that she's been contemplating breaking up with you for a while and was maybe on her way out already. That really is far too long for someone to wait for commitment. Lesson learned, I guess.",
      "created_utc": 1723405631.0,
      "score": 720
    },
    {
      "id": "lhnr22j",
      "body": "She said no because it made her realize like, “damn, I really waited all this time. Wtf was I thinking? I could’ve been w someone who wanted that with me”",
      "created_utc": 1723416051.0,
      "score": 132
    },
    {
      "id": "lhmswhm",
      "body": "Well, why did you wait so long? Commitment issues? How old is your gf? She may be going for an exit plan now.",
      "created_utc": 1723404276.0,
      "score": 650
    },
    {
      "id": "lho5hpl",
      "body": "I left someone after living together for 6 years. He refused to even discuss an open ended engagement. After I left he came around and proposed but it was too late. I didn’t leave as a message or to manipulate. He missed his chance and took me for granted.",
      "created_utc": 1723421538.0,
      "score": 60
    },
    {
      "id": "lhnxs9b",
      "body": "I hate that I find this relatable. It’s been six years with two dogs, a cross country move, and opening a business together for us and yet here we are-still just the girlfriend 🫤\n\nI knew I shouldn’t read this post because I would hurt my own feelings and I did 😩\n\nReading through some comments honestly a lot of them are pretty valid imo but that doesn’t mean I have to like that 😑🥲",
      "created_utc": 1723418575.0,
      "score": 54
    },
    {
      "id": "lhn0fo8",
      "body": "I don't understand why it's a big deal for you. You never cared enough to give your gf a timeline after many years. You didn't care why she stopped asking you about marriage. You just waited until you were comfortable. You saw her as a gf when she wanted to be a wife for 10 years.\n\nIMO she accepted her place in your life and stopped seeing you as her future husband. That's expected after 10 years of waiting. She accepted your stance for so long. Maybe you should accept hers from now on.",
      "created_utc": 1723406819.0,
      "score": 647
    },
    {
      "id": "lhn0csp",
      "body": "“Wifey material” or whatever you want to call it, don’t want something or anything, they have to beg for. And when women stop fighting about something and you guys think it’s all good, you couldn’t be farther from the truth. You’re an idiot dude.",
      "created_utc": 1723406792.0,
      "score": 672
    },
    {
      "id": "lhn4kzi",
      "body": "OP’s comments confirm my suspicions - he simply wasn’t bothered to ask much earlier on, and she essentially decided that she no longer wanted him to",
      "created_utc": 1723408200.0,
      "score": 274
    },
    {
      "id": "lhoq2vg",
      "body": "[deleted]",
      "created_utc": 1723429813.0,
      "score": 47
    },
    {
      "id": "lhngkvy",
      "body": "I'm sorry.\n\nIt sounds like she wanted and waited... and told you how important marriage was to her...and you did nothing. For YEARS. Your warning sign wax that she stopped bringing up marriage for the past 2 years. And you didn't address that until now. You didn't check in avoid marriage for the past 2 years? At all? Didn't reassure her she was the only woman you could see yourself marrying? You just ignored it for years until you proposed?\n\nEventually, she sadly gave up. \n\nShe realised that you simply didnt prioritise it like she did. And she stopped being excited by the idea of marrying you. Because when someone has to keep begging and pleading and waiting for something, they eventually stop caring. They fall out of love. It destroys their self esteem.\n\nMaybe you can talk to her, but I genuinely think she probably gave up years ago, and it's probably fat too late to rectify things now.",
      "created_utc": 1723412267.0,
      "score": 131
    },
    {
      "id": "lhmt373",
      "body": "What made you decide after 10 years? Was she pressuring you? ",
      "created_utc": 1723404339.0,
      "score": 472
    },
    {
      "id": "lhnz41p",
      "body": "DAMN. I was expecting you to be like 26 or 27 and then the decade would make sense to me. Dude in the comments said she’s 38 😭 she’s clocked OUT now",
      "created_utc": 1723419078.0,
      "score": 43
    },
    {
      "id": "lhr1t6n",
      "body": "My ex did something similar, but much more fucked up. We dated for ten years too, and since the last few years he’d tell me he’s gonna “propose next year” every year lol. It got to the point where I stopped expecting it to ever happen. \n\nThree months ago he physically assaulted me and we broke up. We met last weekend for what was supposed to be “closure” but he ended up confessing he was cheating on me with my best friend for the last six years, and I realised he’s likely been in love with her our entire relationship. \n\nTen years. Sigh.",
      "created_utc": 1723473418.0,
      "score": 36
    },
    {
      "id": "lhn0bt9",
      "body": "I bet you will be quicker with the next girlfriend.",
      "created_utc": 1723406783.0,
      "score": 386
    },
    {
      "id": "lhmzh9n",
      "body": "May I ask why it took 10 years? Because honestly I wouldn't feel appreciated or loved or wanted if after a whole decade my SO finally proposes. That would be the moment I'd realized I should have left sooner.",
      "created_utc": 1723406496.0,
      "score": 302
    },
    {
      "id": "lhodapw",
      "body": "As she should have. She knew she was a place holder & now either your actual dream girl got married or maybe you shot your shot & got denied. Either way,no one is taking that long to propose if they're sure & I love that she's setting herself up to be able to leave you whenever she's good & ready with less red tape to get through",
      "created_utc": 1723424624.0,
      "score": 33
    },
    {
      "id": "lhpemmn",
      "body": "There’s a lot of videos online now about “shut up rings”.  \n\nShe knows this is a shut up ring.\n\nSomething about the proposal or around the time of the proposal made her realize it was a shut up ring.\n\nShe doesn’t want to be the woman you marry to keep quiet, give you sex, and clean up after you while you wait for the woman you really want to marry and will eventually divorce her for.",
      "created_utc": 1723442242.0,
      "score": 32
    },
    {
      "id": "lhmwwyu",
      "body": "I’ve been in her shoes. Waiting ages…wondering why he hasn’t done it…he has now (after we were married) admitted that he doesn’t know why he waited so long to ask me. And I’m not sure it’s rational but I can tell you it felt terrible waiting…wondering why, wondering what you’ve done wrong. \n\nIn the end though it worked for us because I agree that when and how he finally asked was perfect for us (in our living room the day we bought our first house 🥹). So have a think about everything around this. Shes not just upset about how long it took…but she might be upset by how you make her feel.",
      "created_utc": 1723405634.0,
      "score": 263
    },
    {
      "id": "lhnqud0",
      "body": "Curious- what made you ask her now after 10 yrs? Did you sense her getting distant?\n\nI just mentioned this to some guy on Reddit earlier today who was complaining that his girlfriend constantly asks when they will get engaged. He’s annoyed by this. They’ve been together 7 years! He said he wanted to be with her, but that he wasn’t ready? I warned him that he’s getting to the point where she’s just going to be done and gone. \n\nA little insight to how many women work- It will seem to come out of nowhere. When we get dismissed repeatedly or don’t feel we are heard or blown off, or feel we have to nag about something that never gets done because something else is always put ahead of it, a little piece of us slowly dies off because we feel we don’t matter to our partner. Eventually we will start pulling away and detaching ourselves from the relationship and mentally preparing ourself to leave. We won’t warn you either, we figure if our nagging didn’t do anything then this will also fall on deaf ears as well. \n\nI actually watched a guy on TikTok explain this very thing to men. He told guys that when a woman stops nagging or not bringing stuff up anymore, and you think the relationship is finally going great because we aren’t fighting anymore- that’s when you should be worried. Because that’s a good sign that we’re giving up on the relationship. We don’t care anymore and we won’t tell you because why bother. And once a woman tells you that they’re done, it’s generally too late. That’s usually when guys like to try and suddenly fix everything all at once but unfortunately, by that point, we’re ready to walk out the door.        \nThe comment section was full of women agreeing and saying that they were ready to leave their partner and that their partner had no idea. Most said that their partner will most likely be blindsided. That these guys ignore their partners to the point that they don’t even notice that their partner is mentally checking themselves out of the relationship.",
      "created_utc": 1723415971.0,
      "score": 113
    },
    {
      "id": "lhnu1fi",
      "body": "I will say from experience that if you wait 10 years, she already made up her mind she is fine not being your wife.",
      "created_utc": 1723417164.0,
      "score": 26
    },
    {
      "id": "lhpbfak",
      "body": "She dodged a bullet when I see your comments. Hope she finds someone who doesn’t take 10 years to want to marry her",
      "created_utc": 1723440342.0,
      "score": 25
    },
    {
      "id": "lhngbt8",
      "body": "I’m gonna be honest, I’m someone who thinks the same way. If it takes 10 years for a guy to want to marry me then I’m not interested. If it took 10 years then the real answer is that they just didn’t want me.",
      "created_utc": 1723412180.0,
      "score": 105
    },
    {
      "id": "lhmuqi9",
      "body": "My SO and I have been together for 10 years, and sadly I totally understand your girlfriend’s pov.  I wouldn’t say yes if he popped the question now either.\n\nEdit: there are a million different reasons why and Reddit users aren’t satisfied with any, so if you get it, you get it.",
      "created_utc": 1723404897.0,
      "score": 559
    },
    {
      "id": "lhnr01x",
      "body": "OP should talk to the guy that posted how he’s in a 6 yr relationship and has had a ring for 1.5 years but isn’t ready to propose yet. And can’t understand why his girlfriend is getting frustrated. These two sound like they’d have a lot in common.",
      "created_utc": 1723416030.0,
      "score": 47
    },
    {
      "id": "lhofw16",
      "body": "My friend has been with his gf for 14 years proposed and she said the same thing",
      "created_utc": 1723425651.0,
      "score": 46
    },
    {
      "id": "lhosdkg",
      "body": "God reading this and all of the replies made me cry. In 2020 I finally worked up the courage to leave my ex after the exact same thing happened. He knew I didn’t want to wait longer than three years, and he even hinted that a proposal was coming soon. He asked what kind of ring I wanted. He never did. I cried myself to sleep so many nights. \n\nI stopped bringing it up and he seemed so much happier, but I just couldn’t do it. One morning I walked right up to him and said “You’re never going to marry me are you…” He said “No… I’m sorry,” And I moved out the following day. I felt like such a fool. \n\nP.S My current partner proposed after one year and I didn’t even have to ask or drop hints 🥲😭",
      "created_utc": 1723430805.0,
      "score": 46
    },
    {
      "id": "lhpriqo",
      "body": "I knew I shouldn’t have read this post, but I did anyways.\nVery relatable.\n10 yr relationship with no ring.\nHave asked and have gone shopping for said ring.\nWe don’t have a miserable life… we are happy. 1 child and 1 on the way. But I have mentioned marriage is important to me…. And reading all these comments just makes me sad and wonder all sorts of things.",
      "created_utc": 1723450719.0,
      "score": 21
    },
    {
      "id": "lhn2zbs",
      "body": "10 years???? Jesus.",
      "created_utc": 1723407666.0,
      "score": 102
    },
    {
      "id": "lhmzvxm",
      "body": "Dude … nobody wants a “shut up “ ring. She knows she has been a placeholder while you tried to find your dream girl. Now you want her to be the “might as well “ wife? Am glad she said no to your bullshit",
      "created_utc": 1723406632.0,
      "score": 443
    },
    {
      "id": "lholxpk",
      "body": "My fiance and I have been together for 12 years. He proposed to me after 5 and I ended up breaking up with him for various reasons including not believing he really wanted to. He got real messed up from that, but we ended up getting back together. After 6 years I was getting pushy about it again but had essentially given up and understood that I wasn’t going to get married. He ended up proposing again. It’s going on 6 months and I’ve thought about getting married but we are just not in the right place in life. Idk if I want to get married anymore, or have a small ceremony and wear the rings. \n\nI *really* wanted to get married young. It was important then that he showed me that. Now, I know I’m important and I would argue he cares for me more now, but I just don’t care as much about a wedding, if I have one I want it to be nice, but ultimately it doesn’t matter. I already chose my life with him, the wedding itself and marriage now is irrelevant. \n\n\nWomen slowly stop caring. She may not want to be apart from you, she just may not care anymore and have accepted who she is and the relationship.",
      "created_utc": 1723428085.0,
      "score": 19
    },
    {
      "id": "lhn372x",
      "body": "[deleted]",
      "created_utc": 1723407736.0,
      "score": 66
    },
    {
      "id": "lhnofjy",
      "body": "This sounds like the AITA post where a man was upset because his gf was nagging him for a proposal after 7 years.\n\nHe got the ring 1 1/2 years ago but is waiting til he is ready.\n\nOne of the comments warned him that when she stops asking, it means she is planning her exit.\n\nSounds like what happened to OP here.",
      "created_utc": 1723415076.0,
      "score": 37
    },
    {
      "id": "lhn4yw4",
      "body": "She gave up on you and maybe herself and just accepted this is her life. You two need some serious discussions or she will find new guy first time someone flatters and makes her feel good.",
      "created_utc": 1723408329.0,
      "score": 66
    },
    {
      "id": "lhn8gsq",
      "body": "I feel bad for her she 38 and you wasted prime years of her life because of “adhd and your anxiety” did you get help in that time ? She probably stayed because she didn’t want to start over and at this point when you said she stop asking about marriage she was already in her middle 30’s she just accepted what it was",
      "created_utc": 1723409501.0,
      "score": 71
    },
    {
      "id": "lhmulm4",
      "body": "You waited until she was 38 to finally decide on her? What is wrong with you, also I want to know why she didn't kick you to the curb after 2 yrs? YTA. Don't cry over here and don't blame adhd and anxiety as you said in one of your responses. You proposing after 10yrs just implies you couldn't find better and decided she stuck with you so what the hell.",
      "created_utc": 1723404852.0,
      "score": 567
    },
    {
      "id": "lhn08ww",
      "body": "She's not wrong though is she?",
      "created_utc": 1723406756.0,
      "score": 110
    },
    {
      "id": "lhnl6c1",
      "body": "She had accepted the fact she was never going to get a ring and accepted you were waiting for the real \"right one\" to come along. Now she feels like you're settling for her. \n\nWhile I don't think you should put a time limit on things, 10yrs? My dude, come on, she would have been happy with a ring pop with the promise of a real ring down the line! It's not about the ring, it's about the love... \n\nThere is STILL a chance to save this, if you're lucky. Tell her she's always been wifey material, you have just recently felt you were FINALLY husband material for HER. Make this about YOU not being good enough for HER!\n\nGood luck, you're going to need it.",
      "created_utc": 1723413886.0,
      "score": 39
    },
    {
      "id": "lhnrsw7",
      "body": "It was probably a \"Shut up, already\" ring.\n\nHow many times did she beg to get married? She probably was just done and over it. I'm sure you noticed her indifference and got scared into proposing.",
      "created_utc": 1723416328.0,
      "score": 42
    },
    {
      "id": "lhn0h8u",
      "body": "Wow! Ten years! My cut off is two years. If nothing comes of the relationship during that time, then nothing will. \n\nYou wait ten years for a movie sequel, not a marriage.",
      "created_utc": 1723406834.0,
      "score": 160
    },
    {
      "id": "lhoap60",
      "body": "There's nothing to Do. She waited for you and you took too long, a few years too long it seems and she's moved on from wanting you in marriage. I'm not sure why she stayed in the relationship but she very clearly doesn't love you the way she once did. You gotta take a long look at yourself and man up to be a better partner for her going forward or for a new partner. And don't come up with some lame excuse ",
      "created_utc": 1723423589.0,
      "score": 11
    },
    {
      "id": "lhpcygm",
      "body": "I won't be surprised if she looks at it like a shut up ring, coz believe me if I was 38 and got proposed to after a decade...tsk.",
      "created_utc": 1723441238.0,
      "score": 13
    },
    {
      "id": "lhtyfjw",
      "body": "Can we please make 2025 the year we stop weaponizing ADHD and anxiety for literally EVERYTHING?? \n\nThere are millions of people with ADHD and anxiety who get engaged, married, buy houses, and start families all the time. \n\nPlease stop using it to excuse your bullshit. You're making the ADHDers, and the anxious look bad.",
      "created_utc": 1723507345.0,
      "score": 12
    },
    {
      "id": "lhnnits",
      "body": "[deleted]",
      "created_utc": 1723414738.0,
      "score": 58
    },
    {
      "id": "lhod67p",
      "body": "Please let her GO, she deserves better from some else",
      "created_utc": 1723424575.0,
      "score": 24
    },
    {
      "id": "lhqxl4c",
      "body": "You were so excited that it took you a decade to commit?",
      "created_utc": 1723471984.0,
      "score": 10
    },
    {
      "id": "lhn42uu",
      "body": "She doesn’t want to be your wife because you didn’t want to be her husband. You did fuck up.  Learn from your mistake.",
      "created_utc": 1723408033.0,
      "score": 69
    },
    {
      "id": "lho21zc",
      "body": "I read your replies and get why you waited. Tell her that she waited ten years for a question that you should have asked years ago. Now you will spend the rest of your life proving to her how much she means to you. Tell her you won't pressure her and just want to be with her .",
      "created_utc": 1723420200.0,
      "score": 9
    },
    {
      "id": "lhonpmt",
      "body": "The only way this makes any sort of sense is if you met in high school when she was 16 or something. You got in a relationship with her at 28 and waited till she was 38?!? You just wasted the prime years of her life when she could've been out there with a real husband and 2 kids already.",
      "created_utc": 1723428823.0,
      "score": 9
    },
    {
      "id": "lhsc1xu",
      "body": "Why did it take you TEN YEARS?",
      "created_utc": 1723488044.0,
      "score": 9
    },
    {
      "id": "lhophcb",
      "body": "I think she is right actually. A wise person.",
      "created_utc": 1723429562.0,
      "score": 21
    },
    {
      "id": "lhpppwd",
      "body": "If she's the one why did you wait so long? I proposed within the first year of meeting my one and I grew up watching everyone including my parents have a real shitty marriage. \n\nSo why?",
      "created_utc": 1723449485.0,
      "score": 10
    },
    {
      "id": "lhstqy6",
      "body": "Why did you propose after 10 years? Was it a shut up ring? Cause if it was me after 10 years. I'd assume it was a shut up ring. Nobody wants that.",
      "created_utc": 1723493548.0,
      "score": 8
    },
    {
      "id": "lhohyk0",
      "body": "If you really loved her, you would have cared about her time table for getting married, and not just your own. Let her find someone who loves her like she deserves.",
      "created_utc": 1723426479.0,
      "score": 15
    },
    {
      "id": "lhnhal8",
      "body": "I mean, you brought this on yourself. She told you what she wanted for years and you ignored it. That’s on you. Don’t be surprised when she leaves you for someone who won’t wait ten years to realize she’s the one.",
      "created_utc": 1723412514.0,
      "score": 31
    },
    {
      "id": "lhnipk0",
      "body": "My ex husband did that.  He proposed because I told him if we hit 10 years and weren't married id be out.  No matter how many kids no matter what. He knew full well I wanted to be his wife not a fucking girlfriend. Spoiler.  We were only married 4 years before I left.  It did not get better, I got more resentful as time went on.  I'm mostly angry that I didn't leave way sooner than I did. She will most likely walk away now. Congrats. You have now also caused a permanent rift in her mind for anyone in the future too. Go be comfortable by yourself and don't drag anyone along with you unless you KNOW they don't want marriage.",
      "created_utc": 1723413014.0,
      "score": 32
    },
    {
      "id": "lhnkj1o",
      "body": "She’s 38 and you waited 10 years to propose? LOL you’re a fucking tool. I hope she leaves you.",
      "created_utc": 1723413653.0,
      "score": 58
    },
    {
      "id": "lhnjdjf",
      "body": "Sooo are you gonna take this lying down or try to earn her hand dude? I'm all for this to work out like a romcom but you have to see if you're even husband material after doing something like this to her\n\nFrom your other replies it sounds like she's looked out for you, taken care of you, motivated you, and loved you for years- have you done all that for her? And now that you were ready to marry her what would have changed to warrant a marriage you know?",
      "created_utc": 1723413245.0,
      "score": 16
    },
    {
      "id": "lhop351",
      "body": "This is so sad.",
      "created_utc": 1723429398.0,
      "score": 8
    },
    {
      "id": "lhpbvva",
      "body": "All I can say is that she's right.",
      "created_utc": 1723440611.0,
      "score": 8
    },
    {
      "id": "lhpc9wu",
      "body": "You shouldn’t have waited that long. It seems like you were keeping your options open and decided to settle with her when you couldn’t find anyone else",
      "created_utc": 1723440837.0,
      "score": 7
    },
    {
      "id": "lhpdisf",
      "body": "OP fucked it. How do you wait 10 years? Especially after having discussions. What a waste of time for you both.",
      "created_utc": 1723441571.0,
      "score": 8
    },
    {
      "id": "lhmyr7e",
      "body": "Im somewhat confused by her answer and her still being your girlfriend. Seems like she would have realized \"hey this guy is taking too long im gonna dump him\" like a few years ago.",
      "created_utc": 1723406253.0,
      "score": 90
    },
    {
      "id": "lho9k0p",
      "body": "I seriously doubt you love her. If you did, you wouldn’t have waited 10 years to propose. You spent years waiting to see if someone better would come along and finally decided to just settle. She deserved better.",
      "created_utc": 1723423136.0,
      "score": 23
    },
    {
      "id": "lhodoap",
      "body": ">and she said something along the lines of\n\nCould be the fact that you obviously didn't even listen enough to remember what she said",
      "created_utc": 1723424773.0,
      "score": 24
    },
    {
      "id": "lht28ln",
      "body": "you both wasted 10 years of her life.",
      "created_utc": 1723496177.0,
      "score": 7
    },
    {
      "id": "lhtoecj",
      "body": "Experiencing this from your partners side 💔 I’ve been with my other half 10 years, we discussed marriage tones over the years and he assured me it would happen at the perfect time. Two children later and still no ring, he see’s it as an expensive event we would need to plan which he doesn’t have an interest in so ‘what’s the big issue’, since I ‘know’ he doesn’t want anyone else and is happy at home. I see it as having gave him two amazing children, and the best 10 years of my life. If that doesn’t warrant a marriage sized commitment then what the hell does. Lost all interest and excitement surrounding weddings now, important family members have passed away which we both discussed how important it was that they were here for it. As much as I am happy for friends and family getting married, my heart breaks a bit more at each event knowing this is something I’ll never have and the resentment eats away that bit more 💔",
      "created_utc": 1723503725.0,
      "score": 7
    },
    {
      "id": "lhn1uzj",
      "body": "My humor is way too dark for this",
      "created_utc": 1723407295.0,
      "score": 26
    },
    {
      "id": "lhnfl47",
      "body": "Tbh I wouldn't stay with someone if it took that long, figure after a couple years you should know if you want to be with them for the long haul or try and find that person elsewhere and end the current relationship.",
      "created_utc": 1723411924.0,
      "score": 13
    },
    {
      "id": "lhmyrxz",
      "body": "More people should do that! I agree with her.",
      "created_utc": 1723406260.0,
      "score": 50
    },
    {
      "id": "lhmya96",
      "body": "Ask her again, tell her “she was always the one and you didn’t think you were.”  Do it fast though, if you wait it looks worse.\n\nIf she says no again, consider starting over because a no to a marriage proposal almost always ends the relationship especially if marriage is your goal.",
      "created_utc": 1723406096.0,
      "score": 27
    },
    {
      "id": "lhn7re7",
      "body": "She was probably doing wife things for 8 years, thinking it would be any day now. Good for her telling you no.",
      "created_utc": 1723409267.0,
      "score": 37
    },
    {
      "id": "lhnfy7a",
      "body": "She gave up on you years ago.",
      "created_utc": 1723412051.0,
      "score": 12
    },
    {
      "id": "lhnlask",
      "body": "It would have been more how you treated her...was the proposal a last ditch effort to stop her leaving you?",
      "created_utc": 1723413929.0,
      "score": 13
    },
    {
      "id": "lhn5898",
      "body": "Good for her!",
      "created_utc": 1723408415.0,
      "score": 34
    },
    {
      "id": "lhoh6pw",
      "body": "Why did it take so long for you to propose? Ten years is a long time to wait.",
      "created_utc": 1723426169.0,
      "score": 6
    },
    {
      "id": "lhooqml",
      "body": "10 years? If you guys started dating when you were teens perhaps but I honestly don't blame her. \n\nSounds like she was ready long ago and at some point she just gave up on getting married. Maybe she's amenable to keep dating long term? Like a marriage in every way without the ring and a wedding?",
      "created_utc": 1723429252.0,
      "score": 8
    },
    {
      "id": "lhp1p7j",
      "body": "She’s been checked out for a long time.",
      "created_utc": 1723435113.0,
      "score": 7
    },
    {
      "id": "lhp6i91",
      "body": "It's so damn immature of both you and your girlfriend. She was 28 when you started dating, and you didn't think it would be worth it to marry in a few years? Waiting till almost 40 while you've been in a committed relationship for so long? That would hurt anyone. And what was she doing? So she wanted to marry you (since you two had fights about it, according to you, which, also, you didn't get the signs dude? Tf man. Are you a kid?) but she didn't propose outright, neither did she breakup, and when you propose, she says no? So, she had the resentment building for all these years, and did nothing, and now has said no. What's the end game then? Breakup? \n\nIf both of you were looking to settle down in life, where were your priorities? She's 38. Unless you've a Hollywood tier age gap, I'm assuming you're between 33 and 43 yourselves. Do you not wanna settle down? Whole adults with conversational skills of rocks while in a relationship. If you cannot communicate, you're solely existing together and there's barely any \"relationship\", it's as simple as that.",
      "created_utc": 1723437602.0,
      "score": 6
    },
    {
      "id": "lhprs42",
      "body": "Why did it take you so long?",
      "created_utc": 1723450896.0,
      "score": 6
    },
    {
      "id": "lhptf6v",
      "body": "Just for context what age are you both? Friends of mine didn’t get married until 10 years into their relationship but they started dating at 15 so I think that’s an important thing to note.",
      "created_utc": 1723452026.0,
      "score": 5
    },
    {
      "id": "lhrvm7g",
      "body": "As someone who waited nine years. And ended it cause he wouldn’t propose. She doesn’t see you as her husband, she did once. But you took too long and resentment and pain has taken the place of the love she had",
      "created_utc": 1723482954.0,
      "score": 5
    },
    {
      "id": "lhs5i1k",
      "body": "I get her point but why did she waste her time being with you if she wanted to get married and you weren’t ready? Why not break up in the first place?",
      "created_utc": 1723486001.0,
      "score": 6
    },
    {
      "id": "lht7v3p",
      "body": "I suggest you sit down and speak with her about your future. I understand how hard that reply must hit you. \n\nDo you both want to stay together now?\n\nIf so, on what terms?",
      "created_utc": 1723498001.0,
      "score": 6
    },
    {
      "id": "lhwkk7g",
      "body": "“I don’t know what the fuck to do.” - you can make your peace with just being partners like she did",
      "created_utc": 1723554498.0,
      "score": 6
    },
    {
      "id": "lipbcwh",
      "body": "I’m going spill my guts here… but I’m 5 years into my current relationship and no 💍 as of yet… im in deep with him… living together, kids, everything and most ppl I work with assume I’m married… Earlier this year something crazy and shocking happened, I ended up saving his life. He fully recovered and is doing well.   Prior to the incident all I could think about was this man marrying me. I was doing anything and everything I could think of to be the perfect wife and hopefully get a ring. After the incident he said multiple times that he wants to marry me and he wants to buy a ring. Those were just words tho..bc no ring, no proposal and he’s never even offered to take me shopping to look at rings.   I have completely stopped talking about marriage. I havent mentioned it at all in 6 months…  If he actually takes 5 more years to propose … I doubt we will still be together   It’s actually humiliating for a woman to be with a man who won’t marry. I also believe the love fades away slowly as more time goes by.",
      "created_utc": 1723981324.0,
      "score": 6
    },
    {
      "id": "lhmxxic",
      "body": "Serves you right",
      "created_utc": 1723405977.0,
      "score": 87
    },
    {
      "id": "lhn65lj",
      "body": "I don’t blame her. I feel the same way and it’s been almost 5 years…",
      "created_utc": 1723408730.0,
      "score": 14
    },
    {
      "id": "lhne4qx",
      "body": "Oof, I don’t blame her though. I’d probs react the same way",
      "created_utc": 1723411418.0,
      "score": 16
    },
    {
      "id": "lhn3m5l",
      "body": "3-4 years tops.Stop wasting people's time. \n\n\nImagine being with someone for 10 years and doubting if the day will ever come.You proposed luckily but i know there are plenty of men who dont and wont .Its not okay to waste someone's time",
      "created_utc": 1723407878.0,
      "score": 23
    },
    {
      "id": "lhn2qz8",
      "body": "Ha!\n\nWell done 🤦🏻‍♀️\n\nThis is what happens when you take too long. Sigh.",
      "created_utc": 1723407589.0,
      "score": 30
    },
    {
      "id": "lhoaddb",
      "body": "You confirmed to her that it wasn’t you disliking the idea of marriage, it was you disliking the idea of being married to *her*. Whether you see it this way or not, she now sees this as you accepting her as your consolation prize for not finding the One. I would honestly prepare to be broken up with over this.",
      "created_utc": 1723423459.0,
      "score": 10
    },
    {
      "id": "lhomph0",
      "body": "Everyone is asking what took him so long but what I’d like to know is why now ?",
      "created_utc": 1723428403.0,
      "score": 4
    },
    {
      "id": "lhpg2sn",
      "body": "Dude, why? What happened now that didn’t happen 6-7 years ago that you want to marry her? She is right.\n\nIf you had a nice job with possible promotions and raises but never got it because your boss is just not ready, how long would it take for you to hit up linkedin? I for sure wouldn’t stay there when I know I have the experience/knowledge/background/ambition and I still get iced out every time I bring it up.\n\nI’m surprised she didn’t leave after 5-6 years when nothing changed. She checked out of ever getting married. Maybe she loves you enough that she settled to not getting married and just living as a couple. Maybe she has been planning on leaving for a while now.",
      "created_utc": 1723443133.0,
      "score": 6
    },
    {
      "id": "lhqa7uw",
      "body": "Ask her if she still plans to marry someday. (Just not you) If she says yes or \"I don't know\", it's time for you both to move on. You were just taught an important lesson.",
      "created_utc": 1723462381.0,
      "score": 5
    },
    {
      "id": "lhqby0y",
      "body": "If that’s how she feels then I guess it’s more a discussion of will she forever resent you for that and will you forever feel punished for it.",
      "created_utc": 1723463222.0,
      "score": 5
    },
    {
      "id": "lhqo01c",
      "body": "She doesn't love you anymore. She's mentally checked out and she'll just wait to see her options. She'll dump you and you'll be the one that will regret everything.",
      "created_utc": 1723468456.0,
      "score": 4
    },
    {
      "id": "lhqpxdn",
      "body": "Here is the advice you NEED to hear. If you asked her to be your wife (the ultimate end to dating) and she said no (because you took so long) then your relationship has ended.\n\nShe has basically told you, you are roommates with benefits.",
      "created_utc": 1723469198.0,
      "score": 4
    },
    {
      "id": "lhs6f2q",
      "body": "Only reason I waited so long is I couldn’t afford the ring she wanted until recently. Anxiety and ADHD are not an excuse. Sorry man.",
      "created_utc": 1723486289.0,
      "score": 4
    },
    {
      "id": "lhv25d1",
      "body": "She’s been a girlfriend for 10 years and most likely doesn’t want to be a “fiancé” for 10 more because she knows that even if she accepted you would never let her set a date. Do her a favor and let her go so she can find someone who can’t wait to make her his wife.",
      "created_utc": 1723523400.0,
      "score": 6
    },
    {
      "id": "lhv8y35",
      "body": "I hope she finds the love of her life. Ten years man? That's a sad movie, if anything. Please let her go.",
      "created_utc": 1723527114.0,
      "score": 6
    },
    {
      "id": "lhzhhpl",
      "body": "is she not allowed to change her mind just as you changed yours? imagine how she felt when you said no about marriage the first time. i guess now you don't have to imagine",
      "created_utc": 1723589693.0,
      "score": 6
    },
    {
      "id": "lhn0k2d",
      "body": "You blew it. Hope the power trip of the procrastination was worth it",
      "created_utc": 1723406860.0,
      "score": 43
    },
    {
      "id": "lhnbfax",
      "body": "If you take 10 years to propose to me I would say no too, but honestly she should've left you years ago instead of waiting a whole DECADE to tell you that she wasn't gonna marry you, because if we're together more than 5 years and there isn't a ring, im just gonna peace out and if you marry the next girl then congrats, I wish you well and I just wasn't your soulmate but i'll find mine!",
      "created_utc": 1723410486.0,
      "score": 12
    },
    {
      "id": "lho53ry",
      "body": "I can't imagine what you are going through.  This would be really hard.  I assume she knows your struggles.\n\nSince she said no, now you need to ask her what future she sees for you two.  You clearly see a future with her.  Her saying no has not changed that for you.  However, you clearly hurt her a lot by waiting so long.  So now, you need to ask her what future she sees for the two of you and if you are in it long term.  You will have to decide if what she says is OK. \n\nIt's now your turn to be in limbo.  You should start with saying that you want to be closer to her, that you accept you failed and now you just don't want to lose her.  That you won't stop hopping that she one day comes to see you as \"husband material\".\n\nIt sucks, and I think you now realize that she could duck out of this relationship at any point. So now you will have some anxiety due to that.  \n\nYou have said she doesn't want to end the relationship.  That is good.  Things can change.  Make it clear to her that you are looking to grow old with her, and that you are willing to do it on her terms.  However, if she should ever change her mind, you are all for it.",
      "created_utc": 1723421386.0,
      "score": 10
    },
    {
      "id": "lhpv815",
      "body": "NOW she’s “the woman you love”. Who has she been in the DECADE prior?",
      "created_utc": 1723453259.0,
      "score": 12
    },
    {
      "id": "lhn2kmw",
      "body": "Count your losses at least she doesn’t want to break up with you",
      "created_utc": 1723407532.0,
      "score": 22
    },
    {
      "id": "lhmsv5d",
      "body": "I get where she's coming from, but at the same time, why did she stay with you that long if she didn't want to marry you anymore? It doesn't makes sense. It's probably nerves from being shocked that you actually proposed after all this time. Talk with her and give her some time. Reassure her that you actually do want to spend your life with her, and give her time to absorb and process that. She wouldn't be with you for a decade if she no longer wanted to get married.",
      "created_utc": 1723404263.0,
      "score": 57
    },
    {
      "id": "lhn9008",
      "body": "You know, you could've gotten engaged a while ago, to show your commitment and then just waited a few years to get married so she at least knows your on the same page, but the fact that you didn't even want to do that looks quite suspicious on your part.",
      "created_utc": 1723409678.0,
      "score": 17
    },
    {
      "id": "lhmz8iu",
      "body": "She's a keeper (if you can). She knows her worth and calls you out when you're wrong.",
      "created_utc": 1723406415.0,
      "score": 43
    },
    {
      "id": "lhmzz0g",
      "body": "I saw a TikTok on this and the guy was throwing this massive tantrum while the girl was just shrugging her shoulders and saying \"10 years, 10 YEARS!\" They broke up. You two should too. \n\n\nAnd stop wasting women's time.",
      "created_utc": 1723406662.0,
      "score": 42
    },
    {
      "id": "lhpsnha",
      "body": "I am so happy she made the right decision.",
      "created_utc": 1723451494.0,
      "score": 11
    },
    {
      "id": "lhnbui1",
      "body": "Are you guys still together? Where are you gonna go from here? \n\nYou will have to pull something big to turn this around.",
      "created_utc": 1723410631.0,
      "score": 4
    },
    {
      "id": "lhof1c7",
      "body": "Don’t tell the girl you’re meant for forever she isn’t good enough. C’mon, 101 here.",
      "created_utc": 1723425315.0,
      "score": 5
    },
    {
      "id": "lhpjly5",
      "body": "After 10 years, and her saying No. I need more details. How did you propose? Was it well thought out? Romantic? Did you involve her friends/family?\n\nIf you did all of those things, and she still said no then yeah, it's over.  \nIf you didn't, and just tried to propose to her, in a manner that wasn't worth the 10 years wait, that might be the catalyst for the no",
      "created_utc": 1723445390.0,
      "score": 3
    },
    {
      "id": "lhpm1qz",
      "body": "My husband took 8 years to propose. We had talked about marriage multiple times and had agreed that we would get married, but that certain stuff would have to come first. 2 years into the relationship I knew I was going to stay with him, we moved in together etc, but we were young and still trying to build stable careers. We were from different countries and weren't sure which country we'd settle in, so life was uncertain even if the relationship wasn't. By the last couple of months before he proposed I got a tiny bit worried because we had sorted out all of our life stuff that we had agreed made it not a good time to marry. But then he proposed. Happily ever after etc.\n\nThere's nothing wrong with waiting to get married as long as you're both on the same page. Had you ever talked about marriage kids etc? What her expectations were and what her view on marriage is are important factors in judging how bad this is.",
      "created_utc": 1723446989.0,
      "score": 4
    },
    {
      "id": "lhpn561",
      "body": "Did you guys break up?",
      "created_utc": 1723447734.0,
      "score": 3
    },
    {
      "id": "lhqx1jx",
      "body": "Let’s say you only became aware that she wanted to marry you two years ago when y’all fought about it. She’s now dealt with 2 years of knowing you don’t want to marry her. You’ve gone through two days of knowing she doesn’t want to marry you. Can you imagine 2 years of the way you’re feeling right now? If she’s really the one, the only thing you can do is stay and try to convince her how badly you fucked up and how much you love her.\n\nAnd there’s a huge difference between her telling herself that you have an issue with marriage and the reality that you had an issue about marriage with her (for 10 YEARS).",
      "created_utc": 1723471794.0,
      "score": 4
    },
    {
      "id": "lhr9edi",
      "body": "I’m a woman and I’m genuinely confused why people are dunking on OP this hard and why his partners even upset.\n\nLike, marriage is a really serious thing, I don’t get why it’s wrong to wait. I feel like most people should wait inbetween 5-10 years. People who get married within 2-3 years are crazy to me. Like you hardly know each other at that point.",
      "created_utc": 1723475920.0,
      "score": 4
    },
    {
      "id": "lhrahpe",
      "body": "After looking at your post and replies it seems you're just not getting it at all. Stop thinking about yourself and think about her. Everyone here is only telling you how she is feeling and other side of it and you just keep saying \"that's a bullshit take\"  that's just showing you're not understanding and your close mindedness is exactly why you're in this position in the first place. She stopped asking about marriage bc in her eyes she's replaceable to you and now she doesn't want to be tied down to someone when it took them 10 years to realize she was important. Maybe to you that's not true but it doesn't matter how you feel about that. It's about how SHE feels. Maybe try caring about that first before yourself for a change.",
      "created_utc": 1723476274.0,
      "score": 5
    },
    {
      "id": "lhrmz1i",
      "body": "Some women stay for way too long. Some have to mourn what could have been before leaving or get the \"ick.\" Others could take the stance that this is all the relationship is now  They don't want or expect anymore based on their partners' actions. Some have the light snuffed out by their partner, and their partner doesn't even realize until it's too late.",
      "created_utc": 1723480249.0,
      "score": 4
    },
    {
      "id": "lhspd80",
      "body": "My ex-husband took 7 yrs to ask me. I was so excited for years and when the moment came it wasn’t a big deal. He kept saying he wanted to make sure I was the right one. We had already been living like a married couple. He took too long for that moment. We lasted a few more years and divorced.",
      "created_utc": 1723492197.0,
      "score": 4
    },
    {
      "id": "lhtbbts",
      "body": "I feel like you’re getting too much hate for this post. \n\nYeah sure, it’s an issue you guys haven’t talked about marriage, timing, hopes and dreams about the whole process. But I don’t think it has to be the end of it all, I think you need to do what you should have done to begin with - talk about it with her. Ask how she wants to proceed, tell her how you feel and felt about it for the past decade.\n\nMaybe she’ll get it, if she truly still loves you?",
      "created_utc": 1723499153.0,
      "score": 4
    },
    {
      "id": "lhu0pvz",
      "body": "I’m not gonna lie, she wasted her own time by staying so long. But in reality, I don’t know where yall live, you don’t have to tell people how long yall been married. Most people don’t care.",
      "created_utc": 1723508196.0,
      "score": 5
    },
    {
      "id": "lhv6jb3",
      "body": "10 years is *way* too long, in my perspective.\nIf a man who is financially stable (I bring this up because that's the most common reason men \"don't propose earlier\") doesn't propose within 1-2 years, then he's most likely hesitating about you. Or settling. Why would you want a man who hesitates about you? I personally want someone who's so sure about me from the beginning, there's no question about it. Within a few months, men will know if they want you long term or not. Men KNOW and women are aware of this. If we stick around longer than necessary, it's just out of attachment. Women always know where we stand in men's lives because we pay very close attention to how we are treated.",
      "created_utc": 1723525737.0,
      "score": 5
    },
    {
      "id": "lhw1kjf",
      "body": "10 years?????",
      "created_utc": 1723545690.0,
      "score": 3
    },
    {
      "id": "liyjnbb",
      "body": "You didn't want to marry her, now you don't have to. What's your problem?\nIf you're feeling guilty about running out her biological clock and ignoring her wants, or worrying that she has built resentment up in the relationship, that sounds like a you problem.",
      "created_utc": 1724111601.0,
      "score": 5
    },
    {
      "id": "ljjidnb",
      "body": "If you´re settling: leave, if you're not: keep proposing but never get mad/sad/any negative reaction when she says no ;)",
      "created_utc": 1724419143.0,
      "score": 4
    },
    {
      "id": "lhn5iya",
      "body": "Well it’s kinda embarrassing actually\n\nShe stuck around for years, you didn’t really want her, now you do??\n\nI guess her friends and family would think why bother with him?",
      "created_utc": 1723408516.0,
      "score": 10
    },
    {
      "id": "lho4und",
      "body": "Sounds like you love her only as an extension of yourself and not the person that she is and has been to you all this time.",
      "created_utc": 1723421286.0,
      "score": 13
    },
    {
      "id": "lhnpqzu",
      "body": "Why did she stick around for 10 years if she knew she was never going to marry you?  Just for the satisfaction of saying no?  Did you guys break up?  If not, and she doesn’t want to marry you, where does she see this going?  Soooo many questions",
      "created_utc": 1723415563.0,
      "score": 21
    },
    {
      "id": "lhqef1l",
      "body": "10 years 🤦🏽‍♀️? Her reaction is completely understandable.\n\nAfter you've been ten years together and no talk of marriage, the only two logical explanations in your partner's eyes is that you didn't want to marry her or you didn't want to marry anyone, ever, at all.\n\nShe probably thought after some time that you didn't want to marry anyone, ever. Now that you proposed, she concluded she was wrong; that you actually took a decade to decide if *she* was the one. \n\nI think you didn't do it on purpose... But unfortunately you've broken her heart 😞",
      "created_utc": 1723464386.0,
      "score": 8
    },
    {
      "id": "lhn18so",
      "body": "So wtf she stuck around for ?",
      "created_utc": 1723407090.0,
      "score": 35
    },
    {
      "id": "lhncnxe",
      "body": "What took you so long ?",
      "created_utc": 1723410912.0,
      "score": 7
    },
    {
      "id": "lhnj598",
      "body": "I really can’t blame her, honestly. If you’ve been together that long I’m sure you discussed marriage and 10 years is way too long to wait.",
      "created_utc": 1723413167.0,
      "score": 8
    },
    {
      "id": "lho67nc",
      "body": "I’m kinda on her side. Why did it take TEN YEARS to choose to marry her? Personally im not waiting more than 3-5 years before I get proposed to and 5 is pushing your luck. She has an L for staying that long and you have an L for taking that long to make up your mind. It doesn’t take ten years to figure out if you wanna get married or not",
      "created_utc": 1723421823.0,
      "score": 8
    },
    {
      "id": "lho778c",
      "body": "Wow after reading your comments. 10 years??? Bruh. From 28 till 38. Omg. Bless her heart she has some sorta iron willpower because my ass would have left. As she waited you should wait another 10 years before she says yes so it can even out lol.",
      "created_utc": 1723422211.0,
      "score": 10
    },
    {
      "id": "lhncquk",
      "body": "Women need to put time limits on how long to wait",
      "created_utc": 1723410940.0,
      "score": 13
    },
    {
      "id": "lhndp0u",
      "body": "Honestly, you taking so long to propose will permanently have harmed her ego, and it might not be the higher road, but it’s honestly better for the relationship in the long run if you get your ego harmed a bit too.\n\nIt’s embarrassing to tell people you’re finally getting married after 10 years. It’s humiliating.\n\nIt’s a lot easier to just say marriage doesn’t matter, and you’re life partners.",
      "created_utc": 1723411268.0,
      "score": 16
    },
    {
      "id": "lhnd33n",
      "body": "Why did it take you 10 years to propose? You should have explained.",
      "created_utc": 1723411057.0,
      "score": 10
    },
    {
      "id": "lhnbs8s",
      "body": "Op I think you need to talk to your girlfriend. There’s a lot of information missing here and I think even you might be oblivious to some. Why are you just now proposing after 10 years? Had you two discussed marriage? What would change if you two got married?",
      "created_utc": 1723410610.0,
      "score": 6
    },
    {
      "id": "lhnjjdf",
      "body": "Why DID it take you so long to propose?",
      "created_utc": 1723413303.0,
      "score": 7
    },
    {
      "id": "lhnmkpj",
      "body": "Why did she stick around for 10 years when she wanted to get married and it wasn’t happening?",
      "created_utc": 1723414389.0,
      "score": 5
    },
    {
      "id": "lhnnqys",
      "body": "[deleted]",
      "created_utc": 1723414822.0,
      "score": 5
    },
    {
      "id": "lho3x1m",
      "body": "Just because you took ten years to propose doesn't mean it took you ten years to decide if she is wifey material. You could've realized that from day one. That doesn't mean you yourself were ready to be married yet.",
      "created_utc": 1723420920.0,
      "score": 7
    },
    {
      "id": "lho9ww8",
      "body": "I’m curious if she was expressing wanting to be engaged and dropping hints all this time and you just shrugged it off… so when you finally did it, she felt like she got a shut up ring…",
      "created_utc": 1723423277.0,
      "score": 6
    },
    {
      "id": "lhp5lpr",
      "body": "Yeah man. No sympathy for you here. This is all on you. Maybe next time don't play dumb games when you've got something good going for you.",
      "created_utc": 1723437120.0,
      "score": 5
    },
    {
      "id": "lhq3fbe",
      "body": "This seems a little weird to me. If it bothered her that much, why not find her options? Or propose first? I can’t really fault you for not proposing earlier, as it should only be done when your ready to commit to your partner. If you marry for pressure purposes, it’s likely to build resentment. Which isn’t good for anyone. Yeah you maybe took to long but, my parents got married after 10 years. While others less than 2 years so who knows what the actual time limit for proposal is. \n\nFact is I think player should keep it pushing. She clearly has different future goals than you and some level of resentment for the treatment or lack of you gave to her feelings. I’m not blaming her as she’s entitled to how she feels. I can’t blame you because your entitled to feel ready when you are ready. There’s no real losers or winners here. Just people who are to hurt, afraid, and non-communicative to move forward or go back. So you’ve just been stuck in limbo and now your realizing that’s all you’ve accomplished relationship wise so far.",
      "created_utc": 1723458660.0,
      "score": 6
    },
    {
      "id": "lhqh4q2",
      "body": "Good for her! Can’t believe she even waited around that long!",
      "created_utc": 1723465609.0,
      "score": 5
    },
    {
      "id": "lhrfii5",
      "body": "I remember seeing a scene from a movie a few weeks ago with my bf (we’re reaching the 10 year mark in September). The scene was from a couple where the girl was certain he was going to propose, when he didn’t then she asked him to. The man refused so she said then and there that she was now officially single. My boyfriend turned to me and said “see, I don’t think she loves him then, just cause he’s not marrying her then she breaks up?”  And that’s the moment my mind kinda clicked with a “damn… the moment I’m waiting for is not coming, is it….?”",
      "created_utc": 1723477881.0,
      "score": 6
    },
    {
      "id": "lhncfwu",
      "body": "From personal experience that’s been in a similar situation, she probably checked out a while ago..and now that marriage is finally here and an option she wants out. Let her go",
      "created_utc": 1723410836.0,
      "score": 7
    },
    {
      "id": "lhnbh8m",
      "body": "Wow, You're probably not gonna  have a partner for much longer.",
      "created_utc": 1723410505.0,
      "score": 9
    },
    {
      "id": "lhnjdrt",
      "body": "Doesn’t this mean she doesn’t want to marry you at all?  I would have taken this as her wanting to break up especially if she is the type to date for marriage.",
      "created_utc": 1723413247.0,
      "score": 3
    },
    {
      "id": "lhnjf8i",
      "body": "What happens after you propose and they say no? Do you break up or just awkwardly act like it never happened?",
      "created_utc": 1723413262.0,
      "score": 3
    },
    {
      "id": "lhnrpsb",
      "body": "well it would seem she isn’t wrong",
      "created_utc": 1723416297.0,
      "score": 3
    },
    {
      "id": "lhnua75",
      "body": "Resentment set in. I’d ask why she’s still with you but I’m still with mine, 13 years it took him. We aren’t married still because I genuinely don’t think he wants to, he felt he should as we had children together. Which was foolish of me, but I had wasted my time with him. He’s not a bad person, it’s hard to explain it really.",
      "created_utc": 1723417256.0,
      "score": 3
    },
    {
      "id": "lho0dsv",
      "body": "My wife and I dated for 8 years before getting married.  It was never a question of if she was good enough to be my wife, but rather if I was prepared to be a husband.  \n\n\nWhen we started dating, I was a broke college student, no job, no prospects for a job, and living with my parents.  Then she had to return to her home country, and we dated long distance while I finished school.  After college, though, I was unable to find a job that paid enough to support myself, let alone a wife, and my grades weren't quite good enough to get into veterinary school, which was my original plan.  I struggled financially for a couple of years before deciding to go back to school to become a CVT, which took another two years.  \n\n\nMeanwhile, she tried multiple times to get back into the country, applying for visas and being denied, and she had to stay in her country, living with her sister and working a job she found there, while also attempting to get her Master's.  She was very patient, and she is frankly a wonderful woman.\n\n\nWe finally married a few months after I graduated, because I was finally confident that I could find something other than a minimum wage position and earn enough for us to have a modest lifestyle, not just mooching off my parents.  It took 2 years after we got married before she was finally able to come to the USA, and this year, our 7th year married, she became a US citizen.  We still had to live with my parents another 3 years before we could afford our own place in a lower-cost-of-living area of our state.",
      "created_utc": 1723419560.0,
      "score": 3
    },
    {
      "id": "lhob0wh",
      "body": "That’s trash. \nIf it’s been communicated and waited this long; it is a shame. \nBut if y’all haven’t talked about it happening and it never did; then what a crazy response.",
      "created_utc": 1723423720.0,
      "score": 3
    },
    {
      "id": "lhoerc6",
      "body": "(1) why did you wait so long?  \n(2) are you two still together?  \n(3) have you talked about next steps?",
      "created_utc": 1723425203.0,
      "score": 3
    },
    {
      "id": "lhokv6p",
      "body": "I don’t blame her, honestly. It’s a very valid feeling and I’m proud of her for realizing that she deserved better than that.",
      "created_utc": 1723427651.0,
      "score": 3
    },
    {
      "id": "lhot9r0",
      "body": "Out of curiosity, if marriage and proposale were so important to her, why didn't she propose?\n\nOr was it a case of she needed to be proposed to, in her timeframe, in a way she liked and so on?\n\nIf that's the latter, then dude the problem is much less a time management thingy and more a compatibility and communication issue.",
      "created_utc": 1723431198.0,
      "score": 3
    },
    {
      "id": "lhoysvs",
      "body": "Okay, so how in the hell do you spend 10 years with someone and not know how they'll answer when you propose? What the hell did you talk about for that 10 years? My wife and I were together 7 years before we got married and there was no \"Grand Proposal/Get Down on One Knee? movie BS. We had been talking about it on and off for a couple of years when we finally pulled the trigger.",
      "created_utc": 1723433708.0,
      "score": 3
    },
    {
      "id": "lhp1rct",
      "body": "I know some people get hooked up on tradition but she also waited 10 years. Even if she didn't want to propose to not at least have a conversation for 10 years it's not all on OP..... But feels like there's got to be more to this story.",
      "created_utc": 1723435142.0,
      "score": 3
    },
    {
      "id": "lhpb4u4",
      "body": "I’m confused. Did you not think she was going to question why now? After a decade? When was the last time she brought up being married?\n\nEdit I feel like I need to know ages. Are you 25 and have been dating since 15? Or are we talking 30 +",
      "created_utc": 1723440175.0,
      "score": 3
    },
    {
      "id": "lhpc11i",
      "body": "Well, that's a break up then. The usual goal of romantic dating is to get to the marriage phase. If you're never ever going to get married, it doesn't matter what you give each other or what you get out of it, BFFs with benefits is all it will ever be. If that's what you want, great. If you want a wifey, she's not the one and isn't interested in being the one, even if she was before.",
      "created_utc": 1723440693.0,
      "score": 3
    },
    {
      "id": "lhpftwn",
      "body": "I agree with her",
      "created_utc": 1723442982.0,
      "score": 3
    },
    {
      "id": "lhphga5",
      "body": "She's right tho.",
      "created_utc": 1723443996.0,
      "score": 3
    },
    {
      "id": "lhq2mtk",
      "body": "That's so sad 😢 \nI'm so sorry to hear this",
      "created_utc": 1723458172.0,
      "score": 3
    },
    {
      "id": "lhq4tbv",
      "body": "You should talk to her about this and try to sort things out.  Expectations unstated are expectations unmet.  Tell her how you feel and why.  Ask her how she feels and why.  Remember: this isn't \"what you want vs what she wants,\" but \"do you both want the same thing,\" and if so, how do you get there together?\n\nThere are 1,609 comments (1,610 including me) which tally up to over one and a half thousand people who can't read her mind.  Figuring out whether you have a future together and whether you can make it work is a conversation you two need to have with each other.  Good luck, friend <3",
      "created_utc": 1723459487.0,
      "score": 3
    },
    {
      "id": "lhqnx6h",
      "body": "I've told my children if by 5 years you don't feel they are the ones, let them go to go find who is. It's cruel to waste  their young years waiting. If she agreed to 20 that would be different.",
      "created_utc": 1723468425.0,
      "score": 3
    },
    {
      "id": "lhqozz5",
      "body": "Didn’t you know you wanted to marry her years ago? It shouldn’t take so long to realise you want to spend the rest of your life with her. It shouldn’t take a decade.",
      "created_utc": 1723468843.0,
      "score": 3
    },
    {
      "id": "lhqw57i",
      "body": "I have been engaged for over 8 years and now honestly, I’m done waiting for him to decide it was “a good time to actually be married.” He brought up adding more kids-never had before and now is in a rush to go to Vegas. I know I’ve been distant, but I gave this man my 30’s and I wanted to talk about kids 8 years ago not now. His mom died waiting for us to marry",
      "created_utc": 1723471473.0,
      "score": 3
    },
    {
      "id": "lhqwteh",
      "body": "Honestly, this sounds like a panic response. The whole concept of traditional proposals are unfair to both men and women. The man gets to decide when he’s ready, then he has weeks, maybe months, to buy a ring, plan the event, become more set and confident in his decision. Then an unsuspecting woman is presented with a ridiculously expensive gift and her partners best effort and she’s expected to accept it immediately or risk rejecting and humiliating her partner. If she needs time to consider she is ungrateful, her partner is resentful—he just spent a fortune in money and effort. Romance needs to be balanced with communication. \n\nWhen my father proposed to my mother she looked at him and said, “I don’t know. I like everything as it is right now.” This was in the 70’s. They did get married—they just celebrated their 47th anniversary.",
      "created_utc": 1723471713.0,
      "score": 3
    },
    {
      "id": "lhr4b01",
      "body": "Question? Why is she still with you, then? She's been with you for ten years but doesn't want marriage because that's her reason? But she isn't breaking up with you? Something smells fishy.",
      "created_utc": 1723474250.0,
      "score": 3
    },
    {
      "id": "lhr7f45",
      "body": "They have been roommates for a while and he hadn't noticed.",
      "created_utc": 1723475269.0,
      "score": 3
    },
    {
      "id": "lhrqnny",
      "body": "Why did you wait so long to propose?",
      "created_utc": 1723481413.0,
      "score": 3
    },
    {
      "id": "lhslpwq",
      "body": "My former fiancée proposed to me 12 years into our relationship. Somewhere around year 8 or 9 I overheard a conversation he was having with someone who asked him why we weren’t married. He said “ That ship has sailed”. It broke my heart. I never said anything but I thought of it often.",
      "created_utc": 1723491057.0,
      "score": 3
    },
    {
      "id": "lht41o8",
      "body": "You remind me of my niece, who at one time had broken up and gotten back together again at least six times with a former boyfriend. I actually don’t know why your girlfriend stayed so long.",
      "created_utc": 1723496754.0,
      "score": 3
    },
    {
      "id": "lhw9z89",
      "body": "It doesn't matter how long you've waited. You were together for 10 years!! A ring and a paper shouldn't change anything at all!! A commitment isn't made because of a marriage it's made to each other, with or without it. I'm so sorry for you. But marriage isn't everything if your relationship is great and solid. There's no 'taking too long' if you love each other. A marriage should be a formality at best.",
      "created_utc": 1723550006.0,
      "score": 3
    },
    {
      "id": "lhwt6ra",
      "body": "This absolutely breaks my heart. I suggest you first ask yourself If she’s truly The One or if she’s just the one you’re settling for.",
      "created_utc": 1723557651.0,
      "score": 3
    },
    {
      "id": "lhwussp",
      "body": "Sounds like when you proposed it make her realize how many years she waited for this",
      "created_utc": 1723558205.0,
      "score": 3
    },
    {
      "id": "lhxeixb",
      "body": "Ouch.  I just KNOW how this woman felt when you asked her.  Let me break it down.  She wanted to marry you and had probably hinted at or asked for it for years, and every time you said no or avoided asking her, she felt rejected.  Bit by bit, these rejections chipped away at her hopes till one day she had a light bulb moment. She realized this was not going to happen for her, maybe ever if she was planning on staying with you forever as an unmarried couple. So after coming to this realization, she quietly and internally packed up those hopes and dreams ALONG with the rejections and broken promises and stuck them wayyyy up high in a long forgotten closet of her mind and soul.  She grieved the loss of those hopes of being found worthy enough to be your wife.  Grieved it, and then slowly over time, the grief lessened and lessened till she maybe got comfortable.  Then, one day, you came along with your ring and proposal and were clueless enough to probably make some spectacle out of it.  You pulled that box out of its hiding spot in some proverbial closet and opened it up.  Just as she had forgotten that it existed you brought it back up and those rejections of yours that she packed away with her hopes had, over time, eaten away at those hopes and dreams and now she was all to aware of it.  You silly clown.  You're showing little self-awareness and emotional intelligence with this.",
      "created_utc": 1723564508.0,
      "score": 3
    },
    {
      "id": "lhyxbqz",
      "body": "Well why didn’t she leave you if she felt that way. She has point but damn, that hurts. I’m sorry man.",
      "created_utc": 1723581819.0,
      "score": 3
    },
    {
      "id": "lhz85o3",
      "body": "So after 10 years of her waiting you just handed her a ring?? What an incredible letdown. I can’t believe you’re surprised.",
      "created_utc": 1723586356.0,
      "score": 3
    },
    {
      "id": "lhz8ewp",
      "body": "I mean wtf did it take you 10 years?",
      "created_utc": 1723586443.0,
      "score": 3
    },
    {
      "id": "li0smt4",
      "body": "OP. I can relate your GF. I will tell you my story.\n\nMe and my partner are now 13 years together. On the 5th up to the 7th year, i keep bringing up the idea of marriage to him. When a girl does that, it’s actually a big deal because we already loe our pride to ask you marriage things because in general culture, men should bring these things up.\n\nOn the 8th year, still waiting but not asking anymore because I know I will receive the same answers like not financially ready, no savings for wedding expenses and so on. Deep inside me, i wanted him to propose to see if he really wants me in the long run or if he’s afraid to lose me but I pretended to believe on his excused and just said yeah you’re right.\n\nOn 11th year, he was already making hints because at this time, he was earning big but the idea of marriage for me has already died down. I’ve asked myself countless times what wrong with me why does this man don’t want me to his wife? All these questions made me think of myself as the girl who is not the marrying type.\n\nAnd because the proposal/marriage idea is already out of my system, I don’t feel any joy about it anymore, not excited I honestly told him if you will propose to me I will say no because I don’t feel doing it anymore. I told him what I went through to get to that decision. I think he listened, and it might hold him back when he wants to finally propose to me but I’m not there anymore. 10 years is enough for me to wait and it is true, women silently quit before they leave. That’s what I unknowingly did with the idea of marriage for us.\n\nYou might ask why I am still staying? We are still happy. For me I am still happy with our relationship without the idea of proposal and marriage, that’s out of my mind and I don’t want any of it anymore. If we part ways and see him propose to another girl within a year, I’d be happy because I know he can do it without any excuses. That will be my closure. \n\nWe are still together because we still enjoy each other’s company, but we telepathically know that if  any of us fucked up our relationship, it will be the end of our story.",
      "created_utc": 1723608026.0,
      "score": 3
    },
    {
      "id": "li1cvqk",
      "body": "I can definitely see both sides of this but I think the key issue is quite clear. I had a cousin who did the same thing and proposed after 10 years and they’re happily married now, but everything has nuance. For them they started dating quite young, and so it was more a matter of finances and maturity for when he proposed. There is a lot of life circumstances that can absolutely explain why it took you 10 years. But, I assume the difference between their situation and yours is communication. For my cousin, they talked about it a lot and both agreed that they want to get married but they wanted to save up to be able to do it properly, and be settled into their respective careers so that planning wouldn’t be unnecessarily stressful. I can of course only infer, but it doesn’t sound like you both talked about it much in a way that made you both feel happy. Perhaps you didn’t talk about it at all and no one really brought it up, or she brought it up and instead of having full length conversations about it you may have dismissed her feelings by saying “soon” or something to that effect. Maybe it’s a bit of both where she brought it up a lot years ago but due to your dismissals she stopped bringing it up entirely. But, the bottom line is that the topic of you proposing to her for a long time now, most likely years, was something that she had completely put off the table due to lack of reassurance, and when you did propose, all those years of pent up resentment came back to the surface, and instead of feeling loved and cherished in something that in her mind should make her the happiest girl in the world, she felt nothing like that. I’m sure you feel like this was a surprise and shock and her reaction was completely unexpected, and you have so many questions, and maybe you’re starting to feel resentment back to her for not communicating more to you, but that won’t solve any problems, and that takes the accountability off your shoulders when this is fully your responsibility. She shouldn’t have to beg you to marry her, she shouldn’t have to ask you when you plan to marry her, she shouldn’t have to wait so long without an explanation that she agrees with and you both came to decide together. No one wants to beg to be shown love and commitment, and she probably would feel like a jerk for bringing it up to the extent that it impacted her emotions because she probably doesn’t want to come off as being controlling or demanding of you. She most likely feels taken advantage of for her time, leniency, and most of all, love. She didn’t feel included in the decision making process, and she most likely feels like you’re only proposing out of convenience for your time and your life, but gave no consideration to her time and her life. It doesn’t feel personal to her at all and more so feels like you’re checking a box to be married at x age and she just so happened to be there. I know this comment is harsh, and potentially confronting, but I’m not trying to say this to kick you while your down, or call you an terrible person, my intention is to explain to you the multitude of reasons she would be upset and clearly show the difference between a couple that happily proposed after 10 years and how that contrasts to your situation. I wish you all the best, it sounds like you’ve made a lot of grave mistakes and are now suffering the consequences of neglecting her feelings. I hope that this can be a time of reflection and growth for you where you can communicate your understanding of her feelings and acknowledge your many mistakes, and then face the reality of your actions either through that being closure at the end of your relationship, or a new chapter where you become a better person for not just her, but for yourself. Please go to therapy",
      "created_utc": 1723619260.0,
      "score": 3
    },
    {
      "id": "li1ks8h",
      "body": "so you waited 10 years to see if there were better options, and then when you didn't find any you settled. that girl deserves better. waiting more than 3 years is absolutely insane.",
      "created_utc": 1723624274.0,
      "score": 3
    },
    {
      "id": "li5ukmd",
      "body": "Be honest, just tell her if we have no future why are we still together? I want you as my wife to stay together forever it took me 10 years to realize this and I’m so sorry but I want you. You don’t want me so what’s the point…?\nSee what she says…",
      "created_utc": 1723680968.0,
      "score": 3
    },
    {
      "id": "licv2go",
      "body": "I literally struggle from her point of view. my bf (40m) and I (32f) have spent 10 years together. he proposed within year 2. we have 5 children together. Built a home. we have it all. People see us as a perfect couple and family. I eagerly began plannimg the wedding but the wedding never came. and everytime I asked to set a date or pick a venue he would change the subject. finally at 5 years, after he bought a house for our family, he admits that he doesn't want to marry me. I don't know how to move past that moment. he said I wanted it too much. it's been so hard. I find myself longing to feel wanted by someone else. and that hurts because I love this man so much but he killed something I wanted with him. no one else. I was forced to marry young and that marriage didn't even last a year due to abuse, it made me never want to remarry. But when I met my bf I saw a future together when i looked into his eyes. I felt loved, truly loved for once in my life. Our relationship has endured a lot of ups and downs, we are both faithful and work hard to maintain a stable home and relationship. But if he were to ask me today I don't think I would mean it in my heart if I said yes anymore. now he says madly in love with me again and wants nothing more than to marry me one day... mostly because he recently hit one of the lowest points in his life and i guess finally saw my worth as a partner... but that isnt enough. he needs to fix what he did. that made a piece of me die inside. I wish nothing more to be able to tell him exactly how to fix it but I don't even know how. I hope I can have that flame back in my heart for the sake of our children and our relationship. but I'm definitely not there yet. I love him but I don't know what happens after our youngest finally turns 18. I feel so heart broken and lost daily over this. It's so stupid.",
      "created_utc": 1723782617.0,
      "score": 3
    },
    {
      "id": "lifbnoz",
      "body": "Ayo, \n\nYou waited until y’all both pushing 40, to make a decision. You wasted her time, you don’t deserve anyone else. You need to stop blaming your ADHD and anxiety for this decision. You want a placeholder/mother to take care of your needs but ignore hers.",
      "created_utc": 1723824376.0,
      "score": 3
    },
    {
      "id": "limhlh4",
      "body": "Accept that you screwed up and move on. My boyfriend did the same thing as you and I also said no. I won’t change my mind either. There’s NOTHING he can do. In fact, I’m looking to leave the relationship and find someone who actually loves me for me. That doesn’t take 10 years to figure out. ",
      "created_utc": 1723930242.0,
      "score": 3
    },
    {
      "id": "liswmn0",
      "body": "This mf is so clueless on so many level. How could he didn't even notice that when she stopped talking abt marriage mean she already checked out on the topic. She waited for 10 freaking year? If you got a problem with mental health that makes you anxious abt marriage why didn't you leave her just so she can be someone actually wants to marry her. Now that she dont want you as a husband, deal with it. And shes 38? Yeah man, you waste her life with your BS. Go fuck somebody else. you dont deserve her.",
      "created_utc": 1724028326.0,
      "score": 3
    },
    {
      "id": "lj2ad6f",
      "body": "To her it feels like you wanted to see if you could find someone better and now that you didn’t you decided to settle with her.",
      "created_utc": 1724171066.0,
      "score": 3
    },
    {
      "id": "lj44vu6",
      "body": "You asked and she said no. Leave. Honestly if she spent 10 years in a relationship just to say no when you ask the question she aint the one. Its so beyond stupid....",
      "created_utc": 1724191872.0,
      "score": 3
    },
    {
      "id": "lj4tqpt",
      "body": "Lollll 10 freaking years \n\nThat’s eternity",
      "created_utc": 1724200666.0,
      "score": 3
    },
    {
      "id": "lj5w6pd",
      "body": "I don’t feel bad for you. In fact, I’m happy that you can finally feel all the pain you put her through.",
      "created_utc": 1724216377.0,
      "score": 3
    },
    {
      "id": "ljp8dxm",
      "body": "Did you propose just because she’d wanted to previously? I know loads of women who have been in long relationships where they were just proposed to with a “shut up “ ring. She’s probably been emotionally detaching herself from you for ages.",
      "created_utc": 1724505646.0,
      "score": 3
    },
    {
      "id": "lliozig",
      "body": "“True Love Waits” - Thom Yorke",
      "created_utc": 1725479936.0,
      "score": 3
    },
    {
      "id": "lmgkrkn",
      "body": "Just say \"you always have been wife material, I took 10 years to make sure I am husband material enough for you\"",
      "created_utc": 1725985698.0,
      "score": 3
    },
    {
      "id": "lhoay1t",
      "body": "My husband proposed to me after 3 months of dating and we got married a month later. Everyone thinks we’re crazy but we keep telling everyone “we just knew”.\n\n9 years and 2 kids later and we’re still so crazy about each other.\n\n10 years is a long time, my friend. I hope you let her go, she deserves better.",
      "created_utc": 1723423688.0,
      "score": 9
    },
    {
      "id": "lhn7esq",
      "body": "She's done. She knows her worth and won't except a shut up ring. Why did it take you so long to figure out she was the one? Because no one else caught your eye?",
      "created_utc": 1723409151.0,
      "score": 13
    },
    {
      "id": "lhnm2dm",
      "body": "First off. Im sorry about that dude. I can’t imagine how you’re feeling. I know some people take their time to develop trust and a deep connection before they feel ready to commit, I think that’s valid specially since I saw you mentioned you have anxiety and ADHD. For men that can be kinda hard and I’m sorry you experienced that.\n\nSometimes things happen and we need to learn from them. Try to have a conversation with her and talk about your relationship and listen to what she is telling you and what she is feeling. Try to not take things personal and actually try to listen to her side and see where she is coming from, you also need to be vulnerable enough to honestly communicate how you feel and what you’ve been dealing with and why you took so long. She could quite honestly be feeling like you weren’t showing her enough love or showing her how worthy she is, she could be conflicted because you took so long to show her that you’re ready to commit and she might have been self conscious about that. 10 years *is* a long time. \n\nI have a ADHD husband and I noticed you guys have a really hard time with your emotions, emotional issues, communication and lack of romantic expression and rejection sensitivity. I suggest you guys sit down and have a conversation about where you guys are at in the relationship. What are some things that you both have had issues with, talk to each other *honestly and openly*. If she’s willing to give you a chance and not break up with you, try to see if you can resolve things. start to prioritize the things that you need to prioritize and accommodate for yourself so that your ADHD doesn’t make you lose focus of the things you WANT to prioritize. She sounds scared that you taking so long to commit to her could also mean that when you’re both married you might have issues with committing to other things that she needs you to prioritize.",
      "created_utc": 1723414204.0,
      "score": 4
    },
    {
      "id": "lho9fu7",
      "body": "Well...why'd you wait ten years? Just wanted to be extra super duper sure?",
      "created_utc": 1723423091.0,
      "score": 5
    },
    {
      "id": "lhoic2p",
      "body": "Damn 10years bro..... I thought I pushed it at 4 years",
      "created_utc": 1723426633.0,
      "score": 5
    },
    {
      "id": "lhpemzv",
      "body": "Is marriage really the goal? It should be happiness of the relationship regardless of if you’re married or not",
      "created_utc": 1723442248.0,
      "score": 6
    },
    {
      "id": "lhpn234",
      "body": "Seems you are very well knowing what is your situation. Do you know hers? Or is she only your cheerleader and soundboard, someone to heal you?",
      "created_utc": 1723447676.0,
      "score": 4
    },
    {
      "id": "lhpozw1",
      "body": "Yes ,I understand why she is so deeply hurt.",
      "created_utc": 1723448994.0,
      "score": 5
    },
    {
      "id": "lhq2557",
      "body": "Honestly, I don’t get it. I just got married after 11 years together, mortgage, 2 kids. That is the commitment more than marriage. Tying the knot is just the cherry on top. Your actions are the foundation, not the paperwork. Guess i just don’t place as much weight in the institution as others but to me this whole notion is upside down\n\nEdit: typo",
      "created_utc": 1723457864.0,
      "score": 5
    },
    {
      "id": "lhvpd71",
      "body": "You snooze you lose 🤷🏽‍♀️ You’re going to be hard pressed to find anyone giving you sympathy here. Do you think you’re owed years of someone’s life with no real commitment simply because you love them and they love you? How entitled. Better luck next time.",
      "created_utc": 1723537743.0,
      "score": 5
    },
    {
      "id": "lhotn2q",
      "body": "No one is asking why she's still with him. If my wife said no for the reason above, I'd ask why the hell she was still my gf.",
      "created_utc": 1723431362.0,
      "score": 9
    },
    {
      "id": "lhoye79",
      "body": "“It didn’t take me ten years to figure out you would be my dream wife. I knew that when we first laughed together. It took ten years to raise my self-worth until I could believe you would want me forever. If you’ll still have me, I have never wanted anything more, or for so long. You have built me up every day, given me the confidence to ask to marry you. I know that taking so long has hurt you, and I deserved your words, but please know I was never sitting on the fence, or weighing up my options. I didn’t want to keep options open, or fear commitment. I was scared that you would be an amazing wife, but that I would be a bad husband.”",
      "created_utc": 1723433513.0,
      "score": 8
    },
    {
      "id": "lhna37i",
      "body": "Yeah look, I’m with her on this one.",
      "created_utc": 1723410038.0,
      "score": 15
    },
    {
      "id": "lhnpl1r",
      "body": "The amount of shame being thrown at OP about “should have asked her sooner”, or “why did you wait so long” is the same reason the divorce rate is sky high. Y’all think there is some magic pre-defined time frame to marry someone. Every relationship is different. There is no magic year you get married. That’s ultimately a discussion that is had between partners and no one outside that should dictate or shame anyone for different timeframe. If OP knew how their partner felt and did nothing about that then that’s on them but if that was never discussed and the partner is just simplify basing their frustration/anger on how long their friends took to get married then that’s on them.",
      "created_utc": 1723415502.0,
      "score": 10
    },
    {
      "id": "lhn8gvd",
      "body": "I don't really have any advice for this specific situation, but more generally I strongly recommend that you propose to your GF within a reasonable timeframe. For a bunch of stupid reasons I procrastinated for years, and although we're quite happily married now, I'll never hear the end of it.",
      "created_utc": 1723409502.0,
      "score": 6
    },
    {
      "id": "lhnwt5i",
      "body": "10 years and she's 38 wtf bro you fucked up",
      "created_utc": 1723418209.0,
      "score": 7
    },
    {
      "id": "lhn037w",
      "body": "My dad and his girlfriend have been together for 14 years, healthiest relationship I’ve seen in my life, one to look up to I feel like, and I am so happy for them, and then the last year or so she finally gave him an ultimatum, propose/let’s get married, or this has got to be over, (they’d lightly discussed marriage over the last few years here and there previously) and ooh, he came around haha. I honestly don’t know why he waited so long to propose but sounds kinda like you/your situation. Maybe it never was a big thought or big deal to him, idk. If it ain’t broke don’t fix it haha??",
      "created_utc": 1723406702.0,
      "score": 8
    },
    {
      "id": "lhnbooe",
      "body": "Curious to know why it took you so long??",
      "created_utc": 1723410575.0,
      "score": 4
    },
    {
      "id": "lhoabyf",
      "body": "Yeah, no I’m sorry… my husband and I were friends for a year before we started dating and we dated for another year before we got engaged, I don’t know why you would wait 10 years for somebody to propose to you. She should’ve left at least five years ago.",
      "created_utc": 1723423443.0,
      "score": 4
    },
    {
      "id": "lhoad72",
      "body": "She's totally absolutely right , I hope she gets well soon .",
      "created_utc": 1723423457.0,
      "score": 3
    },
    {
      "id": "lhoq4m4",
      "body": "Question is....why did it take you a decade?",
      "created_utc": 1723429834.0,
      "score": 4
    },
    {
      "id": "lhn8p6i",
      "body": "Are people supposed to get married within a certain timeframe now?",
      "created_utc": 1723409578.0,
      "score": 17
    },
    {
      "id": "lhn0ded",
      "body": "I'm so sorry my friend. I've been with .y man for 15 years and we both are in agreement that we aren't ready for marriage. It's not that we aren't committed, it's mostly down to the shear cost of it. We have much more important things to be spending the money on. Ask her what this means for your relationship. Does this mean she just wants to carry on as boyfriend and girlfriend?",
      "created_utc": 1723406797.0,
      "score": 9
    },
    {
      "id": "lhnyb9g",
      "body": "[deleted]",
      "created_utc": 1723418776.0,
      "score": 7
    },
    {
      "id": "lhnpg2n",
      "body": "Yep",
      "created_utc": 1723415451.0,
      "score": 1140
    },
    {
      "id": "lhpj7wd",
      "body": "[deleted]",
      "created_utc": 1723445135.0,
      "score": 62
    },
    {
      "id": "lhoac3j",
      "body": "Perfectly said, and in just one sentence. Why don’t men (I say men because they do the proposing the majority of the time) understand this? They date a woman for a long time, move in together, talk about getting married, act like they are married, many even have kids together, but when she wants to talk about getting married she’s “smothering him” or “nagging” or “pushing him when he’s not ready.” She’s always the problem. Then she stops asking about it, he’s glad she’s leaving him alone, but what this means is that she’s plotting her out. She’s done. This guy took 10 years to decide he wanted to marry his girlfriend. Ten years. And God bless her, she told him no. And now, I guess, they are broken up because there is nowhere to go from here.",
      "created_utc": 1723423445.0,
      "score": 294
    },
    {
      "id": "lhq0ags",
      "body": "I got to save this comment for later",
      "created_utc": 1723456682.0,
      "score": 4
    },
    {
      "id": "lhri23p",
      "body": "Yep. I got to 7 years with my ex before I finally gave up even trying to discuss it. When my friends would ask “if he proposes what would you say?” Got to the point the answer was no. If I had to ask for it that long then I didn’t want it anymore, didn’t seem like it’d be his idea.",
      "created_utc": 1723478683.0,
      "score": 4
    },
    {
      "id": "lhrky7j",
      "body": "Gottman’s four horsemen in action (criticism, defensiveness, contempt, and stonewalling) - awful to see and even worse to experience. I’m really sorry OP",
      "created_utc": 1723479607.0,
      "score": 4
    },
    {
      "id": "lhnuyjl",
      "body": "I can’t be the only one who doesn’t get this",
      "created_utc": 1723417511.0,
      "score": 72
    },
    {
      "id": "lhoavjp",
      "body": "My ex of a relationship of 5 years would promise me marriage and everything I wanted, named our children and everything because I wanted us to move forward and get engaged, plan our life together, or for him to stop leading me on. I begged him not to drag me through the mud if he didn't actually want a life with me. He strung me along for two years with false promises all the while he was cheating on me. He wasted years of my life. Nowhere near how much OP has wasted his gf's time, her potential for children, but enough that I'm now in a tough immigration situation and he derailed my life significantly because I sacrificed things to be with him and he had promised to return the favour, lo and behold, when the time actually came to make good on that promise, one of our earliest promises, he washes his hands of it.\n\n\nI don't think I will ever truly understand how men will genuinely put you in these impossible situations and then blame you as if you never communicated exactly what you wanted. It starts to feel personal. It starts to feel like he would rather see me deported than try to be a good man and make good on a promise he made. And I'm sure for OPs gf it started to feel intentional, like he was wasting her potential for kids, and she stayed because she didn't see a point in starting over.",
      "created_utc": 1723423660.0,
      "score": 333
    },
    {
      "id": "lhom83g",
      "body": "I’m confused why she’s still dating him at all? Like I totally get why she doesn’t want to marry OP but idk why she’s continuing to waste time with him.",
      "created_utc": 1723428205.0,
      "score": 120
    },
    {
      "id": "lhngq6o",
      "body": "Shouldn’t have to wait 5 years. They know whether or not they want to marry you after a year or two.",
      "created_utc": 1723412317.0,
      "score": 515
    },
    {
      "id": "litqvbr",
      "body": "This is exactly what I think,\n\nShe believed that this was their progress. They were at the final destination that would happen for them. He gave all the love that he could give, and she settled for this, knowing it was 100%. \n\nNow, after 10 years, she finds out there is more, she was being kept at 80%, he hadn't decided on her, he wanted marriage, there was more he could give her and their relationship and he didn't.\n\nThat would have ended me, 10 years, and he hadn't chosen her until now. And now he is talking about how he is devastated? If I were her, I would be broken.",
      "created_utc": 1724041379.0,
      "score": 3
    },
    {
      "id": "lhmwvkh",
      "body": "this is SLICK omg this might've saved it",
      "created_utc": 1723405620.0,
      "score": 4614
    },
    {
      "id": "lhosoj3",
      "body": "I did something remotely similar. When I proposed to my partner of 7 years, she said \"why has it taken so long?\" and my reply was \"I wanted to marry you the day we met, however I had a lot of growing to do before I was capable of being the husband you deserve.\"",
      "created_utc": 1723430939.0,
      "score": 162
    },
    {
      "id": "lhmxwvp",
      "body": "Username checks out.",
      "created_utc": 1723405971.0,
      "score": 213
    },
    {
      "id": "lhmzdd6",
      "body": "I’m pretty sure this is what the young kids call Rizz and this person definitely has it. haha 🤣",
      "created_utc": 1723406460.0,
      "score": 167
    },
    {
      "id": "lhn3qi3",
      "body": "I almost slipped that was so slick.",
      "created_utc": 1723407919.0,
      "score": 91
    },
    {
      "id": "lho2by2",
      "body": "My dude, you are DANGEROUS. This is wife finds out husband had second family all along after his funeral levels of slick, like gotdammmm.",
      "created_utc": 1723420306.0,
      "score": 61
    },
    {
      "id": "lhn93el",
      "body": "OP YOU CAN STILL HAVE A TALK AND POSSIBLY SAVE IT, INCLUDE THIS THIS IS GOOD. WRITE THAT DOWN, WRITE THAT DOWN",
      "created_utc": 1723409709.0,
      "score": 200
    },
    {
      "id": "lho5ob0",
      "body": "No doubt about it this comment is slick, but it probably would’ve been a lie.\n\nBecause he probably isn’t husband material still. For the sheer fact that he took 10 years to make the move. As a woman it would make me feel like he just resigned himself to the fact that I was all he was going to get.",
      "created_utc": 1723421610.0,
      "score": 28
    },
    {
      "id": "lhojut4",
      "body": "Honestly, it seems like by the time he asked the question, she didn't care anymore what his reasoning was. After 10 years together and God knows what else going on in her life, maybe she was just comfortable. Even women can get that way, but at least she's motivated enough to not let a marriage happen passively.",
      "created_utc": 1723427242.0,
      "score": 31
    },
    {
      "id": "lho23ge",
      "body": "The problem is, subconsciously she will know she was good, but not enough to make him change in less than 2. It should NOT take 10 years to come to the proposal. *gavel hammer sounds*",
      "created_utc": 1723420215.0,
      "score": 68
    },
    {
      "id": "lhmwv4s",
      "body": "Smooth",
      "created_utc": 1723405616.0,
      "score": 51
    },
    {
      "id": "lhmwvx1",
      "body": "dayum! good one",
      "created_utc": 1723405623.0,
      "score": 24
    },
    {
      "id": "lhn211y",
      "body": "That was the most RIZZful comment ever",
      "created_utc": 1723407351.0,
      "score": 29
    },
    {
      "id": "lhnecg6",
      "body": "u/rizay with the rizzz",
      "created_utc": 1723411492.0,
      "score": 20
    },
    {
      "id": "lhn3ws4",
      "body": "*This guy is smoooooith, man*",
      "created_utc": 1723407977.0,
      "score": 15
    },
    {
      "id": "lhnitdg",
      "body": "What the fuck, how to loan your words everytime I talk?",
      "created_utc": 1723413051.0,
      "score": 6
    },
    {
      "id": "lhn8p22",
      "body": "OP SAY THIS TO HER",
      "created_utc": 1723409577.0,
      "score": 7
    },
    {
      "id": "lhp91pk",
      "body": "OP said in another comment that she’s 38",
      "created_utc": 1723438984.0,
      "score": 246
    },
    {
      "id": "lhr8o0z",
      "body": "Yeah like, I’ve been with my partner for 5 years, but we got together when we were 15. Although I’d like to marry him marrying this young just seems stupid so I’ve made it clear I want to wait until we’re at least like 25.",
      "created_utc": 1723475680.0,
      "score": 49
    },
    {
      "id": "lhw5rg7",
      "body": "lmao do you know what op replied to you comment? his comment was deleted but had literally over 2000 downvotes 💀",
      "created_utc": 1723547977.0,
      "score": 16
    },
    {
      "id": "lhqy3ir",
      "body": "Litterally! Just because you have a diagnoses dosent mean you arent cable of making decisions and its not an excuse to use everytime you fuck up. I dont blame her for wanting to end that relationship and honestly wish she had left him way early indstead of wasting her time waiting for him.\n\nThe fact he took 10 years to finally propose, im sorry but he clearly stated that if anyone else came along and gave him an oppertunity to be together with someone else, i bet he would take it. I just dont get why someone would otherwise wait 10 years until the finally decide their partner is good enough for that title",
      "created_utc": 1723472161.0,
      "score": 49
    },
    {
      "id": "lhu9udg",
      "body": "💥",
      "created_utc": 1723511591.0,
      "score": 3
    },
    {
      "id": "lhq14cp",
      "body": "The marrying the next person super fast is so common in these situations, happened to me.",
      "created_utc": 1723457220.0,
      "score": 133
    },
    {
      "id": "lhq4tlm",
      "body": "Whew you ate them UP with this reply.\n\nYes yes and more yes.\n\nAnd they ALWAYS marry the next woman within 1-3 years. In truth, men usually know within that time frame anyways.",
      "created_utc": 1723459491.0,
      "score": 113
    },
    {
      "id": "lhryr18",
      "body": "I was going to respond but you stated things so absolutely perfectly that I can't add anything.",
      "created_utc": 1723483920.0,
      "score": 31
    },
    {
      "id": "lhrs09s",
      "body": "[removed]",
      "created_utc": 1723481828.0,
      "score": 19
    },
    {
      "id": "lhsyghs",
      "body": "[deleted]",
      "created_utc": 1723494997.0,
      "score": 15
    },
    {
      "id": "lhte6hn",
      "body": "Pregnancy over 35 is not **usually** IVF, no. You only lose 5% likelihood of natural conception between 35-39 than you had from 21-34. \n\nPregnancies over 35 are still vast majority naturally concieved, they're not majority IVF lol",
      "created_utc": 1723500124.0,
      "score": 5
    },
    {
      "id": "lhvije1",
      "body": "no.7 is so true. seen it happen so many times. they always choose someone much younger too. marriage within 2 years, a baby is coming a few months after that or she is already pregnant when they get married",
      "created_utc": 1723533155.0,
      "score": 3
    },
    {
      "id": "lhpr8am",
      "body": "Hey. Solidarity!\nI hate that I am literally this girl.",
      "created_utc": 1723450521.0,
      "score": 15
    },
    {
      "id": "lhumftw",
      "body": "Hi! Just wanted to let you know that you’re not alone! 8 years here 🤪",
      "created_utc": 1723516398.0,
      "score": 6
    },
    {
      "id": "lhnrnzt",
      "body": "I want to know how he’d feel if she was like “lemme think about it for a decade and get back to you”",
      "created_utc": 1723416278.0,
      "score": 253
    },
    {
      "id": "lhnpg68",
      "body": "This. I checked out of a 17y marriage because I was tired of being ignored. I tried and tried for 8y to talk, fix things, help...and I was essentially raising a 39yo child. Selfish and came from money. I didn't marry for money. I finally just stopped hugging him, asking about his day and kept busy so I wasn't home since he never made time for me.\n\nWould walk right past like he didn't exist.\n\nOP's girl is right to say no. Fuck him for waiting. Not communicating why. That was the straw.",
      "created_utc": 1723415452.0,
      "score": 252
    },
    {
      "id": "lhnuya3",
      "body": "Some men really want a robot. He was probably happy she stopped yapping, not realizing that's when she gave up on him. They're happier when their partners are unhappy, crazy.",
      "created_utc": 1723417508.0,
      "score": 127
    },
    {
      "id": "lhnrxt7",
      "body": "Yeah. She stopped asking because she knew the answer, and had finally accepted it fully. When we no longer will even spend the energy fighting about something you KNOW is important to us, you should be very worried.",
      "created_utc": 1723416380.0,
      "score": 81
    },
    {
      "id": "lhqf2ot",
      "body": "And to u/JazzyJukebox69420 who deleted their comment “She could’ve proposed too???” \nWhy in the world would SHE have proposed HIM when they argued over the subject because HE didn’t want to get married? Of course the woman can propose… but no one is going to, or should to propose to someone to has vocalized not wanting to get married lol try again",
      "created_utc": 1723464689.0,
      "score": 20
    },
    {
      "id": "lhorhcr",
      "body": "[deleted]",
      "created_utc": 1723430416.0,
      "score": 13
    },
    {
      "id": "lhr9809",
      "body": "I hope you're safe now. I'm sorry you went through that. \n\nWhen you stopped expecting a proposal, did you feel that the relationship was over, or just that you no longer needed/desired a wedding/ marriage? \n\nI'm curious, as I have been told by some that I gave my husband an ultimatum and was manipulative when I told him withing a year of dating that my ultimate goal was marraige and if he didn't want that we should go our separate ways. So I'm curious about the opposite end of the spectrum. \n\nIt really seems like women can't win. I also don't understand why the marriage proposal has to be this surprise that the guy springs on the woman, instead of just a conversation where two equals discuss what they want for their future. But I guess that's less romantic, apparently?",
      "created_utc": 1723475862.0,
      "score": 9
    },
    {
      "id": "lhp1hpu",
      "body": "I bet he'll marry the next one in under 2 years. ",
      "created_utc": 1723435010.0,
      "score": 128
    },
    {
      "id": "lhqeu8b",
      "body": "And what a knife to the heart that will be for his ex :/",
      "created_utc": 1723464581.0,
      "score": 53
    },
    {
      "id": "lhnznrb",
      "body": "‘Now the woman I love isn’t willing to be my wife’.\n\nChange that to:\n\n‘Now the man I love isn’t willing to be my husband‘\n\nand you finally understand how she felt 2 years ago. She just gave up on you.",
      "created_utc": 1723419286.0,
      "score": 141
    },
    {
      "id": "lhomr48",
      "body": "My finance ns I went through hell and back and the last time I was pressuring him he kept telling me he wanted to be in a house we rented (not our ref) with things going right and all the lot. He did, but I had given up. Now that it’s time to get married I’m okay being patient, if we do we do if we don’t we don’t, maybe one day I’d like to lol. But it’s not the same as when I was younger.",
      "created_utc": 1723428422.0,
      "score": 14
    },
    {
      "id": "lhom5ed",
      "body": "Remember that buzzword from a few years ago? \"Quiet quitting\"? That's what's going on but in the relationship, not the work place.",
      "created_utc": 1723428174.0,
      "score": 44
    },
    {
      "id": "lhoadrs",
      "body": "This comment tears me up… I’m in this position exactly..",
      "created_utc": 1723423463.0,
      "score": 17
    },
    {
      "id": "lhot80e",
      "body": "Can you send me to this post please? About the guy who’s complaining that his gf constantly asks when they will get engaged?",
      "created_utc": 1723431176.0,
      "score": 3
    },
    {
      "id": "lhmvw66",
      "body": "Why are you still in this relationship then?",
      "created_utc": 1723405286.0,
      "score": 227
    },
    {
      "id": "lhmzjgh",
      "body": "Same! 8 years here! Doesn't mean I don't love him & want to stay with him. But marriage just isn't important anymore! We have had the talk & he knows I would say no. I'm 40. I don't need to get married. I'm happy with the life we have built over the years. No need to change anything! We both know we need to draw up some paperwork with lawyers to protect each other if something was too happen. Why would I leave someone I love because he couldn't pull his head out of his ass 5-6 years ago? I'm not checked out. Getting married just doesn't matter anymore.",
      "created_utc": 1723406516.0,
      "score": 160
    },
    {
      "id": "lhmvja6",
      "body": "I don’t understand this.  Why continue to be with someone if you know you would say no?",
      "created_utc": 1723405166.0,
      "score": 139
    },
    {
      "id": "lhsfz7l",
      "body": "How did he react to ypu leaving? Honestly wonder if he lowkey regret it. But honestly good on you for leaving and please let it stay that way, never let anyone use you and your time.",
      "created_utc": 1723489258.0,
      "score": 4
    },
    {
      "id": "lhq52jz",
      "body": "Sending you love friend.. 💛",
      "created_utc": 1723459633.0,
      "score": 9
    },
    {
      "id": "li9jgsd",
      "body": "This is going to sound very harsh, but from his perspective: if he’s getting everything he wants without getting married, why would he do it?",
      "created_utc": 1723740261.0,
      "score": 3
    },
    {
      "id": "lhnlp0v",
      "body": "10 years, until she became 38.",
      "created_utc": 1723414070.0,
      "score": 61
    },
    {
      "id": "lhnnpe5",
      "body": "I’m curious to hear what your “cut off” would be?",
      "created_utc": 1723414806.0,
      "score": 9
    },
    {
      "id": "lhn63tp",
      "body": "I waited all that time for hocus pocus… what a let down.  just like this woman must feel about her relationship.",
      "created_utc": 1723408713.0,
      "score": 55
    },
    {
      "id": "lhnofd9",
      "body": "I told mine 7 years was the cutoff. We got together really young so I had to make room for aging before marriage lol.\n\nETA: We were 16-ish when we got together, year five starts this December🖤 He gave me a timeline so I can pick out my ring! Within the next 11 months I’ll be engaged. Currently 20 + 21",
      "created_utc": 1723415074.0,
      "score": 11
    },
    {
      "id": "lhn9fjg",
      "body": "Same I waited 2 years then got proposed to haha",
      "created_utc": 1723409819.0,
      "score": 9
    },
    {
      "id": "lhrpt18",
      "body": "Sadly I relate. I’ve been with my boyfriend for 10 years. From 20 years old to now 30. I don’t dream about having a wedding anymore and don’t even look at proposals like I used to at the beginning of our relationship.  I know I’m not his dream girl and would also turn down the “shut up ring”",
      "created_utc": 1723481149.0,
      "score": 4
    },
    {
      "id": "lhpagmj",
      "body": "Why not leave him and find someone truly in love with you? Genuine question.",
      "created_utc": 1723439790.0,
      "score": 5
    },
    {
      "id": "lhpllbn",
      "body": "Why not either leave him or propose yourself after 19 months? Why did you willingly endure something you did not have to?",
      "created_utc": 1723446685.0,
      "score": 4
    },
    {
      "id": "lhnwbzo",
      "body": "A short comment, brief and striking. Everything's well resumed here. Nothing to add.",
      "created_utc": 1723418031.0,
      "score": 9
    },
    {
      "id": "lhp2bue",
      "body": ">\"Learn from your mistake.\"\n\ngive him another 10 years.",
      "created_utc": 1723435424.0,
      "score": 4
    },
    {
      "id": "lhnxtgy",
      "body": "I really like this response. Doesn’t demonize either party and encourages him to step up (which he should’ve already done but it’s too late to change the past now)!",
      "created_utc": 1723418588.0,
      "score": 3
    },
    {
      "id": "lhn45a8",
      "body": "I think it's more that she's almost 40 now and has accepted that their relationship is what it is. The idea of walking down the aisle in front of friends and family to this man that took a decade to decide isn't really that exciting anymore.\n\nEta: Also he doesn't mention children, but could be that this ship has sailed too.",
      "created_utc": 1723408056.0,
      "score": 138
    },
    {
      "id": "lhmyvwn",
      "body": "She says she doesn't want to break up. She just doesn't want to marry me anymore.",
      "created_utc": 1723406298.0,
      "score": 50
    },
    {
      "id": "lhp1zfz",
      "body": "GREAT catch.",
      "created_utc": 1723435253.0,
      "score": 6
    },
    {
      "id": "lhnunxr",
      "body": "\\*sits down next to you\n\nI'm listening.",
      "created_utc": 1723417398.0,
      "score": 7
    },
    {
      "id": "lhnfu3x",
      "body": "Please tell us more",
      "created_utc": 1723412011.0,
      "score": 8
    },
    {
      "id": "lhoa6x0",
      "body": "*brings teacups  and tea and joins the table\n\nI'm always ready for dark humor",
      "created_utc": 1723423388.0,
      "score": 2
    },
    {
      "id": "lhow1ym",
      "body": "At the point she stopped hinting or asking, was the point she made the conscious decision to either \n\nAccept the status quo, and realize that they will never get married, \n\nOr leave. \n\nShe chose, and NOW you want to change the rules of your own game? Dude you fucked up, and now have to live with it.",
      "created_utc": 1723432438.0,
      "score": 5
    },
    {
      "id": "lhzrqr7",
      "body": "This is the best reply",
      "created_utc": 1723593498.0,
      "score": 4
    },
    {
      "id": "lhp2t5h",
      "body": "leave him.\n\nthis post is your sign.",
      "created_utc": 1723435669.0,
      "score": 6
    },
    {
      "id": "lhnm498",
      "body": "She's now 38. She may have stayed because she's worried about being too old to find a partber who treats her well.  It's just sad she can no longer be excited for it bevayse she stopped caring.",
      "created_utc": 1723414223.0,
      "score": 14
    },
    {
      "id": "lhq3mh0",
      "body": "That’s my fking question. \n\nI wouldn’t have stayed 10 years (but my dumb ass stayed 5). But, I get why she said no. I would’ve felt like he finally realized his dream girl wasn’t coming along and decided to settle with me. 🫨🫨🫨🫨",
      "created_utc": 1723458781.0,
      "score": 5
    },
    {
      "id": "lhnbceh",
      "body": "Yet.",
      "created_utc": 1723410459.0,
      "score": 22
    },
    {
      "id": "lhmy8eb",
      "body": "I've been with my partner for almost 8 years. I have hit the point I'm ok with us never getting married. I actually don't want to anymore. Doesn't mean I don't want to be with him anymore. But I don't want to get married. She is not much younger than me. Some of us hit an age where it's just not part of our plan anymore. Doesn't mean we don't still love & want to be with our partner. Marriage just isn't that important.",
      "created_utc": 1723406079.0,
      "score": 54
    },
    {
      "id": "lhmwlgn",
      "body": "This is exactly what I was about to post. Why was she staying on as a gf if she knew she’d say no to a proposal?",
      "created_utc": 1723405524.0,
      "score": 17
    },
    {
      "id": "lhn202u",
      "body": "If she truly knew her worth, she'd have left him 8 years ago. I feel bad she wasted 10 years on a man who drug his feet through her younger years.",
      "created_utc": 1723407342.0,
      "score": 92
    },
    {
      "id": "lhrayx4",
      "body": "Trust me. It's his comments that are the problem. Not the waiting.",
      "created_utc": 1723476426.0,
      "score": 5
    },
    {
      "id": "lhnxoco",
      "body": "Im on the other end of this situation. I want(ed) to get married, and my partner doesn't really believe in marriage even though he explicitly told me that it's something he would be willing to do if its something that is important to me. It's been 5 and a half years. Im basically on the fence now. If he were to ask, i don't know if I'd say yes anymore. Not because i dont want to spend the rest of my life with him but because i waited too long, and somehow, if he were to ask now, it would be like, \"wtf? It took you this long?\"\n\nOP said in another comment that his girlfriend said that she doesnt want to break up. She just doesnt want to get married anymore.",
      "created_utc": 1723418535.0,
      "score": 9
    },
    {
      "id": "lhnuiw0",
      "body": "Anxiety and ADHD he said in another comment. He also said that a few years ago they were fighting about it pretty often amd she finally gave up and he was like \"oh, cool, no more pressure!\"\n\nDouchecanoe here was holding her as a placeholder and finally decided to settle because his preferred lady didn't come along, if you ask me.",
      "created_utc": 1723417346.0,
      "score": 7
    },
    {
      "id": "lhp3f38",
      "body": "girl, more than 2 is already too long.\n\ndon't let a man waste 3 FUCKING YEARS of your life.",
      "created_utc": 1723435980.0,
      "score": 6
    },
    {
      "id": "lhnqnc2",
      "body": "I told my husband he had two years.  If he couldn’t decide after 2 then I obviously wasn’t what he was looking for.  I wasn’t going to settle for being strung along endlessly.  He proposed at 2 years, then we got married about a year and a half later.",
      "created_utc": 1723415898.0,
      "score": 12
    },
    {
      "id": "lhszsht",
      "body": "O u c h.",
      "created_utc": 1723495410.0,
      "score": 3
    },
    {
      "id": "lhralxw",
      "body": "Congrats on your parent's 47th anniversary! \n\nYeah, I don't really understand either. How is it romantic to have your whole life trajectory at the whim of some man's proposal?\n\nAfter dating for a year, I told my now husband that my goal was to get married, and if he wasn't interested in that, we could go our separate ways. I was told by a friend that I was being manipulative?  It hurt my feelings that she said that I manipulated/gave an ultimatum. My intent was that if our goals don't align, we should both move on. Not to pressure him to marry me against his will.",
      "created_utc": 1723476312.0,
      "score": 3
    },
    {
      "id": "lhwaaar",
      "body": "Ask her why did she stay? What would have changed with marriage? Would she have loved you more? Was a ring so important to her? Were you not happy this whole time? \nWhy would she waste 10 years if she knew she'd say no the time arriving. \nWhy?",
      "created_utc": 1723550148.0,
      "score": 3
    },
    {
      "id": "lhpy7pv",
      "body": "In general you’re right, but there were details provided elsewhere in the thread that she asked about it for 8 years and then stopped 2 years ago. 8 years is a LONG time to be ignoring something your partner says is important to them, and I agree with other posters that it’s disrespectful even if the thing being ignored was not as important as whether to get married. \n\nIf she had never brought up wanting to get married, then sure, I agree with your comment - some people don’t care about it and that can work for their relationship (I know people who have been together 10+ years unmarried and are both happy with that decision). But the fact that she had brought it up and clearly made it known that she wanted it is important context here. That’s what makes it disrespectful, not the 10 year timeline alone.",
      "created_utc": 1723455303.0,
      "score": 5
    },
    {
      "id": "lhnme6u",
      "body": "Most 28 year olds wouldn't be happy if their partner made them wait till they were nearly 40. \n\nThe time frame depends on the couple, but few people in their 30s want to wait a decade.",
      "created_utc": 1723414322.0,
      "score": 19
    },
    {
      "id": "lhnnage",
      "body": "Are people *supposed* to get married? I heard it was a tradition that was gradually dying out. Can people not be in love & have a long term relationship without all the waste of money & documents & faff?",
      "created_utc": 1723414652.0,
      "score": 8
    },
    {
      "id": "lhn31cl",
      "body": "Marriage doesn’t have to be expensive. The cost of a JP signing to make it official is equivalent to what you’d spend on a date. I don’t think finances are your true reasons for not getting married, and that’s totally fine.",
      "created_utc": 1723407684.0,
      "score": 21
    },
    {
      "id": "lhn3bph",
      "body": "if you mean you arent ready for a *wedding* as in the ceremony and the party, but are willing to/want to get married, it cost us $75 to get married at the courthouse, so not a substantial fee for us.  food for thought. 🤷🏻‍♀️ if one of you gets into an accident, unless you have power of attorney already established, your 15 year partnership might not mean anything to the hospital staff.... that was so scary to me, so that's why we did it.",
      "created_utc": 1723407780.0,
      "score": 14
    },
    {
      "id": "lhncqhb",
      "body": "You can get married at the courthouse with each of you bringing a friend as witnesses and you will be just as married as if you spent 20K and invited 250 people.",
      "created_utc": 1723410936.0,
      "score": 8
    },
    {
      "id": "lhnvw4u",
      "body": "When my hubby and I  were newlyweds and had our first real disagreement and fight he was like ‘woah, woah, woah why are you so upset’ I looked him in his eyes and said ‘when I stop fighting is when you need to worry, that is the minute I stop caring.’\n\nI have no idea why OP’s girlfriend stayed so long. Perhaps she loved him enough to settle for less than what she wanted and less than she deserved. \n\nI do not know if it is possible to come back from this. But perhaps in this moment and owning his complete f*ck up they can have an honest conversation and he can find out if she has it in her heart to stay. After 10 years of putting her last he needs to find out if she is even interested in finding a path forward. \n\nHer answer speaks volumes. She has tucked away her dreams, hopes and wishes. It is simply not fair to her to know she did not mean enough to him to get engaged and married in 10 years.\n\nOP: True love tests us and challenges us.. We are constantly called to put our partner first, to rise to the occasion time and time again. \n\nAs someone who has been married for 21 years I can tell you that love and relationships can be complex but true love is never selfish. \n\nYou chose you, time and time again \nF. O. R.  10  Y. E. A. R. S. find out where she truly is mentally and emotionally and if necessary be the person she always hoped you would be and set her free. Love her enough to let her go. 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️",
      "created_utc": 1723417863.0,
      "score": 1726
    },
    {
      "id": "li2opes",
      "body": "Frankly, I’m proud of her. She knows her value.",
      "created_utc": 1723643807.0,
      "score": 7
    },
    {
      "id": "lhoz1vh",
      "body": "Exactly. You know if the person is right for you in the first few months. and commitment shouldn’t wait that long. 10 years is a huge time. Women take those moments when you call her wife and hype her about the marriage and talk about the marriage and make all those plans too seriously. There is no way someone can take years to make a decision about other person. If you know they are the one what’s the point in delaying? You can go through life together by being married rather than waiting.",
      "created_utc": 1723433825.0,
      "score": 13
    },
    {
      "id": "lho46bt",
      "body": "As someone who’s lived it, when a woman goes quiet and stops fighting back, pushing for change, and trying to communicate, she’s mentally checked out and it’s too late. From that point onwards she’s saving and spending her mental energy on her exit strategy, not on trying to reach you and fix the relationship.",
      "created_utc": 1723421020.0,
      "score": 230
    },
    {
      "id": "lhnvcgo",
      "body": "When you stop fighting for your relationship, you stop caring. And once you start feeling resentful, it's almost always a death sentence for the relationship.",
      "created_utc": 1723417658.0,
      "score": 309
    },
    {
      "id": "lhnvdl0",
      "body": "Usually when people give up, they stop fighting and arguing for what they need, usually because they’ve seen nothing happens when they do. So they stop fighting and start resenting this other person for it.",
      "created_utc": 1723417669.0,
      "score": 168
    },
    {
      "id": "lho97bb",
      "body": "It's not even about fighting for the relationship. At some point you no longer care about anything that the other person does. That annoying habit, you asked them to stop and they didn't? You don't ask anymore, because you no longer care. They didn't load the dishwasher or pick up their socks? Not worth fighting about, because it doesn't matter.\n\nYou no longer notice or care about your partner enough to ask or say anything.\n\nYou resent their very existence and all those things they said they would do and didn't.",
      "created_utc": 1723422998.0,
      "score": 112
    },
    {
      "id": "lhoaucb",
      "body": "Also known as “the walk away wife” syndrome. If she’s fighting for the relationship, she cares about keeping it. When she stops fighting for it, and gets quiet, she doesn’t care anymore. She has walked away emotionally and may be planning to walk away completely",
      "created_utc": 1723423647.0,
      "score": 55
    },
    {
      "id": "lhqot28",
      "body": "Basically, when someone stops feeling like you'll listen to them and no longer comes to you to try to communicate and ask for changes, your relationship is in major danger as they are now internalising resentment and outsourcing their complaints to people who actually care. \n\nThis might be friends, family or it could be a new romantic interest. They will find someone who actually respects and listens to them and wants them to be happy if that person isn't you.\n\nIf you NOTICE that your partner has withdrawn and they are still in a resentment stage, you may still be able fix things if you make genuine efforts to listen and change things. \n\nMost men won't. They will mistake the lack of communication for 'peace and quiet' from the complaints about their socks on the floor, the overfilled garbage and the gutters they haven't cleaned in two years.\n\nIf a woman hits the apathy stage, you are too late as any love in the relationship has been suffocated out. \n\nThis is often when women actually leave - when you are considered obsolete or simply a detriment to their happiness.\n\nMen often think that periods of separation are an opportunity to change and fix things. By then, for most women, it is too late. They no longer care and gave you every chance they were willing to already.\n\nI'm not going to assume where OP's gf is because sometimes resentment to apathy is quick for people, other times, it takes years. But OP made a major mistake in assuming the arguments no longer happening was a good thing - when it actually meant she'd given up communicating about it and being heard.",
      "created_utc": 1723468770.0,
      "score": 8
    },
    {
      "id": "lhtcj8s",
      "body": "Sunk cost fallacy",
      "created_utc": 1723499560.0,
      "score": 20
    },
    {
      "id": "lhzdyou",
      "body": "Maybe she didn't fully realize how she felt until the emotions from the proposal hit her.",
      "created_utc": 1723588401.0,
      "score": 6
    },
    {
      "id": "li0aitn",
      "body": "(Not my comment but I kinda agree with this) She probably resigned herself to just being partners, had made her peace with that and buried the idea of her dream wedding… For him to then propose 💀",
      "created_utc": 1723600536.0,
      "score": 7
    },
    {
      "id": "lhv7m2v",
      "body": "Probably cause she thought he just doesnt like marriage. Marriage isnt for everyone. Then suddenly handing out a ring feels like a 'im settling'/shut up ring. Actually rude. And the probability that he only gave it to her cause he felt she is about to exit is high.",
      "created_utc": 1723526345.0,
      "score": 8
    },
    {
      "id": "lhnh9uc",
      "body": "100% true. Some people are just indecisive. But what you’ll notice is that successful people are good at making decisions. Even if it’s the wrong decision, it’s better than being indecisive, staying in the same place not knowing what to do. Shit or get off the pot. ",
      "created_utc": 1723412506.0,
      "score": 326
    },
    {
      "id": "lhnmz2c",
      "body": "I mean that’s kinda false.. I’ve been dating my gf for 5 years and we’re both 24. Don’t know if that’s a good idea to get married so young for MOST people. Doesn’t make any less that I want to marry her but I’m definitely not responsible enough to be a husband. Heck I still feel I’m learning to be a proper bf at times😂.",
      "created_utc": 1723414537.0,
      "score": 176
    },
    {
      "id": "lhnm4an",
      "body": "Depends on the context of time really I waited four years, as I didn’t want to be younger than 20 when i asked my partner to be my wife then we got married at 24 because weddings cost money",
      "created_utc": 1723414224.0,
      "score": 4
    },
    {
      "id": "lhmxe32",
      "body": "In ten more years he would have come up with this comeback",
      "created_utc": 1723405794.0,
      "score": 2410
    },
    {
      "id": "lhn0o9e",
      "body": "If you learn one thing from watching the way various medias report on politics, everything is a matter of perspective.  You can spin just about anything into a positive if you put the right spin on it.",
      "created_utc": 1723406899.0,
      "score": 453
    },
    {
      "id": "lhn4n9o",
      "body": "Yeah if she was in a romcom.",
      "created_utc": 1723408221.0,
      "score": 112
    },
    {
      "id": "lhnk5ne",
      "body": "IDK, she seems already detached from the idea of marrying him. even if she folded there is a big chance she would ve ditched him at the alter.",
      "created_utc": 1723413520.0,
      "score": 41
    },
    {
      "id": "lhnl4zw",
      "body": "He said that Slshe's 38 and they stopped even talking about marriage 2 years ago...so I doubt it.",
      "created_utc": 1723413872.0,
      "score": 43
    },
    {
      "id": "lhn844t",
      "body": "If anything was gonna save this proposal, this comment was it",
      "created_utc": 1723409385.0,
      "score": 35
    },
    {
      "id": "lho3bn9",
      "body": "Would have worked on me",
      "created_utc": 1723420691.0,
      "score": 4
    },
    {
      "id": "lhrqtnf",
      "body": "[removed]",
      "created_utc": 1723481465.0,
      "score": 20
    },
    {
      "id": "lhxb4gq",
      "body": "This feels so similar to the \"it's not you, it's me\" line and honestly, kinda insulting and disingenuous.",
      "created_utc": 1723563451.0,
      "score": 4
    },
    {
      "id": "lhrdm4w",
      "body": "Ouch. Yeah… GF isn’t wrong",
      "created_utc": 1723477276.0,
      "score": 230
    },
    {
      "id": "lhwcnwp",
      "body": "Anxiety and Adhd",
      "created_utc": 1723551224.0,
      "score": 13
    },
    {
      "id": "liitkj4",
      "body": "People blame ADHD for the weirdest of things. I was out in the city biking one day and came across a guy who was riding around, yelling random insults at people standing at a bus stop and kicking every trash can in sight that he could find. He yelled something at me, too, and I asked him \"What is wrong with you?\" to which he replied \"I have an ADHD diagnosis!\" Like yeah... so do I, but that's not how it works and you wouldn't catch me dead knocking some trash cans over for fun. He started chasing me down the hill on his bike and almost caused a car crash at a big crossing where he just took a turn left and rode away between the cars suddenly.",
      "created_utc": 1723871186.0,
      "score": 4
    },
    {
      "id": "liadhax",
      "body": "It’s always the next one",
      "created_utc": 1723749683.0,
      "score": 11
    },
    {
      "id": "lhtl95w",
      "body": "Fact.",
      "created_utc": 1723502616.0,
      "score": 4
    },
    {
      "id": "lhvgizp",
      "body": "Lol “You want the truth? You can’t handle the truth!!!! But I am going to go ahead and tell you anyway” level",
      "created_utc": 1723531840.0,
      "score": 5
    },
    {
      "id": "liegrff",
      "body": "Nothing quite like Reddit misinformation that people eat up without a single thought, they need to edit their comment lol.",
      "created_utc": 1723814200.0,
      "score": 3
    },
    {
      "id": "lhzp43y",
      "body": "I made an offer down below to gay marry out of spite, you’re welcome to get in on it too",
      "created_utc": 1723592538.0,
      "score": 3
    },
    {
      "id": "lho7dna",
      "body": "Omg ☠️",
      "created_utc": 1723422281.0,
      "score": 52
    },
    {
      "id": "lhp0lgt",
      "body": "Just wondering, has he noticed the difference? Does it bother him?",
      "created_utc": 1723434569.0,
      "score": 18
    },
    {
      "id": "lho5rp3",
      "body": "Did you leave?",
      "created_utc": 1723421647.0,
      "score": 12
    },
    {
      "id": "lhpxumo",
      "body": "Bingo, no woman wants to be the one he settled with. That’s truly a god awful feeling",
      "created_utc": 1723455055.0,
      "score": 7
    },
    {
      "id": "lhrernf",
      "body": "I think for me, while I wasn’t actively looking for anyone else, I had one foot out the door and started questioning the relationship long before it was over. But I did still hold out some hope, if I’m being completely honest. He was the only boyfriend I ever had. We started dating when I was 18 and he was 20. I’m turning 29 this year. He’s all I had ever known so while I stopped expecting a proposal, I didn’t give up all hope either. I think I wanted to wait till I tuned 30, and if the proposal still didn’t come then, I’d probably walk out.\n\nLooking back, I feel lucky he never popped the question because had I found out he was hooking up with my best friend for six years after marrying him, it would be a lot harder.",
      "created_utc": 1723477644.0,
      "score": 6
    },
    {
      "id": "lho55i4",
      "body": "Yup. Homegirl checked out probably at least a year ago if not longer.",
      "created_utc": 1723421404.0,
      "score": 39
    },
    {
      "id": "lhoa4dz",
      "body": "This",
      "created_utc": 1723423360.0,
      "score": 6
    },
    {
      "id": "lhp04pf",
      "body": "100% true. When women stop nagging and just coexist, they’re so fucking done. \n\nMeanwhile, the guy: “Ahhh, this is amazing.”\n\nAlso the guy when it ends: (blinkblinkblink) “I SO DO NOT UNDERSTAND WHAT HAPPENED…”",
      "created_utc": 1723434342.0,
      "score": 20
    },
    {
      "id": "lhx1ghn",
      "body": "Great analogy!",
      "created_utc": 1723560408.0,
      "score": 3
    },
    {
      "id": "lhongsr",
      "body": "They always skirt this question but like all things it's probably a mix of complacency and self esteem.",
      "created_utc": 1723428720.0,
      "score": 41
    },
    {
      "id": "lhot3ti",
      "body": "This is the money question. It makes no sense. If one partner wants to get married so bad for so long, why didn't they propose? If they think it's on the other one to propose and it doesn't happen, then why not move on? Clearly the values don't align. \n\nThe most common answer is probably that they've built a codependent relationship and don't want to have the hard talk. But that's just causing more damage on the future.",
      "created_utc": 1723431126.0,
      "score": 15
    },
    {
      "id": "lho2wly",
      "body": "Paperwork like a marriage license? You know, the legal process we already have in place for this exact scenario? Sometimes I think y’all forget that marriage legally is different from marriage culturally.",
      "created_utc": 1723420527.0,
      "score": 33
    },
    {
      "id": "lhnrr6a",
      "body": "What does you being 40 have to do with anything? You're barely middle-aged. This isn't rational thinking and comes across only as vindictive/spiteful. If everything is fine and you love your partner and have no intention of leaving him, why would marriage be any different after 8-10 years than it is at a more conventional 2-4 year mark? Either you're saying the relationship isn't the same, you don't love him as much, or you don't have the same level of commitment to him as you once did - or your reasoning makes zero sense. If any of those things are true, it reads as you settling for less than you wanted, which I doubt your partner would be content with knowing. Peace and love, but that's the honest truth.",
      "created_utc": 1723416310.0,
      "score": 20
    },
    {
      "id": "lhohmp3",
      "body": "Cheaper to file joint taxes lol",
      "created_utc": 1723426347.0,
      "score": 4
    },
    {
      "id": "lhmwmv5",
      "body": "because the goal of the relationship is no longer marriage. people do, can and have relationships where they are life partners but not married.",
      "created_utc": 1723405538.0,
      "score": 359
    },
    {
      "id": "lhmyhje",
      "body": "Because you have a lovely relationship which you have accepted will never be a marriage but is pretty damned good anyway. You have suppressed all hope of a romantic wedding and then he does something stupid and opens up the old dashed hopes and emotions.",
      "created_utc": 1723406164.0,
      "score": 46
    },
    {
      "id": "lhtk8pk",
      "body": "I have no idea how he feels now. He didn’t seem very bothered while I was packing my stuff, and never called or texted after I left. I am the longest person he has been in a relationship with though I do know that, and his parents tried convincing him to make things work with me because I was a “keeper” who is self aware of their shortcomings and willing to work on things. Oh well 🤷🏻‍♀️ his loss.",
      "created_utc": 1723502260.0,
      "score": 4
    },
    {
      "id": "lhp7lqv",
      "body": "He used up all her child bearing years really. It’s actually cruel to propose at that point. Now he can go find a 25 year old and propose to her within 6 months.",
      "created_utc": 1723438194.0,
      "score": 31
    },
    {
      "id": "lhn69a4",
      "body": "Harsh! The movie was decent enough!",
      "created_utc": 1723408765.0,
      "score": 15
    },
    {
      "id": "lhn9ko4",
      "body": "Was it worth the wait?",
      "created_utc": 1723409866.0,
      "score": 3
    },
    {
      "id": "lhnvvwv",
      "body": "A few years ago she wanted to be your wife, she stayed as a GF. Now you want to be her husband, but you stay as a BF. I guess that's fair.",
      "created_utc": 1723417861.0,
      "score": 226
    },
    {
      "id": "lhnh6dn",
      "body": "Doesnt want to break up and doesnt want to marry \n\nMaybe giving you a dose of your own medicine for making her wait for 10 years",
      "created_utc": 1723412473.0,
      "score": 220
    },
    {
      "id": "lho39e4",
      "body": "Lucky for you. She wanted to get married. you didn’t want to, so you didn’t. It’s time for you to do what she wants.",
      "created_utc": 1723420667.0,
      "score": 20
    },
    {
      "id": "lhnwfbe",
      "body": "Because you took the specialness out of it by making her wait so long and feeling like she wasn’t good enough. Guys are often the ones who set the expectation of needing money for a big ring, not us. Or thinking that getting engaged means getting married right away. When you’re dating someone and they’re supposedly perfect for you, but you won’t marry them- it becomes all about the internal “why am I not good enough?”",
      "created_utc": 1723418066.0,
      "score": 38
    },
    {
      "id": "lhnkphy",
      "body": "She can just string you along now until something better comes. \n\nBecause that's probably what it has felt like.",
      "created_utc": 1723413719.0,
      "score": 57
    },
    {
      "id": "lhogfdy",
      "body": "Well, yeah. The concept of a “shut up ring” may be foreign to you, but most women are familiar with it. If she walked down the aisle at 38 years old to marry someone she’s been with for TEN YEARS, everyone in attendance would assume you were marrying her as the result of an ultimatum. \n\nHaven’t you seen any of those infamous, awful, viral wedding vow videos? Men will wait seven, ten, twelve years to propose to their partners, and then they’ll appear checked out and disinterested during the whole wedding. The actual vows are sexual and disrespectful - they humiliate their brides because they resent marrying them. Your girlfriend has noticed patterns in your relationship that align with the patterns in relationships where the general public says, “wow, he doesn’t want to be with her; that’s so embarrassing and sad.” Your girlfriend has accordingly decided she doesn’t want to marry you.",
      "created_utc": 1723425863.0,
      "score": 29
    },
    {
      "id": "lhnh0gc",
      "body": "Damn then you are lucky, because honestly, she deserves better than that",
      "created_utc": 1723412415.0,
      "score": 63
    },
    {
      "id": "lhodw72",
      "body": "Damn you’re just a place holder now.",
      "created_utc": 1723424861.0,
      "score": 11
    },
    {
      "id": "lhpwmcd",
      "body": "Yea dude, you dun goofed. \n\nIf I had to guess from that response, it's likely one of three things: \n\n1. She's wanting to give you a taste of your own medicine for a while. \n\n2. She doesn't feel it's worth it anymore since you took out all of the 'special feeling' by waiting so long. I'd say she believes just about everyone would think it's a 'shut up ring' and doesn't want to go through it anymore. She's settled on being in this 'phase' forever.\n\n3. She's checked out but didn't or doesn't want to throw her life up in turmoil just yet, and/or hasn't found the right guy that doesn't seem like they'd string her along again. You're just the safety net for now.\n\nBased on the fact that she's stopped fighting for it two years ago, I'd wager it's either 2 or 3. \n\nNot a clue what you could do to salvage the relationship anymore but I would wager that it's about to go off a very sharp cliff. Especially now that you've kicked up the hornets nest.",
      "created_utc": 1723454213.0,
      "score": 8
    },
    {
      "id": "lhov9ms",
      "body": "Count your blessings she wants to stay with you. If she had a brain she’d leave",
      "created_utc": 1723432084.0,
      "score": 7
    },
    {
      "id": "lhnsoeo",
      "body": "Fair enough. I didn't say you cheated but you waited for 10 years for HER to be \"wife material\". You though she was worth it now, she's been a place holder for your idea of \"wife material\". You must have a very ridiculous ego thinking she was just going to polish herself so she's worth of you...you never really though she coul be also learning a bit of self love, she was also introspecting (seriously, do men really think the female head is empty and the only thing in our heads is \"how to please my man\" and \"what's today for dinner\"?), she is now aware she deserves better. \n\nYou're the comfort zone, like she was for 10 YEARS!!! Now it's your turn, she is in her comfort zone now. Be a good sport and hold that place until she is ready to fly away. Is not hard babes, she did it for 10 years. The last couple of years where she was not \"nagging\" you about marriage are the numbers of year that you should - at the very least - give her all your loving support until she finds the one, minimum. And then you should gracefully step away without any fuzz, with the same grace she is treating your pitiful a§ now. \n\nI'm ADHD,  that's no excuse for your shortcomings. You're a coward, when you can admit it to yourself, your own healing journey will begin. Until then, LET HER BE, you're doing her a DISSERVICE by trying to get into her good books, you are NOT husband material for anyone at the moment.",
      "created_utc": 1723416658.0,
      "score": 15
    },
    {
      "id": "lho64w2",
      "body": "I think, more than anything, you should take this as a learning experience. The most you can do at this point is learn how to better cultivate your relationships. Marriage might not be on the table, but that doesn't mean you can't learn from this and improve on a relationship. Not just with her, but with other human beings as well.",
      "created_utc": 1723421792.0,
      "score": 5
    },
    {
      "id": "lhpcttk",
      "body": "Hmm...\n\nIf it was me and i had finally made up my mind then i would have some patience with her since she isnt leaving you. Sounds like the relationship maybe has gone cold a bit. But that doesnt have to be a big deal.\n\nAs long as you stay true to yourself and have patience with both yourself and her then there shouldnt be any reason to break up. Id let her know the ring is still on the table if she wants it and youll be ready when she is ready.\n\nIn the meantime stay true to yourself and possibly try to strengthen and deepen your relationship with her. She could come around eventually.",
      "created_utc": 1723441162.0,
      "score": 3
    },
    {
      "id": "lhpid1z",
      "body": "I agree. Please find ur true soulmate who wants to be with you forever and doesn’t just take or entertain the idea of the possibility of marriage. If you leave now, within a year you could be with the one and engaged and then shortly married. You deserve happiness and love from someone who wants to give you what you want. 5 years together is too long to have been dissatisfied and waiting for marriage. You will blink and look up and end up like the 10 year girlfriend of ur not careful. Please know your worth and surround yourself with people who show you how much they love you through actions.",
      "created_utc": 1723444581.0,
      "score": 8
    },
    {
      "id": "lhsdzs4",
      "body": "Yeah I'm willing to bet its sunken cost for her. She's afraid if she leaves him, the 10 years will be wasted, and building up another relationship will take even more years, especially if it's hard to find a new partner in the first place. In a way, this woman played herself - if she left after 3 or even 5 years of no ring, she would have been better off.",
      "created_utc": 1723488648.0,
      "score": 3
    },
    {
      "id": "lhnbgh7",
      "body": "True. 🤭",
      "created_utc": 1723410498.0,
      "score": 2
    },
    {
      "id": "lhmyh8k",
      "body": "Most probably came to terms with \"this is just how our relationship will be\". And accepted they won't get married but can continue being together.",
      "created_utc": 1723406162.0,
      "score": 52
    },
    {
      "id": "lhn4gfj",
      "body": "You're right. She should have left years ago ",
      "created_utc": 1723408158.0,
      "score": 31
    },
    {
      "id": "lhnliux",
      "body": "She's 38. i feel so bad for her.",
      "created_utc": 1723414009.0,
      "score": 12
    },
    {
      "id": "lhnoxw3",
      "body": "No, you have to make the government happy by investing thousands into the economy for absolutely no reason + they have to make poor babies out of them marriages so the companies can exploit future minimum wage workers.",
      "created_utc": 1723415264.0,
      "score": 6
    },
    {
      "id": "lhnyzof",
      "body": "Thank you for sayin this\n\n\"As someone who has been married for 21 years I can tell you that love and relationships can be complex but true love is never selfish.\"\n\nI just got out of a relationship that really used me. I thought for the longest time if only I could give more I would get something back. Maybe I didn't answer right... I stopped fighting a while ago and just recently with therapy realized I don't want my life like this. I appreciate this post.",
      "created_utc": 1723419033.0,
      "score": 574
    },
    {
      "id": "lhok2ww",
      "body": "It’s probably that she thought she could hang in there and when it finally happened, she was flooded with anger instead of happiness.",
      "created_utc": 1723427332.0,
      "score": 242
    },
    {
      "id": "lhomwol",
      "body": "It was probably her adjusting to thinking he just didn’t want to get married. But now she knows he does, he just wasn’t keen on her. So yeah, this is probably over.",
      "created_utc": 1723428486.0,
      "score": 125
    },
    {
      "id": "lhoymie",
      "body": "I hope he didn’t expect anybody to feel sorry for him, cuz I sure don’t. Didn’t you two ever discuss this topic? Did she show an interest in spending your life together? Why the hell would you wait so long?",
      "created_utc": 1723433624.0,
      "score": 6
    },
    {
      "id": "lhoq0rb",
      "body": "I’m sorry, I don’t agree with this. It’s the 21st century, she could have proposed to him. But she stayed, so that’s on her. If she didn’t want to marry him still, then why did she stay? Seems selfish on her part too. Can’t blame just him in this scenario when we don’t know the full story.",
      "created_utc": 1723429788.0,
      "score": 6
    },
    {
      "id": "li80bxe",
      "body": "I know. It is rare that someone would invest a decade in another person (in a love relationship), wait to be proposed to (as they had agreed), and then say no when the other person takes too long to act. That’s impressive. I’m proud of her for knowing her value, too.",
      "created_utc": 1723720616.0,
      "score": 6
    },
    {
      "id": "lhozi0p",
      "body": "a few months is way too short, maybe 2 to 5 years yes but 10 years nahhh wayy too long",
      "created_utc": 1723434039.0,
      "score": 24
    },
    {
      "id": "lhobalb",
      "body": "Well said.  At times, I think I have mentally checked out.",
      "created_utc": 1723423828.0,
      "score": 53
    },
    {
      "id": "lhnwu4p",
      "body": "Ah gotcha, thank you (:",
      "created_utc": 1723418219.0,
      "score": 11
    },
    {
      "id": "lhom383",
      "body": "Apathy.",
      "created_utc": 1723428149.0,
      "score": 36
    },
    {
      "id": "lho2n2q",
      "body": "Not making a decision is a decision and successful people understand that. So they will move one way or the other but never stagnant.",
      "created_utc": 1723420424.0,
      "score": 132
    },
    {
      "id": "lhnpmq2",
      "body": "Your early 20s (or teens I guess) is the exception to this, for sure. But north of 30, it's def fair.",
      "created_utc": 1723415519.0,
      "score": 230
    },
    {
      "id": "lhnrkm2",
      "body": "You, my guy, seem self-aware; OP does not. I'm willing to bet you and your gf are at least in the same book, and hopefully on the same page, when it comes to waiting for marriage and growing together. OP and his partner were not even in libraries in the same solar system. And if you are not, or dont know if you are, I'd suggest an open discussion about it so you aren't this guy. Lol.\n\nHis procrastination of years to ask her, and subsequent shock at her refusal to finally get (pity) married, long after she stopped talking about it, is about the dumbest, most pathetically self-serving, sniveling bs I've heard. I'm old, have a low tolerance for bs, and I've known plenty of people like OP/ plenty of partners like OPs gf. My guess is she was getting ready to check out of the relationship permanently, due to 10 years wasted and bro-tato chip though that finally whipping out the pretty shiny would instantly fix all the long-standing emotional neglect she was feeling, instead of doing any actual mental work in the relationship (which is what actual keeps love strong, imo).",
      "created_utc": 1723416244.0,
      "score": 90
    },
    {
      "id": "lhnxmz7",
      "body": "Being engaged doesn’t mean getting married immediately tho. The average wedding venue has 2 years waiting list. So even if you start planning immediately it’s years away",
      "created_utc": 1723418520.0,
      "score": 31
    },
    {
      "id": "lhnmw3g",
      "body": "Jup. Ngl if my husband proposed after a year I would’ve ran away screaming. But I was 19, had recently started at university and wanted to live together for a little bit before tying the knot.",
      "created_utc": 1723414506.0,
      "score": 3
    },
    {
      "id": "lhnpr6y",
      "body": "Not knowing he needed to address this question is the whole problem.",
      "created_utc": 1723415565.0,
      "score": 452
    },
    {
      "id": "lhn67kg",
      "body": "\"Michael, we found you taking cocaine in the firm's bathrooms, how could you *possibly* justify that?\"\n\n\"Well, Susan, I was just thinking of ways to double my productivity\"",
      "created_utc": 1723408749.0,
      "score": 459
    },
    {
      "id": "lhnc5nt",
      "body": "Everything is relative, even time.",
      "created_utc": 1723410737.0,
      "score": 23
    },
    {
      "id": "lhnoz4d",
      "body": "Thank you because in reality she’d just say “what a load of horse shit, it’s up to me to decide if you’re husband material and it didn’t take me 10 years”",
      "created_utc": 1723415276.0,
      "score": 121
    },
    {
      "id": "lhstdfi",
      "body": "Happy to answer. In our situation, we met when we were 20, so very young and no rush in my opinion. I had moved to the UK to be with her, where we lived for 4 years. I hadn't worked out what I wanted to do career wise at that stage and money was extreamly tight (we lived with her parents). \n\nTruth be told, I had actually sought permission from her parents to propose who were delighted however I wanted us to be established before doing so. After 4 years, we decided to move back to Australia and begin our life there where frankly the lifestyle is better and there's more opportunities. However that visa process for my partner was stressful and there was a lot of back and forth (as in my partner had to leave Australia during the visa decision process). All in all, that process took the best part of 1.5 years. \n\nI guess you could say as per the visa process, we were already \"de-facto\" and committed to one another indefinitely however it was when we were finally settled, with a place of our own, in Australia that I formally popped the question. We got married that very year at 27 which we had our heads more screwed on and has been a wonderful 9 years with 2 kids and a house so far.",
      "created_utc": 1723493432.0,
      "score": 16
    },
    {
      "id": "lhv59ff",
      "body": "Oh honey, he's long gone. We divorced last July.",
      "created_utc": 1723525034.0,
      "score": 16
    },
    {
      "id": "lhoaz3j",
      "body": "she's said checked out 😭",
      "created_utc": 1723423699.0,
      "score": 16
    },
    {
      "id": "lhrggw3",
      "body": "Thank you for sharing. \n\nAfter watching my mom stay in a bad marriage for far too long with infidelity as well, I think the most important thing is to protect yourself. \n\nI'm glad you got out!\n\nDo you think you would give any subsequent relationships that much time before determining whether to marry, or did your experience change your outlook?",
      "created_utc": 1723478181.0,
      "score": 3
    },
    {
      "id": "lhmwu2n",
      "body": "Couldn’t have said it better myself",
      "created_utc": 1723405606.0,
      "score": 81
    },
    {
      "id": "ljzwqrb",
      "body": "With the same ring 🤣",
      "created_utc": 1724671715.0,
      "score": 3
    },
    {
      "id": "lhnqmy4",
      "body": "I think he just killed the happiness of it for her.",
      "created_utc": 1723415894.0,
      "score": 161
    },
    {
      "id": "lhnr12w",
      "body": "I know! She really invested in this clown.",
      "created_utc": 1723416041.0,
      "score": 13
    },
    {
      "id": "lho1fi9",
      "body": "29 years it took me. I'm proud of you for getting out of the cycle of 'maybe if I do this one thing more'. It's the hardest thing I've ever done.",
      "created_utc": 1723419961.0,
      "score": 120
    },
    {
      "id": "lho405r",
      "body": "I only realized this once someone started loving me honestly (lack of comma intended). You're right to want to change, but it's normal you didn't notice. Once someone loves you it all makes sense. It's really hard to figure out what's wrong when you don't know right.\n\nEdit: Clarity",
      "created_utc": 1723420953.0,
      "score": 125
    },
    {
      "id": "lho87pu",
      "body": "Good for you. I hope that you will continue your journey of putting yourself first and honoring your wants, needs and desires. You deserve to be happy and to be truly loved.\n\nMove through life knowing this one truth:\n\nPeople treat us the way we allow them to. That one truth has served me well in life.\n\nCheers to new beginnings. ⭐️✨💫🌟",
      "created_utc": 1723422609.0,
      "score": 43
    },
    {
      "id": "lhol2xx",
      "body": "Or just disappointment. Either way this may be impossible to come back from. But he should have a really honest conversation with her to truly find out where she is in all of this..",
      "created_utc": 1723427736.0,
      "score": 134
    },
    {
      "id": "lhoodhu",
      "body": "Agreed. My husband said I was the most direct woman he had ever met. We were on like date 3 and I asked him if marriage was in his future, not necessarily with me just in general.\n\nI am a person who likes to manage expectations. If he had said no, I was prepared to see him casually but not exclusively. 🤷🏻‍♀️3 years later we got married.",
      "created_utc": 1723429100.0,
      "score": 79
    },
    {
      "id": "lhnxccd",
      "body": "No problem. I am here for all of your translation needs 😜",
      "created_utc": 1723418408.0,
      "score": 20
    },
    {
      "id": "lhothff",
      "body": "Correct. Apathy Is the true opposite of love.",
      "created_utc": 1723431292.0,
      "score": 35
    },
    {
      "id": "lho0pwv",
      "body": "That's a good Bingo! Nailed it perfectly",
      "created_utc": 1723419689.0,
      "score": 14
    },
    {
      "id": "lhnsg7d",
      "body": "Well as I commented to someone else my “hesitation” for a lack of a better word is due to debt. I have 100k in debt because of a graduate degree and I feel it would be irresponsible to marry someone and have them share this burden. At any point right now my gf and pack up and leave whereas marriage makes it harder for her to leave. We’ve had talks and she knows I want to marry her. She still argues we should get married earlier but I try to say that debt is a huge strain in households and I don’t want to start a marriage with the depression and problems my debt give me on a daily basis and now pass that on to her.",
      "created_utc": 1723416571.0,
      "score": 3
    },
    {
      "id": "lhny0u6",
      "body": "You are right, but my situation still doesn’t allow me for “anytime soon”. The best I can do is on my trip to Japan in Nov 2025. Thinking of proposing to her there but that’s literally if everything goes right for me in terms of paying off debt.",
      "created_utc": 1723418666.0,
      "score": 4
    },
    {
      "id": "lhnikn1",
      "body": "\"Then what about the hooker you had in there also?\"",
      "created_utc": 1723412966.0,
      "score": 141
    },
    {
      "id": "lhnee66",
      "body": "Lunchtime doubly so.",
      "created_utc": 1723411509.0,
      "score": 16
    },
    {
      "id": "lho24kp",
      "body": "Then propose.",
      "created_utc": 1723420227.0,
      "score": 20
    },
    {
      "id": "lhs3elb",
      "body": "I’m almost 29. I don’t think I can give my next relationship 10 years to see if it’s the right choice because I want kids, I want a family of my own. \n\nI’ve come from an abusive childhood household as well. My mother too dealt with years of abuse and infidelity. \n\nTo be honest, I don’t know what I’m supposed to do anymore. I don’t think I’ll ever be able to trust another human being ever again, after the betrayal and humiliation I received from someone I could die for. I’ll never love anyone with this intensity ever again. \n\nA part of me still wants a family with kids, while another part of me wants to get rid of that whole idea, make lots of money and travel alone for the rest of my life.",
      "created_utc": 1723485350.0,
      "score": 3
    },
    {
      "id": "lhn0qsr",
      "body": "I'm just wondering, what's the difference to you between a married life and the life you're currently living then?",
      "created_utc": 1723406922.0,
      "score": 34
    },
    {
      "id": "lhmz0kc",
      "body": "But, why? If you’re still committed to the relationship long term, then what’s the difference? If you are concerned that your SO isn’t truly committed because if not proposing after so long, then what makes you think he will stick around? I don’t mean this in a mean spirited way, but it seems like this mentality is just kind of vindictive, rather than a pragmatic choice.",
      "created_utc": 1723406341.0,
      "score": 60
    },
    {
      "id": "lho9lf9",
      "body": "I mean just imagine... She's 38, the idea of walking down the aisle in front of all her friends and family who know he took 10 YEARS to decide just isn't exciting anymore. There's barely a possibility of kids, they're not starting a new life together, what would really be the benefit of it? Just draw up some affidavits for medical power of attorney and stuff and you're set. She's clearly not excited about the idea of marriage anymore, and in fact she could even be embarrassed about it and feel like it's a \"consolation prize\".\n\nThere's no joy left in it anymore for her you're totally right.",
      "created_utc": 1723423152.0,
      "score": 123
    },
    {
      "id": "lhs6k3j",
      "body": "Took me that long too. I'm now in the last stages of caring for my elderly parents alone, but after this phase it will be time for me. I wonder who I even am on my own - but I'm looking forward to finding out. You got his, internet stranger. You got this.",
      "created_utc": 1723486334.0,
      "score": 14
    },
    {
      "id": "lhpf400",
      "body": "This hits so hard for me",
      "created_utc": 1723442538.0,
      "score": 3
    },
    {
      "id": "lhpg5hv",
      "body": "I love the expression “We constantly teach people how to treat us.” And Eleanor Roosevelt said, “No one can take away our dignity without our permission.” (Paraphrased.) I raised my daughters on this philosophy, which is especially important for girls and women.",
      "created_utc": 1723443179.0,
      "score": 36
    },
    {
      "id": "lholmk3",
      "body": "Oh this would be absolutely impossible to come back from.\n\nShes with the guy who took a decade to propose. Not only is that soul destroying in terms of self esteem, but all her friends and family asking her why it hasn’t happened yet, when OP isn’t around. All those times she’s likely went to bat for him when family is like wtf… while he obliviously went about his life making the relationship about him, society was out there shitting on her saying she’s an idiot for choosing him… and now after her friends and family lost respect for her probably five years ago.. he’s like ‘oh yeah, I remembered you exist, might as well wife you up now, I guess.”",
      "created_utc": 1723427959.0,
      "score": 210
    },
    {
      "id": "lhot2v7",
      "body": "On the first date with my husband we talked about why we were out dating and the end goal. We both wanted to have a family and so we didn’t want to even waste another date with someone who didn’t want the same thing. After that it’s just seeing if you want that with each other",
      "created_utc": 1723431113.0,
      "score": 39
    },
    {
      "id": "lhozv2g",
      "body": "YES!!! I always say the same. Hate still involves intense emotions.\n\nApathy is the best feeling after a break up.",
      "created_utc": 1723434214.0,
      "score": 14
    },
    {
      "id": "lho1ae4",
      "body": "Eh, funny story about debt and marriage. Sometimes, being a team makes the debt easier to handle mentally because you aren't alone in it. My husband has 2 masters and a bachelor's, with all the student loan debt and none of the job types to go with it. I never graduated college, but I fell into a specialization in the construction field where that didn't matter. We both throw extra money towards it when we can.\n\nBut keep in mind we eloped, 4 friends came as witnesses, and the entirety of our wedding cost $200, with license, because having 2 health insurance plans was cost prohibitive (we were engaged, but pushed up the legal date because the company i worked for had great insurance). In our case, the yearly insurance savings was significant enough, that even my very pissed father couldn't fault the logic.\n\nMaybe consider meeting with a cpa or someone of that vein, to get an idea of how being married can help/hurt finances, and to make sure you have a healthy handle on your finances, and if there are simplistic means you could use to pay it faster. But do not let them push you into signing up for cc's, Accounts, etc. The key is smart long term planning, while you are still young, and a healthy relationship with money/debt. There are even therapists who specialize in financial & mental health as one entity.\n\n2 random suggestions I use, because i dont like debt hanging over me:\nPaying bi-weekly/weekly (depending on your pay schedule), as opposed to monthly, gives you 2-4 extra payments a year. Those payments go towards the principal in most loans.\n\nRound/bump the divided payments up. I generally add $15-20 if I can, but even $1 or $5 is still money towards that end number.",
      "created_utc": 1723419908.0,
      "score": 7
    },
    {
      "id": "lhnjivu",
      "body": "Oral support",
      "created_utc": 1723413298.0,
      "score": 338
    },
    {
      "id": "lhnpe2i",
      "body": "What could a hooker cost, ten dollars?",
      "created_utc": 1723415430.0,
      "score": 26
    },
    {
      "id": "lho5tcy",
      "body": "Honestly, women can propose too",
      "created_utc": 1723421665.0,
      "score": 16
    },
    {
      "id": "lho38op",
      "body": "This is also true.",
      "created_utc": 1723420659.0,
      "score": 11
    },
    {
      "id": "lhotoym",
      "body": "People have the weirdest ideas about marriage. It's incredible that that's never been talked about in ten years. After a year or two you should have an idea of what the expectations are. To me, marriage is a legal contract providing for obligations and benefits. If I was with someone I wanted to spend my life with, I'd get a prenup to properly define the terms of the agreement (otherwise they will be defined and redefined outside of anyone's control) and then take those sweet benefits including a lower tax rate. That's it. I don't need a piece of paper telling me whether I trust someone or want to be with them.",
      "created_utc": 1723431385.0,
      "score": 6
    },
    {
      "id": "lhnk8zj",
      "body": "There's things you'll just never be comfortable doing if the partner isn't committed.  And marriage will no longer convince you to do those things, so it becomes pointless. \n    \nNot gonna merge finances, give up my name, or give up my career/dream to support his or stay home with his kid.  \n   \nMost common practical example, not gonna move with him for his job if I enjoy my life where we are at.    \n \n    \n Everything can stay 50-50 instead of getting the advantage of one partner giving up some of their individual potential to further the goals of the partnership.",
      "created_utc": 1723413553.0,
      "score": 21
    },
    {
      "id": "lhooo1i",
      "body": "that all makes my heart hurt. he wasted all her best years. i hope she just didn’t even want children so she hasn’t missed that ability for him. or she is happy to adopt.",
      "created_utc": 1723429222.0,
      "score": 59
    },
    {
      "id": "lhonibs",
      "body": "You are probably 100% correct!",
      "created_utc": 1723428738.0,
      "score": 39
    },
    {
      "id": "lhotp94",
      "body": "My first date with my husband was a dream date. Not even a month after dating, he asked me to marry him in a friend's hotel room while they were asleep.\nA month. He said he knew the moment we had our first date that I was the one he wanted to be with. \n\nWe got married a year later and been together for 4 years 3 married. \nHe still asks me to marry him from time to time.\nYeah, we had challenges, but I am so glad to have gone through them with him. He is my favorite person and I am so excited to spend outlr lives together.",
      "created_utc": 1723431388.0,
      "score": 17
    },
    {
      "id": "lhp4bo3",
      "body": "Exactly! It where you want to get to. \n\nThat’s why you block and you don’t go skulking round their social media or what have you. You do the clean break because it’s the fastest way ti get ti “meh”",
      "created_utc": 1723436450.0,
      "score": 5
    },
    {
      "id": "lho4m8y",
      "body": "Sadly marriage (now) wouldn’t be beneficial for me. First off my gf wants a proper wedding which they are expensive so having debt while prepping for a wedding would be a bad idea. Secondly, I live with my parents and I’m in a HCOL area so it’s helping me save huge amounts. I know my gf where once we get married she wants us in our own place and rent where I’m at is 2500+ a month and that’s considered cheap. Lastly I love my gf with all my heart but even she says she can’t deal with the stress of finances. She gets very emotional whenever I try telling her my situation and involving her in it. It got to the point that she said she’s willing to hear about it once a month to hear updates on it.",
      "created_utc": 1723421194.0,
      "score": 4
    },
    {
      "id": "lhnsb2b",
      "body": "Take my angry upvote for that amazing pun.",
      "created_utc": 1723416518.0,
      "score": 87
    },
    {
      "id": "lhnsg8t",
      "body": "Her name was Mary!",
      "created_utc": 1723416572.0,
      "score": 15
    },
    {
      "id": "lhojy2p",
      "body": "It's a hooker, not a banana.",
      "created_utc": 1723427278.0,
      "score": 11
    },
    {
      "id": "lhr6j42",
      "body": "So I agree that op's a dickhead who clearly only put his needs before hers, but seriously, his gf should have had the self respect to leave his flakey ass a long time ago. Like yes he sucks and I fully agree with all the hate he's getting, but at some point, you have to take some sort of action and stand up for yourself too. At this point, she's just doing it to herself. She really could have found someone else more willing to marry her by this time",
      "created_utc": 1723474976.0,
      "score": 8
    },
    {
      "id": "lhoov4z",
      "body": "Absolutely, what a lot of dudes don’t understand is yeah society can sometimes feel unfair about what dudes need to accomplish to ‘deserve’ a relationship and wish women would ‘stop being picky’ but what they don’t understand is society promotes treating women like shit based on how her partner treats her regardless of what she’s done, who she is, how attractive she is, or anything else: this situation really could have cost her friendships, and depending on the culture it can cause a woman to be disowned by her family, all because she was a loyal partner.\n\nNo doubt she went through a ton of shit, so partner finally proposing probably just became. A huge moment of “I went through all of this, for what? It didn’t bring these people back, it doesn’t make me feel good or recognized like I thought, it just made me empty because I’ll be spending my life with someone who dragged me through all of this and doesn’t even recognize that went on.”\n\nYeah nah, anyone would be pissed",
      "created_utc": 1723429304.0,
      "score": 103
    },
    {
      "id": "lhp5jkb",
      "body": "I love that your in love!!! It just makes me happy! You don’t need to be in relationship to have a wonderful life but I can’t help but love when people are and happy because it’s magic! \n\nMy joke with my husband is when we do  something especially if it’s funny  we will say “I just fell in love with you all over again!” And we have a good laugh. \n\nYou gotta tend the garden of love. Because love is an action word. We choose to love every day.",
      "created_utc": 1723437089.0,
      "score": 6
    },
    {
      "id": "lhoi7tq",
      "body": "Oof. If it's that stressful and you have mental health insurance with a reasonable copay, I'd 100% suggest getting a therapist who specializes in financial planning as it applies to mental health. They are usually CPAs or the sort. I say this as someone who has seen a finance based therapist for like a decade, including when i have to pay out of pocket. My husband is the emotional one when it comes to our finances, I tend to disassociate and do what needs to be done without talking to my husband (shocker, neither are healthy coping mechanisms). Financial anxiety manifests differently in everyone, and that's cool as long as you aren't blindly ignoring the debt and hoping it goes away, and the level of anxiety is not affecting your everyday life. There's a ton of different triggers and emotional pitfalls that come with debt, and therapists who specialize in it, are imo better equipped to help teach you to manage the entire kit & caboodle of anxiety, anger, shame, guilt, horror, etc.\n\nDebt sucks, and it is some of the most emotionally draining crap life throws at you. As someone damn near twice your age; I truly hope you are able to find a solution for everything. Being saddled with the equivalent of an extra mortgage for the sake of a piece of paper before you can legally drink is the most babiest of baby back bullshit. Try to stay positive.",
      "created_utc": 1723426585.0,
      "score": 3
    },
    {
      "id": "lhs6wbd",
      "body": "yeah, i don’t disagree with that at all. too often i think we wait around for subpar people to become good. it’s hard to make a decision to completely change your life but you have to take the reins yourself.",
      "created_utc": 1723486440.0,
      "score": 11
    },
    {
      "id": "lhp55w2",
      "body": "I wonder if he finally got around to proposing because while she did stay in the relationship, once she knew marriage was a lost cause with him; she thrived in other areas, especially her career, and maybe this is why he is motivated to propose marriage to her- because he gains even more benefits by marrying her than just living with this woman has already given him.",
      "created_utc": 1723436886.0,
      "score": 55
    },
    {
      "id": "lhomjmk",
      "body": "I definitely am! I got my first job and started June 3rd from that day to now I’ve lowered my total debts by 17k. I had 20k in a savings account and I used half to knock out a high interest private loan. The other 7k came from my checks and I’ve been knocking down at another high interest private loan. Graphs really help me as I can visually see my progress so for now I don’t need a therapist. I definitely will have to consider at some point because I won’t always be distracted from my debt.",
      "created_utc": 1723428337.0,
      "score": 3
    },
    {
      "id": "lhp5bzd",
      "body": "This does make sense, I was speculating if it was because he felt her ‘pulling away’ doing her own thing so he thought he was going to lose her:\n\n“You’re just doing it because I’m on my way out and not because you wanted me.”",
      "created_utc": 1723436977.0,
      "score": 38
    }
  ]
}