{
  "id": "1hevb69",
  "title": "Father son chat about…cameltoe?",
  "selftext": "I overheard my husband talking to my 12 year old son and I had to share the cuteness. \n\nSon: Dad what’s cameltoe?\n\nHusband: excuse me?\n\nSon: [Friend] at school talked about it and I haven’t heard of it. \n\nH: Well, sometimes depending on what a woman is wearing, you can see shapes and lines through her clothing, between her legs. \n\nS: Oh. Weird. \n\nH: Not weird, just natural, with some leggings or swimsuits or whatever. \n\nS: Is it ok to look?\n\nH: It’s ok to glance but never stare and never make a woman uncomfortable. \n\nS: Do you notice if ladies have cameltoe?\n\nH: Sure, sometimes. \n\nS: do you look?\n\nH: Of course I notice sometimes but it’s just their body, who they are. When you’re a man you will learn you can notice things and see they are pretty without being a weirdo about it. \n\nS: Have you even noticed mom that way?\n\nH: Sure. \n\nS: Her friends?\n\nH: Sure, it happens. They’re women, it’s natural. \n\nS: What about boobs? Ok to look?\n\nH: Same answer. It can be part of a woman’s appearance, it’s fine to glance respectfully. \n\nS: You notice mom and her friends’ boobs?\n\nH: Yes, sure. Have you finished your homework?\n\nI was laughing the whole time and yes I was eavesdropping. But I was so proud, of both of them!\n\n\n\n\n",
  "created_utc": 1734277716.0,
  "score": 7868,
  "num_comments": 253,
  "url": "https://www.reddit.com/r/offmychest/comments/1hevb69/father_son_chat_aboutcameltoe/",
  "comments": [
    {
      "id": "m26p8y8",
      "body": "I love this, haha. No one warned me I'd have to explain things like cameltoe and tea bagging when I became a parent.",
      "created_utc": 1734279966.0,
      "score": 2812
    },
    {
      "id": "m26ompw",
      "body": "Pretty great. Respectful, but honest in a way that doesn't add to the weird taboos of society.",
      "created_utc": 1734279756.0,
      "score": 1978
    },
    {
      "id": "m26l6x1",
      "body": "“Yeah sure man, I look at everyone’s tits, just don’t be weird about it” is not the direction I thought this was going at all 😂",
      "created_utc": 1734278582.0,
      "score": 3237
    },
    {
      "id": "m26ky8z",
      "body": "Great job, dad! You don't have to make a big deal about teaching consent. Just make sure you talk about it when it's appropriate. Kudos on working to bring up a respectful human.",
      "created_utc": 1734278498.0,
      "score": 1043
    },
    {
      "id": "m26jsd6",
      "body": "Real Talk , nice job Dad.",
      "created_utc": 1734278092.0,
      "score": 1235
    },
    {
      "id": "m26yfch",
      "body": "Plot twist: his friend was talking about mistletoe",
      "created_utc": 1734283020.0,
      "score": 228
    },
    {
      "id": "m26lrnu",
      "body": "Dad was a good one! Always be respectful  and never make woman uncomfortable.",
      "created_utc": 1734278783.0,
      "score": 168
    },
    {
      "id": "m27g7kk",
      "body": "This is wholesome and wonderful. Great job on the reminder of boundaries, consent, and the fact it's natural so doesn't matter. Seriously this is getting a gold star",
      "created_utc": 1734288678.0,
      "score": 106
    },
    {
      "id": "m27ukys",
      "body": "It’s “like looking at the sun. You don’t stare at it. It’s too risky. Ya get a sense of it and then you look away.”",
      "created_utc": 1734293203.0,
      "score": 68
    },
    {
      "id": "m26kbca",
      "body": "As a woman of a womanchild, I thank your husband and respect his skills.",
      "created_utc": 1734278276.0,
      "score": 178
    },
    {
      "id": "m29e3rv",
      "body": "I'm reminded of the time my son was about 9 years old, we're watching a football game, and I Viagra ad comes on.\n\nHe asks, \"what *is* Viagra?\" \n\nI was ready to explain erections, PIV sex, everything, but I ask, \"are you sure you want me to tell you?\"\n\n\"Yes.\"\n\nSo I say, \"it's a pill that helps a man have sex. Would you like me to explain more?\"\n\n\"No.\"\n\n\"Okay.\" And thats was it.",
      "created_utc": 1734311905.0,
      "score": 33
    },
    {
      "id": "m27bk1o",
      "body": ">When you’re a man you will learn you can notice things…without being a weirdo about it. \n\nApparently not every boy grows up into a “man” 🤣 kudos to you both!",
      "created_utc": 1734287235.0,
      "score": 45
    },
    {
      "id": "m27mwev",
      "body": "This gave me a laugh. \nI’m a woman, but when I was 5 my mum had to give me the talk about why it wasn’t ok to touch other ladies boobies, even if it was just because I liked them…",
      "created_utc": 1734290770.0,
      "score": 33
    },
    {
      "id": "m276nrd",
      "body": "This is absolutely fucking adorable, and your husband NAILED that talk. Seriously, he approached that SO well. Made me smile.",
      "created_utc": 1734285701.0,
      "score": 10
    },
    {
      "id": "m26mmzg",
      "body": "God, I love Reddit but especially on a Sunday morning coming down",
      "created_utc": 1734279081.0,
      "score": 43
    },
    {
      "id": "m27coju",
      "body": "The exasperated “have you finished your homework” made me laugh",
      "created_utc": 1734287585.0,
      "score": 10
    },
    {
      "id": "m28cwd5",
      "body": "This is a good dad talk. \n\n“Just don’t be weird about it” sums up most of the parenting that you have to do.",
      "created_utc": 1734299074.0,
      "score": 11
    },
    {
      "id": "m26osei",
      "body": "This is so wholesome. Made my heart melt. Thank you for sharing <3",
      "created_utc": 1734279810.0,
      "score": 20
    },
    {
      "id": "m26srrt",
      "body": "Wow. Your husband did an amazing job keeping the conversation non-judgemental and respectful. Good for you guys:)",
      "created_utc": 1734281144.0,
      "score": 18
    },
    {
      "id": "m28uzzg",
      "body": "The important thing here is that son trusted dad enough to ask in the first place rather than googling it or finding out from a friend. I didn’t learn anything remotely sexual from my parents and don’t feel comfortable talking about it with (ETA: them) still.",
      "created_utc": 1734305143.0,
      "score": 20
    },
    {
      "id": "m26yuri",
      "body": "This makes me so happy. I love the fact that your husband isn't lying and just being like 'NEVER LOOK!' I'll be quite honest, sometimes I glance down there at men but never stare. It's natural and it's not polite to stare but it's not the end of the world if you glance.",
      "created_utc": 1734283167.0,
      "score": 8
    },
    {
      "id": "m26pz5y",
      "body": "Reminds me of a talk my dad had with me. We were driving along. He quietly whistled to himself at a woman on the sidewalk. He looked at me and said “It’s okay to admire from a distance but don’t be a jerk and honk your horn or noth’n.”",
      "created_utc": 1734280213.0,
      "score": 31
    },
    {
      "id": "m26owgt",
      "body": "What about when men have cameltoe? Is it ok to notice?",
      "created_utc": 1734279848.0,
      "score": 18
    },
    {
      "id": "m28nbgs",
      "body": "That was a very cute and beautiful moment between father and son. You have very good reason to be proud of both of them:)",
      "created_utc": 1734302483.0,
      "score": 8
    },
    {
      "id": "m28w3wc",
      "body": "I love his responses. They’re very wholesome.",
      "created_utc": 1734305528.0,
      "score": 8
    },
    {
      "id": "m29rhwp",
      "body": "Love it. Just don’t be a weirdo son. 😂 great questions and answers.",
      "created_utc": 1734317002.0,
      "score": 7
    },
    {
      "id": "m2a24uu",
      "body": "So wholesome and your hubby gave great answers. Well done yall!",
      "created_utc": 1734321285.0,
      "score": 6
    },
    {
      "id": "m2bu0x0",
      "body": "Look at this honest, genuine, and healthy communication between a boy and his dad.  Love to see it.",
      "created_utc": 1734357195.0,
      "score": 6
    },
    {
      "id": "m2bvjee",
      "body": "I love it when parents and their children have these kind of chats because of the way they come so unadvised. It's unexpectedly funny, in a way.",
      "created_utc": 1734357799.0,
      "score": 6
    },
    {
      "id": "m26po1a",
      "body": "Now this is the kind of lessons every dad should give his kids XD",
      "created_utc": 1734280108.0,
      "score": 5
    },
    {
      "id": "m26znrs",
      "body": "“ Yeah kid, sure look but don’t stare.. boobs, camel toes whatever do your homework “ I’m WEAK 😂 poor dad, he handled that well",
      "created_utc": 1734283426.0,
      "score": 9
    },
    {
      "id": "m26mwh2",
      "body": "What a great exchange :) that’s right you g man, take a glance but don’t let me see ya do it lol",
      "created_utc": 1734279171.0,
      "score": 7
    },
    {
      "id": "m2eeetl",
      "body": "Repost",
      "created_utc": 1734387175.0,
      "score": 5
    },
    {
      "id": "m26qzxa",
      "body": "She says she is laughing but I know deep down the line she will bring up him glancing at her friends boobs and would ask him which he prefers more 😭",
      "created_utc": 1734280557.0,
      "score": 11
    },
    {
      "id": "m28fjmb",
      "body": "One of the most wholesome things about my parents: when they are out and about my parents always say stuff like \"that is a very handsome man/pretty woman\" about their own or opposite gender. And the other will look, agree or disagree and they will have a talk about whether to shop for the look or speculating about that persons life. Simple people watching. Zero envy. Completely sure of their own place in their relationship.",
      "created_utc": 1734299911.0,
      "score": 6
    },
    {
      "id": "m26o6cx",
      "body": "In Canada they refer to it as a moose knuckle, like the ice cream.",
      "created_utc": 1734279603.0,
      "score": 15
    },
    {
      "id": "m271pi2",
      "body": "Him asking about the homework at the end so casually is hilarious. I wished i had such a relationship with my father so your son must be lucky",
      "created_utc": 1734284095.0,
      "score": 3
    },
    {
      "id": "m29ebll",
      "body": "thank you for sharing this",
      "created_utc": 1734311986.0,
      "score": 3
    },
    {
      "id": "m29mw16",
      "body": "This is so sweet!",
      "created_utc": 1734315216.0,
      "score": 3
    },
    {
      "id": "m2agizj",
      "body": "I've read this before. It's a copy.",
      "created_utc": 1734328084.0,
      "score": 3
    },
    {
      "id": "m2aizh3",
      "body": "Such a genuine and thoughtful conversation",
      "created_utc": 1734329435.0,
      "score": 3
    },
    {
      "id": "m2741q2",
      "body": "Repost",
      "created_utc": 1734284862.0,
      "score": 8
    },
    {
      "id": "m26q6by",
      "body": "I had to hunt the story because it was deleted in another sub. I’m glad I did. It’s wonderful to read about good parenting! Thanks",
      "created_utc": 1734280280.0,
      "score": 6
    },
    {
      "id": "m26lkgr",
      "body": "This gave me a chuckle😂",
      "created_utc": 1734278714.0,
      "score": 7
    },
    {
      "id": "m272r8d",
      "body": "This is pretty much exactly how I’d expect this conversation to go with my partner and our future kid(s). Keeps it real and honest while also explaining boundaries in a way thats easy for the kid to understand. Pretty perfect imo! Good job momma.",
      "created_utc": 1734284438.0,
      "score": 4
    },
    {
      "id": "m2831pq",
      "body": "I love this",
      "created_utc": 1734295916.0,
      "score": 5
    },
    {
      "id": "m26v4r2",
      "body": "This cracks me up-- I wish more parents were this good about that stuff. \n\nI had a coworker who *read* as nice and good but I learned soon enough all he looks at when he talks to women are their chests. It was super insulting to have my boobs talked to instead of my damn face. Ugh!",
      "created_utc": 1734281934.0,
      "score": 2
    },
    {
      "id": "m28otxx",
      "body": "Thank you this made me smile!",
      "created_utc": 1734302984.0,
      "score": 2
    },
    {
      "id": "m295bsi",
      "body": "Well done",
      "created_utc": 1734308736.0,
      "score": 2
    },
    {
      "id": "m2aa4kj",
      "body": "😂😂😂",
      "created_utc": 1734324854.0,
      "score": 2
    },
    {
      "id": "m2fn9tk",
      "body": "Awe i think its so cool you were so mature about your husband's answers to your son.",
      "created_utc": 1734403182.0,
      "score": 2
    },
    {
      "id": "m271glw",
      "body": "This is currently my situation with my soon to be 12 yr old son and my husband.  Lol",
      "created_utc": 1734284015.0,
      "score": 4
    },
    {
      "id": "m272grm",
      "body": "Wholesome!",
      "created_utc": 1734284343.0,
      "score": 1
    },
    {
      "id": "m2753h1",
      "body": "“Have you finished your homework?” Best topic transition ever 💀🤣",
      "created_utc": 1734285200.0,
      "score": 3
    },
    {
      "id": "m27iutd",
      "body": "I loved the choice of words! You’re a lucky woman OP!",
      "created_utc": 1734289503.0,
      "score": 3
    },
    {
      "id": "m279ygn",
      "body": "You married a good man! Absolute King behaviour ❤️",
      "created_utc": 1734286754.0,
      "score": 4
    },
    {
      "id": "m277kni",
      "body": "Why would someone post this?",
      "created_utc": 1734285999.0,
      "score": 5
    },
    {
      "id": "m26tdqz",
      "body": "Awesome parenting! Good job, Dad! This is how you raise someone to be respectful while acknowledging they have eyes and others, body parts.",
      "created_utc": 1734281345.0,
      "score": 3
    },
    {
      "id": "m271n0h",
      "body": "Great answers.",
      "created_utc": 1734284072.0,
      "score": 0
    },
    {
      "id": "m27bpdb",
      "body": "This father wins Father of the Year award! Raising his boy right!",
      "created_utc": 1734287281.0,
      "score": 2
    },
    {
      "id": "m27dtwk",
      "body": "He handled it well! Nice diversion at the end there.",
      "created_utc": 1734287938.0,
      "score": 3
    },
    {
      "id": "m2bcmje",
      "body": "Wait is cameltoe... Something guys *like* looking at? I thought it was bad.",
      "created_utc": 1734348855.0,
      "score": 1
    },
    {
      "id": "m2fsx4y",
      "body": "Give me “Made Up Stories” for $500 Alex",
      "created_utc": 1734405300.0,
      "score": 1
    },
    {
      "id": "m272zie",
      "body": "Well done that man!",
      "created_utc": 1734284513.0,
      "score": 1
    },
    {
      "id": "m2anpqj",
      "body": "I remember when I was pregnant with my third baby, I suffered an ectopic pregnancy and lost the baby around three months; my son asked me why the baby wasn’t in my tummy anymore I explained that it wasn’t growing in the right place and so I showed him a diagram on the computer of where a baby usually grows but explained that the one I was carrying got stuck in my tubes which he understood ( he was around 4-5) but is very intelligent. When his found out he was pissed, I was only doing what I was taught in my parenting classes!!",
      "created_utc": 1734332232.0,
      "score": 1
    },
    {
      "id": "m279loo",
      "body": "That's hilarious lol he handled it as well as he could",
      "created_utc": 1734286640.0,
      "score": -2
    },
    {
      "id": "m2cwsqf",
      "body": "Tf",
      "created_utc": 1734370415.0,
      "score": 0
    },
    {
      "id": "m26t3h1",
      "body": "He's a keeper",
      "created_utc": 1734281250.0,
      "score": -4
    },
    {
      "id": "m273584",
      "body": "Wait until one of your kid's friends decides you're the safe mom and asks what bukkake is at 12 years old 🤦‍♀️🤦‍♀️🤦‍♀️",
      "created_utc": 1734284566.0,
      "score": 1404
    },
    {
      "id": "m26pi2r",
      "body": "Yeah just part of the job!",
      "created_utc": 1734280052.0,
      "score": 57
    },
    {
      "id": "m2736fp",
      "body": "that actually has meaning outside of video games....\ndidnt think id learn something like that today, okay",
      "created_utc": 1734284576.0,
      "score": 13
    },
    {
      "id": "m290azk",
      "body": "I was watching tv with my teenaged son (it was the ‘90s/Law&Order) and one of the cops on the show said something about “tea bagging”. I said “what’s tea bagging?” My high schooler had to explain to me what it was. OMG 😱",
      "created_utc": 1734306990.0,
      "score": 12
    },
    {
      "id": "m2a529c",
      "body": "When I was about 8-9 years old, I, very loudly, asked my dad what tea-bagging was in the middle of a packed grocery store…. My dad put his hand over my mouth and dragged me away 😂",
      "created_utc": 1734322536.0,
      "score": 6
    },
    {
      "id": "m29prit",
      "body": "One of my friends explained teabagging at a lunch table.  I remember her going \"why are you making that face?\". Apparently I was the only one with a look of disgust and confusion while everyone else was really into what she had to say.",
      "created_utc": 1734316319.0,
      "score": 5
    },
    {
      "id": "m29nqji",
      "body": "My niece came home today saying there are furries in her class and they pretend to do this (motions a cat licking themselves). Shes in 4th grade….",
      "created_utc": 1734315542.0,
      "score": 5
    },
    {
      "id": "m29jr2l",
      "body": "Nobody ever explained to me that at some point my parents would just stop learning these types of terms and that I'd be the one telling them when they come up on tv. 0.0",
      "created_utc": 1734314011.0,
      "score": 4
    },
    {
      "id": "m2byzsz",
      "body": "I wish my parents spoke English so I could've asked them this stuff when I was a kid. I did not learn the best way. It took me a weird ass time to realize society just sexualizes women too much. Yeah you can like it, just don't be a weirdo about it. At the end of the day boobs are just boobs, cameltoe is just cameltoe. It's just part of humans bodies. If you hug a woman face on. And it's a real hug, you're gonna feel boobs touch your chest. When woman hug woman same thing, boobs are gonna touch. Just be respectful and pay it little mind and you'll go a long way.",
      "created_utc": 1734359138.0,
      "score": 5
    },
    {
      "id": "m2cnbl8",
      "body": "Fr. My son just asked me, what a succubus is. He just turned 8 but his best friends brother is 14. I told him, to give me until easter because I really need some time how to pack this into age appropriate words. He was \"alright. Get ready for easter, I never forget\" which... I know, my love...:')",
      "created_utc": 1734367419.0,
      "score": 4
    },
    {
      "id": "m2do9hi",
      "body": "My kid explained to middle aged me what teabagging was whilst looking at me in a pitying way",
      "created_utc": 1734378920.0,
      "score": 3
    },
    {
      "id": "m2fly1q",
      "body": "Flashing back to when I asked my Dad what a chode was after my two older brothers were calling me “chode” for a week. \n\nMy dad turned bright red, unable to hold in his\nlaughter. He said “WHAT?! A toad!?!? IDK ASK YOUR MOTHER” \n\nHe then looked at my brothers, still chuckling, and said “don’t you chodes ever put me in a situation like that again”",
      "created_utc": 1734402688.0,
      "score": 3
    },
    {
      "id": "m2c1upq",
      "body": "Wtf is tea bagging? 💀",
      "created_utc": 1734360208.0,
      "score": 2
    },
    {
      "id": "m2ca48n",
      "body": "💀",
      "created_utc": 1734363116.0,
      "score": 2
    },
    {
      "id": "m34yla6",
      "body": "Explaining findings to my 8 year old because of Futurama was super fun, too. ",
      "created_utc": 1734790213.0,
      "score": 1
    },
    {
      "id": "m26orxw",
      "body": "Yep. Realistic!",
      "created_utc": 1734279805.0,
      "score": 389
    },
    {
      "id": "m27348i",
      "body": "Yeah but have you finished your homework?",
      "created_utc": 1734284557.0,
      "score": 732
    },
    {
      "id": "m26q37j",
      "body": "I feel like this quote of yours will stay with me forever. It’s so fucking funny.",
      "created_utc": 1734280250.0,
      "score": 266
    },
    {
      "id": "m27eoes",
      "body": "Thanks, dad. I needed this.",
      "created_utc": 1734288201.0,
      "score": 62
    },
    {
      "id": "m26l4bj",
      "body": "Thanks for saying that! I don’t think it was too much.",
      "created_utc": 1734278557.0,
      "score": 345
    },
    {
      "id": "m27sqlb",
      "body": "I like that he added it’s okay to notice and glance. Sometimes people swing so hard in the opposite direction of being a creep that it makes it seem like if boys or young men notice they’re bad people. It’s natural to see things and even to see things you like. But no one should know you’ve seen something you like and you shouldn’t risk making anyone uncomfortable with it.",
      "created_utc": 1734292614.0,
      "score": 98
    },
    {
      "id": "m27ohid",
      "body": "That was an appropriate time to talk about it. His son brought it up.",
      "created_utc": 1734291267.0,
      "score": 27
    },
    {
      "id": "m2ai8xc",
      "body": "Or actual toes on camels.",
      "created_utc": 1734329022.0,
      "score": 23
    },
    {
      "id": "m270uh1",
      "body": "🤣",
      "created_utc": 1734283815.0,
      "score": 15
    },
    {
      "id": "m28i9dw",
      "body": "Hahahaahahaha",
      "created_utc": 1734300802.0,
      "score": 3
    },
    {
      "id": "m26ltgb",
      "body": "The golden rule!",
      "created_utc": 1734278800.0,
      "score": 43
    },
    {
      "id": "m27j85f",
      "body": "Yeah I am glad he knows it’s ok to be curious to look! And that it’s not a scary gross thing.",
      "created_utc": 1734289620.0,
      "score": 26
    },
    {
      "id": "m27xafm",
      "body": "Ha I may steal this!",
      "created_utc": 1734294076.0,
      "score": 8
    },
    {
      "id": "m280ud2",
      "body": "I am also going to use this for my 5 and 7 year old boys when they start asking the real questions! 😂",
      "created_utc": 1734295214.0,
      "score": 7
    },
    {
      "id": "m26kr4v",
      "body": "Yes! I like that he didn’t brush him off. Not sure if I should tell my friends though, lol.",
      "created_utc": 1734278429.0,
      "score": 105
    },
    {
      "id": "m27dk0c",
      "body": "So true!",
      "created_utc": 1734287853.0,
      "score": 6
    },
    {
      "id": "m28x4yv",
      "body": "I feel like part of the reason (not the only reason by far) some men don’t learn how to grow up into a respectful man boils down to insecurity. Loud, obvious sexism can often have a performative aspect, especially when men are with other men. It’s an act that signals to the group he’s with that he’s hetero, just like them. And if you are insecure in any way about your own sexuality, that kind of performance can make the man feel like he fits in with the crowd because he’s “just like them”.\n\nIt’s just something I’ve (56M) noticed over time when hanging around with certain men. The insecure men often brag or show off like this.",
      "created_utc": 1734305891.0,
      "score": 2
    },
    {
      "id": "m27n5pq",
      "body": "Haha! Wish I had that talk!",
      "created_utc": 1734290851.0,
      "score": 9
    },
    {
      "id": "m276s66",
      "body": "You are sweet! He’s a keeper. I’ll let him know!",
      "created_utc": 1734285741.0,
      "score": 4
    },
    {
      "id": "m28d3n8",
      "body": "Pretty much!",
      "created_utc": 1734299137.0,
      "score": 5
    },
    {
      "id": "m26oz8z",
      "body": "Yes! True teaching moment. Just not sure if I should tell my friends lol",
      "created_utc": 1734279875.0,
      "score": 9
    },
    {
      "id": "m26sy56",
      "body": "He’s good at that! Very real.",
      "created_utc": 1734281202.0,
      "score": 5
    },
    {
      "id": "m28vwob",
      "body": "Yeah I was proud. And proud my husband didn’t shame him for looking you know?",
      "created_utc": 1734305459.0,
      "score": 10
    },
    {
      "id": "m26zbn3",
      "body": "Yes I think that was super healthy. Like, seeing a woman in a wet bathing suit, we just pretend ppl don’t glance? I don’t think it’s healthy to pretend or to make a young guy feel like he’s weird for looking you know?",
      "created_utc": 1734283316.0,
      "score": 9
    },
    {
      "id": "m26p0c0",
      "body": "Of course!",
      "created_utc": 1734279885.0,
      "score": 14
    },
    {
      "id": "m27dpp3",
      "body": "Bulge, package, dick print. And it's okay to notice, and it's sometimes hard to not notice.",
      "created_utc": 1734287902.0,
      "score": 13
    },
    {
      "id": "m28nkyi",
      "body": "Thanks! I don’t think it was too much.",
      "created_utc": 1734302569.0,
      "score": 4
    },
    {
      "id": "m28w7dt",
      "body": "And honest! I like that he didn’t tell him that looking is bad.",
      "created_utc": 1734305562.0,
      "score": 7
    },
    {
      "id": "m2a26dw",
      "body": "Thanks for this!",
      "created_utc": 1734321304.0,
      "score": 1
    },
    {
      "id": "m2703wi",
      "body": "Yeah he did the best he could!",
      "created_utc": 1734283571.0,
      "score": 4
    },
    {
      "id": "m26n98d",
      "body": "That’s kinda the rule right?",
      "created_utc": 1734279293.0,
      "score": 5
    },
    {
      "id": "m26r52r",
      "body": "Haha I already know the answer!",
      "created_utc": 1734280606.0,
      "score": 15
    },
    {
      "id": "m26s4v6",
      "body": "Moose knuckles are normally used to refer to male genitals though?",
      "created_utc": 1734280937.0,
      "score": 32
    },
    {
      "id": "m26oddh",
      "body": "lol, I like that better!",
      "created_utc": 1734279667.0,
      "score": 6
    },
    {
      "id": "m26wkis",
      "body": "Moose knuckle is a guy’s junk showing.",
      "created_utc": 1734282416.0,
      "score": 5
    },
    {
      "id": "m29mxws",
      "body": "Thanks! I’m still smiling lol.",
      "created_utc": 1734315236.0,
      "score": 2
    },
    {
      "id": "m26q8c5",
      "body": "Thanks. Not sure why they deleted!",
      "created_utc": 1734280299.0,
      "score": 7
    },
    {
      "id": "m272txx",
      "body": "Thanks! I think that pretending we don’t look isn’t healthy you know?",
      "created_utc": 1734284462.0,
      "score": 2
    },
    {
      "id": "m26vave",
      "body": "I get that side of it too! It’s so obvious right?",
      "created_utc": 1734281990.0,
      "score": 6
    },
    {
      "id": "m295dab",
      "body": "Cute right?",
      "created_utc": 1734308750.0,
      "score": 3
    },
    {
      "id": "m271ize",
      "body": "Good luck!",
      "created_utc": 1734284036.0,
      "score": 4
    },
    {
      "id": "m27ja9f",
      "body": "Thanks! He knows his way around, lol.",
      "created_utc": 1734289639.0,
      "score": 5
    },
    {
      "id": "m27dl19",
      "body": "You’re sweet!",
      "created_utc": 1734287862.0,
      "score": 3
    },
    {
      "id": "m2892wx",
      "body": "Why would someone post “why would someone post this?” 🤔",
      "created_utc": 1734297845.0,
      "score": 9
    },
    {
      "id": "m28bjbd",
      "body": "195% with you on this. Very strange.\n\nPerfect example of “not everything needs to be made public/posted online”",
      "created_utc": 1734298638.0,
      "score": 2
    },
    {
      "id": "m26tm6a",
      "body": "Yes! I liked that balance. Of course we notice things right?",
      "created_utc": 1734281423.0,
      "score": 4
    },
    {
      "id": "m27din1",
      "body": "Thanks!",
      "created_utc": 1734287841.0,
      "score": 5
    },
    {
      "id": "m27j5by",
      "body": "Yes! That was funny. Too much talk about my friends I think!",
      "created_utc": 1734289594.0,
      "score": 3
    },
    {
      "id": "m2dfa2w",
      "body": "Bad? Of course not it’s completely natural, I would not say that men necessarily enjoy or don’t enjoy looking at it in most cases, however sometimes curiosity kicks in.",
      "created_utc": 1734376158.0,
      "score": 2
    },
    {
      "id": "m2730ut",
      "body": "Thanks! lol",
      "created_utc": 1734284526.0,
      "score": 2
    },
    {
      "id": "m27dm4d",
      "body": "A champ!",
      "created_utc": 1734287871.0,
      "score": 2
    },
    {
      "id": "m26t6f4",
      "body": "I’ll keep him! He’s very real.",
      "created_utc": 1734281278.0,
      "score": 4
    },
    {
      "id": "m27adpc",
      "body": "[deleted]",
      "created_utc": 1734286884.0,
      "score": 638
    },
    {
      "id": "m28hhsc",
      "body": "I'm 30 years old. What is tea bagging? What is bukkake?? (I'm scared to Google)",
      "created_utc": 1734300545.0,
      "score": 104
    },
    {
      "id": "m284rid",
      "body": "I've forgotten that that was the name of that action and google searched it....",
      "created_utc": 1734296460.0,
      "score": 17
    },
    {
      "id": "m279fdq",
      "body": "You’ve got to tell us how you handled that one.",
      "created_utc": 1734286584.0,
      "score": 29
    },
    {
      "id": "m29r7sa",
      "body": "Mine did, and I was the one clearing all his biology related doubts. Once one of his friends send me a message intended for him and the poor boy, a regular in our house,  was so mortified and told my son he wanted to apologise. My son's response was,\"Hey, it is my mother, don't worry, she is cool, you can talk to her about anything. She understands.\" I have never been prouder of myself than at that level of confidence my son had in me.",
      "created_utc": 1734316889.0,
      "score": 9
    },
    {
      "id": "m2afv3l",
      "body": "Lol I had to explain Bukkake to my kids when we got a new parrot that kept screaming it. I had to Google it first 🤣. Thankfully it was years ago and not tainting my current search history .",
      "created_utc": 1734327731.0,
      "score": 9
    },
    {
      "id": "m2akvsu",
      "body": "I’m dreading the teenage years so much because of this but I’d rather be the safe mom and at least make sure they stay respectful to themselves and know about birth control and std prevention.",
      "created_utc": 1734330526.0,
      "score": 3
    },
    {
      "id": "m2b9cbh",
      "body": "It doesn’t stop.  My kids are grown now and they love to plant the seed, “Oh, mom, don’t Google (something horrifying)!” 😂",
      "created_utc": 1734346810.0,
      "score": 3
    },
    {
      "id": "m2a2667",
      "body": "Lmfao",
      "created_utc": 1734321301.0,
      "score": 1
    },
    {
      "id": "m2f4v3b",
      "body": "I did not even know what this was until I was 34 years old 😳",
      "created_utc": 1734396452.0,
      "score": 1
    },
    {
      "id": "m2fhi6a",
      "body": "Thanks.  Had to google that.  Really wasn't something I NEEDED to know.",
      "created_utc": 1734401032.0,
      "score": 1
    },
    {
      "id": "m28e9uq",
      "body": "I mean, it’s the same thing IN the video games… \n\n(the term in gaming comes from certain games that include the ability to crouch.  After you defeat an enemy you can crouch/stand/crouch/stand over the head of their head)\n\n13 year olds are hysterical and creative.",
      "created_utc": 1734299511.0,
      "score": 11
    },
    {
      "id": "m29c2ht",
      "body": "I always thought it was when a man jumped over another man's head and his nutsack hit him in the face.",
      "created_utc": 1734311148.0,
      "score": 4
    },
    {
      "id": "m29ro9t",
      "body": "As a kid therapist, they both win with flying colors. Well-done. I wish this type of candor, real-ness, emotional intelligence (on both sides), appropriate boundaries, and just seeing women as humans like them, is great. Wish I could duplicate in my work office.",
      "created_utc": 1734317073.0,
      "score": 135
    },
    {
      "id": "m26l94m",
      "body": "It was perfect, mama. 🫶",
      "created_utc": 1734278604.0,
      "score": 128
    },
    {
      "id": "m28eqj9",
      "body": "This is beautifully said! Yes, it’s ok to like it. I think boys don’t always get that message?",
      "created_utc": 1734299654.0,
      "score": 29
    },
    {
      "id": "m28tfvt",
      "body": "Hi, I was agreeing with what ops husband did. I'm sorry if you got confused. Have a good day.",
      "created_utc": 1734304602.0,
      "score": 9
    },
    {
      "id": "m27jplh",
      "body": "Also that looking is not something to be ashamed of. It's one of those things that can become a source of pain when kids are told that stuff.",
      "created_utc": 1734289775.0,
      "score": 15
    },
    {
      "id": "m26nl1z",
      "body": "As a woman, *I* notice my women friend's boobs. The whole idea that a guy just goes blind once he gets in a relationship is crazy. The idea that he doesn't ACT on it or make it weird should be standard, not that he doesn't see at all.",
      "created_utc": 1734279404.0,
      "score": 167
    },
    {
      "id": "m27ncqy",
      "body": "… I never said I listened!\n(I’m now 24 and bi…)",
      "created_utc": 1734290910.0,
      "score": 16
    },
    {
      "id": "m26pd54",
      "body": "Haha yeah. From a woman to woman, they may take your husband as a creep, which is not the case at all.",
      "created_utc": 1734280006.0,
      "score": 9
    },
    {
      "id": "m26znjn",
      "body": "Exactly. I think you're an awesome parent for this and your husband said it perfectly. I had to Google what Camel toe was when I was a child since my parents never told me anything and acted as if Google didn't exist.",
      "created_utc": 1734283423.0,
      "score": 3
    },
    {
      "id": "m28ex6y",
      "body": "Yep. Guilty!",
      "created_utc": 1734299712.0,
      "score": 4
    },
    {
      "id": "m26w5qx",
      "body": "Fellow Canadian here and that’s always been my understanding. Men moose knuckle women cameltoe",
      "created_utc": 1734282278.0,
      "score": 18
    },
    {
      "id": "m2736zq",
      "body": "Absolutely. I’m a woman (albeit bisexual) but I definitely look too lol. I think its natural, but ogling at people is not and theres definitely a healthy balance in there. Dad did great at explaining.",
      "created_utc": 1734284582.0,
      "score": 2
    },
    {
      "id": "m2720cf",
      "body": "Heh thanks.  It's just weird to hear these things you know",
      "created_utc": 1734284193.0,
      "score": 4
    },
    {
      "id": "m2swxxm",
      "body": "Sorry I couldn't think of a better word than \"bad\" at that time ... Unattractive, perhaps? \nI don't care either way, I understand it's natural and I try not to judge others for any physical reason. I just always had this perception that society found cameltoe unattractive so I thought the way it was described here in this post was neutral/attractive and I was just shocked/intrigued.",
      "created_utc": 1734603496.0,
      "score": 1
    },
    {
      "id": "m27clwq",
      "body": "Oh, my kid is the one who told his friend to ask me. He said I always tell them the truth and I don't make it weird 🤣 My kids have always asked everything. I can take anything sex and make it kid friendly and age appropriate. It's all about explaining context and answering all of their questions. They're just curious, and if we don't tell them, the internet certainly will. I like to be in control of the narrative my kids receive when it comes to something as complex and nuanced as human sexuality.",
      "created_utc": 1734287561.0,
      "score": 388
    },
    {
      "id": "m28izw9",
      "body": "I am going to assume you understand the fundamentals of everything, but let me know! \n\nTea bagging is when a man \"dips\" his sack in and out a partner's mouth, generally by kneeling over them. \n\nBukkake is when a person receives the ejaculate of multiple people at once onto their face and body. \n\nLet me know if you have questions! This is when the kids start asking the real tough stuff - the WHY? 🤣",
      "created_utc": 1734301045.0,
      "score": 177
    },
    {
      "id": "m28u10e",
      "body": "Don't feel bad, I just googled bukkake. I am 56 year old nurse, mom, and grandma! 😀",
      "created_utc": 1734304804.0,
      "score": 56
    },
    {
      "id": "m2bqf66",
      "body": "There was a guy in one of my social circles who used bukkake as his “filler word” or just go to word when he was bored. I finally asked one day if he knew what it was - he thought he had made up the word. I ended up having to explain it to him and now he uses a new filler word. 😬😂",
      "created_utc": 1734355702.0,
      "score": 32
    },
    {
      "id": "m2d1ohx",
      "body": "There was another Reddit post about someone's mom who was mortified when she found out what bukkake meant because she had been using it around her workplace as another term for baloney or malarkey. So don't feel bad.",
      "created_utc": 1734371940.0,
      "score": 11
    },
    {
      "id": "m2l19bi",
      "body": "Older than you. I know all sorts of explicit things (most 3rd hand) but not those. I think I once knew what teabagging was and have since managed to forget. I'm prepared to forget again if necessary.",
      "created_utc": 1734482523.0,
      "score": 2
    },
    {
      "id": "m28dq07",
      "body": "You really should have just asked 🤦‍♀️ I can be a safe adult for the adults, too! 🤣",
      "created_utc": 1734299340.0,
      "score": 69
    },
    {
      "id": "m27boii",
      "body": "With honesty, just like my own kids. I asked what he thought it was, sussed out how much he knew, and explained it in the most straightforward way I could. I also explained that there are a lot of things on the internet that he may see and have questions about, and that I was a safe adult if he wanted to come to me, and that I would never lie to him. And then I immediately texted his mom and when she came to pick him up we had a great talk. This was 5 years ago and he still reaches out for those weird questions you want to ask an adult but not your mom.",
      "created_utc": 1734287274.0,
      "score": 109
    },
    {
      "id": "m2bvtqd",
      "body": "It really is a special thing to be the safe adult. It is a privilege to be the one they can come to knowing you will not be angry or judgemental. \n\nGood for you, mama!",
      "created_utc": 1734357913.0,
      "score": 5
    },
    {
      "id": "m36hjmj",
      "body": "So cool",
      "created_utc": 1734809866.0,
      "score": 2
    },
    {
      "id": "m2bw9o4",
      "body": "I do this to one of my more conservative friends. She always regrets the google 🤣",
      "created_utc": 1734358089.0,
      "score": 1
    },
    {
      "id": "m2f5750",
      "body": "You needed a safe mom lol\n\nI gotchu.",
      "created_utc": 1734396572.0,
      "score": 1
    },
    {
      "id": "m2fj78v",
      "body": "Maybe you should have read further down the comments or simply asked. Had you have read the thread, you cpuld have saved yourself the trouble AND learned that google is exactly why I am honest with my children.",
      "created_utc": 1734401666.0,
      "score": 1
    },
    {
      "id": "m36hqj4",
      "body": "Lmao",
      "created_utc": 1734809933.0,
      "score": 1
    },
    {
      "id": "m29t9hh",
      "body": "That is high praise thank you! I’m glad you think the “it’s ok to glance, and wanting to look is healthy” approach works well!",
      "created_utc": 1734317701.0,
      "score": 22
    },
    {
      "id": "m26lo84",
      "body": "Means a lot! Thank you!",
      "created_utc": 1734278749.0,
      "score": 115
    },
    {
      "id": "m27jyls",
      "body": "Totally. My husband made clear it’s nice to look at, and natural to want to glance at, but that has to be in a respectful way. Your body and brain want to check things out and that’s ok you know?\nI let him know that women are the same way. He seemed surprised, lol.",
      "created_utc": 1734289855.0,
      "score": 23
    },
    {
      "id": "m26nt6o",
      "body": "That’s exactly how I feel. If I notice, how would my husband not notice? It’s almost not natural?",
      "created_utc": 1734279480.0,
      "score": 93
    },
    {
      "id": "m26pgm6",
      "body": "Ok so you think so? Honestly wondering about that.",
      "created_utc": 1734280039.0,
      "score": 8
    },
    {
      "id": "m270mpi",
      "body": "We’re the same! Glad you think this way. I have a question!",
      "created_utc": 1734283745.0,
      "score": 2
    },
    {
      "id": "m273c70",
      "body": "Yeah as he says it, it’s ok to appreciate, but not to make uncomfortable. I’m straight but I look at women as much as he does I think! lol",
      "created_utc": 1734284630.0,
      "score": 5
    },
    {
      "id": "m272405",
      "body": "Yes! I was cringing but happy lol",
      "created_utc": 1734284226.0,
      "score": 5
    },
    {
      "id": "m2thgvj",
      "body": "Yeah to be honest I personally don’t think it’s unattractive at all like we all know it exists just sometimes curious to look that’s all",
      "created_utc": 1734614548.0,
      "score": 2
    },
    {
      "id": "m27dlbm",
      "body": "That is amazing. Keep being awesome,  Momma!",
      "created_utc": 1734287865.0,
      "score": 93
    },
    {
      "id": "m29s12n",
      "body": "So how would you answer the bukkake question? Lol",
      "created_utc": 1734317214.0,
      "score": 64
    },
    {
      "id": "m29bl3a",
      "body": "I'm 64 next week and didn't know either of those.",
      "created_utc": 1734310970.0,
      "score": 73
    },
    {
      "id": "m2bj1j4",
      "body": "To be fair, teabagging in high school is just having your balls near someone’s face. Or at least it was 10 years ago. Dang that’s sucks to say lol",
      "created_utc": 1734352344.0,
      "score": 30
    },
    {
      "id": "m28zsyw",
      "body": "Wait…. I thought tea bagging is when an old man’s balls dip into the toilet when they sit.",
      "created_utc": 1734306816.0,
      "score": 60
    },
    {
      "id": "m298erf",
      "body": "so WHY?",
      "created_utc": 1734309827.0,
      "score": 14
    },
    {
      "id": "m2djxn6",
      "body": "I was to days years old (at 44) to learn what Bukkake is. Thank you.",
      "created_utc": 1734377587.0,
      "score": 3
    },
    {
      "id": "m2d3ext",
      "body": "Thank you stranger!",
      "created_utc": 1734372479.0,
      "score": 2
    },
    {
      "id": "m29a02v",
      "body": "Did you delete your search history after lol",
      "created_utc": 1734310405.0,
      "score": 56
    },
    {
      "id": "m2cc2en",
      "body": "One time my family was playing cards against humanity and my grandpa wanted to join. He promptly used the “bukkake” card in a ridiculously inappropriate way. That’s kinda the game so people laughed awkwardly and just kinda ignored it but later I found out he used it randomly and had no idea of the meaning lol.",
      "created_utc": 1734363772.0,
      "score": 15
    },
    {
      "id": "m2ebcxw",
      "body": ".. what's the new filler word?",
      "created_utc": 1734386180.0,
      "score": 3
    },
    {
      "id": "m28t5ur",
      "body": "There you go, a million dollar podcast idea - safe adult for adults. For all those questions you too scared to google!",
      "created_utc": 1734304508.0,
      "score": 41
    },
    {
      "id": "m28qgzm",
      "body": "You need your own sub!",
      "created_utc": 1734303555.0,
      "score": 13
    },
    {
      "id": "m298f1c",
      "body": "I need you in my life",
      "created_utc": 1734309829.0,
      "score": 1
    },
    {
      "id": "m29gsyz",
      "body": "When my niblings reached about 13yrs old, I noticed they stopped coming to me to explain some of the slang terms, until one day I remembered about Urban Dictionary, and started using some of the terms around them to see their reactions.\n\nDid you know, watching roughly 15 niblings aged 13 -  21 suddenly start laughing quietly with tears running down their faces, after their grandmother accidentally called Bacardi, Bukkake, and you yourself are trying to hold back from laughing loudly, only for all 16 of us (at this time i was 42) being told to leave the table and compose ourselves, made Christmas really special that year.",
      "created_utc": 1734312913.0,
      "score": 58
    },
    {
      "id": "m409s4e",
      "body": "Not sure what the point of your response is.  I don't always keep reading threads so...google.",
      "created_utc": 1735289227.0,
      "score": 2
    },
    {
      "id": "m27kbof",
      "body": "That's why I wanted to comment and celebrate this. Also the surprise is adorable",
      "created_utc": 1734289968.0,
      "score": 14
    },
    {
      "id": "m26q8qy",
      "body": "It really depends on whether your friend circle is open and understanding. Everyone notices things, and as long as we are respectful, it should be all good. Threading that line can be tricky sometimes, but I think it's worth expressing that you're proud of your boys.",
      "created_utc": 1734280303.0,
      "score": 7
    },
    {
      "id": "m26vi4o",
      "body": "I sure didn't. It was a clear demonstration of normality and no woman was demeaned with inmature adult humor. Dad's got great communication skills!",
      "created_utc": 1734282057.0,
      "score": 3
    },
    {
      "id": "m27dbq0",
      "body": "They may not decide he’s a creep, but will likely be very self-conscious in his presence. Do you want that? I wouldn’t.",
      "created_utc": 1734287782.0,
      "score": 4
    },
    {
      "id": "m273i18",
      "body": "Honestly I think any woman who claims to not look is a liar 😂",
      "created_utc": 1734284683.0,
      "score": 1
    },
    {
      "id": "m2dlcjp",
      "body": "I was that dad, except I wasn’t going to be answering some underaged kids questions who were not family.  \n\nSo I got a lot of second hand questions through my kids.  \n\nI travelled for work so I wasn’t physically present most of the time.  So I provided lots of information to make good decisions.  \n\nTrying to give information before needed. Including about mistakes.  \n\nLots of jokes and memes about me amongst my kids.",
      "created_utc": 1734378023.0,
      "score": 5
    },
    {
      "id": "m2eb8io",
      "body": "As demonstrated by video game style teabagging, where it's more about doing squats over your enemies to assert dominance and less about balls or mouths.",
      "created_utc": 1734386140.0,
      "score": 10
    },
    {
      "id": "m4am17n",
      "body": "Or even dragging them across one's face, was part of the definition for me.",
      "created_utc": 1735440053.0,
      "score": 1
    },
    {
      "id": "m29fuz9",
      "body": "I was told that was \"Dunkin' Donuts\"",
      "created_utc": 1734312562.0,
      "score": 93
    },
    {
      "id": "m290abx",
      "body": "Nope, but there is a shield available for that exact problem!",
      "created_utc": 1734306984.0,
      "score": 26
    },
    {
      "id": "m2deivr",
      "body": "Damm, you’d need some incredibly droopy balls to reach the water. Like Buddha’s ears but instead it’s the scrotum",
      "created_utc": 1734375923.0,
      "score": 7
    },
    {
      "id": "m2bxlwb",
      "body": "Do you want the version I told to the 12 year old, or what I would say to a more sexually experienced person? Everything I explain is very based on the understanding that the asker has of the situation 😊",
      "created_utc": 1734358611.0,
      "score": 13
    },
    {
      "id": "m2dkmdy",
      "body": "Always happy to help!",
      "created_utc": 1734377800.0,
      "score": 5
    },
    {
      "id": "m2d41u9",
      "body": "Just call me the Internet Safe Mom 😆",
      "created_utc": 1734372676.0,
      "score": 10
    },
    {
      "id": "m2g0fyx",
      "body": "I guess I should lol!",
      "created_utc": 1734408284.0,
      "score": 3
    },
    {
      "id": "m28x1uc",
      "body": "Oh, I could have a lot of fun being the next Sex with Sue (if you aren't Canadian, she was a national icon and she basically raised my generation over the radio on Sunday nights! SHE is worth a google!)",
      "created_utc": 1734305861.0,
      "score": 37
    },
    {
      "id": "m2a0wy7",
      "body": "My daughter and I thought about doing this, something like “if you’re afraid to ask your mom about sex questions, you can ask MY mom!” and do kind of a teenager-appropriate Dan Savage type of show.\n\nGuess we should have followed through with it ten years ago!",
      "created_utc": 1734320778.0,
      "score": 6
    },
    {
      "id": "m28xcrh",
      "body": "I wouldn't know where to begin to set that up, but I am available to answer all of the sex questions you forgot you even had! 🤣",
      "created_utc": 1734305968.0,
      "score": 11
    },
    {
      "id": "m27kj2a",
      "body": "It was! He was like, wait you check out guys that aren’t dad? Lol. Oops?",
      "created_utc": 1734290033.0,
      "score": 19
    },
    {
      "id": "m26qdls",
      "body": "Thanks. I’d like to share the story but I don’t want them thinking my husband is leering you know?",
      "created_utc": 1734280348.0,
      "score": 10
    },
    {
      "id": "m26vlg0",
      "body": "He does! Thanks. I’m just wondering if my friends might find it too much?",
      "created_utc": 1734282088.0,
      "score": 2
    },
    {
      "id": "m26x956",
      "body": "I agree, I didn’t feel it that way either. But the narrative is important. Sharing on Reddit with a bunch of strangers versus sharing with people around you—especially in person—can make a huge difference.",
      "created_utc": 1734282638.0,
      "score": 1
    },
    {
      "id": "m273njc",
      "body": "Right? lol. You get it, I am laughing over here",
      "created_utc": 1734284733.0,
      "score": 3
    },
    {
      "id": "m2h74ru",
      "body": "What did you say to the kids?",
      "created_utc": 1734433274.0,
      "score": 2
    },
    {
      "id": "m3612dn",
      "body": "You should get a special award on your profile",
      "created_utc": 1734804261.0,
      "score": 2
    },
    {
      "id": "mdcj9dc",
      "body": "No shame in it lol",
      "created_utc": 1739839138.0,
      "score": 1
    },
    {
      "id": "m29ifuu",
      "body": "I'm Polish, we don't get sex edu, we are still awfully influenced by the Catholic Church to do that properly on national level. Things are changing though and younger generation is laicising in record pace and more and more good resources are available. Me personally - part of my interior design business is designing kink dungeons :)",
      "created_utc": 1734313521.0,
      "score": 20
    },
    {
      "id": "m29mrug",
      "body": "Dr Ruth Westheimer sexually speaking you are on zhe air...",
      "created_utc": 1734315169.0,
      "score": 14
    },
    {
      "id": "m2a3ipr",
      "body": "I am a millennial from New England and somehow came across Sex with Sue while at my grandma’s house for Thanksgiving as a tween in Ohio. Not quite her target demographic, but man we loved her!",
      "created_utc": 1734321876.0,
      "score": 5
    },
    {
      "id": "m2bkb19",
      "body": "We had Dr. Ruth 😄 She introduced me to the joys (and how's) of masturbation when I was 13, listening to my mom's old handheld am/fm radio tucked under my pillow at night. Lol.",
      "created_utc": 1734352955.0,
      "score": 4
    },
    {
      "id": "m2a1mtq",
      "body": "I volunteered, at age 18 in 1995, for our city’s AIDS Service Agency. The first presentation I gave was to a Catholic School CCD program for high school seniors that was geared toward “answering the questions they were afraid to ask.”\n\nI somehow got through that (and they were the same age as me!) so nothing has scared me since. Once they stopped trying to shock me and impress their friends it was actually a really good conversation.",
      "created_utc": 1734321078.0,
      "score": 13
    },
    {
      "id": "m27l751",
      "body": "It's good for him to know it's not \"find the 'perfect' romantic partner and never notice anything again\". I was raised with the claim that was the case. Which I knew was a lie because toxic family. My mother has double digit husbands because she married them if she wanted sex and the inevitable doing this with a complete stranger mess ensued. Her mother had 18 husbands I know of. She may have had more after I went no contact. The reasons to celebrate this are numerous. Parenting is hard and there's always some doubt so I like to celebrate these small things that are only small today but build into something amazing for your kid",
      "created_utc": 1734290241.0,
      "score": 15
    },
    {
      "id": "m26r2yg",
      "body": "Yes, of course, totally understandable. I’d be over the moon sharing this exchange too! It really depends on how you narrate it. I’d suggest going easy or softening the 'your friends' part a bit. That should work well.",
      "created_utc": 1734280586.0,
      "score": 4
    },
    {
      "id": "m2hfgue",
      "body": "Scroll down for the answer 🙂",
      "created_utc": 1734438018.0,
      "score": 2
    },
    {
      "id": "m29tez8",
      "body": "I have so many questions and no idea where to begin…",
      "created_utc": 1734317761.0,
      "score": 9
    },
    {
      "id": "m27lg5k",
      "body": "Wow. That’s an amazing story and gives me such perspective! And yes I think it’s important to know that once we get married we keep our eyes and still find people attractive. It’s so toxic to not feel that way. I have so many questions for you!",
      "created_utc": 1734290318.0,
      "score": 8
    },
    {
      "id": "m26rxzc",
      "body": "That’s a good idea - I need a second draft lol",
      "created_utc": 1734280875.0,
      "score": 5
    },
    {
      "id": "m29vxam",
      "body": "Usually, as with all interior design stuff, you start with functions and communication (as in movement within space). No fancy equipment seems fancy when people keep stubbing their toe in a wall too close. From 2d design you go into 3d to see how the space works. You add colours and lights and make sure that socket and switches placement is logical and flows naturally through the space. That's the base. Then you make sure that all the decorations you use stay within the budget. Et voila - that's rule of thumb for designing any space, and if you have more questions go ahead and google designer bdsm spaces worldwide :)",
      "created_utc": 1734318753.0,
      "score": 13
    },
    {
      "id": "m2l3gfl",
      "body": "Stubbing a toe falls outside the erotic spectrum?",
      "created_utc": 1734483321.0,
      "score": 2
    }
  ]
}