{
  "id": "1gqwdbg",
  "title": "My boyfriend of 10 years is cheating and I don't care.",
  "selftext": "He thinks he's hiding it , but he's not .\nHe guards his phone like a dog , he stays up all night to text her,  her spends hours extra at \"work\" but isn't getting paid extra....\nI've seen the messages,  the texts , the videos they send .\n\nShe's my cousin, obsessed with him since the day they met at a family BBQ 9 years ago, she never stopped touching him or left his side. \nI've never gotten along with her because I just get bad vibes .\nThey got along together like a house on fire. \n\nHe and I have lived together  for 4 years.\nI'm saving up for a deposit for a new place and I will move out when our lease it up , no notice.  I just have to wait. \n\nToday a package came to our house under her name , home alone ,I opened it .\nA long distance female sex toy they could use together over Bluetooth.\nMy boyfriend and I are both male and do not have the anatomy to use this toy .\nI packed it up like I had never opened it and didn't say anything about it .\n\nWhen he got home he said it was a phone accessory for her boyfriend as a gift , she sent it here so he wouldn't see it.\nThe small customs sticker on the box says \" personal toy.\" He ripped it off when he thought I wasn't looking .\nHe'd go to her house to drop it off the next time her boyfriend wasn't home. \n\nI am checked out of this relationship, I have little savings but I'm bleeding everything dry to save for a new place to just up and leave. \n\nI'm done . I just have to wait a little longer...\n\n\n\n\n\n\n\n\n",
  "created_utc": 1731557097.0,
  "score": 5679,
  "num_comments": 101,
  "url": "https://www.reddit.com/r/offmychest/comments/1gqwdbg/my_boyfriend_of_10_years_is_cheating_and_i_dont/",
  "comments": [
    {
      "id": "lx1cfmb",
      "body": "I love that you have a plan and I love that you don’t care. Regardless I’m sorry that’s happening in your life but yes are you are already doing get your ducks in a row and leave one day never looking back!",
      "created_utc": 1731557617.0,
      "score": 4875
    },
    {
      "id": "lx1e907",
      "body": "If she has a bf let him know when you leave and let the family know",
      "created_utc": 1731558412.0,
      "score": 2596
    },
    {
      "id": "lx1nyh6",
      "body": "I'd be petty AF about this, lol. As soon as I could, I'd  take screenshots of everything and send them to myself.  Once I left id send all proof to her bf.",
      "created_utc": 1731563034.0,
      "score": 807
    },
    {
      "id": "lx1fm9r",
      "body": "Please make it known to everyone involved once you leave.",
      "created_utc": 1731559028.0,
      "score": 1760
    },
    {
      "id": "lx1d33t",
      "body": "What a coward he is. You are doing good. Stay strong. Some time people don’t even deserve a talk forget about love. You will be in a much better place in a couple of years.",
      "created_utc": 1731557902.0,
      "score": 290
    },
    {
      "id": "lx1r1im",
      "body": "I did the same with my exhole. Took 6 months to save some cash aside (he was also financially cheating, with 40k of debt behind my back for gadgets and junk, so I figured 40k of my own was fine to set up myself and the kids, as well as the child support I had to pay him because he apparently had 0 income, and had the kids the bare minimum time to be able to claim CS) got all my paperwork sorted, kids sorted then kicked him out.",
      "created_utc": 1731564702.0,
      "score": 132
    },
    {
      "id": "lx1r5j9",
      "body": "The best moves I made in my life were always made in silence. Keep your emotions in check, keep at it. Save money and go do it. Stay silent. This strategy saved my life and put me on a path of success. I escaped severe abuse, I escaped a horrible marriage, I made extremely smart financial choices, all by just staying silent, doing everything in secret. The less people know your mind the better. Don’t let them see it coming! Ever! Even today, most people think me naive, silly and with my head in the clouds. And this is what they’ll keep seeing. The world is no longer a safe place. My love goes to you!",
      "created_utc": 1731564765.0,
      "score": 311
    },
    {
      "id": "lx1ujaj",
      "body": "Im so petty i wouldve called a family gathering ( supper or something) and simply expose them in front of everyone then leave 👀",
      "created_utc": 1731566715.0,
      "score": 75
    },
    {
      "id": "lx1etjx",
      "body": "I am sorry. You deserve better than this.  \n\nI am glad you have a plan. I wish you well.",
      "created_utc": 1731558668.0,
      "score": 75
    },
    {
      "id": "lx37x6x",
      "body": "When you leave, make it known to others **why** you left. Don't give them the chance to control the narrative. Dishonest people like this will drag you through the mud to preserve their own reputations. \n\nCollect proof. These are dishonest people; they'll lie. When they do, having proof that they are will be valuable. \n\nOn a more petty note, don't confront your boyfriend. Don't give him closure. Let him feel lost as you do now; rob him of the chance to \"explain\" himself. Move out and be done. A lot of cheaters seem to get off on the confrontation; the climax of their affair. Don't give him one. \n\nAnd - get tested for STIs. \n\nTake care of yourself, okay? You'll get through this, and you'll be happy again one day soon.",
      "created_utc": 1731593769.0,
      "score": 46
    },
    {
      "id": "lx1i4v8",
      "body": "Godspeed to a successful plan.",
      "created_utc": 1731560191.0,
      "score": 38
    },
    {
      "id": "lx1gizo",
      "body": "You deserve so much better man 🙏",
      "created_utc": 1731559447.0,
      "score": 57
    },
    {
      "id": "lx2ltvg",
      "body": "There's something great about knowing your partners cheating but they don't know you know. You kinda just laugh at them on the inside and look at how crap they are at hiding it and just how pathetic they are.",
      "created_utc": 1731584247.0,
      "score": 29
    },
    {
      "id": "lx1buwc",
      "body": "I’m so sorry you’re going through this and I wish you all the strength you need to get where you not only need, but DESERVE to be🩷",
      "created_utc": 1731557370.0,
      "score": 16
    },
    {
      "id": "lx2vfv7",
      "body": "I’ve never understood why people cheat on their boyfriend/girlfriend. If you find someone you like more, just breakup. Why put someone through all that? They aren’t married. It’s not like they have to go through the legal process of everything. So strange. \n\nOP, I’m sorry you are going through this but I’m glad you have a plan.",
      "created_utc": 1731588878.0,
      "score": 14
    },
    {
      "id": "lx1v299",
      "body": "People are fucked man, I hear and see this type of stuff constantly happening nowadays and my heart breaks. \n\nWhat is wrong with the vast majority of humans on earth today??! \n\nHurting those who don’t deserve it with impunity thinking there won’t be a day of reckoning is crazy to me. I’m sorry you’re having to deal with this but rest assured, his day will come. We all have the power of choice and those whose choose evil have a special place just for them.",
      "created_utc": 1731567027.0,
      "score": 32
    },
    {
      "id": "lx2c0k4",
      "body": "I’m am constantly disgusted by the cowardice of people. Leave as soon as you can and find a new happy.",
      "created_utc": 1731578194.0,
      "score": 10
    },
    {
      "id": "lx3esbd",
      "body": "I wish i were rich and could send you a bucket of cash so you could gtfo right now. Hoping it doesn’t take long (and screw the lease, leave as soon as you have enough money).",
      "created_utc": 1731596173.0,
      "score": 10
    },
    {
      "id": "lx3gzvd",
      "body": "Somebody donate to this man so he can leave this situation asap",
      "created_utc": 1731596912.0,
      "score": 8
    },
    {
      "id": "lx2j27o",
      "body": "Make sure to leave him nothing of your stuff. Let him invite you now when you watch out and let pay for more stuff. Say you are saving for a birthday present. That way you will save more money.\n\nGet your important documents in a safe spot.\n\nWhen you left the apartment, take your proof and send it to your family groupchats and then block them. Good luck.\n\n\nI am sorry you are going through this.",
      "created_utc": 1731582673.0,
      "score": 9
    },
    {
      "id": "lx38npi",
      "body": "To quote the Queen of Petty (Charlotte Dobre)\n\n\"We move in the Shadows\"\n\nGood for you OP. Keep to the plan. I'm so so sorry your cousin and (ex) partner are such trash.",
      "created_utc": 1731594033.0,
      "score": 9
    },
    {
      "id": "lx2db6t",
      "body": "I am so sorry this happened to you. Can’t wait for the update once you’re out. We are rooting for you!",
      "created_utc": 1731579059.0,
      "score": 7
    },
    {
      "id": "lx381sj",
      "body": "please ghost him after you leave\n\nno explanation at all",
      "created_utc": 1731593815.0,
      "score": 8
    },
    {
      "id": "lx39lux",
      "body": "I knew it was over when now my ex-husband cheated a second time and I couldn't care less. I was able to walk away and it was the best feeling ever! The woman he cheated on me with wanted to talk over coffee one morning. We hung out few times and spoke on the phone sometimes. \n\nIt's funny how cheaters think they will never be caught. Their behavior changes drastically and they leave randomly for long periods time. You can confront them yet they still deny.",
      "created_utc": 1731594373.0,
      "score": 6
    },
    {
      "id": "lx3iedi",
      "body": "Steal some of his things and sell it",
      "created_utc": 1731597372.0,
      "score": 8
    },
    {
      "id": "lx2bhx0",
      "body": "i am sorry you went through this, it's the most evil thing you can do to a partner is to cheat. keep skimming money and get yourself another bank account . take money from shopping, bills, everything you can . is the house his/ yours? sell anything of value and say it broke replace it with cheap alternative. if your questioned mention her name in passing, it will trigger guilty feelings, all's fair in love and war.  Hold your phone laugh and giggle while hes watching. hide your phone. mirror what has doing to you",
      "created_utc": 1731577845.0,
      "score": 7
    },
    {
      "id": "lx5bt9n",
      "body": "Fuck I dont even know what to say but Im sending you a hug",
      "created_utc": 1731617501.0,
      "score": 6
    },
    {
      "id": "lx1py86",
      "body": "please, please, PLEASE get some petty revenge on our behalf. save every incriminating thing you can and send everything to their individual parents, siblings, friends, coworkers..",
      "created_utc": 1731564101.0,
      "score": 18
    },
    {
      "id": "lx2fny8",
      "body": "Super proud of you, hope all goes well and that you're safe and happy once they're out of your hair<3",
      "created_utc": 1731580593.0,
      "score": 5
    },
    {
      "id": "lx4ofcv",
      "body": "I'm so sorry.  Betrayal is so painful.",
      "created_utc": 1731610321.0,
      "score": 4
    },
    {
      "id": "lx4k06v",
      "body": "Leave and salt the earth behind you.",
      "created_utc": 1731608976.0,
      "score": 7
    },
    {
      "id": "lx49xdw",
      "body": "Same. My ex cheated but prior he raped me. I finally have enough sense to leave him.\n\nUgly—stranger raped me\nUgly—cheatee/abigail conspired to my rape",
      "created_utc": 1731605934.0,
      "score": 3
    },
    {
      "id": "lx243m9",
      "body": "Please don’t forget to leave some anchovies and a pack of shrimps inside your heater and vents. Maybe add a bucket of glitters too while you’re at it honey. I wish you good luck, you got this!",
      "created_utc": 1731572779.0,
      "score": 8
    },
    {
      "id": "lx284wd",
      "body": "Werk",
      "created_utc": 1731575550.0,
      "score": 2
    },
    {
      "id": "lx2b1eq",
      "body": "Yeah leave and call put your cousin and call put your ex at the time and slowly leave and block them both. \nI hate cheaters and I'm glad you're getting out.",
      "created_utc": 1731577533.0,
      "score": 2
    },
    {
      "id": "lx2r6i2",
      "body": "It’s so hard knowing he’s doing this to you, but props to you for knowing to just walk away. I wish I could. It’s unfortunate people suck. Best of luck to you!",
      "created_utc": 1731586960.0,
      "score": 2
    },
    {
      "id": "lx6qno7",
      "body": "Get evidence, pictures, videos and messages. After you have left create a group chat with all the family and her boyfriend, post all the evidence, not the videos and spicy pictures because you do not need them to come after you for revenge porn, then exit the group and block both of them.",
      "created_utc": 1731633826.0,
      "score": 2
    },
    {
      "id": "lx7nyxc",
      "body": "So proud of you! 👏🏾",
      "created_utc": 1731645553.0,
      "score": 2
    },
    {
      "id": "lx7p761",
      "body": "I am so, so sorry you're going through this.",
      "created_utc": 1731646059.0,
      "score": 2
    },
    {
      "id": "lx5gptq",
      "body": "I definitely wouldn’t have the impulse control you have.",
      "created_utc": 1731618997.0,
      "score": 4
    },
    {
      "id": "lx3x1e0",
      "body": "You should send the boyfriend all the evidence you have",
      "created_utc": 1731601991.0,
      "score": 2
    },
    {
      "id": "lx66oqv",
      "body": "You are on a mission. Stay on target.\n\nu/Rejected_Rainbow please update once your mission is complete or if you need reinforcement/moral support along the way. \n\nYou are totally a badass and being your best friend to yourself. \n\nOnce your mission is complete, know that we are here to provide the virtual support or celebratory chorus you need.",
      "created_utc": 1731627121.0,
      "score": 1
    },
    {
      "id": "lx6hs5t",
      "body": "You already won.\nGood move. I would pretend I am beyond stupid too, so he doesn't invite her over while I would be stuck in that place. \n\nIt probably still feels bad being and sleeping in the same bed as him. But, it would be worse if they did it openly in front of you I suppose.\n\nOnce you're gone you should sent the most cringey-furry suit to his adress, with a note \"It's my biggest fantasy, wear this the next time you come over. X\"\n\nAnd just laugh at the thought of it.\nMaybe he goes, maybe they're shocked because \"WHO DID THIS? DID HE KNOW?!\" \n\nSo while you're saving up, try to find the most awful suit possible, just to have a laugh.",
      "created_utc": 1731630812.0,
      "score": 1
    },
    {
      "id": "lx8zpu6",
      "body": "I'm sensing gone girl vibes 😂 I'm sorry you're dealing with this, no one ever deserves that, but stay strong and wait till you achieve what you want, then dumb his ass\nMaybe make in a package of all evidence you can gather on their affair, throw a party and put it on display, then mic drop and leave to start your new life.",
      "created_utc": 1731671385.0,
      "score": 1
    },
    {
      "id": "lx99my0",
      "body": "I may not know how hurt you must feel OP, but I'm very proud of you for prioritizing yourself and leaving. You're worth more than what you have right now and I'm glad you were able to recognize that.",
      "created_utc": 1731675713.0,
      "score": 1
    },
    {
      "id": "lxd46zg",
      "body": "Bounce now. Take what you can and go live with a friend or family. Fuck the lease. Go now. You can do this.",
      "created_utc": 1731720477.0,
      "score": 1
    },
    {
      "id": "lxd5tmc",
      "body": "Good for you!  If you ever feel yourself feeling bad, please know you got a group of folks cheering for you!  Lucky!",
      "created_utc": 1731721105.0,
      "score": 1
    },
    {
      "id": "lxroqpr",
      "body": "The fact that you’re both male was a plot twist I did not see coming haha. You’re handling this like a champ, detached emotionally now all you gotta do is detach lives when the lease is up!",
      "created_utc": 1731944129.0,
      "score": 1
    },
    {
      "id": "lxz9f3y",
      "body": "Good luck, from fellow gay 2. I think ur made cuz it’s a she, l u deserve br. ",
      "created_utc": 1732045607.0,
      "score": 1
    },
    {
      "id": "lz79q6x",
      "body": "good. get away from there as soon as you can. just know that that person has betrayed you and they're taking advantage of you in their own little narcissistic world they think they're justified. you deserve better just get the hell out of there good luck to you",
      "created_utc": 1732686394.0,
      "score": 1
    },
    {
      "id": "m0m11ut",
      "body": "I would’ve got poison oak or Ivy put it around the toy put it back in the packaging and reseal it and pretend nothing happened lol",
      "created_utc": 1733437015.0,
      "score": 1
    },
    {
      "id": "ma2qvbc",
      "body": "Both of them are horrible. I hope you were able to move out by now, any updates?",
      "created_utc": 1738269983.0,
      "score": 1
    },
    {
      "id": "mfkxjax",
      "body": "Y",
      "created_utc": 1740908315.0,
      "score": 1
    },
    {
      "id": "migzzaj",
      "body": "I liked to boyfriend and girlfriend with to friends into a school and so you ",
      "created_utc": 1742319382.0,
      "score": 1
    },
    {
      "id": "lx4mh0y",
      "body": "I’m sorry I read boyfriend of 10 years and stopped reading😭😭. But im glad you’re leaving! Good luck!",
      "created_utc": 1731609727.0,
      "score": 0
    },
    {
      "id": "lx1wzrl",
      "body": "Just break up already.",
      "created_utc": 1731568189.0,
      "score": -9
    },
    {
      "id": "lx85pm9",
      "body": "Why don't you talk about it?",
      "created_utc": 1731654016.0,
      "score": 0
    },
    {
      "id": "lx1kf04",
      "body": "Why have you been dating for 10 years and havent gotten married?",
      "created_utc": 1731561275.0,
      "score": -45
    },
    {
      "id": "lx4py8l",
      "body": "Seriously - OP you are a badass and I respect the hell out of you",
      "created_utc": 1731610781.0,
      "score": 449
    },
    {
      "id": "lx6os5x",
      "body": "It's so gross 100% OP deserves so much more than this gives me the ick considering people who are meant to be your literal partner live a entirely different life",
      "created_utc": 1731633180.0,
      "score": 82
    },
    {
      "id": "lx1kjcc",
      "body": "This! They expose people to pentential stds and lifelong ones.",
      "created_utc": 1731561334.0,
      "score": 839
    },
    {
      "id": "lx1p3oh",
      "body": "Definitely this. But also, save receipts. Put aside some proof (screenshots of texts as an example) so they don't think you're just a bitter ex trying to get back at a cousin you don't like and your ex-bf.\n\n I think it's amazing he doesn't think you know how to read (like, who wouldn't catch \"personal toy\" on a package that was delivered to their house regardless of who's name is on it?), or that he's somehow ~*sneaky*~. Better for you anyway! Now you've got your exit plan and he's none the wiser. Keep us updated!",
      "created_utc": 1731563637.0,
      "score": 423
    },
    {
      "id": "lx2j8ql",
      "body": "Yep, send every screenshot, every video, to her bf.",
      "created_utc": 1731582780.0,
      "score": 96
    },
    {
      "id": "lx7tez2",
      "body": "Is it even worth it tho? I know we all want to blow shit up…but it seems like the OP is just checked out emotionally and in this particular case, it’s better for their own emotional well- being (the OP’s) to just let sleeping dogs lie. If they’re content now, let them be content without stirring up the hornets nest. ",
      "created_utc": 1731647893.0,
      "score": 16
    },
    {
      "id": "lx5h30c",
      "body": "Right! Scholar.",
      "created_utc": 1731619107.0,
      "score": 9
    },
    {
      "id": "lxlv8wj",
      "body": "Exactly. If I found out that I was an affair partner, I would instantly end it and if I could, I’d tell the primary partner so they’d know that they were also wronged.",
      "created_utc": 1731858915.0,
      "score": 1
    },
    {
      "id": "lx2c1sd",
      "body": "But that’s not petty…it’s the right thing to do",
      "created_utc": 1731578216.0,
      "score": 297
    },
    {
      "id": "lx2exwl",
      "body": "No petty would be to visit the cousin, break down in tears, and when she asks what’s wrong, take your time, cry some more and finally say you have HIV or  drug resistant gonorrhea or something, but that the boyfriend doesn’t know.",
      "created_utc": 1731580121.0,
      "score": 181
    },
    {
      "id": "lx38p8c",
      "body": "Petty would be making a group text with all the family from her side and his boyfriends and sending it there. \n\nThen blasting them on social media. \n\nAnd blocking both of them.",
      "created_utc": 1731594049.0,
      "score": 47
    },
    {
      "id": "lx4gixw",
      "body": "I woulda coated the toy in some pepper oil too, but I'm realllllll petty",
      "created_utc": 1731607924.0,
      "score": 32
    },
    {
      "id": "lx2lfm9",
      "body": "The fact that he knows? If I was him after I’ve safely left I’d get proof and I’d just post it to the cousins house addressed to the bf or to his work.",
      "created_utc": 1731584025.0,
      "score": 362
    },
    {
      "id": "lx21gv1",
      "body": "LOL'd at exhole. And, good for you!!",
      "created_utc": 1731571028.0,
      "score": 66
    },
    {
      "id": "lx73mcc",
      "body": "Brilliant advice",
      "created_utc": 1731638204.0,
      "score": 6
    },
    {
      "id": "lx2b75a",
      "body": "Yes,he should do it",
      "created_utc": 1731577642.0,
      "score": 13
    },
    {
      "id": "lx2hso0",
      "body": "Right,why do people cheat ?",
      "created_utc": 1731581916.0,
      "score": 9
    },
    {
      "id": "lx6hxua",
      "body": "Also, that toy, OBVIOUSLY, she wants you to find out.",
      "created_utc": 1731630865.0,
      "score": 2
    },
    {
      "id": "lx1l792",
      "body": "Everyone’s timeline is different. And clearly not marrying that scumbag was the right choice",
      "created_utc": 1731561660.0,
      "score": 31
    },
    {
      "id": "lx2h0qx",
      "body": "[deleted]",
      "created_utc": 1731581441.0,
      "score": 9
    },
    {
      "id": "lx2e4xx",
      "body": "Not everyone cares to get married",
      "created_utc": 1731579598.0,
      "score": 8
    },
    {
      "id": "lxh9hyg",
      "body": "Start a family Facebook group. Add cousin, her boyfriend, your entire family, his entire family, your boyfriends entire family - send everything absolutely everything to the entire group.\n\n\nGo nuclear. Not because you care, but because they are scum and everyone should know it. ",
      "created_utc": 1731785882.0,
      "score": 5
    },
    {
      "id": "lxbe54q",
      "body": "At least tell her boyfriend.  It's only fair (if there is a boyfriend) and the right thing to do.  Not our of bitterness, but because he should know that his Gf is cheating on him. \n\nAlso I wouldn't hide from people the \"why\", if they ask they recieve the answer.  \"Why you and cheater broke up?\", \"because he was sleeping with dear cousin, and I deserve better\", no drama, just facts.",
      "created_utc": 1731699650.0,
      "score": 3
    },
    {
      "id": "lx2eg7l",
      "body": "You're right. Start fundraising by selling of his stuff. Stuff he doesnt use every day. Stuff he'll miss. Pawn it and feign ignorance when he starts looking for it.",
      "created_utc": 1731579801.0,
      "score": 113
    },
    {
      "id": "lx9pe66",
      "body": "OP I swear to god you better do this!!!!",
      "created_utc": 1731681362.0,
      "score": 8
    },
    {
      "id": "lx7yzty",
      "body": "Thanks. \n\nI'm lucky that he was stupid enough to hit up one of my friends, and she told me privately so I could process the emotions, and not confront him right there and then.\n\nWe are thriving now, and ironically his relationship with our kids is better now he can visit when he feels like it and live like a bachelor the rest of the time.",
      "created_utc": 1731650538.0,
      "score": 6
    },
    {
      "id": "lx4h3iu",
      "body": "I’d fly in to witness this shit\n\nOP I’m sorry this is happening to you.",
      "created_utc": 1731608098.0,
      "score": 9
    },
    {
      "id": "lx50bqb",
      "body": "[deleted]",
      "created_utc": 1731613959.0,
      "score": 5
    },
    {
      "id": "lx6sui2",
      "body": "I assumed they were living in a country that allows gay marriage.",
      "created_utc": 1731634568.0,
      "score": 0
    },
    {
      "id": "lx42r79",
      "body": "\"Yeah, that's weird. I'm not sure where it went. You could try asking my cousin; she stopped by a while ago and went in there for some reason.\"",
      "created_utc": 1731603742.0,
      "score": 61
    },
    {
      "id": "lx50muc",
      "body": "Yup \nStop being selfish and break up \nDon't be with your panther and see another unless is agrees if not \nYou're a cheater",
      "created_utc": 1731614052.0,
      "score": 5
    },
    {
      "id": "lxd63b9",
      "body": "Hahahaha 👍 ",
      "created_utc": 1731721211.0,
      "score": 2
    }
  ]
}