{
  "id": "1gmfl1e",
  "title": "“YOUR body MY choice”",
  "selftext": "What the actual fuck is that about? I just can’t believe these words are coming out of certain men’s mouths!! It’s fucking vile.\n\nI literally saw a post on twitter where a guy said “Your body my choice” and a girl replied with “we just won’t let you impregnate us” to which another man replied with some shit like “we don’t need your permission”. Like WHAT THE ACTUAL FUCK? \n\nDo people actually think this is funny? Do you think it’s fucking funny that women, who were already wary of men, are now fucking terrified of them?? \n\nDo these men not care about their mothers? Their grandmothers, sisters, aunts, nieces? Their DAUGHTERS??\n\nFuck (not in the way they’d like you to) every man who has said this, thought about saying this and is thinking about acting on this. \n\nYou will NEVER be entitled to a woman’s body. EVER.\n\nEdit: I used twitter as an example because that is where I personally saw the comment where men were bragging about having ownership over a woman’s body. If you read the many comments below you will see that these comments are NOT only being said online, they are being said to women in the real world too. \n\nSo to all those people suggesting that women should “delete their social media accounts” or just simply “ignore the trolling” please do give suggestions on how to do that in real life situations as-well.",
  "created_utc": 1731062075.0,
  "score": 5592,
  "num_comments": 838,
  "url": "https://www.reddit.com/r/offmychest/comments/1gmfl1e/your_body_my_choice/",
  "comments": [
    {
      "id": "lw2b7y2",
      "body": "The Nick Fuentes rant was the scariest shit I've seen in a long time. To think men actually admire this waste of space is beyond me. I hope he trips in traffic.",
      "created_utc": 1731066384.0,
      "score": 1885
    },
    {
      "id": "lw27ly6",
      "body": "I'd be humiliated as a father if either of my sons ever said such a thing.",
      "created_utc": 1731064455.0,
      "score": 2487
    },
    {
      "id": "lw2ndtp",
      "body": "Old white man here. From what I’ve seen, the men with this mentality are the men who are most dependent on woman for the necessities of their lives. The income from higher educational attainment. Their food. A sanitary living space. Pushing them to maintain relationships with family and friends. Taking care of children. Making doctor appointments. They base their entire sense of identity and self worth on women. \n\nI suggest women stop providing these things. \n\nWhat this society lacks, and has since the ‘80s, is any sense of solidarity. We all need to look beyond individualism and form communities with others who realize that an attack on the least powerful among us diminishes us all. \n\nI hear your grief, rage, and fear. I know that you’re probably not in the headspace to listen to assurances from any man right now. But just, for what it’s worth… “Your body, your choice” is something I consider a priority above all others to protect. Because bodily autonomy is a human issue. If these men think that the state only has an interest in violating the autonomy of women they are fools.",
      "created_utc": 1731071636.0,
      "score": 1337
    },
    {
      "id": "lw2g8t0",
      "body": "Correct response is \"your life my knife\". Two can play at that game",
      "created_utc": 1731068732.0,
      "score": 289
    },
    {
      "id": "lw27xxd",
      "body": "And yet these were the loudest complainers when people chose the bear.",
      "created_utc": 1731064638.0,
      "score": 2097
    },
    {
      "id": "lw29pno",
      "body": "There will be ANOTHER spike in inceldom, and I have no idea what will fix it. \n\nThe US is so influential on the internet, that it will trickle down outside of the states.",
      "created_utc": 1731065603.0,
      "score": 238
    },
    {
      "id": "lw27a5w",
      "body": "They don't think it's funny someone is terrified. That would be ascribing feelings to objects. They do not recognize women as humans with feelings. So calling for their empathy to women's feelings to them is akin to saying \"but think of the table's feelings\"!",
      "created_utc": 1731064269.0,
      "score": 648
    },
    {
      "id": "lw2c1o8",
      "body": "Your president would have sex with his own daughter if she wasn't his daughter.  That's what men in your country have as a role model.",
      "created_utc": 1731066790.0,
      "score": 311
    },
    {
      "id": "lw318ia",
      "body": "I told my teenage son, who is a rather large football player that loves his mother and respects women, that if he ever heard a boy saying that to a girl at school, he could wear him out and I’d take him to lunch every day of his suspension. We have to raise our boys to call out this bullshit. Men have to stand up to other men. We need the good guys to be loud, now more than ever.",
      "created_utc": 1731076490.0,
      "score": 103
    },
    {
      "id": "lw2a9q4",
      "body": "Arm yourselves ladies",
      "created_utc": 1731065897.0,
      "score": 192
    },
    {
      "id": "lw28hz1",
      "body": "The transformation to Gilead is really happening and happening fast.",
      "created_utc": 1731064946.0,
      "score": 99
    },
    {
      "id": "lw26qq4",
      "body": "There was a protest yesterday. A man was holding a sign that said “women are property”. Another was holding a sign that compared women to land, animals and cars. This is going to get very ugly very quickly for women. Batten down the hatches and get ready to fight for your lives, literally.\n\nEdit: you can downvote this all you’d like. It won’t make it less true. Look up the [protest at Texas State University yesterday.](https://www.kvue.com/article/news/education/schools/texas-state-protest-president-response/269-309c8b01-b3ad-44ce-9c97-16395b9ddf53)",
      "created_utc": 1731063959.0,
      "score": 740
    },
    {
      "id": "lw2a1ve",
      "body": "Children are seeing this and they're going to learn from this. I can't even contemplate what this means in a year... 'dontcrossagayman' on insta said his god daughter was in HS and boys were chanting this... FFS. This sickens me and makes me depressed.",
      "created_utc": 1731065783.0,
      "score": 78
    },
    {
      "id": "lw278vf",
      "body": "Sign your daughters and yourselves up for kickboxing classes, get into the gym , and make yourselves stronger and harder to physically control. \n\nWomen don't build big muscles like men do, but we can make ourselves physically stronger but lifting heavy weights.",
      "created_utc": 1731064248.0,
      "score": 420
    },
    {
      "id": "lw29yq0",
      "body": "America hates women",
      "created_utc": 1731065736.0,
      "score": 132
    },
    {
      "id": "lw2gawe",
      "body": "I was always completely flabbergasted seeing pictures of Iran, Afghanistan, etc from the 1970's and wondering how the fuck it turned into what it is (in relation to women's rights). Looks like we may all have a front row seat to watch it happen in real time for US women. \n\nPlease protect yourselves, ladies. Holy shit, I feel for you all.",
      "created_utc": 1731068757.0,
      "score": 62
    },
    {
      "id": "lw2a27r",
      "body": "These elections made me realize why I'm already so bitter at the world at 25 years old, and I'm not even American. And I wish I could be the bigger person than to wish these men(and women who voted against their own rights) to burn in hell but I'm not.",
      "created_utc": 1731065788.0,
      "score": 171
    },
    {
      "id": "lw26yni",
      "body": "That’s why when certain men are elected to a position of authority, when I say it’s scary, it’s scary.",
      "created_utc": 1731064086.0,
      "score": 55
    },
    {
      "id": "lw2tlo5",
      "body": "The same demographic who is saying “your body my choice” are the same ones who whine about wanting “financial abortions.” \n\nIt’s disgusting. I fully support doxxing the men who say this. They should be known and shamed, so that no woman ever goes near them for her own safety.",
      "created_utc": 1731073886.0,
      "score": 51
    },
    {
      "id": "lw2aobe",
      "body": "Unfortunately there are men who think like this. I've  experienced being taken advantage of, and let me tell you; waiting to find out if I was pregnant was HORRIFYING. As someone who is chronically forgetful with ADHD I sometimes missed a pill or 2 and had to double up in the past.  To avoid any nerves and take back my power back; something that was so helpful (to me) was getting an IUD. The pain getting it (5 min) and the spotting for a couple months was worth it to me because it gives me ease of mind. I can't get pregnant for 10 years unless I CHOOSE to take it out.  If it's something you're able to do, do your own research on options and see if it's something you'd be interested in.",
      "created_utc": 1731066105.0,
      "score": 42
    },
    {
      "id": "lw23ph1",
      "body": "I am in disbelief that this is a thing people feel comfortable saying to other human beings. I mean I fully expected it and highly recommend anyone who can get pregnant to look into semi permanent birth control ASAP but I am astounded at how quickly it's happening.",
      "created_utc": 1731062282.0,
      "score": 193
    },
    {
      "id": "lw3g34y",
      "body": "Dead men don’t rape is my new motto. Going to buy a gun today since the right won and LOVES their guns, I’m just doing what I have the American right to do 🤷🏻‍♀️",
      "created_utc": 1731081070.0,
      "score": 42
    },
    {
      "id": "lw2algy",
      "body": "Women of USA, get a gun and arm yourself. Shoot to kill any fucker who tries to rape you, please",
      "created_utc": 1731066065.0,
      "score": 77
    },
    {
      "id": "lw2epx6",
      "body": "These fucking \"men\" are showing that women should choose bears, that \"...not all men!\" actually does mean fuck all and that there are evidently a LOT of men that do think consent is optional, and that the whole 4B movement really should be the female default.\n\n&nbsp;\n\nAs a white, straight, middle-aged, middle-class guy, I feel sick that I have to walk this planet with men that are either trolling/joking about this to women who are rightly afraid, or that actually DO think this. Both are *equally* concerning because there's no way to distinguish between the two - and no amount of protestation from men of \"Well, I wouldn't really, I was just being a misogynist PoS because .... blah blah blah\" does anything but show them as absolute PoS's for various other reasons (Reactionary anti-feminism, ignorance, stupidity, hatred of women, infantile \"hate all women because one hurt me once!\" shit).\n\n&nbsp;\n\n4B allllll the way ladies. Alllllll the way. Republican men were already whining it was harder to date once women knew of their political leanings. I say reduce that to zero, scorched earth the fuck out of the dating scene, don't allow this shit to propagate into the next generation by ensuring there is no next generation of these idiotic, myopic, rapist fuckwads.",
      "created_utc": 1731068051.0,
      "score": 73
    },
    {
      "id": "lw2dqu8",
      "body": "Considering the majority of white men and a large portion of hispanic men voted for this misogynistic and racist POS with a lot of henchmen salivating at the opportunity to teach women, people of colour and lgtbq people 'a lesson', I think it would be a good idea if those targeted banded together. In a sort of enclave, underground networks, etc. \n\nSafety in numbers. They are easily targeted alone, but together they can defend themselves. And for all those white women who voted against their (grand-) daughters, sisters, mothers... their betrayal will pay themselves back in karma. They will suffer with the rest of you. As a European woman: I am so very sorry for this fascist rise to power and the unabashed bigotry and misogyny sweeping across your country. \n\nAnd I am also very, very afraid what is going to happen to the rest of the world. As Putin's puppet he will probably withdray (again) from the climate agreements and try to leave NATO. Which will leave us to the mercy of Putin, who is already salivating at the East European borders. If he invades the Baltic states (which he has wanted for a long, long time), Europe is obligated to help their fellow NATO-states. Which in turns means that my son (and all the other sons and daughters of his generation) will be drafted. \n\nI am very scared for the future.",
      "created_utc": 1731067602.0,
      "score": 39
    },
    {
      "id": "lw3ux83",
      "body": "My fucking cousin retweeted this shit. According to my dad, my aunt was so angry that she’s talking about kicking him out of the house.",
      "created_utc": 1731085374.0,
      "score": 36
    },
    {
      "id": "lw2ivax",
      "body": "This is why women will choose the bear.",
      "created_utc": 1731069852.0,
      "score": 30
    },
    {
      "id": "lw3739y",
      "body": "I was talking to someone earlier.  I went out to get the mail and walked by a squirrel. The squirrel was afraid and ran up a tree to get away from me. Now \\*I\\* know that I'd cut my hands off before I hurt that squirrel. But that squirrel doesn't know that. He don't know which humans will hurt him and which would pet him. He has to err on the side of caution and assume we're all out to get him.  And with the climate as it is, unfortunately women are going to be forced to be this way with men even more than some already are.  I know men that I would trust with my life. They are amazing.  But when I see a strange man, I have no way of knowing if he's a good person or if he'd bash my head in without a second thought because he doesn't see me as a human being. So like the squirrel, I have to err on the side of caution.",
      "created_utc": 1731078362.0,
      "score": 31
    },
    {
      "id": "lw2ardy",
      "body": "Enabling people like this is my biggest fear of this administration. That we’ll see more Proud Boys and Q wackos come out of the shadows and feel even more emboldened to spew their hate.",
      "created_utc": 1731066150.0,
      "score": 26
    },
    {
      "id": "lw27rum",
      "body": "They feel emboldened. It's already hard to prove and prosecute rape & the upcoming administration will make it harder. Meanwhile getting an abortion is becoming increasingly impossible. So that's literally their plan--rape and impregnate as many women as possible, then walk away scott free.",
      "created_utc": 1731064546.0,
      "score": 51
    },
    {
      "id": "lw27l0w",
      "body": "There are a few things worth going to prison for. Defending you from these fucking weirdos is number 2 on the list behind my family. I will tell you this with confidence. The majority of us \"men\" will die to defend you. \n\nI know it does not feel that way, but I promise we are here.",
      "created_utc": 1731064441.0,
      "score": 245
    },
    {
      "id": "lw2k5hj",
      "body": "Me as a man am truly disgusted by those “men”. A real man is kind and genuine and prioritizes mutual consent and respect. That’s what a man is. I am very sorry women are going through this. Please know that there are good men out there who will do their best to protect you.\n\nIf I may offer advice, arm yourself with heavy weaponry as self defense. You are entitled to defend yourself and now the stakes are higher than ever, so I beg you to never go outside unarmed and more importantly UNPREPARED.",
      "created_utc": 1731070370.0,
      "score": 25
    },
    {
      "id": "lw3aipj",
      "body": "Well then, let's flip it shall we?   \n  \nIf you feel entitled to commit an act of violence to a woman's body against her will, then she has every right to carry a knife or gun & direct it at your dick.",
      "created_utc": 1731079414.0,
      "score": 19
    },
    {
      "id": "lw2cphr",
      "body": "I asked my husband his opinion on this.( we have very different view on life) he said “ I have no uterus so I have no opinion. But do not take this as me not caring. Chip go down and I will  watch the life leave someone eyes if they harm you or our daughters.”",
      "created_utc": 1731067112.0,
      "score": 20
    },
    {
      "id": "lw25xhx",
      "body": "These man care about nothing more than themselves. That’s why the election went the way it did. The voted for a self reflection alot of them. They are scared of sharing and scare of change. They doubled down on the cruelty and control. I hope these men have the women in their lives leave them. They do not deserve to control anyone and they are not entitled to anyone’s bodies. They won’t care tho and they own the courts. It’s scary as hell.",
      "created_utc": 1731063488.0,
      "score": 69
    },
    {
      "id": "lw2jn6q",
      "body": "I mean us women didnt want to fuck them before. We certainly don't now.  Hope they enjoy celibacy.\n\nAt least they are making it easy to know who to avoid I guess.",
      "created_utc": 1731070166.0,
      "score": 17
    },
    {
      "id": "lw29jsu",
      "body": "Don’t say anything about bears though, makes you seem irrational /s.",
      "created_utc": 1731065517.0,
      "score": 33
    },
    {
      "id": "lw25lhc",
      "body": "I'm horrified for American women. I hope they manage to stand their ground and prevent all the misogynists from\nPutting them down.\n\nI wish I could do more to help besides offer words of encouragement :(",
      "created_utc": 1731063291.0,
      "score": 59
    },
    {
      "id": "lw2f93d",
      "body": "If they wanna go back to the 1900s, then I’ll make sure to clean my pew pew right in front of any boy that even thinks he wants to be around my daughter. She may hate me, but at least she will be here to do it. I refuse to allow anyone to take anything from her or do anything to her without her permission. I WILL go to jail if that’s what it takes to protect my children.",
      "created_utc": 1731068293.0,
      "score": 16
    },
    {
      "id": "lw2j4zy",
      "body": "I think most of us feel genuinely baffled and astonished that these people are allowed to say such things about women with no repercussions. It's getting really ugly for women every where, in varying degrees and it's very very scary to see how much it's getting normalised.",
      "created_utc": 1731069961.0,
      "score": 15
    },
    {
      "id": "lw2t56b",
      "body": "I used to be all about \"fight hate with love\" and \"take the highroad \", but I'm done. I'm SO over it.\n\nNow it's \"action has consequences \", \"FAFO\", and \"an eye for an eye\".\n\nAny man with the your body, my choice philosophy should get a taste of that himself.",
      "created_utc": 1731073723.0,
      "score": 15
    },
    {
      "id": "lw2ki03",
      "body": "Electing a rapist will bring out this kind of vile behavior.",
      "created_utc": 1731070509.0,
      "score": 12
    },
    {
      "id": "lw2t7br",
      "body": "Women, through history have been presented as something \"less\", because men could easier lift rocks (probably) than them. Because religion, persived and written from men, said so. Women are still traded as cuttles between their male family members. Women are forced be covered from head to toes, in parts of the world, because a man said so. \n\nAnd we allowed them. Still do. The \"sugar baby\" trend and the \"trad wife\" trend is one and the same. Sugar babies are not hustlers. They are not boss babes. They are pitifull creatures that will do anything for a bag. Trad wives are the same. They will do anything, because religion and an a-hole said they are no better than baking pies and popping out babies. \n\nDon't let anyone see you for less. Especially, humanoids that declare such things as above.",
      "created_utc": 1731073744.0,
      "score": 13
    },
    {
      "id": "lw3tyaz",
      "body": "Honestly I’m really starting to believe that the vast majority of men hate women. It’s literally nothing but a game to them because it doesn’t impact them. If men gave birth there would be birth control and abortion pills offered in vending machines. And miss me with the “nOt AlL MeN!” If you’re not as loud and consistent with calling out and shaming the men that are absolute POS as you are with the “NoT AlL MeN!”, then it IS all men. If you’re at a table with 10 nazis and saying nothing, you’re at a table of 11 nazis. Silence IS choosing a side. \n\nMen are the first ones to say “choose better men” when women complain about being treated with zero respect from shitty men. So women need to really take that to heart. Stop sleeping with and choosing men that do not openly and fully support your rights as a human being. Then it will start to impact them.",
      "created_utc": 1731085093.0,
      "score": 13
    },
    {
      "id": "lw2rpce",
      "body": "Last night a friend of ours who is kind and self confident when dealing with men and is the type of person you would never imagine hurting a fly, said she wanted to buy a gun. \n\nWonder if the conservatives expected the Second Amendment to also be the right to enforce bodily autonomy.",
      "created_utc": 1731073214.0,
      "score": 13
    },
    {
      "id": "lw26bzh",
      "body": "It’s a threat and I fully support threatening men back. Also… am I a gun rights advocate now?! Because I feel like all liberal people should get guns and start threatening the right. What do we have to lose at this point 🤣",
      "created_utc": 1731063721.0,
      "score": 55
    },
    {
      "id": "lw2nyth",
      "body": "The majority of black women understood the assignment here. Sad times coming for all women.",
      "created_utc": 1731071856.0,
      "score": 10
    },
    {
      "id": "lw36tla",
      "body": "Nanny here! I heard children scream this in a chant to other small children. Parents laughed like it was no big deal.",
      "created_utc": 1731078278.0,
      "score": 9
    },
    {
      "id": "lw39azf",
      "body": "Too bad that South African doctor never mass produced those Rape-aXe condoms. They'd be cheaper than a gun and are more hidden without the need for a woman to be \"ready\" at all times.... \n\nPlus, they need to be medically removed so we'd be able to see who these scumbags are and, in better states, punish them.\n\nI'd totally get behind a crowdsource for these, though... especially to make them super cheap for anyone to afford.",
      "created_utc": 1731079045.0,
      "score": 9
    },
    {
      "id": "lw4a38z",
      "body": "I'm going to say something that I'm actually complicit in, but what baffles me more about those posts is the (mostly) overwhelming silence as a reaction from us, men. Good men. \n\nLike... fellas, what is wrong with us? I may be too much of an idealist, but the response to those stupid posts should be an overwhelming riddicule. Instead there is barely acknowledgement about how bad it is from us.",
      "created_utc": 1731089787.0,
      "score": 12
    },
    {
      "id": "lw2fg7u",
      "body": "Not just men’s mouths, children’s mouths. If you have kids in school please talk to them about this, boys especially. Kids are going around saying this to eachother",
      "created_utc": 1731068382.0,
      "score": 21
    },
    {
      "id": "lw2fwuy",
      "body": "Men are saying let the raping begin. Protect yourselves and your children.",
      "created_utc": 1731068586.0,
      "score": 19
    },
    {
      "id": "lw2h4wo",
      "body": "So disgusting! They’re actual cretins who deserve nothing but the worst quality of life.",
      "created_utc": 1731069119.0,
      "score": 9
    },
    {
      "id": "lw2jrp3",
      "body": "Let’s see what happens when women start carrying out their Second Amendment Rights! \n\nLook up what happened to women whenever they found ways to protect themselves! The story about the hat pins is very intriguing!",
      "created_utc": 1731070216.0,
      "score": 7
    },
    {
      "id": "lw2kxvz",
      "body": "We need to start looking at a protection methods and anti-rape devices. We are 100% no longer safe, and If you think that things are going to go back to normal you haven't been looking at the big picture.",
      "created_utc": 1731070683.0,
      "score": 9
    },
    {
      "id": "lw2m19z",
      "body": "A friend of mine was telling me that he thinks I'd be very successful on the dating scene if I wanted to try it. And I told him I was off men, not because anything bad happened to me personally, but because the vibes are SO off and I've heard/read too many horror stories. Genuinely dangerous out there",
      "created_utc": 1731071116.0,
      "score": 7
    },
    {
      "id": "lw2x0wy",
      "body": "Man, there are kids (young boys) throwing this bullshit phrase around. It's insane out here. Not funny at all. If I catch anybody saying that shit around me, I'm kicking their ass, grown or not.",
      "created_utc": 1731075078.0,
      "score": 8
    },
    {
      "id": "lw3099n",
      "body": "If someone you know sends you this message. Take a screenshot and send it to every woman he knows! \n\nLadies please sign up for self defense classes, carrying a bottle of pepper spray or purchasing a firearm.",
      "created_utc": 1731076160.0,
      "score": 9
    },
    {
      "id": "lw30f53",
      "body": "i hope they’re prepared to earn an extra nostril in middle of their forehead 😍",
      "created_utc": 1731076214.0,
      "score": 10
    },
    {
      "id": "lw3abo7",
      "body": "\"If I'm getting the death sentence over an abortion, then I'll be giving any attempted rapist a death sentence the moment they try anything with me. I'm dead either way, so I'll be taking any would-be rapist down with me.\"",
      "created_utc": 1731079354.0,
      "score": 9
    },
    {
      "id": "lw3b1cb",
      "body": "Those gun protections are still there. Their not just for magats and men either. Ladies, strap up and stand your ground. When enough of them die, things will change. Sexual assault is now a threat to your life. Act as such. Their choice, your bullet. \nNo one is coming to save you. Protect yourself.",
      "created_utc": 1731079571.0,
      "score": 9
    },
    {
      "id": "lw3hs16",
      "body": "I will literally lorena bobbit these mfs",
      "created_utc": 1731081563.0,
      "score": 10
    },
    {
      "id": "lw3q7jf",
      "body": "I'm female, about 5'11 and used to wear heels all the time when I was younger. A typical pair of heels put me around 6'2. I quit wearing them because 1) I've aged and treasure comfort 2) husband is about my height and I didn't really care to be taller than him. \n\nI have now busted my favorite heeled boots back out and am planning to buy more. Why? Because so many fucking men have told me my height is intimidating over the years - GOOD.  I'll take feeling powerful and towering over the average sized dude, thanks. \n\nI told my husband about this \"Your body My choice\" shit this morning while I was just sobbing. He has had to intervene just twice in our 18 years together as a witness to men being disrespectful and dangerous to me. He was disgusted both times and I said then \"You don't even know how often this happens.\" \n\nAnd today, while I was crying, I said \"Remember those guys? That's just the couple times you've seen it. Guys like that exist everywhere and not only are they emboldened, they now learned that even a rapist can be president. And that is scary as fuck. I am terrified for our nieces\" (we have no kids, but 4 nieces ages 2 up to 23.)\n\nWhat a frightening future. \n\nOnce the shock wears off, I'm back to fucking fight",
      "created_utc": 1731084020.0,
      "score": 9
    },
    {
      "id": "lw354lv",
      "body": "TikTok recommendation. Carry a sock with lots of change tied in the toe. Use the length to swing it. Keeps you from being within reach. \n\nAnd weapon? What weapon? I’m going to coinstar!",
      "created_utc": 1731077747.0,
      "score": 8
    },
    {
      "id": "lw3vusq",
      "body": "The US scares me. I saw just yesterday some bloke in what might have been a conservative rally proudly showing his \"slogan\" that read \"WOMEN ARE PROPERTY\". And everyone around him was fine with it. US? Not even for a visit , thank you. Flyovers at best, and only when it's necessary",
      "created_utc": 1731085646.0,
      "score": 9
    },
    {
      "id": "lw2nuwd",
      "body": "God, it’s DISGUSTING. What is our world coming to?? And the people defending those comments are equally as disgusting, and don’t deserve to call themselves human. Now everyone is really showing their true colors, and it’s terrifying. How do we know if the people around us don’t think like that?",
      "created_utc": 1731071815.0,
      "score": 8
    },
    {
      "id": "lw2twkq",
      "body": "showing that tweet to my gun nut dad and letting him know I’m ready to learn how to shoot",
      "created_utc": 1731073992.0,
      "score": 6
    },
    {
      "id": "lw77bwm",
      "body": "My body your choice? My second amendment. My right.",
      "created_utc": 1731125148.0,
      "score": 7
    },
    {
      "id": "lw7se35",
      "body": "If I had a son and I found out he was sending this to women, I don’t care how far we’ve come as humans, I’m bringing out the belt.",
      "created_utc": 1731136053.0,
      "score": 6
    },
    {
      "id": "lw24vp8",
      "body": "No, they do care about women, but more like property like a chair. Absolutely bike disgusting people.",
      "created_utc": 1731062901.0,
      "score": 27
    },
    {
      "id": "lw3j6lf",
      "body": "They think it’s funny til they’re maimed and crying to the police that *they* were attacked lol",
      "created_utc": 1731081978.0,
      "score": 4
    },
    {
      "id": "lw3p43v",
      "body": "I choose the 🐻",
      "created_utc": 1731083705.0,
      "score": 7
    },
    {
      "id": "lw3q6bs",
      "body": "And they wonder why we picked the bear.",
      "created_utc": 1731084010.0,
      "score": 4
    },
    {
      "id": "lw3z8ns",
      "body": "is anyone else genuinely terrified ? now that he has one of the world richest men on his side with two growing superpowers that don’t want to see the US at the top ? i have really bad anxiety usually but i can’t shake the feeling that our democracy and country is in huge danger. but people wanted cheaper gas so much they’d die for it unfortunately",
      "created_utc": 1731086634.0,
      "score": 5
    },
    {
      "id": "lw4562b",
      "body": "Considering our country just elected a known, proven rapist? It's not shocking that rape's about to become a lot more popular.\n\nWomen, you need to arm yourselves with something and learn to use it.",
      "created_utc": 1731088348.0,
      "score": 4
    },
    {
      "id": "lw467i7",
      "body": "There are about to be more women gun owners in this country than ever before. We ain’t playing with these MFs.",
      "created_utc": 1731088647.0,
      "score": 7
    },
    {
      "id": "lw5507x",
      "body": "When I was a freshman (9yrs ago), I jokingly told my guy friend that the end of humanity will start when women start telling men no… his response was “I can just 🍇 you ya know that right?” Safe to say we’re not friends anymore🥲 still had to see him almost every day at school for 4 years tho since we were basically in the same classes. Couldn’t really irl block him like you could block someone on social media.",
      "created_utc": 1731099044.0,
      "score": 6
    },
    {
      "id": "lw6a39x",
      "body": "I have just changed my aim from chest to groin at the gun range.",
      "created_utc": 1731112554.0,
      "score": 6
    },
    {
      "id": "lw2cbek",
      "body": "4B and get a firearm",
      "created_utc": 1731066923.0,
      "score": 19
    },
    {
      "id": "lw2ckmn",
      "body": "I don't think people are paying attention to the genuine pushback that mentality is going to have. It was so quick and sincere for men to say these things, and women will respond to it... Eventually...",
      "created_utc": 1731067045.0,
      "score": 5
    },
    {
      "id": "lw2mqu8",
      "body": "It is also my choice to give a strong bite on a particular body part in self defence.",
      "created_utc": 1731071391.0,
      "score": 6
    },
    {
      "id": "lw2pqsm",
      "body": "> I can't believe\n\nI can.\n\nPeople have been showing you who they are for years now and we've continued to believe they mean well. Messaging has been spread far and wide that women, LGBTQ+ and minorities are safe and that we are fear mongering over nothing. \n\nLISTEN TO THEM.\n\nThey are telling you who they are. Quit giving them chances and believing that these people have any actual love towards you. It's time to get combative and to stop taking this sitting down.",
      "created_utc": 1731072508.0,
      "score": 4
    },
    {
      "id": "lw2qzo7",
      "body": "You would be surprised how many women are coerced into sex... not just by their boyfriend, spouse. (Had a friend who had it out with her spouse--after decades--that the constant badgering and guilt tripping for him not getting sex daily had to stop. Coercive sex is not consensual, and a wife has no more obligation to have sex than a casual stranger.) \n\nBut I digress. \n\nI believe that society, media, fashion, etc coerces women and young girls can (I said can not always and yes this can happen with men too) ... can push them into being sexual/sexualized before they are ready, while at the same time criticize those who ARE ready for being too aggressive or loose or you fill in the blank.\n\nThe comments that proliferate that someone has entitlements to someone's body are abusive and can be considered coercive.",
      "created_utc": 1731072959.0,
      "score": 5
    },
    {
      "id": "lw2y9j0",
      "body": "The amount of posts I’ve been seeing about young boys already saying this to girls in schools and grabbing them is insane. I’m worried for my siblings.",
      "created_utc": 1731075495.0,
      "score": 5
    },
    {
      "id": "lw39gre",
      "body": "Amen.  As a father and grandfather of girls (and boys too, but ones raised to respect women) I am so scared for the future.",
      "created_utc": 1731079095.0,
      "score": 3
    },
    {
      "id": "lw3tzjp",
      "body": "I saw a fb post about middle schoolers chanting this at passing girls.  Middle school.  I had more faith in people.  As a mom of 4 boys we will keep fighting the good fight",
      "created_utc": 1731085102.0,
      "score": 6
    },
    {
      "id": "lw2jrum",
      "body": "Welcome to America. The new fascist Republic of Giliad.",
      "created_utc": 1731070218.0,
      "score": 14
    },
    {
      "id": "lw3i617",
      "body": "Guys can be raped too they forget",
      "created_utc": 1731081678.0,
      "score": 11
    },
    {
      "id": "lw2ooy7",
      "body": "I'm not even from the US but this election result has made me realise I want to get sterilised ASAP",
      "created_utc": 1731072124.0,
      "score": 3
    },
    {
      "id": "lw2pa6z",
      "body": "Just remember, ladies, we have 2nd amendment rights in this Country. Those rights are even more adored and condoned the redder your state/city/county is. Go out and get you a cute little piece for your purse.",
      "created_utc": 1731072341.0,
      "score": 3
    },
    {
      "id": "lw2pd2f",
      "body": "Aim your anger at the millions of democrats who didn’t show up to vote, and the other 50% of the population who aren’t even registered to vote",
      "created_utc": 1731072370.0,
      "score": 4
    },
    {
      "id": "lw2pys2",
      "body": "I really thought that video was a joke (not a funny one) at first.. but then he kept going and going and it was absolutely scary. \n\nCARRY SOME KIND OF PROTECTION WITH YOU AT ALL TIMES.",
      "created_utc": 1731072588.0,
      "score": 5
    },
    {
      "id": "lw2qf70",
      "body": "This is why I carry.",
      "created_utc": 1731072753.0,
      "score": 2
    },
    {
      "id": "lw2req7",
      "body": "They don’t think it’s a joke at all and actually believe this. To them women are property, sex objects, incubators.",
      "created_utc": 1731073111.0,
      "score": 4
    },
    {
      "id": "lw2rghk",
      "body": "None of these dudes would ever say such things to the actual women in their life. They're too scared. Once they have the anonymity of the internet, their true character comes out. Terrifying that these men could be among our social circles. Who knows what they would do if they think they could get away with it.",
      "created_utc": 1731073128.0,
      "score": 4
    },
    {
      "id": "lw30m1t",
      "body": "Damn this is the first time I'm hearing this that's fucked up",
      "created_utc": 1731076279.0,
      "score": 4
    },
    {
      "id": "lw36jt4",
      "body": "And some of my friends wonder why I’m so “sexist” with my general distrust towards men. I’m aware I’ve had a disproportionate amount of horrible experiences with men, I know that. But when stuff like this happens, it just makes me think I was right to be so on guard for so much of my life",
      "created_utc": 1731078194.0,
      "score": 3
    },
    {
      "id": "lw376nn",
      "body": "I first saw about it today and as a guy I'm disgusted. I've always been an ally to women, and to the lgbtq+, and I HATE the way some people are towards them. People who say that need reporting to authorities",
      "created_utc": 1731078390.0,
      "score": 5
    },
    {
      "id": "lw3cihm",
      "body": "You know what? Fuck this noise...\n\n# 2A",
      "created_utc": 1731080014.0,
      "score": 4
    },
    {
      "id": "lw3gtzb",
      "body": "I know so many women who are at the point of arming themselves.",
      "created_utc": 1731081288.0,
      "score": 5
    },
    {
      "id": "lw3m3vl",
      "body": "If you are a woman, go buy a gun RIGHT NOW to protect yourself. do it before woman are no longer allowed to own guns.",
      "created_utc": 1731082832.0,
      "score": 4
    },
    {
      "id": "lw3s6sj",
      "body": "We are in for a rough time of it, ladies & others. The 🔴 men (and the women who \"love\" these types of men)  are feeling very emboldened, and rightfully so I guess, at the moment. I do think that those people will deeply regret this turn. \n\n The real problem is that people don't think that these proposed new policies will affect them, affect their quality of life, their children, their wives. They think that because they are middle class and white that they depend on the government for nothing. They have no clue how much they depend on the feds for things in their day to day lives like clean water, safe food. These bad choices will, of course, end up affecting the poorest and the most needy among us. But it will affect the nitwits too. And grocery and gas prices will not change. The border will be more dangerous but folks that really want to be here will be undeterred. They will simply find different ways to subvert the fences. Mass deportations are unrealistic and incredibly stupid because what's the point of removing a huge swath of ppl minding their own business and doing jobs Americans don't want to do. It's all just such a stupid mess.",
      "created_utc": 1731084588.0,
      "score": 4
    },
    {
      "id": "lw3s9v4",
      "body": "Listen, I’m not advocating for violence, but the second amendment applies to everyone, and in that case “your body my choice” goes both ways.",
      "created_utc": 1731084613.0,
      "score": 3
    },
    {
      "id": "lw3w4a4",
      "body": "I'd screen cap all of that and make it public. Send to friends, family, work... if this is how they want to be? Let them suffer the consequences of being shitty on a public form.",
      "created_utc": 1731085723.0,
      "score": 3
    },
    {
      "id": "lw45w0m",
      "body": "I’d better never hear anyone within earshot of me say that. I swear to God I will catch a charge.",
      "created_utc": 1731088555.0,
      "score": 2
    },
    {
      "id": "lw46b63",
      "body": "Women: Acquire yourself some means of protection, preferably multiple means.\n\nLearn how to become absolutely lethal with them.",
      "created_utc": 1731088676.0,
      "score": 6
    },
    {
      "id": "lw4qdtp",
      "body": "[deleted]",
      "created_utc": 1731094604.0,
      "score": 4
    },
    {
      "id": "lw5w9xe",
      "body": "Well, at least the masks fell off and it is easier to spot the predators...\n\nIt's just terrifying that there are so many of them. \n\nThese kind of men are also typically allergic to paying child-support so I am really confused what they think they're gaining?",
      "created_utc": 1731107721.0,
      "score": 3
    },
    {
      "id": "lw6a896",
      "body": "Any man that lives by these words will be hearing them when he drops the soap in jail… just sayin",
      "created_utc": 1731112603.0,
      "score": 4
    },
    {
      "id": "lw6bubu",
      "body": "America is going back in time. That's it. Idk how else to cope we're just going back in time",
      "created_utc": 1731113175.0,
      "score": 4
    },
    {
      "id": "lw6d0ia",
      "body": "Twitter is a cesspool. \n\nI'm not going to tell you that those people aren't around in real life, because they unfortunately are, and my family has been directly affected by one of them. \n\nFor whatever it may be worth, there are a lot more of us that would never fucking *DREAM* of saying something like that let alone actually end up *DOING* something like that.\n\nYour body is your own, and you should take no fucking shit from anyone, man or otherwise. \n\nSigned: 35 Year Old dude who isn't a fucking animal",
      "created_utc": 1731113585.0,
      "score": 3
    },
    {
      "id": "lw6s50y",
      "body": "\"your balls, my foot\".",
      "created_utc": 1731119076.0,
      "score": 5
    },
    {
      "id": "lw6sd1t",
      "body": "The people that say this to you, to others, to small children - and yes it's already at all the elementary schools.  Their names need to be told, people must know who these little sh*ts are & they need to be shunned or beat until they act right. I am tired of going high when they go low. F*ck em - gloves are off.",
      "created_utc": 1731119161.0,
      "score": 4
    },
    {
      "id": "lw2qu7q",
      "body": "I saw the tweet, its absolutely disgusting",
      "created_utc": 1731072903.0,
      "score": 3
    },
    {
      "id": "lw2tnn0",
      "body": "Move to a blue state, live alone, and get yourself a gun if you're a woman.",
      "created_utc": 1731073905.0,
      "score": 3
    },
    {
      "id": "lw2wkmv",
      "body": "This guy's aren't playing they are telling you the truth.",
      "created_utc": 1731074925.0,
      "score": 3
    },
    {
      "id": "lw38dll",
      "body": "That's why I got fixed when I had the chance. I'm not becoming a breeding cow for this country",
      "created_utc": 1731078762.0,
      "score": 3
    },
    {
      "id": "lw3mwsr",
      "body": "Yall need to start sending to this stuff to their family and places of employment and education because they need to learn a fucking lessson",
      "created_utc": 1731083066.0,
      "score": 3
    },
    {
      "id": "lw3ny4s",
      "body": "I just ordered my first thing of pepper spray 15 minutes ago because each day for the past 3 days there have been more and more saying this. I am petrified to walk my dog and I live in a suburban neighborhood, I couldn't imagine how it would be if I stayed in my home town instead of moving.",
      "created_utc": 1731083367.0,
      "score": 3
    },
    {
      "id": "lw3z74o",
      "body": "If I ever actually hear someone say that to me in real life, they're getting hit idec.",
      "created_utc": 1731086621.0,
      "score": 3
    },
    {
      "id": "lw403z7",
      "body": "I'm not terrified. I'm enraged. I am literally SICK with rage. I no longer have the capacity to accept harm and quietly heal from it. I am training, I am arming myself, and I will be prepared to return the next attack in kind.",
      "created_utc": 1731086885.0,
      "score": 3
    },
    {
      "id": "lw41hbi",
      "body": "I can't even fathom my grandson's or my sons saying this. Unfortunately I have a daughter who is the trumpster and has a sister who is gay so I don't know how in the world she feels justified. I just don't get it. Do these animals really think we're going to roll over and just give them rights to our body to treat the way they want? We are not going back and we are not putting up with that crap.",
      "created_utc": 1731087284.0,
      "score": 3
    },
    {
      "id": "lw43p87",
      "body": "I remember seeing a product available in India, it was an insert able sleeve for women that had barbs on the inside \n\nIf someone tried to use force against her, they'd have the barbed device stuck unable to be removed until they got to the hospital. \n\n\nWe need to have that passed out free like condoms.",
      "created_utc": 1731087926.0,
      "score": 3
    },
    {
      "id": "lw44d3j",
      "body": "rape culture. denying its existence wont make it not exist.",
      "created_utc": 1731088118.0,
      "score": 3
    },
    {
      "id": "lw45g1v",
      "body": "You cannot appeal to their empathy, because their empathy doesn't exist. They never learned empathy, everything they feel is through a lense of selfishness. Me, me, me. That's their whole shtick. If you want to do something, stay away from men. Pick the few men you want in your life, and whittle down your remaining relationships to a superficial level. There are good men in this world, so don't associate with the bad ones. Let them suffer and die out.",
      "created_utc": 1731088427.0,
      "score": 3
    },
    {
      "id": "lw48o7y",
      "body": "Sounds about time for the \"YOUR penis MY scissors\" movement.",
      "created_utc": 1731089369.0,
      "score": 3
    },
    {
      "id": "lw4do71",
      "body": "Honestly the fact I see guys at my school say that phrase really destroyed my faith I’ve had in men. I’ve had plenty of encounters with “male friends” who don’t respect my personal space at all with excessive touching or making jokes about us looking like a couple. I pretty much distanced myself from having male friends unless they are already in HEALTHY relationships. I’m really trying to have faith in men but there’s just too many bad ones that it makes it difficult at times honestly.",
      "created_utc": 1731090837.0,
      "score": 3
    },
    {
      "id": "lw4kith",
      "body": "Just wait until women(myself included) start to use their right to bear arms. Carrying. Voting to carry. \n\nFine. My body, your life. Let’s see how pro gun they are after that. \n\nThen women who still don’t believe, will see, men are trying to take away our rights. They’ll try to make it illegal for a woman to carry. \n\nUse their pros to their disadvantage. \n\n**Just to add though, has anyone been hearing about the 4B movement? I’ve seen it pick up more speed in the US. I mentioned it months ago and no one believed me. Does anything think it could make any progress? I’m open to thoughts!**\n\neta: this doesn’t just mean gun. be smart. carry unconventional items on you. have your sneakers in your car always especially if you have heels. keep heavy items on a none breakaway lanyard. \n\nthis could be the start to a very bad ending for many women in the future. protect yourselves. this election shows that many people are apathetic to racists or are perpetrating it. this can be the same for women. and especially black women. protect yourselves out there. and educate. find new ways to get your message through. \n\nalways think inside AND outside of the box. sometimes unconventional is very conventional.",
      "created_utc": 1731092851.0,
      "score": 3
    },
    {
      "id": "lw4onjy",
      "body": "And they wonder why we choose the bear.",
      "created_utc": 1731094084.0,
      "score": 3
    },
    {
      "id": "lw4p37q",
      "body": "Horrible stuff. And Americans still call the US the greatest country in the world. Sure if you see Afghanistan as great. Why not just give the Afghanistan dictators a job in government to get the job done faster.\n\n\nIt's so unfortunate that something as extreme as anti-rape condoms, created for war torn countries, may be a necessity for some women in the US. ",
      "created_utc": 1731094214.0,
      "score": 3
    },
    {
      "id": "lw4v0jc",
      "body": "This just proves the ones saying this don’t give a f about the unborn babies, they just want to control us",
      "created_utc": 1731095991.0,
      "score": 3
    },
    {
      "id": "lw4zpg4",
      "body": "your body, my target practice 😋",
      "created_utc": 1731097431.0,
      "score": 3
    },
    {
      "id": "lw5kcan",
      "body": "We’ll fight alongside you, physically if we have to\n\nIt’ll be okay",
      "created_utc": 1731103788.0,
      "score": 3
    },
    {
      "id": "lw5qapv",
      "body": "And this is why a lot of women are getting a tubal.  My body your choice is going to work out so well for you when you can’t have a baby with your victim.",
      "created_utc": 1731105713.0,
      "score": 3
    },
    {
      "id": "lw67iq3",
      "body": "Risk the violence that comes from speaking against it, I guess. It’s always been like this, but now it’s bolder. And it’s disgusting. Men are actually disgusting cuz they are allowed to exist like that. They have to choose to be otherwise. Disgusting is the default setting.",
      "created_utc": 1731111655.0,
      "score": 3
    },
    {
      "id": "lw71r07",
      "body": "I honestly think most of the boys saying this are all bark and no bite but the mentality that they’re normalizing and encouraging is very real and scary.",
      "created_utc": 1731122783.0,
      "score": 3
    },
    {
      "id": "lw7pip7",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1731134323.0,
      "score": 3
    },
    {
      "id": "lw7ywdv",
      "body": "Boys are seeing a disgusting orange man commit heinous crimes and still become the president of America. Of course they'll think they can do whatever they want now. They have a felon to look up too",
      "created_utc": 1731140210.0,
      "score": 3
    },
    {
      "id": "lw8k7l7",
      "body": "There are plenty of post on Reddit of parents having this said to their daughters in elementary and middle school.",
      "created_utc": 1731154015.0,
      "score": 3
    },
    {
      "id": "lw38muz",
      "body": "We're not human, we basically exist to serve at their whim and nothing else (just like brown people). I can't believe so many WHITE WOMEN voted for this.\n\nAnd don't say \"they didn't know\" or \"well, they didn't vote for THIS part\", because if they had been paying ANY attention whatsoever and had two brain cells to rub together, this is the logical evolution of the misogyny, xenophobia, classism and complete lack of empathy that they voted into office.",
      "created_utc": 1731078840.0,
      "score": 5
    },
    {
      "id": "lw3di4m",
      "body": "These guys need repeated kicks to the nuts, preferably until said nuts are not functional.\n\nYour body my choice, am I right?",
      "created_utc": 1731080309.0,
      "score": 5
    },
    {
      "id": "lw3d731",
      "body": "Personally i think we need to teach ladies to punch dudes in the nose for saying that. Because fuck respecting the bodily autonomy of someone who doesn't respect ours.",
      "created_utc": 1731080218.0,
      "score": 3
    },
    {
      "id": "lw3s094",
      "body": "We women will be completely stripped of our right to have an abortion and men think our bodies belong to them……..sorry you cannot force anything on me including pregnancy i’ll buy meds on the dark web before i carry another child in my body that i don’t want/need.",
      "created_utc": 1731084536.0,
      "score": 3
    },
    {
      "id": "lw7vsx8",
      "body": "If anyone says that in my presence they are for real eating their teeth.",
      "created_utc": 1731138203.0,
      "score": 4
    },
    {
      "id": "lw2vwfe",
      "body": "He's saying porn is going away, which could cause men to become even more aggressive right? ",
      "created_utc": 1731074690.0,
      "score": 5
    },
    {
      "id": "lw3i27m",
      "body": "no they don’t care. and men saying that are fucking losers, they’re not doing anything irl. women need to start carrying pepper spray and little knives. getting stabbed once will probably cure them.",
      "created_utc": 1731081646.0,
      "score": 4
    },
    {
      "id": "lw28a0s",
      "body": "They don’t no because they think it doesn’t directly impact them.",
      "created_utc": 1731064826.0,
      "score": 2
    },
    {
      "id": "lw2nuv2",
      "body": "Time for Lysistrata 2.0  iyam",
      "created_utc": 1731071815.0,
      "score": 2
    },
    {
      "id": "lw2ubb8",
      "body": "To answer your questions - No, they don't care.",
      "created_utc": 1731074136.0,
      "score": 2
    },
    {
      "id": "lw2xs2k",
      "body": "They actually do think it’s funny to be bullies. Which is what this is. It’s bullying behavior like we are in fifth grade again.",
      "created_utc": 1731075333.0,
      "score": 2
    },
    {
      "id": "lw2yqpg",
      "body": "This is the worst of men getting a platform. Reflected over and over again. It will sadly embolden others and influence more.",
      "created_utc": 1731075654.0,
      "score": 2
    },
    {
      "id": "lw32pgw",
      "body": "Ewwww \nWho said that \nI've never heard this ?\nWhose sprouting this ?",
      "created_utc": 1731076972.0,
      "score": 2
    },
    {
      "id": "lw3tr0h",
      "body": "If i ever have a son and he said this monstrosity, I'd make another one and throw that garbage out. \n\n\n*What's another 17 more years? I can always start again, make another kid...* -Omni Man",
      "created_utc": 1731085034.0,
      "score": 2
    },
    {
      "id": "lw40uh8",
      "body": "Just saying I think i literally would fight someone if they said that out loud to me. I've gotten into fights for less.  As men we need to hold creeps \"accountable \"",
      "created_utc": 1731087098.0,
      "score": 2
    },
    {
      "id": "lw4442n",
      "body": "Just a note of caution, in some states its not considered assault or rape if your married to the person. 😳 which frankly haunts me and is a big factor for why I’m not married yet despite having loads of kiddos and a wonderful relationship. Its not my specific guy i could see ever doing that, its just the point of the matter that if they ever did in any vague aspect i couldn’t do anything about it except start divorce proceedings.",
      "created_utc": 1731088045.0,
      "score": 2
    },
    {
      "id": "lw44xep",
      "body": "I wish the movie teeth was true ",
      "created_utc": 1731088279.0,
      "score": 2
    },
    {
      "id": "lw456tn",
      "body": "A few hours after the results individuals at Texas University felt the confidence to walk around and parade signs with “women are property” written across it. It’s disturbing, and I am sorry for all women",
      "created_utc": 1731088354.0,
      "score": 2
    },
    {
      "id": "lw45msg",
      "body": "I'm humiliated to be associated by gender with men like this. Your body, your choice. End of discussion.",
      "created_utc": 1731088481.0,
      "score": 2
    },
    {
      "id": "lw49rcs",
      "body": "The only way to stop it is to lable it as what it is : terorism. And take actions to prevent it as such",
      "created_utc": 1731089689.0,
      "score": 2
    },
    {
      "id": "lw49w0s",
      "body": "I've appreciated the stories of women sending those kinds of comments to the universities or girlfriends or mothers of the people making these types of violent comments...... maybe their grandmothers and nieces and sisters and such need to be aware. No more hiding behind second internet identities.",
      "created_utc": 1731089727.0,
      "score": 2
    },
    {
      "id": "lw4b9lc",
      "body": "Imagine if men had to worry about getting rufied at bars to prevent them from being sex pests as much as women had to worry to prevent themselves from getting raped.",
      "created_utc": 1731090134.0,
      "score": 2
    },
    {
      "id": "lw4e3bp",
      "body": "I dont understand why those men are not afraid of women harming them. I mean, I feel like I can seriously injure people who wants to rape people and be ethically on the right side.",
      "created_utc": 1731090959.0,
      "score": 2
    },
    {
      "id": "lw4gti0",
      "body": "Simple answer , no they don’t care about any of them. If they did they wouldn’t say that phrase. They can kick and scream saying they love them  and their loved ones would never be in a situation to need access to medical treatments but most women don’t even tell anyone. \n\nIt was years before I told anyone I had an abortion because I was so scared of the deep rooted shame when actually looking back on all the years that have now gone by and everything that I lived through in that time, not once have I regretted it. I’m all for abstaining sex from men unless they’re vetted first 😂",
      "created_utc": 1731091756.0,
      "score": 2
    },
    {
      "id": "lw4j451",
      "body": "I really feel as though guys who post stuff like this need to be tattled on like little boys in the school yard. Screenshot it. \n\nShow their mom. Show their grandma. Show their sisters. Their aunts. \n\nThen after you do that, show their dads. Their uncles. Their brothers and their grandparents. \n\nIt might not lead to any tangible repercussions but it will drive a wedge between them and their families. \n\nSometimes shame is a useful emotion. It’s time they felt ashamed.",
      "created_utc": 1731092434.0,
      "score": 2
    },
    {
      "id": "lw4jla9",
      "body": "If I were a woman in the US I would be taking advantage of the 2nd amendment. Time to start carrying a gun. You can’t physically overpower most men (even if you are physically fit) so you need to have protection at all times",
      "created_utc": 1731092575.0,
      "score": 2
    },
    {
      "id": "lw4t7sp",
      "body": "Anyways, the bear",
      "created_utc": 1731095450.0,
      "score": 2
    },
    {
      "id": "lw4v8yy",
      "body": "Give them what they voted for with malicious compliance: no sex until marriage. And once porn is outlawed (as is planned in project 2025), they may begin to see the error of their ways/ their hypocrisy",
      "created_utc": 1731096062.0,
      "score": 2
    },
    {
      "id": "lw522fc",
      "body": "They may think they have ownership over my body but let me tell you these hands are rated e for everyone and I don’t box just for fun lol. If my hands don’t make you understand my knife and taser sure will! PSA to any idiot men reading this you try that “your body my choice” shit on the wrong women you are going to definitely learn how far your balls can travel through your body if we kick hard enough.",
      "created_utc": 1731098156.0,
      "score": 2
    },
    {
      "id": "lw5k6wo",
      "body": "This should be used as a way to put ppl like that in the ground cause let a mf say that to my mom or and female in my family I will be going to jail for a good amount of time happily",
      "created_utc": 1731103740.0,
      "score": 2
    },
    {
      "id": "lw5muft",
      "body": "Twitter is such a cesspool of the worst kinds of humans. It’s devolved into such an hateful place to be. Because all it is now is a place for hateful assholes to gather.\n\nLike these people are the next generation of keyboard warriors. Now they’re keyboard Colonel’s we live in a world where hatred is so prevalent. People hiding behind a tag because they’re aware there are zero consequences. \n\nA place where misinformation and lies spread like wild fire. And targeted advertising has a part to play in it. Honestly it’s scary how many people don’t realise just how bad targeted advertising is. I call it the rabbit hole, once you fall in you only ever go deeper. This paired with minorities like Women, LGBTQ folk etc being the scapegoat and target for such heinous actions. Women’s bodies being treated like someone else’s property. It’s a repeat on history. I don’t need to say when as it’s pretty common sense. \n\nLet’s just HOPE other countries aren’t persuaded by the US. We’re already on the brink of world war 3. Might as well throw some more hatred and divide in there. \n\nWe are terrified.",
      "created_utc": 1731104590.0,
      "score": 2
    },
    {
      "id": "lw5pc1u",
      "body": "Wait what?, hold on. People ACTUALLY say that?. If ANYONE says that, and genuenly mean it, how havent they ben out in a mental ward? Im sorry if i sound dissrespectfull, but the mere fact that this is a thing people say, confused the Heck out of me.",
      "created_utc": 1731105396.0,
      "score": 2
    },
    {
      "id": "lw5t1ba",
      "body": "4B",
      "created_utc": 1731106618.0,
      "score": 2
    },
    {
      "id": "lw5vqnp",
      "body": "It is disgusting. Beginning to think that women need to initiate \"mayday\" from the Handmaids Tale.",
      "created_utc": 1731107539.0,
      "score": 2
    },
    {
      "id": "lw5wvj3",
      "body": "I thought autonomy at the state level would decide the fate of abortion laws",
      "created_utc": 1731107928.0,
      "score": 2
    },
    {
      "id": "lw77ta6",
      "body": "It’s never been a better time for women to explore women!  Or dildos!  The college educated rates in the US are at 38%M-62%W.   Don’t need to be a rocket scientist to see what all the fuss is about.  Women are becoming the breadwinners, the brains and the powerful citizens.  Voting will only hold them for so long, women will prevail.  Men need to take a deep hard look in the mirror and start becoming something better",
      "created_utc": 1731125361.0,
      "score": 2
    },
    {
      "id": "lw82psn",
      "body": "Oh, get what you mean. The saddest part of your post is actually how women need to compare themselves with these people's family members. How did we get to the poi t where we can't just say we're human beings, but need to explain that they actually do have women they care about that could be us? Like why tf do I need to teach grown men that I'm a human being just like their mom?",
      "created_utc": 1731142757.0,
      "score": 2
    },
    {
      "id": "lw8eeo0",
      "body": "I will never date another man after all of this. I'm bi so I will 100% be choosing women from now on.",
      "created_utc": 1731150542.0,
      "score": 2
    },
    {
      "id": "lw992dv",
      "body": "We need to remind these small men that they are just as breedable",
      "created_utc": 1731164533.0,
      "score": 2
    },
    {
      "id": "lw9t5ik",
      "body": "This is why ✨I always carry✨🥰\n\nSeriously ladies, get into the range if you can. Get pepper spray or the gel. Carry knives. \n\nIt sounds like this way we will have to teach them what know what no truly means. Teach them *thoroughly*.",
      "created_utc": 1731171215.0,
      "score": 2
    },
    {
      "id": "lwa4kj7",
      "body": "When I marched in the first Denver Women’s March, the women chanted “My body, my choice” and the men called back “Her body, her choice”. It was powerful for me to experience that.",
      "created_utc": 1731174866.0,
      "score": 2
    },
    {
      "id": "lwb4sk8",
      "body": "That Nick Fuentes rant was the most disgusting/ disturbing rants i’ve ever heard in my life ",
      "created_utc": 1731186581.0,
      "score": 2
    },
    {
      "id": "lwcj1fy",
      "body": "I say if some guy says that to a woman to her face she should kick him in square in the balls as hard as she can and repeat the phrase back to him. Make that vile bullshit work both ways ladies, and don't be afraid to get creative with it either.",
      "created_utc": 1731204228.0,
      "score": 2
    },
    {
      "id": "lwcq10j",
      "body": "As a woman I like to say in response to that. ‘Your nutsack my foot’.",
      "created_utc": 1731206932.0,
      "score": 2
    },
    {
      "id": "lwdaaxd",
      "body": "What’s even more horrifying is that guys defending this and saying “but it’s a joke” and I’m like how??? What’s the punchline?? Then if it was a “joke” or even “funny” (it wasn’t) then it wasn’t a “joke” at all.",
      "created_utc": 1731215567.0,
      "score": 2
    },
    {
      "id": "lwecgnk",
      "body": "Im deadass gonna fuck up any dumb motherfuckers who say this bullshit, since its their body my choice",
      "created_utc": 1731239118.0,
      "score": 2
    },
    {
      "id": "lwgxnvh",
      "body": "That statement is a serious threat and it will treated as such if I hear it come out of a mouth.",
      "created_utc": 1731271389.0,
      "score": 2
    },
    {
      "id": "lwhao0i",
      "body": "“Your kneecaps my choice”",
      "created_utc": 1731275199.0,
      "score": 2
    },
    {
      "id": "lwlf576",
      "body": "Hello, I am a southern dirt-road democrat man, in a reltaionship with the love of my life.\n\nTo any women who see this. Arm yourselves, any way that you can. Get a carry liscence if required. Dont let your weapon sit at home. Take it with you, in your purse with the proper paperwork.\n\nI am sorry, us men have failed you, and we will continue to fail you. Some of us will try to fight the good fight with you, but most of us will be saying \"Your body, my choice\". Women must look to their own protection now. Get armed, form underground networks and support systems. Begin theorizing on what an \"underground railroad\" for women would look like in thr modern age.\n\nAnd furthermore, listen to these warnings. Yes its not all men chanting these horrible slogans, but the ones that are are not recieving pushback. Normalization will occur, these young men and boys will grow up and alot of them will view you as objects due to this victory.\n\nI am so sorry, but you must protect yourselves. Me and men like me will try our best to protect women in our lives, but we will not be enough. You must be ready to protect each other and yourselves.",
      "created_utc": 1731340057.0,
      "score": 2
    },
    {
      "id": "lwnuj6b",
      "body": "Young men are wearing Tshirts with this slogan at a university in Northern Virginia. They actually told my friend’s niece that you can rape women and become President. Young boys are also chanting this slogan to girls in middle and high school. Very scary time to be a woman in the U.S.",
      "created_utc": 1731367144.0,
      "score": 2
    },
    {
      "id": "lwpotma",
      "body": "I am male and even i find this shit disgusting beyond reason and frankly i feel these types of male individuals i refuse to call them men would probably do it to their own sisters mothers or daughters. they have no respect for women regardless of who they are to them. This is sad terrifying and vile beyond belief and i genuinely fear for women's safety now and in the coming years.",
      "created_utc": 1731394044.0,
      "score": 2
    },
    {
      "id": "lwriva3",
      "body": "The main issue with your rant is they aren’t joking. Half of em aren’t saying it for shit and giggles they are online so they think it wont affect the in real life so they say what they actually think. And no they don’t think about their family because the don’t care and you’ll read about the cases of incestual  🍇.",
      "created_utc": 1731426913.0,
      "score": 2
    },
    {
      "id": "mmi5t94",
      "body": "This reinforces my decision to choose the bair",
      "created_utc": 1744341250.0,
      "score": 2
    },
    {
      "id": "lw26vhn",
      "body": "Oh, just reminds them that goes both ways. :)",
      "created_utc": 1731064036.0,
      "score": 4
    },
    {
      "id": "lw58yz7",
      "body": "this is what they've always wanted. the fact is most men aren't attracted to women. if they have any sexual attraction at all, it's to men. that's why hypermasculine aesthetics are so popular despite not being appealing to most women. they're appealing to men and men are performing for men\n\nmany if not most men have sex with women because they want power. sexual assault has never been about attraction because there is quite literally nothing as unsexy as a partner who is not interested in or actively averse to intimacy. but men LOVE to feel powerful. they love to feel in control. i'm not unconvinced that many men have never actually experienced love as an emotion before, ever. not even for their mothers or daughters or sisters. the allure of power over others is the driving force of their lives\n\nthis phenomenon has always existed in subtle ways. men who hate when a woman is smarter and more successful than they are and sometimes actively sabotage women they supposedly love. men who neg and gaslight to keep women feeling small and sad. men who coerce and harass. the brief window of time we've enjoyed where accusations of assault and harassment have been given public voice briefly stripped men of some of their tools for maintaining power over women. so they've pushed back by becoming more overt and drawing in the men who have no outlet for these subtle methods of dominance but still desperately crave power. and now they feel they have permission from the world to start saying the quiet part out loud",
      "created_utc": 1731100241.0,
      "score": 2
    },
    {
      "id": "lw7yqep",
      "body": "My son is just a baby still but I would never tolerate him saying that even if he was an adult he will not be like those nasty men I can promise you that you don’t get to treat women or such like crap\nYou came from a women you will respect women 🙄I can’t imagine how these so called men treat their own mothers 🙄🤮",
      "created_utc": 1731140101.0,
      "score": 1
    },
    {
      "id": "lw9ai0d",
      "body": "I’m carrying a switchblade the last couple days. I don’t know how to use it well but I do know the most deadly parts of the human body to use it on, so right into the neck it will go at the first sign I might be sexually assaulted. And I’m jumpy too so good luck.",
      "created_utc": 1731165041.0,
      "score": 2
    },
    {
      "id": "lw2qcfp",
      "body": "2a, I dont like guns as much as the next. But I accepted a long time ago that particular pandoras box is open, I didnt open it, and I cant do anything to close it. So Id rather be practiced and armed and even though its a 50/50 that the gun will be just used against me id rather have the chance to defend myself.\n\nIts one of those I might feel one way but the reality of the situation is another. But now? That guy is going to need to have my permission in that situation.",
      "created_utc": 1731072725.0,
      "score": 1
    },
    {
      "id": "lw2rs5a",
      "body": "I try to think about it in a weirdly positive light. Men like this are threatened by us women and the power we have. They want to knock us down.",
      "created_utc": 1731073241.0,
      "score": 1
    },
    {
      "id": "lw2v9hy",
      "body": "Conservatives spewing conservative garbage?  No fucking way!  It's time to make these men afraid again.  The vehicle of said isn't important.",
      "created_utc": 1731074467.0,
      "score": 1
    },
    {
      "id": "lw2zq0z",
      "body": "I think they are aware of how awful the things they say are, and the very point is to cut as deep as they can with what they say. That guy on Twitter was probably getting off on the outrage he was causing.",
      "created_utc": 1731075983.0,
      "score": 1
    },
    {
      "id": "lw3hsji",
      "body": "Totally fucked up! \n\nBut someone tracked down his personal information and has posted it all over the internet so now everyone can call him or send him a letter telling him how horrible of a person he is and good luck with a job!",
      "created_utc": 1731081568.0,
      "score": 1
    },
    {
      "id": "lw3reyc",
      "body": "The saddest part I've seen has been my cousin coming home from school the last two days and telling me what not only the boys are saying but also the other girls.   \nMind you these children are only around 11 and 12 years-old and are repeating the whole your-body my-choice rhetoric and some of the girls saying that they wouldn't be assaulted but other will and proceed to laugh about it.",
      "created_utc": 1731084367.0,
      "score": 1
    },
    {
      "id": "lw3rrmf",
      "body": "They don’t care. They won. That’s it. We are not equals, just possessions to them.",
      "created_utc": 1731084468.0,
      "score": 1
    },
    {
      "id": "lw40639",
      "body": "Anyway, combination locks are cheap and heavy. I’m sure most of us ladies have a scarf we don’t often use in our dresser or closet somewhere. Mousekatool time.",
      "created_utc": 1731086902.0,
      "score": 1
    },
    {
      "id": "lw4bsg6",
      "body": "First off, this is vile, disgusting, and pretty much evil, absolutely. However, you mentioned this was on twitter. People feel empowered to say outrageous shit because they're on the internet. The best advice I can give you, and everyone collectively is this: delete your twitter account. By having a presence there, and by extension any social media (and yes, I would include reddit) we are giving air to these fucking weirdos. Imo the solution is leaving those places altogether.",
      "created_utc": 1731090287.0,
      "score": 1
    },
    {
      "id": "lw4d42j",
      "body": "This is why we choose the bear",
      "created_utc": 1731090672.0,
      "score": 1
    },
    {
      "id": "lw4fzdp",
      "body": "Time to bring back Aqua Tofana 🫠",
      "created_utc": 1731091509.0,
      "score": 1
    },
    {
      "id": "lw4m854",
      "body": "And that is why I will start carrying my weapon once again.",
      "created_utc": 1731093355.0,
      "score": 1
    },
    {
      "id": "lw3uzno",
      "body": "As a brother, an uncle, and a son - I cannot put into words what I wish of Nick. A complete evolution-brake of a human.",
      "created_utc": 1731085393.0,
      "score": 279
    },
    {
      "id": "lw2bevr",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1731066480.0,
      "score": 249
    },
    {
      "id": "lw3f7kr",
      "body": "Surprised he hasn't been doxxed yet. His address was really easy to find",
      "created_utc": 1731080813.0,
      "score": 133
    },
    {
      "id": "lw3zjaf",
      "body": "I played that clip for my boyfriend. He always offers some kind of comforting word when we discuss uncomfortable topics, but he just went pallid, sat down, and was quiet for a while.",
      "created_utc": 1731086719.0,
      "score": 62
    },
    {
      "id": "lw4jnp4",
      "body": "i thought the concept of digital self harm was bullshit until i saw that video and it caused me legitimate psychological damage. i have been online for almost two decades, and have seen some deranged shit, but that was the only time i've had a real physical reaction to something that had no immediate tangible impact on my life",
      "created_utc": 1731092595.0,
      "score": 26
    },
    {
      "id": "lw4qnru",
      "body": "I hope he gets everything he deserves.",
      "created_utc": 1731094687.0,
      "score": 16
    },
    {
      "id": "lw4mgo6",
      "body": "I reported that tweet yesterday (on Twitter/X, of course). As a 2-time SA survivor, that gets my blood boiling fast.",
      "created_utc": 1731093425.0,
      "score": 14
    },
    {
      "id": "lw87ale",
      "body": "The way he was happy about all of that just made me fill up with a white hot rage that I have never felt towards anyone in this topic.",
      "created_utc": 1731145857.0,
      "score": 11
    },
    {
      "id": "lw8yj75",
      "body": "Twitter disabled my account for threatening him, lol",
      "created_utc": 1731160539.0,
      "score": 5
    },
    {
      "id": "lw4q585",
      "body": "I know this is a very serious matter but, every time I see this name, I keep thinking that people are talking about the lead singer of Pierce the Veil lol.",
      "created_utc": 1731094532.0,
      "score": 8
    },
    {
      "id": "lw8httx",
      "body": "He's a deeply troubled guy. Something is missing in his brain for sure.",
      "created_utc": 1731152670.0,
      "score": 3
    },
    {
      "id": "lwwdpjd",
      "body": "I can barely verbalise my anger and disgust at Nick Fuentes and the f###ers who parrot him. Images of breaking noses flood my mind when I remember that speech, and his name is seared in my mind as someone to hate. If I'm honest, the first compulsion I had when watching was to put a bullet between his eyes. So no, not all men, and yes, sadly it's almost always a man, but rest assured, there are many men who are murderously furious at these f###ers. Apologies for the lack of concealing my rage, this is just unforgivable and so abhorrent, and at least in this forum there are other people who are also godfkn mad ✌️. All the support to women of America, I am so sorry your rights have been stolen by people using evil religious propaganda as a tool to oppress you. Sincerely, a sane, white, cis, hetero, man.",
      "created_utc": 1731495583.0,
      "score": 2
    },
    {
      "id": "lwz6qop",
      "body": "Nick Fuentes is an online man baby. \nHe only talks shit online in his basement where he is safe.  If you see him outside...he's in disguise. \nMake sure to point him out if you recognize him...\nHis body....our choice.\nI choose the gimp scene in Pulp Fiction for him 😀",
      "created_utc": 1731530745.0,
      "score": 2
    },
    {
      "id": "m29xdks",
      "body": "What was the rant? I tried googling but I'm not seeing an actual video so maybe it got taken down",
      "created_utc": 1734319332.0,
      "score": 2
    },
    {
      "id": "lw4lcnd",
      "body": "The first time I heard that audio, I thought it was satire. I can't wrap my head around how some people genuinely feel that way.",
      "created_utc": 1731093096.0,
      "score": 2
    },
    {
      "id": "lw2zaga",
      "body": "I have a daughter and a sister. We need to keep on this with kids and young men. This is straight up garbage behaviour.",
      "created_utc": 1731075838.0,
      "score": 452
    },
    {
      "id": "lw2ie8a",
      "body": "Curious: do you chat with them about their real views about women and sexism?",
      "created_utc": 1731069655.0,
      "score": 286
    },
    {
      "id": "lw32aul",
      "body": "[removed]",
      "created_utc": 1731076838.0,
      "score": 241
    },
    {
      "id": "lw4gxs7",
      "body": "As a girl dad I’m worried what men in the world my daughter will have to deal with. I’ll be teaching her how to stand up for herself.",
      "created_utc": 1731091792.0,
      "score": 5
    },
    {
      "id": "lw4edpo",
      "body": "If my son (which I likely will never have now) ever said that, I probably wouldn’t be able to do anything to him.\n\nMy wife would murder him before I even would have processed his comment",
      "created_utc": 1731091043.0,
      "score": 4
    },
    {
      "id": "lw4lupo",
      "body": "My son knows if he disrespects women his Dad/I will \"horse whip him in front of his idiot friends\" -- works like a charm for 24 years and counting.\n\nPS -- don't @ me -- it's a metaphorical horse whip.",
      "created_utc": 1731093245.0,
      "score": 2
    },
    {
      "id": "lw4moen",
      "body": "This 2-time survivor of SA sees you and thanks you.",
      "created_utc": 1731093489.0,
      "score": 2
    },
    {
      "id": "lw31hzr",
      "body": "Wish this was the top comment. Old woman here. Obviously all boils down to humans controlling and stealing from others for greed: personal gain and power. The key is to realize any form that this takes is dependent on those controlled. Applies to resources, animals, etc. Destroy the people you enslave, the animals that are crucial to the ecosystem, the resources of the planet, eventually society collapses and the empire crumbles. Happens over and over and over again.\n\nAny form this behavior takes is dependent on those beings and things that are being controlled, and another important key is the ones pursuing this 'power' are always fewer in number than those they exploit. Women, in this case, have the absolute power to stop this if they cooperate and stand together. Much easier said than done, but it has been done before.",
      "created_utc": 1731076576.0,
      "score": 224
    },
    {
      "id": "lw4b951",
      "body": "Sage advice on building community. Thank you.",
      "created_utc": 1731090130.0,
      "score": 16
    },
    {
      "id": "lw3gkjg",
      "body": "Thank you sincerely sir.",
      "created_utc": 1731081212.0,
      "score": 15
    },
    {
      "id": "lw7p14h",
      "body": "Best comment I’ve read all week!",
      "created_utc": 1731134033.0,
      "score": 3
    },
    {
      "id": "lx07c5v",
      "body": "Absolutely and thank you, Sir. 👍",
      "created_utc": 1731542518.0,
      "score": 2
    },
    {
      "id": "lw3h6wo",
      "body": "I’ve also seen “my mace, your face” which is an excellent response as well ",
      "created_utc": 1731081394.0,
      "score": 154
    },
    {
      "id": "lw5woku",
      "body": "I saw \"your cock, my Glock\" today.",
      "created_utc": 1731107861.0,
      "score": 72
    },
    {
      "id": "lw6br0b",
      "body": "“Your balls, my knee”",
      "created_utc": 1731113142.0,
      "score": 26
    },
    {
      "id": "lw8wu9o",
      "body": "I've seen \"your funeral, my voice.\"",
      "created_utc": 1731159852.0,
      "score": 3
    },
    {
      "id": "lw2edgk",
      "body": "They also to this day loudly criticize how Muslim countries treat women.\n\nIf irony were a poison I'd be a far happier person.",
      "created_utc": 1731067892.0,
      "score": 746
    },
    {
      "id": "lw2a1zs",
      "body": "This omg this. Did everyone forget this discourse???",
      "created_utc": 1731065785.0,
      "score": 149
    },
    {
      "id": "lw2esrc",
      "body": "I would rather be Goldie-Locks at this point, at least she got some porridge.",
      "created_utc": 1731068086.0,
      "score": 67
    },
    {
      "id": "lwcs2wd",
      "body": "Right? There is a reason we choose ~~the bear, the lion, the hippo~~ the whole zoo and the witch before any man.",
      "created_utc": 1731207726.0,
      "score": 2
    },
    {
      "id": "lw4l4o6",
      "body": "I’m of the frank opinion that women should be arming themselves right now. No more outings or walks alone without some extremely strong deterrent. I hate that I am even saying this, as I don’t historically endorse carrying weaponry around town. But if I was a woman, I wouldn’t even be checking my mailbox without protection.",
      "created_utc": 1731093031.0,
      "score": 4
    },
    {
      "id": "lw2qenc",
      "body": "It will for sure. Honestly, I'm not sure what stops it. I'm and old flame wars veteran, so mocking some idiot online to expose them of how pathetic and miserable they are isn't something new to me. Sometimes it works, sometimes it does not. I guess the requirement for it work is for the target to have some level of intelligence to see what you're trying to say is, what exactly you're exposing. I still have no clue what to do with the actual idiots.",
      "created_utc": 1731072747.0,
      "score": 44
    },
    {
      "id": "lw72q07",
      "body": "It’s already taken effect here in Australia. It was concerning during the Covid anti-restrictions & vaccinations movements. The influence of those people really empowered too many people to be loud & obnoxiously proud here.",
      "created_utc": 1731123181.0,
      "score": 2
    },
    {
      "id": "lw2d75h",
      "body": "This is why so many women fall in this trap. I've dated a guy like this before. He is deeply sensitive, feeling, empathic person, but not towards you.. He can turn it on SOMETIMES, but usually not,, Because deep in the back of his mind, he doesn't feel that you have feelings or that your feelings are valid, because he feels you are less of a human than him.",
      "created_utc": 1731067345.0,
      "score": 293
    },
    {
      "id": "lw2dqtn",
      "body": "This is literally true. They did a study and when men looked at women the part of their brains that lit up were the same parts as when they identified objects. Women saw us as people, obviously.",
      "created_utc": 1731067602.0,
      "score": 156
    },
    {
      "id": "lw2tx2p",
      "body": "Pretty sure her being his daughter is not the part stopping him...",
      "created_utc": 1731073997.0,
      "score": 96
    },
    {
      "id": "lw41o0r",
      "body": "I firmly believe he has assaulted his daughter. There's already uncomfortable pictures of them together",
      "created_utc": 1731087338.0,
      "score": 50
    },
    {
      "id": "lw56tot",
      "body": "Your president HAS had sex with his own daughter... FTFY",
      "created_utc": 1731099591.0,
      "score": 8
    },
    {
      "id": "lw7lmwe",
      "body": "It’s this. It HAS to be other men not putting up with it. This election has shown us all that women literally cannot “get through” to them, bc they do not see us as humans. It has to be men who change this re-emergence of explicit and outward rape culture. It’s also just not safe for women to be trying to do it in many scenarios nowadays, nor should we have to unless we choose to.",
      "created_utc": 1731132085.0,
      "score": 15
    },
    {
      "id": "lwj343v",
      "body": "♥️🫶🏼",
      "created_utc": 1731297883.0,
      "score": 3
    },
    {
      "id": "lx1ggmb",
      "body": "Fuck yeah, love this",
      "created_utc": 1731559416.0,
      "score": 2
    },
    {
      "id": "lw2ou1a",
      "body": "It breaks my heart that women have to think like this.  It breaks my heart that I agree that women have to think like this.  I'm worried for my female friends, I'm worried about where the whole country is about to go but women have an extra battle to fight.",
      "created_utc": 1731072176.0,
      "score": 73
    },
    {
      "id": "lw2c4fk",
      "body": "I see a trend of lovely large hats with lovely large hat pins coming back into style.",
      "created_utc": 1731066828.0,
      "score": 81
    },
    {
      "id": "lwg9f7y",
      "body": "search up switch guns, they're absolutely perfect pocket guns the size of credit cards",
      "created_utc": 1731264121.0,
      "score": 2
    },
    {
      "id": "lw2bylv",
      "body": "I saw someone posted screenshots of a website selling t-shirts saying YOUR body MY choice, it was taken down.",
      "created_utc": 1731066750.0,
      "score": 105
    },
    {
      "id": "lw2ugll",
      "body": "I’m Canadian but I was playing an online video game and when I spoke I was instantly met with “your body my choice”. \n\nI have two young daughters who are going to grow up with this rhetoric, even if it’s said in a jokingly way with the younger boys. It’s just going to be normalized as much as “go back to the kitchen” or “make me a sandwich” has been for decades. \n\nI feel so sorry for the women south of me and nervous about our own election next year, knowing that young men are being exposed to this ideology online. \n\nAs a parent, my kids are staying offline as much as possible. I hope Americans think about what their own kids are being exposed to while playing video games or even browsing Reddit or other socials.",
      "created_utc": 1731074188.0,
      "score": 76
    },
    {
      "id": "lw2x33i",
      "body": "Arkansas passed a Stand Your Ground Law a few years ago. I’ve been telling women since then to be prepared to defend themselves by any means necessary, in any and every way possible. If someone thinks they’re taking me down, I’m taking them with me.",
      "created_utc": 1731075099.0,
      "score": 37
    },
    {
      "id": "lw2bc8f",
      "body": "Women need to start carrying. Level the playing feild.",
      "created_utc": 1731066444.0,
      "score": 179
    },
    {
      "id": "lw2zx8a",
      "body": ">There was a protest yesterday. A man was holding a sign that said “women are property”. Another was holding a sign that compared women to land, animals and cars. This is going to get very ugly very quickly for women. Batten down the hatches and get ready to fight for your lives, literally.\n\nArm yourselves. Practice regularly. Know how to use it. Get okay serving jail time (because you probably will for defending yourselves against an aggressor). Form a \"Proud gals\" for want of a better name (Valkyries?) and brandish arms at cowards with signs. Make it known loudly and scarily that you aren't property.",
      "created_utc": 1731076049.0,
      "score": 27
    },
    {
      "id": "lw296r9",
      "body": "Omg, I’m literally scared the world is going back to the 1800 :(((",
      "created_utc": 1731065320.0,
      "score": 83
    },
    {
      "id": "lw2ly9z",
      "body": "i am not a woman and live in the eu but a rlly think yall (if you have the resources) should look into gun ownership and self defence lessons",
      "created_utc": 1731071084.0,
      "score": 15
    },
    {
      "id": "lw334s9",
      "body": "That's disgusting \nWe aren't property \nIt's Texas not surprised",
      "created_utc": 1731077110.0,
      "score": 5
    },
    {
      "id": "lw2kwmg",
      "body": "I am not contradicting you at all and completely agree with your assessment of how shit things are likely to be, especially for women. \n\nBut in my experience those people that go to college campuses with those signs shouting their hate where they absolutely **know** most people are going to disagree are just there rage baiting. \n\nTheir goal is to get attacked and sue the school. They try and be as controversial as possible to bait some college students into attacking their \"peaceful\" gathering and then they sue. It's all a scam. They may believe their nonsense, they may not. Either way it is all just bait to make money.",
      "created_utc": 1731070668.0,
      "score": 16
    },
    {
      "id": "lw2r8qm",
      "body": "[deleted]",
      "created_utc": 1731073050.0,
      "score": 36
    },
    {
      "id": "lwh0i1d",
      "body": "If I see a kid beat the shit out of another kid for saying that, no I didn’t.",
      "created_utc": 1731272179.0,
      "score": 2
    },
    {
      "id": "lw2fbd1",
      "body": "We might not get as strong, but we can surely get just as nasty.\n\nI carry a box cutter everywhere I go, \"for work\", but you have the right to bear arms. \n\nYou. Still. Have. The. Right. To. Bear. Arms.",
      "created_utc": 1731068322.0,
      "score": 268
    },
    {
      "id": "lw2fdl5",
      "body": "I’ve been lifting for almost 10 years now for this exact reason. I’m strong and muscular and I will fight a mf without hesitation. My underlying goal has been to be strong enough to defend myself which is honestly so fucking sad we have to feel like that in this country. It gives me power to know I’m not an easy target like I have been in the past. Sad but true 😭",
      "created_utc": 1731068349.0,
      "score": 71
    },
    {
      "id": "lw2tem6",
      "body": "There's a type of self-defense called Wen-do which is designed for women. It teaches methods that work if your attacker is bigger and stronger, like sensitive spots to hit, how to use gravity to help, etc. And it's based on learning different scenarios like how to escape if you're out on the sidewalk vs how to escape if you're lying in bed. Somehow this appears to just be in Canada but it looks like they're also offering it online.",
      "created_utc": 1731073817.0,
      "score": 56
    },
    {
      "id": "lw2qier",
      "body": "Making yourself stronger is good, but also learn how to fight. Learn how to throw a punch, kick some balls, and gouge some eyes. Make sure you are able to defend yourself from the sick mutherfuckers who are coming out of the woodwork.",
      "created_utc": 1731072786.0,
      "score": 31
    },
    {
      "id": "lw2h0w8",
      "body": "As much as I hate them, get a gun and proper training.",
      "created_utc": 1731069070.0,
      "score": 62
    },
    {
      "id": "lw2b158",
      "body": "Women can absolutely buff up just like men, with enough of the right training. It takes time and patience but you can get build like a brick if you want to.",
      "created_utc": 1731066289.0,
      "score": 34
    },
    {
      "id": "lwnnrte",
      "body": "Men in general hate women. Everywhere.",
      "created_utc": 1731364869.0,
      "score": 2
    },
    {
      "id": "lw2g7uz",
      "body": "I’m 26 and also extremely bitter. I’ve started to hate people as a whole. I feel so lost and I don’t know what to do about anything. I hope those people burn in hell and I hope they’re the first to  experience the consequences of voting him.",
      "created_utc": 1731068720.0,
      "score": 60
    },
    {
      "id": "lw24kbr",
      "body": "I feel like that’s what makes it so terrifying. Not only are they thinking this, but they are actually are saying it out loud. \n\nAnd then they wonder why we’re afraid of them.",
      "created_utc": 1731062765.0,
      "score": 75
    },
    {
      "id": "lw47f8r",
      "body": "I've been considering getting sterilized because of all this. If men aren't careful our race will die out because all of our women are getting sterilized",
      "created_utc": 1731088998.0,
      "score": 2
    },
    {
      "id": "lw63n9r",
      "body": "Thank you for commenting. It's clear that there are men who care about women and people in general but I bet it's a little comforting or even healing to see these kinds of comment posted too, especially since SoMe tends to be so hostile now.",
      "created_utc": 1731110295.0,
      "score": 3
    },
    {
      "id": "lwc839m",
      "body": "No one is actually trolling saying this. Anyone who would say it means it",
      "created_utc": 1731200210.0,
      "score": 2
    },
    {
      "id": "lw7mv9y",
      "body": "Good, those people need to be kicked out of society. Bring back banishing people lol.",
      "created_utc": 1731132779.0,
      "score": 9
    },
    {
      "id": "lwa5mmw",
      "body": "Oooh please update us if she does 🙏",
      "created_utc": 1731175201.0,
      "score": 5
    },
    {
      "id": "lwedddm",
      "body": "That'll only work until they start getting killed off by vigilantes one by one. Rapist hunting is a solution to lesson the amount.  That said it is also easily abused.",
      "created_utc": 1731239658.0,
      "score": 2
    },
    {
      "id": "lw285cp",
      "body": "Women appreciate men like you.",
      "created_utc": 1731064754.0,
      "score": 111
    },
    {
      "id": "lw2amxb",
      "body": "Grateful for men like you but I don’t think the majority of you will die to defend us. I think that’s too generous considering what we’re seeing. I think most men want to keep women in their place. \n\nBut thank you for being willing to go to prison to defend us.",
      "created_utc": 1731066085.0,
      "score": 139
    },
    {
      "id": "lw2lnad",
      "body": "Um, respectfully the vast majority of you couldn't even be bothered to vote for us to keep our rights, so you'll excuse me if I don't hold my breath waiting for you to defend us.",
      "created_utc": 1731070963.0,
      "score": 63
    },
    {
      "id": "lw2tm5a",
      "body": "The election results show a MINORITY of men would - which truly disgusts me.  This country is so broken.",
      "created_utc": 1731073891.0,
      "score": 18
    },
    {
      "id": "lw357fz",
      "body": ">The majority of us \"men\" will die to defend you. \n\nNo. They won't. The majority of men either supported an emboldening of misogyny, or slept in and let it happen. Of the few who bothered to vote, probably less than 10% will overcome the bystander effect.\n\nWomen in America, please learn to defend yourself, and don't rely on men to help. ^Don't ^rely ^on ^women ^either, ^plenty ^voted ^wrong.",
      "created_utc": 1731077771.0,
      "score": 31
    },
    {
      "id": "lw2fs78",
      "body": "Thank you",
      "created_utc": 1731068529.0,
      "score": 7
    },
    {
      "id": "lw2bbk1",
      "body": "yes!!! thank you for saying this. the average men is (i hope at least) thinking like this. the problem is that the men who don't say these things to A TON of women and that is just so fucking sad",
      "created_utc": 1731066435.0,
      "score": 9
    },
    {
      "id": "lw2cfw7",
      "body": "King 👑",
      "created_utc": 1731066982.0,
      "score": 8
    },
    {
      "id": "lw2xujq",
      "body": "Right there with you my guy. not on our fucking watch.",
      "created_utc": 1731075356.0,
      "score": 4
    },
    {
      "id": "lw64qep",
      "body": "Thank you for commenting. To me it's clear that men aren't a monolith and guys who care about not only women but other people in general exist too, but seeing comments like this is uplifting.\n\nNot only \"real men\" but a balanced human being should worry about their fellow human and respect their boundaries. Social media is seemingly making people more apathetic and sadistic. A lot of these people need less screen time and more fresh air and real human connections... and therapy.",
      "created_utc": 1731110678.0,
      "score": 2
    },
    {
      "id": "lw552uw",
      "body": "> These man care about nothing more than themselves. That’s why the election went the way it did. \n\nThat's false. The outcome would never be what it was if not for complicity of significant number of women.",
      "created_utc": 1731099066.0,
      "score": 2
    },
    {
      "id": "lw3k2ab",
      "body": "Unless it’s bear arms. They love those.",
      "created_utc": 1731082238.0,
      "score": 2
    },
    {
      "id": "lw2bpxg",
      "body": "It's not just American women, it has a lot of impact on Europe as well.\nI live in a tiny country that always has one eye pointed towards the US to see which course should be taken. We still feel the need to be humble and submissive towards the US because we somehow still owe them from 80 years ago.\nThis effects us too.",
      "created_utc": 1731066632.0,
      "score": 19
    },
    {
      "id": "lw279p4",
      "body": "Why? They voted for this.  Black women, nearly all black women did not.\n\n52% of white women\n\n37% of hispanic women\n\n7% of black women\n\nThey chose the fucking man instead of the bear.",
      "created_utc": 1731064262.0,
      "score": 36
    },
    {
      "id": "lw3qrwo",
      "body": "SAME. I’m choosing rage and consequence. I’ve got several friends still making the love > hate argument, but I Don’t have it in me anymore. Besides, if they aren’t activating that love into action and empowerment, it’s just another way of staying silent.",
      "created_utc": 1731084183.0,
      "score": 6
    },
    {
      "id": "lw3z3o2",
      "body": "Silence is being complicit.",
      "created_utc": 1731086594.0,
      "score": 2
    },
    {
      "id": "lw2aori",
      "body": "As a gun-toting country woman who's been shooting since childhood and has no issues taking down any target (moving or not), I fully support this idea.\n\nLadies, if you decide to start packing heat, there are steps you need to take.  You can't just walk into a gun shop, pick up a cutesy little derringer that fits into your purse, and call it good. You should also take a gun safety course, learn how to store, disassemble, and clean your firearm, and do frequent training at a shooting range so you get comfortable using your new friend.  When you pick up that firearm during an emergency when you need to defend yourself, that firearm should feel like an extension of yourself, and therefore using it should feel natural.  It takes work and time to get to that point.\n\n***A gun is a good thing in the right hands, but in untrained hands, it can be more of a threat to you than it is to the other person***.  You can't just get a firearm, put it wherever until you need it, and use it as an empty threat.  That kind of mentality is likely to get you traumatized or killed!  Training, muscle memory, and familiarity are all crucial to gun ownership.  If you take out that gun to confront a threat, and you are unsure of that firearm/are hesitant/aren't accurate in your aim, then it becomes easy for that other person to get close, get it out of your hands, and use it against you.  Yeah, in that situation, you're screwed and you have yourself to blame for it.  Make sure you are trained to use that firearm.\n\n***The first rule of using a firearm is to never, ever point it at anything you aren't prepared to shoot.***  So if you're unsure if you mean it when you point that muzzle, I would recommend not pointing it at all and keeping it hidden.  \n\nLastly, especially if you're newer to firearm ownership and your aim might not be perfect yet, you might consider getting a good laser sight on your firearm.  Even as a seasoned gun owner, I love those things.  They can be pricey, but that price is justified, especially in a situation where you have to both be quick and make very, very sure that you  will put that bullet where it needs to be.  \n\nStay safe out there, and remember:  a neutralized threat, including the trauma of dealing with seeing the blood and gore, is totally more preferable to being defenseless in the face of that threat.  We are NOT powerless.  And it's not illegal to defend ourselves (yet).  If they take away one choice, give them a choice of your making:  walk away or die.",
      "created_utc": 1731066112.0,
      "score": 59
    },
    {
      "id": "lw28p7k",
      "body": "I’m the only left-leaning person in my ultra conservative family, and I swear the best thing my dad taught me to do was shoot. I’m prepared.",
      "created_utc": 1731065056.0,
      "score": 26
    },
    {
      "id": "lw27o4e",
      "body": "Aim for tiny head shot.",
      "created_utc": 1731064488.0,
      "score": 11
    },
    {
      "id": "lw2avn8",
      "body": "If I can offer some advice? Fighting fire with fire in this case just means everything burns. You want to have an impact? Do the strict minimum for them and keep your productivity for yourself. Work for an employer with this mindset? Try to find a job with their competitor. You buy products from companies that endorse these views? Stop purchasing their product and purchase a competitor’s product instead. Take your vacation outside the USA. Spend your money elsewhere. Vote your viewpoint at every level of government. Educate your kids. Participate in your community.\n\nAnd in terms of the OP’s original point, women need to consider their own safety first and foremost. Without being overly confrontational about things, it’s entirely possible to make things “un-enticing”… You don’t have to refuse anything if he is not interested in the first place! And albeit fictional, the ending to the movie “Sleeping with the enemy” does provide a possible solution for those men that don’t seem to understand the concept of “NO”",
      "created_utc": 1731066210.0,
      "score": 15
    },
    {
      "id": "lw3pbax",
      "body": "Brutal",
      "created_utc": 1731083762.0,
      "score": 2
    },
    {
      "id": "lw3ryuo",
      "body": "I was just thinking about these! Someone needs to do this.",
      "created_utc": 1731084525.0,
      "score": 3
    },
    {
      "id": "lw4x1nm",
      "body": "Well maybe follow them home and kick their parents asses",
      "created_utc": 1731096613.0,
      "score": 2
    },
    {
      "id": "lw3iab4",
      "body": "And we’ll make damn sure that this time, they can’t be surgically reattached!",
      "created_utc": 1731081713.0,
      "score": 9
    },
    {
      "id": "lw3y9fq",
      "body": "That's scary.\n\nMakes me think what the female in politics within the same party as these people think about thar sign. There needs to be push back within their own party.",
      "created_utc": 1731086347.0,
      "score": 3
    },
    {
      "id": "lw27p0g",
      "body": "In Texas yesterday, men were literally rallying on a campus holding signs that said \"Women Are Property\", so you're 100% right.",
      "created_utc": 1731064502.0,
      "score": 27
    },
    {
      "id": "lwjyj68",
      "body": "cry",
      "created_utc": 1731315043.0,
      "score": 2
    },
    {
      "id": "lw3yrqh",
      "body": "You're a good mom. Our boys have to stick up for girls against boys who say those things.",
      "created_utc": 1731086498.0,
      "score": 2
    },
    {
      "id": "lw48vhu",
      "body": "Yeah, and natural disasters occur, and planes crash, and meteorites hit earth.\n\nIt is the vast majority of women who experience sexual assault, and men are the vast majority of perpetrators of sexual assault.\n\nSaying \"it happens to men too\" minimizes and pulls focus from the discussion about women.\n\nSexual assault on men is traumatic, but it is not the horrific *culture staple* that is sexual assault against women.",
      "created_utc": 1731089428.0,
      "score": 2
    },
    {
      "id": "lw3e0mm",
      "body": "[deleted]",
      "created_utc": 1731080459.0,
      "score": 2
    },
    {
      "id": "lw9b0tv",
      "body": "Absolutely. It’s a fucking threat and I WILL defend myself.",
      "created_utc": 1731165224.0,
      "score": 2
    },
    {
      "id": "lw2yc85",
      "body": "I had not heard that. God, that really will cause men to become more aggressive. Especially now that women are taking a stand and following the 4B movement. I am honestly frightened for the women of America.",
      "created_utc": 1731075520.0,
      "score": 8
    },
    {
      "id": "lw99a76",
      "body": "Cause it's a disease like the flu, one stab and you're cured!",
      "created_utc": 1731164610.0,
      "score": 2
    },
    {
      "id": "lwbdi6p",
      "body": "You think this is new? They think it. They believe it. Now they are “allowed” to be outright with it. \n\nIt’s already happening in schools and girls are getting suspended for punching these little predators.\n\nI’m gearing up to protect myself. So are a lot of other women and girls- they are the “alpha males” - women won’t even wait to see their intentions. It will be interpreted as a threat and they will respond in kind",
      "created_utc": 1731189451.0,
      "score": 2
    },
    {
      "id": "lw9dykn",
      "body": "Downvotes make me smile :) They’re just jokes, right?",
      "created_utc": 1731166232.0,
      "score": 2
    },
    {
      "id": "lw3wi5x",
      "body": "We're grateful for the men who get it. There just isn't enough noise from good men making it through the vitriol. \n\nI wish more saw this through the lens of their daughters. How is *actually* ok with this rhetoric being thrown at their own? I hope the ones who are complacent have daughters, maybe they'll see it then.",
      "created_utc": 1731085835.0,
      "score": 148
    },
    {
      "id": "lw4ml8g",
      "body": "You get it. I see you and I thank you.",
      "created_utc": 1731093463.0,
      "score": 3
    },
    {
      "id": "lwc65h8",
      "body": "Same. I know assaulting people is wrong, but some people really really need to taste a knuckle sandwich. If I ran into him in public I don’t think I’d be able to stop myself from breaking him into pieces.",
      "created_utc": 1731199515.0,
      "score": 2
    },
    {
      "id": "lw46ujb",
      "body": "Yeah, see, this policy on Reddit's part is sort of stupid. I dunno exactly what was said, but the point is that there's zero context left, zero transparency in the decision, so everyone's going to assume what they will. I'm assuming, for instance, that this was advocating (perhaps hyperbolic?) violence of some kind. \n\nAnd yet, when we're talking about the imminent rise of the advocacy for rape and other similarly-abhorrent behaviors and beliefs, what else are we meant to do? Lie back and take it? Or actually fight back?",
      "created_utc": 1731088832.0,
      "score": 82
    },
    {
      "id": "lw3dgld",
      "body": "That's where the \"your body my choice\" shit initiated. \n\nSociety protects trash like that. They can bully and run their mouth, go out of their way to harass people but the minute someone stands up for themselves these turds are suddenly the victims.",
      "created_utc": 1731080296.0,
      "score": 137
    },
    {
      "id": "lw2bh5q",
      "body": "Might be the same guy.\n\nEdit: /s",
      "created_utc": 1731066513.0,
      "score": 17
    },
    {
      "id": "lw3ve4i",
      "body": "I can't believe he has a platform anywhere. I'm a supporter of free speech, but he's inciting a mob to a scary degree.",
      "created_utc": 1731085511.0,
      "score": 74
    },
    {
      "id": "lw49nv1",
      "body": "I have seen his address and phone number posted. But, people have said the number does not work. ",
      "created_utc": 1731089661.0,
      "score": 23
    },
    {
      "id": "lw5425x",
      "body": "He has. I saw it on FB this morning",
      "created_utc": 1731098760.0,
      "score": 3
    },
    {
      "id": "lw7yrvg",
      "body": "I… haven’t seen this yet. I’m scared tbh but can somebody link it? I feel like throwing up, what is this world anymore",
      "created_utc": 1731140128.0,
      "score": 6
    },
    {
      "id": "lw8x7h2",
      "body": "Could you link the clip? I tried to find it, but I'm only findind some videos of Nick Fuentes from few months ago\n\nEdit: I found it and I wanna throw up",
      "created_utc": 1731159998.0,
      "score": 2
    },
    {
      "id": "lw5ti13",
      "body": "It's like when you hear about someone stubbing their toe and you feel pain. Except it's your whole body, and it's debilitating.",
      "created_utc": 1731106774.0,
      "score": 5
    },
    {
      "id": "lw5tzv6",
      "body": "I sorry you went through that. We need to stick together, now more than ever. ♡",
      "created_utc": 1731106941.0,
      "score": 4
    },
    {
      "id": "lwa9nr6",
      "body": "Yeah, cause he's not threatening anyone",
      "created_utc": 1731176487.0,
      "score": 4
    },
    {
      "id": "lw442qn",
      "body": "I get where you're coming from but it bugs me when men say things like this.  It implies that you only care because of the women in your life.  Having a daughter or a sister or a mother shouldn't be a prerequisite for treating women with respect",
      "created_utc": 1731088035.0,
      "score": 212
    },
    {
      "id": "lw3a77g",
      "body": "Nothing unexpected.",
      "created_utc": 1731079319.0,
      "score": 22
    },
    {
      "id": "lw2pamf",
      "body": "I do with my kids but they’re under the age of 10. It’s an ongoing talk we’ll continue to have.",
      "created_utc": 1731072346.0,
      "score": 257
    },
    {
      "id": "lw37ffv",
      "body": "I would feel like such a failure as a dad if my son ever talked like that.  He wouldn’t be welcome around the family with that attitude.",
      "created_utc": 1731078467.0,
      "score": 170
    },
    {
      "id": "lw3xuvj",
      "body": "I'd rather you asked them to imagine what it's like to be a girl and woman, and how they'd feel about constantly threatened with having their bodies invaded against their will and with life-changing consequences.",
      "created_utc": 1731086229.0,
      "score": 37
    },
    {
      "id": "lw3dgju",
      "body": "Beating just teaches them not say it but that doesn't translate to \"not to think it\" nor to not think other vile things. It also teaches them beating someone is a reasonable response to when they don't like something. Violence has it's place but should never be used against kids.\n\nTeach your kids empathy instead and they'll know why \"your body, my choice\" is such a repugnant thing to say by themselves.",
      "created_utc": 1731080296.0,
      "score": 68
    },
    {
      "id": "lw4xh0n",
      "body": "That's what I'm saying man. let's just beat him up. We should break his body. Our choice",
      "created_utc": 1731096746.0,
      "score": 5
    },
    {
      "id": "lw4wzv0",
      "body": "I think that it has already started with the male loneliness epidemic. That is due to women having the ability to live independently. Women could not get a credit card until about 1974 (I believe). You stayed because you had no choice. Even further back, you couldn't own property. If you got married, the husband got the property the woman inherited from her family. \n\n\nSome men also stopped trying to be positive in their masculinity. They look to podcasters like Tate and spew that rhetoric which women won't stand for anymore. \n\n\nAnd you are very correct in that women helped in so many areas to keep men afloat. With married men living longer than single ones, that is a prime example of how that works. ",
      "created_utc": 1731096597.0,
      "score": 77
    },
    {
      "id": "lw3hwly",
      "body": "Since you’ve lived long and seen many things, I wonder do you think the 4b movement is the way to go? I’ve read from feminist opponents the problem with this is that we end up only producing more republicans and misogynist fascists and that the democratic feminist values aren’t passed down. I can understand both positions completely and currently struggle majorly with my wish to have a child with my partner. Not because of my partner - but because I have so much pain being in this body that I do not want to be associated with a mothers role right now. \n\nI just don’t know. In your experience and long life, what do you think is the way to go here?",
      "created_utc": 1731081601.0,
      "score": 20
    },
    {
      "id": "lw3siyc",
      "body": "Oooh i like that one",
      "created_utc": 1731084684.0,
      "score": 6
    },
    {
      "id": "lw780ip",
      "body": "As a trans woman, I prefer “my gock, your gock”, but this is also pretty great",
      "created_utc": 1731125450.0,
      "score": 2
    },
    {
      "id": "lw2y00y",
      "body": "It would be a wonderful poison  though",
      "created_utc": 1731075407.0,
      "score": 52
    },
    {
      "id": "lw51vhg",
      "body": "Only them.",
      "created_utc": 1731098098.0,
      "score": 5
    },
    {
      "id": "lw2rd4r",
      "body": "Arguing with idiots is such a drag. It NEVER ends well. You neither get the satisfaction of knowing you changed someone's mind for the better, nor the opportunity to shut a stubborn fool up.\n\nThe other day, I was put in an argument about why the electoral college is kind of a stupid system. I ended up resorting to sharing a youtube video, explaining it all in a way a child could understand, with pictures and humor to keep their attention span.\n\nDude replied with \"Yeah, I've already seen it, good video\"\n\nAnd I'm like... The fuck did you watch, it literally says the opposite of everything you've tried to argue so far???",
      "created_utc": 1731073095.0,
      "score": 31
    },
    {
      "id": "lw2zykq",
      "body": "Selective empathy is not empathic. It’s just selfishness. I’m sorry you went through finding that out about that guy but glad you realised.",
      "created_utc": 1731076061.0,
      "score": 102
    },
    {
      "id": "lw2lxhq",
      "body": "Do you have a link to the study? I'd love to read it. And by love I mean lose the last piece of hope for humanity I have left.",
      "created_utc": 1731071076.0,
      "score": 81
    },
    {
      "id": "lw2w3av",
      "body": "Pretty sure it didn’t stop him.",
      "created_utc": 1731074757.0,
      "score": 82
    },
    {
      "id": "lw9uc73",
      "body": "he didn’t have sex, he raped her \nFTFY",
      "created_utc": 1731171594.0,
      "score": 4
    },
    {
      "id": "lwq7ms9",
      "body": "I agree. This is one of the reasons I don’t like it when women encourage vitriol against men without specifying what type of men. We should make it more clear that we respect and cherish men that are good people.",
      "created_utc": 1731406614.0,
      "score": 5
    },
    {
      "id": "lwgzcxm",
      "body": "As a woman yes it sucks but now I know without a shadow of a doubt that many men are indeed out to hurt us, that will make it easier for me to make the choice to do serious physical harm if my spidey senses are going off.",
      "created_utc": 1731271870.0,
      "score": 3
    },
    {
      "id": "lw3au2v",
      "body": "Oh yeah, those things that were banned because men were crying about how often they were being used in self defense against them? Like that anti-rape device that can be inserted and leaves spikes in the attacker that needs to be medically removed - which I don’t see how it isn’t the perfect punishment to fit the crime but of course, we can’t allow women any form of protection even if it only hurts the ones that are already trying to hurt us… I wouldn’t be surprised if they eventually start trying to make guns and other weapons harder to get for women in general. Make sure your ask your brothers and husbands if it’s ok for you to defend against the disgusting little beasts that seem to be fucking everywhere",
      "created_utc": 1731079509.0,
      "score": 44
    },
    {
      "id": "lw3fkbx",
      "body": "*cough* **Aqua Tofana** *cough*",
      "created_utc": 1731080916.0,
      "score": 20
    },
    {
      "id": "lw3ez3l",
      "body": "Tell them to shut the fuck up and change your tires. Get back in the garage.",
      "created_utc": 1731080743.0,
      "score": 40
    },
    {
      "id": "lw2rrnv",
      "body": "Aqua tofana is being mentioned on TikTok.",
      "created_utc": 1731073236.0,
      "score": 45
    },
    {
      "id": "lw2rw3y",
      "body": "Its an unfortunate situation. But its one of those situations where you might feel one way, strongly. But the reality of the situation dictates you ignore those feelings.\n\nYeah the 400lb tacticool weekend hamberder warrior isnt going to hold off an invading army. But he can kill you, he can rape you, he can rob you, he can do whatever he wants and the cops wont be there in time to help. If at all. Same with the literal nazi. Same with the kid walking to shoot up a school with your kids in it. Same with the crazy pastor telling his congregants to enslave women. Also those congregants are armed too. They are going to arm themselves. Its reality at this point as much as we might hate it. \n\nThe reality of the situation is there are armed people willing to kill me if they can get away with it. They are going to arm themselves. The only thing I am doing in the grand scheme is leaving myself unarmed. Me choosing to be armed or not is not going to stop endemic gun violence across the nation. It doesnt stop me from voting for gun reform. But it does give me a chance.",
      "created_utc": 1731073281.0,
      "score": 36
    },
    {
      "id": "lw2xfx3",
      "body": "Yeah ngl my shotgun makes me feel a whole lot safer.",
      "created_utc": 1731075220.0,
      "score": 11
    },
    {
      "id": "lw7zz3v",
      "body": "Open carrying in groups, black panther style",
      "created_utc": 1731140915.0,
      "score": 2
    },
    {
      "id": "lw33p3t",
      "body": ">Arm yourselves. Practice regularly. Know how to use it. Get okay serving jail time (because you probably will for defending yourselves against an aggressor).\n\nTotally agreed. And, to be frank, if women are going to get jail time for having abortions anyways, they may as well kill their rapists. At least that way something good will come out of the situation.",
      "created_utc": 1731077293.0,
      "score": 35
    },
    {
      "id": "lw2i92a",
      "body": "No it's not. They can try but we are not obligated to play along with their rape and impregnation fantasies. Yes they're scary. Guess what that means? If you self defense them to death if they try shit? It helps your legal case. No guarantees on winning but we are not going to revert with them and they can face the consequences of that. I hope none of us face that but as I was raised by white supremacists who think this way I have been fighting this my entire life. Most of them back off at the first sign you are a threat \n\nBe crazier than them, be loud, be sharp in the bite and claw method, and live the life you want. They are mostly cowards. They know it too. The one time I was injured enough to need a break from existing was when I didn't behave like a banshee on meth when threatened. Still survived and you better believe it made me fight harder not less\n\nThey're loud because they're hoping to drown out critical thinking and to scare people into obedience. You owe them nothing. Nothing.",
      "created_utc": 1731069595.0,
      "score": 112
    },
    {
      "id": "lw2a4w1",
      "body": "It’s disheartening. It’s not a safe place for women or minorities anymore.",
      "created_utc": 1731065827.0,
      "score": 64
    },
    {
      "id": "lw3390k",
      "body": "Not the world \nAmerica",
      "created_utc": 1731077148.0,
      "score": 3
    },
    {
      "id": "lw2mprf",
      "body": "I also do not live in the United States, but I have family that does and I’m terrified for them. I think that’s why this has me so angry. I agree, I am anti gun, unless it’s for defence. Now women need defence.",
      "created_utc": 1731071379.0,
      "score": 10
    },
    {
      "id": "lw2rz5p",
      "body": "I got a gun after his first election. I haven’t carried it, but probably will now.",
      "created_utc": 1731073311.0,
      "score": 4
    },
    {
      "id": "lw2qomf",
      "body": "We have watched our upcoming president shout hate and vitriol into a microphone while people cheered. This is not rage baiting. People feel this way and it's time to buckle up and realize this is reality.",
      "created_utc": 1731072848.0,
      "score": 35
    },
    {
      "id": "lw2upub",
      "body": "They're betting on the women soon losing the choice to reject them. That's the whole point. It's the \"dibs\" of a line of rapists ready to take possession the second they have the chance to.",
      "created_utc": 1731074278.0,
      "score": 37
    },
    {
      "id": "lw3f6xx",
      "body": "I have a pistol but I've always kept a knife on me per my Dad's instruction - \"a lady should always carry a blade\". Just know if you whip it out you better be ready to lose it because I'm cutting that first. Get bent misogynist fucks!",
      "created_utc": 1731080807.0,
      "score": 91
    },
    {
      "id": "lw3gncb",
      "body": "Give that bear its arms back /j\n\n(Anyway I agree. If you live somewhere with a right to bear arms, now is the time to exercuse that right)",
      "created_utc": 1731081235.0,
      "score": 11
    },
    {
      "id": "lw472xm",
      "body": "padlock tied at the end of a cute bandana <3 you're just coming back from the gym",
      "created_utc": 1731088899.0,
      "score": 2
    },
    {
      "id": "lw3nxhk",
      "body": "I took a Wen-do class back in 1984 and just this past Wednesday was showing my husband some of the tricks I learned!",
      "created_utc": 1731083362.0,
      "score": 6
    },
    {
      "id": "lw2mc3i",
      "body": "My husband has been researching firearms and classes since Tuesday to find something that's a good fit for me because he's so freaked out. I grew up around guns but don't like them. I get his position though.",
      "created_utc": 1731071233.0,
      "score": 45
    },
    {
      "id": "lw3h027",
      "body": "Someone please correct me if I’m wrong, but isn’t this the very reason we have the second amendment? To fight this?",
      "created_utc": 1731081337.0,
      "score": 5
    },
    {
      "id": "lw2d7vu",
      "body": "We can definitely, and l have friends in my gym like that.\n\nBut the object here is to become as strong as possible so that we can defend ourselves better , not for aesthetics.",
      "created_utc": 1731067354.0,
      "score": 33
    },
    {
      "id": "lw2ir53",
      "body": "And what's even more disheartening to me is my boyfriend trying to comfort me by saying \"try not to think of that, think of how we're going to enjoy our trip when I come back home\". Like sir, I know you mean well but I, unfortunately for me, have 1. empathy for others 2. fear of being in this position in the future because who's to say they won't try to ban abortion in my own country? Poland did it in 2020 and we're not so far off. Like please don't tell me not to worry when you're NEVER going to be in the position where you can lose your rights; just because you're a white male. I will have to worry for the rest of my fucking life.",
      "created_utc": 1731069805.0,
      "score": 52
    },
    {
      "id": "lw2z7w7",
      "body": "I'm 46M and bitter too. I hate people as a whole too. It baffles me that people can be this ignorant, hateful, spiteful, selfish, entitled and so full of fear.",
      "created_utc": 1731075815.0,
      "score": 11
    },
    {
      "id": "lw62t1l",
      "body": "I've noticed taking time off social media helps. In my experience the people around me, both women and men, are just your normal empathetic people. I work in tech and most my coworkers are men. I have heard a lot of horror stories from that field but I have personally only had good experiences with them. They have the common sense and kindness some people online don't, and it's healing. Focusing on the good people around you makes you feel less bitter towards humanity. Negativity bias can be harsh.\n\n(probably important context, I'm from the Nordics)",
      "created_utc": 1731110003.0,
      "score": 2
    },
    {
      "id": "lw54lpw",
      "body": "Nah, plenty of women who are apparently entirely fine with it.",
      "created_utc": 1731098924.0,
      "score": 2
    },
    {
      "id": "lw5at8g",
      "body": "I'm working on booking an appointment now. It's easier for me because I've never wanted kids. I feel really bad for women who want them someday because of how much it limits their options.",
      "created_utc": 1731100803.0,
      "score": 2
    },
    {
      "id": "lwk0ql4",
      "body": "As a guy it's actually good they now say this shit - because until now they knew to keep their fucking mouths shut and behave normally and as a decent human. Now? Now they're emboldedened to act out and be their true selves. And that shows which of them need watching, who around them needs support, and that they're challenged every single time they say some fucked up shit.\n\n&nbsp;\n\nThere shouldn't need to be guys saying this stuff against these misogynists. It'd be nice and normal if everyone could just treat others with simple respect or at the very least bodily autonomy.",
      "created_utc": 1731316558.0,
      "score": 3
    },
    {
      "id": "lway494",
      "body": "She just might. My cousin is 23, no job, no desire to find a job and I think my aunt is pretty much sick of him. One of his friends also made some pretty gross comments to his sister last week and he just laughed about. Him and his friends are a huge reason I don’t go over there very much. They’re gross and weird.",
      "created_utc": 1731184400.0,
      "score": 6
    },
    {
      "id": "lw2btnw",
      "body": "maybe im too hopeful but id say majority would rather protect than attack. but after the numbers on the election im questioning it",
      "created_utc": 1731066684.0,
      "score": 40
    },
    {
      "id": "lw2fsae",
      "body": "I would die to defend you. I’d give my life in an instant if it promised the safety and equal rights of all women. No second thoughts.",
      "created_utc": 1731068530.0,
      "score": 41
    },
    {
      "id": "lw8kt1e",
      "body": "I fully agree with this. Social media does not reflect real life. It makes the voices of the bad people louder while silencing the good ones. Bad and good people exist. There are sadistic men out there. They are awful and bad but I’ve met plenty of good ones too. Ones who respect not just women but other men too. And I know 100% that if these good men see a man mistreating someone, they’d interfere.",
      "created_utc": 1731154332.0,
      "score": 2
    },
    {
      "id": "lw2d1h0",
      "body": "Germany, specifically, comes to mind in Europe regarding this given their own Alt right issues atm.",
      "created_utc": 1731067270.0,
      "score": 12
    },
    {
      "id": "lw2cgs0",
      "body": "I suppose that's my privilege- my country wouldn't stand for it.\n\n I hadn't thought about that, I'm sorry that you have to worry also.",
      "created_utc": 1731066994.0,
      "score": 6
    },
    {
      "id": "lw28jdc",
      "body": "I hate that my demographic contributed so fucking much to our own demise. It’s sickening and terrifying.",
      "created_utc": 1731064967.0,
      "score": 52
    },
    {
      "id": "lw49nz6",
      "body": "I mean, what usually happens to pacifists who are violently attacked?",
      "created_utc": 1731089662.0,
      "score": 3
    },
    {
      "id": "lw2kco7",
      "body": "I honestly never thought I would be so interested in getting a gun, but I really want to take gun safety and shooting lessons. I don’t want an assault rifle and I want guns to be heavily regulated, I just want to be able to be able to safely protect myself.",
      "created_utc": 1731070449.0,
      "score": 11
    },
    {
      "id": "lw2k2l5",
      "body": "My gender neutral dude, I have been doing those things. At this point, I am just here to protect my own and those who need protection and did not vote for that asshole, thus why i suddenly feel interested in taking a gun safety course and learning how to shoot in case some fucker decides to test me. Also the world is literally fucked, so who cares if it burns. I’m not being a pessimist, I am being a realist.",
      "created_utc": 1731070338.0,
      "score": 14
    },
    {
      "id": "lw3yvmk",
      "body": "I'm sure at least some agree. They are their father's property and then they're their husband's property after all. So what's wrong with that statement ?",
      "created_utc": 1731086529.0,
      "score": 3
    },
    {
      "id": "lw4egty",
      "body": "I know that and I'm not disagreeing with you. It's just interesting to me that they proclaim women don't acknowledge it can happen to men while what you're saying is completely true.",
      "created_utc": 1731091068.0,
      "score": 3
    },
    {
      "id": "lw3erh9",
      "body": "Visible damage as a warning to others. But yours works too.",
      "created_utc": 1731080682.0,
      "score": 3
    },
    {
      "id": "lxcuwuh",
      "body": "Sounds like men need a sense of humor. And maybe smile more, boys. Nobody will date an ugly grimace!",
      "created_utc": 1731716962.0,
      "score": 2
    },
    {
      "id": "lw4baxb",
      "body": "You are correct. I didn’t notice that they removed my comment. I basically said someone needs to pew pew that Nick guy in the pee pee (if you know what I mean, hopefully Reddit doesn’t lol) \n\nAnd I totally agree with you. The irony of not being able to “suggest violence” in retaliation to the violent threats/acts against women is stupid.",
      "created_utc": 1731090144.0,
      "score": 154
    },
    {
      "id": "lw5v2qf",
      "body": "Turning the other cheek with these people isn't the answer. I'm not suggesting anything, but it would be nice if his BS was removed as fast...",
      "created_utc": 1731107310.0,
      "score": 3
    },
    {
      "id": "lw512co",
      "body": "Protect the bully and then target and be as shitty as you can be to the ones being bullied. Its the American way.",
      "created_utc": 1731097849.0,
      "score": 22
    },
    {
      "id": "lw5ur4w",
      "body": "Zero tolerance often protects the bully.",
      "created_utc": 1731107200.0,
      "score": 2
    },
    {
      "id": "lw7w8ru",
      "body": "free speech isn't say anything you want. and even if it is then you would be free to turn that same level of hatred back on them. \n\nFree speech is merely the US government can't punish you for speaking against them.",
      "created_utc": 1731138484.0,
      "score": 5
    },
    {
      "id": "lw552bp",
      "body": "Please share!",
      "created_utc": 1731099061.0,
      "score": 3
    },
    {
      "id": "lwecjy4",
      "body": "A Fascist world.",
      "created_utc": 1731239174.0,
      "score": 2
    },
    {
      "id": "lw4jb2s",
      "body": "I love that for you and your kids. It sounds like you are probably giving them a far more well rounded education. Not just on this but it sounds like you care about education outside of school as well. \n\nI love that for your family.",
      "created_utc": 1731092491.0,
      "score": 5
    },
    {
      "id": "lw4xtwz",
      "body": "You are a sweet soul and I agree with this sentiment. But I think this is not someone who is capable of empathy",
      "created_utc": 1731096855.0,
      "score": 24
    },
    {
      "id": "lw42aim",
      "body": "No. There's a genuine subset of people who do not have the capacity to understand empathy, that's why they say those things. For those people, corporal punishment, especially from other men in their lives is the only thing that *might* work.",
      "created_utc": 1731087520.0,
      "score": 16
    },
    {
      "id": "lw3n0fl",
      "body": "Many of my female friends under 30 are choosing to not have children. The ones I know in 'real life' are choosing not to mainly b/c of location (red state) and/or if they don't have a partner, fear of being 'fooled' and ending up with a toxic person (this is absolutely a well founded fear). After that the reasons are economy and environmental crisis. Online, mostly I know Europeans, but they absolutely have the same reasons...women in many Euro countries are facing right wing govt takeovers also.\n\nThat being said, if you have a good partner and are stable and want a child, remember, you have \\*huge\\* control over what you teach that child. We are going to need all the good humans we can get. I grew up in a horrid red state surrounded by an onslaught of bad stereotypes and misinformation, but I was fortunate to have fantastic parents who taught me critical thinking.\n\nJust breathe and don't stress yourself about kids in addition to the stress you're feeling right now, would be my initial advice. Making decisions in a chaotic time/environment is rarely a good idea. Hugs to you and be safe.",
      "created_utc": 1731083096.0,
      "score": 57
    },
    {
      "id": "lw3wcry",
      "body": "Yeah, you probably won't change their mind, not in the usual way, that requires an effort from their end as well. That's why I go to mockery and humiliation and shit like that. If I'm being honest, most of them probably already know you're right, they're just following along with some rage bait bullshit they saw online.\n\nFor example, any racist out there knows, just because white people invented an airplane, that doesn't qualify them as a pilot just because they're white. They know this, everyone knows this, if you have more than one brain cell active you know this. But that shit doesn't stop them though now does it? They'll still spill all that usual bullshit anyway. \n\nYou don't expose these people for them, sure I like to take the little things and enjoy some conservative tears just as the next guy, but those guys are already a lost cause, I could though influence that dipshit sitting next to them and nodding his head with \"yeah, yeah, say it like it is brother\" and who is learning the ropes. \n\nOther times, my actions could just let some outnumbered soul surrounded by this fuckers know they're not the weird one nor they are alone. That works for me. Shit that's worth it for me.\n\nI do however engage in an actual conversation if it's someone I care about, or if it's my friend, in that case I will take the effort. And, for some reason \"yeah, I used to be an edgy teen 25 years ago as well, I know what you mean\" somehow get's them scratching their head long enough to stop and think just how fucking immature and childlike behavior they put out is. There is some weight to it when you \"ok, edgelord\" to a grown man. I honestly have no idea why, maybe because it's out of the blue and the conversation is done without bad-faith arguments expected, and after all we are friends. Beats me. I'm no brain scientist.",
      "created_utc": 1731085792.0,
      "score": 6
    },
    {
      "id": "lw2tzen",
      "body": "I’d like to read it too. Very interesting.",
      "created_utc": 1731074020.0,
      "score": 23
    },
    {
      "id": "lwr5b4l",
      "body": "I couldn’t agree more",
      "created_utc": 1731422408.0,
      "score": 3
    },
    {
      "id": "lwhyvy0",
      "body": "Like I said, it breaks my heart that you have to think like that, it's not how things should be.  I'm lucky to know some of the women I'm friends with, it confuses me and pisses me off how some men think of them as less, it's shameful.  I'm a person with some empathy but I don't think I can get my head around how betrayed by men in general a lot of women must feel.",
      "created_utc": 1731283249.0,
      "score": 2
    },
    {
      "id": "lw4qfuy",
      "body": "What’s hilarious about that is half of them aren’t “man enough” to know how to change a tire",
      "created_utc": 1731094621.0,
      "score": 18
    },
    {
      "id": "lw3f4v9",
      "body": "Hahahahha love it",
      "created_utc": 1731080791.0,
      "score": 10
    },
    {
      "id": "lw2yo48",
      "body": "I wish it didnt come to this, but we shouldn't have to be a static.",
      "created_utc": 1731075630.0,
      "score": 9
    },
    {
      "id": "lw2pyn7",
      "body": "This is the correct answer. They will try and perhaps succeed in making it illegal to abort your rapists baby. At the same time, they will make it easier to abort your rapist.",
      "created_utc": 1731072587.0,
      "score": 51
    },
    {
      "id": "lw2sr7p",
      "body": "Is it terrible that I am more angry with the women on that side. Like what the actual fuck? I know you Tina. I know you got an abortion, and I know you were grateful. Now you voted for this clown?!?!?\n\nI love reading AITA, but every single post by a woman today, I wanted to write in and say, your BF is correct, you don't actually have autonomy anymore welcome to 2025.",
      "created_utc": 1731073586.0,
      "score": 37
    },
    {
      "id": "lw2bq60",
      "body": "The sad thing is, it never was safe.   We had the illusion of safety. These people didn't just start believing this stuff, it's just that they now feel emboldened enough to say it out loud.  At least now we know how much they hate us and can be prepared for the worst.  Now we know what we're truly up against and can come together to fight back and make positive change.",
      "created_utc": 1731066635.0,
      "score": 120
    },
    {
      "id": "lw3524v",
      "body": "Please carry it if you’re comfortable enough to. These people aren’t fucking around. Better safe than sorry. Hate that it’s come to this.",
      "created_utc": 1731077726.0,
      "score": 4
    },
    {
      "id": "lw3hlpm",
      "body": "Oh no, I know people feel this way. I am speaking specifically of the people that do this on college campuses. That is their MO is suing for money. \n\nI live in the south. I am fully aware people really think like this.",
      "created_utc": 1731081512.0,
      "score": 2
    },
    {
      "id": "lw7lehu",
      "body": "Exactly. Women are going to continue to distance out of fear, that will increase the rage of the men, and this influx of rape culture acceptance will make them feel safe and emboldened to act on their rage by doing what they want to a women’s bodies anyways.\n\nI am. 24yo woman in Canada. I am fucking terrified, to the deepest part of my being. \n\n(Also: those of us who are SA survivors especially are SO triggered rn - the election essentially was the most blatant example of how our society will choose a rapist over a woman, and I don’t think my body has come anywhere close to calmed down since it happened. If you know anyone with PTSD from SA, they could use your support rn, I promise🫶🏼)",
      "created_utc": 1731131955.0,
      "score": 5
    },
    {
      "id": "lw3jswm",
      "body": "I'm so sad this is happening but I'm loving this energy! \n\nWe got this. No if's or but's. Dudes should be terrified.",
      "created_utc": 1731082161.0,
      "score": 32
    },
    {
      "id": "lw3qwbi",
      "body": "Your dad sounds like a smart man. Some situations don't give you enough room to pull a gun. People are legally allowed to open carry, without a pemit/training, where I'm at so if I was gonna attack someone I'd watch them for a minute to find out where their gun was and go for it first. I've noticed the people around here that are carrying don't seem to pay much attention to their surroundings so I imagine it wouldn't be that hard to disarm them if you're quick.",
      "created_utc": 1731084218.0,
      "score": 11
    },
    {
      "id": "lw4b5m4",
      "body": "If a gun has more rights than I do then I will make sure mine is always on me.",
      "created_utc": 1731090102.0,
      "score": 2
    },
    {
      "id": "lw3fhi9",
      "body": "Same. I'm not a fan of guns. I'd prefer not to have any but I'm aware other people enjoy them or are responsible with them. Idc much about the right to bear arms.",
      "created_utc": 1731080893.0,
      "score": 8
    },
    {
      "id": "lw3fg0d",
      "body": "I feel this so HARD. Im European too, 35, and had a chat yesterday with my boyfriend (who’s extremely empathetic, feminist, doesn’t GAF about gender roles and told me you go to the street protesting I go too) when I was depressed about the world and America and American women’s plight, and he gently tried to encourage me not to internalise their pain, I’m where I am and I’m lucky and this isn’t happening to me, and I was trying to make him understand but we still live in a patriarchy and this is what patriarchy inherently thinks of women’s bodies, of my body, and just because I’m privileged and lucky doesn’t make this untrue or not apply to where I live right now. I was raped as a child and carried that with me my whole dann life, and yes even if I’m privileged this is what we’re facing. Globally. Look at Afghan women. Look at Indian women. South Korean women. Yeah I’m lucky, but it could just be a matter of fucking time.\n\nI want a child with him, he with me, we both want a family. We’ve been through a lot individually and together and he’s the only person I could ever imagine having a child with. But I’m not sure he understands the feeling of what that’s like, being a woman and having these body parts right now. \n\nIt’s not just this moment in time. It’s not this particular outcome of this election in this country. It’s not that I’m privileged or lucky.\n\nTHIS IS THE WHOLE OF WOMENS HISTORY TO DATE. THIS IS WHAT WERE RELEGATED TO. a l w a y s.\n\nThis whole situation honestly makes me reconsider having a child. I wish I could do something. I wish I could shoot every motherfucker. They’re so far gone sitting down talking to them and extending empathy is way beyond the line.\n\nI wonder how black women in particular still have the strength to fight. I admire them deeply. I’m just extremely tired and done with having empathy, resiliency, looking at men with human eyes and a human heart. I just don’t feel it anymore, but I also know it’s the only way to get to a safe place for women sometime way down in the future...",
      "created_utc": 1731080881.0,
      "score": 23
    },
    {
      "id": "lw3rc0g",
      "body": "Did you start hating people recently or has it been ongoing? I keep hoping I can begin to stop hating people but my god, people really are despicable.",
      "created_utc": 1731084344.0,
      "score": 2
    },
    {
      "id": "lw64856",
      "body": "Funny enough, I jus deactivated my Facebook yesterday and deleted Instagram. I had been considering unplugging for a while now and this election finally pushed me to do it.\n\n  \nI also work in tech and my coworkers (mostly male) are phenomenal. I asked my boss for a couple  mental health days and he told me to just take the week. It was greatly appreciated. I wanted to just get a year of experience and bounce but the people are SO good that I'm reconsidering staying just for them.",
      "created_utc": 1731110499.0,
      "score": 2
    },
    {
      "id": "lwlh0ik",
      "body": "What is she waiting for? She should kick him out before he or his friends harm the sister.",
      "created_utc": 1731340646.0,
      "score": 3
    },
    {
      "id": "lw2fu7n",
      "body": "I want to believe that. But theres been enough surveys saying large numbers of men would SA a woman if they knew they would never get caught. And on top of that a lot of men don’t even understand what falls under rape. My ex sure didn’t.",
      "created_utc": 1731068554.0,
      "score": 42
    },
    {
      "id": "lw2nrhm",
      "body": "Thank you 😭 men like you (and my husband!) are the only reason some of us have any hope. We’re terrified.",
      "created_utc": 1731071779.0,
      "score": 23
    },
    {
      "id": "lw3084m",
      "body": "Which is a terrifying thing to think about",
      "created_utc": 1731076149.0,
      "score": 3
    },
    {
      "id": "lw28zfw",
      "body": "It's done now. We get to deal with the fall out. The prick told us who he was. When he fellated that mic stand, that should have been it. Folks lined up and voted. \n\nYikes.",
      "created_utc": 1731065209.0,
      "score": 27
    },
    {
      "id": "lw2bf40",
      "body": "Me too. I’m so furiously angry. Our demographic failed. We failed Black Women, we failed ourselves, we failed the younger generations. The majority believed a bunch of egregious BS and now we’re all going to be property. And they don’t even care or want to believe it. It’s unforgivable.",
      "created_utc": 1731066483.0,
      "score": 20
    },
    {
      "id": "lw29xzt",
      "body": "Right there with you. Disgusted with us ww as a group. Again.",
      "created_utc": 1731065725.0,
      "score": 17
    },
    {
      "id": "lw3zlpn",
      "body": "That's sad.",
      "created_utc": 1731086738.0,
      "score": 3
    },
    {
      "id": "lw5270l",
      "body": "It's extremely toxic. They get to incite violence but we don't. We just have to passively be victims. How is this fair? Where is the justice?",
      "created_utc": 1731098194.0,
      "score": 65
    },
    {
      "id": "lw7w18f",
      "body": "Most social media is fine with people spewing hatred but all bets are off if you tell them they are \"c u next tuesday\" apparently. \n\nCool protect the bigots and the harmful people",
      "created_utc": 1731138351.0,
      "score": 4
    },
    {
      "id": "lw6twzb",
      "body": "People who beat the absolute fuck out of their sons as a first port of call, for example. On and on it goes.",
      "created_utc": 1731119752.0,
      "score": 3
    },
    {
      "id": "lw50enn",
      "body": "I like your phrasing for this. Literally linking my friends to the best currently available taser, mace, etc. I can't do a gun but I have tazed a man in the testicles more than twice.",
      "created_utc": 1731097646.0,
      "score": 3
    },
    {
      "id": "lw3z9jt",
      "body": "“Women like hunting witches too” \n\nSolid lyric. Solid song.",
      "created_utc": 1731086641.0,
      "score": 9
    },
    {
      "id": "lw4yg7w",
      "body": "I had to step away from AITA. Also no. It's reasonable to be angry when the leopard eats their face because they should have listened, seen, and acted accordingly. I had an emergency therapy session and I am grateful for my therapist because she was so good and understanding that this plus the annual PTSD is... More than I could manage",
      "created_utc": 1731097045.0,
      "score": 2
    },
    {
      "id": "lw2io9k",
      "body": "I was raised in it so I don't actually have this experience. How did this work as a hidden thing for you? Not snark but asking because I want to understand so I can better support the people who have the opposite experience from mine",
      "created_utc": 1731069772.0,
      "score": 5
    },
    {
      "id": "lwm0zqu",
      "body": "I found out this morning from my dad that she told him to get out! There’s been a lot more leading up to this that he’s done and my aunt is so over it. I don’t feel sorry for him at all either.",
      "created_utc": 1731346833.0,
      "score": 2
    },
    {
      "id": "lw6fnnu",
      "body": "im sorry to hear that. what a world we live in",
      "created_utc": 1731114522.0,
      "score": 2
    },
    {
      "id": "lw3s71s",
      "body": "Im trans so im also terrified. Im terrified for my sisters as well. My older sister had an ectopic pregnancy a few years ago and had she not been able to receive care, she would be dead right now. She also has a higher chance of having another one, since she’s had one in the past. \n\nShe just told her husband she wants to take a break from trying to have another since her state is red.",
      "created_utc": 1731084590.0,
      "score": 4
    },
    {
      "id": "lwandb3",
      "body": "Follow the money. That'll tell you a bunch about why that is.\n\nYoutube's ceo, for example, is apparently _very_ good friends with Elongated Muskrat, hence why youtubes community guidelines don't seem to apply to certain big-ticket creators and why the algorithm leans in a particular direction...",
      "created_utc": 1731180879.0,
      "score": 3
    },
    {
      "id": "lw8jhpr",
      "body": "There are positive correlations between psychopathy (the only people who really can't understand empathy) diagnoses and having suffered abuse as children. Particularly physical and/or emotional abuse.\n\nIt really aggregates me seeing people suggesting perpetuating the cycle of abuse will stop the cycle of abuse 🙃",
      "created_utc": 1731153618.0,
      "score": 2
    },
    {
      "id": "lw4y7eq",
      "body": "Can I ask for the band or singer please this may soothe me",
      "created_utc": 1731096971.0,
      "score": 3
    },
    {
      "id": "lw5jvnb",
      "body": "I spent three hours down the leopards ears face subreddit. I felt somewhat better and worse. \n\nGlad your therapist helped.",
      "created_utc": 1731103640.0,
      "score": 2
    },
    {
      "id": "lw4z5hb",
      "body": "It’s Taylor Swift, Folklore album. Song is “Mad Woman”. \n\nI wasn’t much of a fan until recently. I’ve since fallen pretty deep into the cult 😂",
      "created_utc": 1731097262.0,
      "score": 3
    },
    {
      "id": "lw4zwvm",
      "body": "Ah. I heard it and forgot since my brain doesn't retain her lyrics. Brain injury things. I admit I am not a fan but that's the beauty of music. Something for each of us. I have been listening to Hasa Diga Eebowai from Book of Mormon on loop.",
      "created_utc": 1731097494.0,
      "score": 2
    },
    {
      "id": "lw5m3dc",
      "body": "When you asked the first thing I typed was “oh dear” and then erased it lol\n\nI know she’s not for everyone, but Folklore is a great little album as far as I’m concerned. \n\nBook of Mormon! Nice",
      "created_utc": 1731104346.0,
      "score": 2
    }
  ]
}