{
  "id": "1i04f4g",
  "title": "I caught my fiance hooking up with my sister while I’m pregnant and tomorrow I’m exposing everything at our family gathering",
  "selftext": "I have reached the edge of what I can bear. I am 28, and have been with my fiance for just over three years. We live together with my four-year-old daughter from a previous relationship. Three weeks ago, I found out I am pregnant again. At first, I was overjoyed, naive enough to think we were finally creating the stable family I had always wanted. He grew distant the very next day. He ignored my excitement, started coming home late, and kept his phone glued to him at all times.\n\nI began noticing strange calls and those discreet social media notifications that vanish too quickly. My gut told me to investigate. I almost wish I had not. He has been secretly hooking up with my older sister behind my back. She was the one I always tolerated even though she drags drama wherever she goes. She would hug me when relatives were around, pretend to be the supportive older sibling, then turn around and badmouth me to her friends. I never imagined she would crawl into my life this deeply. It felt like a slap in the face to read their messages calling me clueless for not noticing.\n\nHe told her about the pregnancy before he was honest with me about his doubts, and they joked about how stressed I would be raising another child. My sister bragged that our entire family thinks she is the more interesting and more popular sibling. Meanwhile, I am just the quiet one who apparently deserves this. I do not know if they are still meeting in secret or if they just get a kick out of hurting me. My fiancé denies everything whenever I confront him, says I am hormonal, that my imagination is running wild. My sister keeps messaging me, telling me I should keep my mouth shut and stop being dramatic.\n\nI am done hiding my anger. My mother wants me to talk it out calmly, but how do I fix something so broken I can barely breathe My fiancé thinks I will just accept this. He is counting on me being too shy or too pregnant to do anything. Tomorrow, I plan to blow this up in front of the entire family. We are supposed to have a casual get-together at our parents house, ironically to celebrate my pregnancy announcement. I will gather my phone logs, the screenshots, and all those humiliating texts they sent each other. Once all the relatives have settled in, I will put everything on display. No more secrets.\n\nI might burn everything in the process. I might lose any chance of a pleasant co-parenting scenario. But I feel like I have no other way to reclaim my dignity. I have been crying nonstop for days, my nerves are shot, and all I get from my fiancé is either silent treatment or insults. My sister taunts me and acts like I am worthless. I see no reason to protect them anymore.\n\nI do not know what happens next. Maybe they will run off together. Maybe they will lie or twist things around to make me look insane. My fiancé has not contributed much financially, so I worry about affording my daughter and this potential new baby on my own. Yet I cannot pretend everything is normal. I have to protect whatever self-respect I have left. I am going to set my entire world on fire tomorrow. Part of me feels terrified, the other part is numb. Regardless, I am done letting them tiptoe around my heart. If they want my silence, they should have kept their betrayal better hidden. Let everyone see exactly who they are. That is all I have left.",
  "created_utc": 1736737313.0,
  "score": 5230,
  "num_comments": 409,
  "url": "https://www.reddit.com/r/offmychest/comments/1i04f4g/i_caught_my_fiance_hooking_up_with_my_sister/",
  "comments": [
    {
      "id": "m6v1cnv",
      "body": "Good luck. With a sister like that you don’t need any enemies",
      "created_utc": 1736737866.0,
      "score": 3676
    },
    {
      "id": "m6v4jxk",
      "body": "OMG please make a PowerPoint presentation or Google slides or whatever. You going to want everybody to get a real good view of all the information you've gathered!",
      "created_utc": 1736739041.0,
      "score": 1344
    },
    {
      "id": "m6v1sp1",
      "body": "Do you have any audio of them saying these things to you? Because I would definitely use that too. And have your whole family listen to the entire thing, ideally without your sister or fiancé present, so they can’t twist it around on you like that. I’m so sorry that you are going through this, but your sister and (hopefully soon) ex-fiancé are AHs and deserve everything that is coming to them.",
      "created_utc": 1736738031.0,
      "score": 713
    },
    {
      "id": "m6v63kt",
      "body": "Burn ‘em to the ground honey in front of everyone. Stand up, say you have a major announcement and ask for quiet. Then say “after 3 years with fiancé  I am pregnant with my fiancés child. Sorry to add that he and my sister have been fucking in recent weeks so it’s not the great news I would have preferred. Now I will turn this announcement over to my sister so she can explain the great sex she is enjoying with him.” Be sure to post an update.",
      "created_utc": 1736739619.0,
      "score": 561
    },
    {
      "id": "m6v1ru7",
      "body": "✋ please let us know what happens",
      "created_utc": 1736738022.0,
      "score": 315
    },
    {
      "id": "m6v3kno",
      "body": "You should make a presentation and show it on a tv or at least an ipad so everyone can see. trying to show everything from your phone is too difficult and you want to just lay it all out there. or OR make a folder of everything, then when you are all together airdrop everyone the screenshots. I’m really sorry this is happening, as of now you need to be as calm as possible, especially tomorrow before showing it all. you need to take the control back.",
      "created_utc": 1736738688.0,
      "score": 141
    },
    {
      "id": "m6v8s1d",
      "body": "Not to be too forward, but do not have that man's child. It's not fair to you or the fetus",
      "created_utc": 1736740632.0,
      "score": 480
    },
    {
      "id": "m6v5r48",
      "body": "Honestly I don’t blame you. The fact they’re still trying to deny it when you have proof - or maybe they don’t know?\n\nPlease update us because I wish I could have done something like this (different situation)",
      "created_utc": 1736739487.0,
      "score": 77
    },
    {
      "id": "m6v5anz",
      "body": "Don't marry him, and don't have his child. Don't deprive your existing child of attention for a family with a step parent like this awful man.\n\nCut out everyone who doubts you and protect your kid. Don't tie yourself to this loser for the rest of your life.",
      "created_utc": 1736739318.0,
      "score": 399
    },
    {
      "id": "m6vjqw3",
      "body": "Get an abortion, if possible and get out of this mess.",
      "created_utc": 1736745272.0,
      "score": 142
    },
    {
      "id": "m6v7og3",
      "body": "Get Out. \n\nOut from guy. Out from Your sister. And Our from Your family if they don't support you. \n\nDon't look back.\n\nYou can have the stable family you want. But the path to that is not through him, not through your sister, and not through any family that isn't supporting you.",
      "created_utc": 1736740209.0,
      "score": 59
    },
    {
      "id": "m6v6gta",
      "body": ". This is so bad. Please don't let your family gas light you or dismiss your feelings. \n\nAlso make sure you have second copies of all of that info. Keep them separate.",
      "created_utc": 1736739758.0,
      "score": 44
    },
    {
      "id": "m6vb1v7",
      "body": "You need to seriously consider terminating this pregnancy. This is not a person you want to try and co-parent with\n\nClaim you had a miscarriage from the stress of him cheating with your sister. But please don’t bring another child into this world when your life is a trainwreck",
      "created_utc": 1736741488.0,
      "score": 242
    },
    {
      "id": "m6vcp4e",
      "body": "I know this'll some people off, but I think an abortion would benefit you. You do not want to be tied to this man for the rest of your life because of a child, I promise you.\n\nAnd no, you won't be able to fully sever contact when the kid turns eighteen. You're going to be tied to each other for the rest of your lives.",
      "created_utc": 1736742152.0,
      "score": 79
    },
    {
      "id": "m6v7vzw",
      "body": "Can I suggest termination?",
      "created_utc": 1736740291.0,
      "score": 151
    },
    {
      "id": "m6varqx",
      "body": "I'll start on the presentation. You want different animations for different slides? Each can come with different expletives for both of them? Any specific song requests for background?",
      "created_utc": 1736741381.0,
      "score": 24
    },
    {
      "id": "m6vkydl",
      "body": "Honestly if I was in your situation all i be thinking is if I can still get abortion",
      "created_utc": 1736745853.0,
      "score": 31
    },
    {
      "id": "m6vbi1i",
      "body": "Please terminate this pregnancy. This person will be in your life forever if you don’t terminate.",
      "created_utc": 1736741667.0,
      "score": 90
    },
    {
      "id": "m6vay77",
      "body": "Are you sure you want to keep this child?",
      "created_utc": 1736741449.0,
      "score": 43
    },
    {
      "id": "m6v450t",
      "body": "Good for you torch it all down!",
      "created_utc": 1736738891.0,
      "score": 23
    },
    {
      "id": "m6vgyim",
      "body": "Whenever women talk about men being shitty partners and people start lobbing \"choose better\" grenades, this is the kind of thing they think women should be psychic enough to know will happen if we get pregnant: they'll decide you're trapped because of the pregnancy or marriage or whatever and that they can do whatever they please. \n\nBurn it all to the ground and if you can manage not to have a kid that will tie you to him indefinitely, that would be ideal. \n\nYour sister is a complete asshole.",
      "created_utc": 1736743985.0,
      "score": 20
    },
    {
      "id": "m6vh3u7",
      "body": "Why are you having his child and tying yourself to him forever? Insane",
      "created_utc": 1736744050.0,
      "score": 19
    },
    {
      "id": "m6vcaxp",
      "body": "Have the screenshots of their convos and not only projected on the family room TV, but also send them to the full family group chat. (Make sure you change all your passwords.) Meanwhile see your doc to get a full STD panel.",
      "created_utc": 1736741993.0,
      "score": 19
    },
    {
      "id": "m6v9ieu",
      "body": "Get a babysitter for your daughter. If you have a friend you can confide in then tell them in advance & have them there to support you.",
      "created_utc": 1736740910.0,
      "score": 18
    },
    {
      "id": "m6v6bi2",
      "body": "Good luck and I would throw him to the curb and go NC with the so called sister.",
      "created_utc": 1736739701.0,
      "score": 16
    },
    {
      "id": "m6vnv9f",
      "body": "Op, I’ve noticed this pattern in similar situations, where people often side with the offenders, especially if there’s a family dynamic involving a golden child and a scapegoat. In such cases, moms tend to prioritize keeping the peace, even at the expense of fairness or support.\n\nBe prepared for a lack of support and potential betrayal from your parents. It's crucial to have a plan in place. Make sure you have a go-bag packed for both you and your child, including all essential documents and any other necessities.\n\nPlease take care of yourself, stay safe, and know that I’m truly sorry you’re going through this.",
      "created_utc": 1736747308.0,
      "score": 18
    },
    {
      "id": "m6wjzpm",
      "body": "I’m going to sound really cruel and I like children so don’t think I’m biased against them but WHY are you having his child? WHY are you choosing to go forward this pregnancy that will tie you together with him forever? You’re not still going to marry him, are you? I love this standing up for yourself with the exposing the truth. Now stand up for yourself in other areas of your life. If they become a couple your sister will be that child’s stepmother and if they don’t they’ll be it’s aunty after all this drama. She will be cruel and possibly unsafe. I would really really think hard about whether it is safe and actually logical to bring a child into this mess. Get yourself and your infant away from that horrible useless man and stand on your own two feet. I’m really rooting for you and wishing you the best.",
      "created_utc": 1736767101.0,
      "score": 16
    },
    {
      "id": "m6v3c3x",
      "body": "That’s terrible. I hope you get the best possible outcome from this mess of a situation. Your fiancé and sister can kick rocks with flip flops on.",
      "created_utc": 1736738602.0,
      "score": 16
    },
    {
      "id": "m6vbq9d",
      "body": "If he's not contributing much financially wouldn't it be easier without you supporting him also? \n\nYou should print out enough copies on full size paper for everyone to get their own copy. Except for your sister and ex ofc. His things should be packed and in the car so you can transfer them to sisters car. And take your house key off his Keychain.  As soon as the baby is born put him on court mandated child support.",
      "created_utc": 1736741760.0,
      "score": 13
    },
    {
      "id": "m6vcawh",
      "body": "Please do not carry this pregnancy.",
      "created_utc": 1736741993.0,
      "score": 29
    },
    {
      "id": "m6vd1id",
      "body": "I cannot believe instead of apologizing and begging for forgiveness they are doubling down and trying to manipulate you. BURN IT ALL DOWN. Then get the fuck out. You’ve got this!! You are strong and already a kickass mom and can do amazing things! FUCK THEM",
      "created_utc": 1736742292.0,
      "score": 12
    },
    {
      "id": "m6wmdkc",
      "body": "Personally I wouldn’t continue to be pregnant by this person and cut all ties with him and your sister. Move to your parents so you can get on your feet. Or a friends.",
      "created_utc": 1736768459.0,
      "score": 13
    },
    {
      "id": "m6v36zz",
      "body": "Is there a possibility for an abortion?",
      "created_utc": 1736738549.0,
      "score": 119
    },
    {
      "id": "m6vxuj9",
      "body": "Please consider terminating the pregnancy. I know emotionally it’s hard, but staying tied to a man that is useless and with your sister isn’t worth it.",
      "created_utc": 1736752909.0,
      "score": 10
    },
    {
      "id": "m6v3sj7",
      "body": "I'm so sorry this is happening but I do not think you should be having a baby with this person. Good luck with everything.",
      "created_utc": 1736738765.0,
      "score": 51
    },
    {
      "id": "m6v7qsl",
      "body": "OP, this is definitely the time you need to show the world what you are made of.  Do not let those two assholes get away with this disgusting behavior.\n\nYour ex-fiancé and your sister are foul.  He’s unemployed and useless and she’s jealous and useless.  They deserve each other.\n\nNow, your family may not back you in this so please be prepared to tell any and all to eff off.  Then, get him out of your house and make sure you get a child support order.",
      "created_utc": 1736740234.0,
      "score": 10
    },
    {
      "id": "m6wnf1k",
      "body": "I work seriously think about getting an abortion. You will be tied to this man forever if you keep the pregnancy. You can always tell people you miscarried if you do not want others to know about an abortion.",
      "created_utc": 1736769023.0,
      "score": 9
    },
    {
      "id": "m6vghaf",
      "body": "Get an abortion, that’s not the kind of guy you want to have a coparenting relationship with",
      "created_utc": 1736743773.0,
      "score": 21
    },
    {
      "id": "m6vwvoe",
      "body": "Have an abortion.",
      "created_utc": 1736752326.0,
      "score": 10
    },
    {
      "id": "m6ve86y",
      "body": "Blow the whole joint up !! Spare no expense or ugly detail …. I wouldn’t have his baby but that’s up to you…. Come back and tell us what happened ..I hate this for you .!!!",
      "created_utc": 1736742794.0,
      "score": 8
    },
    {
      "id": "m6yeksl",
      "body": "Consider termination. Get away from that man, now. He’s not the father figure you want for your child.",
      "created_utc": 1736791048.0,
      "score": 8
    },
    {
      "id": "m6v8b0r",
      "body": "I am so sorry this is happening to you, you don't deserve to be treated this badly by people who are supposed to love you the most. They are disgusting and vile and deserve everything that is coming to them. \nI am glad you are standing up for yourself, you are teaching your daughter self respect, a presentation or folders for the family is a great idea. Go NC with your horrible sister and anyone who sides with her. \nAt the end of the day the most important thing is you, your baby and your daughter. Protect those things and very best of luck xx",
      "created_utc": 1736740450.0,
      "score": 6
    },
    {
      "id": "m6vp4ky",
      "body": "Don't have this child. You already know you won't stay together. Do you really want 2 kids from2 different guys you are not with anymore? Never mind your sister having access to it if she stays with him. You'll be stuck with those 2 forever.Don't have it and cut all contact, no need for it if there is child you are going to struggle raising.",
      "created_utc": 1736747962.0,
      "score": 7
    },
    {
      "id": "m6whnzp",
      "body": "End the relationship, obviously. \n\nI’d think long and hard about bringing this child into the world. I don’t think you are in a good position to do that. Clearly he’s not gonna help or be involved. Think really hard on that one. \n\nFinally, good luck exposing the trash.",
      "created_utc": 1736765719.0,
      "score": 7
    },
    {
      "id": "m6w1n6a",
      "body": "I know everyone is focusing on the pregnacy part right now but OP also needs to protect bank accounts if jointly-owned and other acounts, too. Scumbag ex-fiancé is going to cut and run once he is exposed, same with the sister, too. Start getting refunds on wedding venue and vendors or plan a breakup party if you cannot refund. \n\nAs for your sister, she's dead to you now. Family doesn't hurt you like that. I am sorry you experienced this. Please be good to yourself and for your daughter. You did nothing wrong at all. Expose them for the disgusting, evil POS they are.",
      "created_utc": 1736755247.0,
      "score": 6
    },
    {
      "id": "m6vp60n",
      "body": "Oh my, this is so clearly a creative writing piece, how does no one else realize",
      "created_utc": 1736747983.0,
      "score": 12
    },
    {
      "id": "m6v8sqi",
      "body": "Make sure you gather as much evidence of them cheating first so you have proof so they both can’t deny then move forward and consult a lawyer and tell your parents and go from there.",
      "created_utc": 1736740640.0,
      "score": 5
    },
    {
      "id": "m6v9dpa",
      "body": "keep the evidence and get child support from that POS.",
      "created_utc": 1736740859.0,
      "score": 5
    },
    {
      "id": "m6vda8i",
      "body": "Really should be \"ex-fiance\". You deserve better than that man child bully.",
      "created_utc": 1736742392.0,
      "score": 5
    },
    {
      "id": "m6vg4s1",
      "body": "Do you have a safe place to go to after this all comes out - separate finances etc?",
      "created_utc": 1736743619.0,
      "score": 4
    },
    {
      "id": "m6xg00w",
      "body": "Are you sure you want to have a baby with this man?",
      "created_utc": 1736780681.0,
      "score": 4
    },
    {
      "id": "m7177y0",
      "body": "GOOD FOR YOU!!! The time to talk calmly is not now when their disrespect is so loud!!! PLEEEEAAAASSSSEEEE update us!!!",
      "created_utc": 1736822014.0,
      "score": 4
    },
    {
      "id": "m6v6wqc",
      "body": "Just wow! I'm sorry you have to go through this.\n\nYou got this! Hopefully, your family will provide some support emotionally. Once the child is born, you can go through the steps to get child support from him. You will be okay! Your children will be okay, too!\n\nI hope they do move away. I say that because shared custody won't be fun. \n\nIt will get harder before it gets better, but you will handle it! And you're done being walked on!!",
      "created_utc": 1736739921.0,
      "score": 3
    },
    {
      "id": "m6ve95r",
      "body": "I’m sorry that they caused you this harm. But I’m totally with you on burning it to the ground and showing everyone what they are really like, and then blocking anyone who doesn’t support you on this. \n\nI would appreciate an update, please.",
      "created_utc": 1736742806.0,
      "score": 4
    },
    {
      "id": "m6vfde3",
      "body": "Your older sister is a prime example of a narcissist, cut her off or she will wear you down. From my experience, you cant be wishfully thinking with a narcissist.",
      "created_utc": 1736743285.0,
      "score": 4
    },
    {
      "id": "m6vhz4a",
      "body": "Get a lawyer for coparenting. Don't deal with this asshole unless he is civil. No one is entitled to your good nature.",
      "created_utc": 1736744443.0,
      "score": 4
    },
    {
      "id": "m6vkepf",
      "body": "Burn it allllllll down, luv. \n\nYou have the moral high ground and the power. Use it wisely but freely. Your family can choose you & your children, or the sociopath they created and raised. Rally your friends, now is the time! \n\nPeople are advising you to terminate, which of course is not anybody's decision except your own. I'll say that I left my second husband when I was cheated on and dismissed, and found out right around that time I was expecting my second baby. He is now a highly successful young man , one of the best things in my life. But, I'm not you. ❤️  I had a supportive family that took me in and helped me in every way imaginable, and the resources to be able to care for two kids. \n\nI'm so sorry this is currently your life. It won't always be. I just offered up a prayer for your peace of mind, happiness, and some good, calm, rational decision making. 🙏🏻🙏🏻  You are going to survive this and you'll find this sordid bs is in your rearview mirror before you know it. \n\n\nI'll be thinking of you.",
      "created_utc": 1736745589.0,
      "score": 4
    },
    {
      "id": "m6vpsuk",
      "body": "Make copies! \n\nLeave one in a safe place. Hand out a copy to everyone.",
      "created_utc": 1736748316.0,
      "score": 4
    },
    {
      "id": "m6w02c8",
      "body": "Prepare yourself for a possible outcome…\n\nYour steely cool reveal of this awful affair could send your sister into a crying mess as her perfect image pops in front of her family. \n\nYour shocked family may run to her aid, not because they side with her choices but because she starts to flail and weep. They may react not to the info itself but to the way it was expressed, and could find this outing of personal business to be outrageous. \n\nJust be prepared for them to comfort your sister and be cross with you.",
      "created_utc": 1736754271.0,
      "score": 5
    },
    {
      "id": "m6x3f6e",
      "body": "#GOOD LUCK!",
      "created_utc": 1736776168.0,
      "score": 4
    },
    {
      "id": "m6x915w",
      "body": "OP, do not carry out this pregnancy. It wouldn't be right to bring a child into this world with this mess going on. It's not good for you mentally. Please reconsider your options and give the best life possible to your daughter. You don't want to have any ties to your shitty fiancé. Unfortunately, we can't pick and choose our family but that doesn't mean you have to speak to your sister either.\n\nWhen you expose them, cut off anyone who reprimands you for making the PowerPoint. Good luck.",
      "created_utc": 1736778259.0,
      "score": 4
    },
    {
      "id": "m6xb8vs",
      "body": "OP I know you want this baby, but do you want to be tied to him and potentially your sister if they start dating, fighting over co parenting for the next 2 decades? \n\nPrioritise your future. Your mental health. Your daughter is not his, you can give yourself a clean break and be done with them, or spend decades fighting with them. I know what I would do (Hugs)",
      "created_utc": 1736779058.0,
      "score": 4
    },
    {
      "id": "m727n7w",
      "body": "OP, he's not going to co-parent anyways since she's laughing about how stressed YOU will be when YOU have to raise another child. He has no plan to be involved. \n\nBring the fucking fire. Destroy them in front of everyone.\n\nYour sister is an idiot tool to think he would stick around for her, too.\n\nThat fool is leaving asap and we all know it. \n\nYou deserve the best. Make it a shit show for them. Shame them. Fucking horrible people.\n\nI'm so sorry.",
      "created_utc": 1736837193.0,
      "score": 4
    },
    {
      "id": "m6v7kmk",
      "body": "I’m here for you!!!!",
      "created_utc": 1736740170.0,
      "score": 3
    },
    {
      "id": "m6v885y",
      "body": "they deserve this",
      "created_utc": 1736740421.0,
      "score": 3
    },
    {
      "id": "m6v91zd",
      "body": "Good luck and good riddance to bad rubbish.  You can do this!",
      "created_utc": 1736740739.0,
      "score": 3
    },
    {
      "id": "m6v9fh1",
      "body": "SubscribeMe!",
      "created_utc": 1736740877.0,
      "score": 3
    },
    {
      "id": "m6ven99",
      "body": "Drop those nukes!\n\nThen come back here and tell us all about it.",
      "created_utc": 1736742970.0,
      "score": 3
    },
    {
      "id": "m6vhsfy",
      "body": "Fuck’em!! Your sister sounds like a real piece of shit. The betrayal is astonishing. And kick that sorry ass baby daddy to the curb right along with her.",
      "created_utc": 1736744358.0,
      "score": 3
    },
    {
      "id": "m6vkiwa",
      "body": "I think this calls for a fraction video, maybe a livestream to their friends?",
      "created_utc": 1736745645.0,
      "score": 3
    },
    {
      "id": "m6vknd3",
      "body": "Sometimes setting it ablaze is the only way to go. I'm so sorry you are going through this, especially while pregnant. You are strong, you will make it through this. You and your babies are worthy of so much better than this, being alone is better than this. Strike that match and burn it all down. Best of luck, OP.",
      "created_utc": 1736745705.0,
      "score": 3
    },
    {
      "id": "m6vm4b9",
      "body": "OP, first I want to say that I am so sorry you are going through this. My heart hurt reading this. I truly hope you go to that dinner and expose both of them. Some will say “be the bigger person.” And yk what, fuck that & fuck them! \n\nYou do not deserve this treatment and if anyone says anything, remember that the actions are justified because the disrespect matches the punishment you should dish out. \n\nAfter you do that, please please leave that man. Lean on family and friends who will be there for you, truly. Thank of your daughter and if you decided to keep the pregnancy, think of them too. They don’t deserve to witness their mom go through the things those vile pieces of shit are putting you through. Show them that no one has the right to walk over them, to disrespect them, and to harm them. \n\nYou got this love! I wish I knew you IRL because I want to give you the biggest hug and be your friend to support you during this time. Stand strong, stand firm. Do not let them make a fool out of you. Do not let them take your dignity which is not theirs to take. Karma always comes around and pieces of shit like them will get theirs.",
      "created_utc": 1736746429.0,
      "score": 3
    },
    {
      "id": "m6vp0tq",
      "body": "After all are still calling him your fiance? You didn’t break up with him? Make sure to do so and not go back. \nAre you gonna have the baby?",
      "created_utc": 1736747907.0,
      "score": 3
    },
    {
      "id": "m6vp81s",
      "body": "For a minute I thought this was a story on Pocket FM or DramaBox, but then realized no one had slapped OP!\n\nMy word i can't believe this is your life! Make a PowerPoint, have handouts so everyone can follow along, and bring a cookie for your sister because she did good by helping you take the trash out. They deserve each other and you deserve much, much better.",
      "created_utc": 1736748012.0,
      "score": 3
    },
    {
      "id": "m6vsktm",
      "body": "How are people like this to their siblings?!? It legit blows my mind 🤯🤯🤯",
      "created_utc": 1736749840.0,
      "score": 3
    },
    {
      "id": "m6w2xyr",
      "body": "Lots of people are suggesting things that would add to the drama and are titillated by the spectacle. It may be an unpopular take, but I’d caution you to reconsider. Obviously not the ending of your relationships with both your partner and your sister, but the public spectacle. It may feel like it would be revenge and winning, but it rarely is and puts you and your emotions on a very public arena. \n\nThe high road, if there is one, is to focus on you and your children. Taking the high road by quietly and carefully, removing yourself from his life and covering yourself legally is the way to really take revenge. \n\nThe biggest revenge on Drama seekers is zero attention, excitement or power. Calmly and quietly giving them no confrontation point and demonstrating that you are in control of yourself is hard but ultimately far more rewarding.",
      "created_utc": 1736756075.0,
      "score": 3
    },
    {
      "id": "m6w56te",
      "body": "Before you scorch Earth make sure you have done with practical Logistics. Meaning you have a safe place after you've divulged this information, made sure your finances are separate and your belongings are secured. Good luck",
      "created_utc": 1736757552.0,
      "score": 3
    },
    {
      "id": "m6w8bj8",
      "body": "Consider an abortion, do you want to be tied to this vile asshole for the next 18years?\n\nI recommend you never speak to that jealous snake of a sister again. \n\nAt the reveal Stand strong and don’t let them talk over you. Tell them they are disgusting people. ",
      "created_utc": 1736759639.0,
      "score": 3
    },
    {
      "id": "m6wt6tk",
      "body": "Is abortion an option?",
      "created_utc": 1736771870.0,
      "score": 3
    },
    {
      "id": "m6wx3k3",
      "body": "Do not bring a child into this situation, the poor thing will be weaponised against you.",
      "created_utc": 1736773610.0,
      "score": 3
    },
    {
      "id": "m6wzref",
      "body": "Are you sure you want to continue with this pregnancy? You're already blessed with a family of you and your daughter. Do you really need to be connected to this guy for the rest of your life?",
      "created_utc": 1736774724.0,
      "score": 3
    },
    {
      "id": "m6x242y",
      "body": "I strongly believe the best course of action for you, or someone in your position, is to get an abortion. Don’t have another baby. Especially not in this cesspool. Go scorched earth with your sister and the ex-fiance.",
      "created_utc": 1736775663.0,
      "score": 3
    },
    {
      "id": "m6x3nb0",
      "body": "Unfortunately, there may be a chance that what your sister is saying rings true. She *might* be the more popular sibling. If that's true, you might not get the reaction you want out of your family. \n\nWhich begs the question: What do you want to get out of this? Do you want your family to hate/disown your sister? Do you want them to beat up your fiance? What if they laugh at you? Are you prepared to cut all of these people off if you don't get the reaction you want? Are you prepared for them not to care, or even be happy if you do cut them off? \n\nChances are it'll split the family between the ones who support you, and the ones who support your sister. You might find yourself with the ones you don't want taking your side. You might find no one takes your side. Either way, changes are coming.",
      "created_utc": 1736776255.0,
      "score": 3
    },
    {
      "id": "m6xh36e",
      "body": "Good luck with everything!\nAs someone else said, remember that your sister can become the stepmom if your fiance and she stays together. And she absolutely seems like a person who would weaponize a baby.",
      "created_utc": 1736781044.0,
      "score": 3
    },
    {
      "id": "m6xo7ff",
      "body": "I would make several copies of the texts. Staple them together And hand them out.  That way family can read along as you read.\n\nEdited for spelling",
      "created_utc": 1736783292.0,
      "score": 3
    },
    {
      "id": "m6xuikg",
      "body": "I am a pure Scorpio and the scorpio in me wants to tell you if a man cheats on you. He should never have peace again. Leave the children with him FULLTIME. Will it hurt? Absolutely women are caretakers and these are your children.  But if yall get a divorce he will be free to be happy with your sister. Leave the children with the hubby and cut off your sister…id prob ruin her life too but that’s for another thread.",
      "created_utc": 1736785206.0,
      "score": 3
    },
    {
      "id": "m6yjwth",
      "body": "Wow idk what to say to that, I’m sorry you’re in that situation \n\nLord knows if it was me I’d terminate pregnancy drop him and the sister and any family who supports them.",
      "created_utc": 1736792587.0,
      "score": 3
    },
    {
      "id": "m6v4wio",
      "body": "Can I buy a ticket?",
      "created_utc": 1736739173.0,
      "score": 6
    },
    {
      "id": "m6v93b9",
      "body": "I’m not sure I believe this but if it’s true I feel very bad for you and think you’re doing the right thing.",
      "created_utc": 1736740753.0,
      "score": 6
    },
    {
      "id": "m6v9hea",
      "body": "Hope the best for you",
      "created_utc": 1736740899.0,
      "score": 2
    },
    {
      "id": "m6vcps5",
      "body": "I don’t know you but I can’t imagine that level of betrayal.  Please find someone to talk to so that you can process all of your feelings safely and with the support you need. I wish you healing!",
      "created_utc": 1736742160.0,
      "score": 2
    },
    {
      "id": "m6ve3dc",
      "body": "gl, let me know if u already blow this up",
      "created_utc": 1736742736.0,
      "score": 2
    },
    {
      "id": "m6vg6em",
      "body": "Hope all goes well! Make sure you have people with you who know and who will support you just in case your fiancé and sister try to spin things around!!",
      "created_utc": 1736743638.0,
      "score": 2
    },
    {
      "id": "m6vgqbf",
      "body": "Print out the photos and hand them out to people as if they were something for the baby, make a big PowerPoint presentation where you put everything together. We will be here for you when you need it, I know it will probably all go to shit but I understand you want to show what shitty people they are and honestly they deserve it\n\nPd: if you can send me everything to the people who work with your ex and your sister, thing they will be destroyed all over the place. Send it to everyone who has the slightest relationship with them if possible.",
      "created_utc": 1736743885.0,
      "score": 2
    },
    {
      "id": "m6vh4xg",
      "body": "Good luck tomorrow! You are DONE with the BS they’ve been putting you through!",
      "created_utc": 1736744063.0,
      "score": 2
    },
    {
      "id": "m6vhe6h",
      "body": "I wish I was able to witness this. This is just what they deserve.",
      "created_utc": 1736744178.0,
      "score": 2
    },
    {
      "id": "m6vhfhf",
      "body": "Do what you need to do. There is no obligation for you to handle this quietly. You need to leave this relationship and put him on child support of you choose to continue with the pregnancy.  Your mum should be ashamed of herself not standing up for you against your sister. I hope you find someone to support you from your family.",
      "created_utc": 1736744194.0,
      "score": 2
    },
    {
      "id": "m6vl9uu",
      "body": "Burn it to the ground and rise from the ashes like a beautiful phoenix queen! I am so sorry you have been betrayed like this. I wish you the best of luck, I'll be thinking of you tomorrow and hoping for the best outcome for you. If it doesn't go as planned, I do have a truck, shovels, and tarps. Hit me up.❤️🙏",
      "created_utc": 1736746009.0,
      "score": 2
    },
    {
      "id": "m6vmrv5",
      "body": "NO IM TOO EARLY 😭😭 goodluck tho !!",
      "created_utc": 1736746756.0,
      "score": 2
    },
    {
      "id": "m6vqjnx",
      "body": "Update us",
      "created_utc": 1736748717.0,
      "score": 2
    },
    {
      "id": "m6vqtif",
      "body": "I have 4 brothers, so I have sometimes wished that I had a sister.... Then I come on Reddit and suddenly I am fine with only having brothers 😅 yikes",
      "created_utc": 1736748868.0,
      "score": 2
    },
    {
      "id": "m6vraey",
      "body": "Good luck! \n\nAnd this is you standing up for yourself and your child! \n\nYour sister and fiancé are assholes and should be confronting!",
      "created_utc": 1736749129.0,
      "score": 2
    },
    {
      "id": "m6vrhir",
      "body": "I am so sorry hun, but I am so proud of you for not just sitting down and taking this behavior.\n\nAnd...I have to agree with the others saying to not tie yourself to this man, because if he decides to get with your sister then she WILL make co-parenting hell on you and you don't want or need that. Cut out all the toxic people in your life, you deserve so much better that this.",
      "created_utc": 1736749238.0,
      "score": 2
    },
    {
      "id": "m6vszo7",
      "body": "i'm sorry. for him to do this to you, while carrying his child no less, is a whole new level of low. same thing for your sister. taunting you? insulting you? and then expecting you to just keep quiet? hell no. set EVERYTHING on fire. tell their jobs. their friends (if they have any). they deserve nothing after all this being willingly enough to do this. also tell your mother to get some better parenting skills. no offense to your mom, but her suggesting \"talk it out calmly\" in regards to a fucking marital affair?? it's no fucking wonder why your sister did this. talking isn't the solution anymore. back to the fuckwad of a husband, kick him out. put all his shit on the front lawn. tell their jobs neighbors. shame him and embarrass him the same way he did you. to cheat on someone is one thing, but to cheat on someone who's currently carrying your baby is beyond reprehensible. if they have an issue being exposed, to hell with them. don't do the crime if you wanna face the consequences.",
      "created_utc": 1736750071.0,
      "score": 2
    },
    {
      "id": "m6vusi2",
      "body": "Ex fiancée I assume. Make a video of the event and put it on TikTok",
      "created_utc": 1736751090.0,
      "score": 2
    },
    {
      "id": "m6vvhmd",
      "body": "I’m with you. Your sister walks all over you because she thinks you’ll never stand up for yourself. This is your moment and you’re taking it and I’m **proud of you**. You’re not doing anything wrong — *they* did everything wrong and you’re just laying the facts out for everyone to see. \n\nIt’s going to be the first day of the rest of your life. Have your moment to mourn and then pick up those pieces and take the steps to build a better life with both of them out of it. It’s scary — especially with another one on the way (if that’s what you choose). But you can do it. Do it for yourself and do it to show your daughter not to accept less than she deserves by setting the example of when to walk away. \n\nYou’ll find someone someday who loves you and is worthy of you. Who will support you and be an actual partner. Your sister and ex will probably always be miserable people. Ditch them and find your happiness. You deserve it.",
      "created_utc": 1736751496.0,
      "score": 2
    },
    {
      "id": "m6vvx8l",
      "body": "Maybe ask one of your family members who u trust and who will be there for help.  Also try to record the whole thing.  I would just send one mass text with pics of the messages as well as provide everyone with a hard copies at this event. Good luck to you and I am so sorry.",
      "created_utc": 1736751750.0,
      "score": 2
    },
    {
      "id": "m6vxm17",
      "body": "Go nuclear! \nLet the whole family see them for who they really are, and as for your mum... well, she is just enabling your susters' disgusting behaviour by saying you should \"talk it out.\"\nWhy is she so adamant that you should talk about it? Does she know the full extent? Is she just being willfully ignorant? Or is your sister her golden child?",
      "created_utc": 1736752764.0,
      "score": 2
    },
    {
      "id": "m6w8d60",
      "body": "Girl. Take him to the cleaners!!!! Marry him and TAKE IT ALL",
      "created_utc": 1736759669.0,
      "score": 2
    },
    {
      "id": "m6w8oeh",
      "body": "SKYPE HIS PARENTS!",
      "created_utc": 1736759882.0,
      "score": 2
    },
    {
      "id": "m6wbuvs",
      "body": "I’m so sorry that you’re dealing with this. I caught my nex cheating when I was pregnant with our youngest child. It was the was the first time I caught him but probably not the first time he’d cheated. It certainly wasn’t the last. He & his ap made my pregnancy a nightmare. I had to go to the hospital a couple of times to stop preterm labor caused by stress. Your sister and your fiancé are terrible people that probably deserve each other. I congratulate you for your plans to expose them. I love the ideas some other commenters have mentioned such as a PowerPoint presentation and airdropping the screenshots of their texts etc. Good luck & please update.",
      "created_utc": 1736761982.0,
      "score": 2
    },
    {
      "id": "m6wghho",
      "body": "Hey, I'm proud of you, dont stay quiet, print evidence and send it . Also file for custody",
      "created_utc": 1736764989.0,
      "score": 2
    },
    {
      "id": "m6wivp2",
      "body": "Do it! The truth will set you free. Keeping quiet only helps the perpetrators and keeps you in bitterness all your life.\n\nTell the truth. Set yourself free. Find Peace.",
      "created_utc": 1736766449.0,
      "score": 2
    },
    {
      "id": "m6wq8xk",
      "body": "I’m loving the power point idea. But above all , I’m so sorry that you have to go through this .",
      "created_utc": 1736770478.0,
      "score": 2
    },
    {
      "id": "m6wyjux",
      "body": "They deserve it!\nHigh five for standing up for yourself like that! Good luck with everything ❤️",
      "created_utc": 1736774223.0,
      "score": 2
    },
    {
      "id": "m6xn2bc",
      "body": "Get a lawyer ASAP. You need alimony and child support. Put him behind bars if he doesn't pay. Your family may betray you, so be ready to stand strong.",
      "created_utc": 1736782942.0,
      "score": 2
    },
    {
      "id": "m6y7aml",
      "body": "Damn wtf. I'm so sory",
      "created_utc": 1736788955.0,
      "score": 2
    },
    {
      "id": "m6zb3x1",
      "body": "Omg, waiting for the update.\n\nGood luck OP!!!!!!",
      "created_utc": 1736800494.0,
      "score": 2
    },
    {
      "id": "m6zno0i",
      "body": "Well, if you go the nuclear option.. go all the way. You either take him to the cleaners in child support or get an abortion… either way.. the fallout will be harsh.",
      "created_utc": 1736804138.0,
      "score": 2
    },
    {
      "id": "m6zps9p",
      "body": "Give us an update OP please!!",
      "created_utc": 1736804760.0,
      "score": 2
    },
    {
      "id": "m713lo9",
      "body": "This is why abortions exist. In my opinion, based on the information available about the sister and fiance, having the fiances baby would be akin to child abuse of the existing child. \n\nYou’ll fuck that whole kids life up trying to care for this new one with the fiancé and sister still in the picture",
      "created_utc": 1736820850.0,
      "score": 2
    },
    {
      "id": "m717d09",
      "body": "Save everything you find. These will come handy when and if you take his ass to court for custody. The ball is in your court. And trust me honey, you won’t be the first single mom whose baby daddy wronged her. I’m saying this because yes it’s a tough road but you’re going to get through this. Yes you’ll grow stronger. And yes your children need their dad. But they first need a mother who feels respected and supported. And your POS partner and sister AINT IT. Put up your boundaries, go to therapy, and start the journey of becoming self dependent. Bc no matter what you choose, you have to be strong and patient for yourself and your children. Good luck in whatever you choose.",
      "created_utc": 1736822059.0,
      "score": 2
    },
    {
      "id": "m71vxux",
      "body": "PUT 👏🏻THEM👏🏻 IN 👏🏻THEIR👏🏻 PLACE👏🏻 QUEEN 👏🏻",
      "created_utc": 1736831174.0,
      "score": 2
    },
    {
      "id": "m72hwdo",
      "body": "I'm so sorry this is happening to you , especially during a time that  should be happy and is already stressful. Your sister is gross as hell imo to touch her sister's leftovers 😷.",
      "created_utc": 1736843492.0,
      "score": 2
    },
    {
      "id": "m72w24j",
      "body": "Please update with how everything works out",
      "created_utc": 1736852649.0,
      "score": 2
    },
    {
      "id": "m73acwh",
      "body": "Someone please let me know if there’s an update",
      "created_utc": 1736859773.0,
      "score": 2
    },
    {
      "id": "m74ddi0",
      "body": "Update?",
      "created_utc": 1736872905.0,
      "score": 2
    },
    {
      "id": "m7899my",
      "body": "Put it all out there. They can’t lie, gaslight, or escape this if it’s all brought into the light. Don’t feel bad about it either. They made this mess, let them stew in it.",
      "created_utc": 1736919129.0,
      "score": 2
    },
    {
      "id": "m6vbp6s",
      "body": "This should be a book. Change up the names. You can make a book and turn it into profit. Just like sex sells, so does juicy gossip.  Just a thought",
      "created_utc": 1736741748.0,
      "score": 4
    },
    {
      "id": "m6x8ttb",
      "body": "Video or it didn’t happen",
      "created_utc": 1736778185.0,
      "score": 2
    },
    {
      "id": "m6vs4t3",
      "body": "Honestly don’t I blame you",
      "created_utc": 1736749596.0,
      "score": 1
    },
    {
      "id": "m6vt9aq",
      "body": "Why do you have that man’s baby?",
      "created_utc": 1736750221.0,
      "score": 1
    },
    {
      "id": "m6vtlnx",
      "body": "Please update us, so sorry you’re going through that",
      "created_utc": 1736750414.0,
      "score": 1
    },
    {
      "id": "m6vtn9t",
      "body": "In the presentation, you should put in one of the slides a question to your sister, the question being if his dick was worth ruining everything (if she gets new partners, this might be valuable information; same for him, who needs to be your ex).",
      "created_utc": 1736750439.0,
      "score": 1
    },
    {
      "id": "m6vto6b",
      "body": "You have to do this for your own self reso6and dignity. \n\nI wish you the best op.   Don't let people push you around.",
      "created_utc": 1736750453.0,
      "score": 1
    },
    {
      "id": "m6vuylh",
      "body": "I'm so sorry that's happening to you, OP. I hope you're able to care for your daughter and yourself during this time. Of all your choices, remember you do not have to continue this pregnancy if you don't want to. Or you can! Either way, good luck, babe.",
      "created_utc": 1736751187.0,
      "score": 1
    },
    {
      "id": "m6vvqpq",
      "body": "Can you go to your parent’s place tonight and work on your presentation?  It would be less stressful, allow you stay calm and focused.  Not sure what equipment you have but I like the suggestion of airdropping the documents to everyone.  Tell them you have a “reveal” so they all upload the appropriate app.  And then boy do you have a reveal.  \n\nMake sure to stay calm and speak clearly.  Keep it simple.  That way they cannot say you are crazy or drama.  They will yell and scream.  Then tell him to get out of the apartment in front of everyone.  Any chance you can get the locks changed while they are at the party? You definitely need to end this engagement.  Maybe that is the last side?  Bye Felicia!",
      "created_utc": 1736751643.0,
      "score": 1
    },
    {
      "id": "m6w18w8",
      "body": "SubscribeMe",
      "created_utc": 1736755001.0,
      "score": 1
    },
    {
      "id": "m6w5jku",
      "body": "You do what is best for you. And I respect you for it. They brought this onto themselves. I hope you manage to find peace with your daughter and upcoming child, and for yourself. ❤️",
      "created_utc": 1736757787.0,
      "score": 1
    },
    {
      "id": "m6w6fm8",
      "body": "Update!",
      "created_utc": 1736758374.0,
      "score": 1
    },
    {
      "id": "m6w8k84",
      "body": "Burn his shit on top of her car. I'm so angry for you!!!",
      "created_utc": 1736759803.0,
      "score": 1
    },
    {
      "id": "m6wfesa",
      "body": "I wish you luck. I’m proud of you for standing up yourself. That takes great courage!",
      "created_utc": 1736764303.0,
      "score": 1
    },
    {
      "id": "m6wjotv",
      "body": "YESSSSSSSSSS! You expose the lying, cheating, losers for what they are with your head held high. Then cease all communication from them. This is their doing so they can live in the hell fire they created. And then years from now when whatever life they have together implodes (because oh how it will implode), you can watch their lives get destroyed form afar because you will be living you best life with your beautiful babies.",
      "created_utc": 1736766923.0,
      "score": 1
    },
    {
      "id": "m6wrpo2",
      "body": "You have every right to be upset with these backstabbers  -  having an affair with your sibling's significant other behind their back  is one of the worst ways to betray someone , especially a family.\n\n You are far better off on your own rather than being surrounded by people who don't appreciate you and take you for granted. Expose their asses",
      "created_utc": 1736771166.0,
      "score": 1
    },
    {
      "id": "m6wslcd",
      "body": "Please let us know what happens. Sorry your fiancé and sister sucks",
      "created_utc": 1736771587.0,
      "score": 1
    },
    {
      "id": "m6wswts",
      "body": "Update please !",
      "created_utc": 1736771739.0,
      "score": 1
    },
    {
      "id": "m6wujpq",
      "body": "Burn the bridges. You don't need either of them. Your sister is a waste and your fiance is a nasty piece of shit. \n\nGo nuclear, pack up and leave. You're not married yet. She can have your sloppy seconds. Ew.",
      "created_utc": 1736772490.0,
      "score": 1
    },
    {
      "id": "m6wutww",
      "body": "Wow.  I am sorry this happened to you.  I fully support going scorched earth.  It sounds like you would be better off without them.  I would also send everything to every single friend and acquaintance of theirs, their workplace, and every single family member.  Have it ready to go at a push of a button and then while at the dinner push send before you let everybody know everything at dinner.  This ensures the world knows how dirty they are and they can’t stop you.",
      "created_utc": 1736772617.0,
      "score": 1
    },
    {
      "id": "m6wywvw",
      "body": "Good luck!! Burn it down!!! Il so sorry you’re going through this. I’ll patiently wait for the update.",
      "created_utc": 1736774375.0,
      "score": 1
    },
    {
      "id": "m6x8dbe",
      "body": "Need update",
      "created_utc": 1736778019.0,
      "score": 1
    },
    {
      "id": "m6xc415",
      "body": "Many people start life in a cocoon of shyness and uncertainty.   \nIt's time for you to burst from your cocoon as a beautiful butterfly with wings of fire and lightning.",
      "created_utc": 1736779364.0,
      "score": 1
    },
    {
      "id": "m6y5sq6",
      "body": "Everyone does need to know about what your sister and your fiancé are doing to you.\n\nUpdate us please.",
      "created_utc": 1736788518.0,
      "score": 1
    },
    {
      "id": "m6y6zsi",
      "body": "Honestly, you go girl!",
      "created_utc": 1736788867.0,
      "score": 1
    },
    {
      "id": "m6ymd32",
      "body": "Good luck, OP!! I hope whatever you decide to do, you have the best possible outcome. 💕",
      "created_utc": 1736793295.0,
      "score": 1
    },
    {
      "id": "m6yxcfy",
      "body": "I’m so sorry 🥺",
      "created_utc": 1736796484.0,
      "score": 1
    },
    {
      "id": "m6z65su",
      "body": "Rooting for you OP!",
      "created_utc": 1736799043.0,
      "score": 1
    },
    {
      "id": "m6z6koz",
      "body": "Updates? 🤔",
      "created_utc": 1736799164.0,
      "score": 1
    },
    {
      "id": "m6zcxuz",
      "body": "Burn it down and walk away with your head held high!",
      "created_utc": 1736801030.0,
      "score": 1
    },
    {
      "id": "m6zeljz",
      "body": "Good luck. If you are going to do this do it thoroughly. Write it out so when under pressure you have a guide. Could send email or text with all the photos right before you start so that everyone will have it in front of them as you walk through the proof.",
      "created_utc": 1736801514.0,
      "score": 1
    },
    {
      "id": "m6zhxep",
      "body": "I vote abortion and blast them.",
      "created_utc": 1736802477.0,
      "score": 1
    },
    {
      "id": "m6zwjk7",
      "body": "Can we get an update on this? \n\nYour sister and the fiance suck. You'll be better off without them.",
      "created_utc": 1736806777.0,
      "score": 1
    },
    {
      "id": "m703gqi",
      "body": "Update!!",
      "created_utc": 1736808937.0,
      "score": 1
    },
    {
      "id": "m70amht",
      "body": "Update please!",
      "created_utc": 1736811295.0,
      "score": 1
    },
    {
      "id": "m70edtv",
      "body": "You deserve to be happy. F them! 🔥",
      "created_utc": 1736812566.0,
      "score": 1
    },
    {
      "id": "m710ahu",
      "body": "None of what transpired is ok. You don't have to be trapped. I know a lot of people have frowned upon abortion. I got pregnant by a guy who wanted the baby but was also more interested in other people. I thought, he might be a good dad but would be a terrible partner to me. Everybody deserves a quality partner. I got an abortion and he paid for most of it, thankfully. \n\nLife is better without him in it. \n\nThree years from now, you might be enjoying a relationship with someone who wouldn't dream of putting you through this. I am sorry for what you're going through.",
      "created_utc": 1736819803.0,
      "score": 1
    },
    {
      "id": "m71blcu",
      "body": "Before you start the presentation deflate a tire on each of their cars so they can’t make a quick exit… cancel his credit cards day of too… sounds petty AF, but hey, they wanted to play in the mud…",
      "created_utc": 1736823413.0,
      "score": 1
    },
    {
      "id": "m71iaf7",
      "body": "Damn that is some Jerry Springer shit\n\n\nI have to say I did read every word because I think my response would be the same anyway. These people are destructive, self destructive, and I don't know what kind of person you are but it is not hard for me to do what I think you need to-take all that exhaustion and get rid of it by shutting yourself off. Do expose them but don't put too much work into it, I'm sure there will be a handful of major key points for proof there, search for them and turn this into a paragraph.\n\n\nReclaim your dignity with a plain face, give them no reaction, absolutely no chance to respond or debate. Here guys just so you know, this is why I'm out. Nobody does that on reality TV and that's why people love to watch the reaction more than really dwell on the situation(even thought they're often stupid). \n\n\nDon't deny yourself grief, but don't open a single window for those people. Clearly they weren't doing much for you anyway, dont let them do a thing now. People who treat you this way will do it no matter what. Eventually the shell shock will leave you and when you dwell on this again, try to think of it this way-they did the work for you. Nothing is in a gray area now, you have a name, time and place for their toxicity. Distance yourself as much as possible. ",
      "created_utc": 1736825720.0,
      "score": 1
    },
    {
      "id": "m71lm3u",
      "body": "I’m so sorry this has happened to you but you’re doing the right thing! Please do an update once you’ve exposed them to everyone",
      "created_utc": 1736826933.0,
      "score": 1
    },
    {
      "id": "m71soqu",
      "body": "Well done you and never doubt your strength 💪 you will be an awesome mum of two. Honestly you don't need two nasty adults like your fiance and sister.  \n\nWhen you burn it all. Be glad. Dont shout or answer anything the written words will say it all.\n\nAnd tell your family you would rather be single than live with humiliation. \n\nYou choose but don't let stress cause you to abort.  \nI have a good feeling about you\n.Well done protecting your Well being",
      "created_utc": 1736829730.0,
      "score": 1
    },
    {
      "id": "m71ziau",
      "body": "Good for you OP. I am checking in here from \"tomorrow\" and hoping it went as well as it could have, and that you are safe and have a lot of support around you",
      "created_utc": 1736832860.0,
      "score": 1
    },
    {
      "id": "m722jzo",
      "body": "Can someone please let me kmownwhen she updates us",
      "created_utc": 1736834399.0,
      "score": 1
    },
    {
      "id": "m729vsy",
      "body": "I need an update",
      "created_utc": 1736838488.0,
      "score": 1
    },
    {
      "id": "m72aqn7",
      "body": "Please update 🙏",
      "created_utc": 1736838999.0,
      "score": 1
    },
    {
      "id": "m72p4id",
      "body": "We want the update!",
      "created_utc": 1736848309.0,
      "score": 1
    },
    {
      "id": "m72x1i5",
      "body": "wtf. Assholes",
      "created_utc": 1736853231.0,
      "score": 1
    },
    {
      "id": "m738o5x",
      "body": "Firstly, I’m so sorry this is happening to you. What awful, awful people they are. One question you need to ask yourself is Why protect anyone? You don’t owe these people anything. They’ve done nothing but hurt and betray you. Go scorched earth on them.",
      "created_utc": 1736859060.0,
      "score": 1
    },
    {
      "id": "m73bi3y",
      "body": "Don’t let people walk over you like that. If you’re a reserved person, they should fucking afraid. I can’t imagine the type of anger you’re holding in you right now. Show them the consequences of fucking around with you, be their karma. \n\nLetting people walk over you like that just for them to enjoy seeing you take the fall is not something that should be taken lightly, emotionally and mentally. Personally, it feels like shit, WILL make you feel like shit. That’s if you don’t speak and defend yourself. \n\nGreat job on taking the steps to firmly ground yourself in front of your whole family. I hope you find a way to get through this chaos and heal properly.",
      "created_utc": 1736860246.0,
      "score": 1
    },
    {
      "id": "m73dssp",
      "body": "Just tell them you got an abortion and raise the baby yourself. They obviously don’t care about the baby.",
      "created_utc": 1736861160.0,
      "score": 1
    },
    {
      "id": "m73hlgi",
      "body": "JERRY! JERRY! JERRY! JERRY!",
      "created_utc": 1736862606.0,
      "score": 1
    },
    {
      "id": "m73nq2v",
      "body": "Do it. It needs to be brought to light. Let the 2 pieces of shit feel embarrassed and see how the others react. Anyone who doesn't have your back , cut them out of your and your children's lives.",
      "created_utc": 1736864840.0,
      "score": 1
    },
    {
      "id": "m73u10n",
      "body": "I hope it’s early enough that you can get an abortion.",
      "created_utc": 1736866972.0,
      "score": 1
    },
    {
      "id": "m73zpdr",
      "body": "Op, any updates?",
      "created_utc": 1736868774.0,
      "score": 1
    },
    {
      "id": "m74d59z",
      "body": "I wanna see screenshots OP!",
      "created_utc": 1736872837.0,
      "score": 1
    },
    {
      "id": "m74ml9g",
      "body": "Burn it all down all or they’ll just keep gaslighting you while playing in your face! \nGoodluck Op.",
      "created_utc": 1736875603.0,
      "score": 1
    },
    {
      "id": "m74wz74",
      "body": "I look forward to the update. Good luck! Burn it all down girl 🫂",
      "created_utc": 1736878596.0,
      "score": 1
    },
    {
      "id": "m74yywy",
      "body": "… yeah I’d go to jail, fuck it - I’d do time… what a piece of shit - he is going to have such bad karma just you wait - if not in his current life, his next one, I hope all of his partners cheat on him. I am literally cursing him. I’ll do a witch ritual - I’d love to see this man die idc if punishment fits the crime I hate it here",
      "created_utc": 1736879165.0,
      "score": 1
    },
    {
      "id": "m755uss",
      "body": "Please let me know how did it go! You did the right thing!",
      "created_utc": 1736881144.0,
      "score": 1
    },
    {
      "id": "m79cf0v",
      "body": "I hate you’re going through this, but I’m so glad you plan on showing everyone what they’re doing. Just know you have support here!!",
      "created_utc": 1736942634.0,
      "score": 1
    },
    {
      "id": "m7dq67f",
      "body": "Hell yeah. Scorched earth. Update us with the tea please 🙏",
      "created_utc": 1736992631.0,
      "score": 1
    },
    {
      "id": "m7gpiak",
      "body": "We need an update",
      "created_utc": 1737041552.0,
      "score": 1
    },
    {
      "id": "m7hjxbx",
      "body": "Your sister is evil, what processed her to go behind you and sleep with a man that she knows you're pregnant by. Trust you are better off without either one of them. Good luck with raising your children. I raised mines by myself, it wasn't easy but it was well worth it. Drop that zero and watch your stress level drop. Good Luck and God bless YOU ",
      "created_utc": 1737050353.0,
      "score": 1
    },
    {
      "id": "mb4pjpe",
      "body": "I'm sorry that you are going through this \n\n\nI wish I could help....",
      "created_utc": 1738773664.0,
      "score": 1
    },
    {
      "id": "mb8ujy8",
      "body": "Why would you even having that loser's offspring?? 😢🤔",
      "created_utc": 1738819305.0,
      "score": 1
    },
    {
      "id": "mdiz999",
      "body": "Damn I’m recently divorced multimillionaire 32 one daughter send me a text we should go out 9097373506",
      "created_utc": 1739923998.0,
      "score": 1
    },
    {
      "id": "menv490",
      "body": "Let's get back at him and hook up my snap is Cripperd60",
      "created_utc": 1740465890.0,
      "score": 1
    },
    {
      "id": "mq90eqf",
      "body": "I guess it is too late know but why not terminating this pregnancy? Or putting the baby up for adoption. Already he is not financially contributing and he is emotionally abusing you.",
      "created_utc": 1746213853.0,
      "score": 1
    },
    {
      "id": "m6vnybd",
      "body": "Putting it on display for your family is cringey and deranged.",
      "created_utc": 1736747351.0,
      "score": -2
    },
    {
      "id": "m6vr1o4",
      "body": "....",
      "created_utc": 1736748993.0,
      "score": 0
    },
    {
      "id": "m75o52h",
      "body": "I would suggest you let be baby be adopted. It would hurt you to see the baby. It would be a constant reminder of him. You really don't want any ties with this disgusting excuse for a man.\n\nYou also don't want to depend on your family as God knows how this will go. There are so many families that fans have children. I would suggest reaching out and finding a family that will cover costs while you are pregnant. \n\nI wish you luck OP.",
      "created_utc": 1736886460.0,
      "score": 0
    },
    {
      "id": "m7i6zav",
      "body": "First problem was getting into a relationship with a one year old, therefore not putting your child's needs first.\n\n2nd problem is still spending your energy on him.",
      "created_utc": 1737056980.0,
      "score": 0
    },
    {
      "id": "m6wf2n3",
      "body": "Just end 5he relationship. Going out of your way to drag your family into the drama is going to do nothing for you but make other people hate you.",
      "created_utc": 1736764083.0,
      "score": -2
    },
    {
      "id": "m6vnk4e",
      "body": "You can make any choice you like regarding the pregnancy but before you have a huge announcement please consider this:\n\n- you will be single parenting again and all that entails,  but with a four year old too\n\n- the father may decide to be with your sister and she will become the stepmother to your new baby.  She may go out of her way to make this happen because she enjoys hurting you - this means the child is a weapon\n\n- money,  support, stability for your first child needs to come before any potential future child\n\nEditing to add - my comments were really about her welfare around the child she currently has. She absolutely should not stay with this guy,  and I would advise an abortion due to the above.  But that's her choice,  and we've all given advice.  \n\nI wish you all the best with your choices. My daughter was born when I was 21, I raised her as a single parent after a similar situation.  She's 21 herself this year,  and it's the same advice I would give to her x\n\nSecond edit: the update sounds like this story is fake, sigh. Nevertheless, the advice is real so I'll leave my comments for anyone else in this type of situation.",
      "created_utc": 1736747149.0,
      "score": 1138
    },
    {
      "id": "m6w8tfk",
      "body": "I single parented a teen and a newborn, went to grad school full time and worked 3/4 time. If I can do it so can you. Believe in yourself and you'll be fine. Best wishes.",
      "created_utc": 1736759975.0,
      "score": -157
    },
    {
      "id": "m6vkicc",
      "body": "The last slide should be a Q&A. We are professionals after all. \n\nLet’s crowdsource this PowerPoint.",
      "created_utc": 1736745638.0,
      "score": 536
    },
    {
      "id": "m6vmatp",
      "body": "May I also suggest sharing a link to the document (with reading rights only) in case it gets shut down before you finish. That way everyone can peruse the presentation at their leisure.",
      "created_utc": 1736746520.0,
      "score": 170
    },
    {
      "id": "m6veiph",
      "body": "I wanted to say this!!!  Make a PowerPoint, include the screenshots from his phone, and all other photos you have.  Include the messages from your sister taunting you... put it all in front of them in black and white, so they can't say you made it up.  You can turn a PowerPoint into a movie and add music... do this, and once you he shown family.. add the video to your social media and family group chats and make sure that his family see it too, email it to them if you have to....",
      "created_utc": 1736742916.0,
      "score": 132
    },
    {
      "id": "m6vt1wh",
      "body": "I second the PowerPoint presentation (it reminds me of the recent Reddit story where the guy used one as a \"joke\", only for the OP to dump him with one of her own).",
      "created_utc": 1736750105.0,
      "score": 27
    },
    {
      "id": "m6wirh0",
      "body": "I'd go Cruel Intentions on them. Make sure everyone at the get-together gets sent everything right before they arrive.   \nSo when they finally arrive OP can enjoy all the looks towards her fiancè and sister. \n\nCome to think of it, might be hard to pull off in these modern times. Yeah, go for the powerpoint presentation!",
      "created_utc": 1736766379.0,
      "score": 26
    },
    {
      "id": "m6vkv8c",
      "body": "This is what I was thinking. PowerPoint all the way with all there messages.",
      "created_utc": 1736745812.0,
      "score": 20
    },
    {
      "id": "m6wjxht",
      "body": "Yassss! My thoughts exactly and put a nice little background music on the slides. 🤌🏽 and OP, you got this! I know the hormones are 1000% adding on but stay strong and stand your ground.",
      "created_utc": 1736767065.0,
      "score": 5
    },
    {
      "id": "m6zhnbp",
      "body": "THIS!!!!! Do it!!!!!!",
      "created_utc": 1736802395.0,
      "score": 3
    },
    {
      "id": "m73ev4l",
      "body": "I would make the PowerPoint and send it to everyone in a group text 🤣",
      "created_utc": 1736861571.0,
      "score": 1
    },
    {
      "id": "m6vfdqo",
      "body": "i suggest screen recording the messages so they don’t suggest you edited anything!",
      "created_utc": 1736743289.0,
      "score": 265
    },
    {
      "id": "m6v95je",
      "body": "Nah, start with exposing the proof. Then comment.",
      "created_utc": 1736740776.0,
      "score": 137
    },
    {
      "id": "m6v97qm",
      "body": "Omg I love this 😂",
      "created_utc": 1736740799.0,
      "score": 23
    },
    {
      "id": "m6vafv5",
      "body": "Yes OP we will need an update 🙏🙏🙏",
      "created_utc": 1736741257.0,
      "score": 82
    },
    {
      "id": "m6ve6j9",
      "body": "I think air-dropping the screenshots is actually brilliant if everyone’s phones are enabled that way. Either that or a projector. Something that will be captivating enough that sister or fiancé can’t just easily distract from it. I’m so sorry, OP. But I understand the feeling and want to help you really get vindication.",
      "created_utc": 1736742774.0,
      "score": 66
    },
    {
      "id": "m6w0ptg",
      "body": "This needs to be higher up in the comments. OP should not desire any kind of tie with either the abusive boy or the sister. If this is the type of family I think it is, then no contact might be the best option if the reactions are consistent with the sister’s. \n\nIt’s terrible to assume the worst but in the end OP needs to look out for the safety of themselves and their 4yo.",
      "created_utc": 1736754674.0,
      "score": 118
    },
    {
      "id": "m6vimbp",
      "body": "Yes it’s still early",
      "created_utc": 1736744741.0,
      "score": 74
    },
    {
      "id": "m6vpnfh",
      "body": "Agreed!",
      "created_utc": 1736748237.0,
      "score": 36
    },
    {
      "id": "m6wh4ba",
      "body": "Agreed. I don’t want to impose my views on OP but I hope she thinks about this.",
      "created_utc": 1736765384.0,
      "score": 46
    },
    {
      "id": "m6wk0kp",
      "body": "My exact thoughts",
      "created_utc": 1736767115.0,
      "score": 14
    },
    {
      "id": "m6wua9p",
      "body": "I agree.",
      "created_utc": 1736772370.0,
      "score": 10
    },
    {
      "id": "m6x2nnt",
      "body": "100%.",
      "created_utc": 1736775873.0,
      "score": 10
    },
    {
      "id": "m6val00",
      "body": "This op. Don't carry the pregnancy. Don't tie yourself to someone like that. Cut all of this off & go no contact with both of them & anyone who tries to mediate.",
      "created_utc": 1736741310.0,
      "score": 191
    },
    {
      "id": "m6v8n6j",
      "body": "Yeah, neither OP nor her daughter deserve to be chained with this guy forever",
      "created_utc": 1736740580.0,
      "score": 100
    },
    {
      "id": "m74zi9s",
      "body": "I want this man’s name",
      "created_utc": 1736879320.0,
      "score": 1
    },
    {
      "id": "m6vkthn",
      "body": "100%.  This is the way.\n\nOP should focus all her love on the child she already has, not risk her health and financial stability giving the gift of fatherhood to a cheating scumbag.",
      "created_utc": 1736745789.0,
      "score": 55
    },
    {
      "id": "m6vrdb5",
      "body": "It’s so sad because she didn’t do anything wrong, it’s her fiancé and sister causing her life to be a trainwreck. 😔",
      "created_utc": 1736749172.0,
      "score": 43
    },
    {
      "id": "m73ex6e",
      "body": "Luv it! This is giving: creativity, cunningness, proactiveness (so you won’t be gaslit), courage.",
      "created_utc": 1736861593.0,
      "score": 1
    },
    {
      "id": "m743eot",
      "body": "I read stuff like this on here ALL the time and it just solidifies my child free choice.\n\nWishing OP the juiciest update, complete with family members taking her side & supporting her.",
      "created_utc": 1736869910.0,
      "score": 1
    },
    {
      "id": "m744a47",
      "body": "All of that except don’t have the baby",
      "created_utc": 1736870172.0,
      "score": 1
    },
    {
      "id": "m6v43ms",
      "body": "What you don't think OP's older sis would make a great step-mom? /s",
      "created_utc": 1736738877.0,
      "score": 61
    },
    {
      "id": "m6vde4i",
      "body": "My immediate first thought! No way in hell I’d want to bring a child into this world with a father and aunt like that.",
      "created_utc": 1736742438.0,
      "score": 32
    },
    {
      "id": "m750onm",
      "body": "!!!!",
      "created_utc": 1736879660.0,
      "score": 1
    },
    {
      "id": "m6vkjum",
      "body": "*reaction*",
      "created_utc": 1736745658.0,
      "score": 2
    },
    {
      "id": "m751tz5",
      "body": "This!!!!!",
      "created_utc": 1736879995.0,
      "score": 1
    },
    {
      "id": "m6za1qw",
      "body": "They are not married",
      "created_utc": 1736800185.0,
      "score": 1
    },
    {
      "id": "m717wph",
      "body": "Also, this is if you don’t choose abortion. If you do choose abortion, 1 child is way easier to manage than 2/3. So your options are there love. It’s yours to make. Don’t let ppl pressure you or guilt you. Like you said, you’re sick of having no self respect. Time to love yourself. Dump his ass and focus on you.",
      "created_utc": 1736822226.0,
      "score": 2
    },
    {
      "id": "m78pqwy",
      "body": "There is an update.  She made a separate post but I don’t know how to link it.  Basically read their messages to family, they denied, yelled and stormed off.  He’s now an ex and she is considering her next steps.",
      "created_utc": 1736928586.0,
      "score": 3
    },
    {
      "id": "m76f8y0",
      "body": "Update time!",
      "created_utc": 1736895039.0,
      "score": 1
    },
    {
      "id": "m6wl4cv",
      "body": "And to add think about abortion. These are the exact situations why this option is there.",
      "created_utc": 1736767750.0,
      "score": 504
    },
    {
      "id": "m6wp81o",
      "body": "No matter what, OP is going to wind up as a single mom.  \nWhy should she put up with her BF anymore?   \n \nWhether he hooks up with her sister or not, he’s never going to change.",
      "created_utc": 1736769963.0,
      "score": 83
    },
    {
      "id": "m7hkc63",
      "body": "She doesn't have that to worry about he doesn't want the baby or her. Drop his sorry Azz",
      "created_utc": 1737050469.0,
      "score": 1
    },
    {
      "id": "m6y87ir",
      "body": "I truly hate your comment- this is a situation HE put her in and your sentiment came off that the onus is on her to act accordingly. The advice she needs is for her to rake his ass over the coals, whether she keeps the child or not, but either way, to end this romantic relationship and to cut off her toxic sister - she cannot control what either of them do after that, but she should collect all of this evidence and use it for child support if she does indeed keep the baby. Your comment is just a long list of bull shit straight out of a 1950’s unwed mother’s pamphlet that an elderly woman would hand to her at a church.",
      "created_utc": 1736789219.0,
      "score": -52
    },
    {
      "id": "m72qkd9",
      "body": "Why should a poor baby suffer because of her parents? Sort out the shit between you two but please keep the innocent baby out of it!?",
      "created_utc": 1736849247.0,
      "score": -7
    },
    {
      "id": "m71ep09",
      "body": "\"If I can do it so can you\" is the biggest bullshit on the planet. You have no idea what another person can and cannot handle.",
      "created_utc": 1736824447.0,
      "score": 68
    },
    {
      "id": "m6xay8n",
      "body": "When was that? 30 years ago? \n\nTimes are different.  There is no such thing as an apartment for $250 a month and teenagers babysitting for $20 for 8 hours.",
      "created_utc": 1736778951.0,
      "score": 109
    },
    {
      "id": "m71t3hc",
      "body": "Would you like a cookie? \n\nPlease sit down and mind your own.",
      "created_utc": 1736829908.0,
      "score": 22
    },
    {
      "id": "m6wkxd0",
      "body": "Well done you!",
      "created_utc": 1736767639.0,
      "score": 12
    },
    {
      "id": "m6zwsje",
      "body": "Omg I love this. Good for you OP. You don’t need people like this in your life. Expose these cruel people. Then do your best to pick up the pieces and move on. \n\nWill you please consider posting an update afterward?",
      "created_utc": 1736806853.0,
      "score": 40
    },
    {
      "id": "m6vq2i9",
      "body": "Or make a photo copy of it all and give each person a copy.",
      "created_utc": 1736748458.0,
      "score": 88
    },
    {
      "id": "m6vtpjj",
      "body": "Let’s be efficient while we burn it all down.\n\nQR code for the modern crowd, maybe print and fancy frame a few copies.\n\nFor the gray hairs, summarize the situation like it’s facebook.",
      "created_utc": 1736750475.0,
      "score": 98
    },
    {
      "id": "m6wsgow",
      "body": "Yesss this",
      "created_utc": 1736771525.0,
      "score": 8
    },
    {
      "id": "m6zpef8",
      "body": "Cast it to the TV and make sure you remove the batteries from the remote so it plays on a loop with nothing they can do about it.",
      "created_utc": 1736804647.0,
      "score": 22
    },
    {
      "id": "m6zvpdk",
      "body": "Love that story 😂",
      "created_utc": 1736806522.0,
      "score": 3
    },
    {
      "id": "m7215ty",
      "body": "Tbh if it got sent beforehand , we can’t ensure they will still be here to witness.\n\nRather let them in and ignite the truth bomb",
      "created_utc": 1736833684.0,
      "score": 7
    },
    {
      "id": "m6x4ggv",
      "body": "OP This!!!!!",
      "created_utc": 1736776563.0,
      "score": 11
    },
    {
      "id": "m6vltmu",
      "body": "\"This was supposed to be a celebration for my announcing my pregnancy, but it is now a celebration of truth, and I have brought proof.\" Hand out multiple copies of screen shots and texts neatly stapled. That way, everyone can have a copy.",
      "created_utc": 1736746279.0,
      "score": 132
    },
    {
      "id": "m6vdaly",
      "body": "Set up a camera for the family gathering and webcast it for us!",
      "created_utc": 1736742397.0,
      "score": 49
    },
    {
      "id": "m6vl00w",
      "body": "Airdrop and cast to the tv for those without apple or who like to see tea as a group, just to be safe.",
      "created_utc": 1736745876.0,
      "score": 20
    },
    {
      "id": "m74zlrl",
      "body": "publicly humiliate him even more",
      "created_utc": 1736879348.0,
      "score": 1
    },
    {
      "id": "m6vrs3a",
      "body": "I know. It will suck terminating, but it will be the best option over all. His will make her life a nightmare. And her sister will expect to play “mommy” to her niece\n\nSadly, nothing good will come from this pregnancy. And I know many will disagree with me in that. But that child will always remind her of her fiancé’s and sister’s betrayal. \n\nIt will be easier to walk away from him and her sister without a newborn\n\nThe cons outweigh the pros",
      "created_utc": 1736749403.0,
      "score": 63
    },
    {
      "id": "m7525t2",
      "body": "I want this man and his sister to be so publicly exposed and humiliated - the whole fucking world, like go viral - fucking pieces of shits - I hope they can never sleep in peace",
      "created_utc": 1736880090.0,
      "score": 1
    },
    {
      "id": "m6zn3nv",
      "body": "Child support then.",
      "created_utc": 1736803976.0,
      "score": 1
    },
    {
      "id": "m6wuf2l",
      "body": "I was alluding to that in my comment but perhaps wasn't clear enough.  I would have an abortion and advise my daughter the same.  But I was leaving it open for OP to come to that conclusion herself. \n\nHaving raised a child to adulthood.... there's no way on earth I would be continuing the pregnany under OPs circumstances.  It's cruel to bring another life into this context,  despite how hard that choice may be.  There is time in the future for her to find someone kind and supportive with which to create that family she craves. Until then,  protecting and providing for the one she has is her only job.",
      "created_utc": 1736772432.0,
      "score": 275
    },
    {
      "id": "m7hkpbf",
      "body": "You don't take a life because life gets a little harder. There are places and people willing to help her, she just has to reach out",
      "created_utc": 1737050575.0,
      "score": -1
    },
    {
      "id": "m6wunus",
      "body": "Abortion? If OP is in the US some states have the death penalty for abortion...please be considerate in regards to where OP may be from.",
      "created_utc": 1736772542.0,
      "score": -66
    },
    {
      "id": "m756c3x",
      "body": "Killing your child is not an option and the fact you consider it one speaks volumes about your moral compass.",
      "created_utc": 1736881281.0,
      "score": -12
    },
    {
      "id": "m6wuyuq",
      "body": "It's about the current child's welfare, and the potential future child's welfare.  \n\nI just said this in another comment,  but maybe I wasn't clear enough.  I would advise OP to leave,  take her daughter,  have an abortion and have a happy healthier life with no ties to sister or ex.",
      "created_utc": 1736772678.0,
      "score": 78
    },
    {
      "id": "m71f509",
      "body": "Did you read my comment? Like actually read it? You seem intelligent so I'll let you re-read it.  I'm in no way recommending that she stay,  fuck him he's a POS. \n\nMy advice is what I'd give to my own daughter (21).  I'm 42F, Australian and liberal as fuck.  \n\nAs a mother, you DO have to act accordingly.  Your first priority is your child.  They are innocent, didn't ask to be born and need to have money,  time and resources so that they get to live a life where their well-being is the priority. \n\nI raised my child as a single mother because I left her father due to similar circumstances.  Leaving is the right thing to do.  \n\nI didn't explicitly say have an abortion - but having an abortion is the right thing to do for the sake of her current child and to save the potential future child she caring from living life as a weapon. \n\nWhere did you read,  in any of what I said,  backwards and outdated misogynist rhetoric?!!!! I'm stunned that this is how you read that.",
      "created_utc": 1736824602.0,
      "score": 28
    },
    {
      "id": "m72qr1j",
      "body": "That's the whole point.  To avoid the suffering of an innocent baby.",
      "created_utc": 1736849369.0,
      "score": 9
    },
    {
      "id": "m71t87q",
      "body": "In a fancy folder, the good kind from staples. 3-hole punched and tabbed by date.",
      "created_utc": 1736829965.0,
      "score": 13
    },
    {
      "id": "m80c5on",
      "body": "That is just downright diabolical. 🖤",
      "created_utc": 1737306433.0,
      "score": 1
    },
    {
      "id": "m73fb1w",
      "body": "Send it after everyone arrived and still put it on the tv",
      "created_utc": 1736861742.0,
      "score": 3
    },
    {
      "id": "m6vnh17",
      "body": "I did did this to my ex and friend of mine. They weee messing around my back and I sniffed it and started digging and found all those chats. \nAsked them in private they made it look like I’m insane and doubting. \nAfter 10days when they were planning a trip together by lying to me separately \nI gathered all the people who we know commonly and circulated the printed bundle of chats \nAnd then called them back saying the game is over you better be back before the family gets involved \nAnd it was the great show that I had put together",
      "created_utc": 1736747105.0,
      "score": 77
    },
    {
      "id": "m6vdfe3",
      "body": "Someone's gotta take over broadcasting the family throwdowns since Jerry's gone 💔\n\nHappy cake day! 🎂",
      "created_utc": 1736742453.0,
      "score": 28
    },
    {
      "id": "m6vhhqa",
      "body": "This is what I want. 🤣",
      "created_utc": 1736744223.0,
      "score": 6
    },
    {
      "id": "m6w92bz",
      "body": "Yes totally agree. Hopefully she isn’t super religious or something 😬",
      "created_utc": 1736760141.0,
      "score": 12
    },
    {
      "id": "m6x78u3",
      "body": "You put it very kindly.",
      "created_utc": 1736777609.0,
      "score": 54
    },
    {
      "id": "m756kpa",
      "body": "> I would have an abortion and advise my daughter the same.\n\nKilling your child is not an option and the fact you consider it one speaks volumes about your moral compass.",
      "created_utc": 1736881351.0,
      "score": -10
    },
    {
      "id": "m7i5qyi",
      "body": "It’s not about life being hard it’s about bringing a soul into chaos and instability.",
      "created_utc": 1737056623.0,
      "score": 2
    },
    {
      "id": "m6xaejj",
      "body": "No state in the US has the death penalty... yet.  In fact, states are slowly establishing a right to terminate a pregnancy in State Constitutions.",
      "created_utc": 1736778754.0,
      "score": 58
    },
    {
      "id": "m78sq8f",
      "body": "Get over yourself! It’s pointless to talk to you about the logics behind why abortion should be an option here. Never mind. 🙄",
      "created_utc": 1736930538.0,
      "score": 5
    },
    {
      "id": "m7dvtlg",
      "body": "You sound like those who scream about abortion but after these babies are born, do not care one whit about the welfare of these babies at all.\nHave you prevented any abortions? And if so, I assume you adopted them all and are raising them?",
      "created_utc": 1736994608.0,
      "score": 1
    },
    {
      "id": "m76eyrb",
      "body": "Death is the worst way you could make the baby suffer though. How would you like someone taking your life away",
      "created_utc": 1736894949.0,
      "score": -5
    },
    {
      "id": "m6wfgub",
      "body": "Omg! I love this! That way, there is no gaslighting or back peddling. EPIC!!!",
      "created_utc": 1736764341.0,
      "score": 20
    },
    {
      "id": "m6w0402",
      "body": "Good for you! What happened once they were exposed?",
      "created_utc": 1736754301.0,
      "score": 7
    },
    {
      "id": "m6vdnj9",
      "body": "Thank you! \n\nProbably my last day on reddit too as I plan to take a sabbatical.",
      "created_utc": 1736742548.0,
      "score": 16
    },
    {
      "id": "m6xo743",
      "body": "I’m praying she lives somewhere where she can end it and that she’s not too far along. That child would be a constant reminder of what her ex and sister did to her",
      "created_utc": 1736783289.0,
      "score": 3
    },
    {
      "id": "m77rtey",
      "body": "I have an excellent moral compass.  Yours is skewed by false morality.  \n\nThe priority will *always* be protecting living,  breathing children with a consciousness. \n\nI'm sorry that you believe that a potential future child is more important than that.  I wish your parents had given you a better sense of morality, or that you'd taught yourself the same.  \n\nHowever,  we can agree to disagree on abortion. Just not that the child that already exists is more important than the potential future child she's carrying.",
      "created_utc": 1736911688.0,
      "score": 8
    },
    {
      "id": "m77sytq",
      "body": "Do you remember life before you were born? Is that an experience for you?\n\nBeing weaponised is a worse suffering. Life is suffering. \n\nI'd be happy not to be born.  I wouldn't know the difference. \n\nThere seems to be a distinct difference in perception of abortion with people who cannot understand (or try to understand) the difference between murdering someone who is alive and conscious and the removal of *potential* life before consciousness. \n\nIt's really bizarre to me that people don't even try to understand that.  I, at least,  try to understand how someone could believe that a child is being murdered by abortion (despite the facts) because it's based upon emotion and ideology.",
      "created_utc": 1736912126.0,
      "score": 5
    },
    {
      "id": "m6xk3b7",
      "body": "They tried to diffuse and still putting a show until they saw that circulating bundle of chats and when they read that is when they realized the severity of my inevitable anger",
      "created_utc": 1736782015.0,
      "score": 27
    },
    {
      "id": "m6xk5my",
      "body": "They still tried to put a show until they saw the circulating bundle of chats and that’s when they realized the severity of my inevitable anger !",
      "created_utc": 1736782035.0,
      "score": 7
    },
    {
      "id": "m6vhrgu",
      "body": "Good for you, it's needed every so often ☺️",
      "created_utc": 1736744345.0,
      "score": 13
    },
    {
      "id": "m6xlvcp",
      "body": "My hero! So well played!! Logic over emotions in that instance is commendable.",
      "created_utc": 1736782574.0,
      "score": 13
    }
  ]
}