{
  "id": "1e9la3w",
  "title": "I’m a girl but I wish I had a penis",
  "selftext": "\nI wish I had a dick so I could fuck my boyfriend, not even a joke like sometimes I look down and wish I had a dick so bad, I’m not sad with having a vagina or anything like it’s okay I guess, I’m fine being a woman, but having a dick would be awesome and I’d feel more like myself, I’m not trans I don’t want to transition or anything because I don’t want to be a guy I don’t want to be anything I just want to be a floating cock that fucks people, like sometimes I look at women and I want to fuck them with a dick but I’m fully straight and female\n\nI also like to imagine my boyfriend as a girl sometimes and I find it really hot she’d be so cute but in a straight way ",
  "created_utc": 1721672322.0,
  "score": 5018,
  "num_comments": 859,
  "url": "https://www.reddit.com/r/offmychest/comments/1e9la3w/im_a_girl_but_i_wish_i_had_a_penis/",
  "comments": [
    {
      "id": "lef92iz",
      "body": "this has me dying of laughter im so sorry 😭😭 “I just want to be a floating cock that fucks people”",
      "created_utc": 1721674244.0,
      "score": 4964
    },
    {
      "id": "lef8j89",
      "body": "GIRL i’m with you so bad, everyone says “get a strap get a strap” BUT IT’S NOT THE SAME! i need to FEEL it when i slide in, like i need to be attached to it!",
      "created_utc": 1721674075.0,
      "score": 2430
    },
    {
      "id": "lef7nm2",
      "body": "i wanna do the helicopter so bad...and see how head looks & feels like?! oh i wanna feel how horny men feel, how their bodies take in the information.",
      "created_utc": 1721673800.0,
      "score": 1044
    },
    {
      "id": "lef9pds",
      "body": "Same. About having a penis part. Just cause I want to use it and pee anywhere 😂.",
      "created_utc": 1721674444.0,
      "score": 251
    },
    {
      "id": "lef4idm",
      "body": "This is a whole new level of horny 😭",
      "created_utc": 1721672808.0,
      "score": 1093
    },
    {
      "id": "lef9nsx",
      "body": "“Sometimes I look at women and want to fuck them with a dick but I’m fully straight and female”….looks like you’ve got some self discovery to do lmao",
      "created_utc": 1721674431.0,
      "score": 2166
    },
    {
      "id": "lef60ht",
      "body": "Ahhh yes, penis envy.",
      "created_utc": 1721673283.0,
      "score": 573
    },
    {
      "id": "lefhmii",
      "body": ">I just want to be a floating cock that fucks people,\n\nMa'am ...😭☠️",
      "created_utc": 1721676997.0,
      "score": 170
    },
    {
      "id": "lefi17j",
      "body": "The constant variations of “no homo tho” is fucking hilarious",
      "created_utc": 1721677126.0,
      "score": 105
    },
    {
      "id": "lef5tgo",
      "body": "I wish I didn’t relate to this but I do lmao",
      "created_utc": 1721673220.0,
      "score": 311
    },
    {
      "id": "lefa4ao",
      "body": "I'm a guy and I wish I had a vagina. Let's trade",
      "created_utc": 1721674575.0,
      "score": 180
    },
    {
      "id": "lefbfzk",
      "body": "being a woman with penis envy is a struggle I never thought I would find other women struggling with. I do not want to be a man nor have I ever, but, switching it up would be lit",
      "created_utc": 1721675003.0,
      "score": 232
    },
    {
      "id": "lef9tdj",
      "body": "Im a guy but can relate to this by wishing I could experience what it’s like to have a vagina and not a penis.  Like experiencing what it’s like to be penetrated and everything women go through.",
      "created_utc": 1721674480.0,
      "score": 72
    },
    {
      "id": "lefn9zp",
      "body": "you really said NO HOMO",
      "created_utc": 1721678786.0,
      "score": 72
    },
    {
      "id": "lefdn4n",
      "body": "You have no idea how many women dream of it...",
      "created_utc": 1721675711.0,
      "score": 64
    },
    {
      "id": "lef8x6b",
      "body": "I'm a dude and I wish I could just fuck people but we can all dream",
      "created_utc": 1721674198.0,
      "score": 177
    },
    {
      "id": "lefhjqc",
      "body": "“Sometimes I look at women and I want to fuck them with a dick but I’m fully straight” hmmm that sounds PRETTY GAY.",
      "created_utc": 1721676972.0,
      "score": 106
    },
    {
      "id": "lef61qc",
      "body": "lowkey same 💀",
      "created_utc": 1721673294.0,
      "score": 52
    },
    {
      "id": "lefa5pp",
      "body": "Relatable but I’m bi",
      "created_utc": 1721674588.0,
      "score": 56
    },
    {
      "id": "lefbq2i",
      "body": "Freud is dancing in his grave right now.",
      "created_utc": 1721675093.0,
      "score": 71
    },
    {
      "id": "lefqdli",
      "body": "Dude, the fact that I will never experience what a boner feels like really bums me out lol",
      "created_utc": 1721679747.0,
      "score": 65
    },
    {
      "id": "lefdjrz",
      "body": "I know using a strap isn’t the exact same thing, but if you use a BumpHer along with the strap it’ll make your experience better.",
      "created_utc": 1721675681.0,
      "score": 31
    },
    {
      "id": "leff0hn",
      "body": "Floating around making peoples day lol",
      "created_utc": 1721676151.0,
      "score": 26
    },
    {
      "id": "lefhcmr",
      "body": "Most normal confession in this sub",
      "created_utc": 1721676908.0,
      "score": 26
    },
    {
      "id": "lefmbj7",
      "body": "I’m a boy and I wish I had vagina!\nNo I’m not trans and I don’t want a transition either. I’d like to be a girl for a day and fuck with guys, but I’m mostly straight!\nThe only difference is I’d like to try the opppsite gender. Though I’m proud male. I just wanted to feel something inside😭 (this is not a joke). I feel ya friend!",
      "created_utc": 1721678482.0,
      "score": 25
    },
    {
      "id": "lefwwi7",
      "body": "You keep saying you're straight, but nothing about this is straight.",
      "created_utc": 1721681801.0,
      "score": 23
    },
    {
      "id": "lefeew9",
      "body": "Pegging is hot",
      "created_utc": 1721675958.0,
      "score": 20
    },
    {
      "id": "lefjs1u",
      "body": "babe I have something to tell you",
      "created_utc": 1721677681.0,
      "score": 41
    },
    {
      "id": "lef4ag7",
      "body": "Get yourself a strap-on and have at it?",
      "created_utc": 1721672739.0,
      "score": 96
    },
    {
      "id": "leg9fje",
      "body": "This is me and I am she.",
      "created_utc": 1721685988.0,
      "score": 17
    },
    {
      "id": "lef7ia4",
      "body": "you're 100% not straight lmao",
      "created_utc": 1721673754.0,
      "score": 101
    },
    {
      "id": "lefftw0",
      "body": "They do hold a special appeal! I’d do the helicopter dance after a shower, mushroom my fiancé’s forehead, pee outdoors, and play with it until I get arrested and convicted of being a criminally insane deviant! \n\nYeah, it’s probably best that I don’t have one!",
      "created_utc": 1721676415.0,
      "score": 13
    },
    {
      "id": "lefhz3a",
      "body": "I’ve been on Reddit for too long today",
      "created_utc": 1721677108.0,
      "score": 14
    },
    {
      "id": "leff9wu",
      "body": "Girl get a strap on!",
      "created_utc": 1721676236.0,
      "score": 12
    },
    {
      "id": "lefs21y",
      "body": "You know, as a woman and vagina owner, I sometimes think about this, too. It's penis-envy mostly because I wish I could pee standing too, especially when faced with gross bathrooms. But I do admit it'd be so cool to have a penis that I could fuck people with. You know, one that I could screw and unscrew whenever I want... pun intended(?) Lol",
      "created_utc": 1721680277.0,
      "score": 14
    },
    {
      "id": "lef9gvf",
      "body": "Good old fashioned penis envy",
      "created_utc": 1721674370.0,
      "score": 26
    },
    {
      "id": "lefmlgi",
      "body": "I wish this often! Like you don’t have to find your spot to orgasm and I want all that goes with it.",
      "created_utc": 1721678569.0,
      "score": 10
    },
    {
      "id": "lefz9t3",
      "body": "I’m a cis woman secure in my gender, and I also wish I had a penis so I could feel my girlfriend from the inside.\n\nAlso, I used to imagine men as women and wished I could penetrate them. I am also a lesbian now. 😂 Just something you may want to mull over.",
      "created_utc": 1721682560.0,
      "score": 11
    },
    {
      "id": "lef5rhs",
      "body": "Lmaoo listen to the others",
      "created_utc": 1721673203.0,
      "score": 10
    },
    {
      "id": "lefhol7",
      "body": "I just woke up my baby screaming 😂😂😂🤣🤣🤣🤣😂😂🤣😂😂OP …I’ll send up a prayer that one day that will happen for you 🙏",
      "created_utc": 1721677015.0,
      "score": 9
    },
    {
      "id": "lefqb97",
      "body": "Find someone who is willing to give up his penis and have it surgically attached to your vagina",
      "created_utc": 1721679727.0,
      "score": 9
    },
    {
      "id": "lefqlak",
      "body": "i promise everyone here to look at ops other posts genuinely so funny",
      "created_utc": 1721679815.0,
      "score": 8
    },
    {
      "id": "leg4mhr",
      "body": "I've been here. Now I'm non binary and bisexual lmao",
      "created_utc": 1721684340.0,
      "score": 10
    },
    {
      "id": "lefel5z",
      "body": "Put ur boyfriend in Amazon style position and thrust away, it's the closest you're gonna get.",
      "created_utc": 1721676013.0,
      "score": 8
    },
    {
      "id": "lefmepp",
      "body": "I'm bi and I feel the same way",
      "created_utc": 1721678510.0,
      "score": 8
    },
    {
      "id": "lefsos5",
      "body": "I was gonna a leave my comment at \"Penis envy is normal\" \n\n\nBut after a full read,\n\nWow. To fuck him as a woman made me laugh. It's honestly not an unhealthy thought. Most people have thought of gender or role swaps before while others like to play to supposition of \"what if you woke up tomorrow with a....\" \n\n\nSo its far from.farfetched. Reading it out definitely gave it impact and depth tho. It's not an uncommon thought. Weird to some I'd guess but more common thank you think. \n\nThanks for sharing and the laugh",
      "created_utc": 1721680477.0,
      "score": 8
    },
    {
      "id": "lehc9q3",
      "body": "I deeply relate to this. I just want to know what it feels like to stick a dick in someone/something.",
      "created_utc": 1721700502.0,
      "score": 8
    },
    {
      "id": "lef52ay",
      "body": "Get a strap and live your dreams, hon 🥲",
      "created_utc": 1721672983.0,
      "score": 25
    },
    {
      "id": "lefbawy",
      "body": "Dildo? Strap on?",
      "created_utc": 1721674958.0,
      "score": 7
    },
    {
      "id": "lefyqdu",
      "body": "I RELATE SO HARD I wish my boyfriend and I could just swap sexes for a bit so I could fuck him fr!! I get and feel this so hard, its so sad we cant stick our girl dicks in things 😭",
      "created_utc": 1721682386.0,
      "score": 6
    },
    {
      "id": "legcjr3",
      "body": " Listen, if you did have a dick , after 5 minutes ......you would be wishing for a bigger one. \n\nThat's how it works.",
      "created_utc": 1721687099.0,
      "score": 8
    },
    {
      "id": "lefhmni",
      "body": "Ok, please listen. People who are fully straight and female never, ever look at women and want to fuck them with a dick. Never. These are the thoughts and desires of a queer person. There might be not be a more specific term for how you feel, but queer covers everything not heteronormative.",
      "created_utc": 1721676998.0,
      "score": 57
    },
    {
      "id": "lef84c8",
      "body": "😂 same",
      "created_utc": 1721673946.0,
      "score": 7
    },
    {
      "id": "lefedqz",
      "body": "I’m similar but the opposite",
      "created_utc": 1721675947.0,
      "score": 5
    },
    {
      "id": "lefhxy5",
      "body": "girl… i get you.",
      "created_utc": 1721677098.0,
      "score": 7
    },
    {
      "id": "lefjjgk",
      "body": "Uh..this is actually funny 😭",
      "created_utc": 1721677604.0,
      "score": 6
    },
    {
      "id": "leg05cc",
      "body": "Hey nothing wrong with your floating penis fantasy fetish!",
      "created_utc": 1721682845.0,
      "score": 5
    },
    {
      "id": "leg1vxb",
      "body": "this is so funny but honestly i understand",
      "created_utc": 1721683417.0,
      "score": 6
    },
    {
      "id": "leg3fhw",
      "body": "Girl, SAME",
      "created_utc": 1721683937.0,
      "score": 6
    },
    {
      "id": "legs08s",
      "body": "girl same. sometimes you just want to have a shlong. i would stack donuts on mine if i had one",
      "created_utc": 1721692744.0,
      "score": 6
    },
    {
      "id": "lehb7e5",
      "body": "This is a cannon event",
      "created_utc": 1721700077.0,
      "score": 6
    },
    {
      "id": "lefc4m7",
      "body": "\"Fully straight\"",
      "created_utc": 1721675223.0,
      "score": 21
    },
    {
      "id": "lefdeec",
      "body": "Get a strap. Suggest pegging your boyfriend. If he refuses try on a woman. Life’s too short. I managed to convince myself I wasn’t a lesbian when I was a teenager (despite the nudity and kissing at “sleepovers”).  \nDidn’t come back out the closet until I was early thirties. So much time wasted.",
      "created_utc": 1721675633.0,
      "score": 10
    },
    {
      "id": "lefpkwp",
      "body": "Brother if you’re looking at other women and want to fuck them with a penis I don’t think you’re straight",
      "created_utc": 1721679503.0,
      "score": 15
    },
    {
      "id": "lefsfla",
      "body": "Skill issue.",
      "created_utc": 1721680396.0,
      "score": 13
    },
    {
      "id": "lef7k3k",
      "body": "Why? You want blowjob? That’ll be tree-fitty",
      "created_utc": 1721673769.0,
      "score": 10
    },
    {
      "id": "lefj1t4",
      "body": "No I get it I love being a woman so much I just hate that I can never experience something like that or do the helicopter like guys just have it better in that sense",
      "created_utc": 1721677449.0,
      "score": 4
    },
    {
      "id": "lefjox2",
      "body": "Honestly Same. I wanna know how it feels to slip between a pair of big saggy boobs",
      "created_utc": 1721677653.0,
      "score": 4
    },
    {
      "id": "lefsn1p",
      "body": "bro, this post (and thread) is wild. 😆",
      "created_utc": 1721680462.0,
      "score": 6
    },
    {
      "id": "leibzfo",
      "body": "You ovulating ?? 😭😭",
      "created_utc": 1721718556.0,
      "score": 4
    },
    {
      "id": "leimrey",
      "body": "I would get a strap-on if were you.",
      "created_utc": 1721725841.0,
      "score": 5
    },
    {
      "id": "lefap99",
      "body": "Maybe try a strap-on?",
      "created_utc": 1721674763.0,
      "score": 4
    },
    {
      "id": "lefbna7",
      "body": "Strap on?",
      "created_utc": 1721675068.0,
      "score": 3
    },
    {
      "id": "lefobj3",
      "body": "I’m the opposite, haha. Like.. thank god I don’t have a penis and thank god I’m a woman 😂 It would be cool to know what it feels like, but I’d only try it once if I could. Just for curiousity. But it’s not something that I wish for",
      "created_utc": 1721679116.0,
      "score": 4
    },
    {
      "id": "leg4s0l",
      "body": "Sameeeeee, if I had a dick I'd actually be able to finish every time I have sex like my bf does 😒 it's not even his fault either, I'm genetically not sensitive at all and my meds make it worse",
      "created_utc": 1721684392.0,
      "score": 3
    },
    {
      "id": "lehs1qr",
      "body": "This is literally like millions of dudes saying that they wish they had boobs, at least they can get that by eating a lot.",
      "created_utc": 1721707241.0,
      "score": 4
    },
    {
      "id": "lejp89d",
      "body": "Ima hold your hand while I say this … you may perheps not be a straight as you think you arw",
      "created_utc": 1721744159.0,
      "score": 5
    },
    {
      "id": "lek7cj0",
      "body": "Sigmund Freud is rolling in his grave rn",
      "created_utc": 1721750035.0,
      "score": 4
    },
    {
      "id": "lekyq7a",
      "body": "we need an invisibility cloak and a strap for u ASAP.",
      "created_utc": 1721758610.0,
      "score": 3
    },
    {
      "id": "lefgbvj",
      "body": "I'm a cis woman (but like almost nonbinary about it?), I like my curves and wearing dresses, but I too wish I had a dick, except I also wish I didn't have the whole female reproductive system. Almost like I wish I could be a trans woman, lol.\n\nI'm also aroace and the thought of being penetrated is revolting to me, but interestingly enough, if I had a dick I might be okay with penetrating others.",
      "created_utc": 1721676576.0,
      "score": 9
    },
    {
      "id": "lefl0za",
      "body": "goodbye for the day, Reddit",
      "created_utc": 1721678076.0,
      "score": 7
    },
    {
      "id": "lefhmzr",
      "body": "I can't wait for the future where we have cybercocks that connect to a port. So the body can feel it like an extra body part, but you can always detach it, if you'd like. I'd definitely get one then",
      "created_utc": 1721677001.0,
      "score": 3
    },
    {
      "id": "lefk92s",
      "body": "\"she'd be really cute  but in a straight way\"\n\nim fuckin dead\n\nalso real",
      "created_utc": 1721677833.0,
      "score": 3
    },
    {
      "id": "left48h",
      "body": "\"Get the strap\" -50",
      "created_utc": 1721680612.0,
      "score": 3
    },
    {
      "id": "leg4tmg",
      "body": ">I wish I had a dick so I could fuck my boyfriend\n\nPegging is a thing.\n\n>I also like to imagine my boyfriend as a girl sometimes and I find it really hot she’d be so cute but in a straight way\n\nLeaving aside the question of whether this is \"straight,\" sissification and cross-dressing play are things, too.\n\nUnless your boyfriend is very sexually adventurous/kinky, though, I suspect this might be a hard (no pun intended) conversation to have with him.",
      "created_utc": 1721684406.0,
      "score": 3
    },
    {
      "id": "legggk8",
      "body": "i have literally cried sadly during sex to my bf bc i wished i could feel what he felt LOL",
      "created_utc": 1721688499.0,
      "score": 3
    },
    {
      "id": "leh44b9",
      "body": "I feel you so badly. I want to pee standing up, and to know that I could lose my virginity without it hurting.",
      "created_utc": 1721697335.0,
      "score": 3
    },
    {
      "id": "lehfbgp",
      "body": "honestly same. im bi and i wanna fuck girls like dick fucking",
      "created_utc": 1721701714.0,
      "score": 3
    },
    {
      "id": "lehkkk8",
      "body": "Girlll we are completely the same lmaoo, sometimes I have my boyfriend sit on my lap and I like to tell him: “I wish I had a dick because I would RAIL you” lol",
      "created_utc": 1721703881.0,
      "score": 3
    },
    {
      "id": "lef9lgo",
      "body": "may i suggest pegging?",
      "created_utc": 1721674410.0,
      "score": 6
    },
    {
      "id": "lefpo2u",
      "body": "Brother if you’re looking at other women and want to fuck them while being a woman I don’t think you’re straight",
      "created_utc": 1721679530.0,
      "score": 4
    },
    {
      "id": "lefpxxa",
      "body": "Brother if you’re looking at other women and want to fuck them while being a woman I don’t think you’re straight. If you think it’s hot to imagine your boyfriend as a girl and constantly wish you had a dick then you probably need some soul searching to do",
      "created_utc": 1721679612.0,
      "score": 5
    },
    {
      "id": "legyvtw",
      "body": "Humans are weird...",
      "created_utc": 1721695325.0,
      "score": 5
    },
    {
      "id": "lefpfft",
      "body": "Ngl I'm kinda in the same boat but I wish I could keep my vag and have a dick. Like I want both. Idk but dudes boxer shorts are mad comfy and I'm jealous I can't go pee by simply whipping out my dick and going with them still on. I want that dumb ability to wizz in an empty bottle. Maybe Freud was right and we really do get penis envy 😂",
      "created_utc": 1721679457.0,
      "score": 2
    },
    {
      "id": "lefqcci",
      "body": "No I actually relate, I always tell my bf I wish I had a penis, not to mention I could piss on trees and stuff :3",
      "created_utc": 1721679736.0,
      "score": 2
    },
    {
      "id": "lefqdoj",
      "body": "😭😭❓❓❓",
      "created_utc": 1721679748.0,
      "score": 2
    },
    {
      "id": "lefqiog",
      "body": "Have you tried pegging?",
      "created_utc": 1721679792.0,
      "score": 2
    },
    {
      "id": "leftgrg",
      "body": "Have you ever heard of pegging?",
      "created_utc": 1721680723.0,
      "score": 2
    },
    {
      "id": "leg2rsn",
      "body": "Real (I've gotten so triggered that i tried 0ffing myself bc of this)",
      "created_utc": 1721683714.0,
      "score": 2
    },
    {
      "id": "leg4x1w",
      "body": "Freud’s ghost grows stronger 😌",
      "created_utc": 1721684438.0,
      "score": 2
    },
    {
      "id": "leg6016",
      "body": "I want a dick to pee easily when I'm not home. You're not alone girl 😂",
      "created_utc": 1721684804.0,
      "score": 2
    },
    {
      "id": "leg6dmc",
      "body": "Isn’t there a strap penis that u can attach to yourself and have anal sex with your boyfriend?",
      "created_utc": 1721684932.0,
      "score": 2
    },
    {
      "id": "leg7h1d",
      "body": "Strapons do exist",
      "created_utc": 1721685302.0,
      "score": 2
    },
    {
      "id": "leg9vj7",
      "body": "What the hell did I just read",
      "created_utc": 1721686146.0,
      "score": 2
    },
    {
      "id": "lege3ve",
      "body": "You aren’t 100% straight and thats ok. But maybe go masturbate because you are way too horny with this shit lmao, dudes dont go around just wanting to be floating cocks that fuck anything and quite frankly, jokes aside it would be weird if a guy actually said or thought that.",
      "created_utc": 1721687655.0,
      "score": 2
    },
    {
      "id": "legfkkb",
      "body": "Lots of cis women feel this way! I’m wondering what the evolutionary purpose is for that lol",
      "created_utc": 1721688179.0,
      "score": 2
    },
    {
      "id": "legjgbk",
      "body": "Having a dick is awesome 😎 but helicopter nah we don’t do that lol. We have this thing called nuts and if they are slapped, kicked or even bumped wrong it can shut down your whole operation 😂",
      "created_utc": 1721689573.0,
      "score": 2
    },
    {
      "id": "legm6d5",
      "body": "Girls wanna be guys so bad 💀😭🤦🏾‍♂️",
      "created_utc": 1721690556.0,
      "score": 2
    },
    {
      "id": "legubgc",
      "body": "Strap ons??? But yeah, you should ask your bf consent first. He might not be into pegging...",
      "created_utc": 1721693603.0,
      "score": 2
    },
    {
      "id": "leh0aex",
      "body": "You do know strapons exist, right? There's strapless ones too and some pretty realistic ones. Temporary dicks, hell you could have several dicks.",
      "created_utc": 1721695862.0,
      "score": 2
    },
    {
      "id": "leh3x8k",
      "body": "I'm waiting for the day they create a way to basically switch your parts out when you want. Best of both worlds. I'll probably in my damn 90s if I am lucky lol",
      "created_utc": 1721697260.0,
      "score": 2
    },
    {
      "id": "leh6ge1",
      "body": "I think it would be like trowing gas at a fire .but have you checked futanari content ?",
      "created_utc": 1721698232.0,
      "score": 2
    },
    {
      "id": "leh6yy6",
      "body": "i’ve had this feeling for years. i am nonbinary but born female and present pretty femme usually. i wish i could switch between having a dick and a cooch. like removable parts that i can switch to my liking. you’re not alone!",
      "created_utc": 1721698434.0,
      "score": 2
    },
    {
      "id": "leh76ml",
      "body": "🥴Man I feel guilty, this is basically the life I live. I feel like I was blessed being born with a dick and getting to be a hot and well cocked trans woman- like nobody or anything can take away the happiness I have for myself and my body.\n\nHoney, I so wish there were better ways to fulfill your dream but do what you can to do so! You may find you like using a strap, especially if you get a very “real” looking harness.\n\nJust out of curiosity, do you think if you were born with a penis you’d be more inclined to live life presenting as a male of female in society? (Potential childhood upbringing differences aside)",
      "created_utc": 1721698517.0,
      "score": 2
    },
    {
      "id": "lehbpfm",
      "body": "honestly as a guy this is so real both ways",
      "created_utc": 1721700274.0,
      "score": 2
    },
    {
      "id": "lehccg2",
      "body": "Have you tried a strap on?",
      "created_utc": 1721700531.0,
      "score": 2
    },
    {
      "id": "lehdq2c",
      "body": "this post is amazing",
      "created_utc": 1721701079.0,
      "score": 2
    },
    {
      "id": "lehfrne",
      "body": "Don't feel bad. I feel like my past life, I was a dude. I get phantom penis. I get it. I may come back as a dude next time. Best of luck op.",
      "created_utc": 1721701897.0,
      "score": 2
    },
    {
      "id": "lehhak5",
      "body": "This is the funniest but most relatable and most interesting post I have seen all day.😂",
      "created_utc": 1721702509.0,
      "score": 2
    },
    {
      "id": "lehhiam",
      "body": "A lot of people here seem to share the same sentiment, so rather than reply to one person I’ll create a whole thread. \nFor having sex: Get a two sided dildo with a strap. Is it the same? No. It isnt, but unfortunately it is the best option. \nAnd for peeing standing up/outside: Get a “Stand to pee” (STP) device. There are so many different ones. Some you wear all the time, some you only take out of a bag when you beed to use it. Some stay attached, some dont. Some are shaped like penises and some arent. \n\nAs a trans guy, I have tried alternatives to both of these things, and they are out there, but I havent found anything as good",
      "created_utc": 1721702596.0,
      "score": 2
    },
    {
      "id": "lehkc3i",
      "body": "As a guy lemme say, I’ve always wondered just out of curiosity what it would be like to have a vagina. Lot more pleasurable spots, over all more pleasure, and no cool down. Men were given a cool down which makes you think a little too clear, post nut clarity sucks. I’d like to just enjoy and not think.",
      "created_utc": 1721703782.0,
      "score": 2
    },
    {
      "id": "lehwl3i",
      "body": "Can totally relate to it being a man. I sometimes think what other genders feel like. I just wanted to have a vagina for once to know and experience the feel of getting fucked by a dick. I mean I've done the dicking I just wanna know how it feels to get dicked. I'm a straight man but again I can't stop wondering lol.",
      "created_utc": 1721709492.0,
      "score": 2
    },
    {
      "id": "lei5d1v",
      "body": "You can have a penis. Go to Amazon, search strap-on, click order, also make sure you include lube if you are going to f*** your boyfriend with it",
      "created_utc": 1721714418.0,
      "score": 2
    },
    {
      "id": "leib6gs",
      "body": "Freud feeling proud in his grave",
      "created_utc": 1721718036.0,
      "score": 2
    },
    {
      "id": "leiqqxd",
      "body": "She is so not straight, she might as well be a corkscrew.",
      "created_utc": 1721728516.0,
      "score": 2
    },
    {
      "id": "leisr90",
      "body": "I wish I had a vagina sometimes, would love to see how it is for the other side",
      "created_utc": 1721729786.0,
      "score": 2
    },
    {
      "id": "lej7yr9",
      "body": "Strap up!",
      "created_utc": 1721737598.0,
      "score": 2
    },
    {
      "id": "lejbork",
      "body": "See you say you're fine being woman but the question is would you be happier being a man",
      "created_utc": 1721739168.0,
      "score": 2
    },
    {
      "id": "lejbwfv",
      "body": "no but like, as a fully unstraight female, why can't i nut in my gf??? that's just so unfair, i want to know what it feels like bro 😭",
      "created_utc": 1721739254.0,
      "score": 2
    },
    {
      "id": "lejsesj",
      "body": "Dual pleasure strap-on's are a thing...",
      "created_utc": 1721745230.0,
      "score": 2
    },
    {
      "id": "lejuj5t",
      "body": "This the wildest reddit post I’ve seen so far lmaoo",
      "created_utc": 1721745935.0,
      "score": 2
    },
    {
      "id": "lejvu0g",
      "body": "I also have a penis envy but purely for wanking because there's not much work to do, unlike with vagina.",
      "created_utc": 1721746360.0,
      "score": 2
    },
    {
      "id": "lekhru2",
      "body": "I too have wanted a dick but only like for a day. I just want to know what the difference is🤷‍♀️",
      "created_utc": 1721753336.0,
      "score": 2
    },
    {
      "id": "lel9in0",
      "body": ">”fully straight and female”\n>wants to fuck women\n\nSomething isn’t adding up.",
      "created_utc": 1721762016.0,
      "score": 2
    },
    {
      "id": "lem2jf2",
      "body": "Start doing some free weight curls first because, penises require a lot of attention and physical activity. That's why we give it a name. It's a like a pet. NAME IT! PET IT!",
      "created_utc": 1721771229.0,
      "score": 2
    },
    {
      "id": "lem2tva",
      "body": "this the type of shit my gf would be sayin to me at 1am",
      "created_utc": 1721771326.0,
      "score": 2
    },
    {
      "id": "lenm3tq",
      "body": "Friend, and I mean NO Disrespect here, have you considered that you maybe aren't as cishet as you think you are?",
      "created_utc": 1721792447.0,
      "score": 2
    },
    {
      "id": "lfg5z74",
      "body": "you seem to suffer from terminal horniness. there is no cure",
      "created_utc": 1722232436.0,
      "score": 2
    },
    {
      "id": "lefl24t",
      "body": "In all seriousness I would consider exploring your gender and sexual identity.",
      "created_utc": 1721678086.0,
      "score": 4
    },
    {
      "id": "lef835s",
      "body": "What the fuck did I just read 😭😭",
      "created_utc": 1721673936.0,
      "score": 3
    },
    {
      "id": "lefb7b6",
      "body": "Welp that's enough reddit for today!",
      "created_utc": 1721674925.0,
      "score": 3
    },
    {
      "id": "leg8ftl",
      "body": "doesn’t sound straight but ok LOL",
      "created_utc": 1721685634.0,
      "score": 2
    },
    {
      "id": "lefgepg",
      "body": "Interesting. I wonder how this even came about. I cannot relate. Just curious, does that mean you don't like/enjoy/love penetration? Does that mean you prefer a partner that allows you to perform anal on them? I'm not judging, just curious.",
      "created_utc": 1721676602.0,
      "score": 1
    },
    {
      "id": "lefhfo0",
      "body": "me",
      "created_utc": 1721676936.0,
      "score": 1
    },
    {
      "id": "lefhs76",
      "body": "I wish I didn’t sometimes so I get it",
      "created_utc": 1721677048.0,
      "score": 1
    },
    {
      "id": "lefhwoc",
      "body": "I think that sexual identity, sexual and gender roles and relationships are much more complex than simple straight/bi/homosexual. I get that people are more comfortable putting people in a box but it’s not as simple as that.",
      "created_utc": 1721677087.0,
      "score": 1
    },
    {
      "id": "lefhz9s",
      "body": "Same",
      "created_utc": 1721677110.0,
      "score": 1
    },
    {
      "id": "lefi65x",
      "body": "This this all right here.",
      "created_utc": 1721677171.0,
      "score": 1
    },
    {
      "id": "lefiqed",
      "body": "i relate to you so bad.. i literally would love to have one idk why!! im the same, i don’t feel trans or like im a man in a woman’s body i just want a penis..",
      "created_utc": 1721677349.0,
      "score": 1
    },
    {
      "id": "lefj6f3",
      "body": "invest in a strap on",
      "created_utc": 1721677490.0,
      "score": 1
    },
    {
      "id": "lefjf04",
      "body": "bruh",
      "created_utc": 1721677565.0,
      "score": 1
    },
    {
      "id": "lefk2nz",
      "body": "I hate snow but i wanna play in snow and enjoy the cold",
      "created_utc": 1721677776.0,
      "score": 1
    },
    {
      "id": "lefk8pa",
      "body": "Ok buddy this is going to copypasta",
      "created_utc": 1721677829.0,
      "score": 1
    },
    {
      "id": "lefkpqt",
      "body": "Read “Dick for a Day” and “My Penis”. Classics!",
      "created_utc": 1721677978.0,
      "score": 1
    },
    {
      "id": "lefkt7d",
      "body": "What drugs did you use? (But tbh same :3)",
      "created_utc": 1721678008.0,
      "score": 1
    },
    {
      "id": "lefloj3",
      "body": "Oh boy.",
      "created_utc": 1721678280.0,
      "score": 1
    },
    {
      "id": "leflzxi",
      "body": "Lmfaooooo but why do I agrée? I also think about how easy penises get aroused and I’m jealous 😅",
      "created_utc": 1721678380.0,
      "score": 1
    },
    {
      "id": "lefn9oc",
      "body": "Ah the classic penis envy",
      "created_utc": 1721678783.0,
      "score": 1
    },
    {
      "id": "lefnk8i",
      "body": "definitely copy pasta material",
      "created_utc": 1721678878.0,
      "score": 1
    },
    {
      "id": "lefnpha",
      "body": "SAME",
      "created_utc": 1721678924.0,
      "score": 1
    },
    {
      "id": "lefo7bu",
      "body": "I relate to this on another level. I just posted about this in a comment the other day",
      "created_utc": 1721679081.0,
      "score": 1
    },
    {
      "id": "lefp1yd",
      "body": "for some reason, when i was in like i dunno, 1-2 grade, i had thought of an invention that i kept to myself cause it was so weird to me then, to make peeing easier so i wouldn’t have to wipe or whatever the logic was & it was an attachable penis basically. you put it on like a strap on & make sure the holes line up lol",
      "created_utc": 1721679341.0,
      "score": 1
    },
    {
      "id": "lefpgfl",
      "body": "Ngl I'm kinda in the same boat but I wish I could keep my vag and have a dick. Like I want both. Idk but dudes boxer shorts are mad comfy and I'm jealous I can't go pee by simply whipping out my dick and going with them still on. I want that dumb ability to wizz in an empty bottle. Maybe Freud was right and we really do get penis envy 😂",
      "created_utc": 1721679466.0,
      "score": 1
    },
    {
      "id": "lefpuq9",
      "body": "You can have mine, it's small and sensitive",
      "created_utc": 1721679585.0,
      "score": 1
    },
    {
      "id": "lefpwd2",
      "body": "[deleted]",
      "created_utc": 1721679598.0,
      "score": 1
    },
    {
      "id": "lefqpzy",
      "body": "Freud's having a giggle from beyond the grave.",
      "created_utc": 1721679856.0,
      "score": 1
    },
    {
      "id": "lefri5g",
      "body": "This is more relatable than anything ive read on here, its also like the scrotum too i would be so good at the pinch and roll",
      "created_utc": 1721680102.0,
      "score": 1
    },
    {
      "id": "lefrsgh",
      "body": "I won’t lie, having a dick is very convenient in many different situations",
      "created_utc": 1721680193.0,
      "score": 1
    },
    {
      "id": "lefrwbg",
      "body": "Little boy and little girl are playing in the yard. Little boy says, \"I'll show you mine if you show me yours. Let's do it at the same time.\" \n\nBoth children drop their drawers. \n\nLittle boy laughs in points at his region and says, \"haha! I have one of these and you don't!\" \n\nLittle girl starts crying and runs home to her mom and tells me what happens. \n\nNext day little boy and girl are playing in the yard again. Little boy drops his drawers and says, \"haha! I have one of these and you never will!\" Little girl drops her drawers and says, \"My mom says with one of these I can get as many of those as I want!\"",
      "created_utc": 1721680226.0,
      "score": 1
    },
    {
      "id": "lefsmmf",
      "body": "What would you do with it?",
      "created_utc": 1721680459.0,
      "score": 1
    },
    {
      "id": "leftobt",
      "body": "Wow yeah sounds extremely straight to me.",
      "created_utc": 1721680790.0,
      "score": 1
    },
    {
      "id": "leftsnh",
      "body": "Fuck how you want and fuck who you want. Get yourself that satisfaction you’re craving. Life’s too short to not experience things you’re looking to experience",
      "created_utc": 1721680827.0,
      "score": 1
    },
    {
      "id": "lefty02",
      "body": "Me",
      "created_utc": 1721680874.0,
      "score": 1
    },
    {
      "id": "lefxrh3",
      "body": "This is so based",
      "created_utc": 1721682075.0,
      "score": 1
    },
    {
      "id": "lefxszu",
      "body": "I am a penis, but I wish I had a girl",
      "created_utc": 1721682088.0,
      "score": 1
    },
    {
      "id": "lefz5wq",
      "body": "In an ideal world I’d have a vagina and a penis",
      "created_utc": 1721682525.0,
      "score": 1
    },
    {
      "id": "lefzajo",
      "body": "Strap on my darling.",
      "created_utc": 1721682566.0,
      "score": 1
    },
    {
      "id": "lefzcpj",
      "body": "I'm not the only one, I'm just curious what it's like. They need to make one of those cramps machines, but for having a penis. Idk how but there's someone out there with the right brain to figure it out.",
      "created_utc": 1721682586.0,
      "score": 1
    },
    {
      "id": "lefzjeg",
      "body": "Don’t think I’ve ever read something so relatable…",
      "created_utc": 1721682647.0,
      "score": 1
    },
    {
      "id": "lefzr7x",
      "body": "This is probably the most stupid thing I’ve read in a while 😂",
      "created_utc": 1721682718.0,
      "score": 1
    },
    {
      "id": "lefzsmo",
      "body": "“Sometimes I look at women and want to fuck them with a dick but I’m fully straight and female” but No Homo tho right??😂",
      "created_utc": 1721682731.0,
      "score": 1
    },
    {
      "id": "leg0s3t",
      "body": "I don't think this is so much a Trans thing and more of a primal thing. So I wouldn't stress too much about that aspect.",
      "created_utc": 1721683050.0,
      "score": 1
    },
    {
      "id": "leg0sgw",
      "body": "this is so real… the last part though, that’s how i found out i was bisexual🥲🤣",
      "created_utc": 1721683053.0,
      "score": 1
    },
    {
      "id": "leg34oi",
      "body": "To all the women replying they wish they had a dick...\n\nIf a dick granting genie exists you better make sure you specify length and girth. Might get a bit upset having a micropenis...",
      "created_utc": 1721683835.0,
      "score": 1
    },
    {
      "id": "leg3mf4",
      "body": "girllll im gonna hold your hand when I say this… lmfaoo",
      "created_utc": 1721684002.0,
      "score": 1
    },
    {
      "id": "leg5241",
      "body": "i wish i had a dick so i could write my name or draw things in pee in fresh snow, i’ve always wanted to do that",
      "created_utc": 1721684485.0,
      "score": 1
    },
    {
      "id": "leg5i91",
      "body": "My hubby says there is a reason I was born without a penis! I think he is right! There wouldn’t be an apple pie or anything with a hole big enough for my penis to fit in safe in a 50 mile radius.",
      "created_utc": 1721684637.0,
      "score": 1
    },
    {
      "id": "leg5nxn",
      "body": "what if you had a penis but it was like 3 inches",
      "created_utc": 1721684691.0,
      "score": 1
    },
    {
      "id": "leg6ux9",
      "body": "Don’t worry. Guys with dicks want to be floating cocks who fuck people also.",
      "created_utc": 1721685094.0,
      "score": 1
    },
    {
      "id": "leg74kg",
      "body": "Born to be a trans woman pre surgery fr lol i feel you so hard",
      "created_utc": 1721685184.0,
      "score": 1
    },
    {
      "id": "leg7mym",
      "body": "Yuma is that you",
      "created_utc": 1721685358.0,
      "score": 1
    },
    {
      "id": "leg7y6v",
      "body": "There are these strap ons you can buy and make it a reality",
      "created_utc": 1721685465.0,
      "score": 1
    },
    {
      "id": "leg8wxp",
      "body": "Strapon",
      "created_utc": 1721685807.0,
      "score": 1
    },
    {
      "id": "leg9suf",
      "body": "If I would see myself with a penis one morning, I would be horrified and probably would die from panic attack. But this offmychest post somehow translates the feeling so well that I couldn’t agree more. Also reminded me of that iconic movie “It’s a boy girl thing” haha",
      "created_utc": 1721686120.0,
      "score": 1
    },
    {
      "id": "lega3mt",
      "body": "🤣🤣🤣🤣🤣🤣 I laughed so much!",
      "created_utc": 1721686226.0,
      "score": 1
    },
    {
      "id": "legarof",
      "body": "same",
      "created_utc": 1721686463.0,
      "score": 1
    },
    {
      "id": "legbiir",
      "body": "Totally get it, use to think what it would be like to have a dick, how different it would feel from having a vjj only out of curiosity..",
      "created_utc": 1721686731.0,
      "score": 1
    },
    {
      "id": "legbzdu",
      "body": "Okay but, I feel this all the time. TMI, but if I ever choose to masturbate with a vibrator, I always get a wand so I can have it pointing upward and use a pillow or something and “fuck” it. It really gets me off for some reason! Would be cool to have a detachable dick, for sure😭😅.",
      "created_utc": 1721686898.0,
      "score": 1
    },
    {
      "id": "legc8kg",
      "body": "And I want my PS4 not to broken, but if ands butts were all candy and nuts we'd all have a Merry Christmas and it's only July.",
      "created_utc": 1721686989.0,
      "score": 1
    },
    {
      "id": "legcaw2",
      "body": "It's not the same i think but you could use a strap-on",
      "created_utc": 1721687012.0,
      "score": 1
    },
    {
      "id": "legcg9d",
      "body": "Have you heard of futanari porn before?",
      "created_utc": 1721687065.0,
      "score": 1
    },
    {
      "id": "legcipu",
      "body": "Interesting",
      "created_utc": 1721687089.0,
      "score": 1
    },
    {
      "id": "legcn3s",
      "body": "I think they sell those",
      "created_utc": 1721687132.0,
      "score": 1
    },
    {
      "id": "legehs9",
      "body": "same here lol",
      "created_utc": 1721687793.0,
      "score": 1
    },
    {
      "id": "legghhf",
      "body": "relatable",
      "created_utc": 1721688509.0,
      "score": 1
    },
    {
      "id": "leggp25",
      "body": "No i really feel this tho, like bar for bar 😂",
      "created_utc": 1721688584.0,
      "score": 1
    },
    {
      "id": "leggzjp",
      "body": "I get the same thing but the other way round. I'm a straight guy but I wish that I had a vagina sometimes just to experience what its like and fuck tons of guys.",
      "created_utc": 1721688690.0,
      "score": 1
    },
    {
      "id": "legjaos",
      "body": "Girl me too about all the dick stuff except I already know I'm pan lol u might have some introspection to do!!!",
      "created_utc": 1721689516.0,
      "score": 1
    },
    {
      "id": "legjj00",
      "body": "I mean, they make dildos, you know...",
      "created_utc": 1721689600.0,
      "score": 1
    },
    {
      "id": "legk6g7",
      "body": "Buy that strap on and fuck that boy, shawty",
      "created_utc": 1721689838.0,
      "score": 1
    },
    {
      "id": "legl3nd",
      "body": "i want a vagina",
      "created_utc": 1721690168.0,
      "score": 1
    },
    {
      "id": "legl8xf",
      "body": "i think as a girl we all have felt this way 😂😂",
      "created_utc": 1721690221.0,
      "score": 1
    },
    {
      "id": "leglja9",
      "body": "I second this sentiment!! Damn if I had a cock id be jerkin it all the time and trying to FUKKK all the baddies lol",
      "created_utc": 1721690325.0,
      "score": 1
    },
    {
      "id": "legmgvz",
      "body": "I love the format of your message, “having my birth genitalia is just eh, not great but not bad… But having the other one WOULD BE FLICKING OOWESOME!!!”. I believe you that you’re not trans or gay or either of the above. But the gender dysphoria you are describing would be enough to convince me otherwise, I do hope you get the opportunity to peg your boyfriend someday though.",
      "created_utc": 1721690663.0,
      "score": 1
    },
    {
      "id": "legmpqo",
      "body": "Damn. This really started something. Wild how many women wish for a peen.",
      "created_utc": 1721690754.0,
      "score": 1
    },
    {
      "id": "legmt1i",
      "body": "Get a strap on?",
      "created_utc": 1721690788.0,
      "score": 1
    },
    {
      "id": "legn2v5",
      "body": "good luck babe 😭",
      "created_utc": 1721690891.0,
      "score": 1
    },
    {
      "id": "legns13",
      "body": "New copypasta dropped.",
      "created_utc": 1721691154.0,
      "score": 1
    },
    {
      "id": "legnvyl",
      "body": "Ikkk😫 Samee. Having a strap on and having a real dick isn’t the sameee",
      "created_utc": 1721691200.0,
      "score": 1
    },
    {
      "id": "legok42",
      "body": "Have you considered working for the Internal Revenue Service?",
      "created_utc": 1721691457.0,
      "score": 1
    },
    {
      "id": "legoyxx",
      "body": "SAMEEE",
      "created_utc": 1721691611.0,
      "score": 1
    },
    {
      "id": "legqovn",
      "body": "LMFAO REAL😭😭",
      "created_utc": 1721692253.0,
      "score": 1
    },
    {
      "id": "legqzep",
      "body": "Real asf honestly",
      "created_utc": 1721692363.0,
      "score": 1
    },
    {
      "id": "legqzqk",
      "body": "I’m actually cackling at this 😭😂😂 tbh kinda relatable",
      "created_utc": 1721692367.0,
      "score": 1
    },
    {
      "id": "legrlw2",
      "body": "You saying “I don’t want to be anything” makes me have to ask — have you considered you might be nonbinary? You don’t wanna be a guy, but like somewhere in between? Might wanna get bottom surgery? I’m nonbinary, and a big tell tale sign for me was the fact that when I thought about gender, I would think “I don’t wanna be anything, just a person or some ambiguous creature blob”. \n\nI’d recommend getting a packer and/or a strap on, not to satisfy yourself because I know it’s not the same thing, but to see if it feels right and makes you more comfortable with yourself. If it doesn’t do anything, it’s no harm done, at least you tried it out. If it does, then consider speaking to a therapist as a next step — preferably one that specialises in gender therapy. They can help you from there on deciding what the best next steps are.",
      "created_utc": 1721692595.0,
      "score": 1
    },
    {
      "id": "legrvqz",
      "body": "Strapon and peg him",
      "created_utc": 1721692697.0,
      "score": 1
    },
    {
      "id": "legt0ai",
      "body": "By a strap on and go to town",
      "created_utc": 1721693117.0,
      "score": 1
    },
    {
      "id": "legtgmr",
      "body": "It would be an experience of power",
      "created_utc": 1721693285.0,
      "score": 1
    },
    {
      "id": "legtxe1",
      "body": "okay but you gotta have balls too",
      "created_utc": 1721693457.0,
      "score": 1
    },
    {
      "id": "legu1ph",
      "body": "Fully straight? \nI think the same. \nBut I wanna fuck women not men. \nGetting head from a stunning woman? \nPleeeeeaaaaassseeee.",
      "created_utc": 1721693502.0,
      "score": 1
    },
    {
      "id": "legu55w",
      "body": "wha-",
      "created_utc": 1721693538.0,
      "score": 1
    },
    {
      "id": "leguh1x",
      "body": "As a women with this same kind of feelings. You might be missing out on something with your sexuality, you *might or might not* but probably *might* not be 10000% straight which hey it’s always okay. I’m a very feminine looking women but I’m pan and love to top men and pretty girls \n\nMaybe if u get into buttplay with your partner they ~ he might actually end up linking it",
      "created_utc": 1721693662.0,
      "score": 1
    },
    {
      "id": "legvvjy",
      "body": "Girl same",
      "created_utc": 1721694193.0,
      "score": 1
    },
    {
      "id": "legwl48",
      "body": "Girl SAME. I’m a switch & bisexual AF. I wish I had a dick sometimes too, a real one lol. \n\nIf you wanna f*ck girls then you prob aren’t straight girl, might be like me though. I’m physically and emotionally attracted to men, and physically attracted to women. I’m not interested to date a girl but like to appreciate beauty. ;) haha",
      "created_utc": 1721694459.0,
      "score": 1
    },
    {
      "id": "legwn64",
      "body": "For sure you are not alone bc I’m in a lesbian relationship and I wish I had a dick because I want to feel what it’s like and I literally get depressed",
      "created_utc": 1721694481.0,
      "score": 1
    },
    {
      "id": "legwwjs",
      "body": "That’s the weirdest post today.",
      "created_utc": 1721694579.0,
      "score": 1
    },
    {
      "id": "legwz9u",
      "body": "🤣🤣\n\nAsk Santa for a strap-on?",
      "created_utc": 1721694607.0,
      "score": 1
    },
    {
      "id": "legxgqq",
      "body": "NOT ME! Only time once I was walking in the woods it was hassle to try and pee without getting it on my shoes and had to prop myself up with My back to a tree! A Penis would have been a relief that one time than!",
      "created_utc": 1721694791.0,
      "score": 1
    },
    {
      "id": "legxmyi",
      "body": "Freud is so wrong when it comes to me",
      "created_utc": 1721694856.0,
      "score": 1
    },
    {
      "id": "legxtxv",
      "body": "It's bad enough with a pad during you period that would be like that but worse year round!!! :(",
      "created_utc": 1721694929.0,
      "score": 1
    },
    {
      "id": "legxwio",
      "body": "One word. Pegging.\n\nGet yourself a strap on and give it back to him.",
      "created_utc": 1721694956.0,
      "score": 1
    },
    {
      "id": "legyn6p",
      "body": "Wait no.. same.. I feel called out (I’m bi tho lmao)",
      "created_utc": 1721695235.0,
      "score": 1
    },
    {
      "id": "legyveq",
      "body": "I forreal wish I had BOTH!",
      "created_utc": 1721695321.0,
      "score": 1
    },
    {
      "id": "legzinc",
      "body": "😆 what the actual fuck did I just read.",
      "created_utc": 1721695567.0,
      "score": 1
    },
    {
      "id": "legzjoo",
      "body": "Having a dick looks fun, but I dunno if I could handle the pressure. I don’t want to worry about when I cum, that seems like the absolute worst lmao",
      "created_utc": 1721695578.0,
      "score": 1
    },
    {
      "id": "legzxdq",
      "body": "see my hot take is that cis people should be able to get gender affirming care like this. i do actually know a cis woman who wants phalloplasty and still is definitely a woman. ive also met a couple of cis men who have had/want a vagina\n\nbut like. i will stop u for a sec bc u dont sound totally heterosexual. its very normal for cis ppl to wonder what having the opposite genitalia is like/want it. not quite normal for a straight woman to fantasize about fucking women lmao",
      "created_utc": 1721695724.0,
      "score": 1
    },
    {
      "id": "leh0lzb",
      "body": "Me",
      "created_utc": 1721695985.0,
      "score": 1
    },
    {
      "id": "leh0tx5",
      "body": "Amazing",
      "created_utc": 1721696072.0,
      "score": 1
    },
    {
      "id": "leh0wmc",
      "body": "“I just want to be a floating cock that fucks people” could also get posted in BrandNewSentence probably",
      "created_utc": 1721696100.0,
      "score": 1
    },
    {
      "id": "leh1bor",
      "body": "This is so real and I feel that way about so many men. ✋😔",
      "created_utc": 1721696263.0,
      "score": 1
    },
    {
      "id": "leh2esq",
      "body": "Poke away!",
      "created_utc": 1721696681.0,
      "score": 1
    },
    {
      "id": "leh2v55",
      "body": "You really want random boners in class or at an appointment that bad?",
      "created_utc": 1721696854.0,
      "score": 1
    },
    {
      "id": "leh31gi",
      "body": "There was a song in the 90s called Detachable Penis.  That’s what you need.",
      "created_utc": 1721696920.0,
      "score": 1
    },
    {
      "id": "leh3vee",
      "body": "This sounds so much like an old King Missile “song”",
      "created_utc": 1721697240.0,
      "score": 1
    },
    {
      "id": "lehbdw1",
      "body": "real asf",
      "created_utc": 1721700148.0,
      "score": 1
    },
    {
      "id": "lehbx8t",
      "body": "I wish I had a penis so I could have sex with myself and I wish I could be myself and the other person simultaneously",
      "created_utc": 1721700361.0,
      "score": 1
    },
    {
      "id": "lehcbee",
      "body": "Freud has won!",
      "created_utc": 1721700520.0,
      "score": 1
    },
    {
      "id": "lehdz4t",
      "body": "[deleted]",
      "created_utc": 1721701178.0,
      "score": 1
    },
    {
      "id": "lehg5uo",
      "body": "hahaha",
      "created_utc": 1721702055.0,
      "score": 1
    },
    {
      "id": "lehglee",
      "body": "The electra complex 🫨",
      "created_utc": 1721702228.0,
      "score": 1
    },
    {
      "id": "lehhbky",
      "body": "You don't penis is trouble",
      "created_utc": 1721702521.0,
      "score": 1
    },
    {
      "id": "lehjotu",
      "body": "Im sorry I’ve been laughing at this whole thread 😂😂",
      "created_utc": 1721703506.0,
      "score": 1
    },
    {
      "id": "lehkwv5",
      "body": "OP how does it feel knowing you’ll never nut in a woman?",
      "created_utc": 1721704028.0,
      "score": 1
    },
    {
      "id": "lehl968",
      "body": "tbr I’ve felt the exact same way my whole life",
      "created_utc": 1721704174.0,
      "score": 1
    },
    {
      "id": "lehlee6",
      "body": "That was a wild ride from start to finish.",
      "created_utc": 1721704236.0,
      "score": 1
    },
    {
      "id": "lehlgd7",
      "body": "When I was about 4, I had a dream that I had a penis (I'm female). When I woke up, I started crying when I didn't have one after all. \n\nNow I'm an adult and don't want to be a penis-owner anymore. They seem more trouble than they're worth tbh.",
      "created_utc": 1721704260.0,
      "score": 1
    },
    {
      "id": "lehm3tl",
      "body": "Idk but u sound like a lesbian and not a lesbian at the same time to me 🤣",
      "created_utc": 1721704548.0,
      "score": 1
    },
    {
      "id": "lehm65w",
      "body": "Mood! I just wanna know what it feels likes",
      "created_utc": 1721704575.0,
      "score": 1
    },
    {
      "id": "lefmy11",
      "body": "I bet there's a subreddit for that.",
      "created_utc": 1721678680.0,
      "score": 413
    },
    {
      "id": "leg2qr4",
      "body": "\"I'm Dick Rick!!!!\"",
      "created_utc": 1721683704.0,
      "score": 86
    },
    {
      "id": "lefhpll",
      "body": "😂😂",
      "created_utc": 1721677024.0,
      "score": 125
    },
    {
      "id": "legl631",
      "body": "Sounds like a run of the mill qualification for pretty much any politician",
      "created_utc": 1721690193.0,
      "score": 13
    },
    {
      "id": "legcq46",
      "body": "Normally I'd just laugh but after this season of the boys I can't help but to visualize it and now I'm shocked",
      "created_utc": 1721687162.0,
      "score": 2
    },
    {
      "id": "lefkwh7",
      "body": "I say this all the time. And I’m not dysphoric or anything I wouldn’t even want the penis all the time just for sex and peeing outside.\n\nSooo if I could remove it like a strap but still feel everything that’d be great. Come on science, get it together!",
      "created_utc": 1721678037.0,
      "score": 857
    },
    {
      "id": "lefa9qj",
      "body": "This right here 📍📌",
      "created_utc": 1721674624.0,
      "score": 121
    },
    {
      "id": "lefe8i3",
      "body": "Have you tried a feeldoe?",
      "created_utc": 1721675900.0,
      "score": 79
    },
    {
      "id": "leiusju",
      "body": "I wish I had a dick for one day to fuck my boyfriend with. I don’t think he’d like it but I would love it.",
      "created_utc": 1721731029.0,
      "score": 9
    },
    {
      "id": "lefyq9u",
      "body": "I’ve said this before 😭",
      "created_utc": 1721682384.0,
      "score": 7
    },
    {
      "id": "legmlf6",
      "body": "I have an idea , what if someone made a strap that when you thrust a censor goes off and it vibrates or something idk",
      "created_utc": 1721690709.0,
      "score": 3
    },
    {
      "id": "legmwli",
      "body": "This is so real lmaooo",
      "created_utc": 1721690825.0,
      "score": 2
    },
    {
      "id": "lehi9qc",
      "body": "What about a double sided dildo? I'm not being silly. Wouldn't that work a bit? I mean it wouldn't be exactly the same but you'd both feel something as you thrusted",
      "created_utc": 1721702909.0,
      "score": 2
    },
    {
      "id": "lefxkkn",
      "body": "I'm a guy, and I've had the same thoughts in reverse.\n\nWhat does it feel like to be a horny girl that likes being submissive?\n\nWhen they look at attractive men, what does that feel like, what do they focus on, what are they thinking?\n\nIf I could trade bodies for just like, a few months, I'd really just like to feel and experience everything.  I'd totally do it.  I'd like a complete 90 day experience.",
      "created_utc": 1721682014.0,
      "score": 212
    },
    {
      "id": "lefb7b5",
      "body": "To paint you a word picture: it's awesome",
      "created_utc": 1721674925.0,
      "score": 239
    },
    {
      "id": "lefuari",
      "body": "Girl me too😭 like can you imagine just having a body part that can get rock hard and you can spin around like that?? How about when they flex it like what kind of witchcraft",
      "created_utc": 1721680988.0,
      "score": 27
    },
    {
      "id": "leg586s",
      "body": "More than a few female friends of mine have said they want to do the \"helicopter\". Lol. \n\nAhhh... I've never done that. That is just weird. It would feel weird, and maybe even hurt a little. \n\nBut the hard dick when we're horny is pretty awesome. Lots of testosterone. A very aggressive feeling. Plenty of strength. Imagine the Hulk.\n\nBut the helicopter? Nah. None of us do that. I have no idea how you ladies even came up with that. That is weird!",
      "created_utc": 1721684542.0,
      "score": 26
    },
    {
      "id": "lei1nds",
      "body": "I flew away one time.",
      "created_utc": 1721712252.0,
      "score": 8
    },
    {
      "id": "leflmhf",
      "body": "It's bloody convenient just being able to pop out the hose and let it flow wherever you are just like that",
      "created_utc": 1721678262.0,
      "score": 102
    },
    {
      "id": "legwhkt",
      "body": "Lmfao this killed me cuz I have 3 older brothers and I used to cry to my parents that I couldn’t just pee anywhere like my brothers could 😭 my tiny brain just didn’t understand why boys could just whip it out anytime and I couldn’t lmfao",
      "created_utc": 1721694422.0,
      "score": 19
    },
    {
      "id": "lefd09h",
      "body": "As a former penis-haver, this comment cracks me up. It’s also amazing how much variance the human mind has!",
      "created_utc": 1721675506.0,
      "score": 21
    },
    {
      "id": "leh7dbs",
      "body": "From the title I thought that’s where this post was going \n\n\nI was wrong",
      "created_utc": 1721698589.0,
      "score": 2
    },
    {
      "id": "lfgddf8",
      "body": "Well, anywhere there's nobody around, especially to write you a ticket.",
      "created_utc": 1722237237.0,
      "score": 2
    },
    {
      "id": "lefholo",
      "body": "😂😂",
      "created_utc": 1721677015.0,
      "score": 54
    },
    {
      "id": "lefczkw",
      "body": "But NO HOMO.",
      "created_utc": 1721675500.0,
      "score": 648
    },
    {
      "id": "lefhbb9",
      "body": "My reaction too lol “I’m straight but want to fuck women” OP, it’s okay, we still love you :)",
      "created_utc": 1721676897.0,
      "score": 338
    },
    {
      "id": "lefl2ri",
      "body": "hahahhaha i get where she’s coming from - as a gay man i still want to fuck women (cis and trans) but still feel comfortable calling myself a homo because my desire is to stay in committed relationships with men. i think it comes down to which gender(s) you prefer to be in relationships with rather than who you wanna fuck?",
      "created_utc": 1721678092.0,
      "score": 116
    },
    {
      "id": "leg89cd",
      "body": "It’s not fully about sexuality though as I understood. Maybe she is just horny for human sapiens all together, but she wants to be a giant dick 😂😂😂",
      "created_utc": 1721685572.0,
      "score": 12
    },
    {
      "id": "lefclx0",
      "body": "💯 ",
      "created_utc": 1721675378.0,
      "score": 15
    },
    {
      "id": "legp4dh",
      "body": "this was literally how i figured out im a trans man hahaha. Never got past that feeling of missing out til i transitioned.",
      "created_utc": 1721691666.0,
      "score": 7
    },
    {
      "id": "leo6tpg",
      "body": "Agreed, I have shared the same thoughts as op but I'm 100% bi",
      "created_utc": 1721803787.0,
      "score": 3
    },
    {
      "id": "lejljcz",
      "body": "Alexa play Good Luck, Babe! by Chappell Roan",
      "created_utc": 1721742881.0,
      "score": 2
    },
    {
      "id": "lefdyv9",
      "body": "penvys",
      "created_utc": 1721675814.0,
      "score": 131
    },
    {
      "id": "leff5u9",
      "body": "Freud was onto something.",
      "created_utc": 1721676199.0,
      "score": 91
    },
    {
      "id": "lefzz8i",
      "body": "Also the name of a type of shroom.",
      "created_utc": 1721682790.0,
      "score": 15
    },
    {
      "id": "legl1ph",
      "body": "There's an entire list of things I'd do if I had one. I just want one day!!",
      "created_utc": 1721690149.0,
      "score": 30
    },
    {
      "id": "legjezj",
      "body": "Ahahaha same.",
      "created_utc": 1721689559.0,
      "score": 7
    },
    {
      "id": "leg3fx9",
      "body": "Same lmfaoo",
      "created_utc": 1721683941.0,
      "score": 16
    },
    {
      "id": "lefcpfg",
      "body": "Vj envy",
      "created_utc": 1721675409.0,
      "score": 78
    },
    {
      "id": "leh14dj",
      "body": "SOLD.",
      "created_utc": 1721696184.0,
      "score": 20
    },
    {
      "id": "lefcbi2",
      "body": "Yeah, I don’t want to be a man. I just want to know what it feels like!",
      "created_utc": 1721675285.0,
      "score": 68
    },
    {
      "id": "legjlzv",
      "body": "I just wanna know how it would feel like! Like just for one day. The good and the bad! I just wanna know what the experience feels like. \n\nThat said I *am* Nonbinary though, so idk if that plays into anything XD",
      "created_utc": 1721689631.0,
      "score": 12
    },
    {
      "id": "legakj8",
      "body": "Same here!! I feel like it might also tie into dominance play",
      "created_utc": 1721686392.0,
      "score": 5
    },
    {
      "id": "leflh2d",
      "body": "Just because you are a guy doesn't mean you can't get penetrated, my boy",
      "created_utc": 1721678215.0,
      "score": 230
    },
    {
      "id": "leh122w",
      "body": "*everything* women go through?\n\nYou're welcome to the debilitating period cramps too my dude haha",
      "created_utc": 1721696160.0,
      "score": 48
    },
    {
      "id": "lefoffd",
      "body": "As a vagina owner it is better to have a penis.",
      "created_utc": 1721679150.0,
      "score": 51
    },
    {
      "id": "lefapkc",
      "body": "Yep. \nExcept highkey same lol",
      "created_utc": 1721674766.0,
      "score": 39
    },
    {
      "id": "leg4384",
      "body": "These guys watch too much porn. Of course everyone is curious. But this chick is vehemently desiring the ownership of a schlong.",
      "created_utc": 1721684161.0,
      "score": 21
    },
    {
      "id": "leg1d5j",
      "body": "teeechnically ppl with vagina’s get them but not really",
      "created_utc": 1721683244.0,
      "score": 18
    },
    {
      "id": "lefrnvg",
      "body": "My thoughts too. Like how crazy",
      "created_utc": 1721680153.0,
      "score": 8
    },
    {
      "id": "lejo4bz",
      "body": "Well, it feels great\n\nUnless you got one just because you hit a pothole funny while driving and now your meat is getting scraped against your zipper",
      "created_utc": 1721743781.0,
      "score": 6
    },
    {
      "id": "lfg69jd",
      "body": "boners are super cool dude. i wish everyone could have a boner rn",
      "created_utc": 1722232612.0,
      "score": 3
    },
    {
      "id": "liiozfe",
      "body": "Hey you’re still alive :)",
      "created_utc": 1723868668.0,
      "score": 7
    },
    {
      "id": "lklzal8",
      "body": "I'm so happy you're still here ❤️",
      "created_utc": 1724984979.0,
      "score": 6
    },
    {
      "id": "llanmn3",
      "body": "Here from the depression thing, stay strong. Somebody loves you.",
      "created_utc": 1725366570.0,
      "score": 4
    },
    {
      "id": "lmcdv0z",
      "body": "Omg, you are still alive, happy you are here 💙",
      "created_utc": 1725918478.0,
      "score": 4
    },
    {
      "id": "lnsmz1u",
      "body": "glad to see your alive bro",
      "created_utc": 1726692843.0,
      "score": 2
    },
    {
      "id": "lo1yysg",
      "body": "heyy, just wanna say that I'm so proud of you !! ❤️",
      "created_utc": 1726841779.0,
      "score": 2
    },
    {
      "id": "lo3bs5b",
      "body": "Heyy you are sttill alive keep going",
      "created_utc": 1726857566.0,
      "score": 2
    },
    {
      "id": "lpjoxvq",
      "body": "Good job bro :) hope all is good",
      "created_utc": 1727641297.0,
      "score": 2
    },
    {
      "id": "lefdem4",
      "body": "[deleted]",
      "created_utc": 1721675635.0,
      "score": 77
    },
    {
      "id": "lehwzb1",
      "body": "“Slim w the tilted brim\n\nWhat’s my motherfckin name?”",
      "created_utc": 1721709696.0,
      "score": 2
    },
    {
      "id": "lef8iko",
      "body": "fr",
      "created_utc": 1721674069.0,
      "score": 24
    },
    {
      "id": "lehsfcq",
      "body": "Erect..",
      "created_utc": 1721707423.0,
      "score": 5
    },
    {
      "id": "les4bqa",
      "body": "op i’m afraid we’re literally the same person",
      "created_utc": 1721859305.0,
      "score": 3
    },
    {
      "id": "lej0izp",
      "body": "That's all it took, huh? Must be new here",
      "created_utc": 1721734137.0,
      "score": 7
    },
    {
      "id": "lek9450",
      "body": "And dudes want to be women so bad. What's your point?",
      "created_utc": 1721750594.0,
      "score": 5
    },
    {
      "id": "lela00u",
      "body": "Yeessss!! ❤️❤️❤️",
      "created_utc": 1721762168.0,
      "score": 2
    },
    {
      "id": "leg5xig",
      "body": "Based",
      "created_utc": 1721684781.0,
      "score": 2
    },
    {
      "id": "leg1qi7",
      "body": "There is:\nr/Ijustwanttobeafloatingcockthatfuckspeople",
      "created_utc": 1721683367.0,
      "score": 444
    },
    {
      "id": "lezg5o5",
      "body": "Dickle Rick",
      "created_utc": 1721967176.0,
      "score": 2
    },
    {
      "id": "lefrjxl",
      "body": "girl i wish i could detach mine",
      "created_utc": 1721680118.0,
      "score": 228
    },
    {
      "id": "legbfmy",
      "body": "I want to be able to urinate anywhere I want and be on the other end of penatration. I want to adjust myself in public with ZERO shame. I would probably have to take a couple of weeks off because I'd be so busy playing with it.",
      "created_utc": 1721686702.0,
      "score": 96
    },
    {
      "id": "leiha5a",
      "body": "Dude this is the perfect way to describe it. I told my husband I am absolutely secure and sure that I am a woman. I love my femininity and everything about being a woman and absolutely embrace all parts of me. That being said I WANT A DETACHABLE DICK SO BAD! My husband has the cutest ass and I wanna go at it so bad!!!!",
      "created_utc": 1721722102.0,
      "score": 21
    },
    {
      "id": "legii9c",
      "body": "Literally yes!",
      "created_utc": 1721689228.0,
      "score": 7
    },
    {
      "id": "leh4alk",
      "body": "Literally same 😩😂😂 I still want my vagina but I wanna go between the two 😭😂😂",
      "created_utc": 1721697402.0,
      "score": 5
    },
    {
      "id": "lei64dw",
      "body": "yeah. im a trans woman who had bottom surgery and yeah i couldnt live with it 24/7 but ngl i would NOT decline getting a detachable sensate strap for sex lmfaoo",
      "created_utc": 1721714875.0,
      "score": 2
    },
    {
      "id": "lefeja8",
      "body": "[deleted]",
      "created_utc": 1721675996.0,
      "score": 117
    },
    {
      "id": "lefleso",
      "body": "yes! i’m just not super into penetrative pleasure, i have endo so it’s mostly uncomfortable :( i want to feel the warmth and tightness sensation!",
      "created_utc": 1721678195.0,
      "score": 46
    },
    {
      "id": "leg5a2k",
      "body": " Brosef, same. Like, if I could get a trial run at being a girl that would be fuckin’ rad. Like, really genderfluid: one day im a dude with all the dude parts, the next I’m a dudette with all the dudette parts. \n\nCome on, science, goddamnit!",
      "created_utc": 1721684560.0,
      "score": 120
    },
    {
      "id": "leg0pzz",
      "body": "horny sub girl: you feel desired, powerless and powerful at the same time if you're the type to observe a man. its complete trust (for some)\n\nlooking at men: i focus on their walk, their upper brow, love it when they're serious. i think of what would it be like to have them in my embrace. my arms? be their object of their desires. \n\nhands, shoulders, arms, thighs. how a man is built? tall men, kind men, nice men, friendly, idk i love men",
      "created_utc": 1721683032.0,
      "score": 87
    },
    {
      "id": "leg6mq3",
      "body": "Horny and submissive girl can tell you I feel like a kitten getting carried around in its mama mouth. Love stoned for sure or cum drunk to point of staggering.",
      "created_utc": 1721685017.0,
      "score": 19
    },
    {
      "id": "lej7dai",
      "body": "It depends you might get horny thoughts about them doing the deed with you.\nYou focus on their looks and body",
      "created_utc": 1721737338.0,
      "score": 2
    },
    {
      "id": "lefehxm",
      "body": "im so jealous...like i wanna feel how dudes feel when they are around a girl they really like or love. will my dick get hard from her presence? her smile? IM JEALOUS",
      "created_utc": 1721675985.0,
      "score": 234
    },
    {
      "id": "leg0528",
      "body": "OMG I FORGOT WHEN THEY FLEX IT!!! weird af and terrifying but soo cool",
      "created_utc": 1721682842.0,
      "score": 11
    },
    {
      "id": "lefwes4",
      "body": "Not witchcraft. We just use similar muscles that women do when they do kegels.",
      "created_utc": 1721681646.0,
      "score": 7
    },
    {
      "id": "lehafix",
      "body": "What the hell is \"the helicopter\"? That's a thing in sex?? 🤔",
      "created_utc": 1721699780.0,
      "score": 3
    },
    {
      "id": "lefni80",
      "body": "I don't think I'll ever not have a visceral reaction to a sentence starting with \"It's bloody\" and talking about a penis.",
      "created_utc": 1721678860.0,
      "score": 59
    },
    {
      "id": "lefms8m",
      "body": "Oh I bet. I’ve watched my brother & dad pee anywhere they needed to. Eg. anywhere in the backyard, in the forest while camping, on the side of the road, outside at work, the list goes on 😀",
      "created_utc": 1721678628.0,
      "score": 17
    },
    {
      "id": "lefn6t5",
      "body": "Idk if this is inappropriate, but what events transpired to make you a former penis haver?",
      "created_utc": 1721678757.0,
      "score": 18
    },
    {
      "id": "left5kg",
      "body": "The sacred words have been spoken",
      "created_utc": 1721680624.0,
      "score": 135
    },
    {
      "id": "lefkh2y",
      "body": "Yes",
      "created_utc": 1721677904.0,
      "score": 38
    },
    {
      "id": "lefnbv8",
      "body": "As my (mostly lesbian) friend says, she would fuck a guy but would never brush her teeth next to a guy",
      "created_utc": 1721678803.0,
      "score": 171
    },
    {
      "id": "lefmg1h",
      "body": "Nah not really, romantic attraction and sexual attraction are both separate and valid, and if you're homo in at least one of them you're bi lol",
      "created_utc": 1721678522.0,
      "score": 76
    },
    {
      "id": "lefq3il",
      "body": "So you’re possibly Pansexual because you’re sexually attracted to people regardless of their gender and Homoromantic as you have romantic attraction towards people of the same gender. 🤷‍♀️",
      "created_utc": 1721679660.0,
      "score": 63
    },
    {
      "id": "lefy7ll",
      "body": "I totally get it too. I feel the same way, but at the same time I don't really feel the need to identify with any specific word for it? I must like \"yeah that's kinda hot and cool!\"",
      "created_utc": 1721682217.0,
      "score": 6
    },
    {
      "id": "lehe8od",
      "body": "You...you do know that there's a difference between romance and sexuality, right? Like you can be bisexual while also being homo-romantic?",
      "created_utc": 1721701283.0,
      "score": 3
    },
    {
      "id": "leg3h35",
      "body": "I was looking for Freud comment. Glad I found it!",
      "created_utc": 1721683952.0,
      "score": 38
    },
    {
      "id": "lei2vqp",
      "body": "Vagvy ",
      "created_utc": 1721712967.0,
      "score": 11
    },
    {
      "id": "lefffmp",
      "body": "I think maybe its because we can feel the love we have for the other in most ways but that way, of course we experience it together but not in the same way. Just wanna love him in all ways. I feel like this is the womans version of being a munch.",
      "created_utc": 1721676287.0,
      "score": 32
    },
    {
      "id": "lefll7c",
      "body": "I know, but it’s not really the same",
      "created_utc": 1721678251.0,
      "score": 17
    },
    {
      "id": "lehpjyi",
      "body": "And childbirth!",
      "created_utc": 1721706079.0,
      "score": 15
    },
    {
      "id": "lefrthr",
      "body": "[deleted]",
      "created_utc": 1721680202.0,
      "score": 7
    },
    {
      "id": "lefomsq",
      "body": "Why do you think so?",
      "created_utc": 1721679212.0,
      "score": 3
    },
    {
      "id": "lefw7sm",
      "body": "As a dick owner, I agree.",
      "created_utc": 1721681585.0,
      "score": 2
    },
    {
      "id": "lefb5f5",
      "body": "I don't get why people try to lie to themselves so bad. \"I want to fuck women but am 100% straight\" yea okay buddy lmao let a guy say that and NO ONE will endorse him claiming to be straight.",
      "created_utc": 1721674908.0,
      "score": 59
    },
    {
      "id": "lejoyik",
      "body": "Nope this was just the last straw lol",
      "created_utc": 1721744068.0,
      "score": 3
    },
    {
      "id": "leg8urg",
      "body": "I'm disappointed it's not to be honest",
      "created_utc": 1721685785.0,
      "score": 268
    },
    {
      "id": "lefviz3",
      "body": "There is a song called Detachable Penis by King Missile",
      "created_utc": 1721681369.0,
      "score": 165
    },
    {
      "id": "legjlex",
      "body": "Just because we're guys, that does NOT mean we can urinate anywhere. There are laws regarding peeing in public lol. Adjusting yourself in public would also be frowned upon. As far as being on the other end of penetration, it's great. Not even gonna lie. I love the feeling of, well, entering the woman, and her reacting to the penetration. And yea, you'd have to take some time off, otherwise it will chaff, and I AM speaking from personal experience lol",
      "created_utc": 1721689625.0,
      "score": 43
    },
    {
      "id": "lf7z3xe",
      "body": "Most men have shame adjusting ourselves in public. We can't just pee anywhere either.",
      "created_utc": 1722103566.0,
      "score": 2
    },
    {
      "id": "lei95ux",
      "body": "It's also simply called a \"strapless strapon\" btw ^ Feeldoe is a brand. There's a lot of them with different sizes of bulbs, so they work with different bodies. Some people need a bigger bulb. Slipping out is a real problem though 🥲",
      "created_utc": 1721716756.0,
      "score": 19
    },
    {
      "id": "leixnav",
      "body": "I know a trans woman who's tried one of those and apparently it's very close to how it felt to use her original equipment.",
      "created_utc": 1721732636.0,
      "score": 5
    },
    {
      "id": "leh6aqg",
      "body": "Ah the stabby knife penis hitting the cervix.",
      "created_utc": 1721698170.0,
      "score": 5
    },
    {
      "id": "leghlms",
      "body": "Cool username.\n\nI feel like it would be such an informative experience.\n\nOne thing I think about a lot is how my habits might have to change.  How would strangers treat me differently?  Could I still go running in the park at dawn? \n\nHow am I going to get myself a decent boyfriend? Men are dangerous to me now?  \n\nNot to mention having had sex with both parts, you'd have to pick up new good tricks in bed I'd think?\n\nLol, it's all so interesting to me.  Like there's this whole part of the world I'll never really be able to see.",
      "created_utc": 1721688904.0,
      "score": 38
    },
    {
      "id": "legfoz3",
      "body": "I wasn't expecting actual good faith responses from women.  Thank you!\n\nI was particularly interested to read \"be the object of their desire\" I kind of expected something like that, but to hear it unsolicited in your own words felt a little enlightening. Felt that made things a little easier to imagine.\n\nBecause i guess, I see my sexuality as almost entirely external.  I'm rarely thinking of myself at all, or how I look or wanting to be looked at.  I see that attractive person, and it's quite difficult to NOT look, it's a focusing feeling, and a sense that I'm pulling back on my own reigns.  I want to walk right over there, and all other thoughts begin to become deadened, except \"You need to go over there right now\"  as well as a disarming feeling like, I should bring her something, share my stuff.\n\nI really hesitated to say this part but there also a kind sense of invincibility, power, and a that focusing sensation comes with a desire to...dominate, chase...? It's a little difficult to describe, and it's hard to find words for it that sound civilized.",
      "created_utc": 1721688222.0,
      "score": 38
    },
    {
      "id": "lejp1k7",
      "body": "Definitely think about how it would feel being held by them if they have nice arms. I look at their face and imagine them staring at me while having sex, like would I be into that face if we were fucking? Sometimes that is where I say no.",
      "created_utc": 1721744096.0,
      "score": 7
    },
    {
      "id": "leggodv",
      "body": "I don't know if you're into bdsm, but this sounds a lot like what I've heard partners call \"sub space\".  I've been told it kind of feels like becoming a child again for a time, like what you said, and a sort of sense of complete trust.\n\nFascinating.  It's difficult for me to wrap my head around the trust part, but I suspect that's because I'm sort of equal oppsite.  Desiring a sense of power and control for the same duration.\n\nThank so much for the response.  I really wasn't expecting real women to answer my questions.",
      "created_utc": 1721688577.0,
      "score": 10
    },
    {
      "id": "lehb0r1",
      "body": "Like how you get paralyzed by it all and just melt in their grip \nYummmm",
      "created_utc": 1721700007.0,
      "score": 12
    },
    {
      "id": "leffa1i",
      "body": "The answer is yes. If you’re around a girl you have crush on, even a simple touch will make it rock hard. Especially in teenagers. As you grow old, you may get insensitive to simple touches.",
      "created_utc": 1721676237.0,
      "score": 161
    },
    {
      "id": "legfj9i",
      "body": "Yeah, a simple touch can usually get a guy to go stiff, it's a lot more common as a teenager, but even as an adult, it doesn't take much.  \nIf you like a girl, don't ever let her sit on your lap, there's little to no way of stopping your dick from getting stiff, the whole \"think of something disgusting\" rarely if ever works.  \nI've had cases back when I was a teen where I got so hard that it literally felt painful to still have my pants buttoned up",
      "created_utc": 1721688165.0,
      "score": 28
    },
    {
      "id": "legb4bm",
      "body": "From what I’ve learned women don’t find that too appealing 🤣🤣",
      "created_utc": 1721686589.0,
      "score": 12
    },
    {
      "id": "lejngrx",
      "body": "I imagine it’s like they get butterflies but in their dick",
      "created_utc": 1721743556.0,
      "score": 4
    },
    {
      "id": "leg94ba",
      "body": "yes",
      "created_utc": 1721685879.0,
      "score": 2
    },
    {
      "id": "leg4of2",
      "body": "My boyfriend did it recently and I was in total shock it was amazing 😭 he literally just made eye contact and did it like it was nothing",
      "created_utc": 1721684358.0,
      "score": 4
    },
    {
      "id": "lehcucr",
      "body": "It's not a thing in sex, no. \n\nThink about it bro. Lol.\n\nIt's like me saying if I had tits all I would do all day is jump up and down in front of a mirror and watch them bounce. \n\n... Which now that you mention it does sound sort of tempting...",
      "created_utc": 1721700727.0,
      "score": 6
    },
    {
      "id": "leg9lrk",
      "body": "watched?🤨",
      "created_utc": 1721686050.0,
      "score": 21
    },
    {
      "id": "lefrsf1",
      "body": "You’re fine. I think the question is honest and in good nature. \n\nive had body dysmorphia from a young age. I just felt like the penis was not mine, and for years I struggled with it, the dissociation and all that. So, I had vaginoplasty surgery. \n\nHowever, I can still understand the penis envy component. It sure is practical, that’s for sure. I hope I answered you satisfactorily!",
      "created_utc": 1721680193.0,
      "score": 23
    },
    {
      "id": "leg22xp",
      "body": "This was written by a true poet",
      "created_utc": 1721683483.0,
      "score": 54
    },
    {
      "id": "leg100f",
      "body": "This is the one.",
      "created_utc": 1721683123.0,
      "score": 17
    },
    {
      "id": "lefsxi4",
      "body": "i can buy that! thank you",
      "created_utc": 1721680553.0,
      "score": 31
    },
    {
      "id": "lehssoc",
      "body": "yes",
      "created_utc": 1721707602.0,
      "score": 3
    },
    {
      "id": "leh9mlq",
      "body": "what's the context",
      "created_utc": 1721699466.0,
      "score": 4
    },
    {
      "id": "lej6zrz",
      "body": "Slay",
      "created_utc": 1721737175.0,
      "score": 3
    },
    {
      "id": "lefu23x",
      "body": "if you’re amab don’t you already have a prostate..?\n\nvaginas might feel good to have during sex but i assure you having a period is absolutely not worth it",
      "created_utc": 1721680910.0,
      "score": 63
    },
    {
      "id": "lefqw47",
      "body": "The only good thing about not having a pp is ✨leggings✨",
      "created_utc": 1721679910.0,
      "score": 33
    },
    {
      "id": "legqrzn",
      "body": "Ikr just be bi fr edit: or pan",
      "created_utc": 1721692285.0,
      "score": 10
    },
    {
      "id": "legeq0d",
      "body": "Sounds like an opportunity.",
      "created_utc": 1721687874.0,
      "score": 87
    },
    {
      "id": "lehiwt2",
      "body": "Be the change.",
      "created_utc": 1721703178.0,
      "score": 6
    },
    {
      "id": "leglnut",
      "body": "Just introduce that to my girlfriend last week 😆",
      "created_utc": 1721690370.0,
      "score": 32
    },
    {
      "id": "leg9gsi",
      "body": "Classic song.",
      "created_utc": 1721686000.0,
      "score": 26
    },
    {
      "id": "lehidpm",
      "body": "I read King Missile and my brain added & the Lizard Whistle",
      "created_utc": 1721702956.0,
      "score": 4
    },
    {
      "id": "legm3ih",
      "body": "so you’ve neeeever pissed outdoors? 🤨\n\ncause we’re talking about being able to piss outdoors with ease.",
      "created_utc": 1721690527.0,
      "score": 45
    },
    {
      "id": "lekh4i0",
      "body": "i've never liked to stare or look at someone during sex yet it sounds amazing. i wonder how i look to them",
      "created_utc": 1721753135.0,
      "score": 5
    },
    {
      "id": "lejw041",
      "body": "I’ve been married almost 21 years. I have only ever experienced this with my hubby very recently. I’m 42.",
      "created_utc": 1721746415.0,
      "score": 3
    },
    {
      "id": "lefgfg5",
      "body": "dude i get horny from standing close to a dude i have a crush on...am i like a man?! lol.\n\nOH MY GOD THATS COOL. does that mean (i know but wish to confirm) that men are actually more sensitive than women when it comes to liking someone?",
      "created_utc": 1721676608.0,
      "score": 90
    },
    {
      "id": "lekh6q2",
      "body": "this wins. i have to ask now",
      "created_utc": 1721753154.0,
      "score": 2
    },
    {
      "id": "leg5qaz",
      "body": "It’s the same as women ‘flexing’",
      "created_utc": 1721684713.0,
      "score": 6
    },
    {
      "id": "leolcbd",
      "body": "that would hurt",
      "created_utc": 1721813569.0,
      "score": 3
    },
    {
      "id": "leg9rwt",
      "body": "Yeah watched the back of them while they freely peed with their willy",
      "created_utc": 1721686111.0,
      "score": 7
    },
    {
      "id": "lefslt2",
      "body": "That makes sense. Thank you for answering! I hope you have peace in your body now.",
      "created_utc": 1721680451.0,
      "score": 21
    },
    {
      "id": "legcifa",
      "body": "This is an amazing answer. I’ve wondered this question so many times. I have a trans friend who I’m semi-close to. I was the first person she came out to which like wow the biggest honor ever. I’ve never felt more trusted in my life 😭 I just am not sure if I can ask her all my questions because I don’t want to hurt her. \n\nThank you for answering this in a gentle way to help those of us who want to support you be better able to offer support.",
      "created_utc": 1721687086.0,
      "score": 11
    },
    {
      "id": "lehkhed",
      "body": "Freud was a neurologist who has some theories that were pretty “out there” to say the least lol. One of them being “penis envy,” a psychosexual developmental stage referring to the theory of how girls have the desire for, or feel envious about not having male genitals.",
      "created_utc": 1721703844.0,
      "score": 8
    },
    {
      "id": "leg3dma",
      "body": "Can confirm that having a mooseknuckle is not super attractive (albeit funny)",
      "created_utc": 1721683919.0,
      "score": 5
    },
    {
      "id": "leh44xv",
      "body": "[removed]",
      "created_utc": 1721697342.0,
      "score": 24
    },
    {
      "id": "lerw5tl",
      "body": "I made it. Go hunting.",
      "created_utc": 1721856501.0,
      "score": 3
    },
    {
      "id": "legr1mt",
      "body": "Or just standing comfortably while peeing anywhere. Like the port a potty squat is something else when you have to pee bad",
      "created_utc": 1721692386.0,
      "score": 39
    },
    {
      "id": "legrdem",
      "body": "I've certainly pissed outdoors, but not just \"anywhere\". I do use discretion, and do it out of sight of anyone.",
      "created_utc": 1721692507.0,
      "score": 18
    },
    {
      "id": "lelf7cn",
      "body": "It would really change my camping game",
      "created_utc": 1721763814.0,
      "score": 2
    },
    {
      "id": "lejx270",
      "body": "Also, I’m a charge nurse making difficult decisions daily. I need not be in charge in bed. I don’t even want that responsibility.",
      "created_utc": 1721746760.0,
      "score": 4
    },
    {
      "id": "lefqv2m",
      "body": "I’d like to say that they are.",
      "created_utc": 1721679900.0,
      "score": 35
    },
    {
      "id": "leg5hh8",
      "body": "Their ability to get turned on around most women has very little to do with ‘being more sensitive to liking women’ The right breeze can get a dude hard, it doesn’t make it emotional.",
      "created_utc": 1721684630.0,
      "score": 36
    },
    {
      "id": "leikfdy",
      "body": "I would say no only because for guys (under 20 here I mean) basically any remotely attractive woman touching him could do it. If it's his crush then for sure, but there's no way to know without asking him, but that would be mega embarassing.",
      "created_utc": 1721724245.0,
      "score": 2
    },
    {
      "id": "lel7a3w",
      "body": "We legit get butterflies because we are so ready for an intimate encounter. But without being able to stop it....we \"physically show it\" we are taught at a younger age that is a bad thing. From my experience...fuck it...let them know. But, I'm also 37, so..take that for what it's worth.",
      "created_utc": 1721761298.0,
      "score": 2
    },
    {
      "id": "leggz5b",
      "body": "Exactly, it's literally the same as the kegel muscle.",
      "created_utc": 1721688686.0,
      "score": 4
    },
    {
      "id": "lephalh",
      "body": "Haha. Yes. \n\nThis is why none of us have ever done the \"helicopter\".\n\nI don't even know how you ladies even came up with that lol.",
      "created_utc": 1721828898.0,
      "score": 2
    },
    {
      "id": "legofen",
      "body": "still weird",
      "created_utc": 1721691407.0,
      "score": 4
    },
    {
      "id": "left3a8",
      "body": "Indeed. Happy to have joined the non-penis having side of the fence 😂 \n\nI appreciate your courage in daring to ask!",
      "created_utc": 1721680604.0,
      "score": 17
    },
    {
      "id": "leginic",
      "body": "I think if you’re convinced she knows your character, then you might have more freedom than you think with asking what you’re curious about :) for me, it’s all about the person’s intentions behind the question… I know for many people, it’s an unfamiliar subject to pose questions about, so I give lots of grace with that. Ask away ",
      "created_utc": 1721689282.0,
      "score": 6
    },
    {
      "id": "leh5bat",
      "body": "DOOOO IT!!!!!!!!!",
      "created_utc": 1721697791.0,
      "score": 16
    },
    {
      "id": "legsh7t",
      "body": "exactly, it’s pretty difficult to do as a woman. the squat requires skill if you don’t wanna piss all over yourself.",
      "created_utc": 1721692919.0,
      "score": 26
    },
    {
      "id": "leftw0j",
      "body": "i think so too, men can have a sensitivity a vulnerability that i cant find in women. i fall in love with men and not women even though im bi lol",
      "created_utc": 1721680856.0,
      "score": 35
    },
    {
      "id": "lei79fy",
      "body": "When I was going through puberty i remember going over bumps in a car would get me hard lol. I mean i went to a Lutheran middle school and during church when the pastor would say “Let’s rise and pray”…boioioioooooing! Pop goes the weasel in church, with khaki pants on and the girl I’m crushing on might be one row in front of me, please god don’t let anyone look at me oh shit pleasepleaseplease 🙏 lol. I almost forgot about all that awkwardness until I read this post.",
      "created_utc": 1721715578.0,
      "score": 2
    },
    {
      "id": "legkbn5",
      "body": "☝️ This for sure lol",
      "created_utc": 1721689890.0,
      "score": 2
    },
    {
      "id": "levjou0",
      "body": "There isn't a \"kegal muscle.\" Keagle exercises are what you do to strengthen the muscles of the pelvic floor. That muscle group is called the levator ani and it is made up of three separate muscles, the pubococcygeus, the puborectalis and the iliococcygeus. (This will not be on the final exam.)",
      "created_utc": 1721917714.0,
      "score": 2
    },
    {
      "id": "levjltl",
      "body": "lol true thats a good comparison",
      "created_utc": 1721917687.0,
      "score": 3
    },
    {
      "id": "legotub",
      "body": "Bffr. I’m not staring them down. I’ll see the direction they walk in and normally look away.",
      "created_utc": 1721691558.0,
      "score": 14
    },
    {
      "id": "legj32y",
      "body": "She does. She knows I’m 100% supportive. I’m just super cautious. I’m an older white cis woman so I try to keep my privilege in check kwim? I’m bi, but I’m also in a passing relationship so I haven’t experienced the hardships others have experienced. I wouldn’t say I tiptoe, but I want to be sensitive if that makes sense? \n\nI should probably ask questions though since it would help me be better able to support her and the rest of the community.",
      "created_utc": 1721689440.0,
      "score": 7
    },
    {
      "id": "leh3vgd",
      "body": "That is one thing I do NOT envy about a woman. I am quite content on unzipping my fly, and doing my business without having to squat 😁😉",
      "created_utc": 1721697240.0,
      "score": 12
    },
    {
      "id": "lefx0v1",
      "body": "Same",
      "created_utc": 1721681841.0,
      "score": 7
    },
    {
      "id": "ley250p",
      "body": "Ah that is interesting, thank you. I didn't know the specifics.",
      "created_utc": 1721946802.0,
      "score": 2
    },
    {
      "id": "lek2k1a",
      "body": "hey now, you’re the one who chose to phrase it as “I’ve watched my brother & dad pee”",
      "created_utc": 1721748521.0,
      "score": 2
    },
    {
      "id": "leihy4w",
      "body": "Ngl, there isn't much to envy about a women. Our bodies are spectacular to look at but with hormone fluctuations and the time of the month (to name a couple of issues), hard has a whole different meaning to us 😫",
      "created_utc": 1721722552.0,
      "score": 2
    },
    {
      "id": "leyn69t",
      "body": "You’re welcome. I took way too much biology in college for a non major.",
      "created_utc": 1721954785.0,
      "score": 2
    }
  ]
}