{
  "id": "1f6tn0f",
  "title": "I think my husband fathered his best friend's children, and now one of them is attracted to my daughter. ",
  "selftext": "(All names are fake.) This began as a dark, intrusive thought that I could never shake off, and over the years it has bloomed into a poison flower that infects my entire psyche. \n\n\n\nI’m a forty-two year old woman. My husband “Luke” is 43, and so is “Amy.” I met Luke in college, but he’s known Amy since they were about 7. They did everything together and understood each other implicitly. They were best friends. They’ve always insisted that they are surrogate siblings to each other. \n\n\n\nNaturally I, as a new girlfriend, felt a little threatened by Amy and her closeness to Luke, but they both reassured me I had nothing to worry about. That their bond was not romantic and had never been sexual. That Amy really was just the sister that Luke never had. I believed them, and it didn’t take long for me to forget any and all insecurity I had about Amy. She became my friend too. She officiated our wedding. \n\n\n\nLuke and I have built a wonderful life together and we always had a strong relationship. After we got married and moved in together, we still saw a lot of Amy, and I was fine with that. I’ve passed many a night on the town trying to help Amy find a man, as she has always lamented how she is unlucky in love. Luke and I started to have children after we were married, and, at around the same point, so did Amy. \n\n\n\n*For further context, my children are Sophie, (15) Owen, (12) Louise, (10) and Carter (6)* \n\n\n\n*Amy’s children are Tom, (17) Kaylee, (14) and twins, Adam and Jenna, (9)* \n\n\n\nNow, Amy was not in a relationship at this point. She was not married. As far as I knew, she was “dating” but not consistently. As Luke and I had more kids and our family grew, periodically Amy would find herself pregnant as well. It happened a few times, and Luke and I never knew anything about the father(s) in question. I kind of assumed that maybe Amy was sleeping around and not keeping in contact with her one-night stands. Luke agreed this was probably the answer. While I did ask each time if Amy knew the paternity, she always said no, and she didn't seem that worried about the idea of raising kids on her own, so I didn’t pester her. \n\n\n\nOf course, she had us to support her, so there was that. While Amy never asked for any help, of course Luke was never going to let his best friend struggle to stay afloat when she had children to raise. Financially, we are very fortunate and privileged. I have a job that pays handsomely and Luke also had wealthy parents who already knew and loved Amy, so they were happy to provide for her. (My in-laws defy all stereotypes, they are the kindest and gentlest people.) So we were able to support Amy. To get her somewhere to stay with her kids. People might be tempted to call her a leech, but I never saw it that way. None of us did. She needed help and we could provide it. \n\n\n\nI also know people are going to criticize her for her lack of responsibility and question why she never used more reliable birth control. Honestly? That is a long story that I don’t want to get into because even I don’t fully understand her reasoning, but it was quite important to her that she never be on birth control and that whatever came of that choice, she would accept. It wasn’t religiously motivated, I know that, but it was that degree of significance to Amy. She really did not want to take birth control. She’s explained it to me more than once but I’m still not clear on why. \n\n\n\nOf course, Amy being Luke’s best friend since they were kids, it’s not unreasonable that sometimes they hang out together while I’m not there. Hey, that’s fine. Sometimes I hang out with Amy one-on-one as well, though Luke does it more. She was his friend first. This included him going over to where she was staying and at times, sleeping over there. Was I a fool to trust him and believe nothing was going on? Perhaps. But for years, they presented as being “buddies.” Like siblings. I didn’t pick up on any vibes between them, not ever. As one can expect, our children were brought up together. Not in the same house, (our home is decently sized but even we don’t have the room for eight kids.) But we made sure Amy’s children met ours from a young age, and they always got along and strong bonds of friendship have formed over the years, which is good. Especially if I’m right, and they share blood. \n\n\n\nI’ve been dawdling getting to the main point. Yes. I have come to suspect that Luke fathered at least one of Amy’s kids, if not all of them. Frankly, I do suspect they are all his. I would never have believed my husband to be capable of such a thing, and he’s given me no indication that he is the unfaithful sort. But he does spend a lot of time with Amy, and I have to confess I cannot remember seeing her with any real boyfriend over the years. She would talk to men at bars and parties, I would try to be her wing-man, and so on. But nothing ever seemed to really happen, so when she got pregnant the first time, I was curious. When it happened again, and again, I began to wonder if she had some sort of secret fella who she didn't want us to know about for whatever reason. But I couldn’t think of any reason why she would hide him, especially from her children. \n\n\n\nAfter Carter, our youngest, was born, Luke and I agreed that the time had come for him to have a vasectomy. Amy’s twins had come just a couple of years prior. Of course, after the procedure, Luke and I continued to make love but I no longer had to think about pregnancy. Meanwhile, Amy never got pregnant again, after the twins. Is it a coincidence that Luke had a vasectomy and then both of us stopped getting pregnant? I don’t know. But Luke would still visit her, and he wasn’t just going to see her, but checking up on her children as well. In general, I should have paid more attention to it sooner, but Luke has always acted like a father to them, especially as they’ve gotten older. He’s the father they never had. He doesn’t neglect me, or our children, not one bit. He’s doing double duty. On its own, the idea that he is a surrogate father to Amy’s fatherless children isn’t inherently suspicious. One could call it noble. But it combines with a lot of other little things. \n\n\n\nThere is appearance as well. I won’t go into specifics of hair color, eye color, or unique physical traits, because I’d rather limit the identifying factors of the people involved and keep this whole thing as vague as possible. But suffice it to say, Amy’s children…they certainly look like they could be Luke’s. Kaylee has a very unusual allergy that Luke also has. The twins look very much like him - Adam in particular. The older Tom has gotten, the more of Luke I can see in his face and personality. While their race doesn’t matter, the reality is that Luke is a different race than Amy, and Amy’s children look pretty biracial. I could easily believe their father is the same race as Luke. Doesn’t mean Luke has to be the father, but…it sure seems like it. \n\n\n\nI have never voiced my anxieties to either Amy or Luke. I don’t want to be the “bad guy” and, guilty or innocent, I already know they would flatly deny my accusations and be hurt by them. Imagine if that drama reached the ears of my kids, or Amy’s kids? Either way, Luke continues to spend time with Amy and her children, just as her children spend time with mine. I have hinted to Luke that I feel needy for more attention and wish he wouldn’t give as much to Amy. But he either missed my cues or pretended that he missed them. I don’t want to push this idea that he’s favoring her, because it’s not even really true. He’s never neglected me for her. I just. I can’t shake the feeling that Luke and Amy have been intimate before, likely numerous times. \n\n\n\nSo far as I know, Amy never really wanted to be a mother, either. She wasn’t opposed to it, and when each of her children came into the world she instantly fell in love with them, but motherhood was never really a major part of her life plan or identity. In the grand scheme of things, when we would talk about the future, she would sometimes mention a husband and children, but it never seemed like something she had her heart particularly set on. So like, I don’t think this is a case of Luke just “giving” Amy children, I doubt that was the motive for the infidelity. That would have been a side-effect. \n\n\n\nI’ve been letting this go and turning a blind eye for years. It was a dark thought in the back of my mind after Kaylee's allergy was discovered, but I dismissed it. Got worse after the twins were born. I dismissed it. Then, when Amy stopped having babies, I wanted to feel reassured by that. But, Luke had gotten a vasectomy, so if anything, that made my anxiety worse. There have been nights that I wished the twins were younger, that they had come along after Luke’s procedure. It’s been twisting me into knots for a long time, but I don’t want to be the one who rips our family apart especially since, technically, I could be wrong. \n\n\n\n**Except now I’m very afraid, because in the last few months we’ve had a new development in our kids’ social circle.** \n\n\n\nTom, Amy’s eldest, asked Sophie out. Sophie, my eldest. She’s really blossomed over these last few years and become quite the outspoken beauty, so I’m not shocked to see she’s getting male attention, but Tom asking her out had me thrown. Sophie said no, but only because I’m quite protective when it comes to her exploring dating, and she knew she’d have to ask me first. I could tell she was flattered and intrigued by his interest and wanted to say yes. She approached me to talk to me about it, bless my girl, she did everything right. I think she expected I would see things her way and agree that she could date Tom. Much to her surprise, I very firmly said no. That caused a bit of conflict. She didn’t even want to date him that badly, she just couldn’t understand why she wasn’t allowed to. And I couldn’t explain it to her. All I could come up with was “He’s too old for you” which he is, but it’s not really about that. \n\n\n\nWhen Amy and Luke heard, I was so very curious to see what their reactions would be. If either of them had agreed with Sophie and tried to convince me that the two of them should be allowed to date, I think I would have been relieved and taken that as proof that I was wrong about something going on between them. Wrong about who fathered Amy’s children. But, the ambiguity continued. They took my side. Both of them put their foot down, though not as fiercely as I did. Luke agreed with me, but he also worried that trying to forbid such a romance would only make Sophie want it more. He’s probably right about that. Amy seemed more apathetic to the idea. She didn’t want Tom to date Sophie either, and she backed me up, but I don’t know, she just wasn’t taking it as seriously. She seemed to think it was a fleeting crush. \n\n\n\nWell, it wasn’t. In the months following those conversations, Tom would spend more and more time with Sophie. They would be alone (or with “other friends”) any time they possibly could. It’s become abundantly clear that Tom is crazy about Sophie and wants to be with her. (And he definitely wants to be physical, I’ve been watching them like a hawk and noticed his eye wandering many times.) And while I’m doing everything I can to kill this budding romance in the crib, I also am feeling somewhat powerless. Sophie hasn’t outwardly defied me, she’s still just hanging out with Tom “as friends.” So forcing them to stop spending time together would be unreasonable, and probably encourage more sneaking around. But I’m so afraid that they’re already doing that. My nightmare is that they’re secretly dating, and doing god knows what when no one is looking. (I’ve observed Tom being rather handsy with Sophie, and she presents no objection whatsoever.) And I just don’t know what to say. I had considered trying to convince Sophie that Tom is “like” her brother, but if she doesn’t see him that way, I don’t really have the power to rewrite their emotional dynamic or the history of their friendship. I always saw Amy and her children as being like family, but my kids might see Amy’s kids more as “best friends.” \n\n\n\nThe problem is, of course, that if my husband has indeed been carrying on an affair over the years and I’m right about the paternity of Amy’s children, then Tom and Sophie cannot be anything more than friends under any circumstances, end of discussion. It can never happen. I feel powerless to stop it, though. Luke has apparently “talked” to Tom about this, as has Amy, but he is unrelenting and he won’t give up on Sophie. I think she enjoys that attention and devotion. Tom has also confronted me and asked why I’m so against this when I know him very well and I know he would be good to Sophie. I didn’t know what to say other than to fall back on her being too young for him. But that won’t work forever. If, god forbid, they’re still attracted to each other in a few years, then they’ll pursue this with abandon and once they’re legal adults, there’s nothing I can do about it. \n\n\n\nAmy and Luke agree with me that Tom cannot date Sophie, but that’s all they’ve really done. They feel just as powerless as me to prevent “teen love.” It genuinely feels sometimes like they’ve just given up and will bury their heads in the sand about this. Just do nothing and hope the feelings pass as Tom and Sophie get older. Which, yeah, they’re in high school. It’s unlikely Tom will be in love with Sophie forever. But my fear is that she’ll let him do something intimate with her before that time comes, something neither of them can take back. I am this close to opening a door I cannot close, this close to screaming at Luke that all this wouldn’t be happening if he hadn’t cheated on me these many years. If he hadn’t been all but raising a second family with his “surrogate sister” behind my back. Now Luke’s son wants to fuck our daughter, his ACTUAL sister, because as far as he knows, she’s just his childhood friend. And it’s all Luke and Amy’s fault for what they’ve done.\n\n\n\nIf I speak up, everything gets blown to hell. On the off chance that I am wrong, I’m a horrible monster who accused the love of my life and one of my closest friends of doing something horrible. If I’m right, it still tears our entire structure apart. The family and social unit we’ve become over the last several years is gone, and everyone will be stressed and upset even if Luke and I don’t divorce. If I do nothing, Sophie’s eventually going to sleep with Tom and be his girlfriend. (And I’m low key terrified it will happen sooner than later, or worse, that it’s already happened under my nose.)  I hope to hell this relationship fades as they mature, but what if it doesn’t? What if they wind up being together for years? What if they marry, want to get pregnant someday? \n\n\n\nAnd if I tell Sophie the truth about Amy’s kids, then everyone else finds out too, and that’s going to ruin so many lives. It would shatter my kids’ perception of their father, and their “Aunt Amy.” Luke is Owen’s hero. I don’t even want to think about how much this would hurt him. And what about Amy’s children? They are innocent. They didn’t ask for this, they don’t control where they came from, and I don’t want to hurt them. Admittedly I’m not happy with Tom at the moment. A week ago I saw him put his hand on Sophie’s butt and I wanted to knock his teeth out. But even he doesn’t deserve to be burdened by the knowledge that it’s his half sister he’s been fantasizing about. \n\n\n\nIt’s all so fucked up and I don’t know what to do. I’ve been looking the other way and letting my husband and his “best friend” insult me for such a long time now. I thought I could live with it. But this business with Tom and Sophie has me distressed. ",
  "created_utc": 1725237208.0,
  "score": 8969,
  "num_comments": 2197,
  "url": "https://www.reddit.com/r/offmychest/comments/1f6tn0f/i_think_my_husband_fathered_his_best_friends/",
  "comments": [
    {
      "id": "ll2qf2a",
      "body": "Wow. 23 and me for Christmas. Maybe order a 🪕 too",
      "created_utc": 1725238044.0,
      "score": 7446
    },
    {
      "id": "ll2v98m",
      "body": "Is your relationship with Luke really good?\n\nBecause it needs to be for this. You gotta have time where you and Luke can discuss this and literally start with how you understand it’s going to create immediate tension and say you can’t help but suspect something.",
      "created_utc": 1725239975.0,
      "score": 1108
    },
    {
      "id": "ll2wz8n",
      "body": "They won’t ever admit it to you if they’ve been keeping the secret this long plus with all the kids involved. \n\nThe only way is to do a DNA test, however you can make that work. \n\nEven if you can somehow orchestrate a 23 and me thing with Tom, all you need is the swab and to send it off along with your daughters and there’s nothing anyone can do. You can feign ignorance and ask what the big deal is if they get upset. It’s just a little fun to see what countries our genetics hail from, right?\n\nOr if you can somehow do it in secret then do that. Then whatever the results say you can decide what the outcome should be.",
      "created_utc": 1725240671.0,
      "score": 1878
    },
    {
      "id": "ll2vxre",
      "body": "Get dna samples of the children and test. Confirm your suspicions quietly, no need to move on your gut. Hard evidence is required.",
      "created_utc": 1725240253.0,
      "score": 1454
    },
    {
      "id": "ll2yoxx",
      "body": "If you're wrong, and say nothing - no harm, no foul on all accounts. THIS IS A WIN.\n\nIf you're wrong, and say something - there's a chance your marriage and social unit fall apart (but given the optics how close your husband and his friend are, and the risk of sibling dating - I'd say there's a reasonable chance it doesn't fall apart if your husband understands your POV, especially if you discuss it discretely with your husband first and voice your concerns about the kids dating). THIS IS A SOFT WIN (if handled carefully) / A NOMINAL LOSS (if not handled well).\n\nIf you're right, and say something - your husband and his friends get found out. The marriage and social unit falls apart - it's all their fault, and you protect the kids from potential incest. THIS IS A WIN.\n\nIf you're right, and say nothing - there's a serious chance the kids engage in incest without knowing. And your husband's infidelity continues to go unaddressed. Consider how the kids will feel in however many years time if this all comes out after the fact. Someone is going to do a 23&Me for the fun of it one day - the truth will come out. THIS IS A HUGE LOSS.\n\n  \nOn the face of it, you have an impossible decision to make. If you're able to discretely do DNA tests (you mentioned taking the boy's cheek swab once), I'd suggest you do this. It'll give you the proof you need to raise your concerns with your husband if it comes back positive (I don't know what your local laws are about this though so be careful).\n\nMy personal opinion: everything you've said screams to me that your instincts are right. If you say nothing, the kids will end up committing incest. Can you sleep soundly at night if you say nothing and that comes to pass? I'd discuss with your husband discretely and approach it from the perspective of the possible incest.",
      "created_utc": 1725241356.0,
      "score": 1394
    },
    {
      "id": "ll2sg06",
      "body": "Honestly, it might be time to blow it all to hell. What else are you going to do? Let this play out?\n\nIt may be possible to do this diplomatically, though obviously this is a hell of a thing.",
      "created_utc": 1725238846.0,
      "score": 1937
    },
    {
      "id": "ll2wlis",
      "body": "What the actual fuck",
      "created_utc": 1725240518.0,
      "score": 432
    },
    {
      "id": "ll2wpfy",
      "body": "Please UPDATE us",
      "created_utc": 1725240561.0,
      "score": 670
    },
    {
      "id": "ll2u2ga",
      "body": "You are assuming a lot, which is perfectly understandable. A good way to get to the truth is to give Sophie your permission to date Tom. You're not going to keep them apart anyway. If things are truly as you believe they are, it becomes Amy's and your husband's problem as well it should. If your assumptions are wrong, all the better, and you haven't blown up the families.  I don't see how you can live with the unknown for the rest of your life. Please keep us updated, and good luck.",
      "created_utc": 1725239498.0,
      "score": 1288
    },
    {
      "id": "loe898t",
      "body": "Am I the only one thinking that maybe her reason for not wanting to use birth control was to get knocked up on purpose, and that's why her made up explanation didn't make sense? Even if being a parent wasn't a goal for her some will unfortunately do it just so the guy will be permanently associated with them, and that certainly seems to be what happened 🫤",
      "created_utc": 1727027005.0,
      "score": 105
    },
    {
      "id": "ll30e6p",
      "body": "This is beyond Reddit’s pay grade.",
      "created_utc": 1725242036.0,
      "score": 452
    },
    {
      "id": "ll2x4ji",
      "body": "Find out the truth before those kids cross a line because THERE IS NO TAKE BACKS once what is done is done and they are related this will mess with them for life!!",
      "created_utc": 1725240731.0,
      "score": 211
    },
    {
      "id": "ll2y2kz",
      "body": "I think you should start acting like you support their relationship in front of your husband and Amy. Turn the tables and say you give them your blessing. See how they react. Also, I’d definitely go behind their backs and get DNA testing done.",
      "created_utc": 1725241113.0,
      "score": 532
    },
    {
      "id": "ll3d3w2",
      "body": "DNA test in silence. Although, this baffles me why you waited so long, and why you continued to have kids or a relationship with either/ both Amy and Luke ,  if you suspected something. \n\nGet a DNA Test in silence. Be sneaky abt it. You have access to all kids. \n\nAnd yes, get yourself in therapy, truth or not, there are other issues here as well.",
      "created_utc": 1725247414.0,
      "score": 130
    },
    {
      "id": "ll2tljr",
      "body": "Wow, this is quite the predicament. I think you could probably do something without them knowing. Maybe you could steal his toothbrush next time you’re there? 🤷‍♂️ I’m sure that suspicion is just gonna fester and fester. I hope you get your answer.",
      "created_utc": 1725239307.0,
      "score": 163
    },
    {
      "id": "ll32awn",
      "body": "I'm sorry, but this smells like a creative writing exercise. Why? Because there seems to be zero discussion about the missing, floating mystery dad(s) with someone so close to the family they are practically joined at the hip with your relatives. **4 kids** are produced from \"Amy\" with no direct discussion or concern with her about who the fathers are and everyone is just benevolently nodding their heads that this is OK? And further, there is not one peep or bit of angst or curiosity or resentment from the kids about not knowing who their dads are? And their children are super close with yours and there has never been a discussion between them about this?  This is nonsensical.",
      "created_utc": 1725242815.0,
      "score": 434
    },
    {
      "id": "ll32e9a",
      "body": "Fine. I’ll do it. 5 day old account. Literally a whole chapter of a screwed up romance novel. Maybe I’m the AH here, but this is just a bit too much. I guess thinking that “offmychest” meant somewhere to go to vent was wrong, but this whole “saga” sounds like a load of crap. There are plenty of other subs that are more popular and more relevant than this one.",
      "created_utc": 1725242853.0,
      "score": 416
    },
    {
      "id": "ll2wylz",
      "body": "God damn this was a trip. I hope you find peace OP, regardless of what you do. Personally I’d maybe look into hiring a private investigator and seeing what they could help with? This is obviously a very delicate situation but you also kinda need to know if the kids are getting intimate- at this point if 2 teens want to do the deed they will. \n\nAlso, maybe think about starting your daughter in birth control just in case she will be sexually active? Especially if there’s a potential genetic connection, making sure she doesn’t get pregnant this young will solve problems before they arise.",
      "created_utc": 1725240664.0,
      "score": 43
    },
    {
      "id": "ll3agt4",
      "body": "What in the Maury Povich did I just read?  If this is freakin true,  ummm WHY?  WHY did you let this go on for so long?  Please stop being a doormat.   Hire a PI, go through his phone.   DO SOMETHING.   Gain a backbone.",
      "created_utc": 1725246262.0,
      "score": 88
    },
    {
      "id": "ll317ur",
      "body": "You need to confront your husband. Period. \n\nTell him everything you suspect and demand a paternity test proving otherwise. If not then you need to leave your husband and tell your kids an age appropriate way why and what you suspect. \n\nStop playing games and guessing and making up situations in your head. Sit down and lay everything out and ask your husband straight to his face. \n\nI’d you don’t have the self respect then you need to let it all go and be done with it and live in the denial land you have been living in all these years. I could NEVER have gone on this long, I would have been questioning it at the first jump and I WOULD HAVE confronted them a LOOONG time ago! \n\nWhat if this was your daughter? What would you tell her to do in your shoes? Would you want this life for her? \n\nIf the answer is no, then you KNOW what you have to do. It’s time to PUT YOUR BIG GIRL PANTIES ON as my grandma would say and FIND OUT THE TRUTH!",
      "created_utc": 1725242369.0,
      "score": 99
    },
    {
      "id": "ll38t0j",
      "body": "This seems very made up. If the dad was boning Amy then Tom would definitely know. I can't see the husband/father hiding it that well. Kids know.",
      "created_utc": 1725245542.0,
      "score": 96
    },
    {
      "id": "ll38hix",
      "body": "Please listen to me. Before you do ANYTHING, you HAVE TO prove to your suspicions first. If you do anything without proof, and shit hits the fan, YOU will 10000% be the one who gets ostracized, cut out, and never spoken to again. Get a DNA test somehow, I really don’t know how but if you dedicate the amount of thought you’ve put into this whole situation and put it into getting a test done, you’ll figure it out, I believe in you.",
      "created_utc": 1725245404.0,
      "score": 61
    },
    {
      "id": "ll38fa5",
      "body": "OP, did your husband attend her births?!",
      "created_utc": 1725245377.0,
      "score": 25
    },
    {
      "id": "ll3dgi9",
      "body": "All the kids get 23 and me kits for Christmas.",
      "created_utc": 1725247576.0,
      "score": 27
    },
    {
      "id": "ll30nyv",
      "body": "First things first, this is the 2nd CRAZIEST thing I have EVER read to do with families. \n\n  \nSecond things second, DNA tests needed ASAP. Depending how long Tom and Sophie have been hanging out for, they have *definitely, 100%* done the deeds. We was all 15 and 17 once. \n\n  \nAlso, they are some crazy match ups. You need to find out how rare that allergy is, and if it is inherited.\n\n  \nIf they have hidden it for this long, they would not admit it, even if they was. However, the fact they have hid it for this long and no one knows about it means 2 things. One, there is nothing going on. Two, they are really **REALLY** good at hiding it.\n\n  \nAs cruel as it sounds, have you ever asked Tom if he knows anything about his dad? Does he ever mention it? What has he been told?\n\n  \nHave you ever checked Lukes phone? Particualary, his messages with them lot, and his photo gallery? Has his sex pattern ever changed, or did it ever change, unexpectedly? Did it ever become more or less common? I'm talking mostly about it being more common whilst or after \"Amy\" had given birth. Has he ever suspected you for cheating as commonly, people that \"live a second life\" often become paranoid (you are an exception as you have **ALOT** of reasons, don't worry, you are **NOT** crazy.",
      "created_utc": 1725242145.0,
      "score": 53
    },
    {
      "id": "ll3bprq",
      "body": "Everybody here is suggesting subterfuge and a secret DNA test, so I'll suggest the opposite: go in guns blazing.\n\nAsk your husband directly to his face if the woman's children are his, because this could lead to something terrible happening to these two children if they end up together; you are trying to save them from the trouble and trauma as you should.\n\nVoice your concerns clearly without emotional involvement and straight up tell him that you want the truth and proof of it.\n\nI mean what the fuck are you gonna do? Swab the kids, the woman, and your husband to confirm paternity and ancestry?\n\nIf you want to be subtle, hire a Private Investigator to keep an eye on your husband and the woman. Maybe that'll give you evidence to confirm or deny your suspicions.",
      "created_utc": 1725246801.0,
      "score": 43
    },
    {
      "id": "ll3dlrp",
      "body": "Get your daughter on birth control immediately",
      "created_utc": 1725247644.0,
      "score": 21
    },
    {
      "id": "llw3pez",
      "body": "EVERYONE DONT WALK, RUN TO HER TWO UPDATES\n\nEDIT THERE IS NOW THREE",
      "created_utc": 1725672935.0,
      "score": 19
    },
    {
      "id": "ll339k2",
      "body": "What excuse does he give for sleeping over her house ? The kids are old enough to notice if he’s sleeping in her room….",
      "created_utc": 1725243208.0,
      "score": 19
    },
    {
      "id": "ll34mis",
      "body": "I’m sorry but you need to talk to your husband. No sneaking around, no being silent for the family unit and quietly plotting your next step to prove he fathered Amy’s children. This isn’t doing anyone any good, especially you. It’s weighing on your mind, has been for years, and you’re going to develop an unhealthy obsession with it if you haven’t already. It’s going to keep eating at you and tearing you up inside. You’re going to build up a resentment to all of them. Even if you do a secret DNA test, you’re going to be on pin and needles for weeks until you get the results. \n\nTalk to your husband. Explain that you have had a suspicion and was willing to overlook it but now that Tom is trying to get with your daughter, it is really eating at you and you have to know the truth so you can protect your daughter. Express to your husband that he should want to protect his daughter too, at all cost. And look, maybe he is the father but maybe he was a donor for Amy, and they didn’t want to tell you. I’m not saying that’s a good thing if it is the case because it would still be them lying to you and not caring how you felt about it. \n\nBut either way, you need to get this off your chest. You have questions for him. Even if he isn’t their dad, you’re going to have questions and feelings. You’re not going to get DNA results and that be the end of it and never think about it again, even if they show he isn’t their dad. \n\nYou do have a resentment, whether you want to admit it or not. He chose to have 2 families, even if he is only married to you. Even if you think he didn’t neglect you, there are times when he chose Amy over you. There are times when he chose Amy’s kids over your kids. So you really do need to talk to him about it. If he’s the wonderful guy you think he is, as you tell us he is, he will understand why you feel the way you do. It won’t blow up your family unit. But you can’t keep holding this in anymore.",
      "created_utc": 1725243764.0,
      "score": 19
    },
    {
      "id": "ll5r3m7",
      "body": "[deleted]",
      "created_utc": 1725291100.0,
      "score": 18
    },
    {
      "id": "ll359os",
      "body": "Why is nobody questioning why HIS PARENTS are funding her children? I'd put money on them knowing those are their grandchildren.",
      "created_utc": 1725244031.0,
      "score": 72
    },
    {
      "id": "ll2zxaz",
      "body": "How close are you to Luke’s parents? \nIf they’re so willing to help Amy & kids, they’d be able to confirm your suspicions if they see the other 4 as their grandchildren too. \n\nYou don’t even have to be outright about it, a simple conversation saying you were watching “sister wives” or something and it hit home about how it kinda seems like that for you… just some random stupid conversation. \n\nOtherwise your options are to let them date, blow it all up, or seek therapy & keep it buried in the back yard. \n\nJust PLEASE make sure your daughter is on birth control. You don’t know what Amy has taught Tom around condoms etc.",
      "created_utc": 1725241848.0,
      "score": 18
    },
    {
      "id": "ll2tann",
      "body": "Uh *head scratch*\n\nWow.",
      "created_utc": 1725239185.0,
      "score": 35
    },
    {
      "id": "ll2xljf",
      "body": "You need to arrange testing without your husband or Amy's knowledge. A good cover story could be that your (conveniently unavailable) cousin claimed to have hooked up with Amy, and you want to be sure Sophie and Tom aren't second cousins. That's far enough that they shouldn't get freaked out at the possibility, but close enough they would want to know.\n\nOr just tell Tom it's a surprise for his mother. That has the benefit of being true. :)",
      "created_utc": 1725240923.0,
      "score": 36
    },
    {
      "id": "ll34l0d",
      "body": "Can you figure out the kids and parents blood types?",
      "created_utc": 1725243746.0,
      "score": 14
    },
    {
      "id": "ll4b4to",
      "body": "Pondering this; I thought that before you do something like an DNA test you may want to ask yourself how **you** want to go forward after the results of that come.\n\n- if Amy's kids are indeed fathered by Luke, what are you going to do or say?\n\n- and if you're totally wrong, what will you do or say then?\n\nNot to excuse Luke or Amy for what they did if your suspicions are correct. But dropping the bomb would shatter the lives of all the kids, so *for their sake* be **very** careful or even consider some compromises to avoid that as much as possible.\nBut truth has to come out one way or another.",
      "created_utc": 1725267194.0,
      "score": 15
    },
    {
      "id": "ll3sx37",
      "body": "Someone's bored and trying their hand at creative writing it seems",
      "created_utc": 1725255529.0,
      "score": 13
    },
    {
      "id": "ll3i33r",
      "body": "Get dna from your husband and then from one the kids\n\nTest it quietly\n\nThere, you have your answer without anyone knowing anything",
      "created_utc": 1725249770.0,
      "score": 12
    },
    {
      "id": "ll3dx29",
      "body": "Hey Tom I’ll let you date my daughter all you need to do is let me swab your mouth to check for anything bad \n\nDon’t tell your dad because he doesn’t want you to date Amy but if I prove this to him he will let you \n\nLol",
      "created_utc": 1725247789.0,
      "score": 25
    },
    {
      "id": "ll3p8ib",
      "body": "Tearfully \"confess\" you're not certain Luke is Sophie's dad and since Amy purportedly doesn't know who Tom's dad is, the kids really need a DNA test",
      "created_utc": 1725253476.0,
      "score": 65
    },
    {
      "id": "ll565xk",
      "body": "I have been reading your comments and your posts and it leaves such a bad taste. It seems you are doing anything but try to find out the truth. You are more worried about what they both would think rather than take an actual step. Please take responsibility for your kids. Do the test I am sure there can be ways. You are trying to gaslight yourself that you are trying to do everything to find the truth when in fact you are just laying out excuses as to why not.\n\nSeriously please 🙏",
      "created_utc": 1725283797.0,
      "score": 11
    },
    {
      "id": "ll87pos",
      "body": "I’ve never needed an update more than I do with this post.",
      "created_utc": 1725321569.0,
      "score": 11
    },
    {
      "id": "ll8jire",
      "body": "I need updates. I'll even call Amy and ask who the baby dad(dies) are. \n\nWith that being said...\n\nWhy do you think your husband would have an affair with Amy? There's nothing in your story that makes me think he couldn't be with Amy if he wanted to, even before you came into the picture. They aren't  Romeo and Juilet. They could have been together if they wanted to. You're the one he's chosen, not Amy. \n\nYou also mentioned Amy had kids around the time you did. She had her son 2 years before you had your first born, so maybe she's thinking you're copying her. Who knows. A lot of my friends had kids around the same time. \n\nThe fact that she stopped after your husband had a vasectomy? Do you think she might have stopped because she had twins the last go around? \n\nIdk, there's a lot to unpack here...\n\nGood luck OP",
      "created_utc": 1725326076.0,
      "score": 11
    },
    {
      "id": "ll3cf74",
      "body": "I’m Sorry. I’m not buying it. No woman I know would ignore all those coincidences for so many years.",
      "created_utc": 1725247105.0,
      "score": 42
    },
    {
      "id": "ll3lnjh",
      "body": "I would flat out ask Luke if he fathered Amy's kids by in vitro.  It's an out without accusing him of cheating.  Just a solution.",
      "created_utc": 1725251575.0,
      "score": 22
    },
    {
      "id": "ll36rzu",
      "body": "Can't wait for the second act.",
      "created_utc": 1725244669.0,
      "score": 9
    },
    {
      "id": "ll4eqf3",
      "body": "I wonder does he have anything in his will for Amy and her children I feel like that would be pretty telling , and same goes for the grandparents do they treat Amy’s kids as their grandchildren , did they ever want Tom and Amy to be together would they care and who’s side would they take if paternity was established and the kids were his.",
      "created_utc": 1725269662.0,
      "score": 11
    },
    {
      "id": "ll6nmll",
      "body": "I would have privately told my daughter.",
      "created_utc": 1725301813.0,
      "score": 10
    },
    {
      "id": "ll2v832",
      "body": "It sounds like you already know the answer. Tell Sophie at least. She deserves to know before she gets involved with her own brother.",
      "created_utc": 1725239962.0,
      "score": 40
    },
    {
      "id": "ll2zp8t",
      "body": "This is the cheesiest most AI generated bullshit I’ve ever read.",
      "created_utc": 1725241758.0,
      "score": 75
    },
    {
      "id": "ll2xn2g",
      "body": "Op this make ME sick to the stomach just reading let alone living it, a dna kit wouldnt hurt at all, and at this point i dont think you could be the bad guy solely because they havent really said anything to make it seem otherwise.",
      "created_utc": 1725240940.0,
      "score": 33
    },
    {
      "id": "ll3n70g",
      "body": "WOW. \n\nThis is a LOT & I don’t blame you at all for feeling this way OP, especially when “Amy’s” kid ironically has the same rare allergy as your husband “Luke” & the kids have similar features to your husband. \n\nI’m going to have to agree with what others here have said to SILENTLY get the kids DNA tested (as long as they are 18) as even just 1-2 of the kids being a positive match would give you the ammunition you need to call them out on the potential bullshit. \n\nBut I have to stress here that you NEED to be sneaky about this because if you call them out on it without proof you risk destroying the social/family bridge you’ve spent years building. \n\nDo the groundwork first & if it’s all negative, that gut feeling was exactly that, a feeling that didn’t have any real merit but if god forbid it’s true then you’ll have the foundation you need to bring this potential MESS to light & nuke the bridge. \n\nBest of luck to you OP & please keep us posted on the update.",
      "created_utc": 1725252385.0,
      "score": 8
    },
    {
      "id": "ll4lp7u",
      "body": "honestly, I would just personally be sneaky and get sample of their DNA and send it for tests (hair with root still attached, cups or utensils that they have used, etc), and I would have done it as soon as the suspicions came around.\n\nA woman's gut instincts, especially this strong that it haunts you for years, is rarely wrong.\n\nedit to add: atm you are accusing them without any evidence. get the DNA tests, pay it out of your pocket. If the results is as what you have been suspecting, do not confront them. Get your ducks in a row before you do.",
      "created_utc": 1725274234.0,
      "score": 8
    },
    {
      "id": "llkf6fw",
      "body": "Update please!",
      "created_utc": 1725502453.0,
      "score": 9
    },
    {
      "id": "ll366wm",
      "body": "At the end of the day, it doesn't matter how much birth control and condoms you give your child. If they're siblings and they fool around, it will eat at her. \n\nNot-so-fun-story for ya:  When I was 21, I had a roommate who slept with her half sibling. They didn't know they were related. Somehow they found out that they shared the same father. My roommate went into a deep depression. Alcohol, and eventually drugs couldn't numb her pain, disgust, embarrassment, depression, etc.  She took her own life. Her brother ended his life a few months later for the same reason. \n\nYou have to get answers. At this point, it's about protecting your children.",
      "created_utc": 1725244418.0,
      "score": 13
    },
    {
      "id": "ll2yfo4",
      "body": "At the moment, there are a whole lot of assumptions going on. And you know what they say about those. They'll make an ass of you and me.\n\nYou need proof. Proof about the infidelity between hubby dearest and his bestie. Hire a p.i.\n\nIf they ARE having an affair and you have proof? Confront them. Part of that confrontation is the question of how many of bestie's kids are hubby's.",
      "created_utc": 1725241256.0,
      "score": 7
    },
    {
      "id": "ll37bpy",
      "body": "f0ck diplomacy, just throw the bomb and know the truth.",
      "created_utc": 1725244902.0,
      "score": 7
    },
    {
      "id": "ll5g15e",
      "body": "You literally have free access to their hair. Grab some- right from his head- say it was a mosquito or some other pest, then grab some from your husband's beard or hairbrush. Wash rinse repeat through all her kids. Voila. You have your answers without potentially destroying everyone's happiness for what could be nothing.",
      "created_utc": 1725287385.0,
      "score": 7
    },
    {
      "id": "llprbp2",
      "body": "I think he can’t be friends with her if he can’t prove that he isn’t the kids father. Like let’s be so for real it’s crazy to be accused of that and stay the night with her",
      "created_utc": 1725580895.0,
      "score": 8
    },
    {
      "id": "llpwoqx",
      "body": "Girl I seriously need an update! Did you get a DNA test?",
      "created_utc": 1725582856.0,
      "score": 8
    },
    {
      "id": "ll2xu5d",
      "body": "This isn’t that hard. Tell your husband you’re supportive of Sophie dating Tom and see what happens.",
      "created_utc": 1725241019.0,
      "score": 14
    },
    {
      "id": "ll2zd38",
      "body": "Why are you so afraid to confront your husband of something that has been weighing you this whole time? There so many scenarios here. maybe Tom and Sophie are really not half siblings but she, Kaylee and the twins are thats why they're not worried. Have you even asked your MIL for help or guidance?",
      "created_utc": 1725241623.0,
      "score": 12
    },
    {
      "id": "ll3316s",
      "body": "Are you never alone with the twins ??   At 9 I’m not sure they would even care if you did a quick swab or know what it’s for.   You could certainly get Carter to give a swab.   Two swabs and it’s a done deal.",
      "created_utc": 1725243114.0,
      "score": 6
    },
    {
      "id": "ll36oa6",
      "body": "Please update",
      "created_utc": 1725244623.0,
      "score": 7
    },
    {
      "id": "ll37wyu",
      "body": "Tell your husband that you are reconsidering you stance on Tom not dating Sophie and see what be says. Tell him you are concerned they will sneak around and may already be doing so and see what he says.",
      "created_utc": 1725245155.0,
      "score": 6
    },
    {
      "id": "ll3aszs",
      "body": "Okay, I'm so sorry but holy hell. You need to have a sit down with the two adults and confront them. If you're wrong, they're mad at you but honestly, if you have a healthy relationship with your husband I feel like it could be moved past with therapy, and you need therapy anyway since you've been harbouring and building this resentment for nearly 20 years. \n\n/If you're not wrong/ the kids are already going to be traumatized about it, and the longer you let it go the more scarred they'll be. Imagine your daughter finding out she /lost her virginity to her brother./ Don't do that to her. \n\nDo not confront your daughter and tell her in secret, that puts their burden on her and that's not appropriate. \n\nConfront the adults. Order a paternity test if they truly care about the government or companies having your DNA. Tell them you've seen the signs of intimacy coming between the kids and you're worried. It's not about the relationship between y'all as adults, it's about your concern for the kids. Obviously you were able to choke down the worry for 17 years. \n\nRight now you seem more worried about your own personal relationships than your children's mental wellbeing, I think you should reevaluate. You need to take the hit as an adult before your children go through even more irreversible psychological damage.",
      "created_utc": 1725246411.0,
      "score": 6
    },
    {
      "id": "ll3gibg",
      "body": "Y’all are sister wives, I fear. If that’s not what you want (I know I wouldn’t), you better research divorce attorneys as this is almost two decades of lying. If you say nothing, your daughter may end up in bed with her half brother. If you’re wrong, it’s still a win of sorts but marriage counseling needs to be on the table as the question will cause real strife.",
      "created_utc": 1725249009.0,
      "score": 7
    },
    {
      "id": "ll3or9n",
      "body": "Op you need to grow spine.comeon  you need to act.if you dont do anything and kids sleep with each other then they will feel gross and would need therapy for long time..\n\n\nPls go for dna kit.dont think too much. Amy and Luke didn't give shit about you whole having affair and kids ",
      "created_utc": 1725253214.0,
      "score": 7
    },
    {
      "id": "ll42srh",
      "body": "For once, I feel like I've read a karma-farm post. Or some crazy writing practice or whatever other redditors call it.\n\nBecause I just can't imagine why you've never had a DNA test run on those kids.\n\nThey hang out pretty regularly at yours. I'm sure you've had some alone time with them. They're young, you could find 1001 excuses to swab their mouths, pluck some hairs etc. \n\nEven if Luke refused, you could just go behind his back especially if you're THIS worried. There's no logical reason why you're even posting this cos the answer is so obvious: if you ask, they'll deny it; the kids know nothing so they can't verify anything; and if you take a test and it's negative, then all your fears are put to bed and your husband never has to know about it.\n\nAnd if it confirms your fears, then whether you leave or not, at least you can prevent your daughter from fucking her step brother, and, worst case scenario, getting knocked up by him cos they're young and she's not on BC. Let me not even get into the fact that she will never forgive you for cowardly letting her sleep with her biological brother.\n\nSo yeah, I truly feel like this is just a [rage]bait post and it's  100% fiction.\n\nOh, even if dna tests need parental consent, surely you have friends? And even if you don't, you can just claim their both yours (I mean, technically one sample is yours) and that you're trying to prove to your husband that you didn't cheat. Make some shit up! There will be no harm if it's negative. And if it's positive, the consequences are not as grave as all the incest that's just waiting to happen.",
      "created_utc": 1725261555.0,
      "score": 6
    },
    {
      "id": "ll4hinr",
      "body": "Omg this reeks of creative writing 🤣 damn, are you that desperate for attention?",
      "created_utc": 1725271553.0,
      "score": 6
    },
    {
      "id": "ll8s0yy",
      "body": "Do a paternity test in secret. Now. \n\nScrew trust etc just do it. \n\nIf it comes back negative fine, never talk about it again. \n\nIf it comes back positive, I would suggest you speak to your three oldest children about it, make a decision on how to move forward as one unit.",
      "created_utc": 1725329359.0,
      "score": 5
    },
    {
      "id": "llxvoej",
      "body": "What if your marriage weren’t real and Amy and Luke had actually married for real? I mean she officiated the marriage but kept an affair with Luke for over a decade maybe. \n\nThe betrayal that would be on top of everything else. And if Amy’s children is actual Luke’s the they are affair babies and that is something Amy and Luke for okay with.",
      "created_utc": 1725708823.0,
      "score": 16
    },
    {
      "id": "ll33uss",
      "body": "What in the **Flowers in the Attic** is this? If it's true that they're half siblings, you, your husband, and Amy are some effed up parents. I can't believe there are people who would rather bury their heads in the sand than to try to find out the truth. I also don't understand how you're so afraid to ask your husband. There should be nothing that you two can't ask each other.",
      "created_utc": 1725243446.0,
      "score": 16
    },
    {
      "id": "ll315jx",
      "body": "Wow.\n\nI think you need to confront your husband. If he knows you know (yes, I did that), he will catch on and either fess up, or panic and gaslight you. Or, truly not be the father and offer a DNA test to clear it all up but that isn’t seeming likely is it?\n\nHis reaction is key.",
      "created_utc": 1725242343.0,
      "score": 9
    },
    {
      "id": "ll2yv0k",
      "body": "They are hormonal teens. They could potentially be half siblings. I don’t want to say they are doing the do or anything similar but they very well could be or have already. If that’s the case you are not only looking at therapy for both(because that’s definitely gonna be upchuck worthy if they are half siblings), you could also be looking at a pregnancy scare or actually pregnancy if they are active without precautions. \n\nBlow it up girl. You have to do what’s best for your family and knowing the truth is what’s best now. You have done everything short of getting DNA testing/outright asking. It’s time to do so.",
      "created_utc": 1725241425.0,
      "score": 5
    },
    {
      "id": "ll39hyv",
      "body": "You have to do a 23 and me, or something? From your post I think he’s the father… he gots everything he needs and wants and you let him stay the night?!? Girl you gave him all he needs to have and raise two families. Reread your post and question if someone else wrote it what would you think?",
      "created_utc": 1725245838.0,
      "score": 4
    },
    {
      "id": "ll39tyi",
      "body": "I’d blow this family situation up, you could be on the cusp of an incest situation, I think that’s more important than being a bad guy. It’s just too many coincidences in one story.",
      "created_utc": 1725245984.0,
      "score": 4
    },
    {
      "id": "ll3eh83",
      "body": "secretly do a dna test, thats really your only option",
      "created_utc": 1725248047.0,
      "score": 5
    },
    {
      "id": "ll3f7ee",
      "body": "the bubble is gonna burst… Maybe burst it before tom and sophie have a kid together a",
      "created_utc": 1725248391.0,
      "score": 5
    },
    {
      "id": "ll3g1ls",
      "body": "Looks like it’s time to “throw out” your husband’s old tooth brush, and have Tom over offer him a plastic Dixie cup with water or something to drink and collect said cup on the sly, maybe you have an end of summer BBQ with Amy and her kids so solo cups would be pretty ubiquitous and not out of place. Take the tooth brush and cup to a PI who specializes in paternity/infidelity cases and have them run the DNA samples. Then you’d at least know.",
      "created_utc": 1725248788.0,
      "score": 5
    },
    {
      "id": "ll3ktc5",
      "body": "Get a PI to investigate for you",
      "created_utc": 1725251142.0,
      "score": 4
    },
    {
      "id": "ll3mda9",
      "body": "Girl stop. You’ve been trying to be the “cool wife” for far too long. Buy the 23 and me and do what needs to be done.",
      "created_utc": 1725251950.0,
      "score": 6
    },
    {
      "id": "ll3n67o",
      "body": "This was literally an episode of SVU. Just minus the dead two-timer.",
      "created_utc": 1725252373.0,
      "score": 5
    },
    {
      "id": "ll3oos2",
      "body": "[deleted]",
      "created_utc": 1725253176.0,
      "score": 5
    },
    {
      "id": "ll4mnpb",
      "body": "Idk if anyone else has said this - but I find it very strange that your in laws financially support Amy. It sounds to me that they may know that’s their grandchildren",
      "created_utc": 1725274805.0,
      "score": 4
    },
    {
      "id": "ll527qu",
      "body": "This kind of chillness over your husband being besties with another woman, having sleepovers, the woman has multiple children with no known baby daddies and husband supports her financially and in every other way including postpartum... I can't relate to that.",
      "created_utc": 1725282253.0,
      "score": 5
    },
    {
      "id": "ll5yohv",
      "body": "Ancestry is running a sale. $39",
      "created_utc": 1725293584.0,
      "score": 5
    },
    {
      "id": "ll6jrwf",
      "body": "One thought - is it possible for you to check his will? If they are indeed his biological children I imagine he would have them included as beneficiaries in his will. Just something to look at in the interim period until you can find a way to check dna. I said earlier that you could check them while they slept during a sleepover or by saying there was someone stuck in a tooth and using a swab to remove it. Obv off a young child. Something like trying lipstick on the young girl and smearing it on her teeth and using a swab to remove it",
      "created_utc": 1725300515.0,
      "score": 5
    },
    {
      "id": "ll6odb4",
      "body": "I swear I felt like I was reading a teaser chapter of a new thriller novel. Is this actually real?",
      "created_utc": 1725302061.0,
      "score": 6
    },
    {
      "id": "ll8zxn5",
      "body": "This is a lot to unpack. \n\nI have been in a situation that surprisingly isn’t that different from you. I have been best friends with a woman for decades. My parents knew her. I am very good friends with her husband. \n\nShe and I have a very close relationship, beyond what most people understand. I won’t go into details publicly, but we are very close with each other. It’s sometimes hard for people to understand, especially my girlfriends. \n\nBut this is why I write. \n\nI am not in love with her. She is an incredibly important part of my life and I would be lost without her. But her husband is who she should be with, and I am so happy she has him. And she is happy that I have a girlfriend who is good for me, even if she was very protective of me. \n\nI think you need to figure your relationship out first. But the fact that your husband chooses you, and this woman likes you as a friend, speaks volumes about how highly they regard you. \n\nIt’s difficult to process. Happy to chat via DM. \n\nI wish you good luck. ",
      "created_utc": 1725332580.0,
      "score": 5
    },
    {
      "id": "ll97eca",
      "body": "I'm not sure this has not been mentioned, not that I have seen anyways. But when you were naming the child and their ages, ALL of Amy's kids are older than your by at least 2 years. \n\nTom 17, Sophie 15, and the other 12, 10, and 6 or something like that. \n\nThe way you worded it, it sounded as if Amy got pregnant around the same time you did, maybe 6mo-1yr apart. \n\nSo my question, if Amy had a child before you and Luke did, why didn't Luke just marry Amy? Assuming the kids are his. \n\nThis doesn't make any sense to me. 🤷🏻‍♀️",
      "created_utc": 1725335983.0,
      "score": 4
    },
    {
      "id": "ll9f8fc",
      "body": "I had another thought. What has your in-laws thoughts on Amy having so many kids with an absent father. It's hard to believe that the don't see the resemblance that you see in Amy's kids that they don't look like Luke. Do you suspect that they know or secreting support Luke and Amy's affair. Do they treat Amy's kids as if they are their grandchildren like yours?\n\nDoes Amy not work or have a job? When all the kids are 18, will you guys and the in-laws keep financially supporting her? You guys are in your 40s, she's a dependent at this point. \n\nDoes anyone have the same suspicions as you? Your parents? Your siblings? Or, your friends? Or, any mutual friends that you all have? Has anyone called out their friendship? Or, Amy having so many kids with an \"absent\" father?",
      "created_utc": 1725340076.0,
      "score": 5
    },
    {
      "id": "llf3dlq",
      "body": "At this point I’d be secretly collecting DNA and sending it in bc I’d feel so guilty if the kids got together and did things..and they’d have to live with that-id imagine it be hard knowing they had relations with a sibling.id feel guilt if I didn’t do SOMETHING. I wouldn’t confront him bc it will cause a ruckus-this way you can find the truth once and for all.",
      "created_utc": 1725423888.0,
      "score": 5
    },
    {
      "id": "llf483t",
      "body": "Get a paternity test done. You don’t even have to tell them. Or make up a story about another friend commenting on how much Sophie and Tom look alike. See if you get any reactions. Listen your gut is probably right. If it is what is your next move? You can’t clearly keep living like this.",
      "created_utc": 1725424325.0,
      "score": 5
    },
    {
      "id": "llqcrrw",
      "body": "You gotta reveal it them teens sneaking behind your back.  And leave that's crazy ",
      "created_utc": 1725588618.0,
      "score": 6
    },
    {
      "id": "ll3fmhm",
      "body": "I’m just going to put this out there but you don’t have to be intimate to father the children. Maybe it was implanted and was done as a way to make sure she is always taken care of from the family by being the mother of some of their grandkids. That’s just as fucked up in this situation but I wanted to shine the light a different way since I didn’t see it in any of the comments. Maybe he was the donor and not the lover.",
      "created_utc": 1725248589.0,
      "score": 14
    },
    {
      "id": "ll32jzb",
      "body": "Looks like your options are pretty simple. Tell your Kid, DNA test, talk to the other adults involved (though they can deny it), or let the kids do what they will (because you can’t be there 24/7). \n\nIf it’s true then you either get a sister wife or a divorce. You have a functioning family right now might be okay once everything is out in the open and you can always fall back on the divorce option later. \n\nI would buy the whole family dna tests. Do the tests in secret and present the results at Christmas as a fun Christmas present. Oh ancestry typically has an okay Black Friday sale though it can take a bit to get the results back. Maybe give the empty boxes as a gift and tell them the results will be back in a few days and see if they come clean before they do. (Of course if they are not his kids they will probably be very angry)",
      "created_utc": 1725242919.0,
      "score": 4
    },
    {
      "id": "ll342b8",
      "body": "This is a doozy. I need to be updated once you send off for DNA testing, it's the only way.",
      "created_utc": 1725243531.0,
      "score": 4
    },
    {
      "id": "ll3591c",
      "body": "This is a lot. Try to find a DNA test that you can use their hair. And because the kids are at your house often enough, maybe you get all of their hair. Good luck",
      "created_utc": 1725244023.0,
      "score": 4
    },
    {
      "id": "ll3fwlj",
      "body": "You’ve got to update us!",
      "created_utc": 1725248721.0,
      "score": 4
    },
    {
      "id": "ll3gy2c",
      "body": "Girl tests all the kids DNA with each others DNA, without Luke and Amy knowing. If they all match up, confront them...if it doesn't let it go. No harm, no fowl...the fact that her kids look like your husband is a tall tell sign though...you have every right to know, if your husband is a cheating ahole and has fathered someone else children...",
      "created_utc": 1725249216.0,
      "score": 4
    },
    {
      "id": "ll3hi0g",
      "body": "Do you have any sense that your parents in law might know?",
      "created_utc": 1725249483.0,
      "score": 4
    },
    {
      "id": "ll3ikm8",
      "body": "Oh man! I will be waiting for the outcome of this over on the BORU sub.",
      "created_utc": 1725250012.0,
      "score": 3
    },
    {
      "id": "ll3lrh0",
      "body": "I know this is obviously immoral, and I wouldn’t suggest it if I thought there was another way, but is there any chance you could get some saliva from a toothbrush or something similar and do a private DNA test? At least just on your hubby and the young lad you’re worried could be his son. That way, if it comes back all clear, you can throw the tests away and forget about it. If it’s not, however, you have fairly undeniable evidence. I dunno, this sort of situation calls for a slightly unorthodox approach.",
      "created_utc": 1725251632.0,
      "score": 4
    },
    {
      "id": "ll3scl7",
      "body": "AI?",
      "created_utc": 1725255207.0,
      "score": 3
    },
    {
      "id": "ll4wmnm",
      "body": "For a woman who's got so far in life, you are not very smart. You love self torture",
      "created_utc": 1725279889.0,
      "score": 4
    },
    {
      "id": "ll5wlor",
      "body": "I don’t understand why u don’t just do a DNA test. You don’t need permission they don’t even have to know.  Why torture yourself or allow a possible incest situation go on. Seriously grow a back bone and do a test.  See what it says then go from there. This is so dumb to just fester for all of these years.  When u could have just handled it and been done with it.",
      "created_utc": 1725292902.0,
      "score": 3
    },
    {
      "id": "ll2qui9",
      "body": "Oh about a year ago, I suggested we do one of those! Just to see Luke's reaction. He was *very* staunchly against it, didn't want the government to have our DNA, kept saying Ancestry tests were a scam anyway...\n\nI brought it up to Amy, and guess which one of us she agreed with?",
      "created_utc": 1725238213.0,
      "score": 5070
    },
    {
      "id": "ll3kdji",
      "body": "> Maybe order a 🪕 too\n\nI am appalled by the lack of appreciation for this joke in the thread.\n\n..\n\n>!H̶͔̬͔̟̏̌͂e̶͎̹̔̂̎̾͘ͅ ̸̺̪͕͉̓ġ̷͓̖͇͍̺͋͛͠o̶̧̝̗̲̰̅̋̓̐͠t̴͍̺͈͋̒̈́̆ ̴͎͕͕̽̏̌̏̐ȁ̵͎̗͑ ̴̯̭̳̩͒r̸̡̼̩̖͙̐͐̍͘é̸̼a̸̢̟̐̓͗̌̂l̵̡͙͇̝̻̆̃͐̑͂ ̴̘͕͂͐p̷̙̱͚̪̳͗̑̈͐̕ŗ̷̭̝͙̋̈̆̈́e̸͇̽̈́͛͒͘t̴̗̘͇̄̒̅͂̚t̸̩̲̣̼̪̓̍̉͊y̷̠̒̇̉͗͘ ̶̡͖̼̟́͝m̴̫͓̣̉̒̚o̸̞̲̗͂u̵̧̦͔͕̩̾̑͘̕t̸͙̻̣͔͋̽́̀͗h̸̙̲͐̂̄̀̀,̶͙̲͊͛̎̕̚ ̵̩͋a̷̟͂͗̅͘ǐ̴̼̳͇̮n̵̡̩͉̬̩̎̓’̷̥̣̟̌̎͗͛ẗ̶̯ ̴̢͕͚͔͛̀̿ͅḧ̶̛͓͚͖̱̥́̅ě̸͔̭͎̬̋?̴̡̭̺̪̉̌̓̕͠  \n!<",
      "created_utc": 1725250917.0,
      "score": 301
    },
    {
      "id": "ll66d8m",
      "body": "I would straight up do this on my own without their knowledge. Then you have your answers either way.",
      "created_utc": 1725296099.0,
      "score": 8
    },
    {
      "id": "ll2vt4j",
      "body": "The thing is, I think he's aware that I know. Assuming it's true, and I'm not imagining things, it's kind of been an unspoken reality for a while now.",
      "created_utc": 1725240202.0,
      "score": 979
    },
    {
      "id": "ll2xu7k",
      "body": "If this is going on, then they already know that I know. They won't buy my innocent act.",
      "created_utc": 1725241020.0,
      "score": 879
    },
    {
      "id": "ll38npc",
      "body": "This and don't say a word until you have evidence.",
      "created_utc": 1725245478.0,
      "score": 497
    },
    {
      "id": "ll3m2x0",
      "body": "And get the daughter on birth control asap!",
      "created_utc": 1725251798.0,
      "score": 481
    },
    {
      "id": "ll30ku7",
      "body": "This is really nicely broken down, I love the game theory approach.",
      "created_utc": 1725242110.0,
      "score": 392
    },
    {
      "id": "ll3vdb6",
      "body": "\"the truth will come out\"\n\nThis is the part I don't get. The truth is going to come out. In this day and age this is not going to stay a secret. Tom and Amy (or whatever) are just letting this play out and it's an insane gamble.\n\nOP has spent over a decade thinking about this and now it's Schrodinger's cat. OP is too scared to know the truth so she's taken zero steps to figure this out. Like why ask the husband about the 23&me? If OP had just bought them - she'd already know.",
      "created_utc": 1725256965.0,
      "score": 185
    },
    {
      "id": "ll3y0sh",
      "body": "I didn’t think I would ever get behind sneaking and testing dna. Ever. It’s such a denial of consent. But with so much on the line… OP I empathize so much with all your hesitations and concerns but you NEED to know. For the sake of your daughter’s mental health. I say swab the kids in their sleep and see what happens next.",
      "created_utc": 1725258558.0,
      "score": 68
    },
    {
      "id": "ll476cv",
      "body": "Assuming Tom and Sophie won’t be in love forever sucks to. What if they are? Get serious, get engaged, even maybe married? \n\nEven if none of them does a DNA test for fun ever, maybe if they have kids that do one day, it’s going to be one hell of a mindfuck for everyone. Yikes.",
      "created_utc": 1725264500.0,
      "score": 59
    },
    {
      "id": "ll2t1r5",
      "body": "I have no idea how to handle this with diplomacy.",
      "created_utc": 1725239087.0,
      "score": 753
    },
    {
      "id": "ll2tya8",
      "body": "This would be life shattering to so many people in so many ways.",
      "created_utc": 1725239451.0,
      "score": 46
    },
    {
      "id": "ll4it1u",
      "body": "What in the actual Game of Thones",
      "created_utc": 1725272400.0,
      "score": 158
    },
    {
      "id": "ll3hkuh",
      "body": "This is the only update I’ve ever *needed*",
      "created_utc": 1725249521.0,
      "score": 409
    },
    {
      "id": "ll3gnh4",
      "body": "Can’t wait to see this on BORU",
      "created_utc": 1725249076.0,
      "score": 128
    },
    {
      "id": "ll4l93x",
      "body": "Honestly I don’t know if this is true because the internet is fucked up but if it is it’s quite a shitty situation but very entertaining for us I need an update for it I fear.",
      "created_utc": 1725273960.0,
      "score": 25
    },
    {
      "id": "ll5i7dj",
      "body": "Please do! I NEED to know how this ends.",
      "created_utc": 1725288129.0,
      "score": 6
    },
    {
      "id": "ll2y1dk",
      "body": "Oh, I like this. Then it doesn’t fall to OP to be the bad guy and it would be just another nail in the coffin later on. \n\nOP, if what you suspect is true, they have built quite the house of cards, don’t hold it up for them.",
      "created_utc": 1725241100.0,
      "score": 311
    },
    {
      "id": "ll2ww2u",
      "body": "I came here to say this very thing.  Let your husband know that you think it’s okay for your daughter to date and let him and Amy do the heavy lifting.  Right now, they are just relying on you to keep the peace.  Drop the barrier and see what happens.\n\nIn the meantime, revisit that sneak attack DNA approach.  Figure out how to get his DNA on the sly.  If nothing else, you need to know.  Heck, test them all!!!!",
      "created_utc": 1725240635.0,
      "score": 765
    },
    {
      "id": "ll3d5tt",
      "body": "If these kids hook up and find out they’re siblings they’ll be traumatized for life.",
      "created_utc": 1725247439.0,
      "score": 87
    },
    {
      "id": "ll332tn",
      "body": "The only thing I don't like about this idea is that it potentially throws the kids under the bus. What if the husband and Amy decide that they'll just continue to keep their mouths shut? Then what? It's already bad enough that this likely half siblings have probably already *at least* kissed. Learning you dated your half sibling would traumatize anyone, and it would completely implode the life and mental health of a teenager.\n\n\nThis has already escalated too far. DNA tests and up-front accusations need to happen for the sake of the kids. The time for subtlety was gone the moment they started to be interested in each other. ",
      "created_utc": 1725243132.0,
      "score": 204
    },
    {
      "id": "ll3k103",
      "body": "OP could also give a conditional acceptance. Sit them both down and say for example that since Amy has revealed no information on who the sons father is there is a slight chance that they could be related in some fashion (works especially well if you and/or hubby have large families and you don’t have to imply you suspect the affair as it could be a relation on either side), they could be cousins or something, so if they agree to do 23andme and aren’t related you will give your permission to date. Still would be easier to run it secretly but this could also serve as an option. OP could also frame it as a chance to connect him with family he may not even know he has if that would be something to interest him.",
      "created_utc": 1725250741.0,
      "score": 91
    },
    {
      "id": "ll36ryq",
      "body": "I agree that this is the best immediate action, you don’t even need to tell Sophie yet, first tell your hunny that you have changed your mind and you are going to allow them to date in order to avoid the whole ‘Romeo and Juliet’ of it all.  Then just sit back and watch what plays out, immediately on his face, what he does right after, and in the following hours/day before you even move forward with telling Sophie. If hubby calls Amy right away or especially if one of the other adults stops them then you will have a much clearer understanding of your situation.\nPlus, you have lived with n this discomfort for a long time now. If you are going to blow up the whole system you might as well take the time to get prepared as much as you can",
      "created_utc": 1725244669.0,
      "score": 63
    },
    {
      "id": "ll5gbqu",
      "body": "This is the answer, right here.  You don't even have to talk with the kids about it (because obviously you don't want to add \"dated my 1/2 brother\" to your daughter's baggage).  Plan a grown up dinner with your husband & his friend & tell them you will be lifting your objections to the kids dating.\n\nAlso.  Please keep in mind there are other ways to be related than same dad.  Amy could be attracted to your husband and found men that look like him to father her children or she may have been fishing in your husband's family pond.  Brothers? Cousins? Y\n\nYou can absolutely say \"Amy, I know this is private, but for the sake of my daughter's health I need you, Amy, to confirm that your son's father is not related to my daughter's father.  Unless there is biological relationship, I am going to give their relationship the greenlight.\"  Then stop talking.  What happens in the next few minutes should tell you everything you need to know.",
      "created_utc": 1725287487.0,
      "score": 19
    },
    {
      "id": "ll34ygf",
      "body": "oh yes this is great advice!!!!  yes!!  ",
      "created_utc": 1725243902.0,
      "score": 6
    },
    {
      "id": "lofxed1",
      "body": "I have considered that before. Under the circumstances I cannot fathom why she would do this, but she may have.",
      "created_utc": 1727046347.0,
      "score": 108
    },
    {
      "id": "ll3n48v",
      "body": "You don't need to be a pro to know that she needs to get it out before he gets it in.",
      "created_utc": 1725252345.0,
      "score": 104
    },
    {
      "id": "ll2ykjy",
      "body": "This is what a lot of people are saying I should do. I've considered it. But I worry that they would \"call my bluff\" so to speak. Like...I'm not entirely sure Luke and Amy wouldn't just let sleeping dogs lie to preserve the status quo.",
      "created_utc": 1725241309.0,
      "score": 337
    },
    {
      "id": "ll89jrh",
      "body": "This. OP has the spine of a wet noodle. It's sad and I really hope she goes to therapy to gain some self-esteem. She deserves better than this but she doesn't seem to know it",
      "created_utc": 1725322273.0,
      "score": 13
    },
    {
      "id": "ll2tt3j",
      "body": "I almost did that once. Took a cheek swab when he was sleeping. I stopped myself because I started thinking about how crazy I seemed and threw it out. But I could do it again.",
      "created_utc": 1725239393.0,
      "score": 254
    },
    {
      "id": "ll51qe1",
      "body": "Also, as a gen z teenager, I can assure you that Tom would literally be the first person to suspect that Luke might be his father lol. I can't possibly imagine someone in my age range being in that situation and *not* suspecting that his mother's best friend who spends nights with her, is the same race as him, and looks a shitton like him is his father.",
      "created_utc": 1725282061.0,
      "score": 66
    },
    {
      "id": "ll3cqv0",
      "body": "Thank you. Tom is older (by 2 years) too. The likelihood of amy having four kids with three potentially different fathers with no attached child support or involvement (or even discussion?) strains creduilty. And Amy can afford 4 kids as a single mom?",
      "created_utc": 1725247251.0,
      "score": 114
    },
    {
      "id": "ll384y9",
      "body": "By the writing alone it’s a creative writing exercise lol. I can’t imagine anyone literally crafting a story like this when they find themselves in this kind of situation. Like the first time my husbands female “bff” has a biracial kid of my husbands race with no men but my husband around her, I’m getting a DNA test lol",
      "created_utc": 1725245252.0,
      "score": 239
    },
    {
      "id": "ll3blw6",
      "body": "How about this writing exercise longer than my leg and not one mention of the elephant in the room that can solve this whole thing?! Why the fuck didn’t she do the damn paternity test?! All it takes is two hairs, one from each and boom",
      "created_utc": 1725246755.0,
      "score": 67
    },
    {
      "id": "ll761fc",
      "body": "A \"creative writing exercise\" 😂 What a diplomatic way to say it set your Bullshit Meter pinging! I was kinda thinking the same. OP seems very intelligent and articulate, not to mention her saying she has a very well paying job. She doesn't seem like the text book case of a beaten down woman with low self esteem and lack of options and thus feels compelled to turn a blind eye because it would be extremely difficult to live without the finances and security her husband provides.",
      "created_utc": 1725308050.0,
      "score": 10
    },
    {
      "id": "ll57aa3",
      "body": "It really is - it’s like a soap opera writing prompt.",
      "created_utc": 1725284221.0,
      "score": 13
    },
    {
      "id": "ll5tk2t",
      "body": "the part that threw me off was reading in the comments that OP already did a cheek swab on Tom while asleep. I've done 23&Me and they are very precise with how you take the sample. You have to swab for a certain amount of time in a certain area so I don't see how that can actually be done on someone sleeping. You'd feel something in your mouth pressed against your cheek.",
      "created_utc": 1725291906.0,
      "score": 4
    },
    {
      "id": "ll8k4hy",
      "body": "This was my instinct as well... more energy was put into writing about it than figuring out how we ended up in this precarious situation lol",
      "created_utc": 1725326312.0,
      "score": 4
    },
    {
      "id": "ll40bml",
      "body": "I agree, this is a creative writing exercise.",
      "created_utc": 1725259997.0,
      "score": 51
    },
    {
      "id": "ll4hcua",
      "body": "This is almost word for word an SVU episode. S5 ep15, “Families”.",
      "created_utc": 1725271445.0,
      "score": 35
    },
    {
      "id": "ll3oa2y",
      "body": "Yeah this chicks got 4 kids to 3 different dudes and we just never asked who the dads were? This post reeks like bullshit",
      "created_utc": 1725252959.0,
      "score": 71
    },
    {
      "id": "ll3bqfq",
      "body": "Seriously.",
      "created_utc": 1725246808.0,
      "score": 27
    },
    {
      "id": "ll37bnr",
      "body": "This needs to be top comment , thank you for researching",
      "created_utc": 1725244901.0,
      "score": 64
    },
    {
      "id": "ll57ns7",
      "body": "I’ve been scrolling to find someone else who isn’t taking this seriously. Are people that gullible?!?",
      "created_utc": 1725284363.0,
      "score": 15
    },
    {
      "id": "ll5g509",
      "body": "“ I have a job that pays handsomely” yeah this post is fake AF.",
      "created_utc": 1725287422.0,
      "score": 14
    },
    {
      "id": "ll5afm6",
      "body": "You're not an ah. It's trying to keep gullible people from believing every dumb piece of shit posted on the internet and letting them base their worldview on stories like this. \n\n\nSo many kids read the crap made up here and think it's real, and it legit radicalizes them. \"SEE, men suck! They all cheat and lie and gaslight!\" \"See, women are untrustworthy, and any friend is actually trying to steal your man!\" \"See, men need to be careful because so many women try to pass off an affair baby as his!\" \n\n\nI legit see people ardently believing that garbage, all because of fake reddit posts written by 14 year olds bored on a holiday weekend.  \n\n\nAnyone with any life experience or critical thinking can see this story is painfully fake on 100 fronts. And the fact that people are falling for it up and down this thread speaks to the lack of critical thinking we are employing, and it's why SO MANY people fall for disinformation and propaganda. \n\n\nPointing out fake shit is a goddamn duty for anyone who isn't a fool.",
      "created_utc": 1725285393.0,
      "score": 14
    },
    {
      "id": "ll5e8th",
      "body": "Shocked it took me scrolling this far to find someone saying this. The post screams fake.",
      "created_utc": 1725286767.0,
      "score": 9
    },
    {
      "id": "ll4mtdm",
      "body": "Glad someone said it",
      "created_utc": 1725274900.0,
      "score": 9
    },
    {
      "id": "ll3yw7z",
      "body": "Feels like ChatGPT to me.",
      "created_utc": 1725259094.0,
      "score": 16
    },
    {
      "id": "ll2xmyu",
      "body": "Not sure a PI could do much since I don't believe they're going out on secret dates or anything. He always tells me when he spends the night with Amy, and supposedly it's completely platonic. Short of breaking into the house to see if they're fucking, I'm not sure what a PI could do. \n\nSophie's on birth control. I'm strict about dating and very strict about what happens with dating, but all of my kids either get the pill or their first set of condoms when they start high school. I'm no dummy.",
      "created_utc": 1725240939.0,
      "score": 54
    },
    {
      "id": "ll31vov",
      "body": "This is what everyone is saying and I hear you, but I don't know. Part of me doesn't want to alert Luke/Amy to the fact that I'm after proof. \n\nHere's the thing. They're still Amy's kids. Even if Luke agreed to a DNA test, she might not be comfortable with that. They might not be, either. Tom is old enough to say no to something like that, and then what do we do, hold him down? \n\nYou're right, I am second guessing myself a lot and dawdling, but that's because there are a lot of factors. \n\nIt IS my daughter, that's why I have to do something.",
      "created_utc": 1725242642.0,
      "score": 64
    },
    {
      "id": "ll394we",
      "body": "That was exactly what I was afraid of.",
      "created_utc": 1725245684.0,
      "score": 26
    },
    {
      "id": "ll3935q",
      "body": "We both did.",
      "created_utc": 1725245664.0,
      "score": 39
    },
    {
      "id": "ll3ydih",
      "body": "This is the only way. I’d spend $1000 on all these kits JUST to prove it to myself. Easy way to find peace of mind without it being your fault really.",
      "created_utc": 1725258773.0,
      "score": 12
    },
    {
      "id": "ll31b3c",
      "body": "What the hell is number one? \n\nThey've always gotten along well, but all of this \"dating\" talk started at the beginning of summer, roughly. \n\nI've checked. It's a very rare allergy and it can be inherited, yes. \n\nI've never asked any of Amy's children about their fathers. I feel like that would be out of line, and there would be no point. They know as little as we do. That's why they're so grateful to have Luke in their lives. I think they've just been told that their father(s) \"could have been anyone.\" \n\nI've checked Luke's phone, nothing significant there. I never noticed any change in Luke's pattern. We go through periods of being more or less active, but I never timed it, particularly. It's more than possible that we had \"more\" active periods when Amy was post child-birth, but then, he would often be there for her during those times. \n\nNo, he's never accused me of infidelity. \n\nThank you for the reassurances.",
      "created_utc": 1725242407.0,
      "score": 37
    },
    {
      "id": "ll3dqor",
      "body": "Give the grandparents a gift test, test the daughter, and test Tom once he turns 18.",
      "created_utc": 1725247708.0,
      "score": 9
    },
    {
      "id": "ll4d616",
      "body": "I think that wouldn't work in this case.\n\nIf OP's suspicions are true, everyone in her life (on husband's side) has been lying to her face for decades.\n\nThey aren't going to just blurt out the truth upon confrontation.",
      "created_utc": 1725268578.0,
      "score": 7
    },
    {
      "id": "ll53y0g",
      "body": "yes exactly. if she already believes it enough that she thinks he'd let the kids date just to keep the secret, the relationship is already breaking down. \n\ntalk about it. if they are all his kids then best case, the kids learn the truth, the lies stop, and all the adults get to decide what to do from there. if there's been no cheating and her question completely shocks him, then that'sbetter than letting the idea make her believe he is evil.",
      "created_utc": 1725282934.0,
      "score": 5
    },
    {
      "id": "llw5d5o",
      "body": "Hooooly shit. Thank you for this! This is why I love Reddit and why I subscribed to updates about this post - I knew y’all would clock the updates before I did! ❤️\n\nEdited to add: wild ass updates",
      "created_utc": 1725673596.0,
      "score": 14
    },
    {
      "id": "ll5ruw3",
      "body": "That's what I can't figure out. They were close for years before Luke even knew me. And even after he and I got together, it's not like there wasn't time or opportunities for him to jump ship and choose Amy. So why would he do this.",
      "created_utc": 1725291350.0,
      "score": 23
    },
    {
      "id": "ll3jrnd",
      "body": "why is nobody questioning the whole ass story",
      "created_utc": 1725250611.0,
      "score": 56
    },
    {
      "id": "ll30g8x",
      "body": "We get along famously, but I can't really ask them to side with me over their own son and the girl they all but raised. Either way, they've always been very kindhearted and trusting people, I doubt they would suspect anything was off. \n\nI can at least rest easy knowing that Sophie is on birth control. Amy is likely NOT to have taught her children about condoms given her own history, if I'm being honest, but Sophie is smart as a whip and she knows better.",
      "created_utc": 1725242059.0,
      "score": 28
    },
    {
      "id": "ll2y8ex",
      "body": "Interesting thought, but I don't think the kids would buy it without the second cousin (not to mention Luke and Amy) being involved. \n\nI could genuinely see Tom arguing that second cousins isn't \"that\" bad, as well.",
      "created_utc": 1725241176.0,
      "score": 31
    },
    {
      "id": "ll43uzi",
      "body": "Excellent suggestion!",
      "created_utc": 1725262259.0,
      "score": 5
    },
    {
      "id": "ll4d1yr",
      "body": "I don't know. This is exactly why I've been so hesitant to proceed.",
      "created_utc": 1725268501.0,
      "score": 12
    },
    {
      "id": "ll3w221",
      "body": "Never do that OP. Makes you sense. Be honest with your husband - do it with Amy around and demand a paternity test! Get him to deny being the father with Amy present so she sees he takes no claim over her kids",
      "created_utc": 1725257377.0,
      "score": 18
    },
    {
      "id": "ll3s9y1",
      "body": "This is diabolical. I wouldn't actually do it, but I like it.",
      "created_utc": 1725255164.0,
      "score": 71
    },
    {
      "id": "ll8mrkm",
      "body": "I mean, four kids was enough for me. I always wanted a big family, ever since I was a teenager, pretty much. But even I knew that I was done after my last pregnancy, that four was plenty. So I talked to Luke about having a vasectomy and he was on board. \n\nI don't know why Amy stopped having kids. It could be that Luke is the father and she stopped getting pregnant because he could no longer do that. Or maybe he isn't the father and she had her own reasons. But as a (presumably...) single woman depending on the support of her best friends, one would think she'd stop having children sooner than baby number four. \n\nAs far as why they didn't simply get together in the normal way...I have no idea. It's one of the arguments I used against myself these many years, to tell myself that I was wrong. That if Luke wanted to be with Amy, he would be, he had no reason to sneak around. If it turns out to be true, and I am able to have a conversation about this with them, that's going to be one of my first questions.",
      "created_utc": 1725327338.0,
      "score": 30
    },
    {
      "id": "ll3jpr8",
      "body": "It's laughable how much someone would have to ignore to get to this point, and it's hilarious that so many people are buying it",
      "created_utc": 1725250583.0,
      "score": 26
    },
    {
      "id": "ll4csdh",
      "body": "No woman with self-respect would ignore all that.\n\nHer husband has sleepovers with his bestie.",
      "created_utc": 1725268319.0,
      "score": 13
    },
    {
      "id": "ll4pjdt",
      "body": "Yes this! She doesn't even seem bothered that her daughter is having sex with her half brother. Very shocking to me. She is like, 'oh she is on birth control' like seriously??",
      "created_utc": 1725276427.0,
      "score": 6
    },
    {
      "id": "ll4f2lo",
      "body": "I don't think he has a Will, but speaking of his parents, I'm pretty sure Amy and her children are included in THEIR Wills. They absolutely DO treat Amy's kids like grandchildren. \n\nAs far as I know, they were never -rooting- for Luke/Amy to wind up together, but his mom did mention in passing once that she \"expected\" it to happen before Luke met me. (But she adores me and we get along very well, to be clear.) \n\nIf it came to a divorce/conflict between me and Luke, I mean, they would have to side with him. He is their son.",
      "created_utc": 1725269900.0,
      "score": 52
    },
    {
      "id": "ll73f5r",
      "body": "I'm probably going to do that once I have proof.",
      "created_utc": 1725307176.0,
      "score": 9
    },
    {
      "id": "ll2vvgg",
      "body": "I don't think she would believe me. But I may have to do that.",
      "created_utc": 1725240227.0,
      "score": 34
    },
    {
      "id": "ll3a2vp",
      "body": "Definitely someone who wants to karma farm who’s done some creative writing.",
      "created_utc": 1725246091.0,
      "score": 29
    },
    {
      "id": "ll2yc4t",
      "body": "I'm gonna do a DNA test for my own peace of mind.",
      "created_utc": 1725241217.0,
      "score": 96
    },
    {
      "id": "ll3ne7g",
      "body": "None of the kids are 18, but Tom will be sooner than later.",
      "created_utc": 1725252491.0,
      "score": 11
    },
    {
      "id": "ll38q11",
      "body": "I have told him that I worry they will sneak around. He didn't think it was likely, and seemed certain that between the three of us, they wouldn't have the opportunity to.",
      "created_utc": 1725245505.0,
      "score": 11
    },
    {
      "id": "lly5qn5",
      "body": "I've seen enough documentation and had enough interactions to be quite sure this isn't true, but holy shit, remembering that she was the one who married us did send a chill up my spine.",
      "created_utc": 1725713774.0,
      "score": 44
    },
    {
      "id": "ll73j9o",
      "body": "He doesn't have a Will, but his parents do, and Amy's children are in it. \n\nI'm going to do a secret DNA test.",
      "created_utc": 1725307214.0,
      "score": 28
    },
    {
      "id": "ll9h5ne",
      "body": "They've implied with comments here and there, that they believe Amy should make more responsible choices, but they don't mind helping out financially. They've never commented on any resemblance Amy's children have to Luke, but they do treat them like grandchildren. \n\nAmy does have a job, but it wouldn't be enough to support her whole family on it's own. As for what happens when the kids are grown, I don't know, but at this point it's kind of a given that Amy and her kids are family. \n\nOne of two of my friends have brought it up, mostly as a joke. Only one of them seems to genuinely believe it's true. But this was 10+ years ago and back in those days, I defended Luke and Amy and insisted it wasn't true.",
      "created_utc": 1725341167.0,
      "score": 20
    },
    {
      "id": "ll3kuga",
      "body": "Why wouldn't they just tell me in that case. Why wouldn't they tell the kids.",
      "created_utc": 1725251158.0,
      "score": 33
    },
    {
      "id": "ll2r9ji",
      "body": "Ask her son when he's over if he wants do do one with you and the kids. Just for fun",
      "created_utc": 1725238379.0,
      "score": 3559
    },
    {
      "id": "ll3rnfp",
      "body": "If this kid is at your house all the time why don't you just collect something with his DNA on it and have it tested at an independent lab against your kid?",
      "created_utc": 1725254813.0,
      "score": 372
    },
    {
      "id": "ll3w8on",
      "body": "I know this is wrong but if I was you, I would try and get dna samples from both kids and test to see if they are related.",
      "created_utc": 1725257489.0,
      "score": 117
    },
    {
      "id": "ll3uqyu",
      "body": "I would be sneaking hair and spit. \nYou're so close to her kids. Get some DNA of them and then your kids. I would've been done this, lol.",
      "created_utc": 1725256593.0,
      "score": 165
    },
    {
      "id": "ll3dovq",
      "body": "[deleted]",
      "created_utc": 1725247685.0,
      "score": 276
    },
    {
      "id": "ll353j3",
      "body": "OP you likely  already know the truth. What are your next steps.",
      "created_utc": 1725243961.0,
      "score": 142
    },
    {
      "id": "ll3qfqz",
      "body": "I don't want to think off the chance birth control protection (I assume they'll use those if they are already sneaking behind you) broke and the consequences that entail. \n\nYou need to have this done asap OP.",
      "created_utc": 1725254135.0,
      "score": 28
    },
    {
      "id": "ll31p3e",
      "body": "Don’t let them know",
      "created_utc": 1725242567.0,
      "score": 51
    },
    {
      "id": "ll40pg7",
      "body": "For your peace of mind, you need to sneak around and do it. If your situation is as you explained, I wouldn't be able to live with this massive doubt...",
      "created_utc": 1725260235.0,
      "score": 32
    },
    {
      "id": "ll5xf1i",
      "body": "Give one to your daughter and then to one of her children. It sounds like you’re afraid of your own shadow in this relationship. Be more assertive. They’re walking all over you. \n\nEither that or pay for a PI to look into it. You said you’re financially doing ok so pay for a PI. They can find out a lot for you. \n\nI’d also start individual counseling if I were you because you seem like a doormat in this marriage. I’m so sorry that you’re going through this but please get some self-respect. You deserve better than to play second fiddle in your own marriage.",
      "created_utc": 1725293168.0,
      "score": 12
    },
    {
      "id": "ll3pqre",
      "body": "Do it secretly.",
      "created_utc": 1725253752.0,
      "score": 9
    },
    {
      "id": "ll5g92c",
      "body": "Who has to know you did it? Just swipe their saliva from a spoon or a cup or something.",
      "created_utc": 1725287461.0,
      "score": 8
    },
    {
      "id": "ll67567",
      "body": "Swab the son for a \",covid\" test. Or get a piece of hair. But you need to test.",
      "created_utc": 1725296353.0,
      "score": 9
    },
    {
      "id": "ll4z7jk",
      "body": "You can get one if kids DNA like hair or something and get it done.\nAlso, you can actually talk to Luke, you can tell him that everyone knows Tom wants to date Sophie and you don’t want to be the villain in there story. So you need to know from Luke if he is the father. Don’t accuse, or be resentful, but state it as fait accompli like you figured he was father of all the kids cos you never saw Amy with one and other reasons you mentioned in your post. So it is your duty to stop your daughter from dating a boy who may be her brother so you need to hear it from Luke",
      "created_utc": 1725281015.0,
      "score": 8
    },
    {
      "id": "ll3z9rm",
      "body": "Just do it anyway",
      "created_utc": 1725259331.0,
      "score": 8
    },
    {
      "id": "ll5mgp1",
      "body": "Luke should know that the government can legally take his DNA from your trash that you put on the curb. Trash is public property when it comes to the constitution and doesn't require a warrant for the government to search and seize. Even if he burns all his personal trash at home, every coffee cup or plastic spoon he throws out in public can be taken and collected legally by anyone and run for DNA. It's a valid fear to wonder where your DNA is going and how your information is being used by private companies. But if someone is worrying the \"government\" might get their DNA, then they should know that the government can easily get it from anything they throw out or shed on in public.\n\nI'd get the test for the kids and register the accounts yourself. Even if you choose not to share the information. Not shocking that Amy didn't want to agree either to a test too.",
      "created_utc": 1725289558.0,
      "score": 6
    },
    {
      "id": "llc1q90",
      "body": "Heck I'd do a mouth swab on all of them. Say it's an at home covid test and a new wicked strain is out.",
      "created_utc": 1725383811.0,
      "score": 6
    },
    {
      "id": "ll5pp40",
      "body": "Could you use health reasons to do a DNA test. Other than that you might consider just doing it behind his back. You also only need to test Sophie and Tom. No matter what it sounds like you can\\`t continue. He cheats on you basically the whole time and you let it go on - so either you continue to let it go on and just hope if the two stay together, they a) decide against kids and stay childfree on their own, b) can\\`t get pregnant for other reasons or c) hope that they have s healthy kid regardless the fact they are siblings.  - or you just blow it up now but can live a happy rest of your life, without constantly being lied to and cheated on.",
      "created_utc": 1725290637.0,
      "score": 6
    },
    {
      "id": "ll62poo",
      "body": "Do it anyways. You don’t need to test your kids. Just your husband and one of the possible children of your husband. Don’t tell anyone and then you’ll know for sure.",
      "created_utc": 1725294906.0,
      "score": 6
    },
    {
      "id": "ll6kz2g",
      "body": "Be sneaky.. Do It with one of ur kids and one of theirs. If anyone finds out be like It was on sale and i really was interested in seeing what our histories are. Say the rest of the kits are coming in the mail. Those ones just came first.",
      "created_utc": 1725300918.0,
      "score": 5
    },
    {
      "id": "ll3mpdc",
      "body": "i cackled at this joke",
      "created_utc": 1725252128.0,
      "score": 24
    },
    {
      "id": "ll3lr9j",
      "body": "I was gonna ask you if that was a ukulele and then it hit me",
      "created_utc": 1725251628.0,
      "score": 39
    },
    {
      "id": "ll3svyt",
      "body": "For anyone wondering ITS A BANJO",
      "created_utc": 1725255511.0,
      "score": 10
    },
    {
      "id": "ll3r1r1",
      "body": "Da da da duh duh",
      "created_utc": 1725254478.0,
      "score": 7
    },
    {
      "id": "ll2wa49",
      "body": "So, what do you want for you and your kids if it is? Tom and Sophie not dating aside, how would you want to continue? Would you leave Luke? Maybe that’s seems dumb, but you’ve essentially got a family with 11 people in it. It seems to be functioning. Could you be involved in that?\n\nApologies if I’m asking insulting questions. I’m not trying to. Just genuinely curious as you’ve obviously thought this through a ton.",
      "created_utc": 1725240391.0,
      "score": 522
    },
    {
      "id": "ll403d0",
      "body": "Why don’t you ask Luke if he knows who the father of Amy’s kids is? And if he says he doesn’t, tell him that you want your daughter and Amy’s son to have a DNA test. Explain it that you see some resemblance and you are worried that they are distant cousins or something.\nAnd if he is vehemently against it, tell him that you want to allow them to date and that you want to be 100% sure that they are not related.",
      "created_utc": 1725259849.0,
      "score": 186
    },
    {
      "id": "llbxro5",
      "body": "If I were you, I would start with a passing comment like “It’s kind of crazy how much Tom looks like you. People would think you were his real dad.” Or something like that. See how he reacts. \n\nCause even if he really wasn’t the father he may agree with you. But if he KNOWS he’s the father then maybe he would deny it and be defensive. \n\nIdk, would you stay with him and forgive him if it WAS the case?",
      "created_utc": 1725382539.0,
      "score": 8
    },
    {
      "id": "ll83y49",
      "body": "Honey, 'unspoken realities' in the form of affair babies should not exist in a marriage. You need to stop rugsweeping for him. \n\nIs he violent? Why are you so afraid of him?",
      "created_utc": 1725320141.0,
      "score": 16
    },
    {
      "id": "ll340iv",
      "body": "But why do you care what they think about you? You have done nothing wrong. Calling out their BS is not wrong. You don’t have to pretend you are innocent; you are in this situation regardless of what you do except for violence.\n\nWhat if his gentle and generous parents are racists, and they didn’t want them to be a couple, and he used you all this time?",
      "created_utc": 1725243511.0,
      "score": 1128
    },
    {
      "id": "ll336aa",
      "body": "Yes your Husband and Amy might now but it’s not fair to you or the kids. Why don’t you try to paternity test they sell at the pharmacy and start with that? There is no way around this until you have solid proof because if what you are saying is that your husband and Amy will keep it to the grave, then they are willing to let your children ruin their lives with a secret this big. THEY ARE RUINING THE LIVES OF THE CHILDREN. Not you.",
      "created_utc": 1725243172.0,
      "score": 217
    },
    {
      "id": "ll5t63e",
      "body": "Say your doing a Covid test for the kids bc it’s going around lately and you swab 2 of the kids for 23 and me",
      "created_utc": 1725291779.0,
      "score": 335
    },
    {
      "id": "ll373wg",
      "body": "That’s okay, they don’t need to buy it, the bottom line is you deserve to know. They are not giving you the information you’re entitled to so there is nothing wrong with you getting those answers another way. I mean, you play innocent and their options are to call you out (which you can deny); come clean and confess; or go along for the ride until it crashes. Either way, you’re forcing this to its conclusion. \n\nThink of it this way. You deserve to know if Tom and Sophie are half-siblings and so do they. How do you think everyone is going to feel if those two have sex and they’re siblings? How do you think Sophie is going to feel knowing her dad knew and that you strongly suspected and no one did anything? At this point they think this is some Romeo & Juliet issue and you are likely to be the bad guy since you are the most vocal one against it. \n\nSo, it’s to the point now where you can’t afford to be in denial anymore and it doesn’t matter if they know that you know or if they’re upset that you blow it wide open. The potential of your daughter, and Tom, getting hurt is so high at this point that the question needs to be answered.",
      "created_utc": 1725244808.0,
      "score": 139
    },
    {
      "id": "ll39xuk",
      "body": "If this is going on, the DNA tests will prove it and they will have to answer for their infidelity.\n\nIf it is all just a story you made up in your head, then DNA tests will confirm this, you can relax and let them daye without worrying about incest or breaking the family/friendship bonds.\n\nEither way, you NEED to get DNA tests done. ASAP. \n\nDrama will only happen if you falsly accuse them of something they didn't do or if they are guilty of the worst possible betrayal against you. \n\nTLDR: You aren't doing anything wrong by getting tests done, and if they did something wrong DNA will prove it. Get the tests done before you blow up at someone and falsely accuse them.",
      "created_utc": 1725246032.0,
      "score": 113
    },
    {
      "id": "ll3voi0",
      "body": "If what you suspect is true, them not buying your innocent act is the least of your concerns.\n\nIf what you suspect is not true, they have no reason to suspect your innocent act.",
      "created_utc": 1725257151.0,
      "score": 35
    },
    {
      "id": "ll38u9q",
      "body": "Who cares if they know you know. They're the ones betraying you and your family. \nSubscribeme",
      "created_utc": 1725245557.0,
      "score": 28
    },
    {
      "id": "ll3h5w9",
      "body": "What's wrong with them knowing that you know? Otherwise what are you even gonna do next if it turns out to be true? There's no need for an innocent act here once the facts are out imo.",
      "created_utc": 1725249320.0,
      "score": 8
    },
    {
      "id": "ll3vu8h",
      "body": "If this is going on, who gives a fuck what they think. You have every right to be infuriated if this is true. Get that DNA test done, asap, and then go from there 🤞good luck",
      "created_utc": 1725257245.0,
      "score": 5
    },
    {
      "id": "ll48vr5",
      "body": "So you discreetly, very fucking discreetly get a dna test done. You get a hair of Tom's or even one of the twins too and you send it off. They won't do a mouth swab without telling like or Amy so find somewhere that does it using hair. Get a po box discreetly for the test supplies and results. Erase every email, phone call, whatever as soon as you've read/sent it. Have a friend who you trust not to say anything send it and have all contact with the company through them. Sophie is easy, just take a hair off her brush when noone is home. \n\nI hope to god they aren't related for all your sakes.",
      "created_utc": 1725265661.0,
      "score": 5
    },
    {
      "id": "ll3qzoe",
      "body": "And line up a good therapist",
      "created_utc": 1725254446.0,
      "score": 241
    },
    {
      "id": "ll40gdc",
      "body": "“I’ve seen how Tom adores Sophie. Maybe we should let them date? And given the circumstances of that we should also discuss birth control and the adult responsibility that comes with dating and possibly having sex while dating.”\n\nYour husband and Amy’s reaction will tell you whether or not you need to go nuclear on this.",
      "created_utc": 1725260079.0,
      "score": 266
    },
    {
      "id": "ll2xbuj",
      "body": "You don’t. You suspect your husband of cheating. There is zero diplomacy in this situation",
      "created_utc": 1725240812.0,
      "score": 615
    },
    {
      "id": "ll36yjp",
      "body": "The mental health of two innocent kids is at stake here, get Luke and Amy alone in a hotel room away from the kids and throw down some napalm.",
      "created_utc": 1725244745.0,
      "score": 301
    },
    {
      "id": "ll32neg",
      "body": "I think the time for diplomacy is well past when worst case scenario is the very possible chance they ARE secretly dating, have sex & for one reason or another end up pregnant. Or even if there’s no pregnancy but it furthers to becoming physical & if your right, then your daughter is going to STRUGGLE with the fact she unknowingly was intimate with her brother",
      "created_utc": 1725242957.0,
      "score": 159
    },
    {
      "id": "ll3ssmx",
      "body": "Girl, how the hell did you swallow this all those years? I would've flipped out as soon as I had an inkling. Don't just bury your head in the sand. If he's been BANGING his bestie, you should be PISSED and breathing fire. Have you checked their messages? Do you have an open phone policy?",
      "created_utc": 1725255458.0,
      "score": 85
    },
    {
      "id": "ll2wr4l",
      "body": "You could also frame it with your husband as purely an issue w/r/t your daughter and her dating life. This may cause less of a defensive reaction than, say, you accusing him of possibly decades of betrayal.\n\nWhich brings up a possibly useful thing of defining how you want to react to that second point, and what you want your line about it to be.",
      "created_utc": 1725240581.0,
      "score": 145
    },
    {
      "id": "ll2x5s7",
      "body": "Don’t. Nuke the bridge.",
      "created_utc": 1725240744.0,
      "score": 61
    },
    {
      "id": "ll2ueh3",
      "body": "Perhaps getting your husband away for a weekend and doing a day trip or a weekend trip. This way you can have some kind of settled plan/approach for all these kids + Amy before you come back to your family/families.\n\nThings might get complicated with you two, but this at least lets you two hash things out with some kind of isolation.\n\nThis is so complicated I would consider using your post as a reference, to make sure you got through everything you wanted to say.",
      "created_utc": 1725239632.0,
      "score": 97
    },
    {
      "id": "ll3170f",
      "body": "You need to come out and tell your husband you have figured out they are his kids and you want a DNA test right now or you’re gone. I can’t believe you have tolerated all this for years. I would have jumped in the middle of my husband.",
      "created_utc": 1725242359.0,
      "score": 100
    },
    {
      "id": "ll34urf",
      "body": "Fuck diplomacy. You've been incredibly.cool in the face of the obvious for a very long time. Your husband and Amy have never been honest with you or with any of the kids. You aren't trying to force your husband and Amy to end their lifelong relationship. You aren't trying to get revenge or demand a divorce. There's a lot you could have been doing and could still do to make things unpleasant for everyone and you haven't. \n\nI am in a poly relationship and know a lot of people who are openly non-monogamous. There are ethical ways to do things, consent being primary. I suspect that if your husband and Amy understand that you know, have suspected all along and are more or less ok with everything except for the kids hooking up, they will be more cooperative. \n\nGet the DNA tests. You don't have to get permission from your husband. He didn't ask yours when he created several kids with Amy. You may be legally required to get Amy's permission to test her son, but he's also old enough to set up his own account on a testing site and spit in the tube. Have all your kids do it. Get your own done, too. \n\nIt's so odd that Gary and Amy really believe you have no idea.",
      "created_utc": 1725243860.0,
      "score": 133
    },
    {
      "id": "ll3lmg0",
      "body": "I think you need to have a conversation with your husband.  Because let’s be clear, if this is true when these two kids hook up the ramifications will be very, very serious.  It’s not going to be a fun conversation but it needs to start with you and him.",
      "created_utc": 1725251559.0,
      "score": 27
    },
    {
      "id": "ll441v1",
      "body": "Buy EVERYONE dna kits as a fun SURPRISE yay",
      "created_utc": 1725262388.0,
      "score": 16
    },
    {
      "id": "ll4lgrz",
      "body": "Who said anything about about diplomacy? Get a lawyer and prepare a tactic. When the time is right and the lawyer says go for it then start taking the steps. You need to divorce and you need to come out on top.",
      "created_utc": 1725274092.0,
      "score": 7
    },
    {
      "id": "ll47c7r",
      "body": "Get a strand of the boys hair. Offer him a haircut or if something.\nSend a strand of his hair & of your husband's hair to get tested.\n\n\nReally your only way.\n\n\nSay nothing to no one until you have results.\n\n\nIf it's not a 50% match then he's not the dad.\n\n\nIf it is then... Go nuclear.",
      "created_utc": 1725264611.0,
      "score": 11
    },
    {
      "id": "ll2va77",
      "body": "The last thing you want is your daughter coming home pregnant with her brothers child. You need to quit burying your head in the sand.",
      "created_utc": 1725239986.0,
      "score": 226
    },
    {
      "id": "ll2u7se",
      "body": "Obviously; It'll be life shattering either way, unless this intentionally-unrevealed possible incest goes without notice for years, and OP has to live with the knowledge that she didn't raise the question when she wondered.\n\nThe best time to plant a tree is 20 years ago but we're stuck with the second best option which is doing it today",
      "created_utc": 1725239558.0,
      "score": 34
    },
    {
      "id": "ll5ts2l",
      "body": "I desperately need the update. Honestly it sounds like they’ve built a beautiful family, I really hope infidelity isn’t the case here.",
      "created_utc": 1725291978.0,
      "score": 41
    },
    {
      "id": "ll5ki02",
      "body": "+1 , I’m genuinely so interested",
      "created_utc": 1725288899.0,
      "score": 19
    },
    {
      "id": "ll30xqz",
      "body": "Op needs to get Sophie on some kinda bc first",
      "created_utc": 1725242255.0,
      "score": 258
    },
    {
      "id": "ll38ams",
      "body": "You can do DNA tests with hair as long as the follicle is attached. But she would need to find some excuse to pluck at least 6 hairs from his head, or more depending upon which company/lab she went through.\n\nIt would maybe be easier with the girls because she could say she wants to style their hair and then accidentally pull out a few strands here and there.",
      "created_utc": 1725245321.0,
      "score": 113
    },
    {
      "id": "ll3vtdg",
      "body": "Maybe say the youngest child is temporarily on immunosuppresive meds, and anyone coming into the house needs to take a covid test.",
      "created_utc": 1725257231.0,
      "score": 74
    },
    {
      "id": "ll4kzh4",
      "body": "Yes, and that would be terribly unnecessary if Amy and Tom own up to their assumed affair. It's on them.",
      "created_utc": 1725273794.0,
      "score": 6
    },
    {
      "id": "ll35c87",
      "body": "Yeah. If I knew my mother could've prevented me from kissing my effing half-sibling (or worse!) and she didn't do it I would be LIVID, not to mention traumatized bc why on earth would you let it go that far...",
      "created_utc": 1725244060.0,
      "score": 107
    },
    {
      "id": "log9tfn",
      "body": "To ensure that he would never consider breaking away.  And he was part of it too.  He got a vasectomy to be sure that he wouldn't \"betray\" her by having any more children with you.\n\nHave you found a therapist yet?",
      "created_utc": 1727050924.0,
      "score": 57
    },
    {
      "id": "logmhgh",
      "body": "I think once she and Luke started sleeping together any common sense or reason they had went out the window. Maybe it was their sick way of committing to each other because marriage was out of the question. I still want to know exactly why Luke married you though. Were you his beard? As long as he was married to you people couldn’t question his relationship with Amy too much? I’m sure your financial potential didn’t hurt either. And he may have even loved you in his own twisted way.",
      "created_utc": 1727055809.0,
      "score": 36
    },
    {
      "id": "lotl7rj",
      "body": "OP, I hope you're okay!",
      "created_utc": 1727249674.0,
      "score": 11
    },
    {
      "id": "ll4b7my",
      "body": "😂 Best comment of the thread",
      "created_utc": 1725267247.0,
      "score": 17
    },
    {
      "id": "ll32z20",
      "body": "Do not do that. Go get a DNA test. You've thought about this waaaay too long, you've been silent WAY too long, you're assuming and you're probably right but it's all one big huge fucking lie you've been sleeping on for years, for what? YOU'VE been letting sleeping dogs lie to preserve the status quo. \n\nBe direct. Go get your actual evidence, and use your fucking voice already. Your kids deserve it from you because, clearly, you won't do it for yourself.\n\nIf you're somehow, someway wrong, all the fucking better. GO FORTH.",
      "created_utc": 1725243089.0,
      "score": 285
    },
    {
      "id": "ll7pl2o",
      "body": "Do you actually want to do something about this? There isn’t going to be an easy path that doesn’t have serious consequences to it. You need to choose.",
      "created_utc": 1725314750.0,
      "score": 8
    },
    {
      "id": "ll3sz3i",
      "body": "Just ask your husband. \"Are you the father of her kids?\" \nIf he gets mad like wtf?? just say the answer is yes or no. If they are, he's probably going to want to come clean about it. If they're not, they're not. It's an honest question and if he respects you as his wife, he'll answer. You're bringing it up because you have a valid and possibly critical concern. I don't think it's a good idea to do anything behind their backs. Even if they're dishonest, you don't have to be too. And being direct takes the least amount of time and effort.",
      "created_utc": 1725255561.0,
      "score": 10
    },
    {
      "id": "ll2unl5",
      "body": "It’s either you do it secretly or you blow it up. There really aren’t a lot of options here.",
      "created_utc": 1725239730.0,
      "score": 220
    },
    {
      "id": "ll35udr",
      "body": "You should absolutely do this. If the swab comes back as Luke not being his father, then you are relieved of years of suspicion and you never have to worry about this again. \n\nIf it comes back as him being the father, then you can go from there knowing the truth, having the facts, and them having no room for deniability. I can understand why, as Luke’s been a good husband, you wouldn’t have wanted to know and just been content with your family unit. But now it’s no longer just your marriage at stake, it’s your daughter’s course of her life. I think you have a duty to act. Every minute Tom is allowed around her is a minute where his attraction to her is allowed to grow. The less of that there is, the better.",
      "created_utc": 1725244272.0,
      "score": 99
    },
    {
      "id": "ll3d9ip",
      "body": "OP You have two choices, you can either continue to stick your head in the sand and spend 15+ more years of your life allowing your husband to flaunt his potential mistress in front your face and be a secret sister wife or you can get the DNA from these kids and test every last one of them so that you can be free of the burden that your husband has put on you.",
      "created_utc": 1725247486.0,
      "score": 44
    },
    {
      "id": "ll3uak7",
      "body": "Here’s what I would do \nIs Amy’s birthday coming up ? If not Xmas, I would say to her younger children that you’re planning something for a present for their mom so it’s a secret don’t tell Amy ! I would swab the younger kids under this pretence.\n\nYou could say the same to your kids - the swabs and the tests are for Dads Xmas presents so no spilling the secret!\nI would open a private bank account and reroute my cheques into their if I don’t get the results i want.\n\nIf you are right I would call a family meeting with Amy and your family together and tel everyone at the same time.\n\nThis is the time to go nuclear - they have not cared about the impact on you. Or you daughter and her Son dating. If you don’t do this you leave room for more lies which based on the level of deception could easily paint you as the bad guy. If this is true You are not angry enough, lies upon lies spanning years.",
      "created_utc": 1725256327.0,
      "score": 21
    },
    {
      "id": "ll2xa4q",
      "body": "you could also do familial dna testing between the kids. But they might mention it to the other parents because it's not something folks do all the time.",
      "created_utc": 1725240793.0,
      "score": 35
    },
    {
      "id": "ll8crv7",
      "body": "Someone at the very least would joke about it",
      "created_utc": 1725323490.0,
      "score": 13
    },
    {
      "id": "ll43bje",
      "body": "OP's husband's family is well off and supports her, as OP's family does. \nSounds like a writing exercise.  DNA testing is easy to obtain. Maybe it's not true.  Or maybe OP is a sister wife.",
      "created_utc": 1725261898.0,
      "score": 45
    },
    {
      "id": "ll4bjoj",
      "body": "You know i said to myself “damn they got straight to the point without any confusing wording or tangental details, thats so unlike reddit” and now im reading your comment like “damn…”",
      "created_utc": 1725267469.0,
      "score": 48
    },
    {
      "id": "ll6owyu",
      "body": "Lol read the summary and yeah minus the murder it is.",
      "created_utc": 1725302246.0,
      "score": 10
    },
    {
      "id": "ll5v1nz",
      "body": "Her friend's wealthy parents have been happily financially supporting her without question for almost 2 decades and nobody has pressured her to identify the fathers to put them on child support or to stop having kids she can't independently support. Everyone's just happy to support Amy!!",
      "created_utc": 1725292390.0,
      "score": 21
    },
    {
      "id": "ll5sw1m",
      "body": "Hey, whoever my husband cums into is his business. I don't want to disrespect his privacy. 😌",
      "created_utc": 1725291688.0,
      "score": 16
    },
    {
      "id": "ll8dyh7",
      "body": "3 different dudes yet the kids all look like OP's husband but no one raises an eyebrow.",
      "created_utc": 1725323938.0,
      "score": 7
    },
    {
      "id": "ll5wfqp",
      "body": "It’s so bad.  Can’t believe it has so many heart felt responses 😅",
      "created_utc": 1725292848.0,
      "score": 9
    },
    {
      "id": "ll330qx",
      "body": "Here's another option. sit Tom down and tell him that you will full on agree that he can be with Sophie, they can date, get engaged and even get married one day, that you will welcome him with open arms but under one condition. He has to do a drug test that involves a buccal swab. It it comes back negative for serious drugs then it's full steam ahead. \n\nHave the DNA swab ready when you ask. He's gonna say yes. Use the swab and take it immediately to be tested, before he can tell anyone or anyone can stop you. If anyone asks, you were worried about young people throwing their lives away on drugs. Stick to that story no matter what. If the test comes back showing no common genealogy with Sophie or any of the rest of your children, the green like their relationship and rest easy.\n\nYou already know there is a overwhelming chance they're half siblings. When that comes back, you need to have a sit with the whole family, kids included and out them. The kids have a right to know that they're trying to date their own siblings. Then you deal with the fallout of your husband and Amy lying to you all these years, him raising a whole second family right under your nose and him just fucking off to spend the night with her. They need to own that, to apologize, to work through this and make everyone whole again. This isn't on you. It's on them. Any pain is pain they caused. It's not your fault for bringing the whole thing to light.",
      "created_utc": 1725243109.0,
      "score": 86
    },
    {
      "id": "ll31jlz",
      "body": "Why on earth is he sleeping at her house? That alone is off the rails.",
      "created_utc": 1725242503.0,
      "score": 136
    },
    {
      "id": "ll33wlk",
      "body": "Wait. He spends the night with Amy?! Recently? Currently? .... why? Why on Gods green earth would an adult be having sleepovers at other adults... I'm so confused",
      "created_utc": 1725243467.0,
      "score": 58
    },
    {
      "id": "ll341xi",
      "body": "A good one can send off used items for DNA. Are you saying his parents have been supporting her? If so then they know. Maybe tell your mother in law and see what she says. I think hiring a PI is your best bet.",
      "created_utc": 1725243527.0,
      "score": 13
    },
    {
      "id": "ll355gl",
      "body": "It's pretty simple, he can get court orders for those tests to establish paternity. So quit messing around and do what needs done before your daughter needs therapy for the rest of her life before she sleeps with her half brother.",
      "created_utc": 1725243983.0,
      "score": 77
    },
    {
      "id": "ll40t01",
      "body": "If this isn’t fake. You need to grow balls and not let your daughter commit possible incest. I would talk to your husband by saying you think they should date take the onus off of you and put it on them.  Let them figure out a reason why.",
      "created_utc": 1725260296.0,
      "score": 23
    },
    {
      "id": "ll3ayrm",
      "body": "Go use their bathroom, take some hair from a brush and put it in a zip lock in your pocket. Make sure you use the kids bathroom. Do the same with your husband. Send it off and wait. If even one kid is his, blow it all to hell and demand every one of them is tested. At that point there's no keeping it a secret.",
      "created_utc": 1725246480.0,
      "score": 30
    },
    {
      "id": "ll5exvm",
      "body": "You can absolutely do this in a clever way without anyone knowing. You could arrange a night or weekend where ALL of her kids stay the night on a night/weekend where he is with her, or suggest they hang out together for the night/weekend while you take care of the kids. Do it under the guise of you are apart of the village taking care of her kids and want to give her a break. Your kids will be there too and you want them to spend time together. They'll never suspect 🤭😈\n\nMake it a fun slumber party and order pizza and put on some movies. Bake cookies, pop popcorn, play games, and go all out. Get each kid a zip lock bag labeled with their own travel sized grooming tools (toothbrush, mouthwash, hairbrush, baby wipes, face wash) make it personalized and put some treats in there and get them a toothbrush and hairbrush and other items in a fun color they would like, but also so you can tell everyone's apart. Get them tooth brushes with covers they can put on the brush head. Take pictures of the labeled bags for reference if need be.\n\nMake sure they leave the bag with you so that \"you can put it away for when they stay another night.\" Also make sure each of them gives you the bag before they go home so you can \"replenish it for next time.\" Make sure the toothbrush and hairbrush is in there and they leave everything you need in the bag to collect their DNA. \n\nDo some research first to see what you need to get a conclusive DNA reading. You can also take a spoon they eat from if that's what you have to do.\n\nPlease don't be afraid; you need to find the truth and you can do this in a way where nobody suspects. The truth will be on your side.\n\nPlease update us! We are rooting for you 🥹\n\nWish you NOTHING but the best 🥲🥺☺️💗",
      "created_utc": 1725287009.0,
      "score": 13
    },
    {
      "id": "ll397xq",
      "body": "You were both in the room with her? Was there any emotional bonding with them during that? Where you there when birth certificate forms were filled out? When I say attend I mean in the room during the process",
      "created_utc": 1725245720.0,
      "score": 14
    },
    {
      "id": "ll33q4f",
      "body": "Number 1 is complicated...my friends dad (which wasn't his real dad) had 3 wives and \"worked away from home alot\"...turns out, his mum also had another man. He went from being an only child, to having 13 siblings, to having 4 siblings...He later found out his real dad that he found out at 12 wasn't his real dad, but his mum slept with his \"real dads\" brother 3 months prior to her pregnancy and he was actually his, so he now has 6 siblings...theres alot more to it, as you can imagine, but he never told anyone, using his favourite quote \"not even the FBI can get the rest out of me\"\n\n  \nIf it's been 2-3 months, the deed has probably been done. However, nothing is definite. \n\n  \nHow rare is \"very\" rare? 1 in 100, or 1 in 20,000?\n\n  \nThe fact Amy has had all her children to men that wanted nothing is very unlucky and low chance, however, not impossible, as maybe she had no contact afterwards?\n\n  \nSex life says ***alot***. I saw a story on reddit ages ago where a man gave his wife an unexpected \"treat\" when she got home from \"work\", and he got a mouthful of....something that wasn't his. \n\n  \nHow often does Luke see amy? Is there any possible link between him being more active when he sees amy less?",
      "created_utc": 1725243394.0,
      "score": 34
    },
    {
      "id": "ll34r23",
      "body": "That’s not asking them to side with you, it’s just seeking their opinion on the dynamic of your family situation. \n\nAbove all else, please seek therapy. Either for help with this paranoia and anxiety causing all of this, or to help ride you through the oncoming storm. \n\nIf you ever need to vent etc, my inbox is open. Just a stranger with no ties, giving you a space to talk openly without judgement. All in all I wish you the best.",
      "created_utc": 1725243817.0,
      "score": 19
    },
    {
      "id": "ll30nmh",
      "body": "You'll just have to bite the bullet. Either get the tests done by hook or by crook, or accept that you won't know one way or the other until something happens.\n\nIf you want to take another angle, try to get a cheek swab from the younger kids - a 9-year-old may be easier to fast-talk into getting one. If the twins are half siblings to any of your kids, that's solid evidence of adultery, and you can blow the whole thing up.",
      "created_utc": 1725242141.0,
      "score": 26
    },
    {
      "id": "ll3ddhq",
      "body": "Tom is 17 and very close to legal adulthood. How mature is he? Can you pull him aside and discuss with him privately? Conduct the DNA test with him knowing that the right result means all is well and they are free to date?",
      "created_utc": 1725247537.0,
      "score": 10
    },
    {
      "id": "ll4fbhf",
      "body": "Maybe it's good to consult a professional on the matter for advice, without giving too much away. Reddit can give a lot if conflicting answers. And real life professionals are prone to taking it wrong or going to far.\n\nSo an online counselor or coach that you can contact more or less anonymously is the best idea I can come up with.",
      "created_utc": 1725270071.0,
      "score": 12
    },
    {
      "id": "ll6lvaz",
      "body": "Absolutely terrible idea. You don't want to ever introduce the lie that you've been unfaithful.",
      "created_utc": 1725301220.0,
      "score": 10
    },
    {
      "id": "lm1vm2a",
      "body": "My discernment is that she got pregnant on purpose because she was jealous you two got married and wanted to solidify herself in his life and parents’ lives. He convinced himself it was a mistake that wouldn’t happen again…but it did and three more children came from it. \n\nAlong the way, this became their norm and she accepted it. She was happy to pretend to be your friend because she secretly held this over you. She felt superior to you having his first child and son. She felt superior because of their secret. In her eyes, you’re the other woman and she tolerates you. That’s sick. \n\nI bet I could guess your races. I bet your community and friend circle matches you and Luke’s race. She had a complex about that too. \nNow her poor babies will have the same complex. \n\nLuke’s father is in extreme denial or knows and doesn’t want the truth to come out. Wealthy people love their reputation. This will shame them greatly.",
      "created_utc": 1725762019.0,
      "score": 29
    },
    {
      "id": "ll3n8rh",
      "body": "And the thing is is that “she” doesn’t really even sound that upset 🤷🏼‍♀️🤣",
      "created_utc": 1725252410.0,
      "score": 21
    },
    {
      "id": "ll4q0d9",
      "body": "Also the financial aspects seems odd. I can't imagine anyone paying (also not official grandparents) a whole second family. Kids are expensive!",
      "created_utc": 1725276676.0,
      "score": 6
    },
    {
      "id": "ll5s7fa",
      "body": "Is it possible that Amy is actually your husband's half sister or that her kids are actually the FILs kids? I know this is a stretch but this situation is really strange. Either of these possibilities would explain the inherited allergy and resiblance.",
      "created_utc": 1725291463.0,
      "score": 22
    },
    {
      "id": "ll4fwt3",
      "body": "Ahhh I see , I understand that but you are also the ‘legitimate ‘ mother of their grandchildren so if it did ever turn out to be true about Amy I hope you have a good support system in place, I can’t imagine the anxiety of all this.\n\nBut at the age Amy’s eldest is wouldn’t it be possible for him to have suspicions of them together to as he would be there when Amy is with your husband at her house",
      "created_utc": 1725270479.0,
      "score": 15
    },
    {
      "id": "ll4ldp1",
      "body": "They know the truth and that is why they are treated the same as your kids… probably better I am guessing since they see her as a daughter",
      "created_utc": 1725274039.0,
      "score": 10
    },
    {
      "id": "ll5fbpa",
      "body": "If Amy's children are his then I'd think that he absolutely has a will.  This has been such a protracted development for you that you should be able to keep yourself from becoming emotionally charged and losing your temper.  Aim to win the war and not the battle.  There'd be little reason to rush toward separation and  divorce at the moment.  Your daughter's well being is paramount right now so work toward her wisdom and security in all this.  If her boyfriend is actually her brother she needs to know.  If her father's secret is more important to him than her well being - she deserves and needs to know.  \n\nKeep your head, avoid anger and don't offer Luke, his parents, or Amy an opportunity to project negativity onto you with emotional outbursts or rash actions.  Quietly get solid professional advice in all areas without telling any of them you are doing it",
      "created_utc": 1725287143.0,
      "score": 9
    },
    {
      "id": "ll6hw0q",
      "body": "I'm sorry but it doesn't sound like your in-laws like you at all.\n\nThey may be cordial but loving people would NOT pretend this setup is respectful to you or your marriage.\n\nIt's one thing to love her like a daughter and even love her children, but this enmeshment is just bizarre.\n\nGrown men don't have sleepovers with \"almost family\".\n\nIf it turns out, your husband fathered even one of her children, you have to face the fact that 4 people that you thought cared about you have been lying to your face for decades.\n\nYes, some betrayed partners are willing to ignore it and stay together.\n\nBut, how can you possibly move forward if your suspicions are confirmed?\n\nYou sound nice enough but that's Sainthood level of tolerance.",
      "created_utc": 1725299895.0,
      "score": 8
    },
    {
      "id": "ll312fz",
      "body": "Invite Amy's kids over one at a time and give them all ice pops, the kind in the long skinny wrappers that you put in your mouth. Gather up the wrappers and have the saliva tested. Or give them all new toothbrushes and have them tested. You got this. You're smart to have figured this out and you are capable of following through. YOU need to know for sure one way or another. You deserve to know. Just get it done.",
      "created_utc": 1725242309.0,
      "score": 29
    },
    {
      "id": "ll3wnn4",
      "body": "If your story is is true…\n\nyou realize that if your daughter and her half brother are having sex and the dna confirms he is her half brother, when your daughter finds out, she is going to be traumatized. She is going to need a lot of therapy. \n\nYou need to get off reddit and get the DNA test done on all kids asap. Priorities go to the older half brother. \n\nAnd to add I am 99.9% sure they are all your husband’s kids. Who the hell let’s their husband sleep over another woman’s house. BFF yeaaa suree. They both lovenly played you and made you a fool.",
      "created_utc": 1725257741.0,
      "score": 18
    },
    {
      "id": "ll34u9q",
      "body": "Please update us",
      "created_utc": 1725243854.0,
      "score": 29
    },
    {
      "id": "ll312zq",
      "body": "Exactly what I was gonna suggest",
      "created_utc": 1725242315.0,
      "score": 9
    },
    {
      "id": "ll36em1",
      "body": "This is the only right answer. You need absolute truth at this time as it’s much too risky to continue without it. Your children come first here.",
      "created_utc": 1725244508.0,
      "score": 7
    },
    {
      "id": "ll3a8j3",
      "body": "If your only reason for them not dating is that he could be related I would still tell your husband you are reconsidering. you need to put pressure on the situation.  Aren't you sick of not know? What's are you going to do if it turns out he is the father?",
      "created_utc": 1725246161.0,
      "score": 8
    },
    {
      "id": "lly9fob",
      "body": "And then got pregnant shortly after! My goodness that woman is a sick individual",
      "created_utc": 1725715356.0,
      "score": 27
    },
    {
      "id": "ll75rfe",
      "body": "Get a PI on your case. They can get you so much info. Also, you may want to consider putting a voice activated recorder (VAR) in his car, then one day tell him you’re starting to soften on Sofia and Tom dating, that you feel bad for keeping them apart blah blah blah (you’re not actually softening but he doesn’t know that, it’s more to see if he calls her in his car). \n\nThere’s a user on reddit who discovered her husband had an 8 year affair and she went into full detective mode with it. I forgot her username but will try to find it and link it for you. She doesn’t post much anymore but if you DM her with your story, I’m sure she’ll help you out",
      "created_utc": 1725307955.0,
      "score": 15
    },
    {
      "id": "ll9s0i6",
      "body": "Wait wait wait WHAT, Luke's PARENTS have AMY'S children on their WILL? \n\nWho does that?? They're their grandkids 10000000%",
      "created_utc": 1725347883.0,
      "score": 7
    },
    {
      "id": "ll3m8vu",
      "body": "Because it would still be a hard thing to explain. I was just offering another take on it. It seems fishy though and I agree with most everyone else about incognito testing and get her on birth control. Listen to what your guts telling you and not what us strangers are saying. Moms are seldom wrong when it comes to protecting their children.",
      "created_utc": 1725251884.0,
      "score": 13
    },
    {
      "id": "ll2ws6k",
      "body": "That could at least solve the mystery with the oldest and relieve the stress of siblings potentially getting together. \n\nOrder the kits and get samples from the kids.",
      "created_utc": 1725240592.0,
      "score": 2147
    },
    {
      "id": "ll342gw",
      "body": "This is the way, gotta be sneaky about it",
      "created_utc": 1725243533.0,
      "score": 314
    },
    {
      "id": "ll3c6zh",
      "body": "I'm with this idea. Make it one of those fun history projects.",
      "created_utc": 1725247005.0,
      "score": 190
    },
    {
      "id": "ll35qvf",
      "body": "Only after the son is 18!  Before then, she's stepping all over parental permission laws.",
      "created_utc": 1725244232.0,
      "score": 384
    },
    {
      "id": "ll5ohod",
      "body": "This is a much better idea than having Tom immediately go home to talk about the 23 and me kit.",
      "created_utc": 1725290240.0,
      "score": 199
    },
    {
      "id": "ll5ozvi",
      "body": "this. this.this.this.this.this, THIS. \n\nop, you have the money. spare yourself the worry. test something of tom’s, find out.",
      "created_utc": 1725290408.0,
      "score": 144
    },
    {
      "id": "ll5wgv6",
      "body": "There was a lady who did this to a child she suspected was hers--she took some bits of her hair, had it tested, and found out that was her daughter.",
      "created_utc": 1725292858.0,
      "score": 76
    },
    {
      "id": "ll6oqfu",
      "body": "Even a piece of cutlery he's used to eat food whilst in her house.",
      "created_utc": 1725302184.0,
      "score": 11
    },
    {
      "id": "ll9khjb",
      "body": "I think this would be the best route, especially if she's worried it will cause some stirring up if the ops husband  and bestie are opposed to it. Sounds, like they would get extra upset if she asked the kids to try it. Plus, it could be devastating  to the kids.. best to do it in secret.. then expose.",
      "created_utc": 1725343126.0,
      "score": 7
    },
    {
      "id": "ll3tncm",
      "body": "My grandfather was from a tiny-ass town in western Louisiana. Population MAYBE 200. I’m trying to plan a trip down there for genealogical reasons (he’s dead and I was adopted, bio family SUCKS at keeping family records), and I’m curious just how many relatives I come across. 😂😂",
      "created_utc": 1725255954.0,
      "score": 107
    },
    {
      "id": "ll66ryy",
      "body": "This. Your gut is right. Women’s guts are rarely wrong and you have been shoving this down for a long time. You are apart of the problem. This should have been discussed the first time you felt off. End of story. Who cares if it upsets the balance. Would you rather have that or have a daughter who gets pregnant with her half brothers child. Choose your child over and over again 100000000 times. As a mother that’s the right things. Fuck the dynamics.",
      "created_utc": 1725296233.0,
      "score": 28
    },
    {
      "id": "ll3st51",
      "body": "You didn’t squuueeeeeeel?",
      "created_utc": 1725255466.0,
      "score": 10
    },
    {
      "id": "ll3nn3d",
      "body": "it’s past my bedtime. I still don’t get it 😭",
      "created_utc": 1725252624.0,
      "score": 10
    },
    {
      "id": "ll2wpj7",
      "body": "I've kept it functioning this long, mostly through denial, if I'm being honest. But if things were to be proven true and brought to light, I don't know what I would do. Leaving him is the most logical solution but our kids are still underage, and still friends with Amy's kids.  It's not like there's any path forward where I never see Luke and Amy again, even if I wanted that. \n\nI know what I need to do and I've known it for a while but it feels impossible.",
      "created_utc": 1725240562.0,
      "score": 537
    },
    {
      "id": "ll7ll2u",
      "body": "Honestly she could just say to him what she’s told us. There’s never been talk of a “baby daddy”, all the kids look similar, Luke has spent many a night with Amy, and now that he’s fixed Amy stopped having babies too.",
      "created_utc": 1725313327.0,
      "score": 28
    },
    {
      "id": "llad886",
      "body": "if they are best friends like that then at sime point she told him about baby daddy. my bff was a female for years nothing sexual but we knew every detail of each others lives. i was her male confident so i knew all the baby daddy drama. no way to spend that much time with her and he knows nothing about it.",
      "created_utc": 1725361676.0,
      "score": 29
    },
    {
      "id": "ll66f06",
      "body": "Good way around it",
      "created_utc": 1725296115.0,
      "score": 20
    },
    {
      "id": "ll9od1l",
      "body": "I don’t think she’s afraid of him.\nI think she sees her life imploding and is in a freeze response. \nI mean, it’s been YEARS that she’s suspected this. Idk how she’s kept quiet. I absolutely would lose my grip eventually… I know what that gnawing suspicion feels like and I couldn’t carry it that long.\nMy heart breaks for her and those kids.",
      "created_utc": 1725345515.0,
      "score": 10
    },
    {
      "id": "ll34ply",
      "body": "That's not it. They love Amy, they practically raised her.",
      "created_utc": 1725243800.0,
      "score": 73
    },
    {
      "id": "ll42o8n",
      "body": "Isn’t the fathers name on the birth certificate? Even if it’s not, wouldn’t Amy want her children to inherit their father, if it’s a rich guy like Luke? And there could be medical reasons along the when her children will need info about their father. I wonder what she’s told the kids when they’ve asked about their father(s).. Anyway, I think it will come out sooner or later, but probably very much later. OP should not accuse anyone with no evidence. Chances are she will end up divorced and Luke will marry Amy.",
      "created_utc": 1725261471.0,
      "score": 70
    },
    {
      "id": "ll52qtc",
      "body": "they sell paternity tests at the chemist? wow i had no idea.",
      "created_utc": 1725282464.0,
      "score": 5
    },
    {
      "id": "ll5tco8",
      "body": "This is fucking genius. Thank you.",
      "created_utc": 1725291839.0,
      "score": 295
    },
    {
      "id": "ll5evpn",
      "body": "Yup, this is the only way to progress here. No DNA test = same predicament and torment, no conclusion. DNA test = two outcomes. One, you were right all along and you save your child from incest. Two, you were wrong and you can sleep peacefully knowing no incest is happening, and your husband wasn’t unfaithful. \n\nHow and where you do the DNA test is up to you OP, and you seem smart enough to get a bit creative if you need to, but don’t for a second think you have to turn your head the other way just because “majority rules.” And you don’t need to tell the kids you suspect that Luke is both of their fathers, you can absolutely frame it as “Tom doesn’t know his dad, let’s give him the gift of knowing a bit more about where he comes from.” Or do it secretly, if that sounds better to you.",
      "created_utc": 1725286989.0,
      "score": 23
    },
    {
      "id": "ll88tqk",
      "body": "This. I'd tell the husband that I'm ok with them dating when Sophie is of legal age and then put a tape recorder in his car to see if he calls Amy and tells her",
      "created_utc": 1725321995.0,
      "score": 61
    },
    {
      "id": "ll4lj4j",
      "body": "Cheating is a mild term for what’s happening here. More like having a 2nd family right under her nose and endangering his daughter.",
      "created_utc": 1725274131.0,
      "score": 323
    },
    {
      "id": "ll5w3ko",
      "body": "It could all be in her head though. That one coincidence of the allergy could’ve just made her look at everything suspiciously. So I think getting DNA proof first is the way to go. Imagine if they’ve not done anything and Amy really did just have a secret lover or a few one night stands then it would ruin their relationships. Although it dies kind of seem like they probably see her husbands kids, but the … that’s sooo awful and sooo crazy and so brazen, I honestly can’t imagine anyone doing this to that extent. Like not just cheating, not just cheating with a close friend of yours and your wife’s, not just cheating and having a secret second family but all of the above right under your wife’s and children’s noses? It’s really really sick.",
      "created_utc": 1725292737.0,
      "score": 6
    },
    {
      "id": "ll4cxf0",
      "body": "My guess - the reason is he is filthy rich and so are his parents. Losing that networking of support would cost so much to OP & her kids.",
      "created_utc": 1725268414.0,
      "score": 25
    },
    {
      "id": "ll4oo8a",
      "body": "This! I am surprised she waited this long. It's like she was trying to avoid the truth in her face",
      "created_utc": 1725275959.0,
      "score": 8
    },
    {
      "id": "ll3bcqh",
      "body": "Maybe pretend to change your mind and tell your husband you think it might be ok for them to date after all and gauge his reaction from that.",
      "created_utc": 1725246648.0,
      "score": 384
    },
    {
      "id": "ll2yqe2",
      "body": "I think that this is the best advice I’ve considered about this situation. \n\nIf he - or Amy - know that there is a possibility, it will come up on their faces and in their action steps immediately.\n\nWith Sophie at the center you can listen to what he says and you should get a pretty clear idea of it quickly.",
      "created_utc": 1725241373.0,
      "score": 116
    },
    {
      "id": "ll3r5kf",
      "body": "Someone suggested in a comment about wanting to know if Tom is related to Sophie by doing the test using the excuse of not knowing who his father was and for all we know he might be related to Luke or even OP... so it'd seem pretty innocent to suggest for a test for Tom and Sophie (and OP).",
      "created_utc": 1725254537.0,
      "score": 62
    },
    {
      "id": "ll4jvyl",
      "body": "Who's Gary?",
      "created_utc": 1725273099.0,
      "score": 11
    },
    {
      "id": "ll4zpnu",
      "body": "You need the root for a DNA test. Not just hair",
      "created_utc": 1725281229.0,
      "score": 5
    },
    {
      "id": "ll3hgmm",
      "body": "Or just as awful... imagine discovering one day that you had sex with your sibling and your parents allowed it by trying to keep a secret! That's messed up!",
      "created_utc": 1725249465.0,
      "score": 96
    },
    {
      "id": "ll2vmyd",
      "body": "Ya. \n\nYou are right.",
      "created_utc": 1725240130.0,
      "score": 26
    },
    {
      "id": "ll3hbe1",
      "body": "OP take action! This isn't just a small thing, there are very real ramifications here",
      "created_utc": 1725249394.0,
      "score": 9
    },
    {
      "id": "ll387ca",
      "body": "This, sadly, is the comment OP needs to take to heart the most.",
      "created_utc": 1725245281.0,
      "score": 16
    },
    {
      "id": "ll3kw6i",
      "body": "But tell Amy Sophie isn’t on bc similar to how she never wanted to use bc and see her reaction",
      "created_utc": 1725251183.0,
      "score": 126
    },
    {
      "id": "ll37bbf",
      "body": "Thank you!   I came here to say exactly this.  Birth control now!",
      "created_utc": 1725244897.0,
      "score": 94
    },
    {
      "id": "ll3znyy",
      "body": "You no longer need follicles to test hair for DNA with new technology.  Crazy how advanced it is but I’m not even sure it’s available to the general public.  If it is,  the cost is pretty insane.",
      "created_utc": 1725259580.0,
      "score": 28
    },
    {
      "id": "ll3xj4z",
      "body": "Oooh, that’s good!!!",
      "created_utc": 1725258262.0,
      "score": 15
    },
    {
      "id": "ll39duk",
      "body": "Exactly",
      "created_utc": 1725245790.0,
      "score": 12
    },
    {
      "id": "ll577fc",
      "body": "True, this point has come up a few times. But no one has mentioned that also.. the father and Amy both are well aware that the two kids want to date, since they were both asked and have said no they can’t. While it is all three adults that could have prevented it at this point, the dad and Amy even more so. So if Sophie and Tom have anger after learning the truth, wouldn’t it be especially toward dad and Amy, they’re the ones who knew for sure all along.",
      "created_utc": 1725284191.0,
      "score": 6
    },
    {
      "id": "lotrd7p",
      "body": "Thanks. I'm doing better right now.",
      "created_utc": 1727254042.0,
      "score": 41
    },
    {
      "id": "ll5j9h3",
      "body": "Exactly this. The third option is doing nothing - please don’t do that, it could damage those kids even more.\n\nIs it worth talking to the kid (Tom) and asking him if he’s able to do a DNA test to assuage your concerns? He might be cool with it.",
      "created_utc": 1725288488.0,
      "score": 6
    },
    {
      "id": "ll57enx",
      "body": "Yup. It makes no sense that no one would be questioning why this woman can’t support her own family.",
      "created_utc": 1725284267.0,
      "score": 9
    },
    {
      "id": "ll4lq0x",
      "body": "I think this is the absolute best idea I have read so far.",
      "created_utc": 1725274247.0,
      "score": 12
    },
    {
      "id": "ll3aj15",
      "body": "Right? Even if she lived 6 hours away, I would have put a stop to that on day one. That is wildly inappropriate.",
      "created_utc": 1725246289.0,
      "score": 33
    },
    {
      "id": "ll4bjw8",
      "body": "It seems strange especially since some of the kids are old enough to notice something different about them when he spends the night there.",
      "created_utc": 1725267473.0,
      "score": 8
    },
    {
      "id": "ll48wrx",
      "body": "Came here for this. This whole story sounds so bizarre I almost don’t want to believe it.",
      "created_utc": 1725265680.0,
      "score": 15
    },
    {
      "id": "ll34u84",
      "body": "I mean, they don't call it \"sleepovers.\" Just he'll still sometimes wind up staying over late and crashing there. It's not as common as it used to be, but the pattern is long since established as \"normal\" and that's my fault.",
      "created_utc": 1725243854.0,
      "score": 34
    },
    {
      "id": "ll35kl0",
      "body": "I don't see how. *Amy* could demand tests to establish paternity,  especially if she wanted child support (not like she hasn't been getting the equivalent of child support anyway) But how could Luke?\n\nIf he's the father, he can also just admit paternity. It's not like he's trying to get custody or something. If he isn't the father, he has no need to demand tests. This is a non-starter, and I don't see him wanting to go that far. At that point, he would ask me to just trust him.",
      "created_utc": 1725244158.0,
      "score": 31
    },
    {
      "id": "ll39ml2",
      "body": "Not every time, but when Tom and Kaylee were born, yes. For the twins, we got there late and were just in the waiting room. \n\nI mean yes, there was bonding, but that's not abnormal. Those were emotional moments. I don't really remember about the birth certificates, it all kind of blurs together after a while.",
      "created_utc": 1725245893.0,
      "score": 27
    },
    {
      "id": "ll34iay",
      "body": "That's an insane story. \n\nSophie has been sleeping over at Amy's more often. I don't like it, but I haven't been able to articulate much argument against it. Officially, she and Tom are just friends, and Amy is there to supervise. Sophie's never been a very rebellious child either, but I still don't like it. \n\nI don't want to get too specific about any of the details, but closer to 20,000. \n\nAmy kind of implied that the father(s) didn't even know about her pregnancies. When she suggested as much, I told her she needed to tell them, but I don't think she was really listening. \n\nLuke still sees Amy a lot. He doesn't stay over as often as he used to, but altogether our families still spend a lot of time together. I haven't noticed any link but I can try to keep track.",
      "created_utc": 1725243716.0,
      "score": 40
    },
    {
      "id": "ll351ao",
      "body": "Thank you. I want therapy, but I don't want to have to explain that I want therapy and my husband will inevitably be curious about why.",
      "created_utc": 1725243936.0,
      "score": 17
    },
    {
      "id": "lm2icil",
      "body": "I think you're right on the money, and it makes me so sad. She was never going to be pushed out of the family for my sake. Had she been as she presented, as Luke's \"sister\" she would have had a place in my heart and in my family for the rest of our lives. Jim and Cat were never going to push her away, not after what she's been through. But with what she's done now, they might, when it all comes out. I don't know. I don't necessarily even want that, but, they might. \n\nI don't think it's a question of culture/race. She was essentially brought up in Luke's family/culture, so her upbringing was one of his race, if that makes any sense. I don't know if it matters, but she was born/raised Jewish before being taken in by Luke's family. Luke's family was Christian but, it wasn't something they took very seriously. \n\nJim never struck me as someone who cared about reputation, but I could be wrong, I've never really seen his \"standing\" under threat before.",
      "created_utc": 1725772400.0,
      "score": 25
    },
    {
      "id": "ll5ssoe",
      "body": "A disturbing thought. \n\nI don't see how FIL could be the father of Amy's kids. They really don't spend enough time together for that to make sense. \n\nAs far as Amy being FIL's kid. They took her in, unofficially, when she was like eleven. They never formally adopted her but she was staying over at Luke's place more often than she wasn't. Her home situation was bad. \n\nI could see Luke and Amy potentially being half-siblings were it not for their affair. But as it is, there's no way it could be true.",
      "created_utc": 1725291658.0,
      "score": 21
    },
    {
      "id": "ll73s9z",
      "body": "They've always treated me like a daughter too. \n\nEven if Luke has been cheating on me, it doesn't mean his parents knew. \n\nIf my suspicions are confirmed, I don't think I could just put up with it, no.",
      "created_utc": 1725307297.0,
      "score": 15
    },
    {
      "id": "llyca7t",
      "body": "Definitely pathological. Amy has to be a sociopath.",
      "created_utc": 1725716528.0,
      "score": 17
    },
    {
      "id": "ll3bidx",
      "body": "She really only needs a sample from 2 kids, Tom specifically and one of hers, if it’s positive that they’re related she can assume they all are, if its negative she can stop stressing about them being a couple.",
      "created_utc": 1725246713.0,
      "score": 1311
    },
    {
      "id": "ll517zs",
      "body": "Tell them it's a school project. Do Amy's kids one week, then yours the next, hopefully Luke and Any won't notice and the kid's won't notice you're doing both families. You don't even need the dad's dna if the kids match.\nLuke has 2 wives, why he didn't just marry her at the beginning?",
      "created_utc": 1725281853.0,
      "score": 387
    },
    {
      "id": "ll6pnch",
      "body": "Yes please do this and update us",
      "created_utc": 1725302492.0,
      "score": 10
    },
    {
      "id": "ll77jg8",
      "body": "The year my brother did the  ancestry dna thing- we held a ‘heritage’ dinner for thanksgiving that year.  Everyone was secretly given a country and whatever type of dish (like mains or sides) from the list and at dinner we all revealed our country and had a little history lesson on the dishes we made. It was actually really cool! Maybe she could play it off like this, bc they definitely seem close enough to be sharing holidays.",
      "created_utc": 1725308554.0,
      "score": 30
    },
    {
      "id": "ll3skm0",
      "body": "Don’t kids have medical freedom at 13? I know my parental rights to my kids medical files end when they turn 13, maybe that’s a state thing?",
      "created_utc": 1725255333.0,
      "score": 132
    },
    {
      "id": "ll6rc9k",
      "body": "Luz and her abducted daughter, Delamar! \n\nJust need one single strand of hair. This is the way, OP.",
      "created_utc": 1725303061.0,
      "score": 46
    },
    {
      "id": "ll5igaq",
      "body": "Story time: my grandmother was born in one of those tiny ass towns in Arkansas with a weird ass name and a population that barely breaks into triple digits. I was on my way to a family reunion in Little Rock and decided to stop along the way in this town to see the house my grandma was born in, if it still existed. \n\nDowntown consisted of a post office, a gas station, and a stop sign. I went to the gas station and went inside to get some food and see if the cashier could help me out with finding the place as I only had some very vague directions from my grandma. \n\nI got up to the counter and the cashier, a tiny lady older than Methuselah, says to me ‘you one of (Grandma’s name)’s girls? You look too young to be a daughter, you must be a granddaughter. Tell her cousin Rosa says hi.’\n\nThis 900 year old lady that I had never seen before in my life was my grandma’s cousin on her daddy’s side, and apparently the family resemblance is strong enough between my grandma and I that she recognized me despite having never met me. It was one of the craziest moments of my life. \n\nCousin Rosa was able to help me find the house, and even gave me a Snickers bar on the house. Such a nice lady, if a bit creepily omniscient lol",
      "created_utc": 1725288213.0,
      "score": 132
    },
    {
      "id": "ll57hm1",
      "body": "Just a quick aside… did ancestry dna tree and found the same husband wife couple like five times across one set of grandparents… a small town situation… and I kept yelling at these people that’s been dead for generations to get out of town and find some new folks to fool around with🤣",
      "created_utc": 1725284298.0,
      "score": 47
    },
    {
      "id": "lma0894",
      "body": "this !! she would rather live in LaLa happy go lucky we have a perfect family & friendship land than admit and accept the love of her life most likely fathered 4 other kids with his best friend right under her nose for the same amount of time he was having kids with her and literally disrespecting her with the bestie their entire relationship & marriage. Like what kind of insanity is this? its like sister wives accept she didnt know she was one. Have some self respect & dignity & confront your husband & bestie & demand paternity. Your child's whole lives are at stake here yours and hers especially since incest is not only morally wrong its illegal.",
      "created_utc": 1725890380.0,
      "score": 7
    },
    {
      "id": "ll3svne",
      "body": "my bad, i YEEHAWED at this joke😂",
      "created_utc": 1725255506.0,
      "score": 12
    },
    {
      "id": "ll3obuz",
      "body": "Keep a-strummin on that noggin, it'll come to",
      "created_utc": 1725252986.0,
      "score": 13
    },
    {
      "id": "ll35coj",
      "body": "If my Mom knew (or thought ) I was dating my 1/2 brother and did nothing - I would never speak to her again. You need to act on this now.",
      "created_utc": 1725244065.0,
      "score": 905
    },
    {
      "id": "ll2xl7y",
      "body": "It feels impossible because it IS impossible. \n\nThis was nowhere in my marriage manual, that’s for sure.\n\nI keep trying to imagine what I’d say. \n\n“You and I have been a team for… and our family is the most important thing to me. What we have built is beautiful. And I feel like that means we can talk about anything. I need to talk about something I can’t let go of and know that what I need is honesty.”\n\nAnd that’s as far as I can get because the entire thing is absolutely bonkers if it’s true. Could sell the movie rights to this it’s that kind of dramatic.",
      "created_utc": 1725240919.0,
      "score": 325
    },
    {
      "id": "ll37weq",
      "body": "What an impossible situation. You sound like a wonderful woman. Just keeping shit together for the kids. All of them, not just your biological kids. \n\n\nI have a question.. you said your husband is not opposed to them dating. Do you trust him to not let his daughter be intimate with her brother? It'd be REALLY messed up if he was... Are you comfortable with that?\n\n\nYou're the only one with the intimate details of why you REALLY think this is a possibility. Please, please, please for the sake of the children at least somewhat trust your gut.",
      "created_utc": 1725245148.0,
      "score": 147
    },
    {
      "id": "ll3q45n",
      "body": "If kids are underage only need to see Luke legally! Amy is out of this picture legally! Most likely the kids won't end up being friends due to finding out the betrayal! Think of only your kids and self! They haven't! ",
      "created_utc": 1725253955.0,
      "score": 10
    },
    {
      "id": "ll6omdk",
      "body": "The children - both sets - are growing; they can have a relationship with each other independently of their parents in a few years. If they are related, they do deserve to know. You also deserve to react to your husband and his friend exactly as you wish; if what you suspect is true, don't let them try to guilt you into making things easier for them and do tell the children, not in anger (if you can manage that) but so that they know they have more family near to them.\n\nI feel for you so much, it must feel like you're trapped in a nightmare right now. Do you have family or close friends? I can promise you that if you were my sister or my bestie, and you confided in me that you'd found this out, then any feelings of warmth or friendship I felt for your husband and his best friend would immediately turn to ash I guess what I'm saying here is that you probably do have people in your life whom you can rely on, even if you don't realise.",
      "created_utc": 1725302146.0,
      "score": 4
    },
    {
      "id": "llpve8y",
      "body": "This comment needs more attention. Especially after the update.\n\nLuke should absolutely know who the father is if him and Amy are attached at the hip",
      "created_utc": 1725582385.0,
      "score": 5
    },
    {
      "id": "ll3n4m4",
      "body": "I think his parents know. That's why they're generous with money.",
      "created_utc": 1725252350.0,
      "score": 271
    },
    {
      "id": "ll37lhd",
      "body": "But who cares?\n\nIt sounds like you care more about the repercussions of them finding out you suspect them, than your daughter probably having sex with her ~~step~~ brother.\n\nYour daughter might probably go through something very traumatic if you don't do something yet you just want to bury your head in the sand.",
      "created_utc": 1725245018.0,
      "score": 246
    },
    {
      "id": "ll3qgsl",
      "body": "WTF. You have to prioritise your daughter. \nThe time for going along and ignoring your concerns is over. Get out of your cosy corner and take responsibility for your kid.\nIf there was nothing they would have been ok with the relationship.\nIf the youngsters get cliser desaster is programmed.\nGet your big girl pants and do something.",
      "created_utc": 1725254150.0,
      "score": 78
    },
    {
      "id": "ll601zr",
      "body": "Wow, I am sorry about all of this. I feel for you, not only for these new developments but also for having to out up with this for so long. This gut feeling of yours relentlessly building up over the years is a very hard thing to have to push down.\n\nI think you should take action. Tom and Sophie think they have something beautiful. If this whole thing is true, they'll be disgusted by it. And if feelings grow and they find out you knew for long and did nothing about it they'll blame you. Idk about Tom. But Sophie, your girl, will blame her mom. She'll be pissed at her dad but she'll take it out on you. \n\nThese two kids can come out really messed up out of this.\n\nCan you take a sample for DNA testing behind their backs? Cup, hair,... I know this morally wrong but there's a lot at stake. Otherwise, you can blow up the entire thing. Have a sit down with Luke, Amy and your in-laws. And blurt it out. Ask for the truth and demand for paternity tests. Or, you can pretend to have changed your mind about Tom and Sophie and Even suggest to your husband that you have reasons to believe something \"physical\" has happened between them (nothing major). See how he reacts?\n\nI am surprised at your serenity and ability to keep your head so leveled with this. Your husband might have been having an affair for so long and you not confronting and having to be best friends with his mistress. This is a relationship he has been taking care of for such a long time, is someone he MUST have deep feelings for. So many many lies. How can you be ok not knowing? Kids aside, what about you?",
      "created_utc": 1725294034.0,
      "score": 13
    },
    {
      "id": "ll3c6kx",
      "body": "[deleted]",
      "created_utc": 1725247000.0,
      "score": 8
    },
    {
      "id": "ll85ca3",
      "body": "Ok and they'd be ok with the girl they practically raised leading a double life with their married son? Hurting their grandbabies, because make no mistake, your children will be gutted if this ends up being true. And if they do stand up for her instead of you, then you need to run as fast as you can from that toxic environment.",
      "created_utc": 1725320670.0,
      "score": 5
    },
    {
      "id": "ll6aa8b",
      "body": "Not every person puts the father’s name on the birth certificate. For example my birth certificate says “withheld”.",
      "created_utc": 1725297384.0,
      "score": 17
    },
    {
      "id": "ll867ok",
      "body": "They can still make a claim for inheritance even without the birth certificate. Just you wait, that DNA test will come out real quick when it comes to claiming money.\n\nOP should get to the bottom of it and get a divorce so that at least she's guaranteed half. Otherwise, if she stays married and waits, without a will, she's going to be competing against 9 other people making a claim (8 kids and Amy). Not saying they'd all be successful but some success depending on their probate laws.",
      "created_utc": 1725320994.0,
      "score": 14
    },
    {
      "id": "ll5vi8g",
      "body": "If this works, you need to post an update! Good luck OP, we’re all wishing the best",
      "created_utc": 1725292543.0,
      "score": 107
    },
    {
      "id": "ll6q5ud",
      "body": "if you have the money, I would go to an actual paternity testing facility. they will give you a swab and swab their mouth. You can do a covid19 test for an oral swab. So you can keep the same story.",
      "created_utc": 1725302665.0,
      "score": 27
    },
    {
      "id": "ll5xugx",
      "body": "OP, don’t listen to that poster. It’s not going to work. I’ve done 23 and me and it’s not the same as a COVID test. 23 and me requires you to spit into a tube until you hit a certain line. You have to spit first thing in the morning before even brushing your teeth or eating or having coffee or even drinking water (it dilutes the spit). If you do not spit enough (it actually takes more effort than you would expect to get enough spit in there) or you have other substances in your saliva, it will not detect anything and you will have wasted money.",
      "created_utc": 1725293310.0,
      "score": 64
    },
    {
      "id": "ll68ixa",
      "body": "As the 23 and me rest requires spit just ask the two kids \"comre to the sink, rinse your mouth out, spit in this tube, makes the result more reliable, that's right up to the line\". There's always a way op. Take it from someone who had to lie a lot growing up (for survival reasons), there's always a way to throw people off the scent. Don't get phased just roll with the punches and adapt.",
      "created_utc": 1725296807.0,
      "score": 22
    },
    {
      "id": "ll6wlad",
      "body": "FYI- 23and me makes you spit in a tube, but MyHeritage is a mouth swab.",
      "created_utc": 1725304859.0,
      "score": 13
    },
    {
      "id": "ll6so1g",
      "body": "If you are sure your daughter wants to date him you need to test them. You tell him that you wont let him date your daughter until he does the test to prove no relation (no need to name husband) since his Mom wont name his father. Tell him to keep it between you as there is no reason to shame her for her choices. Its just to be safe so that if they fall in love there wont be any issues with babies. If they are old enough to even be seriously dating they are old enough for this talk and able to understand the discretion needed when dealing with something so serious and sensitive.",
      "created_utc": 1725303512.0,
      "score": 10
    },
    {
      "id": "ll6ugwt",
      "body": "Also talk to a lawyer - his family is wealthy. If your husband goes nuclear once he’s discovered you’ve done this, you’ll want legal advice to help protect the kids.",
      "created_utc": 1725304129.0,
      "score": 9
    },
    {
      "id": "ll6z8c2",
      "body": "I honestly wouldn’t bother with 23 and me. Go for direct proof, test Luke and one of Amy’s children. All you need is a hair sample - easy to take from a hairbrush I think?",
      "created_utc": 1725305765.0,
      "score": 8
    },
    {
      "id": "ll6qyqs",
      "body": "Yeah, she’s essentially a sister wife at this point it sounds like.",
      "created_utc": 1725302934.0,
      "score": 46
    },
    {
      "id": "ll5aes6",
      "body": "yuppppp well said",
      "created_utc": 1725285384.0,
      "score": 7
    },
    {
      "id": "ll5m7ud",
      "body": "Yup! This is beyond sick",
      "created_utc": 1725289475.0,
      "score": 5
    },
    {
      "id": "ll88hu1",
      "body": "The sleepovers are still inappropriate. A married man has no business having sleepovers with another woman who isn't his wife.",
      "created_utc": 1725321869.0,
      "score": 9
    },
    {
      "id": "ll3hdp9",
      "body": "I'd be all about this bluff in the same position. Go hard, and tell him you've already given your blessing and they're out on a date at the cinema right now...",
      "created_utc": 1725249426.0,
      "score": 204
    },
    {
      "id": "ll3omkj",
      "body": "Casually mention that you have been thinking about it and they would make a cute couple and that if they get married planning a wedding with Amy would be really fun.",
      "created_utc": 1725253143.0,
      "score": 153
    },
    {
      "id": "ll3tgff",
      "body": "Right!? Then she won't seem like the bad guy in this situation because it appears the kids think she's the one that's holding them back.",
      "created_utc": 1725255843.0,
      "score": 53
    },
    {
      "id": "ll3gi88",
      "body": "this!",
      "created_utc": 1725249008.0,
      "score": 51
    },
    {
      "id": "ll3lomb",
      "body": "Oh shit that will tell won’t it?",
      "created_utc": 1725251590.0,
      "score": 53
    },
    {
      "id": "ll3wzra",
      "body": "This is how to handle it. No accusations that might blow OP’s family apart, just see how Luke reacts.",
      "created_utc": 1725257939.0,
      "score": 31
    },
    {
      "id": "ll3mly3",
      "body": "Yes, I agree, do this OP and see what him and Amy say.",
      "created_utc": 1725252077.0,
      "score": 30
    },
    {
      "id": "ll57qwz",
      "body": "Yea I mean it’s not like they’re siblings???😉",
      "created_utc": 1725284396.0,
      "score": 5
    },
    {
      "id": "ll4jva5",
      "body": "In another comment, OP had brought up genetic testing and it was specifically nixed by Luke. It would directly contravene Luke's wishes. It's also sending a genetic test on a kid who isn\"t hers which you have to recognize is at least dicey",
      "created_utc": 1725273086.0,
      "score": 11
    },
    {
      "id": "ll5cvel",
      "body": "Luke's gay cousin who's the person Amy was really attracted to. Gary said only way he and Amy could hook up is if she brought Luke in too.",
      "created_utc": 1725286274.0,
      "score": 11
    },
    {
      "id": "ll4qt3p",
      "body": "That's what I want to know! How many kids does he have?",
      "created_utc": 1725277091.0,
      "score": 5
    },
    {
      "id": "ll3lcba",
      "body": "Exactly.",
      "created_utc": 1725251411.0,
      "score": 7
    },
    {
      "id": "ll5nrz9",
      "body": "Oh look, Satan showed up.",
      "created_utc": 1725290002.0,
      "score": 62
    },
    {
      "id": "ll43897",
      "body": "Evil yet brilliant.",
      "created_utc": 1725261836.0,
      "score": 20
    },
    {
      "id": "ll6rpj3",
      "body": "And why HIS family is supporting her?",
      "created_utc": 1725303185.0,
      "score": 10
    },
    {
      "id": "ll4g8h1",
      "body": "So many questions: is he sleeping in her room? How often does he stay over?",
      "created_utc": 1725270700.0,
      "score": 9
    },
    {
      "id": "ll49vx2",
      "body": "I mean, it’s almost definitely creative fiction, but if it’s not, Jesus.",
      "created_utc": 1725266352.0,
      "score": 13
    },
    {
      "id": "ll367e8",
      "body": "Sorry, it just seems completely abnormal for me and my situation. If my husband stayed the night even at a male friends house at this point in our lives, I would find it terribly weird. We have beds at our own houses. Where does he sleep at her house? Does she have 6 bedrooms? Where does your husband sleep at when he's there? Even just thinking about myself doing a sleepover somewhere feels odd, maybe that's just me though. \n\nI find it really commendable that you've been able to tolerate whatever is between them all these years, I'm sure that hasn't been easy at all. Without testing I think your best bet is to encourage Sophie and Tom, because Tom's not wrong, he probably will treat her right and if you've seen with your own eyes his adoration for her it wouldn't be a terrible idea for you to encourage it and let Luke & Amy stop that freight train.",
      "created_utc": 1725244424.0,
      "score": 34
    },
    {
      "id": "ll35shz",
      "body": "Before i reply to that.. answer me this. Was he in the hospital with Amy every time she gave birth?!",
      "created_utc": 1725244249.0,
      "score": 110
    },
    {
      "id": "ll3al6i",
      "body": "Luke could totally request through the courts that he wanted paternity tests, saying he might be the father of those children. It happens all the time. My brother just did it 2 months ago. It's often how males establish their rights as father's and becoming common practice to the courts for establishing paternity ro prove their right to said child.",
      "created_utc": 1725246315.0,
      "score": 23
    },
    {
      "id": "ll4bcps",
      "body": "If Amy won't give in to the tests in the face of EVERYTHING, you have your answer.",
      "created_utc": 1725267340.0,
      "score": 7
    },
    {
      "id": "ll3abq8",
      "body": "I think the fact that of all the people that could be in the room when birthing those children, your husband was invited in, is very telling. I wouldn’t have wanted my brother anywhere near me when I gave birth. Afterwards, absolutely. During? No. \n\nThis whole story is so wild to me. I’m so sorry you’re dealing with this. I completely understand your urge to not want to do anything, because this is so many levels of traumatic. But you really have to bite the bullet now that your daughter is involved.",
      "created_utc": 1725246200.0,
      "score": 77
    },
    {
      "id": "ll3b445",
      "body": "It is abnormal. You're literally a sister wife.",
      "created_utc": 1725246542.0,
      "score": 66
    },
    {
      "id": "ll3v9i9",
      "body": "Are you saying Luke was in there during the birth like a father? As well as you ? That right there would've been me putting a stop, so inappropriate! ",
      "created_utc": 1725256902.0,
      "score": 26
    },
    {
      "id": "ll39zbw",
      "body": "Have you ever seen the kids' birth certificates? Maybe looking into those, but other than that, even if you are wrong, you have a valid reason to be concerned just on the physical similarities and then the allergy to question it. You're worried about blowing everything up, and I guess I don't understand why? Like anyone who was in your spot would have had major red flags and concerns, why not bring it up?",
      "created_utc": 1725246049.0,
      "score": 5
    },
    {
      "id": "ll35r4q",
      "body": "Hormonal teenagers will sadly do what hormonal teenagers do.\n\n  \nThat's okay about not wanting to go into specifics. Don't do anything you don't feel comfortable with. If it's rarer than 1 in 1000, then that is either insane coincidence or...you know. In our family, we have a heart condition around 1 in 2000 people have (its mostly genetic so, as you can imagine, if you know 1 person with it, there is a 50% chance a person in their family has it...for example, 50% I have it, 50% chance my sister has it, 50% chance my brother has it etc). I have **NEVER** talked to a person who has even heard of it.\n\n  \nHer not telling the father(s) is strange, but she might have had reasoning for it.\n\n  \nMen around mid to late 30s start losing their sex drive, gradually. If he was cheating, this could play a role. However, he might be staying there less as the kids are older and don't need as much support as they once did.",
      "created_utc": 1725244234.0,
      "score": 24
    },
    {
      "id": "ll35tp8",
      "body": "The difficulties of raising teens. Navigating dating, rules, bettering communication between parent and child. \nYou don’t need to hide why, just reframe. \nThere are options out there for online/telehealth therapy you can do from home without anyone even knowing about it.",
      "created_utc": 1725244264.0,
      "score": 20
    },
    {
      "id": "ll3l23p",
      "body": "just make anything up: pretend you have some random phobia you want to work on, you're feeling seasonal depression, just wanted to try it out cuz u keep hearing about how it's sooo helpful, etc.",
      "created_utc": 1725251266.0,
      "score": 12
    },
    {
      "id": "ll4x4wa",
      "body": "You can explain life transitions, preparing for empty nest....",
      "created_utc": 1725280118.0,
      "score": 6
    },
    {
      "id": "lm2k2pt",
      "body": "Christian is not a race but I guess you mean she looks ethnically Jewish but was raised Christian and follows a Christian lifestyle, which makes sense",
      "created_utc": 1725773353.0,
      "score": 8
    },
    {
      "id": "ll8mojp",
      "body": "Here's a more hopeful thought. Maybe she just used a sperm doner and picked someone that had physical attributes like your husband and his family since she was close to them for most of her life.",
      "created_utc": 1725327306.0,
      "score": 6
    },
    {
      "id": "ll5xrnx",
      "body": "Maybe I missed this but you are sure Amy and Luke had/having an affair? I thought you just had suspicions but no real solid proof.",
      "created_utc": 1725293284.0,
      "score": 12
    },
    {
      "id": "llygu1w",
      "body": "Her husband too. The two of them are completely nuts",
      "created_utc": 1725718296.0,
      "score": 10
    },
    {
      "id": "ll5d3xn",
      "body": "I'm hoping for all the kid's sake that they are not siblings.",
      "created_utc": 1725286360.0,
      "score": 273
    },
    {
      "id": "ll7jid2",
      "body": "I have a suspicion that he wanted to marry Amy, but being a different race affected his choice somehow.",
      "created_utc": 1725312613.0,
      "score": 138
    },
    {
      "id": "ll7qmik",
      "body": "THIS ^ ALL of This ^",
      "created_utc": 1725315129.0,
      "score": 23
    },
    {
      "id": "ll3tggl",
      "body": "They do. I turned 13 in March 2001, and that summer, I accidentally swallowed some lake water that must’ve contained fecal matter, or something else insanely bad. I felt like crap for a week. Mom took me in to the doctor because I wasn’t doing anything. Not vomiting, not…evicting waste in any other fashion. My stomach felt like period cramps, but nothing was coming out. Doctor asked my mom to leave the exam room for a minute, because he had to ask me if there was any way I could be pregnant. No, zero chance. He even explained to my mom that he HAD to ask her to leave the room for that question, and what my answer had been. Since mom could always read me too well, she believed us.",
      "created_utc": 1725255843.0,
      "score": 179
    },
    {
      "id": "ll48z96",
      "body": "This is mostly specific in California and Oregon.  Many states do not allow free medical agency of people under 18.",
      "created_utc": 1725265728.0,
      "score": 10
    },
    {
      "id": "ll799fv",
      "body": "That whole story was wild! Like, Hollywood could not come up with a better plot.",
      "created_utc": 1725309132.0,
      "score": 6
    },
    {
      "id": "ll7h84u",
      "body": "OMG This story haunts me to this day!! I cannot even imagine! 😭😭😭",
      "created_utc": 1725311823.0,
      "score": 5
    },
    {
      "id": "ll7zidk",
      "body": "My mom's little town of 3000 had all class reunions every 5 yrs. We went to them and random strangers would ask \"are you grandma's granddaughter\" or \"are you mom's daughter\". One of her nursing home aides would call us twins.",
      "created_utc": 1725318457.0,
      "score": 8
    },
    {
      "id": "ll7hnds",
      "body": "This is 100% something I would do! LOL\nI yell at the tv, too. The looks I get from my husband! 🤣🤣 \nThe dog, on the other hand, is used to it. 🤷‍♀️",
      "created_utc": 1725311969.0,
      "score": 8
    },
    {
      "id": "ll3py3e",
      "body": "OH MY GOD.",
      "created_utc": 1725253862.0,
      "score": 9
    },
    {
      "id": "ll3plj2",
      "body": "Can i get a dm on this? I also don’t get it and it’s driving me mad",
      "created_utc": 1725253673.0,
      "score": 6
    },
    {
      "id": "ll5noac",
      "body": "And that's truly the kindest outcome because depending on how far that relationship got, Snapped would need 2 episodes to cover my story.",
      "created_utc": 1725289968.0,
      "score": 214
    },
    {
      "id": "llbcoau",
      "body": "Well and that’s even more true for Luke and Amy. They would for sure know and that is reprehensible. Their whole families would blow up out of disgust from these kids alone.",
      "created_utc": 1725375711.0,
      "score": 30
    },
    {
      "id": "llcxg36",
      "body": "This is a pretty complicated situation.",
      "created_utc": 1725393917.0,
      "score": 8
    },
    {
      "id": "ll31c32",
      "body": "Truth is, if they've been hiding it for that long, they won't just admit it that easily...\n\n  \nSurely luke wouldn't want his Daughter to carry his sons child, tho?",
      "created_utc": 1725242418.0,
      "score": 140
    },
    {
      "id": "ll38h5h",
      "body": "Thank you. \n\nHe is opposed to it. He agrees that Tom is too old for Sophie. But part of me does worry that he'll let it happen to protect the status quo.",
      "created_utc": 1725245399.0,
      "score": 219
    },
    {
      "id": "ll66lrz",
      "body": "Ding ding ding",
      "created_utc": 1725296177.0,
      "score": 59
    },
    {
      "id": "ll381w5",
      "body": "Not step brother. Blood brother. \n\n\nEdited to add: I 100% agree with Enamoure. ",
      "created_utc": 1725245215.0,
      "score": 104
    },
    {
      "id": "ll3oe1v",
      "body": "There’d be a chance of results being inconclusive due to insufficient material (ie not enough spit).",
      "created_utc": 1725253018.0,
      "score": 12
    },
    {
      "id": "ll5xx8r",
      "body": "It won’t work. I’ve done 23 and me. Completely different testing process",
      "created_utc": 1725293335.0,
      "score": 32
    },
    {
      "id": "ll6r9pv",
      "body": "But there are other DNA tests that can be done with swabs. I think that you can even do them and do it at home",
      "created_utc": 1725303036.0,
      "score": 36
    },
    {
      "id": "ll73zcu",
      "body": "Easy enough to do with her own children who live in the house but not so much with Amy’s children. Spit has to be first thing after fasting for several hours (hence why people do it first thing in the morning even before brushing teeth). If there are other DNA kits on the market, I’d go with those. Honestly I’d hire a PI since she has the money to do it. PI can get her a LOT more info than she even thinks is possible",
      "created_utc": 1725307364.0,
      "score": 8
    },
    {
      "id": "llaa7uu",
      "body": "If this were consensual maybe it would be cute and all the kids would know they were siblings. But without consent it's a horrible life ruining mess for everyone. Unless OP is wrong of course. But it's unnerving that they have left this much room for her to get this convinced",
      "created_utc": 1725360023.0,
      "score": 3
    },
    {
      "id": "ll61mxf",
      "body": "This literally made me lol! I’m 💀…",
      "created_utc": 1725294553.0,
      "score": 10
    },
    {
      "id": "ll415oe",
      "body": "Excellent question",
      "created_utc": 1725260515.0,
      "score": 17
    },
    {
      "id": "ll3wj1g",
      "body": "Yep! They think she knows and deep down she does! Her husband is ‘lucky’ man to have two wives and not be branded a cheater",
      "created_utc": 1725257665.0,
      "score": 25
    },
    {
      "id": "ll3a5x8",
      "body": "The Birth Certificates have no listed father, as far as I recall. Because Amy didn't name a father.",
      "created_utc": 1725246128.0,
      "score": 22
    },
    {
      "id": "lm2l2zc",
      "body": "Yeah, I mean upbringing/culture. \n\nIn terms of ancestry, Luke and I are both Asian, Amy is White.",
      "created_utc": 1725773919.0,
      "score": 25
    },
    {
      "id": "ll8n3nk",
      "body": "But what are the odds that she would get the same donor every time?\n\nAnd if they were donor babies, why wouldn't she just tell us that? \n\nWhy would she get pregnant four times when she was a single woman relying on financial support from her friends? She's impulsive, but not stupid.",
      "created_utc": 1725327467.0,
      "score": 29
    },
    {
      "id": "llygud5",
      "body": "I’m curious as to why that would matter?",
      "created_utc": 1725718299.0,
      "score": 6
    },
    {
      "id": "ll7gnn6",
      "body": "This is an absolutely wonderful! I live in a state where it’s 16 but even then it isn’t always honored unless the minor is married (which is an entirely different level of fucked up). Being able to privately speak with a minor at 13 could save their lives.",
      "created_utc": 1725311628.0,
      "score": 54
    },
    {
      "id": "ll7ro8m",
      "body": "The crazy part for me is that Luz knew her child wasn’t dead like the fire inspector said and she wouldn’t “accept it” so she and her husband divorced. She was right all along! That’s mother’s intuition on a level that can’t be explained. Just crazy.",
      "created_utc": 1725315512.0,
      "score": 27
    },
    {
      "id": "ll3rlnp",
      "body": "It's an inbred hillbillies playing the banjo like from the movie Deliverance kinda joke.",
      "created_utc": 1725254785.0,
      "score": 41
    },
    {
      "id": "ll3ra21",
      "body": "Me too! I have no idea. Feeling stupid.",
      "created_utc": 1725254604.0,
      "score": 5
    },
    {
      "id": "ll39q0m",
      "body": "Then screw him. I know it's just a thought/intrusive thought.. but if it bothers you this much. It's not worth your daughter's sanity. It'll mess her up for life, dude. ",
      "created_utc": 1725245935.0,
      "score": 155
    },
    {
      "id": "ll3wmm5",
      "body": "You owe it to your daughter to get the DNa tested… you don’t need their consent… get a strain of hair from one of the twins or something and get your husbands DNa and send off yourself",
      "created_utc": 1725257724.0,
      "score": 99
    },
    {
      "id": "ll6euwd",
      "body": "Surely he would not let his daughter(and son?😬) commit incest just to protect the status quo. That would be even more messed up than having 2 families secretly; which on its own is mind-blowing",
      "created_utc": 1725298895.0,
      "score": 28
    },
    {
      "id": "llc03rj",
      "body": "Having my husband continue to buy the slushie flavor I like to keep me happy is protecting the status quo. (Fuzzy Navel.)\n\nWhat your husband is doing is potentially illegal. If I'm not wrong, it is illegal, unethical, and immoral in the United States and probably most countries and cultures worldwide to date, marry, and/or have sexual relations with someone who is that close in familial relationship.\n\nWhen do you want them to find out? When they go to have the blood test to get married? When they do a 23andMe and find out that way? When someone confesses on their deathbed?",
      "created_utc": 1725383289.0,
      "score": 5
    },
    {
      "id": "ll38l1g",
      "body": "Thanks for the correction, exactly even worse",
      "created_utc": 1725245447.0,
      "score": 40
    },
    {
      "id": "ll82b6b",
      "body": "Same. I actually cackled a little. 😆",
      "created_utc": 1725319522.0,
      "score": 6
    },
    {
      "id": "ll3acxk",
      "body": "She can say that, doesn't mean it's true. He's acted like their dad. He could be listed, and you just be told none listed. Should be easy to get that information. \n\nIt's either confront one or them both, let your daughter date Tom, or do DNA and wait and see.",
      "created_utc": 1725246215.0,
      "score": 24
    },
    {
      "id": "lm2lk86",
      "body": "Umm ok unless you live in an area really concentrated with Asian immigrants this would be a huge red flag for me from the beginning (or I guess idk where you are, if you’re in Asia maybe not but the laws you’re referencing seem to be US based). All of Amy’s children happen to look half Asian? It’s not like blonde and brunette where it’s more ambiguous; half Asian is usually a pretty distinct look. I guess there could be some explanation about her being attracted to Asian men since she was raised by an Asian family, but wow…as an Asian woman I’d have run for the hills after #2.",
      "created_utc": 1725774189.0,
      "score": 15
    },
    {
      "id": "lm2lj1p",
      "body": "Does Amy’s kids have any Asian features? I know that’s not how genetics always works but if they are Luke’s surely one of them would have some of those characteristics.",
      "created_utc": 1725774170.0,
      "score": 7
    },
    {
      "id": "ll8y39f",
      "body": "Very good odds actually. Usually (and this is the case in Australia, I’d hope it would be the same worldwide to avoid over donation) when a person chooses the donor they are able to take an allocation of sperm, and use that same donor again. My friend has done this (and Australian couple with an American donor) and the donor was only allowed to donate to 12 families, but they could have as much sperm as he wanted to donate.",
      "created_utc": 1725331807.0,
      "score": 11
    },
    {
      "id": "lm0t55a",
      "body": "Because some people are really fucked up in the head.",
      "created_utc": 1725747274.0,
      "score": 30
    },
    {
      "id": "lm6ahe7",
      "body": "I wasn’t saying it should. It definitely shouldn’t, but you know….all sorts of social factors. Could be cut out of the parent’s will, or something similar",
      "created_utc": 1725828103.0,
      "score": 8
    },
    {
      "id": "ll7hvo1",
      "body": "So, I guess I misremembered. I was actually 14, which is the Wisconsin age. California is 12, while other states have different ages. I always thought it was a federal age, not a state age.",
      "created_utc": 1725312049.0,
      "score": 10
    },
    {
      "id": "ll9rjeb",
      "body": "Absolutely!! And there are many stories of this throughout our history!! \nHell, there’s one from California, early 20th century… son disappeared, cops found a kid. At first she said yes but quickly realized it wasn’t him. \nThe cops treated her SO badly.\nIt’s a devastating one. They even had her committed!!!! Can you even imagine?!!!",
      "created_utc": 1725347566.0,
      "score": 13
    },
    {
      "id": "llan5xl",
      "body": "It is strange that the inspectors were so adamant about the baby being dead. I would think there would be none fragments or something. But I'm an armchair forensic specialist so what do I know?",
      "created_utc": 1725366372.0,
      "score": 5
    },
    {
      "id": "ll3toyn",
      "body": "It’s a banjo.",
      "created_utc": 1725255980.0,
      "score": 12
    },
    {
      "id": "llly035",
      "body": "And her brother too.",
      "created_utc": 1725533417.0,
      "score": 10
    },
    {
      "id": "ll6qs2p",
      "body": "Thank you for saying this. My God what a horrible thing to let happen to cover his own tracks.",
      "created_utc": 1725302870.0,
      "score": 21
    },
    {
      "id": "ll39e18",
      "body": "It's so bad, dude.",
      "created_utc": 1725245792.0,
      "score": 22
    },
    {
      "id": "lm2moxu",
      "body": "Well, they don't look 100% white. As an Asian woman myself, I probably see the traits more than someone else might, but then, I'm also \"more\" Asian than Luke, his ancestry is more mixed. Cat is Asian, Jim isn't. \n\n(Which is another reason why I'm quite sure he's not the father of Amy's children, by the way. I didn't mention it before because I was trying to be vague with the details for privacy's sake, but with the fake names, I'm not really that worried.)",
      "created_utc": 1725774841.0,
      "score": 25
    },
    {
      "id": "lm2mx96",
      "body": "Tom definitely looks mixed race. So do the twins. \n\nKaylee is more white-passing but she definitely looks like she \\*could\\* be mixed.",
      "created_utc": 1725774984.0,
      "score": 28
    },
    {
      "id": "ll8yjbs",
      "body": "How is a woman who is financially dependent on others can afford going to a sperm bank to get pregnant 4 times? That doesn't make sense at all. There would be no shame in her admitting if that was the case. There are plenty of who have done that and proudly so. \n\nDoes Amy have a job? Has she ever had a job since before Tom was born?",
      "created_utc": 1725331990.0,
      "score": 16
    },
    {
      "id": "lmc08ni",
      "body": "Oh I was mainly commenting on why it would matter on OP hopefully soon to be exs context…\n\nObviously race didn’t matter if the family excepted her as his friend and are helping her financially I guarantee the family probably knows those are his kids they’re not stupid, so why would it matter if he married her to begin with I don’t think race was an issue  in this situation.",
      "created_utc": 1725914146.0,
      "score": 8
    },
    {
      "id": "ll7i95c",
      "body": "Even at 14 it’s fantastic! It probably was a little uncomfortable not knowing why mom had to step out though.",
      "created_utc": 1725312178.0,
      "score": 7
    },
    {
      "id": "lm2vwyq",
      "body": "Yea, that's super suspicious",
      "created_utc": 1725780652.0,
      "score": 9
    },
    {
      "id": "ll90i3f",
      "body": "Beats me! I was just commenting on the likelihood of her being able to access the same sperm donor 4 times.",
      "created_utc": 1725332826.0,
      "score": 5
    },
    {
      "id": "llbssg9",
      "body": "OP said Amy did work, but not enough to support four children.  I think she also implied in one of the comments that either Luke or Luke's parents set her up with housing or something.",
      "created_utc": 1725380940.0,
      "score": 5
    },
    {
      "id": "lmdfuzc",
      "body": "When I say race, it could be social class, education level, etc. Sometimes these wealthy people are something else…..",
      "created_utc": 1725932130.0,
      "score": 7
    },
    {
      "id": "ll7iwff",
      "body": "I was the quintessential shy girl back then. Looking back, I always laugh that THAT’S the question asked of ME.",
      "created_utc": 1725312403.0,
      "score": 3
    }
  ]
}