{
  "id": "1km0jqk",
  "title": "The kid I babysit just died.",
  "selftext": "I've been babysitting for a family for about half a year now, their 1 year old son and 5 year old daughter. They texted me early this morning letting me know the 5 year old passed away unexpectedly and they'd be discontinuing our regular schedule until further notice. I almost feel like I'm not close enough to them to have the right to grieve, but I've been crying all day, I'm unable to eat, and I'm just depressed.   \n  \nLast time I saw her, she sassily told me she was \"just starting to like me\" and we joked back and forth about how she didn't like me before. She was always so sassy, so fun, so imaginative. She really did have the most incredible imagination and I will carry that on with me for the rest of my life. That last day I was with her, we were hunting through her yard to find dinosaur teeth because she was convinced dinosaurs lived there. She was a dinosaur rescuer, and they were hiding away because humans had been mean to them before and they were scared, but they needed her help. She said their nests were always under the shade of the trees, so we were looking under every tree for a wounded dinosaur to help feel better. Today, after I got the news, I went and sat under a shaded tree and just cried for hours. It's unfair. She was so young, so innocent, and her family was so generous. They always ensured I was well fed and felt included as a part of the family. I just feel sick.\n\nI don't expect that family will ever have me back and that's okay. I don't know if I ever want to babysit again. My heart is hurting so badly. It's not fair.",
  "created_utc": 1747178419.0,
  "score": 8303,
  "num_comments": 219,
  "url": "https://www.reddit.com/r/offmychest/comments/1km0jqk/the_kid_i_babysit_just_died/",
  "comments": [
    {
      "id": "ms6k5ju",
      "body": "It would probably mean a lot to the family if you sent a condolence letter saying what you’d loved about their child. You have every right to grieve. And your sending a letter or going to the wake or funeral will show the family you cared about their child. You didn’t just see her as a paycheck.",
      "created_utc": 1747179607.0,
      "score": 7327
    },
    {
      "id": "ms6jbl4",
      "body": "Wow, that's very sad and shocking. \n\nYou don't need a \"right\" to grieve. She was in your life, you spent a lot of time with her and she made an impact on you. \n\nIf you feel comfortable, maybe ask the family if there will be a service for her where you can pay your respects and honour the person she was, and the family that loved her.\n\nNote: regarding your last sentence, I think it might be somewhat helpful for the family to keep you for the 1 year old (should they need it) because it would be a hell of a situation to explain to any new babysitter/nanny, realistically. you understand it because you went through it with them too",
      "created_utc": 1747179329.0,
      "score": 2633
    },
    {
      "id": "ms6j2gt",
      "body": "Gosh. That’s so terrible. I’m so sorry that happened. Being a nanny is so strange because you really do love the kids, but people don’t understand the depth of the bond.  Just know, it’s ok to grieve and be sad. The family is definitely distracted with their own grief, but I’m sure they’re very grateful for your help and love for their daughter. I wish I had something more helpful to say.",
      "created_utc": 1747179243.0,
      "score": 619
    },
    {
      "id": "ms6jyjp",
      "body": "You can grieve. Go to the services.  They’ll be grateful you did and so will you.",
      "created_utc": 1747179542.0,
      "score": 289
    },
    {
      "id": "ms6jpd3",
      "body": "Of course you’re grieving. A small innocent child is gone forever. My friend and I took turns babysitting for a family when we were teenagers, that entire family died in a house fire, 3 kids under 8. But, we had each other for support. You should find a group or therapist.",
      "created_utc": 1747179457.0,
      "score": 196
    },
    {
      "id": "ms6izy9",
      "body": "I’m so sorry. That poor family. My thoughts are with you and them.",
      "created_utc": 1747179219.0,
      "score": 150
    },
    {
      "id": "ms6k0yb",
      "body": "I’m sooo sooo sorry. ❤️\n\nAs the sharpness of her death passes, they will want to remember her. I would write down your memories of her. They will cherish it more than you know. She deserves to be remembered. You and her parents will want to remember her together. \n\nLet them have their space. When it’s quiet again and quieter than it was before, I would reach out and offer your memories of her. Tell em how you won’t forget her. Check in every year on her birthday and special occasions. You will be there for the son and tell him all about his big sister. \n\nThere is a role for you here. You will carry on her legacy and show it to her younger brother. ❤️",
      "created_utc": 1747179565.0,
      "score": 91
    },
    {
      "id": "ms6ijwu",
      "body": "If you can, try to find a mourning support group. It's not something you should go through alone. You have every right to mourn her. Please take care of yourself",
      "created_utc": 1747179069.0,
      "score": 197
    },
    {
      "id": "ms6jfk9",
      "body": "No it’s not fair. It’s a massive tragedy and you have every right to grieve. I had a friend who’s 4yo died unexpectedly over 10 years ago now and I to this day regret not reaching out more to her. Let them know you’re also grieving if you feel comfortable doing so and allow them space to respond how and when. That child’s short life will resonate throughout all of your lives, and that’s okay.",
      "created_utc": 1747179365.0,
      "score": 112
    },
    {
      "id": "ms6l9mj",
      "body": "If you have their email,  I would email them exactly this.  I know if my young child died I would want to know how loved and special she was,  and how her short  life affected others. It's such a gift to hear stories about your own child from other people who love them. \n\nI'm sorry for your loss. You are allowed to grieve.",
      "created_utc": 1747179986.0,
      "score": 48
    },
    {
      "id": "ms6iiv1",
      "body": "Sorry for your loss",
      "created_utc": 1747179058.0,
      "score": 37
    },
    {
      "id": "ms6mttr",
      "body": "The memory you described here is lovely. I’m sure her family would love to receive it in a letter. Perhaps it will help you - and them - grieve and celebrate the gift of her brief life. Love to you in your grief.",
      "created_utc": 1747180520.0,
      "score": 38
    },
    {
      "id": "ms6jrqr",
      "body": "I went through an extremely similar situation to this 11 years ago. I still think of him and wonder what he'd be like now as an adult if he'd had the chance to grow up. It is completely valid for you to grieve this, because it is tragic. Just because you weren't extremely close doesn't mean the relationship wasn't valuable, and a child dying is always horrible news. I'm sorry for your loss ❤️",
      "created_utc": 1747179479.0,
      "score": 34
    },
    {
      "id": "ms6mymt",
      "body": "I would text them and ask for the information on her visitation or funeral, and ask a parent to go with you\n\nTheir daughter touched your life, and you need to be able to grieve",
      "created_utc": 1747180566.0,
      "score": 27
    },
    {
      "id": "ms6noz0",
      "body": "Take what you just posted and put it in a note to send to her parents. I'm sure they would appreciate your sweet thoughts about their little girl. Add condolences and thank them for being kind to you.",
      "created_utc": 1747180821.0,
      "score": 28
    },
    {
      "id": "ms6nsyh",
      "body": "As an educator I've lost kids in my program an have lost kids within the school I work for, you don't need a 'right to grieve' you knew her, you loved her and you have every right to feel sad that she's gone, especially so suddenly.\nTherapy really helped me through the incidents that happened, and I'd suggest maybe seeking some if possible.",
      "created_utc": 1747180859.0,
      "score": 25
    },
    {
      "id": "ms6jkh7",
      "body": "You definitely have the right to grieve. Such a sad thing to have happen.",
      "created_utc": 1747179412.0,
      "score": 23
    },
    {
      "id": "ms6oslo",
      "body": "You have absolutely every right to grieve. It truly sounds like that little girl touched your heart. Just know- it’s okay to miss and grieve her even if your time was brief. Maybe you could paint a rock “dinosaur egg” and hide it under a tree in her honor.  Something special for you to remember her by.",
      "created_utc": 1747181205.0,
      "score": 26
    },
    {
      "id": "ms6k80c",
      "body": "First, I want to say that your grief is 100% valid. You are allowed to grieve. You loved this child and your heart is broken. \n\nSecond, please reach out to a support group or a therapist to help you navigate this. This is your first wave of emotions and it will get a little bit complicated for a while, it helps to have somebody to talk to that will just listen and offer support.\n\nI am so so sorry for your loss. She sounds like a beautiful fun child. You were so blessed to have been part of her life. I urge you to reach out to the family and let them know that she meant so much to you and that you would like to attend her services if there aren’t any.",
      "created_utc": 1747179631.0,
      "score": 16
    },
    {
      "id": "ms77m7i",
      "body": "Please, if you're up for it, send/drop off a card telling them the story you just told us. It's beautiful and says so much about that wonderful little girl. I feel like they would treasure it.\n\n\nI'm so sorry about this tragedy. Your bond with her was real and growing stronger, and to have it severed like that is painful. My heart goes out to you.",
      "created_utc": 1747187861.0,
      "score": 11
    },
    {
      "id": "ms6k3c2",
      "body": "You should do something nice for their son. Get him a nice toy to help him take his mind off of his grieving parents.\n\nHe's only one, he doesn't know what's going on, but I know he sees his parents crying and sad, probably scared looking too. He's probably scared of something he cannot yet understand.\n\nGet him something nice, make the kid smile and have fun playing. It might help his parents too",
      "created_utc": 1747179586.0,
      "score": 23
    },
    {
      "id": "ms6pm6o",
      "body": "The story you shared was so sweet I went back and reread it what an adorable little girl it's no wonder you're hurting even if you hadn't been super close a young life gone too soon is always a painful shock and it sounds like you had some good times together. Sending you love!",
      "created_utc": 1747181494.0,
      "score": 11
    },
    {
      "id": "ms7w3ir",
      "body": "When my mother died I wanted to hear every story that everybody had about her. I wanted to vicariously have more experiences with her by sharing the experiences that others had. I wanted to feel her love by sharing the love she'd left with other people. When people die that's one way they feel alive. So, I echo the sentiment of sending a letter and going to the memorial service. \n\nAnd you have every right to grieve. You knew her. You cared for her. And she's gone. That's a fucking lot to experience. I'm so sorry.",
      "created_utc": 1747197645.0,
      "score": 9
    },
    {
      "id": "ms6yix5",
      "body": "you *do* have the right to grieve  \nyou *were* close enough\n\nyou weren’t just watching a kid—you were part of her story  \nand she was part of yours  \nthose dinosaur hunts, the sass, the trust she gave you  \nthat *matters*\n\ngrief doesn’t care about job titles  \nyou showed up in her life with care, consistency, and joy  \nyou *earned* that heartbreak\n\nand no—none of this is fair  \nbut what you felt under that tree?  \nthat was real  \nthat was love that didn’t get enough time\n\nyou don’t have to decide now if you’ll ever babysit again  \njust let yourself feel what’s true: you lost someone  \nand she clearly *did* like you",
      "created_utc": 1747184684.0,
      "score": 17
    },
    {
      "id": "ms6jf94",
      "body": "It’s ok to grieve. I’m so very sorry for the family and their loss, as well as yours.",
      "created_utc": 1747179362.0,
      "score": 9
    },
    {
      "id": "ms6pnig",
      "body": "The hat is so incredibly sad. You have every right to grieve. She clearly had a radiant spirit that touched your heart. Everyone should grieve the loss of a child. They are so precious.",
      "created_utc": 1747181507.0,
      "score": 9
    },
    {
      "id": "ms86hou",
      "body": "If you feel up to it, a lovely thing that you could do is offer a little free babysitting for their son. He’s familiar with you, so it would likely be easier on him than being with someone else. They will need to make funeral arrangements and go to the funeral, which is hard to do with a toddler. Then no family members would need to miss the funeral to stay with the 1 year old.",
      "created_utc": 1747203075.0,
      "score": 9
    },
    {
      "id": "ms6qh7j",
      "body": "Oh my, I am so sorry.  I was formerly a nanny, and I can’t imagine how painful this would be.  You go right ahead and grieve.  As long as it takes.",
      "created_utc": 1747181801.0,
      "score": 8
    },
    {
      "id": "ms7yue4",
      "body": "I was a babysitter for a few kids the summer before I got married in 2005. A few years ago I looked them up. I’m Facebook friends with 2 of their moms. The 3rd I found. She had been at her boyfriend’s and been murdered years ago. Her dad had run a successful contracting business but lost it all in the crash of 2009. They’d had a dog they loved. He was now living in their truck with the dog. They’d petitioned the suburb to name the skate park she frequented after her but were denied. I was briefly living back in the city when all this happened but missed it because I was giving birth to my second son. I messaged her father and the grieving board but never heard back. But damn, I cried hard for a few days. I remembered all the times she drove me crazy, all the wicked little smiles, all the laughter driving in my car to early 2000s music. I never heard back from anyone. \n\nYou are so lucky you are still close to the family and get to send that card. Perhaps babysit the 1-year-old. Talk to the mom about how amazing her daughter was while you hold her son. You may not for a while because other people will be surrounding her, but knowing you’re there will still mean so much. As a mother myself, I promise.",
      "created_utc": 1747198975.0,
      "score": 7
    },
    {
      "id": "ms6mxur",
      "body": "I know this doesn’t help, but I really am so sorry. My heart goes out to you and the family. She was a part of your life. You’ll always have memories of the things you did together and the conversations you had together. She is forever a part of you. Life is so cruel. Children should all get to grow up. Parents should never have to grieve the loss of a child. Loved ones (you) should never have to feel this pain. You have every right to cry and feel exactly how you’re feeling. You will be in my thoughts, sweetheart.",
      "created_utc": 1747180559.0,
      "score": 7
    },
    {
      "id": "ms70b32",
      "body": "I was a nanny for a long time and I couldn’t fathom how you’re feeling. I am so so sorry. You deserve to grieve however you need to",
      "created_utc": 1747185320.0,
      "score": 7
    },
    {
      "id": "ms7yxux",
      "body": "Please tell her parents what she meant to you, and the memories of her you will carry forever.  While it might not ease their pain now, it will help them in the future, knowing their child was a joy to not just them, but many others; that her short life did leave a legacy.",
      "created_utc": 1747199021.0,
      "score": 8
    },
    {
      "id": "ms6kh2h",
      "body": "Im so sorry. This is heartbreaking. Please find grief support.",
      "created_utc": 1747179716.0,
      "score": 6
    },
    {
      "id": "ms6m5rd",
      "body": "You absolutely have the right to grieve. It sounds like you had a fun relationship with her. If you’re feeling up to it you could send a card to the parents telling them the same story you shared here.",
      "created_utc": 1747180291.0,
      "score": 7
    },
    {
      "id": "ms6n2se",
      "body": "Please know that you have every right to be grieving this loss. Let yourself feel your feelings, don’t push them away.  The death of a child is tragic and painful, no matter what.  \n\n\n\nI hope you’re able to talk to the family and express your condolences.  I’m so sorry for your pain.",
      "created_utc": 1747180607.0,
      "score": 6
    },
    {
      "id": "ms707u3",
      "body": "send them a letter or an email with those and other stories. They will be precious to them",
      "created_utc": 1747185289.0,
      "score": 5
    },
    {
      "id": "ms70kyf",
      "body": "You were an integral part of their family whether you or they know it. \n\nThey trusted you with their most precious possessions however short you may think it had been. \n\nYou have ever right to grieve. You're human. You cared. That's why you did what you did. Take little ones under your wings. \n\nWhen something like this happens, we all feel helpless. Especially when it happens to someone so young. \n\nI'm so sorry for your loss. \n\nTo go through something like this at your age has got to be hard. I hope you have a good support system and have someone to lean on as well.",
      "created_utc": 1747185418.0,
      "score": 5
    },
    {
      "id": "ms8xmta",
      "body": "You are allowed to feel as you feel. \n\nMy GF is a daycare worker with 5yo kids. One of them died in a stupid accident while in vacation with parents a month ago. \n\nShe grived for a full week. The kid was smart and was the most likable kid in her group. She had a bound with him and was feeling like you. She was not family, but she was in this kid's life and missed him deeply. \n\nShe went to the service and cried like I had not seen her in a while. Kids should not die. Life sometimes sucks. \n\nTake time to grieve and remember you were meaningful in this kid short life.",
      "created_utc": 1747219450.0,
      "score": 6
    },
    {
      "id": "ms6kfal",
      "body": "That is tragic! Was he sick?  I’m so sorry, this sounds so traumatizing for all parities involved . Sending you love",
      "created_utc": 1747179699.0,
      "score": 14
    },
    {
      "id": "ms6mpar",
      "body": "Own your relationship with her. It’s okay. She was a bright light of joy in your life. When we women care for others children, those children become ours. We protect them, feed them, soothe them, clean them, pray for them, read to them and listen to them. You helped form her keen imagination by running through her fantasies in real time. Her parents are hurting. Their hurt does not negate your own. Be kind to yourself.",
      "created_utc": 1747180476.0,
      "score": 5
    },
    {
      "id": "ms6mvlc",
      "body": "It’s completely normal and valid for you to feel this way. You spend time with a kid and get to know them. Of course them passing will effect you. \n\nSort of similar, but whenever I hear about one of my former students passing away I feel similar to you. It sucks and I’m sorry for your loss.",
      "created_utc": 1747180537.0,
      "score": 6
    },
    {
      "id": "ms6s7bo",
      "body": "That is so heartbreaking. I’m so sorry. You have such a beautiful heart. I hope you are able to find peace",
      "created_utc": 1747182420.0,
      "score": 4
    },
    {
      "id": "ms8kt5o",
      "body": "When I was 16 I used to babysit two brothers, a 10 year old and a 7 year old. I babysat them on and off for years.\n\nYears down the line I get a call from my mum, letting me know the older brother (who would’ve then been 16) had killed himself. My mum couldn’t understand how this had upset me so much, and it took years for me to understand although he wasn’t my child, I hadn’t looked after him for years and he was on the cusp of adult hood - he was a child someone had trusted in my care. I looked after those boys with the same effort I would my siblings, so of course that’s going to be a strange type of grief!\n\nI’d imagine it’s a similar feeling for you that this was just a little person you cared for, and although they’re not family, you’re trusted enough by family to care for them - the loss still hurts. Take time for yourself, write a letter to the family to express how much you adored their little girl and when the time is right I’m sure they’d love to have you back with their baby, telling him stories of his sassy big sister x",
      "created_utc": 1747211850.0,
      "score": 5
    },
    {
      "id": "ms8mj7h",
      "body": "You looked after the 5 year old so you are close enough to grieve her death.\n\nBabysitting is not just transactional. There's emotion put in it. Looking after someone's else child and to make sure they are safe ,well fed just like their parents would is not just monetary. \nYou are allowed to grieve her loss.",
      "created_utc": 1747212942.0,
      "score": 6
    },
    {
      "id": "msaaz4h",
      "body": "Oh my goodness that is heartbreaking, I’m so sorry! \n\nYou absolutely have the right to grieve. No matter how long you were with them, you had a relationship with them, and the child. You communicated with her, spent time with her. You have every single right to grieve. Take all the time you need to grieve this gut wrenching loss. My heart is going out to you and such an unfathomably difficult time.",
      "created_utc": 1747236800.0,
      "score": 5
    },
    {
      "id": "msakqvp",
      "body": "OP I think the family would love to hear your kind words about their daughter",
      "created_utc": 1747239598.0,
      "score": 5
    },
    {
      "id": "msc2qwp",
      "body": "OP, I’m really sorry. Please know, you are allowed to grieve. When you work with children, you form a bond with them too. I know this because I went through something similar. \n\nMy first year of teaching, I was a TA at a daycare. One of the kids went away on a family trip. Left all smiling on a Thursday afternoon after being picked up. Didn’t come back the following Wednesday when he was expected. Our school director called the parents, no response. And no responses from emergency contacts either. I remember on my lunch break that day, I was scrolling through my phone when I saw a headline about a family that all died in a fatal car accident. I don’t usually read stories like that, but something compelled me to. I read the article and recognized the parents’ names, then the kid’s name. It felt like a sucker punch to the gut. I showed the article to my lead teacher who then told the director. \n\nWe were there for the family’s funeral. It was incredibly heartbreaking and numbing at the same time. Surreal too. This kid wasn’t even 2. His birthday was a month away and we were planning a little party for him at school. I was tasked with planning the party as my first real big project. \n\nThe kicker was that the accident happened that Thursday when they left for their trip. If I remember correctly, it was just mere hours after the kid got picked up. I didn’t know it at the time, but that would be the last time I’d ever see the kid and his parents. They were such wonderful people too.\n\nSorry I’m rambling at this point. But all that to say, what you’re experiencing is normal. You formed that bond, you spent quality time with her, you came to love her like she was your own. When you work with kids and love them just as much, that bond will end up forming. Saying goodbye when you have that bond is so tough, even more so when they’re so little and should have their whole lives ahead of them. Give yourself the biggest break because grief ebbs and flows. And please know you’re not alone. 🫶",
      "created_utc": 1747255275.0,
      "score": 6
    },
    {
      "id": "ms6n414",
      "body": "Oh god…  I’m so sorry OP.\n\nThere’s nothing abnormal about you grieving for her… I know it can’t be compared with the pain that her family must be feeling right now, but it doesn’t take your right to also feel it; you took care of her for a few months in a row, and bonding with kids it’s something that (depending on the scenario) can be as easy as breathing.\n\nAs someone who was an AuPair during 2y, I know how strong the bond that we create with the little ones is, it can be something extremely strong, unexpected and inexplicable. I took care of my baby for one year straight, that was 2 years ago. And until today, I love that kid with all that I have. I can’t imagine how you’re feeling right now… 🥺",
      "created_utc": 1747180619.0,
      "score": 4
    },
    {
      "id": "ms6y6vg",
      "body": "To offer some words from the other perspective-my daughters babysitter died suddenly. Her family was absolutely wrecked. I stopped taking my daughter there for a few months to let everything die down. \n\nAbout 3 months after she passed-her family reached out. They’d be my daughter’s babysitter for over 3 years by that time. They consider my daughter family and wanted to know if they could continue to babysit her. Absolutely. \n\nIt’s be 1.5 years since she passed now-and my daughter has helped them heal. They’ve helped her heal from the double loss she had that year. \n\nCry, cry, mourne, grieve. A child has died. They deserve to be remembered.",
      "created_utc": 1747184567.0,
      "score": 4
    },
    {
      "id": "ms79wc8",
      "body": "You are a kind and caring person and your feelings of grief and loss are valid. If you send a card or letter to the family recounting the memories you put in your post and telling them you will miss her, they will treasure it. You can buy a small gift you think she would like and donate it to a children’s hospital or charity as a personal tribute.",
      "created_utc": 1747188684.0,
      "score": 5
    },
    {
      "id": "ms7g9f9",
      "body": "Offer to watch the one year old during the funeral if you feel up to it, or let them know you’d be there as a helping hand if they needed it during that time. The one year old is already comfortable with you and that gives the parents and close family a break from having to entertain him during this time.",
      "created_utc": 1747191029.0,
      "score": 5
    },
    {
      "id": "ms7n6xb",
      "body": "As a mother, I would want to know about this dinosaur hunt and the conversations and the grief you feel. \n\nI am sorry for your loss. Please consider putting this in a letter, send it with or without a card.",
      "created_utc": 1747193794.0,
      "score": 4
    },
    {
      "id": "ms7uti3",
      "body": "Many years ago I worked as a nanny for a family and their youngest died while I worked for them, she had a congenital condition so it wasn't entirely unexpected but at the time it happened she had been doing really well, so it was shocking to have happened at that time.\n\nI wasted so much time feeling that I didn't have the \"right\" to grieve. Many years later I was talking to the mom and she was shocked that I'd felt that way. It was so healing to have that conversation. Please don't wait so long to give yourself permission to grieve. You have a right to grieve, no matter how close or not close you were.",
      "created_utc": 1747197049.0,
      "score": 3
    },
    {
      "id": "ms80h3d",
      "body": "I'm a big fan of condolence letters. This may not exactly be relevant, but I want to explain why.\n\n  I work in family medicine, and the easiest way to explain it is we are primary care care for people \"from birth to death.\" Our clinicians have always sent cards to the family when a patient dies. We usually get a death certificate or life insurance paperwork notifying us, sometimes hospice or admission from the ED. During the early days of the pandemic, our community was hit hard. We had more death notices the first year than we'd ever seen in many of our careers. \n\n  There was one patient though, when we got that notice, the whole office felt it. Like some of the toughest and most perfesional people I've ever met, sitting in an office with the door closed holding hands and taking a moment together to feel it so we could go back to taking care of the patients in office. We arent a big office, and though it is usually the same MA/Clinician team caring for a patient, behind the scenes we had all helped with things like paperwork and calls for the patient. He had seen other clinicians in our office over the years when his Dr. wasn't available. We all knew him and all felt it when we got the news. We saw the husband and wife, and we knew she didn't have support in the area. Everyone wanted to sign the card, so we did. \n\n  We still see the wife, and she brings us flowers for the front desk every spring. She happens to be good friends with her neighbor, and when she saw the card we sent, she transferred care to our office. She sent us a thank you for taking such good care of her neighbors and now her, it is displayed in our breakroom. \n\n  Since then, we make a point to pass the cards around to all members of the patients care team, not just the pcp. It made such an impact on this one person, who had experienced such a great loss that we were feeling the ripples of grief despite not having a close/personal relationship with them.",
      "created_utc": 1747199795.0,
      "score": 5
    },
    {
      "id": "ms8abaz",
      "body": "I just wanted to say Im sorry OP, for you and the family. Ive lost much of my family and it never gets easier, Im worried what will happen to my brothers and sisters when I die, it keeps me up at night. Anyway, this isn't about me. Im sorry for you loss, she sounds like such an amazing little girl, may she rest in peace now. Memento mori, amor fati and godspeed.\n\nI usually wouldn't do this because im kind of paranoid about sharing my poetry lol and maybe a bit of a coward too but I wrote this poem about my little brother and my older brother when they passed away. I hope you see it and it brings you a little comfort.\n\n\"Butterfly\" A poem by R.M. Steele ( u/SevenWhoAreOne )\n\nYou were born in the summer\n\nBaptized in the sun\n\nStood tall in the leaves Just as autumn begun\n\nYou fell down in the winter\n\nGot back up the spring\n\nCried over lovers\n\nBefore you knew it you were free.\n\nYou danced with the devil\n\nTaught him a thing or two\n\nSang with angels\n\nAll before you could hold a tune\n\nYou are beautiful, sweetest smallest Apple of my eye\n\nI hate to see you go\n\nYet so proud to see you fly\n\nYou spread your wings\n\nAnd then you left me\n\nAnd though I promised not to cry\n\nMy eyes betrayed me as you faded\n\nMy little Butterfly.",
      "created_utc": 1747205306.0,
      "score": 5
    },
    {
      "id": "ms8mjas",
      "body": "You have every right to grieve. \n\nTake a little time to write your favourite - and everyday - memories of her. You saw a different side to her than her parents will have seen, and they have a finite amount of memories. Give them some of yours. She was a whole person, a fun, kind and helpful soul who took her time to get to know someone and decide for herself when she liked them. \n\nYou gained her trust, and that is precious forever.",
      "created_utc": 1747212943.0,
      "score": 5
    },
    {
      "id": "ms979jq",
      "body": "You have the right to grieve, too. That child was obviously special to you, even if you were only babysitting her for half a year. Share your memories with the parents. \n\nMay the child's memory be a blessing to you always.",
      "created_utc": 1747223788.0,
      "score": 5
    },
    {
      "id": "ms9whxz",
      "body": "The death of a child is a tragedy, it’s grief worthy of anyone, especially a friend and care giver.",
      "created_utc": 1747232560.0,
      "score": 4
    },
    {
      "id": "msb1yuh",
      "body": "I'd suggest writing up a book/document of memories you have of her, and sending it to the family if they're comfortable. My cousin (18M) was murdered in a shooting a few years back, and my aunt and uncle collected stories from many friends and family members to remember him by. Each family has a different grieving process, but if helps you and/or them, it may be worth it to try that.\n\nI'd also suggest reaching out to the family and seeing if they need you to babysit the 1-year-old for free while they deal with funeral arrangements/family things, if you can provide any meals for them, etc.\n\nFor a while after the death of my cousin, I felt like I didn't have the \"right\" to grieve so much, because so many people knew him better—his friends, his family members, his girlfriend. But then I wondered if that's how they felt, too. If everyone feels like they don't have the right to grieve properly, because there's always someone who was closer to the person who died. (Ex. \"Sure, I'm his friend, but I'm not his best friend,\" and \"Sure, I'm his best friend, but I'm not his brother,\" and \"Sure, I'm his brother, but <brother X> was so much closer in age...\")",
      "created_utc": 1747244488.0,
      "score": 4
    },
    {
      "id": "msbf24h",
      "body": "I would send a note in a card, telling her parents this story,  they will remember the adventurer, the imagination, the spirit, and beauty of their daughter that you perfectly captured in those few words.",
      "created_utc": 1747248236.0,
      "score": 4
    },
    {
      "id": "msbfcjh",
      "body": "There is no right way to grieve.  I have 3 young children and it would crush me to think that nobody was going to remember them.  Hearing your memories and thoughts would be a gift.  Please share them.  And I hope you are able to attend the funeral.",
      "created_utc": 1747248319.0,
      "score": 3
    },
    {
      "id": "msbgdk1",
      "body": "I think it would mean a lot to the family if you shared with them how much you love and care for their child. You deserve to grieve! It would probably bring them comfort to know that you loved their child so much!",
      "created_utc": 1747248614.0,
      "score": 4
    },
    {
      "id": "mscfjxd",
      "body": "Call her, go to the funeral, write them a letter, give your condolences. Show them you care. It will mean a lot to them.",
      "created_utc": 1747259156.0,
      "score": 4
    },
    {
      "id": "msci5fx",
      "body": "We had a primary school child die and their parents loved hearing stories from teachers, other parents and their children. \nIt would mean the world to them if you sent them your memories of her. \nDo get in touch as you need to go to her funeral to say your goodbyes.",
      "created_utc": 1747259980.0,
      "score": 3
    },
    {
      "id": "msgl9ps",
      "body": "It doesn't take long for a caretaker to bond with children. I worked at a daycare for only 2 months, and it hurt to leave the kids when a better employment opportunity came. I can't imagine how you're feeling, and I offer condolences to the family and you.",
      "created_utc": 1747321642.0,
      "score": 4
    },
    {
      "id": "ms6x5x8",
      "body": "I hope they share funeral info with you. I would also share that story with them. It always helps to have a good story to hold on to. I loved hearing stories of my relatives that passed even the ones gone too soon. I loved learning new things about them. You were a member of the family by way of taking care of their children as a village would. Don't discount your impact even if it was a few hours a week. It was piece of mind for the parents and a fun time for the kids. It mattered. I can't imagine losing a child.",
      "created_utc": 1747184206.0,
      "score": 3
    },
    {
      "id": "ms6ypjn",
      "body": "When you feel up to it, please write the parents a letter about her, like the other commenter said. \n\nMy sibling passed away 20 years ago and my mother still pulls out the letters and cards people wrote her about him and they are a huge comfort to her.",
      "created_utc": 1747184750.0,
      "score": 3
    },
    {
      "id": "ms6zqqs",
      "body": "grief is just love with no place to go. as a mommy myself it would be a comfort to know that my child impacted impacted your life strong enough for you to mourn her, \nmay you all one day find peace and comfort one day, you’re in my thoughts.",
      "created_utc": 1747185119.0,
      "score": 3
    },
    {
      "id": "ms6zzt6",
      "body": "I'm crying and I'm an internet stranger- you certainly have room to grieve. My daughter is almost 3. If something happened to her, it would mean a lot to me to hear from the peoole in her life who loved her. Grief is unpredictable and death is cruel.",
      "created_utc": 1747185208.0,
      "score": 3
    },
    {
      "id": "ms72g3f",
      "body": "That’s incredibly sad. You have a valid reason to grieve, she was in your life as you were hers. Her innocent age makes it especially heartbreaking. \n\nI don’t know how many babysitters they have, or if you’re their main one- either way, they will need help. You’re a familiar face to their son, which might be more helpful than you think. \n\nShe sounds like a fun little girl with a great imagination. I hate that everyone who knows and loves her is having to endure such a tremendous loss.",
      "created_utc": 1747186084.0,
      "score": 3
    },
    {
      "id": "ms7e29n",
      "body": "OP, of course you’re going to grieve. She was a child in your life - you spent time with her, I’m sure you cared about her. Let yourself grieve. It’s shocking and devastating when a child dies. \n\nMay I recommend that if possible you go to the funeral/service (unless it’s immediate family only). It is an important thing for you but also the family would likely appreciate it. You may also want to send a card. In the card you might mention, along with your condolences; the beautiful things you told us about her - the good memories you have and that she touched you and your life in that short time. For the parents knowing how loved their child was and that she will be remembered does mean something. One of the worst things about grief is no one wants to talk to you about the person who died anymore. It’s like they disappear. \n\nBig hugs.",
      "created_utc": 1747190196.0,
      "score": 3
    },
    {
      "id": "ms8rhbw",
      "body": "I'm so sorry for your loss because it is also your loss. You spent time with her, you played with her, you took care of her...write some of your fondest memories to her family and express how sorry you are that they have to have experience such major loss in their family. You will probably carry her in your heart for the rest of your life. Grieve, cry, scream...it is healthy to combat those strong feelings right away because I know people who delayed it and it made them go crazy for a period of time.\n\nAgain I am sorry and yes it is very much unfair that such innocence is taken away with such cruelty 💔",
      "created_utc": 1747216034.0,
      "score": 3
    },
    {
      "id": "ms95fik",
      "body": "I’m very sorry to you and the little kids family for the loss of such a young life. Just a year ago, the girl I used to baby sit took her own life. She was only 13. I hadn’t baby sat her in years, but it still broke my heart and I grieved. The services were extremely hard to attend but I wanted to pay my respects and give the family my love. Grieve and mourn how you need to. You are very much allowed the “right” to do so. If there’s services go to them if you can, or if that’s not something you think you can do you can write a letter about your time with your little friend, share a favorite memory, or the dinosaur when you just shared with us. I am sure the family would love to hear it.",
      "created_utc": 1747223029.0,
      "score": 3
    },
    {
      "id": "ms99vi9",
      "body": "Get them a wind chime and write a letter about how special she is. I’m sorry all this happened",
      "created_utc": 1747224837.0,
      "score": 3
    },
    {
      "id": "ms9ixsg",
      "body": "Five years is not long to make an imprint on people’s hearts. Knowing that you will remember her and she will live on in your memories will mean so much to them. Please speak to your parents or someone you trust and get them to help you navigate communicating with the parents. You’re right to be cautious to avoid centring yourself but backing off completely can be hurtful. I think it sounds like you might want to pay your respects. Often children’s funerals have a very high attendance because it’s so awful, people just need to process the fact that it’s happened. As long as you stay on the periphery it’s totally appropriate to attend if you want to.",
      "created_utc": 1747228172.0,
      "score": 3
    },
    {
      "id": "msa89mv",
      "body": "You absolutely have the right to grieve. I’m so sorry you’re going through this and I hope you grieve how you feel necessary.",
      "created_utc": 1747236023.0,
      "score": 3
    },
    {
      "id": "msa8rlb",
      "body": "I’m so incredibly sorry for your loss. Even though you may not feel “close enough,” the bond you shared with that little girl was real and meaningful. Grief doesn’t check for permission or relationship status-it just hits you where it hurts. Your tears and heartbreak are a testament to the love and care you gave her, and that’s something truly beautiful.\n\nThat story about hunting for dinosaur teeth under the trees? It’s heartbreaking and yet so full of life and imagination-she clearly left a mark on your heart, and you on hers. It’s okay to feel lost and unsure about babysitting again. Take all the time you need to heal.\n\nRemember, you were part of her story, even if just for a little while, and that’s something no one can take away. Sending you so much strength and kindness. ❤️",
      "created_utc": 1747236165.0,
      "score": 3
    },
    {
      "id": "msb4g05",
      "body": "Sweetheart, there’s nothing wrong with you grieving, and it is not silly and well within your rights to feel all of your feelings. It hurts and it sucks!! Ot sucks hardcore!! Even reading about a child that has passed that I have never in my life met before will break my heart. Because that shouldn’t happen to children. \n\nSometimes, my empathy meter is off the wall. You are allowed to hurt for the little life lost, and to grieve for the pain of her friends and family, and all of you that ever met or knew her in any capacity. \n\nSending love and light to you and her family. May she rest peacefully. She was/is clearly very loved. Take all the time in space you need to grieve. I hope you allow yourself that. You deserve it. Bask in the sunshine and breathe in the fresh air and listen to the birds and every time you see a butterfly, flower blooming, or a plastic dinosaur, think of that little girl.\n\nAnd, don’t be afraid to send a handwritten note to the parents expressing your sorrow for their loss. Make sure you include the dinosaur story And everything you love about their kids. It might hurt too much for them to read it now but one day it will bring them comfort.",
      "created_utc": 1747245175.0,
      "score": 3
    },
    {
      "id": "msb5iyw",
      "body": "I’m so sorry! It is your loss, too. You’re allowed to grieve for the loss of this wonderful little girl.",
      "created_utc": 1747245475.0,
      "score": 3
    },
    {
      "id": "msbrdvz",
      "body": "Well, if you’re not allowed to grieve…then I don’t know wtf I’m supposed to do with my tears after reading this",
      "created_utc": 1747251849.0,
      "score": 3
    },
    {
      "id": "msc7186",
      "body": "I'm so sorry for their loss, and yours. You have suffered a big loss too and you are entitled to grieve.",
      "created_utc": 1747256554.0,
      "score": 3
    },
    {
      "id": "mscoef0",
      "body": "Oh honey, I'm so, so sorry. \n\nYou have *every* right to grieve. It isn't something that you have to earn. You spent time with her and cared about her. Just because you were her babysitter and not a family member doesn't mean you didn't have a meaningful connection with her. \n\nWrite down your memories of her. Do it for yourself but you can also share it with her family; having things like this to hold on to can help immensely with grief. \n\nI hope you go to the service. You are clearly hurting and maybe it will help you say goodbye.",
      "created_utc": 1747262065.0,
      "score": 3
    },
    {
      "id": "mscsc4u",
      "body": "I'm so sorry for you're and their loss. If you've been babysitting for them for over a year now, you're definitely close enough to grieve. I hope things get better for you guys. ",
      "created_utc": 1747263401.0,
      "score": 3
    },
    {
      "id": "msffhqk",
      "body": "Share this whole story with them seriously write them a letter or a text message in a week or two and let them know how you felt about her and find out the funeral arrangements it will give you closure",
      "created_utc": 1747306806.0,
      "score": 3
    },
    {
      "id": "ms8y2l6",
      "body": "OP I think you should copy paste your post and send it to them. I think it would mean a lot to them. You have every right to grieve. I’m sorry for your loss.",
      "created_utc": 1747219668.0,
      "score": 5
    },
    {
      "id": "ms6khai",
      "body": "Definitely look for a support group! There are endless ones for all types of different things, and I know for sure fact that there are some for child loss that include carers and extended family of the child who passed. I've had more success with the ones on Facebook, but there are loads on Reddit, too.",
      "created_utc": 1747179718.0,
      "score": 2
    },
    {
      "id": "ms6na0n",
      "body": "I’m sorry for your loss. ",
      "created_utc": 1747180676.0,
      "score": 2
    },
    {
      "id": "ms745j0",
      "body": "You’re allowed to grieve. She was a person you cared about in your life. And if you didn’t care you wouldn’t be asking. \n\nI work LTC and when we lose people it’s hard every time. We see these people and have our own memories with them and taking that time to grieve is honouring their memories. \n\nRemember the time you spent with her. Tell that story about the dinosaur rescuing to her parents (maybe in a nice condolence card).",
      "created_utc": 1747186679.0,
      "score": 2
    },
    {
      "id": "ms79i4n",
      "body": "My condolences OP. This is an awful and unexpected tragedy. I definitely understand why you're grieving, you cared for her. I'm sending you love and hugs. It will get easier as time goes on, it may not feel like it, but I promise it will. 2 or 10 years from now you might still cry when you think of her, and that's okay. You made an impact on her and I'm sure she knows you loved her. I'm sorry sweetheart.",
      "created_utc": 1747188538.0,
      "score": 2
    },
    {
      "id": "ms7fnhi",
      "body": "As a father who lost a child (she was 25 years old, so it's different, but still) hearing about people who cared about her and remember stories about her brings me a lot of comfort.",
      "created_utc": 1747190796.0,
      "score": 2
    },
    {
      "id": "ms7lelc",
      "body": "[removed]",
      "created_utc": 1747193067.0,
      "score": 2
    },
    {
      "id": "ms7pftx",
      "body": "I'm so sorry for a beautiful life cut so tragically short. Please write what you posted above to her parents. I believe it will help them know how much their precious child had someone who cared so deeply for her when they weren't there.  \n\n\nYou don't need any \"right\" to grieve. This child was a part of your life, too, and it is obvious that she had a big impact on you. Grieving is normal. May you, and all her loved ones find strength in the days ahead, and have peace in your hearts 💕 ",
      "created_utc": 1747194739.0,
      "score": 2
    },
    {
      "id": "ms7qndl",
      "body": "Wow. I have no advice, but that’s just devastating. As a mom I can’t imagine. Thank you for loving their babies.",
      "created_utc": 1747195251.0,
      "score": 2
    },
    {
      "id": "ms7roht",
      "body": "You have the right to grieve this wonderful child.  So when my sister passed away, a few of her friends sent letters telling us a funny or sweet anecdote about her, sometimes they included a photo.   Those notes meant the absolute world to my mom.    I think you should share the dinosaur saving story with the parents.  It’s such a sweet story and highlights the little girls imagination, curiosity and kind heart.",
      "created_utc": 1747195672.0,
      "score": 2
    },
    {
      "id": "ms7ud5a",
      "body": "You were in their house. You were a trusted person. Your close enough to grieve. It would mean a lot to them to hear stories of their daughter",
      "created_utc": 1747196839.0,
      "score": 2
    },
    {
      "id": "ms98p2h",
      "body": "I’m so sorry OP. Sending hugs.",
      "created_utc": 1747224371.0,
      "score": 2
    },
    {
      "id": "ms9e01u",
      "body": "So sorry for your loss. I know you were paid to spend time with her, but it's still a bond. You should go to the funeral if you can.",
      "created_utc": 1747226413.0,
      "score": 2
    },
    {
      "id": "ms9fryt",
      "body": "You loved this little girl and she loved you. Of course you’re grieving too. I’m so sorry for your loss. Such a tiny little soul. I’ll pray for her 💔❤️‍🔥",
      "created_utc": 1747227056.0,
      "score": 2
    },
    {
      "id": "ms9g8h5",
      "body": "I used to babysit young kids. I would 100000% cry and grieve any child that was under my care for any period of time. Children are so innocent that their untimely passing is especially hard to cope with. ",
      "created_utc": 1747227220.0,
      "score": 2
    },
    {
      "id": "mscpbu3",
      "body": "I'm so very sorry. You have every right to grieve. She was in your life long enough to change your heart for the rest of your life! She was a sweet, special little girl that was here for far too short! But you can love her and honor her as long as you live. Some people are just like that, little angels, not with us nearly long enough. \n\n  \nPlease be gentle with yourself and let yourself grieve. Get some rest.",
      "created_utc": 1747262380.0,
      "score": 2
    },
    {
      "id": "msd1qz8",
      "body": "Hugs. You have plenty of right to be sad. I am now too and I never met any of you. \n\nI would definitely send it drop off a card or something, they will appreciate it I am sure. \n\nI hope things get better",
      "created_utc": 1747266647.0,
      "score": 2
    },
    {
      "id": "msdy0tp",
      "body": "100% you know the child well enough to grieve! Your grief will be different from the parents' grief, of course. But of course you are sad, someone you like died. And died way too young. As others have said, writing a letter or card about all the things you remember about their daughter would be so meaningful for the family.",
      "created_utc": 1747278077.0,
      "score": 2
    },
    {
      "id": "mspxez2",
      "body": "How devasting.. I'm so sorry you and her parents and family for your loss!! 🙏🙏\nImo I think they would appreciate a letter letting them know how much their child made an impact on your life . They may not realize the bond you made. It would really mean a lot to them, and I think they would reach out to you after a while ❤️🙏 ims sure they are just devastated rn. But you should reach out to them..",
      "created_utc": 1747442741.0,
      "score": 2
    },
    {
      "id": "mt3ofst",
      "body": "If anything, don't stop babysitting. Who knows some other kid might \"..just start to like you\" and you guys will make amazing memories.\nLife is beautiful,give it all the chances you have ",
      "created_utc": 1747652430.0,
      "score": 2
    },
    {
      "id": "mt6w93s",
      "body": "You have every right to grieve the loss of your innocent little pal who helped brighten up your day each time you saw her and who went far too soon. It shows you are a good babysitter, the type any parent would want. Many others would only have felt bad if the child had died on their watch and not cared when it happened on someone else’s. \n\nTry to write down any memories you have of things you did with her, remarkable things she said or things that showed her personality. I’m sure her parents would love to read it. ",
      "created_utc": 1747689609.0,
      "score": 2
    },
    {
      "id": "mt790db",
      "body": "I lost my 7 year old once. Hearing this kind of story about his shenanigans is extremely meaningful to me when I get to talk to someone that knew him... you don't have do it or do anything right away but if you wrote memories for them it might be really lovely.\nI don't think it would be weird to reach out at some point or even go to the funeral if it's public.\nThe family is in shock and not functioning I think. That's kind of what happens.\nI'm so sorry. It is so sad.",
      "created_utc": 1747693834.0,
      "score": 2
    },
    {
      "id": "mt7xehs",
      "body": "Thats so sad, i have a 5 year old sister, i love her so much even tho were 11 years apart, shes always so sweet and happy calling me her best sister ever, if i ever lost her so unexpectedly id lose it and even cry everyday, since my camera roll has her more than me.\n\n I’m in a family filled with brothers and i always asked for a sister as a child, i got one very unexpectedly 5 years ago, and i was still happy, shes the best thing i ever asked for. God i can never imagine how hard it is for that family. I pray for them.",
      "created_utc": 1747702523.0,
      "score": 2
    },
    {
      "id": "mtax6v3",
      "body": "Every person is different, but it would mean the world to me to hear the adventures my kid had on her last day. to know that she had fun. A seperate letter \"read on a bad day: \\[names\\] precious adventure.\"\n\nPeople are different though: my dad actually raged at me when I shared a funny story about a deceased friend of mine. Called it disrespectful and insulting (about my best friend accidentally hitting in the deceased friend, unaware of their age gap - they ended up as drinking buddies instead)\n\nThere are two grief mindsets: the ones who want everybody to cry and suffer, and those who would rather have laughter and jokes. Be very careful about that.",
      "created_utc": 1747752082.0,
      "score": 2
    },
    {
      "id": "mtbyvyh",
      "body": "even if they dont hire your services again \n\njust send this message to family , who deserves to read this about their daughter , beautiful last memories for them",
      "created_utc": 1747763029.0,
      "score": 2
    },
    {
      "id": "mtc0dkn",
      "body": "Oh absolutely grieving this child is normal. You were a big part of her life and understandingly bonded with her. It sucks when someone dies. My brother died 8 years ago age 34. Its been 8 years and im still a mess over it. I'd tell the parents the dinosaur story",
      "created_utc": 1747763453.0,
      "score": 2
    },
    {
      "id": "ms78hv1",
      "body": "I had a kitty recently for only 2-3 months and it felt odd grieving when her parents were in another country sobbing. But regardless, I miss her. I am saddened by her loss. I wish she was here. There’s no “right”. The world is just a bit emptier",
      "created_utc": 1747188175.0,
      "score": 2
    },
    {
      "id": "ms6v8s5",
      "body": "I am so sorry for your loss. You have every right to grieve and be in shock. It is shocking and heartbreaking.  You enriched her life, made her laugh, took care of her and made things fun. You added to her life. Maybe when you are up for it, you might want to send the parents a card writing some of the things you wrote her about her and how amazing she was, and how lucky you feel to have known her. \n\nYou might also want to see if there is a grief group locally even if you just go one time. Don't be ashamed to feel everything you are feeling. You spent some of your life with this beautiful human and its a horrible loss. I am incredibly sorry.",
      "created_utc": 1747183521.0,
      "score": 1
    },
    {
      "id": "ms6yr69",
      "body": "I’m so sorry for your loss. You do have a right to mourn and be upset. You might not be a blood relative but you were part of her life. Personally I would send them a condolence card and if they have a garden/yard (and you have the money to) maybe buy them a plant. We have done this for friends/relatives that have lost close ones (2 were children). One was a standard rose, the other an apple tree. The parents would celebrate whenever the rose bloomed or the apple tree had apples. (You can get apple trees that have small rootstock so don’t get too big). Also be kind to yourself, grieve however you need to. If you’re still in school, ask to see your school counsellor (if there is one). Or if you attend a church speak to someone there. If you see the parents and you get emotional, please don’t beat yourself up. I’m sure they’d have comfort that she had touched your life.",
      "created_utc": 1747184766.0,
      "score": 1
    },
    {
      "id": "ms739g4",
      "body": "I'm so, so sorry. Yes, the family is obviously grieving, but you're allowed to grieve, too. \n\nIt sounds like you have some really fun memories of her. If you're able, write some of those down to share with her family. They may not be able to read them now, but at some point, they would probably love having those stories.\n\nAs an aside, grief is a hard thing to deal with, especially when it's something completely unexpected, like a child dying. I'm not sure how old you are, but I'm hoping you have people around you that you can talk to or maybe even seek out a therapist. You'll go through a range of emotions, including anger. Be gentle with yourself right now.",
      "created_utc": 1747186371.0,
      "score": 1
    },
    {
      "id": "ms740mc",
      "body": "You have a tender heart, taking care of children requires it. Losing a child is one of the worst tragedies someone can experience, regardless of how you know the kid. Cannot control how you feel about a really painful loss. I’m sad just reading about it. Poor little dear, and my heart truly breaks for the parents. That is an awful thing to have to experience. \n\nAnother redditor mentioned writing a letter about how you feel and highlighting the things you loved about their daughter and I think that is a great idea. Give them space to grieve, but let them know they and she are in your heart.",
      "created_utc": 1747186632.0,
      "score": 1
    },
    {
      "id": "ms7jaal",
      "body": "Your feelings are valid. \n\nSend the family a gift or something to help them out if you feel up to it. Let them know you would like to go to any services if they would be ok with it. Otherwise, please just take the gift and let them know if you can help by watching their son perhaps while they need to make arrangements and handle things if they need. That is what I would do.\n\nI'm sorry all of this happened. Take your time to grieve. \n\nOnce I did a rescue on the side of the highway. A man had wrecked and he was really bad. I stayed with him for hours because rescue couldn't get to him quickly due to the storm. \n\nTwo days later, the officer that was first on the scene and helped me keep him alive long enough to get him to the hospital called me. He told me that he wanted me to know that the man had passed away and that his family wanted to thank me and send me all this stuff. I told him no need to send me anything, I just did what the Navy taught me and that I'm sorry for their loss. I said bye to the officer and hung up. \n\n**THEN I HAD A BREAKDOWN AND CRIED!**\n\nIt's ok to cry. It's ok to cry for people you don't know. It's ok to cry for people you barely know. It's ok to grieve.",
      "created_utc": 1747192224.0,
      "score": 1
    },
    {
      "id": "ms7lc8w",
      "body": "She was a big part of your life right now - you have *every* right to grieve. It would be weird if you didn’t. If they’re holding a funeral, you should go. They’ve discontinued their schedule for now, but under the grief, they know you were there for their daughter. \n\nI’m sorry for your loss",
      "created_utc": 1747193042.0,
      "score": 1
    },
    {
      "id": "ms7lf9c",
      "body": "Sending a gift card for grubhub or other delivery food service/a meal kit can be helpful in times like this as well as offering to watch the 1yo at or during the funeral if they don’t want the baby there. It’s totally okay to be sad and confused at the finality of death. Be kind to yourself and lean on your folks 🖤",
      "created_utc": 1747193074.0,
      "score": 1
    },
    {
      "id": "ms7m4xy",
      "body": "That is just heartbreaking. I'm so sorry for your loss. Please do share your kind remembrances of her with her family. I'm sure it will mean a lot to them.",
      "created_utc": 1747193361.0,
      "score": 1
    },
    {
      "id": "ms7mx3y",
      "body": "This is absolutely heartbreaking, I think maybe not now but later send what you wrote here to them. It will bring them comfort to hear about the impact their daughter had on you, it's sweet and a cherished memory. This is so terrible I really wish for healing for everyone hurt by her departure :(",
      "created_utc": 1747193681.0,
      "score": 1
    },
    {
      "id": "ms7nl04",
      "body": "I’m so sorry for your loss. Yes, it’s your loss too. You developed a special bond with this beautiful little sassy girl. I personally feel when you send the family a condolences card and you should share this story about the dinosaurs. That will make them smile and laugh.",
      "created_utc": 1747193957.0,
      "score": 1
    },
    {
      "id": "ms7ru40",
      "body": "This is a big loss for you too. I’m so sorry for your pain. Thinking of you and the family.",
      "created_utc": 1747195738.0,
      "score": 1
    },
    {
      "id": "ms7vpua",
      "body": "Your grief is yours. Hope you have a support system to lessen your burden",
      "created_utc": 1747197466.0,
      "score": 1
    },
    {
      "id": "ms88zlq",
      "body": "Aw in so sorry that is definitely a horrible experience for you as well.\n\nYou have every right to grieve you spent time with them and it’s horrible for a child to unexpectedly pass. Id be upset too. \n\nI think the family would appreciate you reaching put to them. Doesn’t have to be much even i little flower and a note. \n\nLol so funny also that she said that to you lol what a little character.",
      "created_utc": 1747204526.0,
      "score": 1
    },
    {
      "id": "ms8f67k",
      "body": "Oh love I’m so sorry for your loss.  Sounds like you made her life really fun and that’s something to treasure",
      "created_utc": 1747208272.0,
      "score": 1
    },
    {
      "id": "ms8ildz",
      "body": "The loss of a child is so hard to process. A child I occasionally worked with passed a year after I stopped working with them. I was shattered. I can only imagine how you’re feeling as you had a very close bond with them. I nannied for a family approximately 8 years ago and I still think of them as distant family even though we haven’t spoken in a few years.\n\nIt’s a lot to work through. Take the time to grieve. Seek bereavement therapy if you can to work through it. Others mentioned sending a message to the family. I think that would be nice to do too. I’m so sorry that you’re all going through this",
      "created_utc": 1747210430.0,
      "score": 1
    },
    {
      "id": "ms8nwxz",
      "body": "Il so sorry 😔😭",
      "created_utc": 1747213821.0,
      "score": 1
    },
    {
      "id": "ms8og2r",
      "body": "I'm sorry 💕",
      "created_utc": 1747214161.0,
      "score": 1
    },
    {
      "id": "ms9kdkt",
      "body": "Op I really think a visit to the parents n sharing ur stories wud b a nice gesture. Mayb take some cookies over to their home n let them know u r also grieving, that their family was a part of ur life. If that wud b too hard for u, a call or a card written w ur memory wud b nice. Sorry this tragedy happened to u n the family",
      "created_utc": 1747228673.0,
      "score": 1
    },
    {
      "id": "ms9lgqs",
      "body": "Sad😭😭😭 RIP baby",
      "created_utc": 1747229040.0,
      "score": 1
    },
    {
      "id": "msbuhsa",
      "body": "I’m so sorry for the pain you’re experiencing. I don’t usually comment on here, and I’m not too sure what to say, but I hope you know that, despite how long you knew her, it is perfectly okay for you to grieve. I hope for the best for you and the family. 🩷",
      "created_utc": 1747252750.0,
      "score": 1
    },
    {
      "id": "msc0qkn",
      "body": "It doesn’t have to be today or tomorrow, but at some point share your story about their child with them.  It would mean a lot.",
      "created_utc": 1747254618.0,
      "score": 1
    },
    {
      "id": "msd52r2",
      "body": "Omg!! I'm so sorry! I can't imagine how shaken you must feel.",
      "created_utc": 1747267781.0,
      "score": 1
    },
    {
      "id": "msdf11h",
      "body": "Grief is not an emotion that needs to be earned based on conditions. Your grief is valid and personal to you. Don’t ever doubt that. It’s a love you felt for this child manifest as pain, and that’s beautiful. I’m sure the family would be touched to know some of the fun times you shared with their daughter.",
      "created_utc": 1747271232.0,
      "score": 1
    },
    {
      "id": "msebht6",
      "body": "My condolences 💔💔",
      "created_utc": 1747283874.0,
      "score": 1
    },
    {
      "id": "msek91u",
      "body": ">>the right to grieve \n\nYou don’t have to have a right to grieve. Feelings don’t work that way. \n\nI’m sorry for your loss.",
      "created_utc": 1747288330.0,
      "score": 1
    },
    {
      "id": "msemoso",
      "body": "I'm so sorry",
      "created_utc": 1747289695.0,
      "score": 1
    },
    {
      "id": "msetdun",
      "body": "It’s very understandable that you’re grieving. You were a small piece of her life. You cared for her, even if it was paid you cared. Like you said she was annoying and so innocent and it makes sense you feel what you feel. \n\nI cried and grieved for a child I never personally met. I guess I saw what could be my kids if god forbid something happened. As a parent one never wants to even imagine something like this happening to their own children, having to bury them instead of you when they’ve lived a whole life before you. \nThe girl was a classmate of my preteen daughter. Death became just so real. It scared me and it hurt knowing children die everyday. I felt for her whole family, as a parent, mother and human being I really felt grieve. Maybe it wasn’t my place but it did affect me and I also had a talk with my daughter, I made sure how she was doing. Kids tend to take things well when you communicate with them and give them support. So I completely understand. \nI think it would be great to maybe write to them expressing your condolences 💐 maybe you can express how much their little girl meant to you and all the wonderful memories that you made with her and how they will always live in your heart ❤️ \nRest in peace to this beautiful sweet baby girl.",
      "created_utc": 1747293628.0,
      "score": 1
    },
    {
      "id": "msfhep8",
      "body": "Me sobbing at 7am. The replies are lovely. I found the soft side of reddit ❤️",
      "created_utc": 1747307700.0,
      "score": 1
    },
    {
      "id": "msfkx9k",
      "body": "This is so sad, my strength to you and the family. And don't feel like you don't have the right to grieve, everyone does🫂",
      "created_utc": 1747309269.0,
      "score": 1
    },
    {
      "id": "msugjph",
      "body": "You spent time with her, I think it’s normal to feel that way.",
      "created_utc": 1747512384.0,
      "score": 1
    },
    {
      "id": "msvp02s",
      "body": "My younger brother died and we were train wrecks. Every note from a stranger meant the world to us. Even two years later, I love to hear from a stranger that they remember him and think of him or what they liked about him, even if they only met him a couple times. I love to know that people also saw how wonderful and amazing he was. It would go a really long way for you to send them a note or show up with flowers and give them a hug.",
      "created_utc": 1747528203.0,
      "score": 1
    },
    {
      "id": "mswtpp4",
      "body": "you have a right to grieve the loss of anyone if it moves you. i've cried for people I didn't know on the other side of the world.",
      "created_utc": 1747546534.0,
      "score": 1
    },
    {
      "id": "msxa2eo",
      "body": "You should send them a heartfelt card and let them know that you will miss their sweet daughter. At her age, she probably didn't know too many people but, she touched your heart, obviously. Sometimes we experience and share God's grace through children.",
      "created_utc": 1747556475.0,
      "score": 1
    },
    {
      "id": "mt18ukg",
      "body": "You have every right to grieve I think. And it is sad but at the same time beautiful how much it affected you. The way you explained this whole thing shows how big of a heart you have, I am grateful to be living among people like you because I feel the same about hearing loss of anyone who has passed through my life path. Your words brought tears to my eyes. I wish you peace and if I were you I would let them know about how much you cared about their daughter. God bless you!",
      "created_utc": 1747610063.0,
      "score": 1
    },
    {
      "id": "mt1ybtj",
      "body": "How awfully unfair it is. I think you should write down how you feel, write your memories of the things you said and shared, even if it's messy. Your feelings and grief are valid, totally valid! So don't dismiss how you're feeling. You're allowed to grieve. Your last paragraph comes across as though you're feeling internalised guilt or shame, which is also a normal way to feel. People often think speaking about death, especially directly to people, is awkward and embarrassing and will make things worse. It won't. It can't be any worse. I think once you've written your thoughts, feelings and memories down, you could perhaps create a poem or something beautiful out of it, and post it or hand it to the parents. They would live to hear the sassy comment, it's a lovely memory you have. It sounds like you want to see them and this could help. Offering genuine and sincere help, practical things, and saying you'd like to help, if that's what they want, would be a nice gesture. People touch our lives, sometimes for only a short time, but they all add value in some way. Let yourself grieve. Xo",
      "created_utc": 1747619548.0,
      "score": 1
    },
    {
      "id": "mt23fqa",
      "body": "Made me tear up. I’m so sorry",
      "created_utc": 1747621439.0,
      "score": 1
    },
    {
      "id": "mt5gxjv",
      "body": "Awwwww im so very sorry for your terrible loss! Of course you're grieving and you have the right to grieve! No one's grief is  ever wrong.\nYou were close to her, you and she hunted to save dinosaurs. Don't discount that. I'm very sorry that the family is not reaching out more to you. They must not understand how close you were to both kids. Again I'm really sorry they're not reaching out to you because you have every right to be part of it. When your babysit for someone you're part of their family.\n\n\nMaybe you can reach out to them and tell them how you feel. Maybe they will then understand that you're part of it all. Good luck and I hope you find peace",
      "created_utc": 1747674462.0,
      "score": 1
    },
    {
      "id": "mt6rpxr",
      "body": "I’m so sorry 🫂❤️",
      "created_utc": 1747688227.0,
      "score": 1
    },
    {
      "id": "mt9ax8i",
      "body": "I am so sorry for your loss.",
      "created_utc": 1747725266.0,
      "score": 1
    },
    {
      "id": "mu3xrfr",
      "body": "I am so sorry OP. I think you should send them a letter telling them that you cared about their daughter and how she added to your life. Knowing that people care with probably make them happy.",
      "created_utc": 1748139984.0,
      "score": 1
    },
    {
      "id": "mui6e3m",
      "body": "Sorry for your loss :(",
      "created_utc": 1748348846.0,
      "score": 1
    },
    {
      "id": "ms6onay",
      "body": "😞😞😞 I’m so so sorry.",
      "created_utc": 1747181154.0,
      "score": 1
    },
    {
      "id": "msbwy37",
      "body": "Perhaps this is inappropriate to say but personally I would find it impossible to get past the whole “died unexpectedly” thing. Not knowing what happened to her would drive me insane if I were in your shoes. How does a five year old die unexpectedly? People don’t usually describe a death caused by a tragic accident or acute illness in that way, yet I can’t imagine how else a seemingly healthy child would just suddenly leave this world. I know that none of that matters in regards to your grief, but I find the vagueness with which they informed you of her untimely death to be disturbing.",
      "created_utc": 1747253475.0,
      "score": -11
    },
    {
      "id": "ms6tar8",
      "body": "[removed]",
      "created_utc": 1747182816.0,
      "score": -15
    },
    {
      "id": "ms6o7ue",
      "body": "I was just going to say this. In fact, I think OP could adapt use the text they wrote here, with the dinosaur story. I'm sure the parents would love reading it.",
      "created_utc": 1747181003.0,
      "score": 2647
    },
    {
      "id": "ms798uu",
      "body": "Totally agree with that. As I was reading what you wrote about her, I was thinking how much it would mean to them to hear this.\n\nAlso, your grief is just as real as anyone else’s and I highly recommend t talking to a grief counselor or a therapist. It’s okay to feel what ever you are feeling. For me, after my mom passed away, I thought I was strong and would get over it in time. Eventually I sought out a therapist and was able to work through what I was feeling with her, after what felt like a small number of sessions. Be gentle with yourself, OP.",
      "created_utc": 1747188445.0,
      "score": 183
    },
    {
      "id": "ms6qyl0",
      "body": "That was my thought too. They’d love to hear how much their daughter meant to others.",
      "created_utc": 1747181974.0,
      "score": 63
    },
    {
      "id": "ms95koq",
      "body": "I am a parent of a 6 year old. And trust me they will really appreciate if you told them this over phone or may be visit them on funeral. This will mean alot to them as the above post said the dinosaur story is a great memory.",
      "created_utc": 1747223089.0,
      "score": 23
    },
    {
      "id": "ms6mx7s",
      "body": "Love this idea! ❤️🙏🏻🙏🏻",
      "created_utc": 1747180553.0,
      "score": 34
    },
    {
      "id": "ms894wp",
      "body": "Yes totally have the right to grieve it’s so tragic and also if they trusted and relied on you for childcare you are part of their village send them a letter or message",
      "created_utc": 1747204612.0,
      "score": 14
    },
    {
      "id": "ms6tggr",
      "body": "This this this. I babysat a charming young man two years ago and I would be devastated if something happened to him.",
      "created_utc": 1747182874.0,
      "score": 35
    },
    {
      "id": "ms7xa6q",
      "body": "This. Losing a child is such a heavy grief to go through. I think the parents may find maybe just a tiny bit of solace in knowing that their child had such an influenced and was so cherished and will be remembered by the babysitter.",
      "created_utc": 1747198207.0,
      "score": 19
    },
    {
      "id": "ms9j298",
      "body": "When you lose someone, knowing that someone else also experienced a sense of loss and that her little life made a big difference to you would mean so much.",
      "created_utc": 1747228216.0,
      "score": 9
    },
    {
      "id": "msdkhtc",
      "body": "This is exactly right. You may have been part of this child’s life for only a small time, but to that child, you were there for most of their life, you were a lifelong friend. You have every right to grieve and I believe the parents will understand, even appreciate, your feelings in this situation. I’m sorry for your loss.",
      "created_utc": 1747273112.0,
      "score": 4
    },
    {
      "id": "msbe1im",
      "body": "I’m sure they would love to hear little stories like you just shared with us and little quirks you noticed while you’ve been babysitting. A letter is a nice thing to have for them to read when they want to, it helps paint a more colorful picture of her.",
      "created_utc": 1747247940.0,
      "score": 3
    },
    {
      "id": "ms7rbg4",
      "body": "Absolutely this!!!",
      "created_utc": 1747195522.0,
      "score": 2
    },
    {
      "id": "msi6tvw",
      "body": "And share your memories with them.",
      "created_utc": 1747338503.0,
      "score": 1
    },
    {
      "id": "mswu4d2",
      "body": "include the dinosaur story too. they will love that.",
      "created_utc": 1747546763.0,
      "score": 1
    },
    {
      "id": "mt9w0bt",
      "body": "Yeah, this would be very sweet paired with a flower delivery or something",
      "created_utc": 1747738163.0,
      "score": 1
    },
    {
      "id": "msard62",
      "body": "Offering free babysitting for a few hours a week I’m sure would be incredibly appreciated and make the family feel so loved. OP doesn’t owe that of course, but it would be a generous offer.",
      "created_utc": 1747241508.0,
      "score": 52
    },
    {
      "id": "ms6k0ow",
      "body": "Yeah people sometimes believe it to be more of a transactional relationship, and with the parents that can be true at times, but when you care for little ones, you love them like they're your own family.",
      "created_utc": 1747179562.0,
      "score": 148
    },
    {
      "id": "ms6v9te",
      "body": "i feel like in order to properly care for a child you have to love them at least a little. it's not like you can help it anyway.",
      "created_utc": 1747183531.0,
      "score": 43
    },
    {
      "id": "ms6n42j",
      "body": "My nanny was like my second mom - sometimes she even felt like my first. And I know she loved us so much. Like we were her own kids. She would have been devastated if anything ever happened to us. I miss her so much",
      "created_utc": 1747180620.0,
      "score": 73
    },
    {
      "id": "ms6pj7d",
      "body": "That’s how I feel as a pet sitter (I know there’s a difference btw kids and pets). I love all the pets I care for, and I have definitely grieved the loss when they pass or even move. I got the news of one passing on social media and it really hurt my feelings that they didn’t tell me personally. I had just been with him 3 days before, and I cried hard for two days and definitely the next time I was there to care for his sister. I just felt like they didn’t know how much he meant to me.",
      "created_utc": 1747181466.0,
      "score": 34
    },
    {
      "id": "ms762gi",
      "body": "Yes, please go. The family needs to see the faces of EVERYONE who cares about them",
      "created_utc": 1747187323.0,
      "score": 113
    },
    {
      "id": "ms7a4pp",
      "body": "Holy crao that’s terrible",
      "created_utc": 1747188769.0,
      "score": 38
    },
    {
      "id": "msbad9o",
      "body": "Don’t know why but this reminded me of Manchester By The Sea. I am going through a tough phase, so rewatched it last weekend, and it just wrecks me.",
      "created_utc": 1747246872.0,
      "score": 8
    },
    {
      "id": "ms8b0yl",
      "body": "It’s not too late! In the early days you are surrounded by people! Everyone’s giving you support, they’re constantly checking in, they share stories about all cute things he said and did, reminiscing about all the happy times you had, they lend you their ear, they bring food and make sure you’re fed, whatever you need someone offers it! Then, the weeks go by, then the months, and then the years. People stop checking in on you, they stop asking how you’re doing, there’s no more reminiscing, worst of all, they stop saying his name. \nThey don’t bring him up bc they don’t want to cause you pain! They’re afraid it will make you sad to think of them, but we’re already thinking of them! It may not always be at the forefront of our brains, but they are always there! It hurts so much more to feel like you’re the only one who remembers him! Like you’re the only one missing him here! Like everyone else forgot he ever existed! \n\nSo, call your friend! Tell her you’re calling bc you recently seen something that reminded you of their little one, or that you had remembered something funny/cute/sweet their little one did and you wanted to call to just check in and that you’re thinking of them and their little one. If you were close to their child and you feel comfortable, share that you’re missing them too. Share what your favorite memory is of them, tell them the kind of kid you think they’d be now. Do you think they’d now look more like their mom or their dad? What type of music do you think they’d have been into, or what they’d be like as a teen! But, **most importantly**, say their name! Say it over and over again! Don’t treat it like a swear word, or like it’s a hot beverage that will burn your mouth the moment it touches your lips! Trust me, bereaved parents miss hearing other people say the names of their children! We want to know that others still think of them, that they made an impact on more than just their parents!",
      "created_utc": 1747205725.0,
      "score": 30
    },
    {
      "id": "ms7dz07",
      "body": "I was thinking the same thing when I read this. Or she can write it in a card. It’d be so thoughtful. \n\nOP:- Here is an example of what you could write\n\nI am heartbroken to hear about the passing of [Her Name]. Words cannot express the depth of my sadness and the immense loss I feel. She was a remarkable and vibrant spirit, who brought so much joy and laughter to those around her.\n\nI will forever cherish the last memory I have of her, when she sassily informed me that she was \"just starting to like me.\" Our playful banter was a testament to her fun-loving personality, and that day spent searching for dinosaur teeth in her yard will always remain close to my heart. The way she believed she was a dinosaur rescuer, determined to help those scared creatures hiding from the world, showcased her incredible imagination and kindness. She had a unique ability to see wonder and magic in everything around her. \n\nAs I sit here reflecting on those moments, it feels incredibly unfair that someone so young and innocent has been taken from us. My heart aches for the family who welcomed me with open arms, ensuring I always felt included and cared for. I am grateful for the love and generosity you all shared.\n\nToday, I found myself sitting under a shaded tree, just as she would have wanted, and allowed my tears to flow. The loss is profound, and I want you to know that I carry her spirit with me. She will continue to inspire me and remind me of the beauty of imagination and kindness.\n\nPlease accept my deepest condolences. I am here for you during this difficult time, and I will keep [Her Name] and your family in my thoughts and prayers.\n\nWith heartfelt sympathy,…. “",
      "created_utc": 1747190163.0,
      "score": 11
    },
    {
      "id": "ms7hwhr",
      "body": "Perhaps even hide it in the shade of a tree in a public park, for another intrepid dinosaur rescuer to find? A way of passing on the beautiful spark of her wonderful imagination.",
      "created_utc": 1747191673.0,
      "score": 11
    },
    {
      "id": "msajux4",
      "body": "I wanted to say the same. When my dad passed I loved getting to hear stories about the life he had outside of being my father. It helps us feel closer to them, and reminds us how much joy and love they got to experience.\n\nPlease absolutely share with them in a letter or email.",
      "created_utc": 1747239339.0,
      "score": 2
    },
    {
      "id": "ms6yhlr",
      "body": "She contracted E.Coli a little over a week ago. It gave her complications which resulted in a series of strokes. It was very sudden.",
      "created_utc": 1747184672.0,
      "score": 48
    },
    {
      "id": "ms84289",
      "body": "I turn 25 in a month. Is there something your daughter always wanted to do? I can try and do it for her in the coming year. My grandma lost one of her sons when he was a kid and she told me she takes comfort in seeing her other kids and grandkids doing the things he wanted, like he gets to live again alongside us",
      "created_utc": 1747201716.0,
      "score": 3
    },
    {
      "id": "msgttjl",
      "body": "Well said. ❤️",
      "created_utc": 1747324142.0,
      "score": 1
    },
    {
      "id": "ms83kou",
      "body": "Yes. Share the Dino saving story with her parents.",
      "created_utc": 1747201449.0,
      "score": 1
    },
    {
      "id": "ms7fouk",
      "body": "While I'm not the one who downvoted I can understand why. I don't mean to minimalize the loss but we're talking a human life, please be a bit more sensitive and aware. Just my two cents, respectfully.",
      "created_utc": 1747190811.0,
      "score": -2
    },
    {
      "id": "msdnpc5",
      "body": "I didn't want to include how she died in the original post to respect their privacy, that's just how I described in for the purpose of reddit. She passed away from a complication the caused a series of massive strokes after contracting E.Coli. Nothing strange or disturbing happened at all. It was literally an unexpected death. She got sick a week and a half ago. Kids die like this all the time. It's no conspiracy, this family would NEVER do something like that to their child. That was inappropriate and incredibly rude of you to actually say to someone grieving and about a family who just lost a child. Shame on you.",
      "created_utc": 1747274226.0,
      "score": 17
    },
    {
      "id": "msdz3sp",
      "body": "You're reading far to much into this. This is not a news article. The tragic circumstances are immaterial to OP's grief, which is what this post is about. \n\n\nSorry you had to read this, OP, it's the last thing you need.",
      "created_utc": 1747278512.0,
      "score": 3
    },
    {
      "id": "msfizyk",
      "body": "Why would you put that out into the world? What made you so disgusting you thought this was appropriate? Turn off the true.crime, and take empathy classes. You'd be doing yourself and the world a huge favor.",
      "created_utc": 1747308422.0,
      "score": 2
    },
    {
      "id": "ms6qdtn",
      "body": "This is such a lovely idea!",
      "created_utc": 1747181767.0,
      "score": 484
    },
    {
      "id": "ms7buw8",
      "body": "Exactly what I was thinking while reading this. \n\nSo sorry for your loss, OP. What a beautiful ode to her youve graced us with here. I think it’s entirely appropriate to send your condolences and maybe even flowers or whatever you would feel comfortable with. Good luck, i hope you allow yourself the space to grieve.",
      "created_utc": 1747189393.0,
      "score": 344
    },
    {
      "id": "msa6gjv",
      "body": "As the mom who grieves the loss of her son, I would LOVE to hear this story.",
      "created_utc": 1747235499.0,
      "score": 59
    },
    {
      "id": "ms7egii",
      "body": "Agreed. It would mean so much to the parents to know that the person their daughter spent so much time with also cared deeply about her, and was also grieved by her death.",
      "created_utc": 1747190343.0,
      "score": 96
    },
    {
      "id": "ms8qspx",
      "body": "I was going to say, I think, even if it hurts now, they will treasure this memory",
      "created_utc": 1747215628.0,
      "score": 39
    },
    {
      "id": "ms7fz9v",
      "body": "I was thinking the same thing, how much I would love to hear that story if I were her parent.",
      "created_utc": 1747190921.0,
      "score": 101
    },
    {
      "id": "mse9o60",
      "body": "This, op",
      "created_utc": 1747283027.0,
      "score": 3
    },
    {
      "id": "mt7xgwi",
      "body": "Would make them cry alot too 😭",
      "created_utc": 1747702549.0,
      "score": 2
    },
    {
      "id": "msga20x",
      "body": "It would be best if OP wrote this memory down to give to the parents. So they can keep it. They may not be able to fully appreciate how incredible the story is while they are in the shock of losing their daughter. Being able to read it later will mean so much.",
      "created_utc": 1747318292.0,
      "score": 3
    },
    {
      "id": "mscqvxh",
      "body": "It absolutely would be a generous offer. If you can swing it OP, I’m sure it would mean a lot to parents who have just had their entire world turned upside down to know that their 1yr old is in good, familiar hands while they’re grieving, planning a funeral, etc.\n\nAlso, it’s normal that you’re grieving. When I was in high school (6+ years ago)I babysat for a pair of twin boys, they were the best. Now they’re in middle school, I still see them sometimes when I’m in the area. I can’t imagine how I’d feel if something happened to one of them. Take time to process and grieve. I’m sure the parents would be touched to know that you’re grieving their daughter as well. I imagine it would be a welcome reminder that their daughter was a real person with people who loved her even outside their family.",
      "created_utc": 1747262912.0,
      "score": 18
    },
    {
      "id": "ms7eiuf",
      "body": "Wow that is so awful. I wasn’t sure if they died from an ongoing issue or it was sudden. Regardless , tragic for everyone. I’m so sorry.    I would send flowers and a nice card to acknowledge how wonderful their child was or maybe even send this down the road.",
      "created_utc": 1747190367.0,
      "score": 7
    },
    {
      "id": "msbmu5j",
      "body": "I’m so sorry this happened - and it’s only normal you’re grieving. Take the time to grieve, everyone processes death differently.\nWhy do you think they won’t have you back?",
      "created_utc": 1747250501.0,
      "score": 3
    },
    {
      "id": "msfj56u",
      "body": "I'm sorry for your loss. And you did suffer a tremendous loss here. I hope you and her family can find a way to heal from this heartbreak",
      "created_utc": 1747308487.0,
      "score": 2
    },
    {
      "id": "msc1tj1",
      "body": "I would love to hear what she wrote about my child.  It would help me recognize how loved she was in so many little ways to her babysitter.",
      "created_utc": 1747254971.0,
      "score": 51
    },
    {
      "id": "msoq4jm",
      "body": "OP, you absolutely deserve to grieve. People touch our lives. So sorry for your loss. I know the family would welcome the letter as some suggested. Many families would want you to come to the service, and like people suggested they may appreciate help, or flowers, or even some home cooked food in a time of crisis. Knowing you made their daughter's final days have joyous moments in them will mean so much. You sound like an amazing babysitter. ",
      "created_utc": 1747427163.0,
      "score": 3
    },
    {
      "id": "msdk8sp",
      "body": "I’m so sorry!",
      "created_utc": 1747273026.0,
      "score": 13
    },
    {
      "id": "mswu7zj",
      "body": "❤️",
      "created_utc": 1747546820.0,
      "score": 2
    },
    {
      "id": "mt5ha00",
      "body": "I'm so very sorry for the loss of your son",
      "created_utc": 1747674563.0,
      "score": 2
    },
    {
      "id": "msgmh3r",
      "body": "Thank you. Me too. It sucks. I miss him so goddamn much",
      "created_utc": 1747321999.0,
      "score": 6
    },
    {
      "id": "mt7bfm3",
      "body": "Thank you 🙏🏼",
      "created_utc": 1747694685.0,
      "score": 1
    }
  ]
}