{
  "id": "1fc76f1",
  "title": "My husband just put all of my makeup in resin and I’m seriously contemplating divorce",
  "selftext": "I honestly don’t know where to start. I (F27) work full time as a nurse. I’m fairly new, so I’m getting paid just enough to pay for groceries, rent, utilities ect. My husband also works but it’s part time at his dad’s pool cleaning business and it’s more of a job that he just does so he isn’t bored around the house. I’m the bread winner and I’m completely fine with that. (This matters I promise lol). I was telling my husband the other day that I wanted to buy a spinning thing from home goods or something to put my makeup in instead of the makeup bag I’ve had since I was like 14. so the next day while I was at work he took it upon himself to get all my makeup and put it in a circle dish and pour resin on it. When I got home I asked him why he was covering it with a towel not knowing what it was and he said it was a “handmade version of something I’ve been wanting” I was super excited as I love homemade gifts more then anything store bought. Today he showed me it and I was pissed. At first I thought maybe he saved up and bought all the products I had but he quickly told me “no, I just put all ur makeup in this” I told him not only do I not have any makeup left, which is something I enjoy doing in the morning or at night before I leave for my shift, but that we can’t really afford for me to go buy new stuff right now. He said “oh I didn’t think about that, sorry. Anyway…” and went off rambling about something else. He literally did not give a flying fuck. he doesn’t understand why I’m so mad even tho I’m explained like 10 times that the 1 thing I look forward to doing before work is ruined until I save up to go buy the makeup again. I said the only way he could make it up to me is to save from his job so I can go buy the makeup and he said that’s dumb and I can live without it. but that isn’t the point. I feel bad I’m so upset about something so materialistic when he just wanted to make me a homemade gift. what do I do, I’m seriously contemplating divorce. It’s more than the makeup, it’s the audacity to do this and react this way when he’s not the one who has to go buy all the stuff again. \n\nedit: I see a lot of people wondering why he put it in resin. he basically made me one of the spinny things I wanted but with my makeup in it so it’s more “aesthetic” in his words. It’s so sweet but I’m so upset I don’t know what to feel. ",
  "created_utc": 1725826645.0,
  "score": 5404,
  "num_comments": 1712,
  "url": "https://www.reddit.com/r/offmychest/comments/1fc76f1/my_husband_just_put_all_of_my_makeup_in_resin_and/",
  "comments": [
    {
      "id": "lm7un7i",
      "body": "Don’t tell him you are looking for a changing table when you’ll have a baby.",
      "created_utc": 1725848562.0,
      "score": 811
    },
    {
      "id": "lm6badn",
      "body": "Can you explain to the room how burying all your makeup in resin is a *checks notes* \"gift?\" \n\nIs he an idiot? I'm trying to understand how you arrived at marriage with this man lol",
      "created_utc": 1725828357.0,
      "score": 9328
    },
    {
      "id": "lm6bobl",
      "body": "Genuine question: is he stupid?",
      "created_utc": 1725828479.0,
      "score": 1790
    },
    {
      "id": "lm69ma2",
      "body": "I’m confused. He took your makeup and put it in a container then poured resin in the container?\n\nTo do what? What is the purpose? Fine art? A joke? Like I just can’t understand what type of homemade gift he was trying to make. \n\nAlso, he needs to work full time he’s got way too much time on his hands if he’s taking your makeup and making art projects 🤦‍♀️\n\nLook you should divorce because he doesn’t match your time and effort that you put into the relationship not over him just being dumb. This can’t be the first thing he’s done that makes no sense.",
      "created_utc": 1725827835.0,
      "score": 3879
    },
    {
      "id": "lm6ilw1",
      "body": "Is he so intellectually challenged that he doesn't understand that encasing your makeup in resin leaves your makeup inaccessible, or is he passive aggressive and does things to hurt you, but plays stupid afterward to avoid accountability?",
      "created_utc": 1725830717.0,
      "score": 610
    },
    {
      "id": "lm6bn1o",
      "body": "Is he not very intelligent?\n\nLike you are a nurse and he’s a “not bright” pool boy?   Is he really the guy for you?\n\n\nI’m not sure you’re compatible.",
      "created_utc": 1725828468.0,
      "score": 445
    },
    {
      "id": "lm68b3t",
      "body": "[deleted]",
      "created_utc": 1725827429.0,
      "score": 2192
    },
    {
      "id": "lm6b7l6",
      "body": "I can’t begin to fathom the complete lack of any sense what so ever to do what he did. \n\nUnless you want to continue to raise this man you are married to IMO it’s time to say goodbye.",
      "created_utc": 1725828332.0,
      "score": 609
    },
    {
      "id": "lm7v8fu",
      "body": "Somehow this reminds me of when my ex dumped all my Victoria’s Secret body sprays out because “who and I smelling good for?!?!?”",
      "created_utc": 1725848802.0,
      "score": 88
    },
    {
      "id": "lm6b2ll",
      "body": "I just saw a video like this on tiktok and I was thinking nooo this is expensive ass makeup😭",
      "created_utc": 1725828288.0,
      "score": 308
    },
    {
      "id": "lm6fgde",
      "body": "Info - is he mentally disabled? Because I can’t imagine anyone who isn’t, doing this. It’s just too dumbastic.",
      "created_utc": 1725829685.0,
      "score": 390
    },
    {
      "id": "lm6azgi",
      "body": "I am confused, did he destroy the makeup? On purpose then? I would go feral if someone did that to me, jesus christ one small eyeshadow costs like 30 or 40 dollars!!!",
      "created_utc": 1725828259.0,
      "score": 228
    },
    {
      "id": "lm6ib0y",
      "body": "Is your husband always this stupid?",
      "created_utc": 1725830614.0,
      "score": 54
    },
    {
      "id": "lm6da7p",
      "body": "did he post it to tiktok too 💀💀",
      "created_utc": 1725828994.0,
      "score": 101
    },
    {
      "id": "lm676vr",
      "body": "This is low-key abuse or your husband is a man with a 5 year old mentality",
      "created_utc": 1725827080.0,
      "score": 638
    },
    {
      "id": "lm6b59v",
      "body": "......what the fuck did I just read???\n\nYour husband is an abusive leech. Seriously. There is NO WAY he genuinely thought that would be a gift, or a homemade version of makeup storage, or LITERALLY ANYTHING OTHER THAN PURPOSEFULLY RUINING SOMETHING THAT MAKES YOU HAPPY.",
      "created_utc": 1725828312.0,
      "score": 238
    },
    {
      "id": "lm6aoh5",
      "body": "Yes, he needs to work full-time anyway.  And you can grab his drill and hammer and make a resin sculpture. \nIs this the first mentally bizarre thing he’s done?",
      "created_utc": 1725828164.0,
      "score": 260
    },
    {
      "id": "lm6gupg",
      "body": "You should divorce solely on the fact that he works part time so he isn’t bored at home. You are a married couple and could be stacking money into savings or investments with a dual income. What happens if you suddenly cannot work one day? The fact that there isn’t enough money to replace your makeup tells you a lot about your relationship when it’s comes to finances. Unless you’re earning at least 3x your living expenses, he needs a full time job.",
      "created_utc": 1725830136.0,
      "score": 35
    },
    {
      "id": "lm7r2sg",
      "body": "Am I the only one that needs a picture for reference? \n\nAre you saying he placed items standing upright and made a resin base by pouring resin over them? \n\nDoes he even understand what you wanted?\n\nDoes he understand make up? \n\nI think the pool guy position is because he’s a dullard. \n\nI’m sorry dear, please don’t procreate with this specimen.",
      "created_utc": 1725847135.0,
      "score": 38
    },
    {
      "id": "lm6juey",
      "body": "do you have a picture because i’m honestly struggling picturing what he did",
      "created_utc": 1725831121.0,
      "score": 36
    },
    {
      "id": "lm6ev0b",
      "body": "He 100% knew what he did.\n\nThis was a deliberate choice.\n\nHe see your habits and knows that your routine and make up are important to you so he destroyed them….\n\nAnd showed no remorse and won’t help get you new makeup.\n\nYour husband hates you and is a leech.\n\nDivorce him as soon as possible.",
      "created_utc": 1725829498.0,
      "score": 28
    },
    {
      "id": "lm6bcf5",
      "body": "Contemplating?? JUST contemplating? Your husband, I suppose, is a grown adult without any mental/developmental issues that would hinder his brain, is he not? Because if he's not then how is he married and able to stay home alone unsupervised? What you described is not a \"normal\" adult behavior, so unless he has severe intellectual disabilities that prevent him from the reasoning of \"if I do this, that will happen\". If he's old enough and allegedly capable enough to handle resin unsupervised, he's old enough and intelligent (allegedly /enough to understand what he did and what would happen. He did this on purpose. Without an extra mouth to feed and an extra body to support, your income would be less strained. Cut your losses. He doesn't respect you and this was fully on purpose.",
      "created_utc": 1725828375.0,
      "score": 43
    },
    {
      "id": "lm6fefr",
      "body": "[deleted]",
      "created_utc": 1725829669.0,
      "score": 20
    },
    {
      "id": "lm6giei",
      "body": "But wait… why in the heck did he put your makeup in resin??? Like epoxy resin???? That is crazy. Does he realize how much it costs to replace an entire vat of product and to have it happen all at once omg the anxiety from that alone would make me divorce him.",
      "created_utc": 1725830025.0,
      "score": 22
    },
    {
      "id": "lm6ida5",
      "body": "Us men don’t understand how expensive it all is and the time it takes to collect it all. \n\nI hate to say it but if he’s got a PS5, it’s time to brush up on your resin making skills. Only way he’s going to learn.",
      "created_utc": 1725830636.0,
      "score": 20
    },
    {
      "id": "lm6c0q0",
      "body": "You are married to a child. Divorce him before you get further along in life. After the divorce. Look for an adult with common values and goals",
      "created_utc": 1725828588.0,
      "score": 58
    },
    {
      "id": "lm6bl70",
      "body": "This is a red flag",
      "created_utc": 1725828452.0,
      "score": 37
    },
    {
      "id": "lm6i84k",
      "body": "I wish you would’ve taken a picture so I could see if he was trying to do something nice and screwed it up. Or if he just a jerk",
      "created_utc": 1725830587.0,
      "score": 18
    },
    {
      "id": "lm6enjk",
      "body": "If you need to save up to buy makeup he needs to be working a whole lot more",
      "created_utc": 1725829431.0,
      "score": 17
    },
    {
      "id": "lm7ar27",
      "body": "OP let us know. Is he an idiot or controlling?",
      "created_utc": 1725840740.0,
      "score": 17
    },
    {
      "id": "lm6dw47",
      "body": "Honey, he probably did that on purpose. Only an idiot would think that’s a good idea. Sounds abusive to me. Or he’s really just that dumb.",
      "created_utc": 1725829189.0,
      "score": 14
    },
    {
      "id": "lm6gnr9",
      "body": "I think there is a lot more going on then the makeup. He barely works, doesn’t respect your items nor does he seem to care about your feelings.",
      "created_utc": 1725830073.0,
      "score": 14
    },
    {
      "id": "lm6camy",
      "body": "Be careful, since you are the bread winner you might have to pay him spousal support!!!  Have him get a full time job if you can. Maybe you can separate first so he has to get a job? Sheesh, i don’t know. I’m so pissed for you! I agree that you should pawn something of his to replace your makeup. But I wouldn’t even mention you pawned anything. Something g he doesn’t use really often and when he finally notices play dumb? If you tell him he might retaliate and pawn something of yours. So either don’t tell him or don’t do it! Best of luck!",
      "created_utc": 1725828677.0,
      "score": 27
    },
    {
      "id": "lm6ezv6",
      "body": "You need to watch Kevin Can F*** Himself",
      "created_utc": 1725829541.0,
      "score": 12
    },
    {
      "id": "lm6bdrh",
      "body": "Why are you with this man-child? It is obvious that he doesn't respect you. Send him back to his father and divorce him.",
      "created_utc": 1725828387.0,
      "score": 25
    },
    {
      "id": "lm6dnsf",
      "body": "Divorce him ASAP. What he did was absolutely intentional, and I think you know it. For some reason he doesn’t like you wearing makeup, so he decided to take matters into his own hands and make it so that you can’t anymore. What’s worse, he did this at a time when he knew that you couldn’t afford to replace the makeup he ruined. He got exactly what he wanted in the end, and he doesn’t feel sorry about it in the least.\n\nI’m so sorry OP, your husband’s behavior is truly reprehensible. This seriously reminds me of the Reddit post about the girl whose husband drowned her terrarium while she was gone on a trip.",
      "created_utc": 1725829116.0,
      "score": 12
    },
    {
      "id": "lm7162p",
      "body": "I read this to my husband and he said “what a spiteful thing to do.” Is your husband mad at you for something lately, OP? Hard to believe someone has resin available for use on a whim but doesn’t understand he’s essentially ruined your products. And, like, idk how much resin costs, but the spinny things at TJs and Marshall’s are pretty affordable lol, likely less than resin 🥲",
      "created_utc": 1725837140.0,
      "score": 10
    },
    {
      "id": "lm6e0xc",
      "body": "I’m sorry what?",
      "created_utc": 1725829231.0,
      "score": 11
    },
    {
      "id": "lm727n7",
      "body": "Why did I just watch a TikTok yesterday of a guy dumping out a bag full of nice makeup onto a table and poured resin on top?! Is this your husband?? Surely guys aren’t out there just doing this!",
      "created_utc": 1725837521.0,
      "score": 10
    },
    {
      "id": "lm6ed3n",
      "body": "Resin mix is…. Expensive. How did he get his hands on enough resin mix to be able to cover a bunch of makeup containers? I can’t even afford resin for a craft hobby choice.",
      "created_utc": 1725829339.0,
      "score": 8
    },
    {
      "id": "lm6egaa",
      "body": "What if you put his resin tools in resin 👀",
      "created_utc": 1725829367.0,
      "score": 9
    },
    {
      "id": "lm6forh",
      "body": "Make HIM pay for your new set of make up",
      "created_utc": 1725829760.0,
      "score": 10
    },
    {
      "id": "lm6j32j",
      "body": "You are the breadwinner and are putting up with this behavior for why?",
      "created_utc": 1725830875.0,
      "score": 9
    },
    {
      "id": "lm7cjhq",
      "body": "Put his wallet and keys in resin.",
      "created_utc": 1725841428.0,
      "score": 10
    },
    {
      "id": "lm6b37k",
      "body": "[removed]",
      "created_utc": 1725828293.0,
      "score": 16
    },
    {
      "id": "lm6fs2s",
      "body": "Is he fucking stupid? No seriously I’m honestly asking. You wanted a makeup bag so he goes on I know I’ll put it all in resin and ruin it all. Oh why is she mad at me?? \n\nWtaf this has to be trolling this can’t be real. And he’s not gonna buy you any new makeup? And makeup is already so expensive and it’s sometimes hard to find the exact stuff again.\n\nI’d be extremely pissed off",
      "created_utc": 1725829790.0,
      "score": 7
    },
    {
      "id": "lm8vzwp",
      "body": "Hey OP, by any chance did your husband made a TikTok video about it? I saw one the other day of a husband pouring his wife’s makeup on a circle dish as well and poured resin all over it. The makeup looked fairly new and all expensive too. As a female, I really hoped he bought all new makeup himself and didn’t actually use makeup still in use.",
      "created_utc": 1725869200.0,
      "score": 9
    },
    {
      "id": "lmasddn",
      "body": "I am bored and decided to look at your history and by the looks of it people have warned you about his red flags before this. Not sure if you deleted them or what but according to a fee comments they refer to him as almost 17 years older (which I only think is relevant if this 44 year old man needs his dad to give him a job), insecure, controlling, and a very jealous man. So either its rage bait or you must be ignoring signs and then deleting posts in which case you know you should probably divorce this man ☹️ if you need support getting away from him  there should be resources available.",
      "created_utc": 1725900096.0,
      "score": 7
    },
    {
      "id": "lm6e408",
      "body": "I cannot even wrap my brain over what exactly he did. \n\nBut I guess it doesn’t matter- he needs to replace what he broke, period. And if he does not care, that is very telling",
      "created_utc": 1725829259.0,
      "score": 4
    },
    {
      "id": "lm6e9dz",
      "body": "Every part of this was horrible to read. Don’t you think you’d be so much happier alone, not babysitting a man child? Like you’d have so much extra money, space, and you wouldn’t need to worry about your things being ruined while you’re gone. \n\nGet a lawyer and divorce. Bill him for ruining your stuff and supporting him (unpaid rent) while he fucked around and didn’t work.",
      "created_utc": 1725829307.0,
      "score": 6
    },
    {
      "id": "lm6fd21",
      "body": "Tell him to pull his weight and get a full time job so you can buy new make up and more than the bare essentials.\n\nIf you’re literally living paycheck to paycheck why is he arsing around being a pool cleaner part time?\n\nI don’t even understand what exactly he did but it sounds incredibly juvenile for a 27 year old.",
      "created_utc": 1725829656.0,
      "score": 6
    },
    {
      "id": "lm6fnwm",
      "body": "This is weird AF. I just saw a guy on tiktok pouring makeup in a resin table top mold from a makeup bag. Thought it was kinda stupid and scrolled on past. Now this…. Yeah, weird.",
      "created_utc": 1725829753.0,
      "score": 6
    },
    {
      "id": "lm6h0rx",
      "body": "What in the actual fuck is wrong with him? Has he been sniffing too many pool chemicals? Or is he willfully playing dumb? Or is he passive aggressively telling you to stop using make up? Can he explain how you wanting an organizer to put your makeup IN turned into him encasing your makeup IN resin?\n\nTrust broken. How can you move forward with someone either that dumb or that much of an AH?! \n\nAnd geez if you’re struggling to pay bills, he needs to step up and work more hours.",
      "created_utc": 1725830191.0,
      "score": 6
    },
    {
      "id": "lm6hgic",
      "body": "This is weaponized incompetency.",
      "created_utc": 1725830334.0,
      "score": 5
    },
    {
      "id": "lm6keke",
      "body": "Did he make a tiktok of this? I saw a video of makeup (including Dior brand) being turned into a vanity table this morning and was hoping they were empty..",
      "created_utc": 1725831305.0,
      "score": 5
    },
    {
      "id": "lm6mx8g",
      "body": "I have a habit of stating that “if my interests aren’t going to be taken seriously, I find it hard to be present for yours”. Then I excuse myself to my time to process and recoup as needed. You don’t owe him conversation, consideration outside of dynamic obligations, or more effort than he gives to understand you and how his actions affect you. \n\nYou aren’t overacting. You are not too emotional. You are holding space for yourself first, and if you have any overflow after filling your cup, then you’ll do with us as you wish. \n\nI have lost all grace for someone else discounting my feelings, needs, and space.",
      "created_utc": 1725832138.0,
      "score": 7
    },
    {
      "id": "lm70435",
      "body": "Put his PlayStation in resin",
      "created_utc": 1725836760.0,
      "score": 6
    },
    {
      "id": "lm8vgpa",
      "body": "I LITERALLY SAW A TIKTOK OF THIS YESTERDAY",
      "created_utc": 1725868811.0,
      "score": 6
    },
    {
      "id": "lm6ds1s",
      "body": "I saw a tik tok of someone doing this 😭 \n\nI would leave this man. He either went out of his way to hurt you or he really is that idiotic and you’ll have to mommy him forever",
      "created_utc": 1725829153.0,
      "score": 11
    },
    {
      "id": "lm6f9uc",
      "body": "You need to watch Kevin Can F*** Himself",
      "created_utc": 1725829628.0,
      "score": 5
    },
    {
      "id": "lm6fmyv",
      "body": "Your husband is unhappy in life and wants to take you down with him. He wants you to be as unsatisfied and unhappy as he is.",
      "created_utc": 1725829745.0,
      "score": 6
    },
    {
      "id": "lm6g2xr",
      "body": "Divorce him. \nThe disrespect… my god, I think I’d go nuclear. \nI get it 💯 \nHe’s an abusive leech. \nZero reason for him to not get another job. \nI’d sell a few things of his that he values to get back the money back, to at least buy a few things like mascara blush and gloss or something, \nThere is no way that he had no idea he was pulling a major jerk move.",
      "created_utc": 1725829888.0,
      "score": 5
    },
    {
      "id": "lm6gh3d",
      "body": "[removed]",
      "created_utc": 1725830013.0,
      "score": 5
    },
    {
      "id": "lm6r82b",
      "body": "I don’t say this to be judgmental or to stereotype anyone but there are a LOT of men that genuinely do not know what empathy is. There’s a running joke that men have to do shrooms to experience what women figured out at 14 staring at our ceilings in our bedrooms lol. He probably legit doesn’t feel bad. I’d do what another person said and sell something of his to help him understand how you feel. And when he gets mad you can tell him you needed the money for something important and then continue talking about your day at work. After that, if you want, you can gentle parent your way into helping him understand empathy",
      "created_utc": 1725833613.0,
      "score": 4
    },
    {
      "id": "lm6rz7o",
      "body": "I’m sorry but did you marry a mentally disabled man?",
      "created_utc": 1725833875.0,
      "score": 5
    },
    {
      "id": "lm6zal0",
      "body": "Ok so what’s his favourite thing to do? While he’s busy or sleeping, do the same to his stuff. And then divorce him. He sounds like he should still be living with his mother. SMH",
      "created_utc": 1725836469.0,
      "score": 5
    },
    {
      "id": "lm71qvq",
      "body": "Has your husband had a brain injury? Is he huffing pool chemicals?",
      "created_utc": 1725837351.0,
      "score": 5
    },
    {
      "id": "lm72e2y",
      "body": "take his games and pour resin all over them and see how he does 🤣",
      "created_utc": 1725837586.0,
      "score": 5
    },
    {
      "id": "lm7j177",
      "body": "...... I saw a Titkok today about a guy making a side table with resin with his wife's makeup and it all looked new....",
      "created_utc": 1725843973.0,
      "score": 6
    },
    {
      "id": "lm7ze75",
      "body": "Picture please",
      "created_utc": 1725850513.0,
      "score": 5
    },
    {
      "id": "lm8hsp5",
      "body": "You should put all his resin making tools in resin.\n\nThen divorce him.",
      "created_utc": 1725859640.0,
      "score": 5
    },
    {
      "id": "lm8w4h9",
      "body": "I just watched his video on Tiktok. Omg",
      "created_utc": 1725869290.0,
      "score": 5
    },
    {
      "id": "lm8w6j3",
      "body": "Why have i seen a video a few days before this post of a man throwing makeup on a table an pour resin on it? Was that your husband, because everyone in that comment section was really confused why he did that",
      "created_utc": 1725869333.0,
      "score": 6
    },
    {
      "id": "lm8wz56",
      "body": "Unless he is severely stupid or mentally deficient in some way, there’s almost zero possibility that he did this accidentally. Absolutely no way he didn’t know you wouldn’t be able to remove/use your things after the resin set which is why he stopped you from looking until afterwards. \n\nDoes he ruin things often? If you really think about it, is it only your things that get ruined? Is he a jealous spouse? Does he try to control aspects of your appearance often? \n\nHe needs to replace *every single item* with money that HE earned - not you with yours.",
      "created_utc": 1725869900.0,
      "score": 5
    },
    {
      "id": "lmat424",
      "body": "His reaction “you can live without it” he just didn’t want her wearing make up anymore, total control move in the guise of a gift & taking away something she loved & enjoyed for herself",
      "created_utc": 1725900346.0,
      "score": 5
    },
    {
      "id": "lmb0n0z",
      "body": "It's not that he put it in the resin that's the issue, albiet he's a complete moron. It's the fact that when she pointed out that everything is ruined, he ignored the fact that he was the cause AND said it wasn't important. Something tells me he's done things like this before which is why she's contemplating divorce. OP please include the most outrageously expensive makeup in damages when you divorce him.",
      "created_utc": 1725902821.0,
      "score": 4
    },
    {
      "id": "lm6dtrk",
      "body": "Someone in a previous comment asked what was point? \n\nThe point was cruelty. He took something OP  really enjoys and purposely DESTROYED it. He’s not dumb he knew it would be useless after his stunt. He obviously knows OP enjoys make up and takes pride in her appearance. She has a career and he doesn’t. He wants to bring her down several notches to his level. Don’t let him. \n\nBeen married 24yrs and girl I can tell you this man doesn’t like you, much less respects you. You are young and just starting out, you can pick whatever future you want. Look what he’s shown you; is that what you want?",
      "created_utc": 1725829168.0,
      "score": 10
    },
    {
      "id": "lm6cjiv",
      "body": "What an idiot, the actual selfish idiot",
      "created_utc": 1725828756.0,
      "score": 2
    },
    {
      "id": "lm6dhpx",
      "body": "Oh no no no! HE needs to go get a real job, or two, ASAP to earn the money to replace what he ruined. Is he seriously that stupid?",
      "created_utc": 1725829061.0,
      "score": 5
    },
    {
      "id": "lm6emis",
      "body": "He does understand, he just doesn’t care.\n\nHe doesn’t want you to have any makeup and he’s not willing to communicate about it.",
      "created_utc": 1725829422.0,
      "score": 5
    },
    {
      "id": "lm6f5jb",
      "body": "I hope the women’s husband who posted a video of himself doing this on Instagram sees this!",
      "created_utc": 1725829591.0,
      "score": 4
    },
    {
      "id": "lm6fy15",
      "body": "Get a divorce. He doesn’t care about you or your feelings.",
      "created_utc": 1725829844.0,
      "score": 4
    },
    {
      "id": "lm6fzg9",
      "body": "Yup. I would divorce him. He knows it’s important to you, and if he’s so willing to disregard your rightful reaction, it’s gonna just get worse. Like if it was your EMPTY products yeah it would be kinda cool but that’s just him sealing away stuff that belongs to you. I’d just sell some of his stuff to buy  back the makeup he pretty much stole for you. Presentation can be important, and you liked how the makeup made you feel. It’s incredibly rude to destroy someone’s property, especially when you’re not in a place to buy more.",
      "created_utc": 1725829856.0,
      "score": 4
    },
    {
      "id": "lm6jcax",
      "body": "So he doesn't actually contribute to your household and somehow made it worse? Girl. Divorce him before you start making more money",
      "created_utc": 1725830957.0,
      "score": 4
    },
    {
      "id": "lm6l3ts",
      "body": "This is maybe the one time that I’m fine with the classic Reddit divorce advice. \n\nI don’t even wear makeup but this guy sounds like an idiot. \n\nGet rid of him.",
      "created_utc": 1725831534.0,
      "score": 3
    },
    {
      "id": "lm6ljsq",
      "body": "This is the most bizarre thing I’ve read today and I’ve spent a while on Reddit. Literally who does that, incredibly strange, disrespectful and super weird. Get away from this guy before he puts you in resin.",
      "created_utc": 1725831682.0,
      "score": 3
    },
    {
      "id": "lm6nebb",
      "body": "Did he make a tiktok about it? Because I saw this exactly on tiktok like a day ago or two ago",
      "created_utc": 1725832298.0,
      "score": 4
    },
    {
      "id": "lm6rr6x",
      "body": "Was this supposed to be a prank? How would he think it’s something you wanted. That’s not a homemade gift. Is he a bit slow?",
      "created_utc": 1725833798.0,
      "score": 5
    },
    {
      "id": "lm6rsy9",
      "body": "I’m so confused",
      "created_utc": 1725833815.0,
      "score": 4
    },
    {
      "id": "lm6s8cj",
      "body": "You need to divorce it's illegal to marry a child",
      "created_utc": 1725833964.0,
      "score": 3
    },
    {
      "id": "lm6tpmz",
      "body": "Is this rage bait? Noone can be this dumb and functional.",
      "created_utc": 1725834481.0,
      "score": 4
    },
    {
      "id": "lm6tqe0",
      "body": "Sounds like he needs to start working more than part time so he can pay for new stuff and save for the stupid shit he will inevitably do next.",
      "created_utc": 1725834489.0,
      "score": 5
    },
    {
      "id": "lm6upj9",
      "body": "What in the actual hell…:\n\n\nBut also why isn’t he working? Why are you fine with him not working? Is he an actual verified  moron?\n\nI am so confused",
      "created_utc": 1725834838.0,
      "score": 4
    },
    {
      "id": "lm6uul7",
      "body": "So he made a resin block with your makeup stuck inside? What exactly makes that a gift? He was intentionally being an ah. What other possible reason would he have? Unless he’s the most ridiculous gift giver ever? I mean, you don’t really buy that do you??",
      "created_utc": 1725834887.0,
      "score": 4
    },
    {
      "id": "lm6vn67",
      "body": "I literally watched the tiktok of him making this tonight and couldn’t believe my eyes",
      "created_utc": 1725835174.0,
      "score": 5
    },
    {
      "id": "lm6y23q",
      "body": "I’m having an extremely hard time figuring out how this was not intentional. Like how are you so inept that you completely encase something that your partner uses everyday? \n\nI think YOU can afford new makeup, but you can’t afford new make up and supporting a full grown adult.",
      "created_utc": 1725836029.0,
      "score": 4
    },
    {
      "id": "lm6y7t6",
      "body": "He needs to work full time either for his dad or elsewhere. To pay you back but also to not be such a dead beat. \n\nHow did he think you'd love that as a gift? I'm wondering has he done anything like this in the past? Has he been diagnosed with anything that might explain his decision to do this?",
      "created_utc": 1725836085.0,
      "score": 4
    },
    {
      "id": "lm6yiz3",
      "body": "I am so sorry. What an awful thing for him to have done.\n\nHe needs to replace what he destroyed.   He also needs to get a full time job and pull his weight. \n\nI understand why you are contemplating divorce.  I can't say that I'd think different in your situation. \n\nIf interested, I have a TON of makeup (pallets, loose pigments, pencils etc) that is very gently used, and some not used at all.   I can sanitize and I'd be happy to send some your way.  If interested, message me.",
      "created_utc": 1725836194.0,
      "score": 4
    },
    {
      "id": "lm70whu",
      "body": "Imagine your best friend told you this story. What would you tell her to do?",
      "created_utc": 1725837045.0,
      "score": 4
    },
    {
      "id": "lm71p6l",
      "body": "Serious question: is your husband mentally disabled?",
      "created_utc": 1725837334.0,
      "score": 4
    },
    {
      "id": "lm7274t",
      "body": "Assuming your husband actually meant well, you've at best got yourself one of the dumbest people on the planet. \n\nOn top of that, you've got one of the dumbest people on the planet that doesn't really care how you feel about things and doesn't contribute much financially. \n\nIf you don't have children yet, I would definitely keep thinking about divorce. And even if you do, consider what kind of role model you want them to think is acceptable.",
      "created_utc": 1725837516.0,
      "score": 5
    },
    {
      "id": "lm767un",
      "body": "I’ve only read the title so far, and I want to divorce him for you\n\nEDIT: Wtf? Did you marry a kindergartner? This man has no brain. This is so deeply stupid that it would almost be better if it was malicious.",
      "created_utc": 1725838998.0,
      "score": 4
    },
    {
      "id": "lm7cehc",
      "body": "[removed]",
      "created_utc": 1725841375.0,
      "score": 4
    },
    {
      "id": "lm7d7bb",
      "body": "I have had to read this several times to figure out what the fuck happened and I still don’t get it",
      "created_utc": 1725841686.0,
      "score": 3
    },
    {
      "id": "lm7eoc3",
      "body": "I just really want OP to come back and explain how her husband explained his process. It’s *killing* me. What does he think he was he trying to make?",
      "created_utc": 1725842265.0,
      "score": 4
    },
    {
      "id": "lm7epz7",
      "body": "You should make him a home made gift putting all his tools in resin! So thoughtful /s",
      "created_utc": 1725842283.0,
      "score": 3
    },
    {
      "id": "lm7exw7",
      "body": "I don’t get it. How does he get “I want a nicer thing to put my make up in that can nicely display it” and think to put it in resin to “have it on display but never be able to use it”?",
      "created_utc": 1725842369.0,
      "score": 4
    },
    {
      "id": "lm7iyqj",
      "body": "Did he make a TikTok about it? I swear I just saw a guy making a “picky pad” w makeup for his wife but it really did look like resin",
      "created_utc": 1725843946.0,
      "score": 4
    },
    {
      "id": "lm7tzak",
      "body": "So you are a new nurse, can only pay for necessities, and you’re fine being the breadwinner? Make that man get a job ffs. He spent YOUR money to buy the resin to destroy YOUR makeup!",
      "created_utc": 1725848292.0,
      "score": 4
    },
    {
      "id": "lm7w6qt",
      "body": "Not trying to be mean but he seems to having a learning disability.   Something is definitely wrong here.   Are you sure he is playing with a full deck of cards?\n\nResin is expensive too…\n\nEither this is something to open your eyes and wake up OR this is something you will laugh about one day",
      "created_utc": 1725849192.0,
      "score": 4
    },
    {
      "id": "lm84huj",
      "body": "Oh, my love. You amazing human woman. Listen to that rage. Listen to your gut. I don’t know what hobbies your husband has…video games? What if you bought a display shelf for all his games, and filled it with resin that destroyed all of them? How would he react?\n\nYou are in shock, which is 100% normal and natural. I’m willing to bet he’s pulled other nonsense like this, but that perhaps your current level of shock comes because this is the worst & most blatant? \n\nYour husband — the person who is supposed to be your partner, your support, your safety — took something you loved & enjoyed, and was also expensive (not that it matters, but in this case you mentioned it’s not easily replenished), and destroyed it. And then derided & dismissed your absolutely valid feelings. \n\nNo partner ever, EVER deliberately does this kind of damage to someone they love and respect. Sure, mistakes can & do happen. Even big ones. But if he intended it to be a joke, then once he realized he had deeply hurt you & messed up so badly, his response should have been “I’m so sorry, I made a terrible mistake, I will work to make it up to you not only by taking you shopping to replace your makeup, but also by listening to what else you need from me to reestablish trust and dedicating myself to that”.\n\nAn incident of this magnitude does not come out of nowhere. He’s been doing things like this for a very long time. I’m willing to bet that you know it, and can name several examples. \n\nPlease, please, PLEASE give this horrible man what he has earned, which is the absence of your excellence from his life. I do not say this lightly AT ALL. If you feel he deserves some kind of chance, then go stay with family or friends if you can for at least a month. See his reaction. See if he admits he needs to change, to do better, to earn back your trust. Truly see how he reacts. Behavior is a language, and this is horrendous.",
      "created_utc": 1725852705.0,
      "score": 4
    },
    {
      "id": "lm8dnpt",
      "body": "He is an A-hole. He did it to make fun of you and will now gaslight you into thinking he’s cute and thoughtful. \nResin is very expensive, how can he afford that but not replacement makeup?\nYou are mad and it’s okay!",
      "created_utc": 1725857245.0,
      "score": 3
    },
    {
      "id": "lm8e71x",
      "body": "Either it was malicious or he’s too stupid to procreate with. Either way I understand why you’re contemplating divorce.",
      "created_utc": 1725857541.0,
      "score": 3
    },
    {
      "id": "lm8ejdu",
      "body": "It's not sweet, he ruined your makeup under the guise of a gift and doesn't give a fuck. There is no way that someone will put something you use daily and knows you love in resin without knowing full well what he's doing.",
      "created_utc": 1725857733.0,
      "score": 3
    },
    {
      "id": "lm8f3au",
      "body": "He’s just playing dumb. He secretly resents you because he is a loser who cannot hold down a job and become the breadwinner. He’s playing dumb and is not even sorry and he won’t replace the make up he ruined. No man is actually this dumb, I tell you. Replace him, pronto. Don’t stay with incompetent men who resent you because you’re more successful than them",
      "created_utc": 1725858045.0,
      "score": 4
    },
    {
      "id": "lm8hgna",
      "body": "OP he 100% did that shit on purpose. Why isn't he actually working? Why is he on his ass all day?\n\nI really don't think you're out of line here, this isn't about make up it's about a lack of fundamental respect for you. That's a massive red flag.",
      "created_utc": 1725859434.0,
      "score": 4
    },
    {
      "id": "lm8igs2",
      "body": "Anyone who has ever worked with Resin knows that once something is trapped in the Resin it's not coming out. And anyone who has ever been with a woman when she buys makeup knows it costs a lot of money, especially the good kind. This was done on purpose so that you wouldn't have access to makeup and because he knew you couldn't afford to buy more anytime soon. That to me doesn't sound like a gift at all. No one is this dumb, to me it sounds malicious.",
      "created_utc": 1725860054.0,
      "score": 4
    },
    {
      "id": "lm8iiyb",
      "body": "The guy just wanted to ruin your stuff. Stuff you liked and were actively using. Unless he’s literally mentally handicap or something, he knew exactly what he was doing.",
      "created_utc": 1725860091.0,
      "score": 5
    },
    {
      "id": "lm8iqcj",
      "body": "OP, I have a few questions and comments.\n\nWhy isn't he working more than part time? Does he actually contribute to the household while you work?  Is there kids involved?\n\nFull stop. \n\nHe refuses to pay for new makeup acts like YOU are in the wrong for being upset over losing your makeup? He should have asked before he ruined. Nah, he can GTFOH. I'd lay it out for him as specific as possible. You will take a part of HIS fun money every pay period and purchase a new product to replace what he ruined until you get it replaced. \n\n\nOP, you deserve better. Whatever his reason was, nefarious or just idiotic, I'd definitely make sure he knows that if this happens again (him ruining something you enjoy and work hard for) that there will be a lawyer involved. If he does this to you on purpose, he'll do it to kids if they enter the picture.\n\nI have rosacea along with excema and erythema multiforme, and my skincare and makeup is ungodly expensive. My partner enjoys it when I wear it and I include him in helping pick out colors. He knows if the wind blows wrong, my body temperature rises, or the sun shines too bright that I could face a miserable flare-up. He'd never ever dream of touching my items unless I asked him. I wanted a spinning makeup holder thing and you know what he did, he told me to take $25 of his fun money and buy it.",
      "created_utc": 1725860216.0,
      "score": 5
    },
    {
      "id": "lmdpvux",
      "body": "Hey! Your husband’s an idiot. Put his game controllers in resin :)",
      "created_utc": 1725935966.0,
      "score": 5
    },
    {
      "id": "lm6gqus",
      "body": "This is why you can’t trust a person with no ambitions. When they finally have the motivation to do something outside the box you realize they’re a complete kook with no life experience or common sense. This is not a way to live happily ever after. \n\n Make him pay for it or say you’re going to take it out of the household bills to pay for it. I.e. no snacks for the pantry, no beer for the fridge, no steaks or pricey meats until it’s paid off. ",
      "created_utc": 1725830101.0,
      "score": 7
    },
    {
      "id": "lm6rpcr",
      "body": "Is he.. simple? I don’t know the polite way to say this but does he have a really low IQ/cognitive function? \n\nNot a sarcastic question at all, because we need to know why he acted this was. If he truly doesn’t understand why what he did was wrong and upset you, he is below an early elementary cognition level and may need a lot of additional support. If he just didn’t realize that encasing your makeup in resin would render it unusable and not make a lazy Susan for storing it but does understand that now, he’s operating at maybe a 3rd grade level. Either way he needs support and no access to toxic chemicals at work or home. He should not be married to anyone as consent is an issue at this point.\n\nIf he is a typically developing adult, he’s full of shit.",
      "created_utc": 1725833780.0,
      "score": 7
    },
    {
      "id": "lm6flug",
      "body": "Jfc. What a dumb fuck. He did it knowing it would ruin it. Do not support him if this is how he acts. After you drown his tools in cement (since you were so kind to do him this favor \"so they wont rust\") or something, tell him to go back home to his daddy since he still has the mental capacity of a 6 year old.",
      "created_utc": 1725829734.0,
      "score": 7
    },
    {
      "id": "lm6cf79",
      "body": "why would he even think to do this? it’s so objectively stupid it seems malicious. hard for me to fathom how he could think this was a good idea",
      "created_utc": 1725828718.0,
      "score": 3
    },
    {
      "id": "lm6d4bl",
      "body": "What a ****",
      "created_utc": 1725828942.0,
      "score": 3
    },
    {
      "id": "lm6des4",
      "body": "Either make him go replace your makeup or…divorce him or both. Either way, he’s not a good person and you deserve much better",
      "created_utc": 1725829035.0,
      "score": 3
    },
    {
      "id": "lm6e4zo",
      "body": "Wth? I'm petty, I would put something of his in resin and then leave.\n\nWhat's his problem? 🥹 I'm so sorry for your lost makeup and for the shitty \"handmade gift\".",
      "created_utc": 1725829267.0,
      "score": 3
    },
    {
      "id": "lm6ef2i",
      "body": "So your fine being married to someone who doesn't even hold down & actually job...so he doesn't have the $$ and he goes & literally destroys your makeup after you told him about wanting to upgrade. DUMP THIS DUDE WTF, him destroying your shit is what he is doing to your self esteem...Girl get up!! Run!",
      "created_utc": 1725829356.0,
      "score": 3
    },
    {
      "id": "lm6egp5",
      "body": "I would take something he loves and put it in resin. He doesn’t understand because he doesn’t value the make-up or really you. If you put the thing in resin and he gets it, then maybe your marriage is salvageable. However, if he freaks out and doesn’t see the harm he caused, then it’s likely your marriage is over.",
      "created_utc": 1725829370.0,
      "score": 3
    },
    {
      "id": "lm6f4a0",
      "body": "Oh yikes. He's definitely not the kind of guy I would feel safe building a life with.  \nI would've been contemplating divorce just because he doesn't work as much as you. \n\nI'd be willing to bet this isn't the 1st time He's done something like this.",
      "created_utc": 1725829580.0,
      "score": 3
    },
    {
      "id": "lm6f8od",
      "body": "Just make a resin block with a collection of his and see how he likes the gift. And let him pay to replace it just say “oh I didn’t think about that”",
      "created_utc": 1725829617.0,
      "score": 3
    },
    {
      "id": "lm6fveb",
      "body": "You should get a divorce and find someone whose bot a baby. Be so fr he is in his mid 20s acting like this with no stable career. Why are you with this man?",
      "created_utc": 1725829820.0,
      "score": 3
    },
    {
      "id": "lm6fvx1",
      "body": "Idk if this is really your story, because I saw a tiktok of it this morning in my fyp from the husband’s POV… but if its the case yikes. Thats a red flag that he posted it online too like its a silly joke",
      "created_utc": 1725829825.0,
      "score": 3
    },
    {
      "id": "lm6gsf3",
      "body": "Sounds like he is insecure that you’re the bread winner and making him feel like less of a man. He’s probably nervous about makeup making you more attractive to others and making it easier for you to find affair partners or leave him. \n\nI would also pay attention to see if he is cheating, because this all may be projecting his own feelings and behaviors onto you. I know nurses work a lot, especially where you’re the main income, so he could be feeling neglected or that you have plenty of opportunity to be unfaithful. \n\nSometimes when men feel emasculated they sleep with other women, to feel like a “man” again. I know I’m digging pretty deep. But unless he’s a complete moron, or mentally disabled in some way, he should know that what he did wasn’t going to be ok. It’s like a child ruining your favorite thing because it is taking his attention away. \n\nDon’t feel bad, he is not respecting your things, time (because you work hard to have that money), or valuing the financial burden he is already putting on your household outside of this situation. Now to add insult to injury he destroys something you care about. He sounds emotionally immature or insecure. You need a serious conversation about how he’s feeling in your relationship and couples therapy.",
      "created_utc": 1725830115.0,
      "score": 3
    },
    {
      "id": "lm6gtir",
      "body": "I saw a guy do exactly the same thing on instagram reels… people were warning him that this might not go well with his wife because, those weren’t empties or discarded makeup - by any chance could that be your husband because it would explain that he did it for views or as ragebait?",
      "created_utc": 1725830125.0,
      "score": 3
    },
    {
      "id": "lm6hs0v",
      "body": "He needs to work full time until he’s made enough $$$$ to replace the makeup.  He can ask Daddy ! \n\nI’d go online and start adding up what the replacement value is - and then, double it. \n\nWhen he sees h juts made a really dumb $400.00 (?) mistake for craft time ? Maybe he’ll get the drift. \n\nTake it out of the “monthly” expenses and he can replenish it - see how stupid he thinks it is then. \n\nOr offer to cancel his favourite streaming app/game/cable/gym membership - whatever can be cancelled (buying beer ? Cigarettes ?) until you’ve got the $$$ to buy new makeup. \n\nDoesn’t matter if he thinks you need it or not …. That’s not up for discussion.  You will not go to work without your makeup done. Period. \n\nDoesn’t have to be a “lesson” just has to be a fact - he ruined 00’s of $$$ of your things…under the guise of a crafty gift ? And didn’t “realize” how stupid that was ?  And now it needs to be replaced (not negotiable) and he can get over it. \n\nI can’t help but thinking if he doesn’t have a low IQ to begin with ??? That’s some seriously passive aggressive behaviour.",
      "created_utc": 1725830440.0,
      "score": 3
    },
    {
      "id": "lm6hu0e",
      "body": "He did this on purpose. Divorce him.",
      "created_utc": 1725830458.0,
      "score": 3
    },
    {
      "id": "lm6i0zo",
      "body": "Sounds like an entitled dumbass.. please go find yourself a husband who has a full time job and some respect for himself. They typically tend to respect you better and will own up to that mistakes.",
      "created_utc": 1725830521.0,
      "score": 3
    },
    {
      "id": "lm6j8bl",
      "body": "My immediate thought is you just got a new job, where you’re not around him, and you put on make up every morning. He did this because he was feeling insecure and didn’t want you to wear make up.",
      "created_utc": 1725830922.0,
      "score": 3
    },
    {
      "id": "lm6j9e9",
      "body": "If he has a PlayStation or the like, sell it, then replace your make up, and file for divorce. What is he 10?  You fuck up someone’s shit, you fix it and replace it.",
      "created_utc": 1725830931.0,
      "score": 3
    },
    {
      "id": "lm6jajd",
      "body": "I have to wonder if he did it deliberately to stop you wearing makeup.\n\n\nYou just started a new job and maybe he's jealous? \n\n\nMaybe he's one of those men who thinks \"women look better natural\", especially if he's recently started watching certain online content.\n\n\nMaybe he's upset that you're the breadwinner and he doesn't control you or the finances so he took back some control of you?  Which also could tie in to the maybe above this one.",
      "created_utc": 1725830942.0,
      "score": 3
    },
    {
      "id": "lm6jge9",
      "body": "This is just weird… It sounds like Weaponized incompetence and like he just honestly wanted to mess up some thing that you loved and try to act stupid afterwards. Like what the hell?",
      "created_utc": 1725830995.0,
      "score": 3
    },
    {
      "id": "lm6jl6w",
      "body": "I just saw a TikTok where the husband put his wife’s makeup in resin 😭😭 & they were expensive products too. Sometimes it’s not about the money but the fact that it’s your stuff & he didn’t respect it enough to avoid putting it in resin… he could’ve made a resin flower tray but instead used hundreds of dollars worth of makeup products for this project… love is about consideration & if he’s inconsiderate then it’s his loss. What he did is so messed up. Don’t do to others what you wouldn’t want them to do to you.",
      "created_utc": 1725831038.0,
      "score": 3
    },
    {
      "id": "lm6k2bd",
      "body": "Why would you marry someone that doesn’t work?",
      "created_utc": 1725831193.0,
      "score": 3
    },
    {
      "id": "lm6mz6j",
      "body": "Almost all of this could be forgiven, we could assume he was really that dumb and didn’t know better, except for how he handled it. He wrecked your stuff and then when you told him he could make it up to you by getting you new makeup he told you that your interests were dumb and you didn’t need them.\n\nWhy are you with this guy? He sounds inconsiderate, immature, and he’s not even bringing money to the relationship, nor is he working towards anything. If you really want to raise something dumb and helpless you should go adopt a dog, at least a dog will look guilty when being scolded for destroying your stuff instead of telling you your stuff was stupid anyway.",
      "created_utc": 1725832156.0,
      "score": 3
    },
    {
      "id": "lm6p8q7",
      "body": "I’m convinced most guys have no thought behind those eyes. They’re so absentminded, inconsiderate, and they have no idea what they do wrong. My god I get so frustrated with men, it’s so mind blowing how a person can be so idiotic",
      "created_utc": 1725832922.0,
      "score": 3
    },
    {
      "id": "lm6umqr",
      "body": "He just gave you a wonderful birthday or Christmas idea!\n\nTake one of his most cherished items, have it set in a resin block and wrap it up. \n\nHand made gifts are the best since they’re made from the heart.",
      "created_utc": 1725834809.0,
      "score": 3
    },
    {
      "id": "lm6utjm",
      "body": "I’d leave. At worst, he’s a super shitty person who wanted to ruin something you value, or he’s dumb as a dodo. Neither make good husbands.",
      "created_utc": 1725834878.0,
      "score": 3
    },
    {
      "id": "lm6uwgq",
      "body": "How did he afford the resin?",
      "created_utc": 1725834906.0,
      "score": 3
    },
    {
      "id": "lm6ws92",
      "body": "You should not be married to him. Period. He shouldn’t force you to be the breadwinner, he should want to support you and take care of you. He’s lazy and sounds like emotionally manipulative, set out to hurt your confidence. He is a leech. Get a man who will work.",
      "created_utc": 1725835575.0,
      "score": 3
    },
    {
      "id": "lm6xpch",
      "body": "No one who knows what resin in, and knows to put a towel over it, will NOT KNOW that putting an item in resin means you can’t access it. \n\nHe was deliberately doing this so you don’t have access. There’s literally no other expectation if he’s not a complete and total moron, in which case it’s time to move on. \n\nI’d be buying that shit and it’s up to him to buy himself groceries because it’s not happening this month, or he can break your makeup out. ",
      "created_utc": 1725835902.0,
      "score": 3
    },
    {
      "id": "lm6zhj2",
      "body": "What a narcissist!! You’re paying for everything he does nothing. He did this because he thought it was funny to see how you would react. The only reaction you should have is to pack his bags and tell him to go to his parent’s house. Man/child let his parents take care of him.",
      "created_utc": 1725836537.0,
      "score": 3
    },
    {
      "id": "lm6znov",
      "body": "Bro can’t even work full time at *his dad’s* pool cleaning business. \n\nThat was the place where you divorce him, btw. Not the makeup.",
      "created_utc": 1725836597.0,
      "score": 3
    },
    {
      "id": "lm70b8f",
      "body": "This can not be from the tiktok right 😂😂😂",
      "created_utc": 1725836831.0,
      "score": 3
    },
    {
      "id": "lm70cms",
      "body": "So he essentially destroyed your makeup?  I’m so confused, that’s abusive.",
      "created_utc": 1725836844.0,
      "score": 3
    },
    {
      "id": "lm71kfl",
      "body": "The only thought I had at the end of this is he is majorly gaslighting you and manipulating you into thinking it was as a gift but instead he was getting rid of something he knows you love to be an abusive ass. :/ almost like he’s punishing you for wearing it and knows that this will prevent that. \n\nI would be divorcing too. That’s wild.",
      "created_utc": 1725837285.0,
      "score": 3
    },
    {
      "id": "lm71rh6",
      "body": "I saw a tik tok of a guy doing this to his wife’s makeup",
      "created_utc": 1725837357.0,
      "score": 3
    },
    {
      "id": "lm721l8",
      "body": "So his idea of a handmade gift is to make a new makeup display for all the makeup he needlessly destroyed?\n\nBottom line is he wanted browny points for ruining your personal items, doesn’t care enough to take your feelings in account before he does something, and doesn’t feel the need to self-reflect when you express that what he did was wrong, and doesn’t care enough to even try to make it up to you, or at least admit he screwed up. Most he’s willing to give you is an empty apology with a shrug. All while he doesn’t pull his own weight in the home.\n\nThat’s a pretty good reason to leave Someone.",
      "created_utc": 1725837459.0,
      "score": 3
    },
    {
      "id": "lm73mnn",
      "body": "What a coincidence - I just saw a video on TikTok of a guy putting his gf’s makeup in resin and made it into a table…. Sorry this happened bro",
      "created_utc": 1725838040.0,
      "score": 3
    },
    {
      "id": "lm73oox",
      "body": "He did that to be cruel. And he doesn’t care how you feel. Get the divorce and move on. Also, your soon to be ex isn’t just cruel, he’s a weirdo to boot.",
      "created_utc": 1725838061.0,
      "score": 3
    },
    {
      "id": "lm73sro",
      "body": "I hate to be the typical redditor and tell you to divorce him, but if he can’t understand his error here, what’s next?",
      "created_utc": 1725838103.0,
      "score": 3
    },
    {
      "id": "lm73y4j",
      "body": "This sounds like he was trying to piss you off. What on earth did he expect would happen?",
      "created_utc": 1725838157.0,
      "score": 3
    },
    {
      "id": "lm74f23",
      "body": "I just saw a Tiktok video of a husband doing this to his wife’s makeup",
      "created_utc": 1725838330.0,
      "score": 3
    },
    {
      "id": "lm74gjr",
      "body": "Info: did your husband recently experience a TBI? Nothing else explains this.",
      "created_utc": 1725838346.0,
      "score": 3
    },
    {
      "id": "lm74h6h",
      "body": "This man hates you. Divorce him girl.",
      "created_utc": 1725838352.0,
      "score": 3
    },
    {
      "id": "lm74z6w",
      "body": "Resin? You have to have half a brain to understand using resin—even reading the instructions. He knew what he was doing. No other way around it. \n\nThis is toxic behavior. He did it KNOWING full well that HE couldn’t replace it and likely wouldn’t. \n\nBest to figure this out now before these little experiments become more frequent, more expensive and more violent. \n\nGood luck.",
      "created_utc": 1725838538.0,
      "score": 3
    },
    {
      "id": "lm754dj",
      "body": "first and foremost, you're amazing. I don't care where you live or what field you're in: if you can afford rent, utilities, and groceries alone?  You're awesome and have more than most of us. He has a part time job so he's not \"bored.\" Does he contribute only to his own non-boredom aka fun, or to yours as well?\n\nSeemingly not.  What's really concerning here is that he doesn't respect your personal property.  How would he feel if you put a bunch of HIS stuff in resin??",
      "created_utc": 1725838592.0,
      "score": 3
    },
    {
      "id": "lm75fv0",
      "body": "Honey... either this is a fucking prank or you are married to an absoloute sociopath. This was in no way a mistake. Do not assume stupidity. This was malicious.\n\nWhat you do is take his credit card, go replace every fucking item. He can drive uber eats to pay that bill. Or you cancel HIS christmas and birthday gifts this year. But you replace your personal property, and save the receipts and tell him if any \"accidents\" like this happen to your personal property you're filing suit for 3x value plus damages. And you need to dig ypur heels into this like you're mining for diamonds... how DARE he just dismiss you after destroying your things. \n\nMen today might be \"clueless\" about the *exact* cost of makeup, but they have HEARD WOMEN TALK ABOUT HOW FUCKING EXPENSIVE it is for our grooming and upkeep. We all talk about that. There are probably Amish girls sitting around complaining about how many renders they need to do for their tallow and how long it takes to distill flowers and herbs into tinctures and Jebadiah and Seth are scratching their heads and keeping their mouths shut. So men KNOW cosmetics are both personal, and an investment. \n\nIt was on purpose. Mistakes like this dont happen. The fact he's not running around with his \"art\" to stores trying to get it all bavk tells you this was done to test you and see what \"micro\" aggressions he can get away with ... until he escalates the abuse further.",
      "created_utc": 1725838710.0,
      "score": 3
    },
    {
      "id": "lm768xd",
      "body": "This is abusive. Please go look up and see if you can link any other behaviours. He took something that gave you joy, made you feel better about yourself, and he destroyed it. Then shrugged it off. This is how it starts.",
      "created_utc": 1725839009.0,
      "score": 3
    },
    {
      "id": "lm76or2",
      "body": "Tell him that you're encasing his vehicle in acrylic and that he will need to replace it immediately and see if he figures it out.",
      "created_utc": 1725839174.0,
      "score": 3
    },
    {
      "id": "lm76pbm",
      "body": "I’m going to be honest, it’s going to get worse. That’s blatant disrespect. You know it and so do I . He just majority disrespected you and went on because he knew he could. \n\nThat’s not okay.",
      "created_utc": 1725839180.0,
      "score": 3
    },
    {
      "id": "lm76v7b",
      "body": "Either he is truly dumber than a rock or he did this on purpose out of spite. Either way I don't see a reason for you to waste time on him. Cut him out and I guarantee your expenses will go down too.",
      "created_utc": 1725839241.0,
      "score": 3
    },
    {
      "id": "lm771wi",
      "body": "If your instinct is to divorce, DO IT.  That's your alarm system going off.  I wish I had listened to mine.",
      "created_utc": 1725839312.0,
      "score": 3
    },
    {
      "id": "lm7792l",
      "body": "Im so confused. How was this a gift? How was pouring resin all over your makeup supposed to do anything but ruin it?",
      "created_utc": 1725839387.0,
      "score": 3
    },
    {
      "id": "lm7czy0",
      "body": "You're the bread winner and you are fine with that. I read it twice and I'm not seeing how it's fine he has a PT job so he's not bored. Sounds like you are married to a child.",
      "created_utc": 1725841607.0,
      "score": 3
    },
    {
      "id": "lm7d6b8",
      "body": "This guy is a fucking boat anchor.  This is the kind of guy that will forever make your life HARDER rather than be an actual partner to build with.   Cut and run would be the best plan.",
      "created_utc": 1725841675.0,
      "score": 3
    },
    {
      "id": "lm7e4ei",
      "body": "This reminds me of a video I saw where a man took his gf’s makeup and ruined it like a toddler “as a joke”…. I just don’t understand how people can do shit like this and think it’s okay",
      "created_utc": 1725842045.0,
      "score": 3
    },
    {
      "id": "lm7ecal",
      "body": "Post a pic of this monstrosity PLEASE 🙏",
      "created_utc": 1725842132.0,
      "score": 3
    },
    {
      "id": "lm7flpn",
      "body": "Did he happen to make a TikTok of it? I legitimately just watched a video of a guy doing this to his wife's makeup.",
      "created_utc": 1725842628.0,
      "score": 3
    },
    {
      "id": "lm7gnrr",
      "body": "This is just a symptom of the disease. You should divorce for the much more serious reasons underneath the destruction of your makeup.",
      "created_utc": 1725843044.0,
      "score": 3
    },
    {
      "id": "lm7hwve",
      "body": "There was literally a tiktok posted a few hours ago. This post has to be a rage bait based off of that.",
      "created_utc": 1725843534.0,
      "score": 3
    },
    {
      "id": "lm7j287",
      "body": "Saw this on tik tok lol",
      "created_utc": 1725843985.0,
      "score": 3
    },
    {
      "id": "lm7je18",
      "body": "What are the odds he put it on tiktok? Because I just saw a husband do just that…",
      "created_utc": 1725844114.0,
      "score": 3
    },
    {
      "id": "lm7jf1r",
      "body": "I think I saw a TikTok with exactly this same scenario the makeup was all in great condition and name brands. Everyone in the comments was roasting the guy.",
      "created_utc": 1725844125.0,
      "score": 3
    },
    {
      "id": "lm7k4xw",
      "body": "Did he by chance post this on TikTok or is it a terrible trend going around? I saw a video where he dumped a whole makeup bag of ysl and other high end products and poured resin over it for a “surprise”. Oh and definitely nta, your husband however is a huge ass.",
      "created_utc": 1725844407.0,
      "score": 3
    },
    {
      "id": "lm7k70v",
      "body": "damn your husband is fuckin stupid",
      "created_utc": 1725844429.0,
      "score": 3
    },
    {
      "id": "lm7lw9x",
      "body": "Wait didn’t he post a video of him making it on tiktok?",
      "created_utc": 1725845097.0,
      "score": 3
    },
    {
      "id": "lm7m2hp",
      "body": "Did he post a TikTok about it? Saw it yesterday on my FYP.",
      "created_utc": 1725845166.0,
      "score": 3
    },
    {
      "id": "lm7p6pp",
      "body": "It's like that old saying, \"If you love someone, let them go. If they come back, that means nobody else wanted them either.\" Let this one go and find someone who wants to be a contributing partner in an adult relationship. You'll be doing him a huge favor. Or he will go and live in his dad's basement.",
      "created_utc": 1725846392.0,
      "score": 3
    },
    {
      "id": "lm7r57f",
      "body": "Girl. He did that on purpose. That’s not an accident. You can’t just. Do that on accident. That’s a time consuming purposeful act. \n\nDoes he often ruin your stuff? Just your stuff? Destructive in targeted ways and then brushes it off as a favor or whatever? \n\nCause this is kinda abusive ngl",
      "created_utc": 1725847162.0,
      "score": 3
    },
    {
      "id": "lm7rjq2",
      "body": "He's playing dumb.",
      "created_utc": 1725847320.0,
      "score": 3
    },
    {
      "id": "lm7syvx",
      "body": "So another dude faking not understanding because he’s taught you how to tolerate being permanently unhappy.\n\nLife is too fucking short reddit friend. How much of your life will you waste with him?",
      "created_utc": 1725847884.0,
      "score": 3
    },
    {
      "id": "lm7ufox",
      "body": "OP...did he make a tiktok about it? I saw JUST YESTERDAY a tiktok of a husband making something EXACTLY like what you're describing in his backyard with his wife's make up. There was YSL lipstick, Chanel compact, etc and he dumped it in there from a make up bag. 🤔\n\n\nEveryone in the comments were like I hope those are empty and you got permission because if not the wife will be pissed. \n\nIf I find it again I'll send you a link.",
      "created_utc": 1725848477.0,
      "score": 3
    },
    {
      "id": "lm81ear",
      "body": "This isn’t stupidity like he wants you to believe it is. He sees that you enjoy this hobby and decided to take it upon himself to ruin this for you under the guise of a “gift” that he can claim he fucked up. Does he often try to ruin moments that are meant to be about you?",
      "created_utc": 1725851349.0,
      "score": 3
    },
    {
      "id": "lm8545c",
      "body": "“He said that’s dumb and I can live without it” \n\nI say HE’s dumb and you can live without him.",
      "created_utc": 1725852981.0,
      "score": 3
    },
    {
      "id": "lm85rgz",
      "body": "I don't understand WHY her husband isn’t working at a FULL-TIME job!! She doesn't mention children or anything. I worked with TOO MANY nurses who worked overtime to support their lazy ass husbands. “He doesn't like getting up early in the morning.” “Well, he likes to play golf.” “He’s watching our kid & keeping house. “ (Turns out he’s doing NEITHER, but I digress.) Divorce his ass!! It will ONLY get worse!! I’m a retired RN. Don’t wait until you have kids! Kick the BUM OUT!!!",
      "created_utc": 1725853260.0,
      "score": 3
    },
    {
      "id": "lm85xfh",
      "body": "I NEED TO SEE A PICTURE OF THIS. PLEASE. All I can can picture in my head is like a Bundt pan shape block of resin with whole ass makeup products in it.",
      "created_utc": 1725853334.0,
      "score": 3
    },
    {
      "id": "lm8b3cw",
      "body": "Sounds like weaponized incompetence to me. There is no way he didn't know what he was doing when he took ALL your makeup and permanently encased it in resin. \n\nMaybe I'm reading too much into it, but it sounds like he took what was something you enjoyed and ruined it intentionally, and I personally would be looking back at any and all instances where something like this has happened. \n\nNot sure if you ever have any extra money that you just spend elsewhere, but I say go treat yourself to some new makeup ASAP and if anyone gives you any gripe about it tell them you work hard and deserve to play a little for once and it's not up for discussion.\n\nEdit to add: I reread your post, and he needs to get off his lazy ass and work full time. It's fine if you want to be the breadwinner, but he needs to contribute more to get y'all in a better place before you start supporting this moron like this.",
      "created_utc": 1725855867.0,
      "score": 3
    },
    {
      "id": "lm8byec",
      "body": "I think I saw a TikTok of someone's husband doing the same thing except me made a resin make up vanity....he didn't finish it and there wasn't a part 2",
      "created_utc": 1725856324.0,
      "score": 3
    },
    {
      "id": "lm8cbn4",
      "body": "What the fuck",
      "created_utc": 1725856521.0,
      "score": 3
    },
    {
      "id": "lm8cnrz",
      "body": "Your husband hates you.  Nobody who loved you would destroy something you loved that much. Especially since he was utterly dismissive about it.  This was done maliciously.\n\n(realized I clicked a different sub than I thought)",
      "created_utc": 1725856703.0,
      "score": 3
    },
    {
      "id": "lm8d7fo",
      "body": "He can afford resin on a whim, but can’t afford to help replace some of the makeup? Correct me if I’m wrong but isn’t resin kind of expensive?",
      "created_utc": 1725856999.0,
      "score": 3
    },
    {
      "id": "lm8e4zm",
      "body": "I think setting his car keys in resin would be a nice gift.",
      "created_utc": 1725857509.0,
      "score": 3
    },
    {
      "id": "lm8eh5v",
      "body": "you should put the stuff he loves in a dish and cover it with resin because it’s such a smart and thoughtful gift.",
      "created_utc": 1725857698.0,
      "score": 3
    },
    {
      "id": "lm8ehzs",
      "body": "Your husband has a brain the size of a peanut if he genuinely thought this was a good idea.",
      "created_utc": 1725857711.0,
      "score": 3
    },
    {
      "id": "lm8gz5k",
      "body": "Does he have a PS5? Put that in resin and then divorce him.",
      "created_utc": 1725859147.0,
      "score": 3
    },
    {
      "id": "lm8hd3k",
      "body": "Let me take all your make up and make it unusable as a gift... Is he that dense?",
      "created_utc": 1725859376.0,
      "score": 3
    },
    {
      "id": "lm8jurh",
      "body": "Didn't I just see this TikTok?",
      "created_utc": 1725860902.0,
      "score": 3
    },
    {
      "id": "lm8k3qn",
      "body": "Your husband is your biggest hater. This was not sweet. He can’t even afford to replace the make up he ruined… like girl. What are you doing with him",
      "created_utc": 1725861057.0,
      "score": 3
    },
    {
      "id": "lm8km6p",
      "body": "Your husband needs a proper job because he seems to have too much time on his hands",
      "created_utc": 1725861378.0,
      "score": 3
    },
    {
      "id": "lm8lucj",
      "body": "I cannot see how anyone could be ok with their partner collecting a load of their personal stuff and setting it in resin. If he turns around and says it’s a joke - how is that meant to be funny?? This person is vindictive and immature.",
      "created_utc": 1725862168.0,
      "score": 3
    },
    {
      "id": "lm8m7jc",
      "body": "There is literally no way he didn’t know he was destroying it",
      "created_utc": 1725862406.0,
      "score": 3
    },
    {
      "id": "lm8mxwz",
      "body": "Can you convince me he did not do this vindictively?",
      "created_utc": 1725862884.0,
      "score": 3
    },
    {
      "id": "lm8mzl7",
      "body": "I think I saw his tiktok post unless a lot of husbands are now doing this?? \n\nI’m so sorry though. My husband wouldn’t hear the end of it until it got remedied.",
      "created_utc": 1725862914.0,
      "score": 3
    },
    {
      "id": "lm8q47a",
      "body": "Your husband sounds like a teenager. Half a job. Dickin around the house when you're at work. Fucking things up. Then giving you attitude about it. If you need some closure in the form of proper communication, I'd start by pointing out that immaturity. Ask him to tell you the difference between his behavior & that of a teenager. Honestly, I'm mad just reading this. I wouldn't be able to stay with him.",
      "created_utc": 1725865009.0,
      "score": 3
    },
    {
      "id": "lm8qbos",
      "body": "@OP, can you post a picture of said divorce triggering gift? I'm having a hard time picturing how this resin-lazy-susan is gonna hold actual makeup if it's made of fossilized makeup.",
      "created_utc": 1725865151.0,
      "score": 3
    },
    {
      "id": "lm8rgwe",
      "body": "Isn't resin expensive? Like $30 a litre?\n\nWould've been cheaper getting a *spinny makeup thing* from anywhere.",
      "created_utc": 1725865940.0,
      "score": 3
    },
    {
      "id": "lm8tshg",
      "body": "This reads like a “gift” Joffrey would give Sansa in GoT.",
      "created_utc": 1725867601.0,
      "score": 3
    },
    {
      "id": "lm8uouh",
      "body": "I saw the TikTok 😭😭😭",
      "created_utc": 1725868250.0,
      "score": 3
    },
    {
      "id": "lm8ymyf",
      "body": "I just saw a TikTok where a guy did this and the comments suggested doing the same with his Xbox and games",
      "created_utc": 1725871103.0,
      "score": 3
    },
    {
      "id": "lm8yq5z",
      "body": "Is this the guy on tiktok???",
      "created_utc": 1725871166.0,
      "score": 3
    },
    {
      "id": "lm937rv",
      "body": "Weird. I saw a guy do exactly this on tiktok yesterday",
      "created_utc": 1725874391.0,
      "score": 3
    },
    {
      "id": "lm97gur",
      "body": "He hates you and how you are the provider 💁🏽💁🏽💁🏽 am I reaching maybe. Weaponized incompetence, maybe. Idiot maybe. Jealously maybe. What benefit does he bring to you??",
      "created_utc": 1725877248.0,
      "score": 3
    },
    {
      "id": "lm9gj50",
      "body": "He's either a complete dolt or a sadist. \n\nUnderemployed either way.",
      "created_utc": 1725882265.0,
      "score": 3
    },
    {
      "id": "lm9j1nj",
      "body": "Yikes. It’s not sweet and I’d be so pissed. \n\nI feel like there is a lot more going on and you need to seriously reconsider this relationship or get counseling. I love that you are in a great job like nursing but you shouldn’t be the only one supporting this family. I’m sorry you are going thru this. \n\nIf there is any luxury he likes monthly or weekly, I’d take that money and go buy new makeup.",
      "created_utc": 1725883451.0,
      "score": 3
    },
    {
      "id": "lmaod81",
      "body": "Random, but I just saw a TikTok video of a guy \"surprising\" his wife with a resin makeup table, complete with a towel to hide it. Most of the cosmetics had white and pink packaging. Did he do this to make a TikTok video??!!?",
      "created_utc": 1725898679.0,
      "score": 3
    },
    {
      "id": "lmaoysu",
      "body": "Hold up… did he post the process online? Because I saw a video of someone’s husband doing exactly this and all the comments from women were about how mad the wife was gonna be 😭",
      "created_utc": 1725898893.0,
      "score": 3
    },
    {
      "id": "lmaphzk",
      "body": "Girl. You’re married to a child in so many more ways than just one. \n\nWhy are you the sole breadwinner when he’s also capable of working and there are no children? (Assuming)\n\nHow is that even attractive? You bust your ass and you’re making JUST enough. How are BOTH of you ok with that? He sounds like he has no ambition, not smart enough to think things through, and overall just not a partner that wants to help take care of his wife. \n\nWhat happens if God forbid you’re not able to work anymore? Full time pool boy? Emphasis on the “boy” \n\nSorry if this sounds harsh, this is just the most recent story I’ve seen on Reddit and IRL of women just deserving better. \n\nMy suggesting is to re-evaluate it all.",
      "created_utc": 1725899082.0,
      "score": 3
    },
    {
      "id": "lmatix9",
      "body": "So, is your husband consistently stupid, or was this an extra stupid day for him? What exactly is this scrub bringing to the table, OP, besides anger and stress?",
      "created_utc": 1725900485.0,
      "score": 3
    },
    {
      "id": "lmavldz",
      "body": "This is not sweet.\nThis was intentionally malicious. \n\nYou asked to buy something to store your makeup in so you could easily access it. He punished you by sealing all of your makeup in resin. \n\nIf thay wasn't the case, he wouldn't have told you that you could \"live without it.\" .\n\nThe fact that you're defending tf out of something indefensible and saying things like you feel bad for being upset about a \"homemade gift\" shows that this is probably an ongoing issue on some level. \n\nDon't pay for anything of his anymore. If his phone is on your plan, tell him that he gives you the money for the bill IN ADVANCE or you don't pay it. Same with car insurance or any other bills you pay for him. Also, make his ass buy his own food/gas/etc. You'll have more money to replace the makeup you want if you're not paying for a freeloading gaslighter.\n\nAlso, get the divorce.",
      "created_utc": 1725901162.0,
      "score": 3
    },
    {
      "id": "lmbb2l4",
      "body": "OP, can you upload a pic of this tomfoolery?  also vs. what you wanted to buy?",
      "created_utc": 1725906176.0,
      "score": 3
    },
    {
      "id": "lmbffjx",
      "body": "Wait is he the guy who posted a video of himself doing this on tik tok? As a fellow makeup enthusiast I was disturbed and so, so confused.",
      "created_utc": 1725907581.0,
      "score": 3
    },
    {
      "id": "lmbgc44",
      "body": "Is this fr?😭😭\ni literally just saw a tiktok ab a guy making a 'vanity table' for his wife by putting resin on her makeup\n\nI'm living for the lore rn lol",
      "created_utc": 1725907875.0,
      "score": 3
    },
    {
      "id": "lmbgihi",
      "body": ">I feel bad I’m so upset about something so materialistic\n\nIt's not \"something materialistic\". Makeup was your outlet. It was your way of destressing and  regenerating your energy. Think about it this way: if someone had done this with an artist's paint colors, would you call them materialistic for being upset over paint tubes, or would you sympathize with the fact that they can no longer express themselves through their art because their paint has been taken away? If your answer is the latter, that means that you're being too harsh on yourself and only dismissing the situation because it happened to *you*. Be kind to yourself, OP. You deserve way better than this. \n\nYou certainly deserve way better than a \"husband\" that clearly doesn't give a crap about you or the things you care about. The fact that he can't understand where you're coming from, and doesn't even seem to CARE about the fact that you're upset is so telling. This man does not give a crap about you. He only did this so he can pat himself on the back because he did something \"nice\" to you. As someone who's love language is making people small little gifts, I can tell you that this is something I would *never* do. I would *never* mess with people's shit. I always make people stuff with my *own* supplies and tools, NEVER with their own stuff. \n\nOP, your husband is not a good husband, and he's certainly not a man. He behaves like a 17 year old boy. You're out there working your ass off while he works for his dad so he \"doesn't feel bored around the house\" instead of getting a real job, and now he's taken your only outlet away and doesn't even give two flying craps about how you're feeling, let alone making it up to you. Please, please, PLEASE leave this man. You're still young. You deserve to find a man that actually loves you and cares about you.",
      "created_utc": 1725907931.0,
      "score": 3
    },
    {
      "id": "lmbkkum",
      "body": "Sorry but he knew what he was doing, u need a full on grovelling apology and money back for all the products he ruined or get rid he clearly isn’t bothered so I’d just get rid of",
      "created_utc": 1725909235.0,
      "score": 3
    },
    {
      "id": "lmbnqx2",
      "body": "Is he cognitively impaired? There's no reasonable way he could think freezing your makeup in a bowl of resin was equivalent to buying you \"a spinning thing\" for storage.",
      "created_utc": 1725910250.0,
      "score": 3
    },
    {
      "id": "lmborw6",
      "body": "he's not \"Sweet\" That was not a sweet thing to do...it was a calculated exercise in manipulation....his way of controlling what you do...he doesn't want you looking nice for work, or anything/one else ...",
      "created_utc": 1725910579.0,
      "score": 3
    },
    {
      "id": "lmbrxvm",
      "body": "Make up isn’t something a guy should fuck with… it’s part of our identity to a degree. I am a natural redhead and I have white blonde eyelashes and eyebrows. Without even the smallest amount of makeup I look very very strange. I swear down, if my husband did this to me, he would be in Tesco right now, with a list and he would be replacing EVERYTHING. And if there wasn’t money to do that, yes he’d be spending the foreseeable at his mother’s.",
      "created_utc": 1725911569.0,
      "score": 3
    },
    {
      "id": "lmburrd",
      "body": "Bare minimum he replaces what you lost. If he can't do that call it off. This could be a malicious act but even if we assume it was made with good intentions he should care about your stuff. If you broke his phone making him a phone stand wouldn't you offer to buy a new one- even a cheap one in the interim?",
      "created_utc": 1725912452.0,
      "score": 3
    },
    {
      "id": "lmbwtxe",
      "body": "He's treating your stuff as disposable because he has no real concept of value. Sounds like he went from being taken care of by his parents (the nepotism hire and the lack of aspirations to even reach full time employment, let alone promotion or **doing** anything meaningful with the gift he's been given) to being taken care of by you. \n\nYou don't have to feel bad for not catering to his ignorance, this will just prolong your suffering. The way I see it, you got two paths. Cut and run, or give him a chance to work to improve. Of course, that's based on his willingness to engage. If you find yourself doing more work than he is to solve his problems, that would speak to his lack of willingness to engage. If he's not completely checked out, **and** you decide you'd like to give him the chance, it's gonna look like couples' therapy, lots of communication, setting realistic goals, and him being active in that process.\n\nIf you decide you're done here, no one can blame you. They may try, but your bed is a privileged position, and it doesn't need to be \"bad enough\" to be worth honoring your boundaries. Your boundaries are your own, and do not answer to external pressures and inputs in the same way as something like your opinions might. Keep your head up, and fwiw I'd also be heavily debating, pros and cons list in my notebook and everything, whether this particular man is worth my sanity over.",
      "created_utc": 1725913086.0,
      "score": 3
    },
    {
      "id": "lmbxr5x",
      "body": "I think you're under reacting. \n\n\nHe is a grown man who destroyed hundreds of dollars at best, thousands of dollars at worst, worth of products. He didn't care at all about ruining a routine you enjoy before the career that sustains him. He didn't think twice about ruining the products you spent your money on. \n\n\nHe's being dismissive because he does not value your time, work, feelings, or money. He is 100% responsible for replacing everything he destroyed. Honestly, until he replaces every single one of the original products, you shouldn't be buying him anything at all. Any. Thing. At. All. And don't let him get away with replacing a high end blush with a dollar store blush for example. I also think you may as well end up destroying his expensive things and dismiss his reaction afterwards\n\n\nI have a feeling this is just the straw that broke the camel's back, so I don't blame you for wanting a divorce. I think if you're not feeling the relationship for any reason at all, you have the right to divorce no matter what anyone may say.",
      "created_utc": 1725913372.0,
      "score": 3
    },
    {
      "id": "lmcugim",
      "body": "I saw the tiktok. You need to leave him. He did it for tiktok. NTA Divorce",
      "created_utc": 1725924363.0,
      "score": 3
    },
    {
      "id": "lmeix5r",
      "body": "\"So it's more aesthetic.\" You can't use it??????? What an idiot lmao I can see why you're the breadwinner",
      "created_utc": 1725951365.0,
      "score": 3
    },
    {
      "id": "lm7v7o6",
      "body": "I’m pretty tore up right now but this made me giggle ngl",
      "created_utc": 1725848794.0,
      "score": 456
    },
    {
      "id": "lm8v6ld",
      "body": "sounds like she already has a baby",
      "created_utc": 1725868607.0,
      "score": 65
    },
    {
      "id": "lm6fifs",
      "body": "We're all in the same boat. I read the title thinking, \"I must not know all the uses of resin.\" It turns out that it just makes no sense.",
      "created_utc": 1725829703.0,
      "score": 3133
    },
    {
      "id": "lm6kar1",
      "body": "It’s like an anti-gift! He didn’t give her something, he took it away.",
      "created_utc": 1725831270.0,
      "score": 834
    },
    {
      "id": "lm6pu7c",
      "body": "Yeah I just don't get the resin, it is one of the stranger things I have read in a while. \"Oh hey you know how you like *your* makeup? I froze it in a block of resin.. so you can... look at it?\"",
      "created_utc": 1725833129.0,
      "score": 339
    },
    {
      "id": "lm7238p",
      "body": "While we’re at it, go make a spreadsheet with each product he DESTROYED with prices and the total. Print it out, and tell him it’s his invoice. I hope his eyes bulge out of his head.",
      "created_utc": 1725837476.0,
      "score": 80
    },
    {
      "id": "lm70tu1",
      "body": "This is stolen from a TikTok that came out before this post 😭",
      "created_utc": 1725837018.0,
      "score": 137
    },
    {
      "id": "lm77tj2",
      "body": "He’s seen this on TikTok I bet…I’ve seen a few of guys completely destroying all their girls expensive make up just to film her reaction for “clout”…imagine if a woman did this with all a guys car care products…",
      "created_utc": 1725839606.0,
      "score": 58
    },
    {
      "id": "lm6unu0",
      "body": "Feels like a control tactic. He doesn’t want her to wear makeup to work etc.",
      "created_utc": 1725834820.0,
      "score": 143
    },
    {
      "id": "lm7839i",
      "body": "I think he made a resin-compound clear container for her makeup...with her actual makeup inside the molded resin. So, it'd be a awesome, bespoke gift - IF he hadn't stolen all of her makeup to make the thing.\n\nI don't know, just throwing my take out there. I can understand why he might think it was a good thing, but I cannot understand how he would think that destroying her entire collection for the purpose of housing said collection makes any sense at all. Dude must be perma-drunk.\n\nThis is like someone gluing your stamp collection onto your binder for your stamps. Like melting down a coin collection to harvest the metal from it so that you can make a vault for the coin collection.\n\nI'm going back to \"drunk.\" This is too dumb even for stoner logic.",
      "created_utc": 1725839709.0,
      "score": 67
    },
    {
      "id": "lm6gh9d",
      "body": "[removed]",
      "created_utc": 1725830015.0,
      "score": 175
    },
    {
      "id": "lm7y0ab",
      "body": "Leading and burning Question of The Day: \"Is Your HUSBAND AN IDIOT?\"  \n🥲😅😅",
      "created_utc": 1725849938.0,
      "score": 15
    },
    {
      "id": "lm783x6",
      "body": "This story is so stupid I refuse to believe it's real",
      "created_utc": 1725839716.0,
      "score": 21
    },
    {
      "id": "lm7kcr9",
      "body": "His lack of common sense, lower maturity level, sub standard intelligence, on top of being somewhat lazy makes it difficult to understand what you have ever seen in him?! He needs to put in extra hours, and get another job to pay for all the makeup. Then he needs to pay for marriage counseling for you both, and therapy for him. Or just divorce him. He sounds like an exhausting child, and will probably never grow up. Take care of you OP!",
      "created_utc": 1725844492.0,
      "score": 4
    },
    {
      "id": "lm7z64v",
      "body": "Ah yes… if she has no makeup then she doesn’t need to spend any money on a spinning storage unit for said makeup! And… “look babe, I MADE you that thing you wanted, all by myself… using resin that probably cost the same as the unit you wanted to buy! Aren’t I a clever boy?”",
      "created_utc": 1725850419.0,
      "score": 6
    },
    {
      "id": "lm7opzi",
      "body": "I wanted a little spinny thing to put all my makeup on, search it up on tiktok or pinterest but I was just gonna buy one from home goods or something, so he made one but the spinny thing is all my makeup in resin.",
      "created_utc": 1725846209.0,
      "score": 19
    },
    {
      "id": "lm7gp9r",
      "body": "The only legitimate “are they stupid” I’ve ever heard here",
      "created_utc": 1725843061.0,
      "score": 3
    },
    {
      "id": "lm7xod5",
      "body": "I honestly believe this is the inbreeding of gaslighting with weaponized incompetence. He did it on purpose, plays stupid and she has to suck it up. What else is he so \"useless\" for?",
      "created_utc": 1725849801.0,
      "score": 4
    },
    {
      "id": "lm7e6xh",
      "body": "I feel way less bad about installing a floor where I didn’t notice one board was slightly chipped now.",
      "created_utc": 1725842073.0,
      "score": 3
    },
    {
      "id": "lm8rly4",
      "body": "I’m wondering also. It seems more passive aggressive than anything and I’m really sorry. There’s no way he thought he was doing you a favor by putting your makeup in resin. \n\nI think he could be mad that you’re doing better than him in life. He cleans pools and you’re a nurse. How long have you been married because I’d be so upset that he did this because it’s evidence of a bigger problem. \n\nWhen you say resin what resin do you mean? Is it resin from weed ? What kind is it?",
      "created_utc": 1725866038.0,
      "score": 3
    },
    {
      "id": "lm9fh1d",
      "body": "Wow he's really not all in there huh... \n\nEdit: I wrote this but going thru the post again, this cannot be just your whimsical bf doing stupid shit cuz he's a wittle baby. Why did he forget this pretty present he spent an afternoon on? Well he didn't probably, and destroyed the thing you love without the bat of an eye on purpose... leave this baby bird, or do him better, kick him out of the nest, and if he flies he can come back. Otherwise move on girl..",
      "created_utc": 1725881748.0,
      "score": 3
    },
    {
      "id": "lm7yywb",
      "body": "So confused if the man is stupid, or this was a ChatGPT post gone wrong.",
      "created_utc": 1725850336.0,
      "score": 165
    },
    {
      "id": "lm7jcq4",
      "body": "My only thought was he’s just stupid. These are the actions of an idiot.",
      "created_utc": 1725844099.0,
      "score": 330
    },
    {
      "id": "lm9o0ht",
      "body": "Poe’s Law for Men: a man pretending well enough to be incompetent (weaponised incompetence) can be indistinguishable from them really being incompetent 😂",
      "created_utc": 1725885642.0,
      "score": 13
    },
    {
      "id": "lm9rks3",
      "body": "No he's an insecure pos who wanted to hurt her. There's no way he would pull this with a friends things. Why? Because he knows it's effed up. He wanted to stop her looking good at work cos he's insecure and knows she's better than him.",
      "created_utc": 1725887118.0,
      "score": 7
    },
    {
      "id": "lm6apxv",
      "body": "This. What was even the point of this dumb arse shite?????",
      "created_utc": 1725828177.0,
      "score": 1142
    },
    {
      "id": "lm6cx9y",
      "body": "I'm hoping this post is fake, because it only reinforces my lack of faith in humanity.",
      "created_utc": 1725828879.0,
      "score": 293
    },
    {
      "id": "lm6hjz6",
      "body": "There's no way this guy is really that stupid, right? Pour resin on something and expect to be able to use it? He took away one of the few things she really gets to enjoy, whether that was maliciously on purpose or stupidly on accident, neither are good and he needs to go in the trash with his art project.",
      "created_utc": 1725830366.0,
      "score": 38
    },
    {
      "id": "lm6dyjh",
      "body": "He sounds immature as hell. He needs a reality check.\n\nOP, seriously contemplate whether this man is truly who you think he is.",
      "created_utc": 1725829210.0,
      "score": 40
    },
    {
      "id": "lm6aht9",
      "body": "I think he thought it was funny, which is…no some who respects anyone",
      "created_utc": 1725828107.0,
      "score": 85
    },
    {
      "id": "lm6lqmm",
      "body": "He wasn't trying to make a gift, he just wanted to ruin her makeup. She is perfectly fine with their arrangement in money making and he's insecure about it for his own selfish reasons. She does her makeup every morning before work, it doesn't take a genius to figure out that she CLEARLY enjoys and actively uses said makeup, much less a husband to figure that shit out. He's probably wound up a bunch of misconstrued insecurities from this and culminating it in the most half baked \"what explanation\" possible by both somehow managing to squirm out of giving her an actual gift and instead managing to give himself the gift of not having to worry about his \"hot wife putting on makeup for her job where she makes more money and is likely surrounded by people that measure up to her more\". Bottom line, he's insecure and that's that. Or maybe he really is just a massive idiot lmao",
      "created_utc": 1725831745.0,
      "score": 47
    },
    {
      "id": "lm6d8h8",
      "body": "I think he was trying to make the circle thing that she wanted to put her make up in. He just didn't know what it was and didn't bother to look it up. Instead, he ruined the make up and has completely failed to understand why she is upset. He has no empathy and seems focused on himself.",
      "created_utc": 1725828979.0,
      "score": 81
    },
    {
      "id": "lm6e1cy",
      "body": "I’ve seen this on tiktoc. Sweet idea but use cheap or empty makeup obviously. \n\nOP if he wont replace it I would take some of his things and ruin them in a similar way. But I’m petty.",
      "created_utc": 1725829235.0,
      "score": 40
    },
    {
      "id": "lm6f0xq",
      "body": "I’m assuming he was trying to make customs spaces for the different containers, but didn’t do anything to keep them from sticking (not to mention resin is exothermic as it cures, and probably melted something).  And that’s not even getting into the need for a loose fit so you can pull things out.",
      "created_utc": 1725829550.0,
      "score": 11
    },
    {
      "id": "lm6k97i",
      "body": "Exactly who does that? She should get a divorce way sooner than later. ",
      "created_utc": 1725831256.0,
      "score": 3
    },
    {
      "id": "lm94e8d",
      "body": "It’s 100% option b",
      "created_utc": 1725875209.0,
      "score": 67
    },
    {
      "id": "lm9euk9",
      "body": "ding ding ding",
      "created_utc": 1725881433.0,
      "score": 11
    },
    {
      "id": "lmau9rn",
      "body": "This right here - my ex used to hide my hair straightener, make up bag, and any cute clothes I felt amazing in.. He told me my ADHD was “cute” when i frantically looked for my things, as though I’d misplaced them and forgot. I thought I did, until I found my makeup bag under the driver’s seat of his car and my clothes under the sink in his man-cave bathroom. My hair straightener was thrown under the bed with the cord cut in half. Apparently, me existing when he’s not around made him insecure, so he was sabotaging any attempt I made at feeling confident and looking put together. He actually suggested I wear only oversized tshirts and sweats as that was his preference and his preference was the only one that mattered. Yes, even to work, because “who are you trying to impress?” This story sounds awfully familiar to how my situation started with him.",
      "created_utc": 1725900731.0,
      "score": 8
    },
    {
      "id": "lm68uav",
      "body": "This is the way. Make it hurt.",
      "created_utc": 1725827594.0,
      "score": 496
    },
    {
      "id": "lm6exu8",
      "body": "People like this tend to go in child mode and stay mad at you because they don’t care why you’re upset but you hurt them. \n\nShe already explained ten times and he’s pretending like he doesn’t know any better.\n\nHe doesn’t care and he actually doesn’t want to deal with it, that is what he thinks of her.",
      "created_utc": 1725829523.0,
      "score": 58
    },
    {
      "id": "lm6ctke",
      "body": "This sounds like a great parenting tip but a poor tip for managing adult relationships. Reward and punishment should not be a part of mature, equanimous partnerships (unless executed in a sexy sense). ",
      "created_utc": 1725828846.0,
      "score": 117
    },
    {
      "id": "lm6gab3",
      "body": "Lawful evil or chaotic good 🤔",
      "created_utc": 1725829953.0,
      "score": 8
    },
    {
      "id": "lm6c3gy",
      "body": "Yes!!! This 10000%",
      "created_utc": 1725828613.0,
      "score": 11
    },
    {
      "id": "lm6d1c2",
      "body": "🔥🔥🔥🔥🔥🔥🔥",
      "created_utc": 1725828915.0,
      "score": 8
    },
    {
      "id": "lm73v8y",
      "body": "[deleted]",
      "created_utc": 1725838128.0,
      "score": 136
    },
    {
      "id": "lm7vioc",
      "body": "oh my god😭😭 I’m so sorry",
      "created_utc": 1725848918.0,
      "score": 24
    },
    {
      "id": "lm6dwad",
      "body": "Just about to comment this too! Loads of pink products in it right?",
      "created_utc": 1725829190.0,
      "score": 84
    },
    {
      "id": "lm6dex9",
      "body": "I was just about to say this🤣 makeup resin table lmaooo",
      "created_utc": 1725829036.0,
      "score": 52
    },
    {
      "id": "lm98gzq",
      "body": "Coming to say the same thing... He either saw the tiktok or he made it 💀💀",
      "created_utc": 1725877877.0,
      "score": 22
    },
    {
      "id": "lm71xjg",
      "body": "I saw it too!!!! I was looking for another comment about it to make sure I wasn’t just imagining I had seen the video. All of the comments on the video were also saying that it was new makeup and expensive.",
      "created_utc": 1725837417.0,
      "score": 40
    },
    {
      "id": "lm98m8h",
      "body": "ME TOO! Wonder if it’s the same person 😭",
      "created_utc": 1725877967.0,
      "score": 7
    },
    {
      "id": "lm7poxi",
      "body": "Was it involving resin as well?",
      "created_utc": 1725846591.0,
      "score": 5
    },
    {
      "id": "lm6g64p",
      "body": "I came here to ask this.",
      "created_utc": 1725829916.0,
      "score": 32
    },
    {
      "id": "lmiebls",
      "body": "_I am_ mentally disabled (though I typically describe myself as having a neurological disability as that wording tends to feel less harsh and mitigates the depression I feel knowing my brain functions at like 50% of what it should lol), but even with all my struggles and deficits, I wouldn’t be caught dead destroying something my husband loved and/or used frequently because I wanted to try and make some weird gift that apparently originated from some odd and viral borderline rage-baiting TikTok. I’ve done some pretty stupid things over the years since recognizing consequences of certain actions is something I struggle with on a daily basis, but damn, even if my disability were to affect me more severely than it does, I think I would have to literally be in deep sleep while dreaming to not see how many things are terribly wrong with what OP’s husband did if I were to find myself in his shoes.",
      "created_utc": 1726006500.0,
      "score": 3
    },
    {
      "id": "lm6ihaf",
      "body": "Technically not destroyed, just extremely inaccessible.",
      "created_utc": 1725830674.0,
      "score": 90
    },
    {
      "id": "lm8351v",
      "body": "I just saw that too!",
      "created_utc": 1725852110.0,
      "score": 17
    },
    {
      "id": "lm6aeqp",
      "body": "Not low key, that is literally abuse. He clearly did that to be cruel to her. He took her things and ruined them, and now she is overreacting, and its dumb that he should replace what he broke.",
      "created_utc": 1725828079.0,
      "score": 271
    },
    {
      "id": "lm6kckr",
      "body": "100%. It's either to make OP small, bc she's \"powerful\" with a job, and things, and beauty, or he's as dumb as a rock.\n\nSince OP married him, I believe this is passive-aggressive behavior, feined incompetence, either conscious or unconscious behavior depending on the person.\n\nI'd expect more and more of these \"oops\" from this man. And I bet it's conscious - he knows. But...\"oopsies\" I was trying to make your day.",
      "created_utc": 1725831287.0,
      "score": 60
    },
    {
      "id": "lm6edb1",
      "body": "And she went through nursing school, is a nurse and a breadwinner. He’s an ass.",
      "created_utc": 1725829340.0,
      "score": 54
    },
    {
      "id": "lm74x1w",
      "body": "Right! WTF?! If he wanted a tool box or something to hold his tools then she did this, what would his reaction be? Would he be like \"you idiot, thats not how you make a tool box. I can't use them now.\" It's not just to look at. It was needed for functionality.",
      "created_utc": 1725838515.0,
      "score": 34
    },
    {
      "id": "lm7sj95",
      "body": "he basically got a giant Petri dish, put all my makeup flat (placed out kind of scattered out) and poured resin on it. he also put a little spinny thing on the bottom so it spins. It honestly is super cute if he didn’t just solidify all my makeup.",
      "created_utc": 1725847711.0,
      "score": 57
    },
    {
      "id": "lm9f5tv",
      "body": "I'm hoping he has a TBI.  It's the only way this is even remotely understandably.  Still not acceptable tho.",
      "created_utc": 1725881589.0,
      "score": 3
    },
    {
      "id": "lm7tlkb",
      "body": "I don’t know why but I laughed so hard at how you phrased nr 1 it’s actually so batshit it’s hilarious",
      "created_utc": 1725848138.0,
      "score": 5
    },
    {
      "id": "lm6ms1y",
      "body": "Yeah but she probably paid for it, directly or not; better to get rid of him and sell his toys to recoup some of the money she’s spent on supporting his lame ass.",
      "created_utc": 1725832090.0,
      "score": 9
    },
    {
      "id": "lm7s8j4",
      "body": "I think he’s more of a idiot honestly, although the way he isn’t apologetic at all and literally forgot about it when I brought it up to him later today has me wondering if he is controlling and doesn’t want me to acknowledge it happened anymore.",
      "created_utc": 1725847592.0,
      "score": 80
    },
    {
      "id": "lm7gq20",
      "body": "Right? It would have been cheaper and less effort to just buy the stupid spinny thing. If he isn't mad at her then he must be on drugs to think this was a good idea. I think that's what the whole thing about getting bored at home so he needed a part time job is about, he's gotta do something to stay out of trouble. An idle mind is the devil's playground or whatever, and he must be smoking a lot of devil grass to think she would like this \"present.\" I've seen meth heads do stupid stuff like this, and think it was great, with no regard for the outcome or the people who actually owned the items they were \"improving.\" He probably had to get a part-time job to keep him from re-wiring the house or blowing it up with all his hare-brained schemes.",
      "created_utc": 1725843069.0,
      "score": 3
    },
    {
      "id": "lm7h9gi",
      "body": "Yeah I'm having trouble with that part, too. Maybe it was leftover from daddy's pool business or something.",
      "created_utc": 1725843281.0,
      "score": 4
    },
    {
      "id": "lmay087",
      "body": "I don’t believe that account is the same person. I looked at it and there’s a Sephora haul of $3000. If OP had that kind of money I don’t think they’d be posting about how they can’t afford to buy all new makeup right now.",
      "created_utc": 1725901964.0,
      "score": 3
    },
    {
      "id": "lmat3v0",
      "body": "oh most of my comments are from another one of my posts that got deleted by Reddit that was when my best friend got mad that I was on her phone at her wedding😭 it’s a long story but my husband had nothing to do with that",
      "created_utc": 1725900344.0,
      "score": 3
    },
    {
      "id": "lm6gcbn",
      "body": "Wouldn’t be surprised if he got inspired by that video 💀",
      "created_utc": 1725829971.0,
      "score": 4
    },
    {
      "id": "lma8n90",
      "body": "Please don’t make babies with this man.",
      "created_utc": 1725893324.0,
      "score": 188
    },
    {
      "id": "lmat1uo",
      "body": "just a heads up, don’t have any kids with this man if he’s this dense 😭",
      "created_utc": 1725900325.0,
      "score": 59
    },
    {
      "id": "lman2mn",
      "body": "Why are you happy being the breadwinner and having your partner have a ‘just to keep busy’ job when you can barely make ends meet ?!",
      "created_utc": 1725898220.0,
      "score": 70
    },
    {
      "id": "lm8lg3a",
      "body": "Please get out of this marriage before you have to start paying this man loads of your money for his spousal support. His actions are the beginning stages of abuse by controlling your makeup and then gaslighting you for being upset.",
      "created_utc": 1725861910.0,
      "score": 161
    },
    {
      "id": "lmdkfo3",
      "body": "did he also make a video of him doing it because i saw a video of this on facebook or tik tok……",
      "created_utc": 1725933851.0,
      "score": 5
    },
    {
      "id": "lmb8xcy",
      "body": "Then he should start building the resin table.",
      "created_utc": 1725905486.0,
      "score": 5
    },
    {
      "id": "lm6hx3q",
      "body": "Right because what could he have possibly been trying to make? \n\nShe could've told us he was attempting to make soup and that would've made the same amount of sense as this lol",
      "created_utc": 1725830485.0,
      "score": 1382
    },
    {
      "id": "lm76eh4",
      "body": "Double checked to make I wasn't in like the abusive relationship sub reddit. Kept reading to try to understand if it was a joke? Or?\nI'm just so...",
      "created_utc": 1725839068.0,
      "score": 279
    },
    {
      "id": "lm7ct8y",
      "body": "OP never told us the age of her part-time pool cleaning husband. He must have just turned 18.",
      "created_utc": 1725841535.0,
      "score": 95
    },
    {
      "id": "lm9jg7u",
      "body": "I’ll be needing some sort of sketch or blueprint to figure out wtf this looks like",
      "created_utc": 1725883636.0,
      "score": 4
    },
    {
      "id": "lm6z9lf",
      "body": "Yes , this is some next level passive aggressive shit. Maybe I'm reading more into it than I should, but it sounds like he doesn't like her wearing makeup and he half assed this as a way to keep her from doing it.  There is no way he did this if he has half a brain and thought it was a good thing.  I'm seeing malicious intent with a thinly veiled stupid coverup.",
      "created_utc": 1725836460.0,
      "score": 463
    },
    {
      "id": "lm70fag",
      "body": "Interesting paper weight but that's all I got.  Seriously, this guy sounds like a numbnut.",
      "created_utc": 1725836871.0,
      "score": 85
    },
    {
      "id": "lm8vwdd",
      "body": "He gave her the gift of showing he's not worth wasting anymore time with.",
      "created_utc": 1725869128.0,
      "score": 5
    },
    {
      "id": "lm70khv",
      "body": "Her: \"I love my cat so much!\"\n\nHim the next day: \"I killed your cat and had it stuffed, so now you can have it forever!\"\n\nBoy's a keeper wtf",
      "created_utc": 1725836924.0,
      "score": 412
    },
    {
      "id": "lm72xp0",
      "body": "This is just a theory, but I used to have those clear resin cups that you would put things in like makeup brushes and q-tips and stuff. I think he was trying to make one of those and just didn't understand the assignment. \n\nI think our dude is not capable of making something to hold his two brain cells.",
      "created_utc": 1725837785.0,
      "score": 115
    },
    {
      "id": "lm7x7ya",
      "body": "I hope this is fake because if not, OP is married to a complete loser",
      "created_utc": 1725849617.0,
      "score": 43
    },
    {
      "id": "lm82uwh",
      "body": "All the comments about how abusive this is, meanwhile I also saw the TikTok. It's not that deep, people lie on the internet.",
      "created_utc": 1725851986.0,
      "score": 31
    },
    {
      "id": "lm7i7xr",
      "body": "You got a link? 👀👀👀",
      "created_utc": 1725843651.0,
      "score": 8
    },
    {
      "id": "lm9u05z",
      "body": "Or his video game system",
      "created_utc": 1725888118.0,
      "score": 7
    },
    {
      "id": "lm7hpba",
      "body": "Right. I keep reading what could be good reasons for this and I just keep coming back to his reaction when she told him she was out of one of the few things she enjoys each day...\n\nHe didn't gaf lol",
      "created_utc": 1725843454.0,
      "score": 11
    },
    {
      "id": "lm6icyc",
      "body": "I think you're being extremely generous with this thinking, but you may be onto something. \n\nIf this were the case, I don't understand his response AND his reluctance to replace her makeup. \n\nIf he was genuinely trying to make her something and it just didn't work out, I feel like he'd be apologizing and promising to work full-time to make up for it, but he didn't. 🤷🏿‍♀️",
      "created_utc": 1725830632.0,
      "score": 215
    },
    {
      "id": "lm6tths",
      "body": "It took me awhile to think this through, but I think you may be right. Doesn't mean it's ok, he should have known how this would turn out. And his response to OP being upset after she explained why is more concerning though. Just brushing her off like that. Not only is he stupid, but he lacks personal accountability and any kind of shame for what he did. I'd divorce him.",
      "created_utc": 1725834519.0,
      "score": 43
    },
    {
      "id": "lm8aoti",
      "body": "Do you have a photo of the final product of what he made vs what you wanted? I think we’re all trying to wrap our minds around what he was actually trying to accomplish and we NEED a visual!",
      "created_utc": 1725855654.0,
      "score": 37
    },
    {
      "id": "lm7otnm",
      "body": "A lazy Susan?",
      "created_utc": 1725846249.0,
      "score": 14
    },
    {
      "id": "lm88mix",
      "body": "This man is either so genuinely stupid that he is a danger to himself and others, or he is not, in which case he is abusing you. Either way, you should leave him, and he should get professional help.",
      "created_utc": 1725854608.0,
      "score": 20
    },
    {
      "id": "lm8c5uy",
      "body": "Just looked it up, and they're $20 at a store thats near me. I think i know what im going to get my girlfriend now",
      "created_utc": 1725856435.0,
      "score": 6
    },
    {
      "id": "lmbhvxd",
      "body": "He didn’t happen to make a tiktok about it? I came across your post after seeing a video of a husband doing this for his wife. Truly don’t understand why he would think this is okay… I’m so sorry",
      "created_utc": 1725908368.0,
      "score": 3
    },
    {
      "id": "lm96ga2",
      "body": "it's a lie\n\nlol there was a tiktok that went viral of a man making one of those sticky pick pads in a table for his wife with all new makeup products he bought \n\nthis person and i and many others saw it and i guess this person thought no one would know 😭",
      "created_utc": 1725876594.0,
      "score": 50
    },
    {
      "id": "lm6vmgp",
      "body": "This reminds me of those TikTok’s with men that purposely destroy their partners make up with hammers and running water over it and stuff. Shit is abusive. I think he did this on purpose. He had to know that’s not what she meant and it would ruin the makeup.",
      "created_utc": 1725835167.0,
      "score": 551
    },
    {
      "id": "lm6u1um",
      "body": "I think to destroy something she enjoys. Common control tactic, including the gaslighting afterwards.",
      "created_utc": 1725834603.0,
      "score": 178
    },
    {
      "id": "lm6g8qm",
      "body": "[removed]",
      "created_utc": 1725829939.0,
      "score": 169
    },
    {
      "id": "lm6qp7d",
      "body": "What'did he do?Is he 12 or just a lazy fool?Crazy 🤪",
      "created_utc": 1725833431.0,
      "score": 4
    },
    {
      "id": "lm6isyx",
      "body": "I think it’s fake, I saw a reel on instagram of a man taking a side table and doing something similar with make up and resin to repurpose it to a vanity for his wife and I’m 99% sure that just inspired this.",
      "created_utc": 1725830783.0,
      "score": 139
    },
    {
      "id": "lm7i7e4",
      "body": "It’s fake. How did she not notice her makeup missing the next morning if it’s all she had, and she uses it every day?",
      "created_utc": 1725843645.0,
      "score": 4
    },
    {
      "id": "lm6fl80",
      "body": "I was kinda thinking along those lines as well. Pouring resin in your wife's makeup? Divorce because of it? What is worse or/and what comes first? I need to leave Reddit.",
      "created_utc": 1725829729.0,
      "score": 28
    },
    {
      "id": "lm6nzwb",
      "body": "I saw some guy doing this on tik Tok it has to be fake",
      "created_utc": 1725832499.0,
      "score": 5
    },
    {
      "id": "lm6e9p4",
      "body": "What thing you're talking about? A makeup container? Palette?\n\nI think I get it. a makeup container that spins, isn't it? But husband doesn't understand that. He saw a picture and thought to himself that he, the genius that he is, must already know what it is : his wife's makeup in resin.",
      "created_utc": 1725829309.0,
      "score": 27
    },
    {
      "id": "lmb6xt9",
      "body": "That's super messed up. I hope you're in a better situation now",
      "created_utc": 1725904846.0,
      "score": 3
    },
    {
      "id": "lm6egfv",
      "body": "I’d be pawning his wedding band. 🤷🏻‍♀️🤷🏻‍♀️ Because clearly he has zero respect for the marriage.",
      "created_utc": 1725829368.0,
      "score": 362
    },
    {
      "id": "lm6dner",
      "body": "[deleted]",
      "created_utc": 1725829112.0,
      "score": 96
    },
    {
      "id": "lm6etbr",
      "body": "Exactly. An eye for an eye makes the whole world blind.\n\nSetting boundaries is a better technique to stick up for ones needs in this kind of situation. Another would be to try to use some different techniques to lead the other person to empathy. That's not easy. But it's more likely to lead to change than just answering a violation with a violation.",
      "created_utc": 1725829483.0,
      "score": 14
    },
    {
      "id": "lm7irl6",
      "body": "My husband does resin things as a hobby, it's slightly possible he would do something similar with my crochet hooks or something. But as soon as I said I needed those and explained it, he would absolutely apologize and get me new ones. \n\nIt's not even about the stupid destructive gift. It's about his attitude after the fact and his unwillingness to admit he fucked up big time.\n\nEdit to add: \nAlso, wtf is he doing at home?! My husband also stays home while I work . He takes care of the one year old, helps the ten year old with his homework, cooks every dinner, cleans the house, does laundry, grocery shops.... I'm not seeing OPs husband's contributions.",
      "created_utc": 1725843868.0,
      "score": 51
    },
    {
      "id": "lmalocz",
      "body": "Sweetheart..... this is exactly what your husband is doing to you, he just isn't saying the words out loud.\n\nI'd be willing to bet money that if you thought about it for a bit and were really, truly honest with yourself, you'd start seeing a lot more red flags in his behaviour than just what you've described here. And what you've described here and in the comments is already really bad 😕",
      "created_utc": 1725897721.0,
      "score": 26
    },
    {
      "id": "lm6h6df",
      "body": "Yessss",
      "created_utc": 1725830242.0,
      "score": 25
    },
    {
      "id": "lm7ziru",
      "body": "Yes it used resin",
      "created_utc": 1725850565.0,
      "score": 7
    },
    {
      "id": "lm6gmni",
      "body": "Could also explain why she has to be the breadwinner and he is limited to help his father *part time*. What a catch. Gals must be lining up for this one 😂",
      "created_utc": 1725830063.0,
      "score": 56
    },
    {
      "id": "lm6kwgz",
      "body": "Resin heats as it cures, so some of her products could easily be destroyed. Depending on its type and thickness, resin heats to a range of 50°C/122°F to 150°C/302°F.",
      "created_utc": 1725831469.0,
      "score": 118
    },
    {
      "id": "lm6oias",
      "body": "“Extremely inaccessible” - bwah ha ha",
      "created_utc": 1725832672.0,
      "score": 54
    },
    {
      "id": "lm8bp6s",
      "body": "Link please!",
      "created_utc": 1725856189.0,
      "score": 13
    },
    {
      "id": "lm7tbsz",
      "body": "Makeup is commonly the first thing that abusive men start controlling you over, they start telling you \"youre wearing too much makeup.\" Then it graduates to controlling your clothing. This post is kind of giving me early warning signs of abuse coming",
      "created_utc": 1725848029.0,
      "score": 43
    },
    {
      "id": "lm74zso",
      "body": "And him acting like nothing happened instead of being remorseful is ANOTHER sign of abuse. OP doesn’t realize she’s enabling this asshole through life. I bet she does all the cooking/cleaning too, even though her husband doesn’t have a full time job. $10 says there was dirty dishes in the sink or laundry to do as he’s doing his resin project. \n\nOP, you’re young. Is this really how you want to live the rest of your life?",
      "created_utc": 1725838544.0,
      "score": 81
    },
    {
      "id": "lm7q4ay",
      "body": "My exhb did this kind of stuff when I landed a higher paying job than what he had. It’s wild how common it is. :/",
      "created_utc": 1725846758.0,
      "score": 5
    },
    {
      "id": "lm6nj5b",
      "body": "Ugh I swear this is a thing with nurses, like I know more than one who’s dating/raising a completely useless grown man who’s unemployed and spends most of their time smoking weed. It’s weird because it’s a well respected career that pays well and require an education and yet so many of them choose to date society’s dregs.",
      "created_utc": 1725832343.0,
      "score": 16
    },
    {
      "id": "lm7brxz",
      "body": "I actually think this is a fantastic idea!",
      "created_utc": 1725841133.0,
      "score": 3
    },
    {
      "id": "lm7ysa5",
      "body": "Can you post a pic?",
      "created_utc": 1725850258.0,
      "score": 37
    },
    {
      "id": "lm8arvq",
      "body": "Bro almost had it. Dollar store make up for arts & crafts my dude.\n\nHe clearly doesn’t understand how expensive good quality make up is, so maybe you take him shopping to replace it all and he’s paying. He miiight get it then 🤷🏻‍♀️",
      "created_utc": 1725855700.0,
      "score": 52
    },
    {
      "id": "lma8zrr",
      "body": "He posted a video to tictok of him doing it, from what i remember it had gold (what I think were YSL) lipsticks in it a baby pink compact and some other bits. He dumped it out of a purple makeup bag and took no care at all.",
      "created_utc": 1725893440.0,
      "score": 14
    },
    {
      "id": "lm9j0wb",
      "body": "Is he mentally challenged?? I'd be livid if someone ever did that to my makeup.",
      "created_utc": 1725883441.0,
      "score": 14
    },
    {
      "id": "lm7t557",
      "body": "Ok his logic makes a littleeeee more sense now. He hears you want a spinny thing for your makeup, he made a spinny thing for your makeup…yet it’s still a little troubling he thought this was a good idea / was what you meant",
      "created_utc": 1725847955.0,
      "score": 38
    },
    {
      "id": "lm8etdv",
      "body": "are the makeup boxes / containers closed or open? if they are closed, you can try smashing the fuck out of the resin to retrieve them",
      "created_utc": 1725857888.0,
      "score": 20
    },
    {
      "id": "lm808ln",
      "body": "Find the silver lining? Make him run an Etsy making these for women in the off season (assuming you live where it’s an off season) It does sound cute but yeah I don’t know how you can forgive it, like IMO it destroys a sense of safety. Is he willing to do anything to replace it at his own expense? Would he sell plasma? \n\nIf it’s just this one issue maybe it’s not so awful. I’m mad for you though. \n\nDoes he have PTSD or TBI or another issue? My spouse would do things that made zero sense and I always thought it was the TBI.",
      "created_utc": 1725850859.0,
      "score": 10
    },
    {
      "id": "lm9hh93",
      "body": "Surely someone so handy and creative has a chisel and hammer he can put to good us to try to salvage your makeup.",
      "created_utc": 1725882725.0,
      "score": 5
    },
    {
      "id": "lma3ma5",
      "body": "Is he going to buy you all new makeup?",
      "created_utc": 1725891598.0,
      "score": 5
    },
    {
      "id": "lm7tr6g",
      "body": "100% he is controlling and doing this on purpose!!! \n\nHe is resentful if you, OP. He's ruining the one thing that gives you joy, and he's gaslighting you that it was a \"mistake\".\n\nThere is NO normal, functional adult human being who would FORGET that him resin-ing your makeup would mean that you could not use that makeup. If he doesn't have a brain injury, THEN THIS WAS DONE ON PURPOSE\n\nagain, for those in the back\n\nTHIS WAS DONE ON PURPOSE",
      "created_utc": 1725848201.0,
      "score": 89
    },
    {
      "id": "lm7vad1",
      "body": "He's either passive aggressive because you're the breadwinner, or he's a moron.  Either way, do you want to be with someone this thoughtless?\n\n\nIt's not sweet.  His reaction isn't sweet.  He has no empathy, or understanding for what he cost you.  This will be the rest of your life.",
      "created_utc": 1725848824.0,
      "score": 39
    },
    {
      "id": "lm9kxrc",
      "body": "He’s controlling and he’s using weaponized incompetence to gaslight you. He doesn’t care.",
      "created_utc": 1725884307.0,
      "score": 10
    },
    {
      "id": "lmakhxf",
      "body": "I've done really dumb things. I'm always wracked with guilt and apologetic... Stupid mistakes are okay (once the sting has faded) not caring is not okay.",
      "created_utc": 1725897303.0,
      "score": 8
    },
    {
      "id": "lmaw846",
      "body": "He was using your things for content. He posted it on tik tok. I posted the video to diwhy if you were unaware of it.. I’m really sorry",
      "created_utc": 1725901373.0,
      "score": 7
    },
    {
      "id": "lmau5rl",
      "body": "Hi! So I mean the ones from my ‘boyfriend proposed’ if it a different man then I do apologise! But if its the same i think people have previous made you aware of the red flags by the looks 😞",
      "created_utc": 1725900694.0,
      "score": 3
    },
    {
      "id": "lmfd0og",
      "body": "No need, he IS the baby. Can't imagine this is the first time he's done something completely mindless like this.",
      "created_utc": 1725970378.0,
      "score": 15
    },
    {
      "id": "lmcdorj",
      "body": "Either that or he’s a complete idiot. Neither is a good candidate for husband.",
      "created_utc": 1725918422.0,
      "score": 15
    },
    {
      "id": "lmdzasu",
      "body": "Listen to this!",
      "created_utc": 1725939995.0,
      "score": 3
    },
    {
      "id": "lm75dvo",
      "body": "I'm convinced he just saw resin on TikTok and thought, \"Yeah, this is definitely how gifts work.\" Logic? Thrown out the window like her makeup.",
      "created_utc": 1725838689.0,
      "score": 515
    },
    {
      "id": "lmbh20c",
      "body": "My guess is that he thought it was \"cute\" to preserve all her makeup supplies in the tray since it's a tray to store makeup.\n\nBut then again, how is she to store her makeup in the tray intended for makeup storage if she no longer *has* any makeup?",
      "created_utc": 1725908103.0,
      "score": 5
    },
    {
      "id": "lm792xt",
      "body": "We could be in that sub. Hubs took her property and ruined it. Maybe he doesn’t want her wearing makeup, maybe he wanted to destroy something she likes.",
      "created_utc": 1725840092.0,
      "score": 211
    },
    {
      "id": "lm9bpoj",
      "body": "He didn’t even offer to replace it. And he scoffed when she suggested he save to replace what he ruined. He destroyed it intentionally under the guise of making her a gift. Asshole move.",
      "created_utc": 1725879778.0,
      "score": 8
    },
    {
      "id": "lm7dxd6",
      "body": "My guess is he's at least ten years older.",
      "created_utc": 1725841968.0,
      "score": 81
    },
    {
      "id": "lm80r20",
      "body": "This would be the only explanation. I keep trying to understand how OP (smart, breadwinner, late 20s) could be married to an adult man who… does something this absolutely idiotic in *earnest*. \n\nLike is it was her little child brother I’d be like “aw he’s just dumb and little.” But it’s her adult husband. I honestly feel like regardless of whether a mistaken gift or intentional destruction, divorce. \n\nWhat’s next OP says she’s cold so he sets the house on fire?",
      "created_utc": 1725851074.0,
      "score": 48
    },
    {
      "id": "lm7pm75",
      "body": "That’s how it scans to me, like “how can she be angry it’s a gift, why isn’t she happy?”  What a crock.  This was a spiteful move on his part, his ignorance seems false.   Or, he is seriously dumb.  I suspect spitefulness.",
      "created_utc": 1725846561.0,
      "score": 81
    },
    {
      "id": "lm86ma3",
      "body": "“Cover up.”  I see what you did there… 😘",
      "created_utc": 1725853651.0,
      "score": 4
    },
    {
      "id": "lm7349c",
      "body": "The way this rings so true.",
      "created_utc": 1725837852.0,
      "score": 79
    },
    {
      "id": "lm9imjn",
      "body": "Lmao I think this was his logic🤦🏻‍♀️",
      "created_utc": 1725883258.0,
      "score": 3
    },
    {
      "id": "lm7dbga",
      "body": "Which explains why a grown man works part time, for his father, cleaning pools.  She obviously didn't marry him for his brains",
      "created_utc": 1725841731.0,
      "score": 80
    },
    {
      "id": "lm76sjf",
      "body": "That's a very charitable interpretation. Mine is that she wants to spend money for something for herself, so he's going to make the things she needs it for worthless. What are the chances OP buys her make up spinner now?",
      "created_utc": 1725839213.0,
      "score": 70
    },
    {
      "id": "lm76rrr",
      "body": "Somehow absent of any logic- this is the only logical thing that doesn't conclude him being a giant asshole though,  right?",
      "created_utc": 1725839205.0,
      "score": 32
    },
    {
      "id": "lm85oc8",
      "body": "On top of the fact that the TikTok is satire lmfao 😭😭😭😭",
      "created_utc": 1725853221.0,
      "score": 22
    },
    {
      "id": "lm7o0s1",
      "body": "This whole post is just a way to drive more traffic to the TikTok I'm sure",
      "created_utc": 1725845938.0,
      "score": 31
    },
    {
      "id": "lm6t4o6",
      "body": "Oh I completely agree with you lol once I read the aftermath I was like “uh, this guy needs to grow up. And buy her new makeup” shit isn’t cheap.",
      "created_utc": 1725834276.0,
      "score": 53
    },
    {
      "id": "lm7406j",
      "body": "I think it's possible they're correct that this was a painfully failed attempt at making a makeup holder, and it sounds stupid enough to track.\n\nMaybe the reason he didn't apologize is because they're a complete asshat in addition to being a total moron. The promising to work, considering this mental giants career history, seems unlikely regardless of whether he thought he did a dumb.",
      "created_utc": 1725838178.0,
      "score": 33
    },
    {
      "id": "lm6y3m4",
      "body": "Okay, I just have to say that we are on the exact same page. You put my exact thoughts into words. I didn’t even finish the post before I was like: “Nope. Leave him.”",
      "created_utc": 1725836044.0,
      "score": 7
    },
    {
      "id": "lmbc2en",
      "body": "I'm desperate for a visual. I think I know what she's trying to describe but still, would love to see.\n\nAlso, her husband is not only an asshole, but also kinda dumb.",
      "created_utc": 1725906493.0,
      "score": 3
    },
    {
      "id": "lm8bwum",
      "body": "They typically have shelfs and holders but yeah",
      "created_utc": 1725856301.0,
      "score": 7
    },
    {
      "id": "lmmweiw",
      "body": "The bottles on the video literally say “epoxy resin” it’s not a picky pad but doesn’t mean OP didn’t make up the story",
      "created_utc": 1726075966.0,
      "score": 5
    },
    {
      "id": "lmaypan",
      "body": "Can you prove that op isnt that guys wife?",
      "created_utc": 1725902194.0,
      "score": 9
    },
    {
      "id": "lm7mj9q",
      "body": "I’m not on tiktok and refuse to download it, but why??? Like bro that shit can be expensive! Do these guys do this because “making my partner angy is so funny teehee” (which imo is immature af and borderline abusive) and who is watching this shit?",
      "created_utc": 1725845347.0,
      "score": 65
    },
    {
      "id": "lm70jv8",
      "body": "Either it's intentional destruction or the boy-man is HAF.",
      "created_utc": 1725836918.0,
      "score": 66
    },
    {
      "id": "lm8jcrk",
      "body": "Yup, reminds me of those videos of women telling how they finally figured out their husband is their biggest hater.",
      "created_utc": 1725860595.0,
      "score": 4
    },
    {
      "id": "lm7r86u",
      "body": "I just watched a TikTok of this exact situation!",
      "created_utc": 1725847194.0,
      "score": 6
    },
    {
      "id": "lm6qjtz",
      "body": "I was thinking this also, but would that not mean you should be able to remove the makeup from the resin? Like it shouldn’t be stuck in the resin if the whole point is to use this resin creation to hold the makeup.",
      "created_utc": 1725833379.0,
      "score": 73
    },
    {
      "id": "lm6m7fc",
      "body": "This was the only way I could rationalize the vagueness going on here too 🥲",
      "created_utc": 1725831900.0,
      "score": 69
    },
    {
      "id": "lm6k75y",
      "body": "I agree. He covered it with a towel? It wouldn’t be near dry yet.",
      "created_utc": 1725831238.0,
      "score": 30
    },
    {
      "id": "lm6kq4o",
      "body": "I literally just saw it on TikTok",
      "created_utc": 1725831412.0,
      "score": 56
    },
    {
      "id": "lm6ol8t",
      "body": "I'm confused by the timeline. I've worked a bunch with resin and even the fastest drying stuff is 24 hours to cast. If he did it that day and then covered it with a towel it would be sticky af. Maybe I'm missing something in the wording.",
      "created_utc": 1725832700.0,
      "score": 40
    },
    {
      "id": "lm6k9rr",
      "body": "To be honest if her husband doesn’t have the mental capacity to know what she was talking about for her make up, wtf is he going to come up with if he decides to take it upon himself to diy something for a child? Would ‘I want to get a new crib’ == ‘encase child in resin’?  I’d worry about how that man’s brain works.",
      "created_utc": 1725831261.0,
      "score": 44
    },
    {
      "id": "lm72w9k",
      "body": "Divorce, I think she's contemplating it bot because of this one incident but this has to build up over the years from resentments here and there and it seemed that this was the straw?\n\nAlso I think it wasn't really his stupidity in 'gifting' her that's causing this, it was his attitude from the disaster. The lackadaisical of it all. He just didn't care.",
      "created_utc": 1725837771.0,
      "score": 6
    },
    {
      "id": "lm6fxyn",
      "body": "OP wanted a rotating make-up container so she could spin it and see the different stuff she has and find it easily to hand rather than rummaging in a bag for it. Her lazy bf half-assed making a circular rotating one for her by forgoing checking what it actually was, and just making a resin circle. He poured the resin over her make-up - destroying it all - and has no idea why she is upset.",
      "created_utc": 1725829843.0,
      "score": 38
    },
    {
      "id": "lm6fzvz",
      "body": "Like a circular see-through container to hold makeup. No idea why he thought he was making that though",
      "created_utc": 1725829860.0,
      "score": 13
    },
    {
      "id": "lm6fyco",
      "body": "I'm guessing OP meant one of those clear rotating makeup containers.",
      "created_utc": 1725829846.0,
      "score": 11
    },
    {
      "id": "lm6m1bp",
      "body": "I'd be embarrassed to be married to someone this dumb.",
      "created_utc": 1725831844.0,
      "score": 9
    },
    {
      "id": "lm6ik5r",
      "body": "I was just going to say, make him give you his wedding ring, then go pawn that to get new makeup. \n\nThen go file for divorce, because he can't even pull his weight in the relationship.",
      "created_utc": 1725830701.0,
      "score": 150
    },
    {
      "id": "lm6pt3t",
      "body": "He would definitely use that as an excuse to cheat, let’s be honest.",
      "created_utc": 1725833119.0,
      "score": 35
    },
    {
      "id": "lm6eig0",
      "body": "Lol very fair! That was kinda what I was getting at - if your relationship has devolved to this point, it is time for the relationship to end or for the couple to take a serious look at the foundations of the relationship. Resorting to the type of behavior is indicative of much deeper problems than the conflict at hand. ",
      "created_utc": 1725829385.0,
      "score": 21
    },
    {
      "id": "lm6fi8f",
      "body": "Yes, boundary setting is definitely the healthy way to handle this. And if SO is not responsive to boundary setting or genuinely willing to work on improving his respect for boundaries, that is not something OP can fix and it is time to extricate herself from the situation. ",
      "created_utc": 1725829702.0,
      "score": 9
    },
    {
      "id": "lm9mglh",
      "body": "I’m willing to bet your husband wouldn’t use hooks you actively use..  His brain would say “wait, she actively uses these, probably shouldn’t use her favorite hooks.  Let me go buy cheap ones to use.”",
      "created_utc": 1725884979.0,
      "score": 9
    },
    {
      "id": "lm81os8",
      "body": "Ah yeah, I’d be skeptical of this post then",
      "created_utc": 1725851475.0,
      "score": 27
    },
    {
      "id": "lm9tyl9",
      "body": "I can’t find it anywhere now! It was the first video I saw when I went into the app and now I’ve tried searching every possible title to find it & I can’t!! I will keep trying lol",
      "created_utc": 1725888099.0,
      "score": 9
    },
    {
      "id": "lm7xiq6",
      "body": "Yes, it's wild they can't link their BEHAVIOR with their EMOTION. No self-awareness.",
      "created_utc": 1725849739.0,
      "score": 4
    },
    {
      "id": "lm7ek03",
      "body": "Yep that was my mom. My dad dressed like a teenager in jorts and Adidas everyday as a grown man. Played video games, smoked weed, popped pills, used to drive around with my sister and I while drunk. He was also mentally abusive to us and would punch the walls when angry. I left home at 16 and lived my remaining teenage years with friends to finish high school before my first semester of college. I told my mom if she tried any legal action to get me back, I'd have to do the same to her and let the state know that she was living with a drug addict. I'm positive she was providing some of the drugs to him from her job!! \n\nAnyway she would always talk shit about other nurses she worked with and their screwed up relationships but could never see her own. Happy to say they're divorced now, but not soon enough to make me respect my mother. Also HE left her, she'd still be in that mess. Sorry to trauma dump. Long story short, the tendency of nurses dating shitty spouses is definitely a thing.",
      "created_utc": 1725842217.0,
      "score": 13
    },
    {
      "id": "lmd1wuq",
      "body": "I saw this TikTok. And came running back to this post wondering if anyone else saw it lol",
      "created_utc": 1725927071.0,
      "score": 4
    },
    {
      "id": "lmaxv9k",
      "body": "“Weaponized incompetence” \nNever heard my ex described so well",
      "created_utc": 1725901919.0,
      "score": 5
    },
    {
      "id": "lmcwvp3",
      "body": "Hanlon's Razor:  Husband edition",
      "created_utc": 1725925244.0,
      "score": 4
    },
    {
      "id": "lm774t5",
      "body": "Nah, he was just straight up destroying her belongings. The point that was never to be a gift, it was to hurt her and then hide behind the guise of it being an attempted gift",
      "created_utc": 1725839342.0,
      "score": 933
    },
    {
      "id": "lm7h5xx",
      "body": "That's what I think too. My dad LOVED insulting things my mom loved until he instilled a sense of shame in her. He also loved throwing tantrums on holidays and birthdays.",
      "created_utc": 1725843243.0,
      "score": 149
    },
    {
      "id": "lm7jl9l",
      "body": "Okay got it that is exactly what he did he doesn't want her wearing makeup to work so he took and destroyed all of her makeup. I would be looking at him with the side eye is he jealous because you actually have a career and he's just a pool boy",
      "created_utc": 1725844192.0,
      "score": 76
    },
    {
      "id": "lm803up",
      "body": "Maybe he realizes he’s a loser and wants to sabotage her “keys” to finding a proper mate who isn’t a part time pool boy. Good grief. Nobody is <this stupid>\nI wish I could see a picture and find out if it’s blasphemy",
      "created_utc": 1725850804.0,
      "score": 47
    },
    {
      "id": "lm7e4ru",
      "body": "He reminds me of Pheobe's younger brother in Friends. He likes melting plastics.",
      "created_utc": 1725842049.0,
      "score": 29
    },
    {
      "id": "lm9rfqw",
      "body": "Bar a serious learning disability this guy was trying to hurt her.",
      "created_utc": 1725887060.0,
      "score": 4
    },
    {
      "id": "lm7wmqz",
      "body": ".... his ambition, his money, his empathy, thoughtfulness ....\n\n\n\nNo idea why anyone would marry this man",
      "created_utc": 1725849373.0,
      "score": 41
    },
    {
      "id": "lm7pmd0",
      "body": "I wonder how much money he spent on resin and whatever other materials he needed as compared to what it would've cost for a makeup turntable",
      "created_utc": 1725846563.0,
      "score": 44
    },
    {
      "id": "lm82g36",
      "body": "I hate to say it, but at least half the things most men do I have to ask myself whether they're an asshole or an idiot.  There's usually no other answer for their behavior.",
      "created_utc": 1725851803.0,
      "score": 6
    },
    {
      "id": "lmafcd4",
      "body": "They do it as a ‘joke’ none of them realize how expensive it all is and get made when they’re like it’s gonna cost me 1200 to replace all this and it’s going on your card.",
      "created_utc": 1725895554.0,
      "score": 5
    },
    {
      "id": "lm8wky7",
      "body": "Haf?",
      "created_utc": 1725869617.0,
      "score": 6
    },
    {
      "id": "lmbp82p",
      "body": "For real. Those men who do that are scary. A psychologist told me once that men will often damage or destroy your possessions as a precursor to hurting you.",
      "created_utc": 1725910722.0,
      "score": 3
    },
    {
      "id": "lm6t7qx",
      "body": "Honestly I just think he’s an idiot that didn’t think it through",
      "created_utc": 1725834306.0,
      "score": 53
    },
    {
      "id": "lm6sn9j",
      "body": "I was thinking this makes sense but I reckon its more of a dish with make up inclusions?!",
      "created_utc": 1725834107.0,
      "score": 12
    },
    {
      "id": "lm912nf",
      "body": "Neither here nor there but UV resin cures in like 10 minutes. I use it.",
      "created_utc": 1725872860.0,
      "score": 6
    },
    {
      "id": "lm6xkt3",
      "body": "😅😅\n\nHe really sounds limited.\n\nNo wonder the only job he can do is part time, under the watchful eye of daddy.\n\nYou really hitched your wagon to a star there, OP. 🤣🤣🤣",
      "created_utc": 1725835857.0,
      "score": 10
    },
    {
      "id": "lm6o8v6",
      "body": "I’m still very confused why resin was poured *on* the makeup. This still makes no sense to me. I feel like OP needs to post a picture, assuming this is real.",
      "created_utc": 1725832584.0,
      "score": 36
    },
    {
      "id": "lm6u84j",
      "body": "And?!? 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️\n\nBecause this dude who works part time at his Dad’s pool company and contributes nothing to their home is such a catch?!?! Ooooookkkkkkkkkk\n\n🤔🤔🤔🤔\n\nYea no.\n\nMakes the divorce that much easier to swallow. OP’s husband is either the walking defininition of idiot or a walking 🚩!",
      "created_utc": 1725834665.0,
      "score": 69
    },
    {
      "id": "lm6v31y",
      "body": "With someone like this it's worth to let him cheat and prepare for a divorce. At least now OP has a brand new makeup from the money from the ring",
      "created_utc": 1725834972.0,
      "score": 13
    },
    {
      "id": "lm7gmez",
      "body": "Correction: he destroyed something she enjoyed doing. That's an important distinction. Abusers love destroying things their victims love/enjoy.",
      "created_utc": 1725843029.0,
      "score": 875
    },
    {
      "id": "lm7s6um",
      "body": "She earns all the money that pays for all the bills including and most likely not limited to any extra expenses spent on things her husband wants so to him ruining her makeup wasn't a big deal because he's not the one who had to work for it. Like a freaking child who thinks that a credit card means you have unending money. How damn selfish of him.",
      "created_utc": 1725847573.0,
      "score": 208
    },
    {
      "id": "lm7nb2b",
      "body": "Exactly! Makes me wonder if he resents her for making more money than him and decided to take it out on her with his little passive aggressive so-called gift.",
      "created_utc": 1725845656.0,
      "score": 190
    },
    {
      "id": "lm81olf",
      "body": "Exactly. He was destroying her makeup.",
      "created_utc": 1725851472.0,
      "score": 25
    },
    {
      "id": "lm7ez0b",
      "body": "Coming from a different perspective here: My husband made me a gift with resin for our wedding anniversary. He saw an art project out of it on TikTok and wanted to do the same. He smashed a bottle of our wedding champagne and resin’d the pieces onto a board to frame it in our house. So maybe OP’s husband was trying to make a gift afterall.\n\nBut seriously… I think OP’s husband is an idiot.",
      "created_utc": 1725842381.0,
      "score": 181
    },
    {
      "id": "lmbolj4",
      "body": "[deleted]",
      "created_utc": 1725910522.0,
      "score": 3
    },
    {
      "id": "lm7orfq",
      "body": "I had one of those dads too. Sending you a knowing hug 🤗",
      "created_utc": 1725846225.0,
      "score": 58
    },
    {
      "id": "lm8k45w",
      "body": "Throwing tantrums on special occasions… wow you just opened my eyes to more of my father’s weird behavior.",
      "created_utc": 1725861064.0,
      "score": 34
    },
    {
      "id": "lm9er8f",
      "body": "OMG this is my dad.  He'd be throwing a hissy fit about whatever ruffled his feathers - the wind blew wrong or something, and then people would arrive at our house, or we would arrive at our destination and suddenly he's Mr friendly and Mr happy face.  The change was so fast I got whiplash. So fucking two faced, it was disgusting.",
      "created_utc": 1725881387.0,
      "score": 6
    },
    {
      "id": "lmaj4zi",
      "body": "Yes this is so toxic and insiduous. Its emotionally holding your while family hostage basically",
      "created_utc": 1725896834.0,
      "score": 3
    },
    {
      "id": "lm7vn11",
      "body": "This was my first thought!! She is wearing it to work as a NURSE. She is surrounded by intelligent, well-paid men.",
      "created_utc": 1725848968.0,
      "score": 69
    },
    {
      "id": "lm8zo0n",
      "body": "That’s the conclusion I’ve met also.",
      "created_utc": 1725871848.0,
      "score": 3
    },
    {
      "id": "lm7lafc",
      "body": "I’d love to see it, if she does post it",
      "created_utc": 1725844856.0,
      "score": 7
    },
    {
      "id": "lm7yubx",
      "body": "Further, something that abusers see as \"you are doing this for the benefit of others.\" \n\n\n\nWhy do you need to look nice when you have me?",
      "created_utc": 1725850282.0,
      "score": 314
    },
    {
      "id": "lm7j7y3",
      "body": "Couldn't agree more",
      "created_utc": 1725844046.0,
      "score": 72
    },
    {
      "id": "lm8qo6e",
      "body": "Well she’s working a lot, *someone* has to stay at home and cover shit in resin.",
      "created_utc": 1725865387.0,
      "score": 121
    },
    {
      "id": "lm9i93f",
      "body": "Okay but some dumbass adults also think credit card money is unending and free! People are just eurgh.",
      "created_utc": 1725883086.0,
      "score": 6
    },
    {
      "id": "lm8yr28",
      "body": "I wonder if she has done something to change herself recently, like lost a little weight or started a new workout routine, etc. and it makes him more insecure.",
      "created_utc": 1725871184.0,
      "score": 37
    },
    {
      "id": "lm81ujw",
      "body": "Of course he does.  Losers blame everyone else for their failures. It's never them. He thinks she'll put up with anything, and she does.  She'll probably suck his D later too. Pathetic.",
      "created_utc": 1725851543.0,
      "score": 38
    },
    {
      "id": "lm7j2kv",
      "body": "His reaction to her being upset is proof enough that it was never intended as a genuinely misguided gift. If he really was trying to make a gift, he would be apologetic that he destroyed her makeup and offer to replace it",
      "created_utc": 1725843988.0,
      "score": 268
    },
    {
      "id": "lm81wlv",
      "body": "No he wasn't.",
      "created_utc": 1725851568.0,
      "score": 10
    },
    {
      "id": "lmcn80n",
      "body": "Exactly",
      "created_utc": 1725921729.0,
      "score": 3
    },
    {
      "id": "lm8dw3t",
      "body": "Samesies",
      "created_utc": 1725857372.0,
      "score": 8
    },
    {
      "id": "lm987o6",
      "body": "This is my mother 1,000%",
      "created_utc": 1725877719.0,
      "score": 8
    },
    {
      "id": "lm80zlo",
      "body": "Yeah that part because that BS that he tried to tell her I would have never believed that what he did was done with malicious intent. He has to watch her enjoy putting on her makeup and she's probably really good at it and he's jealous that she might run into somebody who makes a whole lot more money than he do.",
      "created_utc": 1725851175.0,
      "score": 40
    },
    {
      "id": "lm8b1iw",
      "body": "My bestie has one of those type hubbies. He as effectively destroyed our 40 yr old friendship because he can’t stand to “share” her with anyone else. He’s insecure, a dry drunk and he’s insecure. Did I mention he was insecure. Little by very little, over 20 something yrs of marriage, he robbed her of things she loved and enjoyed and I was one of them. Sad!!",
      "created_utc": 1725855840.0,
      "score": 193
    },
    {
      "id": "lmd1l05",
      "body": "Omg! I felt this to my core!! My narcissistic abusive ex-husband would say this to me all the time! Any time I even showered more than normal, it was \"who are you trying to impress?\"",
      "created_utc": 1725926954.0,
      "score": 3
    },
    {
      "id": "lm9kmh1",
      "body": "OK i actually laughed out loud  at that\n\nWe all need a Requisite Resiner hard at work at home",
      "created_utc": 1725884169.0,
      "score": 35
    },
    {
      "id": "lm9lrt6",
      "body": "She's new in her job. She got a job, not run by dad, that is full time, and pays enough to live. Un.acc.ep.ta.ble.",
      "created_utc": 1725884676.0,
      "score": 57
    },
    {
      "id": "lm7ri71",
      "body": "He couldn’t afford to replace her makeup, hes pathetic and doesn’t have a real job. There’s no way he genuinely thought this was a great idea as a gift. This was pure malice",
      "created_utc": 1725847304.0,
      "score": 163
    },
    {
      "id": "lm8180k",
      "body": "She will!",
      "created_utc": 1725851275.0,
      "score": 15
    },
    {
      "id": "lmb4p22",
      "body": "I refuse to let my bestie's (soon to be ex) husband destroy our friendship. He hates me because I will always stand up to him and I have her back no matter what. He is a selfish, insecure, man child that acts entitled to the royalty treatment. He is always trying to find something to be mad about, accusing her of anything he can think, and always making everything about him! Ugh!!! He was even pissed off that I celebrated her birthday( got her a small cake, balloons, wine, sang with her kids) with her and we stayed up almost all night (he works nights). He had the audacity to message me the following morning complaining!! Whatever dude, it was her birthday!! Get over it.",
      "created_utc": 1725904129.0,
      "score": 32
    },
    {
      "id": "lmb7vy9",
      "body": "Dry drunks and destroying interpersonal relationships. Name a better combo.",
      "created_utc": 1725905151.0,
      "score": 11
    },
    {
      "id": "lm9ljmk",
      "body": "My shitty dad was a dry drunk too!",
      "created_utc": 1725884577.0,
      "score": 13
    },
    {
      "id": "lmcmskp",
      "body": "Yea my daughter’s bf is like that he gets mad anytime she goes with me anywhere cause she’s not sitting at home or if she comes to my house for the day he’s pissed it’s like cause he and his parents have no relationship she’s just supposed to cut me off. Well guess what you little punk I’m her mama I’m not going anywhere",
      "created_utc": 1725921571.0,
      "score": 5
    },
    {
      "id": "lm80kna",
      "body": "100% spot on!!!!",
      "created_utc": 1725851001.0,
      "score": 31
    },
    {
      "id": "lmb0b52",
      "body": "This so perftly describes my ex!  He was such an a**.",
      "created_utc": 1725902715.0,
      "score": 8
    }
  ]
}