{
  "id": "1jy2xx4",
  "title": "I never thought I'd become a sex worker at 35, but here I am",
  "selftext": "Now I’m 35, divorced, and a mom to a little girl who means everything to me. If you'd asked me a few years ago if I could ever see myself doing sex work, I would've laughed and said, \"not in a million years.\" \n\nA few years ago, I had a steady job, a marriage that I thought was solid, and a pretty normal life. Then it all fell apart… first my marriage, then the financial security in the mess of post-COVID restructuring. I tried to hold it together. I really did, but it wasn’t enough. I was exhausted, stressed, and falling behind.\n\nOne night I was scrolling and came across a post about paid companionship. It was someone talking openly about how they got into escorting. It didn’t sound glamorous, but it didn’t sound like the horror stories either. It just sounded... doable?\nI started researching forums and blogs. I lurked for weeks. Then I made a burner email. A fake name and a profile on one of the “safe” sites people recommended. I got flooded with messages. Most of them were disgusting. Some were sad. But one stood out. He was older, polite, and didn’t push. He just said he wanted someone to have dinner with, someone to talk to.\n\nI didn’t respond at first. I wasn’t sure if I had the nerve. But eventually, I did. We exchanged a few messages. Then we met at a restaurant in town. I wore a dress I hadn’t touched in years. I was shaking the entire time. But he was kind. He treated me like a human being. No pressure, just dinner and conversation. At the end of the night, he handed me an envelope. I cried in my car for 30 minutes before I could drive home.\n\nThat money paid our rent that month. And I felt something shift in me… like I’d found a way to keep us above water, even if it wasn’t a path I ever imagined walking. Things evolved from there. I set boundaries. Some stayed. Some shifted. Eventually I started taking full-service clients. It is what it is.\n\nI’m not ashamed, not really, but I’m still struggling with fully accepting it. It’s just hard sometimes, carrying this double life. My family doesn't know, I don’t talk to anyone about it. But I needed to say it somewhere, even anonymously. I’m okay. But sometimes the weight of this secret feels like too much to hold by myself.",
  "created_utc": 1744532470.0,
  "score": 6110,
  "num_comments": 215,
  "url": "https://www.reddit.com/r/offmychest/comments/1jy2xx4/i_never_thought_id_become_a_sex_worker_at_35_but/",
  "comments": [
    {
      "id": "mmv7t4i",
      "body": "Financial security can reduce the burden of stress and uncertainty. That’s an essential peace.\n\nYou sound like an intelligent, loving mother who understands her boundaries and stands for her values. We live in a system that makes this life possible. There’s no shame in it. You’re still a good person with a beautiful heart.",
      "created_utc": 1744533263.0,
      "score": 4132
    },
    {
      "id": "mmvbak4",
      "body": "[deleted]",
      "created_utc": 1744535553.0,
      "score": 1541
    },
    {
      "id": "mmv7xy4",
      "body": "In my eyes you’re doing what you can to survive and take of your little girl. I won’t judge you all I’d say is you should probably do some therapy as you’re doing this to help process and protect yourself mentally. I wish you all the best and hope you’re happy and so is your little girl. Please please please also be careful!",
      "created_utc": 1744533350.0,
      "score": 627
    },
    {
      "id": "mmvdixh",
      "body": "Don't be ashamed.  Remember, \"no one can make you feel inferior without your consent\".  Hold your head up high and OWN IT, GIRL!!\n\nI was a very famous pornstar from 1995-2005.  Then I retired and had kids, and I've never hidden my past from them.  In fact, my fans still send Xmas and birthday presents to my kids (and me also LOL) to this day!  My kids think fans are the best thing ever, and everyone should have some LMAO!\n\nWhen my daughter started college at age 11 (yes you read that right), I enrolled with her so she wouldn't be alone on campus.  I got a Bachelor's in Psychology, and really enjoyed the experience.  Then I got a Master's in Education.  And last year I graduated as a Doctor of Jurisprudence from law school.\n\nFrom pornstar to mother to lawyer, I'm proud of every role I've played so far, and I look forward to all the things  I still plan to accomplish in the future!  This job you have right now does not define you, it's just one building block in a lifetime of experiences.  \\*\\*hugs!\\*\\*",
      "created_utc": 1744537032.0,
      "score": 967
    },
    {
      "id": "mmxxwe6",
      "body": "I was raised by sex workers. My mother was abused very young by her father and ran away. Met my dad. He sold her on the street when she was hardly 14. At some point she and some of the other girls left and worked without a pimp. \n\nI have no memories of my father, but I remember these women. They were all fierce, funny and they loved each other. I can recall sitting at the kitchen table as they painted their nails and laughed (so much!). Sure, I heard very age inappropriate stuff and inhaled far too much cheap perfume but they were the closest thing I ever had to family. \n\nThey never went off alone and everyone slept under the same roof. \n\nThey celebrated my mother getting into nursing school and another woman getting engaged. \n\nMy mother is ashamed of her past - she moved across the country to get away from it. I know it was not all sunshine and rainbows, sex work is considered to be the devil’s work when a woman performs it but men get a tsktsk when they solicit said devils. \n\nThose days were the best of my childhood - a real testament to sisterhood. \n\nBe safe.",
      "created_utc": 1744571629.0,
      "score": 166
    },
    {
      "id": "mmwyjck",
      "body": "This is how my uncle met my aunt. \n\nTLDR: they met because she was stripping/escorting to feed her 2 kids and fucking kicked ass, took names, and shattered glass ceilings on her way out.  \n\nHer rich, older husband left her, high and dry, with 2 young kids to feed. She ended up stripping/back room escorts etc. \n\nIn an awkward family dynamic (farmer boomer uncle who lived in mom’s basement until he was 45 and married my aunt) we didn’t tell my gramma how my uncle met my aunt. But my immediate family knew. There was one night when my dad and I were getting to know her that he asked the question - why’d you end up working there?\n\nShe laid it out point blank: “I could pick my hours. I could be at home in the mornings to get the kids up and fed and on the bus, work, be home in the afternoon to get them fed, cleaned, chores and making them little humans type tasks, and bed. Then go back to work while their grandmother would be there to step in. And - the money was the best I could get for that flexibility.”\n\n(ETA: my parents were still on the fence about her up until this point. They weren’t sure she’d “fit in” because of her fur coats, hoop earrings, manicured fingers and stuff … the woman was hauling water and feed to the cows in the same big fur coat that afternoon, didn’t even bat an eye. NO. FEAR.)\n\nIn that time, she also trained to become an RN, a licensed midwife, and doula. She’s now the head of the neo-natal ward at one of our local hospitals. \n\nI fucking *adore* this woman. The strength, tenacity, the love she has for her two amazing kids she’s raised through hell and high water … The only thing I don’t quite like about her is her taste in men lol (my uncle is a dink, but she actually turned him into someone WE didn’t hate to be around either). \n\nI am *so* sorry that your life situation has brought you to this, but please know that you should be proud of yourself to find the strength to persevere through such a storm. You are doing what you need to do to feed your kid - you deserve nothing but praise for that. \n\nPlease don’t feel reluctant to reach out to any help networks that might be available to you in your region either. I doubt that you are, but if it’s eastern Ontario and you’re not sure where to look, hit me up and I’ll help you out. \n\nBe lucky, you’ll be in my mind a lot going forward xo",
      "created_utc": 1744560617.0,
      "score": 82
    },
    {
      "id": "mmv8ku7",
      "body": "You are only stuck when you stop trying to get out. Don’t lose hope. Now is a good time to start a business. If your business picks up, just work on that and slowly move on. Try to keep your client list short and repeat same clients if you have the choice. Objectively, this won’t pan out financially in the long run. So, don’t stop clawing to get out. Plus, this might affect your girl in the long run, as stories and videos make their way out to her. You do what you need to do to survive, nothing but respect for that. But, follow the rules of professional athletes, make financial plans to retire. Don’t make it into your only future source of income.",
      "created_utc": 1744533770.0,
      "score": 132
    },
    {
      "id": "mmvlfq4",
      "body": "Sex work is \\*real\\* hard work, and I think finding community with other stable, sane people in the industry may bring you a lot of peace. Swapping work stories about clients and talking shop is a life saver.  My husband and I are both in the industry",
      "created_utc": 1744541977.0,
      "score": 94
    },
    {
      "id": "mmv92l3",
      "body": "You found a way to provide. You clearly have the assets that the clientele are looking for. So what if it isn't some 'bad girl boss' shit that people like to push women to do? You provide a service, one that quite frankly sometimes people may feel the need to indulge in. Head up darling and keep doing what you feel you need to do to provide for that lovely little girl. \n\nWho knows. You might find that this is something you enjoy and expand on that career. I mean, we hear about how hundreds of women make buckets of cash on Only Fans. Do what is best for you and your little one.",
      "created_utc": 1744534094.0,
      "score": 73
    },
    {
      "id": "mmvttcz",
      "body": "Just do chaturbate. I have a friend that does this from home and she makes interesting money. She is in her 40 . No meeting anyone and you can work as much as you want. She even does her Yoga session in there and people pay just to see her…",
      "created_utc": 1744546292.0,
      "score": 43
    },
    {
      "id": "mmvpjgk",
      "body": "You are doing what you can to survive---those who have never been in your position have no place to pass judgment.  Please continue to stay safe, and I'm sending positive vibes your way!",
      "created_utc": 1744544204.0,
      "score": 19
    },
    {
      "id": "mmygtea",
      "body": "This comment section has actually lifted my spirits up, so much, so thanks for that OP and like everyone else, has said you're a survivor, do what you need to do, you're still as valuable and amazing as you were before.",
      "created_utc": 1744577717.0,
      "score": 19
    },
    {
      "id": "mn2048g",
      "body": "Similar experience from me. I had nothing and needed money bad. I don't do it anymore but i was in that field all by myself for maybe 3 or 4 months and was able to save enough money to feel comfortable enough to quit and got a more stable but cheaper job. I cant really tell anyone about it that I know just like you, but i never regret doing it. Youre doing fine. BTW that secret is probably something youre going to have to keep for life. I had said it to an ex partner before and every time there was a big fight, it would come up in the arguments. Ive learned to never tell anyone ever again no matter how much i trust them.",
      "created_utc": 1744635961.0,
      "score": 6
    },
    {
      "id": "mmvmwu1",
      "body": "I consider it every day",
      "created_utc": 1744542809.0,
      "score": 17
    },
    {
      "id": "mmvnd88",
      "body": "Thank you for sharing your story. It is inspiring, it contributes to make sex workers seen as actual human beings with their own story, their own life, and their own feelings. I'm happy it's working out for you and I wish you to never come across a dangerous or creepy client.\n\nWould you have any resources to share on the matter? Like, the forums and blogs you mention, or the \"safe\" sites? I'm also looking into it myself, also never thought I'd get there but... life.",
      "created_utc": 1744543060.0,
      "score": 17
    },
    {
      "id": "mmvgnu0",
      "body": "As a happy customer of sex workers I have nothing but respect for you.",
      "created_utc": 1744539055.0,
      "score": 22
    },
    {
      "id": "mmvae9r",
      "body": "Sex work isn’t something to be ashamed about. \nIt’s one of the oldest professions out there. \n\nYou’re making money from your body. \nJust like a man laying down bricks makes money off of his. \n\nJust makes sure you get your bag. Don’t undersell. Make it worth it.",
      "created_utc": 1744534959.0,
      "score": 79
    },
    {
      "id": "mmvrsbm",
      "body": "I don't understand why this kind of work is illegal. It's \"the oldest trade\" and is likely not going anywhere for a while. It seems like it would be a much safer situation for service providers if the whole thing was legitimized and these providers didn't have to go through sketchy avenues. I imagine clients would benefit as well. Both parties could be vetted and there wouldn't be so many ambiguities/unknowns. Then again, I have no idea wtf I'm talking about. But just from my 10k ft pov, I think the world might benefit if we stopped beating around the bush",
      "created_utc": 1744545331.0,
      "score": 40
    },
    {
      "id": "mmvzi1o",
      "body": "Hey, I have a toddler myself, if I had to I would do it. My relationship fell apart a month ago and I’ve been actively looking for a second income because I’m scared shitless. I have a small cushion at the end of the month. For years I didn’t have to worry about a lot and now I’m worrying about all of it and I’m really scared. Don’t be ashamed or disgusted. You’re doing what you have to, to keep both of your heads above water. So your kid has what they need and they have a full meal at the end of the day.",
      "created_utc": 1744548808.0,
      "score": 14
    },
    {
      "id": "mmyllql",
      "body": "My kink is having my lawn cleared of all the fall foliage without blowing all my top soil away and some grass seed put down by people fully clothed. Must be a pretty far out there kink because I can't find anyone interested.",
      "created_utc": 1744579311.0,
      "score": 10
    },
    {
      "id": "mn0wdn1",
      "body": "That’s honestly pretty admirable. Hold your head up high. You’re making money and helping ease loneliness.",
      "created_utc": 1744614574.0,
      "score": 4
    },
    {
      "id": "mn2ooz5",
      "body": "Ngl... a guy talked me into starting an OF and we are filming together starting in a couple weeks. I have a good job but years of a bad job and having to stay drowning. I don't want to live like this constantly worrying about student loans, credit cards, etc. I plan to branch into escorting as well at some point. Even if it's an extra $100 a month it's worth it to me. It's my body, might as well make some money off it",
      "created_utc": 1744644015.0,
      "score": 5
    },
    {
      "id": "mmzz47z",
      "body": "A lot of strippers have said many men just want someone to talk to when they visit the clubs, and there are many prostitutes who say the same thing\n\nMany men (especially older ones) are lonely and just want someone to talk to. And if it happens to be an attractive lady? Even better, but I don’t think that’s even a requirement for most of them\n\nAnd there is a part of me that wants to know the name of that site lol",
      "created_utc": 1744597601.0,
      "score": 9
    },
    {
      "id": "mmx09lq",
      "body": "What's shameful is that society treats sex work like it's this oh so terrible thing. That performing sexual acts for money is something to be ashamed of.\n\nIt's not. Sex work is work and one of the oldest professions in the world and the people who participate in it deserve kindness and respect like anyone else. They deserve to be protected under the law so that it wouldn't have to be driven \"under ground\" where it's rife with danger and abuse.\n\nI hope you are able to make your peace with it, you have nothing to be ashamed of.",
      "created_utc": 1744561161.0,
      "score": 20
    },
    {
      "id": "mmx1msi",
      "body": "ALL sex work is just work. I was a stripper for a couple yrs during college.  im proud of you taking care of yourself.",
      "created_utc": 1744561590.0,
      "score": 15
    },
    {
      "id": "mmwca85",
      "body": "I was one back in 2017 and honestly, I loved it. I made so much money and had a lot of financial freedom. Just please be safe.",
      "created_utc": 1744553537.0,
      "score": 10
    },
    {
      "id": "mmye7gb",
      "body": "Don’t feel shame. I did it so my children and I wouldn’t be homeless (ex is a piece of work and did his best to make it happen) you did what you had to do. And you’ll overcome this point in your life.",
      "created_utc": 1744576870.0,
      "score": 8
    },
    {
      "id": "mn2d9ju",
      "body": "To me, people who choose the path to become paid companions (no sex necessarily involved, but can) are equally as comforting and needed as other professionals like nurses or therapists.\n\nThey provide a very specific and needed service, often underpaid, under-protected, undervalued.\nThey have warm hearts, patience, resilience, empathy and great boundaries.\n\nBear in mind my experience is only as a friend of many of these escorts. I haven't had the chance nor finance to hire an escort/companion worker yet.\nBut when I do, I will likely do it with dinner, a nice conversation and platonic cuddles if the chemistry is right.\n\nPlease, OP. Don't feel ashamed. You are surviving as an autonomous business woman, being the sole provider of your household, and a mother.\n\nI have heard that these jobs can allow a good work-home balance, and I wish this helps you be more present to your kid than any other single/divorced-mom out there.\n\nDon't be harsh to yourself. Your profession was, many centuries ago, a sacred job for a reason.",
      "created_utc": 1744640475.0,
      "score": 4
    },
    {
      "id": "mmyzquj",
      "body": "You're a great mom. Do what you have to do.",
      "created_utc": 1744584133.0,
      "score": 10
    },
    {
      "id": "mmva1td",
      "body": "Camming is always an option too. I would probably also have done the sugar daddy thing if I’d stayed single in adulthood, but I am very grateful that online interactions exist as well. No judgement at all, but just a third option that isn’t so heavy if you end up struggling with what to do.\nSource: am cam girl of 4.5 years",
      "created_utc": 1744534736.0,
      "score": 13
    },
    {
      "id": "mmvfq6p",
      "body": "Nothing to be ashamed of. We all need to eat and if this is how you can provide for your kid, that's that. But please, please be careful and on guard always and plan to get out the bery soonest you can because your profession is not at all safe. You are gambling with every client, even the supposedly \"safe\" regulars, that you will not be material for tru crime.",
      "created_utc": 1744538461.0,
      "score": 5
    },
    {
      "id": "mmzfpbk",
      "body": "I would never judge any mother, sister, daughter or any other random woman for turning to sex work by choice or by any means necessary to make rent.",
      "created_utc": 1744590016.0,
      "score": 6
    },
    {
      "id": "mmzr5ei",
      "body": "absolutely nothing to be ashamed of . 🫶🏼",
      "created_utc": 1744594440.0,
      "score": 4
    },
    {
      "id": "mmw23ho",
      "body": "There should be no reason you should feel ashamed. Sadly, there are many pearl clutchers who abide by their own version of morals. \n\nYou do you and live life without regrets. Be safe, and respect your boundaries. That will be the best gift you can give your daughter, a self assured, confident mom who knows who she is.",
      "created_utc": 1744549872.0,
      "score": 6
    },
    {
      "id": "mmypjv0",
      "body": "Hey, be proud that at 35 you're still hot enough for sex work! I've seen some very toxic posts by men who firmly believe that women over 30 have no use and aren't sexy. \n\nHonestly? I'm kinda jealous. I wish I were hot enough for sex work! And there is a vast difference between doing it because you have to, versus doing it because you think you're god's gift to mankind and of *course* all straight/bi men want you! \n\nI know someone who's the latter kind of sex worker and honestly, I have no respect for her because it's all based in narcissism, vanity and conceit. You don't sound like that kind of person.",
      "created_utc": 1744580630.0,
      "score": 8
    },
    {
      "id": "mn1m96k",
      "body": "Be safe……do to Mind sharing the safe site. I am a state worker with good benefits but poor pay",
      "created_utc": 1744630177.0,
      "score": 3
    },
    {
      "id": "mn2wfzi",
      "body": "You did what you had to do. Your daughter gets to eat and have a bed to stay in. If anyone judges you for that, they don't have it very hard.",
      "created_utc": 1744646335.0,
      "score": 3
    },
    {
      "id": "mmzhpca",
      "body": "There's no shame in sex work. I was a FSSW for 3 years, people have needs. People want connection. What's the harm in fulfilling someone's sexual/emotional needs in return for them fulfilling your financial needs, our time, our body, and our heart remains ours and ours only to do with as we please to get by in this world.",
      "created_utc": 1744590777.0,
      "score": 8
    },
    {
      "id": "mmvef0l",
      "body": "Thank you for sharing 🩷 I’m glad you’re not ashamed, tho I understand it’s hard to accept it fully, too. You’re doing what it takes to take care of your baby and putting her security before your own comfort. Now that’s unconditional love. I see you and I hear you, and I don’t judge you at all. Stay as safe as possible 🫂",
      "created_utc": 1744537616.0,
      "score": 5
    },
    {
      "id": "mmvpxms",
      "body": "I am just here to wish you all the very best in whatever you do sister.\n🫡",
      "created_utc": 1744544403.0,
      "score": 6
    },
    {
      "id": "mmvxa1y",
      "body": "Bravah to you honey, you're doing what you need to do to provide for your daughter.",
      "created_utc": 1744547859.0,
      "score": 4
    },
    {
      "id": "mmwfp6u",
      "body": "I have a friend that's a sugar baby to support their child. They casually (and a little bit nervously) brought it up in conversation with me, and I was initially shocked. It just took me back at how casual it was brought up. I didn't think any less or anymore of them. I just asked if they were safe, they said yes. It just is what it is. Now we talk about it just like any other job and they said they feel more at peace about it because they can just talk about it. they aren't proud of it necessary, but they don't feel ashamed of it.\n\nI don't know if this helps or it's just me rambling, but I don't think you should feel ashamed of it. It can be fulfilling, exhausting,  or whatever. Financial stability is a stress reliever Don't let shame isolate you or your sense of self worth. It's a job.",
      "created_utc": 1744554676.0,
      "score": 6
    },
    {
      "id": "mmwyejh",
      "body": "Is there another sex worker that could be a buddy system? I hate to think about no one knowing and your safety.",
      "created_utc": 1744560576.0,
      "score": 6
    },
    {
      "id": "mn0fm1b",
      "body": "Baby g, get that bag. Do what you need to do. Just keep doing it within YOUR boundaries.",
      "created_utc": 1744605028.0,
      "score": 5
    },
    {
      "id": "mmvbebe",
      "body": "If this or poverty? Is there really a choice?",
      "created_utc": 1744535624.0,
      "score": 13
    },
    {
      "id": "mmvdg0b",
      "body": "You're doing what you have to do to provide for you and your family. There is no shame in that. As long as you stay safe and everyone consents to everything, I see no issues with it whatsoever.\n\nSex work is, IIRC, basically one of the oldest professions in history. People of all genders have been doing it for as long as society has been a thing. I have no idea of any statistics, but I'm willing to bet that it's far more common than you think.\n\nThe only time when it becomes very, very problematic is when it's non-consentual. When someone's being forced to do it to make money for someone else. When someone's being threatened. Abused. Trafficked. Your situation is entirely different. You make your own choices and you can stop whenever you want to and then just move on without looking back and feeling ashamed. I truly mean it.\n\nI understand your family being in the dark about it. Fully understandable. It's a very controversial topic and there's really no need for them to know. You're not hiding anything from them, you're protecting yourself. If you were to spill the beans, they would probably have all kinds of negative reactions based on prejudice and stuff. They're not entitled to knowing every little (or big!) thing about your life even if they're family.\n\nI'm proud of you. It's a tough world. Often it's all about survival. The shame lies in society itself; job opportunities being so scarce and everything getting more and more expensive... That sucks.\n\nTake care, stay safe and keep your head up high. You're not hurting anyone.",
      "created_utc": 1744536977.0,
      "score": 10
    },
    {
      "id": "mmz3gwk",
      "body": "I returned to sex work at 45. Don’t regret it all",
      "created_utc": 1744585455.0,
      "score": 6
    },
    {
      "id": "mmv9lc0",
      "body": "I know it must be difficult, but u did this for your family. Though it's not easy to accept this for you.",
      "created_utc": 1744534436.0,
      "score": 8
    },
    {
      "id": "mmyatko",
      "body": "I can see how it can feel like giving up one stress/anxiety fir another,  but it's pretty much as others have said. Existential stressors are far more important and immediate than anything tied to image or ones own mental health.\n\nYou're doing what you had to do, and while it isn't glamorous and it has its drawbacks, going into that stress eyes wide open is different from not knowing if youll have a place to sleeo next month.\n\nYoure just doing the best you can. It's okay!",
      "created_utc": 1744575779.0,
      "score": 4
    },
    {
      "id": "mmvo23q",
      "body": "You are an amazing mom! You're taking care of yourself & your daughter, and it's no one's business how you're doing it. I have so much respect for you.",
      "created_utc": 1744543434.0,
      "score": 3
    },
    {
      "id": "mmxigh8",
      "body": "No judgement here. I would totally do the same if I were hot enough. \n\nFor safety reasons, do you have a friend or someone you trust that you could tell? I just worry that something could happen to you while you’re on a date and no one would know where you were or who you were with. ",
      "created_utc": 1744566764.0,
      "score": 6
    },
    {
      "id": "mmy0vqy",
      "body": "Never apologize for what has to be done to survive.",
      "created_utc": 1744572596.0,
      "score": 5
    },
    {
      "id": "mmv82gb",
      "body": "30M here. I just love the story, even if you’re not proud of it. The boundaries you have set are important. I respect the men that just want company from a woman and are willing to be up front and honest.",
      "created_utc": 1744533433.0,
      "score": 10
    },
    {
      "id": "mn0mol0",
      "body": "You write well",
      "created_utc": 1744608799.0,
      "score": 2
    },
    {
      "id": "mn2dcyh",
      "body": "There is nothing wrong with what you're doing. Society is wrong, or should i say religion has brainwashed society into thinking it's wrong. You're safe, clean, respectful. You're golden. You set the rules for your work and provide for your family. It's very accepted and celebrated in other countries around the world. ",
      "created_utc": 1744640505.0,
      "score": 2
    },
    {
      "id": "mn3fhep",
      "body": "When things get better you can do whichever work you wanna do !! I mean you can shift to job culture if you want to. But yeah living two lives side by side it’s difficult. I wanna know do you have any interests or hobbies?",
      "created_utc": 1744652004.0,
      "score": 2
    },
    {
      "id": "mo05j19",
      "body": "Not only am I not judging you, I’m applauding you. You did the sensible thing, and you are able to provide for your daughter. Honestly, I’ve been considering sex work for some time now. ",
      "created_utc": 1745103658.0,
      "score": 2
    },
    {
      "id": "mmx9yvw",
      "body": "All i see is an amazing mother 🥰",
      "created_utc": 1744564174.0,
      "score": 6
    },
    {
      "id": "mmwq4hb",
      "body": "The economy strikes again lol",
      "created_utc": 1744557988.0,
      "score": 3
    },
    {
      "id": "mmvqjkx",
      "body": "You are resourceful!",
      "created_utc": 1744544714.0,
      "score": 1
    },
    {
      "id": "mmwts0q",
      "body": "just don't take any shit to cope with that.",
      "created_utc": 1744559142.0,
      "score": 3
    },
    {
      "id": "mmxmv7w",
      "body": "You're fighter. I don't support the work you do. But I know life is real. We fight our teeth n bones to keep going. Hope your children never find out and have the life you never had",
      "created_utc": 1744568115.0,
      "score": 3
    },
    {
      "id": "mmya6u6",
      "body": "🫶🏻👠🤍",
      "created_utc": 1744575577.0,
      "score": 2
    },
    {
      "id": "mmznj3z",
      "body": "\nI just want you to know how incredibly strong you are. The weight of the world—and the judgments, stigma, or hardships that come with it, can feel crushing sometimes, but please remember: you are so much more than what you do. Your worth isn’t defined by anyone else’s opinions or the difficult moments you face. You deserve kindness, respect, and compassion, especially from yourself. What you do takes courage, resilience, and a depth of strength that many people will never understand. \nIf you need a reminder of your light, here it is: You are loved. You are enough. And you deserve all the goodness life can bring.",
      "created_utc": 1744593015.0,
      "score": 4
    },
    {
      "id": "mmwnf72",
      "body": "It's just sad to me that you felt you had no value other than your mere presence and sexual value. No other aspirations or goals? But of course everyone in the comments is going to berate me and say \"you go girl get that bag!\"\nBut the \"bag\" could've been something more productive for society. \nWill your kids get bullied in the future? Will you have a career path once your looks diminish? Lots of questions that I feel many women don't ask themselves before jumping toward that precious \"bag\"\nYou did provide for your family, but at what cost? \nIs it worth it?\nNo one can answer but you, maybe it will be absolutely wonderful and fine and nothing bad will come of it.\nWhat do I know? You are the one living it.\nJust be safe, and love that baby every day more and more, I'm sure life will be grand for all involved.",
      "created_utc": 1744557136.0,
      "score": 6
    },
    {
      "id": "mmy3t6x",
      "body": "There should be zero shame attached to sex work. It is WORK. You are providing for yourself and your child. You have boundaries, you’re not being coerced, and as long as you’re safe (physically and sexually), I see nothing wrong with your choices.",
      "created_utc": 1744573545.0,
      "score": 4
    },
    {
      "id": "mmw088w",
      "body": "Sometimes we have to do hard things. There is no shame in that. What are you doing to save for the future? I'm sure you don’t plan to do this for 20 years. How do you plan to address this when your child figures it out? These are the things that worry me. \n\nNo shame, but those questions occur to me right away.",
      "created_utc": 1744549112.0,
      "score": 2
    },
    {
      "id": "mmz7e8o",
      "body": "you’re doing what you have to do. don’t be ashamed. you’re fighting. you’re a fighter",
      "created_utc": 1744586889.0,
      "score": 2
    },
    {
      "id": "mmzy7ly",
      "body": "Respect, Op. No shame.",
      "created_utc": 1744597235.0,
      "score": 2
    },
    {
      "id": "mn097er",
      "body": "You know what …. You do what you need to do\nAs a parent …. Don’t be hard on yourself .",
      "created_utc": 1744601955.0,
      "score": 2
    },
    {
      "id": "mmw8rf5",
      "body": "For what it's worth, I don't think there's any shame in this at all, like zero shame.  You're supporting your family, which is noble in its own right.\n\nAnd though there are the disgusting men who you mentioned, think of what a light you were in that kind gentleman's life.\n\nSome people need that, and can't get it elsewhere for whatever reason.\n\nI hope you are well.",
      "created_utc": 1744552320.0,
      "score": 2
    },
    {
      "id": "mmzqu3g",
      "body": "Sex work is work. ",
      "created_utc": 1744594316.0,
      "score": 4
    },
    {
      "id": "mn0m79x",
      "body": "Do whatever you have to do (while being safe, creeps be creeping) for you and that baby.",
      "created_utc": 1744608531.0,
      "score": 1
    },
    {
      "id": "mn1ymcu",
      "body": "Well ..you are not alone .... a lot of people have double life , sometimes they don't even know it ... they spend all day around engaged in futile planning calls and calls about organizing the netxt call  , they think they run organizations and so does their family .... there is no glory and no shame ....whatever pays your bills unless and until you are hurting someone else :)",
      "created_utc": 1744635403.0,
      "score": 1
    },
    {
      "id": "mn21s5s",
      "body": "You may never read this OP - but there is no one who has a right to judge you. \n\nI lost my job during COVID. I had a mortgage, a wife, a little boy and another on the way. I was desperate and I crossed lines that I swore I never would just to ensure that my family had a roof over their head and food in their bellies. I went to sleep hungry more often than not; and I worked jobs that they’ll never know about just to provide. \n\nYou did and do what you have to, to protect those who matter to you. I genuinely hope that during the hard times, you can hold your head up high and proudly know that you protected your family.",
      "created_utc": 1744636574.0,
      "score": 1
    },
    {
      "id": "mn2qes4",
      "body": "It's not shameful at all. I remember an old guy I interviewed back then about his job as a manual scavenging worker. He told me \"If it feeds a mouth, place a roof on a head, warm a shivered, and nuture youngsters, then there's no shame in that.\"",
      "created_utc": 1744644539.0,
      "score": 1
    },
    {
      "id": "mn3cx28",
      "body": "You sound like a very loving and caring woman and mother",
      "created_utc": 1744651270.0,
      "score": 1
    },
    {
      "id": "mn8959h",
      "body": "I admire you for doing whatever it takes to provide for your child.  There's nothing I wouldn't do for my daughter.",
      "created_utc": 1744723134.0,
      "score": 1
    },
    {
      "id": "mnfo0go",
      "body": "Can you tell me more about this and how you started I am really looking into starting sex work I am so tired of living paycheck to paycheck.",
      "created_utc": 1744821583.0,
      "score": 1
    },
    {
      "id": "mnm7jit",
      "body": "I can understand why you're going through this and I hope someday you can be able to find peace with it or be able to get out if that's what you mean to do. But please do look into resources to help you and your girl out if something were to happen. There are many nonprofits in your local area that help those that are set in wanting to escape or at least have a safety net while still in sex work or or victims of human trafficking. If you're living in an area that does not protect you legally. Stay safe darling.",
      "created_utc": 1744909965.0,
      "score": 1
    },
    {
      "id": "mnu98p9",
      "body": "No judgement here girl. You’d obviously do anything for your daughter, and for that, I applaud you. I’d do anything for my kid, including this.\n\nYou’re doing the best you can, God knows he sent an amazing mother for this child. Keep your head up mama, you’re an amazing person!",
      "created_utc": 1745017373.0,
      "score": 1
    },
    {
      "id": "mnucwxq",
      "body": "I admire you, you are providing for you and your daughter alone, you should be proud. \n\n\nAnd if you ever decide to do an AMA I'd love to hear about everything!",
      "created_utc": 1745018687.0,
      "score": 1
    },
    {
      "id": "mnw1zur",
      "body": "Sending you so much love 💗 I hope it gets easier, all of it. Please don't judge yourself. ",
      "created_utc": 1745045485.0,
      "score": 1
    },
    {
      "id": "mnyqh7c",
      "body": "Here I am doing it for free, because I'm ugly and worthless and useless and disgusting. And they fucking reject me all the time. If I asked for money, even walls would start laughing and windows would break and buildings would collapse. \n\n\nI PAY THEM INDIRECTLY TO HAVE SEX WITH ME ITS RIDICULOUS ",
      "created_utc": 1745086434.0,
      "score": 1
    },
    {
      "id": "mo25g27",
      "body": "I'm glad you got it off your chest.\nI'm sure you're only seeing clients that you vet as respectful, like your first client. \nI knew a couple of sex workers well, and they were wonderful women, beautiful souls. \nI'm not a Christian, but I like many things in the Bible, including not to judge other people, and the example of Jesus who was ready to love and befriend anyone. ",
      "created_utc": 1745135872.0,
      "score": 1
    },
    {
      "id": "mo33xcp",
      "body": "I'm proud of you for taking care of you and yours. That's the most important part. I've been out of work for a year, if I wasn't an overweight 32 yr old male I would probably try sex work too 🤣",
      "created_utc": 1745154974.0,
      "score": 1
    },
    {
      "id": "mmwdbpt",
      "body": "Yo. We do what we can to survive. Dont beat yourself up over this. At least you have an out now. Save up and make plans to move onto something more stable and sustainable soon.\n\nAll the best!",
      "created_utc": 1744553889.0,
      "score": 2
    },
    {
      "id": "mmwje2y",
      "body": "You're doing what needs to be done and that's admirable. \n\nBut if you're going to be meeting people in person, you'll probably need to inform someone you really trust what you're doing and where you're going in case something really goes wrong and they need to locate you.",
      "created_utc": 1744555864.0,
      "score": 1
    },
    {
      "id": "mmvs73o",
      "body": "Hopefully you get out. Sex work isn't the way. But hey that's up to you",
      "created_utc": 1744545527.0,
      "score": -2
    },
    {
      "id": "mmwsztq",
      "body": "All cash!!!!!",
      "created_utc": 1744558897.0,
      "score": 1
    },
    {
      "id": "mmwt4ja",
      "body": "¡Amén!   You are okay.   It’s okay.",
      "created_utc": 1744558937.0,
      "score": 1
    },
    {
      "id": "mmzbxzp",
      "body": "OP you have nothing to be ashamed of. I hope it’s ok but I’m going to send you a message x",
      "created_utc": 1744588588.0,
      "score": 1
    },
    {
      "id": "mmxxe0a",
      "body": "Maybe do be ashamed",
      "created_utc": 1744571463.0,
      "score": 0
    },
    {
      "id": "mmvn3lr",
      "body": "Curious what website you used?",
      "created_utc": 1744542913.0,
      "score": 1
    },
    {
      "id": "mmvrxjn",
      "body": "So where did you have your little stay while you went on this ?",
      "created_utc": 1744545400.0,
      "score": -1
    },
    {
      "id": "mmv9ti4",
      "body": "“Dinner and conversation” is sex work now?",
      "created_utc": 1744534586.0,
      "score": -4
    },
    {
      "id": "mmvaxel",
      "body": "Good luck to you. \nAnyone who hate you or is judging you is beyond stupid.  \nIf there wasn't a demand, then prostitution wouldn't be a thing.  Plus you're not harming 6 you're doing better than those who live off of someone else, draining them.",
      "created_utc": 1744535310.0,
      "score": -7
    },
    {
      "id": "mmvmmnt",
      "body": "Kind of funny how posts by guys talking about prostitution are full of people judging them and get eventually deleted because it is against this sub's \"rules\", while posts by women about prostitution are full of praise and encouragement. Why is it that customers are all rapists and disgusting and the providers are all admirable, brave and so independent?",
      "created_utc": 1744542654.0,
      "score": -6
    },
    {
      "id": "mmvktid",
      "body": "Times are changing, people aren’t that judgemental towards sex work because what other logical step is there. I know you’re still surrounded by the judgemental generation but I can see more & more folks becoming empathetic towards it. Today’s it’s more Like - if you’re forced to do it, it’s bad, if you’re happy to do it then it’s okay. If you’re doing it to survive or your family, more power to you 👏 \n\nThe general mass opinion is tending toward - “atleast a sex worker puts in the work and earns it whereas an alimony lady does it out of vendetta and earns for free”. A lot of college girls have also started doing it either for their education or their family etc. Just giving you some insight so you don’t feel alone. \n\nAll that said - people can be creeps & haters can be violent. Be safe, both from the people & health. Keep it in public, have a personal assistant who will be your safety contact, regular std checks so you don’t pass it on to your family by mistake.",
      "created_utc": 1744541618.0,
      "score": -4
    },
    {
      "id": "mmw2vzl",
      "body": "I just want to know how this has affected your feelings towards the movie Pretty Woman Or indecent proposal ?\n\nCan you see them thru  a new lens now ? \n\nWhats your take",
      "created_utc": 1744550185.0,
      "score": 0
    },
    {
      "id": "mmy0hj6",
      "body": "You never know what you babys mothers might turn to",
      "created_utc": 1744572468.0,
      "score": -3
    },
    {
      "id": "mmveug0",
      "body": "I dunno, I still think escorts are not sex workers, nothing sexual but companionship, and you are doing what you have to do. As long as you are taking care of your little girl and not partying, you are doing great!!!",
      "created_utc": 1744537895.0,
      "score": -8
    },
    {
      "id": "mmwwfrv",
      "body": "Sounds like AI, but if real, then good luck.",
      "created_utc": 1744559962.0,
      "score": -1
    },
    {
      "id": "mmzy54l",
      "body": "Might as well start an Only Fans.",
      "created_utc": 1744597207.0,
      "score": -3
    },
    {
      "id": "mmxpuq0",
      "body": "Gross",
      "created_utc": 1744569062.0,
      "score": -9
    },
    {
      "id": "mn1v4fb",
      "body": "Life on easy mode",
      "created_utc": 1744634038.0,
      "score": -1
    },
    {
      "id": "mn3vwxr",
      "body": "I mean, I only see it as a last resort kind of job when you have absolutely nothing left to offer the world, hopefully the money paying your rent allowed you the time to apply to real jobs that provide security for you and and your kid, while also giving back to the world in some kind of essential way. I think everyone should be working normal, everyday jobs that help the community stay fed and healthy and safe. I despise useless jobs or those that make far more income than what they're giving back to the world. But if your kid is fed and you are safe...but you should really use this luck of coming into some rent money to apply to real jobs again. You asked, this is my advice :-) edited for spelling",
      "created_utc": 1744656853.0,
      "score": -1
    },
    {
      "id": "mn7esku",
      "body": "Rates?",
      "created_utc": 1744708875.0,
      "score": -2
    },
    {
      "id": "mmyqhpa",
      "body": "[deleted]",
      "created_utc": 1744580942.0,
      "score": -6
    },
    {
      "id": "mmvfs6t",
      "body": "[deleted]",
      "created_utc": 1744538497.0,
      "score": -17
    },
    {
      "id": "mmvgazi",
      "body": "That's not sex work if you choose not to have sex with clients. You are only providing companionship. \n\n\"Hire a friend\" is very common in Asia. Absolutely no sex. It is just like therapy. \n\nI remember watching a TV show. A Japanese gay man \"hired\" a friend to accompany him to his family. He wanted to come out to them but he didn't want to do it alone. Then a Chinese girl would go coffee and dinner dates (no sex) with guys for money. She made it very clear it was only coffee or dinner (but they have to pay for her time.)\n\nJust think of it as therapy or \"hire a friend)",
      "created_utc": 1744538826.0,
      "score": -19
    },
    {
      "id": "mmvslye",
      "body": "As a man, and even then, reading this, I have the utmost respect for you! Your dignity is still as great in my eyes as it was before you started this work! I would like to change the word sex worker to companion worker.\n\nBecause I also believe that not all men are necessarily looking for sexual intercourse per se, but to be heard and seen!\n\nLike that person you had dinner with; these are the \"minorities\" who help you without asking anything in return, a favor, so to speak, out of compassion for your unspoken situation.\n\nIf I wanted to find someone for a lasting romantic relationship (like in this case with you on a serious date), I see no reason to say no. You can just keep doing what you are doing!\n\nEdit: If people judge me negatively because they think I am a creep, I am saying it in a positive way. To encourage her and not have to feel ashamed of anything. Not every man on this planet is judgmental, narrow-minded, and contemptuous.",
      "created_utc": 1744545725.0,
      "score": 717
    },
    {
      "id": "mn32d18",
      "body": "Agreed! Why not talk to a free online support group (or individual therapy if that’s doable)? You don’t have to even turn on your camera and can use a screen name. It’s somewhere you can process that and talk through it so you aren’t holding onto it alone (and don’t have to fear out- there reactions of people close to you.)",
      "created_utc": 1744648130.0,
      "score": 5
    },
    {
      "id": "mmyacue",
      "body": "🫶🏻",
      "created_utc": 1744575629.0,
      "score": 72
    },
    {
      "id": "mo25lez",
      "body": "You're an amazing non judgemental loving person ",
      "created_utc": 1745135965.0,
      "score": 2
    },
    {
      "id": "mmvffnf",
      "body": "Holy moly, it's really you. Omg, I am fan-girling so hard right now. I just love you! I'm so happy to hear you are happy in life and still just as successful as ever!",
      "created_utc": 1744538272.0,
      "score": 301
    },
    {
      "id": "mmvnjql",
      "body": "I totally remember you! It’s incredible to hear you’re a lawyer now. What a ride! Congrats to you!",
      "created_utc": 1744543157.0,
      "score": 141
    },
    {
      "id": "mmvekm5",
      "body": "Your story is amazing. You are amazing. I know we don't know each other, but I'm so proud of you and the life you have built for yourself and your children. Way to go mamma!",
      "created_utc": 1744537719.0,
      "score": 111
    },
    {
      "id": "mmzhah8",
      "body": "You were the first pornography I ever saw!  Your website was light years ahead of other pornstars putting out their own content, and you looked beautiful, smart, and funny.  Thank you for showing sex in such a female-positive light.  I’m also an attorney and mother.  I wish you a happy and successful career.",
      "created_utc": 1744590620.0,
      "score": 38
    },
    {
      "id": "mmx2hln",
      "body": "Super cool to know you’re on Reddit, I’m sure you don’t want to take away spotlight from OP, I always thought your story was super interesting, and you were in my favorite movie (Big Lebowski).",
      "created_utc": 1744561861.0,
      "score": 46
    },
    {
      "id": "mmwcxtl",
      "body": "What an awesome path you took. Was also quite the fan in my younger days haha. So cool about how things turned out. Congrats and also abreast message to the OP.",
      "created_utc": 1744553760.0,
      "score": 41
    },
    {
      "id": "mmyaj0k",
      "body": "😍😍😍",
      "created_utc": 1744575684.0,
      "score": 6
    },
    {
      "id": "mmyvy0s",
      "body": "I love this comment so much. What a beautiful tribe you were surrounded by.",
      "created_utc": 1744582809.0,
      "score": 33
    },
    {
      "id": "mnmoxvs",
      "body": "(honestly funny client stories are so fun to share, and people who've been in the industry a long time tend to be pretty tough and pragmatic)",
      "created_utc": 1744914983.0,
      "score": 2
    },
    {
      "id": "mnfueea",
      "body": "Out of curiosity, what makes you want to be a customer?",
      "created_utc": 1744823420.0,
      "score": 2
    },
    {
      "id": "mn2ed9n",
      "body": ">You’re making money from your body\n\nI'd argue there is a lot of mind into it too. Art.",
      "created_utc": 1744640825.0,
      "score": 2
    },
    {
      "id": "mmxxwzr",
      "body": "No, there is honest work and non-honest work",
      "created_utc": 1744571634.0,
      "score": -10
    },
    {
      "id": "mmwjez4",
      "body": "It’s because of Puritanism. Yet the people who uphold don’t have an actual economic solution to prevent people from doing work like this.",
      "created_utc": 1744555872.0,
      "score": 19
    },
    {
      "id": "mmxlb2e",
      "body": "I think it should be legal but I still think there’s a stigma around it. People have a hard time getting over it.",
      "created_utc": 1744567630.0,
      "score": 4
    },
    {
      "id": "mn2eerh",
      "body": "It is legal in many countries",
      "created_utc": 1744640838.0,
      "score": 1
    },
    {
      "id": "mmz0b69",
      "body": "Lol I'm interested! 🤣",
      "created_utc": 1744584336.0,
      "score": 4
    },
    {
      "id": "mn5moil",
      "body": "Can I ask what made you stop",
      "created_utc": 1744677337.0,
      "score": 1
    },
    {
      "id": "mmvbbis",
      "body": "She probably wants to stay anonymous.  Cammming opens the possibility of someone seeing you online.",
      "created_utc": 1744535572.0,
      "score": 28
    },
    {
      "id": "mmvb1pu",
      "body": "Thanks. I thought about camming, but never followed through. I live with my daughter in a small space, so in a weird way meeting someone in person felt more private. It’s not perfect, but it’s what made sense for me in my situation.",
      "created_utc": 1744535391.0,
      "score": 42
    },
    {
      "id": "mn5mwi1",
      "body": "Are you ever worried that someone may screenshot you?",
      "created_utc": 1744677415.0,
      "score": 1
    },
    {
      "id": "mnfv052",
      "body": "Impressed you have the body and looks at 45!",
      "created_utc": 1744823592.0,
      "score": 1
    },
    {
      "id": "mn0hveq",
      "body": "F off",
      "created_utc": 1744606185.0,
      "score": -4
    },
    {
      "id": "mmz1iml",
      "body": "Thinking for the future is a luxury.",
      "created_utc": 1744584764.0,
      "score": 0
    },
    {
      "id": "mo24w21",
      "body": "So is being a loan shark but both degrade society",
      "created_utc": 1745135522.0,
      "score": 2
    },
    {
      "id": "mmw9vtb",
      "body": "As long as both parties consent, it's a legitimate a way as me giving my brain to an IT job for 40 hours a week.",
      "created_utc": 1744552708.0,
      "score": 1
    },
    {
      "id": "mmw45t5",
      "body": "Why is sex work not the way?",
      "created_utc": 1744550674.0,
      "score": -3
    },
    {
      "id": "mmvdpls",
      "body": "I am following the blog of a trans sex worker, and she talks a lot about how people approach her sometimes just for wanting to be held by someone, wanting to be heard by someone, wanting to have company and feel human...the sex happens of course but sex work is far more complex than just that.",
      "created_utc": 1744537157.0,
      "score": 15
    },
    {
      "id": "mmvat16",
      "body": "Sometimes thats all it is but it usually ends with a happy ending.",
      "created_utc": 1744535228.0,
      "score": 11
    },
    {
      "id": "mmy14xk",
      "body": "Did you skip the rest?",
      "created_utc": 1744572678.0,
      "score": 3
    },
    {
      "id": "mmvdegh",
      "body": "Ik sounds made up lol",
      "created_utc": 1744536949.0,
      "score": 3
    },
    {
      "id": "mmz1dv9",
      "body": "Having sex for money very definitely is sex work, and she explicitly says she is.",
      "created_utc": 1744584718.0,
      "score": 0
    },
    {
      "id": "mmy0wnn",
      "body": "Lets not be crazy\n\nThis is prostitution not the online shit you see",
      "created_utc": 1744572604.0,
      "score": 2
    },
    {
      "id": "mmz1a89",
      "body": "She is having sex with at least some of her clients.",
      "created_utc": 1744584681.0,
      "score": 3
    },
    {
      "id": "mmz3nbv",
      "body": "You can know the kind of reaction your family will give you and decide it’s not worth the stress.",
      "created_utc": 1744585522.0,
      "score": 6
    },
    {
      "id": "mmz107f",
      "body": "Try again, because she is having sex with them.",
      "created_utc": 1744584581.0,
      "score": 2
    },
    {
      "id": "mmw5dtv",
      "body": "I like your perspective. Also, it's our job as men to call other men out and hold them accountable for their toxic behaviors. It's a hard task and it means being curious and openly asking hard questions... not just reprimanding and judging them.\n\nWe’ve got a lot to do as a society.",
      "created_utc": 1744551135.0,
      "score": 253
    },
    {
      "id": "mn9ji1u",
      "body": "Sounds like someone is a fan of Firefly. The companions being extremely respected (in general) in Firefly is truly one of my favourite parts of the series.",
      "created_utc": 1744737335.0,
      "score": 4
    },
    {
      "id": "mn03aal",
      "body": "Social Entrepreneur is the word I would use.",
      "created_utc": 1744599331.0,
      "score": 3
    },
    {
      "id": "mmw5ogi",
      "body": "I think it may be more the fact that you felt the need to say that you are a man. Not all women care about what a man thinks of them. You could have said the same sentiment without mentioning that you were male.",
      "created_utc": 1744551245.0,
      "score": -97
    },
    {
      "id": "mn0zbyn",
      "body": "💛Thank you. I felt so many emotions reading OPs post. The vulnerability reminded me so much of my Mom.\n\nShe was a strong woman and a wonderful mother. We felt no shame for what she did. We loved her even more for the sacrifices she made.\n\n\"A mother's love knows no bounds\"",
      "created_utc": 1744616447.0,
      "score": 41
    },
    {
      "id": "mo49cni",
      "body": "💛",
      "created_utc": 1745168813.0,
      "score": 1
    },
    {
      "id": "mmvhyyr",
      "body": "Aw, thank you for the kind words!!",
      "created_utc": 1744539878.0,
      "score": 120
    },
    {
      "id": "mn1z9py",
      "body": "I wanted to pick something as diametrically opposed to my original career as possible, just to make for an interesting gravestone:  \"Pornstar, Mother, Lawyer.\"",
      "created_utc": 1744635644.0,
      "score": 41
    },
    {
      "id": "mmvhzx5",
      "body": "You are so sweet, thank you!!",
      "created_utc": 1744539894.0,
      "score": 56
    },
    {
      "id": "mn1xn3r",
      "body": "Thank you kindly!!   XOXOX",
      "created_utc": 1744635031.0,
      "score": 16
    },
    {
      "id": "mn1yhfv",
      "body": "Me - \"Hi I'm Sherri!   I'm just here to use the shower.\"\n\nMaude - \"Ugh, you can guess where it goes from there...\"\n\nThe Dude - \"Uh, he fixes the cable tv?\"",
      "created_utc": 1744635353.0,
      "score": 12
    },
    {
      "id": "mn1ywkq",
      "body": "Thank you!  : )",
      "created_utc": 1744635508.0,
      "score": 10
    },
    {
      "id": "mn2etjt",
      "body": "Women raising women up no matter what the circumstances 💖",
      "created_utc": 1744640969.0,
      "score": 10
    },
    {
      "id": "mnzntky",
      "body": "There’s a whole lot to unpack there but to sum it up, I mainly pay for sex because it’s rather difficult for me to date conventionally as an autistic male. \n\nThere was a point in my life not too long ago where I thought I’d never pay for a prostitute. Then a bunch of really depressing shit happened to me in my freshman year of college which really changed my perspective on sex and what it means to be sexually active. I do still try to conventionally date, but I find that having at least some intimacy in my life is really important and I wouldn’t be in a healthy place mentally without it. I’m not so different from other guys my age when it comes to need for intimacy. The only difference is that I’m straight to the point and I don’t have to constantly deal with the full stress of dating, rejection, etc. \n\n\nI’ve had plenty of awesome experiences with really beautiful women that otherwise wouldn’t have been possible. I also pay for much longer sessions and have been intimate with a few women almost as close as a girlfriend. Other guys almost always pay for sex too, it’s just not a guarantee for them like it is for me. \n\nLooking back on my life before I visited sex workers and looking at now, I have absolutely no regrets. Even though where I do it it’s completely illegal. They did everything I needed them to do for me mentally. Considering the shit I’ve had to go through in my life so far, if paying for sex is the worst thing I ever do, I’m going to high heaven. My conscience is clear, my heart is happy.",
      "created_utc": 1745097493.0,
      "score": 2
    },
    {
      "id": "mmzekyd",
      "body": "what makes sex work \"non-honest\"?...",
      "created_utc": 1744589588.0,
      "score": 8
    },
    {
      "id": "mmxioyy",
      "body": "It’s so odd how over sexualized western society is yet prudish at the same time.",
      "created_utc": 1744566832.0,
      "score": 15
    },
    {
      "id": "mmyqzsj",
      "body": "would you want your mom to be a prostitute?",
      "created_utc": 1744581112.0,
      "score": 0
    },
    {
      "id": "mn5otut",
      "body": "If I’m being completely honest, I ended up getting arrested because of it. I almost lost everything I had. I would do it again in a heart beat if I didn’t have too much to lose.",
      "created_utc": 1744678106.0,
      "score": 2
    },
    {
      "id": "mmvfxhd",
      "body": "Sugar daddy websites are even less anonymous than camming because they typically *focus* on a specific region. Both are recommended to use with an alias though.",
      "created_utc": 1744538589.0,
      "score": 2
    },
    {
      "id": "mmvfouw",
      "body": "Totally fair. I just wanna share that it doesn’t have to be as intense (or loud) or elaborate as a lot of people make it. Often times, I just talk and get naked and that’s it. And just in case there’s any concerns like the person below mentions, it can be totally anonymous, as you do use an alias and you can also block IP addresses in your region, and you don’t have to make socials for it if you don’t want to. I hope I don’t sound pushy, I just wanna see people live with less stress. I wish you the best of luck, friend.",
      "created_utc": 1744538437.0,
      "score": 10
    },
    {
      "id": "mn6t3n6",
      "body": "People screenshot me all the time haha I honestly just don’t care. I used to block IP addresses from the state that I live in, but I figured once I had enough of a following and made enough money I’d stop caring, and I did. I care about financial independence and security faaar more than I care if someone I know sees me naked.",
      "created_utc": 1744695112.0,
      "score": 1
    },
    {
      "id": "mmxgcsx",
      "body": "Its destructive in the future for yourself and for your child",
      "created_utc": 1744566117.0,
      "score": 2
    },
    {
      "id": "mmxgh2w",
      "body": "Very destructive for yourself and for your child. Especially in the future.",
      "created_utc": 1744566154.0,
      "score": 6
    },
    {
      "id": "mn3fjuu",
      "body": "She said “no pressure, just dinner and conversation” then “at the end of the night he handed me an envelope” - there (in theory) could be people getting this dinner chat service without the sex. The sentence is not too clear. She could have been ashamed of providing a no-sex companionship too or the dinner chat was just a starter for the upcoming things and she might have felt the weight of the path. Assumptions everywhere",
      "created_utc": 1744652023.0,
      "score": 1
    },
    {
      "id": "mmw6ltv",
      "body": "Thank you, likewise!",
      "created_utc": 1744551579.0,
      "score": 46
    },
    {
      "id": "mn33aw9",
      "body": "I suppose there’s validity to this, but I think his intent is to reassure her that her romantic life and future dating escapades aren’t simply dead because of this. I’m sure that’s a fear that goes through a lot of people’s minds in that industry; not being taken seriously and not being loved purely/ without judgment.",
      "created_utc": 1744648411.0,
      "score": 6
    },
    {
      "id": "mn21rsc",
      "body": "I love it! 💗",
      "created_utc": 1744636571.0,
      "score": 11
    },
    {
      "id": "mn2ym5x",
      "body": "what was her name in industry?",
      "created_utc": 1744646991.0,
      "score": 1
    },
    {
      "id": "mn05mcd",
      "body": "It's been quite accepted for many decades if not centuries in many European countries. I remember being fifteen and this streetworker grabbing me by my arm and and saying (paraphrasing,) \"Hey boy, I can teach you how it's done so you can impress girls. I'll give you a discount cause you're so cute.\" She was pretty. Late 20s maybe? I was tempted and mesmerized for a moment and then said something silly to get out of the situation and catch up to my buddies. This was in a red light/entertainment/clubbing district. Brothels, strip clubs, streetworkers everywhere. I finally went for one when I was 17 and inebriated late at night. Lots of my buddies had done it too around that age. She was very sweet and responsible. She was 27. Lots of older guys would talk about having done the same at that age as well. I do still wonder how low these sex workers were willing to go in terms of age. I look at old pictures of myself at 15 and I was clearly still very boyish looking. That part is messed up, I think.",
      "created_utc": 1744600345.0,
      "score": 3
    },
    {
      "id": "mn0ve8t",
      "body": "If she needs money to help us survive, I do not care. I want to live, not die because of “honor”",
      "created_utc": 1744613963.0,
      "score": 7
    },
    {
      "id": "mn5q5jv",
      "body": "I'm so sorry that happened but glad you were able to recover from it. Hope things are better now?",
      "created_utc": 1744678577.0,
      "score": 1
    },
    {
      "id": "mmw8dfh",
      "body": "Can I PM you for advice/questions on camming?",
      "created_utc": 1744552190.0,
      "score": 3
    },
    {
      "id": "mmzx9t2",
      "body": "My IT job?  Yeah.",
      "created_utc": 1744596855.0,
      "score": -1
    },
    {
      "id": "mmxhkjc",
      "body": "How?",
      "created_utc": 1744566494.0,
      "score": -7
    },
    {
      "id": "mn3llyn",
      "body": "This is not an assumption, it is *explicitly stated in the text* that she now has sex with at least some of her clients.\n\n> Eventually I started taking full-service clients.",
      "created_utc": 1744653764.0,
      "score": 1
    },
    {
      "id": "mn6ptbb",
      "body": "Asia Carrera I believe",
      "created_utc": 1744693313.0,
      "score": 2
    },
    {
      "id": "mn074np",
      "body": "Yeah that’s definitely odd with the big age difference. I was hooking up with a 22 year old at 15. When I was 22 I’d think about that whenever I saw boys that were 15/16 and how they still looked like kids to me.",
      "created_utc": 1744601011.0,
      "score": 6
    },
    {
      "id": "mn5qlkj",
      "body": "It’s all good. You live and you learn. But yes everything is much much much better now. Thank you! ☺️",
      "created_utc": 1744678734.0,
      "score": 1
    },
    {
      "id": "mmxn0al",
      "body": "Sure!",
      "created_utc": 1744568160.0,
      "score": 2
    },
    {
      "id": "mn106kj",
      "body": "Wdym how ? Many sex workers regret it. It's a job where you're left with zero dignity with yourself. Sex work is easy money but your future partners might turn you down cause of it, family and friends can find out and turn away from you, etc.",
      "created_utc": 1744617002.0,
      "score": 2
    },
    {
      "id": "mmz13z9",
      "body": "They think it's bad, so it's destructive, easy as that.",
      "created_utc": 1744584618.0,
      "score": -2
    },
    {
      "id": "mn4hey7",
      "body": "She focuses on the “kind man dinner” aspect, that’s why. She cried after.. what, a dinner with a nice guy?\n\nI’m not really interested in the “eventually” part since she doesn’t want us to be interested in that line at all.\n\nI look where the storytelling is happening. It has to have a point, a message “all guys are crap even if they are kind and seeking companionship (only)”\n\nI don’t know what to feel about the spotlight character/event. If you say “it’s not important” then I’d say she could’ve just typed “being a sex worker sucks” in a simple post. I’d still feel bad about her situation but there’s certain flow, probably with  intent underneath",
      "created_utc": 1744663368.0,
      "score": 1
    },
    {
      "id": "mn8moay",
      "body": "DMed. Thank you!",
      "created_utc": 1744727555.0,
      "score": 1
    },
    {
      "id": "mn10xmy",
      "body": "Other people being an asshole about your job is their problem. I'm a sex worker and I don't regret it at all, and my family and partner accepts me just fine. This is such an old world way of thinking. Like a \"woman's reputation\" bullshit. It's ridiculous.",
      "created_utc": 1744617501.0,
      "score": -2
    },
    {
      "id": "mn4lg17",
      "body": "\"This isn't told the way *I* think a story should be told, so obviously this isn't really about sex work.\"",
      "created_utc": 1744664597.0,
      "score": 2
    },
    {
      "id": "mn1120h",
      "body": "You don't regret it right now. Wait till you get older kid.\nIts not ridiculous. Many sex workers have talked about it",
      "created_utc": 1744617581.0,
      "score": 1
    },
    {
      "id": "mn2wl62",
      "body": "How old do I need to be? I'm not a kid, but thanks for being patronizing.",
      "created_utc": 1744646379.0,
      "score": 1
    },
    {
      "id": "mn346sv",
      "body": "Much older than what you're now. You're still young.",
      "created_utc": 1744648689.0,
      "score": 1
    },
    {
      "id": "mn42p0w",
      "body": "Can you give me a number lol",
      "created_utc": 1744658936.0,
      "score": 1
    }
  ]
}