{
  "id": "1hml41v",
  "title": "Called a su*cide hotline devastated; something the guy said immediately stopped my suicidality and it was surprisingly awkward",
  "selftext": "So for context my voice recently has been getting pretty deep with T (think bass-baritone deep.)\n\nGuy gendered me correctly the entire conversation, to my surprise (again this is all recent for me.) Got a lot of 'man's,' 'dude's,'\n\nBut as soon as he started talking to me, he was talking to me like a guy, and my suicidality just chucked itself out the nearest airlock. It was awkward af because I suddenly stopped being suicidal and didn't know how to carry on with the rest of the interaction.\n\nOnly halfway through I mentioned I'm trans. He was surprised but tried to hide it. Was bizarre too.\n\nAnyways, no idea why him gendering me correctly just stopped my suicidality like that (I've never experienced that before honestly,) as my reasons for suicidality had nothing to do with gender and more to do with the crippling isolation I face- but, was nice.\n\nAnd also he said other stuff that helped me ofc. Real nice guy. was interesting too, talked a bit about himself (I asked.)",
  "created_utc": 1735206029.0,
  "score": 6714,
  "num_comments": 214,
  "url": "https://www.reddit.com/r/offmychest/comments/1hml41v/called_a_sucide_hotline_devastated_something_the/",
  "comments": [
    {
      "id": "m3vets8",
      "body": "Validation is powerful. Active listening is powerful.",
      "created_utc": 1735220000.0,
      "score": 7040
    },
    {
      "id": "m3vgnqg",
      "body": "This is amazing! Can I ask did you call 988? I work in suicide prevention and I’m always curious about peoples experiences with 988 and suicide helplines. Wishing you all the best!",
      "created_utc": 1735220842.0,
      "score": 817
    },
    {
      "id": "m3viqof",
      "body": "Go get yourself an ice cream",
      "created_utc": 1735221785.0,
      "score": 323
    },
    {
      "id": "m3vhr8i",
      "body": "do you feel isolated? do you have friends?",
      "created_utc": 1735221342.0,
      "score": 74
    },
    {
      "id": "m3vwvnx",
      "body": "I'm so glad you had an affirming and compassionate experience, and it alleviated that suicidality. As a trans person who used to work 988, I'm incredibly happy to hear that you had a positive interaction with your counselor, even with their initial shock. Regardless of someone's trans or cis status the ultimate goal is to just *be there* for your caller.",
      "created_utc": 1735227450.0,
      "score": 58
    },
    {
      "id": "m3w7gp8",
      "body": "Happy for you brotha! Stay strong.",
      "created_utc": 1735231159.0,
      "score": 20
    },
    {
      "id": "m3xq0dp",
      "body": "I was on the hotline because my ex had been abusing me and I finally felt like I had enough - and a guy literally stopped me from doing it by basically asking me what I can do right now in the moment to distract myself. I said I had video games, then he asked if I liked GTA V, and if I did certain missions. He was like “dude you should play that, what do you have to eat?? Ramen?? Can you make some for me because im hungry right now and can’t eat” and i’ll never forget him. It’s been like 3 yrs and I still cry about it.",
      "created_utc": 1735249335.0,
      "score": 14
    },
    {
      "id": "m3z3epm",
      "body": "I think you're very likely not making the correlation between being validated, active listening and your deep sense of isolation, they all sound very interlinked and tied into your gender struggles \n\nPeople do not do well in isolation as much as we try and convince ourselves of that when we are struggling \n\nBeing heard and seen even by a stranger, even briefly can often be enough to snap us out of a dark place\n\nI'm so glad the hotline helped and I'm wishing you the best going forwards, wishing community and connection going forward for you",
      "created_utc": 1735267644.0,
      "score": 9
    },
    {
      "id": "m3w347z",
      "body": "Wishing you a lot of self-care and self-love. My ex of 8 years was a trans guy. I'm cis female. I never thought of him any differently than any other guy. I actually had wished he had been a little less old school masculine and a little more nurturing and sweet. Please take care of yourself. In NY, our queer community is huge and supportive and well-loved. Wishing you everything you need and want to feel joy.",
      "created_utc": 1735229662.0,
      "score": 7
    },
    {
      "id": "m3x4q28",
      "body": "Breaks my heart that all it took was a little validation for you to be ok and that you maybe haven’t had it before but I’m so fucking happy you found it and you’re still here.",
      "created_utc": 1735242172.0,
      "score": 8
    },
    {
      "id": "m3xo19z",
      "body": "Gald you're here dude. 💜 Says this newer girl.",
      "created_utc": 1735248668.0,
      "score": 8
    },
    {
      "id": "m3yjtzp",
      "body": "Hey, bud...glad you called:)",
      "created_utc": 1735260156.0,
      "score": 8
    },
    {
      "id": "m3yd00g",
      "body": "Some times all it takes is one little thing to remind us life is worth living. I'm glad you found something that reminded you to stay here. I hope things get better.",
      "created_utc": 1735257611.0,
      "score": 7
    },
    {
      "id": "m3zjl00",
      "body": "I have a shirt that says \"gender affirming care saves lives\". This is exactly what that means. Glad you're still here bro.",
      "created_utc": 1735274315.0,
      "score": 7
    },
    {
      "id": "m3wpqib",
      "body": "Happy and proud of you, man✊🏼. Pls remember you do fr matter, and you’re meant to be here. The world is better with you around 🙏🏼💙.",
      "created_utc": 1735237257.0,
      "score": 12
    },
    {
      "id": "m3vewv8",
      "body": "Glad you’re still here!! \n\nPlease remember that the s-word is long term solution for a short term issue.  Enjoy your life and live it to the fullest 💥👍🏼🫡",
      "created_utc": 1735220040.0,
      "score": 47
    },
    {
      "id": "m3wp1gm",
      "body": "You belong here. Please stay 💗",
      "created_utc": 1735237027.0,
      "score": 9
    },
    {
      "id": "m3xmyo8",
      "body": "You were humanized. Someone listened to you and made you feel heard. That's great, man. It's a reminder that you need more of those moments, so go find those moment. Find someone that can do that for you... a friend",
      "created_utc": 1735248312.0,
      "score": 12
    },
    {
      "id": "m40km93",
      "body": "Good to hear you’re still here!",
      "created_utc": 1735296536.0,
      "score": 5
    },
    {
      "id": "m3vuje8",
      "body": "Hell Yeah dude!",
      "created_utc": 1735226596.0,
      "score": 5
    },
    {
      "id": "m3x7utf",
      "body": "hell yeah dude",
      "created_utc": 1735243220.0,
      "score": 3
    },
    {
      "id": "m3xeqc8",
      "body": "He gave you validation on who you are. I hope you’re doing better.",
      "created_utc": 1735245553.0,
      "score": 4
    },
    {
      "id": "m3y7eg2",
      "body": "I'm really glad you're better now, bro. Life's hard, be harder.",
      "created_utc": 1735255533.0,
      "score": 4
    },
    {
      "id": "m3y7xjx",
      "body": "Being validated is a huge deal!",
      "created_utc": 1735255729.0,
      "score": 4
    },
    {
      "id": "m3yx2m6",
      "body": "I rang once and the guy kept getting my name wrong,   and I had a bizarre sort of 'out of the current emotion' moment where I went from finding it frustrating to suddenly finding it hilarious. \nI could just imagine it happening in something like Fleabag and just picture the annoyed look she'd give the camera and it snapped me out of the feeling for a bit.",
      "created_utc": 1735265159.0,
      "score": 4
    },
    {
      "id": "m3z6ne7",
      "body": "It sounds like you were able to feel validated. Seen, heard. \n\nI hope you’re able to find more people who are able to make you feel like that. ♥️",
      "created_utc": 1735268932.0,
      "score": 4
    },
    {
      "id": "m3z7v4r",
      "body": "Crisis counselor here! I’m so glad you felt comfortable reaching out to us. Our goal is to make sure everyone feels heard, understood, and supported. We recently had a training on inclusion and best practices, and it’s amazing to hear that it’s made a difference for someone like you. Please don’t hesitate to reach out anytime—we’re here 24/7. And if you’d like, we can arrange regular follow-ups to check in and see how you’re doing. Wishing you all the best as you move forward!",
      "created_utc": 1735269406.0,
      "score": 3
    },
    {
      "id": "m3z90bh",
      "body": "Thanks for sharing your experience! Also so glad you’re still here! Sending a hug for a better day! You’re not alone!",
      "created_utc": 1735269871.0,
      "score": 4
    },
    {
      "id": "m3zj8mc",
      "body": "So happy to hear this OP! Validation is the best!",
      "created_utc": 1735274156.0,
      "score": 3
    },
    {
      "id": "m3zpuix",
      "body": "I think your struggle with extreme isolation is why him gendering you correctly was so powerful - you were seen as you wanted to be seen, right off the bat, no weirdness or coaxing or try-harding about it. Just a casual call to the suicide hotline and your whole identity was seen and validated. That's very deep and meaningful to people, especially people with little human interaction.\n\nAlso, as corny and annoying as it is, it does get better. I've been isolated most of my life, and also called the suicide hotline numerous times (and put on hold or nobody answered). There's light at the end of the tunnel. It's just a long ass tunnel sometimes.",
      "created_utc": 1735277296.0,
      "score": 4
    },
    {
      "id": "m3zwvn9",
      "body": "I’m glad you’re here op. Big hugs & live your best life ~my inbox always open friend",
      "created_utc": 1735281085.0,
      "score": 3
    },
    {
      "id": "m3xfwxa",
      "body": "I was texting the help line once... And it was the sheer.. stupidity or cringeness from the person that helped me snap out of it.\n\nShe kept calling me mommy. And kept repeating \"you're mommy so you need to stay for your kids\" and that was it. My kids don't even call me mommy. I'm mama. \n\nI got so pissed because I was like \"I'm more than a mom you know..\"\n\nBut then the police dragged me out of the car.\n\nBut I got to say she was pissing me off so much.. it did help ahah",
      "created_utc": 1735245949.0,
      "score": 11
    },
    {
      "id": "m3w4fwh",
      "body": "It’s because you finally felt heard and seen and wanted to be recognized how you see yourself. I’m glad you are no longer feeling suicidal 💕",
      "created_utc": 1735230121.0,
      "score": 6
    },
    {
      "id": "m3w0zc0",
      "body": "Hey man hope you live a long happy life!!",
      "created_utc": 1735228907.0,
      "score": 3
    },
    {
      "id": "m3wy382",
      "body": "I don’t know what to say but I wish you all the best.",
      "created_utc": 1735239989.0,
      "score": 3
    },
    {
      "id": "m3x30xe",
      "body": "I am so happy to read this! Glad you’re okay.",
      "created_utc": 1735241609.0,
      "score": 3
    },
    {
      "id": "m3x69fs",
      "body": "Hope can do a lot for us. \n\nYou’re seeing glimmers of your life from here on out, feeling and being more yourself, physically (and hopefully happier too)",
      "created_utc": 1735242684.0,
      "score": 3
    },
    {
      "id": "m3xa0ih",
      "body": "I totally understand. Hugs",
      "created_utc": 1735243954.0,
      "score": 3
    },
    {
      "id": "m3yuh31",
      "body": "Dang. This is amazing. 988 has usually sounded very scripted for me. I’m glad some people on the other end sound more human.",
      "created_utc": 1735264153.0,
      "score": 3
    },
    {
      "id": "m3zz10g",
      "body": "Crippling isolation often comes with being trans so it makes sense to me that being validated made you feel a little less isolated. Being trans often comes with feeling like most of the world just doesn't see you as your real self and it feels less lonely when someone does see you the way you see yourself. I hope you get to have more and more people around, whether irl or digitally, that help you feel truly seen. You're not alone. We have a whole community worldwide, throughout history and across so many cultures, and we'll continue to thrive 🩵🩷",
      "created_utc": 1735282307.0,
      "score": 3
    },
    {
      "id": "m41abl5",
      "body": "If you’re feeling isolation… being gendered correctly might have made you feel seen and a little less alone or “other” or … isolated :) \n\nI also think some people just have that effect too though, bless that man",
      "created_utc": 1735309621.0,
      "score": 3
    },
    {
      "id": "m3vm17n",
      "body": "I'm glad your kicking around still friend. I believe in you so much. Let's be friends!",
      "created_utc": 1735223218.0,
      "score": 4
    },
    {
      "id": "m3xpyr0",
      "body": "I was on the suicide hotline because my ex had been abusing me and I finally felt like I had enough - and a guy literally stopped me from doing it by basically asking me what I can do right now in the moment to distract myself. I said I had video games, then he asked if I liked GTA V, and if I did certain missions. He was like “dude you should play that, what do you have to eat?? Ramen?? Can you make some for me because im hungry right now and can’t eat” and i’ll never forget him.",
      "created_utc": 1735249319.0,
      "score": 4
    },
    {
      "id": "m3xzcqc",
      "body": "\"Chucked itself out the nearest airlock\" I just wanna say I really appreciate the DS9 reference here",
      "created_utc": 1735252588.0,
      "score": 4
    },
    {
      "id": "m3vmtuk",
      "body": "So happy it worked for you, dude.\n\nLife is worth living for.\n\nCheers, wish you the best :)",
      "created_utc": 1735223548.0,
      "score": 7
    },
    {
      "id": "m3wr4nw",
      "body": "I'm sorry you are going through that. I've thought a lot about calling the line recently. ♥️",
      "created_utc": 1735237713.0,
      "score": 2
    },
    {
      "id": "m3x3ld5",
      "body": "There is a place for all of us my friend. You may be isolated right now, but nothing is forever. Keep hope! What you need is out there just keep holding on.",
      "created_utc": 1735241797.0,
      "score": 2
    },
    {
      "id": "m3yrans",
      "body": "[removed]",
      "created_utc": 1735262948.0,
      "score": 2
    },
    {
      "id": "m46iedc",
      "body": "I'll just say I'm honestly happy God put him in your path.",
      "created_utc": 1735386164.0,
      "score": 2
    },
    {
      "id": "m4br7u6",
      "body": "Being heard and being validated is both amazingly powerful feelings. Some of my worst days have been turned around by a stranger who was super nice and also gendered me correctly",
      "created_utc": 1735459528.0,
      "score": 2
    },
    {
      "id": "m597pe3",
      "body": "I’ve had experiences like this before, where intense feelings, even suicidal ones, suddenly dissipate. It’s like it all suddenly is a mirage that goes away. I found such experiences, if reflected on, to lead to some really profound places.",
      "created_utc": 1735942189.0,
      "score": 2
    },
    {
      "id": "m3xx09k",
      "body": "as a dude who has a high voice [fellow trans brother here], i think i'd cry of happiness genuinely. i'm so happy for you man. :]",
      "created_utc": 1735251751.0,
      "score": 5
    },
    {
      "id": "m3x9vy8",
      "body": "Hell yeah brother!!! I think a lot of people don’t realize the toll masking your identity takes on your mental health. Being validated can be so valuable and heartening! May you have many more positive experiences that remind you that life is worth living!! ❤️‍🩹 🏳️‍⚧️",
      "created_utc": 1735243911.0,
      "score": 2
    },
    {
      "id": "m3xoe1g",
      "body": "I'm so glad you had this experience.  Sometimes just being acknowledged means a hell of a lot more than people think it will.",
      "created_utc": 1735248785.0,
      "score": 2
    },
    {
      "id": "m3xtfsu",
      "body": "Nice to read that it worked! Glad you are together with us. We just gotta keep going no matter how hard it gets.",
      "created_utc": 1735250497.0,
      "score": 2
    },
    {
      "id": "m420h5r",
      "body": "These are the types of people that should be working on suicide hotlines— someone who is personable, affirming, and caring. I’m glad you called and are still here today :) Congrats on your transition too!",
      "created_utc": 1735318592.0,
      "score": 1
    },
    {
      "id": "m43khdf",
      "body": "Someone getting something right about you isn't intense moment of connection for somebody who spends enough time isolated. Connection with other humans is the solution to many mental issues that anybody faces. I hope you're able to get enough to make it better",
      "created_utc": 1735336603.0,
      "score": 1
    },
    {
      "id": "m4stq4a",
      "body": "If you genitals don't affirm your gender why does cutting them off affirm your gender?",
      "created_utc": 1735703282.0,
      "score": 1
    },
    {
      "id": "m4ypuhc",
      "body": "You got a release of endorphins from him calling you that. You need to release more endorphins that make you feel good do more things that make you feel good. You don't need others to validate you. Although it's a source of endorphins it's not the only one. Find peace in things you can do by yourself too. \n\n\nWe all struggle with suicidal thoughts in isolation it's not unusual. ",
      "created_utc": 1735793499.0,
      "score": 1
    },
    {
      "id": "m4z2z4e",
      "body": "Did he survive ",
      "created_utc": 1735800530.0,
      "score": 1
    },
    {
      "id": "manxsk3",
      "body": "\"Hmm trans people are more likely to off themselves. Must be regret from transition right?? Right????\"",
      "created_utc": 1738547984.0,
      "score": 1
    },
    {
      "id": "m3vn7uu",
      "body": "Your a man. You either do it or don't but you don't talk about it, this is very masculine of you. So props on doubling down dude.",
      "created_utc": 1735223706.0,
      "score": -29
    },
    {
      "id": "m3vi85a",
      "body": "This is very real- the power behind those things... listening like that is something I hope to master someday.\n\nAnd yes, for sure validation is wildly effective.",
      "created_utc": 1735221554.0,
      "score": 1805
    },
    {
      "id": "m3xk9wr",
      "body": "In my experience when one person is upset and telling someone else about it, the other person almost always immediately says some variation of “well it’s not that bad, here’s what you should do”. Basically tells them they’re wrong, or their feelings are not valid. It’s “sitcom problem solving”: jumping over the necessary steps of anger, resentment, sadness, and straight into problem solving before the person with the problem is capable of getting there. Just tell someone you hear them, maybe have felt that way before yourself, and let them feel seen and understood. I would say don’t even say “but” and offer a suggestion until they ask for help.",
      "created_utc": 1735247409.0,
      "score": 26
    },
    {
      "id": "m3vi2fb",
      "body": "Yes! Lol. I find it can be helpful, I am a bit of a repeat customer so to speak. \n\nTo other lines as well. It doesn't always help but it really can a lot. \n\nI'm my experience, most of the time people at the 988 are passionate about helping, which makes things genuine and beautiful. They deserve all their roses.",
      "created_utc": 1735221482.0,
      "score": 538
    },
    {
      "id": "m3xuga2",
      "body": "the first time i called i got a girl with the same name as me. It’s not a common name either. i took it as a sign of some alternate version of me telling me not to kill myself lol.",
      "created_utc": 1735250849.0,
      "score": 27
    },
    {
      "id": "m3z13nj",
      "body": "I called 988 once, not because I was feeling suicidal but I was having a panic attack at 4am and didn't want to wake up any of my friends.\n\nThe guy was *super awesome.* Just talked me through it, taught me the 54321 brain hack to stop the attack, and then just sat on the line and talked with me until he was sure I was comfortable and ready to go back to sleep. \n\nHe did ask a few times if I was feeling like self-harming, I assured him I wasn't, I love life and I would never put my loved ones through that, I just googled help lines and that was the first one that came up so I called it because I could barely see or breathe. He was still extremely accommodating and helpful.\n\nI hope I never have to do it again but it was still a 12/10 experience. Wish I could give that guy a review, he was one of the kindest people I've ever talked to.",
      "created_utc": 1735266733.0,
      "score": 16
    },
    {
      "id": "m3vjhfy",
      "body": "Got myself a milkshake, was nice treat :)",
      "created_utc": 1735222118.0,
      "score": 251
    },
    {
      "id": "m3vkd26",
      "body": "Yeah, pretty isolated. I have a brother I barely see, and a friend I barely see. Like once every few months maybe. That's it- I don't work or go to school, I pretty much just stay in my apartment (because there's not a lot to do if you're broke) and just rot, lol. \n\nI'm hoping to change that, but it's been a nightmare navigating the health system in the US, so I haven't been able to get my ADHD or back issues properly taken care of.",
      "created_utc": 1735222504.0,
      "score": 111
    },
    {
      "id": "m3xnmrg",
      "body": "Yeah, I love it when I disclose my trans status and just get treated like a human being still. Was really cool.",
      "created_utc": 1735248536.0,
      "score": 16
    },
    {
      "id": "m3xp45w",
      "body": "Thank you, definitely a goal 💪",
      "created_utc": 1735249030.0,
      "score": 5
    },
    {
      "id": "m3y3ccp",
      "body": "That's epic. Little things like that can really change a life. That's beautiful.",
      "created_utc": 1735254026.0,
      "score": 4
    },
    {
      "id": "m3zavkq",
      "body": "Actually my being isolated has less to do with gender and more to do with PTSD, I think- I actually live in a huge epicenter of trans and queer folks! It's just been hard to leave my apartment, get out there, talk to people because I was so isolated growing up (also nothing to do with gender for the most part.)\n\nBut yes, I agree with everything else you're saying. And Also I am glad they were able to help me, that was pretty cool.",
      "created_utc": 1735270630.0,
      "score": 3
    },
    {
      "id": "m3xolif",
      "body": "Thank you! Sorry to hear your ex was a little rough around the edges. \n\nI will try my best to take care of myself lol. Thank you. \n\nI definitely want to at least visit New York one day, if not move out there, for the theatre scene. \nRight now I live in the Bay Area of California, right next to a trans and queer hotspot, and it can be great.",
      "created_utc": 1735248855.0,
      "score": 3
    },
    {
      "id": "m3xwr67",
      "body": "Thank you :) it was so good, lol. \n\nI'm happy too. 🖤",
      "created_utc": 1735251660.0,
      "score": 2
    },
    {
      "id": "m3y0owi",
      "body": "Thank you! I'm glad you're here too 🖤",
      "created_utc": 1735253060.0,
      "score": 4
    },
    {
      "id": "m3ypth7",
      "body": "Thanks, I am too. :)",
      "created_utc": 1735262386.0,
      "score": 3
    },
    {
      "id": "m3yd72a",
      "body": "Thank you, I do too :3",
      "created_utc": 1735257684.0,
      "score": 1
    },
    {
      "id": "m3zk4w1",
      "body": "Thank you, I'm glad too. \n\nAnd that's an awesome shirt, makes me want to make a patch for my battle jacket.",
      "created_utc": 1735274568.0,
      "score": 2
    },
    {
      "id": "m3xq9m1",
      "body": "Thank you 🩵 I will definitely do my best to remember this friend, that's very kind",
      "created_utc": 1735249416.0,
      "score": 3
    },
    {
      "id": "m3vi4fa",
      "body": "Thank you, true. :)",
      "created_utc": 1735221507.0,
      "score": 15
    },
    {
      "id": "m3xq2hw",
      "body": "Thank you, I'll do my best 🩵",
      "created_utc": 1735249351.0,
      "score": 7
    },
    {
      "id": "m3y0ket",
      "body": "Real! I'll definitely seek more of those moments consciously now.",
      "created_utc": 1735253016.0,
      "score": 2
    },
    {
      "id": "m40lrat",
      "body": "Thank you :)",
      "created_utc": 1735297267.0,
      "score": 3
    },
    {
      "id": "m3xn2g5",
      "body": "Hell yeah",
      "created_utc": 1735248348.0,
      "score": 2
    },
    {
      "id": "m3xx35o",
      "body": "Hell yeah",
      "created_utc": 1735251780.0,
      "score": 1
    },
    {
      "id": "m3xyqhk",
      "body": "That is true. Thank you, yes I believe I am.",
      "created_utc": 1735252368.0,
      "score": 2
    },
    {
      "id": "m3y8ch1",
      "body": "I love that, I will incorporate it into my mantras. Also, I'm going to start doing mantras. Lol",
      "created_utc": 1735255885.0,
      "score": 1
    },
    {
      "id": "m3y8iha",
      "body": "It definitely is! Wow, how powerful that can be.",
      "created_utc": 1735255947.0,
      "score": 3
    },
    {
      "id": "m3yxn42",
      "body": "Lol I've definitely had some interactions like that too. I find it hilarious in an absurd way- though I am already a fan of absurdist humor tbf",
      "created_utc": 1735265385.0,
      "score": 3
    },
    {
      "id": "m3zb27u",
      "body": "Thank you! Me too. There are so many lovely supportive people here as well. This is a great sub <3",
      "created_utc": 1735270706.0,
      "score": 4
    },
    {
      "id": "m3zbd34",
      "body": "Thank you! Yeah you provide invaluable services, thank you so much and you deserve all your roses for real. <3",
      "created_utc": 1735270830.0,
      "score": 2
    },
    {
      "id": "m3zbfs6",
      "body": "Thank you! \n\nI'm glad too. Sending one back <3",
      "created_utc": 1735270860.0,
      "score": 3
    },
    {
      "id": "m3zk1cp",
      "body": "It really is, 😄 \n\nI think I'm starting to understand myself better",
      "created_utc": 1735274523.0,
      "score": 4
    },
    {
      "id": "m40fvdm",
      "body": "Thank you! Mine too friend :3 I appreciate you. Big hugs + good vibes back at you",
      "created_utc": 1735293372.0,
      "score": 1
    },
    {
      "id": "m3xzskv",
      "body": "Wow that's a crap experience, I'm so sorry you had to deal with that. People think that at if you're a parent, especially a mother, that your kids and your status as a parent will stop you from being suicidal. It's a rather childlike perception, I think people have it because deep down they feel they couldn't accept that their own parents might have felt differently given the circumstances and the idea scares and saddens them. \n\nPeople who haven't experienced trauma surrounding their parents' mortality yet I guess. \n\nI've had some bad experiences with hotlines too, once the person just told me I shouldn't consider myself disabled because I can walk, and that I need to just get a job and get off of government assistance to feel 'worthy of life' lol.\n\nBut calling you 'mommy' is just... Very strange lol (I'd be pissed too)",
      "created_utc": 1735252743.0,
      "score": 5
    },
    {
      "id": "m3xot6c",
      "body": "Thank you :) I believe this is the answer. \n\nMagical stuff, and yes love I'm glad too",
      "created_utc": 1735248927.0,
      "score": 1
    },
    {
      "id": "m3xnvz6",
      "body": "Thank you, to you as well :)\n\nIt's humans can get through this weirdness if we persevere and really on each other.",
      "created_utc": 1735248620.0,
      "score": 2
    },
    {
      "id": "m3xvp4t",
      "body": "Thank you, to you as well :)",
      "created_utc": 1735251286.0,
      "score": 2
    },
    {
      "id": "m3xvwek",
      "body": "Me too, thank you :)",
      "created_utc": 1735251357.0,
      "score": 1
    },
    {
      "id": "m3xx1bh",
      "body": "I believe I am :)\n\nHappiness is only one random event away at all times",
      "created_utc": 1735251762.0,
      "score": 2
    },
    {
      "id": "m3xxlit",
      "body": "Hugs 🖤",
      "created_utc": 1735251963.0,
      "score": 2
    },
    {
      "id": "m3yxguk",
      "body": "I've definitely gotten that too, but I'm also very happy to report that that isn't all the time, and also that even when they have to relay scripted things as part of the gig, they can also be quite human and genuine around that.",
      "created_utc": 1735265315.0,
      "score": 3
    },
    {
      "id": "m40e0lq",
      "body": "Real, I guess. That's crazy sad. Damn\n\nI hope I get around more people too, for real.\n\nThank you so much for saying all of this and taking the time, I really appreciate you so much. <3",
      "created_utc": 1735292106.0,
      "score": 2
    },
    {
      "id": "m44dk3b",
      "body": "I agree I think with everything said, and also I relate to your username lol",
      "created_utc": 1735346931.0,
      "score": 1
    },
    {
      "id": "m3yu9ue",
      "body": "That is epic. I'm so glad you decided to stick around, and that you got what you needed out of that interaction. Invaluable.",
      "created_utc": 1735264077.0,
      "score": 2
    },
    {
      "id": "m3y7a11",
      "body": "Thank you! I just started using this in my everyday vocabulary and you're legitimately the first to notice. It's been like seven or eight years, lol.",
      "created_utc": 1735255488.0,
      "score": 2
    },
    {
      "id": "m3vpfv9",
      "body": "Thank you! I appreciate that. Cheers, you too :)",
      "created_utc": 1735224618.0,
      "score": 6
    },
    {
      "id": "m3xr5kx",
      "body": "I'm so sorry you've been feeling this way. Maybe you should! There are also other lines that you might be able to call if you don't feel comfortable calling 988 for whatever reason (cops, unsure about suicidality, etc.) like, in California the California Peer-Run Warm Line, or demographic - specific hotlines like the Trevor Project. \n\nI really hope you find what you need in calling these numbers, and if you want to talk about anything I'm here too. \n\nRemember that what you're feeling is perfectly valid, and also that the world is so freaking big, and is there for so much adventure both literally and metaphorically.",
      "created_utc": 1735249717.0,
      "score": 1
    },
    {
      "id": "m3xvzcm",
      "body": "Thank you :) I will do my best to stick around.",
      "created_utc": 1735251387.0,
      "score": 1
    },
    {
      "id": "m3yuevd",
      "body": "Yes I did! Was beautiful.",
      "created_utc": 1735264129.0,
      "score": 1
    },
    {
      "id": "m3z97fy",
      "body": "That I did :)",
      "created_utc": 1735269950.0,
      "score": 1
    },
    {
      "id": "m46jecd",
      "body": "Me too, he was epic.",
      "created_utc": 1735386794.0,
      "score": 1
    },
    {
      "id": "m4btfzt",
      "body": "It is so much more powerful than I suspected it would be at first",
      "created_utc": 1735460947.0,
      "score": 1
    },
    {
      "id": "m3y71gh",
      "body": "Thank you! Unsure why you were downvoted, I feel you, my voice was so high for the first 23 years of my life. But even if your voice never gets super deep, it shouldn't stop you from getting correctly gendered. I wish you all the best brother 🩵",
      "created_utc": 1735255401.0,
      "score": 6
    },
    {
      "id": "m3xxk2f",
      "body": "Thank you! Yes, I'm very excited about what the future holds. I'm very intrigued to think of all the adventures I will go on. \n\nLife is bizarre lol",
      "created_utc": 1735251948.0,
      "score": 2
    },
    {
      "id": "m3y11mt",
      "body": "This is so real! It's almost hilarious in its absurdity that that was all it took. But also very sad to think, how many people are feeling similarly?",
      "created_utc": 1735253187.0,
      "score": 2
    },
    {
      "id": "m3y6e84",
      "body": "Thank you! Very true friend :)",
      "created_utc": 1735255163.0,
      "score": 1
    },
    {
      "id": "m4t3vt6",
      "body": "TLDR\nYou're right that it is not required (for everyone) to get surgeries of any kind to affirm their gender! \n\n\n\nNot that at I'm your guide to all things trans, but everyone is different. \n\nYou're right, genitals don't affirm gender solely, single-handedly, or all of the time. \n\nWhat about cis people who get plastic surgery on their genitals to affirm their genders? \n\nYou need to start with the concept of dysphoria itself here. \n\nDo you need to feel like you need to alter your body to be \"more feminine\" or \"more masculine\" if you are cis? \n\nNo, but many cis people seek gender affirming care, whether that be putting on makeup, certain clothes, the right cologne, or getting plastic surgeries to alter genitals or certain aspects of their physiques tied to their perception or social perception of gender. \n\nThere are cis men who get phalloplasty for example, either to get back a penis they lost, or to get one that they feel is 'substantial' because they have one they feel is too small.\n\nAnd, there are many cis people don't feel like they need to seek those things. \n\nJust like trans people. \n\nYou don't need dysphoria to be trans, nor is dysphoria only affecting or always affecting one's relationship to their body, or to certain aspects of it. \n\nGender is a lot bigger than genitals. \n\n(I feel like I should clarify- I'm a trans man, so in the case that I did want to get any GAC surgeries to do with my genitals, that would likely be metoidioplasty/phalloplasty, not vaginoplasty. Also, vaginoplasty is not simply 'cutting off' a body part, and the way you worded that can be seen as hurtful by many trans women.)\n\n\nBut you're right that it is not required (for everyone) to get surgeries of any kind to affirm your gender!",
      "created_utc": 1735708332.0,
      "score": 1
    },
    {
      "id": "m4z4ckl",
      "body": "Did I survive? Or who",
      "created_utc": 1735801360.0,
      "score": 1
    },
    {
      "id": "manyxv7",
      "body": "Haha right? \n\nI get irritated when it's so damn easy to look up stats on this",
      "created_utc": 1738548360.0,
      "score": 1
    },
    {
      "id": "m3xp7fb",
      "body": "That's not right. I work in a very manly environment (part of construction crew). Even we share our problems and doubts with each other. It ain't weak to show emotions, you just carried them far too long, besides we help brothers out. Comradery and all!",
      "created_utc": 1735249060.0,
      "score": 1
    },
    {
      "id": "m3wmekb",
      "body": "You also mentioned feeling isolated. Maybe, subconsciously, this experience you are going through feels isolating, and being included and validated in such a stressful conversation made the world feel more open and accepting. Many feelings can be connected without realizing the impact.",
      "created_utc": 1735236151.0,
      "score": 407
    },
    {
      "id": "m3xpgw2",
      "body": "Are there any LGBT or trans support groups in your local Facebook groups? I've been isolated in my life due to chronic, invisible illnesses. The folks I've met through my local groups can relate to my experiences, validate my invisible symptoms, and have helped heal my spirit so much",
      "created_utc": 1735249148.0,
      "score": 47
    },
    {
      "id": "m3yjsx1",
      "body": "I saw a statistic and Lord help me I wish I knew what book it’s from, but it said that over 60% of trans people who are misgendered are driven to suicide. Literally using new names, new pronouns, etc. can save a trans persons life. \n\nI’m glad OP got help and was able to overcome the suicidal thoughts. I’ve been there and I know the struggle. I’m so proud of you for calling for help. It’s a hard call but you were so incredibly brave. Keep up the good work. Make sure you have a regular therapist to follow up with. And know that you are loved.",
      "created_utc": 1735260145.0,
      "score": 21
    },
    {
      "id": "m3vjdej",
      "body": "I’m so happy to hear that! I endorse them a lot so I always want to make sure people are having good experiences",
      "created_utc": 1735222067.0,
      "score": 141
    },
    {
      "id": "m3wms0p",
      "body": "Also repeat customer of the 988 veterans line. Never had any complaints, they always seemed really nice. I’m sure some people had bad experiences, naturally nothing can be 100% perfect. I do recommend it to anyone who needs assistance ASAP and not to let others’ negative experiences prevent them from seeking lifesaving help. \n\nAnd yes, depending on what you say, they might be required to send emergency services to talk to you. It’s embarrassing and inconvenient, but better than being dead, or in excruciating pain from a failed attempt, for a friend or family member to find",
      "created_utc": 1735236275.0,
      "score": 36
    },
    {
      "id": "m3xy1fa",
      "body": "I love that!!",
      "created_utc": 1735252122.0,
      "score": 10
    },
    {
      "id": "m3ytzdz",
      "body": "Doppelgangers go hard omfg\n\nHell yeah",
      "created_utc": 1735263967.0,
      "score": 2
    },
    {
      "id": "m3z5xej",
      "body": "Omg this is awesome! Yes I try to tell people that you don’t need to be suicidal to use 988. You can even just use it if you have general mental health questions. I know parents sometimes use it for support with their kids too. I’m so happy they were able to help you!",
      "created_utc": 1735268642.0,
      "score": 7
    },
    {
      "id": "m3vmtoh",
      "body": "What flavor?",
      "created_utc": 1735223546.0,
      "score": 69
    },
    {
      "id": "m3vw1jl",
      "body": "Are fantasy and geeky things up your alley? I really can't speak highly enough of D&D and how great it is for making friends and providing regular social interaction. There's a good chance you've got some tabletop gaming shops near you and those shops will often have regular D&D days where you can pay a small fee to play or they might even have board in store with flyers from other people looking to find a group.",
      "created_utc": 1735227149.0,
      "score": 22
    },
    {
      "id": "m3vln5f",
      "body": "thats hard man. what do you do to cope?",
      "created_utc": 1735223056.0,
      "score": 20
    },
    {
      "id": "m3xqbhe",
      "body": "I'd love to be in the Bay Area! I'm glad you are in a great liberal area of the country! NY is such a bubble, I forget sometimes how awful the rest of the country can be.",
      "created_utc": 1735249434.0,
      "score": 3
    },
    {
      "id": "m3xt6w7",
      "body": "You’re more than welcome and I’m glad to hear that, much love for you🫶🏼. Feel free to reach out if you ever need someone, anytime! I’ll do what I can to be of any support and encouragement. \n& thank you too, btw. I do try to always be, you just never know. Grateful for your existence 🙏🏼",
      "created_utc": 1735250411.0,
      "score": 3
    },
    {
      "id": "m40ltct",
      "body": "Chin up mate.  I wish you all the best!",
      "created_utc": 1735297305.0,
      "score": 3
    },
    {
      "id": "m3y8qnf",
      "body": "stole it from a God's Hate song, been living by it for a while, makes the really shitty parts of living just a bit easier tho",
      "created_utc": 1735256032.0,
      "score": 2
    },
    {
      "id": "m3z3dfd",
      "body": "thank you! you too.",
      "created_utc": 1735267630.0,
      "score": 2
    },
    {
      "id": "m46zkbh",
      "body": "Even more you're answering, OP. Please stay",
      "created_utc": 1735395098.0,
      "score": 2
    },
    {
      "id": "m3y4xci",
      "body": "Agreed.  It's one of those things where it SHOULD be so normal as to not even be notable, but unfortunately we exist in a society where it is.  I'm really, really glad you had a positive experience here.",
      "created_utc": 1735254613.0,
      "score": 2
    },
    {
      "id": "m4tatd7",
      "body": "I think you're jumping through alot of hoops on this one. Putting on a certain scent or makeup or a man getting plastic surgery to enlarge his penis is inconsequential compared to a woman cutting off her breasts or a man removing his penis and testicles. Why not just tell the truth?",
      "created_utc": 1735712230.0,
      "score": 1
    },
    {
      "id": "m4z4fon",
      "body": "Yes",
      "created_utc": 1735801414.0,
      "score": 2
    },
    {
      "id": "mao2ixw",
      "body": "They hardly know how to use a keyboard",
      "created_utc": 1738549537.0,
      "score": 1
    },
    {
      "id": "m43c77a",
      "body": "I mean men don't do that when it comes to suicide, they don't seek help or assistance they just kill themselves. There's a buncha stats on it like by age eighty if your male there is like 80% chance you'll top yourself.",
      "created_utc": 1735333893.0,
      "score": 1
    },
    {
      "id": "m3yubzn",
      "body": "This /\\\\ 100%",
      "created_utc": 1735264099.0,
      "score": 0
    },
    {
      "id": "m3xpkvw",
      "body": "I love your theory- that makes sense on many levels. Thank you for sharing your thoughts",
      "created_utc": 1735249185.0,
      "score": 175
    },
    {
      "id": "m3y35w4",
      "body": "I believe so! Honestly, it is hard for me to strike up conversations with people, lol. I am on VR chat a lot and it's really hard to start a conversation. I think I'm shy",
      "created_utc": 1735253960.0,
      "score": 27
    },
    {
      "id": "m3yp7zv",
      "body": "There's some mechanism in my brain that tells me that that just makes sense. It may seem strange, but I'm sure that being misgendered has almost driven me to suicide more than once.",
      "created_utc": 1735262157.0,
      "score": 14
    },
    {
      "id": "m3vjvzd",
      "body": "I really respect that, making sure people are getting what they need from a resource before recommending it. You freaking rule",
      "created_utc": 1735222296.0,
      "score": 94
    },
    {
      "id": "m3x1h9o",
      "body": "Agreed! And some times that doesn’t always mean involuntary hospitalization. Sometimes that just means going to a crisis stabilization center to talk to a psychiatrist and see if you need immediate medication. And it also doesn’t always mean a 72 hour hold - it can just be for an assessment and to ensure you aren’t in immediate danger and then they let you go.",
      "created_utc": 1735241107.0,
      "score": 8
    },
    {
      "id": "m3xpwa3",
      "body": "This! Although I don't agree with sending cops in these situations, sending a mobile crisis team with a counselor and paramedic is essential",
      "created_utc": 1735249289.0,
      "score": 4
    },
    {
      "id": "m3z9354",
      "body": "He was great! I got the impression that he just wanted to help, it didn't need to be that specific kind of help. I'm guessing they just find kind people to be kind to other people and that's just the resource that's advertised.",
      "created_utc": 1735269902.0,
      "score": 3
    },
    {
      "id": "m3vp5vo",
      "body": "Chocolate with extra chocolate syrup and cherries from Jack In The Box :3 \n\nIt would have been a mix of butter pecan and Phish Food from Ben & Jerry's but I didn't have the money lolol",
      "created_utc": 1735224506.0,
      "score": 126
    },
    {
      "id": "m3xndpa",
      "body": "Honestly I've thought about this a lot, I should probably jump on it. I've always wanted to do that",
      "created_utc": 1735248453.0,
      "score": 23
    },
    {
      "id": "m3vmmxr",
      "body": "A lot! Actually, I have what I'm sure would be a deeply fulfilling and rich personal life, if it was paired with regular social interaction. \n\nI have lots of interests, hobbies, goals, and escapist activities. \n\nI pick up a new hobby every week, and I've had to be pretty creative with them due to lack of resources. There's always something to do. \n\nTo be fair, I've spent much of my childhood and formative years in similar circumstances, socially speaking, so I've had to be quite independent and resourceful. \n\nI play lots of instruments, speak a few different languages, have a lot of info on about a million different topics, but I can't put any of it on a resume, lol. \n\nCreative expression can help a lot.",
      "created_utc": 1735223467.0,
      "score": 50
    },
    {
      "id": "m3y499o",
      "body": "Real! It's great being in a liberal space, even if it can bring a little disillusionment. \n\nThere are bigots out here, and I won't get started on the housing crisis, but I also can forget how bad it is in so many other places. Even just a few countries away in three directions. \n\nI'm happy though, I'm really lucky to be here.",
      "created_utc": 1735254364.0,
      "score": 3
    },
    {
      "id": "m3y4n4n",
      "body": "You're such a sweetheart omg.\n\nI'm grateful for your existence as well :3 \n\nYou're epic 👾🩵✨",
      "created_utc": 1735254506.0,
      "score": 3
    },
    {
      "id": "m40nm3y",
      "body": "You too. Happy holidays, and New Years",
      "created_utc": 1735298450.0,
      "score": 3
    },
    {
      "id": "m3yb7mb",
      "body": "That's metal af",
      "created_utc": 1735256945.0,
      "score": 2
    },
    {
      "id": "m46zskk",
      "body": "I'll do my best friend :) thank you",
      "created_utc": 1735395198.0,
      "score": 1
    },
    {
      "id": "m3y80eg",
      "body": "True. I'm very glad I did as well. I hope every day that something I do contributes to a future where we all get this connection and acceptance.",
      "created_utc": 1735255759.0,
      "score": 2
    },
    {
      "id": "m4tclwh",
      "body": "I am telling the truth, while you polish your awards in mental gymnastics there\n\n(I believe I should mention that I don't hate, dislike or even know you- so I hope you don't take the above internet ammunition too personally, I just came up with something and wanted to say it,)\n\nThe issue you have with this may just be authoritarianism, which often tells people that there is preferred way to look, dress, or act in uniform, and that bodies belong to the state in a variety of ways. \n\nThe problem with selectively addressing state rights over human bodies is that while you pay attention to the small minority that the state tells you they're focused on, you're not seeing behind the curtain, looking at the reality that they're after far more control than 0.1% of the population could ever offer them, and are in fact after you, and your autonomy as well. \n\nDoesn't that concern you? \n\nBut seriously, how can one just ignore the cis people who get these surgeries done when addressing this issue? Why are trans people singled out?\n\n\nBesides, it's never enough for people who are obsessed with our bodies and choices to just accept that we simply exist in a variety of shades of life. \n\nIf a trans person is fine with no surgical interventions, they get screamed at about how that means they're not really their gender. But when they do desire those interventions, they get yelled at for \"mutilating\" themselves by the same people. \n\n\n\n(Trans men are men, trans women are women)",
      "created_utc": 1735713305.0,
      "score": 1
    },
    {
      "id": "m4z4u61",
      "body": "I'm alr :) I'm still here lol",
      "created_utc": 1735801666.0,
      "score": 2
    },
    {
      "id": "m45rboa",
      "body": "I can't think of anyway to prove you wrong with how wrong you are. Congrats",
      "created_utc": 1735368493.0,
      "score": 2
    },
    {
      "id": "m3z22z3",
      "body": "[deleted]",
      "created_utc": 1735267118.0,
      "score": 15
    },
    {
      "id": "m4s0tdc",
      "body": "Is it possible that you could be on the autism spectrum? That always makes us shy, being social is difficult.   That's a source of stress too.   Especially if you felt the effects, but wasn't properly diagnosed.",
      "created_utc": 1735691496.0,
      "score": 2
    },
    {
      "id": "m40aafj",
      "body": "I’m glad that you can see this pattern. Being able to identify triggers and patterns can help avoid the intense suicidal thoughts (just speaking from my own experiences). I sincerely hope you can keep moving forward. I know I’m an internet stranger, but if you ever need to talk, my inbox is open to you. Sometimes we just need someone to tell us they care. I’m happy to do that whenever you need it.",
      "created_utc": 1735289571.0,
      "score": 3
    },
    {
      "id": "m3vnw8h",
      "body": "Definitely don’t want to recommend vulnerable people to a crappy resource! I was on a meeting with reps from 988 recently and they said they are adding a telehealth option for ASL/ESL and that made me super happy",
      "created_utc": 1735223987.0,
      "score": 71
    },
    {
      "id": "m3zbtr1",
      "body": "A lot of the responders are in school to be social workers, currently are social workers or are volunteers. A lot of volunteers actually. Most volunteers have some level of lives experience. Some choose to disclose that if it may help. I think sometimes it helps to hear from someone who’s actually been through what you have or at least has experienced it on some level!",
      "created_utc": 1735271019.0,
      "score": 3
    },
    {
      "id": "m3w4yqz",
      "body": "That milkshake sounds even better than Ben & Jerry’s anyway dang. I want one now",
      "created_utc": 1735230301.0,
      "score": 35
    },
    {
      "id": "m3wz11d",
      "body": "Did that milkshake bring all the boys to the yard? I'll see myself out now",
      "created_utc": 1735240296.0,
      "score": 8
    },
    {
      "id": "m3xvogm",
      "body": "You totally should! I play in a couple of games, one in person and one online, so it's accessible no matter where you are. For that good in person experience, I recommend looking up local gamer groups on Facebook and checking out any local table top gaming stores/cafés/bars. Many of those places will also have Discords where patrons will post  LFG (looking for group) type threads",
      "created_utc": 1735251280.0,
      "score": 8
    },
    {
      "id": "m3vn7yo",
      "body": "thats great! i wish you the best of luck at finding some community \ntry to reach out! even online community is good",
      "created_utc": 1735223707.0,
      "score": 14
    },
    {
      "id": "m3vu5je",
      "body": "Glad you stuck around man. There’s still a lot of time for you to enjoy phish food ice cream and make friends with the people waiting for you down the road.",
      "created_utc": 1735226452.0,
      "score": 10
    },
    {
      "id": "m3x4803",
      "body": "Any way to get into those with social interactions? Even small ones I find to fill my social bar a bit! There are many workshops or classes you could take regarding those hobbies or finding groups online! And I’m glad you’re here (u know alive and talking about your hobbies ❤️)  btw :)",
      "created_utc": 1735242005.0,
      "score": 3
    },
    {
      "id": "m3yddqf",
      "body": "one of my favorite bands, check them out for some kickass hardcore if you want",
      "created_utc": 1735257753.0,
      "score": 2
    },
    {
      "id": "m482z5l",
      "body": "You'll always have us. Reach out whenever.",
      "created_utc": 1735409031.0,
      "score": 2
    },
    {
      "id": "m4tdq3u",
      "body": "I don't agree that trans men are men and trans women are women. I don't think anything bad should happen to you. I think it's a neurosis that shouldn't be glorified or normalized in any way. Ironically I'm very much a libertarian and I think self expression is very important but I just can't get behind the trans thing. You speak about authority and I find the LGBT community always talks about everyone having a voice and freedom and autonomy and all these honorable concepts. But it's only if you agree with what they say. I don't agree",
      "created_utc": 1735713990.0,
      "score": 1
    },
    {
      "id": "m4z523h",
      "body": "Whew I thought you died there for a minute glad you’re ok =)",
      "created_utc": 1735801804.0,
      "score": 2
    },
    {
      "id": "m3z9vrg",
      "body": "That's lovely that you got to experience this. I'm very happy you found a group. Sad for the reasons you had to though. \n\nMaybe I have, I'm not sure. I jump around a lot in communities. But I really like quite a few trans subreddits.",
      "created_utc": 1735270224.0,
      "score": 6
    },
    {
      "id": "m4t4h4l",
      "body": "Oh yeah I'm more than sure I am, also it runs in the family. \n\nBut I once went to get a diagnosis and they misdiagnosed me, I haven't been back for round two with autism in particular",
      "created_utc": 1735708656.0,
      "score": 1
    },
    {
      "id": "m40dxsd",
      "body": "Thank you! And I extend the same to you. You seem really kind and smart. :)",
      "created_utc": 1735292052.0,
      "score": 2
    },
    {
      "id": "m3voim4",
      "body": "That's beautiful omg. That makes me happy too",
      "created_utc": 1735224242.0,
      "score": 44
    },
    {
      "id": "m3xoxte",
      "body": "It was delicious, I tend to stay away from sugar and dairy like that but was well worth it.",
      "created_utc": 1735248970.0,
      "score": 13
    },
    {
      "id": "m3xvrfc",
      "body": "It did they were clamouring",
      "created_utc": 1735251308.0,
      "score": 14
    },
    {
      "id": "m3xx8d3",
      "body": "Awesome! I know I'm going to fall in love lol",
      "created_utc": 1735251832.0,
      "score": 10
    },
    {
      "id": "m3vnr08",
      "body": "Thank you! I will try my best. I'm thinking of becoming a theatre geek so I'll more than likely get lots of good stuff from that. \n\nOnline community is great! They can't see me pick my nose j/",
      "created_utc": 1735223927.0,
      "score": 18
    },
    {
      "id": "m3xmwg5",
      "body": "Thank you, you're right. I'm glad too.",
      "created_utc": 1735248292.0,
      "score": 2
    },
    {
      "id": "m3xw9g2",
      "body": "I'm glad I'm here too! There's too much to be done in this world, too many things I need to accomplish and see and explore.\n\nAnd yes, I'm actually trying to find a way to pay for theatre classes at a repertory theatre school. And at my community college. \n\nI'm excited :)",
      "created_utc": 1735251485.0,
      "score": 6
    },
    {
      "id": "m3ydz11",
      "body": "Today I discovered Tracy Chapman and God's Hate, and I am happy",
      "created_utc": 1735257975.0,
      "score": 2
    },
    {
      "id": "m49wh39",
      "body": "For sure, thank you",
      "created_utc": 1735430936.0,
      "score": 1
    },
    {
      "id": "m4tf84z",
      "body": "\"You speak about authority and I find the LGBT community always talks about everyone having a voice and freedom and autonomy and all these honorable concepts. But it's only if you agree with what they say.\"\n\nI never said you can't tell people your opinion or discuss things, that's your right to freedom of speech and I wouldn't take it away if I could because it's foundational to democracy. \n\nBut whether or not you, personally can \"get behind the trans thing\" doesn't really matter. \n\nWe exist, and I'll never understand why us simply existing and asking for rights is such a big problem. \n\nI'm not taking your rights, I'm actually fighting for bodily autonomy for all, not just myself. \n\nIf anything, that should make you happy. But like I said it's very confusing to me. \n\n\nIf you prize autonomy, then consider this: \n\nYou assuming that it's an issue that you can or should have the right to influence based on instinct or opinion is a great indicator that you don't consider trans people worthy of bodily autonomy. \n\nPeople often assume we just \"don't know what we're doing\" with our own bodies. \nWhy is it different for trans people and cis people? \n\nSimply having misinformation that being trans is a neurosis does not constitute an opinion, it's simply misinformation. And it's not even original, it's political rhetoric from figureheads that use small minority populations as cannon fodder for their schemes. \n\nIt's literally a kind of fascism, I'm not just using that as a buzzword.\n\nAs far as not considering us as our respective genders, I mean ok, but why feel the need to talk about it? On New Years Eve? \n\nGenuinely wondering because as far as I can tell the only reason I know that someone would be doing that is because some political figurehead for the hidden rich told you to.",
      "created_utc": 1735714931.0,
      "score": 1
    },
    {
      "id": "m4zafwp",
      "body": "Thank you :) all good",
      "created_utc": 1735805271.0,
      "score": 2
    },
    {
      "id": "m3xrum4",
      "body": "Jack in the box milkshakes are deeply underrated",
      "created_utc": 1735249951.0,
      "score": 7
    },
    {
      "id": "m41flqs",
      "body": "Sometimes you just gotta treat yourself!",
      "created_utc": 1735311612.0,
      "score": 2
    },
    {
      "id": "m3vsfmp",
      "body": "Hi, have you tried D&D? For someone with all your talents it might scratch a few itches. The “theater geek” part of me loves it. I did find a free game after a while on roll 20. I discovered that I didn’t know what the game was until I watched Critical Role and Dimension 20 on YouTube. Wish you well cool person.",
      "created_utc": 1735225801.0,
      "score": 13
    },
    {
      "id": "m3x3w5g",
      "body": "Volunteer to play an instrument at an old folks home or something! Just throwing ideas out there",
      "created_utc": 1735241895.0,
      "score": 8
    },
    {
      "id": "m3z28am",
      "body": "Your community college might have a club for students interested in theatre. Or opportunities to volunteer backstage (or possibly musical accompaniment, since you play instruments). So you would have an opportunity to meet people and get familiar with the department before taking classes.\n\nEdit: And if your college was like mine was, there was a mandatory “student activities fee” that funds student clubs and events. I would get anxious and overthink about trying new groups that sounded interesting, and I’d have to reassure myself that I was allowed there because that’s what the fee was for.",
      "created_utc": 1735267178.0,
      "score": 2
    },
    {
      "id": "m3yex42",
      "body": "hell ye, happy I could help make your day a bit better <3 glad you liked it and tracy's amazing too. All things considered, like to thing you broke even today",
      "created_utc": 1735258330.0,
      "score": 3
    },
    {
      "id": "m4vk87y",
      "body": "No one told me to think this way I like to read up on and gather my own opinions. I also listen to how I feel around people. I don't trust the government or political figureheads of any kind. I think we honestly align on that. Truthfully I've just never met a trans person who wasn't troubled or suffering in some way. Regardless of what any of them said they've never been able to justify that \"all of their problems were external to themselves.\" It's always this outside force (the government, right wing extremists, the hidden elite etc.) making them feel terrible. I think their struggle is more internal than external. I think it's true for anybody on earth. We have to start by looking in the mirror if we want to make our lives better. The one thing we have power over to change is ourselves. Then we can change the world around us. I think being trans is extremely hard and life is hard enough and I feel a sadness for you and wish you well really. I would never wish that condition on my children or anyone that I know and love ",
      "created_utc": 1735753545.0,
      "score": 1
    },
    {
      "id": "m50fi1j",
      "body": ";)",
      "created_utc": 1735827913.0,
      "score": 2
    },
    {
      "id": "m3y4di3",
      "body": "Free extra syrup and cherries made my day lol",
      "created_utc": 1735254407.0,
      "score": 9
    },
    {
      "id": "m44dc1v",
      "body": "This is true lol",
      "created_utc": 1735346849.0,
      "score": 2
    },
    {
      "id": "m3xmlk2",
      "body": "Thank you, I wish you well also. I've always suspected that I might love D&D. I'll think about it for sure.",
      "created_utc": 1735248191.0,
      "score": 3
    },
    {
      "id": "m3xw3go",
      "body": "Yeah hey, maybe :)",
      "created_utc": 1735251427.0,
      "score": 1
    },
    {
      "id": "m3za970",
      "body": "Honestly I might as well start by just taking some theatre classes there actually. I'm looking forward to it. I believe they have a program where they help with headshots, resources and portfolios at the end of the semester too.",
      "created_utc": 1735270374.0,
      "score": 2
    },
    {
      "id": "m3yfwoq",
      "body": "Agreed. Thank you for sharing the song and band, seriously I think I more than broke even, maybe even put some in savings. <3",
      "created_utc": 1735258696.0,
      "score": 3
    },
    {
      "id": "m4092pk",
      "body": "always glad to help ⊂⁠(⁠・⁠﹏⁠・⁠⊂⁠)",
      "created_utc": 1735288751.0,
      "score": 2
    }
  ]
}