{
  "id": "1kw1jyb",
  "title": "I caught my mom reading my teenage daughter’s diary. Again.",
  "selftext": "My daughter is 15. Sensitive, smart, and introverted. She journals almost every night. It’s her way of processing the world. She trusts me to respect her space. I always have.\n\nMy mother, on the other hand…\n\nWe live with her temporarily. Financial reasons. My mom is helpful in some ways, but she’s always been nosy. I’ve caught her reading my daughter’s diary before. I told her, firmly, to stop. That it was a boundary. That it was not okay.\n\nShe cried, made herself the victim, and promised never again.\n\nLast week, I came home early from work and saw her on the couch reading it.\n\nNo shame. No apology. Just said, “You should see the things she writes. She’s depressed. She needs help.”\n\nI told her to stop. She said, “I’m her grandmother, I have a right to know what’s going on.”\n\nNo. She doesn’t. She broke my child’s trust.\n\nMy daughter hasn’t written in it since. She told me, quietly, that she feels violated. That she doesn’t even want to stay in the house anymore.\n\nWe’re moving next month. I told my mom she lost the right to be alone with my child ever again.\n\nAnd I meant it.",
  "created_utc": 1748283720.0,
  "score": 6687,
  "num_comments": 207,
  "url": "https://www.reddit.com/r/offmychest/comments/1kw1jyb/i_caught_my_mom_reading_my_teenage_daughters/",
  "comments": [
    {
      "id": "mudvgqf",
      "body": "When I was younger my mom read anything and everything she could get her hands on of mine. I tried every now and again to keep a journal but ended up resorting to making random entries in planners, on sticky notes, school notebooks, etc. \n\nThe point of this being, thank you for taking this seriously and doing what you can to preserve your daughter’s privacy. I wish someone could’ve stood up for me like that!",
      "created_utc": 1748284445.0,
      "score": 2185
    },
    {
      "id": "mudvgjr",
      "body": "On the sofa reading it? She wanted everyone to know she was reading it. That’s horrible. And a great way to ensure her granddaughter never trusts her.",
      "created_utc": 1748284444.0,
      "score": 2479
    },
    {
      "id": "muduny4",
      "body": "Boundaries are so important, and trust at this age affects the way the relationship will build from here. \n\nI think it’s would be good for you to double down and show her that she can trust you, even if she is having issues with her grandma. \n\nMaybe look into getting a diary with a lock or a little box she can put it in. Just as a physical representation of security.",
      "created_utc": 1748284203.0,
      "score": 2315
    },
    {
      "id": "mudwaca",
      "body": "Good for you. My mom read my journal when I was 16. I, too, used it to process deeply personal aspects of my life and it was my anchor during a very tumultuous time period. Her violation of my privacy scarred me and I have never been able to keep a journal since. I am almost 50 and it still hurts. Well done for sticking up for your daughter’s right to privacy.",
      "created_utc": 1748284693.0,
      "score": 440
    },
    {
      "id": "mudyggo",
      "body": "As someone who has walked into my room to find my parent reading my diary multiple times, I totally get how your daughter feels. \n\nIt is a violation of privacy and trust. \n\nI’m glad you are there for her, not only do you respect her boundaries but you also advocate for others to respect them as well. \n\nHopefully she feels safe enough to write again once you guys find your own place!",
      "created_utc": 1748285356.0,
      "score": 161
    },
    {
      "id": "mudyi4j",
      "body": "Go to the nearest office supply store and buy your daughter a lock box. She deserves privacy and your mother is garbage for invading her privacy.",
      "created_utc": 1748285370.0,
      "score": 325
    },
    {
      "id": "mudw3la",
      "body": "Your mom took something so important from your daughter… something your daughter had with HERSELF.  I know you already know this, but how sad.  I’m glad you recognize how messed up this is.  Assure your daughter she will have this part of herself back when it’s just the two of you again. :(",
      "created_utc": 1748284636.0,
      "score": 92
    },
    {
      "id": "mudysuh",
      "body": "My mother did that when I was a kid. And she’s stumped as to why I never trusted her or told her anything.",
      "created_utc": 1748285460.0,
      "score": 144
    },
    {
      "id": "mudzeq6",
      "body": "Reading things a TEENAGER is writing about what’s going on in their head and day to day life is honestly so creepy 😭 I remember some of the things I wrote about and if any adult were to have read it I think it would’ve made their skin crawl. I hate people who think your private information is actually *their* private information",
      "created_utc": 1748285648.0,
      "score": 68
    },
    {
      "id": "mudwfkw",
      "body": "My dad would unfold my notes we used to pass and then staple them together on my bed so I knew he had read them. \nI hardly even touch my kids room unless she asks for help or it needs cleaning which she helps with.",
      "created_utc": 1748284738.0,
      "score": 66
    },
    {
      "id": "mudvyir",
      "body": "Give her a box with a lock that she could carry a key to and keep with her",
      "created_utc": 1748284594.0,
      "score": 88
    },
    {
      "id": "mudtsvx",
      "body": "That's horrible :(",
      "created_utc": 1748283944.0,
      "score": 29
    },
    {
      "id": "mudumvv",
      "body": "I know what you're going through. Boundaries are so tough with some family members.",
      "created_utc": 1748284195.0,
      "score": 27
    },
    {
      "id": "mudx5tn",
      "body": "Thank you so much for standing up for your daughter. I remember my mom reading through my diary when I was a teen, and I’m still so, so upset thinking about it 15 years later.\n\nAs another comment had mentioned, a lock box is or a locked diary is a great idea for her to keep journaling. Please make sure she doesn’t permanently lose her safe space to spill her emotions.",
      "created_utc": 1748284960.0,
      "score": 29
    },
    {
      "id": "mudxr8s",
      "body": "When you move, get her a small fire safe for her to keep it and anything she'd like to protect. That way she can write in her journals and know they are always safe and secure from other people and disasters.\n\nWhen she gets older, you could give her important documents to store in there as well, teach responsibility for them.",
      "created_utc": 1748285141.0,
      "score": 20
    },
    {
      "id": "mue8kge",
      "body": "My mom promised for years that she didn't read our diaries. We believed her. When I caught her with my sister's diary in her bedside nightstand my sister and I never trusted her fully again. \n\nIt is a big deal and I'm glad you're treating it as such!",
      "created_utc": 1748288529.0,
      "score": 24
    },
    {
      "id": "muej6e7",
      "body": "When I was a young teen my mom read my diary and said we had to go to therapy, and the family therapist said because my mom had broke a boundary and my trust, we wouldn’t be discussing anything she read in my diary unless I chose to bring it up. Therapist was a real one for that. A diary is a safe private space and you’re in the right here, your mom is wrong.",
      "created_utc": 1748291889.0,
      "score": 23
    },
    {
      "id": "mudyvoj",
      "body": "NTA. My mom did that to me. I have never once looked in my kids diary. I remembered how it felt",
      "created_utc": 1748285485.0,
      "score": 16
    },
    {
      "id": "mudzbg6",
      "body": "I’d buy a small safe from Amazon ($30) and give it to your daughter to keep her diaries in. As a fellow “journalist” , a month is a long time to not write.\n\nYour mom is entitled and immature.",
      "created_utc": 1748285620.0,
      "score": 29
    },
    {
      "id": "mudw1pc",
      "body": "I’m so happy to see that you’ve stood up for your daughter & her right to privacy against your mom. I hate that some ppl don’t give a shit about respecting boundaries. I hope when you move that the mother doesn’t come with you guys. The daughter should feel and be safe in her own home no matter what",
      "created_utc": 1748284621.0,
      "score": 14
    },
    {
      "id": "mueuqjd",
      "body": "My mom read my diary once after promising me multiple times that she never would. \nThen she punished me for the things I wrote (boy stuff.) \nThis was years ago and I still think about it sometimes. I also never wrote in my diary again. Things like that will break your trust like nothing else. \n\nGood on you for moving your mom out!!",
      "created_utc": 1748295580.0,
      "score": 12
    },
    {
      "id": "mudxgsl",
      "body": "I’m glad you respect your daughter’s privacy. Encourage her to keep writing, maybe in a password locked notepad on her phone. \n\nI find privacy violations like this to be absolutely repulsive. I don’t understand what makes anyone think they have the right to another persons innermost thoughts. \n\nI wrote a lot when I was a teenager, and I’m sure they would’ve thrown me in the psych ward if it was read. Writing is a great *safe* way to get those thoughts out of your head. \n\nI’m sorry your mom has no boundaries. It’s so intrusive and sickening.",
      "created_utc": 1748285051.0,
      "score": 10
    },
    {
      "id": "mueolld",
      "body": "Precisely why I stopped journaling and writing down my feelings, my mom and older sister felt the need to read through them and then guilt me for even thinking I had a right to feel the way I did about things. I still feel guilty about feeling my own emotions and thoughts. Now they wonder why I don’t speak to them on a regular or deeper level than previously.",
      "created_utc": 1748293590.0,
      "score": 11
    },
    {
      "id": "mudxywd",
      "body": "Your daughter will remember this & be grateful later. Maybe give her a journal with a lock for the time being? I wish my dad had. \n\nMy mom read my diary & tried to punish me for things I had written (no; I didn’t write anything violent or indicating self harm. Normal tween shit like crushes and friends and classes). It completely changed our relationship & I never trusted her after that. I was also never able to journal again. The habit broke, combined with the fear of my mom reading it again. Your mom made a mistake she can’t take back & if your daughter doesn’t want to spend as much time with her after this, support her.",
      "created_utc": 1748285206.0,
      "score": 19
    },
    {
      "id": "mue6kfy",
      "body": "You’re protecting your daughter, that’s what matters!",
      "created_utc": 1748287895.0,
      "score": 18
    },
    {
      "id": "muemc15",
      "body": "Maybe your daughter should make a journal entry about her grandmother. How violated and betrayed she feels. She’s thankful that she gave you a place to live for a while but cannot wait until she’s out of her house. She’s counting down the days.\n\nShe no longer trusts her grandmother, will never share a confidence with her and so on. \n\nYour mother has heard from you about how wrong she was, maybe she needs to read it from your daughter.",
      "created_utc": 1748292877.0,
      "score": 9
    },
    {
      "id": "mueqio0",
      "body": "My mom used to read my diary and I lost trust with her at the time. Now I live apart from here and I trust her but I still make sure my diary is locked up if she needs to come here when I am not home. I really did not like that she went through my writing as a child along with my purses into my teenage years. It impacted our relationship and still does to this day. It will only teach your child to lie and hide things better. You sound like a good parent, though.",
      "created_utc": 1748294199.0,
      "score": 8
    },
    {
      "id": "mufrh39",
      "body": "i tried to have diaries when i was a kid. i had this one journal when i was six or seven that my grandma had given to me. i had written in it for maybe a few weeks to a month. until my mom started editing my journal and correcting it. leaving notes on what i had spelled wrong. i was so upset, she had said she had a right. i stopped. tried again when i was a little older, until my mom was watching me write over my shoulder and catching her reading it multiple times. swore to never write in a journal ever again. and she’s a big journal keeper, doesn’t let me see it. so i truly don’t get where the disconnect is",
      "created_utc": 1748307226.0,
      "score": 8
    },
    {
      "id": "mudxsbf",
      "body": "Your mother’s reasoning to read her diary is so stupid because if you respect your daughter’s boundary enough, she herself will share a lot with you. \n\nThat’s how trust is built, not by sneaking.",
      "created_utc": 1748285150.0,
      "score": 8
    },
    {
      "id": "muexcx0",
      "body": "props for being a good mom at least. my mom was the one reading my diary and saying i have no right to privacy and it really screwed me up. I’m sorry your mom sucks too.",
      "created_utc": 1748296455.0,
      "score": 7
    },
    {
      "id": "mufmv5k",
      "body": "I remember I had a journal/diary that my friend got me, it was purple with grape scented pages. I must have been about 9-10. My adult brother was over and we used to butt heads a lot as he is like 16 years older than me… he was getting ready to leave and he upset me, so I wrote about hating him, and he walked in my room, demanded to see what I’d written and then he read it. I knew it would happen, so I did it deliberately.\n\nHe learnt a lesson, and lost trust for him and barely ever journaled again until the past few years.\n\nPlease buy your daughter a lock box or safe, somewhere she can keep her thoughts sacred from prying eyes",
      "created_utc": 1748305541.0,
      "score": 5
    },
    {
      "id": "muhatpv",
      "body": "It’s been 11 years since my ex read my diary and I still can’t write in it as it makes me feel so unsafe. \n\nYou’re doing to right thing, don’t let your mother get away with this.",
      "created_utc": 1748332358.0,
      "score": 7
    },
    {
      "id": "mudxw1v",
      "body": "I’m glad she has a mum who values her right to boundaries and her own personhood 🩷",
      "created_utc": 1748285182.0,
      "score": 4
    },
    {
      "id": "mue03a1",
      "body": "My roommate’s friend did this to me in college. They all read my journal and got mad about the things I was writing about. It was just my way of processing while being unfiltered. It was a huge violation of trust and I dropped those “friends” like hot potatoes!",
      "created_utc": 1748285859.0,
      "score": 4
    },
    {
      "id": "mue7q43",
      "body": "She may have just \"lost\" her granddaughter. Even adults sometimes don't think about the consequences of their actions. It's similar to the business adage, years to build trust and all it takes is seconds to lose it all.",
      "created_utc": 1748288261.0,
      "score": 5
    },
    {
      "id": "muesfmt",
      "body": "Thank you for sticking up for her and creating the space where she can feel trust and love.\n\nI’ve always vowed to never read my children’s diary. The only time I’d ever break that if I was seriously worried about them, never just “to know”. And even then idk if I could do it. Your own personal thoughts are simple that. And for someone to intrude without a care in the world is so gross.\n\nKeep doing what you’re doing and get that witch away from your daughter.",
      "created_utc": 1748294818.0,
      "score": 5
    },
    {
      "id": "mufilsz",
      "body": "bravo for setting that boundary with your mom, even when it’s messy, complicated, and painful.\n\nYour daughter is at such a vulnerable age and journaling is one of the healthiest outlets a teenager can have. For your mother to invade that space after being explicitly told not to? That’s not concern, that’s control. That’s disrespect. That’s a violation of trust that can take years to repair if it ever can be.\n\nYour daughter trusted you with her privacy, and you’ve shown her that her voice, her boundaries, and her autonomy matter. That’s huge. That’s how trust is built and rebuilt when someone else has shattered it.\n\nAnd your mom saying “I have a right”? No. She had a responsibility to be supportive, respectful, and safe. She chose her curiosity over your daughter’s dignity. That’s not love. That’s entitlement.\n\nI’m so sorry your daughter is feeling violated. And I’m so proud of both of you for moving forward, physically and emotionally. She’s lucky to have a mom who listens, protects, and believes in her right to her own story.",
      "created_utc": 1748303976.0,
      "score": 5
    },
    {
      "id": "mufxlr7",
      "body": "My mom would read anything that I wrote. Notes to friends, journals I kept, and she would go through my phone and messages. I wasn’t even a bad kid, I was honestly just a normal teen and would just process my day like your daughter. Every time my mom read something and thru it back at my face it gave me the grossest feelings I have ever felt. Now at almost 30 our relationship is very surface level and I gray rock her a lot and don’t share personal details. \n\nShame on your mom and good for sticking up for your daughter. I promise she will always remember the feelings the violation of privacy has brought, but she will always remember how you stuck up for her and respected her privacy.",
      "created_utc": 1748309472.0,
      "score": 5
    },
    {
      "id": "mufya1v",
      "body": "My dad read my diary too, he felt it was his right to, I was so embarrassed and or angry I bought one of those dumb password diary things so that he could never get in, point is, if you think kids or teenagers don’t care about that kind of thing, you’re definitely wrong.",
      "created_utc": 1748309716.0,
      "score": 5
    },
    {
      "id": "mudwzfh",
      "body": "should buy your daughter a safe to keep her diary in. you know your mother is a snoopy person that shows no respect for others privacy. why keep allowing her opportunity?\n\nplus a safe would be good anyway because then she can put her special items in it to keep protected no matter where she lives.",
      "created_utc": 1748284906.0,
      "score": 4
    },
    {
      "id": "mue1z8i",
      "body": "This is where you sit down with your mother.\n\n\"You've committed a great offense against your granddaughter and destroyed your relationship with her.  And I'm not going to have you fix it, nor will I give you the access to her to fix it yourself.  \n\nWhen I was a child, you taught me the difference between right and wrong.  Touching someone's things without their permission was a wrong.  Lying was a wrong.  Violating someone's privacy was a wrong.  And yet, I've witnessed you doing all three.  I'm disappointed in you, ashamed of you, and your lessons have taken on a whole new context for me.  I don't think I can see you as my moral center anymore.  You don't appear to live the values you taught me.  \n\nYou will have to live with this, I will not keep this a secret for your privacy like you couldn't leave her to her privacy.  When asked, I will be blunt and honest why your relationship with her has been damaged to anyone who asks.  You are also going to learn that you aren't entitled to her, she's not your daughter, she is mine.  And I have a duty and responsibility to protect her, even from my own mother.  \n\nWe're at a fork in the road.  You can tell people that I am a monster for taking your grand daughter from you, or you can spend the next few years reforming your behavior and proving that you can be trusted again.  But one of those roads will earn privilege to our lives, the other will not.\"",
      "created_utc": 1748286449.0,
      "score": 4
    },
    {
      "id": "mue4qg5",
      "body": "I would buy her a combination lockbox, or (and I love this for a teenaged girl) a lockbox with a key made into a necklace for her to wear. When it’s just the two of you in your new place, she may continue to use it as such, or she can happily leave her diary out and use the box for important documents etc. Standing up to your mom and moving has shown her what this familial cycle was, but that it’s broken.",
      "created_utc": 1748287314.0,
      "score": 3
    },
    {
      "id": "muecllt",
      "body": "This is awful to hear, and I wish it was surprising - but it sounds all too familiar. It is terrible that she crossed your boundary as a parent, and your child’s.\n\nSome options, if you want them, and being cognizant of the “living with her for financial reasons” aspect:\n\n1. Buy a small travel bag that has a lock on it. The journals can be locked up. Maybe $80 USD.\n\n2. A back pack and travel lock would be similar, but easier to break into if the determination is there. $15 USD for the lock. Or a padlock. $5 - $10 USD.\n\n3. Fire proof lock box with keys. $40 - $100 USD.\n\n4. Online journal. If she has a phone or computer, she can create a locked document. Sometimes it’s the physical writing versus typing that really helps, so definitely understand if that isn’t actually an option.",
      "created_utc": 1748289825.0,
      "score": 4
    },
    {
      "id": "muekbb9",
      "body": "When I was 12 my mother did the same thing to me. I never confided in her for the rest of her life. Protect your daughter.",
      "created_utc": 1748292247.0,
      "score": 3
    },
    {
      "id": "muekx86",
      "body": "I’m so sorry your Mom has done this.  I have a 14 year old daughter and 17 year old son and give them their privacy.  I’d never read their journals and my son has a letter from his gf pinned up next to his bed.  I’ve not read that either.\n\nI agree with buying your daughter a lockbox, even if she doesn’t feel safe journaling right now then it will show her that you have her back.",
      "created_utc": 1748292436.0,
      "score": 4
    },
    {
      "id": "muepgxs",
      "body": "Get a locked diary that says “no nosy grandmas allowed”",
      "created_utc": 1748293866.0,
      "score": 5
    },
    {
      "id": "muerbv7",
      "body": "My parents read my diary when I was in high school. I was depressed and had a history of suicidal thoughts and they rationalized it saying they were just trying to help me. I feel for them because I truly believe it, but I will never forget how betrayed I felt. Even 15 years later I still feel violated and embarrassed about it",
      "created_utc": 1748294461.0,
      "score": 5
    },
    {
      "id": "muetqwm",
      "body": "Not only did your mom lose the right to be alone with your child, she lost the right to be around, full stop.  What a vile thing to do!!!",
      "created_utc": 1748295252.0,
      "score": 5
    },
    {
      "id": "muf7o0h",
      "body": "My mom did the same thing to me...I never wrote a journal ever again. Some people just cannot be trusted. It breaks something in a typing person when they realize they aren't allowed privacy.",
      "created_utc": 1748300080.0,
      "score": 3
    },
    {
      "id": "mufqzvr",
      "body": "On behalf of a former child who was violated in this way, thank you.",
      "created_utc": 1748307051.0,
      "score": 6
    },
    {
      "id": "muhdbom",
      "body": "I don’t know if your daughter has a cell phone, bc that can be used to journal. I know you said finances are tight, but maybe purchasing a tablet (used) with a pass code on it that she can leave at home. You can store it for her and she can access it whenever and only she has the code. I assume maybe she doesn’t want those personal entries on her cell phone when she uses it with her friends, etc.",
      "created_utc": 1748333903.0,
      "score": 3
    },
    {
      "id": "mudx5o9",
      "body": "I’m so sorry and glad you are able to move out soon. My mom is similar with not believing in boundaries cause “I’m your mom / the grandmother”. It seems like you and your daughter have a good relationship though.",
      "created_utc": 1748284959.0,
      "score": 3
    },
    {
      "id": "mudx9uv",
      "body": "Your mum is a douchebag. She literally has ZERO reason to read it.\n\nBravo for standing up for your daughter's boundaries!",
      "created_utc": 1748284994.0,
      "score": 3
    },
    {
      "id": "mudxqkj",
      "body": "You’re doing the right thing. But *please* make her feel safe again doing what she had been doing. It’s incredibly healthy if it’s helping her. \n\nAnd if she *is* depressed, that’s not abnormal for that age. But make sure she knows it’s safe and okay to ask for help. She’s lucky to have you.",
      "created_utc": 1748285135.0,
      "score": 3
    },
    {
      "id": "mudzfys",
      "body": "I can see why your daughter feels violated. It’s completely a privacy violation. As a former teen, who journaled myself, I had this happen with a family member as well. It’s not fun and it is a big deal. Thank goodness you’re an amazing mother who respects her privacy. And sticks up for your children. Thank goodness she has you in her corner.",
      "created_utc": 1748285659.0,
      "score": 3
    },
    {
      "id": "mue122f",
      "body": "My niece left home after her mom confronted her about what she had read in her diary. My sister really wanted her to come back home and was really upset. I told her she wouldn't be as she had done something so cruel.",
      "created_utc": 1748286159.0,
      "score": 3
    },
    {
      "id": "mue174p",
      "body": "I used to LOVE to write. I wrote poetry, stories and had dreams of writing screenplays and movies. I was even published in my teenage years. I also wrote my feelings down and left them there so I didn’t have to carry them with me. My mom read my journal with the excuse of “I wanted to read your stories,” but then almost scolded me for some of my depressing journal entries and I shut the door to open communication so fast and never totally reopened it. I stopped writing everything. My dreams were crushed because I wasn’t ready to share and I got scolded for my feelings. (She just didn’t know how to handle it and did seek help to handle it better but the damage was done.) I still love my mom as an adult, she is still my best friend, but I do not tell her everything or go to her for advice. Your daughter is so incredibly lucky to have you protect her privacy like that. Your mom sounds like she is just being nosy and trying to catch your daughter in some scandal while creating a scandal. I’m sorry you both are dealing with this and I hope your daughter feels secure to write in the future.",
      "created_utc": 1748286204.0,
      "score": 3
    },
    {
      "id": "mue25uj",
      "body": "Breaks my heart reading what happened to your daughter.\nMy mom and sister together read my diary when I was 16. I found out by them making subtle references to things I wrote. The impact was monumental. I have such a complete lack of trust in every human being. The handful of people that I am closest to and that probably think they know me are kept at arms reach emotionally by me. Hey if my mom and sister who I knew my entire life can betray me then anyone can. \nI never ever put anything in writing that I would not care was in the newspaper. I never let someone know if they hurt me. I never give anyone the credit that they could.\n\nI don’t have any deep dark secrets, but I am well aware letting anyone know even inadvertently how I feel, what makes me sad, scared, vulnerable could always be used later against me or discussed over coffee, so I can 100% say that I am not fully emotionally open with anyone. \nMy disappoints are mine, nobody knows so they can’t pity me.\nThe impact goes on and on.\nTelling your child was the right thing to do. Hopefully she will still feel a trust with you. \nOf course she isn’t going to journal again, why would she? She would unconsciously be editing what she wrote and it would all end up being superficial. \n\nThat happened when I was 16. I am 63 now. The biggest complaint I have heard from family, friends, lovers is that I am “closed off”, “emotionally dead”, “stoic”, “emotionally detached”, “too independent “ “unfeeling”.\nCan’t say they are wrong. But it is just a result of my innocence and trust being destroyed from that mindless act.\n\nFYI you might notice your daughter connecting to animals more than people. I feel deep love and connection to them. Animals don’t betray you.",
      "created_utc": 1748286507.0,
      "score": 3
    },
    {
      "id": "mue2os7",
      "body": "It sounds like it’s been really healing for your daughter and if she goes a full month without writing, she could lose that hobby or interest of hers that is a major help in her coping with the world. I would definitely do what other redditors said, and get physical representation of security like a lock. That’s great habit to have at 15 years old and could even eventually turn out to be a career. You also could try and find her a way to do it on technology so no one else has access to it but her.",
      "created_utc": 1748286671.0,
      "score": 3
    },
    {
      "id": "mue8csq",
      "body": "You’re right. And a really good mom. Your daughter has the right to privacy, no matter what form that comes in. These diaries are important for expressing these thoughts that need a voice, even if it is just for your daughter’s eyes only.\n\nWould it be possible to buy her a tablet with a password to unlock it? Or keep the diary out of the house? Have your daughter carry it instead? If it’s only for a month, try to make it work. Then put your mom on a low info diet, or go low/no contact. Your mom deserves to face consequences for her actions. And these consequences could be a reduced/no relationship with your daughter. \n\nYou’re not overreacting.",
      "created_utc": 1748288462.0,
      "score": 3
    },
    {
      "id": "muec8jc",
      "body": "My sibling used to read my diary when we were young. They always knew where it was and everything. Even later when I had my own place, they saw some sealed diaries of mine and said that one day we should open them and read through them. \n\nBecause they said that, I burnt the diaries.\n\nI’ve never said it, but I find it difficult to trust them at times. They openly admit that they look through cupboards when they go to other people’s houses. I suppose I can say I can trust that they’ll snoop. \n\nYour kid is never going to be able to trust your mom ever again, and I wouldn’t blame her. Thank you for protecting her.",
      "created_utc": 1748289709.0,
      "score": 3
    },
    {
      "id": "mued8cf",
      "body": "Does your daughter have a phone or tablet where she could write her thoughts down? Then it would be harder for your mother to read your daughter's diary.",
      "created_utc": 1748290028.0,
      "score": 3
    },
    {
      "id": "muehz0b",
      "body": "Congratulations, Grandma.  You just lost the relationship with your granddaughter.\n\nGive it a couple of years and she'll be saying \"why doesn't granddaughter come to visit??\"",
      "created_utc": 1748291513.0,
      "score": 3
    },
    {
      "id": "muf1ueb",
      "body": "As someone who used to journal, this is so infuriating. \n\nI stopped precisely because of this. My family couldn’t respect my privacy.",
      "created_utc": 1748298014.0,
      "score": 3
    },
    {
      "id": "muf8kd0",
      "body": "If this is what you have caught her doing, I wonder what she has done or is doing that you’re not aware of. By sitting on the couch and reading it out in the open, she’s showing you that she totally disregards your boundaries.",
      "created_utc": 1748300396.0,
      "score": 3
    },
    {
      "id": "muf9hva",
      "body": "As someone who's grandma has read their diary, it's a HUGE invasion of privacy and it was such a violation of trust that over a decade later, I still don't feel comfortable writing my personal things down in a diary bc of that what if. Thank you, OP, for standing up for your daughter's privacy 🩷",
      "created_utc": 1748300727.0,
      "score": 3
    },
    {
      "id": "muflbyz",
      "body": "My mom did this to me when I was a teenager and I still remember how betrayed I felt",
      "created_utc": 1748304979.0,
      "score": 3
    },
    {
      "id": "mufx8ii",
      "body": "my father did this to me when i was 14 and i have genuinely hated and resented him since. will never forgive him and",
      "created_utc": 1748309339.0,
      "score": 3
    },
    {
      "id": "mug7bd1",
      "body": "Omg. I wrote diaries for years and the thought of not even a parent but a grandparent reading it is so horrible. So glad you stuck uo for your daughter and that you're removing you both from the living situation.",
      "created_utc": 1748313023.0,
      "score": 3
    },
    {
      "id": "muhe8n4",
      "body": "I went through something similar when a relative read my son’s private notebook without permission. He shut down emotionally for weeks and wouldn’t open up to anyone. It took time and steady reassurance to rebuild that trust.",
      "created_utc": 1748334480.0,
      "score": 3
    },
    {
      "id": "mul2l1g",
      "body": "You supporting your child and protecting her is everything you can do here.",
      "created_utc": 1748379645.0,
      "score": 3
    },
    {
      "id": "mue123y",
      "body": "You’re a good mother OP I know how your daughter feels when I was around the same age my grandma read my diary and then told my mom and some other people what I’d written and yea I completely felt violated and haven’t been able to journal since which sucks because it was great for processing. But the thing is that even though she gave me a sincere apology and to my knowledge didn’t do it again my mom didn’t have my back I was told I shouldn’t have left it laying around and that it wasn’t a big deal that my grandma had done it out of love because she was concerned.\n\nIt’s completely wrong to read someone’s diary as you know but yea it’s just an awful thing to do I’m almost 21 now and really I can’t write that freely anymore whenever I’ve tried I censor myself and don’t write anything that I wouldn’t be ok with someone else reading and that’s no way to write in a diary. I even got one with a lock on it thinking it would help but nope I still can’t write and time hasn’t changed that.\n\nThe fact that she did it TWICE is insane I’m so sorry that’s awful um yea protect your kid from that behavior you’re doing great",
      "created_utc": 1748286160.0,
      "score": 2
    },
    {
      "id": "mue2ht3",
      "body": "Buy her a fire safe / document safe to keep it locked away. You can find them for under $50 online or look on local used marketplaces.",
      "created_utc": 1748286611.0,
      "score": 2
    },
    {
      "id": "mue81if",
      "body": "Thank you for respecting your daughter's privacy and setting clear boundaries with your mother about her respecting your daughter's privacy as well. I only wish my mom had respected mine. I once came home from school in 9th grade to find her irate. She had read my diary and was so upset from what she read that I was to be grounded immediately. But the truly worst part was that she forced me to read it out loud to my dad once he got home from work. The inner workings of a teenage girl spilled out on those pages, and I was forced to read them to my father. He wasn't even the disciplinary of the family, my mom was. So it just felt even more unnecessary and cruel that she made me do that. I was an author, I used to write so much, poetry, short stories, and I wanted to write novels. I always wrote in my diary, almost daily. But after that, I just couldn't. I've tried picking it up here and there, but I've never been consistent about it the way I was when I was younger. I eventually went to therapy and even tried having my mom in for a therapy session to address the trauma but she blew up on me afterwards because she thought we had already talked about it and moved past it. She couldn't understand the literal lifelong trauma she had given me from that one incident. 25 years later and it still makes me get emotional thinking about it.",
      "created_utc": 1748288362.0,
      "score": 2
    },
    {
      "id": "mue9j6b",
      "body": "You can get a little medical lock box big enough for a journal that has a code lock on it",
      "created_utc": 1748288839.0,
      "score": 2
    },
    {
      "id": "mueapnw",
      "body": "My ex-husband did this to me. Then he'd confront me on it and have me rip out the stuff he didn't like. I stopped journaling after that, its been about 20 years since then. It's such a huge violation of not only trust but also safety. It makes you feel like if you can't be safe in your home or on paper, you can't be safe anywhere. I agree with the people saying to get her a lockbox but also understand that she might stop journaling altogether, too.",
      "created_utc": 1748289220.0,
      "score": 2
    },
    {
      "id": "mueeiap",
      "body": "My mom read my diary as a child and would confront me about what was in there. I’m 43 now, and still don’t feel I can write anything down and expect privacy. It has stuck with me, the feeling that anything I say or write can be used against me later by those who claim to care about me.\n\nGood for you for standing up for your daughter. I agree with the locked box (make sure she is the only one with a key), and try to get out of there ASAP.",
      "created_utc": 1748290435.0,
      "score": 2
    },
    {
      "id": "mueew8a",
      "body": "Buy a second-hand motel safe. They’re cheap. Don’t wait, your daughter will get out of the healthy habit of journaling if you break the habit for long.",
      "created_utc": 1748290555.0,
      "score": 2
    },
    {
      "id": "mufll19",
      "body": "Give her a new journal when you move house.\n\n\nTell her it's a new start for both of you.",
      "created_utc": 1748305071.0,
      "score": 2
    },
    {
      "id": "mugdr4m",
      "body": "I suggest get your kiddo a safe.  Doesn't have to be anything big or fancy, just a lock box with a keypad combination or fingerprint sensor.  And show her how to lock down her digital life, so she can keep a diary in the cloud that nobody else can read.  Tell her that she has every right to have a diary that's private just for her.  Tell her that YOU respect her privacy and would never in a million years violate her trust in that way.  Tell her that your mom completely violated both of their trust, and if this was your house you'd be kicking her out.  Tell her that as far as you're concerned, she (daughter) never has to see your mom again for the rest of your life if she doesn't want.  \n\nThen tell your mom you said this.  Tell her that she betrayed the trust of her child and her grandchild, and that while she may be 'proud' of it, the result is she just lost her family over a diary.  Hope it was worth it.",
      "created_utc": 1748315503.0,
      "score": 2
    },
    {
      "id": "mugk7rw",
      "body": "Teach your kid about cryptography",
      "created_utc": 1748318206.0,
      "score": 2
    },
    {
      "id": "muh2prn",
      "body": "Is it possible for her to lock her door when she's not home? So no one enters her room without her knowing maybe.",
      "created_utc": 1748327585.0,
      "score": 2
    },
    {
      "id": "muh7j0n",
      "body": "Good!!! Thank you OP for being a good mother who respects her child's autonomy, and privacy!! I hope you leave that house soon enough.",
      "created_utc": 1748330381.0,
      "score": 2
    },
    {
      "id": "muh9y6p",
      "body": "Your mother lives with you for financial reasons but doesn’t respect your boundaries?!",
      "created_utc": 1748331833.0,
      "score": 2
    },
    {
      "id": "muhf2yq",
      "body": "Get your daughter a combination lock diary! & perhaps a small lockbox to put it in. I know it sucks having to adjust like this, but at least a locked diary will help put your daughter’s mind at ease. I write in one myself & don’t worry about its contents being seen (especially if I put it down in a common area of the house).",
      "created_utc": 1748335016.0,
      "score": 2
    },
    {
      "id": "muhf51e",
      "body": "I used my diary as a young teen too. I used it to vent frustration and anger and unhappiness. My sister stole it, picked the crappy little lock, then showed mum the things I'd written in there. \n\nI got in huge trouble for it. I still remember the deep shame I felt in my stomach.  I wish I'd had someone in my corner then, telling them to stay the fuck out and that using a private journal to process bad feelings isn't an evil thing to do. You're a good parent, thanks for sticking up for her.",
      "created_utc": 1748335053.0,
      "score": 2
    },
    {
      "id": "muhm3t2",
      "body": "I found out that my mom reads a diary where I dedicate all my most negative thoughts and feeling to. Like a negativity dumpster of sorts, so that I can stop ruminating those thoughts. She took a picture and sent it to one of my teachers because I wrote about her, who then messaged me about it😭. The thing is, I also wrote a lot about my sexual discoveries and confusion in there (basically about being a horny teemager but finding sex repulsive, identified as ace recently) and also some murder plots 🌚. It's definitely a violating feeling",
      "created_utc": 1748339308.0,
      "score": 2
    },
    {
      "id": "mui5nln",
      "body": "This was definitely one of the reasons I never picked up journaling or any of that, I had parents who would happily read it if they ever got their hands on it and realized it was mine. You’re doing the right thing by originally establishing a boundary (no reading her granddaughter’s journal) and by having the two of you move in a month. That being said your daughter’s reaction is not only entirely valid but honestly pretty par for the course. Your daughter had a safe space to process the day in her journal along with any other feelings she’s had and your mother has violated that by essentially making it her personal morning newspaper. Your daughter is absolutely right to feel violated and to not want to live with someone who tramples over her boundaries/established boundaries. It’s not the 80s/90s/early 2000s anymore when stuff like this was commonplace.\n\nIf possible I would start establishing that new boundary (mom can’t be alone with her grand kid) as much as possible right now. Don’t start enforcement when you move, start it now or your mom will think the boundary isn’t real and that you two aren’t serious about it. Have your daughter move every time grandma enters a room, have her do her homework in her room until you come back from work, just something to make it real to grandma that she will never be alone with your kid again. If it doesn’t start happening while living with her, she’ll think she has the right to do whatever (including being alone with your kid) when you finally leave and she visits (assuming she even is given the right to visit, this would have me seriously contemplating never allowing her over until after my kids are gone - if this is how Grandma likes to act). Just because it was commonplace in the 70s/80s/90s doesn’t mean it’s cool now, and good on you for making that clear. Grandma will never change unless she’s forced to, so make her realize how serious you are.",
      "created_utc": 1748348561.0,
      "score": 2
    },
    {
      "id": "muid4gy",
      "body": "I was a prolific journaler all my life. When my (ex) husband and I split, I initially left without much, including a lifetime’s worth of journals. He read every single one before returning them to me. I have never felt so violated in my life. \n\nI can’t pick up a pen anymore. It’s been nearly 10 years, and I haven’t written a journal entry since. Just the act of picking up a pen with the intent to try makes me nauseated. He ruined something extremely precious to me in a way I’ve never been able to repair. \n\nMy heart breaks for your daughter, OP. I wish this could have been prevented in the first place, but it’s comforting knowing that you’re taking steps to put a stop to it, and that you recognise the severity of the violation your own mother has perpetrated. \n\nI hope your daughter finds a way to come to terms with this without it destroying a fundamental part of who she is. I hope she is young and resilient enough to not end up forever feeling the same way I do.",
      "created_utc": 1748351318.0,
      "score": 2
    },
    {
      "id": "mukdpwa",
      "body": "I would have told you to pretend you didn't notice and have your daughter write increasingly detailed murder / horror fiction to see just how spun up you could get her. \n\nShe has no right to  read that so should have no expectation that it's valid. \n\nOn a more practical note I have a little locking clipboard that I can set a combo lock on, I think it was less than $20.",
      "created_utc": 1748372522.0,
      "score": 2
    },
    {
      "id": "mukhsq4",
      "body": "When i was in 7th grade my Mom told me to quit taekwondo after reading my diary bec she saw that i had a crush on the team and she thought it was my coach???? She assumed bec she didn’t ask. I was so sad because at the time i already competed once and I was so proud of myself even though i only got bronze. At that time i felt like taekwondo was the only thing i excelled at but i had to stop doing it 🥺 i always have a thought at the back of my head thinking what could’ve been.\n\nI stopped writing since then too.",
      "created_utc": 1748373706.0,
      "score": 2
    },
    {
      "id": "mulftee",
      "body": "I used to journal but my mum kept reading it. Over the years since I can't trust to be able to just just a notebook so tried a password protected document etc but never really managed to keep it up. I've never forgiven her and she ruined my love of journalling.",
      "created_utc": 1748383723.0,
      "score": 2
    },
    {
      "id": "muljoiz",
      "body": "You should look for hidden key journals for her! Some are pricy but they’re really neat and the key is hidden in the design so it’s not easily accessible. I don’t blame her for not wanting to be around your mom after that. Kids deserve privacy too and she’s allowed to process her thoughts. I’m glad she has such a good mom to stand up for her ❤️",
      "created_utc": 1748384984.0,
      "score": 2
    },
    {
      "id": "mue1ox1",
      "body": "And this is why I invented a new alphabet when I first started journaling as a teenager...\n\nTo be fair no one ever tried, but having an adult read your diary is a huge fear when you're a teen.\n\nJust buy her one of those journals with a lock, I'd say make your mom apologize for invading her privacy but she doesn't seem to be the type to do that.",
      "created_utc": 1748286359.0,
      "score": 2
    },
    {
      "id": "muefpl1",
      "body": "Hello, I am a teenager like your daughter and I am 15 years old, my mother read and still secretly reads my diary, and I understand how terrible it is, as if someone is spying on you and wants control you, but a year ago I had depression and gender dysphoria, and I felt bad and I wrote in my diary that I was going to commit suicide soon, my mother read this and talked to me, hugged me and said that I was not alone, we discussed it together and I felt better, and I just want to say that no matter how terrible the act of reading personal diaries may seem, but still, if on that day my mom thought not to touch my personal things and didn't read my diary, then...most likely I wouldn't be here now, I'm incredibly grateful to her for this now, and sometimes it's not so bad...",
      "created_utc": 1748290809.0,
      "score": 2
    },
    {
      "id": "mufa1js",
      "body": "But a safe and teach your daughter that if she wants to keep something private, she needs to guard it.",
      "created_utc": 1748300920.0,
      "score": 2
    },
    {
      "id": "muh1het",
      "body": "You're a great parent and I really respect you for respecting your child's privacy and doing anything you can to make her feel comfortable. \n\nIn the meantime I'd suggest getting her a diary with a lock on it or just something she can put her diary in with a lock on it.",
      "created_utc": 1748326887.0,
      "score": 2
    },
    {
      "id": "mudzm17",
      "body": "Good for you standing up for your kid. You’re ensuring she’ll trust you with the ACTUAL hard stuff when it counts. Kids write all kinds of junk in their diaries, it’s a good place to work out private thoughts that go weird places.\n\nMy mom was generally good about respecting my privacy, but I remember how absolutely violated I felt as an older teenager when she mentioned reading the diary I kept as a child (like 8-9). Kids deserve reasonable privacy expectations that you’d uphold for adults.",
      "created_utc": 1748285711.0,
      "score": 1
    },
    {
      "id": "mue0eqx",
      "body": "You need to find a new place to live. Your daughter’s privacy is being violated again and again. \n\nOr find a lock box for your daughter to keep her diary in.",
      "created_utc": 1748285959.0,
      "score": 1
    },
    {
      "id": "mue12a2",
      "body": "Fire safe. The small portable lock boxes with a handle that hold important documents but that you can grab and go in an emergency. They have a lock that's sturdy and it will be safe from prying eyes. \n\nI'd be petty and make it super obvious that's what was in it, but a different choice would be to stash it in the closet or under the bed. That way OP's daughter can still keep journaling and not lose something that obviously means a lot to her. \n\nThen she can choose to keep it there after the move, or they can use it for birth certificates, passports, car titles, etc.",
      "created_utc": 1748286161.0,
      "score": 1
    },
    {
      "id": "mue12tw",
      "body": "The evil in me would tell your daughter to write some complete fiction in her journal that will freak nosy grandma out!",
      "created_utc": 1748286166.0,
      "score": 1
    },
    {
      "id": "mue18kq",
      "body": "My abusive grandmother and mother did this. \n\nIt took almost twenty years to feel safe writing down my thoughts even on a locked document on a locked phone.",
      "created_utc": 1748286216.0,
      "score": 1
    },
    {
      "id": "mue1w71",
      "body": "Good for you for sticking up for your daughter. Glad you are getting away.",
      "created_utc": 1748286422.0,
      "score": 1
    },
    {
      "id": "mue3mda",
      "body": "So sorry to hear this. I remember when I was in middle school, I wrote in my diary all the time. And then my older brother searched my room for its hiding spot and he read it. \n\nHe made fun of me, quoting my passages about the boy I liked then. I was humiliated, and in tears  I tore up the diary. I remember that feeling of violation. My heart goes out to your daughter, and I'm glad you'll be moving.",
      "created_utc": 1748286964.0,
      "score": 1
    },
    {
      "id": "mue5x6t",
      "body": "Buy the safe now so your mom sees it. Put it in a prominent spot.",
      "created_utc": 1748287688.0,
      "score": 1
    },
    {
      "id": "mue842l",
      "body": "u/bot-sleuth-bot",
      "created_utc": 1748288384.0,
      "score": 1
    },
    {
      "id": "mue9gjf",
      "body": "Can you buy her a small document safe from Walmart or family dollar or something? That way only she has the keys and can keep her journal in there. \n\nShow her you’re committed to standing up for her. But also… maybe think about getting her into therapy.",
      "created_utc": 1748288815.0,
      "score": 1
    },
    {
      "id": "muecnax",
      "body": "You did better than I would. I'd scream so loud the neighbors would call the police on her behalf.",
      "created_utc": 1748289840.0,
      "score": 1
    },
    {
      "id": "mueeumr",
      "body": "Good Dad 💙",
      "created_utc": 1748290541.0,
      "score": 1
    },
    {
      "id": "muefg3a",
      "body": "You’re a really amazing mom🩵 I hope your daughter starts writing in her journal again once you guys are out of there. I’m sure she will knowing the respect you’ve shown her",
      "created_utc": 1748290727.0,
      "score": 1
    },
    {
      "id": "mueh8z1",
      "body": "Im in my 40's and my mother ready my journals throughout my youth. I literally can not keep one even after trauma therapy. \nYou did right by her and she is going to remember that. You're a good parent. Thank you from all of us who which we'd had someone like you.",
      "created_utc": 1748291287.0,
      "score": 1
    },
    {
      "id": "mueippu",
      "body": "When I was about 13, the same thing happened to me. My grandmother was living with us for financial reasons. My mom got a lock installed on my bedroom door. Ultimately the living arrangement ended up with my grandmother assaulting me. My mom kicked her out after that.",
      "created_utc": 1748291746.0,
      "score": 1
    },
    {
      "id": "muez531",
      "body": "My father read my diary when I was 15 and mom was divorcing him. He then wanted to “discuss” my entries. Then he tried to manipulate me into staying with him (I had written I was definitely going with mom). There’s a lot of things he did that were unforgivable, and that was one of them. I am still extremely careful of what I write and I am 48.",
      "created_utc": 1748297066.0,
      "score": 1
    },
    {
      "id": "muf9wxa",
      "body": "Gotdamn?!? Is your mom usually this willing to just outright ignore boundaries? Glad you're able to get out.",
      "created_utc": 1748300874.0,
      "score": 1
    },
    {
      "id": "mufc2ha",
      "body": "\"Dear Diary, Grandma is so spiritually empty that she snoops in her grandchild's private journal.\n\n\nShe's a daytime vampire.\"",
      "created_utc": 1748301639.0,
      "score": 1
    },
    {
      "id": "muffxds",
      "body": "This is gross. Keep her away. The road to hell is paved with what? Good intentions. \n\nMaybe her intentions were good…to her. Let’s not wait and see what other boundaries she will cross.",
      "created_utc": 1748303008.0,
      "score": 1
    },
    {
      "id": "mufg888",
      "body": "My mother gave me a little diary when I was 7.\n\nIt was yellow, with a bunny on it. \n\nI started to write and draw in it. \n\nOn day, I came home after school, and she had broken the lock on it. \n\nI felt so bad. \n\nI never used it again, AND I threw it away.",
      "created_utc": 1748303114.0,
      "score": 1
    },
    {
      "id": "mufhdxx",
      "body": "My heart breaks for your daughter. I hope she feels she can safely journal again once you all have your own place. \n\nYour mother on the other hand, is a piece of work feeling it’s her right to read something so precious & private. She has only herself to blame when your daughter wants nothing to do with her, & after this, she won’t. \n\nGood luck & hugs to both of you.",
      "created_utc": 1748303530.0,
      "score": 1
    },
    {
      "id": "mufk5aa",
      "body": "Sorry to hear that you and your daughter are going through this. It's really disruptive to have your privacy violated. I had NO privacy growing up, my mom was horrible about looking through my things, reading my journal etc... I have adult children now. I have NEVER done this to them and I always told them that. Even with their phones, I told them I would never go through their phones and read their texts unless I had reason to...which I never did. Trust is SO important in a relationship (whatever relationship that is), it's so hard to get it back, if at ever.  I would encourage your daughter to keep writing, but as others have said make sure it's secured. Hugs to you and your daughter.",
      "created_utc": 1748304547.0,
      "score": 1
    },
    {
      "id": "mufoe9s",
      "body": "my mother read my diary when i was 6, i tried to restart them multiple times until i was about 12, when she read it aloud to my hateful and co-abusive older sister. \n\ni am 24 now and i have written in a diary for the first time since then about 5 months ago. It took over a decade to even consider buying an empty journal, and it sat on my shelf for a year before I used it. \n\nYou are making the right decision by separating her from your daughter. Please see if you can get your daughter a new LOCKING journal, or a lockbox, once you move. That was maybe the only thing that would have helped me.",
      "created_utc": 1748306109.0,
      "score": 1
    },
    {
      "id": "mufv3w1",
      "body": "As someone who was exposed to a similar treatment by her mom, thanks for respecting and protecting her boundaries <3",
      "created_utc": 1748308555.0,
      "score": 1
    },
    {
      "id": "mugb7g8",
      "body": "My father read my diary all through my teens, I found out in my 20s. It damaged our relationship almost irreparably, as he doesn’t think it was wrong. \n\nI think it’s a generational thing: people of her age think anything in her house is for her to look through, and only she is deserving of respect in her home.",
      "created_utc": 1748314503.0,
      "score": 1
    },
    {
      "id": "mugq7b4",
      "body": "When I was younger, my mother read my diary and beat me when I got home from school. All because I liked a boy in school. I've never been able to write in a diary since. I love the idea of one, but in my brain, whatever I write down will somehow be used against me one day. It's incredibly hard to be vulnerable in your words and thoughts, tears on your pages, only to be embarrassed, abused, and violated. \n\nThank you for sticking up for your daughter. 🖤",
      "created_utc": 1748320996.0,
      "score": 1
    },
    {
      "id": "mugukwu",
      "body": "I'm sorry this happened. I can commiserate with your daughter. My mother found and read every scrap of everything and every sketchbook she could find. She would not even hide that she read it and would just be furious about whatever she read. I also liked to creatively write and she often mistook those stories for facts. I simply stopped writing in my journals, electing to start my new journal on livejournal. I just always set it to \"only me\" and make sure the password isn't saved on the computer. Kudos to you for standing up for her. I'm certain she sees you're trying and getting out of there ASAP.",
      "created_utc": 1748323198.0,
      "score": 1
    },
    {
      "id": "mugxnu7",
      "body": "This is AI. You should be very proud of yourself OP.",
      "created_utc": 1748324800.0,
      "score": 1
    },
    {
      "id": "mugzxfx",
      "body": "I started journaling in English for this exact reason (not my native language)! You're a good parent.",
      "created_utc": 1748326027.0,
      "score": 1
    },
    {
      "id": "muhs6c3",
      "body": "As a child who suffered of the \"I can read your diary\" parents, I truly appreciate what you do for your daughter. \nMaybe buy her a new notebook and something to put it inside with a key ? ( I don't like the idea of keeping written feelings in something with a key but if it helps her ?)",
      "created_utc": 1748342613.0,
      "score": 1
    },
    {
      "id": "mui325v",
      "body": "My mom did this shit to me growing up, and I stopped journaling entirely. I think it probably took a toll on my mental health. I actually find it really difficult even today to journal and write freely just because I am in my head about who’s going to read it and what they’re going to think.",
      "created_utc": 1748347524.0,
      "score": 1
    },
    {
      "id": "mui3l3t",
      "body": "This is exactly why I made my journal unreadable to anyone except myself. Sure you could pick out bits and pieces but my whole stream of thoughts are scattered across the page in intricate designs that have no end or beginning. I will write in a curved line one way and then turn the page and write the next line backwards from the previous.\n\nETA: my therapist called this Spontaneous Journaling and she actually took the way I journaled and passed it on to other clients as ways they can get their thoughts out without worrying about someone reading it.",
      "created_utc": 1748347739.0,
      "score": 1
    },
    {
      "id": "mui57ev",
      "body": "My mom used to read my journal. I'm 45 now, she's gone, and I'll still never forgive her for it. Or the trauma I gained from it. Make your mom stop at all costs.",
      "created_utc": 1748348387.0,
      "score": 1
    },
    {
      "id": "muiawcu",
      "body": "well there is always the entries one can make to disturb life of those snoops. If mom and dad are still married.....put an entry in that you were told by a neighbor that they saw your mom or dad with another man or woman hugging or kissing. Then do not divulge...or better yet say it was one of mom or dads friends you overheard talking about it.\n\nOne can come up with various entries. Make them so it affects them.\n\nFollow it up on the next page and say I know you are reading this.....but is it true or not....I will never tell. \n\nOr just put entries in of how they will never see you again once you leave their house. Just keep making the same entry. \n\nI will never trust you. You will never see me. Lonely holidays for you. No grandchildren will know you. And keep repeating it. Frankly you do not have to worry about whether your relationship is ever going to be good. NO it will not be. This is a controlling person who wants to control you thoughts and actions.\n\nIf they are religious tell them their actions have caused you to lose your faith.\n\nAnd it says a lot about their ability to raise a child if they can't trust their child. Only a bad person has to worry.",
      "created_utc": 1748350523.0,
      "score": 1
    },
    {
      "id": "muiblk2",
      "body": "You did the right thing—100%. Your daughter trusted you with her emotional safety, and you honored that by protecting her when her trust was violated. That kind of advocacy matters more than most people realize, especially for a sensitive, introverted teen who uses journaling as a lifeline.\n\nYour mom’s behavior is not just nosy—it’s controlling and deeply disrespectful. Framing it as “concern” doesn’t erase the fact that she was warned and chose to violate your daughter’s boundaries again. Weaponizing guilt and playing the victim is manipulative, and sadly common with people who don’t understand (or care about) consent and emotional privacy.\n\nIt’s heartbreaking that your daughter feels so violated she stopped journaling—but please know that your fierce protection of her is part of her healing. She now knows she has someone in her corner who will stand up for her when it counts.\n\nYou’re not just moving out of a house—you’re reclaiming your daughter’s sense of safety. That’s powerful. That’s parenting.",
      "created_utc": 1748350775.0,
      "score": 1
    },
    {
      "id": "muid3ov",
      "body": "Good for you. Your daughter deserves to grow up in a free world.",
      "created_utc": 1748351310.0,
      "score": 1
    },
    {
      "id": "muifboz",
      "body": "You are your daughter's hero for this.",
      "created_utc": 1748352089.0,
      "score": 1
    },
    {
      "id": "muiq8t3",
      "body": "With your daughter's permission, your mom should hear what her granddaughter has to say about her. \n\nAt 15, your daughter will carry this for life. Your mom had irreversibly harmed her relationship with your daughter. That's really sad. The equivalent of not having a grandmother, in many cases. Unfortunately, it is probably for the better, your mother does not seem well.\n\nIf you can, get your daughter some sort of storage that is lockable that she only has access too, for storing her diary. This will maybe help her return to journaling, and will provide a visual reminder to your mom that she has crossed hard boundaries and is no longer welcome to anything but a cordial interaction.\n\nYou should show your mother the comments on this post.",
      "created_utc": 1748355645.0,
      "score": 1
    },
    {
      "id": "muixqb8",
      "body": "Journaling is such a healthy way of processing your life regardless of your age. I hope that she starts again when you move out! Bring safety back to the experience - if she needs the ability to lock it up, help her do that. Good job protecting & advocating for her!",
      "created_utc": 1748357939.0,
      "score": 1
    },
    {
      "id": "muj57us",
      "body": "Your daughter is lucky to have a dad who respects her space and privacy. \n\nI used to journal a lot. I think I probably had about 10 journals at home, hiding at the top of my cupboard. One day, I just couldn't live with keeping them anymore and threw them all away in the trash because I knew my parents would relish in reading them if they ever found them. That's what happened to my search history when my parents were helping me put some updates on my laptop. Deleted my blog after that :')",
      "created_utc": 1748360041.0,
      "score": 1
    },
    {
      "id": "mujxmoo",
      "body": "My uncle did this to me as a child. I made up a bunch a symbols to correspond to each letter of the alphabet, memorized it and wrote in my dairy using my new system. I know they tried to read it again because they brought up my weird symbols in my notebooks. At least I knew they couldn't understand it",
      "created_utc": 1748368011.0,
      "score": 1
    },
    {
      "id": "mujyabw",
      "body": "I had a diary when I was teen, my mom told me she read it and used what I said against me saying “God wanted her to find it and read it” Never had a diary after that again.",
      "created_utc": 1748368190.0,
      "score": 1
    },
    {
      "id": "muk6cpq",
      "body": "That is an invasion of privacy and i understand how frsutrating that is and can be. Minors shoukd have privacy but with limits. Does the child see a therapist also? I had this with my child as well 2 years ago. she would journal inconsistently but there was a time where i saw their mental health and attitude decline. Nothing i did would have her open up to me or her therapist. One day, i saw her journal on her desk in her room, not really put away just nder some knick knacks and wrappers. What i read inside was disheartening and they seemed to have given up on life at the age of 14. After i saw that, they opened up slowly and described what was wrong with them, physically and mentally. after several weeks and increased time with her therapist, they are going much better with the help from changes at home, school, and medications. I hope that your child's mental well being is being helped with journaling. it doesn't help us all as we need more to process these things in life. Good luck to you and your family. Your mother is in the wrong but YOU are in charge and responsible for your child's mental well being. Good luck to you both on your journey.",
      "created_utc": 1748370426.0,
      "score": 1
    },
    {
      "id": "muk76gn",
      "body": "Buy your child a lock box that she can put her diary and anything else she wants to keep private in. Even if she doesn’t write in it anymore at your mom’s house, she at least feels like her thoughts can be kept private. Your mom is disgusting.",
      "created_utc": 1748370660.0,
      "score": 1
    },
    {
      "id": "mukdpo3",
      "body": "Get her a lockbox for it (there are cheap ones at Walmart that are book shaped) and let her make the code for it herself so no one else knows it. This proves you trust her and respect her privacy. Will go a long way in building/maintaining/reinforcing a trusting relationship with her. And will allow her to have a safe space to continue journaling while in that house.",
      "created_utc": 1748372521.0,
      "score": 1
    },
    {
      "id": "mukesos",
      "body": "Thanks for standing up for her. This is so important.",
      "created_utc": 1748372835.0,
      "score": 1
    },
    {
      "id": "mukf3s8",
      "body": "Shits horrible. Although maybe look into it if your daughter is depressed, but people looking into her journal and invading her privacy will make it even worse.",
      "created_utc": 1748372924.0,
      "score": 1
    },
    {
      "id": "mukz5xt",
      "body": "My mum read my diary when I was a teenager. I never wrote again.",
      "created_utc": 1748378669.0,
      "score": 1
    },
    {
      "id": "mul58dl",
      "body": "I know you said, you were there for financial reasons so I don’t know if this solution fits or not, but you could vet your dollar a safe for under $100 dollars that way your mom couldn’t get into it.",
      "created_utc": 1748380441.0,
      "score": 1
    },
    {
      "id": "mulalzg",
      "body": "When I was around 14/15, my father read my diary out loud to me and made me sit and listen so I could answer any questions he had. There wasn't much of interest in there actually, and he soon lost interest, but it certainly made me feel humiliated, belittled, and worst of all, not trusted. So much so, I recall it now and then with horror 45 years later. It's a terrible thing to do to anyone. You have done the right thing. I know teenagers can go wild, but trust is so important. It's how we learn, too.",
      "created_utc": 1748382092.0,
      "score": 1
    },
    {
      "id": "mulg679",
      "body": "When will grandparents understand they are entitled to literally fuck all when it comes to their grandkids?",
      "created_utc": 1748383835.0,
      "score": 1
    },
    {
      "id": "mulvuap",
      "body": "So many falling for another AI post again",
      "created_utc": 1748388990.0,
      "score": 1
    },
    {
      "id": "munghkt",
      "body": "The overbearing mother. 😳",
      "created_utc": 1748410515.0,
      "score": 1
    },
    {
      "id": "muhi7ud",
      "body": "Imo you're wonderful for standing up for your daughter's privacy. I will never understand the thought boomers and gen x have on not giving children the right to privacy and autonomy. They deserve respect just as much as adults do. It's infuriating. When I was a kid I felt like I had no rights and was abused by a teacher. Then my parents had the nerve to be upset that I didnt tell them until adulthood. Like hello! You taught me to respect and listen to authority no questions!",
      "created_utc": 1748336974.0,
      "score": 1
    },
    {
      "id": "muf3dfn",
      "body": "My grandmother threw out my favorite doll (peewee herman- when the news broke about him all those years ago).   I never forgave her and she’s done more terrible things to my family since as I grew older.   My mother and I moved out as soon as she could afford it and being estranged from my grandmother would have been the best thing that ever happened.  She was a rotten person that terrorized us and stalked us.  Stick to your guns and keep your new boundaries with her.   Good job mama.",
      "created_utc": 1748298550.0,
      "score": 1
    },
    {
      "id": "muea173",
      "body": "Absolutely good on you, mama. You are doing exactly what you should be in this situation. You told your mother that that was not acceptable, and she did it again anyhow. These are just natural consequences from her actions.",
      "created_utc": 1748289000.0,
      "score": 0
    },
    {
      "id": "muhilej",
      "body": "You’re absolutely right to set those boundaries. Your daughter deserves privacy and trust, especially from family. It’s heartbreaking that your mom not only broke that trust but tried to justify it. I’m so glad you’re standing up for your daughter and protecting her safe space. Moving is a big step, but it sounds like you’re doing what’s best for her wellbeing. She’s lucky to have you.",
      "created_utc": 1748337209.0,
      "score": 0
    },
    {
      "id": "muj0j2k",
      "body": "you’re an amazing fucking mom.",
      "created_utc": 1748358734.0,
      "score": 0
    },
    {
      "id": "mue2sej",
      "body": "OP is probably a bot",
      "created_utc": 1748286703.0,
      "score": -4
    },
    {
      "id": "mue1ihg",
      "body": "I came here to say pretty much the same thing. When I was in my teens (early 1970’s) my closest high school friend moved across country so we resorted to letter writing. A few years later my mother admitted to me that she had steamed their envelopes open, read the letters and then glued them closed before I came home from school. I have never been able to keep a diary or journal.",
      "created_utc": 1748286302.0,
      "score": 458
    },
    {
      "id": "mug8jc3",
      "body": "Me too. I would get wildly punished for it and was told not to “write anything (I) “didn’t want other people to read”  if I didn’t like it. I was 12 or 13 for crying out loud!",
      "created_utc": 1748313486.0,
      "score": 32
    },
    {
      "id": "mujibfp",
      "body": "My dad boasted that he burned mine when he found it. \n\nIt was filled with the accounts of abuse I suffered, I have memory issues due to it but it's getting better. He just wanted to erase the \"lies\" as he called them. \n\nI bet he wondered why he was alone on his deathbed.",
      "created_utc": 1748363780.0,
      "score": 21
    },
    {
      "id": "muh81ai",
      "body": "I have the same experience. I used to write journal entries in my notebooks and throw them away in random dustbins in my school. I still don't write physical entries now that I have a little more independence, it's just idk, it makes me scared that someone will read it.",
      "created_utc": 1748330681.0,
      "score": 7
    },
    {
      "id": "mugywa3",
      "body": "In a weird way I’m grateful to my mom for doing this. It taught me never to write down something that I don’t want anyone finding out.",
      "created_utc": 1748325459.0,
      "score": 5
    },
    {
      "id": "muixhk5",
      "body": "My son won't even let me have his twitter handle.  I think it's very unfair.  \n\nBut everyone should have their own right to privacy.",
      "created_utc": 1748357868.0,
      "score": 0
    },
    {
      "id": "muep8vl",
      "body": "Yeah, this is diabolical. Is she the grandmother from Flowers in the Attic, or what?",
      "created_utc": 1748293795.0,
      "score": 343
    },
    {
      "id": "mudwi74",
      "body": "This ^",
      "created_utc": 1748284760.0,
      "score": 101
    },
    {
      "id": "mudwogw",
      "body": "The box with some form of code or a heavier lock would be advisable. Diary locks are notoriously easy to pick or bust open. \nI used to consistently lose my key, so I learned early on how to pick the lock...also learned how to get into my mom's fireproof lock box too (at her behest).",
      "created_utc": 1748284814.0,
      "score": 673
    },
    {
      "id": "mue0ag6",
      "body": "Trust affects the way relationships build. Can't say this enough. My mother gives me 0 privacy and shows me constantly that I can't trust her and she doesn't trust me. She'll be the first one wondering why we'll never see each other again when I move out(she is also manipulative and emotionally abusive).",
      "created_utc": 1748285922.0,
      "score": 105
    },
    {
      "id": "mueo8eo",
      "body": "Little locker with a lock, I think Ikea has em",
      "created_utc": 1748293475.0,
      "score": 14
    },
    {
      "id": "mufgw6x",
      "body": "Notepad app on a cell phone or a private laptop with a password on it are better options for journaling, too",
      "created_utc": 1748303353.0,
      "score": 15
    },
    {
      "id": "mue6k0m",
      "body": "My mum and my sister read mine and then teased me about the contents. I had severe mental health issues that I never got any help for and my diary was a way to process my thoughts. I’m 43 and that betrayal still hurts. I’m so glad this mum is protecting her daughter",
      "created_utc": 1748287892.0,
      "score": 133
    },
    {
      "id": "mui1wme",
      "body": "I didn't have a journal/diary growing up.  One year, I was given one and I started writing in it.  Then my parents read it and used what was in it against me.  I never wrote in it again.\n\nTangentially related, I also used to use LiveJournal when that was a thing (For those that don't know: Think \"write a journal\" but it's publicly visible) and I didn't find this out till WAY WAY WAY later in life when I was reconnecting with someone I hadn't seen in years and I asked them why their parents always hated me when we were younger and they told me their parents had read my LiveJournal and saw something in it which apparently they had misunderstood to mean something else that wasn't true, so the reason the two of us fell apart in high school was because their parents misinterpreted something I wrote.",
      "created_utc": 1748347045.0,
      "score": 12
    },
    {
      "id": "mumfhvj",
      "body": "Also agree good on OP! My mother is why I never will have a written diary, password keep everything, and have MAJOR trust issues still to this day. I was majorly hospitalized in college, living on me own, and me in the hospital was her excuse to read through everything on my phone after telling me I needed to give it to her because I couldn't be trusted using it while on heavy pain killers.",
      "created_utc": 1748395676.0,
      "score": 2
    },
    {
      "id": "mue8f92",
      "body": "You are much better than me. The first time it happened I would have told my daughter to include lots on info as to why  my mother is not a nice person. Body odour, aging badly , you name it.",
      "created_utc": 1748288483.0,
      "score": 144
    },
    {
      "id": "muew4d6",
      "body": "and let her (daughter) keep it in your (mom) trunk during the day.",
      "created_utc": 1748296041.0,
      "score": 18
    },
    {
      "id": "mui22qm",
      "body": "Giving your daughter a way to physically lock up a possession in a way that secures it from prying eyes - including your own - is very likely to demonstrate that you're a safe parent and that you trust your kid.",
      "created_utc": 1748347115.0,
      "score": 5
    },
    {
      "id": "mue7n5h",
      "body": "This is me to a tee.  I never confided in my mother either.  That kind of violation of privacy you NEVER forget.\n\n\n☝️",
      "created_utc": 1748288235.0,
      "score": 36
    },
    {
      "id": "mug01gu",
      "body": "That’s how I knew for sure my mom was snooping on purpose. She’d come confront me holding folded up notes that I was passing with friends during school. The only way she could’ve gotten them would be from opening my backpack or going through my school folders. I think that almost hurt me more than when she’d read my diary cause it felt like she was bored and looking for something juicy",
      "created_utc": 1748310344.0,
      "score": 23
    },
    {
      "id": "muf11ng",
      "body": "Wtf?? That's so evil!",
      "created_utc": 1748297732.0,
      "score": 14
    },
    {
      "id": "mujoxhc",
      "body": "I came home to my diary open to the specific page I was getting in trouble for on the dining room table. It was miserable…",
      "created_utc": 1748365619.0,
      "score": 5
    },
    {
      "id": "mujesqi",
      "body": "I don't normally comment on things but I'm just curious what did your mom say when the therapist said that? Also I'm sorry your mom did that.",
      "created_utc": 1748362761.0,
      "score": 2
    },
    {
      "id": "mujpb7c",
      "body": "Same thing happened to me; I got SCREAMED at for the contents of my diary. Even though it was 10-ish years ago, and I am a married adult I cannot write in a journal without anxiety",
      "created_utc": 1748365724.0,
      "score": 2
    },
    {
      "id": "mudzhpo",
      "body": "It’s not a mistake to intentionally read someone else’s private thoughts. It’s an intentional decision.",
      "created_utc": 1748285674.0,
      "score": 8
    },
    {
      "id": "mudyxy2",
      "body": "Failing this buy a cheap document safe so she has somewhere to keep important things in the house",
      "created_utc": 1748285503.0,
      "score": 6
    },
    {
      "id": "mugoip6",
      "body": "Your parents allowed him to treat you like that?",
      "created_utc": 1748320188.0,
      "score": 2
    },
    {
      "id": "muhmxz1",
      "body": "I had a stalker break into my dorm room and photograph my journal.. Haven't written in there since, and I know I really need to for my emotional health. \nI just don't know how to get back into it without those vulnerable feelings eating at me...",
      "created_utc": 1748339784.0,
      "score": 1
    },
    {
      "id": "munbvqw",
      "body": "No literally.. If anyone read my diary, all they’d be doing is hurting themselves. I don’t mean what I write. I just need to get my feelings out when it’s heightened, until my nerves are calmed (which is like only a few sentences into the entry). This is also the reason all my entries are only written halfway. But it really helps me regulate bad emotions.",
      "created_utc": 1748408235.0,
      "score": 1
    },
    {
      "id": "muikosa",
      "body": "Hello me. I am also closed off, stoic, unreadable, invulnerable, and emotionally unavailable to onlookers. I am hyper vigilant of every movement, facial expression, word, and action I make. Because I learned early, and I learned well that any and all information anyone has on you is a vulnerability and weakness. We do not advertise our weak spots, and we do not react when they are poked. \n\nI’m often told I’m a great conversationalist, and extremely easy to talk to. That’s by design. If we’re talking about you, not only is that protecting me from exposing weaknesses, it’s also quietly obtaining my own store of ammo if I ever need to defend myself from you. Only ever in defence. Anything else is reprehensible. \n\nOnly a small number of people in my life, a smaller number than the count of the fingers of my left hand, have even known me enough to say, “you know what, I’ve known you for years, and I feel I know you well, but I’ve realised I actually know next to nothing about you beyond a superficial level”. Good. But cautious now, even that’s too close if you can see how much is kept unseen. \n\nTrauma, kiddos. It’s a hard and cruel, but viciously effective method of discovering how to protect yourself, regardless of what it ends up costing you in the end.",
      "created_utc": 1748353878.0,
      "score": 3
    },
    {
      "id": "muhpksu",
      "body": "It’s op and their daughter who live with the mother for financial reasons. It’s the mother’s house. But this **does not give op’s mother the passport to be nosey and break boundaries. IT’S STILL NOT ACCEPTABLE**",
      "created_utc": 1748341263.0,
      "score": 2
    },
    {
      "id": "mue5kyr",
      "body": "Wow. That was some serious effort on your mom’s part. I’m sorry you went through that! \nMy mom always tried to claim that it was “just right there” in front of her. Basically the “it just fell open in front of me and I happened to glance over!” excuse. \nJust curious, did your mom ever confront you about anything you wrote or “mysteriously” find out about something you may have written to your friend or did she just keep quiet about it until finally admitting it to you?",
      "created_utc": 1748287582.0,
      "score": 174
    },
    {
      "id": "mugi050",
      "body": "That’s such a painful breach of trust. No wonder journaling feels impossible, when your most private thoughts were invaded like that, it leaves a lasting mark. What your mom did wasn’t protective, it was controlling, and it robbed you of a sense of safe self-expression. I hope you’ve found other ways to reclaim that space for yourself, even if it looks different now.",
      "created_utc": 1748317253.0,
      "score": 14
    },
    {
      "id": "mumdsi5",
      "body": "There is a free journal/diary app called Chronicle that can be password protected. You can write whatever you want and be free of the fear of your privacy being invaded.",
      "created_utc": 1748395080.0,
      "score": 3
    },
    {
      "id": "mudykne",
      "body": "True. I was thinking the ones with the code lock but a box would be better anyway, because she can put various notebooks in and not have to keep paying for lockable diaries.",
      "created_utc": 1748285391.0,
      "score": 174
    },
    {
      "id": "mue2737",
      "body": "Yep, when I was heavy into my drug addiction I was able to pick the lock on their fireproof Sentry lock box that fit under their bed.\n So don't get that brand!!",
      "created_utc": 1748286518.0,
      "score": 48
    },
    {
      "id": "mufhn44",
      "body": "I’m so sorry you go through this & that people in the future will wonder why you have trust issues. Hugs.",
      "created_utc": 1748303623.0,
      "score": 12
    },
    {
      "id": "mufr5zz",
      "body": "I used to do mine on my laptop and password protect the Word documents so nobody could read it",
      "created_utc": 1748307112.0,
      "score": 9
    },
    {
      "id": "mueaxj0",
      "body": "I do like y'all's approach but it's not going to stop the mother-in-law. Only a lock and key is going to do that. She should be ashamed of herself.",
      "created_utc": 1748289289.0,
      "score": 72
    },
    {
      "id": "mugy0az",
      "body": "Unfortunately, I was blamed a lot of the time for “riling him up”, although he was a fully grown adult, and I was a girl with undiagnosed ADHD. The only person who defended me was his ex wife/then girlfriend/fiancée. There’s a lot of other, worse shit that happened, but he’s my half brother from my dad’s first marriage and his mum had an affair, so make of it what you will.",
      "created_utc": 1748324983.0,
      "score": 4
    },
    {
      "id": "mui9uie",
      "body": "If you're the type of person who doesn't read the entries back, you could get scrap paper or loose lined paper, write down on it, and then shred/tear up/burn the pages? Gets out the feelings while also preventing anyone from ever reading it.",
      "created_utc": 1748350145.0,
      "score": 2
    },
    {
      "id": "muju37t",
      "body": "Absolutely the same.\nI can read someone’s mood by watching them enter a room. \nI unconsciously pay such close attention to what people say and do that I can pickup on the slightest discrepancy.\nI assume I will be “betrayed” by everyone I encounter. \nJokes on them cause I never let them close enough to inflict emotional pain.\nDon’t get attached is my motto!\nOh and I am hilarious. \nSuper quick witted and able to deflect with humor.\nThe betrayal of the reading of my diary was really just an early example of the trauma I had in childhood, hell I was still so innocent I wrote feelings down (how stupid was I)! Yet I am certain most were and probably still are envious of my “picture perfect childhood”. 🙄",
      "created_utc": 1748367039.0,
      "score": 2
    },
    {
      "id": "mue83dy",
      "body": "I’m sorry that your mom put you through similar invasions of your privacy! As for my mom I am still stunned at the level of effort that she put into her snooping. I mean she even re-glued the envelopes shut! I can attest to the fact that the letters going back and forth between my school friend and I were extremely boring. I cannot remember anything specific but they would have contained news on our mutual friends, science fair contributors and who won, etc. Truly uninteresting stuff. After she settled in to her new home and school we eventually parted ways. I never told her what my mom did. When my mom told me what she had done she phrased it as her being protective of me. Although I appreciated her being protective I would have easily handed over the letters to see the boring content.",
      "created_utc": 1748288378.0,
      "score": 65
    },
    {
      "id": "mufrcfr",
      "body": "Ty",
      "created_utc": 1748307179.0,
      "score": 5
    },
    {
      "id": "mueaanb",
      "body": "Respectfully, she wasn’t being protective. You have a right to a semblance of privacy, even as a teenager. She was being nosy instead of just asking if she could read them.",
      "created_utc": 1748289085.0,
      "score": 77
    },
    {
      "id": "mui7xkc",
      "body": "Why would she tell you . As fucked up as it is going to all that effort it’s even weirder that she would confess to her crime . \n\nLike what’s the point ? \n\nSaying that my mother also did mad invasions of privacy like that too . So pointless . But I still wonder why ?",
      "created_utc": 1748349435.0,
      "score": 2
    }
  ]
}