{
  "id": "1f9ubpj",
  "title": "I finally showered for the first time in two months, and now I’m crying",
  "selftext": "I know I’m gross, I know it’s disgusting, but my depression has been so bad for the past months I haven’t been able to get in the shower and do the whole thing. It felt so overwhelming. I would usually wipe myself off with alcohol and wet wipes every day and wear my hair in a bun every day because my hair was so knotted I couldn’t brush through it (not that I would want to because it was just a frizzy oily mess.) But today, I did it.\n\nI’ve been cleaning all day. My roommate moved out recently, and I have another one moving in and I’ve gotten so much done today. I’m supposed to meet my new roommate in a couple hours to give him the key and help him get situated. I hate the smell of cleaning products and my clothes were covered in them. So I just said “fuck it, it’s time” I took a warm towel out of the dryer and wrapped myself in it while I brushed my hair for the first time in forever, it took almost an hour and I lost so much hair but I haven’t been able to run my fingers through it in months so it was a relief to see I still have most of it on my head. I put on a good video essay to watch and listen to while I’m in the shower and I did the whole damn thing. Washed and conditioned my hair with a deep conditioner, exfoliated my whole body (holy shit there was so much dead skin), scrubbed everything, shaved, did my hair routine that I haven’t done in months. \n\nI know it’s pathetic and stupid to be proud of myself for something so gross, but I’m crying seeing my curls again for the first time in forever, actually having my hair down, my skin feels soft, and I put on some sweatpants and a t shirt that were still warm from the dryer and it just feels heavenly. I’m typing this with blurry vision from the tears in my eyes and I just wanted to tell someone. No one in my life would understand and they would probably just think I’m insane tbh so I’m just gonna be happy with myself here. I’m gonna go get ready to meet up with my new roommate now.",
  "created_utc": 1725562610.0,
  "score": 6657,
  "num_comments": 698,
  "url": "https://www.reddit.com/r/offmychest/comments/1f9ubpj/i_finally_showered_for_the_first_time_in_two/",
  "comments": [
    {
      "id": "lloibm3",
      "body": "Hey.\n\nYou did a good job.\n\n- someone who's in the '1 shower per week' stage",
      "created_utc": 1725565814.0,
      "score": 2737
    },
    {
      "id": "llojy18",
      "body": "OMG CONGRATULATIONS!!!! im soooo freaking proud of you and I know that shower must have taken forever too getting all the dead skin off \n\nseriously I waiting until the end of the post but the first few sentences I was already just swollen with pride and happiness to hear of your accomplishment :D\n\nI have the same depression issue with showering for some reason so pleeeeease let me know if you ever wanna talk or vent about how \"gross\" we are!! \n\nand I hope you don't take my proud comments as condescending, I authentically and deeply ment evwr word I typed",
      "created_utc": 1725566316.0,
      "score": 1316
    },
    {
      "id": "lloatq8",
      "body": "reminder that a temporary situation is not your identity. not taking a shower in a long while may be morally or socially disgusting, but you as a person are not. I’m sorry whatever you’ve been going through has kept you down, but I’m glad an opportunity popped up that pretty much forced you back in the right direction. I hope this lil feeling inspires you to choose self loving habits over self loathing ones. Proud of you, pls keep your head up 🫶🏾.",
      "created_utc": 1725563444.0,
      "score": 985
    },
    {
      "id": "lloe7gt",
      "body": "I’m proud of you.",
      "created_utc": 1725564519.0,
      "score": 123
    },
    {
      "id": "llohmmp",
      "body": "Please be proud of yourself. Depression does some crazy things to our body and minds.",
      "created_utc": 1725565597.0,
      "score": 176
    },
    {
      "id": "lloepsw",
      "body": "Yay! Congratulations, this is a major accomplishment. Be proud of yourself.",
      "created_utc": 1725564682.0,
      "score": 71
    },
    {
      "id": "lloh64f",
      "body": "Self care ✨💕 Be proud! It felt too heavy/overwhelming to do previously and that’s okay. You feel fantastic now. Just know that if it becomes overwhelming again, the relief you will feel after doing the darn thing will be this exact feeling.",
      "created_utc": 1725565453.0,
      "score": 54
    },
    {
      "id": "llohri8",
      "body": "It's not pathetic or stupid to be proud of yourself for that. You SHOULD be proud. You're being forced to play life on hard mode. What you did is a major victory!",
      "created_utc": 1725565639.0,
      "score": 53
    },
    {
      "id": "llokakn",
      "body": "I know this feeling and I am proud of you. A lot has happened in the past few months that started with losing my mother very unexpectedly and it’s just been downhill since. I’ve been forcing myself to shower because I have to keep my job but if I didn’t have to be here almost everyday I would be in the same boat as you. Do the little things you can don’t worry about the rest. One baby step at a time. You’ll climb this hill.",
      "created_utc": 1725566423.0,
      "score": 53
    },
    {
      "id": "lloouzz",
      "body": "This was brilliant! You didn’t only shower. You hauled ass and cleaned up all damn day too! I haven’t showered for a couple days myself but now you’ve motivated me and I’m going to give myself a spa treatment ❤️ sometimes, all we need, is to just love ourselves a wee bit more too. xo much love and peace to you, friend ✌️",
      "created_utc": 1725567841.0,
      "score": 39
    },
    {
      "id": "llohn61",
      "body": "Proud of you <3",
      "created_utc": 1725565601.0,
      "score": 25
    },
    {
      "id": "llokzfb",
      "body": "It's not pathetic or gross, and neither are you!!  I understand.  It's so easy to just let days, even weeks, drift by in a fog.  Once your head clears and you look around, everything seems so overwhelming you just say \"fuck it\" and let the fog slip back in. Days drift by, and it goes on and on and on and on. \n\nI don't know you, but I'm proud of you!",
      "created_utc": 1725566637.0,
      "score": 28
    },
    {
      "id": "llomfs7",
      "body": "Congratulations! Cleanliness is a morally neutral state of being. You are not lesser or greater for being more or less clean. Depression does some wild things to a person.",
      "created_utc": 1725567093.0,
      "score": 28
    },
    {
      "id": "lloi4o8",
      "body": "We're all proud of you OP, U got this!!!",
      "created_utc": 1725565753.0,
      "score": 22
    },
    {
      "id": "lloq3ai",
      "body": "I have been exactly where you are. It will get better. You will get better. Do small things. Brush your hair, or wash your face. Something small as to not feel overwhelming but enough to make you feel just a little better.",
      "created_utc": 1725568229.0,
      "score": 19
    },
    {
      "id": "llojp1q",
      "body": "I’m really proud of you and what you accomplished here, not a small feat at all !\n\nEnjoy your day and be happy about that shower, you deserve it. I know I’m happy for you sister 💙",
      "created_utc": 1725566240.0,
      "score": 15
    },
    {
      "id": "llokmpo",
      "body": "I know EXACTLY how you feel. Enjoy!",
      "created_utc": 1725566528.0,
      "score": 13
    },
    {
      "id": "llol7ul",
      "body": "I think you deserve to treat yourself to something from lush now",
      "created_utc": 1725566709.0,
      "score": 12
    },
    {
      "id": "llomwjz",
      "body": "Stop feeling all the guilt and shame and stop apologizing to us for thinking you sound gross. Words literally cannot describe how proud I am of you. I know what that's like and I've seen my loved ones go through it (and worse) and I know how hard it is to endure but how strong you have to be to get yourself out of it. I swear, you are your own superhero.",
      "created_utc": 1725567237.0,
      "score": 12
    },
    {
      "id": "llokvaz",
      "body": "You did awesome today.  What a great reward to feel so good you tear up.  I am so proud of you!!",
      "created_utc": 1725566602.0,
      "score": 11
    },
    {
      "id": "llopyhw",
      "body": "It’s not pathetic to be proud of this! I am so proud of you! I know how much work it was for you to do that and also how hard it is to admit this to the internet. So proud and I hope you like your roommate 🙌🏻",
      "created_utc": 1725568187.0,
      "score": 11
    },
    {
      "id": "llph4pi",
      "body": "I’m so proud of you. I suffer from depression and it’s a damm tragedy how hard it is to have to keep up your hygiene while also dealing with depression. \n\nI truly mean this - you did a big thing today and I know how hard it is. I’ve lost a ton of hair before because of it, it hurts and it feels shameful but you did nothing wrong. You did the best you could those two months. \n\nYou are not disgusting. \n\nDepression is the jerk. You are not!",
      "created_utc": 1725577200.0,
      "score": 11
    },
    {
      "id": "llol6nt",
      "body": "I’m so proud of you! And I’m so glad you felt well enough to get up and get so much done. I hope this streak can continue and you wake up feeling okay again tomorrow. And if you’re not already seeking help, I hope you can be brave enough to make an appointment with a professional and start working on your depression soon. Good luck friend! ❤️",
      "created_utc": 1725566699.0,
      "score": 10
    },
    {
      "id": "llol8x8",
      "body": "You did good! I'm proud of you, and I'm happy you're enjoying feeling clean and accomplished.",
      "created_utc": 1725566718.0,
      "score": 9
    },
    {
      "id": "lloxpo2",
      "body": "Girl don't feel bad this was literally me 2 weeks ago. I sat in the shower and sobbed for an hour and brushed out enough gross hair to make a wig from hell. Keep it up now and don't ever get back to that place again. You got this. ♥️",
      "created_utc": 1725570591.0,
      "score": 11
    },
    {
      "id": "llpdv2t",
      "body": "Depression is so incredibly painful and isolating. And when it gets severe, nearly paralyzing. I'm glad you were able to find it within you to show yourself some love, which you absolutely deserve. Hang on, keep putting one foot in front of the other, and remember that even though we don't know you personally, we're all rooting for you. <3",
      "created_utc": 1725576035.0,
      "score": 9
    },
    {
      "id": "llpjnf8",
      "body": "Hey, you did the thing! That's awesome. \n\nI have not had as severe a situation, but two winters ago following some life changes and stressors, I began neglecting my hygeine, too. I didn't work for many months, and if I made it into the shower twice in a calendar week, I was doing the best I could do. Depression felt new. Anxiety? Now, that's like, \"hello darkness, my old friend\", but that absolute enervated feeling was not a thing I was accustomed to. And yes, getting a shower felt herculean in the effort and energy it took. I'd avoid it because I was cold, because I didn't know what to wear, because I had nowhere to go anyway, etc. Any reason *not* to. \n\nYou have got to feel physically like a million bucks today!! Put fresh sheets, blankets, and pillow cases on your bed and just revel in the feeling of it all tonight.\n\nWhatever your situation, I hope it gets better for you. \n\nBest to you! ❤️",
      "created_utc": 1725578117.0,
      "score": 8
    },
    {
      "id": "llomj33",
      "body": "It's not pathetic to be proud of yourself! \n\nBe proud that's awesome ans do your best to make it routine. \n\nIf you feel great now imagine how you'll feel when you're accomplishing it every week or every day",
      "created_utc": 1725567121.0,
      "score": 8
    },
    {
      "id": "llomyb7",
      "body": "We are very proud of you <3\nYou probably feel like a whole new person. It is great to hear that you did some self care :)",
      "created_utc": 1725567252.0,
      "score": 7
    },
    {
      "id": "llos6d4",
      "body": "We are all proud of you. Well done for taking action and doing something kind for yourself. Congratulations, and I hope it goes well with the meet up.",
      "created_utc": 1725568878.0,
      "score": 8
    },
    {
      "id": "llosnhv",
      "body": "I am so proud of you. I am so glad you are taking care of yourself. What a way to indulge! Good for you.",
      "created_utc": 1725569021.0,
      "score": 7
    },
    {
      "id": "llotzmc",
      "body": "Aw honey you should be proud of yourself. This is the first step to feeling better. Good for you. You’re worth it.",
      "created_utc": 1725569429.0,
      "score": 8
    },
    {
      "id": "lloxm3f",
      "body": "You couldn’t be more wrong when you say it’s stupid and pathetic that you feel proud. \nEvery day you work on getting back up is a day to be proud of, shit even the days where you can’t even bare to think but you make it through them is a day to be proud of \n\nWell done OP, I’m proud of you too",
      "created_utc": 1725570559.0,
      "score": 8
    },
    {
      "id": "llpaaa2",
      "body": "That's a big freaking deal !! You're not gross, I've been there too. I get very embarrassed with myself , but mental health can be really debilitating. You did a really big thing , show yourself some grace OP :)",
      "created_utc": 1725574769.0,
      "score": 8
    },
    {
      "id": "llpf6jq",
      "body": "I am so incredibly proud of you! That is something to feel proud of and don’t let anyone try to tell you otherwise! \nDepression is no joke, it completely drains you of everything. You have no energy at all and what little you do have you use for things like eating. Even using the bathroom can be completely exhausting. Unless you have been there, it’s incredibly hard to understand. \n\nI told my therapist that I felt like I was drowning and no one noticed. I did what I needed to do to get through the day and that was about it. Not a single person noticed the difference. Which just made things worse. \n\nRemind yourself that those voices lie. Even if it a constant ongoing mantra you say. \nWrite a schedule to yourself for self care that includes a shower at least every other day. And above all you ARE worth it!!",
      "created_utc": 1725576509.0,
      "score": 8
    },
    {
      "id": "llonn96",
      "body": "great job, keep going. we’re all proud of you and you should be proud of yourself! you got this op <3",
      "created_utc": 1725567465.0,
      "score": 8
    },
    {
      "id": "lloos55",
      "body": "💚💚",
      "created_utc": 1725567816.0,
      "score": 7
    },
    {
      "id": "llosx4j",
      "body": "I'm proud of you! I know how hard it is to get in the shower when you've gotten to that point, and you did a great job! You did it and got through it, stuff happens in life and sometimes we just need to roll with the wins we have accomplished.  You did great",
      "created_utc": 1725569100.0,
      "score": 7
    },
    {
      "id": "llpdffq",
      "body": "Showering is so hard when you’re depressed. I always know when the cloud is lifting because I suddenly start taking care of myself again, showering, shaving, etc. \n\nRevel in this day and how good you feel, focus on that alone. Have a great day :)",
      "created_utc": 1725575876.0,
      "score": 6
    },
    {
      "id": "llpeoob",
      "body": "Ugh I wish I had your courage. I’m so proud of you thank so so much for sharing. It’s really inspiring and really encouraging.",
      "created_utc": 1725576333.0,
      "score": 8
    },
    {
      "id": "llph5zz",
      "body": "I am so proud of you for doing this. And thank you for sharing.. god knows that couldn’t have been easy but you did it and that is the most important thing. Lots of love and best wishes from a stranger who understand the feeling and who is truly grateful for the strength of decision making you found in yourself.",
      "created_utc": 1725577213.0,
      "score": 7
    },
    {
      "id": "llpjou3",
      "body": "darling, that’s not “pathetic” and it’s not “stupid to be proud of yourself” for this. depression is real, it’s hard, and you absolutely deserve to be proud of yourself.\n\nif you feel silly being proud of yourself, then i’m proud of you. you did a good job. i know what it’s like to be insanely overwhelmed and you did an amazing fucking job. \n\ngood job.",
      "created_utc": 1725578132.0,
      "score": 8
    },
    {
      "id": "llpjyog",
      "body": "Remember this feeling. Today. In this moment. This is the feeling of clean + accomplishment + hope. \n\nThe next time you don’t want to shower, weigh how much you love this feeling, verses how shitty it made you feel that you didn’t shower. I just kept remembering how awesome I felt after that first time, so I just pushed myself to eventually take one every other day (or so.) \n\nNow that you’ve conquered this, you could plan and schedule to do it once a week. Then work your way to twice a week. This is how I conquered showering. Proud of you. Sending good thoughts, you are NOT ALONE in this issue.  xoxo",
      "created_utc": 1725578230.0,
      "score": 7
    },
    {
      "id": "llpler7",
      "body": "Well bloody done. Eat the elephant one bite at a time and pause at will. It’s so tough remembering to grant yourself wins, so you double triumphed by doing something hard and allowing yourself a podium nod in recognition of that. They’re both steps forward that matter and so you should add another pride blossom and harvest the hattrick. Wishing you all the best. Xx",
      "created_utc": 1725578752.0,
      "score": 7
    },
    {
      "id": "llplo41",
      "body": "That takes suuuuch hard work and so much effort when your brain is fighting you the whole time. Amazing job!!!! Be proud!",
      "created_utc": 1725578845.0,
      "score": 7
    },
    {
      "id": "llpmvm9",
      "body": "You're not alone. Hugs!\n\nYou deserve it! So proud of you! One day at a time!",
      "created_utc": 1725579281.0,
      "score": 7
    },
    {
      "id": "llpnydh",
      "body": "Congratulations on the huge step. Steps. Finding that energy as you struggle with depression is so hard.",
      "created_utc": 1725579670.0,
      "score": 7
    },
    {
      "id": "llq6tjy",
      "body": "Honestly so proud of you. I’ve given up the will to live and posts like these help me keep going. Wish you nothing  but happiness ❤️❤️❤️❤️",
      "created_utc": 1725586475.0,
      "score": 7
    },
    {
      "id": "llqc6yf",
      "body": "Hey, OP, this internet stranger is very proud of you. I have suffered from treatment resistant severe depression for my entire adult life. My therapist ALWAYS gives me a hug at the end of our session. After I hadn’t showered in over a month, he finally told me that he wouldn’t be hugging me any more until I showered. I burned with humiliation and departed without a word. I was angry, ashamed, sad, and a whole host of other emotions. But, the morning of our next session, I got my filthy ass in the shower! It felt so strange, to have the hot water cascading down over me, the soap, the shampoo, the whole nine yards. Even standing upright in the shower long enough to bathe and wash my hair felt like an accomplishment, since most of my time was spent in bed, sleeping my life away. I was so proud of myself when I arrived for our session, and I got my hug! \n\nPlease accept a virtual hug from this internet stranger! Don’t feel too pressured to repeat this every day, but it should be easier after the first time.",
      "created_utc": 1725588400.0,
      "score": 7
    },
    {
      "id": "llofhx0",
      "body": "❤️🙏🏻💚",
      "created_utc": 1725564929.0,
      "score": 13
    },
    {
      "id": "llono5j",
      "body": "I'm so proud of you, OP! I love curls so much, I'm glad you were able to detangle ur hair. Keep it going, u got this!",
      "created_utc": 1725567473.0,
      "score": 7
    },
    {
      "id": "lloo7y3",
      "body": "I’m so proud of you! ❤️",
      "created_utc": 1725567644.0,
      "score": 7
    },
    {
      "id": "lloof3f",
      "body": "I have been through this...hair snarls and all. Be proud of yourself! Take that joy, even if only momentarily.  Much love from someone that gets it.  Hang in there.",
      "created_utc": 1725567705.0,
      "score": 6
    },
    {
      "id": "llop0wf",
      "body": "I am so proud of you. \n\nI know I am just a random stranger but I know how hard it can be. And I am so proud of you. Take pride in every small win. It won't always be like this. So for now, be proud of each small thing. And a random stranger in Maryland is cheering you on crying big ugly tears because they are proud of you too.",
      "created_utc": 1725567892.0,
      "score": 6
    },
    {
      "id": "llopt1d",
      "body": "depression is a witch.\n\ngood job! celebrate this as a win! don't think of it as how gross it was. but what you are doing now. hugs.",
      "created_utc": 1725568139.0,
      "score": 6
    },
    {
      "id": "lloqvg8",
      "body": ">I know it’s pathetic and stupid to be proud of myself\n\nWell, I guess I'm pathetic and stupid for being proud of you too.",
      "created_utc": 1725568475.0,
      "score": 6
    },
    {
      "id": "llor4vk",
      "body": "I usually went on drinking benders over the weekends. I would be depressed all week and that’s how I released. That of course meant no showers. But I found, that even with the heaviest hangover, a shower helped. It wasn’t all sunshine and rainbows but it got me closer to it.",
      "created_utc": 1725568556.0,
      "score": 5
    },
    {
      "id": "llopo0f",
      "body": "That is some insane effort when you haven't been feeling like yourself. You did amazing I'm so proud of you",
      "created_utc": 1725568095.0,
      "score": 5
    },
    {
      "id": "llor310",
      "body": "It’s not pathetic and stupid! I’m proud of you too.",
      "created_utc": 1725568541.0,
      "score": 6
    },
    {
      "id": "llor5ai",
      "body": "It is not pathetic and stupid to be proud of this. This is such a huge accomplishment, and I’m happy you feel so much better!",
      "created_utc": 1725568560.0,
      "score": 5
    },
    {
      "id": "llorbku",
      "body": "I'm so proud of you! It's literally been like 3 weeks since I've showered. Same boat. It happens. You crushed it.",
      "created_utc": 1725568615.0,
      "score": 6
    },
    {
      "id": "llorbra",
      "body": "Good for you for celebrating your victories! 👑 You are NOT alone, so many people have similar issues and depression can be a monster. I hope you can keep this going for yourself, but don’t beat yourself up if you backslide. One day at a time!",
      "created_utc": 1725568616.0,
      "score": 5
    },
    {
      "id": "llorwzo",
      "body": "Good for you. It’s so hard when you don’t have the spoons.  Glad you were able to get clean and hopefully use that, the clean house and new roomie as positive motivation.  Internet hugs for you.",
      "created_utc": 1725568798.0,
      "score": 5
    },
    {
      "id": "llosouj",
      "body": "My skin reacts negatively to water, and has for the past 10 years, basically for as long as I can remember. It gets so goddamn itchy, and if I don't satiate the itch, it starts to burn and makes my legs twitch of their own accord. It literally feels like I have hives underneath my skin, yet nothing shows up on the surface.\n\nI also have depression, and so that on top of the skin issues has led me to being in your place many times. Words can't describe how bittersweet it is for so many reasons, it's honestly overwhelming. I'm so proud of you, and I hope you're able to persevere. Small victories still count as victories 🫶🏻",
      "created_utc": 1725569032.0,
      "score": 5
    },
    {
      "id": "lloty36",
      "body": "I read this and was like, who has had a camera watching me for the past 48 hours. I also deal with this quite often, and you should be proud of yourself. The 1st step is always something, but at least you did it!! 👏 👏 👏 👏 depression is a living nightmare but if we walking thru it might as well hold hands ya know.",
      "created_utc": 1725569416.0,
      "score": 6
    },
    {
      "id": "llouyjs",
      "body": "Damn. Girl I completely understand it i don't know about you but mine was PPD combined with dealing with a abusive partner it's a different situation but I sure as hell didn't take care of myself at ALL! But I understand that feeling of finally getting over that hurdle and just getting it done and feeling amazing immediately right after. Be proud of yourself hell I'm a stranger but I'm proud of you",
      "created_utc": 1725569723.0,
      "score": 5
    },
    {
      "id": "lloy5qg",
      "body": "🎉🎉🎉🎉 you did it!!!\n\n( ^-^)ノ∠※。.:*:・'°☆\n\nIt must've been overwhelming, I'm proud of you! Which video essay did you watch?",
      "created_utc": 1725570734.0,
      "score": 4
    },
    {
      "id": "lloy9eo",
      "body": "Hugs!! One hour at a time friend! You got this",
      "created_utc": 1725570767.0,
      "score": 6
    },
    {
      "id": "llozqzg",
      "body": "I am so so proud of you OP, that is genuinely an incredible accomplishment. A whole load of cleaning and a shower and fresh clothes/towel from the dryer all in one day?? That’s actually insane! Seriously. I’ve been there and doing all that when you’re in such a low place is incredible. You are a bloody rockstar! I honestly teared up a bit reading your post because I feel your feeling, the relief, the pride. And you deserve all that feeling and more. You’re incredible. I’m so proud of you mate 🥹",
      "created_utc": 1725571245.0,
      "score": 4
    },
    {
      "id": "llp02cn",
      "body": "A lot of people have to do a different kind of self care when they are depressed, which means things like showers get overlooked. Sometimes all you can do is make it through the day. But you made it through those days, and I’m proud of you.",
      "created_utc": 1725571347.0,
      "score": 5
    },
    {
      "id": "llp06lq",
      "body": "i never thought that the people commenting \"i'm so proud of you\" on people's reddit posts could be genuine until i read your post and had an overwhelming feeling of pride and empathy for you. i am so, so proud of you. you are not gross or less than, you are just struggling. and i'm so proud of you for having taken the step today to feel better. i know it must have been so daunting and embarrassing, but you did it now and that's what matters. now that you've done the big one, hopefully it becomes easier to do it again. hold onto this feeling of comfort and happiness, and know that you deserve to feel it always.",
      "created_utc": 1725571386.0,
      "score": 4
    },
    {
      "id": "llp0d9x",
      "body": "Coming out of a two month depression myself.  Just sitting there trying to brush out matts of hair, especially *naturally* curly hair is…. Very defeating.  I know it all too well.  But you’ve taken the first steps and I’m so proud of you.",
      "created_utc": 1725571446.0,
      "score": 5
    },
    {
      "id": "llp3fzs",
      "body": "It's a big thing to be able to get into the shower and clean up after a long while of being unable to. A lot of folks take this ability for granted, you know? When your mind betrays you like this, it really is like moving mountains to do what most folk consider \"simple\". \n\nDon't be hard on yourself. You did such a good job and this internet stranger is very proud of you for mustering up the energy to get a few things done today! 🥳\n\nAlso, I'm mighty glad you're still here with us~",
      "created_utc": 1725572450.0,
      "score": 5
    },
    {
      "id": "llp4v6q",
      "body": "There is nothing pathetic or stupid about any of this. Depression is an absolute b!tch and can be a struggle no matter what.\n\nYou're doing great, even if it doesn't feel that way usually. Cleaning up in a way that you can manage is good. You're doing your best at any given moment, be easier on yourself. You're forgetting that everything you do manage is still something too.\n\nI have both depression and ADHD/Autism and my executive function is trash. But sometimes I get a small burst of deadline energy where I can do a thing suddenly, and not again for ages. Sounds like you might live in a similar state, and just enough sensory issues with cleaning supplies (same tho) to tip past whatever is blocking you from something every once in a while.\nI hope this lasts a bit longer for you, but even if it doesn't, I'm proud of you for doing the thing!",
      "created_utc": 1725572914.0,
      "score": 5
    },
    {
      "id": "llpbxmv",
      "body": "Good for you! I'm proud of you! I hope that you can get some help for your depression. I would recommend that you start a walking program. Walk at a comfortable pace every day for at least 30 minutes. I promise you that you will quickly notice a change in your mood.",
      "created_utc": 1725575345.0,
      "score": 6
    },
    {
      "id": "llpdmb6",
      "body": "It’s not pathetic and stupid. It’s hard to feel worth taking care of ourselves sometimes. Great job OP. Any step is a big step imo",
      "created_utc": 1725575946.0,
      "score": 5
    },
    {
      "id": "llpezi1",
      "body": "Congratulations ❤️\nWhat a good job you did. Incase nobody else told you today, we as a community are proud of you!",
      "created_utc": 1725576440.0,
      "score": 5
    },
    {
      "id": "llpf2bw",
      "body": "Please know there are people you don’t know cheering for you.",
      "created_utc": 1725576467.0,
      "score": 4
    },
    {
      "id": "llpfa5z",
      "body": "Don’t compare yourself to others. Just recently you hadn’t showered in months, now look at you, you took care of you and did a good strong first step. You are right to be proud, hell, I feel proud of you! :)",
      "created_utc": 1725576545.0,
      "score": 6
    },
    {
      "id": "llpjaen",
      "body": "Congrats, depression is a B, this is the first step on a long path towards happiness, I’m really happy about you OP, best of luck to you\n\nI hope you have a smooth path to recovery",
      "created_utc": 1725577986.0,
      "score": 5
    },
    {
      "id": "llpkpfz",
      "body": "You’re not gross or disgusting. You’re human that has been struggling. Congratulations, OP and thank you for sharing your victory! Be easy with yourself. ♥️",
      "created_utc": 1725578499.0,
      "score": 4
    },
    {
      "id": "llpma23",
      "body": "I’m so proud of you ! You did amazing",
      "created_utc": 1725579063.0,
      "score": 6
    },
    {
      "id": "llq863f",
      "body": "This momma is SUPER proud of you hun.",
      "created_utc": 1725586956.0,
      "score": 5
    },
    {
      "id": "llq8wnz",
      "body": "Take away all of that self depreciation. You absolutely should be proud of yourself. It's not silly at all! There are so many people out there who understand this struggle who are extremely proud of you too.\n\nToday was a huge win for you. You did the thing that your brain wouldn't let you do for so long. Good on you!",
      "created_utc": 1725587217.0,
      "score": 5
    },
    {
      "id": "llq91mc",
      "body": "I’m so proud of you OP! As someone who’s been in a similar situation in the past. 4-6 weeks without a shower or brushing my teeth. Basically 0 self care. I know how it feels to think of oneself as “gross”. What you did was amazing! Something that has helped me recently is telling myself “it doesn’t have to be perfect it just has to get done.” So if that looks like brushing my hair on a Saturday and taking the fastest shower possible on a Sunday and rinsing with mouthwash. It stills feels like a win. You did great today! ♥️",
      "created_utc": 1725587266.0,
      "score": 5
    },
    {
      "id": "llq9mit",
      "body": "You should be as proud of yourself as the rest of us are of you. Being stuck in that stage and finally doing a small something to break yourself out is world altering, and a HUGE win! Most people can only do the baby steps, but you just ran a marathon and came out the other side! Congratulations!",
      "created_utc": 1725587481.0,
      "score": 5
    },
    {
      "id": "llrra24",
      "body": "IM SO FREAKIN PROUD OF YOU!! I’m part of the once every 2 weeks crowd right now and working to the once a week crowd. Every thing you do is progress. Even getting out of bed is progress. Just keep on keeping on",
      "created_utc": 1725616208.0,
      "score": 6
    },
    {
      "id": "llopi4z",
      "body": "Congrats on the end of it. \n\nDepression is deep rest. So you rested and now are moving up and going. \n\nIt’s better to self gentle than self critical. I’d say grieve it out and go through the process. \nStay hydrated and take your vitamins. It’s temporary and you’ll be okay.",
      "created_utc": 1725568043.0,
      "score": 5
    },
    {
      "id": "lloqorq",
      "body": "sending love, OP 🫂 \n\nit takes strength to pull yourself out of the pit\n\nnow don't allow yourself to fall again. when you feel yourself slip, go for walks, go to the gym, go for a massage, cook a nice meal and read a good book or whatever makes you happy, but don't fall into the pit again.\n\ntake care of yourself. you are loved.",
      "created_utc": 1725568417.0,
      "score": 4
    },
    {
      "id": "llorrch",
      "body": "This is a great step.  While I’ve never gotten quite to that point this is *good.*",
      "created_utc": 1725568749.0,
      "score": 3
    },
    {
      "id": "llosp43",
      "body": "It is not pathetic or stupid to be proud of yourself..for anything, really. Depression is real. And I'm proud of you, too.\n\nTry not to cry hahaha\n\nLet us know how your new roommate is\n\nI don't really know anything about depression so all I'll attempt to say is, perhaps remember how good it feels and try to push through next time knowing it'll pay off in the end. Keep watching/listening to that or other essays, if that's what it takes. We all have our things that we are into, and whatever helps pull you out or keeps you from really falling in is something you should hold onto. Rooting for you",
      "created_utc": 1725569035.0,
      "score": 4
    },
    {
      "id": "llouv7h",
      "body": "Very awesome!! Try and keep the tiny things up if you can- small steps get us places ;) Be proud of this!! This Reddit stranger is VERY proud of the productive day you had!",
      "created_utc": 1725569696.0,
      "score": 3
    },
    {
      "id": "llouy3v",
      "body": "It's not pathetic at all, it's really great !\nYou did great !\n\nI know what's it's like... And the feelings after the shower and taking care of your hairs (curls too !)... There's no words to describe it !\n\nI'm proud of you 💖",
      "created_utc": 1725569719.0,
      "score": 4
    },
    {
      "id": "llovms8",
      "body": "It's not pathetic at all. I feel like so many of us have been there and can relate. Hugs to you. Small steps at a time. ❤️❤️",
      "created_utc": 1725569931.0,
      "score": 4
    },
    {
      "id": "llovqtc",
      "body": "I am proud of you. ❤️",
      "created_utc": 1725569966.0,
      "score": 5
    },
    {
      "id": "llowkm9",
      "body": "I knooooow you feel so much better. Proud of you. Remember this freshly clean feeling, it will inspire you to shower if or when you get to that place again. Much love",
      "created_utc": 1725570227.0,
      "score": 5
    },
    {
      "id": "lloy1z1",
      "body": "So proud of you! Depression can be incredibly difficult and draining. Self-care is so important and I'm glad you were able to have those moments <3 You've got this!",
      "created_utc": 1725570700.0,
      "score": 4
    },
    {
      "id": "lloy9bd",
      "body": "I am so so proud of you, as others said, this again is proof that it is a temporary situation. I know it doesn't feel like that, and I know there will be hard times coming.\n\nBUT you did it! YOU DID IT! Be proud of yourself, and know we are. 💚",
      "created_utc": 1725570766.0,
      "score": 4
    },
    {
      "id": "lloy9sj",
      "body": "You’re not gross, you have mental health problems. That’s not the same. I hope you’re doing better now and that you can go more often in the shower!! Bless you",
      "created_utc": 1725570770.0,
      "score": 4
    },
    {
      "id": "lloz36c",
      "body": "Well done you!",
      "created_utc": 1725571030.0,
      "score": 4
    },
    {
      "id": "llp1727",
      "body": "You say you’re proud but you say mean things about yourself in the same sentence. 🥺 say one good thing about yourself everyday in the mirror. It helped me.",
      "created_utc": 1725571711.0,
      "score": 4
    },
    {
      "id": "llp1k4z",
      "body": "This is a glorious success to celebrate— congratulations! Enjoy the sensations, the scents and the freedom you feel. I wish you more of the same. And take it easy — you’ll be tired from this big push but don’t mistake that rest for failure, rest is healthy too. Much love and support to you. I am happy for you 💕🌱✌️",
      "created_utc": 1725571828.0,
      "score": 3
    },
    {
      "id": "llp2htu",
      "body": "I am so so so proud of you, OP. And it is not at all pathetic or stupid to be proud of yourself for this. 💛",
      "created_utc": 1725572137.0,
      "score": 3
    },
    {
      "id": "llp2wld",
      "body": "I am so proud of you! You are amazing! Pulling yourself up is so hard, and you did it! I'm really impressed!",
      "created_utc": 1725572271.0,
      "score": 4
    },
    {
      "id": "llp3ifj",
      "body": "I hope you're feeling better now 🥰 good luck with the new roommate situation",
      "created_utc": 1725572472.0,
      "score": 4
    },
    {
      "id": "llp3wgl",
      "body": "I want you to know I’m proud of you.",
      "created_utc": 1725572599.0,
      "score": 5
    },
    {
      "id": "llp3wyp",
      "body": "Welcome back. \n\nI hope you felt better and wish you luck on your recovery.",
      "created_utc": 1725572603.0,
      "score": 4
    },
    {
      "id": "llp41zu",
      "body": "Proud of you babe! Hope your new roomie is someone you enjoy!",
      "created_utc": 1725572650.0,
      "score": 4
    },
    {
      "id": "llp6i8p",
      "body": "I love you sweetheart, even though we don’t know each other lol I am super proud of you. I feel like a failure because my teeth are so bad now, they are weak and kinda yellow but at least my smile is nice ! Shout out to you 🩷",
      "created_utc": 1725573462.0,
      "score": 4
    },
    {
      "id": "llp6w3r",
      "body": "You should NOT feel bad OP. Or at least you shouldn’t feel alone, because I just went through something similar….. I was using at the time and I had gotten so depressed about the fact that had tried and failed to stop 3 times in the past month that I didn’t shower or leave my room for like 2 months. I finally bit the bullet and went to rehab (almost ONE YEAR clean now!!), and that first shower after detoxing for 5 days (sweating, puking, crying, etc) was FUCKING INCREDIBLE. I also had a giant hair wad that was the size of—and kind of resembled—a tarantula, and I exfoliated so hard that my skin was pink for hours lol. \n\nJust know it will get better and that you are NOT the sum of your worst experiences. So proud of you. Sending love.",
      "created_utc": 1725573594.0,
      "score": 5
    },
    {
      "id": "llperw3",
      "body": "Good for you OP! \n\nAs someone who has been where you are and still struggles at times, please believe me when I say that if you consistently brush & wash your hair, the overall hair-loss decreases significantly.\n\nI was in a bad state years ago where it felt like I would no longer have any hair remaining after I showered/washed my hair - just huge clumps that stuck to my hands and body, backed up the drain\n\nThe stress of my life, along with a poor diet and basically nonexistent hygiene practices made me practically bald - and that just made me feel even worse.\n\nPlease keep looking after yourself, don’t be afraid to ask for help! \n\nTry and do a few things to clean up everyday, it makes the overall task my less challenging.\n\nWishing you nothing but positive thoughts and a great future♥️",
      "created_utc": 1725576365.0,
      "score": 4
    },
    {
      "id": "llpfe4a",
      "body": "You did so good!! You can try using claw clips to keep your hair less tangled than a bun :)",
      "created_utc": 1725576584.0,
      "score": 3
    },
    {
      "id": "llphb66",
      "body": "It is neither pathetic nor stupid to be proud of yourself for completing a monumental task. People who haven’t experienced it may not understand, but depression makes life so fucking HARD. For what it’s worth, I’m proud of you, too.",
      "created_utc": 1725577264.0,
      "score": 5
    },
    {
      "id": "llpou45",
      "body": "I've been there, too. And I'm proud as hell of you! It's seriously difficult to make yourself clean and shower after so long in a depression, so it's alright to cry a bit and be proud of the achievement.",
      "created_utc": 1725579988.0,
      "score": 4
    },
    {
      "id": "llpp8qc",
      "body": "It's under standable depression is a hard thing to deal with sometimes I get it I've been there before I'm sorry for what ever happened to cause you to feel like that but I do hope you continue to fight to feel better just take it one day at a time",
      "created_utc": 1725580136.0,
      "score": 3
    },
    {
      "id": "llppnnt",
      "body": "I'm so proud of you! That was a rough hill to climb, and you powered through it. You made great decisions for self care, every step of the way. You cleaned the house, you brushed out your hair, you put on something to focus your attention, you got in the shower, you exfoliated, you washed and conditioned your hair. I hope you feel pampered and amazing. And I hope it's a feeling you gift yourself more often. You deserve to feel good about yourself and You are worth it! Big hugs for a tough day. You are amazing.",
      "created_utc": 1725580285.0,
      "score": 5
    },
    {
      "id": "llpq7a7",
      "body": "I’m proud of you! It really isn’t easy. \n\nSomething that helped me, is that I’ve been buying bath bombs that have jewelry inside (like fragrant jewels or charmed aroma), and putting one in the shower every time I shower. It makes me feel like I’m rewarding myself, because it can be so hard. And it takes a little bit to dissolve, which makes me have to stay in longer and clean properly.",
      "created_utc": 1725580483.0,
      "score": 4
    },
    {
      "id": "llpql0l",
      "body": "Hey. I'm proud of you.\n\nDepression bites, and you cleaned both yourself and your abode. That's huge! And you know what? \n\nYou're doing better than you think.",
      "created_utc": 1725580623.0,
      "score": 3
    },
    {
      "id": "llpr8y3",
      "body": "From someone who has been there, it is not pathetic and you should be proud of yourself.",
      "created_utc": 1725580867.0,
      "score": 4
    },
    {
      "id": "llptczy",
      "body": "So happy for you I know what depression can do to you when I came out of my funk a shower was also my first step congratulations and known that there many of us that have gone down similar roads .",
      "created_utc": 1725581637.0,
      "score": 4
    },
    {
      "id": "llptruz",
      "body": "You did an amazing job! The cleaning of your place as well as detangling your hair and showering. \n\nI know how hard it can be but I am proud of you 💜",
      "created_utc": 1725581786.0,
      "score": 4
    },
    {
      "id": "llpvtzc",
      "body": "Oh sweetheart I totally and completely get this.  I am so happy that you’re feeling clean and beautiful and good!  I hope your new roommate situation works out perfectly, too!  ♥️♥️♥️",
      "created_utc": 1725582545.0,
      "score": 4
    },
    {
      "id": "llpxbt4",
      "body": "Bravo! Progress is progress. \n\nI recently got myself a new shower head, one of those rainfall ones. I tried one at an Air BNB a year ago and loved it. \n\nI promised myself that when I got one, I’d shower everyday whether I needed to or not. I got myself some amazing moisturizing body wash, and some great smelling body lotion. \n\nDon’t know if it will work for you, but I treat it like daily pampering and gives me a good hour of a morning routine that makes me start the day feeling prepared and like I accomplished something.",
      "created_utc": 1725583085.0,
      "score": 4
    },
    {
      "id": "llpxdy8",
      "body": "My daughter and I struggle with bathing emotionally as well, we both have sensory processing issues and showers are a lot. I’m so happy for you. I hope when it gets dark in your mind again you can reach toward that dryer warm pair of sweatpants and pull yourself to the end of the tunnel.",
      "created_utc": 1725583107.0,
      "score": 5
    },
    {
      "id": "llpy5h3",
      "body": "You prob didn’t really lose any hair. Since you haven’t been brushing the hair that would normally fall out every day hasn’t been so it’d seem like a lot at once! Totally normal. Make sure you are brushing your teeth, you only get one set of those! Great job. Glad it’s made you feel so much better!",
      "created_utc": 1725583378.0,
      "score": 4
    },
    {
      "id": "llpzj0h",
      "body": "My therapist told me today: “it’s not stupid, it’s not minuscule, it’s huge what you did. Why do you keep putting yourself down, why do you think what you do means nothing?” \n\nStop calling yourself gross. You have a fatal illness and it’s serious shit. Just keep trying. My psych told me it could be on the 13th try that I finally get it. I think that’s a pretty true statement for all of us",
      "created_utc": 1725583864.0,
      "score": 4
    },
    {
      "id": "llq0zrj",
      "body": "I’m proud of you! You should be too. I understand exactly how you feel. I remember staring at a light switch for an hour because I just couldn’t bring myself to walk 4 feet to turn it off. \nDo one thing every day for yourself. It doesn’t have to be a huge effort, just like brushing your hair. It’s so easy to get overwhelmed by thinking you have to do everything to mean anything. \nJust one thing, honey. If I can come out on the other side, you can too.",
      "created_utc": 1725584372.0,
      "score": 4
    },
    {
      "id": "llq11p0",
      "body": "First of all, STOP! You are not gross, pathetic or stupid. You’re human! Humans go through periods of growth and this is yours; for better or worse. \n\nYou’re doing great! Do not compare yourself to others because you are right where you need to be and you are right on track for your own life and needs. \n \nYou’ve got this! You’re not alone and no matter what, you’re going to come out stronger than before. ❤️",
      "created_utc": 1725584390.0,
      "score": 4
    },
    {
      "id": "llq19zy",
      "body": "So proud of you! I too have severe depression and anxiety, and don’t have the best habits atm.  I used to shower every day sometimes twice a day…now I am feeling like a piece of garbage human.  And I feel where you are and have been.  We can get better..❤️‍🩹 it takes time. And learning to love ourselves again.",
      "created_utc": 1725584472.0,
      "score": 4
    },
    {
      "id": "llq1mb1",
      "body": "A tip for you:\nBrush in the shower with a comb while your hair is absolutely drenched in conditioner.\n\nWhen I go for periods without brushing my hair because my depression is in a bad stage, this really helps detangle my hair. \n\nReally proud of how much you got done today:)",
      "created_utc": 1725584595.0,
      "score": 4
    },
    {
      "id": "llq2r41",
      "body": "Look at you! That’s such a huge mountain to climb and I’m so proud of you! \n\nNothing feels as good aw an everything shower that has been the “impossible task” \n\nYou did it!",
      "created_utc": 1725584994.0,
      "score": 4
    },
    {
      "id": "llq35bf",
      "body": "Congratulations, I’m so proud of you!!!! You’re not gross or disgusting at all, also I’d just like to say GREAT JOB on cleaning the house AND taking an everything shower all in one day!!! I just had a baby and I can’t get both of those done in the same day, so trust me I know that that’s an accomplishment!",
      "created_utc": 1725585141.0,
      "score": 3
    },
    {
      "id": "llq4l2m",
      "body": "Wet wipes are used to keep all sorts of people clean. No judgement or morality should be assigned to that. The people who are telling you it's \"gross\" not to shower every day are the problem. I had a 2 year stretch wherein the heat of the shower would make me throw up/faint, and warm washcloths, dry shampoo, and baby wipes were what I used daily. If you can, try to avoid using alcohol on your skin, it's very drying and will make you feel worse, like your skin is sticky. They make wipe warmers too. Be gentle with yourself, so much more gentle than you think is reasonable or possible.",
      "created_utc": 1725585660.0,
      "score": 4
    },
    {
      "id": "llq4pip",
      "body": "I am so proud of you!\nDepression is one hell of a beast, and not only did you have a shower, you had an everything shower! \n\nYou're so awesome 💜",
      "created_utc": 1725585705.0,
      "score": 4
    },
    {
      "id": "llq4x51",
      "body": "That’s amazing!!!  I’ve been there, it’s tough to break out of and I’m so proud of you!  There’s been points where dry shampoo was my best friend, but that shower after so long feels really good even though it’s tough and tiring.  Be proud of yourself!!!",
      "created_utc": 1725585781.0,
      "score": 4
    },
    {
      "id": "llq51bk",
      "body": "I don’t know you but I am so proud of you. Doing the most basic things when severely depressed is impossible and people can’t understand that. You’re not alone, my friend. Just last week I (40F) hit the twice a week mark. Still have to force myself to take them but… baby steps. \n\nI hope your meeting with the new roommate went well!",
      "created_utc": 1725585823.0,
      "score": 4
    },
    {
      "id": "llq5tag",
      "body": "I don’t have depression, for me the irregular showering is due to my ADHD, but my gosh am I proud of you. I understand in some way the overwhelm you feel at the thought of doing the whole shower/self-care thing, and you did it today anyway. Good on you. \n\nI’m gonna go force myself to shower now 😅",
      "created_utc": 1725586104.0,
      "score": 4
    },
    {
      "id": "llqa49j",
      "body": "This internet stranger is very proud of you!  You climbed the mountain and made it to the top! \n\nBravo 👏 \n\nRemember….depression lies.",
      "created_utc": 1725587657.0,
      "score": 3
    },
    {
      "id": "llqbpn8",
      "body": "You deserve to feel good in your body and today showering helped you to feel good. I am a big fan of baby wipes for freshening up on days I don’t shower. KC Davis has some really helpful suggestions for when people are struggling, without judgement. Good luck in your journey friend. Remember you are always worthy of love.",
      "created_utc": 1725588220.0,
      "score": 4
    },
    {
      "id": "llqf7wv",
      "body": "YOU GOT THIS!!! I'm proud of you!\n\nI've been where you are, I know the struggle. \nAt my worst it took getting nits and being sectioned to be convinced to wash my hair. and even then I didn't shower, that came a couple weeks later. Now I can motivate myself and its not such a struggle anymore.\n\nYou did great ❤️",
      "created_utc": 1725589538.0,
      "score": 3
    },
    {
      "id": "llqfg14",
      "body": "It is not stupid or pathetic. You accomplished a difficult task. We are trained as Americans to only recognize efforts when they net a huge outcome. I work with people to help them take notice of all the good steps they take everyday and not compare them to the tasks that didn’t get completed. I am celebrating your accomplishments and hope you do as well. GOOD JOB!",
      "created_utc": 1725589623.0,
      "score": 4
    },
    {
      "id": "llqfysj",
      "body": "You did so much!! That's so incredible. Don't downplay your achievement. I hope you keep feeling good and know an internet stranger is out here rooting for you 🖤",
      "created_utc": 1725589824.0,
      "score": 4
    },
    {
      "id": "llqg2xs",
      "body": "Washing to remove the smell of *clean*ing products. C'est interessant, n'est pa?\n\nBut, serieusement, well done!",
      "created_utc": 1725589869.0,
      "score": 4
    },
    {
      "id": "llqg3n6",
      "body": "I’m proud of you!",
      "created_utc": 1725589876.0,
      "score": 4
    },
    {
      "id": "llqgnm9",
      "body": "It’s not gross and you should be proud of yourself depression is hard",
      "created_utc": 1725590089.0,
      "score": 3
    },
    {
      "id": "llqlunz",
      "body": "I’m so proud of you!!! I’m struggling too (literally shower once every other week at this point) but I got more and more excited reading through your post because you did it! I just know that shower had to have taken so long but you kept at it and got through it! \n\nI can’t wait to get to a point and be able to see my waves and curls again! \n\nVirtual huggggs (if you’re okay with them)",
      "created_utc": 1725592176.0,
      "score": 5
    },
    {
      "id": "llrsuog",
      "body": "“Pathetic and stupid”?  You misspelled “Brave and courageous”",
      "created_utc": 1725617230.0,
      "score": 5
    },
    {
      "id": "llp59nz",
      "body": "I am so very proud of you!  Be extra kind to yourself because depression sucks.",
      "created_utc": 1725573049.0,
      "score": 3
    },
    {
      "id": "llp5ewj",
      "body": "I wish I could find it again, but there was a whole ‘spoons and ways to stay clean’ list years ago that was great.discussed the different things you could do if you didn’t have the spoons to do the full hygiene routine.\n\nYou are doing fine. Well done for having a shower.",
      "created_utc": 1725573099.0,
      "score": 3
    },
    {
      "id": "llp69ob",
      "body": "Sending you lots of love ❤️Great job with showering today. I hope your new roommate is wonderful and that you keep feeling better.",
      "created_utc": 1725573382.0,
      "score": 3
    },
    {
      "id": "llp6w1m",
      "body": "Congrats! You did a good thing for yourself and I'm glad you feel so good! 👏🏿👏🏿🎉🎉",
      "created_utc": 1725573593.0,
      "score": 3
    },
    {
      "id": "llp7dj1",
      "body": "Holy crap - GREAT JOB!!!",
      "created_utc": 1725573758.0,
      "score": 3
    },
    {
      "id": "llp8hwl",
      "body": "Well done you ! \n\nYou will not always feel this way. It will get better\nYou took a huge step by doing this for yourself and I’m proud",
      "created_utc": 1725574146.0,
      "score": 3
    },
    {
      "id": "llp8ift",
      "body": "You are not gross, disgusting, pathetic or stupid.\n\nYou are human. \n\nWell done for doing some homework and having a really full on shower! I bet you feel exhausted and amazing.",
      "created_utc": 1725574151.0,
      "score": 3
    },
    {
      "id": "llp8mvz",
      "body": "I’m really proud of you, OP!",
      "created_utc": 1725574193.0,
      "score": 3
    },
    {
      "id": "llp9tav",
      "body": "That was such a huge thing for you to do for yourself and you SHOULD BE very proud of yourself. Don’t downplay how hard it is to cope with basic needs while depressed. You DID THE THING!!! 🎉",
      "created_utc": 1725574603.0,
      "score": 3
    },
    {
      "id": "llpa5pg",
      "body": "I'm proud of you. Life is tough.",
      "created_utc": 1725574724.0,
      "score": 3
    },
    {
      "id": "llpab8r",
      "body": "It’s not pathetic or stupid to be proud of yourself for this. I am proud of you for this. Depression is crushing and we all feel it in different ways. You’re an amazing human being just because you exist. 💜",
      "created_utc": 1725574778.0,
      "score": 3
    },
    {
      "id": "llpcthb",
      "body": "u/rorofoshoo half way reading tour post and I wanted to give you a warm and long hug\nCongratulations!!!",
      "created_utc": 1725575660.0,
      "score": 3
    },
    {
      "id": "llpdi8e",
      "body": "i used to have issues showering my whole life, just recently a year or two ago started to shower more frequently. im very proud of you, we're in this together 🩶",
      "created_utc": 1725575904.0,
      "score": 3
    },
    {
      "id": "llpedhr",
      "body": "Hey, why would it be pathetic and stupid to be proud of doing something that was necessary but hard?\n\nYeah, you _were_ gross, as in you were very dirty, but you are not a gross person. It’s not like you go “I don’t need to be clean. I don’t need a shower.”\n\nCongratulations! And you did this thing to do right by the new roommate. That’s great. It’s no small thing.",
      "created_utc": 1725576222.0,
      "score": 3
    },
    {
      "id": "llpfn8a",
      "body": "Congratulations! You should be proud of yourself. Enjoy it.",
      "created_utc": 1725576674.0,
      "score": 3
    },
    {
      "id": "llpg2ru",
      "body": "I’m proud of you. ❤️",
      "created_utc": 1725576827.0,
      "score": 3
    },
    {
      "id": "llpgcrz",
      "body": "I am incredibly proud of you!",
      "created_utc": 1725576924.0,
      "score": 3
    },
    {
      "id": "llph843",
      "body": "I'm so proud of you!",
      "created_utc": 1725577234.0,
      "score": 3
    },
    {
      "id": "llphl5q",
      "body": "Don't short change yourself! You did the damn thing, and that's such an accomplishment! 🥰",
      "created_utc": 1725577367.0,
      "score": 3
    },
    {
      "id": "llphru2",
      "body": "I'm so proud of you!",
      "created_utc": 1725577436.0,
      "score": 3
    },
    {
      "id": "llphz24",
      "body": "I'm so pumped for you!! I can't imagine the relief you must feel right now.\n\nTry not to be so hard on yourself <3 depression is HARD to live with, and it's totally okay to celebrate the little victories. And try to give yourself grace if you find yourself backsliding into not showering again",
      "created_utc": 1725577509.0,
      "score": 3
    },
    {
      "id": "llpijrp",
      "body": "I'm proud of you!",
      "created_utc": 1725577718.0,
      "score": 3
    },
    {
      "id": "llpj31h",
      "body": "I am proud of you, girl ❤️❤️❤️",
      "created_utc": 1725577913.0,
      "score": 3
    },
    {
      "id": "llpjmn4",
      "body": "You did a great job and you deserve to feel good.",
      "created_utc": 1725578109.0,
      "score": 3
    },
    {
      "id": "llpjouj",
      "body": "It’s a terrific accomplishment and you should be proud of yourself. Cry away, tomorrow will be better and it’s all that matters!",
      "created_utc": 1725578132.0,
      "score": 3
    },
    {
      "id": "llpjrie",
      "body": "Good job, keep it up. Your doing such a great job. Keep up the good work OP",
      "created_utc": 1725578159.0,
      "score": 3
    },
    {
      "id": "llpjz34",
      "body": "Very proud of you, I know it's really hard sometimes. ❤️",
      "created_utc": 1725578234.0,
      "score": 3
    },
    {
      "id": "llplty7",
      "body": "I’m very proud of you!",
      "created_utc": 1725578903.0,
      "score": 3
    },
    {
      "id": "llplwtu",
      "body": "I’m so proud of you!",
      "created_utc": 1725578932.0,
      "score": 3
    },
    {
      "id": "llpne09",
      "body": "Get actual wash wipes and some dry shampoo! It helps.",
      "created_utc": 1725579466.0,
      "score": 3
    },
    {
      "id": "llpopsw",
      "body": "I’m so proud of you! Great work!",
      "created_utc": 1725579946.0,
      "score": 3
    },
    {
      "id": "llpopvt",
      "body": "I'm genuinely really proud of you 💖 keep going",
      "created_utc": 1725579947.0,
      "score": 3
    },
    {
      "id": "llpptsh",
      "body": "Congratulations!!",
      "created_utc": 1725580347.0,
      "score": 3
    },
    {
      "id": "llpq4xq",
      "body": "You done good, be proud. Keep going x",
      "created_utc": 1725580460.0,
      "score": 3
    },
    {
      "id": "llpq6ax",
      "body": "You did such a great job! You should be really proud of yourself. You cleaned not only yourself but your house too and that is a HUGE accomplishment. And I hope that you are proud of yourself.",
      "created_utc": 1725580473.0,
      "score": 3
    },
    {
      "id": "llpquzf",
      "body": "Congratulations, that’s a huge win! Very proud of you!! 🎉",
      "created_utc": 1725580725.0,
      "score": 3
    },
    {
      "id": "llpqxgc",
      "body": "AMAZINNG!! I’m so proud of you.",
      "created_utc": 1725580750.0,
      "score": 3
    },
    {
      "id": "llprgoe",
      "body": "I know what you're going through, and you should be proud of yourself. Sending a virtual hug because you did great! 💚",
      "created_utc": 1725580946.0,
      "score": 3
    },
    {
      "id": "llpxn6u",
      "body": "I’m really proud of you. I know how hard it can be to pull yourself out of a depression. I’m really glad that you accomplished a shower. Small goals♥️♥️♥️♥️♥️",
      "created_utc": 1725583201.0,
      "score": 3
    },
    {
      "id": "llpybpr",
      "body": "This is a major accomplishment. I am proud of you and I hope you’re enjoying those beautiful curls!",
      "created_utc": 1725583436.0,
      "score": 3
    },
    {
      "id": "llpylg1",
      "body": "I just can't tell you how truly proud I am of you. This was the hardest part, you just got past it! I'm so happy that you treated yourself to nice warm clothes and towel, it makes it easier when you're kind to yourself.\n\nThe next step is positive self talk. Negative self talk (calling yourself mean names, ect) is an unhealthy coping mechanism. It's like a wall so if you say the mean things to yourself first, it won't hurt if others do it too. But the things is, you're already going through so much! You have to be gentle and kind with yourself. You wouldn't call someone else who was struggling with depression that they were gross or disgusting. Especially not if they were trying to celebrate an achievement. \n\nTo whoever needs to hear it: Be kind to yourself. I'm happy you're here, and I'm proud of all the baby steps you're taking.",
      "created_utc": 1725583527.0,
      "score": 3
    },
    {
      "id": "llq07br",
      "body": "Hi, there. Please don’t be so hard on yourself. You should be proud of yourself for this. Just take everything bit by bit, and celebrate each little victory you have.",
      "created_utc": 1725584096.0,
      "score": 3
    },
    {
      "id": "llq0wqw",
      "body": "i am so f***ing proud of you. i have been there more than i care to admit, and i know how hard it is. but i also know how good it feels when you’re done. i’m always a little sleepy and relaxed and happy for having accomplished a big task. so, yeah, please be so proud of yourself.",
      "created_utc": 1725584344.0,
      "score": 3
    },
    {
      "id": "llq2q3z",
      "body": "👋  I am happy and proud and thrilled for you.",
      "created_utc": 1725584983.0,
      "score": 3
    },
    {
      "id": "llq3in5",
      "body": "This is awesome. So proud of you, internet stranger. You are worth warm towels, hot showers, and fresh starts.",
      "created_utc": 1725585275.0,
      "score": 3
    },
    {
      "id": "llq4rpf",
      "body": "Good for you 👍🏼",
      "created_utc": 1725585727.0,
      "score": 3
    },
    {
      "id": "llq5tmz",
      "body": "Listen. Been there. You're doing a good job. \n\nSometimes it doesn't have to be all at once. One day, brush out your hair and wash it. \n\nAnother day, shaved in small increments. Armpits, legs...one day at a time.\n\nWhen you feel like it, shower the rest of body, a good scrub. \nWiping down daily between showers is smart. \n\nRemember how good you feel right now. \n\nI wish you well. You're not alone.",
      "created_utc": 1725586108.0,
      "score": 3
    },
    {
      "id": "lltt20h",
      "body": "This is not gross. This is a visual representation of a medical condition. I have to wear leg braces to walk well. Can I walk without them? Sure, but it makes it harder. It is the same thing with showering when you are in a major depression. Can you go without showering forever? Sure, but it makes life harder. I had to adjust to wearing my leg braces. I had to relearn how to walk with them. Now that I am used to them, I get around WAY better! You need to get used to showering more often. Will it be hard? ABSOLUTELY! Can you do it? Also absolutely. I am super proud of you, honey. Edited for clarity.",
      "created_utc": 1725644417.0,
      "score": 3
    },
    {
      "id": "llv82qy",
      "body": "You are not disgusting.\n\nYou are beautiful.\n\nYou are worthy and worth it.\n\nI'm PROUD of you.\n\nHere's a hug.\n\nOne day at a time.",
      "created_utc": 1725661085.0,
      "score": 3
    },
    {
      "id": "llwfes8",
      "body": "You’re not gross. \n\nYou’re not pathetic. \n\nYou’re not stupid. \n\nYou’re dealing with depression. \n\nAnd you should be proud of yourself and what you accomplished today!! I’m proud of you and I don’t even know you ❤️",
      "created_utc": 1725677673.0,
      "score": 3
    },
    {
      "id": "llokejv",
      "body": "Been there",
      "created_utc": 1725566458.0,
      "score": 5
    },
    {
      "id": "llq6ag2",
      "body": "Bro, it's not pathetic it's fucking dope. You did it. It's a step forward. \n\nA friend once said to me that 20% is better than 0%. Baby steps are better than  nothing and i'm glad you are feeling better again.",
      "created_utc": 1725586279.0,
      "score": 2
    },
    {
      "id": "llq6zzh",
      "body": "I’m rooting for you, friend! ❤️",
      "created_utc": 1725586538.0,
      "score": 2
    },
    {
      "id": "llq705u",
      "body": "Look at you! Baby steps, write down 3 nice things about yourself 🩷",
      "created_utc": 1725586539.0,
      "score": 2
    },
    {
      "id": "llq75m7",
      "body": "OMG, I can relate so much.  I was using a natural product from Amazon, wipes and alcohol.   We moved into a new house.\nI immediately cleaned the tub and took a shower.  \n\nI am so happy for you!",
      "created_utc": 1725586591.0,
      "score": 2
    },
    {
      "id": "llq763x",
      "body": "You rock! Sending a Big Hug your way. Please keep up the good work.",
      "created_utc": 1725586596.0,
      "score": 2
    },
    {
      "id": "llq8rr3",
      "body": "Doing stuff when you are depressed is hard. You did good. Embrace the feeling of being clean and enjoy it. Take every hint of warm fuzzies you can from this moment and remember how strong you feel for giving this gift to yourself. \n\nGood luck with your new roommate and keep moving forward in your depression journey. Give yourself grace and remind yourself every day that you are worth good things in your life. It can be difficult to remember sometimes, I know, but you are worth it.",
      "created_utc": 1725587169.0,
      "score": 2
    },
    {
      "id": "llqaj81",
      "body": "You aren’t pathetic! You did good!",
      "created_utc": 1725587805.0,
      "score": 2
    },
    {
      "id": "llqaz27",
      "body": "You did an amazing job! I hope you make yourself your favourite drink and cosy up as a reward",
      "created_utc": 1725587955.0,
      "score": 2
    },
    {
      "id": "llqb71l",
      "body": "You're not gross. You're not disgusting. You're unwell. I'm proud of you for being able to get yourself through the shower! That's a big deal! I know how difficult it really is. Believe me, I understand. I've been there. Sending gentle hugs.",
      "created_utc": 1725588032.0,
      "score": 2
    },
    {
      "id": "llqbq53",
      "body": "Proud of you!",
      "created_utc": 1725588225.0,
      "score": 2
    },
    {
      "id": "llqcd8g",
      "body": "Proud of you. Enjoy the clean feeling! Hope you experience it again soon",
      "created_utc": 1725588467.0,
      "score": 2
    },
    {
      "id": "llqcqpw",
      "body": "I have pretty bad depression myself but this is something I have been able to avoid (cleaning my place is a tougher hill but I beat it). The only tip I can give is that sometimes just letting hot water run over you is enough, especially to remind you the shower is a nice place.",
      "created_utc": 1725588608.0,
      "score": 2
    },
    {
      "id": "llqctvk",
      "body": "So proud of you OP!!",
      "created_utc": 1725588640.0,
      "score": 2
    },
    {
      "id": "llqcwh5",
      "body": "Hey I for one want to convey to you -- it's not pathetic! Depression sucks, man.",
      "created_utc": 1725588666.0,
      "score": 2
    },
    {
      "id": "llqcxig",
      "body": "So glad that shower made you feel better. And it’s never pathetic to celebrate doing better. Period.",
      "created_utc": 1725588677.0,
      "score": 2
    },
    {
      "id": "llqdeza",
      "body": "You’re not alone. I’ve been there. Keep fighting the beast!",
      "created_utc": 1725588858.0,
      "score": 2
    },
    {
      "id": "llqdwfw",
      "body": "I’m so proud of you. I am so so so incredibly proud of you. You’re doing amazing. You’re doing so good. This is absolutely an accomplishment and I’m so incredibly proud of you.",
      "created_utc": 1725589039.0,
      "score": 2
    },
    {
      "id": "llqe8tq",
      "body": "Give yourself some grace. Depression isn’t easy. Proud of you for taking care of yourself today. Challenge yourself to keep doing that.",
      "created_utc": 1725589168.0,
      "score": 2
    },
    {
      "id": "llqfnpv",
      "body": "For what it’s worth, I’m so proud of you!!! That’s a major accomplishment and it makes me so happy to read about your joy and happiness\n\nThis isn’t a small or dumb accomplishment either. This is huge! I completely understand how depression makes things super difficult cause I also suffer from it. \n\nI hope you can keep this momentum going—but it’s okay if not. Just know that you’re trying your best and that’s all that matters ❤️",
      "created_utc": 1725589704.0,
      "score": 2
    },
    {
      "id": "llqfyen",
      "body": "Remember how great you feel today!! You did something for yourself and you reaped all the benefits! Bask in that glory! I hope you have the best night’s sleep and wake up feeling refreshed and proud that you accomplished something that has otherwise been overwhelming for you at this time ♥️",
      "created_utc": 1725589820.0,
      "score": 2
    },
    {
      "id": "llqhapk",
      "body": "I'm proud of you.",
      "created_utc": 1725590333.0,
      "score": 2
    },
    {
      "id": "llqirbg",
      "body": "First of all... Wahoo!\nSecond... check your Vitamin D levels. My depression has always been an issue... turns out my Vit D is very low and I am feeling so so much better since I've been taking high doses appropriate for me.",
      "created_utc": 1725590919.0,
      "score": 2
    },
    {
      "id": "llqjbiy",
      "body": "I have so been there. I know exactly how you feel. Don’t get down on yourself if this doesn’t last. You’ll get back to it when you’re able to and you’re doing the best you can, just like the rest of us. Every day I learn more and more that we’re all just putting on a front of being okay when behind closed doors we are all silently struggling with something. You are not alone in this and I’m happy that you chose yourself today over the lies your brain tells you about yourself.",
      "created_utc": 1725591150.0,
      "score": 2
    },
    {
      "id": "llqjl5a",
      "body": "I'm very proud of you. I've been there, believe me. My depression has left me without taking showers, brushing my teeth and even flushing (!!!) for weeks and weeks on end. \nIf you're not proud of you, know that I am.",
      "created_utc": 1725591259.0,
      "score": 2
    },
    {
      "id": "llqmswe",
      "body": "If it makes you feel better, most of the hair you lost is probably just hair that shed naturally but was bundled up in the bun or knots. \n\nAlso, believe it or not, mental illness is not a choice. You didn't choose this. You're dealing with it the best way you can.\n\nPlease be proud of yourself. How would you feel if your sister or best friend were going through what you are? Or talking about themselves like this? You deserve the kindness you would show other people",
      "created_utc": 1725592560.0,
      "score": 2
    },
    {
      "id": "llqnq6i",
      "body": "Amazing, I’m so happy for you!",
      "created_utc": 1725592928.0,
      "score": 2
    },
    {
      "id": "llqo980",
      "body": "i’m proud of you!",
      "created_utc": 1725593151.0,
      "score": 2
    },
    {
      "id": "llqolkd",
      "body": "One thing that helped me was buying a body wash with a scent so good that it literally makes me want to shower just to smell the soap",
      "created_utc": 1725593297.0,
      "score": 2
    },
    {
      "id": "llqq8p8",
      "body": "You did awesome. Thats a lot to do, and you did it all. The cleaning of the house, the shower, the hair routine, everything. Congrats op. It takes a lot of energy and Ive found myself even giving up halfway through in tears because I jist...couldnt. So bask in the positive please. You deserve it!",
      "created_utc": 1725593980.0,
      "score": 2
    },
    {
      "id": "llqr0yt",
      "body": "I’m where you are. You are NOT DISGUSTING, you’re human and suffering, like me. And better yet, you’re an INSPIRATION. Much love to you 💛💛💛💛",
      "created_utc": 1725594306.0,
      "score": 2
    },
    {
      "id": "llqrcm9",
      "body": "i’m so proud of you babes <3 i haven’t cleaned, done laundry, or showered in a while as well! you’ve inspired to get my shit DONE, thank you! \n\nyou’re doing amazing and i love you (in an internet friendship way)",
      "created_utc": 1725594448.0,
      "score": 2
    },
    {
      "id": "llqsi6m",
      "body": "I had to create an alternate account just so I could post this message to you. First off, congratulations and well done! I'm sure you feel so much better! But second... you have helped me in a strange way. I have this problem too, and I have never told anyone. The thought of getting a shower is absolutely EXHAUSTING to me. It's not that I want to be dirty or that I don't care. It's just the thought of having to do all that requires SO much energy that... I just CAN'T. I don't currently have the strength that you do to admit how long it's been since I've showered, but you've given me some hope that maybe I can figure this thing out. Because I truly thought, until JUST NOW reading your post, that I was basically the only person this happens to. And I beat myself up over it in my mind constantly. But in some way I can't quite put my finger on, your honesty and openness gives me hope. Congratulations to you, and thank you for sharing, from the bottom of my heart.",
      "created_utc": 1725594946.0,
      "score": 2
    },
    {
      "id": "llqt5gz",
      "body": "I'm so proud of you, as someone who used to not shower in more than 3 months I know how you feel",
      "created_utc": 1725595215.0,
      "score": 2
    },
    {
      "id": "llqu6tj",
      "body": "You fricken’ ROCK!  And boy, oh boy, doesn’t it feel SOOOOO damn good being all clean and snuggly! What a great day! May you have many more.",
      "created_utc": 1725595681.0,
      "score": 2
    },
    {
      "id": "llr1trt",
      "body": "Genuine question. How do you sleep?\n\n\n When I don't shower for a few days my balls, feet, pits... get so sweaty and itchy that I wake up constantly with my hands covered in blood from scratching the skin off.",
      "created_utc": 1725599556.0,
      "score": 2
    },
    {
      "id": "llr5wz1",
      "body": "I’m so proud of you op!!!! You know what feels amazing after shaving ? A fresh bed with freshly dried bedsheets on it ☺️.",
      "created_utc": 1725601883.0,
      "score": 2
    },
    {
      "id": "llra6wh",
      "body": "This is far from pathetic, this is absolutely wonderful! I am so proud of you, you did it!",
      "created_utc": 1725604542.0,
      "score": 2
    },
    {
      "id": "llrakct",
      "body": "No it isn't lame to be proud of yourself for doing that. I've never experienced depression bad enough to not want to shower for 2 months, and I hope no one else reading this does either.",
      "created_utc": 1725604777.0,
      "score": 2
    },
    {
      "id": "llrdczk",
      "body": "When I was going through the worst of my depression, I came across a little sentence that sort of helped me shift my perspective and keep on top of some basic self maintenance. Hopefully, it will help in some little way.\n\n\"Anything that is worth doing is worth doing badly.\"\n\nBasically, anything that requires doing, whether it's hygiene or cleaning or eating, is worth doing badly, rather than not doing at all.\n\nBrushing your teeth for 1 minute is better than not brushing. A quick shower wipe down is better than not showering at all. Collecting your empty cups and glasses at the sink is better than not cleaning up at all.\n\nIt started slow, but eventually, I got into small routines that helped keep me on top of falling back into that catatonic depressive state where I pretty much couldn't function, or when I tried to make a change it wouldn't be so drastic that I would be intimidated or overwhelmed.\n\nDepression is difficult for people who don't have it as a constant shadow to understand, and you're not silly to feel proud of yourself. I am proud of you, too. It must have taken a lot of effort and patience. I am rooting for you!",
      "created_utc": 1725606564.0,
      "score": 2
    },
    {
      "id": "llrgumh",
      "body": "In a weird way I'm a bit jealous because if I go even two days without washing my hair, it gets sooo oily and I start developing rashes and itchiness behind my ears. I couldn't imagine what it would be like after two months of not doing so.",
      "created_utc": 1725608969.0,
      "score": 2
    },
    {
      "id": "llrk2d1",
      "body": "I don't know you. Haven't even determined your sex, but I am so got damn happy you washed your ass. You just don't know. Amen hallelujah!!!!!",
      "created_utc": 1725611224.0,
      "score": 2
    },
    {
      "id": "llrqdqh",
      "body": "I'm so proud of you <3\n\nI know it can be really hard to escape the cycle of toxic shame, that even when you are proud of yourself there's this nagging feeling telling you it's stupid. \n\nI want you to be proud anyway.\n\nI can imagine this took a lot of strength to do. We're all rooting for you and proud of you.\n\nKeep you head up:)",
      "created_utc": 1725615608.0,
      "score": 2
    },
    {
      "id": "llrrw1z",
      "body": "It’s the opposite of pathetic. \n\n\nGood job, keep up the good work, keep that feeling going!",
      "created_utc": 1725616609.0,
      "score": 2
    },
    {
      "id": "llsawhu",
      "body": "Hey, you got through that part and now you’re going on a new path. Be kind to yourself, set a goal for self care and try for it, but don’t beat yourself up about it. Now you’re gonna be the person who tries to do this. Can you update us next week on how it is going?",
      "created_utc": 1725626274.0,
      "score": 2
    },
    {
      "id": "llscygj",
      "body": "I've found the Finch app very helpful with self love and self care motivation. Good luck - I know some days are just so hard, but I keep telling myself life is a series of hills and valleys, and eventually we start making our way up the hill and out of the valley.",
      "created_utc": 1725627095.0,
      "score": 2
    },
    {
      "id": "llspiun",
      "body": "Not showering regularly is how I can tell my depression is getting bad again.  Getting in there and getting it done can seem absolutely monumental.  I'm so proud of you, not only for doing the thing, but also for being so candid about it.\n\nI'm gonna try the fresh towels and comfy clothes from the dryer thing, that sounds amazing.",
      "created_utc": 1725631721.0,
      "score": 2
    },
    {
      "id": "llsv9ul",
      "body": "Sometimes showering is the hardest thing. I also struggle with depression, couple that with being a stay at home mom with a toddler who’s attached to her, it’s hard to get any sort of “cleaning” done. I shower once every 4 days, sometimes even more. There have been times when I didn’t remember when my last shower was. Solidarity. It’s something to be proud of. I’m proud of you.",
      "created_utc": 1725633634.0,
      "score": 2
    },
    {
      "id": "llt59wl",
      "body": "I also showered for the first time in probably 8+ weeks yesterday, depression and ADHD is a terrible mix.\n\nYou did great, life is tough enough without beating yourself up.",
      "created_utc": 1725636826.0,
      "score": 2
    },
    {
      "id": "llthdzv",
      "body": "No no, this is an accomplishment! You should be so proud of yourself! I really hope you are. \n\nI've been exactly where you are so many times. Showering is one of the first things to go for me when I slip into depression. It's already a bit of an overwhelming sensory experience as it is and when I'm depressed and I don't feel like I'm worth the effort, I just can't make myself want to do it. \n\nBut you found a reason and you found the motivation and you did it. Even though it wasn't a simple shower, it had turned into a much bigger task at this point. That's not only accomplishing a basic self care task. That was laborious and you showed up and did that for yourself. That's incredible! When we feel like it's the hardest thing in the world to do but we still find a way to do it, that's fucking incredible. \n\nPeople whose brains and bodies aren't fighting them tooth and nail every day just to wake up and exist may judge us for feeling pride over tasks that they deem unworthy of it. But fuck them! They really don't get it. They think that they would just be able to do it because they haven't felt what you're feeling. But if they were feeling what you're feeling it would floor them. \n\nYou're strong as fuck and I'M proud of you. Even just until you can be proud of yourself ❤️",
      "created_utc": 1725640684.0,
      "score": 2
    },
    {
      "id": "lltjgzj",
      "body": "I’m so proud of you! I hope you can remember how good it feels to be clean in clean clothes when you start dreading your next shower! I would love to share some tips for you and anyone else struggling:\n\n1) Shower at night if you can. When you’re depressed or if you find showers overstimulating exhausting it’s much easier to shower the night before you want to be clean and just crawl into bed after. In high school I used to wake up early just to have time to shower and then get back in bed for an hour afterwards. It’s ok. Anything that helps *helps* and is nothing to be ashamed of.\n\n2) you do not need to stand the entire time! You can sit! There is no rule against it! If you can afford a shower bench that goes across a tub oh it makes a huge difference even just with shaving! Combine it with a handheld shower head and suddenly you don’t even have to get completely wet/naked you can sit, bend over and just wash your hair if nothing else. Even just rinse it! Don’t even have to shampoo and deep condition etc etc. \n\n3) you mentioned you lost a lot of hair, but in reality if you haven’t been brushing it for two months, you just took out all the dead hair that’s fallen off the last two months and hasn’t been able to shed naturally as it was up in a bun! This is a common thing people misunderstand. But I want to assure you, it’s normal hair loss you’re just seeing all that hair at once which can be scary. (If you are worried about hair loss and shedding get your thyroid checked as this can be a cause for depression and hair loss, joint pain and more)\n\n4) For the days you just don’t have the energy to shower, whole body wipes are amazing and you can even find them at Dollar Tree or buy in bulk from Amazon. Even just a wet washcloth will help. If you can’t wash your hair, try and brush it, if you can’t do that either braids are more protective for long hair, but do what you can! Nothing says you have to wash your hair every time you shower or that the shower is the only place you can wash your hair! Sometimes you only have energy for one or the other and that’s ok! You can wash your hair with a cup and big bowl of water, you can wash your hair in the kitchen sink (if you have long hair I recommend using the drain cover) I also recommend using dry shampoo between your wash days which will really help extend things.\n\nMost important tip I can give you is anything you can find the energy to do, is better than nothing. It is a kindness to yourself to do even the smallest thing even if all you can do one day is gargle mouthwash because you don’t even have the energy to brush your teeth. Be kind and gentle with yourself just like you would with a friend or child going through this. Tell yourself you are doing the best you can, you are doing *your* best and that is all that matters. There is no comparison to other people cuz everyone is different and we’re all just doing our best everyday. And everyday that best is going to look different. Highly critical and mean self talk “I’m so disgusting” hasn’t motivated you (or let’s be honest anyone) into showering and it likely won’t do it in the future, but kindness might get you there. “I’m just going to sit in the shower with the water running and not do anything.” Yes!! 👏🏻 amazing! Good job! That’s a great step and it’s so much more likely that “well since I’m here…” but be kind to yourself and give yourself permission to say, it’s ok for me to not do anything in the shower today. It’s ok for me to just do wet wipes and brush my hair today. It’s ok it’s ok it’s ok. \nI’m serious it’s ok.",
      "created_utc": 1725641353.0,
      "score": 2
    },
    {
      "id": "lltk4x7",
      "body": "YAY!!!! that sounds like it felt so amazing!! from someone else who struggles in similar ways, i know that cleaning your space and body can be so overwhelming that it just paralyzes you. overcoming that takes so much strength, more than any neurotypical person would ever understand. you’re not insane, you’re a fighter and you deserve to feel happy for yourself.",
      "created_utc": 1725641565.0,
      "score": 2
    },
    {
      "id": "lltrbks",
      "body": "I'm so PROUD OF YOU!! I know how hard this is (1 shower every couple of weeks) and I look up to you got pushing through and doing this!",
      "created_utc": 1725643858.0,
      "score": 2
    },
    {
      "id": "lltrlj3",
      "body": "Proud of you for doing the thing, and sharing your experience. I can relate fully. Especially with the hair thing. I have extremely curly hair and it turns to mats after a few days..i just cut 5 inches off and it was a huge help. Keep ip the good work",
      "created_utc": 1725643948.0,
      "score": 2
    },
    {
      "id": "lltv1ci",
      "body": ">I brushed my hair for the first time in forever, it took almost an hour and I lost so much hair\n\nDid you know that the average person loses about 100 strands of hair a day? Putting your hair in a bun can prevent them from just falling to the ground naturally. And since it sounds like you've been doing that for the better part of 2 months, you probably have 2 months of natural hair loss that you brushed out. Especially since curly hair can make it a bit more difficult for it to naturally fall to the ground too. \n\nI just wanted to assure you that the amount you saw wasn't because you neglected your hair. You weren't doing anything to make yourself lose a lot of hair. That amount was coming out slowly over time anyway. \n\nI'm proud of you. Even if you can only do 1 self care thing a day, that's an achievement.",
      "created_utc": 1725645047.0,
      "score": 2
    },
    {
      "id": "llty4bh",
      "body": "Your not pathetic, and it's okay to cry. Good for you hon. I barely get in 1 shower once every two weeks because I've got depression, trauma  and 2 small children. Give yourself a pat on that back and enjoy your freshly cleaned body and home.",
      "created_utc": 1725646028.0,
      "score": 2
    },
    {
      "id": "llu3dwa",
      "body": "It is not pathetic. It is not stupid. It’s amazing. I mean that. You did something good for yourself today. Something that took a lot of energy and bandwidth and you did it. This is something you should be proud of! A small win is still a win, you know? \n\nMy hygiene is the first thing to go when my depression gets bad. I’ve gone weeks without showering. Months without cleaning my room. I remember a particular time that it got so bad, my bedroom floor was COVERED in trash, unwashed Tupperware containers, dirty dishes, dirty clothes. You couldn’t see the floor from how much crap I accumulated. \n\nWhen I finally managed to get out of bed and clean and find my room again, my nephew (who was around 5 at the time) walked into my room, gasped, and said “Auntie cleaned! It looks so good in here!” with the biggest smile on his face. He hugged me and told me he was proud of me for cleaning my room. That little gesture made it all worth it. I still remember that day, and I how I felt and how he made me feel. \n\nCelebrate your victories, OP. Even the small ones. Because, at the end of the day, a victory is still a victory. I’m proud of you. 💜",
      "created_utc": 1725647721.0,
      "score": 2
    },
    {
      "id": "llv04fx",
      "body": "Good job 👏",
      "created_utc": 1725658350.0,
      "score": 2
    },
    {
      "id": "llv6cbl",
      "body": "Same boat. I'm proud of you. I'm going to force my self to take one tonight. We got this 💜",
      "created_utc": 1725660474.0,
      "score": 2
    },
    {
      "id": "llv90vz",
      "body": "Proud of you op 💗 cheers to a come up on getting outta that hole💗💗",
      "created_utc": 1725661421.0,
      "score": 2
    },
    {
      "id": "llvkx9u",
      "body": "I'm really happy for you.    You're awesome for pushing through no matter how long it took.   Takes a lot of inner strength. \n\nFrom someone who has been there.   \nCan't believe I didn't go bald either.",
      "created_utc": 1725665785.0,
      "score": 2
    },
    {
      "id": "llvrb16",
      "body": "I went through this a while ago and in therapy when I was ready the therapist told me not showering was a mask for me. A way to keep people, even myself from digging to deep. I had that disgusting, worthless feeling that told me how gross I was as a human being, something I heard most of my life.  Op you aren't alone and you deserve to feel good about yourself.",
      "created_utc": 1725668233.0,
      "score": 2
    },
    {
      "id": "llvufx8",
      "body": "A  journey of a thousand miles begins with a single step. Congrats, you took yours. Keep walking.",
      "created_utc": 1725669404.0,
      "score": 2
    },
    {
      "id": "llvxih6",
      "body": "When walking a mile is more than you can do right now, you need to celebrate every inch. Congratulations on today! Try to see if you can do something good for yourself again tomorrow. But if you can't manage it tomorrow, then the next day. You deserve it!",
      "created_utc": 1725670531.0,
      "score": 2
    },
    {
      "id": "llw4mks",
      "body": "hey random internet stranger, i’m proud of you ❤️ baby steps are still steps",
      "created_utc": 1725673300.0,
      "score": 2
    },
    {
      "id": "llx9m03",
      "body": "Only those of us in the same boat will realize how HUGE of an accomplishment this is! Super proud of you 😊 I don’t technically battle depression (at least I don’t think I do), but I have been battling chronic Lyme disease and the co-infection Babesia since 2009 (no cure). They cause a whole laundry list of symptoms…chronic fatigue, chronic pain, heart palpitations, joint pain, migraines, restless legs, difficulty swallowing, insomnia (or sleeping way too much during flare ups), nausea/vomiting/diarrhea, food intolerance, freezing and sweating at the same time, anxiety, getting overwhelmed very easily, temperature intolerance, sinus issues, twitching, etc. \n\nSometimes just the thought of getting out of bed to use the bathroom seems overwhelming (but I’ll eventually get up and do it). Showering is one of those activities that will totally drain me. So, the thought of getting in there and actually showing is extremely overwhelming for me. (Even more so after I was diagnosed with breast cancer a few years ago.) \n\nI’ll usually shower, shave and wash my hair weekly. If my hair HAS to be washed (I have long, straight hair that’s to my waist), I will lean over the side of the tub and use the handheld shower head to wash my hair. But, what I’ve found to be a total LIFESAVER is Lumē products. They have these whole body wipes that are amazing! I use those every day that I don’t shower. (Plus I use their shower gel when I do shower.) I also use their deodorant. It’s a 72 hour deodorant…and yes, it holds up for 72 hours lol. \n\nYou should seriously consider giving their wipes a try. You’ll probably love them as much as I do 🙂 Sending you gentle hugs on accomplishing so much the last couple of days. I’m beyond proud of you!",
      "created_utc": 1725693927.0,
      "score": 2
    },
    {
      "id": "llxmoic",
      "body": "I am so so proud of you. You did amazing, sweetheart.",
      "created_utc": 1725703131.0,
      "score": 2
    },
    {
      "id": "llxmw3t",
      "body": "hey, I wasn't able to wash my hair for three weeks, until yesterday. I know how hard it is to take that step. It's not \"just\" showering, and it's not gross. you tried your best then, and now you were able to do even more. I asked my family to ask me if I washed my hair once a month, which I find pathetic at times, but I know it's the only way I'll actually get it done. don't be harsh on yourself. You deserve to be proud. it's those proud moments that can push you through hard times.",
      "created_utc": 1725703277.0,
      "score": 2
    },
    {
      "id": "llxyrzd",
      "body": "Hey just don’t be me, I ended up not taking a shower for 4 months",
      "created_utc": 1725710464.0,
      "score": 2
    },
    {
      "id": "lly3dpy",
      "body": "Hey I'm proud of you! Pur greatest enemy in life can be our own mind and im so proud of you for continuing to be here every day you are wonderful and amazing and worthy of all the happiness in the world. I do want to offer one completely judgement free suggestion if you are open to it... I know it's a monumental task but if you do nothing else for yourself brush your hair daily many reasons I say this the shedding hair being tangled can cause migraines and headaches and the tension can make your depression worse from the constant pain and pulling also it will help with your visual outlook on yourself. Care for yourself how you would a scared hurting child. If being hard on yourself worked it would've worked by now. I suffer from horrible depression and so does my sister I'd sit there for hours gently detangling her 1 solid mat of hair telling her she's beautiful and everyone has hard times so your not alone in the hair thing or the shower thing. You are stronger than you know you battle yourself every day and your still undefeated remember that ❤️",
      "created_utc": 1725712710.0,
      "score": 2
    },
    {
      "id": "llycmdm",
      "body": "you did a good job. you're doing the healing thing people are supposed to do. feeling isn't a linear process, you'll have good days and bad days and ups and downs. but you're doing it, and you're doing great. don't be hard on yourself. i'm proud of you friend",
      "created_utc": 1725716665.0,
      "score": 2
    },
    {
      "id": "llyjmqj",
      "body": "Im glad you are proud. You will be surprised how much progress will come from the momentum of this one break through",
      "created_utc": 1725719333.0,
      "score": 2
    },
    {
      "id": "llzvwm6",
      "body": "honestly nothing to be ashamed of cuz healing is healing no matter the pace",
      "created_utc": 1725735694.0,
      "score": 2
    },
    {
      "id": "llqvfvy",
      "body": "Not pathetic or stupid. \n\nRemember the good feelings of going through these motions and make yourself take care of yourself at least a couple times a week. You are worth the effort. And it’s okay if it takes all the energy from you. Nothing is normal. So just do you. Every time you can. Good job.",
      "created_utc": 1725596264.0,
      "score": 2
    },
    {
      "id": "llp4bro",
      "body": "i’m so proud of you",
      "created_utc": 1725572739.0,
      "score": 1
    },
    {
      "id": "llp4crd",
      "body": "You deserve to feel proud of yourself, it's not stupid at all.",
      "created_utc": 1725572748.0,
      "score": 1
    },
    {
      "id": "llp4hgh",
      "body": "Self care goes a long way, boo. Keep going. Romanticize your life ♥️",
      "created_utc": 1725572790.0,
      "score": 1
    },
    {
      "id": "llp8gv3",
      "body": "I am so proud of you!",
      "created_utc": 1725574136.0,
      "score": 1
    },
    {
      "id": "llpa9ae",
      "body": "I’m so proud of you!",
      "created_utc": 1725574759.0,
      "score": 1
    },
    {
      "id": "llpc0sd",
      "body": "Woot woot!  Good for you.",
      "created_utc": 1725575375.0,
      "score": 1
    },
    {
      "id": "llpdxn7",
      "body": "I am so proud of you 🖤",
      "created_utc": 1725576061.0,
      "score": 1
    },
    {
      "id": "llpne77",
      "body": "Wow I never knew depression expressed like this, please take care and be kind to yourself",
      "created_utc": 1725579468.0,
      "score": 1
    },
    {
      "id": "llppefp",
      "body": "Every achievement counts.",
      "created_utc": 1725580193.0,
      "score": 1
    },
    {
      "id": "llpr3ip",
      "body": "Ayy good shit",
      "created_utc": 1725580812.0,
      "score": 1
    },
    {
      "id": "llprwh1",
      "body": "i'm very happy for you op",
      "created_utc": 1725581106.0,
      "score": 1
    },
    {
      "id": "llpt8af",
      "body": "I’m so proud of you, stranger 💜",
      "created_utc": 1725581591.0,
      "score": 1
    },
    {
      "id": "llpta1j",
      "body": "You did really great, OP. This is a proud moment for you and i hope youre celebrating it enough.",
      "created_utc": 1725581609.0,
      "score": 1
    },
    {
      "id": "llptbyi",
      "body": "You should be proud of yourself. That shit is so hard when you’re feeling that way",
      "created_utc": 1725581627.0,
      "score": 1
    },
    {
      "id": "llpu6i5",
      "body": "Be easy on yourself. You took a huge step and are still going. Keep telling yourself how good you are doing.",
      "created_utc": 1725581933.0,
      "score": 1
    },
    {
      "id": "llpujf4",
      "body": "I am really happy for you! That's duch a huge step! Actually 2! Cleaning and showering. You can be proud.",
      "created_utc": 1725582066.0,
      "score": 1
    },
    {
      "id": "llpux0e",
      "body": "I am so proud of you! You did good!",
      "created_utc": 1725582205.0,
      "score": 1
    },
    {
      "id": "llpv1s6",
      "body": "Yeah!!! I believe in you op!!! Even if its a while before you shower again, may you always remember what being nice and clean feels like so you get motivated again!!!!! Its worth it even if it doesn't last long :)",
      "created_utc": 1725582255.0,
      "score": 1
    },
    {
      "id": "llpv380",
      "body": "Yeah!!! I believe in you op!!! Even if its a while before you shower again, may you always remember what being nice and clean feels like so you get motivated again!!!!! Its worth it even if it doesn't last long :)",
      "created_utc": 1725582270.0,
      "score": 1
    },
    {
      "id": "llpvhya",
      "body": "Be proud of yourself \n\nYou done a lot more today than you did yesterday \n\nFocus on the positive things that you achieved \n\nYour lovely clean tangle free hair that smells great\n\nThe clean clothes that you have on\n\nHow great you feel with doing all of that",
      "created_utc": 1725582422.0,
      "score": 1
    },
    {
      "id": "llpvyun",
      "body": "Proud of you!",
      "created_utc": 1725582594.0,
      "score": 1
    },
    {
      "id": "llpwpdr",
      "body": "I’m really proud of you- today was a great day",
      "created_utc": 1725582862.0,
      "score": 1
    },
    {
      "id": "llpwwax",
      "body": "Gotta wash that ass",
      "created_utc": 1725582932.0,
      "score": 1
    },
    {
      "id": "llpxb11",
      "body": "You should feel proud! Good on you! The whole shebang!!",
      "created_utc": 1725583077.0,
      "score": 1
    },
    {
      "id": "llpypx6",
      "body": "I proud of you!  It’s hard to pull yourself out of the pit, and you’ve made the first step.",
      "created_utc": 1725583571.0,
      "score": 1
    },
    {
      "id": "llq0i41",
      "body": "I’m proud of you!",
      "created_utc": 1725584202.0,
      "score": 1
    },
    {
      "id": "llq6704",
      "body": "I'm so proud of you for taking care of you! You are an amazing human being, dearest, and your life will get better! I am always here for you, and it looks like you have an amazing family online who cares about you deeply so please be good to yourself! Hugs to you!",
      "created_utc": 1725586244.0,
      "score": 1
    },
    {
      "id": "llq6902",
      "body": "I’m so proud of you!",
      "created_utc": 1725586264.0,
      "score": 1
    },
    {
      "id": "llq6e9v",
      "body": "to some what you've described may sound \"gross\" but not to me ... I totally get what you're saying ... I've been there myself  ...  you accomplished a lot today so feel good about that ... be proud of yourself because I know how difficult it can be ... I hope tomorrow is another good day for you ... ❤️",
      "created_utc": 1725586319.0,
      "score": 1
    },
    {
      "id": "llq940r",
      "body": "OMG!  Look at you go.  I am so proud of you.  You were brave and did the things.  That's awesome.",
      "created_utc": 1725587291.0,
      "score": 1
    },
    {
      "id": "llq973n",
      "body": "So, so proud of you!",
      "created_utc": 1725587323.0,
      "score": 1
    },
    {
      "id": "llq9dhg",
      "body": "Way to go OP! Congratulations on your achievement. I hope that you will get better and better as the days go by.",
      "created_utc": 1725587388.0,
      "score": 1
    },
    {
      "id": "llqika1",
      "body": "I’m so proud of you. Keep going, it’s so, so worth it. You are so, SO worth it. <3",
      "created_utc": 1725590842.0,
      "score": 1
    },
    {
      "id": "llqipu5",
      "body": "Hi, OP! Please do know that a random stranger like me is so proud of you!",
      "created_utc": 1725590903.0,
      "score": 1
    },
    {
      "id": "llqk1zf",
      "body": "O. M. G. You are not alone. You should be proud. And thank you. ♥️♥️♥️ This really got me choked up and crying. 🥹",
      "created_utc": 1725591450.0,
      "score": 1
    },
    {
      "id": "llqk3kc",
      "body": "HECK YEAH!!!!!! Way to go :D Proud of you",
      "created_utc": 1725591468.0,
      "score": 1
    },
    {
      "id": "llqmc6h",
      "body": "I’m so proud of you!",
      "created_utc": 1725592369.0,
      "score": 1
    },
    {
      "id": "llqmh87",
      "body": "Baby steps. We’re rooting for you.",
      "created_utc": 1725592426.0,
      "score": 1
    },
    {
      "id": "llqmnnz",
      "body": "The longer you didn't do something, the harder it gets. Yet you did it anyway. That isn't pathetic at all, I'm really glad you managed to shower and feel clean again. I hope you can find a way to make the barrier lower so you don't have to go through this again.",
      "created_utc": 1725592499.0,
      "score": 1
    },
    {
      "id": "llqovum",
      "body": "I’m proud of you 🫶🏻",
      "created_utc": 1725593419.0,
      "score": 1
    },
    {
      "id": "llqqe7j",
      "body": "The world is a better place with you in it. I shower at best once a week and normally around 2. I'm functional, but it seems so hard to do.",
      "created_utc": 1725594043.0,
      "score": 1
    },
    {
      "id": "llqqjud",
      "body": "Proud of you! 💜",
      "created_utc": 1725594106.0,
      "score": 1
    },
    {
      "id": "llqqnwq",
      "body": "From another who sometimes struggles, I'm proud of you. You did an amazing job. Try to remember the feeling and chase the feels. Go in with your clothes on even. Chase the cozy feels :)",
      "created_utc": 1725594153.0,
      "score": 1
    },
    {
      "id": "llqqxlf",
      "body": "This is a major achievement for sure!!! Now just try to keep up with it being apart if your daily routine!! \n\nI find that after I’ve had spell of depression and I start that shower process again it’s easier to keep up with it if it’s the first thing I do in the morning, then it’s over with for the day and if I just need to lay and rot it’s whatever",
      "created_utc": 1725594267.0,
      "score": 1
    },
    {
      "id": "llqr96d",
      "body": "that is SO GOOD dude, keep it up!!! it’s a huge milestone, super proud of you",
      "created_utc": 1725594406.0,
      "score": 1
    },
    {
      "id": "llqrcun",
      "body": "You did AMAZING. When your mental health is low, even the simplest tasks are the biggest mountains to climb. I’m so so so proud of you.",
      "created_utc": 1725594451.0,
      "score": 1
    },
    {
      "id": "llqrz30",
      "body": "I’m currently in a shower-a-week, teeth brushed once a day phase. Depression is so debilitating. You overcame a challenge, you did good",
      "created_utc": 1725594724.0,
      "score": 1
    },
    {
      "id": "llqs2zw",
      "body": "I'm really happy for you ❤️",
      "created_utc": 1725594771.0,
      "score": 1
    },
    {
      "id": "llqs5kr",
      "body": "I know you know this, but remember that feeling of the fresh and clean warm clothes after your shower.  You can have that feeling anytime you want.  :)",
      "created_utc": 1725594802.0,
      "score": 1
    },
    {
      "id": "llqs9m5",
      "body": "YEAHHHHHH🤩🤩🤩🤩🤩🤩🥳🥳🥳🥳🥳",
      "created_utc": 1725594850.0,
      "score": 1
    },
    {
      "id": "llqt2oz",
      "body": "It's okay. It really does feel amazing to have your hair brushed again, doesn't it? I get emotional when I do the same.\n\nI often go a month or three without brushing my hair. I'll shower once or twice a week. I have to go to my mom's and ask her to brush my hair. It'll take a could hours.\n\nI'm so proud of you, stranger. Keep it up :)",
      "created_utc": 1725595182.0,
      "score": 1
    },
    {
      "id": "llqte9t",
      "body": "You did well, my friend.\n\n1 step at a time.\n\nMore showers to come",
      "created_utc": 1725595324.0,
      "score": 1
    },
    {
      "id": "llqtttn",
      "body": "Hey your doing a good job OP! Keep it up!",
      "created_utc": 1725595519.0,
      "score": 1
    },
    {
      "id": "llqtuuw",
      "body": "I am proud of you ❤️ much love",
      "created_utc": 1725595532.0,
      "score": 1
    },
    {
      "id": "llquuuz",
      "body": "Hey, this internet stranger is really proud of you.",
      "created_utc": 1725595987.0,
      "score": 1
    },
    {
      "id": "llqwif6",
      "body": "I hope you have the courage to get up and do it again tomorrow:",
      "created_utc": 1725596778.0,
      "score": 1
    },
    {
      "id": "llqwur1",
      "body": "You did so good! I’m so proud of you, and I am glad you are proud of yourself!",
      "created_utc": 1725596945.0,
      "score": 1
    },
    {
      "id": "llqxgy4",
      "body": "Way to go friend. I know it's hard sometimes. I live in the same place, different address.",
      "created_utc": 1725597249.0,
      "score": 1
    },
    {
      "id": "llqxkqr",
      "body": "That is awesome, you did amazing. I have the same problem sometimes (usually never more than a few days but that's because I have OCD as well so once I can start smelling myself I get grossed out) and what's kept me showering daily for over like two years now is that feeling of feeling clean, fresh, and my mind feels clearer too. You got this!!",
      "created_utc": 1725597301.0,
      "score": 1
    },
    {
      "id": "llqxu1y",
      "body": "That’s amazing !! 🤩👏🏻",
      "created_utc": 1725597431.0,
      "score": 1
    },
    {
      "id": "llqyvyk",
      "body": "Honestly, I'm so proud of you!\nI've been so sick and exhausted. The other day, hubs helped me in the shower. I just sat in the tub while he washed my hair. Then I went back to bed and slept for 12 hours. It was the best sleep I've had in months.",
      "created_utc": 1725597966.0,
      "score": 1
    },
    {
      "id": "llqzmfs",
      "body": "I hate showering, too. You're not alone, and I know what a task showering actually is. I'm proud of you.",
      "created_utc": 1725598353.0,
      "score": 1
    },
    {
      "id": "llqzrsl",
      "body": "Fuck yeah do the damn thing",
      "created_utc": 1725598431.0,
      "score": 1
    },
    {
      "id": "llr0dms",
      "body": "I'm so proud of you! Remember that people shed hair every day, so if you haven't brushed yours out in a while and now you are, most of what you're brushing out is just what you've naturally shed and it just wasn't able to fall. You're not going bald. :)",
      "created_utc": 1725598760.0,
      "score": 1
    },
    {
      "id": "llr0g18",
      "body": "I'm proud of you OP!",
      "created_utc": 1725598796.0,
      "score": 1
    },
    {
      "id": "llr0l3c",
      "body": "Be proud, dance around, sing. Give yourself a big hug —you’re worth all of the love and care you pour into yourself. Fill your cup up and let it overflow.💗",
      "created_utc": 1725598873.0,
      "score": 1
    },
    {
      "id": "llr0rdh",
      "body": "I’m so proud of you!!!! I got a plastic stool that I can sit on  for the hard days. Definitely makes actually getting in the shower less of a wall",
      "created_utc": 1725598968.0,
      "score": 1
    },
    {
      "id": "llr12an",
      "body": "I am so proud of you. ",
      "created_utc": 1725599133.0,
      "score": 1
    },
    {
      "id": "llr167r",
      "body": "I am so, so proud of you. Sending hugs and cheering for you from the PNW.",
      "created_utc": 1725599193.0,
      "score": 1
    },
    {
      "id": "llr1d73",
      "body": "Go you for doing the hard thing!\n\n~Signed, someone who showered tonight for the first time in a week and a half due to a combo of depression and chronic pain, mostly only so my spouse didn’t have to put up with my stinky self on our anniversary",
      "created_utc": 1725599302.0,
      "score": 1
    },
    {
      "id": "llr1tq4",
      "body": "Holy cow you did *so many things* today, that's awesome! Depression and other mental illnesses can make doing things really hard because it disrupts the pathways our brains are accustomed to using to execute processes. Expecting you to function \"normally\" while in a depressive episode is like telling someone to turn a wooded grove into a log cabin without any axes, saws or hammers. But today you not only worked to restore your environment, you overcame a mental block to perform extensive personal hygiene tasks beyond the basics.\n\nYou SHOULD be proud of yourself, those are significant efforts you made today. And now that you've done it the next time will be just a teensy bit easier even if it isn't right away. Please absolutely do be proud of yourself because I am extremely proud of you just like a lot of other commenters here.",
      "created_utc": 1725599555.0,
      "score": 1
    },
    {
      "id": "llr1wha",
      "body": "Keep healing. Step by step. So proud of you for giving the love your body was craving.",
      "created_utc": 1725599598.0,
      "score": 1
    },
    {
      "id": "llr21n9",
      "body": "Proud of you! One step at a time.",
      "created_utc": 1725599678.0,
      "score": 1
    },
    {
      "id": "llr2nay",
      "body": "Im so happy for you OP!",
      "created_utc": 1725600012.0,
      "score": 1
    },
    {
      "id": "llr2sbu",
      "body": "I am proud of you .",
      "created_utc": 1725600091.0,
      "score": 1
    },
    {
      "id": "llr3hlo",
      "body": "i hate having to shower because I have to wash my hair.  and each time I lose so much.  You have done SO MUCH and you are powerful.  You only lost that much hair, over 2 months!  you lose a bunch every day, so you just let it go in one session, and it's okay to let it go.  \n\nThese are small, but wonderful victories for another reason.  you could close your eyes and feel GOOOOOD.  a small thing.  Things could be falling apart, but feeling clean, surrounded by warmth, you can, with small efforts, wrap yourself in comfort.  I hope you keep that as a secret weapon.  Good luck.",
      "created_utc": 1725600488.0,
      "score": 1
    },
    {
      "id": "llr3hlu",
      "body": "Lovely job, one day and task at a time, but next time if you start to feel overwhelmed just remember how lush you felt after that shower with fresh clothes. All the very best sweet",
      "created_utc": 1725600488.0,
      "score": 1
    },
    {
      "id": "llr4rmk",
      "body": "Congratulations on taking that amazing step! 🥳🥳Think about how good it felt today after your shower and do it again tomorrow!! Deep depression is hell, but it’s the little things you accomplish every day that get you out of that dark hole. Keep going! 🫶🏽",
      "created_utc": 1725601218.0,
      "score": 1
    },
    {
      "id": "llr5ixh",
      "body": "I'm incredibly proud of you! I've been there and it can be a real struggle to get out of that place so well done. 💞\nYou are wonderful. 💐",
      "created_utc": 1725601657.0,
      "score": 1
    },
    {
      "id": "llr5r5r",
      "body": "Girl YES. Fuck yes. Seriously good job. It can be really hard to explain things like this, but I know how hard it can be, and *you did it.* 🥳\n\nProud of you! I know that’s weird to say to someone I don’t know, but I DO know the overwhelming feeling, and I’m proud of anyone who can push hard enough to get it done. You did good.\n\nPs idk if you’re a girl or not; “girl yes” is just how I talk lol",
      "created_utc": 1725601789.0,
      "score": 1
    },
    {
      "id": "llr64h5",
      "body": "I'm almost out of the shower inferno situation doing it 5/week! For me, doing a nasty, sweaty and as messy as possible errand/repair/anything will make showering sexier and sexier as time goes by. Bonus points if I engage in such activities with the sole intent of pushing myself to  shower cos then I'm also doing things that I'd usually avoid and tend to build up, so its a two way positive feedback!!\n\nSharing my latest win as an insomniac:  last night, (ok ok 4am) I laid in my just changed bed, threw a comfy quilt on, turned the lights off and willingly decided it was nap time and I.... slept! Voluntarily and not from exhaustion!!",
      "created_utc": 1725602008.0,
      "score": 1
    },
    {
      "id": "llr67j5",
      "body": "Congrats! You dit well, darling💕",
      "created_utc": 1725602059.0,
      "score": 1
    },
    {
      "id": "llr6dyi",
      "body": "Been there, good on you for feeling better! Self care will help with the good feeling. I love clean sheets in a made bed after showering. Speaking of, the shower and my bed calls me... I can't wait for the \"ahhhh\" moment when I lay down and some of tbe weight of the day unloads.",
      "created_utc": 1725602167.0,
      "score": 1
    },
    {
      "id": "llr6g2i",
      "body": "It's not pathetic or stupid at all. You've taken a HUGE step in finding your way back to yourself. Be proud. Be very proud.",
      "created_utc": 1725602202.0,
      "score": 1
    },
    {
      "id": "llr6miq",
      "body": "So proud of you friend! <3",
      "created_utc": 1725602312.0,
      "score": 1
    },
    {
      "id": "llr6xbx",
      "body": "Extremely well done!! Congratz 🥳🥳🥳🥳🥳🥳",
      "created_utc": 1725602491.0,
      "score": 1
    },
    {
      "id": "llr75ks",
      "body": "Oh sweetie.  Doing that and making your bed every day are good goals ❤️",
      "created_utc": 1725602631.0,
      "score": 1
    },
    {
      "id": "llr7h3p",
      "body": "It's not pathetic and stupid, THIS IS SOMETHING TO BE PROUD OF! Good for you!",
      "created_utc": 1725602828.0,
      "score": 1
    },
    {
      "id": "llr7yez",
      "body": "Anybody with mental illness understands you. We are so proud of you. We don’t think you’re gross. 🫶",
      "created_utc": 1725603126.0,
      "score": 1
    },
    {
      "id": "llr8etr",
      "body": "Keep at it. Proud of you!",
      "created_utc": 1725603411.0,
      "score": 1
    },
    {
      "id": "llr8sfi",
      "body": "Not stupid, not pathetic. More like fucking awesome. Good for you and thank you for sharing - I bet you have no idea how many people may read this and take inspiration from it. Proud of you OP!",
      "created_utc": 1725603652.0,
      "score": 1
    },
    {
      "id": "llr955f",
      "body": "I'm so happy for you, you really deserve it!",
      "created_utc": 1725603875.0,
      "score": 1
    },
    {
      "id": "llr9njq",
      "body": "I suffer from this barging aversion when I'm depressed or anxious too. Sometimes it feels composted or I feel too vulnerable or exhausted. I'm really proud of you!",
      "created_utc": 1725604199.0,
      "score": 1
    },
    {
      "id": "llraqbg",
      "body": "I’m so proud of you. \n\nPlease be kind to yourself. Recovery isn’t linear and it’s okay if you struggle to do it again in the near future. You will do it again when it works for you 😊",
      "created_utc": 1725604882.0,
      "score": 1
    },
    {
      "id": "llrat42",
      "body": "You did amazing 💜 brought a little tear to my eyes, hearing about you seeing your fresh curls and warm clothes post-shower!🥰",
      "created_utc": 1725604929.0,
      "score": 1
    },
    {
      "id": "llrbklr",
      "body": "I’ve done this. It’s been so bad that I have had really severe hair loss because I would go weeks without showering or running a brush or pick my hair out. You’re definitely not alone. I try and make myself a list of goals for the following day, and try and at least handle one. If I can do that then I’ve won and I feel better about life and myself. Just remember you’re worth fighting for and you grab this by the horns and just kick its A**!!! You are strong. You are a good person. Just keep saying those things and look at yourself in the mirror and tell yourself that you are beautiful and you deserve happiness. 🫶🏽",
      "created_utc": 1725605413.0,
      "score": 1
    },
    {
      "id": "llrbtwc",
      "body": "Yay! Proud of u. Sometimes, simple tasks can be so hard to do.",
      "created_utc": 1725605576.0,
      "score": 1
    },
    {
      "id": "llrehj7",
      "body": "I bet that everything-shower felt SO good, proud of you 💜  Was in that place myself several months ago.",
      "created_utc": 1725607321.0,
      "score": 1
    },
    {
      "id": "llrf0mg",
      "body": "This is amazing OP. You can be proud of yourself and damn am I proud of you. 🌸 \n\nYou not only cleaned your apartment but did your laundry AND dryer AND yes took THE shower, with full on routines. \n\nThis is amazing. It's such an incredible proof that you can still function. And maybe it is a sign that you're beginning to feel better. \nI know depression takes an always-too-long time to heal. But you can see it in the little things. \n\nMy best friend has been struggling with depression for the last 18 months. Yesterday she sent me a few pictures of the new disposition of her kitchen : she cleaned, rearranged, and installed 2 new shelves for her plants. I feel so happy. 🥹🥰🌸\n\nTake good care of you. No pressure. But boy it is like heaven to put on pajamas still warm from the dryer. With that, a hot tea, with a good book/netflix show, in a cosy armchair.🥰🥰 I wish you a lot of cocooning.",
      "created_utc": 1725607686.0,
      "score": 1
    },
    {
      "id": "llrf6ni",
      "body": "Great job. So proud of you ❤️",
      "created_utc": 1725607803.0,
      "score": 1
    },
    {
      "id": "llrf8hw",
      "body": "You did such a good job! \n\n>actually having my hair down, my skin feels soft, and I put on some sweatpants and a t shirt that were still warm from the dryer and it just feels heavenly\n\nYou know what? I'm gonna go and take a shower too. It's been a while",
      "created_utc": 1725607838.0,
      "score": 1
    },
    {
      "id": "llrfnck",
      "body": "What a huge achievement, well done OP, we’re all rooting for you!!! ❤️❤️❤️",
      "created_utc": 1725608123.0,
      "score": 1
    },
    {
      "id": "llrg34e",
      "body": "That is a tremendous victory, I feel so proud of you! 🖤 I am very impressed that you managed to do the everything shower AND cleaning the place while having severe mental blocks. To me you're a hero ✨",
      "created_utc": 1725608432.0,
      "score": 1
    },
    {
      "id": "llrg52y",
      "body": "Good for you :) You should be proud of your accomplishment",
      "created_utc": 1725608470.0,
      "score": 1
    },
    {
      "id": "llrgckd",
      "body": "Not pathetic and stupid AT ALL.  This is a huge milestone, celebrate it.  Depression is a beast, absolutely NO JOKE.  You’ve accomplished something FOR YOU!  This post brought tears to my eyes…I relate very much to this struggle and you’ve inspired me.",
      "created_utc": 1725608617.0,
      "score": 1
    },
    {
      "id": "llrgf5m",
      "body": "As a fellow depression sufferer: I am so incredibly proud of you! You made me tear up...",
      "created_utc": 1725608668.0,
      "score": 1
    },
    {
      "id": "llrgrbn",
      "body": "In a world that too often seems ugly and bleak, YOU made me smile today. I'm proud of you -- I'm sure your scalp and skin are comforted. Try not to forecast what happens next, just celebrate your progress right now. 🫂",
      "created_utc": 1725608904.0,
      "score": 1
    },
    {
      "id": "llrhn10",
      "body": "Congrats on taking a bit of control back from the pain that is depression. \n\nYou deserve to be happy. You deserve to feel warm and snuggly in clean, dry clothes with a clean, dry body. Most of the hair you 'lost' will be what was being shed naturally each day but had nowhere to go because it was caught up with the rest. \n\nYour new flatmate is only going to know this version of you. Try to maintain it, and speak to a doctor about the depression. There is a lot of help available to beat its ass.",
      "created_utc": 1725609525.0,
      "score": 1
    },
    {
      "id": "llrhtuv",
      "body": "That's amazing! I'm proud of you. Do you feel fresher?",
      "created_utc": 1725609654.0,
      "score": 1
    },
    {
      "id": "llriqly",
      "body": "oh my love, you did so well! it isn't gross, disgusting or despisable, because we all know it's a situation we just can't avoid. i'm a functioning depressed, and sometimes at the end of the day a shower just feels like too much.",
      "created_utc": 1725610292.0,
      "score": 1
    },
    {
      "id": "llriygw",
      "body": "This is something I had to respond to. In March my son brought home a strand of flu b. I was inoculated but not to this specific strand. I was 33. I went from a cold to not being able to breathe  in 3 days. \n\nIt started as the flu, turned into rsv, strep, bacterial pneumonia, fungal pneumonia, sepsis, and finally, septic shock. \n\nI went to my local er, was immediately admitted into the ICU, and transported to a major hospital in the nearest major city.\n\nI remember nothing. I walked into the ER, told them I could not breathe, and woke up from a medically induced coma a month later. \n\nMy infectious disease doctor told me I was as close to dying without actually kicking the can as I could possibly get. \n\nThen, the septic shock started up. \n\nI went from a full head of beautiful hair, down to my hips, to loosing it all. \n\nI didn't shower for 3 months because every time I did, more and more and more of my hair fell out. \n\nIt was horrifying. \n\nI finally started showering again about a week ago when I would run my fingers through my hair and not end up with hundreds of stands of hair in my fingers. \n\nI lost almost all of it. \n\nI can not even put my hair in a ponytail. It is all gone. \n\nIt has been one of the most traumatic things I've ever been through. \n\nAt first I thought the dread locks from being in the coma was the problem.  I cried as my mom brushed them out for me. But it just kept falling out. \n\nSo I ignored it. \n\nI felt so gosh darn nasty. I could barely get myself out of bed.\n\nI finally accepted what was happening and got it all chopped off.\n\nIt took another 2ish months for it to stop falling out. When I finally ran my fingers through what was next to nothing, I forced myself to get in the shower and have done it every single day for the last week. \n\nI couldn't even look in the fucking mirror because I was so terrified that that alopecia would be permanent.\n\nIt's starting to grow back now but it has been one of the most traumatic thing I have ever been through. \n\nThis sounds crazy. I literally almost died because my son brought home a strand of the flu that my shot didn't cover. I couldn't talk, walk, eat, or really even think... but losing my hair has been absolutely horrifying. \n\nBut WE did it. We got in the shower, we cleaned ourselves up, and we decided that we are not going to do this to ourselves anymore. \n\nI'm as proud of you as I am of myself. \n\nIt might take years for my hair to grow back, but it will not take me years to take care of myself. \n\nI'm proud of you, and I'm happy you kept as much as you did. \n\nOne day at a time. \n\nWe wake up, we make a decision, and we follow through. \n\nMy therapist told me it takes two weeks to turn a chore into a routine. You've got this. \n\nI'm proud of you.",
      "created_utc": 1725610443.0,
      "score": 1
    },
    {
      "id": "llrj3qi",
      "body": "Proud of you - it's nothing to be ashamed of.",
      "created_utc": 1725610547.0,
      "score": 1
    },
    {
      "id": "llrlnbq",
      "body": "That is such a big deal! Do not minimize your accomplishment, sometimes we can find a win while our depression is heavy. It's so great you are doing things to make you feel like yourself!",
      "created_utc": 1725612319.0,
      "score": 1
    },
    {
      "id": "llrlnjj",
      "body": "So proud of you. Well done.",
      "created_utc": 1725612324.0,
      "score": 1
    },
    {
      "id": "llrls69",
      "body": "I am so proud of you. 👏",
      "created_utc": 1725612413.0,
      "score": 1
    },
    {
      "id": "llrlxd2",
      "body": "PROUD of you Op!!",
      "created_utc": 1725612514.0,
      "score": 1
    },
    {
      "id": "llrlxms",
      "body": "That’s awesome! I hope you are as proud of yourself as the rest of us are for you!",
      "created_utc": 1725612520.0,
      "score": 1
    },
    {
      "id": "llrm25a",
      "body": "Well done 😁 I feel you, it's hitting me hard at the mo, in the once a week showering routine, or if I have to be somewhere (like a job interview)",
      "created_utc": 1725612606.0,
      "score": 1
    },
    {
      "id": "llrmbb5",
      "body": "Wow good job bro im proud of you 👑",
      "created_utc": 1725612779.0,
      "score": 1
    },
    {
      "id": "llrmlgm",
      "body": "This is fantastic. Well done and enjoy the sensation and the feelings ❤️",
      "created_utc": 1725612971.0,
      "score": 1
    },
    {
      "id": "llrnc4z",
      "body": "I hope you felt better afterward, too 🥺 little steps. Keep it up!",
      "created_utc": 1725613491.0,
      "score": 1
    },
    {
      "id": "llrnmfb",
      "body": "It’s ok. Glad you’re still here.",
      "created_utc": 1725613692.0,
      "score": 1
    },
    {
      "id": "llrouyh",
      "body": "I bet you are beautiful!!! You are shinging now from the inside and outside! I'm so proud of you!! This was a big step and you did it!!! 💜💜💜\n\nP.S. thank you for sharing, that's a huge deal as well!!",
      "created_utc": 1725614561.0,
      "score": 1
    },
    {
      "id": "llrowry",
      "body": "You did great. You deserve to feel comfortable and proud of yourself.",
      "created_utc": 1725614597.0,
      "score": 1
    },
    {
      "id": "llrpbam",
      "body": "Well done!",
      "created_utc": 1725614877.0,
      "score": 1
    },
    {
      "id": "llrpzid",
      "body": "You did amazing be proud ❤️",
      "created_utc": 1725615341.0,
      "score": 1
    },
    {
      "id": "llrq85z",
      "body": "I promise you it is not pathetic and you should absolutely feel proud of yourself! Im proud of you too! \nIve struggled with depression and taking care of myself as well so I know how you feel. I also have curly hair and when I'm not feeling great a long detangling session in the shower does not sound appealing at all 😂\nFocus on the good feeling you have now and dont forget it!! Youve got this!!",
      "created_utc": 1725615502.0,
      "score": 1
    },
    {
      "id": "llrtrli",
      "body": "Awesome! \n\n\nTry not to lose your momentum now. Remebe that every journey starts with one small step and now that you've started your journey, keep taking steps, okay? Think about where your path leads. You are doing great. \n\n\nThis mom is really proud of you!",
      "created_utc": 1725617806.0,
      "score": 1
    },
    {
      "id": "llru1vh",
      "body": "Excellent work. Now keep it up, build on the win, one tiny thing at a time.",
      "created_utc": 1725617986.0,
      "score": 1
    },
    {
      "id": "llrud2g",
      "body": "Yay!!!! Progress is progress no matter how small",
      "created_utc": 1725618173.0,
      "score": 1
    },
    {
      "id": "llrutpp",
      "body": "Congregations, no seriously. It's tough to take care of yortself when you don't care.",
      "created_utc": 1725618450.0,
      "score": 1
    },
    {
      "id": "llrxbot",
      "body": "Bro I'm about to cry for you 🥹 that is so great, it can be *so* hard. It is not stupid or pathetic to be proud of this, if ever there was a reason to be proud of something... It's this. You are doing great, keep up the battle friend, I hope things get better/easier for you ❤️",
      "created_utc": 1725619904.0,
      "score": 1
    },
    {
      "id": "llrxgpb",
      "body": "Good for you!!! ❤️❤️",
      "created_utc": 1725619980.0,
      "score": 1
    },
    {
      "id": "llrxziq",
      "body": "Congratulations dear OP! This stranger is so proud of you 🤍",
      "created_utc": 1725620263.0,
      "score": 1
    },
    {
      "id": "llryyp4",
      "body": "Dude this is such a slay. You’re killing it. Keep it up, we’re all proud of you.",
      "created_utc": 1725620789.0,
      "score": 1
    },
    {
      "id": "lls1bhn",
      "body": "You did awesome \n🩷🩷🩷🩷🩷🩷\n\nTake it one day at a time",
      "created_utc": 1725621988.0,
      "score": 1
    },
    {
      "id": "lls1bnb",
      "body": "Not pathetic or stupid. You are a badass!!",
      "created_utc": 1725621990.0,
      "score": 1
    },
    {
      "id": "lls1i7j",
      "body": "This is only the beginning. Congratulations the ball is rolling",
      "created_utc": 1725622078.0,
      "score": 1
    },
    {
      "id": "lls4970",
      "body": "Proud of you OP. May you have more days like this 🫂❤️",
      "created_utc": 1725623369.0,
      "score": 1
    },
    {
      "id": "lls4f7r",
      "body": ">I know it’s pathetic and stupid to be proud of myself for something so gross\n\nOP, it's not pathetic and stupid. You have every right to be proud of yourself, hell, I AM proud of YOU!! Congratulations on making that first step!\n\nDepression is a fucking hell, right? But these moments are really important and the more you congratulate yourself, the better.\n\nOne thing I used to do when my depression was at its highest was making a list of things I had to do. Like \"1. waking up and brushing my teeth\" and that was it. If showering was too much, I tried to wash my hair. Only the hair. Then on the other day, I cleaned my body. Small baby steps are huge, OP.\n\nBest wishes, my dude, keep going.",
      "created_utc": 1725623445.0,
      "score": 1
    },
    {
      "id": "lls4tl8",
      "body": "OMG... Cheers for being so brave! And I know I didn't do anything, but I am so proud of you for doing all of this!",
      "created_utc": 1725623626.0,
      "score": 1
    },
    {
      "id": "lls6olb",
      "body": "I’m proud of you too.  I know how it can be during those dark times.  You’re amazing, you’re going to be just fine. Keep putting one foot in front of the other.",
      "created_utc": 1725624466.0,
      "score": 1
    },
    {
      "id": "lls7l12",
      "body": "You go ahead & be proud. Cause I am. You got yourself out of slump & did what needed to be done.  It's one of the hardest things to do",
      "created_utc": 1725624866.0,
      "score": 1
    },
    {
      "id": "lls7x1a",
      "body": "Way to go OP! I struggle so badly with this too. We are not gross. We are fighting. And today you won your fight! Remember you can do it! Always. And if you can’t, then try again tomorrow. There are a ton of us I promise! Just not everyone is brave enough to talk to about it. Love and hugs from an internet stranger!!! ❤️❤️❤️",
      "created_utc": 1725625009.0,
      "score": 1
    },
    {
      "id": "lls829i",
      "body": "I’m so proud of you!!!",
      "created_utc": 1725625072.0,
      "score": 1
    },
    {
      "id": "lls8cg6",
      "body": "I’m so proud of you 👏",
      "created_utc": 1725625196.0,
      "score": 1
    },
    {
      "id": "lls97wz",
      "body": "I understand how you feel. In 2021, I experienced an unusually severe episode of anxiety and depression and that lasted about 4 months. If I managed to take one shower a week, it was a big deal. Maybe this roommate change is something you needed to get back into gear.",
      "created_utc": 1725625571.0,
      "score": 1
    },
    {
      "id": "lls983t",
      "body": "BRAVO!  Brave friend!  You are doing Fantastic!  I'm so proud I can feel myself smiling as I write. Your happy tears have washed relief over your face. You've broken free and there's not stopping you now!",
      "created_utc": 1725625573.0,
      "score": 1
    },
    {
      "id": "lls98oh",
      "body": "I am so goddamn proud of you, you've been through so much and you're fighting on, you are so strong, i am sending virtual hugs to you❤️❤️",
      "created_utc": 1725625580.0,
      "score": 1
    },
    {
      "id": "llsalmj",
      "body": "Depression is a serious illness, and when you're in the thick of it, it can be extremely difficult to take proper care of yourself. Please don't feel ashamed of this. Although not taking a shower for a while might feel/be gross, that does not mean that *you* are gross.\n\nNot the same thing, but I have ADHD and I have a ton of trouble getting myself into the shower because of the time commitment involved. It just seems so daunting. And the longer I put it off, the more overwhelming it gets. I can imagine how difficult and overwhelming it would be after months of this, and it's super impressive that, on your own, you were able to grit your teeth and get it done. That's awesome, and you should feel really proud of yourself.",
      "created_utc": 1725626149.0,
      "score": 1
    },
    {
      "id": "llsbc9d",
      "body": "Omg I'm so proud of you!! I promise you're not alone in not showering for that long. I've come close myself. Depression is a jerk who makes it hard to take care of our basic needs. You did it, though! You are so strong and you have no idea 💖\n\nAlso! If you can, get yourself a treat to celebrate too. Be proud of yourself!",
      "created_utc": 1725626453.0,
      "score": 1
    },
    {
      "id": "llsbjsn",
      "body": "Well done you, you’ve taken the first step and that’s awesome.",
      "created_utc": 1725626537.0,
      "score": 1
    },
    {
      "id": "llsbk21",
      "body": "A good everything shower is THE BEST!! Don’t forget this feeling and try to keep it up. I’m proud of you❤️❤️❤️",
      "created_utc": 1725626540.0,
      "score": 1
    },
    {
      "id": "llsbuf9",
      "body": "That is awesome. I'm proud of you!! That is SUCH a huge relief, and dopamine boost, I imagine. ❤️❤️ I hope it left you with the motivational boost to keep on this path, slowly and steadily. You're doing great. ☺️",
      "created_utc": 1725626656.0,
      "score": 1
    },
    {
      "id": "llscze1",
      "body": "Congrats!!!!! I am so happy for you!!!! Celebrate this stride!",
      "created_utc": 1725627105.0,
      "score": 1
    },
    {
      "id": "lloldqb",
      "body": "Did a really great job (both the cleaning of the house AND self) \n\nalso from someone who's in the weekly shower stage... for the past 15 years lol",
      "created_utc": 1725566761.0,
      "score": 600
    },
    {
      "id": "llpjuim",
      "body": "I was that way for a while, keep it up! I was at the 1 every 2 or 3 days for a long time too. Now I'm somewhere between 1 per day and 1 every other day! It gets better, just keep finding reasons to force yourself to shower. \n\nAlso, if you can afford it, maybe spend a few extra dollars on expensive soap. I bought some and it motivates me to shower more cause now I have expensive soap I need to use. Otherwise it'd be a waste of money and I can't have that.",
      "created_utc": 1725578189.0,
      "score": 230
    },
    {
      "id": "llq1zm0",
      "body": "I get a shower once every two weeks. I have depression and a toddler and ADHD. It sucks, but I'm trying to be better about it",
      "created_utc": 1725584719.0,
      "score": 40
    },
    {
      "id": "llpjubd",
      "body": "And just as she did, you too will get out of this phase and thrive!",
      "created_utc": 1725578187.0,
      "score": 34
    },
    {
      "id": "llqg3tm",
      "body": " I just started to get better with showers too. I know I feel proud of myself and i hope you do too. It feels like a snowball effect and I don't want to think about it I just want to keep rolling. Good job and roll on 👍",
      "created_utc": 1725589878.0,
      "score": 16
    },
    {
      "id": "llqzbr3",
      "body": "You're doing a good job too hunnybunch 😊\n\nI'm not suffering with my depression anymore (it's still there but doesn't affect my life to the point of inertia) and I STILL struggle to get more than once a week! \n\nI don't know what's wrong with me! It's right there, I have plenty of time to do it, it doesn't even take that long but I just CAN'T SEEM TO DO IT 😑\n\nMaybe it became an ingrained habit, maybe I actually have ADHD, maybe it's the vulnerability of being naked, maybe something else I dunno?\n\nBut I try to focus on the things I AM doing and doing well like going to work every day, staying sober, feeling like I have worth and value.. showering more regularly seems less important than those things! \n\nOne day we will get there I know we can ❤️",
      "created_utc": 1725598197.0,
      "score": 4
    },
    {
      "id": "llqyyhb",
      "body": "this is where i am currently... sometimes ill be able to shower a bit more often but its just so exhausting to do the whole thing.. especially when i know my hair needs washed because its so long and takes absolutely forever to detangle and wash. \n\nive been trying antidepressants again since about april and think i have finally found one that is working for me🙏🏼 its only been about 3 weeks on this new medication but im already finally feeling a little better, i even notice small bouts of happiness occasionally and my self care has improved and my showers are becoming more frequent.. hopefully soon ill be able to do a good clean of my depression nest/apartment too\n\nim so proud of all of you who manage to shower at all, any little step forward is a huge accomplishment when it comes to depression. not many understand how deep this shit really goes",
      "created_utc": 1725598004.0,
      "score": 3
    },
    {
      "id": "llqbsnh",
      "body": "Awesome.  Bet you feel more than twice as good If you do it tomorrow too...",
      "created_utc": 1725588251.0,
      "score": 2
    },
    {
      "id": "llqghji",
      "body": "Also in this stage",
      "created_utc": 1725590026.0,
      "score": 2
    },
    {
      "id": "llrqhnx",
      "body": "Keep at it, it gets better.  \nWe're rooting for you<3",
      "created_utc": 1725615681.0,
      "score": 2
    },
    {
      "id": "llosh9j",
      "body": "this isn’t condescending at all, thank you so much <3 of course i’m not happy anyone else is dealing with this but it’s comforting to know that we’re not alone. i’m not super active on here but feel free to message me anytime too",
      "created_utc": 1725568970.0,
      "score": 485
    },
    {
      "id": "llqd16s",
      "body": "It’s so hard when you don’t have the energy to take basic care of yourself. Don’t call yourself gross. You have an illness, the same as if you had cancer and were too weak to bathe yourself. You do the best you can. I’ve always been a fanatic about grooming and cleanliness and depression wiped that part of me away for YEARS! I’m better new, but I’ll never forget that part of my illness, and have sympathy for anyone going through it.",
      "created_utc": 1725588715.0,
      "score": 57
    },
    {
      "id": "llof7ii",
      "body": "Thank you so much, I’ll do my best",
      "created_utc": 1725564838.0,
      "score": 285
    },
    {
      "id": "llqjauj",
      "body": "actual good comment",
      "created_utc": 1725591142.0,
      "score": 2
    },
    {
      "id": "llpu517",
      "body": "I am sorry about your Mom. I’ve had a year like that. Losing a parent and then 4 other horrific events in the span of 12 months. You should be proud of yourself for getting up and going to work. Not getting fired is a big achievement. Hopefully your life will calm down and you can heal.",
      "created_utc": 1725581918.0,
      "score": 13
    },
    {
      "id": "llqu7ev",
      "body": "Happy Cake Day!",
      "created_utc": 1725595689.0,
      "score": 3
    },
    {
      "id": "llup6h4",
      "body": "I’ve never thought of it that way before, thank you. I have this issue sometimes too and I feel ashamed or lazy.",
      "created_utc": 1725654747.0,
      "score": 2
    },
    {
      "id": "llq281a",
      "body": "You should try a rinseless soap! They are used in hospitals. Can be found on amazon. Maybe it will help:)\n\nI use it when I don't have the energy to shower.",
      "created_utc": 1725584801.0,
      "score": 2
    },
    {
      "id": "llox1ct",
      "body": "Oh my gosh I have PPD too! It’s the WORST. I hope you’re away from that partner now and I wish you luck with dealing with all of this. We’ll see if it takes me another 2 months to shower but for now I’m content with myself.\n\n(bot removed my old comment for calling ppd the b word :b)",
      "created_utc": 1725570375.0,
      "score": 2
    },
    {
      "id": "lloz2q4",
      "body": "I watched Shanspears videos “infiltrating the manosphere” I love her vids bc they’re striking visually but also nice to just listen to",
      "created_utc": 1725571026.0,
      "score": 4
    },
    {
      "id": "llp15w7",
      "body": "This made me tear up again, thank you so much. I’m just gonna keep trying, and I’ll make sure to hold onto this. I hope you have a wonderful day",
      "created_utc": 1725571701.0,
      "score": 4
    },
    {
      "id": "llqrqrl",
      "body": "I second this!!! I struggle with very severe depression as well and claw clips have been so incredibly helpful in keeping my hair less ratty since I switched over to them!",
      "created_utc": 1725594625.0,
      "score": 2
    },
    {
      "id": "llsd7al",
      "body": "I too have found the finch app helpful",
      "created_utc": 1725627192.0,
      "score": 2
    },
    {
      "id": "llqvz2d",
      "body": "In the throws of hardcore depression people can stop hygiene like showers and brushing teeth and hair, not washing dishes or clothes or cleaning at all, sleeping all the time or just not able to get out of bed even when awake, not being able to feed yourself like making/cooking food or even not being able to make yourself eat premade food (I try to keep easy things around for my really bad spells but it's hard enough to get out of bed down to the kitchen when I'm that bad off but even when I do there's times that the food is tasteless and near impossible to swallow) sometimes it's the opposite and you can't stop eating, and some of us even experience lowered immunity with actual sickness and physical aches/pain. It can be extremely debilitating beyond what some people see as just feeling sad or lazy or disinterested. It's devastating and crippling.",
      "created_utc": 1725596518.0,
      "score": 3
    },
    {
      "id": "llr66i9",
      "body": "I’m a girl! thank you so much",
      "created_utc": 1725602042.0,
      "score": 2
    },
    {
      "id": "llq08g8",
      "body": "I’m sliding into every 3 and it’s not fun. I feel absolutely rank, but I just cannot will myself in there. Using my good stuff before the rest of these scavengers do is good motivation. I need to get some supplies lol.",
      "created_utc": 1725584107.0,
      "score": 87
    },
    {
      "id": "lls9qwe",
      "body": "Excellent motivation! Looking for ways to motivate ourselves through tough times can be challenging and you've found a key here!",
      "created_utc": 1725625794.0,
      "score": 2
    },
    {
      "id": "llrswuq",
      "body": "You got this! I believe in you, friend. \n\nP.s. ignore the trolls",
      "created_utc": 1725617268.0,
      "score": 3
    },
    {
      "id": "llp5955",
      "body": "You did what I’m working towards… congratulations! 🎉🎊",
      "created_utc": 1725573044.0,
      "score": 85
    },
    {
      "id": "llpu03f",
      "body": "Hey friend, just so you know, you gave a boost to shower ❤️",
      "created_utc": 1725581869.0,
      "score": 49
    },
    {
      "id": "llpq8ys",
      "body": "Honestly seeing your post made me so happy because I also struggle with showering regularly due to my depression and I thought I was the only one 😭. I’m glad to see that I’m not",
      "created_utc": 1725580501.0,
      "score": 71
    },
    {
      "id": "llom9tj",
      "body": "There’s a sub for depression and loneliness. It may help you to join it. People on there are more understanding and won’t say things are disgusting etc. Congratulations on your accomplishment! You did so much in a short time! I’m proud of you!! Try to keep it up, even if you only do it every week or two weeks. Just know you are doing well and have come far.",
      "created_utc": 1725567041.0,
      "score": 86
    },
    {
      "id": "llonocb",
      "body": "You can do it. Just take a little step at a time.",
      "created_utc": 1725567475.0,
      "score": 19
    },
    {
      "id": "llohkcq",
      "body": "Showering can help with depression, it's wakes up the body and clears you head a bit. When you get into a mental rut force yourself into it at least every other day minimum. Taking a walk somewhere green also helps. Fresh air is stimulation, any activity sheds lethargy. GL.",
      "created_utc": 1725565577.0,
      "score": 74
    },
    {
      "id": "llpr4la",
      "body": "I'm proud of you!!\n\nI am in the process of pulling myself out of where you are. It's a day by day, hour by hour process. \n\nI'm moving to another state tomorrow and not even near ready, but hoping this change is what I need. \n\nYou got this!!",
      "created_utc": 1725580822.0,
      "score": 11
    },
    {
      "id": "lls4hm8",
      "body": "Thank you. I don’t know what I’d do if I ended up homeless though so I’m motivated not to find out. My mom was only 64 and threw me a good one. The rest of the events wouldn’t have been so significant but they were compounded by that. Sometimes I just can’t seem to catch a break but my motto has always been this too shall pass. Eventually everything will get boring again.",
      "created_utc": 1725623476.0,
      "score": 3
    },
    {
      "id": "lls3ij2",
      "body": "Thank you. I think you’re the first to wish me that. Some how I miss my cake day every year.",
      "created_utc": 1725623026.0,
      "score": 2
    },
    {
      "id": "lloy24f",
      "body": "Hahaha it is a B but yes I am far far away from that person I'm shining and thriving. And it definitely gets better you're already started with day one that was hard but you did it and you should definitely feel proud about it try again tomorrow see how it goes if not do not feel disappointed in yourself cuz you already took one step forward by even doing it at all and that is amazing I take it one day at a time with small goals",
      "created_utc": 1725570701.0,
      "score": 3
    },
    {
      "id": "llqw9pt",
      "body": "This is where I am. Laid off at 5months pregnant and stressed/depressed ever since. Rejection emails, shrinking pool of roles to apply, last rounds w/o offers - I’m around every 3-4 days. 😞",
      "created_utc": 1725596662.0,
      "score": 35
    },
    {
      "id": "llqwvhm",
      "body": "There are so many of us. 💛",
      "created_utc": 1725596955.0,
      "score": 16
    },
    {
      "id": "llrb8er",
      "body": "Same.",
      "created_utc": 1725605199.0,
      "score": 3
    },
    {
      "id": "lloksp0",
      "body": "knowing facts unfortunately does not help with depression though. \n\nalthough comments like this stems from care (which is always so appreciated) reminding someone of what they may already know sometimes makes that person feel worse.\n especially if they are logical and can see the sense in what is being said but cant translate that to action",
      "created_utc": 1725566580.0,
      "score": 104
    },
    {
      "id": "llq10f1",
      "body": "You make it sound so easy. You don’t understand depression, fortunately. If she could have, she would have. I’m sure she thought about how easy it’d be to just jump in the shower and I’m sure that made her even more depressed.",
      "created_utc": 1725584378.0,
      "score": 25
    },
    {
      "id": "llqwi1k",
      "body": "What I’m gathering is a long, hot shower fixes things, if not just temporarily lol. I’m gearing myself up for a shower in 9 hours…",
      "created_utc": 1725596773.0,
      "score": 30
    },
    {
      "id": "llpzqqd",
      "body": "When you are seriously depressed there is nothing anyone can suggest to make you feel better. You just gotta get the depression pjs ready when you feel better you will know. So today was your day! Best to you",
      "created_utc": 1725583935.0,
      "score": 21
    },
    {
      "id": "llrpb1y",
      "body": "I get it, but it wasn't \"suggested\" to shower. (Yk how ppl suggest ppl to go to a gym or change their diet, etc?)\n\nSo bc of the way this was very specifically worded, I took it only as informative.  Which, again, as you said, knowing facts doesn't necessarily do anything, however, having or knowing of tools (ie coping mechanisms) *can*.  Sometimes, it is helpful to know what our options are, should we want to have one! ♡",
      "created_utc": 1725614873.0,
      "score": 2
    },
    {
      "id": "llq3ev8",
      "body": "I didn't but you read it that way. Not at all what I said either. I have gone through it myself at one point, so did my Mom for many years. I learned how to help her and helped a few friends with their bouts. \n\nDon't make assumptions. I don't give advice when I haven't lived it or been very close to someone who has. \n\nOnline forums like this make it easy to criticize like you did, it's not helpful. What I did was offer a tool to help, which can work. The body responds to water and temporarily resets us, partly because we're mostly made *of* water. \n\nEncouragement or offering simple ideas nudge people along. They might consider it or think in a different way, sometimes that tiny shift is just enough to help, if only a little.",
      "created_utc": 1725585238.0,
      "score": 5
    },
    {
      "id": "llr8cs0",
      "body": "8 hours to go friend, you've got this!",
      "created_utc": 1725603376.0,
      "score": 17
    },
    {
      "id": "llrv736",
      "body": "🙌🏼 gonna do it! It’s early, but I need to wake up and I’m struggling…so I’m going to make myself riiiight now. And make coffee.\n\nE: Ty for the boost, first thing I saw when I logged on.",
      "created_utc": 1725618672.0,
      "score": 11
    },
    {
      "id": "llsa9ci",
      "body": "Must have been a sign;D",
      "created_utc": 1725626008.0,
      "score": 3
    },
    {
      "id": "llulhzj",
      "body": "How was your shower?  Rejuvenating I hope",
      "created_utc": 1725653558.0,
      "score": 3
    },
    {
      "id": "llurhax",
      "body": "It was! I actually shaved too. The water stayed super hot for like 40 minutes. I used a shower bomb lol. Thank you for asking!",
      "created_utc": 1725655493.0,
      "score": 3
    },
    {
      "id": "lluzbs4",
      "body": "That sounds amazing, I'm so chuffed for you ☺️",
      "created_utc": 1725658078.0,
      "score": 4
    }
  ]
}