{
  "id": "1jav233",
  "title": "My ex had a fucking great dick",
  "selftext": "I swear I'm having a harder time parting from his dick than him. Like great length, girthy but not dramatic, such a great time everytime. Shame it was connected to such a shitty manipulative person. That is all",
  "created_utc": 1741923975.0,
  "score": 5964,
  "num_comments": 545,
  "url": "https://www.reddit.com/r/offmychest/comments/1jav233/my_ex_had_a_fucking_great_dick/",
  "comments": [
    {
      "id": "mhp2dsy",
      "body": "Just because he is good for your hole doesn’t mean he is good for your soul 🥲",
      "created_utc": 1741926335.0,
      "score": 12164
    },
    {
      "id": "mhpdpc7",
      "body": "I think so so so many toxic relationships continue because of this. Trust me, you can have good dick that treats you well too!",
      "created_utc": 1741932186.0,
      "score": 1590
    },
    {
      "id": "mhqj6h8",
      "body": "Great guys with bad dicks are crying reading this.",
      "created_utc": 1741955283.0,
      "score": 494
    },
    {
      "id": "mhp9rma",
      "body": "Had a few girlfriends with nice racks and dick sucking abilities.  You gotta weigh the talents and the endowments with the asshole and crazy.",
      "created_utc": 1741929986.0,
      "score": 1218
    },
    {
      "id": "mhp9rpm",
      "body": "Dickmatized",
      "created_utc": 1741929987.0,
      "score": 392
    },
    {
      "id": "mhp3x4w",
      "body": "Great sex does not a great partner make. \n\nSadly",
      "created_utc": 1741927044.0,
      "score": 612
    },
    {
      "id": "mhp4nru",
      "body": "Thanks for making me more lonely",
      "created_utc": 1741927400.0,
      "score": 345
    },
    {
      "id": "mhpoyq2",
      "body": "They’re always connected to a shitty manipulative person it seems",
      "created_utc": 1741938988.0,
      "score": 86
    },
    {
      "id": "mhoyg8q",
      "body": "Oh. My. God. THIS. \n\nI miss his dick. And his hands. The only thing we ever did right was fuck 🤣🤣🤣",
      "created_utc": 1741924611.0,
      "score": 649
    },
    {
      "id": "mhplwnj",
      "body": "Had? He probably still has it, go get it and take it home. Leave him where he is, bring a sharp knife.",
      "created_utc": 1741937098.0,
      "score": 150
    },
    {
      "id": "mhp4qxh",
      "body": "Hope this is my ex",
      "created_utc": 1741927442.0,
      "score": 174
    },
    {
      "id": "mhq2qvh",
      "body": "My ex had the nicest tits, tanned skinny body, blonde hair with blue eyes but she was a fucking wreck. Almost burned down my apartment, police raided my place a couple of times, her friends stole from me, she was a true wild child.",
      "created_utc": 1741947529.0,
      "score": 36
    },
    {
      "id": "mhqp0wu",
      "body": "As a man, I feel like I’ve just walked in to a group women’s therapy session. Reading through these comments holy fuck.. I was always very confident will all my partners, very generous and giving. I hope they think of me the way some of you think about your exs past partners.. kinda terrifying as well..",
      "created_utc": 1741957467.0,
      "score": 37
    },
    {
      "id": "mhpbmsa",
      "body": "Thank you for saying this out loud I feel heard and seen cause same 👌🏽😭",
      "created_utc": 1741931010.0,
      "score": 70
    },
    {
      "id": "mhqdkmu",
      "body": "I understand. I too knew the perfect dick. \n\n\nHe is happily married now and moved to my neighborhood. When I run into perfect dick I think about his great dick and how lucky his wife is.\n\n\nI mourn Perfect Dick.",
      "created_utc": 1741952944.0,
      "score": 85
    },
    {
      "id": "mhp8xxl",
      "body": "rip to her new man",
      "created_utc": 1741929549.0,
      "score": 191
    },
    {
      "id": "mhqd2rt",
      "body": "[deleted]",
      "created_utc": 1741952722.0,
      "score": 26
    },
    {
      "id": "mhswknd",
      "body": "Listen sis - I call that \"heroin dick\" cause the withdrawals are brutal. You got this!",
      "created_utc": 1741981547.0,
      "score": 26
    },
    {
      "id": "mhpgu3k",
      "body": "I feel the same about my ex and his big dick. And we have been broken up for 8 years. No other man has been as good as him and it's so annoying. We hooked up recently and it's even better than it was 8 years ago... still  a shit man though.",
      "created_utc": 1741934049.0,
      "score": 87
    },
    {
      "id": "mhpe5vd",
      "body": "\"I swear I'm having a harder time parting from his dick than him.\"\n\nYou didn't Bobbitt the guy, did you?",
      "created_utc": 1741932455.0,
      "score": 44
    },
    {
      "id": "mhppsgg",
      "body": "I feel this so hard. 😩 BUT. Let me tell you. There’s a guy out there with an amazing soul AND dick just for you. Gotta swerve on these ones. They only bring heartache.",
      "created_utc": 1741939506.0,
      "score": 22
    },
    {
      "id": "mhoxpzy",
      "body": "Oh, thanks for sharing… ig😭",
      "created_utc": 1741924300.0,
      "score": 163
    },
    {
      "id": "mhp2b5o",
      "body": "yaaa… there’s always that one special dick that pushes all the buttons… Mine was with a fuck buddy… 8 inches of perfect cock… perfect amount of curvature… and he had a 2 gauge PA… Getting fucked with that dick plus the PA rocked my world like no other dick had… But then he got a boyfriend and I lost contact ;_;\n\nsorry to hear that your favorite dick ran away with a dickhead  :<",
      "created_utc": 1741926302.0,
      "score": 97
    },
    {
      "id": "mhqp2pn",
      "body": "SAME. SAME. SAME. we should create a separate help group for this.",
      "created_utc": 1741957485.0,
      "score": 17
    },
    {
      "id": "mhoyp5x",
      "body": "Oh! Just saw this title while scrolling was just a little bit shocked",
      "created_utc": 1741924716.0,
      "score": 63
    },
    {
      "id": "mhpdeav",
      "body": "This is so real, some of the sex I've had absolutely haunts me",
      "created_utc": 1741932011.0,
      "score": 59
    },
    {
      "id": "mhp7erp",
      "body": "The dick and the asshole are a package deal",
      "created_utc": 1741928759.0,
      "score": 46
    },
    {
      "id": "mhpixyt",
      "body": "I know the feeling. When i wanted to break up with my ex he used his dick and sex to make me change my mind.",
      "created_utc": 1741935320.0,
      "score": 15
    },
    {
      "id": "mhpay4o",
      "body": "Hence the shitty personality, the F*cker knows what's he's got!\n\n😁",
      "created_utc": 1741930629.0,
      "score": 31
    },
    {
      "id": "mhqflxe",
      "body": "hoooooo boy do I feel this .. not in my vajizzle where I need to, though.",
      "created_utc": 1741953835.0,
      "score": 13
    },
    {
      "id": "mhsrxzf",
      "body": "Narcisssits be having some great dick unfortunately",
      "created_utc": 1741980167.0,
      "score": 14
    },
    {
      "id": "mhpapc0",
      "body": "You’ll get over it when you fall in love again.",
      "created_utc": 1741930495.0,
      "score": 39
    },
    {
      "id": "mhpa8wl",
      "body": "its the opposite for me. my current one has the greatest dick and a lot of stamina but my ex meh.",
      "created_utc": 1741930244.0,
      "score": 26
    },
    {
      "id": "mhpqcrc",
      "body": "On God same, the only time we spent together was in the bedroom near the end. Man’s had a monster dick but not too monstrous, literally haven’t nutted as many times or as hard since we broke up. I don’t miss him just his dick and his endurance ngl.",
      "created_utc": 1741939858.0,
      "score": 27
    },
    {
      "id": "mhq4h96",
      "body": "That always sucks it is so much easier to move on if the sex was horrible",
      "created_utc": 1741948484.0,
      "score": 26
    },
    {
      "id": "mhpjn8z",
      "body": "Same. Just grateful for the time together with his dick.",
      "created_utc": 1741935734.0,
      "score": 10
    },
    {
      "id": "mhp6lxl",
      "body": "I have had a lot of nice dicks... but there is one that is implanted into my brain. And he was a really good dude... but his dick was porn worthy. I wish I could have been ready for a relationship...",
      "created_utc": 1741928354.0,
      "score": 36
    },
    {
      "id": "mhpe5pj",
      "body": "Jenny?",
      "created_utc": 1741932452.0,
      "score": 19
    },
    {
      "id": "mhpobsv",
      "body": "Devil dick",
      "created_utc": 1741938591.0,
      "score": 18
    },
    {
      "id": "mhpsvn7",
      "body": "There was a quote from the show Girls (okay, problematic I know) that you might resonate with “good dick is a prison”",
      "created_utc": 1741941483.0,
      "score": 9
    },
    {
      "id": "mhr1251",
      "body": "My mom told me to never fall in love with the sex. Unfortunately by that time, I was too far gone lol",
      "created_utc": 1741961503.0,
      "score": 10
    },
    {
      "id": "mhsr3f4",
      "body": "toxic dick is the best one sadly :( i feel u",
      "created_utc": 1741979915.0,
      "score": 9
    },
    {
      "id": "mhsw6qt",
      "body": "I feel the same way about my ex, she was everything I wanted sexually speaking. But god, what an awful human being",
      "created_utc": 1741981432.0,
      "score": 8
    },
    {
      "id": "mhpf5pl",
      "body": "i’m in the exact same boat as u OP….\n\nexcept i’m a man and i miss her kitty 😔",
      "created_utc": 1741933045.0,
      "score": 25
    },
    {
      "id": "mhq25as",
      "body": "Girl same 😭 he was a literal sociopath but the sex was out of this world. I would cum multiple times every single time we had sex.",
      "created_utc": 1741947189.0,
      "score": 22
    },
    {
      "id": "mhq32md",
      "body": "When reddit tell you size doesnt matter show em this thread",
      "created_utc": 1741947707.0,
      "score": 48
    },
    {
      "id": "mhpsrvl",
      "body": "The best dick is always closely aligned with the devil. I feel you!!",
      "created_utc": 1741941413.0,
      "score": 14
    },
    {
      "id": "mhq1le3",
      "body": "Had? Did you cut it off?",
      "created_utc": 1741946877.0,
      "score": 8
    },
    {
      "id": "mhqn3nc",
      "body": "I feel this in my soul. I love dick but in most cases it's not really worth the trouble of dealing with the man it's attached to.",
      "created_utc": 1741956772.0,
      "score": 7
    },
    {
      "id": "mhs73s5",
      "body": "Just don’t tell any dude you get with this 😭",
      "created_utc": 1741973758.0,
      "score": 7
    },
    {
      "id": "mhsuhag",
      "body": "i’m imagining someone saying “oh my god i miss his dick so much. why. WHY” cus.. i did that..",
      "created_utc": 1741980923.0,
      "score": 6
    },
    {
      "id": "mhthoei",
      "body": "Recently got back in contact with an Ex after a long time and she told me that when she was talking to another guy after me, he asked if she missed me. And her response was: “I don’t miss him. Just his dick.” Yeahhhhh….. we don’t talk anymore. Not only is that insane to say to a guy you’re talking to, but also, it was weird how she thought i’d see that as a compliment? It was more insulting than anything else. Like wow, thanks, glad that’s what you miss. Lmao",
      "created_utc": 1741987681.0,
      "score": 7
    },
    {
      "id": "mhppo9b",
      "body": "I feel this. \nI had amazing sex with my last partner. He knew exactly what worked for me and made me feel amazing anytime we fucked. \nHe was a good person to me until he wasn’t and I have a hard time convincing myself he wasn’t a real man towards me. \nBut amazing dick. He had everything I needed down there.",
      "created_utc": 1741939432.0,
      "score": 12
    },
    {
      "id": "mhrpv53",
      "body": "No shame! I’ve had separation regrets over this before too. Too bad you have to buy the whole pig just to get the one premium slice of bacon.",
      "created_utc": 1741968819.0,
      "score": 7
    },
    {
      "id": "mhs3j4b",
      "body": "Yep, being dickmatized is a thing.",
      "created_utc": 1741972738.0,
      "score": 6
    },
    {
      "id": "mhv36xf",
      "body": "Sucks my dick is too small and idk if I’ll ever have the satisfaction of dicking someone down that another guy does",
      "created_utc": 1742007479.0,
      "score": 6
    },
    {
      "id": "mhq1gfy",
      "body": "Sometimes past lovers are better lovers. Some boyfriends are better people. I mourn the good people than the good dick.",
      "created_utc": 1741946800.0,
      "score": 12
    },
    {
      "id": "mhp2wzx",
      "body": "im literally going through the same thing 😭",
      "created_utc": 1741926580.0,
      "score": 21
    },
    {
      "id": "mhpbcv5",
      "body": "Just find a guy with an ever bigger one",
      "created_utc": 1741930856.0,
      "score": 14
    },
    {
      "id": "mhqlut9",
      "body": "This my wife divorcing me in the future ha",
      "created_utc": 1741956312.0,
      "score": 4
    },
    {
      "id": "mhrfh7l",
      "body": "I can't get over mine's either.  We fight, we fuck. We fight and fuck some more. haha",
      "created_utc": 1741965822.0,
      "score": 5
    },
    {
      "id": "mhsd29a",
      "body": "Sounds like my ex. God I miss that penis sometimes.",
      "created_utc": 1741975507.0,
      "score": 5
    },
    {
      "id": "mhsta95",
      "body": "I feel seen",
      "created_utc": 1741980567.0,
      "score": 5
    },
    {
      "id": "mhtukmx",
      "body": "I can't lie to you this is me for the last 4 years wahhh\n\ndon't think about that glorious dick babe youuuuu cannn do it!!!!!!",
      "created_utc": 1741991843.0,
      "score": 6
    },
    {
      "id": "mhpi6tp",
      "body": "They make toys in whatever size and shape you want.",
      "created_utc": 1741934868.0,
      "score": 8
    },
    {
      "id": "mhqbxh2",
      "body": "I have an ex like this.\n\nShitty person, really good at sex. Great dick.\n\nIt’s just not worth it.",
      "created_utc": 1741952206.0,
      "score": 5
    },
    {
      "id": "mhqlgr2",
      "body": "Life is often filled with *hard* trade offs. \n\nWell. Hoping you find love with a non-shitty person who can fulfill you sexually as well.",
      "created_utc": 1741956167.0,
      "score": 5
    },
    {
      "id": "mhqn3ra",
      "body": "I get it, my ex was amazing in bed in every way.  She's manipulative and a hardcore gold digger though so I couldn't stay with her. \n\nYou'll find another man that fufills your sexual and relationship desires though.  I did and I couldn't be happier!  It just take time and work on your part.  Do everything you can to get over him and be comfortable alone.  Then meeting the right guy will happen.\nHugs and good luck! 💜",
      "created_utc": 1741956773.0,
      "score": 4
    },
    {
      "id": "mhqx1y7",
      "body": "I used to think that way about my ex, my new partner does things for me that he never could or would, both in bed and in other areas of my life, so you'll get over that toxic dick soon girl",
      "created_utc": 1741960223.0,
      "score": 5
    },
    {
      "id": "mhryrip",
      "body": "it gets easier once you find better d!ck, you got this! ",
      "created_utc": 1741971375.0,
      "score": 4
    },
    {
      "id": "mhs4p2v",
      "body": "These comments have me WHEEZING. I'm so blessed that my current fwb is both good and with an amazing D",
      "created_utc": 1741973071.0,
      "score": 4
    },
    {
      "id": "mhu9plt",
      "body": "[deleted]",
      "created_utc": 1741996914.0,
      "score": 5
    },
    {
      "id": "mhuotam",
      "body": "Yes, but imagine how great the sex will be when you’re with someone who loves and adores you",
      "created_utc": 1742002164.0,
      "score": 4
    },
    {
      "id": "mhw2jma",
      "body": "had to check the post history just to make sure you weren't actually *my* ex 😎🤣",
      "created_utc": 1742026221.0,
      "score": 4
    },
    {
      "id": "mhpbhtu",
      "body": "Please give approximate dimensions of said god dick. For those who want to see how they measure up.",
      "created_utc": 1741930933.0,
      "score": 9
    },
    {
      "id": "mhq6rci",
      "body": "The biggest sex organ lies between the ears. You loved the dick because there was something about the circumstances and/or personality that enabled you to let inhibitions go.",
      "created_utc": 1741949686.0,
      "score": 10
    },
    {
      "id": "mhpylfj",
      "body": "Most out of pocket shit I didn't expect to read today",
      "created_utc": 1741945118.0,
      "score": 6
    },
    {
      "id": "mhpnh48",
      "body": "Felt this",
      "created_utc": 1741938058.0,
      "score": 3
    },
    {
      "id": "mhrfd7n",
      "body": "Good dick is usually attached to crazy",
      "created_utc": 1741965789.0,
      "score": 3
    },
    {
      "id": "mhrnbxx",
      "body": "Get one of those clone-a-Willy kits and make a mold of it? 😅😅",
      "created_utc": 1741968084.0,
      "score": 3
    },
    {
      "id": "mhrvccw",
      "body": "Imagine being with him just because of his dick 💀",
      "created_utc": 1741970397.0,
      "score": 3
    },
    {
      "id": "mhsfrn8",
      "body": "Separate it from his body and just take it home",
      "created_utc": 1741976452.0,
      "score": 3
    },
    {
      "id": "mhtkh5s",
      "body": "Omg, that's soooooo my ex!",
      "created_utc": 1741988563.0,
      "score": 3
    },
    {
      "id": "mhtpx40",
      "body": "Felt this one deep. Why do the shitty guys always have to be so good in bed 😩",
      "created_utc": 1741990310.0,
      "score": 3
    },
    {
      "id": "mhudwyo",
      "body": "Never heard of \"clone-a-willy\"?? I made my ex one, pretty sure she still had it. Probably uses it when her new guy isn't around 🤣🤣🤣",
      "created_utc": 1741998340.0,
      "score": 3
    },
    {
      "id": "mhvu9vi",
      "body": "Your poor future boyfriend 😆",
      "created_utc": 1742020881.0,
      "score": 3
    },
    {
      "id": "mhq2ahk",
      "body": "304",
      "created_utc": 1741947272.0,
      "score": 4
    },
    {
      "id": "mhpxda1",
      "body": "Alpha widowed next guy doesn't  stand a chance",
      "created_utc": 1741944358.0,
      "score": 7
    },
    {
      "id": "mhr5g6s",
      "body": "My god! Please take sufficient time before dating another man again and save him from trauma.",
      "created_utc": 1741962855.0,
      "score": 6
    },
    {
      "id": "mhqi1yl",
      "body": "honestly dicks aren't Sustainable.",
      "created_utc": 1741954840.0,
      "score": 2
    },
    {
      "id": "mhqjh1h",
      "body": "Just use a clone-a-willy next time you meet up and them part ways forever. Just keep it hidden from your next relationship.",
      "created_utc": 1741955398.0,
      "score": 2
    },
    {
      "id": "mhqnp7f",
      "body": "Hey you deserve a dick that isn’t attached to a shitty manipulative human. Your body is sacred, you are sacred. No time for a shitty partner. Remember you’re a person of excellence. You’ll find a better human and a better dick. I promise you that.",
      "created_utc": 1741956989.0,
      "score": 2
    },
    {
      "id": "mhqqgru",
      "body": "Why does it seem like the ones that can pleasure us sexually are dicks in most other aspects?",
      "created_utc": 1741957979.0,
      "score": 2
    },
    {
      "id": "mhqs54q",
      "body": "should've cloned that willy fr lol (like no actually you can do that)",
      "created_utc": 1741958564.0,
      "score": 2
    },
    {
      "id": "mhqsr4h",
      "body": "Judge him based off of how much is left after you theoretically want to literally cut off, not how much he actually has.",
      "created_utc": 1741958775.0,
      "score": 2
    },
    {
      "id": "mhqxn7w",
      "body": "I think he would have a harder time parting from his Ween.",
      "created_utc": 1741960414.0,
      "score": 2
    },
    {
      "id": "mhqxodh",
      "body": "As a former big D ex we appreciate the remembrance",
      "created_utc": 1741960425.0,
      "score": 2
    },
    {
      "id": "mhqzppn",
      "body": "I feel this so hard! I mourned one of my ended relationship because I loved his dick XD",
      "created_utc": 1741961080.0,
      "score": 2
    },
    {
      "id": "mhqzrl5",
      "body": "real",
      "created_utc": 1741961097.0,
      "score": 2
    },
    {
      "id": "mhr0qe0",
      "body": "Sounds like my ex. Sorry babe",
      "created_utc": 1741961401.0,
      "score": 2
    },
    {
      "id": "mhr2rhc",
      "body": "honestly though! 😭",
      "created_utc": 1741962035.0,
      "score": 2
    },
    {
      "id": "mhr5bem",
      "body": "Mine too. Now guys say, am I too small? And I’m like no! You’re great!\n(But my ex was way bigger than you). He was just terrible in and out of bed.",
      "created_utc": 1741962814.0,
      "score": 2
    },
    {
      "id": "mhra7r4",
      "body": "I'm that ex",
      "created_utc": 1741964272.0,
      "score": 2
    },
    {
      "id": "mhrgkrc",
      "body": "I know your pain. Stay strong sis 😭",
      "created_utc": 1741966137.0,
      "score": 2
    },
    {
      "id": "mhri4eo",
      "body": "Best sex I’ve ever had was with the worst person I’ve ever met purely for that reason. I feel like I’m going to expect any good sex to mean the dude is a shitty person because of him.",
      "created_utc": 1741966590.0,
      "score": 2
    },
    {
      "id": "mhri74g",
      "body": "I feel this .\n\n it makes me sad whenever I get a passing thought of how my ex now  fucks other people with his dick. it was really nice, the perfect size , a great fucking size.  a size most people don't have \n\nI wish I would've got a mold of it or something. 😭",
      "created_utc": 1741966612.0,
      "score": 2
    },
    {
      "id": "mhrj682",
      "body": "Ugh. Preach.",
      "created_utc": 1741966894.0,
      "score": 2
    },
    {
      "id": "mhrkc2f",
      "body": "Ugh me too. I miss the sex so much. No one else compares 😭",
      "created_utc": 1741967227.0,
      "score": 2
    },
    {
      "id": "mhrlurk",
      "body": "no dick is that good imo…",
      "created_utc": 1741967663.0,
      "score": 2
    },
    {
      "id": "mhsbfsv",
      "body": "One of the reasons I am staying with my husband. He is amazing in bed and has a lot of stamina. Personality wise, meh.",
      "created_utc": 1741974998.0,
      "score": 2
    },
    {
      "id": "mhsobca",
      "body": "make a mold of your dream peen, and enjoy it for all eternity.",
      "created_utc": 1741979086.0,
      "score": 2
    },
    {
      "id": "mht7oac",
      "body": "Find a new great dick",
      "created_utc": 1741984832.0,
      "score": 2
    },
    {
      "id": "mhtn7sf",
      "body": "Ask to do a clone a Willy kit 🤪🙈🙃",
      "created_utc": 1741989431.0,
      "score": 2
    },
    {
      "id": "mhty6g3",
      "body": "Real. Only good thing me and my ex had going for us was our sex life 😔",
      "created_utc": 1741993040.0,
      "score": 2
    },
    {
      "id": "mhty8be",
      "body": "You're so real for this. I'm glad you were strong enough to make the right choice. May even better dicks attached to decent people come your way.",
      "created_utc": 1741993057.0,
      "score": 2
    },
    {
      "id": "mhukntt",
      "body": "Same.",
      "created_utc": 1742000682.0,
      "score": 2
    },
    {
      "id": "mhuodtz",
      "body": "Ugh i feel this on another level. I never think about him, only his beautiful dick",
      "created_utc": 1742002014.0,
      "score": 2
    },
    {
      "id": "mhuyx5g",
      "body": "Why are toxic people so well endowed?!?!!",
      "created_utc": 1742005841.0,
      "score": 2
    },
    {
      "id": "mhva4qh",
      "body": "I gotta make sure I don't become an ex cause damn I don't have this  \"great\" pp",
      "created_utc": 1742010420.0,
      "score": 2
    },
    {
      "id": "mhvi9qi",
      "body": "They say that when your partner isn’t emotionally available when you are physically intimate it’s heightened because that’s the only way you can really be together. This is why when you have a fuck boy/girl the sex feels amazing and that’s it.",
      "created_utc": 1742014214.0,
      "score": 2
    },
    {
      "id": "mhvm67d",
      "body": "I'm still struggling with this and it's been literal YEARS 😞",
      "created_utc": 1742016229.0,
      "score": 2
    },
    {
      "id": "mhw1p58",
      "body": "Girl i feel you. I liked this terrible guy but beautiful and still do! He’s exactly my type but he is terrible! And his dick was beautiful too.. 😞 fucckkk",
      "created_utc": 1742025659.0,
      "score": 2
    },
    {
      "id": "mhw75bn",
      "body": "ik this feel diva . rip",
      "created_utc": 1742029307.0,
      "score": 2
    },
    {
      "id": "mhwb484",
      "body": "I’m a lesbian and I swear my ex was insanely good with her fingers but unfortunately she was absolutely insane",
      "created_utc": 1742031918.0,
      "score": 2
    },
    {
      "id": "mhx9mr8",
      "body": "That's actually my problem, I love big penises. Unfortunately they're usually attached to some of the worst people.",
      "created_utc": 1742048317.0,
      "score": 2
    },
    {
      "id": "mhytn52",
      "body": "Damn, that's deep.",
      "created_utc": 1742065937.0,
      "score": 2
    },
    {
      "id": "mhz8ah1",
      "body": "Been there twice.",
      "created_utc": 1742070595.0,
      "score": 2
    },
    {
      "id": "mia6zf1",
      "body": "Just more proof size matters and women be capping",
      "created_utc": 1742228940.0,
      "score": 2
    },
    {
      "id": "mia7f4u",
      "body": "How big was it? Asking to see if i can feel good about mine.",
      "created_utc": 1742229065.0,
      "score": 2
    },
    {
      "id": "mii1vj2",
      "body": "oh man, all these comments. i hate my body so fucking much.",
      "created_utc": 1742329945.0,
      "score": 2
    },
    {
      "id": "miqzibm",
      "body": "And then we will get told it dont matter",
      "created_utc": 1742447525.0,
      "score": 2
    },
    {
      "id": "mivsxfx",
      "body": "Imagine being OPs next boyfriend lmao",
      "created_utc": 1742512449.0,
      "score": 2
    },
    {
      "id": "miyacxy",
      "body": "As a not hung guy this post is suicide fuel",
      "created_utc": 1742553781.0,
      "score": 2
    },
    {
      "id": "mhr9427",
      "body": "Mine too. Beautiful, girthy, 8 inches. Straight as an arrow. Loved that dick. Loved that man. I'll always love him",
      "created_utc": 1741963951.0,
      "score": 4
    },
    {
      "id": "mhoxwci",
      "body": "🤣🤣🤣🤣",
      "created_utc": 1741924374.0,
      "score": 4
    },
    {
      "id": "mhq07vw",
      "body": "My ex said that to me, except of the part with a \"shitty manipulative person\"",
      "created_utc": 1741946080.0,
      "score": 2
    },
    {
      "id": "mhrjhiw",
      "body": "My ex friend stayed with her shitty ex for such a long time because he had a fantastic dick. She immediately got with a guy after that who is noticeably below average on dick endowment but according to her amazing in bed despite that (proof size doesn’t matter) and he was a great dude and treated her amazing from what she said. She kinda became a horrid person tho after her ex and she started hanging out with terrible people so I cut her off but unrelated to that it is proof that the right dude who treats you great will make whatever dick he has work for him. It got to the point that I would have to wear head phones at night and my room was across the house from their room (we lived together) so clearly they were having a great time. \n\nSo keep your head up and look for a great guy. The dick ain’t worth it. And you don’t wanna end up like my friend and lose all your friends because you let some asshole turn you into an asshole. Or maybe she was always an asshole and I only clocked it once we lived together it’s hard to say. But either way basically everyone’s cut her off last I heard. Either way the dick is never worth it.",
      "created_utc": 1741966984.0,
      "score": 2
    },
    {
      "id": "mhxuscn",
      "body": "Posts like these are what give me extreme insecurities of my penis never being good enough for women lol. They'll just always be craving that one penis they had before compared to mine...",
      "created_utc": 1742055146.0,
      "score": 2
    },
    {
      "id": "mhplonn",
      "body": "I need the dimensions to judge tbh",
      "created_utc": 1741936963.0,
      "score": 3
    },
    {
      "id": "mhpyip8",
      "body": "Luckily sex isn’t the only thing you look for in another person",
      "created_utc": 1741945073.0,
      "score": 2
    },
    {
      "id": "mhqjsg9",
      "body": "Right? It's annoying when you have them well trained, have to go through the whole process again x.x bahh. But trust, it's worth it cause once you find someone with dick game AND the respect for you as a person 👌🏻👌🏻👌🏻",
      "created_utc": 1741955524.0,
      "score": 2
    },
    {
      "id": "mhphjrn",
      "body": "Dick sand is so real",
      "created_utc": 1741934483.0,
      "score": 1
    },
    {
      "id": "mhpkykl",
      "body": "[removed]",
      "created_utc": 1741936523.0,
      "score": 1
    },
    {
      "id": "mhq49vm",
      "body": "Mia?",
      "created_utc": 1741948371.0,
      "score": 1
    },
    {
      "id": "mhqhzhv",
      "body": "Ugh so relatable bestie. I feel for you",
      "created_utc": 1741954812.0,
      "score": 1
    },
    {
      "id": "mhqmft6",
      "body": "I always joke with my bf that if we ever break up I will miss his dick more than him 😵‍💫😅",
      "created_utc": 1741956529.0,
      "score": 1
    },
    {
      "id": "mhqp7ne",
      "body": "Hotdamn... Hope you'll meet a better Dick out there",
      "created_utc": 1741957535.0,
      "score": 1
    },
    {
      "id": "mhqsa7w",
      "body": "Same! I miss the dick, the sexual experiences and what he did to my mind with sexual experiences. Everything else, meh 😑",
      "created_utc": 1741958613.0,
      "score": 1
    },
    {
      "id": "mhqshjk",
      "body": "I personally understand your dilemma because same. I wish you luck on finding another perfect one...this time attached to a good one. 😂 Trust me, they're out there.",
      "created_utc": 1741958683.0,
      "score": 1
    },
    {
      "id": "mhqt4lh",
      "body": "Can we see it? 😂",
      "created_utc": 1741958904.0,
      "score": 1
    },
    {
      "id": "mhqt92r",
      "body": "I don’t like my ex at all as a person but Goddamn she could suck the thoughts out of you 🥵",
      "created_utc": 1741958946.0,
      "score": 1
    },
    {
      "id": "mhqytx1",
      "body": "Is there any posts from this sub that are not sexual from a female minor?",
      "created_utc": 1741960799.0,
      "score": 1
    },
    {
      "id": "mhr0z99",
      "body": "Been through this myself. Made me so sad. He was amazing in bed yet the most toxic man anywhere else. Years later have found the right mix 🤞🏼 stays that way",
      "created_utc": 1741961478.0,
      "score": 1
    },
    {
      "id": "mhrbyr5",
      "body": "RIP your DM.",
      "created_utc": 1741964795.0,
      "score": 1
    },
    {
      "id": "mhrc3mz",
      "body": "Hunt him down and persevere it in a thin layer of resin",
      "created_utc": 1741964836.0,
      "score": 1
    },
    {
      "id": "mhrcxyl",
      "body": "Girly just buy yourself a decent toy to use and move on, dont lower your standards and make yourself look like a fool over some good dick, it's not ever going to be worth it in the long run",
      "created_utc": 1741965085.0,
      "score": 1
    },
    {
      "id": "mhrdxcb",
      "body": "Should've manipulated him back for his dick mold lol.",
      "created_utc": 1741965373.0,
      "score": 1
    },
    {
      "id": "mhrid3r",
      "body": "I still miss my ex's D sometimes. It was perfect. It's been 12 years 😂😂😂",
      "created_utc": 1741966660.0,
      "score": 1
    },
    {
      "id": "mhrmman",
      "body": "Felt. My ex had girth, length and satisfied me I will miss Eduardo everyday😢",
      "created_utc": 1741967880.0,
      "score": 1
    },
    {
      "id": "mhrw4n1",
      "body": "There are special sets to turn great dicks into great toys...",
      "created_utc": 1741970624.0,
      "score": 1
    },
    {
      "id": "mhs227j",
      "body": "Sometimes things fit perfectly but you have to deal with a mountain of shit to make it happen, the thing is you can meet someone else who is even better who blows your mind, body and soul, you should not settle and explore you might be pleasantly surprised",
      "created_utc": 1741972319.0,
      "score": 1
    },
    {
      "id": "mhsim5h",
      "body": "Ask if you can make a mould of it for personal reasons?",
      "created_utc": 1741977376.0,
      "score": 1
    },
    {
      "id": "mht7ab8",
      "body": "Cut his off, then",
      "created_utc": 1741984717.0,
      "score": 1
    },
    {
      "id": "mhtc2ll",
      "body": "Babe?",
      "created_utc": 1741986135.0,
      "score": 1
    },
    {
      "id": "mhthsev",
      "body": "Girls use me like dildo... so the vice versa also exists",
      "created_utc": 1741987716.0,
      "score": 1
    },
    {
      "id": "mhtk2mc",
      "body": "Good dick doesn’t mean you should suffer In a shitty relationship. I’m sure there’s more great schlongs out there.",
      "created_utc": 1741988435.0,
      "score": 1
    },
    {
      "id": "mhtnyn0",
      "body": "Thousands of men opening this thread because, ofc, we’re aware of how well we did in the shagging with that one ex and want to check if OP is her.\n\nEdit: Wrote this after reading only the title. Sorry OP that your ex was shitty and manipulative.",
      "created_utc": 1741989671.0,
      "score": 1
    },
    {
      "id": "mhtsj0z",
      "body": "Holes can get filled in many ways.  Give him a spade for his birthday.",
      "created_utc": 1741991161.0,
      "score": 1
    },
    {
      "id": "mhu0m4w",
      "body": "Every ex I’ve had has left me missing some part of their body: it could be their smile, their ass, their lips, or their breasts.",
      "created_utc": 1741993857.0,
      "score": 1
    },
    {
      "id": "mhu19dm",
      "body": "same sis\nBut he's also a good person so that's even harder",
      "created_utc": 1741994074.0,
      "score": 1
    },
    {
      "id": "mhu64mk",
      "body": "Steal its shape and mold it fr",
      "created_utc": 1741995706.0,
      "score": 1
    },
    {
      "id": "mhuxz6r",
      "body": "Same! It was so hard to leave that haha",
      "created_utc": 1742005488.0,
      "score": 1
    },
    {
      "id": "mhvk443",
      "body": "I felt this lol",
      "created_utc": 1742015160.0,
      "score": 1
    },
    {
      "id": "mhvl9m8",
      "body": "I feel you. Me too. So many of them that I wonder if I was just blessed or if I was picking guys more for their dicks without realizing it.",
      "created_utc": 1742015768.0,
      "score": 1
    },
    {
      "id": "mhvls6f",
      "body": "So where can I find a good one to sit on",
      "created_utc": 1742016033.0,
      "score": 1
    },
    {
      "id": "mhvwmy2",
      "body": "Ugh...same. my ex was fine on all levels though, just not together anymore.",
      "created_utc": 1742022372.0,
      "score": 1
    },
    {
      "id": "mhwlpi2",
      "body": "This makes me miss you ex with his great dick 😩",
      "created_utc": 1742038203.0,
      "score": 1
    },
    {
      "id": "mhzomh3",
      "body": "Some of us are big, can use it and are good people.",
      "created_utc": 1742075997.0,
      "score": 1
    },
    {
      "id": "mi0ngal",
      "body": "Get a mold kit.",
      "created_utc": 1742088296.0,
      "score": 1
    },
    {
      "id": "mid551a",
      "body": "My ex says the same thing. I used to think she was lying but hey it is what it is 😎",
      "created_utc": 1742261199.0,
      "score": 1
    },
    {
      "id": "mii7zrc",
      "body": "My boyfriend has the perfect dick. It honestly scares me that I have to break up with him soon and I may never find that again. Maybe having a great dick makes a man coast in life and not treat you well. I don’t know. I’ll miss it ",
      "created_utc": 1742331679.0,
      "score": 1
    },
    {
      "id": "mik52aq",
      "body": "Real",
      "created_utc": 1742354447.0,
      "score": 1
    },
    {
      "id": "mir0qsh",
      "body": "Dickheads are people who know that they have great dicks and let that go to their heads. That's how dickheads are born!😄",
      "created_utc": 1742448202.0,
      "score": 1
    },
    {
      "id": "mirc2p6",
      "body": "God I feel this so hard",
      "created_utc": 1742455073.0,
      "score": 1
    },
    {
      "id": "mit7fpr",
      "body": "Maybe get a custom dill dough?",
      "created_utc": 1742484932.0,
      "score": 1
    },
    {
      "id": "mivyp3m",
      "body": "Be like that 😭",
      "created_utc": 1742514281.0,
      "score": 1
    },
    {
      "id": "mhp5rjg",
      "body": "Wish I can screenshot it and bury it in my friend's brain 🥲",
      "created_utc": 1741927935.0,
      "score": 1963
    },
    {
      "id": "mhpbmz9",
      "body": "That's why you pay the troll toll",
      "created_utc": 1741931013.0,
      "score": 293
    },
    {
      "id": "mhp7zgb",
      "body": "Poetry",
      "created_utc": 1741929049.0,
      "score": 112
    },
    {
      "id": "mhpfbag",
      "body": "Hey nice profile pic",
      "created_utc": 1741933136.0,
      "score": 35
    },
    {
      "id": "mhppvwp",
      "body": "Well damn, you could probably slap that on a mug and make a profit lol",
      "created_utc": 1741939564.0,
      "score": 34
    },
    {
      "id": "mhqm5kc",
      "body": "Whats the male equivalent of that because lord knows I need to tell that to myself.",
      "created_utc": 1741956423.0,
      "score": 22
    },
    {
      "id": "mhqr6g3",
      "body": "Biiiiitch…. That’s getting embroidered on a pillow. That is WISDOM, mama.",
      "created_utc": 1741958228.0,
      "score": 31
    },
    {
      "id": "mhrl77g",
      "body": "I’m dying",
      "created_utc": 1741967476.0,
      "score": 11
    },
    {
      "id": "mhrtb7a",
      "body": "Just because he’s good for your clit\nDoesn’t meant that he’s worth a shit",
      "created_utc": 1741969811.0,
      "score": 28
    },
    {
      "id": "mhqa7t3",
      "body": "So poetic 🥹",
      "created_utc": 1741951409.0,
      "score": 10
    },
    {
      "id": "mhplibi",
      "body": "Put that shit on a shirt fr",
      "created_utc": 1741936855.0,
      "score": 15
    },
    {
      "id": "mhp8gbv",
      "body": "Truth.",
      "created_utc": 1741929291.0,
      "score": 10
    },
    {
      "id": "mhq04oe",
      "body": "This is the best line I’ve seen in a while!!! Great motto! 👏",
      "created_utc": 1741946028.0,
      "score": 5
    },
    {
      "id": "mhqmaco",
      "body": "“What is good for your hole isn’t always good for your soul” needs to be trademarked IMMEDIATELY",
      "created_utc": 1741956473.0,
      "score": 12
    },
    {
      "id": "mhpo11w",
      "body": "The shoe found the right foot that fits it",
      "created_utc": 1741938403.0,
      "score": 4
    },
    {
      "id": "mhpbb8y",
      "body": "And THAT right there is a fact. ",
      "created_utc": 1741930831.0,
      "score": 7
    },
    {
      "id": "mhrdrp7",
      "body": "This needs to be on a mug or something",
      "created_utc": 1741965327.0,
      "score": 3
    },
    {
      "id": "mhs1hc1",
      "body": "I need this as an inspirational wall art🤣",
      "created_utc": 1741972153.0,
      "score": 3
    },
    {
      "id": "mht9ccg",
      "body": "Fill the soul before the hole",
      "created_utc": 1741985325.0,
      "score": 3
    },
    {
      "id": "mhs199p",
      "body": "She was dicknotized! I think a few of us have been there, when that key was just the right fit for your keyhole you would put up with a lot of crap for a long time and then there are times that are disappointing you know how they say it’s not a good idea to meet your heroes yeah it’s best to leave it to the imagination you’d have more fun fantasizing than finding out the sizing",
      "created_utc": 1741972087.0,
      "score": 3
    },
    {
      "id": "mhq0msj",
      "body": "Love the rhyme",
      "created_utc": 1741946322.0,
      "score": 2
    },
    {
      "id": "mhq2nqw",
      "body": "You won the internet today ! Amazing comment.",
      "created_utc": 1741947481.0,
      "score": 2
    },
    {
      "id": "mhq7bw8",
      "body": "Word's of wisdom",
      "created_utc": 1741949976.0,
      "score": 2
    },
    {
      "id": "mhqn0qp",
      "body": "Needed this 💚",
      "created_utc": 1741956743.0,
      "score": 2
    },
    {
      "id": "mhqtrr7",
      "body": "Absolute poetry!",
      "created_utc": 1741959124.0,
      "score": 2
    },
    {
      "id": "mhr0m7u",
      "body": "Fucking poetry!",
      "created_utc": 1741961364.0,
      "score": 2
    },
    {
      "id": "mhr2yc8",
      "body": "LMAOOOO",
      "created_utc": 1741962093.0,
      "score": 2
    },
    {
      "id": "mhr7v4b",
      "body": "👏👏👏",
      "created_utc": 1741963577.0,
      "score": 2
    },
    {
      "id": "mhrfx7s",
      "body": "I’m taking this thank you. I will credit you as well",
      "created_utc": 1741965949.0,
      "score": 2
    },
    {
      "id": "mhs48ei",
      "body": "Amen",
      "created_utc": 1741972939.0,
      "score": 2
    },
    {
      "id": "mhs7g2i",
      "body": "Realest thing I’ve ever read 😭",
      "created_utc": 1741973857.0,
      "score": 2
    },
    {
      "id": "mhsammf",
      "body": "Oh wow.",
      "created_utc": 1741974766.0,
      "score": 2
    },
    {
      "id": "mhsd5sq",
      "body": "You need to put that on a shirt lol",
      "created_utc": 1741975540.0,
      "score": 2
    },
    {
      "id": "mhtibh9",
      "body": "This needs to be on a shirt or an inspirational poster.",
      "created_utc": 1741987882.0,
      "score": 2
    },
    {
      "id": "mhtv5y9",
      "body": "This should be on a shirt",
      "created_utc": 1741992039.0,
      "score": 2
    },
    {
      "id": "mhv6a1r",
      "body": "I needed to hear this",
      "created_utc": 1742008722.0,
      "score": 2
    },
    {
      "id": "mhv9pax",
      "body": "Golden words",
      "created_utc": 1742010218.0,
      "score": 2
    },
    {
      "id": "mhxq861",
      "body": "😂😂😂😂😂",
      "created_utc": 1742053718.0,
      "score": 2
    },
    {
      "id": "mhyf26s",
      "body": "Words to live by",
      "created_utc": 1742061399.0,
      "score": 2
    },
    {
      "id": "midndhz",
      "body": "you cooked with that one boo!",
      "created_utc": 1742267838.0,
      "score": 2
    },
    {
      "id": "mir9nb3",
      "body": "I probably laughed way to hard at this! 😂",
      "created_utc": 1742453527.0,
      "score": 2
    },
    {
      "id": "mkzd7qy",
      "body": "That’s going in my quotes book",
      "created_utc": 1743573054.0,
      "score": 2
    },
    {
      "id": "mhr1ts7",
      "body": "Good for your hole not for you whole.",
      "created_utc": 1741961744.0,
      "score": 1
    },
    {
      "id": "mhr2vnn",
      "body": "Real she’s acting like it touched her soul",
      "created_utc": 1741962071.0,
      "score": 1
    },
    {
      "id": "mhspmu7",
      "body": "Just because he is good for your hole doesn’t mean he is good for you whole. FIFY",
      "created_utc": 1741979482.0,
      "score": 1
    },
    {
      "id": "mht9fw0",
      "body": "Fill the soul before the hole",
      "created_utc": 1741985355.0,
      "score": 1
    },
    {
      "id": "mhv3pha",
      "body": "What's good for your hole is good for your soul. 9/10 Doctor's reccomend a healthy diet of 🍆 for all women.",
      "created_utc": 1742007684.0,
      "score": 1
    },
    {
      "id": "mhvudrt",
      "body": "Hawk Tuah's legacy lives on 😆",
      "created_utc": 1742020951.0,
      "score": 1
    },
    {
      "id": "mhpf1aj",
      "body": "\"The great Dickpression\"",
      "created_utc": 1741932972.0,
      "score": 584
    },
    {
      "id": "mhqqqyf",
      "body": "Dude this is so validating to read because some idiot was trying to argue with me last night when i said im not interested in hookups saying that most relationships start from hooking up. Okay, and? Lmfao does that means i have to subject myself to doing smth i hate just bcuz others are doing it?? I hate men",
      "created_utc": 1741958078.0,
      "score": 48
    },
    {
      "id": "mhqsvfv",
      "body": "Oh yeah I've come to this conclusion a bit ago, it was just still hard to move on mostly because of the dick lol. Like I don't even care if my next man has a similar schlong, I just wanna be treated well for once",
      "created_utc": 1741958817.0,
      "score": 20
    },
    {
      "id": "mhtfmq6",
      "body": "^ This is what you learn through your twenties!",
      "created_utc": 1741987059.0,
      "score": 3
    },
    {
      "id": "mhut3da",
      "body": "[deleted]",
      "created_utc": 1742003705.0,
      "score": 1
    },
    {
      "id": "mhqrlk4",
      "body": "Yes. Yes we are.",
      "created_utc": 1741958375.0,
      "score": 160
    },
    {
      "id": "mhr0152",
      "body": "Honestly there's not such thing as \"bad dick\" imo. Sure there's going to be situations like mine, but I'd much rather be with an amazing guy that treats me great than a nice dick that treats me poorly",
      "created_utc": 1741961181.0,
      "score": 53
    },
    {
      "id": "mhqc9os",
      "body": "A throatgoat doesn’t always make your boat float (I have no idea what that means).",
      "created_utc": 1741952359.0,
      "score": 383
    },
    {
      "id": "mhpqx8y",
      "body": "You're counting the asshole as a con?",
      "created_utc": 1741940224.0,
      "score": 159
    },
    {
      "id": "mhpqyuq",
      "body": "sometimes the headache ain’t worth the view lol",
      "created_utc": 1741940253.0,
      "score": 55
    },
    {
      "id": "mhquhv4",
      "body": "Absolutely agree. This dude would mostly only show affection during sexual time, but I'd have to constantly ask for wholesome affection.. and he made me feel absolutely fucking stupid 80% of the time. Can only go up from here tho",
      "created_utc": 1741959370.0,
      "score": 70
    },
    {
      "id": "mhu164i",
      "body": "What was wrong with her asshole? 🤔 (I’m joking! 😂)",
      "created_utc": 1741994044.0,
      "score": 1
    },
    {
      "id": "mhpnrmj",
      "body": "Hello Yoda, but you're right on that one",
      "created_utc": 1741938238.0,
      "score": 137
    },
    {
      "id": "mhqni14",
      "body": "If it did, we could be rid of assholes in a generation.",
      "created_utc": 1741956918.0,
      "score": 11
    },
    {
      "id": "mhpa3d6",
      "body": "Oh don't worry I'm extremely lonely just miss the dick",
      "created_utc": 1741930160.0,
      "score": 226
    },
    {
      "id": "mhqww3g",
      "body": "I swear you can't have it all. Plus those are the ones that know they have a good cock so they're overly cocky typically",
      "created_utc": 1741960169.0,
      "score": 38
    },
    {
      "id": "mhwm3st",
      "body": "Not true. The thing is the great personality great dick combo types are always taken or at least not jumping from a woman to another, so you have less chances to find them.",
      "created_utc": 1742038419.0,
      "score": 3
    },
    {
      "id": "mhp4df4",
      "body": "it’s so frustrating when you have amazing sex chemistry but nothing else :(",
      "created_utc": 1741927260.0,
      "score": 266
    },
    {
      "id": "mhs9j66",
      "body": "Ugh!!! I hear and feel you on this. The perfection in the bedroom was off the charts!!! The ONLY time we ever had perfect communication, vibes, energy.... man was skilled beyond measure with what he can do with his mouth, hands, and ooooffff... his dick game? Don't get me started.... plus all the shared kinks? In that aspect.... he is probably not replaceable. But the price tag on that is astronomically high fr.",
      "created_utc": 1741974453.0,
      "score": 15
    },
    {
      "id": "mhoyyvm",
      "body": "Oh shit the hands 😭 mine has weird fingernails tho it's a bit easier to forget lol. The dick tho? Nah",
      "created_utc": 1741924831.0,
      "score": 67
    },
    {
      "id": "mhqv5gg",
      "body": "I'd be lying if I said this thought didn't cross my mind 😭",
      "created_utc": 1741959593.0,
      "score": 58
    },
    {
      "id": "mhp9zdi",
      "body": "This made me fully laugh",
      "created_utc": 1741930101.0,
      "score": 74
    },
    {
      "id": "mhrgjgv",
      "body": "For a half second I thought OP could be my ex…but then I remember my ex telling me I was bad in bed 😥",
      "created_utc": 1741966127.0,
      "score": 9
    },
    {
      "id": "mhqzic2",
      "body": "Huh😭 wild child or the next big crime?",
      "created_utc": 1741961016.0,
      "score": 7
    },
    {
      "id": "mhpoe4c",
      "body": "Happy cake day!!!!",
      "created_utc": 1741938631.0,
      "score": 6
    },
    {
      "id": "mhqva6n",
      "body": "I had no idea how common this feeling was lmao😭",
      "created_utc": 1741959636.0,
      "score": 2
    },
    {
      "id": "mhqxzgd",
      "body": "Let's have a moment of silence for Perfect Dick and the fact you probably see him regularly.",
      "created_utc": 1741960525.0,
      "score": 47
    },
    {
      "id": "mhrkxyx",
      "body": "What makes a perfect dick?",
      "created_utc": 1741967401.0,
      "score": 9
    },
    {
      "id": "mhr32tg",
      "body": "I fully understand this. My ex was such a sweet guy for the first few months of our relationship then the narcissist tendencies came out, towards the end he would 100% make me feel like I wasn't good enough, stupid, and not worthy of anything better than what he gave. The combination has now made me have many issues mentally with meeting new people",
      "created_utc": 1741962131.0,
      "score": 7
    },
    {
      "id": "mhqx5h3",
      "body": "Hooking up after 8 years is wild, no shame you do you tho😭",
      "created_utc": 1741960255.0,
      "score": 42
    },
    {
      "id": "mhpieau",
      "body": "MHM",
      "created_utc": 1741934992.0,
      "score": 6
    },
    {
      "id": "mht4d6k",
      "body": "you know what girl hell yeah 😭😭",
      "created_utc": 1741983848.0,
      "score": 5
    },
    {
      "id": "mhppfr3",
      "body": "Pretty sure that guy actually deserved it.",
      "created_utc": 1741939285.0,
      "score": 10
    },
    {
      "id": "mhqvkep",
      "body": "Dare I ask what that means?",
      "created_utc": 1741959732.0,
      "score": 1
    },
    {
      "id": "mhqyq8v",
      "body": "This is so sweet 😭 honestly all my relationships I've been treated poorly, so I'm totally fine with an average dick, but hey if the whole package finds me that'd be awesome",
      "created_utc": 1741960766.0,
      "score": 12
    },
    {
      "id": "mhqyrfe",
      "body": "This is so sweet 😭 honestly all my relationships I've been treated poorly, so I'm totally fine with an average dick, but hey if the whole package finds me that'd be awesome",
      "created_utc": 1741960776.0,
      "score": 2
    },
    {
      "id": "mhoyprz",
      "body": "You're welcome internet stranger",
      "created_utc": 1741924723.0,
      "score": 67
    },
    {
      "id": "mhpmgtr",
      "body": "What’s a PA?",
      "created_utc": 1741937438.0,
      "score": 19
    },
    {
      "id": "mhqwlu0",
      "body": "Don't worry I'm sure you'll find much better dick with someone better. I can't say you'll find someone else with a PA tho😭 2 gauge is fucking wild too, is that what they generally use or did he change it?",
      "created_utc": 1741960074.0,
      "score": 2
    },
    {
      "id": "mhr4ium",
      "body": "Ironic your comment was between others saying they agree😭",
      "created_utc": 1741962573.0,
      "score": 3
    },
    {
      "id": "mhozfp0",
      "body": "I am pleased to deliver the jump scare factor to reddit",
      "created_utc": 1741925031.0,
      "score": 45
    },
    {
      "id": "mhqy5ps",
      "body": "Yep this exactly, they know what they have and how to manipulate a change because of it",
      "created_utc": 1741960581.0,
      "score": 5
    },
    {
      "id": "mhu7xp8",
      "body": "OH MY GOD yes! Why is it the fucking huge narcissists that have gold dick? Then they know they have the dick power??",
      "created_utc": 1741996314.0,
      "score": 2
    },
    {
      "id": "mhqxmpo",
      "body": "I definitely feel that, this man would be flat out disrespectful and I'd dead ass go \"but the dick\" 😭",
      "created_utc": 1741960410.0,
      "score": 14
    },
    {
      "id": "mpmg8bo",
      "body": "RIP your future boyfriend",
      "created_utc": 1745912267.0,
      "score": 2
    },
    {
      "id": "mhqzacd",
      "body": "As a woman I often forget each kitty is different, but I'm sure we'll both find better meat sticks and holes",
      "created_utc": 1741960945.0,
      "score": 26
    },
    {
      "id": "mhr5g41",
      "body": "Nah those are the dangerous ones😭",
      "created_utc": 1741962854.0,
      "score": 9
    },
    {
      "id": "mhrskez",
      "body": "'Size dont matter' Literally all the comments are like \"it was the perfect 8' \" or \"i still think about that big dick 10 years later\", which is it",
      "created_utc": 1741969600.0,
      "score": 18
    },
    {
      "id": "mhq5ymg",
      "body": "It matters, but not in the way you think. Some women genuinely prefer smaller because the space from their vaginal opening to their cervix is shorter and slamming into the cervix hurts so incredibly bad and will leave you bruised. It's not like hentai and porn makes it out to be. Some women are able to take bigger dicks while others can't. Not every woman wants a man with a +7in.",
      "created_utc": 1741949272.0,
      "score": 26
    },
    {
      "id": "mismup6",
      "body": "Yeah this shit is kinda soul crushing ill be honest",
      "created_utc": 1742478647.0,
      "score": 3
    },
    {
      "id": "mhr1uou",
      "body": "🤫",
      "created_utc": 1741961752.0,
      "score": 2
    },
    {
      "id": "mhu7q12",
      "body": "Lmao😭 I can't say I was at that point but yeah there's times I'm laying there being horny just going damn I miss his cock",
      "created_utc": 1741996241.0,
      "score": 1
    },
    {
      "id": "mhr5d7y",
      "body": "I was absolutely in your shoes towards the start of our breakup. With time you start to see how he treated you was actually pretty fucked up",
      "created_utc": 1741962830.0,
      "score": 1
    },
    {
      "id": "mhv4pfb",
      "body": "Woah there dude, I think you have the wrong mindset here. Your size doesn't matter if you know how to use it. You don't need a massively long dick to satisfy someone, and too long or too girthy is very uncomfortable. Plus if you have love and passion it really won't matter if someone else was \"better\"",
      "created_utc": 1742008085.0,
      "score": 3
    },
    {
      "id": "mhr1sz0",
      "body": "Absolutely. My breakup was relatively recent and I haven't been treated good in a long time though.",
      "created_utc": 1741961737.0,
      "score": 1
    },
    {
      "id": "mhp5i2h",
      "body": "Username checks out",
      "created_utc": 1741927809.0,
      "score": 48
    },
    {
      "id": "mhr0icg",
      "body": "Double it and pass it to the next person energy",
      "created_utc": 1741961331.0,
      "score": 10
    },
    {
      "id": "mhu7cvq",
      "body": "This post has made me realize how many people relate and it's insane 😭 I've literally started to laugh when I think about him at all because of this. Anyway we both got this🤌🤌",
      "created_utc": 1741996119.0,
      "score": 6
    },
    {
      "id": "mhpo7y8",
      "body": "It’s not the same. Boring.",
      "created_utc": 1741938525.0,
      "score": 22
    },
    {
      "id": "mhudmbi",
      "body": "I definitely feel there's a point to being with someone else, just because he had a nice dick doesn't mean I'm done looking for the one, but yes I could definitely be with someone who didn't compare. I don't judge people based on their dick sizes or their sexual performance, so that also ties into your last question. I would never view someone lesser than another person for something like this, especially if the next guy treats me better.",
      "created_utc": 1741998239.0,
      "score": 3
    },
    {
      "id": "mhupdsy",
      "body": "Yeah I'm holding out my last bit of hope for this. I just wanna be treated like a princess or something for once",
      "created_utc": 1742002366.0,
      "score": 2
    },
    {
      "id": "mhpn5pv",
      "body": "Totally depends on the person - there‘s no one-size-fits-all",
      "created_utc": 1741937866.0,
      "score": 10
    },
    {
      "id": "mhr50vv",
      "body": "Like the other person said, it depends on the person. So what I like might not be for the next person, even then I don't think men should compare themselves. Your dick is your dick and you can't change it, there's going to be the person for you who absolutely loves your dick for what it is.",
      "created_utc": 1741962726.0,
      "score": 2
    },
    {
      "id": "mhrvrsp",
      "body": "Manipulative people often use anything they can against you lol",
      "created_utc": 1741970521.0,
      "score": 1
    },
    {
      "id": "mhrs5m9",
      "body": "You haven’t lived then, you’re missing out.",
      "created_utc": 1741969482.0,
      "score": 1
    },
    {
      "id": "mhxd9ve",
      "body": "i've noticed that ppl who r amazing in bed ( not just good, but 5 star amazing!) r the ones who will drive u crazy. ...WHY ?!?!",
      "created_utc": 1742049552.0,
      "score": 1
    },
    {
      "id": "mitrtbs",
      "body": "That's what she said. Hey-oh!",
      "created_utc": 1742490827.0,
      "score": 1
    },
    {
      "id": "mpmh7io",
      "body": "It’s suicidefuel, isn’t it?",
      "created_utc": 1745912888.0,
      "score": 2
    },
    {
      "id": "mpmhim5",
      "body": "Ropefuel.",
      "created_utc": 1745913081.0,
      "score": 2
    },
    {
      "id": "mpmhkw2",
      "body": "If you ever get a boyfriend, that guy is gonna rope himself",
      "created_utc": 1745913119.0,
      "score": 2
    },
    {
      "id": "mhy4h34",
      "body": "I hate that so many men feel like this. I made this post to get the thought out of my head since it was a semi recent breakup. Your dick is special in its own way, and someone is going to love it and not even think about previous dicks",
      "created_utc": 1742058165.0,
      "score": 2
    },
    {
      "id": "mhu7jwd",
      "body": "That has been considered",
      "created_utc": 1741996184.0,
      "score": 2
    },
    {
      "id": "mijnmwl",
      "body": "May I ask why you have to breakup with him? Good dick doesn't outweigh being treated right though always remember that",
      "created_utc": 1742348108.0,
      "score": 1
    },
    {
      "id": "mhqgwk1",
      "body": "I just screenshotted it and made it my background to my phone as I just broke up with good dick",
      "created_utc": 1741954374.0,
      "score": 562
    },
    {
      "id": "mhpolej",
      "body": "To get into that boy's soul",
      "created_utc": 1741938758.0,
      "score": 120
    },
    {
      "id": "mhp8h5z",
      "body": "Amen",
      "created_utc": 1741929303.0,
      "score": 27
    },
    {
      "id": "mhpnce1",
      "body": "My god Karen, you can’t just tell people they have a nice profile pic.",
      "created_utc": 1741937978.0,
      "score": 67
    },
    {
      "id": "mhr12f4",
      "body": "Just because she’s fire in bed doesn’t mean she’s right for your head.",
      "created_utc": 1741961506.0,
      "score": 55
    },
    {
      "id": "mhqo15s",
      "body": "What's good for your dick, might make you ick!",
      "created_utc": 1741957110.0,
      "score": 23
    },
    {
      "id": "mhwn9rw",
      "body": "I'm quite sure the roman-catholic church trademarked this centuries ago 😁",
      "created_utc": 1742039038.0,
      "score": 2
    },
    {
      "id": "mhq2875",
      "body": "Omg I was severely depressed when I was getting the best dick. Like how is that possible",
      "created_utc": 1741947235.0,
      "score": 130
    },
    {
      "id": "mhqtqyw",
      "body": "Omg exactly. Hookups might work for some people but it just doesn't for me and I hate how common it is. Yeah good peen is awesome but if there's nothing there I personally end up feeling used. Or the men that say \"it's not a big deal\" god I hate that",
      "created_utc": 1741959117.0,
      "score": 32
    },
    {
      "id": "mhrvdu5",
      "body": "see i’m not someone who’s interested in hookups, i don’t like them. now, my current relationship did start from a hookup and while i’m happy with my relationship and i don’t regret it, i would not do that again and i think anyone who’s not interested in doing that shouldn’t. we don’t have to do something because other people do it 😂 live your life how you want",
      "created_utc": 1741970409.0,
      "score": 2
    },
    {
      "id": "mhqt6n0",
      "body": "It’s the difference between a good fuck and absolute love making, and call me sappy, but the latter is always, always, ALWAYS better!",
      "created_utc": 1741958924.0,
      "score": 10
    },
    {
      "id": "milynew",
      "body": "Sad!!!",
      "created_utc": 1742388266.0,
      "score": 1
    },
    {
      "id": "mhr0f8e",
      "body": "I'm sure your dick is great in its own way. Personally I'd rather be with a great guy than a big schlong",
      "created_utc": 1741961303.0,
      "score": 112
    },
    {
      "id": "mhrfww5",
      "body": "It feels good to be wanted for my personality, but man would I love to be wanted for my dick.",
      "created_utc": 1741965946.0,
      "score": 74
    },
    {
      "id": "mhudj07",
      "body": "That's not the compliment you might think it is",
      "created_utc": 1741998208.0,
      "score": 5
    },
    {
      "id": "mi0m8g9",
      "body": "This is straigh up bogus she loves big scaling and it's probably 99% of what she cares about",
      "created_utc": 1742087847.0,
      "score": 2
    },
    {
      "id": "miqzrj3",
      "body": "No need to lie and bs \nIt's clear which one is liked and better by this post \nTypical reddit",
      "created_utc": 1742447664.0,
      "score": 2
    },
    {
      "id": "mhsb53g",
      "body": "I’m making this into a sign",
      "created_utc": 1741974911.0,
      "score": 35
    },
    {
      "id": "mht4h8o",
      "body": "No no, this super duper works.",
      "created_utc": 1741983881.0,
      "score": 11
    },
    {
      "id": "mht4sew",
      "body": "10/10 head doesn’t make her wife material is essentially what you said, but the way you put it is way better 😂.",
      "created_utc": 1741983973.0,
      "score": 8
    },
    {
      "id": "mhts5u5",
      "body": "Legend.  This should be in the Reddit HOF",
      "created_utc": 1741991041.0,
      "score": 3
    },
    {
      "id": "mhqfkpz",
      "body": "The head ain’t worth the headache.",
      "created_utc": 1741953821.0,
      "score": 39
    },
    {
      "id": "mhr30nw",
      "body": "Play the market.  You likely won’t find the perfect package but it is fun trying.  Until then, just have fun.",
      "created_utc": 1741962113.0,
      "score": 12
    },
    {
      "id": "mhsk6z9",
      "body": "Go up as in size?",
      "created_utc": 1741977855.0,
      "score": 1
    },
    {
      "id": "mhu1x72",
      "body": "I meant asshole like a “jerk.”  There is nothing wrong with licking/fucking an asshole from time to time.",
      "created_utc": 1741994297.0,
      "score": 2
    },
    {
      "id": "mhpayfa",
      "body": "Haha dw after this post you gonna get a ton of dms lol",
      "created_utc": 1741930634.0,
      "score": 115
    },
    {
      "id": "mhr4esz",
      "body": "May y'all find ✌🏼 peace.",
      "created_utc": 1741962539.0,
      "score": 2
    },
    {
      "id": "mhrlkg8",
      "body": "Yea exactly. Last dude I did had the best dick I’ve ever experienced but he was a narcissist and the worst human I ever met. The way he treated me because he knew his dick was bomb was insane.",
      "created_utc": 1741967581.0,
      "score": 17
    },
    {
      "id": "mhpgsgi",
      "body": "[deleted]",
      "created_utc": 1741934022.0,
      "score": 142
    },
    {
      "id": "mhqbvjj",
      "body": "Then you basically have nothing",
      "created_utc": 1741952181.0,
      "score": 4
    },
    {
      "id": "mhsaj4k",
      "body": "Those matching kinks tho 🫠💥💦",
      "created_utc": 1741974737.0,
      "score": 8
    },
    {
      "id": "mhx2rjk",
      "body": "how long and thick, and how was his dick game skilled",
      "created_utc": 1742045806.0,
      "score": 1
    },
    {
      "id": "mhpuly8",
      "body": "Weird fingernails?",
      "created_utc": 1741942598.0,
      "score": 23
    },
    {
      "id": "mhs8w6q",
      "body": "Hit him with a \"you know what would be hot? If we made a dick cast of you and you can use it on me\" or \"I'll send you a spicy video of me using it\"....and ta da! You'll have the dick and not the asshole anymore...lmao!!!!",
      "created_utc": 1741974271.0,
      "score": 22
    },
    {
      "id": "mhr1eyt",
      "body": "*bows head*",
      "created_utc": 1741961614.0,
      "score": 21
    },
    {
      "id": "mht8cl4",
      "body": "🤷‍♂️",
      "created_utc": 1741985032.0,
      "score": 2
    },
    {
      "id": "mhr93np",
      "body": "My girl too - 4 months in I told her I loved her, and I was perfectly happy. I would have happily spent my life with her at that point. It actually started going downhill soon after I said that. I think she was probably waiting for me to be \"hooked\" before letting her real self loose. I sometimes wonder if I enabled her/encouraged her by being loving and bending over backwards to please her, and it took me too long to see her for what she was. The evidence was mounting by the week but I just couldn't quite believe anyone could be as awful as she seemed to be - there has to be more to the story. But there wasn't, and I eventually learned that monsters walk among us. Still miss the sex though, she understood what I wanted perfectly.",
      "created_utc": 1741963947.0,
      "score": 2
    },
    {
      "id": "mhs9g60",
      "body": "Look up Lorena Bobbitt lol, just a lady that chopped her partners dick off.",
      "created_utc": 1741974429.0,
      "score": 1
    },
    {
      "id": "mhpovbr",
      "body": "Guessing Prince Albert, piercing.",
      "created_utc": 1741938929.0,
      "score": 24
    },
    {
      "id": "mhppj8j",
      "body": "Prince Albert",
      "created_utc": 1741939345.0,
      "score": 7
    },
    {
      "id": "mhqwomi",
      "body": "A peen piercing",
      "created_utc": 1741960100.0,
      "score": 7
    },
    {
      "id": "mhud07c",
      "body": "😭 can we please?",
      "created_utc": 1741998028.0,
      "score": 1
    },
    {
      "id": "mhsh0pu",
      "body": "Women think with their dick too lol",
      "created_utc": 1741976882.0,
      "score": 7
    },
    {
      "id": "mhvv5ll",
      "body": "For real, this man wasn’t supportive at all when I needed him most and he deadass avoided spending any quality time with my unless he wanted to have sex. But god I miss his dick.",
      "created_utc": 1742021432.0,
      "score": 2
    },
    {
      "id": "mhru13u",
      "body": "MEAT STICKS AND HOLES 😭",
      "created_utc": 1741970018.0,
      "score": 18
    },
    {
      "id": "mhts9uf",
      "body": "Internally crying as a guy with an average penis 😭",
      "created_utc": 1741991077.0,
      "score": 7
    },
    {
      "id": "misn68w",
      "body": "Because women tell you often what makes them feel secure but not what gets them wet, ugly truth.",
      "created_utc": 1742478751.0,
      "score": 2
    },
    {
      "id": "mhr0xpl",
      "body": "Like this is what needs to be posted when Reddit complains about dick size. Literally every single woman will tell you this but, still men, average great men, small men, skinny men they all think women just want the most massive crazy dick. She said “great length” which is completely subjective. Every woman has a different definition of what the perfect dick for them is.",
      "created_utc": 1741961465.0,
      "score": 4
    },
    {
      "id": "mhr134e",
      "body": "I completely agree with this. Sure a big dick is fun but without the proper foreplay and shit it just ends up hurting. I'd much rather have a guy who treats me great than a big dick that's shitty.",
      "created_utc": 1741961512.0,
      "score": 5
    },
    {
      "id": "mhvlhem",
      "body": "Thanks I needed to hear this",
      "created_utc": 1742015879.0,
      "score": 2
    },
    {
      "id": "miq8dml",
      "body": "[deleted]",
      "created_utc": 1742436064.0,
      "score": 1
    },
    {
      "id": "mhposeo",
      "body": "I guess that can be true. But women get way better toys than men.",
      "created_utc": 1741938880.0,
      "score": 7
    },
    {
      "id": "mhus12k",
      "body": "You will! I’m praying for the same thing myself lol, in the meantime I just treat myself like princess until bro finally comes along 😭",
      "created_utc": 1742003320.0,
      "score": 3
    },
    {
      "id": "mhps9t1",
      "body": "And there's one size accommodates all.",
      "created_utc": 1741941087.0,
      "score": 4
    },
    {
      "id": "mhrtt79",
      "body": " i’ve had  dick still not worth  manipulation and dealing with an ass.",
      "created_utc": 1741969954.0,
      "score": 2
    },
    {
      "id": "mpmihrj",
      "body": "Do you have a small D",
      "created_utc": 1745913700.0,
      "score": 2
    },
    {
      "id": "mhzbe2w",
      "body": "Well - I can't speak on the behalf of all men - but we just want to be the best partner in life we can be and it deeply troubles the male brain when there was or is someone else out there who could've been everything for you in life if they weren't terrible in other aspects.\n\nI mean - everyone in here is saying stuff like:\n\n\"Why can't we have it all in one man? Why must he have a great penis and yet be a terrible person?\"\n\nIt just hurts very deeply knowing that someone you love and who cares about you still has cherished memories with a previous partner (possibly still masturbate to or get horny over) and feeling like we can't measure up or fill that void left behind.\n\nI wanna say it's kind of like the same deal when women see their men ogling other women and feel like they're just not sexy enough in his eyes because they want to be the best partner for them.\n\nI hope you're right honestly. I don't think that way at all with a lover's physical traits or behaviors. I treat them like they are the \"one and only experience\" in what makes them special because I know what it's like to be a \"second choice.\"   \n  \nIt's pretty f\\*cking rough lol.",
      "created_utc": 1742071587.0,
      "score": 2
    },
    {
      "id": "mimje18",
      "body": "Anger issues primarily. That’s true ",
      "created_utc": 1742395283.0,
      "score": 1
    },
    {
      "id": "mhr86ur",
      "body": "I recently broke up with bad dick that thought he was the best dick only to be chosen by an actual best dick ever where I will contently sit until further notice 😬",
      "created_utc": 1741963675.0,
      "score": 242
    },
    {
      "id": "mhqhgj1",
      "body": "Everyone should do it tbh 🙏🙏",
      "created_utc": 1741954602.0,
      "score": 42
    },
    {
      "id": "mhry6k7",
      "body": "You have to keep that mantra handy lol",
      "created_utc": 1741971211.0,
      "score": 2
    },
    {
      "id": "mhq4yr9",
      "body": "Sorry are you saying soul or hole because it sounds like you're saying hole. Wait, Frank are you chewing gum? I said no gum. \nHe said no gum.",
      "created_utc": 1741948745.0,
      "score": 70
    },
    {
      "id": "mhpue9z",
      "body": "I smell what you're cookin\n\nPre edit bc I'm not sure thats gonna be obvious but the Rock's one arched eyebrow and the wrestling tagline 'can you smell what the Rock is cookin'",
      "created_utc": 1741942461.0,
      "score": 14
    },
    {
      "id": "mhrxlw6",
      "body": "Good for the pole doesn't mean good for the soul",
      "created_utc": 1741971046.0,
      "score": 32
    },
    {
      "id": "mhxw975",
      "body": "I think they phrased it a bit differently",
      "created_utc": 1742055610.0,
      "score": 2
    },
    {
      "id": "mhq315e",
      "body": "The dopamine hit triumph the trouble. Many people in toxic relationships remember the sex fondly, but it's because the lows where so insanely low that when you finally had sex and a happy moment, your body and mind went haywire and everything was amazing",
      "created_utc": 1741947685.0,
      "score": 150
    },
    {
      "id": "miq4og6",
      "body": "[deleted]",
      "created_utc": 1742434777.0,
      "score": 1
    },
    {
      "id": "mhs9e4w",
      "body": "does big shlong=great dick? lol",
      "created_utc": 1741974413.0,
      "score": 29
    },
    {
      "id": "mhxeznj",
      "body": "I'm a guy and I had the inverse situation. My ex was a massive POS alcoholic, but she gassed my dick up so much like no one else has ever done before or since. She told me it was like a puzzle piece fitting perfectly inside of her. No one has ever said anything remotely like that to me, and it made me not want to leave. Actually now that I'm typing this out, that may have been by design on her end...",
      "created_utc": 1742050121.0,
      "score": 2
    },
    {
      "id": "mhuea9f",
      "body": "Oh I'm sure, as it can be taken as \"so I can't satisfy her sexually but can every other way\". Personally i can't relate obviously, but I can definitely understand. Once I meet someone else I wouldn't even compare because the dick was nice but it wasn't everything",
      "created_utc": 1741998466.0,
      "score": 1
    },
    {
      "id": "mi0mthq",
      "body": "Are you referring to she as me? Bc I don't only care about dick size but you got your beliefs of an internet stranger 🤷‍♀️",
      "created_utc": 1742088062.0,
      "score": 1
    },
    {
      "id": "mivrryp",
      "body": "Great head doesn't mean you should wed ",
      "created_utc": 1742512078.0,
      "score": 1
    },
    {
      "id": "mhquozh",
      "body": "I'm fucking laughing because I literally just woke up to an ass load of requests 😭",
      "created_utc": 1741959436.0,
      "score": 74
    },
    {
      "id": "mhps7a2",
      "body": "Ton of dicks in dms*",
      "created_utc": 1741941042.0,
      "score": 46
    },
    {
      "id": "mia802f",
      "body": "Hi, what makes a dick great if i may ask? Is it just the size or what is it? Thanks, mine is 18 cm and pretty girthy so id like to know if woman refer to me like this....thanks.",
      "created_utc": 1742229233.0,
      "score": 1
    },
    {
      "id": "mhqeacw",
      "body": "[deleted]",
      "created_utc": 1741953260.0,
      "score": 29
    },
    {
      "id": "mhqn3g5",
      "body": "Mine has a great dick, treats me well, a cook, faithful but cant marry me yet because of family financial issues. ",
      "created_utc": 1741956770.0,
      "score": 25
    },
    {
      "id": "mhzoi1s",
      "body": "I feel like you can at least coach in that situation if the other person‘s willing. if not and they are not open to opening the relationship up then its not gonna last imo. im not interested in a companion only… :<",
      "created_utc": 1742075954.0,
      "score": 2
    },
    {
      "id": "mhscevx",
      "body": "I knoooooowwwwww!!!!!! 😭😭😭😭😭",
      "created_utc": 1741975297.0,
      "score": 6
    },
    {
      "id": "mhquzpj",
      "body": "Yeah he has a skin condition or some shit, so his nails would be weirdly thick and would fall off for some reason lol",
      "created_utc": 1741959538.0,
      "score": 10
    },
    {
      "id": "mhsi2u6",
      "body": "He would have to be dumb beyond belief",
      "created_utc": 1741977212.0,
      "score": 12
    },
    {
      "id": "mhu8bze",
      "body": "I mean I did ask him before we broke up but he'd always go \"idk if id fit\" like bro you're big but you aren't that huge come on",
      "created_utc": 1741996448.0,
      "score": 2
    },
    {
      "id": "mipc5hw",
      "body": "Word em up ✋️😌",
      "created_utc": 1742425204.0,
      "score": 1
    },
    {
      "id": "miq8opy",
      "body": "My brother in Christ what is you doing? Coming in acting like you know me or something 😭",
      "created_utc": 1742436172.0,
      "score": 1
    },
    {
      "id": "mhr48m2",
      "body": "As a woman that has been looking for recent sex toys I can definitely see this as true. However there's way too many options for women, like why the fuck do I need it to vibrate, rotate beads, make cookies, and self lubricate?",
      "created_utc": 1741962487.0,
      "score": 7
    },
    {
      "id": "mhuvnkl",
      "body": "I love that mindset lol. I do need to work on some self love🤔 seems like a perfect time. Let's just hope we both get that dude sooner than we hope🫠",
      "created_utc": 1742004632.0,
      "score": 1
    },
    {
      "id": "mpmkfoe",
      "body": "It’s average, but the comments still hurt like Hell.",
      "created_utc": 1745914958.0,
      "score": 2
    },
    {
      "id": "mhss1zk",
      "body": "that happened to me too. 10 years ago. I congratulate you on a terrific turnaround!",
      "created_utc": 1741980200.0,
      "score": 60
    },
    {
      "id": "mhqd3kk",
      "body": "I said boy’s soul",
      "created_utc": 1741952732.0,
      "score": 23
    },
    {
      "id": "mhpw8op",
      "body": "Surely you mean \"Can you smelllllllllllllllll what the Cock is cookin\" ?",
      "created_utc": 1741943642.0,
      "score": 16
    },
    {
      "id": "mhrxtiq",
      "body": "And if it's bad for the soul you're in the wrong hole",
      "created_utc": 1741971107.0,
      "score": 22
    },
    {
      "id": "mhueb3s",
      "body": "Omfg 🤣🤣",
      "created_utc": 1741998474.0,
      "score": 3
    },
    {
      "id": "mhq3dvm",
      "body": "Ooooooo yeah buddy that was it. It was a rollercoaster of a relationship, extremely high highs and desperately low lows. The relationship wrecked me to the point where my mental health was so bad I had to drop out of uni and eventually move country to try to start a new life. Sad to say it now but looking back I completely lost my sense of self and was a shell of a person riddled with mental health issues and insecurities. I’ll never look for that kind of relationship again. I want safety and no crazy highs or lows",
      "created_utc": 1741947880.0,
      "score": 45
    },
    {
      "id": "mhu71bc",
      "body": "I just use big schlong loosely for big dick lol",
      "created_utc": 1741996011.0,
      "score": 4
    },
    {
      "id": "mhqv05c",
      "body": "Haha enjoy being a female on reddit",
      "created_utc": 1741959542.0,
      "score": 25
    },
    {
      "id": "mhri923",
      "body": "Are there any good dicks?",
      "created_utc": 1741966627.0,
      "score": 2
    },
    {
      "id": "mhqurn5",
      "body": "The \"potentially offensive\" requests scream dicks",
      "created_utc": 1741959462.0,
      "score": 3
    },
    {
      "id": "mhr1k11",
      "body": "I'm pretty sure he was a zombie.",
      "created_utc": 1741961658.0,
      "score": 29
    },
    {
      "id": "mhr72e7",
      "body": "Try and remember this disgusting part and not the good sex. Will be a lot easier for you.",
      "created_utc": 1741963340.0,
      "score": 11
    },
    {
      "id": "mhrthap",
      "body": "I wouldn’t have let that anywhere near me. Wtf",
      "created_utc": 1741969860.0,
      "score": 3
    },
    {
      "id": "mhwjtj3",
      "body": "Nah, if he knew she loved it so much she wanted a mold of it, that would pad his ego so much he'd be into it.",
      "created_utc": 1742037154.0,
      "score": 1
    },
    {
      "id": "mpmla64",
      "body": "Yep. Once I learn to enjoy celibate life - all will be well tho\n\nJust learning to cook myself good food, do fun exercise/ hobbies \n\nOccasionally I get super horny \n\njack of multiple times until I'm fully disgusted with myself \n\nthen make a religious oath to commit to higher purposes",
      "created_utc": 1745915517.0,
      "score": 2
    },
    {
      "id": "mpmm03s",
      "body": "This is a cope for sure. But i am starting to envision a type of life that is enhanced in ways because of no sex, that is actually better because of no sex. \n\nI am actually entertaining pathways where this could be true",
      "created_utc": 1745915995.0,
      "score": 2
    },
    {
      "id": "mhsyvj9",
      "body": "Thank you! Things are definitely looking UP!",
      "created_utc": 1741982227.0,
      "score": 4
    },
    {
      "id": "mhsq59g",
      "body": "I think the rape scene went really well.",
      "created_utc": 1741979636.0,
      "score": 9
    },
    {
      "id": "mhvlu2j",
      "body": "these are amazing lmfao",
      "created_utc": 1742016060.0,
      "score": 2
    },
    {
      "id": "mhq46lx",
      "body": "I wish you all the best on your path. Be kind to yourself, it takes some detours, but a safe harbour can be found at the end ❤️",
      "created_utc": 1741948322.0,
      "score": 8
    },
    {
      "id": "mhublxz",
      "body": "I’m you right now 🥹",
      "created_utc": 1741997555.0,
      "score": 2
    },
    {
      "id": "mhyliiy",
      "body": "I meant something else but I get you lol",
      "created_utc": 1742063394.0,
      "score": 4
    },
    {
      "id": "mhr644p",
      "body": "What's funny is this isn't my first time openly saying I'm a woman, but suddenly when it's sexual related I'm flooded😭",
      "created_utc": 1741963056.0,
      "score": 35
    },
    {
      "id": "mhqzscd",
      "body": "I'm a guy, but what does those guys wants? I guess I can figure it out, but is it that much endemic to reddit? Are they, at least, respectful?",
      "created_utc": 1741961104.0,
      "score": 8
    },
    {
      "id": "mhq4nbe",
      "body": "You’re kind, thank you 😌 life is much better now and I’m a lot happier",
      "created_utc": 1741948574.0,
      "score": 4
    },
    {
      "id": "mhubwpo",
      "body": "Oh sweets, you need to find a way out, which you can do. ❤️ no one is worth the mental turmoil",
      "created_utc": 1741997656.0,
      "score": 2
    },
    {
      "id": "mi02ret",
      "body": "lmao big dick is so good they didn’t even grasp what you meant… ouch",
      "created_utc": 1742080959.0,
      "score": 5
    },
    {
      "id": "mhr5xiw",
      "body": "From my experience typically they are not respectful. They think just because they send their dick it'll make a girl immediately want to have sex for some reason, then proceed to get mad when they decline. What they want? I have no idea lol",
      "created_utc": 1741963000.0,
      "score": 31
    },
    {
      "id": "mhr0yrb",
      "body": "It’s usually a mixed bag",
      "created_utc": 1741961474.0,
      "score": 10
    },
    {
      "id": "mi03bsp",
      "body": "lol it’s tough out here for sure",
      "created_utc": 1742081154.0,
      "score": 3
    },
    {
      "id": "mhrp3qj",
      "body": "Using the words \"mixed bag\" in a thread about dicks conjures up some...interesting imagery lol",
      "created_utc": 1741968600.0,
      "score": 14
    }
  ]
}