{
  "id": "1i6kljq",
  "title": "This country is a fucking disgrace. ",
  "selftext": "We’re really gunna let this fucking happen? We’re so fucking sheepish we don’t care that someone does a nazi salute and someone else doesn’t put their hand on the Bible? I fucking hate it here. Fuck everyone in there. Eat the rich. Burn it all down. ",
  "created_utc": 1737471953.0,
  "score": 10136,
  "num_comments": 1067,
  "url": "https://www.reddit.com/r/offmychest/comments/1i6kljq/this_country_is_a_fucking_disgrace/",
  "comments": [
    {
      "id": "m8d1o8p",
      "body": "I feel like rules are just suggestions at this point",
      "created_utc": 1737473637.0,
      "score": 4016
    },
    {
      "id": "m8d2j2m",
      "body": "I see a lot of complaining on reddit and Luigi memes, but when it's time to act, nobody shows up. I'm not surprised at all. At that point, I'm just preparing myself to watch the world burn. There's nothing else I can do.",
      "created_utc": 1737473888.0,
      "score": 1412
    },
    {
      "id": "m8ejczj",
      "body": "When my parents ask why I don’t want to have kids I tell them to take a look around. How am I supposed to tell them to be good people, act decent, and follow the law when no one in power does?",
      "created_utc": 1737488451.0,
      "score": 74
    },
    {
      "id": "m8dtowt",
      "body": "We should [redacted verb] the [redacted]",
      "created_utc": 1737481477.0,
      "score": 206
    },
    {
      "id": "m8d0pvm",
      "body": "The thing about the Bible doesn't bother me. In fact, I'd rather that it wasn't part of the tradition. It's not a requirement in the Constitution, and he's not the first one to have done it. John Quincy swore the oath on a law book, and Teddy Roosevelt didn't use any book at all. The fact that he swore an oath to protect and defend the Constitution while having shown no inclination to actually do so bothers the hell out of me. \n\nThe Muskrat being a part of the shadow government is also concerning. My main hope there is that he's taking up the spotlight, and our Mediocre Mussolini can't have that, so he'll bench him before too long.",
      "created_utc": 1737473356.0,
      "score": 2494
    },
    {
      "id": "m8dedxd",
      "body": "It really is so concerning seeing the mental gymnastics being used to explain about a nazi salute...literally everything from \"he's autistic and was stimming\" to \"he was throwing his heart out\" to \"it was a roman salute\" instead of ACKNOWLEDGING that it was a hail hitler salute/seig heil...which is illegal to do in several European countries",
      "created_utc": 1737477262.0,
      "score": 332
    },
    {
      "id": "m8d00g7",
      "body": "It’s so fucked up. There is no instance where doing that salute is acceptable in modern times. He’s media trained. He should know that, yet he did it anyway. Fucking Nazis.",
      "created_utc": 1737473147.0,
      "score": 1236
    },
    {
      "id": "m8ddntd",
      "body": "Let? It already happened. \n\nNazi and Confederate flags in the Capitol. Four years ago.  Less than 2 weeks later gop had started the gas lighting. \n\nGame over. The experiment failed.  Rich Nazis are running the US.",
      "created_utc": 1737477060.0,
      "score": 199
    },
    {
      "id": "m8dibjg",
      "body": "something i find ironically hilarious is so many americans believe the entire world functions as dysfunctionally as they do. the wool is fully pulled over their eyes and they’re just… fine with it. no questions asked. they’re fed to believe WE are doing everything right and everyone ELSE is wrong. when in reality, the usa is a joke, and at this point i believe other first world countries actually feel pity for us. not so much the absurdity of it all, but more-so for the laypeople who have no where else to go. \n\nindoctrination is crazy, too. growing up i really believed every other part of the world had to pan for dirty water and sleep in tents, while we americans had the best of everything. that i’d be stupid to ever want to be anywhere else. it’s hilarious to me now, looking back",
      "created_utc": 1737478345.0,
      "score": 290
    },
    {
      "id": "m8ea69q",
      "body": "\nTHIS PERSON FROM CANADA NAILED IT! \nCould not be more clear and concise! \n\n\n\nPaul F Haacker\nHere in Canada I-I, many of us believe we are witnessing the fall of the U.S. empire. Would a civilized country limit health care or food assistance for the poor; leave crops rotting in the fields; destroy the educational system; target women and attempt to eliminate their reproductive rights while refusing to help resulting babies; abuse desperate immigrants; pretend to believe in Christianity while perverting and debasing its tenets; refuse to protect the earth from destruction? The world is watching.",
      "created_utc": 1737485947.0,
      "score": 113
    },
    {
      "id": "m8dh325",
      "body": "The fuck around phase is immediately followed by the find out phase.",
      "created_utc": 1737478007.0,
      "score": 56
    },
    {
      "id": "m8dpngn",
      "body": "I think the real sad part is a lot of Americans actually cheer him on for that. I should ask my grandma now how she feels about Elon. During Christmas she said “you know who I really like, that Elon guy” WHY!? HE IS NOT EVEN SUPPOSED TO BE A POLITICAL FIGURE.  Yet here we are.",
      "created_utc": 1737480368.0,
      "score": 125
    },
    {
      "id": "m8d20w3",
      "body": "I’m British and our politics are by no means perfect, but Jesus, a rapist? What was the appeal for this clown?",
      "created_utc": 1737473740.0,
      "score": 349
    },
    {
      "id": "m8czbsw",
      "body": "All political opinions aside, I adore the fact that the Bible was not involved. \"separation of church and state\" needs to to actually have some meaning - not just be something we say because it sounds good",
      "created_utc": 1737472942.0,
      "score": 354
    },
    {
      "id": "m8d1llc",
      "body": "My thing is that I don't know what to do. \n\nIt's like I'm just stuck watching.",
      "created_utc": 1737473615.0,
      "score": 100
    },
    {
      "id": "m8d9em0",
      "body": "Why do we even use a bible? Kinda dumb.",
      "created_utc": 1737475862.0,
      "score": 68
    },
    {
      "id": "m8e32j5",
      "body": "I have this feeling that the rest of the world sees the US like the US sees Russia.......and that's unfortunate for American citizens that travel to foreign countries and hear it.",
      "created_utc": 1737484023.0,
      "score": 35
    },
    {
      "id": "m8d96dz",
      "body": "Nobody around me is as upset as me and it makes it 10x harder. It’s like everyone cares online in secret rather than out loud to their peers.",
      "created_utc": 1737475796.0,
      "score": 51
    },
    {
      "id": "m8donrf",
      "body": "The bible thing is correct. They should put their hand on a US flag or the constitution. They shouldn't be upholding a religion, they should serve the nation that they are the leader of. Imagine if he put his hand on the Qur'an.  Same god, wrong book. ",
      "created_utc": 1737480098.0,
      "score": 48
    },
    {
      "id": "m8fekvz",
      "body": "when the rich can get away with rape in this country by paying off the county it makes me disgusted to be here.",
      "created_utc": 1737496911.0,
      "score": 16
    },
    {
      "id": "m8gy65s",
      "body": "As a non American looking in, we’re all confused as to how as a nation you all fought so hard to gain independence from a king, but then subsequently created a form of government that allows God Emperor powers to one man.",
      "created_utc": 1737514166.0,
      "score": 15
    },
    {
      "id": "m8d0pa7",
      "body": "People voted for it in mass. Which is the worst part of all it. People were told and warned",
      "created_utc": 1737473351.0,
      "score": 163
    },
    {
      "id": "m8do9e2",
      "body": "It’s diseased. The incurable kind.",
      "created_utc": 1737479989.0,
      "score": 16
    },
    {
      "id": "m8dfzuv",
      "body": "Looks like a handmaid's tale is coming true, America is close to imploding",
      "created_utc": 1737477708.0,
      "score": 34
    },
    {
      "id": "m8dtd8m",
      "body": "Honestly, the worst part of the nazi salute, is the various reporting doesn't just call it a nazi salute. Thats a huge part of the problem. Watering down all the crazy stuff thats happening.",
      "created_utc": 1737481388.0,
      "score": 37
    },
    {
      "id": "m8fxurw",
      "body": "Two things I want to address:\n\n1) Anyone brushing off the salute is either a joke and/or nazi-sympathizer, or are in disbelief\n\n2) While I know you did not make a claim about this being a law that requires it, a hand on the bible or not is not required by law. You can be sworn in with any piece of literature you would like, specifically because of the notion of separation of Church and State. IIRC, there was even a congress member a few years ago sworn in on a Superman comic.\n\nAlso, take time to recover from the mental shock this is causing you. This is directed both to OP and anyone reading this, btw. \n\nOnce you recover, educate yourself, teach others, and organize.\n\n1) educate yourself on issues important to yourself, whether it be stuff that directly affects you or those you love.\n\n2) teach others on these topics, whether it be through sharing the media you learned through or sitting down and having a conversation with them.\n\n3) either join local political action groups or start a political action yourself. Feed the homeless, disperse informational pamphlets, whatever you think helps indeed helps.\n\nTake care of yourself and your community, and we Americans will survive.",
      "created_utc": 1737502611.0,
      "score": 12
    },
    {
      "id": "m8dnviv",
      "body": "America is loves bashing other country to look bad but America has the highest homeless percentage compared to other countries \n\nAmerica is just a third world country under 5 gucci belt",
      "created_utc": 1737479882.0,
      "score": 32
    },
    {
      "id": "m8f5518",
      "body": "The US are a joke and I am honestly confused as to how stupid it is. Guns are common there but it took years before one man had the courage to act against rich people actively killing thousands. Now he's in jail and I see no manifestations at all? How? Not only that but the whole religion there seems really off. It is pure indoctrination, most people seemingly never even read the book they claim to live by.",
      "created_utc": 1737494371.0,
      "score": 18
    },
    {
      "id": "m8db5vp",
      "body": "This is the time we need to be checking in on our friends. I know we're all hurting. We're angry. I'm right there with you. But hold onto that anger. It's a collective buzz that can only turn into a roar. You are loved. You are cherished. Please don't lose hope.",
      "created_utc": 1737476362.0,
      "score": 17
    },
    {
      "id": "m8d3zzz",
      "body": "Definitely eat the rich. But how do we mobilize to take down the rich? That what I want to know.",
      "created_utc": 1737474315.0,
      "score": 43
    },
    {
      "id": "m8dr87q",
      "body": "Imagine how non-Americans have been feeling the last few decades 😬",
      "created_utc": 1737480802.0,
      "score": 17
    },
    {
      "id": "m8dkrxs",
      "body": "What are you planning to do with your anger?",
      "created_utc": 1737479023.0,
      "score": 9
    },
    {
      "id": "m8e2b85",
      "body": "The social media platforms, CEO, and journalists have all decided to just give up on any effort to hold him accountable. Might be too late for democracy",
      "created_utc": 1737483819.0,
      "score": 7
    },
    {
      "id": "m8cyzd4",
      "body": "[removed]",
      "created_utc": 1737472839.0,
      "score": 102
    },
    {
      "id": "m8d9i5y",
      "body": "You muricans need to take elections more seriously, WTF?",
      "created_utc": 1737475891.0,
      "score": 34
    },
    {
      "id": "m8czlfu",
      "body": "If you people think god is who’s gonna fix this country……have y’all not been paying attention?",
      "created_utc": 1737473023.0,
      "score": 46
    },
    {
      "id": "m8f25ag",
      "body": "If the system was designed to punish bad people and reward good people we wouldn’t be here right now.",
      "created_utc": 1737493560.0,
      "score": 7
    },
    {
      "id": "m8f2fx1",
      "body": "I mean, what can we actually do though? Like realistically? What can realistically be done about this. Courts are stacked in his favor, congress and the senate are stacked in his favor.",
      "created_utc": 1737493639.0,
      "score": 7
    },
    {
      "id": "m8f0dij",
      "body": "Over 70 million people voted for him. Well over 130 million people didn't vote, and through apathy, also, allowed this to happen.",
      "created_utc": 1737493084.0,
      "score": 13
    },
    {
      "id": "m8dcihe",
      "body": "The truly scary thing is hearing the new president say he was \"saved by God.\"\n\nUntil we Americans fully comprehend and experience the colossal grift that will inevitably follow, it will continue.\n\nI just hope I can actually vote for a president in 2028.",
      "created_utc": 1737476738.0,
      "score": 18
    },
    {
      "id": "m8de8ld",
      "body": "Its crazy beyond belief… how can someone who broke the laws ( multiple)  and the constitution and straight up lied over and over be our leader? And everyone is just cheering him on? I DONT UNDERSTAND",
      "created_utc": 1737477221.0,
      "score": 11
    },
    {
      "id": "m8e4jod",
      "body": "It kinda seems like a mass instance of the bystander effect. Like an entire society suffering the bystander effect.",
      "created_utc": 1737484422.0,
      "score": 11
    },
    {
      "id": "m8ffken",
      "body": "I remember my friend talking about how the government was corrupt all the way back in middle school, and my response was always “no the government is here to help us, and we would never choose anyone bad to be president!”  Boy how wrong my lil ass was.",
      "created_utc": 1737497184.0,
      "score": 12
    },
    {
      "id": "m8fmtza",
      "body": "Someone did the nazi salute? I'm so fucking done with American politics that I don't even keep up with what's going on now. \n\nThis inauguration happening on Martin Luther King Day is a joke. This whole thing is a fucking joke. I'm tuning it all out.",
      "created_utc": 1737499258.0,
      "score": 10
    },
    {
      "id": "m8e77ju",
      "body": "The US constitution had been removed from the white house website.\n\nPeople should have voted!",
      "created_utc": 1737485146.0,
      "score": 14
    },
    {
      "id": "m8d0bn4",
      "body": "yeah it is a disgrace but unfortunately I don't see people rushing out to defend their freedoms. a lot will probably bury their heads in the sand, another set will be cheering and yet still more will be talking about how the country sucks but won't take any action for fear of reprisal by a fascist oligarchy \n\nso unfortunately, we're here and I don't see that changing. It's possible that enough of our citizens wake up in the coming years and organize and decide to fight back but in the immediate, I don't see it happening",
      "created_utc": 1737473239.0,
      "score": 25
    },
    {
      "id": "m8d2psu",
      "body": "It blows my mind that people would rather have these fucking losers in power than flourish and have a positive outlook at a future, the chance of progressing as a nation. In a matter of moments they have made life for everyone worse. I hope it’s worth it for you. Unbelievable",
      "created_utc": 1737473943.0,
      "score": 30
    },
    {
      "id": "m8dap8c",
      "body": "Everyone loves the idea of not touching the Bible, but they're actively pushing religious rhetoric or vaguely disguising the religion in policies. One time does not mean they finally understand to separate the church from the state when they're still gonna do it.",
      "created_utc": 1737476232.0,
      "score": 5
    },
    {
      "id": "m8e7nvy",
      "body": "Tru. I fuckin hate this place and [most of] it's people.",
      "created_utc": 1737485269.0,
      "score": 4
    },
    {
      "id": "m8ebeyb",
      "body": "First time?",
      "created_utc": 1737486286.0,
      "score": 6
    },
    {
      "id": "m8gij78",
      "body": "Agreed.  Makes me fully feel the saying \"love my country, hate my government\". We still have so much beautiful culture worth protecting but those in power seem to have a complete and utter disregard for humanity and well-being",
      "created_utc": 1737509095.0,
      "score": 5
    },
    {
      "id": "m8hb8b5",
      "body": "Honestly i’m sick to my stomach. I wish I was a dual citizen so I could flee!",
      "created_utc": 1737518728.0,
      "score": 6
    },
    {
      "id": "m8dtsif",
      "body": "Vows to protect and defend the constitution, then same day signs an order attempting to recind birthright citizenship. WTF!?",
      "created_utc": 1737481504.0,
      "score": 11
    },
    {
      "id": "m8dc0xt",
      "body": "Jesus is like Santa for adults , he is there to make them behave . Gives adults something to belive in to make them selfs feel better .",
      "created_utc": 1737476603.0,
      "score": 20
    },
    {
      "id": "m8dimbk",
      "body": "Me too seriously fuck him and anyone that voted for this",
      "created_utc": 1737478426.0,
      "score": 16
    },
    {
      "id": "m8e7xyd",
      "body": "wake up samurai…",
      "created_utc": 1737485345.0,
      "score": 4
    },
    {
      "id": "m8er42i",
      "body": "It’s time to organize, make a community, then talk to other communities. It’s time Americans act like Americans and try to change this country for all of us",
      "created_utc": 1737490569.0,
      "score": 4
    },
    {
      "id": "m8esvli",
      "body": "Well said",
      "created_utc": 1737491057.0,
      "score": 5
    },
    {
      "id": "m8f2dhv",
      "body": "I think there is a very big difference between giving Nazis salutes, and not putting your hand on the Bible. One definitely means that you're a horrible person and one is an expression of religious preference.",
      "created_utc": 1737493622.0,
      "score": 4
    },
    {
      "id": "m8hevk3",
      "body": "Yeah we're like completely fucked just 100% Fucked.",
      "created_utc": 1737520124.0,
      "score": 2
    },
    {
      "id": "m8ld0sp",
      "body": "Been thinking how to get myself deported without putting my family at risk. We are all legal. Been waiting 8 years for the asylum appointment. I know it’s never happening and I’m stuck in here without a passport and without a way to renew it due to having no embassy here. I just want to leave this shithole country because I know it only gets worse from there. People are defending these awful actions with “he has autism” yeah I have autism too. My dad does too. We don’t go out saluting like that, if anything we just have really awkward conversations. It sucks and it sad that people are refusing to see that we are being played out like fools. All empty promises and it’s all downhill from here.",
      "created_utc": 1737575001.0,
      "score": 4
    },
    {
      "id": "m8eit6y",
      "body": "> We’re so fucking sheepish we don’t care that someone does a nazi salute and someone else doesn’t put their hand on the Bible\n\nIt's been VERY clear to me for quite some time that this is exactly who the United States is.  I am somewhat bewildered why you are so suprised?",
      "created_utc": 1737488303.0,
      "score": 9
    },
    {
      "id": "m8es1a7",
      "body": "Built on the raves of the native Americans it was doomed from the inception. We are in a Modern day Marie Antoinette situation.",
      "created_utc": 1737490826.0,
      "score": 6
    },
    {
      "id": "m8du1er",
      "body": "Stole the words right out of my mouth. I feel sick",
      "created_utc": 1737481571.0,
      "score": 10
    },
    {
      "id": "m8g5p5y",
      "body": " if you could go back in time, what would you do? Everyone always says 'kill hitler'. Where are those people now?",
      "created_utc": 1737505106.0,
      "score": 3
    },
    {
      "id": "m8gid3w",
      "body": "Can't believe people are arguing in his defence, my own boyfriend said he thinks it was a mistake and that Elon's too clever to do that on stage...\n\nI think people don't want to believe what's happening before their own eyes.",
      "created_utc": 1737509042.0,
      "score": 3
    },
    {
      "id": "m8gr48o",
      "body": "The problem is BOTH “sides” fully believes the other is lying. And we all stay stuck in limbo. Reality is? They’re all liars and the house needs to wiped clean. Not just insert one side with the other. It’s OUR country, not theirs",
      "created_utc": 1737511844.0,
      "score": 3
    },
    {
      "id": "m8h59x8",
      "body": "Fuck the supreme court \n\nFuck EM!!!!!!",
      "created_utc": 1737516574.0,
      "score": 3
    },
    {
      "id": "m8hd48v",
      "body": "I get the feeling that you’re upset.",
      "created_utc": 1737519444.0,
      "score": 3
    },
    {
      "id": "m8in2xl",
      "body": "The ONLY thing about the whole inauguration that didn’t bother me was the Bible thing. \n\nThe separation of church and state exists for a reason. Swear an oath with your hand on an American flag, or the constitution, or even a law book. Swearing on the Bible is just kinda weird, since religion isn’t supposed to be political. (Or is it? Idk)",
      "created_utc": 1737543898.0,
      "score": 3
    },
    {
      "id": "m8it0fx",
      "body": "I've hated this country since November 5th. The day we literally let a low life felon back in the white house, just because groceries. 🙄🙄🙄",
      "created_utc": 1737547025.0,
      "score": 3
    },
    {
      "id": "m8l7t4f",
      "body": "No hands on \"The bible\" is not the problem... The fact that so many voted a dangerous man with his nazi party buddies to be president is the problem.",
      "created_utc": 1737573610.0,
      "score": 3
    },
    {
      "id": "m8e3bb9",
      "body": "Could someone explain to me why Americans aren’t protesting/revolting? \nThis is in no way judgement, but I have always been impressed by their civil rights movement. Obviously it hasn’t fixed everything, but it was a movement against powerful, prejudiced people and they still made it through. There seems enough anger, desperation and outrage for another movement but there just isn’t. I thought it could be the threat of guns, but they had guns back in the civil right movement as well.",
      "created_utc": 1737484088.0,
      "score": 5
    },
    {
      "id": "m8eo3yl",
      "body": "I don't want to be here anymore. It's just too much, this can't be real life",
      "created_utc": 1737489740.0,
      "score": 6
    },
    {
      "id": "m8hrm67",
      "body": "And fuck him for removing the us from Paris agreement & World Health Organization. \n\nParis agreement isn’t even about stopping climate change anymore. It’s about preparing for the future & adapting for it. There’s gonna be climage refugees & food shortages etc. \n\nThe WHO has done questionable things, but pulling out right when we are on the horizon for a few potential pandemics happening within the next 4 years, is incredibly foolish. \n\nFucking dumbass",
      "created_utc": 1737525674.0,
      "score": 4
    },
    {
      "id": "m8dvadw",
      "body": "What do you want me to do bro? I’ve tried every nonviolent solution. It’s time we revolt at this point.",
      "created_utc": 1737481910.0,
      "score": 6
    },
    {
      "id": "m8d3g95",
      "body": "The first time I felt sorry for the US. This time any sympathy is gone. A country gets the president it deserves. We warned them and still they chose to go back to the equivalent of an alcoholic, drug addicted, cheating ex boyfriend. Now the US must face the consequences and I just shrug over the stupidity.",
      "created_utc": 1737474158.0,
      "score": 16
    },
    {
      "id": "m8efk1j",
      "body": "Now we look forward to the news of another billionaire getting wacked.",
      "created_utc": 1737487420.0,
      "score": 4
    },
    {
      "id": "m8fcza5",
      "body": "I truly don’t understand people who voted him…",
      "created_utc": 1737496481.0,
      "score": 5
    },
    {
      "id": "m8d8nix",
      "body": "Guys, I'm Brazilian and I tell you here in Brazil we see you doing a lot of shit in your sick country. such as, for example, forgiving a good part of the top brass and Nazi scientists and taking them into your country and worse, putting them in positions at the NASA MIT, etc. As if that wasn't enough, you have fascist and hateful speeches disguised as freedom of expression, so for us in the global south it was obvious that this would happen at some point with the USA, in this case you Americans didn't see this coming, a large part because you are manipulated by the media and your government about this, about China, about how other countries are and work in general. Like in Brazil, healthcare and education are free, including universities.",
      "created_utc": 1737475645.0,
      "score": 9
    },
    {
      "id": "m8d6nww",
      "body": "Yeah, it's so crazy talking to the guys I have interest in just to see them apathetic and uncaring because it doesn't stop their day. I don't know if the younger generations are just so self-involved or what. I date younger men but this is super privileged and disturbing.\nClimate change affects every single being in the world. This is all problematic for me. It's honestly repellent. Selfishness is not a trait I am attracted to. How anyone doesn't care we exist under a fascist regime where a billionaire gets on stage and does a Nazi salute to our new President is truly deranged.",
      "created_utc": 1737475077.0,
      "score": 6
    },
    {
      "id": "m8duqci",
      "body": "The Bible thing is a distraction. It’s going off the hook kleptocracy and everyone’s rights are diminished, health outcomes will plummet further (US is arguably not at first world standards), and everyone but the 1% will be far worse off. We’re on the brink of prison camps, mass roundups, and leaving the World Health Organization and Paris Climate Agreement. Democracy as we know it effectively dead and Nazis have taken over. \n\nWho gives a shit about a magic book when so much horror is being implemented?? Keep your eyes on the prize and don’t fall for simplistic distractions in faux minutiae.",
      "created_utc": 1737481759.0,
      "score": 4
    },
    {
      "id": "m8e9qd6",
      "body": "Why would anyone have to put their hand on a Bible? The US has no state religion. It’s in the 1st Amendment.\n\nNo one ever has to swear on a Bible in the US unless they choose to.",
      "created_utc": 1737485825.0,
      "score": 2
    },
    {
      "id": "m8glrj0",
      "body": "Something is gonna happen. After what just happened, I'm sure the next president can pardon everyone needed.",
      "created_utc": 1737510117.0,
      "score": 2
    },
    {
      "id": "m8gro18",
      "body": "Im just waiting to play fallout in real life, anytime soon i swear...",
      "created_utc": 1737512024.0,
      "score": 2
    },
    {
      "id": "m8h2c5d",
      "body": "Yeah, America is gonna collapse by the end of the century.  Thank God we’re still off from when the real shit starts to hit the fan.  By the end of these four years, may be a completely different story.",
      "created_utc": 1737515559.0,
      "score": 2
    },
    {
      "id": "m8h66lk",
      "body": "Why would he touch it?  No one paid him to sign it. /S",
      "created_utc": 1737516895.0,
      "score": 2
    },
    {
      "id": "m8h7fan",
      "body": "I wouldn't have cared about the Bible thing if it wasn't the \"rebirth of jesus\" or wtv they say",
      "created_utc": 1737517336.0,
      "score": 2
    },
    {
      "id": "m8hagu2",
      "body": "Yeah I feel like everyone who isn't a white male id gonna die or gt put in a camp. I'm extremely scared. Everyone on he right is treating it like a joke..",
      "created_utc": 1737518444.0,
      "score": 2
    },
    {
      "id": "m8hfati",
      "body": "What is mind blowing to me is that people love these clowns, and are totally blinded… \nDuring his speech he said that California was hacked at the ballot offices and we should be a red state… \nAnybody that has daughters should move to a blue state. \nI also learned that a family I’ve been caring for a long time that they are republicans and they have all young girls for children.",
      "created_utc": 1737520290.0,
      "score": 2
    },
    {
      "id": "m8hlqmh",
      "body": "The sad thing is we let them win we fucking rolled out the fucking carpet for it all to happen because we put faith in systems that were made by people like them to support their interests we were complacent george Carlin was fucking right and his best punchline is he's laughing from the grave We. Are. Fucked.",
      "created_utc": 1737522960.0,
      "score": 2
    },
    {
      "id": "m8hs3pr",
      "body": "Remember, the constitution says we can overthrow the government.",
      "created_utc": 1737525914.0,
      "score": 2
    },
    {
      "id": "m8i0wit",
      "body": "I’ve been sticking my head in the sand lately, can someone please tell me what happened?",
      "created_utc": 1737530566.0,
      "score": 2
    },
    {
      "id": "m8i5f7m",
      "body": "Brother, are you surprised? I feel the same but honestly nothing will happen. When they banned TT, I was waiting for protests, for something to happen. Nothing, absolutely nothing happened and probably nothing will, sadly. I would be the first on the line when that happens. But what it took? To give back TT with the control of the gov. And everyone forgot about everything else.",
      "created_utc": 1737533165.0,
      "score": 2
    },
    {
      "id": "m8ihdmd",
      "body": "Rules and laws only apply to keep us small people in line. And no one is going to do anything about it because they don’t want to give up the money they make by putting those clowns in office. And we aren’t going to do anything as a nation because what can we do? I have chosen to participate in boycotting a lot of businesses that back them and I refuse to watch anything about them because I will not contribute to their ratings. But that’s what I can do in my little world",
      "created_utc": 1737540560.0,
      "score": 2
    },
    {
      "id": "m8iism3",
      "body": "what country?",
      "created_utc": 1737541402.0,
      "score": 2
    },
    {
      "id": "m8j1gb9",
      "body": "Is Reddit a country now? Loads of countries are shite at the moment",
      "created_utc": 1737550756.0,
      "score": 2
    },
    {
      "id": "m8jlviu",
      "body": "The Bible needs to be removed from the oath and court anyhow. So ridiculous.",
      "created_utc": 1737557753.0,
      "score": 2
    },
    {
      "id": "m8lchu8",
      "body": "I never thought I'd see supposedly republicans voting in a south African shadow president🤔 the world is gone a funny place",
      "created_utc": 1737574860.0,
      "score": 2
    },
    {
      "id": "m8lj88t",
      "body": "The hand on the Bible is nothing. I don't believe in swearing on fairy tales either. But the nazi salute? Twice?? That's some bullshit.",
      "created_utc": 1737576666.0,
      "score": 2
    },
    {
      "id": "m8llboj",
      "body": "We need to organize.",
      "created_utc": 1737577243.0,
      "score": 2
    },
    {
      "id": "m8n6nlk",
      "body": "You are just now figuring this out? You want to read a great book? It’s called “A people’s history of the United States.",
      "created_utc": 1737594077.0,
      "score": 2
    },
    {
      "id": "m8o7x1y",
      "body": "i agree. what this world has come to is terrifying and the fact that for most of us all we do is sit here and watch. I cannot wait for these 4 years to be over",
      "created_utc": 1737606936.0,
      "score": 2
    },
    {
      "id": "m8ppcsk",
      "body": "When I was younger I wanted to move to the US, but now I wouldn’t ever even consider it as an European. Sure we have our own issues, but not on that level of reproductive rights being taken away, constant mass shootings and this super scary political theater",
      "created_utc": 1737635768.0,
      "score": 2
    },
    {
      "id": "m94nvbe",
      "body": "We Need Bane😈😏🔥",
      "created_utc": 1737829069.0,
      "score": 2
    },
    {
      "id": "m8d3f7m",
      "body": "Im from outside of the US, wondering if there anyone that can do something if the president do some stupid shit? For example other country might have opposition political party that could get together and Impeach elected president, how does it work if you only have 2 political party",
      "created_utc": 1737474149.0,
      "score": 5
    },
    {
      "id": "m8e1os8",
      "body": "I don't care for religion but I don't like him as a person. Hypothetically He could be the best we need but he brings out the worst in people. Specially racism. But I'll never know because he's a terrible person",
      "created_utc": 1737483650.0,
      "score": 4
    },
    {
      "id": "m8ea7hd",
      "body": "Which country?",
      "created_utc": 1737485955.0,
      "score": 4
    },
    {
      "id": "m8eccnh",
      "body": "As long as you're rich, the rules don't apply and you can get away with anything in the open. It's like the public doesn't even care anymore.",
      "created_utc": 1737486543.0,
      "score": 2
    },
    {
      "id": "m8ee91n",
      "body": "We’re too comfortable to take action",
      "created_utc": 1737487064.0,
      "score": 3
    },
    {
      "id": "m8f3xvq",
      "body": "But he was voted in by the American people and he was pretty clear what he was going to do, and suprise he's doing what he said he would.",
      "created_utc": 1737494044.0,
      "score": 4
    },
    {
      "id": "m8feafe",
      "body": "“bUt iT wAs A rOmAN saLutE”",
      "created_utc": 1737496833.0,
      "score": 3
    },
    {
      "id": "m8g1cuu",
      "body": "Half the country is denying it even happened. Brainwashed cultists.",
      "created_utc": 1737503717.0,
      "score": 3
    },
    {
      "id": "m8g1wvx",
      "body": "Revolution is in order",
      "created_utc": 1737503895.0,
      "score": 2
    },
    {
      "id": "m8g54es",
      "body": "It really does feel like a really bad episode of black mirror and it’s outrageous people don’t see these things, like we are all collectively watching the same things happening at the same time.. and yet, they don’t care. I can completely understand how cults could happen now",
      "created_utc": 1737504925.0,
      "score": 3
    },
    {
      "id": "m8gqdd4",
      "body": "The worst part is people are so fucking willfully ignorant. This country could burn to ashes and they would still find stupid fucking ways to defend these nazis. The truth is literally right there but they just refuse to see it even if it means putting the rest of us in danger.",
      "created_utc": 1737511602.0,
      "score": 3
    },
    {
      "id": "m8lrrsn",
      "body": "I'm an American living overseas in the UK. It's been wild seeing the US from an outside perspective. Embarrassing, really.",
      "created_utc": 1737578971.0,
      "score": 3
    },
    {
      "id": "m8daego",
      "body": "Which country OP? There are several shitty leaders around the world.",
      "created_utc": 1737476147.0,
      "score": 5
    },
    {
      "id": "m8enow2",
      "body": "Didnt you guys honor a Nazi veteran?",
      "created_utc": 1737489625.0,
      "score": 5
    },
    {
      "id": "m8dh3mr",
      "body": "What bothers me the most right now is how they were clearly disguising their fear of people sharing their collective outrage about media coverage regarding Israel/ Palestine and Luigi Mangione as some Chinese Security breach, pulling the app, and then restoring it with increased censorship and expecting us to kiss their feet\n\nYOU CENSORED THE ONLY APP THAT GAVE US THE CLOSEST SEMBLANCE OF FREE SPEECH THE YOUNGER GENERATION HAS EVER EXPERIENCED AND YOU WANT US TO FALL TO OUR KNEES TO GROVEL AND PRAISE YOU???",
      "created_utc": 1737478011.0,
      "score": 2
    },
    {
      "id": "m8fr5iy",
      "body": "This I fear will birth new extremists, from one side resisting at first, then the other \"stepping up to do their patriotic duty\". This oligarchy we saw in attendance will do the 99% of people no favors, bring no prosperity unless it comes in the form of bounties when shit finally snaps and derails. America is brainwashed on both sides at this point and way to polarized. Unfortunately while both extremes pose a threat I fear one side is more blood thirsty and better equipped for culling/suppressing the other. America got to comfortable in it's prosperity these past 4-5 generations and let politicians and corporations run wild, and the whiplash effect turned people into all forms of weirdos it getting weirder the further into to either side you go.\n\nPeople forgot how to be part of a community, and genuine functional community and focused to much on themselves and pushing their beliefs on others (both sides are guilty of this). People forgot how to listen and recognize that even though it's not their plight or their problem to help their fellow human.",
      "created_utc": 1737500538.0,
      "score": 3
    },
    {
      "id": "m8dfhzq",
      "body": "> We’re really gunna let this fucking happen? \n\nYes. Yes, you are.\n\nI mean take yourself for example. You've thrown a tantrum on Reddit. That's it. What's that going to accomplish? \n\nYou country is cooked and apparently wants to take some others with it.",
      "created_utc": 1737477572.0,
      "score": 8
    },
    {
      "id": "m8ekyzt",
      "body": "Organize mobilize and win. 756 billionaires vs 340,000,000 fed up citizens. It will take some effort,  some are too busy with OF and other bs distractions or they feel they’re better off than those of us struggling. Obviously we’re not part of the plan other than to be used and discarded. I think the representation in the front row at the inauguration is telling that the government has lost its way they’re not for the people but for the billionaires. Most fiscal policy post 2008 is driven by the financial  elites. At the expense of everyone not in the top 1%. We have to take the blinders off we are constantly lied to on purpose!",
      "created_utc": 1737488889.0,
      "score": 3
    },
    {
      "id": "m8gvfd5",
      "body": "Then leave if you're so mad",
      "created_utc": 1737513263.0,
      "score": 3
    },
    {
      "id": "m8ekwuf",
      "body": "This isn't a country, it's the internet.",
      "created_utc": 1737488872.0,
      "score": 4
    },
    {
      "id": "m8edol9",
      "body": "Come to India bhai , you will love America ❤️",
      "created_utc": 1737486909.0,
      "score": 2
    },
    {
      "id": "m8f1iky",
      "body": "yeah let’s not burn it all down",
      "created_utc": 1737493391.0,
      "score": 2
    },
    {
      "id": "m8g0utk",
      "body": "I just bought the Demon Haunted World book by Carl Sagan. Before it suspiciously disappears for spilling the truth of the world. I moved from America to Japan in 2016 right before he was elected in the first time. I will likely never come back. Which saddens me, because it’s a place I SHOULD feel safe, but don’t.",
      "created_utc": 1737503557.0,
      "score": 2
    },
    {
      "id": "m8g2nm8",
      "body": "I'm smelling lots of Luigi's coming in the next years. America is gonna be shitshow for the next 4 years. Honestly I wish it would be the only country right now but sadly it happens now everywhere.",
      "created_utc": 1737504138.0,
      "score": 2
    },
    {
      "id": "m8g70z3",
      "body": "That Nazi/Roman salute wasn't appropriate, but the Bible shouldn't be a part of the government anyway. 90% of the people who have sworn on a Bible do not believe in Judiasm, Christianity, etc. They put their hand on the book because they're expected to\n\nDo you want Islamic nations involving their religion in government? No? But we can promote Christ based faiths? Hypocrisy in America, as usual",
      "created_utc": 1737505512.0,
      "score": 2
    },
    {
      "id": "m8g89e2",
      "body": "💯",
      "created_utc": 1737505891.0,
      "score": 2
    },
    {
      "id": "m8iuet7",
      "body": "To be fair, the \"nazi\" is autistic enough to accidentally do a hand sign without thinking, and it was not a by the book salute to definitively say it was intended to be one. In fact, I've seen people hailing cabs on the street for years with the exact same angle he used. \n\nAlso, it's considered a sin in most forms of Christianity to swear on the bible.\n\nEither way, 99% of these small things people focus on are just demonizing viewpoints based on already biased opinions of the person. Like when people immediately said one person had dementia or when somebody was accused online of being evil based on their laugh. The worst part is these veiwpoints have almost nothing to do with people in reality, but what color they stand under. \n\nWhat I'm saying is that the party system should be demolished before Tribalism tears the country apart.",
      "created_utc": 1737547702.0,
      "score": 2
    },
    {
      "id": "m8eop3s",
      "body": "U can leave ?",
      "created_utc": 1737489901.0,
      "score": 3
    },
    {
      "id": "m8d04ep",
      "body": "Yes",
      "created_utc": 1737473179.0,
      "score": 1
    },
    {
      "id": "m8j62hx",
      "body": "I think he was doing the roman salute, and if you never served especially infantry and been in 4 tours. I think saying this country is a disgrace if you really never did anything for it to make it better.🤙",
      "created_utc": 1737552510.0,
      "score": 1
    },
    {
      "id": "m8e9tww",
      "body": "You know America isn't the centre of the world and there are people from other countries that use the platform, but I might as well piss in the wind than try and tell an American they are not the centre of the universe",
      "created_utc": 1737485853.0,
      "score": 2
    },
    {
      "id": "m8ddcg1",
      "body": "This is what someone does when they have nothing better to do. They hyperfocus on something that has no effect on their life, play the victim of a third world country under tyranny.",
      "created_utc": 1737476970.0,
      "score": 1
    },
    {
      "id": "m8fcoax",
      "body": "anyone else download rednote (xiaohongshu) and learn how poor, sad and smallminded we really are?",
      "created_utc": 1737496398.0,
      "score": 3
    },
    {
      "id": "m8ho03p",
      "body": "I’d call it a stretch on Musk doing a Nazi Salute. He grabbed his chest and attempted to “throw” his heart out. Or it’s implied by him literally saying “I throw my heart out” in the next second after it..so yeah",
      "created_utc": 1737523967.0,
      "score": 2
    },
    {
      "id": "m8e9re6",
      "body": "If i had my choice i would move to Norway or Scotland its not any better in Canada im afraid i feel burned after my NDP vote went to JT cause NDP didn’t have enough seats filled so fun to know who you elect for that vote will get pushed elsewhere",
      "created_utc": 1737485833.0,
      "score": 1
    },
    {
      "id": "m8edyie",
      "body": "Really, hand on the bible is the part that bothers you lol",
      "created_utc": 1737486984.0,
      "score": 1
    },
    {
      "id": "m8egvn3",
      "body": "I mean it already happened. I’m not surprised at all. Protect yourself the next four years and don’t let these people suck away your joy.",
      "created_utc": 1737487778.0,
      "score": 1
    },
    {
      "id": "m8h2awg",
      "body": "All empires fall. It’s America’s time now.",
      "created_utc": 1737515547.0,
      "score": 1
    },
    {
      "id": "m8h32ea",
      "body": "Yeah I'm alot more religious in that extant we need to be free to the good people not the evil who want to permeat our society and tell us what's ok and what not. Especially for children.",
      "created_utc": 1737515809.0,
      "score": 1
    },
    {
      "id": "m8h6zb7",
      "body": "Okay? You Americans need to fucking do something about it then, because you sure as fuck didn’t get out to vote.",
      "created_utc": 1737517181.0,
      "score": 1
    },
    {
      "id": "m8h7du9",
      "body": "As a non American, genuine question: do you guys see a revolution happening in the future? Every time I think things can’t get worse for you guys, the oligarchs and capitalist overlords in power prove me wrong.\n\nI’m actually pissed off on behalf of you guys. Were I in your position, I would’ve started looking for pockets of resistance to lend my support to",
      "created_utc": 1737517322.0,
      "score": 1
    },
    {
      "id": "m8h8ktf",
      "body": "The only solace I’m taking is in my mind thinking about him and Dump participating in other ancient Roman traditions such as gay sex. Nothing wrong with it but it makes me giggle. \n\nIt was exactly what we saw. And disgusting.",
      "created_utc": 1737517751.0,
      "score": 1
    },
    {
      "id": "m8hgm5e",
      "body": "We’ve almost always been to be fair",
      "created_utc": 1737520808.0,
      "score": 1
    },
    {
      "id": "m8hk4gb",
      "body": "i mean.. why dont you do something about it?",
      "created_utc": 1737522263.0,
      "score": 1
    },
    {
      "id": "m8htz9r",
      "body": "No one wants to die for America. People fought and died in the '50s and 60s only to end up right back here less than 80 yrs later.\n\nNo thanks. America isn't worth it. These SOBs are not worth it. 🤷🏾‍♀️",
      "created_utc": 1737526863.0,
      "score": 1
    },
    {
      "id": "m8i1nsl",
      "body": "Oh I didn’t see anything of that happen I mean yea a random person doing a nazi salute and not putting their hand on a Bible probably has happened today in denmark",
      "created_utc": 1737530997.0,
      "score": 1
    },
    {
      "id": "m8i9vr5",
      "body": "It has been for a while, you just realized?",
      "created_utc": 1737535889.0,
      "score": 1
    },
    {
      "id": "m8ihmju",
      "body": "Time to become a international nomad",
      "created_utc": 1737540709.0,
      "score": 1
    },
    {
      "id": "m8ii3ns",
      "body": "I thought we separated church from the government?",
      "created_utc": 1737540989.0,
      "score": 1
    },
    {
      "id": "m8ik9lc",
      "body": "We need to do something. How people can organize I dont know. But I’m so fucking tired of just talking when this shit keeps getting worse. But I don’t know what to do. Nothings organized that I’ve heard of. How bad will it get before things change?",
      "created_utc": 1737542282.0,
      "score": 1
    },
    {
      "id": "m8ioa01",
      "body": "HELL YEAH",
      "created_utc": 1737544567.0,
      "score": 1
    },
    {
      "id": "m8ip8fq",
      "body": "We deserve it",
      "created_utc": 1737545089.0,
      "score": 1
    },
    {
      "id": "m8ixhdz",
      "body": "honestly they keep playing but this is how they get killed fr",
      "created_utc": 1737549107.0,
      "score": 1
    },
    {
      "id": "m8ixmvj",
      "body": "What country? Fucking Greenland?",
      "created_utc": 1737549175.0,
      "score": 1
    },
    {
      "id": "m8iyb35",
      "body": "I am so fucking angry. Voting did nothing. They are so sinfully wealthy that voting with my wallet is nothing, they don’t need purchasing to stay wealthy. I went to the people’s march and will go to more even if it’s screaming into the void. I’m basically being loud and obnoxious because nothing fucking matters.",
      "created_utc": 1737549470.0,
      "score": 1
    },
    {
      "id": "m8iznq1",
      "body": "Hundreds of people did the Nazi salute at the pro-Palestinian protests, but I don't bother them there hahaha",
      "created_utc": 1737550038.0,
      "score": 1
    },
    {
      "id": "m8j0yay",
      "body": "You're right. It's why we have to stand together and bring in every way we can from the small to the big things",
      "created_utc": 1737550558.0,
      "score": 1
    },
    {
      "id": "m8j100t",
      "body": "Got to be methodical and strike in unison. Awakening is happening.",
      "created_utc": 1737550578.0,
      "score": 1
    },
    {
      "id": "m8jhb08",
      "body": "Not to nitpick, but i thought the whole God thing was a problem? Idk wtf Elon was doing though, reminiscent of the \"yahhhhhh\" guy who derailed his political career",
      "created_utc": 1737556339.0,
      "score": 1
    },
    {
      "id": "m8jmimb",
      "body": "Well what can you expect?? 💀💀",
      "created_utc": 1737557944.0,
      "score": 1
    },
    {
      "id": "m8jpts8",
      "body": "And nothing will change.",
      "created_utc": 1737558928.0,
      "score": 1
    },
    {
      "id": "m8jw20d",
      "body": "Probably should have voted aye",
      "created_utc": 1737560692.0,
      "score": 1
    },
    {
      "id": "m8jy0uf",
      "body": "People love to complain online, but never act in real life to make a change. That is all.",
      "created_utc": 1737561237.0,
      "score": 1
    },
    {
      "id": "m8mw6ts",
      "body": "Womp womp",
      "created_utc": 1737590785.0,
      "score": 1
    },
    {
      "id": "m8n933q",
      "body": "And it will get worse.",
      "created_utc": 1737594853.0,
      "score": 1
    },
    {
      "id": "m8d6y0s",
      "body": "There was a dictator in Peru who stated, \"For my friends everything; for my enemies the law.\"\n\nThis is how I feel rules are viewed now.\n\nedit: grammar",
      "created_utc": 1737475157.0,
      "score": 2173
    },
    {
      "id": "m8dlgab",
      "body": "NPR just released an interview with Steve Bannon.\n\nWhy the fuck are they normalizing Bannon? It's basically just more exposure for people to learn about his show.\n\nThe media is dangerously neutral. They'll say \"this or that raises questions\" and then not answer them for their viewers like they should be. \n\nDisgusting",
      "created_utc": 1737479211.0,
      "score": 250
    },
    {
      "id": "m8ddrwh",
      "body": "Rules don’t exist anymore when you can own all of the playbooks, the game pieces and the players.",
      "created_utc": 1737477092.0,
      "score": 108
    },
    {
      "id": "m8dq0f8",
      "body": "Only if you have an unnecessary amount of money. The rules still apply to us peasants",
      "created_utc": 1737480466.0,
      "score": 48
    },
    {
      "id": "m8dsomr",
      "body": "precisely. and that goes both ways.\n\nuse your well thought out moral principles and values to guide your behavior and protect those you love.\n\nand remember the rules don't apply to those that get to break the rules as well, and if your liberties are infringed upon or you are unfairly taken advantage of by the oligarchs,  the rules don't apply.\n\nyou can start small - baby steps, as needed.\n\nExample - if greedy corporations price guage, you can start small by not buying their products. however, if a monopolistic entity is alowed to flourish and price gauge you and others based on the adminstration policites, while executive pay and shareholders profit, you can upgrade action to stealing property/products from these companies if there is no other alternative that is not price gauged.\n\njust make sure to minimize impact on other individuals and keep it more on the company.",
      "created_utc": 1737481201.0,
      "score": 30
    },
    {
      "id": "m8lkvkj",
      "body": "100% as proven by Musk, who hasn't paid rent for the Twitter offices in years.   He's blatantly refused to, and bribed his way out of being evicted.\n\n10 years ago we all had issues with the top 1% not paying their share and scamming the system.   Now it's the top 0.1% that is blatantly violating our laws left and right in the name of personal profits.   And they got away with it by using politics to divide this country more than ever before.\n\nThe USA is now a 2nd world country",
      "created_utc": 1737577121.0,
      "score": 6
    },
    {
      "id": "m8edsa8",
      "body": "For the rich, not for you",
      "created_utc": 1737486937.0,
      "score": 3
    },
    {
      "id": "m8g2ckv",
      "body": "For you and the average Joe they still apply. Gotta have more then a billion dollar to be truly free I guess, while at the same time be able to make new rules for everyone to follow but yourself.",
      "created_utc": 1737504037.0,
      "score": 3
    },
    {
      "id": "m8gbs8n",
      "body": "Or all of them ending with a ‘?’ \nExample: Stop? No? 🤬",
      "created_utc": 1737506975.0,
      "score": 2
    },
    {
      "id": "m8ik6nt",
      "body": "Unless you're middle class or poor.",
      "created_utc": 1737542235.0,
      "score": 2
    },
    {
      "id": "m8ikt3w",
      "body": "They're concepts of rules, that's all.",
      "created_utc": 1737542600.0,
      "score": 2
    },
    {
      "id": "m8inggy",
      "body": "Alternative regulations’ as I like to call them now.",
      "created_utc": 1737544111.0,
      "score": 2
    },
    {
      "id": "m8kcmn1",
      "body": "Yes... unless you're not wealthy, then it's straight to jail.",
      "created_utc": 1737565271.0,
      "score": 2
    },
    {
      "id": "m8dl9n4",
      "body": "Ha!  It’s cute you still think they call them rules.",
      "created_utc": 1737479160.0,
      "score": 2
    },
    {
      "id": "m8d82op",
      "body": "Fact is, the vast majority of people have **something** to live for. Family, spouses, kids, maybe a house, or a decent job, or some good money in the bank — hell, maybe it’s just a beloved pet they love... *saving them from the brink of desperation.*\n\nAs oligarchs make all of that a thing of the past and eviscerate the middle class because of their greed, more and more people *have nothing to lose.*\n\nWe’re speedrunning to unstable 3rd world nation status. Where the few rich live in fear of the masses of poors who occasionally execute the rich in the streets when opportunities present themselves.\n\nTrumpism will push people further to crazy. And it’s gonna be shocking.",
      "created_utc": 1737475480.0,
      "score": 651
    },
    {
      "id": "m8gu1m8",
      "body": "THANK YOU! I’m so sick of the Luigi memes. It’s like everyone agrees but also just standing around twiddling their thumbs waiting for someone to be the “next one”. like I’m not saying we all need to be as drastic as offing a billionaire (if only we could all be so bold) but goddamn, what else are we doing besides whining and posting memes on the internet trying to make light of what is literally going to be the collapse of America as we know it. \n\nI’m just tired. Feels like we’re all just sleepwalking into a fiery pit and nobody gives a damn.",
      "created_utc": 1737512807.0,
      "score": 22
    },
    {
      "id": "m8ds49u",
      "body": "Aside from voting in every election, what would suggest a typical person could do to take action?",
      "created_utc": 1737481046.0,
      "score": 24
    },
    {
      "id": "m8d4205",
      "body": "#burnbabyburn",
      "created_utc": 1737474331.0,
      "score": 27
    },
    {
      "id": "m8hnx12",
      "body": "Everybody wants to change the world, but nobody wants to die",
      "created_utc": 1737523928.0,
      "score": 3
    },
    {
      "id": "m8eamlt",
      "body": "People will complain and complain but won’t change their life or focus on organizations or charities to join or invest their time in local politics and work their way up. I’m glad you weren’t downvoted!",
      "created_utc": 1737486069.0,
      "score": 2
    },
    {
      "id": "m8na4bw",
      "body": "I’m pregnant with my first and am having the hardest time accepting that I’m bringing her into *this* world",
      "created_utc": 1737595184.0,
      "score": 3
    },
    {
      "id": "m8ooe1x",
      "body": "Agreed, that's why I raised my kids to be bad people and act indecently. Well I tried my best anyway, but the little brats never listened to me, they just spent all day lecturing me about how drugs were bad and cheating was wrong and there were more important things in life than vengeance. In the end, I just had to accept that they all sucked.",
      "created_utc": 1737614595.0,
      "score": 3
    },
    {
      "id": "m8gthv3",
      "body": "We should luigi the rich",
      "created_utc": 1737512627.0,
      "score": 133
    },
    {
      "id": "m8d5bgt",
      "body": "He has sold himself as a \"Christian\" President. It's hypocritical.",
      "created_utc": 1737474697.0,
      "score": 917
    },
    {
      "id": "m8dmkuf",
      "body": "Elon is the most dangerous man in America",
      "created_utc": 1737479523.0,
      "score": 98
    },
    {
      "id": "m8dvlfs",
      "body": "Mediocre Mussolini, I love that. The bravado of his speeches have had me saying he's a mini Mussolini for awhile now, I like yours better.",
      "created_utc": 1737481991.0,
      "score": 33
    },
    {
      "id": "m8denbs",
      "body": "I’d swear in on a copy of Dune",
      "created_utc": 1737477335.0,
      "score": 67
    },
    {
      "id": "m8dnsmr",
      "body": "It’s not that he didn’t swear on the Bible, it’s that he didn’t swear on anything!",
      "created_utc": 1737479860.0,
      "score": 23
    },
    {
      "id": "m8dbdgv",
      "body": "It's not exactly about the bible, but the disrespect the act represents and also the sheer hypocrisy. I say this as an atheist.",
      "created_utc": 1737476420.0,
      "score": 40
    },
    {
      "id": "m8doxjd",
      "body": "Be very wary of Musk. He's a leading pioneer in the transhumanism movement. Neuralink is just the first step to a future where people willingly upload their consciousness to avoid death. Just know that whoever controls the \"off button\" to this technology controls the whole world. Seems far fetched, but that is this mans goal. Keep that in mind. It takes a certain type of person to have that goal. If he does achieve such a technology, don't buy into it. We aren't meant to live forever. There are consequences",
      "created_utc": 1737480172.0,
      "score": 31
    },
    {
      "id": "m8hj2hj",
      "body": "I constantly think about the quote from Fried Green Tomatoes where the preacher brought his own Bible to swear on during the one characters murder trial and lied to the lawyers. Ruth says to Idgy, \"if that judge had looked any closer he'd seen he actually had a copy of Moby Dick.\" -- this is where we are at in the world now. ",
      "created_utc": 1737521817.0,
      "score": 3
    },
    {
      "id": "m8efkme",
      "body": "It bothers me VERY much that he will stand up there and say, \"God saved me to do this...\" yet he cannot put his hand on the bible.",
      "created_utc": 1737487425.0,
      "score": 7
    },
    {
      "id": "m8ecsvg",
      "body": "I can’t agree more. We saw exactly what we saw. These extra justifications are ppl gaslighting us.",
      "created_utc": 1737486667.0,
      "score": 68
    },
    {
      "id": "m8hsaob",
      "body": "The retort telling people \"if it really didn't mean anything bad, why don't you film yourself doing it and post it too!\" Really struck me.\n\n\nObviously they're not going to because they know exactly what it means.\n\n\nOr they will because they know exactly what it means and have been waiting this moment to step out of the shadows.\n\n\nEither way, we're fucked.",
      "created_utc": 1737526011.0,
      "score": 12
    },
    {
      "id": "m8i0qrm",
      "body": "As an autistic dude, i felt offended when people were excusing him because \"it was autism\", like; i'm autistic, but i don't \"accidentally\" do a nazi salute, i don't even do one at all, the way i stim is pacing or humming music, not throwing my arm up like a reich buffoon.",
      "created_utc": 1737530478.0,
      "score": 22
    },
    {
      "id": "m8f4gdn",
      "body": "At this point should we even be surprised. I mean let’s not forget everything they said about Jan 6. So it’s no wonder they’ll find all excuses in the book for a Nazi salute. This is going to be a long 4 years and I don’t even have much faith what happens after 4 years",
      "created_utc": 1737494185.0,
      "score": 25
    },
    {
      "id": "m8kr03z",
      "body": "bet half the people saying that never even heard of a roman salute before the elon clip😂",
      "created_utc": 1737569140.0,
      "score": 2
    },
    {
      "id": "m8dkjqx",
      "body": "People keep saying “it was a ROMAN salute!” Or “he hit his heart first, he was just showing his love for the audience!”\n\nOk Karen, go into your office and do what he did and let me know how it goes. Or, even better, go pick up your kids from school and  do it at their teacher. Let me know how it goes.\n\nThey damn well know what he did. They dam well know it’s unacceptable, vile behavior. They know it all but, they’re trying to gaslight us into thinking we didn’t see what we KNOW we saw.",
      "created_utc": 1737478958.0,
      "score": 303
    },
    {
      "id": "m8epyx9",
      "body": "What gave it away is the face he made while doing it. It looks like someone who has been trying to do that for years! And it’s finally able to do it without consequence.",
      "created_utc": 1737490254.0,
      "score": 33
    },
    {
      "id": "m8d8lr4",
      "body": " Guys, I'm Brazilian and I tell you here in Brazil we see you doing a lot of shit in your sick country. such as, for example, forgiving a good part of the top brass and Nazi scientists and taking them into your country and worse, putting them in positions at the NASA MIT, etc. As if that wasn't enough, you have fascist and hateful speeches disguised as freedom of expression, so for us in the global south it was obvious that this would happen at some point with the USA, in this case you Americans didn't see this coming, a large part because you are manipulated by the media and your government about this, about China, about how other countries are and work in general. Like in Brazil, healthcare and education are free, including universities.",
      "created_utc": 1737475631.0,
      "score": 283
    },
    {
      "id": "m8da1fo",
      "body": "Or ever",
      "created_utc": 1737476045.0,
      "score": 1
    },
    {
      "id": "m8gts7f",
      "body": "They got pardoned too, very telling",
      "created_utc": 1737512722.0,
      "score": 21
    },
    {
      "id": "m8dnkjk",
      "body": "As I started to grow older I realized this. It’s insane how much they worked to make us believe nobody compares to the USA when in fact other countries have it 10x better than us. Just ridiculous. Some people still believe in this facade given who they elected in and what they are tolerating.",
      "created_utc": 1737479798.0,
      "score": 118
    },
    {
      "id": "m8es0eu",
      "body": "As someone from one of those other countries, yes we do view America and it's absurd behaviour as a joke. It's truly hard not to.",
      "created_utc": 1737490819.0,
      "score": 35
    },
    {
      "id": "m8f3oja",
      "body": "My mother was from Holland and she always said \"Americans don't read\". I think I know what she was talking about.",
      "created_utc": 1737493975.0,
      "score": 34
    },
    {
      "id": "m8f2z57",
      "body": "Bruh, third world countries are pitying the USA.",
      "created_utc": 1737493785.0,
      "score": 11
    },
    {
      "id": "m8eo6e8",
      "body": "I think my grandmother, who survived the bombing of Rotterdam during WWII would have quite a different opinion about \"that Elon guy\".",
      "created_utc": 1737489758.0,
      "score": 49
    },
    {
      "id": "m8d4ncl",
      "body": "He says he hates the same people all the stupid bigots hate, naturally they believed him (because they’re stupid).\n\nIt’s slightly more nuanced than that but not really all that much so.",
      "created_utc": 1737474504.0,
      "score": 113
    },
    {
      "id": "m8d3rk7",
      "body": "He let those who are scared of things they don't understand be scared and turn it into hatred.",
      "created_utc": 1737474248.0,
      "score": 189
    },
    {
      "id": "m8ef4wc",
      "body": "Not just a rapist. A pedophile rapist. Our main media outlets are owned by the oligarchs now and that’s the main way his supporters get information bc they don’t read. And of course that media is actually propaganda. And has been for maybe 20 years? Someone can correct me since I was a kid in the 90s idr that far back. It started with Regan and republicans have slowly defunded education and other social programs enough that the population is no longer able to inform themselves in an ethical way.",
      "created_utc": 1737487305.0,
      "score": 37
    },
    {
      "id": "m8d4e4u",
      "body": "I honestly don’t know but as a disabled chronically ill American I’m scared.",
      "created_utc": 1737474431.0,
      "score": 49
    },
    {
      "id": "m8gr49j",
      "body": "Because the vast majority of his voters are racist homophobic sexist and bigoted. He makes them feel justified and comfortable so they don’t care about what he’s done.",
      "created_utc": 1737511844.0,
      "score": 6
    },
    {
      "id": "m8ec02w",
      "body": "He told people it was okay to hate people darker than you and promised them he'd make America like the 1950s again ",
      "created_utc": 1737486447.0,
      "score": 10
    },
    {
      "id": "m8eq43c",
      "body": "He’s dumb just like his constituents.",
      "created_utc": 1737490293.0,
      "score": 2
    },
    {
      "id": "m8ekcln",
      "body": "This is top of the list in the disappointments department. To see millions of women voting for a rapist as their president. Just incredibly disappointing",
      "created_utc": 1737488719.0,
      "score": 4
    },
    {
      "id": "m8d0y60",
      "body": "It’s the fact that he have been so propped up by the religious fanatics and other cults and not do the religious thing. Anyone else, the cult would’ve spend crazy amounts of time talking about it. It’s the hypocrisy of it all. The cults reach and yell about one thing but when their dictator does the opposite, silence",
      "created_utc": 1737473423.0,
      "score": 170
    },
    {
      "id": "m8d23ou",
      "body": "Separation in state in church is all well and good when practiced. If you look at what they'd like to push, you'll see that's not it. So don't think that just because he didn't do that, they don't have plans to shove it down our throat.",
      "created_utc": 1737473763.0,
      "score": 48
    },
    {
      "id": "m8d3s6p",
      "body": "I agree, I’m a atheist so I don’t usually put the Bible or religion in my arguments but when this country has been doing it for 200~ years then one doesn’t, it feels like something religious people should be more pissed about. Separation between church and state is best.",
      "created_utc": 1737474253.0,
      "score": 46
    },
    {
      "id": "m8d18of",
      "body": "Yeah, they're all about \"separation of church and state\" when it's convenient for them... Nice that you adore that.",
      "created_utc": 1737473509.0,
      "score": 41
    },
    {
      "id": "m8czrpo",
      "body": "I strongly disagree with you because they use the book that the president believes in to swear on it is agnostic. ",
      "created_utc": 1737473075.0,
      "score": 31
    },
    {
      "id": "m8d1vrc",
      "body": "They don't go to church on Sundays but went on a Monday. Church was involved and he mentioned God several times during the inauguration.",
      "created_utc": 1737473698.0,
      "score": 9
    },
    {
      "id": "m8d5yj9",
      "body": "Watching a car crash that keeps getting worse but can’t look away",
      "created_utc": 1737474879.0,
      "score": 60
    },
    {
      "id": "m8d6wqe",
      "body": "Germans in the 1930's said the same thing. My advice is you can either go down doing the right thing, or you can hide and maybe survive, but you have to answer to history at the end. I know the one I'll be choosing.",
      "created_utc": 1737475146.0,
      "score": 52
    },
    {
      "id": "m8ebtnc",
      "body": "The constitution would’ve made more sense.",
      "created_utc": 1737486397.0,
      "score": 28
    },
    {
      "id": "m8ghv9p",
      "body": "As someone who doesn't live in either of those two countries, it feels like I'm stuck between two walls that are rapidly moving closer and closer, and all I can do is watch and wait for the walls to crush me.",
      "created_utc": 1737508885.0,
      "score": 4
    },
    {
      "id": "m8dqf71",
      "body": "Same. I've been telling friends to start preparing months ago, but they just keep saying that things will be fine. It's so frustrating.",
      "created_utc": 1737480579.0,
      "score": 7
    },
    {
      "id": "m8hvtil",
      "body": "So much for 'liberty and justice for all', right?",
      "created_utc": 1737527817.0,
      "score": 4
    },
    {
      "id": "m8iu7yl",
      "body": "Great question….imagine living here.  It’s embarrassing !!",
      "created_utc": 1737547611.0,
      "score": 2
    },
    {
      "id": "m8d1e8s",
      "body": "I still think it was rigged, based on the Cheeto’s confession during his speech.",
      "created_utc": 1737473555.0,
      "score": 128
    },
    {
      "id": "m8dtemq",
      "body": "*en masse, not \"in mass\"",
      "created_utc": 1737481399.0,
      "score": 9
    },
    {
      "id": "m8d38fk",
      "body": "People voted for it in a simple plurality. If the results are truly accurate, which is highly questionable.",
      "created_utc": 1737474093.0,
      "score": 17
    },
    {
      "id": "m8d572i",
      "body": "The majority of America absolutely did not vote for this. Stop with that.",
      "created_utc": 1737474662.0,
      "score": 27
    },
    {
      "id": "m8kcl8f",
      "body": "Just realized I forgot to add this on regarding the hand on bible thing: \n\nI understand the feeling of being annoyed/upset with him not placing is hand on the bible. If he really is Christian, like he claims to be, he should have. As an ex-Christian/Church goer (not 100% sure on my religion atm lol) myself, it is disgraceful that someone claiming to be Christian had the bible there for the *intent* of doing it and then *did not do it*. To me, it feels as though he was making a statement of being above God. While I obviously won't ever know if that was his intent, it will stick with me. Even if he claims it wasn't his intent, he has lied before and should not be trusted.",
      "created_utc": 1737565260.0,
      "score": 2
    },
    {
      "id": "m8dujnz",
      "body": "Well said.",
      "created_utc": 1737481708.0,
      "score": 9
    },
    {
      "id": "m8hvk0w",
      "body": "I have often wondered what would happen if we cut the DoD's funding for even just a year and put it towards helping the homeless. I'd like to think we could at least put a dent, large or small, in the homeless population number. But who really knows.\n\nI'd especially like to see it going towards veterans, teens, and children.",
      "created_utc": 1737527679.0,
      "score": 2
    },
    {
      "id": "m8fbgl0",
      "body": "Yea it’s a backwards ass country",
      "created_utc": 1737496072.0,
      "score": 11
    },
    {
      "id": "m8d9duv",
      "body": "Use the second amendment and get a firearm, practice, find out where and when they move, and don't expect to get away with it. Talk to as few people as possible about it (preferably none). There's not gonna be a drafting letter in the mail.",
      "created_utc": 1737475857.0,
      "score": 37
    },
    {
      "id": "m8lrfmg",
      "body": "Release Luigi Mangione lol",
      "created_utc": 1737578882.0,
      "score": 2
    },
    {
      "id": "m8dwv1k",
      "body": "Unfortunately, we do take them seriously. This is still the result. Propaganda goes a long way.",
      "created_utc": 1737482332.0,
      "score": 18
    },
    {
      "id": "m8ewb6s",
      "body": "They should be compulsory",
      "created_utc": 1737491992.0,
      "score": 2
    },
    {
      "id": "m8d4dgg",
      "body": "They’ve been praying to god so much and he hasn’t answered  it’s like it’s the story of Moses where he went to go speak with god, the people got scared and started worshipping a golden (orange) cow. I’m not religious but I have read the Bible and this seems right on the head for me.",
      "created_utc": 1737474425.0,
      "score": 28
    },
    {
      "id": "m8d208f",
      "body": "so we’re supposed to count on a man who will save a stupid little app but not human rights? ok. god is this country’s only hope atp.",
      "created_utc": 1737473735.0,
      "score": 12
    },
    {
      "id": "m8fnlge",
      "body": "Create local communities with your loved-ones. As much as i hate how much cold-hearted republicans has turned this term into a bad thing, you've got to create safe spaces for those you care about. i work at a bar. i have the right, from my boss, to not serve anyone i want as long as it doesn't fall into discrimination. I've kicked out swastika wearing neo-nazis out of our bar. I've also asked extremely drunk and belligerent people out for trying to start screaming matched with others during pride. The bar i work at is a \"safe space\" for the communities i care about. We don't, and can't, tolerate intolerance. Now it the time to talk too your neighbors, co-workers, friends, family, etcetera and make sure they know you're a safe person to be around.",
      "created_utc": 1737499480.0,
      "score": 7
    },
    {
      "id": "m8drcbi",
      "body": "I'm pretty sure in revelations the antichrist suffers a head wound, miraculously survives, and then gets cheered, celebrated, and given power for it.\n\nEdit: rev 13:3",
      "created_utc": 1737480833.0,
      "score": 14
    },
    {
      "id": "m8dejsw",
      "body": "Exactly. If you have to worry about eternal damnation in order to be a good person, then you need to re-evaluate your life choices",
      "created_utc": 1737477308.0,
      "score": 16
    },
    {
      "id": "m8ea2vk",
      "body": "Fear and complacency, defeat from past experience. We tried in 2020-2021 to effect some change. We tried in 2016 when Sanders was running, to get recognition in the news for his campaign. Peaceful protests turn violent due to alt-right agitators and police siding with them. There are protest marches planned this week but they aren't gaining traction. Occupation protests for Palestine resulted in nothing. The government won't listen to the people here. And violent protests aren't met with any response other than arrests and condemnation from those in power.",
      "created_utc": 1737485920.0,
      "score": 10
    },
    {
      "id": "m8eb1ri",
      "body": "Because the vast majority of us are one paycheck or less away from becoming homeless, carless, and losing the health insurance that’s tied to our employment. Many of us work two to three jobs just to pay our immediate bills, and have no savings. We are exhausted, malnourished, and cut off from access to information due to our media monopoly. We can barely breathe due to the boots on our necks. Sadly, the system is working just as intended. The cruelty is the point and many of us are trapped here with no resources or ability to escape.",
      "created_utc": 1737486185.0,
      "score": 16
    },
    {
      "id": "m8fbbth",
      "body": "Our police are militarized and can kill citizens with impunity. You have to be willing to die. Not only that but other citizens get off on killing protestors. We will eventually get to the point where we all have nothing and want to die and that’s when it will happen",
      "created_utc": 1737496037.0,
      "score": 5
    },
    {
      "id": "m8dfu4p",
      "body": "We (not conned Americans) understand. 💯",
      "created_utc": 1737477664.0,
      "score": 7
    },
    {
      "id": "m8dcmrq",
      "body": "Oh no, a lot of us saw this coming. It's just that people don't properly know how the voting system here actually works and they think that when voting for the president of our country their vote matters when in fact it does not matter. The votes that matter is when you vote for somebody to our Congress and people don't tend to vote a lot in those elections. Also the fact that the older members of our population believe everything is fact on social media. \n\nIt also doesn't help that our whole country was founded on puritanical ideologies and that our country started turning its back on our people back in the 1970s and giving more power to the wealthy therefore creating a larger disparity in the class system over time. The rich rule and get richer the poor lose and get poorer.",
      "created_utc": 1737476771.0,
      "score": 9
    },
    {
      "id": "m8d9oka",
      "body": "It doesn't. He was impeached before but no one pressed charges or enforced it.",
      "created_utc": 1737475942.0,
      "score": 8
    },
    {
      "id": "m8ddf4w",
      "body": "We're supposed to have a system of checks and balances. However, the political party currently in power aren't going to enforce those rules. There's also talk about giving the president even more oppositional powers. Meaning he will not need the approval of our Congress to make certain unilateral decisions. It's truly disgusting.",
      "created_utc": 1737476991.0,
      "score": 6
    },
    {
      "id": "m8dg421",
      "body": "I whole heartedly believe that this government will have to be overthrown. I truly believe this.",
      "created_utc": 1737477740.0,
      "score": 7
    },
    {
      "id": "m8dlbv6",
      "body": "nah the world would be better off without brainrot tok",
      "created_utc": 1737479176.0,
      "score": 2
    },
    {
      "id": "m8iyw59",
      "body": "On point",
      "created_utc": 1737549720.0,
      "score": 3
    },
    {
      "id": "m8feoym",
      "body": "With what money???",
      "created_utc": 1737496942.0,
      "score": 9
    },
    {
      "id": "m8djhrr",
      "body": "That's essentially how my MS city operates. When I worked for my city and pointed out how uneven the administration of city laws were - I suddenly had fire-able complaints against me. \nGod bless, Murica",
      "created_utc": 1737478666.0,
      "score": 325
    },
    {
      "id": "m8go654",
      "body": "Frank Wilhout said in a blog post:\n“Conservatism consists of exactly one proposition, to wit: There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.”",
      "created_utc": 1737510887.0,
      "score": 69
    },
    {
      "id": "m8hnooa",
      "body": "Peron used to say \"al enemigo, ni justicia\" (to the enemy, not even justice)",
      "created_utc": 1737523823.0,
      "score": 6
    },
    {
      "id": "m8eck2u",
      "body": "Dangerously neutral is a hilarious take.",
      "created_utc": 1737486600.0,
      "score": 121
    },
    {
      "id": "m8e9t40",
      "body": "Didn’t listen but they did a similar interview w another sleaze ball recentlyz so generally tired of news agencies doing the softball type of interviews and failing to follow thru on questions like professionals in press conferences",
      "created_utc": 1737485847.0,
      "score": 21
    },
    {
      "id": "m8fsbkj",
      "body": "Bannon was platformed by NPR??? I've seen and read a lot of shocking things in the last two days but somehow this hits home really hard. At the moment when the fourth estate needs to show its steel, it's bending and contorting under the sheer weight of fascism. This is how momentum builds, when the far right drags mainstream discourse its way. Step by step. I fear greatly for all our futures\n\nEdit: fourth estate, not third!",
      "created_utc": 1737500897.0,
      "score": 43
    },
    {
      "id": "m8hwolb",
      "body": "Really? 👀 hot take but that’s actually very interesting for where they are at this point in time. I used to work for PBS and with all the “defund them” shit going on for both of them and NPR, I’m genuinely surprised they would even entertain him.",
      "created_utc": 1737528268.0,
      "score": 3
    },
    {
      "id": "m8d8uo9",
      "body": "Martin Luther King had a family. It isn't an excuse. People today just don't care enough. Our sense of community is lost",
      "created_utc": 1737475702.0,
      "score": 168
    },
    {
      "id": "m8fo87x",
      "body": "You say that but you won’t be doing anything about it either. There’s always talk about how “someone’s going to do something eventually” but that person is just like you. Just as you won’t act, they won’t either.",
      "created_utc": 1737499666.0,
      "score": 18
    },
    {
      "id": "m8glpgx",
      "body": "I’m ready for the revolution. It’s long overdue and sadly I’m hoping that things will get so bad that enough people agree with me to make something happen. Luigi the rich.",
      "created_utc": 1737510099.0,
      "score": 14
    },
    {
      "id": "m8eb6mk",
      "body": "Start small. Get involved in local politics and move from there. Find a charity or fundraiser for a cause you feel strongly about and support it. Either with your time volunteering or a donation. If you impact and educate one person then odds are they will do it to another and another. And by educate I don’t mean call someone dump or a nazi but simply show them your reasoning. If they don’t understand it then move on to the next",
      "created_utc": 1737486222.0,
      "score": 44
    },
    {
      "id": "m8ibf4n",
      "body": "Perhaps use  your car-centric culture to your advantage?\n\nVery few Americans get more than a slap on the wrist “accidentally” killing someone with their car. So many people with past history of what adds up to vehicular manslaughter still walk around and retain their licenses today",
      "created_utc": 1737536845.0,
      "score": 3
    },
    {
      "id": "m8nhyz0",
      "body": "i’m this close to running to the streets and screaming, what? I don’t know but it might do something",
      "created_utc": 1737597709.0,
      "score": 2
    },
    {
      "id": "m8dvv7y",
      "body": "Disco Inferno?",
      "created_utc": 1737482065.0,
      "score": 17
    },
    {
      "id": "m8qrfkp",
      "body": "LMAO this cracked me up",
      "created_utc": 1737648409.0,
      "score": 3
    },
    {
      "id": "m8iee6b",
      "body": "If only everyone were so bold…",
      "created_utc": 1737538725.0,
      "score": 15
    },
    {
      "id": "m8d8duw",
      "body": "That's the least of his hypocricies.",
      "created_utc": 1737475569.0,
      "score": 441
    },
    {
      "id": "m8e872o",
      "body": "Its funny how the christian right who praised trump as the person who will “return god to the government” are very quiet about this lol",
      "created_utc": 1737485414.0,
      "score": 27
    },
    {
      "id": "m8fhks0",
      "body": "As someone from the country where it’s not a tradition to swear by religious text, it looked accidentally more considerate to the other religions.",
      "created_utc": 1737497745.0,
      "score": 2
    },
    {
      "id": "m8ddpjk",
      "body": "That was evident before even his first presidency.",
      "created_utc": 1737477073.0,
      "score": 6
    },
    {
      "id": "m8dornt",
      "body": "Well satan believes in god too.",
      "created_utc": 1737480127.0,
      "score": 2
    },
    {
      "id": "m8g6xd3",
      "body": "Most dangerous man in the world, really.  With how he tries to influence elections in other countries, his obsession with taking Greenland, and he's got enough money to buy a private army if he needs to.  He's also only in his early 50's and he's fit, so he'll last longer than Mediocre Mussolini and Botox Hitler both.",
      "created_utc": 1737505482.0,
      "score": 15
    },
    {
      "id": "m8e2ecq",
      "body": "Honest question with the whole Luigi stuff what do you think those tech guys are spending on private security",
      "created_utc": 1737483842.0,
      "score": 25
    },
    {
      "id": "m8op6l1",
      "body": "Well you misspelled his name, but yeah, we know what you mean. Jon Jones is badass.",
      "created_utc": 1737615017.0,
      "score": 2
    },
    {
      "id": "m8dmjwo",
      "body": "I’d swear in on a copy of Dune\n\nWith a Gom Jabbar?",
      "created_utc": 1737479515.0,
      "score": 14
    },
    {
      "id": "m8dl6bi",
      "body": "I was thinking maybe the Silmarillion\n\n\nSorry Tolkien but I value your works more than your god",
      "created_utc": 1737479134.0,
      "score": 10
    },
    {
      "id": "m8flxea",
      "body": "Bless the maker",
      "created_utc": 1737498994.0,
      "score": 2
    },
    {
      "id": "m8fbt4d",
      "body": "As a fellow atheist, I agree",
      "created_utc": 1737496165.0,
      "score": 8
    },
    {
      "id": "m8f2upi",
      "body": "And the fact that his voters still spout the garbage that he’s a man of Christ and list that as a reason as to why they support him.",
      "created_utc": 1737493751.0,
      "score": 9
    },
    {
      "id": "m8jhq01",
      "body": "I firmly believe he worships himself.",
      "created_utc": 1737556471.0,
      "score": 2
    },
    {
      "id": "m8h6gav",
      "body": "And they KNOW we saw and that's why they wanna move on to another topic as fast as possible and/or are already doing side-by-side comparisons of Kamala using her hands when talking. Like no, absolutely fucking not the same but nice try 🙄🙄🙄😂",
      "created_utc": 1737516991.0,
      "score": 16
    },
    {
      "id": "m8iq5zh",
      "body": "Yeah people figure out an excuse when you go \"okay if it was just an awkward dude being enthusiastic or it was a throwing out his heart or JUST a Roman salute then YOU DO IT\" will always make me laugh. Cause people will explain anyway their idols but when you challenge them to get personally involved and film themselves doing a hate signal, then they wanna change the subject 🙃😂 because WE ALL KNOW what that meant.",
      "created_utc": 1737545586.0,
      "score": 2
    },
    {
      "id": "m8iqdmu",
      "body": "💯💯💯 this part!!! And thank you for saying that! And I'm sorry people are trying to pin this on his autism 🙃🙄 Because I work with lots of autistic kids and before that autistic adults and also have lots of autistic family members...there is NO WAY STIMMING CAN BE MISTAKEN AS A SEIG HEIL AT ALL. Hands/arms flapping? Yes. Spinning? Yes. Heil Hitler-ing? NOT EVEN ONCE",
      "created_utc": 1737545698.0,
      "score": 6
    },
    {
      "id": "m8e4fyt",
      "body": "The thing is, they probably could and would and nobody will do anything about it anymore. People won’t really fight in public anymore.",
      "created_utc": 1737484394.0,
      "score": 30
    },
    {
      "id": "m8g7ck7",
      "body": "It *was* a Roman Salute before it was adopted by nazis.  Now it's a Nazi salute.  I don't understand how that's hard to understand.",
      "created_utc": 1737505611.0,
      "score": 7
    },
    {
      "id": "m8gg4ww",
      "body": "And despite what I’ve seen with my own eyes, I continue to search for the “why”?  Wtf would he do this?  It’s nonsensical.  I’m bewildered and disgusted.",
      "created_utc": 1737508339.0,
      "score": 2
    },
    {
      "id": "m8dbvdz",
      "body": "As another brazilian I can confirm that. The only surprise about all of this is that I wasn't expecting it to happen so soon, especially in the day of the ceremony. I thought these guys were smart enough to make it more subtle at first.\n\nWell...",
      "created_utc": 1737476560.0,
      "score": 126
    },
    {
      "id": "m8dhvps",
      "body": "My mother is Mineira and holy shit she’s drank the koolaid when it comes to thinking we are far better off with this fascist government than what’s happening in Brazil. Like 100% Brazil has its issues but I’m tired of her absorbing the right wing propaganda they put out in BOTH our countries and painting Brazil as this socialist shithole that’s constantly on the edge of economic collapse",
      "created_utc": 1737478224.0,
      "score": 37
    },
    {
      "id": "m8ggxgc",
      "body": "A lot of us see it and can’t do anything about it",
      "created_utc": 1737508588.0,
      "score": 9
    },
    {
      "id": "m8do8pg",
      "body": "Like at minimum those scientists had some useful knowledge and data, like at the barest bleakest misbegotten minimum they were useful for something.\n\nElon is useful for nothing.",
      "created_utc": 1737479984.0,
      "score": 2
    },
    {
      "id": "m8dzu18",
      "body": "When someone is told all their lives they are perfect, then there's no reason to try to be better. I'm nearly 60 and have seen the fallacy of the US all my life. Unfortunately, people living there are only now realizing they've always been lied to.",
      "created_utc": 1737483144.0,
      "score": 2
    },
    {
      "id": "m8g811y",
      "body": "They read.\n\nRead their Facebook, read only headlines to articles, read their Netflix menu",
      "created_utc": 1737505819.0,
      "score": 7
    },
    {
      "id": "m8mhvjh",
      "body": "We ARE a third world country. Just a lot of people don't realize it.",
      "created_utc": 1737586262.0,
      "score": 3
    },
    {
      "id": "m8eofbh",
      "body": "We should get our grandmothers together",
      "created_utc": 1737489827.0,
      "score": 22
    },
    {
      "id": "m8gmscz",
      "body": "As someone that generally hates politics and always has since my infancy, I can honestly say your statement is accurate. I really am noticing these people don't care about anything except \"getting pleasure from watching the other side suffer\".",
      "created_utc": 1737510443.0,
      "score": 17
    },
    {
      "id": "m8gu6z5",
      "body": "Same here in India. Nothing nuanced about it",
      "created_utc": 1737512856.0,
      "score": 2
    },
    {
      "id": "m8d5eyv",
      "body": "Sounds like a certain Austrian art school dropout",
      "created_utc": 1737474725.0,
      "score": 110
    },
    {
      "id": "m8i5t48",
      "body": "Yeah whenever I see clips of American news broadcasts I always find them so dystopian lol. The language they use is just so biased! They really, really want you guys to think a certain way about what they’re showing you",
      "created_utc": 1737533395.0,
      "score": 3
    },
    {
      "id": "m8g6tdl",
      "body": "Same here.",
      "created_utc": 1737505448.0,
      "score": 8
    },
    {
      "id": "m8d7gv0",
      "body": "I hear you. I have kids, which adds an entire layer to this question.",
      "created_utc": 1737475306.0,
      "score": 22
    },
    {
      "id": "m8edmgw",
      "body": "I agree",
      "created_utc": 1737486893.0,
      "score": 5
    },
    {
      "id": "m8ea7oq",
      "body": "If you don’t mind me asking, what have you done to start?\n\nEdit: personally I’ve canceled my Amazon subscription, downloaded Flashfood for cheaper discounted produce, unsubscribed from promotional emails from corporate entities and any non-small business shops and deleted accounts to these sites. I’m also looking to change from a bank to a credit union and possibly change my email from gmail to another site that’s encrypted. I’m just looking into more things I can do personally.",
      "created_utc": 1737485957.0,
      "score": 10
    },
    {
      "id": "m8ei5uv",
      "body": "THIS .",
      "created_utc": 1737488127.0,
      "score": 6
    },
    {
      "id": "m8f690g",
      "body": "he literally said it was rigged. TWICE!!! i saw a lot of people saving the tiktok because its disappeared everywhere else",
      "created_utc": 1737494672.0,
      "score": 21
    },
    {
      "id": "m8d3xrk",
      "body": "I wish this was proven. The time for it has pasted. If there was a hint of issue then the Democrats should have been screaming like the Republicans did in 2020",
      "created_utc": 1737474297.0,
      "score": 14
    },
    {
      "id": "m8dkyzc",
      "body": "yes they did. the ether actively voted for him or passively did by not voting for kamila",
      "created_utc": 1737479077.0,
      "score": 15
    },
    {
      "id": "m8d7vmy",
      "body": "He won the popular vote. Unless someone comes out with evidence otherwise. That will be the story.",
      "created_utc": 1737475424.0,
      "score": 12
    },
    {
      "id": "m8eeg1l",
      "body": "Thank you for the explanation. I am not from the US, but news and opinions are skewed so I'm grateful to hear from someone living and experiencing these times.\n\nI asked the other commenter the following question, and I was wondering if you could give your opinion as well?: do you believe Americans will hit a breaking point eventually (nothing left to lose essentially) and 'fight' back via revolts? Or do you think the only way significant change were to occur is through the influence of other countries? I used a hypothetical example of going to war with Canada and NATO. \n\nBasically, do you feel that America is at a point change cannot occur within the country via Americans?",
      "created_utc": 1737487117.0,
      "score": 2
    },
    {
      "id": "m8ed3fr",
      "body": "Thank you for telling me your experience and explaining why protest/revolts aren't a current option, that sounds genuinely horrifying.\n\nDo you believe there will be a breaking point for Americans? Or do you think it would take the interference of another country (for example going to war with Canada and NATO) to make lasting changes? (I'm not saying there will be war with Canada, but more saying change isn't able to be done within the country.)",
      "created_utc": 1737486748.0,
      "score": 7
    },
    {
      "id": "m8hlgey",
      "body": "Doesn't just happen in the U.S. I had a local government job in my town, pointed out that my manager was doing a bad job, was backed up with financial evidence of them doing a bad job, yet I was the one fired because the higher ups who put them in that position didn't want to explain how they fucked up.",
      "created_utc": 1737522837.0,
      "score": 63
    },
    {
      "id": "m8fzln1",
      "body": "You didn't have to say anything after \"my MS city\". It was a waste of keystrokes to write all those extra words.",
      "created_utc": 1737503163.0,
      "score": 45
    },
    {
      "id": "m8h60sg",
      "body": "\"Written last are like spider's webs. They will entangle the weak and poor, it's true, but the rich and powerful will tear them to shreds.\" -Anacharsis",
      "created_utc": 1737516839.0,
      "score": 21
    },
    {
      "id": "m8fbech",
      "body": "Nah, its like when America was still being neutral in WW2",
      "created_utc": 1737496056.0,
      "score": 36
    },
    {
      "id": "m8epozc",
      "body": "I thought the neutrals from futurama. If I don't make it, tell my wife hello..",
      "created_utc": 1737490178.0,
      "score": 21
    },
    {
      "id": "m8gk2h3",
      "body": "It is… when one side is running on misinformation",
      "created_utc": 1737509577.0,
      "score": 6
    },
    {
      "id": "m8ryudu",
      "body": "Well in a contest between center left liberalism and nazism, the neutral take is “we settled this in 1945”.\n\nThey are normalizing fascism by treating it as an intellectual equivalent to liberalism.",
      "created_utc": 1737660287.0,
      "score": 2
    },
    {
      "id": "m8ehc7f",
      "body": "In a good way or bad way haha",
      "created_utc": 1737487904.0,
      "score": 4
    },
    {
      "id": "m8g6z39",
      "body": "Love your comment. \n\nyou mean people may have to think for themselves!? FOR SHAME",
      "created_utc": 1737505496.0,
      "score": 2
    },
    {
      "id": "m8fviui",
      "body": "Too late honestly. We had basically 8 years to \"fix\" white nationalism and... well",
      "created_utc": 1737501883.0,
      "score": 20
    },
    {
      "id": "m8j2nzb",
      "body": "NPR is a soft talk, union busting supporter of the American imperialist oligarchy. Kinda glad they’re making it more obvious.",
      "created_utc": 1737551234.0,
      "score": 2
    },
    {
      "id": "m8d9lgv",
      "body": "Of course MLK did, **but it's not like he** ***expected*** **to be assassinated.**\n\nThe most unstable Luigi types... know it's probably a kamikaze exercise. That level of crazy is few and far between, **so far.**\n\nYou can be an AOC or a MLK or hell, a Bill Burr with a big mouth and a platform. That's **highly distinct** from, \"I'm a vigilante who's going to **forcibly correct** corruption with my 2nd amendment rights.\"",
      "created_utc": 1737475917.0,
      "score": 242
    },
    {
      "id": "m8icb05",
      "body": "Class war is the only righteous war. People might soon start realizing this!",
      "created_utc": 1737537402.0,
      "score": 3
    },
    {
      "id": "m8g8xjk",
      "body": "Not to negate your point, and not to discourage people from following this advice, but man is it exhausting trying to educate or even have discussions with people and constantly be met with bad-faith arguments, deliberate ignorance, etc. etc. I know it's a tactic to flood well-meaning people with blatant misinformation and nonsensical arguments to get them to give up, and I hate how effective it is.",
      "created_utc": 1737506095.0,
      "score": 39
    },
    {
      "id": "m8ilz4t",
      "body": "I'm not sure if I should admire your optimism, or pity your optimism... The approach you described has already failed, dreadfully. That approach didn't work when this country was still keeping up the pretense of democracy. It certainly won't be adequate now. I'm not saying people shouldn't keep it up, but let's temper our expectations.",
      "created_utc": 1737543272.0,
      "score": 8
    },
    {
      "id": "m8d8qda",
      "body": "It's difficult to rank them by magnitude, there are so many, the oath/Bible hypocrisy just adding to the pile.",
      "created_utc": 1737475668.0,
      "score": 137
    },
    {
      "id": "m8dqk5f",
      "body": "true, but it’s irritating when you know so many Christians who voted for him specifically because they think he’s a Christian who upholds Christian values (aka my entire family) because it makes them hypocrites right along with him.",
      "created_utc": 1737480617.0,
      "score": 121
    },
    {
      "id": "m8dk1iu",
      "body": "Lets be real man, the more he lies the more acceptable the last lie looks compared to the new ones. 🙄\n\nWe NEED to revolt, peacefully at first and if they wanna get physical we will pick up arms.",
      "created_utc": 1737478816.0,
      "score": 62
    },
    {
      "id": "m8denob",
      "body": "I’d disagree, when so many idiot Christians voted for him solely on the “fact” that he’s a Christian.",
      "created_utc": 1737477338.0,
      "score": 35
    },
    {
      "id": "m8jg2pf",
      "body": ">He's also only in his early 50's and he's fit\n\nIdk man, I've seen some strange shit happen with those circumstances.",
      "created_utc": 1737555943.0,
      "score": 2
    },
    {
      "id": "ma7ofro",
      "body": "He’s part of the federal government,has huge assets,spacex,Tesla,Twitter(I refuse to call it X) has a huge cult like following and he’s got a huge ego and gets his feelings hurt easy like when the gaming community proved he’s a fraud. He’s an emotional egotistical man with endless reach from multiple directions. He reminds me of standard oil and George soros wrapped in one but worse",
      "created_utc": 1738339110.0,
      "score": 2
    },
    {
      "id": "m8f6513",
      "body": "More then you and I will make in our lifetimes combined.",
      "created_utc": 1737494642.0,
      "score": 37
    },
    {
      "id": "ma7nbxi",
      "body": "That part😂",
      "created_utc": 1738338794.0,
      "score": 2
    },
    {
      "id": "m8dv2vc",
      "body": "And a crysknife at my side",
      "created_utc": 1737481853.0,
      "score": 6
    },
    {
      "id": "m8dleyk",
      "body": " bro, first of all, come and see for yourself. it is worth it.\nSo Brazil is not even socialist, in reality we are very capitalist, the only difference is that we have social security programs such as Bolsa Familia which gives much less than a minimum wage to families who earn less than a minimum wage per child they have, which is money that is only enough to cover the child's basic food needs (people say that people stop working to get paid, but that's the biggest lie they'll tell you), we have the sus that and the unified health system translating and hospitals are mostly free even for foreigners and this includes treatments for cancer, aids, etc. (we also have private hospitals but they are still much cheaper than in the USA) we have programs like my home my life is financing a house and apartment with lower interest rates for people with an income of up to 5 minimum wages. And these are just some of the programs that make people say that Brazil is socialist when in reality there is nothing about socialism. The reality is that they are just guarantees from the government that you will at least be able to survive, nothing more or less than that. even because the government is responsible for its citizens, so that is the minimum too. and about the economy how we are leaving the dollar sphere and creating an alternative trading currency with russia china india south africa indonesia and other countries the usa is doing everything in its power together with the financial market a market manipulation to inflate the artificially value the dollar (more than it already is) in order to harm emerging economies. since it is no longer possible to finance a coup d'état in 2025 in some countries because it is bad",
      "created_utc": 1737479201.0,
      "score": 25
    },
    {
      "id": "m8fjb5s",
      "body": "Grandma brawl!",
      "created_utc": 1737498240.0,
      "score": 22
    },
    {
      "id": "m8kttuv",
      "body": "She passed away, unfortunately. So no grandma brawl. Maybe in the afterlife, who knows. Don't let the pearls fool you..",
      "created_utc": 1737569901.0,
      "score": 2
    },
    {
      "id": "m8dl6du",
      "body": "Thats his best friend.  He has a “special” way of saluting. It seems really familiar but people keep telling me I'm wrong. 🤷‍♂️🤷‍♂️🤷‍♂️",
      "created_utc": 1737479135.0,
      "score": 42
    },
    {
      "id": "m8g78zo",
      "body": "It’s absolutely terrifying.",
      "created_utc": 1737505581.0,
      "score": 7
    },
    {
      "id": "m8d9gi6",
      "body": "I'm struggling with that too. Even if I stay and fight is my child going to be forced into the new hitler youth? Will he be drafted and forced to commit genocide?",
      "created_utc": 1737475878.0,
      "score": 31
    },
    {
      "id": "m8d9jb9",
      "body": "I never had kids because I knew this was inevitable and it's not fair to bring them into this world on the brink.",
      "created_utc": 1737475900.0,
      "score": 33
    },
    {
      "id": "m8e5cuu",
      "body": "Unfortunately democrats in office are spineless at best, and complicit at worst. I very much feel like they’re all in support of this despite acting like they’re not.",
      "created_utc": 1737484642.0,
      "score": 25
    },
    {
      "id": "m8enp31",
      "body": "The US rightwing is so aggressive, militarized to the point they aren't afraid to storm the US capitol to try to prevent a president being sworn in, or break into the Michigan mayoral chambers for a planned and failed kidnapping because of COVID mandates, or to break into Nancy Pelosi's home and assault her husband because they don't like her. \n\nAll the messaging from leftwing leadership is \"we're better than this. We don't do that.\" It's hard to say. I don't personally think we will get to that point on a wide scale. And small scale action will be reported as terrorist actions and not addressed.\n\nSelf-immolation as protest is met with \"they were unwell\" in the news, in contrast to family/friend reports of just how stable they actually were.",
      "created_utc": 1737489627.0,
      "score": 3
    },
    {
      "id": "m8efucq",
      "body": "Every day I have asked myself this question for the past 20 years or more. I keep thinking we have reached that point, but we just keep accepting more indignity and misery from the ruling class, and some of us are even thanking them for the favor. The American Experiment has always been corrupt, since the first colonists stole the land and future of my ancestors. \n\nI was hopeful when Bernie Sanders ran for president, when the Paradise Papers were published, when we had protests in the street in 2020. At this point I’ve almost become numb. There are no nonviolent means to change this system, and violent means will be punished with extreme prejudice. It’s all I can do to take care of myself and provide what meager mutual aid I can afford to help my community. I imagine many others are in the same boat or worse. Our federal minimum wage is still less than ten dollars an hour, and the costs of living keep rising beyond reason. We are watching everything in our society regress in real time. I think those of us who aren’t in a survival freeze state are too busy trying to stay alive to contribute to systemic change. The people who could foment change all benefit from this upside down system. \n\nAnd so the machine grinds on inexorably. Unless/until we collectively and individually have resources to opt out of this system that is funneling all the wealth and resources to the top, it’s very hard to escape, because we’re forced to be reliant on the system to survive. America, and specifically American late-stage capitalism, is a death cult.\n\nI think it’s pretty close to falling apart, but many of us can’t afford to let it fail, as that would mean we also fail. I wish there was something that anyone could say to make people realize we outnumber the billionaires and lobbyists and corrupt politicians. They are supposed to work for us, we have the power but we use it in all the wrong ways engaging in petty culture wars while being robbed blind right beneath our noses by the 1%. On an individual basis, we are powerless. But ideologically we simply can’t get it together long enough to cooperate. Shit’s fucked, fam.",
      "created_utc": 1737487499.0,
      "score": 11
    },
    {
      "id": "m8jaihz",
      "body": "I can definitely attest that it doesn’t just happen in the American South at least. The town I worked for in Massachusetts was just as crooked as the places I lived in the Deep South. I was shocked at first, and then just realized it’s all humans that become corrupt once they have any sort of power. Good life lesson.",
      "created_utc": 1737554086.0,
      "score": 13
    },
    {
      "id": "m8hltyg",
      "body": "Curious.. do you live in Mississippi? Or perhaps another southern state?",
      "created_utc": 1737523002.0,
      "score": 9
    },
    {
      "id": "m8gebgb",
      "body": "It's a beige alert!",
      "created_utc": 1737507762.0,
      "score": 4
    },
    {
      "id": "m8fw8be",
      "body": "My instinct is to agree but defeatism will only hasten the worst of circumstances",
      "created_utc": 1737502103.0,
      "score": 12
    },
    {
      "id": "m8h7l4c",
      "body": "We can't defeat white nationalism until we defeat the belief in eugenics within ourselves. As long as we believe that some people have the right to rule over others, we are supporters of the system and its cruel ethics. We have to decide to stop participating in all the mechanisms that are keeping the far right in control. We use their apps and then gripe when the apps spew right wing garbage? The warnings have been there all along. These were corrupt corporations who we empowered through our own choices. If minorities get harmed, we all need to care. If we don't we will suffer their fate.",
      "created_utc": 1737517394.0,
      "score": 13
    },
    {
      "id": "m8k6mjp",
      "body": "Thanks for the clarity - I'm on the outside looking in and saw them as performing a similar role to the BBC in the UK. Part of the establishment on the one hand but respected as an institution on the other hand",
      "created_utc": 1737563640.0,
      "score": 5
    },
    {
      "id": "m8dhz2n",
      "body": "He absolutely did. He knew he was being stalked and other leaders of the time were also assassinated. King wasn't an idiot lol. He might not have known for sure he would be but he was very aware what he was doing was dangerous",
      "created_utc": 1737478250.0,
      "score": 124
    },
    {
      "id": "m8eub81",
      "body": "Christian values...",
      "created_utc": 1737491449.0,
      "score": 14
    },
    {
      "id": "m8fig0q",
      "body": "Ah yes Americans bearing arms against the American military complex, I'm sure that will go well.\n\n You, aiming a rifle, and your opponent, sipping on coffee in some office operating a drone.",
      "created_utc": 1737497991.0,
      "score": 10
    },
    {
      "id": "m8hax0p",
      "body": "I agree that we need a revolution.",
      "created_utc": 1737518610.0,
      "score": 2
    },
    {
      "id": "m8e50k5",
      "body": "Question- do you own any arms?",
      "created_utc": 1737484550.0,
      "score": 1
    },
    {
      "id": "m8f8n47",
      "body": "Oh believe me, I LOVE Brazil - and it’s also conveniently where she will go to get all her dentistry and operations done if she needs them\n\nShe comes from a family that didn’t have electricity but now every male sibling on her side is a wealthy cattle farmer who divorced their wives to “trade in for a younger model” \n\nWithout a functional economy they wouldn’t be living in such luxury, and the hypocrisy of complaining about your own system that enabled the success of her brothers is mind boggling",
      "created_utc": 1737495309.0,
      "score": 10
    },
    {
      "id": "m8i3nh6",
      "body": "> people say that people stop working to get paid, but that's the biggest lie they'll tell you\n\nOh republicans in the US love to spout this exact thing",
      "created_utc": 1737532145.0,
      "score": 3
    },
    {
      "id": "m8e7k0p",
      "body": "A good chunk of them sadly are. I wish a lot of the older ones are would retire. The party would be much better when it happens ",
      "created_utc": 1737485239.0,
      "score": 7
    },
    {
      "id": "m8emt53",
      "body": "It does seem that those who don’t benefit are royally screwed either way. That, though Americans know the boat is sinking, they can’t afford to let it. So people are desperately trying to patch up holes in order to keep sailing, whilst the captain is enjoying a cigar and wine with their feet up and harping on how it’s ’a group effort’. Thank you for your view, it’s helped me understand the situation better. I hope you, and your loved ones, are able to keep healthy and safe.",
      "created_utc": 1737489388.0,
      "score": 7
    },
    {
      "id": "m8g9wus",
      "body": "Yep. I refuse to roll over, but like did anyone really even try this whole time?\n\nIt's like after Obama, and without Obama, Dems had zero fucking idea or playbook. Other than thwart Bernie.",
      "created_utc": 1737506399.0,
      "score": 24
    },
    {
      "id": "m8e7vwd",
      "body": "People should read King’s Mountaintop speech.\nhttps://en.m.wikipedia.org/wiki/I’ve_Been_to_the_Mountaintop\nHe absolutely knew he was in imminent danger. \nAnd still pressed on.",
      "created_utc": 1737485329.0,
      "score": 55
    },
    {
      "id": "m8dkzac",
      "body": "Having the courage to speak up for what's right and be a loud member of the resistance isn't equivalent to \"I'm going to break laws and personally change the pieces that are on this chess board, because nobody else will.\"\n\nThe former is naturally dangerous, but the latter is frankly suicidal. So it's not a surprise most people don't get to the latter.\n\nDoes it get to that level? I really hope not. It's the kind of track that starts civil wars.",
      "created_utc": 1737479079.0,
      "score": 50
    },
    {
      "id": "m8fis6y",
      "body": "Yeah, you can look at it like every one is some simple pawn instead of the whole pther pieces at your disposal. You do you girl, thing, human, basketball.",
      "created_utc": 1737498088.0,
      "score": 3
    },
    {
      "id": "m8elal0",
      "body": "Yeah, my right and my left one. Why's that any of your business.",
      "created_utc": 1737488976.0,
      "score": 26
    },
    {
      "id": "m8elwmk",
      "body": "Yes, I've got 2",
      "created_utc": 1737489144.0,
      "score": 5
    },
    {
      "id": "m8euatp",
      "body": "Yes, this precisely! Well said. \n\nThank you for your question, it was helpful to vent a little bit (and feel heard!), actually. I hope you and yours stay safe and healthy as well! It’s going to be the longest four years for us and hopefully we don’t screw too many things up beyond repair for the rest of the world 😞💔",
      "created_utc": 1737491446.0,
      "score": 4
    },
    {
      "id": "m8fm6ps",
      "body": "I don't disagree with you. In fact, I think that you're absolutely right. We do need to revolt even if it is physically violent. It's just frightening to consider how bloody that endeavor may be. \n\nDespite everything we suffer, the rat race mentality of capitalism has bred a very 'me first' culture. I'd personally be shocked to see citizens put their life on the line.",
      "created_utc": 1737499069.0,
      "score": 7
    },
    {
      "id": "m8fppxt",
      "body": "\"you will look at the roses without thinking of the blood spilt for them\" is always something people do, the devils tune gets to everyone someday.",
      "created_utc": 1737500108.0,
      "score": 6
    }
  ]
}