{
  "id": "1k9vaas",
  "title": "Found out I'm marrying the right person over a dropped quesadilla..",
  "selftext": "I'm 28, engaged to the love of my life, and yesterday I cried in the kitchen because I dropped a quesadilla on the floor... and my fiancé immediately dropped *his* quesadilla on the floor too, just so I \"wouldn't feel alone.\"  \nThen we sat on the floor, eating broken cheese triangles like raccoons, and honestly? I’ve never been more sure I’m marrying the right person.",
  "created_utc": 1745846162.0,
  "score": 8682,
  "num_comments": 212,
  "url": "https://www.reddit.com/r/offmychest/comments/1k9vaas/found_out_im_marrying_the_right_person_over_a/",
  "comments": [
    {
      "id": "mphcz6x",
      "body": "One night, many years ago and before we were married, my now husband was nowhere to be found when I woke up at 2am. I went downstairs to find him shelling pistachios into 2 small snack-sized containers. At the time, I was running a dementia unit at a nursing home and one of my little ladies would sit with me and inevitably eat all of my snacks. This man was sitting there shelling pistachios at 2am - one snack pack for me and one for my little lady who ate my snacks and loved pistachios. That's one of the moments I knew - there were many others, but I'll never forget that image of him sitting at the table singing some song quietly to himself, shelling pistachios for me and my sweetest little lady.",
      "created_utc": 1745847951.0,
      "score": 5518
    },
    {
      "id": "mpiasfa",
      "body": "I have rheumatoid arthritis and my husband peels mandarin oranges for me. I love finding the little bags of peeled fruit 🥰",
      "created_utc": 1745858301.0,
      "score": 455
    },
    {
      "id": "mphbej7",
      "body": "May this love find me, attack me, take over my soul and never leave me",
      "created_utc": 1745847414.0,
      "score": 1239
    },
    {
      "id": "mpi0nvp",
      "body": "I make my wife's lunches for her.  If it requires cutlery, I refuse to put normal utensils in there.  I use the reindeer or flamingo fork and Star Wars spoons.  Sometimes I'll sneak a note in there.  The notes can be inspirational quotes, bad limericks, dad jokes, or quotes from Sir Mix-A-Lot's Baby Got Back.  Since I also bake awesome cookies, I'll sometimes add extra for her to share with her coworkers.",
      "created_utc": 1745855288.0,
      "score": 1211
    },
    {
      "id": "mpj7rqx",
      "body": "Many, many lifetimes ago: my friend and I were walking our dogs when I slipped and fell in a mud puddle. I was so embarrassed and annoyed with myself, until she said “it’s okay, I’ll have muddy butt too!” as she plopped down and took a seat beside me in the mud puddle. We laughed so hard and I felt better knowing that I wasn’t the only one walking around with mud on my butt. She was a good friend, and I’ll never forget that moment… \n\nOP you found yourself a winner, for sure. This moment will stick with you for eternity.",
      "created_utc": 1745868007.0,
      "score": 192
    },
    {
      "id": "mphkiw5",
      "body": "I knew I was with the right man when I was hospitalized when traveling together internationally. We were in the ER waiting room, waiting for a room assignment, and I was feeling terrible. And then all of a sudden, I realized I had shit myself. Just a tiny bit, but I was mortified. I didn’t tell him until we got to the room, where I started crying and then went immediately to shower and clean myself up. Once I got into bed, he was like “Where are you underwear?” And I was like “In the trash where they belong..?” And he urgently went to fish them out “just in case they need a sample”. It was the cutest grossest thing. I figured if he could handle my shit, he could definitely handle me for life :) 4 years in…  He also slept on the hard foldout couch next to me that whole week, even though I was stable and told him he could go enjoy the outside world.",
      "created_utc": 1745850391.0,
      "score": 1010
    },
    {
      "id": "mphy7w0",
      "body": "Last year I had made a yummy dinner, chicken drumsticks with rice and something else. I don’t remember exactly the dish but I was excited to eat it. I picked up my plate and it slipped and fell to the floor. Food landed first then the plate and the plate split in two. My whole world went crashing down in that moment, I immediately started crying, like instant tears. I look up and see my husband and I start laughing too. I probably looked like a crazy person, but seeing him all I could think of was us in the future laughing about how I cried over a broken plate one time. I’m sure he thinks he married a crazy person, but he seems okay with it.",
      "created_utc": 1745854568.0,
      "score": 330
    },
    {
      "id": "mpjndw9",
      "body": "Back when we were broke-broke, and I was scrounging change and recycling aluminum cans for grocery money, I was gifted a packet of Buitonni spinach tortellini.  I was so excited to make it for my husband on his 44th birthday.  \n\nI fumbled the pan and dumped everything down the drain.  My world shattered, and I started UGLY crying.  He just gave me a big hug and held me.  Then he made rice and we put the pasta sauce on that.  He just kept telling me that the best birthday gift was a wife who loved him \"richer and poorer\".  This Saturday we'll be married 25 years.  Now I'm about to be 44 this summer, and he's announced that he'll make the Buitonni spinach tortellini for me.  Lol!",
      "created_utc": 1745872710.0,
      "score": 258
    },
    {
      "id": "mphg6jf",
      "body": "To the people in the comments use this as reference and don’t settle for anything less we all deserved to be loved this much find someone who drop there quesadilla for you",
      "created_utc": 1745849004.0,
      "score": 232
    },
    {
      "id": "mpjbqgj",
      "body": "Family lore is that when my parents were low income neyweds, mom was making Mac & cheese, and she accidentally dumped the cooked pasta in the sink while draining it. She started to cry, and dad patiently reassured her, scooped up the Mac, rinsed it, and finished making dinner. They were married 70 years.",
      "created_utc": 1745869223.0,
      "score": 108
    },
    {
      "id": "mph87bd",
      "body": "This is so cute 🥹\n\nI want a person like this one day 🥲",
      "created_utc": 1745846276.0,
      "score": 565
    },
    {
      "id": "mphgxkm",
      "body": "It’s always the little things like this that make people fall more in love. It’s one of the reasons why healthy married couples that have lasted awhile say they are more in love with each other now than the day they got married.",
      "created_utc": 1745849249.0,
      "score": 79
    },
    {
      "id": "mphepae",
      "body": "I mean…I would have offered my un-dropped food, and taken the food on the floor myself…but maybe that wouldn’t be as cute?",
      "created_utc": 1745848522.0,
      "score": 395
    },
    {
      "id": "mph948y",
      "body": "Okay that’s just sweet",
      "created_utc": 1745846603.0,
      "score": 106
    },
    {
      "id": "mpichnv",
      "body": "My ex had to go through bypass surgery and she couldn’t eat for 2 days. I didn’t want her to feel alone so I didn’t eat with her those 2 days.\n\nI wouldn’t mind doing this for my next love.",
      "created_utc": 1745858803.0,
      "score": 43
    },
    {
      "id": "mpkb2fv",
      "body": "I was bringing my ex a plate of dinner I had just cooked and dropped it in the hallway. I just started laughing, like hard, he came out of the room and saw the hamburger steak, rice and gravy all over the floor. Then he got mad at me for laughing. I told him to chill out he can have my plate I'll have cereal and clean up the mess... He was still mad, I told him I was either gonna laugh or cry about it and would he prefer I cry? He said YES! It would show remorse.... Remorse for what!? Am I supposed to beat myself up over a silly accident that didn't put him out at all, he still got a big hot plate of dinner that I cooked and didn't have to touch the mess (in MY house mind you). He backed down but his boss came into my job the next day and told me how he said I had the audacity to laugh after I dropped HIS dinner. I stopped cooking for him so much after that",
      "created_utc": 1745880454.0,
      "score": 39
    },
    {
      "id": "mpkwu4m",
      "body": "My favorite story about my partner is the bathroom. We were newly dating like less than a month. We went out to grab an early dinner and shared a meal while on holiday. The hotel room had a single bathroom. Cue food poisoning. There was zero privacy while we both evacuated our insides. He was on the toilet and I waited on the edge of the tub and vise versa. We’ve been inseparable since.",
      "created_utc": 1745887981.0,
      "score": 39
    },
    {
      "id": "mpi6acl",
      "body": "Once when I was with my ex, we were planning a trip, and I was in charge of reserving a specific place we decided, it took me a few days, and when I was going to do it, it was already taken, when she realised she got super mad at me and fought for a few days (she was not doing anything, I was planning the whole trip), something similar happened with my now wife, and when she realised what happened I apologised before she could say something and she smiled and told me, “no worries, let’s sit and do it together tonight :).",
      "created_utc": 1745856966.0,
      "score": 76
    },
    {
      "id": "mpheuvv",
      "body": "That warm, fuzzy moment when you laugh with your partner over a silly dropped quesadilla, the tiny spark that proves their love for you is as messy and perfect as life itself.",
      "created_utc": 1745848572.0,
      "score": 73
    },
    {
      "id": "mpha9bs",
      "body": "That's so sweet!\n\nLord I see what you've done for others....",
      "created_utc": 1745847010.0,
      "score": 30
    },
    {
      "id": "mphyznu",
      "body": "My partner and I have been under a lot of stress because of our families being against the idea of us getting married (because it’ll be an inter-faith marriage) and reading this just brought a huge smile on my face. Love this energy for y’all, OP! ♥️",
      "created_utc": 1745854794.0,
      "score": 32
    },
    {
      "id": "mpkd9qo",
      "body": "The best way you truly learn who someone as a person is;\n- when they're angry \n- when they're drunk\n- when you mess up in any way\n- how they treat their parents and siblings!!!",
      "created_utc": 1745881203.0,
      "score": 25
    },
    {
      "id": "mpl0eal",
      "body": "I knew I was with the right guy when he was packing my lunches and cutting up my apples. Not normal sized bites, not even kid sized bites. Each small apples was like 50 small bites. When asked why he dead serious said— you are my baby so I’m cutting you baby sized bites. I don’t want you to choke.\n\nHe’s a great Dad.",
      "created_utc": 1745889241.0,
      "score": 28
    },
    {
      "id": "mpjljk9",
      "body": "I had a similar moment when I came home one time and hit the curb too hard, causing a tire to pop. I went into my apartment with my tail between my legs expecting my fiancé to be furious with me, but instead he was so nonchalant about it and actually... happy? to change a tire. He said it'd been too long since he last had to do it, so he was happy to have a refresher. I was thinking to myself, \"whoa, is this what it's supposed to be like? peaceful?\"",
      "created_utc": 1745872162.0,
      "score": 68
    },
    {
      "id": "mplmdfe",
      "body": "When I first met my now boyfriend, I was coming out of a very verbally abusive relationship. He would yell at me all the time and, for example, not let me have anything else to drink if I spilled my current one. Anyways, I spilled my drink in his bed and immediately freaked out and started panicking. He told me it was okay, and then he flipped his can over and spilled his drink on the bed, too. It was the sweetest thing ever.",
      "created_utc": 1745897153.0,
      "score": 23
    },
    {
      "id": "mpm431q",
      "body": "When I was dating my husband, I had gotten a promotion and was leaving a department so we went out to celebrate/farewell with my coworkers. I CANNOT hold my alcohol and after one too many, I was DRUNK as a skunk. He drove me home, took care of me, held my hair back as I puked on his parent’s lawn, and got me cleaned up and in bed before I passed out. He even brought me my skincare routine to the bedside so I could do it laying down 🤣The next morning, he had to go to into work (I did not) but I woke up STARVING. He went a got me a cheeseburger and soda at like 6:45 in the morning and it was ABSOLUTELY GLORIOUS. He did care tasks as if it was second nature, kind and nonjudgmental. He was gentle and sweet, and made me feel like I was the funniest, most adorable human ever even though I was drunk as shit 😇😭🤷‍♀️ 14 years later, he keeps us calm when our  daughters start actin like their mother!! 🥰🥰",
      "created_utc": 1745905178.0,
      "score": 19
    },
    {
      "id": "mpm30pf",
      "body": "When my husband and I first started dating, we were at my best friends house for a party. I spent the night there often, and I was really particular about my pillow - I’m a light sleeper and I found one that I really liked, so I got two, one for my house, one for hers. It had torn at some point, but I liked it so much I didn’t want to replace it. That night, my boyfriend of like 4 months sat on the couch while everyone played beer pong and sewed it back up for me without me even hinting I wanted to. I knew in that moment this was the man for me.\nWe’re hitting 14 years married, 17 years together, 3 kids, 2 dogs, and we’re still in our 30s. When you know, you freaking know. And it’s awesome",
      "created_utc": 1745904623.0,
      "score": 17
    },
    {
      "id": "mph9kbr",
      "body": "Really, that's adorable, finding such a sweet confirmation of your relationship over something as silly as a dropped quesadilla is just perfect. It's a reminder that sometimes the most meaningful moments are the simplest, and it's wonderful you found that reassurance in such a relatable way, even if it involved a floor full of cheesy goodness, I'm really not immune to kitchen mishaps myself, and sometimes, when you're feeling down, a shared clumsiness with your partner is exactly what you need to remember why you love them so much.",
      "created_utc": 1745846762.0,
      "score": 42
    },
    {
      "id": "mphff79",
      "body": "I hope this kind of love would find us 🥰 so sweet",
      "created_utc": 1745848757.0,
      "score": 14
    },
    {
      "id": "mpho27y",
      "body": "May this kind of love find me.",
      "created_utc": 1745851486.0,
      "score": 13
    },
    {
      "id": "mpm7uqq",
      "body": "My daughter married a man like that!!!! I am over the moon happy for her!!!! These type of men are hard to find these days!!! God bless their parents that raised such a wholesome soul!!!",
      "created_utc": 1745907254.0,
      "score": 14
    },
    {
      "id": "mpj866y",
      "body": "I’m so happy for you ♥️\nMay your love grow stronger and many yummy quesadillas find their way to both your bellies now and then ! 🤗\nEdit : typo . Many not ‘any’😊",
      "created_utc": 1745868128.0,
      "score": 12
    },
    {
      "id": "mpqb9oo",
      "body": "My SO doesn't read - she has very intense dyslexia and she finds it too frustrating to get through the kind of books she enjoys. I, on the other hand, am a pathological book hoarder - picture the library from Beauty and the Beast, but if it was all beat up old paperbacks piled together by a particularly messy goblin onto shelves mostly obtained by hunting the streets in the early hours on trash day. This greatly annoys my wife as she likes to keep things very neat and tidy. \n\nWell 15 years ago, the basement apartment my SO and I rented was flooded during a storm when the river backed up. The water rose so quickly, it was knee-deep in minutes, and my SO, who is terrified of floods, was home alone. I rushed home from work when she called me in a panic, to find her and our dog cowering on top of the bed, and PILES of my books thrown on every piece of furniture we owned. It turns out that the very first thing she did when she saw the water coming in was grab every book on every lower shelf and put them in safety. She did that before she saved her *computer*, because even though they annoy her, she knows how much they matter to me. We lost nearly everything we had in that flood (like many poor young renters we didn't have insurance) but I didn't lose a single lonely book.",
      "created_utc": 1745961441.0,
      "score": 12
    },
    {
      "id": "mphdj9l",
      "body": "You got a good man!",
      "created_utc": 1745848136.0,
      "score": 8
    },
    {
      "id": "mphefxe",
      "body": "Cheesy but in a good way",
      "created_utc": 1745848437.0,
      "score": 21
    },
    {
      "id": "mphl4ai",
      "body": "this is the best post i’ve ever seen this year omg so adorable, i can’t wait to find love as pure as this",
      "created_utc": 1745850576.0,
      "score": 7
    },
    {
      "id": "mphp2xn",
      "body": "Match made in heaven, and the kitchen!",
      "created_utc": 1745851798.0,
      "score": 6
    },
    {
      "id": "mpk15t7",
      "body": "Aye, he sounds like a very sweet man.",
      "created_utc": 1745877087.0,
      "score": 5
    },
    {
      "id": "mpmnb9r",
      "body": "I was baking some chicken and had several Pyrex dishes out to make each chicken breast different.   I wanted one with tequila and lime to eat with some black beans and cilantro rice.   Everything is in the oven and I'm putting all the chicken toppings away.   I pick up the tequila bottle and it wasn't tequila.....it was Sambuca.   I was so upset!!!\n\nWhen the chicken came out of the oven I immediately wanted to throw it out.   But bless my SO's heart ....he ate it.   He asked I put it on the \"do not make this again\" list.\n\nThat was 12 years ago.  To date....it's the only thing on the list!",
      "created_utc": 1745916855.0,
      "score": 6
    },
    {
      "id": "mpn7ig2",
      "body": "I knew I picked the right one to marry one of the very first times I got drunk. \n\nFrom past experiences in every single prior relationship, the most caring was an ex who, if I got sick while drinking, would get a plastic Walmart bag, loop my ears through the handles (like a horse feeding bag) and then leave me in the room to be sick.\n\nMy fiancé, even though my hair stays in a ponytail, knelt beside me on the ground one night while I was getting sick.  This sweetheart *STILL* tried to hold my hair back while I vomited.",
      "created_utc": 1745927685.0,
      "score": 6
    },
    {
      "id": "mpo8ktp",
      "body": "Don’t get that. Yes it’s like „sharing the pain“ but why did he not just give you his „good“ quesadilla and pick yours off of the floor if he doesn’t mind it? \n\nI don’t wanna interpret too much into it as I am sure you two had a moment there but my ex wife had the same tendency of being happy about these kind of „mutually destructive“ moments and gestures. Ended up after a longer process of devolving that trait that she also increasingly wanted immediate and fair retaliation when I (from her perspective) did something wrong or bumped into her or whatever. Turned very toxic in the late\nstages of the relationship. Also I am sorry if \nI interpreted too much into things but this kinda reminded me of the start of my 12 year relationship",
      "created_utc": 1745939981.0,
      "score": 6
    },
    {
      "id": "mpost18",
      "body": "Some people place a trail of flower petals in every room for their partner to find… mine put plastic bags spread out so that on our 3rd date, when I started puking violently from drinking too much after we went back to his, I would have a bag to do it in while I roamed around feeling sorry for myself. I mean he was probably protecting his house more than anything but the man actually called me for another date! And Don’t even get me started on the diarrhoea incident in Thailand. Anyway we got married 3 years ago.",
      "created_utc": 1745945866.0,
      "score": 6
    },
    {
      "id": "mpimh1m",
      "body": "This is my new favourite post on the entire internet. So pure so joyous.",
      "created_utc": 1745861693.0,
      "score": 5
    },
    {
      "id": "mpjwk1d",
      "body": "this is so cute what the fuck",
      "created_utc": 1745875539.0,
      "score": 4
    },
    {
      "id": "mpjzmtd",
      "body": "so cute - this reminds me of the scene in New Girl where Jess accidentally burns her finger in the cigarette lighter in the car and Nick does it as well so they are both in pain",
      "created_utc": 1745876527.0,
      "score": 5
    },
    {
      "id": "mpk7pjr",
      "body": "This just made me laugh-cry because it's so damn wholesome!! 😂❤️",
      "created_utc": 1745879303.0,
      "score": 4
    },
    {
      "id": "mpl6pjw",
      "body": "con 😭gra😭tul😭ations😭😭😭",
      "created_utc": 1745891474.0,
      "score": 6
    },
    {
      "id": "mppfckk",
      "body": "That's the real shit right there. \n\n\n\n\nI tried keto once and, having never really been a soda drinker before in my life, found myself blindsided by soda cravings. My husband found me sitting on the kitchen floor crying about wanting soda, but feeling like a failure if I drank some etc etc   I was absolutely kind of hysterical over it. \n\n\nHe sat next to me and he poured me a glass and said it wasn't cheating to have some soda and he had some with me so I wouldn't feel bad 🥹",
      "created_utc": 1745952257.0,
      "score": 5
    },
    {
      "id": "mplg9yd",
      "body": "God, it’s me again.",
      "created_utc": 1745894885.0,
      "score": 4
    },
    {
      "id": "mpljwjq",
      "body": "I was touching up some paint in my daughter’s room and lost the handle on the small paint can. Hair, face, sweatshirt, rug. He ran up the steps and we immediately started laughing. You can’t make this stuff up.",
      "created_utc": 1745896233.0,
      "score": 5
    },
    {
      "id": "mpqfxba",
      "body": "I just recently learned that my husband, on our first Christmas as a couple, he sold his rarest Pokemon cards to buy my Christmas presents (he had gotten laid off a couple months prior and was still looking for work). We are in our 30’s, but he has been holding onto those cards since childhood. There was equal if not greater nostalgic and sentimental value in those cards than monetary, I know that wasn’t easy for him and I would have told him to absolutely not sell those cards. I consider myself so very lucky.",
      "created_utc": 1745962864.0,
      "score": 3
    },
    {
      "id": "mpk8bmq",
      "body": "That is absolutely awesome! This made me all warm and fuzzy. Happy for you OP! ❤️",
      "created_utc": 1745879512.0,
      "score": 3
    },
    {
      "id": "mpl6o6l",
      "body": "This is the best thing ever",
      "created_utc": 1745891461.0,
      "score": 3
    },
    {
      "id": "mpleoba",
      "body": "That’s true love! ❤️",
      "created_utc": 1745894289.0,
      "score": 3
    },
    {
      "id": "mpop98i",
      "body": "I dropped a cake I made my now-husband on the floor whilst singing happy birthday. I started crying and husband plopped on the ground by me, ate a bit, and said it was wonderful",
      "created_utc": 1745944855.0,
      "score": 3
    },
    {
      "id": "mphiixq",
      "body": "Please submit this to NYT Modern Love!! It’s toooo cute",
      "created_utc": 1745849759.0,
      "score": 6
    },
    {
      "id": "mpj9raf",
      "body": "Maniac marrying maniac",
      "created_utc": 1745868612.0,
      "score": 5
    },
    {
      "id": "mpmdp95",
      "body": "Tf I’m not dropping my good food on the floor to make someone else feel better 😭😭",
      "created_utc": 1745910685.0,
      "score": 6
    },
    {
      "id": "mpm80dy",
      "body": "that's dumb , he could've have shared it with you 😔",
      "created_utc": 1745907342.0,
      "score": 4
    },
    {
      "id": "mpimx99",
      "body": "Yes give me hope, that good men still exist out there😭",
      "created_utc": 1745861822.0,
      "score": 2
    },
    {
      "id": "mpk6suz",
      "body": "I’m crying. This is beautiful. Congratulations! May this type of love find me too!",
      "created_utc": 1745878995.0,
      "score": 2
    },
    {
      "id": "mpoqeiy",
      "body": "did you ever tell him that you don’t actually like his lasagna?",
      "created_utc": 1745945190.0,
      "score": 2
    },
    {
      "id": "mpot196",
      "body": "My ex would have laughed at me,  scolded me for crying and being clumsy,  and asked me to make him a second one.  This is so sweet,  I'm glad there are people out there like this",
      "created_utc": 1745945932.0,
      "score": 2
    },
    {
      "id": "mpoz4wq",
      "body": "my husband put a note on my purse saying ‘don’t forget your red bull in your fridge.  i love you.  ps, great rack’ 😂😂😂 may you both have a beautiful, bright, and fun marriage!",
      "created_utc": 1745947650.0,
      "score": 2
    },
    {
      "id": "mppxdub",
      "body": "you’re living the good life. he’s a keeper",
      "created_utc": 1745957459.0,
      "score": 2
    },
    {
      "id": "mps1315",
      "body": "a few months after i met my spouse at college, i went to visit them at their parent’s house over summer for a few days. i had a plan to ask them out, but i tended to get horrible relationship anxiety. by the time i got there (2.5 hours away), i was so anxious & chickened out. when i get anxious, i also get incredibly nauseous and lose my appetite, so i was essentially sick (even threw up in the middle of the night). at one point, i broke down crying(i don’t cry often) cause of everything + missing my cat(ESA). they sat with me, held me, brought food to me when i could eat, and just overall took care of me for DAYS when we weren’t even dating! i already knew i was in love with them, but it just really solidified that they were the one. we started dating once we got back to campus and now we have been married for a year and a half <3",
      "created_utc": 1745982217.0,
      "score": 2
    },
    {
      "id": "mqdk0ty",
      "body": " Need gay sex now ",
      "created_utc": 1746282643.0,
      "score": 2
    },
    {
      "id": "mphcd01",
      "body": "Not to take anything from a wonderful act of kindness.  But you aren't marrying anyone of you die from dysentery.  🤣😂. Enjoy being in the right relationship! 😊",
      "created_utc": 1745847743.0,
      "score": 5
    },
    {
      "id": "mpmpfx7",
      "body": "Weird.",
      "created_utc": 1745918243.0,
      "score": 2
    },
    {
      "id": "mplw4w2",
      "body": "How does this belong in /offmychest??",
      "created_utc": 1745901337.0,
      "score": 1
    },
    {
      "id": "mphbsq3",
      "body": "Applause.",
      "created_utc": 1745847551.0,
      "score": 1
    },
    {
      "id": "mphdclz",
      "body": "😘",
      "created_utc": 1745848074.0,
      "score": 1
    },
    {
      "id": "mphe6d9",
      "body": "This made me laugh out loud. How lovely. May you live a long and happy life together.",
      "created_utc": 1745848350.0,
      "score": 1
    },
    {
      "id": "mphlp5b",
      "body": "how sweet ",
      "created_utc": 1745850757.0,
      "score": 1
    },
    {
      "id": "mpig85c",
      "body": "🥺🥺🥺🥺🥺💘💘💘💘",
      "created_utc": 1745859884.0,
      "score": 1
    },
    {
      "id": "mpimc78",
      "body": "Dawww ❤️",
      "created_utc": 1745861654.0,
      "score": 1
    },
    {
      "id": "mpkgesj",
      "body": "Damn... everyone deserves this! Lucky you!",
      "created_utc": 1745882290.0,
      "score": 1
    },
    {
      "id": "mpkmaif",
      "body": "That's so cute😊😊😊",
      "created_utc": 1745884295.0,
      "score": 1
    },
    {
      "id": "mpl04od",
      "body": "❤️❤️❤️❤️",
      "created_utc": 1745889147.0,
      "score": 1
    },
    {
      "id": "mpl1msr",
      "body": "Goals",
      "created_utc": 1745889682.0,
      "score": 1
    },
    {
      "id": "mplusi4",
      "body": "I've never said this before but... I love these comments!",
      "created_utc": 1745900726.0,
      "score": 1
    },
    {
      "id": "mplwgsl",
      "body": "That's so cool! I hope you have many years together!",
      "created_utc": 1745901492.0,
      "score": 1
    },
    {
      "id": "mpmhr3f",
      "body": "You've found a good'un",
      "created_utc": 1745913227.0,
      "score": 1
    },
    {
      "id": "mpo6xlw",
      "body": "❤️❤️",
      "created_utc": 1745939503.0,
      "score": 1
    },
    {
      "id": "mpq7cs4",
      "body": "I love it! \n\nWishing y’all a long and happy life full of everything y’all have ever dreamed of! ",
      "created_utc": 1745960289.0,
      "score": 1
    },
    {
      "id": "mpr33nv",
      "body": "Nah, not the floor quesadilla 💀 I get it was a bonding moment, but he literally could've just given you his. No floor dirt required.",
      "created_utc": 1745970473.0,
      "score": 1
    },
    {
      "id": "mpstnta",
      "body": "It’s the small moments like this that many miss. Some would come downstairs and disrupt the moment with a sharp “what are you doing up, it’s 2AM?!” Instead of observing and taking in the moment to draw a conclusion. A proactive approach is far more valuable than a reactive one. Good job OP this is a beautiful moment and I’m glad you shared it.",
      "created_utc": 1745995872.0,
      "score": 1
    },
    {
      "id": "mpswjpf",
      "body": "aww",
      "created_utc": 1745997605.0,
      "score": 1
    },
    {
      "id": "mptp9o8",
      "body": "This is so cheesy. Happy for you!",
      "created_utc": 1746013971.0,
      "score": 1
    },
    {
      "id": "mpym7fc",
      "body": "This is the Jim and Pam energy we need!",
      "created_utc": 1746070451.0,
      "score": 1
    },
    {
      "id": "mqafhe8",
      "body": "this is poetry",
      "created_utc": 1746230190.0,
      "score": 1
    },
    {
      "id": "mqdvk9t",
      "body": "Cute",
      "created_utc": 1746286310.0,
      "score": 1
    },
    {
      "id": "munjyis",
      "body": "I'd laugh at my girlfriend and tease her that she should try eating it up from the floor, the filthy racoon she is.",
      "created_utc": 1748412321.0,
      "score": 1
    },
    {
      "id": "mpn9sw9",
      "body": "Crying reading this and some of the other “knew id found my person” moments 😭😭. Making me wanna break my restraining order 🩷❤️",
      "created_utc": 1745928626.0,
      "score": 1
    },
    {
      "id": "mpjg0k6",
      "body": "F",
      "created_utc": 1745870511.0,
      "score": 0
    },
    {
      "id": "mphfg5m",
      "body": "It’s super cute but… Why would you cry over that in the first place?",
      "created_utc": 1745848765.0,
      "score": -29
    },
    {
      "id": "mpj9lxq",
      "body": "Diva uppppp",
      "created_utc": 1745868566.0,
      "score": 0
    },
    {
      "id": "mps0p93",
      "body": "This is REALLY CUTE. I'm happy you found the love of your life. Just remember: \"The family that prays together-, STAYS together, 'for better or worse, -i'm sickness and in health. God Bless You.\nKen ",
      "created_utc": 1745982073.0,
      "score": 0
    },
    {
      "id": "mpipw9c",
      "body": "Yesterday, my wife and I both ran a marathon. She kicked ass and finished 45 minutes before me. You know what she did? After running over 26.2 miles, this incredible woman stood in the HOT SUN on a football field waiting at the finish line for me. For 45 minutes!! Because she knew I was a little injured before the race and so she wanted to be sure I didn’t need her to come back to get me, and also because she didn’t want to miss me crossing the finish. Every day I feel so lucky that I found her and that I got to marry her. ❤️",
      "created_utc": 1745862675.0,
      "score": 85
    },
    {
      "id": "mpj8js9",
      "body": "Absolutely love this. OP’s story and yours both show that it's those small, selfless moments that really reveal the heart of someone. It’s beautiful to see that kind of love and care in action ❤️❤️",
      "created_utc": 1745868242.0,
      "score": 253
    },
    {
      "id": "mpnazkx",
      "body": "When I was in my 20’s, my uncle and aunt were visiting our family.  Now in our family, dad barely spends any time with mom.  As I was observing my uncle, he seemed to spend a lot of time with my aunt even when he didn’t need to.  On this particular occasion, he was helping her with laundry.  \n\nSo, I went up to him and asked him- “You’ve been married 35 years, but you both seem into each other so much like you are still dating.  What’s the secret?”  \n\nHe looked at the clothes basket he was holding and thought for a second.  Then he said “Love is doing laundry together.”  \n\nI never forgot that.",
      "created_utc": 1745929094.0,
      "score": 108
    },
    {
      "id": "mphsbsg",
      "body": "This is the best ❤️❤️❤️",
      "created_utc": 1745852793.0,
      "score": 116
    },
    {
      "id": "mpj1ovf",
      "body": "I'M NOT CRYING YOU'RE CR– ok it's me I'm crine honestly 😭",
      "created_utc": 1745866174.0,
      "score": 133
    },
    {
      "id": "mpk2qhn",
      "body": "god this is so sweet!! the things a person does for the one they love 💕",
      "created_utc": 1745877623.0,
      "score": 27
    },
    {
      "id": "mpk1q2l",
      "body": "Ok the singing songs while he did has send me over the edge 😭😭",
      "created_utc": 1745877284.0,
      "score": 46
    },
    {
      "id": "mphkpmg",
      "body": "This is darling",
      "created_utc": 1745850449.0,
      "score": 77
    },
    {
      "id": "mpkd0up",
      "body": "Awesome.. Lovely story.. ❤️",
      "created_utc": 1745881117.0,
      "score": 13
    },
    {
      "id": "mpl79yz",
      "body": "That is the sweetest thing I've read in a while. Wish yall a very happy life❤️",
      "created_utc": 1745891671.0,
      "score": 10
    },
    {
      "id": "mpklmlz",
      "body": "This is bliss right here!",
      "created_utc": 1745884067.0,
      "score": 9
    },
    {
      "id": "mpmqq2l",
      "body": "Stoppp I love this",
      "created_utc": 1745919072.0,
      "score": 3
    },
    {
      "id": "mpo6yzg",
      "body": "❤️🥹",
      "created_utc": 1745939515.0,
      "score": 2
    },
    {
      "id": "mpsjxtu",
      "body": "🥹❤️❤️❤️❤️",
      "created_utc": 1745990479.0,
      "score": 2
    },
    {
      "id": "mpvq0fm",
      "body": "He showed such compassion and care for your sweet little lady! If I was you, I’d have begged him to marry me right then and there!",
      "created_utc": 1746036534.0,
      "score": 2
    },
    {
      "id": "mq4qryz",
      "body": "That is so sweet and awesome !!!",
      "created_utc": 1746153260.0,
      "score": 2
    },
    {
      "id": "mt9csyu",
      "body": "Oh my heart can’t take this — that is the sweetest thing ever. There’s just something so tender about those quiet, thoughtful acts that say “I see you, I love you” without any words. Him sitting there, sleepily singing and shelling pistachios for you and your little snack buddy? That’s real love right there. I’d be holding onto that memory forever too. What a precious human you've got.",
      "created_utc": 1747726450.0,
      "score": 2
    },
    {
      "id": "mpjqz0m",
      "body": "I have RA as well, plus find big oranges to be a high-commitment fruit. My partner always brings me a wedge from his. ",
      "created_utc": 1745873787.0,
      "score": 87
    },
    {
      "id": "mpjptda",
      "body": "The way i *felt* this comment-",
      "created_utc": 1745873436.0,
      "score": 183
    },
    {
      "id": "mpo7f8m",
      "body": "+1🥹❤️",
      "created_utc": 1745939647.0,
      "score": 16
    },
    {
      "id": "mprf7cd",
      "body": "real. so real. I have a Mighty need!",
      "created_utc": 1745974561.0,
      "score": 5
    },
    {
      "id": "mpiimu4",
      "body": "Wishing y’all a lifetime of happiness, this is so cute!",
      "created_utc": 1745860589.0,
      "score": 266
    },
    {
      "id": "mpm545y",
      "body": "That’s awesome! 💖",
      "created_utc": 1745905728.0,
      "score": 26
    },
    {
      "id": "mpsrhz9",
      "body": "You say she was a good friend…is she no longer with us? xx",
      "created_utc": 1745994611.0,
      "score": 2
    },
    {
      "id": "mpkkyel",
      "body": "Omg. \n\n\nI had bronchitis back in the winter. I hadn’t been that sick in over 20 yrs. They gave me a damn boatload of meds including cipro. Omg my stomach haaaates cipro. My partner went to town on a Sunday morning and brought us back bologna/egg/cheese biscuits. It was AMAZING. I was sitting on the couch with my feet up on an ottoman, I sneezed HARD and POOPED RIGHT THROUGH THE SPACE BETWEEN THE SEAT AND THE BACK. I have no idea why my gown wasn’t under my butt but when I bent over with the sneeze it was the perfect trajectory to go between and hit the fricken wall behind the couch. \n\nI cried and cried. I stood in the shower and cried. I laid on the bed and cried. He cleaned everything and apologized (APOLOGIZED!!!) for getting food my tummy didn’t like. He finally laid down with me and I stopped crying long enough to tell him I’d pooped myself so many times I’d thrown away 1/2 of my undies and I was just glad he had no idea until today. At which point he told me he had been cleaning up little poop drops for 2 weeks but didn’t want to embarrass me by saying anything. Then he offered to poop in the floor if it would make me feel better about myself. \n\n\nI can’t let this one go. He’s a keeper.",
      "created_utc": 1745883839.0,
      "score": 374
    },
    {
      "id": "mpmqmu8",
      "body": "Something similar happened to me. But we were a few months into our marriage then.\n\nI was too embarassed to fart in front of him. So I would excuse myself and go to the toilet. Even at night. He got curious and asked what's up. I had to admit. He laughed so hard. He was like- are you going to leave the room your whole life everytime you had to fart?\n\nAnother time, I had this urgent need to poop and the flat had only one toilet and he was inside. So, a little leaked into my underwear. I was so ashamed. I told him I will throw it out because I was disgusted to clean it. And he went ahead and washed it himself. \n\nHe also washes my period panties if he sees them lying around in the bathroom. His logic being- you will run out of underwear to wear. \n\nI would do the same for him in a heartbeat. He is my bubblaboo even after 7 years.",
      "created_utc": 1745919014.0,
      "score": 40
    },
    {
      "id": "mpovd92",
      "body": "Awww your husband sounds as sweet as mine! One day my Stage 3a endometriosis was flaring up very badly and I was in really bad pain. So bad I couldn't get up off the toilet to wipe after I pooped. He had to help me get up and told me to just go in the bedroom and Iie on my stomach. He then took his time cleaning my butt up. I immediately teared up and started crying. He asked me why was I crying and I told him that he was too nice to clean me up. He said he loves me very much and there's nothing he wouldn't do for me. We will be celebrating our 18 year wedding anniversary this June 11. 🥹🥲🥰😘",
      "created_utc": 1745946597.0,
      "score": 19
    },
    {
      "id": "mpkd737",
      "body": "That is love.",
      "created_utc": 1745881177.0,
      "score": 27
    },
    {
      "id": "mpi2luh",
      "body": "Same sort of thing happened to me a few years ago.  I spent all day soaking some dried black eyed peas and baby lima beans for NYD, washed some collard greens and cut them up just so, spent all day of NYE keeping an eye on the mix in the slow cooker with ham hocks and such.  I should mention here that I only get this type of food when I cook it.  My wife doesn't like greens or beans at all.  I had a nice bowl with rice late on NYE, watching TV, and put the rest in the fridge for tomorrow.  It's supposed to be lucky if you eat black eyed peas on NYD.  So I take it out that morning and fumble the bowl, everything splatters, the plastic bowl even cracks, there's a huge mess, and I never got my NYD black eyes.  I just lost my shit, right then and there.  That was January 1st, 2020, and I think Covid was my fault guys.",
      "created_utc": 1745855860.0,
      "score": 185
    },
    {
      "id": "mpkcc3y",
      "body": "My wife and I switch off picking where we get takeout from each Friday, since we cook every other day.\n\nSeveral weeks ago I was walking her tray over to her on the couch and the leg caught on a chair against the kitchen island; I watched in slow motion as her salad hit the floor.\n\nI felt like total shit and started cleaning up and cursing myself, piling her salad back into the bowl and said I would be heading out to get her a new salad; she said the floor is clean and she doesn’t eat too much anyway.\n\nI love that woman, she saved me a trip back to the restaurant.",
      "created_utc": 1745880885.0,
      "score": 42
    },
    {
      "id": "mppykoq",
      "body": "congrats! my husband and i just hit 25 years of being married. he was my first love at 15.",
      "created_utc": 1745957798.0,
      "score": 3
    },
    {
      "id": "mpis4c5",
      "body": "This post - along with all these other amazingly sweet anecdotal comments - definitely reiterate that none of us should settle for anything less 💯",
      "created_utc": 1745863317.0,
      "score": 58
    },
    {
      "id": "mphh9xy",
      "body": "[removed]",
      "created_utc": 1745849359.0,
      "score": 234
    },
    {
      "id": "mphhma2",
      "body": "Nah, still adorable as fuck. You're good",
      "created_utc": 1745849470.0,
      "score": 125
    },
    {
      "id": "mphmp5u",
      "body": "It's as kind, but less silly. I think some of the cuteness here comes from the sillines.",
      "created_utc": 1745851067.0,
      "score": 85
    },
    {
      "id": "mpi6vdw",
      "body": "Depends on if you're upset about the loss of the food or if you're upset that you dropped it.",
      "created_utc": 1745857142.0,
      "score": 29
    },
    {
      "id": "mpjnwcw",
      "body": "That feels more like it would be offered as a form of pity.  But by dropping his own food, it wasn't pity, it was silly, and showed her that even when she's in a bad situation, he'll be right there with her, eating quesadillas off the floor.",
      "created_utc": 1745872863.0,
      "score": 21
    },
    {
      "id": "mphvhck",
      "body": "I agree but on the other hand I also don’t understand crying over a dropped quesadilla so maybe that is the appropriate action in such case? It has to match the energy you know. \n\nEither way I know I’m also marrying the right person because I’m glad our reaction to fallen food is quite different than this.",
      "created_utc": 1745853751.0,
      "score": 79
    },
    {
      "id": "mpknk9c",
      "body": "This is what he should have done.",
      "created_utc": 1745884735.0,
      "score": 2
    },
    {
      "id": "mph992h",
      "body": "It really is.",
      "created_utc": 1745846650.0,
      "score": 26
    },
    {
      "id": "mpj00ra",
      "body": "But wouldn’t it be better if you ate so you could take care of her when she’s weak from not eating?",
      "created_utc": 1745865676.0,
      "score": 10
    },
    {
      "id": "mppz42l",
      "body": "name does NOT checkout. lol",
      "created_utc": 1745957951.0,
      "score": 7
    },
    {
      "id": "mplpqae",
      "body": "Can see why he's your ex.  And his boss can sit on it and rotate.",
      "created_utc": 1745898525.0,
      "score": 20
    },
    {
      "id": "mq668td",
      "body": "Aw I'm sorry 😔 You deserved someone to laugh there with you. There's definitely humor in those moments and like you said, better to be laughing than crying. Glad he's your ex ",
      "created_utc": 1746180514.0,
      "score": 1
    },
    {
      "id": "mpjstem",
      "body": "Ikr girl. Do it for me",
      "created_utc": 1745874355.0,
      "score": 18
    },
    {
      "id": "mpl61r0",
      "body": "at the end of the day, you and your partner will love each other, and religion matters, but it honestly really doesn't. not for love, and not for marriages either. Your wedding to each other will be beautiful. many happy wishes !!",
      "created_utc": 1745891241.0,
      "score": 8
    },
    {
      "id": "mprtw7e",
      "body": "I'd do that, if it ever came to it, with my partners sneakers. She loves her damn shoes.",
      "created_utc": 1745979590.0,
      "score": 3
    },
    {
      "id": "mpna214",
      "body": "My ex was sick in the sink next to me, because the smell/noises of me made him vomit also ❤️",
      "created_utc": 1745928728.0,
      "score": 3
    },
    {
      "id": "mprgyzt",
      "body": "Oh my gosh.  I’m sorry, but I am laughing so hard at the visual of the Walmart bag.  I am sorry that this happened to you.",
      "created_utc": 1745975149.0,
      "score": 3
    },
    {
      "id": "mpph4hn",
      "body": "Your interpretation is 100% correct, you didn't deserve what they did to you. Thankfully the majority of people are not like your ex. I'm interpreting here too so you'll forgive me if I'm off the mark. My childhood wasn't great. Abusive parent and withdrawn enabler parent. The details aren't relevant. \n\n\nWhat is relevant is, people like us tend to attract people like your ex. Know that finding the right people to help you and with enough hard work on yourself. You can and will find the ones who will treat you right. You deserve it. Don't let anyone tell you differently. Most importantly don't let the 'voice inside your head' tell you differently. Those are just thoughts. They aren't reality.",
      "created_utc": 1745952770.0,
      "score": 2
    },
    {
      "id": "mpme8j5",
      "body": "Same.",
      "created_utc": 1745911016.0,
      "score": 2
    },
    {
      "id": "mpsycid",
      "body": "I think we’re with the same guy… I swear I’ve received this exact note lol",
      "created_utc": 1745998738.0,
      "score": 1
    },
    {
      "id": "mphhxe1",
      "body": "You've never had a moment when you've just been overwhelmed by something dumb? Yep, seems dumb. But when you're stressed/tired/hungry, small things become big things.",
      "created_utc": 1745849570.0,
      "score": 25
    },
    {
      "id": "mphhwzp",
      "body": "Long, tough day, craving a quesadilla as a treat, boom floor quesadilla :( \n\n\nLast of the food in the house maybe\n\n\nPMS, sometimes I am weepy as fuck and dropping my food id made/ordered and was super looking forward would definitely make me shed a tear ",
      "created_utc": 1745849567.0,
      "score": 12
    },
    {
      "id": "mphhumz",
      "body": "Some of us cry over literally anything. I used to not be a crier at all but I think the years have just…kinda worn me down?",
      "created_utc": 1745849546.0,
      "score": 2
    },
    {
      "id": "mpnefmp",
      "body": "My husband and I frequently tell people that we are each other's favorite human. And we mean it. We've been together 10 years now and there is nobody I'd rather go through life with. He's sweet and thoughtful and there is not one person who can make me laugh harder than he does. We laugh our way through laundry and dishes and cooking. We once had to clean \"poopapalooza\" in our house after our robot vacuum ran over a senior dog mishap and we even laughed through that (and it was *everywhereeeee*). It doesn't mean we don't argue or go through hard shit - I developed long-covid and can't do the same things I used to be able to (heart/lung issues now) - but we have just found other ways to enjoy our time together. \n\nWe were both married previously and were older when we met. I think that made a huge difference, too. We knew what we were willing to put up with and not and what was important to us, both together as a couple and independently. We are a really good team, always. We put each other first, always - above everything and anyone else. It works. :)",
      "created_utc": 1745930406.0,
      "score": 58
    },
    {
      "id": "mpkq9sz",
      "body": "I crode",
      "created_utc": 1745885681.0,
      "score": 73
    },
    {
      "id": "mt9ux58",
      "body": "He really is. Almost ten years later, he still does things like this. I married a magic man. 💛",
      "created_utc": 1747737613.0,
      "score": 1
    },
    {
      "id": "mpsxuiz",
      "body": "No, sadly she has since passed away… but I’ll cherish the time we spent sitting in that mud puddle",
      "created_utc": 1745998423.0,
      "score": 5
    },
    {
      "id": "mpkyu88",
      "body": "“Then he offered to poop on the floor” AAAA I’m dying LMAO. \n\nBut seriously what a keeper",
      "created_utc": 1745888688.0,
      "score": 153
    },
    {
      "id": "mplc2u6",
      "body": "Hahah I love it. I never poop myself but my partner has definitely had a couple close “oops I thought that was a fart and it wasn’t” moments. So I definitely cried and cried, but he laughed at me and was like. Babe. Of all moments for you to shit yourself I feel like this is acceptable. Haha. Love this for us.",
      "created_utc": 1745893356.0,
      "score": 44
    },
    {
      "id": "mpjev7o",
      "body": "All this time I thought COVID was caused by me not eating 12 grapes at midnight \n\n\nWhat a relief",
      "created_utc": 1745870169.0,
      "score": 92
    },
    {
      "id": "mpiz6kj",
      "body": "🤣🤣🤣",
      "created_utc": 1745865425.0,
      "score": 13
    },
    {
      "id": "mpipd48",
      "body": "🤣",
      "created_utc": 1745862523.0,
      "score": 8
    },
    {
      "id": "mpm7dji",
      "body": "If you really love her you would have gone back to the restaurant happily",
      "created_utc": 1745906982.0,
      "score": -10
    },
    {
      "id": "mphm84a",
      "body": "☝️",
      "created_utc": 1745850923.0,
      "score": 25
    },
    {
      "id": "mpi3ylt",
      "body": "If you’re crying over a quesadilla on the floor then it sounds like a ‘straw that broke the camel’s back’ type of thing and I think your partner intentionally throwing food on the floor with you is enough to shock a person out of crying.",
      "created_utc": 1745856265.0,
      "score": 197
    },
    {
      "id": "mpi81oh",
      "body": "I grew up with a dad who was very strict. His way or no way. Mistakes were not okay. Accidents could have always been avoided if only you'd prepared better. Breaking a dish would get you yelled at, and you'd be told how stupid you are - *why don't you just think about what you're doing?*\n\nI was constantly walking on eggshells and monitoring his mood. It is very easy to cry over spilled milk when this is your existence any time you're at home, which should be your safe space where you can fully relax and just be you.\n\nI think her reaction is normal if her childhood or a past romantic relationship was anything like my dad.",
      "created_utc": 1745857492.0,
      "score": 109
    },
    {
      "id": "mpi8fsc",
      "body": "it could be for many reasons. i know if i was on my period and dropped some food i really wanted i would cry too😆",
      "created_utc": 1745857607.0,
      "score": 42
    },
    {
      "id": "mpj2pb4",
      "body": "I ate after she went to the hospital for her surgery. I’m pretty strong, even without eating for a while (I’ve always had a lot of energy since i was kid) and she did try to get me to eat but I refused. I didn’t want to eat in front of her while she couldn’t.\n\nMy dad would purposely ask me if I wanted food and eat in front of me though.",
      "created_utc": 1745866477.0,
      "score": 19
    },
    {
      "id": "mpx9gj9",
      "body": "Agreed",
      "created_utc": 1746053253.0,
      "score": 2
    },
    {
      "id": "mps3cfs",
      "body": "Hell, it's okay.  I have enough *common sense*, even **DRUNK** to keep my face out of plastic that **I** find the situation to be humorous.",
      "created_utc": 1745983086.0,
      "score": 4
    },
    {
      "id": "mphq6hh",
      "body": "Yes to being under a lot of stress but no, not to the point of being overwhelmed by something small. It’s beneficial to have a bit more resilience.",
      "created_utc": 1745852138.0,
      "score": -16
    },
    {
      "id": "mphkmgs",
      "body": "Oh hey, I thought you’re OP from the response. I get what you’re saying but I can’t understand how that feels.",
      "created_utc": 1745850422.0,
      "score": -8
    },
    {
      "id": "mphlrri",
      "body": "I never cried at Disney movies till sitting and watching the lion king with my 5yo or the fox and the hound 😭",
      "created_utc": 1745850780.0,
      "score": 3
    },
    {
      "id": "mpho234",
      "body": "Yea I figured from that the average person probably cries quite a bit and then there are some Reddit posts that are about crying over almost nothing.\n\nHopefully you can get to a better place where you don’t feel as worn down?",
      "created_utc": 1745851485.0,
      "score": 1
    },
    {
      "id": "mppid7v",
      "body": "How old were you guys when you met, if I may ?",
      "created_utc": 1745953132.0,
      "score": 9
    },
    {
      "id": "mps2iub",
      "body": "I'm sorry to hear that you're suffering from COVID. You're the 1st I've talked to, who IS. I will include you in the Rosary I say tonight, before bed\n. May the blessings of Our Lord and Savior Jesus Christ be with you, always. \nSincerely, \nKen ",
      "created_utc": 1745982766.0,
      "score": 0
    },
    {
      "id": "mps2r0z",
      "body": "Nice neologism! ",
      "created_utc": 1745982853.0,
      "score": 4
    },
    {
      "id": "mptf2zv",
      "body": "May she rest peacefully xx",
      "created_utc": 1746009194.0,
      "score": 3
    },
    {
      "id": "mplcxke",
      "body": "I don’t have a gall bladder so greasy food is iffy under the best of circumstances but after 10 days of cipro..  oooo. It was horrible. Lololol",
      "created_utc": 1745893659.0,
      "score": 21
    },
    {
      "id": "mpo0fxf",
      "body": "Never say never baby or you’re gonna jinx yourself\n\n*edit nvm you are the original pooper lmao you’re safe and I better understand the context of “never” in this sentence",
      "created_utc": 1745937602.0,
      "score": 8
    },
    {
      "id": "mpknnlj",
      "body": "2020 was the first year I bought a day planner. Never got to use it, figured 2020 was my fault, phew!",
      "created_utc": 1745884766.0,
      "score": 39
    },
    {
      "id": "mpirhe0",
      "body": "I’m so sorry to hear this! I hope you don’t live under such stress anymore. \n\nI’m sure there is more to it than just crying over quesadillas and his reaction was matching the situation. I may not understand but her partner does and that is what is important!",
      "created_utc": 1745863130.0,
      "score": 24
    },
    {
      "id": "mpl85j4",
      "body": "As someone who had a similar dad you hit the nail on the head and explained it better than I've ever been able to. The PTSD on edge feeling is so hard describe, just telling someone your default is fight or flight doesn't really do it justice. Thank you I hope you're doing well ❤️",
      "created_utc": 1745891978.0,
      "score": 9
    },
    {
      "id": "mq988os",
      "body": "There are times when I get utterly hysterical over nothing and my husband will just hug me. Then usually either give me chocolate if it's my period, or send me to bed if I'm so tired I'm practically delirious...",
      "created_utc": 1746216189.0,
      "score": 2
    },
    {
      "id": "mphqoci",
      "body": "Well hopefully you can a) never reach that point in your life and b) develop a little more empathy for other humans who have.",
      "created_utc": 1745852287.0,
      "score": 15
    },
    {
      "id": "mpnach8",
      "body": "Are you my horrible ex? I swear I’ve just found you on here with this one shitty comment lol",
      "created_utc": 1745928843.0,
      "score": 3
    },
    {
      "id": "mpprv28",
      "body": "I was 40 and he was 47. :)",
      "created_utc": 1745955896.0,
      "score": 14
    },
    {
      "id": "mpsg0l7",
      "body": "Whole new meaning of OP right here haha",
      "created_utc": 1745988557.0,
      "score": 2
    },
    {
      "id": "mppwgh1",
      "body": "😍🥰😍🥰😍🥰😍\nLove that. Gives me hope for my self, so thanks so much for sharing!",
      "created_utc": 1745957196.0,
      "score": 10
    },
    {
      "id": "mptzsin",
      "body": "Same here! 25 and 32 and thankful for him daily.",
      "created_utc": 1746017939.0,
      "score": 2
    },
    {
      "id": "mpt18zk",
      "body": "😭lmfao",
      "created_utc": 1746000579.0,
      "score": 2
    },
    {
      "id": "mpu5ooh",
      "body": "Love this for you! 💛💛",
      "created_utc": 1746019945.0,
      "score": 1
    }
  ]
}