{
  "id": "1kh5ozy",
  "title": "I kicked the shit out of my rapist",
  "selftext": "A year ago I (20) was raped by an insane gross methead (50). He offered me drugs when I was so drunk I could barely walk. We got to his apartment, he raped me for five hours while I was drugged up. \n\nHe left for the bathroom sometime during it, I managed to grab my phone and started an audio recording. It's three hours long and it's horrible. I never stop saying no, begging him to please stop, please let me go, sobbing, struggling. \n\nI turned it over to the police who have sat around twiddling their thumbs doing absolutely nothing for a year. He walks free, I see him all the time, small town. I reported it because I didn't want anyone to be hurt in the same way. \n\nThe police and hospital repaid me by informing my parents about this even though I specifically asked every single person I met during the process to please not do that (that's illegal btw).\nBackstory finished. \n\nYesterday I walked into the store and see Mr. Meth sitting on the floor. I was quite drunk (drinking problem who?). I walked up to him and spoke to him for the first time since it happened. He said some disgusting vile sexual things and made gestures that make my skin crawl just thinking about it. \n\nHe then asked me why I would involve the police, and said: \"Why didn't you just say no?\"\n\nI kind of lost it, I responded in the only appropriate way by kicking his face in. It was in broad daylight in public, security and police were called, but I got him good. He was yelling and whining about how there were cameras and the police were going to get me. It was the most cathartic amazing thing I have ever done. \n\nI went outside to smoke while waiting for the police. I was frustrated that it was taking so long, so I went back in and just attacked him again. He was better prepared this time but I got in many glorious punches to his head and face. \n\nEventually the cops arrived, they put him in the back of the police car and spoke to me. After he was gone I was just a sobbing mess. I told them the whole truth, that I was the one who instigated it, that I was quite drunk, what he'd done to me etc.\nTo my absolute bewilderment, they let me go? Maybe they felt bad for me since I was sobbing so much. They arrested him and put him in the back of the car, and I was free to leave.\n\nThey gave us both the same assault charge. I don't really know what to make of all of this, but it was deeply satisfying and I'd do it again in a heartbeat. \nBesides, if he didn't want to get kicked in the face, why didn't he just say no?\n\nThanks for reading <3\n\nEdit: You are all so very sweet, I wish I could reply to every single comment 🫶 I just had to tell someone about this, and all the support has made me feel so much better about everything. Thank you for taking the time to listen to me, you all deserve the world 🤍",
  "created_utc": 1746644862.0,
  "score": 6449,
  "num_comments": 211,
  "url": "https://www.reddit.com/r/offmychest/comments/1kh5ozy/i_kicked_the_shit_out_of_my_rapist/",
  "comments": [
    {
      "id": "mr4b72k",
      "body": ">why didn't he just say no?\n\nthis was icing on the cake, i am sooo glad you could take the revenge yourself and hope the rape charge also are on him. \n\n\ni hope you can get free from the trauma he has caused >:3",
      "created_utc": 1746646179.0,
      "score": 2691
    },
    {
      "id": "mr48xvc",
      "body": "I’m proud of you. You are heard and deserve to be heard and supported in this. It’s so disgusting how inactive the police are being. I would absolutely tell the judge everything.",
      "created_utc": 1746645520.0,
      "score": 1557
    },
    {
      "id": "mr4byk9",
      "body": "If violent crime is to be curbed, it is only the intended victim who can do it. The felon does not fear the police, and he fears neither judge nor jury. Therefore, what he must be taught to fear is his victim. - Lt. Col Jeff Cooper",
      "created_utc": 1746646399.0,
      "score": 382
    },
    {
      "id": "mr495zx",
      "body": "beating up rapists is always justified, i’m so sorry that happened to you, and i’m glad you were able to kick that waste of airs face in",
      "created_utc": 1746645587.0,
      "score": 788
    },
    {
      "id": "mr4plzi",
      "body": "This wasn’t at all funny, but the way you wrote it was hysterical. Literally the embodiment of ‘laugh at my pain’. So happy for you. I wish I could have fucked up my rapist too.",
      "created_utc": 1746650318.0,
      "score": 166
    },
    {
      "id": "mr4kho3",
      "body": ">I was frustrated that it was taking so long, so I went back in and just attacked him again.\n\nLMAO. Fuck that guy. Go do it again!",
      "created_utc": 1746648891.0,
      "score": 276
    },
    {
      "id": "mr4tvnu",
      "body": "You going outside for a smoke to wait for the cops, and then going back in for another round is some bad ass hero in a movie shit. Good for you.",
      "created_utc": 1746651511.0,
      "score": 130
    },
    {
      "id": "mr4av6j",
      "body": "This is awesome. You go!",
      "created_utc": 1746646086.0,
      "score": 43
    },
    {
      "id": "mr4cw8a",
      "body": "GOOD FOR YOU ❤️",
      "created_utc": 1746646676.0,
      "score": 43
    },
    {
      "id": "mr4cxkx",
      "body": "The ending made me smile, stay strong abuse like that is immensely hard to deal with!",
      "created_utc": 1746646687.0,
      "score": 43
    },
    {
      "id": "mr4b0kq",
      "body": "I wish more survivors had the chance to do the same. You are strong, brave, and did everything right. Then you got your justice. Good for you. I am so proud of you.",
      "created_utc": 1746646129.0,
      "score": 68
    },
    {
      "id": "mr4fmzr",
      "body": "I support your actions!!",
      "created_utc": 1746647473.0,
      "score": 22
    },
    {
      "id": "mr4m3jk",
      "body": "That final line is everything <3 you absolute hero!!",
      "created_utc": 1746649353.0,
      "score": 23
    },
    {
      "id": "mr4vnmb",
      "body": "Op, I wish I could give you a big big hug. \nWhen my daughter went through her abuse and we found out ( a cousin) knowing the his mom knew because something happened to other sister in law’s daughter years back. I hate that no one told me and warned us not to let him babysit. I want to beat the living s*it on all of them, but it’s not worth it. \nHe’s in jail waiting a sentencing but I hate that everyone else who could have prevented this, did not help us. His mother didn’t do nothing for him and keep him away from other kids, specially family members. Nothing. I wish I could do this and make her feel the pain in feel. The monster that hurt my girl, I want to make him feel the pain I feel. \n\nI’m glad to hear you got to get em’ to feel some pain. I hate that ok e gave you the justice you deserve and kept that disgusting rapist away from the public.",
      "created_utc": 1746652016.0,
      "score": 24
    },
    {
      "id": "mr4yavb",
      "body": "Meh. He didn’t say no. His fault. \nI’m proud of you.",
      "created_utc": 1746652793.0,
      "score": 22
    },
    {
      "id": "mr4hyyr",
      "body": "GOOD FOR YOU QUEEN.",
      "created_utc": 1746648147.0,
      "score": 17
    },
    {
      "id": "mr4lzkg",
      "body": "You are so badass. I hope you know that. Sending you love and hugs 🫂🩷",
      "created_utc": 1746649321.0,
      "score": 15
    },
    {
      "id": "mr5ymlh",
      "body": "Proud of you. Free therapy. Do it every time you see him until you stop feeling the urge or he stops showing himself lmfao\n\nI'm sorry this happened to you. Sorry for all of it. But well done. \n\nDo take care with the drinking. You deserve your health. \n\nBest wishes.",
      "created_utc": 1746664977.0,
      "score": 15
    },
    {
      "id": "mr4cua4",
      "body": "I love you for this! That Neanderthal needs to go eat dirt! \n\nI hope your charges get dropped!\n\nHugs",
      "created_utc": 1746646660.0,
      "score": 27
    },
    {
      "id": "mr4jmvg",
      "body": "This should have never gotten that far, but you did a good thing.",
      "created_utc": 1746648640.0,
      "score": 13
    },
    {
      "id": "mr4pyfr",
      "body": "I'm proud of you! I'm so sorry that they haven't charged him with raping you. Please don't let that shit go! Please go badger the hell out of the police about it.\nPraying for you!",
      "created_utc": 1746650413.0,
      "score": 13
    },
    {
      "id": "mr4vnrp",
      "body": "I would kill this person. I'm tearing up reading what happened to you. I'm so sorry. I'm so happy you had that experience tho!!!!!!!!!! 🖤",
      "created_utc": 1746652017.0,
      "score": 12
    },
    {
      "id": "mr4wj7q",
      "body": "I’m glad the police didn’t do anything to you cause of what you did, especially when drunk. You needed to get it out and you did. I think the police saw it that way too. Wishing you the best at recovering OP 🙏",
      "created_utc": 1746652270.0,
      "score": 11
    },
    {
      "id": "mr4xlmp",
      "body": "In my eyes you did absolutely NOTHING wrong. He deserved EXACTLY what he got. At least you got some small sliver of justice.. I’m so sorry this all happened to you. ((HUGE HUGS))",
      "created_utc": 1746652584.0,
      "score": 10
    },
    {
      "id": "mr4h7ff",
      "body": "Well done!",
      "created_utc": 1746647925.0,
      "score": 9
    },
    {
      "id": "mr4hd83",
      "body": "Gold! Good for you👏🏼👏🏼👏🏼",
      "created_utc": 1746647970.0,
      "score": 9
    },
    {
      "id": "mr4hs2m",
      "body": "Well done!!\nWish you luck",
      "created_utc": 1746648091.0,
      "score": 9
    },
    {
      "id": "mr4lna8",
      "body": "You’re badass",
      "created_utc": 1746649224.0,
      "score": 9
    },
    {
      "id": "mr51gwt",
      "body": "It’s so bitter to read how police just brush off rape everywhere. I felt relief in my soul that you got him, I wish I was a friend of yours with you in that moment. I hope you have someone close who supports and hears you, stay strong!",
      "created_utc": 1746653758.0,
      "score": 8
    },
    {
      "id": "mr537kv",
      "body": "I enjoyed living vicariously through your revenge.",
      "created_utc": 1746654295.0,
      "score": 9
    },
    {
      "id": "mr4ej2e",
      "body": "Waiting for one of Reddit's many cop apologists to explain why the rapist wasn't charged.",
      "created_utc": 1746647154.0,
      "score": 17
    },
    {
      "id": "mr5d2pl",
      "body": "Wait so they let you go and STILL charged you with assault? I'd get a lawyer and fight that. \n\nProud of you and I'm so sorry you went through that 💔",
      "created_utc": 1746657533.0,
      "score": 7
    },
    {
      "id": "mr5tpck",
      "body": "Not to be dramatic but… will you marry me? 🩷💜🩵🌈",
      "created_utc": 1746663230.0,
      "score": 9
    },
    {
      "id": "mr4o6ym",
      "body": "Based",
      "created_utc": 1746649929.0,
      "score": 8
    },
    {
      "id": "mr5aya7",
      "body": "All rapists deserve this treatment",
      "created_utc": 1746656809.0,
      "score": 8
    },
    {
      "id": "mr5m4eh",
      "body": "Do it again too.",
      "created_utc": 1746660607.0,
      "score": 6
    },
    {
      "id": "mr7439t",
      "body": "Thank you. I needed this. I lived vicariously through you. Sending you all the warmth and good vibes.",
      "created_utc": 1746681451.0,
      "score": 7
    },
    {
      "id": "mr5052s",
      "body": "I absolutely LOVE that you went BACK AGAIN!! Good for you!",
      "created_utc": 1746653349.0,
      "score": 7
    },
    {
      "id": "mr50rj7",
      "body": "HELL YEAH YOU DID🫂🫂🫂Many digital hugs and I’m glad you could tell your past self you got a little payback. That if they didn’t do anything, you did for her.\n\nYou didn’t deserve what you went through but he did.",
      "created_utc": 1746653540.0,
      "score": 5
    },
    {
      "id": "mr5gy6x",
      "body": "Oh honey. You did good. Strangers are proud of you. The part where my heart swelled is when the cops took too long so you went back in to give him another beating. You're a fierce woman and you didn't deserve what he did. He deserves what you did.",
      "created_utc": 1746658855.0,
      "score": 7
    },
    {
      "id": "mr77dam",
      "body": "So, weird personal scenario:\n\nWhen I was 26, I had to take a restraining order out on my ex-boyfriend. Without getting into the nitty gritty, a few cops I worked with were incompetent, but a few that were involved happened to have feelings about him and his father, who had worked for the force as well and were BEYOND helpful.\n\nIn the most ambiguous but straightforward way, some cops are more than happy to serve justice to someone who other cops let slip by within their power. \n\nAs equally abusive of power some cops are, you do meet a few who are as equally abusive FOR good/will turn a blind eye for justice.\n\nIt’s a weird scenario because it’s still abuse of power??? but like, it’s for good??? idk brah still don’t really trust them though lol \n\n\n\nTLDR: a few percentage of cops abuse power for good; you got lucky and the cops dispatched saw the fucked up whole picture and did alright THIS time. I’m glad it worked out though.",
      "created_utc": 1746683231.0,
      "score": 6
    },
    {
      "id": "mr4s3d5",
      "body": "I don’t know who you are, but I’m so fucking proud of you. I really hope you beat the shit out of them.",
      "created_utc": 1746651017.0,
      "score": 11
    },
    {
      "id": "mr53zco",
      "body": "I’m a big fan of this. You did that shit girl! The memories may follow you, and I hope you can heal from it with time, but you showed that waste of air what happens when they do disgusting things like that. All power to you ❤️",
      "created_utc": 1746654535.0,
      "score": 5
    },
    {
      "id": "mr55rbf",
      "body": "I just stumbled upon this post randomly and it brightened my day. From a stranger you will never meet in your life: I'm proud of you. You did the right thing. Greetings from germany :)",
      "created_utc": 1746655098.0,
      "score": 5
    },
    {
      "id": "mr5hhwr",
      "body": "Good. He deserved that shit. And fuck cops in this scenario. Also, I hope it happens to the man several more times. I’m so sorry that happened to you.",
      "created_utc": 1746659046.0,
      "score": 5
    },
    {
      "id": "mr5toue",
      "body": "Proud of you. Rapists deserve to get kicked (or more). I hope you can get some legal justice. Sending love",
      "created_utc": 1746663226.0,
      "score": 5
    },
    {
      "id": "mrax90n",
      "body": "Is your foot ok?",
      "created_utc": 1746734441.0,
      "score": 5
    },
    {
      "id": "mr5vcpn",
      "body": "Good for you… but stop drinking girl :) as a 37F I can tell you this isn’t the road you want to go down. Curb it while you’re young. It’s going to lead to more and more problems. \n\nBut I’m glad you beat the shit out of him, I’d have done the same thing, even sober.",
      "created_utc": 1746663827.0,
      "score": 3
    },
    {
      "id": "mr5yoqq",
      "body": "My heart breaks reading posts like this, i am glad you got revenge but if the police can't even arrest a rapist with so much undoubtable evidence, in a small town where they see him all the time, i don't feel very optimistic for the world rn",
      "created_utc": 1746664998.0,
      "score": 5
    },
    {
      "id": "mr6p8bu",
      "body": "Maybe since will hey have him in jail they’ll slap the real charges he should of already gotten on him? You didn’t deserve a charge, you deserved an applaud!! You rock!!!!",
      "created_utc": 1746674556.0,
      "score": 3
    },
    {
      "id": "mr78u7s",
      "body": "Dude they let you go because they know they did you wrong when you reported the rape. They were probably proud of the work you did. Sometimes the red tape around police reports is bullshit so they try to let the streets even the score in cases like yours.",
      "created_utc": 1746684051.0,
      "score": 3
    },
    {
      "id": "mr88d7y",
      "body": "I wanted to comment something but Reddit would ban me. All Im saying is that he still got off way too easy.",
      "created_utc": 1746704452.0,
      "score": 3
    },
    {
      "id": "mr4nb3t",
      "body": "I was falsely accused at my university as a sexual harrasser(gossip was made), honestly wanna do this with the 2 people who accused me whenever I see their faces at university. I am in my final semester now.",
      "created_utc": 1746649690.0,
      "score": 14
    },
    {
      "id": "mr4ldd3",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1746649143.0,
      "score": 7
    },
    {
      "id": "mr4ymdn",
      "body": "He was harassing you. He should not have spoke to you at all. The judge should consider and plead you down to something minor. Littering the street with his useless dna or so.",
      "created_utc": 1746652888.0,
      "score": 3
    },
    {
      "id": "mr54dox",
      "body": "Well done. Fuck him and the cops and the hospital for breaking hippa",
      "created_utc": 1746654660.0,
      "score": 3
    },
    {
      "id": "mr5w8of",
      "body": "I did something similar once upon a time. It helps on my bad days honestly. It is cathartic AF to take your power back. I don't know why they arrested him but if those cameras have audio his confession needs to be collected asap",
      "created_utc": 1746664141.0,
      "score": 3
    },
    {
      "id": "mr68p48",
      "body": "I am so proud of you<3",
      "created_utc": 1746668407.0,
      "score": 3
    },
    {
      "id": "mr6i40w",
      "body": "I fucking love this song!!!",
      "created_utc": 1746671751.0,
      "score": 3
    },
    {
      "id": "mr6juzb",
      "body": "Please let this be real",
      "created_utc": 1746672415.0,
      "score": 3
    },
    {
      "id": "mr6mh5c",
      "body": "Lesson learned.\n\nNext time, 0 witnesses\n0 camera.\n0 regrets.",
      "created_utc": 1746673438.0,
      "score": 3
    },
    {
      "id": "mr6n0ww",
      "body": "Atta girl.",
      "created_utc": 1746673659.0,
      "score": 3
    },
    {
      "id": "mr6opv6",
      "body": "I’m praying you get JUSTICE. Sending all the positive vibes your way. You are strong 🩷",
      "created_utc": 1746674345.0,
      "score": 3
    },
    {
      "id": "mr78jhf",
      "body": "Damn, im sorry this happened to you. Its very annoying and pisses me off that no one did anything about this person. I can say if it was me, id probably lose my shit and do way worse to him. If it was my daughter that it happened to he would probably never see day light again. Im truly sorry this happened to you, stay strong and keep pushing. We all are proud of you",
      "created_utc": 1746683884.0,
      "score": 3
    },
    {
      "id": "mr7nfer",
      "body": "I'd like to hope they realised they'd fucked up and that had they taken action earlier like they should've done, this incident wouldn't have taken place.",
      "created_utc": 1746692978.0,
      "score": 3
    },
    {
      "id": "mr92pj1",
      "body": "Why didn't he just say no?! Dude I was living vicariously through your story stomping the shit out of him!! Every single person who's been assaulted wishes they could do this!! I'm so proud of you and I'm glad you could get some sorr of closure (?)from this vile waste of oxygen",
      "created_utc": 1746715003.0,
      "score": 3
    },
    {
      "id": "mralw1x",
      "body": "You did not instigate that sweetheart he is a gigantic piece of 💩",
      "created_utc": 1746731071.0,
      "score": 3
    },
    {
      "id": "mrd3889",
      "body": "“Besides, if he didn't want to get kicked in the face, why didn't he just say no?” \nYesssss",
      "created_utc": 1746761977.0,
      "score": 3
    },
    {
      "id": "mryh5rq",
      "body": "I'm so proud of you and I'm sorry if this is off-topic, but you're amazing at writing.",
      "created_utc": 1747074949.0,
      "score": 3
    },
    {
      "id": "mryyiu4",
      "body": "I'm a survivor of SA, happened multiple times in my childhood by 3 uncommented people, one of which is my own brother.\nI would give my arm just to be able to do this. To beat the shit out of each and everyone.\nViolence shouldn't be accepted or supported, but when it's in situations like these... Hell yeah, dude(tte). You go.",
      "created_utc": 1747080159.0,
      "score": 3
    },
    {
      "id": "mr4uxx1",
      "body": "I'm happy for you and I hope you feel better! I can tell you I'd have gotten a sense of satisfaction from that like no other. I'm glad you went back in and beat his ass again, too lol",
      "created_utc": 1746651808.0,
      "score": 2
    },
    {
      "id": "mr4zq73",
      "body": "You should have gone for the balls.",
      "created_utc": 1746653224.0,
      "score": 2
    },
    {
      "id": "mr50lzp",
      "body": "mention the town the country… tv and social laws are stronger than them",
      "created_utc": 1746653493.0,
      "score": 2
    },
    {
      "id": "mr52axc",
      "body": "FUCK YES go you I’m hyped for you",
      "created_utc": 1746654016.0,
      "score": 2
    },
    {
      "id": "mr54i00",
      "body": "I'm proud of you! I hope the rest of your healing journey is just as satisfying. I hate that the system failed you so hard.",
      "created_utc": 1746654698.0,
      "score": 2
    },
    {
      "id": "mr5761s",
      "body": "Please get an attorney who can look into the rape charges. You need someone to advocate for you.",
      "created_utc": 1746655552.0,
      "score": 2
    },
    {
      "id": "mr57em1",
      "body": "Good work. Keep it up.",
      "created_utc": 1746655630.0,
      "score": 2
    },
    {
      "id": "mr59brx",
      "body": "You are my hero!  🙌🏻",
      "created_utc": 1746656266.0,
      "score": 2
    },
    {
      "id": "mr5aohe",
      "body": "Good for you girl!! Sadly they still had to charge you, which is absolutely ridiculous, but it was smart for them not to arrest you. I hope his death is the next thing waiting for him around the corner. Im proud of you for doing this! Huge applauds!! 👏👏👏👏",
      "created_utc": 1746656717.0,
      "score": 2
    },
    {
      "id": "mr5hr9v",
      "body": "Fucking good!! Good for you!",
      "created_utc": 1746659137.0,
      "score": 2
    },
    {
      "id": "mr5welp",
      "body": "I’m proud of you, especially for that last part. I hope he continues to get what he deserves and rots in jail next. I’m so sorry this happened.",
      "created_utc": 1746664200.0,
      "score": 2
    },
    {
      "id": "mr670wa",
      "body": "Post in nuclear revenge.",
      "created_utc": 1746667845.0,
      "score": 2
    },
    {
      "id": "mr67mfy",
      "body": "I’m proud of you. \n\nFuck everyone involved, I’m glad you got a bit of retribution.",
      "created_utc": 1746668046.0,
      "score": 2
    },
    {
      "id": "mr7afxu",
      "body": "based",
      "created_utc": 1746684970.0,
      "score": 2
    },
    {
      "id": "mr7fsvz",
      "body": "im so sorry this happened to you. But holy shit you stood on business, im proud of you. So proud.",
      "created_utc": 1746688149.0,
      "score": 2
    },
    {
      "id": "mr8wpvv",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1746713203.0,
      "score": 2
    },
    {
      "id": "mr94prs",
      "body": "Good for you. You did the right thing. So very proud of you and the fact you got the proper Justice.",
      "created_utc": 1746715597.0,
      "score": 2
    },
    {
      "id": "mr9cirb",
      "body": "I support women beating their rapists and getting the better of them in every aspect of this life. Including the system where they are locked up for life and dealt with by inmates.",
      "created_utc": 1746717889.0,
      "score": 2
    },
    {
      "id": "mrbnkb4",
      "body": "i'm so so so sorry you went through such horrific abuse & that law enforcement didn't do anything despite the concrete evidence you presented. way to go for kicking his ass! may he rot wherever for the rest of his miserable life. wishing love and healing for you💖",
      "created_utc": 1746742608.0,
      "score": 2
    },
    {
      "id": "mrbv8mq",
      "body": "“Besides, if he didn't want to get kicked in the face, why didn't he just say no?”\n\nThis right here.",
      "created_utc": 1746745300.0,
      "score": 2
    },
    {
      "id": "mrck9v2",
      "body": "As sorry I am that this happened to you, Im glad you got some revenge!",
      "created_utc": 1746754482.0,
      "score": 2
    },
    {
      "id": "mrcqg7d",
      "body": "Sounds like the perp got let of easy. You need to carry self defense protection. If not, the same thing will keep happening to u.",
      "created_utc": 1746756781.0,
      "score": 2
    },
    {
      "id": "mrcuzhi",
      "body": "God damn.  That must have been absolutely glorious.  🫡",
      "created_utc": 1746758527.0,
      "score": 2
    },
    {
      "id": "mrcwz2z",
      "body": "As you fucking should. I’m so proud of you girl for everything you’ve gone through",
      "created_utc": 1746759326.0,
      "score": 2
    },
    {
      "id": "mrd6bme",
      "body": "How brave!! I'm in awe. How badass!!! I can't wait for the other inmates to know why he's there.",
      "created_utc": 1746763375.0,
      "score": 2
    },
    {
      "id": "mrocv90",
      "body": "I will include you in the daily Rosary I pray for my wife. Your angel is watching over you, and will assist in your recovery. Hang in there! ",
      "created_utc": 1746924675.0,
      "score": 2
    },
    {
      "id": "mrp6uth",
      "body": "Sighed reliefwhen you beat the shit out of him good on you. Hope you get justice. I will pray hellfire for him. You deserve to live a peaceful life",
      "created_utc": 1746937114.0,
      "score": 2
    },
    {
      "id": "mrqon21",
      "body": "Be careful he doesn’t kill you, hon, small towns suck. I think you should get really smart and notice when you are in dangerous situations or at least situations that are worse than what you deserve",
      "created_utc": 1746967518.0,
      "score": 2
    },
    {
      "id": "mrrc0d0",
      "body": "There are organizations that help with cases like this where a victim of abuse is charged with a crime for fighting back - like Survived and Punished. If youre in the US and could use any help finding resources, please dm and I would be happy to try to connect you. I’m not a lawyer or anything, but I know a lot of people involved in those movements through trans rights and sex work rights folks (as you might imagine, two demographics often in that position). \n\nIn any case, I want to say fuck yeah. I’m proud of you. I hope you never regret it and have a fond memory to look back on. And know the reading this post is deeply satisfying to those of us that have not had the chance to do the same. ",
      "created_utc": 1746975947.0,
      "score": 2
    },
    {
      "id": "mrrkf0e",
      "body": "My cousin killed his girlfriends rapist.",
      "created_utc": 1746978627.0,
      "score": 2
    },
    {
      "id": "ms00mia",
      "body": "Sounds like he got his faced kicked in because they didn't prosecute him fast enough.  Oh, well...",
      "created_utc": 1747092328.0,
      "score": 2
    },
    {
      "id": "ms0qzpj",
      "body": "First off, you did and do not deserve any of that from a single one of those people. Second, I am glad you are alive. Third, you’re not alone. I was also raped around Christmas. He just died. Without me speaking up… I’m just coming to therapy and talking about it. You’re not alone. Fuck them. Fuck the system.",
      "created_utc": 1747101394.0,
      "score": 2
    },
    {
      "id": "msa9wrf",
      "body": "Bravery Level: Titanium.\n\nWhat a masterpiece of cosmic justice – you turned his vile “why didn’t you just say no?” into a punchline and a physics lesson. Karma arrived late, but she showed up wearing steel-toed boots that day.\n\nThe cops handing you matching charges? Peak small-town logic. “Ah yes, let’s equate a survivor’s volcanic rage to a predator’s lifetime of violence – that’ll balance the scales!” 🙄 But even Lady Justice side-eyes that math.\n\nThat audio recording? A three-hour symphony of his guilt. The fact that he still walks free? Proof the system’s spine is made of wet spaghetti. But you? You’re made of something sharper.\n\nHold this unapologetically: You turned his script upside down. He thought he’d written your story – instead, you gave him a plot twist he’ll feel every time he looks in the mirror.\n\nAnd hey, if anyone asks why you’d “instigate”? Just whisper back: “Why didn’t he just… not be a monster?” 🔥\n\nStay fierce. Stay alive. And know that a chorus of strangers on the internet are screaming, “Hell. Yes.” into the void for you. ❤️🔥",
      "created_utc": 1747236492.0,
      "score": 2
    },
    {
      "id": "mr4eouu",
      "body": "Police with empathy. They need a raise. \n\nI wish I was there to hold him still for you.",
      "created_utc": 1746647200.0,
      "score": 8
    },
    {
      "id": "mr7tjh7",
      "body": "I’m proud of you!! You are your own hero!! You will live your whole life being proud of yourself!",
      "created_utc": 1746696881.0,
      "score": 2
    },
    {
      "id": "mr4oib2",
      "body": "You are so strong!!!! Proud of you",
      "created_utc": 1746650013.0,
      "score": 4
    },
    {
      "id": "mr6y8pj",
      "body": "> To my absolute bewilderment, they let me go? Maybe they felt bad for me since I was sobbing so much. They arrested him and put him in the back of the car, and I was free to leave.\n\n\nGreat. Now please stop confessing crimes to the police. You should never talk to the police without an attorney present. ",
      "created_utc": 1746678504.0,
      "score": 3
    },
    {
      "id": "mr7kyvk",
      "body": "Good on you. No justice, just us. I would of helped you ruin his face x take care of",
      "created_utc": 1746691390.0,
      "score": 2
    },
    {
      "id": "mr83hve",
      "body": "He deserves every fucking hit you gave him and so much more. I hope they drop charges on your side because if the system had done its job he wouldn't have even been there to get his shit kicked in. \n\nI hope you're okay 🫂",
      "created_utc": 1746702279.0,
      "score": 2
    },
    {
      "id": "mr83vsq",
      "body": "SERVES HIM RIGHT. This was really good to read (not the backstory tho), he deserves more but I would’ve felt so good if I could do that too. I wish you recovery and a happier life, you deserve this 💞",
      "created_utc": 1746702462.0,
      "score": 2
    },
    {
      "id": "mr5fstp",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1746658465.0,
      "score": 1
    },
    {
      "id": "mr9x84d",
      "body": "I hope he gets to see what it’s like to be in your shoes one day.",
      "created_utc": 1746723922.0,
      "score": 1
    },
    {
      "id": "mra0t20",
      "body": "Be strong!",
      "created_utc": 1746724962.0,
      "score": 1
    },
    {
      "id": "mra7uqn",
      "body": "Good for you.",
      "created_utc": 1746726971.0,
      "score": 1
    },
    {
      "id": "mrblkxn",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1746741928.0,
      "score": 1
    },
    {
      "id": "mrcyu62",
      "body": "Congratulations. Wish more people would do this",
      "created_utc": 1746760092.0,
      "score": 1
    },
    {
      "id": "mrdbukj",
      "body": "You rocked it! I probably would've done the same.",
      "created_utc": 1746766040.0,
      "score": 1
    },
    {
      "id": "mrdgr5j",
      "body": "Good on you 🥳",
      "created_utc": 1746768544.0,
      "score": 1
    },
    {
      "id": "mre0dyg",
      "body": "You are a WARRIOR!🙌🙌",
      "created_utc": 1746780452.0,
      "score": 1
    },
    {
      "id": "mre6xt9",
      "body": "your rapist might know a guy on the police force, thats why nothing has happened. post it on facebook and send the audio to a big news company outside your town. make a lot of noise. it will force the cops to do something. worst thing about small towns is if you are buddies with the cops you can tend to get off a lot of charges.",
      "created_utc": 1746784600.0,
      "score": 1
    },
    {
      "id": "mrgjzls",
      "body": "Im so sorry to hear that i cannot even imagine how terrible it was",
      "created_utc": 1746814564.0,
      "score": 1
    },
    {
      "id": "mrpbd9m",
      "body": "Im proud of you OP! Praying for you to move on from this tragic life event. Laban lang OP. Next mo yung sa alcohol alis mo din onti onti. Kaya mo yan! 👊",
      "created_utc": 1746939361.0,
      "score": 1
    },
    {
      "id": "mrplkoq",
      "body": "I’m so beyond happy for you! It’s something that you can’t describe but it makes you feel so much better about life when they get what they had coming. Someone my whole family knows raped me when I was a teen all because of a back rub and I was scared so I said nothing for a few weeks then my mom said when I finally told her “should have said something sooner I would have done something about it” needless to say my brothers got a bunch of people riled up after drinking for the 4th of July and we went to his dads house and kick everyone’s ass I got a few kicks in on the guy and watched one of my bros k!ck someone’s head against a tree",
      "created_utc": 1746945033.0,
      "score": 1
    },
    {
      "id": "mrv9e2o",
      "body": "So kind of you to give him a traditional \"Detroit Good Morning\"! 🥰🦶🧱 \n\nI do hope you're able to move on with life, despite the trauma. That guy deserves to rot in a prison.",
      "created_utc": 1747027676.0,
      "score": 1
    },
    {
      "id": "mrxfqs4",
      "body": "Yet another example of the legal system not protecting women. This guy deserves much worse.",
      "created_utc": 1747064023.0,
      "score": 1
    },
    {
      "id": "ms2xp12",
      "body": "I’m really glad that you got him for what he did to you. It’s disgusting that the police did so little about it ",
      "created_utc": 1747139819.0,
      "score": 1
    },
    {
      "id": "ms3of8w",
      "body": "You inspired me to do the same thing. Thanks girl! I’m glad he got what he deserved ",
      "created_utc": 1747148475.0,
      "score": 1
    },
    {
      "id": "ms564gt",
      "body": "You stood on business",
      "created_utc": 1747163989.0,
      "score": 1
    },
    {
      "id": "ms592g5",
      "body": "Im so fucking sorry that happened…\n\non that note, HELL YEAH??",
      "created_utc": 1747164863.0,
      "score": 1
    },
    {
      "id": "ms7w4y1",
      "body": "Glad you got your revenge, may all of us get it",
      "created_utc": 1747197663.0,
      "score": 1
    },
    {
      "id": "ms8a11g",
      "body": "Incredibly proud of you OP, I sometimes wonder if I could do this to my sibling's abuser one day. Maybe one day.",
      "created_utc": 1747205137.0,
      "score": 1
    },
    {
      "id": "ms8zdya",
      "body": "Well done!",
      "created_utc": 1747220306.0,
      "score": 1
    },
    {
      "id": "mscmamu",
      "body": "Good job. You are brave and I pray you fully heal from such an awful event.",
      "created_utc": 1747261352.0,
      "score": 1
    },
    {
      "id": "mscwys2",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1747264977.0,
      "score": 1
    },
    {
      "id": "mu63gw6",
      "body": "Im not gonna read the whole thing because ik I'd feel sad but I read the title and hell yeah dude good for you!",
      "created_utc": 1748180040.0,
      "score": 1
    },
    {
      "id": "mrc14hr",
      "body": "This is just a bullshit story. The cops get called because someone is attacking someone else. They arrive and arrest the victim and the let the other person go? This isn't what would happen anywhere, the backstory doesn't matter in the slightest, the cops don't know about that\n\nHow is anyone believing this?",
      "created_utc": 1746747405.0,
      "score": -4
    },
    {
      "id": "mr4fnt1",
      "body": "I imagine this as a huge jump flying ninja sidekick to the face, just imagine raping and then the same guy u raped comes at u with a huge flying huge jumping side kick to your face",
      "created_utc": 1746647479.0,
      "score": -16
    },
    {
      "id": "mr82wlt",
      "body": "Shit gave me chills",
      "created_utc": 1746702002.0,
      "score": 55
    },
    {
      "id": "mr8e2sm",
      "body": "[ Removed by Reddit ]",
      "created_utc": 1746706772.0,
      "score": 3
    },
    {
      "id": "mrxtjzd",
      "body": "Best line ever",
      "created_utc": 1747068093.0,
      "score": 1
    },
    {
      "id": "mr5ik3h",
      "body": "I really hope the judge does take this into account and not jail her. Unfortunately I can imagine some hardass saying he can understand why she did it, but it was still assault and she has to be jailed. There are far too many women jailed for assault or murder when it was in self defense. \n\nI think OP has a strong argument for not being in her right mind doing what she did. It wasn’t premeditated. He instigated her doing this not just because of what he did to her in the past, but by what he was currently saying to her, in essence making her believe he was going to assault her if she didn’t defend herself immediately. \n\nOP, I would contact a domestic violence agency and see if they can recommend any legal resources that will help find free or low cost legal help. They might not help you directly but may know of someone who will.",
      "created_utc": 1746659414.0,
      "score": 153
    },
    {
      "id": "mr4cp96",
      "body": "[removed]",
      "created_utc": 1746646620.0,
      "score": 166
    },
    {
      "id": "mrdyv5o",
      "body": "They will always be inactive with ordinary citizens.",
      "created_utc": 1746779461.0,
      "score": 3
    },
    {
      "id": "mrhf002",
      "body": "Damn, it's crazy how the police are dropping the ball in this situation. You're doing the right thing by speaking up. Your story matters, and your voice needs to be heard. Stay strong, hope you get the support you deserve.",
      "created_utc": 1746824112.0,
      "score": 1
    },
    {
      "id": "mr580tn",
      "body": "Yep! Best quote I’ve heard in a while. Thanks for sharing",
      "created_utc": 1746655832.0,
      "score": 46
    },
    {
      "id": "mr5diix",
      "body": "[deleted]",
      "created_utc": 1746657683.0,
      "score": 34
    },
    {
      "id": "mr6679t",
      "body": "OP needs to get jacked to a montage of \"X Gon' Give It To Ya\" and then put a recurring daily event on her calendar to beat him unconscious.",
      "created_utc": 1746667587.0,
      "score": 41
    },
    {
      "id": "mrav1yg",
      "body": "Father of a 5yr old girl. I just want to say I’m sorry that happened to you. I’d live my life in blind rage if I were you I do believe.",
      "created_utc": 1746733799.0,
      "score": 5
    },
    {
      "id": "mrdcdx2",
      "body": "I'm so sorry 🫂 I can't even imagine your pain, I hope he gets what he deserves. The fact that no one warned you is heartbreaking. You sound like a great mom, I know your kids are so lucky to have you 🤍",
      "created_utc": 1746766308.0,
      "score": 3
    },
    {
      "id": "mrdd9qr",
      "body": "Thank you <3 It was very kind of them, I'm shocked they did something good for once",
      "created_utc": 1746766752.0,
      "score": 2
    },
    {
      "id": "mrddfgf",
      "body": "Thank you 🤍 I agree, he really deserved that shit and it felt great. Many hugs right back 🫂",
      "created_utc": 1746766829.0,
      "score": 3
    },
    {
      "id": "mrlsfil",
      "body": "% of rapes reported to police is typically 8%-22% in western countries. (From large scale randomised surveys & police records)\n\nUS % of rape reports to police which result in felony conviction with any jail is steady around 2.0%.  \nUS gets 75% conviction rate in court. But that is after plea bargaining.   UK, NZ were \\~50% ten years ago when I last looked.\n\n  \nSoooo...  Bottom line is police & courts don't have a part to play in the vast majority of rapes. For a number of reasons, but one big one is that cases with enough evidence to get a conviction are relatively unusual.\n\nYou could look into what happened in UK \\~10? years ago when govt secretly lowered the prosecution conviction rate target in an attempt to bring more rapists to justice, without giving enough extra resources to prosecution teams.  It is a good introduction to some of the issues in SA prosecutions.",
      "created_utc": 1746892185.0,
      "score": 2
    },
    {
      "id": "mrdcu6f",
      "body": "I have actually also been falsely accused of drugging my ex, I know how absolutely horrifying it is when you're innocent. It's one of the worst things someone can do to you without physically harming you, they take all the grace and benefit of the doubt we give real victims and abuse it for their own gain. It's disgusting, I hope you're able to move past it 🫂",
      "created_utc": 1746766536.0,
      "score": 2
    },
    {
      "id": "ms1tale",
      "body": "Aww thank you! That actually means a lot, I love writing :)",
      "created_utc": 1747118310.0,
      "score": 2
    },
    {
      "id": "msghqxe",
      "body": "I'm so sorry lovely </3 You didn't deserve that, I'm praying for their downfall. I hope you're able to overcome it, I'm rooting for you!",
      "created_utc": 1747320609.0,
      "score": 1
    },
    {
      "id": "mr9cuu2",
      "body": "Hard agree!",
      "created_utc": 1746717986.0,
      "score": 1
    },
    {
      "id": "mrdbhf2",
      "body": "Thank you lovely 🤍",
      "created_utc": 1746765857.0,
      "score": 1
    },
    {
      "id": "ms1szmz",
      "body": "Thank you so much 🤍 That's very comforting",
      "created_utc": 1747118132.0,
      "score": 1
    },
    {
      "id": "mr4qjm9",
      "body": "Empathy? She got an assault charge.",
      "created_utc": 1746650580.0,
      "score": 3
    },
    {
      "id": "mr7eymp",
      "body": "I would definitely agree if I lived in the US, but I'm from Finland. Our police are actually pretty okay compared to the rest of the world. Thank you still!",
      "created_utc": 1746687647.0,
      "score": 9
    },
    {
      "id": "ms1t4ho",
      "body": "I'm so sorry that happened to you, I'm glad you got a sliver of justice. Your brothers rock",
      "created_utc": 1747118210.0,
      "score": 2
    },
    {
      "id": "mrdbeke",
      "body": "Honestly, I'm as shocked as you are. I think what contributed is that the second time he managed to fight back, he hit me in the head and got completely on top of me and held me still. Now this is a pretty reasonable response from him, but I was freaking out hard. I managed to wiggle out and just kept hitting him in the head lol, my hand was actually bleeding by the end of it. During the whole time and after as well he was wailing like a fire alarm. He is genuinely crazy, his brain is absolutely fried and he 100% has drug induced schizophrenia. \n\nI was a sobbing mess and I told the cops about what happened a year ago and how they have done absolutely notging, and I was cooperative and gave them all my details. Honestly I'm really confused about why they let me go but I guess maybe they felt bad for me. They told me something about how they're bringing him in so I don't have to see him for at least a little bit. It was very kind of them :)",
      "created_utc": 1746765817.0,
      "score": 6
    },
    {
      "id": "mr5pspf",
      "body": "Also, don't forget about jury nullification.",
      "created_utc": 1746661850.0,
      "score": 37
    },
    {
      "id": "ms51hve",
      "body": "I don't think anyone is going to get the message that its okay to beat someone up based on hearsay from this story. Op beat up their own rapist, they recorded it, they experienced it, they know 100% that its that person. \n\nI think this idea that false rape accusations are super common is just not based in reality. I know thats probably not how you meant it, but I just don't think clarifying that people should only beat up \"absolutely GUILTY rapists\" is so relevant to this post where someone is talking about beating up the person who raped them. \n\nThey experienced the rape and people are reassuring them that what they did is an understandable reaction. People are trying to let them know theres no shame in what they did, nobody is normalizing or encouraging beating up a stranger based on hearsay. Using the term \"absolutely GUILTY rapists\" can contribute to a culture of people not believing victims imo. \n\nJust putting that out there. Not meaning to throw shade your way or anything",
      "created_utc": 1747162630.0,
      "score": 3
    },
    {
      "id": "ms51rjx",
      "body": "I could be wrong but I think op is a man.",
      "created_utc": 1747162707.0,
      "score": 3
    },
    {
      "id": "mrbopbq",
      "body": "I honestly go from that rage to feeling helplessness. I am still feeling it all. I will not lie. I go from constant “fuck it I’m k* lling her, them” but I can’t. I WILL go to prison and then what? My daughters and son will be alone and vulnerable and more broken than ever before. The thing is that it does not mean I won’t be figuring out a way for them to pay, I just don’t know how and what they way is just yet. \n\nMy children are my priority, I will love is this Tim oil for THEM, if I have to. But I will never leave their side and fail them ever again.",
      "created_utc": 1746742999.0,
      "score": 4
    },
    {
      "id": "mrmtmez",
      "body": "Thank you. I couldn't have gotten a better answer if I used ChatGPT.",
      "created_utc": 1746904461.0,
      "score": 2
    },
    {
      "id": "mrdj96u",
      "body": "🫂 Healing and will get past it soon. Honestly it fucks you so bad in the mind.",
      "created_utc": 1746769908.0,
      "score": 2
    },
    {
      "id": "mr56qsk",
      "body": "They could have done so much worse. She could have, and probably should have been handcuffed and hauled away for this particular incident but didn't and gave him an assault charge which as far as I can tell he didnt do,  giving her an out in the judicial process.  \n\nIf you can't see the bigger picture I dont know what to tell you. They basically gave her free reign on kicking his ass and made it out so she can get the minimum consequences. With cameras or witnesses everywhere now a days, You can't expect much better than that. \n\nIf they charged just him and let her go, a shitstorm would have happened including the police officers possibly being suspended. But they listened to her story and tried to help. Yeah, good on them for helping her out.",
      "created_utc": 1746655415.0,
      "score": 6
    },
    {
      "id": "mret1f6",
      "body": "Miten ne pidätti sen pirinistin? Eiks se tarvinnu sairaalahoitoo tai mitään? Voimia!",
      "created_utc": 1746794805.0,
      "score": 1
    },
    {
      "id": "mr8glqx",
      "body": "The stakes are too high for you to be this naive. ",
      "created_utc": 1746707738.0,
      "score": -1
    },
    {
      "id": "msippx4",
      "body": "Wish they were that cool still though",
      "created_utc": 1747344029.0,
      "score": 1
    },
    {
      "id": "mrdhgj0",
      "body": "Even bigger lie",
      "created_utc": 1746768919.0,
      "score": -6
    },
    {
      "id": "mr8y72m",
      "body": "If it ever comes to that, I absolutely and wholeheartedly agree!! Full disclosure I am not a legal expert, nor claim to be one. However, she should be aware that (if I remember correctly) it can be considered grounds for a mistrial if mentioned in some context to the jury. I’m not certain, possibly if suggested by her lawyers or herself? (definitely correct me if I’m wrong on that!)\n\nJust saying… maybe she should keep us supporters somehow updated and if it does go to court, a little birdie can somehow find a way to (legally, so it doesn’t cause a mistrial or accusation of intimidation or something?) of this perfectly legal option.",
      "created_utc": 1746713654.0,
      "score": 12
    },
    {
      "id": "mreohva",
      "body": "You didn’t fail them. Your family did. I decided I don’t want to live in a world where I can’t trust my family, so I do. I can’t say I would have done anything different than you did. Maybe that’s why this hurts me so much. Your response is just too fucking real. Keep doin you bro, one day at a time.",
      "created_utc": 1746793041.0,
      "score": 2
    },
    {
      "id": "mrdi025",
      "body": "alright, fuck you then. i don't have to prove shit to you",
      "created_utc": 1746769215.0,
      "score": 7
    },
    {
      "id": "mrdlgao",
      "body": "If you had actually read the whole story, you'd have read that OP WAS arrested/charged, they were just let go on what I assume is the equivalent to a PTA (promise to appear) in their country, which is Finland, because they were fully cooperative, while the rapist was taken in because he was screaming and belligerent.",
      "created_utc": 1746771151.0,
      "score": 3
    },
    {
      "id": "mrihnm9",
      "body": "If even one juror already knows about jury nullification, her troubles are over. ",
      "created_utc": 1746837726.0,
      "score": 2
    },
    {
      "id": "mrgxhgr",
      "body": "Thank you thank you 🙏 I will",
      "created_utc": 1746818703.0,
      "score": 2
    },
    {
      "id": "mrdj8zo",
      "body": "You sure don't",
      "created_utc": 1746769905.0,
      "score": -4
    },
    {
      "id": "mrdlpxc",
      "body": "Possibly because he was attacked? He would have went in an ambulance. Apparently OPs hands wear all bloody so theh definitely would have went in an ambulance",
      "created_utc": 1746771305.0,
      "score": 1
    },
    {
      "id": "mrdn2gv",
      "body": "I'm confused. First, you're saying OP is lying because she's claiming that she wasn't arrested and the rapist was, but when I point out that OP said they actually both were arrested but only the rapist was taken away, you're saying that the rapist must have been taken away in an ambulance..... so what is it that you're actually claiming here? Cause it seems like the goalposts just moved.",
      "created_utc": 1746772081.0,
      "score": 2
    },
    {
      "id": "mrdnrbu",
      "body": "When did I agree with anyone being arrested? You're not arrested if you aren't brought to an arrest which op wasn't since they were let go\n\nThe other person shouldn't have been arrested because they were the victim, they got attacked. \n\nIf op attacked someone so bad that their hands were all bloody then the person on the other end most likely needs an ambulance.\n\nHow does this story make any sense in your head?",
      "created_utc": 1746772491.0,
      "score": 1
    },
    {
      "id": "mrdq19y",
      "body": "You can absolutely be charged without being brought in, depending on the countries laws. It's happened to me.\n\n\nIt sounds like the other person was arrested because they fought back to a degree that the cops thought was over the top. It's actually pretty common that two people in a fight can be arrested even if one of them was the clear aggressor. \n\n\nMaybe they were brought to the hospital? We don't know that they weren't. And even so, OPs hands could have been bloodied even if the other person's injuries weren't egregious. They could have gotten bloodied up because they had rings on, or the other person had hard accouterments on their clothing, or any number of reasons.",
      "created_utc": 1746773845.0,
      "score": 2
    },
    {
      "id": "mrdq7g1",
      "body": "You really can't read. When did I say you can't be charged without being arrested lol. It's fine, you can believe the story",
      "created_utc": 1746773948.0,
      "score": 1
    },
    {
      "id": "mrioz7o",
      "body": "you: you're not arrested if you aren't brought in to an arrest which OP wasn't\n\nme: you absolutely can be charged without being brought in\n\nyou: when did I say you can't be charged without being arrested lol\n\n🤔🤔🤔 can YOU read your own writing??",
      "created_utc": 1746840564.0,
      "score": 3
    }
  ]
}