{
  "id": "1j0tkzw",
  "title": "YOU FUCKING BRAINWASHED IDIOTS",
  "selftext": "My family, Latino family, who fled dictatorial extermination in Nicaragua, my sister a vulnerable pregnant women and  her children, refused to listen to all my warnings, refused to vaccinate, refused to vote BECAUSE ITS IN GODS HANDS, called me damned to hell for leaving the faith THAT ABUSED US, are watching people of any skin colour not white get deported, and believe it or not STILL THINK ITS ALL GONNA BE OK!!!!!!!!\n\nThe last time a leader said hateful divisive things like this, half our extended family were butchered by machete and thrown in a river, and YOU STILL THINK HES GODS CHOSEN ONE??!?\n\nYOU SUPPORT A RAPIST  THATS IMPORTING THE TATE BROTHERS, ACTUAL RAPISTS *ONE STATE LINE AWAY FROM YOUR UNDERAGE DAUGHTERS*!?!??  \n And then… when I sent you the news today, as soon as the commentator said rape, or oh my god, or any type of language that is accurately describing the disgraceful reality, YOU IMMEDIATELY SAY\n “I listened to a little bit of it but the guy has such a 🚽 mouth I quit. Find me another one to listen to.”\nTHE EVIL IS COMING FROM INSIDE THE HOUSE YOU IDIOT!!!!!!! \n\nWHAT THE FUCK IS WROOOONNNGGGG WITH YOU!?!?!? FUUUUCCCKKKKK  \n\n\nEdit ONE. \nFuck you maggots. \n\nEdit TWO.\nI said they refused to vote, that means their CITIZENS, and your comments demanding immiediat deportation shows YOU are the problem.  I wish you a swift end to a life of hatred. \n\nEDIT THREE\nHAHAHA YEA LETS BLOW THIS THE FUCK UP, ILL FIGHT ALL OF YOU IDIOTS!  IN FACT…. IF ALL AMERICANS USED THERE 2AMENDMENT RIGHTS, THIS WOULDN’T HAVE HAPPENED IN THE FIRST PLACE, but “Nooooooo books scary” \nIf you’re not bilingual, stop fucking talking ",
  "created_utc": 1740812041.0,
  "score": 8941,
  "num_comments": 81,
  "url": "https://www.reddit.com/r/offmychest/comments/1j0tkzw/you_fucking_brainwashed_idiots/",
  "comments": [
    {
      "id": "mfeax2h",
      "body": "In the event of an emergency, put on your own oxygen mask before assisting others",
      "created_utc": 1740813427.0,
      "score": 6660
    },
    {
      "id": "mfecwal",
      "body": "the crash out is real im sorry mija",
      "created_utc": 1740814564.0,
      "score": 3259
    },
    {
      "id": "mfecpgy",
      "body": "It can be hard sometimes. I know you love them, but don’t forget that you shouldn’t throw yourself in a drowning boat so to speak. If you have the freedom to leave, take it. Do your best effort to convince them, try different ways, etc. Family is important and you need support columns in life. But in the end, prioritize your own health, be it mental or physical. If you don’t, you’ll regret it for the rest of your life.\n\nAnd please ignore the handful of comments under this post that lack basic human empathy and common sense. Reddit has the good and bad of humanity, and I try to block out the bad as much as I can, for my own sanity.",
      "created_utc": 1740814455.0,
      "score": 1242
    },
    {
      "id": "mfecbiz",
      "body": "Hey, that all sucks so much and your anger at their stupidity is justified. \n\nAlso I hope your can ignore anyone giving you suggestions to calm down or leave or whatever.  Feel, be angry. Many of us are. And that's what this space is for, to vent and rant.",
      "created_utc": 1740814229.0,
      "score": 946
    },
    {
      "id": "mfej911",
      "body": "The evil is coming from inside the house. I love that line",
      "created_utc": 1740818404.0,
      "score": 592
    },
    {
      "id": "mfehe05",
      "body": "it’s almost like the real “mind virus“ is certain strands of Christianity, machismo/bro culture, and anti-intellectualism.",
      "created_utc": 1740817251.0,
      "score": 718
    },
    {
      "id": "mfeip2l",
      "body": "The comments from white people saying \"You're not welcome\" or \"do it legally then\" are hideous. Imagine thinking that a country your forefathers invaded is yours and yours alone...",
      "created_utc": 1740818054.0,
      "score": 851
    },
    {
      "id": "mfed5vk",
      "body": "Dude! I totally feel like that when ppl defend that fkn moron… Hitler reincarnated in the absolute worst person ever and ppl are acting and defending the fkn piece of trash just the way the German did…. The more trash I see, the more realistic a move seems to me…",
      "created_utc": 1740814718.0,
      "score": 329
    },
    {
      "id": "mfei8b9",
      "body": "No shoes, no shirt, tits out, toes out, fists out! Il fight them all with ya!",
      "created_utc": 1740817768.0,
      "score": 182
    },
    {
      "id": "mfeces0",
      "body": "I’m so sorry, about your family and all their horrific experiences. And I agree with you about the Nazis running this country.",
      "created_utc": 1740814281.0,
      "score": 178
    },
    {
      "id": "mfei5oo",
      "body": "So real ngl",
      "created_utc": 1740817723.0,
      "score": 104
    },
    {
      "id": "mfeg2e4",
      "body": "As a former church goer! All I have to say is,\n\nPreach son!!  🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾",
      "created_utc": 1740816448.0,
      "score": 121
    },
    {
      "id": "mfeifr5",
      "body": "Amen.",
      "created_utc": 1740817893.0,
      "score": 46
    },
    {
      "id": "mfeb4x1",
      "body": "They’re in denial. They feel helpless, and they probably voted for Trump thinking that the best way to protect themselves from a powerful enemy was to join up with the powerful enemy. It can’t come after you when you’re in the passenger seat. That’s what they want to believe. The United States was their refuge from a violent hate-filled place. When the United States becomes a violent hate-filled place, where will they go? So they think, Running away didn’t work. Fighting it won’t work. So they throw the beast a treat by voting for it, then try to ignore it, hoping it will go away. \n\nAnd, to be extremely blunt, nobody is different than the country they grew up in. If hatred and intolerance where you grew up reached the point of mass murder, then it seems very moderate to simply vote Republican. They would never physically hurt their neighbors, but perhaps xenophobia feels natural to them. Perhaps Trump’s rhetoric is comfortingly familiar without being an outright call for mass murder. \n\nTyranny lowers your standards. I had friends whose parents had fled institutionalized antisemitism in the Soviet Union, only to spend their old age being breathtakingly racist in the United States. Surviving persecution doesn’t always make us self-aware, and progressive, and noble. Sometimes we just want our turn at the wheel.",
      "created_utc": 1740813551.0,
      "score": 8
    },
    {
      "id": "mfegh9q",
      "body": "I’m so sorry! Your anger is valid.",
      "created_utc": 1740816700.0,
      "score": 76
    },
    {
      "id": "mfehn5w",
      "body": "[removed]",
      "created_utc": 1740817406.0,
      "score": -1
    },
    {
      "id": "mfec70c",
      "body": "[removed]",
      "created_utc": 1740814155.0,
      "score": -31
    },
    {
      "id": "mfebyju",
      "body": "[removed]",
      "created_utc": 1740814020.0,
      "score": -23
    },
    {
      "id": "mfegtgi",
      "body": "[removed]",
      "created_utc": 1740816905.0,
      "score": -10
    },
    {
      "id": "mfed1w3",
      "body": "You have to realize your anger at them goes into a void. You stress yourself more stressing about how they don’t stress.. it’s really hard and I understand your frustration, we can only hope for the strength and patience to get through these next few years.. take care of yourself",
      "created_utc": 1740814654.0,
      "score": -196
    },
    {
      "id": "mfehcfp",
      "body": "[removed]",
      "created_utc": 1740817225.0,
      "score": -6
    },
    {
      "id": "mfeb1oo",
      "body": "Anger isn't going to solve the issue. The more you push the more they'll push back. That anger is only making YOU suffer more. Maybe, and hear me out. Listen to them, see from their point of view. And * politely * tell them your opinions.      \nOpen free discussions is the only way to move forward, regardless of what side you're on. If you're unwilling to be objective to their point of view, why should they be open towards yours?",
      "created_utc": 1740813499.0,
      "score": -309
    },
    {
      "id": "mfeal29",
      "body": "[removed]",
      "created_utc": 1740813238.0,
      "score": -103
    },
    {
      "id": "mfeib81",
      "body": "Your going to have a stroke! Ignore the news! ",
      "created_utc": 1740817815.0,
      "score": -243
    },
    {
      "id": "mfeajl8",
      "body": "[removed]",
      "created_utc": 1740813214.0,
      "score": -24
    },
    {
      "id": "mfebd08",
      "body": "[removed]",
      "created_utc": 1740813679.0,
      "score": -85
    },
    {
      "id": "mfeakpy",
      "body": "Deink some water or lemonade you will feel better 😊👍",
      "created_utc": 1740813232.0,
      "score": -320
    },
    {
      "id": "mfeafvc",
      "body": "[removed]",
      "created_utc": 1740813155.0,
      "score": -94
    },
    {
      "id": "mfebmsg",
      "body": "What's going on in Canada?",
      "created_utc": 1740813834.0,
      "score": -150
    },
    {
      "id": "mfebe8m",
      "body": "I think this is absolutely instrumental to this person's situation, sometimes for your own safety you have to leave family behind, and thats ok in some situations",
      "created_utc": 1740813698.0,
      "score": 1497
    },
    {
      "id": "mfeimld",
      "body": "Oh my god this is perfect",
      "created_utc": 1740818011.0,
      "score": 323
    },
    {
      "id": "mfee9ig",
      "body": "😔 I’m so sorry, for everyone.",
      "created_utc": 1740815370.0,
      "score": 419
    },
    {
      "id": "mfei043",
      "body": "They can’t stop all of us🥲",
      "created_utc": 1740817628.0,
      "score": 671
    },
    {
      "id": "mfej8tz",
      "body": "🥹🫂\nIt’s funny, the only comments that made me cry are the ones supporting me. Ty.",
      "created_utc": 1740818401.0,
      "score": 762
    },
    {
      "id": "mfeeurv",
      "body": "USA is 4th Reich😰😨😓😱",
      "created_utc": 1740815724.0,
      "score": 158
    },
    {
      "id": "mfehw01",
      "body": "Damn… you might be onto something… shit did you read this in a book?",
      "created_utc": 1740817558.0,
      "score": 213
    },
    {
      "id": "mfehyaw",
      "body": "It’s nauseating.",
      "created_utc": 1740817597.0,
      "score": 145
    },
    {
      "id": "mfeih4g",
      "body": "🫡\nThey’ll have to take my head from my shoulders to make me shut up.  Come and fucking get it, incels.",
      "created_utc": 1740817918.0,
      "score": 206
    },
    {
      "id": "mfeimt7",
      "body": "🫂",
      "created_utc": 1740818015.0,
      "score": 79
    },
    {
      "id": "mfee479",
      "body": "What does this even mean",
      "created_utc": 1740815283.0,
      "score": 18
    },
    {
      "id": "mfechmi",
      "body": "Why is that?",
      "created_utc": 1740814327.0,
      "score": 16
    },
    {
      "id": "mfegvd0",
      "body": "People downvoting are realizing you have your head up your ass.  Stop not taking this seriously!\nThey want to kill us, same as the Sandinistas, but worse. They have more power, less restrictions, and no one believes them when they say them till.",
      "created_utc": 1740816938.0,
      "score": 81
    },
    {
      "id": "mfeh5l0",
      "body": "We’re all citizens. ICE is staining and arresting by color, not legality.",
      "created_utc": 1740817109.0,
      "score": 139
    },
    {
      "id": "mfegncl",
      "body": "See now I’m just channeling that energy at you. \nFuck you, and the “wait it out, it’s not actually that bad”.  The same ones that said that to our family before, have that blood on their hands, and you and everyone saying it will too.",
      "created_utc": 1740816802.0,
      "score": 182
    },
    {
      "id": "mfee37i",
      "body": "Their anger doesn’t go into a void. They just realize that arguing with people that hate our president is pointless. We would love to be able to actually argue with you, but most people think arguing is about being right. It’s all about reaching a mutual understanding. You can have your way of thinking and we can have ours. Until we try to see where each other are coming from with an open mind, it gets us nowhere. As a republican, it saddens me all the hate that I see from the other side. I know you think you see hate from ours, but I believe it all comes down to misunderstandings and a lack of communication.",
      "created_utc": 1740815267.0,
      "score": -207
    },
    {
      "id": "mfehtu0",
      "body": "Yes the legal ones. Look at who ICE has been arresting for gods sake. \nWHY DO TOU THINK HE WANTS TO REMOVE BIRTHRIGHT CITIZENSHIP??? To target the legal kids of legal refugees.",
      "created_utc": 1740817522.0,
      "score": 155
    },
    {
      "id": "mfega2z",
      "body": "I think I understand where you’re coming from, and I think that for the vast majority of the time, what you’re talking about can work, and sometimes, it may be the best way to handle it. \n\nBut not this time. \n\nDivision happens, but we need to live cooperatively, so we must keep trying. Sitting down at the table and trying to come to some compromises, or find basic things that we can agree on and build from, is often the first step. But, this doesn’t work when the people you are dealing with are not operating in good faith. It goes from “doesn’t work”, to “dangerous”, when the people you are dealing with refuse to acknowledge other people’s basic humanity, & fundamental right to exist. How do you come together, when the one across the table from you is trying to gut you under the table, as they lie to your face?",
      "created_utc": 1740816580.0,
      "score": 159
    },
    {
      "id": "mfeccsi",
      "body": "Dont know why this was downvoted so many times but I agree with you.",
      "created_utc": 1740814249.0,
      "score": -122
    },
    {
      "id": "mfefzo8",
      "body": "Dude I really feel sorry for you trying to make sense in this post, the only reason to comment here is to say poor kid and cry with him or to troll, pick one",
      "created_utc": 1740816402.0,
      "score": -88
    },
    {
      "id": "mfefysd",
      "body": "Stay off the internet",
      "created_utc": 1740816387.0,
      "score": -16
    },
    {
      "id": "mfeijvz",
      "body": "Damn, you didn’t even get to the educate yourself part of the post, just went straight to spewing your stupid all over the place",
      "created_utc": 1740817965.0,
      "score": 124
    },
    {
      "id": "mfebwcm",
      "body": "Since you feel that way, if all the tribes banded together to reclaim everything those old white folks - who enslaved my ancestors - stole, you keeping this same energy and packing your shit or nah?\n\nBc yall love to tell us to go back to Africa, and Latinos to go back below the Rio Grande, and Asians back to Asia, but you muthafuckas always come with “reasons” for why the crap you just spewed doesn’t apply to you (when it actually does more so than with any other group).",
      "created_utc": 1740813985.0,
      "score": 113
    },
    {
      "id": "mfecgsi",
      "body": "Weird comment because Jesus wants us to show love and hospitality to foreigners…",
      "created_utc": 1740814313.0,
      "score": 72
    },
    {
      "id": "mfeg0q0",
      "body": "Can you do something for me?",
      "created_utc": 1740816419.0,
      "score": 18
    },
    {
      "id": "mfedjnh",
      "body": "[deleted]",
      "created_utc": 1740814944.0,
      "score": -24
    },
    {
      "id": "mfeiu03",
      "body": "I read it in a magazine,  \nB-B-B-Bennie and the Jets",
      "created_utc": 1740818144.0,
      "score": 118
    },
    {
      "id": "mfegb8y",
      "body": "[removed]",
      "created_utc": 1740816600.0,
      "score": -5
    },
    {
      "id": "mfei87x",
      "body": "I understand why you’re so angry! Your sister and her children are already DEAD because they didn’t listen to you and get the vaccine. And now your surviving family won’t listen to you about the coming HOLOCAUST against Latinos? Infuriating!",
      "created_utc": 1740817766.0,
      "score": 67
    },
    {
      "id": "mfei0ip",
      "body": "[removed]",
      "created_utc": 1740817635.0,
      "score": -5
    },
    {
      "id": "mfeel3r",
      "body": "It is what it is, it's just reddit Lol.",
      "created_utc": 1740815562.0,
      "score": -99
    },
    {
      "id": "mfecqjq",
      "body": "Actually this! I'm Australian (white) my very English great grandparents CAME here, and yet every bloody aussie toting \"if your not Australian then Fxxx Off home\", first of all if your not ABORIGINAL then YOU don't belong here!! Absurd !!, white American's are also the worst...we are all from ENGLAND...read some history Geezus",
      "created_utc": 1740814473.0,
      "score": 58
    },
    {
      "id": "mfedytc",
      "body": "yyyeeesssss",
      "created_utc": 1740815194.0,
      "score": -6
    },
    {
      "id": "mfegga0",
      "body": "[removed]",
      "created_utc": 1740816684.0,
      "score": -37
    },
    {
      "id": "mfegwnq",
      "body": "Did not ask you but thanks for the input",
      "created_utc": 1740816959.0,
      "score": 8
    },
    {
      "id": "mfeibuk",
      "body": "A. That’s the excuse, B. It’s inherently racist, C. it’s being used to target legal immigrants and that’s illegal, AND MOST IMPORTANTLY 4. a refugee is not illegal. It’s people in fear of their lives, who will be murdered if they return home: \nThat’s a CORE principal of democracy. Go read your own damn history books you uneducated neckbeard.",
      "created_utc": 1740817826.0,
      "score": 149
    },
    {
      "id": "mfeeg5z",
      "body": "I'm white, and American,  and worked with the general public my entire life. can confirm that we are the absolute worst demographic in the country to have to be in the same room with on a consistent basis. it's fkn embarrassing.",
      "created_utc": 1740815481.0,
      "score": 44
    },
    {
      "id": "mfeghxc",
      "body": "Stay off the internet for today",
      "created_utc": 1740816711.0,
      "score": 33
    },
    {
      "id": "mfei1bf",
      "body": "[removed]",
      "created_utc": 1740817649.0,
      "score": -1
    },
    {
      "id": "mfefof8",
      "body": "I grew up Black in the white neighborhood, and the totality of white people are not the worst demographic per se - it’s that when the worst of white people show us who they are, the “NOT ALL WHITE PEOPLE” crowd don’t “object” vociferously or consistently.\n\nReally, white people - especially in all us former British colonies - need to bring back shunning and shaming, since the worst of y’all put so much currency in being liked and accepted.",
      "created_utc": 1740816213.0,
      "score": 40
    },
    {
      "id": "mfeieqr",
      "body": "Aw man why are you guys all so creepy",
      "created_utc": 1740817875.0,
      "score": 16
    }
  ]
}