{
  "id": "1h3wkr6",
  "title": "Nurses laughed at me and it made me happy when they panicked ",
  "selftext": "So this is just a rant because it bothers me. I \"won\" in the end but I don't really know who talk to about this. But I just gotta get it off my chest how happy i was to be proven right.\n\nSo I went to the ER because I had a fever I couldn't get down and felt like I couldn't breathe. When I approached the counter and explained what was going on two nurses who were sitting behind her snickered and laughed. One said to the other in a low voice \"She could at least try harder\" and the nurse at the counter rolled her eyes, smiled and said \"Okay sweetie well you can breathe okay\" I'm not really sure why they responded that way. Maybe I looked like someone else? But it took them 2 hours to check my temp and blood pressure and when I approached they gave me attitude. Only to find out I had a temperature of 104, low blood pressure, a heart rate of 148, and my oxygen level was at 85. The lady said \"Did you drive yourself here? You must be having a hard time breathing.\" I looked at her and said \"Crazy right? It's almost like it's almost like it's why I came here\" \n\nI'll be honest I did get a satisfaction of seeing their response! I got admitted shortly after and was hospitalised for a bit. But man I got so happy seeing the fear in their eyes!",
  "created_utc": 1733032345.0,
  "score": 5654,
  "num_comments": 199,
  "url": "https://www.reddit.com/r/offmychest/comments/1h3wkr6/nurses_laughed_at_me_and_it_made_me_happy_when/",
  "comments": [
    {
      "id": "lzu1j0o",
      "body": "I’m not an overly combative person but I’d be writing a letter to the hospital on that front. \n\nThey didn’t take you seriously and made you wait, rather than triaging a person with breathing issues with actual medical equipment and not sassy remarks. \n\nI’m glad to hear you’re ok now, OP",
      "created_utc": 1733033281.0,
      "score": 5053
    },
    {
      "id": "lzuxeuz",
      "body": "I work in an ER. regardless of what they THOUGHT due to what you said, as soon as you say short of breath they NEED to triage you and take vitals. Please report them.",
      "created_utc": 1733053916.0,
      "score": 405
    },
    {
      "id": "lzu6xft",
      "body": "It stinks to know that not everyone in the medical field is not as professional as they should be. Mean girls work everywhere. I hope you let them know, that you will be submitting a letter to the hospital. If they behaved that way with you, they do it to others. Which makes it hard for people to get help, when the professionals are the ones that are supposed to care for their patients!",
      "created_utc": 1733036425.0,
      "score": 682
    },
    {
      "id": "lzu7kew",
      "body": "They definitely thought you were a junkie coming in for a fix. How they treated you was completely unethical. You HAVE to report this in any way that you can. They could treat future patients in need the same way they have treated you. And those other people might not be as lucky as you",
      "created_utc": 1733036816.0,
      "score": 373
    },
    {
      "id": "lzusf1b",
      "body": "I had something similar in the USA. I was crying and I’m pain, she’s wheeling me to a room and very sarcastically told me I had gas and should walk it off. Turned out to be a kidney stone that had me popping vicodine for 2 weeks.they wanted me to pay 3 grand for that to add insult to insult and injury.\n\nIn New Zealand I got myself into the hospital feeling out of body and weird with strange fevers. It wasn’t there when I arrived, and they told me to go home. As I was walking out the door it hit me and I kinda wobbled and asked for help. 104 fever out of no where and really wild bp/hr. Ended up in intensive care after my heart tried to give out. Turns out I had developed sepsis and was going into shock. A nice left over from a surgery the week before to remove… you guessed it, a giant kidneystone. It was bad enough they put me on a little emergency plane to another hospital. \n\nMoral of the story: don’t trust your kidneys and endure \n\nSweden might have been the strangest though. I had surgery on my throat to remove a hpt tumor (that was causing my kidneystones…. ) and the site split open and I started bleeding everywhere. I lived right by the hospital so i clamped a hand over it and booked it over there on foot, scared a few pedestrians to boot. I get to emergency reception covered in blood trying to hold this shit closed and the woman says “we don’t handle that here, you need to go over there” … a 15m walk away. \n\nIf I had any sense I would have told her to call me an ambulance but I walked. I was so dizzy by the time i got there i just sat my ass on the floor and asked a nurse passing by to help me. They immediately told me I should be at the ER… where I’d just come from lol. I just kind of started crying and she ended up using the emergency bell to get help. Did get treated in that building, at least. Spent a week having that infection drained too. \n\nMoral of that story: just call the ambulance, apparently.\n\n\nNot sure why this kind of stuff happens, would rather it not. But it’s a global thing. Does feel nice to be validated though.\n\nVery glad you got the help you needed in the end.",
      "created_utc": 1733050671.0,
      "score": 89
    },
    {
      "id": "lzuth84",
      "body": "I’m a nurse and I cannot fathom being that much of a dick - I would absolutely contact the hospital and do your part to get rid of them. I work with elderly people, and I do have a patient who complains of respiratory issues but then sats perfectly - but I still check her immediately when asked, because it’s my job, because she knows her body, and again, it’s my job. \n\nRude nurses make me crazy.",
      "created_utc": 1733051387.0,
      "score": 77
    },
    {
      "id": "lzus0km",
      "body": "Oh man, I remember when I said it hurt when I was in labour and the midwife said 'well it's supposed to hurt that's why we call it labour'. It turns out my son was back to back resulting in forceps and a 3rd degree tear, I'd never been so satisfied when I saw her stupid face lol",
      "created_utc": 1733050396.0,
      "score": 69
    },
    {
      "id": "lzuq57k",
      "body": "I’m glad you’re okay! Similar thing happens to my ex… we sat in the waiting room for 2 hours before they checked his oxygen and it was like 65 by then. Suddenly it was an emergency 🙄",
      "created_utc": 1733049128.0,
      "score": 50
    },
    {
      "id": "lzuzced",
      "body": "shoot, we keep a pulse ox at the hospital i work at right up front. any SOB complaint and i throw it on real quick. most people are stable by HR and pulse ox, but there's always one that isn't. worth it to throw it on. sitting and laughing is insane.",
      "created_utc": 1733055079.0,
      "score": 42
    },
    {
      "id": "lzuckm8",
      "body": "I had something similar. I came in not being able to breathe - the admitting nurse waved me off thinking I was being dramatic. I waited over an hour to see a doctor. Turns out I was having a panic attack and an allergic reaction (besides the bad flu I actually had). \n\nThat bit of fear in their eyes - after snickering and sort of ignoring a patient - is somewhat satisfying. Who's the unreasonable raisin now? 😂\n\nIf you can, write a letter to the hospital about the event? That's ridiculous. 😕 \n\nGlad that you're okay now! 🌷",
      "created_utc": 1733039999.0,
      "score": 55
    },
    {
      "id": "lzv2zcr",
      "body": "Had a receptionist roll her eyes at me once. I was prepared for surgery less than 2 hours later and in the ER 6 hours after that. I wanted to smack her so bad.",
      "created_utc": 1733057128.0,
      "score": 26
    },
    {
      "id": "lzvxacl",
      "body": "I was told I was being \"dramatic\" when I walked into the ER after my bowel burst.  I nearly died of internal bleeding.  I walked up to the desk and said \"I just had major surgery and something is wrong.  I feel like I'm dying and I'm in extreme pain.\"\n\nThe nurses were telling me I was being dramatic and it was  probably just gas pains.  I was in emergency surgery almost immediately.  When I saw one of the nurses again I asked her if she was going to keep telling patients to \"stop being dramatic \" \n\nIt was obvious I was in bad shape.  I was completely soaked with sweat and I was pale white.  I think they finally figured it out when I passed out as the nurse was taking her sweet time checking my vitals.   I talked to the surgeon about it and he said he was going to be having a serious talk with the nurses.",
      "created_utc": 1733069253.0,
      "score": 25
    },
    {
      "id": "lzu6vr7",
      "body": "Report them to the nursing board.",
      "created_utc": 1733036395.0,
      "score": 83
    },
    {
      "id": "lzuk5xw",
      "body": "That would have made me upset. Just looking at your vitals it's all point to sepsis which should have been immediately treated. I agree with others to file a complaint. It was unprofesional of them to do that in the first place.",
      "created_utc": 1733045070.0,
      "score": 25
    },
    {
      "id": "lzv3401",
      "body": "Same thing happened to me last winter. The ER staff thought I was being dramatic since I could stand and talk I guess? Turned out I had severe pneumonia and could not in fact breathe. The hospital sent me a survey after my visit and I told them all about it. Idk if anything happened but I know hospitals take those surveys seriously since they can affect their funding so I hope they made changes.",
      "created_utc": 1733057197.0,
      "score": 19
    },
    {
      "id": "lzvbwma",
      "body": "I’m so sorry that happened to you. Some people should not be in healthcare. \nI had chemotherapy a few years ago. Oncologist told me if I had issues to go straight to my local ER. (Cancer clinic was an hr from me). Went to ER complaining of chest congestion, difficulty breathing. Explained to ER nurse I was being treated with chemotherapy for a brain tumour. Her response was mmhmmm as though I was making it up. ER doc came in, asked my symptoms. Instead of being helpful, she said “what can I do that your oncologists can’t do? Go home, take some Tylenol and rest” \nNext clinic appointment my medical oncologist called the ER and let them have it. Filed a formal complaint with the hospital. I had pneumonia.",
      "created_utc": 1733061305.0,
      "score": 33
    },
    {
      "id": "lzudrwx",
      "body": "Please contact the ER to let them know of these issues or report them to nursing board. I’ve worked in healthcare and this bias affecting patient care isn’t just unethical it’s dangerous to patient safety and potentially life threatening. When ppl say they can’t breath or are having chest pain, you automatically triage. Also some staff at intake/ check in aren’t qualified to give medical advice. They’ve really only had Basic Life Support training. This is very concerning. If you’re not confident enough to complain please have a relative speak on your behalf like a proxy or even tell your primary care provider because they’ll most likely get mad for you. I’ve yelled at other providers/health care workers for less.",
      "created_utc": 1733040780.0,
      "score": 46
    },
    {
      "id": "lzutncr",
      "body": "Took us 5 hours to get eye drops after my bf had welders flash...it was 3am, small towns nowhere and absolutely no one else was there... zero people came in or out... eye drops administered and we were out almost 5 hours later... just for eye drops... i was able to get donuts before going home to sleep.. so..... yay??",
      "created_utc": 1733051501.0,
      "score": 15
    },
    {
      "id": "lzv60yw",
      "body": "I was having really bad migraines. They were causing jaw pain, stiff neck, and me to lose vision. I kept going to the hospital and they kept treating me like a druggie. They'd make snide remarks and give me looks too. They'd give me the headache cocktail and tell me to leave. My PCP sent me to all kinda specialists and I got a lumbar puncture. I have a rare condition that causes me to have too much cerebral spinal fluid. I could have permanently lost my vision. Or worse. If they would have did an LP at the ER one of the many times I was there? I would have gotten a diagnosis a lot sooner. One of my doctors told me that I had symptoms that definitely indicated I needed the LP while I was there. I'd definitely file a complaint if I were you, though!",
      "created_utc": 1733058671.0,
      "score": 14
    },
    {
      "id": "lzwnevj",
      "body": "Wow as an emergency nurse, who triages. That’s horrifying. Your vitals should have been checked asap, regardless of your physical presentation and symptoms. You checked off SIRS criteria immediately, snarky comments aside, it shouldn’t matter why you were there - but that you were there.",
      "created_utc": 1733077453.0,
      "score": 14
    },
    {
      "id": "lzvo38o",
      "body": "One problem is that the ER functions as the only place a lot of people can go to for any kind of medical care. This bogs down the ER and makes things difficult when it's not a true emergency.\n\nThe opioid crisis made it so ANYBODY going to the ER in pain is looked at as drug seeking. I had a finger infection that I had gone to my doctor's office. After taking my vitals they called for an ambulance. I laid in a gurney for 2.5 hours in so much pain, it was like a truck was parked on my finger. The gurney was saturated in sweat and they finally gave me a nerve block. Within seconds I sank into the mattress as my body relaxed. My very first thought was why the F did they make me wait 2.5 hours just for a nerve block. 2 years ago I almost cut my index finger off. It was barely attached. They gave me 1/2 mg of morphine, wrapped it up and made an appt with an Orthopedist for the next day. They told me to take ibuprofen and acetaminophen. After the orthopedist did surgery, that left me with pins sticking out of my finger, he prescribed 3 of the  lowest dose oxy pills. The only thing that got me thru that was I had some 5 year old oxys pills I had saved. Took them for a few days then switched to max dose ibuprofen/acetaminophen. Recent L3 compression fracture in my spine, ibuprofen/acetaminophen again. At those pain levels, it just takes the edge off.\n\nNow in some states, some women have to nearly die before getting what used to be common emergency surgery. In fact several have already died while doctors refused these procedures fearing their being prosecuted.\n\nWe may have some of the best available healthcare, but getting it is almost impossible for an ever increasing number of people",
      "created_utc": 1733066090.0,
      "score": 14
    },
    {
      "id": "lzw6qje",
      "body": "Most US hospitals have a patient advocate...someone you can speak to about this.  And when you do, it took hours to be triaged, which SHOULD be done to every patient when they walk in.  They may put you in the waiting room after, if it's a busy night, but at least they know what your vitals are and the chief complaint.   These nurses failed you, and if they keep their jobs, they (possibly the entire ER) need to be retrained.  So many negative consequences could have come out of this because of their shitty attitudes.  I'm glad you're feeling better!!",
      "created_utc": 1733072307.0,
      "score": 13
    },
    {
      "id": "lzwxxqj",
      "body": "Once had a PACU nurse tell me she believed my oxygen sat was dropping because I was \"anxious about it.\" The procedure I was having was to confirm lung disease- I was in respiratory failure. Sometimes people are idiots🙃",
      "created_utc": 1733080625.0,
      "score": 12
    },
    {
      "id": "lzwpwac",
      "body": "as a healthcare worker i’m getting secondhand embarrassment from the way they treated you bc what the actual fuck. PLEASE report them",
      "created_utc": 1733078208.0,
      "score": 11
    },
    {
      "id": "lzugb2t",
      "body": "You may get a hospital surve!\n\nFeel free to use it! I recently had a hospital stay and was admitted through the ER. When I came in I felt like they treated me like I was there as a med seeker despite me *turning down pain meds* when I arrived. Turned out I needed emergency surgery. They were nicer in the ER after figuring out I was actually being stoic. I was sure to explain on my score card.\n\nIf you don’t get one, a letter is a great way to go. My goal is to get it to the people who are responsible for training so it doesn’t happen to others!\n\nPS - I’m sorry you went through that!!!",
      "created_utc": 1733042462.0,
      "score": 22
    },
    {
      "id": "lzvbf0g",
      "body": "You should probably complain.  My cousin went to the ER  with the same symptoms - I'm not sure how quickly she was seen, but it was very serious.  In less than 12 hours from entering the ER, she died of sepsis.  So those nurses should face some consequences.",
      "created_utc": 1733061096.0,
      "score": 20
    },
    {
      "id": "lzx9a71",
      "body": "I feel like too many healthcare professionals live by the mantra \"if they can talk, they can breathe\" and call it a day. That's only useful for figuring out if you're going to die in the next 5 minutes because your airway isn't clear.\n\nSo awful they wouldn't take a few minutes to check your vitals. Or even just the o2, takes like, 3 seconds to put that reader on. I'm sorry that happened to you. The moment you walked through that door, you were a patient they were accountable for. Sucks they didn't treat you that way. Hope you're feeling better! And I agree with the other commenters, definitely complain! It'll be on record that they didn't check your vitals when you came in and waited 2 hours for some reason, this will be a good learning experience for them.",
      "created_utc": 1733084076.0,
      "score": 9
    },
    {
      "id": "lzwozc8",
      "body": "My brother cut his finger in carpentry class and needed stitches because his tendon was out. And the nurse was like I'm sure it's not that bad we will have someone look at it. You should've made a appointment with your gp. Ans when they looked they were like yeah it's pretty deep and it was still bleeding .",
      "created_utc": 1733077931.0,
      "score": 8
    },
    {
      "id": "lzub9ks",
      "body": "It’s completely valid to feel upset about how you were treated—it sounds like the lack of empathy and professionalism from the nurses only added to what must have already been a terrifying experience. You had every right to go to the ER and advocate for your health when you were feeling that unwell. Their dismissive attitude could have put you in serious danger, and it’s frustrating that it took such critical symptoms for them to take you seriously.\n\nIt’s okay to feel some satisfaction at their reaction when they realized the severity of your condition. That moment validated what you were feeling all along. However, this also highlights a bigger issue with how patients are sometimes treated when their symptoms aren’t immediately obvious to others.\n\nIf you feel comfortable, consider reporting the experience to the hospital administration. It could help ensure that future patients aren’t subjected to the same treatment.\n\nMost importantly, I’m glad you got the care you needed and that you were admitted and treated. You did the right thing by going in and advocating for yourself. It takes strength to stand firm in situations like that—good for you. How are you feeling now? 💜",
      "created_utc": 1733039163.0,
      "score": 13
    },
    {
      "id": "lzufbp1",
      "body": "Report them please. They may do this to someone else and cause a loss of life.",
      "created_utc": 1733041805.0,
      "score": 15
    },
    {
      "id": "lzv50ms",
      "body": "You need to complain! That was unacceptable and their attitude could kill someone. Please file a complaint. \n\nI’m not going to go into my own awful story here but years ago my son was *very* ill. I took him to urgent care. The bored intake nurse said: “Sign in, sit down, it’s a very long wait” \n\nI myself, have lifelong asthma. I know from experience, when you are struggling to breathe, you are seen IMMEDIATELY. \n\nI insisted that he be evaluated. She resentfully called out a nurse and had him seen. He was hospitalized and admitted into ICU. \n\nScrew those nurses.",
      "created_utc": 1733058180.0,
      "score": 16
    },
    {
      "id": "lzvone5",
      "body": "It's quite the satisfaction, isn't it? I get frequent lung collapses. I am so used to them, that after I finish whatever errands/work I need for the day, I just walk into the ER and let them know that my lung had a spontaneous pneumothorax (medical terminology for a lung collapse) and that I need an x-ray and potentially a chest tube. Most of the time this is enough to be taken seriously since most people wouldn't bother to learn that terminology unless they needed to. And I feel like most medical professionals know that. But then you have some other ones... Now I will say that it's very likely they take one look at me and assume I am drug seeking; as a result of my lung condition, I weigh 110 lb soaking wet as a 36-year-old woman and when my lung is actively collapsed, I will be pale with big dark circles -- effectively looking more like a drug addict but someone who is experienced medically would probably easily tell the difference (for example, they'd recognize that my thin frame means I'm more likely to have a collapse and that my paleness would be a perfect indicator that I'm not getting enough oxygen). \nNow, new nurses often cannot tell and I cannot tell you how many times a nurse has dashed down the hall in a sort of test to see if I can keep up and follow them. In their minds, I cannot follow them if I have a collapse, simple! Except like I said, I have gone through this my entire adult life so I'm a bit used to it and I don't have trouble following them briskly down a hallway (quick shallow breaths mitigate a lot more than you'd think). I love watching the smugness fall off of their faces when the doctors rush in to talk to me about what they're going to do for my collapse. And usually someone will note out loud that I don't seem too bothered by it, which is then when I point out that I've had so many I've learned how to live with it -- That's when the aha moment happens in their brain, you can even see it on their faces. I live for that moment because I know it's going to make it easier for the next person.",
      "created_utc": 1733066285.0,
      "score": 8
    },
    {
      "id": "lzvv8wv",
      "body": "The director of that hospital needs to hear about this ASAP.",
      "created_utc": 1733068564.0,
      "score": 7
    },
    {
      "id": "lzx6scq",
      "body": "Sounds like you are a woman - which means the medical profession takes you much less seriously, underestimates your pain. It’s infuriating.",
      "created_utc": 1733083317.0,
      "score": 7
    },
    {
      "id": "lzuv57m",
      "body": "I’m not a complainer. I hate complaining. But I’d definitely be writing a letter about your experience. The way they treated you was so out of line!",
      "created_utc": 1733052473.0,
      "score": 5
    },
    {
      "id": "lzwcbxg",
      "body": "I fell over my dog and broke my back and had to go to the hospital by ambulance in the middle of the night. Staff thought I was drug seeking because im on psych meds(they loudly commented it to each other multiple times) and left me laying on a gurney for over 4 hours thinking I'd leave on my own if they ignored me. Finally got an xray and boy did they start to scramble! Funny thing is I can't even take anything stronger than Tylenol because it makes me sick.",
      "created_utc": 1733074064.0,
      "score": 6
    },
    {
      "id": "lzwl675",
      "body": "not as serious but I had something similar a few years back. I was like 19 and got an ear infection. This was my first ever ear infection and dear lord do I not wish that on my worst enemies cause that shit hurted lmao. But my mom took me to a clinic and I told the nurses and front desk person what I was feeling. And they just shrugged and told me to sit down and wait since they were busy and that an ear infection isn’t that serious, especially if I’m just able to look and act fine. After an hour or so, they bring me back to check vitals and most people went in and out but as soon as they finished, the nurse looked at my vitals and then at me and asked if I was feeling okay and I was like gurl what my ear hurts and I’m tired. \nApparently I had a fever of 103°, I had a bad infection in my right ear and my left was showing signs of infection too, blood pressure was low and heart rate was high and I was just sitting there like nothing. I got treated, they gave me meds and the front desk lady and nurse told me they hope I feel better and something along the lines of how they didn’t know how bad I was feeling when compared to my charts cause I didn’t seem to making a fuss about it.\n\nidk I totally get that some people “act ill” to get drugs or due to mental health issues but why would I want to spend my Saturday at a clinic near really sick people and also I didn’t have insurance so I’m also paying out of pocket as a broke 19 year old like miss ma’am get with the program. \n\nalso yes I do have some damage to my right ear from that due to how bad it was. It’s also super sensitive and my hearing is affected in that ear.",
      "created_utc": 1733076771.0,
      "score": 5
    },
    {
      "id": "lzxq1op",
      "body": "Please report these nurses. This is absolutely not right, I’m so sorry that these nurses treated you like that. I hope you’re feeling better soon, OP :)",
      "created_utc": 1733089263.0,
      "score": 7
    },
    {
      "id": "lzv0t9o",
      "body": "That's such a shitty way to respond to and treat patients. Your response was satisfactory af!!",
      "created_utc": 1733055928.0,
      "score": 6
    },
    {
      "id": "lzv3jnw",
      "body": "That's so shitty but yes so satisfying.  \n\nI had a similar thing happen when I started having heart arrhythmia episodes that would always go away when I went to my doctor.  He kept telling me it was just anxiety or dehydration, and I kept calling or coming in only to have it go away again.  After weeks of this he finally prescribed a Holter Monitor (basically a long-term ECG), after saying he would and me having to call a few times to remind him to actually fucking do it.  Lots of eye-rolling this whole time.\n\nAnyway, the Holter caught 3 different multiple -hours-long episodes of AFib.  I'll never forget the sound of his voice on the phone call telling me the diagnosis and that he'd already set up an appointment with the cardiologist for the next day.  I know in the American medical world the words \"omg I'm so sorry I totally fucked up\" can never happen, but this dude said it with his voice tone.",
      "created_utc": 1733057428.0,
      "score": 6
    },
    {
      "id": "lzv6ldv",
      "body": "This happened to my sister. Her friend showed up at the ER emergency drop off with my sister in the fetal position on the back of the car. The nurses were treating her like shit because she said she couldn’t get up to sit in a wheelchair. She’s super tough and wasn’t crying or anything so maybe they thought she was being dramatic. The one nurse in particular that was being nasty had the most shocked look on her face once they started talking about her needing a blood transfusion. She had a cyst rupture in her ovarian tube and her stomach had been filled with blood for about 24 hours.",
      "created_utc": 1733058940.0,
      "score": 5
    },
    {
      "id": "lzwhsve",
      "body": "That is so awful. Just like everybody else, I’m going to say definitely report that! \n\nTwo years ago I had a 105° fever and I could not stop vomiting. I told my husband we should probably go to urgent care. A few minutes later and the pain kicked up a notch so I told him we should probably go to the emergency room instead (it was about a 40 minute drive).  I had the poor man in a panic because we had been to the ER for him and for our daughters in the past, but I have chosen not to go there even when I probably should have. \n\nThe folks were nice, but I had to wait a little bit because of Covid protocols. It turned out I had a very large kidney stone that required surgery for removal, because of the bleeding and infection I could not have the surgery that day and needed just a stent put in.  \n\nI was very lucky that everybody was super kind. On my return trip to the OR to have the stone removed, again the folks were super nice. I made four dozen chocolate chip cookies and brought them to both the ER in the OR for my follow up appointment. Folks were doing their job, but they did it with compassion and I feel like that should be rewarded :-)",
      "created_utc": 1733075732.0,
      "score": 4
    },
    {
      "id": "lzv9cvl",
      "body": "My incident happened over 30 years ago. I used to smoke. I woke up one morning and was making my bed. I noticed I was out of breath and every time I stood up I felt something similar to a flop feeling in my left chest area. I went to the hospital and even though I kept telling them it was getting harder to breathe, it took 2 hours before I was taken to xray. It was a whirlwind after that. I had a spontaneous pneumothorax. I was cut open and had a chest tube inserted right in the er. I was awake and only received local anesthesia of course. That is a pain straight out of the pits of hell. The Dr said if the lung had moved just a tad more it could have hit my heart and caused a heart attack. It gets worse though, they sent me home, that night. I didn't think anything about it because  they knew best right? I learned many years later that I should not have been sent home.",
      "created_utc": 1733060201.0,
      "score": 4
    },
    {
      "id": "lzvc5hy",
      "body": "Go on to the hospital’s website and make a formal complaint. It doesn’t matter how long it’s been, do it. I am so angry for you. And yeah, I sometimes work on the ED front desk. Their behaviour is appalling.",
      "created_utc": 1733061410.0,
      "score": 3
    },
    {
      "id": "lzvol4j",
      "body": "I’m glad you’re feeling better!! I had a situation once where I went into the hospital while IN LABOR and the nurses said I was only dilated 3cm and tried to send me home. I absolutely refused and they admitted me. My child was born 45 min later. 😂😂 I absolutely hate being dismissed by know it alls. Good for you for pointing it out.",
      "created_utc": 1733066263.0,
      "score": 3
    },
    {
      "id": "lzvtjs4",
      "body": " You need to report their behavior. You could have died. This is not acceptable.",
      "created_utc": 1733067984.0,
      "score": 5
    },
    {
      "id": "lzw0srm",
      "body": "Those front desk nurses can be so rude and weird. I accidentally cut my arm near my wrist with a box cutter at work like 15 years ago. The entire time I was there, they made SH jokes and repeatedly told me that I had bad aim. They don’t know me or my mental health… that was a dangerous game they were playing.",
      "created_utc": 1733070406.0,
      "score": 3
    },
    {
      "id": "lzxvdn0",
      "body": "I've been working in a hospital for a month now, in reception. Nurses unfortunately do talk pretty awful shit about patients, and it's really thrown me for a loop. I'm guessing these two got too bold. The ones I work with at least keep it to their work areas and away from patients but I wouldn't be surprised if they decided to get bold and do something like this.\n\nI'm glad you're better and I definitely recommend reporting it.",
      "created_utc": 1733090984.0,
      "score": 5
    },
    {
      "id": "lzvsqlg",
      "body": "People often forget that nurses are usually the mean girls from highschool that had no life plan and settled to become nurses",
      "created_utc": 1733067707.0,
      "score": 11
    },
    {
      "id": "lzv41pw",
      "body": "They probably thought you were drug seeking. Heck, maybe you look like a “frequent flyer” that pulls this a lot. That’s the only reason I can think for the “she could at least try harder” comment. \n\nI do think it’s fair to report this to the hospital-they failed to take you seriously, and that same delay could cause an otherwise preventable death.",
      "created_utc": 1733057686.0,
      "score": 3
    },
    {
      "id": "lzv7xvj",
      "body": "Please report these nurses! \nHope you’re okay!",
      "created_utc": 1733059566.0,
      "score": 3
    },
    {
      "id": "lzvapcm",
      "body": "I had a very similar encounter where I was diagnosed with asthma as a teenager but had zero problems with it for a decade, so I assumed I had just grown out of it and had completely forgotten about it to be honest. After a full day and night of not being able to breathe very well, I managed to drag myself to the hospital. I got to the counter and said that I was having trouble breathing and got such a fed up look from her. Once I got seen by a nurse, she told me that everyone gets a cold this time of year.\nWatching her face turn into pure worry as she listened to my chest and immediately had me in a nebuliser made me think ha! I'm not being dramatic!",
      "created_utc": 1733060788.0,
      "score": 3
    },
    {
      "id": "lzvd77o",
      "body": "Mean girl to nurse pipeline. It never surprises me how cruel some of these nurses can be.",
      "created_utc": 1733061848.0,
      "score": 3
    },
    {
      "id": "lzvsfob",
      "body": "You need to report them! This could happen to someone else and they could possibly die.",
      "created_utc": 1733067604.0,
      "score": 3
    },
    {
      "id": "lzvvtuj",
      "body": "Please report this!! The staff acts like this because they feel like nobody will take the time to report their behavior. You were dismissed and disrespected, please make sure you report this.",
      "created_utc": 1733068760.0,
      "score": 3
    },
    {
      "id": "lzw3607",
      "body": "I am so sorry you received such unprofessional treatment. \n\nNone of this is okay. They should have kept the comments to themselves or speak about it in the break room where no patients can hear them.\n\nObviously these nurses are so biased and they need to change that behavior. They seem to think almost everyone in the er wants pain medication or lie to get back sooner. \n\nI would report them. Even if you don’t have their names you just need to tell the hospital the times you were there and that they were working in the front. They can then narrow down who the nurses were and write them up or fire them.",
      "created_utc": 1733071176.0,
      "score": 3
    },
    {
      "id": "lzw3yuj",
      "body": "They thought you were a drug seeking person,  so sorry to hear that happen3d. Maybe contact one of your local TV stations  and tell them your story so they can let everyone know",
      "created_utc": 1733071437.0,
      "score": 3
    },
    {
      "id": "lzxle23",
      "body": "Oxygen level of 85? The standards are the same for America as in Europe right? Going lower than 95 is insane.",
      "created_utc": 1733087785.0,
      "score": 3
    },
    {
      "id": "lzxmu8p",
      "body": "My son was born not breathing because of nurses incompetence. They sent me home like 5 times (three times when I came in said he wasn't moving, and twice when I was bleeding and in active labor), came in a third time and couldn't walk, they snickered and demanded that I get out of the wheelchair and walk, and even sent the dr home after I had came in. Thank god my doctor happened to walk by on her way out the door and seen me lying there and checked on me as I was almost fully dilated! He was born blue, but thank god the dr got him resuscitated!",
      "created_utc": 1733088242.0,
      "score": 3
    },
    {
      "id": "lzy0osv",
      "body": "Report report report. This was not acceptable.",
      "created_utc": 1733092761.0,
      "score": 3
    },
    {
      "id": "lzys7q1",
      "body": "I used to be one of those folks who immediately praised someone upon learning they’re a nurse. Not anymore. It really feels like the good ones are outnumbered. I hope you feel comforted/less alone reading all these replies. \n\nAnd a biiiiiig F you to any healthcare worker that has acted like this. 🙃",
      "created_utc": 1733102424.0,
      "score": 3
    },
    {
      "id": "lzzgc1f",
      "body": "She damn well should have fear in her eyes, I agree with everyone who's saying report it or write a letter. Disgusting.",
      "created_utc": 1733111418.0,
      "score": 3
    },
    {
      "id": "lzznxvu",
      "body": "You should report this.",
      "created_utc": 1733114733.0,
      "score": 3
    },
    {
      "id": "m00kbm3",
      "body": "I used to work in an ER.\n\nNurses being assholes and ignoring patients was the norm for every shift. Constantly had people asking me to flag down their nurse because they would disappear for hours and not check up on them.",
      "created_utc": 1733134328.0,
      "score": 3
    },
    {
      "id": "lzvk4w9",
      "body": "The training for pain pill seeking behavior is like all scare tactic power trip bs. It's ruined patient care. I've gone in for anaphylaxis and until I was crying at the nurse doing my work up and saying I'm a mom, don't let me die.. I was treated like a liar because I had blue hair and tattoos. \n\nI left nursing because the pressure to disregard patients for efficiency is absolute bullshit.",
      "created_utc": 1733064639.0,
      "score": 5
    },
    {
      "id": "lzvk77k",
      "body": "Definitely call that hospital back and ask to speak to a patient advocate. The next person could die from mistreatment. Those nurses are probably getting paid very well to sit there . Please move forward with this. I work in healthcare. This needs to be reported.",
      "created_utc": 1733064664.0,
      "score": 2
    },
    {
      "id": "lzvmemb",
      "body": "Sometimes, it is just so satisfying to be right when people doubt you.  When I went to the hospital after my water broke during my first pregnancy the nurse told me I probably just peed myself.  Nope, my water had broken.  I just gave her an \"I told you so.\"",
      "created_utc": 1733065480.0,
      "score": 2
    },
    {
      "id": "lzvml9l",
      "body": "1000% file a complaint to the hospital. Unacceptable behavior from those in the medical field.",
      "created_utc": 1733065547.0,
      "score": 2
    },
    {
      "id": "lzvzxlm",
      "body": "You should have reported them. That is not the way a patient should be treated when they say they are having trouble breathing.",
      "created_utc": 1733070120.0,
      "score": 2
    },
    {
      "id": "lzwbtgq",
      "body": "Please reach out to your hospitals patient relations department. They would want to know about this.",
      "created_utc": 1733073904.0,
      "score": 2
    },
    {
      "id": "lzwdtg7",
      "body": "The mean girls from high school all became nurses and just continue being the mean girls.",
      "created_utc": 1733074527.0,
      "score": 2
    },
    {
      "id": "lzxc4pr",
      "body": "I was having blood pressure issues once.  This was before covid.  I felt awful enough my mom talked me into going to a walk in clinic.  The nurse there thought I was faking for whatever reason and I heard her conversation in the hallway about testing me.  They then gave me a flu test to be sure and made sure to really cram it up my nose and take forever doing it.  Like \"oops, sorry I have to redo this\".  It was awful and made me feel awful.  I dunno, just wanted to share.  You probably aren't the only person they have treated that way.",
      "created_utc": 1733084947.0,
      "score": 2
    },
    {
      "id": "lzxj7pb",
      "body": "Please report them. That treatment and disregard is unacceptable and literally kills people every day.",
      "created_utc": 1733087118.0,
      "score": 2
    },
    {
      "id": "lzxvuvr",
      "body": "Report them",
      "created_utc": 1733091142.0,
      "score": 2
    },
    {
      "id": "lzxys0i",
      "body": "You need to speak to someone because the next person might not be so lucky! My Aunt always did her makeup to the 9’s and when she went to the ER they looked at how good her makeup was and felt if she couldn’t breathe she would be able to do her makeup! Sat for 5 hours with me asking several times for help . She had popcorn lungs for a med reaction! While we sat I saw a friend enter with his elderly mom in his arms . She died in the waiting room",
      "created_utc": 1733092117.0,
      "score": 2
    },
    {
      "id": "lzy1pm3",
      "body": "as a nurse I want to say report them!",
      "created_utc": 1733093099.0,
      "score": 2
    },
    {
      "id": "lzybmto",
      "body": "I'm in healthcare and you should probably talk to patient relations or the manager/charge nurse bc thats a terrible way to treat people! You can also do it via survey as well if you dont wanna do the 1:1 thing",
      "created_utc": 1733096560.0,
      "score": 2
    },
    {
      "id": "lzynukf",
      "body": "I went to the ER with symptoms of appendicitis. It took 2 hours to be admitted even though I told them I had chest pains, couldn't stop puking, and pain in the bottom left abdomen. The first person that took my vitals disappeared for 30 mins, then the second one had to retake it because the info the first one took disappeared. Another 30 mins until I was given a bed. No one gave me a warm blanket or dressings to change into, I laid there in my soiled pants, shivering and in extreme pain. Then, another hour until Xrays and 30 mins later, the doctor walked in and said, \"did they tell you what you have?\" NO. You're supposed to tell me that, wtf?? Then casually said I have appendicitis. It was about 8 hours until they gave me surgery. I feared the whole time my appendix would burst. There was no sense of urgency, I honestly felt like I was going to die. I know people in the medical field deal with a lot, but my case only needed a bit of attention to know that it was urgent.",
      "created_utc": 1733100842.0,
      "score": 2
    },
    {
      "id": "lzynvhs",
      "body": "When my daughter had a high temperature and a low SAT rate (oxygen saturation rate) she was hospitalized with a combination of pneumonia AND the flu. She was weak as a kitten after 48 hours in the hospital. Glad you're o.k. and that is completely unacceptable by those nurses. To be fair most nurses are very focused and professional and maybe it was a crappy night of ER visits and they were a little punchy, but I would definitely report this lack of professionalism to the hospital. That's unacceptable...especially given the fact that they will be charging you out the wazoo for that ER visit. AND it was necessary.",
      "created_utc": 1733100852.0,
      "score": 2
    },
    {
      "id": "lzz1uzu",
      "body": "This is how nurses are now, they don’t take anyone seriously and thinks we’re all drug addicts wanting pills or just having a panic attack. Every time I go they laugh at me too even if it is just a panic attack I would still like to be treated with compassion, not made fun or or made to feel like a burden. I’ve heard stories of people actually dying in the lobby bc they’ve been sitting there for 6 hours in pain and nobody listens to them.",
      "created_utc": 1733105911.0,
      "score": 2
    },
    {
      "id": "lzz3l9g",
      "body": "Nurse here. I don’t work in the ER, but that is some uncalled for behavior and they deserve to be written up. We’re taught in nursing school to never dismiss or judge patients. I know many nurses do and it breaks my heart because patients are supposed to trust us and we need to advocate for them.",
      "created_utc": 1733106552.0,
      "score": 2
    },
    {
      "id": "lzz73yl",
      "body": "Can I ask what the cause was,?",
      "created_utc": 1733107861.0,
      "score": 2
    },
    {
      "id": "lzzp96z",
      "body": "This INFURIATES me. I worked at an ED that got many patients with previous interactions at EDs with healthcare “professionals” that would be better off working with rocks. I’m so sorry you went through that, you shouldn’t need to have something so serious to be taken seriously. \n\nPlease, not only report this to the hospital but see a malpractice attorney. You can even call the local bar association and see if you have a case. Hospitals and freestanding EDs have to meet certain standards of care, and you were failed. You can’t even judge a patient’s severity until you take their vitals, and yours were alarming. EVEN if they’re a “frequent flyer” you can’t judge acuity just by eye sight.",
      "created_utc": 1733115354.0,
      "score": 2
    },
    {
      "id": "lzzv3sn",
      "body": "Please contact the Patient Experience department wherever you stayed. You ended up okay but, based on your vitals, it could have gone very differently.",
      "created_utc": 1733118292.0,
      "score": 2
    },
    {
      "id": "m011juf",
      "body": "I went to the ER five years ago for abdominal pain and vomiting. They charged me for my stay but never did anything. Just temp and blood pressure. No medicines, no tests. Just sent me back home in the morning. Last month I had three infections at the same time which led to an ultrasound of my liver. That's when they found my gall bladder was chock full of stones. So after I recovered from the infections, I had a gall bladder removal surgery. Imagine living 5 years with those stones just because the ER refuses to believe what patients report themselves.",
      "created_utc": 1733144181.0,
      "score": 2
    },
    {
      "id": "m01lv2v",
      "body": "I've had this happen. Accused of drug seeking. Turned out I had a broken rib. \n\nVery grumpy about the whole thing, but I enjoyed the look on the nurses face when the Dr brought me back and prescribed me meds for the broken bone.",
      "created_utc": 1733152235.0,
      "score": 2
    },
    {
      "id": "lzvnr8r",
      "body": "Report. Report. Report. \n\nThey have no business to be nurses. \n\"Patient advocate\" or \"grievance department\" at the hospital. AG online complaint. \n\nYou will not change their attitude, they will not care about you or all of us, but they and people like them will at least be afraid to be so negligent.",
      "created_utc": 1733065972.0,
      "score": 2
    },
    {
      "id": "lzufaw1",
      "body": "they thought you were a junkie",
      "created_utc": 1733041790.0,
      "score": 1
    },
    {
      "id": "lzvd0ht",
      "body": "Hope you are doing well! ❤️",
      "created_utc": 1733061769.0,
      "score": 1
    },
    {
      "id": "lzw2lan",
      "body": "I would have totally launched a complaint. Though when it’s the ER I imagine they get a lot of people over hyping their symptoms. The problem is when the symptoms are real and deadly. Good for you for getting to do the HA ha (Nelson from the simpsons laugh)",
      "created_utc": 1733070990.0,
      "score": 1
    },
    {
      "id": "lzw42u6",
      "body": "It's never too late to complain",
      "created_utc": 1733071474.0,
      "score": 1
    },
    {
      "id": "lzydn8g",
      "body": "I had a mental breakdown and had to go to the emergency room my blood pressure was almost at 200 or whatever that means and they laughed at me. Just a bunch of kids working at hospitals in the US. Now I have fear of hospitals. I told myself if I’ll die before I go back to a hospital.",
      "created_utc": 1733097273.0,
      "score": 1
    },
    {
      "id": "lzz1lxu",
      "body": "I am bedbound with M.E. and fibromyalgia. I was admitted to hospital and had to get a CT scan, which showed my gallbladder had got infected and burst, and I had sepsis. Anyway, I was roughly put in a wheelchair, and I couldn't hold myself up, and I was in so much pain. I was pleading with the nurses to let me lie on one of the empty temporary beds that were there, but I got ignored. Then I heard, \"Oh, M.E. I suppose we'll have to treat that as if it's real.\" I was furious, but on top of all my usual medical crap, I had excruciating pain from my gallbladder, so I didn't do anything. I ended up having emergency surgery to remove my gallbladder remains and 'debris' from inside my abdominal cavity, which at least I couldn't be accused of making up! Why are there still so many health professionals who don't believe M.E. and/or fibromyalgia are real, despite so much evidence to the contrary?",
      "created_utc": 1733105818.0,
      "score": 1
    },
    {
      "id": "lzz8e4j",
      "body": "My moms and RMA and whenever anyone comes into her clinic with 93% oxygen they get oxygen. You being worried was valid.",
      "created_utc": 1733108335.0,
      "score": 1
    },
    {
      "id": "m003hdt",
      "body": "I had a similar experience years ago. \n\nWasn't taken seriously, even though I was pretty sure I'd had a seizure and told them as such. They didn't check anything and told me i needed to wait. \n\nAfter a while, I felt it beginning to come on again. I told my friend (who was with me) and they ran back over to the nurses to tell them what was up. I must have looked pretty bad because the main nurse panicked and started calling a code blue. That was the last thing I remember before losing consciousness. I woke up on a bed with nurses/ doctors around me. I also started vomiting... Directly onto the nurse who had been so rude when I first came in. :-D",
      "created_utc": 1733123060.0,
      "score": 1
    },
    {
      "id": "m006ktb",
      "body": "The “you can breathe” comment was likely because you could talk. ER nurses see people in serious respiratory distress and arrest that requires intubation. To them, someone talking = someone breathing = not in need of IMMEDIATE life or death intervention. I know plenty of ER nurses and this is often how they think. They’re often burnt out and jaded and have lost their patience for people, and most people would seeing what they see and getting abused by people and the hospital the way they do. \n\nThat being said, condescending to patients who KNOW something isn’t right is mean and irresponsible. With your vitals, things could have gone wrong quick and they should know that. I’ve definitely overlooked something at work before and felt immediate regret and anxiety and hopefully she felt her asshole pucker seeing your vitals and knowing she ignored you. You’d definitely be in the right to complain. Whether she “believed you” or not doesn’t matter. Two hours is an INSANE amount of time to get vitals on a patient who says they feel like they can’t breathe!!! I am an ICU nurse and if my pt said they couldn’t breathe I would get ripped a new one for failing to get their vitals for TWO HOURS. You received substandard care on the basis of what seems like an attitude problem. Hope that nurse gets some help before she neglects another patient and ends up with an outcome that can’t be undone. Hope you feel better soon!",
      "created_utc": 1733125003.0,
      "score": 1
    },
    {
      "id": "m00sk2o",
      "body": "As a nurse who has worked in healthcare for almost 15 years, I hope that you contacted the Ombudsman or asked for a patient advocate because that is absolutely unacceptable. Yes there are people that go into the emergency department because they need refills on medication or they sprained their ankle a week ago or they've had blood in their urine for a month and they never followed up but when someone says that they're having difficulty breathing that's a whole other thing entirely. They should have assessed you right then and there even if it didn't have room for you they could have taken you back got your vitals and then asked you to wait in the waiting room it shouldn't have taken 2 hours to verify what you were telling them was factual.",
      "created_utc": 1733139554.0,
      "score": 1
    },
    {
      "id": "m02jb66",
      "body": "As a nurse, I’m sorry this happened to you. I’ve met other nurses like this before that are dismissive of patient complaints because they think the patient is being over dramatic. A lot of times they respond that way because they think “if you can talk, you can breathe”. Which it may be true that you can inhale/exhale, but that doesn’t mean your body is doing a good job of actually absorbing the oxygen you’re breathing. It’s basic medical science that all nurses are taught in school. I applaud you for advocating for yourself when no one else would, but I’m sorry that you had to be put in that position.",
      "created_utc": 1733162990.0,
      "score": 1
    },
    {
      "id": "m03cvvn",
      "body": "Great comeback! It’s horrible they would mock a patient like that",
      "created_utc": 1733172225.0,
      "score": 1
    },
    {
      "id": "m0iqnrd",
      "body": "Once I called the ambulance for my daughter because she was breathing shallow. They came and laughed at me, the worried mom, but then they checked her vitals, saturation was 86, low blood pressure, they got her on oxygen and drove her to the hospital for obstructive bronchitis. They said normally she would have turned blue around the lips but I noticed it so fast and I prevented that from happening.",
      "created_utc": 1733395538.0,
      "score": 1
    },
    {
      "id": "m00htq3",
      "body": "I’ll try to give a somewhat balanced response, I agree that nobody should ever be mocked and medical complaints should all be taken seriously, I am sorry that happened to you.\n\nWithout excusing the behavior, I can understand why they are skeptical about a “walkie talkie” complaining that they can’t breathe.  I have seen patients throw themselves on the floor due to “seizures” curse me out because I don’t push them to the front of the queue, moms and dads in hysteria screaming and borderline physically assaultive because their child who is jumping up and down while singing along with the large TV “can’t breathe”.   I have seen them leave the wait room, call 911 only to be ambulanced right back and have to start the wait all over.  I have seen them scream that they don’t care that the obviously gravely ill oncology child patient who is dying, “I was here first”.\n\nWhen I am rude or short with them, it’s because I am solely responsible for everyone in that waiting room, I have upwards of 50+ patients in the waiting room all of which are in various stages of “sick” and getting “sicker” while they wait. I have to rely on judgement, experience, and “what they look like” because it is not an exact science (we aren’t making burgers or fitting legos), our rooms are full, and the only patient getting back there right now is the one that comes in actively dying.  It is a tremendously difficult job, I am not holding rooms empty while we laugh at the sick people. \n\nWhen a nurse discharges a patient, someone has literally cleaned their room and roomed a new one before that nurse has had a chance so sit down, drink something, use the rest room, clear their head, chart, or take care of all their other patients. It is a shitty healthcare system and unfortunately we are on the patient facing side and have to tolerate abuse all while taking care of you.\n\nYou and nobody else deserves to have their pain and suffering mocked, but when you get 100 bullshit complaints vs  1 real one that presents ambiguously, it is very difficult to identify. The issue is compounded when someone has been up there focusing on that for upwards of 8-10 hours and our brains and thought processes also start to wain, we are not robots.\n\nAgain, what they did was wrong and I am sorry it happened to you, but we are not in the hospitality industry, we are in the life saving industry.  This is not McDonald’s, it’s not the holiday inn, if I have a second and am not overwhelmed at the moment I will smile and give you extra attention if required, but if there are 100 ppl in the waiting room, 3hour waits for triage and 8hr waits for rooming with a line forming out the door, it is not humanly possible to provide “excellent customer service. \n\nBlame your politicians, blame the American healthcare systems, blame corporate greed, they created this environment. But those nurses who openly mocked you, they also deserve their share of the blame.",
      "created_utc": 1733132632.0,
      "score": 1
    },
    {
      "id": "lzuix37",
      "body": "They responded this way because waaay to many people are showing up in the ER when they just need to schedule an appointment with their doctor in a week. Its like the boy who cried wolf. Hard to take everyone seriously even though some people are genuinely in an emergency.",
      "created_utc": 1733044230.0,
      "score": -10
    },
    {
      "id": "lzvop68",
      "body": "Ccc",
      "created_utc": 1733066303.0,
      "score": 0
    },
    {
      "id": "lzu74vs",
      "body": "Thank you for your kind words 🩷 and I thought about saying something about it but I was so sick I just kinda laid there for two weeks. Now I've been home a few days and I still feel so awful and I feel like too much time has passed. So I just hope they learned something from the situation",
      "created_utc": 1733036551.0,
      "score": 1624
    },
    {
      "id": "lzvbf92",
      "body": "As someone who works in healthcare, absolutely make a formal complaint. People who work in this industry and act in this way are despicable, disrespectful, unprofessional and absolutely need to be reprimanded (or preferably fired). I’m so sorry you had to deal with this and hope you are better now.",
      "created_utc": 1733061099.0,
      "score": 50
    },
    {
      "id": "lzvocw4",
      "body": "Yep this sounds like negligence territory, whether the nurses were doing it intentionally or not (obviously). OP I would have a couple phone calls with some lawyers. Might not end up with anything, but worth a shot",
      "created_utc": 1733066184.0,
      "score": 15
    },
    {
      "id": "lzvchty",
      "body": "I've had asthma my whole life and normally breathing issues jump to the front of the line so this is wild. 😳",
      "created_utc": 1733061551.0,
      "score": 11
    },
    {
      "id": "lzvpjoo",
      "body": "As someone with (limited) experience in the medical field, breathing is one of those that you do not fuck around with. The Big Three are cardiac (circulatory system), respiratory (breathing), and trauma to your head and/or neck. Any of those put you at the top of the priority list because of how dangerous they can be and how quickly you can devolve. \n\nOP, you need to write a letter to the hospital and report them. The next time they dismiss a patient, they could kill them.",
      "created_utc": 1733066600.0,
      "score": 10
    },
    {
      "id": "lzueh34",
      "body": "Agree at least here in Australia they always put a ox-pulse thing on you at the front desk at the ER.",
      "created_utc": 1733041239.0,
      "score": 21
    },
    {
      "id": "lzvyaoq",
      "body": "Yeah man. Absolutely complain. You could make it easier for the next person that goes in and gets ignored. Or at least make them second guess themselves when they go to treat someone else like shit.",
      "created_utc": 1733069584.0,
      "score": 7
    },
    {
      "id": "lzwttkl",
      "body": "I had a similar experience - difficulty breathing, dismissed as a panic attack. A doctor finally decided to humor me with an inhaler and it cleared up right away.",
      "created_utc": 1733079399.0,
      "score": 3
    },
    {
      "id": "lzys4ui",
      "body": "If you don’t want to write a letter, most hospitals have a patient relations department. You don’t have to be currently admitted to call. Most hospitals do take the surveys they receive seriously, but sometimes it’s easier to speak with an actual person. \n\nGlad to hear you’re feeling better!",
      "created_utc": 1733102395.0,
      "score": 2
    },
    {
      "id": "lzz1wjg",
      "body": "This is how it is everywhere now",
      "created_utc": 1733105927.0,
      "score": 1
    },
    {
      "id": "lzu7idq",
      "body": "This happened about 3 weeks ago so I don't know if it's too late now. I was really sick, in respiratory failure, so to be honest once I was in a room a pretty much just stared at the ceiling for two weeks. I've been home for a few days now and still feel absolutely awful. I thought about saying something but wasn't sure especially since so much time has passed.",
      "created_utc": 1733036781.0,
      "score": 240
    },
    {
      "id": "lzu7w3d",
      "body": "I thought about this actually. I think they did think I was a junkie. Especially with respiratory failure you sweat A LOT and I lost some of my hearing due to lack of oxygen so I was talking really loud and was slightly panicking. They probably did think I was tweaking. Is there a time limit you can report things?",
      "created_utc": 1733037016.0,
      "score": 242
    },
    {
      "id": "lzubm8u",
      "body": "They'd figure out pretty quickly if someone was looking for a fix tbh\n\nThis behavior of ignoring and failing to correctly triage patients will kill or has killed someone there, I'd bet",
      "created_utc": 1733039389.0,
      "score": 42
    },
    {
      "id": "lzyvz69",
      "body": "ah, I was wondering what on earth they were thinking that lead to that reaction. that somehow makes it worse. cause like even if that were the case, that's not how you treat somebody!! a patient is a patient. take the damn vitals and *then* let them wait for hours if that's what you're hell-bent on. but take the vitals first. it's not like it's wasting valuable resources or \"clogging up the line\" for things like lab work or imaging tests. it's just vitals. two minutes and you're done. the way these nurses decided to deny the most basic care because they thought OP was an addict is absolutely insane to me. it makes me think of that one post from a med student whose professor answered \"what if it's a gay patient and we disagree with their lifestyle?\" with \"find a different career.\" it's immensely disappointing how many medical professions decide that certain groups of people don't deserve even half a shit worth of care or attention let alone compassion",
      "created_utc": 1733103780.0,
      "score": 5
    },
    {
      "id": "lzuusjn",
      "body": "Every time you are treated badly by a health professional you need to file a complaint once you feel better. \n\nThe next person they abuse could die.",
      "created_utc": 1733052244.0,
      "score": 61
    },
    {
      "id": "lzuuixn",
      "body": "Excellent points. \n\nEvery time I am mistreated by a health professional I generate a formal complaint.  \n\nEvery time. \n\nIf you don’t, someone could die. Because those people are not doing their jobs. \n\nSo file a complaint once you feel better. \n\nI am an RN.",
      "created_utc": 1733052072.0,
      "score": 40
    },
    {
      "id": "lzv0lel",
      "body": "I can. I have worked in healthcare for 30 years and can count on one hand the number of nurses that have been a decent human. The mean girls from high school go\nInto nursing and they carry that over to their job.",
      "created_utc": 1733055805.0,
      "score": 33
    },
    {
      "id": "lzw877c",
      "body": "It was just me and my husband in the room\nand he saw that the baby was coming. He found them all drinking coffee and laughing. Told them that the baby was coming. They said, “yeah, yeah, we’ll get there in a bit.” Like they didn’t believe him. My husband didn’t even turn around and barked out “NOW” in his best drill sgt voice. They all jumped to and once in my room started panicking at all that was happening. Female dr told me not to scream, it’s not a big deal (episiotomy didn’t kick in) and I had a 4th degree tear. \n\nI was too young and didn’t want to cause waves so I didn’t complain.",
      "created_utc": 1733072770.0,
      "score": 36
    },
    {
      "id": "lzx8tc5",
      "body": "not exactly the same but also related to labor! im a first time mom and would hysterically sob every time i got my blood drawn through pregnancy, cried for my cervix checks too. both my OB and one of the nurses asked me a few times “how are you gonna handle delivering a baby if you can’t handle this!”. after getting my pitocin (labor induction) i was in labor for only 7-8 hours, got my epidural and slept until i was ready to push, only took 22 minutes to push my son’s fat noggin out! ended with a second degree tear and while my OB was sewing me up, i was laughing and chatting it up with all the nurses. not only that, but i was back to pre-pregnancy weight immediately after delivery. impressed that whole damn office, i was the talk of the town every time i came in! i wanted to yell at them “ask me again how i’m gonna handle labor if i can’t handle a damn blood draw or cervix check!”",
      "created_utc": 1733083933.0,
      "score": 10
    },
    {
      "id": "m0o5w4g",
      "body": "Of course it was a midwife",
      "created_utc": 1733466709.0,
      "score": 1
    },
    {
      "id": "lzv2e02",
      "body": "Took me an embarrassingly long minute to realize SOB meant \"short of breath\" 🤦‍♀️",
      "created_utc": 1733056806.0,
      "score": 34
    },
    {
      "id": "lzwlj24",
      "body": "I don’t work in healthcare but I had to go to the ER last year and they had me do a vitals check (temp, blood pressure, hr, pulse ox, maybe other things I’m forgetting) before I could go take a seat in the waiting room. I didn’t have any complaints of shortness of breath, fever, etc. so I was surprised. After sitting in the waiting room for a little I realized that it was most likely a standard operating procedure for the hospital since I saw everyone else go to the little vitals cart after the front desk too. It seems like a great way to make sure the initial triage is accurate since, like you said, not everyone is going to be stable",
      "created_utc": 1733076881.0,
      "score": 9
    },
    {
      "id": "lzuveyq",
      "body": "Everybody who brings a friend or family member with them gets better treatment. Every. Single. Time.",
      "created_utc": 1733052648.0,
      "score": 24
    },
    {
      "id": "lzyppfu",
      "body": "I’ve had a few spontaneous pneumothorax in my life! My first one was in high school and when I was still recovering, but past the main collapse, my PE teacher wanted me to run a timed mile and I told him that I couldn’t because I had a hole in my lung. He looked at me like I had a third eye and told me that I still had to run unless I had a doctor’s note, which I did not. It’s the only time I ever argued with a teacher. Thankfully, I’ve never needed a chest tube.",
      "created_utc": 1733101513.0,
      "score": 2
    },
    {
      "id": "lzz7iyg",
      "body": "What happened after they sent you home? And it’s so scary that emergencies always happen after just waking up :( I’m too scared to go asleep bc what if I wake up and I’m on the verge of dying, it’s scary how life changes so fast",
      "created_utc": 1733108016.0,
      "score": 1
    },
    {
      "id": "lzyzw1v",
      "body": "Yes, oxygen saturation is the same - 85% is *not* good at all.",
      "created_utc": 1733105182.0,
      "score": 3
    },
    {
      "id": "lzwtoal",
      "body": "How does a nurse not even realize that water breaking and peeing are two very different sensations? I mean, yes, some folks can make that mistake because it is the same area of the body, but why be rude about it?",
      "created_utc": 1733079353.0,
      "score": 2
    },
    {
      "id": "m0o60vo",
      "body": "Ew ",
      "created_utc": 1733466784.0,
      "score": 1
    },
    {
      "id": "lzz8ybc",
      "body": "I had the flu that developed to pneumonia. Unfortunately the pneumonia was over looked as bronchitis and no treatment was given (no antibiotics etc) so it got really bad. My lower lungs collapsed and I went into respiratory failure ",
      "created_utc": 1733108546.0,
      "score": 5
    },
    {
      "id": "lzv2oo6",
      "body": "Junkies deserve health care as much as anyone else.",
      "created_utc": 1733056967.0,
      "score": 20
    },
    {
      "id": "lzuva79",
      "body": "They were not doing their job.",
      "created_utc": 1733052563.0,
      "score": 10
    },
    {
      "id": "lzup0br",
      "body": "It's like 2 months to get in with your primary doctor here by me. Longer if you\"re not an existing patient. They should never treat anyone seeking care at the ER like this. And Urgent Care instead is a joke. I went once for a little cut and they didn't have anyone who could do stitches and I had to leave and go to an ER.",
      "created_utc": 1733048358.0,
      "score": 17
    },
    {
      "id": "lzuv5sl",
      "body": "Excuses excuses excuses. \n\nThey need to do their job no matter how many times it was nothing exciting. \n\nTreat people with dignity. \n\nTake their vitals. \n\nListen to their story. \n\nDocument. \n\nIt’s what they are being paid for. Every time. \n\nIf healthcare professionals treat you badly, generate a formal complaint as soon as you feel better. \n\nThe next person they abuse could die.",
      "created_utc": 1733052484.0,
      "score": 15
    },
    {
      "id": "m0o659c",
      "body": "Girl.... ",
      "created_utc": 1733466853.0,
      "score": 1
    },
    {
      "id": "lzu7ybc",
      "body": "It’s not too late to complain those nurses failed you. You were lucky and their improper care didn’t result in your death but for someone else coming to the ER they may not be as lucky",
      "created_utc": 1733037055.0,
      "score": 1479
    },
    {
      "id": "lzuqh1s",
      "body": "I work in a hospital and we would welcome this information. We can't have people on staff giving patients bad care. Someone can at least have a stern convo with them.",
      "created_utc": 1733049351.0,
      "score": 63
    },
    {
      "id": "lzu89on",
      "body": "I’m also of the opinion that it’s not too late to say something. I really hope you do. That was unacceptable and management should know about it. or at the very least leave a review.",
      "created_utc": 1733037252.0,
      "score": 61
    },
    {
      "id": "lzvkdgg",
      "body": "Bb, I was recently taken WAY more seriously by an ER and quickly whisked away despite LITERALLY being like \"I'm actually totally fine and don't feel bad at all right now, but I got sent here by the urgent care clinic because they don't do scans on weekends and said they called ahead about sending me here for an MRI for suspected chronic appendicitis.\"\n\n\n\"Difficulty breathing\" is supposed to be even more of a magic ER phrase same as \"lower right quadrant pain.\"\n\n\nThat delay could kill someone the next time, or cause them to have a much worse outcome.\n\n\nAlso Imma go out on a limb here and assume that you're a younger woman, because MY experience when I was a younger woman in my 20s was that nurses, especially other younger female nurses, were THE most condescending service people I'd ever encountered and have had a similar experience with ER nurses when I had *a necrotic burn on my leg.* Left before I was seen after being publicly humiliated by the front desk lady because I had an exam the next morning, the nurse at the student health clinic PANICKED when she saw my burn the next day, and I absolutely filed a complaint with the ER between 1. Being publicly humiliated loudly in front of a whole ER waiting room in a way that was DEEPLY upsetting and wildly unnecessary, 2. Realizing how serious the situation was after I went to the student health clinic. \n\n\nYou get to feeling better and get your strength and energy back, and then you make that complaint as 1. Petty revenge, 2. To make damn sure they get a paddlin' about being so dismissive of you because they weren't doing their fucking jobs and the potential consequences are too great for that shit not to get shut the hell down. Too much time has NOT passed. It's also entirely possible you won't be the first person to make basically the same complaint about the same nurse. Call and get in touch with the hospitals patients advocate. I can assure you they would WANT to know about this. So sorry that happened to you!",
      "created_utc": 1733064729.0,
      "score": 58
    },
    {
      "id": "lzx1d7m",
      "body": "Usually hospitals send a questionnaire once you’re discharged. Be honest, they need to know. \n\nMy dad had broken his heel years ago; when they were running tests to clear him for surgery they found he had three very blocked arteries and instead had to have open heart surgery and triple bypass. They put a yellow wristband (which signifies to the nurses that he was non-weight baring). Following surgery my father was not feeling well and said he needed to go to the bathroom. His RN said all my patients have to get up to use the facilities. She made my dad stand, he got dizzy and his bowels just released. They were tarry and she just got annoyed with the mess. They were upset with his complaints of pain. One nurse did report that the stools looked suspicious and he was taken for imaging where they determined he had a bleeding ulcer. They further discovered that his sternum (which had been cut to perform surgery and resown) had become undone. I’m not sure if they’d used wires or a plate and screws, but whatever it was, it didn’t take and his sternum was now separated. My dad had to be rushed to surgery to address the ulcer and the sternum. My sister and I were furious and we were not about to wait for any questionnaire. We complained and we were pissed about that nurse - how did she not know the significance of the wristband; how dare they not take his pain seriously? She was taken off his section of the cardiac care unit and for the remainder of his stay there we didn’t see her. My dad didn’t speak English and my sister and I didn’t leave him alone for very long. Since this had happened during the summer and my sister was a school teacher, she was able to stay with him daily. I would go to work in NYC and then travel to the Jersey Shore a couple of days a week and stay the weekend to spend the whole day with him. The nurses assured us that we could go home to sleep but we were there early the next morning. When he did get his questionnaire following his discharge, I let them know that for all their posters about diversity, the hospital was absolutely nowhere near diverse enough and that some of their nurses needed better training on bedside manners. His doctors and surgeons (he required a plastic surgeon for the second chest closing).\n\nI understand that they come across difficult patients, but you’re dealing with people who are in a very vulnerable situation and deserve some kindness and respect.",
      "created_utc": 1733081667.0,
      "score": 21
    },
    {
      "id": "lzxay1k",
      "body": "They did not learn a GD thing. I beg you to either let someone advocate for you, or advocate for yourself. At the very least, contact the director or nursing, (and if you wish….the hospital ombudsman, AND the social workers. )At the very least the director or nursing should know how the staff is treating people. I’m a very large patient advocate, I’d be happy to help you if you’d like. My DMs are open. Please please please do submit a report to the DON! (Director of nursing ) you can even generally submit a complaint online. I will help you.",
      "created_utc": 1733084583.0,
      "score": 6
    },
    {
      "id": "lzx8beo",
      "body": "Never too late to complain, as someone who originally went to nursing school, it is the job and responsibility of medical professionals to treat each person with dignity and respect, because otherwise this happens.  These nurses could have gotten someone killed.",
      "created_utc": 1733083777.0,
      "score": 3
    },
    {
      "id": "lzxjy38",
      "body": "It's not too late. There may have been a valid reason  it took so long to care for you. We don't know who and what else they were treating. But we DO KNOW that their comments and dismissiveness were rude and unprofessional and make it difficult to trust the rest of their treatment decisions. And if you are a POC it's even more important to report because racism in medical treatment costs people their lives. Please report them.",
      "created_utc": 1733087342.0,
      "score": 3
    },
    {
      "id": "lzxns4o",
      "body": "It's not to late find information on the patient relations liaison and inform them of what happened. You have your discharge papers it will give you the date and time you were admitted and they can proceed with figuring out who those nurses were. It is not okay for them to leave a patient unchecked what if you had passed out from low oxygen and gotten extremely hurt. And if they were willing to disregard you who else could they cause harm to with their negligence. I had to advocate for my mom due to a bad charge nurse. It's always a good thing to report and hold them accountable.",
      "created_utc": 1733088542.0,
      "score": 2
    },
    {
      "id": "m003ktp",
      "body": "Yeah, no thanks. Tonight I took my daughter to the ER after 2 days of tons of snot and wet cough and you know what she got? A nose rinse. THAT'S RIGHT. LITERALLY JUST A COMPLICATED NOSE BLOW. Not a single person made me feel bad for it. Everyone had amazing bedside manner. For a nose blow. (It turns out she has RSV, but nobody knew that until the end of the visit.)",
      "created_utc": 1733123118.0,
      "score": 2
    },
    {
      "id": "lzzror4",
      "body": "Nope, too much time has definitely not passed.",
      "created_utc": 1733116535.0,
      "score": 1
    },
    {
      "id": "lzzt2z1",
      "body": "When my dad was dying he had a horrible doctor who denied him pain meds. I sent a 7 page, single spaced letter to patient relations. I heard from elsewhere that this doctor had a lot of issues. The patient relations person called me to apologize. She said she couldn't comment on HR issues but that it was duly noted. I found out through the grapevine she had been let go for many other reasons. They are really lucky we didn't sue them. I've worked in ED's and there is no excuse for that kind of behavior. Even if nothing happens to the nurses you'll feel better about expressing yourself.",
      "created_utc": 1733117235.0,
      "score": 1
    },
    {
      "id": "m02lj4z",
      "body": "I have been an ER nurse for almost 10 yrs and the behavior from those  ER nurses was atrocious. I work in one of the busiest ERs in the country and our patients get vitals taken with in 30 min of arrival at most usually 15 or less. There is absolutely zero reason why it should of taken that long, they were also clearly lacking in their assessment skills. Many ER nurses are dicks, they think they know everything  and that no one is an emergency unless it is trauma. If everything you said is true ( not saying you are lying) I would make a complaint.",
      "created_utc": 1733163678.0,
      "score": 1
    },
    {
      "id": "m0dxtte",
      "body": "No, you need to complain to the hospital. They need to know what their staff is doing.",
      "created_utc": 1733328857.0,
      "score": 1
    },
    {
      "id": "m34eet3",
      "body": "Not so. Just enough time has passed that you are well enough to tackle this.",
      "created_utc": 1734779781.0,
      "score": 1
    },
    {
      "id": "lzudgzc",
      "body": "Believe me, 3 weeks isn’t long enough. Especially since you’ve been recovering at home. You have had to prioritize your health first and THEN bring this up to the hospital. It’s never too late to speak up! I hope you’re doing well and I hope those nurses correct their harmful behavior.",
      "created_utc": 1733040583.0,
      "score": 187
    },
    {
      "id": "lzuw57e",
      "body": "If you feel the need to talk to someone about it, the patient experience advocate can help you write up the complaint. I used to work in quality management. People who complain can help us identify faulty systems and processes, and identify toxic caregivers before they kill someone.",
      "created_utc": 1733053118.0,
      "score": 39
    },
    {
      "id": "lzyqt8j",
      "body": "It took me almost 2 years to file a complaint about how I was treated by nurses while in labor, and the state was still very eager to hear about it. I’m so sorry this happened to you. This kind of terrible behavior feels like it’s becoming so widespread in healthcare",
      "created_utc": 1733101915.0,
      "score": 7
    },
    {
      "id": "lzuabnu",
      "body": "The sooner the better but it’s only been three weeks. I would encourage you to make the report. The nurses being disrespectful and not taking you seriously could have lead to a devastating outcome. Being in the hospital for two weeks shows how truly sick you were.",
      "created_utc": 1733038560.0,
      "score": 113
    },
    {
      "id": "lzuvrm0",
      "body": "No time limit for complaints. Even a year later works if it is a systemic issue. You don’t even need to know the names of the people who treated you badly. You describe their position and the date and time and they are nailed. \n\nIf you want to feel better about it, you can also write a compliment for those who went above and beyond for you.",
      "created_utc": 1733052874.0,
      "score": 40
    },
    {
      "id": "lzv5yef",
      "body": "Everyone I bring this up to has the same experience! Why do the high school mean girls always become nurses?!",
      "created_utc": 1733058637.0,
      "score": 19
    },
    {
      "id": "lzweygo",
      "body": "Damn what is wrong with midwives? Mine stabbed me with the syringe to numb me before my episiotomy but only gave it 10 seconds before cutting away 🙄 suffice to say I'm the mother of one and that will never change due to the trauma I suffered because of them",
      "created_utc": 1733074870.0,
      "score": 28
    },
    {
      "id": "lzxlkct",
      "body": "4th degree meaning rectum ripped? holy…",
      "created_utc": 1733087840.0,
      "score": 6
    },
    {
      "id": "lzyc4uq",
      "body": "My nurse also said there’s no way it was time for me to push and I was like look I know I’m young but I’m telling you it’s time, low and behold the doctor came and my son was out 5 minutes later. Her face, priceless.\n\nNothing beats the doctor who told me “Car accidents cause pain sometimes” only to find I have renal compression and a torn disc. Yeah no duh they might hurt sometimes but this is different doc. 😂😂😂",
      "created_utc": 1733096736.0,
      "score": 5
    },
    {
      "id": "lzxb19h",
      "body": "Haha queen behaviour right there!! Blood tests are awful though, the thought of them give me the heebies lol",
      "created_utc": 1733084610.0,
      "score": 3
    },
    {
      "id": "lzvjgt8",
      "body": "valid, sorry - forgot this wasn't an EMS subreddit aha",
      "created_utc": 1733064383.0,
      "score": 16
    },
    {
      "id": "lzw1wvx",
      "body": "Omg thank you!! I couldn't figure out what everyone was talking about. Like yeah the nurses were shit, but SOB...? I thought OP referred to them as women XD",
      "created_utc": 1733070770.0,
      "score": 7
    },
    {
      "id": "lzz8rbv",
      "body": "When I went home, my children ages 12, 10 and 8 helped take care of me. I couldn't even talk the pain was excruciating. I had no pain medication as they only told me to take Tylenol.They put the chest tube in the front and it was shoved between my ribs. Luckily for me we had the biggest snow storm and we were going to be home regardless. It was in for a week or abit longer. I went to the Drs office and he yanked it out. I'm not even kidding. The only positive that came out of it was I quit smoking. My children did all the chores without me asking. I was so thankful I had them to help me through it",
      "created_utc": 1733108472.0,
      "score": 2
    },
    {
      "id": "m0p5c4k",
      "body": "They're all named Crystal or Destiny",
      "created_utc": 1733488477.0,
      "score": 1
    },
    {
      "id": "m007e1o",
      "body": "you are right",
      "created_utc": 1733125531.0,
      "score": 1
    },
    {
      "id": "lzxmhzx",
      "body": "Or the next time they take minor things seriously, the person behind them could die because the nurses were busy fussing over nothing. Works both ways. Nurses are tough because they need to be. They are saving lives all the time. Don't take it personally is all I'm saying. If you think your situation is bad, they've seen much worse. Probably the same day.",
      "created_utc": 1733088135.0,
      "score": 1
    },
    {
      "id": "lzu89s3",
      "body": "Okay! I have my paperwork so I'm sure they can see based on the date and time I checked in who was working there. I hope there's cameras. Thank you for your advice 😊 I'll do that Monday (I still can't walk very well so I have to wait for help to get there etc)",
      "created_utc": 1733037253.0,
      "score": 976
    },
    {
      "id": "m015wm7",
      "body": "^^ I agree 1000%. It is definitely not too late to file a complaint and I actually think it is necessary that OP DOES file a complaint so these nurses don’t do this to someone else. So ridiculous that they made OP that long to get their blood pressure and oxygen taken. I mean 85% oxygen is EXTREMELY low and that heart rate is crazy. The only time my heart rate goes up that high is when I am in the middle of a panic attack.",
      "created_utc": 1733146102.0,
      "score": 1
    },
    {
      "id": "lzzpp01",
      "body": "Always, always make the complaint. If they do it to you, they'll do it to others. OP survived, but eventually someone won't.",
      "created_utc": 1733115563.0,
      "score": 2
    },
    {
      "id": "lzvszad",
      "body": "The one and only time I had to go to the ER, all I said was “severe lower right quadrant pain” and they immediately whisked me off to a room right then and there and told me to get undressed. Didn’t even get my information. Ended up being a kidney stone thankfully but they took me very seriously.",
      "created_utc": 1733067789.0,
      "score": 17
    },
    {
      "id": "lzx0dyi",
      "body": "> Imma go out on a limb here and assume that you're a younger woman... \n\nPeople of color are also treated dismissively, and if you're a woman of color, you get the double whammy.",
      "created_utc": 1733081367.0,
      "score": 16
    },
    {
      "id": "lzv9vk3",
      "body": "The same reason their boyfriends become cops. It’s the easiest path into a position of power.",
      "created_utc": 1733060427.0,
      "score": 24
    },
    {
      "id": "lzzncdq",
      "body": "Easy access to vulnerable people while also making themselves look good because they're \"helping others\".",
      "created_utc": 1733114458.0,
      "score": 2
    },
    {
      "id": "lzwl2r0",
      "body": "I’m so sorry! I too am the mother of one!",
      "created_utc": 1733076743.0,
      "score": 8
    },
    {
      "id": "lzz3k2p",
      "body": "i almost cried (from happiness) when i had to get my blood drawn with my primary and she said she’d do it from my hand! for some reason i cannot handle from the crook of the arm. i was getting my blood drawn every four hours from my hand to check magnesium levels in the hospital (preeclampsia), laughed and talked with the nurses the whole time! the phlebotomist at my OB office was only slightly offended when we told her that (all in good humor though) 🤣",
      "created_utc": 1733106540.0,
      "score": 2
    },
    {
      "id": "m07jwb2",
      "body": "No apology necessary, it was my mistake! Would be funny af though.",
      "created_utc": 1733238633.0,
      "score": 1
    },
    {
      "id": "lzz8th5",
      "body": "And yes, I was terrified.",
      "created_utc": 1733108495.0,
      "score": 2
    },
    {
      "id": "m0v5re9",
      "body": "The names don't suit em 😒",
      "created_utc": 1733577961.0,
      "score": 1
    },
    {
      "id": "lzz6nz9",
      "body": "If they stopped laughing and sneering and did their actual job, the vitals would speak for them selves. \n\nAnd they need to ACTUALLY COUNT THE RESPIRATIONS, instead of eyeballing the patient and writing 16 or 18. \n\nI’ve followed these yahoos and stood by them, counting, and seen them write 18 for someone above 24. I’ve seen patients with a rate above 30 who the nurse had JUST written WNL. \n\nIt’s one of the markers for severe sepsis, and it can be the essential third sign that gets them timely help.",
      "created_utc": 1733107696.0,
      "score": 1
    },
    {
      "id": "lzudpgw",
      "body": "Our ER always calls after a visit. The patient can do an evaluation of how things went. \nIf yours does anything like that, you can explain how you were treated.",
      "created_utc": 1733040736.0,
      "score": 308
    },
    {
      "id": "lzupcii",
      "body": "Nurses and other hospital staff are required to chart everything they do, so they will have records of every person you interacted with and what the interaction was. All they need to figure out who it was is your name (and the date of the hospitalization if you have been hospitalized there more than once).",
      "created_utc": 1733048587.0,
      "score": 85
    },
    {
      "id": "lzuu16s",
      "body": "I work in scheduling for a Hospital, there should be a record of who worked what days. Our software shows shifts that go back years. They can find out. 🙂",
      "created_utc": 1733051753.0,
      "score": 49
    },
    {
      "id": "lzuvd5g",
      "body": "It will be on your chart who triaged you and checked you in. Please say something, not just for yourself but for other patients they will treat badly too. If they do this to you they’ll do it others, fever and SOB is a 100% valid reason to go to the hospital. I hope you feel better soon",
      "created_utc": 1733052616.0,
      "score": 52
    },
    {
      "id": "lzwlqe5",
      "body": "Absolutely do a report! It could have been a life ending situation they rudely wanted to sit there and snicker about! As an er tech that makes me big mad",
      "created_utc": 1733076942.0,
      "score": 17
    },
    {
      "id": "lzwsnim",
      "body": "Often hospitals have a patient experience contact on their website. You can call or email the contact without having to go in. It’s certainly not too late to contact someone and advocate for yourself!",
      "created_utc": 1733079042.0,
      "score": 8
    },
    {
      "id": "lzzbp20",
      "body": "Call the hospital’s patient advocate phone number if they have one. Also, you could ask to speak to the charge nurse from the night you were admitted. Otherwise, there might be a case manager, social worker, or patient navigator that could assist you. It really sucks to have to make these phone calls, I recently had to do it after a terrible hospital stay. But at least you will know that you’ve done everything in your control to see that it doesn’t happen to somebody else.",
      "created_utc": 1733109592.0,
      "score": 3
    },
    {
      "id": "m0xhj3j",
      "body": "Exactly. Have a friend of color misdiagnosed for decades. Not too late to report that garbage.",
      "created_utc": 1733605973.0,
      "score": 2
    },
    {
      "id": "lzutfhq",
      "body": "My local hospital sends a survey after every visit, I had to make a complaint after my son was born bc one of the midwives didn't take my complaints seriously and my Dr was fuming after I told them the next day.",
      "created_utc": 1733051355.0,
      "score": 159
    }
  ]
}