{
  "id": "1ih3ru3",
  "title": "I totally understand why people get addicted to drugs like Meth and Heroin now that I’m older.",
  "selftext": "Many people use drugs recreationally, but for some people drug use is merely a way to cope with their depressive lives. As a child I saw addicts as nothing more than reckless and self-destructive idiots, and was completely disillusioned by the idea of drug abuse. \n\nBut now as a young adult facing my own mental struggles, I get it now. \n\nWhen someone gets trapped in what feels like an inescapable situation and no there’s no escape, they may just turn to drugs as a means of temporarily escaping their harsh reality.\n\nIt is hardly surprising that one might turn to potent substances like Meth, and most notably narcotics like Heroin. Initially, these substances can provide a temporary escape from an otherwise depressive reality. \n\nIn the short-term, these drugs can temporarily provide someone with a way of mentally detaching from their struggles, and completely numb the emotional pain. It can provide someone with a temporary sense of relief that far exceeds anything their current reality can offer. \n\nHowever, as tolerance inevitably develops, the individual’s reliance on the substance shifts from seeking euphoria and escape to merely to preventing the effects of withdrawal.\n\nBut nonetheless, I can still totally understand why someone who is deeply depressed or suicidal would gravitate towards something like this as a means of temporary escape.",
  "created_utc": 1738626208.0,
  "score": 1158,
  "num_comments": 78,
  "url": "https://www.reddit.com/r/depression/comments/1ih3ru3/i_totally_understand_why_people_get_addicted_to/",
  "comments": [
    {
      "id": "maty6w8",
      "body": "It's like Soma from Brave New World.",
      "created_utc": 1738626649.0,
      "score": 135
    },
    {
      "id": "maug58u",
      "body": "Oh definitely, many people addicted to hard drugs are self medicating depression, anxiety or trauma . Some just cannot get satisfaction or enjoyment from daily life - drugs give them this instantly and it’s cheap at first. Problem is, down the road that high disappears and you need it to get out of bed. And if you think your depression was bad before drugs?! Just wait until you are in withdrawals \n\n  \n  I get it though as I have depression and anhedonia. I struggle mightily to enjoy life . i wish I had the answer",
      "created_utc": 1738632351.0,
      "score": 85
    },
    {
      "id": "matzbcv",
      "body": "I was the same way when I was younger now that I’m older I can see how the world really is a lot of times people can feel like there hole life is like hell and want a way out at any cost like some people might want to commit suicide and drugs are like there last ditch resort in order to not kill themselves.",
      "created_utc": 1738627000.0,
      "score": 184
    },
    {
      "id": "mav2gs2",
      "body": "It's called numbing pain. Early in life, I had extremely negative opinions of people that abused drugs. Never in my life did I know that one day, I would fill the ranks of someone that was abusing drugs daily. \nI was in the military, out to sea (I won't say which submarine i was assigned to) in the N Atlantic and i was informed that I need to see the captain. My immediate thoughts were \"whatever\". I went to the control room to relieve the watch and I was asked, did you talk to the captain? I had an eerie feeling that everyone knew something that I didn't know so I went to the captains stateroom, went in, shut the door and he said, the reason why we surfaced was because we are going to Humevac (small boat transfer)you off the boat, your 2 sisters were in a car accident and had passed away. I don't want you standing watch, im sorry for your loss you need to be prepared to leave at 0900. \nLifes unexpected turns can take us anywhere we want to go. My sisters were buried on my 21st birthday and after the funeral, first thing I did, I went to a bar. Completely unaware of what was about to happen but an addiction was born and I wouldn't find out until November 2018 I set before a judge being sentenced and he asked me what my choice of drug was, I told him meth. He asked me if I was addicted and I jumbled and sighed and jumbled some words again and looked up at him and said YES! First time I admitted I was an addict. Hallelujah. I was order to go to a long term treatment facility (9month. 6 phases) but it was there that I learned that my addiction was born by numbing pain. It only took 3 felony possession charges, 3 possession of Marijuana, 2 dwi's to learn that i was addict. You think I'm a glutton for punishment? Geesh. \n\nIt's good to see there are people out there that can understand or relate. I wish society can evolve and understand that good people make bad choices because I'm gonna tell ya, it's tough out there trying to find meaningful employment and survive in this day in time. Anyways, thank you for being one of those that understands.",
      "created_utc": 1738639733.0,
      "score": 46
    },
    {
      "id": "mauy9pi",
      "body": "What's crazy is heroin probably saved my life a couple times. Of course the bad outweighed the good by a long shot. But without it, I would have 100% killed myself. It was the only thing keeping me going for a while. But it ruined my life and made it 1000x worse in the end  and I've been off it for 3 years now.",
      "created_utc": 1738638293.0,
      "score": 56
    },
    {
      "id": "mavcuen",
      "body": "It’s sad, isn’t it? I have so much empathy for addicts.",
      "created_utc": 1738643657.0,
      "score": 15
    },
    {
      "id": "mau449j",
      "body": "I had that same realization",
      "created_utc": 1738628507.0,
      "score": 14
    },
    {
      "id": "mautv0h",
      "body": "I think I'm lucky in that sense. As depressed and suicidal as I am, drugs never solved my problem. Marijuana gives me psychosis, cocaine gives me anxiety, alcohol gives me a feeling of depersonalization. I've never tried Meth but from what I see from from other ppl  it's not for me. Heroin, could be ... since I take benzos every day,  but it's practically impossible to find where I live.",
      "created_utc": 1738636821.0,
      "score": 12
    },
    {
      "id": "mauyel5",
      "body": "I’ve become much more understanding about it since I started having chronic migraines. If people are trying to numb out extreme pain, whether physically or mentally, I get it.\n\nI just wish there were other options instead of street drugs because of how dangerous they are…",
      "created_utc": 1738638340.0,
      "score": 10
    },
    {
      "id": "mau00hv",
      "body": "I totally understand as well",
      "created_utc": 1738627217.0,
      "score": 10
    },
    {
      "id": "mauebnb",
      "body": "I feel the same, I get why someone would become addicted. Sometimes, I wish I could just take something to make all the pain, the anxiety, and the hopelessness go away.",
      "created_utc": 1738631767.0,
      "score": 8
    },
    {
      "id": "mau67vz",
      "body": "It's fortunate I don't have a history of addiction in my family or an addictive personality. Because I probably would've been relying on drugs or alcohol for pain relief otherwise.",
      "created_utc": 1738629174.0,
      "score": 8
    },
    {
      "id": "maut06e",
      "body": "Me too man. When I’m going through a depressive episode all I want is something to take me out of it because I know that that’s not the real me.",
      "created_utc": 1738636540.0,
      "score": 8
    },
    {
      "id": "mavs1ml",
      "body": "While I don't have time for a lot of games now, I think in the past I've used computer games in the same way. Not necessarily having fun in a lot of them, but a way to essentially disconnect from reality for a bit. Probably the same with movies, shows, and books.",
      "created_utc": 1738650672.0,
      "score": 8
    },
    {
      "id": "maugtfe",
      "body": "Yes, same. Life isn't as easy as the news makes it seem when you're for growing up. People have serious struggles and little help. I can easily see how some people just go crazy and try to do anything to keep going",
      "created_utc": 1738632566.0,
      "score": 7
    },
    {
      "id": "mav4ue7",
      "body": "Yup that was me for almost 2 years.",
      "created_utc": 1738640576.0,
      "score": 7
    },
    {
      "id": "maz1yct",
      "body": "I feel like the most lonely person ever so the first time I tried Xanax and seroquel it was like the cure of cancer for me, I miss Xanax so so much.",
      "created_utc": 1738696855.0,
      "score": 7
    },
    {
      "id": "mau908l",
      "body": "Yep me too alcohol marijuana and a whole lot of other things",
      "created_utc": 1738630064.0,
      "score": 6
    },
    {
      "id": "max5760",
      "body": "as a current meth & heroin addict i can assure you it only makes life more depressing",
      "created_utc": 1738676635.0,
      "score": 6
    },
    {
      "id": "mauqo35",
      "body": "I thought I was the only one",
      "created_utc": 1738635766.0,
      "score": 5
    },
    {
      "id": "mawo4yk",
      "body": "could be there way of just giving up like a slow suicide not caring what happens. i been feeling that way lately and i’m almost 40",
      "created_utc": 1738669555.0,
      "score": 5
    },
    {
      "id": "mb0js9r",
      "body": "100%  I used heroin for years.   I used it just to cope with the brutality of life.\n\nI would wake up in the morning and do a shot  then go to work and blend in like an npc.  I never commited crimes or got in trouble.  Heroin helped me function in society.\n\nIve been sober for a decade and Im depressed as fuck.",
      "created_utc": 1738712927.0,
      "score": 4
    },
    {
      "id": "mauqfwl",
      "body": "I tried both when I was younger. I understood how people got addicted at that time as well. They feel awesome honestly.",
      "created_utc": 1738635691.0,
      "score": 4
    },
    {
      "id": "maw7sk0",
      "body": "A lot of people self-medicate. Try to pick \"less harmful\" ones like alcoholism or gaming addiction, not these hard drugs where once you pass a certain point, you can never go back and it's a downward spiral to death from there.",
      "created_utc": 1738659899.0,
      "score": 4
    },
    {
      "id": "maxczgw",
      "body": "Initially it helped, but eventually it stopped working. Self medication only worked for so long and eventually made my depression worse. As least sober I can manage my depression more effectively.",
      "created_utc": 1738679326.0,
      "score": 4
    },
    {
      "id": "mb1vplf",
      "body": "When I was a teenager my older cousin lost a child. She fell into drugs and I saw her go from a successful woman to getting addicted, arrested, and ultimately die from an overdose. I will admit that I never understood and in my naiveté judged her for her choices.\n\nA few years ago, i lost my son fell into drinking, got into weed. And i started understand and empathize with my cousin. I wish she was here to talk to me so we could trade war stories. I’m not drinking anymore but when my mind gets dark sometimes i just wanna sink into it. Life is hard, you don’t know what people are going through. Have some empathy.",
      "created_utc": 1738728944.0,
      "score": 4
    },
    {
      "id": "maxslwa",
      "body": "Short term gains for long term losses by people who don't see any long term gains and i can't even say they're wrong. I know i don't stand to gain a damn thing between now and whenever a part of my body fails so hard it takes the rest with it. My life experience has been that if anything good was ever gonna happen it already did. I got about 7 yrs of real good life and then everything since has been loss after loss after loss with no gains to replace those losses. Why in the hell we were ever of the mindset that we should prolong life is beyond me... its really only worth living until about age 30... after that its just shit that i can't honestly imagine anyone truly wanting. Its a dumpster full of trash. No one wants a dumpster full of trash...",
      "created_utc": 1738684161.0,
      "score": 3
    },
    {
      "id": "mb1ysx6",
      "body": "There was a time when I was 21-24 that I literally tried several thubgs, my life was shit and I thought, that I may as well be addicted to something because the way my life was going it’s like I was getting the repercussions of being an addict anyway. \n\nTurns out everything just makes me physically ill . Which is great. Even the one time I was given something while passed out drunk in a situation I put myself in- that also made me very ill. Couldn’t get addicted- even when I tried. As a new/baby Christian, I’ll say it was Gods way of telling me things would get better, or that life wasn’t for me. \n\nIdk, all I know is that life wasn’t really hard, and I’m lucky to be alive at almost 30.",
      "created_utc": 1738730159.0,
      "score": 3
    },
    {
      "id": "maucr8i",
      "body": "I get it, too. And this is from someone who had to cut their own brother off because he's an alcoholic and meth addict. I get it. I just can't deal with the emotional abuse.",
      "created_utc": 1738631270.0,
      "score": 2
    },
    {
      "id": "mavxz8d",
      "body": "I turned up one of those 2 a while ago, however I've actually never been more low then I am now I know it's just a temporary way to numb myself, maybe it would be a better idea than killing myself though",
      "created_utc": 1738653921.0,
      "score": 2
    },
    {
      "id": "max6x8d",
      "body": "I have always said “I don’t do drugs as reality is hard enough to cope with already”",
      "created_utc": 1738677245.0,
      "score": 2
    },
    {
      "id": "mazjfxo",
      "body": "*taps head*\n\nThey can't cage this.",
      "created_utc": 1738701875.0,
      "score": 2
    },
    {
      "id": "mb0fck6",
      "body": "I get it too, but its still never the answer",
      "created_utc": 1738711438.0,
      "score": 2
    },
    {
      "id": "mb0x7gk",
      "body": "Its sad because i know people like this. Several people from my extended family were like this. I remember as a kid when i was innocent and didnt understand what drugs or drug abuse was. What happened? ",
      "created_utc": 1738717387.0,
      "score": 2
    },
    {
      "id": "mb0wr1q",
      "body": "Yeah, they are pretty much anaesthesia from the roll of shit that is life. I'm glad I never get to try those stronger drugs cos I'm sure I'd be dragged by addiction, as I am with tobacco and weed. \n\nEverything around you sucks, and you mostly hate yourself, they offer a little break from this routine, but ultimately end up as being a part of the routine as well. What once was an escape valve, is now the only thing holding you together (we know it's not, but that's how it feels).",
      "created_utc": 1738717239.0,
      "score": 1
    },
    {
      "id": "mb24hnf",
      "body": "Just think of the good it would do, if people could treat their own mental illness with medicine they’ve already tried coupled with the fact that said medicine has been available for thousands of years, without a prescription. 🌊",
      "created_utc": 1738732507.0,
      "score": 1
    },
    {
      "id": "mbkc30u",
      "body": "Yep on top of all that you then live in a society that only further stigmatizes the issue by making all drugs illegal and then lying to the masses about what drugs actually do to people by labeling them all as either good or bsd and then turn around and say \"just dont do it.\"",
      "created_utc": 1738969520.0,
      "score": 1
    },
    {
      "id": "mbmyfe5",
      "body": "[removed]",
      "created_utc": 1739009508.0,
      "score": 1
    },
    {
      "id": "mc1qr2b",
      "body": "As a recovering meth addict, I would not recommend trying it and using your depression as a justification to try it.. you more than likely will get addicted, and things will get exponentially worse for you depression wise.",
      "created_utc": 1739209110.0,
      "score": 1
    },
    {
      "id": "mau44ns",
      "body": "Just reading this makes me cringe a bit. You don't understand. You don't get it. You can never understand anyone elses position or motivation in life. You're not in their head. You can never truly understand. \n\n\nI believe what you are trying to say is that you empathize with them... would that be a better interpretation?",
      "created_utc": 1738628510.0,
      "score": -17
    },
    {
      "id": "mau19zr",
      "body": "Alcohol is pretty cool tho",
      "created_utc": 1738627615.0,
      "score": -14
    },
    {
      "id": "mav7dqw",
      "body": "To expand on that, so is social media, television and you can even go further to say our first world privileges make us forget the suffering in the world too, central heating and always-available food supply, for example.",
      "created_utc": 1738641510.0,
      "score": 52
    },
    {
      "id": "maw06zu",
      "body": "[removed]",
      "created_utc": 1738655223.0,
      "score": 8
    },
    {
      "id": "mau9ltn",
      "body": "Yep well said",
      "created_utc": 1738630254.0,
      "score": 23
    },
    {
      "id": "mavn9vz",
      "body": "I’m sorry you went thru that.",
      "created_utc": 1738648251.0,
      "score": 14
    },
    {
      "id": "mavn3ak",
      "body": "Good for you, I know kicking a heroin addiction is hard.",
      "created_utc": 1738648164.0,
      "score": 10
    },
    {
      "id": "mavz1da",
      "body": "I understand can remember one occasion where my emotional distress was so heavy that I feel as though what I did done less harm than had sat feeling the way I was.",
      "created_utc": 1738654539.0,
      "score": 6
    },
    {
      "id": "mavz2qo",
      "body": "I'm glad to hear you've gotten clean",
      "created_utc": 1738654562.0,
      "score": 5
    },
    {
      "id": "maw5rys",
      "body": "How did u even know heroin will make u feel better at the time before trying and knowing what its like",
      "created_utc": 1738658633.0,
      "score": 3
    },
    {
      "id": "max49zr",
      "body": "I went through a similar experience as a child. I used video games as way escape from reality, and would immerse myself in them as much as possible as a way to detach myself from what was going on. My grades began to slip as a result, but I didn’t care— I just wanted to distract myself as much as possible and pretend that my issues didn’t exist. Whenever something became stressful, I would simply retreat to gaming for many hours, and use it as a coping mechanism and as a way to escape my problems rather than facing them.",
      "created_utc": 1738676308.0,
      "score": 9
    },
    {
      "id": "mbaj1og",
      "body": "I’m really sorry. I’ve read stories of how incredibly tough it is to stay sober. I’ll never forget a comment I read of someone who still thinks about Heroin every day after years of sobriety. It really stuck with me. It was so saddening to read.",
      "created_utc": 1738850252.0,
      "score": 3
    },
    {
      "id": "mbmyg11",
      "body": "so I've said all of that to highlight the fact that while I was responsible for my actions and choices, it wasn't like I woke up one day and made a conscious informed decision to be an addict, I hadn't sat back & thought oh I know what I want to do with my life and my education and my intelligence and good looks, I want to burn it all to the ground and then flush the ashes down the toilet to spite everyone who cared about me and just to maximize the pain and wreckage I could cause, I wanted to do it piece by tiny piece with occasional stretches of sanity and improvement to give everyone hope that I had finally decided to shape up and start loving my family more than I loved my drugs, only to destroy that hope yet again with another breakdown and/or relapse. I didn't look at what I could have been or should have been and say nah that life is too good for me, I'd much rather just exist instead of living, so fuck all of you. I only ever tried manage as best I could and to get away from and keep away as much as possible from the gut-wrenching pain that wrecked me every time I wasn't vigilant in my efforts to escape it. \n\nI am lucky enough to learn something from each fall from grace and I have ppl in my life that love me and don't judge me for the struggle I live with and for the times it gets the better of me and I have ppl who get me and understand that if I fall down I can get back up and the fall doesn't mean I don't love them or that I wasn't trying to get better. every day is a battle between the parts of me, the part that knows better and the part that just wants a break from it all and the part that wants to just not feel that familiar despair and lack of hope. some days I don't even understand myself. I can sit thinking happy thoughts about my daughter and how much I love her and in the next moment I am getting high bc even the happiest thoughts cause a pain so deep I can't breathe or think and I'm overwhelmed by emotions and then I get high to make it stop. how those things coexist baffles me. I love my daughter more than anything in this world and yet I will still reach for the pipe and my brain is absolutely certain that I need to use or I won't survive. I don't love drugs more than my daughter, so why can't I just stop myself? it's infuriating and maddening. in that moment, I'm powerless. but I don't want to be that way and I don't want to stay that way or to keep going back and continuing to hurt and disappoint my baby girl and my parents and my family. it's not fun for me. I wouldn't wish addiction and depression on my worst enemy and I certainly don't willingly choose to be this way bc it's what I want for my life or because I like or love it. unfortunately for me, my only brother doesn't get it and believes I'm a degenerate loser junkie who loves getting high more than she cares about her flesh and blood. he believes I could stop if I wanted anytime if I really wanted to. and unfortunately for addicts in recovery and those still struggling and for those who are becoming addicts everywhere, plenty of people don't get it and view addicts with disdain and think of them as less than human losers who chose to purposely fuck up their lives bc they wanted to. \n\nI appreciate everyone who is not an addict but also still treats us like real people and speaks with compassion and empathy about their struggles. \n\naddiction is not some choice or informed decision that ppl make. it's a disease that has no cure that they will fight against every day for the rest of their lives. no one wishes for that or wants that or makes it their goal in life. \n\nif you read this far, thank you for taking the time to hear me. it helps me to be able to admit these things \"out loud\" to other people. especially when they understand the struggle bc they struggle or have struggled as I do. and I hope that ppl who don't get it can take something valuable or useful from listening and maybe they begin to think about addicts and addiction a little differently. \n\nok I'm done",
      "created_utc": 1739009520.0,
      "score": 1
    },
    {
      "id": "maue3mf",
      "body": "Are you a drug addict? Because I am, and what OP wrote is a great interpretation as to why I use drugs. And as someone who’s talked to thousands of addicts in my life, this is how a good majority of them seem to feel. \n\nSure. Many, many people use drugs or alcohol just for fun. But most addicts use drugs as an escape from their internal feelings or difficult circumstances in life.",
      "created_utc": 1738631697.0,
      "score": 8
    },
    {
      "id": "maubtwc",
      "body": "I mean OP’s interpretation is pretty accurate for a lot of people who struggle with drug abuse/addiction. Obviously not all, but they didn’t say all",
      "created_utc": 1738630972.0,
      "score": 11
    },
    {
      "id": "maxy9c5",
      "body": "I’m sorry if I upset you. Maybe you’re right, maybe I don’t understand at all, and perhaps your struggles are far greater than I could ever comprehend. All I can say is I didn’t mean to cause any hurt, and I’m sorry.\n\nI also saw your post about suffering for many years, and I realize now that you’re right. You’re been through far more. I’m the selfish one.",
      "created_utc": 1738685784.0,
      "score": 5
    },
    {
      "id": "mb2ic8u",
      "body": "This is the correct answer and why I hopefully will never use them or drink heavily.\n\nIt doesn't fix anything, it's a waste of money, a temporary thing and it's bad for your body.",
      "created_utc": 1738739380.0,
      "score": 8
    },
    {
      "id": "mavpi4n",
      "body": "Thank you very much.\n\nSome days it gets to me, it just so happens that today was one of those days. Go down that dark place and start believing everything you think. It sucks",
      "created_utc": 1738649355.0,
      "score": 15
    },
    {
      "id": "maw84s2",
      "body": "By the time I was depressed enough to kill my self, I had already been addicted to it for a while",
      "created_utc": 1738660112.0,
      "score": 7
    },
    {
      "id": "maw9j8s",
      "body": "Oh What made u start it",
      "created_utc": 1738660992.0,
      "score": 1
    },
    {
      "id": "mawbeab",
      "body": "I was given pain pills when I was 12, so I knew what it felt like.  Then my brother died a few years later which kinda kicked it all my casual drug use into self medicating drug use. And once youre using drugs for a while you get into this cycle of using drugs to feel better, but then when they wear off you feel worse than before so you take more.",
      "created_utc": 1738662176.0,
      "score": 6
    }
  ]
}