{
  "id": "1jhmhtt",
  "title": "I’m leaving.  I’m going on a death tour.  I’m going to see the sights.   I’ve lived my life and I’m ready to go.  46 years old.  No girlfriend.  No wife.  No kids.  No family.  I’m tired of it all.  To all those I’ve met through out my life I love you.",
  "selftext": "My name is Jacob shonkwiler and I give my body to nature.   ",
  "created_utc": 1742688373.0,
  "score": 1030,
  "num_comments": 211,
  "url": "https://www.reddit.com/r/depression/comments/1jhmhtt/im_leaving_im_going_on_a_death_tour_im_going_to/",
  "comments": [
    {
      "id": "mj8mlz4",
      "body": "Hey Im a frequent lurker on here and currently going through depression. Younger than you- 31 year old Male. But i saw that in your previous posts that you like Hip Hop and Basketball. I apologize if it feels stalkerish but I just rewatched Erykah Badu’s Window Seat music video because of you. It was so epic… it took me out of mindless scrolling on reddit for 5 minutes so I appreciate you for that. \nI wish I can have courage like her to break out of my depression cycle. I know it might not mean much but it feels comforting knowing someone with similar interests as me go through difficult times. I have a feeling I may never marry or even a partner in the future. Maybe flings… I hope I can find the will to live though.",
      "created_utc": 1742691984.0,
      "score": 358
    },
    {
      "id": "mj8m3u0",
      "body": "[removed]",
      "created_utc": 1742691796.0,
      "score": 111
    },
    {
      "id": "mj8kcnk",
      "body": "Not gonna lie I feel this way quite often lately. I have zero support and a family that doesn’t care. I struggle with wondering why I keep going on. I’m bipolar 1 with psychotic features and right now I’m going through very low lows and periods of severe anxiety. I am so tired of this life. I’m also 46 and just tired. But something keeps me here. Maybe it’s the fear of doing anything to end it all. Idk. I take my meds and hope to feel normal whatever that is. \n\nDon’t give up. We deserve some happiness eventually, don’t we?! \n\nSorry for the rant. Just spent an hour bawling my eyes out because I hate life.",
      "created_utc": 1742691146.0,
      "score": 154
    },
    {
      "id": "mj8xmc9",
      "body": "[removed]",
      "created_utc": 1742696204.0,
      "score": 34
    },
    {
      "id": "mj9hiyg",
      "body": "I hope you'll reconsider. You've survived depression for 46 years. I've survived 61 years. Throughout all the pain, you obviously found ways to cope. There are so many people out there suffering. I've come to the conclusion that if I can help even one person emerge from the darkness, my life will have value/meaning. I share that with you in hopes that you may come to a similar conclusion or perspective.  People need help and those of us who've walked the walk (or whatever that saying is), are a very valuable resource....Peer help. Helping others will give your life meaning...I promise.  All of the other elements that are missing in your life or you feel are unattainable, will more than likely fall into place when you take all of the pain you've experienced and use it in a resourceful way. I wish you the very best and hope you'll maybe at least give this a thought.",
      "created_utc": 1742704825.0,
      "score": 33
    },
    {
      "id": "mj9brz4",
      "body": "[removed]",
      "created_utc": 1742702114.0,
      "score": 26
    },
    {
      "id": "mj8jbak",
      "body": "[removed]",
      "created_utc": 1742690764.0,
      "score": 57
    },
    {
      "id": "mj8gsbr",
      "body": "[removed]",
      "created_utc": 1742689827.0,
      "score": 35
    },
    {
      "id": "mj8s43l",
      "body": "I found my now husband in my 50’s things happen when you less expect it.",
      "created_utc": 1742694080.0,
      "score": 59
    },
    {
      "id": "mj8hltn",
      "body": "[removed]",
      "created_utc": 1742690132.0,
      "score": 52
    },
    {
      "id": "mj916xt",
      "body": "I hope everyone finds some peace I broke a lot of dishes it felt good then as I was cleaning them up it just reminded me how unhappy I am with this reality I can’t seem to escape",
      "created_utc": 1742697619.0,
      "score": 14
    },
    {
      "id": "mj98gj5",
      "body": "I get it, man. Hope you can find reasons to stay. But if not, if you truly want to go, then I respect that.",
      "created_utc": 1742700649.0,
      "score": 14
    },
    {
      "id": "mj9kz5a",
      "body": "Hey I did that! Met my wife.",
      "created_utc": 1742706579.0,
      "score": 8
    },
    {
      "id": "mj8h498",
      "body": "[removed]",
      "created_utc": 1742689951.0,
      "score": 21
    },
    {
      "id": "mj8ve2e",
      "body": "[removed]",
      "created_utc": 1742695345.0,
      "score": 12
    },
    {
      "id": "mj9g91v",
      "body": "I’m giving myself till I’m 40 then doing to same if I can’t improve my life.",
      "created_utc": 1742704208.0,
      "score": 6
    },
    {
      "id": "mja6ejs",
      "body": "I want to do this and have the money to say go on a long road trip.   But I'm to depressed to do anything.    Or I just get overwhelmed with the thought of planning it etc.   plus I got animals.",
      "created_utc": 1742719723.0,
      "score": 6
    },
    {
      "id": "mj8r96e",
      "body": "[removed]",
      "created_utc": 1742693746.0,
      "score": 8
    },
    {
      "id": "mj9nwpn",
      "body": "[removed]",
      "created_utc": 1742708216.0,
      "score": 4
    },
    {
      "id": "mjnksb4",
      "body": "I've been dreaming of doing something similar. I have over 100k€ in savings and I could also get a decent unemployment benefit from my union if I were to resign from my job for at least a year. I could move to some cheap tropical country and live off my savings for around 5 years. Just living in the moment not worrying about the future and then kill myself once the money runs out. I'm \"only\" 30 but I have absolutely no motivation pursuing any of the conventional life goals and perceive them to be devoid of any meaning.  I don't really know what else to do with my life either. This makes it incredibly difficult to relate with \"normal\" people, I have to wear a mask all day long pretending like I care about the stuff they like to talk about. This makes you feel isolated.",
      "created_utc": 1742910980.0,
      "score": 4
    },
    {
      "id": "mj8im92",
      "body": "[removed]",
      "created_utc": 1742690508.0,
      "score": 19
    },
    {
      "id": "mj905vt",
      "body": "I feel you man more power to you I feel exactly the same 40 years old one child I’m just tired of playing a game I didn’t sign up for ewe come here without any choices forced to participate in this matrix. I hope you find the peace and courage I’m trying to find bro",
      "created_utc": 1742697207.0,
      "score": 3
    },
    {
      "id": "mjqav61",
      "body": "Hey bud. I’m with you but I am still here because I know if I gave “my body to nature” it would kill my mother. ✌🏼 There is love out there for you. Even if it is on here.",
      "created_utc": 1742939233.0,
      "score": 3
    },
    {
      "id": "mjtm406",
      "body": "I’ve suffered from Major Depression my whole life and I can tell you that I value my solitariness.  Just because you’re not married, no kids, etc. doesn’t mean you’re a failure.  Hell, i was in rough shape in 2023 when I found out my ex was cheating on me and then lying about it to my face of course.  She treated me like a human punching bag, free therapist, ATM machine.  So, my point is here is that, not everything that glitters is gold.  I enjoy being single nowadays, I’m certainly never getting married or anything anything.  And I’m younger than you.  But just know you are not alone.  Silence is golden.  You have more resources and time to focus on what’s best for you.  If you want to date bad enough, just lay low and let the cream of the crop come to you first in due time.  Women love modest men.  Anyways take care and I hope this helps.",
      "created_utc": 1742992138.0,
      "score": 3
    },
    {
      "id": "mk6yq17",
      "body": "I feel you. So very much.\n\nI'm 53, now homeless, lost touch with so many people over the years, my daughter passed 9 years ago aged 24, my 25yo son wants nothing to do with me as he can't sponge off me, I stopped drinking 11 years ago, which I'm still not sure helped anything, and I'm typing this from a small hotel room.\n\nThe temptation... the urge... to just find a place to lay down and never get up from again is astonishingly strong now.\n\nI feel worthless, hopeless, and exhausted. Can't even go and see the sights. May as well just go to sleep.",
      "created_utc": 1743173496.0,
      "score": 3
    },
    {
      "id": "mklhlga",
      "body": "Well, I just figured I’d add to this. I’m 53. I just broke my ankle in my shin. I’ve been sober for two years. I have no children. I have no siblings and I don’t have parents. I don’t know what I should go on for I really don’t have a reasonnone zero.",
      "created_utc": 1743375335.0,
      "score": 3
    },
    {
      "id": "mj8juml",
      "body": "What if your meant to find someone by 47? And your giving up on them by leaving. Just sayin… \n\nIf you end it, you know what awaits you… nothingness.\n\nSo just stay for a lil longer? Enjoy some more uncertainty and you may eventually be pleasantly surprised",
      "created_utc": 1742690961.0,
      "score": 14
    },
    {
      "id": "mj99hc1",
      "body": "I’m 45 and am dealing with the same thing",
      "created_utc": 1742701090.0,
      "score": 2
    },
    {
      "id": "mjvqqee",
      "body": "Go on a lifetour. See what you’ve always wanted to see but stay. Please stay. There’s beauty out there for you. I hope you find love and happiness. You are loved bc I love you. Please stay.",
      "created_utc": 1743015550.0,
      "score": 2
    },
    {
      "id": "mjyf3ap",
      "body": "Feel ya hope you see something that makes it all worthwhile to see more days ",
      "created_utc": 1743046610.0,
      "score": 2
    },
    {
      "id": "mjz7dk1",
      "body": "I'm so sorry, Jacob. :(",
      "created_utc": 1743062462.0,
      "score": 2
    },
    {
      "id": "mjcstze",
      "body": "[removed]",
      "created_utc": 1742756644.0,
      "score": 2
    },
    {
      "id": "mj8tmwr",
      "body": "I'm trying to figure out if you're sad? Lonely? Or do you feel like you've done everything there is to do?",
      "created_utc": 1742694669.0,
      "score": 1
    },
    {
      "id": "mj8xpsx",
      "body": "Hey! Just curious, who did you meet throughout your life?",
      "created_utc": 1742696241.0,
      "score": 1
    },
    {
      "id": "mk8bp1t",
      "body": "You ever thought about just buying a mobile home and living out more in the nature and away from all these crappy people?",
      "created_utc": 1743187748.0,
      "score": 1
    },
    {
      "id": "mkbj6ky",
      "body": "Why can’t you change your area instead of a death tour hope you change your environment and see try one more time 😢",
      "created_utc": 1743230631.0,
      "score": 1
    },
    {
      "id": "mkbmn14",
      "body": "6 days anybody know what happened??😢",
      "created_utc": 1743232880.0,
      "score": 1
    },
    {
      "id": "mkef01i",
      "body": "Who are you trying to convince?",
      "created_utc": 1743275393.0,
      "score": 1
    },
    {
      "id": "mj8qgbr",
      "body": "[removed]",
      "created_utc": 1742693439.0,
      "score": 0
    },
    {
      "id": "mj9ju4h",
      "body": "[removed]",
      "created_utc": 1742705980.0,
      "score": -4
    },
    {
      "id": "mj9i281",
      "body": "Wow. Lovely comment. Now I want to watch it. Also into hip hop.",
      "created_utc": 1742705085.0,
      "score": 71
    },
    {
      "id": "mjbbgaa",
      "body": "[removed]",
      "created_utc": 1742739913.0,
      "score": 23
    },
    {
      "id": "mjodnm2",
      "body": "Everyone will find someone. There is a job for someone and a person for someone. Everyone is different. I have a lot of mental health issues and I understand where people are coming from. Im open to anything you guys wish to do.",
      "created_utc": 1742919728.0,
      "score": 9
    },
    {
      "id": "mj90a5t",
      "body": "Me too me too it’s been a horrible week for me new lows",
      "created_utc": 1742697253.0,
      "score": 26
    },
    {
      "id": "mjbeunq",
      "body": "I cried for a total of 6 hours yesterday. Felt like I got hit by a train by the end of the day. Do you want to talk about it?",
      "created_utc": 1742741060.0,
      "score": 8
    },
    {
      "id": "mjdq0z8",
      "body": "Yeah take the meds and hope something changes that's all we can do.  Survive until we have strength to make the changes we know we need to make. Break the cycle until we get drawn back into it again. Then go through it all again when we trick ourselves that we are normal again and take it for granted that we are never normal",
      "created_utc": 1742767053.0,
      "score": 4
    },
    {
      "id": "mkfvj4d",
      "body": "Man using your pain to help others….so deep I always think about if I can impact lives beyond me. It’s such a crazy concept, but your right maybe our experience can offer others light in the darkness.",
      "created_utc": 1743293269.0,
      "score": 2
    },
    {
      "id": "mj8icaq",
      "body": "[removed]",
      "created_utc": 1742690406.0,
      "score": 66
    },
    {
      "id": "mj8i1bv",
      "body": "[removed]",
      "created_utc": 1742690292.0,
      "score": 23
    },
    {
      "id": "mjujiow",
      "body": "I’ve thought about doing this so many times, written notes etc but the only reason I stay here is because of my animals",
      "created_utc": 1743003088.0,
      "score": 2
    },
    {
      "id": "mj953ly",
      "body": "[removed]",
      "created_utc": 1742699224.0,
      "score": 2
    },
    {
      "id": "mjwtw4m",
      "body": "There's so many things you can do with that much savings! You don't have to be like everyone else. You can do so much. Travel. Slum it out of your car. Do anything that seems enjoyable for a bit. I recently adopted a minimalist mindset and starting clearing away anything I dont need. What if I regret it? Fuck it i can buy more stuff.  I'm not giving up and I hope others start to feel the same way! ",
      "created_utc": 1743026805.0,
      "score": 4
    },
    {
      "id": "mklkn5e",
      "body": "You should go to Yucatán Mexico like Play de Mujeres, it’s so beautiful over there near Cancun, (not the resorts) I mean those are nice, but I would live like the natives there do. Just be free and exist.",
      "created_utc": 1743376384.0,
      "score": 2
    },
    {
      "id": "mj8s4tf",
      "body": "I’m still here.  Planning out my death tour.  Heading to San Antonio tomorrow to get the last hat I’ll ever wear.  It’s set in stone.   I’m ready and willing to go forward with my decision.  I write this with a smile on my face.  I’m finally going to feel fear for the last time.",
      "created_utc": 1742694088.0,
      "score": 36
    },
    {
      "id": "mj8irjc",
      "body": "[removed]",
      "created_utc": 1742690563.0,
      "score": -7
    },
    {
      "id": "mkauytm",
      "body": "I hear that.",
      "created_utc": 1743218177.0,
      "score": 2
    },
    {
      "id": "mki5xai",
      "body": "hey , read my posts . just some ideas to ponder instead of pondering this way for the minute",
      "created_utc": 1743335170.0,
      "score": 1
    },
    {
      "id": "mklltgq",
      "body": "I have two cats and a toddler and a crappy husband. I think I’ve figured out a good, easy and clean way.",
      "created_utc": 1743376789.0,
      "score": 2
    },
    {
      "id": "mj8q282",
      "body": "[removed]",
      "created_utc": 1742693287.0,
      "score": 27
    },
    {
      "id": "mjf2ye8",
      "body": "[removed]",
      "created_utc": 1742784282.0,
      "score": 2
    },
    {
      "id": "mj92ajy",
      "body": "Sad.  Lonely.  In my circle, not noticed.  I’m noticed only for entertainment.  I joke within my circle that one day I’m going to take a walk in the woods to end it.",
      "created_utc": 1742698068.0,
      "score": 12
    },
    {
      "id": "mkbor7c",
      "body": "I heard he acted on what he wished upon..🥹",
      "created_utc": 1743234305.0,
      "score": 2
    },
    {
      "id": "mj8u3r0",
      "body": "[removed]",
      "created_utc": 1742694852.0,
      "score": 13
    },
    {
      "id": "mj91k95",
      "body": "[removed]",
      "created_utc": 1742697769.0,
      "score": 7
    },
    {
      "id": "mj9iphe",
      "body": "[removed]",
      "created_utc": 1742705406.0,
      "score": 2
    },
    {
      "id": "mjclgy7",
      "body": "Thank you for your kind words. Replying from outside right now, decided to tag along with friends to a car meet today (even though im not into cars like that. Appreciate you.",
      "created_utc": 1742754360.0,
      "score": 9
    },
    {
      "id": "mk8c1tb",
      "body": "When you grow up with an abusive narcissistic grandmother you end up like me and only attract abandoning abusive narcissistic women. I used to have hope that there was someone for everyone but the only thing that's proven true is the endless repetition cycle of dysfunction.",
      "created_utc": 1743187854.0,
      "score": 3
    },
    {
      "id": "mjabybq",
      "body": "Same here friend. Lows of lows. Just got out of the hospital for a 10 day stay for a heart thing AND my mental health right when I started a new pretty good job and just constantly fuckin shit up and of course having to explain the mental stuff to hr and all that is stress and embarrassment im constantly wprried about being fired, the struggle is reeeeal",
      "created_utc": 1742723279.0,
      "score": 15
    },
    {
      "id": "mj93uaz",
      "body": "I’m so sorry. Hugs to you.",
      "created_utc": 1742698696.0,
      "score": 17
    },
    {
      "id": "mjcxr2u",
      "body": "It helped me to hear you guys also had a terrible week, so thank you for sharing. We can get through this.",
      "created_utc": 1742758191.0,
      "score": 4
    },
    {
      "id": "mk8d8ml",
      "body": "Is there any purpose to the endless suffering? Do you believe it's part of some larger spiritual tempering?\n\n\nI've had the suffering get so bad recently that one day that I just completely transcended it feeling good for absolutely zero reason whatsoever even though things were worse on paper\n\n\nI had become \"aligned\", thinking only about the exact thing I was doing in the moment. Be that taking a walk or driving or listening to music I could not tolerate wondering in my own memories anymore",
      "created_utc": 1743188203.0,
      "score": 1
    },
    {
      "id": "mmc9w88",
      "body": "Thinking about you for real and hope you're doing ok!",
      "created_utc": 1744261647.0,
      "score": 1
    },
    {
      "id": "mj8mj8i",
      "body": "[removed]",
      "created_utc": 1742691956.0,
      "score": 49
    },
    {
      "id": "mj8ojsb",
      "body": "[removed]",
      "created_utc": 1742692712.0,
      "score": 12
    },
    {
      "id": "mjul2q1",
      "body": "Yeah my 15 year old dog is dying and has two tumors.   Some people think I should put him to sleep but I have not been able to.    Been happening since July and its fucking killing me.   I can't imagine waking up and him not being there.    I will have 10 years sobriety next month and I honestly don't know if I will make it.    \n\nI try and be somewhat positive and say ok now I can go travel etc.    But then again i have no desire!\n\nWhat's with the Tesla princess name?    I still have a Tesla plaid just because I love the acceleration so much but I know it is a very unpopular thing to have lol.",
      "created_utc": 1743003558.0,
      "score": 1
    },
    {
      "id": "mj9bqf6",
      "body": "If you feel like it, I bet I am not the only one who would like to see or hear about the places you go, the food you taste, the music you listen to…\n\nI’m imagining what I would do if I could just sell everything and go LIVE just for myself for a while without worrying about the future. There is so much, I don’t know how I would choose.\n\nI’m not pressuring you to share, just inviting you. If this is a private thing for you, of course we must respect that. But it would be a touching thing to leave behind for others.\n\nBest wishes, Jacob.",
      "created_utc": 1742702094.0,
      "score": 15
    },
    {
      "id": "mjz7cgs",
      "body": "In this world:( or at least whatever everyone believes in!",
      "created_utc": 1743062442.0,
      "score": 1
    },
    {
      "id": "mj8nn90",
      "body": "[removed]",
      "created_utc": 1742692374.0,
      "score": 35
    },
    {
      "id": "mqs8xmy",
      "body": "BreadfruitFederal262, care to share the easy and clean way?",
      "created_utc": 1746482935.0,
      "score": 1
    },
    {
      "id": "mj8sgwo",
      "body": "[removed]",
      "created_utc": 1742694215.0,
      "score": 15
    },
    {
      "id": "mj9blch",
      "body": "I understand that feeling because I've felt the same way for most of my life. I'm 34 now, have no friends, my partner has left me for a younger woman and I am not very close to my family. But that doesn't mean that we can't change. \n\nI felt like I'd hit rock bottom a while back and out of sheer desperation I forced myself to try and live constantly in the present moment. The changes I felt after doing this intensively for only a few days were actually crazy. I stopped worrying about everything and just had this sense that I could handle whatever came my way. I stopped doing it as frequently but I'm forcing myself to try it again and hopefully stay consistent this time as I know how transformative it was.",
      "created_utc": 1742702031.0,
      "score": 3
    },
    {
      "id": "mj95fhz",
      "body": "So, let's do the \"what-if\".\nWhat-if you're meant to meet someone and make their lives better?\nWhat-if you're meant to bring a life into this world?\nWhat-if you're meant to save someone or something?\nWould you stay if any of these were true or even possibly true?",
      "created_utc": 1742699364.0,
      "score": 5
    },
    {
      "id": "mjt55ml",
      "body": "Sending a big hug 🙆🏼‍♀️ I know a couple who met and got married in their 80s. Both of their partners had passed and they were neighbours.. that's how they met. My mum met someone recently and she's in her late 60s. My uncle met his second wife quite late in life, they are very happy.  He wasn't attracted to her at first, they met on a dating site but she pursued him and they've been together many years now. They are probably the happiest couple I know of. Don't give up hope! ",
      "created_utc": 1742984064.0,
      "score": 1
    },
    {
      "id": "mki6e0e",
      "body": "hmmm maybe your an ambivert , great at being etrovert ie = the entertaining part and then youre an introvert as well = the sad lonely not noticed. bit. \n\nthats ok - you know a lot of very successful and famous artists are exactly this way. incredibly shy and find it hard to connect but they can come alive and be magnificent on stage. i know this for a fact as I work in the music industry and have done for years. Very normal way of being for musicians and artist types \n\ni wonder if you knew that or had considered that before",
      "created_utc": 1743335409.0,
      "score": 1
    },
    {
      "id": "mlascf3",
      "body": "😢",
      "created_utc": 1743728500.0,
      "score": 1
    },
    {
      "id": "mjalgq0",
      "body": "[removed]",
      "created_utc": 1742729039.0,
      "score": -3
    },
    {
      "id": "mjam5bg",
      "body": "[removed]",
      "created_utc": 1742729414.0,
      "score": -2
    },
    {
      "id": "mjnhik7",
      "body": "damn broo.. why tf can I actually relate to this shi- like bro I'm 15 ... smth happened today... my friend came to my house and took me to his place for playing smth and while playing his sister comes there and asks him about his birthday which is 3 days later and he says he has planned a party AND he has sent the invite to every1 and guess what he didn't send it to me ... I guess he didn't realize I was sitting cuz there were 5 of us in total (just for context we've been friends for quite a while now around 5-6 years or so and we keep playing frequently but I dunno man... and that thing REALLY destroyed my ind like- bro)",
      "created_utc": 1742909902.0,
      "score": 2
    },
    {
      "id": "mkefw5m",
      "body": "It's hard but with therapy, things can get better. Remember everything is for everyone. I grew up with a lot of trauma alcoholics and narcissistic people but what I found is things do get better",
      "created_utc": 1743275685.0,
      "score": 5
    },
    {
      "id": "mmtzcsu",
      "body": "Yes thank you for your words! I’m getting over a really rough patch right now. Hope you’re good too. 🙏🏾",
      "created_utc": 1744510370.0,
      "score": 1
    },
    {
      "id": "mj8rj9a",
      "body": "[removed]",
      "created_utc": 1742693856.0,
      "score": 33
    },
    {
      "id": "mj9ovtx",
      "body": "[removed]",
      "created_utc": 1742708789.0,
      "score": 8
    },
    {
      "id": "mjw49t2",
      "body": "Oh my gosh I’m sorry 🥺🥺 pet illness is the worst.. whenever I have really dark thoughts about my life I think about my kitties and it brings me back down from the ledge. Hang in there!!! 10 years of sobriety is amazing!! \n\nLol I made this account in 2020 and just named it after something I thought would be funny and stupid.. Tesla vehicles are great, I love my car but in no way endorse asshole felon 🤦‍♀️",
      "created_utc": 1743019526.0,
      "score": 3
    },
    {
      "id": "mj8rnag",
      "body": "[removed]",
      "created_utc": 1742693900.0,
      "score": 2
    },
    {
      "id": "mlqcoyd",
      "body": "I have more hope today, thank you. I've forced discipline upon myself. Walks, weight lifting, and listening to Master Shi Heng Yi.\n\n\nI've found meaning in my suffering. Maybe it's all just meant to help my soul grow. Hard lessons. But not without meaning.",
      "created_utc": 1743961412.0,
      "score": 2
    },
    {
      "id": "mjx8tgs",
      "body": "Yep I call the car an antidepressant for me because I take the car out at midnight to go get my ice cream (my other addiction).    I live in the woods near a deserted highway and there is no feeling like launching 0-100 mph in 4 seconds lol.   Always a dopamine rush.   Then I can still transport my animals as well when needed.    Xiomi will be producing a slightly faster SU-7 but until I can get that in the US I'm stuck with the unpopular antidepressant plaid 🤣.",
      "created_utc": 1743031555.0,
      "score": 1
    },
    {
      "id": "mk8eu7z",
      "body": "Elon is great. DOGE California! So many felonious lying dems here it makes me sick. ",
      "created_utc": 1743188674.0,
      "score": -2
    },
    {
      "id": "mj8sacn",
      "body": "[removed]",
      "created_utc": 1742694147.0,
      "score": 13
    },
    {
      "id": "mj9vcvq",
      "body": "[removed]",
      "created_utc": 1742712735.0,
      "score": 2
    },
    {
      "id": "mjcet9i",
      "body": "[removed]",
      "created_utc": 1742752336.0,
      "score": 1
    }
  ]
}