{
  "id": "1kr6rz4",
  "title": "i am not actively suicidal.. but if i die i will be extremely thankful",
  "selftext": "every time before i go to sleep i hope i never wake up.  \ni don't have a active plan to kms..no  \nbut i really wish i were dead. its a burden- living life  \ni can't concentrate in my studies.  \ni feel numb distressed sad all the fucking time...its tyring  \ni am having body ache from all this pain  \ni am always anxious  \ni am having thoughts which i know are not true...but my stupid brain doesn't stop thinking them  \ni can't even consult a psychiatrist nor i can take meds..my mum wouldn't allow me\n\ni tried distracting myself but it is overwhelming... nothing feels good  \ntoday i tried going out...i ended up having a breakdown...i couldn't interact with anyone  \ni want to cry but i cannot....ughhh i feel exhausted",
  "created_utc": 1747752589.0,
  "score": 676,
  "num_comments": 88,
  "url": "https://www.reddit.com/r/depression/comments/1kr6rz4/i_am_not_actively_suicidal_but_if_i_die_i_will_be/",
  "comments": [
    {
      "id": "mtb00w5",
      "body": "I think there’s something really sad about feeling that way because I definitely can relate. I don’t plan on doing anything, I know that I have too many things around me to take care of and friends who I do care about but there are days where I think about how much easier it would be to just fall asleep and not wake up the next .. \n\nLife is exhausting, depression is exhausting and sometimes I wish I could just put everything on pause and rot away for a little while.",
      "created_utc": 1747752911.0,
      "score": 96
    },
    {
      "id": "mtb9ul3",
      "body": "Same here, I don't plan on doing anything, but if I get some sort of ailment that leads to death, I won't prevent nature from taking its course.",
      "created_utc": 1747755783.0,
      "score": 60
    },
    {
      "id": "mtcu55f",
      "body": "There are souls that carry more weight because they were born too deep for such a shallow world. If you feel like everything hurts too much, maybe it's because you feel more, see more, understand what many ignore. But that's not weakness — it's intensity. And intensity doesn't need to die, you need to learn to breathe. Sometimes living is like walking through a dense forest in the dark. But even the tallest trees only grow because they insist on seeking the light. So don't rush to cut your story short before discovering the chapter that changes everything. Stay. Just a little more. Because even without promising answers, time sometimes surprises with peace. Even with all this, I hope it gets better, better dead or better still alive. \n\nI kind of feel anxious about one day being one of the people who will feel the moment of death. What will death be like for you?",
      "created_utc": 1747772219.0,
      "score": 19
    },
    {
      "id": "mtcflyy",
      "body": "i hope someday i will get a disease that will kill me, because then i have an excuse to die,",
      "created_utc": 1747767888.0,
      "score": 12
    },
    {
      "id": "mtbhpx7",
      "body": "I was going to say something else as well. Have you been tested for adhd? That overthinking and anxiety, as well as not being able to concentrate, could also point to being on the spectrum. If you haven't,  I would suggest doing so, as my anxiety was actually hyperactivity of the brain.",
      "created_utc": 1747758108.0,
      "score": 9
    },
    {
      "id": "mtc90ib",
      "body": "The issue I have with death is that I won't be around to enjoy it",
      "created_utc": 1747765961.0,
      "score": 9
    },
    {
      "id": "mtcxcpr",
      "body": "its funny how you can find exactly the same people as you on the internet, this should be like an opposite of the tinder, lets suffer together dont even swipe, I feel completely the same, I feel like I dont belong to anywhere like I'm here by mistake, nobody needs me, nothing depends on me, like I'm just a character in a movie and things are jist happening around me and I have zero effect on them no matter what I do, I feel completely powerless and helpless, I have no interest in any morning that will come I dont need to process any information anymore, Ibjust want to lie down and slowly fade away, best thing is that if i die no one will know, like my parents and family but not people I know my parents dont know how to work with internet and I dont have no one who would investigate if I wouldn't come around, and yes I would love to just crawl into a corner and cry till I sleep but I can't, the worst bc is all the people telling you how everything will pass, the thing is I'm pass that, i dont want anything no more, if I could have everything I want right tomorrow I would still choose not to exist",
      "created_utc": 1747773167.0,
      "score": 7
    },
    {
      "id": "mteiljp",
      "body": "I'm too much of a coward to end it",
      "created_utc": 1747792328.0,
      "score": 4
    },
    {
      "id": "mtfv5is",
      "body": "i feel this heavily. i don't have the balls or courage to actually commit since that'd deeply traumatize my loved ones, but if i died in my sleep i wouldn't mind. or if i get diagnosed with some terminal ailment i don't really care either",
      "created_utc": 1747815940.0,
      "score": 6
    },
    {
      "id": "mtcki1g",
      "body": "I have same thoughts but im at that point of life that even death seems pointless rather live depressed than completely vanish from this world.",
      "created_utc": 1747769337.0,
      "score": 3
    },
    {
      "id": "mtcxbwo",
      "body": "I thought so too. But I know it's not true. When I die, I won't exist. Something that doesn't exist cannot be thankful or feel fine.",
      "created_utc": 1747773160.0,
      "score": 4
    },
    {
      "id": "mtdv5jr",
      "body": "Thank you for sharing. It's comforting reading this knowing that someone else feels this way and can articulate it this way. I'm sorry you're going through this. It makes sense to be tired and to just hope it'll end soon.",
      "created_utc": 1747784024.0,
      "score": 4
    },
    {
      "id": "mtemtrd",
      "body": "Absolutely same. If only I didn't had chronic pain and trouble sleeping, I could do more stuff to make my life better. Every day is a living hell. And nobody around me understands. I also have cptsd, so my body and mind are destroying me while trying to help themselves.",
      "created_utc": 1747793862.0,
      "score": 4
    },
    {
      "id": "mtgblyr",
      "body": "Same. Not everything you wrote, but the title and some of what you wrote: same.",
      "created_utc": 1747825513.0,
      "score": 3
    },
    {
      "id": "mtgcbot",
      "body": "i feel exactly the same",
      "created_utc": 1747825849.0,
      "score": 5
    },
    {
      "id": "mtgm1r7",
      "body": "I understand this feeling. Every time im on the bus and see people driving recklessly I keep having this thought that one of them might crash into me, and that would be it. That thought brings me a kind of comfort, that there’s always an escape, im just relieved that death exists",
      "created_utc": 1747829991.0,
      "score": 3
    },
    {
      "id": "mtfv47h",
      "body": "I wish this every night too",
      "created_utc": 1747815917.0,
      "score": 3
    },
    {
      "id": "mtj82bh",
      "body": "Just keep going. It could get better. This life isn't forever. I can never do this shit especially if you have family that loves you that could find you like that. Can't imagine the pain that would cause them to find a loved one in that situation. ",
      "created_utc": 1747858039.0,
      "score": 3
    },
    {
      "id": "mtjg8og",
      "body": "Only reason I’m here is so I don’t make my family and boyfriend sad, if they were not here then it’s bye bye time for me",
      "created_utc": 1747860336.0,
      "score": 3
    },
    {
      "id": "mtkypar",
      "body": "It’s all so very exhausting.",
      "created_utc": 1747878188.0,
      "score": 3
    },
    {
      "id": "mu183rd",
      "body": "Same as you. My family thinks that I am OK. But I am not. Same story as you.",
      "created_utc": 1748105194.0,
      "score": 3
    },
    {
      "id": "mtcy9jf",
      "body": "Same bro same",
      "created_utc": 1747773433.0,
      "score": 2
    },
    {
      "id": "mtg08lq",
      "body": "Us bro uss!!",
      "created_utc": 1747819175.0,
      "score": 2
    },
    {
      "id": "mtjnm0v",
      "body": "Passive suicidal thoughts. Pretty common in depression.",
      "created_utc": 1747862383.0,
      "score": 2
    },
    {
      "id": "mtt8buy",
      "body": "Read the post\nWent through the comments\nAgree with your perspective.\n\nThe way mine feels is that life is work, and I'd rather be jobless.\n\nHave felt like this since i gained consciousness, I'm arguably successful luckily, but the number of times I've prayed to be the victim of an accident and be the only fatality cannot be counted. \n\nPlanes, trains, cars, parties, whatever activity I'm in i passively wish for rest, I get it, life can turn up. But I dont even know what that feels like, so how can I hope for that. Also, any explanation of it feels terribly underwhelming. \n\nOnly thing stopping me are the few people who genuinely care about me, and any time I think of them grieving I can't bring myself to cause them that additional pain.\n\nFor this reason, I do not grow, I do not improve, in anything I've achieved in life i did so with as minimal effort as I could conjure. \n\nReason: Why will get more people attached to my dim flame that i want to snuff out. No meaningful relationships aside from my birth ones, I do not even want for it meaningful connections, cause it's more reasons to feel guilty. I'm consciously and subconsciously self sabotaging my relationships to prepare for my eventual death. \n\nHonestly, I don't even think i want to get better. \n\nBetter sounds worse\n\nI just would rather turn my brain off and whatever is after here, I'd take my chances.\n\n27yo man btw, I can't even give advice to people without feeling like a hack cause I don't even take my own advice cause I believe it's bullshit.\n\nWould be a great time to join the army or sth.\n\nI just needed to vent, happy reading.",
      "created_utc": 1747996519.0,
      "score": 2
    },
    {
      "id": "mu0gmr9",
      "body": "yes I've been feeling that same feelings for years now",
      "created_utc": 1748096463.0,
      "score": 2
    },
    {
      "id": "mtb0v79",
      "body": "I'm sorry things are so difficult. But don't give up! You deserve to be happy, so keep pushing until you get there. Take care of yourself. 💓",
      "created_utc": 1747753155.0,
      "score": 2
    },
    {
      "id": "mtc00a2",
      "body": "[deleted]",
      "created_utc": 1747763346.0,
      "score": 1
    },
    {
      "id": "mtelctb",
      "body": "Do you like music? I can recommend things that will change your life",
      "created_utc": 1747793324.0,
      "score": 1
    },
    {
      "id": "mtvcghb",
      "body": "Yeah just a bourbon haze and kablamo",
      "created_utc": 1748021315.0,
      "score": 1
    },
    {
      "id": "mu6va79",
      "body": "I feel that alright. A lot. You're not alone. This world is just HORRIBLE. horrible, I tell you. I just read about a car hitting a turkey and not even stopping to help it. Humans are terrible. I just feel like everyone hates me and nobody cares about me.\n\n\n\n\nGod, please destroy this earth with humans in it so that finally everyone gets what they deserve, and finally maybe peace comes...",
      "created_utc": 1748188875.0,
      "score": 1
    },
    {
      "id": "mu7ta3o",
      "body": "I feel exactly the same way !!!!",
      "created_utc": 1748199111.0,
      "score": 1
    },
    {
      "id": "mu9s826",
      "body": "I wish I had cancer and pass away im not a good person and when things don’t go right in my life I blame other people I try so hard to do better my kids hate me sometimes my family like me all I ever do is fuck up my life I promise I don’t know why I’m here everyday I feel like I’m suffering trying to make it through a day I use to cry because I didn’t wanna die and I was scared one day I would hurt myself but I don’t even have the balls to do that I know things could be better someone life might be worse but living in my brain with with no self love is hell on earth ",
      "created_utc": 1748223746.0,
      "score": 1
    },
    {
      "id": "mua9i3m",
      "body": "My exact words all the time. No matter what your situation is life sucks. Ever time I see a car go by walking my dog I just hope it hits me",
      "created_utc": 1748230553.0,
      "score": 1
    },
    {
      "id": "muaw4uy",
      "body": "I feel the same. Since the last time I try to attempt, I promise myself not to do anymore. But now I feel like everything is pushing me to suicide. I can't get those thoughts out of me. I can laugh and talk but still everyday feels empty. Everything is getting worse for me.",
      "created_utc": 1748241741.0,
      "score": 1
    },
    {
      "id": "mubetmd",
      "body": "Do drug have sex and party hike backpack and forget about the world ",
      "created_utc": 1748252831.0,
      "score": 1
    },
    {
      "id": "mugv82n",
      "body": "I 100% relate. Depression fucking sucks. I hope you're able to get help soon, this sounds like some rough shit.",
      "created_utc": 1748323525.0,
      "score": 1
    },
    {
      "id": "muha499",
      "body": "Same here, I’m not planning on doing anything, but if the doctors told me I have stage IV cancer, I’d probably thank them.",
      "created_utc": 1748331933.0,
      "score": 1
    },
    {
      "id": "muhd43c",
      "body": "I don't plan on making another attempt, I still struggle though. I think that when I'm at the end of my life, assuming I know it's the end, my thought will be \"Finally, it's over.\"",
      "created_utc": 1748333770.0,
      "score": 1
    },
    {
      "id": "muhiuvc",
      "body": "we're the same",
      "created_utc": 1748337369.0,
      "score": 1
    },
    {
      "id": "mukdkfq",
      "body": "Yes. I say that to myself daily.   \n\nI’d like to just go to sleep…forever. ",
      "created_utc": 1748372479.0,
      "score": 1
    },
    {
      "id": "mteklqc",
      "body": "go for a walk, do you go to the gym? when you have nothing to care about your body is the one thing thats kept you going up to this point might as ell promote it and give it  nice bulk! get up no one is coming to save u",
      "created_utc": 1747793047.0,
      "score": 0
    },
    {
      "id": "mtgzpuu",
      "body": "You should do this if it's possible.",
      "created_utc": 1747834828.0,
      "score": 2
    },
    {
      "id": "mtbaf7z",
      "body": "yes  \nlike i wish someone kills me   \ni am not gonna stop someone if they did...  \ni think i am more afraid of the pain....i am not brave enough to kill myself.",
      "created_utc": 1747755951.0,
      "score": 23
    },
    {
      "id": "mtetbkf",
      "body": "thank you for this...  \ni do feel way too much...and it is exhausting..  \ni wish i didn't care that much..i wish i could just enjoy life as it comes.. take everything with a grain of salt but i cannot..\n\nthe metaphor is beautiful..  \nexcept sometimes i wish i was an epiphyte...getting the support from the tall tree..  \ni wanna let go...its like a trust fall...i want someone to catch me when i fall...but it is too much to ask\n\ni don't know what death will be like..whenever i try to imagine it.. its all black, nil...  \nits ironic how afraid of uncertainty i am, yet i am positive that death is better than living",
      "created_utc": 1747796250.0,
      "score": 10
    },
    {
      "id": "mte96mx",
      "body": "This answer resonated with me. I believe some souls are too deep.. I can empathize 100%",
      "created_utc": 1747788995.0,
      "score": 8
    },
    {
      "id": "mthgqnn",
      "body": "Thank you.",
      "created_utc": 1747839935.0,
      "score": 3
    },
    {
      "id": "mukdx77",
      "body": "Sort of. Something not too painful. ",
      "created_utc": 1748372581.0,
      "score": 1
    },
    {
      "id": "mtbqz9i",
      "body": "i haven't..  \nbut is obsessive thoughts are a part of it too??   \nthat would explain so much\n\nhowever, i'd like to point out my mum is a special ed teacher she never really said anything about me having adhd symptoms  \nshe did say i was a bit off tho...idk",
      "created_utc": 1747760792.0,
      "score": 1
    },
    {
      "id": "mtccp7y",
      "body": "interesting take",
      "created_utc": 1747767039.0,
      "score": 3
    },
    {
      "id": "mteq69u",
      "body": "yes.. i don't feel anything will pass  \nmy life has patterns that unfortunately is never being broken  \ni should get used to it by now...\n\ni think my mother's guilt trips are one of the reason that i don't actively try to kms.. should i be grateful? idk\n\nyou have put it quite aptly...wanting to lie down and fade away..thats it..",
      "created_utc": 1747795073.0,
      "score": 4
    },
    {
      "id": "mtg210i",
      "body": "yes..  \ni oscillate between there is no one that truly loves me, like yes they will be sad for a few days but they will get their life together   \nand if the people who i believe do love me sees my corpse that would be the most selfish thing i could do to them",
      "created_utc": 1747820303.0,
      "score": 5
    },
    {
      "id": "mth2pb5",
      "body": "I'm so sorry.    Who would ever think it would come to this?     I also have both those problems, seems impossible to be happy, and nothing helps or works.",
      "created_utc": 1747835761.0,
      "score": 3
    },
    {
      "id": "mtgqxbn",
      "body": "yes i feel the same way..  \nif i travel under a bridge i feel like it would collapse and that would be it...gone over",
      "created_utc": 1747831823.0,
      "score": 4
    },
    {
      "id": "mu2hssd",
      "body": "Coward",
      "created_utc": 1748120298.0,
      "score": 0
    },
    {
      "id": "mth3o24",
      "body": "There's no guarantee, unfortunately.   Pushing myself is what's killing me - constant failure.   Accepting my inertia and not caring is the best I can do.",
      "created_utc": 1747836057.0,
      "score": 2
    },
    {
      "id": "mtc2ytx",
      "body": "yup exactly....except i don't want to be in pain....just spot death",
      "created_utc": 1747764192.0,
      "score": 1
    },
    {
      "id": "mteqncu",
      "body": "i do like music...i just don't want to listen to it now..i am getting easily irritable",
      "created_utc": 1747795246.0,
      "score": 3
    },
    {
      "id": "mteqgx6",
      "body": "i am not allowed to go to the gym...  \nand i did go for a walk a few days ago...i don't know it feels overwhelming..  \ngoing out with a friend in a few days.. hoping for the best",
      "created_utc": 1747795180.0,
      "score": 3
    },
    {
      "id": "mtbe33y",
      "body": "I'm more afraid to mess up and then have to be even more of a burden on the people close to me. Or having to traumatize a passerby.\nI've had over 20 years of suicidal ideation, and in my teens and early 20s, I would engage in dangerous situations, hoping it would lead to death. \nI've been on meds for at least 10 years and therapy for the last 5, and it helps to a point. But that gnawing feeling never fully goes away. \nI gave myself an expiration date. If nothing happens by the time I'm 50, I would like to just go on a hike in a dangerous part of the woods with no identifications and just become \"lost.\"",
      "created_utc": 1747757026.0,
      "score": 15
    },
    {
      "id": "mu3gkl3",
      "body": "Special ed teachers do not diagnose mental illness. They are no way qualified to do so.",
      "created_utc": 1748133205.0,
      "score": 2
    },
    {
      "id": "mtbupy9",
      "body": "Because ASD is a spectrum, you could be on a high functioning side of it or high masking. \n\nUnfortunately, there's still a lot of misconception about adhd even from professionals like your mom (it might be because she deals with kids that are on the low end of the spectrum). Hyperactivity doesn't have to be physical, and obsessive thoughts and depression can also be signs of being on the spectrum. It's a very personal disorder and can present differently in each individual. \n\nI'm not saying you have it, but it's worth looking into it yourself and making an appointment with a Dr to be evaluated. I was diagnosed fairly recently, but because I grew up in a world where \"girls didn't have adhd,\" it was overlooked. They are making progress in research about ASD and many other mental health disorders, so it worth checking it out.",
      "created_utc": 1747761858.0,
      "score": 3
    },
    {
      "id": "muhxika",
      "body": "People don't always see the things closest to them & sometimes parents can be the worst for that. Because they don't see their kids having ailments or issues such as ADHD so they might say their kid is just a little off like your mom did. So maybe it'll take going to the doctor without her knowing about why you're going (since some parents can want to know everything you're doing & why)and tell the Dr. what you're going through and seeing what they say if you're diagnosed with ADHD she has no choice but to see it for what it is then. ",
      "created_utc": 1748345145.0,
      "score": 1
    },
    {
      "id": "mui079n",
      "body": "I lost my 19-year-old son a year and a half ago he was the only thing I really cared about. I have chronic pain 24/7 , depression and severe panic attacks  so now between his death & all of that I would gladly prefer to go to sleep and just not wake up that's it,  cuz I'm too much of a pussy to just end it. The only one I would feel bad about that happening too is my nephew because he's the only one I have. Well there is my sister and my nephew but, he's the only one who bothers being in my life. So I'd feel bad doing that to him.  but like I said if I just fell asleep and didn't wake up it would be good for everybody, something that they didn't have a choice in dealing with and I wouldn't have to wait before seeing my son again. And God I hope that that's the way that the Universe Works that I'll see him again when I die",
      "created_utc": 1748346334.0,
      "score": 1
    },
    {
      "id": "mthzc0j",
      "body": "And doctors say \"nah your body hurts cause you're fat\". I've been fat all my adult life, and the pain has like +5 years, not all my adult life, so something has changed, and it's not my weight.",
      "created_utc": 1747845284.0,
      "score": 3
    },
    {
      "id": "mugjwyb",
      "body": "that was me i couldnt even join after school clubs but i graduated high school and its over, it does get better an get motivation from setting a goal to get something material",
      "created_utc": 1748318073.0,
      "score": 1
    },
    {
      "id": "mu3g4js",
      "body": "I’m 48 and still fighting. I stay on this earth so that I don’t cause pain to the people I dearly love and you love me.",
      "created_utc": 1748133030.0,
      "score": 4
    },
    {
      "id": "mtbn1gn",
      "body": "i get that  \ni pretend everything is fine because i don't want anyone to know..i haven't talked to my friends about it because they will worry..\n\ni'd say everything is going to be fine, you are going to get through this  \nbut it feels wrong\n\ni however wish you all the best",
      "created_utc": 1747759668.0,
      "score": 4
    },
    {
      "id": "mth08nk",
      "body": "Me too.  I don't want anyone to even think about me anymore.  Not that they ever did, anyway.",
      "created_utc": 1747834992.0,
      "score": 3
    },
    {
      "id": "mud6qfk",
      "body": "I like your idea! My plan is kind of similar: walk in woods on winter(here can be lower than -30°C) with shirt and short until I cant move, I called it 'ice cream program'.",
      "created_utc": 1748277100.0,
      "score": 1
    },
    {
      "id": "mtbwzm2",
      "body": "thank you...  \ni will check it out\n\ni was recently made aware that i mask a lot....\n\ni will check it",
      "created_utc": 1747762493.0,
      "score": 2
    },
    {
      "id": "mti9zh2",
      "body": "Everybody hurts more as they get older, just about everybody I know.   I have osteoarthritis from a lifetime of work and heredity, but I can live with it for now.  Your Dr is not of any help by saying that.  Won't the Dr give anything for sleep or pain?",
      "created_utc": 1747848288.0,
      "score": 2
    },
    {
      "id": "mtbq1wh",
      "body": "I didn't realize how young you sounded from your post. \n\nI want you to know that they are now recognizing that there are different kinds of depression, and some are more treatable than others. There's no cure, but tools like medications and therapy do help. \n\nIf I could,  I would encourage you to find a safe source to talk to. It can be a friend or an adult in your life that you trust. I'm not invalidating  you from your personal experience, but in formative years ( especially with depression), everything seems much bigger. \n\nLearning to live with depression is difficult, but it is possible if you find the right tools and people you trust. We make our own families ( the blood of the coven is thicker than the water of the womb)",
      "created_utc": 1747760524.0,
      "score": 5
    },
    {
      "id": "mtbsm9v",
      "body": "i tried contacting some online psychologists they weren't any help  \ni did start doing therapy a couple of months earlier but couldn't continue..\n\ni know that, i know what i am feeling has no basis or the thoughts i am has no basis in reality but i cannot stop it...  \ni can't stop the feeling that is eating me  \nand it has been going on for months possibly even for years but i thought it would go away\n\ni am learning to push my boundaries  \ni try to make ppl feel comfortable but more often than not people leave..  \nidk i feel i will be alone forever...sounds childish i know...   \ni really wish i am proven wrong",
      "created_utc": 1747761263.0,
      "score": 3
    }
  ]
}