{
  "id": "1kfg4h9",
  "title": "I regret not killing myself when I was younger.",
  "selftext": "I’m surprised I made it to 24.",
  "created_utc": 1746462899.0,
  "score": 786,
  "num_comments": 217,
  "url": "https://www.reddit.com/r/depression/comments/1kfg4h9/i_regret_not_killing_myself_when_i_was_younger/",
  "comments": [
    {
      "id": "mqqqhxg",
      "body": "I've regretted not killing myself every day for the past two years",
      "created_utc": 1746466734.0,
      "score": 157
    },
    {
      "id": "mqqvzby",
      "body": "Here I sit at 38 thinking the same, friend. I'm sorry you're here with us. I hope it gets better for you soon. I'm only here still so my mom doesn't have to deal with that shit. Soon as shes gone though I'm spraying theses fucked up thoughts all over the place and I'm out.",
      "created_utc": 1746468296.0,
      "score": 78
    },
    {
      "id": "mqquoyx",
      "body": "Mood, no idea how I made it to almost 30 I stopped planning for anything past 16",
      "created_utc": 1746467923.0,
      "score": 115
    },
    {
      "id": "mqqmlpl",
      "body": "Same. I am 27 and I wish I killed myself when I was 17.",
      "created_utc": 1746465631.0,
      "score": 42
    },
    {
      "id": "mqqs6l2",
      "body": "Me too.  Wish I had done it in my twenties before I disappointed everyone.",
      "created_utc": 1746467213.0,
      "score": 34
    },
    {
      "id": "mqqqujw",
      "body": "don’t know how i’m 27 tbh",
      "created_utc": 1746466833.0,
      "score": 25
    },
    {
      "id": "mqro9ad",
      "body": "I'm 32. I'm married with two kids.\n\nMy wife has been supportive for over a decade. We both believed \"it gets better\"\n\nMy failed attempts as a teenager has brought so much suffering into the world. I should have tried harder. More pills. Cut deeper. \n\nI can't imagine another 30 years like this",
      "created_utc": 1746476618.0,
      "score": 23
    },
    {
      "id": "mqr90oo",
      "body": "I'm 42 and I agree, had a perfectly good plan when I was 14, oh well.",
      "created_utc": 1746472135.0,
      "score": 16
    },
    {
      "id": "mqqktne",
      "body": "Same... my 24th bday is coming up. Never ever one thought I'd be alive this long",
      "created_utc": 1746465126.0,
      "score": 24
    },
    {
      "id": "mqqz7u6",
      "body": "I made it to 40, it gets better and worse and better and worse",
      "created_utc": 1746469241.0,
      "score": 23
    },
    {
      "id": "mqrmudg",
      "body": "Honestly, same. Life gets worse every day and for someone like me there's not really a point in living on. I'm still a few years away from being 30 and I already feel like I've lived all that I can. ",
      "created_utc": 1746476214.0,
      "score": 11
    },
    {
      "id": "mqtpbyb",
      "body": "Me too mate. I wish I'd never come to Earth. What was I thinking",
      "created_utc": 1746501099.0,
      "score": 8
    },
    {
      "id": "mquomo5",
      "body": "I don’t believe in “God” because if he truly existed I should have died in my sleep. If he truly existed a lot of shit wouldn’t be happening… every night I flick off this “God” hoping that pisses “him” enough so I won’t have to wake up… I hate how far I made it. Just a dead end life filled with misery and disappointment. A fucking big joke if you ask me.",
      "created_utc": 1746519809.0,
      "score": 11
    },
    {
      "id": "mqv1jpz",
      "body": "[deleted]",
      "created_utc": 1746527788.0,
      "score": 6
    },
    {
      "id": "mqu7u7e",
      "body": "This is the one thing I’m horrified about. I remember when I got my first thoughts and committed my first attempt around 16-17. Here I am at 19, about to turn 20. I’m so fucking scared of continuing on like a parasite. I know I need to kill myself but I don’t have the drive. I’ve been living in isolation and ignorance for so long it’s genuinely who I am. I keep thinking I can do it but the Nihilism and fear kick in. “Why would my death matter? How would God look down upon you when you pass?” It’s painful but I have no choice anymore.",
      "created_utc": 1746509559.0,
      "score": 5
    },
    {
      "id": "mqughze",
      "body": "I just turned 25, and this is the most lost I have ever been. Before this, I didn't give much thought on me being my own person, but I knew that I was never going to make it big in life, although there were scenarios in my head that would state otherwise. But now that I am 25 with almost a quarter of my life gone with nothing to show, with all my peers stable and successful in life, I now know that I have lost the most golden years of my life, where one builds themselves to be better.  Never knew what tf I wanted in life, just lived in the moment, not worrying about my future or what I would do to earn a living. My parents have always been supportive of whatever I wished to do, but how does that work for someone who never wanted to do anything. I know that I disappoint my parents with every breath I take, and it would be best if I were just gone from this world . But there's always that one voice in my head that wants me to at least repay them for the things that they have done for me, regardless of my worthlessness. But there are moments when that voice starts to fade and begins to accept my fate to be doomed forever.",
      "created_utc": 1746514564.0,
      "score": 5
    },
    {
      "id": "mqqp2h8",
      "body": "I feel similar   It is possible to look at life through a different filter. It is possible for something good to happen to you. I'm 57 years old and an almost complete failure at almost everything   but I did have a good relationship for a few years and I am hoping to get back with them at some time in the future.",
      "created_utc": 1746466325.0,
      "score": 9
    },
    {
      "id": "mqrimkv",
      "body": "I can relate",
      "created_utc": 1746474989.0,
      "score": 3
    },
    {
      "id": "mqug4y7",
      "body": "I somehow made it to 33, and to be honest I would rather not...",
      "created_utc": 1746514346.0,
      "score": 5
    },
    {
      "id": "mqxjufl",
      "body": "for real, I'm about to go to university and attempted when I was 13, wish I didn’t fail",
      "created_utc": 1746557152.0,
      "score": 3
    },
    {
      "id": "mqrgrsh",
      "body": "'Fear of death' is a powerful thing. It's the only thing keeping me alive at 40. Parodically, my fear of death is also the source of all my anxiety, OCD, and despair.",
      "created_utc": 1746474450.0,
      "score": 7
    },
    {
      "id": "mqruiw3",
      "body": "Did an attemped last year wish i hadn't called for help",
      "created_utc": 1746478445.0,
      "score": 3
    },
    {
      "id": "mqs73xe",
      "body": "I turn 24 in 2 weeks. And I have been depressed since 9. I felt every word of this.",
      "created_utc": 1746482338.0,
      "score": 3
    },
    {
      "id": "mqsr48c",
      "body": "I feel this. I regret surviving my motorcycle crash in 2020",
      "created_utc": 1746489038.0,
      "score": 3
    },
    {
      "id": "mqsu7ss",
      "body": "You and me both.",
      "created_utc": 1746490087.0,
      "score": 3
    },
    {
      "id": "mqsuha5",
      "body": "I work so hard everyday in the hopes of my life getting better, but I barely ever see it. It's so hard to be optimistic about life...",
      "created_utc": 1746490178.0,
      "score": 3
    },
    {
      "id": "mqsxsx5",
      "body": "hey 22 here. thing is i used to feel like killing myself at 18 but since im such a pussy. im just choosing to not live anymore . AKA like a zombie",
      "created_utc": 1746491323.0,
      "score": 3
    },
    {
      "id": "mqtb9a6",
      "body": "I know how you feel I've lost count on how many times I've tried to kill myself.",
      "created_utc": 1746495966.0,
      "score": 3
    },
    {
      "id": "mqtr7s8",
      "body": "Same regret. Crossing into late thirties this year. If I could go back, I would help, and people don’t get that. I have a responsibility now to take care of, so I can’t indefinitely.",
      "created_utc": 1746501874.0,
      "score": 3
    },
    {
      "id": "mqtsk6j",
      "body": "I know how that feels. Working just to barely afford living and then feeling like it's pointless some days makes me go-\nWait? Why am I doing this again? Oh right. I chose too...really gotta plan for life rn don't I? Kind of thing. But needless to say I hope it gets better for you and honestly? I think some would find it odd if I told them the only reason I haven't done it is because i think of all the different ways to die sound painful and the risk of surviving it in an even more fucked up condition is why I haven't done anything.",
      "created_utc": 1746502443.0,
      "score": 3
    },
    {
      "id": "mqtxkkq",
      "body": "Same....I ALWAYS regret living",
      "created_utc": 1746504621.0,
      "score": 3
    },
    {
      "id": "mqty8jm",
      "body": "Same, I’m also 24 and feeling this way a lot recently",
      "created_utc": 1746504929.0,
      "score": 3
    },
    {
      "id": "mqubpvn",
      "body": "Me too, I wanted to die at 17… I’m 27",
      "created_utc": 1746511715.0,
      "score": 3
    },
    {
      "id": "mquon7u",
      "body": "I am 17 & at this point I don't care if I live or not. Nobody cares about me, literally none. I just wish to die in an accident. I don't want anyone to suffer because of me. I hope GOD will fulfill my wish one day",
      "created_utc": 1746519820.0,
      "score": 3
    },
    {
      "id": "mqv8c4k",
      "body": "Me too man mee too should have done it when I was 18",
      "created_utc": 1746531081.0,
      "score": 3
    },
    {
      "id": "mqzbzb5",
      "body": "[deleted]",
      "created_utc": 1746576674.0,
      "score": 3
    },
    {
      "id": "mqqss9d",
      "body": "Relatable, but somehow I am still hoping for a better future",
      "created_utc": 1746467383.0,
      "score": 2
    },
    {
      "id": "mqr12up",
      "body": "Same. But kinda not really regret killing just regret in general",
      "created_utc": 1746469788.0,
      "score": 2
    },
    {
      "id": "mqrelxm",
      "body": "omg same!!! my family would have gotten over it now , I tried to do it when I was young but luck wasn’t with me",
      "created_utc": 1746473811.0,
      "score": 2
    },
    {
      "id": "mqtja5l",
      "body": "Me too. Im 14",
      "created_utc": 1746498779.0,
      "score": 2
    },
    {
      "id": "mqtsacm",
      "body": "Surprised I made it to 28 tbh. Made a few attempts, just didn't go all the way.",
      "created_utc": 1746502327.0,
      "score": 2
    },
    {
      "id": "mqtt314",
      "body": "23 and I'm tired",
      "created_utc": 1746502663.0,
      "score": 2
    },
    {
      "id": "mqtvicp",
      "body": "Same, LMAO. It was never meant to be.",
      "created_utc": 1746503710.0,
      "score": 2
    },
    {
      "id": "mqvoprz",
      "body": "I wish i’ve killed myself last year, time flies and i’m not getting anywhere. I’m tired of wasting time doing nothing",
      "created_utc": 1746537500.0,
      "score": 2
    },
    {
      "id": "mqw9lv5",
      "body": "I also regret not doing it, the only reason I'm still breathing is for my kids and their dependency. And I'm still fighting the urge daily/weekly/random to go do it even with them around in my life.",
      "created_utc": 1746543949.0,
      "score": 2
    },
    {
      "id": "mqxt5x5",
      "body": "Same here. The world stopped spinning at 16 years old. I should have just die 5 hours after I was born, just like the nurses told my mom I might after birth",
      "created_utc": 1746559856.0,
      "score": 2
    },
    {
      "id": "mqxyle3",
      "body": "I’ve felt that every day for over 20 years. I tried, I’m 39 now, and obviously failed. Shortly after I met my now husband - told myself I’d try better after this relationship failed. Now I’m here with him, two kids, and a dog. I wake up every day wishing I hadn’t, wishing I would have just tried again, wishing I wouldn’t have even kept reaching out and talking to people. I never wanted to live this long, it’s exhausting. It hurts. I was recently also diagnosed as bipolar, which explains so many other things… \n\nAll that to say, you’re not alone 💜",
      "created_utc": 1746561407.0,
      "score": 2
    },
    {
      "id": "mqycfgx",
      "body": "If I knew how the situation would have turned in the next years I would have ended it at 14",
      "created_utc": 1746565305.0,
      "score": 2
    },
    {
      "id": "mqyyugw",
      "body": "Wish I'd done it before I helped pay rent.",
      "created_utc": 1746572256.0,
      "score": 2
    },
    {
      "id": "mqz8opk",
      "body": "I can relate to this heavy, I made an attempt in the summer of 2020, and since then my life has just gotten so much worse, I fantasize about how much better it would be if I actually did it",
      "created_utc": 1746575530.0,
      "score": 2
    },
    {
      "id": "mr0blzu",
      "body": "I wanted to do it when I was like very late twelve, early thirteen in COVID. Now I'm about to be 18 in a month and I regret not following through. I understand OP.",
      "created_utc": 1746589568.0,
      "score": 2
    },
    {
      "id": "mr0q0rg",
      "body": "Same here. Turning 27 in a few months. The highs are good, but when it dips, I don’t even want to live  for another day.",
      "created_utc": 1746596386.0,
      "score": 2
    },
    {
      "id": "mr2g5h1",
      "body": "I made it to 26, i really thought i would die when i was 16. life is surprisingly hard when you are not the average joe.",
      "created_utc": 1746626774.0,
      "score": 2
    },
    {
      "id": "mr35vwe",
      "body": "I’m also 24. When I was 18, I suddenly told my best friend that I want to fly into the blue sky, never come back down again and just disappear.\n\nIt sounded like just a silly joke back then. Yet, now, I do wonder if it was me actually wanting to die but was too scared to say it out loud…",
      "created_utc": 1746634327.0,
      "score": 2
    },
    {
      "id": "mqqgojv",
      "body": "i understand and have felt the same way but hey, all the struggle and hardwork put in to see the today cant be thrown away! tomorrow will be better than today and i hope you have a good life ahead",
      "created_utc": 1746463933.0,
      "score": 4
    },
    {
      "id": "mqr8xlx",
      "body": "I’m 32 and wish I killed myself at 25",
      "created_utc": 1746472110.0,
      "score": 2
    },
    {
      "id": "mqsf3dz",
      "body": "same here. i struggle all the time with if i want to go through the pain, put other people through pain (with my suicide), and so much more. it’s tiring when you know you’re a lost cause but you’re too scared to do anything about it.",
      "created_utc": 1746485008.0,
      "score": 3
    },
    {
      "id": "mqqokpw",
      "body": "I was about to end everything at 18, now I'm 23  close to 24, it's really.... a weird feeling",
      "created_utc": 1746466186.0,
      "score": 2
    },
    {
      "id": "mqu38ns",
      "body": "If anyone wants to talk im here for everyone ❤️ lifes not always sunshine and rainbows but you just need to look at the brighter side of things go out in nature and see how beautiful this life really is",
      "created_utc": 1746507199.0,
      "score": 3
    },
    {
      "id": "mqrzidz",
      "body": "You’ll find your peace here",
      "created_utc": 1746479946.0,
      "score": 1
    },
    {
      "id": "mr55kng",
      "body": "Me too. And the reason is because to do it, to take that final step, requires energy and passion and emotion... something that fades with ageing. People underestimate how much you have to care about your life to end it...when one is indifferent to everything it's hard to find the motivation to do anything, let alone something as \"big\" as ending it. You need a little bit of madness to take that final step\n\n\nMore to the point, 25 years after first thinking of terminating myself, I can't say it was worthwhile not doing so. Life has been as shit as I forecast it would be. ",
      "created_utc": 1746655040.0,
      "score": 1
    },
    {
      "id": "mr5xv2g",
      "body": "I agree. I wish I would have gotten it over with way before now.",
      "created_utc": 1746664709.0,
      "score": 1
    },
    {
      "id": "mr60tl2",
      "body": "Same. It doesn’t get better. Everything that ever gave me happiness was pulled away so that I could experience the grief.",
      "created_utc": 1746665744.0,
      "score": 1
    },
    {
      "id": "mr6njyn",
      "body": "Stay strong out there. I don't know what you're going through, but just stay strong and find someone who supports you.",
      "created_utc": 1746673873.0,
      "score": 1
    },
    {
      "id": "mr7c2oe",
      "body": "I'm also 24, and everything is going worse and worse in my life.  \nI feel the same as you, when I wasn't able to pull that freaking trigger...  \nI need help, but I am not brave enough to speak about it.  \nBut you are able to do it, it's a good step !",
      "created_utc": 1746685928.0,
      "score": 1
    },
    {
      "id": "mr8hsh2",
      "body": "Same i’m surprised I made it to 23 tbh",
      "created_utc": 1746708185.0,
      "score": 1
    },
    {
      "id": "mr8wsnk",
      "body": "relatable. 8 years ago I would have been dead and instead I'm still living a shitty life",
      "created_utc": 1746713227.0,
      "score": 1
    },
    {
      "id": "mr9s2wn",
      "body": "Here I am at 29 thinking the same thing. Have there been moments I’m glad I’m alive, sure. But overall I think about it everyday and that’s no way to live. I’m only here because of my family and what it would do to them. But I think about it more and more",
      "created_utc": 1746722442.0,
      "score": 1
    },
    {
      "id": "mra05k2",
      "body": "The longer u live the higher the chance that ul one day be grateful that u didn't\n\n\nUr gna die one day anyways, u might as well see what more life might have to offer before then\n\n\nI imagine that one day if u do die of natural causes, it'll feel like it all went by in the blink of an eye anyways\n\n\nHere's to a hopefully better future someday🍻",
      "created_utc": 1746724773.0,
      "score": 1
    },
    {
      "id": "mra10y7",
      "body": "I feel like I would now but not yet. I'm too scared to disappoint my family. I'm so tired.",
      "created_utc": 1746725023.0,
      "score": 1
    },
    {
      "id": "mra2pit",
      "body": "I'm glad I survived killing myself.  I died.  Had cardiac arrest.  Was in a body bag.  Was on life support.  Then moved to a ventilator.  What I regret is my family having to scoop vomit out of my mouth and do chest compression as I had aspiratied.  I regret tearing them all up.  I regret putting my mom through that before she died.  And then my dad had a stroke two years later.  In my head I can't stop thinking about what if I had caused that to happen to them?  My therapist said I wasn't the cause.\n\nThat happened when I was 26 and I'm 31 now.  I never thought I would make it past 18.  Growing my faith has kept me here.  It's not easy, but I'm doing my best.  \n\nSending my love and blessings.  It does get easier.  I still struggle with my mental health here and there, but it does get easier.\n\nQuitting drinking and using was also a life saver.  Even though it did make things easier at times.",
      "created_utc": 1746725511.0,
      "score": 1
    },
    {
      "id": "mrbc5cv",
      "body": "I am glad, you made it 'till 24.",
      "created_utc": 1746738874.0,
      "score": 1
    },
    {
      "id": "mrbnx8n",
      "body": "I am 19. I wanted to die before turning 18, now I feel ashamed for being too much of a coward to do it.",
      "created_utc": 1746742731.0,
      "score": 1
    },
    {
      "id": "mrcyetv",
      "body": "I wrote my first suicide note at 3rd grade. I thought it could get better when I get bigger. I almost gave up at 14, then again at 17. Only alive because I knew my dad would miss me, even though I knew my mother would forget me. I’m 29 and it’s with me everyday. Like I constantly fantasize about my own death. I wish I was gone everyday, everyone would be better off without me. But sometimes little things that make me happy make me feel good, and I’m glad I’m here to experience it. You can’t undo that decision so even if you’re alone eating cake, at least you have cake. Most of the time it’s the exhaustion, not depression that gets you. I say that knowing damn well I can’t sleep unless I have a knife or pills or rope near me in case I can’t live anymore, I have an immediate way out. Lol",
      "created_utc": 1746759914.0,
      "score": 1
    },
    {
      "id": "mrdm9jd",
      "body": "making it to 33 in two weeks feels like a fluke tbh. i'm  not prepared for any of this and i'm not more ahead because i didn't expect to make it this long. and i didn't think that things would still be terrible.",
      "created_utc": 1746771621.0,
      "score": 1
    },
    {
      "id": "mremf25",
      "body": "I attempted in the 4th grade. I’m 32 now. My worst mistake was not being successful because I’ve always been too scared to try again",
      "created_utc": 1746792193.0,
      "score": 1
    },
    {
      "id": "mrgejrz",
      "body": "If I'm being honest I regretted not being aborted by my mom. My life has been hell since birth. PTSD negligence by birth parents malnourishment and lots of abuse since a young child. I also have autism and got social anxiety and major depression at age 12 that has made my social life a living hell. I've never even had any romantic relationship in my life even though I'm 28. To top it off I have debilating anhedonia dpdr and fatigue for last 12 years. I don't know why I'm still fighting I think I'm only doing it because I'm on autopilot. There's no way to know if things will change for you but for me not much has changed. I'm not valued by anyone in society and am a loner. Life truly has been a rollercoaster of dissapointments for me. The end",
      "created_utc": 1746812933.0,
      "score": 1
    },
    {
      "id": "mrhpzhe",
      "body": "I made it to 44",
      "created_utc": 1746827725.0,
      "score": 1
    },
    {
      "id": "mrj86ou",
      "body": "I wish I had done it at 13 before I disappointed everyone.",
      "created_utc": 1746848344.0,
      "score": 1
    },
    {
      "id": "mrkgp0f",
      "body": "I’ll be 30 in a couple months. I wish I would’ve just done it when I was a teen. Now I have a daughter and I cannot do that to her. ",
      "created_utc": 1746873394.0,
      "score": 1
    },
    {
      "id": "mrl8ofg",
      "body": "“Think back about everything you would have missed”\n\n10 years of pain.",
      "created_utc": 1746885588.0,
      "score": 1
    },
    {
      "id": "mrlbroa",
      "body": "The only thing that stops me is my daughter. Her and her kids are all I have left. If it would not hurt them then I would have a long time ago. There are days when my grandkids are so mean to me it just pushes to the edge. I recently tried taking better care of myself. I bought some new clothes and started going to the community center. And made a friend. What little joy I had is gone. Everytime we go out together I get asked if I am her mother! She is older than me. It's happened 3 times. We are at the community center in a card game that was divided by age groups. And yet someone again asked if I was her mother. I should have just stayed home. I don't ever want to go out again. I can avoid the hurt. No matter what I try there is no happiness in my life. ",
      "created_utc": 1746886676.0,
      "score": 1
    },
    {
      "id": "mrmmwv7",
      "body": "Im 42 and feel this everyday I'm so sorry you are here with us. ",
      "created_utc": 1746902158.0,
      "score": 1
    },
    {
      "id": "mrn0767",
      "body": "Yeah I'm unfortunately kind of with you on that. Came here to say something encouraging but i don't have it in me today. Sorry you've been suffering too. This life is exhausting. Idk how many days i have left where i can feel this low. I have people i can reach out too as well but i can't even find the words today.",
      "created_utc": 1746906758.0,
      "score": 1
    },
    {
      "id": "mrnvb6g",
      "body": "I’ve regretted waking up after the attempt, I’m still here because I’m so lazy to even to do it again",
      "created_utc": 1746917905.0,
      "score": 1
    },
    {
      "id": "mroorhn",
      "body": "Same here. I was ready to have at it, and even felt the utter peace wash over me that people talk about when you plan to get rid of your life here. \n\nbut alas, I was really stupid, and went, 'hey, therapy session is tomorrow. maybe I'll give living one last chance, and if it doesn't work out by tomorrow, I'll do it then.' stupid. stupid, stupid. I have a hard time lying, because of the guilt. the therapist knew what I was getting up to. and to this day, my parents still don't seem to take me seriously, I don't get why they'd want me to exist if they agree that I'm such a downer, lmao.",
      "created_utc": 1746929340.0,
      "score": 1
    },
    {
      "id": "mrp0eal",
      "body": "I’m upset because in my religion if you die before puberty you immediately go to heaven and I got suicidal TWO years after TWO YEARS. If I was depressed two years earlier I’d probably be dead by now (I’m 13)",
      "created_utc": 1746934207.0,
      "score": 1
    },
    {
      "id": "mrp2qq3",
      "body": "it’s fucked up but i get it. my life peaked at 22, and i had wished i had the strength then, but now life has been hell and i see no end in sight.",
      "created_utc": 1746935226.0,
      "score": 1
    },
    {
      "id": "mrr4di9",
      "body": "bro i didnt even know i was ever gonna make it past 13 i need a hug or a cigarette idk",
      "created_utc": 1746973457.0,
      "score": 1
    },
    {
      "id": "mrred7w",
      "body": "Same here. I was going to kill myself at 19 when I was about to turn 20",
      "created_utc": 1746976690.0,
      "score": 1
    },
    {
      "id": "mrrjyg8",
      "body": "Same. I am a loser. And a burden to my parents. I feel guilty for existing",
      "created_utc": 1746978478.0,
      "score": 1
    },
    {
      "id": "mrv1f11",
      "body": "Same wish I was dead at birth why did God or what ever bullshit there is made me..",
      "created_utc": 1747023508.0,
      "score": 1
    },
    {
      "id": "mrva1zv",
      "body": "I just want an easy way out, but the guilt i feel leaving family behind is unbearable. Even though nobody is ever here for me my mom is gone and I only have one friend I would never wanna make anyone suffer. Im 17 but no idea where to even go from this age and feel unmotivated and hopeless",
      "created_utc": 1747028047.0,
      "score": 1
    },
    {
      "id": "mrvt6cp",
      "body": "Can tell me the reason?",
      "created_utc": 1747039850.0,
      "score": 1
    },
    {
      "id": "mrwchmq",
      "body": "Just wait until you are 40.  \n  \nBut seriously.. I hope you will find someone that you can love and something that can push you up.",
      "created_utc": 1747050527.0,
      "score": 1
    },
    {
      "id": "mrwi22e",
      "body": "I attempted when I was 14, however my mother rushed in and stopped me in the middle. I thought the same exact thought as you from 16-19, I just turned 22 and these ideas jump in from time to time, I'm just terrified to think I'm still here.",
      "created_utc": 1747052876.0,
      "score": 1
    },
    {
      "id": "mrwtka2",
      "body": "Same. I've been saying I've wanted to die since I was ten. I'm 33 next month, and nothing has changed",
      "created_utc": 1747057129.0,
      "score": 1
    },
    {
      "id": "ms6f2ll",
      "body": "20 here, wanted to do it since i was 12 and im praying i dont make it to 21",
      "created_utc": 1747177889.0,
      "score": 1
    },
    {
      "id": "mtztihs",
      "body": "ever since i had the balls to do it ive regretted it, but if i even had the balls i donf know what I'd do",
      "created_utc": 1748087629.0,
      "score": 1
    },
    {
      "id": "mumjlug",
      "body": "I tried and failed when I was 17. I’m now 23. Everyday recently I wish that it had worked.",
      "created_utc": 1748397077.0,
      "score": 1
    },
    {
      "id": "mqr8r1k",
      "body": "You've got something inside you that's kept you going. Even when everything felt hopeless, some part of you refused to give up. That's not nothing. Those dark times didn't break you. They tried their best, but you're still here. That inner strength - it's real. Not everyone has it",
      "created_utc": 1746472056.0,
      "score": 0
    },
    {
      "id": "mqsiue0",
      "body": "[removed]",
      "created_utc": 1746486273.0,
      "score": -5
    },
    {
      "id": "mqqmdv7",
      "body": "We can help each other .",
      "created_utc": 1746465568.0,
      "score": -3
    },
    {
      "id": "mquenrd",
      "body": "Same",
      "created_utc": 1746513446.0,
      "score": 17
    },
    {
      "id": "mrreg2o",
      "body": "Same",
      "created_utc": 1746976715.0,
      "score": 2
    },
    {
      "id": "mrukamx",
      "body": "I understand that",
      "created_utc": 1747015934.0,
      "score": 2
    },
    {
      "id": "mqswvdm",
      "body": "Felt that. My parents love me, don’t know how, all I ever gave them was sheer disappointment, one after another. Can’t do it for their sake, which makes me feel worse and more of a pussy than I already am. Probably should just do it and be done with it.",
      "created_utc": 1746490998.0,
      "score": 24
    },
    {
      "id": "mqz8i60",
      "body": "36 and my family hate me. No one will miss me. I'm not good enough for anything. Not even for ending my suffering. I'm don't know how to do it.",
      "created_utc": 1746575469.0,
      "score": 7
    },
    {
      "id": "mr56bu0",
      "body": "My plan too in my 40s. Even though I'm not close to my parents, I don't feel right doing that to them because my mum in particular hasn't had a great life. After they have passed though there's no more social obligations for me and I'm tapping out. ",
      "created_utc": 1746655281.0,
      "score": 4
    },
    {
      "id": "mqt1n5a",
      "body": "We seem to have the same plan, although I have a feeling I won't persevere long enough",
      "created_utc": 1746492635.0,
      "score": 5
    },
    {
      "id": "mrn0d53",
      "body": "Damn same boat.  38 and only still around because my mom. Struggling like crazy to find something else to keep me here before she passes one day. Idk",
      "created_utc": 1746906816.0,
      "score": 2
    },
    {
      "id": "mrr4vvv",
      "body": "Same",
      "created_utc": 1746973628.0,
      "score": 2
    },
    {
      "id": "mqts127",
      "body": "Me too. Every year that goes by, worse things happen. I wish I had avoided it all long ago.\nI don’t add anything good to anyone or even to myself. I have nothing good to offer to this world.",
      "created_utc": 1746502218.0,
      "score": 10
    },
    {
      "id": "mqsum05",
      "body": "Felt this",
      "created_utc": 1746490223.0,
      "score": 5
    },
    {
      "id": "mr575cf",
      "body": "For me it's not the disappointment for others but the shame for myself and the pointless life I've lived. Not only that I'm dead inside, no emotion or passion, and I just don't have the energy or motivation to do anything. You need a lot of drive or a lot of madness to end it. Which is why it's predominantly impulsive and rash people ending it. I have neither. Just constant low mood and lack of interest in life, with nothing ever being good, and sense of total trapness as me. \n\n\nI consider myself a coward for not ending it. Of course, I'm only commenting on me, no one else. ",
      "created_utc": 1746655546.0,
      "score": 6
    },
    {
      "id": "mqsuq9c",
      "body": "26 turning 27 this year and so afraid of the 27 club",
      "created_utc": 1746490263.0,
      "score": 10
    },
    {
      "id": "mqzzkx3",
      "body": "Same. Married with one kid. I love my family but also wish I did not have them. I use to worry about hurting parents but I am over that but do not want to hurt wife and kid. So trapped.",
      "created_utc": 1746584909.0,
      "score": 2
    },
    {
      "id": "mrde4vw",
      "body": "Fuck I get the same way",
      "created_utc": 1746767197.0,
      "score": 2
    },
    {
      "id": "mqyx3t7",
      "body": "I feel this. I’m about to be 27 this year, married, and have a son. I only stay for them but fear I am burdening my family with my dreadful existence. I feel stuck this way. It’s torture.",
      "created_utc": 1746571689.0,
      "score": 2
    },
    {
      "id": "mqqlx9w",
      "body": "Hey i share the same feeling",
      "created_utc": 1746465438.0,
      "score": 4
    },
    {
      "id": "mqtt31c",
      "body": "Lately it just gets worse then meh then worse  then meh haven't had a better in quite a while",
      "created_utc": 1746502663.0,
      "score": 12
    },
    {
      "id": "mqsuxic",
      "body": "I could see that",
      "created_utc": 1746490332.0,
      "score": 2
    },
    {
      "id": "mr5g3bl",
      "body": "I've made it to 59, but after about 50, it was all worse.  Been fighting this since I was about 15.  Life sucks.",
      "created_utc": 1746658562.0,
      "score": 2
    },
    {
      "id": "mrdebov",
      "body": "YESSSS ",
      "created_utc": 1746767295.0,
      "score": 1
    },
    {
      "id": "mrdefp2",
      "body": "Getting the same thing!!!",
      "created_utc": 1746767352.0,
      "score": 2
    },
    {
      "id": "mrdejnw",
      "body": "I'm sorry you are suffering",
      "created_utc": 1746767408.0,
      "score": 3
    },
    {
      "id": "mrdeyts",
      "body": "I think it is more suffering. At least for me.  I don't understand why we have to live that long. The whole living is a scam!!!! The world \"offers\" so many things but not available for everyone.  So u have money u enjoy but even u have money u will die.  And then everyone is trying to help one another to \"consume and spend\" the time while we can still breath !!! Then it comes with the wedding (what it I never find that person which I don't seem to be finding that person ).  Then baby.  Eveyrthing is about money and spending money.  Until the day we die.  When can I fucking die ",
      "created_utc": 1746767622.0,
      "score": 1
    },
    {
      "id": "mquvoqk",
      "body": "You fear of death itself ? Or you mean fear of what is after?",
      "created_utc": 1746524411.0,
      "score": 1
    },
    {
      "id": "mqtz2db",
      "body": "I don’t regret you surviving. It’s made me the happiest person I could be living life with you",
      "created_utc": 1746505304.0,
      "score": 1
    },
    {
      "id": "mrnq4tn",
      "body": ":(",
      "created_utc": 1746915914.0,
      "score": 1
    },
    {
      "id": "mr6nfe7",
      "body": "You alright?",
      "created_utc": 1746673820.0,
      "score": 2
    },
    {
      "id": "mr58ll2",
      "body": "Life for me has been one big let down, if I'd done it 25 years ago I wouldn't have missed out on anything ",
      "created_utc": 1746656024.0,
      "score": 1
    },
    {
      "id": "mqrbxtb",
      "body": "Ah yes, the sunk cost fallacy",
      "created_utc": 1746473007.0,
      "score": 2
    },
    {
      "id": "mqtu8f1",
      "body": "Same",
      "created_utc": 1746503157.0,
      "score": 1
    },
    {
      "id": "mresel0",
      "body": "So it doesnt  have any different",
      "created_utc": 1746794567.0,
      "score": 1
    },
    {
      "id": "mri18o7",
      "body": "Same here man",
      "created_utc": 1746831705.0,
      "score": 1
    },
    {
      "id": "mqtvyib",
      "body": "r/imfixednow",
      "created_utc": 1746503908.0,
      "score": 6
    },
    {
      "id": "mqrb27y",
      "body": "How ??",
      "created_utc": 1746472745.0,
      "score": 3
    },
    {
      "id": "mqrepp2",
      "body": "What if there is no helping each other? What if this world isn’t actually a good place at all? What if everyone who has told us that it is, if only we “focus on the positive,” are merely trying to convince themselves of such a truth?",
      "created_utc": 1746473842.0,
      "score": 3
    },
    {
      "id": "mr5huj6",
      "body": "Same...",
      "created_utc": 1746659169.0,
      "score": 3
    },
    {
      "id": "mqt1f37",
      "body": "Are you me, homie? Everything i attempt is just failure waiting to happen. Shit ass dead-end jobs all my life. I'll never be higher than where I am and where I am sinks lower every day. Sorry you're here too homie",
      "created_utc": 1746492559.0,
      "score": 17
    },
    {
      "id": "mrrk9gf",
      "body": "REAL AF. I'm sorry for all you going through the same shit. This is literally my life. A disappointment for my parents. Ppl always tells them I'm a disappointment. I'm a failure",
      "created_utc": 1746978578.0,
      "score": 1
    },
    {
      "id": "mqzatd1",
      "body": "Like Carlin said, \"I don't give a fuck how it all turns out in this country or anywhere else for that matter. I think the human game was up long ago when the high priests and traders took over...\" that is to say, find some fun in laughing at the absurdity of the world as we go down. Motorcycles help too. Plus if i or someone else fucks up while I'm on the bike it can all be over.",
      "created_utc": 1746576267.0,
      "score": 6
    },
    {
      "id": "mqt240x",
      "body": "It's easier if you just focus on the moment. Fuck later. It's gonna suck anyways. Time and energy are better spent mitigating the present pain. Weed helps.",
      "created_utc": 1746492797.0,
      "score": 8
    },
    {
      "id": "mrdmfmo",
      "body": "anybody else still holding on because of their pets? i just feel like they would miss me too much and that bothers me.",
      "created_utc": 1746771716.0,
      "score": 1
    },
    {
      "id": "mqzx8cq",
      "body": "You are not a burden! I’m sorry that you feel this way and have only stayed for your family. But please believe me that it is worth living. It’s worth living for your son, your partner, and all the other people in your life. It’s worth living for yourself because you’re here for a reason!",
      "created_utc": 1746584080.0,
      "score": 5
    },
    {
      "id": "mqwquwb",
      "body": "Fear of the dying process, really. I don’t really fear not existing.",
      "created_utc": 1746548937.0,
      "score": 3
    },
    {
      "id": "mrybsi2",
      "body": "Looks like I came to the wrong subreddit…",
      "created_utc": 1747073365.0,
      "score": 2
    },
    {
      "id": "mquj1cb",
      "body": "Same for me. I’m stuck for the last 15 years, don’t feel I’ve grown anything as a person, I’m sad and angry all the time. Everyday I wish I go to bed and don’t wake up tomorrow this shit reality. Just the most below average person there is, have zero motivation, when I happen to try something it always fails. Can’t go anywhere because I’m ashamed of myself, can’t keep a conversation because I always worrying not to make a fool out of myself and I always do. Even walking down the street I feel stressed. I really wish I was never born, somebody else could be taking my place and enjoying life, doing something joyful. I regret still being alive.\nI’m sorry we feel the same, I’m sorry you feel like this.",
      "created_utc": 1746516170.0,
      "score": 22
    },
    {
      "id": "mqzdneq",
      "body": "I don't know him but he has a point. I didn't learn how to ride a bike. Can't even drive a car. But Motorcycle is a terrible idea. There is a high chance that you stay alive but with disabilities.",
      "created_utc": 1746577260.0,
      "score": 4
    },
    {
      "id": "mrojx5z",
      "body": "I might be on the brink of insanity, again since I was once admitted for psychosis, but instead of seeking escape I'm leaning into the pain to see if it can be turned into something. \n\n\nIt's said that our pain can be our power depending on how we use it. I want to put this to the test. ",
      "created_utc": 1746927455.0,
      "score": 3
    },
    {
      "id": "mrhwbxp",
      "body": "Yeah, my dogs are Stressing that I am feeling down, Sucide is just selfish in the end if you think about it. Sometimes I think my time Will come eventually like in some sort of accident and that would be better than offing myself, at least then people wont get as hurt by the fact that I am dead.",
      "created_utc": 1746829943.0,
      "score": 2
    },
    {
      "id": "mrjgyxf",
      "body": "People barely care about their parents, I doubt the majority gives a shit about pets.",
      "created_utc": 1746852451.0,
      "score": 0
    },
    {
      "id": "mrznrbi",
      "body": "Well... Are depressed as hell",
      "created_utc": 1747087945.0,
      "score": 2
    },
    {
      "id": "mr9slag",
      "body": "I think about this all the time, why can’t I give my place to someone who wants it. Someone with a terminal illness or who died of an injury. I would gladly trade with them so they could live. Everyone says being alive is a gift, I feel like it’s punishment.",
      "created_utc": 1746722590.0,
      "score": 8
    },
    {
      "id": "mrlcr7m",
      "body": "It's like you looked inside me and wrote it down",
      "created_utc": 1746887013.0,
      "score": 3
    },
    {
      "id": "mrbn9p4",
      "body": "I’m not putting myself in your shoes because I’ve never been there but try and push through the hard times in life as you only live once. Sit down and think about all the things you enjoy, and try and milk the enjoyment out of them. I know my words aren’t too inspiring as I’m no writer but I hope this helps",
      "created_utc": 1746742506.0,
      "score": 2
    },
    {
      "id": "mqzev6v",
      "body": "You should check him out. George Carlin. That quote was from Brain Droppings. Good book. I hope you find better days soon, friend.",
      "created_utc": 1746577696.0,
      "score": 3
    },
    {
      "id": "mrzxtek",
      "body": "It certainly can. I'm planning to learn teaching, which I believe is a work I would actually love.",
      "created_utc": 1747091388.0,
      "score": 1
    },
    {
      "id": "mrhx273",
      "body": "yeah i got to talk to a hotline counselor last night and she was like that's a fine reason to hold on longer, that your cat and dog would miss you too much and \nthey've been cuddling with me all day today. animals are so intuitive. i do hope there are better days ahead for both of us.",
      "created_utc": 1746830204.0,
      "score": 1
    },
    {
      "id": "mrjhk7u",
      "body": "it's not so much i don't \"care\" about my parents, personally. my parents have only ever seen me as an extension of themselves. \nmy dad has always wanted me to go to law school because he never finished. my mom wants me to be a writer because she never pursued writing full time. \nmy parents would probably miss what i do for them, that's it. my mom lives alone so she would be lonely. but i do feel genuine need and affection from my pets, hence the guilt.",
      "created_utc": 1746852726.0,
      "score": 1
    },
    {
      "id": "mrobd6u",
      "body": ":/",
      "created_utc": 1746924077.0,
      "score": 2
    },
    {
      "id": "mqzlj9h",
      "body": "Thanks you too",
      "created_utc": 1746580061.0,
      "score": 3
    }
  ]
}