{
  "id": "1g5uwhx",
  "title": "Quiet quitting life",
  "selftext": "I am quiet quitting life and nobody realizes that’s what it is. My friends think I’m just being a bad friend. My family just thinks I’m being a bad family member. I don’t want to die but I don’t want to live in the world any more. I just want to go to work and then come home and that’s it. I don’t want to go have dinner with people anymore. I don’t want to hang out and be made to feel obligated to stay until 11 pm before I can go home.  Nobody realizes that this is my way letting go of life, of escaping from the world.  I’m alone, I’m 30 years old and haven’t had an intimate partner for a decade. I love those in my life tremendously. But I just want to let go. When I’m home, I’m free to be who I want. To feel how I want, to look how I want. I can say what I want, my cat doesn’t mind. He doesn’t judge. He looks up to me and needs me and he’s the only thing that’s warm in my bed.  There’s nothing more signifícate to write here. Just thank you for listening. ",
  "created_utc": 1729182376.0,
  "score": 1239,
  "num_comments": 102,
  "url": "https://www.reddit.com/r/depression/comments/1g5uwhx/quiet_quitting_life/",
  "comments": [
    {
      "id": "lse9rwx",
      "body": "Man holy shit I’ve never related to something more in my life",
      "created_utc": 1729186812.0,
      "score": 326
    },
    {
      "id": "lse4u80",
      "body": "I'm right there with you. I've just been doing it now for years. I'm still here. Not sure how. Really wish it wasn't so. But I just keep going through the motions.",
      "created_utc": 1729185269.0,
      "score": 113
    },
    {
      "id": "lsej3a9",
      "body": "I relate to this so much!",
      "created_utc": 1729189729.0,
      "score": 47
    },
    {
      "id": "lsfpd3l",
      "body": "This, but disabled with no income in the middle of nowhere",
      "created_utc": 1729203543.0,
      "score": 42
    },
    {
      "id": "lsf1p2a",
      "body": "[removed]",
      "created_utc": 1729195649.0,
      "score": 53
    },
    {
      "id": "lsftvwv",
      "body": "Fucking same, dude.",
      "created_utc": 1729205225.0,
      "score": 21
    },
    {
      "id": "lsg1vj3",
      "body": "I love my cat too. Does not judge",
      "created_utc": 1729208197.0,
      "score": 23
    },
    {
      "id": "lsg6bgq",
      "body": "I feel this. Pets are truly blessings. You can go no contact and live on your terms with emotional support kitty.",
      "created_utc": 1729209815.0,
      "score": 20
    },
    {
      "id": "lse4j0e",
      "body": "Pets are the best 💙keep your head up",
      "created_utc": 1729185171.0,
      "score": 36
    },
    {
      "id": "lsfyl9v",
      "body": "That sounds glorious honestly. I love being home alone with no obligations. Cat, Tv, books, arts and crafts, baking, rearranging furniture. So many good things. I hope your home is nice and cozy.",
      "created_utc": 1729206973.0,
      "score": 35
    },
    {
      "id": "lsg5y26",
      "body": "Doing that right now, didn't know there was a term for it. Then again, I'm 40, so I'm not too familiar with the new lingo nowadays. I seriously just want to fade away. Only thing keeping me around is my dog tbh.",
      "created_utc": 1729209679.0,
      "score": 15
    },
    {
      "id": "lsg080n",
      "body": "Same here. Everything’s been extremely exhausting.. I only wish I had a pet it would make it a little easier.",
      "created_utc": 1729207582.0,
      "score": 11
    },
    {
      "id": "lsgdiab",
      "body": "I've been there. For about 10 years I was like that. Keep taking that next step forward. One day things may change. Continue to invest in your health, taking care of your teeth, and being mindful of finances. At least give your future self a good foundation, especially if your mindset/lifestyle changes one day.",
      "created_utc": 1729212449.0,
      "score": 9
    },
    {
      "id": "lsgjvhi",
      "body": "If it wasn't for my cats, I wouldn't keep bothering.  I get it.\n\nI'm glad you and your cat have each other.",
      "created_utc": 1729214828.0,
      "score": 9
    },
    {
      "id": "lsfryfu",
      "body": "I feel this way. It's really difficult when I have a significant other and children, though. I can't recede into my own little corner like I'd like to. Feels like I'm always \"on\". For work, for family and friends...Never a time where I can just let go.",
      "created_utc": 1729204500.0,
      "score": 15
    },
    {
      "id": "lsfe3dw",
      "body": "felt like this before, I know this might sound dumb but try to find a hobby you enjoy (put as much effort in these) or go out and walk around a nearby park that has a trail/woody area. I’ve found that nature helps me feel more at ease. You never stop growing, maturing and changing. You might feel like you’ve peeked but you have your whole life ahead of you. Grow your circle, try new foods, places you’ve never been. your story isn’t over yet, so don’t rush to finish it before reading the whole book.",
      "created_utc": 1729199625.0,
      "score": 28
    },
    {
      "id": "lsgc6jh",
      "body": "I wish I could give you a hug, bro. Please don't give up. Hope you get better.",
      "created_utc": 1729211971.0,
      "score": 5
    },
    {
      "id": "lsgo39w",
      "body": "This is literally me, no one around me can understand why I want to just be on my own and not attend and social or family events. I’m just happy in my little hole on my own. Apart from the times where I’m not happy with it 😞",
      "created_utc": 1729216411.0,
      "score": 6
    },
    {
      "id": "lsfd4iy",
      "body": "I've been there too  but it sort of passed. Maybe it will for you, I hope it does. Just explain to them you need some time and just let them know it's not personal if you don't reply but you're going \"rogue\". I think people get too much socialization online and it made people just be done and realize how shitty the world is.",
      "created_utc": 1729199305.0,
      "score": 4
    },
    {
      "id": "lsgxpqj",
      "body": "I really don’t want to admit it, but I can relate to all of it, feeling the same each day, work, sleepless nights, don’t want to do anything, living alone, left my family, got no more friends, got nothing by my side, want to end it, but also want it to be painless, so just living life in the “It is what it is” style, and hope that someday it ends",
      "created_utc": 1729220206.0,
      "score": 6
    },
    {
      "id": "lsh6ysi",
      "body": "I'm right there with you. 30. My dogs are my world. I barely work. Just enough to keep the lights on and the dogs fed. All I do is play games. I don't like to go out or leave my house at all. I'm lonely, but I'm done with relationships.",
      "created_utc": 1729224370.0,
      "score": 5
    },
    {
      "id": "lshunzj",
      "body": "You don't sound as if you are quiet-quitting life to me....it sounds like you are protecting yourself from unnecessary bullshit.  If you are working and doing what you are supposed to do that's good.  If anyone tries to make you feel guilty or something for not participating in the 'extra' stuff....well, to hell with them.\n\nEnjoy your bubble.  I'm have depression but take medication or I'm absolutely miserable...I'm also an introvert.  I rarely leave the house and have groceries delivered.  But it's often boring and  lonely.  I live far away from where I am from so have to meet new friends and I really have no idea how to go about doing that today.  I have been single for 2 years and they took the dog 🥲.\n\nBut I do have roommates so have some interaction.  They have cats that I baby and I never was a cat person before.  But I'm still so OCD about getting ringworm or something that I wash my hands immediately after petting one lol.  Which is ridiculous because they are indoor cats and clean 😆",
      "created_utc": 1729238652.0,
      "score": 4
    },
    {
      "id": "lsi0zr9",
      "body": "wow… my heart is breaking reading this because this is me, I feel like nothing makes sense anymore. a daily cycle of waking up going to work, waiting for the week to be over, waiting for everything to be over",
      "created_utc": 1729243088.0,
      "score": 4
    },
    {
      "id": "lsgg40s",
      "body": "I quiet quit so hard!!",
      "created_utc": 1729213419.0,
      "score": 3
    },
    {
      "id": "lsgoe2m",
      "body": "I understand completely, I’m in the same situation only staying alive for my cat. Things do get better and I know how hard that is to believe but think about your cat or anything or anyone good in your life. I wish you all the besr",
      "created_utc": 1729216526.0,
      "score": 3
    },
    {
      "id": "lsh788v",
      "body": "[anhedonia](https://www.elisplace.org/anhedonia-when-life-loses-its-colour/)\n\nLiterally me right before I got helped, was on the verge of wanting to die but not actively planning it.  Knew I needed help when I was driving on the freeways and wanting to either run into a semi or have one run into me but didn’t do it cause it wasn’t guaranteed I wouldn’t end up not dead",
      "created_utc": 1729224500.0,
      "score": 3
    },
    {
      "id": "lsh8tbr",
      "body": "I'm 37 (M), have a wife, three year old and a two week old. They are my world but I feel the same. Leaving them on my own accord would be selfish, so I am snookered really.",
      "created_utc": 1729225305.0,
      "score": 3
    },
    {
      "id": "lshg926",
      "body": "……are you me???!!! I’m 40 and have to fight to live this way. I’m content with it but everyone else around me thinks something is wrong or broken. I promise you, you do you and you will be happier than you know. Of course keep those near and dear close to you, but only you knows what makes you happy and content, and it doesn’t have to be luxurious or exciting like people seem to think it needs to be.",
      "created_utc": 1729229329.0,
      "score": 3
    },
    {
      "id": "lshv92d",
      "body": "I feel this.",
      "created_utc": 1729239066.0,
      "score": 3
    },
    {
      "id": "lsi2dox",
      "body": "I really relate to this, sometimes being with others is too exhausting! I have to pretend to be happy and smile when I don't feel like it. I've been cancelling plans with friends and family last minute, I know it isn't good, but on the day, I just don't have the energy to meet up.",
      "created_utc": 1729244036.0,
      "score": 3
    },
    {
      "id": "lsiq7d7",
      "body": "Never related to anything more._.",
      "created_utc": 1729256190.0,
      "score": 3
    },
    {
      "id": "lsjbhaa",
      "body": "I’ve been quiet quitting most everything now. I just hope things turn around eventually. I’m sorry  I totally get it.",
      "created_utc": 1729263625.0,
      "score": 3
    },
    {
      "id": "lsfst5n",
      "body": "This is me but at 23 lol",
      "created_utc": 1729204820.0,
      "score": 5
    },
    {
      "id": "lsgqk30",
      "body": "I relate so much to this - just existing and going through the motions and having to convince myself each day to get up and push through.  It’s exhausting and if it wasn’t for my babies I’m not sure I’d be able to keep going.  Sorry for what you’re going through, it sucks.  I hope things get better or at least easier.  😊",
      "created_utc": 1729217369.0,
      "score": 2
    },
    {
      "id": "lsgsfe7",
      "body": "Nothing wrong with feeling the way you do. Sounds like a lot of us can relate, including myself. Life always finds a way to throw a curve ball. Instead of trying to appease anyone sometimes you need to take care of yourself. Be kind to yourself for feeling the way you feel. Ninjas are quiet and stealthy in their own ways, so embrace your inner Ninja until you feel otherwise.",
      "created_utc": 1729218096.0,
      "score": 2
    },
    {
      "id": "lsgsmwf",
      "body": "This is me so hard. I'm 30f, I was in a relationship, but it was abusive. I've just given up on everything. I come home and smoke weed, eat, game/watch TV/exist. Do this over and over and hope someday that something kills me and puts me out of this misery.",
      "created_utc": 1729218178.0,
      "score": 2
    },
    {
      "id": "lsh7ik4",
      "body": "Same. I’ve never been in a relationship tho. Just waiting to see if an outside force will take me out cause I’m too scared to do it myself.",
      "created_utc": 1729224648.0,
      "score": 2
    },
    {
      "id": "lshbdd3",
      "body": "This is it alright.",
      "created_utc": 1729226632.0,
      "score": 2
    },
    {
      "id": "lsinrpk",
      "body": "This is what I’ve done. Never considered it quiet quitting. It’s lonely sometimes, but so peaceful",
      "created_utc": 1729255220.0,
      "score": 2
    },
    {
      "id": "lsjf4p2",
      "body": "Me too. Me too.",
      "created_utc": 1729264797.0,
      "score": 2
    },
    {
      "id": "lsjyl19",
      "body": "Pretty much the same, along with the cat lmao.",
      "created_utc": 1729270939.0,
      "score": 2
    },
    {
      "id": "lsk42yn",
      "body": "Me too.. me fucking too.",
      "created_utc": 1729272654.0,
      "score": 2
    },
    {
      "id": "lsl0jl8",
      "body": "Same, I have just given up on other people and on society in general. They always let me down, so it's just me.",
      "created_utc": 1729283170.0,
      "score": 2
    },
    {
      "id": "lsmf1g2",
      "body": "This is really relatable, for a while now I've just pushed people and life away just wanting to dissociate from reality it's tough, stay strong",
      "created_utc": 1729301946.0,
      "score": 2
    },
    {
      "id": "lsk6xs2",
      "body": "To anyone struggling today,\n\nYou are a sensitive normal loving human being living in  and adapting to a dysfunctional society. Depression is a normal emotional response to this collapse in connection and open heartedness we're seeing.\n\nJust as you descended into depression, you CAN come back up and be without any long term negative feelings. The nature of things is change.\n\nI almost killed myself multiple times and now have not experienced negative emotions lasting longer than a day in over a year.\n\nGo deep within, and heal the wounds you have been holding onto. Only when we learn self love can we truly love others.\n\nWe need you and the wisdom you will gain by going through this ❤️",
      "created_utc": 1729273567.0,
      "score": 2
    },
    {
      "id": "lskh7rq",
      "body": "From your positive description of home, it sounds like a perception of judgement might be the thing getting you down outside. I spent a year hiding in my room, pissing in bottles to avoid running into my flatmate at the time. \n\nSo I know I can't really tell you anything that will make you feel like its ok to be outside. I'm bed rotting with my cat right now. I will say the thing that got me some relief was weird. A few years ago I had to wear a portable EEG for a week. So my head was wrapped up in bandages like a mummy, I had about twenty wires coming off my scalp and joining in a big cord that came that fed into a battery pack/monitoring device on my hip. I looked like a crazy man. My doctor had to give me a literal note to give the transport police so they wouldn't think I was carrying explosives. \n\nBUT it was liberating. I felt like I finally looked as crazy as I felt. Because I hadn't been scared of people judging me, I was scared of them judging me incorrectly - of them thinking I was normal and sane, having expectations of me that I couldn't possibly meet. Anyway my point is this: you have a cat that loves you. You can obviously string a sentence together. Even if in small meaningful ways, you can connect to others. You have a home and a sense of self. If that sense of self does not fall in line with what you think society expects of you. then so be it. You can still find things out there that make you happy. When it gets to much, just go home and enjoy yourself with the cat. That's not quiet quitting. That's living up to your own values.",
      "created_utc": 1729276871.0,
      "score": 1
    },
    {
      "id": "lslfg4j",
      "body": "Boy I can relate. My husband died and just this year my 36 yo son died. Then this past month my dog died and then 1 week later my cat died. I want to just give up, not even get out of bed. I have one son left and 2 beautiful grandaughters , and that’s the only thing that gets me up each day. But I know how people that are alone or lose significant people feel. So if you have family you love, appreciate them.",
      "created_utc": 1729288226.0,
      "score": 1
    },
    {
      "id": "lsnlw31",
      "body": "I can relate so much... holding the mask up is exhausting. Jim Carrey once said: depression tells you that you need a deep rest from the role you are playing. \nMaybe try to do so and don't go out for dinner. I know it's hard, but this is what I try recently, to say yes to myself. If I want to spent a week only with me than I try to allow it my self. Some people will not understand and don't want to understand and I think this is the hardest part. \nSending you a big hug, you are not alone with this 🩷",
      "created_utc": 1729324833.0,
      "score": 1
    },
    {
      "id": "lsokl65",
      "body": "I would recommend to go to doctor and seek for help😊",
      "created_utc": 1729344469.0,
      "score": 1
    },
    {
      "id": "lt41sdn",
      "body": "Sending a virtual hugs to anyone struggling and I hope you all overcome and have a blessed Day.",
      "created_utc": 1729564238.0,
      "score": 1
    },
    {
      "id": "ltfdayk",
      "body": "I can relate ",
      "created_utc": 1729726088.0,
      "score": 1
    },
    {
      "id": "ltzjhhb",
      "body": "i think this is what i’ve been doing too",
      "created_utc": 1730022985.0,
      "score": 1
    },
    {
      "id": "lwauytr",
      "body": "Exactly the same situation for years. I'm also at the same age, and almost accepting this will last forever.",
      "created_utc": 1731183362.0,
      "score": 1
    },
    {
      "id": "lx0eyl3",
      "body": "I may as well just drink at this point",
      "created_utc": 1731545200.0,
      "score": 1
    },
    {
      "id": "m06wonq",
      "body": "Wow, the thing I look forward to the most when I wake up is coming home and laying around. The day drags by but the night flies by. And repeat. The weekend is the only time my soul has any rest.",
      "created_utc": 1733229547.0,
      "score": 1
    },
    {
      "id": "m1n6pmd",
      "body": "I had to get rid of my cats. No one really understands. I don't bother trying to explain how nothing can even give me closure. The more I try to open up to people the more disappointed I become in myself for trying. ",
      "created_utc": 1733976949.0,
      "score": 1
    },
    {
      "id": "m9xlgdl",
      "body": "relatable dude",
      "created_utc": 1738200388.0,
      "score": 1
    },
    {
      "id": "mf9ciml",
      "body": "Wish I could get a dog or cat, would make this existence a little bit more bearable.",
      "created_utc": 1740754424.0,
      "score": 1
    },
    {
      "id": "mikf6tf",
      "body": "Powerful writing! :) I do wish in my experience people would understand the need for distancing and such.",
      "created_utc": 1742358925.0,
      "score": 1
    },
    {
      "id": "lshxehw",
      "body": "Are you sure you are just letting life go, and not demurely asking for help? As in, \"please recognize I'm less present and pull me back\" or something.\n\nBut it usually doesn't work. As you say, people do not realize. And even if they do, they have their own problems to solve and their own lives to live.",
      "created_utc": 1729240578.0,
      "score": 1
    },
    {
      "id": "lslsc0d",
      "body": "[removed]",
      "created_utc": 1729292978.0,
      "score": 0
    },
    {
      "id": "lsfeveh",
      "body": "Me, too. I hate to admit it, but it’s true.",
      "created_utc": 1729199886.0,
      "score": 86
    },
    {
      "id": "lsxusx1",
      "body": "Why cannot we be not depressed?\nBeing depressed and alone is horrible...\nI want to stop so bad.\nEveryone looks normal and happy.",
      "created_utc": 1729474816.0,
      "score": 1
    },
    {
      "id": "mikfd3p",
      "body": "For me my belief in God makes me feel far less alone lol",
      "created_utc": 1742359011.0,
      "score": 1
    },
    {
      "id": "lsls3do",
      "body": "[removed]",
      "created_utc": 1729292888.0,
      "score": -7
    },
    {
      "id": "lsh7a6z",
      "body": "https://www.elisplace.org/anhedonia-when-life-loses-its-colour/",
      "created_utc": 1729224528.0,
      "score": 4
    },
    {
      "id": "lsgn4jf",
      "body": "Depression ruins all of the things you mentioned. I can hardly bring myself to watch tv anymore",
      "created_utc": 1729216047.0,
      "score": 44
    },
    {
      "id": "lsiolil",
      "body": "How did you find a hobby you enjoy? I mean nothing brings me joy anymore",
      "created_utc": 1729255558.0,
      "score": 10
    },
    {
      "id": "lvl03q5",
      "body": "How do you feel now?",
      "created_utc": 1730838695.0,
      "score": 1
    },
    {
      "id": "lssuy5w",
      "body": "I was in exactly your spot a year and a half ago. I'm doing better now, and I hope you'll be doing better soon too. \n\n\nLean into the interests you had before your ex, or pick a hobby at random and try it. That's my unsolicited advice.",
      "created_utc": 1729401996.0,
      "score": 2
    },
    {
      "id": "ltcniis",
      "body": "I don't want to self love. Having to self love is literally a result of the collapse in connection you said in your first paragraph.\n\n\nAlso, what is it with people never being able to explain what self love is? Everyone says it's the most important thing of all fucking time, just as important as SELF help, SELF improvement, isolating self self self self self, but nobody can delineate a clear fucking process as to how one is supposed to SELF love.\n\n\nI'll just go jerk off. There's self love for you. I'm so tired of hearing this ambiguous mysterious unexplained advice. Next time someone says love yourself, I'm offing myself.",
      "created_utc": 1729695576.0,
      "score": 1
    },
    {
      "id": "lsjc7yn",
      "body": "I see what you mean. For me, no. I don’t wish for them to intervene.  I just wish that they didn’t think  it was so simple as me shirking my friendly duties. It’s so much more.  I just wish they understood, but if I talked with them, they would worry and I don’t want them to worry. I just hate that they think that.",
      "created_utc": 1729263863.0,
      "score": 3
    },
    {
      "id": "lsm9gvi",
      "body": "One-upping someone’s troubles doesn’t help anything/anyone.  Things could always be worse … so what?\nThat doesn’t invalidate someone else’s feelings. \n \nWhen someone is tired/stressed/depressed … whatever, the last thing they need is to feel guilty about it!\nI’ve never seen sufficient ‘reason’ for my periods of depression.  Invalidating my own feelings led to intense guilt and made things much worse.  Depression / feelings / wanting-to-be-alone… whatever.  It happens.   No one should invalidate your feelings, and don’t do it to yourself.",
      "created_utc": 1729299667.0,
      "score": 2
    },
    {
      "id": "mmy6sx5",
      "body": "Which God and have you felt their presence",
      "created_utc": 1744574503.0,
      "score": 1
    },
    {
      "id": "lsxojy5",
      "body": "This guy forgot what sub he was in",
      "created_utc": 1729472495.0,
      "score": 3
    },
    {
      "id": "lslsy0k",
      "body": "It did ruin movies and such for me too! But you gotta remember to keep your heart light and your mind will follow. Be gentle on yourself, I rotted in bed for weeks at a time, no motivation to even feed myself (I live alone) and at night binge eat and drink and smoke until I fell asleep and repeat next day. But I had to stop the cycle, because when I eventually did get around to writing my letters and getting my boxes to pack all my stuff to throw away, I realized I don’t want to die. Not really. I just needed the void to stop staring into my soul and leeching my happiness away. Small changes everyday, 5 minute walks at sunset, calling my little sister to just talk to someone instead of going days without speaking a word due to living alone. Every day for 2 weeks and god it sucked at first bc I just couldn’t get myself up but you have to be gentle with yourself. 2 months later, I’ve picked up gyming again and discovered my passion for dancing and somehow in those few weeks, i slowly started to feel like myself again.",
      "created_utc": 1729293209.0,
      "score": 3
    },
    {
      "id": "lsm4t2q",
      "body": "I’ve found, when I get to the point of losing interest in everything, I force myself to either (1) do first simple steps of something I’ve enjoyed in the past or (2) try something new even if it sounds trivial or stupid.  Some examples… when I’m not depressed I’ve enjoyed knitting.  So I get yarn and just knit the most simple thing… a scarf.  The act of making something, the motions of, can sometimes trigger a slight interest.  Or feeling of accomplishment.\nFor trying new things, some ideas I’ve tried\n- paint by number (they make adult ones, inexpensive on Amazon)\n- zendoodles.  It’s just doodling, but looks nice.  \n- I bought a book on making paper airplanes\n- small kits on Amazon, such as miniature dollhouses.  \n- adult coloring books and gel pens\n\nAlso I’ve found developing my own “inner cheerleader” helps.  So when I accomplish even a small thing, I let that inner cheerleader talk to me like I’m 5 years old and have done something amazing",
      "created_utc": 1729297804.0,
      "score": 3
    },
    {
      "id": "lstkz7p",
      "body": "Thank you for reaching out. I really really hope I'll be in a better place in that time frame as well. I'm trying to find a hobby or something, but it's hard right now to enjoy most things. It seems like something always seems to go wrong and it keeps knocking me down a bit.",
      "created_utc": 1729419390.0,
      "score": 1
    },
    {
      "id": "lsjf2x6",
      "body": "If you are getting away from them and don't wish any interaction, why do you care what they think?\n\nWhy is it important for you that they understand? I mean, most of 8 billion people on our planet do not understand you.",
      "created_utc": 1729264782.0,
      "score": 1
    },
    {
      "id": "lsybczy",
      "body": "[removed]",
      "created_utc": 1729481243.0,
      "score": -5
    },
    {
      "id": "lsnmzx1",
      "body": "Thank you, that really helps me to get started 😊",
      "created_utc": 1729325617.0,
      "score": 2
    },
    {
      "id": "lsjgia7",
      "body": "Well, because they are my friends and my family.  I care for them deeply and I do not wish to cut them out of my life. They are all very good people.  I just don’t have the energy or motivation to uphold all the social obligations that are expected of me any more. Perhaps we can talk and they can understand where I’m coming from, but certainly don’t want them to think negative things that just aren’t true about me.  I may not want to be involved in the outside world any longer, but I don’t wish to taint the past thirty years of my life by burning bridges.",
      "created_utc": 1729265236.0,
      "score": 1
    },
    {
      "id": "lw9pfwq",
      "body": "You talk like someone who is completely clueless about what depression feels like",
      "created_utc": 1731170023.0,
      "score": 2
    },
    {
      "id": "lsm7iso",
      "body": "It’s good that you have people you care about so much.  I’ve been there, for an extended period, but came out of it after about 4 years.\nI think it’s worth the effort to try to explain, briefly, what is going on.  For their sake (so they don’t think they’ve done something wrong), your current self (since you care what they think), and your future self in case you find energy to want to re-engage with others.\nI basically said “sorry for my silence/disappearance.  It’s nothing personal.  I’m going through something, feeling incredibly overdone and currently taking care of myself involves a lot of solitude.  Thanks for understanding.  Please don’t take my behavior as a sign of not caring”\n\nYears later some family members helped me find help to understand what was going on that I needed SO MUCH solitude, that I was isolating.  I was able to regain some of the friendships.  I don’t think anyone ‘held it against me’ (that I kind of disappeared) but we still grew apart.  But the initial explanation helped me get back in touch.  At least I’d said ‘something’ to try to make it seem I wasn’t just being selfish and rude.",
      "created_utc": 1729298882.0,
      "score": 1
    }
  ]
}