{
  "id": "1giyaev",
  "title": "im gonna kill myself in 30 minutes.",
  "selftext": "\n\njust as it states. im currently on my flat's rooftop, with pills in my hand. getting ready to say my goodbyes. i dont know why im writing this. maybe deep down i would like to be saved by someone. \n\nsorry\n\nupdate: thank you all for your kind comments. i'm safe now. my dad has found me and stopped me in time. tomorrow im going to the hospital to get checked.\n\nupdate 2: im on meds now and on intense therapy. im going to try my best to fight back with the little energy i have left. so sorry i wasn't able to reply to all of you. you've all been so kind to me. i wish all of you truly the best in life 🫶",
  "created_utc": 1730670702.0,
  "score": 1039,
  "num_comments": 281,
  "url": "https://www.reddit.com/r/depression/comments/1giyaev/im_gonna_kill_myself_in_30_minutes/",
  "comments": [
    {
      "id": "lv95nfl",
      "body": "[removed]",
      "created_utc": 1730672809.0,
      "score": 574
    },
    {
      "id": "lv90pit",
      "body": "Please don't do it. Just so you know, overdoses rarely work and can cause extreme pain and not be lethal, so please don't try to do that. If deep down you wish to be saved, then there is something within you that has hope and doesn't want to die. Depression is making you feel this way - that you need to end your life, but it's not the real you. It's a monster that destroys people and don't let it win. I care about you and I'd like to believe people here and people in your life do too. Please don't let depression win.",
      "created_utc": 1730671251.0,
      "score": 210
    },
    {
      "id": "lv9gz6a",
      "body": "Hey you. Don't do that. I got a better offer for you.\n\nGet up off the roof.  Get your foot out the grave.\n\nNow walk away. Walk away from everything.  If you wanna pack a bag, ok. If not, ok too.\n\nTake off walking.  Hit the road Jack.\n\nToss your ID away,  pick a new name and set off on an adventure. \n\nWhat do you have to lose? In the other scenario you are dead. It may seem scary and risky but so is the alternative.  \n\nHitch hike, meet new people, go from one town to another.  If you're on the west head east,  if youre on east then go west.\n\nThere's plenty of land to travel so don't stay too long in one place. Meet the locals, get a cash job, bartender,  server, construction,  harvest crops, fisher, boat hand, whatever. There's plenty of ways to make the cash you need to get by.\n\nYou can start without money, without anything,  just go.\n\nSee the sites. You have absolutely nothing to lose. You're dead anyways. So it doesn't matter.\n\nLive life on the fringe. Most important,  live life. I promise death will arrive for you on time when it's supposed.  Like for all of us.\n\nOk, I hope you seen this. I hope you see it as a better but equal alternative.  You still disappear from your life that you have now. The old you is dead but the new you, whoever that is, you pick, is hitting the road. \n\nWhen you hit Texas, hit me up, we'll get a drink and you can tell me how it's going. \n\nOk my friend,  that's my advice.  I pray you get moving and let a new beginning start right now.\n❤️",
      "created_utc": 1730676408.0,
      "score": 163
    },
    {
      "id": "lv957r1",
      "body": "I hope you’re still here.",
      "created_utc": 1730672674.0,
      "score": 27
    },
    {
      "id": "lv91bvc",
      "body": "Nobody is coming to save you. I wanted the Same. The only Person who can save you is you. And you can do it !!!",
      "created_utc": 1730671449.0,
      "score": 122
    },
    {
      "id": "lv929nq",
      "body": "I think it would be a relief to go to a ward somewhere to take a break for a while and let someone take care of you. You need some solid care and attention right now.",
      "created_utc": 1730671752.0,
      "score": 27
    },
    {
      "id": "lv9bci9",
      "body": "hey Ria, I'm sorry but I checked your profile and I wanted to tell you that, you are getting better. Just hang on, you got this. You are a very strong person, and you are your father's strength! You are loved and you are more than your past, more than your traumas, you are you! Beautiful and brave!",
      "created_utc": 1730674600.0,
      "score": 24
    },
    {
      "id": "lv911gf",
      "body": "[deleted]",
      "created_utc": 1730671357.0,
      "score": 43
    },
    {
      "id": "lv94520",
      "body": "I am thinking the same just to end it, laying down on my stomach on my flats floor crying while writing, with a strong feel of sorrow and sadness that I can’t handle. The only thing stopping me is the hope for a better day. Hope is strong, whatever your are going through you are not alone please share it with others it will make your burden a bit lighter. Have hope better days are coming",
      "created_utc": 1730672351.0,
      "score": 19
    },
    {
      "id": "lv9b4vp",
      "body": "She’s not replying to me anymore. 😔",
      "created_utc": 1730674533.0,
      "score": 9
    },
    {
      "id": "lv94v1p",
      "body": "Stay here, it sucks so bad, I know. But you're not alone. Please dont.",
      "created_utc": 1730672569.0,
      "score": 7
    },
    {
      "id": "lv97yo0",
      "body": "Check. Are you still there.",
      "created_utc": 1730673542.0,
      "score": 8
    },
    {
      "id": "lv9bihi",
      "body": "So many ppl care! Don’t let depression win!",
      "created_utc": 1730674652.0,
      "score": 6
    },
    {
      "id": "lv94cqu",
      "body": "Don’t. You have more purpose to live. I love you and so do we. We’re here to support",
      "created_utc": 1730672416.0,
      "score": 6
    },
    {
      "id": "lv95q5a",
      "body": "I really hope you didn't go through with it",
      "created_utc": 1730672834.0,
      "score": 4
    },
    {
      "id": "lv97re2",
      "body": "Please don't 🥺 I hope you still here with us I am praying for you",
      "created_utc": 1730673477.0,
      "score": 5
    },
    {
      "id": "lv998u7",
      "body": "Please still be here.",
      "created_utc": 1730673939.0,
      "score": 5
    },
    {
      "id": "lv911qy",
      "body": "And I know how close you are to the edge right now\nSo I wrote this song to say, things won't always be this way, no\nIt's just a bad day, not a bad life\n\n- bmth Bad life\n\nRead your other posts. Wear your Traumas like an armour so nobody can hurt you. Make something out of your life, proove all those fuckers wrong. \n\n\nYoure not alone my dear stranger and you are worth it!!!",
      "created_utc": 1730671359.0,
      "score": 9
    },
    {
      "id": "lv93uee",
      "body": "The pills might not work and could leave you worse off. Pull back till you have something you know won't leave you worse.. at least... I dunno.. just might not work and it's not worth it if it's going to make your life worse after trying it that way",
      "created_utc": 1730672260.0,
      "score": 5
    },
    {
      "id": "lv99re7",
      "body": "Honey, I know it's really hard, but you have to stick around. Do you want to talk? I struggle with suicidal thoughts A LOT because I'm in physical pain 24/7 & I always feel exhausted. It's pretty miserable and my psychiatrist says that I have treatment-resistant depression and anxiety.",
      "created_utc": 1730674102.0,
      "score": 4
    },
    {
      "id": "lv9amuk",
      "body": "[removed]",
      "created_utc": 1730674373.0,
      "score": 4
    },
    {
      "id": "lv9wb5g",
      "body": "Hallelujah. Praise the Lord",
      "created_utc": 1730681565.0,
      "score": 4
    },
    {
      "id": "lv916v9",
      "body": "I want you to know that I just prayed for you and I hope you stick around . I feel this way often .. I feel like I am only a burden to everyone .. but I keep going .. I have to … I didn’t make it this far to only make it this far !!! I truly believe you’re here for a reason . I love you fellow human !!",
      "created_utc": 1730671404.0,
      "score": 8
    },
    {
      "id": "lv92vjh",
      "body": "The only person that can save you now is yourself, maybe no one cares to do it, but you can still care about yourself and take the decision not to go through with it.",
      "created_utc": 1730671948.0,
      "score": 7
    },
    {
      "id": "lv94iwf",
      "body": "[deleted]",
      "created_utc": 1730672466.0,
      "score": 6
    },
    {
      "id": "lv95lcq",
      "body": "You deserve to be saved.  You can stay, fight through this life and be happy someday, It is possible!  Don’t give up yet.",
      "created_utc": 1730672791.0,
      "score": 3
    },
    {
      "id": "lv95udf",
      "body": "I'm sure it seems like there are NO reasons to stay. But there are reasons you may not even know about yet. You can't predict the future, you can't predict who will come into your life, how you will feel tomorrow, etc. please stay. I know so many people in this subreddit would come to save you if we could.",
      "created_utc": 1730672871.0,
      "score": 3
    },
    {
      "id": "lv96xps",
      "body": "Are you okay my friend",
      "created_utc": 1730673219.0,
      "score": 3
    },
    {
      "id": "lv9a6b1",
      "body": "I hope you are still with us.  The world will be a much darker place without you.  Please stay.",
      "created_utc": 1730674230.0,
      "score": 3
    },
    {
      "id": "lv9bk4f",
      "body": "I really hope you’re still here. You are loved by those around you and I hope one day you can love yourself too",
      "created_utc": 1730674667.0,
      "score": 3
    },
    {
      "id": "lv9c0ps",
      "body": "Please let us know that you are still here",
      "created_utc": 1730674814.0,
      "score": 3
    },
    {
      "id": "lv9ujwe",
      "body": "This just saved me.",
      "created_utc": 1730680946.0,
      "score": 3
    },
    {
      "id": "lva2jk2",
      "body": "I was saddened when I read the title, but now I am SO happy to hear that you are still with us and getting help. I completely know what it's like to feel hopeless and I've been depressed for 11 years myself.  I'm really happy you didn't do it, you don't deserve to die!",
      "created_utc": 1730683822.0,
      "score": 3
    },
    {
      "id": "lvew54x",
      "body": "I’m glad you’re still here sweetheart.",
      "created_utc": 1730754549.0,
      "score": 3
    },
    {
      "id": "lv94z57",
      "body": "Hey sorry it wasn't the life you wanted, but that means there IS a life you want. And you can find it, someday. Please give it another chance.",
      "created_utc": 1730672603.0,
      "score": 6
    },
    {
      "id": "lv93qog",
      "body": "you have six minutes to change your mind",
      "created_utc": 1730672228.0,
      "score": 5
    },
    {
      "id": "lv96ldd",
      "body": "I don’t know if you’re gone or not, but whatever decision you make I’ll be there.",
      "created_utc": 1730673109.0,
      "score": 2
    },
    {
      "id": "lv98dly",
      "body": "No please don’t, please just talk to us here everyone is worried about you",
      "created_utc": 1730673675.0,
      "score": 2
    },
    {
      "id": "lv9a2dn",
      "body": "We all have to pass this test called life together, even if we all feel like we're failing. We're in this one big school, all of us depressed students, supporting one another, right here.",
      "created_utc": 1730674196.0,
      "score": 2
    },
    {
      "id": "lv9ecqa",
      "body": "I can only hope you've changed your mind. It's not an easy decision to make, and it's not easy to change your mind, either. You've not been writing any more, but I hope that means you've put down your phone, put down the pills, and are taking some time to just think. That's all you can do.\n\nYou're truly stronger than you think. I've been exactly where you were an hour ago, and more than anything this is what I've learned: we're *all* stronger than we think we are.\n\nPlease do let us know how you're doing when you can.",
      "created_utc": 1730675565.0,
      "score": 2
    },
    {
      "id": "lv9umn7",
      "body": "I hope you’re still with us. you belong here 💛",
      "created_utc": 1730680972.0,
      "score": 2
    },
    {
      "id": "lv9vg1l",
      "body": "yall read the update. OP I’m so glad you’re safe. I know it’s hard, but know the world needs you in it 💛",
      "created_utc": 1730681259.0,
      "score": 2
    },
    {
      "id": "lvarpaw",
      "body": "I was so sad when I read the title and saw it was posted 6h ago. I am so happy your okay. I hope things gets better. Keep going.",
      "created_utc": 1730693591.0,
      "score": 2
    },
    {
      "id": "lvbj04h",
      "body": "Glad to hear your dad found you, I already once found a post like this and the guy’s profile was deleted and that stuck with me.\n\nI hope you get the good side of life you deserve and need so you can find the strength to get better!\nI also hope that seeing complete strangers care for you will prove you that it’s still worth living!",
      "created_utc": 1730709744.0,
      "score": 2
    },
    {
      "id": "lvc2goy",
      "body": "Im glad youre safe OP, sending all the hope i can",
      "created_utc": 1730722005.0,
      "score": 2
    },
    {
      "id": "lvc3akv",
      "body": "I’m\nGlad you’re going to get help at the hospital. Please stay safe xx",
      "created_utc": 1730722409.0,
      "score": 2
    },
    {
      "id": "lvcnwag",
      "body": "You dont understand how relieved I was after reading the update. You deserve to stay and be saved ❤️You are not alone",
      "created_utc": 1730730477.0,
      "score": 2
    },
    {
      "id": "lvgqt0f",
      "body": "Glad you are still here <3",
      "created_utc": 1730776886.0,
      "score": 2
    },
    {
      "id": "lvuhstt",
      "body": "I saw this post today and I’m so happy to read the update. I hope you can get treatment and things feel different.",
      "created_utc": 1730953985.0,
      "score": 2
    },
    {
      "id": "m6dxs85",
      "body": "Rest soldier",
      "created_utc": 1736508636.0,
      "score": 2
    },
    {
      "id": "m7r5ooa",
      "body": "Please tell me you didn’t.",
      "created_utc": 1737175070.0,
      "score": 2
    },
    {
      "id": "lv93rg7",
      "body": "Ria please don't! I don't know you but I know you are wanted! As long as you are alive God loves you more than you can possibly imagine! You are loved, and you are needed, and we need you here!",
      "created_utc": 1730672235.0,
      "score": 7
    },
    {
      "id": "lv9njxn",
      "body": "[removed]",
      "created_utc": 1730678558.0,
      "score": 5
    },
    {
      "id": "lv93p1q",
      "body": "someone out there is waiting for you. so many things are waiting for you. one day you will look back on this moment and be so thankful you made it through. please give it a second chance :(",
      "created_utc": 1730672213.0,
      "score": 4
    },
    {
      "id": "lv979pq",
      "body": "No… I don’t believe it, I don’t want to believe I’m 8 minutes late to reach out to you. You are such a kind person, even if hurt, you deserve a better ending. Please change your mind, because I’ve been through your pain, pain is just an illusion, and life is better than this. Trust me.",
      "created_utc": 1730673323.0,
      "score": 2
    },
    {
      "id": "lv9jl08",
      "body": "thank god im really happy youre okay. <3",
      "created_utc": 1730677254.0,
      "score": 2
    },
    {
      "id": "lv96igo",
      "body": "is there no important work around you in your life that needs attended to? \n\ni found some and it has kept me busy for several years \n\nwhatever you decide, take it easy friend",
      "created_utc": 1730673084.0,
      "score": 1
    },
    {
      "id": "lv9cqsd",
      "body": "Don’t do it brother we love you",
      "created_utc": 1730675042.0,
      "score": 1
    },
    {
      "id": "lv9cqu3",
      "body": "I love you",
      "created_utc": 1730675043.0,
      "score": 1
    },
    {
      "id": "lv9cywj",
      "body": "Sweetheart, please don’t do it!  I have tried to commit suicide several times, and both times that I tried pills, not only did it not work, but it made me extremely sick.  Believe me, I understand exactly how you feel, but I promise that you will find something that gives you hope again.",
      "created_utc": 1730675116.0,
      "score": 1
    },
    {
      "id": "lv9dpcp",
      "body": "Are you still there?",
      "created_utc": 1730675356.0,
      "score": 1
    },
    {
      "id": "lv9edgo",
      "body": "I hope things get better for you OP, I really do",
      "created_utc": 1730675571.0,
      "score": 1
    },
    {
      "id": "lv9eud1",
      "body": "Is the person okay? :///",
      "created_utc": 1730675722.0,
      "score": 1
    },
    {
      "id": "lv9f94a",
      "body": "I really hope OP is still here!",
      "created_utc": 1730675853.0,
      "score": 1
    },
    {
      "id": "lv9g8fq",
      "body": "Shit!! That’s not ok I hope you really get the help and the support u need",
      "created_utc": 1730676171.0,
      "score": 1
    },
    {
      "id": "lv9gpvl",
      "body": "I'm so sorry you're going through this. I hope you find peace.",
      "created_utc": 1730676325.0,
      "score": 1
    },
    {
      "id": "lv9ig3y",
      "body": "Is this person ok? 😭",
      "created_utc": 1730676887.0,
      "score": 1
    },
    {
      "id": "lv9izgx",
      "body": "What do people take to stay asleep",
      "created_utc": 1730677058.0,
      "score": 1
    },
    {
      "id": "lv9j2ft",
      "body": "Are you still here ? :(",
      "created_utc": 1730677085.0,
      "score": 1
    },
    {
      "id": "lv9l2kq",
      "body": "You still there?",
      "created_utc": 1730677746.0,
      "score": 1
    },
    {
      "id": "lv9m5ny",
      "body": "Love from germany, glad you didn't do it.",
      "created_utc": 1730678107.0,
      "score": 1
    },
    {
      "id": "lv9mnl0",
      "body": "I really hope you’re still here ❤️❤️❤️❤️",
      "created_utc": 1730678269.0,
      "score": 1
    },
    {
      "id": "lv9p6mt",
      "body": "Hope you're still here. Good luck with getting some help.",
      "created_utc": 1730679113.0,
      "score": 1
    },
    {
      "id": "lv9w1zn",
      "body": "WHAT?!?!?1 IS OP OKAY",
      "created_utc": 1730681475.0,
      "score": 1
    },
    {
      "id": "lva5v5j",
      "body": "We live in a time of fast change. AI, Machine Learning, etc. one way or another will change life and society drastically in a short period of time. AI can't be swayed by lobbiests, etc. Chances are, after a short period of chaotic transition, life will become far better and more rewarding. Please stay and see what might be, and hopefully you will be thankful that you did.",
      "created_utc": 1730685030.0,
      "score": 1
    },
    {
      "id": "lva7a14",
      "body": "I'm so thankful you are safe. Praying for you and I hope things get better!! 🙏💙",
      "created_utc": 1730685544.0,
      "score": 1
    },
    {
      "id": "lvadotw",
      "body": "I read the update, and even though we’re probably just strangers in opposite sides of earth, I’m truly, deeply glad you’re safe.",
      "created_utc": 1730687889.0,
      "score": 1
    },
    {
      "id": "lvaeaji",
      "body": "I feel terrible I can here hours later, and mouthy if not of made it in time. I’m glad you’re ok, please understand it truly does get better with time. Speaking from experience. It’s not some bullshit people tell you, it really does.",
      "created_utc": 1730688116.0,
      "score": 1
    },
    {
      "id": "lvaeald",
      "body": "Glad you’re safe now. Hope life and your mindset regarding life changes so you can live in contentment.",
      "created_utc": 1730688116.0,
      "score": 1
    },
    {
      "id": "lvaiw5p",
      "body": "Praying for you",
      "created_utc": 1730689924.0,
      "score": 1
    },
    {
      "id": "lvaj74i",
      "body": "I understand how you feel. I'm glad you are safe",
      "created_utc": 1730690048.0,
      "score": 1
    },
    {
      "id": "lvajnh5",
      "body": "I didn’t see this until 5 hours after your first post. I am so glad to read your edit. \n\nI am a dad and I would give anything to be there for my child if they ever have a crisis like this.",
      "created_utc": 1730690230.0,
      "score": 1
    },
    {
      "id": "lvam8r6",
      "body": "I’m just now seeing this. I’m so glad you are still here. Please stay safe. You have so much worth, I really hope that you know that.",
      "created_utc": 1730691284.0,
      "score": 1
    },
    {
      "id": "lvamter",
      "body": "Only the dead have seen the end of war",
      "created_utc": 1730691517.0,
      "score": 1
    },
    {
      "id": "lvantwx",
      "body": "I'm so glad you're safe. You shouldn't let anyone or anything make you take the life that you fought so hard to get.",
      "created_utc": 1730691933.0,
      "score": 1
    },
    {
      "id": "lvao954",
      "body": "Good luck in the hospital. It can be a tough place to be in, besides being suicidal. Find something to preoccupy you and keep your spirits up like reading or drawing",
      "created_utc": 1730692110.0,
      "score": 1
    },
    {
      "id": "lvaoh3d",
      "body": "I am glad you are safe. I send you hugs.",
      "created_utc": 1730692203.0,
      "score": 1
    },
    {
      "id": "lvaq169",
      "body": "OP It’s good you are saved best wishes",
      "created_utc": 1730692864.0,
      "score": 1
    },
    {
      "id": "lvax3u4",
      "body": "don't do it a lot of people have worse predicament and are trying to survive.   think of the loved ones you will leave behind. They will be heartbroken.",
      "created_utc": 1730696184.0,
      "score": 1
    },
    {
      "id": "lvay5e2",
      "body": "IM SO GLAD YOURE STILL HERE!!!!! You are still here for a reason I promise!!!🩷",
      "created_utc": 1730696718.0,
      "score": 1
    },
    {
      "id": "lvb9hmr",
      "body": "Im glad your alive still. You have a life to live and you have a soul too, I don’t know if you believe in God but it’s all real and Jesus can heal that broken part of you. Try asking God into your life, just pour your heart out to him and ask Jesus into your life and I promise God will reveal himself to you and will never forsake you.",
      "created_utc": 1730703277.0,
      "score": 1
    },
    {
      "id": "lvbdttq",
      "body": "I was 16 in a psych ward once too, and trust me, once you're in you're just going to want to get out. You're gonna be okay. I'm 24, live with my boyfriend and have 2 cats. I didn't think I'd live this far. Had multiple failed attempts. I'm disabled. Obese. You name it. I have BPD, PTSD, and more, and I'm still here. You can do it too.",
      "created_utc": 1730706144.0,
      "score": 1
    },
    {
      "id": "lvbmrni",
      "body": "Can anyone tell me, how can I die without pain",
      "created_utc": 1730712432.0,
      "score": 1
    },
    {
      "id": "lvbsppm",
      "body": "So glad to see an update to this post🫶\n\nThings will get better, I promise you that. Seeking help is the first major step… You’re doing great!",
      "created_utc": 1730716456.0,
      "score": 1
    },
    {
      "id": "lvbu6cp",
      "body": "I am so fucking glad you are still here. Thank you so much to this community!! (When you’re doing a little bit better it might be worth checking out a recent post from a person that is now wheelchair bound after a failed attempt.) I hope you’re at the doc now or on the way soon. You’re gonna be OK. You did such a smart thing by reaching out!!! 💞",
      "created_utc": 1730717387.0,
      "score": 1
    },
    {
      "id": "lvbw9iz",
      "body": "Add a couple zeros to that 30 minutes and you may change your mind",
      "created_utc": 1730718665.0,
      "score": 1
    },
    {
      "id": "lvbz8sb",
      "body": "i hope you chose to stay.",
      "created_utc": 1730720352.0,
      "score": 1
    },
    {
      "id": "lvcazuu",
      "body": "Let's go for a smoke",
      "created_utc": 1730725781.0,
      "score": 1
    },
    {
      "id": "lvckr4a",
      "body": "Pills is a horrible way to go and usually ends up not working and it's painful af",
      "created_utc": 1730729405.0,
      "score": 1
    },
    {
      "id": "lvcxr45",
      "body": "I am just seeing this and I am so happy that you’re still here !!! Praying you have a clear path of what you need to do to help yourself or let others help! Huge hugs to you!! ❤️‍🩹❤️‍🩹",
      "created_utc": 1730733664.0,
      "score": 1
    },
    {
      "id": "lvcye85",
      "body": "I love everyone here 🫂",
      "created_utc": 1730733865.0,
      "score": 1
    },
    {
      "id": "lvdbwrs",
      "body": "Saw this after the update. OP, please know that this internet stranger is glad you are safe. I am sending you all my love and I hope there are better days ahead",
      "created_utc": 1730738050.0,
      "score": 1
    },
    {
      "id": "lve8svc",
      "body": "U good bro",
      "created_utc": 1730747663.0,
      "score": 1
    },
    {
      "id": "lvfbl2y",
      "body": "I'm glad you are safe.",
      "created_utc": 1730759300.0,
      "score": 1
    },
    {
      "id": "lvfq9a9",
      "body": "I’m so so so so glad you are going to the hospital with your dad tomorrow. Much love from Ireland my friend ❤️🇮🇪 Stay strong. Keep us posted, but at the same time would recommend a Social Media break. You made the right decision and strike me as a very very damn brave person.",
      "created_utc": 1730764132.0,
      "score": 1
    },
    {
      "id": "lvfxzon",
      "body": "Things always get better..don’t do it!",
      "created_utc": 1730766777.0,
      "score": 1
    },
    {
      "id": "lvgw96z",
      "body": "i hope you’re ok",
      "created_utc": 1730778906.0,
      "score": 1
    },
    {
      "id": "lvhpbys",
      "body": "I’m glad your dad was there. It gets better 😌\n-chick who was in your situation a year and a half ago",
      "created_utc": 1730793917.0,
      "score": 1
    },
    {
      "id": "lwc8dga",
      "body": "Hi. I hope you are doing well by the day. Can you post here about your update and what's the road in life you are taking now? Number 1 fan here 😇😁😅🤭",
      "created_utc": 1731200315.0,
      "score": 1
    },
    {
      "id": "lwdne0g",
      "body": "I actually cried reading this . I haven’t been in this forum much ,  but for some reason this is resonating with me . Whatever is bothering you , just say fuck it . Don’t ever late anyone or anything make you tap out . Fuck depression, fuck suicide , fuck all the negative. Be the best bad ass version of yourself you can be . I know I’m super late, but I’m glad you’re alive.",
      "created_utc": 1731222754.0,
      "score": 1
    },
    {
      "id": "mdo5ai5",
      "body": "Just came across this post and I cannot tell you how relived I am to see your updates. How are you doing now? Its great that you are getting therapy-I hope the best for you",
      "created_utc": 1739994027.0,
      "score": 1
    },
    {
      "id": "lv9cppl",
      "body": "Why should they stay alive?  Death is the ultimate escape.  Society doesn't care about individuals.  Why should they stay and keep suffering?  Why should they stay in pain and despair?  If mental health care was free, I could see a reason to keep trying, but the world doesn't care about this person, you, or me.",
      "created_utc": 1730675033.0,
      "score": -1
    },
    {
      "id": "lv94ckv",
      "body": "[deleted]",
      "created_utc": 1730672414.0,
      "score": -1
    },
    {
      "id": "lvapz18",
      "body": "I'm glad you're still with us, friend.",
      "created_utc": 1730692838.0,
      "score": 0
    },
    {
      "id": "lvarew9",
      "body": "Nobody is coming to save you. I wanted the Same. The only Person who can save you is you. And you can do it !!!",
      "created_utc": 1730693462.0,
      "score": 0
    },
    {
      "id": "lvbklvo",
      "body": "r/suicidewatch",
      "created_utc": 1730710891.0,
      "score": 0
    },
    {
      "id": "lv9fl34",
      "body": "Youre standing on a rooftop and youre choosing the long painful option? I mean dont do it and all that but i dont understand this lol",
      "created_utc": 1730675959.0,
      "score": -4
    },
    {
      "id": "lv9uoog",
      "body": "[removed]",
      "created_utc": 1730680992.0,
      "score": 11
    },
    {
      "id": "lvee5t1",
      "body": "I dont know what to do. I’ve started my letters, but i only feel like this or cut when i drink.",
      "created_utc": 1730749254.0,
      "score": 7
    },
    {
      "id": "lxf13sr",
      "body": "thank you so much for your kindness.im safe now.",
      "created_utc": 1731755837.0,
      "score": 2
    },
    {
      "id": "lva0v87",
      "body": "[deleted]",
      "created_utc": 1730683211.0,
      "score": -53
    },
    {
      "id": "lve2ng3",
      "body": "This is how I saved my life years ago. If you feel life's \"already done\" for you toss ot away! Kill that old life you had, not yourself, and start a new one! Absolute blank sheet of paper. Its hard as hell, but somehow... so worth it! Might as well if \"everything's lost\". I'm so happy I did.",
      "created_utc": 1730745857.0,
      "score": 24
    },
    {
      "id": "lvbiv94",
      "body": "Wow. You are 100% awesome.",
      "created_utc": 1730709648.0,
      "score": 12
    },
    {
      "id": "lvcbhhr",
      "body": "I love that in this sub we see stuff like this and not just generic advice",
      "created_utc": 1730725975.0,
      "score": 6
    },
    {
      "id": "lvbjr65",
      "body": "I’ve debated doing this so many times.",
      "created_utc": 1730710283.0,
      "score": 3
    },
    {
      "id": "lvcrgn6",
      "body": "That was worded so well!",
      "created_utc": 1730731662.0,
      "score": 2
    },
    {
      "id": "lvdg4bc",
      "body": "Thanks for the idea",
      "created_utc": 1730739302.0,
      "score": 2
    },
    {
      "id": "lvfdf2p",
      "body": "You are a very helpful human, thank you.",
      "created_utc": 1730759896.0,
      "score": 2
    },
    {
      "id": "lvfs4c3",
      "body": "Wow this was really beautiful",
      "created_utc": 1730764762.0,
      "score": 2
    },
    {
      "id": "lvh7ieh",
      "body": "[removed]",
      "created_utc": 1730783673.0,
      "score": 1
    },
    {
      "id": "lxf11mj",
      "body": "i would love to do that with my dad. 💕 thank you for your kind words.",
      "created_utc": 1731755805.0,
      "score": 1
    },
    {
      "id": "lxf15w2",
      "body": "im here !",
      "created_utc": 1731755871.0,
      "score": 3
    },
    {
      "id": "lv93tuo",
      "body": "Yes I agree! No one will save you my dear but you can! And we will be here when you come back.",
      "created_utc": 1730672255.0,
      "score": 18
    },
    {
      "id": "lxf14um",
      "body": "im safe now.",
      "created_utc": 1731755853.0,
      "score": 1
    },
    {
      "id": "lxf15g6",
      "body": "my dad saved me :)",
      "created_utc": 1731755864.0,
      "score": 1
    },
    {
      "id": "lxf173w",
      "body": "unfortunately i cant. but im on meds rn so thats good !! 💕🫶",
      "created_utc": 1731755894.0,
      "score": 2
    },
    {
      "id": "lxmbfw3",
      "body": "Yep so the bills can rack right up and put him in debt",
      "created_utc": 1731864300.0,
      "score": 1
    },
    {
      "id": "lxf18xz",
      "body": "rhank you so much for your sweetness!!! 🥹🥹 i cried while reading this i hope you have an amazing day",
      "created_utc": 1731755924.0,
      "score": 1
    },
    {
      "id": "lxf19ld",
      "body": "im safe now 💕",
      "created_utc": 1731755934.0,
      "score": 2
    },
    {
      "id": "lxf1b4q",
      "body": "i hope youre doing better. im safe now 🫶💕💕 thank you for ur kindness",
      "created_utc": 1731755957.0,
      "score": 2
    },
    {
      "id": "lvb1ddi",
      "body": "You got this. Don’t ever lose that hope. We need you here and we are in this together",
      "created_utc": 1730698450.0,
      "score": 2
    },
    {
      "id": "lv9vk4i",
      "body": "read the update on this post! they’re safe",
      "created_utc": 1730681299.0,
      "score": 10
    },
    {
      "id": "lvbc7e2",
      "body": "they",
      "created_utc": 1730705051.0,
      "score": 3
    },
    {
      "id": "lxf1e10",
      "body": "im safe now 💕",
      "created_utc": 1731756006.0,
      "score": 1
    },
    {
      "id": "lxf1efy",
      "body": "im here!",
      "created_utc": 1731756012.0,
      "score": 1
    },
    {
      "id": "lxf1fqq",
      "body": "i was saved by my dad. im gonna try to fight depression with help now. not alone anymore !",
      "created_utc": 1731756035.0,
      "score": 2
    },
    {
      "id": "lxf1im3",
      "body": "im safe now 🫶💕",
      "created_utc": 1731756081.0,
      "score": 2
    },
    {
      "id": "lxf1g50",
      "body": "im safe now.",
      "created_utc": 1731756042.0,
      "score": 2
    },
    {
      "id": "lxf1gkf",
      "body": "im safe now 💕🫶",
      "created_utc": 1731756049.0,
      "score": 1
    },
    {
      "id": "lxf1gza",
      "body": "im here 🫶",
      "created_utc": 1731756056.0,
      "score": 2
    },
    {
      "id": "lxf1hsp",
      "body": "im safe now 💕💕🫶🫶🫶",
      "created_utc": 1731756070.0,
      "score": 1
    },
    {
      "id": "lxf1kf4",
      "body": "i hope youre doing better. i wish you the best 🫶 im safe now thankfully",
      "created_utc": 1731756110.0,
      "score": 2
    },
    {
      "id": "lxf1j5x",
      "body": "im safe now 🫶🫶🫶",
      "created_utc": 1731756090.0,
      "score": 1
    },
    {
      "id": "lveqo5k",
      "body": "She’s in the hospital thankfully. Her dad found her and admitted her.",
      "created_utc": 1730752942.0,
      "score": 1
    },
    {
      "id": "lva435n",
      "body": "Couldn't agree more.",
      "created_utc": 1730684382.0,
      "score": 1
    },
    {
      "id": "lxf1za4",
      "body": "🫶",
      "created_utc": 1731756356.0,
      "score": 2
    },
    {
      "id": "lv96u5m",
      "body": "I've never thought of it like that. You're absolutely correct.",
      "created_utc": 1730673188.0,
      "score": 4
    },
    {
      "id": "lxf23wz",
      "body": "im safe now 💖🫶",
      "created_utc": 1731756431.0,
      "score": 3
    },
    {
      "id": "lxf22v4",
      "body": "💖🫶",
      "created_utc": 1731756413.0,
      "score": 2
    },
    {
      "id": "lxf22en",
      "body": "💖🫶",
      "created_utc": 1731756406.0,
      "score": 1
    },
    {
      "id": "lxf21vp",
      "body": "💖💖💖🫶🫶🫶 thank you for ur kindness",
      "created_utc": 1731756397.0,
      "score": 1
    },
    {
      "id": "lxf20pw",
      "body": "💖",
      "created_utc": 1731756380.0,
      "score": 2
    },
    {
      "id": "lxf208j",
      "body": "🥹🫶",
      "created_utc": 1731756373.0,
      "score": 2
    },
    {
      "id": "lxf1zrk",
      "body": "🫶💕",
      "created_utc": 1731756364.0,
      "score": 1
    },
    {
      "id": "m6dxvyd",
      "body": "Ah you life? Continue on your way, soldier.",
      "created_utc": 1736508694.0,
      "score": 2
    },
    {
      "id": "m8575uj",
      "body": "im safe thankfully",
      "created_utc": 1737371764.0,
      "score": 2
    },
    {
      "id": "lv9kuwy",
      "body": "omg god loves you is the shittiest excuse to tell to a suicidal person lmaoo",
      "created_utc": 1730677674.0,
      "score": 5
    },
    {
      "id": "lva87i2",
      "body": "[removed]",
      "created_utc": 1730685873.0,
      "score": 2
    },
    {
      "id": "lv9819k",
      "body": "Mi\\* car\\*, ti prego, non rubarti la vita in questo modo. Ti prometto che andrà tutto bene, possiamo parlare 💓",
      "created_utc": 1730673565.0,
      "score": 1
    },
    {
      "id": "lv9kvnl",
      "body": "[deleted]",
      "created_utc": 1730677681.0,
      "score": 2
    },
    {
      "id": "lxf1u4w",
      "body": "🫶",
      "created_utc": 1731756269.0,
      "score": 2
    },
    {
      "id": "lv9cowl",
      "body": "The importance of things is relative to each individual. The \"busy\" mindset has never worked for me personally but some sort of routine that I feel that helps keep me sane without stressing me out too much because some people can destroy their responsibilities if unable to cope with the burnout.\n\nOne thing that I feel that has helped me in doing \"important work\" is just helping out people and actively trying to make a difference in their lives in a way that I would of wanted friends or family to do with me. Even when they lash out at me, scare me with their behavior, or become hard to help, just letting them know that, regardless of whatever is happening in their lives, they can always reach out and I'll be available to talk about anything they want without judgment or hard feelings.",
      "created_utc": 1730675025.0,
      "score": 3
    },
    {
      "id": "lxf1orb",
      "body": "hey!! im on meds rn and on intense therapy. im going to try to fight depression since im not alone anymore. my father is supporting me and im going to try my best to hold on.",
      "created_utc": 1731756182.0,
      "score": 1
    },
    {
      "id": "lxf1ls0",
      "body": "🫶🫶",
      "created_utc": 1731756133.0,
      "score": 1
    },
    {
      "id": "lxf1tl1",
      "body": "Oh",
      "created_utc": 1731756260.0,
      "score": 1
    },
    {
      "id": "lv9enxl",
      "body": "Not helping.",
      "created_utc": 1730675664.0,
      "score": 0
    },
    {
      "id": "lv98rj6",
      "body": "[removed]",
      "created_utc": 1730673791.0,
      "score": 1
    },
    {
      "id": "lv9wnj4",
      "body": "[removed]",
      "created_utc": 1730681689.0,
      "score": 16
    },
    {
      "id": "lvek72s",
      "body": "Try seeking professional help please (worth a try)",
      "created_utc": 1730751034.0,
      "score": 7
    },
    {
      "id": "lvga2uo",
      "body": "How did you prevent becoming a homeless person? I mean if I go , I land on the streets",
      "created_utc": 1730771003.0,
      "score": 1
    },
    {
      "id": "lvzu3oz",
      "body": "That's the best thing ever said of me, thank you.",
      "created_utc": 1731025624.0,
      "score": 2
    },
    {
      "id": "lvvrv18",
      "body": "Thank you for saying this. I struggle with suicide. My mom died by suicide and my mother in law as well.  I hate that my children's grandmother's both died this way. \n\nIt's such a horrible fact for them. Like, name something unique about yourself,  and they can answer both my grandmas killed themselves.  My children were young when my mil died but teenagers when my mom died.\n\nAnd the absolute devastation that follows is just a nightmare.  I know many have experienced.\n\nI've come to the thought that I just wish they would have picked up and disappeared into a new life instead of what they did.\n\nJust go. Take off. There's risk but so what? They were their biggest risk. I think why can't we instead just leave it all behind and go.\n\nI can't be the only one whose come to this conclusion.  Like many, I struggle daily with the loses. I combed over every knock and cranny of my mother's house like a madman looking for clues of why? What didn't I see? If I'd known the last time I'd seen her was the last time, I'd grab ahold of her and never let go. Never!\n\nWouldn't life be better for everyone if my mom and mother law was somehow on a fishing boat in Alaska with new names and friends.\n\nSuper Tramp!",
      "created_utc": 1730980246.0,
      "score": 1
    },
    {
      "id": "lxfbl29",
      "body": "I'm super glad to hear from you. You've been on my mind. Here's to another day, my friend! ❤️",
      "created_utc": 1731761477.0,
      "score": 1
    },
    {
      "id": "ly6my0t",
      "body": "That is good. I wish you could! I wish I could! I know how much it sucks to not be able to take that needed break.",
      "created_utc": 1732154256.0,
      "score": 1
    },
    {
      "id": "ly6mu7k",
      "body": "👋 fuck off",
      "created_utc": 1732154220.0,
      "score": 1
    },
    {
      "id": "lv9vozz",
      "body": "Thank youuuu for replying to me. Good that she is safe already",
      "created_utc": 1730681347.0,
      "score": 3
    },
    {
      "id": "lxgzts1",
      "body": "Good to hear. Stay strong. You got this and I wish you nothing but the best!",
      "created_utc": 1731782782.0,
      "score": 1
    },
    {
      "id": "lxf6sb2",
      "body": "I'm glad. Stay strong.",
      "created_utc": 1731759045.0,
      "score": 1
    },
    {
      "id": "lxfxteg",
      "body": "I'm so happy to hear this!",
      "created_utc": 1731770423.0,
      "score": 1
    },
    {
      "id": "lxhnmxh",
      "body": "Well done We’re all so proud of you! ❤️❤️",
      "created_utc": 1731790511.0,
      "score": 1
    },
    {
      "id": "lv9s40q",
      "body": "I'm sorry, I'm not trying to be disrespectful. But in my own life, the most peaceful I have ever felt was when I realized how much that means. Far beyond any happiness I've ever felt before or since.",
      "created_utc": 1730680101.0,
      "score": 3
    },
    {
      "id": "lxf1ykx",
      "body": "i still appreciate them trying to help even if im not Christian :)",
      "created_utc": 1731756343.0,
      "score": 1
    },
    {
      "id": "lvaezat",
      "body": "[removed]",
      "created_utc": 1730688380.0,
      "score": 1
    },
    {
      "id": "lxf1vke",
      "body": "sto meglio ora. sono al sicuro. 💕💕💕🫶🫶",
      "created_utc": 1731756294.0,
      "score": 1
    },
    {
      "id": "lv9lbmr",
      "body": "look at the post, they made an update.",
      "created_utc": 1730677830.0,
      "score": 2
    },
    {
      "id": "lv9faad",
      "body": "I'm the only one being real, in here.  Every single person saying \"please stay\" will forget about this person by tomorrow or in a few days.  Life happens.  It's inevitable.  The truth hurts, sometimes.",
      "created_utc": 1730675863.0,
      "score": 6
    },
    {
      "id": "lv9905q",
      "body": "[deleted]",
      "created_utc": 1730673863.0,
      "score": 1
    },
    {
      "id": "lvhjcv6",
      "body": "You don't. You gotta be willing to talk yourself into having where to stay basically. Whether it's with your potential employer, picking a place where you know someone to start, or making friends/random company. It was the first for me. I started work for dirt cheap pay and explained my situation to my employer. They didn't offer me to stay with them but got on the phone and found me something on the 4th try. It's hard to ask. Even harder to get lucky. But it's also in a way revitalizing. You feel like a person again and you see that people CAN be people too. \n\nI've also in my car a lot like before getting the job. but I have a car. I also have a tent and I've considered that an option. You gotta pick a place that is near some sort of nature for that tho. In town/the city really isn't an option.",
      "created_utc": 1730790090.0,
      "score": 1
    },
    {
      "id": "lwbokd2",
      "body": "Thank you, your words have deeply touched me. You literally have the power to save lives. I can't imagine what you must be going through, but always remember that you're not alone. I wish you all the best. You make this hard world a bit better❤️",
      "created_utc": 1731193245.0,
      "score": 2
    },
    {
      "id": "lv9vvjc",
      "body": "I know. I was worried about them.",
      "created_utc": 1730681411.0,
      "score": 2
    },
    {
      "id": "lv9fst4",
      "body": "I disagree. Nobody's life is meaningless, because God has put everyone where they are for a purpose. We think life is meaningless is because we don't realize how His love means we are always wanted and the world's weight isn't for us anyways",
      "created_utc": 1730676030.0,
      "score": 1
    },
    {
      "id": "lwelos6",
      "body": "I love you!",
      "created_utc": 1731243963.0,
      "score": 1
    },
    {
      "id": "lv9w2t6",
      "body": "Yeah. Me too. I prayed for her and hoping she is okay and get the help she needed",
      "created_utc": 1730681483.0,
      "score": 2
    },
    {
      "id": "lv9js4r",
      "body": "Not everyone believes in your god.",
      "created_utc": 1730677319.0,
      "score": 3
    },
    {
      "id": "lv9lar9",
      "body": "Im projecting here, but God has put everyone where they are for a purpose. hmm.. I used to believe that, until I realised that meant he either put me in this fucked environment knowing I'm how much it hurts and how confusing it is ON PUPROSE, or he doesn't exist and it's random. Saying a suicidal persons suffering is for gods purpose is extremely harmful. Fuck that. I'm not signing up for that shit, fkn kill me quicker and tell me I'm supposed to be able to handle it cause I'm 'one of gods strongest soldiers'. \n\nSorry I'm obviously really hurt by religious trauma",
      "created_utc": 1730677822.0,
      "score": 2
    },
    {
      "id": "lv9sjn4",
      "body": "They don't have to. But I'm saying, He's the only real hope I've been able to rely on, and I want to share that with whoever needs it, even if they don't take it anywhere",
      "created_utc": 1730680249.0,
      "score": 1
    },
    {
      "id": "lv9t13v",
      "body": "No, that's okay. I don't mean to push any religion here. I know how harmful it can be. And I'm not trying to say that what they're going through is good either. I'm just saying that God doesn't want them to be suicidal, depressed, etc. anymore, He wants healing. And I only say this because he's done it in my own life from my own problems.",
      "created_utc": 1730680416.0,
      "score": 2
    },
    {
      "id": "lvcmh35",
      "body": "Fair enough.",
      "created_utc": 1730729998.0,
      "score": 1
    },
    {
      "id": "lv9v7iy",
      "body": "Preciate you sharing and helping ❤️",
      "created_utc": 1730681175.0,
      "score": 1
    },
    {
      "id": "lv9ya93",
      "body": "Ofc!",
      "created_utc": 1730682268.0,
      "score": 1
    }
  ]
}