{
  "id": "1dga2ht",
  "title": "A friend of mine once described depression as feeling desperately home sick but not knowing where home is",
  "selftext": "And felt like that is the most apt description I've ever heard of what it feels like do you agree?",
  "created_utc": 1718426577.0,
  "score": 1673,
  "num_comments": 100,
  "url": "https://www.reddit.com/r/depression/comments/1dga2ht/a_friend_of_mine_once_described_depression_as/",
  "comments": [
    {
      "id": "l8p3gib",
      "body": "Whenever I was younger and when I was at my lowest I always said “I want to go home.” And then as I got older, it’s continued… and I’ve realized, even if I’m home, this place is never home.",
      "created_utc": 1718436161.0,
      "score": 343
    },
    {
      "id": "l8phvv6",
      "body": "Sadly, for me 'home' isn't just a *place*, it's a *time*. A time that's long gone. When I was there (and then), I had recurring  nightmares about losing 'home'. With 'home' almost a generation in the past now, I've felt rootless and lost..when I let myself think about it. But, I tell myself, and least the nightmares stopped.",
      "created_utc": 1718447321.0,
      "score": 152
    },
    {
      "id": "l8pddte",
      "body": "I was working about 2.5 hours north of \"home\" and was having a hard time. Called a meeting with my boss to discuss quitting and moving back. His advice was \"go now while you still have somewhere to run to. Pretty soon you'll look around and realize this is home and you have nowhere to run.\" Shook me then and now, many years later, he's right.",
      "created_utc": 1718443708.0,
      "score": 87
    },
    {
      "id": "l8ou9al",
      "body": "I feel this to my core",
      "created_utc": 1718429791.0,
      "score": 208
    },
    {
      "id": "l8p8jgg",
      "body": "I just stepped in this sub to see if others feel like I've been feeling and you definitely described my feeling well. I feel like I'm not \"home\" wherever my thoughts or body go.",
      "created_utc": 1718439998.0,
      "score": 40
    },
    {
      "id": "l8p5e79",
      "body": "[removed]",
      "created_utc": 1718437595.0,
      "score": 102
    },
    {
      "id": "l8peymm",
      "body": "real. sometimes at home alone, I'll just blurt whatever thoughts aloud and it's stuff like \"I'm going to kms\", \"I dont want to do this anymore\" or \"I want to go home\", despite already being at home.",
      "created_utc": 1718444984.0,
      "score": 25
    },
    {
      "id": "l8pvfvv",
      "body": "Exactly what I feel all the time. Then, when I think about what ”home” would be ideally, the feeling quickly turns into ”Weltschmerz”. The realization that reality can never satisfy the expectations of the mind. A weariness of the world. Handy that there’s a German word for every complex emotion.",
      "created_utc": 1718455527.0,
      "score": 13
    },
    {
      "id": "l8pllhy",
      "body": "It's a very apt description. I'd also add to it \"plus an existential fear of that home not existing and, if it exists, to reach it and still be homesick\"",
      "created_utc": 1718449888.0,
      "score": 10
    },
    {
      "id": "l8pmqum",
      "body": "For me it's more of an emptiness; a kind of transcendence of the human experience where nothing seems to matter. There's no yearning, and I can't even conceive of something that would make it \"better\". The way you put it - a need for a lost or unknown home - doesn't mesh with me cause it implies a goal, a hope, a knowledge that a place or person or thing can make it right. And in depression, for me, there is none of that. I am well beyond hope, care, or belief that things can ever be ok.",
      "created_utc": 1718450605.0,
      "score": 9
    },
    {
      "id": "l8psog7",
      "body": "I’ve been feeling this in waves (not all the time) since I was a kid, and I don’t know why. I never thought to associate it with depression until today. Oddly enough, it has since disappeared once I started improving my mental health (a daily battle that’s not always won, but I’m celebrating the small victories too).",
      "created_utc": 1718454030.0,
      "score": 8
    },
    {
      "id": "l8pfrpg",
      "body": "this is deep",
      "created_utc": 1718445641.0,
      "score": 8
    },
    {
      "id": "l8pmgdm",
      "body": "I think I know where/what home is, it's just not available to me at this time (hasn't in years)",
      "created_utc": 1718450427.0,
      "score": 7
    },
    {
      "id": "l8q8cri",
      "body": "I sometimes find myself saying that out loud.   I never knew other people felt that way.",
      "created_utc": 1718461906.0,
      "score": 5
    },
    {
      "id": "l8po3oo",
      "body": "Ugh I am constantly saying \"I want to go home\" even when I'm already here. This is my home but it's not quite hitting what I need. Sigh.",
      "created_utc": 1718451417.0,
      "score": 17
    },
    {
      "id": "l8q3xy9",
      "body": "That's why the song Cathedrals by Jump Little Children breaks me everytime. \n'There is a feeling that you should just go home\nAnd spend a lifetime finding out just where that is'",
      "created_utc": 1718459846.0,
      "score": 4
    },
    {
      "id": "l8pmeo5",
      "body": "Wow what an amazing description. I feel this",
      "created_utc": 1718450401.0,
      "score": 3
    },
    {
      "id": "l8pqdit",
      "body": "Yeah I also have the feeling that even if im surrounded by people that genuinely love me .. I still feel nothing .. I don’t know how to fix this part of me ..",
      "created_utc": 1718452735.0,
      "score": 3
    },
    {
      "id": "l8s57bq",
      "body": "I’ve always called it “sleeping with vertigo”. I feel like I’m always falling, but when I get over a hump of my chronic depression and have a bout of clarity, I realize I wasn’t falling it was just vertigo. Until I’m back in the falling stage.",
      "created_utc": 1718489826.0,
      "score": 3
    },
    {
      "id": "l8owqdq",
      "body": "Soo they read the book Prozac Nation?",
      "created_utc": 1718431412.0,
      "score": 6
    },
    {
      "id": "l8pyy1j",
      "body": "I have a friend that describes it as walking on an ocean of happy that you can't baptize yourself in",
      "created_utc": 1718457332.0,
      "score": 2
    },
    {
      "id": "l8pzcrz",
      "body": "Yes, except I think I know what “home” is, at least for me.  That would be the void.  Non existence.",
      "created_utc": 1718457546.0,
      "score": 2
    },
    {
      "id": "l8r3hy5",
      "body": "Am I getting Deja vu or have I seen this exact post a year or two ago? \n\nAnyways, I think it’s a pretty good description, I feel like the last time I felt truly at home was childhood. But I think with time, things can improve and you can find a new sense of what feels like home. ",
      "created_utc": 1718474897.0,
      "score": 2
    },
    {
      "id": "l8sjpf3",
      "body": "I think it’s very apt. When I was living far away from where I grew up I interpreted the feeling literally and ended up moving back to my hometown. Not smart, it didn’t help and probably set me back.",
      "created_utc": 1718496118.0,
      "score": 2
    },
    {
      "id": "l98hlex",
      "body": "I‘m actually quite suprised how accurate and concise this description is.\n\nI have never heard this before. But…it‘s absolutely true and very well put. I, too, want to just go home, although I‘m pretty sure home doesn‘t exist. There once was a home. Tried creating one with my now ex-partner. It didn‘t work, and now she and I both are lost and homeless, it seems. Sadly, I fear, so is our little daughter. Or maybe, hopefully, she now has two homes…\n\nI hope you‘re doing okay, OP! Life can be magical, I think, even when you lost a home or can‘t find your way back.",
      "created_utc": 1718755232.0,
      "score": 2
    },
    {
      "id": "la8b7pq",
      "body": "i wanna go home",
      "created_utc": 1719334496.0,
      "score": 2
    },
    {
      "id": "l8q6oky",
      "body": "Very Accurate",
      "created_utc": 1718461139.0,
      "score": 1
    },
    {
      "id": "l8qa7d9",
      "body": "You just have to pick up yourself where you left him/her in the past.",
      "created_utc": 1718462739.0,
      "score": 1
    },
    {
      "id": "l8qc95h",
      "body": "Damn, that's a pretty good description.",
      "created_utc": 1718463643.0,
      "score": 1
    },
    {
      "id": "l8qdfes",
      "body": "Absolutely this.",
      "created_utc": 1718464163.0,
      "score": 1
    },
    {
      "id": "l8qwso9",
      "body": "That is a great description. \n\nI used to describe depression like at birth everyone else was given a user manual on life and how to live it, except for me and I was left having no idea how to function.",
      "created_utc": 1718472207.0,
      "score": 1
    },
    {
      "id": "l8r4g0w",
      "body": "I think this is Anxiety.",
      "created_utc": 1718475274.0,
      "score": 1
    },
    {
      "id": "l8r4oj4",
      "body": "So accurate. That just hit deep.",
      "created_utc": 1718475370.0,
      "score": 1
    },
    {
      "id": "l8rhkal",
      "body": "This is fucking good. I love it and hate it.",
      "created_utc": 1718480486.0,
      "score": 1
    },
    {
      "id": "l8rijqz",
      "body": "Its the feeling of being about to drown, exhausted and drained with the thoughts that it will be easier and then it will finally be over mixed with the feelings of anger, sadness and determination to not slip under the waves.",
      "created_utc": 1718480867.0,
      "score": 1
    },
    {
      "id": "l8ro3mu",
      "body": "Is home a person? I doubt I'll ever truly feel safe anywhere...",
      "created_utc": 1718483010.0,
      "score": 1
    },
    {
      "id": "l8rwmdf",
      "body": "I say this too",
      "created_utc": 1718486309.0,
      "score": 1
    },
    {
      "id": "l8saaxe",
      "body": "Oh wow I used to say this all the time as a kid…. I had a weird childhood",
      "created_utc": 1718492007.0,
      "score": 1
    },
    {
      "id": "l8sbtd0",
      "body": "I've been repeating this like a mantra lately, I have done since I was a kid.  \n\"I want to go home\" it never really goes away that feeling of never being home.",
      "created_utc": 1718492663.0,
      "score": 1
    },
    {
      "id": "l8sdm1w",
      "body": "Damn yeah that's a good one.",
      "created_utc": 1718493448.0,
      "score": 1
    },
    {
      "id": "l8sfk9f",
      "body": "This hits right on point. It’s the reason I can’t be comfortable in any relationship, social setting, city, dwelling, profession, for too long. I always feel like I should be somewhere else, doing something else, with someone else, and then maybe I will know where I’m supposed to be and it will finally feel good. I’m never home.",
      "created_utc": 1718494294.0,
      "score": 1
    },
    {
      "id": "l8skz94",
      "body": "The first time I felt this was 2 years ago. I was at my lowest point and cried so hard with my mother beside me. I was saying some of the most depressing shit, but it was true to me. It was so depressing, my mom cried so hard she had to leave the room. While she was still sitting with me, I almost blurted out the words “I want to go home.” I startled myself because, as I looked around me, I thought, “I thought I already was at home.” \n\nThat feeling, of being so afraid of death and existence and life and the inevitable, is so depressing. You can’t escape it anywhere. Not even in the place you’re supposed to call home. And that’s really scary to me.",
      "created_utc": 1718496689.0,
      "score": 1
    },
    {
      "id": "l8snu9q",
      "body": "I always think of depression as cancer of the soul",
      "created_utc": 1718497971.0,
      "score": 1
    },
    {
      "id": "l8suc6e",
      "body": "This resonates with me so much. I had to take a pause when I read this title. \n\nIt reminds me of a line from Beef:\n\n\"I think when nowhere feels like home, you just retreat into yourself\"\n \nI let out a soft fuuuuckkkkkkkkkk during that scene",
      "created_utc": 1718500946.0,
      "score": 1
    },
    {
      "id": "l8t3euf",
      "body": "When the world (usually work) gets too much to handle, I feel and often say, \"I just want to go home.\" \nBut when I get \"home, \" the depression kicks in. This realisation that home isn't where I want to be exacerbates the feeling of loneliness. So I leave again or \"move on,\" and the cycle continues. Constantly oscillating between a not-home and a home that isn't homely. It's exausting, depressing, confusing, frustrating, and sad to feel I don't really have a home.",
      "created_utc": 1718505136.0,
      "score": 1
    },
    {
      "id": "l8taml7",
      "body": "I’ve never related *so hard* in my life! This. This right here.",
      "created_utc": 1718508621.0,
      "score": 1
    },
    {
      "id": "l8tapnr",
      "body": "Sometimes. Sometimes it's more like just kind of feeling nothing at all for weeks at a time",
      "created_utc": 1718508663.0,
      "score": 1
    },
    {
      "id": "l8ulrht",
      "body": "Absolutely spot on perfect.\n\nThis homesickness takes on a whole new meaning when you're spiritual...",
      "created_utc": 1718539565.0,
      "score": 1
    },
    {
      "id": "l8vo4nz",
      "body": "That is the way I often feel when depressed.",
      "created_utc": 1718555931.0,
      "score": 1
    },
    {
      "id": "l92jd7o",
      "body": "I've used a similar description before:  being homesick for a place that doesn't exist.  And in my case, and doubtless lots of others, has never existed.",
      "created_utc": 1718663612.0,
      "score": 1
    },
    {
      "id": "l976azg",
      "body": "'Home' is another word for SAFE. and for those of us who want to go home but never had a good one. We just need to create safety in us and around us",
      "created_utc": 1718738252.0,
      "score": 1
    },
    {
      "id": "l9pvr8u",
      "body": "that is the most accurate description I've ever heard. I'm 36m and I find myself thinking that the only thing I have to offer my family is too remove myself from this existence and let them lead there lives and do better for my not being alive. no job, no hope, no savings, no anything. at least if i was dead my wife could find a better man than me as I have failed her and the kids.",
      "created_utc": 1719028871.0,
      "score": 1
    },
    {
      "id": "l9qptyh",
      "body": "Well, my mom always said it is because we all have a home that we left and came here to be human and experience humanness, so when we are here, we long to go back to that home. However, apparently we are here for a reason, and it will be a struggle and we will suffer, for some reason most of us don't throw in the towel which leads one to ponder if that is because we do subconsciously know this because we have things we need to work on or learn. But, yep I have said in my head a number of times, I want to go home.",
      "created_utc": 1719048806.0,
      "score": 1
    },
    {
      "id": "ld83auq",
      "body": "This is captured by the Welsh word \"hiraeth.\"",
      "created_utc": 1721005650.0,
      "score": 1
    },
    {
      "id": "leyr91s",
      "body": "I feel it like having a desperate need of take off running, as if I was in danger, but no place is a safe zone.",
      "created_utc": 1721956433.0,
      "score": 1
    },
    {
      "id": "l8p9sqo",
      "body": "I know where home is, and I can't go back thanks to dirty commie bastards. I have been homesick for a long, long time.",
      "created_utc": 1718440968.0,
      "score": 1
    },
    {
      "id": "l8petv2",
      "body": "I remember all those sleepless nights laying in bead repeating the fraze \" I just want to go home\" over and over in my head",
      "created_utc": 1718444874.0,
      "score": 98
    },
    {
      "id": "l8t8slw",
      "body": "Thank you for sharing! I feel this exact way often and recently brought it up to my therapist (actually just at my last session). I thought I was the only one. I could be sitting on my couch in my home and think that all I want is to go home. I repeat it so often in my head and wonder where home even is if not here.",
      "created_utc": 1718507719.0,
      "score": 7
    },
    {
      "id": "lut1z9q",
      "body": "I realized the home I crave doesnt exist on this planet",
      "created_utc": 1730432512.0,
      "score": 2
    },
    {
      "id": "l8rwpos",
      "body": "I think that's true for a lot of people, depressed or not. People split up from their friend groups, the places they used to hang out become foreign. Hangouts get demolished, streets change. The places you knew and the people you knew them with are all gone with time, and you can never go back home, because it doesn't exist any more.\n\nIt's just part of life.",
      "created_utc": 1718486345.0,
      "score": 20
    },
    {
      "id": "l98xetr",
      "body": "hell yea! i thought my issue was nostalgia, but really it was traumatic loss",
      "created_utc": 1718761689.0,
      "score": 3
    },
    {
      "id": "l8povd7",
      "body": "So true!",
      "created_utc": 1718451869.0,
      "score": 12
    },
    {
      "id": "l8ovhb0",
      "body": "Me too",
      "created_utc": 1718430580.0,
      "score": 38
    },
    {
      "id": "l8su3ng",
      "body": "Fernweh",
      "created_utc": 1718500836.0,
      "score": 0
    },
    {
      "id": "l97736c",
      "body": "Awww! Please find your happiness!!!",
      "created_utc": 1718738504.0,
      "score": 3
    },
    {
      "id": "l8pv27p",
      "body": "Same. Its empty. There's no longing when Im truly depressed. For me its just a dark void, empty of any desire.",
      "created_utc": 1718455323.0,
      "score": 9
    },
    {
      "id": "l8q9f0y",
      "body": "This is true for me too. The homesickness thing does not really resonate with me, although it may have when I was younger.",
      "created_utc": 1718462386.0,
      "score": 3
    },
    {
      "id": "lba4rjg",
      "body": "This is just the next stage",
      "created_utc": 1719926883.0,
      "score": 1
    },
    {
      "id": "lbvfga2",
      "body": "I'm so proud of you! \nIf you would be so kind, could you share what helped you? Today I woke up from crying in my sleep and stumbled upon this sub",
      "created_utc": 1720259200.0,
      "score": 2
    },
    {
      "id": "l977pck",
      "body": "Start by feeling for yourself. You. Baby steps",
      "created_utc": 1718738705.0,
      "score": 1
    },
    {
      "id": "l8slabu",
      "body": "You only tumble when you grasp for the walls...when its falling anyway",
      "created_utc": 1718496825.0,
      "score": 2
    },
    {
      "id": "l8oxb1i",
      "body": "Wut dat\n\nWell technically he said \" ne deprision ist wie heimweh zu haben aber nich zu wissen wo Heim ist\"",
      "created_utc": 1718431801.0,
      "score": 10
    },
    {
      "id": "la8vd05",
      "body": "Me 2 😔",
      "created_utc": 1719341083.0,
      "score": 1
    },
    {
      "id": "l8qe0po",
      "body": "[deleted]",
      "created_utc": 1718464423.0,
      "score": 1
    },
    {
      "id": "l8tcz1c",
      "body": "I thought that until I got on this new anti depressant I no longer feel depressed but I also no longer ever feel happy or excited I never feel sad or anxious no more anger or rage everything is just numb I remember thinking I felt nothing before this medication but now I know what it's actually like to feel nothing now I feel ambivalent about everything and evry day is just a blure and I'm just a zombie/ spectator and I wonder is this really any better",
      "created_utc": 1718509816.0,
      "score": 1
    },
    {
      "id": "l8sll8i",
      "body": "R/FucktheCCP",
      "created_utc": 1718496961.0,
      "score": 1
    },
    {
      "id": "l8puyzm",
      "body": "[deleted]",
      "created_utc": 1718455276.0,
      "score": 1
    },
    {
      "id": "l8ti7ro",
      "body": "Phrase",
      "created_utc": 1718512655.0,
      "score": 1
    },
    {
      "id": "l976j35",
      "body": "It is a place of safety. In your mind. In your surroundings",
      "created_utc": 1718738325.0,
      "score": 3
    },
    {
      "id": "l8txsfk",
      "body": "It is a part of life. But when you’re unable to feel equal safety and comfort of that time or place ever again, it spirals deeply into depression. At least thats how it has happened for me. I was safe and comfortable up to a point, 15 years ago, and have never been able to reclaim that.",
      "created_utc": 1718522749.0,
      "score": 9
    },
    {
      "id": "l8stx71",
      "body": "Damn brother",
      "created_utc": 1718500752.0,
      "score": 7
    },
    {
      "id": "l8rjfp4",
      "body": "It's a book. The author described depression and that's exactly what she says.",
      "created_utc": 1718481208.0,
      "score": 4
    },
    {
      "id": "l8qn45w",
      "body": "I didn't mean for it to sound easy but I do think its about going back to a moment (or more moments) where you left a part of yourself in a traumatic or bad situation.",
      "created_utc": 1718468307.0,
      "score": 2
    },
    {
      "id": "l8qcgph",
      "body": "No? I am from Hong Kong.",
      "created_utc": 1718463737.0,
      "score": 3
    },
    {
      "id": "l8qv3zp",
      "body": "Sry I I'm very tired and misread your comment as \" you just need to get over her/him \" and I thought you were doing the ( depressed people are just sad and need to go to the gym spiel)",
      "created_utc": 1718471535.0,
      "score": 1
    },
    {
      "id": "l8qybgd",
      "body": "I am so sorry.",
      "created_utc": 1718472821.0,
      "score": 2
    },
    {
      "id": "l8tvwxq",
      "body": "No worries. I also typed my comment up too fast and it had little nuance so I understand.",
      "created_utc": 1718521422.0,
      "score": 1
    }
  ]
}