{
  "id": "1f96hl3",
  "title": "Therapist explained to me that normally people aren’t exhausted all day, they’re motivated, and don’t spend all night worried and dreading the next day",
  "selftext": "This has destroyed me. I’ve always thought maybe “severely depressed” like I’ve always been told on tests and stuff was extreme. Like, surely I’m at most moderately, maybe just a little depressed, like everyone is, right?\n\nBut what the fuck? People get out of bed excited for the day? I thought hobbies were just finding a way to pass the time with something atleast somewhat bearable. I can’t believe people enjoy stuff.\n\nLike, it sounds like people live their day to day life like I spend a night drunk.",
  "created_utc": 1725488686.0,
  "score": 1433,
  "num_comments": 156,
  "url": "https://www.reddit.com/r/depression/comments/1f96hl3/therapist_explained_to_me_that_normally_people/",
  "comments": [
    {
      "id": "lljjpg2",
      "body": "Sometimes I stew for HOURS on this. How are people not just constantly gutted by life?",
      "created_utc": 1725490622.0,
      "score": 574
    },
    {
      "id": "lljju8n",
      "body": "It always surprises me when I realize suicidal thoughts aren’t normal😭💀",
      "created_utc": 1725490671.0,
      "score": 429
    },
    {
      "id": "lljuqh5",
      "body": "This happened with me a few years ago when seeing a new doctor and I was way too honest.\n\nI said everyone thinks about killing themsleves and she looked at me like I had 2 heads. It was a really rude awakening.",
      "created_utc": 1725494689.0,
      "score": 186
    },
    {
      "id": "llkaj3v",
      "body": "My entire life I've always wondered why the hell did people actually wanted to do things. Motivation is a completely foreign concept to me. I'm convinced anybody who claims to enjoy life are either a liar or delusional. I've been killing time for 41 years so far...",
      "created_utc": 1725500669.0,
      "score": 178
    },
    {
      "id": "lljlz3d",
      "body": "This is unbelievable to me. I cannot imagine that.",
      "created_utc": 1725491452.0,
      "score": 81
    },
    {
      "id": "lljgfe7",
      "body": "Fr this is a thought that astonishes me lmao",
      "created_utc": 1725489433.0,
      "score": 56
    },
    {
      "id": "lljp9cd",
      "body": "In a perfect world the therapist is correct. Real world sees a big amount of difference in that statement.",
      "created_utc": 1725492657.0,
      "score": 44
    },
    {
      "id": "llkm3xl",
      "body": "I can’t grasp that at all. \n\nI always felt like we humans are too smart and aware of the world and therefore mostly depressed. Some fail to brush away that feeling, while some are successfully gaslighting themselves to be optimistic so they can get by.\n\nBut I think my brain is just broken afterall :/",
      "created_utc": 1725505245.0,
      "score": 70
    },
    {
      "id": "llkismm",
      "body": "I just try to get by day by day.it sucks. Nothing enjoyable except my bed",
      "created_utc": 1725503889.0,
      "score": 31
    },
    {
      "id": "llkcqc5",
      "body": "Those people that wake up \"happy\" either have their shit together, or financially well off its hard to be happy now unless a drink or a blunt is involved.",
      "created_utc": 1725501508.0,
      "score": 23
    },
    {
      "id": "lllfyjc",
      "body": " I told a therapist once that knowing every day is one day closer to my inevitable end was comforting to me. The therapist said that it wasn’t normal. Most people are motivated to make the most of their time alive. I’m literally just motivated to get to the end. \n\nWhen I realized I could count on death, it was such a moment of relief. I really thought I figured out the secret to happiness. I was humbled by the therapist and any other non severely depressed person I confided in. I honestly can’t imagine not feeling completely burdened by being alive.",
      "created_utc": 1725521398.0,
      "score": 23
    },
    {
      "id": "lljrf3k",
      "body": "It doesn't have to be waking up with happiness, but you can certainly find appreciation for the simple things in your life.\n\nI like driving to work. I listen to music and sing. I enjoy my lunch break at work because I go outside and read a book, hopefully in the sun. My evenings are good because it's my personal time, usually with music and singing and dancing when I cook. I do short walks outside of work too, and I try to focus on appreciating the nature that is around me when I do so. \n\nHonestly, that sums up my life for the most part. When people ask me what I've been up to I usually struggle to answer, unlike normal people. I find these simple things in my routine incredibly satisfying, and it's weird to think I'm expected to be going out, spending money, taking trips, meeting new people. *That* would be exhausting. \n\nI guess what I'm getting at is that you can have good things in your life which make you happy, and they can be the most simple, most mundane things.",
      "created_utc": 1725493454.0,
      "score": 51
    },
    {
      "id": "llknwpv",
      "body": "This hits deep. I want so bad to be happy, to Want to enjoy my days. To live q little, without dreading every day. Dreading all the things that I don't know, that might come to pass. Dreading all the responsibilities that weigh so heavily until I finally fulfill them and I'm exhausted. Anyway. Feel you. The good thing is that now you know.",
      "created_utc": 1725506010.0,
      "score": 14
    },
    {
      "id": "lljujyh",
      "body": "As someone who lives with depression and also sometimes does this, I can confirm. Your therapist was telling the truth. This exists and isn't a unicorn 🦄. And I used to be much more in your mindset too.",
      "created_utc": 1725494620.0,
      "score": 15
    },
    {
      "id": "llm71z6",
      "body": "I have anhedonia and ADHD. When I learned that regular people get a sense of accomplishment from chores it blew my mind.",
      "created_utc": 1725537822.0,
      "score": 12
    },
    {
      "id": "llk2h8m",
      "body": "I was this way until I found the right job. I know it’s not for everyone but I actually look forward to the day, even if I’m tired. I get work done, although my depression is helped with medication",
      "created_utc": 1725497583.0,
      "score": 12
    },
    {
      "id": "lln32kj",
      "body": "I’m so depressed I can’t even write down my thoughts.",
      "created_utc": 1725549590.0,
      "score": 12
    },
    {
      "id": "llk1lm0",
      "body": "I still think my therapist was lying to me when I was told the same thing.",
      "created_utc": 1725497260.0,
      "score": 9
    },
    {
      "id": "lljl5l2",
      "body": "Have you gotten your thyroid checked? Extreme mood changes ESPECIALLY depression that just lingers on and on even with medicine like SSRI antidepressants can be thyroid related and not seratonin related. You'd be surprised what that little butterfly shaped organ can do to the body. And for the body. It's crazy.",
      "created_utc": 1725491151.0,
      "score": 19
    },
    {
      "id": "llledbf",
      "body": "fr I feel like I’m in a constant burnout that nothing can fix but I just keep going.",
      "created_utc": 1725520297.0,
      "score": 7
    },
    {
      "id": "llkv4bh",
      "body": "Ughhh can’t remember the last time I woke up excited. Probably before COVID",
      "created_utc": 1725509298.0,
      "score": 6
    },
    {
      "id": "lllajyo",
      "body": "I was talking with some friends, and apparently it's not normal to have a suicide plan, much less multiples of them? I was confused by that. I'm still confused.",
      "created_utc": 1725517938.0,
      "score": 7
    },
    {
      "id": "lllfktq",
      "body": "I was exactly like this for years before antidepressants. I finally got some energy and started to genuinely enjoying my life and looking forward to the next day. \n\n\nSeek help, depression is curable. Theres no reason to suffer like this.",
      "created_utc": 1725521128.0,
      "score": 7
    },
    {
      "id": "llku7lc",
      "body": "Adulting is exhausting!  Out of 100% less than 10% I have met are motivated.  90% are just trying to make it through this thing called life.",
      "created_utc": 1725508861.0,
      "score": 4
    },
    {
      "id": "llluyi2",
      "body": "I look around and think how depression isn't the norm sometimes. Most jobs are soul crushing, pay crap and barely leave you with enough free time to enjoy or even hope to better yourself",
      "created_utc": 1725531669.0,
      "score": 4
    },
    {
      "id": "lll4w9s",
      "body": "I’m struggling with having zero energy and definitely passive thoughts. It is weird when you are going thru it to know it’s not common or normal or whatever .",
      "created_utc": 1725514513.0,
      "score": 4
    },
    {
      "id": "llneg8a",
      "body": "How old is the therapist? Anyone over 30 isn’t gonna understand how the general population is feeling. Also therapist are well paid, well adjusted individuals, a lot of them very easily let that kind of bias affect the advice they give out.",
      "created_utc": 1725553214.0,
      "score": 5
    },
    {
      "id": "llo57s6",
      "body": "wait thats so unfair why am i so fucked who wants my brain its very clever but dark and depressing makes you wannna off yourself every day .Someties it attempst",
      "created_utc": 1725561654.0,
      "score": 4
    },
    {
      "id": "llo8nnt",
      "body": "I literally could have written this post in terms of how I feel everyday. Exhausted, empty, bored, worried, fearful and dreading the next day.",
      "created_utc": 1725562749.0,
      "score": 4
    },
    {
      "id": "llk81gq",
      "body": "well you could have fooled me.",
      "created_utc": 1725499702.0,
      "score": 3
    },
    {
      "id": "lll23hn",
      "body": "I do this too.",
      "created_utc": 1725512920.0,
      "score": 3
    },
    {
      "id": "llla88b",
      "body": "Eh I don’t really believe that. ‘Normal’ is not ‘happy’. I think a lot of people are struggling a lot more than anyone realises.",
      "created_utc": 1725517780.0,
      "score": 3
    },
    {
      "id": "lln0jjg",
      "body": "I think that your therapist is mistaken. The state of the world today is depressing and bothersome for any so-called normal person. The amount of people being medicated in the world for depression and anxiety is astonishing. I feel like your therapist could have tried to explain this in a better way to you. A lot of people struggle and while there are many people that can easily hop out of bed and start their day, there’s just as many that struggle in varying degrees. Then there are others that probably just cope better than people like you and I. But I understand your point. I yearn to be one of those people that don’t dread the day.",
      "created_utc": 1725548768.0,
      "score": 3
    },
    {
      "id": "llnc3e7",
      "body": "I have always considered depression to be the only rational response to the highly irrational and exhausting circumstances of human existence, and have often wondered why this sentiment isn’t echoed back at me more often. Not that I’m overly vocal about it but when pressed I’ll present my views on the matter, speaking from experience. Anyway, I suspect the culprit to be cognitive dissonance, or a flat out refusal to peek beyond the surface of things. However. I consider life trauma, but not everyone is impacted the same. For some, trauma leads to depression, some get lucky and remain mostly unscathed. But mostly though I feel like people just flat out refuse to look at the icky parts of themselves. Cheat themselves through life in a semi-permanent state of denial. Somehow this appears to work to an extent. I don’t know.",
      "created_utc": 1725552467.0,
      "score": 3
    },
    {
      "id": "llo61ji",
      "body": "But sorry doctor it's an impassable thing to do like riding a bike for the first time u don't know how to fit in that damn bike but also u know how to do but u don't know how to control,\nIt's easy to say stuff. So hard to do bro\nI can't wake up in the morning and tell myself I'm gonna be okay. When i know so well that I won't.\nTo be excited to live. It would cost a lot but idk maybe we should think about it in a diff way",
      "created_utc": 1725561917.0,
      "score": 3
    },
    {
      "id": "lloit30",
      "body": "Honestly though, isn’t it a good feeling? Having the issues you’re facing labeled and validated? It’s like, OK now you know that this is not how well functioning mind should be feeling which sounds like a negative, but what it means is that this is not who you actually are. This is an illness, the same way someone covered in chickenpox isn’t Supposed to be covered in itchy blemishes. now you know that you have something clinically significant going on, which means more importantly, that you will be able to identify a road to recovery",
      "created_utc": 1725565965.0,
      "score": 3
    },
    {
      "id": "lljzkcc",
      "body": "I feel like this information should be more common. Especially about the hobbies. ",
      "created_utc": 1725496501.0,
      "score": 2
    },
    {
      "id": "llldnpq",
      "body": "When you are focused on things without anxiety things move faster and you don't continually ruminate and adding layers to your anxiety.",
      "created_utc": 1725519816.0,
      "score": 2
    },
    {
      "id": "lln2ktd",
      "body": "Ok this has rocked my world a little bit too. People are actually excited to do stuff? Most days?!",
      "created_utc": 1725549430.0,
      "score": 2
    },
    {
      "id": "lln31ir",
      "body": "Relatable. I still find it hard to believe sometimes. And just like you I always assumed the tests are overexaggerating only to find out that they aren't. And I've been like this for about 9 years..",
      "created_utc": 1725549580.0,
      "score": 2
    },
    {
      "id": "lloo6cv",
      "body": "Being late diagnosed ADHD (leading to depressive disorder) the revelation that normal people don’t live their lives in a constant state of panic was mind blowing to me. \n\nI just want a break from experiencing a vague sense of dread less than 3 seconds after I open my eyes",
      "created_utc": 1725567630.0,
      "score": 2
    },
    {
      "id": "llraw04",
      "body": "I used I to feel that way. Then after a while everything just started to slow down. Motivation leaves first in my case, so I procrastinate constantly. Anxiety is a constant (does not go away even if medically addressed) at least in my case. Dreading doing literally anything but sitting or laying down came last. I hope there is no next step, because I don’t know if I can get by like this for much longer.",
      "created_utc": 1725604979.0,
      "score": 2
    },
    {
      "id": "lmndapp",
      "body": "I have ADHD and it's ruining my life.....can't get medication I can't live like this everyday",
      "created_utc": 1726081343.0,
      "score": 2
    },
    {
      "id": "llk4px7",
      "body": "That's so funny. I remember when I was like that. 😅😅😅",
      "created_utc": 1725498428.0,
      "score": 2
    },
    {
      "id": "llkjtg7",
      "body": "I think your therapist needs to be re-educated. I know lots of people that are tired/exhausted all day, week, month! I'm not depressed and I'm tired all the time. And another thing please find me someone that's motivated just because. That's a rare thing to hear in my circle of friends, family and coworkers.",
      "created_utc": 1725504305.0,
      "score": 3
    },
    {
      "id": "lllimm3",
      "body": "[deleted]",
      "created_utc": 1725523280.0,
      "score": 2
    },
    {
      "id": "llk0iu1",
      "body": "I'd like to think I'd know normal if I saw it.",
      "created_utc": 1725496861.0,
      "score": 1
    },
    {
      "id": "llk1scs",
      "body": "I know right.. I have to drink to enjoy stuff and even then I don’t, I’m constantly tired and unmotivated, it’s hard out here..",
      "created_utc": 1725497330.0,
      "score": 1
    },
    {
      "id": "lllxuwq",
      "body": "Even if I understand what they are saying I still can't comprehend 😭",
      "created_utc": 1725533339.0,
      "score": 1
    },
    {
      "id": "lllyv4m",
      "body": "My partner is the only person I know who isn't somewhat depressed",
      "created_utc": 1725533882.0,
      "score": 1
    },
    {
      "id": "llo0kv9",
      "body": "I literally wake up everyday even if I have something nice to do I just dont wanna leave my bed. I have to start thinking “people do things. they do things, everyone does things, you need to do things” to at least make me get up. Its been like this my whole life",
      "created_utc": 1725560185.0,
      "score": 1
    },
    {
      "id": "llovmac",
      "body": "Ohooooo yea that’s a realization I had a long time ago go and it shook me. \nIt’s only been the last 2 weeks since starting medication for ADHD  that I actually feel like I know what normal is. \n\nWhat your saying though, about feeling exhausted all day and awake at night feeling panicked about starting another day, that sounds exactly like I felt, have your ever been tested for ADHD",
      "created_utc": 1725569927.0,
      "score": 1
    },
    {
      "id": "llowrpb",
      "body": "I’ve experienced severe depression and suicidal thoughts for years now. I don’t remember and really even know what life is supposed to be like. It scares me sometimes. I don’t even know what the baseline is supposed to be because I’ve been depressed for so long",
      "created_utc": 1725570290.0,
      "score": 1
    },
    {
      "id": "llozl4n",
      "body": "Wait...people are waking up happy? \n\nI'm constantly exhausted, never get enough sleep, and until recently, I thought intrusive thoughts were normal. I have harm OCD, and I asked my parents if they were ever afraid of hurting our cats. My dad said \"by accident.\" \n\nI tried to explain that I have thoughts and images of hurting the cats, which terrifies me. Unfortunately, Dad didn't get it. And with no empathy, he wasn't liable to.\n\nThe intrusive thoughts have become a lot less due to meds, therapy, and less stress. But it still freaks me out.",
      "created_utc": 1725571193.0,
      "score": 1
    },
    {
      "id": "llpjdj8",
      "body": "I doubt if many people in real life really get out of bad excited for the day.   That sounds like someone from a cartoon or a bad 1970's sitcom.    \n\nBut I don't think most people spend every night worrying about the next day.   Maybe for a few nights here and there.",
      "created_utc": 1725578017.0,
      "score": 1
    },
    {
      "id": "llpnctl",
      "body": "I'm not normal then...",
      "created_utc": 1725579454.0,
      "score": 1
    },
    {
      "id": "lluqv7g",
      "body": "Hi, I'm not sure what type of therapist judges you like that. We can't be happy all the time it's irrational for someone to say it's not normal to have bad or down days, when life has its ups and downs. Life can be exhausting as a young person setting out, as you grow older you learn how to manage that with life experience.\nSorry you had such negative feedback from this professional maybe try a different therapist who can help facilitate skills and coping mechanisms for you. Take care of yourself!",
      "created_utc": 1725655293.0,
      "score": 1
    },
    {
      "id": "lluv68t",
      "body": "Huh? On what planet haha",
      "created_utc": 1725656686.0,
      "score": 1
    },
    {
      "id": "lm3u9jl",
      "body": "Please find a new therapist she sounds so  stupid",
      "created_utc": 1725800021.0,
      "score": 1
    },
    {
      "id": "lmic3sb",
      "body": "I have made my life wonderful.  I worked hard to get where I'm at and I made good choices for myself after many years of being unhappy and depressed. I just started incorporating things and people into my life that made me happy. It was simple. And getting rid of everything that pulled me down ",
      "created_utc": 1726005729.0,
      "score": 1
    },
    {
      "id": "llp9bd1",
      "body": "as someone who is \"less depressed\" than before, its exhausting thinking like that. i cant sleep, i cant eat, and i just doom scroll on my phone.",
      "created_utc": 1725574429.0,
      "score": 33
    },
    {
      "id": "lln6fzc",
      "body": "I mean, the normal guy is not focusing on the bad side of the coin, so there is no reason to feel down always, just sometimes. Actually, normal fellas have a bias to see the bright side of things and to cultivate wishful thinking. At the same time, from what I saw, the depressive ones have a bias to see the worst side of life, downplaying their luck, the minor pleasures, and the constant flow of possibilities to better its existence.\n\nOf course, what is nefarious, morbid, unacceptable, nightmarish, those horrible sides of life do exist. In my bias, I do think that the evil forces are way stronger than the good ones, and that evilness is the main driver of history and human behavior, but goodness exists on a daily basis and is common to find beautiful hearts across the day (sometimes, vulnerable to the harshness of the World).\n\nPay attention to what you focus on. Perspective does not mean reality.",
      "created_utc": 1725550672.0,
      "score": 28
    },
    {
      "id": "llln3vx",
      "body": "I’ve always struggled to believe that everyone doesn’t have suicidal thoughts. I’ve asked my mom if she ever experienced those thoughts and she says she never has, like… how!??!",
      "created_utc": 1725526460.0,
      "score": 109
    },
    {
      "id": "llk66c5",
      "body": "Not normal but not uncommon.",
      "created_utc": 1725498984.0,
      "score": 56
    },
    {
      "id": "llmzp2n",
      "body": "It feels like the norm in this cluster fucked society, considering there is a mental health crisis.",
      "created_utc": 1725548493.0,
      "score": 9
    },
    {
      "id": "llqi0qj",
      "body": "same ive had some suicidal ideation since i was in like... kindergarten",
      "created_utc": 1725590620.0,
      "score": 9
    },
    {
      "id": "lllisxd",
      "body": "Bruh frfr",
      "created_utc": 1725523404.0,
      "score": 2
    },
    {
      "id": "llkdvi3",
      "body": "Yeah I was like, everyone has a little voice that tries to convince them that everyone hates them. Turns out I needed an antipsychotic. 🤷🏼‍♀️",
      "created_utc": 1725501949.0,
      "score": 92
    },
    {
      "id": "llkfgwg",
      "body": "I was kind of upset to learn that when applying for life insurance they were able to pull my psychiatrist records and were basically like \"so tell us about this depression\". Even specific notes were in there about my family and job so now I'm not really willing to share anything specific, which isn't good.",
      "created_utc": 1725502566.0,
      "score": 69
    },
    {
      "id": "llo9op9",
      "body": ">I said everyone thinks about killing themsleves\n\nI had a similar experience when I was at a party and while talking to two friends I mention I'm on meds and one of them asks if I have depression. I answered (jokingly) \"Everyone does\" and they both were like \"No\" 😬",
      "created_utc": 1725563077.0,
      "score": 8
    },
    {
      "id": "lllccfe",
      "body": "I’m up to 64 years. Still don’t understand how people don’t feel like I do",
      "created_utc": 1725518948.0,
      "score": 62
    },
    {
      "id": "llq93g4",
      "body": "I'm 34 and basically just waiting around to die.",
      "created_utc": 1725587285.0,
      "score": 8
    },
    {
      "id": "lllv6hv",
      "body": "If you woke up a millionaire tomorrow do you think that would help or you would still almost  feel the same?",
      "created_utc": 1725531801.0,
      "score": 9
    },
    {
      "id": "llkp0r7",
      "body": "Even one thing can derail someone's supposedly perfect life. This sounds like bs from the therapist. No one is just happy 100% of the time",
      "created_utc": 1725506496.0,
      "score": 28
    },
    {
      "id": "lljuiuv",
      "body": "If I had a dollar for everytime a psychiatrist told me a med was going to do 'X', but instead did 'Y', I'd have lost count",
      "created_utc": 1725494608.0,
      "score": 21
    },
    {
      "id": "llkpbmv",
      "body": "Living in a state of denial that everything is amazing sounds more of a mental illness to me then recognising life has its peaks and troughs",
      "created_utc": 1725506628.0,
      "score": 37
    },
    {
      "id": "lllgncl",
      "body": "Some people just see the world as beautiful and that’s enough for them. Tolkien’s way of writing books has reminded me of this recently. Not everyone sees the world with the twilight filter on like we do haha. And everyone is right, in a way. We’re all looking at different things about life",
      "created_utc": 1725521888.0,
      "score": 17
    },
    {
      "id": "lmt3u55",
      "body": "I feel this so deeply... I'm not even sure I realized I'm only happy when not sober until reading your response.",
      "created_utc": 1726166891.0,
      "score": 2
    },
    {
      "id": "lljup2h",
      "body": "I needed this reminder today. Thank you.",
      "created_utc": 1725494674.0,
      "score": 13
    },
    {
      "id": "llp443q",
      "body": "[deleted]",
      "created_utc": 1725572669.0,
      "score": 4
    },
    {
      "id": "llkp1os",
      "body": "Definitely agree with all you said. Especially the idea of dreading responsibility and then just feeling exhausting after fulfilling it. I never get that joy and satisfaction of doing something. At most I feel glad it’s over.",
      "created_utc": 1725506507.0,
      "score": 11
    },
    {
      "id": "llnr58y",
      "body": "I used to get a sense of accomplishment from the gym and I made a lot of progress during that time, but I somehow quit getting that feeling and now I can’t bring myself to go anymore. Frustrating.",
      "created_utc": 1725557221.0,
      "score": 6
    },
    {
      "id": "llo8jm6",
      "body": "What was your career change?",
      "created_utc": 1725562714.0,
      "score": 1
    },
    {
      "id": "lltgi6m",
      "body": "But you made me giggle, thank you! I feel exactly the same way. There’s no energy in my brain to express what’s going on in there, it’s hell",
      "created_utc": 1725640396.0,
      "score": 2
    },
    {
      "id": "lljvevw",
      "body": "How reliable are the tests? I got one a few years ago and nothing came up but SSRIs do nothing for me and I am severely depressed",
      "created_utc": 1725494942.0,
      "score": 6
    },
    {
      "id": "lm2sg92",
      "body": "[deleted]",
      "created_utc": 1725778414.0,
      "score": 2
    },
    {
      "id": "lljxhg1",
      "body": "I got mine checked a few months ago. All my stuff came back clear unfortunately. It kinda sucked cause I was convinced I had low thyroid, sleep apnea, or something messed up. But I’m perfectly healthy, unfortunately, lol.",
      "created_utc": 1725495720.0,
      "score": 1
    },
    {
      "id": "lm649kl",
      "body": "Oh same. Same. ",
      "created_utc": 1725826174.0,
      "score": 1
    },
    {
      "id": "lm646wg",
      "body": "The pandemic was orchestrated to mess people up mentally ",
      "created_utc": 1725826152.0,
      "score": 2
    },
    {
      "id": "lllj1aw",
      "body": "I was offered antidepressants by a doctor and my therapist said she’d absolutely recommend them to me but also I choose to try to fix my depression without them, which she said she respects. It feels kinda impossible though. I don’t see how therapy is supposed to help me feel better, I feel like I just wallow in my own shit for an hour once a week.",
      "created_utc": 1725523568.0,
      "score": 3
    },
    {
      "id": "llp6klf",
      "body": "Weren't you worried about the long list of potentially permanent side effects?",
      "created_utc": 1725573485.0,
      "score": 1
    },
    {
      "id": "me1igpd",
      "body": "[deleted]",
      "created_utc": 1740166188.0,
      "score": 1
    },
    {
      "id": "lm64c9t",
      "body": "Prince ",
      "created_utc": 1725826197.0,
      "score": 1
    },
    {
      "id": "lmng6xm",
      "body": "Same here... I am exhausted everyday, can't concentrate like other people, have these ADHD paralysis way to often what looks to others that I'm just lazy. And sometimes that hyperfocus kicks in and everyone pisses me off when I have to pause what I am doing then. Sometimes I'm hyperfocused on work sometimes sports or video games. But EVERY FUCKIN day I wake up tired. The fact that I have a job that tolerates all of that and that  my symptoms are not that live ruining makes it very hard to find a therapist to get an official diagnosis and medication here in Germany. Why can't you get medication?",
      "created_utc": 1726082278.0,
      "score": 2
    },
    {
      "id": "lmnwqq4",
      "body": "[deleted]",
      "created_utc": 1726087530.0,
      "score": 1
    },
    {
      "id": "llkov7v",
      "body": "What she said was that most people can lie down and relax and enjoy that relaxation without feeling horrible and anxious, and they also can get up in the morning easily and tend to generally enjoy life.\n\nAs for people who are motivated, my parents both work 2 jobs, passionate about each. It’s kinda frustrating being around them cause they’re on their phones emailing people and stuff all the time. They’re in their early 60’s so it makes me feel shitty that I’m 23 and can’t do it. Also my friends studied hard through college, did internships, one is studying for med school, the other just got a great job. I just an easy IT degree at a community college in 5 years and I feel just shitty and tired, and I can’t get a job with it. It feels like most people around me are advancing themselves and doing well and are motivated but I’m just lazy or something…",
      "created_utc": 1725506428.0,
      "score": 8
    },
    {
      "id": "lllj6jz",
      "body": "I don’t remember ever really feeling like I enjoyed stuff or felt super happy, even as a kid. Like, I played a sport but I’d dread everything to do with it. I’ve always wished I could just spend days in bed but I haven’t let myself. It’s hard to take it as good news, now I just feel like my life is even more shit.",
      "created_utc": 1725523671.0,
      "score": 3
    },
    {
      "id": "llqqket",
      "body": "I think that you and I could be friends.",
      "created_utc": 1725594113.0,
      "score": 2
    },
    {
      "id": "llqqs9h",
      "body": "This is truly disturbing .",
      "created_utc": 1725594204.0,
      "score": 1
    },
    {
      "id": "lm4kl1i",
      "body": "yah maybe it's like, you get angry, and then you want to throw the cat across the room because it's standing in the way of you, you're driven from hatred and you wish you weren't because you're projecting a false sense of innocence on your cat, you know it's not right to hurt animals, and when you cross that line and take it out on the environment it is a lose lose , a negative negative, don't fret, because as long as there is negative negative, there is positive positive, depression is being nothing but zero, and if that mentality effects the environment inappropriately like harming cats, then and only then do you become negative negative, you want more positive positive memories than negative negative memories in your life when you die, you owe it to the innocence inside of you, you know you're innocent because you are nothing, don't play victim becauee the only victim is the cat when you throw it at the wall, ",
      "created_utc": 1725808919.0,
      "score": 1
    },
    {
      "id": "lm4ondp",
      "body": "also try not to project that there is no empathy as that's impossible lol, serial killers actually do have empathy they just use it to pathfind backwards in the social fabric, so their reward is getting to move freely around and live their dreams whenever they want, they've essentially just took over the world because they don't care what you think, don't get pushed around by other peoples legends cuz ain't no ones legend is as cool as mine lol 🤣😂\n\nanyway, don't be a serial killer, don't hurt cats and shit, you know this bro, you got this, we'll figure it out Im positive , positive, ",
      "created_utc": 1725810182.0,
      "score": 1
    },
    {
      "id": "lm4p8h5",
      "body": "don't question yourself cuz \"people are waking up happy?\" is all in your imagination, if you can't be sure about that then it's a lie and they're holding grudges and keeping others down in order to project some image of happiness, you can definitely be in a state of confidence that is absolutely sure beyond a reasonable doubt, so you gotta use your empathy to recognize that \"people\" is just your imaginations way of thinking out loud about itself, and you're questioning whether you're even happy, but the truth is, happiness is also a very boring emotion, you wanna feel enriched with confidence and stability, and comfort, but not complacency, if you're spending your time being happy instead of spending your time seeking happiness, then you're a loser 🤣😂🤣😭",
      "created_utc": 1725810364.0,
      "score": 1
    },
    {
      "id": "lmb8otj",
      "body": "Was quite the breakthrough for me in realising I was quite ill. I simply could not believe that people existed who were happy and excited to live. I genuinely believed this was the human condition and that I was simply weak for not being able to live it like everyone else does",
      "created_utc": 1725905409.0,
      "score": 10
    },
    {
      "id": "llk758y",
      "body": "I couldn’t articulate what I meant very well, but yes that was essentially my point!",
      "created_utc": 1725499354.0,
      "score": 23
    },
    {
      "id": "llqnpvw",
      "body": "That late, huh?",
      "created_utc": 1725592925.0,
      "score": 3
    },
    {
      "id": "lllvky8",
      "body": "This should be illegal.",
      "created_utc": 1725532038.0,
      "score": 66
    },
    {
      "id": "llmfsnq",
      "body": "That is so fucked. How are people meant to trust mental health professionals these days",
      "created_utc": 1725541402.0,
      "score": 28
    },
    {
      "id": "llouvsf",
      "body": "hi I work in mental health.\n\nThey should not have had access or talked to you about anything said in those notes, its supposed to be confidential. \n\nplease talk to someone at that company because what they did was a privacy violation.",
      "created_utc": 1725569701.0,
      "score": 11
    },
    {
      "id": "llnzrhf",
      "body": "Report your health plan or psych for HIPAA. Because HELL NO",
      "created_utc": 1725559928.0,
      "score": 6
    },
    {
      "id": "lloagcv",
      "body": "I think, especially if you're high functioning, it can be like hitting a brick wall. Like what do you mean you're largely fine!?",
      "created_utc": 1725563325.0,
      "score": 7
    },
    {
      "id": "llp3xgt",
      "body": "How do you keep going like this for 64 years? I'm at 25 and I feel like that's plenty for me.",
      "created_utc": 1725572608.0,
      "score": 20
    },
    {
      "id": "lltfffu",
      "body": "I’m deeply sorry you have had to feel like this for so long, and good on you for finding strength to be there for your kids, that admirable. I’m only 26 and have felt like this since I was a child, and losing my dad 6 years ago was the last straw. Tried over 14 meds, lifestyle changes, diet, DNA testing and therapy, but nothing has worked. I really don’t understand how some of our brains are wired this way, I cannot see myself living for another 40+ years like this, I’m not strong enough.",
      "created_utc": 1725640046.0,
      "score": 2
    },
    {
      "id": "lm8lsyk",
      "body": "[deleted]",
      "created_utc": 1725862143.0,
      "score": 2
    },
    {
      "id": "llupqxr",
      "body": "This is really sad. I was like that as a teenager and performed cognitive behavioral therapy on myself to cure my depression. Try it.",
      "created_utc": 1725654932.0,
      "score": 1
    },
    {
      "id": "llm7fzg",
      "body": "That would certainly help at first since I wouldn't have to go to work anymore, which would be relieving. But after a short while I would still feel the same anyway.",
      "created_utc": 1725537995.0,
      "score": 41
    },
    {
      "id": "llocdkr",
      "body": "In all the ways that really matter I would feel the same",
      "created_utc": 1725563940.0,
      "score": 5
    },
    {
      "id": "llr3zs4",
      "body": "Really good question. I think I would need more than a million, but if I had the finances to fulfill all of my fantasies (and by that I mean more of like staying at ultra-primo hotels, getting spa treatments on the reg, having a butler), I think I would be much better. And I have an extensive imagination so I can think of many ways to spend that money, so that being hella wealthy would not get old in the forseeable future.\n\nToday I bought coffee for a random person, and that really made me feel good for a solid 90 minutes. If I had so much money and I could do a lot of nice little stuff like that too.\n\n  \nDoing my fantasies about how I will spend all this money is a fun escape. But then realizing it aint gonna happen... well shoots.",
      "created_utc": 1725600773.0,
      "score": 2
    },
    {
      "id": "llrnm32",
      "body": "Maybe not because I could go camping and uber everywhere where at the moment I can't coz no money. I'd hire friends and people to keep me entertained too. Filling the void in by travelling with these friends all the time",
      "created_utc": 1725613686.0,
      "score": 1
    },
    {
      "id": "lll0mc2",
      "body": "I don't think that's what their therapist is telling them. They're saying that not everyone is unhappy 75-100% of the time. Speaking personally as someone who has spent most of his life depressed, but crested out of it for a solid two years\\*, the bad thoughts still come. I still had fears and insecurities. Though I'd have the odd bad day, they mostly stopped ruining my good days. I could actually enjoy a most activities without stewing internally, do nice or even dumb things without guilt, plan for the future. My memories became warmer, positivity started emerging from the murk, I was able to be a little more gentle with myself. It made me recognise that some people aren't making that mental state up - it really is a way of being. No idea on the prevalence, mind you, but I don't think the therapist is trying to mislead OP.  \n  \n\\*don't worry, it came back and it came back *hard*",
      "created_utc": 1725512107.0,
      "score": 29
    },
    {
      "id": "llpe1c1",
      "body": "Sorry. I hope you have some indoor stuff which you like doing? There's a ton of things you can still do - honestly, my most rewarding thing is my writing. Also, reading!",
      "created_utc": 1725576098.0,
      "score": 2
    },
    {
      "id": "llqothk",
      "body": "\"..the wind is too neurotic.\"\nI know you weren't trying to be funny, but this whole paragraph is very well written dark humor. I think you might have some Talent here.",
      "created_utc": 1725593391.0,
      "score": 2
    },
    {
      "id": "llqpcbd",
      "body": "Sometimes,  I fantasize about being told I have a terminal illness and that the period that I have left to live is in  months. It is a feeling of relief that exists only in the daydream.",
      "created_utc": 1725593607.0,
      "score": 8
    },
    {
      "id": "lltgu8c",
      "body": "I’m exactly the same. I was dedicated to the gym, built up a great physique, even through my darkest hours when I was on substance and abusing it, I’d still go to the gym. Now? Well I’m sober at least, But haven’t  been in a year and lost all my hard work, have tried here and there but never get the “runners” high I’d used to get, and have lost purpose in basically everything. I’m on two antidepressants as well which aren’t doing anything. It’s hell. Never ending hell.",
      "created_utc": 1725640505.0,
      "score": 1
    },
    {
      "id": "llob8hd",
      "body": "I went from working at a job with no good outcome (it was horrible and I hated everything about it), to a job with benefits, that treats us well, gives us good bonuses, extra holidays off, etc",
      "created_utc": 1725563576.0,
      "score": 4
    },
    {
      "id": "lmmahl8",
      "body": "Glad my comment helped u",
      "created_utc": 1726068986.0,
      "score": 1
    },
    {
      "id": "lljwsn7",
      "body": "It's a simple blood test that checks T3 and T4 and TSH levels. I also asked for an antibodies test because hypothyroidism ran in my family and I was already displaying symptoms for years.\n\nResults are pretty accurate as they're literally hormone levels. If you've had weight gain, thinning hair, and lack of concentration it's certainly worth asking to get checked to eliminate thyroid issues.",
      "created_utc": 1725495457.0,
      "score": 14
    },
    {
      "id": "llrt8dd",
      "body": "The list of potential side effects is long. The list of potentially permanent side effects is short. Anyway, yeah, I was afraid of PSSD and still am. For me it was either that or suicide. I was on the brink of kms right before the medication started working. So I took the risk.\n I have been depressed for at least 6 of the last 10 years and lost my teenage years to it. I got depression again in college and lost a whole year without passing any exam. I am now starting my 5th year of my 3 years course.\n\n\nI had an amazing boyfriend, a few loving friends and a big college friend group and still got suicidal.  I just tried to see if it worked and Im so glad I did.\n\n\nI still think antidepressants shouldnt be handed out like candies and if you are feeling depressed you should be diagnosed by a psychiatrist who will decide whether you may benefit from them. There is not just one depression, antidepressants are effective for severe major depression, they are not the first line of treatment for many other mental health issues with depressive symptoms different from major depression",
      "created_utc": 1725617472.0,
      "score": 3
    },
    {
      "id": "me31qp8",
      "body": "Okay? I was suicidal and it literally saved my life. People who love me would rather have me alive. ",
      "created_utc": 1740182777.0,
      "score": 1
    },
    {
      "id": "lmo5r6g",
      "body": "Dead inside. Devoid of life, happiness, and vitality. Ever day is a continual struggle to simply exist or function.",
      "created_utc": 1726090503.0,
      "score": 1
    },
    {
      "id": "llktt90",
      "body": "Don't feel like you are lazy.  The jobs market sucks for IT people.  Who the hell can have 50 qualifications?  You have to be old as dirt and that means no company will pay you your worth or companies have unrealistic expectations. Healthcare sucks too.  Your friends will feel the strain of a collapsing healthcare system.  What a shit show American healthcare is.  You was lied to about the opportunities in technology.",
      "created_utc": 1725508672.0,
      "score": 4
    },
    {
      "id": "lm4knn4",
      "body": "yah well it takes one to know one 🫵🫶",
      "created_utc": 1725808941.0,
      "score": 1
    },
    {
      "id": "lm4m7po",
      "body": "Im thinking like, the cat has a different imagination than you, and you just need to be in tune with your legend, you don't want your influence on the environment to be a bad one, but you also don't want to do bad things just to measure the repercussions, it's called suspense, holding yourself together with faith is all anyone can do whether they're good or evil, manage the suspense and do your best, do your best for you, not for anyone else first, because you have to forgive yourself, they're not thoughts you can get rid of because you're honest and accepting of the truth, all you gotta do is line yourself up to be honest and tell the truth at the exact same time, if you're honest and tell the truth at the exact same time, then you're positive positive for that memory, this is called gospel, this is called music, you should seek gospel as it is the multiples of even numbers parallel to reality which is zero, moving in an exponential rate towards the positive positive quadrant, eventually that line becomes so parallel to reality, it is almost perfectly straight parallel to the origin, \n\ngossip is the bullshit they're making up in their imagination to convince themselves it's a competition, holding grudges for your family is what's going to cause you to hurt cats, so maybe don't do it for them do it for you and the cats, like learn to forgive your parents for not setting up the environment right for you, Im sure they're so full of their own nonsesne that they assume you already have the power, well that's a projection of their innocence onto you, it's naive of them to assume you have the power, and it's rude to put you first in the aspect of expecting you to perform magic, they will regret not helping you manage this process, so stay alive and enjoy the cascade of events that occur when you omit your influence on the environment to practice discipline in order to learn about faith and growth and strength and passion and life itself, it's called wisdom from experience bro and maybes it's better they don't experience a psychotic break , fight or flight is what pussys do bro, choose to do nothing and measure your behavior with science, there is way more time than you'd imagine initially because time is a cytoplasm and since ifs everywhere like that, your imagination takes over, if you're moving in a straight line it's actually a circle you're chasing your own tail, this is called karma, and if you manage it appropriately you'll have good dharma, bunch of nonsense you know it, but hey , comes straight out of my ass, and into your imagination, 🤷‍♂️",
      "created_utc": 1725809427.0,
      "score": 1
    },
    {
      "id": "llkbm4a",
      "body": "I don’t think suicidal thoughts are are uncommon but maybe I’m projecting..,,",
      "created_utc": 1725501086.0,
      "score": 12
    },
    {
      "id": "llqosm4",
      "body": "i literally don't remember anything from when i was younger, probably earlier though",
      "created_utc": 1725593381.0,
      "score": 2
    },
    {
      "id": "llqrtlq",
      "body": "Insurance company employees are not mental  health professionals.  They're salespeople who work for Satan.  They smile in your face.",
      "created_utc": 1725594659.0,
      "score": 9
    },
    {
      "id": "llox3ix",
      "body": "I'm sure I signed a standard release so technically it's on me, but I would've expected the information to be reviewed by someone more discreetly than the agent I talk to on the phone, and I was surprised to learn that the documents included the doctor's session notes.\n\nIn fact, they also asked me about my \"marijuana use\" and where I got my pills, and I know I only mentioned that in passing to the doctor in a list of things I had tried to stave off the anxiety. I literally took one medical marijuana pill, which is almost the extent of my lifetime marijuana use.\n\nLike I said, the level of detail they had access to was just unexpected.",
      "created_utc": 1725570394.0,
      "score": 4
    },
    {
      "id": "llo461e",
      "body": "I'm guessing I did sign some kind of release, but I didn't realize it would be like \"random insurance agent has access to the specific physician's notes for your visits\". I guess I just assumed it would a) be someone other than the agent reviewing it and b) be more matter-of-fact like \"was prescribed zoloft in 2022\" or whatever. But they had access to the raw notes from my psychiatrist. And my stuff wasn't even that wild, but there were things in there I didn't want some rando reading.",
      "created_utc": 1725561323.0,
      "score": 3
    },
    {
      "id": "llpoory",
      "body": "It isn’t easy and there have been many times when it felt just too hard. But I had kids so didn’t feel like I could unalive myself while they needed me. Now they’re fully-grown adults, I don’t have that anymore and have discovered that my pain isn’t as strong as my cowardice (about unaliving myself). Don’t get me wrong, I have had many happy times, but the dread and fear and self-loathing is always there behind those times, and I just have to slap a smile on my dial, take a deep breath and hold on until bedtime. I try extremely hard not to let myself acknowledge that tomorrow, and the next day, and so on, will be exactly the same. I call it ‘doing a Scarlett’ I.e. I’ll think about that tomorrow (and, of course, tomorrow never comes). Not very enlightening, I’m sorry, but it’s all I know what to do",
      "created_utc": 1725579936.0,
      "score": 12
    },
    {
      "id": "lm8zgmj",
      "body": "That’s incredibly insightful. Toss some serious trauma into those flute holes, and a lot of them are liable to be blocked for life",
      "created_utc": 1725871699.0,
      "score": 1
    },
    {
      "id": "llqs1se",
      "body": "Damn, same. The relief.",
      "created_utc": 1725594757.0,
      "score": 1
    },
    {
      "id": "lma1coc",
      "body": "[deleted]",
      "created_utc": 1725890793.0,
      "score": 1
    },
    {
      "id": "llknnr1",
      "body": "I'll have to check again, it's been a few years, even a former therapist thought it was strange that SSRI's had zero affect on my moods.",
      "created_utc": 1725505905.0,
      "score": 2
    },
    {
      "id": "lluyizk",
      "body": "I'm glad it helps. I personally was scared off by the leaflet for Sertaline when it suggested that the side effects caused by the medicine might continue, even if I stopped taking them.\n\nI definitely agree that brain altering drugs should be used with a lot more caution than they seem to be.",
      "created_utc": 1725657804.0,
      "score": 2
    },
    {
      "id": "lm4nrur",
      "body": "as in fight or flight is thag 2 dimensional horse shit that animals do, we're not animals bro, sure we are ambassadors of nature, and have layers of animal inside of us as people, but we are civil beings, with a complex level of influence over the situation with nature, don't be a two dimensional person, do nothing and play both sides manage the situation and find the middle ground, by the end of your life all of your memories will be displaced with faithful memories anyway, so you want to at least get on top of your genetics and walk around freely , before you die, it's worth it bro, and life is black and white, when you're dead you're dead your imagination is gone, so sure it hurts, but use it to make it not hurt, and then when you die your legend lives on and doesn't cause more harm than good, and you managed to create a life that was worth living, lead throguh example, learn how to inspire yourself and you'll be able to inspire others, find a relationship with god but don't consider god a real person, god js nothing, and we are everything, god is the measurement of social pressure creating a feedback loop with society, causing people to feel pressure that is an equal opposite of the genetic render of pressure in the dark as a child, so it's an illusion, but that wasn't the best definition i ever gave, it's just good\nto seek truth and be as honest as you can, otherwise people push you around and shit, that's boring and it causes pressure, ",
      "created_utc": 1725809909.0,
      "score": 1
    },
    {
      "id": "lnmqkln",
      "body": "Me too. Few positive memories here n there. Then puberty plus depression = 30 years torture.",
      "created_utc": 1726606115.0,
      "score": 2
    },
    {
      "id": "llxansv",
      "body": "As an atheist, i would have to say Insurance company employees are probably the best evidence for the existence of Satan and therefore God.",
      "created_utc": 1725694646.0,
      "score": 2
    },
    {
      "id": "lo1l4dm",
      "body": "Yes, but my point is, if there are details from your session with a psychiatrist or psychologist being shared around with the sales people who work for Satan, then how the hell are people in distress supposed to feel free to open up without potential implications further down the track, including financial",
      "created_utc": 1726836748.0,
      "score": 1
    },
    {
      "id": "lloy5xp",
      "body": "the standard release doesn't give them that right. The psychologist/therapy notes are supposed to be sealed unless for urgent need/care. They wont review the call unless they have reason to, such as with a complaint.",
      "created_utc": 1725570736.0,
      "score": 4
    },
    {
      "id": "llon3ut",
      "body": "That is tough! I am sorry! Please contact a lawyer. It just does not seem legal, there is a theory of contracts and in this case I feel that the contract you may have signed (release) was not clearly made known to you. If you go forward with it, your case may end up setting a new precedent concerning medical releases and exactly how far they can go into your files. This feels almost like a “leak” and I just cannot see this being a thing considering rape victims and molestation victims (children and adults) may be at risk especially if there was an ongoing case and they sought out mental health help. I am outraged. Get a lawyer!\n\nEdit: an another thing I have to wonder, with all the hacking that has happened to medical files are these companies now just pulling “once protected” now “public” medical information and basing decisions off of that information?!? Your case could uncover EGREGIOUS MALFEASANCE.",
      "created_utc": 1725567300.0,
      "score": 2
    },
    {
      "id": "lmagurh",
      "body": "I didn’t say it (career change) was for everyone, just giving what worked for me. I hope things get better for you",
      "created_utc": 1725896054.0,
      "score": 1
    }
  ]
}