{
  "id": "1iseyk9",
  "title": "The slightest inconvenience makes me want to kill myself.",
  "selftext": "I can't find my W-2 form and instead of just being slightly annoyed and figuring out how to get a new copy, I just wish I were dead. If I were dead, I wouldn't have to do taxes. Or go to work. Or deal with multiple chronic illnesses. And I just keep spiraling until I have more evidence that death would be preferrable to life. Then, I launch into mentally planning my death until something distracts me enough to stop me from offing myself.",
  "created_utc": 1739891753.0,
  "score": 811,
  "num_comments": 90,
  "url": "https://www.reddit.com/r/depression/comments/1iseyk9/the_slightest_inconvenience_makes_me_want_to_kill/",
  "comments": [
    {
      "id": "mdfvv2g",
      "body": "yeah, when life feels like it's not worth it even a small inconveniecnce is a painful and strong reminder of that",
      "created_utc": 1739892042.0,
      "score": 245
    },
    {
      "id": "mdfy7g0",
      "body": "Felt this exact same way, kms was always an option among the choices in problem-solving. Therapist validated me once and said it was kind of a form of escapism. I feel like the whole \"if I were dead I wouldn't have to deal with xyz...\" mentality is a lot more common in depression-sufferers than you'd think.",
      "created_utc": 1739892743.0,
      "score": 93
    },
    {
      "id": "mdghozv",
      "body": "[removed]",
      "created_utc": 1739898360.0,
      "score": 31
    },
    {
      "id": "mdh3o55",
      "body": "I feel you. I have ADHD too so executive function tasks compounded on my depression make life feel impossible and not worth it. I used to joke about kms a lot, but there were definitely undertones of seriousness to it. I had good luck on antidepressants and therapy - still depressed, but instead of being like a severe case, it’s more chill.\n\nSometimes I wonder how much of depression is inherent in our biology or a product in living a society that demands so much from us.",
      "created_utc": 1739904451.0,
      "score": 23
    },
    {
      "id": "mdgfzzm",
      "body": "Tax stuff is always the worst - any little thing that could go wrong with them sends me in a tailspin of despair. Hang in there…",
      "created_utc": 1739897881.0,
      "score": 12
    },
    {
      "id": "mdgn9hp",
      "body": "I understand the total burnout feeling.  I really do.",
      "created_utc": 1739899912.0,
      "score": 12
    },
    {
      "id": "mdgwdqe",
      "body": "i feel like we all have a reserve of patience.  when it's spent, every hardship is unbearable.   what can you do to replenish your reserve?",
      "created_utc": 1739902449.0,
      "score": 6
    },
    {
      "id": "mdjefjy",
      "body": "This has been me for the past year and a half. It used to take so much to make me cry. I drop a half empty bowl of cat food this morning and am sobbing uncontrollably. I’m actively pushing all my loved ones away and I see it happening but almost feel like I dont deserve anyone who potentially cares. I can’t even think about taxes.. how exhausting. I’ve been wishing more and more that I fall asleep and never wake up.. hoping it gets better for us, OP. I’ve been trudging along but I’m so very tired.",
      "created_utc": 1739928882.0,
      "score": 4
    },
    {
      "id": "mdjyd7f",
      "body": "This was literally me today but then again I’ve been crashing out all week",
      "created_utc": 1739935691.0,
      "score": 4
    },
    {
      "id": "mdg03he",
      "body": "Get on meds. I was the same way. I couldn’t take it anymore and attempted. Got on the right meds after being in the hospital for 2 weeks. Now I hardly get that way if ever really.",
      "created_utc": 1739893305.0,
      "score": 5
    },
    {
      "id": "mdi3y8r",
      "body": "Exactly same here, depression really sucks…",
      "created_utc": 1739914353.0,
      "score": 3
    },
    {
      "id": "mdipi07",
      "body": "I felt this with my soul.",
      "created_utc": 1739920860.0,
      "score": 3
    },
    {
      "id": "mdk75av",
      "body": "I feel this so so so much.",
      "created_utc": 1739939036.0,
      "score": 3
    },
    {
      "id": "mdkgxe8",
      "body": "Yes. This is me. For the past however many years. It sucks.",
      "created_utc": 1739943270.0,
      "score": 3
    },
    {
      "id": "mdkrs6i",
      "body": "Can totally relate",
      "created_utc": 1739948797.0,
      "score": 3
    },
    {
      "id": "mdg2qi4",
      "body": "[removed]",
      "created_utc": 1739894083.0,
      "score": 3
    },
    {
      "id": "mdiftte",
      "body": "I do this all the time as well, in a way it's comforting to me, like I have this one answer to fix all of the problems permanently.",
      "created_utc": 1739917861.0,
      "score": 2
    },
    {
      "id": "medwz5d",
      "body": "I know what you mean, I use to be that way all the times but its getting better. I realize that I am my worst enemy and that by reacting that way I am just unnecessarily adding to my misery. Easier said than done but by lowering my expectations and surrendering and not needing to control everything or have everything a certain way I have learned there is liberation in that, and detaching from a lot of aspects of the world and ego.\nAsk yourself is not finding my w-2 really that big of a problem? I have quite a bit of time left to get them done, getting a new one is as simple as calling or emailing HR at the job to get one from their records. You can even make it some kind if self improving game, lets see how I can get this done without becoming too emotionally or mentally attached to it as a problem.. then the next problem arises and it doesn't stress you out as much because you just accept it and can gain more self control over it.",
      "created_utc": 1740336964.0,
      "score": 2
    },
    {
      "id": "mejkkzn",
      "body": "I think, the last thread Im holding is about to come loose.",
      "created_utc": 1740415682.0,
      "score": 2
    },
    {
      "id": "mdg3ns0",
      "body": "everytime I think about doing my taxes if just pretend they're not real (:",
      "created_utc": 1739894350.0,
      "score": 2
    },
    {
      "id": "mdgolge",
      "body": "You can request a new one from your employer.",
      "created_utc": 1739900286.0,
      "score": 1
    },
    {
      "id": "mdhmv23",
      "body": "real, sorry your going through this i feel the same way",
      "created_utc": 1739909724.0,
      "score": 1
    },
    {
      "id": "mdkj5z4",
      "body": "This is so real",
      "created_utc": 1739944337.0,
      "score": 1
    },
    {
      "id": "mdl3elz",
      "body": "Survival mode is the worst hopefully we can get out of it together 🫶",
      "created_utc": 1739955647.0,
      "score": 1
    },
    {
      "id": "mdlqd2j",
      "body": "If you get frustrated by a task, take a little bit for yourself. Like finding a form. You can't find it? Get suicidal? Take a couple of minutes to go to youtube and watch a videos of kittens screaming at their mom. Then come back to the task, try not to think of the task itself while trying to distract yourself tho",
      "created_utc": 1739968212.0,
      "score": 1
    },
    {
      "id": "mdm9fbu",
      "body": "Yep. I am the exact same way.",
      "created_utc": 1739975178.0,
      "score": 1
    },
    {
      "id": "me2yz1w",
      "body": "Lol when someone says something I don't like I feel unworthy to live even when they simply say ok when I tried to give them compliment and they don't say thank you ",
      "created_utc": 1740181856.0,
      "score": 1
    },
    {
      "id": "me81bm6",
      "body": "I get this also but then there’s times I’ll go 2-3 days where I’m good and everything is ok and one day I’ll wake up and as soon as my eyes open I feel different idk almost like a tick and I know I’m gonna crash out and try and ruin my life. Sometimes that feeling can last weeks and it’s just like everyday I’m just fighting to make it thru the day. Honestly if I didn’t have to help with my parents I’d be gone already but I feel so guilty leaving them with no one to help 😞",
      "created_utc": 1740255283.0,
      "score": 1
    },
    {
      "id": "meai8ze",
      "body": "So that's where my lost twin went. My step mom and step brother just yell at me and mainly can me stupid, to the point where any mistake I make, I am terrified of and think of offing my self. It has gotten so bad, I thought I was gonna die over having a c in the grade book. I made a post talking all about my situation, and I know it might sound selfish but, can someone please find it and help me within it's comments.",
      "created_utc": 1740285714.0,
      "score": 1
    },
    {
      "id": "meb5vly",
      "body": "Well, yes, it appears to solve some problems, but maybe it creates new problems that are even worse, and the problem is that you don't know whether this will be the case or not. It would be a leap into the unknown - and is it not the unknown that triggers the highest degree of fear in humans? A fear that is maybe one of the biggest problem of humanity?",
      "created_utc": 1740297723.0,
      "score": 1
    },
    {
      "id": "mebalwx",
      "body": "Im sorry... thats really hard. It really is. \n\nIt is 100% \"normal\" though.... Atleast for those of us who either don't regulate emotion effectively .. or those of us who are mentally unwell. \nThe simplest of things can start to go wrong (I've literally just stubbed my toe 🤣) and I react and feel SO intensely... that i want to just cease existence. I dont want o be here. I dont want to of existed. Period. \n\nI wish I knew how to stop it, but beyond accepting a certain level of \"it will be like this always (to a certain extent)\"  and getting therapy to help navigate new coping skills to rewireyour brain... theres not much you can do. It's a LONG process... and even still, there will always be moments where they trigger this response. \n\nI get emotional flooding during conversations with my husband when I dont feel understood, or when I feel like he's making me \"justify\" my personal opinion or value. \n\nJust please seek some help and get some supports around you. It can be annoying... I feel like a 35 year old toddler who needs emotional support. It's insane feeling. But truly... get it. There's low cost, even free services. I recommend group therapy as well. I don't like to speak aloy about myself at first (months and months) but eventually... it's nice to hear that you're not alone, others DO feel exactly what you're saying.",
      "created_utc": 1740300501.0,
      "score": 1
    },
    {
      "id": "med9v8r",
      "body": "honestly I get the very same way, things that might seem 'small' to most people seem like massive things for me, if I get anything wrong I will just kick myself for it and wish I were dead so that I can't fuck up anymore, it really sucks and im honestly so sorry that you go through the same thing",
      "created_utc": 1740330346.0,
      "score": 1
    },
    {
      "id": "mef7dyo",
      "body": "I had a moment like this yesterday. Just one thing that made me feel I wasn't good enough and I'm spiraling. It's unbelievable how something small can just trigger that deep shit inside and like I should just go lie down on the road because I'm so fucking done. ",
      "created_utc": 1740350812.0,
      "score": 1
    },
    {
      "id": "mem98ay",
      "body": "Feels like depression isn't enough so they gotta add some chronic illness to the mix too to make me even more jealous of how normal People can live day to day and then I see someone sicker and still happy and I feel like an ungrateful piece of shit all over again",
      "created_utc": 1740443583.0,
      "score": 1
    },
    {
      "id": "mdfx91y",
      "body": "[removed]",
      "created_utc": 1739892458.0,
      "score": 0
    },
    {
      "id": "mdj3s7e",
      "body": "Can’t be that bad. You should try contacting your employer. They can send it electronically",
      "created_utc": 1739925430.0,
      "score": 0
    },
    {
      "id": "mdfxa7u",
      "body": "Yeah, I don't want to fix the problem, whatever it is. Instead, I just want to stop existing. This line of thinking started when I was a teen, so about ten years ago. It's a circuit in my brain that just hasn't ever gone away.",
      "created_utc": 1739892468.0,
      "score": 90
    },
    {
      "id": "mdg1fkb",
      "body": "That's what my therapist told me. She said suicidal thinking is an escape from reality. So, why does it make so much sense as a viable option?",
      "created_utc": 1739893701.0,
      "score": 27
    },
    {
      "id": "mdgnk4d",
      "body": "After I got diagnosed with depression when I was a kid my dad said \"There's nothing wrong with my son\" and I never went back to any doctor for anything mental health related, if I mentioned it I was being a baby. Now, as an adult, I am extremely depressed, anxious, and just in general a mess. For some reason, I can't get my dumb ass to go to a doctor about it. Every time I start the process, I let it fail, and I have no idea why, lol.",
      "created_utc": 1739899994.0,
      "score": 18
    },
    {
      "id": "mdkz9yn",
      "body": "If we all didn’t do it nobody would have to.",
      "created_utc": 1739953126.0,
      "score": 1
    },
    {
      "id": "mdhbb58",
      "body": "I've heavily considered your last point. Would meds truly get to the root of the problem...or just help me bury my potential self so that I can function in a model of life that I don't enjoy?",
      "created_utc": 1739906545.0,
      "score": 6
    },
    {
      "id": "mdgctu1",
      "body": "What are these magical meds because Ive tried over 7 with zero success 😭",
      "created_utc": 1739896989.0,
      "score": 11
    },
    {
      "id": "mdg8c9t",
      "body": "I'm sorry. I've struggled with health since I was born. It's tough, so kudos to you for trying to stay positive.",
      "created_utc": 1739895709.0,
      "score": 6
    },
    {
      "id": "mdgqu2d",
      "body": "Lol yeah, I'm gonna talk to HR today. Thanks. Wasn't so much about the issue, just my automatic negative reaction.",
      "created_utc": 1739900911.0,
      "score": 7
    },
    {
      "id": "mdkile0",
      "body": "New what ?",
      "created_utc": 1739944062.0,
      "score": 1
    },
    {
      "id": "mdfyn3p",
      "body": "I have things that actively make me want to die and things that don't actively make me want to die. So, I don't enjoy much in life.",
      "created_utc": 1739892873.0,
      "score": 13
    },
    {
      "id": "mdfyg4k",
      "body": "same. also had the 10 year 'anniversary\" recently. success never felt worth it even at times i achieved it.",
      "created_utc": 1739892815.0,
      "score": 20
    },
    {
      "id": "mdjabek",
      "body": "I relate to this. Though I've never felt this low as I currently do, I just can't seem to shake these sad feelings",
      "created_utc": 1739927533.0,
      "score": 3
    },
    {
      "id": "mdopeka",
      "body": "I've been working on my reacting. My doctor increased my buspar up to 60mg a day. I swear it's helped so much.",
      "created_utc": 1739999380.0,
      "score": 2
    },
    {
      "id": "me2z7ki",
      "body": "At least you have the option to fix it most of the things bothering me I can't fix it or the solutions I have a minor chance of it working i want a redo so badly literally begging to God for that or for mind swapping to be real I'm tired of my own mind",
      "created_utc": 1740181934.0,
      "score": 1
    },
    {
      "id": "mdg3fcb",
      "body": "It's logical to a depressed person, but would never be a solution to a healthy person. Your reality how you're experiencing it is very real, but it is also warped by cognitive distortions. That's kind what I tell myself anyway.",
      "created_utc": 1739894282.0,
      "score": 19
    },
    {
      "id": "mdghsyd",
      "body": "[removed]",
      "created_utc": 1739898391.0,
      "score": 11
    },
    {
      "id": "mdhec9o",
      "body": "Repeated invalidation can take a toll on anyone, particularly an impressionable young person. Perhaps your father conditioned you to believe you don't deserve help. If that sounds correct, I'm sorry that happened to you. You deserve help; we can't be expected to get through this life alone.",
      "created_utc": 1739907385.0,
      "score": 12
    },
    {
      "id": "mdhivup",
      "body": "Similar experience here. Mom said “unless you’re suicidal, you’re not that depressed”. That boomer tough-it-out mentality is the reason I let it get so bad before seeking help ¯\\_(ツ)_/¯ ",
      "created_utc": 1739908627.0,
      "score": 6
    },
    {
      "id": "mdkht3d",
      "body": "I’m so sorry you go through this. It seems obvious to me that you’re misguided dad’s mishandling of the situation caused this. Maybe try Telehealth?",
      "created_utc": 1739943685.0,
      "score": 1
    },
    {
      "id": "me6vcv8",
      "body": "I have treated the depression and I have stopped treating it.  After decades of experimenting, I have found I am at least “predictable” when untreated.  Mental health drugs are dangerous and no one knows what they will do and when they will do it.  And if it does something too crazy, you commit acts that can get you imprisoned for life.  The brain is not part of the soul.  Jesus is the answer, not mental health professionals. ",
      "created_utc": 1740243274.0,
      "score": 1
    },
    {
      "id": "mdi5fdj",
      "body": "For me, medication helped me get my life together to do more of the things that bring meaning and joy into my life. It’s still hardly enough, but I’ll take pockets of joy over never ending despair.\n\nIf I didn’t live in a demanding society, would I still be depressed? Probably. I’ve always displayed depressive symptoms since childhood. But maybe it wouldn’t have gotten as severe.\n\nIt’s hard to tell and there’s no way to know for sure. \n\nWhat I can say is things might seem less tedious and you’re brain might be more free on medication. It made my life tolerable - if depression is something you struggle with consistently, I’d really encourage you to explore it as an option to pursue a better, albeit far from perfect, quality of life.",
      "created_utc": 1739914753.0,
      "score": 3
    },
    {
      "id": "mdge55k",
      "body": "Xanax and Zoloft. Weed too.",
      "created_utc": 1739897357.0,
      "score": 2
    },
    {
      "id": "mdkip3h",
      "body": "Same plus my awesome bf and awesome parents",
      "created_utc": 1739944112.0,
      "score": 1
    },
    {
      "id": "mdg04vv",
      "body": "[removed]",
      "created_utc": 1739893316.0,
      "score": -14
    },
    {
      "id": "mdg6dx2",
      "body": "I'm sorry. Success was worthwhile, but I never trusted myself to maintain the responsibility just in case my physical or mental health crashed.",
      "created_utc": 1739895145.0,
      "score": 18
    },
    {
      "id": "mdkhhjw",
      "body": "I am sorry you experience this. I feel like I “fell from grace” when we got a new general manager: I couldn’t perform the way he thought I should, after taking away my 3-hr assistant. So I moved “down” back into my previous position (though technically same level), and he’s now got two people splitting what he wanted me to do solo!\n\nI feel demoralized every time I walk into work. To make it worse, I commute 2.5 hrs/day minimum, so when I get home, I’m in no mood to do any work",
      "created_utc": 1739943533.0,
      "score": 2
    },
    {
      "id": "mdr1vyf",
      "body": "Does it lessen suicidal thoughts? Is an SSRI? A mood stabilizer?",
      "created_utc": 1740026682.0,
      "score": 2
    },
    {
      "id": "mdg4ykf",
      "body": "Yeah...when a healthy person hates their life, they change their mindset/behavior and/or change their circumstances. But when a depressed person hates their life, that person is more likely to choose the third option: Stay miserable, makes things worse, and/or end their life.",
      "created_utc": 1739894728.0,
      "score": 20
    },
    {
      "id": "mdkhxg6",
      "body": "Gee wiz, I’m so sorry you were told that! 💕",
      "created_utc": 1739943741.0,
      "score": 2
    },
    {
      "id": "megap91",
      "body": "Pockets of joy, that really resonates with me thank you. It is so hard the day to day, the demands as you say don’t stop.",
      "created_utc": 1740364162.0,
      "score": 2
    },
    {
      "id": "mdkihwy",
      "body": "I smoked a lot of weed previously. It helped a lot, but I’m worried about brain damage/“holes” that I’ve seen on brain scans (Amen clinics—not mine), plus the pleural thickening around my lungs and the smoker’s lines around my lips. So I would do edibles, but nobody in my inner circle would approve of it",
      "created_utc": 1739944016.0,
      "score": 1
    },
    {
      "id": "mdgi5gg",
      "body": "[removed]",
      "created_utc": 1739898490.0,
      "score": 8
    },
    {
      "id": "mdkivl5",
      "body": "WTF??? I guess deaf people need to listen harder and blind people need to look harder, huh?",
      "created_utc": 1739944199.0,
      "score": 1
    },
    {
      "id": "mekq67l",
      "body": "It really is. I’m super grateful for my partner who is generally very happy person. It’s helpful to have that reminder around me.",
      "created_utc": 1740427354.0,
      "score": 2
    },
    {
      "id": "mdq35ga",
      "body": "Just FYI, we made a different choice lol",
      "created_utc": 1740014204.0,
      "score": 2
    },
    {
      "id": "memsmgx",
      "body": "Yes I also have someone like that in my life, it’s so nice to see someone who has that happy go lucky personality.",
      "created_utc": 1740450015.0,
      "score": 1
    }
  ]
}