{
  "id": "1knzn43",
  "title": "I hate capitalism",
  "selftext": "Everyday is just wake up, work, clean or other chores, sleep and repeat. I live with the woman I love and I barely see her cuz of different work hours, but quitting gives me the worst anxiety. I hate the 40 hour week, I hate being alive for fucking nothing, I hate politics, I hate people, why is Everything just so shit. Everyday I hope that a care hits me so I‘m at least injured enough to go to work if not die. \n\nI used to have hobbies, I used to actually be fine. I used to like who I was, but now I‘m just tired and annoyed almost everyday. I just wanna get stoned now, how does anyone enjoy living ",
  "created_utc": 1747398655.0,
  "score": 701,
  "num_comments": 108,
  "url": "https://www.reddit.com/r/depression/comments/1knzn43/i_hate_capitalism/",
  "comments": [
    {
      "id": "msnaaly",
      "body": "whatever happened to the 4 day work week movements.  we need those to become a thing again.",
      "created_utc": 1747411644.0,
      "score": 97
    },
    {
      "id": "msplz9z",
      "body": "You're right — this system is a soul-killing machine.\nWe work, we break, we lose ourselves — and they still want more.\nLife shouldn’t feel like a punishment just for surviving.\nThis isn’t living — it’s modern slavery wrapped in false freedom.\nYou're not weak. This system is sick.",
      "created_utc": 1747438451.0,
      "score": 43
    },
    {
      "id": "msm9cki",
      "body": "In the same boat, up at 645 back at 6, do some chores, shower, few hours to try and relax from the 14 hours of being active then head to bed at 1030 so I can get a full 8... life sucks and its fully on the rich that it has gotten to this point.  Their greed and politicians stupidity. Time for another revolution.",
      "created_utc": 1747400283.0,
      "score": 128
    },
    {
      "id": "msmkpah",
      "body": "I don’t get it either. How people enjoy living. I’m working all the time, and when I’m not working, I’m tired. My vacations are sleeping and slacking around for 2 weeks, planning a trip seems even more work (and giving away my money) for me.",
      "created_utc": 1747404086.0,
      "score": 65
    },
    {
      "id": "msqs0q9",
      "body": "Dude, this is why I keep saying that democracy and politics didn't come to abolish slavery. It only masked it even further. Slavery still exists in the form of corporations and governments basically ruining your life because you're just an expendable, insignificant statistic at the end of the day.\n\nYour life basically BELONGS to whatever corporation you're employed at, whatever insurance company has branded your flesh, and whatever bank has full hold of your finances. You're not your own person. None of us are.",
      "created_utc": 1747455303.0,
      "score": 16
    },
    {
      "id": "msmjbfu",
      "body": "r/antiwork they get it too 😕",
      "created_utc": 1747403648.0,
      "score": 27
    },
    {
      "id": "msoc2ak",
      "body": "I still don't understand why we don't have the 4 days week. Even so would be too much, but slighlty better. I feel exhausted at the end of the week, basically the weekend is the time off to recharge for the next work week.",
      "created_utc": 1747422845.0,
      "score": 9
    },
    {
      "id": "msnit90",
      "body": "The American Dream has turned into the American Nightmare. No empathy or community. It's dog eat dog now.  We're a media-fed society that has physiologically brainwashed people.",
      "created_utc": 1747414134.0,
      "score": 32
    },
    {
      "id": "mso7end",
      "body": "Staying connected with the outdoors always helps me, though I still feel like everyday puts me that much closer to selling everything and trying to get as far as possible away from a regular work life",
      "created_utc": 1747421426.0,
      "score": 7
    },
    {
      "id": "msn06y0",
      "body": "I hate everything",
      "created_utc": 1747408715.0,
      "score": 7
    },
    {
      "id": "mspoq6q",
      "body": "The unrelenting grind is soul crushing. You have to “adapt” or it’s game over.",
      "created_utc": 1747439462.0,
      "score": 5
    },
    {
      "id": "mt0yv9c",
      "body": "It is crazy this system we have going on has turned everyone angry and selfish.. I had my boss yell at me like he was ready to kill me or something before",
      "created_utc": 1747606467.0,
      "score": 6
    },
    {
      "id": "msn5edr",
      "body": "Don't you like gifting your life to some mf just to make him/her richer and richer? Commie1! 1!1!1!",
      "created_utc": 1747410222.0,
      "score": 15
    },
    {
      "id": "msm7f4t",
      "body": "[removed]",
      "created_utc": 1747399588.0,
      "score": 4
    },
    {
      "id": "msot3kd",
      "body": "Yes, the Soviet Union had it great in retrospect. They only worked 12 hours everyday, and got a two room apartment (that's not bedrooms) but at least there was a chicken in every pot. With food lines you go apples in the winter and cherries in the spring.",
      "created_utc": 1747428065.0,
      "score": 10
    },
    {
      "id": "mtulfi7",
      "body": "Ive been searching for a few minutes just to find someone to say it. \n\n\nI hate this system. I just want to not be sober and not wake up. \n\n\n\nI wish we could just volunteer to be put to sleep. My husband and I feel the same and that's why we dont want to have kids. Were both in our 30s now. Its getting worse, not better. \n\n\nWe've both wished to not exist since childhood. We dont want  to continue experiencing this inescapable empty greedy and uncaring society/system we've been in. There doesnt seem to be an escape in any country. Our system is everywhere. Its spread like cancer.\n\nWhy do we all have to be fucking engineers or factory workers working 60 hours a week just to put food on the table? And if you just want to work at an animal shelter or daycare you're basically working to starve.\n\nThe best moments are dreaming. Escaping reality. \n\n\nI wish I could hug you all right now. Were not alone. But everything is so isolating and cruel. And some people actually love this shit and its nauseating. \n\n\nAre we in hell?",
      "created_utc": 1748013676.0,
      "score": 3
    },
    {
      "id": "mtpwx61",
      "body": "Yeah when literally nothing takes the edge off, and the only thing you hav to do is die or be useful, it’s like damn I don’t like literally every waking moment of literally every day. Trying is too much hassle. Chores is too much hassle. The shame of not working keeps me working but nothing hits right anymore. What’s the point of dragging out suffering? To eat? Overindulging in food doesn’t help, drugs don’t help, sleeping more and eating well doesn’t help, exercising doesn’t help. It’s all turned to shit and I’m just supposed to shut up about it so it doesn’t affect others. It affects me and it enrages me, fuck everyone if it’s always going to be fuck me",
      "created_utc": 1747946083.0,
      "score": 2
    },
    {
      "id": "msm7mj6",
      "body": "It’s really hard and I have those days where I just fucking hate life because of how it is. I know you have anxiety about quitting but it seems like you need to advance your career in the industry you’re in or try a new field. That sounds like it would be best with your situation. What do you currently do?",
      "created_utc": 1747399663.0,
      "score": 4
    },
    {
      "id": "msmp0v2",
      "body": "Can’t blame you.  Your feelings are valid.",
      "created_utc": 1747405416.0,
      "score": 3
    },
    {
      "id": "mstfv2a",
      "body": "My situation is similar. I feel out of place in society and I can't understand why people just live in a broken system.",
      "created_utc": 1747500349.0,
      "score": 1
    },
    {
      "id": "mt0h360",
      "body": "Exactly what I think since last few months..im just get really tired sometimes, i don't eveb work that much, i dont even like my job to code stuff. But it is what it is.",
      "created_utc": 1747600647.0,
      "score": 1
    },
    {
      "id": "mt2ni32",
      "body": "Yeah it sucks that why you need to give your life purpose like dedicating it to helping people like I have it makes everything better knowing others will benefit from your suffering that will happen anyways",
      "created_utc": 1747630524.0,
      "score": 1
    },
    {
      "id": "mtchpdg",
      "body": "I guess this is life and not much we can do",
      "created_utc": 1747768510.0,
      "score": 1
    },
    {
      "id": "mtjpyw8",
      "body": "My life has also had a bitter taste for years... I think the key is pleasure, finding time to do what you love. Not having time is not supposed to be an option unless happiness is not a priority.\nIn short, courage…",
      "created_utc": 1747863081.0,
      "score": 1
    },
    {
      "id": "mtty033",
      "body": "WE NEED TO STOP BUYING THINGS. Actual necessities are few and we can share and reuse and refurbish. We ALL need to come together and axe the corps and politicians but we can only do that if we realize our collective power as one nation of citizens. But sadly most have now been divided understandably.",
      "created_utc": 1748006698.0,
      "score": 1
    },
    {
      "id": "msmff4v",
      "body": "Yeah the dream is to have passive income or be financially independent there is a sub for that FIRE join and u might like it, I suggest investing your money as little as you might save but still do it, you can invest in the S&P 500 or real estate. Good luck mate 🍀",
      "created_utc": 1747402370.0,
      "score": -6
    },
    {
      "id": "mtsghqp",
      "body": "I aint readin allat",
      "created_utc": 1747980361.0,
      "score": -1
    },
    {
      "id": "mso9bxg",
      "body": "So actually, one of the worst jobs I ever had had a 4 day work . It was legitimately the only good thing about the job. However they constantly asked me to come in on my off days cause as they said \"we knew you could use more money\" that was years ago I've been able kinda retire of my VA claims so I do uber eats now to kinda do something throughout the day. Turns out I made money do that than installing cable crazy right.",
      "created_utc": 1747422007.0,
      "score": 9
    },
    {
      "id": "mszeuyj",
      "body": "In germany they wanna do 4 days but 10 hours a day, and I‘d legit kill myself about this",
      "created_utc": 1747588510.0,
      "score": 3
    },
    {
      "id": "mtj37mp",
      "body": "It's not happening.",
      "created_utc": 1747856676.0,
      "score": 1
    },
    {
      "id": "mttx4j5",
      "body": "Incredibly well said. “We lose ourselves” damn…that’s real",
      "created_utc": 1748006412.0,
      "score": 2
    },
    {
      "id": "msmkwlq",
      "body": "No we won’t because half of us are stupid enough to believe one day they will be part of the aristocracy.",
      "created_utc": 1747404151.0,
      "score": 47
    },
    {
      "id": "mt1du5z",
      "body": "Completely agree, I don't think anything else can fix this. ",
      "created_utc": 1747611873.0,
      "score": 2
    },
    {
      "id": "msnhvvo",
      "body": "Are you at least making the world a better place with your work?",
      "created_utc": 1747413867.0,
      "score": 7
    },
    {
      "id": "msot0pc",
      "body": "This is why I'm happy. I only work 40 hours a week, as opposed to the 50 hours my parents worked. I don't have to work in the 100 degree heat picking cotton 10 hours a day like my mother did. I grew up with a single nine inch black and white TV in the house. We had one car. Now everyone has a car and there is a TV and a computer in every room. We have it a lot easier today.",
      "created_utc": 1747428041.0,
      "score": -8
    },
    {
      "id": "mss231j",
      "body": "Nobody is making you work for any certain company…",
      "created_utc": 1747482232.0,
      "score": 0
    },
    {
      "id": "mt5ano4",
      "body": "I feel so safe here, cuz usually you just get called lazy and I‘m like haha yea I have to pretend I don‘t wanna throw myself in front of a car every single day, like god it‘s so exhausting, and then you‘re met with 0 empathy",
      "created_utc": 1747672631.0,
      "score": 3
    },
    {
      "id": "msotoim",
      "body": "The worst part is this trend to being open on Thanksgiving Day. Americans have to constantly shop.",
      "created_utc": 1747428242.0,
      "score": 5
    },
    {
      "id": "msnps2x",
      "body": "It always was dog-eat-dog. It’s just more noticeably extreme now.\n\nAmerica was founded by carving out large areas of territory by wiping out and colonising Native lands.\n\nThere’s always been systemic racism and ableism because that’s what the “American Dream” was founded upon. \n\nSame as the British Empire.\n\nYou want community and empathy you have to let go of the false notion of “the great nation”. There’s the rich and the poor. And the poor have to unite.",
      "created_utc": 1747416164.0,
      "score": 16
    },
    {
      "id": "msmk72o",
      "body": "There is a balance, and it will eventually take place with or without our consent.\n\nIt's called an extinction event.",
      "created_utc": 1747403925.0,
      "score": 7
    },
    {
      "id": "msmhidy",
      "body": "You have hit the nail on the head.",
      "created_utc": 1747403066.0,
      "score": 1
    },
    {
      "id": "msn3x3p",
      "body": "You know what, \"financial literacy\" for people who are living paycheck to paycheck is not what's going to save them. If someone is working a 40 on an opposite shift as their partner, do you think they own their own house, let alone a second to let out? Telling someone treading water financially to invest is incredibly insulting.",
      "created_utc": 1747409798.0,
      "score": 15
    },
    {
      "id": "msmkf1y",
      "body": "Most people live paycheck to paycheck, spending habits aside, I’m speaking at world level. No hope for an Afghan farmer to even know what S&P 500 is.",
      "created_utc": 1747403995.0,
      "score": 8
    },
    {
      "id": "mssc5rg",
      "body": "I quit the 9-5 grind, living off of VA disability and do uber eats too! Kind of frustrated with how much I had to pay in taxes for being self employed tho.",
      "created_utc": 1747486693.0,
      "score": 5
    },
    {
      "id": "mst5xy4",
      "body": "could you just say \"no\" though?",
      "created_utc": 1747497122.0,
      "score": 1
    },
    {
      "id": "mt2mf1d",
      "body": "The 4 day part or the 10 hour part?",
      "created_utc": 1747629961.0,
      "score": 3
    },
    {
      "id": "mtrqpnv",
      "body": "I worked four years with 4-10s and I would go back in a heartbeat. Yeah, it sucks to start work at 7 and finish at 5, but it feels great to have a long weekend every weekend. Ultimately if you have a commute, one whole day not going into work at all is that commute time, and the prep for the day, no longer there.\n\nI would do 3 -12s if they'd let me. :P",
      "created_utc": 1747968517.0,
      "score": 1
    },
    {
      "id": "mtjiqf9",
      "body": "Same as the \"fight for 15\" that wasn't even enough then",
      "created_utc": 1747861036.0,
      "score": 1
    },
    {
      "id": "mttx8zu",
      "body": "Sadly spot on",
      "created_utc": 1748006453.0,
      "score": 1
    },
    {
      "id": "msni7hv",
      "body": "I’m automating other people’s jobs, so no. That was sold to me as a way out of poverty and enslavement. Big lie. It’s just premium slavery.",
      "created_utc": 1747413960.0,
      "score": 29
    },
    {
      "id": "msotmxo",
      "body": "The prosperity your parents experienced no longer exists. We are going backwards in life standards, not forward. Of course I live better than a middle age peasant, but I wasn’t born in the middle ages. I was born to homeowners living on a single income. Not in my wildest dream could I replicate that now.",
      "created_utc": 1747428228.0,
      "score": 10
    },
    {
      "id": "msw3ze4",
      "body": "Well you're forced to work and get a job in this world anyways, what true difference is there between rich corpos? They're all scummy oppressive tyrants either way",
      "created_utc": 1747534314.0,
      "score": 8
    },
    {
      "id": "mt1ejbx",
      "body": "Everything is like this, come on",
      "created_utc": 1747612130.0,
      "score": 1
    },
    {
      "id": "msox9p4",
      "body": "In some EU countries, and probably in many other parts of the world, shopping malls are open on Christmas or New Year's Day, and the people working there are often overworked and underpaid. And also this happens because, as you said, people have to constantly shop.",
      "created_utc": 1747429333.0,
      "score": 2
    },
    {
      "id": "mswj9m4",
      "body": "Even when I was  a kid in the 90s places/stores were 100% closed on Sundays. I mean maybe a 7-11 was open somewhere but nothing in my little town. Even Saturday places usually closed up early.  If you needed something besides a doctor, it was gonna wait till Monday.  I'm never buying anything on Thanksgiving day to incentivize these companies to open on Thanksgiving. I dont need a damn thing that bad. \n\n\nI mean I know a lot of people went to church on Sunday, but not everyone did including me. It was just a day to relax where nothing was going on. Have dinner with family or visit friends cause they were off work too. Now days many people work Sundays so schedules are tight. I don't know, nostalgia I guess.  \n\n ",
      "created_utc": 1747541091.0,
      "score": 1
    },
    {
      "id": "msnhlzw",
      "body": "Where does he says he is “paycheck to paycheck” and at least my answer is better since im providing a solution instead of just agreeing with him and saying some depressing bullshit “ yea man its hard fuck the world I also want to die” Im the only one here saying something positive",
      "created_utc": 1747413789.0,
      "score": -8
    },
    {
      "id": "msou21x",
      "body": "Well some of these people should stop buying 20 scratch offs a day and get rid of some of their subscriptions. You'd be amazed at how much money the average person wastes.",
      "created_utc": 1747428355.0,
      "score": -4
    },
    {
      "id": "msmmdu2",
      "body": "You are going to extremes buddy, If you have access to reddit and have time to whine, you can learn about investing your money, if a person cant do it cuz there are no options thats another story m8te",
      "created_utc": 1747404615.0,
      "score": -12
    },
    {
      "id": "msseq4h",
      "body": "I started last week. I live on top of an army base, so I'm surprise with how much I can make albiet its no 27 an hour job when you account gas, mileage and such, but i make about a hundred a day most of the army guys tip pretty nice......last night was also great cause I drove out to a training area and dropped his food off to him while he was geared up at 2300 so that brings me back, dude got jack in the box and a bottle of water I was so proud. But alot of time I can pickup 3 orders at a time and theyre all in the same building so its pretty nice, only issue i have is they shut some of the gates down at a certain hour so no vehicle access which means I have to drive around the base to drop off food usually thats when I call it quits for the day.",
      "created_utc": 1747487727.0,
      "score": 2
    },
    {
      "id": "mstbps1",
      "body": "To what in particular, the extra day for cable while technically yes they'd be fkn nasty about which is pretty awful when you need your managers approval for damn near everything installation wise. Like I said, i did say no. It was one of the few jobs I legitimately told my boss I'd rather be homeless sucking people of them for smack than work their again. Imagine working in a hot ass attic for 2 hours and only getting paid 10 bucks for your efforts then being forced to drive an hour away which you also dont get paid for and the gas comes out of your pay check like fk no the whole company felt illegal it wasn't even spectrum it was a local company that took spectrum contracts for cheap.",
      "created_utc": 1747498997.0,
      "score": 2
    },
    {
      "id": "mt59wgm",
      "body": "The 10h part. I work 10h from time to time but my brain is always fried the next day cuz of late shifts, getting home at 1/2am",
      "created_utc": 1747672407.0,
      "score": 2
    },
    {
      "id": "mtjj459",
      "body": "You live in an echo chamber. Most people have to get it done themselves if they want a better life. I went from being a week away from homeless to homeowner in 5 years, but a lot of people aren't willing to do what it takes.",
      "created_utc": 1747861139.0,
      "score": 1
    },
    {
      "id": "msovyh5",
      "body": "What I wrote was prosperity to you? How did you come to that conclusion? Working in the cotton fields was a better job?",
      "created_utc": 1747428929.0,
      "score": -1
    },
    {
      "id": "msy7q4q",
      "body": "Yes, that’s how society works.. don’t like what you are doing??? Do something else",
      "created_utc": 1747574340.0,
      "score": -1
    },
    {
      "id": "mttxmx3",
      "body": "That’s the point. It shouldn’t be. You’re stuck in the “that’s just the way we do things” and American exceptionalism. This is not a life and is not what it should or has to be but we’ve been strategically manipulated to stay and be grateful and think we are the best and we are rapidly finding out we are and have been FAR from the best.",
      "created_utc": 1748006579.0,
      "score": 2
    },
    {
      "id": "mswjypg",
      "body": "Not just nostalgia, things were actually different. It seemed like billions weren't attainable then so people were happy with millions.",
      "created_utc": 1747541430.0,
      "score": 1
    },
    {
      "id": "mso34on",
      "body": "You're not positive, you're giving unsolicited advice. If I told you irl that the monotony of life was wearing me down and you told me to invest in real estate, I'm deleting your number and never seeing you again.",
      "created_utc": 1747420122.0,
      "score": 8
    },
    {
      "id": "mt5pk3v",
      "body": "Ohh yea the late shift.",
      "created_utc": 1747676926.0,
      "score": 2
    },
    {
      "id": "mtjjfpe",
      "body": "What?",
      "created_utc": 1747861219.0,
      "score": 1
    },
    {
      "id": "msow5ey",
      "body": "They started working on the cotton fields and now they live in times where they have cars, TV, computers. That was progress to them. Now we pay pizzas with credit cards.",
      "created_utc": 1747428988.0,
      "score": 11
    },
    {
      "id": "mt5abnb",
      "body": "But literally everything is shit? The only thing that ever interested me was maybe art, but I lost even that hobby, and I sereiously don‘t know how anyone can enjoy doing anything for 8h+",
      "created_utc": 1747672532.0,
      "score": 2
    },
    {
      "id": "msounua",
      "body": "Me and my wife opposite shifts for years. It saved us from huge childcare bills. We saw each other two days a week.",
      "created_utc": 1747428535.0,
      "score": 0
    },
    {
      "id": "msox8fl",
      "body": "We had one car. Now I have four. They made progress but I made a lot more progress than them. My mother is now living with me, not the other way around. Do you think that they had it better than me?",
      "created_utc": 1747429322.0,
      "score": -1
    },
    {
      "id": "msoxbgm",
      "body": "Well your case is not the case for most of us.",
      "created_utc": 1747429348.0,
      "score": 5
    },
    {
      "id": "msoyhgl",
      "body": "It most certainly is. You may have stepped back from your parents but you haven't stepped back from you grandparents. Would you rather live in the 1930s-40s or now?",
      "created_utc": 1747429712.0,
      "score": -1
    },
    {
      "id": "msppn2v",
      "body": "My grandfather lived back then, in the 1930s/40s. He only had an 8th grade education, and he made enough at his job to support a wife and four kids. He owned his own house. He only drove one car, but his job provided him with a pension that allowed him to enjoy a 27-year retirement. He didn't have a computer in every room, but he had affordable health coverage that didn't bankrupt him when his back gave out, or when he had a heart attack. \n\nAnd he wasn't some rare unicorn. Everyone in his family and everyone in his neighborhood lived the same experience. They didn't have luxury, but they at least had security.\n\nSo yeah, who wouldn't trade two cars or two laptops for that?",
      "created_utc": 1747439805.0,
      "score": 8
    },
    {
      "id": "mspw8tb",
      "body": "Me, I'm the who. I live in that neighborhood hood but with four cars and four gaming PCs.",
      "created_utc": 1747442296.0,
      "score": 0
    }
  ]
}