{
  "id": "1iswzg5",
  "title": "I forget depression isn’t common",
  "selftext": "I often forget that clinical depression isn’t something everyone has. Like truly there are people out there who don’t think about killing themselves every day, or who can just take care of themselves like it’s a second nature. Some, most, people find existing easy. Idk that’s crazy to me, like wdym you never think about taking yourself out?? Like good for you I wish lol!! Or like bed rotting, my ideal life is to do nothing my depression has heavily impacted my energy. I have energy for nothing, even talking is difficult. But like for some it’s easy to talk, or get up, or like pursue goals. ",
  "created_utc": 1739939371.0,
  "score": 1210,
  "num_comments": 93,
  "url": "https://www.reddit.com/r/depression/comments/1iswzg5/i_forget_depression_isnt_common/",
  "comments": [
    {
      "id": "mdkeb38",
      "body": "There came a time in my life where I just couldn't relate to people who had never experienced depression or true grief.  ...I mean, I still can't,  but I try to.  The \"funny\" thing is that toxic positivity is so sickening that i feel grateful my depression made me a better person.  A truly more understanding person when it comes to the human condition.\n\nAlso, statistics of depression and other mental illnesses rely on the person telling the truth.  I think there's way more of us out there than we know about.",
      "created_utc": 1739942073.0,
      "score": 371
    },
    {
      "id": "mdkik0x",
      "body": "The idea people don’t pray every night to just  not wake up is mind fucking to me",
      "created_utc": 1739944044.0,
      "score": 138
    },
    {
      "id": "mdklizl",
      "body": "Yep. I struggle to remember happy memories. It’s why I mostly keep to myself. Most people are content with working, paying their mortgages and having kids. Not me. Never have been, never will be. I’m not sure exactly what the opposite of depression is for me because I haven’t experienced it, but it doesn’t involve struggling for the next 20-30 years just to have my basic needs met, like food, shelter and paying my bills. Do you guys ever get mad and think *I didn’t even ask to be here.* Honestly, the only thing that brings me momentary relief these days is sleep, the enjoyment I get from doing certain tasks well at work, being with my partner and my pets. Writing too, but the depression makes me lazy, and makes my writing feel pointless. I’ve opted not to have kids because I can’t bear to inflict this burden on them. I wish I could enjoy life more but it just feels like a rat race I didn’t ask to be in.",
      "created_utc": 1739945495.0,
      "score": 107
    },
    {
      "id": "mdkexki",
      "body": "You have to remember, what you see is not always what you get.  Many more people have some form of depression they just hide it well.  I am scared to death of running out of my meds for fear I will feel like killing myself.",
      "created_utc": 1739942352.0,
      "score": 39
    },
    {
      "id": "mdl9f7f",
      "body": "Yes this blows my mind. I've been depressed since a young child and I've been taking antidepressants since I was 11. I'm 33 now and I've needed therapy for the last 20 years. My entire life has been spent trying to heal and get better. I work incredibly hard to just function day to day. The idea that people just roll out of bed and go about their day with no support/meds/therapy I just can't comprehend. I'm here constantly struggling to battle off the symptoms and trauma, while preventing myself from being triggered. It's rough.",
      "created_utc": 1739959267.0,
      "score": 36
    },
    {
      "id": "mdkdjyp",
      "body": "I feel this so much. This is me",
      "created_utc": 1739941741.0,
      "score": 29
    },
    {
      "id": "mdl3br1",
      "body": "yeah i was just thinking about that yesterday. life is probably not easy for most, but to most people it is worth it. like wtf ????? you look forward to things? and like, enjoy stuff? HOW",
      "created_utc": 1739955596.0,
      "score": 17
    },
    {
      "id": "mdkgwfp",
      "body": "I recently just got diagnosed with a mood disorder which could be the underlying cause of my depression. This is like my 5th doctor who actually took my “what am I supposed to feel like to know if my meds are working” question seriously. Tried so many different meds trying to feel better because I still struggle doing the “simple” things to survive like eating, showering, brushing my teeth, going to work, any motivation at all, etc. I’m appreciative that it’s becoming less taboo to talk about and it’s easier to find others who can sympathize and empathize, but people who don’t know the struggle just can’t comprehend how discouraging and disabling it can be.",
      "created_utc": 1739943258.0,
      "score": 17
    },
    {
      "id": "mdknhes",
      "body": "Depression sucks, it just eats away at you. I know that I do have bad OCD which is really irritating but depression is the worst feeling though. Suicidal thoughts suck too, I just feel like I can't snap out of it, I feel like I'm existing but not living.",
      "created_utc": 1739946499.0,
      "score": 27
    },
    {
      "id": "mdkf3rv",
      "body": "Im single with old parents who take care of me. If life turns sour, I will have to one day take care of myself with whatever low quality work or my family business solo and cook my own food whether I like it or not",
      "created_utc": 1739942430.0,
      "score": 10
    },
    {
      "id": "mdl2b0x",
      "body": "I had the same thought the first time my meds kicked in. I didn't feel that much better mood-wise but I had energy. And I was like - people live like this??? They get out of bed in the morning and go about their day? They do stuff all day long? Just like that??? It was marvelous! It only lasted 3 days but I still remember it!\nAlso, I bonded over this thought with a friend of mine who was finally diagnosed with severe ADHD at 25. She had the same feelings when she got her meds - 'that's how people live???'.",
      "created_utc": 1739954969.0,
      "score": 7
    },
    {
      "id": "mdlc348",
      "body": "I'm the same and even though I know this happens because my brain isn't functioning properly, it still baffles me how a lot of people just wake up in the morning and are like \"okay\" and I'm \"damn I didn't die in my sleep tonight either\"",
      "created_utc": 1739960841.0,
      "score": 9
    },
    {
      "id": "mdk9ks8",
      "body": "Life isn’t fair, never will be",
      "created_utc": 1739940027.0,
      "score": 16
    },
    {
      "id": "mdm6keb",
      "body": "The first time someone asked me \"when was the last time you were happy?\" I straight up didn't know how to respond. When I'm doing okay, my mood at best is \"neutral\" or \"content\" if I'm doing well. It still boggles my mind that people just wake up ready to start their day. I think that has happened to me a handful of times in my adult life.",
      "created_utc": 1739974233.0,
      "score": 8
    },
    {
      "id": "mdlhmbl",
      "body": "I'm doing my best to not think this way but I often think that life is too long. People say life is too short but I think it's way too long. We have so many protections from fatality that we've developed for our survival. I don't want to live a very long life if I'm not going to enjoy it, so I pray things change so that I'll want to live a long life and enjoy it. It's strange because sometimes I think I'm also afraid to die, even though I used to wish for it.",
      "created_utc": 1739963974.0,
      "score": 6
    },
    {
      "id": "mdljqlg",
      "body": "Honestly, same. This is so true when you put it like that. It’s also isolating because as much as people say they’re ‘for mental health awareness’ and ‘compassion’ etc. these days, it’s actually incredibly difficult to meet partners who do truly accept you in the more difficult patches. \n\nI honestly thought I’d met my safe person and finally let my guard down and showed total vulnerability not fearing she would leave, but the one time I needed her to be patient with me and reassure me of her commitment in the face of potential future difficulties, she just walked away like it was nothing and never looked back. It just re-affirmed my own depression and everything my brain tells me about myself. I don’t think I’ll ever be able to be so trusting or show my true fears and vulnerability to another person again to be honest.",
      "created_utc": 1739965091.0,
      "score": 5
    },
    {
      "id": "mdqjxrr",
      "body": "The idea that there are people who enjoy life / don't want to die is beyond crazy to me ",
      "created_utc": 1740019930.0,
      "score": 5
    },
    {
      "id": "mdkxi7x",
      "body": "Like how are people just sometimes ‘happy’ I know it’s easy to fake as I can sometimes do it but they never talk about just wanting to disappear? It’s odd to me",
      "created_utc": 1739952075.0,
      "score": 5
    },
    {
      "id": "mdl0vm9",
      "body": "And normal people get so put off, and have this distinct look on their face when you share your perspective, although I’m not sure how to describe it, but it makes me never want to speak again. \nYou can also just tell by their reaction to mental illness that they don’t understand it well enough to help. No one truly cares about your struggles, how could they? It’s all very disheartening, being misunderstood and stigmatized",
      "created_utc": 1739954097.0,
      "score": 3
    },
    {
      "id": "mdlj1on",
      "body": "God I feel this in my soul",
      "created_utc": 1739964730.0,
      "score": 3
    },
    {
      "id": "mdlle5z",
      "body": "I do faintly remember a time where I felt better. I had the energy to do things. I had so much energy!\nI didn't feel equally exhausted after things I love to do and things I have to do.\nAt times I could genuinely feel things and even love life. \nI didn't have to pretend to be a human being, I was. I had hobbies, friends, a job. I loved travelling, singing and making everyone laugh.\nHaving to fight everyday just to stay alive is demoralising.",
      "created_utc": 1739965929.0,
      "score": 4
    },
    {
      "id": "mdnw8o5",
      "body": "Agreed, I’ve had depression for my whole life as well as anxiety and OCD, and I can’t remember a time when I was truly happy and carefree, and I’ve thought about ending it all every day for years. I just can’t connect with others and it is kind of hard to believe there are so many people who have such an easy time with life, I can’t relate, and I really don’t know why I go on sometimes.",
      "created_utc": 1739991597.0,
      "score": 3
    },
    {
      "id": "mdo7hgm",
      "body": "To be fair, there are literally millions of us. It’s just a small portion when it’s put in the context of the entire world",
      "created_utc": 1739994613.0,
      "score": 3
    },
    {
      "id": "mdqxti0",
      "body": "i get u so much, it’s crazy to me how not everyone has come to the realization of the absurdity of everything",
      "created_utc": 1740025021.0,
      "score": 3
    },
    {
      "id": "mdrgsiw",
      "body": "It would have been interesting to experience this life without depression",
      "created_utc": 1740033681.0,
      "score": 3
    },
    {
      "id": "mdljjpu",
      "body": "I also find it hard to believe that not everyone takes an hour to pry/will themselves outta bed in the morning, just to become so exhausted from making coffee and toast, that they then slide down to the kitchen floor to recover (then have pry/will themselves to stand back up and \\*do something\\*).",
      "created_utc": 1739964991.0,
      "score": 4
    },
    {
      "id": "mdlbw5j",
      "body": "I suffer chronic pain and when I’m told not having pain is normal I can’t fathom it. I truly cannot tell you a time when I was not in some pain. As a kid and early adult it was due to being a competitive athlete who occasionally got injured but always over trained because that’s what I was told to do to be the best. Then I was injured and since that day just a couple of months after turning 30 (now in my 40s) I haven’t had one day without pain. In turn no days without thinking i wish I hadn’t woken up today",
      "created_utc": 1739960724.0,
      "score": 2
    },
    {
      "id": "mdm2df3",
      "body": "I always have this moment of confusion when I hear someone say they don't live with anxiety or depression or some other kind of suffering. I've been mentally ill since childhood and can't imagine another way of living.",
      "created_utc": 1739972804.0,
      "score": 2
    },
    {
      "id": "mdq4ysu",
      "body": "It surprises me as well. How does everyone not feel this way? Makes me feel more alone. But after 20+ years I am used to it. Just waiting until my mom passes then I'm out!",
      "created_utc": 1740014810.0,
      "score": 2
    },
    {
      "id": "mdra6tc",
      "body": "Yeah it’s often hard for me to realize that most people are motivated and enthused about doing things .. they want to get up early and do things and plan vacations. Or go see people .. this is difficult because when I go around people I see that people are like this and it makes me feel even worse \n\n  \n  I remember a year or so ago I helped put an  older neighbor - he is 62 and his friend was over and he was around the same age. We sat around and talked and they had more energy and enthusiasm that I think I’ve ever had. Not a good feeling folks\n\n\n\n  it’s no wonder why i isolate",
      "created_utc": 1740030343.0,
      "score": 2
    },
    {
      "id": "meguube",
      "body": "I forget too. I've been like this for so long that I don't even know who I am anymore or remember what it's like to have clear goals. \nJust getting up and taking care of myself a little is already an achievement, but for others it is simply being lazy. \nMy mother understands me a little but my father flatly denies that he has depression simply because he doesn't want to accept it and that's why he hurts me every time he talks to me because apparently I don't try\nI am not working at the moment because my boss harassed me and I had anxiety attacks when I went to the office for the same reason and now I am afraid to ask him for money to go to the psychologist.  And the bad thing is that I need medication but since I can't pay for a consultation with a psychiatrist, I can't get it.. ",
      "created_utc": 1740371976.0,
      "score": 2
    },
    {
      "id": "mdlj7a6",
      "body": "I guess everybody feels depression in their lives to some extent, but they often have a good way of masking it.",
      "created_utc": 1739964810.0,
      "score": 1
    },
    {
      "id": "mdmiqgy",
      "body": "I'm sure it's somewhat common, but many have the luck and the resources to easily mitigate their situation",
      "created_utc": 1739978102.0,
      "score": 1
    },
    {
      "id": "mdoixwh",
      "body": "There was a time before my injury when I was happy. Feels like it was a dream, it's been so long. I just exist now. Nothing feels right. No energy. No passion. No purpose. I watch people living their normal lives and wonder how much of it is a mask to cover up their own emptiness.",
      "created_utc": 1739997667.0,
      "score": 1
    },
    {
      "id": "mdpnxj3",
      "body": "It’s wild I agree",
      "created_utc": 1740009332.0,
      "score": 1
    },
    {
      "id": "mdq5jy3",
      "body": "Well, that’s a sucky reality check. How do you forget? Let’s have more of that…",
      "created_utc": 1740015005.0,
      "score": 1
    },
    {
      "id": "mdqf59l",
      "body": "Honestly, my depression is probably related to my chronic illness (thyroid issues). Can’t afford anything since I’m heavily and financially dependent on my mom and I’m from a 3rd world country. I honestly still get out of bed. If the weather is good and I have extra energy and motivation, I walk my dogs. The only thing stagnant in my life and staying in the comforts of my bed is not attempting to job hunt at all. I was motivated when I earned around 80-120$ doing freelance ESL 2-3 years ago, all I do is listen to people’s reading, correct pronunciation, and converse with them. I was able to socialize online at least. Work went under and I’m too scared to move (too complicated for my pea sized brain now)",
      "created_utc": 1740018254.0,
      "score": 1
    },
    {
      "id": "mdraxv7",
      "body": "Depression used to be classified into two different disorders, one was a more low affect disorder and if you account for this and look into the research of it you would find many people according to the earlier versions of the DSM would be labeled as having a general low mood disorder thus making the %’s of many more of the populace in the West having more mild to moderate depressive like symptoms. \n\nLike if you combine all the mental health disorders, general stress, physical health issues (mostly due to all the harmful chemicals in our food), trauma or just existential malaise or feelings of isolation/general meaningless etc. When you put it all together and follow the trend of ever increasing anxiety rates and just general unhappiness (not categorical and clinically diagnosed MDD) you would see we are overall probably more unhealthy in mind body and spirit than many of us realize.",
      "created_utc": 1740030707.0,
      "score": 1
    },
    {
      "id": "mdrr4b2",
      "body": "Same! I forget that some people spring out if bed every morning. I have trouble getting out if bed and being motivated to do anything.",
      "created_utc": 1740039587.0,
      "score": 1
    },
    {
      "id": "mdrua76",
      "body": "In my experience it seems somewhat common. Half of the people at the hospital my sister works at are on antidepressants.",
      "created_utc": 1740041528.0,
      "score": 1
    },
    {
      "id": "mdrwkzz",
      "body": "It's sad as a behavioral health worker I relate to my clients more than I ever did my school or work peers. I am a late in life autistic however and masked my way through my BA, and nearly ten years in the field before I failed spectacularly. Chunked my masters clinical (never got one) and got fired from dream job (was really a nightmare). \n\nIt's difficult to exist, let alone without any substances, especially with cptsd and borderline stuff. When you are educated and have enough work experience to know the deck is stacked against you just when it comes to surviving, you just try to get through day by day. My advice for clients to cope is stuff I use myself on a daily basis. Workers pound the idea of coping skills for a reason. Music, films and gaming have saved my life several times over.",
      "created_utc": 1740042935.0,
      "score": 1
    },
    {
      "id": "mdrwlaz",
      "body": "I know right it must be so great",
      "created_utc": 1740042940.0,
      "score": 1
    },
    {
      "id": "me2385j",
      "body": "Episodes of major depression and dysthymia are common, intractable depression is not and usually presents with comorbid psychiatric conditions",
      "created_utc": 1740172240.0,
      "score": 1
    },
    {
      "id": "melw7ih",
      "body": "I remember the minute I experienced depression and realised what it was. Life has never gone back, and I can't change it. It was a sad realisation I had. Only at 18, and I know some people experience it a lot younger but truly ruin me. I wish I never got to that stage, and the reason was my family. How horrible is that, they cause us trauma and he'll and we are responsible for fixing our wounds 😢",
      "created_utc": 1740439403.0,
      "score": 1
    },
    {
      "id": "mdkitb5",
      "body": "Agreed. I also think that there is a lot of people who are completely unaware of how they are truly feeling. They aren’t depressed because they refuse to acknowledge how they feel I think. Idk though. Either way, can’t relate.",
      "created_utc": 1739944168.0,
      "score": 69
    },
    {
      "id": "mdqjjoe",
      "body": "Toxic positivity is the root of all pain and suffering, in my opinion. At least when you’re pessimistic, if something doesn’t work out, you can shrug it off and go about your day. On the other hand, toxic positivity can leave you feeling worse. It creates unrealistic expectations and makes you feel guilty for having negative emotions. Instead of acknowledging and processing your true feelings, you’re forced to put on a happy facade. This is why I choose to live in reality and detach from all desires and expectations. Ironically, this is the Buddhist way",
      "created_utc": 1740019790.0,
      "score": 11
    },
    {
      "id": "mdrccrw",
      "body": "  Yes I hear you. A huge problem with depression is relating to others. I force myself through most days, I have very low if any enthusiasm for daily things, I don’t take vacations and relationships are too much work. I go around others and they often seem like a different species - I just cannot relate to them. \n\n  And yes I do think many hide their depression or anxiety",
      "created_utc": 1740031394.0,
      "score": 5
    },
    {
      "id": "mdq784l",
      "body": "Oh! I know this persona and I didn’t know it was toxic. I wish I could have a positive outlook on everything… although, I acknowledge recent events make our lives suck. I am looking for hope and financial means to support childcare.",
      "created_utc": 1740015572.0,
      "score": 1
    },
    {
      "id": "mdnuwp5",
      "body": "[removed]",
      "created_utc": 1739991239.0,
      "score": 2
    },
    {
      "id": "mdkmcqy",
      "body": "Yeah that’s why I never had kids either",
      "created_utc": 1739945915.0,
      "score": 16
    },
    {
      "id": "mdrcsmy",
      "body": "I hear you. I no longer look  at old  pictures as it shows me a young version of me that actually had a little hope, energy and enthusiasm .. back then I thought life would be much different than it really is.\n\nI also mostly keep to myself as I find it damn near impossible to relate to others.\n\n  \n  Btw you should be thankful in that you have the ability to have a partner in your life - that just is not in the cards for me with the way my disorder shows itself \n\n  \n  And yeah I decided a long time ago that there’s no way I’d have kids and risk passing whatever I have onto them.",
      "created_utc": 1740031613.0,
      "score": 7
    },
    {
      "id": "mdncbyw",
      "body": "I don't think you have depression. I think this system makes us depressed.",
      "created_utc": 1739986265.0,
      "score": 9
    },
    {
      "id": "mdljycc",
      "body": "Oh that is a huge fear of mine too.",
      "created_utc": 1739965204.0,
      "score": 7
    },
    {
      "id": "mdp3v8t",
      "body": "I know for a fact that without my meds, my own body would kill me! \nI'm just waiting for that \"everything is even more fucked\" moment and I might give it a try.",
      "created_utc": 1740003284.0,
      "score": 1
    },
    {
      "id": "mdlkdvz",
      "body": "I see you. Keep up the good work.",
      "created_utc": 1739965425.0,
      "score": 7
    },
    {
      "id": "mdrdekn",
      "body": "Yeah that’s one of the things I notice when I’m around others - they actually have enthusiasm to do things and plan vacations. They actually get enjoyment out of life .. I don’t",
      "created_utc": 1740031919.0,
      "score": 3
    },
    {
      "id": "mdlkb9j",
      "body": "When I am taking the right medication, after a couple weeks I start to feel “normal.” Like, just not despairing.\n\nI put it in quotation marks because it’s a weird feeling for those of us who have had mental health struggles for decades. But I love that feeling, it’s like OH MY GOSH IS THIS WHAT NORMAL FEELS LIKE?!",
      "created_utc": 1739965388.0,
      "score": 4
    },
    {
      "id": "mdkm8on",
      "body": "OMG me too me too me too!!! Except vi I don’t know what I have except TRD or maybe BPD-2",
      "created_utc": 1739945857.0,
      "score": 1
    },
    {
      "id": "mdrd5wc",
      "body": " It’s destroys your soul . Zaps your energy and makes it impossible to relate to others .",
      "created_utc": 1740031798.0,
      "score": 5
    },
    {
      "id": "mdpygkt",
      "body": "Why did it only last 3 days, if I may ask?",
      "created_utc": 1740012677.0,
      "score": 1
    },
    {
      "id": "mdq1dun",
      "body": "This! Let's say you're experiencing what, in theory, should be the best day of your life. But when you have depression, at the end of the day, you’ll just be like 🤷‍♀️ And when you look back, it’ll feel like just another day, no different from the rest. So when someone asks you about genuine happiness, best memory etc. you won’t pick that one, even though, objectively, you should, because anyone without depression would. But to you? It’s just another day.",
      "created_utc": 1740013625.0,
      "score": 2
    },
    {
      "id": "mdrdwei",
      "body": "Yeah I have to get a really hard workout in just to begin to feel some type of normalcy .. even then I still don’t feel right but it’s better than being in that dark cloud",
      "created_utc": 1740032168.0,
      "score": 1
    },
    {
      "id": "mdrdsfc",
      "body": " Yeah I hate to say it but if you are a guy with depression and anxiety, it makes it much harder to attract women and keep them around. In all my experience, women want a man that is confident, enthusiastic and upbeat - they don’t want to have to be the ones that help prop their man up .they expect their man to be strong . I’m not saying all women are like this but a majority are.",
      "created_utc": 1740032111.0,
      "score": 2
    },
    {
      "id": "mdo3qd8",
      "body": "I know exactly what you mean. I had pretty good reflexes and a sharp mind. I could actually keep up with stuff but now it’s too much effort to think and understand. The lack of vitality makes me all sluggish. Now, I have to fight for every single “win” that comes my way. It’s incredible just how much effort I have to put in to meet minor milestones. It’s rough!",
      "created_utc": 1739993608.0,
      "score": 3
    },
    {
      "id": "mdl1dzi",
      "body": "Y'know, I probably spend more time thinking about this than I should, but I sometimes think that there's nothing actually wrong with us, we just see life and the world for what it is, and it's the rest of the people who are wrong and almost delusional. I've been depressed since childhood though, I can't imagine life without it, frankly.",
      "created_utc": 1739954409.0,
      "score": 59
    },
    {
      "id": "mdphhcx",
      "body": "Their is also the ones that push everything deep down.",
      "created_utc": 1740007286.0,
      "score": 3
    },
    {
      "id": "mdqog0g",
      "body": "Word.",
      "created_utc": 1740021518.0,
      "score": 2
    },
    {
      "id": "mdobg8p",
      "body": "Whatever will answer, man",
      "created_utc": 1739995672.0,
      "score": 16
    },
    {
      "id": "mdwg90p",
      "body": "Honestly it’s a chant lmao. “God if ur real don’t let me wake up”. God being literally anything/one that’ll answer",
      "created_utc": 1740096764.0,
      "score": 2
    },
    {
      "id": "mdkn49w",
      "body": "Can barely look after myself and life’s just getting more and more expensive.",
      "created_utc": 1739946310.0,
      "score": 30
    },
    {
      "id": "mdltqrl",
      "body": "🥹❤️",
      "created_utc": 1739969606.0,
      "score": 3
    },
    {
      "id": "mdknl0b",
      "body": "Yeah she didn’t specific which since it was just the first meeting. So we are trying a mood stabilizer with my current antidepressant and going to talk more next month. I’m hopeful this helps and at least I have found a doctor willing to listen and help me.",
      "created_utc": 1739946552.0,
      "score": 1
    },
    {
      "id": "mdupl4p",
      "body": "Yes and I feel like you can't be depressed around others because they tell you to \"Wise up.\" and \"What's there to be sad about?\". I hate having to fake smile and pretend I'm happy just to keep others happy.",
      "created_utc": 1740078649.0,
      "score": 1
    },
    {
      "id": "mf5bhaj",
      "body": "I wanna know too!  Same thing has happened to me a few times, I'm always so disappointed when they end up not working as well anymore :/",
      "created_utc": 1740693803.0,
      "score": 1
    },
    {
      "id": "mdrey1n",
      "body": "I wouldn’t call it a majority, but yeah, there’s definitely a lot of people that don’t have empathy for depressed people.",
      "created_utc": 1740032700.0,
      "score": 1
    },
    {
      "id": "mdljv1b",
      "body": "That’s depressive realism, the theory where we see the world more accurately as it is due to our negative biases. As I get older, I tend to believe this more and more.",
      "created_utc": 1739965156.0,
      "score": 30
    },
    {
      "id": "mdrciav",
      "body": " Yeah that’s your depression lying to you though. It’s a sneaky sob in that way",
      "created_utc": 1740031469.0,
      "score": 3
    },
    {
      "id": "mebh40n",
      "body": "Read something the other day along the lines of: I am not depressed, I am accurately responding to the world around me. \n\nYou’re very much correct. ",
      "created_utc": 1740304330.0,
      "score": 3
    },
    {
      "id": "mdwfw9b",
      "body": "YES. Sometimes I look at others and think how can you be so naive to life. It’s mind boggling.",
      "created_utc": 1740096650.0,
      "score": 1
    },
    {
      "id": "mdqjx0q",
      "body": "This is what drove me to atheism Lmaoo. You can only pray so much before you realize things won’t get better. At first it was praying for happiness, then death, then… yeah fuck this shit  ✌️",
      "created_utc": 1740019923.0,
      "score": 7
    },
    {
      "id": "mdokv09",
      "body": "[removed]",
      "created_utc": 1739998175.0,
      "score": 3
    },
    {
      "id": "mdmapa6",
      "body": "I have never seen it put into words, the way I feel. \nThe way I have felt for 30+ years. I am grateful to have healthier tools now to “manage” the depression and my life, than I had back then. Hope you’re using all the healthy tools.",
      "created_utc": 1739975593.0,
      "score": 4
    },
    {
      "id": "mdmj9oe",
      "body": "Fair enough.   Idk if it's so much of a negative bias for me, but just trying to see things for what they are without labeling them as good or bad.  I do (spiritually) believe in a balance of things, so therefore, every \"evil\" in the world means there is an equal \"good\".\n\nSo when reeeeally bad shit goes down, I do believe that somewhere in the world, reeeeeally good shit is also going down.  But what news is reporting all the good stuff?  Especially when everyone has a unique perspective of what good and bad are?  Good and bad are human labels anyways, so is there even good or bad in the world?  Idk",
      "created_utc": 1739978260.0,
      "score": 7
    },
    {
      "id": "mdol0af",
      "body": "Yeah, that's the big secret they don't tell you; 99.99% likely no one actually gets a visit from a deity",
      "created_utc": 1739998214.0,
      "score": 3
    },
    {
      "id": "mdmp54m",
      "body": "Absolutely! I've come a really long way and I'm proud of my progress but some days it feels so heavy! It's tiring with how hard I have to try, but giving up is not an option! We can't let it win! 😄",
      "created_utc": 1739979948.0,
      "score": 4
    },
    {
      "id": "mdprkdf",
      "body": "It is tiring. I agree with you!",
      "created_utc": 1740010475.0,
      "score": 3
    }
  ]
}