{
  "id": "1i3dpw4",
  "title": "Addicted to bed rotting",
  "selftext": "I genuinely want to bed rot for the rest of my life and i don’t see any problem with it. I don’t want to work i don’t want to study i don’t want to see anyone i don’t want to do anything i just want to stay in my bed forever until i die.",
  "created_utc": 1737110902.0,
  "score": 1639,
  "num_comments": 157,
  "url": "https://www.reddit.com/r/depression/comments/1i3dpw4/addicted_to_bed_rotting/",
  "comments": [
    {
      "id": "m7lyp8o",
      "body": "sounds like me 😭😭 I'm bed rotting from 2yrs since I'm homeschooled. all i do is scroll through social media and play games. it sucks tho makes me depressed but I'll be homesick after this.",
      "created_utc": 1737111646.0,
      "score": 384
    },
    {
      "id": "m7m4vpq",
      "body": "[removed]",
      "created_utc": 1737115050.0,
      "score": 310
    },
    {
      "id": "m7m79j7",
      "body": "I spend way too much time in bed with the covers over my head. We keep our bedroom cold and I work evenings 3 days per week. Another thing about bed is it feels timeless ( or I connect it with a younger time due to trauma). I'm 62 but feel 15 in bed",
      "created_utc": 1737116200.0,
      "score": 140
    },
    {
      "id": "m7m4ptz",
      "body": "i feel you. i go back and forth between being comfortable bed rotting and being anxious about my future when i’m jobless with no money and no parents to keep a roof over my head and fed. i feel so comfortable just staying in bed 24/7 and i have no motivation to get myself together. feels like i have nothing to live for except for the fear of my future if i continue like this.\n\ni don’t want to work and jobs don’t want me so i do nothing.",
      "created_utc": 1737114970.0,
      "score": 179
    },
    {
      "id": "m7m0605",
      "body": "It makes sense. Usually our beds are comfortable and make us feel very safe. \nOutside of your bed though there’s some pretty great things out there. Depression can skew our thoughts and make everything seem pointless. I remember in the worst of my depression I’d feel really heavy so didn’t exactly feel like being active. I wanted to just do nothing too until I died.\nI’m glad I started to do things and now mid 30s my life is very different.",
      "created_utc": 1737112506.0,
      "score": 102
    },
    {
      "id": "m7mnivr",
      "body": "That’s all i do every day and it’s so hard to even get up and shower",
      "created_utc": 1737122658.0,
      "score": 33
    },
    {
      "id": "m7m4891",
      "body": "[deleted]",
      "created_utc": 1737114724.0,
      "score": 24
    },
    {
      "id": "m7mab2q",
      "body": "Yeah me too especially during winter when it feels so nice and warm to stay under a blanket all day. Sometimes I do feel like I should do something but I can never figure out what exactly it is that I want to do so I always just end up doing nothing again.",
      "created_utc": 1737117593.0,
      "score": 25
    },
    {
      "id": "m7mjvlk",
      "body": "Making us all shirts that say I ❤️ bedrotting",
      "created_utc": 1737121363.0,
      "score": 17
    },
    {
      "id": "m7nfsy8",
      "body": "How is your muscle tone? The reason I’m asking is because I behave similarly. When I do have to be upright, to do a chore or see the doctor, for more than a couple of hours, my legs and back hurt so much. I’m worried that I am causing atrophy in my muscles because of “bed rotting “. That’s such an accurate term, for how I feel. 🌊",
      "created_utc": 1737131407.0,
      "score": 15
    },
    {
      "id": "m7m47de",
      "body": "You should read the book my year of rest and relaxation",
      "created_utc": 1737114712.0,
      "score": 25
    },
    {
      "id": "m7nb9pz",
      "body": "Same, instead of bed rotting I do chair rotting. Usually when I eat. Just sit there and scroll phone for the whole afternoon/night. Usually the food becomes cold and I have to reheat it several times.",
      "created_utc": 1737130102.0,
      "score": 10
    },
    {
      "id": "m7nq09n",
      "body": "Relatable af. Everyday i try to find a reason to not want that. Or to want literally anything else than that. It never goes far. Why would we want to make efforts ??? The only possible reason is if you have loved ones who care and are hurt by your state. But it doesnt make it any less of an effort and just feels like a burden. Makes you feel guilty and shameful and pressured and even gets to ressentment. Its the worst to have people who expect you to love doing things and enjoy living. They dont understand how you could want to be comatose forever. But its just so much more comfy and easier. Why wouldnt we want comfy and easy???",
      "created_utc": 1737134337.0,
      "score": 8
    },
    {
      "id": "m7mbkop",
      "body": "Had surgery 10 weeks ago. I’m wondering if it exacerbated my depression and tendency to seek bedrotting. The last two weeks I really should be doing more but I get so depressed and tired I do very little then am in bed by mid afternoon. It’s not good and a horrible cycle.",
      "created_utc": 1737118138.0,
      "score": 8
    },
    {
      "id": "m7q3vqy",
      "body": "Ppl are always like, \"Think of all the wonderful things in life to do and celebrate, what would you like to be able to dedicate more time to? What are your hobbies and interests\" And I'm like \"uh I don't have any, there's nothing I want to do\" and then they just stare at me blankly.",
      "created_utc": 1737160604.0,
      "score": 8
    },
    {
      "id": "m7o24di",
      "body": "That’s how I feel. The only thing that helps me is being asleep so I don’t have to wait for death while awake. I wish I could force sleep but I don’t know how. Mass qty of alcohol is not an option for me. Unfortunately, I have responsibilities and have to survive my birthday to work my job and pay for shit for everyone else living here needs. FML. I fucking HATE my life.",
      "created_utc": 1737137809.0,
      "score": 6
    },
    {
      "id": "m7mx4rr",
      "body": "This sounds like a depressive episode..chances are you will die from lying in your bed are very low..don’t be ashamed to reach for help..depression lies to us and mends the truth of the world in our heads so it seems like everything has ended..dare to challange that voice in your head and question if it is telling you the truth..not all the voices in our heads work in our favor and depression is a liar!!",
      "created_utc": 1737125852.0,
      "score": 4
    },
    {
      "id": "m7pz9lm",
      "body": "I lived through it for 3 years, for 3 years I didn't leave my room",
      "created_utc": 1737159017.0,
      "score": 5
    },
    {
      "id": "m7oulgy",
      "body": "Same \n\nI love watching my peers on social media like it’s a soap opera, i always end up thinking “man i sure have it easy not raising a family or having to be more responsible than im capable” \n\n\nThen i go back to sleep, unbothered\nIt’s one of the few times of the day where im truly not bothered by clueless people that make a hobby out of trying to put me down. Imagine trying to belittle a eepy sleepy guy like me. \n\nIdc tho i sleep 💤",
      "created_utc": 1737146128.0,
      "score": 4
    },
    {
      "id": "m7pbbu4",
      "body": "I feel this DEEPLY🩷💕🫶",
      "created_utc": 1737151141.0,
      "score": 3
    },
    {
      "id": "m7qaip6",
      "body": "I've been bed rotting for five years and yeah it is addictive but once you go out sometimes I forget how nice feels to talk to people, the thing is that I have no friends :)",
      "created_utc": 1737162943.0,
      "score": 4
    },
    {
      "id": "m7lz7ns",
      "body": "Ya but have at least changed your sheets?",
      "created_utc": 1737111952.0,
      "score": 8
    },
    {
      "id": "m7m0gg1",
      "body": "I am the same way. I get into the habit of doing it for days in a row only getting up to go to the bathroom or take care of my kids but then it's right back to bed rotting and doom scrolling. Sometimes my kids will come and \"rot\" with me while we watch a movie. I'm trying to get my meds sorted so I don't do this though.",
      "created_utc": 1737112675.0,
      "score": 7
    },
    {
      "id": "m7qq7ar",
      "body": "I loveee bed rotting. I start getting overwhelmed if I don’t get sufficient time to rot lol",
      "created_utc": 1737168744.0,
      "score": 3
    },
    {
      "id": "m7r75gv",
      "body": "Do you live somewhere that you can step outside and get some sun? You can even sit outside on your phone as a baby step. And then maybe you can sit outside and just enjoy the silence or nature watching or people watching. Then graduate to going on short walks and progressively add distance, etc. You’ll start to gain more and more energy over time.",
      "created_utc": 1737175733.0,
      "score": 3
    },
    {
      "id": "ma52gi6",
      "body": "I feel my rotting getting worse with time, I have said no to hanging out with so many of my friends because all I want to do is rot. I feel like I’m just withering away in my room while the world just zooms by me. The worst part of my rotting is that I have an entire house that I pay for that I don’t rot in… I stay at my parents house in my childhood bedroom with my stuffed animals and heated blanket. Idk how I got stuck here, but it feels so safe. I want to be the version of me I remember, but it feels like trying to move mountains to be out of my bed for 15 more minutes a day. ",
      "created_utc": 1738296419.0,
      "score": 3
    },
    {
      "id": "m7mmkw0",
      "body": "Feels like that is what I'm currently doing, rotting away on my bed",
      "created_utc": 1737122325.0,
      "score": 2
    },
    {
      "id": "m7n5vpb",
      "body": "This is so relatable. I just wanna eat snacks and binge movies.\n\nIt was weirdly comforting in a way.",
      "created_utc": 1737128525.0,
      "score": 2
    },
    {
      "id": "m7nwanx",
      "body": "Ohh, exactly like me. :( ..Yeah, i get it, sometimes the idea of just staying in bed seems like the only thing that make sense. But, i really know deep down, i know that it's not the best for me lonG term.. I really feel for you, but staying in that spot forever isn't healthy.. I hope we can find little ways to break this kind of cycle..",
      "created_utc": 1737136146.0,
      "score": 2
    },
    {
      "id": "m7oupe5",
      "body": "This is so real like I don't have any hobbies or dreams because I don't wanna do anything like how do we stop this??? If i could I would but in this economy? 👹",
      "created_utc": 1737146161.0,
      "score": 2
    },
    {
      "id": "m7qgxe8",
      "body": "Any of you saying that you want to do nothing your whole life trust me you don’t. Maybe you want to but the depression will only get worse until you get exercise and get out and talk to people. Trust me I wasted 5 years of my life and there’s no point to wallowing in misery why live like that",
      "created_utc": 1737165263.0,
      "score": 2
    },
    {
      "id": "m7uiyfq",
      "body": "I agree. Being slumped in bed all day and being able to enter deep states of sleep are the only thing that brings me satisfaction.",
      "created_utc": 1737227283.0,
      "score": 2
    },
    {
      "id": "m7nhvpg",
      "body": "The simulation is coming to an end ppl. Some day in the near future the ai hyper intelligence will take over return us to our origin as a collective ball of sentient energy floating through space and the cycle will restart. So we have that to look forward to. Lol.",
      "created_utc": 1737131998.0,
      "score": 2
    },
    {
      "id": "m7mky2c",
      "body": "I relate to this so hard but unfortunately my life forces me to get out of bed and do something against my will 💀",
      "created_utc": 1737121747.0,
      "score": 1
    },
    {
      "id": "m7mm5ju",
      "body": "Relatable af",
      "created_utc": 1737122176.0,
      "score": 1
    },
    {
      "id": "m7npbtw",
      "body": "Wish I could",
      "created_utc": 1737134139.0,
      "score": 1
    },
    {
      "id": "m7p2sfn",
      "body": "I haven’t been able to get out of bed for 3 days. Compounded with my ED, I don’t even have any strength to do so. Headaches up the ass",
      "created_utc": 1737148576.0,
      "score": 1
    },
    {
      "id": "m7pamfg",
      "body": "Same. It's at the point where I don't want to get up to even sit down at my desk to play a video game or something. Even that seems like too much and pointless to me.\n\nSleep is the only thing that helps.",
      "created_utc": 1737150928.0,
      "score": 1
    },
    {
      "id": "m7piy3w",
      "body": "Same here, don't feel like or want to do anything other than just sit in bed and mindlessly scroll on my phone.",
      "created_utc": 1737153531.0,
      "score": 1
    },
    {
      "id": "m7plx1r",
      "body": "i love bed rotting and playing video games all day even tho it disconnects me so much from reality",
      "created_utc": 1737154498.0,
      "score": 1
    },
    {
      "id": "m7pujxi",
      "body": "have you read My Year of Rest and Relaxation? She’s living my actual dream.",
      "created_utc": 1737157404.0,
      "score": 1
    },
    {
      "id": "m7pvjkw",
      "body": "Vibe. I feel exactly the same. I just want to sleep all the time.",
      "created_utc": 1737157743.0,
      "score": 1
    },
    {
      "id": "m7q1j5r",
      "body": "You should read “my year of rest and relaxation” it’s literally about a girl doing this but with sleeping meds.",
      "created_utc": 1737159794.0,
      "score": 1
    },
    {
      "id": "m7qari9",
      "body": "soooo many of the posts in here is jus complaining but this one is super real",
      "created_utc": 1737163032.0,
      "score": 1
    },
    {
      "id": "m7qeg25",
      "body": "Sorry you are hurting.  Cold swim or cold plunge has helped me get out of bed.",
      "created_utc": 1737164361.0,
      "score": 1
    },
    {
      "id": "m7qro7b",
      "body": "Hey, I’m sorry you’re going through it! But I need to thank you, this inspires me not to do what you’re going to do or what you have been doing! Come on man every human being is worth something, and you are worth something as well so get going man you got this!",
      "created_utc": 1737169295.0,
      "score": 1
    },
    {
      "id": "m7qv4qm",
      "body": "there’s just no point in doing anything else. life is so boring, especially when u fuck up anything u do",
      "created_utc": 1737170648.0,
      "score": 1
    },
    {
      "id": "m7rjf64",
      "body": "Same. I’ve had enough though and flying cross country to go to rehab for my mental health.",
      "created_utc": 1737181930.0,
      "score": 1
    },
    {
      "id": "m7rwknf",
      "body": "My feelings r just the same i just wanna stay in bed and read posts here",
      "created_utc": 1737189988.0,
      "score": 1
    },
    {
      "id": "m7srtxh",
      "body": "I feel that but you gotta find something",
      "created_utc": 1737207165.0,
      "score": 1
    },
    {
      "id": "m7w1m5i",
      "body": "Legit what I did for years. Some people need time to hibernate, just try to keep learning about life as you hibernate, it'll help in the future.",
      "created_utc": 1737244417.0,
      "score": 1
    },
    {
      "id": "m7yber7",
      "body": "This is in some ways a good thing because you are able to recognise your own feelings and have posted here perhaps to ask for advice. \n\nWork and study do indeed suck unless you find the subjects fun.\nDo you find anything fun at the moment? Genuine question. \n\nWhen I was severely depressed I didn't find anything fun until I took up Archery. It was really different to anything I was currently doing and to be honest it changed my routine up enough to help me get momentum. \n\nMomentum against depression is everything. \n\nAre there any activities you might find fun that you can do?",
      "created_utc": 1737275888.0,
      "score": 1
    },
    {
      "id": "m82dn61",
      "body": "same. i don’t care anymore and i don’t want to care. trying gets me nowhere.",
      "created_utc": 1737327422.0,
      "score": 1
    },
    {
      "id": "m84tp0w",
      "body": "i have been \"bed rotting\" for probably 5 or more years",
      "created_utc": 1737363264.0,
      "score": 1
    },
    {
      "id": "m8d6t1g",
      "body": "Também, mas a vida não nos permite ter esse privilégio, cedo ou tarde teremos que deixar nossas cavernas. O mundo é cruel, e ele não nos deixará descansar para todo um \"sempre\"...",
      "created_utc": 1737475118.0,
      "score": 1
    },
    {
      "id": "m8s7cuo",
      "body": "I've struggled with this for years. I can't function. ",
      "created_utc": 1737662601.0,
      "score": 1
    },
    {
      "id": "m9cp0vd",
      "body": "Yes me too. I have no desire to do anything. Nothing makes me happy. I just wish someone would love and care for my dogs.",
      "created_utc": 1737932447.0,
      "score": 1
    },
    {
      "id": "m7nfup9",
      "body": "Mood. Lying in a cold dark room with music and a blanket is fucking awesome.",
      "created_utc": 1737131421.0,
      "score": 1
    },
    {
      "id": "m7n1928",
      "body": "nah i’m the exact same, don’t got anywhere to go so i just sit in bed all day and only get up when i have to",
      "created_utc": 1737127128.0,
      "score": 79
    },
    {
      "id": "m7qu93j",
      "body": "Just go outside in the sun and do some exercise. Being in a room all day is not good for anyone.",
      "created_utc": 1737170304.0,
      "score": 19
    },
    {
      "id": "m7nuz7a",
      "body": "i did that, now im miserable",
      "created_utc": 1737135767.0,
      "score": 60
    },
    {
      "id": "m7q24xp",
      "body": "I've always wished that we didn't need food to live. Like sure eat it if you like food but to me it feels like a chore",
      "created_utc": 1737160002.0,
      "score": 40
    },
    {
      "id": "m7nql2r",
      "body": "Sounds like prison /s",
      "created_utc": 1737134503.0,
      "score": 18
    },
    {
      "id": "m7txo0h",
      "body": "same, i dont want to work but it wouldnt have to be in a luxury way; id gladly accept living in a tiny apartment, no possessions, eating nothing but a raw can of beans or pack of tofu for every meal, and having nothing to do and nowhere to go, if that also meant i never had to go talk to people",
      "created_utc": 1737220896.0,
      "score": 6
    },
    {
      "id": "m7mgecy",
      "body": "[removed]",
      "created_utc": 1737120078.0,
      "score": 40
    },
    {
      "id": "m7p4ib2",
      "body": "It’s not that the jobs don’t want you, it’s just that AI has taken over so much hiring and companies prefer to hire people who are exploitable and complacent. If it makes you feel any better, I was an account manager for a staffing agency and I couldn’t get hired at dollar tree.\n\nI know that’s not what this post is really about, but I’m just saying please hang in there because it’s not about you. This world is a cruel place that seeks out people who they can take advantage of. It has nothing to do with you. Nothing at all.",
      "created_utc": 1737149092.0,
      "score": 27
    },
    {
      "id": "m7mf53e",
      "body": "[removed]",
      "created_utc": 1737119590.0,
      "score": 46
    },
    {
      "id": "m7q57yd",
      "body": "too real. Hygiene and self care are such challenging and monumental tasks for me",
      "created_utc": 1737161067.0,
      "score": 11
    },
    {
      "id": "mc9hyz8",
      "body": "Same !!!! I thought I was alone !!!!",
      "created_utc": 1739312183.0,
      "score": 1
    },
    {
      "id": "m7mvja2",
      "body": "This made me laugh out loud. I totally relate! About to fall asleep is usually an awesome moment for me. I also like the moment when I'm walking from my car to work across the parking lot.",
      "created_utc": 1737125349.0,
      "score": 8
    },
    {
      "id": "mk1bp3q",
      "body": "Have you tried drugs?",
      "created_utc": 1743093181.0,
      "score": 1
    },
    {
      "id": "m7q4r1w",
      "body": "yeah I always justify staying burrowed into my bed because it's freezing out. Absolutely have no motivation to do anything and will just dissociate staring at a wall for the day",
      "created_utc": 1737160905.0,
      "score": 6
    },
    {
      "id": "m7rccqd",
      "body": "its happening to me.",
      "created_utc": 1737178196.0,
      "score": 7
    },
    {
      "id": "m7mooc0",
      "body": "What is it about?",
      "created_utc": 1737123056.0,
      "score": 9
    },
    {
      "id": "m7q5pq7",
      "body": "I used to wish that eating wasn't necessary to live. It just adds one more exhausting thing for me to do.",
      "created_utc": 1737161239.0,
      "score": 10
    },
    {
      "id": "m7mecod",
      "body": "I’m in the same exact situation",
      "created_utc": 1737119279.0,
      "score": 1
    },
    {
      "id": "m7q6dno",
      "body": "You summed up my feelings to a T",
      "created_utc": 1737161473.0,
      "score": 1
    },
    {
      "id": "m7q7xbf",
      "body": "If you don't mind me asking, did something change for that to happen? A lot of ppl who've never experienced depression are convinced that if we just magically cheer up or snap out of it we'll be \"cured\"",
      "created_utc": 1737162018.0,
      "score": 3
    },
    {
      "id": "m7qiciz",
      "body": "It's funny how some people make it a hobby to put down people who already seem down! Like try protesting in front of a powerful group of politicians, then may you have rights to feel pride!! ",
      "created_utc": 1737165786.0,
      "score": 3
    },
    {
      "id": "m853lyr",
      "body": "I highly understand where you’re coming from cuz I was stuck in this same thought pattern for months lol. But realistically, eventually you’re going to get tired of it and be filled with regret over the time you wasted. There’s just no escaping that no matter how many times you rationalize in your head that it’s okay😕",
      "created_utc": 1737369598.0,
      "score": 1
    },
    {
      "id": "mc9jc1o",
      "body": "I am currently going through the same thing. Mine is on and off some months I'm in my car non stop sun up to Sun down running Uber or Lyft other months I am in my bed non stop unless I need to use the restroom. This binge has been going on for about a month now .. how are you feeling ?? How are you coping ?? I'm 36 (f) and just don't find people to be the same and don't have friends nor a social life. Just me my kids.",
      "created_utc": 1739312574.0,
      "score": 1
    },
    {
      "id": "m7m4c60",
      "body": "Ofc not",
      "created_utc": 1737114779.0,
      "score": 26
    },
    {
      "id": "m7m42vg",
      "body": "No",
      "created_utc": 1737114649.0,
      "score": 10
    },
    {
      "id": "m7o21yb",
      "body": "I like your pfp. Weird Al, right?",
      "created_utc": 1737137791.0,
      "score": 1
    },
    {
      "id": "m7ryyhx",
      "body": "How do you get the motivation to get up and exercise or whatever, when you can't even motivate yourself to get up to eat or drink, most of the time?",
      "created_utc": 1737191517.0,
      "score": 2
    },
    {
      "id": "m8fbbn3",
      "body": "What‘a ED?",
      "created_utc": 1737496036.0,
      "score": 1
    },
    {
      "id": "m7sn7fp",
      "body": "You guys have sun?",
      "created_utc": 1737205246.0,
      "score": 10
    },
    {
      "id": "ma0trby",
      "body": "I know how much that would help but it would take beyond mountainous effort for me at this point.",
      "created_utc": 1738250797.0,
      "score": 2
    },
    {
      "id": "m7rjvi2",
      "body": "I also dislike that I must kill something to survive whether it be plant or animal, and then there’s the moral dilemma when getting mass produced food",
      "created_utc": 1737182190.0,
      "score": 12
    },
    {
      "id": "m7pvd59",
      "body": "[removed]",
      "created_utc": 1737157682.0,
      "score": 15
    },
    {
      "id": "m7ujpvy",
      "body": "That sounds like a miserable time. I wish I could function normally and go out, have meaningful conversations, have the drive and motivation and grit in order to achieve what I want, but years of depression, mood swings, drug abuse to cope, autism, ADHD, low self esteem and a lack of confidence has ruined everything. I wish I could function like the average person. What you’re talking about is the life I already live. I live at home with my mom, eat minimal amounts of food just to stay alive, I smoke weed in attempt to mitigate my psychological symptoms, sleep all day, exercise just enough to not die, and it’s fucking miserable.",
      "created_utc": 1737227515.0,
      "score": 4
    },
    {
      "id": "m7n0gln",
      "body": "Seriously I need a therapist like you! You're absolutely right. My dad had schizophrenia and when he'd get really bad I'd hide in my bedroom under the covers. I guess my inner child is still hiding there",
      "created_utc": 1737126888.0,
      "score": 24
    },
    {
      "id": "m7q0qk8",
      "body": "i’m not even applying to the 9-5 corporate type of jobs. i’ve applied to movie theatres, grocery stores, retail, restaurants, etc. jobs that don’t even need to use AI unless it’s maybe used by a manager, but these are customer service jobs that i am qualified for. i feel so stuck because in order to make money i need a job but i can’t seem to get one despite having a good resume and making cover letters. that’s why i bed rot all day i feel so defeated.",
      "created_utc": 1737159521.0,
      "score": 13
    },
    {
      "id": "m7mitja",
      "body": "You might need to try a dopamine detox, and start up a hobby at the end of the detox.",
      "created_utc": 1737120983.0,
      "score": 11
    },
    {
      "id": "m7oq2q7",
      "body": "Have you spoken to a doctor? \n\nThere’s lots of hobbies that are relativity easy. And lots of games that aren’t too challenging. But if you’re lacking motivation, energy and if things feel like too much effort it’s hard to try the hobby to start with.",
      "created_utc": 1737144769.0,
      "score": 4
    },
    {
      "id": "m7qr5dy",
      "body": "A girl who bed rots for a whole year due to extreme depression. It’s very comforting yet uncomfortable at the same time",
      "created_utc": 1737169098.0,
      "score": 6
    },
    {
      "id": "m7mjvll",
      "body": "Looks awful to like a comment that people are struggling but it helps to know you’re not alone. TY",
      "created_utc": 1737121363.0,
      "score": 2
    },
    {
      "id": "m7rwkfn",
      "body": "I experienced an attack in college...related to my ex.\nAnd today I'm 20 years old and I'm still afraid of people but I go out, I'm pregnant and with my partner I'm expecting our first child.",
      "created_utc": 1737189984.0,
      "score": 1
    },
    {
      "id": "m853s91",
      "body": "💤💤💤\n\nConk shoo conk shoo\n\n\nBeen in this sleep pattern for decades my life is actually really abundant.",
      "created_utc": 1737369708.0,
      "score": 2
    },
    {
      "id": "mc9mqa5",
      "body": "I was going to say that at least you got your kids but it must feel lonely cuz they are not old enough I guess, well how do I cope? Mainly listening to music and when it's not enough I ride my bicycle but I'm lying cuz I haven't used in weeks, I have no friends too to go out and idk just talk about anything I'm tired of superficial conversations, college is boring and the country is really depressing, can't find my type of people too I really get you.",
      "created_utc": 1739313568.0,
      "score": 1
    },
    {
      "id": "m7s56il",
      "body": "Thank you. Yes its Al",
      "created_utc": 1737195536.0,
      "score": 2
    },
    {
      "id": "m854rpv",
      "body": "It starts with baby steps. A lot of the times I got anxiety thinking about the long run and where I should/want to be, that it’ll cause me to not try at all. The goal is to be better than you were yesterday. If you went from not taking care of your hygiene try to force yourself to shower and brush your teeth everyday, and then once you’ve got that down, try making yourself a meal once a day. Eventually those small habits will snowball into bigger ones and you’ll look back at the progress you’ve made. It seems difficult right now but try to focus on the small things and eventually the bigger things will become easier :)",
      "created_utc": 1737370309.0,
      "score": 2
    },
    {
      "id": "m8fgr6c",
      "body": "Eating Disorder",
      "created_utc": 1737497515.0,
      "score": 1
    },
    {
      "id": "m832d24",
      "body": "I knew someone would say this lol",
      "created_utc": 1737335333.0,
      "score": 2
    },
    {
      "id": "mamnkto",
      "body": "Just stop thinking and move your body.",
      "created_utc": 1738533317.0,
      "score": 2
    },
    {
      "id": "m7uj2qo",
      "body": "It doesn’t have to be that way. Go vegan, you will feel better about what you eat morally",
      "created_utc": 1737227318.0,
      "score": 3
    },
    {
      "id": "m7wpmzg",
      "body": "Wait you do?",
      "created_utc": 1737252374.0,
      "score": 2
    },
    {
      "id": "m7pu1po",
      "body": "[removed]",
      "created_utc": 1737157232.0,
      "score": 12
    },
    {
      "id": "m7qevsa",
      "body": "I thought those places always need people. Are you \"overqualified\" on your resume? They might think you won't stay long or will ask for too much ",
      "created_utc": 1737164519.0,
      "score": 3
    },
    {
      "id": "m7ml9n4",
      "body": "[removed]",
      "created_utc": 1737121860.0,
      "score": 15
    },
    {
      "id": "m8fhn4h",
      "body": "I liked this book, but didn’t she have enough money to do this?",
      "created_utc": 1737497763.0,
      "score": 1
    },
    {
      "id": "mc9nk92",
      "body": "My son is 7, he takes care of momma, sadly, I try to hide it from him the best I can . Yes this day and age generation sucks! I hate going outside as it's always something stupid 😂",
      "created_utc": 1739313814.0,
      "score": 1
    },
    {
      "id": "m8c1taf",
      "body": "Lack of sun..I fainted from lack of sun..\nToday I am having attacks of anemia.",
      "created_utc": 1737460495.0,
      "score": 2
    },
    {
      "id": "maqg2ee",
      "body": "I’ve had pdd for literally half of my life and it actually can’t be fixed with diet and exercise. I’m starting on some meds tomorrow",
      "created_utc": 1738590062.0,
      "score": 2
    },
    {
      "id": "m7uoo65",
      "body": "+1\n\nI'm depressed but at least I'm not depressed about what I'm eating.",
      "created_utc": 1737229012.0,
      "score": 4
    },
    {
      "id": "m87jm9a",
      "body": "That’s a good idea, there’s still a lot of suffering that goes into veganism unless you’re growing it yourself, or buy from a trusted farmer, but significantly less than my current diet. I’ve been putting it off saying I’ll start once I grow all my own food, but it’s taking significantly longer than I expected. Do you have any good recipes?",
      "created_utc": 1737399837.0,
      "score": 1
    },
    {
      "id": "m7pvv9h",
      "body": "Thanks so much for your insight and kind words. I definitely know I have lots of work to do!",
      "created_utc": 1737157852.0,
      "score": 8
    },
    {
      "id": "m7sc33g",
      "body": "You’re an absolutely beautiful human. This was needed.",
      "created_utc": 1737199667.0,
      "score": 3
    },
    {
      "id": "m7qfvlm",
      "body": "i graduate with my bachelor’s in may but i’ve been applying for a year where i’ve only been ghosted after interviews or not even hearing back after applying. although im depressed, i don’t show it and actually come off as quite bubbly. im not sure why no one wants to hire me. i have a total of 9 months of restaurant experience as well so im definitely qualified for those type of jobs at least.",
      "created_utc": 1737164879.0,
      "score": 3
    },
    {
      "id": "m7mn4j7",
      "body": "I can understand that. You should be doing these things for you though and idk if you’ve ever heard of the 10,000 hour rule, but it pretty much says it takes 10,000 hours to become a master at something. Comparison is the thief of joy, try not to compare what you’re doing to others, there will always be people better and worse than you. Depending on what hobby interests you if being really good at it is important to you try taking lessons on the topic so you can get better faster. I notice there’s things that I enjoy doing, but I’ll dread getting started and out of bed but I’ll feel slightly better when I get started. Everything is harder when you’re depressed, so make sure to be patient with yourself it can take a really long time to get out of depression and get started and get good at a new hobby.",
      "created_utc": 1737122517.0,
      "score": 10
    },
    {
      "id": "mc9s282",
      "body": "Yeah seven is still too young, and yeah I'm getting kinda desperate I just have nobody to go out and nobody texts me",
      "created_utc": 1739315185.0,
      "score": 1
    },
    {
      "id": "m9ry6w3",
      "body": "Yes! I don’t know if I can post links but the blog “it taste like chicken” is a really good starting place for easy recipes",
      "created_utc": 1738128252.0,
      "score": 1
    },
    {
      "id": "m7mpsrm",
      "body": "[removed]",
      "created_utc": 1737123442.0,
      "score": 3
    },
    {
      "id": "mc9xp4v",
      "body": "I hate you have been going through it for five years. How do you feel physically??",
      "created_utc": 1739316977.0,
      "score": 1
    },
    {
      "id": "m7mxwb1",
      "body": "I would take some art classes, I’m terrible at art myself, and I’m kinda self conscious of it and was going to do art classes myself. I enjoy drawing but I have a hard time drawing what I visualize which makes it frustrating. I don’t play video games too much, although recently I’ve been pretty obsessed with dbz sparking zero, I don’t mind games being hard and trying the same mission over n over, I also really like fps I normally play online I’m not the best at most games, but I am probably a deviation above the norm. But maybe you just need a game that’s easy going with a nice flow, have you been enjoying Mario party?",
      "created_utc": 1737126091.0,
      "score": 3
    },
    {
      "id": "m7r7w5q",
      "body": "I buy coloring books and challenge myself to just enjoy the simple act of coloring if I can’t stay in the lines or my color combinations aren’t good, etc. It’s very relaxing and helps me practice being creative without judgement.",
      "created_utc": 1737176065.0,
      "score": 3
    },
    {
      "id": "mc9xzl7",
      "body": "I just feel weak and small comparing to everyone of my age, I just don't feel good and the only thing I do is pretend that I'm not.",
      "created_utc": 1739317073.0,
      "score": 1
    },
    {
      "id": "m7mzndj",
      "body": "[removed]",
      "created_utc": 1737126637.0,
      "score": 2
    },
    {
      "id": "mc9y4zh",
      "body": "Same. I think it gets worse with age. I'm getting pretty old. And just the thoughts of getting up and doing something is so overwhelming",
      "created_utc": 1739317122.0,
      "score": 1
    },
    {
      "id": "m7n0j4i",
      "body": "Maybe… I’ve never taken a art class so not sure how it goes, I don’t really talk or get out much though besides work, and i haven’t been in the mood for going to the bar in a long time so I figure it’s just something to do. Is there anything you can think of that’d be enjoyable for you that’d help you out? I know there’s a lot of things I need to do that I haven’t had the motivation to get started with yet that I’m hoping will improve my mood once they become habits.",
      "created_utc": 1737126909.0,
      "score": 2
    },
    {
      "id": "mc9yypt",
      "body": "Yeah and there's no one I can trust, vent in person you know tell about myself I just stopped trusting everyone I just want to disappear, move out and pop xans I just hate being sober I hate it",
      "created_utc": 1739317392.0,
      "score": 1
    }
  ]
}