{
  "id": "1kvu935",
  "title": "Fuck this mental illness. There is no point in life when you have 0 connections with people",
  "selftext": "No friends, nothing. What a pathetic way to live life.\nI haven’t had IRL friends in years. Touch deprivation is insane and I don’t mean it sexually or romantically. I mean any basic contact. A hug, a handshake, a hand on the shoulder. Fuck it messes with my brain how long I’ve gone without basic contact. \n\nI’m not even weird or consider myself ugly, I just have this stupid mental illness which makes me isolate, push people out and not form connections. And I cant stop. \n\nWhen I HAVE to socialise, I suddenly adopt this persona where I am super friendly and easy going. It’s so exhausting. I’m doomed to be lonely because I’m constantly tired of keeping up appearances. \n\nI can’t get out of the cycle. I can’t even bring myself to end it. I just exist for no reason. Fuck my life man ",
  "created_utc": 1748265788.0,
  "score": 670,
  "num_comments": 63,
  "url": "https://www.reddit.com/r/depression/comments/1kvu935/fuck_this_mental_illness_there_is_no_point_in/",
  "comments": [
    {
      "id": "mucgrhj",
      "body": "Same, no physical contact, and at the same time I push everyone away. It's like I don't know how to be a human anymore. I can't relate to anyone and I don't want to socialize, at the same time I wish I had a twin best friend. Loving is too dangerous in this world",
      "created_utc": 1748269173.0,
      "score": 120
    },
    {
      "id": "mucb2i1",
      "body": "I know how it is...\n\nEventually I try to connect, to open up, but I end up feeling horrible. I don't know how to fix this. Maybe a very good psychologist and the correct people around you can improve this, but I can't say for sure. I didn't have success with this yet. Anyway, I'm here to say I get what you mean and that you are not alone, if that is worth anything.",
      "created_utc": 1748267301.0,
      "score": 46
    },
    {
      "id": "mudtf96",
      "body": "Imagine being this way at 50?\n\n\nCan’t believe I’ve survived this long. I only stick around for my cats.",
      "created_utc": 1748283825.0,
      "score": 30
    },
    {
      "id": "mucdf9u",
      "body": "Same here\n\nInstead of focusing on myself this mental illness is just creating more trouble I'm feeling like I just want to finish myself just now.",
      "created_utc": 1748268092.0,
      "score": 26
    },
    {
      "id": "mucjw5u",
      "body": "I relate to this, there’s like no point it feels like when you don’t have anyone caring about or noticing if you leave the house to join an activity. No accountability or community. \n\nAnd I’ve experienced the same, like I think I am friendly and easygoing as my true nature, but it is hard to maintain that when everything is going wrong in my life I just don’t feel like I can talk to people in that way because I feel dishonest. So I put up a front and become anti social and quiet because although I’d like to be normal and make connections, I’m just in a vulnerable spot and they don’t know me well enough or they don’t understand mental illness well enough to get it. The lack of energy and motivation, the dissociation, the guilt, the anxiety about looking abnormal and being judged, the isolation. And I move slowly, talk slowly, just look dumb.",
      "created_utc": 1748270159.0,
      "score": 25
    },
    {
      "id": "mue3gsb",
      "body": "Hey yeah I get you. I’ve forgotten how to form new connections, how to have fun, how to enjoy anything. I’m just surviving each day watching it pass and ticking it off. \n\nEvery morning I look at the day ahead and think of ways to keep myself occupied till it’s over. It’s mechanical at this point. Purely watching them pass and ticking them off. Nothing more. No enjoyment. Just the ever forward movement of time. The sun rises and it sets again. And another day is done. That’s it.",
      "created_utc": 1748286917.0,
      "score": 15
    },
    {
      "id": "mueat8y",
      "body": "I so agree.\n\nFeel so done now.\n\nWorst part is everyone living happily around you... Knowing that you are struggling.. And they don't give two fucks about you...\n\nThey feel irritated.\n\nOnly us people who are going through this feeling understand what we are actually going through.\n\nSorry for the late night rant. Needed to get it off my chest. Feeling terrible.",
      "created_utc": 1748289251.0,
      "score": 15
    },
    {
      "id": "mucmbku",
      "body": "The aesthetically pleasing are the only ones who will have success at this. The rest of us have no chances at all.",
      "created_utc": 1748270912.0,
      "score": 13
    },
    {
      "id": "mudkq2l",
      "body": "You may be autistic if you find yourself having to adopt an unnatural persona around people when you socialize which would essentially be masking.  Could be the reason you isolate too.  I’m not diagnosed but I’m pretty positive I’m well on the spectrum and it makes my life extremely difficult.  But regardless of what I said above, I feel you man.  Hang in there.",
      "created_utc": 1748281224.0,
      "score": 12
    },
    {
      "id": "mucyblx",
      "body": "Bro I am also having this same story its very hard to survive with this",
      "created_utc": 1748274546.0,
      "score": 9
    },
    {
      "id": "muctafo",
      "body": "Not everyone has a desire for physical contact.  Part of my troubles has to do with being sexually teased by adults when I was younger for being affectionate.  This has rendered me a middle-aged man who fears all contact.",
      "created_utc": 1748273039.0,
      "score": 9
    },
    {
      "id": "muczocp",
      "body": "Try Martial arts🙏",
      "created_utc": 1748274952.0,
      "score": 7
    },
    {
      "id": "muelgv1",
      "body": "I relate to each paragraph of this post. Plus, I've never had a job and I know people who are younger than me and are buying things like ps5 and stuff (it's a luxury in my country) I really hate this.",
      "created_utc": 1748292604.0,
      "score": 7
    },
    {
      "id": "mude02k",
      "body": "I can definitely relate to the exhaustion of putting on a persona whenever I have to socialize. I often wonder what it's like to not have to \"act\" all the time. Shit just drains my energy to the max.",
      "created_utc": 1748279269.0,
      "score": 6
    },
    {
      "id": "muciqtx",
      "body": "I think this is less a mental illness and more a condition of our society. I've felt this way too, people just like talking about the dumbest shit and it always felt so fake, so forced. The conversations are never deep, I don't understand how people can stand acting like it's normal. \n\nYou might be experiencing an existential crisis that stems from a broken society not from a broken persona.  Just stick to your true self, keep doing the things you like day in day out, eventually you'll start meeting people you like. It's better to have 1 friend you can relate to than 5, who are all trying to stay relevant with whatever the new bs of society is. \n\nMy closest friend is my wife, and I really wasn't expecting us to get together or planning it at all, she was engaged when I met her and i would just carpool with her to and from work, but that was for the best cause it allowed us to get to know each other slowly. Then she called her engagement off cause realized her partner wasn't a good partner.",
      "created_utc": 1748269799.0,
      "score": 16
    },
    {
      "id": "mudo6qd",
      "body": "I feel 100% the same way. You're not alone in feeling alone",
      "created_utc": 1748282236.0,
      "score": 6
    },
    {
      "id": "mucw0xj",
      "body": "I understand. 100% understand I feel this way all the time.",
      "created_utc": 1748273863.0,
      "score": 3
    },
    {
      "id": "mud15am",
      "body": "i can relate, it’s so hard to maintain long term relationships, it seems like i’m born this way, i just can’t live like any normal person",
      "created_utc": 1748275396.0,
      "score": 4
    },
    {
      "id": "mud2yjh",
      "body": "I completely relate and empathize. This experience is soul crushing. It is pure hell. ",
      "created_utc": 1748275947.0,
      "score": 5
    },
    {
      "id": "muf7l4y",
      "body": "I wish I could help. I'm 37 and I'm in the same boat. I don't know what to do but I hope it gets better for you.",
      "created_utc": 1748300051.0,
      "score": 3
    },
    {
      "id": "mudp1oj",
      "body": "I feel you so much. I hope it’ll get better",
      "created_utc": 1748282492.0,
      "score": 3
    },
    {
      "id": "muec1rz",
      "body": "Bro pls describe me how exactly you feel when youre around people, i think i relate to you",
      "created_utc": 1748289648.0,
      "score": 3
    },
    {
      "id": "mugb6lx",
      "body": "There is not one person whose life would at all be affected if I disappeared. Nobody would notice.\n\nAbout the only true friend I have is sleep.",
      "created_utc": 1748314494.0,
      "score": 3
    },
    {
      "id": "mugep2w",
      "body": "So true. And when I try searching up what to do. 1st thing is \"get therapy\" ughh.",
      "created_utc": 1748315890.0,
      "score": 3
    },
    {
      "id": "muhl3st",
      "body": "Hey man. If you ever feel like talking about it, lemme know. Here to listen",
      "created_utc": 1748338722.0,
      "score": 3
    },
    {
      "id": "muhr53g",
      "body": "I know this might sound simple, but even the tiniest step can start to crack the cycle. Like giving a small smile to someone in public, or just saying “Hi” to a cashier. I’m not saying it’ll fix everything, but it might open a tiny door. And you *deserve* that door to open. You deserve kindness, connection, and to feel like you're not alone — because you’re not.",
      "created_utc": 1748342087.0,
      "score": 3
    },
    {
      "id": "mudk0qw",
      "body": "I get u, I'm 31 & no connections",
      "created_utc": 1748281018.0,
      "score": 2
    },
    {
      "id": "mudu4l1",
      "body": "I've not even hugged anyone like a proper hug. Touch deprivation bothered me before, not now. Still, i want someone, and I dont want someone. In a constant push and pull. I've prohibited myself from saying the die phrases, but it's freaking hard. The major problem is the uni and uni people. Fcked up academics and poor self-image. Suicide is fcking taboo. Making it seem like an accident is by far good but comes with a hell lot of unnecessary pity from the crowd, still better than suicide. Only if i didnt have a family, jesus... what would i have done! Punishment is all that i deserve.",
      "created_utc": 1748284042.0,
      "score": 2
    },
    {
      "id": "mueboig",
      "body": "There has never been one.",
      "created_utc": 1748289529.0,
      "score": 2
    },
    {
      "id": "mug6cdi",
      "body": "This is how I think most people are",
      "created_utc": 1748312659.0,
      "score": 2
    },
    {
      "id": "mug6ljd",
      "body": "What’s is Trust? What is Love? and What is Peace?",
      "created_utc": 1748312753.0,
      "score": 2
    },
    {
      "id": "mug89cx",
      "body": "I understand how you feel. I don’t know what to say. I’m sorry.",
      "created_utc": 1748313381.0,
      "score": 2
    },
    {
      "id": "mugf7nl",
      "body": "get that bag that never disappoints",
      "created_utc": 1748316095.0,
      "score": 2
    },
    {
      "id": "mugo6vw",
      "body": "Imagine 10 more years of that. Yep that’s me. And I bet there’s plenty more having survived that for even longer. You go back home from work or gym and literally allow to be addicted to internee/games because that’s the only thing I can do to speed up time until next day. Doing naps as well so day goes quicker ",
      "created_utc": 1748320032.0,
      "score": 2
    },
    {
      "id": "muiltfj",
      "body": "I'm telling you I didn't have friend until someone added me online by mistake and I tried making a friend here on Reddit. In the end, I had to accept that people suck. I tried making friends before and I'm already 28 with only 1 friend now. It's more common than you think.\n\nYou might have to accept it that you're better off alone without the drama and get a pet! My cat saved me. Or it might take time to find the right friends.",
      "created_utc": 1748354236.0,
      "score": 2
    },
    {
      "id": "muiqe7q",
      "body": "I really feel you on this. I’ve been in a similar place socializing feels exhausting, and making new friends after college(2022) has been incredibly hard. I have two very close friends from my college days, and honestly, I’m so grateful for them. We don’t talk all the time, but when we do, even just one call is enough to catch up and share both the highs and lows. That kind of connection means a lot.\n\nThe sad part is that we now live in different countries, But knowing they’re still there, even from afar, helps keep me grounded. Just wanted to say you’re not alone in how you feel.",
      "created_utc": 1748355691.0,
      "score": 2
    },
    {
      "id": "muiydqf",
      "body": "I respect that you said it from this point. I'm tired of people who say- \"Yeah,I'm smart, and everyone around me are dumbasses,that's why it's cool to be alone.\" No, it's not, and if you can't find someone,who can be good with you,or can't be around you-that's not people's problem,IMHO",
      "created_utc": 1748358125.0,
      "score": 2
    },
    {
      "id": "muk7vfd",
      "body": "Yes, I miss hugs so bad.",
      "created_utc": 1748370861.0,
      "score": 2
    },
    {
      "id": "mukrz45",
      "body": "I 100% understand what you’re feeling and how you’re feeling. Touch deprivation is something I deal with as well. I too do not have many friends or a boyfriend. I do have my two parents fortunately and two cats but aside from them (lucky to have them), I am lost. You aren’t alone❤️",
      "created_utc": 1748376631.0,
      "score": 2
    },
    {
      "id": "mucy752",
      "body": "I feel this so hard…also constant rejection from women just makes it worse. I crave that connection but when I finally get it it gets taken away from me months later. I just feel empty ever since my baby mama left me. The only person I can connect with now is my daughter. But I miss the intimacy and I just feel lonely all the time even around friends and family. Socializing just seems like work to me now. Everyone thinks I’m an asshole but really I just don’t have the energy to form connections anymore.",
      "created_utc": 1748274509.0,
      "score": 4
    },
    {
      "id": "mumctyo",
      "body": "Same here. I've been diagnosed with autism and I think I have ADHD too.\nI'm also pretty sure I have PTSD which causes trust issues and anxiety. \n\n\nMight be similar for you. ",
      "created_utc": 1748394750.0,
      "score": 1
    },
    {
      "id": "mucbwy2",
      "body": "Eventually you'll find somone who can appreciate you for who you are bro. Don't give up.",
      "created_utc": 1748267588.0,
      "score": 0
    },
    {
      "id": "mucimgs",
      "body": "[deleted]",
      "created_utc": 1748269761.0,
      "score": -9
    },
    {
      "id": "mudei0u",
      "body": "Go outside beloved",
      "created_utc": 1748279414.0,
      "score": -4
    },
    {
      "id": "muchms9",
      "body": "I want to socialise but it’s just too tiring for my brain.\n\nAnd yeah love can be ass, it’s too painful when struggling mentally",
      "created_utc": 1748269448.0,
      "score": 40
    },
    {
      "id": "mucbekw",
      "body": "I appreciate it, thank you",
      "created_utc": 1748267415.0,
      "score": 14
    },
    {
      "id": "mulin4f",
      "body": "I’m almost 44 and have no desire to make it to 50",
      "created_utc": 1748384642.0,
      "score": 2
    },
    {
      "id": "mumcbex",
      "body": "Im 28 and I hoped my entire life it would get better. It never did. Seeing comments like yours is..sad.\n\n\nYou have my respect for fighting this long. ",
      "created_utc": 1748394573.0,
      "score": 1
    },
    {
      "id": "mumch4q",
      "body": "think the same",
      "created_utc": 1748394628.0,
      "score": 1
    },
    {
      "id": "mukspbf",
      "body": "Thank you I appreciate it :)",
      "created_utc": 1748376839.0,
      "score": 1
    },
    {
      "id": "mukstkv",
      "body": "Your message was thoughtful, I’ll try taking small steps. Thanks :)",
      "created_utc": 1748376873.0,
      "score": 1
    },
    {
      "id": "mucm3wn",
      "body": "Someone told me something similar years ago. It never happened. So now what?",
      "created_utc": 1748270844.0,
      "score": 8
    },
    {
      "id": "muml1a6",
      "body": "I can definitely relate",
      "created_utc": 1748397562.0,
      "score": 1
    },
    {
      "id": "mulvwbr",
      "body": "Nor do I. Like I said, my cats are the only thing keeping me here. Only family is my mom and she’d be fine and I have no friends who would miss me and my job wouldn’t even notice I was gone. Every day I wake up…I groan.",
      "created_utc": 1748389009.0,
      "score": 1
    },
    {
      "id": "mudm61s",
      "body": "I guess you either learn to live with it or push forward. A the end of the day if people won't accept you for who you are, you probably don't want them in your life anyway.",
      "created_utc": 1748281644.0,
      "score": 0
    }
  ]
}