{
  "id": "1dg7p5a",
  "title": "I wish someone would just...",
  "selftext": "Just fucking kill me. Shoot me. I wish I could go to bed and not fucking wake up anymore. I'm so tired. I'm so fucking tired of all the pain and suffering and I can't fucking escape it. Just take a knife and stab me to death already. Let me leave this place\n\nEdit: I fell asleep shortly after making this post, and unfortunately I woke up. I ended up self harming, and I just feel worse. Some of you are very nonchalant about encouraging me to end it... but I am a coward. I can't even self harm enough to bleed all that much. I'm a total wimp. Literally not strong enough to do it of my own accord.\n\nI could sit here and ramble about my fucking woes and horrible life circumstances, but I'm just... tired. Tired of explaining myself, tired of trying, tired of feeling like my heart is being ripped out of me.\n\nTo those of you who actually said something nice... thanks, but I've heard it all before. \"It could be worse\", \"I care about you\", \"It gets better\"... It doesn't feel like it. Every time I end up feeling \"better\" my depression comes back worse and worse sooner or later. The self harming gets worse The thoughts of ending it all persist.\n\nSo.. what I'm trying to say is... I'm unfortunately still alive, and I still wish I wasn't.\n\nEdit 2: I am alive. I've been on meds and I'm in therapy, but I'm looking into intensive outpatient care and will switch therapists once the evaluations I wanted to get done are done. I'm still holding on, somehow. Lots of you have helped. I still wish I didn't have so much pain and anxiety and sadness in my brain and body, but... some of you have inspired me to do something I hope will mean something to you. What that thing is, I'm not entirely sure yet, but it feels good to know people out here might actually want to see it.\n\nThanks.",
  "created_utc": 1718418256.0,
  "score": 1684,
  "num_comments": 242,
  "url": "https://www.reddit.com/r/depression/comments/1dg7p5a/i_wish_someone_would_just/",
  "comments": [
    {
      "id": "l8oo660",
      "body": "Life is overall shitty and borderline unbearable. We keep going because there are moments of joy, humor, happiness, and glee. I fully believe you will experience more of those moments that will make sticking around worth while, if only for a minute. Do your best.",
      "created_utc": 1718425896.0,
      "score": 601
    },
    {
      "id": "l8ol68e",
      "body": "Fr bro like why do i have to wake up every day i don't want to",
      "created_utc": 1718424121.0,
      "score": 222
    },
    {
      "id": "l8on0ch",
      "body": "I feel the same way I don’t really want a future I want to end it here and now",
      "created_utc": 1718425196.0,
      "score": 40
    },
    {
      "id": "l8om5xz",
      "body": "Me to idk I cant bring myself to do it I'm just tired",
      "created_utc": 1718424699.0,
      "score": 81
    },
    {
      "id": "l8ocynu",
      "body": "[removed]",
      "created_utc": 1718419819.0,
      "score": 176
    },
    {
      "id": "l8ohi9n",
      "body": "Hang in the man. Life sucks. I know the feeling all too well. Just reach out I am here for you.",
      "created_utc": 1718422099.0,
      "score": 62
    },
    {
      "id": "l8onisp",
      "body": "Fr bro Living in this World is more Suffering than Dying, Hell and Heaven are both here, God always be like suffer more son",
      "created_utc": 1718425503.0,
      "score": 27
    },
    {
      "id": "l8os920",
      "body": "There is little reason to believe me because to you I’m just some random person on the Internet but believe me, I used to be there. Not only did I used to be there, I thought I would be there forever. Legitimately and for years. It did take working on myself and getting help but I somehow against all of negative thoughts and beliefs, made it to a good place here on this Earth. I still have times I struggle, and life isn’t perfect because it can’t be, but I did find my happy place. I don’t know you brother, or sister, or whomever but I truly hope you find your way out of that dark place too, like I did. I know it’s hard but it is possible, even when it feels like it’s not for quite some time. Even when you don’t necessarily believe. I hope this is helpful in some way to you. Peace and love, please stick around.",
      "created_utc": 1718428490.0,
      "score": 22
    },
    {
      "id": "l8p9hwu",
      "body": "I wish I could tell you something to make it better, but all I can say is this: it’s horrible what you’re going through. You are very ill and in pain and suffering, and you deserve to feel like this. But you also deserve to see better days and I hope so much that you will somehow find a way to survive this battle because you are capable of being happy and enjoying life, but your illness has taken that from you. You deserve to survive this.",
      "created_utc": 1718440738.0,
      "score": 16
    },
    {
      "id": "l8onkyr",
      "body": "I feel this way",
      "created_utc": 1718425538.0,
      "score": 15
    },
    {
      "id": "l8opjws",
      "body": "What is wrong? What is your biggest problem? I don’t ask this expecting answers. I ask it so you ask yourself these questions. I battle with depression myself and a lot of times it has to do with what I feel like. I can’t change or control. My dad used to tell me if I practice being miserable I would get very good at it. Unfortunately he was right and I became professional at it. The same can be said for happiness, though it takes work and practice and if you practice long enough, you’ll get better at it. I do wish you luck. My wife passed away 10 months ago and I’ve never been as depressed as what I’ve been lately but I’m trying my best to break out of it. I hope you do too.",
      "created_utc": 1718426752.0,
      "score": 36
    },
    {
      "id": "l8oo5ur",
      "body": "Stay strong. This too shall pass. Most of us in this sub feel like this. But you only get to see the most beautiful sunrises after the darkest nights.",
      "created_utc": 1718425891.0,
      "score": 19
    },
    {
      "id": "l8op16a",
      "body": "I feel you honestly. Even getting out of bed is hard now. I just feel dead inside now.",
      "created_utc": 1718426426.0,
      "score": 9
    },
    {
      "id": "l8oo1y5",
      "body": "Im sorry you are feeling this way. Its okay to too. Living is very hard now a days and its not your fault the world has made it so hard to live happily. You are not alone bro",
      "created_utc": 1718425823.0,
      "score": 8
    },
    {
      "id": "l8ov74q",
      "body": "I'm a veteran of this feeling, I've been put in psych wards through depression and drug psychosis, I've suffered pretty severe TBI that's changed my life in ways I will never recover from and It's important for me to tell you, there's a light at the end of the tunnel. \n\nThis life is full of unfairness. There is no such thing as karmic justice or destiny it's just struggling through until you get to a point of acceptance or understanding where you can at least handle it until things slowly (but surely) will get incrementally better.\n\nDo your best as you can to stay alive, try to engage with your interests as best as you can, do everything at a quarter effort if that's all you can muster but never forget you are loved even if it didn't feel that way. We need people with your introspection. This illness is hurtful and insidious but it does make our world view pretty accurate and that is a valuable quality.\n\nStay strong, keep your stick on the ice and if it's any meaning from a stranger,  I love and wish the best for you my friend.",
      "created_utc": 1718430395.0,
      "score": 7
    },
    {
      "id": "l8oog1b",
      "body": "Yeah dude it’s rough feeling exhausted all the time even though I literally haven’t done anything to make me exhausted, like where does all my energy and happiness go I wonder",
      "created_utc": 1718426064.0,
      "score": 6
    },
    {
      "id": "l8oq6rh",
      "body": "I love you.",
      "created_utc": 1718427153.0,
      "score": 10
    },
    {
      "id": "l8orylc",
      "body": "No I get that, I think all the time that I hope someday I'll end up in the hospital, or get cancer one day.. I've done a lot of bad habits too recently, idk man life is crazy but hang in there, were all here together",
      "created_utc": 1718428297.0,
      "score": 3
    },
    {
      "id": "l8ouk5m",
      "body": "Feeling the same way  … just want it to end. Haven’t been able to get out of bed and function for a while, so I got fired from my job yesterday.  It never feels like it’s going to end, doesn’t it?",
      "created_utc": 1718429982.0,
      "score": 3
    },
    {
      "id": "l8p10om",
      "body": "It's the same for me. Reading your post, I realised it's me saying this. It's the same.. the same",
      "created_utc": 1718434397.0,
      "score": 3
    },
    {
      "id": "l8p1fk4",
      "body": "What is your age mister",
      "created_utc": 1718434691.0,
      "score": 3
    },
    {
      "id": "l8p5ist",
      "body": "Hey, I go through this often too. I can't remember the exact comment but someone once said to keep on living, since it is a \"vacation from nonexsistence.\" For me, this perspective helps because if I die now, I may miss out on other experiences in life ahead of me. You don't know what's coming up, so you should stick around. \n\nI read your other comments and seeing as you have a college degree, you're not completely \"useless.\" Having a college degree means you're perfectly capable of living in this world, capable of exploring, finding resources, doing everything yourself. I don't know what disability you have, but one thing I've heard about people with disabilities is that, say, a person with one arm will try twice as hard, twice the effort, as someone with two- and come out twice as strong.\n\nIdk, I'm not really used to giving advice... But I hope it helps somehow. And I hope you stick with us.",
      "created_utc": 1718437692.0,
      "score": 3
    },
    {
      "id": "l8pamn6",
      "body": "We're in a very similar boat, but I have to stay alive because I can't let my mom lose another person in her life and I can't bring myself to end it all because I'm scared to end it all in the first place anyways. Then I wonder if it's worth it. I guess I wouldn't know until I tried it, but then I get scared again and I can't do it. I'm in a vicious cycle of insomnia, depression, pain, and anxiety and I really wish I knew what to do. Let me know if you figure it out before I do.",
      "created_utc": 1718441607.0,
      "score": 3
    },
    {
      "id": "l8pr7t5",
      "body": "You should talk to a doctor about this you may need some medication to help calm the depression so you can heal an learn to soothe. You may also need Counceling. It doesn’t always seem like it but talking about it helps because you learn you are not as alone as you feel right now.",
      "created_utc": 1718453220.0,
      "score": 3
    },
    {
      "id": "l8qaupb",
      "body": "I dont know if you tried this but you can always try to get medication for it I was against it for the longest but I got to a point where my anxiety and depressing thoughts were just too much so I started taking anxiety and depression pills and they are helping just a suggestion",
      "created_utc": 1718463025.0,
      "score": 3
    },
    {
      "id": "l8oy5xa",
      "body": "Same. I don’t even look left or right before walking across the street anymore.",
      "created_utc": 1718432394.0,
      "score": 5
    },
    {
      "id": "l8p2lbe",
      "body": "No, what you need is rage. Rage at the world we live in that makes this the norm. Rage at those who keep our systems so nonchalantly and blatantly corrupt and uncaring. Rise up and strike them down. Become better than them and grind them beneath your heels as you bring their end and a better world. The paid off governing officials, the disgustingly rich sucking the world dry, the hatred fuels bigots that drain the morality of life to the point where it’s become bleak and pointless. Don’t end it because they win if we do, get them instead. ",
      "created_utc": 1718435524.0,
      "score": 4
    },
    {
      "id": "l8op9ri",
      "body": "I feel that. Every day feels like a heavy rock on the mountain of reminders as to why I’m too broken to have healthy or meaningful relationships or friendships. The crushing pain of profound loneliness is so much to bear :(",
      "created_utc": 1718426575.0,
      "score": 2
    },
    {
      "id": "l8oqpo9",
      "body": "I feel how you are struggling inside and I love you buddy",
      "created_utc": 1718427487.0,
      "score": 2
    },
    {
      "id": "l8osvq0",
      "body": "Fr man. I can’t keep going like this. I just want to die already.",
      "created_utc": 1718428902.0,
      "score": 2
    },
    {
      "id": "l8otstw",
      "body": "U need someone to talk to? If not then lmk if play video games or sum.",
      "created_utc": 1718429491.0,
      "score": 2
    },
    {
      "id": "l8ox0mf",
      "body": "Yeah.. we should have been built with \"Log Off\" buttons",
      "created_utc": 1718431604.0,
      "score": 2
    },
    {
      "id": "l8oxzcv",
      "body": "over it as well:(",
      "created_utc": 1718432268.0,
      "score": 2
    },
    {
      "id": "l8oziwn",
      "body": "My parents disowned me and my friends abandoned me. I'm so done.",
      "created_utc": 1718433345.0,
      "score": 2
    },
    {
      "id": "l8p05k6",
      "body": "Sort of good news is we are all going to die eventually, so all this is really just a game and ultimately doesn’t matter. That can be depressing but it can be freeing. Think of it like an experiment.",
      "created_utc": 1718433783.0,
      "score": 2
    },
    {
      "id": "l8p1z6o",
      "body": "I am in the same boat. I have a lot of days where I just wish I wouldn't wake up. I've tried, too. I self harmed a few times. I nearly overdosed on Tylenol PM in 2008. I've tried to hang myself twice. The rope broke. Twice. I've thought about jumping from high places.\n\nDo you know what sucks? I'm too chickenshit to do it. My willpower kicks over, and then I'm pissed at myself later on. \n\nSo I know you've heard this before, but you're not alone.",
      "created_utc": 1718435077.0,
      "score": 2
    },
    {
      "id": "l8pb5rv",
      "body": "I would love to not be here anymore as well",
      "created_utc": 1718442013.0,
      "score": 2
    },
    {
      "id": "l8ph0aq",
      "body": "Listen, I have a shitload of physical issues. I'm in a loveless situation. I'm battling with nerve issues for the most part that make me want to self harm. I'm physically Impaired. No friends where I live. Financially fucked up. Physically fucked up. Trying to fight back on becoming mentally fucked up. We all have our issues. We all need help and encouragement. I'm tired of myself more than I am tired of living. Sometimes the hand we are dealt is just not a winning combination. Find something to distract yourself for a few minutes. Take a timeout. This is what I do to prevent myself from just cutting my throat and bleeding out. Talk to your Reddit Family, we are here for this purpose. We care.",
      "created_utc": 1718446632.0,
      "score": 2
    },
    {
      "id": "l8px2hb",
      "body": "If it is not for my son, this life would have been done with.",
      "created_utc": 1718456364.0,
      "score": 2
    },
    {
      "id": "l8pyee8",
      "body": "hey man , ill be honest, it doesnt really get better, life just goes on everyday , it only gets better when either money or happiness is involved, have you ever tried playing guitar ?, thats a really cool hobby , it also distracts you about how shit life is, lmk if you try it man ill give you some tips",
      "created_utc": 1718457045.0,
      "score": 2
    },
    {
      "id": "l8q0t9k",
      "body": "Have you tried meds and talk therapy? You need help with this",
      "created_utc": 1718458301.0,
      "score": 2
    },
    {
      "id": "l8r0lfl",
      "body": "I get the being a coward part. I am one too. And it sucks. Because this place fucking sucks. Im taking it a day at a time and when that is too heavy - I take it an hour, a minute, a second at a time. My husband made me laugh until my stomach hurt from laughter. Somehow feeling that way for even just 1% percent of my life makes the other 99% worth trudging through... at least on some subconscious level.",
      "created_utc": 1718473712.0,
      "score": 2
    },
    {
      "id": "l8rfbp9",
      "body": "Definitely have had to change therapists and meds in my long lifetime -maybe you can to? Practicing mindfulness like TM and just walking barefoot outside w headphones and listening to RHCP while walking my pup ( who I adopted a month after my beloved 16 year old mostly companion border collie passed) helps -holding you up -Been There",
      "created_utc": 1718479596.0,
      "score": 2
    },
    {
      "id": "l8s5tpx",
      "body": "I feel the same about the going to bed and not wanting to wake up anymore. It's just so difficult when morning comes.",
      "created_utc": 1718490088.0,
      "score": 2
    },
    {
      "id": "l8staqq",
      "body": "👀 OP literally you speak the silent part out loud, some times life do be shitty, and sometimes it be great if it were over, but guess what there's a reason we ain't all ending it because some innate part of us believe that there's a reason we're here, otherwise our bodies would have shut down \n\nI dunno what you do irl but sometimes you gotta just feel the shit all of it, and self harming is just gonna damage your skin and maybe cause an infection but otherwise why not just feel the pain through exercising the fuck out at the gym, or running your body till your knees gives out in the woods, don't stay still that's the problem, your mind is racing but you're not moving your body, just fucking go go somewhere do something else but staying where you are now",
      "created_utc": 1718500464.0,
      "score": 2
    },
    {
      "id": "l8t2tr8",
      "body": "I dream about getting murdered. Or to be caught in a horrible accident. To have stage 4 cancer. \nIt's unfair that so many strong people died that way. People who had families, careers, who did things for others. If I could take their place, I would. So, I get you. Sometimes, being honest with ourselves is good.",
      "created_utc": 1718504854.0,
      "score": 2
    },
    {
      "id": "l8tm76j",
      "body": "[deleted]",
      "created_utc": 1718514995.0,
      "score": 2
    },
    {
      "id": "l99vzhf",
      "body": "Hey, i just want to know that I've been in your head space about a thousand times but I would like to offer a suggestion.  I've found that the moment I start being of service to others my mood improves dramatically.\n\n\nCan you muster up enough energy to call up an animal shelter or walk into a church and ask if anyone needs any help?  I put off being of service for years because I wanted something that flattered \"my gifts\" but I've realized it is unimportant.  I clean toilets and run the sound and video board at a church (and I'm not even religious) and I have never left one session feeling bad.  I mean surely there is something or someone out there you'd like to help?\n\n\nI apologize if this seems glib and I know depression well enough to know you probably have a dozen reasons why this won't work but this really worked for me. (When I'm depressed someone could offer a million dollars and I'd probably snap that person's head off!)  I know I'm just another random anonymous Internet poster but I know what it's like to go to bed every night praying I won't wake up.  It's just a suggestion but being of service is free and doesn't cost you anything.",
      "created_utc": 1718779631.0,
      "score": 2
    },
    {
      "id": "l8oqtyx",
      "body": "literally. i’m just sat here waiting for the end",
      "created_utc": 1718427563.0,
      "score": 1
    },
    {
      "id": "l8ovk1t",
      "body": "I dont want",
      "created_utc": 1718430631.0,
      "score": 1
    },
    {
      "id": "l8ox3jm",
      "body": "I feel you…",
      "created_utc": 1718431660.0,
      "score": 1
    },
    {
      "id": "l8oxa7w",
      "body": "Really sorry you feel this way my friend. For however many shitty days you’ve had, there’s just as many good or even decent ones that you can have. Hope your days can get brighter soon, keep going man, always.",
      "created_utc": 1718431784.0,
      "score": 1
    },
    {
      "id": "l8oxj2m",
      "body": "I understand. When im in public i just wish someone would shoot me and only me",
      "created_utc": 1718431956.0,
      "score": 1
    },
    {
      "id": "l8p0k74",
      "body": "People who don’t even know you at all care about you. Imagine the people who have loved you and still love you and you have formed bonds with. They will never be the same. - someone who struggles with these same thoughts very often due to major PTSD, depression, anxiety, etc. We all have to get through this together. It might not be soon, but something’s gotta give",
      "created_utc": 1718434073.0,
      "score": 1
    },
    {
      "id": "l8p0y4x",
      "body": "I’m so sorry that things are so rough for you. \n\nI have been through some pretty difficult stuff myself, but things are better now. Nowhere near where I want them to be, but definitely better. \n\nHave you tried therapy? Medication? My antidepressant generally works really well for me. It keeps the suicidal thoughts at bay, as long as I take it like I am supposed to. Therapy has been hit or miss— the important thing is finding the best match. \n\nI also know that my cats love me and rely on me, so even though I am not the best “cat mom” out there, I try to do the best I can for them.",
      "created_utc": 1718434345.0,
      "score": 1
    },
    {
      "id": "l8p1fps",
      "body": "I hope that one day you’ll find hope. I mean like I feel the same sometimes. I’ve wanted to end it but I’m too damn scared of death to do it. My life is probably way better than yours but I just wanna say that what helped me a lot was to have hope. It’s kind of delusional but it’s gotten me through the bad and the good and the okay days. I have hope that I’ll find someone one day who’d understand. Now I don’t know if that’ll actually happen, but I’m grateful for that hope because although some days were also awful, I was also able to experience the good. Idk bro it’s up to you to decide if the good is worth it. I don’t know if things will get better for you but there’s still a possibility. But if you are such a ‘coward’ and scared to die, you might as well y try, right?",
      "created_utc": 1718434695.0,
      "score": 1
    },
    {
      "id": "l8p1nf7",
      "body": "I’ll talk to you right now.",
      "created_utc": 1718434846.0,
      "score": 1
    },
    {
      "id": "l8p3qj1",
      "body": "I feel you man. Stay strong! There’s no truer saying than “This too shall pass!”",
      "created_utc": 1718436364.0,
      "score": 1
    },
    {
      "id": "l8p6itw",
      "body": "Same. I want to get life insurance and then die so my parents can relax",
      "created_utc": 1718438443.0,
      "score": 1
    },
    {
      "id": "l8p6sgk",
      "body": "You are not alone OP, but maybe you can begin something good for yourself with my favourite quote:\n\n„To live is to suffer, but to survive is to find some meaning in the suffering“\n\nAnyone can take your life but not what you believe in :)",
      "created_utc": 1718438648.0,
      "score": 1
    },
    {
      "id": "l8p8379",
      "body": "What’s the reason for your downfall?",
      "created_utc": 1718439649.0,
      "score": 1
    },
    {
      "id": "l8p9a9g",
      "body": "yo brother, hope you feel better soon, are you on any medication? it sounds like you need some proper help mate.\n\nyou say you can be fine but the depression comes back, that was exactly like me mate, you need to see a doctor, talk to them and try and get some meds.\n\nin the uk you can get mirtazipine, they work more than well enough for me and other people I know. \n\nI have depressive episodes where I just wanna kill people, I think it's normal though, we all have bad days that stretch into bad weeks.",
      "created_utc": 1718440572.0,
      "score": 1
    },
    {
      "id": "l8pa4k5",
      "body": "Here's something that helped me after dealing with a raging untreated textbook typical Bipolar 1 disorder (REALLY high highs and low lows)....\n\nI don't have to kill myself any more than I have to say or do x idea that seems GREAT when I'm manic because .....\n\nFeeling suicidal is a feature of my illness.",
      "created_utc": 1718441216.0,
      "score": 1
    },
    {
      "id": "l8pbbfc",
      "body": "I can’t imagine how you must feel. Depression is one of the hardest things I’ve had to deal with. Just know that things can and will change. You just need one good day/week. That can change everything. Don’t give up now, that change, you so desperately need and deserve, could be just round the corner. \n\nTake it a day at a time. I’m proud of you for making it this far.",
      "created_utc": 1718442132.0,
      "score": 1
    },
    {
      "id": "l8pevgf",
      "body": "Damn this is me- wanting to end it but can't so I just keep hoping someone else will do the work.",
      "created_utc": 1718444910.0,
      "score": 1
    },
    {
      "id": "l8pfuv2",
      "body": "It sucks when your emotions and feelings are striped out at some point.",
      "created_utc": 1718445712.0,
      "score": 1
    },
    {
      "id": "l8pg8p6",
      "body": "Why is paying someone to take me out illegal?",
      "created_utc": 1718446025.0,
      "score": 1
    },
    {
      "id": "l8ph0wy",
      "body": "Cling onto something, anything. Anger, the internet, your favourite food, an unhealthy vice, a pet or person you’re obligated to stay for. Anything.",
      "created_utc": 1718446646.0,
      "score": 1
    },
    {
      "id": "l8pjjco",
      "body": "Start serving people. Be there for others and it will all change",
      "created_utc": 1718448553.0,
      "score": 1
    },
    {
      "id": "l8pko9x",
      "body": "I had 3 failed attempts before I finally took the steps towards recovery instead. I started going to an outpatient clinic to get on the proper meds for me and I started seeing a therapist. It doesn’t happen overnight but in time you will find your peace and your soul will be happy again. It takes time. I hope that you will reach out and ask for help. Suicide is not the answer, I know that from experience. Take care of you! There’s a reason you’re here you just don’t know why right now. Some day your story will help others too and you’ll be able to pay forward all that you’ve learned. Stay here, you’re needed.",
      "created_utc": 1718449303.0,
      "score": 1
    },
    {
      "id": "l8pl9w8",
      "body": "Yeah, i feel ya. \n\nFor what it's worth, i hope your life gets better. It might not but i'm rooting for you. And anyone else here and in suicidewatch.",
      "created_utc": 1718449682.0,
      "score": 1
    },
    {
      "id": "l8plejv",
      "body": "I can feel you. I also feel the same thing every now and then. Waking up to going to sleep I still feel to end myself but I can't do. I just want to end my sufferings which doesn't end. It's a loop for me",
      "created_utc": 1718449763.0,
      "score": 1
    },
    {
      "id": "l8pq3zn",
      "body": "Brother its nothing but upwards from this point. Ive been there a few times and i guarantee the corner is near and good things will come.",
      "created_utc": 1718452584.0,
      "score": 1
    },
    {
      "id": "l8pt5qf",
      "body": "I can totally understand, this is me and me is you. I also can't self harm myself to the point i am bleeding nd it's srsly frustating. I don't really know what to say but bro/sis am with u",
      "created_utc": 1718454288.0,
      "score": 1
    },
    {
      "id": "l8pujkd",
      "body": "You're not alone. I can't even feel happy without certain chems and drugs. And I'm 52...should have outgrown drugs but here I am still occasionally using. Almost always legal routes tho.",
      "created_utc": 1718455047.0,
      "score": 1
    },
    {
      "id": "l8pvwe8",
      "body": "Im sorry you feel this way, man. You are not going to feel great 100% of the time. Depression isn't really something that gets cured. If it was... i feel everyone would know the secret by now. \nCherish when it's great and keep pushing when it's not. \n\nIm sure there's something small to look forward to. Be it being able to eat something nice or play a game even for a few minutes. Waiting for a package or anything small. No matter what. Don't solve a temporary problem with a permanent solution. \n\nYou are worthy. You deserve to be here despite it all. Life is pain, but it's something that is to be enjoyed as best as you can. You're doing your best, and I believe in you.",
      "created_utc": 1718455765.0,
      "score": 1
    },
    {
      "id": "l8pvx6k",
      "body": "I can relate to this, deeply. I sleep like 12 hrs a day and just wish it was for an eternity",
      "created_utc": 1718455777.0,
      "score": 1
    },
    {
      "id": "l8pwre6",
      "body": "Please, life has a lot that is highly lovable.",
      "created_utc": 1718456208.0,
      "score": 1
    },
    {
      "id": "l8q3xno",
      "body": "i feel the same way. i cut myself on purpose once in middle school & haven’t been able to do it since. \n\nbut i’ve decided that the main thing keeping me going is all the animals & plants i haven’t seen yet. the earth & nature is so beautiful & healing, i wanna experience it for as long as i can. \nyou only need 1 thing that’s worth living for & that can be something abstract or a concept or even something physical",
      "created_utc": 1718459842.0,
      "score": 1
    },
    {
      "id": "l8q87m8",
      "body": ";\n\nThe semicolon is more than a punctuation mark. There are countless people who attempted to end their lives and couldn't. What I have learned from those people is that they were put here for a greater purpose. You will find a supportive community here. \n\n  \nThe storm is still here however it shall pass soon. What I encourage you to do is to seek medical attention. There is a drug called Lexipro that will be able to lighten the mood on your end. It worked for a personal friend of mine and it allowed her a chance to work things out on her end. We all go through our struggles, challenges, set backs, etc. You are not alone with this feeling. \n\n  \nAnother thing that I encourage you to do is dream of state in what a happy you looks like. Write it down and be very specific with it. Dont short change your change yourself. Also write down your current state. The gap in between states is where the fun begins. Take it one day at time. Some days will be good and some will valley into a shit day. Each day that you wake up is another day to advance to that future state of you. \n\n\n\nYou got this!",
      "created_utc": 1718461840.0,
      "score": 1
    },
    {
      "id": "l8qadse",
      "body": "I feel you",
      "created_utc": 1718462818.0,
      "score": 1
    },
    {
      "id": "l8qeztm",
      "body": "This post really hits when you’ve been this level of depressed before. Go eat something yummy and take a long nap OP, you deserve it.",
      "created_utc": 1718464847.0,
      "score": 1
    },
    {
      "id": "l8qp8py",
      "body": "I hope you find something that brings you happiness.",
      "created_utc": 1718469195.0,
      "score": 1
    },
    {
      "id": "l8qq8zs",
      "body": "I've been where you are before and I promise you, it gets better. Maybe it won't be today, it might not even be this year, but it does get better. One day you will look back on this moment, and be so glad you survived it. Please give yourself the time and chance to be happy in the future.",
      "created_utc": 1718469598.0,
      "score": 1
    },
    {
      "id": "l8qwstt",
      "body": "If you check out early you have to restart at an even lower level. That's my thought. \n\nOne trick I learned was to be happy about something stupid while the world collapses around me. But you have to really really be at that \"fuck it\" point and then enjoy the world around you out of spite. Just spent 15 minutes staring up at sunlight through the tree leaves while ignoring my phone.  It was great and felt almost like a protest to the forced misery we're expected to endure.",
      "created_utc": 1718472209.0,
      "score": 1
    },
    {
      "id": "l8qyjbo",
      "body": "I wish this would happen to me too",
      "created_utc": 1718472910.0,
      "score": 1
    },
    {
      "id": "l8r51cn",
      "body": "I feel exactly the same way rn. I too wanna die. But I don't do self harm.",
      "created_utc": 1718475514.0,
      "score": 1
    },
    {
      "id": "l8r6ggh",
      "body": "I know your pain, I am the same as you. It isn’t a matter of us being weak, since cutting with a knife really takes no force at all. There is a reason you can’t self harm, not fear, but you still have purpose and you know you do.",
      "created_utc": 1718476103.0,
      "score": 1
    },
    {
      "id": "l8rmck8",
      "body": "I feel this way quite often. Just make it through today.",
      "created_utc": 1718482331.0,
      "score": 1
    },
    {
      "id": "l8rnljp",
      "body": "I am in the same boat, friend. \n\nI live with family bc I'm not safe solo. Went fishing for the first time today, that was a thing. Try to revert to toddler levels in your head when it comes to feelings of accomplishment.  I make a point to do small things I can get done correctly and keep doing things like that. \n\nSet a schedule. Follow the schedule.",
      "created_utc": 1718482813.0,
      "score": 1
    },
    {
      "id": "l8rog9o",
      "body": "I wish someone would just love me and cherish me and give me attention tbh",
      "created_utc": 1718483146.0,
      "score": 1
    },
    {
      "id": "l8rrbr7",
      "body": "You really should go try charity work out. Focus on helping people out also suffering to not only get away from focusing on your own suffering, but to also feel better about yourself for being a selfless person. I’ve had extreme bouts of depression throughout my life and nothing really made me feel okay about myself quite like charity work has. As someone who’s not religious, I basically find it as my substitute for the support and comfort a devoutly religious person seems to get from their belief.",
      "created_utc": 1718484253.0,
      "score": 1
    },
    {
      "id": "l8rx03f",
      "body": "Hi there. It’s trite, but it will get better. It won’t be much better, or what you need, but it’ll get a little better. And a little more. And then bad again. and then better. It’s miserable, believe me. But there’s something there to keep in going. It’s hard to see that when there’s so much pain though. You’re not alone.",
      "created_utc": 1718486461.0,
      "score": 1
    },
    {
      "id": "l8sdntt",
      "body": "Maybe something to take the edge off, let your mind rest for a little while? Idk what works for you.",
      "created_utc": 1718493469.0,
      "score": 1
    },
    {
      "id": "l8sqsrq",
      "body": "Depression aside - can we pinpoint what is triggering it? I noticed you said “tired of all the fucking pain and suffering” and I’m curious what has happened that has triggered this particular statement. Hope ur well OP",
      "created_utc": 1718499306.0,
      "score": 1
    },
    {
      "id": "l8sz1kc",
      "body": "I feel you... rly going through the same shit",
      "created_utc": 1718503092.0,
      "score": 1
    },
    {
      "id": "l8szkrm",
      "body": "I feel the same way. I don’t want to be here but I can’t bring myself to do it. It’s like I’m stuck. Dunno if it helps you but it kinda helps me to know there’s other people out there who feel the same way even if we all feel shitty. It’s just nice to know I’m not alone.",
      "created_utc": 1718503339.0,
      "score": 1
    },
    {
      "id": "l8t51wh",
      "body": "Sometimes even to live is an act of courage -\nLucius Annaeus Seneca\nTherefore, you are courageous.",
      "created_utc": 1718505918.0,
      "score": 1
    },
    {
      "id": "l8t5x9z",
      "body": "I feel this all to much I’m tired",
      "created_utc": 1718506326.0,
      "score": 1
    },
    {
      "id": "l8t69sa",
      "body": "alright here's the deal. I'm not going to tell you all that \"it gets better\" and \"I care about you\" crap. Because I don't know you. And it's not always going to get better. But people like you are better than the rest. you've been able to put up with this bullshit for a long time. None of this matters and we are destined to have hardship. But that doesn't mean killing yourself is the solution. I know it sounds stupid but it's true. I know there are probably things in your life that you enjoy. If not I know you can find them. Be stronger than this mess. when life tries to hurt you, say \"fuck you\" get back up, and punch life in the throat. you have free will. you can do whatever the hell you want. Do want makes you happy, and say \"bite me\" to what doesnt. in the words of Albert Camus \"become so free, that your very existence is an act of rebellion.\" You're going to get through this. Life is a bitch but you gotta be a bitch right back. and with the self harm. You're not a wimp. I do exactly the same. when I'd cut I wouldn't go to deep, sometimes it wouldn't draw blood. but just please fucking stop. It's a fucked up habit and it'll just make things worse. I don't know you but I want you to be happy. But cutting yourself or killing yourself won't do it. if you're not religious, go have fun in whatever way you want, all night. and don't give a shit as long as you're ok with it. if you are religious, 3 our fathers and a bloody Mary. Good Luck.",
      "created_utc": 1718506489.0,
      "score": 1
    },
    {
      "id": "l8t6yt6",
      "body": "Snuff me out.",
      "created_utc": 1718506821.0,
      "score": 1
    },
    {
      "id": "l8tf31i",
      "body": "It be like that it really fuckin blows tbh. I think I’ll just absolutely snap one day and something drastic will happen but im just absolutely sending it till then. Oh well fuck it satisfaction is a myth and I don’t think that will ever change even after",
      "created_utc": 1718510927.0,
      "score": 1
    },
    {
      "id": "l8tk6wi",
      "body": "You're 10000 percent right. My electricity was turned off 2 weeks ago, i got broken up with in March and my car may get repod. I work 3 jobs but inflation is taking all my money. I have no advice but I feel the exact same way",
      "created_utc": 1718513799.0,
      "score": 1
    },
    {
      "id": "l8tnupq",
      "body": "hope your still alive. life is what you make it. i feel sorry for the way you feel, truly.",
      "created_utc": 1718516018.0,
      "score": 1
    },
    {
      "id": "l8tpn6j",
      "body": "[deleted]",
      "created_utc": 1718517146.0,
      "score": 1
    },
    {
      "id": "l8u10l0",
      "body": "Mine’s been getting progressively worse every day, and just like you, I can’t do it, I’m a coward but sometimes I think it’s hope, but the way i feel makes me feel like there isn’t any. I don’t tell anyone my true feelings I just say “I’m good” with a smile on my face because hearing them tell me they care or it gets better is annoying. Being depressed isn’t gonna get solved by them saying they care. So I cry alone and I scream in anger and sadness and pretend like I’m okay the next morning. Sometimes I’m just numb and it hurts even more than when I cry. The only time I have ever felt better when I’m depressed is when people who understand my pain tell me their pain. It’s comforting in a way.",
      "created_utc": 1718525095.0,
      "score": 1
    },
    {
      "id": "l8uu2sb",
      "body": "Yeah i feel you if i can override my brain and give it a command of not waking up im long gone",
      "created_utc": 1718543808.0,
      "score": 1
    },
    {
      "id": "l8uuqsr",
      "body": "I remember a story about a guy suing his parents for giving birth to him without his consent but that got thrown out 🤔 I was legitimately disappointed",
      "created_utc": 1718544121.0,
      "score": 1
    },
    {
      "id": "l8vz44y",
      "body": "I’ll be your friend ? I’m a great listener too ? 👋👍",
      "created_utc": 1718560050.0,
      "score": 1
    },
    {
      "id": "l8ypjzt",
      "body": "Stick with it and don't give up the good fight. I'm 50, lost 20 something years to my depression, and I just found a new job I love to go to every day. It truly DOES get better. Hang in there - it's coming :)",
      "created_utc": 1718603415.0,
      "score": 1
    },
    {
      "id": "m16yf0c",
      "body": "For me, it is a huge fatigue to even write down anything related to mood/feelings when I’m down like that. Maybe like you. Sometimes I try to write something like poetry but I only write trash.\n\nToday I am feeling sad too.",
      "created_utc": 1733752433.0,
      "score": 1
    },
    {
      "id": "l8p4rww",
      "body": "I hate this life and world!!",
      "created_utc": 1718437136.0,
      "score": 1
    },
    {
      "id": "l8p1a3n",
      "body": "My brother in Christ, I and everyone else loves you, you have to love yourself.",
      "created_utc": 1718434583.0,
      "score": 0
    },
    {
      "id": "l8pb6ep",
      "body": "Killing IS not the crime. The true crime is bringing people into this world to suffer. killing someone IS charity work",
      "created_utc": 1718442027.0,
      "score": -2
    },
    {
      "id": "l8p4by6",
      "body": "Disappear, shut up, when dont know what to say, shut up per se, be more empathetic and less of idiots. The pandemic showed us that people only care about them and their little nucleus.",
      "created_utc": 1718436807.0,
      "score": -2
    },
    {
      "id": "l8ouvil",
      "body": "Walk into some shady neighborhood at night. /s",
      "created_utc": 1718430189.0,
      "score": -12
    },
    {
      "id": "l8osid9",
      "body": "[removed]",
      "created_utc": 1718428659.0,
      "score": -25
    },
    {
      "id": "l8ownw1",
      "body": "There’s no rush. \n\nIt could be much worse. You could be in Gaza being torn to smithereens. You might be in a state imposed famine, forced to resort to eating your own recently deceased children as the hunger ravages your soul. You might be incorrectly identified as a paedophile by the mass media because you look a little weird, once looked at porn and live fairly close by to where she was last seen. You might be having your fingernails torn out. \n\nPersonally, I’m thankful for my lighthearted dose of misery before death comes a knocking for real. 🤒",
      "created_utc": 1718431363.0,
      "score": -10
    },
    {
      "id": "l8ova6r",
      "body": "Brother, Pick up the Quran read one page a Day, and everything wil be bearable. God will make it easy for u",
      "created_utc": 1718430452.0,
      "score": -16
    },
    {
      "id": "l8oys64",
      "body": "I live for my animals and my parents. That’s it. There are moments of joy but none of them are my own doing. Just my pets and my parents.",
      "created_utc": 1718432822.0,
      "score": 161
    },
    {
      "id": "l8q9ip7",
      "body": "Well said. I've been around 50 years.  I have felt like you (OP) soooooo many times (often 3-4 times a week).  But marlboroultraight is right.  It took me a long time to realize this because life was great when I was in my 20s...or so I thought.  I was just sheltering myself from the realities of life by partying and drinking all the time.  Turns out life actually IS overall shitty and borderline unbearable.  How have I come to this conclusion?  Easy.  Pain, suffering, people and animals dying all the time (some of which are ones you are attached to, thereby making it very painful), all the assholes in the world, the unfairness in the world, cancer, people letting you down.... could go on for an hour.  Life can be soul crushing, full stop. However, and this is the key, there are moments of humor, joy, elation, fulfillment, and other very positive things.  Social media might have you believing that everyone's life is perfect.  It's a facade!!  Nothing more than a damn lie.  This is why I am so against social media.  Most people don't post about the rotten crap going on in their lives.  I encourage you to stick around OP.  Join a support group, post on here....do whatever it takes.   Best of luck to you mate.",
      "created_utc": 1718462432.0,
      "score": 20
    },
    {
      "id": "l8oynjx",
      "body": "None of that exists for me 😔 I feel burdened as well and have not found a solution.",
      "created_utc": 1718432733.0,
      "score": 14
    },
    {
      "id": "l8qi9te",
      "body": "Damn yeah that’s actually so genuine",
      "created_utc": 1718466255.0,
      "score": 3
    },
    {
      "id": "l8otoqb",
      "body": "[deleted]",
      "created_utc": 1718429416.0,
      "score": 15
    },
    {
      "id": "l8oktba",
      "body": "Don’t worry I will pray for them.",
      "created_utc": 1718423915.0,
      "score": 59
    },
    {
      "id": "l8oygi8",
      "body": "Please for me as well",
      "created_utc": 1718432597.0,
      "score": 10
    },
    {
      "id": "l8or131",
      "body": "[removed]",
      "created_utc": 1718427689.0,
      "score": -72
    },
    {
      "id": "l8pa33a",
      "body": "Thank you. This comment feels like one of the more genuinely helpful ones. Feels good to know someone can truly see that I'm not well. I feel like that people around me don't know how sick I truly am",
      "created_utc": 1718441185.0,
      "score": 10
    },
    {
      "id": "l8or6b6",
      "body": "I'm sorry for your loss. I appreciate that you shared some practical advice with the group. I would love to see more of this in our community.",
      "created_utc": 1718427784.0,
      "score": 13
    },
    {
      "id": "l9ka15l",
      "body": "Welcome to Costco",
      "created_utc": 1718938887.0,
      "score": 1
    },
    {
      "id": "l8p2fe8",
      "body": "I'm 22. I feel completely lost, man. I know I'm young, but that's just the thing. I'm terrified of aging. I already have a disability and it's getting harder to be active, so when I get older and naturally weaker, what the fuck am I mean to do? Plus I can't seem to get a job even with the college degree I was told would give me a better chance... My family is poor. We're barely managing. I had to give up a job I wanted because I can't drive and don't have transportation to go as far as it was. I hate myself so much. I feel entirely useless and not worth the effort of loving...",
      "created_utc": 1718435403.0,
      "score": 12
    },
    {
      "id": "l8p2tzk",
      "body": "It feels infuriating, but... also impossible to stop the fuckers in control of our systems. I'm just an insignificant statistic to them. I can't make a bigass change, I can't even change for myself. I'd love to think it's possible... but I've tried before. In smaller systems. Nobody gives a fuck when you're poor or young.",
      "created_utc": 1718435701.0,
      "score": 3
    },
    {
      "id": "l8p6g5f",
      "body": "I usally just lurk but I had to comment. We are in different situations but looking into your complexity of these feelings has brought me to mention how. I’m on the other spectrum. I grew up poor as balls and then got a silver spoon in a dead company which is up to me to take on and save. Yet my elders don’t listen to me or ask and only get slightly impressed by me sometimes. I worked my hardest and tried but fail. I have a gf who I live and sleep with. I love her dearly and she helps alot but even then. Those feelings lurk deep and aching. I’m only a lil younger than you but had to grow up fast. I hope you explore more of your outlandish hobby’s first please. I started metal smithing and making monkey off of melting scrap copper I scraped from the free section on Craigslist. Or refurbishing things you enjoy working on. Even on the computer put your love and heart into something and when it’s ready it will grow. Enjoy the dedication, commitment and complexity you can add to the world with anything.. like that’s yours and forever yours. We’ll have a good one",
      "created_utc": 1718438388.0,
      "score": 2
    },
    {
      "id": "l8rqurr",
      "body": "Its called sleep",
      "created_utc": 1718484071.0,
      "score": 1
    },
    {
      "id": "l8p2zqi",
      "body": "You are not alone but this sub cannot disown or abandon you. So we are gonna have this.",
      "created_utc": 1718435817.0,
      "score": 6
    },
    {
      "id": "l9enpvi",
      "body": "why",
      "created_utc": 1718851395.0,
      "score": 1
    },
    {
      "id": "l8q2f52",
      "body": "I'm on meds. I'm in therapy. My therapist made me feel worse instead of better last session and my meds don't seem to be doing enough lately...",
      "created_utc": 1718459103.0,
      "score": 1
    },
    {
      "id": "l8rhsyt",
      "body": "I try to hold on to the things I find beautiful, but it's hard...",
      "created_utc": 1718480581.0,
      "score": 1
    },
    {
      "id": "l8t3u27",
      "body": "I lost my grandmother to cancer. Wouldn't wish it on anyone, but I do sometimes beg her to take me away at night. I silently plead for her to come take me home. She was my home. I feel so lost without her here...",
      "created_utc": 1718505337.0,
      "score": 2
    },
    {
      "id": "l8uwqeq",
      "body": "Still here, doing slightly better. People like you have kept me from truly staying in bed and letting myself completely rot. Got some decent words of wisdom, so, thanks.",
      "created_utc": 1718545027.0,
      "score": 1
    },
    {
      "id": "l8p9gqj",
      "body": "I'm disabled. It feels like the world doesn't want people like me in it, especially hiring people like me. Even when I found a job, I couldn't keep it because I didn't have proper transportation. And before that, my mental health also kept me from a job I wanted. I'm just... tired of life being so fucking unfair and unlivable.",
      "created_utc": 1718440713.0,
      "score": 5
    },
    {
      "id": "l8p9xfs",
      "body": "I'm on meds and I'm still feeling like shit :/ I'm also in therapy but it's not been the greatest...",
      "created_utc": 1718441065.0,
      "score": 3
    },
    {
      "id": "l8t07nd",
      "body": "I'm alive. Trying to do... small things. I know I've been through some heavy shit, and a lot of my triggers stem from the things I've been through. This time around it's more like... who I am as a person. I'm disabled. I had to give up a job I would have actually gotten and been perfect for because I didn't have transportation. I fucking hate it. The systems in place are horrible and I feel completely useless.",
      "created_utc": 1718503631.0,
      "score": 1
    },
    {
      "id": "l8yq30h",
      "body": "totally agree",
      "created_utc": 1718603762.0,
      "score": 2
    },
    {
      "id": "l8ux1d6",
      "body": "This is exactly how I feel. There is comfort in knowing you're not the only one, and that life is shit, but there are people in this shit with you.",
      "created_utc": 1718545162.0,
      "score": 2
    },
    {
      "id": "l8ypvk9",
      "body": "that's awesome - see now you have a new friend!!!:):)",
      "created_utc": 1718603627.0,
      "score": 1
    },
    {
      "id": "l8p4r2c",
      "body": "My voice already doesn't matter, so I guess I will.",
      "created_utc": 1718437117.0,
      "score": 1
    },
    {
      "id": "l8p5307",
      "body": "[deleted]",
      "created_utc": 1718437362.0,
      "score": 54
    },
    {
      "id": "l8r5wh7",
      "body": "My Dog keeps me around.  He's my anchor.",
      "created_utc": 1718475868.0,
      "score": 2
    },
    {
      "id": "l8rnys0",
      "body": "Yep same. The guilt for my family and the small joys of my partner and cats",
      "created_utc": 1718482956.0,
      "score": 1
    },
    {
      "id": "l99wfgt",
      "body": "I felt your post. I am also 50, and thought life at least had awesome potential in my 20s but in reality yes it was all a drug and alcohol fueled facade.  On the upside, I've been sober and a teetotaler for ten years now and can happily say my brain has finally reset. I am able to enjoy a quiet morning with a book and coffee but still struggle with depression all too often.",
      "created_utc": 1718779924.0,
      "score": 2
    },
    {
      "id": "l8p0d5q",
      "body": "Thanks for the encouragement but living is miserable so I might as well end the suffering at some point",
      "created_utc": 1718433931.0,
      "score": 5
    },
    {
      "id": "l8onhnd",
      "body": "As will I, brother",
      "created_utc": 1718425484.0,
      "score": 28
    },
    {
      "id": "l8pasji",
      "body": "I know what you mean. And, well, I can’t promise you it’s going to get better. I’m still on my way, too.\nBut I can tell you that I mean it, I really really do: You deserve to get better. You also deserve to feel self-pity or spending lots of money or watching TV all day or whatever it is that’s keeping you in this life for one more hour.\nDon’t listen to people who tell you that others have it worse (how would anyone even define „worse“ anyway?) or that you should end it or anything. I often feel the same, but you know what? Eventually I feel differently again, too.\nIt takes a while. The bad might come back. But so will the good.\nPlease stay alive. Not for other people or anything. Stay alive because you deserve it and do what you need to to convince yourself of that!\nI don’t assume to understand what you’re going through because we’re all different, but please believe me when I tell you that I genuinely believe that you are capable of surviving this, just as I am.\nAnd if you’re too tired to actually do something today? Then don’t do anything. Do what makes you feel like life might be worth living.\nIt’s okay to take measures to save your life.\nDon’t let anyone tell you any different",
      "created_utc": 1718441726.0,
      "score": 7
    },
    {
      "id": "l8ori2d",
      "body": "I had to leave the widower sub because it was so depressing. It kept pulling me down and making me upset. We always think the best thing for us is to be around people that understand but if they’re negative also it just keeps us in a cycle of negativity. I can’t do that. I’m too prone to be drawn in by it. I’m just too empathetic.",
      "created_utc": 1718427994.0,
      "score": 15
    },
    {
      "id": "l8p3m8n",
      "body": "What is your college degree?",
      "created_utc": 1718436277.0,
      "score": 2
    },
    {
      "id": "l8p51in",
      "body": "Ngl in a way your situation reminds me of “The Metamorphosis” by Franz Kafka. If you haven’t heard of it then I would recommend reading it as it is relatively short and a classic.",
      "created_utc": 1718437331.0,
      "score": 3
    },
    {
      "id": "l8ycwxl",
      "body": "Hey brother, can I make a suggestion that might seem weird but might also ultimately help you with two problems? Volunteer somewhere that is meaningful to you and aligns with your interests. It gets you out of your own head for a few hours,  and serving the community or others who have it as bad or worse provides perspective. But secondly,  having job (yes, unpaid work counts as a job that you can put on your resume) experience and references and networking through volunteer work can lead to a paid job in a field where you're making a difference. The non-profit you volunteer for may even hire you if you gain enough experience and a position opens up, or they might inform you of job openings in that field. You might even gain employable skills in a whole different field,  opening new doors in your future. If you can't drive,  reach out, introduce yourself, and offer to volunteer remotely,  maybe by helping them with their marketing materials using your illustration skills. ",
      "created_utc": 1718595944.0,
      "score": 1
    },
    {
      "id": "l8qvfuz",
      "body": "Tell that to the French who have done that exact thing many times ",
      "created_utc": 1718471671.0,
      "score": 1
    },
    {
      "id": "l8rraz5",
      "body": "That's standby",
      "created_utc": 1718484244.0,
      "score": 1
    },
    {
      "id": "l8p31sl",
      "body": "This sub doesn't know me.",
      "created_utc": 1718435859.0,
      "score": 1
    },
    {
      "id": "l8qgtht",
      "body": "Might be time to try different meds, and/or a different therapist. I know it sucks, and doesn’t feel worth the effort, but I figure since you’re sticking around anyway might as well go through the motions. \n\nIt’s why I did/am. Can’t end myself because I know it’d destroy my family. Can’t be responsible for that. But there are days where I feel like I wouldn’t mind a car or cancer coming along and doing it for me. So I put one foot in front of the other, I do things which might maybe make the time between now and death less bad. \n\n& it has helped, some. I’m hopeful that it’ll help more. If not, eh. At least it’s something to try. \n\nFeel more hopeful lately ‘cause I got connected with a psychiatrist and am trying meds completely different from what I’ve used before—current one seems to be helping so far. I know it feels pointless, but I also know that’s how depression gets you to do nothing. It lies. Your brain lies to you. Cognitive distortions can’t be countered with positive thinking; you gotta learn about them and then *resent* the fuckers for basically brainwashing you. Forget petrol, run on rage and sheer bloody-mindedness. \n\nWhatever gets you to keep moving forward. ",
      "created_utc": 1718465635.0,
      "score": 3
    },
    {
      "id": "l8s66wi",
      "body": "Trust me, it is hard. I'll feel like I'm having a half decent day and then my depression hits me like a semi-truck. And I am fucking sad again. It bothers me soooo much when my mom says \"Smile! You were born!\" because mom, that is the fucking problem. So I do not have the answer to make it better, but maybe there is some solace in knowing you are not alone in the pits of depression and not wanting to do this shit anymore.",
      "created_utc": 1718490245.0,
      "score": 1
    },
    {
      "id": "l8t6d3a",
      "body": "A distant cousin of mine died from brain cancer. It happened so quickly. She was a brilliant young lady, she had plenty of friends, a boyfriend, ambition. \nI wish it could have been me. I'm so sorry about your grandmother. Why does fate or bad luck strikes the good ones, or the people who want to live ? We're right here, praying to disappear and we still have to kill ourselves. Death should allow volunteers. ",
      "created_utc": 1718506533.0,
      "score": 1
    },
    {
      "id": "l8pai4t",
      "body": "Yeah I kinda know what you mean, I went through the same thing kinda and what helped me most was just calming down, like forcing myself to calm down.\n\nI’d punch holes in things, smash my head through doors and windows, even tried stabbing a group of people - none of that rage helped me. I was trying to deal with something that happened to me years ago and that was what I couldn’t get past.\n\nIf you’re thinking about one singular thing all the time and it’s making you angry and you can’t get past it, it will drown you, try talking to anyone possible because it’s like a big block on your chest and it’s like a fog in your brain, you just can’t think properly.",
      "created_utc": 1718441509.0,
      "score": 1
    },
    {
      "id": "l8ypzq9",
      "body": "me too",
      "created_utc": 1718603702.0,
      "score": 1
    },
    {
      "id": "l8s7lr7",
      "body": "OP, i was not answering to you but to another comment above me. I am deeply sorry if it sounded it was for you. I was defending you and now it seems the other way around 😞",
      "created_utc": 1718490843.0,
      "score": 2
    },
    {
      "id": "l8p6pdf",
      "body": "Adopt a pet that's looking for a home and basically give yourself a reason to live and do something good in the process, it's how I would personally do it",
      "created_utc": 1718438582.0,
      "score": 76
    },
    {
      "id": "l8pk9wx",
      "body": "I went no contact with my family about 5 years ago at 56 I’ve had enough of the bullshit. I tried but you can’t fix stupid. Sure life is a bit quiet now but I like the peace finally. I’m so sorry for your loss. I lost my cat last year from a heart attack, she died laying next to me and I was devastated. Took me a while but I finally adopted another cat and she’s wonderful. When you’re ready there are many animals out there that need homes. I hope you consider maybe adopting another when you’re ready. Take care!",
      "created_utc": 1718449042.0,
      "score": 24
    },
    {
      "id": "l8qgkgg",
      "body": "Thank you for giving your dog the happiness they deserve. Please pass on the love to another animal of your choosing when you are able to ♥️",
      "created_utc": 1718465527.0,
      "score": 5
    },
    {
      "id": "l9anj5d",
      "body": "I can certainly relate.  Huge congrats to you for being sober for a decade!  That's an awesome accomplishment.  You should feel very proud of yourself for recognizing and doing something about it.  Sounds simple enough, but I'm sure you know it's far from easy.  Wasn't easy for me.  Still isn't, but come this July it will be exactly five years of sobriety.  Keep fighting the good fight.  We can get through this.",
      "created_utc": 1718797981.0,
      "score": 1
    },
    {
      "id": "l8qe8pp",
      "body": "[deleted]",
      "created_utc": 1718464520.0,
      "score": 8
    },
    {
      "id": "l8p4va0",
      "body": "BFA in illustration. With AI and all that crap, it feels... fucking pathetic and pointless. Someone will just be able to type up what I put my soul into. Why bother, you know?",
      "created_utc": 1718437203.0,
      "score": 6
    },
    {
      "id": "l8p57it",
      "body": "Holy shit I love Franz Kafka... I'll have to read that again. Haven't read Metamorphosis since high school...",
      "created_utc": 1718437457.0,
      "score": 9
    },
    {
      "id": "l8p38ux",
      "body": "Yes it doesn't but we all know what being depressed feels like.",
      "created_utc": 1718436006.0,
      "score": 4
    },
    {
      "id": "l8qhcqf",
      "body": "A new *good* psychiatrist, and the meds work different in that they’re not SSRIs, but rather designed to augment the effects of my current SSRI. Previously my experience with antidepressants was always that I’d go on one, and if it worked it would only be for a short while before I returned more or less to some baseline. Not as bad as my unmedicated one, but nowhere near where I need to be in order to do the things I want/need to do. & increasing/reducing the dosage of the SSRI didn’t really help. This new thing I’m on (in addition to the SSRI which has worked best for me) seems to be helping, somewhat. ",
      "created_utc": 1718465865.0,
      "score": 2
    },
    {
      "id": "l8sftq7",
      "body": "[deleted]",
      "created_utc": 1718494409.0,
      "score": 2
    },
    {
      "id": "l8qjuqs",
      "body": "My psychiatrist has been trying for 5 years to find the right meds. Not working. And my doctors prior to this psychiatrist tried as well. I want them to work more than anyone, but this latest try seems to have side effects of anger and feeling doomed.",
      "created_utc": 1718466917.0,
      "score": 1
    },
    {
      "id": "l9bqoly",
      "body": "Have any of your art online so's we can take a look?  \n\n\nI was in two colleges for art degree 23 years ago.  I realized I was wasting my time and money, or at least I thought I was.  So I never finished and then spent about 15 years not drawing anything.  \n\n\nC ant ever seem to finish any illustrations either.  I know how you feel, or at least within the same ballpark. Wish I could honestly tell you it gets better, but who could honestly KNOW?  It probably will though.  \n\n\nOne huge thing is perspective.  Absolutely key, actually.  It's where you place your thoughts.  And trust me, at 42, I'm no b3tter than you at it, but if you keep that in mind, it can get easier to remember, if you sort of train yourself to tell yourself to remind yourself:) In Finland is a word: sisu.   Look that one up.  ",
      "created_utc": 1718813111.0,
      "score": 1
    },
    {
      "id": "l8pggfc",
      "body": "[deleted]",
      "created_utc": 1718446197.0,
      "score": -3
    },
    {
      "id": "l8p3b88",
      "body": "I feel for you but that doesn't change how I feel or what I'm eventually going to do.",
      "created_utc": 1718436052.0,
      "score": 1
    },
    {
      "id": "l8qu82y",
      "body": "[deleted]",
      "created_utc": 1718471181.0,
      "score": 3
    },
    {
      "id": "l8siazh",
      "body": "You're right. With AI and all that crap... it's becoming a huge fucking joke. Nobody wants art from me. Nobody wants my work.",
      "created_utc": 1718495498.0,
      "score": 1
    },
    {
      "id": "l8p3jkw",
      "body": "I agree and I know it. But still....",
      "created_utc": 1718436223.0,
      "score": 2
    },
    {
      "id": "l8vu7hg",
      "body": "Thank you",
      "created_utc": 1718558228.0,
      "score": 1
    },
    {
      "id": "l8p3lci",
      "body": "Still what? What's your point?",
      "created_utc": 1718436260.0,
      "score": 1
    },
    {
      "id": "l8p44bw",
      "body": "I'm having a shitty day and thought some kind words might make someone's day a little bit better. This was my primary thought behind replying to you initially. I wanted you to feel seen and you to know that there are others here who understand that.",
      "created_utc": 1718436648.0,
      "score": 4
    },
    {
      "id": "l8p4bln",
      "body": "I appreciate that you tried to be nice but things that don't actually improve my situation just don't affect me. Have a  good night.",
      "created_utc": 1718436799.0,
      "score": 1
    }
  ]
}