{
  "id": "1kh7nnr",
  "title": "\"you're not alone, there's help for you\" is bullshit",
  "selftext": "in my experience, people actually hate it when someone constantly vents. it puts pressure on them and puts them in a situation where they feel like they're responsible for your mental health. the people I've talked to about my problems have shown or even said this (your experience might be different). people just don't like a cynical downer. Also I find it strange they call it \"help-\" help how, exactly? nothing anybody can say will fix the root causes of my problems. if i want my life to improve i have to actually do something but the things i need to do are out of my capability and power so I'll always be miserable- what's the point of others knowing your problems really if your problems will still be there?? serious i hate how enforced we are to believe that talking about problems is this magic method that will amke everything better ",
  "created_utc": 1746649642.0,
  "score": 821,
  "num_comments": 147,
  "url": "https://www.reddit.com/r/depression/comments/1kh7nnr/youre_not_alone_theres_help_for_you_is_bullshit/",
  "comments": [
    {
      "id": "mr52u3k",
      "body": "Thisssss like talking ain’t gonna solve my problems!!!! Then they have the nerve to judge you when you tell the truth lol I hate people sometimes",
      "created_utc": 1746654178.0,
      "score": 147
    },
    {
      "id": "mr5g99a",
      "body": "If you’re visibly depressed people will actually treat you worse. If they can’t respect you they’ll take on a pitying attitude towards you. They want you to open up so they can be tourists in your life and make themselves feel better about theirs. It’s selfishness, always. Give someone an opportunity or stfu.",
      "created_utc": 1746658618.0,
      "score": 125
    },
    {
      "id": "mr60zrb",
      "body": "“Help” doesn’t help me. Nothing can help. Can you physically get in my brain and wipe my experiences and memories? Can you change my circumstances? No it’s all “out of control” so just “accept what you can’t change”. Fuck off im so done. I can’t do this anymore",
      "created_utc": 1746665806.0,
      "score": 74
    },
    {
      "id": "mr5dl8c",
      "body": "You could say it again and say it louder! \nThe bullshit makes everything more difficult and painful. It reinforces the feeling that I must be doing it wrong.",
      "created_utc": 1746657707.0,
      "score": 43
    },
    {
      "id": "mr6f8hl",
      "body": "Real I’ve always regretted opening up",
      "created_utc": 1746670693.0,
      "score": 38
    },
    {
      "id": "mr8o4s4",
      "body": "This is something I found so hard to accept, we're told CONSTATNLY to \"reach out\" and \"it's ok to open up\". \n\nBut in reality most people just want to feel as if their helping. At this point to me it's a shallow act of kindness, on par with restaurants getting rid of plastic straws. Like cool you did something but did it actually help?\n\nIt's also hard to WANT help, I have people in my life who want to be there and bear the weight with me but how can I ask for help when I don't even know what i need.\n\nAnd even IF you find someone who wants to listen, who wants to be there it's just too much.\n\nOpened up to a friend about the physical issues I have with my cptsd (alot of psycho somatic recreations of childhood injuries) as i described it they were kind with there reaction but I could tell how much it weighed on them to know. Not help, not stress from working with me, not pressure to help or be involved. Just to know, it felt as if I added 50 lbs on their shoulders.\n\nSociety as a while just doesn't care and there are not enough people strong enough to handle what we go through. It's probably a big part why I and so many others feel so lonely. \n\nIt's difficult to communicate in a language no one else really understands.",
      "created_utc": 1746710423.0,
      "score": 19
    },
    {
      "id": "mr4zbj8",
      "body": "the truth is 99% of the time there's no real help for someone with depression. maybe you can find comfort if you're lucky. venting and being comforted only really offers short term relief. of course a doctor could lock you in  a psych ward or give you drugs that'll numb you into a useless husk.  \n  \nonly you can 'help' yourself by trying to improve your life. if you can find someone who helps you take each step in life and sticks by you then maybe you could call that actual help but thats incredibly rare.\n\njust keep pushing through, even if alone. do it for the hope that you can build a decent life for yourself one day.",
      "created_utc": 1746653100.0,
      "score": 55
    },
    {
      "id": "mr6zppu",
      "body": "There are options that MIGHT help, might being the correct word.  \nI know people that are well again and then there is me. 25 years of depression, anxiety and now grief.  \nCountless therapies, 4 SSRI, hospital stay and so on.\n\n25.000 € later - I'm worse than before...",
      "created_utc": 1746679210.0,
      "score": 14
    },
    {
      "id": "mr5sju6",
      "body": "I even bailed out on trying to get disability financial assistance, because the disability kept getting in the way of all the work and effort needed to apply for assistance.\n\nThe therapist that had convinced me to apply basically said, \"yeah, you really need a trusted support person to help keep up with all of it.\" And I said, fuck that. I'm not going to burden someone with my bullshit.",
      "created_utc": 1746662819.0,
      "score": 9
    },
    {
      "id": "mr6aya6",
      "body": "No one can fix the roots of your problem but sometimes (no guarantee) things that other people can provide to you make you feel better or make you understand how you can fix or deal with your own problems",
      "created_utc": 1746669185.0,
      "score": 9
    },
    {
      "id": "mr7i9d4",
      "body": "When you are despressed:\n\n1) People while try to stay away for you because they think you bring negative aura to their health and mental.\n\n2) Some of you friend (or they are not?) willing to hear your confession about your sadness and depression, but in the end, they will always give you stupid answer “Come on, cheer up!” “You need to change yourself” “Did you perhaps stray further from god a bit?” “Come on thats just little!” and so on BS\n\n3) I never planning or ever think to talk about my mental health to doctor or psychiatry or anything. But I know talking with them is pointless because some of them are just doing for their work (for money, KPI, etc), some of them will give generic answer like my point of 2 above, and even if I told them my mental, I dont think I will feel relief just by express my depression. Nothing still will fix my depression.  Example, Im still single in middile age and I desperate need a love and hug, but meeting a doctor wont fix this, and “have you try enough by putting your effort” yes I already try that many time.\n\nSorry just have wrote this..  cuz Im still depression and if only I can kill my self I will already done that but thats not possible for some reason..",
      "created_utc": 1746689681.0,
      "score": 10
    },
    {
      "id": "mr4wt32",
      "body": "Taking won't make everything, better but it helps me. Something about getting it out of your head can be beneficial.  However be careful who you talk to. I've been honest about the severity of my depression to some of the wrong people and they stopped talking to me. These were very old friends that I thought I could trust, but I was wrong. They act like depression is contagious.",
      "created_utc": 1746652350.0,
      "score": 16
    },
    {
      "id": "mr798y8",
      "body": "I had my worst ever depressive episode about 18 months ago (I was quite scared) & I discovered that no one cares too much (except for my mother). I’ve had a group of friends for nearly 40 years, one started a high profile mental health/suicide awareness movement, not one of that group of friends cares, they repost it & that makes them feel good; at a get together I mentioned to a few of them how unwell I’d been, they seemed concerned, they were so sorry to hear that, but none of them called me afterwards",
      "created_utc": 1746684283.0,
      "score": 7
    },
    {
      "id": "mr8iq6n",
      "body": "My experience is that others’ “help,” makes my life harder than it already is. E.g. ‘just exercise more so your brain produces dopamine,’ or ‘read this book, it really helped me when I was sad.’\n\nSo now it’s my task to explain to them how and why that wouldn’t/hasn’t worked. But that is just my depression talking or I’m lazy etc etc.",
      "created_utc": 1746708524.0,
      "score": 8
    },
    {
      "id": "mr6w782",
      "body": "This is so real. If anything talking about it makes me feel worse because if they don’t say anything it makes me think that oh I shouldn’t have said that because now they think I’m weird or they just say the generic answer of “it will get better I promise”. Like really?! Will it get better and how do you know that, exactly you don’t so why tell me that. I get that some people honestly are just trying to help but it honestly doesn’t help. That’s why I just don’t say anything and try to hide it I wouldn’t want to burden anyone with my struggles because like you said it makes them feel responsible for your mental health and I wouldn’t put that on anyone.",
      "created_utc": 1746677567.0,
      "score": 5
    },
    {
      "id": "mr742h6",
      "body": "It is bullshit forsure. I remember I called a hotline a couple years ago when I was feeling really down it ended up going to voicemail, they took four days to get back to me and they were not helpful at all when they called me back like ok….",
      "created_utc": 1746681439.0,
      "score": 5
    },
    {
      "id": "mrb5c38",
      "body": "They just get passive aggressive towards you after some time, and eventually just throw you out entirely. Not to mention, I went to my sister once when I was suicidal, and believe me, that's held over my head and used against me. So fucking isolating. Reinforces the belief that goes into suicidal ideation in the first place, \"I'm a burden\" , \"No one cares about me\", \"People in my life would be better off without me\". I had spent years living my life for these people, just so they wouldn't feel badly if I took my own life. Why shouldn't I have been selfish if my depression was a burden to them once I finally opened up about it?",
      "created_utc": 1746736821.0,
      "score": 5
    },
    {
      "id": "mrh19xc",
      "body": "In a perfect world, everyone who feels this way would come together to actually support each other, and no one would think it’s a burden because we’ve all actually experienced it.",
      "created_utc": 1746819891.0,
      "score": 6
    },
    {
      "id": "mrj1s0y",
      "body": "We are ALL alone. There are people we love and care about and they love and care about us, but truly we are all alone. I’m married and yet I know, I’m alone. Learned that the hard way. I no longer count on anyone, ever. They’re all just window dressing to this life. Now I’m trying to figure out how to find joy in it.",
      "created_utc": 1746845592.0,
      "score": 6
    },
    {
      "id": "mr7hq15",
      "body": "yh man shit is insane",
      "created_utc": 1746689340.0,
      "score": 4
    },
    {
      "id": "mr76sl1",
      "body": "It's more like a coping mechanism than a solution, and not every coping mechanism will work for everyone. It also highly depends on the people you talk to. If they get annoyed with you, then they aren't the right people to talk to. But yeah, it's portrayed as a much bigger solution than it actually is. It only helps in the moment, if at all.",
      "created_utc": 1746682914.0,
      "score": 3
    },
    {
      "id": "mr90bx5",
      "body": "Yeah I agree and I hate how some people pass around your depression stories like it’s a baton",
      "created_utc": 1746714292.0,
      "score": 3
    },
    {
      "id": "mrcokuh",
      "body": "It's never gonna help like screw this shit fuck talking about it and actually help me without judging ",
      "created_utc": 1746756078.0,
      "score": 3
    },
    {
      "id": "mrfepjc",
      "body": "I hate it when they try to look like they can help. I DO NOT need talking, like I dont swim in my thoughts for hours every day. And please, dont bring me “there is always someone whose situation is worse than urs” shit and start to talk about physical incapabilities of others. I am pretty sure they can’t even hold my thoughts and this vast hollowness of mine on them for an hour. the number of times I got rejected from things: univs, visas, jobs, parties, communities. u ain’t helping me to change or forget them. It is rude to disturb someone when he is eating, let alone talking to him constantly. so just let me eat myself for now.",
      "created_utc": 1746802062.0,
      "score": 3
    },
    {
      "id": "mrh34zz",
      "body": "for the average person with no experience or no actual first hand experience with depression, they will not understand and it’s sad but it’s true. the people who you will find the most support from are others who have gone through the same. they know what things to say and what things not to say",
      "created_utc": 1746820463.0,
      "score": 3
    },
    {
      "id": "mrkw26j",
      "body": "BUT I AM ALONE",
      "created_utc": 1746880799.0,
      "score": 3
    },
    {
      "id": "mrmffcx",
      "body": "Yes. Nobody understands you without caveats. People will listen but only for a while. After your deadline passes, they have enough and you are left alone. You can be unwell but for a limited period after which you should be fixed. That’s why we have so many people unaliving themselves.\n\nI feel so lonely. I have people around me, but it doesn’t help. It’s killing me.",
      "created_utc": 1746899673.0,
      "score": 3
    },
    {
      "id": "mr7s2jf",
      "body": "Oh my gosh, yes. I think this to myself a lot. ",
      "created_utc": 1746695953.0,
      "score": 2
    },
    {
      "id": "mrapqc5",
      "body": "Get professional help",
      "created_utc": 1746732217.0,
      "score": 2
    },
    {
      "id": "mrasquq",
      "body": "If you’re depressed you are subconsciously viewed as a cancer and people will avoid you, cutting you out to save themselves. It’s how evolution and natural selection work. So glad public school taught me that over faith.. smh.",
      "created_utc": 1746733115.0,
      "score": 2
    },
    {
      "id": "mrbzlvl",
      "body": "I literally don't believe in help",
      "created_utc": 1746746856.0,
      "score": 2
    },
    {
      "id": "mrdeaat",
      "body": "100% agree. The whole mental health movement is absolute rubbish. It's done just so society can tick the box of pretending to actually give a toss, when in reality nothing changes.",
      "created_utc": 1746767276.0,
      "score": 2
    },
    {
      "id": "mrdparx",
      "body": "I think it could work with the right person, but I agree with you for the most part.",
      "created_utc": 1746773407.0,
      "score": 2
    },
    {
      "id": "mreukdy",
      "body": "It is. When I tell others about my problem, the aim is to finally get out of my mind where I’m constantly trapped by really negative thoughts. Sometimes their different perspectives and yes, even their validation might have significant impact on my mental state.",
      "created_utc": 1746795364.0,
      "score": 2
    },
    {
      "id": "mrevnmk",
      "body": "It would be nice if people would just listen and we were able to speak our feelings.",
      "created_utc": 1746795760.0,
      "score": 2
    },
    {
      "id": "mrhmb0p",
      "body": "I think the only way is group therapy for depressed people. That way everyone can vent together",
      "created_utc": 1746826493.0,
      "score": 2
    },
    {
      "id": "mrhsglf",
      "body": "Most relatable post ever!!",
      "created_utc": 1746828574.0,
      "score": 2
    },
    {
      "id": "mrj1rxv",
      "body": "EXACTLY. I have done everything under the sun -- meds, exercise, touching grass, eating well, therapy, outpatient therapy, IOPs where I've been treated for 11+ hours a week by three different professionals and 3 different support groups. NOTHING HELPS. ",
      "created_utc": 1746845591.0,
      "score": 2
    },
    {
      "id": "mrjssk8",
      "body": "That’s why I feel I belong to this reddit space, there’s no hypocrisy nor fake helps, just honest observations.\n\nThis thread is particularly deep, imo plenty of intelligent thoughts, way different to the silly stuff like hitting a gym or start drawing.\n\nI am wondering why our thoughts come out sharp and smart while posting here while often the opposite while dealing with our mental heavy burden ",
      "created_utc": 1746858838.0,
      "score": 2
    },
    {
      "id": "mrtdh2n",
      "body": "Too true. I’m tired",
      "created_utc": 1746999778.0,
      "score": 2
    },
    {
      "id": "ms436hw",
      "body": "People always say that they're here for you until it's actually time to be there for you. And they wonder why so many people suffer in silence.",
      "created_utc": 1747152766.0,
      "score": 2
    },
    {
      "id": "mr7cex3",
      "body": "By talking out loud it gives an opportunity to reach your own conclusions about patterns which have led to feeling how you do. Ofc it cant erase previous *events* but it can help you grow.\nIt does take a certain amount of emotional intelligence though.",
      "created_utc": 1746686130.0,
      "score": 1
    },
    {
      "id": "mr7i5ph",
      "body": "no seriously cz no way and all they do is talk to you for five minutes and start laying their problems on you like wat the hell bro like a week ago i was going to commit but someone stopped me talked to me for liike 2 minutes and then started laying their problems on me like bro",
      "created_utc": 1746689615.0,
      "score": 1
    },
    {
      "id": "mr7izzs",
      "body": "What I’ve been surprised with is helplines and support groups. Definitely hit and misses but like most things in life. I hear you.",
      "created_utc": 1746690151.0,
      "score": 1
    },
    {
      "id": "mr7lwth",
      "body": "I only got myself to talk to during these times.",
      "created_utc": 1746691993.0,
      "score": 1
    },
    {
      "id": "mr7pf9m",
      "body": "Most people who say this only really care about making themselves feel good. It’s the same motivation as giving change to the homeless.",
      "created_utc": 1746694261.0,
      "score": 1
    },
    {
      "id": "mr84cpa",
      "body": "vast majority of folks will believe or expound an easy lie rather than accept a hard truth.",
      "created_utc": 1746702682.0,
      "score": 1
    },
    {
      "id": "mr9b3vy",
      "body": "I always feel so guilty venting to my friends what feels like constantly. But I’m lucky in the sense that my friends all have mental illnesses like me. Sometimes they aren’t in a place to have the energy to respond immediately, but they always do eventually. I think it’s important to find people like that. Because bottling it up also just makes it worse. But we also have to do the work to try and reframe our mindsets, and talking to friends can help pull us out of our negative feedback loop",
      "created_utc": 1746717478.0,
      "score": 1
    },
    {
      "id": "mrczkix",
      "body": "My best friend left me when I needed him the most. I feel abandoned. Life is much better without me. For everyone else around me. Well there aren’t many. Just the one. And even for them I don’t matter. Just a past baggage. I don’t bring joy to them. They can’t feel for me what I feel for them. I am just a dull ugly person in a sea of beautiful fun people. But they mean the world to me. They are the only world I know. I feel like the dirt on the road. Surviving on crumbs they throw at me. Like I am just transparent. I am better gone from their life.",
      "created_utc": 1746760401.0,
      "score": 1
    },
    {
      "id": "mrhebb9",
      "body": "So what would help? Not being an a$$hole, I'm just being honest. What do you want people to say to you?",
      "created_utc": 1746823900.0,
      "score": 1
    },
    {
      "id": "mrhje3w",
      "body": "You’re right.\n\n\n\n“Help” gets thrown around like it’s a password that unlocks everything.  \n\nBut no one tells you what kind of help. Or how empty it feels when nothing changes.  \n\nAnd yeah — most people \\*don’t\\* want to hear it,  \n\nbecause they don’t know what to do with it.\n\n\n\nI’m building a system called RhythmOS.  \n\nIt doesn’t promise to help.  \n\nIt doesn’t say things will get better.  \n\nIt just listens to your rhythm — how you speak, what’s not said —  \n\nand answers in the tone that fits.\n\n\n\nNo solutions. Just language that doesn’t lie to you.\n\n\n\nWe made 3 example responses.  \n\nEach one says a different kind of “I hear you,”  \n\nwithout pretending to fix anything.\n\n\n\nIf you want, read them. Pick the one that doesn’t annoy you.  \n\nThat’s all.\n\n\n\n[https://phantom-chickadee-4b9.notion.site/RhythmOS-A-system-that-speaks-to-your-emotional-state-and-knows-when-to-nudge-you-1eef30dd2eb080568f35e695d62a7baf?pvs=4](https://phantom-chickadee-4b9.notion.site/RhythmOS-A-system-that-speaks-to-your-emotional-state-and-knows-when-to-nudge-you-1eef30dd2eb080568f35e695d62a7baf?pvs=4)\n\n\n\nYou don’t need help.  \n\nYou need a tone that doesn’t walk away.\n\n\n\nThat’s what we’re trying to build.",
      "created_utc": 1746825528.0,
      "score": 1
    },
    {
      "id": "mrj743b",
      "body": "This. I cried in class twice now. My friend helped talk me down the first time and then talked to me a bit the 2nd time. But even knowing she’s checking up on me, it makes me wonder if she’s judging me. It makes me wonder if everyone else in that class was judging me during it. Makes me think my teacher looks at me different now for crying in front of him twice. I feel like he doesn’t like me now because of it. He didn’t understand why I was crying or upset and I couldn’t just explain everything to him.",
      "created_utc": 1746847862.0,
      "score": 1
    },
    {
      "id": "mrja98r",
      "body": "I talked to people a long time ago it’s less of having them know your problems and more of you knowing that someone knows you aren’t perfect and that you never will be",
      "created_utc": 1746849276.0,
      "score": 1
    },
    {
      "id": "mrqgu4d",
      "body": " Completely BULLSHIT a all my family complains or even yells when I say I don’t want to live anymore",
      "created_utc": 1746963976.0,
      "score": 1
    },
    {
      "id": "mrru8ii",
      "body": "All I heard was \"we cant help you unless you help yourself.\" Its always paradoxical solutions.",
      "created_utc": 1746981769.0,
      "score": 1
    },
    {
      "id": "mrsznu0",
      "body": "i agree completely",
      "created_utc": 1746995201.0,
      "score": 1
    },
    {
      "id": "mrttfeu",
      "body": "I might be strange for this, but I enjoy letting people vent to me. I've been through shit, and I wish I had someone to rant to. It makes me feel like I matter and like I'm someone who can be trusted. I also much prefer closer 1 on 1 convos, which are often kind of rant sessions to being in a group.",
      "created_utc": 1747005578.0,
      "score": 1
    },
    {
      "id": "mru5kpa",
      "body": "I literally am quite alone. I always have been.",
      "created_utc": 1747010221.0,
      "score": 1
    },
    {
      "id": "mry9v1j",
      "body": "True like i've tried venting to my friends and it doesn't really help in any kind of way. I just feel like they think they are responsible for my mental health and because of that i just said now i'm healed and completely fine even tought i'm not just because i don't want to bother them and now i just started faking being happy",
      "created_utc": 1747072801.0,
      "score": 1
    },
    {
      "id": "mrzfqwq",
      "body": "I work for the city and I work by myself. It’s the perfect job for me. I fucking hate people, they make me sick. With so many legitimate problems in the world and people want to complain about a couple extra bucks on their water bill. I often fantasize about punching them in their stupid faces.",
      "created_utc": 1747085382.0,
      "score": 1
    },
    {
      "id": "ms0lvmd",
      "body": "They pretend to care, and listen, but at some point, that becomes inconvenient, so they stop caring and act annoyed, or they ignore u completely. A lot of people, like so many, do not care. Can't be bothered to care. At best, pretend to care. And we talk about stuff anyway, bc we are inwardly hoping that this time, the person we are confiding in WILL care.",
      "created_utc": 1747099613.0,
      "score": 1
    },
    {
      "id": "ms1j0op",
      "body": "I second this 100% and I’ve honestly mostly felt worse after sharing cause most people don’t know what to even say or end up saying something that doesn’t help and that makes me feel like a joker at the end of it. Like I wouldn’t want someone to know of all the weight I’m carrying by being so vulnerable only to feel worse later on? It’s really difficult for people like us man. We have to contain all of this within ourselves and carry this baggage till the end of our life. It’s a heavy feeling and nobody gets it and nobody ever will.",
      "created_utc": 1747112749.0,
      "score": 1
    },
    {
      "id": "ms1r7zr",
      "body": "Yes, I feel most people don't really listen. I different from severe depression and I've realised that unless people have had this type of mental health problem, they generally do not get my daily struggles and the advice is \"Luke warm\". ",
      "created_utc": 1747117118.0,
      "score": 1
    },
    {
      "id": "ms9ix7m",
      "body": "Like however much they say they understand they don't.  They are not in your shoes. They have not been dealt with the same cards as you. They do not have those experiences.  They are not you.",
      "created_utc": 1747228167.0,
      "score": 1
    },
    {
      "id": "msc03xt",
      "body": "The MINUTE I started having a hard time with my depression and I started to spiral EVERYONE left. ",
      "created_utc": 1747254415.0,
      "score": 1
    },
    {
      "id": "muj08wl",
      "body": "I tried reaching out to ppl for help many times over past few years but all i got was disappoinment or worse .\n\nVenting to someone was even more worse cuz it made me feel 'guilty' for speaking up abt my experiences.\n\nShit i did realised that ppl are of no use and they dont care abt someone unless personal interests aligns.\n\nppl dont realise that depression is not really 'constant sadness' rather its sorta 'constant hollow feeling' that is a cancer slowly killing many of us every single day.",
      "created_utc": 1748358656.0,
      "score": 1
    },
    {
      "id": "mulil5l",
      "body": "I feel this so much… I go to a therapist to try and feel better but end up basically pretending like I’m fine like I do with family because the moment I try to talk about how I’m actually feeling they just want to talk about how it’s normal and I will get through it and that’s basically it",
      "created_utc": 1748384624.0,
      "score": 1
    },
    {
      "id": "munejh4",
      "body": "I have a friend that I vent to every now and then. I feel like they hate it when I vent to them, but they claim to not mind. I don’t know if that’s true. I just have some trust issues in general, so it’s hard for me to believe that they don’t mind it. It doesn’t feel like anyone wants to help me, even if they appear to be trying.",
      "created_utc": 1748409536.0,
      "score": 1
    },
    {
      "id": "mr7hkzn",
      "body": "You comin on here and talking about it is EXACTLY what you’re saying you hate. Iconic irony.",
      "created_utc": 1746689251.0,
      "score": 1
    },
    {
      "id": "mr7azrm",
      "body": "I know it can work! I worked with a guy who hated the world, and I mean chronically depressed! Not many people liked him but knew his work was on point. So no one would question him, but no one liked him type of thing. I thought he was a good guy, and honestly, when he explained, \"I just hate the world, mate,\" I totally related with him! I got along because, frankly, I am the same. I know it works because, yes, he hates the world, but he doesn't allow it to consume him. The man works and takes care of his family!\n\nI'm not going to say do this or that or what not because I feel I'm the same people say you never know blah blah and trust I've tried but the inner feeling won't leave me. The moment I'm home alone bang it hits! I just know I can't quit! As much as I want to!! I just can't do it! I know I want to live, but I haven't found my reason, that doesn't mean i won't find it!!",
      "created_utc": 1746685288.0,
      "score": 1
    },
    {
      "id": "mr76db2",
      "body": "bro with all the respect but u say how all the people saying to you over and over again about meet someone can make u better mean u just say to all of these people u have depression, so u literally talk with others about ur problems (whats is nothing wrong) so u already talk with others for better mood but know say u are „angry”???? about people saying some shit to try make ur day a bit bit more better.",
      "created_utc": 1746682683.0,
      "score": -2
    },
    {
      "id": "mrd16vu",
      "body": "Sometimes?",
      "created_utc": 1746761081.0,
      "score": 11
    },
    {
      "id": "mrtmv0n",
      "body": "Right, and they say the truth shall set you free😂😂greatest lie ever told. I hate ppl all the time. A world without so many ppl would be perfect.",
      "created_utc": 1747003130.0,
      "score": 6
    },
    {
      "id": "msah0fn",
      "body": "The things is we don't need them to fix our issues, everyone has issues, we need love and companionship and community ",
      "created_utc": 1747238516.0,
      "score": 3
    },
    {
      "id": "ms9j0o6",
      "body": "More like all the time",
      "created_utc": 1747228201.0,
      "score": 2
    },
    {
      "id": "mscono7",
      "body": "\"just lift bro\"\n\ngod i hate that response",
      "created_utc": 1747262153.0,
      "score": 2
    },
    {
      "id": "mr8rxtm",
      "body": "Or the old 'You need \"help\", that's why I'm unfriending you/trying to fire you/kidnapping you and locking you in an institution.'",
      "created_utc": 1746711691.0,
      "score": 19
    },
    {
      "id": "mr7bw7p",
      "body": "I hate accepting what I can't control. Other people have made my life miserable. Why do I just have to deal with that? They don't face any consequences, but my mental health went to shit.",
      "created_utc": 1746685822.0,
      "score": 38
    },
    {
      "id": "mr6amo7",
      "body": "“Help” is not being cured, more of a assist for you to be able to stand against your own problems. Most of the time it will not affect you as the way you want. The harf part is something only one can do.",
      "created_utc": 1746669074.0,
      "score": 7
    },
    {
      "id": "ms0qf79",
      "body": "Ain't that the truth. They think depression is just feeling sad, and well, they've felt sad before, and they snapped out of it, so, can't be depression is that bad, right? Riiiiight.",
      "created_utc": 1747101195.0,
      "score": 4
    },
    {
      "id": "mr5kmmj",
      "body": "This isn’t true.  It might take awhile, finding a good doctor, finding the right meds, or the right combination of meds, finding someone you can talk to about things.\n\nSometimes it helps to have both a psychiatrist and a psychologist. The psychiatrist will help you with the chemical reasons for your depression, and a psychologist can help you come up with tools to help you get out of the depression.\n\nIt can take a long time, but there is help out there. It’s just that you have to work your ass off sometimes in order to get it.",
      "created_utc": 1746660110.0,
      "score": 21
    },
    {
      "id": "ms0qmev",
      "body": "Hugs.",
      "created_utc": 1747101265.0,
      "score": 2
    },
    {
      "id": "mr7hpdv",
      "body": "You think all that help made you worse or could it have slowed down degrading?",
      "created_utc": 1746689329.0,
      "score": 2
    },
    {
      "id": "mr7jrw1",
      "body": "Getting disability as a disabled person is a special kind of evil that only government could think up. Every time I get denied, I want to die a little more than the last time. I'm not sure how far past rock bottom I go but I bet I'm going to find out. 😞",
      "created_utc": 1746690638.0,
      "score": 14
    },
    {
      "id": "ms0sgmr",
      "body": "Please don't. Life gets better, especially when it ends on its own, freely and without any help. This is just a blip on the screen. A drop in the ocean. Life is fleeting, and it'll be done before we know it. Ride the waves. Look towards the light. Know it's not forever. Fight for that.",
      "created_utc": 1747101883.0,
      "score": 1
    },
    {
      "id": "ms0swoz",
      "body": "Been there. Am there. Sorry you're going through it. You're not alone, even if there's no one around.",
      "created_utc": 1747102032.0,
      "score": 2
    },
    {
      "id": "mstcnvf",
      "body": "“Have you tried exercising” \n“Have you tried moving on and getting back out there?” (Ie dating again)\n“Just go for a walk every day”\n\nI agree with all of this so much. Damn, why didn’t I think of fixing it so easily? Maybe it’s because im fighting with all I have just to survive - to get out of bed, get through work and keep up a facade of being functional - that I don’t have the energy or ability to do anything else. \n\nI hate it when people ask how I’m feeling, the sense that they’re thinking “ god it’s been over a year and still this Debbie downer”. I don’t want to talk about it.  It’s the same, every fucking day. Every day it feels as if someone is ripping the core of my body apart and I’m curled around the agonising pain. And I’m just so *tired*, I don’t want to trudge through life trying to hide the fact that I’m mentally maimed and bleeding saying “tis but a scratch” like a Monty python knight.  I just want to - stop.",
      "created_utc": 1747499307.0,
      "score": 2
    },
    {
      "id": "mrb5o9g",
      "body": "Hahah I called a hotline once and I told them about my feelings and their response was, \"I've often felt like that too\". Ok cool so we're all miserable, maybe I'm not irrational and life isn't worth living.",
      "created_utc": 1746736920.0,
      "score": 5
    },
    {
      "id": "mrpvg86",
      "body": "I like this idea. It would be nice if this sub could be like that.",
      "created_utc": 1746951085.0,
      "score": 2
    },
    {
      "id": "mrmfk52",
      "body": "Yes. This is true.",
      "created_utc": 1746899716.0,
      "score": 2
    },
    {
      "id": "ms0tlhu",
      "body": "Same.",
      "created_utc": 1747102263.0,
      "score": 1
    },
    {
      "id": "mr9b6v1",
      "body": "Sharing stuff said in confidence? Nahh homie that ain’t it 💀",
      "created_utc": 1746717502.0,
      "score": 2
    },
    {
      "id": "mrmfgju",
      "body": "Me too.",
      "created_utc": 1746899684.0,
      "score": 3
    },
    {
      "id": "mrqhmt4",
      "body": "It’s killing me too friend :(",
      "created_utc": 1746964361.0,
      "score": 2
    },
    {
      "id": "ms0u7d1",
      "body": "I'm so sorry. Me too. Me fucking too.",
      "created_utc": 1747102469.0,
      "score": 2
    },
    {
      "id": "mscbqyk",
      "body": "And exactly what would that be? So I can sit in a room, which I've done several times already over the years, and have some moron justify the thousands of dollars he spent on whatever degree he got so he can sit there and tell me I need to breathe? I need to find focus? I need to find an outlet? I need to talk out my trauma? I live my trauma each and every goddamn day What the hell is it going to serve me repeating it to yet another fucking idiot with a high price degree that's just going to tell me to breathe?  oh and the best part they love to ask the question \"Have you had any thoughts of self-harm?\" And if you answer yes no matter how recent those thoughts may have been well they're legally bound to contact the authorities and you'll be in the back of an ambulance going to your local ER for a mental health checkup. Don't believe me? It happened to my son right in front of me. He told his therapist during a phone call that yes he did have times when he thought of self-harm. Within 25 minutes there was a knock on our door and two police officers were standing there because they had received a phone call from my son's therapist. And what did that teach him about opening up? It taught him to keep his damn mouth shut now. I'm sorry that happened to him I even said that later on to him. That I should have told him that was going to happen. Because I know as soon as they ask that question to me I'm going to lie. So where's this professional help you speak of?",
      "created_utc": 1747257981.0,
      "score": 1
    },
    {
      "id": "mscc26a",
      "body": "And don't forget so they can also bill your insurance company for the thousands of dollars they're making off of you.",
      "created_utc": 1747258077.0,
      "score": 1
    },
    {
      "id": "ms0v751",
      "body": "Same. It sucks.",
      "created_utc": 1747102807.0,
      "score": 2
    },
    {
      "id": "msappvs",
      "body": "This is me I hate myself and the world so deeply I insert myself into ever negative situation trying to rescue people but in truth I just wanna meet another me and cry into a big hug that doesn't stop till the pain does I know part of why I'm so sad right now is mother's day and my mother was ... Rough and I miscarried about this time last year after ten years of trying and failing then watching people around me not care for their children when it's the one thing we wanted it's a shit time but no one wants to hear you bitch about how mommy was abusive and how I had to flush my dead baby down a toilet while alone because the doctors were to scared to do a dnc without five thousand tests but don't be sad it was only the size of a bean or that was twenty years ago aren't you over your mommy issues yet ",
      "created_utc": 1747241033.0,
      "score": 1
    },
    {
      "id": "mstdtet",
      "body": "This is personal to me but I just want “I’m sorry things a shit, here if you need me” and a hug. That and honestly it’s the whole actions speak louder than words: don’t press me to talk about it if I don’t want to, don’t make a big deal of it if I quietly decline invitations (“you’ll enjoy it when you’re there”… no I won’t, I’ll just slip to the bathroom to cry) and please cut me some kindness and empathy. The warped glass of my depression means that I see it all through the lens of “I’m worthless and a failure” - if I take something the wrong way (eg as an attack on me when you didn’t mean it) please don’t get angry / defensive, just be kind.",
      "created_utc": 1747499687.0,
      "score": 2
    },
    {
      "id": "mrlvz3f",
      "body": "Right",
      "created_utc": 1746893344.0,
      "score": 7
    },
    {
      "id": "mru8w1p",
      "body": "Yessssssss",
      "created_utc": 1747011500.0,
      "score": 3
    },
    {
      "id": "ms8ogey",
      "body": "Same! I hate people so much, the phrase \"some people don't understand the value of a conversation\" pisses me off the most",
      "created_utc": 1747214167.0,
      "score": 1
    },
    {
      "id": "msc9exy",
      "body": "I've got all that... I'm still not happy I'm still depressed. And I'm still a constant downer to the people around me because of it. I'm constantly apologizing because I'm so fucking depressed all the time. And as I get older it's just getting worse.",
      "created_utc": 1747257274.0,
      "score": 3
    },
    {
      "id": "mscwr0r",
      "body": "Right I work out frequentlyish and am still incredibly depressed and on four different medications just to try to function day to day.",
      "created_utc": 1747264901.0,
      "score": 2
    },
    {
      "id": "mrgtvad",
      "body": "at this point \"help\" is just a euphemism for exile",
      "created_utc": 1746817580.0,
      "score": 16
    },
    {
      "id": "msa85wu",
      "body": "lets be real. Some people need to get help in an institution but not kidnapped.",
      "created_utc": 1747235994.0,
      "score": 0
    },
    {
      "id": "ms0glrx",
      "body": "This right here is 100% the same for me! Very depressed because of people who thrive on hurting other's (even me their own mom) and I already have too many health issues I can't control that keep me down on the daily. I have absolutely no way to wipe it out of my head (except maybe grabbing the so many bottles of antidepressants the doctors keep throwing at me....which make me sick) and I'm tired of doing that! I'm not crazy, just hurt beyond words. That with my health holding me back makes me feel worthless and I can hardly drag myself out of bed while these people who hurt me are out living their best life!",
      "created_utc": 1747097736.0,
      "score": 5
    },
    {
      "id": "mrtnapn",
      "body": "You could say this again, all for other ppl. Was to late for my mental health when I found out ppl ain't shit. I used to live ppl so much but when they hurt you over and over it's always at my expense. Wish I knew better",
      "created_utc": 1747003294.0,
      "score": 2
    },
    {
      "id": "mr6uv7b",
      "body": "🎯",
      "created_utc": 1746676957.0,
      "score": 6
    },
    {
      "id": "ms0prls",
      "body": "This.",
      "created_utc": 1747100971.0,
      "score": 1
    },
    {
      "id": "ms67hmd",
      "body": "How many years of working my ass off will\nIt take god to deem me worthy? I have ran thousands of miles, spend hundred of hours in therapy.",
      "created_utc": 1747175287.0,
      "score": 1
    },
    {
      "id": "mrgbw3t",
      "body": "I applied and was.turned down My step mother got hers, the week after she died.",
      "created_utc": 1746812142.0,
      "score": 3
    },
    {
      "id": "ms0vfzo",
      "body": "I have tried thinking positive since high school but now Im already middle of 30s so I give up. Yes.. Been having a shit life since school and bullied..",
      "created_utc": 1747102894.0,
      "score": 1
    },
    {
      "id": "mrbrf5l",
      "body": "I know right! These hotline things are just freakin useless lol.",
      "created_utc": 1746743957.0,
      "score": 3
    },
    {
      "id": "mrqjhq8",
      "body": "I’m sorry 😔 For both of us.",
      "created_utc": 1746965235.0,
      "score": 2
    },
    {
      "id": "ms33gkf",
      "body": "Sorry for you as well :(",
      "created_utc": 1747141883.0,
      "score": 1
    },
    {
      "id": "msufjbl",
      "body": "Ok thanks for replying. I'll keep that in mind.I personally am glad just to get the you're not alone response.  At least someone heard me and took the time to respond.  Usually i don't get any response, a change of subject or the you can't be depressed because you're not crying. \nI wasn't aware of how people take offense to saying the things that i find comfort in. Thanks for the eye opener.",
      "created_utc": 1747512052.0,
      "score": 1
    },
    {
      "id": "mscvsca",
      "body": "I feel this 100% :(",
      "created_utc": 1747264571.0,
      "score": 1
    },
    {
      "id": "msf31ql",
      "body": "What helped me before when I had all that and was still like that, I know it sounds silly but I did a click myself and just changed my attitude. It helps even if it's fake. If you are on meds that should help, otherwise get some ",
      "created_utc": 1747299776.0,
      "score": 1
    },
    {
      "id": "mrzyk9g",
      "body": "or a euphemism for drugs.",
      "created_utc": 1747091651.0,
      "score": 5
    },
    {
      "id": "ms0pfo1",
      "body": "I felt this. But believe in karma. Their best life will be long gone when that bitch is through with them.",
      "created_utc": 1747100854.0,
      "score": 1
    },
    {
      "id": "ms0reba",
      "body": "You have to get a disability attorney. They tell u what all to gather up for paperwork, but they do everything else, and they don't get paid unless you get paid, so, luck is in your corner, i.e., they always win. (USA)",
      "created_utc": 1747101535.0,
      "score": 2
    },
    {
      "id": "ms0t8wm",
      "body": "They're reading off a screen or from a binder. Enough said.",
      "created_utc": 1747102147.0,
      "score": 1
    },
    {
      "id": "mrqppp0",
      "body": "Me too",
      "created_utc": 1746967968.0,
      "score": 2
    },
    {
      "id": "msxhcu3",
      "body": "I think it’s the fact that the saying of these words can often seem empty if there are no actions to back it up.",
      "created_utc": 1747561121.0,
      "score": 1
    },
    {
      "id": "mt2glw7",
      "body": "Thank you so much for this!🙏 Omg you've no clue how I needed that comment. Especially today! You rock!",
      "created_utc": 1747627091.0,
      "score": 1
    }
  ]
}