{
  "id": "1jyamss",
  "title": "I tried killing myself yesterday",
  "selftext": "I tried killing myself yesterday, I overdosed on 10000mg of paracetamol. I went to sleep and in 8 hours I would have been dying slowly over the next few days. I felt no remorse, no regret, nothing. I was at peace, ready to die. But my parents found me and my organs were saved. I I laid on a hospital bed surrounded by darkness alone the whole night, it was the worst feeling I've ever felt. The pain gets worse and worse, the internal guilt I feel, it doesn't go away, every single day is a burden. I don't deserve love, I don't deserve my family.",
  "created_utc": 1744559177.0,
  "score": 1205,
  "num_comments": 216,
  "url": "https://www.reddit.com/r/depression/comments/1jyamss/i_tried_killing_myself_yesterday/",
  "comments": [
    {
      "id": "mmx5fhw",
      "body": "Did they pump your stomach or were u past that. I'm so sorry. Hospitals are scary lonely places after attempts and I'm my experience I never got treated the best:(",
      "created_utc": 1744562799.0,
      "score": 330
    },
    {
      "id": "mmxkdiw",
      "body": "I was revived 12 years ago and as disappointed as I was waking up in an ER, I look back and am extremely thankful. Nothing in life is permanent, not your feelings or life situation. I was so depressed, I was a 23yr old single Mom that was poor & struggled from addiction. I felt things would never get better. In the past 12 years, I finished college, got sober (10yrs), have the closest relationship to my son, found an amazing husband & have 3 pets that make me happy and feel unconditionally loved every day. If I ended it 12yrs ago, I wouldn't be able to see how everything played out & how amazing things can get. If you're struggling with addiction, get help, there's also obviously help for mebtal health struggles. Life is beautiful... from the food, nature, traveling, family, pets, other relationships... there's so much good out there. You won't get to experience it if you're dead. Life is short, very short, see how it goes... life will surprise you.",
      "created_utc": 1744567342.0,
      "score": 225
    },
    {
      "id": "mmxfmdf",
      "body": "Please stay. As a mom who lost her 15 yr. old son to suicide in 2021, I can tell you that your existence means so much to your family. They love you more than words. You DO deserve happiness. Depression lies to you, telling you things and making you believe things that aren’t true. I’m so thankful you survived your attempt. PLEASE talk to your parents. I wish my son had. Tell them the extent of your feelings. I wish you all the best.",
      "created_utc": 1744565891.0,
      "score": 93
    },
    {
      "id": "mmwwzd0",
      "body": "you survived for a reason. keep going. it’s not over.",
      "created_utc": 1744560129.0,
      "score": 254
    },
    {
      "id": "mmya3hz",
      "body": "I’m glad you’re here. I’m sorry that you’re hurting, but I’m glad you’re here.",
      "created_utc": 1744575547.0,
      "score": 7
    },
    {
      "id": "mmwx5ul",
      "body": "Been there twice . Please stay safe . Praying for you .",
      "created_utc": 1744560184.0,
      "score": 20
    },
    {
      "id": "mmww45u",
      "body": "Live for your family . They do care about you. Imagine what they must have been feeling seeing you in that condition.",
      "created_utc": 1744559862.0,
      "score": 60
    },
    {
      "id": "mmynpxv",
      "body": "I have woken up from an OD where I was unconscious and died, my mother was in the chapel for 13 hours. Guilt and shame is healthy however not in this case. You're suffering my friend; and you don't want to die. You just want relief. Same as us all with this affliction.",
      "created_utc": 1744580017.0,
      "score": 5
    },
    {
      "id": "mn3sy0p",
      "body": "My most serious suicide attempt was similar to yours. I remember falling asleep thinking, this is it, the last moment of my life, and I was okay with that. I fell asleep smiling. But I too was found and brought in and spent a day in a coma and another with full amnesia, and it took years for me to appreciate not dying that day, but it did come. I did find happiness after that incident. Eventually I even created my own family and now I never could kill myself because my children deserve better than that. Ultimately I have never stopped being extremely relieved at surviving my suicide because if my life had ended then, it would have been the saddest life in the world. A little girl is born and abused so badly her whole life that she killed herself at 15 before ever feeling a moment of happiness. I’m so glad that wasn’t my life. Every day I fight to make my life a story of survival and overcoming my battles and being happy despite everything because I’m not going to allow the evils of the world to win. I deserve to be happy.",
      "created_utc": 1744655952.0,
      "score": 5
    },
    {
      "id": "mmx76ju",
      "body": "I’m sorry to hear that. Hearing the word paracetamol brings back memories of my own past. I used to be in constant pain from depression and anxiety, with no proper medication. I kept taking paracetamol over and over, because I was always in pain—but I never really knew what exactly was hurting. At some point, I started to wonder if my body had become immune to it… and whether I might even overdose.",
      "created_utc": 1744563330.0,
      "score": 4
    },
    {
      "id": "mmy1fzm",
      "body": "You do deserve love. You are loved. If you weren’t, they wouldn’t have saved you. You are worthy.",
      "created_utc": 1744572778.0,
      "score": 3
    },
    {
      "id": "mmx8r8t",
      "body": "I’m not sure what you’re going through, I’ve had my own share of such thoughts but have never gone that far. My only piece of advice would be to tell you that your experience can be made a force to hopefully grow and build something anew. Think of it like composting, taking something rotten and using it as energy for something beautiful to bud anew. I won’t go into my own story as to not prolong this comment, but just know that while the battle to change is hard, it’s not impossible. Your thoughts and feelings are valid, but they’re also relative to your perspective, rather than a fair compilation from multiple sources and perspectives. You’re strong for making it this far, and you’re strong for making this post in what I’m hoping is your attempt to find answers to what you’re now facing. While I believe it’s great that you seem to have people who love and care for you, I also think it’s important you understand that you are your own in end, or, you aren’t something to be used and judge as an end to others or others ideas. I myself am a struggling Christian who’s constantly doubting myself. I have panic attacks some times, moments of depression where I’m driving and the temptation to drive off the road is high, but I’ve grown past that because I want something for myself. I’m selfish, but that’s ok. I’ll be selfish, working hard to grow towards my dreams, even as they change shape as I to grow and change. “This too shall pass” one day you’ll be happy, and then you might be sad again, and over and over. I find joy not in the happiness, but in the moments that I can look back at my deepest, darkest moments and smirk at my past self, brag mentally (even if it sounds a little crazy) about how far I’ve come. If you need someone to talk to, I’d go search out a professional, but if you’d rather talk to an online stranger, I’m open to conversation.",
      "created_utc": 1744563809.0,
      "score": 3
    },
    {
      "id": "mmyb0xf",
      "body": "Sometimes the first sign of healing is just saying it out loud even to strangers. You deserve support, not silence. Can I ask, what would feel even a little helpful right now?",
      "created_utc": 1744575846.0,
      "score": 3
    },
    {
      "id": "mmye7cd",
      "body": "Thanks for sharing your story. It reminds me of my attempt I was there alone in the hospital and after that I felt so guilty and ashamed even and extreme sadness. I just went back to “accommodate everyone else mode” and now  7-8 years later I still regret not dying. I even failed at that. Ironic. Life is a bag of dicks.",
      "created_utc": 1744576869.0,
      "score": 3
    },
    {
      "id": "mn3dvln",
      "body": "Disturbing just how similar your story is to mine. Same drug, roughly same amount. I was in a coma for a week. Woke up to being treated like the scum of the earth by a psychiatrist. Then I was put in a ward for a few weeks.\n\n\nYou deserve love. You deserve your family. I hope you're able to get out soon.",
      "created_utc": 1744651544.0,
      "score": 3
    },
    {
      "id": "mn3pqwh",
      "body": "In my first attempt, I tried to OD as well and made sure no one would find me in time. Somehow, and I still don't understand it, I lived. I drifted off and woke up 20 hours later, dehydrated and very sick. I told no one and kept it a secret for a decade.\n\nIn my last attempt, I was hospitalized. That first night is awful. My heart bleeds for you bc I know how that feels, being kept awake by your own self hatred and the doubt that things will ever be better.\n\nBut I want to give you a little circle of thought to contradict the one you're suffering from. \nYou almost died. But you didn't.\nPeople found you. And they decided to save you.\nEven if they couldn't see your pain, they could see your worth. Trust them. You can see your pain, but can't see your worth. Be gentle with yourself. \nBecause you almost died. But you didn't.\nRecovery seems impossible. But it isn't.\nYou're alive now, today, this very moment, and you get to build a better life for yourself this time around. It takes time but you have that time now. Heal today, plan tomorrow, build after that.\n\nI promise you there is a light at the end of the tunnel",
      "created_utc": 1744654992.0,
      "score": 3
    },
    {
      "id": "mmxfltc",
      "body": "Did they not place you on a 51/50 hold?",
      "created_utc": 1744565886.0,
      "score": 5
    },
    {
      "id": "mmx8daj",
      "body": "is this physical pain?",
      "created_utc": 1744563691.0,
      "score": 2
    },
    {
      "id": "mmxjd5b",
      "body": "Been there. Something I told myself when I was there is that I have no idea what comes next but I do know the options I CAN have while I’m alive. I know none of that about what comes next. If there is a game I’ll have to figure out how to play that one too whereas I already know this rules of this world. \n\nIn essence, since you have nothing to lose anyway, why not apply gam theory to how you live your life. It’s quite helpful. Look into it.",
      "created_utc": 1744567033.0,
      "score": 2
    },
    {
      "id": "mmy4e8i",
      "body": "This shows that your parents care about you and now you should care about them and help each other.\n\nYou deserve your parents' love as much as you deserve to give love to them.",
      "created_utc": 1744573730.0,
      "score": 2
    },
    {
      "id": "mn175v4",
      "body": "I try killing myself everyday. Passively. \n\nCall somebody next time. Take care. We will make it thru.",
      "created_utc": 1744621559.0,
      "score": 2
    },
    {
      "id": "mn1av8f",
      "body": "I had a friend who tried that route in college, but we got to him in time as well. That was three decades ago. Today he is happy healthy and living his best life. Please don’t think that where you’re at right now is where you’re going to always be.",
      "created_utc": 1744623968.0,
      "score": 2
    },
    {
      "id": "mn1izet",
      "body": "All I can say is that it’s completely normal to feel like that after a suicide attempt. Oh how we love to beat ourselves up even after the fact. It’s amazing to me the psychological warfare we wage against ourselves. For me, it helps to actually personify my self destructive inner voice as evil. So instead of saying something like I have no hope, I would say it wants me to have no hope. I know this isn’t quite the status quo. I don’t go around saying my inner demon wants me dead. But it sure helps me to put some space in between me and my deadly feelings.",
      "created_utc": 1744628585.0,
      "score": 2
    },
    {
      "id": "mn4i7r9",
      "body": "I did the same thing around the age of 15. My psychiatrist told me if I didn’t tell her right then why I did it she would have me arrested. I still can’t get over how awful she was. That was 30 years ago, but it haunts me to this day. I’m so sorry. But now 30 yrs later (I tried a few more times over the year) I am so glad it didn’t work. I have an amazing husband and two amazing kids. It will take time but life gets better. ♡",
      "created_utc": 1744663609.0,
      "score": 2
    },
    {
      "id": "mn4td43",
      "body": "You are in pain and your brain thinks the only way to protect you is death. You where dealt a bad hand and you are not intentionally unwell so you do deserve love. If anyone deserves love it's you for going through so much and enduring so much. I hope it gets better, even just a little bit and that that leads to more good days than bad. I wish you good karma and that you find people who get you and love you unconditionally and that you get to a place where you believe their love 🫂",
      "created_utc": 1744667153.0,
      "score": 2
    },
    {
      "id": "mnux3gg",
      "body": "I'll probably try tomorrow ",
      "created_utc": 1745026212.0,
      "score": 2
    },
    {
      "id": "mmx3ip4",
      "body": "you survived for a reason. Even if you can’t see it right now, your life still has meaning and purpose. The pain you're feeling is real, but it doesn’t define your worth. The fact that you're still here means there's still a chance..for healing, for peace, for something better. the story still continues, and there’s still time to write brighter chapters..",
      "created_utc": 1744562183.0,
      "score": 3
    },
    {
      "id": "mmxl8qc",
      "body": "Glad you're still here. Do you have a psychiatrist and a good therapist? Are you taking meds? They help.",
      "created_utc": 1744567611.0,
      "score": 1
    },
    {
      "id": "mmybbof",
      "body": "Living for our family is important. No shame or guilt. It’s not easy. But it’s the right thing to do.",
      "created_utc": 1744575942.0,
      "score": 1
    },
    {
      "id": "mmz3f1a",
      "body": "Bruh i took 96 sleeping aid tablets and woke up in a fricking psych ward. smh",
      "created_utc": 1744585436.0,
      "score": 1
    },
    {
      "id": "mn050bp",
      "body": "You deserve to live and love",
      "created_utc": 1744600077.0,
      "score": 1
    },
    {
      "id": "mn0kdif",
      "body": "[removed]",
      "created_utc": 1744607529.0,
      "score": 1
    },
    {
      "id": "mn0ywi6",
      "body": "sending you all of my love. you have nothing to feel guilty about i promise",
      "created_utc": 1744616171.0,
      "score": 1
    },
    {
      "id": "mn247ra",
      "body": "Been there, except I just drowsy and it ended up getting normal. Hope you get the strength to move past this instance. And in the large scheme of things, none of us really deserve anything.",
      "created_utc": 1744637451.0,
      "score": 1
    },
    {
      "id": "mn2f1e1",
      "body": "Just hang on.  You have a purpose you might not know yet what it is but you do.",
      "created_utc": 1744641039.0,
      "score": 1
    },
    {
      "id": "mn32tbl",
      "body": "You deserve love, compassion and respect. You deserve your parents and their love. They deserve to have you. I'm glad you're still here!",
      "created_utc": 1744648265.0,
      "score": 1
    },
    {
      "id": "mn707at",
      "body": "You do deserve love and family. The way I see it is that they absolutely saved your ass, and not just because they're you're family. It's because they love you. Everyone is deserving of love. I hope you find some light in the dark soon.",
      "created_utc": 1744699339.0,
      "score": 1
    },
    {
      "id": "mna00lp",
      "body": "I feel the same way except no one will find me and I will be dead. I see nothing positive ever in my life anymore. I am going to do it in the morning. I just can't take the pain or depression anymore. I have been like this for a year and everyday I feel worst. I can't wait till night time so I know the day is over. ",
      "created_utc": 1744742211.0,
      "score": 1
    },
    {
      "id": "mnc2n7u",
      "body": "everything hurts i want to kill myhself but then look at myself from gods point of view and just think aboiut it not saying anything abpout you jusdt trying to vent sorry for the grammar to lazy to fic to though",
      "created_utc": 1744766292.0,
      "score": 1
    },
    {
      "id": "mndfywv",
      "body": "Yo. Everyone deserves love. Everyone. That means you.",
      "created_utc": 1744789117.0,
      "score": 1
    },
    {
      "id": "mne4gwj",
      "body": "How are u doing? I'd like to hear from u. U have been in my thoughts. 🥺",
      "created_utc": 1744803392.0,
      "score": 2
    },
    {
      "id": "mne9erc",
      "body": "try 12000 next time",
      "created_utc": 1744805478.0,
      "score": 1
    },
    {
      "id": "mnip7qd",
      "body": "When I was laying in a hospital bed after attempting by OD, the woman putting in my cannula started talking to me like I was an idiot. I was really out of it and falling in and out of consciousness but I remember her saying “this isn’t very pleasant is it, you won’t do this again now will you”. I just said that I wanted to.",
      "created_utc": 1744856747.0,
      "score": 1
    },
    {
      "id": "mno0s7n",
      "body": "You sound more like you are saying that you should think you don’t deserve love or your family, as opposed to actually believing this.",
      "created_utc": 1744929652.0,
      "score": 1
    },
    {
      "id": "mnq2nkc",
      "body": "You need to go in a psych hospital. I been twice and it saved me. \n\nEveryone bashes them and I did myself before I went. I did for years until it just got so bad, suicide was all I thought about. \n\nI checked myself in. I was there a few days and tried to leave because I thought it was silly. Then I woke up the next day and went to class therapy and something changed. I somehow realized I had to be the one that made the effort to help myself. I started to listen and participate. I learned the tools to help my day to day life and I’m so happy the psychiatrist told me no.",
      "created_utc": 1744962016.0,
      "score": 1
    },
    {
      "id": "mnreofz",
      "body": "Hey, we've all suffered a tremendous amount throughout all of our lives.i understand my situation may not be as bad as yours, but still, I hope that you will be able to get better! God and Christ will be by your side at all times, because that's how much the Lord cares for you. I've been criticized many times trying to help people on this subreddit, for my work. I hope and pray you will live a good long life, without suicidal thoughts. Best of love! ❤🙏",
      "created_utc": 1744985172.0,
      "score": 1
    },
    {
      "id": "mnuy7r6",
      "body": "I'll probably try day after tomorrow",
      "created_utc": 1745026632.0,
      "score": 1
    },
    {
      "id": "mnv957z",
      "body": "I’ve been there. Being sent to a hospital were you feel no one is there only to then be sent to a mental facility which just gives you meds and makes you feel worse",
      "created_utc": 1745030919.0,
      "score": 1
    },
    {
      "id": "mnz0vyz",
      "body": "“Every single day is a Burden.”",
      "created_utc": 1745089832.0,
      "score": 1
    },
    {
      "id": "mo0b5qg",
      "body": "Do you need a shoulder to lean on",
      "created_utc": 1745105632.0,
      "score": 1
    },
    {
      "id": "mo0vmwp",
      "body": "You do deserve love and rather the guilt was from the attempt or something before or maybe both I’d say your family doesn’t think the same way all and all I really do hope you get the health you need",
      "created_utc": 1745113214.0,
      "score": 1
    },
    {
      "id": "mo1fmzz",
      "body": "Jesus is there bro",
      "created_utc": 1745121336.0,
      "score": 1
    },
    {
      "id": "mo1fvqx",
      "body": "Nobody deserves God's love let Jesus redeem you he wants you trust me he changed my life just explore the religion pls but it's really a relationship not a religion ",
      "created_utc": 1745121450.0,
      "score": 1
    },
    {
      "id": "mmwwa5z",
      "body": "You surely deserve love. Can you take a minute to think deeply if you really dont deserve your family? Are they really better than you?",
      "created_utc": 1744559914.0,
      "score": 2
    },
    {
      "id": "mmx0nt6",
      "body": "I’m so sorry you are going through this you are not alone me 15 years old has tried and failed only problem was I did not have family members to find me. Trust me I know what you are going through and I’m so sorry, you do not deserve to feel like a burden. I wish I could say don’t try to again but that would be contradicting myself because I have tried.",
      "created_utc": 1744561284.0,
      "score": 1
    },
    {
      "id": "mmx64ku",
      "body": "I think you should talk to someone. Know that people love you op",
      "created_utc": 1744563014.0,
      "score": 1
    },
    {
      "id": "mmx374f",
      "body": "Ur life matters <3",
      "created_utc": 1744562082.0,
      "score": 1
    },
    {
      "id": "mmxkqqe",
      "body": "i know your mind has convinced you that you are undeserving or unworthy of love but that is simply not true. YOU ARE & there will come a time when you realize your natural & unique gifts to this world and how its your responsibility to honor and take care of yourself. your mere existence is a gift! do not guilt your able body and capabilities, you have them for a reason. i have 6 attempts under my belt, each time something else saved me but this last time, as i was nodding off i realized there was no more chances here and that god damnit i deserved to live and be happy!! i had to save myself and thats what this ultimately comes down to, in life you must learn to be your own bestfriend and greatest lover, especially in the interim of loneliness or tribulations of hardships with those we build relationships. all of your happiness can not be from external it must be from within. the fact that you have working cells (im assuming) just shows how truly divine you are. life is too short, i know what it feels like to think \"its not short enough, i want out\" but you must find the joys in life, theyre everywhere! a warm cup of tea, a yummy meal to savor for yourself or with loved ones, new experiences travels, being humbled by new hobbies or sharpening up your innate gifts, YOU HAVE THEM!!!",
      "created_utc": 1744567456.0,
      "score": 1
    },
    {
      "id": "mn118nl",
      "body": "You deserve love and family as a human. Your lack of self-worth makes you believe very negative things, i understand those thoughts feels very real. You only live once, you mother spent 9 month in her belly, all the suffering she went through and that's the thank you are going to give her?\n\nHealing require responsibility, you have to be responsible to not hurt yourself anymore as if you would never hurt a friend or a family. Does that make sense?\n\nThere is always hope, the only people who don't jave hope now are the ones who get bombed on their houses, building and cities, no food, only death and suffering.\n\nTake a look at your life and see all thw things you have.\n\nI wish you get better. Know that there is hope.",
      "created_utc": 1744617703.0,
      "score": 0
    },
    {
      "id": "mmx26pz",
      "body": "God kept you alive. You have purpose. We love you",
      "created_utc": 1744561766.0,
      "score": -14
    },
    {
      "id": "mmxjox8",
      "body": "Most of these stories are fiction.",
      "created_utc": 1744567133.0,
      "score": -15
    },
    {
      "id": "mmwx4tu",
      "body": "This is a fake id",
      "created_utc": 1744560175.0,
      "score": -5
    },
    {
      "id": "mmxpcip",
      "body": "Come on,now you can't take flu",
      "created_utc": 1744568901.0,
      "score": -5
    },
    {
      "id": "mmykvsf",
      "body": "this attempt is so stupid",
      "created_utc": 1744579067.0,
      "score": -7
    },
    {
      "id": "mmy0opz",
      "body": "Omg yes I was treated like garbageeeee by the on-call psychiatrist. The nurses were normal but DAMN was she mean.",
      "created_utc": 1744572533.0,
      "score": 150
    },
    {
      "id": "mmy8y1w",
      "body": "they want you to feel guilt/shame so bad it’s fucking weird. i only attempted once, and i remember this feeling vividly. like wtf was her deal?.",
      "created_utc": 1744575184.0,
      "score": 108
    },
    {
      "id": "mmztfuj",
      "body": "That’s such bullshit, I’m sorry you dealt with that. anyone in the medical field needs to have compassion or just be neutral when helping someone, especially after someone tries to comm!t?? I understand the job wears on you but if so, take a break from the job or have a career change.",
      "created_utc": 1744595337.0,
      "score": 16
    },
    {
      "id": "mn1mzib",
      "body": "Also they lock you into a psych ward",
      "created_utc": 1744630522.0,
      "score": 5
    },
    {
      "id": "mn3bjmc",
      "body": "The psychiatrist who spoke to me after I attempted was so cruel. He threatened to have me hospitalized in an institution for several weeks because I couldn't \"get my story straight.\" I had just barely come out of being comatose, had no idea where or who I was, and that's what I was greeted with.",
      "created_utc": 1744650866.0,
      "score": 6
    },
    {
      "id": "mn0v23x",
      "body": "They pumped my stomach for hours I just kept throwing up, the first hospital did a good job. But the second hospital positioned it very crookedly, so it was pulling downwards and I kept throwing up over and over again. The psychiatrist treated me like shit, leaving me alone mentally as if I had no cure and put me in a bed, alone at night away from my family. And the doctors forgot to even give me medication throughout the whole night. That is probably the worst feeling I ever felt, worse than when I tried commiting suicide.",
      "created_utc": 1744613755.0,
      "score": 19
    },
    {
      "id": "mmzcbh0",
      "body": "Thank you for sharing this really sounds like it was a tough but important journey and I appreciate your vulnerability. Your story is super emotional and raw and it’s inspiring.",
      "created_utc": 1744588728.0,
      "score": 29
    },
    {
      "id": "mnp0fud",
      "body": "that’s great all that stuff came round for you, but i am 44 and have been suicidally depressed since my teens. i’m diagnosed with autism, borderline and fibromyalgia. i experience debilitating fatigue and brain fog almost constantly. i’m on disability. i haven’t worked since 2018. my depression is a function of fibromyalgia and has never improved in the slightest. i don’t want to be here. i haven’t for decades. nothing has improved. please stop assuming you know what everyone else’s depression is like. you don’t.",
      "created_utc": 1744942585.0,
      "score": 5
    },
    {
      "id": "mn0rmyf",
      "body": "I feel like I don't deserve them, they deserve a better son than me. That's what I feel deep inside.",
      "created_utc": 1744611674.0,
      "score": 18
    },
    {
      "id": "mn2dpe4",
      "body": "[deleted]",
      "created_utc": 1744640615.0,
      "score": 1
    },
    {
      "id": "mmwyrzg",
      "body": "What makes you think there is intent behind OP surviving ?\n\nIf OP died, would that indicate it would have been a good thing for them to die ?\n\nI find this kind of flimsy rhetoric worrisome. There are better ways to support people than just making shit up and engaging in wishful thinking.",
      "created_utc": 1744560693.0,
      "score": 155
    },
    {
      "id": "mmxbdc8",
      "body": "Nothing in this universe exists for a reason. Everything is by chances.",
      "created_utc": 1744564601.0,
      "score": 29
    },
    {
      "id": "mmxdzui",
      "body": "I think they’re probably aware it’s not over",
      "created_utc": 1744565393.0,
      "score": 0
    },
    {
      "id": "mmww92w",
      "body": "I feel like I don't deserve them",
      "created_utc": 1744559904.0,
      "score": 33
    },
    {
      "id": "mn440yj",
      "body": "You are a good person you deserve to be happy, I don't. I don't feel like I deserve anything.",
      "created_utc": 1744659357.0,
      "score": 1
    },
    {
      "id": "mnezq87",
      "body": "Thank you for your story. My children saved me as well",
      "created_utc": 1744814376.0,
      "score": 1
    },
    {
      "id": "mnvp3r5",
      "body": "My 'light at the end of the tunnel' will NEVER BE.  Try feeling this way for OVER 45 YEARS.",
      "created_utc": 1745038195.0,
      "score": 1
    },
    {
      "id": "mn1g4cq",
      "body": "I have no hope",
      "created_utc": 1744627068.0,
      "score": 1
    },
    {
      "id": "mnuxpxx",
      "body": "Or the day after , That's my birthday",
      "created_utc": 1745026446.0,
      "score": 1
    },
    {
      "id": "mnf00m3",
      "body": "Are you ok? Checking in. Your comment did not go unnoticed",
      "created_utc": 1744814463.0,
      "score": 1
    },
    {
      "id": "mo0wkuu",
      "body": "Don’t do it please don’t reach out to the suicide hotline",
      "created_utc": 1745113571.0,
      "score": 1
    },
    {
      "id": "mnehdsd",
      "body": "Thank you so much for caring, it means a lot. I'm still in a lot mental pain but I'm okay. I hope you are doing good too 🥺",
      "created_utc": 1744808401.0,
      "score": 1
    },
    {
      "id": "mneh4m8",
      "body": "2000mg is so little, there's no difference",
      "created_utc": 1744808318.0,
      "score": 1
    },
    {
      "id": "mnznguk",
      "body": "Yeah but my problems are different, I'm afraid they can't help me.",
      "created_utc": 1745097370.0,
      "score": 1
    },
    {
      "id": "mnwhvks",
      "body": "It's not worth it",
      "created_utc": 1745055545.0,
      "score": 1
    },
    {
      "id": "mmwwg5q",
      "body": "They are good people, I don't feel like a good person, I feel like I lost my humanity and will to live.",
      "created_utc": 1744559965.0,
      "score": 8
    },
    {
      "id": "mmx30da",
      "body": "Are you alright now?",
      "created_utc": 1744562024.0,
      "score": 0
    },
    {
      "id": "mn0vdps",
      "body": "When your mind has blamed you, made you felt guilty for years about something, it's hard to realize it's not true.",
      "created_utc": 1744613955.0,
      "score": 3
    },
    {
      "id": "mmxo01q",
      "body": "Yeah, and your comment is not in the l least bit helpful.",
      "created_utc": 1744568474.0,
      "score": 5
    },
    {
      "id": "mmwxaah",
      "body": "I wish it was fake",
      "created_utc": 1744560223.0,
      "score": 10
    },
    {
      "id": "mn0cj4j",
      "body": "I've committed a serious crime in the past (running from the cops) and when they finally caught me they were nicer to me than the psychiatrist that interviewed me in the ICU after my attempt.",
      "created_utc": 1744603510.0,
      "score": 86
    },
    {
      "id": "mn2g1ht",
      "body": "Similar experience here. I was in NY on a whirlwind tour to drink myself to death (I was using alcohol as a sort of passive aggressive suicide attempt) and I succeeded. Died twice. I didn’t know how much damage was done at the time. The doctor overseeing my care came in only twice during my 1.5 month stay, and what he said to me upon first meeting me was, “You have end-stage liver failure. What’s wrong with you? Why would you choose to do this to yourself?” And I cried because he just told me I was dying again. And he just turned and walked out of the room. I was destroyed. Fucking Albany Med. Ew.",
      "created_utc": 1744641355.0,
      "score": 10
    },
    {
      "id": "mmzktvl",
      "body": "[deleted]",
      "created_utc": 1744591968.0,
      "score": 13
    },
    {
      "id": "mn0rfm0",
      "body": "The psychiatrist made me feel worthless as if all my bad thoughts were real. And made me lay on a hospital bed alone in the dark at night. The second psychiatrist understood me, told me my thoughts aren't real and gave me medication for it and treated me much better.",
      "created_utc": 1744611548.0,
      "score": 48
    },
    {
      "id": "mn0r5on",
      "body": "Absolutely.",
      "created_utc": 1744611385.0,
      "score": 5
    },
    {
      "id": "mne4jf1",
      "body": "Usually yes",
      "created_utc": 1744803423.0,
      "score": 1
    },
    {
      "id": "mne4e1u",
      "body": "I'm so sorry u went through that. I can relate",
      "created_utc": 1744803357.0,
      "score": 3
    },
    {
      "id": "mn0wjlz",
      "body": "🥺",
      "created_utc": 1744614677.0,
      "score": 4
    },
    {
      "id": "mnpt284",
      "body": "Why this happened where you live in ,it sounds like very unfair and treating you very bad is there someone not with you?",
      "created_utc": 1744956153.0,
      "score": 1
    },
    {
      "id": "mnp11gw",
      "body": "So what's stopping you?",
      "created_utc": 1744942820.0,
      "score": 1
    },
    {
      "id": "mn1jgye",
      "body": "You were born buddy, therefore you deserve to live.",
      "created_utc": 1744628830.0,
      "score": 15
    },
    {
      "id": "mn29egi",
      "body": "Your depression is lying to you. You are wanted, very much so. You are loved. I would give anything to have my son here, and I am so thankful your parents still have theirs, and I’m sure they feel the same. They deserve you, and you deserve them. You are worthy of their love, and vice versa. Are you getting any sort of inpatient or outpatient treatment right now?",
      "created_utc": 1744639221.0,
      "score": 4
    },
    {
      "id": "mn2ynk5",
      "body": "If that’s what you really feel, then try to become what you think a better son would be. You might realize you already do most of those things already. There isn’t a price tag when it comes to being loved.",
      "created_utc": 1744647003.0,
      "score": 3
    },
    {
      "id": "mn4u3ga",
      "body": "I totally get you. I sometimes feel really guilty as if I didn't deserve the life and people around me. But the thing is, even if we die, there won't be someone to replace us, our parents wouldn't get better kids. They'll just miss the ones they had. So even if we feel like we're not enough, something is better than nothing I guess...\nThese are just my dumb thoughts tho \nPlease take care 💕",
      "created_utc": 1744667395.0,
      "score": 2
    },
    {
      "id": "mndg0wh",
      "body": "Then be better a little bit every day. Ending things is going to make them hurt sooooo much more.",
      "created_utc": 1744789154.0,
      "score": 1
    },
    {
      "id": "mq3jnmx",
      "body": "Sounds more like your brain is in pain with no clear path out except suicide, so that’s what it’s going with. I’m not good with emotions, nor am I any good comforting people, but if your parents saved you, that can only mean you’re wanted by them. Sure you may not be how you think your parents want you to be but from what you’ve said I’m certain your parents want you alive more than anything. \n\nJust try and remember your thoughts aren’t always your own, I’m out of my depth in terms of actually helping you so this is the best I’ve got",
      "created_utc": 1746138138.0,
      "score": 1
    },
    {
      "id": "mnw3zvb",
      "body": "I was reading through these answers/questions and realized nobody answered you yet. Please tell me you are alive right now and being healthy. Even though i don’t know you I want to cry for you right now, because i felt like this too not even that long ago. I felt like as if i owed the world a huge amount of money and didn’t even have $1 to pay it. I felt like that until the day I overdosed. I remember it like it was yesterday. The pills. The feeling of gambling with my life felt amazing because I thought that that would be my last day and that the next day all my problems would go away. But the next day I woke up. I felt as if I was an even bigger burden to the universe. After that, I tried to get as much help as I could. \n\n          I also felt as if I made so much mistakes and was a burden to my family. But they love you. They love you so much and sometimes they can’t show it but you will always take up space inside their hearts and nothing will ever change that. Go give your parents a hug and say you love them right now.",
      "created_utc": 1745046697.0,
      "score": 2
    },
    {
      "id": "mmx4klg",
      "body": "Much like the unhelpful rhetoric that “everything happens for a reason“",
      "created_utc": 1744562524.0,
      "score": 100
    },
    {
      "id": "mmxbiuo",
      "body": "Exactly. “You were meant to survive” “everything happens for a reason” \n\nGolly gee I feel so much better",
      "created_utc": 1744564647.0,
      "score": 78
    },
    {
      "id": "mmx0mu6",
      "body": "See, that makes more sense than the initial comment.",
      "created_utc": 1744561276.0,
      "score": 9
    },
    {
      "id": "mmx5jar",
      "body": "I believe that it truly takes a shit person to criticize someone on how thay uplifting someone else. Especially in this situation.You should really find better things to do with your time",
      "created_utc": 1744562832.0,
      "score": 26
    },
    {
      "id": "mmwzsbr",
      "body": "[deleted]",
      "created_utc": 1744561011.0,
      "score": -6
    },
    {
      "id": "mmxikhj",
      "body": "There may not be a reason, but he would have been ending luge early due to temporary feelings and feeling stuck in a situation. Nobody's permanently stuck. I was revived from mine as well and it would've been 12 years this past March. I am so thankful, even though at the time I wasn't. My whole life has changed for the better and now I see there are so many great things to experience in this world & live for. You have to find something to make you happy...  traveling, different foods, pets, families and friendships. So, it may not ultimately mean anything, but you can still find a way to enjoy everything. Life is super short anyways & it's such a waste to end it early. You never know how your future will play out.",
      "created_utc": 1744566795.0,
      "score": 1
    },
    {
      "id": "mmyot3z",
      "body": "Extremely nihilistic worldview my friend. If that’s the case then literally nothing matters. No right and wrong. Love is simply a chemical reaction in the brain. Good and bad is simply decided by how u feel in that moment. If somebody wants to commit murder, why not? It feels good to them in that moment so go for it! We’re all random anyway? I’m happy to tell you that isn’t the case bro and that there’s more to life than chance. If it was down to chance we wouldn’t be here. When does impossibility after impossibility after impossibility happen by chance? Would be like somebody winning the lottery 100 million times in a row, if not more!",
      "created_utc": 1744580380.0,
      "score": -2
    },
    {
      "id": "mmxy3vm",
      "body": "What BS is this. Nothing is by chance. Literally nothing. In what fantasy world do you live?",
      "created_utc": 1744571696.0,
      "score": -12
    },
    {
      "id": "mmwy4lu",
      "body": "You *feel* that way but I promise, it's not the truth.\n\nDepression is one of the biggest liars ever. It messes with your head non-stop.\n\nI'm not minimizing your pain, but I'm very confident, even as a stranger, that you do deserve good things and people in life. Those who suffer most are many times the kindest, most empathetic people.\n\nI truly hope you'll be able to see the sun again soon. If only for a second.",
      "created_utc": 1744560490.0,
      "score": 55
    },
    {
      "id": "mmxjch9",
      "body": "They fought for you because you do. So... do right by them and fight for yourself.",
      "created_utc": 1744567027.0,
      "score": 9
    },
    {
      "id": "mmwwusv",
      "body": "Don't think like that. You must be having some good qualities if they care about you ",
      "created_utc": 1744560090.0,
      "score": 10
    },
    {
      "id": "mmx8q0j",
      "body": "I feel the same way. But I know it would devastate them if I tried to kill myself. And that’s not fair to them. Better just to trudge on.",
      "created_utc": 1744563798.0,
      "score": 6
    },
    {
      "id": "mmxhxic",
      "body": "But do they deserve the pain you'd be inflicting on them? That's the rationale that's always held me back from acting on my desire to end it.",
      "created_utc": 1744566605.0,
      "score": 6
    },
    {
      "id": "mnarphd",
      "body": "I used to be 100% convinced I was a bad person too. And for 35 years I truly believed I did not deserve happiness. Then one day after I laughed in the devil’s face, I thought to myself, if I’m brave enough to walk through hell, then why not face myself? I decided to look deep within myself, every crook and cranny, and I even confronted the pit in my stomach that I always felt held the proof that I was a bad person. All I found was a little girl who made peace with yet trauma by believing she was a bad person and deserved it",
      "created_utc": 1744750494.0,
      "score": 3
    },
    {
      "id": "mnvp8de",
      "body": "Join the crowd",
      "created_utc": 1745038260.0,
      "score": 1
    },
    {
      "id": "mo03xuw",
      "body": "Hey! Don’t do that! So not worth it. Things will get better, even if it doesn’t seem like it now. Happy Birthday! You are meant to be here. ",
      "created_utc": 1745103095.0,
      "score": 1
    },
    {
      "id": "mo0x2mz",
      "body": "No don’t do that I don’t know what you’re situation is but there’s always a way out that’s not suicide and a lot of the time it’s through reaching out for help",
      "created_utc": 1745113759.0,
      "score": 1
    },
    {
      "id": "mneyway",
      "body": "I'm hear bc my 2 special needs kids have no one else. I'm alive bc of them.  I am sending u peace and love for your mental pain. Pls try to rest your body and mind. When I was in icu recovering I used to gently hum/sing song lyrics I cld remember under the covers to myself. It helped w the loneliness.  Also stroke your own hands and arms gently and whisper \"your going to be ok\". It sounds strange but any kind of self soothing can help minimize the pain, agony, and long hours. I'll keep checking on you my friend.",
      "created_utc": 1744814128.0,
      "score": 1
    },
    {
      "id": "mnem4ag",
      "body": "then double it",
      "created_utc": 1744810032.0,
      "score": 1
    },
    {
      "id": "mmx35uu",
      "body": "Why don’t you feel like a good person? Why are you judging yourself in this way?",
      "created_utc": 1744562072.0,
      "score": 8
    },
    {
      "id": "mmxjhhl",
      "body": "You can get it back.",
      "created_utc": 1744567070.0,
      "score": 1
    },
    {
      "id": "mo5d4z0",
      "body": "After my second attempt when I was 19, the ER nurse was a big dude who was super mean and basically scolded me, it felt like he was kicking me while I was down.",
      "created_utc": 1745181704.0,
      "score": 4
    },
    {
      "id": "mo3ejna",
      "body": "That's sad",
      "created_utc": 1745158836.0,
      "score": 3
    },
    {
      "id": "mnbm0p3",
      "body": "[deleted]",
      "created_utc": 1744760437.0,
      "score": 1
    },
    {
      "id": "mn00iqi",
      "body": "Honestly I don’t remember what was said, just that she was mean. Like aggressive. Probably trying to “scare me straight” or something. I was 19 and I’m 42 now. She didn’t commit me just kinda yelled at me.",
      "created_utc": 1744598173.0,
      "score": 32
    },
    {
      "id": "mn0w3ys",
      "body": "i promise not everyone’s experience is like that, my nurses didn’t even talk to me. But honestly i would rather have that than how these people were treated! it really just depends on where you are, im in utah so people tend to be a bit more soft here",
      "created_utc": 1744614409.0,
      "score": 7
    },
    {
      "id": "mn0w7p8",
      "body": "that really sucks, srsly i have so much sympathy for you. but you’re not worthless, as long as you have breath in your lungs you have value. lean on your family, you’re not a burden. you’re human with emotions to big for your body, you 100% deserve love, you don’t need to feel guilt or shame for simply existing or for anything that might have happened to you.",
      "created_utc": 1744614473.0,
      "score": 14
    },
    {
      "id": "mn111lu",
      "body": "The first one sucks at their job its really hard to find good psychiatrists. Your feelings are valid (in the sense that obviously youd feel bad bc youre in a bad place), of course you'd feel like shit bc look at your situation, you're going through a lot right now and I'm really sorry about that. But no matter your situation or thoughts or feelings you are always still deserving of love",
      "created_utc": 1744617574.0,
      "score": 8
    },
    {
      "id": "mnznkr3",
      "body": "It is what it is. I've been with my family the last week.",
      "created_utc": 1745097409.0,
      "score": 1
    },
    {
      "id": "mnp1jtg",
      "body": "cowardice.",
      "created_utc": 1744943020.0,
      "score": 2
    },
    {
      "id": "mmy993x",
      "body": "or that “one day…” bullshit",
      "created_utc": 1744575280.0,
      "score": 28
    },
    {
      "id": "mmxlnna",
      "body": "I understand the effort to be helpful but I do wish more folks understood that empty platitudes are not really emotionally helpful or satisfying when you feel so low. I’m not sure I have the answer on how best to respond, but the empty words do not produce the results that you might expect.",
      "created_utc": 1744567739.0,
      "score": 54
    },
    {
      "id": "mmy1ok0",
      "body": "I think that it truly takes a shit ability for critical thinking to not notice that users of this sub upvoted support for criticism way more than your comment. \n\nDo you care about feeling like you’re helping people or do you care more about actually listening to the way they feel to help them better ?",
      "created_utc": 1744572854.0,
      "score": 13
    },
    {
      "id": "mmx00c6",
      "body": "The highest « reason » we see, the intents and desires we observe, are present in sentient beings. In consciousness. No need for a higher force intervening.\n\nCompassion for your fellow sentient beings for instance is a good reason to live, and it requires no supernatural belief.",
      "created_utc": 1744561081.0,
      "score": 0
    },
    {
      "id": "mmyql11",
      "body": "Im not here to debate or prove anything. You agreeing or disagreeing doesn’t make it any more or less objective.",
      "created_utc": 1744580973.0,
      "score": 6
    },
    {
      "id": "mmyplqw",
      "body": "And if this doesn’t convince you, congratulations! You won the lottery 100s of millions of times in a row just to be here! Cherish that win and be grateful for it! And don’t let outsiding factors like evil shitty people ruin your win!",
      "created_utc": 1744580647.0,
      "score": -1
    },
    {
      "id": "mmxzrp4",
      "body": "Unfortunately, your logic is backwards…. No offense.",
      "created_utc": 1744572234.0,
      "score": 4
    },
    {
      "id": "mnauwsm",
      "body": ":( I did exactly that. I realized im a good person, that there's absolutely no proof of me being a bad person at all. And I was happy. But after such a long time your so used to the pain and the guilt they consume you.",
      "created_utc": 1744751459.0,
      "score": 2
    },
    {
      "id": "mnayumr",
      "body": "And I have done bad things. I’ve done some very bad things. That doesn’t make me a bad person. What makes you a good or bad person depends on what you do afterwards. Do you feel remorse and make attempts to change your behaviour? Or do you feel nothing and only make attempts to not get caught again? As long as you have remorse, you are not beyond redemption.",
      "created_utc": 1744752701.0,
      "score": 1
    },
    {
      "id": "mnf1p5s",
      "body": "No matter what I do, the pain and agony hurts more and more, it's so painful I can't describe it, i feel like I don't deserve to live or be loved by anyone.",
      "created_utc": 1744814964.0,
      "score": 1
    },
    {
      "id": "mnemipa",
      "body": "If you double your height I'll do it.",
      "created_utc": 1744810170.0,
      "score": 1
    },
    {
      "id": "mmy0u0e",
      "body": "people say it bc they mean it. would u rather them not support at all? i think thats worse",
      "created_utc": 1744572581.0,
      "score": 4
    },
    {
      "id": "mmxnt24",
      "body": "Knock it off. You're meaning to tell me if you had a failed attempty and you decided to tell reddit and all you got was supportive comments.It wouldn't move you?",
      "created_utc": 1744568413.0,
      "score": -17
    },
    {
      "id": "mmy7rtc",
      "body": "Obviously I cared, that's why I committed. Isn't this the best place to ask for help?I mean seriously for a guy that acts as smart as you do.It's strange that you didn't pick up on that",
      "created_utc": 1744574811.0,
      "score": 0
    },
    {
      "id": "mmx0ips",
      "body": "Then his parents intervene for a reason bc they love him so its a reason to keep going and it shows ppl want him here",
      "created_utc": 1744561240.0,
      "score": 11
    },
    {
      "id": "mmx98mx",
      "body": "Okay, but I subscribe to \"If you survived, you did for a reason\" not because of some supernatural assumption, but because it itself is a motivator that allows me to take inventory on my person & situation.\n\n\"I still have the opportunity to live, I didn't blow it\"\n\nCritique it if you so desire, but it has kept me alive & prevented suicide attempts of my own.",
      "created_utc": 1744563956.0,
      "score": 3
    },
    {
      "id": "mmzq918",
      "body": "Ik you’re not bro, that’s just the thing though it’s not objective at all. The exact same goes for you. I was just trying to give you another point of view that is a bit less depressing 😂👍🏻 hope your good ❤️",
      "created_utc": 1744594084.0,
      "score": -2
    },
    {
      "id": "mnc1uok",
      "body": "I understand. I often hate being stuck in a world that’s so unfair to good people and I feel so much resentment sometimes that it’s hard to go on. But it comes down to perspective. If you focus on the bad, all you will see is bad and more bad things will come to you. Try to count your blessings instead, no matter how small or trivial they might have to be at first. Once you start feeling gratitude, you will find more things to be grateful for. And remember that depression is like a deep dark hole that may take time to crawl out of, but don’t discredit any step you take to crawl out. Every step in the right direction is a good step and it counts. You never know just when, but one day you will wake up feeling better.",
      "created_utc": 1744766005.0,
      "score": 1
    },
    {
      "id": "mnh0tpl",
      "body": "I'm so very sorry",
      "created_utc": 1744835973.0,
      "score": 1
    },
    {
      "id": "mnpthyx",
      "body": "Please you don’t think so just get well soon and this world is your, then you feel the nature and go outside ",
      "created_utc": 1744956413.0,
      "score": 1
    },
    {
      "id": "mnv73ht",
      "body": "Checking in... are u still in the hospital or are u in psych",
      "created_utc": 1745030077.0,
      "score": 1
    },
    {
      "id": "mmyjsir",
      "body": "The “you survived for a reason” line feels very empty. Many of us wonder why the hell we’re here and long for purpose and value. “You survived for a reason” means some higher power preferred torturing you your entire life until you got this low without giving you an answer and still may not provide said answer for who knows how long. “You survived for a reason” is not comforting. It is empty. It is vacuous reasoning with no promise of relief from the internal pain. It is the promise of a gift which is forever out of reach.",
      "created_utc": 1744578700.0,
      "score": 30
    },
    {
      "id": "mn046wi",
      "body": "Is this the same \"they mean it\" as when they post \"I'm always here if someone needs to talk?\"\n\nBecause I can assure you, the moment you take them up on that offer, they'll find every excuse on the book not to talk.",
      "created_utc": 1744599718.0,
      "score": 7
    },
    {
      "id": "mmy1swu",
      "body": "If the supportive comments are based on some bullshit claims, it may isolate people even further.\n\nRead the room. You are getting downvoted into oblivion meanwhile people are telling you all they want is meaningful support.",
      "created_utc": 1744572894.0,
      "score": 11
    },
    {
      "id": "mmy1y74",
      "body": "Then say that.\n\n« You still have the opportunity to live and turn things around. Don’t blow it. »",
      "created_utc": 1744572942.0,
      "score": 5
    },
    {
      "id": "mnzn61l",
      "body": "I'm at home with my family. I don't trust myself being alone.",
      "created_utc": 1745097268.0,
      "score": 2
    },
    {
      "id": "mn04fcm",
      "body": "thats totally valid i wasnt referring to that specific statement i myself have been told that so ikwym but again i do still think people trying to support someone in their own way is way better than just not saying/doing anything. its nice to know ppl care and are trying to support you (it can literally save someones life) and again i think they truly mean it. i just also think its harmful to say these kinds of things arent valid or okay to say to someone and deeming it as non helpful, let people show support it might really help someone someday",
      "created_utc": 1744599822.0,
      "score": 2
    },
    {
      "id": "mn04zl0",
      "body": "well thats sad, personally if i offer support then im there for them truly and help as much as i can. i dont make a promise if i dont plan on pursuing",
      "created_utc": 1744600068.0,
      "score": 1
    },
    {
      "id": "mmy8xc5",
      "body": "You can't read a room that you're not you must be triggered responding to comments that weren't directed towards you. I don't give a shit about downvotes. It doesn't prove anything",
      "created_utc": 1744575178.0,
      "score": -10
    },
    {
      "id": "mn05xbd",
      "body": "That's kind of you but based on the experience I (and a lot of other suicidal people) have is that they're mere platitudes to keep someone who doesn't want to be here anymore, alive.\n\nThat's all they are, just a thing to say so you (the general you, not you personally) can sleep at night, knowing that you said the thing that \"saves\" a person or make them feel less suicidal.\n\nThe only result is that now, the next time, this person will not come to you anymore because they don't get any support. Just rehashed words they've heard a million times before.\n\nAnd yes, I'm bitter. That's what happens when you wanted to be dead for the past 12+ years.",
      "created_utc": 1744600477.0,
      "score": 5
    },
    {
      "id": "mn08shk",
      "body": "ok im not tryna argue but ive been/am still going thru my own struggles for a long time too so i know exactly what u guys are saying. but i also just think its unfair to tell ppl to stop showing their support they CAN give/offer and in turn making people silent/non supportive bc of the perception u guys are creating. if that makes sense. idk i dont agree with you guys on that, but i agree that when u are wanting to not be here those things dont really help. again tho im not gonna ask someone to stop bc thats mean imo and also damaging. also if thats the only support they can give i still think its unfair to dismiss it bc its \"not good enough\", u cant force/expect someone to take care of you/others, drop everything and give their full emotional energy. im also not dismissing that theres ppl out there that do say these things to feel better themselves but i am not talking abt those people i am talking abt real genuine ppl who mean what they say and have no bad/selfish intentions.",
      "created_utc": 1744601764.0,
      "score": 3
    },
    {
      "id": "mn0zoul",
      "body": "Try wanting to be dead the last 40 years.  It sucks.",
      "created_utc": 1744616680.0,
      "score": 3
    }
  ]
}