{
  "id": "1j8pxbx",
  "title": "Advices for depression is fucking trash",
  "selftext": "Just a little rant but I’m at a point in my depression where any advice just doesnt do anything for me. I feel like I’ve heard it all before and it’s the same shit on repeat:\n\nFind love\n\nHobbies \n\nGym bruh\n\nWalk in nature \n\nLook at the trees \n\nSex \n\nTherapy\n\nHobbies\n\n“It gets better”\n\nYour family will miss you\n\nYou’ll die anyways might as well stick around\n\nFocus on the positive bruh\n\nFood\n\nMore hobbies \n\nJesus Christ\n\nGod/Allah\n\nHave kids \n\nTalk to others\n\nCrisis Hotline\n\nDepression is a state of mind\n\nGet rich \n\nLife is a blessing\n\nLife is what you make it \n\nJust have fun \n\nMORE FUCKING HOBBIESSSSSSS!!!!!\n\nI don’t even know why I try anymore. For me the suffering to reward ratio in life is so fucking horrible, I just might go on a hedonic journey before ending it. But I get it, we don’t know what the fuck is going on and why we’re here. We just create meaning and run with it because what else can we really do?",
  "created_utc": 1741697268.0,
  "score": 839,
  "num_comments": 288,
  "url": "https://www.reddit.com/r/depression/comments/1j8pxbx/advices_for_depression_is_fucking_trash/",
  "comments": [
    {
      "id": "mh9qfqi",
      "body": "Just hopping on here to say that we maintain a wiki with lots of evidence-based alternatives to all the examples of trash (an accurate description!) responses OP has listed.  Although it's primarily intended for our community, most of the guidance is equally applicable to IRL interactions. \n\nhttps://www.reddit.com/r/depression/wiki/giving_help \n\n**tl;dr Advice is not support -- advice is fundamentally *un*supportive**",
      "created_utc": 1741726148.0,
      "score": 1
    },
    {
      "id": "mh71i8r",
      "body": "I feel like a physical hug, and having a big cry together, then cuddle, will help a lot\n\nI'll cook pancakes for everyone in the morning when you guys wake up\n\nBut... There's no one around me hahaha\n\nJUST FUCKING KIDNAP ME AND LET ME LOVE YOU AND LET YOU LOVE ME, PLEASE SOMEONE JUST FUCKING DO IT",
      "created_utc": 1741697819.0,
      "score": 210
    },
    {
      "id": "mh74ufm",
      "body": "I hear the same garbage daily.  So many people with low/zero idea on depression act like they know what they're talking about, and some ideas sound as to magically fix what's going on. \n\nMake a list for yourself (not the ones actually struggling) and pretend like you care \n\nTalk in inspiration \n\nMake up something for others to listen\n\nInstead of:\n\nListening to understand \n\nOffer actual advice based on circumstances instead of generic answers\n\nFor the majority of us, medication, money, and/or someone who loves us as-is will fix the majority of our problems.",
      "created_utc": 1741699035.0,
      "score": 74
    },
    {
      "id": "mh7674i",
      "body": "Doing hobbies when you’re depressed is literally impossible. Like straight up undoable. It’s horrible advice",
      "created_utc": 1741699507.0,
      "score": 135
    },
    {
      "id": "mh78y2e",
      "body": "“Have kids” is such a terrible one, SMH. Like save the hypothetical kid(s) some trouble by NOT bringing them into existence while you can’t even take care of yourself!!",
      "created_utc": 1741700433.0,
      "score": 65
    },
    {
      "id": "mh75m31",
      "body": "pointless fucking life",
      "created_utc": 1741699303.0,
      "score": 45
    },
    {
      "id": "mh76vss",
      "body": "It really is. It’s like if you ever call in crisis (certainly here) the advice is ‘have you made a cup of tea? Tried a warm bath? Read a book?’ Ma’am if I drag myself out of bed to have a bath that’s a good day. My brain is fried and I can barely focus to read a magazine let alone a book. What does tea have in it that antidepressants don’t and if it’s so good why is it not prescribed?! 🤦‍♀️ Sheesh.",
      "created_utc": 1741699741.0,
      "score": 32
    },
    {
      "id": "mh7h6ij",
      "body": "This is not ment to sound mean or anything but your list is so accurate i nearly spilled my coffee laughing 😂 but no, i believe that while some can recover from depression (which im super happy!) i do believe that cases like mine where its severe and has lasted for like decade or more you have only  extremely small chance to get better",
      "created_utc": 1741703054.0,
      "score": 27
    },
    {
      "id": "mh7ucyr",
      "body": "Wow, I've never heard \"have kids\", that's the worst fucking advice for someone with depression, jesus",
      "created_utc": 1741706993.0,
      "score": 22
    },
    {
      "id": "mh77cyv",
      "body": "[removed]",
      "created_utc": 1741699902.0,
      "score": 34
    },
    {
      "id": "mh79lx2",
      "body": "Life have to kill and demolish the old you first before it gives you a new and better you. Hang in there because a better mindset is coming your way",
      "created_utc": 1741700652.0,
      "score": 12
    },
    {
      "id": "mh7kl3c",
      "body": "It’s one thing I can’t stand about the advice people give me, and that’s empty platitudes. Just the usual stuff they say so they don’t have to be bothered with you. That just makes me angry because everything they suggest I already tried, and it didn’t help.",
      "created_utc": 1741704092.0,
      "score": 12
    },
    {
      "id": "mh88fyb",
      "body": "A few billion dollars would also do it",
      "created_utc": 1741711027.0,
      "score": 10
    },
    {
      "id": "mhakshr",
      "body": "I honestly hate the word hobby after lurking on this sub",
      "created_utc": 1741735002.0,
      "score": 10
    },
    {
      "id": "mh82gl2",
      "body": "having kids during a time of crisis is quite possibly the worst advice i have ever heard regarding mental health. how are you supposed to take care of little children when you can’t even take care of yourself?",
      "created_utc": 1741709319.0,
      "score": 8
    },
    {
      "id": "mh8rvx2",
      "body": "I feel you big time. I hate I am still where I am 7 years on after first being signed off work and what do I see in those 7 years. Decisions I made in the hope for a better version of myself yet in actual fact it has just been survival. My therapist asked me to define my goal - what my life I want to live looks like and it feels impossible. I have been journaling about it but even the ambition to strive for that has gone. Everything I’ve tried or done just feels like a distraction with no plan, no building blocks on top of each other. Honestly I’m coming to realise the sheer scale of the acceptance of how sad and lonely I feel and the struggle I have with trying to find the end of the tunnel and the light everyone says is there. I feel hopeless defeated and deflated.",
      "created_utc": 1741716480.0,
      "score": 8
    },
    {
      "id": "mh80n9x",
      "body": "If I hear one more time about CBT.......",
      "created_utc": 1741708800.0,
      "score": 7
    },
    {
      "id": "mh8xnks",
      "body": "I’m tired of hobbies.. I don’t have any fucking energy jaha",
      "created_utc": 1741718110.0,
      "score": 7
    },
    {
      "id": "mhcmpfd",
      "body": "And then they tell you get on medication and you just end up a numb robot",
      "created_utc": 1741765834.0,
      "score": 9
    },
    {
      "id": "mh7uht6",
      "body": "People just say the darnest things when they don’t know what else to say. I’d ignore them.",
      "created_utc": 1741707032.0,
      "score": 6
    },
    {
      "id": "mhaeejk",
      "body": "People just don’t understand how depression works. I should say how depression controls everything around you and about you. I will say this sometimes my wife will heavily persuade me to go ride my bicycle. When I get back I feel a lot better.",
      "created_utc": 1741733082.0,
      "score": 6
    },
    {
      "id": "mhaqcuu",
      "body": "Honestly, as a real reply, something that forreal worked for me but definetly is not the way to do it. scroll reddit especially this sub and just try to help people. makes me feel like i'm doing something w my life when in reality im just a fucking reddit degen.",
      "created_utc": 1741736737.0,
      "score": 9
    },
    {
      "id": "mhc8vb9",
      "body": "I really hate it when I tell them I have no self-esteem and they respond with: go to the gym bro. Damn, not all problems are solved by going to the gym.",
      "created_utc": 1741757385.0,
      "score": 6
    },
    {
      "id": "mh7ye1o",
      "body": "🤣 meant in the most understanding and sincere way— not making light of it just I have to laugh a lil bit cause it’s really good post.",
      "created_utc": 1741708164.0,
      "score": 6
    },
    {
      "id": "mhb1yro",
      "body": "OMG THIS IS EXACTLY WHAT I NEED LIKE WHY THE FUCK DO THEY KEEP ASKING US HOBBIES LIKE FUCKING HELP ME ESCAPE!!!!!!!",
      "created_utc": 1741740475.0,
      "score": 6
    },
    {
      "id": "mh8827u",
      "body": "Read the title and was like YUP.",
      "created_utc": 1741710915.0,
      "score": 6
    },
    {
      "id": "mh97z8g",
      "body": "For me there is no fun no colour no joy in anything, I just want anybody to be my side just to talk but my severe mood swings will land me anywhere from seeking attention to ignoring and then hustling for hours. I have lost the power to think in a better way as well as I have noidea where I am heading to . I HAVE EVERY LOW MOMENTS OF MYLIFE IN FRONT OF MY EYES , I have cried several times in front of others or alone but I just hate sympathy or empathy or I just hate myself . WTH I am writing I don not know .",
      "created_utc": 1741721009.0,
      "score": 5
    },
    {
      "id": "mhavunh",
      "body": "To be fair, getting rich could help alot, the question is how 😂",
      "created_utc": 1741738498.0,
      "score": 5
    },
    {
      "id": "mh76xsm",
      "body": "[removed]",
      "created_utc": 1741699760.0,
      "score": 12
    },
    {
      "id": "mh9vlzg",
      "body": "What if you feel your life has no meaning? Busted my ass, for what? Educated and no job, married husband dying of a terminal illness, house falling apart, most people I love are deceased,  my pets are deceased, and the few left are living in different states.\n\nI am tired of fighting for everything. I so want to give up. \n\nI am recently retired, and my life did not turn out as planned.\n\n.",
      "created_utc": 1741727590.0,
      "score": 4
    },
    {
      "id": "mh75wfx",
      "body": "I took my antidepressants and then pulled myself out of it on my own. It's hard but doable.\n\nProblem is that in that state you want an instant result but it doesn't work like that, sadly. What may help is not talking to others but getting a real body double.  Even if this person is going through depression as well. In my case it was my long distance friend who was making music (as i do) who was not just depressed but also diagnosed with schizophrenia. And was heavy alcoholic once. He quit drinking one day, got a job and managed to get better too. Inner voice VS real echo chamber are different things, so body double might work.\n\nAnother thing is mindset. Once i began focusing on what progress i did today (even if it was so little) instead of what i didn't do it began to get better. Real mind experiment, like going to gym and get to set yourself to improve every day. Having support from others helps.\n\nAll in all, it took me about 1.5 years to get out of it. I got laid off, had to relocate, been unemployed for \"only\" 2 months, had to live off of my credit card. It's 6 months since i got new job and still haven't paid my debt. But at least i'm stable now. Also i almost stopped my anxiety, which is another long story (i'm 35, by the way)\n\nI also thought that exercising won't do until i got into mundane life living from weekend to weekend. So i began ice skating with my wife and felt that even single session improved my mood. I always found running or typical gym stuff boring due to its repetitive nature. I still find it boring but now i know that it can really help so i substituted it with playing Stepmania or doing exercise bike (while playing games). But maybe i'll go for a run some day.\n\nAnd it seems that each stage of depression or anxiety needs to be treated differently. Somehow find a way to keep going and trying. It's really to begin, but once you start to recognize those \"mood swings\" it may become more manageable.",
      "created_utc": 1741699403.0,
      "score": 8
    },
    {
      "id": "mh95a20",
      "body": "Does depression ever end? Seems endless to me no matter what I do",
      "created_utc": 1741720244.0,
      "score": 3
    },
    {
      "id": "mhafvrb",
      "body": "When I am in a dark place, telling me to \"have kids\" is the fastest way to assure that I will stick to pleasantries and will never be around you longer than a couple minutes. I can't think of a better way to indirectly tell someone \"I'm dense and don't understand nuance, and you should never be vulnerable around me.\"",
      "created_utc": 1741733506.0,
      "score": 3
    },
    {
      "id": "mhbyvlp",
      "body": "I hate the word hobbies.  What are\nYour hobbies?  Fuck off is what I feel like saying",
      "created_utc": 1741752447.0,
      "score": 3
    },
    {
      "id": "mhce4x0",
      "body": "This thread is so good.",
      "created_utc": 1741760414.0,
      "score": 3
    },
    {
      "id": "mheocq3",
      "body": "Brothers…depression is an illness. It’s a condition like diabetes, genetic and biological. It’s your body.  \n\nTherapy helps, changing your life conditions and your maladaptive behaviors helps, but the 70% of it is physiological, so if you can’t feel better, just go and see a psychiatrist, tell them your symptoms and how you feel and stick with medications.  \n\nThey will change your life for the better.  \n  \nIt’s not possible to turn your life around if you are depressed because real depression kills you day by day, no energy, anhedonia, unstoppable rumination of dark thoughts, physical pains, your gut is fucked, either you can’t eat or you eat too much, you are sleepless at night and just want to sleep all day, and you fall into addictions.",
      "created_utc": 1741796526.0,
      "score": 3
    },
    {
      "id": "midi1k7",
      "body": "This'll get downvoted because it's not pandering which this sub loves but here goes. Heres some none therapy for you. CHANGE YOUR LIFE. You've burdened yourself with what you think you want when in reality it doesn't serve. Stop following the crowd. Just because no one really has a clue what they're doing doesn't mean you should blindly follow. Stop trying to hide yourself in hobbies, Jesus or therapy. Go face the mirror, ask yourself what will truly make you happy and don't move from that spot until you get a fucking answer. That is what I told myself 9 months ago and it was the beginning of my new life. My life is literally bearded guy in the van down by the river and I'm am euphorically happy. I changed everything in my life. EVERYTHING. Not because I'm edgy and cool but because I couldn't bare to be in the world as I was. I stopped trying to make myself fit into something I didn't even understand. You are living your life according to what others say, do and want. No wonder their advice doesn't work for you. Go live that life you've always wanted but you've been too insecure to make reality. Nobody is watching, this isn't getting uploaded to social media, you're not answering nor influencing anyone. Unplug from this. No noise is scary at first then it becomes fucking tranquil. Stop grinding for a future that is getting further away from attainable. Go travel the world. What have you got to lose apart for your soul crushing existence? Stop stressfully clinging onto everything that's ever come into your world as if trophies justify your being and just let them naturally come and go. Seriously just fuck off and do what makes you happy. You have no one to answer to. You have no one to ask permission for. There is no one out there you should seek advice from regarding what will make you happy. This is your life and the world can be whatever you want it to be. Everyone with depression has a darkness in their head. But from my experience they also have a light in their heart. I think it's time you started listening to that part of you abit more. Take a risk. We are most alive on the edge. 3 months, 6, a year. You could be anyone anywhere. Learn some self compassion, accept collective humanity and go govern your own life",
      "created_utc": 1742265786.0,
      "score": 3
    },
    {
      "id": "mh7m8l1",
      "body": "Either we stay down or elevate ourselves, the amount of effort at the end of the day is the same.\n\n\nI know you dont want to hear it. I have lurked here for close to a decade at this point, and have had the same feelings as many people here. I only recently changed my perspective and it has changed my life for the better. Start somewhere small and use it as a foundation to build yourself up.",
      "created_utc": 1741704591.0,
      "score": 4
    },
    {
      "id": "mh8r5ye",
      "body": "Let me add one\n\nThey always say ohh tell your friends how you feel maybe they can support you. I tell them my friends don't want to talk about it. They say oh well maybe you should tell them and they can hear you. Like wth are ou deaf. Ffs",
      "created_utc": 1741716274.0,
      "score": 2
    },
    {
      "id": "mh9ccdi",
      "body": "The only thing that gets me out of deppsession is just waiting it out",
      "created_utc": 1741722240.0,
      "score": 2
    },
    {
      "id": "mh9kzfk",
      "body": "I'm just here, and I have no friends and the only thing that makes me happy is a double cheeseburger from McDonald's but it also makes me fat so there's the cycle of depression. I'm sorry you're feeling like this. There is no advice for depression. It's there just like death and taxes.",
      "created_utc": 1741724644.0,
      "score": 2
    },
    {
      "id": "mha6hv2",
      "body": "You basically covered everything hahaha. People will do anything, but see your point, huh",
      "created_utc": 1741730717.0,
      "score": 2
    },
    {
      "id": "mhaio54",
      "body": "If you’re at the point where none of those things work then you need to speak to a psychiatrist. No advice is going to help your brain, but medication can def make a difference",
      "created_utc": 1741734343.0,
      "score": 2
    },
    {
      "id": "mhb3a60",
      "body": "You have the motivation to type this tho",
      "created_utc": 1741740912.0,
      "score": 2
    },
    {
      "id": "mhez6w3",
      "body": "People who are depressed don’t need advice to do more of this or that - the depression keeps you from wanting to do any of it. What people who are depressed need is LESS. They need to realize that they hold themselves to unrealistic standards, force themselves to believe in things they don’t believe, want things they don’t actually want. They need to bring their standards for themselves into alignment with who they are, what they want, what is possible and to let go of what is unreasonable or idealistic. What they need most of all is compassion - a feeling of empathy and sadness for someone who feels depressed, as there is literally no worse feeling in the world — it is the feeling of unbearable pain stemming from self hatred, but hating yourself too much to even let yourself have your tears and sadness about how sad it is that you hate yourself.",
      "created_utc": 1741799622.0,
      "score": 2
    },
    {
      "id": "micr5ap",
      "body": "Life is a shit hole that drags you through the mud, if you're down. BUTT! There's also tea....and I really like a good cuppa.",
      "created_utc": 1742256421.0,
      "score": 2
    },
    {
      "id": "mii2jpf",
      "body": "Just 1 tight hug with a genuine“Let’s talk, I am here for you” would work x10 better than all this bullshit which people tell me.",
      "created_utc": 1742330134.0,
      "score": 2
    },
    {
      "id": "mhb2ocn",
      "body": "Yeah we've heard most of the same advice and while it sounds redundant we have to make our own advice to follow. Answers that come from within are exponentially more effective. I think at a certain point you'll want to stop the mental chaos and then maybe one day you did something simple like make your bed or some other seemingly trivial thing and then you think \"damn I never do that, maybe I'm not so useless as I thought \" . Little things snowball into positive big things, depression just works in the opposite way snowballing negative thoughts and emotions",
      "created_utc": 1741740710.0,
      "score": 1
    },
    {
      "id": "mhbdup1",
      "body": "The last thought I had before I awakened:\n\n\"It would be a damn shame if you never found out what you can really do.\"\n\nThen I began a fitness journey and haven't looked back.",
      "created_utc": 1741744467.0,
      "score": 1
    },
    {
      "id": "mhbiz74",
      "body": "Yeah I totally get it. Most the people dropping advice don't even know the slightest thing about being depressed yet want to try to act like they know how to solve it",
      "created_utc": 1741746221.0,
      "score": 1
    },
    {
      "id": "mhbo5jl",
      "body": "One thing that helped me personally is finding a job it sucked  all my mental energy... who thought a 9 to 5 is a good thing lol the idea depression thrives on emptyness as your mind is all open for all the negative stuff but when completly occupied with other stuff you kinda forget. Another thing is i accepted that i have it and would make me suffer so i dont run to fast relief stuff but true as they said it gets better over time as for how long your mind can torture you with the sad miserable ideas? 1 time 2 times 10 times 1000 times at some point the negative ideas will loose steam so be patient.",
      "created_utc": 1741748091.0,
      "score": 1
    },
    {
      "id": "mhbympu",
      "body": "the only thing that mildly even helps me is sleeping or angry fucking crying and throwing a big fucking fit. sleeping makes is bearable. sleep is friend",
      "created_utc": 1741752338.0,
      "score": 1
    },
    {
      "id": "mhc4fcc",
      "body": "To my husband: \"Why don't you just take her off those meds and see how she does?\"",
      "created_utc": 1741755075.0,
      "score": 1
    },
    {
      "id": "mhcp574",
      "body": "As a fellow depressed soul but also someone about to start working in healthcare, I wanna ask you\n\n\nIf not all this then what'd you want from a stranger? The people around you who know you well and care for you can do a lot of stuff like take care of you, but what do you expect to hear from a stranger/doctor?\n\n\nGenuine question. I completely get you. I'm also going through a rough patch. ",
      "created_utc": 1741767424.0,
      "score": 1
    },
    {
      "id": "mhctnu8",
      "body": "Yup. It’s annoying af. It’s with good intent I guess but lol ppl just jump into problem solving mode when you say you’re depressed. Or they get all scared when you express that you’re just over it. They’re like but u should b grateful for l i f e. GRatEFuL dAT u R aLivE!!! (Despite all the hardships u just described to them…)\n\nI mean yah it is all a cool crazy miracle to b here. Life could b beautiful but not the way society has been set up. You’re born without asking for it. And then society is like oookay. Instead of just napping around a river all day here’s all the things u need to do to survive. Cuz I said so. \n\nWe’re not special. Our rules/morals/ways of how life should look like… all made up by us. End of the the day we’re just another animal whose body wants to naturally survive.",
      "created_utc": 1741770405.0,
      "score": 1
    },
    {
      "id": "mhd7v00",
      "body": "I am with you 100%\nEvery gap I got so far got taken away from me, that one window of lite in the dark room. \nAll people just ignore me and my presence when I ask them something.\nI am a musician, yea fcing good on the sax, but still life is a misery, no job, no studies because of financial problems, A boosting problem of ADHD and ADD. Any other job I tey to get, my mind postpones it automatically asif i can not control it. \nLife is really just a pain in the ass.\nI'd be better if I juat end it, but how is the question...",
      "created_utc": 1741778518.0,
      "score": 1
    },
    {
      "id": "mhd999t",
      "body": "Don’t forget arts and crafts and coping skills!!!!!!!!!!!!",
      "created_utc": 1741779193.0,
      "score": 1
    },
    {
      "id": "mhd9a7u",
      "body": "The most irritating part about the advice for me, which is nobody’s fault but my own, is to just put more time into my hobbies and I’ll see the meaning of life.. I can’t find a single hobby that I want to be doing. Maybe the occasional video game or tv show? All very passive shit. Every other hobby I’ve tried does not do a thing for me. I truly have tried a lot. I truly am anhedonic and apathetic as hell.",
      "created_utc": 1741779205.0,
      "score": 1
    },
    {
      "id": "mhdmze0",
      "body": "Hobbies are overrated \nI’d say tho, find a good show to binge xD",
      "created_utc": 1741784833.0,
      "score": 1
    },
    {
      "id": "mheoghi",
      "body": "People will often just say these things to you. It feels like they're more concerned about being \"correct\" than actually understanding and helping you. Combating depression doesn't start with some one-liner piece of advice. You actually have to speak to the depressed person and really break down and understand why they feel the way they are, AND look at it from a big-picture/macro lens. \n\nHowever, no matter how many times someone will tell you that \"I'm here for you\" or \"You can talk to me\", they just end up giving the same one liners to you.",
      "created_utc": 1741796556.0,
      "score": 1
    },
    {
      "id": "mhfyjwq",
      "body": "Why isn't medication on your list?",
      "created_utc": 1741809696.0,
      "score": 1
    },
    {
      "id": "mhhroh4",
      "body": "Everyone will tell you it will get better and just hang in there. It doesn't. Nothing changes if nothing changes is the best quote i try to live by. Some days are hard and some are harder. At the end of the day those around you will act like they care when in reality they wouldn't understand your problems. Every depression is different. So just live with the hope that one day it'll be different and take it one day at a time. If you're stuck remember that the pyramids took a couple decades to build but they are still standing.",
      "created_utc": 1741829829.0,
      "score": 1
    },
    {
      "id": "mhjmwjd",
      "body": "Just think about your situation harder like think about what make you feel better,if there’s something  you want to do etc etc",
      "created_utc": 1741863565.0,
      "score": 1
    },
    {
      "id": "mhkkd30",
      "body": "Hello everyone,   \nI recently had clinical depression followed by a long anxiety episode recently (couldn't explain why).  \nTo keep it short here are these ACTUAL issues/useful things I found (no thanks to doctors):\n\n1. I found I had very low testosterone (makes you much more likely of depression / anxiety). Find ways to fix this (TRT, Tongat Ali, gym, sunlight, sleep, diet, etc. - working on this)\n\n2. A trick for getting out of a anxiety episode (temporary trick but useful) is to drink ginger ale and burp, some bad gasses are released will get you out of a very bad anxiety episode\n\n3. Make really good close friends (people you can share very close things). Still working on this as well but their is a good Diary of a CEO episode on friends. \n\nThe indoor, no sunlight, individualistic, lifestyles we live are killing us, but hope this helps.",
      "created_utc": 1741876215.0,
      "score": 1
    },
    {
      "id": "mhn9kli",
      "body": "I don't recommend this but weed helped me",
      "created_utc": 1741903943.0,
      "score": 1
    },
    {
      "id": "mhnr0wq",
      "body": "I used to call people without depression \"the happy people.\" Maybe that's not accurate or true... but reminding myself that \"the happy people\" don't really understand helped to keep me from screaming in people's faces. It's super frustrating. I feel your pain, OP!",
      "created_utc": 1741909379.0,
      "score": 1
    },
    {
      "id": "mht3awi",
      "body": "It’s hard to be happy when you don’t feel like being happy. My bf always tells me that I act distant/uninterested and idk what to tell him because it’s just straight depression. Like I’m not trying to be an asshole, I just can’t find it in me to pretend to be something I’m not.",
      "created_utc": 1741983536.0,
      "score": 1
    },
    {
      "id": "mhtikku",
      "body": "Therapy? Lmao! Been there done that. Therapist was another sheep who told me I'm just \"choosing to be negative\". I'm 39 years old and have felt this way since I could form logical thought.  Life is what you make of it....oh the lols 😆 ",
      "created_utc": 1741987962.0,
      "score": 1
    },
    {
      "id": "mhv4h2g",
      "body": "You're not wrong.",
      "created_utc": 1742007991.0,
      "score": 1
    },
    {
      "id": "mhxgcgz",
      "body": "I am christian and have depression. Many people in christianity will say just pray and stuff but I think this is a real illness and it needs to be treated with medication. I haven't tried that yet though because I'm too afraid to talk to a therapist. I went once years ago and the woman made me feel worse. She prescribed meds to me though which I later took all at once to attempt suicide. It didn't work. I should've just taken them normally, maybe it would've helped me.",
      "created_utc": 1742050567.0,
      "score": 1
    },
    {
      "id": "mhyvq6b",
      "body": "ok so what   \nwhy we are trying to prevent suicide   \nwhats the problem   \nmy only reason to not kill myself is that it is forbidden in religion \n\nbecause everyone got their kind of sufferings  \nmy suffer is these suicidal attempts and chronic sadness \n\nso what   \nothers suffer from different things   \ni believe if i remained patient enough i would be rewarded equal to my suffering \n\nok i am sad \n\nbut hey wtf \n\nlike wtf \n\nso what?  \ni want to kill myself \n\nso what?  \nfuck me i suck i suck so what?  \nwhy bother \n\nwhy should i care \n\ni will just suffer from all of this so i heal \n\nI just tell my body: Do or feel or think whatever you want, i am out, i died a long time ago for me \n\nand i killed myself with no mercy \n\nbut what the hell does any of that even mean.... nothing but some fucking shit my body has made \n\nyou might love yourself and you don't want to suffer like that \n\nbut so what \n\nwhy i don't kill myself so? idk maybe i am a fucking coward, maybe my body isn't ready yet \n\nmy advice is stop seeking advices \n\nand stop ingesting unhealthy coping mechanisms \n\njust eat to stop hunger \n\ndrink to stop thirst \n\nand scream as loud as you can \n\nbreak your chains \n\nbut don't die \n\njust freak out \n\nand become more animalistic \n\nlive on instincts for a while \n\ni don't mean to live in the wild but go wild as a human \n\nand swear at me if you want \n\n  i will just swear back \n\nwell i don't suppose being absurd \n\nits just fuck everything \n\nif you feel terrible \n\nthen feel terrible its ok \n\nfeel terrible and show others how you feel terrible \n\nif you were sad \n\ncry long enough\n\nif you were angry get angry \n\neven if it was self-destructive behaviors \n\ntry to manage as possible (by not running and isolating) \n\nstart to destroy your personality\n\nkill memories \n\nbut these are the final choices of course \n\nand what's wrong with being depressed \n\nyeah you might hit yourself like i do every night \n\nbut so what",
      "created_utc": 1742066595.0,
      "score": 1
    },
    {
      "id": "mi2h6wd",
      "body": "Yeah most people don't realize that we don't wanna die, we just don't want to continue playing, that's all, and apparently dying is the only reliable option.  Yeah.\n\nAnyways someone once said to me, \"you arent actually finding and escape, you just finding a reason to stay\"...",
      "created_utc": 1742122084.0,
      "score": 1
    },
    {
      "id": "mi5p8n9",
      "body": "I am Muslim as well. Do you think Allah will forgive me for my decision?",
      "created_utc": 1742161203.0,
      "score": 1
    },
    {
      "id": "mi6yhoc",
      "body": "Life just sucks. Filling your time is the only way to limit thinking about how trash life is or to prevent full crash outs. Nobody has the right answer. Just get through thisexistence. Figure out your brainshit later",
      "created_utc": 1742176652.0,
      "score": 1
    },
    {
      "id": "mi94ld2",
      "body": "My favorite is my main stressor is financial but no one will give me a fucking chance or when I had different business ventures just some hypocritical life is precious bullshit but no actual interest in helping.",
      "created_utc": 1742216906.0,
      "score": 1
    },
    {
      "id": "mia2nku",
      "body": "In elementary school I got diagnosed with depression and the only thing that got me outta bed was tv. My Little pony, YouTube, anime hell even Disney Junior shows. My life may have been bad but I always had access to the Internet or something similar. Hurts now to realize I learned human empathy from cartoons but whatever it took to keep me alive",
      "created_utc": 1742227690.0,
      "score": 1
    },
    {
      "id": "mie57e7",
      "body": "i mean i get it, i try my best i really do. i wish i was normal. i hate that life is unfair, we either kill ourselves eventually or get over it",
      "created_utc": 1742276295.0,
      "score": 1
    },
    {
      "id": "miefvoo",
      "body": "How tf i do my hobbies if I don't find my hobbies is exciting 😭",
      "created_utc": 1742282957.0,
      "score": 1
    },
    {
      "id": "miexodb",
      "body": "if i read another fucking \"you need hobbies\" lmao i swear to god- literally all i do all day is my hobbies- gaming, drawing, gardening, and playing with my cats. It doesnt make a fucking difference- ive tried everything else and this is what i like to do. Im still depressed and lonely as hell",
      "created_utc": 1742294283.0,
      "score": 1
    },
    {
      "id": "mifejxu",
      "body": "The reality is that there is no God, we are here because of random accident and the universe was never designed to be compatible with or hospitable to human life specifically. We are all caught in this horrible trap called being alive until we are dead. No one actually knows what the fuck they're saying or doing. This world was born on fire and every inhabitant is running around with their hair in flames until they drop dead and charred. There is no hope. There is no answer. I hope we all die as soon as possible.",
      "created_utc": 1742301916.0,
      "score": 1
    },
    {
      "id": "miiv56r",
      "body": "OMG YES\n\nLike no I can't just \"find the energy\" BECAUSE ITS NOT THERE",
      "created_utc": 1742338671.0,
      "score": 1
    },
    {
      "id": "mojezvs",
      "body": "Like literally a simple fucking HUG would be better than any of this",
      "created_utc": 1745373456.0,
      "score": 1
    },
    {
      "id": "mqzogto",
      "body": "That because most depression is fueled by social anxiety and bullying fear.",
      "created_utc": 1746581105.0,
      "score": 1
    },
    {
      "id": "mt5rndi",
      "body": "Alr anyone got tips on how to stop SH?",
      "created_utc": 1747677521.0,
      "score": 1
    },
    {
      "id": "mh75qg2",
      "body": "Omg we should indeed collect all the depressed people and build a community cuddle puddle! I like talking to people that understand depression better than neurotypical people anyway",
      "created_utc": 1741699345.0,
      "score": 101
    },
    {
      "id": "mh73j1t",
      "body": "I would kidnap you but I don't have the gas money.",
      "created_utc": 1741698563.0,
      "score": 19
    },
    {
      "id": "mh72pdx",
      "body": "Deal. I FUCKING LOVE PANCAKES 🫂",
      "created_utc": 1741698265.0,
      "score": 12
    },
    {
      "id": "mh73juu",
      "body": "this sounds so good can i have a burnt ish pancake pls i like it more when the ends are crispy",
      "created_utc": 1741698571.0,
      "score": 12
    },
    {
      "id": "mhapsrs",
      "body": "cmere kidnap me, make me feel wanted. idc who you are, what you identify as, ur age, or what your politcal stance is make me pancakes, lemme cry w u, cuddle me, hug me. love me.",
      "created_utc": 1741736560.0,
      "score": 5
    },
    {
      "id": "mh970ru",
      "body": "I second this someone kidnap me and love me please 😭",
      "created_utc": 1741720738.0,
      "score": 3
    },
    {
      "id": "mhbks1m",
      "body": "I need a physical hug that will last at least an hour.",
      "created_utc": 1741746857.0,
      "score": 5
    },
    {
      "id": "mh87m3x",
      "body": "i miei amici mi hanno abbandonato qualcuno che la gia passato potrebbe dirmi cosa devo fare ho 0 amici",
      "created_utc": 1741710786.0,
      "score": 3
    },
    {
      "id": "mi32a97",
      "body": "I'll bring the blankets",
      "created_utc": 1742132104.0,
      "score": 2
    },
    {
      "id": "mhnntzi",
      "body": "Man I really wanna say that I don’t think that would help but I’ve never tried it",
      "created_utc": 1741908364.0,
      "score": 1
    },
    {
      "id": "mhr401l",
      "body": "That would be so nice.",
      "created_utc": 1741962414.0,
      "score": 1
    },
    {
      "id": "mh7ag6g",
      "body": "It’s beyond annoying. It makes you not even want to reach out anymore.",
      "created_utc": 1741700924.0,
      "score": 36
    },
    {
      "id": "mh99xtd",
      "body": "How am I supposed to find someone who loves me as-is? A big part of the reason I'm depressed is because I'm insufferable",
      "created_utc": 1741721560.0,
      "score": 11
    },
    {
      "id": "mh7aoub",
      "body": "THANK YOU!  Like sorry Brandon but I’m already struggling to fucking shower every single day. I don’t have the energy for hobbies.",
      "created_utc": 1741701001.0,
      "score": 66
    },
    {
      "id": "mh7p138",
      "body": "Fr when ppl suggest it, they show a fundimental missunderstanding of how depression functions. Depression is like a blocker of that engine inside of a human that makes you go on in life- from hygiene to hobbies and connection with other to dreams and goals. I mean technically you can force yourself to literally drag your body to go do a hobby, but its just not going to be as when youre outside of a depressive episode.",
      "created_utc": 1741705421.0,
      "score": 40
    },
    {
      "id": "mhdqc92",
      "body": "I’ve never really had hobbies. I mean I could name a few but they aren’t really hobbies. Maybe just interests? But yeah I never really had hobbies even when I was not depressed (sigh that seems like such a distant past lol). So I def don’t have hobbies now. Like I’m depressed and do not enjoy doing anything. I’ve tried to think of hobbies I can do, but then I lose the motivation. \n\nLike someone else said below, the hobbies are more like distractions. But damn I’m just trying to get myself out of bed.",
      "created_utc": 1741786011.0,
      "score": 3
    },
    {
      "id": "mha3ato",
      "body": "Exactly. Do they think I wouldnt do my hobbies if I could??",
      "created_utc": 1741729785.0,
      "score": 2
    },
    {
      "id": "mhcqxyk",
      "body": "My hobby is designing album covers and I do it all the time, but it’s not like that makes my depression go away, lol. For some reason I think people assume that it would solve it.",
      "created_utc": 1741768625.0,
      "score": 1
    },
    {
      "id": "mh8mxo7",
      "body": "Well not impossible, you can play 5 mins of piano, and then it may grow into 5-10 or even 20 mins.\n\nDepression is not supposed to be fun, but it IS supposed to be livable \n\nFeelings change.",
      "created_utc": 1741715098.0,
      "score": 0
    },
    {
      "id": "mh7c3qc",
      "body": "“But our purpose is to reproduce. That’s why your depressed” FUCK OUTTA HERE",
      "created_utc": 1741701453.0,
      "score": 36
    },
    {
      "id": "mh9a8q9",
      "body": "Who is going to help me reproduce? No one wants to be around someone like me let alone sleep with me",
      "created_utc": 1741721648.0,
      "score": 4
    },
    {
      "id": "mhvfen3",
      "body": "Have kids is the worst advice ever.\n\nI will never have kids. \n\n No chance.\n\nFuck this",
      "created_utc": 1742012805.0,
      "score": 1
    },
    {
      "id": "mh88xvn",
      "body": "My depression is like  a cycle many years of suffering followed by a period of “wellness” repeat. Once I figured out my pattern I really took advantage of the periods of wellness because I never knew how long they would last… never long enough 😢.",
      "created_utc": 1741711168.0,
      "score": 11
    },
    {
      "id": "mhdrz2p",
      "body": "Same. I have persistent depressive disorder. not officially but I find most therapist just diagnose you as having depression. Anyway, I’ve had “functional depression” for like 18 years now. With a few bouts of happiness that only last a few months. At this point, I’m not even trying to be “not depressed”. I’m just trying to better the symptoms a little.",
      "created_utc": 1741786568.0,
      "score": 5
    },
    {
      "id": "mh796y9",
      "body": "[removed]",
      "created_utc": 1741700515.0,
      "score": 12
    },
    {
      "id": "mh7bmjv",
      "body": "[removed]",
      "created_utc": 1741701301.0,
      "score": 9
    },
    {
      "id": "mo4a1w5",
      "body": "For treatment, yes. But otherwise, money has no value for me with depression.\n\nAnd I say that as a kid in a family that struggled for decades financially and now we are somewhat stable finally.\n\nMoney is not what made me more happy after all or not with depression, CPTSD and worse going.",
      "created_utc": 1745169033.0,
      "score": 1
    },
    {
      "id": "mhfxtmb",
      "body": "Taking life one day at a time has left me stagnant for years. Only getting more isolated each day.",
      "created_utc": 1741809490.0,
      "score": 3
    },
    {
      "id": "mhd9ov0",
      "body": "And if the first ten don’t work, you just haven’t found the right medication.",
      "created_utc": 1741779398.0,
      "score": 5
    },
    {
      "id": "mhhfe0f",
      "body": "Works for me too. Just gotta make it to the saddle and start pedaling.",
      "created_utc": 1741825752.0,
      "score": 2
    },
    {
      "id": "mhfwwc0",
      "body": "Heard something similar to that once. Something like, ‘depressed people smile the brightest so no one else has to feel miserable’. Idk something along those lines",
      "created_utc": 1741809232.0,
      "score": 1
    },
    {
      "id": "mhd9n6z",
      "body": "And not everybody can realistically go to the gym. Sometimes my psychiatrist gets onto me for not going to the gym despite explaining to her my health issues every single times it’s suggested. I walk and that’s about the best I can do. Is really an irritating suggestion.",
      "created_utc": 1741779376.0,
      "score": 2
    },
    {
      "id": "mh925t4",
      "body": "Sometimes you really do have to laugh at this shit 🤣",
      "created_utc": 1741719363.0,
      "score": 8
    },
    {
      "id": "mhb4unr",
      "body": "EXACTLY! Sorry but oil painting isnt doing it for me. Guess I need to seek psychiatric help 🤣",
      "created_utc": 1741741439.0,
      "score": 4
    },
    {
      "id": "mhfx53j",
      "body": "Unfortunately hobbies often require much more energy and motivation than we’re capable of",
      "created_utc": 1741809300.0,
      "score": 3
    },
    {
      "id": "mhhg0db",
      "body": "Or, maybe living in a society where getting rich wasn't the main goal or the only ticket to mental wellness and people actually had each other's backs!",
      "created_utc": 1741825955.0,
      "score": 5
    },
    {
      "id": "mh7dca3",
      "body": "Im starting to adopt this mindset honestly. Idgaf about a legacy or being remember. Hell im sure 99% of us dont even know our great great great grandparents names. Maybe one day I can actually live by this mindset and stop doing the bullshit i dont care about.",
      "created_utc": 1741701846.0,
      "score": 9
    },
    {
      "id": "mhfwcsz",
      "body": "Recently retired, how old are you? Would you be willing to tell a little more about your life? What you’ve described is just such a nightmare for me",
      "created_utc": 1741809079.0,
      "score": 1
    },
    {
      "id": "mh7csq5",
      "body": "Where did you get your motivation from?",
      "created_utc": 1741701675.0,
      "score": 7
    },
    {
      "id": "mh9bnnq",
      "body": "It really depends on you and your depression. Sometimes for people it is a few years of being low for others it is lifelong. The severity and degree are all different between people but there is a lot of overlap in terms of symptoms. \n\nI think the thing is you learn to live *with* depression, to know what triggers you and what helps or temporarily soothes it. Depression is kind of like a wild beast, you can learn it’s behaviors and patterns but it still might test you.",
      "created_utc": 1741722050.0,
      "score": 3
    },
    {
      "id": "mie5um2",
      "body": "Great comment, what I was looking for in this thread.",
      "created_utc": 1742276665.0,
      "score": 1
    },
    {
      "id": "milwzxm",
      "body": "this might be it",
      "created_utc": 1742387625.0,
      "score": 1
    },
    {
      "id": "mhaqwtc",
      "body": "At this point you start thinking it’s intentional 🤣",
      "created_utc": 1741736913.0,
      "score": 1
    },
    {
      "id": "mhb4m2u",
      "body": "🤣🤣🤣",
      "created_utc": 1741741359.0,
      "score": 1
    },
    {
      "id": "mhfhyd6",
      "body": "Ily",
      "created_utc": 1741804971.0,
      "score": 1
    },
    {
      "id": "mhfzlw2",
      "body": "I’d expect professional advice and guidance from my doctor. My doctor who spent many years studying and helping others with similar problems",
      "created_utc": 1741809994.0,
      "score": 1
    },
    {
      "id": "mhnrf8l",
      "body": "P.S. Funnily, I think 95% of the time, all I wanted was for someone to say, \"I'm sorry you're in pain, but I'm here for you.\" It's kinda odd... but that's a surprisingly tall order...",
      "created_utc": 1741909505.0,
      "score": 1
    },
    {
      "id": "mi9psz0",
      "body": "Do not",
      "created_utc": 1742223879.0,
      "score": 1
    },
    {
      "id": "mh76bn1",
      "body": "I’d be down for this. Atleast with people who actually struggles with depression  ACTUALLY understands and doesnt make it sound like its easy as 1,2,3 🥰",
      "created_utc": 1741699550.0,
      "score": 62
    },
    {
      "id": "mh75sym",
      "body": "I’ll make everyone a pour over, espresso, or latte",
      "created_utc": 1741699369.0,
      "score": 25
    },
    {
      "id": "mhcb6bs",
      "body": "You know what.... I would absolutely love that... maybe have a local meet up.\n\nI think only depressed people are the only ones that knows exactly how we all feel.  The one question i hate the most is \"How are you doing today?\" My response back is how the fuck you think I feel, has my situation changed from yesterday? No it hasn't, just leave me the hell alone.\"\n\nI am extremely bitter to my friends and I don't mean to be but most of the time I am angry, frustrated and depressed. And I think to myself why can't I get diagnosed with cancer. Then I know it will be all over soon.",
      "created_utc": 1741758671.0,
      "score": 13
    },
    {
      "id": "mh764av",
      "body": "We'll need a basement the size of a modern cistern, and many comfy fluffy beds",
      "created_utc": 1741699480.0,
      "score": 11
    },
    {
      "id": "mh7dkz0",
      "body": "This is brilliant.💗",
      "created_utc": 1741701922.0,
      "score": 5
    },
    {
      "id": "mi9dvzk",
      "body": "Depressed people...Gotta Catch 'em All.",
      "created_utc": 1742220151.0,
      "score": 2
    },
    {
      "id": "mhh2bkh",
      "body": "Misery loves company",
      "created_utc": 1741821563.0,
      "score": 1
    },
    {
      "id": "mh7402h",
      "body": "I'll accidentally fall asleep at your doorstep 😴😴👀😴 hope no one kinaps me 🤭",
      "created_utc": 1741698732.0,
      "score": 16
    },
    {
      "id": "mh774r9",
      "body": "i have pancake recipes and gas money where yall at",
      "created_utc": 1741699824.0,
      "score": 12
    },
    {
      "id": "mh73d65",
      "body": "With what sauce or toppings? :0\n\nMy favourite is butter and syrup... Maybe some berries will be nice too 😋",
      "created_utc": 1741698503.0,
      "score": 6
    },
    {
      "id": "mh79hmz",
      "body": "I've made home made one from flour, sugar, and forgot the other ingredient.  But like 3 or 4 total ingredients plus milk.",
      "created_utc": 1741700613.0,
      "score": 3
    },
    {
      "id": "mh747py",
      "body": "Yes, I'll do my best to fry the perfect crispy pancakes for you\n\nNow tell me, what sauce or toppings do you want on them?",
      "created_utc": 1741698810.0,
      "score": 6
    },
    {
      "id": "mhaq57g",
      "body": "CWISPY PANKAKES. CWISPY PANKAKAS. OOOOOH GOOOOOOD IDEA",
      "created_utc": 1741736670.0,
      "score": 6
    },
    {
      "id": "mh96j46",
      "body": "I am working on perfecting a thing I saw on IG where they cooked the pancake in heavy cream.  The milk solids brown up nicely and it has a browned butter flavor.  Would pair beautifully with your maple syrup!",
      "created_utc": 1741720599.0,
      "score": 6
    },
    {
      "id": "mhbwhly",
      "body": "I wanna hug you so much 😞 it sucks how nearly everyone here is on different continents and in different countries",
      "created_utc": 1741751416.0,
      "score": 3
    },
    {
      "id": "mh7bll1",
      "body": "Right?!\n\nWhat I discovered is some people actually use others depression as a MLM (Multi Level Marketing) opportunity instead of actually being a decent human and respecting those who need actual help instead of a financial opportunity.",
      "created_utc": 1741701293.0,
      "score": 11
    },
    {
      "id": "mhcbtjb",
      "body": "Yes exactly... but this depression thread has been very helpful to me",
      "created_utc": 1741759047.0,
      "score": 2
    },
    {
      "id": "mhcbxgf",
      "body": "The someone who really loves you will understand your depression and help you find ways to cope.",
      "created_utc": 1741759110.0,
      "score": 4
    },
    {
      "id": "mhct0yr",
      "body": "Sometimes just getting out of bed is the challenge. Doing other simple tasks feels pointless.",
      "created_utc": 1741769992.0,
      "score": 13
    },
    {
      "id": "mh7lw4f",
      "body": "THIS.",
      "created_utc": 1741704486.0,
      "score": 18
    },
    {
      "id": "mh7xaql",
      "body": "Technically or however you want to put it - I often CAN’t even ‘drag my body’ for just so many things … even when I know basically what I want it to do.   and when I do the energy is so low it’s in tiny little bursts.\n\n(its why I have history of stimulant use but had to finally stop them for good few years ago)",
      "created_utc": 1741707849.0,
      "score": 15
    },
    {
      "id": "mhcfw3n",
      "body": "i think they just think of mild depression, when executive functioning is still working. severe depression shuts down that completely",
      "created_utc": 1741761491.0,
      "score": 9
    },
    {
      "id": "mh7xosw",
      "body": "It's about having distractions in your life in general, not magically picking up crocheting in the middle of a depressive episode. ",
      "created_utc": 1741707961.0,
      "score": 2
    },
    {
      "id": "mhe0s7g",
      "body": "Can’t or won’t?",
      "created_utc": 1741789392.0,
      "score": 1
    },
    {
      "id": "mhgvke1",
      "body": "That sounds awesome!",
      "created_utc": 1741819497.0,
      "score": 2
    },
    {
      "id": "mh8bftt",
      "body": "that sucks, i truly wish you could find a way to get into a better state of mind permanently",
      "created_utc": 1741711872.0,
      "score": 7
    },
    {
      "id": "mh80wuu",
      "body": "I’ve always struggled with mild depression and during my pregnancy my child’s father just up and left us and then my mom died… I can’t believe I ever thought I even had depression before all of that happened. I’m a shell of who I once was and every single ounce of happiness and energy I have goes to my son. I feel so much guilt but I can’t go back and change my mind now. But I can educate and share my story with others. I love my kid more than life itself, that’s what makes this so hard. So many people think children will fix or save them.. and I’m not going to lie when my mom died I held on DEEPLY to the hope that he would balance out that pain, but life doesn’t work like that, nor is it ever going to be his responsibility to take on any of my trauma. Sorry for the trauma dump, again I just hope my experience can at least help someone who’s maybe questioning a pregnancy now or even having children in the future while suffering with depression. \nI admire the HELL out of those who don’t have children and make peace with that decision. Those seem to be the happiest people i know.",
      "created_utc": 1741708874.0,
      "score": 6
    },
    {
      "id": "mhfyxr9",
      "body": "100%. It is a mantra of some fellowships I have been in for a while. I respect that it has worked for others but for me. One day at a time has in fact just ended in isolation as you say and I feel everything in my world is getting smaller and smaller until it doesn’t exist anymore. It’s really quite demoralising to come to terms with and I am beating myself up for doing stuff, life, choices wrong. It’s just gone 8pm where I am and I’m going for a shower and bed. I can’t stand it any longer and I’m so tired. Insomnia has been a big burden to so each day I don’t wake up feeling refreshed or rested. The grind continues…",
      "created_utc": 1741809803.0,
      "score": 3
    },
    {
      "id": "mhhgdw1",
      "body": "I can’t wait until the weather gets better",
      "created_utc": 1741826077.0,
      "score": 1
    },
    {
      "id": "mhfz5lm",
      "body": "We try to help because it helps us live vicariously through others ig. at least for me helping makes it seem like I can make a difference in the world",
      "created_utc": 1741809864.0,
      "score": 2
    },
    {
      "id": "mhhh7fc",
      "body": "Better advice might be: find a way to move your body in a way that feels right to you, as regularly as you can. :)",
      "created_utc": 1741826343.0,
      "score": 1
    },
    {
      "id": "mhng29w",
      "body": "A living nightmare for me. I am so depressed and sad. Watching someone you love die slowly. is killing me.\n\nI see no hope, see no change.",
      "created_utc": 1741905926.0,
      "score": 1
    },
    {
      "id": "mhd80sr",
      "body": "In short: \n\n1. my past served me an example of what i can reach to. And the fact that i realized that my way of learning is hands-on experience. No point in theorizing\n\n2. i realized life isn't about me\n\n3. i realized nobody knows nothing and i'm on my own (but i wish i had some kind of mentor when i was in my 20s). Now i see that many troubling thoughts were from the fact i didn't know how to treat things, how should i feel about them\n\n4. my also depressed buddy who was my body double\n\n5. i understood that i need to move from overthinking to actually getting things done somehow to get balanced life",
      "created_utc": 1741778597.0,
      "score": 1
    },
    {
      "id": "mhd82ak",
      "body": "Main theme of my anxiety and depression was that people around me were pretty much ignorant (probably, this is the way, actually. I knew almost exactly why i was depressed. It gave me really deep feel of loneliness) and, as i thought, wasted time:\n\n\\- my best friend turned out to be too into politics and too patriotic with \"look how crap other countries are\" while i was in relocation. And overall disappointment in people played the role\n\n\\- my coworkers (i work as software QA) were not open minded and curious, sometimes it was literally sabotaging my job because when i asked them questions they asked in response \"why do you need to know that?\" (to do my job, duh). Really discouraging. If not coworkers, then management didn't have any strategy, so i tried my best to be on my own. In the end i switched 6 companies since 2017. Current, 7th, is small, it's tough because i need to wear many hats. But, at least, i understand what i need to do, so i'll manage.\n\n\\- getting laid off unlocked new fear that i'll never have secure job (which is, actually, true)\n\n\\- still can't afford own apartment and renting because prices and mortgage % went up\n\n\\- low self-esteem\n\n\\- i used to make music and had other hobbies but had to put them off because of job. Actually i've been good at my hobbies and could make a decent living out of them and i've been grieving over it a lot\n\nIt doesn't look that bad, but i've constantly been stumbling upon these. I knew that i've had better life 5 years ago than now. While depressed i mostly been sleeping and went out of my apartment once in 3 weeks to take out trash and do groceries.\n\nI could say that i wasted last 5 years on dealing with people nonsense, but on the other hand i learned many \"do's\" and \"don't's\". Also anxiety motivated me to dig into all that brain stuff to understand what might go on with me. I tried vitamins, exercising, cutting off coffee, journaling to slow down thoughts. My depressed buddy was on the same page with me trying to figure things out. We constantly were discussing random topics: from what currently makes us depressed and what we can do about it to random topics about music or movies that were our fond and sweet memories. This is what made us moving. This guy's story is something else and is really wild (long story short, he disappeared last summer and i don't know what really happened. But he got better, too)\n\nAt some point i couldn't stand my team from previous job and resigned without having any offers. Got tired of getting anxious every time i clock in. It took me 2 months to get new job. This time i knew that i'm on my own and did my best to onboard and be useful. It's small company and i did work in such once, so i know how it's done. And it worked. I feel content now because when i got freedom on how to do my job and really nailed it. Nobody was micromanaging me and gaslighting with \"you're QA you only need to do X Y and Z\". It was hard, actually, but i focused on making impact every day instead of focusing on what i didn't do. Even small impact counted. It brought back my self esteem.\n\nThen i simply cut off all news, politics, social media to reduce the noise. Everybody wants to waste your time. And i cut off all people in real life who were draining my energy. I've been working on my empathy to care better about my wife. In other words i made myself my best friend as intended by nature, since i'm introverted and really autonomous person. Making music gave me valuable lesson: to create is harder than to take. But it makes others move. So i decided to go this way: upskill, learn, help people when needed.\n\nAlso understanding yourself better helps too, so you can dig into MBTI types and cognitive functions (in the end it doesn't matter but you get base to work on). And learn cognitive biases.",
      "created_utc": 1741778617.0,
      "score": 1
    },
    {
      "id": "mh9bznb",
      "body": "I learned to live with it. The problem is that if I can continue , it's hard",
      "created_utc": 1741722142.0,
      "score": 2
    },
    {
      "id": "mhfy7x7",
      "body": "Why would I ever want to live with depression. Why would anyone",
      "created_utc": 1741809602.0,
      "score": 1
    },
    {
      "id": "mhfpk18",
      "body": "If this resonates with you, perhaps you even love\nYourself more than you realize",
      "created_utc": 1741807139.0,
      "score": 1
    },
    {
      "id": "mhiriqb",
      "body": "One of our professors warned us not to tell any patient \"it will get better\". Patients are tired of hearing it from everyone. But from the limited understanding of the disease you will require telling them to socialize, ask for help, get up and exercise, fix your diet etc. \n\n\nI know nobody having depression has the strength to do all this but there has to be all of this lifestyle modification along with addressing the root cause of the disease and sometimes medications. There's no medication that will make you less depressed until you yourself make the effort to go ahead and\n \n1. Start answering questions your mind is asking you about whatever past experiences or personality issues are causing depression (therapy/giving yourself time etc)\n2. Fix your diet and lifestyle \n\n\nIts still very complicated. Everybody knows this. They can't do this because they don't have the energy & I don't blame them. ",
      "created_utc": 1741844481.0,
      "score": 1
    },
    {
      "id": "mh76fp1",
      "body": "I’ll bring the Texas French toast",
      "created_utc": 1741699587.0,
      "score": 15
    },
    {
      "id": "mh7uq35",
      "body": "Machiarto (how do you spell it?) for me please ^_^",
      "created_utc": 1741707100.0,
      "score": 5
    },
    {
      "id": "mhbsc40",
      "body": "Depressed people can't drink coffee , It makes them more anxious",
      "created_utc": 1741749699.0,
      "score": 4
    },
    {
      "id": "mhtv43h",
      "body": "Let's do it! Chicago suburbs anyone?",
      "created_utc": 1741992022.0,
      "score": 2
    },
    {
      "id": "mjew9nx",
      "body": "Tell me about it. It’s become my least favorite question. \n\nWhy did I have to be fucking born?! 😭",
      "created_utc": 1742781704.0,
      "score": 2
    },
    {
      "id": "mh78yka",
      "body": "Don’t forget the bean bags",
      "created_utc": 1741700438.0,
      "score": 6
    },
    {
      "id": "mh78h3m",
      "body": "I'm located in Missouri.  I'll supply the bacon and eggs farm fresh.",
      "created_utc": 1741700276.0,
      "score": 10
    },
    {
      "id": "mh78jbd",
      "body": "I'm now in your kitchen's cabinet 👀 *peeks*",
      "created_utc": 1741700297.0,
      "score": 5
    },
    {
      "id": "mh747li",
      "body": "Syrup, strawberries, and whipped cream 🥰 absolutely to die for",
      "created_utc": 1741698808.0,
      "score": 6
    },
    {
      "id": "mh96qf6",
      "body": "Baking powder and eggs?",
      "created_utc": 1741720658.0,
      "score": 2
    },
    {
      "id": "mh74f6c",
      "body": "just plain ol maple syrup is beautiful. thank you",
      "created_utc": 1741698884.0,
      "score": 7
    },
    {
      "id": "mhalguo",
      "body": "ah now i really want pancakes. dont have the energy to make em and buy ingredients though",
      "created_utc": 1741735212.0,
      "score": 5
    },
    {
      "id": "mhanhwa",
      "body": "i think i want pancakes tomorrow",
      "created_utc": 1741735840.0,
      "score": 3
    },
    {
      "id": "mhc5mgz",
      "body": "It really does suck, you deserve a hug. Never forget how beautiful you are.",
      "created_utc": 1741755679.0,
      "score": 3
    },
    {
      "id": "miexzws",
      "body": "and it's extremely obvious when you meet some new doctor or something and theyre just going through the motion questionnaire they ask every patient to prescribe meds- and dont actually give a damn",
      "created_utc": 1742294459.0,
      "score": 2
    },
    {
      "id": "mhgv8et",
      "body": "YES!!",
      "created_utc": 1741819402.0,
      "score": 5
    },
    {
      "id": "mhoqm4f",
      "body": "Yeah we're all optimistic here",
      "created_utc": 1741921455.0,
      "score": 4
    },
    {
      "id": "mhgw2bu",
      "body": "It’s a lot of fun:) I have a couple of song covers  published by a band, too! So it’s on Spotify and other platforms. \n\nBut also I got into that around when I was diagnosed with depression, so it was kind of a hobby already. Can confirm it can be difficult to pick up new hobbies when depressed, haha",
      "created_utc": 1741819642.0,
      "score": 2
    },
    {
      "id": "mh93iql",
      "body": "Im sorry you went through that and thank you for sharing. I honestly wouldn’t have been able to deal with what you went through. Having kids still isnt easy without depression and will most likely be 100x harder WITH depression. And Im pretty sure the only reason why I got the “have kids” advice is because I’m a woman and I guess thats our “sole purpose”🫤",
      "created_utc": 1741719743.0,
      "score": 3
    },
    {
      "id": "mhheb7g",
      "body": "Hey there. I won't pretend to know what you're going through in life but I saw you mentioned insomnia. I know that when I was going through a pretty rough time, I wasn't sleeping and honestly, it was an ongoing nightmare. My appetite was out of whack too. I went to see a counsellor and his advice was to address the physiological symptoms first and foremost. \n\nI did yoga and breathing exercises and physical exercise whenever I could push myself, even if that meant running in place or walking around my apartment. Gradually my appetite returned and my sleeping improved. My depression didn't disappear but I've felt significantly better ever since. Looking back, I really believe that the lack of sleep was the worst component. \n\nAnyway, I hope you are able to find a way to address your insomnia and hopefully that helps alleviate some of the other strains you're experiencing. Take care.",
      "created_utc": 1741825402.0,
      "score": 3
    },
    {
      "id": "mhhjtal",
      "body": "Soon enough \n\nAs a side note, winter biking can be a lot of fun too, if you can manage. ✌️",
      "created_utc": 1741827191.0,
      "score": 1
    },
    {
      "id": "mhhexx6",
      "body": "I think it might be because as humans, we're hardwired to help each other and for connection.",
      "created_utc": 1741825608.0,
      "score": 1
    },
    {
      "id": "mhs6dxw",
      "body": "I applaud your success, but you make it sound like you did this all on your own, yet you mentioned that you have a wife. You can confide in each other, do things together, support and encourage each other. That’s an amazing privilege that many of us don’t enjoy. Being lonely makes all of this so much harder.",
      "created_utc": 1741973553.0,
      "score": 2
    },
    {
      "id": "mh9ec91",
      "body": "I know it is hard, some days will be more difficult than others. I sincerely hope you can. I know it’s corny to say the world is a better place with you in it but it very well could be. \n\nBe well.",
      "created_utc": 1741722799.0,
      "score": 2
    },
    {
      "id": "mhg8djq",
      "body": "You can live trying to ‘cure’ it, whatever that may be. You can learn to live with depression so it doesn’t control you completely. Or you can let it go unchecked and uncontrolled which usually causes a lot of spiraling with poor mental and physical health. Like I don’t want to be sick but if I am, I’m going to not let it control me and consume me to the best of my ability. I can pretend it doesn’t exist, try to stuff it in a box and compartmentalize but I’m still living with it if that makes sense. \n\nBe well.",
      "created_utc": 1741812449.0,
      "score": 1
    },
    {
      "id": "mh76nq9",
      "body": "I looooove French toast!!",
      "created_utc": 1741699664.0,
      "score": 8
    },
    {
      "id": "mhbw2sj",
      "body": "Macchiato? The espresso with a dollop of cream?",
      "created_utc": 1741751241.0,
      "score": 4
    },
    {
      "id": "mhbvwsv",
      "body": "I live on the edge, constantly switching between depression and anxiety. It’s better than all of one",
      "created_utc": 1741751171.0,
      "score": 11
    },
    {
      "id": "mhcbdt6",
      "body": "I love my customized Carmel Macchiato ☕️ 💖\n\nIt is one of my only joys in life, the other is my cat & Coca-Cola",
      "created_utc": 1741758792.0,
      "score": 5
    },
    {
      "id": "mhd2k04",
      "body": "Low energy is one of the many signs of depression but although they do usually come together, depression and anxiety are two different things.",
      "created_utc": 1741775772.0,
      "score": 3
    },
    {
      "id": "mhud2z7",
      "body": "Wish I was... nope I am in California",
      "created_utc": 1741998054.0,
      "score": 1
    },
    {
      "id": "mha3gah",
      "body": "I just love this idea hahaha so fun!!",
      "created_utc": 1741729829.0,
      "score": 3
    },
    {
      "id": "mh9w2hg",
      "body": "That is a long way from NC. My step son and his wife live there somewhere. Poplar Bluff.",
      "created_utc": 1741727719.0,
      "score": 3
    },
    {
      "id": "mh79bbc",
      "body": "You're going to find a lot of home made sauces the roommates have made over time.",
      "created_utc": 1741700555.0,
      "score": 6
    },
    {
      "id": "mh74crl",
      "body": "Yes *scribbles scribbles* I marked that down on my little notebook",
      "created_utc": 1741698859.0,
      "score": 5
    },
    {
      "id": "mh74jg1",
      "body": "Good *scribbles on my little notebook* I'll remember that",
      "created_utc": 1741698926.0,
      "score": 5
    },
    {
      "id": "mh9jgkn",
      "body": "My best friend is my age and her and her husband made the decision to not have kids. She has her days but she really is so happy. I envy their lives some times lol \nI’m sending you love, I hope things ease up some for you (and thanks for the kind words) 🫶",
      "created_utc": 1741724220.0,
      "score": 3
    },
    {
      "id": "mhccnmr",
      "body": "I cannot imagine having this depression with children. I usually try and hide my depression, I don't want my loved ones to know I feel this way. But thankfully my children are grown and out of college now. Now I am hating my life and this depression is driving me crazy.",
      "created_utc": 1741759539.0,
      "score": 1
    },
    {
      "id": "mhj5a15",
      "body": "Thank you for the reply. The insomnia has been ever since I caught covid in 2021. I used to sleep like a log. Anywhere anytime by any means. Then I recovered from Covid. I had it really badly and can’t get more than 4hrs sleep. I am stingy on when I take medication to help me sleep cos it doesn’t actually help so I think well if I keep taking it more and more then I am going to get a higher tolerance so 1/2 nights a week is all. When I was in hospital my psychiatrist said what he is giving me shouldn’t knock out a rhino it should knock out the whole zoo. So I just keep going with it. I’ve tried it all. Sleepio app. Sleep restriction. Wind down at night. Wake up same time each morning. Etc etc. I just hope one day something works and I sleep and get rested. I 100% agree that I think if I cracked the sleeping to feel recharged I’d be able to address the other things. Until then I shall carry on how I am and hope something changes one day :)",
      "created_utc": 1741852940.0,
      "score": 1
    },
    {
      "id": "mhjmthg",
      "body": "I used to go out if the temperature was around 40°. I can’t find the will to get out",
      "created_utc": 1741863522.0,
      "score": 1
    },
    {
      "id": "mhhm3rh",
      "body": "yeah rn my goal is kinda weird but its to go around and try to help as many people in this sub as possible. i got a good support system so i really just wanna make other people feel better",
      "created_utc": 1741827956.0,
      "score": 2
    },
    {
      "id": "mh9ey41",
      "body": "Thank you",
      "created_utc": 1741722968.0,
      "score": 2
    },
    {
      "id": "mhchle3",
      "body": "Perfect opportunity for a depresso espresso joke",
      "created_utc": 1741762546.0,
      "score": 6
    },
    {
      "id": "mhbzids",
      "body": "Yeah, but milk foam rather than cream",
      "created_utc": 1741752730.0,
      "score": 5
    },
    {
      "id": "mheare9",
      "body": "Amen to that. lol gotta keep em thinking.",
      "created_utc": 1741792546.0,
      "score": 1
    },
    {
      "id": "mh9walw",
      "body": "About an hour ish from where I live.",
      "created_utc": 1741727783.0,
      "score": 6
    },
    {
      "id": "mhana9t",
      "body": "those places are VERY far from oklahoma but i believe we can find a middle ground somewhere",
      "created_utc": 1741735774.0,
      "score": 3
    },
    {
      "id": "mhgun61",
      "body": "I’m in NC near Raleigh!",
      "created_utc": 1741819218.0,
      "score": 3
    },
    {
      "id": "mhanf0y",
      "body": "and fried rice concoctions",
      "created_utc": 1741735815.0,
      "score": 3
    },
    {
      "id": "mh76evl",
      "body": "Can I get in on the pancakes? Maple syrup for me please and vanilla ice cream if we are being decadent! 😋",
      "created_utc": 1741699580.0,
      "score": 3
    },
    {
      "id": "mhhmzhe",
      "body": "Not weird at all. Good on you. :)",
      "created_utc": 1741828252.0,
      "score": 1
    },
    {
      "id": "mhc4gys",
      "body": "I’ll make the affogatos!",
      "created_utc": 1741755098.0,
      "score": 4
    },
    {
      "id": "mh9wvei",
      "body": "Never been there but before my spouse got sick he would visit. We had pets so I stayed here to care for. them.",
      "created_utc": 1741727948.0,
      "score": 4
    },
    {
      "id": "mhcbka2",
      "body": "I am just about as far away as I could be... I am in California 😭😭😭😭",
      "created_utc": 1741758897.0,
      "score": 3
    },
    {
      "id": "mhngew3",
      "body": "Charlotte area. Not Charlotte, though.",
      "created_utc": 1741906036.0,
      "score": 2
    },
    {
      "id": "mh76pli",
      "body": "Yes... Yours will be served with vanilla ice cream 🍦",
      "created_utc": 1741699681.0,
      "score": 3
    },
    {
      "id": "mhhn8cw",
      "body": "thanks man<3. not a lot of people reply tho.",
      "created_utc": 1741828335.0,
      "score": 1
    },
    {
      "id": "mhd36gj",
      "body": "Opposite coast; I'm in Maryland but my son is in San Diego somewhere but wants nothing to do with me because I'm too far beneath him. needless to say, one of the sources of my depression",
      "created_utc": 1741776110.0,
      "score": 2
    },
    {
      "id": "mh771hv",
      "body": "Thank you! How do you like your pancakes?",
      "created_utc": 1741699794.0,
      "score": 3
    },
    {
      "id": "mhhnjcy",
      "body": "Don't take it personal. It's hard to really now what other people are going through.  \\* know",
      "created_utc": 1741828438.0,
      "score": 1
    },
    {
      "id": "mhg2js1",
      "body": "Well I see what you mean....",
      "created_utc": 1741810820.0,
      "score": 3
    },
    {
      "id": "mh77mmh",
      "body": "With butter and syrup 😋",
      "created_utc": 1741699993.0,
      "score": 2
    },
    {
      "id": "mhhntx6",
      "body": "yeah man i just wanna help, it kinda nags at me that i'm getting help and others aren't. I just say if they need someone to talk to or vent to i'll be there to read and not judge. i hope more people can reply",
      "created_utc": 1741828535.0,
      "score": 3
    }
  ]
}