{
  "id": "1iczjbu",
  "title": "Every time I socialize I'm reminded of the gap between me and normal people",
  "selftext": "I hardly ever socialize, but when I do (mostly colleagues at or outside of work) I realize how wide the gap is between me and them. \n\nThey all have lives, they do things, go places, have experiences to share and talk about. I find myself having nothing to say, I feel so boring and weird, like I don't belong. \n\nThis gap keeps getting wider as the years go by...",
  "created_utc": 1738172339.0,
  "score": 1887,
  "num_comments": 92,
  "url": "https://www.reddit.com/r/depression/comments/1iczjbu/every_time_i_socialize_im_reminded_of_the_gap/",
  "comments": [
    {
      "id": "m9v224e",
      "body": "Yeah i am with you on this one,  i had one person asking me what i do when i sit in restaurants,  i was like “i haven’t sat inside a restaurant in years” and they were confused\n\nI’m sorry this is happening to you by the way, the gap is terrible and isolating",
      "created_utc": 1738174254.0,
      "score": 408
    },
    {
      "id": "m9v5juy",
      "body": "I feel the same way. I don't have anyone to do things with (and I'm too depressed to even want to do anything anyway). Fell like others are living a life they enjoy. I'm simply existing.",
      "created_utc": 1738175200.0,
      "score": 187
    },
    {
      "id": "m9v86rz",
      "body": "You describe my exact experience. I'm so shut down, that the simplest conversations can go south really quickly. It feels as if I am watching the world around me through a closed window. It's a painful experience. I understand your pain",
      "created_utc": 1738175910.0,
      "score": 168
    },
    {
      "id": "m9vil5v",
      "body": "Just came back from a shitty gathering, and was thinking the absolute same",
      "created_utc": 1738178750.0,
      "score": 83
    },
    {
      "id": "m9ws7ff",
      "body": "When it comes to being social, it always just feels like an exercise in \"How good can I fake it this time\".",
      "created_utc": 1738191228.0,
      "score": 73
    },
    {
      "id": "m9w27zw",
      "body": "This is me 100%. I never feel like a normal person and it makes my life so much worse.",
      "created_utc": 1738184085.0,
      "score": 61
    },
    {
      "id": "m9v95ss",
      "body": "Yeah how can they afford it all? I’ve always been poor in my adult life, and I don’t know how to get out of it. I’ll never have an my own vacation never have my own home. Never never never everything.",
      "created_utc": 1738176174.0,
      "score": 83
    },
    {
      "id": "m9x0xzh",
      "body": "People irritate me easily. I'm good at pretending I'm interested when people go on endlessly about themselves and their lives, but inside I'm screaming at them to stop. I would much rather sit down and have an interesting discussion about a shared interest than talk about myself. There are lots of people like us, but it's so hard finding each other when the loud social set dominate the social experience and conversations generally.",
      "created_utc": 1738193891.0,
      "score": 70
    },
    {
      "id": "m9x5smh",
      "body": "You just described my situation, even when I somehow feel better, that gap is always there between me and everyone, I would say the world but I hope if I manage to move to a different city, different community, things will be easier, I socialize fine but I hate when they ask me *where have you been?.* *are you alive?* that happen like all the time, I live in a small town, everybody knows everybody, everybody knows I'm the lifeless one.",
      "created_utc": 1738195412.0,
      "score": 20
    },
    {
      "id": "m9v7u2a",
      "body": "Yep... This about sums it up.",
      "created_utc": 1738175815.0,
      "score": 17
    },
    {
      "id": "m9xoeas",
      "body": "Ikr? People are excited about shit. I am excited about nothing. What did I do on the weekend? Nothing.",
      "created_utc": 1738201342.0,
      "score": 16
    },
    {
      "id": "m9wsi49",
      "body": "Being severely depressed myself, i too worry that my depression seems to be the ONLY HIGHLIGHT of my life. To some degree, i do get some deep conversations with ppl who are generally curious what a depressive-bipolar high functioning brain feels like, but that doesnt always happen. \n\nBeing depressed doesnt mean u dont have a life outside of the disease. I work. I have art. I read. I workout. You will be surprised that there are some normal ppl out there who have LESS things to talk about. \n\nIf you feel you are being “left out”, maybe pursue those things u wished u had something to talk about. We often get stuck in a rut because the disease pretty much weighs us down, but the weight is not real. You can travel. You can have rich live experiences. You be a lot of other things even with depression. :)",
      "created_utc": 1738191315.0,
      "score": 13
    },
    {
      "id": "m9xlmg5",
      "body": "I think about this quite often.\n\nI have friends. But when I'm around any of them, I never really talk about myself. I like when others talk because I don't have anything interesting to bring to the table like they do. They'll go on dates and trips and work jobs that pay more than I'm making and I'm best at listening.\n\nI have no love life so I can't talk about or relate to them about that.\n\nI write as a hobby but I haven't written or finished anything in months. So, there's nothing to look forward to there.\n\nI can talk about games, though, because I don't do much of anything else but be overworked at my job.\n\nSo, yeah...",
      "created_utc": 1738200442.0,
      "score": 11
    },
    {
      "id": "ma033e1",
      "body": "Me.\nI lost some long time friendships because they started doing things, meeting a lot of new people, went to different countries, did lots of different sports, had multiple relationships, jobs, lived their life to the fullest and I always felt like I am inferior to them and I have nothing to share. \nAnd they think I don’t share because I am secretive or introverted or something, but honestly I have NOTHING to share except my failuresc, but who wants to hear about my failures?\nSometimes I wish I met a person with as many failures in life as me and we would make tea and popcorn and laugh about how shitty life is.",
      "created_utc": 1738241788.0,
      "score": 8
    },
    {
      "id": "m9w4rlb",
      "body": "Find your crowd, i believe social distancing it's nothing more than not feeling confortable around a situation, i've felt that around people i dislike or don't get a good vibe from... my tip is: Don't try to fit in, just find your crowd.",
      "created_utc": 1738184769.0,
      "score": 15
    },
    {
      "id": "m9yf5hj",
      "body": "Yeah, I can relate to this too. IRL or online, I just feel like I'm too different to other people but not in a good way. I feel I don't have the qualities or experience that other people are interested in or fond of, even if I truly want and try to fit in with them in the way I genuinely can and am capable of... it's just not enough 😞",
      "created_utc": 1738210475.0,
      "score": 7
    },
    {
      "id": "m9z8oob",
      "body": "[deleted]",
      "created_utc": 1738224962.0,
      "score": 6
    },
    {
      "id": "m9v19is",
      "body": "Maybe the you don’t belong… but that don’t mean u don’t matter. Be in your own space where you can be yourself.",
      "created_utc": 1738174037.0,
      "score": 14
    },
    {
      "id": "m9xeja9",
      "body": "I find the one thing that helps the most is finding even just one person who almost understands you.",
      "created_utc": 1738198175.0,
      "score": 6
    },
    {
      "id": "m9x3mol",
      "body": "I was telling my husband about this exact feeling today. \n\nI walk in, no one makes eye contact with me or acknowledges me. I try to say hi to someone and I'm given the cold shoulder. \n\nPeople can't even say my name right and I've been there for over a year. \n\nI wish I could get past it and make a friend but I've been like this my whole life.",
      "created_utc": 1738194729.0,
      "score": 9
    },
    {
      "id": "m9vb2kj",
      "body": "I'd start with people who is in the same position as you, we sometimes can't not compare ourselves to others and just be ourselves. This hurts me a lot too, but you gonna go through this to be a better person",
      "created_utc": 1738176695.0,
      "score": 4
    },
    {
      "id": "m9xirck",
      "body": "exactly how i've been feeling the last 2 years or something. i crave getting experience but i find myself struggling to figure out how. would love to do it with others but you can't just create a special friend group to do that stuff. ah",
      "created_utc": 1738199523.0,
      "score": 5
    },
    {
      "id": "m9ya84p",
      "body": "I'm in that boat too.  I have a few social gatherings that aren't work throughout the week and each time I just feel so.... behind, almost infantilized weirdly enough.  Many my age are either married with children, dating happily, or doing really well in a career field.  I'm doing well in my career too, but because I lack a committed relationship and what I could only describe as \"Fuck it money\" I feel so weirdly empty all the time.  Every time I have a night at home alone I dread it so much, but socializing with people just grows the dread inside of me too.",
      "created_utc": 1738208638.0,
      "score": 6
    },
    {
      "id": "m9zlfk6",
      "body": "I feel the same. Barely have the motivation to socialize ever.\n\nWhen I hear people talking about their interests, their activities, them laughing together about something ect. I just feel like a robot observing them.   \n  \nI've been trying to be like them, but I can only be emotionally disengaged or play pretend.",
      "created_utc": 1738232936.0,
      "score": 5
    },
    {
      "id": "m9vb71e",
      "body": "I'm exactly the same",
      "created_utc": 1738176728.0,
      "score": 4
    },
    {
      "id": "m9w9a1b",
      "body": "I relate with this so much",
      "created_utc": 1738185973.0,
      "score": 3
    },
    {
      "id": "m9waqmn",
      "body": "Just met a colleague who is like in his late 40s and doing so much. I felt so incompetent. Once again grieveing the life I could have had if I didn’t suffer from debilitating bipolar depressive episodes.\nLogically I know I should not compare but it just hits you out of nowhere sometimes.",
      "created_utc": 1738186359.0,
      "score": 4
    },
    {
      "id": "m9yg93v",
      "body": "Yeah I deal with this too. But for whatever reason I find their interests genuinely boring. I’ve tried what they’re all into and at the end of the day I like doing my own thing with my own hobbies. If that means I don’t have a story about some stupid fucking beach resort and a shitty rented jeep that I overpaid for then I’m okay.",
      "created_utc": 1738210904.0,
      "score": 4
    },
    {
      "id": "m9z4ihs",
      "body": "As someone who often gets the \"I had no idea!\" response when I disclose that I've been dealing with depression most of my life... I guess you could say I'm \"high-functioning.\" I can socialize like I live a great life, but it's mostly because I'm desperately trying to hide how I'm always falling apart.\n\n\nI'm not trying to invalidate your feelings or the gap you're experiencing. I just wanted to add that people are not always what they seem and pretending to live a good life is one of the easiest ways to keep people out of your business.\n\n\nEver since I was a teen, I was that person who would quietly bawl my eyes out in a bathroom stall, splash water on my face, and walk out with a smile.",
      "created_utc": 1738222470.0,
      "score": 4
    },
    {
      "id": "ma17kup",
      "body": "After dealing with depression for over 30 years I'm real good at faking it, but I feel a big gap as well.",
      "created_utc": 1738254751.0,
      "score": 4
    },
    {
      "id": "ma5jd8x",
      "body": "and that's why I avoid going out with people, they have so much to talk about their lives and I just... stand there, with nothing.",
      "created_utc": 1738303792.0,
      "score": 4
    },
    {
      "id": "m9x4ku5",
      "body": "Same. \n\nAlthough I find myself often approached at the store or when I'm out. It's usually like dudes who want to know where I got my tattoos done at or old people who have this weird mental \"I bet the goth knows.\" \n\nThose conversations are nice tbh. Like yeah idk the difference between condensed and evaporated milk, let's figure this out.",
      "created_utc": 1738195026.0,
      "score": 3
    },
    {
      "id": "m9ys2jv",
      "body": "it's the exact same here as well",
      "created_utc": 1738215934.0,
      "score": 3
    },
    {
      "id": "m9xi603",
      "body": "feel the same",
      "created_utc": 1738199335.0,
      "score": 2
    },
    {
      "id": "m9xvfi0",
      "body": "I understand what you're going through, I mostly sit by myself in bars on my phone but if I'm away from home I feel I can be more myself if that makes sense",
      "created_utc": 1738203626.0,
      "score": 2
    },
    {
      "id": "ma0eqiu",
      "body": "I have a lot of trouble with this as well. One thing that sometimes helps for me is just talking about something I read or doing that I find interesting. It can be meaningless the point is that you tell a small story in a way that engages people.\n\nOther times my mind just goes blank and I can’t think of anything at all",
      "created_utc": 1738246059.0,
      "score": 2
    },
    {
      "id": "ma2vrnd",
      "body": "Seems like a lot of us relate to each other on this, and many other things mentioned in the comments.",
      "created_utc": 1738271333.0,
      "score": 2
    },
    {
      "id": "ma3il0q",
      "body": "Yeah, I feel like I have a script of conversation I follow, or I just copy what others have said to me, especially with small talk, like a video game NPC",
      "created_utc": 1738277809.0,
      "score": 2
    },
    {
      "id": "ma3p7np",
      "body": "I feel the exact same way. It just sucks.",
      "created_utc": 1738279836.0,
      "score": 2
    },
    {
      "id": "ma400k5",
      "body": "Absolutelly same. My life has been nothing. Just nothing. Alone in my room.",
      "created_utc": 1738283280.0,
      "score": 2
    },
    {
      "id": "ma5q64w",
      "body": "I feel the same most of the time but I realized that it's because they're not depressed for years like me. Imagine constantly mourning someone (just an example) and everbody around you laughing, being cheerful and constantly talking. You can't do the things they do because you have some issues to be fixed. \n\nFor a while I thought I'm a boring person, like I have no identity but now I understand why. You have to fix your issue so that you can become happy like them, for yourself of course",
      "created_utc": 1738307423.0,
      "score": 2
    },
    {
      "id": "maouvhm",
      "body": "Sounds like more like every time you socialize, you remind yourself of the gap as a way to punish yourself for who you are. The problems you have in your life aren’t because you are somehow inherently different than ‘normal’ people. Your life isn’t because you are any different than anyone else, it’s that you censor who you are, assume that who you are isn’t worth anything, and therefore don’t allow yourself to build yourself a life based on who you actually are. You know the difference between you and normal people? Literally nothing. Normal people just let themselves be who they are, knowing there is no alternative - you are who you are so you might as well be it. Depressed people try to convince themselves they could or should be someone other than who they are by constantly comparing themselves unfavorably to other people as a way of trying to convince themselves that who they are is insufficient, when in reality it’s all the time spent comparing rather than just being that is sapping them of the abiiity and opportunity to invest In who they actually are and experience living.",
      "created_utc": 1738559845.0,
      "score": 2
    },
    {
      "id": "mb2jrog",
      "body": "Yeah , i get it . Most of the times i keep zoning out because i feel i don’t relate to any of the things they are saying and i also feel a lit bit of jealousy as to how nice it might be to be normal and live day to day life without being depressed.",
      "created_utc": 1738740200.0,
      "score": 2
    },
    {
      "id": "m9varj5",
      "body": "I don’t care about this anymore",
      "created_utc": 1738176611.0,
      "score": 2
    },
    {
      "id": "m9w6pfc",
      "body": "College in a nutshell",
      "created_utc": 1738185287.0,
      "score": 1
    },
    {
      "id": "m9zeh0v",
      "body": "[deleted]",
      "created_utc": 1738228626.0,
      "score": 1
    },
    {
      "id": "ma1ekvh",
      "body": "Out of curiosity, what kind of stuff do you prefer to talk about?",
      "created_utc": 1738256692.0,
      "score": 1
    },
    {
      "id": "ma28h62",
      "body": "What do we do about it though",
      "created_utc": 1738264899.0,
      "score": 1
    },
    {
      "id": "ma5tuzu",
      "body": "Yeah 😮‍💨. It helps to make friends with other mentally ill people. There are support groups on the NAMI & SAMHSA websites.",
      "created_utc": 1738309569.0,
      "score": 1
    },
    {
      "id": "madvbjl",
      "body": "i feel the same way, but you aren’t psychic and don’t know what’s going on with people. if depression were so strange, suicide wouldn’t be a growing cause of death. ",
      "created_utc": 1738422477.0,
      "score": 1
    },
    {
      "id": "m9x27fx",
      "body": "Yeah happening to me too. But keep socializing. Otherwise it will go worse.",
      "created_utc": 1738194283.0,
      "score": 1
    },
    {
      "id": "ma02inn",
      "body": "i know this alienating feeling, but there is no normal, you have to stop thinking that others are better than you or doing better than you, this comparative feeling isn't helpful at all.\n\n\ni know it sounds like self help bs and it's definitely not a miraculous cure of depression or any of life's problem so just take it as a reminder to think that despite struggling with depression, none of us are any worse or abnormal than other people who seem more confident and happy.\n\nit's just life is different for everyone:\n\n\"The people who look the most beautiful are the same as us. The only difference is they’re telling themselves they look good, and they’re letting themselves shine through. The people who say the most profound, intelligent, or witty things are the same as us. They’re letting go, being who they are. The people who appear the most confident and relaxed are no different from us. They’ve pushed themselves through fearful situations and told themselves they could make it. The people who are successful are the same as us. They’ve gone ahead and developed their gifts and talents and have set goals for themselves. We’re even the same as our heroes, our idols. We’re all working with approximately the same material—humanity. It’s how we feel about ourselves that makes the difference. It’s what we tell ourselves that matters.\"\n.",
      "created_utc": 1738241555.0,
      "score": 1
    },
    {
      "id": "ma1d9xx",
      "body": "[deleted]",
      "created_utc": 1738256331.0,
      "score": 1
    },
    {
      "id": "ma0dbaz",
      "body": "comparing yourself to the other people is the fastest way to depression",
      "created_utc": 1738245563.0,
      "score": 0
    },
    {
      "id": "ma0h9ex",
      "body": "Maybe they're not your kinda people😏  There's nothing wrong with not going to a restaurant or something. Go out with 1 or 2 closest friends of yours. Or probably go solo for an outing once in a while and create your experience and stories 💫✌🏻",
      "created_utc": 1738246893.0,
      "score": 0
    },
    {
      "id": "m9x5we8",
      "body": "Don't expect anything and you wont be surprised/disappointed",
      "created_utc": 1738195444.0,
      "score": -2
    },
    {
      "id": "m9v1ft8",
      "body": "Only way to get better is through repetition and practice",
      "created_utc": 1738174085.0,
      "score": -9
    },
    {
      "id": "m9viuw6",
      "body": "I would actually eat that up and be very interested in that LOL. I envy the discipline of people who don’t go to restaurants often so we would deff have a lot to talk about there",
      "created_utc": 1738178824.0,
      "score": 71
    },
    {
      "id": "ma0hwxi",
      "body": "What does that even mean? I sit down and eat my food, what do they want you to say??",
      "created_utc": 1738247103.0,
      "score": 12
    },
    {
      "id": "m9wicmx",
      "body": "I know it’s not healthy, but when I hear people talking about their amazing vacations across the country or the globe I almost immediately shut down. I’m 25 and my family’s been poor my whole life down in FL and goddamnit I just want to experience snowfall at least once in my existence before I croak.",
      "created_utc": 1738188417.0,
      "score": 50
    },
    {
      "id": "m9veawt",
      "body": "This. I relate to you so fucking much. It's become so exhausting, worrying about everything. Why does it have to be so hard and difficult?? I don't know what to do anymore... 💔❤",
      "created_utc": 1738177572.0,
      "score": 26
    },
    {
      "id": "m9y4bzt",
      "body": "Omg sameee. The way it just makes you feel so trapped listening to people’s anecdotes endlessly. I rarely share things from my life myself because it just doesn’t make sense to me. A topic you can elaborate on, and discuss. What am I supposed to do with your random memory? I feel like I’m missing something but it really bothers me",
      "created_utc": 1738206571.0,
      "score": 24
    },
    {
      "id": "m9zm8on",
      "body": "This! \n\nI find mundane chatter boring and talking about life issues BORING. I want to dig in to some topics and controversy or just get lost in a great discussion.",
      "created_utc": 1738233425.0,
      "score": 7
    },
    {
      "id": "m9yoko7",
      "body": "I try to be entertaining when I’m with others but I’ve given up on having friends. Like, people who call you up and ask what you’re eating that day. Or the idiot 37 year old I inherited from my husband who didn’t know what the ACLU was. Or my friend with the addiction to whippets who can’t get to a concert on time. I give up.",
      "created_utc": 1738214347.0,
      "score": 3
    },
    {
      "id": "m9xix9l",
      "body": "exactly ._.",
      "created_utc": 1738199576.0,
      "score": 1
    },
    {
      "id": "m9z2hv3",
      "body": "Oh I dread the weekend questions so much",
      "created_utc": 1738221315.0,
      "score": 11
    },
    {
      "id": "ma2u3df",
      "body": "i resist the urge to just start lying. tell them i did this and that when i didn't do anything. cause it's pathetic having nothing to say all the time.",
      "created_utc": 1738270866.0,
      "score": 1
    },
    {
      "id": "mag13fy",
      "body": "Problem is some people have been trying to \"find their crowd\" their whole lives. And you meet people that make you hopeful that they're finally the right ones, only to have them inevitably leave you, prove they're not interested, or otherwise show you they aren't who you wished they were. ",
      "created_utc": 1738446145.0,
      "score": 6
    },
    {
      "id": "m9zbyt2",
      "body": "Wow I felt every word... This is exactly what I'm going through as well. I'm so anxious when conversations get a little personal because I have nothing going on in my life, I just rot in bed.",
      "created_utc": 1738227027.0,
      "score": 4
    },
    {
      "id": "ma05njg",
      "body": "Then I would never leave the house",
      "created_utc": 1738242797.0,
      "score": 6
    },
    {
      "id": "mag22im",
      "body": "I literally have no desire to socialize with 99% of people, and apparently I just scare off the 1% because I'm too clingy and desperate for their love. It's like being a total alien going to social functions and watching people effortlessly talk about their hobbies and lives and watch them actually appear to care.",
      "created_utc": 1738446447.0,
      "score": 4
    },
    {
      "id": "ma3j5qn",
      "body": "Yeah wasn't expecting this many people to relate",
      "created_utc": 1738277981.0,
      "score": 2
    },
    {
      "id": "mbq5u7e",
      "body": "Exactly, same. I get jealous of their normal lives, must be nice.",
      "created_utc": 1739049458.0,
      "score": 1
    },
    {
      "id": "ma1unlb",
      "body": "Good question lol\n\nI think it's because I have no one to do these things with and doing them alone sounds so depressing to me",
      "created_utc": 1738261111.0,
      "score": 5
    },
    {
      "id": "ma0gjpn",
      "body": "Already depressed so might as well lol",
      "created_utc": 1738246662.0,
      "score": 5
    },
    {
      "id": "m9x41gf",
      "body": "*sigh*\n\nDo you understand depression? We are already exhausted just by living.",
      "created_utc": 1738194859.0,
      "score": 3
    },
    {
      "id": "m9vkqh3",
      "body": "Can you afford to go to restaurants regularly? For me the cost is one reason because i couldn’t afford to go there often but also it’s less about discipline and more about my terrible social anxiety and insecurity of how i look and depression etc…",
      "created_utc": 1738179333.0,
      "score": 53
    },
    {
      "id": "ma0i8wf",
      "body": "She was basically trying to figure out if i go out and eat with other people, it was in that context",
      "created_utc": 1738247209.0,
      "score": 9
    },
    {
      "id": "m9z8keu",
      "body": "you can be happy that youd even wanna go on vacation and travel. i don't know any place id like to go to, my parents asked me many times if I wanna go travel with them but to me it just seems boring",
      "created_utc": 1738224889.0,
      "score": 0
    },
    {
      "id": "m9yj7pk",
      "body": "Fr. Agreed.",
      "created_utc": 1738212079.0,
      "score": 2
    },
    {
      "id": "maiwype",
      "body": "That’s me! I don’t know is it me or the others? Being alone with others around is painful.",
      "created_utc": 1738485466.0,
      "score": 2
    },
    {
      "id": "mags8x2",
      "body": "I get what you mean. Though, the 1% for me always turned out to be one of the 99% crowd. I often thought I found someone that I share a wavelength with, but I couldn't relate to them eventually. \n\nYes! And I completely understand the alien-like feeling. Pretty much like being a reptile, watching with empty eyes and wasting all energy to appear human. I just can't anymore.\n\nThat you have that 1% you're actually interested in sounds good though. Don't be too hard on yourself, maybe the previous ones just weren't compatible. Good companions are rare, I think. I guess not losing hope is the best we can do.",
      "created_utc": 1738454878.0,
      "score": 2
    },
    {
      "id": "m9xoubx",
      "body": "I've lived with it my whole life",
      "created_utc": 1738201485.0,
      "score": -2
    },
    {
      "id": "m9vnbkj",
      "body": "At this point I could slightly afford restaurants more than when I was younger (working and living at my parents, so saving money), but my addiction to eating out even surpasses my fear of looking odd in public to be honest, though I definitely do feel odd being there alone sometimes, but I still go anyway",
      "created_utc": 1738180036.0,
      "score": 28
    },
    {
      "id": "mb4ijhi",
      "body": "I felt that for a while and i believe that happens whenever we put too much expectations on the other part, like she's responsible for my happiness... I'm happy and she can make me more happy, not miserable... that way i learnt to say now and to filter how is worth to be by my side as well... that is the difference from solitary and solitude, enjoying being alone...",
      "created_utc": 1738771696.0,
      "score": 2
    }
  ]
}