{
  "id": "1kmlaev",
  "title": "My 17 year old son has falsely accused me, his mother, of sexual assault",
  "selftext": "I’m broken! I’m shocked. I don’t even know where to begin. \nMy son was struggling with his mental health and a very toxic relationship with a woman 4 years his senior. \nThey kept breaking up and getting back together. The last time they got back together he told me he wasn’t coming home anymore because he didn’t feel safe at home. I asked him to elaborate and he would not. I assumed this safety thing was a ploy to allow his girlfriend’s parents to let him stay with the them, with his girlfriend. I assumed they would break up again and he would be home soon.  2.5 weeks later I received a call from police and was called in for questioning. \nI was accused of sexual misconduct, sexual exploitation and sexual assault. No charges were laid, but the investigation continues. \nThere is no truth to any of this. \nI’m shattered. I feel like I’m grieving the loss of my son. I don’t know where to turn or what to do. \nMy emotions are all over the place, in one moment I am so angry and feel so betrayed, the next I am so sad for him and missing him. \nHas anyone else ever experienced this??\nI don’t know what to do or where to turn. \nTo say I’m depressed would be an understatement. I don’t want to go on living! ",
  "created_utc": 1747244133.0,
  "score": 928,
  "num_comments": 100,
  "url": "https://www.reddit.com/r/depression/comments/1kmlaev/my_17_year_old_son_has_falsely_accused_me_his/",
  "comments": [
    {
      "id": "msceqgo",
      "body": "sounds like a 21 year old woman is grooming your son and turning him against you so she can further isolate him. dont let her.",
      "created_utc": 1747258901.0,
      "score": 1274
    },
    {
      "id": "msbfy59",
      "body": "Please post to r/legaladvice they should be able to help you!",
      "created_utc": 1747248492.0,
      "score": 384
    },
    {
      "id": "msb9jkg",
      "body": "Contact a lawyer, and do not speak with your son. I know it's a horrible thing to say, but you can be on the hook for witness intimidation, strengthening this false accusation. The situation that you are in is terrible, but you need to protect yourself legally. Gather up any documentation regarding his mental health struggles, and look for character witnesses who will speak up for you.",
      "created_utc": 1747246632.0,
      "score": 491
    },
    {
      "id": "mscs3i4",
      "body": "What a horrifying situation to find yourself in. I am so sorry.",
      "created_utc": 1747263319.0,
      "score": 123
    },
    {
      "id": "msdlyj2",
      "body": "Let things cool down first. Dont contact your son and dont tell these things to anyone. Now you are fragile and maybe you can do a wrong step, so be careful. If he or his girl try talk to you, record or refuse. This is thé safest way for protect yourself legally. Other way is a gamble ans it could be dangerous due to be unpredictable, but you can go there and face the, this could let your soul be free but if something will go wrong you will be in troubles. 100% thé girl is manipulating him to isolate him. This happened to me when I was 23 with a, divorced and with son, 37yo woman, unfortunately when I came back after three years it was for my mother funeral.\nObviously you need a lawyer but I know you cant afford, maybe you can check other subs and ask for a free help by some angel lawyer. Dont beat her, dont scream, dont make shows. Delete all your porn if you have, research about adult contents and whatever could be used against you. I hope everything will be ok! If I can ask, where are you from ? Hugs from 🇮🇹",
      "created_utc": 1747273616.0,
      "score": 27
    },
    {
      "id": "msf070y",
      "body": "So he’s 17 dating a 21 year old? How old was he when they first got together?",
      "created_utc": 1747297950.0,
      "score": 22
    },
    {
      "id": "mscuskj",
      "body": "[removed]",
      "created_utc": 1747264231.0,
      "score": 40
    },
    {
      "id": "msdeqb6",
      "body": "Been there, could write a book about it. If you go far back enough in my history (pre-Covid), you’ll find my own story in regards to my daughter.",
      "created_utc": 1747271129.0,
      "score": 10
    },
    {
      "id": "msfh5s6",
      "body": "I’m not overly concerned about the legal side of things because I didn’t do it, I don’t think anything will come of it. More than anything I’m trying to figure out how to go on living with the pain of losing my son. Things will never be the same. I’m grieving in the worst way.",
      "created_utc": 1747307587.0,
      "score": 10
    },
    {
      "id": "msevdzk",
      "body": "Grieve him. He has made choices that cannot be taken back and you trying to help him or understand him will only end up biting you in the but. Cut contact. Cut ties. If he comes back to you in the future and you want to forgive him then that's on you, until then stay far far away.",
      "created_utc": 1747294888.0,
      "score": 10
    },
    {
      "id": "mschqod",
      "body": "I'm so sorry you're going through this. My Uncle went through something slightly similar when his 5 year old son told his teacher that his dad (my uncle) hit him. The teacher instead of talking to my uncle and his wife rang social services and my uncle was told he wasn't allowed to be left alone with his children and he was heartbroken. Thankfully after a few weeks things were cleared after so much hell. \n It's best to not contact your son at all and even though it'll hurt you'll have to leave him to deal with the consequences of his actions and separate yourself from him. Everything will die down after awhile but don't give in and always make sure someone else is around if you're near him so he can't add to the false accusations.",
      "created_utc": 1747259846.0,
      "score": 35
    },
    {
      "id": "mscuyh0",
      "body": "I am so sorry you are going through this",
      "created_utc": 1747264287.0,
      "score": 4
    },
    {
      "id": "msezwn3",
      "body": "This is an extremely difficult, scary situation to be in. Believe you me, I've been through it. The thing is, very few people will believe you unless they're familiar with your character. \n\nI was falsely accused of a crime many years ago. Prior to the charge, I didn't have any record (not even a speeding ticket). Once my case got into a judge's hand (not the magistrate), my bail was reduced by 92%. The evidence is so weak, I have no restrictions.\n\nHowever, these allegations caused me to lose my job, so-called friends, and a lot of money. The same individual made claims against other people and lies constantly. I understand sexual assault does happen, and I had to report someone myself who is serving a 21-year sentence (the evidence was overwhelming). However,  there are those who truly didn't do it. \n\nThey offered me a plea deal they thought was favorable, but I instantly turned it down. Shockingly, the case has been dragging out for 5-years, which should be illegal.\n\nI had a lot of support, and I do feel sorry for you; there's nothing worse than being innocent and accused of such an atrocious crime. There are people telling you to record communication, but that isn't a good idea. Don't talk to him. If you have to go in debt, do so to get an attorney. Prosecutors only care about winning, not the truth. \n\nThe jury expects to have a lot of evidence, but all he got on you is a story that probably makes no sense. If it's only testimony, he will have to go to trial to testify.\n\nUnfortunately, this is a tactic abusers and those who want control uses, but the truth always surfaces. Once that happens, they won't know what to do. Stay strong, and I am hoping for the best for you. Undoubtedly, the person has serious psychological issues as that's usually the case in false accusations.",
      "created_utc": 1747297761.0,
      "score": 6
    },
    {
      "id": "msfjcot",
      "body": "Not only is this grooming but if you’re in the US I believe this is illegal or at least rape which ever the rule is- an adult can’t have a consenting sexual relationship with a minor. So his girlfriend is not just raping him if they are having intercourse but she’s turning him against you.",
      "created_utc": 1747308580.0,
      "score": 3
    },
    {
      "id": "msgaf1q",
      "body": "File a report about a minr's kidnapping. As long as hes not 18 he cant be without his guardian. If this continues send him to military school",
      "created_utc": 1747318405.0,
      "score": 3
    },
    {
      "id": "msppbvo",
      "body": "Change all your locks, and don’t respond or reach out to him. If you’re paying for anything of his, like a phone, stop doing that right away. If he wants to be isolated then isolate him.",
      "created_utc": 1747439688.0,
      "score": 2
    },
    {
      "id": "msm6aah",
      "body": "This happened to my aunt 30 or so years ago. To this day she is still estranged from.the entire family. \n\nShe accused her deceased father of SAing her. \n\nShe no longer talks to any of her family.\n\nAt one point she kidnapped her kids and moved to a communion of some sort.\n\nIt was believed to be that her tharapist was brainwashing her.",
      "created_utc": 1747399172.0,
      "score": 1
    },
    {
      "id": "msn07rf",
      "body": "I'm so sorry 🥺",
      "created_utc": 1747408722.0,
      "score": 1
    },
    {
      "id": "msndjz1",
      "body": "I can't even imagine how hard it must be for you and I don't even know how to console you ",
      "created_utc": 1747412603.0,
      "score": 1
    },
    {
      "id": "msqyd9z",
      "body": "Have you thought about speaking to a therapist. I do hope nothing comes out of this on your end but I do hope your son gets into trouble for making a false accusation like this. I know he’s your son and you want to protect him at all cost but making a report like that is insane and this is why when some people are assaulted they are scared to come forward or they are not believed. Leave it to god keep loving life with your head held high if you didn’t do anything you have nothing to worry about I hope everything works out once that grown woman is done with your son I can bet he will come running back to mommy like he did nothing wrong when in fact this can ruin your life. I’m sorry your going threw this",
      "created_utc": 1747458528.0,
      "score": 1
    },
    {
      "id": "mswp1ry",
      "body": "then reply",
      "created_utc": 1747543996.0,
      "score": 1
    },
    {
      "id": "mswpdrz",
      "body": "You can't say you don't want to go on living.",
      "created_utc": 1747544171.0,
      "score": 1
    },
    {
      "id": "mt2n100",
      "body": "Assuming your honest then I’d simply support him through whatever and hopefully the abuser who’s manipulating him will lose when he realize her bullshit you can lead a horse to water but you can’t force them to drink",
      "created_utc": 1747630276.0,
      "score": 1
    },
    {
      "id": "mt8q5f4",
      "body": "Your son is being groomed by a predatory adult, I really suggest legal action",
      "created_utc": 1747714068.0,
      "score": 1
    },
    {
      "id": "mtcrgoe",
      "body": "I'm so sorry to hear your story but don't let the ignorance of someone else ruin your life..",
      "created_utc": 1747771413.0,
      "score": 1
    },
    {
      "id": "mtfiuqj",
      "body": "Well for one, your son was raped. 2, cut all contact. And I mean ALL contact.",
      "created_utc": 1747808401.0,
      "score": 1
    },
    {
      "id": "msbm0zc",
      "body": "[deleted]",
      "created_utc": 1747250264.0,
      "score": -30
    },
    {
      "id": "msb4gu6",
      "body": "Please don't give up, there has to be reasons. Any chance to talk with your son?",
      "created_utc": 1747245181.0,
      "score": -25
    },
    {
      "id": "msd7k42",
      "body": "She can't do anything though. The same tactics abusers use cults use and the family of the victims can't really do much, as it just drives the person further into the cult/abusers arms. There is a book and I think a movie that goes over this and explains what you can do to help. The conclusion is you can't do shit but be a support for when they need it. So if at any point they realize the situation they're in you can only step in then to lend a hand to lift them out of it.",
      "created_utc": 1747268653.0,
      "score": 217
    },
    {
      "id": "mscnokq",
      "body": "That too 100%. This is an overall insane story.",
      "created_utc": 1747261821.0,
      "score": 166
    },
    {
      "id": "mtghaw0",
      "body": "Good Lord he is a man, not a child.  Do you women want our future men to be women?  Dont play such an emotional game.  Cut all ties to all of them.  If he tries to contact you, tell him he must confess to police and issue a public apology to restore your name.  Until he does, you will not communicate with him.  Treat him like the adult he his.",
      "created_utc": 1747828061.0,
      "score": 3
    },
    {
      "id": "msfjfv4",
      "body": "I don’t think I’m looking for legal advice. I don’t think anything will come of it. I’m just trying to figure out how to keep on living.",
      "created_utc": 1747308618.0,
      "score": 45
    },
    {
      "id": "msbddcj",
      "body": "I cannot afford a lawyer and do not qualify for legal aid.",
      "created_utc": 1747247746.0,
      "score": 158
    },
    {
      "id": "mscy30o",
      "body": "I’m beside myself. I don’t know how to think about anything else. I have a million questions. My heart is shattered.",
      "created_utc": 1747265361.0,
      "score": 69
    },
    {
      "id": "mscy026",
      "body": "The son’s being groomed by a 21 year old woman, it’s most likely manipulation at play. The pedo’s trying to isolate him so he can’t leave. OP should try to stay in contact and help her son but with this kind of situation that’d also be hard",
      "created_utc": 1747265332.0,
      "score": 64
    },
    {
      "id": "msd6bm4",
      "body": "It’s really a shame that your uncle experienced that, but teachers are mandated reporters and are required by law to report any suspicions of abuse to authorities. If someone was abusing their child, and the teacher spoke to the parent instead of authorities, imagine how bad of a situation that would be for the child.\n\nEdited: mistyped a word.",
      "created_utc": 1747268218.0,
      "score": 53
    },
    {
      "id": "msgpldp",
      "body": "Bruh you don't even know what nationality they are",
      "created_utc": 1747322915.0,
      "score": 0
    },
    {
      "id": "msnfru4",
      "body": "I don’t know how to keep going. The pain is unbearable. I’m struggling at work as I can’t think of anything else. \nNothing can prepare someone for something like this.",
      "created_utc": 1747413254.0,
      "score": 1
    },
    {
      "id": "msc21l6",
      "body": "OP is the accusers mother. \n\nIt's depressing how often false accusations occur in these types of scenarios. My brother has schizophrenia and borderline personality disorder. He has made sexual assault accusations against teachers, family, and friends of family. Not a single one of them was true, and it was only ever to gain sympathy from others. \n\nThe legal system is flawed in any country, but the rule of law exists for both the accuser and the accused. Blindly believing someone of being innocent or guilty without evidence is detrimental to everyone involved in the situation.",
      "created_utc": 1747255046.0,
      "score": 47
    },
    {
      "id": "msbn6jf",
      "body": "Exactly",
      "created_utc": 1747250603.0,
      "score": -10
    },
    {
      "id": "msb5knt",
      "body": "I have started writing, and erased and re-wrote so many messages. I don’t know what to say….",
      "created_utc": 1747245489.0,
      "score": -2
    },
    {
      "id": "msftggx",
      "body": "You should talk to a lawyer and a therapist. These are serious issues.",
      "created_utc": 1747312662.0,
      "score": 102
    },
    {
      "id": "msoxqkx",
      "body": "You should be looking for legal advice, you can be arrested, go to jail, this can ruin your career and put you on a sex offender list!  I’d get the kid out of the house and never be alone with him",
      "created_utc": 1747429479.0,
      "score": 5
    },
    {
      "id": "msq2x4d",
      "body": "You think? I was abused by a female. She was found guilty. I always believe the victim.",
      "created_utc": 1747444853.0,
      "score": 3
    },
    {
      "id": "msbkh1s",
      "body": "That's fine just don't speak to them again.  If you are charged with something they will provide a public defender.  Just don't talk to them again.  They can lie to you and twist what you say.",
      "created_utc": 1747249807.0,
      "score": 282
    },
    {
      "id": "msd9wzy",
      "body": "I’m so so sorry. None of this is your fault. This is a tactic abusers and cults use to isolate people. I’m sorry, I think the best you can do for now is document everything and limit contact while making it clear you love him and are here for him unconditionally when he needs it. I might try to find a support group, or maybe even attend a few al-anon meetings (you don’t have to talk) to get perspective on loving and coping with child who is actively harming themself and you. Much love\n\nEdited bc initial wording was misleading",
      "created_utc": 1747269467.0,
      "score": 28
    },
    {
      "id": "msdcavp",
      "body": "I truly can not imagine. I am a mom to four boys 22-13 and it’s a horrifying, confusing, scary thought. I don’t even know where I would begin. Hang in there. Keep asking questions for support. I am so sorry.",
      "created_utc": 1747270290.0,
      "score": 8
    },
    {
      "id": "msngqp6",
      "body": "Yeah no one can even imagine something like this happening to them. I just hope everything gets better soon ",
      "created_utc": 1747413536.0,
      "score": 1
    },
    {
      "id": "mscadiz",
      "body": "Absolutely 100%. Believing all accusers is an incredibly dangerous path. To be fair to the commenter here, I think the intention is to *listen* and not simply dismiss accusations. There's a big difference, though, between blind belief and making voices heard.\n\nThe only thing that should be blind is justice itself, with no prejudice.",
      "created_utc": 1747257565.0,
      "score": 14
    },
    {
      "id": "msc37wf",
      "body": "[deleted]",
      "created_utc": 1747255423.0,
      "score": -6
    },
    {
      "id": "msb64ay",
      "body": "[removed]",
      "created_utc": 1747245644.0,
      "score": -20
    },
    {
      "id": "msiiqx0",
      "body": "Therapist first",
      "created_utc": 1747341959.0,
      "score": 10
    },
    {
      "id": "msd6u8m",
      "body": "adding to this- if u talk to him please record it so u can cover ya ass",
      "created_utc": 1747268402.0,
      "score": 67
    },
    {
      "id": "msboce8",
      "body": "They won’t provide a public defender if she doesn’t qualify for legal aid. There’s a difference between not being able to afford a lawyer and actually qualifying to get a public defender. Most people don’t qualify, even if they really can’t afford it.",
      "created_utc": 1747250947.0,
      "score": 79
    },
    {
      "id": "msc448s",
      "body": "She's definitely going to need to go no contact with her son and hire a lawyer. If I were in her situation, any belongings that the kid paid for would be boxed up and waiting for him at a neutral party's location as well.",
      "created_utc": 1747255695.0,
      "score": 8
    },
    {
      "id": "msb6xno",
      "body": "This is my most recent version: \n\n“I’ve started and stopped writing this so many times, because I honestly don’t know how to say what I feel. The truth is, my emotions are all over the place—changing by the hour. Some moments I feel heartbreak, others I feel anger. Sometimes I miss you so deeply it knocks the wind out of me. And other times I don’t know if I can ever look at you the same way again.\n\nWhat you’ve accused me of is incredibly serious. And it’s not true. I need you to hear that clearly—I did not do what you’ve said. I don’t know if you believe it yourself, or if you said it in a moment of desperation, maybe to hold on to something or someone else. I wonder if you wish you could take it back. I wonder if you realize how deep the wound goes.\n\nI’ve tried to piece together the ‘why,’ but in the end, I don’t have answers. Only questions. And pain.\n\nI don’t know what comes next. I don’t know if I can forgive you. I don’t know if you even want that. What I do know is that I still love you. That hasn’t changed, even if everything else has. \n\nI hope you find peace, I pray for your healing and ai hope that you can learn to love yourself the way I always have.”\n\n\n…..but, I don’t know if I should send it….",
      "created_utc": 1747245879.0,
      "score": -1
    },
    {
      "id": "msc1gng",
      "body": "You are exactly right. I made $2000 too much last year to qualify.",
      "created_utc": 1747254854.0,
      "score": 68
    },
    {
      "id": "msc8kjl",
      "body": "They absolutely will appoint a lawyer if she's charged with a crime. If she doesn't have a lawyer the court will appoint one and assess her ability to pay. This is a very basic right in most Western countries. She's in Canada.",
      "created_utc": 1747257017.0,
      "score": 6
    },
    {
      "id": "msbchud",
      "body": "Please be careful what you send him or say to him. Seek a lawyers advice.  Don't speak to police again without one",
      "created_utc": 1747247490.0,
      "score": 39
    },
    {
      "id": "msbd364",
      "body": "Honestly you should not reach out to him at all right now. I know that’s hard, but it could be used against you. Contact a lawyer, do not contact your son",
      "created_utc": 1747247663.0,
      "score": 16
    },
    {
      "id": "msd4woz",
      "body": "Anything you send can be twisted used against you. Don’t do this.",
      "created_utc": 1747267723.0,
      "score": 8
    },
    {
      "id": "msb7xf7",
      "body": "[removed]",
      "created_utc": 1747246165.0,
      "score": 6
    },
    {
      "id": "msgjvlh",
      "body": "This sounds like a well thought out letter. While I would generally agree to limit communication until things get sorted out, I don't see the harm in sending this letter to him, unless police have asked you not to contact him. If you feel he's being manipulated/brainwashed by the gf, you can add in your letter that he can always reach out to you when he'd like to work on the relationship. Of course, he'd need to be free of the gf and acknowledge the error of his ways, but I'd leave that part out of the letter. As for your understandable depressed and shocked feelings about the matter, please see a therapist immediately. There are places that charge less based on your lack of income.",
      "created_utc": 1747321229.0,
      "score": 1
    },
    {
      "id": "msckas9",
      "body": "If you’re in an area with local law schools, look online and see if they have a pro bono clinic. Sometimes their income caps are higher than legal aid. Your local court’s website should also have pro se information available",
      "created_utc": 1747260684.0,
      "score": 91
    },
    {
      "id": "msdvhqu",
      "body": "If it goes to court you can ask the judge to assign you a public defender by laying out a case for financial hardship. But that’s if you are facing serious criminal charges. In any case do not talk to the police anymore.",
      "created_utc": 1747277101.0,
      "score": 13
    },
    {
      "id": "msfepwv",
      "body": "Law students also all have to do pro bono work as part of their degree. Post this in as many legal subreddits or groups online that you can find, and someone will reach out to help",
      "created_utc": 1747306436.0,
      "score": 5
    },
    {
      "id": "mshosgw",
      "body": "They already assessed her ability to pay, she said that. She’s $2000 over the limit, which means she doesn’t qualify. The idea that lawyers are magically appointed to people by the court is complete BS. You have the *right* to an attorney, and one will ONLY be appointed to you if it is *proven* you don’t have the financial capabilities to pay *according to the law*. She was found to make too much money to be appointed a lawyer. They are *not* going to appoint her a lawyer.",
      "created_utc": 1747333123.0,
      "score": 1
    },
    {
      "id": "msbd6yp",
      "body": "I 100% cannot afford a lawyer and am not eligible for legal aid. 😞",
      "created_utc": 1747247693.0,
      "score": 3
    },
    {
      "id": "msbdm2v",
      "body": "I haven’t spoken to him because I’m afraid to make things work. \nI am not able to afford a lawyer.",
      "created_utc": 1747247817.0,
      "score": 5
    },
    {
      "id": "msbdtl1",
      "body": "It really is hard! This all feels impossible!!",
      "created_utc": 1747247877.0,
      "score": 5
    },
    {
      "id": "msb8ksc",
      "body": "I appreciate your input!! I am not surprised that it reads “unstable”. I don’t feel stable at all. I’m in a million pieces. This is a pain I never could have imagined…",
      "created_utc": 1747246352.0,
      "score": 10
    },
    {
      "id": "mshxtti",
      "body": "They choose to do so but they don't have to",
      "created_utc": 1747335831.0,
      "score": 1
    },
    {
      "id": "msbxkzu",
      "body": "We couldn’t afford a lawyer either but sometimes you have no choice but to incur debt when you need a lawyer",
      "created_utc": 1747253658.0,
      "score": 13
    },
    {
      "id": "msbn5m7",
      "body": "Don't talk to him. There's nothing you could say that will help, because they have a plan and you don't. I know how hard it is, but as of now your son and his girlfriend are \"them\" and they are wholly against you. I understand you can't afford to hire a lawyer right now, but shop around in your area anyways. Usually there are a handful who will consult for free, offer preliminary advice, and won't charge until/unless you actually have to go to court. If that does happen, you'll want someone who knew the score ahead of time.",
      "created_utc": 1747250596.0,
      "score": 26
    },
    {
      "id": "msc5xxs",
      "body": "Forgot to add that you are also entitled to a lawyer when being questioned by police, again regardless of your financial situation. These are fundamental rights! If the police question you ask for a lawyer. They are legally bound to provide one. No ifs, buts or ands.",
      "created_utc": 1747256230.0,
      "score": 10
    },
    {
      "id": "msbjzgp",
      "body": "Ok. Just don't go to talk to police again.",
      "created_utc": 1747249663.0,
      "score": 6
    },
    {
      "id": "msk251p",
      "body": "Depends on the uni, at lot of universities you need to do it as experience in your third year",
      "created_utc": 1747361151.0,
      "score": 2
    },
    {
      "id": "msbzqjc",
      "body": "Incurring debt is not an option. My credit is maxed. I went through a divorce within the last couple of years and am still struggling to get on my own two feet. I am working two jobs just to make ends meet.",
      "created_utc": 1747254299.0,
      "score": 7
    },
    {
      "id": "msc6cg1",
      "body": "In Ontario?",
      "created_utc": 1747256350.0,
      "score": 3
    },
    {
      "id": "mskuwly",
      "body": "Well I’m a lawyer when I was in law school it wasn’t required at any of the law schools in the state but it was great to do pro bono work.",
      "created_utc": 1747373753.0,
      "score": 3
    },
    {
      "id": "mu3dayf",
      "body": "I get it. We had to declare bankruptcy after all was said and done.",
      "created_utc": 1748131921.0,
      "score": 1
    },
    {
      "id": "msc73ms",
      "body": "Yes! If you're being questioned by the police or charged with a crime in Canada you are entitled to legal representation, and police must inform you of that right. Simply state that you want a lawyer and they must appoint one *regardless* of your financial situation.",
      "created_utc": 1747256574.0,
      "score": 2
    },
    {
      "id": "mslrl2t",
      "body": "Not everywhere is America 🤙🏻",
      "created_utc": 1747392990.0,
      "score": 3
    }
  ]
}