{
  "id": "1hxf3f6",
  "title": "the hardest pill to swallow is that no one wants to be around someone whos miserable all the time",
  "selftext": "its all good if you're feeling a little down. fuck everyone literally, its not like im happy im this depressed rn, if i could change it i would've done a long time ago.",
  "created_utc": 1736436056.0,
  "score": 838,
  "num_comments": 80,
  "url": "https://www.reddit.com/r/depression/comments/1hxf3f6/the_hardest_pill_to_swallow_is_that_no_one_wants/",
  "comments": [
    {
      "id": "m68kxw5",
      "body": "It’s hard being depressed and feeling miserable. But we’re the only people who have to deal with the depressed person 24/7. It’s worth checking with family, friends, or strangers and seeing if they’d want to spend time together even if it’s hours or minutes.\n\nYou’re right, no one wants to be around us 24/7, hell i don’t want to be around myself that long. But that doesn’t mean that other people wouldn’t be happy to spend shorter amounts of time with us.",
      "created_utc": 1736436915.0,
      "score": 156
    },
    {
      "id": "m68qg4n",
      "body": "Eh, I don’t blame them for not wanting to be around me. I wouldn’t want to be around me either. I’m somewhat of a Debbie Downer. I can easily bring down the mood of everyone around me by speaking my mind, so with time, I’ve learned to filter what I say and act “normal” so that I don’t suck the happiness out of my family and those around me.",
      "created_utc": 1736438574.0,
      "score": 85
    },
    {
      "id": "m68m4tm",
      "body": "I know this and thats why Im not looking for anyone. In sense, I protect other people.",
      "created_utc": 1736437280.0,
      "score": 59
    },
    {
      "id": "m68pznm",
      "body": "The feeling of guilt and embarrassment make me push others away, now I'm alone more than ever\n\nI have no hope",
      "created_utc": 1736438437.0,
      "score": 29
    },
    {
      "id": "m69preo",
      "body": "YES! \"How are you doing?\" Is said because their polite. 90% of the time someone asks they'd be terrified to have an honest answer.",
      "created_utc": 1736448827.0,
      "score": 17
    },
    {
      "id": "m6b6mps",
      "body": "[removed]",
      "created_utc": 1736464609.0,
      "score": 11
    },
    {
      "id": "m6ahtrv",
      "body": "I’ve lost too many friends for being too sad for too long. I get it but I don’t respect it.",
      "created_utc": 1736456996.0,
      "score": 12
    },
    {
      "id": "m68u5q4",
      "body": "I feel this real hard. Over the course of a few years, I have let all my friendships go because of that reason. People may tolerate it for a little bit, but, I’ve been going on 7 years now, and a friend who can handle a depressed person that long is a rare unicorn. Ultimately, I didn’t think I had those, so I saw myself out before they could ask me to.",
      "created_utc": 1736439682.0,
      "score": 10
    },
    {
      "id": "m68wiro",
      "body": "I've been on both ends. I think I still am really. Unless you're commiserating already, putting your shit mood on someone else almost implies that you think what you're dealing with is worse than whatever they are silently. But the fact is everyone is dealing with something. There are situations where it's appropriate to let your guard down and show how you really feel but I genuinely can't blame anyone for not wanting to take all that negative energy on, on top of their own. Misery is contagious but so are smiles.",
      "created_utc": 1736440377.0,
      "score": 6
    },
    {
      "id": "m69fw3o",
      "body": "It's tough because personally,   I don't like being around people when I'm depressed like I am now. I don't even want to be around family too much. I feel like I can handle depression better being alone.",
      "created_utc": 1736445985.0,
      "score": 6
    },
    {
      "id": "m6bl81y",
      "body": "This is why no one wants to date me I think they sense the depression on me. I act so fake and happy and carefree but they can tell something is off. Being pretty doesn't mean shit if you're depressed as hell and people can feel that energy",
      "created_utc": 1736469493.0,
      "score": 6
    },
    {
      "id": "m69gl6y",
      "body": "Is the hardest pill not the sadness inside oneself? Not wanting to be around oneself? Others are not a goal. Love yourself is more important then being liked by others bcs if you love yourself you will automatically radiate it and share it with others, then you attract others",
      "created_utc": 1736446189.0,
      "score": 3
    },
    {
      "id": "m69xlbh",
      "body": "Helping other depressed people will help our depressed selves..  Look outward instead of inward..  It's not easy but we have to focus on others instead of ourselves...  It took me a while to figure this out..  When I'm too depressed I avoid everybody.. Why ruin their day?",
      "created_utc": 1736451085.0,
      "score": 3
    },
    {
      "id": "m6aazgy",
      "body": "Find depressed friends",
      "created_utc": 1736455001.0,
      "score": 3
    },
    {
      "id": "m6b8c2s",
      "body": "Once my depression hit, I deleted all social media so that I wouldn’t post depressing stuff. Anytime I would, it usually gets ignored and that hurts even more. I’d rather feel lonely than ignored",
      "created_utc": 1736465177.0,
      "score": 3
    },
    {
      "id": "m68mq9o",
      "body": "I came to this realization yesterday. My father who when gets his buttons pushed by my mother so easily he goes of the rails saying hurtful things and throws himself into this hateful rant will drink alcohol and smoke cigarettes even though its harmful to himself. \n\nI came to the conclusion that I didn’t want to be around him who is miserable all the time. Why would I want to be around that kind of energy. He makes it challenging to bring helpful solutions to problems that need fixing. Complaining about doesn’t help the situation. But thats how he processes his feelings. Im just choosing not to be around it anymore.",
      "created_utc": 1736437459.0,
      "score": 5
    },
    {
      "id": "m698g89",
      "body": "My mom told me she didn’t want to talk to me if all I was going to do was despair and say things like “I’m never getting better.” And honestly, I respect that. At first it was upsetting but it made me stop constantly saying stuff like that and reinforcing those horrible thoughts.",
      "created_utc": 1736443847.0,
      "score": 4
    },
    {
      "id": "m6bbiej",
      "body": "i have friends that are an absolute shining bright star that can make you laugh at anything anytime, who have nothing to complain about even if theyre tired like crazy and then im here on the side and i feel terrible. and this is exactly why i also always want to drop all my friends and reserve me to my own self, no need to worry of burdening others in one way or another, i feel so bad.",
      "created_utc": 1736466251.0,
      "score": 2
    },
    {
      "id": "m6by96g",
      "body": "i can confirm this without a doubt when i was still severely depressed people that were foriced to be around me always felt off and didn't like being around me because i was spreading negative vibes. it was like a cycle of constantly being sad because of xyz factors but xyz factors only occur because i'm depressed\n\nbut to bring light into the subject, i decided to turn things around for myself it took a long time, years even to get to where i am today but it's fucking worth it and i believe everyone has hope it just takes a lot of work",
      "created_utc": 1736473837.0,
      "score": 2
    },
    {
      "id": "m6c22sp",
      "body": "Yep this is true. My friends and family all cut me off because they have their own problems and sick of listening to my disgusting trauma and life.!",
      "created_utc": 1736475138.0,
      "score": 2
    },
    {
      "id": "m6d1s38",
      "body": "unfortunately that is true, those who have not experienced the strangulating pain can not understand, they can not relate, eventually they will walk away.",
      "created_utc": 1736489359.0,
      "score": 2
    },
    {
      "id": "m6d5mlj",
      "body": "It's not just the 24/7 struggle bus. I think our responses change alot when we're depressed. We're less curious, less interested, easily hurt by passing criticism or even just jokes, and we self-reflect on everything we hear. I'm surprised I didn't lose everyone around me sooner",
      "created_utc": 1736491415.0,
      "score": 2
    },
    {
      "id": "m6exkur",
      "body": "Yeah, ironically, we exhaust \"normal\" people. Big fucking comedy",
      "created_utc": 1736522716.0,
      "score": 2
    },
    {
      "id": "m6jkjvg",
      "body": "everyone is selfish. but no one wants to admit that, so they say \"get help\" and \"talk to a friend\" but take it back once they have to deal with it personally and realise that it's much more than you just feeling down and needing a pat on the back only this once.",
      "created_utc": 1736579530.0,
      "score": 2
    },
    {
      "id": "m69cqbj",
      "body": "I just got married and I’ve been clinically depressed for well over 10 years. There’s hope for us miserables yet.",
      "created_utc": 1736445073.0,
      "score": 2
    },
    {
      "id": "m6at5lz",
      "body": "I used to be super depressed and pessimistic. I'm finally in a better place now, but looking back on it I was such a drag. Just constantly venting to people, often about the same thing, and bringing all of this negative energy. I pretty much never had anything positive to talk about — no hobbies, interests or anything. Just complaining, talking about how much love sucks, my life sucks, etc. \n\nHonestly, I get it. Other people had their problems too, but they didn't constantly dump them on me. I was not a healthy person to be friends with or date at the time",
      "created_utc": 1736460344.0,
      "score": 2
    },
    {
      "id": "m69hob9",
      "body": "had to swallow this. I was very vocal about my depression yet noone really gaf. I was disillusioned by the mental health talks and constant virtue signaling by people and when faced with the problem at hand they fail to provide.\n\nthe ones that do get peoples attention and sympathy are ridiculously manipulative and fake. \n\nthat's what makes it difficult. that awareness is tiring and masking makes it more convenient for you and them in the long run",
      "created_utc": 1736446502.0,
      "score": 1
    },
    {
      "id": "m69hpo8",
      "body": "This is so true! It's literally the two rocks I get stuck between.. suffering because I'm creating suffering, and suffering because I have to hide the suffering. But in the end, it should always be the final straw for finally making changes in ones life.",
      "created_utc": 1736446513.0,
      "score": 1
    },
    {
      "id": "m69q76o",
      "body": "True. And I love it when they follow you on social media and never reply to any of your posts and comments. Like they love looking at a train wreck from a distance.",
      "created_utc": 1736448952.0,
      "score": 1
    },
    {
      "id": "m6agrze",
      "body": "The people that really understand depression and like you as a person, will want to be around you though. I’ve got that going with my bf of over 10 years. We both deal with depression and anxiety.",
      "created_utc": 1736456687.0,
      "score": 1
    },
    {
      "id": "m6ahihn",
      "body": "It’s also very hard when people just say I’m habituated to feeling like that and have no intention of getting better and leave you.",
      "created_utc": 1736456904.0,
      "score": 1
    },
    {
      "id": "m6ahmoq",
      "body": "That's why I hide mine with a smile",
      "created_utc": 1736456939.0,
      "score": 1
    },
    {
      "id": "m6b9pi2",
      "body": "Sometimes misery loves company. It’s why coworkers get together and bitch. I think it can help in small doses. My brother and I bitch about our childhood together when we hang out sometimes.",
      "created_utc": 1736465641.0,
      "score": 1
    },
    {
      "id": "m6bb87c",
      "body": "That's why I developed a personality with lack of affection and openness, so people didn't realize about how I was feeling, It's bad going through that, but then, it didn't affect my relationships even when I didn't wanted to socialize.",
      "created_utc": 1736466157.0,
      "score": 1
    },
    {
      "id": "m6binke",
      "body": "Me being fine with friends in difficulty :o\n\nSure not 24/7 coz i have stuff to do, but even like 5/7, could do 12/5.. i would be fine with it. However when i am in need, eh, it gets difficult.\n\nLet's not excuse others for ignoring people in difficulty or abandoning them and no it's not necessarily on us to make us feel better, especially if there are exploitations in place.\nIf they have their own issues to deal with, well yes of course, but if they don't? If there is no comparison?\nIf they are part of the cause?\nPlease, be more arrogant when you deserve it.",
      "created_utc": 1736468648.0,
      "score": 1
    },
    {
      "id": "m6bv8er",
      "body": "and everyone needs support yk",
      "created_utc": 1736472830.0,
      "score": 1
    },
    {
      "id": "m6czrde",
      "body": "everyone is miserable and all the negative experiences",
      "created_utc": 1736488319.0,
      "score": 1
    },
    {
      "id": "m6e447l",
      "body": "I relate to this so much. I can see it in my wife's eyes. Sometimes I even think I see it in my kids eyes. They don't understand. I didn't ask for this. I don't want it. I know I must be awful to be with. And that's what it feels like when the walls close in.",
      "created_utc": 1736511872.0,
      "score": 1
    },
    {
      "id": "m6f7d61",
      "body": "That's true, but it's not just an internal issue. being happy isn't enough to fit in with the rest.",
      "created_utc": 1736525657.0,
      "score": 1
    },
    {
      "id": "m6hit7x",
      "body": "I cannot stand to be in the same room as myself right now. I want friends and interactions but its like my brain goes blank.",
      "created_utc": 1736550344.0,
      "score": 1
    },
    {
      "id": "m6iu0za",
      "body": "My boyfriend dumped me because I’m miserable all the time. I didn’t know how much of a shitty person I was.",
      "created_utc": 1736566781.0,
      "score": 1
    },
    {
      "id": "m6pvl7h",
      "body": "Hi I'm a mental health professional with over a decade experience working in psychiatric hospitals and mental health clinics where I provide expert guidance and support to individuals, families, and groups regarding mental health please join our FREE support group with exclusive perks today https://whop.com/anxiety-and-depression-support-96/ any partnerships that aligns with this initiative is welcomed 😊",
      "created_utc": 1736672003.0,
      "score": 1
    },
    {
      "id": "m749rm6",
      "body": " What’s even harder is that non-depressed expect you to be there every time they are miserable.",
      "created_utc": 1736871830.0,
      "score": 1
    },
    {
      "id": "m8q82w4",
      "body": "That's why I fake it all the time and the good part is no one even notices anything!",
      "created_utc": 1737642598.0,
      "score": 1
    },
    {
      "id": "m6ba8ub",
      "body": "Anytime I meet anyone that deals with life like me, it's twisted. It's kinda nice to know I'm not alone but I hate that anyone has to exist with this... AND to the 100s of thousands that suffer worse... ❤️😢🤟🏻... You are a-fken-mazing!",
      "created_utc": 1736465824.0,
      "score": 6
    },
    {
      "id": "m6jkx8l",
      "body": "maybe. though I doubt that. I can't even hide how miserable I am anymore, so I can only bring negativity and arguments to the table. most people would hardly like that.",
      "created_utc": 1736579754.0,
      "score": 5
    },
    {
      "id": "m68uhyb",
      "body": "I feel this hard. It’s like a skill that any depressed person, who needs to be in social situations here and there, end up developing, right?",
      "created_utc": 1736439782.0,
      "score": 21
    },
    {
      "id": "m6bmy1n",
      "body": "I've found that faking it and wearing the mask seems to make me rebound into a worse state at some point.",
      "created_utc": 1736470053.0,
      "score": 10
    },
    {
      "id": "m6pzme4",
      "body": "All of us filter our words and thoughts to some degree. You are good",
      "created_utc": 1736674564.0,
      "score": 3
    },
    {
      "id": "m690hod",
      "body": "I’ve been thinking about this and .. who am I to choose whether another person chooses to be w me. \n\nIt is true, it can be generally hard being around someone w depression.",
      "created_utc": 1736441529.0,
      "score": 17
    },
    {
      "id": "m6hart4",
      "body": "Yeah me too. I feel like if I really ended up loving someone, I wouldn't want them to be with me because I'd be convinced they deserve better than this. I treat even friendships the same way now - like you know, it's good that those people left as they also deserve a better friend. It's just better off that way",
      "created_utc": 1736547755.0,
      "score": 3
    },
    {
      "id": "m79vb7t",
      "body": "that's what I tell myself, too. even though, in reality, I give them more trouble by being reckless and suffering while lying to them. maybe it's for them, or for me, I don't know. it's just what I'm used to now.",
      "created_utc": 1736950413.0,
      "score": 1
    },
    {
      "id": "m68xz9f",
      "body": "You didn't ask for any of this, you have nothing to feel guilty about. Stop self flagellating, try to help other people, and come back to me if you still don't feel better after seeing what a positive impact you can have if you try",
      "created_utc": 1736440804.0,
      "score": 11
    },
    {
      "id": "m6ai1oa",
      "body": "I’m in the same boat. It’s an awful feeling.",
      "created_utc": 1736457060.0,
      "score": 4
    },
    {
      "id": "m6b8wmu",
      "body": "I hate when people ask me how I’m doing because I always feel obligated to lie and say I’m fine. God forbid I tell them I’m doing badly, they’ll get mad at me and blame me",
      "created_utc": 1736465370.0,
      "score": 5
    },
    {
      "id": "m6az0pg",
      "body": "I honestly don’t mind an honest answer. Choosing how to phrase things depending on the relationship with the person is a must though. I wouldn’t want a stranger to trauma dump everything.",
      "created_utc": 1736462152.0,
      "score": 2
    },
    {
      "id": "m6b6xxb",
      "body": "exactly what ive been going thru, and the second you tell someone about it its almost like we're having a competition about how has it harder (at least for me) and saying stuff like \"you dont even know what its like to depressed\" or \"you have nothing to be depressed about\"",
      "created_utc": 1736464712.0,
      "score": 1
    },
    {
      "id": "m6c9hda",
      "body": "[deleted]",
      "created_utc": 1736477697.0,
      "score": 1
    },
    {
      "id": "m7bt72p",
      "body": "You aren’t missing much. Most people are fake and looking for friends who can validate them. I haven’t had friends for years and I don’t miss them. The one “friend “I had used me as a dumping ground for her problems. Once I let her know that we would be talking equally about me, she stopped saying hi. You’re better off without them sometimes.",
      "created_utc": 1736971251.0,
      "score": 2
    },
    {
      "id": "m6bvijk",
      "body": "That is interesting. Also, you might not be giving off signals that you want to take dating another step further. But I know the feeling. I tried to play the small talk game one day and the person was side eyeing me like, \"Girl, you seem to be trying way too hard to be fun right now!\" 🤣",
      "created_utc": 1736472923.0,
      "score": 1
    },
    {
      "id": "m6afdtc",
      "body": "Let's just be miserable together \\\\o/",
      "created_utc": 1736456284.0,
      "score": 5
    },
    {
      "id": "m69chab",
      "body": "That was the pill I had to swallow. I drank because it cheered me up for a minute, and those were the moments I remembered after. I felt like I WAS helping other people by altering myself but in reality I was hurting everyone and pushing anyone who did care about me away because who wants to sit by and watch that?",
      "created_utc": 1736445003.0,
      "score": 1
    },
    {
      "id": "m6butyw",
      "body": "Congrats. ",
      "created_utc": 1736472695.0,
      "score": 1
    },
    {
      "id": "m68zz5t",
      "body": "Not the commenter you're replying to, but I think so. I can it socially functional depression. \n\nI 'm currently stuck in this shitty loop where I really do not want to talk to or hang out or make plans with anyone, even my closest friends, because it just feels so draining and feels like impossible daunting task I have to take on when my brain and body just want rest. However, I know that having a social life and maintaining those relationships is important and if I let them slip away my emotional state will get worse. I don’t want to be that person with no friends and no support, especially later in life when forming relationships is even harder, just because I couldn’t make the effort. And I don't want my friends to feel bad either. \n\nSo I just always say \"yes\" to plans and always follow through, respond to texts even if I'm a week late, put on a happy face and pretend everything is good, be interested in conversations etc. A lot of time I just feel like a cheerleader for people, hyping up them and only talking about their life because mine is so bleak and pathetic. Sometimes the faking is so difficult it feels like another full time job. But I know I risk these friendships and worse depression if I drop the façade. Idk, just another shitty depression loop I'm stuck in.",
      "created_utc": 1736441381.0,
      "score": 24
    },
    {
      "id": "m69q439",
      "body": "I think so. It’s also a matter of reading the room. There’s a time and a place where you can say what  you think. It depends on who’s around you and how understanding they are. I definitely wouldn’t rattle off my negative thoughts around a stranger or a new acquaintance. I don’t do that at work either.",
      "created_utc": 1736448927.0,
      "score": 1
    },
    {
      "id": "m8519oo",
      "body": "I'm struggling with this currently. I love my girlfriend, and I know she's crazy about me, but it doesn't make me feel good. It makes me feel bad for knowing that she fell for a man who will never be able to provide her with the life she deserves. Really, I'm a piece of shit for pursuing her in the first place. I knew what kind of person I was. The things I wasn't capable of. Yet I got her to fall in love with me anyway. \n\nShe wants to marry me. She says she wants to spend the rest of her life with me. And all I can think about is how much she'd regret that down the line. Maybe she'd still love me, but she wouldn't have a good life. I know this because I can't create a good life for myself. So how could I do that for me + 1? \n\nI could break it off, but that still makes me a piece of shit. I knew what I was like. I knew that this problem would arise eventually if I took it this far. Why did I pursue her in the first place if I knew that if she fell for me the only options would either be for her to join me in my misery or for her to have her heart broken? \n\nWhat a curse it is to be this mentally fucked.",
      "created_utc": 1737368113.0,
      "score": 1
    },
    {
      "id": "m6d021m",
      "body": "SAME ! Thank you. I feel that they ask how are you while thinking 'please say fine please say fine'\n\nMe: I'm ok\n\nA wave of relief pulses over their face as they let the breath they'd been holding accidentally out",
      "created_utc": 1736488467.0,
      "score": 3
    },
    {
      "id": "m6b0sz3",
      "body": "Good point. \n\nI feel like a burden and a downer in general if I'm becoming the depressed person that can't be helped. I feel I've becoming that frustrating friend more and more. \nIm really not interested in getting better. I've lived a busy life, my health is dipping off fast, ANNNND...  I've felt genuine love and happiness (it was a lie but I know how I felt then. Even if it was a facade....  \n... No one should ever be subjected to a relationship with me. That should break the Geneva convention)",
      "created_utc": 1736462717.0,
      "score": 3
    },
    {
      "id": "m6cl8if",
      "body": "I think it’s okay to have those boundaries, but that’s the kind of thing you get in front of. You talk about it instead of allowing it to build up and destroy something good. Friendships aren’t easy to come by",
      "created_utc": 1736481958.0,
      "score": 1
    },
    {
      "id": "m7btvr2",
      "body": "I totally hear you on that too. But I do wish I had people who I could count on, you know? People who understood me, and who would help just by being in my life (not that I’m saying I only want friends so they can help me…)",
      "created_utc": 1736971450.0,
      "score": 2
    },
    {
      "id": "m6bqofu",
      "body": "I hear you. I think I was at that phase at some point, and then the pandemic hit and I’ve never recovered.\n\nEDIT to clarify: In case it wasn’t clear, that I now just don’t do anything with anyone. After the pandemic curtailed so many interactions, I was even more depressed to pick it up when it ended.",
      "created_utc": 1736471302.0,
      "score": 3
    },
    {
      "id": "m6ag0tl",
      "body": "This💯",
      "created_utc": 1736456467.0,
      "score": 2
    },
    {
      "id": "m6dnqzf",
      "body": "I see it as almost an equal split, as much as there are people who ask how you're doing and expect a generic response there are also just as many people who ask the same thing and genuinely want to know how you're doing. Matter of fact if you give them a generic answer they'll keep pushing for a real one",
      "created_utc": 1736502584.0,
      "score": 2
    },
    {
      "id": "m6b1j4m",
      "body": "I don’t blame anyone for being depressed. It’s an illness. However, how we frame our thoughts helps. Doing it without dismissing the illness but also while acknowledging blessings helps me get through the day. My depression is extremely atypical. My distress is still valid though. Same as someone who has troubles seeing their blessings. I don’t blame them at all.",
      "created_utc": 1736462951.0,
      "score": 3
    },
    {
      "id": "m6b137d",
      "body": "Maybe I'm deeply trapped in my void (the abyss where I used to have whatever was left of my heart and soul)",
      "created_utc": 1736462808.0,
      "score": 1
    },
    {
      "id": "m6e5s3c",
      "body": "Absolutely. It's 50/50",
      "created_utc": 1736512638.0,
      "score": 1
    },
    {
      "id": "m6b8mhq",
      "body": "I'm still new to this \"God mode level\" of mental pain.\nI've lived through Soo much like hereditary cancer that took my dad and his dad before I was born, verbal and physical abusive stepdad, the only REAL person that loved and I reciprocated mutually being in the car with me when t boned by drunk driver. Our car rolled. I was pinned inches from her but couldn't reach her hand... But I listened to her drown as her internal bleeding flidde.... \nI've lived through so much. That entire mentality that God doesn't give us more than we can handle. \nMe: \"hey God! I'm REDD McD! I'm not Clark Kent or anybody else ! This is identity theft!\"\n\nI identify as screech. Went \n\n\nWent through misery for 41 years and thought that my true love that I accidentally met was the jackpot for all the karma points I had banked up.... \n...\n\nIdk .. I don't even remember what I was replying to. I need to tag someone in so I can get a breather... Or I need to tap out\n\nI'm sorry. I'm disintegrated. Everything about me is just powdered glass dust. \n\nNo point in sweeping me up. Just let blow away.",
      "created_utc": 1736465275.0,
      "score": 2
    },
    {
      "id": "m6bd1px",
      "body": "Again, it’s entirely valid what you experience. Everyone is different.",
      "created_utc": 1736466769.0,
      "score": 2
    }
  ]
}