{
  "id": "1fj6pfe",
  "title": "I’m sick of being told “That’s Life”",
  "selftext": "I’ve been depressed for a majority of my life now. I’ve figured out how to manage and function despite wanting to just quit. \nOn rare occasions I end up going to bed and just forgetting about it all to get away from responsibilities despite the consequences. \nI’m still alive. \nWhenever I vent my frustrations I’m told “that’s life” which to me sounds like “I don’t care.” \nOr that I’m too negative and that this is just a stage and things will get better. Or to change my perspective.\nNone of these have worked cause at the end of the day I’m still facing the same bullshit that is my life and struggling to catch a break. I work from the moment the sun comes up all the way into the night. School hasn’t done anything for me or propelled me forward in life. \n\nThat’s life but I’m supposed to pretend it’s ok when I’m clearly not ok?? I’m stuck in this stupid cycle hoping something will come around just to be denied something good because “that’s life and the time will come eventually.” Eventually as in probably not within my life time. I feel so hopeless and it’s ridiculous to subject myself to these thoughts. I haven’t had a moment where I can just be without the day having the be in preparations for work and school. \n\nRecently I’ve gotten a haircut which completely destroyed my self image. I’m such an idiot because I did it out of impulse and imagined that it would look good on me. \nI feel like people are lying when they say it looks good because I end up having to explain the whole reasoning behind cutting my hair with some made up bullshit like “it was damaged and extremely unhealthy” then they give me unsolicited advice on what I should’ve done with my hair. That just confirms they were lying because if it was truly fine then there shouldn’t be a “what I should’ve done instead.” \nI don’t want to go out any more or show my face to anyone that may know me because I already had this same stupid conversation about my new hair so many times as work already and a few acquaintances who clearly don’t look at me the same way anymore cause I look ugly now. \nI just wanted to look good for once but did something stupid. \nI don’t like looking at my reflection and I wake up disappointed because I look different and happier in my dreams. \n\nGod. This sucks so much. I feel so alone and trapped. Don’t even want to go outside and my self esteem is in the basement under bedrock. So fucking stupid ",
  "created_utc": 1726597476.0,
  "score": 795,
  "num_comments": 66,
  "url": "https://www.reddit.com/r/depression/comments/1fj6pfe/im_sick_of_being_told_thats_life/",
  "comments": [
    {
      "id": "lnnvipx",
      "body": "I hate it when people say things like, \"That's life\", \"It is what it is\", or other similar platitudes.  To me, it sounds like, as you said in your post, \"I don't care.\"\n\nPeople who give such \"advice\" always backfire on me, so I know what it feels like for you.  It seems to me that they don't really want to help.  They just don't want to hear about how miserable our lives are.  So, to them, it's like, \"Either take our advice or shut up.\"  People who don't understand what it's like really don't care.",
      "created_utc": 1726620664.0,
      "score": 207
    },
    {
      "id": "lno709l",
      "body": "“Cheer up”, “it could be worse”, and my personal favorite “are you taking your meds”. I used to think people were trying to be helpful but they just suck. I was 40 before I realized not everyone felt this way all the time. I am 50 now and it’s all just pointless.",
      "created_utc": 1726625090.0,
      "score": 47
    },
    {
      "id": "lnob2zo",
      "body": "I f***** hate when people say fake it till you make it.",
      "created_utc": 1726626727.0,
      "score": 36
    },
    {
      "id": "lnoffqk",
      "body": "First off, you pain sucks so bad, I’m sorry you’re going through it. Depression sucks so bad, and your struggles are tough. \n\nI want to add some context as someone who was deeply depressed for about a decade but is no longer. \n\nIt is very hard for someone who’s never experienced depression to understand what it’s like. How do I know? Because I can barely feel or remember how that headspace works. It’s so foreign to me now, I only remember it in an academic sense what it was like. Your brain is working in a totally different way. \n\nI don’t bring this up to brag, but point out that they very very likely don’t know what harm they may be causing you. \n\nAnd also in your place of feeling, there are hardly any right answers. I remember when I was depressed I don’t remember if there was anything that someone said to me that ever actually made me feel better. And I’ve tried to console friends who are depressed, and even after having been very depressed I don’t know how to console them. \n\nSo whoever is telling you “That’s Life” is either just unable to comprehend what’s going on with ya, or they too are depressed and don’t know how to live with it either. \n\nAnd since you says you are at both work and school, you are in a very stressful time in your life, which is likely elevating your feelings. Which sucks, not a ton you can do about it for the time other than stick it out. \n\nSo internet stranger, I don’t know if any of this helped or hurt. I wrote it with the intention of helping but understand if not. Wish you best, hope things can start getting better for ya",
      "created_utc": 1726628544.0,
      "score": 19
    },
    {
      "id": "lnnvoq8",
      "body": "Seriously. Like, I was already feeling like absolute shit and then somebody will tell me to \"get over it\" or \"thats life\" or stuff like \"grow up\" and it pisses me off so fucking much.",
      "created_utc": 1726620728.0,
      "score": 29
    },
    {
      "id": "lnnwzig",
      "body": "I totally agree.",
      "created_utc": 1726621217.0,
      "score": 10
    },
    {
      "id": "lnoi31a",
      "body": "Yeah, those folks are insufferable. Got told that all growing up, and it's like. Maybe if they stopped being so apathetic to their own suffering life wouldn't have to be like that. I always have these people sweep their own suffering and pitfalls under the rug, it is like they lack empthy for other people because they don't even have it for themselves for one reason or another. \n\nDon't take em to heart OP. I know that's hard. And if you can, wear a beanie or hat till it grows a bit maybe? We deal with similar dysmorphia when our hair is cut. You might also try styling it differtly for a bit? We are going through similar after a haircut a few weeks ago and it sucks. Some different shampoos help too if it needs to look thicker or fluffier.",
      "created_utc": 1726629693.0,
      "score": 7
    },
    {
      "id": "lnp5bvx",
      "body": "\"That's life\" to depressed/suicidal people is such a dumb thing to say because yeah I know its part of life. That's why i don't want to be alive",
      "created_utc": 1726642509.0,
      "score": 7
    },
    {
      "id": "lnoch5a",
      "body": "I also really get annoyed to hell when people tell me to “stop being negative” like why should I stop when things in my life are so friggin negative or when I am dealing with negative things too???",
      "created_utc": 1726627309.0,
      "score": 13
    },
    {
      "id": "lnona6p",
      "body": "This is on my list of 'things never to say to someone with depression'.\n\nI mean, would these people go up to someone with cancer, or a broken leg and say 'oh that's just life'?\n\nI file those comments into the mental trashcan along with 'just be positive' and 'can't you just not be depressed?'.",
      "created_utc": 1726632141.0,
      "score": 6
    },
    {
      "id": "lnorjb0",
      "body": "Some people really don’t understand that silence and understanding is sometimes better than some whitty punchline. Like, damn dude, in 2 words you just repeated back to me everything I was complaining out (:0\nBut with the haircut, it will grow back, people will stop asking, it’s all just a war of attrition. Hold the line o7",
      "created_utc": 1726634332.0,
      "score": 5
    },
    {
      "id": "lnohsq8",
      "body": "I'm sorry your going through it 😔 here's the positive atleast your hair will grow back :) we all make silly choices, you don't have to explain to ppl your cut it may not look the greatest but you don't have to hid, you can get a hat or beanie that's what I do, a month ago I got a hair cut by a barber he did such a terrible job He messes up my cut I had bald spots it was embarrassing to say the least I had no choice but to wear a hat and let it grow out. I'm praying for you I hope things will get better in your life hang it there 🙏 💓",
      "created_utc": 1726629567.0,
      "score": 3
    },
    {
      "id": "lnola2z",
      "body": "Your struggles are valid. Life isn't fair and that fucking sucks. We shouldn't have to pretend be okay with it. I'm sorry for everything you're going through. I have also been depressed most of my life and the only thing that makes me feel better is knowing that everything is temporary. ❤️",
      "created_utc": 1726631172.0,
      "score": 4
    },
    {
      "id": "lno40r8",
      "body": "OH MAN, FEELS...",
      "created_utc": 1726623931.0,
      "score": 3
    },
    {
      "id": "lnotiyg",
      "body": "Yep. Was trying to explain to my therapist that I cry every time I open my laptop to deal with bills or job applications and she just said “sometimes you have to do things you don’t want to do”. \n\nThen tried to tell my mother that something HAS to be off, because I don’t think most people spend 90% of their time on the verge of tears, and she just replied “everyone is miserable”",
      "created_utc": 1726635394.0,
      "score": 3
    },
    {
      "id": "lnov9n9",
      "body": "It's not the life, it's the system. We are gaslit that that what we call a normal life is the right life. But no. This system is inhumane, and everyone who's not fine feels it, and then is gaslit into the idea it's all about them. They are wrong, they are doing wrong, they individually are responsible for not finding the glitch that gives them a better life. (Like something like being born as the offspring of the top 1%.)\n\nI'm dealing with depression my whole life and always wondered why I never heal. Or let's say, why every time I heal and \"the things that are normal life\" enter my life I'm depressed again. Well, maybe it's genetic and trauma, but why can I feel better, when \"the life as we know it\" doesn't touch me. And it always gets worse when I try to be part of that \"normal life\".\n\nWe live far away from what we really need. What wonders we are suffering. But there are the one who have given up and accept it. And the healthy souls who fight against this idea that that's life. They feel it's not and suffer more. So, do you prefer to kill the human within you and accept it, or is the human within your strong and won't accept it and suffer while fighting?",
      "created_utc": 1726636373.0,
      "score": 3
    },
    {
      "id": "lnp171w",
      "body": "those are the same people that when someone commits suicide or is checked-in a mental institution jump into the spotlight with cocodrile tears and with the standars bs \"I wonder if I could have helped him/help better\" .. when these super martyrs appear on tv I always say \"I am sure you were a very big part of the problem. I am sure you were all day why can't you be happy? suck it up, look at me I had it worse, you just do not want to...\".  When they talk about eating disorders on tv and the spotlight is on the portrayed suffering mother it is really sad..  probably that same mother is a huge part of the problem and even feels important by the enmeshment.. really sad, people are really on their own as encouragement is really really scarce and guilting or preying on pain is the norm. I prefer to be sad as I am and stop people on the spot with their bs help",
      "created_utc": 1726639782.0,
      "score": 3
    },
    {
      "id": "lnpf224",
      "body": "*\"Well...life isn't fair! Don't expect happibess, 'cause life is unfair, painful, and that's it!\"*\n\n\nWell, why TF do y'all keep bringing babies into this if life is supposedly nothing butpain??",
      "created_utc": 1726649480.0,
      "score": 3
    },
    {
      "id": "lnqksld",
      "body": "I hate this too and is why I don't really speak to most people about my issues or feeling on things unless we tend to think or feel similarly. \n\n\nThat said, since I've been on anti-depressants I think I have some insight into these people. The way I feel now vs. the way I think I've felt most of my life is eye-opening. It's like, I know I have a mountain of problems in my life, but I'm still optimistic and I don't think about them day to day. I just think: that will sort itself out or I'll deal with that in a bit, or *shrug, what's the worse that can happen. I get annoyed, but not depressed. Angry, but not depressed. Things roll off my back. I don't accept that these things are OKAY. But I'm unwilling to feel down about it. And I've been asking myself, is THIS how OTHER people have always felt? Holy sh*t! Lol 😆.... \n\n\nFor people with depression (or for me, anyway) every problem is like a stone, rock, or boulder and it all piles up into a mountain of rocks. And for everyone else, there is no mountain. They don't let the rocks pile up into anything because for every one that rolls by they shrug, \"that's life\". They're literally telling us what they tell themselves. I had an ex once who I felt never would give me any empathy when I expressed my feelings. And one day I asked him if he ever feels down or sad about anything. And he said \"sure, but I just choose not to dwell on it.\" Some people can see past their own experience and sympathize with you, others can't. But I believe that people with the appropriate balance of hormones in the brain, actively resist the lowering of their mood.\n\n\nI've now been trying to sort through what things really do matter to me and I am learning to appreciate being able to just let things go and be optimistic I general. \n\n\nBut ... it isn't good advice to give to someone who is dealing with depression because our minds really aren't capable of just thinking \"that's life\" or \"cheer up\". If we could just do that, then we would. And that's why I talk to my therapist and don't expect most regular people to say what I really need to hear.",
      "created_utc": 1726669519.0,
      "score": 3
    },
    {
      "id": "lnogkaf",
      "body": "I agree, sometimes it feels like unfair circumstances or situations are just excused. My least liked version is when someone says that to something clearly negatively impacting you, if it is just how things are then can't you at least be kind, take a few seconds to sympathize or try to help me in some way, anyway at all? Instead of brushing aside the feelings that have built up over so long just help of just be something that improves someone else's life for just one second. \n\nIt's these little interactions that just tear me down, over time it just grinds and grinds until it all seems so hopeless and without point.",
      "created_utc": 1726629030.0,
      "score": 2
    },
    {
      "id": "lnphm6v",
      "body": "I remember asking my grandpa why am I getting more and more sad as I grow up.\n\n\"that's life\", he said.\n\nNah, he's just a bit of an asshole. That's definitely not everyone's experience.",
      "created_utc": 1726651340.0,
      "score": 2
    },
    {
      "id": "lnokyhh",
      "body": "I do say that to myself whenever things don't go my way, but I know for a fact it doesn't have to be that way you have to try something to change it. Won't be easy, but it's worth a shot",
      "created_utc": 1726631020.0,
      "score": 1
    },
    {
      "id": "lnoulwj",
      "body": "When people used to tell me this at my old shrinks office... I would often say the phrase \"welp, shit or get off the pot, I guess?\"\n\nEdit; spelling",
      "created_utc": 1726635997.0,
      "score": 1
    },
    {
      "id": "lnq75pp",
      "body": "Lmao , I just got a shit haircut too , gonna be wearing a lot of hats",
      "created_utc": 1726664598.0,
      "score": 1
    },
    {
      "id": "lnqyc9l",
      "body": "I recommend the book or audiobook ‘Feeling Good’ and CBT therapy in general. I was in your position a few years ago, I’m in a much better place now. \n\nLife *does* suck sometimes, you are not wrong. It’s unfortunate that so many people have accepted that as ‘life’ in general, and no longer wish to improve it. I was told life was unfair a lot when I complained as a child. I remember thinking okay but why? We make the rules? Why not make it fair? But yeah I recommend CBT (cognitive behavioral therapy).",
      "created_utc": 1726673876.0,
      "score": 1
    },
    {
      "id": "lnr2nfk",
      "body": "Another contender: just go for a walk",
      "created_utc": 1726675220.0,
      "score": 1
    },
    {
      "id": "lnrn2l1",
      "body": "That's life and it is what it is are said by people who have given up, people who have settled, who see no way to improve things. Just because it is so at the moment, doesn't mean things won't improve for you in future.",
      "created_utc": 1726681661.0,
      "score": 1
    },
    {
      "id": "lnseb8c",
      "body": "yeah it’s fucking annoying but i always chalk it down to the fact that they probably don’t know what to say, and also can’t be bothered to do the amount of emotional labour to really get into issues with someone or comfort them. people simply aren’t that bothered tbh unless you’re an active suicide risk, which i suppose we all are with this disease, in varying degrees. seeing people do that makes me all the more passionate and determined to comfort everyone i love, and really help them and lend a hand or shoulder or ear to people who need help, as much as i can. it’s not just “it is what it is”, and im not going to say “it will get better” cos that’s a bit of a cop out too. but even with depression, it IS worth staying alive, because if you’re alive, you can always feel happiness however fleeting. if you’re dead you won’t feel relief from life, or your suffering, you just won’t feel anything at all. i hope things look up for you soon xx",
      "created_utc": 1726690178.0,
      "score": 1
    },
    {
      "id": "lpz2ozx",
      "body": "AND my psychopath parents decided to give that \"life\" to me",
      "created_utc": 1727876220.0,
      "score": 1
    },
    {
      "id": "lx1huiq",
      "body": "Exactly, always been wanting to just tell em to stfu, if \"it is what it is\", then my answer to life is to leave. Kms. Hows that?",
      "created_utc": 1731560058.0,
      "score": 1
    },
    {
      "id": "lx2tibk",
      "body": "I’m depressed and I say “it is what it is” simply because it’s my default answer to anything bad that happens to me.",
      "created_utc": 1731588033.0,
      "score": 1
    },
    {
      "id": "md8d34m",
      "body": "I have had that said to me, so now when that person who said it to me complains, I say it right back to them. Other times I have said, \"no its my life\" which usually shuts them up.",
      "created_utc": 1739791435.0,
      "score": 1
    },
    {
      "id": "lnowv00",
      "body": "You can leave",
      "created_utc": 1726637167.0,
      "score": -2
    },
    {
      "id": "lnnzosy",
      "body": "my theory is that most people live in some sort of denial(to be fair i wish i could be capable of that) and deep down they know it and the answer \"It is what it is\" is a defence mechanism to protect their view of the world around and inside them because objective reality is a bitch to deal with. But yea hearing it just infuriates me inside but after i cool down i kinda realize its not malice. Its more like self defence. Nontheless it does not change the fact that its hard to hear it over and over.",
      "created_utc": 1726622250.0,
      "score": 48
    },
    {
      "id": "lno1xzi",
      "body": "To some people trying to understand depression is like asking them to move a mountain. They just can't do it no matter how hard they try because humans simply can't move mountains. Similarly, many / most people don't know what to offer except platitudes. They're just kind of at a loss, some people maybe don't even care. It sucks but \"it is what it is.\" Jk. For real tho most people have a diminished capacity to contend with their own issues much less someone else's. My mom's like this. I don't talk to her about my problems anymore.\n\nI hate being told \"life isn't fair.\" It isn't, but this just doesn't help. So people who say this, I'm like, yeah, I won't be coming to you for advice anymore. But also, life isn't fair. I bitched and moaned to my therapist for our entire hour the other day about this and then I was like well wtf am I gonna do, it isn't fair and I can't change it, this is bc my therapist is fantastic and bc I'm 45 years old and it's taken me a lifetime to get here. I still go on my rants. But there's a difference between knowing that on an intellectual level and having it said to you when you just lost your job or you're really short or you feel like you'll be single forever and everyone hates you and you just need a shoulder to cry on. Last time someone (my dad) dropped a platitude on me I completely lost my shit. Save that bullshit for pottery barn, I'm out.\n\nI have no advice on how to deal with unhelpful people except stop having expectations of them and remind yourself of their limits. It's all you can do for your own sanity. And find a good therapist or that one rare unicorn of a person who actually gets it. In my entire life I've known exactly three, no bullshit, that I can think of off the top of my head that I still talk to. Most people I know are like my mom – utterly clueless. What can you do. People suck.",
      "created_utc": 1726623119.0,
      "score": 24
    },
    {
      "id": "lnp0woo",
      "body": "My favorites are \"You shouldn't complain, because it could be so much worse\" and \"There are people suffering more than you\" and my favorite \"But you have nothing to complain about\".",
      "created_utc": 1726639599.0,
      "score": 9
    },
    {
      "id": "lnrm6um",
      "body": "When people say that stuff it feels like I’m denied of being frustrated at something. Life sucks but that doesn’t make the situation okay. Life sucks…but I’m still… not okay. \n\nIt’s always the adults too. Even throughout my childhood where I was supposed to be more “emotionally mature” than them by just holding it in and keeping it pushing. My parents had their own problems and probably had to give up on their dreams to survive. I recognize that I’m not trying to live like that and yet I’m somehow supposed to. It’s bullshit if they think that them standing for it means I have to. \n\nI’m not suicidal although I’ve always wondered about my death. What would it mean if I died? Life sucks because it pushed me to suicide. It also shows that constantly saying life sucks and carrying on…also doesn’t help. \n\nOr they can start out the same and then add a little more to it. “Life sucks but you’ll come out of it stronger.” It’s definitely a valuable lesson but these people also need to realize that everyday can’t be another fucking lesson for me to learn to make me tougher. If I kill myself then what would that mean? I wasn’t strong enough? That I didn’t learn a thing? I’ve been high functioning for a while now. I’m tired and if I crash hard then there’s no way I’m “weak” or “didn’t learn.” Something wasn’t giving in my life despite my efforts. That’s what it means \n\n“Life sucks” is not how it works. Life is indifferent and it feels unfair but that doesn’t mean I don’t deserve having peace of mind. Give me a fucking break. I’ve worked hard but life doesn’t owe me anything and so my efforts are invalidated. How the fuck is that okay? It isn’t.",
      "created_utc": 1726681384.0,
      "score": 6
    },
    {
      "id": "lnrqxc8",
      "body": "I especially can’t stand the people who create life, and then tell said created life that “that’s life” when things are hard. Lol",
      "created_utc": 1726682862.0,
      "score": 5
    },
    {
      "id": "lnodrbr",
      "body": "Are you taking your meds is one that riles me up and makes me dislike myself even more. My sister was on Zoloft for issues and she’s no longer on it. But she’s always there to ask if I’m taking my medicine, yeah I am and also thanks for asking how I’m doing….",
      "created_utc": 1726627848.0,
      "score": 11
    },
    {
      "id": "lnp1ygj",
      "body": "Are you taking your meds is one of the worse sentence people could told. I can barely hear these words without starting to boil. \n\nMy mother was used to tell this when I was trying to have a convo about something that upsets me in our relationship / in general. She wasn't listening and/or wasn't willing to agree, to find a compromise or just tell me her opinion on the matter.\n\nWhen I was annoyed enough, I was usually telling her what I was thinking abt her attitude, I was still calm and respectful. Until she gaslighted me asking for my meds, which makes me even more mad, yelling and leaving by slamming a door or two, this time. \n\nI'm alive for 26 and still dont know how to deal with this woman, which I hoped wasn't my mom, sorry to say. So I just don't deal with her anymore. And she doesn't ask me how I'm doing. Maybe once a month by asking my sister or my brother if they have news of me but my phone's never shows mom noti",
      "created_utc": 1726640275.0,
      "score": 8
    },
    {
      "id": "lnp6wxn",
      "body": "I hate this saying, customers regularly say it to me. I work security so even if I was a super happy person inside I can't be just stood smiling all day and dancing around. I hate people.",
      "created_utc": 1726643585.0,
      "score": 3
    },
    {
      "id": "lnrhfmk",
      "body": "You are right,  people do suck.  They pretend to be your friend then aren’t there no matter how much you do for them. In my 50s. Feel stupid for trying all these years.  I’ve heard “it could be worse” 1000 times, and what it usually means is, “shut up, I’m thinking of myself and don’t want to hear it anymore”.  If I didn’t have to work, I would never deal with people again.",
      "created_utc": 1726679895.0,
      "score": 3
    },
    {
      "id": "lnro45b",
      "body": "Feels like faking it is depended on luck and being at the right place at the right time. It’s about knowing the right people and meeting them is by coincidence and hoping they have the time of day for you. People say you have to work towards what you want but they also ignore that hidden element of life \n\nThey don’t think about people  like us where we try but it doesn’t work out. It didn’t work out. \nYeah there can be underlying reasons and self-sabotage but there are so many that have done so much right and nothing. It seems like that situation never gets mentioned even though it’s common",
      "created_utc": 1726681985.0,
      "score": 5
    },
    {
      "id": "lnrq1rn",
      "body": "I’ve got to live with it. I’m not hiding my head or explaining myself anymore. Although I’m still fearful to show up to my usual social functions because I’m so tired of the same interaction about my new haircut to those who haven’t seen it yet. \nBad haircuts suck. I’ve always been self conscious about my hair and my dreams about it haven’t been pleasant.\nIt will grow back and it is just hair but it matters alot to me so saying it’s “just hair” isn’t true from my perspective. I’m waiting for its growth and when I reflect on my past, I feel like I can comfortably say this was not a good time in my life",
      "created_utc": 1726682587.0,
      "score": 2
    },
    {
      "id": "lnqjg4u",
      "body": "[removed]",
      "created_utc": 1726669069.0,
      "score": 2
    },
    {
      "id": "m1ba445",
      "body": "It's not actually easy to attempt and carries the risk of being in a worse state: alive and a vegetable.",
      "created_utc": 1733805490.0,
      "score": 1
    },
    {
      "id": "lnofe60",
      "body": "This is absolutely true, \"sometimes it be like that,\" or \"it is what it is,\" or, \"like sucks like that sometimes,\" is absolutely a defense for the person saying it, and sometimes is misplaced as an attempt to offer the same defensive mindset to the victim",
      "created_utc": 1726628525.0,
      "score": 21
    },
    {
      "id": "lnogmst",
      "body": "its not even denial. shit just fucking sucks sometimes. sometimes all the time. \"thats life\" and \"it is what it is\" are true.  \n\nmost people have no fucking idea whats goin on. i have almost none. I just wake up and start moving and hope it works out semi ok.",
      "created_utc": 1726629059.0,
      "score": 18
    },
    {
      "id": "lpbk3e3",
      "body": "I think, most often, the underlying sentiment behind such phrases is acceptance. Life is rough man, it’s happened, all I can do is accept that fact and react accordingly. Very Rare are the Occasions when we get to act, not just react. Accept the fact that you aren’t in control of most of the things that happen to you because they *happen to you*, you don’t get to choose. You only get to choose what you do next and some random bs will come and force you to react again, over and over, and yeah things won’t ever stop happening to you but if you react right enough times or better yet have help you’ll end up ok. Luck is just coincidence and most of a happy life is just luck. \nEdit: Dear person that messaged me, sorry, I tapped hide chat and now it’s gone forever.",
      "created_utc": 1727519351.0,
      "score": 3
    },
    {
      "id": "lnvcxkb",
      "body": "[removed]",
      "created_utc": 1726737666.0,
      "score": 2
    },
    {
      "id": "lnr3vm7",
      "body": "But maybe we think the wrong way. Living the maximum time with depression and this feeling of wrongness all the time, despite all comfortably. Or living with less comfort and more happiness. By the way, there are other systems, that have the focus on community and not on money for some people who came from the right hips.",
      "created_utc": 1726675612.0,
      "score": 1
    },
    {
      "id": "lntqm7j",
      "body": "Exactly! They’re called “thought stopping cliches”. They are meant to keep you from addressing the underlying discomfort",
      "created_utc": 1726706977.0,
      "score": 5
    },
    {
      "id": "locis4j",
      "body": "Yupp. Nepotism is a real thing. Hard work doesn't pay off. You have to kiss ass and make connections. \nIt's like Peter principal. People get promoted or get jobs to the level of incompetence. Where as the actual people who study and work hard are left to fend in an already bloated market. \n\nI've been to countless jobs where mommy and daddy get their kids to work in positions that they clearly arnt qualified for, but they get the same pay, and 'experience' meanwhile honor students have to get a bachlors degree just to do data entry. \nIts pretty pathetic....",
      "created_utc": 1727004891.0,
      "score": 2
    },
    {
      "id": "lt7nkqt",
      "body": "[removed]",
      "created_utc": 1729621481.0,
      "score": 1
    },
    {
      "id": "m26xxrq",
      "body": "You know maybe nepotism isn't the correct word to describe all situations. However it does play a big part. \nIts more connections and who you know. \nCan you rub shoulders with the higher ups?\nDo they feel comfortable around you?\nTo trust you you serious company decisions, developments where serious investments are tied into said projects?\n\nIts honestly how personable you are. Being 'pretty' , sure. Being ' silver tounged ' , sure. Being a relative to a higher up, again sure.\nAll these things play a role in getting these so called sought after lucrative jobs.\nIt's just a roll of the dice, and in this case you have the ability to rig the dice.",
      "created_utc": 1734282860.0,
      "score": 1
    }
  ]
}