{
  "id": "1i9vbpt",
  "title": "I’m so tired of being just a vagina",
  "selftext": "Every conversation I have with my family is about what I am. Am I dating anyone? When will I get married? When will I have kids?  I’m so tired of it. Aren’t I more than my genitals? No one cares I’m borderline asexual. I’m sorry I’m not good enough for anyone to want to fuck me. I’m sorry I’m not pretty or smart or funny or thin. Why cant I be something else than an expectant partner or mum. I even want those things. But not right now. Why is that all you want to tell me. What if I never find someone? What if I can’t have children? Will my entire life have been wasted because no one found it worthy of their time to stick it in me? Why am I so worthless \n\nEdit: I’m 24. But I feel like I’ve been running out of time to find someone since I was 19",
  "created_utc": 1737834602.0,
  "score": 976,
  "num_comments": 115,
  "url": "https://www.reddit.com/r/depression/comments/1i9vbpt/im_so_tired_of_being_just_a_vagina/",
  "comments": [
    {
      "id": "m95a04m",
      "body": "As someone who came from one of these narcy cultures I feel you. I told them to all get fucked :)",
      "created_utc": 1737835500.0,
      "score": 302
    },
    {
      "id": "m95bpak",
      "body": "I relate to this so much. You aren’t alone.",
      "created_utc": 1737836020.0,
      "score": 75
    },
    {
      "id": "m95bzac",
      "body": "It’s literally how I feel when I’m being asked if I’m married and that I should be married and have kids. Nobody ask what I think, or what aspire me, what love, everyone is just into how my genitalia is used, if it’s used as it should (having kids). But normally these questions come from ppl who don’t have life except their genitalia (they are the one who are always nosy about who you are dating, if you are pregnant, if you have kids, why you don’t have kids) because it’s the only thing they have in life - Sex.",
      "created_utc": 1737836105.0,
      "score": 27
    },
    {
      "id": "m95e9h9",
      "body": "You know what, as someone who is 18 years old going on 19, and I know I might be rather young now but I've decided for myself that I don't want marriage or children. As a matter of fact, I've never been in a relationship, nor do I have the desire to be in one. \n\nWestern culture has always been sexist and always will be. Women will always be portrayed as the miserable single cat lady. \n\nDon't let culture make you think that you need a romantic relationship to be fulfilled and happy.\n Sometimes platonic relashionships like family, or friends, or even strangers are even stronger than romantic love. In my opinion, romantic relationships are a bit overated. \n\nThey are pushed far too often unto society, without acknowledging the beauty in other types of relationships. It's alright to be single, even for your entire life.\n If your family cannot accept that, it's fine. \n\nThey have a right to their opinion, and you have a right to yours. Your mature enough to choose what is a comfortable way of life for you, and your family cannot tell you otherwise.",
      "created_utc": 1737836803.0,
      "score": 67
    },
    {
      "id": "m95pbuo",
      "body": "Felt this!! I hate being defined by a man. I’m literally worth more than what I provide for someone or being someone’s girlfriend. I’m literally in my masters program at my dream school and my family always only asks me about my dating life or. Like with dating culture now a days honestly I’d rather be single 😭",
      "created_utc": 1737840168.0,
      "score": 21
    },
    {
      "id": "m958wz7",
      "body": "You aren’t just a vagina. You aren’t worthless. These are lies you tell yourself and believe it because someone’s behavior told it first. \n\nNo life was wasted on you. You can have dominion over your world. Read the Fifth Agreement. Like actually go to the library and read it now",
      "created_utc": 1737835168.0,
      "score": 96
    },
    {
      "id": "m95j4vh",
      "body": "You are extremely young, by the way; you just don't know it.   I've wondered about these things my whole life.  Just generations of prejudice and old fashioned thinking being passed on.   You don't see it that much with men; they can be single, childless, and it's OK; but they'd better have a good career, or they're nothing.    Makes me want to move to another planet.    I'm working on not caring about what people think, but it's so hard after a lifetime of brainwashing, and daily reminders of what we're \"supposed\" to be.",
      "created_utc": 1737838287.0,
      "score": 14
    },
    {
      "id": "m96ktbi",
      "body": "I’m 40, and a man, but I find it so fascinating that in gen z, people are like “my life is over” or “this is who I am forever” if they do t have a fully fledged family and house and permanent career by 25 years old. I keep seeing people like 19-25 post about how they don’t have anyone, and they aren’t going anywhere and basically they’re old now and things just are what they are. I mean Jesus there are people who don’t figure any of those things out until their mid 30s. I’m definitely not the same person I was at 24, or 32, or even 35.",
      "created_utc": 1737850375.0,
      "score": 15
    },
    {
      "id": "m959iao",
      "body": "You have worth. I’m sorry those people are projecting their values on you. It’s hard to ignore comments especially if coming from more than one direction & coming often. I hope your friends have similar values to you & are more supportive than your family is. Friends are the family we choose & my friends like to call us “Framily”.",
      "created_utc": 1737835349.0,
      "score": 26
    },
    {
      "id": "m95cdaf",
      "body": "Something I've realized is that if your parents ever push you to have kids, its because its inconceivable to them that the kid they made's for the purpose of spreading their genes, sole purpose is more than spreading their genes. Surround yourself with people who treat you better, good luck! You are not in the wrong",
      "created_utc": 1737836224.0,
      "score": 22
    },
    {
      "id": "m96mjlu",
      "body": "They are just soggy pieces of bread. I’m sorry OP. You aren’t worthless and your Asexuality is VALID. Tell them bitches to stop sexualizing you and that you’ll find someone when you’re ready. Set boundaries OP, it’s the only way they’ll stop. Wishing you the best 💜",
      "created_utc": 1737850957.0,
      "score": 9
    },
    {
      "id": "m959519",
      "body": "Look at like that: you're actually TOO good for someone to stick theirs inside you. You're TOO worthy to just be defined as a wife or someone who births children. I'll never understand how people are so close minded that they see women only as a wife, partner or mother. It hurts especially when it comes from family and friends, I get that. \nBut you gotta change your pov a bit. \nYou're so much more valuable on your own.",
      "created_utc": 1737835237.0,
      "score": 41
    },
    {
      "id": "m95fltc",
      "body": "It's easy to get pregnant. The challenge is finding someone worth getting pregnant for. If your family fails to recognize that, especially in this day and age of sex parasites, they need to mind their business, respectfully. ",
      "created_utc": 1737837215.0,
      "score": 14
    },
    {
      "id": "m95pozp",
      "body": "I felt super rushed into that, got married at 23 and divorced at 24. Been single ever since and if people ask me when I'll date again I just say I'm considering getting a dog instead. Or a houseplant. I'm happier on my own.",
      "created_utc": 1737840277.0,
      "score": 7
    },
    {
      "id": "m95kvkl",
      "body": "Idk where you live but moving to major cities helps. In the rural areas they are very nuclear family focused. In the cities it’s career focused. And in the cities is a higher demographic of artsy types. You’re more likely to find female friends with lives that do not revolve around you being a housewife someday.",
      "created_utc": 1737838816.0,
      "score": 4
    },
    {
      "id": "m95xjvq",
      "body": "I understand completely how you feel. As someone who had the same expectations, I was never good enough because at 59 no one wanted me. My father died telling me how I was a disappointment in every way and I could have at least married anyone in his final days to please him. I said no one wants me except abusive men I'd been with. He said it doesn't matter so long as I was married and continued his bloodline as I was only child. Try and live for yourself as you will never live up to their expectations. If you married and had kids, there would always be another unrealistic expectation. Horrible that they don't cheer on your accomplishment,  of which would be many. They should be proud of who you are and the things you have done and are doing.",
      "created_utc": 1737842701.0,
      "score": 3
    },
    {
      "id": "m95zoqu",
      "body": "You are more than the sum of your parts. You don’t need to be with someone to feel validated or to make other people happy. No matter what you do in life , always remember it’s your life, your body, and nobody else has a say in it. I believe you are good enough for anyone just the way you are.",
      "created_utc": 1737843380.0,
      "score": 3
    },
    {
      "id": "m95egw2",
      "body": "You have your own mind, your own choice to not live life to the status quo.  You can love you and do you and enjoy your life.  Often I feel like we succumb to what society expects of us and we shouldn’t do it just because they say so.  Go and enjoy being you, and fuck anyone else who says you’re wrong!!",
      "created_utc": 1737836866.0,
      "score": 3
    },
    {
      "id": "m95kyxm",
      "body": "Depression is often discontent with the present that clouds one’s ability to imagine and motivational energy to move toward change, while yearning for it, compounded by one foundational negative experience and a critical mass of similar experiences. I hope you can step back from the narrative and follow your longing, values and discretion to guide yourself toward the quality of life you deserve and can have, but I feel you and I’m sorry on behalf of life and people so far. I wish you an abundance of corrective experiences and the capacity to move yourself to situations and environments that offer them to you.",
      "created_utc": 1737838844.0,
      "score": 3
    },
    {
      "id": "m95tzmg",
      "body": "Speaking from my own experience, since I obviously don’t know your family and I therefore might be entirely wrong about it, sometimes people in my family ask these questions simply because they don’t know how else to interact with me (or my sisters). I see it as a lack of understanding of the people they are speaking to. Those kind of questions are fine if you know that it is something important to the person you are asking, but a lot of people have trouble with getting to know other people. My mother will routinely ask this stuff, but not very often about what actually is important to me. Maybe it’s a generational problem, since they were simply raised with not speaking about real stuff very often, or maybe it’s a value thing, I don’t know. But I think it’s the only type of way they can conceive making conversation, and it’s their own way of showing they are interested in you.\n\nI guess my point is, people usually have well intentions, and remembering that makes it easier to understand and accept. That said you are definitely worth any partner or whatever else you want in life, and in my opinion you should tell them it makes you uncomfortable when they ask about it, for your own sake, you don’t deserve to feel like that❤️",
      "created_utc": 1737841590.0,
      "score": 3
    },
    {
      "id": "m9611t2",
      "body": "You still have time. I only started dating back in 2016. Went through 2 relationships and plenty of hook ups, I was lucky enough in 2020 to find my current partner and father to my 2 kids. I never thought I would find someone who loves me for me, but he does. Bipolar tendencies and all.",
      "created_utc": 1737843817.0,
      "score": 3
    },
    {
      "id": "m96b2mp",
      "body": "You know that game where everyone sticks a card on their forehead that has a word on it that everyone else can see except them? And then you guess to see who can figure out their word first?\nSelf-esteem is like that, except the less secure you are on your value, the more you rely on cues from others about how good you should feel about yourself. \n\nYou don't need to look for proof of your value outside of yourself. Others will nearly always create a box around how they think of you and if you are looking to them for guidance then you will build the box that they imagined.\n\nYou are an eternal being and the creator of value, you are definitely not limited by the imagination of others. Look only to yourself to determine your value, but be honest with yourself and don't live in a delusion. Do the work and be awesome.",
      "created_utc": 1737847096.0,
      "score": 3
    },
    {
      "id": "m97leaj",
      "body": "Competitive culture is so fucking annoying and depressing. I hate it. I know we are hardwired to compete because we had to as early humans to survive. But in the modern day it plays out as competing in beauty, sports, work, school, friends, money, girlfriends, boyfriends, sex....on and on and on. It makes me want to completely drop out of society and live near no other human.",
      "created_utc": 1737863160.0,
      "score": 3
    },
    {
      "id": "m98858q",
      "body": "This is so true! Im not an adult yet but I’m graduating soon. My family and friends are telling me to date at least once (i nvr dated anyone bfore). Tbh i js wanna end it now because growing up and having children and taking care of them plus my husband+my parents at old age. What js the point of all this school if i will js grow up and become a slave and baby machine??",
      "created_utc": 1737873377.0,
      "score": 3
    },
    {
      "id": "m95jfw0",
      "body": "Are they still supporting you? It might be more of a \"when are you getting out of my house\" type thing and they think all of that is the only way. I know for the women in my family, marrying \"up\" was literally the only thing that got them out of parental support. And when I say \"up\" i mean something like the guy had a car and no one in the family did.",
      "created_utc": 1737838381.0,
      "score": 2
    },
    {
      "id": "m97dsxh",
      "body": "As someone who thought this way, and now has kids (who I love but I deeply fear for in this world) and a terrible life because of other people pushing me into this mold...\n\nTo be a \"good woman\" one has to silently bear every evil thing.\n\nIt's a worthless title.\n\nOne bestowed upon good slaves, NOT good humans who have solid boundaries and enforce them.\n\nWhat was Vashti's great sin?\nBeing a bad plaything. Being a bad ornament. Being a bad woman for saying no to an unreasonable and evil \"request\".\n\nIf you want a life of pain and misery, do what you are expected to.\n\nIf you want a life you love... Get REALLY good at seeing reality and it's possibilities for growth and change, and decide that you may not know where you're going yet, but it's going to be better than what other people chose for you EVERY time.\n\nThe life of a mother and partner COULD also come to you that way, but you'd be sensible and ensure that your needs were met. That YOUR health was prioritized, that your needs would be met in or out of that relationship, that you wouldn't be isolated or pushed into something you couldn't come back from.\n\nYOU deserve your love.\n\nFirst and foremost!\n\nWithout you learning to respect, care for, and love yourself... How will you EVER draw a line in time to save your own life (and it's quality) or your future children's?\n\nHow will you love someone without making them your foundation? A load bearing wall that if knocked free from will collapse your life and sense of self around it?\n\nHow will you stop yourself from accepting less if the bar for decency and love in your life is in hell?\n\nYou have been TAUGHT you were worthless, probably when you were too young to defend yourself.\n\nIt's time to unlearn that lesson, and anger and spite might be the only ways to keep yourself going down that path.\n\nThere are NO wrong feelings, anger isn't your enemy.\n\nIt's the part of you that still loves and cares for you. It's the part of you that spurs action and takes what it needs from life. It's the bit of ourselves that's on OUR side.\n\nDoes that need balancing? Sure!\n\nIs that going to come from fearing and ignoring it... Sadly no.\n\nSo, if you made it this far congratulations!\n\nNow ask yourself questions.\n\n*Ask why you believe this?*\n\nWho benefitted, and who currently benefits from these beliefs? \n\nWho told you you were unworthy?\n\nWho told you that your parts are the only value you have?\n\nWho communicated through their actions and words the worthlessness of your life, and what cultures and institutions backed it up?\n\nIt's time to do the hard work before you try to die and find something worse.\n\nI found something worse.\n\nI don't recommend it.",
      "created_utc": 1737860343.0,
      "score": 2
    },
    {
      "id": "m97rkp1",
      "body": "I understand you, I’m so bitter about it. \n\nI’m 29 and all anyone cares about is when I will marry and how the wedding/s will be and when I will have a child. \n\nBut I’m severely tokophobic and I don’t know if I can ever go through with it. \n\nMy bf’s mom even said she thinks we could have a beautiful life childfree travelling and enjoying our money but now people are saying she doesn’t really mean it and I will continue to be pressured into it.",
      "created_utc": 1737865619.0,
      "score": 2
    },
    {
      "id": "m98wk90",
      "body": "You say you are borderline ace. Have you looked into the ace spectrum, because it is a spectrum, and seen where you identify on there. People generally stop bothering you once you’re out, if you wish to be out. It’s up to you. X",
      "created_utc": 1737887955.0,
      "score": 2
    },
    {
      "id": "m992f9n",
      "body": "Blimey. You probably love your family and I'm sure they can't be aware of the damage they're doing...but honestly, ignore them.\nFactually, you have a good 12 - 15 years before you have to worry about whether or not you're running out of time to have lots of children. And that's even if you want them.\n\n\nHaving children can be very rewarding (I have 2 great adult kids myself) but once you've got them, you've got them. To raise them properly is demanding, time and energy consuming, and requires you to put yourself and your interests second for many years. \n\n\nThe child free years that you have are precious. You're an adult, can take care of yourself and only have yourself to think of. You have health, vitality, energy. No responsibilities apart from keeping yourself. Make the most of this stage of life; it comes only once. \n\n\nI had my children at 32 and 39. It allowed me to travel, have a career, become the person that wouldn't have regrets when I had children because I'd already done stuff, and wouldn't be waiting until I retired to do those things. (Which mostly doesn't happen, I can tell you!).\n\n\nBiologically it takes one sperm from one person to get pregnant, so don't be thinking you need a queue of men trying to get you into bed. (Trust me, you don't actually want that, for a variety of reasons too long to go into here). \n\n\nConcentrate on connection, with life, with yourself, and others. Rewarding connections where you feel authentically \"you' and engaged with the many vibrant options life has to offer. That'll take you most of your 20's. And then just let things pan out. \n\n\nIn the mean time, watch those around you who feel a societal pressure to pair bond and produce offspring in their early 20s fall apart by their 30s and become single parents. Use them as examples to your parents of your considered wisdom in waiting for a few more years. You're in the best stage of your life - single and free. Enjoy it. ",
      "created_utc": 1737891435.0,
      "score": 2
    },
    {
      "id": "m99m4fq",
      "body": "I’m 27 and same. But I’ve reached the conclusion that I create my own worth. So I’m committing to working on things I feel I need to work on, and becoming disciplined in my own life. Bettering myself, and whatever anyone thinks of me (whether I should be married/have kids etc) is just another opinion. I will get married/have kids in my own time, first I need to actually live a life that feels worth living for me!!",
      "created_utc": 1737900452.0,
      "score": 2
    },
    {
      "id": "m962o3r",
      "body": "You are not out of time.  40 is out of time for kids.  There is no out of time for marriage.",
      "created_utc": 1737844338.0,
      "score": 2
    },
    {
      "id": "m967tev",
      "body": "You say you’re not pretty or smart or funny or thin. You’re just accepting the current version of yourself as if it’s all you will/can be.  Change the way you speak about yourself, work hard and what you are will change.",
      "created_utc": 1737846019.0,
      "score": 2
    },
    {
      "id": "m96i17p",
      "body": "Putting it in such a coarse way doesn’t make what you’re thinking anymore true. It says more about you that solely associate such questions with your ‘genitals’. Should people who are in relationships or have kids reduce themselves to just genitals? So why are you deciding that is the perception of others ?? \n\nIt’s likely people hope you find someone / are looking to have kids bc they assume it will turn the tides of your misery.",
      "created_utc": 1737849441.0,
      "score": 1
    },
    {
      "id": "m96xdtx",
      "body": "Something that helps me when this happen is to remind myself that they’re talking from their own fears. They are concerned about that because for them being without a couple sounds very scary, maybe they can’t stay alone. So I just think “poor people, they’re scared” and let it go.",
      "created_utc": 1737854600.0,
      "score": 1
    },
    {
      "id": "m986ezi",
      "body": "Checkout the childfree reddits and similar it will open your world to a whole different community",
      "created_utc": 1737872477.0,
      "score": 1
    },
    {
      "id": "m98laqe",
      "body": "Dating relationships \n\nhttps://www.reddit.com/r/depression/s/N3e8cnn5UI\n\nThe situation is you wish to be with someone\n\nThe only issue is your family is creating a bad environment that harms your self worth based on being attached to a man\n\nAnd ironically it actually makes it harder because their insistence makes it mean you should settle for anyone as long as it’s a man\n\nU have standards respect those standards\n\nYour time will come just make a mental note of your age each year for yourself and yourself only\n\nYes it gets harder as you get older\n\nBut it’s also not wrong and it may be the right person that you want to settle for later on\n\nBeing a single person for life is not the answer either\n\nNeither is all this self improvement talk as it only helps for awhile and it will work for you if you decide being for life becomes a decision\n\nLove does not choose a time or place , it will happen when you meet more people\n\nWhen you are more mentally mature\n\nWhen you make a decision on someone and love will happen\n\nI know you should do self improvement to take yourself seriously and be a better person … but u can see some relationships Dont need all of this being so improved\n\nIt’s timing and meeting the right person and you will know\n\nI felt it before and it will happen\n\nKeep channeling into improving yourself anyways and be mindful that if you were to be single for life it could happen\n\nBut be open to the possibility of a relationship and with a man that will care for you and love you\n\nThat man may not look or seem extraordinary but he may also be the right person\n\nLook for qualities in that person\n\nAnd if he is smart , handsome , wealthy and athletic or musically talented… even better but that is a bonus",
      "created_utc": 1737881086.0,
      "score": 1
    },
    {
      "id": "m98n1v0",
      "body": "Girl, I completely get you. I also hate this. I hate that I am a woman. You put it into words perfectly. Wish I could hug you so I am sending you at least a virtual hug.",
      "created_utc": 1737882156.0,
      "score": 1
    },
    {
      "id": "m98x53l",
      "body": "Never had anything even close to a girlfriend.\nFamily is hard. I can't really help you with that. Just stay strong 💪 You live your life. You owe them nothing.",
      "created_utc": 1737888307.0,
      "score": 1
    },
    {
      "id": "m994fzc",
      "body": "24? you are so young. Take care of yourself first. I avoid the toxic people.",
      "created_utc": 1737892584.0,
      "score": 1
    },
    {
      "id": "m994ohz",
      "body": "Should straight-up get with another Ace person and just tell them you're working on it, and it'll happen when it happens. Then once your older say you tried but you're too old now. OR you and your Ace partner could lie about being infertal.",
      "created_utc": 1737892715.0,
      "score": 1
    },
    {
      "id": "m99jotn",
      "body": "I'm sorry that's how your family treats you, though slightly different I also struggle with a family trying to put me into a box, In that sense I can relate you.\n\nYou are not what other people want you to be, you are simply who you are and you are enough.",
      "created_utc": 1737899534.0,
      "score": 1
    },
    {
      "id": "m99lb8a",
      "body": "Yeahhh nobody should be getting married before 30 lol these people you're surrounded by aren't smart and they expect you to be as dumb as them.  It's your life, not theirs.  These breeder cultures want you to think you need to start a family immediately so you can get locked into a situation you don't know how to deal with.",
      "created_utc": 1737900151.0,
      "score": 1
    },
    {
      "id": "m9bid3f",
      "body": "I'm old now but I enjoyed replying to the idiots with epic sarcasm.  I remember not being asked those stupid question afterwards. I miss those days.",
      "created_utc": 1737920648.0,
      "score": 1
    },
    {
      "id": "m9eeqjx",
      "body": "Ahem. I am also 24 my dear and guess what!??\n\nThat is PLENTY of time. \nYou can still become married in the next upcoming years. You never know what time your true spouse will arrive. If you’re still concerned about children… freeze your eggs or plan a surrogate birth. \n\nIf that’s what you want for yourself. \n\nI’m dating more seriously now but I’m not rushing bc I don’t want any kids. And I’m too focused on my mental health to focus on a partner first.\n\nF*ck it if they’re complaining. You certainly  got time!! 24 is YOUNG! You’re not 40 yet and many women get married then too. \n  \ncheer up pal! Good job keeping alive🤗",
      "created_utc": 1737951722.0,
      "score": 1
    },
    {
      "id": "m9enz1l",
      "body": "You have worth by the fact that you're a human being whether someone fucks you or not ",
      "created_utc": 1737955722.0,
      "score": 1
    },
    {
      "id": "m9eoh8r",
      "body": "You introject your family's expectations and internalise them and then you feel you have to fulfill them which makes you berate yourself and you think it is yourself that's doing the thinking but it's not its the family script you're trying to live which won't lead to what you're looking for",
      "created_utc": 1737955964.0,
      "score": 1
    },
    {
      "id": "m9eorlf",
      "body": "The vagina is connected to a face behind the face is a soul.This comment won't be responded to",
      "created_utc": 1737956105.0,
      "score": 1
    },
    {
      "id": "m9g1kh9",
      "body": "31, no vagina and I still don't hear the end of it about marriage, kids, family. There's no escape from the expectations of others",
      "created_utc": 1737983063.0,
      "score": 1
    },
    {
      "id": "m9g3e02",
      "body": "Lol I know what you mean. I always think there is more to life. Ask me other questions. Ask me about stuff I'm actually doing. Only asking about relationships and when I'm gonna have a baby I find so rude. I'm a guy and this happens too lol",
      "created_utc": 1737983785.0,
      "score": 1
    },
    {
      "id": "m9tg13q",
      "body": "I'm almost 29 and I'm asexual, you're not alone ",
      "created_utc": 1738156978.0,
      "score": 1
    },
    {
      "id": "mbvlao1",
      "body": "Are you ok now?",
      "created_utc": 1739125402.0,
      "score": 1
    },
    {
      "id": "mqumstd",
      "body": "lil late but  You’re you, your own person     Don’t be defined by stupid shit your family forces on you, do your own thing! Actually, if you’ll bear with the opinion of this retarded 14yo, having children only brings more suffering people into this hell, so don’t have kids",
      "created_utc": 1746518612.0,
      "score": 1
    },
    {
      "id": "m95fvng",
      "body": "yeah, as a transmasc i definitely deal with this a lot. i hate being seen as just my genitalia, but even my gender nonconformity makes me a sex object too so i kinda just fucked myself over either way. ",
      "created_utc": 1737837299.0,
      "score": -3
    },
    {
      "id": "m95kdfu",
      "body": "Umm, it’s just a thought, but it kinda indicates how you look at yourself.\n\nRelationships, marriage, is not just about sex.\n\nWould recommend you healing your wounds, so you start seeing things from a different perspective.",
      "created_utc": 1737838664.0,
      "score": -5
    },
    {
      "id": "m96d13h",
      "body": "You can do a bottom surgery and place a stop sign to their inquiries😉",
      "created_utc": 1737847753.0,
      "score": -2
    },
    {
      "id": "m96w45r",
      "body": "Just start telling them you’re gay. That’s something they should understand.",
      "created_utc": 1737854164.0,
      "score": -2
    },
    {
      "id": "m96objs",
      "body": "Are you literally a anthropomorphized vagina like a sports mascot vagina with arms and legs",
      "created_utc": 1737851552.0,
      "score": -4
    },
    {
      "id": "m95d6f5",
      "body": "Ngl I thought you were trolling",
      "created_utc": 1737836469.0,
      "score": -9
    },
    {
      "id": "m95s0fa",
      "body": "I wish someone noticed I have a penis or anything else about me for that matter. Just be glad someone is interested in you at all. Some here don’t even have people to annoy us.",
      "created_utc": 1737840985.0,
      "score": -5
    },
    {
      "id": "m95r14s",
      "body": "Yes I hear you, I'm tired of being a wallet/atm",
      "created_utc": 1737840682.0,
      "score": -10
    },
    {
      "id": "m95dcij",
      "body": "You're not just a vagina... you also have a mouth (I'm joking, I hope this comes off as funny as it was to me, and not offensive) edit: thank you for the downvotes. Negative attention is still attention. I appreciate it ❤️",
      "created_utc": 1737836522.0,
      "score": -12
    },
    {
      "id": "m95iyk5",
      "body": "Did they get fucked yet?",
      "created_utc": 1737838235.0,
      "score": 57
    },
    {
      "id": "m95ep54",
      "body": "See, I even want those things. I’d love to have a partner. I’d love to be a mother some day. But not right now. And what if no one ever finds me worthy to be theirs. It’ll probably happen that way. So will my whole life be wasted? What will I be",
      "created_utc": 1737836937.0,
      "score": 22
    },
    {
      "id": "mb5iqps",
      "body": "Hope this is not intrusive for me to say, but i saw your  post on the Menendez brothers about the mike and now this post about relationships and can i just say you sound remarkably insightful and wise and you re only 18.",
      "created_utc": 1738781742.0,
      "score": 2
    },
    {
      "id": "m97nk39",
      "body": "That's extremely irritating to be reduced to a measurement of your dating potential. Especially when you've achieved so much in your life that is worthy of praise and celebration. I cannot even imagine trying to date in today's world. I doubt very much that I would have found anyone.  I feel bad for my kids who are beginning to enter this phase. God help them!",
      "created_utc": 1737863993.0,
      "score": 3
    },
    {
      "id": "m95uqkg",
      "body": "The five agreements?",
      "created_utc": 1737841822.0,
      "score": 7
    },
    {
      "id": "m9a6wy2",
      "body": "Is the fifth agreement a book or a list of agreements and to read the 5th out of them??",
      "created_utc": 1737907209.0,
      "score": 1
    },
    {
      "id": "m97n06a",
      "body": "It's difficult to ignore what others think because of how our brains evolved to be social in order to assimilate and cooperate to survive. But I do feel we can learn how not to keep internalizing what people think of us. Question it, and reject it if it serves no purpose other than shallow competitiveness, or listen to it if it comes from a trusted, genuine person who cares about you.",
      "created_utc": 1737863779.0,
      "score": 2
    },
    {
      "id": "m971fq2",
      "body": "The curse of comparison. Social media has made it a lot easier. People's carefully curated profiles are often far from reality; just a facade. Overcompensating, to assuage their fears that maybe they don't actually have their shit together. Does anyone? The goalpost will continue shifting.",
      "created_utc": 1737856006.0,
      "score": 12
    },
    {
      "id": "m9ared7",
      "body": "Agree. I’m amazed to read people think their lives are over if they haven’t done everything by age 25. My generation didn’t get married until age 30 and started having kids at age 32. This was a sahm who did competitive mothering (took her kids to farms on their rare days off). I knew of a guy who waited until age 37 to have kids. The negativity today is unreal.",
      "created_utc": 1737913127.0,
      "score": 1
    },
    {
      "id": "m98bmm6",
      "body": "Good for you!  Honesty is so rare.  Millions have fallen into this trap, just from being so young, impressionable, and naive.   Good that you got out of it young, instead of wasting decades being miserable.",
      "created_utc": 1737875315.0,
      "score": 2
    },
    {
      "id": "m994fyi",
      "body": "Awful thing for your father to say. One might reasonably ask if having children to carry on his \"bloodline\" were so important, why he himself didn't have more? \n\n\nForgive me if I go too far, but I think these are the words of an unhappy and embittered man who came to the end of his life and felt he had little to live on after him; that he hadn't left a footprint in the sands of time. That has nothing to do with you but quite a lot to do with him. (One wonders if your relationship with your father has also somehow influenced the propensity for relationships with abusive men).\n\n\nEither way, life is short. Enjoy what you have now and absolutely be proud of what you've achieved with seemingly so little acceptance or support. 👏 ",
      "created_utc": 1737892583.0,
      "score": 3
    },
    {
      "id": "m98czht",
      "body": "Parental training and education should be a requirement before anyone has a child.  Maybe they'd be more able to actually love their child, and less likely to hurt and judge their child, their whole life,  based on their own selfishness,",
      "created_utc": 1737876105.0,
      "score": 2
    },
    {
      "id": "m98emos",
      "body": "Being a senior in high school is scary - the whole world and your whole life is out there &  no experience with how to handle it all.  Enjoy your youth; try not to worry about your future - you will handle it when it comes along, and there are good things to be had in life, as well as the responsibilities.",
      "created_utc": 1737877073.0,
      "score": 2
    },
    {
      "id": "m95oumh",
      "body": "It’s mores so my extended family that ask about it. My nuclear family clearly wants me to be a wife or mother but they’re ok about talking to me about it.",
      "created_utc": 1737840023.0,
      "score": 1
    },
    {
      "id": "m98dycd",
      "body": "How would she know what would make anybody happy?  She's not even sure what would make herself happy.  Just one of the many insecure sheep who needs to concentrate on her own problems.   What's tokophobic?",
      "created_utc": 1737876675.0,
      "score": 1
    },
    {
      "id": "m98cous",
      "body": "It’s not like I don’t want it someday. Just not now. I don’t know why it’s the only thing I’m good for in their eyes.",
      "created_utc": 1737875931.0,
      "score": 1
    },
    {
      "id": "m95e6x7",
      "body": "No. I’m just sad",
      "created_utc": 1737836781.0,
      "score": 5
    },
    {
      "id": "m95hl4t",
      "body": "Yo stfu and be considered man",
      "created_utc": 1737837818.0,
      "score": 4
    },
    {
      "id": "m95ee1e",
      "body": "I think my family would rather keep the genitals and forget the mouth if they had a choice hahaha. I get told all the time how much I talk. How I should just shut up more often",
      "created_utc": 1737836842.0,
      "score": 6
    },
    {
      "id": "m95hx5f",
      "body": "Please don't say things that you know can be interpreted wrongly especially to someone going through smth, even if you think its funny you don't know the situation they're in and how they'll receive it",
      "created_utc": 1737837917.0,
      "score": 3
    },
    {
      "id": "m95n9od",
      "body": "Yes indeed, no one messes with me anymore and if they do they know what time it is. You gotta become the beast to slay the beast sometimes. Even if it means losing relationships. A few others ended up respecting me more after calling their bluff. A lot of people in this world are just on an ego trip trying to impose their will onto others and it’s pathetic.",
      "created_utc": 1737839546.0,
      "score": 67
    },
    {
      "id": "m95h4iu",
      "body": "You will be your own person. You will be what you want to be, versus the sexist expectations of our western world.",
      "created_utc": 1737837678.0,
      "score": 21
    },
    {
      "id": "m95ifmp",
      "body": "Your worth is not determined by if you're with someone. Please try to look into this thought process you have and why you have it and how to make it better. You're still a person of your own you're not worthless or worth less just bc you're not with someone or don't have kids",
      "created_utc": 1737838074.0,
      "score": 15
    },
    {
      "id": "m98l3fw",
      "body": "The situation is you wish to be with someone\n\nThe only issue is your family is creating a bad environment that harms your self worth based on being attached to a man\n\nAnd ironically it actually makes it harder because their insistence makes it mean you should settle for anyone as long as it’s a man \n\nU have standards respect those standards \n\nYour time will come just make a mental note of your age each year for yourself and yourself only \n\nYes it gets harder as you get older\n\nBut it’s also not wrong and it may be the right person that you want to settle for later on \n\nBeing a single person for life is not the answer either \n\nNeither is all this self improvement talk as it only helps for awhile and it will work for you if you decide being for life becomes a decision \n\nLove does not choose a time or place , it will happen when you meet more people\n\nWhen you are more mentally mature \n\nWhen you make a decision on someone and love will happen \n\nI know you should do self improvement to take yourself seriously and be a better person … but u can see some relationships Dont need all of this being so improved \n\nIt’s timing and meeting the right person and you will know \n\nI felt it before and it will happen \n\nKeep channeling into improving yourself anyways and be mindful that if you were to be single for life it could happen \n\n\nBut be open to the possibility of a relationship and with a man that will care for you and love you\n\nThat man may not look or seem extraordinary but he may also be the right person \n\nLook for qualities in that person \n\nAnd if he is smart , handsome , wealthy and athletic or musically talented… even better but that is a bonus",
      "created_utc": 1737880963.0,
      "score": 4
    },
    {
      "id": "mb5j0o8",
      "body": "Oh thank you😂😭, I still got a lot to learn though. Just trying to spread some kindness in our current society full of social media overload lol",
      "created_utc": 1738781817.0,
      "score": 1
    },
    {
      "id": "m960u20",
      "body": "The Fifth agreement.",
      "created_utc": 1737843748.0,
      "score": 5
    },
    {
      "id": "m9ac2d6",
      "body": "It’s a book lol, sorry I should have explained a little more",
      "created_utc": 1737908722.0,
      "score": 2
    },
    {
      "id": "m97omwv",
      "body": "God, it's awful. Trying to compete with idealized, very often filtered beauty perfection on social media. It leads to a lot of mental health problems, mainly for women and girls but I feel it's also becoming much more of an issue for males, too. When I get caught in that trap, I try to look around me at all of the overwhelming number of people, just like me, nothing particularly special, going about their lives the best they can. Some of them even look quite happy and content! Who knew?",
      "created_utc": 1737864415.0,
      "score": 5
    },
    {
      "id": "m971lbk",
      "body": "People should get off social media as much as possible, and definitely not use it to measure their lives against others. It’s such a shitty rabbit hole to go down.",
      "created_utc": 1737856060.0,
      "score": 5
    },
    {
      "id": "m9e0o2h",
      "body": "Thank you. Your words made me like myself a little more today.",
      "created_utc": 1737946708.0,
      "score": 2
    },
    {
      "id": "m96mwrh",
      "body": "either way it's messed up. my mom really wanted to be a grandma and would throw ridiculous temper tantrums over it.",
      "created_utc": 1737851080.0,
      "score": 3
    },
    {
      "id": "m95hnax",
      "body": "You get to be sad and express yourself don't worry ",
      "created_utc": 1737837836.0,
      "score": 3
    },
    {
      "id": "m95hsgc",
      "body": "No you should keep talking bc you deserve to be heard",
      "created_utc": 1737837879.0,
      "score": 7
    },
    {
      "id": "m9bpil5",
      "body": "You’re not wrong there, friend. Learning to stand up for myself against other people’s bullshit was the hardest thing for me to learn, but when I finally did learn, people began to back off. I lost a lot of friendships and stuff that way, but that’s was because they were just showing their true colors finally. It’s worth it to weed out the fake friends and find out who your real ones are. Sometimes people need to be humbled, even if it isn’t always pretty how it happens.",
      "created_utc": 1737922689.0,
      "score": 3
    },
    {
      "id": "m973jfa",
      "body": "Oh right, sorry mixing them up 🤣",
      "created_utc": 1737856727.0,
      "score": 2
    },
    {
      "id": "m98b39l",
      "body": "I do that, too.  In real life, the only ones leading these exciting lives are teenager-cheerleader types in high school.  Just wishful thinking for the wanna-be's and pretentious types.",
      "created_utc": 1737875009.0,
      "score": 3
    }
  ]
}