{
  "id": "1g9mnuy",
  "title": "Everyone says if you're depressed, don't be afraid to reach out and ask for support...",
  "selftext": "Well, we try to. And guess what? No one cares. Everyone is busy with their own lives and problems. They don't want to hear about how you're severely depressed and think about killing yourself every day. It makes them uncomfortable. So in your hopes to receive some sort of support or connection, you just end up pushing people away, which makes you even more isolated and depressed. That is all. ",
  "created_utc": 1729615287.0,
  "score": 1386,
  "num_comments": 282,
  "url": "https://www.reddit.com/r/depression/comments/1g9mnuy/everyone_says_if_youre_depressed_dont_be_afraid/",
  "comments": [
    {
      "id": "lt78p7u",
      "body": "Thing is, even if someone did care, I do not want to dump my issues onto someone and be even more of a burden, I literally won't do it. If they care it's because they love me, and if they love me, I won't make them experience the thoughts that torment my head everyday. I'd rather deal with it all on my own, no one deserves to feel what I feel, it's hellish.",
      "created_utc": 1729616873.0,
      "score": 241
    },
    {
      "id": "lt76qo4",
      "body": "[removed]",
      "created_utc": 1729616267.0,
      "score": 430
    },
    {
      "id": "lt7i1ir",
      "body": "It's not that they don't care, it's that they logistically cannot help. Many of us have problems in our lives that no one can possibly fix. Problems with our finances, our personal lives, our minds, problems with our bodies that no human being can possibly cure, only things they can offer an apology for. Even winning the lottery won't fix your fucked up mental state if that's what you're in. Telling someone to go ask for help is like saying to beg a tree for fruit. It's not going to change anything. ",
      "created_utc": 1729619756.0,
      "score": 117
    },
    {
      "id": "lt7iq5t",
      "body": "This is true. Unconditional support & love is extremely rare.",
      "created_utc": 1729619965.0,
      "score": 52
    },
    {
      "id": "lt8ya4v",
      "body": "The only people I’ve ever met who gave a fuck about my mental health were the ones who also gravely struggled. I think compassion manifests in people who understand human suffering and want to alleviate themselves and others from that pain. For example, I feel so sad reading everyone’s replies to this thread. I made sure to read every single comment. I wish I could hug every person here and tell them they are loved and important. The reality is I don’t have the mental capacity to even reassure myself most days..",
      "created_utc": 1729636069.0,
      "score": 50
    },
    {
      "id": "lt7mvwr",
      "body": "Sometimes I prefer reaching out to strangers than people I know",
      "created_utc": 1729621264.0,
      "score": 41
    },
    {
      "id": "lt7sgwo",
      "body": "Exactly, NO ONE CARES ENOUGH. And it makes them uncomfortable to deal with such raw feelings so they rather say something like, \"don't be selfish, suicide is stupid. people have it much worse, at least be happy with what you have\".",
      "created_utc": 1729622999.0,
      "score": 29
    },
    {
      "id": "lt91thk",
      "body": "Christians have a special copout where they can just say \" I'll pray for you...\" Instead of anything that involves any effort.",
      "created_utc": 1729637304.0,
      "score": 28
    },
    {
      "id": "lt73xu1",
      "body": "How are you?",
      "created_utc": 1729615422.0,
      "score": 20
    },
    {
      "id": "lt7vrz5",
      "body": "One of the many reasons I hate people. ",
      "created_utc": 1729624027.0,
      "score": 20
    },
    {
      "id": "lt8bb0e",
      "body": "I'm going through this right now. All but one of my friends have totally abandoned me after I was honest and reached out to them over the last 18 months due to being so quiet and withdrawn - and the only one that didn't abandon me literally works in psychology and mental health support, so understands the subtext of what I'm trying to communicate by reaching out.\n\nI was so quiet for so long that one or two friends reached out to ME, and months later they're like \"sorry for being selfish but I need a break\". I wish I'd made up some excuse about being ill in some other way.\n\nIt's the absolute worst advice to reach out to friends about it, they're just not equipped to handle it, and they think you're reaching out to them for their support (when in reality you just want them to know, to understand, and to apologise for your absence). Reach out to parents, family, and seek therapy. But unless you have a friend who is knowledgeable, leave other friends out of it. Just tell them that you've got a vague illness and apologise for your absence. Don't tell them you have a mental illness, it's an invisible scary taboo condition and the fear it instills in others will ruin your relationships.\n\nI never wanted to tell my friends about it, I never wanted to trouble them or be a burden. Now I'm being shut out by them and I feel the exact thing I feared in the first place. Being a burden.\n\nTalk to family. Talk to a therapist. Talk to others on here. But leave your friends out.\n\nOP, I hope you feel better soon. I am struggling, and losing almost all my friends has been the cherry on top. Depression has ruined my life. I just want my friends back.",
      "created_utc": 1729628777.0,
      "score": 18
    },
    {
      "id": "lt7pnbx",
      "body": "They mean reach out to anyone but them.",
      "created_utc": 1729622127.0,
      "score": 17
    },
    {
      "id": "lt7mg2b",
      "body": "This is why I have such a \"giving up\" attitude in my life.  What's the point of reaching out to others if they can't be \"bothered\" by our personal problems?  I often get told to not give up and that \"help\" is out there.  I just sigh and roll my eyes at such remarks.  If things were that easy, my life would be much better today.\n\nIn my case, I suffer from nostalgic depression, which means I repeatedly wish I could go back to my childhood and feel severely miserable because it's not possible (unless someone invents a time machine).  My childhood was back during the 1980s, and, although some things were not pleasant, most of the time, my life back then was much happier than my current \"existence\" (if I can even call it that).\n\nOne thing I'm unable to do, no matter how miserable my life is, is take my own life.  I often threaten to do that when I have really bad days, but the thought of ending my life is too terrible and terrifying for me to go through with it.  Death is my number one worst fear, and I fear many things.  So, suicide is out for me.  All I can do is complain about my miserable life and keep wishing I could go back to my childhood.",
      "created_utc": 1729621125.0,
      "score": 35
    },
    {
      "id": "lt8xnhv",
      "body": "[deleted]",
      "created_utc": 1729635848.0,
      "score": 30
    },
    {
      "id": "lt8b1ha",
      "body": "Truth it, only we can help ourselves, even if we don't know how, but only we can change something, and yeah, no one cares about our problems",
      "created_utc": 1729628698.0,
      "score": 11
    },
    {
      "id": "lt9bdhs",
      "body": "I feel the same way. It’s a load of horse 💩. And therapists? Yea they can help, but at the end of the day they’re only talking with you because they get paid to.",
      "created_utc": 1729640637.0,
      "score": 11
    },
    {
      "id": "lt7puvh",
      "body": "This is why I stopped talking to my Mom or My Brothers and I have constant trust issues talking about myself. .because as a Black Person I basically can't be depressed by anything if we have a roof over our head! or even mentioned being beat as punishment might be linked to depression or my attitude problem!. but yeah.  .Im trying to open up more.  to new people but its really really hard to. I losted the closest Friend I ever had  and trusted almost 3 years ago I haven't recovered from it fully still.  but I'm struggling to just open up atm.",
      "created_utc": 1729622191.0,
      "score": 8
    },
    {
      "id": "lt93ekp",
      "body": "Yup. I find those awareness campaigns such bullshit. “If they would’ve only known” “they would’ve done anything to help you” when your already dead",
      "created_utc": 1729637857.0,
      "score": 9
    },
    {
      "id": "lt8i02x",
      "body": "I kept it as much to myself to not bother other people. When my life fell apart because of external reasons, I received little to no help, and even had my brothers plainly state that it's my problem.",
      "created_utc": 1729630766.0,
      "score": 7
    },
    {
      "id": "lt7h7qx",
      "body": "[removed]",
      "created_utc": 1729619504.0,
      "score": 22
    },
    {
      "id": "lt8ihtv",
      "body": "Thanks for posting this and all you real ones who know what's up. Noone gives a flying fuck about your mental health. I have been struggling with major chronic depression for over 45 years, and am high functioning even though my entire life is 24/7 \"ideation.\" The very moment you even HINT at being sad and lonely (let alone the actual D word (depression)), EVERYONE in my life has dropped me so fast. So even though I'm articulate, not ugly, and extremely kind and empathetic, I have ZERO deep friends because I know how the jig goes. The only reason I have ANY acquaintances at all is because I moved to a new town where nobody knows the real depressed, \"ideation\" me and I can get away with my thinly veiled depression with my charm, wit, and friendliness. But inside I don't want to be here and I know even FEELING depressed is a burden that NOBODY wants to bear. And I get it. I fucking hate myself and my life, so why would anyone else want to accept me for who I really am inside?",
      "created_utc": 1729630910.0,
      "score": 7
    },
    {
      "id": "lt7r5c4",
      "body": "Yeah telling your problems/seeking support is pushing ppl away sadly, so be mindful from who u trying to get support lol",
      "created_utc": 1729622589.0,
      "score": 6
    },
    {
      "id": "lt86o7p",
      "body": "\"I hyperventilate\n\nLooking for help somehow, somewhere\n\nAnd no one cares\n\n\nI'm my own worst enemy\"",
      "created_utc": 1729627372.0,
      "score": 7
    },
    {
      "id": "lt8ijxf",
      "body": "[deleted]",
      "created_utc": 1729630928.0,
      "score": 6
    },
    {
      "id": "lt923m3",
      "body": "I’m fortunate to have people who do care; HOWEVER, it’s not going to cure my depression.  Life isn’t a Disney film—love isn’t going to fix the fact that I don’t produce enough serotonin.",
      "created_utc": 1729637404.0,
      "score": 6
    },
    {
      "id": "lt7ojow",
      "body": "This always kinda bothered me too.. and usually the people who say this the most to me, are people who I can’t even get a hold of when I need them the most.",
      "created_utc": 1729621784.0,
      "score": 5
    },
    {
      "id": "ltb225s",
      "body": "Expect nothing and you will never be disappointed, except apply this to everything else too.",
      "created_utc": 1729668066.0,
      "score": 4
    },
    {
      "id": "lt89aar",
      "body": "my close circle never supports me. My family and my friends all think that either it's made up or talks to me like I'm just lazy and that I don't try. I've been depressed for the last 2 years for some reasons. Got diagnosed with major depression a year ago. \nI was a good student, went to gym regularly before that. Made time to socialize and all these things. Now that I'm not able to do these things like I used to, I'm labelled as lazy. I question myself all the time. I never workout anymore and my academic life is at its worst. I always try to figure out if I've been stupid this whole time and never noticed. I don't even now if I'm lazy or not. I'm trying to make things work but I can't live normally like I used to. I've been taking my meds and eating healthy for the last 2 months. I still don't have any energy. I wish my family or some of my friends understood me and supported me it feels lonelier than ever",
      "created_utc": 1729628171.0,
      "score": 4
    },
    {
      "id": "ltab2k1",
      "body": "And when it ends badly, the “loved ones” all say “why didn’t they tell us they were struggling?”\nGuess what buttercup, we did, you got uncomfortable and refused to listen further and this was the result. It infuriates me that they can be so selfish until it ends badly for the person that tried to reach out to them for support. It’s sad and makes me feel like It’s a “dammed if ya do, dammed if ya don’t” situation with letting people know about our depression and/or other mental health struggles. Where’s the compassion when it’s the most imperative?",
      "created_utc": 1729653547.0,
      "score": 4
    },
    {
      "id": "ltc01dc",
      "body": "Yeah, as pessimist as this may sound, but most of the time, our situation will never change.. well, it will change but not for the better but just getting worse each day.\n\nI'm getting distant to all my \"closed\" friends because I have nothing else to talk about but my same shitty life and how depressed I am and can't get myself better. I mean, if this is all I ever gonna be, crying and crying and crying.. soon, they would just get sick and tired of seeing and hearing the same thing over again and again.\n\nI have miserable life. I want to unalive myself but I'm just too coward. I just wish to sleep and never wake up.  I want this suffering to end.",
      "created_utc": 1729687494.0,
      "score": 4
    },
    {
      "id": "ltd8mt6",
      "body": "The world is a cold, dark place plastered with lights and fake smiles. Empathy and compassion are the scarcest commodity on this depraved planet.",
      "created_utc": 1729702037.0,
      "score": 4
    },
    {
      "id": "lt7w6d0",
      "body": "support is like dating.. you want it from the persons who dont want you or have the time for you, and anyone who also gives support isnt at the quality, expertise or level you want or need. in general no one cares cause they got their own sinking ship they're dealing with, its hard to find that 'match' that works for you, hang in there. sometimes just need a diff perspective. still doesnt fix it though..",
      "created_utc": 1729624155.0,
      "score": 7
    },
    {
      "id": "lt7b9mp",
      "body": "I get it but I also have had the experience where, people did care, it’s just that it makes them uncomfortable. Not everybody can take that burden, that’s why professionals exist…\n\nIt’s fine to talk to someone when you need a little lift, but sometimes it can get overwhelming for them in their life, doesn’t mean they don’t care, or that you should stop talking altogether. \n\nFind the right people for you, and also understand that you can listen to yourself too. As crazy as it might sound, you can also be there for yourself. \n\nHow you may ask? \n- Record yourself like you would be taking to a friend\n- Journal or write your feelings down\n-Paint whatever you are feeling (ugly or bad, you just need to get the red and black out of your head.)\n- Cry, scream, walk, \n- Sing it! And loud! As loud as you can. \n\nPeople are scared of what they don’t understand, you included. As much as your feelings scare you, they can scare other people off. It’s okay, forgive them. But forgive yourself too for needing it. \n\nAnd reach out for professional help, these people are paid to care. As much as it may sound depressing, they chose to be there and to help people like you. \n\nAnd they do care. Maybe not the way you want them to, but maybe the way you need. \n\nAnyway! Good luck!",
      "created_utc": 1729617670.0,
      "score": 8
    },
    {
      "id": "lt8nkai",
      "body": "Yep basically my experience over the past week. I tried reaching out to anyone who would care including my mom and no one wants to deal with it. It’s too much. Then you feel like you’re too much and past the point of help. God damn for trying to wanting to be better. Here for you. I know how it feels.",
      "created_utc": 1729632484.0,
      "score": 3
    },
    {
      "id": "lt8yxj3",
      "body": "This is true. No one really cares, they have their own problems, and you’re going to be looked at as weird for going public with your true feelings",
      "created_utc": 1729636295.0,
      "score": 3
    },
    {
      "id": "lt92lxn",
      "body": "It does suck. I have absolutely no one. But I also kinda get it. These days, it seems like everyone is depressed AF and doing everything they can to stay afloat. Rough times. They probably don't wanna hear about our shit because they can barely deal with their own. \n\nAt least, that's how I am. If someone came to me - I am down to be as supportive as I can, but wtf am I supposed to say? I'm in the exact same boat, ya know?",
      "created_utc": 1729637580.0,
      "score": 3
    },
    {
      "id": "lt93zue",
      "body": "Going thru this exact thing right now!",
      "created_utc": 1729638064.0,
      "score": 3
    },
    {
      "id": "lt95ysh",
      "body": "I’ve been in two whole relationships including my current one and they aren’t really equipped to handle it. I have to sugarcoat how I feel it they will get overwhelmed.\n\nMost helpful thing for my depression was getting diagnosed with adhd and getting prescribed adhd meds so I can hyper fixate  on something and not  be alone with my thoughts.\n\nOther people have never relived me from depression and most of the time they make it worse.",
      "created_utc": 1729638758.0,
      "score": 3
    },
    {
      "id": "lt9ekhi",
      "body": "I've been really close to following through and i made a comment about having 5 blisters, which were an accident. But my step dad just made a joke about how he doesn't have to be concerned does he. Honestly I wouldn't be taken seriously even if I did speak up",
      "created_utc": 1729641752.0,
      "score": 3
    },
    {
      "id": "lt9mn19",
      "body": "I've had friends post about mental health awareness and to reach out. I've reached out to those friends. And nothing. Things get tough and they leave. I've had a few friends who aren't perfect about supporting me, but don't ghost me when I'm in crises.",
      "created_utc": 1729644561.0,
      "score": 3
    },
    {
      "id": "ltaqr52",
      "body": "They don’t care AT ALL. They lie and say they do but they never check in/on you, tell you to man the fuck yo and think positive thoughts, and ignore you until things turn better. It’s so gross.",
      "created_utc": 1729661039.0,
      "score": 3
    },
    {
      "id": "ltax772",
      "body": "This mindset is not exactly correct, while understandable. It's not that people don't want to help - they just don't know how to help.\n\nWhile indeed there are people who just pretend to want to help, which is true to many other topics too, most of the time is that people just don't know what to say, or even understand the issue. It's like a person who doesn't understand why they bother recycling, or even how to do that, although they might want to help the planet.\n\nAt the end of the day, while trying to reach out is worth trying, you can only rely on yourself...",
      "created_utc": 1729664901.0,
      "score": 3
    },
    {
      "id": "ltaxnsw",
      "body": "Especially suicide hotline people,, I literally never encountered people who couldn't care less about my situation.",
      "created_utc": 1729665196.0,
      "score": 3
    },
    {
      "id": "ltb3xfm",
      "body": "It’s why I quit social media. I was literally crying out for help on my Facebook, hoping that some friend would reach out to me. No one did because all of them didn’t know what to say so apparently no one said anything. Some claim they didn’t even see the post so I would post multiple times. Even putting it in picture since people seem to reply the memes, but not actual stuff. I even deactivate it my socials for a while and no one checked up on me. I come back and post a meme and I get a message from a person saying it’s good to see that I’m alive and well. You waited until I posted a meme and assumed that I’m well because of that? So I quit all over again.\n\nI was dating the military so I moved 1 million times so it’s not like I could call up these people or see them in person so social media was my lifeline and everyone just didn’t care. So now I don’t talk to any of those anymore.",
      "created_utc": 1729669358.0,
      "score": 3
    },
    {
      "id": "ltbvcdl",
      "body": "My favorite is when people respond with \"we are all a little depressed.\" It's like yeah, so? Is that supposed to help?",
      "created_utc": 1729685558.0,
      "score": 3
    },
    {
      "id": "ltbyaq3",
      "body": "This is so true.  People should just tattoo “Get some help…but not me. I am not help.” on their foreheads so we know who’s who.  \n\nIt’s gotten to the point where I consider having eyebrows a sign that only lip service will be paid to people who are truly hurting. 😏",
      "created_utc": 1729686794.0,
      "score": 3
    },
    {
      "id": "ltfwwu7",
      "body": "I have lost a lot of friends from reaching out. A LOT. But I do have friends who stayed. They are gold.",
      "created_utc": 1729733050.0,
      "score": 3
    },
    {
      "id": "lt7ywaq",
      "body": "[deleted]",
      "created_utc": 1729624994.0,
      "score": 5
    },
    {
      "id": "lt84ff6",
      "body": "I’d throw myself onto a psychologist right away, but I don’t live alone yet. That’s what makes me fear the most: I’d have to admit. The most fearful part of it.\n\nSaying you want a psychologist because “you feel a bit strange or want a new experience” won’t cut it. It even may cut it, but what if someone pressures me further? Wanting to ask what’s happening? That is fearful.\n\nI feel so strange. I have little hopes, and I always feel crushed in presence of my succeeded friends. I’m a failing person.\n\nSome people overly judge me for the failure I am. That stresses me out and makes me so sad. I don’t know what to do to make this better without having to admit things and try harder, because my will’s too weak and I’m stuck on social medias 24/7. So shameful.",
      "created_utc": 1729626690.0,
      "score": 2
    },
    {
      "id": "lt8ew2p",
      "body": "Actually, if I, an expert at depression and s** ideation, would actually make contact with someone, including you, I suspect it would make me feel better.",
      "created_utc": 1729629855.0,
      "score": 2
    },
    {
      "id": "lt8zmvq",
      "body": "Yeah i get a lot of toxic positivity from friends who are actively avoiding their own mental health in an effort to just “ignore it away” whereas the community would be really helpful most days 😒",
      "created_utc": 1729636537.0,
      "score": 2
    },
    {
      "id": "lt9hdgh",
      "body": "Such is existence.",
      "created_utc": 1729642734.0,
      "score": 2
    },
    {
      "id": "ltap2z0",
      "body": "Exactly 💯! I think some people care 🤏🤏🤏 much, but that's about it until you're dead. Then everyone wishes they would have done more.",
      "created_utc": 1729660131.0,
      "score": 2
    },
    {
      "id": "ltas744",
      "body": "Also one thing I have realized in past 3/4 years the same old toxic strategy of suck it up, suppress those emotions and force yourself to do your job/ work strategy helps you the best than anything else.",
      "created_utc": 1729661857.0,
      "score": 2
    },
    {
      "id": "ltaz33x",
      "body": "Yep, \"oh there's help out there\", ring this place ring that place, take this medication take that medication. See this psych, see that psych blah fucken blah. It's a fucking rabbit hole. And the pharmaceutical companies are cashing in on our demise. It's fucking sick.",
      "created_utc": 1729666112.0,
      "score": 2
    },
    {
      "id": "ltaziyc",
      "body": "It feels weird saying my dark thoughts out loud. Especially to a person who's never felt how I feel. I find no comfort in seeking help that way. I hate how uncomfortable it makes them and it is a giant reminder of my depression. My support is everyone respecting my boundaries when I'm depressed, and treating me normally when I come out of it. I find solace in my solitude. I've learned to soothe myself and I can't see anyone doing it better than myself.",
      "created_utc": 1729666392.0,
      "score": 2
    },
    {
      "id": "ltb90xr",
      "body": "please don't flame me for this but i do really want to help my partner. whilst being on a long-distance relationship, how can i help him for situations like this? i know he's tired of my reassurance on online chats and calls but i don't know what else to do since we live afar and i really hope that i could comfort him in a physical way.",
      "created_utc": 1729672896.0,
      "score": 2
    },
    {
      "id": "ltbb75p",
      "body": "Thing is, everyone's busy with their own lives. Everyone has their share of problems. I am sure you have it better than some people, you aren't spending your resources on helping those less fortunate, right? Have your own depression to deal with.\n\nPeople might care about you if they love you (and there is no guarantee of existence of such people), or if you pay them. And that's it. Reach out and pay for support would be more accurate recommendation.",
      "created_utc": 1729674397.0,
      "score": 2
    },
    {
      "id": "ltbfef2",
      "body": "I'm just now finding out the case management isn't available either. It's been hard I've decided that I'm being denied care because there's something wrong with me or they don't like me and it's personal. \n\nOnly that's not true either they don't care. What I had a mother and father that used to neglect my symptoms I realized that I valued my mental health or my personal feelings in a different way and my caregivers didn't value me and didn't try and help me but I'm my own mother and father to get my own help I'm disabled as well. So this is a conundrum for me to navigate and I asked these doctors can't I go to pain management where I don't have to find a car ride for it? I'm afraid to get into the car I am afraid to be driven anywhere I'm afraid of driving. My car wreck 14 months ago and being homeless for a few months has ruined my life. I'm ruined why am I being punished why am I being sent on a confusing gas lighting routine that reminds me of the neglect and refusal to care that my parents did to me I resent my mother and father and I resent professionals for not helping me because that's three parties that are let Downs complete letdowns.\n\nThere's nothing wrong with seeking help earlier this week this professional was confused and on a blame mode of telling me that I'm the problem and that I mentally ill and I said yeah I'm a bipolar failure to thrive case I need my medication here are two illnesses and here are three medications for it where are my medicines? And that's where they are they don't want to help me and they want to see where I disabilize and where I fail\n\nThey want me to fail is what I concluded so here I am disabled from bipolar and the doctors tell me that I'm the problem with all of these labels? Then I get care for over 20-30 years and now they want to mess around with it and remove care and change care. yeah okay life is full of change.\n\nI've also noticed that I'm being asked to be tough and strong and carry all of this and I can't and that's why I take medicine it's so strange that I have to keep on repeating myself and explaining myself about the same things that I keep managing decade after decade and why? Because this is where it is I can't help it I am a broken person that keeps on asking for help in a place in a nation that doesn't want to help anybody. They want to blame everybody make fun of everybody tell me it doesn't exist. Uses denialism or declinism\n\nNarcissism recovery coursework from YouTube helps me cope with mental health professionals they have a God complex they believe or they stigmatize everybody that there are drug user or crazy person and I don't have time to go back to the 1950s but since I live in the 1950s I just figure okay I'm a woman I'm a piece of garbage??? Is that what I'm supposed to think? No it's just a holding pattern over medical Care. Every year every decade every fad every little dinky inexperienced unqualified professional and not even making $8 an hour is going to tell me about mania or depression they really can sit down and shut up. Because they don't know anything.\n\nIn jest, I've learned with mental health care the last year that I'm a piece of garbage😂🤣👆☝️🆙🧵 and that's the complete opposite of what I've experienced that's where I know that my mental health care is being removed from me and they are destabilizing me and they hate me. Because there's no reason to keep on making me suffer and to ignore me I'm being ignored and so are the rest of you these are the common routine existing concerns to take in stride and to carry.\n\nHow in 2024 and I'm being asked to suffer. It's not okay that this post is at Reddit and we are all here talking about our experiences 😂🤣💩🤣😂in the removal and the rejection of care. \n\nI don't have time and neither do you to live in a place of suspended reality or a delusion where it's the person's fault for seeking pain management I am not strong I needed management and I needed my medication giving back to me my anxiety and insomnia is unbearable however I keep carrying it because I'm not giving up on myself..I am experienced with parents and family neglect so when I experience medical neglect I realize this is a communication problem I have to find a new communicative doctor is that what I'm supposed to think? See that's the problem I don't want to worry about another person and I don't care about professionals I want my medical care I wonder if I'm being denied care because I'm a woman and they think that I'm all about abortion I'm all about getting my mental health care and my anxiety and insomnia meds.\n\nWhat a joke 🤦‍♀️🧘‍♀️😂🤣 what a bunch of little hoops to jump through I wonder what it's going to prove?ngry at medical Care for rejecting me and letting me go this is not a job where you neglect and tell people no this is suffering people that are medical patients I'm a patient you are a patient.\n \nHe had patients are ignored because patients don't matter? Is that what I'm supposed to think? After I looked at all of this two days ago I made an appointment for therapy and therapy is another hoop to jump through and this is important because they owe me case management \n\nAnd that's a big mistake for me because they don't owe me anything even though I'm disabled they don't owe me anything they don't know me and I don't know them. So it's a lot of carrying everything myself and taking everything in stride and living with pain living in pain and simply enduring it all but that also means that I can't function in life so I'm more of an ineffective person without my medication so I tell people this week and this month I am ineffective and don't rely on me that's exactly what I tell everybody in my life never rely on me for anything.",
      "created_utc": 1729677244.0,
      "score": 2
    },
    {
      "id": "ltbgbtu",
      "body": "Thank you op, your post helped me talk. The therapy appointment is taking time. Venting is good.\n\nI don't like how I feel confusion over my medical care I don't have confusions or mysteries in my life everything is cut and dry and so very plain and I don't like mysteries I don't like murkiness I just wish I had my refills I feel as though that the doctors worry that I'm a failure to thrive case maybe they shouldn't give me medication maybe they should just let me be upset or work it out myself and I told them no no I can't work it out myself I'm not strong enough the anxiety and inside me know will break up my appetite I really need my medication my stomach gastroscoping needs done and I can't take a bunch of medications I just have to have my stomach and mind calm they don't want to write my anti-nausea medication. So it's a lot of weight and see I'm not angry anybody I'm hurt at my own outcomes and at my own circumstances not anybody else. I still believe that medical professionals are Earth Angels maybe my medical professional Earth Angel is having a terrible week maybe they too are suffering as well. I don't want to have a relationship with my doctors where their mothers and fathers over me because my mother and father were neglectful and unreliable my medical care is reliable and now my medical care has become unreliable and neglectful. And I don't like reliving that narcissism and that denialism over my medical care telling me that I don't have problems when I clearly do and the doctors agree so why are they uncomfortable with treating me I wonder where medicine changed because I haven't changed I can't get better and maybe that's why they don't want to treat me maybe they don't want to treat me or care about me because I can't get better maybe that's it?\n\n I don't know I don't like the questioning myself the questioning them I like to rely upon and have good faith and happiness with my medical care I don't hate medical Care I don't understand denying medical Care.\n\n  working on my podiatry vision Care and dental for two solid years since being homeless. The car accident 14 months ago is another setback to hug and carry and taking stride and have compassion over.\n\nThere's so much recovery and rebuilding that takes place I can't seem to recover. I imagine doctors hearing this or seeing this realize well this person is a lost cause and don't give them medicine. That's what I left questioning myself with\n\nI try and comfort myself with it's all working out for me and it will be okay and I'm just the confused party whatever it is in life I usually blame myself and say I'm the confused party and I just walk away. Only I can't walk away from medical Care and that's a lot to carry",
      "created_utc": 1729677834.0,
      "score": 2
    },
    {
      "id": "ltblt24",
      "body": "So many amazing comments. I'm grateful for everyone sharing there experience because I relate to so so much. I really struggle with the isolation, not because I want to be isolated but because of the trauma and never having support.  You're all absolutely valuable to me, you're helping me to understand what I've always felt but I just didn't grow up having the skill set to survive hence making poor choices and nothing changing. Thank you reddit family for giving me love. I send out love to you all because you are loved and I cherish every comment ❤️",
      "created_utc": 1729681032.0,
      "score": 2
    },
    {
      "id": "ltblyiw",
      "body": "I was in a happy place and it all got taken away again.  Ibfeel like I'm meant to suffer",
      "created_utc": 1729681113.0,
      "score": 2
    },
    {
      "id": "ltbxtuy",
      "body": "Yeah, it should really be rephrased as “professional help” or “professional support”. Because really most people are not equipped or have the space and resources to deal with your shit too. Kind of like expecting friends and family to be your doctor or contractor. Get therapy or stuff it down till you can deal with it.",
      "created_utc": 1729686605.0,
      "score": 2
    },
    {
      "id": "ltbzsff",
      "body": "Agree fully with you, op. And then, if someone does kill themselves, people are saying 'S/he should have come to me and I would have listened, supported and helped them,' even though the person may well have tried to tell them how bad they were feeling.",
      "created_utc": 1729687396.0,
      "score": 2
    },
    {
      "id": "ltcfmjr",
      "body": "Honestly the only people I’ve found to actually give some fucks are people I’ve met in AA. I’m lucky and am also a recovering alcoholic with over 4 years of sobriety. But still depressed af without a way to escape. I’ve never wanted to be in a church. I’m not religious. The whole god thing made me want to vomit, but if you can get past that, might try some sort of support group. Being around others that are dealing with the same stuff and learning from them, is priceless wisdom. It gets me out of my head, which is a place I never should be. Lol. Just a thought. Also, I haven’t been to a meeting in months. I’ve been isolating myself at home. But when I go, my life is manageable.",
      "created_utc": 1729693067.0,
      "score": 2
    },
    {
      "id": "ltcq7jk",
      "body": "I have a hard time believing there are people who can't understand.\n\n\nI really believe they are secretly afraid of that understanding, whether they have felt the same way or not. They have worked really hard and gotten really lucky so that they can live in an illusion. Being confronted with the fact that it's an illusion is like realizing you're dreaming, it makes you extremely likely to wake up.",
      "created_utc": 1729696414.0,
      "score": 2
    },
    {
      "id": "ltd7opi",
      "body": "It's true. Even my wife got tired of me and bailed.",
      "created_utc": 1729701756.0,
      "score": 2
    },
    {
      "id": "ltdeuwp",
      "body": "I just think it’s not normal to talk to random people in real life about my problems. Like I will talk about it on the internet and with my parents or a therapist but not friends, not people in my circle. I feel like people use that against you.",
      "created_utc": 1729703907.0,
      "score": 2
    },
    {
      "id": "ltdsffe",
      "body": "Yeah, pretty much.",
      "created_utc": 1729707999.0,
      "score": 2
    },
    {
      "id": "lte36fv",
      "body": "So true.   Unless you come across someone who knows what you are going through and then.. they have so much on their own plate, their own issues, that it is hard for them to do much help. I reluctantly told my long time physician and he immediately started a process for me to get help with medication and a counselor. I was in my early 40s and wish I had done something earlier in life. It is so much easier to get help the younger you are.. took several med changes but finally found a mix that does pretty well. I need to find a new counselor because I moved but there are people who are in the psychology field who know this is their calling and want to help you any way they can…. Not all, I have heard you may have to go to a few to find one that works for you. (I was lucky).   I know the pain and don’t wish that on anyone, it’s like your brain is working against you, telling you lies. Mine tells me I’m worthless, garbage, dumb, useless and my family is better without me. (Sound familiar?). This is a lie. I have never seen anyone who falls into that category.  Take care out there. Get the help you need. We are worth it, I think you are worth it. 🙏",
      "created_utc": 1729711426.0,
      "score": 2
    },
    {
      "id": "ltfgi79",
      "body": "I’ve been so low so many times. Communicated as much as I possibly could that I was struggling really bad. Nobody really ever reached out. But then when some one they know does commit suicide, they all talk a big game of how they would have behaved differently if only they had known! BS. They would have been annoyed with them for being a wet blanket and stopped inviting them around.",
      "created_utc": 1729727221.0,
      "score": 2
    },
    {
      "id": "ltfp3fi",
      "body": "I got in trouble at work for saying I was depressed when someone asked because it made them uncomfortable.  Apparently it's inappropriate conversations to say your depressed",
      "created_utc": 1729730261.0,
      "score": 2
    },
    {
      "id": "ltwx4k2",
      "body": "It certainly feels this way sometimes. I told my friends this summer how bad I've got. They were sympathetic at the time, but not one has reached out to check on me since. It's like I never said anything. It's not like I expect them to help, but I have nobody in my life who I can openly talk to outside of my therapist. I feel like I'm spiraling into the void.",
      "created_utc": 1729978299.0,
      "score": 2
    },
    {
      "id": "ltxk6ze",
      "body": "I feel you.  The only person that remotely care about me or seem concerned is my dog.  If it wasn't for him, I don't know....",
      "created_utc": 1729986802.0,
      "score": 2
    },
    {
      "id": "lt8kdg3",
      "body": "Others have said it here before.\n\nIt's not that they don't care; they don't know how to handle it.\n\nThey don't know how to set boundaries, and some will ghost you because of that.\n\nSome can't bear the weight of knowing that you are suffering and that they can't help you.\n\nPlease don't be mad at them. Direct this energy somewhere else, turn it onto something good. \n\nSeek professional help, I hope that you are able to.\nThese people are paid to listen to you.\n\nEdit: Want to ad that saying suck it up is just another way of telling you that they don't know how to handle it.",
      "created_utc": 1729631482.0,
      "score": 5
    },
    {
      "id": "lt7bowp",
      "body": "I know therapy isn’t for everyone and sometimes it’s hard to even afford therapy or find the time for it, but this is basically why therapy helps in these situations - it gives you a safe and supportive space to be heard and acknowledged that might not exist in your everyday life.",
      "created_utc": 1729617800.0,
      "score": 2
    },
    {
      "id": "lt7t1tn",
      "body": "[deleted]",
      "created_utc": 1729623178.0,
      "score": 1
    },
    {
      "id": "lt81crv",
      "body": "Me right now, hahahaa, I'm about to quit college so I won't have to deal with being alone in a \"cooperative environment\". I should just work and live...",
      "created_utc": 1729625749.0,
      "score": 1
    },
    {
      "id": "lt8hs54",
      "body": "They just want to bestow their beliefs and fixes on you. Have you tried watching a funny movie. Love yourself be grateful etc.....",
      "created_utc": 1729630701.0,
      "score": 1
    },
    {
      "id": "lt8m1zc",
      "body": "I’m also stuck, sad and constantly spiralling whenever I’m at a dark place, one day I fear that all the spiralling will make me hurt myself or do something I’ll heavily regret. I’m trying to take therapy, but it just feels like how it feels when I’m talking to someone who isn’t as qualified. You hear the same things from a therapist that you’d hear from your friend just more complex and it’s like I can’t handle this and they don’t seem to be doing the same. But, for me I remember there is God and he is always waiting for me, I just constantly delay it out of fear and the lack of trust I have for myself trusting in God. I hate living like this I really do, it’s too painful as I grow up.",
      "created_utc": 1729632007.0,
      "score": 1
    },
    {
      "id": "lt96zkp",
      "body": "I would say, don't give up on trying to get help. It took me almost 10 years to get the right help. A lot of things happened to me on the Road, even healthy care professionals were rude to me. Don't give up, It only takes the right person to get the help that you need.",
      "created_utc": 1729639114.0,
      "score": 1
    },
    {
      "id": "lt9n8wi",
      "body": "Yeah, no one gives a crap. I either have to fight encourage or more creativity. I’m pretty done.",
      "created_utc": 1729644773.0,
      "score": 1
    },
    {
      "id": "lt9ol55",
      "body": "Yup! I never believe anyone when they say \"You can always talk to me.\" My mind is always in defense mode and would never believe anyone actually wants to hear what I have to say. \n\nSo I actually went ahead and took the offer. I write paragraphs, pouring my heart out, they respond, lure me into thinking I'm actually safe to be vulnerable and let out my feelings. So I do, I write more and.... no reply. 😅",
      "created_utc": 1729645240.0,
      "score": 1
    },
    {
      "id": "lt9qfc2",
      "body": "Fr I just want help without a goddam lecture or annoyance",
      "created_utc": 1729645899.0,
      "score": 1
    },
    {
      "id": "lt9r5og",
      "body": "I've done exactly this, and even if I'm always the one helping others, I just get left in the dust, ignored. I'm over it.",
      "created_utc": 1729646160.0,
      "score": 1
    },
    {
      "id": "lt9ti91",
      "body": "Literally tho",
      "created_utc": 1729646994.0,
      "score": 1
    },
    {
      "id": "lt9tl0r",
      "body": "I've 100% had this experience as well.",
      "created_utc": 1729647022.0,
      "score": 1
    },
    {
      "id": "lt9ynw9",
      "body": "People who have been depressed and been through it understand and care. Share with those people.",
      "created_utc": 1729648836.0,
      "score": 1
    },
    {
      "id": "lt9z48e",
      "body": "I try to help people a lot on here as much as I can. Very terrible about reaching out myself for help though. It's not always like that OP but a lot of times it is and it sucks. Really sucks",
      "created_utc": 1729648996.0,
      "score": 1
    },
    {
      "id": "lt9zmjz",
      "body": "and then when you do, everyone tells you how worried they are and how you killing yourself is the “last thing they need right now” which makes me feel guilty and even worse",
      "created_utc": 1729649178.0,
      "score": 1
    },
    {
      "id": "lta2g76",
      "body": "See if it works , Buy some beer to stranger and they will listen ..",
      "created_utc": 1729650216.0,
      "score": 1
    },
    {
      "id": "lta42ox",
      "body": "I literally had the police called on me for confiding in someone close to me that I was suicidal. You’re right , no one cares and no one can be trusted.",
      "created_utc": 1729650816.0,
      "score": 1
    },
    {
      "id": "lta432j",
      "body": "I literally had the police called on me for confiding in someone close to me that I was suicidal. You’re right , no one cares and no one can be trusted.",
      "created_utc": 1729650816.0,
      "score": 1
    },
    {
      "id": "lta4l3a",
      "body": "I literally had the police called on me for confiding in someone close to me that I was suicidal. You’re right , no one cares and no one can be trusted.",
      "created_utc": 1729650980.0,
      "score": 1
    },
    {
      "id": "lta5q1g",
      "body": "The main issue is that people who don't have depression doesn't even want to touch negativity or negative vibes. People these days are extremely selfish and self centered. No one wants to help anyone anymore. So much trust lost that support doesn't even feel like support but charity cases.\n\nI remember when my old roommates traumatized me and kicked me out of the suite. I had a mental breakdown and they threatened to call the cops but I ended up calling them anyways and stayed overnight at the hospital. The next day they were all like \"oh if you ever want to talk or need support you can always text us\". They just don't want to be blamed if I ever committed suicide. They want to feel like a good person but at the same time not care about anyone but themselves.",
      "created_utc": 1729651396.0,
      "score": 1
    },
    {
      "id": "lta87zx",
      "body": "i can’t blame them for not caring. i don’t care about anyone but myself so why would i expect people to do differently",
      "created_utc": 1729652378.0,
      "score": 1
    },
    {
      "id": "ltaagzk",
      "body": "majority of them do not give a fuck at all. always telling you to call them or talk to them anytime, but then they get annoyed when you’re venting or being “negative”. Like damn, I’m in a bad place right now. I have learned to only talk to my husband or my dad but even then, I try not to dump my problems on them too much… it’s just hard all around.",
      "created_utc": 1729653297.0,
      "score": 1
    },
    {
      "id": "ltad49p",
      "body": "I think the hardest part for me someone who has lived with suicidal thoughts and major depressive episodes for over a decade now it’s like I feel like a broken record of wanting to die or hurt myself the urges . And why share when I feel that this is just how it is and also feeling like damn I already have a small circle due to having major mental illness for a long time who know my issues and I feel I run the risk of losing the few I have because damn if I am frustrated with my self and symptoms I feel they must be too . I do have moments of joy and know it will pass but damn when I am in those moments just feel like a elephant is sitting on my chest while my little devil on my shoulder just is whispering the meanest things into my ear.",
      "created_utc": 1729654422.0,
      "score": 1
    },
    {
      "id": "ltae5ey",
      "body": "Exactly this is exactly my point because no one cares for you and I seriously wanna die",
      "created_utc": 1729654873.0,
      "score": 1
    },
    {
      "id": "ltahjx9",
      "body": "That's EXACTLY how I feel and what made me just come here to post a question I will do after this. I had a horrible year, my extended family locking me out of my apt and stealing most of what I own. I'm disabled, on it for also depression and anxiety, and had an anorexia relapse because of it. People were kind, but no one really wanted to hear it, the police, the Dept of Mental Health support, the courts, the sheriff's office. And given ppl w/ depression have challenges to makng and keepng friends, it only to me emphasized how alone and apathetic everyone is.",
      "created_utc": 1729656407.0,
      "score": 1
    },
    {
      "id": "ltamoyy",
      "body": "I feel this. I am very depressed myself and have been for a long time off and one. One day, me and my buddy were talking, and he was telling me about a couple of his friends depression and he said, \"The whole world has depression now a days.\" The way he said it was so undermining and seemed to me like he was trying to act like depression is not a big problem. But if so many people have it, CLEARLY it's a fucking problem. So, I just thought to myself, \"Well, now I know I can not ever open up to you.\"",
      "created_utc": 1729658889.0,
      "score": 1
    },
    {
      "id": "ltan3w7",
      "body": "I disagree. Nothing worse than being super depressed and finally mustering up enough energy to talk to someone about it, and having nothing change. It just digs a deeper hole because you stop caring to even try to talk to people because you know it's useless and nothing changes.  FOR THE LOVE OF GOD, do not sit and listen to someone and do nothing to help. Don't waste their time if you can't help. It leads to suicide, not help.  I HATE that people things it improves anything. YOU are the problem for wasting their time and making them feel they have some hope.",
      "created_utc": 1729659098.0,
      "score": 1
    },
    {
      "id": "ltcoj0v",
      "body": "People want to support mental illnesses, and normalize them, but since we’re in the transition, it’s hard for a lot of people to get the help they need and deserve, plus expenses can be a lot for therapy. I was lucky when I experienced severe mental health issues because at that point my mom had the money to send me to therapy, even when they racked up the payments after forgetting to send the bill multiple times, we were able to afford it. \n\nPeople are busy, and it’s no one’s responsibility to take care of your mental illness. You can ask for support but you can’t expect them to be around and supportive 24/7. Mental health requires you to want to get help as well, and for you to work through it. The support is there to help guide you in the right direction. Therapy can be useful and there are many workers who really care about their clients. You just have to give them a chance.\n\nTherapy is like medication, it’s not always gonna be suitable for you but there is someone out there who is suitable to you. Even though there’s the argument that “therapists do it for the money”, that’s not always the case, I mean yea, like everyone else, they need a job to be stable. But who else would do it if not them? Who would be qualified enough? Therapists are human beings who grow connections to others just like all human beings. They grow care, love and respect from these connections. Someone will care about you and support you if you give them the chance.",
      "created_utc": 1729695895.0,
      "score": 1
    },
    {
      "id": "ltd3cw2",
      "body": "Well ill be glad to talk about it.",
      "created_utc": 1729700445.0,
      "score": 1
    },
    {
      "id": "ltd5swl",
      "body": "I literally tried reaching out my last episode and everything always went sideways. Like something else came up for them, a family member called, etc. \n\nYeah I'm just going to rely on myself to get out of it from now on",
      "created_utc": 1729701188.0,
      "score": 1
    },
    {
      "id": "ltewvjd",
      "body": "I agree. People always say I'm here for you when you need it but don't actually want you to ever reach out. It actually pushes people away if you even hint at needing help. A lot of people secretly need help themselves and they get pissed when you reach out knowing that they \"can't\".",
      "created_utc": 1729720422.0,
      "score": 1
    },
    {
      "id": "ltez12n",
      "body": "real they all just ignore me",
      "created_utc": 1729721138.0,
      "score": 1
    },
    {
      "id": "ltf347m",
      "body": "people say they care but they take the first out they’re given. my boyfriend said he could drive out to pick me up, but i told him “nah i don’t want to make you drive 3 hrs to see me” and he says “thank you”. my siblings are younger and i cant burden them with my mental health, absolutely not. my dad practically believes mental illness is bullshit and hates therapy and meds and any sort of help. my mom is ill like us yet everytime i tell her i feel so low she and i have blowout fights and i have to flee the house to calm down and when i come back we don’t talk about it other than maybe a small “sorry abt that”. nobody cares until they’re faced with your mortality and realize they want you around - but when you’re around they just don’t show that they care. when you come back from the hospital it’s about two weeks of kindness then it’s right back to normal. i just don’t understand how people don’t care. i care SO deeply for everyone around me, even people i don’t talk to anymore. if someone i loved told me they felt this way, i would try to help them at to every extent that i physically can. it feels like “care” only exists for the dead",
      "created_utc": 1729722528.0,
      "score": 1
    },
    {
      "id": "ltfg8oo",
      "body": "I sometimes wish I could take life like some Nihilist and embrace the fucked up absurdity of it but I‘m simply not built like that.\nI kinda envy those people.\n\nAnybody else feeling like this?",
      "created_utc": 1729727128.0,
      "score": 1
    },
    {
      "id": "ltfjjy5",
      "body": "And even when they think they want to be supportive, most people have no clue how to support a depressed person. Everyone who has never dealt with it thinks depression is just sadness and lethargy, and won't spend their precious time to learn otherwise. They can't be supportive of high-functioning depression, or bipolar depression, or OCD, or any condition that is more complicated than just *sadness.*\n\nEveryone encourages us to ask for help, but nobody wants to do the work required to become a reliable support system. Even some PCPs I've seen have no concept of what true depression is, despite having decades of experience. It's not their purview, so they won't waste the time to learn it.",
      "created_utc": 1729728297.0,
      "score": 1
    },
    {
      "id": "ltgik3t",
      "body": "Are you ok? ",
      "created_utc": 1729741330.0,
      "score": 1
    },
    {
      "id": "ltgjsss",
      "body": "What's even worse is when somebody does kill themselves?You always hear the relatives and the friend say\".I had no idea he or she was depressed or was in pain or was struggling.\" The harsh reality is ,everyone is caught up in their own Bullshit , Therapy for me personally was worthless, They just spout a bunch of nonsense and platitudes. I wish I\nCould get a better therapist, but my shitty insurance will only pay what they see fit. This therapy center has a very high turnover rate.",
      "created_utc": 1729741882.0,
      "score": 1
    },
    {
      "id": "ltlpw8p",
      "body": "I don’t wanna risk that.  Maybe it’s a good advise but personally no I avoid doing thsy",
      "created_utc": 1729814782.0,
      "score": 1
    },
    {
      "id": "ltu32up",
      "body": "Oh that's just a sale pitch to sell drugs or lock you up in a lucrative prison without a trial. Psychiatry is like 1000$ a day. Imagine the kids we could feed",
      "created_utc": 1729942439.0,
      "score": 1
    },
    {
      "id": "ltzatch",
      "body": "I have people I can talk to but...I have trust issues. Really bad trust issues. ",
      "created_utc": 1730017325.0,
      "score": 1
    },
    {
      "id": "lu2ts1o",
      "body": "My friends and my children do not know how to help me.\nMy friend is going to  the wedding of the lady of does my taxes \nand I wish I had been invited...",
      "created_utc": 1730065450.0,
      "score": 1
    },
    {
      "id": "lu2v9z8",
      "body": "I am depressed. When you talk to your friends they talk and then go back to their lives.",
      "created_utc": 1730065926.0,
      "score": 1
    },
    {
      "id": "lu5shy3",
      "body": "Too true unfortunately. Anytime I try to tell someone especially my parents I get called selfish and self-centred. It’s honestly so hurtful and a real nasty thing to say. It makes me feel even more horrible and alone   ",
      "created_utc": 1730115781.0,
      "score": 1
    },
    {
      "id": "lw0c8p1",
      "body": "I felt this so deeply my heart dropped...😕",
      "created_utc": 1731031710.0,
      "score": 1
    },
    {
      "id": "lxplgx9",
      "body": "I am depressed. When you talk to your friends they talk and then go back to their lives.",
      "created_utc": 1731905465.0,
      "score": 1
    },
    {
      "id": "ly0v2tm",
      "body": "Agreed. No one cares. No one refuses to take accountability for their shit and they put the blame on me. Always I have to be responsible. Always me who is wrong. Fuck these people.",
      "created_utc": 1732064035.0,
      "score": 1
    },
    {
      "id": "mauf9hu",
      "body": "Me to only I dont want to kill myself I just want the doctors to give me the operation they said I need. Probably not happening because im old so they just figure let her die.",
      "created_utc": 1738632066.0,
      "score": 1
    },
    {
      "id": "mf2d6xg",
      "body": "My mom saw the cuts on my arm, all she had to say is \"you need to quit that\" fucking hate that bitch",
      "created_utc": 1740662499.0,
      "score": 1
    },
    {
      "id": "mgjyejv",
      "body": "Автор в точку! Иногда родные спрашивают о моем состоянии ссылаясь на мое грустное лицо, и я им говорю что происходит у меня в жизни, что я чувствую себя жалкой, что иногда в трудные моменты в жизни приходят мысли о кмп . На что они начинают соревноваться со мной \" У Кого больше проблем\" Итог: Твои проблемы по сравнению с моими букашки. И в конце: Живи и радуйся жизни, и не ной постоянно ",
      "created_utc": 1741372663.0,
      "score": 1
    },
    {
      "id": "mhitkql",
      "body": "My problem is that I do have people who want to help and they will send me to therapy but I don't want to. I don't have the strength or energy to fight anymore. And I don't want to have to explain how k feel it's just not explainable.",
      "created_utc": 1741845658.0,
      "score": 1
    },
    {
      "id": "mlfc6jj",
      "body": "Self help books are my place of support and also online support, like right here on Reddit.",
      "created_utc": 1743794960.0,
      "score": 1
    },
    {
      "id": "mljlvek",
      "body": "Try being a nurse that's losing the battle. I know what happens if I reach out. Everyone's situation is different. Try being one of the nurses taking care of someone that just gruesomely murdered their own newborn in front of their 10 year old child and keeps fucking smiling for the news. Try being the nurse that's mentally scarred and barely holding it together from that night and NO ONE from the hospital has reached out to check on us. The paramedics debriefed and were sent home, a whole new crew brought in to relieve them... but the hospital doesn't care if the nurses are fucked up in the head...some of us are slipping in and out of reality. Just saying. Hope you feel better.",
      "created_utc": 1743863151.0,
      "score": 1
    },
    {
      "id": "lt7l5ry",
      "body": "Yep fuck those types of people. I hope each and every one of them ends up pushing all of their belongings around in a shopping cart for being so fickle. ",
      "created_utc": 1729620724.0,
      "score": 1
    },
    {
      "id": "ltsgiz6",
      "body": "You should be reaching out to a mental health professional. Not everyday people with their own problems who don’t even know how to help you even if they wanted to.",
      "created_utc": 1729910604.0,
      "score": 0
    },
    {
      "id": "lt8brdy",
      "body": "They say that to belittle you. \"Don't be afraid to make yourself look like a pathetic loser to everyone\"\n\n\nIt's gaslighting ",
      "created_utc": 1729628914.0,
      "score": -1
    },
    {
      "id": "lt795xe",
      "body": "Honestly, same...",
      "created_utc": 1729617018.0,
      "score": 51
    },
    {
      "id": "lt9bqid",
      "body": "Exactly. I also feel like it puts them in an awkward position because nothing they say makes it any better, at least not for me. \n\n“Is there anything I can do to help” No… not really. \n\n“Try looking at the bright side of things,” erm… ok \n\n“I’m always here for you,” Thanks…. \n\nIdk it’s just awkward and makes me feel bad for bothering them even if their response is kind and loving.",
      "created_utc": 1729640766.0,
      "score": 39
    },
    {
      "id": "lt7jto0",
      "body": "Exactly! Even if you say something you'll feel like you're overburdening them with your shit and then you feel bad about it and apologize multiple times.",
      "created_utc": 1729620307.0,
      "score": 15
    },
    {
      "id": "lt8mxh6",
      "body": "Same. I won't even tell my best friend that I almost tried to kill myself a few months ago because she has her own personal problems and don't want her to worry about me as well. It's not fair to her so I just keep it to myself.",
      "created_utc": 1729632282.0,
      "score": 9
    },
    {
      "id": "ltg4glf",
      "body": "This right here feels like Is being trapped in your own brain. ",
      "created_utc": 1729735759.0,
      "score": 2
    },
    {
      "id": "ltu3ejd",
      "body": "That attitude makes me feel lonely as hell. Everyone pretend to have the perfect lives, but everyone is miserable & on drugs. I was told my rants are hilarious. I read people connect more & deeper while sharing dark stuff than superficial stuff. \n\n\nI CRAVE THIS\n\n\nI'm actually happy in this sub. It's depressing and dark. Such a relief from the toxic positivity. \n\n\nIt validates my emotion & who i am. Thanks",
      "created_utc": 1729942607.0,
      "score": 2
    },
    {
      "id": "ltzepgz",
      "body": "And i thought i was alone",
      "created_utc": 1730019946.0,
      "score": 2
    },
    {
      "id": "ltc1kze",
      "body": "I hope you are speaking with a therapist. They are trained to speak with people who are battling depression and those conversations would be so much more fruitful and fulfilling than some random person.",
      "created_utc": 1729688087.0,
      "score": 1
    },
    {
      "id": "lt7pp55",
      "body": "[removed]",
      "created_utc": 1729622143.0,
      "score": 143
    },
    {
      "id": "lt8g6ka",
      "body": "[removed]",
      "created_utc": 1729630232.0,
      "score": 64
    },
    {
      "id": "lt9zrcr",
      "body": "They totally care... about their own feelings. Not wanting to help, but not wanting you to die... so inconvenient for them.",
      "created_utc": 1729649225.0,
      "score": 29
    },
    {
      "id": "lt8c2yh",
      "body": "It's not that they don't care.\n\nI've come to realise that they're just not equipped to deal with it. All this mental health awareness \"reach out to a friend\" advice is terrible, it comes from a place of such poor mental health support in many countries and trying to put the responsibility on your friends and family, and it's dangerous.\n\nI've lost too many friends from reaching out to explain my mental health wrecking my life, and I wish I'd kept it to myself. It hurts but it's true.",
      "created_utc": 1729629011.0,
      "score": 120
    },
    {
      "id": "lt9bz1t",
      "body": "👏🏻 THIS. I find that the people who post the most about it on social media are the biggest a**holes in real life.",
      "created_utc": 1729640849.0,
      "score": 29
    },
    {
      "id": "ltcsloo",
      "body": "Agreed.\n\nPeople do the whole \"mental health awareness\" because they want help with *their own* issues. Anytime someone else needs it, they're very quick to turn their backs on you or ignore you completely.\n\nAnd that's why I never talk about mine.. no one ever listens anyway or takes me seriously. So I try to deal with it on my own.\n\nPeople suck.",
      "created_utc": 1729697158.0,
      "score": 8
    },
    {
      "id": "lt8exzw",
      "body": "Exactly!!",
      "created_utc": 1729629871.0,
      "score": 1
    },
    {
      "id": "lt9hg6g",
      "body": "+1",
      "created_utc": 1729642760.0,
      "score": 1
    },
    {
      "id": "ltb9vqe",
      "body": "Pretty much yeah...",
      "created_utc": 1729673483.0,
      "score": 1
    },
    {
      "id": "lt7xebd",
      "body": "Fr 😭 you get it",
      "created_utc": 1729624534.0,
      "score": 21
    },
    {
      "id": "ltb2llb",
      "body": "Not only that, but most of us humans are slow. I notice some replies that don't even acknowledge what the other person says, and the conversation goes flat. One person might think the other didn't care to read what they said, whether it was intentional or not, further reaffirming what they already believe about people in general, and give up. I recognized I used to be that person and strive to be more open-minded when interacting for that reason.",
      "created_utc": 1729668432.0,
      "score": 11
    },
    {
      "id": "ltdp1h5",
      "body": "This should be pinned at the top of the forum. I'd only add that there *are* certain levels of help, just as there are certain levels of incurable illness that can be medicated and controlled effectively. But that's only a fraction of cases. A great many of us feel like there is no help. That everything, ultimately, is entirely up to us to act upon. And many of us have tried. And we failed. A lot. Too much. Far more than anyone should. Far more than a \"normal\" person would ever need to. And people have limits.\n\nI have absolutely no idea what it would take to make me feel anything more than brief moments of okayness. I don't know who else to ask for help. They say to get help - get help WHERE? SHOW ME! What form do they think this help is going to manifest? And which problem am I to get help with? They are all interconnected. How much time do they imagine I have free to do anything other than working for my own survival?",
      "created_utc": 1729706972.0,
      "score": 4
    },
    {
      "id": "ltg4q51",
      "body": "Louder for the people in the back!",
      "created_utc": 1729735856.0,
      "score": 2
    },
    {
      "id": "ltbktg0",
      "body": "Don't give up",
      "created_utc": 1729680491.0,
      "score": -1
    },
    {
      "id": "lt7u0lo",
      "body": "facts",
      "created_utc": 1729623475.0,
      "score": 4
    },
    {
      "id": "ltblbnb",
      "body": "You need a cheering squad",
      "created_utc": 1729680769.0,
      "score": 5
    },
    {
      "id": "ltd92qs",
      "body": "I know the feeling",
      "created_utc": 1729702169.0,
      "score": 6
    },
    {
      "id": "ltl4soc",
      "body": "Many of us care.  Suicide is not stupid, rather it is a way out. However, some of us can relate, be there for us....",
      "created_utc": 1729807310.0,
      "score": 3
    },
    {
      "id": "ltc8abe",
      "body": "Aye that's my mom. I just roll my eyes at this point. Like I haven't already tried that lol. Like she hasn't already done that a million times before and it resulted in nothing. Sure some people mean well but they just can't do shit and I'd rather people say you know what, that sucks, but I can't do nothing about it. At least that's honest.",
      "created_utc": 1729690555.0,
      "score": 4
    },
    {
      "id": "ltbnnj9",
      "body": "Or understanding .",
      "created_utc": 1729682002.0,
      "score": 0
    },
    {
      "id": "ltd3wkn",
      "body": "the fact that they atleast efforted to reply by saying theyll pray is something. Any words uttered by any human to one another has an effect. Just like music, music has an effect to brains and our emotions.",
      "created_utc": 1729700613.0,
      "score": -1
    },
    {
      "id": "lt74lir",
      "body": "Hanging in there, thank you for asking. ❤️\n\nI told my husband I was severely depressed and his response was \"okay\". \n\nSo I'm trying to make these little pumpkins out of pipe cleaners to not think about unaliving myself. \n\nHow are you doing?",
      "created_utc": 1729615622.0,
      "score": 40
    },
    {
      "id": "lt7znio",
      "body": "Worst day in the last 2 months...I'm angry and lost, feeling loosing my mind & identity and soon everything.  I think...it's better to keep my problems and thoughts to myself at the moment...And you? Better talking to people instead of yourself....",
      "created_utc": 1729625228.0,
      "score": 2
    },
    {
      "id": "ltd4159",
      "body": "please dont hate.",
      "created_utc": 1729700652.0,
      "score": 2
    },
    {
      "id": "ltbnub5",
      "body": "Yeah .  Or get new friends .  Loyal ones .",
      "created_utc": 1729682097.0,
      "score": 4
    },
    {
      "id": "lvj0n23",
      "body": "Talk to family. Well, let me tell you that can lead to a bad result as well. Lost two of three brothers that way.",
      "created_utc": 1730817617.0,
      "score": 2
    },
    {
      "id": "ltfw9mg",
      "body": "I’m so sorry. I feel this.",
      "created_utc": 1729732817.0,
      "score": 1
    },
    {
      "id": "lt7zhs5",
      "body": "I could have written this myself.  Hang in there fellow 80's kid.",
      "created_utc": 1729625180.0,
      "score": 10
    },
    {
      "id": "ltbm1pt",
      "body": "Well maybe you could go back and do some of the things you did as a kid .  If it was toys , get toys .  If it was video games , get video games from that time .  If it was music , get music from that time .  If it was sports , get / do sports from that time .  If it was movies , watch some movies popular at the time .  Things maybe you used to take for granted .  Forgive yourself for being a kid at an adult age .  Anything and everything you used to do , you could try doing that again , to relive some of the happy days .  To bring them here .  To today .  Even if for just a little while every day .",
      "created_utc": 1729681160.0,
      "score": 1
    },
    {
      "id": "ltbq7ri",
      "body": "Couldn't agree with you more. It's the equivalent of saying, \"how can you have asthma there's so much air around you.\" (I know its overused but i feel like it's accurate here). At this point it's better to be alone.",
      "created_utc": 1729683253.0,
      "score": 10
    },
    {
      "id": "lttelff",
      "body": "What do you want them to say?",
      "created_utc": 1729927314.0,
      "score": 1
    },
    {
      "id": "lt9o3da",
      "body": "I am so sick of watching mine looking at her phone during our sessions",
      "created_utc": 1729645068.0,
      "score": 5
    },
    {
      "id": "ltbo04e",
      "body": "It sucks .",
      "created_utc": 1729682178.0,
      "score": 2
    },
    {
      "id": "lt99i1m",
      "body": "Thats the worst isn’t it. Like they can’t even manage an “Holy shit dude that fucking sucks. I’m sorry.” and instead want to go through the generic advice that you’ve heard AN MILLION TIMES before and offer nothing else. Like I get it comes from an well meaning place but jfc 😭 I’m sorry that happened to you, I get how hard it is when you’re truly vulnerable to the people you think are supposed to get you but all you receive back is just nothing",
      "created_utc": 1729639984.0,
      "score": 14
    },
    {
      "id": "ltbn2dp",
      "body": "Maybe he's saying you've got to stretch yourself more .  Put up with the crap somehow .  Strengthen yourself by experiencing bad things and surviving long periods of unpleasantness .  Even alone .  Maybe not .  If not , I will .  You're doing ok for now , but you could be doing much better .  Imagine better .  Then make a plan to make it happen .  Point A to point B .  Include all the stuff that goes into it .  Follow the course , and make it to point B : Happy Days .",
      "created_utc": 1729681698.0,
      "score": 1
    },
    {
      "id": "lt9zbrt",
      "body": "[deleted]",
      "created_utc": 1729649070.0,
      "score": -8
    },
    {
      "id": "ltfwlzj",
      "body": "I see you. I’m sorry. I hate it.",
      "created_utc": 1729732941.0,
      "score": 2
    },
    {
      "id": "ltbom72",
      "body": "That sucks .  It would be nice if more people understood .  Perhaps they want to toughen you by not being \" too nice . \" Kick you to the curb , let you fend for yourself without any help .  Something like that .  Especially if you're the fearful type .",
      "created_utc": 1729682480.0,
      "score": 1
    },
    {
      "id": "ltaqak0",
      "body": "I miss Chester so much. With you 110% of the way, whatever we're struggling with.",
      "created_utc": 1729660782.0,
      "score": 3
    },
    {
      "id": "ltbo5rb",
      "body": "You learn who your real friends are that way .  People who will stay with you are your real friends .  People who go away are not .",
      "created_utc": 1729682254.0,
      "score": 4
    },
    {
      "id": "ltbksie",
      "body": "How to I learn to expect nothing like love and support and understanding? I wish I could but don't know how to help myself in this",
      "created_utc": 1729680477.0,
      "score": 1
    },
    {
      "id": "lt99ui0",
      "body": "aint that the fucking truth 🙃🙃🙃🙃",
      "created_utc": 1729640104.0,
      "score": 3
    },
    {
      "id": "mkn3guk",
      "body": "Nailed it",
      "created_utc": 1743399081.0,
      "score": 1
    },
    {
      "id": "lt7hl83",
      "body": "[removed]",
      "created_utc": 1729619619.0,
      "score": 3
    },
    {
      "id": "lt7vma3",
      "body": "I just C&C (Cry & Cut)",
      "created_utc": 1729623977.0,
      "score": 2
    },
    {
      "id": "lt7lp2w",
      "body": "[deleted]",
      "created_utc": 1729620890.0,
      "score": 1
    },
    {
      "id": "lt83265",
      "body": "I will try screaming and then singing after midnight, I'm curious to see what the neighbors will think of me tomorrow, I care too much about some people's opinion...it's also a national holiday tomorrow, so...Thanks for advices, these are good ones. :)",
      "created_utc": 1729626270.0,
      "score": 1
    },
    {
      "id": "lt81y9j",
      "body": "I think that's awesome you work out and take care of yourself.  A lot of people can fall into just not caring about health and just eat bad, use drugs, over use alcohol.  \nI still have to remind myself or get a wake up call that no. one. gives. a .fuck.   \nWe have to be our own best friends.  \nBut I hear you, everyday when I get out of bed to go to work, I look longingly back at it thinking \"I cant wait to see you tonight.\"  Pop a Xanax and off to sleep.",
      "created_utc": 1729625928.0,
      "score": 3
    },
    {
      "id": "ltaygg5",
      "body": "Yup. Another toxic strategy was honestly shifting my veiw on life a bit, too be a bit less positive (Not completely.) It lowered my self worth, which helped me not victimize myself as much, and it helped reduce my need for support and validation. Haven't crawled too anyone of my friends in years, and while I dont feel great, my relationships have been much healthier despite my toxic strategies, and that is a worthy reward. Don't recommend anyone else do this though, lol.",
      "created_utc": 1729665707.0,
      "score": 2
    },
    {
      "id": "lt7l230",
      "body": "My therapist made me feel guilty by using my parents (who were also a major contributor to my broken head) and how they would feel if they knew my negative coping mechanisms. This only made it worse. \nI think finding the right therapist is also essential. A lot of people think they know what they're doing but when it comes to therapy you have to be really sure about the aftermath.",
      "created_utc": 1729620692.0,
      "score": 2
    },
    {
      "id": "ltsuej5",
      "body": "One can usually only see a mental health professional for 45 minutes a week. That is the amount of support that you imagine a human who is ill needs? Humans need each other.",
      "created_utc": 1729916304.0,
      "score": 1
    },
    {
      "id": "lt7axsc",
      "body": "🫂 I hope someone is kind to you everyday, you deserve to feel as much love as anyone else, you're trying and that matters! I know you're stronger than you give yourself credit for",
      "created_utc": 1729617568.0,
      "score": 11
    },
    {
      "id": "lt9r2zc",
      "body": "It’s funny because even I don’t know what to say sometimes, and I fucking have depression. I’ve accepted that there is no right thing to say, and that sometimes it’s just about helping people feel safe and comfortable and heard. Give em space to just talk it out and acknowledge, not always trying to offer solutions. But yeah it’s hard to know what to say in those situations so I get it",
      "created_utc": 1729646134.0,
      "score": 18
    },
    {
      "id": "lt9oagj",
      "body": "Even after explaining the issues and that person responds with \"Damn that sucks\" And thats it.",
      "created_utc": 1729645136.0,
      "score": 9
    },
    {
      "id": "ltc1qiz",
      "body": "Why not speak with a therapist? Someone who is trained in this area. What can a random person that you know do for you realistically?",
      "created_utc": 1729688145.0,
      "score": 1
    },
    {
      "id": "ltdgv5n",
      "body": "Thank you, this extended to therapists too though, I know they are trained and have probably heard worse than what I would tell them but they're humans too at the end of the day and I doubt nothing of what they're told, gets to them even if just a little bit, I simply won't add to that, I could not live with the guilt. I feel guilty even thinking about it 🫠 I've seen dozens of therapists throughout my life and always end up ditching them because of this, I know I should see one again but I refuse to, like I physically and mentally can not do it.",
      "created_utc": 1729704515.0,
      "score": 1
    },
    {
      "id": "lt8bv7f",
      "body": "[removed]",
      "created_utc": 1729628946.0,
      "score": 74
    },
    {
      "id": "lt8x2ig",
      "body": "[deleted]",
      "created_utc": 1729635648.0,
      "score": 41
    },
    {
      "id": "lt8dc5n",
      "body": "> I've come to realise that they're just not equipped to deal with it.\n\nIt's not like that in my experience. I've met a few people that do care, and they dont know how to deal with it, true. But Theyre like 1% of everyone and most people are just judgy and say to you suck it up",
      "created_utc": 1729629393.0,
      "score": 24
    },
    {
      "id": "ltas0mb",
      "body": "Ohh this is so true the second paragraph, at this point I feel I am burdening my friend and one by one losing all of them.",
      "created_utc": 1729661754.0,
      "score": 4
    },
    {
      "id": "ltckfv0",
      "body": "This may well be the truest thing I have ever read online.",
      "created_utc": 1729694615.0,
      "score": 3
    },
    {
      "id": "lt9ucxj",
      "body": "This is facts. My mom openly talks about how she advocates for ppl who struggle with suicidal thoughts, has gotten on platforms and even spoke in from of many ppl on how to support and how she supports. Yet! Her own daughter ( me) is and has always been suicidal and all I’ve ever gotten told by her is that I should make sure that if I do something my kids go to her. No support not gentleness nothing. I do understand that many ppl have their own issues they struggle w and I respect that but my thing is be honest don’t say “ I’ll always be here for you if you need to talk” then shut the person down . Some ppl suck",
      "created_utc": 1729647299.0,
      "score": 23
    },
    {
      "id": "ly28918",
      "body": "This is dramatically late, and I'm reading this comment while I'm most likely drunk (something that, combined with poverty, can probably explain most of my own problems in life), but the only thing I've found that can help you through the ball-busting misery of life is distracting yourself. For good or for ill, that's all you can do. Whether it's going outside and focusing on nature (assuming there's any nature near you), watching TV or YouTube, smoking weed, drinking, or taking drugs (although that can do anything from making you distracted by your thoughts and send you down a further mental shithole, or wind you up with no money and no job), playing a video game with people you'll never know and don't need to, pretending to sword fight or wrestle the air, playing with toys, doing the Mambo, whatever it is, if you have something that can distract you, do it. Because unless you have a miracle of miracles, very little is likely to change. So you might as well enjoy the crumbs you're given by the world. Even if they are just crumbs, which will eternally piss you off and make you sad. ",
      "created_utc": 1732083989.0,
      "score": 2
    },
    {
      "id": "ltc4mv3",
      "body": "I don't really have a choice. My body is hardwired with mechanisms to prevent me from killing myself, and to attempt to get through life without it sucking is to keep going. Whether I want to or not, I have to keep going. ",
      "created_utc": 1729689234.0,
      "score": 3
    },
    {
      "id": "mn3o8fd",
      "body": "That's the real danger of religion. it makes people feel ok about never changing or doing anything",
      "created_utc": 1744654540.0,
      "score": 2
    },
    {
      "id": "mi68tws",
      "body": "as someone with religious trauma, absolutely no. If anything it just makes me feel more hopeless and depressed",
      "created_utc": 1742167568.0,
      "score": 1
    },
    {
      "id": "lt74tac",
      "body": "I am doing....as okay as it can be expected I guess. I am talking to people here to alleviate my loneliness so that's a plus haha",
      "created_utc": 1729615687.0,
      "score": 11
    },
    {
      "id": "lt8z22o",
      "body": "I require more information about pipe cleaner pumpkins.",
      "created_utc": 1729636339.0,
      "score": 8
    },
    {
      "id": "lt9jg87",
      "body": "Mine called me weak...smh. It's tough opening up to ppl and being made to feel less than.",
      "created_utc": 1729643453.0,
      "score": 2
    },
    {
      "id": "lt9yu9x",
      "body": "This is reaching out right now. Glad you're still alive",
      "created_utc": 1729648899.0,
      "score": 2
    },
    {
      "id": "ltbl3ll",
      "body": "Some people are robots .  They won't help you .  Sometimes if you want to fix things in your own life you have to do it yourself .  Without help , cheering , or support .",
      "created_utc": 1729680646.0,
      "score": 1
    },
    {
      "id": "ltl4zds",
      "body": "Many of our special peeps are not knowledgeable, help them understand.",
      "created_utc": 1729807375.0,
      "score": 1
    },
    {
      "id": "lt8flch",
      "body": "You’re here. If I can get my butt here and connect, I often feel better. Just getting out of my own head is a good thing.",
      "created_utc": 1729630059.0,
      "score": 2
    },
    {
      "id": "lvj4ke8",
      "body": "I'm sorry for your loss.\n\nI intended to write \"talk to parents\" but I know that can be a touchy subject as some don't have parents and some may as well not have any with a horrid time trying to explain depression to them. I made it broader to family because I have a really lovely sister who is incredibly understanding and I figure a sibling of a similar age is your best chance at being heard if every other avenue isn't working.",
      "created_utc": 1730818877.0,
      "score": 2
    },
    {
      "id": "lt9tj37",
      "body": "I don’t think they are supposed to do that during a session unless it’s to check the time or something important 🤨 that’s super unprofessional otherwise",
      "created_utc": 1729647003.0,
      "score": 10
    },
    {
      "id": "ltd7yq6",
      "body": "Report and/or change therapist. Not professional.",
      "created_utc": 1729701838.0,
      "score": 2
    },
    {
      "id": "lta0j81",
      "body": "[removed]",
      "created_utc": 1729649509.0,
      "score": 4
    },
    {
      "id": "ltd89nd",
      "body": "This is from Linkin park? Which song? Sharp edges?",
      "created_utc": 1729701928.0,
      "score": 2
    },
    {
      "id": "ltbryxs",
      "body": "[deleted]",
      "created_utc": 1729684064.0,
      "score": 4
    },
    {
      "id": "lt7hvyu",
      "body": "It’s super helpful when you’re overwhelmed and can’t seem to find a solution. It’s also a good way to focus on something.",
      "created_utc": 1729619709.0,
      "score": 2
    },
    {
      "id": "lt7zku0",
      "body": "Have you tried cutting paper or fabric instead of yourself? It can be even more satisfying because it won’t hurt until you can’t think.",
      "created_utc": 1729625206.0,
      "score": 1
    },
    {
      "id": "lt7uemb",
      "body": "I feel like there is hypocrisy for sure, but some people do have good intentions but can’t deliver. May it be time, personal struggles or other reasons. \n\nIdk, I’ve seen good people, so I know they exist, but I understand the feeling if you haven’t met anyone that fit the bill. \n\nSome people are absolutely not well intentioned and only say it to look better, it’s sad but im not mad. These people are also just trying to get by. Everyone is.",
      "created_utc": 1729623597.0,
      "score": 2
    },
    {
      "id": "ltl4hd2",
      "body": "Solutions don't make it easier.  Sometimes there are no solutions.  Sometimes, talking with other like minded peeps can help, even just a little bit. I, like so many others, am struggling.  I am open to discussion, questions and possibilities.  I am so negative yet open to the possibility of finding novel solutions, however diverse.",
      "created_utc": 1729807204.0,
      "score": 2
    },
    {
      "id": "lta6jbg",
      "body": "What would you like for people to say?  I ask bc my daughter has MDD and I am at a loss as to what to say. I love her more than myself, I promise you.",
      "created_utc": 1729651717.0,
      "score": 3
    },
    {
      "id": "ltc1yd3",
      "body": "Why not explain the issues to a therapist? Someone who is actually trained in these areas. They will 100% be able to help you a lot more than some random person who is not trained to help in these areas.",
      "created_utc": 1729688228.0,
      "score": 1
    },
    {
      "id": "ltck73g",
      "body": "I have spoken with at least ten therapists since I was a teenager and none of them ever said a thing that made me feel better… but thanks. They are also only there because they’re getting paid to.",
      "created_utc": 1729694538.0,
      "score": 6
    },
    {
      "id": "ltrifch",
      "body": "Many people just can't afford therapy, it's never a cheap thing. In my country therapists charge more than an average daily wage for an hour. And there's not many really good therapists around. Some can even make you worse or dump you in the middle - all for your money.",
      "created_utc": 1729897580.0,
      "score": 2
    },
    {
      "id": "lt8ijj9",
      "body": "[removed]",
      "created_utc": 1729630925.0,
      "score": 70
    },
    {
      "id": "ltaptt2",
      "body": "My best friend cut me off too when I tried to talk to her about my feelings and just reach out for a little support or thought maybe just someone to listen. People just suck.",
      "created_utc": 1729660528.0,
      "score": 19
    },
    {
      "id": "ltb5mtl",
      "body": "My best friend in college also cut me off because her mother was severely bipolar and she said being around me was too difficult. We had been sharing an apartment for two years and one day she just told me she was moving out and left. I had to find a new place to live with a new roommate while dealing with all these feelings of losing my best friend. Pretty much all of our mutual friends went with her so I lost everyone and was totally alone. I ended up falling in with some bad people and doing a ton of drugs. Then dropped out of university. I don’t think I ever recovered from that. Soon after I started dating my now ex husband who was incredibly abusive and used to play all sorts of mind games. He knew about my mental illness and would use that to mess with me. I’ve been alone for four years now. No friends, I don’t date. I don’t think I will ever be able to trust another human being ever again. Pretty sure I’ll die alone and depressed.",
      "created_utc": 1729670539.0,
      "score": 7
    },
    {
      "id": "lta2s2y",
      "body": "Are you me? Because same. I’m not kidding (wish I was). My Mom does the same sh*t meanwhile all three of her daughters have attempted multiple times, one came very close (me) and the other succeeded and died in 2017. She loves the attention and pity she gets for her death and it honestly makes me sick. She treated her and us like trash, constantly invalidating our emotions and needs especially as little girls who needed guidance. Your Mom sounds the same way 😔 Emotionally unavailable and potentially narcissistic. They don’t know how to be an honest person. They put on a front and love making themselves look like this great person on paper and social media but when you actually need them to be this person for you… 🦗 nothing. I’m like you in that I’d rather someone just be honest with me if they can’t or don’t want to be there for me on an emotional level when things are tough. An honest a**hole is better than a fake sweetheart any day of the week.",
      "created_utc": 1729650340.0,
      "score": 12
    },
    {
      "id": "mal29o2",
      "body": "Life is inherently neutral there is no inherent misery of life. It’s up to you make it what you want and a life that you enjoy living, no one is going gonna do it for you.",
      "created_utc": 1738517256.0,
      "score": 1
    },
    {
      "id": "luthufm",
      "body": "Winning the lottery may not help your mental state , but it would really help mine .  That's all I need .  My mental ailment now is caused by a lack of money .  But it's different for every person .  I don't know what it would take to give you the help you need .  But by not giving up you increase your chances of receiving it , living a better life , etc .",
      "created_utc": 1730441619.0,
      "score": 1
    },
    {
      "id": "lt75kxz",
      "body": "That's good! I'm proud of you for reaching out and I appreciate it. Been trying to do the same.",
      "created_utc": 1729615918.0,
      "score": 9
    },
    {
      "id": "lt9c1ti",
      "body": "Haha I love that you asked about that. It's so fun and easy! \n\nhttps://youtu.be/Gpw5LD09tDE?si=qp_cGRXsycDDjA08",
      "created_utc": 1729640876.0,
      "score": 1
    },
    {
      "id": "ltb7f81",
      "body": "Be here now. Stay connected at least online. Don't isolate. :)",
      "created_utc": 1729671785.0,
      "score": 1
    },
    {
      "id": "ltk2pis",
      "body": "I can't tell if she is looking down at her keyboard typing or her phone. I'm usually in the middle of dumping so I don't want to lose my train of thought since I pay good money to be ignored",
      "created_utc": 1729795636.0,
      "score": 1
    },
    {
      "id": "ltbnkt8",
      "body": "It would be nice if people could see it through your eyes .  People are often not that nice .  Maybe they think they would be being \" too nice . \"",
      "created_utc": 1729681962.0,
      "score": 1
    },
    {
      "id": "ltla3sp",
      "body": "[deleted]",
      "created_utc": 1729809158.0,
      "score": 1
    },
    {
      "id": "ltdret6",
      "body": "Given Up by Linkin Park. Though I do absolutely love their last album before Chester left us - so many songs resonate with the struggles of existing on this planet for me.",
      "created_utc": 1729707691.0,
      "score": 5
    },
    {
      "id": "lt82oc2",
      "body": "I have and really not the same. Pain kinda makes me feel like im actually there instead of just watching my life throught my eyes iyk what i mean",
      "created_utc": 1729626152.0,
      "score": 1
    },
    {
      "id": "ltaqmtq",
      "body": "It's a hard one if you haven't been through the same or similar things, that's where psychology helps, they know how to respond to issues. \n\nCould just be me but I feel it's tough to talk to a parent about it, but everyone is different. \n\nJust listening is a big thing. which is the easy part I guess, and the response you give in return can either show that they actually listened to you, or they are lost in what you're trying to get out.",
      "created_utc": 1729660972.0,
      "score": 9
    },
    {
      "id": "ltbkomz",
      "body": "\" I'm here to listen .  I may not always understand but I will try . Because I care . \"",
      "created_utc": 1729680417.0,
      "score": 5
    },
    {
      "id": "lugdgap",
      "body": "I’m sorry that you and your sisters have had to deal that and so sorry for your loss. I think you’re right I’ve been saying I see narcissistic ways. And you’re so on point with the image. They are angels to the outside but once they’re home it’s a completely different story. The emotional unavailability is a killer man. I grew up suffering because of it. And if I’m honest it still gets to me now.",
      "created_utc": 1730252887.0,
      "score": 1
    },
    {
      "id": "malrwt1",
      "body": "Not true. Many people, through bad luck or social conditions, are predisposed to misery. You can help that with good decisions, but there's no guarantee. ",
      "created_utc": 1738524184.0,
      "score": 1
    },
    {
      "id": "luvf8yw",
      "body": "I'll be honest, money would definitely help a lot of people. Unfortunately, the world we live in has been specifically designed to starve those people of money and options so that others can hoard them. ",
      "created_utc": 1730475676.0,
      "score": 2
    },
    {
      "id": "lt75rat",
      "body": "I see that's good I suppose.",
      "created_utc": 1729615971.0,
      "score": 9
    },
    {
      "id": "ltlfhjm",
      "body": "[removed]",
      "created_utc": 1729811063.0,
      "score": 1
    },
    {
      "id": "lthd9l5",
      "body": "One More Light was amazing.\n\nIt's one of my favorite songs. And albums.\nThe song itself looked like a spin of iridescent and leave out all the rest, which was my previous favorite.",
      "created_utc": 1729758997.0,
      "score": 2
    },
    {
      "id": "ltbp9xv",
      "body": "Thank you for responding.  Any advice helps.",
      "created_utc": 1729682802.0,
      "score": 1
    },
    {
      "id": "ltbpha5",
      "body": "Thank you for responding, advice really helps.",
      "created_utc": 1729682900.0,
      "score": 3
    },
    {
      "id": "man3zzk",
      "body": "And those same people can lift themselves out from that “predisposed misery”. Trust me man it’s so very possible even in those conditions. Of course it’s not guarantee but there’s almost a beauty in that, for example there is no guarantee in being born either I imagine you’ve seen the statistics and chances due to sperm count.\n\nI have nothing to sell you, I just don’t want people like you wasting this time of life because they think their self prophecy is being “predisposed to misery”.",
      "created_utc": 1738538353.0,
      "score": 1
    },
    {
      "id": "ltx8meq",
      "body": "No problem",
      "created_utc": 1729982443.0,
      "score": 1
    },
    {
      "id": "mco7fid",
      "body": "I'm not saying give up on life. In fact, the comment before yours above was precisely an indication of how I deal with life throwing turds at me. Having fun. Or trying, at least. That's what life is about. Having fun, and trying to facilitate your ability to have fun. It's hard, because life isn't very conductive to fun, but it's worth trying, more than any of the empty crap people force into the brains of adults and kids.\n\n\nBut life is inherently miserable. We're born crying, from crying women who's pelvises are barely large enough to get a baby's head out. We develop through at least thirteen years of exceptional physical and mental vulnerability, during which even competitively minor events, like seeing two people fight, can severely affect you mentally. Then, as adults, we're forced to struggle and climb to the top of one of a huge number of social and economic ladders, and by the time you're at the top, or at least on a rung you can rest on until you die, you're high-strung and suffering from multiple physical problems. The lucky people who scamper to the top, or sometimes were born there, do little but shake the ladder telling you it's for your own good. The unlucky ones fall down into the muck of poverty, homelessness, drug addiction, and other assorted forms of misery. In short, life is hard. Especially for a human mind, which can comprehend how challenging these things are and reflect on them, and lament on all of the times they've failed, been fucked over, or just been unlucky. That's why religions are created promising a better life after this one. People want a better life, and telling them that they'll get one at the end, as long as they pay the fee, is very marketable. But life is miserable. That's why escaping life is paramount. Whatever you choose to escape with, as long as you're not harming anyone, do it. But also keep trying to improve your life outside of scaping it. Because the only thing you can do at the bottom of the ladder is try to keep climbing, even if people above you are throwing rocks and nails on you. \n\n\nJesus, that got excessive. ",
      "created_utc": 1739503413.0,
      "score": 1
    }
  ]
}