{
  "id": "1hs35w3",
  "title": "I don’t feel like I’m made for life",
  "selftext": "The idea of working my whole life until I’m weak and then die doesn’t sit well with me. And don’t give me the whole “that’s life we have to deal with it” or “start your own business” bullshit either cause I’m not interested in that. I hate that living in this world depends so much on making money just to simply exist. Not only that, we have to gain approval from other people to succeed in life, wether it’s a hiring manager for a new job, an application to college/university, approval from a potential romantic interest. We can’t simply wake up one day and say “I wanna do this”. We are always somehow controlled by others. Like I’m just not made to fit into this society, every career option doesn’t interest me, opening a business doesn’t either. But what about “doing what you love”? Yeah if I can make money by watching movies, playing video games, sleeping, travelling, going out with friends then yeah happy life, but no those are not things that give you money, just things you do in your free time. And the fact that the only ways I can do what i love is by making money working at a job I don’t care about for the rest of my life just so I can have fleeting moments of happiness during weekends or a couple weeks of vacation.\n\nAll to say that I’d rather not even exist than endure this fucked up society and have to work for the rest of my life while only having small moments of free time to do what I love",
  "created_utc": 1735848783.0,
  "score": 1061,
  "num_comments": 137,
  "url": "https://www.reddit.com/r/depression/comments/1hs35w3/i_dont_feel_like_im_made_for_life/",
  "comments": [
    {
      "id": "m52zsce",
      "body": "That's me. I don't know if other people can live this, but I can't.",
      "created_utc": 1735856636.0,
      "score": 192
    },
    {
      "id": "m53ydqu",
      "body": "I feel you so much, life is such a shit show",
      "created_utc": 1735867600.0,
      "score": 124
    },
    {
      "id": "m542ort",
      "body": "literally me right now. i wish i had advice i could give you",
      "created_utc": 1735869089.0,
      "score": 92
    },
    {
      "id": "m54b6z9",
      "body": " I feel much the same way. I don't think there's anything for me in this world as someone who doesn't enjoy laboring and isn't highly social or gifted. Just a lot of monotonous work and discomfort just to survive until it's all over.",
      "created_utc": 1735872109.0,
      "score": 86
    },
    {
      "id": "m54xmpt",
      "body": "I don't even know that it's deppression or laziness that makes us think like that. \nI just want to sleep forever",
      "created_utc": 1735880893.0,
      "score": 82
    },
    {
      "id": "m54xqpx",
      "body": "I know exactly what you mean. I don't believe anyone has control of their own life either. It all depends whose around you (family/siblings/friends), where you're born, you're gender, laws, the way your treated just shapes who you are. Which is what I hate about life because of how extremely unfair it is. Honestly fuck living",
      "created_utc": 1735880942.0,
      "score": 51
    },
    {
      "id": "m55s3su",
      "body": "Exactly. 9-5 for five days a week, for two days of weekend. For practically the rest of our lives until we retire at 65. \n\nI want to go to sleep tonight and never wake up.",
      "created_utc": 1735898122.0,
      "score": 32
    },
    {
      "id": "m55guz5",
      "body": "I feel the seme bro.  40 years  old,  nothing interst me anymore.\n\n\n\nWhat to do ¿?????",
      "created_utc": 1735890983.0,
      "score": 19
    },
    {
      "id": "m54uusg",
      "body": "I can relate to this. I don't understand how others cope so well with this unfreedom. You are born and at the age of 4 they send you to school. I hated school. I hated being imprisoned for 6 hours a day. I hated being forced to socialise with other kids. I hated having to listen to teachers.\n\nHigh school was even worse. I hated every single one of those glorified prison guards called teachers. High School was so boring it was unbearable for me without taking drugs. \n\nI had no idea that working would be a hell of a lot worse even. I hate being forced to go to a place and work 8 hours a day to afford to live. I hate it with a passion. \n\nHating to work makes it hard to have a career. No career equals limited choice in partners. Again if I want intimacy I need to do things I don't want and be with partners that I don't want. I'm not good looking and I don't have a career, neither do I have goals, all of this reduces my sexual market value to basically 0 and I have to be with women I neither find attractive nor funny nor interesting.\n\nNothing in this life was ever my choice. I was always forced to choose between alternatives that i hated. I don't know how others find this life even remotely interesting and have a zest for life.",
      "created_utc": 1735879697.0,
      "score": 69
    },
    {
      "id": "m56c24l",
      "body": "I feel this post so much right now. The only thing I’m “happy” about is to see that others here have a similar mindset, so I do not feel like as much of an outsider. How will we survive working just to make the dollars so we can have some fleeting moments of happiness? Almost every night, I pray/wish to die in my sleep, so I do not have to live through this life that I don’t want anymore. Thanks to all who have offered feedback on this thread. I hope you all find some moments of laughter and happiness.",
      "created_utc": 1735909142.0,
      "score": 12
    },
    {
      "id": "m579r29",
      "body": "I feel this so hard. Depression, and anxiety have plagued me much of my life. It’s easy for me to say because I’m retired and have time on my hands, but what has worked well for me is finding joy wherever you can. It could be nature, a beloved pet, or anything that interests you, but it is essential. Also, exercise. I understand that it can be hard to find the time, but it will be worth it. The goal for me is to get my heart rate high enough that my brain releases the “feel good”endorphins. I hope this helps. We are living through very challenging times. It’s the worst I’ve seen in my life, but I’m more determined than ever to still find joy, and peace.",
      "created_utc": 1735921181.0,
      "score": 10
    },
    {
      "id": "m55hmsn",
      "body": "Absolute truth man.. I like playing piano and drums and I am struggling to make a living doing that.. the only way I can survive is doing a mediocre job that I suck at and hate.. and only to just make ends meet and have 2 days off where I have to catchup with other life matters such as laundry, cooking,cleaning and grocery shopping. I am saving nil..Nada..nothing .. why are we even alive and what is this shit.??",
      "created_utc": 1735891461.0,
      "score": 20
    },
    {
      "id": "m57fxr8",
      "body": "Depression is just the realisation that life is full of suffering that is ultimately pointless.",
      "created_utc": 1735923053.0,
      "score": 9
    },
    {
      "id": "m54fhq6",
      "body": "resonates a lot.",
      "created_utc": 1735873650.0,
      "score": 17
    },
    {
      "id": "m57b33k",
      "body": "It would be so cool to sit with like minded people together around a camp fire and talk about life. I have a gut feeling that those kind of bonds will pull many of us out from the darkness.",
      "created_utc": 1735921590.0,
      "score": 8
    },
    {
      "id": "m56z5pq",
      "body": "This is why I literally don't like people.",
      "created_utc": 1735917851.0,
      "score": 6
    },
    {
      "id": "m55jjyv",
      "body": "I feel the same way",
      "created_utc": 1735892671.0,
      "score": 4
    },
    {
      "id": "m55t6ki",
      "body": "i don't think I'm made for life either, though i know things will get at least better if i find a job. but i have very little hope about it. and I'm still scared that I'm gonna have to go through years and years of life while constantly thinking this isn't worth it and I'd rather die. i think i could settle for a job and only week ends or bits of week days of happiness as long as i get money every month. there's still ways things can get better for me.",
      "created_utc": 1735898801.0,
      "score": 4
    },
    {
      "id": "m55yixv",
      "body": "bro you just summed up my whole thoughts",
      "created_utc": 1735902075.0,
      "score": 4
    },
    {
      "id": "m54j6ec",
      "body": "You are made for life. I know that, because you are here. That’s all it takes for a life. Too many struggle to find some theory of purpose in life while missing that they’ve already achieved it. Existing is it. Run around, meet cool people, see cool shit. That’s it. You didn’t ask to be here; why would you accept some curriculum, timeline, and system of judgement about anything you chose to do?\n\nI understand that the Orphan Crushing machine is in full effect and hard to avoid. So, learn the system, find the flaws, exploit the cracks for yourself and everyone around you. These greedy bastards are not as clever as they want you to believe and you have way more options then they want you to realize.",
      "created_utc": 1735875013.0,
      "score": 17
    },
    {
      "id": "m55ouh2",
      "body": "I understand how that makes you feel and I feel the same way more often than I would like to,but people you love,things you haven't done yet,moments of greatness are worth living for,I'm telling you,even if I don't admit that during the worst of times.It is what keeps me going,and I hope you will find something that makes you feel that life is not an eternal shitshow we sometimes believe it to be.",
      "created_utc": 1735896045.0,
      "score": 3
    },
    {
      "id": "m55xxui",
      "body": "I relate to this on so many levels, I’m glad I’m not the only one that feels this way.. life is shit for real…",
      "created_utc": 1735901724.0,
      "score": 3
    },
    {
      "id": "m57cmxf",
      "body": "I think feeling this way is completely rational when you consider that we live under an incredibly expensive economy combined with a job market where good paying jobs are scarce and oversaturated, and most jobs are garbage low salary/ low hourly wage jobs, and higher education is behind a massive paywall, it really does look like we've been set up to fail in my opinion.\n\nThis is where society ends up when people spend the last 50 years voting for the \"lesser evil.\" The previous generations did absolutely nothing to ensure that they left the world a better place than when they inherited it.\n\nThey broke a social contract that has held civilization together for Melenia, and it will never be acknowledged, because it was never important to them.\n\nThat is why life hurts so much for us.  I think your feelings are not only valid, but I also think you have to be insane to not feel this way. Life isn't supposed to be anything like this.",
      "created_utc": 1735922062.0,
      "score": 3
    },
    {
      "id": "m57ub8a",
      "body": "I always loved fight club. “We’re working jobs we hate for shit we don’t need”. I guess my answer was to put as little effort as possible into working. I don’t mind working but I will not be overworked, stressed out by or continue to do work I cannot stand. My favorite work is where I can wear headphones or get away with hiding them. I won’t do it because I feel like it’s all so that you can buy stuff to impress other people. I just don’t buy all that stuff. All I can tell you is don’t have kids. That’s being sentenced to slavery for the rest of your life. Be content with less and be ready to joke about anything at anytime. If you can laugh at your situation it’s not so bad. I work at the library. It’s not hard, it’s pretty unstressful and I happen to have a boss who treats humans like humans. It’s not a perfect life but I feel like it could be so much worse (work wise anyway).",
      "created_utc": 1735927340.0,
      "score": 3
    },
    {
      "id": "m58gino",
      "body": " THIS IS SO REAL , it bugs me every single fricking day . I dont think it is even depression at this point, rather being awake to the ridiculous reality of it all.",
      "created_utc": 1735933886.0,
      "score": 3
    },
    {
      "id": "m59jjfc",
      "body": "I never felt a statement so hard. I’ve felt like this for years and I’m almost out of my will to keep on fighting this losing battle.",
      "created_utc": 1735946041.0,
      "score": 3
    },
    {
      "id": "m5gt5h0",
      "body": "I agree with everything you wrote. I to feel the same damn way all the time.\nYou work or have some type of income to pay bills, take care of yourself or family. You can't really spend your money like you want to cause you have to pay bills.\n\n\nLife and the world is really unfair.\nThe 'Big Orange Clown' will be the president again. Which I don't  understand that at all for the life of me.\nHe cheated his way into office the first time, and again. He's a criminal he's every bad thing in the book.\n\n\nThere's so many homeless people in the world. Rich as this whole country is nobody should be homeless or poor.",
      "created_utc": 1736048326.0,
      "score": 3
    },
    {
      "id": "m55e5j3",
      "body": "this is too relatable. i wish i can give advice but i am in the same boat",
      "created_utc": 1735889351.0,
      "score": 4
    },
    {
      "id": "m53rg8p",
      "body": "Oh...you sound like me. That's a little scary. Hey, I know this is gonna come off as like self help optimistic bulshit but--life is worth living, ok? I know you aren't like making any plans here or any ideations but I know this and how it is to live with it. It sucks. It's numb and pretty god damned degrading tbh, but there is softness in this life and something needs to experience it. You are enough.",
      "created_utc": 1735865307.0,
      "score": 8
    },
    {
      "id": "m56l7gu",
      "body": "i feel the same way. so out of place in the world and unsure what to do.",
      "created_utc": 1735912920.0,
      "score": 2
    },
    {
      "id": "m56mfnu",
      "body": "Its like if they threw you in outer space on a different planet. You'd have to farm, water your own pants, harvest them, wash them, cook them. Rinse and repeat. Basic survival. But alot of that has been taken over for us and the only thing were expected to do is give someone money. Life gets even easier if you have even more money. And that seems to be the universal goal which isn't for everyone. Sometimes I really do want my own plot of land to grow my own food and live off the grid. But it's not easy to survive. No one gets out of this life that easy.",
      "created_utc": 1735913393.0,
      "score": 2
    },
    {
      "id": "m59dy1l",
      "body": "fuck man i feel you. give me a hug bro",
      "created_utc": 1735944191.0,
      "score": 2
    },
    {
      "id": "m59w7fo",
      "body": "I wish i had the guts to kill myself and end it all",
      "created_utc": 1735950307.0,
      "score": 2
    },
    {
      "id": "m5b0v2o",
      "body": "I feel you—this system isn’t built for universal human happiness. Your worth is so much more than what society demands of you.",
      "created_utc": 1735965264.0,
      "score": 2
    },
    {
      "id": "m5b4uza",
      "body": "This is literally me. The older I grow, the harder it is to handle this. I might kms anytime soon",
      "created_utc": 1735967018.0,
      "score": 2
    },
    {
      "id": "m5btpul",
      "body": "I’ve started to see other people as very alien recently. I don’t feel like I belong among other people, yet my stupid human brain craves social interaction.",
      "created_utc": 1735980711.0,
      "score": 2
    },
    {
      "id": "m5bvyna",
      "body": "Honestly I am between wanting to just say fuck it and watch stuff on tv all day,everyday and wanting to be an inventor of the next lightbulb or something. Really though, I am just another cog in the machine like most of us are.",
      "created_utc": 1735982157.0,
      "score": 2
    },
    {
      "id": "m5bym5v",
      "body": "Very relatable.",
      "created_utc": 1735983875.0,
      "score": 2
    },
    {
      "id": "m5gish7",
      "body": "This is very relatable! I’d love nothing more than to run off and travel the world and experience those fleeting moments of happiness. But instead I girl bossed my way into a job I hate peopling too much for my bare thread of sanity that I am so burnt out to enjoy my brief weekends off. \n\nRunning away from home sounds amazing!",
      "created_utc": 1736044589.0,
      "score": 2
    },
    {
      "id": "m5n00dg",
      "body": "This is exactly how I feel. I feel like what does it say about me that I want to be happy living my life rather than selling away my time to buy shit? What happened to us as a species where we sold off our passions in order to rank and order each other for exploitative purposes? Fuck…",
      "created_utc": 1736133125.0,
      "score": 2
    },
    {
      "id": "m5nvofv",
      "body": "I feel the same and it is making me so depressed.",
      "created_utc": 1736147058.0,
      "score": 2
    },
    {
      "id": "m6683ob",
      "body": "Can't take it much longer, either.",
      "created_utc": 1736395586.0,
      "score": 2
    },
    {
      "id": "m54yc0y",
      "body": "Gotta find a purpose outside of work or do what you love for work. Gotta make the best of it and only you can make those changes\n\nThere are ways to make money doing the things you mentioned. Look at all the travel vlog channels on YouTube. Nothing about this life is easy. If you have your health you're already 10 steps ahead of many people",
      "created_utc": 1735881205.0,
      "score": 3
    },
    {
      "id": "m56xshm",
      "body": "This is the main reason I want to kill myself. Doesn’t seem like there’s much choice. ",
      "created_utc": 1735917401.0,
      "score": 1
    },
    {
      "id": "m57by63",
      "body": "I totally understand. Woke up crying today because I just can’t do it anymore. Didn’t think my 30s would be like this and it’s honestly depressing. I only work to be able to afford to travel but even that isn’t helping anymore. I feel depressed and having a chronic condition isn’t helping. I get like three days a month to call off for flare ups but if I use them I’m broke. It seems never ending. Assholes get promoted to the top. I just get used for my work ethic. It’s all messed up.",
      "created_utc": 1735921853.0,
      "score": 1
    },
    {
      "id": "m57lvdu",
      "body": "What should we do, OP? I am like you but the more I look around me, the more I realize a lot of people are not like us and willing to pretend. When do we wake up and enact change in society?",
      "created_utc": 1735924839.0,
      "score": 1
    },
    {
      "id": "m58b2ov",
      "body": "Agreed, I can't believe how fast my mental health tanked when I started working full time. I haven't recovered since.",
      "created_utc": 1735932270.0,
      "score": 1
    },
    {
      "id": "m58w0sf",
      "body": " we are not born with purpose. our point in life is to create purpose but it’s hard when we’re forced into have a purpose such as work 24/7. I understand you. you can do anything that you put your mind to. anything is not impossible. do things that make you happy. I know it’s hard financially but what’s the point trying to stay aligned with the system if you’re not happy? isn’t that the whole point in life, to be happy.",
      "created_utc": 1735938624.0,
      "score": 1
    },
    {
      "id": "m58zdgh",
      "body": "I don't think humans are evolved enough for the current society. It's just all to much.",
      "created_utc": 1735939645.0,
      "score": 1
    },
    {
      "id": "m590v1o",
      "body": "i get that.  i myself have anhedonia and don't even really enjoy anything.  my depression isn't debilitating anymore ( i still wish i was never born and plan on booking out in half a decade or so, but i can get out of bed and even do a thing or two just fine most days), but i'm just like... what's the point?\n\ni'll go to college, try and probably settle for some job that i can hopefully just... tolerate.  i've worked very hard as an AP student and was one of the top kids in my grade level... all for what?  and then later on i'll just slave away at my job.  i'll get back home and... do what exactly?  \n\nfor me, life is just.. tolerable.  but pointless.  i don't get why i should have to continue.  i try to avoid looking too much into the future anymore because it doesn't seem like there's much i can do about it anyway.",
      "created_utc": 1735940100.0,
      "score": 1
    },
    {
      "id": "m5b66av",
      "body": "that's so fucking real. I don't know how to do this, or how to ignore it. most people seem to be fine with life sucking about 99% of the time just because there's the 1% when it doesn't, but I can't.",
      "created_utc": 1735967613.0,
      "score": 1
    },
    {
      "id": "m5koa5z",
      "body": "Sometimes I feel like just working to get enough money to support rent and groceries and food for 3 months and then spend 2 months just playing games ,binge watching tv shows and eating whatever I want to and at the end just not exist . In this way I lived with all the fun I can get and then skip all the suffering I would have gotten in the future. I wish I could change my view about this in the future but right now this just feels simple ",
      "created_utc": 1736106842.0,
      "score": 1
    },
    {
      "id": "m5qaumo",
      "body": "Yeah inget that so so so much my soul is jist to tired to keep up with everything i often think depression means we need deep rest from this world to just live and be free in our true authenticity.",
      "created_utc": 1736185918.0,
      "score": 1
    },
    {
      "id": "m6ak30x",
      "body": "Realistic and relatable in so many ways. 😩 I just don’t have any hope.",
      "created_utc": 1736457660.0,
      "score": 1
    },
    {
      "id": "m95rf2f",
      "body": "I feel the same way too, and worrying about life just gives me sleepless nights.",
      "created_utc": 1737840801.0,
      "score": 1
    },
    {
      "id": "m55t896",
      "body": "Life is great... i'm depressed for the same reason (wouldn't be here without it tho)  \nBut the POTENTIAL in Life is far greater than the Wish to non exist..  \nThe only way what I see is hard to find people who think like you, who are like minded..  \nYou can't change the world all by yourself.. if you are a dreamer, find people who are dream the same dream with you.",
      "created_utc": 1735898830.0,
      "score": 0
    },
    {
      "id": "m55toci",
      "body": "All comes down to our being bombarded with things that stunt our growth early on and continuously, \"cattle herding\"  and mind fuckery.",
      "created_utc": 1735899103.0,
      "score": 15
    },
    {
      "id": "m57g394",
      "body": "Depression is just the realisation that life is full of suffering that is ultimately pointless",
      "created_utc": 1735923098.0,
      "score": 40
    },
    {
      "id": "m55olnz",
      "body": "Sleeping forever is a much better option than this shit show called life",
      "created_utc": 1735895889.0,
      "score": 44
    },
    {
      "id": "m55q6ld",
      "body": "Laziness has been in question lately in psychology studies. I have been reading a lot about this. I too have this issue. And feel the EXACT same as OP. \nThe world is shitty and getting shittier. \n\n The bank owners and other multi big business conglomerate people, ceo's, board of directors people, etc.. the real decision makers, I have always felt since I was little, keep us lethargic, consuming and stupid on purpose. The latter is no secret either, it's just not on blast so many don't know or care about it.\n\n John d. Rockefellar, \"nation of workers\" motto for the school board of education who created/s the public school system/ curriculum for the entire country.\n Why has it not been updated to actually boost our progression as a society and as intelligent human beings, which would surely negate so many current issues like mental health and addiction??\nWho's to say that no one was/ is on that same page who runs big business in another form of something else we use or consume daily?\n Look at all the products we use. All the harsh chemicals. People don't even realize the stuff in shampoo, deodorant, clothes detergent, cars, gas stoves, microwaves, etc, the list is terrifyingly continuous.\n\nCANDY and ANYTHING WITH FOOD DYES (NOT THE SUGAR) is the WORST of the WORST too. Like as bad as smoking cigarettes, the way food dyes stunt a child's growth on SO many levels with extreme adverse effects (that people now give their kids medication for)..\nIt's crazy cuz people give it to their kids CONSTANT. Thinking it's ok or not that bad because of \"tradition\"?! \nThat's messed up on so many levels.\nThere are so many of us who do recognize the wrongness of things EVERYWHERE (sadly killing the planet) we see where the river runs and it trickles, not surprisingly, right down to the extreme greed of a few rather than the \"laziness\" of millions.. \n\nfood for thought.. pun intended since that's pretty much the start of our demise is in the womb due to all the shitty food that lie about their shitty ingredients so we don't even get the damn chance to even develop properly.. *taking a breathe 😂😁\nAll of it is such a mind fuck. \nPeople have resorted to believing none of it is even real!\nJust wow! \nLots of movies have it right though.. Wall-E, Idiocracy, Mad Max. It's gonna be all that mixed together. I feel bad for the kids being born right now. They're gonna have a lot on their hands.",
      "created_utc": 1735896899.0,
      "score": 20
    },
    {
      "id": "m57c59q",
      "body": "Your retirement age is 65?",
      "created_utc": 1735921913.0,
      "score": 3
    },
    {
      "id": "m55supk",
      "body": "Same.. there are A LOT of us.",
      "created_utc": 1735898593.0,
      "score": 6
    },
    {
      "id": "m5vtkdr",
      "body": "Do you have a partner? ",
      "created_utc": 1736263575.0,
      "score": 1
    },
    {
      "id": "m55pmkp",
      "body": "That’s definitely something I think about when it comes to partners. It’s like you see all these couples that love life, career oriented people, they’re ambitious and I’m none of those things. What makes another person want to be interested in me if I have these thoughts about life.",
      "created_utc": 1735896545.0,
      "score": 15
    },
    {
      "id": "m56mc0r",
      "body": "You’re right, I’m happy I’m not alone with these thoughts, but I still feel like an outsider, everybody I know carries on with their lives like nothing is wrong, talking about their career progress, their love lives, plans to buy a house despite rising costs and I just really don’t fit into how they think",
      "created_utc": 1735913354.0,
      "score": 6
    },
    {
      "id": "m57f8w5",
      "body": "Thank You for showing up here with your contribution. I'm lost now because all the small pleasures have vanished. Somehow I think your words put me back in the right direction.",
      "created_utc": 1735922847.0,
      "score": 3
    },
    {
      "id": "m57xg6p",
      "body": "Remember baby steps, and small goals.",
      "created_utc": 1735928268.0,
      "score": 1
    },
    {
      "id": "m58ffka",
      "body": "Pet is the only thing that helps untreated depression is literally sucking the life out of me. I workout eat very well avoid alcohol !!!! \n\nDoctors only treat one thing I have adhd and just exhausted all the time how can you “fight the depression “ when you are zapped !!!! I’m 62 and so tired of the rat race of doctors of that last 26 years. !",
      "created_utc": 1735933566.0,
      "score": 1
    },
    {
      "id": "m58fkj3",
      "body": "Not asking for perfection but improvement !!!! Winter sucks",
      "created_utc": 1735933607.0,
      "score": 1
    },
    {
      "id": "m5m95d6",
      "body": "Nature is being ruined, pets die, and what I used to enjoy is getting worse and worse.",
      "created_utc": 1736124139.0,
      "score": 1
    },
    {
      "id": "mpc81lk",
      "body": "Nothing seems to help at all,I just can't shake the constant thoughts of wanting it to end, wishing it was a over with ",
      "created_utc": 1745772951.0,
      "score": 1
    },
    {
      "id": "m55t4qu",
      "body": "We're alive to lethargically consume so to continuously generate the longevity and prosperousness of the few greedy assholes that run this big circle jerk farm of fuckery.",
      "created_utc": 1735898770.0,
      "score": 11
    },
    {
      "id": "m57l54g",
      "body": "Couldn’t have said it better myself",
      "created_utc": 1735924619.0,
      "score": 2
    },
    {
      "id": "m5kn93j",
      "body": "Does that mean people without depression just haven't realised the truth . If so then ignorance is bliss",
      "created_utc": 1736106545.0,
      "score": 1
    },
    {
      "id": "m5ojax9",
      "body": "this would be so nice :)",
      "created_utc": 1736162103.0,
      "score": 2
    },
    {
      "id": "m5763vi",
      "body": "People suck indeed",
      "created_utc": 1735920055.0,
      "score": 4
    },
    {
      "id": "m5628q5",
      "body": "You literally need money to be able to live. It's not a choice where you can just pop around travelling and doing cool shit, that's just not how it works.",
      "created_utc": 1735904224.0,
      "score": 13
    },
    {
      "id": "mpc97u0",
      "body": "Same here, seems pointless ",
      "created_utc": 1745773303.0,
      "score": 1
    },
    {
      "id": "m56ndcn",
      "body": "Yes that is indeed basic survival and money will always be something that comes eventually. All I’m saying is that there’s something wrong with this human existence and i don’t wish to be part of this fucked up cycle that’s causing depression and mental health issues to a lot of people around the world, homeless people everywhere and nobody does anything about it, rising costs of housing and everybody thinks it’s normal, social media destroying people’s minds",
      "created_utc": 1735913746.0,
      "score": 1
    },
    {
      "id": "m5cnhjv",
      "body": "Hug",
      "created_utc": 1735997932.0,
      "score": 1
    },
    {
      "id": "m5zpccu",
      "body": "Don’t let that darkness in, don’t let the world and society win. You are stronger than you think you are. I know that’s said a lot but it’s true, it’s fact. ",
      "created_utc": 1736306606.0,
      "score": 2
    },
    {
      "id": "m5cn9cz",
      "body": "I felt like that when we had a work conference call and it was about a new software that’s gonna be integrated or whatever the fuck and I’m just sitting there like “what the fuck are we doing? How is this human? Why do we care so much about whatever this is?” Everything just feels pointless",
      "created_utc": 1735997834.0,
      "score": 1
    },
    {
      "id": "m55ov2x",
      "body": "What if that’s what makes life so tiring? The fact that life’s hard to even just exist? I find something clearly wrong with this world and this is life, but I’ll always be thinking life should NOT be like this. That’s why I think not existing is the better option",
      "created_utc": 1735896056.0,
      "score": 15
    },
    {
      "id": "m57d8zt",
      "body": "HEALTH",
      "created_utc": 1735922246.0,
      "score": 2
    },
    {
      "id": "m55smtc",
      "body": "Even though your first and second sentence made me want to punch something. (That statement has always made me feel lost since teenager)\nYOU'RE COMPLETELY CORRECT IN THE FOLLOWING SO REALLY ALL OF WHAT YOU SAID IS A FULL ON YES. \nSaying this because now that I'm 43, I see how quickly health can deteriorate. \n\nAnd the \"fleeting moments of happiness\" OP mentioned is all life really consists of if you think about it. Best do what we can while we can to make those occur as MUCH as possible. \n\nThat statement is a much needed thing to hear and adhere to.",
      "created_utc": 1735898456.0,
      "score": 0
    },
    {
      "id": "m57mq7h",
      "body": "That’s the problem, I think majority of the world are willing to pretend or they genuinely think that everything in this life is normal when it really isn’t. Unfortunately I think we are in the minority for having these thoughts",
      "created_utc": 1735925095.0,
      "score": 2
    },
    {
      "id": "m5cnf1i",
      "body": "Like how the fuck have we, as human beings, allowed this to happen? It honestly boggles my mind",
      "created_utc": 1735997902.0,
      "score": 2
    },
    {
      "id": "m55ut1s",
      "body": "That is a job in itself! 😂 I've been trying as well for a long time and doing horrible at it😂",
      "created_utc": 1735899797.0,
      "score": 1
    },
    {
      "id": "m57ul3n",
      "body": "Yeah, right? At the end nothing matters. It's the truth but society calls us pessimistic for that.",
      "created_utc": 1735927422.0,
      "score": 20
    },
    {
      "id": "m5vt9v9",
      "body": "Death is the only idea where I find comfort whenever I find myself worrying about my future. ",
      "created_utc": 1736263483.0,
      "score": 4
    },
    {
      "id": "m58gdlz",
      "body": "I couldn't agree more! I made the mistake of asking too many questions and looking for too many answers. The result? I've never been so depressed in my life. On the other hand, I've come to understand lots of things. But it hurts to know the truth. What's more, things are happening before our very eyes and there's nothing we can do about it, and most people refuse to see it. It's even worse when you're the only one questioning the system, and seeing the truth, while all your family and friends seem to put up with it and live normally. Even though all the signals are there, and we're going to hit the wall sooner or later. We really are living in a Truman Show.\n\nBless you all",
      "created_utc": 1735933845.0,
      "score": 11
    },
    {
      "id": "m5b56os",
      "body": "I work 8 to 6 from M-F and the retirement age is also 65 🥴 plus I only get 12 vacation days a year that I mostly use to go to the doctor...",
      "created_utc": 1735967166.0,
      "score": 4
    },
    {
      "id": "m63w8ja",
      "body": "No, had a relationship till a was 30 bit after that nothing.\n\nWent on a few dates but gave up soon.\nDating is not fun anymore.",
      "created_utc": 1736367917.0,
      "score": 2
    },
    {
      "id": "m5vvial",
      "body": "Thanks for posting. These posts are like a lifeline in a desert, wandering alone for days, parched and exhausted under the relentless heat, and then suddenly spotting another human.",
      "created_utc": 1736264184.0,
      "score": 3
    },
    {
      "id": "m55u6cj",
      "body": "I feel the same way. And have also felt there has to be others like this. Somewhere in that mix should be someone to connect with? I hope.. 😂😳",
      "created_utc": 1735899407.0,
      "score": 2
    },
    {
      "id": "m55t7n6",
      "body": "That and in case we go to war. 😂",
      "created_utc": 1735898819.0,
      "score": 2
    },
    {
      "id": "m55s4cu",
      "body": "I've dealt with depression for as long as I can remember but the things I mentioned have kept my mind busy. My problem now is I've injured myself so bad I can't do anything. I've been stuck in my tiny apartment for a year only leaving to go to the doctor. I promise I get what you're saying... Having your health makes you ten steps ahead.",
      "created_utc": 1735898133.0,
      "score": 2
    },
    {
      "id": "m57r24g",
      "body": "I felt the same until I discovered my Human Design profile = Projector.   \nI learned I don’t have a defined energy center, which explains why I lack the natural energy to start businesses or constantly push forward. It was a game-changer to realize the world isn’t built for my type—only 20% of people are Projectors.\n\nHave you tried a Human Design test? You’ll need your birth time, but it’s free at [www.myhumandesign.com](https://www.myhumandesign.com) or [www.jovianarchive.com](https://www.jovianarchive.com). You might find some answers there!",
      "created_utc": 1735926382.0,
      "score": 1
    },
    {
      "id": "m55rb0u",
      "body": "Well, I totally get what you're saying go read the post I just made. I'm not doing well either. I just turned 34 the only thing that keeps me alive is hoping I can make my life better. This past year I can't do anything but usually I like riding my pedal bike, driving my car that's pretty dang fast, listening to music on speakers that are really good... Catching a really good sunset, listening to my dog make funny noises when he's happy Etc etc\n\nI lived im Houston for awhile in my spare time I'd give out socks to homeless. I never thought I'd see so many people cry over socks. That may not be your thing but if you want to make an attempt at enjoying life you have to find things that gives you joy. \n\nOutweigh the bad with good. Surrounding yourself with good people really helps, like me with my car the guys that I used to meet up with are super cool and make life just a little bit better.\n\nAs for a job, the skies the limit, so many jobs out there people have never heard of. Ive been lucky my family has a small business, I certainly don't love it but its better than most and the pay really isn't that great. But I run a lot of errands and random shit so it's always something different\n\nPS sorry I realized I got a little off topic, was talking to someone else and I've been up for like 30 hours 😭",
      "created_utc": 1735897615.0,
      "score": 1
    },
    {
      "id": "m55tqmm",
      "body": "Well you may hate that statement but if we don't find some kind of meaning in this life we really have no reason to wake up tomorrow. \n\nI didn't mention it but the closest thing I've found to a purpose is being there for my family's small business. It's ours and we've all put in our part to be there for each other. Not everyone has the same opportunity but there are many ways to go about it.\n\n I know I wouldn't want to put in the same effort for some massive corporation that doesn't know I exist. Having a job like mine or x,y,z you don't really feel like you need to escape",
      "created_utc": 1735899141.0,
      "score": 2
    },
    {
      "id": "m5vtdh0",
      "body": "Me everyday",
      "created_utc": 1736263515.0,
      "score": 4
    },
    {
      "id": "m95rtp9",
      "body": "Dude is there any way to not feel this way?",
      "created_utc": 1737840927.0,
      "score": 1
    },
    {
      "id": "m5wnp65",
      "body": "[removed]",
      "created_utc": 1736272512.0,
      "score": 1
    },
    {
      "id": "m58hsge",
      "body": "There surely must be a way to find your depressive half out there haha",
      "created_utc": 1735934266.0,
      "score": 2
    },
    {
      "id": "m55umj6",
      "body": "I'm so sorry to hear that. 🥺 That's a rough situation😔 I see where you were coming from before now.",
      "created_utc": 1735899684.0,
      "score": 1
    },
    {
      "id": "m55vzcz",
      "body": "Facts!!! It's 100% true. And that's really something to be thankful for!!! It makes me smile and is quite heart-warming that still does exist. Small family business is really the heart of community based living, which in my opinion, is the most sustainable way to live. I would love to be apart of it, generally speaking. 😊",
      "created_utc": 1735900535.0,
      "score": 1
    },
    {
      "id": "m5wphtl",
      "body": "Which actually just brought this post full circle OP! Maybe you're not made for this life, maybe you're made for what's to come during and after! The society bubble is under major duress. And bubbles only end one way. I know it sounds like I'm making a joke but I'm really not. Think This is the End meets Idiocracy meets Hunger Games meets Wall-E meets Look Up.😂🥴😵‍💫 I know it's a bit much but if you know these movies you can see what I'm saying 😁\n\nEdit: Life meaning this lifestyle as we live it right now. NOT you're actual life. 💝",
      "created_utc": 1736273030.0,
      "score": 1
    },
    {
      "id": "m55y0w6",
      "body": "🙏",
      "created_utc": 1735901777.0,
      "score": 1
    },
    {
      "id": "m55z4uy",
      "body": "Sadly it's getting harder and harder to start or even run a small business. Being competitive with prices and pay is nearly impossible. \n\nThere's so much wrong with the path we're heading down, I don't think it ends well. Everyone is losing there mind.",
      "created_utc": 1735902436.0,
      "score": 3
    },
    {
      "id": "m561bkj",
      "body": "Yeah it seems it would be that way. Walmart and other such family business killers outsource, pay cents on the dollar and upcharge everything. It doesn't end well. We're seeing the effects wash up on all beaches around the world.\n\n \"Convenience\" is killing us. I've seen lots of company lobbyists run with \"but what will busy mothers do?\" \"And all those out of a job?\" \nI always wanna say I know what they'd do, THEY'D FIGURE IT THE FK OUT CUZ THAT'S THE NATURE OF LIFE.\n Truly terrifying. Even the people with money are losing their minds. Or already have really.. \nTrapped is what I feel like every damn day. I can only imagine if I was injured. My heart really goes out to u rn.",
      "created_utc": 1735903703.0,
      "score": 1
    },
    {
      "id": "m5a99h3",
      "body": "Thank you! Hopefully, soon I will be better. These last 13 months is no way to live.",
      "created_utc": 1735954788.0,
      "score": 2
    }
  ]
}