{
  "id": "1k4d4wh",
  "title": "depression can take decades away from you",
  "selftext": "just came across one of my high school friends randomly and actually felt so bad because all these years later I did basically nothing and cannot chat about something interesting & new. Don't get me wrong, seeing your old friends successful is great... it just reminded me how I wasted my prime years. depression sucks.",
  "created_utc": 1745241016.0,
  "score": 898,
  "num_comments": 107,
  "url": "https://www.reddit.com/r/depression/comments/1k4d4wh/depression_can_take_decades_away_from_you/",
  "comments": [
    {
      "id": "mo99qgu",
      "body": "It’s taken away my entire teen years and probably my entire adulthood as well",
      "created_utc": 1745243798.0,
      "score": 180
    },
    {
      "id": "mo9chmf",
      "body": "It’s a shitty disease, and a lot of people don’t take it seriously, and society often doesn’t care, which makes it even worse. I’m in the same boat it’s taken most of my life away",
      "created_utc": 1745244707.0,
      "score": 132
    },
    {
      "id": "mo9cfft",
      "body": "It stole my entire 20s from me",
      "created_utc": 1745244687.0,
      "score": 170
    },
    {
      "id": "mo9xnrx",
      "body": "Agreed, thank you for stating that. Sadly, it's true. I am 56, and have had depression since diagnosed at 13, but more likely at least from 10 onward.\n\nI have done nothing I wanted to do, and spent years not even able to try to do things I enjoyed.  I'd urge anyone to try to work on getting well.",
      "created_utc": 1745251940.0,
      "score": 62
    },
    {
      "id": "mo9552b",
      "body": "You are 100 % correct there that depression takes decades away from us.",
      "created_utc": 1745242204.0,
      "score": 176
    },
    {
      "id": "mo9gcwb",
      "body": "It stole my teenage years and basically my whole life…",
      "created_utc": 1745245920.0,
      "score": 33
    },
    {
      "id": "moa9hy3",
      "body": "I'm doing my best but definitely feel like depression has stolen major chunks of every decade of my life. Going through trauma on top of that doesn't help either.",
      "created_utc": 1745255468.0,
      "score": 31
    },
    {
      "id": "modburc",
      "body": "The worst part about depression is the experience of losing your will to live. The demoralization that results from never being able to outgrow inner psychic conflict. Time stops indefinitely while the world around you keeps moving. You become bitter, resentful, spiteful and lose all initiative to use the energy at your disposal to make any sort of change.",
      "created_utc": 1745290790.0,
      "score": 30
    },
    {
      "id": "moa4u0g",
      "body": "[deleted]",
      "created_utc": 1745254119.0,
      "score": 23
    },
    {
      "id": "moa7ifk",
      "body": "It is my birthday today and I just got 25. I've been depressed for most of my life. I don't have any memory of my childhood and my school and bachelor days. I very recently have started to have lasting memories and I'm getting better nowadays. Anyways yeah so depression did take decades away from me.\n\nSometimes I get flashbacks from the past and it is such a nostalgia trip but then I forget them again seemingly for ever.\n\nI hope things get better for you and that you make the most of your time now. I know it sucks that depression costs you your prime but I hope you can still enjoy and live life to the fullest.\nTake care.",
      "created_utc": 1745254894.0,
      "score": 18
    },
    {
      "id": "mobltvq",
      "body": "Time passes differently for people with depression. It seems like we can never scape from our trauma.",
      "created_utc": 1745269670.0,
      "score": 13
    },
    {
      "id": "mobttqb",
      "body": "my shit mental health has taken so much time away from me and the worst part is i only fucking noticed after it had already happened. even now i can feel myself losing months and no matter what i do, no matter what i try, nothing seems to make any difference",
      "created_utc": 1745272174.0,
      "score": 11
    },
    {
      "id": "mobxyyb",
      "body": "Any thoughts how to get out of this. No close friends, no close family.  Struggled w depression all my life. I'm 57 lost my job and literally layed in bed for 11 months.  How do I change this?",
      "created_utc": 1745273543.0,
      "score": 9
    },
    {
      "id": "modthsw",
      "body": "I'm 43 and it started 30 years ago. I have no memory of being happy",
      "created_utc": 1745298460.0,
      "score": 10
    },
    {
      "id": "moa1ndf",
      "body": "Shxt! It’s been more than two decades since I am 14, still a loser!🤡",
      "created_utc": 1745253171.0,
      "score": 9
    },
    {
      "id": "mo9j4cw",
      "body": "\n\nFocus on yourself. Let the world burn.",
      "created_utc": 1745246766.0,
      "score": 21
    },
    {
      "id": "mobq0x1",
      "body": "yea, I also have PTSD, and I pretty much spent the last. 5-6 years doing nothing and all the lost time is eating at me. I’m almost 24 and I feel like the best part of my life is over. I suppose it could be worse, but I really wish I could go back in time, or at least gotten help sooner.",
      "created_utc": 1745270972.0,
      "score": 7
    },
    {
      "id": "modmm8z",
      "body": "Facing the same. Simply waiting for the night to sleep while unable to do anything during the day. Jobless, hopeless, frustrated!",
      "created_utc": 1745295243.0,
      "score": 7
    },
    {
      "id": "moc7zwg",
      "body": "It already took most of my teenage years, and it’s taking every single second of my adulthood. I don’t see any light at the end of the tunnel",
      "created_utc": 1745276941.0,
      "score": 6
    },
    {
      "id": "moci4e7",
      "body": "I don’t really see the point in living. How come some can be happy while others can’t? All I want is an answer.",
      "created_utc": 1745280369.0,
      "score": 6
    },
    {
      "id": "mod1i57",
      "body": "It’s stolen my teen years, and stealing my 20s as well…",
      "created_utc": 1745287111.0,
      "score": 6
    },
    {
      "id": "modjdv8",
      "body": "I agree. It’s a fucking bitch.",
      "created_utc": 1745293839.0,
      "score": 5
    },
    {
      "id": "modq1ea",
      "body": "It feels like I just woke up and twenty years disappeared.",
      "created_utc": 1745296773.0,
      "score": 6
    },
    {
      "id": "moeglvx",
      "body": "It's taken roughly 6 years of my life so far. It feels like everyone else is moving on and I'm in the same place, with the same problems but my resilience is running lower and lower.",
      "created_utc": 1745312567.0,
      "score": 5
    },
    {
      "id": "moficq9",
      "body": "Me too I once was that intelligent and hard working student now all my colleagues which was below me in intelligence they are all living normal lives and I'm suffering alone because of reasons out of my control",
      "created_utc": 1745329803.0,
      "score": 5
    },
    {
      "id": "mohxpvu",
      "body": "Thats one of the (many) shitty things about depression. The longer you have it the more you look back and realize all those years of you just trying to survive and get by everyone else was advancing through their lives at a normal pace. The worst part is those other people have no idea what you're going through and think you're lazy/wasted your life away on purpose.",
      "created_utc": 1745355575.0,
      "score": 5
    },
    {
      "id": "mo9gqdp",
      "body": "Success, fancy cars, lavish homes, even one’s health will deteriorate, and fall apart. All we will have left is in our heart is ❤️. Wake up with it, fill your day with it and end your day with it. ❤️",
      "created_utc": 1745246034.0,
      "score": 18
    },
    {
      "id": "mobok5d",
      "body": "Honestly, I don’t care about other people’s success. I only care about my own happiness, no matter what form it is. I love doing nothing actually. I hate being forced to do something I don’t enjoy.",
      "created_utc": 1745270512.0,
      "score": 9
    },
    {
      "id": "moeow62",
      "body": "I lost the last 3+ years to burnout and depression. I've lost close to a decade or more to it in the past. You're absolutely right. I'm going through a whole \"Life isn't a race but it sure as hell is a competition\" realization at the moment and, sitting next to people 5+ years younger than me who are better at me than everything I aspire to do really kicks you in the gut. But thinking like that only makes you depressed again, and oh look, another decade lost to bedrot and suicidal ideation.",
      "created_utc": 1745317682.0,
      "score": 5
    },
    {
      "id": "mopzciy",
      "body": "It’s taken 13 years from me, I’m 26 now. My friends are successful. I’m still in my corner",
      "created_utc": 1745461577.0,
      "score": 4
    },
    {
      "id": "mp2eu4p",
      "body": "It impacts my life in so many ways. Relationships with family, struggling with self confidence, inability to take care of myself well, not to mention the physical damage to my health too. It’s to the point where I cannot sleep at times. It’s this never ending suffering. I wish I could be happy.",
      "created_utc": 1745627637.0,
      "score": 3
    },
    {
      "id": "moe9hmt",
      "body": "Honestly, felt.\nDon’t even know who I am anymore. \nHave I ever? Unsure. \n\nShitty disease, and silent at that. ",
      "created_utc": 1745307896.0,
      "score": 3
    },
    {
      "id": "mok45bj",
      "body": "oh my goodness. I’ve felt alone in this specific experience for so long so in a way it’s comforting to know I’m not the only one, but it also saddens me to know that others experience this as well. Depression and trauma robbed me of my teen years, and both mental and physical health issues are stealing away my 20’s. I’m in my mid 20’s now and seeing old friends posting on social media about engagements, weddings, promotions, buying a house, etc has me emotionally so conflicted. I’m happy for them, but at the same time I feel so left behind and like I’ll never catch up",
      "created_utc": 1745383516.0,
      "score": 3
    },
    {
      "id": "momvqba",
      "body": "hilarious how people can eat garbage all their lives and „surprisingly“ become a diabetic. everyone is totally aware of them having to supplement insulin, etc. yet my depressive ass has to constantly fight for beeing recognized as ill, always explain myself or my condition even to my own parents. i fucking hate it",
      "created_utc": 1745426684.0,
      "score": 3
    },
    {
      "id": "mp7kcvw",
      "body": "I completely get that,my best freind from school who also introduced me to a bane on my life is a successful millionaire,I'm a 37 year old man who's bi polar and my life revolves around it,my lows are low and highs are fucking insane,only thing stopping me from killing myself is my daughter who is 8,but now she hates me and fuck knows why,only good I do in this world is for my kids (also 11 year old daughter) worlds a fucking shit show,rarer sorry for rant,hope you get happy",
      "created_utc": 1745701849.0,
      "score": 3
    },
    {
      "id": "mo9x25y",
      "body": "I’m trying to figure out my life… and trying to become successful and will be graduating with my poli sci degree in June. I “wasted” over a year… I don’t want to feel that way anymore. In fact, I won’t say I wasted it— just needed time. And I’ve learned to feel compassion. Last year, I wasn’t capable of much at all. Never really had much of a support system either— and so much happened. But I learned from it too. That my value isn’t tied to my output. \n\nSo… If anyone has any good advice (yeah, I know this likely isn’t the subreddit for it but still) or a good career path you all know of that maybe your successful friends followed, I’d love to hear it. Maybe… international business or tech related? Just asking.",
      "created_utc": 1745251748.0,
      "score": 6
    },
    {
      "id": "mo95xfc",
      "body": "You will waste more thinking like that, if time is short then regret is waste.",
      "created_utc": 1745242487.0,
      "score": 6
    },
    {
      "id": "mouw3l8",
      "body": "I stay same. Isolation protects me from reality.",
      "created_utc": 1745528522.0,
      "score": 2
    },
    {
      "id": "moxntgd",
      "body": "It's nice that u are aware of your feelings, and the reality of feelings can be changed easily by setting goals. The reality is money, and the common success might not fit u. Just change the game u are trying to play.",
      "created_utc": 1745567612.0,
      "score": 2
    },
    {
      "id": "mp2fngy",
      "body": "Does anyone else here feel depression from something related to the effect a parent had on your college experience?",
      "created_utc": 1745627927.0,
      "score": 2
    },
    {
      "id": "mp7y3s8",
      "body": "woke up at 43...broke, my husband took my kids,  no where to live...I GOT IT TOGETHER...Listen to Music...get you're groove  (remember I'm older.) going on ",
      "created_utc": 1745706521.0,
      "score": 2
    },
    {
      "id": "mpaihtr",
      "body": "I totally get it I think since I started menstruating I have been depressed every day is a struggle and I have to fight or push myself to do even the slightest thing I go to my work everyday and coast through life constantly depressed and feeling so low I could die. Yet I make my work everyday like that's some sort of amazing place and then go home and ignore all my friends and family cause I have no energy, no will to even see any one",
      "created_utc": 1745749803.0,
      "score": 2
    },
    {
      "id": "mpcsf4g",
      "body": "Yes depression sucks, it's practically destroyed my later years helped me become an alcoholic ",
      "created_utc": 1745779064.0,
      "score": 2
    },
    {
      "id": "mpf6w6b",
      "body": "Yep I second it.\n\nTook my whole teens, 20s and 30s away from me\n\nTrying to save my 40s",
      "created_utc": 1745808348.0,
      "score": 2
    },
    {
      "id": "mpj4tn8",
      "body": "We live in a constant survival mode, that's not living...",
      "created_utc": 1745867113.0,
      "score": 2
    },
    {
      "id": "mpjjsyj",
      "body": "Yes… my prime years are gone \n\nIt sucks",
      "created_utc": 1745871649.0,
      "score": 2
    },
    {
      "id": "mskovkh",
      "body": "sometimes i get really upset about everything i’ve lost to mental illness. but i remind myself that i’m not getting that time back and i’m wasting more time worrying about it. it’s not always easy to move forward like this but i have to keep trying because i deserve a good life.\n\ni try to be honest with old pals if i see them. i struggled and i’m recovering and i survived it all. if they can’t appreciate that at least a little bit they’re not worth my time. i’m happy they’ve succeeded. but i deserve a good life too.",
      "created_utc": 1747370646.0,
      "score": 2
    },
    {
      "id": "mob1bsu",
      "body": "So far 1.5 decades",
      "created_utc": 1745263585.0,
      "score": 2
    },
    {
      "id": "mrdtd8o",
      "body": "It's taken my whole adult life away from me so far (I'm 46). \n\nOne thing I have to keep reminding myself of is that depression is like a fever. It can have numerous causes. It seems contradictory that you have to identify the causes but also get out of your own head at the same time.",
      "created_utc": 1746775935.0,
      "score": 1
    },
    {
      "id": "mobs5bj",
      "body": "This just makes me so sad 😢 I’ll never have that time back",
      "created_utc": 1745271637.0,
      "score": 42
    },
    {
      "id": "mrwceza",
      "body": "I’m slowly trying to relive my teen years during my 20’s but it’ll never be the same… I missed out on those years sadly",
      "created_utc": 1747050495.0,
      "score": 2
    },
    {
      "id": "mobg263",
      "body": "It's taking my 40's. I'm struggling. ✌🏼 and ❤️",
      "created_utc": 1745267961.0,
      "score": 40
    },
    {
      "id": "modqkmw",
      "body": "Meanwhile I’m over here having birthday blues about my 24th😭",
      "created_utc": 1745297025.0,
      "score": 5
    },
    {
      "id": "moafd6r",
      "body": "Same",
      "created_utc": 1745257152.0,
      "score": 9
    },
    {
      "id": "mobiuny",
      "body": "How’d you get over it?",
      "created_utc": 1745268778.0,
      "score": 4
    },
    {
      "id": "mobt9hh",
      "body": "My teens, 20s, and 30s were all lost to depression. I only started therapy within the last couple of years and I so wish I had done it sooner.",
      "created_utc": 1745271994.0,
      "score": 40
    },
    {
      "id": "moboypq",
      "body": "With you on all of this. \nI often say to my therapist “when will I just get.a.break?” 😞😔\nI can identify trauma and periods of deep depression and other mental health struggles in almost every decade of my life so far.",
      "created_utc": 1745270638.0,
      "score": 12
    },
    {
      "id": "mojw6tb",
      "body": "You couldn’t have put it into better words for me.",
      "created_utc": 1745379967.0,
      "score": 4
    },
    {
      "id": "moa7sdp",
      "body": "If you need someone to talk to, I got you\nTake care 🫂🫂",
      "created_utc": 1745254975.0,
      "score": 7
    },
    {
      "id": "mota523",
      "body": "I thought it was just me, but I discovered that the perception of time passing faster and faster as we get older is a real thing. As someone with chronic depression, that ever-present feeling makes me feel even worse, as I feel like I'm just on a hamster wheel all the time while the world moves on.",
      "created_utc": 1745511823.0,
      "score": 1
    },
    {
      "id": "moe5xjr",
      "body": "I feel the same way. Been depressed since I was 15. I'm turning 27 in a few weeks. Tonight Is the first night I have felt like crying for so long. I messed up my life. Some nights you know how the depression just hits harder. 90 percent of the time or more I just ignore my depression. I find ways to distract myself from it. Then there are nights like tonight. Everything I ever did wrong, all the regrets, just letting so much time pass by, having no friends, never having a proper girlfriend. I think about all these things, then I can't sleep. It's almost like I feel a weight on my heart or like my heart is tightening in my chest. I am currently trying counseling and have been on SSRIs for years now. They aren't helping at all. I'm so afraid that this is just how I'll feel the rest of my life. I am also afraid of one day not being strong enough to carry on. It's so crazy just to think of how much time has passed feeling this way. Most of the time I don't feel anything. It's like you become numb to any good feelings. I wish the best for you. Feel free to reach out to me if you need someone to talk to.  Sometimes I wonder why I haven't given up yet lol. For real though",
      "created_utc": 1745305607.0,
      "score": 8
    },
    {
      "id": "moi5wb9",
      "body": "Any idea would be greatly appreciated.  It's 5pm and been in bed all day.",
      "created_utc": 1745358103.0,
      "score": 3
    },
    {
      "id": "moylar6",
      "body": "You said you have been in bed long and out of work. Have you been maintaining basic tasks: like brushing your teeth and washing your face? (Asking since many people w depression don’t do those things when in a bad state, been there myself numerous times and it can still feel like a chore/walking through thick mud).",
      "created_utc": 1745584897.0,
      "score": 2
    },
    {
      "id": "msaiucr",
      "body": "You must make those memories. No one can make them for you. And I’ll fill you in on something… the answer is not in the past. It’s now. It’s this. You asked the universe to have someone here that cares, and understands 💯 \nKeep your chin up!",
      "created_utc": 1747239047.0,
      "score": 1
    },
    {
      "id": "moa7prp",
      "body": "🫂",
      "created_utc": 1745254954.0,
      "score": 7
    },
    {
      "id": "mp3a5ru",
      "body": "Ok, that’s understandable. I don’t want to do anything except cook, play the piano and do some light gardening. I believed the narrative so long, I leave amazing jobs/relationships/opportunities because I’m not interested, get bored or convince myself I hate people. I’m 55, and completely relate with the feeling. I gave up when my wife left 5 years ago. But, I’ve been suicidal since my teens. That’s 2 lifetimes! I have tried everything. Even crap that hurt, more than helped. But, forcing yourself into doing anything you’re not into doing can have a reverse effect. You will feel useful, proud and this will hopefully remove the loop we can get into. Don’t spend 30 years being miserable, it will not do a thing. The universe does not stop b/c we don’t want to get out of bed. Chin up👍🏽",
      "created_utc": 1745639263.0,
      "score": 2
    },
    {
      "id": "mp7or6u",
      "body": "kids can be tough but they need you and once they became adults they will know how hard you try. so don't do that. I believe you are a great father. I wish you all the best & sending you virtual hugs man.",
      "created_utc": 1745703333.0,
      "score": 1
    },
    {
      "id": "monz4mx",
      "body": "Me too. Hey- all you can do is appreciate being awake now and going forward. I’m 33 and wasted the last ten years sad, scared, empty, drunk and in rehab. Some people waste their whole lives and dont even know it.",
      "created_utc": 1745438023.0,
      "score": 10
    },
    {
      "id": "mona9xf",
      "body": "I have acknowledged that I’m depressed for the first time in my life. I don’t really know how long I’ve been in it because I think I have high functioning depression. My husband said to me the other day that he doesn’t want me to waste the last half of our lives together. That hit me in a different way. I’ve started to think about how I can take stock on the positive moments and live in those experiences. Thinking about logging happy moments in a journal and making a habit to be reflective. No idea if that will help. I’m already in therapy",
      "created_utc": 1745430799.0,
      "score": 4
    },
    {
      "id": "ms3u0yd",
      "body": "Same even if I do somehow make friends I won’t have the freetime, health or be able to make mistakes like I could’ve when I was a teenager/young adult. I basically skipped ages 11-21 and it’s something I don’t think I’ll ever get over but I have to try.",
      "created_utc": 1747150108.0,
      "score": 1
    },
    {
      "id": "mobu4cy",
      "body": "Same here man and it freaking sucks. I literally hate every single day.",
      "created_utc": 1745272268.0,
      "score": 21
    },
    {
      "id": "moj1ehp",
      "body": "I'm 57 and have literally laid in bed for 11 months. No close family or friends.  Love going to sleep, it like little suicide. Tried killing myself w pills a few times and always wake up a few days later. I know I've messed up my kidneys and liver. I don't have insurance.  I pray I don't wake up every night",
      "created_utc": 1745368668.0,
      "score": 9
    },
    {
      "id": "monaljk",
      "body": "Same. I keep saying I want off this ride.",
      "created_utc": 1745430889.0,
      "score": 2
    },
    {
      "id": "mod9g42",
      "body": "Go for a walk every day.",
      "created_utc": 1745289883.0,
      "score": 2
    },
    {
      "id": "modi419",
      "body": "Did it help therapy? I would love to know",
      "created_utc": 1745293324.0,
      "score": 8
    },
    {
      "id": "moc4qpr",
      "body": "That's probably why a lot of us feel like depression is a big part of our identity and treating it can feel scary",
      "created_utc": 1745275846.0,
      "score": 9
    },
    {
      "id": "moqn6bi",
      "body": "Go for a walk. Don’t think about it just put on shoes and go",
      "created_utc": 1745471411.0,
      "score": 4
    },
    {
      "id": "mp0hhdi",
      "body": "Shower once a week, feel like I'm dipped in glue",
      "created_utc": 1745605394.0,
      "score": 2
    },
    {
      "id": "msbei05",
      "body": "That’s all my life, and all I am. I'm glad you are not in capacity to understand and pray you'll be spared.",
      "created_utc": 1747248072.0,
      "score": 1
    },
    {
      "id": "mpcstj5",
      "body": "Same here but for a lot longer, I'm not sure how I got this far ",
      "created_utc": 1745779189.0,
      "score": 1
    },
    {
      "id": "mp7ymr1",
      "body": "been there...he's trying to keep you down.   making you feel SMALL  and  IRRELEVANT ",
      "created_utc": 1745706708.0,
      "score": 1
    },
    {
      "id": "mok6c3q",
      "body": "i wish i could take ur pain away",
      "created_utc": 1745384603.0,
      "score": 3
    },
    {
      "id": "modm7ol",
      "body": "It will be away for moment. Not helpful!",
      "created_utc": 1745295061.0,
      "score": 15
    },
    {
      "id": "moghpxr",
      "body": "It's been very helpful. Medication has also helped",
      "created_utc": 1745340360.0,
      "score": 2
    },
    {
      "id": "motafjy",
      "body": "And if you can't find the will to do that, just go outside and sit in the sun.",
      "created_utc": 1745511907.0,
      "score": 4
    },
    {
      "id": "motdyfp",
      "body": "Exactly",
      "created_utc": 1745512907.0,
      "score": 2
    }
  ]
}