{
  "id": "1gogcwi",
  "title": "I learned to stop opening up to friends and family",
  "selftext": "In my case, it's been pointless. No one cares, or they're going through their own shit and don't have the capacity to take on my burdens mentally or emotionally. It may have actually hurt my relationships. I'm treated differently now, like I'm not cool anymore. I dropped the mask for a moment, and they learned more than they wanted to about me I guess.\n\nI should have kept the mask on, saved up some money and went to a professional to start with.",
  "created_utc": 1731287787.0,
  "score": 904,
  "num_comments": 108,
  "url": "https://www.reddit.com/r/depression/comments/1gogcwi/i_learned_to_stop_opening_up_to_friends_and_family/",
  "comments": [
    {
      "id": "lwihga9",
      "body": "I feel ya. I did the same thing a while ago. I just act like everything’s cool in the rare event that someone is interacting with me. \n\nFamily still tiptoes around me or just ignores me.\n\nI journal a lot. That helps.\n\nI’ve been on Reddit for quite sometime now and just finally started feeling kinda comfortable posting some things. \n\nIt gets lonely tho sometimes. I’m in my forties and have never been so alone. \n\nI hope therapy helps you out. Best of luck ❤️",
      "created_utc": 1731289857.0,
      "score": 180
    },
    {
      "id": "lwii4tl",
      "body": "I feel the same. Hate I let them in on my struggles. No one cares or they don't care enough.",
      "created_utc": 1731290098.0,
      "score": 70
    },
    {
      "id": "lwig9zp",
      "body": "[removed]",
      "created_utc": 1731289444.0,
      "score": 105
    },
    {
      "id": "lwimd46",
      "body": "From my experience I can tell you that 51% are not interested in others and 49% do not know how to react to situations of depression, suicide, anxiety, blah blah. That 49% will give you answers or attitudes, like \"everything will be fine, that's life, tomorrow will be another day\" and others will not want to get involved out of fear. Are they bad, selfish people? No .  One must know how to understand and accept it.  In my worst time I realized how everything was happening, I send family and friends who were only with me when \"I was fine and quiet\" to hell. The day I exploded it was all over. I appreciate the people who stayed with me a lot but I also know that they don't deserve to hear \"my regrets, my sadness, blah blah\" it's not their obligation. I don't want them to feel like \"hey, here he comes to talk negative things\", in the same way I don't like listening to someone negative every day, however I do express myself and tell them kindly, I don't ignore them or act cruelly. , I try to advise until that's it. If you have the possibility of going to a professional, do it, it is best.",
      "created_utc": 1731291620.0,
      "score": 50
    },
    {
      "id": "lwj73w8",
      "body": "I confided in my husband ALOT. Now I regret it so much bc he just uses it against me.",
      "created_utc": 1731299540.0,
      "score": 39
    },
    {
      "id": "lwjfvi7",
      "body": "Yeah as a rule of thumb, people either can’t help you, don’t want to help you, or both.\n\nIt’s better to keep the mask on and hope it doesn’t break on you.",
      "created_utc": 1731303625.0,
      "score": 35
    },
    {
      "id": "lwjqoiv",
      "body": "I've started doing this, in eyes of everyone I am a happy person, in my reality I feel so depressed, I cry everyday and I wish I was dead.\n\nIt's best this way.",
      "created_utc": 1731309862.0,
      "score": 36
    },
    {
      "id": "lwip8ha",
      "body": "damn. this hurts so much. I also unmasked now im alone in so much pain. its best to just keep it in",
      "created_utc": 1731292656.0,
      "score": 24
    },
    {
      "id": "lwilmtn",
      "body": "I’m the same. I’ve had only two friends who can handle me talking about depression, because they also deal with it. I’ve told other friends and even family and they couldn’t care less or acted so bizarre after. It’s sad, but it showed me who I can trust and who I can’t. Also helped me to see who to give a shit about when things go wrong with their health.",
      "created_utc": 1731291356.0,
      "score": 22
    },
    {
      "id": "lwj085k",
      "body": "Same. I opened up about my SA’s and got “oh it’s nothing serious since you weren’t R*ped” and after I went to the hospital all I get is made fun of and memes about “I opened up to my therapist and they sent me to a psych ward” but if I actually would’ve kms then what?\n\nSo I just keep everything bottle up until I explode 🙂",
      "created_utc": 1731296724.0,
      "score": 22
    },
    {
      "id": "lwjeo2q",
      "body": "That's basically what I do. I keep on the mask and as a consequence no one really knows me.",
      "created_utc": 1731303005.0,
      "score": 19
    },
    {
      "id": "lwk5ebt",
      "body": "I get you i stopped doing that for similar reasons and when people throw things back at you or try use it against you after youve opened up to them is one of the most disgusting thing a family member or someone who claims to care about you can do, especially when your always listening to them and their issues . \nI prefer it now works out easier anyway, and it only makes me feel worse if i talk about depressing stuff anyway, makes it all the more real !",
      "created_utc": 1731319765.0,
      "score": 17
    },
    {
      "id": "lwj6kym",
      "body": "I’m struggling to open up.. but when I do I see discomfort in their faces n shut up",
      "created_utc": 1731299317.0,
      "score": 17
    },
    {
      "id": "lwjsfst",
      "body": "I’ve always felt that unmasking too much never plays out well. It feels good in the moment to get it off your chest like they want you to but they’ll spin it around, judge you, and use it against you later.",
      "created_utc": 1731310975.0,
      "score": 17
    },
    {
      "id": "lwlwm3l",
      "body": "“I was ashamed of myself when I realized life was a costume party and I attended with my real face” ― Franz Kafka",
      "created_utc": 1731345491.0,
      "score": 17
    },
    {
      "id": "lwkswk9",
      "body": "Same here, too many times I've been tricked into believing people actually care about me so I'm only keeping it to myself from now on. People will tell you they care and want to support you until they actually see you're hurting, then they decide you're too much of a problem and start distancing themselves. I have no one. Even my own family got tired of hearing about my depression once I finally opened up about it. \n\nIf you decide to start therapy, I hope it helps you deal with all of this. You deserve to have people in your life who truly care and will show up for you.",
      "created_utc": 1731332178.0,
      "score": 13
    },
    {
      "id": "lwjm020",
      "body": "I mean you did a test, collected data, and figured out these aren’t your people.\n\nWhile sad, it’s quite liberating as well. You can still meet people who make you feel alive.",
      "created_utc": 1731307026.0,
      "score": 17
    },
    {
      "id": "lwjzd74",
      "body": "Yeah. Pretty much. I’ve seen the people don’t care thing. I told my mom I was feeling like ending it and she literally said “I wish you would shut up and do it already or hush about it.”",
      "created_utc": 1731315614.0,
      "score": 8
    },
    {
      "id": "lwjqe9c",
      "body": "Yep, me too. Every solitary one of them either ghosted me or whatever\n\n\nIn retrospect I should've masked around them all of my life",
      "created_utc": 1731309681.0,
      "score": 7
    },
    {
      "id": "lwk2mgz",
      "body": "I Unfortunately had to learn the hard way but a lesson learned either way.",
      "created_utc": 1731317874.0,
      "score": 5
    },
    {
      "id": "lwl4te5",
      "body": "These people have no idea how to sympathize with others and they see vulnerability as a weakness that needs to be shooed away. We can light the path for them by showing them how we would want to be treated and listened to, while it hurts not to get the same treatment back it’s a start for something bigger. I haven’t lost faith in others just yet, I want to be there for people who are at their lowest because in my experience nobody else will.",
      "created_utc": 1731336632.0,
      "score": 5
    },
    {
      "id": "lwji6d4",
      "body": "You know I suffered from the same thing but now I am taking the help of a popular ai that listens to me so that now I atleast have someone to talk to",
      "created_utc": 1731304862.0,
      "score": 3
    },
    {
      "id": "lwj4b9e",
      "body": "Yall I don't think no-one cares. I think everyone absolutely cares but we just don't know what to do or how to fix it.\n\nWe can't fix our own mess you know. I totally care about everyone and everything.  I wish I had some magic words or a wand and could just make everything right for everyone.",
      "created_utc": 1731298371.0,
      "score": 13
    },
    {
      "id": "lwjlsqr",
      "body": "Praying for you, hope it's ok. I'm still opening up to family. Sending lots of hugs to you",
      "created_utc": 1731306908.0,
      "score": 3
    },
    {
      "id": "lwl8i0c",
      "body": "How did you do this?? How do you cope? Going through shitty stuff and it’s SO hard to keeps it in I constantly need to vent",
      "created_utc": 1731337890.0,
      "score": 3
    },
    {
      "id": "lwl9bzi",
      "body": "Yep, agree. People just don't know how to respond. They just say some superficial bullshit, don't even try to fully understand shit, and try to give solutions rather than just listening. And they give solutions prematurely because you can't provide a solution if you haven't fully understood the problem first.\n\nSo yeah that's why I'm extremely careful who I open up to.",
      "created_utc": 1731338167.0,
      "score": 3
    },
    {
      "id": "lwlhgjq",
      "body": "I try to discuss my depression with my husband but he goes into “fix it” mode when I just need to vent. I’m keeping things bottled up more these days.",
      "created_utc": 1731340785.0,
      "score": 3
    },
    {
      "id": "lwkd33g",
      "body": "I can really feel u. Just keep those in your heart, that is also a way to protect yourself",
      "created_utc": 1731324654.0,
      "score": 2
    },
    {
      "id": "lwlu6z5",
      "body": "I have the feeling that people simply don't want anything to do with negative energy.",
      "created_utc": 1731344744.0,
      "score": 2
    },
    {
      "id": "lwmav73",
      "body": "I understand what you are saying.  The way that depression makes you feel so alone but then it makes you feel guilty for burdening your loved ones with your feelings and then the guilt and then worsening depression, it's an endless cycle.  Please consider going to therapy... or if you can't afford it, share here.  You don't have to feel guilty for unloading in this forum and it might help you feel a little bit better.",
      "created_utc": 1731349829.0,
      "score": 2
    },
    {
      "id": "lwmbvw5",
      "body": "Big same. I’m also suicidal. Everyone is busy with their own lives, and no one seems to have any real help to offer. My current plan is to live until I run out of money, then end it",
      "created_utc": 1731350139.0,
      "score": 2
    },
    {
      "id": "lwmnrri",
      "body": "I'm going through something similar. I'm sorry you are going through this.",
      "created_utc": 1731353756.0,
      "score": 2
    },
    {
      "id": "lwqgfis",
      "body": "It’s because most people aren’t empathetic. Think about our modern society. Violence, oppression, bigotry, the over-saturation of technology instead of human interaction… People have genuinely forgotten how to empathize with others. I personally believe it’s one of the root causes of why everything seems like it’s collapsing or getting progressively worse. ",
      "created_utc": 1731411961.0,
      "score": 2
    },
    {
      "id": "lwnuxb6",
      "body": "I lost my father to cancer at 14, and my older sister to a brain aneurysm at 18.  I have always been very guarded with my feelings, as I felt like I would be burdening others.  I'm in my 40s now, and I've opened up over these past few years.  I regret not doing so sooner.\n\nMy wife has serious problems at work.  I don't understand most of it, as I don't have a medical background.  She has accused me of not caring a couple of times, and I've explained that I just don't have answers or advice because I'm an idiot in her field of work.  I will always care and listen, though.  Sometimes, that's all that anyone can do.\n\nUntil you hear \"I don't care\" or something direct like that; I believe that you should always share how you feel to others in your life.  When you hear those words of non-interest is when you, yourself, eliminate them from your book of those that you care about.  Why care about those who don't care about you?\n\nI don't even know you, but I care.  I offer you what I can.  You wanna vent?  I'm your guy.  I may not have answers or advice, but I'll try.  At the very least, I'll listen.  Just please, don't stop sharing your feelings",
      "created_utc": 1731367278.0,
      "score": 2
    },
    {
      "id": "lwmzvtp",
      "body": "Yes, I have similar experiences.",
      "created_utc": 1731357461.0,
      "score": 1
    },
    {
      "id": "lwnsqvt",
      "body": "I've been feeling this for a long time. Suffering in silence. When I bring anything up that I want to have a conversation about I get you want to talk about this now with all the shit I'm going through. It's never a good time cuz whatever I'm thinking or feeling doesn't matter to anyone else. I can't be angry or upset. I'm told what I get mad about is stupid. Life is getting harder and harder to deal with.",
      "created_utc": 1731366533.0,
      "score": 1
    },
    {
      "id": "lwoz6t5",
      "body": "I had this experience but I also started being more open about it in general, which led to me making new friends and having a support system outside of my old friends and family. And then I saw a professional once I was in a position to.",
      "created_utc": 1731381684.0,
      "score": 1
    },
    {
      "id": "lwp1ton",
      "body": "I hate wearing a mask, it seems to me like we’re forced to wear it a lot. ",
      "created_utc": 1731382718.0,
      "score": 1
    },
    {
      "id": "lwrc889",
      "body": "opened up to family and got guilt-tripped because \"since I'm young I should be the one bringing happiness to the household, while they can afford being cranky\" ; every time I'm even slightly sad they take their anger out on me so now I just pretend, so they can live in their ignorance. \n\nfriends were just like \"oh no...anyways\"; all my friends are getting real places in life, or they still have big dreams. I have no place there. I'm just surviving. But it's a concept that stains their will to do and live, they try to be understanding but truth is, they don't want to hear it. So I let them think I'm fine. \n\nIt's nothing like books and movies. If you communicate or open up to someone, 90% of the times you WILL be seen as a burden.",
      "created_utc": 1731424776.0,
      "score": 1
    },
    {
      "id": "lwrs4wf",
      "body": "Never felt something so accurate. I regret it all. Nobody sees me as “normal” anymore. I feel the inflection of their voices when they talk to me. I’ll never be seen the same again. Biggest regret was opening up … even though it may have “saved” me.",
      "created_utc": 1731429822.0,
      "score": 1
    },
    {
      "id": "lwwvolh",
      "body": "I feel this. It's getting harder to keep the mask on now tho. My boyfriend just says there is always something wrong with me and I feel like my family and friends are avoiding me because they think the same. Sick of it all",
      "created_utc": 1731504290.0,
      "score": 1
    },
    {
      "id": "lx5ha4b",
      "body": "Same. Same. I'm sick of my own bitching, I know others are too",
      "created_utc": 1731619168.0,
      "score": 1
    },
    {
      "id": "lxl5k08",
      "body": "I find people to be superficial you had the courage to be honest - if they don’t like you for being honest -that’s on them not you - sooo many people are struggling everyday - most people are just faking it and suffering in silence - and not everyone wants to be on antidepressants - not everyone wants to abuse drugs or alcohol not everyone wants to over eat or under eat - some people just sit with it and there is nothing wrong with that!! ",
      "created_utc": 1731848781.0,
      "score": 1
    },
    {
      "id": "lwmacfz",
      "body": "Yup, anyone that tells me it's on to open up to have all fun away within a year because I'm \"too much\" mother fucker how do you think I feel? Unlike you, I can't run away from me. \n\nNow I can't tell if I'm more hurt from them leaving it jealous because they can. \n\nRegardless, never again. Well, technically it won't happen again as I'm likely dead before 2025 from starvation because I'm a basket case and can't find work",
      "created_utc": 1731349670.0,
      "score": 0
    },
    {
      "id": "lwj29h2",
      "body": "Journaling really helped that much?",
      "created_utc": 1731297541.0,
      "score": 16
    },
    {
      "id": "lwiqtbh",
      "body": "[removed]",
      "created_utc": 1731293226.0,
      "score": 1
    },
    {
      "id": "lwodmq8",
      "body": "Or they get happy because they don’t actually like you and love to see you fall (at least in my case)",
      "created_utc": 1731373861.0,
      "score": 6
    },
    {
      "id": "mkgse0r",
      "body": "Nobody cares",
      "created_utc": 1743305901.0,
      "score": 3
    },
    {
      "id": "lwjto20",
      "body": "Exactly that, yes.",
      "created_utc": 1731311767.0,
      "score": 10
    },
    {
      "id": "lwleorx",
      "body": "I feel that ...I only have my mom and sist3r but both of them got their life's goin on I am a recovery addict and it's been really hard on me not to have any type of support",
      "created_utc": 1731339912.0,
      "score": 6
    },
    {
      "id": "lwkwqzo",
      "body": "I was with my ex for 5 years. My best friend died while we were together, and it caused me to spiral pretty badly for over a year. I became distant, lost my sex drive and all that. I could tell it bothered her, but I couldn't help it. I talked about it and opened up to her about my past and daily struggles with depression. She said she understood at the time, but then later I found out she had been seeing another guy. I get why she did it, but it hurt. She could have just broken up with me.\n\nThat was 5 years ago. I haven't been in a relationship since.",
      "created_utc": 1731333675.0,
      "score": 13
    },
    {
      "id": "lwkss41",
      "body": "[removed]",
      "created_utc": 1731332129.0,
      "score": 7
    },
    {
      "id": "lwq44rf",
      "body": "So does my wife. I now try very hard to hide it from her. \n\nI'd never tell my family - brothers, mum or dad (I'm 42) as i don't think it would help me - in fact - it's so hard to explain depression anyway. I KNOW they would be thinking \"what has he got to complain about. He will be fine - stop worrying\". \n\nI wish I had someone to have real, open, non-advice and non-judgmental conversations with. I guess that's why reddit is good sometimes. \n\nI fucking hate it",
      "created_utc": 1731404226.0,
      "score": 4
    },
    {
      "id": "lwksgjw",
      "body": "I feel you there. I'm the same",
      "created_utc": 1731331998.0,
      "score": 12
    },
    {
      "id": "lwq49aq",
      "body": "Yeah- I bawl daily. Deep deep sadness. It's likes it's in my bones",
      "created_utc": 1731404314.0,
      "score": 3
    },
    {
      "id": "lxmkk33",
      "body": "I definitely agree that it’s best to seek help. A good counselor can be a huge asset. Another help is exercise. I’ve been depressed pretty much my entire life and my most “normal”, happiest and engaged years were when I used both counseling and exercise (a proven treatment for depression). Now I’m again at a real low point, wishing my life was over and just plain tired of it all after all these years (71). Tired of wearing my mask (don’t talk about it with anyone). It’s really gotten old (like me lol). But there are things that can help if one wants to improve how they feel. My counselor, who herself had faced her own demons, often spoke of the “baby steps”, putting one foot in front of the other each day and sometimes a few steps backwards. Mindfulness was also a technique that she stressed (and I used). Another technique I discovered in the last few years is EFT tapping. These things have helped in the past but I don’t seem to have the energy or care to access them now.  But to all of you that post about the same struggles…I get it. ",
      "created_utc": 1731867308.0,
      "score": 1
    },
    {
      "id": "lwmvmo0",
      "body": "[deleted]",
      "created_utc": 1731356153.0,
      "score": 1
    },
    {
      "id": "lwkvj3g",
      "body": "Yeah imo that’s the best people to talk to about these things. Mental issues are still very much taboo and for the most part only those who suffer can understand and react appropriately.",
      "created_utc": 1731333205.0,
      "score": 7
    },
    {
      "id": "lwq4k8d",
      "body": "I've always helped people- a great listener and never judge my friends (friends of old - I don't really have friends now) - and always thought if I ever got really sick etc- they would all be around me- helping me.\nNope.\nI told a few people early on I was struggling. Nothing. No one came to help or even called me actually. Very strange. But also made me realise how alone everyone really is. Just living their version of reality. No one is coming to save you. You have to do it on your own. Which is fucking brutal when you have depression",
      "created_utc": 1731404524.0,
      "score": 4
    },
    {
      "id": "lx557bq",
      "body": "That exact response is what my own mother said to me. Laughing while she did it.",
      "created_utc": 1731615467.0,
      "score": 1
    },
    {
      "id": "lwku9z9",
      "body": "I understand that now. There is no \"fixing\" it, and everyone has their own stuff they're dealing with. I wouldn't expect them to try to fix it. I just felt the need to release and confide in someone because the pressure had built up too much, and I needed to explain some of my behavior.\n\nBut it just makes everyone uncomfortable, and worst case, indicates to them, in their mind, that I'm a weak and unreliable person.\n\nI met a guy recently, we hung out at a party and became friends after. I could tell he was a little different, like me. We had gotten pretty drunk late that night and were being open with each other. He had been through a lot in his life, went to prison for some years, but is now doing pretty well for himself. And he said something that has been on my mind constantly since.\n\n\"The reality of life is, no one cares. Figure it out. Or don't. It's up to you, all you got is you at the end of the day.\"\n\nWhat he meant was it's no one else's responsibility to fix your life. And he's right. We're all here in the same boat trying to figure this life shit out.",
      "created_utc": 1731332719.0,
      "score": 9
    },
    {
      "id": "lwkxif0",
      "body": "Thank you, I hope everything works out for you as well.",
      "created_utc": 1731333970.0,
      "score": 1
    },
    {
      "id": "lwkxix8",
      "body": "Thank you, I hope everything works out for you as well.",
      "created_utc": 1731333975.0,
      "score": 1
    },
    {
      "id": "lwljoyz",
      "body": "I make throwaway accounts and anonymously vent on Reddit lol. It's nice to at least be able to talk about this stuff with strangers and read their stories. Makes me feel less alone.\n\nYou eventually lose the desire to vent to people irl when it sets in that nothing good comes of it. Nothing is to be gained from it. \n\nIt's natural to want to surround yourself with people who lift you up and inspire you. If you're not lifting others up, and are instead bringing them down with negativity, it just pushes them away. So you have to appear strong and positive around people even if you don't feel like it. Otherwise you'll lose them.",
      "created_utc": 1731341488.0,
      "score": 2
    },
    {
      "id": "lwlt2bf",
      "body": "Do you tell him you just need to vent? I think a lot of men are hardwired to try to fix everything, and need to be slapped in the face up front with expectations lol. I've been guilty of that. But if he can't just listen, then that might be a problem.",
      "created_utc": 1731344391.0,
      "score": 2
    },
    {
      "id": "lwj3lin",
      "body": "Bro, i’ve kept a journal off and on for like the past 30 years. We had to clear out my dad‘s storage unit a few months ago, and I found like seven journals from my teens to my mid 20s. \n\nJournaling doesn’t have to actually be about describing how you’re feeling or how your day went, you can just kind of write stuff down about like what you dreamed about last night or remind yourself that you like a certain song or a certain comedian or something like that. \n\nI guess it helps me because I feel heard in a way? I really don’t know. But I always feel better after jotting something down. I even send myself reminders on the phone because I forget things (I have a mild form of amnesia).\n\nBut just writing stuff down feels good because at least I was able to put it out there … even if nobody sees it. \n\nI don’t know if that makes any sense lol but it couldn’t hurt to try it out.",
      "created_utc": 1731298081.0,
      "score": 60
    },
    {
      "id": "lwkkstw",
      "body": "Yeah it is really helpful. A really good way to run far away from problems in life temporarily and slow down. To feel the different side of our life",
      "created_utc": 1731328705.0,
      "score": 11
    },
    {
      "id": "lwnkfco",
      "body": "It helps because if you keep your thoughts in your head you’ll ruminate. I don’t have a habit of it but at my lowest points getting it out there and tracking my mood gave myself reprieve.",
      "created_utc": 1731363784.0,
      "score": 5
    },
    {
      "id": "lwmp3ly",
      "body": "Journaling is an absolute lifesaver. I have journals from the past 10 years and they have been such an immense help- not only for my mental health but also my development as a person",
      "created_utc": 1731354161.0,
      "score": 3
    },
    {
      "id": "lwm82m4",
      "body": "She was a complete monster. That’s what I think of cheaters.\nI haven’t been in a relationship either since my one and only ex, so you’re not alone in that. But please don’t let her make you close yourself shut. Keep an open mind, you never know… lightning might strike",
      "created_utc": 1731348979.0,
      "score": 8
    },
    {
      "id": "lwkvae7",
      "body": "Agreed. Not a healthy relationship. I see that more the other way around - like women not tolerating men being vulnerable, but afaik that’s not a real relationship. If there is not vulnerability, there’s not trust or intimacy. A relationship without those things is just a business agreement.",
      "created_utc": 1731333112.0,
      "score": 5
    },
    {
      "id": "lwriugx",
      "body": "You paying??? ",
      "created_utc": 1731426907.0,
      "score": 3
    },
    {
      "id": "lwlhu3k",
      "body": "Absolutely true. I just don't want people to stop talking or telling their troubles.\n\nMany times someone has been down the path you are stuck on and nones excatly how to help.\n\nSharing is important and shutting down stops us all from connecting. \n❤️",
      "created_utc": 1731340904.0,
      "score": 3
    },
    {
      "id": "lwmkaiv",
      "body": "That’s true, venting has a time and place. I guess I will have to journal for when I always have th need.",
      "created_utc": 1731352693.0,
      "score": 1
    },
    {
      "id": "lwltvkb",
      "body": "Yes, I even preface it with “I just need to vent” and “I know you can’t fix this”. It’s definitely a man thing. lol.",
      "created_utc": 1731344646.0,
      "score": 2
    },
    {
      "id": "lwmdn72",
      "body": "How did you get started?\n\nI keep hearing people talk about how helpful journaling is to them and I'm willing to give it a try,  but anytime I have it feels weird and forced and pointless.\n\nIs there some trick to it that I'm missing?",
      "created_utc": 1731350670.0,
      "score": 6
    },
    {
      "id": "lwq06b9",
      "body": "My experience with journaling was a bit traumatic for me, as my mother found mine once when I was in middle school. She came at me with a barrage of questions while flinging my journal around for emphasis. There was nothing bad in there, she was just angry that I wrote them down and had not come to her first. Very reactionary. So be careful ",
      "created_utc": 1731401470.0,
      "score": 1
    },
    {
      "id": "lwlqihg",
      "body": "Hey I do love a good trauma dumping session with someone who can relate and open up about theirs too 😅 It feels good. But I think there is a line, and you have to be selective about who and how open you are. That guy at the party was rare, and even though we're both busy with different kinds of lives and live far away from each other, I feel like we'll at least be good acquaintances for a long time. Plus, he's not someone in my daily life who has expectations of me.\n\nI think I crossed the line with people in my circle when I talked about my suicidal thoughts and other intense thoughts and feelings. Those are the things that really make people uncomfortable and not know how to take it or process it. Or you find out that they consider suicidal people cowards and/or drama queens, which really sucks.",
      "created_utc": 1731343609.0,
      "score": 2
    },
    {
      "id": "lwlzt4h",
      "body": "I'm sorry to hear that. I obviously don't know yall or your relationship, but maybe he's just trying his best to help, even if it isn't the response you need at the time.\n\nI'd like to ask your opinion regarding that kind of situation, if you don't mind.\n\nMy sister is struggling a lot right now, more than me. It's very bad, as in she may have a more severe disorder such as bipolar. We don't have much family, much less supportive family, and I've been doing my best to try to support her and get her help. In short, nothing has worked and nothing has changed.\n\nWhat I need an opinion on is how I listen and respond to her now. She calls and texts me basically the same things all the time. \"I feel like my life is over. There's no hope for me. I don't have control of myself anymore. I don't want to exist anymore. Etc.\" I don't know what to say anymore, so my responses usually amount to \"I'm sorry, I love you and hope your day gets better.\" Sometimes when she calls, I just listen and don't say anything, assuming she's just venting. I can't tell if my lack of a response upsets her or not.\n\nWhat kind of response do you hope for when venting? Or do you look for one at all?",
      "created_utc": 1731346473.0,
      "score": 2
    },
    {
      "id": "lwnexu2",
      "body": "You just pick up a pen and write whatever you feel. It doesn't even have to make sense. It might feel silly at first but once you do it for a while, you notice that it may not help fix your problems but it might help you deal with them a little better.",
      "created_utc": 1731362050.0,
      "score": 6
    },
    {
      "id": "lxaobtu",
      "body": "The point is just to write. Even if your entry starts with \"I dont know what to write\". Write about how frustrating it is to not know what to write. Write about how weird and forced and pointless it feels. Its kind of freeing to know that it is, in a sense, pointless, because there are no rules and nobody to judge your work. But just do it. Like the previous responder said, theres the opportunity to feel \"seen\" in some small way. Its like youre creating another part of yourself to communicate with, as weird as that sounds. Come back to your writing, and write about what it feels like to reread it, even if it seems banal. Or you could take the entirely opposite approach and start with a very intentional prompt. Theres a decent list here:\n\n\nhttps://www.reddit.com/r/Journaling/comments/r7bsmz/long_list_of_journal_prompts/\n\n\nMaybe it still wont \"work\" for you. But i think what most people are touching on is that the act of written expression in any context (even if its just a reddit comment lol) can bring a small measure of comfort. ",
      "created_utc": 1731691936.0,
      "score": 2
    },
    {
      "id": "lwohqyh",
      "body": "Yeah, exactly. It might feel silly and it doesn’t have to make any sense. It’s not like you’re reporting in to anybody. That’s what is great about it for me. I can write whatever I want and feel like, “There! Got that off my chest.” \n\nIt’s just nice to stop thinking about whatever it is for a while. Writing it down is a way of saying it, without being judged. \n\nTry it out! :)",
      "created_utc": 1731375324.0,
      "score": 3
    }
  ]
}