{
  "id": "1dlvmew",
  "title": "I understand why people commit suicide",
  "selftext": "Hear me out. \n\nI can understand why people commit suicide. And I think it’s selfish for loved ones of those who did commit to call them selfish for “leaving them”. No. \n\nA person suffering from severe mental health conditions that cause them to be suicidal - they can do all the work to get better. They can go to therapy, they can take their medication, they can go to the gym and eat healthy, they can work and save money, they can be social and see their friends and family every other day, they can study for a degree they really want… but once those feelings of depression, and loneliness and isolation and emptiness come back for them, it’s so easy to forget the good things you have in your life (I.e. a loving family, a good job, a good gym routine, whatever it is).\n\nBut to expect your loved one who has committed suicide to continue living in this vicious cycle of being well and then unwell (whether it’s because of trauma, a diagnosed disorder, a chemical imbalance, etc) - THAT is selfish. Because unless they also suffer from mental health issues that cause suicidal thoughts and ideation, they will never understand the severity of their condition. They will never understand why they want to die despite all the good things they have in their life. \n\nSo for someone who has been successful in their suicide attempt, I can totally understand why they did it. Even if it’s someone who isn’t doing the work to get better (I.e. no therapy, no meds - just straight rawdogging), I can still understand why they want to die and commit suicide, or why they committed suicide.\n\nI am not at all saying that you should go about committing suicide. I think everyone’s life is important and can be meaningful despite their mental health issues. HOWEVER, if they do feel this way and do try or do end up killing themselves, I would never call them selfish for it because I understand why they would do, or did what they did.\n\n",
  "created_utc": 1719062692.0,
  "score": 516,
  "num_comments": 74,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1dlvmew/i_understand_why_people_commit_suicide/",
  "comments": [
    {
      "id": "l9rhh1c",
      "body": "more people need to have this attitude",
      "created_utc": 1719064573.0,
      "score": 69
    },
    {
      "id": "l9roxde",
      "body": "It's the kind of empathy we need for suicide prevention. Having those feelings validated is essential.",
      "created_utc": 1719067596.0,
      "score": 67
    },
    {
      "id": "l9rqfy1",
      "body": "Wish I could give this a thousand upvotes and screenshot this if I ever do the deed one day",
      "created_utc": 1719068187.0,
      "score": 35
    },
    {
      "id": "l9rua5m",
      "body": "Finally, someone who gets it",
      "created_utc": 1719069643.0,
      "score": 24
    },
    {
      "id": "l9s5kfg",
      "body": "I agree and I think if more people took a view point of trying to understand instead of judging it could actually prevent someone struggling to maybe stick it out longer and possibly become healthier themselves. I have family members who are judgemental to suicide because of religious beliefs. When I heard them talking down about it it almost makes you feel like they think they are better than everyone who offs themselves. I myself am religious and struggle with suicidal thoughts almost on a daily basis. Not even bad life circumstances just struggle with life. I can totally see how someone who is going through harder life circumstances doesn’t want to wake up to the struggles everyday. In a perfect world I wish everyone could find the healing they need. But that’s not the case here",
      "created_utc": 1719073908.0,
      "score": 16
    },
    {
      "id": "l9sm41c",
      "body": " Total agree. It’s not fair on both side. But wanting somebody to carry on feeling like this selfish too.",
      "created_utc": 1719080155.0,
      "score": 14
    },
    {
      "id": "l9sxolw",
      "body": "[deleted]",
      "created_utc": 1719084575.0,
      "score": 13
    },
    {
      "id": "l9rj4fb",
      "body": "How insightful",
      "created_utc": 1719065263.0,
      "score": 10
    },
    {
      "id": "l9sm4k0",
      "body": " Total agree. It’s not fair on both side. But wanting somebody to carry on feeling like this selfish too.",
      "created_utc": 1719080161.0,
      "score": 9
    },
    {
      "id": "l9uvci9",
      "body": "This is exactly what ive told everyone. I literally had someone try to argue with me and tell me its still selfish cause im only thinking about myself. My rebuttle was, then its selfish for you to want me to suffer just to save you pain that will heal. If the pain of life is so easy for you to deal with, dealing with my death should be no problem.",
      "created_utc": 1719114284.0,
      "score": 9
    },
    {
      "id": "l9tmup1",
      "body": "You're right - this is me, going to work, paying bills, etc, but don't want to devastate my family but someday I'll do it.",
      "created_utc": 1719094362.0,
      "score": 6
    },
    {
      "id": "l9ug1m2",
      "body": "Really good statement. \nI suffer 24/7 with depression/anxiety along with suicidal thoughts and hopefully very very soon those thoughts will become reality. But yeah, I get what you are saying, no one knows what that person is going through unless they suffer with something similar and they could really relate to what the other person is going through. Believe me it's hell. I never feel better but maybe for a short time (extremely short) the thoughts May get a little better but once that very temporary break is over the way the torture begins again and why would someone want to keep living like that every single day. \nI love My family but there's no way I can keep doing this.",
      "created_utc": 1719107023.0,
      "score": 7
    },
    {
      "id": "l9t3czt",
      "body": "Dude, you’re not the only one who understands….have you checked this sub out?",
      "created_utc": 1719086764.0,
      "score": 4
    },
    {
      "id": "l9v39qy",
      "body": "Its not being selfish.",
      "created_utc": 1719118596.0,
      "score": 5
    },
    {
      "id": "l9uij1j",
      "body": "I wanna be born like 30 years earlier",
      "created_utc": 1719108130.0,
      "score": 4
    },
    {
      "id": "l9vdoye",
      "body": "The internet often shows me this kind of posts and i can't thank you enough stranger for being the proxy of my mind. I don't have any awards to give but take this❤",
      "created_utc": 1719125235.0,
      "score": 5
    },
    {
      "id": "lhb8kuw",
      "body": "In a way I think people who commit suicide are the bravest people. They are willing to confront the ultimate unknown in order to get out of this mess of an existence.",
      "created_utc": 1723226367.0,
      "score": 3
    },
    {
      "id": "l9u69he",
      "body": "Me too like rn",
      "created_utc": 1719102651.0,
      "score": 2
    },
    {
      "id": "l9ur3k3",
      "body": "My sil  has been telling me i need to stick around.. Like why i literally have nothing left after ny husband passed.. But guilt.. Is that really enough to keep mr here.. No..",
      "created_utc": 1719112159.0,
      "score": 2
    },
    {
      "id": "l9vll6s",
      "body": "Yea and it goes for people with physical illness aswell like me",
      "created_utc": 1719130873.0,
      "score": 2
    },
    {
      "id": "l9wcao1",
      "body": "This real asf",
      "created_utc": 1719147984.0,
      "score": 2
    },
    {
      "id": "la5p4x3",
      "body": "Yes.  They are often incredibly brave to keep going for as long as they do.",
      "created_utc": 1719287857.0,
      "score": 2
    },
    {
      "id": "l9tdlz2",
      "body": "[removed]",
      "created_utc": 1719090673.0,
      "score": 3
    },
    {
      "id": "lgaf6vu",
      "body": "I have to say that as much as I feel for people that struggle with mental illness because I have struggled with it myself and understand the agony and suffering felt during those times … I can’t relate to these posts . When I read things like ‘ I hope one day my thoughts of suicide will become a reality ‘ ‘stop the suffering cycles ‘ is absolutely devastating and heart breaking. \nAs someone who has gone through 3 seperate hardcore addictions , crippling anxiety , self sabotage , depression and self loathing… I can truly say that there is hope . It does get better . It can get better . But the second you let yourself entertain thoughts of leaving this life , relief … suicide … those thoughts can take a life of their own . It’s very dangerous to entertain taking your life because the relief you associate with the imagination of the act becomes real and becomes tunnel visioned into the only way out . Thoughts can come into fruition . The only thing ever stopping me from entertaining or letting those thoughts enter is knowing how selfish it would be to leave this life . I didn’t know where and how , in my tunnel vision I was ever going to find a way out because I didn’t see one … but I knew the former was NOT an option . Somewhere deep down I knew that the second I saw it as one , it would be . \nI’m so so so glad that I stuck it through and sh it changed , through struggle , trial and error , falling and getting back up … my human spirit grew stronger and something persevered. I turn around now and I cannot believe that my situations have made me who I am today , I have somewhat recovered and I’m better for it , stronger . I wish everyone to keep holding on , don’t entertain the demons in your head , for they live for you to entertain them . Please please know there’s a reason shits so bad right now but it isn’t forever . If you see no purpose in your life , live for someone else , sacrifice your time to someone in need , help others , forget about yourself and give yourself up for someone else . Fight the good fight however you can , keep going , you are so much stronger than you imagine . Sending all of you so much love and blessings .",
      "created_utc": 1722687514.0,
      "score": 1
    },
    {
      "id": "ljfggoe",
      "body": "Well I think it would be okay if your really sick with something like cancer or some other disease so you don't suffer",
      "created_utc": 1724355303.0,
      "score": 1
    },
    {
      "id": "lkvq79s",
      "body": "People that fail to understand suffering just don't get it. Some people are just more resilient than others. To live you will suffer, no matter if you are rich or poor, black or white.\n\nWhen you are ultra aware, its hard to become ignorant to whats wrong with life and why living through the suffering is not even worth it for some.",
      "created_utc": 1725133905.0,
      "score": 1
    },
    {
      "id": "lluvlxk",
      "body": "I agree with you.",
      "created_utc": 1725656830.0,
      "score": 1
    },
    {
      "id": "lrf92hg",
      "body": "you're not \"understanding\" it, you're acknowledging it. \n\n\"Because unless they also suffer from mental health issues that cause suicidal thoughts and ideation, they will never understand the severity of their condition.\" so a person needs to have mental health issues with suicidal thoughts to understand severity of the condition? \n\nthis is such hogwash, it's like putting yourself in this secret \"club\" where you understand people that are willing to take away what it is to be conscious. you don't. don't think you do. everyone is unique and there is absolutely no possible way for you to understand what others are thinking or feeling just because you experienced it.",
      "created_utc": 1728659736.0,
      "score": 1
    },
    {
      "id": "lsk9p3r",
      "body": "I also had similar thoughts:\n\nIf someone wants to commit suiside and friend or family member knows it, they always think about themselves, about how bad they would feel without this suisidal one",
      "created_utc": 1729274444.0,
      "score": 1
    },
    {
      "id": "lwcwmdv",
      "body": "I tried twice this year but so far no luck. Lost my job for being sick about to lose my home. If decide to go through with it why do people look down on it. Isn't my choice?",
      "created_utc": 1731209526.0,
      "score": 1
    },
    {
      "id": "lydxjhp",
      "body": "Sucide is the only option left for some people who are fighting internally how long they asked for help no one came and to be honest we donot know when it will fine but it is already to late in my case",
      "created_utc": 1732264142.0,
      "score": 1
    },
    {
      "id": "lzz7fcd",
      "body": "Those people show a level of narcissism beyond belief\n\nAnother family member loses their life because they feel either hopeless, isolated, uncared for or combination of so many things.\n\nAnd when they die you make it about how that affects YOU? Maybe a phone call 2 weeks before they left prevents you now feeling guilty etc. \n\nThe general level of narcissism in today’s society is frightening because it’s the “norm” and isn’t seen as bad.",
      "created_utc": 1733107979.0,
      "score": 1
    },
    {
      "id": "lzz9uxx",
      "body": "I'm still a young adult, but the longer I've been alive, the more I get it. I used to have my own thoughts when I was younger and pushed through it (honestly because I could not imagine my family being able to survive or what my cats would do without me, that's about it) but older generations in our society love to tell people that life is SUPPOSED to be this way. I get told all the time that my 20s are supposed to be the best years of my life and when it's not everyone backtracks and says \"being an adult is actually quite miserable and you're supposed to struggle through the early years to get to the later ones. My 20s were horrible, too.\" I ask if it gets better, I get told not really. Life is supposed to be miserable and hard according to so many people. That doesn't help anyone who already doesn't see a way out of their suffering. I wish things would change so all adults could see life differently and experience life differently. I wish no one had to struggle.",
      "created_utc": 1733108895.0,
      "score": 1
    },
    {
      "id": "m0e0hvc",
      "body": "I lost my job and I’m a disappointed to my family so I think suicide is the answer. I can’t live with this pain anymore.",
      "created_utc": 1733329673.0,
      "score": 1
    },
    {
      "id": "m1jhdyr",
      "body": "what do u think about [this post](https://www.reddit.com/r/SuicideWatch/s/fOxMGdkVe5)?",
      "created_utc": 1733932999.0,
      "score": 1
    },
    {
      "id": "l9tnf2d",
      "body": "You all can downvote me but I personally disagree",
      "created_utc": 1719094599.0,
      "score": 0
    },
    {
      "id": "l9utzzt",
      "body": "They just want their pain to stop.",
      "created_utc": 1719113604.0,
      "score": 15
    },
    {
      "id": "l9ua9l7",
      "body": "That’s the sort of vibe I got off people who judge others for committing suicide (or trying to). They see suicidal people as weak. If they think suicidal people are weak, why not do something about it to make them “stronger” so they wouldn’t feel inclined to kill themselves? Why not help them? Instead, they do nothing to help suicidal people and pass judgement about issues they will never understand unless they go through it themselves. And they are one trauma away (whether its physical, psychological…), one chemical imbalance, one development of any mental health issues from also experiencing suicidal tendencies.",
      "created_utc": 1719104420.0,
      "score": 9
    },
    {
      "id": "l9ubvco",
      "body": "Absolutely. They always say think of [this person] and [that person]. But I think they forget about the actual person who is suicidal. Think about how they must be feeling and thinking. I think it’s selfish to expect suicidal people to continue life when they’re so immersed in their suffering. And the reason why the call suicidal people selfish is because they just don’t feel what they feel, think what they think, see the world the way the see the world. I’ve stated previously, despite doing all the work to get better (even if there are people who couldn’t bring themselves to get better), sometimes all that work is just not enough. \n\nAnother thing I’d like to add as well. When family or friends say they are always here for you, they can always talk to you about things - they truly mean it. However, at the end of the day all we have is ourselves. And when there are times where we can’t even HELP ourselves (I.e. getting out of bed, cleaning our depression rooms, etc) - what’s to think other people are gonna help us if we can’t even do it ourselves. And that’s what I mean by people who may not do the work to get better. If they can’t help themselves, how do we expect others to do it for us? Suicide is the only option in their mind, and that’s why they do it. That’s why I understand why the did it, and I will NEVER judge a person for committing or trying suicide. Instead, while I may be sad that they lost their lives to suicide - I would wish nothing but peace for them from now on. They knew what they wanted to do, and they were brave enough to do it. If their end goal in killing themselves was to find peace, then I hope they did get peace. Even if it means going to the extremities of taking their own life. As morbid as it sounds, I think anyone who is truly truly suicidal will understand where I am coming from. In the end, all we want is to feel at peace - if drugs can’t do it, if therapy can’t do it, if nothing can do it but finding a way out in suicide then… 🙏",
      "created_utc": 1719105141.0,
      "score": 12
    },
    {
      "id": "l9u417s",
      "body": "As someone who has regularly been lost in that darkness, I can assure you... Their brain is lying to them and telling them they are a burden to their loved ones and they are better of without them here.\n\nMy Dad lost his battle with mental health when I was 10. Next year I turn the age he was when he passed. The closer I have got to his age, the more I have understood why he lost the battle.",
      "created_utc": 1719101670.0,
      "score": 9
    },
    {
      "id": "l9zfgcx",
      "body": "Exactly my point. It’s a never ending cycle - going through the waves of being well and then unwell. And feeling unwell is enough for me personally to start thinking about suicide all over again. But when I am in a good place (also for a limited time), the suicidal thoughts go away and I even question myself - “Why was I even thinking about killing myself?” I am diagnosed with BPD so you can imagine the constant changing of emotions on a daily basis.",
      "created_utc": 1719190313.0,
      "score": 3
    },
    {
      "id": "l9vmeg5",
      "body": "You’re so welcome! It’s so easy to think that my own thoughts are unrelatable. That no one else is going to understand what I am thinking. That’s why I decided to post my thoughts I was having last night about this topic. To hear that there are people like you who also think in the same way is so comforting, and that these experiences (our thoughts and feelings) are shared. It’s a reminder that we are not alone after all ❤️",
      "created_utc": 1719131476.0,
      "score": 3
    },
    {
      "id": "lz5u30d",
      "body": "Dear fucking god. THANK you. Every time I have considered it I was absolutely terrified. I have only come close once. I chicken out every time. I have nearly died several times from crazy illnesses and complications, live with several untreatable illnesses, and am in constant pain. I have so much PTSD that's both medical and from the traumatic life I was thrust into. And yet it's my fault somehow. But I need to \"be strong\" and \"ask for help\" and all that. Every time I do, someone says I should be thankful. What, thankful I was SA'd over 600 times? Thankful that my family clearly does not love or care about me? Thankful that every single person who SA'd me is walking free? Oh, you think they should be in jail? Well they're not and I'm hiding from them. Oh that's not \"right\"? Go tell the police it's not right, not me. I did all I could. ",
      "created_utc": 1732665551.0,
      "score": 1
    },
    {
      "id": "l9u55az",
      "body": "100% - I think anyone with any mental health illness can understand to a degree what it’s like to be suicidal. Maybe not to the extent that I’ve described, but even thinking of ways it end it is enough of an understanding as to why people commit suicide.",
      "created_utc": 1719102162.0,
      "score": 5
    },
    {
      "id": "m1l3bha",
      "body": "I 100% agree with what this poster said. It’s not selfish to commit + people DONT care if you’re doing well or not, they really just don’t want to be affected by the loss of their friend or family. It’s selfish of them to expect someone to continue living who has already been suffering. If a person makes a conscious choice to commit, and they do die - then they have succeeded, and did what they wanted to do. I only hope that they finally feel at peace.",
      "created_utc": 1733950399.0,
      "score": 1
    },
    {
      "id": "l9uhdu0",
      "body": "You disagree with which part?\n\nThat it's selfish to do it? \n\nThat it's selfish of others to expect people to live through mental suffering?\n\nThat the cycle of ups and downs becomes overwhelming?\n\nThat everyone's life has value?\n\nThat's a very broad dismissal of someone who illustrated many different, yet valid, points.",
      "created_utc": 1719107620.0,
      "score": 7
    },
    {
      "id": "l9u455d",
      "body": "Cool story bro",
      "created_utc": 1719101718.0,
      "score": 6
    },
    {
      "id": "lamn2au",
      "body": "It's not the pain, its the suffering.",
      "created_utc": 1719545489.0,
      "score": 7
    },
    {
      "id": "l9vtq8g",
      "body": "Total agree with what you are saying it’s really hard. I wish I was like the people that get on with life and wish I did feeling like this. You say to them how do you do it? They say you just get on with it. But they don’t get that we can’t just get on with it.",
      "created_utc": 1719136982.0,
      "score": 2
    },
    {
      "id": "l9u68kc",
      "body": "I’m so sorry to hear about your fathers passing. But I understand what you mean, the more older we get, the more we understand about these heavy topics. And you are right in saying that they believe they’re a burden. I have been called that by own mother, LITERALLY! So they can try and convince us that we aren’t a burden, our lives matter. And IT IS TRUE, our lives do matter. But when you’re stuck in this way of thinking and feeling BECAUSE of your mental health condition, or trauma that correlates to suicide - it’s so easy to remain blind to the good things about yourself, and all the good you have in your life. Life is full of ups and downs, light and dark. And with people who do not suffer from the severity of mental health issues - they can still live within these two concepts of good and bad. But people with mental health issues can’t because they’re so overpowered with their negative feelings and thoughts they feel inclined to commit suicide to remove the pain and live in peace. Like I said, you can do all the work, commit to years of self improvement…  but sometimes it’s just not enough to live a fulfilling life and stay earthside 🌿",
      "created_utc": 1719102640.0,
      "score": 6
    },
    {
      "id": "m1lcdq6",
      "body": "exactly, and theres nothing cowardly about taking ur own life, ppl who do it are brave!\n\nedit: btw i looked at ur profile and u hadnt posted anything in 5 months. i was worried u were no longer with us after making this post but im glad ur here. keep preaching!!",
      "created_utc": 1733953104.0,
      "score": 1
    },
    {
      "id": "l9uxore",
      "body": "Everyone deserves an opinion and so do you",
      "created_utc": 1719115495.0,
      "score": 0
    },
    {
      "id": "l9u7hig",
      "body": "You are incredibly insightful and I feel genuine kindness and warmth from you.\n\nThe way my therapist and I worded it was, suicidal ideation/fantasies/ateempts aren't always \"I want my life to end\" mostly they are \"I can't live in this pain anymore\"\n\nBe whatever shape that pain comes in, emotional, physical, psychological. Suicide directly correlates to tolerance of pain in one way or another.\n\nThank you for sharing your insights and wisdom. I am truly grateful to know not every person out there believes it selfish (feel free to read [this post](https://www.reddit.com/r/SuicideBereavement/s/nXg9UIOVKD) I posted in r/suicidebereavement quite some time ago for elaboration)\n\nThank you for being alive and showing up in my world today 💚🫶\n\nEdit: adding link",
      "created_utc": 1719103188.0,
      "score": 6
    },
    {
      "id": "m1nq7si",
      "body": "Thank you so much! Still going strong 🫶 Just don’t use reddit that much other then this post hahaha",
      "created_utc": 1733986993.0,
      "score": 1
    },
    {
      "id": "l9ucuzt",
      "body": "Thank you so much for your kind words 🙏 and I will have a look now at this post and read the comments! Thank YOU for sharing your experience and your story not just on my post, but also on your own post! I am interested and keen to read it ❤️",
      "created_utc": 1719105589.0,
      "score": 3
    }
  ]
}