{
  "id": "1k0qjqf",
  "title": "I fucking hate being a nasty ass woman.",
  "selftext": "\nIt got removed from r/rant so I'm posting here.\n\n25f. I hate being a woman. I disgust myself.\n\n\nEdit 3. Thank you to the supportive commenters. I have saved your comments so I can re-read them later. I appreciate you understanding and seeing some other women feel the same tells me I'm not out my fuckin mind.\n\nUnfortunately for the rest of you, I'm still alive. It's nice to know that when I reach out for help I am alienated and attacked. If people respond this way to me on Reddit, imagine in person. Theres no way I will ever go to a fucking therapist now. This post has taught me to not ask for help because clearly, people don't fuckin get it.\n\nI'm not a murderer. I'm not a rapist. Contrary to what you may think, I'm not a fucking prick to my coworkers or anyone else. Dont assume. I'm a woman who wanted to express her innermost thoughts before shooting herself. And after reading some of the shit you guys spewed, i bet you would've liked that, wouldn't you? You'll get your wish granted one of these days.\n\nAs soon as someone doesnt align with your own thoughts and opinions you cast them aside. It's always \"mental health matters\" until it comes from someone with a perspective that differs from your own. In the end I hate myself more. I know my life will not end in any way other than suicide, but I expected maybe a bit more understanding. I was wrong. Fuck.\n\nFYI, if you disagree with somebody's outlook, you dont change their thinking by calling them disgusting, an ape, or a dick. That fosters hatred and it definitely did for me. The hell's wrong with you people? And considering many of the comments came from women that just puts me at risk for actually finding not only women's bodies disgusting but their personalities too, creating a complete negative bias from your chosen words. Luckily I know logically many women aren't assholes and have good personalities.\n\n\nAnd to all those saying \"men have their own problems too\" I'd rather deal with men's problems than women's. They're different problems and still problems but I'd prefer them. Men struggle with their bodies too, men dont build muscle naturally they have to work out etc. So do women, and they have to do more so to get results. Maybe men have to tough it out, but I'm not talking about societal stuff as much as bodily stuff. And with theway people respond to me, it's clear I just have to tough it out too because people don't give a shit. Men will never bleed from their crotches or experience weird changes in their chests. I would take the societal problems that men have if it meant having their biology, which is superior to women's for all reasons listed below. It's like someone asking would you rather be blind or deaf. Which problem would you prefer? Some prefer to be deaf, some prefer to be blind. Both are hard but it's natural to have a preference for one problem over the other.\n\nAnother thing I want to mention because it surprised myself. A few people were very supportive in the comments as well as defending me. Naturally I scrolled through their post history absent mindedly because I'm just a fucking bastard. And I did see photos of them, and they were women, and I did not immediately think they were ugly just for having a woman's body. I believe there is a positive bias there. And whenever I particularly despise my own body I have an even more intense feeling of disgust for every female body. You hate what you are is correct, no? But given a positive bias it seems I can see other women's bodies as neutral. I have also been in situations with a lot of shitty women, including a parental figure who had bipolar, and find myself being appalled by certain characteristics that they had, specifically arched brows, very wide hips and medium blonde hair. Making me despise any sense of those traits in myself as well and in other making me immediatly deem them ugly.\n\nEDIT 1. I never said I hate women I said I hate their bodies. Personality wise I've met great women. But I will always hate women's bodies. No I dont treat women like shit just cause I hate their looks or something, fuck I'm not a fucking prick. Same thing if you see a shirt you dont like you dont go fucking ruin it or some shit you just go \"eh hard pass\" but what if you ARE the fucking shirt too? Like fuck. That's why I'm posting my shit here. Where I can actually express my true opinions. Because I wanted someone to know my true thoughts before I go. This is MY post about MY truth. If I'm an asshole so be it, I cant help if people misinterpret what I say. Comments making me throw up.\n\nEdit 2. Well I'm alone then. People don't get it. They just don't get it. It's like they're not reading the full post or something. \n\n\nI hate getting a period. I find it absolutely vile and revolting. The smell, the mess, the cramps, everything. The first time I got mine I nearly damn threw up out of disgust. Having to plan my life around my damn bleeding time cause I'll leak everywhere. Having to bleed every fucking month? And then gifted menopause with a shit load of effects? A bullet to the head sounds much fuckin better. It sounds disgusting as it is. If I could take my uterus out and stab it with a knife a billion times I would. And I hate the stereotypes. Fuck off if I'm on my period it's not \"I'm craving chocolate tehehehe!\" Its just leave me alone let me sleep. What's with the fucking chocolate? Fuck your chocolate!!! I DON'T NEED A FUCKING SNICKERS.\n\nI Hate my chest. I wish I didnt have it and it could be removed. Because I hate how it looks, I think women's bodies are absolutely fucking hideous compared to men. Two ugly ass lumps on our chest that we have to cover up. I didnt ask for these ugly ass things, I'm not a fucking camel. Plus they always get those weird lumps in them certain times of month and I fucking hate that. And my nipples get sore sometimes before my period which is also fucking annoying. I'll chop them off first before the rest of it. I think breasts are vomit inducing ugly.\n\nI hate that women's bodies are entirely designed around reproduction. Wide hips, higher percentage of fat to muscle, breasts, etc. Disgusts me. My body revolts me. Men get to naturally build muscle easily and women just get to be fucking soft? What a joke. I find mine and women's bodies to be ugly as fuck and men's bodies not to be. To clarify I'm not a fucking asshole, this is my personal taste.\n\nAnd hormones causing skin breakouts as an adult. Just take my face off. And fuck my hormones, constantly shifting, like fuck you.\n\nPeople then are like \"oh, but women live longer!\" Which is only by a few years. Isnt there a statistic we spend like 7 years or some shit bleeding from our fuckin vaginas? Yeah we live longer cause we're spending those extra few years on the toilet leaking our uterus's unwanted nasty ass wallpaper.\n\nMen can run faster. Jump higher. They have a higher pain tolerance.\n\nThat's what a bunch of studies I read said anyway. From a simple google search \"do men or women have a higher pain tolerance\". In fact they said women were more sensitive to pain. And their pain tolerance is dependent on where they are in their fucking cycle. This fucking cycle dictates everything.\n\nThey're superior physically. I think they look better physically. Their skin is always beautiful as fuck, they have thicker skin, their hair is always thick, like, fuck! Even in nature the males are always prettier, like the ducks and shit. Nobody gives a fuck about them female ducks they're ugly af. And here I am stuck being a fuckin woman. Now I have seen beautiful women before and I'm glad they're thriving despite being female at least, nice clear skin, thick hair etc. But me personally I'm ugly as horseshit!\n\nImagine you had to pick between two avatars. The first one gets traits that are everything I mentioned above. Better speed, jumping, builds muscle way easier. Yeah I get it you still gotta put in the work to build muscle but a woman can put in just as much work and she'll still build less just cause of her biology.\n\nWhich avatar would you pick? The man. You wouldn't pick the woman cause their traits fucking suck compared to men. And dont get me started on the \"oh but women have their own specialities like they have empathy!\" Fuck off with that empathy. I want physical advantages. Plus most of the time empathy doesnt get you anywhere in this world, it gets you used. Exactly why serial killers pray on empathetic women, they feel for a person and go to help them and then they get abducted. Why is it always the empathy?! Plus I don't even have much empathy so what does that make me then? Useless? Probably.\n\nI hate my voice and women's voices in general. I think they're annoying as hell compared to men.\n\nI hate how I get tired at certain points of my cycle and hate even more those influencers being all like \"yes, allow your body to rest, lean into your feminine\" fuck off I have shit I wanna do and I'm tired of this fuckin meat sac I'm stuck in being a bitch cause it's in its \"luTeaL phAse\".\n\nEven our intestines are longer and statistically women get more constipated than men. So fuck we gotta deal with that shit too? Literally?!\n\nWhy cant my cycle be simple like a mans? For them their T rises and falls morning to night. Simple and easy. But NOT FOR WOMEN! WE NEED 4 PHASES WHERE WE FEEL LIKE SHIT FOR AT LEAST 2 OF THEM. PROBABLY MORE. WHY SO COMPLEX? HOW COME WE DIDNT GET SIMPLE ASS CYCLES TOO?\n\nI wonder what it's like to not have to worry about planning events around your inevitable blood leakage week or being able to walk outside on a sunny day topless. Which I cant do cause I'm a woman. And I have two fucking ugly pieces of flesh on my chest that need to be chopped up and burned.\n\nEven sex is out, cause I dont want to take birth control to fuck up my body even more with all them side effects, cause if you read the list of side effects, that's a fuck load of side effects, and guys hate having sex with condoms cause it feels awful, and yeah it probably DOES feel not as fucking good for both parties. And we only need condoms because stupid fucking uterus will make a fucking baby. That organ can fuck right off. Ruins everything. Why couldn't we have some shit in our body that lets us decide whether or not we want to conceive so we could have just some damn pleasure without worry?\n\nThe entire existence of a woman is just her in a flesh sac that is constantly building and shedding a uterus wallpaper in case she wants a baby. All about reproduction. I want no kids. So to me my body is one damn useless pain in the ass. If I could murder it but stay alive I would. I'm angry at my body for the pain it causes me, for its ugly looks and ugly functions and its grossness.\n\nI don't know how every other woman is doing it out there. Thriving and looking good and doing it all. I can't even function normally. Being a woman is too difficult for me. I disgust myself, I hate myself. If Icould I would just fucking murder this body I'm in if I couldnt feel it. Just cut my face off and my chest and my uterus out, stab and burn them. Fuck. I'll blow my brains out. Mark my fucking word, cause I have the gun.",
  "created_utc": 1744825430.0,
  "score": 485,
  "num_comments": 185,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1k0qjqf/i_fucking_hate_being_a_nasty_ass_woman/",
  "comments": [
    {
      "id": "mnim0bw",
      "body": "From the community info guidelines:  \"Anything that's not a direct, personal, **supportive response** to the OP\" is against the rules.  \n\nIf you think a post is fake, report it, don't engage.  If you don't know the difference between self-hatred and hate speech toward others, this is not the space for you.  \n\nAlso please note we have a specific rule about not diagnosing people.  You can offer ideas, but once you start telling people what they've got or, worse, what they *are*, you are well on the wrong side of the line. \n\nWe've locked the post for now since it's obviously being brigaded.  For those of you trying to impose some sanity and kindness, please *just* report inappropriate content.  Arguing with the haters just takes focus away from the OP and feeds the trolls.",
      "created_utc": 1744855562.0,
      "score": 1
    },
    {
      "id": "mnhtggp",
      "body": "Hey, I hear/read so much pain. I’m really sorry you feel such strong hatred towards your body. Do you know how you got to this place?",
      "created_utc": 1744845285.0,
      "score": 46
    },
    {
      "id": "mnhpq2a",
      "body": "This sounds like aggressive gender dysphoria mixed in with trauma-induced misogyny. You’ve got a lot going on, buddy. Therapy is def needed here, but I hope you find a way to remedy how you feel.\n\nAnd actually, some studies show that women actually have a higher pain tolerance, but it’s hard to prove that because people in general across sex, gender, and body type have more or less fat, more or less skin, more or less nerve endings, more or less muscle, due to complex genetics. So some of your ideas aren’t exactly on the right track, IF that makes you feel any better about being assigned Female at birth",
      "created_utc": 1744844033.0,
      "score": 218
    },
    {
      "id": "mnha4v2",
      "body": "I wish I felt as good about my male body as you do about the concept of a male body.\n\nYeah, like most of those things are true if you have good genetics or high testosterone. Even in my youth, I wasn't getting to have hardly any of that.\n\nAlso, because men have the *capacity* to have such features, other men, usually old, often think it's a cool idea to put us in physically harmful situations for their benefit because they assume we'll just \"bounce back.\" Except no, we just get broken, over and over and over again.",
      "created_utc": 1744838821.0,
      "score": 249
    },
    {
      "id": "mni7r9l",
      "body": "I've turned around by now but for years in my early adulthood I felt like I hated women. As it turns out, I just hated my piece of shit mother and piece of shit grandmother and I was projecting all the years of torment onto women as a whole. Not to mention all the gross manipulative tactics imposed by some loser men designed to turn me against women and make me feel like our existence is a bitter competition. What I've come to realize after doing a lot of learning, self reflection and working to continuously figure out my faults is that I now much prefer the company of women and consider myself an intersectional feminist\n\nOP, I hope you take care of yourself and that you'll be mature enough to want to take a hard look at how and why you feel the way you do. Instead of being disgusted by your body, maybe try removing the emotional aspect of it and embracing that it's just a part of being within the animal kingdom. It's just biology. It is what it is. Our bodies do a lot for us and I have hope that you'll come around and be able to appreciate what our bodies do for us, as well as our children should a woman decide to have any\n\nPlease strive to be open minded and willing to talk with a therapist if that's an option for you. You can figure out what's making you feel like this and I assure you coming to appreciate womanhood is a wonderful feeling",
      "created_utc": 1744850427.0,
      "score": 30
    },
    {
      "id": "mnhivga",
      "body": "Op, i know that you feel alone regarding this,.but people get defensive when something they like is targeted. In my opinion, what tou express here is internalised trauma. You hate women because you are a woman and you feel that way towards yourself and project this to the female genus. I would advise you visit a specialist in mentsl health as i think that you will be greatly aided. Wish you best om your journey.",
      "created_utc": 1744841707.0,
      "score": 115
    },
    {
      "id": "mngd7wj",
      "body": "I understand your frustration, it sounds like you may or may not be experiencing gender dysphoria or might have internalized misogyny. While I know you’re angry, I don’t think it’s right to insult other women or their bodies though.\n\nIf you do indeed suspect you have gender dysphoria, think long and hard about transitioning. I’m not trying to convince you that you are transgender or say that gender affirming care is something you should absolutely stay away from- but do thorough research on what would happen if you did take testosterone. Either way, I do believe you could benefit greatly from therapy. \n\nIf you do want to talk about some of the things I mentioned in my comment, I myself am a transsexual man and I don’t mind answering any questions you might have\n\nEdit: I see you’ve made an edit saying you don’t hate women, just hate their bodies. From just how much detail you’ve put into everything you find gross about being a woman and practically saying women are inferior to men, it comes across as you have a lot of internalized misogyny. If you are comparing men and women like this, and thinking this of your own body, then I feel it could eventually lead to being open about your disgust towards other women or making mean comments. This is how most of us are interpreting this. \n\nIf you did ever go through with gender affirming care, know that won’t fix everything. There’s only so much hormones and surgery can do. Something that as a transsexual man I have a very hard time accepting and often struggle with knowing no matter what- I will never have a cisgender man’s body. It sucks, but it’s the truth.",
      "created_utc": 1744828879.0,
      "score": 159
    },
    {
      "id": "mngl6h9",
      "body": "Internalized misogyny. Seek help!",
      "created_utc": 1744831323.0,
      "score": 465
    },
    {
      "id": "mngt58o",
      "body": "Ppl are going to downvote me for saying this but I personally find so much pride in being a woman. Im crazy IK but I love my cramps and my\nperiod. And just because youre a woman, doesnt mean you have to be feminine. It sucks that we do have a physical disadvantage but it doesnt stop me from doing long runs and weight training. Maybe it would help to try not looking at yourself as either female/male and just focus on building yourself up as human. Just go with what you like and dont like. It doesnt have to be categorized into gender.",
      "created_utc": 1744833705.0,
      "score": 254
    },
    {
      "id": "mnhno7u",
      "body": "Hey, I know a lot of people are mad at this post, and I get why — but I want to approach this differently, because I don’t think you’re just trying to be offensive. I think you’re in serious pain. And I hope you read this and give yourself a chance to be understood, not just condemned.\n\nWhat you’re describing honestly sounds like deep body dysphoria and self-directed trauma — not just simple “self-hate” or misogyny. And yeah, some of it does sound like internalized misogyny, but that doesn’t make you evil. It makes you someone who’s suffering in a world that teaches us to hate the bodies and roles we didn’t ask for. You’re lashing out because your body feels like a prison, a source of constant betrayal and humiliation, and that’s something a lot more people can relate to than you might think. Trans folks, cis women with PMDD, people with trauma tied to femininity — you’re not alone in this, even if it feels that way.\n\nYou’re not disgusting. You’re not a monster. You’re someone in deep pain trying to make sense of it, and yeah, sometimes that pain turns into rage. But I need you to know: this doesn’t have to be the end. I saw the part where you mentioned a gun — and please, please, if you’re still here, don’t let this be the way your story ends. Your body may feel like your enemy right now, but you don’t have to face that alone. There are ways to heal, or at least to not feel like you need to destroy yourself to survive. Therapy, trauma-informed support, even exploring gender identity or medical options if that feels relevant to you — these things exist for people just like you.\n\nI don’t care what you think you are, or how broken you feel — I promise you’re not beyond help, and you’re not beyond care. You’re allowed to feel this hurt, you’re allowed to be angry, and you’re allowed to want out. But I hope you’ll give yourself the tiniest chance to want something else too. You matter. Even like this. Even right now. Please reach out. You’re not alone.",
      "created_utc": 1744843342.0,
      "score": 27
    },
    {
      "id": "mnh5t96",
      "body": "Hi friend. Lots of diagnoses in the comments, so all I will add is this: your experience is unique to you, and you deserve to live in a body that feels authentic and right. Some of the things you don’t like about your body or your experience in this lifetime, are things I do like about my body and life, despite the inconveniences, which makes me think that there is more going on below the surface. I’d see about taking to someone to work out the feelings you’re having.",
      "created_utc": 1744837462.0,
      "score": 34
    },
    {
      "id": "mngjixu",
      "body": "i dont wanna diagnose because im not a doctor but this sounds like gender dysphoria",
      "created_utc": 1744830826.0,
      "score": 130
    },
    {
      "id": "mnhgdp3",
      "body": "I completely understand what you’re saying. It genuinely really sucks sometimes. You don’t need all this toxic positivity and to be told you’re an asshole for hating women, you’re a woman and you’re dealing with how much it sucks to be a woman.\nIt’s a really hard hand to be dealt sometimes. However, you can absolutely be happy without the muscle, etc you describe. I would also really recommend something like birth control or other period-stopping methods because truly menstruation is the worst.\nIt is possible for you to be happy and for these things to not become the focus of your life, but that takes such a long time, and you’re valid for feeling the way you do now.\nI hope you have something you love to distract you and that you’re taking care of yourself",
      "created_utc": 1744840864.0,
      "score": 7
    },
    {
      "id": "mngsbp0",
      "body": "Ironically, I am a woman and I truly understand your feelings. I agree. I know you said that birth control has side effects… but let me tell you. I’ve been on steady birth control (taken continuously so I don’t get a period) since I was 14 years old. I can tell you that the 10-15lbs that I gained is nothing compared to having to bleed every month. I would take any side effects Ive had from BC over bleeding. I also had a breast reduction and it was the best decision I ever made. It changed my life. Just those two things helped me feel so much better in this gross body.",
      "created_utc": 1744833467.0,
      "score": 36
    },
    {
      "id": "mni7n5i",
      "body": "Yeah, can’t say I like my womanly body either… it’s disgusting how I’m forced to be fertile and my whole spectrum of emotions revolves around a menstrual cycle. \n\nI wouldn’t say I wished I was born a man, I wouldn’t even have a problem with having a female body if it wasn’t so flawed in its design.",
      "created_utc": 1744850386.0,
      "score": 17
    },
    {
      "id": "mnhgigh",
      "body": "I think women are beautiful, their soft lines, curves, voices like birds’ chatter, their diverse fashion, I find them delightful. But in a deeper level, I feel like there might be something else also going on inside you, I hope you are able to seek out a way to find someone who can professionally aid you in this journey. Take care friend, life can be better.",
      "created_utc": 1744840907.0,
      "score": 28
    },
    {
      "id": "mnhjdgj",
      "body": "I know you’re getting a lot of hate for this but honestly I relate. I hate having this body. I hate how it functions and works. It’s repulsive. I hate having a vagina. I hate having discharge. I hate having periods. I hate having breasts. I hate that my body is centered around reproduction, I hate it with my entire soul. I wish I could leave this disgusting body and just be something non-physical. \n\nI hate this flesh sac and I hate that evolution decided it needs to reproduce.",
      "created_utc": 1744841878.0,
      "score": 31
    },
    {
      "id": "mngg051",
      "body": "I felt every single word. My thoughts exactly. 🫂 Always when I found a man good looking my first thoughts where like \"damn, I'll never look like him, I'll never be a man, fuck this ugly stupid female body.\" And yeah, all the stupid stereotypes about women and how we all want to be mothers and pregnant... fuck it, I better off myself than be pregnant. My hate for pregnancy and motherhood are in my top 3 things I hate about being a woman. And the fact that my body was made for that... no thanks, I'm a human first of all, not a woman, it's my right to be totally repulsed by this. And how people judge this mindset even if it doesn't affect them at all... no words. And how some people are offended by hating my female body. It's none of your business, Charlotte, you can pop up how many kids you want but this ain't for me.",
      "created_utc": 1744829732.0,
      "score": 12
    },
    {
      "id": "mnh506x",
      "body": "Oh my god same, this is the most real post I have seen in a long time. I will never understand people who  like being female because it is actually hell on earth. I  feel sorry for every woman i come across. Estrogen is an actual joke because what do you mean it makes you cry over every little thing. Feeling a little down? Cry. Happy? Cry. Got some constructive criticism? Cry. Angry? Cry. Lost something? Cry. Didn't preform that little task the best you could have? Cry. Things are going a little too well? Cry. 24/7 I am biting my tongue to prevent myself from crying. No wonder everyone considers women to be weak. I feel like a stupid fucking toddler. What is even the point of being able to cry more easierly? That stuffs for children because they can't express their emotions well enough and so their caretakers can comfort them. What use is this as an adult other than to make people look down you.\n\"Aw but 🌈sensitive✨ people have their strengths too✨✨\" I don't fucking care none of those \"\"\"strengths\"\"\" have benefitted me ever all it does is make you a less functional human creature.\n\nAnd don't even get me started on that parasitic organ, periods are only the first step, what about how it instills a deeprooted fear of pregnancy just by knowing it's a physical possibility. I can't even look at a pregnant woman without wanting to slit my throat. I always see people online joking about pregnancy it's not a joke it's not something silly thing to laugh at it's something out of a horror movie that is for some reason considered okay by the masses. I want to throw up even talking about this i feel physically ill.\nI hate living in terror, even though I would never have sex using this thing or even with a guy at all, the fact that rape exists and it happens constantly means it doesn't even matter. I wish I could just hang out and have fun with guys without fearing all these innocent people on the off chance that they might be rapist. \n\nIt's all because I was born like this I fantasize about cutting out my sexual organs every day.\n\nHonestly I do think I have gender dysphoria i have every symptom and more, but honestly you don't need that to feel this way because being a female just sucks that much.",
      "created_utc": 1744837220.0,
      "score": 14
    },
    {
      "id": "mnhmu9z",
      "body": "I understand your concerns on BC. I want to share that I have been on enskyce, isibloom or generic of it since I was 19. I take it continuously and I no longer have a period or my terrible cramps and i no longer get cystic acne. I take mine continuously for like 9+ months at a time. Some times will take a break for a week if I feel my body needs it, and my period comes back as normal for a few days. I have spoken with my Dr. On this. There is no need for me to have a period. They have said it's fine for me to take it without breaks and it's the greatest decision I have ever made.",
      "created_utc": 1744843059.0,
      "score": 4
    },
    {
      "id": "mnhcosy",
      "body": "Serious question  \nHave you considered/tried therapy?  \nexercise also? what is your diet looking like? sleep habits? what do you do in life generally?",
      "created_utc": 1744839652.0,
      "score": 10
    },
    {
      "id": "mnhjkk7",
      "body": "I feel the exact same way about being AMAB you might be a trans man",
      "created_utc": 1744841945.0,
      "score": 18
    },
    {
      "id": "mng7p2d",
      "body": "real, that's literally my thought process everyday🫂",
      "created_utc": 1744827204.0,
      "score": 38
    },
    {
      "id": "mngfbhk",
      "body": "I just want to say you're completely valid in feeling this way. As someone who went through similar visceral thoughts and is still currently struggling, I have been completely invalidated and actively shamed for it over and over again. As for stuff like emphathy n other things, tho, I don't believe them to be inherently biological cuz that's just entering a bioessentialism zone. It's the fuckass social conditioning society forces onto them, which can be changed but what frustrates me is the push against it and also the women who refuse to change. \n\nBoth men and women anger me. In a world like this, with a stark power imbalance between men and women, major percentage of violent crimes being committed by men, major percentage of human trafficking victims and SA being women, there should be an encouraged and mandatory push for women, from childhood, to build muscles, train strength, take mandatory martial art and weaponry classes. And for men to have more limitations on their gym activities, steroid use, etc. But instead, the fashion, fitness industry, beauty standards, dress codes, dating requirements, birth control, medications, less research into female related medical issues do their best to give them weight n body image issues, health issues and make being underweight, skinny, hairless and petite as this peak womanhood. And then men are fed intense power fantasies, encouraged even more muscle building, ego boosts, risk taking, lack of self restraint, entitlement, lack of self preservation, all these things that serves to drastically widen the gap between them even more 💀 then they both wonder why things are going haywire for women.",
      "created_utc": 1744829522.0,
      "score": 34
    },
    {
      "id": "mnhcer8",
      "body": "I'm really confused why the commenters here are just ignoring the pain you're expressing to just be like \"lol you need therapy actually.\" I'm not a woman, but all of those things sound absolutely awful. I can empathize with hating your body, because I hate mine and mine hates me too. Pain, skin problems, food intolerances, etc. This \"game\" of life was just designed horribly by a moron. Barely could even be called functional. So many easy obvious ways it could be better, like options to switch things on and off as you pointed out, (when our own personal survival isn't at stake, at least). I should be able to do what I went when I want, and not be restricted by a stupid worthless sack of meat just randomly deciding it wants something else. Bad genetics just making everything worse, which I had no say in. This life is just dumb",
      "created_utc": 1744839560.0,
      "score": 9
    },
    {
      "id": "mnigvem",
      "body": "That's a good rant. I have felt many of these things, except the self-violent hatred about it.  I don't \"act\" or behave as a woman is expected to - I don't even fucking understand it, frankly, as an autistic. But being as strong as you can is awesome, and it feels good. Sorry for your suffering. I'd highly recommend some surgery to get rid of the uterus if you don't wanna have kids.  Mine never worked properly so it wasn't a big problem, but if I was gonna bleed every month instead of every third month or so, I would have had the surgery.  Edit: And, shit, I thought this was the /rant subreddit.  OP, I hear you on the anger and disgust. I felt some of that ever since puberty. How about get surgical removal of the uterus and see what else you can do after that.",
      "created_utc": 1744853720.0,
      "score": 7
    },
    {
      "id": "mngmrqp",
      "body": "Hugs. I feel you. I sometimes hate being a woman too. I do struggle with gender dysphoria because of this.\n\nEdit: To the down votes, discriminate much?  Not appreciated, thanks. The person who said they struggle with gender dysphoria got 44 likes. Down votes are disagreements. You cannot disagree with the fact I struggle with gender dysphoria because that's a FACT.\n\nMaybe if men would stop sexually harassing me, I could enjoy being a woman more.",
      "created_utc": 1744831803.0,
      "score": 30
    },
    {
      "id": "mngghg4",
      "body": "While I don’t agree with your assessment of the female body. I empathize with the issues periods cause. I can only imagine how tough it is. \nTry to find some beauty in yourself. You may not like how you look, but you can change that. \nDon’t dwell on the hate, go search for something to love",
      "created_utc": 1744829879.0,
      "score": 3
    },
    {
      "id": "mni60jz",
      "body": "I feel the same way. I think it’s dismissive (for others outside of our personal experience) to reduce it to gender dysphoria because there are tons of trans men who don’t feel this way, and there are tons of cis women who do. I think it’s natural to feel grossed out by our bodies because periods are fucking awful and disgusting. I’m almost 40 years old and tired of this shit too",
      "created_utc": 1744849782.0,
      "score": 5
    },
    {
      "id": "mnhbou6",
      "body": "Trans man here. I think you should look into that possibility, personally i relate alot to what youve said honestly. Thing is, when you dont like those parts of yourself and you see those traits constantly around you i feel it does amplify the shit feelings. All the positivity aimed at those who its meant for instead gives the opposite reaction in oneself where its just pointing out whats not wanted. Hearing from others that they love the parts you hate doesnt make it any better, the pressure of being \"supposed to\" like it is overwhelming honestly. Whatever your case though, i hope shit gets better. I know those feelings of hatred very well, and that feeling of never getting to feel whole is fucking awful. But atleast you can try to make it a bit easier to live with.",
      "created_utc": 1744839325.0,
      "score": 14
    },
    {
      "id": "mng49qs",
      "body": "Oh how I feel you. You said all I ever thought about tbh\nIt was really nice to know there are more people feeling like that, like you know",
      "created_utc": 1744826201.0,
      "score": 4
    },
    {
      "id": "mnhw8o0",
      "body": "I am totally not judging you or your perspective, but maybe food for thought?\n\nIt really sounds like someone made you disgust your gender? Is this possible? That women in your life had such low self esteem this passed onto you in the form of disgust?\n\nOr alternately, have you considered gender identity? Maybe this isn't the body you were supposed to be in.\n\nThere's so many possibilities of why you feel so horrible out of place. I'm sorry I can't understand it better, and I'm sorry you're going through so much pain!",
      "created_utc": 1744846219.0,
      "score": 5
    },
    {
      "id": "mnhdxia",
      "body": "the hate in this chat is insane. you are valid in your feelings, its not misogyny to realize inherent bodily differences or to hate having a period. transgenderism is not the solution to everything either, these reddit diagnosis dumbasses… anyways, i can understand where youre coming from. if it helps, i hate mt life as a man too a lot of the time. im currently balding, 5’5 so my height puts me out of dating convos, and i hate most of all how uncaring and shitty the world is to my problems, men just have to “tough it out”\n\nsee what i mean? grass is shit brown on both sides, we just have our own shitty stuff to deal with. hope you understand that suffering is universal and wont be solved by being a man. whole different can of worms. maybe if you were porn a 6’3 gigachad model, sure youd wanna be a male. but you dont wanna be me.",
      "created_utc": 1744840059.0,
      "score": 7
    },
    {
      "id": "mnhsjyr",
      "body": "Everyone saying misogyny but all I see is self hate and deflecting it on others\n\nMostly seems like a BPD/BDD\n\n\n\nIf I had to guess as a qualified armchair psychologist ofc.",
      "created_utc": 1744844982.0,
      "score": 6
    },
    {
      "id": "mngnmfe",
      "body": "You might be trans. Just saying.",
      "created_utc": 1744832055.0,
      "score": 15
    },
    {
      "id": "mngj4he",
      "body": "this is so relatable",
      "created_utc": 1744830700.0,
      "score": 11
    },
    {
      "id": "mnggxeo",
      "body": "Sorry to hear: if it makes you feel better, you live in the first time in history where you can change your gender, so if that's the only way you can find happiness, consider it",
      "created_utc": 1744830015.0,
      "score": 3
    },
    {
      "id": "mnhjutv",
      "body": "Friend please consider transitioning. I know you’ve thought about it because you used “T” for testosterone. I’ve been on E for about a year and even though I’m not where I want to be yet, I feel so much incredibly better. If it helps I could use masculine pronouns for you? Or help you try out masculine names? I hope you’re still here.",
      "created_utc": 1744842041.0,
      "score": 5
    },
    {
      "id": "mnhn8yz",
      "body": "hmm yeah i would say you need serious help",
      "created_utc": 1744843198.0,
      "score": 3
    },
    {
      "id": "mnicyr1",
      "body": "i'm a trans man with gender dysphoria. i disagree with the comments saying this sounds like GD. this sounds like straight up internalized misogyny. i am literally transitioning to the other sex and this whole post is revolting to me. i can relate to the \"wanting to cut off the chest lumps\" part and hating periods, but... please go to therapy and unpack all of this.\n\n  \nETA: and if you do happen to be trans, please get this shit under control regardless. this is not a healthy perspective to have no matter who you are",
      "created_utc": 1744852305.0,
      "score": 2
    },
    {
      "id": "mngbrzr",
      "body": "[deleted]",
      "created_utc": 1744828435.0,
      "score": -11
    },
    {
      "id": "mngdb4e",
      "body": "[removed]",
      "created_utc": 1744828906.0,
      "score": 225
    },
    {
      "id": "mngnwix",
      "body": "[deleted]",
      "created_utc": 1744832140.0,
      "score": -11
    },
    {
      "id": "mngqxvx",
      "body": "[removed]",
      "created_utc": 1744833061.0,
      "score": -23
    },
    {
      "id": "mngv5tp",
      "body": "[deleted]",
      "created_utc": 1744834297.0,
      "score": 129
    },
    {
      "id": "mngvzf6",
      "body": "[removed]",
      "created_utc": 1744834542.0,
      "score": 439
    },
    {
      "id": "mnh5lia",
      "body": "[removed]",
      "created_utc": 1744837397.0,
      "score": 19
    },
    {
      "id": "mnha9s8",
      "body": "[removed]",
      "created_utc": 1744838865.0,
      "score": 32
    },
    {
      "id": "mnhblen",
      "body": "[removed]",
      "created_utc": 1744839294.0,
      "score": 123
    },
    {
      "id": "mnhbwpv",
      "body": "[removed]",
      "created_utc": 1744839396.0,
      "score": 43
    },
    {
      "id": "mnhfmha",
      "body": "[removed]",
      "created_utc": 1744840615.0,
      "score": 17
    },
    {
      "id": "mnhmxz2",
      "body": "[removed]",
      "created_utc": 1744843094.0,
      "score": 9
    },
    {
      "id": "mnhxgyt",
      "body": "[removed]",
      "created_utc": 1744846635.0,
      "score": 3
    },
    {
      "id": "mni6pnm",
      "body": "[removed]",
      "created_utc": 1744850044.0,
      "score": 1
    },
    {
      "id": "mni988i",
      "body": "[removed]",
      "created_utc": 1744850958.0,
      "score": 1
    },
    {
      "id": "mngqest",
      "body": "extremely relatable, used to think like this since a kid and it hasn't changed just gotten worse since puberty started. I've never seen a womans body as anything nice or something one should have (this is not in a misogynistic way)",
      "created_utc": 1744832904.0,
      "score": -5
    },
    {
      "id": "mngrwt8",
      "body": "This is definitely body dysmorphia. There are ways to stop the menstruation. I believe it's tying tubes? And top surgery is also a possibility. Atleast look into binding.\n\nI think it might also be gender dysphoria. You sound like you'd rather be a man. I recommend going to a therapist, they can help you with it and you can transition if you want.\n\nYou need help",
      "created_utc": 1744833347.0,
      "score": 1
    },
    {
      "id": "mni3twt",
      "body": "I think you need to see a therapist. I am not trying to be mean, friend. You have some work to do to accept yourself on your own body, or decide to go through a gender transition. Idk",
      "created_utc": 1744848919.0,
      "score": 1
    },
    {
      "id": "mnhbgvj",
      "body": "this is def an incel pretending to be a woman",
      "created_utc": 1744839254.0,
      "score": -2
    },
    {
      "id": "mni3j6m",
      "body": "Okay then get a full hysterectomy, mastectomy and get on T🙄\n\nYou have a serious problem but you can make permanent changes to get rid of the physical attributes you don't like.",
      "created_utc": 1744848799.0,
      "score": -2
    },
    {
      "id": "mni70od",
      "body": "I'm a man.\n\nI am really short, my muscles don't grow by themselves and the time I had to exercise to look decent was very long, my pain tolerance is not that high. Basically, I got all the bad genetics of both families. (I may be exaggerating a little bit here)\n\nSis is just idealizing her idea of a male body.\n\nThere are real men out there who suffer with their bodies too.",
      "created_utc": 1744850157.0,
      "score": 111
    },
    {
      "id": "mniks34",
      "body": "Men also have to work fairly hard in the gym and eat strict diets to get anywhere near a fit muscular body.\n\nIt's not something you're exactly born with or blessed with by the genetics overlord. Most of them are obese as fuck, and this is a not a gender specific crisis but a food crisis where I live. We face a obesity crisis in America. The food is just shit and so it makes you fat, men and women alike. It's not healthy.\n\nMen also have their own issues like balding due to excess testosterone they produce. Also yeah that last bit is true asf, my father worked himself to an early grave in the oilfield.\n\nWorking hard because someone says you'll bounce back will literally kill you or put you in a position 20 years from now you'll wish you had died.",
      "created_utc": 1744855115.0,
      "score": 20
    },
    {
      "id": "mni5iql",
      "body": "okay i defo love being a woman too but how do you love ur cramps and ur period bro😭 maybe it’s just cause i have endo but you’ll never catch me saying that",
      "created_utc": 1744849596.0,
      "score": 64
    },
    {
      "id": "mnhigtc",
      "body": "I agree! I weight train like crazy and I build muscle like it’s nothing. I like the idea of not categorizing into a gender too",
      "created_utc": 1744841571.0,
      "score": 24
    },
    {
      "id": "mni9572",
      "body": "I ain’t gonna downvote u, and there is nothing wrong with having pride about that, but OP just needs some direction",
      "created_utc": 1744850927.0,
      "score": 14
    },
    {
      "id": "mnhesjr",
      "body": "[removed]",
      "created_utc": 1744840342.0,
      "score": 8
    },
    {
      "id": "mnh1mjl",
      "body": "[removed]",
      "created_utc": 1744836211.0,
      "score": 67
    },
    {
      "id": "mnhlv21",
      "body": "Dude, I want a breast reduction so bad but every time I see them it looks like there’s a gnarly scar left for the rest of your life",
      "created_utc": 1744842720.0,
      "score": 11
    },
    {
      "id": "mnhezjn",
      "body": "I've been on opill for about 6 months, and it's my first bc. It doesn't take away my period, but it has made it more bearable.",
      "created_utc": 1744840404.0,
      "score": 3
    },
    {
      "id": "mnhkyc6",
      "body": "[removed]",
      "created_utc": 1744842410.0,
      "score": 6
    },
    {
      "id": "mni6a2y",
      "body": "Yeah it’s gross I feel the same and am 39F.",
      "created_utc": 1744849880.0,
      "score": 13
    },
    {
      "id": "mnhn2bl",
      "body": "[removed]",
      "created_utc": 1744843135.0,
      "score": 3
    },
    {
      "id": "mni0z8w",
      "body": "Finally!!! A sane person in this comment section, thank GOD",
      "created_utc": 1744847826.0,
      "score": 6
    },
    {
      "id": "mnhnfem",
      "body": "I’m sorry you went through that. It must be very defeating to feel like you hate the body you live in. I’m currently post menopausal at 53 and I got my period at 8. I hated it. HATED it. I never planned to get pregnant and used to wish I could get rid of my uterus since I never wanted to have kids but then I got pregnant. Haha. \n\nYou made your point much more succinctly than the OP, though. And I still don’t understand how you (the op) could hate other women just for being women. Although I can understand hating your body or feeling like you should have been born a male. \n\nHowever, I’m not trans so I can’t speak for others in your situation and can’t begin to know how you would feel. I just can’t understand this person’s pure hatred. I’m curious if you felt this persons hatred towards other women when you were still a woman? But of course there’s no obligation to answer. \n\nThe hatred started to make me feel I was reading this from the perspective of a very misogynistic man. And that confuses me.",
      "created_utc": 1744843259.0,
      "score": 0
    },
    {
      "id": "mngshn7",
      "body": "I’m a completely normal woman and I feel this way. It doesn’t mean she’s trans.",
      "created_utc": 1744833514.0,
      "score": 21
    },
    {
      "id": "mnif6ow",
      "body": "[deleted]",
      "created_utc": 1744853110.0,
      "score": 2
    },
    {
      "id": "mngdq2h",
      "body": "[deleted]",
      "created_utc": 1744829032.0,
      "score": -4
    },
    {
      "id": "mngg32i",
      "body": "Your mom",
      "created_utc": 1744829757.0,
      "score": 1
    },
    {
      "id": "mnhebk4",
      "body": "This sounds like a severe case gender of gender envy to me. Transitioning wouldn’t necessarily fix all of these problems.",
      "created_utc": 1744840186.0,
      "score": 77
    },
    {
      "id": "mngxrvg",
      "body": "[removed]",
      "created_utc": 1744835073.0,
      "score": -25
    },
    {
      "id": "mngu5su",
      "body": "[removed]",
      "created_utc": 1744834002.0,
      "score": 19
    },
    {
      "id": "mngzfyx",
      "body": "[removed]",
      "created_utc": 1744835563.0,
      "score": 81
    },
    {
      "id": "mnhyxkp",
      "body": "[removed]",
      "created_utc": 1744847127.0,
      "score": -3
    },
    {
      "id": "mnie3hn",
      "body": "[removed]",
      "created_utc": 1744852715.0,
      "score": -4
    },
    {
      "id": "mni0oya",
      "body": "I think fetishizing women and their bodies is not gonna help buddy. \nOP's body is hers to decide on what she likes or not, she is clearly not having a great time living in it, it doesn't matter how outside people feel about it, specially not you sick freak, who treats it like an object to look pretty and be used. That doesn't fix ANYTHING!",
      "created_utc": 1744847726.0,
      "score": 4
    },
    {
      "id": "mnhrzgm",
      "body": "[removed]",
      "created_utc": 1744844790.0,
      "score": 18
    },
    {
      "id": "mnihn30",
      "body": "Telling someone to get lost on r/SuicideWatch is insane. They never said they hated women, just female bodies. I think you need to go back to reading comprehension class.\n\nedit: pls read subreddit rules 1 and 3, everyone :)",
      "created_utc": 1744853995.0,
      "score": 7
    },
    {
      "id": "mnhgyrk",
      "body": "[removed]",
      "created_utc": 1744841059.0,
      "score": 53
    },
    {
      "id": "mnhz0ke",
      "body": "[removed]",
      "created_utc": 1744847156.0,
      "score": 2
    },
    {
      "id": "mniiedk",
      "body": "You are on r/suicidewatch, why does it need a trigger warning? Literally everything on this subreddit is potentially triggering.",
      "created_utc": 1744854266.0,
      "score": 5
    },
    {
      "id": "mnirq3s",
      "body": "YSK that trigger warnings do more harm than good.  Please don't advocate for them.  \n\nAcademic Study from Harvard:  [Helping or Harming? The Effect of Trigger Warnings on Individuals With Trauma Histories](https://journals.sagepub.com/doi/full/10.1177/2167702620921341)    \n\nShannon Palus at slate.com:  [The Latest Study on Trigger Warnings Finally Convinced Me They’re Not Worth It](https://slate.com/technology/2019/07/trigger-warnings-research-shows-they-dont-work-might-hurt.html)",
      "created_utc": 1744857700.0,
      "score": 1
    },
    {
      "id": "mngwt1d",
      "body": "I'm a male, and I think this too. Though, I was the opposite, I wished I was a woman. Now, obviously, this is not at all comparable to what the OP said, because for me it was mostly \"just a thought\"",
      "created_utc": 1744834788.0,
      "score": 8
    },
    {
      "id": "mnh6sso",
      "body": "Watch LOTR if you want to see a womans body portrayed as something beautiful and a force to be reckoned with (the elves / galadriel)",
      "created_utc": 1744837765.0,
      "score": 1
    },
    {
      "id": "mni8o7x",
      "body": "I have muscles and high pain tolerance I still hate myself 👍",
      "created_utc": 1744850757.0,
      "score": 34
    },
    {
      "id": "mni7fcb",
      "body": "said I was crazy. crazy needs no explanation haha",
      "created_utc": 1744850307.0,
      "score": 17
    },
    {
      "id": "mnihe1b",
      "body": "> if I were a man\n\nWe all have things where if we compared ourselves to others we'd feel bad. I'm glad I'm not short, but I could be taller. And other things. Focusing on that will get you nowhere. I accept my body happens to be female. It's a fact. I work around it and ignore that aspect of it as much as I can.",
      "created_utc": 1744853904.0,
      "score": 8
    },
    {
      "id": "mnhrepa",
      "body": "I am not a sport maniac, not great tbh, but I also dont mind not being best when I play. It’s a game, so it’s competitive, but also Im usually there to have fun as a priority. Theres been times playing with male friends that they have actually given me a handicap advantage.",
      "created_utc": 1744844597.0,
      "score": 5
    },
    {
      "id": "mnh7otm",
      "body": "I think one can compound the other",
      "created_utc": 1744838042.0,
      "score": 1
    },
    {
      "id": "mnh6qw4",
      "body": "[removed]",
      "created_utc": 1744837749.0,
      "score": 41
    },
    {
      "id": "mnhqomo",
      "body": "My scars aren’t that bad and I have Ehlers Danlo so my skin is super fragile.",
      "created_utc": 1744844353.0,
      "score": 8
    },
    {
      "id": "mnhqh2q",
      "body": "If you start the birth control the 2nd day of your period and then you never take the sugar pills… it should stop it. But you have to have your dr say take continuously for insurance to pay for it and you to skip that week of sugar pills.",
      "created_utc": 1744844284.0,
      "score": 1
    },
    {
      "id": "mnhngwo",
      "body": "I think they hate themselves and is taking it out on other people. Is that a laughing matter? Did the “lol” at the end of the comment make you feel superior to people who hate every inch of themselves so much that they hate other people too?",
      "created_utc": 1744843273.0,
      "score": 7
    },
    {
      "id": "mniff9x",
      "body": "\nI don’t think the OP actually hates women. I think their intense dysphoria is getting triggered every time they think about women.\n\nFor me, I have intense chest dysphoria. So anything that reminds me of boobs (like clothes that accentuate the chest area or women with large chests) makes me incredibly uncomfortable and disgusted. I’ve learned to separate the trigger from the feeling itself. But it’d be really easy to end up blaming the trigger for the emotions.\n\nAnd because the OP felt the need to clarify that they’re not an asshole, I'm assuming that the OP is trying to keep these thoughts about women as internal thoughts. This makes me think that the OP is just confused about what the actual target of their hatred is. Meaning, they think it’s aimed at women because women trigger it, but it’s really just their dysphoria.",
      "created_utc": 1744853197.0,
      "score": 5
    },
    {
      "id": "mni7t9n",
      "body": "I said might. Just something to think about.",
      "created_utc": 1744850446.0,
      "score": 5
    },
    {
      "id": "mnh1tk4",
      "body": "[removed]",
      "created_utc": 1744836271.0,
      "score": 14
    },
    {
      "id": "mnhlepx",
      "body": "Did you agree with EVERYTHING the OP said?",
      "created_utc": 1744842563.0,
      "score": 2
    },
    {
      "id": "mnijhz5",
      "body": "Is moving out a possibility? From reading your post, it feels like you're going to die if you continue to live there.\n\nEven if moving out is incredibly difficult, think of it as your last attempt at trying at life. Even if you become homeless and transitioning doesn't work out, you wouldn't have to deal with the repercussions because you've already decided to end it.\n\nSo if you ever get to that point where you're going to go through with dying, raid your cupboard, pack some clothes, find some cash, and just leave. Go to the closest city where you'll be able to find a non-profit trans organization and try it out. Even if the organizations that you can find are only for trans youth, still go and talk to them. They'll help you in some way or another.",
      "created_utc": 1744854655.0,
      "score": 5
    },
    {
      "id": "mngj9f5",
      "body": "does this seem like the sub for jokes? no. ur just putting them down and invalidating what they say.",
      "created_utc": 1744830744.0,
      "score": 5
    },
    {
      "id": "mngkcx8",
      "body": "This is a serious subreddit. Not a place for your condescending, failing-open mic-level “jokes”",
      "created_utc": 1744831070.0,
      "score": 5
    },
    {
      "id": "mnheidd",
      "body": "[removed]",
      "created_utc": 1744840250.0,
      "score": 7
    },
    {
      "id": "mngxv2t",
      "body": "[removed]",
      "created_utc": 1744835100.0,
      "score": 17
    },
    {
      "id": "mnijk4a",
      "body": "[removed]",
      "created_utc": 1744854677.0,
      "score": 5
    },
    {
      "id": "mnih1cw",
      "body": "[removed]",
      "created_utc": 1744853779.0,
      "score": 4
    },
    {
      "id": "mnhzp22",
      "body": "[removed]",
      "created_utc": 1744847386.0,
      "score": 2
    },
    {
      "id": "mni8qsn",
      "body": "Short as well",
      "created_utc": 1744850783.0,
      "score": 24
    },
    {
      "id": "mnh9hak",
      "body": "[removed]",
      "created_utc": 1744838612.0,
      "score": 6
    },
    {
      "id": "mnierjm",
      "body": "That’s fair. Sorry I kind of jumped over that 🩵",
      "created_utc": 1744852957.0,
      "score": 6
    },
    {
      "id": "mnhpkdj",
      "body": "Ok that’s fair",
      "created_utc": 1744843980.0,
      "score": 3
    },
    {
      "id": "mnika9m",
      "body": "My younger self would've agreed with everything she said. I was a fucked up individual. I had spent too many of my days scrolling on incel forum sites and adopting their exact mindset because I so desperately wished I was born a man.   \n  \nIt took years to get out of that dark hole of my life and I still find myself in that mindset at times. Was still not transgender though, just severe internalized misogyny.",
      "created_utc": 1744854938.0,
      "score": 7
    },
    {
      "id": "mnhqtya",
      "body": "No. Just being so disgusted and uncomfortable with periods and boobs I suppose",
      "created_utc": 1744844402.0,
      "score": 7
    },
    {
      "id": "mnher39",
      "body": "Not always. Men are stronger than women and many consider this world to be a patriarchy so it’s natural for some women to feel jealous over this.",
      "created_utc": 1744840329.0,
      "score": 31
    },
    {
      "id": "mnikcoz",
      "body": "You are violating the subreddit Rules 1 and 3. Please read the sidebar. Your posts have been reported as such.",
      "created_utc": 1744854962.0,
      "score": 5
    },
    {
      "id": "mnikcdw",
      "body": "[removed]",
      "created_utc": 1744854959.0,
      "score": 1
    },
    {
      "id": "mnie8rm",
      "body": "[removed]",
      "created_utc": 1744852768.0,
      "score": 4
    },
    {
      "id": "mniadrh",
      "body": "Short king",
      "created_utc": 1744851374.0,
      "score": 25
    },
    {
      "id": "mnifkyo",
      "body": "No worries ❤️",
      "created_utc": 1744853254.0,
      "score": 4
    },
    {
      "id": "mniivsn",
      "body": "[removed]",
      "created_utc": 1744854439.0,
      "score": 2
    },
    {
      "id": "mnij2k2",
      "body": "[removed]",
      "created_utc": 1744854505.0,
      "score": 2
    }
  ]
}