{
  "id": "1goraqr",
  "title": "All alone. Going to kill myself soon. ",
  "selftext": "I'm 62 years old, out of a job, wife sick.  Neglected by daughter. I'm going to kill myself soon. \n\nThey say God will help. He never did. There is no Heaven nor Hell.  No God, no Satan. There is only nothing  after you die. I've seen it after a heart attack in 2018. Just nothing after death. \n\nNo life after death.\n",
  "created_utc": 1731328981.0,
  "score": 518,
  "num_comments": 130,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1goraqr/all_alone_going_to_kill_myself_soon/",
  "comments": [
    {
      "id": "lwko9fs",
      "body": "this makes me really sad im sorry",
      "created_utc": 1731330258.0,
      "score": 164
    },
    {
      "id": "lwl4dk5",
      "body": "I never really had a grandparent memory because all of mine has passed away pretty early in my life. But as someone struggling with depression in my 20s right now and in sad time now, I know I would have loved being your grandkid/daughter..I feel you would get the pain in my soul so many don't.🫂 I wish the sun is gentle on you and the wind is warm for you.💖",
      "created_utc": 1731336479.0,
      "score": 127
    },
    {
      "id": "lwkpt50",
      "body": "Your words show that you've been going through a lot, but sharing your pain so openly takes courage. The fact that you wrote this shows that a part of you wants to be heard, to be understood, and maybe even to find a way through the darkness. That desire to reach out, to put your struggles into words, shows there’s a part of you that still wants to live—even if it doesn’t feel like it right now. \n\nSometimes, reaching out is the first step in finding support and relief, even if it’s hard to see any hope right now.",
      "created_utc": 1731330916.0,
      "score": 65
    },
    {
      "id": "lwmgj2m",
      "body": "I wake up everyday hating God and wanting to end it all. Out of work and moving into my car soon. I’ve prayed enough but this is where I am. Sadly, the people who tell you to look on the bright side and turn to Jesus has never walked in your shoes. God is absolutely not walking with me through this as others have stated.",
      "created_utc": 1731351549.0,
      "score": 20
    },
    {
      "id": "lwn5gog",
      "body": "I have been feeling the same. I’m a 51 year old woman who has gone through two horrific withdrawals from medications with no end in sight. I’m also going to lose what I have taken for my insomnia soon so I won’t sleep and that makes me suicidal. I used to answer crisis hotlines and answer the Suicide Prevention Hotline. I used to try to save lives but now I’m a hypocrite and want to end mine. I’m trying to hang on for my children because children of parents who commit suicide often end up doing this themselves and at the very least end up with complicated grief. Even if your daughter isn’t speaking with you I’m sure you don’t want her to experience this. Best of luck to you and feel free to reach out anytime! 😊",
      "created_utc": 1731359158.0,
      "score": 11
    },
    {
      "id": "lwmojfm",
      "body": "I feel you, I am about to lose everything and be homeless again. Everything I worked so hard for is about to be gone in a matter of days.",
      "created_utc": 1731353990.0,
      "score": 10
    },
    {
      "id": "lwkz35d",
      "body": "Im sorry that you're going through this , I hate how unfair life is .",
      "created_utc": 1731334569.0,
      "score": 18
    },
    {
      "id": "lwksokm",
      "body": "Do you have any plans in order for your sick wife?",
      "created_utc": 1731332089.0,
      "score": 24
    },
    {
      "id": "lwlg7dd",
      "body": "At 62, the milestones you've battled are worth talking about. Mind sharing?",
      "created_utc": 1731340391.0,
      "score": 6
    },
    {
      "id": "lwp37mq",
      "body": "This is definitely hell.",
      "created_utc": 1731383275.0,
      "score": 7
    },
    {
      "id": "lwkx0qy",
      "body": "put your faith in yourself, you're so much stronger than you think you are and I CARE ABOUT YOU, i don't give a fuck that i don't know you. you deserve to feel the wind, sun and grass. you deserve to be okay.",
      "created_utc": 1731333780.0,
      "score": 19
    },
    {
      "id": "lwkxxos",
      "body": "I’m sorry you’ve been through this much. Things can be really hard sometimes. I’m here if you want to talk about anything.",
      "created_utc": 1731334131.0,
      "score": 4
    },
    {
      "id": "lwky1h8",
      "body": "Sorry to hear that. I understand how the people around us not reaching out or caring is so devastating. And how another's illness wears on you. Grieving them before they're even gone at times.\n\nCan try reaching out for govt aid to hold you over if you have been trying to get a job. That's what I was told, but not sure if they changed it or where you live. What country. I'm sorry.\n\nNothing, huh. That's... a letdown. \nAbsolutely nothing?",
      "created_utc": 1731334172.0,
      "score": 4
    },
    {
      "id": "lwo0ql5",
      "body": "Usually I don’t reply to this stuff but I genuinely hope you are okay.\n\nI understand what you mean when you say you don’t think God is real, I’m still in that solely because of the reasons you provided as well. Aside from that, I really hope you choose to stay. I’m not going to try to guilt trip you by telling you that you should stay for your wife — or literally anyone else, but for yourself.\n\nIt may not seem like it, but there’s still time left. For whatever you want to do with that time, there’s so much you can do still, and I really hope you stay, even if it’s just to see the sunset or to stay with your wife through her recovery, (which, i hope she’s in recovery.)  \nLike you said, there’s no life after death. So why not live as much as you can while you can? Sounds silly, I know.\nI hope you choose to stay here, and that you feel better soon.\nEdit: Spacing",
      "created_utc": 1731369325.0,
      "score": 5
    },
    {
      "id": "lwkq95i",
      "body": "I wish I could but it would leave all my pain and problems to everyone else. So instead I worry and suffer day after day.",
      "created_utc": 1731331103.0,
      "score": 10
    },
    {
      "id": "lwma3a9",
      "body": "You have your wife.",
      "created_utc": 1731349593.0,
      "score": 3
    },
    {
      "id": "lwmpu10",
      "body": "I’m right there with you.",
      "created_utc": 1731354385.0,
      "score": 3
    },
    {
      "id": "lwnkpxz",
      "body": "i can only hope things get better.🫂🫶",
      "created_utc": 1731363878.0,
      "score": 3
    },
    {
      "id": "lwo4vbe",
      "body": "It depends what you believe in, if you’re in this state it’s so hard to imagine anything after death. I really hope you’ll be better soon, I’ve had some mild thoughts about death, so I can’t imagine how bad it has to be to think that, I really wish you all the best whoever you are and please don’t do it, if you can try to change your surroundings, connect with nature, there must be things you loved when you were happy, I know it’s easy to say, but changing your mindset is crucial, a little change in a routine can make you feel a bit better. I wish you and all of your family a lot of strength and health.",
      "created_utc": 1731370778.0,
      "score": 2
    },
    {
      "id": "lwopmko",
      "body": "If you can, I'm here to talk.",
      "created_utc": 1731378134.0,
      "score": 2
    },
    {
      "id": "lwpf0ld",
      "body": "Praying for your happiness and health 😩❤️",
      "created_utc": 1731388607.0,
      "score": 2
    },
    {
      "id": "lwpf55i",
      "body": "I'm literally crying for you, please please please don't do it....",
      "created_utc": 1731388671.0,
      "score": 2
    },
    {
      "id": "lws23og",
      "body": "Bro it is not worth it trust me i am here to talk all you want anytime just please reconsider it for once",
      "created_utc": 1731432884.0,
      "score": 2
    },
    {
      "id": "lwscm07",
      "body": "Real talk old man, the robots don’t want to believe it but it’s true",
      "created_utc": 1731436086.0,
      "score": 2
    },
    {
      "id": "lwtn11f",
      "body": "Hey OP sorry to hear that you are going through a very hard time.. It's up to you If you want to share anymore about it, it's hard when you have someone so close to you that's unwell and being out of a job must be rough. OP you say your 62 you must have gone through some really hard times before and I'm guessing it's all got too much.. There are people that can help you with financial support if you need them or even to help with your sick wife. Please don't end your life OP it's hard and I get that but you have lived for 62 years and there must have been some good times too?",
      "created_utc": 1731450673.0,
      "score": 2
    },
    {
      "id": "lwlggnz",
      "body": "I wish you the best. I hope your daughter is also there for your wife.\n\nI agree with you about the \"afterlife\". In the end, death is just nothingness. At 62 though, there is still so much to live for.",
      "created_utc": 1731340472.0,
      "score": 4
    },
    {
      "id": "lwm55w9",
      "body": "No baby don’t do this, I’m so sorry you’re dealing with this. I would take care of you if I could :( stay with us.",
      "created_utc": 1731348092.0,
      "score": 2
    },
    {
      "id": "lwmwb2x",
      "body": "im definitely a hypocrite because I struggle with thoughts like these on a daily basis but i just want to say that i care and i hope that you choose to carry on. i know words from a stranger may not mean anything, but please keep going.",
      "created_utc": 1731356362.0,
      "score": 1
    },
    {
      "id": "lws7bqr",
      "body": "Your wife needs you, daughter may suck but maybe you'll be a grandpa in a few years.",
      "created_utc": 1731434472.0,
      "score": 1
    },
    {
      "id": "lwzxgfo",
      "body": "Can you please tell us your okay? I'm sorry I can't imagine what your going through. You have any other family members you can talk to ",
      "created_utc": 1731539078.0,
      "score": 1
    },
    {
      "id": "lxjqhk8",
      "body": "Tomorrow is my birthday party and my last day on earth. There’s a lot of things I haven’t told my mom, But I couldn’t possibly tell her, But she’s gonna find out anyway. I don’t wanna be alive for it. I am a coward. I really am. I’m ending it all at midnight or if I have to, The morning of the 18th, Or before Midnight.",
      "created_utc": 1731818665.0,
      "score": 1
    },
    {
      "id": "lxnknpj",
      "body": "are you feeling any better right now?",
      "created_utc": 1731878827.0,
      "score": 1
    },
    {
      "id": "lxpq24w",
      "body": "[removed]",
      "created_utc": 1731907664.0,
      "score": 1
    },
    {
      "id": "lxqqlp2",
      "body": "66 wife struck and killed buy high-school foot ball coach never held accountable .I agree one hundred percent..no life after death only peace the only time I'find peace is when I sleep...",
      "created_utc": 1731930338.0,
      "score": 1
    },
    {
      "id": "lwm0qqo",
      "body": "[removed]",
      "created_utc": 1731346756.0,
      "score": 0
    },
    {
      "id": "lwnnlyi",
      "body": "Jesus is real. God doesn’t answer prayers in the way we want He answers them in a way that we grow. Hell is non existence and separation from God. It could easily be nothing and not fire. A sick wife and lack of family connection are very very difficult and stressful. Life is often overwhelming and seems hopeless but the hope is always there. I’m sorry you’re feeling this way, but I hope you keep getting up every day and trying. I’ll pray for you and your wife. There has to be something that brings you joy and keeps you going you just have to try and find it. I hope you do.",
      "created_utc": 1731364816.0,
      "score": -4
    },
    {
      "id": "lwpf9ui",
      "body": "Reach out to your daughter and tell her how you're feeling, I'm sure she'll be there for you in a heartbeat!!!!\nI know this isn't what she wants...",
      "created_utc": 1731388735.0,
      "score": 0
    },
    {
      "id": "lwph3yz",
      "body": "please reach out to your daughter , tell her anything you’re feeling and that you love her .. you are never alone in a world with millions",
      "created_utc": 1731389682.0,
      "score": 0
    },
    {
      "id": "lwrh8tm",
      "body": "I believe that there is life after death, and suicide does not solve anything. \nif you \"come back\" after a heart attack, you're not actually dead.",
      "created_utc": 1731426400.0,
      "score": 0
    },
    {
      "id": "lwkoh69",
      "body": "There is a God but she's pure evil.....",
      "created_utc": 1731330349.0,
      "score": -36
    },
    {
      "id": "lwo9ued",
      "body": "[removed]",
      "created_utc": 1731372522.0,
      "score": -2
    },
    {
      "id": "lwoc670",
      "body": "[removed]",
      "created_utc": 1731373341.0,
      "score": -2
    },
    {
      "id": "lwliosy",
      "body": "proof there is no god?",
      "created_utc": 1731341173.0,
      "score": -14
    },
    {
      "id": "lwkpiig",
      "body": "Me too",
      "created_utc": 1731330792.0,
      "score": 34
    },
    {
      "id": "lwl6yme",
      "body": "I wish you were my grandchild ",
      "created_utc": 1731337365.0,
      "score": 111
    },
    {
      "id": "lwnau6l",
      "body": "This should be an auto-response post everytime someone posts here, very true snd beautiful and hopefully useful to those who need to hear.",
      "created_utc": 1731360797.0,
      "score": 19
    },
    {
      "id": "lwlfq67",
      "body": "It really is unfair. Some people like to mention karma, but in truth bad things can happen to good people for no reason.",
      "created_utc": 1731340241.0,
      "score": 20
    },
    {
      "id": "lwkwy9w",
      "body": "She's being taken care of, but no improvement ",
      "created_utc": 1731333753.0,
      "score": 20
    },
    {
      "id": "lwl31jj",
      "body": "No response yet from the Philippines. ",
      "created_utc": 1731336012.0,
      "score": 3
    },
    {
      "id": "lwua0ii",
      "body": "How can I get help? There's no help here in the Philippines. ",
      "created_utc": 1731458595.0,
      "score": 1
    },
    {
      "id": "lwm0r2j",
      "body": "My daughter's not.",
      "created_utc": 1731346759.0,
      "score": 1
    },
    {
      "id": "lwua9mh",
      "body": "I am a grandfather of 3. But they cannot help, daughter won't help. ",
      "created_utc": 1731458683.0,
      "score": 1
    },
    {
      "id": "lxpqfwx",
      "body": "in fact i made this account just to help you, to communicate to you to see if you are okay now.",
      "created_utc": 1731907860.0,
      "score": 1
    },
    {
      "id": "lwkt3u9",
      "body": "!THIS!",
      "created_utc": 1731332259.0,
      "score": -29
    },
    {
      "id": "lwlk0hx",
      "body": "Bad things happen to good people. And good things happen to bad people. Prayers don't work no matter how hard you try. And there are so many religions, with so many beliefs you don't even know which one is the right one.  Different beliefs, different gods, which one is the real one since every religion says they are the true one. \n\n\nWhen I had a heart attack and went down for about a minute,  there is nothing.  Just darkness. \n\n\nNo Heaven, no Hell. Just nothing. \n\n\nNow maybe other people see a different thing,  but for me it's nothing. ",
      "created_utc": 1731341589.0,
      "score": 25
    },
    {
      "id": "lwmijc3",
      "body": "While I don’t believe that bad things happening to good people and all the other things that are being said in this thread, are proof there is no god, I don’t believe in a god. Proving a negative outside of mathematics may actually be impossible. I won’t say there is no god, but it doesn’t seem anyone has any substantial evidence that there is a god or that the god hypothesis is even possible, never-mind probable. Heck, I’ve yet to even hear a coherent definition.",
      "created_utc": 1731352161.0,
      "score": 7
    },
    {
      "id": "lwmtj65",
      "body": "I never had a grandad, would be cool to talk to u a bit about life, been struggling a bit myself recently",
      "created_utc": 1731355513.0,
      "score": 45
    },
    {
      "id": "lwq13gi",
      "body": "I'm really sorry to hear your pain. I hope that msg can help you heal, even just a little. Please know that you are a special person and their is some good people in this world who would really appreciate you and I bet they do.",
      "created_utc": 1731402114.0,
      "score": 2
    },
    {
      "id": "lwmo36q",
      "body": "It seems a lot of bad things happen to good people while the bad guys have lots of money, freetime, not a care in the world, good health, and then after a long long life of 90 years, karma says hello. Yea...",
      "created_utc": 1731353852.0,
      "score": 11
    },
    {
      "id": "lwl3rk9",
      "body": "Is she conscious/aware of her surroundings?",
      "created_utc": 1731336267.0,
      "score": 15
    },
    {
      "id": "lx9q32g",
      "body": "Well tell me a little more before throwning the towel in it sounds like you would go for help but the issue is if someone was willing to help would you accept it? You say your wife is unwell does she have a diagnosis? You have no job now what did you do before? It's hard to help without knows some of your situation, you maybe 62 doesn't mean you should give up what would your life do in your situation?",
      "created_utc": 1731681591.0,
      "score": 2
    },
    {
      "id": "lwlllpc",
      "body": "why can't god exist and bad things happen to good ppl?",
      "created_utc": 1731342089.0,
      "score": -8
    },
    {
      "id": "lwm2z9t",
      "body": "I just want to say, the fact that you had a heart attack doesnt mean you died. Your soul didnt leave your body, and your body didnt stop functioning. You didnt die and come back, that is literally impossible\n\nAnd if it was, and assuming that there is heaven and hell, do you think you would have gone to heaven/hell for a minute and then came back?",
      "created_utc": 1731347439.0,
      "score": -7
    },
    {
      "id": "lwmisbv",
      "body": "why would it not be possible? and my definition of god is \"something that intentionally created the universe\"",
      "created_utc": 1731352237.0,
      "score": -2
    },
    {
      "id": "lwp95d1",
      "body": "I second this! I’d love to talk to you! Adopted grandchild",
      "created_utc": 1731385817.0,
      "score": 7
    },
    {
      "id": "lwo3s44",
      "body": "It's just random...",
      "created_utc": 1731370392.0,
      "score": 3
    },
    {
      "id": "lwl723d",
      "body": "Barely ",
      "created_utc": 1731337398.0,
      "score": 11
    },
    {
      "id": "lxakiil",
      "body": "I'm a writer. But here in the Philippines they retire old ones at 60.  Wife had a second stroke and paralyzed half body and can't speak.  Need money for medicines and therapy.",
      "created_utc": 1731690799.0,
      "score": 1
    },
    {
      "id": "lwlnynb",
      "body": "That's your belief,  God letting good people suffer and letting bad people enjoy their lives. Your next question would be, what's the proof. I just pity you if you can't even read the news what's happening around the world, and has happened even in the past. ",
      "created_utc": 1731342823.0,
      "score": 8
    },
    {
      "id": "lwm64hn",
      "body": "U quite literally die from a heart attack, do you even know what a heart attack is? When the heart’s blood supply is cut off, the heart muscle can be damaged and begin to die. If left untreated, the damage can be irreversible. So yes it is fatal there are numerous stories of people experiencing death then living to tell search it up.",
      "created_utc": 1731348386.0,
      "score": 8
    },
    {
      "id": "lwpjr88",
      "body": "I find it hilarious you’re apparently in med school and actually believe that we have “souls”.",
      "created_utc": 1731391119.0,
      "score": 2
    },
    {
      "id": "lwmzsjx",
      "body": "Possibility is like probability, it has to be proven. And while that definition may seem surface level coherent... It doesn't actually define what a god is, it describes what a god does.",
      "created_utc": 1731357433.0,
      "score": 6
    },
    {
      "id": "lxf5ol3",
      "body": "Thank you. You are kind!",
      "created_utc": 1731758458.0,
      "score": 2
    },
    {
      "id": "lwpg5d7",
      "body": "It’s random, yup. Though I think it appears like a pattern because there are rich people who are psychopathic (an example of one type of bad people) are parasitic and manage to live a long time because of low stress and using others and don’t have empathy for others and lack emotional depth so they seem to wind up okay at the expense of everyone else.",
      "created_utc": 1731389183.0,
      "score": 2
    },
    {
      "id": "lwmu3qg",
      "body": "I understand your pain and hopelessness, your situation is indeed overwhelmingly difficult. I would just like to say that the truly hopeless in this situation is your wife because of her state. I sincerely hope that you will find meaning and a source of happiness that will make you want to cling on to life, and perhaps some of the encouragement you got from many people here will help a bit. But I also hope that in the opposite scenario, she will not suffer more in the hands of others.",
      "created_utc": 1731355687.0,
      "score": 7
    },
    {
      "id": "lxcuve4",
      "body": "Also please look into this Philippine Charity Sweepstakes Office (PCSO): Offers financial assistance to stroke patients",
      "created_utc": 1731716948.0,
      "score": 1
    },
    {
      "id": "lxcvaue",
      "body": "Also why not become a tutor pass on knowledge you can be self employed",
      "created_utc": 1731717107.0,
      "score": 1
    },
    {
      "id": "lwlo6a4",
      "body": "so ur saying that makes u believe there is no god , ur not saying it disproves god?",
      "created_utc": 1731342890.0,
      "score": -8
    },
    {
      "id": "lwm7qac",
      "body": "First of all, yes I know what a heart attack is. I am literally in med school\n\nhttps://journalofethics.ama-assn.org/article/deaths-troubled-relationship-law/2020-12\n\n\"Death’s current legal definition requires *irreversible* cessation of cardiorespiratory function or *irreversible* cessation of all brain function\"\n\nYou are not dead until your heart, brain and lungs stop functioning and can not be restored to normal. These people didnt \"experience death\", because dying means you no longer can come back alive. These people never died in the first place\n\nEdit: spelling",
      "created_utc": 1731348875.0,
      "score": 6
    },
    {
      "id": "lwqg680",
      "body": "Point still stands. However, souls are a matter of belief. And nothing in med school contradicts the existance of souls\n\nI am a muslim, and muslims believe in souls. There are a lot of muslim physicians out there. Belief in souls is not uncommon\n\nSo its not like I believe in souls because I am uneducated or something",
      "created_utc": 1731411823.0,
      "score": 0
    },
    {
      "id": "lwn03nh",
      "body": "how does it not define what God is?",
      "created_utc": 1731357527.0,
      "score": -2
    },
    {
      "id": "lwlq7o2",
      "body": "Well if your concept of God is that he brings suffering and Satan brings happiness and comfort in this world and the next one, I salute your wisdom. It's different but probably you are correct on that. 😄",
      "created_utc": 1731343517.0,
      "score": 8
    },
    {
      "id": "lwn0e8m",
      "body": "It says nothing about what God is other than something. It is going to keep me chasing an answer. What is something?",
      "created_utc": 1731357616.0,
      "score": 3
    },
    {
      "id": "lwlqd5c",
      "body": "But it doesn't mean I believe in it.",
      "created_utc": 1731343564.0,
      "score": 2
    },
    {
      "id": "lwn0kqc",
      "body": "well we don't know anything about God so that's the least vague definition I could come up with.  the only thing that is implied about God is that God is something that may exist, and it is also implied that God intentionally created the universe (using the word intention to seperate it from natural creation)",
      "created_utc": 1731357671.0,
      "score": 0
    },
    {
      "id": "lwn19gp",
      "body": "And this is why I don't believe in a god. Because I don't just think we don't know anything about a god, I think just saying that shows that we don't even know if a god exists, or if it's possible, probable, or if the universe even needs a creator.",
      "created_utc": 1731357882.0,
      "score": 3
    },
    {
      "id": "lwn264p",
      "body": "You edited your comment after I responded so I'll continue here .. That isn't the only thing implied about a god, maybe it is the only thing you're implying, but plenty of people imply God not only intended to creat the universe, it intended to create humans (Hitler included), it is perfect, it knows everything, it is all good, it cares who you have sex with, it cares what food you eat,etc.... those are just the implications from one religion, there's thousands more",
      "created_utc": 1731358156.0,
      "score": 2
    },
    {
      "id": "lwn1y3r",
      "body": "I agree we don't know and I don't claim God is necessary",
      "created_utc": 1731358090.0,
      "score": 1
    },
    {
      "id": "lwn30cd",
      "body": "maybe i should've said those are the only things I see to be necessary regarding God's existence (assuming God exists and did create the universe)",
      "created_utc": 1731358410.0,
      "score": 1
    },
    {
      "id": "lwn3blg",
      "body": "Well then we agree...if a god does exist, it necessarily exists, but I'm still not convinced it does it exist.",
      "created_utc": 1731358504.0,
      "score": 1
    }
  ]
}