{
  "id": "1jteylm",
  "title": "It sucks that killing yourself hurts other people",
  "selftext": "I wish committing suicide wouldn't hurt my loved ones. I want to die because I'm in mental pain and because of that I really don't think I'm ever going to be able to achieve my dreams. My family is good to me though and they are also going through their own mental problems. They would most definitely blame themselves and be in even more pain than I am in right now, at least temporarily, if I committed suicide. I am not sure if I am willing to commit suicide anymore because I recently had a long talk with my sister and she revealed to me a little, how much my suicide attempt affected her and it was pretty bad. Idk. If I do commit suicide I hope and pray that my loved ones will eventually be doing very good afterwards. Life is such a heavy burden. I wish nothing existed☹️",
  "created_utc": 1744008167.0,
  "score": 979,
  "num_comments": 105,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1jteylm/it_sucks_that_killing_yourself_hurts_other_people/",
  "comments": [
    {
      "id": "mltqzhu",
      "body": "The last two lines are perfect",
      "created_utc": 1744008898.0,
      "score": 92
    },
    {
      "id": "mlu1a4g",
      "body": "[removed]",
      "created_utc": 1744015656.0,
      "score": 65
    },
    {
      "id": "mlty9ix",
      "body": "same. im actively trying to push away my family, particularly my mother and brother. i hope they hate me enough to where it wont hurt when i die.",
      "created_utc": 1744013581.0,
      "score": 40
    },
    {
      "id": "mlttnyj",
      "body": "I couldn't agree more",
      "created_utc": 1744010542.0,
      "score": 31
    },
    {
      "id": "mluhhme",
      "body": "The only thing that is stopping me is the pain I would cause others. I relate to your post very closely.",
      "created_utc": 1744025234.0,
      "score": 23
    },
    {
      "id": "mlx5b6u",
      "body": "I just wish they could see that it would be a relief for me to no longer be suffering, but the idea of “it would eventually get better” is so engrained that I think most people can’t ever handle the idea that some people are just better off dead and that dying is the getting better",
      "created_utc": 1744056866.0,
      "score": 21
    },
    {
      "id": "mm4z22m",
      "body": "I agree, the 1 time people have figured out that I don't want to be around anymore I was bombarded by \"we love you\" , \"we'd miss you so much\" , \"I can't go on without you\" . I understand that they think they are helping, but it just feels like they are using guilt to keep me around. No one has ever tried to help or even really talk to me about it. The conversation is always \"it would hurt us so much\"\n As soon as I was able to put the mask back on no one cared anymore. I think people just say what they think they're supposed to say, but no one really cares.\n\nI hope one day I can stop caring that it would hurt others and just disappear out of the world.",
      "created_utc": 1744161687.0,
      "score": 14
    },
    {
      "id": "mlylt97",
      "body": "Yes, it sucks. I just don't want to be around anymore. I've been keeping myself busy, trying to distract myself, trying to look like on the surface that everything is fine. But it's not fine. I'm miserable and sad, and I just want it to end. I don't want to hurt anyone but I'm completely fucking miserable.",
      "created_utc": 1744074744.0,
      "score": 12
    },
    {
      "id": "mm24i3z",
      "body": "That’s  why I haven’t done it , I secretly wish I didn’t have people that loved me,. So I could just do it and not feel guilty . I’m extremely numb and tired of everything.",
      "created_utc": 1744129927.0,
      "score": 9
    },
    {
      "id": "mlu24j9",
      "body": "Things can and do change in life. I find somehow it’s easier to see a way to fix the problems of other people and so I started asking myself; if I was someone else, what advice would I give to myself to improve my life. This level of detachment can actually help focus me and motivate me towards making the small changes that start the bigger changes that improve life. I lost my brother to suicide September 2023, I’m amazed I am still here; losing my closest family member my sibling I am always one step from uncontrollable sobbing I have never heard myself cry this way before not when I lost me best friend any other family my dog or a partner. But somehow I am here because I researched the neurobiology of my situation my own brain chemistry and I adopted some changes in my life to keep me from going the same way as my brother thus hurting my grieving family even more and breaking the hearts of my little nieces and nephew. It does suck that killing yourself hurts other people, but life can and will improve. I thought I would be dead but I’m not, I found a new home and a new job somehow. I am happy going to work and while I’ll never recover from losing my brother life is bearable and even at times enjoyable now. I hope you can find the same one day and I know one thing is that things change, sometimes with baby steps and sometimes just all by themselves!",
      "created_utc": 1744016224.0,
      "score": 6
    },
    {
      "id": "mluec1v",
      "body": "[removed]",
      "created_utc": 1744023660.0,
      "score": 6
    },
    {
      "id": "mlvt6vb",
      "body": "Lucky you to even have people who still know you exist.im not shaming your pain. Im just envious of others who still have something/someone.\n\n\nSorry. But do know all struggles and  mental pain are valid to me. I dont judge.",
      "created_utc": 1744042141.0,
      "score": 6
    },
    {
      "id": "mm00rx3",
      "body": "I was just thinking that I wish my mum didnt love me",
      "created_utc": 1744098679.0,
      "score": 5
    },
    {
      "id": "mlxo7jk",
      "body": "Im too numb and dissociated to wonder about others reactions if i went through with it. But your family being good to you is amazing. A lot of people feel suicidal due to toxic family. Thank you sharing this with us",
      "created_utc": 1744062886.0,
      "score": 5
    },
    {
      "id": "mlyvqli",
      "body": "i resonate with this so much. i have already been enough of a burden to my family and i know that ending it would just make everything for them worse, but i can’t handle life or anything anymore.  i’m so miserable and so done",
      "created_utc": 1744078361.0,
      "score": 5
    },
    {
      "id": "mm8ljsc",
      "body": "Sucks worse when you have no one who cares....I'm just looking for general advice of like a cocktail of meds to take at night. Every morning SUCKS when I wake up ",
      "created_utc": 1744217114.0,
      "score": 5
    },
    {
      "id": "mm9zkmp",
      "body": "I feel the same. I've pretty much been living for my parents for the past ten years but I've reached a point where I question whether my suffering is less important than theirs. I love them so much and I know it would break them but why do I have to just suck it up so they can live happily? I wish they would just understand that I'd be happier if I didn't exist.",
      "created_utc": 1744231534.0,
      "score": 5
    },
    {
      "id": "mmoveq6",
      "body": "most people never achieve their dreams or never have dreams.  things don't get better.  sorry.  if you stay alive it won't be because you achieved your dreams, it'll be because you gave up and that's really the sane option for people who cannot follow through.  don't expect anything more than shit.  shit is a lucky life.  living a dream is basically one in twenty million.  sadly life completely sucks.  if you choose life, don't expect much.  with death, the outcome is certain but in life you could win the lottery, otherwise expect shit.",
      "created_utc": 1744436821.0,
      "score": 4
    },
    {
      "id": "mlxu4qo",
      "body": "I've never actively tried but I feel this.\n\nThere was one time I'd wound up having an accident in a somewhat remote area in the dead of night. I've had thoughts on and off starting from my teen years but never could bring myself to harm. I was bleeding steadily and way too winded to sit myself up immediately. While I was forced to lay on the black top next to the road, I thought that this was a convenient opportunity...but primal fear turned out to be a powerful force. I realized I didn't *truly* want death...I just wanted the troubles to end or for something to make it worth it. Life really is troublesome. It is a weight scale, unbalanced.\n\nI have no answers to give you but friend, I hope that something tomorrow might bring you a smile. Blessings be upon you.",
      "created_utc": 1744064924.0,
      "score": 3
    },
    {
      "id": "mm0yikn",
      "body": "I very much agree. If it wouldn't hurt my loved ones I'd be gone by now. Honestly I'm surprised I made it to this year.",
      "created_utc": 1744116708.0,
      "score": 3
    },
    {
      "id": "mm2fdpx",
      "body": "This is the only thing keeping me alive. I don't want my mom to suffer and my daughter, while just a month old, will definitely feel the impact.",
      "created_utc": 1744133082.0,
      "score": 3
    },
    {
      "id": "mm5pcp8",
      "body": "Man I thought I was the only one who felt like this. I’m just nothing. Failed at everything I’ve ever done. Worked all my life just to be nothing. Can barely afford to live. Living is pointless, I don’t even know what happiness is anymore. I’m just here because i don’t wanna hurt other people. I hope n pray everyday that I die. Everyone is all happy n achieving their goals, prospering and I’m just constantly failing",
      "created_utc": 1744171726.0,
      "score": 3
    },
    {
      "id": "mmsxro1",
      "body": "everyone would be better without me, but at the same time, my absence would affect them.",
      "created_utc": 1744495795.0,
      "score": 3
    },
    {
      "id": "mmt120t",
      "body": "That’s why i’m trying to slowly push everyone away before I do it so they won’t be sad and instead be like thank god she’s gone ",
      "created_utc": 1744497000.0,
      "score": 3
    },
    {
      "id": "mlv1wlf",
      "body": "That’s not a bad thing to me. There are some people I want to hurt even if it’s just a little. I want to escape from people, I don’t care the damage I leave behind, they had no mercy on me and I won’t have any for them.",
      "created_utc": 1744033620.0,
      "score": 2
    },
    {
      "id": "mm43w92",
      "body": "I hear you. The worst is when I almost died of suicide in 2021, my family was sure I'd done it IN ORDER TO hurt them. Like, I've never done anything for the purpose of hurting someone ever in my life. Anyway, they made it super clear that me killing myself would NOT hurt them in the least. Which would be my green light, except other people on this earth care about me and would be hurt. You can't tell me it wouldn't be the best thing for my family, so I'm pulled in different directions. I just want to disappear and stop being a horrible person, but I don't want to hurt my cat.",
      "created_utc": 1744150911.0,
      "score": 2
    },
    {
      "id": "mm5pc0m",
      "body": "i feel the same 🙁 if only i could know that the people i loved would be okay, id be gone",
      "created_utc": 1744171717.0,
      "score": 2
    },
    {
      "id": "mm5pxu6",
      "body": "I too feel that way. It's quite overwhelming.",
      "created_utc": 1744171993.0,
      "score": 2
    },
    {
      "id": "mm8jaw6",
      "body": "Yeah, my father has been a great detareance for my offing,besides my cowardness.",
      "created_utc": 1744216456.0,
      "score": 2
    },
    {
      "id": "mmjokta",
      "body": "Thank got nobody would care after a week in my life :3",
      "created_utc": 1744371500.0,
      "score": 2
    },
    {
      "id": "mmkkr5n",
      "body": "Honestly, I think about killing myself every day. I hate having to wake up and go through life faking, whether it's at work or around friends and family. I've told my Mom several times that I thought about killing myself but she said it would absolutely devastate her.",
      "created_utc": 1744382761.0,
      "score": 2
    },
    {
      "id": "mmn9xm4",
      "body": "I wish committing suicide would hurt my parents for the rest of their lives. The most borderline narcissistic toxic people Ive ever had to deal with.\n\nEdit: but at the same time i dont want my siblings to go through the hassle of living without me for the rest of their lives",
      "created_utc": 1744412790.0,
      "score": 2
    },
    {
      "id": "mmplu1w",
      "body": "I feel it. I'm sorry that life is rough rn for you. The idea of hurting people is sometimes the only thing that keeps me from doing something stupid. And it frustrated me sometimes. I hope life starts giving you a break because you deserve it. We all do. <3",
      "created_utc": 1744453084.0,
      "score": 2
    },
    {
      "id": "mmrwta2",
      "body": "[deleted]",
      "created_utc": 1744483273.0,
      "score": 2
    },
    {
      "id": "mmwqcvh",
      "body": "I hate the fact that i exist and if i stop existing people that care for me will be sad",
      "created_utc": 1744558063.0,
      "score": 2
    },
    {
      "id": "mn0jka8",
      "body": "If only no one cared. I couldn't agree more",
      "created_utc": 1744607091.0,
      "score": 2
    },
    {
      "id": "mpt7f8w",
      "body": "It’s the worst part about it, if no one felt anything because of suicide it would be a lot easier to suicide right now, would do it right now if no one was affected",
      "created_utc": 1746004609.0,
      "score": 2
    },
    {
      "id": "mly76y3",
      "body": "Too right. It is a good thing we are not alone in this.",
      "created_utc": 1744069425.0,
      "score": 1
    },
    {
      "id": "mma4cu3",
      "body": "It’s passing the pain onto someone else and so the cycle continues",
      "created_utc": 1744232948.0,
      "score": 1
    },
    {
      "id": "mmaeks8",
      "body": "It's how I feel too",
      "created_utc": 1744236207.0,
      "score": 1
    },
    {
      "id": "mmchz8t",
      "body": "i know it’s the worst part about it",
      "created_utc": 1744266151.0,
      "score": 1
    },
    {
      "id": "mmdx8ee",
      "body": "When I'm thinking about suicide, I always hope they would find me before I pass out, so it won't be as bad as losing me forever, because honestly I just can't let my little brother suffer such things, maybe I just love myself too much and thinking I'm important",
      "created_utc": 1744292399.0,
      "score": 1
    },
    {
      "id": "mmg8ctt",
      "body": "Keep your family close. Have a support system when life gets shitty",
      "created_utc": 1744316960.0,
      "score": 1
    },
    {
      "id": "mmgicm5",
      "body": "Last two lines🥀",
      "created_utc": 1744319936.0,
      "score": 1
    },
    {
      "id": "mmiiz0q",
      "body": "I feel like it’s better that they would be hurt that you’re gone instead of just forgetting about you :(",
      "created_utc": 1744347401.0,
      "score": 1
    },
    {
      "id": "mmkhsyh",
      "body": "You just perfectly explained how a lot of people are feeling",
      "created_utc": 1744381873.0,
      "score": 1
    },
    {
      "id": "mmnd1fk",
      "body": "I think I’m going to do it at a far location",
      "created_utc": 1744413906.0,
      "score": 1
    },
    {
      "id": "mmopkvt",
      "body": "I fully understand this 😞",
      "created_utc": 1744433653.0,
      "score": 1
    },
    {
      "id": "mmq2mk7",
      "body": " I see this differently.  They are the reason I get up on bad days.  They are the reason I continue when all is grey.  Knowing how much hurt a friend had when her adult child committed suicide means I can never see myself actually doing this even on my darkest days when I can’t see going forward.",
      "created_utc": 1744461563.0,
      "score": 1
    },
    {
      "id": "mmupnxy",
      "body": "I don't have anyone to love, and no one loves me. I don't have the slightest picture of the pain you are going through, but consider this: if someone like me has the courage to live, you surely also do! Good luck!",
      "created_utc": 1744522359.0,
      "score": 1
    },
    {
      "id": "mmzfabh",
      "body": "Same here. I started going blind shortly after having kids and I would have never had them if I was going blind before. I have zero interest in living without vision. It’s so uninteresting. I want to take my life so badly but my kids love me so much so I’m torn. I wish I could explain it to him so he wouldn’t blame himself. I dunno what to do",
      "created_utc": 1744589859.0,
      "score": 1
    },
    {
      "id": "mn1qa20",
      "body": "This is my main hang-up. My mom’s cousin committed suicide when I was a baby; I never met her but to this day my family still talks about her and they’re still devastated over her death, nearly two decades later. No one was ever the same afterwards. I’ve thought about making my own death look like an accident to make it more palatable for them but with my history I feel like they’d know.",
      "created_utc": 1744632006.0,
      "score": 1
    },
    {
      "id": "mn3e3g0",
      "body": "Pretty much same, idk how my parents will ever cope with this, they are the sweetest and ever supporting to me but I keep on failing then in every aspect, I have lost confidence in myself long long ago, a bit of positive mindset has pushed me this far.  I don't find myself capable enough to do any good for anyone and ofc myself. I can't kill myself but there are times and it's becoming more and more frequent, when I wish I could just hang myself and make it easy for everyone in long term. Life is beautiful but it's just not for me, this failure and frustration has been turning me insane adding up the fact that how efficiently I try to hide it but it's becoming heavy, I've been trying to escape this but the more I try, the it frustrates me. Idk man, how long I'm gonna pretend that I will make it and be something to be proud of but deep inside there's always this voice that says \"you will always be a failure and the world will be much more better off without you\"",
      "created_utc": 1744651607.0,
      "score": 1
    },
    {
      "id": "mnx6mps",
      "body": "They won’t do well after you’re gone. I’m glad you realize it does affect other people and not just you.",
      "created_utc": 1745068180.0,
      "score": 1
    },
    {
      "id": "mmnowh7",
      "body": "I agree with you, it’s life.",
      "created_utc": 1744418311.0,
      "score": 2
    },
    {
      "id": "mlu2h95",
      "body": "I wish for this all the time. Sometimes I wish that I could just lie very still and then my particles would just start to dissipate and I won’t be there anymore.",
      "created_utc": 1744016461.0,
      "score": 43
    },
    {
      "id": "mlwkh6l",
      "body": "This was one of my favourite childhood fantasies",
      "created_utc": 1744050410.0,
      "score": 11
    },
    {
      "id": "mlubf27",
      "body": "I can assure you, that layer of hatedred will dissolve and it will hurt them. Thats what im scared of, that my mother would blame my father for being alchoholic in till my 20s. But pain is passed from generation to generation so there is no victim to blame, including my self ( i wish that o would be abejo to live up to these words.)",
      "created_utc": 1744022109.0,
      "score": 15
    },
    {
      "id": "mm2qadz",
      "body": "i promise you they won't. nothing is going to stop them from being hurt and trust me this hurt is the worst pain imaginable. they'll die evey single day from regret and from the pain of your absence.",
      "created_utc": 1744136123.0,
      "score": 4
    },
    {
      "id": "mn0p1fq",
      "body": "i promise you they’ll be broken. my dad did the same to his mom (my grandma) me & my mom  and were forever hurt by his loss. nobody is perfect but family sees all through that. family is everything. took me 25 years to finally realize… they say time heals but every day is harder, we miss him so much",
      "created_utc": 1744610141.0,
      "score": 1
    },
    {
      "id": "mmp84ak",
      "body": "It hurts far more than you could ever realize. Many times, children are the reason that parents have a will to live. That is my will to live. If I lost my children, the pain would be to unbearable. Do not push them away, embrace them. Talk to them, ask them for genuine help. The unfortunate reality is that you are now intertwined in your parents and friends live. If you end your life, you may be ending theirs as well. I cant imagine the paint you’re going through, but let me ask you, would you wish your pain on your worst enemy? The pain I feel now that my friend is gone is something that I wouldn’t wish on anyone. It feels like a piece of my soul got thrown to the void. I hope that you find your why out of this. Know you are loved. Reach out, please. Don’t throw your life away when you haven’t even been able to experience the beauty of the world yet.",
      "created_utc": 1744444423.0,
      "score": 0
    },
    {
      "id": "mmul49b",
      "body": "The problem is that, even if it feels like the better option for you - all it does is offload your pain onto those who care about you (even if you 'don't think they care about you that much').  \n\nSuicides can even trigger other suicides in families & communities, leading to clusters of preventable deaths that have a farther reaching impact then the original person could ever realize.  \n\nETA: I don't mean to come off as dismissive. I've been suicidal, & have also lost a loved one to suicide (whose death led to 2 more suicides within our local community).",
      "created_utc": 1744520005.0,
      "score": 1
    },
    {
      "id": "mlubmjn",
      "body": "[removed]",
      "created_utc": 1744022226.0,
      "score": 5
    },
    {
      "id": "mmol7q9",
      "body": "Thank you for writing that out. It’s an excellent perspective to share while you’ve overcome so much! I’m really glad you’re finding moments to enjoy and finding ways to hack your attitude, while also encouraging others in a positive way.",
      "created_utc": 1744431490.0,
      "score": 2
    },
    {
      "id": "mlxkaqh",
      "body": "Yeah, no worries. I get that not everybody has this. It’s a lucky problem to have. I’m sorry you don’t have that. It’s ok to be envious sometimes or even all the times, lol",
      "created_utc": 1744061598.0,
      "score": 1
    },
    {
      "id": "mlz7168",
      "body": "I can be your friend. my dicscord is nathaniel0506r",
      "created_utc": 1744082790.0,
      "score": 1
    },
    {
      "id": "mmolf19",
      "body": "I’m glad she does. I’m sure others do too",
      "created_utc": 1744431587.0,
      "score": 4
    },
    {
      "id": "mmihctz",
      "body": "Yea I agree with this",
      "created_utc": 1744346579.0,
      "score": 1
    },
    {
      "id": "mmrpdj9",
      "body": "also you're expected to pretend you like it.",
      "created_utc": 1744480870.0,
      "score": 2
    },
    {
      "id": "mmukh10",
      "body": "love this <3",
      "created_utc": 1744519679.0,
      "score": 2
    },
    {
      "id": "mmul36n",
      "body": "damn i think i’m subconsciously doing this too:(",
      "created_utc": 1744519990.0,
      "score": 1
    },
    {
      "id": "mlxlpmv",
      "body": "Yeah I see that. Some people don’t deserve our mercy. Just know that even though I don’t know you, you most likely didn’t deserve whatever happened to you and life is hard and nobody gets a manual on how to live correctly so idk your exact reasoning and your future, but if incorrectly inflicted self hatred is the reason you’re here on suicide watch, I hope you learn to love yourself someday soon, even if it’s in the afterlife ",
      "created_utc": 1744062063.0,
      "score": 3
    },
    {
      "id": "mmukr8a",
      "body": "same",
      "created_utc": 1744519820.0,
      "score": 1
    },
    {
      "id": "mm2h3rr",
      "body": "I want this more than nothing else in this world",
      "created_utc": 1744133566.0,
      "score": 6
    },
    {
      "id": "mlxjomo",
      "body": "Yeah ngl I did the same thing before my suicide attempt and my sister still got really hurt so.. there is no easy option😮‍💨",
      "created_utc": 1744061395.0,
      "score": 4
    },
    {
      "id": "mmp88ti",
      "body": "This is exactly want I’m saying! It feels like I’m in a nightmare every time I remember.",
      "created_utc": 1744444499.0,
      "score": 2
    },
    {
      "id": "mmzfij9",
      "body": "I have kids but I’m not finding it enough to sustain my and my health condition. Am I just a horrible person? I just can’t handle going blind like I am. I can’t take care of myself and kids too.",
      "created_utc": 1744589946.0,
      "score": 2
    },
    {
      "id": "mmokm30",
      "body": "Please don’t encourage someone else to ‘go for it’. Their loved ones would not be ‘fine’. Everyone has something they can give to the world and perspectives can change. \n\nYou probably can’t stop someone if their mind is made up, but there’s no need to drag anyone even further down. It won’t help you personally either.",
      "created_utc": 1744431200.0,
      "score": 2
    },
    {
      "id": "mn1nhv1",
      "body": "Not really, I'm a shut-in. But I cant hurt her",
      "created_utc": 1744630758.0,
      "score": 2
    },
    {
      "id": "mn2vo8b",
      "body": "I am so sorry to hear about you going blind. That’s horrible, despite this, you have wisdom that your children need. They look up to you and respect you even if they don’t show it. They have hard days to and they will fall and they will need advice once a father or mother could give. It doesn’t matter if you are blind or you have the best eye sight ever. Your children want you! Going blind would give a whole new perspective on life and a whole new level of not taking your time for granted! A whole new level of wisdom. You could be the next Stevie Wonder! You’re not even blind yet! Go see the world and appreciate its beauty! The living need you more than the dead. Killing yourself doesn’t make you a horrible person, you don’t want to hurt others, but the moment you become intertwined with others, if you try to rip yourself out of their lives, if they find the body, it will be an insanely traumatic moment that will truly change their personality and how much love they are able to get to others. Personally losing people, makes me not want to make connections out of fear I will feel that horrible pain again. The deep knots that form in the depths of my soul. I highly recommend getting professional advice. Those professionals have spoken to MANY people, and have been trained for it. It’s okay to ask for help!!!!!!!!!!!!!!! Please don’t give up!",
      "created_utc": 1744646108.0,
      "score": 1
    }
  ]
}