{
  "id": "1dfd9ve",
  "title": "I’m going to kill myself after I give birth",
  "selftext": "I (20F) have been with my boyfriend (21M) for 2.5 years, and he has made it clear he wants kids from the beginning. I’m diagnosed with autism and was always pretty firm on not wanting kids, but he made me feel like we would be able to handle it together if we had kids, so slowly over time I came around to the idea.\n\nA year and a half ago, I got pregnant but we were in a bad financial position, so I had an abortion early on. It was a mutual agreement, and I moved past it pretty easily, but he was really torn up about it. I told him when we’re able to bring a kid into the world, we would go through with it.\n\nSince then I’m making a lot more money and he also has a job now. Back in January of this year, I found out I’m pregnant, and expected to deliver at the end of August. He was very excited and told me he wanted me to keep it, and although for the longest time I didn’t want kids, I genuinely saw a future with this man and thought having a kid together was a beautiful thing.\n\nSometime in the last two months, he has gone from being excited about the baby— sharing ultrasound pictures, wanting to make sure I’m drinking enough water and eating enough for me and the baby— to not wanting this kid at all. He told me he realized he’s not ready for kids, and he’s not willing to “throw his whole life away” for one kid. He realized he doesn’t want to give up his own personal freedom and playing video games all day/not having any major responsibilities. Don’t get me wrong, those are all reasons I didn’t want to have kids in the first place and I communicated that to him, but back in January, he talked me into changing my mind because I thought “I love this man, we can actually support this child now, and my love is so strong that I want to start a family”.\n\nNow he’s giving me my options. We’re saving up for our own place, and my parents have money, so they let us stay at their house and we have our own bedroom and living room. They are EXTREMELY excited and supportive about a grandchild. I’m so grateful for them. But my bf says either he’s leaving once the baby is here and I have to be a single mom, we have to give the baby up for adoption and get kicked out by my parents, or to stage an accident to cause a late miscarriage and say it was a mistake. I’m pro choice but I’m 28 weeks pregnant, and he(the baby) moves around a lot, this is a real baby, nothing like the abortion I had at 6 weeks. I’m not a monster.\n\nBut I only changed my mind about kids because I thought we were going to do this together, he wanted it so bad. Now he’s completely flipped and talks about how unwanted this baby is for him and how he should have never convinced me to keep the pregnancy. I thought maybe he was just scared and he wasn’t good at showing it, but he’s made it clear he wants nothing to do with raising a child. Without a partner to co parent with, I would have never wanted this kid. I don’t want this kid to grow up with a regretful single mom or a dad who doesn’t want him.\n\nMy boyfriend says he loves me and wants nothing bad to happen to me, but I can’t raise a kid by myself. I don’t think I’m high functioning enough to do it without the other parent, but everyone tells me I’ll be an amazing mother. But my baby deserves so much better than me. No one is going to want to date and marry an autistic single mom who’ll never be able to drive. I thought I was super lucky with my boyfriend, and now I feel so blindsided.\n\nOnce my baby is born, I’m going to kill myself. My boyfriend can find someone to move in with, he’d have to anyway if he’s going to leave once the baby is here anyway. I’m saving up money and buying lots of baby items so it isn’t as big of a financial burden to my parents. My parents are amazing people and tell me I can live at home with the baby as long as I would like, so I feel comfort knowing they’ll have my baby to remember me by, and my son will have such a loving household.\n\nI can’t tell anyone this, so I came here to get this off my chest. I’m going to cherish the last two months I have with my boyfriend and my family. I never wanted to be a single mom, and I can’t bare to think about seeing my baby every day and him looking like my boyfriend, thinking how he’s gone back on his word hurts so bad. I would’ve just had another abortion and looked into better birth control if he had realized he didn’t want kids back then. We could have been a happy childfree couple. I hope when my son is older, he’ll understand. ",
  "created_utc": 1718322537.0,
  "score": 614,
  "num_comments": 248,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1dfd9ve/im_going_to_kill_myself_after_i_give_birth/",
  "comments": [
    {
      "id": "l8ilfk1",
      "body": "Do you have any other options that wouldn’t require you to raise the child? Autism is a valid reason to not want to raise kids- I decided as a teenager I would never have children because my sensory issues are so severe I think it would drive me to suicide too.  I can’t even live in a house with dogs.",
      "created_utc": 1718328387.0,
      "score": 202
    },
    {
      "id": "l8ie9kk",
      "body": "Do your boyfriend's parents know about bim going back on his word, or his suggesting for a late stage miscarriage? ",
      "created_utc": 1718325381.0,
      "score": 406
    },
    {
      "id": "l8ilklz",
      "body": "Op... I'd date and marry a single mom who is autistic.  You just need to find the right person.  And don't sell your self short.  You could be a great mom.   It sounds like you would have the support of your parents.",
      "created_utc": 1718328446.0,
      "score": 441
    },
    {
      "id": "l8izbpk",
      "body": "Please do not. Leave him, he's a scumbag. it's okay to not be ready but please do not leave that child without either of their parents. you have so much ahead of you, a man who does not respect your boundaries is not someone worth ending your life over. this does not bode well for your future with him. you're due in 2 months and now he's suggesting you fucking force a miscarry?? \nYou have many other options besides death and no  matter what you do, drop his ass. he does not fucking care for your safety, he cannot keep a commitment, and is untrustworthy",
      "created_utc": 1718334363.0,
      "score": 148
    },
    {
      "id": "l8ihnx3",
      "body": "Ur boyfriend sounds like an immature man child. Keep the baby, leave him and don’t look back. U can’t just change ur mind about having a kid🤦‍♂️ that’s the most irresponsible thing a person can do.\n\nHe’s telling u he loves u, but he’s willing to leave u with a child over a mistake he made. He sounds like a pus ngl.",
      "created_utc": 1718326799.0,
      "score": 296
    },
    {
      "id": "l8j3akt",
      "body": "Hey op I just wanna say I know exactly how you and I know how awful this feels. I'm autistic aswell and I am a mother and it can be done and as much as it is scary it is so worth it, especially if you have family to help. If you really can't do this maybe see if they will adopt them if you really really cannot do this. I get how scary this all is , pregnancy is along with parenthood is metal as all hell. I hope you make it through this and kick that man to the curb because when he is doing is just diabolical.",
      "created_utc": 1718336248.0,
      "score": 81
    },
    {
      "id": "l8j3uo7",
      "body": "Kick the useless boyfriend to the curb and raise your baby with love. I’m sorry he manipulated you and he’s such a pos. Please kick him out now. You should surround yourself with better people - it’s what changes your life the most. You can be so much happier without him, especially with your parents helping you.",
      "created_utc": 1718336514.0,
      "score": 69
    },
    {
      "id": "l8j224u",
      "body": "Maybe your parents would adopt the baby. You should dump that jerk. If he was meant for you, he wouldn’t be doing this to you. There are better men and you’ll find out if you stay. \nYou don’t know what you’re capable of yet. You can’t imagine what you don’t know.",
      "created_utc": 1718335646.0,
      "score": 30
    },
    {
      "id": "l8jd3rb",
      "body": "Girl, I’m in a similar situation like you. \nIm due in July, the father cried and cried to keep this baby. I didn’t want to keep it but I also couldn’t go through another abortion. So I kept it. \nSo much for “oh I’ll be there for you and the baby and we’ll do this together” I’ll never give up on you both” and \nHere I am now, doing this journey on my own. The father couldn’t care less to ask how me or the baby are doing. It’s even harder when you’re barely making ends meet like me. \n\n\nI’m telling you right now, Dump his ass girl. Save up save up save up Have the baby and do not put him on that paper. \nYou and only you will be the primary guardian of this child and then Give your parents temporary custody of your child so you can seek mental health help. \n\nThe journey seems hard and I cry almost everyday too but something just tells me to keep going. I’m not going to sit here and tell you that suicide hasn’t crossed my mind. It’s really hard to see the light sometimes, turn to god with tears and everything and just ask him to keep your faith and strength going. \n\nYou’ll be ok op. You’ll be ok 🤍",
      "created_utc": 1718341401.0,
      "score": 60
    },
    {
      "id": "l8ise3b",
      "body": "Just want to mention that I was pretty suicidal until I got my dumbass spouse out of my life. Turns out, getting rid of the source of my problems made me realize I was just with a terrible person and there wasn’t something wrong with me.\n\nI hope the same is with you too",
      "created_utc": 1718331311.0,
      "score": 66
    },
    {
      "id": "l8jyhol",
      "body": "Unhelpful comment: I fucking hate your boyfriend. It’s so normalised for fathers to bail on their partners and kids for a life they’d prefer when they a) wanted the baby and b) promised a set of conditions that encouraged pregnancy in the first place. Pregnancy is not getting a new sofa, it’s a body altering and life changing event. Too many treat it so casually. I hate it.  \n\n\nPotentially helpful comment: here’s what I would do - A) tell your folks what’s happened and have a discussion about whether they would be able to raise the baby. Be completely honest with them. Tell them what you’re thinking of doing. If you’re planning to take your own life, I’m pretty sure they would prefer to raise their grandchild and have a living daughter vs the horrendous alternative. \nB) Or put them up for adoption.\nC) Or have the abortion due to extenuating circumstances. You’re not a monster if you choose this option. It’s not your fault. Tell everyone it was a miscarriage. It would be awful to carry this secret alone, but I just don’t want you to die.\nD) See how you feel after you’ve had the baby \n\n\nBut ending your life because of this man will leave a whole world of grief more painful than you can ever imagine. Don’t punish your parents for something this shitty man has done. \n \nDump him please.",
      "created_utc": 1718355537.0,
      "score": 22
    },
    {
      "id": "l8jhlob",
      "body": "i hate your boyfriend so much, he sounds like an immature, horrible manchild who doesnt know what he wants in life. ditch that guy and focus on yourself and your baby. i promise with time, you will heal",
      "created_utc": 1718344055.0,
      "score": 14
    },
    {
      "id": "l8jaomv",
      "body": "I’d leave whether you keep the baby or not, that is extremely selfish of him in either way would have blamed yoy",
      "created_utc": 1718340051.0,
      "score": 11
    },
    {
      "id": "l8iiuuh",
      "body": "Am paying premiums for a good insurance, incase am gone and my family is taken care of. Very sorry to hear this, but that man is a pos. Let your parents know and get to an conclusion.\n\nWhen you won't be there when the baby grows up, he will be miserable. Baby deserves to have a loving mother :(",
      "created_utc": 1718327293.0,
      "score": 16
    },
    {
      "id": "l8jdp65",
      "body": "Don’t. He’s the one being a shitty person, not you. You shouldn’t have to miss out on all of the joys of your life because he’s being terrible. What if you just let your parents adopt your baby without hurting yourself? Yes they may be mad at you for a while but I’m sure they would rather be mad at you than to lose you.\nThey’ll be okay. You will be okay. No one will be okay if you hurt yourself, including your baby.",
      "created_utc": 1718341740.0,
      "score": 8
    },
    {
      "id": "l8imk18",
      "body": "[deleted]",
      "created_utc": 1718328873.0,
      "score": 55
    },
    {
      "id": "l8j0o7f",
      "body": "Your boyfriend sounds like a piece of work. Please try and stay, I believe in you and your parents sound amazing.",
      "created_utc": 1718334988.0,
      "score": 11
    },
    {
      "id": "l8j7g10",
      "body": "What a POS, this man is! As someone who has decided to be childfree because I don't want to pass on my mental and physical health issues to another person, I totally understand why you didn't want kids in the first place. But instead he convinces (wouldn't be surprised if manipulates) you to have a child, and then threatens to abandon you both. So if you are not open to a late term abortion or adoption, unfortunately, it's best to stick around, and raise the child, with your parents' help. However, either way, the boyfriend is absolutely not to be trusted.",
      "created_utc": 1718338321.0,
      "score": 5
    },
    {
      "id": "l8je20y",
      "body": "talk to your parents about all of this",
      "created_utc": 1718341945.0,
      "score": 6
    },
    {
      "id": "l8k8192",
      "body": "Please… As someone who has been a single mom for the last 16 months and my baby is turning 8 months old… please give this more time and patience, there are so many moments I was completely done with this world. It took my dad from me 2 years ago, I was the one who found him and it severely impacted me and I was certain I wouldn’t be alive much longer without him around but then I got pregnant, I quit my bad habits and I vowed that my baby would have a better, stable childhood regardless. \nI saw somewhere that said it’s better to have to one healthy parent than two toxic/unhealthy parents and you truly seem to care about this child\n\nI hope for your sake that you are here to witness their first word, their first smile, the first time they babble “mama”, the first time they hold your little finger with their tiny hands… these moments and feelings are something that follow and live in you forever and if you are certain about how you want to do this please think about making videos for every birthday, writing letters for when they’re sad, happy, excited, celebrating, suffering. Your child will inevitably search for their mom/dad once they are old enough\n\n I knew nothing would be harder than coparenting with a person who does not want my baby, but post partum is harder than anything I’ve experienced but I imagine it would’ve been worse for me with my child’s father involved because he was emotionally abusive, verbally abusive and I’m not trying to demonstrate to my child that his behaviour is acceptable. \n\nI hope in some way this helps but I know you’re a good person because you’re admitting you did not want a child but you are already a mom by showing that you’re ready to make some tough decisions and I just want to say I’m super proud of you and I do wish for the best outcome for you and your family💜\n\nSingle moms are some of the strongest women I know🫶🏼",
      "created_utc": 1718361989.0,
      "score": 6
    },
    {
      "id": "l8kdu1u",
      "body": "\"My boyfriend says he loves me and wants nothing bad to happen to me\" but has suggested you \"stage an accident to cause a late miscarriage and say it was a mistake\" as an option? He sounds more dangerous than anything. Whatever happens with this baby, get away from him asap.",
      "created_utc": 1718365139.0,
      "score": 6
    },
    {
      "id": "l8jmkn7",
      "body": "You have the enthusiastic support of your parents, who are financially and emotionally willing to support you and the baby. You don’t need him. \n\nAnd you don’t need to die. I understand how terrifying all of this must be! But it sounds like you have an incredible support network. Your life will be much different when the baby comes, but you will still be You. Your son wants you to in his life. Please stick around to get to know him. You’re so loved.",
      "created_utc": 1718347202.0,
      "score": 11
    },
    {
      "id": "l8ir9tt",
      "body": "Hey OP,\n\nManaging your autism, a relationship, work, and family is a lot. You're doing great despite all these roadblocks to happiness.\n\nKilling yourself because of these bumps is an extreme reaction to the pain you're going through. \n\nDrop the boyfriend. You're doing damn fine for yourself. Love and parenthood is not limited to staying together for the kids.\n\nWhat would make you feel happiest about the baby? Seeing them raised by people who have a complete home? Staying withn your family? Absolutely forcing your bf to not be just as afraid as you are about parenthood?\n\nYou're scared and parenthood is absolutely frightening, it can't be a end all for his lack of manhood and commitment.\n\n\nIf you can, start seeing a therapist and counselor to reaffirm your resolve and self-worth/esteem.\n\nYou are capable and badass with or without the bf.",
      "created_utc": 1718330835.0,
      "score": 20
    },
    {
      "id": "l8j6ctd",
      "body": "oh wow.. your boyfriend is a complete scumbag .  although i feel like you should never even think about having children unless you are fully prepared to do it on your own / already married. people & circumstances are always changing. regardless im sorry this happened to you",
      "created_utc": 1718337757.0,
      "score": 9
    },
    {
      "id": "l8jih6q",
      "body": "OP, tldr - your boyfriend is an abusive POS to say the least, and once you see your child, I strongly believe it'll make more sense. You are better off with him gone. This? This is YOUR LIFE. Don't let him dictate it anymore. He's not a prize.\n\nI'm autistic and I'm a mother.\nI want to say, OP, autism, while a pain and different for everyone - it does not define you. It won't define motherhood for you. It doesn't decide how it'll go. Yes, people out there will want a single mom, autism or not.\n\nYour BF sounds like a POS. OP, look at what he's done to you. He knew from the start, and now he's complaining how he doesn't want any of this when he knew exactly from the start what this meant for you. That child will do better WITH you and your family, and without him. I know it's not ideal. Life RARELY is.\n\nThere's no reason to end your life over this and fact is he can bounce but he has a responsibility now - his tune may flip again, but if it doesn't, you have a loving family, you have support, I'd suggest dumping him now. What he's done and his he's acting is just absolutely unacceptable. You deserve better. He convinced you to keep it and is now openly lamenting it - that's dreadful of him and you don't deserve to feel this way. I wish someone could get him to give his head a shake.\n\n\nSingle motherhood is hard, but you know what's harder? A shitty partner. You have good family who love you and that baby. It takes a village, not a boyfriend.\n\n\n\nPlease don't end your life. It's going to be so worth it. Not easy, no, but worth it. Your child will know love. It won't if he stays, your pathetic boyfriend.\n\nIn fact, without the flip floppy boyfriend who put you in this position to begin with and now wants to bounce as you're carrying a child, full of hormones and suddenly having to hear how he wants no part of it, reasons he tossed aside when they mattered to you - that child would be happier without him, not you.",
      "created_utc": 1718344588.0,
      "score": 5
    },
    {
      "id": "l8lh7ah",
      "body": "He’s abusing you,  girl. Don’t let this tiny little man drive you out of the world. Give the baby up and become homeless, or STAGE a potentially life threatening ACCIDENT!!??, or he’s leaving you?! Those “choices” would drive anyone into the grave but they are not your only choices. Keep the baby and rely on your supportive parents and break up with him.\nThen decide if you want to commit suicide on your own terms- he doesn’t deserve to take your life or the life of the baby HE WANTED like this. Also, open your heart to the possibility that your little one will bring so much joy and love into your heart and life that you might want to stick around for them. \n\nUnless I’m misunderstanding, He’s asking you to put your life in serious danger to accommodate his regret about the pregnancy he wanted and you didn’t. You don’t deserve that. I’m due at the end of July so I know how far along you are and I can’t believe he would even suggest that.",
      "created_utc": 1718380354.0,
      "score": 5
    },
    {
      "id": "l8jlody",
      "body": "Im also 20F, unfortunately how I was brought up I’ve seen it all. Name it, it happened. I’ve got 30+ years of wisdom to share. Nothing phases me. \n\n\nHowever upon reading this I was slapped with the hardest “what the actual FUCK”  in a long time.\n\nI don’t have autism but my sister does. I don’t see how you consider your autism cognitively debilitating, you have better grammar and language skills than any boy our age does lol. You’re a bright girl with a reasonable dilemma. \n\nI feel struck with horror and disgust, I don’t know this man but his actions say it all. Does he have any mental disorders? \n\nI’m trying to understand how he went from “destroyed that you got an abortion” to demanding one. Something isn’t quite right. Its contradictory",
      "created_utc": 1718346615.0,
      "score": 4
    },
    {
      "id": "l8jurly",
      "body": "Your boyfriend sounds like a waste of oxygen. He’s spent all this time convincing you to have kids (that you didn’t want) now you’re up the duff he’s dipping out? Scum.\n\nDump his ass!",
      "created_utc": 1718352856.0,
      "score": 4
    },
    {
      "id": "l8k3i52",
      "body": "Explain the situation and your feelings to your parents baby I’m sure they’d understand and kick that dumbass boyfriend to the curb he’s a POS",
      "created_utc": 1718359094.0,
      "score": 3
    },
    {
      "id": "l8j5ag8",
      "body": "If you're saying you can't raise a kid alone, there are support circles for you to get help. Imagine your wonderful parents having to explain to your child why they don't have a mum, or a dad?\n\nYou know how terrifying it is to be alone, you shouldn't force that on your child.\n\nIf he wants to walk away instead of manning up, let him, he's not worth your time or affection if he isn't willing to step the fuck up.",
      "created_utc": 1718337219.0,
      "score": 6
    },
    {
      "id": "l8j6yb9",
      "body": "all i can say is write letters and videos for the baby so he can see you as he grows up leave a lot of things for the baby so he knows he's loved by you.",
      "created_utc": 1718338066.0,
      "score": 11
    },
    {
      "id": "l8jmtyh",
      "body": "Your boyfriend is a fucking asshole. Please don’t end it because of a guy. & please to try therapy or reach out for help in some way. You don’t have to do this alone.",
      "created_utc": 1718347373.0,
      "score": 3
    },
    {
      "id": "l8jqfg4",
      "body": "You can keep the baby and get help from your parents. No need to suicide.\n\n\nDump your boyfriend ",
      "created_utc": 1718349784.0,
      "score": 3
    },
    {
      "id": "l8k0qtu",
      "body": "Don't listen to ur bf, he needs to step up and be responsable. Wtf is wrong with a man that convices a woman to bear his kid only to say he doesn't want it anymore? Make sure he atleast has to stick around with child support. Consequenses.",
      "created_utc": 1718357172.0,
      "score": 3
    },
    {
      "id": "l8kr3kh",
      "body": "Leave him and find a better person please",
      "created_utc": 1718371080.0,
      "score": 3
    },
    {
      "id": "l8ksehc",
      "body": "Something doesn’t add up here. With such an egregious betrayal, why would you be cherishing any time with boyfriend?",
      "created_utc": 1718371594.0,
      "score": 3
    },
    {
      "id": "l8ksru8",
      "body": "Many people would date an autistic single mother, personally, I'm an autistic woman too (I don't have kids yet) but believe me, most men would not consider either of those things a deal breaker.  I'm so sorry this is happening though, your boyfriend is a real asshole and you should just leave him, you and baby deserve better, he sounds like he could become an abuser tbh (he is emotionally abusive already for sure), have you told your parents what he's doing? \n\nPlease don't end your life over this asshole, it will definitely be hard being a single mom, but the fact that your parents are willing to help will make a big difference. Your feelings are valid and I definitely get why you just wanna opt out of life after the baby is born, but there is a very good chance in a few years your life will be way different, just try to hold on ok.",
      "created_utc": 1718371738.0,
      "score": 3
    },
    {
      "id": "l8l9vc2",
      "body": "I’d make him leave now. Don’t sell yourself short. I’ve been a single mom for 17 years. I have one son. Similar situation, dad so excited then just lost all grip on what raising a child meant and I could only raise ONE child and I chose my actual baby not the man baby I was with.\n\nGive yourself some grace, talk to your parents, research options, support groups for single mothers, anything to help you. \n\nRight now, you haven’t met your baby and you may realize life is worth living once you do. Or you may realize that adoption is the best option for you. At the end of the day, this is YOUR body and the options he gave you are only options if YOU WANT THEM TO BE.",
      "created_utc": 1718377879.0,
      "score": 3
    },
    {
      "id": "l8lnkq6",
      "body": "Don't get me wrong, i know it's not good advice, but being autistic myself i can imagine what change of plan and surrounding conditions will casuse for you. \"You love your boyfriend\" ? after pulling such a nasty selfish decision... ultimately driving you to conclude that you have to exit life because HE cannot hold up to what HE talked you into. \nHe deserves punishment. I know this is bad advice, but make his life hell. He has deserved it. \nFor you, I cannot know if there not better alternatives, and i am usually pro choice, but this is a full on baby, not just a cell accumulation anymore, so yeah... it's best to carry it out. \nBut he has not deserved being treated good by you after what he has done to your whole future life.",
      "created_utc": 1718382508.0,
      "score": 3
    },
    {
      "id": "l8lqnxd",
      "body": "If sounds like your parents are excited at the idea of having a grandchild and I'm sure they love you enough to support you and help you raise your child. It will be tough but you'll have their support and as your child grows older it will continue to love you back and be there for you in hard times. Don't abandon your baby and your parents the same way your boyfriend wants to abandon you. You should tell your parents what your boyfriend has said to you and ask for their help and advice. they would rather go through that with you, than go through it while also dealing with the loss of their daughter",
      "created_utc": 1718383545.0,
      "score": 3
    },
    {
      "id": "l8lrbsa",
      "body": "Oh honey, I'm so sorry. You are so young to be going through this. Two things:\n\nI'm a mom who's been suicidal and hospitalized for it and something that has kept me here is thinking about the fact that if my son ends up inheriting my depression and (god forbid) becomes suicidal, I know that I might be the only person who would understand and be able to help him. I don't say this as a way to guilt you or anything, but more as a way to think about your autism as a strength & something that makes you uniquely capable of supporting your baby if they also happen to inherit it. \n\nI'm curious - if your parents would be taking care of your baby in the event that you die, could you talk to them about adopting or taking over guardianship... without you having to die? They sound amazing, and knowing only what you've said here, it sounds like they adore you and would want to be given the chance to decide.",
      "created_utc": 1718383767.0,
      "score": 3
    },
    {
      "id": "l8m2a9s",
      "body": "what a horrid man😡😡i’m sorry you have to go through this🥺",
      "created_utc": 1718387459.0,
      "score": 3
    },
    {
      "id": "l8m2puh",
      "body": "Tell them what your boyfriend did. How he pressured you into having kids and now is forcing you to either not, or to be a single mother. They will probably support you no matter what, in a situation like this.",
      "created_utc": 1718387604.0,
      "score": 3
    },
    {
      "id": "l8n2k08",
      "body": "Sweetheart I am also a mom, and want to stress so hard that prepartum depression and anxiety are not as well known as postpartum depression and anxiety, but they are just as severe and crippling. I had terrible prepartum depression, and medications helped me a ton. And didn’t hurt my baby. Please, please, before you go ahead with any suicide plans look into getting evaluated at potentially treated for prepartum/postpartum (after you give birth) depression. I am also autistic. My son is 4 now, and is too. If you ever want to talk, please feel free to reach out to me.",
      "created_utc": 1718399939.0,
      "score": 3
    },
    {
      "id": "l8nh5em",
      "body": "Omfg I can't believe your boyfriend is doing you like this, what an utter lowlife POS. You should dump his ass immediately and when the baby is born put his ass on child support immediately! Don't let him bring you down, once your baby is born you're going to have such a strong loving connection and sounds like your parents are an amazing support system they will help you through this, don't give up.",
      "created_utc": 1718405750.0,
      "score": 3
    },
    {
      "id": "l8jb1qp",
      "body": "I don’t normally comment on here, but honestly idk what to say I hope your boyfriend is just going through something and doesn’t mean what he said. My wife and I had my son by accident neither of us wanted kids but I am glad he is here. The thing is though having a kid doesn’t completely get rid of any of your freedoms, I know from experience. It was hard at first but my son is now 4 and I am still able to game everyday while maintaining a job and taking care of my son and having a better relationship with him than my father did with me. Hopefully he will realize this is possible and this is just him being incapable of realizing it because being a parent is a new daunting thought for him.\n\nI can’t speak for the relationship or anything like that, but just know from a parent who didn’t want to be a parent sometimes it can be extremely hard and you may even borderline hate your child at times, but then there are good times that make all the bad worth it and you’ll feel more filled with love and wonder at the little life you brought into the world. I really hope you decide to stick around and experience it for yourself OP.",
      "created_utc": 1718340251.0,
      "score": 6
    },
    {
      "id": "l8jlrbk",
      "body": "your child will need you. He won’t have a mother or a father. you are needed in this world. you are so young you truly don’t know what will come in your life. You can be happy. This is just a time of your life, not your forever. Right now it feels like the world is ending, but maybe one day the thought of being a single mom won’t hurt as bad..",
      "created_utc": 1718346666.0,
      "score": 2
    },
    {
      "id": "l8jttil",
      "body": "> pretty firm on not wanting kids, but he made me feel like \n\nNo just no.",
      "created_utc": 1718352169.0,
      "score": 2
    },
    {
      "id": "l8jynd1",
      "body": "I posted something similar a few months ago, my baby is due on July. I still consider leaving this world after giving birth, I'm not sure what to do.\nI went to the psychiatrist a month ago and I started medication, it's helping a bit but im still in a bad place mentally, physically and emotionally. \nI can't help you with advice, but you're not alone, and that baby will be always a part of you in this world.",
      "created_utc": 1718355651.0,
      "score": 2
    },
    {
      "id": "l8kkhdr",
      "body": "I'm a mom of three. Please do not do this! Your baby, who is growing in your womb, will be searching for you after he or she is born. He or she has memorized the sound of your heartbeat, the sound of your voice, your smell... he or she already loves you. \nYou are young. There are plenty of men out there who will want to date you, even with a child and even with autism. Your parents need to hear what he has said and how you're truly feeling, that way they can be there for you. \nThere's also no shame in going on medication to help, there are pregnancy and breastfeeding safe medications that can help with feeling extremely low.",
      "created_utc": 1718368277.0,
      "score": 2
    },
    {
      "id": "l8kn8rj",
      "body": "As a 27yo, I feel all the other adults in the room failed you. Starting with your own parents, I'm 27 and barely feel mentally ready, I can't imagine at early 20's. Another thing is that mother's should be the ones to decide every time. Being a dad is easy, not anything like what people expects of mothers. A dad can have two families, cheat, enjoy hobbies, a mother can't. \n\nYou have to:\n1. Mourn the loss of your relationship, cry and allow yourself to let the pain go \n2. Recognize that man was flaky and immature as fuck, you seriously don't wasted anything because if he's like this with a kid, he would be like this when you got sick or needed help. \n3. Lean on your mom and dad, keep living with them and if it's possible for them to take care of the kid the first 6weeks, then better. \n4. Get perinatal and postnatal depression therapy, you need it.",
      "created_utc": 1718369483.0,
      "score": 2
    },
    {
      "id": "l8kp5v6",
      "body": "He sounds like a huge POS. Fellow Autistic here and being pregnant is my biggest fear. I can't imagine what you are going through right now. It sounds like he coerced you into the idea in the first place. And he's a scum bag with no sense of accountability.  I am angry FOR you. \n\nI know you mentioned you were for it when you thought you would be doing it together, but it sounds like you would have been doing it alone regardless. \n\nThat being said, it sounds like you have a great support system in spite of him. It sounds like you won't be alone in this. You still have options, people WILL still want to date you if you choose the single mom route (and better people). I am 30 and most of my friends are single moms that had kids young. Dating has not been an issue, or their partners also have kids. They also have friends with or without kids and time for life (more so after the baby baby stage). Or you can choose adoption. \n\nThis is all very  hypocritical of me to say, because if I were pregnant and forced to go through with it, I would likely be the one posting in this group instead of commenting. But I hope you don't feel like this is your only option. Things/life won't always feel exactly like it does right now.",
      "created_utc": 1718370288.0,
      "score": 2
    },
    {
      "id": "l8kx5x7",
      "body": "Your boyfriend is a prick i'm so sorry you have to go through this \n\nThis sucks my advice throw him out now heys waitsting you and your perants time and money since it's a  bit to late for an abortion and you alrady decided the child shoud live maby you can still let them be adopted by your perants aftee the birth just to be safe so they won't land in foster care system \n\nYou shoud deffenatly demsnd child suport from him since he wanted the bsby so bad\n\nYou sound like a very good personç and you perants are probably very good people \n\nMaby you can sit them dowen and talk with them abt it (you don't have to talk abt your wish to die) i'm shure they will be understanding i hope you feelt better after pouting out your heart",
      "created_utc": 1718373404.0,
      "score": 2
    },
    {
      "id": "l8kykq9",
      "body": "I am 47 years of age M and do not have kids as yet as my own belief is to do your own inner healing of your trauma first. all you can do is work on yourself and all all your partner can do is work on himself this way we can but and end to generational trauma. I can understand the feeling of wanting to end your life as the challenges can be hard but they can also be an opportunity to grow. Find your voice, it may have been quietened for some time but we can learn assertive communication. I have always send if someone treats from a place other than kindness and love its a projection of their own unresolved trauma. Honestly you may be unhappy or depressed I was diagnosed with a range mental health problems but you can navigate this and lead the life you wish to live and see the positive changes you wish to see. \n\n**“The invitation to change and set yourself free is always open. When you learn to pay attention you will find the invitation is always present in every moment, in every experience, in every breath and in every beat of your precious heart. It’s up to you to accept this invitation and to face the challenges and rewards. No one can do this for you. It has always been and always will be up to you and only you to set yourself free” - Martin Ball**",
      "created_utc": 1718373924.0,
      "score": 2
    },
    {
      "id": "l8l0qyp",
      "body": "your bf is a piece of shit im so sorry",
      "created_utc": 1718374708.0,
      "score": 2
    },
    {
      "id": "l8l1o10",
      "body": "Oh my gosh he is so sick. “Stage an accident”??!!?? This is a 28 week old grown baby. Wow that is truly psychopathic behaviour",
      "created_utc": 1718375037.0,
      "score": 2
    },
    {
      "id": "l8l6j58",
      "body": "Life begins at breath, if you want an abortion, do it. There is no baby yet, why would you be a monster for it?",
      "created_utc": 1718376737.0,
      "score": 2
    },
    {
      "id": "l8lt7xd",
      "body": "Tell your parents what he did and said. Tell them because it seems they will have your back 100% and support you, when this guy can't even figure out what courage and responsibility is.",
      "created_utc": 1718384398.0,
      "score": 2
    },
    {
      "id": "l8lu1hr",
      "body": "Don’t you see how backwards it sounds by saying “I don’t want my child to grow up with one parent” when in reality it would be no parents if you made that mistake? Give it time. 2 months is a long enough time for emotions and circumstances to change. There’s a chance he’s scared and this is his way of dealing with it. There’s also a chance that feelings will change once the baby is born. It’s a beautiful experience. But regardless, you’re stronger than you want to believe, and will find a way to make things work for the sake of the child. Whether that’s with or without him. Things will always work out if you just give it time.",
      "created_utc": 1718384676.0,
      "score": 2
    },
    {
      "id": "l8m1toh",
      "body": "I’ve been a single woman on and off throughout my life (now in my 50s and single) and it seems like it’s often easier for a single mother to get a date, seriously. Many men are not put off at all by kids, especially men looking to settle down.",
      "created_utc": 1718387302.0,
      "score": 2
    },
    {
      "id": "l8mocnj",
      "body": "If he leaves please take him to court and take every cent you can from him. If he wants to leave you then make sure to take as much as you can from him. If you bring up his ultimatum of asking you to force a miscarriage he's cooked.\n\nLike if he wants no responsibilities and lots of free time to play game then make that difficult for him financially 🙃",
      "created_utc": 1718395030.0,
      "score": 2
    },
    {
      "id": "l8msuga",
      "body": "Baby, it's gonna be okay.  First, kick his arse out and stay with your parents. You are lucky to have support like that. No matter what you do, you need to get away from him for a bit before you make that kinda rash decision.",
      "created_utc": 1718396560.0,
      "score": 2
    },
    {
      "id": "l8mva7i",
      "body": "Fuck your BF, you can do this my baby is 2 yrs old and is the light of my life, the only thing keeping me from merking myself",
      "created_utc": 1718397390.0,
      "score": 2
    },
    {
      "id": "l8mx288",
      "body": "You say you “don’t want your kid to grow up with a regretful single mom and dad absent dad” but your kid is going to be a lot more fucked up with a dead mom and absent dad. Even if you think your baby deserves better than you as a mom, your baby ALSO deserves better than living their whole life wondering why you’d do that to them/ because of them. I have a lot of friends who are autistic and single moms and find amazing partners, or realize how much they’re truly capable of when they have no other option. A night crying with your baby will still be a better memory than your parents losing one baby for another who will never understand all this. I had a friend when I was a kid, like 10 years old, and her dad had killed himself when she was a baby and her entire identity was being a daddy’s girl and mourning over never having him. Your child will want you no matter how much you hate that. Even if you gave them to your parents or to an adoptive couple, we all wonder who we come from. Don’t erase yourself. It will truly be amazing with or without that asshole of a “man”",
      "created_utc": 1718398004.0,
      "score": 2
    },
    {
      "id": "l8niiun",
      "body": "At least don't leave him alive and well. Better alive and unwell. Hit him hard on the head and strip all his all non-vital functional organs that allows to have any fun or even just a meaning in existence.",
      "created_utc": 1718406331.0,
      "score": 2
    },
    {
      "id": "l8o96j0",
      "body": "I am autistic. I have ADHD, and I’m a mother of two and my husband killed himself last year. Please do not leave your child without either parent children of parents who died by suicide or three times more likely to also die by suicide the younger they are when they lose their parent the more likely they are to also do it please open up to your parents about what’s going on there is hope for your situation.",
      "created_utc": 1718418067.0,
      "score": 2
    },
    {
      "id": "l8ocoa4",
      "body": "You deserve better.",
      "created_utc": 1718419685.0,
      "score": 2
    },
    {
      "id": "l8p0oxh",
      "body": "what an asshole he is, you shouldn’t be sacrificing urself because of that irresponsible, childish, indecisive and weak man. your child would be worse off when he realizes he never gets to meet his own mother again because of his terrible dad.. that child deserves love and you would definitely be an amazing mother. leave him immediately and soon you will realize suicide wasn’t the answer and will never be. please don’t give up",
      "created_utc": 1718434164.0,
      "score": 2
    },
    {
      "id": "la2g9v5",
      "body": "Also you’ve got that money thing going. I really don’t  mean to sound insensitive but it’s really not worth it to throw your life away for this piece of shit. I would suggest tell your family everything how he is and how unreliable he is. To me at least it seems like you will be better off without him. He doesn’t contribute and apparently prefers his games over his family.",
      "created_utc": 1719245618.0,
      "score": 2
    },
    {
      "id": "la2hzwg",
      "body": "Please talk to your parents about all of it. Kick your bf out and actually i'd sue him if you have any proof of what he said. At 28 weeks the baby would be preterm but with very good chnaces to survive, you're right in saying it's already a full developed human. Please please please talk to your parents, you got nothing to lose if killing yourself is your plan, right? Maybe they can help you raise the kid or find a better solution.",
      "created_utc": 1719246191.0,
      "score": 2
    },
    {
      "id": "la3wma5",
      "body": "I would rather get a late abortion than kill myself. Just saying.",
      "created_utc": 1719262891.0,
      "score": 2
    },
    {
      "id": "lrii4wo",
      "body": "Hey love, I am also an autistic female. I know it’s really hard to not think in black and white and all of these changes at once is HELL. It sounds like you have an amazing family, minus your punk-ass bf, and will have help with the transitions into your new routines. I hope you’re still here. 💜🖤💜🖤",
      "created_utc": 1728702375.0,
      "score": 2
    },
    {
      "id": "lwjf6g8",
      "body": "Hey OP I just wanted to say I’m glad you’re still with us and I’m sorry about your dog. I hope you’re in a better place now, I hope you have support and I hope that dog shit boyfriend of yours is now an ex. ",
      "created_utc": 1731303267.0,
      "score": 2
    },
    {
      "id": "l8lpqjg",
      "body": "I totally get it, the world is cruel and unfair to women. \n\nAnd sorry but your boyfriend is a piece of shit acting like this when he persuaded you to do this. Absolut a-hole. You’re in a vulnrable state and he is only thinking about himself.\n\nI’m actually pissed of by people saying you should live for the sake of the child. \n\nYou can’t live for someone else. Of course this is very sad and tragic for both you, your son and your parents but the only one to blame is your boyfriend\n\nIf you decide to end it maybe you can write a letter to your son that he can read in the future. Your parents could keep it until he come of age\n\nI just assume your life isn’t good in other areas awell and you struggled even before this. Because if it wasn’t you should try to seek help first..",
      "created_utc": 1718383235.0,
      "score": 3
    },
    {
      "id": "l8irhqo",
      "body": "[deleted]",
      "created_utc": 1718330928.0,
      "score": 4
    },
    {
      "id": "l8j2kgd",
      "body": "Maybe You could still have an abortion? It's more important You get to live Your best life and don't have to throw it away or die.\nThe infant is not a person yet.",
      "created_utc": 1718335895.0,
      "score": 2
    },
    {
      "id": "l8j1bdg",
      "body": "Just what happened to cause that flip? You both WERE making efforts, and now he just ain't. This really needs to be brought up to him AND the parents very seriously.",
      "created_utc": 1718335290.0,
      "score": 1
    },
    {
      "id": "l8jmyu2",
      "body": "madam, I am 20 myself and you have done a lot more than I am, i hope that you don't do that, there's a baby waiting for you and he/she will grow up without a mother and that's one of the saddest things in the world, and be the best mom you could ever be to you're child 🫂",
      "created_utc": 1718347462.0,
      "score": 1
    },
    {
      "id": "l8jp32h",
      "body": "If your baby deserves better than you than they deserve better than your boyfriend as well :( I know it’s painful but please consider adoption I mean….does this world need another unwanted child. If you find someone who wants a baby at least you could be a part of their life in the future if you ever do change your mind.\nYou can be a part of choosing them.\nI don’t want to guilt you but ending your life because you had a child…this child will know this if you leave them with your boyfriend, it will probably be the theme of their life.",
      "created_utc": 1718348868.0,
      "score": 1
    },
    {
      "id": "l8jqrsh",
      "body": "Please talk to his parents and yours about this see what they say and how they can help you and your unborn baby your child will need you please stay strong for your child's sake don't leave them with out a mum",
      "created_utc": 1718350020.0,
      "score": 1
    },
    {
      "id": "l8jt4av",
      "body": "I would marry, if  I was a man. Be patient, time will show you changes. Anything can change overnight. Have patience. I know what it is like to lose any hope in life. Have faith, I am alive you should be too <3",
      "created_utc": 1718351666.0,
      "score": 1
    },
    {
      "id": "l8k1zaj",
      "body": "Give your baby for adoption. Is that not an option?",
      "created_utc": 1718358052.0,
      "score": 1
    },
    {
      "id": "l8k2272",
      "body": "leave him and raise the baby with your parents",
      "created_utc": 1718358108.0,
      "score": 1
    },
    {
      "id": "l8l6e8r",
      "body": "Your kids going to wonder wtf happened at 18 or earlier why their dad is an ahole and why they don't feel like they actually fit in the family trust it's not that easy get rid of him it's better off being a single mother instead of with a shifty dad for comfort",
      "created_utc": 1718376690.0,
      "score": 1
    },
    {
      "id": "l8l6m1q",
      "body": "My mom had kids with a guy for that exact reason fuck that I spent half of my childhood hating all males and my mother for being with him I rather struggle then be crying from goofy dudes",
      "created_utc": 1718376764.0,
      "score": 1
    },
    {
      "id": "l8ldz2r",
      "body": "Could you put the child up for adoption? Perhaps choose the parent(s) yourself?",
      "created_utc": 1718379266.0,
      "score": 1
    },
    {
      "id": "l8lwumg",
      "body": "This is a lot and I feel the weight of your words. Is adoption an option for your baby? If you are going to have to give birth anyway, it could lead to happy lives for both you and the baby.",
      "created_utc": 1718385623.0,
      "score": 1
    },
    {
      "id": "l8mdjc9",
      "body": "Tell your folks and kick his ass to the curb.",
      "created_utc": 1718391305.0,
      "score": 1
    },
    {
      "id": "l8mh8b2",
      "body": "I actually plan on ending it if I CANT have a kid this year especially since I can’t adopt 😒",
      "created_utc": 1718392579.0,
      "score": 1
    },
    {
      "id": "l8mhloc",
      "body": "Through him out",
      "created_utc": 1718392710.0,
      "score": 1
    },
    {
      "id": "l8mzkb3",
      "body": "Divorce your husband. Dont stay with a man that would leave u for having the baby he asked for.",
      "created_utc": 1718398862.0,
      "score": 1
    },
    {
      "id": "l8nf3a5",
      "body": "OP can you talk to your parents, Tell them you feel you'll need support during motherhood, I mean they probably already know that, but give them the heads up, this baby will be the making of you!!",
      "created_utc": 1718404892.0,
      "score": 1
    },
    {
      "id": "l8ngc4d",
      "body": "Can’t you put them up for adoption and stay alive? You can both relinquish your rights and surrender your child while both of you remain alive.",
      "created_utc": 1718405411.0,
      "score": 1
    },
    {
      "id": "l8ni5ni",
      "body": "you could be so happy with this baby just move in with your parents and feel all the love from your baby and your family. dont do something that you WILL regret",
      "created_utc": 1718406174.0,
      "score": 1
    },
    {
      "id": "l8nunjh",
      "body": "This guy in insane. He doesn’t care at all about your well-being. LEAVE HIM",
      "created_utc": 1718411581.0,
      "score": 1
    },
    {
      "id": "l8olzj7",
      "body": "Did you tell your parents what he said to you?",
      "created_utc": 1718424597.0,
      "score": 1
    },
    {
      "id": "l98pgew",
      "body": "dont do that😐\nturn to God please",
      "created_utc": 1718758429.0,
      "score": 1
    },
    {
      "id": "la75i4y",
      "body": "YOU CAN DO THIS!!!",
      "created_utc": 1719319591.0,
      "score": 1
    },
    {
      "id": "lqqdkrq",
      "body": "[deleted]",
      "created_utc": 1728276357.0,
      "score": 1
    },
    {
      "id": "lu5zg4s",
      "body": "egy szó: elbasztad!",
      "created_utc": 1730118815.0,
      "score": 1
    },
    {
      "id": "luyps52",
      "body": "Are you still here? ☹️",
      "created_utc": 1730516310.0,
      "score": 1
    },
    {
      "id": "l8jvw21",
      "body": "Courage OP, you seem like a good person, unlike your bf who thought that he could changes his mind about having a child after asking you for one... Please give it a try, experience a mother-child's bond 🌻",
      "created_utc": 1718353664.0,
      "score": 1
    },
    {
      "id": "l8l4tai",
      "body": "Suicide is never a good idea. Don’t do it please. It’ll destroy you, your parents’ life and your son’s life. There’s definitely a or several ways better than this option. You’re not thinking properly/ rationally right now because you’re really upset. Please talk to a professional as in a good psychiatrist about this. Let your parents know how you feel and that you’re contemplating suicide. \n\nDon’t punish yourself and your parents and son by doing this. The world needs good people like you. Also you know what they say about suicide- it’s a permanent solution to a temporary problem. When you’re that young it can seem like killing yourself will solve your problems but it’s a really bad idea. You may end up with bigger problems than before.\n\nEdit- Tell your parents everything.",
      "created_utc": 1718376148.0,
      "score": 1
    },
    {
      "id": "l8jb1jz",
      "body": "I hope u r safe. No violence?",
      "created_utc": 1718340248.0,
      "score": 1
    },
    {
      "id": "l8jvsrq",
      "body": "Please, you need to consider adoption, what everyone else thinks has no significant validity if you are on the verge of suicide!\n\nGo to your gynecologist, the person who handles this, and ask about the adoption options. You can have an open adoption, which means you can later connect with the son, later in life.\n\nOption 2. You can ask your parents to adopt the child.\nBecause you need to be clear that you don't see yourself as a single mother-to-be, and you are to fragile as it is.\n\nThen, after birth, get the IUD, that's Intrauterine devices (IUDs) are small contraceptive devices that are inserted into the uterus (womb) to prevent pregnancy.\nIf you have more questions, go to r/childfree, they help you with questions like adoption and IUDs and the like.",
      "created_utc": 1718353599.0,
      "score": 1
    },
    {
      "id": "l8k9fvi",
      "body": "[removed]",
      "created_utc": 1718362798.0,
      "score": -2
    },
    {
      "id": "l8jlgn6",
      "body": "that's why i believe marriage is a real commitment before having a child",
      "created_utc": 1718346475.0,
      "score": -1
    },
    {
      "id": "lz7fy6t",
      "body": "I'm going to kill myself after giving birth right at the hospital in the same bed I delivered in so I really don't feel alone now",
      "created_utc": 1732689794.0,
      "score": 0
    },
    {
      "id": "l8lxsla",
      "body": "[removed]",
      "created_utc": 1718385941.0,
      "score": -4
    },
    {
      "id": "l8id260",
      "body": "i would as well but don't your kid needs you",
      "created_utc": 1718324882.0,
      "score": -19
    },
    {
      "id": "l8jtpae",
      "body": "It must be hard to lose a child you so desperately want. A man can't carry a child so they are at the mercy of what a women wants.   \n\nWisely choose a partner that wants the same things you do. Let him go. Do not torture him when you clearly do not want a child.",
      "created_utc": 1718352086.0,
      "score": -6
    },
    {
      "id": "l8j8xod",
      "body": "[removed]",
      "created_utc": 1718339104.0,
      "score": -30
    },
    {
      "id": "l8jg674",
      "body": "You are so young and you only have one child. You could have another if you wanted and many men would date a woman who has a child.",
      "created_utc": 1718343193.0,
      "score": -4
    },
    {
      "id": "l8imtb5",
      "body": "I don’t unfortunately. I only have the support of my parents as long as I’m the one raising the kid, and I can’t imagine seeing them disappointed in me and disowning me. All they talk about is how excited they are for the baby. I was genuinely excited for the baby too until I found out my bf was backing out",
      "created_utc": 1718328984.0,
      "score": 101
    },
    {
      "id": "l8ien1y",
      "body": "His parents are not in his life at all, I’ve met them a few times and they are not good people",
      "created_utc": 1718325534.0,
      "score": 204
    },
    {
      "id": "l8k281v",
      "body": "Hey OP, there will be days when the sun shines bright. It probably doesn’t seem that way, but you’ll make it work. Don’t give up😪\nThere’s millions of us just like you.",
      "created_utc": 1718358220.0,
      "score": 24
    },
    {
      "id": "l8iw0fk",
      "body": "Fr OP, I believe in you and can see the love you have for your baby and family. Don’t give up, fuck that guy for backing out he’s a coward. You wouldn’t be a single mom, you have your family and that’s more than a shit boyfriend who isn’t good on his word. Just want you to know , a stranger on Reddit took the time to say that you are a good person, you are meant to be on this planet , and you are ALREADY a good mom. Take his ass to court and get that child support, and take care of yourself and your baby in peace. But don’t give up, stay strong.",
      "created_utc": 1718332880.0,
      "score": 103
    },
    {
      "id": "l8k1oyr",
      "body": "I decided to reply to your comment as I too believe there will be plenty of actual men that would date OP with a single child and autism.\n\nI was shaking my head reading about you experience with your Bf. That is not a man but a child. \n\nI know things are hard now, extremely difficult but I believe there is a life beyond this where you can be happy with your new born when they arrive.\n\nOne of things I’ve always struggled with when thinking about suicide is the pain I’ll leave behind and you could leave that behind not having only for your parents but your kid too.\n\nI’m sure you’ll be amazing as a mom and you do have support from your parents already. Thinking of you!",
      "created_utc": 1718357852.0,
      "score": 32
    },
    {
      "id": "l8kj2pq",
      "body": "My coworker has two kids 12 & 7 and she is autistic, she just went through a divorce a few months ago and she’s already talking with somebody new. OP I promise, you are a LOT more than your disadvantages, it just takes the right person to see that.",
      "created_utc": 1718367645.0,
      "score": 18
    },
    {
      "id": "l8m3im7",
      "body": "A REAL man (or woman) will absolutely step up to the plate and date OP and love their child like it’s their own kid. They are out there (my dad was one of them)",
      "created_utc": 1718387875.0,
      "score": 7
    },
    {
      "id": "l8j3q2m",
      "body": "tonight has been really hard on me mentally and i really needed to hear from someone who is autistic and a mother. thank you.",
      "created_utc": 1718336451.0,
      "score": 70
    },
    {
      "id": "l8j7xlf",
      "body": "I'm an autistic mom, too. I won't say it's always easy, but I am amazed at how much I really *can* adapt when it comes to this. ❤",
      "created_utc": 1718338577.0,
      "score": 26
    },
    {
      "id": "l8mc6l1",
      "body": "If you want to give the baby up for adoption - It’s your life, do what will feel right to you. ❤️ Hugs",
      "created_utc": 1718390840.0,
      "score": 4
    },
    {
      "id": "l8oopmq",
      "body": "SAME. I was miserable, and even though I was determined to never act on it and let my kids suffer like I have, I thought about it almost every day of my marriage. It was just there, like it was part of my brain that would be there forever. What a shock, when I realized that I wasn't just a miserable person, and haven't been in that mindset in the often very difficult years since I left.",
      "created_utc": 1718426228.0,
      "score": 1
    },
    {
      "id": "l8j7own",
      "body": "There's never an okay time for a kid to lose a parent to suicide. I lost one, I was an older kid, my siblings were teenagers, and he figured we'd be okay because of that.  I cannot begin to tell you how fucked up, traumatised, heartbroken and haunted we are - and this was in the 90s. I deeply empathise with anyone who is suicidal. I've been there too many times myself. I will never support it as a viable option, especially when one becomes a parent. You never outgrow your parents.",
      "created_utc": 1718338450.0,
      "score": 21
    },
    {
      "id": "l8izsqn",
      "body": "can i ask why you’re supportive of people considering suicide?",
      "created_utc": 1718334582.0,
      "score": 14
    },
    {
      "id": "l8je83z",
      "body": "also you're only 20, practically a child yourself. even if your bf wasn't such an absolute POS, you likely wouldn't have ended up together. he sucks, regardless.",
      "created_utc": 1718342043.0,
      "score": 15
    },
    {
      "id": "l8j7owv",
      "body": "I definitely plan on that. Thank you.",
      "created_utc": 1718338450.0,
      "score": 3
    },
    {
      "id": "l8ni40n",
      "body": "I know it’s stupid, but I never liked my life before I met him. I had always been lonely, and having a companion gives me reason to keep going every day. I never had a reason to keep going before, once I graduated high school, the real world became too much, so i had already been on a decline until i met him",
      "created_utc": 1718406155.0,
      "score": 3
    },
    {
      "id": "l8lsoxd",
      "body": "Hearing from other autistic people has been helpful because you guys understand how much sudden change affects us. Like my brain can’t comprehend what I’m even going through, I feel like I’ve been stuck in a meltdown for the last few weeks and I can’t escape or calm myself down. If I can make it through these feelings, your advice is honestly the route I would go down.",
      "created_utc": 1718384222.0,
      "score": 3
    },
    {
      "id": "l8iu89l",
      "body": "[deleted]",
      "created_utc": 1718332100.0,
      "score": 0
    },
    {
      "id": "l8j8366",
      "body": "Abortion is highly illegal where I live, I was only able to do it the first time because I ordered a pill online. I would consider if it was accessible to me though",
      "created_utc": 1718338658.0,
      "score": 6
    },
    {
      "id": "l8j3a0u",
      "body": "He told me he had been doing a lot of thinking and reflecting on what his future would look like, and he wasn’t ready to give up doing nothing all day because “he’s only 21”. He said almost word for word that he wanted to smoke and play video games all day and realized that no baby will make him want to give that up",
      "created_utc": 1718336241.0,
      "score": 5
    },
    {
      "id": "lu5zztb",
      "body": "xd",
      "created_utc": 1730119041.0,
      "score": 1
    },
    {
      "id": "luyy5zc",
      "body": "I am. Getting out of that abusive relationship and having my son is probably one of the greatest things that’s ever happened to me. He’s 2 months old now and I am in so much love every day",
      "created_utc": 1730520186.0,
      "score": 3
    },
    {
      "id": "l8mnej9",
      "body": "[removed]",
      "created_utc": 1718394710.0,
      "score": 2
    },
    {
      "id": "l8mg1zh",
      "body": "[removed]",
      "created_utc": 1718392172.0,
      "score": 3
    },
    {
      "id": "l8mlun9",
      "body": "[removed]",
      "created_utc": 1718394188.0,
      "score": 2
    },
    {
      "id": "l8ji5wy",
      "body": "Terrible comment, absolutely embarrassing and disgusting",
      "created_utc": 1718344395.0,
      "score": 21
    },
    {
      "id": "l8j990n",
      "body": "Not really. Religion and the afterlife are weird topic for me where I don’t really know where I stand",
      "created_utc": 1718339270.0,
      "score": 17
    },
    {
      "id": "l8jl1x1",
      "body": "Hell is a figment of your imagination.",
      "created_utc": 1718346211.0,
      "score": 8
    },
    {
      "id": "l8n6u14",
      "body": "shut up christian",
      "created_utc": 1718401566.0,
      "score": 2
    },
    {
      "id": "l8inhbn",
      "body": "But how do you know for certain they would disown you??? Did they say that? ",
      "created_utc": 1718329267.0,
      "score": 68
    },
    {
      "id": "l8kz6m7",
      "body": "OP, I know it feels weird, but have you thought about opening up to your parents about everything you discussed here? Including about your ideations and the incompatibility between your mental health state and being a good mother? I dont know your family, but if you passed away they would probably \"adopt\" your child and raise the baby as if it was theirs. So, is this a possibility? They probably love you so much and dont want to lose you. They can keep the baby and have their daughter alive as well. Think about that.",
      "created_utc": 1718374147.0,
      "score": 53
    },
    {
      "id": "l8if3h4",
      "body": "Neither is he. OP, you're so young and whats been done tl you is really unfair. Do your parents know what your boyfriend said? ",
      "created_utc": 1718325727.0,
      "score": 415
    },
    {
      "id": "l8invzp",
      "body": "And neither is he. Make him leave now. He shouldn't get to have two months of mooching off you if he didn't want this child.",
      "created_utc": 1718329440.0,
      "score": 83
    },
    {
      "id": "l8lcx05",
      "body": "Yes this is the opinion I have as well, OP seems so intelligent and lovely, she’s been taken advantage of by this man.",
      "created_utc": 1718378908.0,
      "score": 17
    },
    {
      "id": "l8nr2r1",
      "body": "Omg yes this part OP is ALREADY a good mom!",
      "created_utc": 1718410001.0,
      "score": 3
    },
    {
      "id": "l8j8yda",
      "body": "I’m autistic and 37. I’m not a mother but if the opportunity presented itself in this unfortunate way I’m sure I could handle it. Keep in mind your hormones are a mess right now too. I’d talk to your doctor because the hormonal mood swings are a fucking killer. Also your boyfriend might be freaking out too. A child is a lot. \n\nHave you tried communicating to him about his feelings? Because if he’s scared and overwhelmed he might just be trying to nope out because he feels trapped. I’d suggest some couples counselling or at least some therapy for yourself.",
      "created_utc": 1718339114.0,
      "score": 23
    },
    {
      "id": "l8k0q9s",
      "body": "Hi OP, I don't know if this will help you or not but I figured I'd throw in part of my life.  \nI'm a mom of 3 kids. My first had health problems and almost died a few times before the age of 2 before we finally found out she was severely allergic to corn. She was fine after that. So I had a second! At 3 months old he ended up in the hospital for the next year and a half of his life, he needed a liver transplant and didn't expect to survive long enough to get one. But he made it! It was a long process. Halfway through that ordeal I accidentally got pregnant and didn't realize it until 4 months in, my periods stopped before that because I was so stressed so I didnt realize. But things went on...  \nI knew ADHD was there (pretty severe hyperactive) but they were recently all 3 diagnosed with autism as well. During that process I realized I do in fact have Autism, explains a lot of my life....  \nTheir dad was around until the diagnosis, but I really wish he hadn't been because he was the biggest piece of shit ever (long story). He gave everyone the impression that his kids were his life, he would die without them, he would do anything for them, etc... but they were just tools and pawns for him.  \nNow I'm raising them on my own and doing so much better without him. I don't have much of a support system and sometimes I cry, but I'm ok. My kids are fantastic and forever happy. Extremely intelligent, getting therapy to help navigate their lives better than I ever did in mine, and they are thriving. They are my world, I don't have a life anyway so I'm dedicated to them because they deserve it. They literally plan on saving the world before humans destroy it lol and I fully support that!",
      "created_utc": 1718357160.0,
      "score": 11
    },
    {
      "id": "l8jwi3b",
      "body": "YEAH WTF LMFAO",
      "created_utc": 1718354104.0,
      "score": 11
    },
    {
      "id": "l8j83o2",
      "body": "if this means anything to you i'll keep ur baby in my prayers even after ur gone so hopefully he'll be watched over.",
      "created_utc": 1718338666.0,
      "score": 0
    },
    {
      "id": "l8pz1b8",
      "body": "There’s a difference between betrayal and just not really knowing what you want. You can think you want one thing, then you realize you don’t later. Boyfriend could have a part of him that really wanted a kid. As it becomes real, he loses focus. So why wouldn’t something like that happen to you? Me? Anyone?\n\nMy point is that you don’t know why things happen. You only know what’s happening now. Your attitude towards the things that happen to you, affect what happens next. So I would say that even though this looks like a doomsday scenario. Just do me a favor and let it play out. It may not be what you think. If it’s so terrible as you walk into it, do whatever it is you want to do. However, consider for a moment that it would be best for everyone involved if this guy was not in the picture with this baby. Additionally, the baby isn’t really here yet. \n\nLet the movie play….",
      "created_utc": 1718457380.0,
      "score": 2
    },
    {
      "id": "l8p32f0",
      "body": "IDK if you saw my comment but I'm also an autistic mom. You sound rational, and you're already grieving the loss of your boyfriend and planned family, it must feel like nothing makes sense except \"the end\" right now - but you will adapt, even if autism makes it WAY harder for people like us. \n\nPlease remember too, medically, factually, you're hormonal right now. Even in ***totally not neurodivergent people***, these thoughts, panics, prenatal depression, anxiety, it's a thing, not just postpartum.... Especially with your situation, everything going through your head is seriously understandable.\n\nHaving a baby is the most terrifying thing in the world - it's cliche to say, but it is true, once you see him, your baby......a lot is going to change, and the boyfriend you trusted, only to impregnate you and ditch you, and has done way worse......you, that child, your FUTURES matters so much more than him bouncing. You being alive matters. You'll be a good mother. Tbh I don't think most first time pregnant moms don't feel a lot of the fears and doubts you do, even without autism - again, prenatal depression, anxiety is real, your boyfriend alone shattering your planned future alone is enough to do this.\n\nYour family would never get over it. Your son would always wonder.......this pain is temporary, and with a support system, I truly believe you can do this.\n\n\nAre you in therapy? Just asking, it could really help I think, to cope with these feelings.\n\n\nI really hope you can push through - because this child....YOU......there is a beautiful life possible. Without the sperm donor who betrayed you, manipulated you. I know it hurts, it's not what you planned , and I know autism makes it ***that much harder*** to cope with life sometimes......but eventually you'll be able to cope with change better - you are completely valid right now though, I mean look what you're going through. But you're already thinking of how to give your son the best life - I think you're in a lot of pain, and I just hope you don't commit to such a dire end when maybe him leaving, the \"broken family\" is the best thing in this situation. He wronged you and your child shouldn't suffer over it, neither should you.\n\n\nI just wanted to chirp in again. I never planned on motherhood either, honestly.....but ended up choosing to have 2, after losses and 1 termination. \nAs a fellow autistic mom - you are so much stronger than it feels right now. You have all my support.",
      "created_utc": 1718435871.0,
      "score": 2
    },
    {
      "id": "l8iuu1r",
      "body": "[deleted]",
      "created_utc": 1718332361.0,
      "score": 4
    },
    {
      "id": "l8j8e35",
      "body": "Could You visit somewhere where You could get an abortion?",
      "created_utc": 1718338816.0,
      "score": 1
    },
    {
      "id": "lw301gk",
      "body": "So glad to hear this, was searching for this. Really happy for you, take care of yourselfs.",
      "created_utc": 1731076087.0,
      "score": 2
    },
    {
      "id": "lxvn9pq",
      "body": "I came back to check on you. My heart is lifted knowing you’re okay and it worked out. Hard times ahead but for what it’s worth from a stranger, I’m proud of you",
      "created_utc": 1731990938.0,
      "score": 2
    },
    {
      "id": "lxjqiob",
      "body": "I am so happy for you.",
      "created_utc": 1731818679.0,
      "score": 1
    },
    {
      "id": "ly745qh",
      "body": "This makes me so happy to hear (on all 3 counts!!)\n\nI hope you don't feel too bad, I got together with my abusive ex at 22 and I was convinced he was the best thing ever and I was so lucky to have him and he treated me like absolute garbage and it took me literally years to see it... Leaving him was still one of the hardest things I've ever done but I have zero regrets\n\nWhy Does He Do That? by Lundy Bancroft is fantastic and has a roadmap for helping you rebuild & recover after getting out of an abusive relationship ❤️‍🩹\n\nDid you end up staying with your parents?",
      "created_utc": 1732160436.0,
      "score": 1
    },
    {
      "id": "l8n11qm",
      "body": "[removed]",
      "created_utc": 1718399390.0,
      "score": -2
    },
    {
      "id": "l8invou",
      "body": "They would kick me out, at the least. They have very traditional views when it comes to adoption and stuff like that, and they aren’t supportive of abortion or anything like that unless medically necessary. My mother runs the household and is also autistic (where I got mine from, haha) and she has very very black and white thinking",
      "created_utc": 1718329436.0,
      "score": 73
    },
    {
      "id": "l8ifm1o",
      "body": "They don’t. I know they would kick him out asap (rightfully so) if they knew. But I’m holding out hope he’ll stick around after the baby comes because he says he doesn’t want to lose me and loves me. I won’t have to go through with this if he’s here with me to help with the baby",
      "created_utc": 1718325942.0,
      "score": 117
    },
    {
      "id": "l8lcjvg",
      "body": "Couldn’t agree more with this comment, that asshole needs to get kicked out of the house so you can exist and raise this child along with your lovely supportive parents OP.",
      "created_utc": 1718378785.0,
      "score": 20
    },
    {
      "id": "l8n67ev",
      "body": "Seriously and make sure you get everything penny in child support!",
      "created_utc": 1718401324.0,
      "score": 6
    },
    {
      "id": "l8j8n53",
      "body": "If I was able to drive I would take myself. I know my boyfriend would be willing to drive me but it would be at least an overnight trip, and my parents would definitely find out. They are not pro choice",
      "created_utc": 1718338947.0,
      "score": 5
    },
    {
      "id": "ly74zbg",
      "body": "Yes I am! They are such a huge help and love spending time with my son. They’re such an amazing support system",
      "created_utc": 1732160750.0,
      "score": 1
    },
    {
      "id": "l8n20f6",
      "body": "[removed]",
      "created_utc": 1718399738.0,
      "score": 1
    },
    {
      "id": "l8k246n",
      "body": "Please tell them what your boyfriend did",
      "created_utc": 1718358146.0,
      "score": 82
    },
    {
      "id": "l8k8xax",
      "body": "What do you think your parents would rather have: their daughter killed herself vs. their daughter gave up baby for adoption and is happy with her decision? If they're so against adoption then why don't THEY raise the baby and let you be",
      "created_utc": 1718362505.0,
      "score": 64
    },
    {
      "id": "lahcw10",
      "body": "Please don’t give them your child then. They aren’t good people if they’d rather have a dead child then have their grandchild adopted into a loving home ",
      "created_utc": 1719466757.0,
      "score": 1
    },
    {
      "id": "l8iu2k2",
      "body": "I would just tell your parents about him chickening out of being a father and a parent. It really sounds like your folks will support you so you can use that ground to start over. Hope is not lost and you will definitely do way better without having to raise the other adult kid you are with. \n\nEdit: wording and grammar",
      "created_utc": 1718332033.0,
      "score": 233
    },
    {
      "id": "l8io5wu",
      "body": "100% chance he doesn't change his mind. He does not love you. I hate to tell you but love isn't conditional like that. Even if he sticks for a little bit, he will dip the second things get tough and they will. Someone better may come along in your life though",
      "created_utc": 1718329556.0,
      "score": 170
    },
    {
      "id": "l8jn5li",
      "body": "OP trust me when I say that you WILL find someone else. My SO’s mother was in the same situation with two ex husbands and two kids Ava found her husband of 20 something years. But your child is going to grow up much sadder that you dipped because of them. My dad lost my brother and it led to the last few years of his life being…very tragic. He stopped working outside going anywhere or even getting out of bed. Those last 5 years I watched a dead man, he never recovered. He cried often and I can’t.. remember more than twice seeing him cry prior. You are going to destroy the remainder of your parents lives and possibly cause them to die prematurely. I don’t wanna be like this I’ve tried to kill myself, but watching my dad I realized what a horrible horrible impact the death of a child is, and it’s worse when it’s the kids own hands. They will raise your kid probably but… That kid isn’t going to thrive the world is a much better place with you here.",
      "created_utc": 1718347583.0,
      "score": 58
    },
    {
      "id": "l8kg6pb",
      "body": "Please tell your parents what he has said, what he is doing is emotional manipulation, you deserve so much better than that, your parents sounds like great people and they want to help you, let them. \n\nI know it's unbearable to breakup, but what he is doing is pure evil, and with the suggestions of staging an incident really concerns me. I fear for your safety.",
      "created_utc": 1718366286.0,
      "score": 43
    },
    {
      "id": "l8l652j",
      "body": "Let them kick him out that guy doesn't like you he's trying to take the kids and probably so he can control over you and screw that",
      "created_utc": 1718376603.0,
      "score": 14
    },
    {
      "id": "l8n1eh3",
      "body": "You want your child to be around a man who manipulated you into getting pregnant and has been repeatedly abusive? You genuinely think that a man who would do that loves you, and will love your child? I understand this is a support sub, but you have got to sit down with yourself and legitimately consider the kind of life you'd be condemning that child to.",
      "created_utc": 1718399517.0,
      "score": 1
    },
    {
      "id": "l8jlyab",
      "body": "Don’t accept anything from him after what he’s done to you",
      "created_utc": 1718346793.0,
      "score": 2
    },
    {
      "id": "ly75jfc",
      "body": "Yay! I'm so happy for you ❤️❤️",
      "created_utc": 1732160968.0,
      "score": 1
    },
    {
      "id": "m0okfxf",
      "body": "could I ask what advice would you give to your old self for deal with the anxiety? And the impending doom feeling D:",
      "created_utc": 1733475803.0,
      "score": 1
    },
    {
      "id": "l8newu9",
      "body": "[removed]",
      "created_utc": 1718404819.0,
      "score": 0
    },
    {
      "id": "l8ja464",
      "body": "Oh, I'd let his parents know. My parents would know. The entire world would know how he isn't shittttt.",
      "created_utc": 1718339740.0,
      "score": 112
    },
    {
      "id": "m0sho4s",
      "body": "unfortunately knowing myself, i really don’t think there’s any advice i could give other than “it’ll work out”. the impending doom feeling is something i’ve had since i was young and it’s not something that’s ever gone away, not with therapy or medication. even in my happiest moments i have that ball of anxiety and dread in my stomach",
      "created_utc": 1733529435.0,
      "score": 1
    },
    {
      "id": "la2e9vo",
      "body": "Amen sister. I can be petty and I am big on revenge. Rightful revenge that isn’t morally wrong. He deserves it. Dead beat fathers get too much slack it pisses me off",
      "created_utc": 1719244951.0,
      "score": 1
    }
  ]
}