{
  "id": "1ijjf9s",
  "title": "I’m a functional suicidal",
  "selftext": "I get outta bed, eat breakfast, have good grades in college, have a gf, friends, family, but feel depressed all the time. These thoughts began when I started college, it got so bad that yesterday I held a gun to my head, and almost pulled the trigger before I got interrupted by a call. That whole day yesterday and today I’ve been researching the most painless way to kill myself. I haven’t gone to sleep because my gun is still on my bed and I’m afraid what I’ll do to myself if I go back in there. Please Help.",
  "created_utc": 1738892017.0,
  "score": 519,
  "num_comments": 67,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ijjf9s/im_a_functional_suicidal/",
  "comments": [
    {
      "id": "mbf2pke",
      "body": "I totally feel you. It's like I'm living two completely different lives. One where I just lie in bed thinking of all the ways I could kill myself and one where I'm laughing with my friends and family seeming to be having a great time.",
      "created_utc": 1738899079.0,
      "score": 146
    },
    {
      "id": "mbeqk79",
      "body": "[removed]",
      "created_utc": 1738894885.0,
      "score": 19
    },
    {
      "id": "mbeinfq",
      "body": "You want to live, deep down. You didn't have to let the call interrupt but you did. Often suicide isn't a desire to die but a desire for pain to end. What is your pain, and how can you stop it? A therapist would be a very good start.",
      "created_utc": 1738892200.0,
      "score": 39
    },
    {
      "id": "mbeorvf",
      "body": "Bro I can’t lie I’m in college too and I’m in similar situation. But what is causing your pain ask your self then ask your self if your gf or family member killed themselves because of the same thing how would you feel. You gotta remember if you take ur life you may be gone but everyone else around you will still suffer. Just use the phone call to understand you got saved you are meant for a greater purpose you just have to be brave and patient enough to ride through the storm.  I promise you friend one day you will look back on this and be glad the phone call happend",
      "created_utc": 1738894281.0,
      "score": 8
    },
    {
      "id": "mbel18j",
      "body": "If you’re struggling with thoughts like “what’s the point?“, something that helped me out was helping others, just go anywhere and volunteer, it really helps you define your meaning about life.",
      "created_utc": 1738893000.0,
      "score": 10
    },
    {
      "id": "mbev6bx",
      "body": "I relate to this a lot.",
      "created_utc": 1738896463.0,
      "score": 3
    },
    {
      "id": "mbfdo2q",
      "body": " Can I ask what makes you feel like you want to end it all?",
      "created_utc": 1738903170.0,
      "score": 2
    },
    {
      "id": "mbh5jjl",
      "body": "I'm in that exact same position right now except I'm an absolute failure in everything which is why I'm thinking of ending my entire life on my birthday in 3 days because my life means nothing to nobody please help",
      "created_utc": 1738935733.0,
      "score": 2
    },
    {
      "id": "mbez265",
      "body": "[removed]",
      "created_utc": 1738897799.0,
      "score": 4
    },
    {
      "id": "mbfcvcc",
      "body": "I am sorry you afe going through this. Though I can not fully understand i emphasize with you. It is hard to feel like you are doing everything you are supposed to, going through the motions but feeling numb. Please, reach out. No matter the time or place. I will just listen. You can think of me sitting next to you and holding your hand. No judgement. Just peace in knowing you are not alone and you are validn loved and heard.",
      "created_utc": 1738902851.0,
      "score": 1
    },
    {
      "id": "mbfz8v0",
      "body": "I have no advice, but you are wanted in this world, talk to someone.",
      "created_utc": 1738913602.0,
      "score": 1
    },
    {
      "id": "mbg7i63",
      "body": "Me too, i just wish i had cancer so i can die slowly, but here i am, writing this comment while queuing up in check-in for a flight back home. :) make sure to leave this world with a legacy, even if it’s small. I hope you get through it OP.",
      "created_utc": 1738918602.0,
      "score": 1
    },
    {
      "id": "mbgxqc4",
      "body": "Me too meee tooo",
      "created_utc": 1738932784.0,
      "score": 1
    },
    {
      "id": "mbhwhk4",
      "body": "I can’t relate to you more on “what’s the point of life after all.” I graduated with two bachelor degrees from a Top 30 US university last year - started off as a top performer academically but grades gradually slid as well as my mental health throughout the four year span. I guess there were certain small things I could’ve done differently to get me to a much better spot career wise and mental health wise right now, to which I’d be satisfied and happy with my life. But it was those bad choices I made that rendered me to where I am today - being hopeless and helpless in everything.\n\nI echo what others said about those who have suicidal thoughts don’t necessarily wish to die, but rather to end the pain. I think I know exactly what it takes to end my current pain, however although not impossible, it’d take me insane amounts of hard work as well as luck to get me there, and I’d hate to see myself fail after all the efforts.",
      "created_utc": 1738944238.0,
      "score": 1
    },
    {
      "id": "mbttg87",
      "body": "Oh man. I feel so heartbroken for you. You don't need to listen to those societal pressures bro. Just go with the flow at your own pace. Thats what matters the most. You can do things your own way with your own purpose, philosophy and expression. Can you tell us a little more info of why you might be depressed ? Do you feel a little anxious too bro ?",
      "created_utc": 1739104940.0,
      "score": 1
    },
    {
      "id": "mc2tzg4",
      "body": "I feel this way too. I have always had suicidal ideation and thoughts since very young like 10 or younger. But it’s gotten very bad these last couple of years. I’ve felt numb for months. I was on anti depressants for a while and though it stopped my thoughts and mood swings they made me feel nothing. I stopped having them refilled. Yesterday and today most of what I’ve thought about is suicide, what to say to my family and friends if I were to ever do it. I’m the closest I’ve ever been. Im scared ",
      "created_utc": 1739222110.0,
      "score": 1
    },
    {
      "id": "mc54l52",
      "body": "I wish I was more functional, I'm in between non functioning and functional. It changes, I'm getting help but I feel not functional in society or jobs etc.",
      "created_utc": 1739254607.0,
      "score": 1
    },
    {
      "id": "mcjiqin",
      "body": "I’m the same. We exist.",
      "created_utc": 1739451288.0,
      "score": 1
    },
    {
      "id": "mclsae2",
      "body": "Felt that, I remember being a little girl and my parents would grill me “are you depressed?” I had no clue what that meant- just no desire for anything. I’m like the go to person for everyone in my life- that’s the only reason really now that makes me feel like I have any purpose, I feel like I have to wake up every day or I will let them down. Nobody checks on me though, and if they do, to the outside eye I have a “good life” so why would they see me as valid. Even though I’ve spent years wishing I would die. My bf and friends all “have it worse” which makes me feel fucking stupid for having this outlook, maybe one day it’ll make sense",
      "created_utc": 1739475969.0,
      "score": 1
    },
    {
      "id": "mcni3h2",
      "body": "Well my gf cheated on me recently so ur doing better then me there",
      "created_utc": 1739494543.0,
      "score": 1
    },
    {
      "id": "mdtjfhl",
      "body": "i love you",
      "created_utc": 1740067082.0,
      "score": 1
    },
    {
      "id": "mbft2jo",
      "body": "We can think of painless ways",
      "created_utc": 1738910174.0,
      "score": -2
    },
    {
      "id": "mbkbqa0",
      "body": "[deleted]",
      "created_utc": 1738969406.0,
      "score": 0
    },
    {
      "id": "mbfrs1y",
      "body": "same we call ourselves gus fring",
      "created_utc": 1738909502.0,
      "score": 20
    },
    {
      "id": "mbl2ke4",
      "body": "haha (me core)",
      "created_utc": 1738978259.0,
      "score": 2
    },
    {
      "id": "mbejgki",
      "body": "I guess I just realized how meaningless life is. Yes I’ll have a good job after college and stuff, but what’s the point you know? Those are the thoughts I’ve been having.",
      "created_utc": 1738892470.0,
      "score": 42
    },
    {
      "id": "mbgy6ns",
      "body": "Imho no one wants to die because they want to die. It is always the desire to end the pain and emptiness. Why would someone who is happy and healthy want to die?",
      "created_utc": 1738932966.0,
      "score": 4
    },
    {
      "id": "mbfrdmi",
      "body": "Don't let it mess up your grades...  Get through college. The burden of not graduating college despite having started is a pretty shitty one to add to the list of things to hate about your life. Believe me.",
      "created_utc": 1738909295.0,
      "score": 5
    },
    {
      "id": "mbeluta",
      "body": "I have a feeling it’s deeper than “what’s the point”  cuz I definitely wouldn’t have stuck a handgun to my temple, but I’ll definitely try volunteering",
      "created_utc": 1738893280.0,
      "score": 9
    },
    {
      "id": "mbf1fv5",
      "body": "[removed]",
      "created_utc": 1738898629.0,
      "score": 8
    },
    {
      "id": "mbmsequ",
      "body": "Yay more hollow bs",
      "created_utc": 1739005901.0,
      "score": 2
    },
    {
      "id": "mbmscs9",
      "body": "[deleted]",
      "created_utc": 1739005869.0,
      "score": 1
    },
    {
      "id": "mbxh30w",
      "body": "Holy shit this caught me so off guard. I am a huge fan of the show istg.",
      "created_utc": 1739145600.0,
      "score": 1
    },
    {
      "id": "mbxh3w4",
      "body": "Lol",
      "created_utc": 1739145608.0,
      "score": 1
    },
    {
      "id": "mbejo22",
      "body": "The points to see where it takes you. You will have all of eternity to be dead. In the grand scheme of things, the rest of your life won't be long at all- so why not ride it out since you'll never experience it again?",
      "created_utc": 1738892539.0,
      "score": 28
    },
    {
      "id": "mbipqb7",
      "body": "I feel the same way. I have a job that pays well enough, I can pay my rent, I can afford groceries, I have decent healthcare, but it’s all meaningless. I thought maybe after I’d graduate college things would be better, but it’s not. I’m almost 6 years out of college and I’m still depressed and suicidal.",
      "created_utc": 1738952523.0,
      "score": 5
    },
    {
      "id": "mbhaijy",
      "body": "Helping people,doing charity could Help.  At least you could make other peoples Life better that way. That would give you a Sense of meaning.I also think there are Not enough groups and organsitations for lonely people. Maybe you could do that.  Or having a pet that depends on you.",
      "created_utc": 1738937471.0,
      "score": 3
    },
    {
      "id": "mc772uu",
      "body": "You live for others that is where the real meaning is",
      "created_utc": 1739289109.0,
      "score": 1
    },
    {
      "id": "mbejr0a",
      "body": "Also you're incredibly lucky you get to go to college and get a good job. Wish I had that luxury",
      "created_utc": 1738892567.0,
      "score": -10
    },
    {
      "id": "mbms5jj",
      "body": "Why does anyone wanna live? It's just a string of corny moments, waiting for relationships to end, people to pass away etc, then you die\n\nAnyone desiring that is coping hard with the fact they, like everyone, had no choice in the matter. Two selfish people and societal pressure forced them into being",
      "created_utc": 1739005749.0,
      "score": 2
    },
    {
      "id": "mbn0s9j",
      "body": "Why is it hollow bs? You don't know me. \nI've spent 23 years of my life wanting to die. 3 years ago I moved over 100 miles to move in with my family because they were worried for my and my kids welfare.\nI finally feel my depression lift and would like to think I could help someone because I've been there. \nSo don't you dare tell me what I say is hollow bs!\nDo you want to talk?",
      "created_utc": 1739010940.0,
      "score": 1
    },
    {
      "id": "mbi0rgq",
      "body": "this is tight",
      "created_utc": 1738945460.0,
      "score": 3
    },
    {
      "id": "mbmv9ab",
      "body": "I don’t think it’s a choice you make that you want to live - it‘s just human.",
      "created_utc": 1739007611.0,
      "score": 1
    },
    {
      "id": "mbn1jg1",
      "body": "Also, if you want to communicate who you are and why you might understand, maybe actually do, just an idea\n\nOtherwise you run the risk of appearing as just another \"it's gets better\" person\n\nSo yes, what you said in your original comment, in a vacuum, is as close as you can get to objectively hollow bs ❤️",
      "created_utc": 1739011405.0,
      "score": 2
    },
    {
      "id": "mbn15ww",
      "body": "You also don't know the people you're saying this to, maybe they're talking with people all the time and nothing is helping\nSo maybe just stay quiet",
      "created_utc": 1739011174.0,
      "score": 1
    },
    {
      "id": "mbmvdhp",
      "body": "Sure 🙄",
      "created_utc": 1739007680.0,
      "score": 1
    },
    {
      "id": "mbmvip1",
      "body": "Why does anyone wanna eat?",
      "created_utc": 1739007767.0,
      "score": 1
    }
  ]
}