{
  "id": "1dh2gwo",
  "title": "suicide isn’t selfish if they truly only care once you’re gone",
  "selftext": "I always say I won’t take my life as long as my mom’s alive but these days it feels like they’d be pretty okay without me too. I’m hoping things are better at the end of the year but if not, I don’t think I wanna see 2025 anymore. \nI’m too tired.",
  "created_utc": 1718523618.0,
  "score": 488,
  "num_comments": 66,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1dh2gwo/suicide_isnt_selfish_if_they_truly_only_care_once/",
  "comments": [
    {
      "id": "l8u82s3",
      "body": "Not everyone who says they care actually cares",
      "created_utc": 1718530370.0,
      "score": 154
    },
    {
      "id": "l8u874q",
      "body": "They don't even care then. They'll ask how this could've happened and will move on. If they cared they would help before it happened",
      "created_utc": 1718530462.0,
      "score": 98
    },
    {
      "id": "l8vwuwn",
      "body": "Right? So many people say it's selfish to commit, but they do nothing to help while you're alive, and sometimes even make you feel worse. It feels like they'd only care after the fact",
      "created_utc": 1718559209.0,
      "score": 18
    },
    {
      "id": "l8u7w9c",
      "body": "Some said that they care but I'm not really sure if they're listened to what I've said or not, I don't blame them tho so let it just be it.",
      "created_utc": 1718530231.0,
      "score": 15
    },
    {
      "id": "l8tzldc",
      "body": "[removed]",
      "created_utc": 1718524059.0,
      "score": 13
    },
    {
      "id": "l8vqz65",
      "body": "[removed]",
      "created_utc": 1718557010.0,
      "score": 11
    },
    {
      "id": "l8vrua8",
      "body": "Even then, I feel it's mostly performative. A lot of people who came to my bf's funeral (mutual \"friends\") were happy to pretend I didn't exist afterwards when I needed them the most. \n\nMakes me wonder if they actually cared he was dead.",
      "created_utc": 1718557337.0,
      "score": 9
    },
    {
      "id": "l8u9x2m",
      "body": "It can be really easy to take someone close to you for granted; to care for them but not show them that. \n\nI don't know your situation, so I won't pretend that this is definitely the case, but I've had multiple relationships where I have felt like absolute shit and sometimes even distanced myself because they just didn't seem to care and yet lo and behold someday they pop up wondering where it all went wrong and what the issue even was. \n\nPeople are a bit dumb sometimes, so if you're up for it, try and give them a chance and maybe even talk to them. That's when you'll find out who really cares.",
      "created_utc": 1718531766.0,
      "score": 16
    },
    {
      "id": "l8vnhmg",
      "body": "[removed]",
      "created_utc": 1718555687.0,
      "score": 6
    },
    {
      "id": "l8v0txn",
      "body": "They say you are being selfish because your dying makes them feel feelings, and they don't even understand their own feelings, much less what you were feeling were you die by suicide....so in response they just lash out and calling a death by suicide selfish is their easiest go to response to all of those feelings they are feeling because something actually happened to them in their life that was real. \n\nThe really sucky part though? Most of these simpletons will use these newfound Feelings to better themselves and become for real decent to awesome people. So not only do you get vilified for dying by suicide, but then you get used as a footnote in someone else's life journey. \n\n Far better to stay here and make people uncomfortable(and more) than to walk out sooner than later. \n\n It's a big, long party....stay longer than you should and start some fires before you have to leave.\n\n\n\n\nOr, don't..... it's your life...do with it what you will.",
      "created_utc": 1718546796.0,
      "score": 14
    },
    {
      "id": "l8wlfcp",
      "body": "[removed]",
      "created_utc": 1718568414.0,
      "score": 5
    },
    {
      "id": "l8x39vr",
      "body": "I feel you! It's not selfish I would do what makes you happy. Life is stress sometimes. Hope you find a safe way to exit if you wish.",
      "created_utc": 1718575253.0,
      "score": 4
    },
    {
      "id": "l8xsmb5",
      "body": "they don’t care and if they do care is temporary",
      "created_utc": 1718586251.0,
      "score": 5
    },
    {
      "id": "l8x75tl",
      "body": "They won't even then.  Not really",
      "created_utc": 1718576892.0,
      "score": 3
    },
    {
      "id": "l8xqbct",
      "body": "I don't think it's selfish I wish people who said that felt suicidal constantly for more than a week then they would feel the same way.",
      "created_utc": 1718585208.0,
      "score": 3
    },
    {
      "id": "l8vs7no",
      "body": "Suicide is only selfish if the intent is releave yourself of a burden and pass it on to others. Eg. Debt. I think in some cases it's those who try to stop you who are being selfish like if the decision wasn't impulsive.",
      "created_utc": 1718557478.0,
      "score": 4
    },
    {
      "id": "l8unqki",
      "body": "I've told myself that I will not do anything until my brother graduates. Right now, that's over a year, but it's one of the only things that keeps me going. I don't want my stupid choices to impact my brother.",
      "created_utc": 1718540640.0,
      "score": 2
    },
    {
      "id": "l9pe34y",
      "body": "I told my dad i wanted to die and he said stop feeling sorry for myself nobody takes it serious",
      "created_utc": 1719020651.0,
      "score": 2
    },
    {
      "id": "laurd5n",
      "body": "[deleted]",
      "created_utc": 1719679302.0,
      "score": 2
    },
    {
      "id": "l8yw9q7",
      "body": "To everybody reading this, as somebody who’s dealt with suicidal thoughts a lot, DONT. Don’t do it. Who even cares who would miss us or wouldn’t? Our worth is not placed in the hands of other people; even our families. Like really think about it. Okay, they treated us shitty, they didn’t care about us. Rip that bandaid off. Now what? So they ultimately get to win? Validating their treatment of you? F**K THAT. \n\nThere’s like what, probably over 8 billion people on this planet now? And we’re focusing on these few, that helped form these issues in the first place. There’s so many people you haven’t gotten to meet yet. That will celebrate you, love you, click with you, and understand you. There is hope, life can be amazing. But in our situations, you have to fight for it, claw your way back to normalcy. And you know something? You’re all worth that fight. You all deserve beautiful, love filled lives. \n\nWe were just merely born into this. Two people had sex, and here we are. Sometimes people don’t get the best cards right off the bat, and we have crappy families. But you can always pick some new cards out of the middle deck. Please don’t let this stuff get to you. I know it’s hard and easier said than done. But stop caring about who cares and who doesn’t, and instead, start genuinely caring about yourself. So many people are selfish, narcissistic, egotistical monsters, who get whatever they want in this world. Taking a note or two, out of their playbook isn’t going to hurt. You have to value yourself. It’s time to get serious about that. None of you need to be dead, that breaks my heart. Sending everybody love who reads this, I believe in you. Start TODAY with taking your power back. ♥️",
      "created_utc": 1718608013.0,
      "score": 2
    },
    {
      "id": "l8zm0ju",
      "body": "The only one that should and will care about you is yourself, you can’t depend on somebody else if they care for your life or not",
      "created_utc": 1718625642.0,
      "score": 1
    },
    {
      "id": "l9u5m0p",
      "body": "Selfish or not, suicide is a way to run away from your problems, not confronting them. I don't claim to know what you are going through, but to just admit defeat like that? You are strong enough to change things for yourself, to improve your situation, how do I know this? Because you're human, throughout history, people have been able to change the tide of history for better or for worse, we have survived wars, plagues, shootings, etc. All because those people knew they had the power to change things.\n\nDon't admit defeat, you are strong. Don't let whoever or whatever the fuck let you down, in fact scorn it, revolt against it, do something about it. Don't let whatever, drag you down, and fuck with you any longer. You are able to die without regret by living a fulfilling life, don't let it go just because you think you've lost. Despite what people tell you, you're the only one who can change things for yourself, be strong.",
      "created_utc": 1719102366.0,
      "score": -1
    },
    {
      "id": "l8uduon",
      "body": "\"they would be fine without me\" is an assumption, you don't know that, sorry if you feel like they don't care but most of the time it's just that most people don't show it properly or your trauma is making you feel that they don't. I understand how you feel, but maybe this is too radical, talk with your parents and friends and share how you feel, you might be surprised.\nfor years I felt that way and I kinda knew it's not true but took me time to differentiate my own illusions from reality, wish you luck",
      "created_utc": 1718534624.0,
      "score": -5
    },
    {
      "id": "l9lxqcl",
      "body": "Makes me laugh when strangers online say things like: \"my friend, I don't know you and we never interacted before, but I love you snd care about you ❤❤❤!\"",
      "created_utc": 1718974551.0,
      "score": 3
    },
    {
      "id": "l9jfaum",
      "body": "What you just figured that out ",
      "created_utc": 1718925750.0,
      "score": 2
    },
    {
      "id": "l8yt3ny",
      "body": "Or they didn't ask u at all and pretend like nothing happened. I had three suicide attempts (ended up in hospital each time), no one in my family asked me why, they only complained about the money they spend on the hospital bills... Some people are just shit, instead of a heart they have a huge 💩....",
      "created_utc": 1718605797.0,
      "score": 10
    },
    {
      "id": "l8vwnhj",
      "body": "This is what I've come to know as caring they listen to your downfalls and failures watching you spiral but always saying your going to be okay there secretly loving the fact that your below them and cannot wait to see you fail again ... I stopped telling ANYONE even docs how I feel nowadays and when I feel low I take myself to a quiet place and re think but honestly most people don't actually care stop telling them things this is what they thrive on the devil can hear you but he cannot read your mind !!!....",
      "created_utc": 1718559134.0,
      "score": 20
    },
    {
      "id": "l8wx2pu",
      "body": "True that (╥_╥)",
      "created_utc": 1718572763.0,
      "score": 2
    },
    {
      "id": "l8xvfio",
      "body": "THISSS!!! It's like u don't care now, u didn't care when I was alive and desperately needed help, u didn't answer ur phone, u sure as hell made me feel abandoned. They have no say so in what I choose to do with my life when they weren't even spectators or bystanders for very significant painful periods of my life. They have no say so.",
      "created_utc": 1718587546.0,
      "score": 9
    },
    {
      "id": "l9jfsom",
      "body": "They don't care after the fact either..all humans decieve",
      "created_utc": 1718925949.0,
      "score": 3
    },
    {
      "id": "l9lxxrr",
      "body": "Thing is, some people do care, but there's nothing they can fucking do",
      "created_utc": 1718974637.0,
      "score": 1
    },
    {
      "id": "l8x3p8k",
      "body": "Exactly... Death used to be celebrated and now we take it so personal as a painful event.",
      "created_utc": 1718575431.0,
      "score": 6
    },
    {
      "id": "l8z3j9i",
      "body": "Hi",
      "created_utc": 1718613479.0,
      "score": 1
    },
    {
      "id": "l9oyva1",
      "body": "They care, they don't know how to show it, snd are afraid of being patronizing ",
      "created_utc": 1719014167.0,
      "score": 0
    },
    {
      "id": "l8uj3qi",
      "body": "As the child of religious fanatics I assure you this is not the case for me. But thank you.",
      "created_utc": 1718538029.0,
      "score": 15
    },
    {
      "id": "l9lyuzv",
      "body": "That actually motivates me to stay alive haha",
      "created_utc": 1718975033.0,
      "score": 1
    },
    {
      "id": "l8yfrd9",
      "body": "Agreed",
      "created_utc": 1718597498.0,
      "score": 1
    },
    {
      "id": "l9ozefl",
      "body": "It's always temporary that is not and excuse to di3 bruh. Absurdism got it right. It doesn't make any sense to don't use the opportunity for happiness ",
      "created_utc": 1719014393.0,
      "score": 1
    },
    {
      "id": "l9lzmud",
      "body": "[removed]",
      "created_utc": 1718975362.0,
      "score": 2
    },
    {
      "id": "l9uk9tw",
      "body": "Homie. I am TIRED of being strong. Living in survival mode 90% of the time doesn’t make the 10% worth it.",
      "created_utc": 1719108932.0,
      "score": 6
    },
    {
      "id": "l8ujajg",
      "body": "My mother’s view point on suicide is “either do it or shut up about your feelings.” We weren’t raised to truly care what happens to us as long as we please god",
      "created_utc": 1718538141.0,
      "score": 11
    },
    {
      "id": "l9oylz8",
      "body": "It can happen. I love you. People who suffer don't deserve it. I would fuck you if you wanted to. I would do everything for you. I think you are the person who shouldn't die. If it isn't your fault whu would you feel guiltyy? ",
      "created_utc": 1719014058.0,
      "score": 1
    },
    {
      "id": "l8yvj8z",
      "body": "Cut your family off and don’t look back dude, you deserve so much better than to be treated like that. Life is beautiful, at least it can be. You gotta get away from them though. They’re making you feel lonely. There’s so many good people in this world that are going to love the fuck out of you. Cut those scumfucks of a family off and go find them. They’re waiting. ♥️",
      "created_utc": 1718607496.0,
      "score": 3
    },
    {
      "id": "l9p0bjz",
      "body": "This is patronizing bc you're denying my lived experience. Your friends cannot read your mind. They can only only see your actions, and if your actions say you don't care...if you're doing all the work, the friendship is one-sided. \n\nI was grieving too hard to do that work when all I needed was someone to be there.",
      "created_utc": 1719014779.0,
      "score": 1
    },
    {
      "id": "l9oyxam",
      "body": "I had a friend like you. I thought he knew I cared ",
      "created_utc": 1719014191.0,
      "score": 0
    },
    {
      "id": "l9oz5kt",
      "body": "Yes, that is a motivation to send dies fuckers to hell wnd prove Im not useless like them",
      "created_utc": 1719014289.0,
      "score": 0
    },
    {
      "id": "ldl0p5d",
      "body": "i understand it’s not an excuse but you have to understand we didn’t ask to be here and majority is grateful but life is hard",
      "created_utc": 1721207192.0,
      "score": 1
    },
    {
      "id": "l9ozgd4",
      "body": "That always exists, ecen if you are horribly miserable right? ",
      "created_utc": 1719014415.0,
      "score": 0
    },
    {
      "id": "l9ozsnq",
      "body": "[removed]",
      "created_utc": 1719014559.0,
      "score": 0
    },
    {
      "id": "l9vm8d6",
      "body": "And you think death will solve that? You are someone who is capable to turn that 90% into a 10%. And that 10% into 90%. Suicide won't fix your problems, it won't fix the injustices committed upon you, it won't heal your wounds. You'll just leave your life filled with sadness and regret, rather than risk the chance to change, to love your life by living the way you want to live it.",
      "created_utc": 1719131353.0,
      "score": 0
    },
    {
      "id": "l8uq1a9",
      "body": "The great thing if you’re an adult, is that you now own your life. You are responsible for your life. If anyone’s input is affecting you negatively, you have a choice to not care. Give yourself a chance and not others. Given that you’re in this sub, at least tell yourself “fxxk it, I’m going to try live the one I want to.”",
      "created_utc": 1718541839.0,
      "score": -5
    },
    {
      "id": "l8z3k7o",
      "body": "Hi",
      "created_utc": 1718613498.0,
      "score": -1
    },
    {
      "id": "l8z3gwz",
      "body": "Hi",
      "created_utc": 1718613426.0,
      "score": 4
    },
    {
      "id": "l8yvo2f",
      "body": "Money is what's stopping me, and visa, i feel like im trapped in this shitty country",
      "created_utc": 1718607591.0,
      "score": 3
    },
    {
      "id": "liteb40",
      "body": "A lot of the time people's own lives are out of their control. Most people would do anything to live their life the way they want, but they cant because the majority of situations are out of their control. Don't just assume that everyone can just change up their situation only cause they want to cause they can't.",
      "created_utc": 1724035512.0,
      "score": 2
    },
    {
      "id": "l8x419e",
      "body": "Not only \"not care\" but disconnect from them totally",
      "created_utc": 1718575569.0,
      "score": 3
    },
    {
      "id": "l90ehot",
      "body": "Hey ❤️‍🔥",
      "created_utc": 1718637304.0,
      "score": 4
    }
  ]
}