{
  "id": "1ei8nqt",
  "title": "Holy shit I hate humanity",
  "selftext": "I want to die so bad. I am not interested in participating in the genetic lottery ruled by hormones & socializing know as \"the human experience\"\n\nWe are literally all shallow apes that are simply searching for the best fuck to get the best offspring, then half of us look for the best pushover to raise the best fucks kid. It truly doesn't go deeper than that. There are plenty of sidequests along the way sure, but the fundamental path we are set on by our biology is pretty much decided at birth.\n\nModern concepts of love and romance are just shit we made up to try and collectively gaslight society into keeping our animalistic side deeply buried, and the fucked up part is, it worked. It worked so goddamn well, that we actually believe we are better than animals. We just aren't lol. We ARE animals. A little smarter than our peers, sure, and we have a little less hair than our cousins, but we are fundamentally the same.\n\nNo one is honest with themselves or others. All you have to do is observe someone's behavior, listen to what they say, and you quickly realize that something is VERY FUCKED UP HERE. Why are people so unhappy? Why are suicide rates climbing? Why are people contradicting themselves from the day they're born to the day they die?\n\nBecause we are all a bunch of mindfucked, repressed monkeys that don't understand why we feel so miserable. It's really that simple.\n\nHumanity is ugly. People are fundamentally stupid on average. They go through every hoop to always be right or save their ego or believe what they want to believe regardless of new information. They don't know how to think. They only know that they feel a certain way and nothing else matters. You selfish braindead fucks. They aren't concerned with truly understanding other people: they're more interested in putting themselves on a pedestal and damning any negative behavior from others and classifying them as irredeemable. They aren't interested in empathizing: they're interested in projecting their own emotions on someone elses experience, and they genuinely think they're a good person for it, declaring themselves \"empaths\" and participating in this disgusting masturbatory ego trip while patting themselves on the back for emotionally splooging all over themselves. Fucking yikes.\n\nI hate all of you. I hope one day you see the world from where I see it now and you realize how utterly shit you are. Everyday I dream of not waking up. I always hope that one of our sociopathic overlords hits the big red button and resets technology. I don't want to be here. You are not good people and neither am I.",
  "created_utc": 1722601286.0,
  "score": 1072,
  "num_comments": 143,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ei8nqt/holy_shit_i_hate_humanity/",
  "comments": [
    {
      "id": "lg4utus",
      "body": "I think about this every day. I'm tired of watching people choose to be rotten to each other, every day, for no goddamn reason. So much hate and pettiness. It's tiresome.\n\nIt's not even like watching crabs try to escape a bucket. It's like watching crabs just sit around and snip at each other for no reason. There is no bucket. We don't have to be like this.",
      "created_utc": 1722604028.0,
      "score": 328
    },
    {
      "id": "lg5czrb",
      "body": "[removed]",
      "created_utc": 1722610323.0,
      "score": 129
    },
    {
      "id": "lg6hkzu",
      "body": "Post likes these help me feel less alone in this world, everywhere I look I see nobody that really understands the world like we do, how fucked all of this is and it causes so much pain to see how selfish we as humans seem to have become. I just wish more people understood and tried to make the world better but then again they might end up being miserable too after opening their eyes to the miseries of the world.\n\nI wonder when we will all arrive at a solution",
      "created_utc": 1722623198.0,
      "score": 58
    },
    {
      "id": "lg7hyvu",
      "body": "Life can be a shit show, we all know how ugly it looks when people realize how shit of lives some of us have. OP, I sincerely hope you can make all the ugliness in the world a little prettier for yourself. Don’t give up. Take care",
      "created_utc": 1722635130.0,
      "score": 15
    },
    {
      "id": "lg56hvh",
      "body": "Agreed. Human nature is innately the opposite of 'socially acceptable'. That is what society doesn't want one to know.",
      "created_utc": 1722608192.0,
      "score": 56
    },
    {
      "id": "lg55h61",
      "body": "[removed]",
      "created_utc": 1722607843.0,
      "score": 93
    },
    {
      "id": "lg5rz8c",
      "body": "Nah this is a legit perspective.  I hate everything a lot of the time.",
      "created_utc": 1722615128.0,
      "score": 55
    },
    {
      "id": "lg76t0r",
      "body": "The sad part is we can't do anything 🥲",
      "created_utc": 1722631365.0,
      "score": 21
    },
    {
      "id": "lg5u7u4",
      "body": "I try to tell people this every day and it's always met with some cop out regarding religion, politics, economics...but at the end of the day, all of that boils down to human psychology. It really isn't any deeper than the human drives to survive and reproduce. \n\nBut nobody thinks about that shit. I'm actually relieved to read this from someone who's not myself for once. I wish I could unlearn what I know and live in ignorant bliss. But unfortunately pandora doesn't go back in the box...",
      "created_utc": 1722615842.0,
      "score": 20
    },
    {
      "id": "lg58nu1",
      "body": "Loved reading this ❤️",
      "created_utc": 1722608917.0,
      "score": 52
    },
    {
      "id": "lg5ba3s",
      "body": "Your not wrong very well said",
      "created_utc": 1722609772.0,
      "score": 26
    },
    {
      "id": "lg57nu4",
      "body": "i feel the same way.",
      "created_utc": 1722608584.0,
      "score": 19
    },
    {
      "id": "lg56lla",
      "body": "There are beautiful things and beautiful people in this world. The existence of suffering and ugly does not erase the existence of beauty and everything else. This is a very black and white view, and this world is not black and white.",
      "created_utc": 1722608226.0,
      "score": 61
    },
    {
      "id": "lg6c1us",
      "body": "Misanthropy is a conditioned trait. We’re not born like this.",
      "created_utc": 1722621439.0,
      "score": 20
    },
    {
      "id": "lg7eque",
      "body": "It's true if you spend too much time on Reddit and other social media. You would have totally different experience if living in some small remote community.",
      "created_utc": 1722634016.0,
      "score": 5
    },
    {
      "id": "lg5hw0q",
      "body": "Whoa, that's one way to look at it, you've got some points there.\n\nIt's like a paradox, I assume. Humans are social species, but are separate individuals, which of course affects the way we operate. \n\nLet's assume, if we take the individual as the main thing, we will have a place where individuals can do everything without limits, an irregular and chaotic bunch. But then it is certain that we will not completely live alone but in groups, because we have social behavior. And of course there will be conflict and war, it's just a part of nature, it is not created and it is just....there. But if we put society first, and people follow the majority, we will have an easy to manage and safer life, but individuals will be limited.\n\nHumanity is an animal, agree. We're basically the same, I agree. But if we go deeper, it becomes clear that everyone is different. We are all different, if not in appearance then in the way of thinking, or experience. What makes humans different from other animals is that we have language, speech, the ability to think, compassion....etc etc. It's just a result of evolution, it's just there. And I'm saying humans are \"different\", not \"better\" than other animals, this depends on the individual we want to talk about.\n\nAnd clearly we have the ability to think, so the meaning of life is not just about fucking and breeding. I don't really understand the concept of \"modern love\", so I won't say much about it. I will just say that from my perspective, love is a blend of both human invention and primitive instinct (biological).\n\nEverything has its good and bad sides. If you are part of a group, you must respect the rules and behave within the group's norms/ rules that based on the majority of individuals in that group. The downside of society is that individuals who are different will easily be eliminated. This is why most people these days try to fit in, to be part of the majority, and this is why they have to deceive others and themselves. \n\nThese things make us conflict with each other, and not only with each other but also with ourselves. Living within a standard framework makes us feel like we are puppets being pulled on strings, it is a double-edged sword, both protecting us and causing us misery. We feel miserable because we feel limited, and uncertain. Because we don't know where to find happiness, and because we think the purpose of life is happiness.\n\nWe get lost when searching for what is called right and wrong in this word. But in my opinion, there is nothing really right or wrong. Just like no one is truly good or bad.\n\nI'm not even sure what I'm babbling about, and these are just my thoughts. So don't believe it completely.",
      "created_utc": 1722611921.0,
      "score": 23
    },
    {
      "id": "lg6rnxv",
      "body": "“Everybody is awful these days, It’s enough to make anyone crazy.” Joker (2019)",
      "created_utc": 1722626435.0,
      "score": 8
    },
    {
      "id": "lg74g0l",
      "body": "I feel you, but just because our society is fucked doesn't mean humans are fundamentally evil. We're self-interested as any organism, but we're also social animals. \n\nI feel pain seeing other humans and other creatures in pain via my sympathetic neurons. Yes I want to stop that pain because on some level it is hurting me, but that doesn't invalidate the fact that I still care about their state and want them to be okay.\n\nSame goes for people being happy, their happiness contributes to my own. Modern technology has really thrown a wrench in that with how isolated and falsely connected we can be. Because we are still animals at the end of the day we need some degree of visceral feedback to get us thinking socially. But I still see that social urge playing out in the people around me everyday.\n\nAll this is to say we are a bunch of stupid, sad, naked apes, desperately trying to find a way to just be okay from one day to the next. But the cruelty of the modern world and the systems which perpetuate it aren't inevitable and don't have to be permanent. \n\nFrom one fucked up ape to another I don't know that things will get better, but I think they can get better, and I hope they do. If not for us, then at least for whoever comes next.",
      "created_utc": 1722630591.0,
      "score": 8
    },
    {
      "id": "lg6w8d8",
      "body": "Me too, just got scammed 3K, which impacted my mental disability.  Haven’t slept in 3 days.  Been thinking about killing myself the past few days.",
      "created_utc": 1722627924.0,
      "score": 7
    },
    {
      "id": "lg50e75",
      "body": "[removed]",
      "created_utc": 1722606082.0,
      "score": 12
    },
    {
      "id": "lg7iq1u",
      "body": "Not everyone is the same.. sounds like you’re dealing with mental health issues tho :/ \n\nI feel like you have horse blinders on regarding humans too. For example I choose not to have kids until I know I can offer another human a good life, I’m not being a simple ape about it. Also I’ll probably end up fostering or adopting because I’m almost 40 right now.\n\nYou should surround yourself with better people, maybe that way you won’t be hating being alive so much.. just a thought.\n\nI know I was actively suicidal living with my family and I left at 19. I’ve experienced tons of different types of people and kept close the kindest, the ones that inspire me and that care about growing and being better as people. Nobody’s perfect and we all make mistakes but trying to be aware and do better is what matters..",
      "created_utc": 1722635395.0,
      "score": 8
    },
    {
      "id": "lg8e1ob",
      "body": "We are so brainwashed and sick in this country. I want to die every day. Ive been on meds for 10 years. Counseling for 10 years. Nothing helps. My hope is dead. I want to give up so badly.",
      "created_utc": 1722647306.0,
      "score": 8
    },
    {
      "id": "lg8f3i4",
      "body": "You are not wrong at all. Every single thing you said is correct, but in the end we can’t change that we’re human, wether we are right or wrong morally doesn’t matter in the end, so just do as you please in life, live as you please, you don’t have to be a great person, you decide what your morals are, and live by that no matter what anyone thinks. Do as you please in this world, because in the end nothing TRULY matters",
      "created_utc": 1722647734.0,
      "score": 3
    },
    {
      "id": "lg9j7i8",
      "body": "Perfectly said. Humanity is the scum of the earth.",
      "created_utc": 1722667456.0,
      "score": 3
    },
    {
      "id": "lg5y1i9",
      "body": "[deleted]",
      "created_utc": 1722617048.0,
      "score": 6
    },
    {
      "id": "lg7a8yf",
      "body": "I see it the way you do. It is so meaningless.",
      "created_utc": 1722632501.0,
      "score": 6
    },
    {
      "id": "lg9204s",
      "body": "Who doesn’t hate humanity?",
      "created_utc": 1722657728.0,
      "score": 2
    },
    {
      "id": "lgh1ato",
      "body": "the world is nasty place. either you are the toilet paper or you are the poop.",
      "created_utc": 1722789219.0,
      "score": 2
    },
    {
      "id": "lg8qmqh",
      "body": "capitalism really does do a number on people’s sense of humanity and permanently scars the soul of society huh",
      "created_utc": 1722652522.0,
      "score": 3
    },
    {
      "id": "lg50m4u",
      "body": "Really understandable your point of view... for me love and romance can work... but on one condition, there is extreme sincerity on both sides... ergo, for me it would be fine to be with someone who understands how the world really works, so that I can be with someone for a while who isn't a machine designed to say shit. That does shit. Who pretends everything is good. Who doesn't understand how the world works.  \nIf that's not there, I don't think I would find myself really enjoying a relationship... because everything would be based on... \"nothing\" pretending that the world will be rosy... WHAT ROSY? WE ARE MONKEYS FACING EXTINCTION!",
      "created_utc": 1722606160.0,
      "score": 5
    },
    {
      "id": "lg6s9py",
      "body": "You’re right, that’s why I advocate for antinatalism and human extinction, one thing about this filthy species that I hate the most is how they try to hide their inherently animalistic nature with civilization and think that they are superior to other species because of it.",
      "created_utc": 1722626632.0,
      "score": 4
    },
    {
      "id": "lg6vsw7",
      "body": "Maybe I’m the only one here who feels this way but I literally don’t give a fuck anymore. I don’t give a shit about love, romance and relationships. I live as I please and, at almost 30, I’ve been single for two years now after two relationships. Who cares? Before I tie my own rope for someone’s daughter, I’d rather chill my balls alone and enjoy myself.",
      "created_utc": 1722627785.0,
      "score": 2
    },
    {
      "id": "lg6yb7a",
      "body": "Basically I wish to die every day and I'm going to make that come true.",
      "created_utc": 1722628597.0,
      "score": 2
    },
    {
      "id": "lg79v9y",
      "body": "I couldn’t have said it better",
      "created_utc": 1722632374.0,
      "score": 2
    },
    {
      "id": "lg868p6",
      "body": "This is me every morning lol",
      "created_utc": 1722644226.0,
      "score": 2
    },
    {
      "id": "lgb3pbf",
      "body": "Anyone who brings children into this shit is either insane or evil.\nYour kid is gonna suffer , in all probability. Even fucking 'Chads and Stacies'.\nAnd when it gets its first smartphone it's a Russian Roulette game that might end in body dysmorphia or suicidal depression.",
      "created_utc": 1722697401.0,
      "score": 2
    },
    {
      "id": "lg5hwqh",
      "body": "Spot on mate",
      "created_utc": 1722611927.0,
      "score": 3
    },
    {
      "id": "lg5k52u",
      "body": "Agree with every word you said. I feel like we would be best friends irl",
      "created_utc": 1722612637.0,
      "score": 3
    },
    {
      "id": "lg9ht1u",
      "body": "I think about this a lot. I don’t want to be here neither. I want to be strong but i know i’m too soft to stick around.",
      "created_utc": 1722666570.0,
      "score": 1
    },
    {
      "id": "lg9lnkb",
      "body": "yes i had wished that apocalypse comes sooner and wipe everyone out, even the nice ones. but this thought only ruin my experience of life, i frustrated by things i cant control. so i decided to just focus on mine while helping as much as i can. idc if this will inspire others or not, i'll do it bc i want to.. but i did got inspired by passionate people doing what they love and just being themselves. they seem so bright and life is meaningful bc of them.",
      "created_utc": 1722669004.0,
      "score": 1
    },
    {
      "id": "lg9mtce",
      "body": "Damn bro, this made my day on how relatable it is. My little shit as long as we have each other we can embrace the absurdity with confidence and maybe get some good fuck and call it a good time tbh",
      "created_utc": 1722669752.0,
      "score": 1
    },
    {
      "id": "lgb3rvg",
      "body": "FWIW, a year ago, I would've agreed with you and made the same leap. I was on the verge of signing my own one-way ticket. Some major life events happened that put a lot of things into a whole new perspective for me, and my will to live got stronger than I can ever remember it being. The world didn't change, but I did. I became kinder and more willing to see the struggles that we all face. At our baseline, you are correct. We are animals, but we are also capable of being so much greater than we have been. I couldn't change the world, but I could change the way I viewed and interacted with it and the people around me. I hope that, for your own sake, you are able to find some form of peace. Much Love.",
      "created_utc": 1722697425.0,
      "score": 1
    },
    {
      "id": "lgb48qd",
      "body": "Well I feel like there is really no point in trying to see human existence from a point higher than human then interpreting It to judge It from human standards, is there not any conceivable Mode of existence that would satisfy you?",
      "created_utc": 1722697586.0,
      "score": 1
    },
    {
      "id": "lgbdfnx",
      "body": "Yup I couldn't agree with you more about humanity!! It really does suck!!",
      "created_utc": 1722700716.0,
      "score": 1
    },
    {
      "id": "lgikdrs",
      "body": "you're clearly more self aware and intelligent than most people, why not use that to make it a better place? people underestimate what one person can do, maybe love and romance are just bullshit but why not play into it 😂",
      "created_utc": 1722807988.0,
      "score": 1
    },
    {
      "id": "lgl40wq",
      "body": "I know the feeling OP.\nWhen i lost faith in humanity, i restored it with God. For me, Islam worked out. Im not pushing my ideologies onto you in any way, just wanted to share my experience. ",
      "created_utc": 1722853222.0,
      "score": 1
    },
    {
      "id": "lguyloi",
      "body": "I have the same views on humanity.\n\nIt also makes me depressed. I’m more self-aware than most of my peers, even my own family, and what you said about wanting to be right for their egos are true.\n\nI wish we could’ve been different, but I have my doubts after seeing how truly stupid other people can be.",
      "created_utc": 1722988969.0,
      "score": 1
    },
    {
      "id": "lh16sjk",
      "body": "This makes me want to cry. Hello my fellow logitian. You speak the truth.",
      "created_utc": 1723077822.0,
      "score": 1
    },
    {
      "id": "lhulymz",
      "body": "I literally have the exact same viewpoint, I love the perspective",
      "created_utc": 1723516207.0,
      "score": 1
    },
    {
      "id": "m21bjdk",
      "body": "Finally something upvote worthy",
      "created_utc": 1734194762.0,
      "score": 1
    },
    {
      "id": "lg6p9v7",
      "body": ">>the fundamental path we are set on by our biology is pretty much decided at birth.  \n  \nThis is so true, destiny exists and genetic limitation won't allow you to deny or alter it. I hate that this topic is so shunned and ignored by society because deep down, they know it's true, they just don't like it.",
      "created_utc": 1722625655.0,
      "score": 1
    },
    {
      "id": "lg6tg9n",
      "body": "Honestly I agree…\nI have a criminal justice degree and love watching trials/true crime, so the last thing you said really resonated. \n\nPeople LOVE to villainize murderers and criminals, putting themselves on such a high pedestal. In reality, everyone is capable of violence. It’s exhausting reading comments like “he’s just born EVIL”. Dude…. we’re animals. We’ve been killing each other for thousands of years.",
      "created_utc": 1722627016.0,
      "score": 0
    },
    {
      "id": "lg771w6",
      "body": "[deleted]",
      "created_utc": 1722631447.0,
      "score": 0
    },
    {
      "id": "lg7isxx",
      "body": "Maybe we’re meant to make the best out of our lives. What interests you? What do you wanna get better at?",
      "created_utc": 1722635423.0,
      "score": 1
    },
    {
      "id": "lg7zlv0",
      "body": "[deleted]",
      "created_utc": 1722641659.0,
      "score": 1
    },
    {
      "id": "lg53kjb",
      "body": "[removed]",
      "created_utc": 1722607191.0,
      "score": -11
    },
    {
      "id": "lg74uzp",
      "body": "I have days like that and some days I’ll be working at the concrete yard and a feral cat I’ve been feeding comes up to me and start asking for pets and love. He won’t ask for food or anything. Just wants to get on my lap, lay his head down and get belly scritches. There is just love out there and the deepest darkest fathoms of humanity can’t touch that fact. Friendship is one of the purest forms of love too and can be completely non transactional. This dark time you’re experiencing will pass just like the good times and medium times.",
      "created_utc": 1722630727.0,
      "score": 0
    },
    {
      "id": "lg8gm44",
      "body": "I got the same a while back and ended up generally disliking people. Changing your mindset to realise they are just stupid, dumb, and a bit of a waste of time,helps move on and laugh about their uselessness. (How I deal with it if it helps)",
      "created_utc": 1722648351.0,
      "score": 0
    },
    {
      "id": "lg5bovh",
      "body": "Babe come quick a new Ted Talk just dropped",
      "created_utc": 1722609906.0,
      "score": -6
    },
    {
      "id": "lg8ghvn",
      "body": "Where is the asteroid!? 🌎💥",
      "created_utc": 1722648302.0,
      "score": 0
    },
    {
      "id": "lg97qvz",
      "body": "Finally someone else says what I’m thinking all the goddamn time.",
      "created_utc": 1722660666.0,
      "score": 0
    },
    {
      "id": "lg9aoqu",
      "body": "Get sick so of people’s egos. Get over yourself. Stop being too insecure to ask for some fucking help…..\n\n\nEverybody goes through shit.\n\nEven at work the one time a cook was mad and he mentioned something about not having a gf….literally people just take their anger out on you for absolutely no fucking reason.\n\n\nI love dogs and the way they always seem to try to make you feel better… you cry and they’re there. Unlike anybody else.",
      "created_utc": 1722662300.0,
      "score": 0
    },
    {
      "id": "lg9fdxk",
      "body": "“Modern concepts of love and romance are just shi we made up to try and collectively gaslight society into keeping our animalistic side”  frfr",
      "created_utc": 1722665067.0,
      "score": 0
    },
    {
      "id": "lgam3n4",
      "body": "Umm i very much agree with you. 😂😂\n\nWell you're right but my thoughts are in different directions like : I don't like the universe 🤣🤣. \n\n[PEOPLE CAN HAVE DIFFERENT OPINIONS OVER THIS AND I DON'T WANNA ARGUE ABOUT THIS. I RESPECT YOURS OR EVERYONE'S POV, I'M JUST VENTING MY THOUGHTS OUT HERE.  IT IS JUST WHAT MY THOUGHTS ARE LIKE AND I'M JUST TELLING YOU WHAT I THINK. I KNOW MANY OF YOU WILL DISAGREE WITH ME AND THAT'S ABSOLUTELY OKAY. I DON'T HAVE A PROBLEM. I'M JUST TELLING YOU GUYS WHAT I FEEL. AND WHY I THINK ABOUT DYING ALL THE TIME. AND I'M TIRED TO ARGUE ANYWAY. SO PLEASE JUST READ IT AND IF YOU FIND IT WRONG THEN LEAVE IT, IGNORE IT. I'M SORRY. BUT IF YOU RELATE TO IT, LIKE IT, THEN YOU CAN SAY ANYTHING YOU WANNA ADD TO IT. THANKYOU. ]\n\n\nThe hate damn whole universe. \nI hate the rules of the universe. \nJust let me die and set me free. \nI don't want reincarnation and shits like that. \nI don't want to be here. \n\nWhy do I even have a soul. \nEven if I have a soul then why do I have a body. \nAnd why I need to take care of my body ( this temporary shit that looks pretty) . \nWhy there's so much pain. \n\nWhy life equals pain. \nWhy can life not be normal with no pain. \nWhy are there punishments. \n\nIt's okay I understand the karma thing, that I need to do good to receive good but what's the point of it. 😭😭\n\nJust set me  free. \n\nIf you want to enlighten a soul then you can enlighten it while it is just a soul. Why give them a body, a planet to live, and pain that comes with the body.? 😭\n\nIf souls are punished for their bad behaviour in the hell then why is the need of body ? \n\nJust punish the soul😭. Just teach soul a lesson. \nWhy to give them bodies and 🌍 and life and death and relationships and love and hate etc. \n\nWhy????????? \n\nI agree with you and I feel the same. I don't wanna get up in the morning and see it all once again. 🥲",
      "created_utc": 1722690678.0,
      "score": 0
    },
    {
      "id": "lgbhtnn",
      "body": "no shit man, I don’t think when Hitler almost genocided the Jews, they had a peace treaty",
      "created_utc": 1722702229.0,
      "score": 0
    },
    {
      "id": "lgbuv64",
      "body": "yes but what if we turned that into a revolution?",
      "created_utc": 1722706679.0,
      "score": 0
    },
    {
      "id": "lgf0vqs",
      "body": "It’s all of this, combined with the very active mass extinction events we are experiencing as a globe. The essentialism of human biology and the obvious effects of human consumption for the last millennia should be macro-socially persuasive enough but mfs act like this is the Truman show and we’re live on set or some shit. If world politics don’t tear shit apart before nature does, what’s the most exciting thing to look forward to? Collapse is soooo apparent in every facet and has been for generations since industrialization…yet the world keeps metaphorically spinning working towards making the literal spinning, cease. I hate this existence.",
      "created_utc": 1722753090.0,
      "score": 0
    },
    {
      "id": "lg4pm35",
      "body": "[deleted]",
      "created_utc": 1722601963.0,
      "score": -12
    },
    {
      "id": "lg7j1ih",
      "body": "You and me both",
      "created_utc": 1722635508.0,
      "score": -1
    },
    {
      "id": "lg506j1",
      "body": "[deleted]",
      "created_utc": 1722606005.0,
      "score": -34
    },
    {
      "id": "lg5xise",
      "body": "[removed]",
      "created_utc": 1722616887.0,
      "score": -30
    },
    {
      "id": "lg7axly",
      "body": "While i agree, just about my life, i like to leave the society behind for some time and just get out there in nature with my dog, like with hiking. There it is quiet and peaceful, none of these problems that we have to deal with in daily life.\n\nThis helps me more than these toxic posivity motivational speechs and whatever, just saying, maybe it's the same for others here, it's worth a try.\n\nI also like the true love and loyality from dogs, but not everyone likes dogs, i understand this. But for me, it's great, it is peaceful, it is a good thing and never a waste of time.",
      "created_utc": 1722632728.0,
      "score": 46
    },
    {
      "id": "lgakuec",
      "body": "so true. My classmates are all mean and untrue with each other that it makes me even more disgusted of society",
      "created_utc": 1722690136.0,
      "score": 10
    },
    {
      "id": "lg7p3y8",
      "body": "There is a bucket though, capitalism\nI realizer a few days ago theres competitiveness everywhere literally everywhere like a plague. Even at the hospital",
      "created_utc": 1722637702.0,
      "score": 18
    },
    {
      "id": "lkcl7g8",
      "body": "gaming \"communities\" in particular are some of the most vile places I can think of, coming from someone who has gamed their whole life",
      "created_utc": 1724856652.0,
      "score": 4
    },
    {
      "id": "lg93f7h",
      "body": "Religion divides us that's for sure.",
      "created_utc": 1722658425.0,
      "score": 12
    },
    {
      "id": "m5nz37f",
      "body": "that is a fact people does not understand",
      "created_utc": 1736149154.0,
      "score": 1
    },
    {
      "id": "lg9a6w3",
      "body": "Yeah you can",
      "created_utc": 1722662021.0,
      "score": 8
    },
    {
      "id": "m1uydsk",
      "body": "I hate this mindset.",
      "created_utc": 1734098618.0,
      "score": 1
    },
    {
      "id": "lg6xnk2",
      "body": "Lol couldn't have said this better myself.",
      "created_utc": 1722628384.0,
      "score": 5
    },
    {
      "id": "lgd8v84",
      "body": "what do you know about psychology?",
      "created_utc": 1722724388.0,
      "score": 1
    },
    {
      "id": "lg8hwom",
      "body": "I wasn't depressed but now I am after reading that 🤓",
      "created_utc": 1722648884.0,
      "score": 1
    },
    {
      "id": "lg5g2cr",
      "body": "Ong, it's depressing knowing these people won't be able to change how they look at things. So much to see and so much to do but they still choose to be absorbed in negative shit",
      "created_utc": 1722611333.0,
      "score": 27
    },
    {
      "id": "lg5g6d1",
      "body": "Bro are you ok...",
      "created_utc": 1722611369.0,
      "score": 5
    },
    {
      "id": "lgikh6q",
      "body": "or don't, you can choose not to follow the animalistic monkey path, there are outliers, people that don't want to have kids, don't want to have sex even, you can choose to be single etc",
      "created_utc": 1722808022.0,
      "score": 1
    },
    {
      "id": "lg8k73f",
      "body": "[deleted]",
      "created_utc": 1722649821.0,
      "score": 7
    },
    {
      "id": "lg7abny",
      "body": "I'm sorry, but who are you???\n\nEver think that my conclusion of \"everyone is shit\" is a massive contributor to the blatant suicidal ideation throughout my post?? You don't understand how these things go hand in hand for a lot of us? I literally am one of the people that \"have one of the biggest struggles you could possible have in this world\". I've struggled with it for my entire adult life. What do you know about me?\n\nIf you don't like it, feel free to post yourself. Also, you aren't a mod here. You don't get to decide if my post is appropriate or not. I've known about this sub and have been here off and on for 4+ years, so I'm well aware of the types of people that post here. Sometimes, we need to hear someone validate our thoughts. Sometimes, support IS stewing in your own negativity and seeing that some people can relate to your feelings.\n\nThis is literally THE place to vent for suicidal people like me. Stop trying to gatekeep what's ok in a space where we're supposed to be allowed to lament our struggle.",
      "created_utc": 1722632526.0,
      "score": 11
    },
    {
      "id": "lg8l2oh",
      "body": "This is just what every suicidal person is thinking? I mean, maybe not every one of them, but certainly me. This is literally talking about why people are suicidal",
      "created_utc": 1722650180.0,
      "score": 1
    },
    {
      "id": "lg9acd8",
      "body": "Exactly :)",
      "created_utc": 1722662107.0,
      "score": 1
    },
    {
      "id": "lg84ev9",
      "body": "imagine going into a subreddit thats entire purpose is for suicidal people to vent and seek support/connection and calling them \"whiny\" when they dare to speak about the reasons they're suicidal.\n\nyou cant make this shit up lmao",
      "created_utc": 1722643514.0,
      "score": 3
    },
    {
      "id": "lg5p3dt",
      "body": "[removed]",
      "created_utc": 1722614203.0,
      "score": 1
    },
    {
      "id": "lg8u890",
      "body": "[deleted]",
      "created_utc": 1722654095.0,
      "score": 1
    },
    {
      "id": "lg5ap0k",
      "body": "This ain't the place for that kind of dumb shit",
      "created_utc": 1722609582.0,
      "score": 20
    },
    {
      "id": "lg5fqp3",
      "body": "Grow up pal there's no god",
      "created_utc": 1722611228.0,
      "score": 15
    },
    {
      "id": "lg80n2n",
      "body": "is it really a solution if I will be killed for apostasy?\n\nThe reason suicide rate is low among muslims is because of the fear of hell. If you take your own life you'll be tormented in hellfire forever with no chance of getting into heaven.",
      "created_utc": 1722642053.0,
      "score": 2
    },
    {
      "id": "lg6n3jt",
      "body": "The solution to Humanity existing? Sure buddy",
      "created_utc": 1722624952.0,
      "score": 4
    },
    {
      "id": "lg7xa1q",
      "body": "I feel the same way as you: nature, dogs but also home, cats and very few people of trust",
      "created_utc": 1722640773.0,
      "score": 13
    },
    {
      "id": "lgct0k5",
      "body": "I feel like the sad part is that some people delight in that negativity. They love drama. They thrive off of being rotten to someone else.\n\nIt feels like people are learning to be sociopaths at an unprecedented rate because the behavior is often rewarded.",
      "created_utc": 1722718567.0,
      "score": 7
    },
    {
      "id": "lr8vb1e",
      "body": "Mello is in the right headspace. You can't just sit around and do fuck-all, you gotta do something about it if you feel you need to",
      "created_utc": 1728565534.0,
      "score": 2
    },
    {
      "id": "lgd9osa",
      "body": "Being in therapy for 18 years and having a personal interest in it due to complex trauma has taught me a lot about psychology 😅",
      "created_utc": 1722724697.0,
      "score": 2
    },
    {
      "id": "lg8wx5o",
      "body": "I see negativity everyday on social media and it can really drive your mind to the dark thoughts like OP's post. But I just realized that life is not really 100% social media, there are better people out there everywhere, and it gets better. Now I just blame myself instead of the world though",
      "created_utc": 1722655319.0,
      "score": 11
    },
    {
      "id": "lg6lrcq",
      "body": "its not completely impossible to change your perspective like this, just nearly",
      "created_utc": 1722624521.0,
      "score": 9
    },
    {
      "id": "lgd8r81",
      "body": "at the end of the day this is processing violence through violence, ironically another spin of the wheel.",
      "created_utc": 1722724347.0,
      "score": 3
    },
    {
      "id": "lgcydjr",
      "body": "[removed]",
      "created_utc": 1722720494.0,
      "score": 2
    },
    {
      "id": "lg81yam",
      "body": "Someone could be upset over a bag of popcorn they burnt and that’s ok. Let the OP vent?",
      "created_utc": 1722642560.0,
      "score": 3
    },
    {
      "id": "lg5p5ss",
      "body": "[removed]",
      "created_utc": 1722614225.0,
      "score": 2
    },
    {
      "id": "lg82qc1",
      "body": "You will not be killed directly after apostasy, if you think that you will be killed directly after that you need to study islam right and study the conditions in this situation \n\n\n\nanother point about the suicide you are wrong about that the one who killed himself will be tormented in hellfire forever \n\n\nBy the way, just because a Muslim fears hellfire does not necessarily mean that the whole thing is wrong\n\n\n\nStudy islam  then talk",
      "created_utc": 1722642858.0,
      "score": -3
    },
    {
      "id": "lg6z32l",
      "body": "You didnt understand what i mean \n\n\nLook at the suicide rate among muslim Communities \n\n\n\n\nBut probably all your knowledge about islam is allahu akbar then boom\n\n\nThe islam is the solution for humanity problems in all aspects and that what i mean",
      "created_utc": 1722628844.0,
      "score": -7
    },
    {
      "id": "lgiywpf",
      "body": "generic \"you\" vs direct \"you\"\n\ncmon now",
      "created_utc": 1722813456.0,
      "score": 2
    },
    {
      "id": "lg5pyy2",
      "body": "[removed]",
      "created_utc": 1722614480.0,
      "score": -1
    },
    {
      "id": "lg83sqx",
      "body": "after being a muslim for more than 20 years, I've decided to leave because I realized it's not a true religion just like others because religion is man made.\n\nAlmost all muslim countries punish apostasy by death or at least put you into prison, I know because I live in one. \n\nIf you are living in a secular country don't talk about the laws. The way you practice Islam is not the same as islamic government and most of its people.",
      "created_utc": 1722643273.0,
      "score": 5
    },
    {
      "id": "lg7ep3w",
      "body": "Religion, no matter if it is islam, christianity, buddhism or hinduism, whatever, is never the answer. It's made up by people in the past, old tales and myths that get presented as if it would be real, with all the bad elements that come with it - like claiming suicide would be a sin and one would get to hell or whatever, it's just a tool for power, nothing else.\n\nIt's always the same what you hear from religious people, like \"god has a trial for you\", well, what if god would just give us a good life instead of letting us suffer, hm?\n\nIf there is any god around, it raises the questions, why there's not even some fairplay, like when a baby dies right after birth and don't even get to live the life, what's this about? Why should anyone have to deal with such problems like we have here, why should anyone have to suffer because of being disabled, for what cause? That some god is happy?\n\nIt all makes no sense, when you think logical about it. If i'd be god, i'd make things better, that people have a good life and that there's no war, crimes, suffering, body- and mental health issues etc.\n\nThen, just think what we humans could achieve without these bad and negative things in society and life. When we'd be able to get the everyone to do what is his or her talent, skill and strength? With this, we could reach utopia.\n\nBut no, instead, we have to suffer. Yeah, that's really great from god, no matter which god you believe in.",
      "created_utc": 1722634000.0,
      "score": 8
    },
    {
      "id": "lg7lf8w",
      "body": "Another thing you talked about is what is the purpose of all this? Why did God create us to suffer?\n\n\n Let me tell you, God did not create us just to suffer . If you take a look at the problems that humans suffer from, you will find that most of them are caused by humans like you and me. Look around you, the entire Earth is literally under human control.\n\n\n Natural disasters are certainly merciless, but in general the human race is completely in control and there is no other being that could threaten its extinction except itself. All other creatures have been adapted by man to serve him, from the largest creatures, such as the whale, to the smallest, such as insects and others. \n\nThis is a wisdom from God \n\n\nin order to test us and we must worship Him and obey His commands until the end of our testing period on earth and we die. Then God will hold us accountable for all our deeds, good and bad. If we are true believers and obey God's commands, we will enter Paradise and there will be all the bliss\n\nGod give us the Freedom to choose if we want to be good or bad",
      "created_utc": 1722636360.0,
      "score": -3
    }
  ]
}