{
  "id": "1j8swhb",
  "title": "My biggest regret is not killing myself when I was a child.",
  "selftext": "I was suicidal as a child but I stuck around because I was stupid enough to believe things would get better. Nothing has gotten better. I have spent my entire life fighting to feel decent about myself but nothing has gotten better. There is no place for me here, and I wish I realized that earlier. Some people are just not meant to be on this earth. I am miserable every single day and no matter what I do it'll never change. I wish I killed myself as a child so I could have gone in peace. Now I have so many responsibilities and so much guilt. Things are never getting better and the opportunity I had to leave before everything became too much is gone. I know I can't go back in time but I regret it so, so much. I wish I killed myself when I was a child. I had no idea that I would be so angry at myself over this. I thought things would get better. I wish I killed myself when I was a child.",
  "created_utc": 1741705593.0,
  "score": 876,
  "num_comments": 99,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1j8swhb/my_biggest_regret_is_not_killing_myself_when_i/",
  "comments": [
    {
      "id": "mh7stgb",
      "body": "[removed]",
      "created_utc": 1741706541.0,
      "score": 87
    },
    {
      "id": "mh9qp9k",
      "body": "I often say this I regret not doing it after high school. ",
      "created_utc": 1741726220.0,
      "score": 48
    },
    {
      "id": "mh9rlj6",
      "body": "I tried in 2016 and it failed.  They don’t know how I survived.  I even remember feeling like I died, it felt good but in like 00.2 seconds I felt zapped back into my body. Gives me weird theories",
      "created_utc": 1741726464.0,
      "score": 35
    },
    {
      "id": "mhejcg5",
      "body": "I fucking hate when everyone will always say the line ” things will always get better :)” fuck me man i can relate to you i have not been truly happy for a day in a decade without substances and only meaning i have is to no stress my parents and try to make their life as easy as possible. Btw if things could not get any worse my older brother that has spent his 30 year life doing literally nothing got an psychotic episode that got diagnosed as schizophrenia because it would not stop and now my parents has to take care of him indefinitely. I feel so fucking bad for my oarents because they tried their best but they got us as childs. I see nothing positive in the future.",
      "created_utc": 1741795069.0,
      "score": 14
    },
    {
      "id": "mh8zkv6",
      "body": "feel the same, i'm sorry op :(",
      "created_utc": 1741718648.0,
      "score": 12
    },
    {
      "id": "mh7v8eu",
      "body": "I understand u and I'm rly sorry.",
      "created_utc": 1741707248.0,
      "score": 21
    },
    {
      "id": "mhdnnea",
      "body": "I, unfortunately, understand this completely. I had a pretty traumatic childhood, have soooo many holes in my memory. I can't remember the good times, only the bad. I started having SI around 11 or 12 and I'm 30 and still wanting to do it. \nMy life is really easy now. I'm a stay at home mom, I have chickens, cats, a dog. I live in a touristy areas, so there's always stuff going on. Within a 2 hours drive of 2 major cities, barely 2 hours from a beach. I'm married, have 2 kids. I'm pretty and I'm smart. Yet I still think about ending it every single day. \n\nDepression is a disease. It's treatable, but finding the treatment that works can be damn near impossible. Speaking of, I need to make an appointment to up my meds bc they're clearly not effective anymore if I'm back in this sub 😐",
      "created_utc": 1741785073.0,
      "score": 7
    },
    {
      "id": "mi3gco0",
      "body": "I wish the same for myself. But I was so hopeful that my life would get better. I thought that if I tried hard enough, I would be fine. But I was wrong. Life only got worse. By not killing myself, I invited more abuse and pain into my life. No amount of medication or therapy could fix anything. People have always treated me like trash. I don’t even feel like I am a human being. I feel like I am a rotten piece of meat. That’s what I am to other people, and that’s what I am to me. My family also agrees that I should have died.",
      "created_utc": 1742136888.0,
      "score": 5
    },
    {
      "id": "mhbwio0",
      "body": "Are you me? Damn do I wish I died 10 years ago. I would have dodged so much stupid shit. So many inconveniences just gone.",
      "created_utc": 1741751428.0,
      "score": 3
    },
    {
      "id": "mhjppng",
      "body": "holy shit same. I think back everyday to when my mom told me she almost lost her pregnancy and wish I wasn't born. I could've been spared all this.",
      "created_utc": 1741864961.0,
      "score": 3
    },
    {
      "id": "mhc26zg",
      "body": "I tried to end my life as a kid and I failed and I’m still miserable and even to this day I don’t want to be here anymore and I have no one to even talk to anymore",
      "created_utc": 1741753982.0,
      "score": 2
    },
    {
      "id": "mhkmsob",
      "body": "Same. You articulated this so well. Someone depends on me now, and the guilt of leaving them/the changes they would experience outweigh the desire for relief most days. I'm confident that once I'm a little closer to \"old age,\" I'll finally be ready to be brave. Right now I'm just enduring.  \n\nI'm so sorry that so many of you are feeling this way. I hope you find some healthy relief, OP",
      "created_utc": 1741876953.0,
      "score": 2
    },
    {
      "id": "mhrevw2",
      "body": "Absolutely with you 100%. I wasn’t supposed to be born and my crazy mother would have killed me at the time. I really wish no one interfered with that, I don’t believe in gods or the whole universe meant to be bullshit but I somehow understand it’s not my place here. I am with u OP ty for expressing what many of us feel",
      "created_utc": 1741965651.0,
      "score": 2
    },
    {
      "id": "mhuc1ei",
      "body": "Right there with you. Heroin and crack helped me briefly, but then they didn’t. Once I gave them up I fell right back to this nothingness. I’m still trying to keep on keeping on, even when there’s no end to this feeling or lack there of in sight.",
      "created_utc": 1741997700.0,
      "score": 2
    },
    {
      "id": "mic7f85",
      "body": "I had an attempt when I was 14, it was unsuccessful and I told not a soul. Just went to school the next day as if nothing happened but most days I wish it would’ve worked.",
      "created_utc": 1742249970.0,
      "score": 2
    },
    {
      "id": "miik92m",
      "body": "I feel every minute of that post. I tried but got caught a few times. I wish I had succeeded. I wish I had denied accepting medical care during both heart attacks and my appendix issues. The world is just a dark cloud as long as I'm in it.",
      "created_utc": 1742335279.0,
      "score": 2
    },
    {
      "id": "mh7rin1",
      "body": "I’m very sorry you’re feeling this way OP, but you don’t deserve to hurt yourself no one does. I can relate as I have been on and off mostly on depressed since I was 11 and parents didn’t address it and let it develop into worse stuff. What has actually made you feel this way about yourself because it’s not true that you are better off dead or should have killed yourself",
      "created_utc": 1741706157.0,
      "score": 3
    },
    {
      "id": "mh9sphi",
      "body": "I understand this completely, the only thing that kind of keeps it at bay sometimes is that if I had died, I would have missed out on a few of my favourite experiences.",
      "created_utc": 1741726770.0,
      "score": 5
    },
    {
      "id": "mh9nyfe",
      "body": "I had complications during birth itself...",
      "created_utc": 1741725467.0,
      "score": 1
    },
    {
      "id": "mh9y3af",
      "body": "Damn. I’m really sorry. 😢 sometimes I feel like life sucks and then it gets worse. But I’m trying my hardest to make the life I want. I’m working hard at school to hopefully achieve my dream life. And you may feel this way and it sucks especially when we don’t wanna be here but I’m sure someone out there is happy that you didn’t. Life truly is hard. Sometimes I don’t mind passing in my sleep but then I think about all the things I haven’t done yet and all the things I want to accomplish and I realize that I’m still here for a reason and we all are. If you ever just need someone to talk to I’m here. I understand how sucky life can be!!!",
      "created_utc": 1741728298.0,
      "score": 1
    },
    {
      "id": "mhavu62",
      "body": "I almost died when I was 15.",
      "created_utc": 1741738494.0,
      "score": 1
    },
    {
      "id": "mhawh5w",
      "body": "I feel this so much!!!!",
      "created_utc": 1741738702.0,
      "score": 1
    },
    {
      "id": "mhcarl3",
      "body": "I can relate so much and i'm sorry you're going through this.",
      "created_utc": 1741758442.0,
      "score": 1
    },
    {
      "id": "mhd8sci",
      "body": "I feel just the same",
      "created_utc": 1741778967.0,
      "score": 1
    },
    {
      "id": "mhe0edl",
      "body": "Honestly I think my childhood was better, when I was thinking about I'm not self important, better than now my adulthood...",
      "created_utc": 1741789274.0,
      "score": 1
    },
    {
      "id": "mhes94f",
      "body": "damn did i just write this",
      "created_utc": 1741797642.0,
      "score": 1
    },
    {
      "id": "mhhq5hz",
      "body": "[removed]",
      "created_utc": 1741829307.0,
      "score": 1
    },
    {
      "id": "mhzt20o",
      "body": "i regret not doing so cuz in my religion if u die as a child u go straight to heaven, i attempted twice back then, but chickened and didnt, now i regret it, i couldve just gotten over with so many miseries and avoided so much unnecessary pain. and ofc i dont dare committing now cuz if do  i'd go straight to hell",
      "created_utc": 1742077564.0,
      "score": 1
    },
    {
      "id": "mi5zx63",
      "body": "I wish I did it years ago. fuck autism.",
      "created_utc": 1742164604.0,
      "score": 1
    },
    {
      "id": "mi60co1",
      "body": "I tried at 10, I regret it failing everyday unfortunately. Trying to get medicated correctly, I understand your pain.",
      "created_utc": 1742164743.0,
      "score": 1
    },
    {
      "id": "mi6r8dq",
      "body": "I get it. I should have when I was a child too. I tried a few times.",
      "created_utc": 1742173959.0,
      "score": 1
    },
    {
      "id": "mi7u325",
      "body": "Same. I should’ve went through with it when I was 21.",
      "created_utc": 1742191015.0,
      "score": 1
    },
    {
      "id": "miaf8q6",
      "body": "My twin sister died during childbirth and I was supposed to die as well, but I didn't. I often wish it was the other way around and my mom could've gotten the better child.",
      "created_utc": 1742231308.0,
      "score": 1
    },
    {
      "id": "mibu8fn",
      "body": "I feel the same way woke up today and put my 🔫 to my head and it is the closest I have ever been to doing it.  I really want to die",
      "created_utc": 1742245918.0,
      "score": 1
    },
    {
      "id": "mid9yn8",
      "body": "Way back in the early 90’s, I remember there was this hill that had a sewer lid sticking out of it. I remember going down that hill on my huffy and trying to jump it. I got some major air and I didn’t stick the landing. I wish I would’ve broken my neck that day. I think I was around 7 years old when that happened.",
      "created_utc": 1742262892.0,
      "score": 1
    },
    {
      "id": "mij5f3y",
      "body": "Omg are you me.\n\nI was suicidal at 13 and didn't kms and I regret it. I stayed in the hope it would get better. It didn't. I'm just a sad pathetic excuse of a person",
      "created_utc": 1742341908.0,
      "score": 1
    },
    {
      "id": "mldknfb",
      "body": "This is so fucking sad, but I get it.",
      "created_utc": 1743775769.0,
      "score": 1
    },
    {
      "id": "mmuieoc",
      "body": "Jesus loves you, and he wants to get to know you :)",
      "created_utc": 1744518664.0,
      "score": 1
    },
    {
      "id": "mmyle5e",
      "body": "me today in the shower...ive been suicidal since the age of 7. Im 24..25 soon. out of a job for 6 months, no responses back from anywhere ive interviewed. unemployment is running dry and im prolly gonna be a burden on my family's rent next month.\n\nI feel foolish for telling myself to wake up. I know ill die before 30, and ill be content with that. No one needs me to continue on with their lives. my passions are dying, my soul feels rotten and decayed. They can keep my twin, i guess.\n\nim just afraid of the pain and the possibility itll fail...but damn ive wanted to die since i began to use my imagination- now i barely have one left.\n\nIm sorry youre experiencing this, youre not alone, i dont know how to help but say i feel you entirely on this. We shouldnt have to feel this way day in and day out.",
      "created_utc": 1744579240.0,
      "score": 1
    },
    {
      "id": "mhacgxc",
      "body": "I don't think I can understand you. I started having suicidal thoughts in 2023. I experienced a lot of stress and a feeling of helplessness and hopelessness. I would like to get rid of these thoughts to be more productive, but unfortunately, I can't control them. Do you read books?",
      "created_utc": 1741732508.0,
      "score": 1
    },
    {
      "id": "mh7tm8w",
      "body": "I was very sick when I was 8-9 years old and would have died without modern medicine. That same age is around the last time I felt any kind of satisfaction with being alive. Sometimes I think I was meant to die then and the hospital should not have interfered. They went against God's plan for me and that is why I am so miserable now. I was never supposed to be alive past then.",
      "created_utc": 1741706779.0,
      "score": 48
    },
    {
      "id": "mh9mp1c",
      "body": "I almost died at birth and for years now I wish I did",
      "created_utc": 1741725119.0,
      "score": 21
    },
    {
      "id": "mhjkizi",
      "body": "[removed]",
      "created_utc": 1741862336.0,
      "score": 2
    },
    {
      "id": "mh9skcx",
      "body": "Have you heard of the quantum suicide thought experiment? Basically there is a theory that if we ever have a near-death experience, we've actually died in one timeline and stayed alive in another timeline (like Schrödinger s cat) but are only aware of the timeline where we are alive because that's the only timeline where our consciousness exists.",
      "created_utc": 1741726730.0,
      "score": 14
    },
    {
      "id": "mi2js4b",
      "body": "Can I ask how you attempted? I've never attempted before myself, but plan on it in the next few years.",
      "created_utc": 1742123605.0,
      "score": 1
    },
    {
      "id": "mhe5brg",
      "body": "Ohh, I'm so sorry, Some of my memories are lost, can't remember, sometimes I hardly remember the bad times, I focused on the good memories. Being a stay at home Mom with 2 Kids is amazing! I'm sure they give you some good moments, hang on these moments!",
      "created_utc": 1741790869.0,
      "score": 2
    },
    {
      "id": "mi93i33",
      "body": "I love my child more than anything. How could I put them through that? Yet the SI has been on my mind since childhood. I’ve tried all the modalities to feel better over the past few decades; nothing sticks. At what point is enough enough? I hate this default mode my brain seems to be wired with. I just want peace.",
      "created_utc": 1742216489.0,
      "score": 3
    },
    {
      "id": "mh7s8mt",
      "body": "Imagine the worst guy you can think of and that is basically me. I make everything worse for other people and I don't even like being here myself. There is no positive to my existence. There is no place in the world where I am welcome or happy and no chance of things getting better, I have tried and tried and tried and there's just no chance. The longer I stick around the worse things get. I feel guilty just for being around for as long as I have.",
      "created_utc": 1741706370.0,
      "score": 19
    },
    {
      "id": "mh9t4yo",
      "body": "I have not had any favorite experiences that I would have missed out on. I honestly have not had a good day in at least a decade. I would not have missed anything at all (anything positive, at least) if I had killed myself when I was a kid.",
      "created_utc": 1741726888.0,
      "score": 9
    },
    {
      "id": "mhhrgkp",
      "body": "Really funny reporting me to reddit cares guys",
      "created_utc": 1741829753.0,
      "score": 1
    },
    {
      "id": "mhaejym",
      "body": "I do read, do you have book recommendations? ",
      "created_utc": 1741733124.0,
      "score": 3
    },
    {
      "id": "mhaidb7",
      "body": "I understand you bro, try to keep an open mind about all the good things you could miss if you were to die too soon, i'd also recommend to read a book \"The art of not giving a fuck\" its great",
      "created_utc": 1741734250.0,
      "score": 1
    },
    {
      "id": "mi4smzj",
      "body": "[deleted]",
      "created_utc": 1742151395.0,
      "score": 0
    },
    {
      "id": "mi2aleo",
      "body": "Interesting",
      "created_utc": 1742117961.0,
      "score": 4
    },
    {
      "id": "mi8dznl",
      "body": "I’ll have to look into this because it literally racks my brain. And it doesn’t make sense with the amount of blood I lost I should not have just felt magically 100% after feeling how I did.  It’s so weird and hard to explain but we feel really high when we die and good all your worries will disappear in seconds.  I think everyone in this sub should try to hang on to their life though.  Even though I’m a survivor and struggle with thoughts I don’t think we should be encouraging one another to hurt one self so anyone reading please be cautious in this sub especially if you’re young",
      "created_utc": 1742203921.0,
      "score": 2
    },
    {
      "id": "mi6pl8w",
      "body": "I dont want to help you with that\n\nYou should be careful in this sub",
      "created_utc": 1742173366.0,
      "score": 6
    },
    {
      "id": "mh7ttdm",
      "body": "Anything in particular that you can share with us to as why you think you have done so bad for others?\n\nAnd personally, if you know your actions and are willing to make things better that's a reason big enough to justify your place in this world. Is that simple.\n\nPositive or negative are just sides of the same coin, depending on yourself and your objectives either could be good or bad. Things aren't that simple when talking about \"good\" or \"bad\".",
      "created_utc": 1741706837.0,
      "score": 6
    },
    {
      "id": "mh7tg86",
      "body": "That’s depression talking for sure. Depression convinces us to think in very ego centric negative ways. I am the worst, it’s all my fault, my family would benefit if they didn’t have to waste money on me. All this sounds like clinical depression to me. I am no doctor so take from me what you will. Guilt and shame are results of depression often and can come from childhood abuse. I doubt you are the worst person I can think of, if that were true you wouldn’t be thinking this way. Depression is like ice that sends our minds and thought patterns into tunnel like repetitions that ruminate on the depression itself. It’s hard but positive self affirmations in the moments of depression can in time reconstruct how our minds and bodies react to depressive feelings. Do you have a therapist you can talk to?",
      "created_utc": 1741706730.0,
      "score": 7
    },
    {
      "id": "mh9u1dc",
      "body": "I'm so sorry to hear that, the bittersweet part about mine are that the good things usually end in the worst pain.",
      "created_utc": 1741727143.0,
      "score": 3
    },
    {
      "id": "mhcc0o2",
      "body": "Thank you🌸",
      "created_utc": 1741759161.0,
      "score": 1
    },
    {
      "id": "mi4uvwk",
      "body": "[removed]",
      "created_utc": 1742152064.0,
      "score": 1
    },
    {
      "id": "mi4vffb",
      "body": "[removed]",
      "created_utc": 1742152226.0,
      "score": 1
    },
    {
      "id": "mh7v35w",
      "body": "I nothing positive going for me at all. People don't like to hang out with me because I'm miserable all the time. My family who is forced to interact with me absolutely hate me, they have said to my face that they hate me and my mother cries because of everything I have done to myself. There is nowhere in the world where I am going to fit it or be welcome and no chance I am ever going to be happy with myself because every time I'm happy with myself it causes hurt to other people. At my very best I am someone most people are able to ignore but most of the time I am a burden to deal with and there's nothing I can do to change it, just who I am. I have tried to change. I am going to be miserable no matter what I do or who I am so there's no point sticking around.",
      "created_utc": 1741707205.0,
      "score": 8
    },
    {
      "id": "mh7vrl6",
      "body": "If I said what I have done then everyone in the thread would agree I should end my life. I do not need to be specific. I cannot undo what I have done and I cannot become a better person because this is just who I am.",
      "created_utc": 1741707405.0,
      "score": 2
    },
    {
      "id": "mh7u6bz",
      "body": "I've been in therapy for decades and they have given me every psychiatric treatment available. Nothing works because I'm just not supposed to be here.",
      "created_utc": 1741706939.0,
      "score": 15
    },
    {
      "id": "mh7x3gw",
      "body": "There are billions of people in this world, maybe the people that you had to deal with so far just isn't for you, that's why many choose to pursue their own paths regardless of their past.  There is never late to just leave somewhere else where you can be happy while avoiding those that aren't healthy for you. \n\nBut again, this world is pretty big, do you know how life is in Colombia, Japan, Belgium? You have your reasons but also try to think more logically about the options this life has to offer. Many times we feel limited by money or people that are close to us but that doesn't mean that our lives are automatically limited by them.\n\nI still don't know why you're a burden specifically but again, if you want to really pursue your own happiness, you won't be a burden to anyone, and fuck even if you end up as a burden for someone, why do you care so much if that person might not have done much for your life. Remember, its your life, you're the one that decides what to do with it, and sure, there are external our of our hands things that heavily affect them, but not forever and not for everything.\n\nPersonally, I decided on living a life of melancholy because of things that I didn't choose to get in this life but I got because life is unfair and I can't never be able to change that, BUT, there's still plenty of things in this world to do, experience, learn, that you're not seeing because of shitty people in your life.",
      "created_utc": 1741707791.0,
      "score": 2
    },
    {
      "id": "mh7xeli",
      "body": "Ok, if you think it's too much to share that's you, but don't assume things please, people here are not to judge but to help.\n\nBut, you think that people can't change then? why?",
      "created_utc": 1741707880.0,
      "score": 6
    },
    {
      "id": "mh7vn6o",
      "body": "I don’t think that’s true and there’s no way of knowing if we are meant to be here or not. \n\nI’m no doctor but it sounds to me like you’re holding onto something from the past to attempt to understand it better to make it yours and under your control. With that you may have found yourself in a loop of holding on. Does that seem applicable to you? That was something I had/have difficulty with",
      "created_utc": 1741707369.0,
      "score": 2
    }
  ]
}