{
  "id": "1drbw8d",
  "title": "Well… NSFW",
  "selftext": "I’ll always love you babygirl. This last cheating is my last straw. I’ve been in constant pain due to a spinal cord injury in 2008. It killed my social life and I haven’t been able to do much of anything since then. In 2011 I thought my time had come. I met my wife of 15 years and told myself to stick around for her; she’d be worth it. I truly believe she my soulmate and that’s the only reason this hurts so deeply, so completely. True despair comes when you thought you were most happy. Two years after we got married her gmom passed and she’s been off the rails since. Serial cheating isn’t enough of a description to put a label on what she’s done. She’s s*xually abused me numerous times. Physical, mental, emotionally has abused me more times than I can count. It’s an actual smalll miracle she hasn’t given either of us an STI or worse. \n\nI’m 6’2” 260 mostly muscle and NO ONE has believed my abuse. She’s 5,2 250. Every time I open up about it I’m laughed at and not believed. “You’re a marine (ret) how can anyone abuse you?!?!” \n\nI’ve not taken this lightly and this is NOT a cry for attention. Let my passing serve as an example of abuse can happen within ANY relationship. \n\nMom I pray I see you on the other side with grandmom. Dad, if you ever see this None of this is your fault. You’re the best dad I could ever wish for. None of this is your fault daddy. None. \n\nI’m 42 in constant physical pain and not having another surgery. \n\n(Spouse) I’m sorry I couldn’t satisfy your whims of threesomes etc. Who you are today is not the woman I married and sacrificed everything for. And yet…I still love\nYou. I always will. I wish I could’ve helped you more than I did. Goodbye. \n\nIn the end it doesn’t matter who did what anymore. Just that I can’t go on with this hurt. \n",
  "created_utc": 1719669778.0,
  "score": 1114,
  "num_comments": 101,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1drbw8d/well_nsfw/",
  "comments": [
    {
      "id": "lau5s82",
      "body": "That's SO heavy my guy. I'm so sorry",
      "created_utc": 1719671719.0,
      "score": 469
    },
    {
      "id": "lau8jbu",
      "body": "Please don’t hurt yourself. Life is completely unfair. Imm so sorry they didn’t believe you, especially with chronic pain it’s absolutely possible for you to be abused. Please run from her because she’s is awful. What she’s done is unforgivable and she doesn’t deserve you at all. Try to get therapy or counseling if you can. I care about you and hope the best for you.",
      "created_utc": 1719672717.0,
      "score": 205
    },
    {
      "id": "lauirfz",
      "body": "Hey, please take a moment to read this. Stay with us. I think I can understand what you're going through. Maybe I don't, because you've been through a lot we don't even know. \nLife can really be unfair and I know it, but please, give it another chance\nI know you're probably tired of giving chances to something that doesn't seem to be getting better, I'm in the same situation right now.\nThere's always someone who will try to help, you can start therapy, you can do anything that makes you feel better but please don't hurt yourself like that.\nI hope you get better, sending hugs",
      "created_utc": 1719676303.0,
      "score": 96
    },
    {
      "id": "lauxnsm",
      "body": "Oh God. Another casualty of improper pain/psychological management? I got tears, reading your post. I’m so sorry for your pain. I can relate. I’m waiting for my turn. I don’t think my partner can handle my health problems, anymore. Peace, my friend. 🌊",
      "created_utc": 1719681549.0,
      "score": 68
    },
    {
      "id": "lavojhj",
      "body": "This better be the suicide of your marriage, and not yourself.\n\nYou deserved better. We believe you. We believe the abuse is happening. We will not judge you \n\nWhere are you at, generally? Let us find you a mens shelter or help.",
      "created_utc": 1719691522.0,
      "score": 85
    },
    {
      "id": "laupnwm",
      "body": "Leave her, you don't have to do sum to yourself, please",
      "created_utc": 1719678700.0,
      "score": 78
    },
    {
      "id": "laumevo",
      "body": "Fuck.\n\nI don't know what to say, man. I'm so sorry\n\nEdit: Thank you for your service. I'm sorry it left you damaged. I hate the way we use men for war and throw them away. You have my respect and admiration, sir. o7",
      "created_utc": 1719677558.0,
      "score": 54
    },
    {
      "id": "lawp0gh",
      "body": "Anyone heard from him..? This seems legit and my heart hurts so bad",
      "created_utc": 1719705739.0,
      "score": 23
    },
    {
      "id": "lauswj9",
      "body": "Im so sorry man",
      "created_utc": 1719679858.0,
      "score": 20
    },
    {
      "id": "lautfc6",
      "body": "I'm so sorry, buddy. That sounds extremely rough.",
      "created_utc": 1719680042.0,
      "score": 15
    },
    {
      "id": "lav81z9",
      "body": "Some women just want to meet a strong kind marine, but some fucking ho who doesnt deserve hers is literally driving him into the ground. Bro.. don’t let her win. Give life another chance. Give a good women a chance. Don’t die for her bullshit. It’s not worth it.",
      "created_utc": 1719685421.0,
      "score": 11
    },
    {
      "id": "lavwwaz",
      "body": "I believe you. I BELIEVE YOU, OKAY? It's not your fault. You are not weak. You are incredibly strong for holding on for so long. I know dying is more tempting, trust me I really do. But would you perhaps put this off for later? There are still some things you could try. Escaping silently, you don't have to explain anything to anyone, all limits are arbitrary. Or even exposing her publicly, there is nothing to lose now. She put you into this mindset and there is nothing more she can take from you. Taking your life doesn't have to be the last time when you take control and the first time when you are free of her.",
      "created_utc": 1719694553.0,
      "score": 11
    },
    {
      "id": "law92b6",
      "body": "Abuse is not about who is stronger physically when it comes to a woman abusing a man, she is abusing you in every way. \n All the jokesters who want to make fun,  are weak  sad ppl,  they are the ones who are the evil as she is. They could never be the man you are to endure what you have still be the good guy. That is super human strength inside & out.  \n\nThe abuse is that she thinks she is entitled to beat your ass , and that you are a real man and will take it without using your strength to crush her. When you easily could. \n\nIt's that you are a good person and love the person who is hurting you.  she is hurting you bad yet you cannot return the evil deed because that is not who you are. \nShe knows this and used this to become even more evil. \n\nShe has no love for you . The woman she pretended to be for 2 years never existed. \nHer mother's passing was her excuse to show her true self. You should have ran then. But you did not. \nI get it. \n\nYou have major issues and major pain , I often think what it would be like to live in constant physical pain , as so many do. My mind cannot grasp it because it is horrifying. \n\nI have no magic words. No one does. I  wish there were. Believe that no normal kind person would ever want you to go though this. Or end yourself. \n\nMaybe that is it. \n\nYou are not old. \nYou are amazingly strong and beautiful inside and out. \nThere are many ppl out there to care for you and love you as you are. And who will be real from day one as a friend or a lover. I mean life is crazy and uncertain I cannot guarantee this. But I know it's worth going on to find happiness , real love, real friends and a real life.",
      "created_utc": 1719699185.0,
      "score": 9
    },
    {
      "id": "lavv4hd",
      "body": "Youre so strong for just sharing this, you're strong enough to get yourself out of this too. Please don't give up :(",
      "created_utc": 1719693920.0,
      "score": 9
    },
    {
      "id": "lav592o",
      "body": "Omg...this made me cry, I'm so sorry you had to endure all this. I wish there was a way anyone could help. You didn't deserve anything you've ever endured and went through. For whatever it's worth stranger, you were/are so brave, and I'm proud of you. Idk what else to say but you're valid for the pain you've felt, and she didn't deserve your absolute wonderful self.",
      "created_utc": 1719684348.0,
      "score": 7
    },
    {
      "id": "lav3uep",
      "body": "Hey man, I'm here to talk if you want",
      "created_utc": 1719683818.0,
      "score": 6
    },
    {
      "id": "lavd6uq",
      "body": "I’m in the same boat as you buddy, never gotten over it yet, she eventually left me and she took a part of me with her, I should hate her after all the cheating and abuse but I still miss her",
      "created_utc": 1719687348.0,
      "score": 6
    },
    {
      "id": "law50sg",
      "body": "Please don’t do it man you’re so strong I promise you can overcome this and move on. Life can be so beautiful for you, you just have to get through this chapter. I believe in your brother.",
      "created_utc": 1719697592.0,
      "score": 3
    },
    {
      "id": "lawnkj3",
      "body": "“In the end it doesn’t matter who did what anymore, just that I can’t go on with this hurt” \nthis is the saddest and most relatable thing I’ve ever heard, I feel you heavy on this one😔",
      "created_utc": 1719705126.0,
      "score": 3
    },
    {
      "id": "lax9peh",
      "body": "Bro I believe you. You are stronger than you think. I hope you leave her instead of leaving this life",
      "created_utc": 1719714822.0,
      "score": 3
    },
    {
      "id": "laz8cbn",
      "body": "No one believes us. The ultimate enemy is the inner you pushing you to do the right thing despite people doing the wrong things to you. FIGHT. FIGHT MORE. DONT STOP.",
      "created_utc": 1719756017.0,
      "score": 3
    },
    {
      "id": "lbfcgx0",
      "body": "Damn it hurts this was 3 days ago. You're probably long gone now",
      "created_utc": 1720005385.0,
      "score": 3
    },
    {
      "id": "law4lw2",
      "body": "New acc too, damn. Hope you didn't go through with it or survived at least. I'm sorry this happened to you",
      "created_utc": 1719697433.0,
      "score": 2
    },
    {
      "id": "law9gso",
      "body": "So sorry that this happened to you, man. 🫂😔",
      "created_utc": 1719699351.0,
      "score": 2
    },
    {
      "id": "laxaj0g",
      "body": "(Anonymous teenager here)\n\nI'm genuinely so sorry and I send so many condolences to you, no one deserves to go through like this...\n\nThis post is heartbreaking in many ways and I feel really sad. We are a community that is always here doe you, please don't hurt yourself.",
      "created_utc": 1719715197.0,
      "score": 2
    },
    {
      "id": "lay8fi7",
      "body": "Have you tried seeing a therapist? You seem like the kind of person that could benefit from talking about it.",
      "created_utc": 1719734676.0,
      "score": 2
    },
    {
      "id": "layu597",
      "body": "I was in an abusive marriage before and almost committed. If I had I wouldn’t have found the love of my life and I wouldn’t have discovered more about myself after I gave life an another chance. There’s another side that’s better than the one you’re on. It’s hard to get there, but you can.\n\nAnd even then, it will be a challenge and a big change. But then, you won’t be abused anymore. I hope you’re still here.",
      "created_utc": 1719749399.0,
      "score": 2
    },
    {
      "id": "lazgvij",
      "body": "Sounds like NPD to me. At least a huge lack of empathy no matter what it is.\nMy wife has aspd and I got abused so often and brutal, I feel like rotten from the inside.\nMy problem is and always was, low self esteem.\nBut even after getting so much better, she teared me down into her hell again.\n\nIt's like drinking alcohol while hoping to not getting any effects of it.\n\nThis just doesn't work, but moving on alone feels really like dying.\nThe cheating, the lying, all the betrayel, gaslighting, blame shifting and oh hell so much more I can't even remember now, it's insanity.\n\nBro, fuck this, really. You deserve better. You really do.\nIf you wanna talk, I'll be happy listen to you.\nAnd I mean it : )",
      "created_utc": 1719759267.0,
      "score": 2
    },
    {
      "id": "lbgwjvq",
      "body": "I know you're in love, but you have to love yourself first, if someone can't respect you then they don't deserve you. Your parents just want to spend time with you, don't deprive them. We don't mind if you want attention it's good you're venting this somewhere. You've been the victim of abuse. You need to reach out to support in your community. Or just keep posting online and talking here and there.\nIs there nothing that can spark joy for you? This is a long shot but I enjoy killtony , there's people there sharing their lives and laughing about it. ",
      "created_utc": 1720026346.0,
      "score": 2
    },
    {
      "id": "lbk2g0b",
      "body": "i don’t know if you’ll see this but i bought a basil plant today and for the first time in my life i wanted to live, idk why i don’t know if it will last, but i know that for maybe ten minutes today i was so happy that i just sat in the sun and rested. my dad is a.vet and what he’s shared has broken my heart but please please he’s seeing a VA counselor and going to support groups and i love you more than i can say bc you are just like my dad, and i want you to be happy and healthy and whole, and i know it doesn’t come just like that and i know., personally, how bad everything can get, but please talk to me, or a friend,’or someone. bc they love you, more than you know and more than my dad knows, and all i want to do is show him my basil plant and make him pesto, and i love you so much that i want  to make you pesto too",
      "created_utc": 1720070937.0,
      "score": 2
    },
    {
      "id": "lavi6e3",
      "body": "Don't hurt yourself over such a ...., don't let her win, you are stronger than this, divorce her and live your life away from such a snake.",
      "created_utc": 1719689208.0,
      "score": 2
    },
    {
      "id": "lavuzs5",
      "body": "Are you single? I’d like to be with someone who wouldn’t cheat on me. I’m 5’7, blonde, 3D artist. Also have persistent suicidal thoughts so maybe we can talk about that. Never hit on anyone on Reddit but here I go.",
      "created_utc": 1719693874.0,
      "score": 3
    },
    {
      "id": "law5m0i",
      "body": "Man I’m really sorry bro! You deserve better than that! I hope you don’t hurt yourself, it’s never the answer.",
      "created_utc": 1719697820.0,
      "score": 1
    },
    {
      "id": "law7hmv",
      "body": "Please my boy, cut contact with her damn. Do whatever it takes, just get her out of your life",
      "created_utc": 1719698556.0,
      "score": 1
    },
    {
      "id": "lawjxdy",
      "body": "I understand you. My brother could have written this, he is no longer with us & the whole family has never been the same 💔 I'm not sure if it was his constant back pain or his nasty cheating wife that pushed him over the edge. I can understand that the constant physical pain makes living difficult, but what I can't understand is killing oneself over a cheating partner. It is called a Trauma Bond, I know all about it. Warm Hugs to you, Reddit friend 🫂 Your partner is a bitch & I hope you can get help with your physical pain 🤗",
      "created_utc": 1719703598.0,
      "score": 1
    },
    {
      "id": "lawxhxq",
      "body": "Are you still with us?",
      "created_utc": 1719709379.0,
      "score": 1
    },
    {
      "id": "laxcavh",
      "body": "I am really sorry.",
      "created_utc": 1719715977.0,
      "score": 1
    },
    {
      "id": "lay6f4e",
      "body": "I'm really sorry\nYou deserve better",
      "created_utc": 1719733237.0,
      "score": 1
    },
    {
      "id": "lays1ku",
      "body": "<<<HUG>>> I've been there to.  Your not alone.",
      "created_utc": 1719748231.0,
      "score": 1
    },
    {
      "id": "lb12jir",
      "body": "I believe you brother . Don't give up , you'll return strong.\nI don't say this just because , it's because I understand the pain you've felt.",
      "created_utc": 1719779591.0,
      "score": 1
    },
    {
      "id": "lb8nd1e",
      "body": "omg I hope you're okay right now sir...there is always hope, even when things feel hopeless. It's such a horrible and crippling feeling with despair. You are loved like so many others on this earth, what your spouse did to you she 100% would've done to someone else like all disgusting cheaters do. \n\n  \nI'm so sorry for all those disgusting abuse apologists dismissing what happened to you... please be safe 🫂 ❤️‍🩹",
      "created_utc": 1719895219.0,
      "score": 1
    },
    {
      "id": "lb96zkt",
      "body": "I really hope you didn't do it, but I fear the worst.  If you are still around and need to talk it out lmk",
      "created_utc": 1719907714.0,
      "score": 1
    },
    {
      "id": "le38i7z",
      "body": "It’s been like 21 days now. I’m praying ole dude is ok. My heart is so heavy from this. I keep checking this subreddit , hoping beyond everything that he’s ok and getting help.",
      "created_utc": 1721487508.0,
      "score": 1
    },
    {
      "id": "lax9lr3",
      "body": "Give it time. You are better off without her and once you take some time to heal you will realize that and it won’t hurt as bad. I just went thru something similar so i can tell you from experience that it DOES get better.",
      "created_utc": 1719714775.0,
      "score": 1
    },
    {
      "id": "laxm2l0",
      "body": "First off, thank you for your service.\n\nSecond, don't ever waste your time or life to be harmed by others even your wife.\n\nI ask if you can get legal counsel to help you with this.\n\nThird, ask law enforcement to show proof and conceal your identity for privacy (this is a sensitive topic hence legal counsel is there to help interpret it)\n\nLastly, seek professional help and guidance to rehabilitation.\n\nThis is something mixed up with your Service time (e.g. PTSD due to war shock, etc.) and causing you to spiral down.\n\nI hope you recover and pray for your safety as well.",
      "created_utc": 1719720731.0,
      "score": 1
    },
    {
      "id": "laxdt78",
      "body": "This does seem to be very heavily affecting you and I really do hope you get the help you need to feel happy again. You still have many years ahead of you, and there really is hope. I know it may seem hard to believe, but you can find happiness, and I really hope your spouse soon understands that her actions are deeply affecting you. \nOnce again, I pray for you my friend, and i hope only the best for you",
      "created_utc": 1719716677.0,
      "score": 0
    },
    {
      "id": "lb0lrlm",
      "body": "Hello mommey",
      "created_utc": 1719773610.0,
      "score": 0
    },
    {
      "id": "lb0m5r5",
      "body": "Hello mommey! Schnippel! 👏😅",
      "created_utc": 1719773749.0,
      "score": 0
    },
    {
      "id": "lbz4zc4",
      "body": "5’2 and 250",
      "created_utc": 1720313865.0,
      "score": 0
    },
    {
      "id": "lav96ox",
      "body": "I’m sorry but she’s 5’2” and 250lbs? GOO! 👀🤣",
      "created_utc": 1719685854.0,
      "score": -34
    },
    {
      "id": "laug4gc",
      "body": "[removed]",
      "created_utc": 1719675397.0,
      "score": -57
    },
    {
      "id": "laukzjl",
      "body": "You care too much. Just try caring about something more superficial, try your best to see the value in it and at the same time deprive all value that you’ve seen in your wife and you’ll be more than fine. Take away the meaning in what you thought was deep might make you think that all of it wasn’t actually that deep, that’s my armchair psychologist take.",
      "created_utc": 1719677064.0,
      "score": -37
    },
    {
      "id": "lb0msdn",
      "body": "Schinombel! €_#",
      "created_utc": 1719773969.0,
      "score": -20
    },
    {
      "id": "lb0mowu",
      "body": "[removed]",
      "created_utc": 1719773936.0,
      "score": -21
    },
    {
      "id": "lb0j096",
      "body": "Wdym bro is dead",
      "created_utc": 1719772676.0,
      "score": -16
    },
    {
      "id": "lazhi4f",
      "body": "Aww that's very kind ❤️",
      "created_utc": 1719759500.0,
      "score": 4
    },
    {
      "id": "lavp9bx",
      "body": "I miss her too. Almost 2 and half years no contact. Well that's not true I contact her once and she told me to never do it again. 9 months later I did and she was furious and told me never to fo it again and I haven't since. She's in her world and I'm in mine I can't get her back and now I'm suffer everyday with a woman who torments me and reminds me everyday of my mistakes",
      "created_utc": 1719691790.0,
      "score": 4
    },
    {
      "id": "lavw3h6",
      "body": "Sorry I asked if you were single, stupid question 🫠",
      "created_utc": 1719694266.0,
      "score": 2
    },
    {
      "id": "lb0lvaa",
      "body": "👏 Schnippel!",
      "created_utc": 1719773647.0,
      "score": 0
    },
    {
      "id": "lb0m8t6",
      "body": "Good Boy Momma! 😘🥰😍",
      "created_utc": 1719773779.0,
      "score": 1
    },
    {
      "id": "lavnb9a",
      "body": "Wtf is wrong with you",
      "created_utc": 1719691067.0,
      "score": 18
    },
    {
      "id": "laui6e6",
      "body": "Fuck off",
      "created_utc": 1719676106.0,
      "score": 25
    },
    {
      "id": "lav5mfx",
      "body": "men will continue to dominate suicide rates as long as the mindset is alive",
      "created_utc": 1719684489.0,
      "score": 5
    },
    {
      "id": "lay251v",
      "body": "This is legitimately peak brainrot; holy shit",
      "created_utc": 1719730250.0,
      "score": 6
    },
    {
      "id": "lbg2ej5",
      "body": "What the fuck?",
      "created_utc": 1720016401.0,
      "score": 4
    },
    {
      "id": "lbjkdfr",
      "body": "haha I hope this guy would able to read your post , it make me laugh 😅. What is a 3D artist Ma’am?",
      "created_utc": 1720061784.0,
      "score": 0
    },
    {
      "id": "lb0mbei",
      "body": "Zipzerippel!",
      "created_utc": 1719773804.0,
      "score": 1
    },
    {
      "id": "lb11vmp",
      "body": "I think this generation is kinda f’d.",
      "created_utc": 1719779359.0,
      "score": 2
    },
    {
      "id": "layrt3k",
      "body": "What can I say, I legitimately don’t get why he’s even in that situation, almost unreal.",
      "created_utc": 1719748096.0,
      "score": -1
    },
    {
      "id": "lcttkkt",
      "body": "I create 3D designs and animation. 3D is used to make video games, movies, etc. Yeah I hope that guy is okay, I haven’t seen him comment anything else",
      "created_utc": 1720788791.0,
      "score": 2
    },
    {
      "id": "lb0mcqx",
      "body": "Hola moma!",
      "created_utc": 1719773818.0,
      "score": 1
    },
    {
      "id": "lbpxmni",
      "body": "They are fr tho. Shits legit sad.",
      "created_utc": 1720171408.0,
      "score": 2
    },
    {
      "id": "lb0meju",
      "body": "Schnippel🫥🥱😶‍🌫️",
      "created_utc": 1719773835.0,
      "score": 1
    }
  ]
}