{
  "id": "1eucbq5",
  "title": "I am paralyzed. My fiance left me. I want to die.",
  "selftext": "I(28M) proposed to my fianceé(25F) a 3 months ago. She accepted my proposal and we had our plans. Last month, I was involved in a car crash while going to work. I broke my neck as a result of the accident and I'm now a quadriplegic. I'll never be able to walk again and I have little mobility on my body. I lost independence and can't do many things on my own. My fianceé took care of me at first for a few days, but she started becoming frustrated at taking care of me and we got into arguments. She said she didn't sign up to raise a crippled man, and that she needed a real man she could marry. She left me, and started dating another guy. I'm now being taken care of by my mother and I feel devastated my fianceé left me. When I proposed her, we promised each other that we'd stay together no matter what, but she broke her promise. I understand why she left me, I'm just a burden and a useless crippled that can't do anything on his own. I can't work for myself or do anything on my own. I understand why someone wouldn't want to take care of someone who lacks independence. But I'm heartbroken still. I don't think I will ever find someone to marry since I doubt there will be a romantic partner who wants to take care of a crippled like me. I just want to die already, I'm living on a useless body. My mother doesn't want me to die, but I can't take this suffering anymore.",
  "created_utc": 1723880848.0,
  "score": 1632,
  "num_comments": 277,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1eucbq5/i_am_paralyzed_my_fiance_left_me_i_want_to_die/",
  "comments": [
    {
      "id": "lijw260",
      "body": "My uncle was quadriplegic after a dive into an empty pool. That being said, he found love after his accident and was married until it was his time. I can only imagine how you are feeling right now but Keep your head up.",
      "created_utc": 1723895680.0,
      "score": 536
    },
    {
      "id": "lijhmcn",
      "body": "this was really sad to read, i really dont know what to say im sorry. i hope you can overcome your feelings for her in some way, you deserved so much better",
      "created_utc": 1723886736.0,
      "score": 300
    },
    {
      "id": "lijm2r0",
      "body": "She was never for you in the first place",
      "created_utc": 1723889805.0,
      "score": 873
    },
    {
      "id": "lijzvdb",
      "body": "I'm so fucking sorry. My ex didn't even give me the option when he got paralyzed he broke up with me and ended himself there's people out there that will accept you as you are and love you whole heartily as I have aswell but it's hard to find them with so much toxicity in the world",
      "created_utc": 1723897529.0,
      "score": 73
    },
    {
      "id": "lijbszz",
      "body": "Fuck, that's beyond tough. You can still find someone though. I know of people in similar conditions that still found someone, besides the strength to live through this. Please don't despair. Not all is lost, even though it might seem so.",
      "created_utc": 1723882740.0,
      "score": 458
    },
    {
      "id": "lijef8o",
      "body": "There are lots of disabled people who have found partners; and yes, also disabled people who can't use their body at all.\n\nYou are going through a really bad phase right now and I get how this must feel devastating, as your life has completely changed.\n\nNow it's on you to decide if you are only your body or if you are a great person, that is lovable and worth to find joy and love in their life.\n\nSure, being disabled can feel like a burden; but that's because society is an asshole to make us think that.\n\nTry to not give in to the thoughts and depression that stir you into a downward spiral. You haven't even tried to come to terms with your new situation. You now have a chance to let your character shine. \nIs it frustrating to be limited? Hell, yes. Is it the end of the world? That's on you to decide. It definitely doesn't have to be.\n\nThere's a big disabled/crip community out there who does a lot of activism work. \nGet in touch with them, learn about their stories, meet people who have been through similar shit.\nWatch \"The Intouchables\" and \"Touch Me Not\".  \nBecome an activist yourself. \nShow everyone, especially yourself, that your body is not what defines you.",
      "created_utc": 1723884533.0,
      "score": 100
    },
    {
      "id": "likhw09",
      "body": "Some people are beyond cruel. Hold on, you still get lots of chances in life. Your mother is an angel!",
      "created_utc": 1723905017.0,
      "score": 23
    },
    {
      "id": "lijpfkx",
      "body": "Op I somewhat know how you feel. My fiancé dumped me when I went blind and started suffering from migraines that left me useless. I know that burden feeling and intrusive thoughts on living. I too had to move in to my moms and I feel so guilty because she should be retired and living it up. Not worried about me. But our moms love us and so much can change in a few months- a year. This is all new to you so it’s gotta be extra tough right now. You’re mourning the lost of your independence, mobility, and a very important relationship. That’s a lot. Have you tried therapy?",
      "created_utc": 1723891974.0,
      "score": 42
    },
    {
      "id": "likhs11",
      "body": "That's absolutely terrible. And the premise of one of the things marriage is about. In sickness and in health. I know your heart may be broken at this point, but you're blessed as well, to not have such a selfish person in your life. She showed her true colors real quick.",
      "created_utc": 1723904976.0,
      "score": 15
    },
    {
      "id": "likokk1",
      "body": "If she said those things, she was in the wrong. It was unnecessary to put you down even further. She wasn't wrong to leave, but she didn't have to be rude about it. Clearly its a devastating change of events for you. Hopefully you can recover to a certain degree.\n\nI totally understand why someone would leave. The life she pictured didn't involve being a caregiver. You MAY find someone that is willing to take care of you. I know there are people out their like that, but it may be hard finding them.",
      "created_utc": 1723907412.0,
      "score": 15
    },
    {
      "id": "lijg9ms",
      "body": "Marriage is for better or for worse, in sickness and in health. If she said yes then walked away as soon as you had the accident she probably would have never managed to stick with her vows. I’m so sorry about what happened to you - I follow a few influencers who manage to travel the world and have their own family while on a wheelchair which you could start following and maybe even contacting for advice.",
      "created_utc": 1723885790.0,
      "score": 49
    },
    {
      "id": "lijyfli",
      "body": "You’re only a month into injury. A lot can change in the next year or two. Look up quad’s with YouTube channels and see what they can do. Some things you can’t do now, you could in 6 months to a year. Healing isn’t linear, mental or physical. She was shallow for leaving you, but one day you’ll find someone who doesn’t care about anything other than having you in their life!!",
      "created_utc": 1723896848.0,
      "score": 19
    },
    {
      "id": "liksj5w",
      "body": "Have you thought about trying to reach out to people with similar conditions? You aren’t alone.\n\nAlso, you may find some solace or hope in the ideology of transhumanism, someday we will be able to undo what has happened to you, and will be able to give you normal functioning with advanced prosthesis’ etc.",
      "created_utc": 1723908774.0,
      "score": 9
    },
    {
      "id": "lijtrtr",
      "body": "Through all that BS I hope you atleast get a fat settlement stay strong and do your best",
      "created_utc": 1723894476.0,
      "score": 17
    },
    {
      "id": "lijimnb",
      "body": "I suggest checking out Shane and Hannah Burcaw aka squirmy and grubs lol. You can still find love, trust me. You deserve someone who will love you truly and no matter what. There are people out there who don’t care about looks or abilities or whatever just personality. Get into therapy and just be you, you’ll fine someone just don’t let it get to you while you wait. You got this, much love 💗",
      "created_utc": 1723887456.0,
      "score": 21
    },
    {
      "id": "lijld41",
      "body": "I hope you're able to find happiness, brother.",
      "created_utc": 1723889331.0,
      "score": 6
    },
    {
      "id": "likjvz5",
      "body": "[removed]",
      "created_utc": 1723905741.0,
      "score": 25
    },
    {
      "id": "lik24m6",
      "body": "Wow for a new quad you sure do have a lot of dexterity. One month ago you broke your neck?",
      "created_utc": 1723898580.0,
      "score": 13
    },
    {
      "id": "likk24x",
      "body": "I would stay with my partner even if he became crippled. She just doesn’t have the grit or is not caring enough",
      "created_utc": 1723905802.0,
      "score": 13
    },
    {
      "id": "likwlto",
      "body": "holy shit man. i’m so sorry… she was not for you and as hard and as horrible as it is, be happy she showed her true colours. you absolutely deserve love and you ARE a real man. you deserve somebody who loves you through sickness & health. there are so many women myself included who do not care if you have health issues like you do. you are so so so worthy. sending you so much love & healing. you ARE worth so much. i hope you hang in there 🥺🩷",
      "created_utc": 1723910183.0,
      "score": 5
    },
    {
      "id": "limdiyo",
      "body": "My now husband (then fiance) became severly ill. For two years it was touch and go, and we had no idea what to expect. He was bedridden most days and I spent maybe 2 hours a night sleeping. \n\nI still married that man and while I thought \"This sucks\" I never once thought \"He sucks\" and NEVER thought of leaving because of it. It's been 7 yesrs since then and even if he was still bedridden, I'd still lay next to that lan every night and fall asleep to the sounds of machines and be thankful for it \n\nYour ex did you a favor and took the trash out. Now we gotta work on you. Time to get some therapy, and into a group setting for those who can help you come to terms with your new life.",
      "created_utc": 1723928742.0,
      "score": 5
    },
    {
      "id": "lilzii4",
      "body": "How was OP able to type out this post?",
      "created_utc": 1723923801.0,
      "score": 6
    },
    {
      "id": "lil3cjy",
      "body": "I'm so fucking sorry this happened to you. Idk I know this isn't like the help you're looking for necessarily, but you should watch the movie Adam (2020) w/ Aaron Paul. It's free on Tubi. It might make you feel seen, and seeing ourselves and our stories reflected in media can sometimes offer respite. Even if it's temporary. \n\nYou're still a valuable person who has worth and deserves understanding and patience.",
      "created_utc": 1723912532.0,
      "score": 3
    },
    {
      "id": "lilkb6m",
      "body": "Ableism is absolutely horrific. I'm so sorry your fiancé did this to you. It shows how little disabled people are valued in this society. We are seen  as burdens when we are not.",
      "created_utc": 1723918375.0,
      "score": 3
    },
    {
      "id": "likp2rt",
      "body": "How are you writing this message?",
      "created_utc": 1723907592.0,
      "score": 8
    },
    {
      "id": "lijbjj1",
      "body": "[removed]",
      "created_utc": 1723882562.0,
      "score": 8
    },
    {
      "id": "lijizmo",
      "body": "I am really sorry.  The best I can come up with is that you found out what kind of person she was before you married her; it would have been worse to find out after you were married.  But I know that' no comfort.  I wish I had something good to say.",
      "created_utc": 1723887712.0,
      "score": 3
    },
    {
      "id": "lijky5r",
      "body": "Even though that’s fucking tough and in fighting to want to live as well. That woman was not your soulmate! If she was she wouldn’t have left. Want to die because you want to not because that woman made you feel like sht! This is your new journey and if you can find the strength to push forward you will find someone who loves and cares for you the way you need to be . You dodged a bullet . Love knows no boundaries. You think that guy is lucky ? No YOUR LUCKY . even if you only have your mom that the best person to have. I hope you can find at least\n One reason to keep going . IM HERE EVEN THO I WANT TO DIE",
      "created_utc": 1723889054.0,
      "score": 2
    },
    {
      "id": "lijra5l",
      "body": "I am so sorry for you man, that’s awful",
      "created_utc": 1723893083.0,
      "score": 2
    },
    {
      "id": "likg032",
      "body": "Bro please don't do it.\nShe should have supported you",
      "created_utc": 1723904314.0,
      "score": 2
    },
    {
      "id": "likic83",
      "body": "I'm so sorry you're having to go through this, I hope things will somehow get better.",
      "created_utc": 1723905183.0,
      "score": 2
    },
    {
      "id": "likuxbb",
      "body": "This is soo sad it breaks my heart.",
      "created_utc": 1723909602.0,
      "score": 2
    },
    {
      "id": "lilbykw",
      "body": "It takes the right person, but they’re absolutely out there man. I can promise you that.",
      "created_utc": 1723915511.0,
      "score": 2
    },
    {
      "id": "lim320t",
      "body": "I am glad she is gone now, you know her true worth. Your life still has worth, don’t give up. There is someone out there that needs you. Please don’t let them suffer too. It will be hard and long but worth it when you find them!",
      "created_utc": 1723925060.0,
      "score": 2
    },
    {
      "id": "limchic",
      "body": "Hang in there. This is all very new for you. Things CAN improve. Please try to find a qualified therapist to help you work through these changes, please don’t give up.",
      "created_utc": 1723928371.0,
      "score": 2
    },
    {
      "id": "limhsuh",
      "body": "I came in after a long while away hesitant about posting my experience…past, recent and now. Two minutes and I read your post. I want to meet you in person and give you the biggest hug right now. I’m in tears. My thing is i been chronically ill for 24 years and as I aged it got worse, the past 7-8 months I been bedridden. 3.5 years ago my best friend when we were teenager walked back into my life and we decided to be together as a couple. I told him all about my severe condition and that he should test it first, see me for who I am. I couldn’t hold down a job, broke. He said no, he loves me always. We built a home together, things were good. For about a year and the rest—he couldn’t stand me. I tried to leave but he kept insisting no: but he’s been miserable with me. And blamed me. And I kept blaming myself. Until finally exactly one month tomorrow was when I was subtly served out of the home where we have pets. Our puppy, two cats. He said he’s sorry that I have this illness, that it robbed him of his life’s partner and if I don’t heal there’s no way we could be together. That he wanted a normal life and the fact that I don’t understand that is unfair. I never once stopped him from living life freely. But he kept blaming me. I had zero energy so when I gathered some I’d walk with my cane onto the street. I didn’t even have the energy to pull it off. Then after I left just to clear my head for two days, he was like a different person. Cruel and mean. He said to my mother that no one will ever want me. Oh well, I’m not upset about that. I’m just so exhausted that I had nowhere to go and still need to “not argue” because he’s helped me enough. Financially anyway and I’m grateful. But I’m shattered. Then I found out myself that he had another woman all along. Three years. I’m not jealous. I’m just lost. Years of my life and little dignity. I don’t want to go on. I miss my pup but I can’t take care of her. My cats are with me and one is really ill. I thought oh just cuz I’m disabled doesn’t mean someone isn’t gonna break my heart. But the trust? The friendship? I almost left once for someone I deeply care for and love…I made the wrong choice. Because i thought he was my friend and wouldn’t ghost me. Tho the signs were clear. I didn’t see. And now I’m just idk what I am. I can’t love myself. But did this whole thing opened my eyes to the cruelty? Our definition of love I tell you—they aren’t the ones. So you know, I can’t say much except I wanna end it too \nI wish I could sit and talk or not talk with you. And be your companion. The depths of how we love I think we should not throw it away. It’s really special tho not to others who are superficial. This flesh we are in, it’s what happens to us but we are in here. Yes? I see you. I send you the love that is as deep that I can feel your pain. It’s exhausting and I want out too. But look I see you and I see love that is so precious ♥️ and I wish someone sees me too",
      "created_utc": 1723930318.0,
      "score": 2
    },
    {
      "id": "limkh8g",
      "body": "I know you in a really bad place right now and me suggesting a book probably makes you feel like telling me to fuck off but hear me out. This book is called   Waking I just started it last night. It’s about a man Matthew Sanford who at 13 from a car accident broke his neck and pretty much everything and paralysed from chest down. It’s his story and how yoga really helped him. He even teaches yoga but is permanently in a chair. He has a website called Mind Body Solutions. I hope this might help a little.",
      "created_utc": 1723931312.0,
      "score": 2
    },
    {
      "id": "lin5us5",
      "body": "Never lose hope, you re still a good man",
      "created_utc": 1723939685.0,
      "score": 2
    },
    {
      "id": "linaqti",
      "body": "I am so sorry this has happened to you OP. I would like to send you some love",
      "created_utc": 1723941669.0,
      "score": 2
    },
    {
      "id": "linigx8",
      "body": "This is a tragedy. I am sorry she left you when you needed her the most. Along with your mother, do you have a support system, other relatives and friends that are there for you?",
      "created_utc": 1723944875.0,
      "score": 2
    },
    {
      "id": "linmxi6",
      "body": "Just because you are disabled does not mean you are useless, and it's way too soon to make longterm predictions about your life and recovery. Your ex is a piece of shit, and trust me there are loads of people who don't see disability as a barrier to love, all this shows is that she probably would dump you if any hardship comes up. You are not useless, unworthy, or unloveable. Feeling like it when you are this low is valid, but it will not always be like this. Watching fellow people with disabilities on youtube will probably help you. I can recommend a few.",
      "created_utc": 1723946740.0,
      "score": 2
    },
    {
      "id": "lio2v3g",
      "body": "I’m so terribly sorry. Please if you’re not going to therapy, consider it. My partner’s sister had a diving accident and became paraplegic, but her long time friend stepped in and would visit her all the time in the hospital, and they have been happily married for close to 10 years now. There is definitely someone out there for you. Wishing you the best.",
      "created_utc": 1723953917.0,
      "score": 2
    },
    {
      "id": "lio8m5v",
      "body": "That’s so terrible. If she truly loved u she wouldn’t leave u like that. Someone out there will love u for who u are, u just have to weed out the bad ones first. She never really loved u in the first place, because I know if I loved someone and they got into an accident like that, I would be honored to take care of them.",
      "created_utc": 1723956821.0,
      "score": 2
    },
    {
      "id": "lioimlw",
      "body": "Good men for good women relax",
      "created_utc": 1723962666.0,
      "score": 2
    },
    {
      "id": "lipr53o",
      "body": "Better you find out now than 10 years later. You are worthy of love and you will be loved. Don't let that bitch ruin it for you. You're going to adapt and change & one say the sun will shine again & on that day you'll be filled with all the love you're deserving of. I'm so sorry to hear this has happened to you. My heart goes out to you. ❤️",
      "created_utc": 1723988519.0,
      "score": 2
    },
    {
      "id": "lijcydq",
      "body": "Even if you loved her let’s her go it’s shit behavior from her side. It’s not you fault friend you can still live and have life. I don’t know if it helps but you are not the only one who got crippled, I got crippled to by doctors and can’t get a diagnosis. We must be strong man no choice.",
      "created_utc": 1723883522.0,
      "score": 2
    },
    {
      "id": "liji6xi",
      "body": "If I was paralyzed I think I'd go live my retirement life in Pattaya. Look it up, good luck my friend.",
      "created_utc": 1723887141.0,
      "score": 1
    },
    {
      "id": "lik58cb",
      "body": "I’m so sorry this is happening to you",
      "created_utc": 1723899948.0,
      "score": 1
    },
    {
      "id": "lilhzor",
      "body": "The most oractical thing would be to finde q praöaysed woman, she and you habe the same struggle",
      "created_utc": 1723917573.0,
      "score": 1
    },
    {
      "id": "liliseu",
      "body": "I'm so sorry. It will get better. It has to. Please stick around to find that out for yourself. ❤️",
      "created_utc": 1723917850.0,
      "score": 1
    },
    {
      "id": "liliwny",
      "body": "You are allowed to grieve, and you should as you're experiencing a great loss.\n\nI am also disabled and I still mourn. I never wanted this to happen to me and things could have been so different. These are normal feelings.\n\nMy mother and father met and quickly after my mom was diagnosed with cancer. Over the years her condition deteriorated and she couldn't get out of bed, wash herself, or do anything. Still my father took care of her and assured her that she was loved. He stayed with her through thick and thin until she passed. There are good people who can see through disability and you are not doomed to loneliness.\n\nYou should check out r/disabled to see you are not alone. People share their hopes, dreams, and struggles here.\n\nMuch love to you.",
      "created_utc": 1723917891.0,
      "score": 1
    },
    {
      "id": "lillhh3",
      "body": "My mom's paralyzed too(although she just lost mobility in her legs) after she gave birth to my youngest sister back in 2011-2012. I'll admit life has been very tough for my entire fam, but that's the nature of life, it sucks sometimes. But what helps is the people you care about sticking besides you, so fuck your fiance dude. My dad stuck with my mom working two jobs and has remained loyally married to her for over 12 years since the accident and still loves her very much. I hope that you'll find love like this too.",
      "created_utc": 1723918788.0,
      "score": 1
    },
    {
      "id": "lilmc6u",
      "body": "I know you loved your fiance, but if she switched up on you like that in such a short time, then she's for the streets. If yall promised to stay together no matter what, and she did the exact opposite, then she might not have meant it as much as you did. In sickness and I'm health is a promise, and it's really easy to make that promise when you're not faced with a life-changing event like this. \n\nI've seen several couples online where one spouse is a full-time caretaker for the other, and they seem very happy and content and in love. People like that do exist. When I was little, my mom was very sick sometimes, like debilitatingly sick, and my dad always took care of her. Always. Until the minute she died. So it's definitely possible to find the right person for you. \n\nEven though Ive never been in your exact position, I've wanted to end it all, too, when the people I loved and committed myself to would break the promises they made to me. And the feelings do suck... im not sure what else to say, but I wish nothing but the best for you, even though things may not seem that way rn. 💛\n\nEdit: And if you're able, you could try seeing a therapist to help you process what you're going through.",
      "created_utc": 1723919097.0,
      "score": 1
    },
    {
      "id": "lilnjlk",
      "body": "Hey don’t say that. You will find your person. Just continue being you please. She wasn’t meant for u in the first place if it was so easy for her to leave.",
      "created_utc": 1723919518.0,
      "score": 1
    },
    {
      "id": "lilpw6v",
      "body": "Hello brother, I hear you",
      "created_utc": 1723920338.0,
      "score": 1
    },
    {
      "id": "lim2q4v",
      "body": "your fiancée is a bad person ... sending you hugs, hope you will heal from this situation someday ",
      "created_utc": 1723924941.0,
      "score": 1
    },
    {
      "id": "lim337x",
      "body": "If she left you that fast, there was barely any real love in the first place, you should move on, my friend.",
      "created_utc": 1723925071.0,
      "score": 1
    },
    {
      "id": "lim60nh",
      "body": "I’m really sorry bro. Maybe you’ll find joy in things in life other than marriage. I struggle with that. But it’s possible.\nYour mom loves you. \nLife isn’t over. \nYou still have yourself.",
      "created_utc": 1723926103.0,
      "score": 1
    },
    {
      "id": "lim83vu",
      "body": "Im sorry to hear that😞 \nI tend to try and find the best out of bad situations,  and in this instance she showed her true color's,  therefore at least you dont have to waste anymore of your life with her.. Maybe by a maricle of lots of therapy you will learn to walk again, bounce back, and be better then ever.. that will be the ultimate F U to her!  U got this OP 💕",
      "created_utc": 1723926831.0,
      "score": 1
    },
    {
      "id": "limgf75",
      "body": "Theres so many couples ive seen that found love after a debilitating accident. Literally 7billion ish ppl and not a single one is going to be interested? Cmon now! Single moms have found marriage and partners, cancer survivors, etc. its a matter of time and not be so dwelled up in those dark thoughts. Right now focus on recovering.",
      "created_utc": 1723929806.0,
      "score": 1
    },
    {
      "id": "limjrz0",
      "body": "What I read is so horrible that I want to die as well (I always wanted to anyway ahah but still) I have read several such stories, I saw a young man on a wheelchair today and I felt really bad for him. It could happen to anyone, I imagine what it could be like. I think of paralysed people every now and then, once you think about it you can't unthink it and it's a nightmare to think about, let alone live through it. That's all the sympathy I can offer unfortunately",
      "created_utc": 1723931049.0,
      "score": 1
    },
    {
      "id": "limlzxm",
      "body": "Dude, She left you for her good not for your good , I know men you were left and divorced because they had cancer but still they survived and avenged their loss by making their ex's regret for losing them in the first place.\n\nIt is just a matter of time until you find something to do as a purpose , \n\n● Try reading books.\n● Try reading and listening philosophy.\n● Try reading and listening psychology.\n● Try critical thinking and create your own poetry, fiction or fantasy stories.\n\nIt will give you something to do and absorb the information is what you can do and it will certainly change your personality too.\n\nSo, Get ready for a change in your thought process too.",
      "created_utc": 1723931891.0,
      "score": 1
    },
    {
      "id": "limqyse",
      "body": "You're better off without her, she definitely sounds like she's not in it for better or for worse, only when it's convenient for her.",
      "created_utc": 1723933824.0,
      "score": 1
    },
    {
      "id": "lin293f",
      "body": "I started getting derealization episodes that lasted for weeks and my bf broke up with me during one.  It felt so scary to.endure these on my own where I couldnt drive,.cook or really be left alone with this terrible disorder. Was very terrifying.\nI.would date someone who had no mobility if he still was in his right mind and was a kind and compassionate person. I'm 43 f though and feel like my youth is behind me after 3 kids.",
      "created_utc": 1723938254.0,
      "score": 1
    },
    {
      "id": "lin4rkx",
      "body": "Awww man I’m sooooooo sorry! This is heart breaking. I can’t imagine how you feel. She sucks! You don’t need a partner who is selfish and doesn’t care about you. I know you don’t see it now but you will eventually appreciate not having someone like that in your life.",
      "created_utc": 1723939247.0,
      "score": 1
    },
    {
      "id": "lin5rdz",
      "body": "Promises are far too often just empty words that feel good at the time they are spoken. Then when the rubber meets the road shit gets real, real quick.",
      "created_utc": 1723939648.0,
      "score": 1
    },
    {
      "id": "lin6x49",
      "body": "I am so sorry this happened to you. There are good people out there. I lost my faith in humanity for a while but I have gained it back. I can see how you have lost hope and I pray that you are ok at the moment. 🙏🤍🤍",
      "created_utc": 1723940118.0,
      "score": 1
    },
    {
      "id": "linp84j",
      "body": "She is immature and did not truly love you. Trust me, there are many women out there that fall in love with the person you are, not your limitations. You can go on to have a fulfilling life. Focus on maximizing your physical therapy sessions and learning to use all of the cool assistive devices out there. There is another younger guy that I follow on social media that was paralyzed from a broken neck and he is walking. He posts a lot of his therapy exercises. The progress has been incredible but took some time. I will find his name and post it here for you. It will be helpful to see someone further along in the journey and give you some ideas to try for therapy.",
      "created_utc": 1723947729.0,
      "score": 1
    },
    {
      "id": "linqqe5",
      "body": "Fuck that. This has nothing to do with you or your accident. She didn’t take her vows seriously.",
      "created_utc": 1723948383.0,
      "score": 1
    },
    {
      "id": "linrcwd",
      "body": "One life lesson for men, no matter age or situation, rich or poor, black Asian or white, religious or not m never throwaway your life over a woman. It hurts at first but with time you'll realise she isn't and never was worth it",
      "created_utc": 1723948651.0,
      "score": 1
    },
    {
      "id": "linuib0",
      "body": "Sorry to say this. But dating someone that soon after a proposal... it wasn't going to work out. Theres no way that she just moves on and dates someone else only because of the accident. It def was already a thought in her head. Hopefully only a thought.",
      "created_utc": 1723950045.0,
      "score": 1
    },
    {
      "id": "linxqap",
      "body": "A month ago? You’d still be in the hospital.",
      "created_utc": 1723951512.0,
      "score": 1
    },
    {
      "id": "linyot4",
      "body": "Hey, I know it feels like everything’s been ripped away—your independence, and even the person you thought would stand by you. But her leaving says more about her than it does about you. Life has hit you hard, no doubt, but you’re still here, and that’s proof of your strength. This accident doesn’t define your future, and neither does her decision. You’ve survived the worst, and that’s no small thing. Keep going, because there’s still so much more ahead for you, even if it doesn’t seem like it now.",
      "created_utc": 1723951960.0,
      "score": 1
    },
    {
      "id": "linyut0",
      "body": "Don't. Suicide is never an option. Be patient and pray for resilience and patience.",
      "created_utc": 1723952036.0,
      "score": 1
    },
    {
      "id": "linzibi",
      "body": "Please believe that God (or your deity of choice) kept you here for a reason. You are meant to be here.\n\nYou have a purpose. Sometimes when our lives change in drastic ways we lose our sense of purpose, but that does not mean we no longer have one. We just have to find it again.\n\nI know it is much easier said than done, but please try not to give up. Keep fighting. Take it day by day. You are LOVED and you are WANTED.\n\nI am praying for you. Hang in there ❤️",
      "created_utc": 1723952336.0,
      "score": 1
    },
    {
      "id": "lio49am",
      "body": "[removed]",
      "created_utc": 1723954597.0,
      "score": 1
    },
    {
      "id": "lioer1i",
      "body": "Fuck dude, I’m sorry, If there’s anything I can do, let me know.\n\nMy sister is a “cripple” as well, hit by a semi head on, she went and had stem cell therapy done and it *helped* but if it provides you any comfort, she’s as happy now as I’ve ever seen her, she still finds enjoyment every day and I’m thankful she’s still around, I would be crushed if she committed after the accident, thinking of it brings tears.\n\nSorry man, take care of yourself",
      "created_utc": 1723960258.0,
      "score": 1
    },
    {
      "id": "lioklrd",
      "body": "Im very sorry you’re going through this. Idk whT to say.. but no matter whT u do, dont kill yoursslf. We all die eventually…",
      "created_utc": 1723963905.0,
      "score": 1
    },
    {
      "id": "liooex2",
      "body": "have hope! there are people I've met who actually stayed with their opposite even after all these, from all the comments I've read, there are lots! lots of love, and I'll pray for you! love you! ♥️♥️♥️",
      "created_utc": 1723966341.0,
      "score": 1
    },
    {
      "id": "liopdm8",
      "body": "She was a fairweather fiance. You owe yourself better than that. Stay strong",
      "created_utc": 1723966988.0,
      "score": 1
    },
    {
      "id": "lior1po",
      "body": "Stephen Hawking was in a similar situation but he was a brilliant writer and I cherished reading his books. You have a wonderful spirit and you are filled with wisdom and perspective, and I think you would be an amazing author. I would read your books. You are valuable, worthy, and your voice is what can move mountains. I’ve never been much of a great writer but I am sure if you wrote a book it would be a bestseller. I just want to say that I love you and care for you, and I will always be thinking of you.",
      "created_utc": 1723968118.0,
      "score": 1
    },
    {
      "id": "liowwio",
      "body": "You're lucky that she left you before the marriage",
      "created_utc": 1723972092.0,
      "score": 1
    },
    {
      "id": "lip1jjj",
      "body": "She never fucking loved you. People always love to marry the first one that appears, she's clearly a hypocritical bitch, she talks the talk but doesnt walk the walk.\nYou're better off without her.",
      "created_utc": 1723975243.0,
      "score": 1
    },
    {
      "id": "lipnc8z",
      "body": "Im sorry for you, it will be better",
      "created_utc": 1723986941.0,
      "score": 1
    },
    {
      "id": "liqqchs",
      "body": "I know someone who became a lawyer as a quadriplegic. He’s a litigator. Moves around the court room using a little straw device. He handles disability and accident cases primarily . Try to focus on how you can turn this accident into something you can use an advantage. I know that sounds hard. I’m sorry about your fiancé.",
      "created_utc": 1724000755.0,
      "score": 1
    },
    {
      "id": "lirjc3q",
      "body": "Start dating people again. Giving up so easily is not an option. Yeah, it sucks really bad  losing love. I lost my son who gave me unconditional love due to other people's negligence. Am I angry? Hell yeah. Do I think about revenge? Every single day.  \n\n\nAm I killing myself( the victim )for them or even painting myself to be their victim (which I actually am)? Hell no. They can get ****** seven different ways.  During judgement day they'll have to answer for their crimes against humanity even if they won't take responsibility  today for it. \n\n\nWhat goes around comes around. One day that person is going to face the same pain they caused you one day. It's unlikely it will even last.\n\n\n Start thinking about what you are grateful for in the here and now not about what you have lost. Be present. life is short. \n\n\nThink about how you can improve your life and how you can meet your goals whatever those might be. Don't ever tell people about your actual goals, keep those private. You keep your real goals private, because not everyone is your friend in this world and will only use it against you.\n\n\n  \nIf your ex from the past contacts you gray rock her, if you can't completely cut her off. Which is giving very unemotional short answers. One word if you can. You don't ever give her real access back to you. You move on with your life, that's what's healthy.",
      "created_utc": 1724010430.0,
      "score": 1
    },
    {
      "id": "lirrktl",
      "body": "Dude fuck I can’t tell you how fucked up this is, Karma’s a bitch. It’s such a shitty thing to do.",
      "created_utc": 1724013171.0,
      "score": 1
    },
    {
      "id": "lisn1jv",
      "body": "I'm in the same position. I'm not a quadriplegic, but I have an amputated leg and incontinence issues. My mom doesn't want me to die either. But I can't lay in bed and watch TV for 50 years. I'm 38 years old, so that's about how long I will be alive. I plan on taking my own life in a month or two. But if you're looking to find some hope, there's a YouTube channel I watch called Roll with Cole & Charisma. It's about a quadriplegic who found love with his wife and somehow found happiness again. I mean honestly, I could date the guy who is also an amputee that lives in my building. But I don't think finding a partner is going to make me want to stick around anyway. The movie Me Before You gives the opposite of hope and is about a quadriplegic whose family helps him end his own life. So on the one hand, yes it's possible to find love and happiness again. But on the other end is if that's going to be enough for someone. Only you would be able to answer that. ",
      "created_utc": 1724024593.0,
      "score": 1
    },
    {
      "id": "lj5ti80",
      "body": "Are you able to use your arms and/or hands? Do your best to practice mobility wherever possible and maybe with time you will regain some mobility in certain areas of your body. sometimes you can regain partial mobility with time and especially with effort.  it can takes months or even years. There is also apparently new technology coming out that can help you walk again using artificial means to send signals from your brain to your limbs.  Anything is possible.\n\n  \nAs for your fiance? Not to assume but she sounds very unloyal, unloving, uncommited, unhelpful, uncaring, and very forgettable. i dont think you lost anything there (except for time) in my humble opinion",
      "created_utc": 1724215010.0,
      "score": 1
    },
    {
      "id": "lj629yz",
      "body": "Really sucks when ppl marry they never mean it when it comes to sickness and health. She'll get karma when she's is ill",
      "created_utc": 1724219747.0,
      "score": 1
    },
    {
      "id": "ljj5vyf",
      "body": "One of my best friends is”super-dave” bc Hes a quad that overcame his accident.  It’s shitty.  He made me an advocate for sci",
      "created_utc": 1724414170.0,
      "score": 1
    },
    {
      "id": "lijkhmq",
      "body": "Your ex-fiancée is disgusting. Plenty of paralysed people are married, that’s no reason to think you can’t get married. It may be harder, but it’s more than possible, I promise.",
      "created_utc": 1723888740.0,
      "score": -2
    },
    {
      "id": "lijm2r8",
      "body": "I’ve seen some incredible technological advancements recently - in my lifetime I am sure we will see robotic science evolving so you can have independent movement one day. It’s incredible what is happening. \n\nRegarding your fiancé, you have been very empathetic to her reasons for leaving. This is a commendable attitude and tells me you are going to make it. \n\nDid you know there are disabled communities where people do find friendship and love, I don’t know if it’s a bit gross to be fetishised this way but there are women who love taking care of people and specifically look for disabled men to be able to do this? \n\nI’m not here to judge anyone. \n\nI’m just telling you your situation is not dire by any means. It is about as huge an adjustment as one can ever have to make but you don’t have to do it overnight, or alone. A month is nothing. Find those communities and start talking to people in them, you will thrive. \n\nLots of love.",
      "created_utc": 1723889805.0,
      "score": 1
    },
    {
      "id": "lijiziz",
      "body": "That's harsh. But don't think that being able to do things abled people do or having a romantic partner is the only thing that matter in life.\n\nYour still young. You can't know for sure what life will be about",
      "created_utc": 1723887710.0,
      "score": 1
    },
    {
      "id": "lijl9iv",
      "body": "I hope and wish you find someone who loves you for who you are even in your current situation. Please give some time for such a person to come into your life and you also try to find find someone who would be happy to accept you. Meanwhile please try to find some hobbies and try to get your mind off her even if it's for some time.",
      "created_utc": 1723889267.0,
      "score": 1
    },
    {
      "id": "lijxt2x",
      "body": "OP…I’m so sorry. Your true love is somewhere, out there. You’re so young! Life can change, on a dime…as you know. It can change again, for the positive. A lot of people don’t realize how good they have it, until something like this, comes along. I’m really sorry that you were hurt…physically and emotionally. I don’t know why, but I feel like you are about to hit a lucky streak, meet the woman of your dreams and live life, again. I won’t talk you out of committing but I won’t talk you into it, neither. You’ve been put through the wringer. You are NOT useless….especially to your mother. Here is a virtual hug (((💙❤️))). 🌊",
      "created_utc": 1723896544.0,
      "score": 1
    },
    {
      "id": "lim7hic",
      "body": "The trash took itself out",
      "created_utc": 1723926613.0,
      "score": 1
    },
    {
      "id": "lin63mt",
      "body": "You're not a burden, but she is a piece of shit.",
      "created_utc": 1723939784.0,
      "score": 1
    },
    {
      "id": "linm4xj",
      "body": "I smell BS. Last month, took care of me for a few day, etc. Timeline doesn’t work.",
      "created_utc": 1723946404.0,
      "score": 1
    },
    {
      "id": "lijjcub",
      "body": "[removed]",
      "created_utc": 1723887963.0,
      "score": -12
    },
    {
      "id": "lijyvgi",
      "body": "All of us will die one day, sooner or later, stay a little, try to adapt, if you cant doesnt mean you need to face it, if you see it like a prison, you have an escape, it your life after all, dont listen to all the gasligthing",
      "created_utc": 1723897060.0,
      "score": -1
    },
    {
      "id": "likd6nq",
      "body": "I’m so sorry to hear about this. This is honestly heartbreaking and I cannot believe. I feel extremely bad that this even happened to you! I would sign up for all the help you can. I’m most positive your entitled to an aide and caregiver and they can both help you around the clock depending on your insurance. Again so sorry for your troubles but you can get through this!",
      "created_utc": 1723903219.0,
      "score": 0
    },
    {
      "id": "lijf0vx",
      "body": "Ur situation is so fucked bro makes me remind even more to never trust woman fully they are all scumbags once they cant profit off u anymore",
      "created_utc": 1723884940.0,
      "score": -31
    },
    {
      "id": "lijk100",
      "body": "I'm sorry you're suffering. \nIf anyone sees my comment, please don't bring kids into this world",
      "created_utc": 1723888425.0,
      "score": -15
    },
    {
      "id": "lipkk2l",
      "body": "Nothing the body can't heal. No way U can't be helped to walk again especially given the new medical technology availabile",
      "created_utc": 1723985860.0,
      "score": -2
    },
    {
      "id": "lijym26",
      "body": "Physical therapy or neuralink",
      "created_utc": 1723896934.0,
      "score": -3
    },
    {
      "id": "liov6tf",
      "body": "[removed]",
      "created_utc": 1723970932.0,
      "score": 27
    },
    {
      "id": "ljj6ugi",
      "body": "Good lord. My asshole mother told me not to dive into the shallow end.  She was a pt.  Died of cancer.  One way or another ",
      "created_utc": 1724414582.0,
      "score": 1
    },
    {
      "id": "likb5f9",
      "body": "Sounds like she was hiding being a terrible person from the get-go. She moved on way too fast.",
      "created_utc": 1723902417.0,
      "score": 415
    },
    {
      "id": "linqv5n",
      "body": "I’m so, so sorry you went through that. It sounds like you would’ve loved to be there for him. That’s so fucking sad. I can’t even imagine the amount of mental and emotional pain he was in.",
      "created_utc": 1723948441.0,
      "score": 21
    },
    {
      "id": "lijca6m",
      "body": "I require a lot of care and I lack independence. I don't think I can find a woman who is ok with my condition. I'm a burden.",
      "created_utc": 1723883062.0,
      "score": 201
    },
    {
      "id": "lil9jce",
      "body": "I actually hope it is. I spent ages writing a comment and after posting it tried to click on his profile, only to notice it has been deleted.\n\nI hope he deleted it because he felt guilty for lying rather than him ending his life because he’s paralysed and his fiancé left him.",
      "created_utc": 1723914678.0,
      "score": 20
    },
    {
      "id": "lil4arr",
      "body": "Why?",
      "created_utc": 1723912863.0,
      "score": 3
    },
    {
      "id": "liokvob",
      "body": "What's there to gain!?",
      "created_utc": 1723964075.0,
      "score": 1
    },
    {
      "id": "limn7ph",
      "body": "There are programmes one can use , whereby your voice enables what is said to be auto typed out.",
      "created_utc": 1723932362.0,
      "score": 3
    },
    {
      "id": "lijc017",
      "body": "My injury is permanent, there's nothing I can do. I still miss my fianceé. I loved her.",
      "created_utc": 1723882872.0,
      "score": 12
    },
    {
      "id": "lio4kyu",
      "body": "I broke my spine years ago and thought I had a best friend but when I asked her to help me out of bed she called me annoying etc and listened to me cry all night. Needless to say I dropped her as a friend.eye opening yes, but you will know who is true and loving to you from this experience.",
      "created_utc": 1723954758.0,
      "score": 1
    },
    {
      "id": "ljj6hsp",
      "body": "It can get better but I’m in no position to judge ",
      "created_utc": 1724414431.0,
      "score": 1
    },
    {
      "id": "lijz46o",
      "body": "Part of me is hoping this is a fake post just so it's not true for OP. \n\nI'm sure there's more details, but to play devil's advocate, I can see where both parties are coming from. At the end of the day, it's a blessing in disguise to not be with someone who doesn't want to be with you, regardless of the circumstances. Everyone deserves someone who is fully in the relationship, through sickness and health...or so they say?",
      "created_utc": 1723897173.0,
      "score": 4
    },
    {
      "id": "lijnfnz",
      "body": "I disagree that she is “disgusting” maybe she knows her limits. She may very well love him but not be able to take on the role of care taker and that doesn’t make her a bad person.",
      "created_utc": 1723890704.0,
      "score": 6
    },
    {
      "id": "lijm1uv",
      "body": "She was a fiancée and not yet a wife… It is a horrible things to do what she did to him. However, you gotta think that she was a 25 year old woman and it’s at that age that an adult’s brain is considered to be fully developed. She could be immature and also not emotionally strong enough to handle such a situation at a young age. As much as it hurts… it shows that doesn’t have the understand and compassion and maturity that holding a marriage together requires.",
      "created_utc": 1723889789.0,
      "score": 5
    },
    {
      "id": "lijqg3o",
      "body": "[removed]",
      "created_utc": 1723892592.0,
      "score": 8
    },
    {
      "id": "lijgdz7",
      "body": "Good, leave us alone",
      "created_utc": 1723885874.0,
      "score": 20
    },
    {
      "id": "lijjfbz",
      "body": "Be so for real, men leave their wives when they gain weight or age",
      "created_utc": 1723888011.0,
      "score": 5
    },
    {
      "id": "lil4unv",
      "body": "Bro...this is NOT the time. Coming from another AN.",
      "created_utc": 1723913057.0,
      "score": 3
    },
    {
      "id": "liq84ha",
      "body": "There was an episode on “A Thousand Way’s To Die” some girl took some drugs and hallucinated that the pool was full and jumped in and died.",
      "created_utc": 1723994657.0,
      "score": 20
    },
    {
      "id": "lip42in",
      "body": "Does it really matter? Happens more often than you might think. Usually things like this happen at night and with alcohol involved.",
      "created_utc": 1723976936.0,
      "score": 28
    },
    {
      "id": "lixogbd",
      "body": "I am not sure this makes her a terrible person.  At this early stage of her life, does she really owe it to this guy to be his lifetime caretaker.  Also, no sex.\n\n\nI would not judge someone for leaving at that point.",
      "created_utc": 1724101031.0,
      "score": 6
    },
    {
      "id": "lilrqfe",
      "body": "[deleted]",
      "created_utc": 1723920989.0,
      "score": -62
    },
    {
      "id": "lipdaet",
      "body": "I would have loved him even if he was a vegetable it's through thick and thin .... op reminds me of my partner, and i have been going to therapy, and it just makes me sad hasn't made much difference yet. \nI hope I can help op though I truly wish op the best life",
      "created_utc": 1723982345.0,
      "score": 7
    },
    {
      "id": "likior8",
      "body": "Please don’t feel this way. You are NOT a burden. \n\nI’m so sorry for your injury and the end of your relationship. I have to be honest though, if your fiancé genuinely cared for you, she wouldn’t have left, let alone hook up with someone new so quickly. Maybe she wasn’t as invested in the relationship as you were. \n\nA friend of mine is in a wheelchair after bone cancer, but she has a wonderful partner who stayed by her side and supported her 100%. It has been about five years since her surgery, and this is just their new normal. He’s the type of partner you deserve. You didn’t ask for this and it’s really selfish to do this to someone she supposedly cared about while you’re dealing with so much. I’m so sorry.\n\nI’m not saying you shouldn’t feel sad and hurt that she left, but within time I hope you can see things a little clearer. Your injury and change of circumstances are so new, but you will find different ways to the happiness you deserve. There are amazing advances in medicine and rehabilitation services that can help you with your recovery. Things like physiotherapy and occupational therapy. An OT can come out to your home and help organise various things to help your Mum with your care needs. \n\nMay I ask which country you live in? Where I live people with disabilities are entitled to a pension and can get a care package to help with your ongoing medical needs (some are close to $1,000,000 per year). It pays for carers to come to your home so you can worry less about being a burden to your Mum. I doubt your Mum would feel that way about you anyway. \n\nDo you have a psychologist, psychiatrist, social worker etc you could talk to during this difficult time? If not, I’d highly recommend it. Anyone in your position would be struggling mentally. You’ve had such a huge change, but your life isn’t over. People with disabilities or mobility issues can still have wonderful, fulfilling lives. You will meet someone wonderful who sees you for the person you are, not someone with a disability. \n\nSending all my strength and healing vibes to you. I hope life is a little kinder to you in the future.",
      "created_utc": 1723905308.0,
      "score": 93
    },
    {
      "id": "lijpje9",
      "body": "My boyfriend was in a car accident before I met him and he has life long injuries. He cannot use one arm or one hand at all, the other hand is basically frozen so he can’t do much with his hands. He is actually facing amputation on his right arm at the end of this year, in hope of improving the quality of his arm/hand. He also has problems with his leg and has had over sixteen surgeries since we have been together. Over the years, he has learned to adjust and do so much more than he could when we first started dating. I have showered him, cared for him after surgery, tied his shoes, pushed him in a wheelchair when needed. We have been together eight years and I couldn’t imagine life without him. When someone really loves you, they will do anything to make a relationship work with you. His family all thought I would leave him and even to this day, they tell me they cannot believe I stayed through all of it. It has been a lot at times, of course, but he didn’t ask for this and I know he would help me in any way he could if I was in his position. Please don’t ever give up hope. When you meet the right person, if you love that person, you go to any length to make it work!",
      "created_utc": 1723892037.0,
      "score": 239
    },
    {
      "id": "likma5v",
      "body": "Everyone has different love language, and for some people it’s care.",
      "created_utc": 1723906598.0,
      "score": 20
    },
    {
      "id": "likwxx5",
      "body": "I met my partner when he was incapable of leaving the house for more than an hour at a time, couldn’t eat meals with me, etc. because of his disabilities. He couldn’t work, and was extremely depressed. We’ve been together for about 4 years. I did my best to give him what he needed. I wasn’t always my best self and it was one of the hardest things I’ve ever done.\n\nHe got treatments and feels like a different person. He just got a job for the first time in years. He never, ever thought he would get here. You’ll find someone to love you through it.",
      "created_utc": 1723910297.0,
      "score": 22
    },
    {
      "id": "likyppd",
      "body": "Some people are natural carers. I personally am someone who NEEDS to be able to take care of people I care about. Even when my boyfriend was just sick with covid I made being his nurse my full time job lol there are definitely women who would line up and thrive having a man who needs and depends on them. But I’m sure it’s a lot to process right now so try to see all the other people who voluntarily choose to still be in your life and care and help you",
      "created_utc": 1723910912.0,
      "score": 11
    },
    {
      "id": "linmomt",
      "body": "Please look into Henry Fraser. He was a rugby player who then had major injury. He is now a front running artist..a mouth painter, who has also written several books.\n\nYes..you prob feel like crap right now....emotionally devastated and unfairly rejected on top of your physical , emotional and psychological pain.\n..but...if you can...just be better. Be fucking awesome. ... if even in spite or revenge, or just being this version of you. It's sounds flippant to say but try reframing this obstacle as an opportunity. \n\nAnd believe me... the right person for you will not see anything as a caring role. They will just care..and love, and laugh and share joy and sadness. \n\nYou will be loved...just start with lo ing yourself a bit. Let her go...she was there for old you with no adaptions. This is new you with so much room to grow. And I bet you'll love deeper than ever xxx",
      "created_utc": 1723946633.0,
      "score": 8
    },
    {
      "id": "lijhv3h",
      "body": "You are not a burden you still have purpose in this world",
      "created_utc": 1723886907.0,
      "score": 37
    },
    {
      "id": "lijl1o5",
      "body": "There is someone out here just for you and only you . Just when you think it isn’t you’ll meet her",
      "created_utc": 1723889120.0,
      "score": 13
    },
    {
      "id": "limqba9",
      "body": "you are one month out from your injury, you will learn and develop these things in time. Yes the way you do things will never be the same as pre-injury but you adapt and make things work.\n\nYou are not a burden.",
      "created_utc": 1723933568.0,
      "score": 3
    },
    {
      "id": "lio87yp",
      "body": "How are you typing?",
      "created_utc": 1723956635.0,
      "score": 3
    },
    {
      "id": "lill90e",
      "body": "In less than a month a quadraplegic due to a car crash is recovered enough to post it Reddit? He already is proficient with S2T programs to create account navigate Reddit and comment?",
      "created_utc": 1723918703.0,
      "score": 25
    },
    {
      "id": "liovi8i",
      "body": "People are twisted and get off on weird stuff. It's called rage bait.",
      "created_utc": 1723971149.0,
      "score": 3
    },
    {
      "id": "lip1akr",
      "body": "Attention, sympathy, and maybe even money. People enjoy taking advantage of these schemes.",
      "created_utc": 1723975076.0,
      "score": 3
    },
    {
      "id": "lircwao",
      "body": "[removed]",
      "created_utc": 1724008232.0,
      "score": 4
    },
    {
      "id": "limt7f5",
      "body": "But how would OP be able to login to reddit amd hold.his phone ??",
      "created_utc": 1723934717.0,
      "score": 2
    },
    {
      "id": "lil3uyx",
      "body": "You’re in a grieving period of many things. Your mobility, independence, your douche finance.  Like many said above you just have to get used to the new normal which will take time. You’re not a burden. There’s someone out there for you.",
      "created_utc": 1723912707.0,
      "score": 5
    },
    {
      "id": "lijdrxy",
      "body": "[removed]",
      "created_utc": 1723884089.0,
      "score": -52
    },
    {
      "id": "likhw5h",
      "body": "I’m pretty sure it’s fake.",
      "created_utc": 1723905018.0,
      "score": 5
    },
    {
      "id": "lipn9dt",
      "body": "Turning your back on someone for something like that is a disgrace, and she has no excuse to be immature at her age unless she has some kind of mental issues.",
      "created_utc": 1723986906.0,
      "score": 3
    },
    {
      "id": "lijrgt5",
      "body": "[removed]",
      "created_utc": 1723893192.0,
      "score": -4
    },
    {
      "id": "liq8sl5",
      "body": "[removed]",
      "created_utc": 1723994885.0,
      "score": 1
    },
    {
      "id": "lka8vwm",
      "body": "Yes, you are so right on here. Young marine + alcohol + a DARE into the pool = catastrophe",
      "created_utc": 1724814434.0,
      "score": 1
    },
    {
      "id": "lkt6cw9",
      "body": "But surely you can give it more than a few days?",
      "created_utc": 1725098166.0,
      "score": 3
    },
    {
      "id": "lz57yqr",
      "body": "There's a difference between leaving vs claiming this \"She said she didn't sign up to raise a crippled man, and that she needed a real man she could marry.\". She didn't have to insult him while doing so.\n\nAnd tbh fairweather people are horrible spouses.",
      "created_utc": 1732657948.0,
      "score": 1
    },
    {
      "id": "limkdxi",
      "body": "Would you be so kind enough to share your source?",
      "created_utc": 1723931278.0,
      "score": 57
    },
    {
      "id": "limzo1g",
      "body": "yeah it's the opposite. women are more likely to stay and become carers. men are more likely to leave and get remarried.",
      "created_utc": 1723937240.0,
      "score": 80
    },
    {
      "id": "linloes",
      "body": "Please also look at the percentage of men who leave their female partner when they get cancer diagnosis..especially breast cancer.",
      "created_utc": 1723946210.0,
      "score": 26
    },
    {
      "id": "linklwm",
      "body": "it's actually the literal opposite. most men leave when their wives get sick or disabled",
      "created_utc": 1723945768.0,
      "score": 38
    },
    {
      "id": "limyo3f",
      "body": "I think you will find it's the other way round more men do than women",
      "created_utc": 1723936849.0,
      "score": 39
    },
    {
      "id": "lisnel9",
      "body": "That's not actually one of the love languages lol",
      "created_utc": 1724024735.0,
      "score": 3
    },
    {
      "id": "lijimpp",
      "body": "It's bullshit",
      "created_utc": 1723887457.0,
      "score": 39
    },
    {
      "id": "liqy1nd",
      "body": "I mean, there are accommodations for disabled people to be able to use the internet...",
      "created_utc": 1724003272.0,
      "score": 2
    },
    {
      "id": "lz58god",
      "body": "Voice controls are built into phones now.",
      "created_utc": 1732658104.0,
      "score": 1
    },
    {
      "id": "lipyr73",
      "body": "Maybe his mom (caregiver) is typing it for him",
      "created_utc": 1723991400.0,
      "score": 0
    },
    {
      "id": "lipx1u8",
      "body": "Oh no!!",
      "created_utc": 1723990777.0,
      "score": 0
    },
    {
      "id": "litzuil",
      "body": "Oh no!",
      "created_utc": 1724046493.0,
      "score": 1
    },
    {
      "id": "livebl0",
      "body": "And they were likely intubated. would need to learn how to talk again, once they’re off the vent. That’s a whole heck of a lot to get done, huh?",
      "created_utc": 1724074591.0,
      "score": 3
    },
    {
      "id": "lin29a5",
      "body": "Have just told you plus there are holders one can get for phones fir wheelchairs ( am a wchair user).\nSurprised all this stuff isn’t known - these things have been around for decades!",
      "created_utc": 1723938256.0,
      "score": 2
    },
    {
      "id": "lin2f8w",
      "body": "Also, how do you know the Op is using a phone? That’s an assumption! Could be a tablet, notebook, laptop etc",
      "created_utc": 1723938322.0,
      "score": 1
    },
    {
      "id": "lijnwod",
      "body": "Respectfully, what a load of yapping. He’s said he’s quadriplegic, that means an irreversible injury. He might be able to get some mobility back with treatment, but saying that he’s not allowed to grieve because that prevents his “healing” is so out of pocket, especially considering it only happened 3 months ago. Do you really think that out of those millions of people that are quadriplegic, none of them have tried being positive? Do you really think billions would be spent on finding a cure if the solution was as easy as being “positive”? Touch some grass",
      "created_utc": 1723891014.0,
      "score": 28
    },
    {
      "id": "lik32p4",
      "body": "You make me sick.",
      "created_utc": 1723899004.0,
      "score": 8
    },
    {
      "id": "lijhwj4",
      "body": "link your essential oils that cure paralysis",
      "created_utc": 1723886936.0,
      "score": 10
    },
    {
      "id": "likf94y",
      "body": "Lol bro just go fuck yourself",
      "created_utc": 1723904030.0,
      "score": 1
    },
    {
      "id": "lijdu81",
      "body": "[removed]",
      "created_utc": 1723884132.0,
      "score": -27
    },
    {
      "id": "lippqmq",
      "body": "Yes it is very disgraceful behavior and shows lack of character on her part. \nIt just shows where she’s lacking and that she might not have been in love with him as much as she thought at least not enough to stick it out through such a hard time. \n\nBut also, she is 25 and wants to have a normal life and not have to be a caretaker for life. She has free will and a choice…too",
      "created_utc": 1723987956.0,
      "score": 1
    },
    {
      "id": "liquq76",
      "body": "Hopefully karma doesn't get you for bringing up the Darwin awards and you don't die or get injured by doing something foolish.\n\nHopefully you never have a day in your life where you sleep deprived, thirty and hungry all at once so you can always think clearly and not do something sloppy.",
      "created_utc": 1724002178.0,
      "score": 10
    },
    {
      "id": "lku0942",
      "body": "You want her to pretend?",
      "created_utc": 1725112842.0,
      "score": 3
    },
    {
      "id": "lz5lca2",
      "body": "We may be losing something in the retelling.  But if that was said verbatim, yes, the \"real man\" part was unnecessary.  The part about not signing up to raise a crippled man, well, that may be blunt, but it's the truth.  They are not married yet and she is only 25.  It's a lot to ask to her to basically sacrifice her life's happiness at this point.  She does not owe him her life.\n\nAs to \"fairweather\", well, this is an extreme case.  It's not like the guy lost his job or something like that, which may be a setback that lasts for months.  This is a lifetime change.",
      "created_utc": 1732662373.0,
      "score": 2
    },
    {
      "id": "limy1w2",
      "body": "https://www.sciencedaily.com/releases/2009/11/091110105401.htm#:~:text=However%2C%20researchers%20were%20surprised%20by,the%20man%20was%20the%20patient.\n\nIt’s the opposite lmao.",
      "created_utc": 1723936614.0,
      "score": 90
    },
    {
      "id": "liylw23",
      "body": "Omg you must be fun at parties, you’re the type to self title yourself « expert » right?",
      "created_utc": 1724112414.0,
      "score": 1
    },
    {
      "id": "m4z9bbf",
      "body": "This is old but, it actually is a love language. Taking care of someone is Acts of Service.",
      "created_utc": 1735804530.0,
      "score": 1
    },
    {
      "id": "lin3trv",
      "body": "Oh well I didn't mean to be offensive thank you so much for letting me know. That makes a lot more sense. I wish op the best of luck",
      "created_utc": 1723938877.0,
      "score": 3
    },
    {
      "id": "liv9gn1",
      "body": "You're so insulting. And ironically you're just showing your ignorance to what I'm talking about. People have recovered from quadriplegia.",
      "created_utc": 1724072742.0,
      "score": 1
    },
    {
      "id": "liqb2gz",
      "body": "Are you big enough to elaborate?",
      "created_utc": 1723995660.0,
      "score": 1
    },
    {
      "id": "liv9mgz",
      "body": "Coward.",
      "created_utc": 1724072804.0,
      "score": 1
    },
    {
      "id": "lijozrq",
      "body": "[removed]",
      "created_utc": 1723891703.0,
      "score": 24
    },
    {
      "id": "lirabbb",
      "body": "[removed]",
      "created_utc": 1724007353.0,
      "score": 1
    },
    {
      "id": "lkxig05",
      "body": "I'm saying she should try for longer than a few days.\n\nI don't judge her for leaving, i feel like almost anyone would, eventually. But if they can't even try for longer than a few days to take care of someone they say they love, going through probably the worst trauma someone can go through, then yeah frankly i kind of think their a terrible person.",
      "created_utc": 1725158101.0,
      "score": 5
    },
    {
      "id": "lincw96",
      "body": "I was about to say that.",
      "created_utc": 1723942543.0,
      "score": 29
    },
    {
      "id": "lin3y6y",
      "body": "No worries & you weren’t offensive",
      "created_utc": 1723938925.0,
      "score": 2
    },
    {
      "id": "liva10e",
      "body": "Im not insulting at all. To an extent, you are right. But could’ve summed that up as ‘keep a positive mindset and stay strong, you can and will improve.’ I just used that example to make apparent the ridiculousness I perceived in the manner by which you made your points, all the pseudosciences and such.",
      "created_utc": 1724072960.0,
      "score": 1
    },
    {
      "id": "liva9he",
      "body": "People recovered from many things due to medicine, surgery, even keeping a positive mindset and staying strong. I have, too. Broke my shoulder last summer. But pushing your narrative that faith and blah blah blah is the way to do it, is fine to express, but I’ll criticize it.",
      "created_utc": 1724073052.0,
      "score": 1
    },
    {
      "id": "livui0h",
      "body": "Lol. Now that we are over the initial clash of viewpoints, let's continue. I would like to understand why you continue to superficially interpret my comments. What do you mean by blah blah blah? It sounds to me like you have just seen some words that flag things for you and you have painted me wholly with a brush of your own prejudices. What is wrong with having faith in yourself and something better? Psychologically that is extremely powerful in terms of overcoming difficulty and literally in physically healing. I think, there is so much woo woo going around that you have failed to see through that veil of superficial nonsense that covers such subject matters and therefore labeled me as one of them. In reality, what I have espoused actually has basis in scientific fact.",
      "created_utc": 1724080173.0,
      "score": 1
    }
  ]
}