{
  "id": "1gpitvm",
  "title": "Just don't care. ",
  "selftext": "Does anyone else ever feel like they just don't care? Don't care about living. Don't care about dying. Just here.\n\nI don't really know how to explain what I'm feeling.  I just feel like I've come to a point where I've experienced enough pain that I'm numb to this life. I don't want to be alive, but I don't want to die. I don't know what comes after this. It could be worse than this hell. \n\nI consider ending my life but then I think about the aforementioned.  \n\nI don't care about my job. I don't care if I lose it. I don't care if I don't survive.  This reality has drained me of the person I used to be. I used to like helping people. I used to like hanging out with friends. Now all I feel is pain. Every second of every day.  \n\nThis hellhole did this to me. I wish I never existed.  Existence is a curse for so many people in this place. Why is this place like this?\n\nI don't know what to do. I am crying as I'm typing this. \n\nI hate feeling like this. ",
  "created_utc": 1731411804.0,
  "score": 473,
  "num_comments": 48,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1gpitvm/just_dont_care/",
  "comments": [
    {
      "id": "lwqnh28",
      "body": "i feel so desensitised too. I want to kms. I’ve been more suicidal towards the end of the year. I’m 19 and I don’t really know how I’m still alive , I should be dead with the pain I dealt with. I made plans recently to commit but every-time im confronted with those feelings, I chicken out. Although, i get much more confident everyday that i don’t want to live.",
      "created_utc": 1731415398.0,
      "score": 37
    },
    {
      "id": "lwrwh42",
      "body": "I'm 27, feeling the exact same way. This world is exhausting and has burned me down to cinders. I'm only getting older and sadder and I just don't care anymore. \n\nI have a partner (22) and I don't want them to experience the pain of this world and I know that if I take myself out, that would be so much pain for them to endure. I want to be strong for them and for my family but some days I just feel I've been pushed so far beyond my limit.\n\nI'm just living for me and them, for my silly cat. I'm just using what strength I have to hold it together for everyone counting on me, even if that's just one person. \n\nstay strong, stay true",
      "created_utc": 1731431153.0,
      "score": 13
    },
    {
      "id": "lwrlpor",
      "body": "[removed]",
      "created_utc": 1731427816.0,
      "score": 8
    },
    {
      "id": "lwrxtxz",
      "body": "Same here. I just don't care about anything anymore. I don't care about myself, I don't care about anything and anyone. I've met about 4 new people this past month, and an old friend that I had dropped suddenly contacted me again, but I just don't care (and I cannot even bring myself to care) about maintaining those relationships when I don't even want to maintain my own life. In an alternate reality I'd probably make an effort, I'd be happy to go back to my old friend, but right now I really just don't care. And anytime I feel myself starting to care I get angry at myself. I just want it all to end. I'm scared of what comes next, too, but the way I'm so checked out of my life, I don't find it feasible for me (or for anyone who has the misfortune of knowing me) to still keep going.",
      "created_utc": 1731431573.0,
      "score": 6
    },
    {
      "id": "lwtsn73",
      "body": "Its the current culture of the world. I often think about this. How every era has a new obstacle its people face. It’s just the side effect of whatever our societies prioritize at a particular time.\n\nI think the current times are hyper focused on being the best. People, tech, trends, money, etc moves too fast now and days and it doesn’t promote people to rest and appreciate their surroundings. It’s hard to come together with loved ones because everyone seems to be just as stress, depressed and busy because we are always scrabbling to get our basic needs met. I wish our world leaders and our communities would see this and resist this over-work, self-indulgent culture but 🤷🏽‍♀️. \n\nI wouldn’t quit your job just yet seeing that it seems like that would be a warning sign that you are closer to “giving up” and *I* do not want that for you. I understand that you don’t have the self survival motivation right now but how about you set a little challenge for yourself this month. Maybe use a bit of *a* paycheck to do something for a local community. i.e: making sandwiches for a homeless shelter, buying laundry detergent and giving it to a local veteran center, etc. Something to reignite that giving/helping nature within you. \n\nI would also recommend getting medication to help with your seemingly depressive symptoms and outlook. That and a lifestyle change and focus. \n\nI’m about to swap out social media (including YouTube) for books again for healthy escapism. Just pick genres that excite and inspire you. Something positive and adventurous to open your mind up again. I use to have a healthier outlook on life even during getting abused and neglected as a child because I had books that helped me escape. \n\nI’m glad you shared, you aren’t alone. Stay with us.",
      "created_utc": 1731452519.0,
      "score": 6
    },
    {
      "id": "lwszzvc",
      "body": "i care. i want to live. life can be amazing and i want to experience it. but the anxiety hormone being constantly released into my brain is unbearable and makes me want to commit it",
      "created_utc": 1731443248.0,
      "score": 6
    },
    {
      "id": "lwtqipf",
      "body": "this is so [true.im](http://true.im) sorry my friend i wish i could wipe your tears away im here for you",
      "created_utc": 1731451813.0,
      "score": 3
    },
    {
      "id": "lwtnac3",
      "body": "Yeah I do I'm only 17 but I feel like that to much now...",
      "created_utc": 1731450757.0,
      "score": 2
    },
    {
      "id": "lwu2dig",
      "body": "I feel this. I hate it here. I'm doing it anymore much longer",
      "created_utc": 1731455923.0,
      "score": 2
    },
    {
      "id": "lwv1uo4",
      "body": "I'm 40 and have the same feelings and thoughts toward myself almost daily. From my experience, these thoughts come and go. There is nothing easy about life. People are shitty. Relationships are hard. Life is ever changing. With that said, there is help. Perhaps try seeing a psychiatrist and get on some meds. You're young, so you have time to work on it and get the help you need.  You'll be happier later in life knowing how to manage your thoughts and emotions. It's not fun when you're my age and have a family being diagnosed with a mental illness.",
      "created_utc": 1731468608.0,
      "score": 2
    },
    {
      "id": "lwve5ir",
      "body": "I get this. Sometimes i get into that space but i’m not completely jaded, i just think going through with it could be easier. I’m hung up on knowing i’m a statistic who meant nothing to no one - my identity will be lost in the words of my abusers. My pets are at their mercy and they have hurt their own pets as well. I’m not terribly comfortable with a painful death but it’s what i have access to and i am terrified to fuck it up because they’re not really known for EQ, i would be treated even worse in a failed attempt so i really don’t wanna see that.\n\nI’ve always fought so hard for my life so accepting this is hard.. i’ve pushed back against a lot. It’s not in me to just stop but the circumstances i’m in with next to no support is not livable or feasible. Unless I wanna subject myself to more abuse, i’d rather face death but it’s still terrifying. I’m going to die but i literally exist to no one. \n(Please don’t reply i’m not alone ffs... I wouldn’t even consider suicide if I had one actual supportive person in my life who’s truly safe and has my back. That is the real way people survive and they take it for granted every day.)",
      "created_utc": 1731473838.0,
      "score": 2
    },
    {
      "id": "lwvhx65",
      "body": "Constantly",
      "created_utc": 1731475651.0,
      "score": 2
    },
    {
      "id": "lwvjw0u",
      "body": "crying while reading this and thinking abt ending it rn lmao",
      "created_utc": 1731476642.0,
      "score": 2
    },
    {
      "id": "lwwboim",
      "body": "Same. I feel like it's pointless to do anything because I don't even want to exist in this world",
      "created_utc": 1731494325.0,
      "score": 2
    },
    {
      "id": "lwsge9b",
      "body": "Istighfar min, tentu ada yg Allah nak u perbaiki lg, maybe ibadah, iman dan apa jua yg berkaitan dgn amalan",
      "created_utc": 1731437237.0,
      "score": -1
    },
    {
      "id": "lwrg5qv",
      "body": "No, i dont",
      "created_utc": 1731426057.0,
      "score": -2
    },
    {
      "id": "lwqpq4b",
      "body": "This world is such a painful place. I hope you can find some peace here. It sucks to even have to consider ending your own life. Wish you well.",
      "created_utc": 1731416379.0,
      "score": 13
    },
    {
      "id": "lwtq2xl",
      "body": "[removed]",
      "created_utc": 1731451667.0,
      "score": 5
    },
    {
      "id": "lws7663",
      "body": "As long as you feel you have a reason to live. That helps. I'm sure your partner and cat appreciate you in their lives. Hope you are well.",
      "created_utc": 1731434426.0,
      "score": 4
    },
    {
      "id": "lwrr44g",
      "body": "[removed]",
      "created_utc": 1731429511.0,
      "score": 4
    },
    {
      "id": "lws802i",
      "body": "It's tough not having anyone or anything that can make you care about living. I'm there with you. If you choose to stay here, hopefully you find peace.",
      "created_utc": 1731434681.0,
      "score": 2
    },
    {
      "id": "lww9gme",
      "body": "Hi. Thank you for your kind words and encouragement.  Really means alot. You are definitely right. Everything in this life revolves around money, trends, etc.\n\n You are actually the second person to mention just appreciating surroundings (nature). And also no social media. Youtube is definitely the hardest one to give up. At least for me. Lol Definitely have been looking into a couple of books. \n\nNot going to quit my job. I'm still here for the fight. \n\nI agree about giving back. I used to go serve dinner to homeless people. It felt good to help. Maybe it's time to go back there. \n\nMedication might help. I've been looking into it. \n\nSorry to hear about you being abused and neglected.  You didn't deserve that. No one deserves things like that. Hope you are doing better. \n\nThanks for your reply. I appreciate it. \n\nHope you are well.",
      "created_utc": 1731492870.0,
      "score": 2
    },
    {
      "id": "lwumc27",
      "body": "An anxiety mention, no one around me truly understands me when I tell them how detrimental anxiety is for me. I’m not depressed, just so overly traumatised and as a result, anxious. All. The. Time. It’s so over bearing, I can’t live with it, I don’t want to live with it. It’s starting to feel like taking my own life is going to be a decision based on logic rather than emotion because it is physically impossible to keep going this way and it scares me. It’s like my own brain is just poisoning itself any chance it gets and sending it into a panic over anything and everything. I feel like I’m getting closer to the edge of mania every day",
      "created_utc": 1731462961.0,
      "score": 6
    },
    {
      "id": "lww6ex5",
      "body": "Thank you for the kind words. I hope you are doing well, friend.",
      "created_utc": 1731490811.0,
      "score": 2
    },
    {
      "id": "lww65ur",
      "body": "I hope you find some peace here. Sucks you are so young and already see that life is not the pretty existence some people make it out to be. Hope you are well.",
      "created_utc": 1731490638.0,
      "score": 1
    },
    {
      "id": "lww9mhy",
      "body": "I hope you find some peace. I definitely understand wanting to end it, but maybe think on it.",
      "created_utc": 1731492976.0,
      "score": 1
    },
    {
      "id": "lwrdgtm",
      "body": "Guys hope you doing good, im 21 hate every second of it just a painful place to be really",
      "created_utc": 1731425183.0,
      "score": 5
    },
    {
      "id": "lwspyl4",
      "body": "I'm sure there are people that appreciate you in their life too. I know it's hard, I wish it wasn't. sending virtual and spiritual support my friend.",
      "created_utc": 1731440169.0,
      "score": 2
    },
    {
      "id": "lww6qpu",
      "body": "I completely understand you. The anxiety will get to you making this existence even more unbearable.  Because now your brain is telling you more negativity. I wish I had a solution for you. I hope you can find something that brings you some peace and relief from mania. This world can destroy your mind.",
      "created_utc": 1731491041.0,
      "score": 2
    },
    {
      "id": "lx1qs6x",
      "body": "thank you so much my friend, do you want to talk?<3",
      "created_utc": 1731564558.0,
      "score": 1
    },
    {
      "id": "lwriogp",
      "body": "It really is a tough place. Hope you find some peace.",
      "created_utc": 1731426855.0,
      "score": 5
    }
  ]
}