{
  "id": "1go9xq4",
  "title": "I just started my suicide process, Im scared of hell but I guess there's nothing else left",
  "selftext": "I have a 100 bottle of extra strength tylenol, a 100 tablet of 200mg ibuprofen, ~20 duel pain relievers mixed with tylenol and ibuprofen, and about 10 antibiotics. I just got back from the store with my favorite snacks. I have a can of margarita 10%. I just tried to call the people in my suicide note but i didn't get an answer. I guess this is it. I just went to the store and got a razor blade, but i punked out of using it. I guess if I get in too much pain i'll use it. This may be painful and I may start to stroke and seize, but fuck it. I always thought I would live till 56 (lots of diseases run in the family Im just being realistic), but I guess 21 is best. The last thing I have is my looks, so I guess I'll leave a beautiful corpse\n\nGuy's i didn't go through with it. when i posted this i had the pills and liquor open and was crying between the putting the pills in my hand and actually putting them in my mouth. i tried this before on a lessor scale and ended up violently sick in the hospital. This was way harder than doing it before, i was almost having flashbacks. I got the pills in my mouth then got scared and went back to google to see if i knew how much it took before the seizures start, if they were painful, and the likelihood of slipping into a coma. i then looked up the most successful suicide attempts and pills were ranked at the lowest. then i started reading your comments about how it wouldn't kill me but make me violently sick. i have a very high pain tolerance but the last overdose was my first 10 pain until i caught covid. I did chicken out. I'm sorry if I wasted your time and energy worrying about me. I also want you to know this isn't ragebait, this did happen and I didn't see how much attention this got as my alt page with the notifications disabled. Sorry again",
  "created_utc": 1731270242.0,
  "score": 485,
  "num_comments": 114,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1go9xq4/i_just_started_my_suicide_process_im_scared_of/",
  "comments": [
    {
      "id": "lwh8xju",
      "body": "[removed]",
      "created_utc": 1731274665.0,
      "score": 191
    },
    {
      "id": "lwhjga7",
      "body": "As someone who recently tried to overdose myself I can tell you the pills won’t be enough. \n\nYour body, or at least mine did, will still instinctively try to purge them out. My parents found me because I had woken up obviously nauseous and had slipped in my own vomit and crashed down in the hall. I came out of the ordeal with about 27 bleeding stomach ulcers among other things, and am probably lucky there wasn’t more damage to other organs. \n\nI don’t know you. And I don’t know what you’re going through. But I want you to know that I know what it’s like to walk where you’re walking now. And it breaks my heart to know you/others feel the way I do. So if you need someone to walk beside you for a little bit I am here, as is every other stranger reaching out to you  sure.",
      "created_utc": 1731277992.0,
      "score": 186
    },
    {
      "id": "lwimmv8",
      "body": "[deleted]",
      "created_utc": 1731291714.0,
      "score": 67
    },
    {
      "id": "lwhbkbo",
      "body": "This isn’t going to kill you, just destroy your liver and you’ll end up in the hospital for weeks … just go to the hospital now and get help instead",
      "created_utc": 1731275479.0,
      "score": 202
    },
    {
      "id": "lwhnl4s",
      "body": "This will hurt beyond belief. The worst pain you can imagine. Don't do it.",
      "created_utc": 1731279342.0,
      "score": 42
    },
    {
      "id": "lwgwexo",
      "body": "Not going to tell you not to do it. I don't know the pain you're going through. If you want to talk about anything whilst you're going through this, I'm here.",
      "created_utc": 1731271029.0,
      "score": 103
    },
    {
      "id": "lwh9ese",
      "body": "[deleted]",
      "created_utc": 1731274812.0,
      "score": 18
    },
    {
      "id": "lwik30b",
      "body": "You still have a favorite snack. There at least something good here. Don’t do it, but i know the pain is overwhelming. Please don’t do it anyway. I hope you read this.",
      "created_utc": 1731290799.0,
      "score": 19
    },
    {
      "id": "lwgwmih",
      "body": "Keep calling, man. They'll pick up eventually, or go to them.\n\nThey'll be grateful you did and those missed calls will haunt them for life.\n\nYou got this, I believe in you 🔥🔥🔥",
      "created_utc": 1731271091.0,
      "score": 67
    },
    {
      "id": "lwjpcqw",
      "body": "Those pills will cause you more pain than you think. Lots of liver damage and you’ll just wake up in a hospital with probably severely damaged organs.",
      "created_utc": 1731309035.0,
      "score": 11
    },
    {
      "id": "lwigzde",
      "body": "Ugh I hate tylenol, odds are you’ll throw up everything end up waking up in the morning. I hope you’ll be here tmrw. Stay strong",
      "created_utc": 1731289693.0,
      "score": 15
    },
    {
      "id": "lwh6mmn",
      "body": "hey brodda, dont do it, if you need someone to talk i am here , trust me its not worth it.",
      "created_utc": 1731273966.0,
      "score": 6
    },
    {
      "id": "lwhdxwt",
      "body": "I tried at your age and failed, but it finally got me the help I needed. Consider going to an inpatient facility. Life is ups and downs… but this is all we get. Death is certain, but life is a roller coaster. There is still beauty left for you to witness. \n\nIt’s not worth the damage you will do to your organs. I jumped out of a window 20 years ago, and I still suffer from what I put my body through. \n\nI never pictured myself living this long, but I find myself glad I did.",
      "created_utc": 1731276234.0,
      "score": 7
    },
    {
      "id": "lwidh05",
      "body": "Call 911! Get to a hospital quick!",
      "created_utc": 1731288451.0,
      "score": 6
    },
    {
      "id": "lwjirwp",
      "body": "ur not gonna die from that",
      "created_utc": 1731305197.0,
      "score": 7
    },
    {
      "id": "lwhbgbf",
      "body": "Are you still here?",
      "created_utc": 1731275443.0,
      "score": 6
    },
    {
      "id": "lwjdwej",
      "body": "They’ll be in out of your system and only cause prolonged agony, need something that has a 7 day half-life none, apron for bleeding out but paracetamol and ibuprofen there’s a reason you can buy it from supermarket",
      "created_utc": 1731302616.0,
      "score": 6
    },
    {
      "id": "lwhjmgc",
      "body": "10 antibiotics ? for what ? \n\nI used 7-8 different ones for more than 2 weeks cause I had an infection with multiple bacterias.",
      "created_utc": 1731278047.0,
      "score": 8
    },
    {
      "id": "lwi56i4",
      "body": "Sorry you feel like this is your last option",
      "created_utc": 1731285457.0,
      "score": 3
    },
    {
      "id": "lwj0vm4",
      "body": "Please stay, I hope you’re okay. I’m here if you wanna talk. I know you don’t know me and I don’t know you but I’m here I’ll listen❤️",
      "created_utc": 1731296980.0,
      "score": 3
    },
    {
      "id": "lwm2ocd",
      "body": "I really wish OP would provide an update if they're still with us. I've been through it too. We all have, or else none of us would be here.",
      "created_utc": 1731347347.0,
      "score": 3
    },
    {
      "id": "lwmecfg",
      "body": "I just spoke a prayer for you. I hope you're okay and that whatever brought you to want to take your life subsides. I was in the same place as you earlier this semester, I know how hard life is and I resist the call nearly everyday to end my life. But this life is good. Life is so, so precious. You are loved and there are so many things you should try to experience in this life. Do not be scared of hell, I do not think you would be condemned there if you truly believe in Jesus as your savior and have tried to follow Him. Please reach out to me if you ever feel like you need someone to talk to. I've been in your situation before, and it's very dark and hard to see reason, but reaching out always, always helps. I promise. You'll be okay, and you are loved.",
      "created_utc": 1731350881.0,
      "score": 3
    },
    {
      "id": "lwh7rc8",
      "body": "I’m planning to do it too, my life is just garbage, I know I’m 14 and I might be too young but I’m done, I just don’t know how to do it, but I will",
      "created_utc": 1731274305.0,
      "score": 8
    },
    {
      "id": "lwhbq65",
      "body": "I only have my looks left too, you're not alone.",
      "created_utc": 1731275531.0,
      "score": 3
    },
    {
      "id": "lwk9wv5",
      "body": "do not od on tylenol/advil/etc. very slow and painful death (unlikely you get to that point) source: fiances first suicide attempt was via 2x 100ct tylenol iirc. terrible way to go out",
      "created_utc": 1731322730.0,
      "score": 2
    },
    {
      "id": "lwl3yqy",
      "body": "That won't kill you, but it will be hospitalize you.",
      "created_utc": 1731336335.0,
      "score": 2
    },
    {
      "id": "lwn66nj",
      "body": "Please don’t do this. ODing is not pain free it’s very scary. I have ODed and ended up in a 2 day coma, came to with at least 5 IVs hooked on to me. I was going into cardiac arrest, and I had a huge seizure. I was diagnosed with BPD after that and not even two weeks later after my attempt, I found out I was pregnant with my beautiful son. That saved my soul. \nPlease don’t do this, there is so so much more to this life. I promise. It may not feel like it but life can be beautiful. Giving up is easy, hope is hard.",
      "created_utc": 1731359377.0,
      "score": 2
    },
    {
      "id": "lwiaoa3",
      "body": "I hope you’re safe..",
      "created_utc": 1731287431.0,
      "score": 1
    },
    {
      "id": "lwj4oav",
      "body": "Please don’t do this tonight 🖤",
      "created_utc": 1731298523.0,
      "score": 1
    },
    {
      "id": "lwlyg8e",
      "body": "I’ll be getting surgery in December to begin the process of fixing the issues that brought me to this sub in the first place. I’m considering saving the oxycodone I get, requesting more and combining it with a 90 day prescription of propranolol which I get for nerve pain. I know for a fact I will have enough to get the job done but I will feel my heart slow down and ultimately stop which I imagine is incredibly scary but I’m too scared to do it any other way, and as fucked up as it sounds I would like to experience the end rather than shooting myself as they just seems too damn quick.",
      "created_utc": 1731346054.0,
      "score": 1
    },
    {
      "id": "lwnpm0p",
      "body": "Please put the pills down",
      "created_utc": 1731365476.0,
      "score": 1
    },
    {
      "id": "lwp3u44",
      "body": "Hell is a man made idea and place.",
      "created_utc": 1731383531.0,
      "score": 1
    },
    {
      "id": "lwpt7g4",
      "body": "I was like you too. There is no point in caring for others by hurting yourself. It's just not worth. The pills will just cause you to be in hospital, possibly with life long liver problems and others. \n\nDon't give a crap about others. Work on yourself, get some anti-depressants and keep yourself busy to things you like to do. Life is too short to dwell on the people that should love you by default, but that's not how it usually works. Hope this helps.",
      "created_utc": 1731396779.0,
      "score": 1
    },
    {
      "id": "lwstrlr",
      "body": "Fearing a mythological place created by human imagination will only cause you more stress. Look for \\*actual,\\* healthy reasons to keep living and if the pain is too much, well, that is up to you to decide. Glad you're ok now though!",
      "created_utc": 1731441317.0,
      "score": 1
    },
    {
      "id": "lx1b9ur",
      "body": "I sure hope 600 Targin (Oxy/naloxone) and 150 ativan (plus a thousand other meds prescribed and OTC) will take this BPD bullshit and me out.\n\nNot tonight, but it is coming - soon - i am so fucking tired.\n\n61 year old, 35+ years of severe chronic pain, deep depression, - havent even been laid in 10 years - why fucking stick around for more daily bullshit? Why do i want to be here? I dont!",
      "created_utc": 1731557119.0,
      "score": 1
    },
    {
      "id": "lx89ro9",
      "body": "i feel u op, its my time to go too, its been too much ",
      "created_utc": 1731656259.0,
      "score": 1
    },
    {
      "id": "lxe5wx4",
      "body": "I’m glad you’re still here.. are you doing ok?",
      "created_utc": 1731736545.0,
      "score": 1
    },
    {
      "id": "m0lrkuq",
      "body": "Pills have one of the highest failure rate. 0/10 dont recommend",
      "created_utc": 1733434031.0,
      "score": 1
    },
    {
      "id": "lwjosdz",
      "body": "Hi I’m here if you need someone to talk to, promise to hold your hand virtually, sending so much love, please don’t go we need you. I tried to do this when I was young, I’m turning 29 in 2 weeks it did get better, I promise. Please talk to me I’m here",
      "created_utc": 1731308689.0,
      "score": 1
    },
    {
      "id": "lwjfck0",
      "body": "Oh I’m excited to go to hell",
      "created_utc": 1731303353.0,
      "score": 0
    },
    {
      "id": "lwjj76p",
      "body": "Go to get help. This stuff will eff you up but I don't think it will kill you. Go to the hospital and tell them you have a plan. Call a hotline and tell them. Keep trying to call people. Do what you can to make yourself feel better. I hope you can overcome this.",
      "created_utc": 1731305434.0,
      "score": 0
    },
    {
      "id": "lwl5tkr",
      "body": "If you have letters to write, you have reasons to stay. Please let us know you're still with us.",
      "created_utc": 1731336978.0,
      "score": 0
    },
    {
      "id": "lwlsvgp",
      "body": "Hey, are you there? Please say you're doing ok",
      "created_utc": 1731344332.0,
      "score": 0
    },
    {
      "id": "lwmgbn5",
      "body": "I had recently overdosed on my prescription pills and nearly died, It was painless and I regret telling someone about it.",
      "created_utc": 1731351486.0,
      "score": 0
    },
    {
      "id": "lwn8dlu",
      "body": "In life, there will be times when no one reaches out to you. You might go a month or even years without a call. However, if you keep trying to call every day instead of giving up after one unsuccessful attempt, eventually someone will answer. If you did what I believe you did, it's tragic that you left us so young. But if you're still here, consider my words: make an effort to call someone every day, reach out consistently, even if it feels like you're failing for years or decades.",
      "created_utc": 1731360047.0,
      "score": 0
    },
    {
      "id": "lwgzza6",
      "body": "Would this work for sure ?",
      "created_utc": 1731272036.0,
      "score": -16
    },
    {
      "id": "lwjfyg4",
      "body": "[removed]",
      "created_utc": 1731303667.0,
      "score": 6
    },
    {
      "id": "lwhchab",
      "body": "[removed]",
      "created_utc": 1731275770.0,
      "score": -21
    },
    {
      "id": "lwkfgqx",
      "body": "I used to use a lot of OTC NSAID because of a back injury. I wound up having ulcers and having to get a blood transfusion. I nearly died, although it wasn't exactly intentional. The doctors told me to stop taking them, and I have.",
      "created_utc": 1731325997.0,
      "score": 16
    },
    {
      "id": "lwmqg7a",
      "body": "After the attempt on your life, did it change any outlook?",
      "created_utc": 1731354571.0,
      "score": 3
    },
    {
      "id": "lwjhlyd",
      "body": "Honestly I think the resurgence we’ve seen of this is based on the idea of meth being so “easy” to make with things you can buy at a drugstore; if you can get high that way then you should be able to get more than high! And the general dystopian feelings if you see news, especially in the US.\n\nBut yes, people need to stop this. They’re only causing themselves more pain in every sense of the word.",
      "created_utc": 1731304549.0,
      "score": 6
    },
    {
      "id": "lwmmd6h",
      "body": "As someone who tried to off herself with 200 benzos and a huge bottle of vodka in the past I woke up the next morning like nothing happened. And I just tried it again without the booze. I'm telling you dude pills won't work I've tried Tylenol too that's not going to be a fun way for you to go you need to get to the ER if you haven't yet. That's where I am right now.",
      "created_utc": 1731353324.0,
      "score": 3
    },
    {
      "id": "lwgxs02",
      "body": "I wish i just had someone to hold my hand through this",
      "created_utc": 1731271422.0,
      "score": 84
    },
    {
      "id": "lwhci8q",
      "body": "I love that response.",
      "created_utc": 1731275779.0,
      "score": 10
    },
    {
      "id": "lwnxsne",
      "body": "i hate how people have to pay for therapy to even get help, it basically encourages suicide",
      "created_utc": 1731368286.0,
      "score": 1
    },
    {
      "id": "lwjiinz",
      "body": "Happy cake day! You’re a good person to still be around and able to encourage others.",
      "created_utc": 1731305052.0,
      "score": 5
    },
    {
      "id": "lwhdzmd",
      "body": "I felt this when I was 14 and all I can say is, everything you've seen in life is just the tip of the iceberg. You're going to clear slate & start over so many times.\nPersonally I'm battling suicide contemplation myself -- but kid you have so much time to work with. Living will always be better than the alternative. I hope we both get to see where the grass is greener.",
      "created_utc": 1731276248.0,
      "score": 23
    },
    {
      "id": "mo6spym",
      "body": "no it's not",
      "created_utc": 1745200045.0,
      "score": 0
    },
    {
      "id": "lwh857w",
      "body": "No.",
      "created_utc": 1731274424.0,
      "score": 20
    },
    {
      "id": "lwhc7h2",
      "body": "he'll just get some severe damage.",
      "created_utc": 1731275683.0,
      "score": 16
    },
    {
      "id": "lwh0kf5",
      "body": "No clue. The last time i tried this way with 50, 500mg tylenols and just passed out for 12hrs before waking up and violently and painfully vomiting it up in the hospital. After reading the effects of taking too much ibuprofen and tylenol, the least it should do is damage my liver to the point of death. Painful, but i could hopefully slip into a coma",
      "created_utc": 1731272197.0,
      "score": 5
    },
    {
      "id": "lwjju9u",
      "body": "[removed]",
      "created_utc": 1731305797.0,
      "score": 16
    },
    {
      "id": "lwhcral",
      "body": "[removed]",
      "created_utc": 1731275859.0,
      "score": 178
    },
    {
      "id": "lwoe1o7",
      "body": "Hard to say. My family made me go to a mental health program a few hours away. Honestly part of me feels like it was made worse because I could see the way I was being looked at differently. \n\nBut this post isn’t about me so I won’t get too into it. Let’s send our love and support to op",
      "created_utc": 1731374008.0,
      "score": 3
    },
    {
      "id": "lwod3oo",
      "body": "[deleted]",
      "created_utc": 1731373674.0,
      "score": 2
    },
    {
      "id": "lwoc98o",
      "body": "[deleted]",
      "created_utc": 1731373371.0,
      "score": 1
    },
    {
      "id": "lwgzhfo",
      "body": "As cliche as it sounds, you've got options. You have reached out to people and haven't gotten a reply or answer at what seems like a tough time for you now. I know what that feels like. I've gone up to a secluded spot in the mountains with my service handgun, ready to say goodbye. \n\nYet, you'd be surprised when that one person you didn't think would come through for you does. Give yourself half an hour before taking any action. It's what kept me here for now at least. Might do the same for you.",
      "created_utc": 1731271904.0,
      "score": 105
    },
    {
      "id": "lwmgsip",
      "body": "I am holding your hand if you’re still with us. I need someone to hold my hand too",
      "created_utc": 1731351628.0,
      "score": 2
    },
    {
      "id": "lwk21e6",
      "body": "A guy named Albert Camus teach me a lot of things about de pleasures of mundanity and solitude. The existencial dread never goes away, but we can find solace in the simple things. And you know I going to do now? A carrot cake. Is a sunny day here Brazil and I am all alone, so I gonna prepare a delicious breakfast for my self, read some books, play some video games and then I go for a walk. I’m happy with the perspective of such a nice day. There’s such inevitable suffering in life and treat myself with care is a rebellious act against a indiferent universe. Suicide or make some coffee? Suicide or take my dog to a walk e play with him? Suicide or CAKE DAY? Suicide or buy a shit surf pranch and learn to surf? I still have my inner thoughts of death,depression e hopeless. Everyday. Everyday. But I will fight out of spite. Like Camus said “plant roses in the desert” I wish all the best for all the member of this group.",
      "created_utc": 1731317463.0,
      "score": 12
    },
    {
      "id": "mohymr1",
      "body": "😂😂",
      "created_utc": 1745355851.0,
      "score": 1
    },
    {
      "id": "lwjjkxv",
      "body": "If your “hope” is a coma I think you’re going to be vastly unhappy with the results. I know I’m posting very late but I hope you actually get some help at the hospital this time. I don’t know you, but I’m sure at your age there is more to you than your looks, and getting to the reason you think that might be the first step towards helping yourself.\n\nTake it from someone who thought the same thing in my late teens/ early twenties. Now I’m midway through my 40s wanting to get out of the hospital (medical, not related to this sub) so I can be back home with my dog.",
      "created_utc": 1731305651.0,
      "score": 8
    },
    {
      "id": "lwmm8qy",
      "body": "You better hope that if you go into a coma you don't get \"Locked In Syndrome\" where you are aware of everything but you have ZERO control over any part of your body till you become as crazy as a person can get I imagine...not exactly a fun way to exist.",
      "created_utc": 1731353287.0,
      "score": 1
    },
    {
      "id": "lwk8mqx",
      "body": "[removed]",
      "created_utc": 1731321924.0,
      "score": 4
    },
    {
      "id": "lwjk6pe",
      "body": "[removed]",
      "created_utc": 1731305990.0,
      "score": 17
    },
    {
      "id": "lwp04ow",
      "body": "Matches, really? That seems so odd. And I mean, you can always drink yourself to death (have a brother that’s been working on it for decades) but that’s just it, it takes a LONG time that way. \n\nI know no one was keeping track of artist oil paint thinner back when I was in college/ early twenties or I definitely would have had issues. But I guess all the oil paint and canvas supplies were a very convincing cover /s",
      "created_utc": 1731382050.0,
      "score": 1
    },
    {
      "id": "lwocfpa",
      "body": "Actually they're harder on your stomach and your kidneys 3 years 3 months and 12 days sober buddy",
      "created_utc": 1731373434.0,
      "score": 2
    },
    {
      "id": "lwkujo5",
      "body": "I really needed to hear this, thank you",
      "created_utc": 1731332823.0,
      "score": 3
    },
    {
      "id": "lwk9e3a",
      "body": "[removed]",
      "created_utc": 1731322408.0,
      "score": 2
    },
    {
      "id": "lwp6ohs",
      "body": "[removed]",
      "created_utc": 1731384730.0,
      "score": 2
    },
    {
      "id": "lwq976n",
      "body": "I’m gonna check those all out, thank you again, you are very right about the cake too!",
      "created_utc": 1731407647.0,
      "score": 1
    },
    {
      "id": "lwuxnlk",
      "body": "And there are an infinity varieties of cakes, so can be a long term strategy against an indifferent universe. Hahahaha",
      "created_utc": 1731467014.0,
      "score": 1
    }
  ]
}