{
  "id": "1hgw2v1",
  "title": "My 10 year old brother tried to kill himself yesterday ",
  "selftext": "He hung himself on the top bunk of his bed, thankfully my dad caught him just as he passed out and saved his life. I don't understand how he even knew to do that.\n\nThere was no indication beforehand that he would do this and I have no idea why he did it. He lives a more normal life than I do ffs hes physically active and has friends and good grades and a supportive family and no prior history of mental illness. \n\nWhen asked why he would do this he just mumbled something about missing his aunt who died a year ago. I doubt that's the only reason but he just keeps saying he doesn't know.\n\nI've been suicidal myself but I've always been too scared to go through with it, he's literally the he last person I'd ever expect to do something like this.\n\nHow do we keep him safe? How do we get him to tell us what's going on? He's such as sweet kid and I'm scared I'm gonna turn a corner and find him dead one day. Help\n\n",
  "created_utc": 1734505100.0,
  "score": 632,
  "num_comments": 45,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1hgw2v1/my_10_year_old_brother_tried_to_kill_himself/",
  "comments": [
    {
      "id": "m2mnnl1",
      "body": "I was actually in the same situation at 11 and my sister found me. First off I’m very sorry for your situation.\n\nI’m my case it was a confluence of factors including being bullied at school so do look into that, but the main thing was a fraught home life.\n\nYou said he misses his aunt- what do you think she represented to him? Is there a possibility that she gave him a feeling of belonging or comfort he now doesn’t have anymore? How is his relationship to mom and dad REALLY? This needs to be reflected very honestly. Is he being neglected? \n\nHow about your depression, are others in your family depressed as well and how might that have affected him?\n\nThis is not coming from nowhere, how could it, now you guys really have to look at and be honest about what you overlooked or ignored. Obviously he need some kind of therapy, probably including parents at some point.\n\nI hope I didn’t overstep boundaries, it’s just that I’ve been in this situation and am now an adult who can look back and hopefully give you some advice, even if that advice is only a bunch of questions you’ll need to reflect on and figure out with mom and dad. I really hope you get through this and all come out feeling better and healthier and nothing else happens",
      "created_utc": 1734508851.0,
      "score": 183
    },
    {
      "id": "m2mksvz",
      "body": "He needs to see a therapist asap.",
      "created_utc": 1734507008.0,
      "score": 351
    },
    {
      "id": "m2ml98j",
      "body": "Something must have happened that you guys are unaware of. This truly devastating. My heart goes out to your family OP.",
      "created_utc": 1734507300.0,
      "score": 121
    },
    {
      "id": "m2na0k8",
      "body": "When I was a suicidal 10 year old it was due to ongoing CSA. I wasn’t bullied really yet at that point, my parents would actually regularly check in with my teachers to be sure because i was so damn listless, but they just didn’t clock what was happening in the home (different family member)\n\ni’m not saying that’s what’s going on, but i AM saying no one else has suggested it as a possible factor. \nUltimately if that’s what it is, and dear fucking god i hope its not, unless you literally catch something in the moment, you’re going to need him to tell you to verify that… just be the safest person to approach if he needs something. Form that bond as best you can if you haven’t already. We listen and we don’t judge—we help and we support. \nI didnt tell anyone til i was a teen because I didn’t want my family split up/in trouble for what was happening to me. Make it clear that you are safe to tell a “secret” to no matter what it is, and make it clear that trusted adults don’t EVER make you keep secrets. \nA lot goes through a kid’s mind in those situations, and most of it is fear of consequence, to them or others. \n\nBest of luck, i truly hope this isn’t what’s happening, but I’d be remiss if I didn’t suggest to look into it. \n\n\nSource: personal experience, was a suicidal ten year old.",
      "created_utc": 1734523355.0,
      "score": 18
    },
    {
      "id": "m2mm7zw",
      "body": "Kids are pretty brutal these days. I’d maybe gently ask him if things are alright at school, if other kids are partaking in similar behavior or are encouraging it, etc.\nI’ve seen stories of kids playing “games” that end in suicide (look up the whale game), kids will sometimes compete to see who can get someone to off themselves first. Scary shit. It’s really sad and scary that a 10 year old felt compelled to do this.\n\nJust horrifying. I’m so sorry OP. I’m glad dad was there to step in—I hope your father is holding up alright. What a sight that must have been, poor guy.",
      "created_utc": 1734507921.0,
      "score": 53
    },
    {
      "id": "m2mvfvo",
      "body": "I’m so relieved to hear that your father found him in time. \n\nThere’s a chance he’s experienced some form of bullying at school. This is a safe place to start the discussion—to see if he’s willing to open up about some of his peer interactions.   \n\nAlso, maybe your parents or you .. or the family can introduce a safe word or safe action—when he’s feeling overwhelmed, or is experiencing self-harm ideations—he can approach them or you in confidence to protect him from himself.",
      "created_utc": 1734514189.0,
      "score": 16
    },
    {
      "id": "m2n3wgm",
      "body": "Is he being bullied by chance?\nTry to find out if that is a problem.\nI was bullied for pretty much my whole life and it has resulted in my many attempts at suicide.",
      "created_utc": 1734519822.0,
      "score": 6
    },
    {
      "id": "m2myjas",
      "body": "[deleted]",
      "created_utc": 1734516323.0,
      "score": 15
    },
    {
      "id": "m2qk7xu",
      "body": "Maybe you two should both get tested for ADHD, and if you have it, your parents need to get tested too. Untreated ADHD has about \\~4x the suicide rate and costs you over \\~10 years life expectancy for various reasons, it's no joke and often overlooked. But it's very treatable.",
      "created_utc": 1734563541.0,
      "score": 3
    },
    {
      "id": "m2sgnp3",
      "body": "Sometimes there isn't a “reason”, depression is a bitch and can appear even when your life seems “perfect” other times, like hers, grief is so hard and distressing it makes one suicidal. Is let him know your there if he wants to talk but don't force it, let him come to you, and actually LISTEN, don't judge, don't try to logic with him or pull the “but your family will be sad if you go” he knows that, and its a ducking selfish and awful response to someone feeling that way. Try to get him into therapy, someone who understands grief would likely be helpful, depending on other things a trip to the family doctor to evaluate whether something like an antidpressant/a child psychiatrist is needed. But fact is, he's not going to just open up, if he does thwn good for him but usually it takes time and you need to physicalt show him you will listen, and sometimes he might not want to talk because he feels like it will bother you. I'm not him but that type of thinking happens a lot with feeling suicidal. Try to see if there are any stressors you can at least reduce if not take away, maybe introduce a concept of mental health days. Set a certain amount per month or whatever time period, and make sure he understands what they are for. Otherwise, when he asks, LISTEN. it is SO IMPORTANT he feels heard and like his pain matters right now. And if you can't listen or do something for him he wants or says he needs, be honest, be gentle, and explain why you can't in age appropriate language. Stress its not his fault for that and he didn't so anything wrong for you to not so said thing as well. You will probably have to remind him a lot about his worth, that he can talk to you/your there to listen, that he matters, his feelings are ok, etc. These feelings are sticky and hard to mentally shake. But he can get through this, and it sounds like you all care about him a lot. But most importantly get him a rherapisr, and let him pick and be involved in the process, he's the one who will be talking to them after all",
      "created_utc": 1734592498.0,
      "score": 3
    },
    {
      "id": "m2r7o4z",
      "body": "Sounds like his aunt might have sexually abused him tbh. Children can grow strong attachments to their abusers especially if they are in the immediate family. And ESPECIALLY if they are young where they don’t understand the concept of bad touches. You need to talk to him about this asap",
      "created_utc": 1734572112.0,
      "score": 5
    },
    {
      "id": "m2r0iex",
      "body": "This makes me so sad because I know what's it like having a brother. Hope you heal OP",
      "created_utc": 1734569479.0,
      "score": 2
    },
    {
      "id": "m2rfjzp",
      "body": "that's sad...",
      "created_utc": 1734575041.0,
      "score": 1
    },
    {
      "id": "m2nqns7",
      "body": "I'm sorry to be that person but of your limited post history, is it possible your brother has seen your depression and suicidal ideation and misconstrued it as an appropriate emotional reaction?",
      "created_utc": 1734530731.0,
      "score": 0
    },
    {
      "id": "m2mou8f",
      "body": "[removed]",
      "created_utc": 1734509634.0,
      "score": -9
    },
    {
      "id": "m2mox8u",
      "body": "I've spoken to my mum about this, yes his school life probably has something to do with it, I don't know all the details yet.\n\nAs for home life, I genuinely don't know what his aunt meant to him, this was the first relative he ever lost, that might have something to do with it. My parents aren't and never have been abusive or neglectful, at least to my knowledge. He has been becoming more angry and talks back to my parents more over the last year or two which my parents thought was puberty.\n\nMy depression is due to my social anxiety, something he doesnt have, and started in my late teens. I wasn't remotely suicidal at 10 years old, so I don't think it's related.",
      "created_utc": 1734509689.0,
      "score": 83
    },
    {
      "id": "m2otth9",
      "body": "To add on. I'm not saying that overly obsessing with the cause is a great idea. If you can pinpoint that's great but it shouldn't cause you to be extremely stressed. You need to also ensure that your not stressing them out when questioning.\n\nSome causes might be being bullied, abuse (even if not present in the household). I would not doubt that your brother might have seemed normal at birth but later developed a stronger mental illness. Being exposed to certain things like drugs, alcohol, even certain chemicals in food or water could exasurbate an underlying condition.\n\nIt's also important to note that physical trauma can also cause a chemical imbalance. The problem with definitively saying the cause is that's its likely a combination of all of it.\n\nI urge your family to not only go to a therapist or psychologist and psychiatrists, but to connect with a PCP that is willing to contribute and help refer your brother to specialists. I would look for someone who specializes in adolsencent depression and has experience with suicide.\n\nGood luck, it may seem hard, but I don't doubt you and your family will recover and eventually all these issues will pass. Depression can be cured, we just have to be mindful of our approach and care for those even when they seem fine as a preventative measure.",
      "created_utc": 1734543804.0,
      "score": 33
    },
    {
      "id": "m2nolvr",
      "body": "[deleted]",
      "created_utc": 1734529925.0,
      "score": -45
    },
    {
      "id": "m2mx9tp",
      "body": "Speaking of the blue whale game, could it be that there’s something going on online, OP? Does he have unmonitored internet access?",
      "created_utc": 1734515459.0,
      "score": 17
    },
    {
      "id": "m2n35c1",
      "body": "Thank you for this info, this should help",
      "created_utc": 1734519351.0,
      "score": 1
    },
    {
      "id": "m2rh5nk",
      "body": "I hadn't thought of this nor knew about such phenomena. Thanks for spreading awareness; it seems like many positive signs of attachment or behavioral tendencies can also be, unfortunately, insidious.",
      "created_utc": 1734575646.0,
      "score": 2
    },
    {
      "id": "m2nupsz",
      "body": "Depression doesn’t spread this way… this is a gross thing to say",
      "created_utc": 1734532272.0,
      "score": 6
    },
    {
      "id": "m2o6xdb",
      "body": "Why is this being downvoted?  Absolutely appalling that everyone isn't saying the same thing.  This is a 10-year-old child who made a very serious suicide attempt, who not only needs psychiatric care but who also needs an emergency neurological evaluation in order to determine the extent of any possible brain damage.",
      "created_utc": 1734536503.0,
      "score": 7
    },
    {
      "id": "m2munsf",
      "body": "I’d say try to find out what he’s angry about what kind of things does he clash heads about with your parents is there a pattern? How do your parents react?\nThe “to my knowledge” part is also key here when it comes to relationship to parents as well as school life. I bet you can figure this out, good luck dude",
      "created_utc": 1734513642.0,
      "score": 40
    },
    {
      "id": "m2o00eg",
      "body": "When my grandmother passed away when I was 8 I went into a deep depression I only realize now for what it was and had a lot of suicidal thoughts and how meaningless life was my grandmother was everything to me so that loss definitely could have triggered a lot in him. I almost didn’t speak to anyone after her passing for over a year to the point my parents got so worried I was seeing a therapist at 9 abt her I’m 30 now and looking back all I remebe is this feeling hopelessness and this pain I couldn’t accept she passed away",
      "created_utc": 1734534169.0,
      "score": 16
    },
    {
      "id": "m2tbj0s",
      "body": "For me personally, I had a pretty good life growing up,  aside from the thing that made we have a very serious attempt at 11. All it took was that one thing, and to this day, I wished I had been successful then",
      "created_utc": 1734611918.0,
      "score": 1
    },
    {
      "id": "m2obpg6",
      "body": "Comments like this are one of the reasons why people don’t seek the help they need.\n\nedit for clarity: comment i replied to said “this is nonsense they need to remove themselves from whatever makes them suicidal”",
      "created_utc": 1734538065.0,
      "score": 19
    },
    {
      "id": "m2s6xm4",
      "body": "& keep in mind that “monitoring” his internet usage can backfire. even if you’re trying to keep him safe, you don’t want to invade his privacy or make him feel like he’s being punished, or that you don’t trust or respect him. you want to make him feel safe asking for help when he needs it, and not like he has to hide his problems for fear of getting in trouble.",
      "created_utc": 1734586896.0,
      "score": 4
    },
    {
      "id": "m2nvli4",
      "body": "I didn't say it spread, depression is obviously not a disease. I am saying that he is a child who is going through something very difficult and doesn't have the necessary coping mechanisms, and it's not impossible to wonder if he looked to his siblings habits and mimicked them or couldn't distinguish the fact they aren't healthy.\n\nI'm not blaming OP. I am saying that the child has clearly had issues and the family haven't been looking close enough to find why. This could be one of many reasons why.",
      "created_utc": 1734532598.0,
      "score": 6
    },
    {
      "id": "m2oblmw",
      "body": "There is a plethora of research that indicates depression absolutely can spread this way, including from one family member to another. Not saying this is what happening for OP and their brother, but this is something that can happen.",
      "created_utc": 1734538030.0,
      "score": 3
    },
    {
      "id": "m2oz5xx",
      "body": "OP posted the same question in r/askdocs and the responses were what I said- he needs inpatient psychiatric treatment and he needs medically cleared since he tried to hang himself",
      "created_utc": 1734545468.0,
      "score": 1
    },
    {
      "id": "m2on40z",
      "body": "[removed]",
      "created_utc": 1734541691.0,
      "score": 0
    },
    {
      "id": "m2oyy9j",
      "body": "I understand that but after a child tries to hang themselves, they absolutely need psychiatric treatment. I’m not sure why I’m being downvoted, since OP posted the same question in r/askdocs, and the answers were exactly what I said- patient needs psychiatric treatment and he needs to be medically cleared, considering he hung himself",
      "created_utc": 1734545402.0,
      "score": 3
    }
  ]
}