{
  "id": "1f7ev2n",
  "title": "My husband won’t let me sleep",
  "selftext": "We have a four month old. Husband gets full night rest, goes on runs, goes climbing, sees friends. I get 4-5 hours of sleep since he was born. I’m not allowed to take a nap. We fight every day in front of our son. I feel awful. I can’t get space. He forces our son on me when I’m crying, when I shower. I begged for sleep this weekend and of course that started a four day fight. I don’t want my son to think this fighting and crying and yelling is normal. I want to die. Everyone thinks my husband is a nice guy. If I was gone my husband would probably be a good dad. I love my son so much and I think he’s better off without me. His family has money and they love my son. I have no family friends money. I have an awful credit score and 10k in debt collection. I don’t see a way out of this.  I feel so sad because I had the potential and plans to be an awesome mom, it’s all I wanted. I love him. But he gets a shell of who I am. His dad curses and yells at me for asking for sleep. I wail and it’s the saddest sound I’ve ever heard. It’s uncontrollable. He just tells me I’m hopeless and stop crying.",
  "created_utc": 1725303636.0,
  "score": 499,
  "num_comments": 106,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1f7ev2n/my_husband_wont_let_me_sleep/",
  "comments": [
    {
      "id": "ll7bw5h",
      "body": "That's abusive.\n\n\nYou're being tortured. Sleep deprivation is torture.\n\n\nYou need sleep. Your husband is a piece of shit.\n\n\nHe knows what he's doing to you. He doesn't care.",
      "created_utc": 1725310012.0,
      "score": 528
    },
    {
      "id": "ll74up6",
      "body": "You are being abused. He is an abuser. Get out safe.\n\nYou are an amazing mother, wanting the best for your child.",
      "created_utc": 1725307654.0,
      "score": 671
    },
    {
      "id": "ll76e05",
      "body": "You’re not allowed to nap? What the hell?? The way you describe your relationship seem very abusive. Maybe if you are able to leave that situation your mental health might improve greatly. This is not a good situation at all.",
      "created_utc": 1725308167.0,
      "score": 98
    },
    {
      "id": "ll7mlbl",
      "body": "I was you. The fighting escalated and became physical and financial abuse. I left him when our son was 1 1/2. I hadn’t slept for more than 2 hours a night in that entire time. You are experiencing abuse. I still feel awful about myself like you do (no money,family,friends) but my son is 7 now. He sleeps 12 hours, no problem. And he needs me. When a boy has a father who is an abusive piece of shit, he needs a kind, gentle, loving mother to balance it out and have a chance at a good life. Or the cycle will continue with him. Stay strong for your baby. It will get easier, I promise…",
      "created_utc": 1725313681.0,
      "score": 136
    },
    {
      "id": "ll6xrjf",
      "body": "[removed]",
      "created_utc": 1725305267.0,
      "score": 159
    },
    {
      "id": "ll75jli",
      "body": "You are being abused, as others have said. Please get out and get out safely.",
      "created_utc": 1725307883.0,
      "score": 134
    },
    {
      "id": "ll7qlht",
      "body": "That’s abuse, please get out of there and safely",
      "created_utc": 1725315118.0,
      "score": 36
    },
    {
      "id": "ll7ltui",
      "body": "No. You HAVE the potential to be a great mom and honestly you’re probably a great mom right now but in this moment of weakness you’ve convinced yourself your not. Your selfish husband is your problem",
      "created_utc": 1725313413.0,
      "score": 30
    },
    {
      "id": "ll8f0u5",
      "body": "He’s not going to be a good dad if he isn’t even stepping up now.  I’m sorry to say but you got a suck ass person.  Sleep when baby is sleeping…get the rest when you can cause it’s much needed. I’d get away when you can…hopefully there’s a light at the end of the tunnel there.",
      "created_utc": 1725324343.0,
      "score": 23
    },
    {
      "id": "ll7fevz",
      "body": "This is not okay at all. You said you don’t have anyone to help, but is there any way you could reach out to his family?",
      "created_utc": 1725311204.0,
      "score": 19
    },
    {
      "id": "ll7sinm",
      "body": "Get out! Pack your stuff and go.",
      "created_utc": 1725315825.0,
      "score": 18
    },
    {
      "id": "ll7k34z",
      "body": "Yeah, he's the piece of shit in that picture, don't blame yourself.",
      "created_utc": 1725312810.0,
      "score": 15
    },
    {
      "id": "ll8gj70",
      "body": "File for divorce and ask for child support even spousal support. I fear your husband would be much worse without you around and then who would be take it out on? Leave that man and take care of yourself and your sweet baby. It gets better!!!",
      "created_utc": 1725324921.0,
      "score": 14
    },
    {
      "id": "ll6u632",
      "body": "Fuck, that sounds like torture. \nWould you husband maybe attend couples therapy? Or spend a weekend caring for your son so he can understand how much you have to do for a baby?\nDon't let him make you think you're not a fantastic mother, you're doing your best and postpartum is HARD.\nWas he like this before you had a child or is this new behaviour for him?",
      "created_utc": 1725304023.0,
      "score": 49
    },
    {
      "id": "ll9p32e",
      "body": "I’m so sorry I’m going thru this too.  My husband berated me for a good 20 minutes straight today without me even saying a word back in defense bc I took the first step to getting myself on track and started an SSRI which is making me feel really fatigued.  He cussed at me and I thought I actually did something good bc I put some stuff in the crock pot for dinner and he just yelled at me right in front my my kids “you think this is fucking dinner?  This is a joke.  You never cook a real dinner…” and I just broke out in tears and tried to get past him and he tried to block me.  I’m a shell of my old self. I don’t see a way out either.  I can really use a friend too if you have any energy for that. At least I’d be happy to listen.",
      "created_utc": 1725345981.0,
      "score": 10
    },
    {
      "id": "ll8tley",
      "body": "Your husband is a complete piece of shit and he’s abusing you. Prepare an exit strategy, file for divorce, spousal support and child support.\nYou are and will continue to be an awesome mom. Don’t ket this prick destroy you.\n\nP.S. he will NOT be a great dad, whether you’re alive or not. He WILL abuse your son too.\n\nP.P.S. Document EVERYTHING. Even if you’re just writing it down.\n\nP.P.S. I couldn’t possibly imagine treating my wife/ child’s mother the way he’s treating you. You absolutely don’t deserve it.",
      "created_utc": 1725329980.0,
      "score": 17
    },
    {
      "id": "ll8nukp",
      "body": "Sleep deprivation,  postpartum,  and taking all around care for a little human who depends on you for everything? I'm so sorry you're going through this, and you need to get out ASAP. Much love hun. I'm rooting for your peace and future as a wonderful mother.",
      "created_utc": 1725327752.0,
      "score": 9
    },
    {
      "id": "ll921au",
      "body": "The reason you’re thinking these horrible things about yourself is because you’re sleep deprived. What your husband is doing to you is not normal, it’s straight up abuse. Is there anywhere you could go to be safe? A friend or parent maybe?",
      "created_utc": 1725333492.0,
      "score": 7
    },
    {
      "id": "ll7j8r4",
      "body": "This is against the Geneva convention . You should move out.",
      "created_utc": 1725312520.0,
      "score": 6
    },
    {
      "id": "ll7ny4i",
      "body": "Listen to the little shaman on YouTube, you need to educate yourself on what's happening, you aren't alone and there is a way out",
      "created_utc": 1725314161.0,
      "score": 8
    },
    {
      "id": "ll7twkg",
      "body": "This is absolutely abuse! Sorry to say it, but he is an asshole! He should be helping you more. You are human, you NEED sleep! How does he justify any of this? You are a wonderful mom doing her best, but you need time for yourself too! That’s normal! I’m so sorry you’ll dealing with this. You deserve so much better!",
      "created_utc": 1725316347.0,
      "score": 7
    },
    {
      "id": "ll8haie",
      "body": "Nah he is an ass now and he's gonna be one later\n\nTell his mother abt the situation and  ask for her help",
      "created_utc": 1725325214.0,
      "score": 7
    },
    {
      "id": "ll6wm59",
      "body": "What country do you live in ? Many countries provide help for those kind of situations ! Maybe somewhere you could go during the day and rest ? Like a mother - child - centre ? Where social workers can help you ?",
      "created_utc": 1725304867.0,
      "score": 20
    },
    {
      "id": "ll9s9pe",
      "body": "I have not been in your situation. I can't pretend to understand what you are going through.\n\nBut I have been suicidal. I *promise*, I personally *guarantee* that your son would *not* be better off without you. That's what sleep deprivation and mental illness does to your brain. Invariably, suicidal people begin to feel that those whom they love and who love them would be better off without them. I've been there. You genuinely feel like you would be doing others a favour, with the added bonus of your not having to be in pain anymore. This is false. This is patently false. This is mental illness and pain telling you lies to make an incredibly difficult situation make more sense. It is simply not true.\n\nBased on what you have said in your post, you are a fantastic mother. You and your son have the right to experience that to the fullest - you are being denied that right for reasons outside of your control. That has not stopped you from being a mother who loves her child, who wants the best for her child, and is doing the best for her child under unworkable conditions. But if you're not in the right frame of mind to understand that yet - which is okay - just remember a baby is always going to be better off with even an iffy mother than no mother. You can do this, with the proper support. You need to understand that your husband is at fault, not you.\n\nPregnancy and childbirth are so incredibly rough physically, mentally, hormonally, that even people with all the support in the world can be absolutely overwhelmed by it. The amount of stress you are currently under, there is absolutely no way you could possibly expect yourself to be okay. I know it's hard, but try to see that. Imagine a friend came to you saying they were experiencing what you are - how would you regard them? This is how you should try and view and treat yourself as much as you can.\n\nAll of these internet strangers have your back. We can say the right things. However, you need practical, real-world support. To let you sleep. To give you perspective on your husband's actions and your importance in the world. Please think on who that could be. A friend. A family member. A hospital that puts you in touch with resources. A crisis centre. Please reach out to someone as soon as you can. There are people who will be honoured to help.",
      "created_utc": 1725348056.0,
      "score": 4
    },
    {
      "id": "ll923o0",
      "body": "Listen, things feel hopeless bc you’re sleep deprived. You need to do whatever you can to get out of that situation. Divorce him & take half his $, split custody.",
      "created_utc": 1725333521.0,
      "score": 5
    },
    {
      "id": "ll99o8d",
      "body": "Any update OP? Are you ok? 100% agree, this is abusive behavior and it’s not okay for your mental health. It’s also taking away from your ability to show up for your baby the way you want to. He needs to do better, or else you deserve better. I hope you can be kind to yourself and know that you are so loved and needed by so many in your life. <3",
      "created_utc": 1725337112.0,
      "score": 4
    },
    {
      "id": "ll9fv5y",
      "body": "This happened to me as well. It gets worse. The abuse will never stop. I get called b\\*tch in front of my child all the time. Told how I'm useless. My child sees the physical abuse. Since I don't cry, he thinks it's a game and joins in. I want to die. I plan on dying. Please get out before you're just like me.",
      "created_utc": 1725340431.0,
      "score": 4
    },
    {
      "id": "ll9rxdw",
      "body": "He's already a horrible dad. You can escape this",
      "created_utc": 1725347822.0,
      "score": 4
    },
    {
      "id": "ll9st32",
      "body": "Get the f**k out of there right now",
      "created_utc": 1725348426.0,
      "score": 5
    },
    {
      "id": "ll9vn7j",
      "body": "I'd say start recording things get evidence to bring up in court. Don't jump the gun. Try and get full custody of your child. The more evidence you have the more you can use against him in court. \n\nThis is abuse, and you need rest. \n\nAsk for a lawyer and ask what you can do to get help. Usually this takes money. But I think it's the only valid option you have for in the long run.",
      "created_utc": 1725350372.0,
      "score": 3
    },
    {
      "id": "lla6wl4",
      "body": "Hi sweet girl, it doesn't get better. I've been with one of those while my kiddo has grown up - hes 2.5 now and just getting over an ear infection. I've stayed up every night with him. I took him to his doc appointments. I took him to the hospital. I average 5 hours of sleep on a good night just because I'd also like an hour or two to myself each night/morning. I'm perpetually exhausted and I dont see it improving. Leave while kiddo is smaller. Please. It does not get easier.",
      "created_utc": 1725358027.0,
      "score": 4
    },
    {
      "id": "llctbwa",
      "body": "My husband has done similar things to yours. Our son is three now. I still have never enough sleep, no money, I don't have friends because I don't have a spare minute to socialise while he's out all week with his friends. It's not going to get better. Get out of there and take your child while you can. You can't trust him to be a good father without you, but you can trust yourself to be a good mother because you're already giving your child everything you have to give.",
      "created_utc": 1725392619.0,
      "score": 4
    },
    {
      "id": "ll6x1jy",
      "body": "Truly sorry you’re going trough that, you deserve to be heard, to sleep to regenerate emotionally to be happy! Congratulations on your son and you being so kind and strong, theres a path to a better life i promise even with no money some debt no friends promise theres always a way to a better life! \nIf i can help i’ll try to look up some hotlines for you let me know!",
      "created_utc": 1725305015.0,
      "score": 3
    },
    {
      "id": "ll8vhj7",
      "body": "This is abuse. Leave",
      "created_utc": 1725330740.0,
      "score": 3
    },
    {
      "id": "ll9hrie",
      "body": "I hope you get can far away as possible from that sorry pos and still have your son in your life. Be safe",
      "created_utc": 1725341521.0,
      "score": 3
    },
    {
      "id": "ll9j90a",
      "body": "What do you mean, ‘you aren’t allowed to nap?’",
      "created_utc": 1725342385.0,
      "score": 3
    },
    {
      "id": "llakc3g",
      "body": "OP - he’s a terrible father with you doing literally everything-you being out of the picture will ONLY result in your sweet baby being abused.\n\nYour scenario is very similar to what my brother and his now ex-wife are going through…my brother has built a fake ‘perfect’ exterior personality to gaslight his ex that since everyone else thinks he’s amazing, she’s clearly in the wrong when she’d try to point out abuse. She stayed 17 years. Things did not get better. My niece has been abused and I think will always be a different person than she should’ve been. It took all of us far too long to realize what a monster my brother is. \n\nPLEASE get out, and keep putting one foot in front of the other. I know how overwhelming that can feel, but your life and your baby’s life will be infinitely better without him!\n\nLeave your husband by starting a new life with your son, don’t leave him and your son by taking your life. Sending you and your baby hugs 🫂",
      "created_utc": 1725365116.0,
      "score": 3
    },
    {
      "id": "llcbr44",
      "body": "Actually, your son is better off without your husband. And so are you.",
      "created_utc": 1725386991.0,
      "score": 3
    },
    {
      "id": "losx59y",
      "body": "It's getting worse. He now doesn't care how sick you are, and is willing to abandon the baby while you're at the ER.\n\nPlease reach out to a loved one for help. If you are fairly alone, reach out to me and I'll help personally if I'm close enough. If I'm not, I will find resources and set something up for you and your baby.",
      "created_utc": 1727235771.0,
      "score": 3
    },
    {
      "id": "ll6xxku",
      "body": "Wow, this sounds like a torturous situation and your husband not supportive at all.\n\nIs it possible you're also suffering from post partum depression?\n\nIf you can get help where you are, please seek it out.\n\n\\*sending you strength\\*",
      "created_utc": 1725305324.0,
      "score": 9
    },
    {
      "id": "ll84qhl",
      "body": "I've been there",
      "created_utc": 1725320442.0,
      "score": 2
    },
    {
      "id": "lla1dtx",
      "body": "This is not your fault. Your reactions are a product of the situation you are in. If you remove yourself from the situation you WILL improve. Even if it’s hell at first. At least it will be a hell you choose for yourself and will actually benefit you at some point.",
      "created_utc": 1725354342.0,
      "score": 2
    },
    {
      "id": "lla2u3p",
      "body": "Section 8 will help you with an apartment but you have to get a divorce. If you use legal aid they will try to insist on 50/50 custody. It’s up to you if you’re ok with that. Personally I would be recording him screaming at me surreptitiously and use it to bolster my divorce proceedings. If he gets partial custody, he’ll have to pay you child support. You could possibly also get alimony. The most important step rn tho is to realize you cannot stay in this situation.",
      "created_utc": 1725355349.0,
      "score": 2
    },
    {
      "id": "llag55q",
      "body": "I feel for you 1000%. My son was an angel, slept a lot and rarely cried. Then 10 months later came my daughter who cried 24/7 and needed constant holding and attention. Naturally, my husband joined me army 2 months before she was born so I had to do ALL of it by myself. Just the 3 of us til she was 7 months old. So the sleep deprivation thing.. it SUCKS. But as far as the way your husband treats you.., that’s terrible and there’s no excuse for it at all. I would definitely consider what the other people are saying. I just wanted you to know that I completely understand how hard it is but it WILL get easier so please leave him . Don’t leave your baby or this world. It Will get easier I promise",
      "created_utc": 1725363155.0,
      "score": 2
    },
    {
      "id": "llagmcv",
      "body": "I’d legit start handing him the baby to watch and go sleep in the car.",
      "created_utc": 1725363390.0,
      "score": 2
    },
    {
      "id": "llakwa0",
      "body": "Please take your son and leave. This is torture.",
      "created_utc": 1725365373.0,
      "score": 2
    },
    {
      "id": "llavca6",
      "body": "Honey leave this “man”. Take your baby with you. He’s NOT a good guy and would NOT be a good father if you were gone - your child would be cast aside and forgotten about. Leave him. Find yourself. Love your baby.",
      "created_utc": 1725369661.0,
      "score": 2
    },
    {
      "id": "llbqj0m",
      "body": "He is doing this to you on purpose to feel powerful. Sleep is a fundamental need like food. Get away from this man, he does not have you or your child’s best interests at heart. \nPerhaps look into women’s shelters or shelters emergency housing for DV victims?",
      "created_utc": 1725380214.0,
      "score": 2
    },
    {
      "id": "llbry4j",
      "body": "This is a glimpse into the rest of your life and your child’s life with him. \n\nYou need to look into separation and divorce.\n\nYou need to find a local women’s shelter, take only what you can fit in a bag and go. Important paperwork is the most vital. The shelter WILL help you with everything else. I swear.",
      "created_utc": 1725380671.0,
      "score": 2
    },
    {
      "id": "llepl6h",
      "body": "This is abuse. To a horrible degree. I’m so sorry OP. Sleep does wonders for ideation and depression. Do you have family or friends you can stay with right now?",
      "created_utc": 1725417718.0,
      "score": 2
    },
    {
      "id": "llozs82",
      "body": "Asking for sleep... Energy to fight and wail... Hmmmmmmm",
      "created_utc": 1725571257.0,
      "score": 2
    },
    {
      "id": "lm3x6ct",
      "body": "Your son wouldn’t be better off without you. If your husband is abusing you, he would abuse your son too.",
      "created_utc": 1725801154.0,
      "score": 2
    },
    {
      "id": "lmb9fof",
      "body": "I’m 17 so I don’t really know how marriages and stuff works yet, but to me it sounds like you need to run and fast. Go get like a part time job or something and save up so you can get out of there. This sounds abusive on his part, and sorry to offend you, but your husband sounds like a douchebag and a piece of work, if he has the time to hang with his friends, he can handle a fucking baby for a few months until he can prove to you that he’s changed. I know it’s gonna hurt, but you gotta do what you gotta do to live a good life. Don’t let your husband control you, run away, do anything you can to get some time for yourself. He may not appreciate it, but he can go fuck himself. You’re worth more than that! Stay strong fellow queen. We girls deserve supportive husbands! 👑✨💖",
      "created_utc": 1725905651.0,
      "score": 2
    },
    {
      "id": "ll8ad7c",
      "body": "It’s not ideal. But separation with shared custody will give you a consistent reliable kid free break to catch up on yourself",
      "created_utc": 1725322582.0,
      "score": 2
    },
    {
      "id": "llac6bf",
      "body": "Op you need to file for divorce. It’s best for you and your son if this is what’s happening. No loving partner should be talking to you that way.",
      "created_utc": 1725361114.0,
      "score": 1
    },
    {
      "id": "llad35i",
      "body": "I’m sorry, I’m not going to make this out as a “oh just leave him lmfao” case, you have a child, and it’s never that easy. I’m not very experienced in this, I don’t know how to handle abuse situations, but I do hope that you can reach out to a friend or contact someone who can help you. Wishing you the best ❤️‍🩹",
      "created_utc": 1725361603.0,
      "score": 1
    },
    {
      "id": "llbdbxl",
      "body": "If you get a chance, keep us updated OP. Stay safe and stay strong. 💜",
      "created_utc": 1725375931.0,
      "score": 1
    },
    {
      "id": "ln20yk0",
      "body": "You are already seeing what kind of dad he is: a bad one. You're already raising your child on your own, so just leave. It will be easier once every day isn't a fight. ",
      "created_utc": 1726301914.0,
      "score": 1
    },
    {
      "id": "m1ico8b",
      "body": "I don't even have words... \nThis is NOT okay in any way, shape or form. Please try to make an escape plan for yourself and your son. Help is out there. Please be safe.",
      "created_utc": 1733916622.0,
      "score": 1
    },
    {
      "id": "llb543f",
      "body": "Please try to find a high paying job, or set up a business, it’s difficult but I think you can do this…then move out with your child.",
      "created_utc": 1725373171.0,
      "score": 1
    },
    {
      "id": "ll7z3fb",
      "body": "Op, I was trying to find the nicer way to say every single point in this comment.\n\nLook, your husband views you in a way that makes you feel less than, subliminally (this is called abuse) which is why you feel like you’re the only person seeing him this way. He’s also avoiding his fair share of responsibility for your child, so no, you leaving your child to him and his family would not see the happy ending you think it will.",
      "created_utc": 1725318300.0,
      "score": 150
    },
    {
      "id": "llaldd1",
      "body": "How is she supposed to get out? She has no money and no connections",
      "created_utc": 1725365588.0,
      "score": 15
    },
    {
      "id": "ll7nhqo",
      "body": "How did you leave? If I could find a way out, I would. I’ve tried the police four times already and they just say I have ppd and don’t do anything. He also pretended to be me and sent a text from my phone saying I’m going to kill myself and the baby. I would never do that. I feel trapped",
      "created_utc": 1725313999.0,
      "score": 30
    },
    {
      "id": "ll7xrck",
      "body": "This is past couple therapy, he's abusing her. Sleep deprivation is a form of abuse (litterally also a form of torture).",
      "created_utc": 1725317796.0,
      "score": 75
    },
    {
      "id": "llaw4jz",
      "body": "Are you seriously saying this sounds like torture and then encouraging her to STAY?! Tf?",
      "created_utc": 1725369959.0,
      "score": 3
    },
    {
      "id": "llawk31",
      "body": "do not suggest couples therapy when there is an abuser involved. he will weaponize it against her. right now she needs to get away from him.",
      "created_utc": 1725370121.0,
      "score": 3
    },
    {
      "id": "llavj8s",
      "body": "This. I had a boyfriend who pulled similar (though thankfully there wasn't a child involved) and his family actually helped me get out. If they're kind, decent people other than having raised this...person..., they may be willing to help.",
      "created_utc": 1725369735.0,
      "score": 3
    },
    {
      "id": "ll7iyyb",
      "body": "[removed]",
      "created_utc": 1725312427.0,
      "score": 25
    },
    {
      "id": "lle1b3q",
      "body": "I’m still here. I really didn’t expect all of these responses and I’m taking it all in to try and find a better way forward",
      "created_utc": 1725408418.0,
      "score": 3
    },
    {
      "id": "loxk1fo",
      "body": "I hope you don’t give up and can get you and your child away from this man. You deserve a life free from this horrible abuse",
      "created_utc": 1727304006.0,
      "score": 2
    },
    {
      "id": "ll9zzz0",
      "body": "I was wondering the same thing. Can you nap with the baby? Is your husband at home with you? How would he know if you napped while he was at work?\n\nSleep deprivation makes me consider offing myself. It was bad post-partum. My husband and I took turns taking care of our infants so we could get sleep. I slept in and took naps as our schedule allowed.\n \nSleep is therapy. A partner who tells you whether you can rest or not is abusive. Constantly arguing about this must be so incredibly stressful. Please talk to someone irl and get away if you are able.",
      "created_utc": 1725353380.0,
      "score": 4
    },
    {
      "id": "ll75lr0",
      "body": "How can you miss the fact that the husband is clearly abusive? And you're telling her how she can fix her own life without getting the abuser out of it?",
      "created_utc": 1725307903.0,
      "score": 16
    },
    {
      "id": "ll9b0fk",
      "body": "Her child should be nowhere near this man.",
      "created_utc": 1725337804.0,
      "score": 4
    },
    {
      "id": "llap3a2",
      "body": "If she's married, marital funds are legally hers to utilize. If she doesn't have access to those funds she needs to either reach out to a shelter or her state bar association for a family lawyer who will work using marital funds once she is granted access by a judge/divorce, or ideally do both. \n\nThat's all a lot easier said than done, especially when severely sleep deprived, but she does have options.",
      "created_utc": 1725367188.0,
      "score": 42
    },
    {
      "id": "loqs3q9",
      "body": "There are MANY resources available to women in domestic violence especially with a child. I went from having thousands of dollars & anything I wanted to living in a section 8 apartment and making $10 extra after paying my bills because I couldn’t live with my son seeing this kind of same abuse. \n\nYou do what you have to, to protect your child",
      "created_utc": 1727207703.0,
      "score": 2
    },
    {
      "id": "llavta3",
      "body": "Is there a shelter near you? If you can take your baby and make it to the shelter, they will help you take care of things from there.",
      "created_utc": 1725369840.0,
      "score": 21
    },
    {
      "id": "llb070d",
      "body": "If you are in the US findhelp.org will show you the resources available.",
      "created_utc": 1725371464.0,
      "score": 11
    },
    {
      "id": "llcgtyi",
      "body": "call a woman’s shelter get you and ur boy safe, please",
      "created_utc": 1725388619.0,
      "score": 6
    },
    {
      "id": "llc4n33",
      "body": "Idk where you are located but it might worth looking for a local domestic violence support program near you. They have resources and usually can help guide women in your situation. I'm so sorry you're even dealing with this.",
      "created_utc": 1725384731.0,
      "score": 1
    },
    {
      "id": "llcgc4h",
      "body": "Are there domestic violence shelters where you live? If you have no friends or family you can move in with.. \nI lived with a work colleague after leaving him and after sorting out the legal stuff with a mediator present, he agreed to pay maintenance for our son which I use for rent. The country I live in also provides welfare for single parents and a rent supplement. \nIn the meantime be sure to record everything. Write down every fight, everything he says.",
      "created_utc": 1725388461.0,
      "score": 1
    },
    {
      "id": "lla2isk",
      "body": "credit score -> american",
      "created_utc": 1725355131.0,
      "score": 3
    },
    {
      "id": "llvcrwd",
      "body": "Glad you're still here! Your baby needs you! (not their dad). Post us an update with what you decide to do",
      "created_utc": 1725662770.0,
      "score": 1
    },
    {
      "id": "lnogsto",
      "body": "I am so glad you are still here <3 keep us updated (if you want to). You are able to get through anything, no matter how hard, no matter what you choose to do. Just choose what is best for YOU.",
      "created_utc": 1726629133.0,
      "score": 1
    },
    {
      "id": "lldrrfw",
      "body": "Sleep deprivation is something they use for torture in the military.",
      "created_utc": 1725404581.0,
      "score": 3
    },
    {
      "id": "ll76054",
      "body": "I am not missing that, I think so as well. I just don't have enough information to say that he's \"clearly\" abusive.\n\nAnd getting help would potentially also deal with that.",
      "created_utc": 1725308038.0,
      "score": -6
    },
    {
      "id": "ll76c65",
      "body": "It's very like a certain gender to not recognize or to question whether or not it's abuse. What she put down is clearly abusive.",
      "created_utc": 1725308150.0,
      "score": -8
    },
    {
      "id": "ll77c2l",
      "body": "\"It's very like a certain gender to not recognise\"... so afab non-binaries don't get that in your opinion? Interesting take \\*rolls eyes\\*\n\n\nAnd what about my response is so wrong that you feel the need to come at me? \n\nI asked if she \"also\" might have post partum depression, which might make the whole situation worse.\n\nAnd then asked to seek out help.\n\nSeriously, tell me what's wrong about it. Or better yet, leave me the fuck alone, you wannabe mind (and gender) reader.",
      "created_utc": 1725308485.0,
      "score": 1
    }
  ]
}