{
  "id": "1e2wss2",
  "title": "I wanna kill myself ",
  "selftext": "I'm 15 and I did a very stupid thing, me and a girl from my class were \"dating\" while texting she told me to send explicit photos I rejected at first but she kept insisting and I eventually did, she has shared those photos with her friend group and they are now threatening me with the photos and how they would share them with people if i didn't do what they ordered, a few days ago they told me to do sexual things with them I said no they are now threatening me on how they're gonna tell people I raped one of them. I don't wanna do this anymore i wanna kill myself but I don't want to be an embarrassment to my parents please help me I don't know what to do I'm an absolute mess\n",
  "created_utc": 1720943654.0,
  "score": 596,
  "num_comments": 117,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1e2wss2/i_wanna_kill_myself/",
  "comments": [
    {
      "id": "ld44ofi",
      "body": "Get the police involved",
      "created_utc": 1720947281.0,
      "score": 734
    },
    {
      "id": "ld48r5f",
      "body": "If they blackmailed you into doing sexual things then they have sexually assaulted you. Get the police involved asap.",
      "created_utc": 1720950154.0,
      "score": 490
    },
    {
      "id": "ld4nin0",
      "body": "Police! NOW!\n\nBlackmail, extortion, possession and distribution of sexual material involving minors, intent to falsely accuse of sexual assault, those girls are VILE!\n\nIt is sad how thousands of teenagers are in your position, regardless of gender (more girls in general, but that's not the point). Do not hurt yourself. Do not blame yourself. It's disgusting what is happening to you.\n\nAnd do not care about them. Don't feel bad about how \"you ruin their lives\". They are criminals and horrible human beings. There is no age to start being a piece of shit. They have no excuse.\n\nPOLICE! IMMEDIATELY! NO MATTER WHAT! DON'T ANSWER THEM, DON'T CONTACT THEM!\n\nNOW! NOW! NOW! IT IS URGENT!\n\nEDIT and keep us updated if possible. I know sometimes during an investigation the police might limit what you are allowed to say online, even anonymously, but as soon as possible, we'd like to hear back from you. Stay safe\n\nEDIT2: In the moment, your parents might get angry with you, tell you things like \"how stupid can you be\", please do not take it at heart. I don't know the relationship you have with them, but even the most loving and understanding parent can have this sort of answer. They feel stressed, they feel powerless, they feel guilty. They have all kind of scenarios in their head, they get worried, they lash out. Do not ever use that response in that moment to think \"I knew it, I'm a failure and a disappointment, they hate me\". Please. Do not be afraid of talking to them, do not feel shame. You need support. \n\nI know myself and I can see myself telling my kid they've been stupid. I'd still be proud that they took the decision to denounce and speak up and so glad they would talk to me about it and ask for my support. Mistakes do not define you. A stupid mistake doesn't make you stupid for life. And regardless, you're the victim here anyway, you don't ever have to blame yourself.\n\nIf for any reason you cannot trust your parents or another adult in your family, any other responsible adult will do. A teacher, a coach, a social worker, etc. Still go to the police regardless.",
      "created_utc": 1720959324.0,
      "score": 228
    },
    {
      "id": "ld48jmj",
      "body": "Do NOT hurt yourself. Go to the Police ASAP",
      "created_utc": 1720950006.0,
      "score": 123
    },
    {
      "id": "ld4fryw",
      "body": "That's sextortion get the police involved immediately screenshot everything for evidence",
      "created_utc": 1720954900.0,
      "score": 60
    },
    {
      "id": "ld43pd2",
      "body": "Well if they have child porn (because you’re under 18) of you on their phone that’s illegal. I’m not sure how to go about this as I’m not well versed in the law, but if they’re blackmailing you with underage nudes they can get in big trouble (I think the laws are different for minors possessing underage nudes in different states so check your local laws). Don’t tell them if you go to the police as they will delete the images probably. Idk. This is sorta complicated. But you deserve to be protected. They are trying to rape you essentially and blackmail you. You are in danger. If they share your images with anyone, they will be in BIG BIG BIG trouble with the law. So they might just be bluffing.\n\nBut regardless, to be safe I’d call the non emergency police number in your area and maybe ask them about it. Stay safe. ❤️ I’m so sorry this is happening to you. Tell adults you can trust so they can get you the help you need.",
      "created_utc": 1720946617.0,
      "score": 91
    },
    {
      "id": "ld40rri",
      "body": "So what they are doing is considered “Blackmail” and it’s a super illegal crime to commit. Especially since you are all underage. I know it might be embarrassing for you but these girls are abusing you and manipulating you and you MUST tell your parents. Explain what happened, explain that you felt extremely pressured into sending what you sent to them because they asked for it harassing you until you gave into it. And make sure to have screenshots on your phone or device of them asking for it, and their conversations with you, that’ll help you in the long run",
      "created_utc": 1720944609.0,
      "score": 109
    },
    {
      "id": "ld4a1ih",
      "body": "Go to the Police and please keep us updated!",
      "created_utc": 1720951058.0,
      "score": 33
    },
    {
      "id": "ld50dpx",
      "body": "Screenshot absolutely everything as it will be serve as evidence. And I mean everything. What they are doing is illegal, and just screenshots of the threats is enough. Contact police, and they will probably get you a lawyer for free considering you are the injured party in the case. If you get a really good lawyer you can sure them and get economical compensation. Fuck em.",
      "created_utc": 1720965214.0,
      "score": 30
    },
    {
      "id": "ld4rttj",
      "body": "Fuck I'm so sorry for you. That shit happened to me too. Listen, talk to the police. You're not a mess, that girl IS. You didn't even wanna send those pics, she just manipulated you. It's gonna be okay.",
      "created_utc": 1720961473.0,
      "score": 22
    },
    {
      "id": "ld49ipz",
      "body": "U can complain to the police. U have tge texts if them asking for the picture and them blackmailing you. Definitely dont give in to their demands cuz then theyll acutally have shit on you. Never give in to blackmailers. Its pure sexual harrasment and if they make you go thru with anything then its sexual assault. Its erious. You shouldnt kill yourself over it. Theyre the bad ppl here. Fuck them.\nTell a trusted adult and the police and tell them to fuck off.",
      "created_utc": 1720950694.0,
      "score": 12
    },
    {
      "id": "ld4gs9c",
      "body": "1. I am so sorry you’re going through this, it’s incredibly awful and not ur fault! 2. Pls tell ur parents, I’m sure they’ll help out and they would want you to be alive. 3. Go to the police! They’ll get them in trouble and you won’t ever have to deal with them again. This is a solution to this problem but death isn’t! Ur life is more important. I know this is scary but that really isn’t the right way to go about it. They’re in the wrong you aren’t!",
      "created_utc": 1720955525.0,
      "score": 13
    },
    {
      "id": "ld473um",
      "body": "First of all you will try to get all the evidences that prove this case such as the phone that has all the conversations between you or try to record while they are talking to u about this then report, ik it's hard to let ur parents know this but trust me no one can find a solution more than ur parents. and please keep ur thoughts far from suicide, ur life doesn't stop because of this",
      "created_utc": 1720948989.0,
      "score": 25
    },
    {
      "id": "ld4givz",
      "body": "Complaint to your school before they do",
      "created_utc": 1720955368.0,
      "score": 25
    },
    {
      "id": "ld52qvr",
      "body": "Killing yourself solves nothing - so you took a chance on someone you thought was a good person and obviously wasn’t - that’s not your fault. We do silly stuff when we have feelings for someone and we expect good feelings in return. You made a mistake. We ALL DO. But dying for that stupid bitch isn’t worth it.\n\nHold your head up high - be proud of what. Beautiful person you are and I promise you KARMA will pay a visit to that nasty girl and you will continue to move forward into a life you choose.   There is so much out there to discover don’t throw it away over a stupid mean person.  You are awesome - tell yourself that EVERYDAY and it will sink in lol\n\nJust stay with us - I walked you walk and am so glad I failed at it. I have so many cool things in my life now - 59 years of ups & downs - but promise it’ll be cool 💕",
      "created_utc": 1720966150.0,
      "score": 11
    },
    {
      "id": "ld4g9wk",
      "body": "They are the ones who should pay for it not you. Get all the evidence and f them!",
      "created_utc": 1720955214.0,
      "score": 10
    },
    {
      "id": "ld5kl64",
      "body": "Please get the police involved, this is child exploitation. They Will get in SO much more trouble than you can imagine. Seriously, no one will blame you or look down on you. You were tricked and are being manipulated and blackmailed. Please please call the police, cyber crimes division. Stay strong",
      "created_utc": 1720972634.0,
      "score": 8
    },
    {
      "id": "ld4y8xg",
      "body": "Everybody here has already given you the advice.  Be gentle on yourself, it's the age we can make mistakes.  It's disgusting and criminal behaviour from the girls.  It's difficult but you will get through it.",
      "created_utc": 1720964332.0,
      "score": 8
    },
    {
      "id": "ld5mvq1",
      "body": "I think it's better to get the authorities involved as that's basically CP that they have",
      "created_utc": 1720973434.0,
      "score": 7
    },
    {
      "id": "ld6n5iz",
      "body": "I'm pretty sure this is what is (not only) called revenge porn for them to have those photos of you but also... Child porn, they more than like are the one who can actually be in VERY deep shit. You don't deserve this, you will survive this- I don't know your parents, but if someone did this to my kid, I'd be father bear all the way on their ass.",
      "created_utc": 1720985873.0,
      "score": 8
    },
    {
      "id": "ld4yaob",
      "body": "don’t do anything to yourself. call the authorities and an adult you trust immediately!!!",
      "created_utc": 1720964352.0,
      "score": 7
    },
    {
      "id": "ld5w7l0",
      "body": "You can sue them for so many things contact police and gather as much information as you can.",
      "created_utc": 1720976612.0,
      "score": 7
    },
    {
      "id": "ld6h94n",
      "body": "You need to tell your parents if you trust them. Or some adult that you trust. Please don’t hurt yourself over this. I’m so sorry this happened to you.",
      "created_utc": 1720983779.0,
      "score": 6
    },
    {
      "id": "ld4yzyp",
      "body": "That is blackmail and sexual extortion, please seek a trusted adult/school official to talk about this. Keep all evidence on your phone. Avoid those peers of yours if possible.",
      "created_utc": 1720964645.0,
      "score": 4
    },
    {
      "id": "ld53cyq",
      "body": "Blackmail AND cp? Please go to the police with this",
      "created_utc": 1720966389.0,
      "score": 6
    },
    {
      "id": "ld6us16",
      "body": "Many states in the U.S. have sextortion laws. I read a story about Nigerians who did this to an American boy who did commit suicide and they got charged for it. I think they may have been extradited to the USA but I’m not sure.",
      "created_utc": 1720988910.0,
      "score": 5
    },
    {
      "id": "ld6veew",
      "body": "Please contact a trusted adult or your parents. It will be difficult at first but they are your parents so they be angry at first but they will understand what you are going through and after that is done contact the police and file a police report regarding these girls who are trying to extort you.",
      "created_utc": 1720989147.0,
      "score": 5
    },
    {
      "id": "ld5lhz4",
      "body": "Get proof, alot of proof",
      "created_utc": 1720972954.0,
      "score": 4
    },
    {
      "id": "ld5mskx",
      "body": "please involve the police!! they are not worth your life",
      "created_utc": 1720973405.0,
      "score": 4
    },
    {
      "id": "ld6a4np",
      "body": "Another important thing to mention, don’t tell them you’re telling the cops. It will be seen by the cops as a threat (although this is my experience and I’m not sure it’s like this everywhere but for your sake and safety don’t)",
      "created_utc": 1720981325.0,
      "score": 4
    },
    {
      "id": "ld6fo5a",
      "body": "Please contact the police",
      "created_utc": 1720983234.0,
      "score": 5
    },
    {
      "id": "ld4kaif",
      "body": "Tell your father and have him get the police involved as well as the school , it's not that big of deal yes it will be a little embarrassing to tell your dad but he's a male and understands how the male mind works at your age he's been there before, yeah it's kinda silly and I could see where it would be scary for her to blast your photos...don't even act like you're scared of it ...first off it might make you hugely popular who knows .but dad will understand and im sure if you voice your wishes ti him he will handle it with care...good luck to you keep us posted on how it turns out .",
      "created_utc": 1720957577.0,
      "score": 7
    },
    {
      "id": "ld5313s",
      "body": "You have all the proof saved, right? You need to absolutely tell a trusted adult and get the police involved immediately. You can always switch schools. You can always block these pathetic individuals. But you only have ONE life, do not end it. There are always options. They are blackmailing you and that is illegal. Don't worry about what you did right now. You just need to let an adult know what is happening so that they can get officials involved to hold those accountable. They take matters like this seriously.",
      "created_utc": 1720966261.0,
      "score": 3
    },
    {
      "id": "ld577sl",
      "body": "Get the police involved and especially you being a minor there can be a lot of repercussions on this do it ASAP. It's not about you being a shame it's them being a shame who not only manipulated you into starting this but also to continue to exploit you",
      "created_utc": 1720967853.0,
      "score": 2
    },
    {
      "id": "ld587s2",
      "body": "You’re NOT doomed. The police is always there to help. Trust me, you’re not in an absolute mess.",
      "created_utc": 1720968225.0,
      "score": 2
    },
    {
      "id": "ld58qk1",
      "body": "this is sextortion and highly illegal keep all the evidence you can and press charges immediately!",
      "created_utc": 1720968419.0,
      "score": 2
    },
    {
      "id": "ld59rmq",
      "body": "As everyone else is saying, get the police involved. I won’t say more than that to keep laying down words that were already said.\n\nBut no matter what is the cause for all of this, please, don’t let them take your life away. You’re only 15, you do have so much ahead of you in life. You probably don’t even fully have a plan for what you want to do with your life. I want to reassure you that’s okay, though. You’re 15, you shouldn’t be worrying about life. Just get passing grades, live the carefree life of a teen, and enjoy this world before ya gotta start paying some damn taxes. \n\nNo matter how this situation goes down, you have a life ahead of you. A life that you can use to say “fuck you all. Look at all you did to me, and look at how i’m still better. I’m still happy. I’m still thriving.” Use what these fucking losers are trying to do as your own ammo to keep fucking pushing to come out stronger than before.",
      "created_utc": 1720968798.0,
      "score": 2
    },
    {
      "id": "ld5abm2",
      "body": "Hey. That's horrible and I'm sorry this is happening to you\nWhat they're doing is illegal on multiple levels and I promise you, you won't be an embarrassment to your parents if you them exactly what you've told this forum. The girl hassled you into sending pictures, you made a mistake in sending them of course but you have done nothing wrong.\n\nYou should 100% save any evidence of being encouraged to send the pictures and anything you have about the threats from any of them, and anything about them asking you to do sexual things. Then you should absolutely show them to a trusted adult - a parent or teacher. Please don't delay.\n\nIf these girls are stopped before they do anything (show the photos or make their false accusations public) then it could save you a lot of upset.\n\nI would report this to the police immediately - they're blackmailing you, they have images of underage nudity, they're threatening to distribute underage nudity, they are trying to sexually abuse you by correction and blackmail. \n\nI hope you can get the help you need, but if I can give any advice, please don't feel ashamed because all you did was trust a girl who lied to you and coerced you. That's not a crime and you shouldn't feel any shame. People who do this to others are the shameful ones and you will be supported if you seek the help and report them.",
      "created_utc": 1720969002.0,
      "score": 2
    },
    {
      "id": "ld5bwrx",
      "body": "First, you should know that none of this was your fault and you don’t need to feel guilty about what happened, okay? You are not an embarrassment to your parents, you are a victim of manipulation and blackmail, something that has been done to you without your consent or agreement. Try to talk to an adult you can trust, like a parent, a teacher, or a guardian, and let them know what’s happening. Tell them that you’ve never done anything wrong, that they are the ones who pressured you into sending pictures and are now threatening you. Please, please, try not to hate yourself for this. They are trying to hurt you and threaten you with private pictures of yourself that you did not want to send. That is completely unacceptable behavior, and it is not your fault!",
      "created_utc": 1720969580.0,
      "score": 2
    },
    {
      "id": "ld5e6fi",
      "body": "Call the police ASAP",
      "created_utc": 1720970383.0,
      "score": 2
    },
    {
      "id": "ld5oiub",
      "body": "These people would have done it to someone else. What they did was sick and 100% illegal. I agree going to an adult or even directly to the police or a school counselor if you are embarrassed. Tell them that and they will get someone involved to make this conversation easier. People have training in working with families in this situation. Keep all proof. What I've done in the past is I put a call recording app on my phone and make it extremely easy to access. Any time I come in contact with an abuser (that's what these garbage humans are). Please look up if your state is what is called a \"One party consent state\". If so, those recordings can be submitted to the court as proof. \n\nI'm 40, and I have been victim to this type of bullying in middle and high school. I'm here for you if you have any questions or need to talk it out so we can get you help. What they did is a reflection of how horrible these people are, and has no reflection on you as a person. You unfortunately learn that a lot later in life, but I hope you know based on these responses that you were not in the wrong. You were a victim of a sexual crime that many, many, MANY kids  your age have gone through. You are not alone.",
      "created_utc": 1720973995.0,
      "score": 2
    },
    {
      "id": "ld5rjrq",
      "body": "I’m almost positive you parents would much rather help you deal with an embarrassing moment than picking up a dead body. As harsh as it sounds. You should tell your parents and go to the police. My advice is to screenshot the texts threatening that they’d say you raped them and any other texts that show them trying to blackmail you. I know this is embarrassing because I’ve been through almost exactly this, except it was a bunch of guys. Be embarrassed, get red in the face, speak quietly, cry if you feel the need. Just don’t do something rash over someone else’s actions. \n\nAlso, unfortunately, if they’ve done it to you, they’ve likely done it to other people. Going to the police could put a stop to their sick games.",
      "created_utc": 1720975032.0,
      "score": 2
    },
    {
      "id": "ld5uwno",
      "body": "Wildest case to glance this sub reddit in a while",
      "created_utc": 1720976169.0,
      "score": 2
    },
    {
      "id": "ld5x1zf",
      "body": "Police ASAP. DO NOT come into contact with those people again.",
      "created_utc": 1720976895.0,
      "score": 2
    },
    {
      "id": "ld5ysk4",
      "body": "Their in possession of child porn, plain and simple. Child porn is a SERIOUS crime. Report them to the police immediately.",
      "created_utc": 1720977478.0,
      "score": 2
    },
    {
      "id": "ld627af",
      "body": "I know im just reiterating what everyone else has said but GET THE COPS INVOLVED ASAP this is so fucked up and im so sorry it’s happening to you. I with you luck with your situation",
      "created_utc": 1720978631.0,
      "score": 2
    },
    {
      "id": "ld67wl0",
      "body": "Call the police and I'm here for you no mater what hun",
      "created_utc": 1720980559.0,
      "score": 2
    },
    {
      "id": "ld692np",
      "body": "Did they text this? If so, take screenshots and share them with your principal",
      "created_utc": 1720980957.0,
      "score": 2
    },
    {
      "id": "ld71xrh",
      "body": "Before you do anything else, talk to your parents and have them get you a lawyer. Then you and your lawyer can go see the police.",
      "created_utc": 1720991430.0,
      "score": 2
    },
    {
      "id": "ld7au59",
      "body": "You've been raped and abused my friend. Not worth killing yourself over. \n\nIf that were the solution, half (conversvatively) of all the women in the world would be dead. \n\nNo this is a criminal issue and you having nothing to be ashamed about. You're 15. \n\nNot to denigrate based on age, but this will be long behind you before you know it.",
      "created_utc": 1720994564.0,
      "score": 2
    },
    {
      "id": "ld7yyrl",
      "body": "You have NOTHING to be ashamed, they're acting like criminals. Talk to your parents and report to the police. This isn't a reason to end your life, please, just do the logic thing and don't give them power over you.",
      "created_utc": 1721003909.0,
      "score": 2
    },
    {
      "id": "ld815je",
      "body": "I know you may be hesitant to involve police because of your parents finding out, but PLEASE, THEY WILL BE SO SO HAPPY AND PROUD OF YOU FOR TELLING THEM I PROMISE. POLICE.",
      "created_utc": 1721004784.0,
      "score": 2
    },
    {
      "id": "ld82g2o",
      "body": "Poor baby. Yes get the police. I hope it gets better soon. I hope you can tell your parents and this gets better. Please say in the world.",
      "created_utc": 1721005304.0,
      "score": 2
    },
    {
      "id": "ld885zd",
      "body": "Please don't buy into the ridiculous idea being pushed on you by these assholes that you have anything to be ashamed of. You sent your girlfriend a naked or sexual photo. So? There's *nothing wrong* with that. Your body is not shameful. Your sexuality is not shameful. They're part of being a human being. All that's shameful in this story is the vicious behavior of those girls.",
      "created_utc": 1721007667.0,
      "score": 2
    },
    {
      "id": "ld8c5gh",
      "body": "Please don’t harm yourself honey \nGo to your parents we all make mistakes they will understand\nWhat do you think is worst telling them this or they finding out anyway after you commit suicide? That will devastate them and us \nPlease don’t harm yourself you have your entire life ahead of you",
      "created_utc": 1721009323.0,
      "score": 2
    },
    {
      "id": "ld8h3mh",
      "body": "get evidence of them threatening you on camera ASAP.",
      "created_utc": 1721011389.0,
      "score": 2
    },
    {
      "id": "ld8n83w",
      "body": "This is going to pass. I was routinely sexually and mentally abused my whole childhood by my family and my mom’s boyfriends. Trust me. It feels awful now, but this is a relatively small thing to happen. It happens to a lot of people your age, and it’s bullshit. It will fade over time, shorter than you can imagine now, but I feels like the end of the world right now to you. Do not do something on impulse for something that will likely work out just fine. These are sexually explicit photos of a minor we’re talking about — this is serious for THEM possessing them. High school shit doesn’t matter. Throw the book at them. Everyone has genitals, dude, about half have a penis and half have a vagina, and they’re usually extremely similar to one another. Really, when you think about it, those pictures are not special. \n\n1) they’re assholes for doing this, get them in trouble, defend yourself, don’t take the high road, fuck that. \n\n2) You’re going to be okay. Try your best to see this from an objective point of view. Even IF they showed this to other people, that’s an additional charge of distribution. Plus, all the other people (the ones worth caring what their opinion is anyways) who know the story would know you are the victim and that’s a shitty situation to put someone in. The typical person would empathize with you. \n\n3) take care of yourself and don’t beat yourself up. Beating yourself up about these things only makes it worse. Don’t add fuel to the fire. Don’t be your own bully. Don’t do what they want you to and judge yourself. You did nothing wrong. You’re young. We all did things like this at some point.",
      "created_utc": 1721014097.0,
      "score": 2
    },
    {
      "id": "ld8uujy",
      "body": "I promise you will be okay if you report them to the police, this will all be sorted out",
      "created_utc": 1721017828.0,
      "score": 2
    },
    {
      "id": "ld8w3iq",
      "body": "This is extremely illegal. Contact the police.",
      "created_utc": 1721018495.0,
      "score": 2
    },
    {
      "id": "ld8zw3q",
      "body": "Please, don't.",
      "created_utc": 1721020604.0,
      "score": 2
    },
    {
      "id": "ld99826",
      "body": "I’m so sorry this is happening to you, but as I think everyone has said, contact the police ASAP! Not only are they sexually harassing you but if they do share those photos they’ll be sharing CP as well.\nI hope you get help to handle this situation, you don’t deserve this. Sending big hugs x",
      "created_utc": 1721026352.0,
      "score": 2
    },
    {
      "id": "ld4epkd",
      "body": "They're in possession of child porn. You're a victim \n\nThey're blackmailing you \n\nThey're making threats if you don't do a thing, could maybe be extortion \n\n\nAll are illegal. Report to police or higher up. Unsure of agency but start with cops, then parents.\n\n\n If you have texts telling you they'll accuse you of a false crime show them. They can, but haven't yet, ruined your life. Put a stop to them, not you.",
      "created_utc": 1720954215.0,
      "score": 1
    },
    {
      "id": "ld5czjj",
      "body": "If you are in Chicago or NY I’ll murk them for you",
      "created_utc": 1720969966.0,
      "score": 1
    },
    {
      "id": "ld5pcxi",
      "body": "Broo you are about to cash in a lot of money, day is good. Go to a lawers and then to the police",
      "created_utc": 1720974283.0,
      "score": 1
    },
    {
      "id": "ld67nt4",
      "body": "Police please!",
      "created_utc": 1720980475.0,
      "score": 1
    },
    {
      "id": "ld77w5h",
      "body": "I wanna die",
      "created_utc": 1720993502.0,
      "score": 1
    },
    {
      "id": "ld7r11a",
      "body": "This is child pornography. Get the police involved",
      "created_utc": 1721000750.0,
      "score": 1
    },
    {
      "id": "ld7sp90",
      "body": "This is super illegal. Document everything, go to the cops.",
      "created_utc": 1721001411.0,
      "score": 1
    },
    {
      "id": "ld7sy8i",
      "body": "Go to the police",
      "created_utc": 1721001511.0,
      "score": 1
    },
    {
      "id": "ld7v9v4",
      "body": "Screenshot all of this shit and go to the police.",
      "created_utc": 1721002435.0,
      "score": 1
    },
    {
      "id": "ld81r4h",
      "body": "Like everyone else has said, bring this to the police, you’re a minor and therefore they’re distributing child porn. I promise you the police will sort this out",
      "created_utc": 1721005026.0,
      "score": 1
    },
    {
      "id": "ld871a3",
      "body": "Holy shit these girls are legit manipulative psychopaths, honestly fuck them",
      "created_utc": 1721007192.0,
      "score": 1
    },
    {
      "id": "ld8jex2",
      "body": "call the cops that is literally a crime",
      "created_utc": 1721012386.0,
      "score": 1
    },
    {
      "id": "ld8ksg0",
      "body": "This is so messed up, what they are doing to you. I know having nude pictures out there of you seems like the end of the world, but I promise you, it isn’t. Go to the police, tell a parent or other trusted adult.",
      "created_utc": 1721012990.0,
      "score": 1
    },
    {
      "id": "ld8yiee",
      "body": "Keep a copy of your conversations specifically the ones where she is blackmailing you as evidence. Get a trusted adult and the police involved. Everyone's already saying it, please do it. \n\nPossesion of your picture (a minor) is a crime. Blackmail is a crime.",
      "created_utc": 1721019817.0,
      "score": 1
    },
    {
      "id": "ld93eeo",
      "body": "OP…you still with us? I pray you are. Want to give you a huge mama hug right now.",
      "created_utc": 1721022682.0,
      "score": 1
    },
    {
      "id": "ld9c22p",
      "body": "There is no reason to do something you can't undo at such a young age. Relax this will not end your world even tho you might think it will\n\nAnyone sharing child porn will get into huge trouble if I was you I'd talk to the guidance counselor at your school",
      "created_utc": 1721028300.0,
      "score": 1
    },
    {
      "id": "ld9fv1e",
      "body": "I'm so scared to hear this, I can help you! I hate these types of people so much that when I see these people who use intimate photos to threaten, I ruin their lives",
      "created_utc": 1721031035.0,
      "score": 1
    },
    {
      "id": "ld9hcjn",
      "body": "Don think dude, dial police number, just dont think, and do that and all your problems will go away, its as simple as that",
      "created_utc": 1721032115.0,
      "score": 1
    },
    {
      "id": "ld9l2h7",
      "body": "Be the first to the phone. What they are doing is illegal. Make. Them. Pay.",
      "created_utc": 1721034803.0,
      "score": 1
    },
    {
      "id": "ld9v2lr",
      "body": "Reach out to local police for help. Keep all the evidence",
      "created_utc": 1721041510.0,
      "score": 1
    },
    {
      "id": "ld9y9m3",
      "body": "Go to the police NOW!!! That is 100% illegal and wrong in SO many ways",
      "created_utc": 1721043278.0,
      "score": 1
    },
    {
      "id": "ld9zmeh",
      "body": "You won’t be an embarrassment to your parents, they would rather have you alive and looked after them suffering in silence ❤️",
      "created_utc": 1721043985.0,
      "score": 1
    },
    {
      "id": "lda28hs",
      "body": "Please please PLEASE do not hurt yourself. You have so much life left to live and this is a bump in the road. I know it feels like a HUGE bump but you need support. Your parents love you and they want to know the things that are going on in your life. Parents want to help and protect their kids. It’s ingrained in us. Please give them the chance to help you. They won’t be embarrassed I promise. This is not worth your life. You didn’t do anything wrong and these girls need to be held accountable for what they’re doing to you. Please please reach out for help.",
      "created_utc": 1721045302.0,
      "score": 1
    },
    {
      "id": "lda2oj2",
      "body": "And trust me, even if they say something like how could you do this? What were you thinking, it’s just because they’re scared. They’re scared for you; they’re mad at themselves for not protecting you. But it does not change their love for you. It does not change the fact that they would give their life for you. They’re just scared. Let them be your parents, and give them the chance to help you",
      "created_utc": 1721045518.0,
      "score": 1
    },
    {
      "id": "ldi26et",
      "body": "Hi how u doin? Any updates?",
      "created_utc": 1721159916.0,
      "score": 1
    },
    {
      "id": "lr1ley9",
      "body": "How is it going did u do it is it worth it to still be here",
      "created_utc": 1728446139.0,
      "score": 1
    },
    {
      "id": "ld44r6z",
      "body": "ASAP",
      "created_utc": 1720947335.0,
      "score": 350
    },
    {
      "id": "ld7zv0z",
      "body": "This. Get them arrested!! This is so fucked up.",
      "created_utc": 1721004267.0,
      "score": 103
    },
    {
      "id": "ldac943",
      "body": "I’m 27 and still remember how stubborn I was at 15. But in this situation you have to involve the police.",
      "created_utc": 1721049747.0,
      "score": 15
    }
  ]
}