{
  "id": "1dbn3za",
  "title": "I hate being a prostitute",
  "selftext": "In truth, I actually used to enjoy it years ago. Then, I went to college because I wanted more fulfilling work. Then, I started a business, and even though it's been successful, it's taking longer than I anticipated to fully set up so I can't live off the profits yet. \n\nSo... I had to default to my former work to temporarily makes ends meet and... I'm remembering how dehumanizing it is. I've only been back at it a month and have already had to visit the ER to do a rape kit, have already been facef\\*\\*\\*ed so hard I threw up (despite having not eaten anything that day), have already torn countless times, have already had every 'minor' boundary ignored, and have already lost my sanity having to sleep during the day so I can be available at night. Dehumanizing is an understatement, and the money is only worth it if it's a stepping stone to a better future, and a close one at that.   \n\nI'm dreading the 15th when I have to be back at it until July. My depression is coming back and I really need things to work for me... otherwise... I'll perish.",
  "created_utc": 1717913926.0,
  "score": 704,
  "num_comments": 95,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1dbn3za/i_hate_being_a_prostitute/",
  "comments": [
    {
      "id": "l7sntqj",
      "body": "Prostitution fucked me up so much in less than a year. I genuinely miss the person I was before turning to this as what seemed to be my last resort. Even though I’m long out of it and have managed to start a whole new life, my past keeps haunting me almost daily and I don’t think it’ll ever leave me alone. I ended up dealing with PTSD, sexual OCD, rough porn addiction, depression and self-harm. I don’t remember how and when I wound up hating myself so much that I started wanting others to beat me up, spit on me, violate me and treat me as if I was a piece of meat. But it definitely wasn’t ok in the slightest and deep inside I just wanted someone to give me a gentle hug and tell me they loved me and that I didn’t deserve it. Though it never happened. I still sometimes wake up in the middle of the night from a nightmare of being slapped in the face real hard, it’s like I can physically feel it, like I’m still stuck in those days, and even though I quickly realize that it was just a bad dream, it may take hours to calm down.\n\nMy perception of men has been altered forever, although, to be fair, they were all very different. Some of them just really needed company, the kind of men that have sex with you for 10ish minutes and then have you sit down beside them and tell you their whole life story, expecting you to be a shoulder to cry on. This is actually the best kind I’ve dealt with, as they still viewed me as a human being when I expected a different scenario.",
      "created_utc": 1717927796.0,
      "score": 282
    },
    {
      "id": "l7tak1j",
      "body": "Please don't go back. It sounds soul sucking and extremely painful mentally and physically.  There has to be something else you can do that doesn't put you in danger.",
      "created_utc": 1717940418.0,
      "score": 102
    },
    {
      "id": "l7tiolf",
      "body": "[removed]",
      "created_utc": 1717943743.0,
      "score": 131
    },
    {
      "id": "l7s5377",
      "body": "I wish I can give you a hug.\nIt’s okay, everything will be okay eventually.\nYour downs are temporary but you are not. \nThis doesn’t change who you are. \nI love you, and I know that you can overcome come this.",
      "created_utc": 1717914259.0,
      "score": 98
    },
    {
      "id": "l7uvgju",
      "body": "for me when something or someone pushes me towards suicide I just cut it of my life completely no matter the consequenses. after all there is nothing worse that feeling so bad you are in the verge of quitting so for me it is always worth it.",
      "created_utc": 1717961127.0,
      "score": 15
    },
    {
      "id": "l7sj4ha",
      "body": "Do you really have no other options? This sounds fucking awful. You don’t deserve to be treated like that :(",
      "created_utc": 1717924293.0,
      "score": 50
    },
    {
      "id": "l7sjwx6",
      "body": "[removed]",
      "created_utc": 1717924882.0,
      "score": 89
    },
    {
      "id": "l7utgux",
      "body": "Not all money is good money, walk away from being a prostitute. Work a regular boring job like most people do until your business takes off. None of what you're going through is necessary and you deserve better.  Remember, there are options you do have a choice.",
      "created_utc": 1717960435.0,
      "score": 16
    },
    {
      "id": "l7t3du4",
      "body": "Ur brave posting something like this to the internet. I hope no one makes it worse for you in the comments. Or messages. Lots of love and good luck with your business and your mental and emotional health in the meantime.",
      "created_utc": 1717937097.0,
      "score": 23
    },
    {
      "id": "l7wlcr3",
      "body": "I have a few friends who are sex workers… I’ve known all of them since before they entered this profession. I’ve seen the change. It’s heartbreaking. Hoping you find your way out.",
      "created_utc": 1717985556.0,
      "score": 4
    },
    {
      "id": "l7s7qyd",
      "body": "I’m sorry you’re struggling so much. You sound really strong and I believe you can make it",
      "created_utc": 1717916049.0,
      "score": 22
    },
    {
      "id": "l7suxwn",
      "body": "I am sorry you are struggling and need to resort to guys. Been with 4,000 plus. I am out of that and i really do not want to be with a guy again. I stopped prep and I do not need to take std tests. Std shots really hurt. \n\nIn community street work is not looked down on. A lot in community do street work. So at least there is that. A lot of woman in community have hiv. There was a woman I really liked that died from hiv. It took a while to sink in. She was so beautiful then she got sick and sicker. I was jealous of how beautiful she was, until she got sick. There is a saying, don’t be jealous of one thing be jealous of it all. \n\nI have been at events with owned woman. I think that is the worst of the worst treatment.",
      "created_utc": 1717932576.0,
      "score": 19
    },
    {
      "id": "l7utbxo",
      "body": "Your story is heartbreaking. I'm sorry you feel like this is the way to get to your destiny. That you have built something outside of the business that's not making it's way yet is tough. I hope it takes off soon. \n\nLearning girls and women go through this is so saddening irl that it leads one to despair. I send my heartfelt support to you in the hope it can make some light in the darkness for you.",
      "created_utc": 1717960386.0,
      "score": 5
    },
    {
      "id": "l7tbwdj",
      "body": "If adult industry is what you must do as a last resort, then why not try OF or adult massage spas. I know someone who worked at an adult spa and she told me you don’t have to be great at giving massages or even know much about giving massages. Your average consumer there isn’t concerned with the quality of massage, but the happy ending.",
      "created_utc": 1717940993.0,
      "score": 15
    },
    {
      "id": "l7sp93j",
      "body": "I wish I could give you a hug. I’m so sorry that you have experienced all of these horrible things. Do you truly have no other options? My heart breaks at the thought of you putting yourself in danger",
      "created_utc": 1717928829.0,
      "score": 11
    },
    {
      "id": "l7upnsf",
      "body": "I am sorry you're getting some toxic, mean-spirited comments here.  I wish I could say it's surprising that some people would choose to be hurtful; but that's how the internet is.\n\n\nI wonder if there is any kind of therapy available for you?  More in a problem solving assistance kind of way -- someone who can help you look at the details of your situation and figure out what courses are realistic, in case there's one that doesn't hurt you as bad that still allows you to accomplish what you need to.  You might not be able to see it without help.",
      "created_utc": 1717959099.0,
      "score": 4
    },
    {
      "id": "l7w36gq",
      "body": "I can't tell you anything because it will be hard to believe a stranger's word. I could never begin to understand the struggle and hard work you go through.\n\nWhat I do know and can understand is that you deserve to be happy and you deserve all the good things. You deserve love, you deserve contentment, and you deserve comfort and safety, financial and otherwise. \n\nI am sorry you have had your boundaries ignored. It must have been tormenting and dehumanizing. Please remember and know that you are human and your feelings, boundaries, and all that matter, no matter what some pathetic men have to say or do about it.",
      "created_utc": 1717977975.0,
      "score": 2
    },
    {
      "id": "l7tqyh7",
      "body": "Then maybe lay it off",
      "created_utc": 1717946850.0,
      "score": 0
    },
    {
      "id": "l7ygvdf",
      "body": "I know you mentioned that you feel as though you have to keep doing this until your business can fully support you, but nothing is worth having to bear a worsening depression.\n\nIn the interim, I'd definitely recommend taking any job where you feel that your humanity is respected at all times. I understand that this may mean a lower level of income initially, however, you'll be in a much better frame of mind, allowing you and your business to thrive as much as possible.",
      "created_utc": 1718024809.0,
      "score": 1
    },
    {
      "id": "l7u1k4x",
      "body": "[removed]",
      "created_utc": 1717950661.0,
      "score": -5
    },
    {
      "id": "l7uwf48",
      "body": "[removed]",
      "created_utc": 1717961472.0,
      "score": -20
    },
    {
      "id": "l7x7aai",
      "body": "[removed]",
      "created_utc": 1717996428.0,
      "score": -1
    },
    {
      "id": "l7t26yn",
      "body": "[removed]",
      "created_utc": 1717936541.0,
      "score": -56
    },
    {
      "id": "l7slnzf",
      "body": "[removed]",
      "created_utc": 1717926205.0,
      "score": -18
    },
    {
      "id": "l81ehpd",
      "body": "Im dealing with a similar addiction. How did you deal with it? Mine was caused by multiple rapes from my partner.",
      "created_utc": 1718061901.0,
      "score": 3
    },
    {
      "id": "l822smr",
      "body": "[removed]",
      "created_utc": 1718071912.0,
      "score": 2
    },
    {
      "id": "l7up1un",
      "body": "[removed]",
      "created_utc": 1717958890.0,
      "score": -111
    },
    {
      "id": "l8dn71z",
      "body": "It is. Everyone likes to gloat about how it must be so easy and they wish they could do it. In reality there are so many pitfalls that probably don't weigh out the positives.",
      "created_utc": 1718251988.0,
      "score": 1
    },
    {
      "id": "l7wppna",
      "body": "These people dehumanize sexual partners in general, soliciting sex is just an easy outlet because you get to literally dehumanize a woman by paying for her body and not have to actually care for their well-being/consent. It’s evil to not realize they are humans too. I wish all the best to op, so many people don’t understand how traumatic the industry is…",
      "created_utc": 1717987371.0,
      "score": 16
    },
    {
      "id": "l7wdtk1",
      "body": "[removed]",
      "created_utc": 1717982415.0,
      "score": -12
    },
    {
      "id": "l7u8grs",
      "body": "[deleted]",
      "created_utc": 1717953099.0,
      "score": -47
    },
    {
      "id": "lsdz1cf",
      "body": "This job market is horrible though it’s even impossible to find a “boring” job these days 😞",
      "created_utc": 1729183448.0,
      "score": 1
    },
    {
      "id": "l7w23vq",
      "body": "Real life isn't fairy tales and sunshine. If you listened to what she said, you'll realise that she only chose to do prostitution because of financial difficulty.\nAnd the porn industry isn't much better pay wise or mental health wise.",
      "created_utc": 1717977527.0,
      "score": 4
    },
    {
      "id": "l8251kv",
      "body": "[removed]",
      "created_utc": 1718072857.0,
      "score": 1
    },
    {
      "id": "l7spo6p",
      "body": "[removed]",
      "created_utc": 1717929127.0,
      "score": 12
    },
    {
      "id": "l7sod5y",
      "body": "[removed]",
      "created_utc": 1717928190.0,
      "score": 7
    },
    {
      "id": "l83mnov",
      "body": "well, I don’t think I can give you any professional advice, since I haven’t managed yet to muster up the courage to mention my porn addiction to someone offline, including therapists. But getting treated for other mental disorders, such as depression and OCD, has definitely helped alleviate porn addiction symptoms for me. When I was severely depressed, I used to watch porn about ten times a day, because there was nothing else I was able to do, I had lost all my hobbies to this horrible mental illness that I ignored for years. But several months into the treatment, and I began to notice major changes in my behavior. I got a full-time job, met lots of new people, regained interest in my hobbies again, it all helped keep my mind busy, leaving less and less time and space for porn and masturbation. \nSSRI drugs that I take for both depression and OCD killed my libido and made me unable to reach orgasm, which meant no dopamine rush from watching porn no more, and once it was taken away, the kind of porn I was into started to seem incredibly disturbing and disgusting whereas vanilla bdsm seemed super boring. Consequently, my brain began prioritizing other things over porn that was no longer able to activate the dopamine release it craved. \nBut honestly, I think it’s just a quick band-aid solution to a bigger problem that’s still present but is currently on mute.",
      "created_utc": 1718105168.0,
      "score": 1
    },
    {
      "id": "l848pk4",
      "body": "I’m doing pretty well, thank you! \n\nmy sexual ocd manifests itself in the form of unwanted intrusive thoughts about sexual violence (where I become the offender) that I can’t just shake off. In a nutshell, it makes me feel horrendously guilty, utterly disgusted with myself and downright terrified. I remember cutting myself down there because I genuinely believed that I had to do that, otherwise my intrusive thoughts would become true, and I would hurt someone sexually. My first symptoms showed up back when I still did prostitution, I didn’t know I would be diagnosed with OCD later, I didn’t know I was dealing with a debilitating mental illness, I just had those reoccurring disturbing thoughts that kept coming back time and time again, and I thought it was all my fault, I thought I was turning into a monster. I remember thinking that I deserved to suffer because of those thoughts, so grew more tolerant of violence towards myself. I inflicted pain on myself and I allowed, ngl even encouraged, others to hurt me for money in the most humiliating way we could think of.",
      "created_utc": 1718114834.0,
      "score": 2
    },
    {
      "id": "l7v46c5",
      "body": "[removed]",
      "created_utc": 1717964247.0,
      "score": 72
    },
    {
      "id": "l7woydd",
      "body": "[removed]",
      "created_utc": 1717987044.0,
      "score": 2
    },
    {
      "id": "l7vew0p",
      "body": "[removed]",
      "created_utc": 1717968121.0,
      "score": 7
    },
    {
      "id": "l7vhq3s",
      "body": "[removed]",
      "created_utc": 1717969199.0,
      "score": -50
    },
    {
      "id": "l7wc5mw",
      "body": "[removed]",
      "created_utc": 1717981727.0,
      "score": 13
    },
    {
      "id": "l7vkoey",
      "body": "[removed]",
      "created_utc": 1717970355.0,
      "score": 32
    },
    {
      "id": "l7viv09",
      "body": "[removed]",
      "created_utc": 1717969640.0,
      "score": 20
    },
    {
      "id": "l7vz20r",
      "body": "[removed]",
      "created_utc": 1717976241.0,
      "score": 8
    },
    {
      "id": "l7vn8xr",
      "body": "[removed]",
      "created_utc": 1717971387.0,
      "score": -8
    },
    {
      "id": "l7vl0j0",
      "body": "[removed]",
      "created_utc": 1717970490.0,
      "score": -15
    },
    {
      "id": "l7w09xy",
      "body": "[removed]",
      "created_utc": 1717976754.0,
      "score": 0
    },
    {
      "id": "l7vnr14",
      "body": "[removed]",
      "created_utc": 1717971589.0,
      "score": 10
    },
    {
      "id": "l7waoym",
      "body": "[removed]",
      "created_utc": 1717981115.0,
      "score": 4
    },
    {
      "id": "l7vuggp",
      "body": "[removed]",
      "created_utc": 1717974314.0,
      "score": -4
    },
    {
      "id": "l7vurq9",
      "body": "[removed]",
      "created_utc": 1717974448.0,
      "score": 5
    },
    {
      "id": "l7vx6h0",
      "body": "[removed]",
      "created_utc": 1717975457.0,
      "score": 5
    }
  ]
}