{
  "id": "1k2iznt",
  "title": "Porn destroyed my brain.",
  "selftext": "I remember when I was trying to quit weed, nicotine. Quitting these two wasn't that bad honestly... just sweats and insomnia and that goes away after like a week or so.\n\n Porn is a completely different beast. I replased today. I wanna quit so fucking much, but the sexual images keep appearing no matter how much I try to distract myself. I could be trying to learn something and next thing you know... sexual images. I wish I was never groomed into it. I feel disgusting, angry, and ashamed for myself and I don't think I'll ever get better. I honestly think that suicide is the only way out this purgatory...",
  "created_utc": 1745019759.0,
  "score": 528,
  "num_comments": 65,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1k2iznt/porn_destroyed_my_brain/",
  "comments": [
    {
      "id": "mnuh6ag",
      "body": "Okay so not to be creepy but I always look at someone’s post history. And you’re actually very good at music. My favorite of the ones I saw on your SoundCloud was called untitled. What if you pour all of that energy back into music? It’s clear you know what you’re doing. Shit, make an album about the struggle. Really let it out. Porn addiction is no joke. I actually find it a slippery slope myself, as a woman reading smut, though I don’t outright “watch” porn in the traditional sense. As with every bad habit, it will take time to break, but this is not worth killing yourself over. I see you’re 25, this is the type of stuff you can deal with now while you have time, so you can have a better future when you hit 30. Break the habit now! 25 is so young, my friend! You have so much life left in you, you’ve already admitted the hardest part out loud, all that you can do now is try. Keep going!!!",
      "created_utc": 1745020218.0,
      "score": 339
    },
    {
      "id": "mnusz3l",
      "body": "Its an addiction, and with addictions especially psychological ones, its hard to break especially on purpose with how.. EVERYWHERE it is. Its free for a reason. My husband, and myself included have struggled. I have the SH addiction, but porn wasnt an exemption either. Its a lot of rewiring, and replacing whats likely an unhealthy coping mechanism too, not just the concept of addiction by itself. Theres possibilities and hope. like genuinely. My husband is an example & I would count myself too, it really doesnt have to be this way",
      "created_utc": 1745024645.0,
      "score": 55
    },
    {
      "id": "mnw63l6",
      "body": "There is growing evidence that it physically alters your brain structure and activity for the worst - the addiction isn't your fault but you have to go cold turkey to get better. Focus on your music :)",
      "created_utc": 1745048011.0,
      "score": 12
    },
    {
      "id": "mnve7xf",
      "body": "A lot of people struggle with porn so much. You'd be surprised that many fit the criteria of porn addiction and they may not know that it's an addiction. You are not alone. It's sad how society pushes it on us and makes it so easily available. Don't give up though! Slowly try to watch less and less and it's best to talk to a therapist as well. You got this!",
      "created_utc": 1745033081.0,
      "score": 15
    },
    {
      "id": "mnvgpyz",
      "body": "Rather than watching porn, you can try to engage yourself in physical activities for 1-2 hrs on a daily basis. Go to a gym or do a morning run or whatever you find interesting. Once your body is exhausted, we usually sleep early and for long hours. If that's not possible, you have to go out randomly whenever you have the urge to watch porn. Go out with friends, roam around or find a hobby that makes you bring out of your room. Just get out of the comfort zone.",
      "created_utc": 1745034196.0,
      "score": 14
    },
    {
      "id": "mnw11g0",
      "body": "never give up, it has taken me multiple years but ive finally gotten rid of the addiction and its amazing. please never give up.",
      "created_utc": 1745044912.0,
      "score": 7
    },
    {
      "id": "mnwefvw",
      "body": "It takes a long time to change. It's possible, but relapses will happen. Try really hard not to shame yourself. Masturbation is normal. It becomes a problem when it's all you see or want or use to soothe.\n\nYou're focusing on the negative so much. It hasn't destroyed your brain. It's damaged it. \n\nBut it can be repaired with time and effort.",
      "created_utc": 1745053287.0,
      "score": 7
    },
    {
      "id": "mnvc1s0",
      "body": "I watched porn for years. I can’t say I wasn’t addicted to it but there was some kind of dependence for sure. Well, I too got frustrated cause I just wasn’t able to quit watching it but then I just stopped caring. I just reframed the whole thing. I started viewing it like a treat for myself after a long day of work. Like when you give yourself permission to eat junk food or an ice cream or what have you, like, hey, let’s have pizza tonight, fuck the diet, just for today, you know? And of course, the sexual imagery is there and you crave and all that. Now I have a girlfriend and that helped me so much to stop. You’ll sooner or later find your significant other and she might not want to catch you watching porn so that might motivate to cut down on it , I think.",
      "created_utc": 1745032136.0,
      "score": 24
    },
    {
      "id": "mnw6ka6",
      "body": "Hey I get your struggle since I had been there as well. For me the audiobook of \"The Easy Peasy Way to Quit Pornography\" helped me to quit. Its free and like 4 hours long, but it really changed my life",
      "created_utc": 1745048300.0,
      "score": 6
    },
    {
      "id": "mnw8pk4",
      "body": "i know how it feels but once you get over it it's so so worth it",
      "created_utc": 1745049636.0,
      "score": 6
    },
    {
      "id": "mnxmzji",
      "body": "Felt this with you. I was in denial about my addiction to it until I came to terms with it. Still battling it and sometimes it feels theres no hope but I keep trying, recovery isnt linear. Like one commenter had said, poor those urges and frustration into your music you would be surpised how relieving it would be to turn a struggle into a form of art, a way to get the weight off your chest without harm to yourself.",
      "created_utc": 1745073985.0,
      "score": 5
    },
    {
      "id": "mnw3ayc",
      "body": "If you're feeling disgusted or ashamed, know that you're not alone. Those feelings, while painful, are actually common in this kind of struggle.\n\nPorn addiction differs from substance addictions like weed or nicotine. While those can be removed entirely from one’s life, sex, like food, is a fundamental human drive. You can't simply quit it. You have to live with it. That makes recovery less about abstinence and more about reshaping your relationship with the behavior. \n\nSo please understand: This is new kind of challenge and you aren't failing; you're learning. It's more like couples counselling than a breakup. You can't take the hard line on this one. It's a process, so please practice forgiveness, understanding, and compassion towards yourself.",
      "created_utc": 1745046276.0,
      "score": 3
    },
    {
      "id": "mnvrrb6",
      "body": "Honestly porn is everywhere. Music, shows, movies, etc. It’s super difficult to do a no fap challenge or even no nut november. However, all I can say even for myself is try to distract yourself. Go outside, hike, explore nature, and shower cold water to avoid urges. Don’t recommend going to the gym if you can’t control ur urges. However nothing wrong with masturbation. It’s important to do that to prevent pancreatic cancer",
      "created_utc": 1745039594.0,
      "score": 6
    },
    {
      "id": "mnvul27",
      "body": "It's so strange what people get addicted to. I was able to quit heroin, porn, cigarettes, and pills with EASE compared to how hard it is for me to quit weed. I absolutely cannot fuckin stop.",
      "created_utc": 1745041152.0,
      "score": 5
    },
    {
      "id": "mnvfzy2",
      "body": "There is a book I just finished called Clean, by Douglas Weiss. It talks about sexual addiction for a religious and scientific perspective. It’s a great read and something I should probably start to read again. Porn is dangerous and, unfortunately, all over and super easy to access. It’s been a struggle for most of my life and I’m almost 40. Having an accountability partner will help.",
      "created_utc": 1745033875.0,
      "score": 2
    },
    {
      "id": "mny1gvx",
      "body": "Solution: set your age to under 13 on any apps like this one so you are incapable of watching it won't fully fix the problem but it will be better",
      "created_utc": 1745078609.0,
      "score": 2
    },
    {
      "id": "mnyo3r9",
      "body": "I'm feeling the same way right now, among other personal issues. All I've thought about for the past week. It's too difficult sometimes. I don't have the energy to fight anymore...",
      "created_utc": 1745085697.0,
      "score": 2
    },
    {
      "id": "mnz1r87",
      "body": "Yo OP…\nAre you potentially asexual and that’s part of why it bothers you so much?",
      "created_utc": 1745090126.0,
      "score": 2
    },
    {
      "id": "mo1b34b",
      "body": "your music is sik man, you got talent, please dont die",
      "created_utc": 1745119297.0,
      "score": 2
    },
    {
      "id": "mo65m8p",
      "body": "work on getting an actual girlfriend, that helps trust me\n\nreally motivates you",
      "created_utc": 1745191811.0,
      "score": 2
    },
    {
      "id": "modanp5",
      "body": "I hear you on that addiction, and the guilt. And it leads to it needing to be ever harder... just like a drug.  I started trying to go with just pictures... that helps... then just fantasies.  But I still relapse. Went like 18 months once... once. But still... curbing it with breaks from as many heavier aspects of it you can muster can start to help. At least in my experience.  That, and keeping myself otherwise occupied. Idle hands are definitely the devil's playground.",
      "created_utc": 1745290338.0,
      "score": 2
    },
    {
      "id": "mozh1k5",
      "body": "What I would suggest is buy a sex toy and use it without porn whenever you get the really strong urges",
      "created_utc": 1745594868.0,
      "score": 2
    },
    {
      "id": "mnvqrn4",
      "body": "Porn addiction can easily be addressed with therapy. But you have to want to change.",
      "created_utc": 1745039065.0,
      "score": 3
    },
    {
      "id": "mnvnoef",
      "body": "I just did a study to see whether or not I was addicted to porn. I tested positive and I consider myself a recreational/ casual watcher. Though while being in a relationship I have no urges and or cravings for it. Like at all, however if I were single I'd be considered an addict. The thing is just because you watch porn doesn't necessarily mean you're addicted to the porn itself. The issue could range from a number of things. Are you exactly a sex addict, are you depressed, bipolar, adhd??.. Do you struggle with any other addictions?. 60% of people watch porn. What causes one to be considered an addict isn't always what many may think. Just try to figure out the core issue that's making you wanna watch porn. Whatever it may be try and replace that void/craving or urge with other hobbies. Most people usually just need something to keep them out of their heads. I support you every step of the way in your recovery.",
      "created_utc": 1745037458.0,
      "score": 2
    },
    {
      "id": "mnvp787",
      "body": "Why is it a problem? How often do you watch?",
      "created_utc": 1745038244.0,
      "score": 3
    },
    {
      "id": "mnwefur",
      "body": "Killing yourself over a porn addiction is dumb. loads of people have addictions, especially sexual ones, cause their natural. And it probably doesn't bother anyone else",
      "created_utc": 1745053286.0,
      "score": 3
    },
    {
      "id": "mny8xp6",
      "body": "Try the Antidepressant Bupripion, it worked like a reset for me.",
      "created_utc": 1745080994.0,
      "score": 1
    },
    {
      "id": "mo4q9lp",
      "body": "SSRIS will make you ace",
      "created_utc": 1745174114.0,
      "score": 1
    },
    {
      "id": "moo5xss",
      "body": "It's not the only way. I was addicted to it for more than 20 yrs, and all the way till mid 2023. Since then and progressively to this day, I find it dull and disgusting, quite the opposite to how I used to find it regardless how nasty. What changed was a dramatic brain rewiring from a stroke recovery. Because of the cognitive and mental impact I ended up relearning, reprogramming and stimulating my brain sensibly. And that's why it no longer craves what I fed it with. In fact, it were the former insecurities, fears and lack of self-esteem what led me into the vice and addiction. The usual suspects.\n\nOf course, I don't recommend nor suggest, however possible, to inflict a brain calamity on yourself. Besides, the consequences are unpredictable. BUT, you can still force your brain to rewire without physical intervention. And not by mere abstinence, though I do know how difficult that already is. Instead, you must 1. expose and refrain, expose yourself AND refrain from the stimuli, in order to progressively regain confidence and control over the triggers and effects. 2. In parallel, schematize, iterate and exercise a well-rounded routine that shall lead you to your ideal being. 3. Seek an accountability, 'unattractive' partner, preferably a professional, to guide and support you and evaluate the progress.\n\nIt will be slow, it will take at least a 10% of the time you've been addicted (estimate based on my personal experience). But hey, start by trusting you will eventually see results. And if not, if truly not, then you'd be free to commit suicide as the very last resort. Just try all you can, and a little more, before so.",
      "created_utc": 1745439994.0,
      "score": 1
    },
    {
      "id": "mow1dc8",
      "body": "I’ve tried so hard to quit too but I always relapse and every time I relapse I have to watch more and more grotesque stuff in order to get off. It’s truly hell",
      "created_utc": 1745542120.0,
      "score": 1
    },
    {
      "id": "moxzm08",
      "body": "porns bad just supress it and it will go a way trust just dont do it and after its not a addiction if your meat aint fucked up enough that u can jerk it and not get addicted again",
      "created_utc": 1745574977.0,
      "score": 1
    },
    {
      "id": "mp0r3js",
      "body": "There's plenty of reasons to unlife oneself, but porn is definitely not one of them...I'd say just kind of embrace it. Let it be part of your life, and at some point, it'll just sit there in the back of your mind, neither here nor there. \n\nFor a good while, there was this brand of ice cream I was addicted to. I'd eat 2 pints a day. Weeks became months, and months became years. Then one day I just kinda slowly got tired of it. Not cold turkey. I still eat it. It's so good, but just 2 pints every weekend. It was just becoming too much. \n\nAll addictions work like that, if it's not something that really destroys your body like hard drugs or alcohol, your mind will eventually say to cut down on it a bit.",
      "created_utc": 1745608262.0,
      "score": 1
    },
    {
      "id": "mp1ojro",
      "body": "[removed]",
      "created_utc": 1745618615.0,
      "score": 1
    },
    {
      "id": "mqyduh1",
      "body": "Don't distract, it doesn't work. Suppressing these kinds of feelings only makes it worse. Redirecting sexual energy to something substantial brings natural dispassion/detachment to the lower pleasures. \n\nI recommend watching Acharya Prashant videos on nofap, he has a great knowledge on the nature of the mind. He will explain everything clearly. And read his popular books. \nAlso watch people in YT doing NoPMO, how they overcame this.",
      "created_utc": 1746565728.0,
      "score": 1
    },
    {
      "id": "mnxr08u",
      "body": "its okay to watch porn! wtf lol.",
      "created_utc": 1745075294.0,
      "score": -2
    },
    {
      "id": "mnv6cqg",
      "body": "I agree. The OP's musical acumen is a true gift. 🧠 🎶",
      "created_utc": 1745029775.0,
      "score": 40
    },
    {
      "id": "mnus1mx",
      "body": "you made me check it out too, love it- keep up the good work!",
      "created_utc": 1745024295.0,
      "score": 28
    },
    {
      "id": "mnwoj93",
      "body": "That's a really good advice. Better than I could have ever done. Keep it up!",
      "created_utc": 1745059678.0,
      "score": 6
    },
    {
      "id": "mnvnpxy",
      "body": "Preach 🙌",
      "created_utc": 1745037480.0,
      "score": 3
    },
    {
      "id": "mnvsj9f",
      "body": "Everyone genuinely look at his stuff though. Its really good!",
      "created_utc": 1745040016.0,
      "score": 3
    },
    {
      "id": "ms0xasi",
      "body": "I'm so cooked 😭 🤠🤠🤠🤖",
      "created_utc": 1747103557.0,
      "score": 1
    },
    {
      "id": "mp20xcs",
      "body": "Source?",
      "created_utc": 1745622860.0,
      "score": 1
    },
    {
      "id": "mnvm1ta",
      "body": "I agree with this having a partner can help out tremendously. I've struggled with porn, however a clear way to know of your addicted. Is if you have urges while in a relationship.",
      "created_utc": 1745036665.0,
      "score": 9
    },
    {
      "id": "modx1ya",
      "body": "Idk... that's a good question, though. I'll have to reflect more.",
      "created_utc": 1745300332.0,
      "score": 2
    },
    {
      "id": "modz262",
      "body": "I'm at a point in life where I don't need a gf now. I gotta focus on me cause I'm a mess.",
      "created_utc": 1745301458.0,
      "score": 2
    },
    {
      "id": "modypgg",
      "body": "I watched porn for a very long time. Pretty much daily. There are many times when I didn't even wanna do anything productive at all, but watch porn for hours. Shit... even the stuff I watched sucked. I had to reflect on myself, and I haven't watched porn since I made this post. I just can't anymore.",
      "created_utc": 1745301259.0,
      "score": 1
    },
    {
      "id": "mnvo2ns",
      "body": "Lol I tried to look for it as well. I can't seem to find it. Be glad if you helped. Maybe the links no longer available on their Bio or Old posts.",
      "created_utc": 1745037661.0,
      "score": 6
    },
    {
      "id": "ms0xpkb",
      "body": "U should be fine. Its possible",
      "created_utc": 1747103709.0,
      "score": 1
    },
    {
      "id": "mofpu37",
      "body": "Oookay. Is it the religious reasons that makes you feel bad or you just don’t feel productive? I sometimes do it three times a day and still get my shit done :)",
      "created_utc": 1745332172.0,
      "score": 1
    }
  ]
}