{
  "id": "1k7o3th",
  "title": "Why do people punish and gaslight us for being suicidal?",
  "selftext": "Whenever I’m suicidal, I try to find a way to do it. And every resource I end up with, I’m told “You have so much to live for.” “You are loved.” “You will be missed.”\n\nThey don’t know that. I’m stuck at my job until I die and there’s literally no way out as my boss refused my resignation and, after that, still tears into me on how bad I’m doing. And I can’t get hired anywhere else, as the job market sucks and I don’t interview well.\n\nI want to die. Either help me or ignore me, but don’t you fucking tell me that life is a gift. Because all it is is a curse.",
  "created_utc": 1745595743.0,
  "score": 479,
  "num_comments": 106,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1k7o3th/why_do_people_punish_and_gaslight_us_for_being/",
  "comments": [
    {
      "id": "mp1kvw4",
      "body": "> And every resource I end up with, I’m told “You have so much to live for.” “You are loved.” “You will be missed.”\n\nFWIW, any kind of impossible reassurance or generic \"uplifting\" platitude like those are *against the rules* here.  We will deal with people who post that sort of garbage but we need the community to report them.\n\n**Edit**:  Since I seem to have unintentionally created some confusion here,  please be aware that *all* our policies are based on the most reliable, current evidence available for best practices in suicide intervention and mental-health peer support.  (I personally have  experience as a trainer and responder at an IRL hotline in addition to what I do here.)  One of the biggest problems here is well-meaning but ill-informed people posting *toxic* \"positivity\".  A lot of things that are thought of as \"encouraging\", and which might well cheer up a *sad* person, can easily push a *suicidal* person toward, or over, the edge. \n\nFor more information and background, please see [our talking tips wiki](https://www.reddit.com/r/SuicideWatch/wiki/talking_tips) and the resource posts linked from [Guideline 4c](http://redd.it/1cep2h) and [Guideline 4d](http://redd.it/25igd7).",
      "created_utc": 1745617427.0,
      "score": 1
    },
    {
      "id": "mp0fbmi",
      "body": "right, it pisses me off so bad. people just toss assumptions about my life and *assume* i can get better without actually putting themselves in my shoes or making an effort to even *imagine* how i feel on a literal MINUTE-BY-MINUTE BASIS.\n\nit almost pisses me off as much as people suggesting a suicide hotline.",
      "created_utc": 1745604754.0,
      "score": 96
    },
    {
      "id": "mp0cmy3",
      "body": "I so fucking get it, nobody is ever able to tell me what about living is so flipping fantastic.",
      "created_utc": 1745603971.0,
      "score": 44
    },
    {
      "id": "mp0cxza",
      "body": "If someone tells me that I ignore or block them",
      "created_utc": 1745604059.0,
      "score": 29
    },
    {
      "id": "mp0pi2u",
      "body": "I know, nobody ever tells you these things when you’re just living. But the moment you’re struggling, suddenly everyone cares",
      "created_utc": 1745607776.0,
      "score": 29
    },
    {
      "id": "mp0v26b",
      "body": "Yeah.. and even if you are missed or loved or whatever it still doesn’t stop the hopelessness that makes you suicidal",
      "created_utc": 1745609468.0,
      "score": 26
    },
    {
      "id": "mp0uztv",
      "body": "I wish I could answer this question myself, I have to gaslight myself and have to live in another reality inside my head to cope. Life sucks",
      "created_utc": 1745609448.0,
      "score": 14
    },
    {
      "id": "mp0sgci",
      "body": "I think they just want to cheer you up. But for the most of us it's the thousendth time we hear that. Maybe we belived it 10 year's ago when we heard it the first time but after hearing it over and over again and see the result that it doesn't get better we probably see it as lying or gaslighting.",
      "created_utc": 1745608674.0,
      "score": 13
    },
    {
      "id": "mp3yqx3",
      "body": "People who managed to get pass trauma by themselves just gaslight others becaus they themselves \"did it\", some are worse to have God's complex, and will completely place everyone else below them, whether it is about suicidal or not. Ofc, this argument also sounds weird because if they have challenged the storms of their lives they should know better that how it really is to be stuck with no escape, no meaning, no hope.\n\nAs much as deep inside I wanted and hope that you can find the smallest light at your tunnel so that you can have something to linger on your life, I am so totally agree to you. People are just so ridiculously ignorant, insane and super arrogant. Either they are bad with words, or they simply think if they can walk out their so-called \"therapy\" that they offer to someone they should be considered a hero.\n\nThese people watch motivation videos and thought throwing a good bucket of water on to the victim is gonna work, or they have their hardships that is undercompletely **different** circumstances and then blame that you should be able to cross them. They have not realized by themselves that in the moment their family and relatives cornered them because they did a bad exam score, a random teacher came to move them out. People simply, by intent or not, forgot that some of us just **simply. doesn't. have. an. OPTION!?**\n\nTl;dr: Survivors just tend to dunk down on others who is struggle. That's stupid society. I hope all the best to you. I hope that you will make a choice that you will find comfort with it.",
      "created_utc": 1745651817.0,
      "score": 12
    },
    {
      "id": "mp1x2mm",
      "body": "Because they’re afraid",
      "created_utc": 1745621541.0,
      "score": 7
    },
    {
      "id": "mp26h8g",
      "body": "It's for them. They don't want to recognize what you're going through, and having an easy response makes it easier to ignore you. This way they don't have to internalize anything you're saying or experiencing. They don't want to feel or think about your pain. Like when we pretend to support the unhoused population while simultaneously not wanting them on our streets or in our parks.",
      "created_utc": 1745624738.0,
      "score": 3
    },
    {
      "id": "mpcmgnv",
      "body": "Because they don’t really care. They say they do, but they don’t. Plus they don’t want to feel guilty.",
      "created_utc": 1745777226.0,
      "score": 5
    },
    {
      "id": "mp1o5de",
      "body": "That's just how it comes out. But it's difficult to address suicidal thoughts, they're not feeling what you're feeling. Like despair, hopelessness, or worthlessness, plenty of different flavors of suicidal thoughts that string along from a trail of thought that lead you here. And it's difficult to work that into a conversation with friends who say the wrong thing if you were direct to the point.",
      "created_utc": 1745618483.0,
      "score": 3
    },
    {
      "id": "mp3a4md",
      "body": "I’m not understanding the refusal of the resignation.  The 13th amendment exists.  You can’t be forced to work for anybody you don’t want to as long as you are not incarcerated.",
      "created_utc": 1745639250.0,
      "score": 3
    },
    {
      "id": "mpecrpg",
      "body": "Yea I always hated that imagine telling someone completely alone that \"your family loves you\" like bitch I don't have a family and guilt tripping you like you are a child and won't understand what they are doing they come off as assholes who don't care about you and are just reciting some script to get paid like if I had people that loved me and if I had so much to live for I wouldn't be fucking suicidal",
      "created_utc": 1745797161.0,
      "score": 3
    },
    {
      "id": "mpmsv57",
      "body": "I hate when people try to advocate their religion to me. I don’t care if I “burn in hell” according to them. If they are really that curious if I’m going to heaven or hell maybe they should accompany me. Times like these make me more suicidal than ever.",
      "created_utc": 1745920398.0,
      "score": 3
    },
    {
      "id": "mpq7z6n",
      "body": "True. I'm so tired of having to live for other people, been doing that my entire life... I told my therapist that I wish I have a reason to live that is just for myself. People are constantly saying \"what will happen to *** when something happens to you?\" Then guilt tripping when you say you want something for yourself.... Idk I'm so tired",
      "created_utc": 1745960467.0,
      "score": 3
    },
    {
      "id": "mp0ruaj",
      "body": "Whachu mean? U can still apply to other jobs and when u land one, just don’t show up to current one. Fuck em.",
      "created_utc": 1745608489.0,
      "score": 5
    },
    {
      "id": "mpzyjvm",
      "body": "I'm not suicidal but that \"you are loved\" line just pisses me off since it's a general cliche used to comfort people who are sad or depressed also.  Me and many others have no one who genuinely loves them and it feels like twisting the knife.  You are loveable would be better but still not the greatest thing to say.",
      "created_utc": 1746097394.0,
      "score": 2
    },
    {
      "id": "mpdcl5w",
      "body": "If you reside in America, this is one of the rare moments where at-will employment works for you as an employee. Your boss can terminate the working relationship without cause or notice and that's the law, but you have that exact same power. You've already done more than enough by giving notice in the form of a resignation. Whether your boss \"refuses to accept\" is immaterial, and you can walk away whenever you're ready.\n\nThat obviously doesn't help with the job market or interviews, but hopefully it's one less thing weighing you down.",
      "created_utc": 1745785346.0,
      "score": 1
    },
    {
      "id": "mpyut3c",
      "body": "I am hearing you. It's so wrong. I'm told all the time I'm very selfish for having suicidal thoughts by the person who abuses me and has made me feel this way in the first place",
      "created_utc": 1746074221.0,
      "score": 1
    },
    {
      "id": "mq0jhrf",
      "body": "My MIL caused   me to have such crippling and severe depression  that I tried twice with pills. Everyone just got angry with me.  No one asked why. Last February when I decided to go no contact with her  because once again it was one comment too many and I was contemplating trying again. The difference is I have my daughter even though she is a young adult (22). And she  suffers from severe depression thanks  my mother-in-law as well and is a cutter. She noticed I wasn’t the mother she was used to and  me about it she knew I suffered from depression, so I decided to confide in her what I was feeling at that stage. she didn’t try to make me feel bad she cried but she cried with me and she gave me hugs And we talked for a couple of hours and we discussed what we each went through. I also suffer from a few health issues. And this wasn’t helping either, but by the end of the night the Urge to swallow all the different pills that the doctor had prescribed  to me had gone.",
      "created_utc": 1746105853.0,
      "score": 1
    },
    {
      "id": "mq0wjqw",
      "body": "Because we are resources to the happy and successful people. Without us, they will have to fill our roles and they will have nobody to look and and say \"at least im better than him\"",
      "created_utc": 1746109998.0,
      "score": 1
    },
    {
      "id": "mq3as0u",
      "body": "World is messed up and we don't handle things the same, we have different traumas and problems. But as someone whose Brother killed himself and they didn't know he would do it, and now I am here because of his death. To sum up, this is terrible, those people don't see any other options and they don't talk about. Most people Just need Attention, so sometimes I don't believe to some 'suicidal' people and how easy they talk about it wtf.\nPleasee find professional help and talk with your close ones, its hard and its a process. ",
      "created_utc": 1746135258.0,
      "score": 1
    },
    {
      "id": "mq4fm7o",
      "body": "[removed]",
      "created_utc": 1746149273.0,
      "score": 1
    },
    {
      "id": "mq8fnll",
      "body": "From some experience, I can say the following: the best way to overcome suicidal thoughts is through real help in what caused these thoughts. But this method has a significant disadvantage - it is often financially costly. And the encouraging phrases are \"anesthesia for conscience,\" supposedly helped, but did not spend anything. But here I spoke too harshly about the \"advisers\". Still, that's not all. I think most of them would sincerely like to help, but they don't know how. And they try so hard to do at least something, because they don't understand how they could help a person. I've read your situation... And I'm confused myself as to what could help here.",
      "created_utc": 1746207795.0,
      "score": 1
    },
    {
      "id": "mq91ap4",
      "body": "Yes, I understand that. I often wish I could disappear without a trace, without anyone mourning my passing.",
      "created_utc": 1746214119.0,
      "score": 1
    },
    {
      "id": "mrdvpiq",
      "body": "It pisses me off too. Especially when it’s the people who haven’t been there for me and never showed up when I reach out for help. They say that we can talk to them whenever, but they never actually show up when you DO reach out. Only for them to say stuff like that\n\nIf people would actually miss me, then respond and make the effort to be there when I need help. Not when I’m on the verge of giving in.",
      "created_utc": 1746777431.0,
      "score": 1
    },
    {
      "id": "mpad7q5",
      "body": "Life isn’t easy, it’s beautiful, but not beautiful enough for suicidal people, I have been suicidal before, it really does suck. What worked for me probably won’t work for you, but indulging myself in 24/7 of things that I find comforting helped a little with coping",
      "created_utc": 1745746507.0,
      "score": 1
    },
    {
      "id": "mozlkjw",
      "body": "I kinda understand.. but Imagine the other way around if you are happy and someone asks if they have an idea How to end it will you give them ideas on how to do it ? Probably not. Because first as a happy person you see the positive optimistic things can change. Then the guilt of giving someone tips on how to do it. If they do it you will feel very bad and Even if they don t you will feel bad cause it s like giving a knife to someone Who s vulnerable. But I understand I really wished that it was possible to access this kind of information..",
      "created_utc": 1745596178.0,
      "score": -3
    },
    {
      "id": "moztn5u",
      "body": "There is always next. Life stations are temporary. Ive high highs and low lows. But i know it doesn't stay. Whatever hole u fall in it wont be where u end up even though the pain or joy tells u otherwise.",
      "created_utc": 1745598553.0,
      "score": -1
    },
    {
      "id": "mozzmwv",
      "body": "Always. But no one stays. There's always next even if u can't see it yet. Idk how old you are but in 5yrs 10yrs u could be in a whole different country, relationship, tax bracket with all new hobbies and friends. And in 5 - 10yrs ur life won't be perfect. Always gonna have highs/lows. Also, idk much about much so professional help would be advised. Maybe meds? I'll always a rando to talk to tho.",
      "created_utc": 1745600274.0,
      "score": -1
    },
    {
      "id": "mp18x53",
      "body": "I think the point is that you'll have a better time being a loser than being dead. I think that's why. \n\nDeath might suck in a sense that you'll have eternity to reflect, and youd reflect on being a loser, living forever in that idea, defeating the purpose of suicide, which was to escape the idea of being a loser. I mean you might not escape the feeling and only end up in a weird eternal realm of memories, having no way to add any experiences.",
      "created_utc": 1745613695.0,
      "score": -4
    },
    {
      "id": "mp4ky7k",
      "body": "Look, none of us DESERVE to be here, but we are, so we might as well make the most of it why we are. There will be more shitty days ahead, but there will also be better days ahead. Look forward to the better days homie",
      "created_utc": 1745665175.0,
      "score": -1
    },
    {
      "id": "mpal3ag",
      "body": "You are never stuck at any job unless they lock you up. Its not a reason to go out on life itself. \n\n\nYou can still focus yourself on something else to make money, start thinking about something else you could do on the side and keep growing it until you can leave the job you have now. \n\n\nAlso maybe put in perspective that some people have it much much worse and still keep on living. ",
      "created_utc": 1745751290.0,
      "score": -1
    },
    {
      "id": "mp2shb5",
      "body": "as humans, are overall goal is to progress, that's how we became the apex predator. A part of that is preventing people In a pack from dying there for reducing the numbers, that's our primal instincts. \n\nWith this information, you can look at this in two ways.\n\n1. It's Purley neurological\n\n2. Humans care about other humans and will do their best to prevent others hurting themselfs in inhuman ways. \n\n\nThis is just my look on it, I'm NOT suicidal, but I hope this explanation helps.",
      "created_utc": 1745632521.0,
      "score": -2
    },
    {
      "id": "mp1voea",
      "body": "You make it sound like it’s your hobby or something lol",
      "created_utc": 1745621058.0,
      "score": -3
    },
    {
      "id": "mp9ft4y",
      "body": "At least you have a job... Others don't. ",
      "created_utc": 1745727172.0,
      "score": -5
    },
    {
      "id": "mp0gnfx",
      "body": "It took me 40 minutes and 2 different IT departments to send a confirmation email because of a system upgrade.\n\nMy boss doesn’t care about that, but asked me why shit didn’t get down for this. When you multiply the length of something easy by 4,000%, that definitely affects your day.\n\nAnd my boss goes “It shouldn’t take that long. Why did you do it that way?”\n\nBECAUSE I WAS NOT FUCKING EXPECTING IT TO TAKE 40 DAMN MINUTES WHEN I GOT ON THE PHONE!",
      "created_utc": 1745605148.0,
      "score": 24
    },
    {
      "id": "mp0mbvp",
      "body": "The only time I’ve ever used a hotline led to my parents thinking I faked wanting to kill myself when I was 13 because they thought it was just me acting out and blew it off as a miscommunication. They indirectly ruined my relationship with my parents more than my dad being a blatant homophobe did. Yeah, I’m never making that mistake again.",
      "created_utc": 1745606833.0,
      "score": 13
    },
    {
      "id": "mp3d4mt",
      "body": "\"Have you tried,  I dunno,  NOT feeling this way?\" \n\nFuck those people who assume this is just a mood.",
      "created_utc": 1745640529.0,
      "score": 10
    },
    {
      "id": "mp1rjz5",
      "body": "Omg yes",
      "created_utc": 1745619634.0,
      "score": 5
    },
    {
      "id": "mpp39o5",
      "body": "Agreed.",
      "created_utc": 1745948798.0,
      "score": 1
    },
    {
      "id": "mp0n0wx",
      "body": "Life is punishment for most of us.",
      "created_utc": 1745607039.0,
      "score": 28
    },
    {
      "id": "mp0uuyf",
      "body": "No, people only care after you’re dead. If they cared while you were alive and in help, they’d…help. Not wash your hands of you by just sending a link to the least helpful resource that exists: 988.",
      "created_utc": 1745609406.0,
      "score": 14
    },
    {
      "id": "mp3eac5",
      "body": "Damn phonies just want to feel like they did something. It's a preventative guilt relief in case you actually do something.",
      "created_utc": 1745641043.0,
      "score": 10
    },
    {
      "id": "mppvyvg",
      "body": "[removed]",
      "created_utc": 1745957057.0,
      "score": 3
    },
    {
      "id": "mu5wydd",
      "body": "Until they eventually do it.",
      "created_utc": 1748177593.0,
      "score": 1
    },
    {
      "id": "mp26vir",
      "body": "definitely it's hope/faith over reality",
      "created_utc": 1745624867.0,
      "score": 7
    },
    {
      "id": "mp0uz1r",
      "body": "I can’t get a job at this wage. Nor can I quit. Until I get a job. But no one wants to hire for the wage I need to live at.",
      "created_utc": 1745609441.0,
      "score": 10
    },
    {
      "id": "mpzppl5",
      "body": "the same, by my m***her",
      "created_utc": 1746092469.0,
      "score": 1
    },
    {
      "id": "mq4g89n",
      "body": "And I'm 35 doing it all on my own sry to right this shit I'm so done that by the time you read this i will put that my 45 in my mouth ",
      "created_utc": 1746149494.0,
      "score": 1
    },
    {
      "id": "mpzz4vp",
      "body": "Just don't give them the tips.",
      "created_utc": 1746097680.0,
      "score": 1
    },
    {
      "id": "mozunyu",
      "body": "But I always end up back low! There’s never a break from it.",
      "created_utc": 1745598853.0,
      "score": 11
    },
    {
      "id": "mq46fpr",
      "body": "Therapy and especially m3dication unfortunately failed me even after multiple attempts at it. I personally do not believe that my feelings or realizations are the result of any mental ailment, nor do I find the future to be worth its risks.",
      "created_utc": 1746145979.0,
      "score": 2
    },
    {
      "id": "mp1cuu1",
      "body": "Yeah. And if you survive until tomorrow, maybe somehow it will be a little better. If you’re dead, you’ll never know if maybe you would have found a way to survive and thrive. At least you’ll have the chance.\n\nEdit to clarify:  OP asked why people say these things. I think this is a reason they do it. It isn’t in anyway meant to be advice to OP or anyone. Just speculation on why people say these things he asked about. I may not have worded it the best.",
      "created_utc": 1745614883.0,
      "score": -3
    },
    {
      "id": "mq46r6x",
      "body": "Some of us may prefer the end over the potential of ever being “locked up”.",
      "created_utc": 1746146093.0,
      "score": 1
    },
    {
      "id": "mq46y8e",
      "body": "This is not at all what I generally observe of humanity, and humans are more than their instincts.",
      "created_utc": 1746146163.0,
      "score": 1
    },
    {
      "id": "mpad99c",
      "body": "Doesn’t help",
      "created_utc": 1745746534.0,
      "score": 3
    },
    {
      "id": "mp3e9eg",
      "body": "that, and \"just get over it\"\n\nthey both piss me off to no end",
      "created_utc": 1745641031.0,
      "score": 9
    },
    {
      "id": "mq7u9p3",
      "body": "The sh*t they try to sell us...\"You are loved\"...dog, if I felt loved..would I be feeling suicidal..I am so unloved..that I am scared to express my mental health issues..to my family.. because I know they will just disown me and move on with their life...!!\n\nYou don't know how I have lived my life...how i have barely scrapped by...day after day.. despite this immense pain... don't lecture me about shit...!!.. either help me or get lost..!!",
      "created_utc": 1746201746.0,
      "score": 2
    },
    {
      "id": "mpq3e8v",
      "body": "They do that so they don't feel guilt. It's all for them. Bunch of self-important losers who think they are taking the high road and can be hailed as beautiful people.",
      "created_utc": 1745959164.0,
      "score": 3
    },
    {
      "id": "mpecxr5",
      "body": "Yea they just say shit to feel better about themselves not because they actually care",
      "created_utc": 1745797219.0,
      "score": 2
    },
    {
      "id": "mq45ozz",
      "body": "I’m trying my best to minimize such horrific grief in others as well, but I fear that may not be enough to keep me here forever. I still want to be able to choose the circumstances of my passing, and I fear lacking that control if I don’t take ahold of whilst I know I may be able.",
      "created_utc": 1746145711.0,
      "score": 2
    },
    {
      "id": "mp1ccrx",
      "body": "I felt that way about my job. It almost killed me. And although I may feel suicidal I don’t want to die from job stress. I thought the same things you do. I couldn’t get hired anywhere else. I’d never make the same money. I was stuck. Turns out that was all my depression talking and my imposter syndrome. I could have left at anytime and several places would have hired me. \n\nMaybe take a step back and fact check your situation. Is it really there’s no other job out there? Or like me were you just stuck thinking the current one is all you deserve?  I made every excuse there was for why I had to stay in my job. They were just my depression keeping me in something familiar.  \n\nI’ve had to learn that although my depression tells me I’m a worthless piece of shit that deserves all the misery I live in everyday, it LIES.",
      "created_utc": 1745614731.0,
      "score": 3
    },
    {
      "id": "mpd3ukn",
      "body": "I feel this hard, i hate my job and it fills me with despair and anxiety but no other jobs will pay me even close to the wage im currently getting so im unable to quit. Its really rough out there right now.",
      "created_utc": 1745782638.0,
      "score": 2
    },
    {
      "id": "mq4ggta",
      "body": "But who cares no one that was me reaching out and I tryed who gave a fuck i got no one I'm truly on my way lord please watch after my kids",
      "created_utc": 1746149577.0,
      "score": 1
    },
    {
      "id": "mq47amt",
      "body": "Im not understanding up the 2nd sentence",
      "created_utc": 1746146285.0,
      "score": 1
    },
    {
      "id": "mq46mdr",
      "body": "Many of us may fear the risks that the future may bring. Some of us may prefer no answer over a painful one regarding how it may have gone.",
      "created_utc": 1746146046.0,
      "score": 2
    },
    {
      "id": "mpk3rd6",
      "body": "I can only agree and sympathise. So, so often, not all people, but too many as far as I am concerned",
      "created_utc": 1745877966.0,
      "score": 1
    },
    {
      "id": "mq80uis",
      "body": "Hell, I KNOW I'm loved by at least one person, and it's not always enough to pull me back from the brink when I'm having ideation.  Do I WANT to cause her pain? Of course not. Does the pain still feel overwhelming as hell? YES.",
      "created_utc": 1746203629.0,
      "score": 1
    },
    {
      "id": "mq4irnh",
      "body": "And I just wanted one person to say it's ok I'm sry be strong lol it really is just me on my own and I feel so bad for myself and hate that I'm used to be so strong with the most beautiful person in the world and I lost it all and now goes my life and  how does that affect my 3 kids lol it's getting so bad that I'm done and I think anyone would be but I will never no it's just me talking to myself cause I have no one no friends no nothing so this sucks it's like I'm a petty Lil bitch but I'm not not I promise if you were in my shoes any person would kill themselves that's a fact and I put lol my life on it or my 2 bucks to my name lol I wish someone would take that bet it's like talking to a wall wait I am good my shit ass world i hope I get reincarnation and become a tick on a pigs ass better then my life lol I hope the rest of the world gets what they deserve ",
      "created_utc": 1746150392.0,
      "score": 1
    },
    {
      "id": "mq47kyj",
      "body": "I don’t believe that my feelings are the result of a mental illness, and I’m afraid of what the future may bring to the extent that I would rather eliminate all possibilities. There are others who feel this way.",
      "created_utc": 1746146387.0,
      "score": 1
    },
    {
      "id": "mq5q0fl",
      "body": "I agree.",
      "created_utc": 1746170369.0,
      "score": 1
    },
    {
      "id": "mq48qr9",
      "body": "I have a better understanding now. All I would say is that that is a belief. Clearly im of a another belief. Ur perception and existence differs from mine. I would fight my pain but I'll never know ur pain.",
      "created_utc": 1746146803.0,
      "score": 1
    }
  ]
}