{
  "id": "1j8zwa4",
  "title": "I've been raped too many times and I'm going to kill myself",
  "selftext": "I’ve been raped more times than I can count or remember starting from the age of 17. All of it is my fault because I just can’t stop getting drunk and blacking out and letting myself get taken advantage of. I almost never fight back (I fought back like once or twice and that did fuck all). No one has ever loved me except for my abusive ex who I would anger on purpose so that he’d hurt me. He raped me too the very last time I ever saw him because he refused tp leave me alone so I just let him do whatever. Every time I trust a man that this time they actually care, they just use me for sex and leave. Everytime I drink to cope and go out, I just get raped again. Anyway, I’m ready to die but still debating on the method. I think pills is the way to go and then just fuck off somewhere so that my family doesn’t have to find my body. Just gonna take a bunch of painkillers so this is my goodbye. For the record I tried, but I'm worth fucking nothing now and deserve to die. Bye ",
  "created_utc": 1741722838.0,
  "score": 527,
  "num_comments": 87,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1j8zwa4/ive_been_raped_too_many_times_and_im_going_to/",
  "comments": [
    {
      "id": "mh9id13",
      "body": "I’m familiar with this hurt. You don’t deserve to die because you fawn (CNS response) and have an issue with drinking, you deserve compassion and rest. Give yourself a big break from this life before you actually end it.",
      "created_utc": 1741723920.0,
      "score": 281
    },
    {
      "id": "mh9x7au",
      "body": "I'm a middle aged man, married 26+ years, have two adult daughters. \n\nI raised my daughters to be very careful what situations they put themselves into for their own safety. \n\nThis however, does NOT EVER agree will NOT EVER justify someone SA you. \n\nThere is a massive difference in taking responsibility for your own safety and the ABHORRENT behavior of taking advantage of a vulnerable person. \n\nDo not ever let anyone tell you is your fault, regardless of what you did it didn't do, the people that assaulted you are 100% responsible for their actions and harm they caused you. \n\nPLEASE do not ever feel that is your fault. \n\nA REAL man that finds a woman in a vulnerable situation would make sure no one takes advantage of you. \n\nPlease find someone you can trust to talk to about this. \n\nI'm so sorry that you have been abused by by weak (that's putting it nicely) men in society. \n\nThere is NEVER an excuse for a man to abuse a women, FULL STOP.",
      "created_utc": 1741728043.0,
      "score": 230
    },
    {
      "id": "mh9hr9y",
      "body": "Getting raped is inherently not your fault. You should be able to go out and have fun without having violence committed against you. I'm sorry you feel worthless. These acts of violence are reflections on your rapists and society as a whole more than anything you did. The world is awful and full of awful people. I don't blame you for wanting to leave it, but just know that it's what and who is around you that's bad, not you. You're just doing your thing. Others initiated force upon you without provocation.",
      "created_utc": 1741723753.0,
      "score": 110
    },
    {
      "id": "mh9qdu2",
      "body": "I know this sounds cliche but it is literally never your fault like it is not possible for it to be your fault. If you really can't stop drinking that is an addiction which is an illness, not a personal moral failing. None of this brings you anywhere near \"deserving to die.\" None of it is your fault. I hope you're able to find the kindness you deserve",
      "created_utc": 1741726134.0,
      "score": 71
    },
    {
      "id": "mhadhy4",
      "body": "I can't imagine what you are going through. Your thoughts are valid. I know a lot of my friends handled the alcohol problem with AA. It's not for everybody, but you deserve a chance.",
      "created_utc": 1741732819.0,
      "score": 25
    },
    {
      "id": "mh9kmjs",
      "body": "just know none of this is your fault. you didnt make those men do anything. u dont deserve to die and i hope you get the help you need.",
      "created_utc": 1741724544.0,
      "score": 27
    },
    {
      "id": "mhbt2ff",
      "body": "No babe none of that is your fault, it is the fault of the people who’ve chosen to commit such atrocious acts. There are many people who can see an unconscious person blacked out drunk and they take care of them instead of abusing them. The suffering you went through has nothing to do with you and everything to do with the evil actions of the people who raped you. I am so truly sorry that you’ve experienced such pain, i can’t even imagine what that feels like. I know what it’s like to feel like death is the solution, but I guarantee you this can all be worked on with a trauma informed therapist who will help you see  that none of this is your fault and help you build yourself back up. Going through that alone is a nightmare that I can understand why it made you arrive at the suicid3 solution, but I hope there are people in your life who care about you and can make you see that you deserve to live and to heal from this. \nThe alcohol problem can be worked on because it’s an addiction and addictions don’t ask for permission to ruin our lives. But we should know that we are not our addictions, they don’t define us and it is always possible to get better from this. I hope you are safe at this time.",
      "created_utc": 1741749994.0,
      "score": 11
    },
    {
      "id": "mhbjc7s",
      "body": "It wasnt your fault",
      "created_utc": 1741746347.0,
      "score": 10
    },
    {
      "id": "mhahw5y",
      "body": "My heart hurts for you. There’s too many ass hole men out there who take advantage of women and it’s not ok, it is only the mens fault. I hope you can go to the ER and someone can give you the care you need for your mental help so you can one day see that you are deserving of respect & love, and none of the POS’s get to take that from you. Keep fighting.",
      "created_utc": 1741734104.0,
      "score": 12
    },
    {
      "id": "mhdlj7v",
      "body": "you are worth it. Instead of killing yourself, Get therapy please. It sounds like you need to deconstruct and reprogram a few things subconsciously and consciously. Also block the abusive ex, he doesn’t love you. Tiny positive steps at a time can make life better. There are better coping mechanisms that you can embrace.",
      "created_utc": 1741784296.0,
      "score": 4
    },
    {
      "id": "mhahe4q",
      "body": "This is not ur fault! But please change how you cope with it! Don’t drink anymore go to therapy get EMDR therapy and live ur life happy! Only u can change how you see things! \n\nI’m a survivor too and yes I thought it was my fault. But it’s not girl you just have to decide it’s ur life and change it do things that make sense and get better. \n\nAnd yes I’m like you falling for the bad once, but I’m sure I have the right one now. Don’t ever think it’s ur fault ever! Either then change the habit and try to avoid situations there you are VALUABLE!",
      "created_utc": 1741733952.0,
      "score": 12
    },
    {
      "id": "mhak7y6",
      "body": "Sweetheart, it’s happened to me as a child and as an adult. You didn’t deserve it and it’s not your fault. You need to talk to someone. Don’t end it. I almost succeeded in taking my own life. I know this pain combined with numbness. \nYour drinking is to cope with what’s happened to you. \nThere is help and it takes time to find better and healthier coping mechanisms.\nIt does get better. \nYou didn’t deserve to be raped",
      "created_utc": 1741734824.0,
      "score": 9
    },
    {
      "id": "mhauhjy",
      "body": "It's not your fault. It's never your fault, no matter what you've convinced yourself.",
      "created_utc": 1741738057.0,
      "score": 6
    },
    {
      "id": "mhbhz91",
      "body": "Holy fuck you alright? I hope you get love one day",
      "created_utc": 1741745872.0,
      "score": 3
    },
    {
      "id": "mhcjcyi",
      "body": "girl don't do it. i can't even imagine what you have gone through. I love you and you're a wonderful human. think about all the things you love to do, your dreams and all. Also, i think your family does love you. So, don't do it, for them. If you want to you can talk to me.",
      "created_utc": 1741763659.0,
      "score": 3
    },
    {
      "id": "mhdp260",
      "body": "Never blame yourself❤️ you are the last person in the world who is to blame. The only one responsible for rape is a rapist.",
      "created_utc": 1741785568.0,
      "score": 3
    },
    {
      "id": "mhdx2ba",
      "body": "It's not your fault. In a decent world anyone can get drunk and no one would take advantage of them. Being drunk =/= consent. Please hold on. Think of the things you still want to do in your life. It's not over yet.",
      "created_utc": 1741788217.0,
      "score": 3
    },
    {
      "id": "mhf4ldq",
      "body": "That’s not your fault I’m sorry. A normal person would understand consent",
      "created_utc": 1741801151.0,
      "score": 3
    },
    {
      "id": "mhbzjco",
      "body": "We'll be here tomorrow, if you wanna talk about it some more. Big, Big Hugs...",
      "created_utc": 1741752742.0,
      "score": 4
    },
    {
      "id": "mhb0lut",
      "body": "It’s 100% not and never going to be your fault. Ever.",
      "created_utc": 1741740031.0,
      "score": 4
    },
    {
      "id": "mhd1n6g",
      "body": "its not your fault",
      "created_utc": 1741775276.0,
      "score": 2
    },
    {
      "id": "mhd2fbj",
      "body": "be the change you want to be in life",
      "created_utc": 1741775703.0,
      "score": 2
    },
    {
      "id": "mhg3qj9",
      "body": "It was not your fault.",
      "created_utc": 1741811152.0,
      "score": 2
    },
    {
      "id": "mhgm2ig",
      "body": "Don't let others control your life. You are in control, and you decide where you go from here. Things can change for better or worse fast\n\nI'll think of you today. You got this",
      "created_utc": 1741816590.0,
      "score": 2
    },
    {
      "id": "mi76cxq",
      "body": "Has the OP given any type of update? If not that's not good. Please 🙏 give an update. And if you read this you need to report these rapes. Rape is serious and even if it's your ex rape is rape.",
      "created_utc": 1742179673.0,
      "score": 2
    },
    {
      "id": "mhbl18r",
      "body": "Being raped repeatedly does not make you responsible!  Just because you are not capable of consent does not give others the right to take from you.  You are not at fault.  Chances are, your body is probably protecting itself from further harm incurring by “giving in,” but that in no way shows how you feel or should fall back on you.  You deserve happiness.  I can’t tell you to stop drinking, but having a companion who will at least keep a close eye on you and protect you if need be is very important.  It may be time to take a break and find someone like that before you enter an altered mindset again.  A good female friend can do wonders, though I understand if you struggle to make connections now too.  I truly wish all the best for you, sweetheart and it is not your fault.\n\nFrom a young age, almost everyone is taught not to take advantage of someone who cannot properly consent.  It says a lot about their characters and how they treat others, but it has no bearing on you.  You are wonderful and deserve none of the things that have happened to you.  You did nothing to cause this.",
      "created_utc": 1741746950.0,
      "score": 3
    },
    {
      "id": "mhpk24b",
      "body": "Look l know how you feel l have been raped so many time l started feeling l was only put on this earth to please men i have had my father l had my two real brothers one l was pregnant to one of them had to have a after pill to get ride of it l been raped by strangers my late husband l did what he wanted because l thought that is what l had to do there would be times he would just help himself so yes l know what you mean and l feel the same way l had my half brother send me a picture of himself which made me sick l blocked him do l trust me heal no do l feel the same way as you do you",
      "created_utc": 1741935980.0,
      "score": 1
    },
    {
      "id": "mi0pyia",
      "body": "Don't you fucking dare you are worth more than a criminal and live life gets legal action against them and if that is not available where you are making them win is the worst thing you can do you will be ok.",
      "created_utc": 1742089215.0,
      "score": 1
    },
    {
      "id": "mi3hrmi",
      "body": "i think the issue here is drinking (which is the fault of your environment, not you), have you considered aa?",
      "created_utc": 1742137340.0,
      "score": 1
    },
    {
      "id": "mi5tfwc",
      "body": "Drunk consent is not consent. forced consent is not consent. If someone gives consent it means that there were no outer forces pressuring them to make their decision. The absence of no is never yes, and I'm so sorry you went through that. \n\nIf you manage to see this comment by now, all I can say is I'm sorry for the loss of your happiness.",
      "created_utc": 1742162533.0,
      "score": 1
    },
    {
      "id": "mieq66j",
      "body": "Sounds like you drink to cope? That kinda makes perfect sense I would to.. I don't think your drinking causes anyone to rape you so never think you deserve that those fuckers belong in jail. If you can somehow get away from where you are it could probably get better... Non of this is your fault but I understand how you feel I'm feeling really bad too it just gets overwhelming.. you can im if you want. 🤗❤️",
      "created_utc": 1742289825.0,
      "score": 1
    },
    {
      "id": "mh9t70g",
      "body": "I need to let you know something serious: I think you should actually take legal actions against rape. I mean it for real, you have to pursue this. Go to the authorities and have these reported. \n\nYes, you can be raped by your partner and it is actually a crime. \n\nTaking advantage when someone is unable to consent is a sexual offence. Please don’t be afraid to do that just because he is ex.\n\nAnd also, you need to get yourself into a new environment, find healthier ways to cope.",
      "created_utc": 1741726904.0,
      "score": -3
    },
    {
      "id": "mha0p8l",
      "body": "[removed]",
      "created_utc": 1741729041.0,
      "score": -22
    },
    {
      "id": "mj9acyr",
      "body": "Well I just got raped again 2 days ago so my attempt at living was BS",
      "created_utc": 1742701476.0,
      "score": 1
    },
    {
      "id": "mhbb2u9",
      "body": "[deleted]",
      "created_utc": 1741743531.0,
      "score": 53
    },
    {
      "id": "mhlqt24",
      "body": "Your children are very lucky to have you as their father ❤️",
      "created_utc": 1741888400.0,
      "score": 2
    },
    {
      "id": "mj9anzk",
      "body": "Honestly, it doesn't make me feel better that these men are weak cause then what does that make me.  Also, I got raped again by another so-called weak man. He choked me so hard that my neck and chest hurt really badly days later. I don't belong in society anymore.",
      "created_utc": 1742701613.0,
      "score": 1
    },
    {
      "id": "mj9awbt",
      "body": "I've given myself chances for four years. It's only getting worse and I'm done with it.",
      "created_utc": 1742701716.0,
      "score": 1
    },
    {
      "id": "mj9azs1",
      "body": "A few days ago I kept annoying a man that was raping me so he'd choke me to death. Sadly, he didn't kill me but he def hurt me a lot. But kinda my fault for making him do it, no?",
      "created_utc": 1742701759.0,
      "score": 1
    },
    {
      "id": "mj9b4le",
      "body": "Update is I failed to kill myself and went and got raped again instead. So I'm moving forward with the original killing myself plan.",
      "created_utc": 1742701820.0,
      "score": 1
    },
    {
      "id": "mj9b7q5",
      "body": "I don't have friends anymore cause I've gotten rid of them all. No one can stand to be around me unless it's to use me for sex.",
      "created_utc": 1742701859.0,
      "score": 1
    },
    {
      "id": "mh9uklm",
      "body": "Taking legal actions is not easy, affordable, and it's mentally draining for somebody who's already at their lowest.\n\nAnd trying to prove it to authorities can create a whole new type of trauma.",
      "created_utc": 1741727296.0,
      "score": 17
    },
    {
      "id": "mhwjz4v",
      "body": "It don’t work the system is corropt I did but the case was nothing they still GO FREE",
      "created_utc": 1742037242.0,
      "score": 1
    },
    {
      "id": "mhauss7",
      "body": "shoo shoo",
      "created_utc": 1741738158.0,
      "score": 9
    },
    {
      "id": "mhage7x",
      "body": "completely inappropriate get out",
      "created_utc": 1741733657.0,
      "score": 14
    },
    {
      "id": "mk0g4za",
      "body": "Your attempt at living was successful. You lived.\n\n\nYour rapist is the only one to blame for the rape. They're the one who failed at life. \n\n\nYou'll have to be more careful and you need a professional to help you work through these feelings. \n\n\nBut please don't act on them. You deserve a good experience in the world and the world needs a good you in it. \n\n\nAnd keep away from the alcohol, it's seriously one of the worst most harmful drugs... ",
      "created_utc": 1743083865.0,
      "score": 2
    },
    {
      "id": "mhbsqnt",
      "body": "\nOne of the biggest insults you can tell a man is to say he is weak. Rape is more about power than about sex. Men like this imo, are weak, a real, strong man, would project her not harm her.",
      "created_utc": 1741749863.0,
      "score": 94
    },
    {
      "id": "mhby8dc",
      "body": "[deleted]",
      "created_utc": 1741752161.0,
      "score": 33
    },
    {
      "id": "mhdm1lh",
      "body": "This response was weak. Instead of agreeing with what this man is trying to say, you attack his use of vocabulary lmfao. Pick arguments with people on other pages rather than than a page that could use more positivity than negativity.",
      "created_utc": 1741784487.0,
      "score": 11
    },
    {
      "id": "mhg4msx",
      "body": "you have totally missed the really good sentiment of this guy's comment by arguing this tiny detail out. he obv doesn't support rapists",
      "created_utc": 1741811403.0,
      "score": 5
    },
    {
      "id": "mjc59o8",
      "body": "I'm very sorry you have gone through all of this. \n\nIt's not that they are weak physically but they are weak in integrity and honor.",
      "created_utc": 1742749449.0,
      "score": 1
    },
    {
      "id": "mhc5eok",
      "body": "I do not downplay the trauma. But you are advocating for a “kinder” way which does not help or serve the OP long term. \n\nIs this true help? Asking someone to be silent when they are abused?",
      "created_utc": 1741755568.0,
      "score": 2
    },
    {
      "id": "mhyohbd",
      "body": "If authorities isn’t the right place to go, then to organisations who can advice on rape issues. \n\nHowever, OP just needs to get away from this situation. \n\nLegally and physically away from this abuser.",
      "created_utc": 1742064320.0,
      "score": 1
    },
    {
      "id": "mi39m7u",
      "body": "We dont know if OP is a she, but yes.",
      "created_utc": 1742134675.0,
      "score": 1
    },
    {
      "id": "mhhm2kq",
      "body": "Who goes to prison? Rapists",
      "created_utc": 1741827945.0,
      "score": 1
    },
    {
      "id": "mhhlzme",
      "body": "[deleted]",
      "created_utc": 1741827918.0,
      "score": 0
    },
    {
      "id": "mhcesuf",
      "body": "They're wanting to kill themselves. Respectfully, who gives a fuck about long term right now?\n\nYou don't help victims by making them feel trapped & obligated to do something that is emotionally draining on top of the abuse.\n\nI've been in her situation. I was forced to get a rape kit, tell police, get a lawyer, and tell a bunch of people who I didn't want to. It traumatized me almost as much as the actual abuse.\n\nI know it's not want you want to hear because you want justice. I understand that. But you have to think of the victim first, not just incarcerating the assaulter. I say this as somebody who wish they had a choice.",
      "created_utc": 1741760820.0,
      "score": 4
    },
    {
      "id": "mhleo5q",
      "body": "Well, OK. Let's call them dickheads, rapists, scum, lowlife, subhuman nobodies.\nI hope OP did not go ahead with it after all.\nI feel rage and saddness. Chills my deathwish a bit.",
      "created_utc": 1741885005.0,
      "score": 0
    },
    {
      "id": "mhcl0dg",
      "body": "I agree that you’re right by not wanting OP to feel trapped at this stage. But eventually she will need to break out of this cycle which is sucking her back in and killing her. And this is why I suggested she needs a new environment, away from all this. When she has the capacity, she can pursue justice. The goal is to break out of this cycle she is currently in and making her feel miserable.\n\nAnd also, it’s not an easy journey you went through. I’m sure your experience are much valuable to victims (tho is it not fair you went through it) and hope you find the healing you need.",
      "created_utc": 1741764727.0,
      "score": 2
    },
    {
      "id": "mj9at6q",
      "body": "Shoulda just killed myself cause I went and got myself raped again",
      "created_utc": 1742701677.0,
      "score": 1
    }
  ]
}