{
  "id": "1j2agph",
  "title": "I was raped by my coworker/friend’s husband last night. I can’t stop thinking about ending it all.",
  "selftext": "Title pretty much sums it up. Have a coworker that I clicked with. Went over to her house and had some drinks and danced. My friend went to bed. Shortly thereafter, her husband got on me and started taking my pants off. Then started to rape me. I said no and that I didn’t want this. Tried to push him away. He wouldn’t stop. He finished without protection.\n\nI’m absolutely horrified. I have no one to talk to about this. I’ve been sitting in bed sobbing all day. I feel so fucking gross and disgusting. I can’t shake the anxiety. I feel like I’m about to have a nervous breakdown. I managed to go to the store and got Plan B. I was already feeling very depressed lately but after this whole ordeal, I feel like taking myself out really sealed the deal for me. \n\nAlso I’m gay and have a girlfriend of 7+ years and I’m horrified to tell her. She will be so upset. All of this is too much to handle. I can’t function right now. \n\nThe friend/coworker of mine also has two little girls with this guy. I know it’s the right thing to do, but a report would probably absolutely shatter their family. They have their parents from out of the country that are moving in with them soon. If I spoke up I’d ruin everything for them. Then I’m worried about how I’m supposed to work with the coworker with a straight face and act like everything if fine. Then I’m worried that I’m fucking pregnant… there’s no way I can take care of nor want a child this time in my life. I also couldn’t carry my rapists child. That absolutely haunts me. I didn’t want any of this to happen. I wish I could reverse time. I’m at a complete loss and I’m totally broken. ",
  "created_utc": 1740975932.0,
  "score": 845,
  "num_comments": 126,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1j2agph/i_was_raped_by_my_coworkerfriends_husband_last/",
  "comments": [
    {
      "id": "mfqez2y",
      "body": "[removed]",
      "created_utc": 1740977783.0,
      "score": 899
    },
    {
      "id": "mfqf490",
      "body": "You’re not “shattering their family” the guy shattered it and you’re just enlightening the family to who he really is. Report it and you can possibly save someone else from being taken advantage of in the future.",
      "created_utc": 1740977845.0,
      "score": 257
    },
    {
      "id": "mfqe6zw",
      "body": "Omg i feel so sorry for u, i would say report him because his little girls ain't even safe with him, tell this to ur gf and ur friend. It's the only right thing to do.",
      "created_utc": 1740977437.0,
      "score": 160
    },
    {
      "id": "mfqdlyg",
      "body": "Sorry to hear that. You have to tell her what kind of man he is. You should have also visited hospital and get a report for rape and then report to police with sperm sample reports. I hate the idea of letting someone like that disgusting people get away with it and victim suiciding..\n\nPlease be strong, you are good person and have a kind heart. Just do the right thing now and dont let this change you :3",
      "created_utc": 1740977177.0,
      "score": 97
    },
    {
      "id": "mfqm1fr",
      "body": "End his life by putting him in jail. His kids need you! He ruined his life, not you! He did this! Please tell someone.",
      "created_utc": 1740981156.0,
      "score": 43
    },
    {
      "id": "mfqbulh",
      "body": "My god, my heart is beyond shattered for you. I hope you stay and get to see justice done to that monster in some way. \n\nI hope you're safe, and I hope you'll consider telling the police what happened. Make that piece of shit pay.",
      "created_utc": 1740976413.0,
      "score": 61
    },
    {
      "id": "mfqeuz2",
      "body": "I am so sorry! Please consider filing a report & please get yourself checked by a medical professional. I am so sorry you’re going through this. My heart breaks for you.",
      "created_utc": 1740977734.0,
      "score": 28
    },
    {
      "id": "mfqe72z",
      "body": "I'm so sorry that that happened to you but even though you fear shattering their family, your friend deserves to know the type of man that she is married to in case he may hurt her or one of their children. I'm so sorry that all of this happened to you again and you didn't deserve it.\n\nYou could be saving them from him because you never know just what is actually going on behind closed doors",
      "created_utc": 1740977438.0,
      "score": 20
    },
    {
      "id": "mfqiiyl",
      "body": "Girl, don’t worry about the people who hurted you, just do a police report.",
      "created_utc": 1740979406.0,
      "score": 16
    },
    {
      "id": "mfqms8a",
      "body": "Hang in there OP. Destroy this foolish toilet.",
      "created_utc": 1740981542.0,
      "score": 16
    },
    {
      "id": "mfqnvjg",
      "body": "You gotta call the police so those kids don’t get raped too",
      "created_utc": 1740982128.0,
      "score": 15
    },
    {
      "id": "mfqo1al",
      "body": "If he was comfortable enough to do that to you, he might be also doing it to your friend. Maybe even their kids. Please don't let that sick freak get away with it.",
      "created_utc": 1740982214.0,
      "score": 14
    },
    {
      "id": "mfqnusa",
      "body": "I'm so, so sorry that you've gone through this degree of violence. I know it can feel incredibly overwhelming to pick up the shattered pieces of your life and move forward. \n\nFirst off, can you write down a list of people you trust and have an uncomplicated relationship with, and think about which one you feel like you could talk to about this? If you have a therapist or mental health professional, that'd be a great start. Friends, family, or your girlfriend (but I know you said she may be upset) are also solid choices. The number one predictor of developing PTSD or not after an isolated event is whether you feel like you have community, so it'll help.\n\nSecondly, it would be the safest path to take if you were to seek medical care. That can be through the ER if you want the **option** to report legally in the future, it doesn't mean you have to take that now (or ever). It can also be an urgent appointment with a trusted PCP, or a clinic like planned parenthood where they are trauma informed. They can give you things like PEP to cut down on STI risk, they can send you to more resources, and they can help do some of the work so that you aren't juggling emotional healing and logistics.\n\nIn the meantime, be as kind to yourself as you would to a child whose house just burned down. Comfort food, favorite reruns, bath bombs, comfy blanket, whatever your happy place is. Tetris is great for PTSD risk as well. If you think you can handle it, you can at least tell your girlfriend that something really horrible happened, and that you would really like some extra love and patience. And try to remember that you are the only person you need to worry about taking care of right now. To report at work or not, to tell everyone or hardly anyone, to talk to or block your coworker no explanation; no one else's opinions matter right now. if it'll help you, do it. If it won't, don't.",
      "created_utc": 1740982117.0,
      "score": 11
    },
    {
      "id": "mfqhdn7",
      "body": "I’m so sorry this happened to you. You’re allowed to take as much time as you need to process this traumatic experience. There is no shame in asking for support or taking medications to cope. But please don’t do anything to hurt yourself. You’ve been hurt enough already and you don’t deserve that. I know it’s really hard but I do believe you will feel better in the long run if you tell your coworker what her husband did. If you keep it a secret the feelings of shame and disgust will only fester and justice has no chance of being served. Men who commit crimes like this should not be allowed around children and it is in the family’s best interest if the law gets involved and a restraining order can be issued to keep him away from the woman and children around him. If he did it to you, there is a large chance he will do it again to someone else. I’m wishing you the best going forward. Please be gentle with yourself. The only person in this situation who deserves scorn is the man who assaulted you.",
      "created_utc": 1740978867.0,
      "score": 9
    },
    {
      "id": "mfr5zqg",
      "body": "As a male healthcare professional I am totally appalled reading this and I deeply hope you are able to get good treatment for this awful thing that has happened. You are brave for talking and having a clear head about the next steps and don't feel any shame or awkwardness. Your colleagues and fellow nurses would never shame you and I'm certain just want you to get the best care possible right now. \n\n\nPlease look after yourself and take it slow and steady. You are a good person who helps other human beings every day. Now it's your turn to get some care.",
      "created_utc": 1740992996.0,
      "score": 7
    },
    {
      "id": "mfs1iqc",
      "body": "You are not thinking clearly. You MUST report this right now.",
      "created_utc": 1741009605.0,
      "score": 5
    },
    {
      "id": "mfqt4ze",
      "body": "This could happen or has happened to his daughters or someone else that went over to their house it is your responsibility to protect other woman. Stopping abuse starts with talking about it",
      "created_utc": 1740985032.0,
      "score": 3
    },
    {
      "id": "mfz1zts",
      "body": "It’s obviously not the exact same situation. But I was raped about 8 months ago. \nAs it was different circumstances, I couldn’t believe what happened was rape but my body knew even if I mind didn’t. \nI went to the sexual health clinic the next day (was also unprotected). They were so professional and nice and rlly helped me by telling me what my options were. So I would go to your local one immediately. They will fully assess you and give you your options, it rlly puts your mind at ease, as you’re not constantly questioning your health. \n\nI didn’t report because I didn’t feel comfortable doing so. And the guy wasn’t someone I knew, so totally different situation. At this stage just think about it. In my experience telling someone(my friend) helped me think it through, it was useful to have an outside, honest view and have their opinion. \n\nAs for your girlfriend, she’ll know that you couldn’t change the situation as you clearly did not consent, it sounds like she cares a lot about you. For me telling my mother was incredibly hard and took a lot of effort and, yes, she was shocked and upset which was kind of annoying to deal with on top of everything (temporary physical trauma), yet understandable on her part tho. However ultimately it was more helpful to tell her so she was fully aware of why I may act a certain way than to not. Especially if they are a significant person in your life. And don’t get me wrong when the mental illness, illnesses you’re going to question ever telling anyone, but for me it fluctuates and ik ultimately it was better to tell someone ik than to keep quiet. \n\nLastly I was also rlly depressed at the time and still am. I’m just trying to make what I can, with what I have one day at a time. Which sounds mundane and tiring but it’s all I can do. I just doodled (doesn’t have to be good), and watched TV to help get my mind from fixating; I was also recommended to have something like an essential oil that can help you focus/bring you back when ur mind starts to wonder. Unfortunately I haven’t found the cure for depression :(\n\nI just thought I would share what I did and what helped me. I hope it made sense and might potentially help you because everything seems daunting right now.",
      "created_utc": 1741102001.0,
      "score": 6
    },
    {
      "id": "mfqtvui",
      "body": "I feel sorry for you. Please speak up and don’t think that you’ll shatter his family. He’s the one who did it, not you. You are the victim here.",
      "created_utc": 1740985457.0,
      "score": 4
    },
    {
      "id": "mfqvvqr",
      "body": "POLICE POLICE POLICE POLICE POLICE. CALL THE DAM POLICE. \n\nIF HE HAS DONE IT TO YOU THINK ABOUT OTHERS AND THE YOUNG GIRLS. \n\nSorry to hear this but need to get hik locked up. No matter what it does to the family it is better then him doing it to one of the girls. \n\nThis is not your fault not in anyway.",
      "created_utc": 1740986617.0,
      "score": 4
    },
    {
      "id": "mfrdo5u",
      "body": "please please report him. think about the other girls he might rape",
      "created_utc": 1740997897.0,
      "score": 3
    },
    {
      "id": "mfu61bv",
      "body": "Why would your gf be upset? If your gf is mad for you getting raped, fuck her off as well and start prioritizing yourself. Please, for the love of the universe, take care of yourself. NOBODY ELSE, only you right now matter. Heal, join the rest of us who are dying to get to know the real you and next time always carry a knife (I'm kidding, scream if there's ever a next time). I'm so sorry but I'm not gonna pity you. This will not shape you into a horrible person. This is only going to be an example of how sad someone else became that they needed to transfer their pain onto you. It's not yours to carry, sister. Do whatever you want but don't let someone else's pain put you down. Hopefully none of this is invalidating",
      "created_utc": 1741032662.0,
      "score": 4
    },
    {
      "id": "mfva9j6",
      "body": "Him having two little girls in the house is even more reason to report him. No telling what he will or already is doing to them.",
      "created_utc": 1741044483.0,
      "score": 3
    },
    {
      "id": "mfqqhzl",
      "body": "I’m so sorry this happened to you. I completely understand how overwhelming and terrifying this is. I felt the same when I was assaulted.\n\nI really recommend you get a rape kit done at a hospital. The staff will not force you to report what has happened to you to the police. They’re very gentle and kind and will most likely call in a rape advocate to give you company if you ask. They will take whatever evidence or statements you feel comfortable giving, and nothing else. Though if any of this still makes you anxious, you’re free to call a nearby hospital or local rape advocate center to ask about the legalities and where you can go.\n\nIt’s your decision to report what happened, but just know it’s better to have that evidence on hand no matter what. \n\nYou’re not breaking up a family. Just know that you would be protecting those children from a predator if you decide to report what happened to you.\n\nYour girlfriend will be upset, but not at you. Someone she loves has gotten hurt. It wasn’t your fault. You didn’t deserve this. \n\nYou’re having all these horrible thoughts jumbled in your head and you really don’t deserve that. I felt the exact same way after my assault. I couldn’t function for months. I’m now currently in therapy and working on my own healing journey. I truly wish the best for you.",
      "created_utc": 1740983543.0,
      "score": 3
    },
    {
      "id": "mfr9qup",
      "body": "You did absolutely nothing wrong, and you are not ruining their lives he already ruined it by raping you.",
      "created_utc": 1740995424.0,
      "score": 3
    },
    {
      "id": "mftsabq",
      "body": "Why would your girlfriend be mad at anyone but the rapist? You're a victim and if his wife doesn't know she is too. If he has two little girls who knows how much of a risk he is to them. Please you won't be ruining their lives, you'll be saving them. Please report this.",
      "created_utc": 1741028730.0,
      "score": 3
    },
    {
      "id": "mfw7py7",
      "body": "Fuck I am so so so so so sorry. God. Please please please ruin this guy’s life. This piece of trash. You don’t deserve this.",
      "created_utc": 1741055667.0,
      "score": 3
    },
    {
      "id": "mfxz6yi",
      "body": "YOU didn’t ruin anything! He ruined it for them\nYou didn’t ask for this and it is not your fault if it breaks his family apart!\nI’m sure you’re girlfriend won’t be mad at you, how could she?  you went through something traumatic, you didn’t have a say in this and it is not your fault!",
      "created_utc": 1741087555.0,
      "score": 3
    },
    {
      "id": "mgig7kk",
      "body": "You should not have to carry shame and guilt because that's what it sounds like.  It's not your responsibility to protect his family at the risk of your personal well-being.  These types of predators will not stop until THEY are stopped.  Get a health checkup,  perhaps talk to a therapist and inform the authorities.  Good luck.  You deserve a loving and joyful life.",
      "created_utc": 1741356692.0,
      "score": 3
    },
    {
      "id": "mfqc57j",
      "body": "Im so sorry. 🫂🫂",
      "created_utc": 1740976540.0,
      "score": 4
    },
    {
      "id": "mfrft2q",
      "body": "I Hate predatory unicorn hunters for this reason. He ruined his own life. As a survivor - it really fucking sucks and I empathize with you. It feels like weve crossed a line we cant come back from. That being said - time heals and there's so much more in this world for you to experience. Really awful things in life happen, but there's potential for some things in life to have been worth surviving this pain for. Let the \"Because I've felt so awful, I can also experience extreme happiness\" mentality guide you. \n\nStand proud, I'd rather have a world full of people like you than him.",
      "created_utc": 1740999193.0,
      "score": 2
    },
    {
      "id": "mfruk28",
      "body": "Get a rape kit asap and tell your friend. This sounds super suspicious like it’s happened before. Don’t let him get away with it.",
      "created_utc": 1741006630.0,
      "score": 2
    },
    {
      "id": "mfsrto2",
      "body": "He ruined his life. He ruined his family. I am so incredibly sorry this happened to you. Reporting him would mean you're protecting other women that come across him.",
      "created_utc": 1741018361.0,
      "score": 2
    },
    {
      "id": "mfszlqf",
      "body": "OP; please take the advice of so many others in this thread. As someone who has also been sexually assaulted and chose not to pursue legally, I always wish I had to protect his family from him and others as well. I live with that guilt every day. Tell your coworker. It will be hard but it will be better.",
      "created_utc": 1741020564.0,
      "score": 2
    },
    {
      "id": "mfth7ks",
      "body": "My advice,Save your underwear ,your pants ,go to the police,and end his life ,you didn’t deserve any of this and you will not reap any consequences that should be happening to him.Your girlfriend,if she’s empathetic ,would of course feel upset that something so horrible would happen to the love of her life.Let her feel that with you and you can heal together.But please please please go to the police and end his shit.I wish there were more severe consequences that could be used but that’s for another day ,we want you out of jail and him in jail on the registry 🩷I wish u well and your life is going to get better and better and I am open to talk if u need it as well!!!",
      "created_utc": 1741025605.0,
      "score": 2
    },
    {
      "id": "mftqreu",
      "body": "please please say something to somebody, i’m so sorry that this happened to you",
      "created_utc": 1741028296.0,
      "score": 2
    },
    {
      "id": "mfusy7d",
      "body": "Think of the kids OP, report the bastard, he might try something with those poor girls. I’m so sorry that this happened to you, as a SA victim myself, please stay strong, go to the police, they will help you❤️",
      "created_utc": 1741039159.0,
      "score": 2
    },
    {
      "id": "mfvoive",
      "body": "you didn’t ruin anything  for him or them, he did!",
      "created_utc": 1741049175.0,
      "score": 2
    },
    {
      "id": "mfvst53",
      "body": "Don't end your life. He should've thought about his reputation and family ending before he raped you. If he can shamelessly do it to you, what's gonna stop him from doing it to someone else? Don't stay silent, you have a voice for a reason. Use it. And yes, it would be a devastating blow to his wife/your friend and his children and other people who know him but I'm sure they'd be on your side and they'd rather someone like him be put away then on the streets. Also, if you end your life: he wins. He wants you feeling disgusted with yourself, he wants you feeling depressed and hopeless, he wants you feeling unsafe around men or sexual intimacy, don't let him win. Don't let him win. You got this, girl. Even though I don't know you, I love you and you got this ❤️",
      "created_utc": 1741050596.0,
      "score": 2
    },
    {
      "id": "mfwtmdg",
      "body": "im so sorry. he will rape his girls tho so please report him",
      "created_utc": 1741063960.0,
      "score": 2
    },
    {
      "id": "mg0iho5",
      "body": "OP, please don't be sad about taking steps to have this person face consequences. They obviously weren't sad when they CHOSE to do what they did to you.",
      "created_utc": 1741116556.0,
      "score": 2
    },
    {
      "id": "mg2a60i",
      "body": "LOTS of FREE and very beneficial potentially, social services for you.  PLEASE take advantage!",
      "created_utc": 1741135202.0,
      "score": 2
    },
    {
      "id": "mg6tp1x",
      "body": "Firstly, I'm so sorry for what has happened to you. Nobody deserves that.  \nMy advice is (and I hope you've already done this) get an SA kit or go to a medical professional and have it done.  \nI know it's easy to say for someone not in it, but you have to stop thinking about how all of this will affect HIM and his family - that scumbag doesn't matter here. YOU do. He did this to you.  \nHe didn't think about your life or your family's life when he did what he did, nor did he think about his wife or kids. He wanted something and he took it. A man with daughters treated a woman that way.  \nDon't think about him.  \nThink about YOU.",
      "created_utc": 1741199316.0,
      "score": 2
    },
    {
      "id": "mg9jf7c",
      "body": "Stay alive long enough to ruin his life.",
      "created_utc": 1741229238.0,
      "score": 2
    },
    {
      "id": "mgr3nfm",
      "body": "Heya lovely, I know it's been a few days now, and I don't know what's been going on in the last few days,  but I thought I'd just leave a comment here to let you know people care; you're not alone. Sadly, far too many people go through assault and yet it's so stigmatised we often feel entirely and utterly alone in these situations. I'm not going to be so cruel as to tell you that 'it's all fine,' 'don't let him win,' and all of that other poisonously faux-positive malarkey that just makes you feel so much more guilty and ashamed. I do, however, want you to know that you can heal, you can. Unfortunately, contrary to the common saying 'time heals all wounds,' there is only thing that can heal these wounds: you. Now time does help, don't be mistaken, time allows you the distance from the trauma to grow around it, to find ways to cope. But it is you that must choose to heal. Recovery is hard, I'm not going to lie to you, and it feels unfair. Why should his wrongs become my responsibility? \n\nIn this life, many things happen to us all, not all of them good, but life is only what you make of it. Resilience is one of humanity's greatest strengths, second only to our empathy (in my opinion, of course!) \n\nYou must be so exhausted, lovely. So, for now, tell who you need to tell, go to a sexual health clinic to get tested for STDs, and, if you so desire, contact relevant authorities. Above all, make sure to rest. I'd also recommend telling your girlfriend, if you feel safe, as now is the time you'll need a support network the most. In the upcoming weeks, I'd say it may be a good idea to contact mental health or therapy services to help you process this, they can be very helpful. \n\nFinally, I want to let you know that oftentimes people experience a range of emotions when they go through such traumas, and your feelings are valid. Don't repress them, it only makes it harder to face in the future. You must feel the pain, as difficult as that is. Do not, however, place the shame or guilt onto yourself as we survivors often do. He is the only person that has done wrong here, please do not blame yourself. It's not your fault.",
      "created_utc": 1741470956.0,
      "score": 2
    },
    {
      "id": "mfr2nbx",
      "body": "Do it for your friend, she doesn't deserve to spend her life with a lowlife like him. Report him and even though it's gonna be tough it will get better and I'm sure everyone will understand the situation and nobody's going to blame you. Please, you deserve to feel better",
      "created_utc": 1740990807.0,
      "score": 1
    },
    {
      "id": "mfr2rpl",
      "body": "Please report this monster AS SOON AS POSSIBLE. He will do this again unless you stop him.",
      "created_utc": 1740990889.0,
      "score": 1
    },
    {
      "id": "mfs0dxe",
      "body": "honest people are always the ones to lose. That too people with concience are the ones always to lose. What happened to you and how you handled it means you are a good person at heart. Good things happen but quite late.",
      "created_utc": 1741009140.0,
      "score": 1
    },
    {
      "id": "mfs3aju",
      "body": "Idk what to say but i hope u make it through this and he gets his… I don’t know if its just me but the coworker seems sus… she went to bed without making sure OP the person who is there because of her went home and leaving someone of the opposite sex alone at night alone with her husband she wasn’t worried? She’s probably in on it forced or not",
      "created_utc": 1741010289.0,
      "score": 1
    },
    {
      "id": "mfs7u9j",
      "body": "dont be scared to tell ur gf 1 its not ur fault 2 if she loves u she wont be mad",
      "created_utc": 1741011932.0,
      "score": 1
    },
    {
      "id": "mfsd6z3",
      "body": "You state you \"have no one to talk to\". You can talk to me if you want (Psych RN). I don't know how much I can help or not but I can listen and do what I can. There are also multiple hotlines you can call that are there expressly for you and others in crisis like this.",
      "created_utc": 1741013789.0,
      "score": 1
    },
    {
      "id": "mfserrp",
      "body": "You have to tell someone, this is too much to carry by yourself. Tell your brain you have to pick at least one person to tell, your brain will know the answer. Be kind and patient with yourself",
      "created_utc": 1741014320.0,
      "score": 1
    },
    {
      "id": "mfspybi",
      "body": "Don't be scared ruin it he raped you he deserves to beexpose this is so awful for \n\nIf you can't speak write a note it can help get thingsout of your head and comunicate",
      "created_utc": 1741017812.0,
      "score": 1
    },
    {
      "id": "mft9fjv",
      "body": "Guy needs to be held accountable, anybody that places this on you isn’t worth being in your life to begin with.",
      "created_utc": 1741023365.0,
      "score": 1
    },
    {
      "id": "mftgdfe",
      "body": "pls report him fast sis. Those children are not safe with him.",
      "created_utc": 1741025366.0,
      "score": 1
    },
    {
      "id": "mfttkja",
      "body": "You don't want to be a victim and you're worried how others will react. Your feelings are very common and unfortunately so is the impulse to not speak up. It is not your fault that you were raped. Sometimes the mind will come up with really illogical thought patterns that can be hard to break out of. \n\nI hope you are able to see all the support on this post. You can speak up and it is always worth it to advocate for yourself.",
      "created_utc": 1741029100.0,
      "score": 1
    },
    {
      "id": "mfueyqb",
      "body": "REPORT HIM and tell your girlfriend. Please",
      "created_utc": 1741035172.0,
      "score": 1
    },
    {
      "id": "mfufkti",
      "body": "I’m so sorry you had to experience that, please talk to the police it doesn’t matter if he has kids with your coworker, if he raped you who knows what he is doing to his kids. and I’m sure your girlfriend will be nothing but empathetic, and will support you through this. Please do not give up you are extremely strong and I’m sure have tons of people that love and support you.❤️❤️❤️",
      "created_utc": 1741035343.0,
      "score": 1
    },
    {
      "id": "mfv10zw",
      "body": "He might have done this to someone else before and he might again so you must report him however hard it is to do. The man who assaulted me over 15 years ago emigrated to Australia and is now married with children. I always fear for the people he is around now eventhough I don't know them.",
      "created_utc": 1741041566.0,
      "score": 1
    },
    {
      "id": "mfv9915",
      "body": "If he’s done that once the chance of him having done this before are quite high as are the chances he will do it again please I know it’s hard but if you speak up now you WILL get support and the sooner the better please do not let this criminal get away with this. This happened to my mom with her step dad and she was worried about breaking up the family and it happened to other girls after her.",
      "created_utc": 1741044156.0,
      "score": 1
    },
    {
      "id": "mfw2kw6",
      "body": "God i am so fucking sorry this happened to you. This world is so evil, it is so cruel and unfair. Please do not end your life, none of this was your fault so please seek justice. Truth will prevail I promise you it will.",
      "created_utc": 1741053903.0,
      "score": 1
    },
    {
      "id": "mfwxh48",
      "body": "So he didn't think of any mentioned circumstances and his own situation and family but you are !!\nREPORT HIM AND HE DOESN'T DESERVE HIS FAMILY AND THIS LIFE.",
      "created_utc": 1741065732.0,
      "score": 1
    },
    {
      "id": "mfwzazk",
      "body": "Save yourself and the family and call the police. This guy has done this in the past and continue to do so.",
      "created_utc": 1741066617.0,
      "score": 1
    },
    {
      "id": "mfxbb1y",
      "body": "Please go to the police and report him! Do the right thing by yourself and his family. What happens to him consequently is as a result of his actions and not because you!!! his loved ones reactions is not as a result of anything you do in reporting it, his family can make that decision themselves as to how they feel about him..\n\nI would strongly suggest you report the matter to the police, and they should be able to assist so as to allow you to get the help and support you need, this is not a secret you should keep, please don’t suffer in silence!!",
      "created_utc": 1741073094.0,
      "score": 1
    },
    {
      "id": "mfy5f7r",
      "body": "You’re not shattering the family; he is. Also if he’s willing to rape you, that means he’s likely to do it to others… like his kids. Report him.",
      "created_utc": 1741090564.0,
      "score": 1
    },
    {
      "id": "mg06we0",
      "body": "You have the cops to tell",
      "created_utc": 1741113342.0,
      "score": 1
    },
    {
      "id": "mg81jsf",
      "body": "By not reporting him you're letting him keep power over you. Fuck that noise, get a rape kit and report the asshole. Press charges. You're saving two children and a friend from having to live with a rapist. Do the right thing for yourself and them and turn that animal in.\n\nI am so sorry that this happened to you. You deserve justice. Call the cops, report him.",
      "created_utc": 1741211432.0,
      "score": 1
    },
    {
      "id": "mg82oe9",
      "body": "An addendum to my other post: now isn't the time for sadness. Now is the time for rage. Drag this rapist into the light of day so that EVERYONE can see him for the piece of shit he is. Get justice. Get a rape kit. Report him to the cops.",
      "created_utc": 1741211744.0,
      "score": 1
    },
    {
      "id": "mgsn10o",
      "body": "damn i feel bad :(",
      "created_utc": 1741490814.0,
      "score": 1
    },
    {
      "id": "mgsogar",
      "body": "Speaking up will be the hardest thing you have ever done but it needs to happen so no one can be hurt by him. People need to know what a monster he is. \n\nYou did nothing wrong.",
      "created_utc": 1741491360.0,
      "score": 1
    },
    {
      "id": "mgzn9ig",
      "body": "Go to the gynecologist and get proof that you were indeed abused if you decide to report or have evidence, I know it can be difficult, Please don't be afraid to tell your girlfriend, if she loves you she will support you \nTake care of yourself, I'm sorry for what you just went through, I hope you feel all the support and love we send you in the comments",
      "created_utc": 1741593671.0,
      "score": 1
    },
    {
      "id": "mfqmafz",
      "body": "OP, adding on that if you're scared to break up their family, I'd honestly be more scared not to. Trust me, a rapist is not the man you want in the house with your kids. Even if \"he would never\", they're not safe around someone who's comfortable committing such violence and violating such vulnerability. \nThere is no well adjusted rapist, that's someone with ghastly power fantasies who is wholly unsafe to be in the position where he has control over children (or relationships with women for that matter). \n\nEither your coworker will snap to and she will not waste a moment getting her kids somewhere safer and throwing the full weight of her fury into removing her husband permanently, or she's not a safe keeper of her children's well being, and you are still taking the action here that protects the most vulnerable members of that family. Of course, as the person harmed, you can and should make decisions prioritizing your own well being here. But please don't think you'd be doing them a disservice by reporting.",
      "created_utc": 1740981286.0,
      "score": 282
    },
    {
      "id": "mfqhlx8",
      "body": "I second this",
      "created_utc": 1740978974.0,
      "score": 46
    },
    {
      "id": "mfvgqal",
      "body": "This. I was born into a cult and experienced horrific SA as a minor . Luckily one day I had enough and I told my parents . He actually had been raping a girl that was in middle school bc he was the gym coach. He got her pregnant and he only continued . But bc I reported him, he had a paper trail behind him now . It helped with her case .",
      "created_utc": 1741046623.0,
      "score": 34
    },
    {
      "id": "mg5qmkq",
      "body": "For real 💯 those little girls don't need to be around someone like that. Even if it is their biological dad.",
      "created_utc": 1741188255.0,
      "score": 2
    },
    {
      "id": "mfycezv",
      "body": "Fr just imagine he did this to her and he's a GIRL father???? \nWhat's the probability those children are gonna be safe?",
      "created_utc": 1741093450.0,
      "score": 2
    },
    {
      "id": "mfwxo3w",
      "body": "And My heart goes to you love! I know living in this world so cruel sometimes. So please help make this world less cruel let his family know save his children from him.\nYou didn't deserve any of it. I am so sorry.",
      "created_utc": 1741065824.0,
      "score": 1
    },
    {
      "id": "mfqmpyo",
      "body": "[removed]",
      "created_utc": 1740981509.0,
      "score": 118
    },
    {
      "id": "mfqmzjh",
      "body": "Fuck this family",
      "created_utc": 1740981651.0,
      "score": 34
    },
    {
      "id": "mfvuako",
      "body": "you are so amazing for this. i never reported any of my assaults, because i feel like its the one crime victims are put on trial as much as the assaulter. i couldnt handle the scrutiny. until, something happened in public, and cctv cameras caught part of it. i knew they wouldnt be able to gaslight me into dropping the case. what REALLY helped was the fact the same night, another girl had reported it too. inadvertently, we both helped add legitimacy to eachothers case and got him in court:)",
      "created_utc": 1741051094.0,
      "score": 18
    },
    {
      "id": "mfyf4vb",
      "body": "Absolutely none.",
      "created_utc": 1741094477.0,
      "score": 2
    }
  ]
}