{
  "id": "1igukr5",
  "title": "I didn’t realize why underaged people hated therapy until now",
  "selftext": "I just had my first therapy session and apparently‘suicidal thoughts’ and ‘self-harming with multiple objects’ goes under the ‘telling parents’ list so now I’m in the bathroom freaking out as my mom reads the notes the therapist left. I’m. Fucked.\n\n2 hours later update: Had a 2 hour talk with my mom about it and holy shit I don’t know how to feel. On the upside she was super understanding and didn’t get mad and said I could have more therapy sessions. On the downside she just went on about how life is precious and worth living and stuff but she let me be absent from school and I don’t have to go a weekly social gathering. I still don’t know if it would’ve been have been better had I not told her and bottled it up.",
  "created_utc": 1738603755.0,
  "score": 1068,
  "num_comments": 106,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1igukr5/i_didnt_realize_why_underaged_people_hated/",
  "comments": [
    {
      "id": "mas4m3i",
      "body": "> ALSO I’ve been hurting other lately so yeah\n\nIf you are a threat to others, the therapist is a mandated reporter.",
      "created_utc": 1738608107.0,
      "score": 658
    },
    {
      "id": "mas5jtr",
      "body": "It's not really a problem with therapy. Unfortunately your therapist is required to inform your parents if you're a danger to yourself or others. Of course it becomes tricky if your parents aren't supportive or are abusive, but if that's not the case you should accept the help and use this as an opportunity to improve your situation",
      "created_utc": 1738608366.0,
      "score": 323
    },
    {
      "id": "masifxw",
      "body": "Who are you hurting?",
      "created_utc": 1738611939.0,
      "score": 32
    },
    {
      "id": "marz4nm",
      "body": "I've had multiple therapists and I wanted to open up but then they said those words. \"All is confidential unless you are planning to hurt yourself or someone else\". I just sit there and give basic simple answers. Never opening up",
      "created_utc": 1738606583.0,
      "score": 26
    },
    {
      "id": "masstjj",
      "body": "I completely understand, when I was in the seventh grade my ‘friends’ lied about me self-harming to the counselors because I told them I had exact blades (and while I was suicidal, I didn’t cut myself) and they had to tell my parents. I was grounded for a year and had the blades taken. It sucks, and it caused me to not trust anyone with anything like that anymore, but just know that you’ll find someone you can trust with these thoughts, I did!",
      "created_utc": 1738614808.0,
      "score": 20
    },
    {
      "id": "marzmpn",
      "body": "If you have a serious enough condition being a minor means your parents are going to get involved. Hopefully you have graceful parents that can help guide you through this. I have a 1 year old daughter, and if she was your age going through suicidal thoughts and self harm I 100% need to be aware of it. \n\nWhen I went to rehab a few years ago I wasn't a minor, but I still told my parents so I could use them as support. I had suicidal tendencies and self harmed through alcohol abuse. The support helped.\n\nThis being said, I do not know your situation. I think you took the right step on getting therapy. \n\nRemember this-\n\n-You do not have to suffer alone-",
      "created_utc": 1738606722.0,
      "score": 39
    },
    {
      "id": "masspfu",
      "body": "lmfao i'm sorry for you, great your mom had some understanding though fr.  🥺👍\n\ni would be quite wary (but not paranoid) around mental health professionals, especially those who have legal obligations. and especially if youre a minor. it is 100% possible to be sectioned for even benign suicidal ideation. lol",
      "created_utc": 1738614776.0,
      "score": 12
    },
    {
      "id": "marpjk8",
      "body": "they are not supposed to tell your parents unless you’re a serious danger to yourself or others. find a new therapist if you can",
      "created_utc": 1738603928.0,
      "score": 79
    },
    {
      "id": "maso99w",
      "body": "Yeah it sucks, mandatory policy for most therapists to report it, but I'm glad your mother was understanding. The first step to feeling better is painfully awkward and uncomfortable, these conversations will be the brunt of it. But hey, your a step further than before. Good luck, I hope all the best for you",
      "created_utc": 1738613538.0,
      "score": 5
    },
    {
      "id": "matneco",
      "body": "Parents don’t equal therapy , a trained councillor really helped me more than a parent could",
      "created_utc": 1738623358.0,
      "score": 6
    },
    {
      "id": "mattslx",
      "body": "I think it’s good you had a talk with your mom and that it ended up be ok. That’s all.",
      "created_utc": 1738625285.0,
      "score": 3
    },
    {
      "id": "mau99mm",
      "body": "Did they tell you they wouldn’t tell them? Idk if that’s legal or not but it shouldn’t be , they told me they wouldn’t tell them anything , they didn’t say unless____ … it’s so scary ,they don’t know how your parents act behind closed doors",
      "created_utc": 1738630146.0,
      "score": 5
    },
    {
      "id": "mauq6fx",
      "body": "If it makes you feel any better, I wasabout 42 when my psychiatrist put me on anti depressants. That particular one didn’t work for me and I felt like hell. Psychiatrist asked me how I felt and I said “like hell.” with my head humming from withdrawal from the last antidepressant I was getting off of. She said “ do you feel like killing yourself?” I said “yeah, this feels like hell.” She asked me how and I shrugged and said “I dunno.. jump in a river. Anything to get rid of this shit in my brain.” \n\nI did not know she was legally obliged to commit me. I had a kid in Kindergarten I had to ask someone to pickup.. I wasn’t even allowed to drive myself to the facility. It was humiliating asking a friend to drive me (this was pre-uber) I wish the psychiatrist had understood me better. I was literally a few days into the news meds but she was just doing her job, or she’d lose her license.",
      "created_utc": 1738635605.0,
      "score": 4
    },
    {
      "id": "marwat8",
      "body": "Well, you learned an important lesson.  Never tell your therapist about suicidal ideation.",
      "created_utc": 1738605792.0,
      "score": 39
    },
    {
      "id": "mavp7og",
      "body": "Some of my family noticed i had scars on my arm, and some were new scars, and they said \"oh you cut yourself\" and continued the day normally. I don't know how to feel tbh. But you should be grateful for an understanding parent.",
      "created_utc": 1738649208.0,
      "score": 3
    },
    {
      "id": "mau1zhq",
      "body": "When you get older you’ll understand yes the therapist pulled an ahole move but it’s necessary for your safety and those around you and youll see with anger it hurts everyone involved so learn to simmer down in a way that wont backfire and burn you use the anger for good",
      "created_utc": 1738627839.0,
      "score": 9
    },
    {
      "id": "mars3td",
      "body": "yh therapys is  a bit cooked its could but be careful what info u share because they have a duty of care  and there gonna react way more because ur  pretty young     lol i sound old im 14 but yh  ur just gonna have to wait to c how they react",
      "created_utc": 1738604641.0,
      "score": 7
    },
    {
      "id": "maz33t6",
      "body": "This happened to me once before too when I was 15. The therapist even started the session with \"nothing will leave this room, everything is between us, and we will work on it together\". After the first session my mom immediately admitted that the therapist told her everything, she didn't even try to hide it. I just shut down completely, it felt like a huge betrayal. I ended the sessions there.",
      "created_utc": 1738697177.0,
      "score": 2
    },
    {
      "id": "mbjonfn",
      "body": "rs like how am i supposed to be open with them when everything i say is going straight to my parents",
      "created_utc": 1738962546.0,
      "score": 2
    },
    {
      "id": "mauni8j",
      "body": "they’re literally doing their job hun",
      "created_utc": 1738634726.0,
      "score": 2
    },
    {
      "id": "mas7sw2",
      "body": "Never EVER say the word “suicide” to a therapist. As a minor, it can and will be used against you. And in some unfortunate circumstances, the same applies when you’re an adult as well.",
      "created_utc": 1738608986.0,
      "score": 2
    },
    {
      "id": "mas018q",
      "body": "I hope my therapist realizes that if they were to just tell my parents if I wanted to kill myself without warning me at all, I’d be lights out by morning.",
      "created_utc": 1738606834.0,
      "score": 1
    },
    {
      "id": "maukovw",
      "body": "I think when you’re younger you are less willing to accept resources. Im 32 now so maybe I’ve lost it already lol. Although when I was younger I felt that it helped me a lot. I also know not everyone can get that help so if anyone needs it’s but finances are holding you back I can try to help out without at least something",
      "created_utc": 1738633821.0,
      "score": 1
    },
    {
      "id": "mauvfnv",
      "body": "I'm happy to hear your mom is understanding of the whole situation. Most parents are not, including mine when I was your age. And yeah, she'll rant on about how precious life is and stuff 'cause from her perspective it is and she loves you.",
      "created_utc": 1738637340.0,
      "score": 1
    },
    {
      "id": "mav2zka",
      "body": "Yep, this is why therapy didn't really work for me. Like with any other doctor, being honest with your therapist is essential to get effective treatment, but that's a bit difficult when she tells every damn thing to my parents\n\nI couldn't really tell her anything, so she could never help so, so here I am, 3 years later and still just as mentally ill, if not more",
      "created_utc": 1738639915.0,
      "score": 1
    },
    {
      "id": "mav6b7x",
      "body": "Yeah when I did tgis tgey didnt Ask me and immediately shipped me into a mental hospital",
      "created_utc": 1738641114.0,
      "score": 1
    },
    {
      "id": "mawcuuc",
      "body": "I bluntly told my parents about something similar when I was eight and now I have gotten trust issues and anxiety from that. This post literally completely sums up the whole reason why I haven't spoken to anyone about my problems",
      "created_utc": 1738663088.0,
      "score": 1
    },
    {
      "id": "mawlw2y",
      "body": "The therapist has to tell your parents when you're in danger, or even when others are from your actions. \n\nYour mom, bless her so much, is super understanding to you OP. This is hard on her too, and she wants to do what is best for you. \n\nGet more therapy sessions, and just talk to your mom. Open yourself more because she's one of the best things you have right now. Things may see dim and might not ever brighten up, but it will. The hard part is just keeping it up.",
      "created_utc": 1738668400.0,
      "score": 1
    },
    {
      "id": "mawnm8o",
      "body": "Yeah like everyone else said it's not the therapists fault. The system is very broken and there's only so much they can do. They have to blindly trust that parents will be good about the situation:(  I hope you look back on this one day and realize that it was a good thing that it kept you going another day, because outliving a situation like this will be a huge accomplishment for you in the future.",
      "created_utc": 1738669294.0,
      "score": 1
    },
    {
      "id": "maxarvr",
      "body": "Exactly, that is why you wait until you reach the age of majority to go, because when you are a minor and the attitudes or actions you do endanger yourself or others, psychologists have the right to warn the guardians. \n\nBecause in itself there is a strict privacy policy, but when the life of a minor is in danger with risky activities, that happens.",
      "created_utc": 1738678581.0,
      "score": 1
    },
    {
      "id": "maxdfxy",
      "body": "Being away from school when feeling this way is sometimes good but FYI don’t overdo it. It is one of the biggest reason for why I now feel even worse and want to die. My life could have been so much different right now.. I feel like a deviant and as if I am supposed to kill myself",
      "created_utc": 1738679478.0,
      "score": 1
    },
    {
      "id": "maydqi2",
      "body": "You’d be amazed how many people understand exactly where you’re coming from/what you feel.\n\nIn fact as you get older you’ll realize more and more, that tragically, you aren’t alone in these feelings. And that many…. Many…. more people than you’d ever expect will understand/relate, and if they don’t, they likely will in time. \n\nDon’t be afraid to ask for help and tell people things is what I’m saying. You seem to be doing good going to therapy and listening to the advice but yeah, just trust that people will understand. We’re all only humans, and all much more alike than anyone wants to admit.",
      "created_utc": 1738690125.0,
      "score": 1
    },
    {
      "id": "maytgh7",
      "body": "sounds like your mom loves you very much",
      "created_utc": 1738694493.0,
      "score": 1
    },
    {
      "id": "mazws7o",
      "body": "You only learn the hard way what to keep to yourself. Or find your own therapist",
      "created_utc": 1738705711.0,
      "score": 1
    },
    {
      "id": "mb89yyw",
      "body": "I mean, I'm already +18 and the talks still happen. Just my mother, but, yeah.\n\nMakes her depressed, fucked looping.",
      "created_utc": 1738811322.0,
      "score": 1
    },
    {
      "id": "mb8lbq8",
      "body": "Please get the help.  ",
      "created_utc": 1738815478.0,
      "score": 1
    },
    {
      "id": "mbodwhb",
      "body": "Never went. Will rather kill myself that go to therapy for any reason. Not kidding. Why would I pay someone to sit there and listen to me \"open up\" which I'd never do and probably make up lies or just share surface shit that doesn't even matter...to a professional that doesn't give a crap. I'd rather talk to myself and give myself the best advice that I'd never put to practice.\n\n\nP.S. I've actually only opened up to my mother, she listened like she understood what I'm going through, I felt so light afterwards after letting out myself go like that. I was almost floating never felt so light physically. Then hardly a week in and she betrays me by taunting me in front of dad about that thing I told her, which she completely misunderstood... It hurt. this wasn't self harm just some feelings stuff. I've done this a couple of times before this too, she has this way to make me feel that she will understand, she never gets it. I regret it everytime. A few times she has used it in a way you shouldn't; unrelated example: if someone tells you they're scared to death of birds you will not immediately put them in a cage of birds and tell them to get over it while crying about how their fear of birds is making you hurt. \n\n\nSo yeah, don't tell shit to parents. Maybe one of them. Sometimes I feel dad understands stuff better even without relating or being close to me like that. So maybe there's someone in your life like that that you haven't noticed ",
      "created_utc": 1739030880.0,
      "score": 1
    },
    {
      "id": "mas8iho",
      "body": "Did they not tell you about this before Having the sessions\n\nYou can’t just dump everything you say",
      "created_utc": 1738609181.0,
      "score": -3
    },
    {
      "id": "mas6wra",
      "body": "damn bro you're cooked, this is the reason I don't seek therapy",
      "created_utc": 1738608741.0,
      "score": -2
    },
    {
      "id": "mauy2kt",
      "body": "That is not a problem with therapy. That is keeping you safe.",
      "created_utc": 1738638226.0,
      "score": 0
    },
    {
      "id": "mas2unm",
      "body": "Dam wth they aren't suposed to to tell",
      "created_utc": 1738607617.0,
      "score": -6
    },
    {
      "id": "maunf78",
      "body": "Therapists are mandated reporters and everything you've said they reported is what was required.\n\nThe therapist should have told you that they were a mandated reporter at the start of the first session, either verbally or in paper. \n\nBut bro, you seriously can't expect to be hurting yourself and other people and expect the therapist to keep that quiet? They're there to help you process your feelings, not to be a confessional.",
      "created_utc": 1738634698.0,
      "score": -2
    },
    {
      "id": "mav9gsp",
      "body": "If we don't disclose, we could be sued.",
      "created_utc": 1738642310.0,
      "score": 158
    },
    {
      "id": "maskcd9",
      "body": "Okay so I remember going to therapy as a minor (even if I had legal right to not disclose a lot of stuff at 16) and this can be a serious barrier to seeking help (even if they are mandated reporters for a reason. I just stopped telling mine stuff because it was clear that they couldn't help with anything and would tell my parents who could help even less",
      "created_utc": 1738612462.0,
      "score": 103
    },
    {
      "id": "maw7z3e",
      "body": "[deleted]",
      "created_utc": 1738660014.0,
      "score": 3
    },
    {
      "id": "mb8l9pu",
      "body": "Accept the help!!!!!! ",
      "created_utc": 1738815456.0,
      "score": 2
    },
    {
      "id": "max8fl9",
      "body": "I’m a therapist. Would you help me understand what consequences you’re scared of if you were to be open and honest in sessions?",
      "created_utc": 1738677771.0,
      "score": 0
    },
    {
      "id": "mask11h",
      "body": "I feel like \"self harming with multiple objects\" is a clear cut danger to self, the therapist did their job, nothing more.",
      "created_utc": 1738612376.0,
      "score": 109
    },
    {
      "id": "mau0vkx",
      "body": "SH and suicidal thoughts are one of the 3 main things every therapist has a duty to report to a minor's guardians. the other two are illegal activity/drug use and credible harm to others.",
      "created_utc": 1738627488.0,
      "score": 6
    },
    {
      "id": "marq1gr",
      "body": "I DID SH already and considering I’m REALLY young, like barely teen, it was considered a hazard. ALSO I’ve been hurting other lately so yeah",
      "created_utc": 1738604069.0,
      "score": 31
    },
    {
      "id": "mauck9p",
      "body": "Yeah that's how mine went, was 14, had 1 sessions he told my dad (the abuser) it was his fault I was depressed and got me grounded, had like 7 more sessions and I didn't utter a word",
      "created_utc": 1738631208.0,
      "score": 2
    },
    {
      "id": "maryw0d",
      "body": "why did this get downvoted it’s true 😭 as a minor you basically can’t say ANYTHING to a therapist if your mental state is more than they can deal with. which is the case most of the time :/… i was rejected therapy multiple times because of this",
      "created_utc": 1738606517.0,
      "score": 26
    },
    {
      "id": "masekmc",
      "body": "also never tell a therapist anything that you wouldn't want another therapist to know. they act like you are their friend but you are not, because you both have different goals in life. once they write down something you said, it's on the record permanently.",
      "created_utc": 1738610868.0,
      "score": 7
    },
    {
      "id": "mavu1zg",
      "body": "I actually really am",
      "created_utc": 1738651735.0,
      "score": 1
    },
    {
      "id": "maucsr1",
      "body": "I agree with this, but I would like to mention my situation, while I don't blame my past therapist for telling my dad I'll always be mad about it, he got me yelled at and grounded, I stopped speaking during our sessions after that",
      "created_utc": 1738631284.0,
      "score": 9
    },
    {
      "id": "mbmujux",
      "body": "Real",
      "created_utc": 1739007188.0,
      "score": 1
    },
    {
      "id": "mas8whc",
      "body": "I’ve been holding it in for 6 months, I was NOT holding back",
      "created_utc": 1738609289.0,
      "score": 0
    },
    {
      "id": "mavw7ai",
      "body": "Could? It's almost guaranteed. At the very least, you'd lose your license.",
      "created_utc": 1738652916.0,
      "score": 53
    },
    {
      "id": "mawhcja",
      "body": "Doesn’t law tell you’re legally required to disclose the moment a patient is a danger for him/herself or others? Ex. suicidal attempts or willing to do terroristic acts?",
      "created_utc": 1738665836.0,
      "score": 30
    },
    {
      "id": "mb1gbw1",
      "body": "[deleted]",
      "created_utc": 1738723568.0,
      "score": 1
    },
    {
      "id": "masl65a",
      "body": "Yeah.. I'm not saying it's easy of course. Even as an adult I've held things back from my therapist for fear of being hospitalized again.",
      "created_utc": 1738612687.0,
      "score": 50
    },
    {
      "id": "mb2v9tn",
      "body": "A therapist will have to elevate care if youre in imminent danger. But, a \\*good\\* therapist, will know the difference between suicidality and actively suicidal in imminent danger. A \\*good\\* therapist will not be scared of your SI. We know it’s a coping mechanism, we also know how to help find healthier coping mechanisms, and we know how to normalize ideation.…it’s actually very normal. You should be able to let all your crazy fly with your therapist. If you get any judgmental vibes, find a different therapist. It’s literally their  job as a therapist, to help you through your batshit insanity, and they’ve heard or studied all of it. Unfortunately, not all therapists are good at their job, but you should be able to get a sense of that pretty easily. I would be honest in the initial phone call about your level of suicidality, because some wont work with you if you’re suicidal simply because they dont have the right skill set to help, most will though. Also, keep in mind, therapists are extremely compassionate empathetic people who have dedicated their lives to helping you through mental health struggles. Very often, recovery from their own mental health issues is what brought them to the field, so you should not be faced with anything other than deep care and understanding. Definitely not something to be scared of.",
      "created_utc": 1738747234.0,
      "score": 4
    },
    {
      "id": "mazugp7",
      "body": "Well a lot of the time parents are the cause of suicidal feelings. So telling them would make the entire situation worse.\n\nPersonally I know if mine ever found out they’d go on a rant about what a terrible person I am for doing something like that to them. And unfortunately I’m not alone…",
      "created_utc": 1738705042.0,
      "score": 4
    },
    {
      "id": "maskm84",
      "body": "agreed, but therapist should have told op first",
      "created_utc": 1738612536.0,
      "score": -48
    },
    {
      "id": "marqwod",
      "body": "well u might be a little cooked",
      "created_utc": 1738604310.0,
      "score": 75
    },
    {
      "id": "mas7c75",
      "body": "I read the title and agreed at first until i saw your comment. I hated my therapist when i was 16 because i told her my family was abusive and she told my family what i told her. In which case, put me into a more unsafe situation. \n\nTherapists are supposed to report if you are at risk of self-harm or suicide or hurting others so it's completely fair that your therapist has done so. To not do it would be irresponsible on their end. This applies to anybody regardless of their age.",
      "created_utc": 1738608858.0,
      "score": 65
    },
    {
      "id": "mas7rh0",
      "body": "hurting other people..?",
      "created_utc": 1738608975.0,
      "score": 49
    },
    {
      "id": "mascki8",
      "body": "Well if youre 13-14 and saying youre thinking of hurting yourself and others then thats one of the few exceptions where id say its reasonable for them to tell your parents.",
      "created_utc": 1738610313.0,
      "score": 40
    },
    {
      "id": "marwjy1",
      "body": "you should still have been told beforehand that your parents would be told",
      "created_utc": 1738605864.0,
      "score": 8
    },
    {
      "id": "marrm7g",
      "body": "That sucks. But I hope to tell you that you have a life ahead of you, you say you are barely a teen, there is no reason to lose hope for a better future filled with freedom and joy. I know situations can be bad, but you are just a budding human being, understand this and try juicing the best out of life. There is so much for you in life to explore and live yet. Don't indulge in SH, its thoughts may feel comforting but its not the wise thing to do.",
      "created_utc": 1738604506.0,
      "score": 1
    },
    {
      "id": "maudq89",
      "body": "Wow that sounds familiar, I’m so sorry he is doing this to you",
      "created_utc": 1738631580.0,
      "score": 2
    },
    {
      "id": "mas0rf1",
      "body": "Sorry to tell you this, but that doesn't end when you turn 18.",
      "created_utc": 1738607035.0,
      "score": 34
    },
    {
      "id": "mas8acw",
      "body": "this.. depends a lot on the country/jurisdiction, I literally left mine speechless for a few minutes after telling her my heavy stuff and none of it could legally be forwarded to my parents without my authorisation.",
      "created_utc": 1738609120.0,
      "score": 8
    },
    {
      "id": "mb3jg6c",
      "body": "Yes to both",
      "created_utc": 1738760249.0,
      "score": 3
    },
    {
      "id": "mb3jkki",
      "body": "Yes which means loss of license and or legal action",
      "created_utc": 1738760298.0,
      "score": 5
    },
    {
      "id": "mb73vzl",
      "body": "If they don't protect themselves, they won't be able to help other people. Don't turn this negative.",
      "created_utc": 1738797656.0,
      "score": 6
    },
    {
      "id": "mb3jz30",
      "body": "That's a big jump from a tiny statement of fact. Therapists have many ethical and legal obligations and rules. It doesn't mean we don't care.",
      "created_utc": 1738760462.0,
      "score": 3
    },
    {
      "id": "maue9t4",
      "body": "I think we're at the point where so many people think about suicide at least occasionally that pretty much everyone is holding something back from their therapists. I imagine it's hard from the therapist's side as well. Your client has just offhandedly referred to suicide, you decide they aren't at serious risk and then there's an attempt.",
      "created_utc": 1738631751.0,
      "score": 27
    },
    {
      "id": "mav2tb0",
      "body": "I am sorry for asking but is getting hospitalized bad？and if so,how bad are we talking？",
      "created_utc": 1738639853.0,
      "score": 5
    },
    {
      "id": "mb15dhg",
      "body": "Oh ok, yes you’re right. Thank you for responding. I didn’t realize you are a minor and that would be a complicating factor for openness re: parents knowing session content\n\nI’m so sorry",
      "created_utc": 1738719996.0,
      "score": 2
    },
    {
      "id": "masl0t7",
      "body": "Op also said they were harming others. If the therapist says \"hey if you tell me this, I have to tell your parents\" someone is more likely to just lie. Again. Therapist just doing their job.",
      "created_utc": 1738612646.0,
      "score": 47
    },
    {
      "id": "mas8ou4",
      "body": "Anger issues?",
      "created_utc": 1738609229.0,
      "score": -41
    },
    {
      "id": "mas8kq8",
      "body": "if it involves suicide and you’re not constantly reassuring the therapist that you’re not gonna do anything it’s absolutely cooked. that’s just where i am tho",
      "created_utc": 1738609199.0,
      "score": 5
    },
    {
      "id": "mb3jqxb",
      "body": "if you’re required by law to do that losing the license doesn’t really make much sense to me tho 🥲",
      "created_utc": 1738760371.0,
      "score": 1
    },
    {
      "id": "mb88vue",
      "body": "This. People have such imagination.",
      "created_utc": 1738810947.0,
      "score": 3
    },
    {
      "id": "mav5c27",
      "body": "No need to be sorry.\n\nIt really depends on your condition. I was in the hospital five days the first time and two weeks the most recent time. It's not exactly fun, but it's not really bad either. It's mostly just really boring. You'll spend most of your time there going to group therapy sessions and meeting with various medical and mental health specialists. They'll almost certainly put you on medication and will frequently assess you to see how you're doing. \n\nIf you are potentially going to be hospitalized, don't panic. They won't put you in a straight jacket and lock you in a padded room (the hospital I went to doesn't even use physical restraints, even in the most extreme cases) my best advice is to make the most of your time there, learn coping skills and do a lot of introspection, most hospitals will provide you with a journal and a pen if you ask for it. I'd also recommend bringing a few books you enjoy and to pack comfy clothes, though if they have drawstrings they won't let you have them. Some hospitals even allow you to bring stuffed animals, though the hospital i went to didn't. You'll be allowed to see your family or friends during visiting hours, and they'll likely set you up with therapy and medication management once you discharge.\n\nI understand it can seem daunting and scary, but try to look at it as a positive. It's not a punishment, just a higher level of care.",
      "created_utc": 1738640755.0,
      "score": 15
    },
    {
      "id": "mavdox7",
      "body": "It really depends on where you are (different countries have different systems and some are better than others) in the US wether the experience is bad or not entirely depends on the hospital you get sent to. I’ve been to a few different hospitals in my area of the US and have had both positive experiences and traumatic ones. Generally it’s pretty boring but overall fine sometimes even a nice break from reality, but when it’s bad it’s been real bad.",
      "created_utc": 1738644005.0,
      "score": 10
    },
    {
      "id": "mb3quce",
      "body": "[removed]",
      "created_utc": 1738763055.0,
      "score": 2
    },
    {
      "id": "mbvggcs",
      "body": "I've been in and the places I went were basically jail. In my opinion it doesn't really help suicidal tendencies unless by some miracle they put you on good medication.",
      "created_utc": 1739124055.0,
      "score": 2
    },
    {
      "id": "mas941e",
      "body": "oh sorry, meant like, have you physically harmed others?",
      "created_utc": 1738609348.0,
      "score": 40
    },
    {
      "id": "mas8vpe",
      "body": "iirc even then they were only allowed to forward the issue further up the chain (potentially the police) but contacting parents was still a big no",
      "created_utc": 1738609283.0,
      "score": 5
    },
    {
      "id": "mb99ue7",
      "body": "thank you for your insight, hope you are doing better in your life❣️❣️",
      "created_utc": 1738827113.0,
      "score": 1
    },
    {
      "id": "mb99hi3",
      "body": "i am sorry to hear that,i hope your doing better❣️✌🏻\nthx.\n(also sorry for the late reply i don't use reddit often)",
      "created_utc": 1738826903.0,
      "score": 1
    },
    {
      "id": "mb9a1h8",
      "body": "I hope they get what they deserve,i am just glad you're out of there.",
      "created_utc": 1738827226.0,
      "score": 1
    },
    {
      "id": "mas98d1",
      "body": "Yeah😐",
      "created_utc": 1738609382.0,
      "score": -98
    },
    {
      "id": "mb99kea",
      "body": "It’s all good no worries!",
      "created_utc": 1738826951.0,
      "score": 2
    },
    {
      "id": "masdp2p",
      "body": "sympathy gone.\n\nthey're mandated reporters.",
      "created_utc": 1738610626.0,
      "score": 137
    },
    {
      "id": "masqkeg",
      "body": "Been there as a teen (although it was only ever family and usually reactive anger but, still), it gets better. Your therapist did what they were trained to do, it wasn’t malicious against you. I hope things work out for you 💛",
      "created_utc": 1738614182.0,
      "score": 22
    },
    {
      "id": "mb061qa",
      "body": "How and why?",
      "created_utc": 1738708478.0,
      "score": 1
    },
    {
      "id": "mb9a6bh",
      "body": "👍🏻👍🏻",
      "created_utc": 1738827305.0,
      "score": 1
    }
  ]
}