{
  "id": "1kt3p6o",
  "title": "fuck anyone who’s ever said \"it gets better\"",
  "selftext": "it’s such redundant cope. my whole life i’ve heard the same bullshit and when has it ever gotten better? never. \n\nlet’s be honest here. for most people, it doesn’t get better. no matter what there will always be thoughts of suicide, passive or not, that linger in the back of our minds, the only difference is not everybody acts on those thoughts. \n\ni fully intend to act on those thoughts. i’m tired of being told to wait things out and to hope for the best by people who really don’t actually care whether i live or die, they just want to feel like they’re doing something good by convincing me to run the pointless rat race that is life. \n\nwe all die eventually, so what’s the big deal if i \nspeed run it? what’s the big deal if *anyone* decides to end things prematurely? we’ll all face the same fate someday anyway. \n\nand don’t respond in the comments with any religious nonsense. i don’t care. i’m not religious. i couldn’t care less about what could happen after death, i just want to be gone. \n\ni’ve already slit my wrists and some lacerations are already bleeding out more than others. hopefully tonight’s sleep will be my last. \n",
  "created_utc": 1747952353.0,
  "score": 675,
  "num_comments": 122,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1kt3p6o/fuck_anyone_whos_ever_said_it_gets_better/",
  "comments": [
    {
      "id": "mttwud6",
      "body": "\"It gets better\" specifically breaks the guidelines here because it's well-known in suicide intervention that it's common to find it worse than useless when we're struggling. Please report if you see it here and we'll deal. I'm so sorry you've gotten such consistently awful support :(\n\nThis is particularly true for people who've been struggling a long time, but it can even be true when someone's going through an overwhelmingly painful situation that's likely to be time-limited. Because support that focuses only a hypothetical better future doesn't honor how awful things are in our present, and if the only way we have to give support is to tell people to think about the future, that often leaves them *more* vulnerable.\n\nAnd there's no universal \"it\" that life is, so general pronouncements like that demonstrate that someone isn't taking the time to understand our actual experience - which is essential to any meaningful support...\n\n[We've been working on educating people on this for over a decade](http://redd.it/25igd7) (always linked in guideline 4d in the sidebar also, and in the welcome message to anyone who comments here) and yet the myth in our broader culture that it's a helpful or effective way to support people who's thinking of suicide persists - still had to take down a few comments to that effect in this thread.",
      "created_utc": 1748006318.0,
      "score": 1
    },
    {
      "id": "mtqnrxt",
      "body": "“it gets better” is simply an assumption that we’ll one day have the energy to put in the effort to make things “better”\n\nof course, it would also be assuming that putting in the effort will one day make you want to keep living\n\nbullcrap. I’ve put in that energy, and that same energy I also lost. This feeling never left me and only got worse even though I got everything I wanted.",
      "created_utc": 1747954626.0,
      "score": 64
    },
    {
      "id": "mtr07jn",
      "body": "theres a premisse where depression is just a prologue to something “worth living”, and it is the most cruel of them all because not always this is true.",
      "created_utc": 1747958910.0,
      "score": 58
    },
    {
      "id": "mtqzejl",
      "body": "[removed]",
      "created_utc": 1747958621.0,
      "score": 52
    },
    {
      "id": "mtrn1z4",
      "body": "Keep waiting for shit to get better.. it gets fucking worse!",
      "created_utc": 1747967164.0,
      "score": 46
    },
    {
      "id": "mtskhu9",
      "body": "I wish I could go back in time and stop my parents having sex",
      "created_utc": 1747982562.0,
      "score": 44
    },
    {
      "id": "mtri6s1",
      "body": "This !! I'm literally at my lowest point, have been 1000 times, and will keeping coming back for the rest of my life. I don't care if life got better for you Stacy, You're not me",
      "created_utc": 1747965377.0,
      "score": 36
    },
    {
      "id": "mts6p4i",
      "body": "Being born is the worst thing that ever happened to me, dying is the hardest thing I've ever done. I was in a motorcycle accident with a barbed wire fence. I saw it coming. I couldn't stop and once I hit it it didn't stop until I was done. Life is kind of like that. \n\nBut the question is should I turn away, Should I have looked the other way? Should I try to take my life before I hit that fence. I don't think that's easier either. \nSomebody told me once that life is a river go with the flow. It's more like a tsunami. And there is no going with that. I'm 67 several suicide attempts in my life all of them failed sometimes I panicked sometimes I ended up in the hospital. I hate myself I hate my life I don't want to go one more minute in a world that is gone completely mad. \nJust got out of the psych ward. For a few days I sort of feel better unstable but I kind of felt better. And then I read the doctor's note, and then I felt completely helpless again. They shouldn't let me see that stuff, now I feel completely broken.",
      "created_utc": 1747975372.0,
      "score": 18
    },
    {
      "id": "mtrm7uw",
      "body": "I have medical issues that are ruining everything.  My family actually celebrates my suffering.  It’s evil.",
      "created_utc": 1747966857.0,
      "score": 12
    },
    {
      "id": "mtsnhto",
      "body": "Yea I hate it when people say that spring always comes after winter. Not necessarily. I could be in one of those long winters in GOT that lasts forever. \n\nIt's such fallacious thinking to assume that it will get better just because it has been bad for a while. Like a gambler thinking a win must be around the corner because they've been on a losing streak. Think again man, worse losses are ahead! Abandon all hope.",
      "created_utc": 1747984250.0,
      "score": 12
    },
    {
      "id": "mtsxee8",
      "body": "It's only gotten worse with age. I would do anything to have the depression I had in my late teens back - I truly thought it couldn't get any worse.\n\nI used to self harm and externalize my pain. Visibly menatlly ill. Throughout the years, it's gotten darker, more inwards, lonely and I stopped caring about 98% of people who once would have guilted me into staying. I'm at the point we're my suicide is something I am almost completely menatlly prepared for apart from the humaness in me that has a fear of the dying process itself, if it goes wrong.",
      "created_utc": 1747990217.0,
      "score": 11
    },
    {
      "id": "mtxsn6q",
      "body": "Therapists and modern day suicide prevention comes down to keeping the pharmaceutical industry booming by doping up the population with meds and it mainly serves the masters in keeping the slaves alive... \n\nTelling working class people who can barely afford to live paycheck to paycheck without any real benefit of living life, then telling them silly little feel good phrases like “it gets better.” Which is the equivalent of a farmer telling his malnourished cow; “I know this sucks but it gets better.” So he can continue milking it for all it’s worth… just like our society/system does to us so we keep building their houses, paving their highways and filling their factories… \n\nYour god damn right it fucking sucks.",
      "created_utc": 1748050265.0,
      "score": 9
    },
    {
      "id": "mtve975",
      "body": "It hasn't gotten better in 10 years so please, tell me when it's suppose to get better. I hate when people say it gets better. I tried religion, alcohol, smoking, and other stuff and it's not getting better so honestly f*ck everyone who says it gets better cause it doesn't.",
      "created_utc": 1748021819.0,
      "score": 5
    },
    {
      "id": "mtso9cw",
      "body": "I feel you. Honestly, I'm tired of that BS that people tell me, when I know if they understood they wouldn't say that shit. Just makes ya feel more alone, you know?",
      "created_utc": 1747984691.0,
      "score": 6
    },
    {
      "id": "mtuf13l",
      "body": "hasn't been the case for me.  now food stamps and medicaid are being cancelled.  i have too much student debt and I have no energy or not enough plus i can't get enough food.  if i died it all would end but so far i can't will myself to do it.  i have a potential job but know I don't want to do it because for one I'm likely to harm someone as a nurse because I can't learn the basics.  this is not going to work.  i wish things were different.  I have schizophrenia and that's the one thing that could save me.  once i can't afford meds, I'll become paranoid and no one will hire me or tolerate me.  Then it's terminal homelessness which scares the hell out of me.  ",
      "created_utc": 1748011862.0,
      "score": 4
    },
    {
      "id": "mtsohbm",
      "body": "When my ex told me this it was really sweet but I realize now it’s not exactly an evidence based statement",
      "created_utc": 1747984821.0,
      "score": 3
    },
    {
      "id": "mtsrua9",
      "body": "it feel so isolating when u even hear it from other people with severe depression; the very few people who u could deeply relate to and find a sense of community with",
      "created_utc": 1747986827.0,
      "score": 3
    },
    {
      "id": "mtu2y8s",
      "body": "“it gets better” it’s been almost 10 years. maybe it does get better but saying that never helps.",
      "created_utc": 1748008288.0,
      "score": 3
    },
    {
      "id": "mtxns9x",
      "body": "I actively deal with people in my daily life who think I freak out over normal things when literally I tell them over and over to listen. They just repeat the same nonsense. I might as well be surrounded by robots, cold, dead inside and void of any humility.",
      "created_utc": 1748048380.0,
      "score": 3
    },
    {
      "id": "mtra94q",
      "body": "It irritates me too, but there's some truth to it. I'll be 50 soon so I've picked up a few things along my way. Here's the raw deal of the statement: Will it get better? Yes, at times it will. Will it stay that way? No, not likely. Will it get better again? Yes, rinse and repeat. That's life, man. It's the most ridiculous rollercoaster you'll ever experience. Does it mostly suck for people like us? Absolutely. Usually because most don't understand the darkness that looms over us. Try to find some peace knowing that you are not alone in your struggles. Also, selfharm is not the way. As you gain strength to carry on (and you will, believe in yourself), you'll be left with horrific scars that you'll come to regret. I've seen it countless times, please stop doing it, for your future self. I won't pray for you because I don't talk to myself, but I can lend an ear (eyes in this case, I guess). Sometimes we just need to be heard. ",
      "created_utc": 1747962528.0,
      "score": 3
    },
    {
      "id": "mu26xx2",
      "body": "Sorry to see that you’re struggling. \n\nIt is true that there are people who don’t care. At the very least, they might be emotionally detached from you, for whatever reason that might be.\n\nBut you can build emotional attachments with people, who go on to care for you. There are people very much are bleeding hearts, in general. They exist, though might be hard to spot, given the natural variations of humanity and such.\n\nI do sincerely hope that you find some lovely people to surround with, one of these days.",
      "created_utc": 1748116604.0,
      "score": 1
    },
    {
      "id": "mu41e54",
      "body": "People say it gets better because usually people work on themselves and it does just naturally get better",
      "created_utc": 1748141465.0,
      "score": 1
    },
    {
      "id": "mu5igur",
      "body": "it truly doesnt, 11 years later and i still want to die",
      "created_utc": 1748170894.0,
      "score": 1
    },
    {
      "id": "mu6p1r8",
      "body": "hey dude, i get it. ive been hospitalized 2 times and attempted about 3 times (not including impulsive ingenuine ones.) ever since i got on lexapro its been way better. still pretty empty, but im not plotting suicide. it usually never gets perfect, but i believe in you.",
      "created_utc": 1748186997.0,
      "score": 1
    },
    {
      "id": "muge70e",
      "body": "f**king any one may be your solution...just like you said in your title",
      "created_utc": 1748315682.0,
      "score": 1
    },
    {
      "id": "mugics6",
      "body": "If it’s just my first time does it make it less relevant? Just thought of it. I thought I was happy. I really thought I had a good life. I have to let all of it go. How do I drop my boy off at the pound and walk away 😭 I can’t do that. I’m not built to withstand that. I’m so shook. She doesn’t even know I know. Countdown Seven days. I hate my life.",
      "created_utc": 1748317402.0,
      "score": 1
    },
    {
      "id": "munaxos",
      "body": "Hi, friend. I just joined this reddit and you're the first post I saw. I hope you're still with us. \n\nYou seemed angry in your post, I was there just a few nights ago. Angry at everyone who's ever hurt us, angry at all the Neverending shit that we go through. \n\nI don't always have those days, but when I do I would take it out on myself physically. The next day? I was disappointed and upset with myself and regretted the self harm. Now any time I get that way I force myself to go to bed. To go to sleep and reassess in the morning (given your bad times are at night like mine) because I knew if I did something dumb, and survived, I'd regret it. \n\nHope you're still around 🫶🏻",
      "created_utc": 1748407782.0,
      "score": 1
    },
    {
      "id": "munc1s6",
      "body": "i have adhd autism ocd depression and tinnitus and i can tell you that if it doesn’t get better you have to be kind to yourself to improve more your a very strong person we all want you to be happy in life we dont want you to be upset were all here for you there have been many times were i didn,t want to live but what keeps me going is the thought of my death hurting people",
      "created_utc": 1748408316.0,
      "score": 1
    },
    {
      "id": "mtuskkw",
      "body": "In my experience, it gets better. And worse. And better again. Getting better is not a forever thing. Getting worse is not forever. Its in phases. I wish people would stop pretending its a linear growth. And sometimes getting better isn't getting perfect.",
      "created_utc": 1748015665.0,
      "score": 1
    },
    {
      "id": "mtrkg4x",
      "body": "[removed]",
      "created_utc": 1747966202.0,
      "score": -5
    },
    {
      "id": "mtqu699",
      "body": "[deleted]",
      "created_utc": 1747956796.0,
      "score": -19
    },
    {
      "id": "mtrb2p9",
      "body": "Would be nice if there was like a flip in my brain to want to put energy into changing my life and having hope that things will improve. As much as i've tried sometimes it feels like nothing even matters anymore and isn't worth the effort to change",
      "created_utc": 1747962827.0,
      "score": 13
    },
    {
      "id": "mtyna06",
      "body": "I'm receiving a lot of, \"when I feel better\"\nRelationships will heal, my partner's will take me back.\nIt's a bribe at best and life will be worth it again. I hate it.",
      "created_utc": 1748063303.0,
      "score": 3
    },
    {
      "id": "mtrl2qi",
      "body": "[removed]",
      "created_utc": 1747966433.0,
      "score": -6
    },
    {
      "id": "mtrkvob",
      "body": "[removed]",
      "created_utc": 1747966362.0,
      "score": 17
    },
    {
      "id": "mtry56c",
      "body": "[removed]",
      "created_utc": 1747971509.0,
      "score": 7
    },
    {
      "id": "mtrkn46",
      "body": "[removed]",
      "created_utc": 1747966273.0,
      "score": 1
    },
    {
      "id": "mtrstdp",
      "body": "[removed]",
      "created_utc": 1747969326.0,
      "score": -7
    },
    {
      "id": "mtxa1kn",
      "body": "Same here bro ",
      "created_utc": 1748043224.0,
      "score": 7
    },
    {
      "id": "mu29kc4",
      "body": "Me too… What were they thinking? My mom even told me all of us were accidents anyway. Like then why keep us?",
      "created_utc": 1748117515.0,
      "score": 5
    },
    {
      "id": "mtw0fg4",
      "body": "Fr. I appreciate people trying to help, but it hasn’t gotten better and I’ve been severely depressed for the last ten years… you just learn to cope however you can:/",
      "created_utc": 1748028369.0,
      "score": 9
    },
    {
      "id": "mtrl84b",
      "body": "[deleted]",
      "created_utc": 1747966489.0,
      "score": 2
    },
    {
      "id": "mu29rwo",
      "body": "Exactly… I always keep coming back to the lowest points of my life. Right now I’m at the lowest point and I’m really contemplating so hard right now…",
      "created_utc": 1748117588.0,
      "score": 1
    },
    {
      "id": "mtssfvp",
      "body": "Im sorry. I can relate",
      "created_utc": 1747987183.0,
      "score": 5
    },
    {
      "id": "mtuswnx",
      "body": "You’re literally me",
      "created_utc": 1748015758.0,
      "score": 3
    },
    {
      "id": "mtyagxw",
      "body": "I feel that even if spring comes, winter will be here soon, always. I am getting really tired of the cycle of all four seasons. I don't want it anymore.",
      "created_utc": 1748057275.0,
      "score": 3
    },
    {
      "id": "mtw1eeq",
      "body": "Honestly same. When I was a teen, I was struggling but I had full support from my family, financial support, I could actually engage in my hobbies and get acknowledged for it. Now as an adult, everything is a struggle and just pure suffering. People have died close to me, my family doesn’t support me anymore, I pretty much have no friends these days and no money. And I’ve been having all these health issues and no direction in life now. i know it’ll get worse though as I get older tho😔I hate it here",
      "created_utc": 1748028668.0,
      "score": 3
    },
    {
      "id": "munjcig",
      "body": "I could've written this. It feels like tumbling down a spiral staircase into the abyss with no recourse.",
      "created_utc": 1748411995.0,
      "score": 1
    },
    {
      "id": "mttcsbh",
      "body": "[removed]",
      "created_utc": 1747998682.0,
      "score": 1
    },
    {
      "id": "munb865",
      "body": "I would also like to add, it never exactly \"gets better\", you just learn to power through the bad to enjoy the good.",
      "created_utc": 1748407921.0,
      "score": 1
    },
    {
      "id": "mtrcmjf",
      "body": "I’m done trying. Today is my last day (: I am so excited for this feeling to be gone.",
      "created_utc": 1747963387.0,
      "score": 11
    },
    {
      "id": "mtrmse0",
      "body": "[removed]",
      "created_utc": 1747967065.0,
      "score": 14
    },
    {
      "id": "mtrwg3f",
      "body": "[removed]",
      "created_utc": 1747970792.0,
      "score": -3
    },
    {
      "id": "mtrl3cj",
      "body": "[removed]",
      "created_utc": 1747966439.0,
      "score": 11
    },
    {
      "id": "mtrwzda",
      "body": "[removed]",
      "created_utc": 1747971017.0,
      "score": 18
    },
    {
      "id": "muhaglq",
      "body": "same or that i’m a fucking failure i’m sick of this shit",
      "created_utc": 1748332140.0,
      "score": 1
    },
    {
      "id": "mtrlvto",
      "body": "Yeah. I have phases where I'm okay or even happy but they never last more than a week and they never feel like being truly content, just surface level pleasures. I'm never really back to \"being okay\". Basically my baseline feels numb, sometimes I'm really sad, every once in a while I'm truly happy.",
      "created_utc": 1747966735.0,
      "score": 9
    },
    {
      "id": "mttoo0e",
      "body": "i mean, there's no such thing as living proof for that. everyone's lives are different even if they share similar elements. it doesn't really get better for **some** people but it might get better for others. some people have already gotten some form of help and life hasn't changed much for them. even if it worked for you — which is great — it won't necessarily work for everyone. some are in situations they can't escape, whether they have a chronic illness that pains them everyday of their lives or some other thing.",
      "created_utc": 1748003514.0,
      "score": 2
    },
    {
      "id": "muakpl8",
      "body": "hey u still here?",
      "created_utc": 1748235671.0,
      "score": 1
    },
    {
      "id": "mts0nxu",
      "body": "[removed]",
      "created_utc": 1747972599.0,
      "score": -8
    },
    {
      "id": "mtro9bw",
      "body": "[removed]",
      "created_utc": 1747967607.0,
      "score": 7
    },
    {
      "id": "mtrm9hp",
      "body": "[removed]",
      "created_utc": 1747966873.0,
      "score": 1
    },
    {
      "id": "mtsch1o",
      "body": "[removed]",
      "created_utc": 1747978234.0,
      "score": 7
    },
    {
      "id": "mtrqqrs",
      "body": "[removed]",
      "created_utc": 1747968529.0,
      "score": 4
    },
    {
      "id": "mtrmnmr",
      "body": "[removed]",
      "created_utc": 1747967016.0,
      "score": 6
    },
    {
      "id": "mttpzdr",
      "body": "[removed]",
      "created_utc": 1748003985.0,
      "score": 3
    },
    {
      "id": "mtseuvm",
      "body": "[removed]",
      "created_utc": 1747979486.0,
      "score": -5
    },
    {
      "id": "mtrzosr",
      "body": "[removed]",
      "created_utc": 1747972174.0,
      "score": -5
    },
    {
      "id": "mtuw16e",
      "body": "[removed]",
      "created_utc": 1748016650.0,
      "score": 1
    },
    {
      "id": "mts16ej",
      "body": "[removed]",
      "created_utc": 1747972826.0,
      "score": 5
    },
    {
      "id": "mtvgxet",
      "body": "[removed]",
      "created_utc": 1748022562.0,
      "score": 1
    },
    {
      "id": "mts1w84",
      "body": "[removed]",
      "created_utc": 1747973145.0,
      "score": -4
    },
    {
      "id": "mtvttnm",
      "body": "I'm trying to tell you how weird you're being so you don't do it again. You've made my day worse and in this subreddit, that could be someone's breaking point. We're here for support, not advice unless it's specifically asked for",
      "created_utc": 1748026361.0,
      "score": 7
    },
    {
      "id": "mtvpftu",
      "body": "[removed]",
      "created_utc": 1748025032.0,
      "score": 1
    },
    {
      "id": "mts299a",
      "body": "Ur my 13th reason istg",
      "created_utc": 1747973308.0,
      "score": 3
    },
    {
      "id": "mtsfyfh",
      "body": "[removed]",
      "created_utc": 1747980070.0,
      "score": -2
    }
  ]
}