{
  "id": "1g6z7lp",
  "title": "My 8 year old wants to kill herself",
  "selftext": "Last year she first told me she didn't want to be alive anymore. She was 7. I got her in with a great therapist who she still sees.\n\nA month ago she did that phrase again. We made a safety plan at therapy. Two days later she threatened to bring a gun to school so I took her to the hospital for an evaluation. Cue us being held for 8 hours in the most dehumanizing experience only to be told not only did they have nowhere for her to go due to her age, but that her threats weren't credible anyways and we got sent home.\n\nTonight she got upset over something minor and completely went over the edge. Said she doesn't understand why she feels this way, why she has these thoughts. She wanted to kill herself although she didn't make specific threats. She then asked her sister to kill her. \n\nI don't know what to do. I feel like I'm doing everything right... She's in therapy, she doesn't have a history of experiencing abuse or trauma, we went to the hospital and it was NOT helpful .. so what's next?",
  "created_utc": 1729305282.0,
  "score": 714,
  "num_comments": 177,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1g6z7lp/my_8_year_old_wants_to_kill_herself/",
  "comments": [
    {
      "id": "lsn9hla",
      "body": "does she Physically feel bad? i was suicidal since 8 but i didnt realize why i was suicidal until i was older, it was physical health issues and a combination of a complex life situation",
      "created_utc": 1729316540.0,
      "score": 185
    },
    {
      "id": "lsmybvi",
      "body": "I agree with the comment saying this is concerning. I suggest going back through her YouTube history or looking through subscribed channels, some content on YouTube Kids is downright (for lack of a better term) weird at best and demonic at worst. Asking teachers about the bullying and to communicate with you couldn’t hurt either. \n\nIm so sorry your child is going through this, it sounds like you’re doing your best and it’s good to know she has a mom like you there for her.",
      "created_utc": 1729310383.0,
      "score": 552
    },
    {
      "id": "lsnbpiw",
      "body": "…did something happen that you’re unaware of…? Stupid question, I know, but has her school said anything? Any friends or parents seen or heard anything you haven’t seen…? 😢",
      "created_utc": 1729317939.0,
      "score": 72
    },
    {
      "id": "lsncemk",
      "body": "Maybe some type of undiagnosed learning disability or autism? I went undiagnosed for 37 years (41 now) and I started getting thoughts like that around her age because I knew there was something different about me that no one liked or even understood, but couldn’t figure out what it was.",
      "created_utc": 1729318395.0,
      "score": 276
    },
    {
      "id": "lsnd8o9",
      "body": "What's the relationship with her father like? Not making any assumptions but it could be possible she did endure some type of abuse.\n\n\nFrom my experience, young children usually get suicidal thoughts from two causes, either abuse/trauma or bullying. \n\n\nIt may be worthwhile to look into the former.\n\n\nIf she's being bullied regularly, you may need to think about getting her into a different school as well",
      "created_utc": 1729318938.0,
      "score": 80
    },
    {
      "id": "lsmotw5",
      "body": "Usually 7 year olds cannot comprehend death so the fact that she is suicidal is concerning. What kind of media is she consuming? What kind of people is she around?\nI think you just need to reevaluate everything she is taking in and try to cut off that influence, that way she cannot indulge in it and work towards getting better at therapy",
      "created_utc": 1729306069.0,
      "score": 146
    },
    {
      "id": "lsmzc9a",
      "body": "I had suicidal thoughts at 9 because of my dad, since then it's been consant over everything. Get her therapy and make her happy, I wish I said something back then and maybe I wouldn't be as miserable.",
      "created_utc": 1729310890.0,
      "score": 19
    },
    {
      "id": "lsng191",
      "body": "Ok you may want to hear my perspective on this. I have adhd bipolar and possibly autism. There are some mental disorders, including these, that can be present in children. They greatly increase the chance of suicidal thought. Bipolar and adhd in particular can best be managed by medication, not just therapy. If I didn’t have my bipolar medication I may have died by now. \n\nYou may wonder if there are other factors like people are saying. my thought is that getting bullied may explain it a little, but considering there are no signs of childhood trauma she should reasonably be able to regulate better from having a healthy family. That’s why I worry that it’s a deeper medical issue. \n\nI also had a neighbor whose kid (around your kids age) got diagnosed with PANDAS, a condition rarely induced by strep throat. It can cause these sorts of neurological changes. So physical diseases can also cause this sort of thing.\n\nMy advice is look into the cause. Medication may be your savior. Get a mental health evaluation for her.\n\nEdit: there are disorders that represent childhood bipolar or predict bipolar behaviors. No, she doesn’t need a full bipolar diagnosis. She can still be helped by medication depending on which issue she might be facing. Arguing about technicalities is annoying and unhelpful.\n\nAlso note that I’m not attempting to diagnose her I’m recommending getting more intense help. There are many other potential issues that cause suicidal thoughts. Schizophrenia is another one.",
      "created_utc": 1729320793.0,
      "score": 14
    },
    {
      "id": "lso9y3q",
      "body": "23M It’s not you my guy. It’s the world we live in. Trust me.\n\nIt’s so common to feel that way that it deeply unsettles me. Just do your best and be there for her however you can, try and help her develop some close friendships and people to relate with/interact with. That could be a good start. \n\nUsually the death people want at that age isn’t literal, but figurative… they want change, but the only way they can think to achieve it is through death. Find out what she wishes she could change, and help her do so as best you can. \n\nThat’s my best advice after spending a life in her shoes",
      "created_utc": 1729339747.0,
      "score": 28
    },
    {
      "id": "lso50bh",
      "body": "I wish more parents would see the common denominator here. Withdraw her from school and change her routine completely. Imagine working a job you absolutely loathe every single day, with no end in sight, under force. You would beg for change, so make a change.",
      "created_utc": 1729337217.0,
      "score": 14
    },
    {
      "id": "lsnka9i",
      "body": "I’m so sorry you and your daughter are going through this, OP. I also started feeling suicidal when I was 8, I’m now 35. Please understand the following is from my own experience, and not intended as judgement toward you or anyone else:\n\n1: You say she hasn’t experienced any abuse or trauma. But, how can you be certain? We all have different protective factors and thresholds for trauma - what is traumatic to one person, may not be to the next. It’s also possible that there are traumatic or abusive events that you don’t know about. There could be events that deeply affected her that she doesn’t consciously understand as traumatic, or abusive. So she doesn’t think to bring them up.\n\n2: Environment can be a major contributor to things like this. Does she have a good relationship with her parents? Does she feel safe in her home? Does she feel heard? For myself, two different social workers -technically- saw nothing wrong with my home, as a kid. But I never felt safe in my home, and my father was verbally (and sometimes physically) abusive. I was an undiagnosed autistic child that was deeply affected by the chaos of my family, even when my siblings were (mostly) ok. And so, it was always seen as something wrong with ME. But once I escaped my parents house, I blossomed. I’m not saying this to try and say you’re a “bad parent”, but maybe your daughter is similarly sensitive, and maybe even autistic, too? Environmental overwhelm can be absolutely devastating for us, especially when we’re so young and so new to experiencing all these feelings. Try to step back and take a hard look at what your dynamic might look like to your daughter - and ask her, too. Ask her if she feels safe at home, ask her what she needs to feel safe, if not. Make sure her bedroom is her sanctuary - never walk in unannounced, decorate it to her liking (to the best of your ability/means/etc). \n\n3: Bullying at school was a major reason I wanted to end my life at such a young age. It made it so I didn’t feel safe or accepted anywhere - home was chaotic, kids at school were cruel. I had nowhere to go to just exist as me, and not be under stress. I’m glad your daughter has a great therapist to confide in! But if she’s not already involved in after school activities, it could be worth looking into some for her. Art groups and classes are where I found my peace, as a kid. \n\nIn summary: the reason I felt suicidal so young is because of an overwhelming feeling of being unsafe, unwanted, and like I was the problem. I had nowhere I could go to find peace, away from the bullies and my screaming father and my helicopter mother. I had severe anxiety issues that took most of my life to work through, that still pop up from time to time. \n\nAgain, I know this comment is making a lot of assumptions… but if your daughter is anything like me, I really hope this can help you, help her. I know you love her and will do whatever you can to make her better. Thank you for reaching out. I really hope things get better for the poor kid.",
      "created_utc": 1729323702.0,
      "score": 15
    },
    {
      "id": "lso2gyv",
      "body": "im 27 and this sounds like exactly like me when I was a child and now they discovered I have autism,try to get her evaluated,she mighy need some heavy coping mechanisms:( so heartbreaking to hear another little person experience these thoughts",
      "created_utc": 1729335809.0,
      "score": 5
    },
    {
      "id": "lsn0cty",
      "body": ">Said she doesn't understand why she feels this way, why she has these thoughts.\n\nThis makes me wonder about psychosis.  Specifically, I don't know if you've heard of \"command hallucinations,\" but they are voices that tell you to do things.  I do remember a client who experienced command hallucinations telling him to overdose, jump in front of cars, etc.  He begged me to get him to the hospital for commitment because he said he couldn't trust himself.  \n\nAgain, I'm just throwing things out there: this is not medical advice, and I'm sure there are other possible explanations.  Just maybe something to ask the therapist about possibly assessing for.",
      "created_utc": 1729311412.0,
      "score": 24
    },
    {
      "id": "lsnhxup",
      "body": "I was suicidal at that age, (and tried to kill myself a few years after that) and i think to some extent it's just the kind of person I am. sure, I have mental health issues and stuff but I have also been just absolutely fascinated by death my whole life, and it manifests like this. idk what the solution is, other than make sure you are allowing her to be curious about death instead of shutting down any mentions of it (what my parents did) and also a big help to me was having access to art exploring it. I was a bit older at that point (like 10) but poetry gave me a space to play around with the things I was fascinated by/experiencing but that were taboo or not seen as good for children to think about, and suicide was one of those things. I needed that space to explore it without judgment or expectation. idk if this helps.",
      "created_utc": 1729322078.0,
      "score": 11
    },
    {
      "id": "lsmomho",
      "body": "[removed]",
      "created_utc": 1729305982.0,
      "score": 4
    },
    {
      "id": "lsp3axx",
      "body": "This child needs to see a psychiatrist. Whatever put these ideas in her head (YouTube, social media, a classmate, a weird adult, a chemical imbalance, some neurodivergency, whatever), the psychiatrist will be able to help you deal with it. The therapist is clearly not enough right now.",
      "created_utc": 1729351355.0,
      "score": 4
    },
    {
      "id": "lsp8npo",
      "body": "Be glad she is taking to you about her feelings.  For school get an IEP (Individual Education Plan) by contacting the special Education Department.  They will do a complete PsychEd Evaluation.  The IEP can help with the school side of things.\n\nI’m 52, was undiagnosed most of my life, even after years of counseling. I have atypical Bipolar.  I do not have typically manic / depression cycles.  But medication (Seroquel) had made a huge difference in my life (been on it for 1 year).  \n\nI remember having suicidal ideations since I was 9 or 10, I didn’t have parents or friends that I could talk to.   Felt uncomfortable talking to my husband about these feelings of uselessness.  My first attempt was when I was 48.  (October and April are my worst months).\n\nI should also add that I had a benign brain tumor in my frontal lobe that was discovered (surprise) when they did a sinus CT scan.  That tumor may have been there my entire life, growing slowly year after year. I had the tumor removed when I was older, it quadrupled in size over a 2 year period.\n\nMy point, you’re doing great. It can be a multitude of things going on (growing, school, hormones, undiagnosed illnesses, pain, or just brain chemistry).",
      "created_utc": 1729353194.0,
      "score": 5
    },
    {
      "id": "lsqqrkt",
      "body": "I have severe suicidal ideation, and I’ve had it since I was about 7/8 years old. I think for me personally nothing is easy, everything gives me major anxiety, even “good things” and I never get a break from the constant overwhelm of it. To my brain threatening to take myself out is the easiest quickest fix I can come too, and as a human we like quick easy fixes. No it doesn’t make sense, yes I understand that it’s a permanent solution to a temporary problem but it doesn’t prevent my brain from automatically going there. I’d talk to her therapist about anxiety disorders and how to help her regulate her issues without her brain automatically going this far. Suicidal ideation gets easier to deal with the more regulated you are. Whether it’s better sleep, more self soothing habits, being able to name your real emotions, or even medications. It’s absolutely something a good therapist would be addressing full stop and trying to find a permanent helpful solution, this is a situation that can become very deadly very quickly. Please push the therapist for answers, be your daughter’s advocate, no matter what it takes.",
      "created_utc": 1729371342.0,
      "score": 4
    },
    {
      "id": "lsnt5ly",
      "body": "Maybe get her some scans, of her brain etc, maybe something medical could be contributing? \n\nThis is so scary, I am so sorry this is happening",
      "created_utc": 1729329923.0,
      "score": 3
    },
    {
      "id": "lso41j1",
      "body": "I was suicidal at 8 as a little girl, I remember my therapist bringing up the notes I had written to God begging him to kill me that year. It was 1000% due to being undiagnosed with autism, and smart and congenial enough to mask it. Masking (and being a girl, only boys had autism in the early 2000s) left me undiagnosed and without resources, so by the time I was 8 I was **exhausted** just by being alive, and just plain talk therapy and great parental support couldn’t have helped. Idk if this is your daughter’s experience, but being diagnosed as an adult has helped me with feelings I have had since childhood, starting at around 8 years old.\n\n\nYou’re doing an amazing thing by just asking for help, and your kid has a caring and understanding parent!!!",
      "created_utc": 1729336688.0,
      "score": 3
    },
    {
      "id": "lsqo0tx",
      "body": "I am a teenager and I keep hidden about my suicidal thoughts, secretive bullying might be the cause for her",
      "created_utc": 1729370406.0,
      "score": 3
    },
    {
      "id": "lst1tjw",
      "body": "Not sure if it was said already, but is she neurodivergent (ASS, ADHD,…)? I am recently diagnosed high-functioning ASS at 36, and have felt suicidal in periods since I was 6-7. Stupid things could trigger it because I always felt I did not fit in, no matter how much I tried. I am sorry your daughter feels so and and I hope you are able to give her the help she needs.",
      "created_utc": 1729406194.0,
      "score": 3
    },
    {
      "id": "lswqmjo",
      "body": "I say look into adhd, autism, bipolar, brain scans, perhaps get a pet dog, I'm trying to help but for this part please don't get mad, its just a thought and its have you thought about perhaps finding a new partner for you and your children and her too. Why is she getting bullied is it due to her actions in school or her appearnece beacuse in elementary school the kids who were bullied were the really skinny or fat ones. I was fat in elementary school and I was bullied cause of it. kids threw rocks at me, made fun of me, called me a loser, nerd, girls and boys bullied me. Teachers never helped. But as soon as I lost weight due to the fact that my aunt came and saw what my mom was feeding me and our living conditions in one summer I lost all the weight. and POOF my bullying went from daily to maybe once every 3 weeks or 2 weeks supriseingly my mental health improved a lot when I came back to school that fall in 2014 at 8 years old versus when I was 7 and bullied for being overweight. virtually gone. So my final cents are check her brain for disorders, if she is overweight or skinny since I say ITS really important to not get bullied at that age. perhaps start dating again for your children and yourself.",
      "created_utc": 1729460197.0,
      "score": 3
    },
    {
      "id": "lsn5uop",
      "body": "Is she on medication? Therapy and medication might be needed together.",
      "created_utc": 1729314392.0,
      "score": 3
    },
    {
      "id": "lsngdjq",
      "body": "i say this as a 21 year old who grew up with the internet she could have traumatized herself with it even if you didnt allow her to use the internet unsupervised it dosnt mean she hasnt used it without your knolage, friends houses, school. websight blockers dont do anthing i found porn on school computers as a kid all the time aswell as kids youtube isnt filtered by real people so alot of pedo shit discized as child friendl content gets uploaded there, i know alot of poeple who saw porn, suicide videos, real gore on the internet at 7 or 8 so i wouldnt say she dosnt have truma cuz you really dont know, also alot of iligal websights arnt blocked by normal blockers cuz there under weird code or somthing so if you have like porn webights blocked on your intenet somtimes iliigal porn will slip threw, as a child i came across ALOT of child hentai trying to just inocently look at manga online witch dose alot to a lil kids brain..",
      "created_utc": 1729321024.0,
      "score": 5
    },
    {
      "id": "lsmt0e9",
      "body": "[removed]",
      "created_utc": 1729307904.0,
      "score": 1
    },
    {
      "id": "lsnkshy",
      "body": "Could she possibly be feeling sadness, anxiety, rejection or other feelings far more intensely than her peers? And using this language to express how much pain she’s in? Or perhaps she’s feeling emotionally invalidated, and saying this to get validation from those around her.\n\nI’m sorry you’re going through this. I made suicidal threats starting at age 3, and these were some of the reason why. Went on to be diagnosed with Borderline personality Disorder. She’s much too young to get that diagnosis, but it’s worth looking into and seeing if you see any similarities.",
      "created_utc": 1729324066.0,
      "score": 2
    },
    {
      "id": "lsnretw",
      "body": "Hello, \n\nAs a teenager who had these thoughts when I was 9/10 I think I can relate to your daughter.\n\nI am diagnosed as autistic and I’m not trying to diagnose your daughter at all but I found I so draining going into school and masking my stimming and pretending to be somebody I’m not so I would have friends.\n\nThe classroom was such a heard experience for me and I hated going into school. It got to the point where I had 2 complete breakdowns in year 5 where my dad threatened to phone 999\n\n\n\nI’m not saying that your daughter is autistic but she could be. I masked a lot of my autistic behaviour from my parents because I’m not sure how they would react.\n\nOne thing that helped me was a phew phrases:\nWe’re always here to support you\nIs there anything I can do to help\nDo you need me to ask school about anything\n\nI am now 14 and thriving in high school with an autism diagnosis. Support has been put into place for me.\n\nI definitely recommend asking the school about how she’s doing, researching about her possible being neurodivergent or talking to her and asking her why she feels this way. It may not work at first but it’s always worth a shot.",
      "created_utc": 1729328737.0,
      "score": 2
    },
    {
      "id": "lso1u6d",
      "body": "Maybe undiagnosed autism?",
      "created_utc": 1729335446.0,
      "score": 2
    },
    {
      "id": "lso25au",
      "body": "Check what kind of influences she's getting. Especially online. Nothing is ever as good as it seems.\n\nFurthermore, maybe get her checked for mental disorders or learning disorders. Especially as a kid, when there's something you can't do and you don't understand why you start to feel hopeless. A few steps further can also end up here.",
      "created_utc": 1729335624.0,
      "score": 2
    },
    {
      "id": "lso3j48",
      "body": "Is there a possibility that she is being abused or was abused?\n\nWhen I was 4-11 and getting abused (physically,sexually, psychologically) by various people and even physically by someone in the house, others did not know becasue the abuser made me so afraid that I ended up becoming really good at pretending like I’m fine and nothing like that is happening but frustrations about killing myself would still be said at times.",
      "created_utc": 1729336403.0,
      "score": 2
    },
    {
      "id": "lso58nt",
      "body": "I feel as long as the concept of death and suicide is there kids can get these ideas. I had my first suicidal thought at around 9 but it wasn’t “kill me now” though. It was “life is so tiring, I might probably hang myself when I’m thirty”. I wasn’t watching any crazy shows too.\n\nTurns out I wasn’t fully healthy and had something like fibromyalgia/CFS and my symptoms dated back to when I was 4 ish.",
      "created_utc": 1729337344.0,
      "score": 2
    },
    {
      "id": "lsov43r",
      "body": "My nephew (9) tried to take his life due to bullying, so I understand the helplessness you may be experiencing too. That type of situation is impossible to know what to do. It's your first time being a parent too. You're getting her help and you're monitoring as much as you can. Support is the most important thing for kiddos suffering this way.",
      "created_utc": 1729348517.0,
      "score": 2
    },
    {
      "id": "lsq4e36",
      "body": "This is how I used to act as a kid, and I was being severely abused by my uncle. Please talk to her therapist about the proper questions to ask.",
      "created_utc": 1729363689.0,
      "score": 2
    },
    {
      "id": "lsq9k25",
      "body": "Have her tested for dyslexia and ADHD. School is a horrible struggle with learning differences.",
      "created_utc": 1729365452.0,
      "score": 2
    },
    {
      "id": "lsrckh1",
      "body": "My son was saying things like \"I wanna die\" when he would get mad. My dad stepped into the picture and was what I thought was harsh. Years later, he said his grandfather's strict guidance is what helped. He said he needed structure but didn't know it. Now be forewarned. I think this isn't the usual. Could your child be looking for structure? My mom and I heavily dived in with emotion and concern and he said he didn't know it but he needed the structure of \"I love you, but if this behavior continues we are immediately putting you in the hospital and we are keeping full surveillance on you from this point on either way\". My father basically told him this isn't going to continue because I love you too much for it too. He wouldn't let my son out of his sight for 5 straight months and the one time he said it again, my father had him hospitalized. I was madnat my dad for a long time for being so harsh, but my son said it was what he needed. Now every experience is different but my dad basically told him I'm watching you and I will not allow this to happen. I was shocked when my son said his grandfather saved him because I tried to overload him with love when it was happening but I guess he needed love and structure.",
      "created_utc": 1729379315.0,
      "score": 2
    },
    {
      "id": "lsrvhfn",
      "body": "My self destructive behaviors started at age 11. I made a very serious , almost successful attempt at age 12 because no one listened to me earlier on due to my age. I was put into psych unit for children ages 6-12. There’s many of those in my area. If your area really doesn’t offer that you may need to go further to seek treatment. Deeming her threats not credible due to age is WILD. An 8 yr old should not be having these thoughts and she needs help. She’s very young and this happening during very formative years is concerning and demands early intervention.\n\nDon’t stop until you find someone willing to listen. This can be turned around but it needs to happen ASAP. Early onset mental illness isn’t thought to be very common , yet my children psych unit I was on was ALWAYS FULL. I had early onset of bipolar , I knew kids there with early onset schizophrenia. And I mean no offense when I say this , but kids don’t always tell their parents everything. There is a chance that some trauma occurred without your knowledge. These things are almost always triggered by trauma especially so young. You are doing the right thing taking this seriously , keep fighting for your baby!",
      "created_utc": 1729386524.0,
      "score": 2
    },
    {
      "id": "lss1dj3",
      "body": "You doing well getting her check and addressing it as soon as possible. Hug OP!",
      "created_utc": 1729388879.0,
      "score": 2
    },
    {
      "id": "lsszmk9",
      "body": "not to scare you there's really no way to be sure she has \\*no\\* experience with abuse or trauma unless you are literally the only person in her life. if she goes to other family members' houses, events with them, public school, etc, there is a chance something happened.",
      "created_utc": 1729404795.0,
      "score": 2
    },
    {
      "id": "ltj1wvo",
      "body": "First thing that came into my mind: autism/ADHD/chemical imbalance/being transgender",
      "created_utc": 1729784706.0,
      "score": 2
    },
    {
      "id": "lsmzons",
      "body": "At her age it’s very hard to be evaluated or diagnosed with mental illness, there may be a chemical imbalance in her brain that needs medication to help balance, it could be learning how to better react to and manage stress, etc. \n\nHave they taken bloodwork? Checked for something physical going on?",
      "created_utc": 1729311064.0,
      "score": 4
    },
    {
      "id": "lsqaqyo",
      "body": "I feel like she could be one of the rarer cases with a disorder caused by something wrong with her brain or hormones. Although therapy is definitely always a good idea, please also have her body, especially her brain checked to make sure it's not a tumor causing this. Best wishes for all of you",
      "created_utc": 1729365852.0,
      "score": 2
    },
    {
      "id": "lso7sqa",
      "body": "I don't know what aside from therapy can help, but you are doing well by acknowledging the issue and giving therapy.\n\nYou are aleeady doing more than most parents would, merely by taking the issue seriously and being there for your kid.\n\nStay supportive, kind, and emotionally present as much as you can. I wish your child a long and very happy life. You really are a good parent.",
      "created_utc": 1729338690.0,
      "score": 1
    },
    {
      "id": "lspse5q",
      "body": "Is she being bullied at school ? I was seven years old when I started having depression as well so I’d advise if there was no trauma at home something else is playing in the background",
      "created_utc": 1729359751.0,
      "score": 1
    },
    {
      "id": "lspvfeq",
      "body": "Kinkkush is a jackass. Blocked me after they felt stupid and realized they're in the wrong. \n\nIm just being petty back is all.\n\n\nI didnt say you thought it was funny that they said that, just the lame ass joke you tried to make.\n\nHey, I mean, I guess you got to be a troll like you wanted about an 8 year old saying they want to commit suicide! So i guess there's that! \nYou're right though.. I probably should grow a nutsack since I don't find jokes funny that are made at someone's kid saying they want to die.. \nDo you for real not see how stupid you sound right now? \nMaybe instead of having ginormous balls, and making fun of a little kid, you could just keep scrolling past?",
      "created_utc": 1729360756.0,
      "score": 1
    },
    {
      "id": "lsq2n9v",
      "body": "It's possible that she has an underlying mental health disorder, so, prolly have her evaluated for child-onset mental illnesses.",
      "created_utc": 1729363118.0,
      "score": 1
    },
    {
      "id": "lsq941x",
      "body": "Look into wraparound programs.",
      "created_utc": 1729365298.0,
      "score": 1
    },
    {
      "id": "lsqe75x",
      "body": "I had these thoughts at 7, I’m 33 now.  I am diagnosed with an autoimmune condition.  Have her checked for vitamin deficiencies.  Try natural ways of battling depression.  I’ve got clinical depression but I’ll never take pills for it.  Nature has every cure.  Wishing you well.",
      "created_utc": 1729367032.0,
      "score": 1
    },
    {
      "id": "lsqk3g5",
      "body": "There might be some issues at school that she's not disclosing.\nI think alot of parents underestimate the craziness of schools and today's day and age.",
      "created_utc": 1729369063.0,
      "score": 1
    },
    {
      "id": "lsra3yc",
      "body": "Try a psychologist or a psychiatrist, vs a therapist. Best of luck to you, 8 is way too young to feel this way.",
      "created_utc": 1729378395.0,
      "score": 1
    },
    {
      "id": "lsram0x",
      "body": "My first attempt was at 13",
      "created_utc": 1729378586.0,
      "score": 1
    },
    {
      "id": "lsray0b",
      "body": "I have been suicidal since I understood humans can die. I want to be clear, I’m not blaming you, and I’m not saying you have done anything wrong. Nothing I say next is a reflection on you as a parent, I’d say this to any parent and I have done! Can I ask, are YOU in therapy? What is the situation with the rest of your immediate family and their mental health? You just need to understand that you have a very narrow window to get on top of this or it becomes cemented in her mind, and not much longer after that it starts to physiologically take hold. Her alone having therapy is not the beginning and end of the solution. I know how huge an ask this is, but I urge you all (all family members) to deeply evaluate and treat the entire family unit. There may be an external influence of her suicidality (friends, bullies, learning difficulties etc) but kids don’t arrive at that solution first. By age 7 she has established that death is the solution to her suffering, which means generally she has thought and tried other solutions but hasn’t been successful. And I want to stress to you that just because you don’t think she has experienced abuse or trauma, doesn’t mean she hasn’t. Suffering is relative. Trauma is formed by being left in pain. Physical, emotional….. it doesn’t matter what the pain is, if you are left in it and not moving through it, it forms trauma. And two people can have the exact same experience and one can form a trauma from it and one won’t, so please, do not be dismissive about her pain and suffering, or the cause of it. Again, I’m not saying this is the case for your daughter, I’m giving you context on your perception because you as her mother are too close to the situation that you aren’t able to see the full picture. So her mindset can come from many sources, but the key to getting her through this and get her back on track to becoming a healthy human with strong coping mechanisms and the ability to overcome adversity….comes back to ensuring she has a safe and supportive space at home. You might think she does, but what you consider safe and supportive might differ to her, as it does between most humans. These are things you can establish and develop in family therapy. In terms of her personal therapy, what has her therapist said in terms of diagnosis or evaluation? Do they specialise in anything in particular (like neurodivergence? Behavioural issues?). As a woman, I strongly recommend seeing a therapist who specialises in neurodivergent girls for at least an evaluation. She may not be, and I could be projecting, but it does hit home for me and you will NOT get that help at a hospital or through any kind of general medical system.",
      "created_utc": 1729378710.0,
      "score": 1
    },
    {
      "id": "lsre7pi",
      "body": "I’m so sorry I’m sure you’re just heartbroken",
      "created_utc": 1729379920.0,
      "score": 1
    },
    {
      "id": "lvn48nz",
      "body": "There’s a chance she’s trying to say something else but doesn’t have the words for it. Try taking her to a general child psychologist and a speech therapist as well to see if they can figure out if she’s trying to say something else.",
      "created_utc": 1730863882.0,
      "score": 1
    },
    {
      "id": "lsninq2",
      "body": "has she been diagnosed with anything yet? i’d definitely be getting that done ASAP",
      "created_utc": 1729322567.0,
      "score": 1
    },
    {
      "id": "lsokua4",
      "body": "One of my kids has struggled with similar issues, and it's taken years of therapy and medication to get them remotely stable (problematic behavior since toddler ages and escalated to extremes around 6/7). They're in their teens now and mostly have it under control, but just keep trying to utilize every resource possible, and consider medication despite the young age. Most doctors don't like giving medication to young children, but in some cases, it's necessary. We have such strong mental health concerns in our family that even the 5yo has to have medication to manage moods and other issues that otherwise can't be handled due to age and not being fully mentally developed enough to understand and try to control/modify those behaviors and impulses.\n\nAnd as someone else commented, it sucks to violate privacy, but keep strict tabs on what your child is exposed to. Anything online, if they have creative hobbies (writing/drawing), check to see what they're expressing or looking up or anything else to gain any insight. It's such a rough time to try to manage and can put extreme strain on the parent/child relationship, but when it's the safety of your child and those around them, some sacrifices have to be made until the situation can be brought under control.\n\nI am so sorry you're having to go through this. I really hope you're able to get her the proper help to get her through it.",
      "created_utc": 1729344575.0,
      "score": 1
    },
    {
      "id": "lt63bhm",
      "body": "Maybe move out to the country,  no internet, she needs a mental cleanse, just good music and company and nature. ",
      "created_utc": 1729603596.0,
      "score": 1
    },
    {
      "id": "lsnt1gu",
      "body": "I’m so sorry you are going through this it’s heartbreaking, have you explained to your 8 year old how heartbreaking it is for you? Some facts might help her.",
      "created_utc": 1729329843.0,
      "score": 0
    },
    {
      "id": "lsqh8wj",
      "body": "I didn't even have internet when I was 8. Take the shit away",
      "created_utc": 1729368076.0,
      "score": 0
    },
    {
      "id": "lsnylds",
      "body": "for future crisis situations, working with a crisis line (if you’re in the US) instead of the ER might be an easier way to go to get a crisis evaluation",
      "created_utc": 1729333467.0,
      "score": -2
    },
    {
      "id": "lspk3yd",
      "body": "[removed]",
      "created_utc": 1729357064.0,
      "score": -2
    },
    {
      "id": "lsozqaa",
      "body": "[deleted]",
      "created_utc": 1729350118.0,
      "score": -3
    },
    {
      "id": "lsnhu0d",
      "body": "She is not sucidal. suicidal ideation is not possible at THAT age. take all her electronics. thats the problem. pretty sure her \"suicidal ideation\" will go away real quick! and this is coming from someone who has dealt with a mental health crisis.",
      "created_utc": 1729322005.0,
      "score": -22
    },
    {
      "id": "lsn8bg7",
      "body": "[deleted]",
      "created_utc": 1729315838.0,
      "score": -30
    },
    {
      "id": "lspquy3",
      "body": "It was the same for me, except I started having suicidal thoughts when I was 5-6 years old.",
      "created_utc": 1729359251.0,
      "score": 37
    },
    {
      "id": "lsnzz7e",
      "body": "Adding onto this, please don't get angry at her if you find weird shit; especially not in the state she seems to be in. I know at the age of eight I was in some weird corners of the internet.",
      "created_utc": 1729334341.0,
      "score": 279
    },
    {
      "id": "lsohkgs",
      "body": "Also, cut off her access to the internet, full stop! She is not in a healthy place to navigate it properly.",
      "created_utc": 1729343195.0,
      "score": 22
    },
    {
      "id": "lsndlql",
      "body": "Agree. She sounds like me when I was her age, I have sensory issues😅",
      "created_utc": 1729319179.0,
      "score": 98
    },
    {
      "id": "lsoprdp",
      "body": "Agreed. I had obvious ADHD that went undiagnosed until i was 40-ish. I was suicidal most of my childhood. Granted, i had abusive parents as well, but the adhd and lack of help was a huge factor",
      "created_utc": 1729346533.0,
      "score": 18
    },
    {
      "id": "lsp6t8n",
      "body": "This is worth looking into.\nAs a child I went to several psychologists, but not one of them said I was autistic… They said I had no issues, since “She is very eloquent” and “She is really smart”.\n\n\nBecause I am autistic, I was bullied. Around my pre-teens, I had to drop out of school because I was severely depressed.",
      "created_utc": 1729352566.0,
      "score": 11
    },
    {
      "id": "lsnt55z",
      "body": "I also have spectrum features and I wanted to go back in time at age 5 as I was scared to get old I wanted to be 2 again because life seemed so hard at age 5",
      "created_utc": 1729329914.0,
      "score": 31
    },
    {
      "id": "lsq2kk2",
      "body": "I'm wondering this, considering how common the will to \"depart\" seems to be quite common when the neurodivergent are kids.",
      "created_utc": 1729363095.0,
      "score": 9
    },
    {
      "id": "lsr5ukv",
      "body": "seconded. i had undiagnosed autism and dyspraxia, and wanted to die on the daily as a kid. i knew i was different, and different was coded as worse, even though its not.\n\nglad you’re still here, my friend. ♾️❤️",
      "created_utc": 1729376810.0,
      "score": 5
    },
    {
      "id": "lsru98j",
      "body": "I agree. My autism made me feel this for as long as I have memory",
      "created_utc": 1729386035.0,
      "score": 3
    },
    {
      "id": "lsoxktf",
      "body": "Autism and other associated disorders are very hard to diagnose in females compared to males, until their teens or even later.",
      "created_utc": 1729349381.0,
      "score": 0
    },
    {
      "id": "lso8ajw",
      "body": "Her dad is not very involved in her life and she absolutely feels rejected by him. It's a huge attachment wound. When me or her therapist ask what her biggest struggle is, it's always something to do with her dad, or the new family he made. She sometimes experiences bullying at school, and the school does a great job of dealing with each instance and keeping the kids apart. I have looked into new schools but I'm worried there will just be different asshole kids there who will also bully her, and maybe worse. So I haven't made any moves in that direction.",
      "created_utc": 1729338937.0,
      "score": 73
    },
    {
      "id": "lsnkpte",
      "body": "Agreed",
      "created_utc": 1729324013.0,
      "score": 0
    },
    {
      "id": "lsmp71y",
      "body": "The kids version of YouTube is what she watches during her free time. Otherwise she's with me or her grandparents. Not much time out of our sight. Definitely going to evaluate her media time.",
      "created_utc": 1729306224.0,
      "score": 76
    },
    {
      "id": "lso8azi",
      "body": ">Usually 7 year olds cannot comprehend death\n\nReally? I think it is enough time to learn from hearsay, media, or even your own life that there is an event when people stop to exist and never come back. 5 years is too early, but as for 7 — I doubt\n\n>I think you just need to reevaluate everything she is taking\n\nYeah, might be the case actually, because I have no clue about how modern children's internet is. I only know it's as unmoderated as back in my times, but infested with content engaging farms.",
      "created_utc": 1729338943.0,
      "score": 23
    },
    {
      "id": "lso1rzj",
      "body": "They won’t diagnose bipolar at age 8 though. Not until almost 18 at minimum. Most the time they won’t even diagnose adhd for years either. It’s more likely to be some media she’s consumed or bullying going on at school etc",
      "created_utc": 1729335412.0,
      "score": 3
    },
    {
      "id": "lsno7w4",
      "body": "I also have bipolar and autism. I made a comment on this post describing my experience and yours, op’s daughter, and myself sound very similar",
      "created_utc": 1729326474.0,
      "score": 2
    },
    {
      "id": "lsoygjs",
      "body": "Well said ! I salute you 👏",
      "created_utc": 1729349683.0,
      "score": 4
    },
    {
      "id": "lsnoq9s",
      "body": "Agree with all of this, and I've also been suicidal since 8. OP, I know this is hard to hear, but it is possible there's abuse you aren't aware of and that she may have blocked or doesn't realize counts as abuse or was told she or you would be hurt if she told - my most traumatic event happened when I was at home with my family where they thought I was safe; I was just in a room alone with a relative for a little bit, and he told me if I told he would kill me or my mom.\n\nI immediately blocked what happened and started wanting to die, didn't eat, had panic attacks, etc. I came to my parents about horrible paranoid thoughts I was having (things that were similar to the abuse but not exact - like thinking the devil was trying to sleep with me or that someone was stalking me and outside my window.)They brushed it off as bad dreams but it was me trying to deal with what I blocked.\n\nBe mindful of any behavioral or personality changes (on top of these thoughts) and anything she's told you or become preoccupied with that could be some kind of subconscious way of processing abuse.",
      "created_utc": 1729326833.0,
      "score": 9
    },
    {
      "id": "lsncneo",
      "body": "I don't believe that's what it is. I've had mental health issues since her age myself (I'm now 20) and said the same thing myself because that's genuinely how I felt.\n\n\nBased off of OPs responses, I believe she's most likely feeling this way due to being bullied",
      "created_utc": 1729318550.0,
      "score": 20
    },
    {
      "id": "lspfucn",
      "body": "Psychosis is extremely rare in children so occam's razor is that there are a billion other more likely causes to rule out first.",
      "created_utc": 1729355641.0,
      "score": 3
    },
    {
      "id": "lsmov0y",
      "body": "Yes, she was being bullied that day. The school dealt with her and the other student and she hasn't had problems with them since. But that's what caused her to make that statement.",
      "created_utc": 1729306082.0,
      "score": 15
    },
    {
      "id": "lsp3kn3",
      "body": "I agree. I'll be making an appointment Monday.",
      "created_utc": 1729351448.0,
      "score": 3
    },
    {
      "id": "lso8scb",
      "body": "She is not. I've thought that too but it sounds like kids aren't often put on medications for mental disorders, not until they're older.",
      "created_utc": 1729339183.0,
      "score": 6
    },
    {
      "id": "lsp04un",
      "body": "Isn’t she too young to take antidepressants?",
      "created_utc": 1729350259.0,
      "score": 1
    },
    {
      "id": "lsoszmn",
      "body": "[deleted]",
      "created_utc": 1729347744.0,
      "score": -2
    },
    {
      "id": "lsmt4ba",
      "body": "I have considered it. But as a single mom with a full time job I just don't know how I would swing it.",
      "created_utc": 1729307952.0,
      "score": 3
    },
    {
      "id": "ltj2bl8",
      "body": "I don't think it's bullying because she doesn't know why she feels this way",
      "created_utc": 1729784828.0,
      "score": 2
    },
    {
      "id": "lso93bw",
      "body": "They ran a basic panel at the hospital during her first evaluation. Everything was normal",
      "created_utc": 1729339331.0,
      "score": 1
    },
    {
      "id": "lss1q5l",
      "body": "Heartbroken and terrified.",
      "created_utc": 1729389021.0,
      "score": 3
    },
    {
      "id": "lspsoc7",
      "body": "[deleted]",
      "created_utc": 1729359846.0,
      "score": 0
    },
    {
      "id": "lsr50y0",
      "body": "a kid may not understand the intricacies of death, or it’s social or spiritual meaning(s), or the taboos surrounding it, or anything about it in the broader framework as how we interact with it, but a kid that age CAN understand death as a general concept, and can be suicidal at that age.\n\nsource: i was born self-injurious and suicidal, no known cause. i have always wanted to die, even without the language for it or a broader understanding of what death is. (and yes, now i know death with great familiarity - it’s my job!)",
      "created_utc": 1729376503.0,
      "score": 2
    },
    {
      "id": "lsnkuwm",
      "body": "I think this would be more of a punishment than a protective step\n\nEducation about the internet is important at this age\n\nNot blanket bans\n\nthis is coming from someone with 3 sons who all grew up with internet",
      "created_utc": 1729324113.0,
      "score": 12
    },
    {
      "id": "lsnohil",
      "body": "I tried to kill myself and was suicidal when I was 8",
      "created_utc": 1729326663.0,
      "score": 7
    },
    {
      "id": "lsnnswh",
      "body": "I was suicidal at that age due to abuse - it's definitely possible.",
      "created_utc": 1729326182.0,
      "score": 5
    },
    {
      "id": "lsr5j3v",
      "body": "it’s definitely possible at that age, and even earlier. my suicidal ideation predates me being 8, and also predates a lotta modern tech, let alone me having ACCESS to modern tech (i was born in the late 90s, so some of it was there, my family was just weird about it and didn’t let it in the home a whole lot).\n\nthis child IS suicidal. it IS possible and it IS happening. as someone who’s also had several mental health crises, i’m not an expert, but i sincerely hope this family does not bank everything on you.",
      "created_utc": 1729376692.0,
      "score": 1
    },
    {
      "id": "lsngbr4",
      "body": "Antipsychotics were the only thing that stopped me from wanting to die every day. Medication isn’t wrong it’s life saving. Get out of here.",
      "created_utc": 1729320991.0,
      "score": 10
    },
    {
      "id": "lsncxpm",
      "body": "The doctors know what's right for the child. Source: I'm studying psychology.\n\n\nLet's not put religion before proper medical care.",
      "created_utc": 1729318738.0,
      "score": 14
    },
    {
      "id": "lvn40cu",
      "body": "I also started at 5",
      "created_utc": 1730863800.0,
      "score": 1
    },
    {
      "id": "lso4gu0",
      "body": "Wow, I’m so sorry that phrase can even exist. It’s terrible that our society permits it. ❤️‍🩹❤️‍🩹❤️‍🩹",
      "created_utc": 1729336923.0,
      "score": 55
    },
    {
      "id": "lsors6w",
      "body": "[deleted]",
      "created_utc": 1729347299.0,
      "score": 57
    },
    {
      "id": "lsoqm8s",
      "body": "Not fully maybe monitor, taking away her freedoms like that could make her upset in a different way and maybe make things worse. Just because you take it away doesn't mean it'll change how she thinks though.",
      "created_utc": 1729346863.0,
      "score": 40
    },
    {
      "id": "lsor8fm",
      "body": "only if you're sure she doesn't have a support system online. isolating her if she has (appropriate) online friends would make things worse.",
      "created_utc": 1729347097.0,
      "score": 20
    },
    {
      "id": "lsxv0p0",
      "body": "That is a terrible idea when my parents did this I almost killed my self multiple times because I had no outlet video games and online friends were and still are a big interest and lifeline to me instead of yelling and tacking it tell her why it’s bad especially at that age",
      "created_utc": 1729474897.0,
      "score": 1
    },
    {
      "id": "lso4mwm",
      "body": "Dang! I don’t want to go back in age; I want to be a cat because I think they have zero responsibilities!",
      "created_utc": 1729337016.0,
      "score": 12
    },
    {
      "id": "lsom2f5",
      "body": "Have you looked into psychiatry?",
      "created_utc": 1729345088.0,
      "score": 24
    },
    {
      "id": "lsp5ldg",
      "body": "This. The strained relationship with her dad might be the main reason, besides bullying, negative media or lack of positive outlets for self-expression.\n\nI've had suicidal ideation since I was 6. At this age my thoughts weren't exactly formulated as \"I want to kill myself, I want to commit the physical act of unaliving myself\", more like \"I wish I wasn't alive, I wish I wasn't ever born, I wish I could just disappear\". I used to be a believer back then, so I would pray God to take me back to him, cause I thought that was the best thing, the right thing to do. I wasn't actively suicidal, but I was aware that I might do it at some point and I believed I wouldn't reach the age of 12 years old, because I would have surely killed myself by then (I'm 27 now).\n\nI remember clearly the reasons behind that state of mind. My mother had always told me she should have aborted me. I have always known that I wasn't meant to be born, that I was an accident, that my mother didn't plan me. My mother had good moments with me, there are many things to be grateful about her, don't get me wrong. It's just that every time she would get upset about something, she would go on rambling how my birth ruined her life, completely put her out of her path to achieve her dreams, how different her life would have been if she didn't give birth to me. There were also physical abuse besides the emotional one. I remember being dragged on the floor by my hair at the age of 5. So lots of mommy issues trauma.\n\nI don't have nearly as much daddy issues. I spent my childhood divided between living in my father's country with my parents and living in my mother's country with my grandparents (who were good to me). I never really got attached to my father to begin with. He didn't abuse me or neglect me, but he didn't either defend me much from my mother. I also knew he used to mistreat my mother and he did sorta abandon us twice.\n\nMaybe your daughter feels responsible for her father's actions, maybe she believes the world, your family would be better off without her. Maybe she feels undeserving to be alive. Maybe she's so much in pain she believes death would put an end to it. I can't tell what's the issue precisely, but for a little kid, their parents and family are their whole world. The relationship with their closest ones affects them deeply, more than anything else. I wouldn't overlook those daddy issues, I would try to better understand how she feels regarding this matter. Wishing you the best.",
      "created_utc": 1729352144.0,
      "score": 14
    },
    {
      "id": "lsn8idi",
      "body": "Kids YouTube is not properly moderated at all. Theres usually no porn or obvious violence, but stuff slips through all the time and video games, even violent and horror ones, aren’t moderated",
      "created_utc": 1729315952.0,
      "score": 141
    },
    {
      "id": "lsn280h",
      "body": "How much time does she spend watching YT? Excessive screentime and lack of social connection and interaction has been to found to be heavily linked to suicial ideations, depression, and anxiety. As someone who has struggled with this before screentime even became a huge thing, I can say my issues are 100% made worse when I'm on my phone and watching tv too much; I become withdrawn, I don't go out or excerise enough and stop interacting with others as much.\n\nAlso this may sound absolutely NUTS but I've been in therapy a long time and on antidepressants (I'm still on them! And attending therapy)... I recently discovered the benefits of ice baths in treating depression, anxiety, and suicidal ideations. They really don't understand why exactly its so much more effective, but it seems to be the most effective way to treat depression on its own when compared to meds and therapy separately, but all three together make for a powerful outcome.",
      "created_utc": 1729312387.0,
      "score": 46
    },
    {
      "id": "lso2lo6",
      "body": "kids youtube is worse than normal youtube",
      "created_utc": 1729335882.0,
      "score": 26
    },
    {
      "id": "lsngk4g",
      "body": "when i was around her age i wanted to die too still do but i was defenitly watching stuff a person of my age shouldnt of been you can see deleted search history or private search history idk how look at a tutorial on youtube to make sure she isnt watching anything bad for her",
      "created_utc": 1729321147.0,
      "score": 11
    },
    {
      "id": "lsr0gc4",
      "body": "Not true I was diagnosed with bipolar at age 13 it all depends on the severity of the symptoms the reason I was diagnosed so young was bc of how severe my symptoms were if they aren’t really severe they put it down as bipolar not otherwise specified until your 18 but I’ve never heard of bipolar being diagnosed before age 12 not even bipolar not otherwise specified",
      "created_utc": 1729374791.0,
      "score": 2
    },
    {
      "id": "lt8pkuu",
      "body": "There are other disorder names that children can be diagnosed with that predict bipolar adulthood or represent childhood bipolar. DMDD is most likely what they would be diagnosed with. So technically it’s not called bipolar but that’s how bipolar children get diagnosed.",
      "created_utc": 1729633136.0,
      "score": 0
    },
    {
      "id": "lsnlwof",
      "body": "As a fellow sufferer of mental health issues nearing 40, trust me: it doesn't remotely make us authorities. On our own situations, sure, but not others.\n\nMy schizoaffective nephew acted the same way as OPs kiddo at that age and command hallucinations were exactly what he was experiencing, but the distress prevented him from articulating it until years of therapy and medication.\n\nBut to OP, and I hope you see this: if that is what's going on or something like it, don't despair. My nephew is now 21, getting married and has a kiddo of his own while working and supporting his family. A little younger than I would have encouraged, but it is what it is and he's doing great.",
      "created_utc": 1729324845.0,
      "score": 12
    },
    {
      "id": "lspjy20",
      "body": "For full-on psychotic *disorders* like schizophrenia or delusional disorder, yes: they tend to onset after age 15 for males and 20 or females. \n\nBut just individual psychotic features caused by environmental factors, a different psychological disorder, or just stand-alone for whatever reason are relatively common at any age.  The Structured Interview for Psychosis-risk Syndromes (SIPS) exists specifically for this purpose, assessing psychotic features in children and early adolescents.",
      "created_utc": 1729357010.0,
      "score": 1
    },
    {
      "id": "lu5e2id",
      "body": "I worked at a psychiatric hospital and in severe kids are medicated at a young age. It might be a question to bring up with her doctor.",
      "created_utc": 1730107464.0,
      "score": 1
    },
    {
      "id": "lsnfbyc",
      "body": "Now that I hear you are a single mom I have some thoughts. I was a single mom for the first 4 years of my daughter’s life. She doesn’t know her bio dad. I eventually met someone who stepped up.\n\nShe is now a tween and she gets very emotional about how I never spend time with her. I found this very odd because I do so much for her. She gets teary eyed any time she talks about it.\n\nShe took the love languages quiz and scored very high on quality time. Quality time is 4/5 for me. So not something I put a lot of emphasis on.\n\nIt makes sense to me. I have been working multiple jobs and going to school at the same time her entire existence. It paid off because it got us out of poverty… but I can see now that she would rather us be homeless and be together than me be busy all the time.\n\nMaybe have your child take the love language quiz and see how you can best show up for them.",
      "created_utc": 1729320327.0,
      "score": 9
    },
    {
      "id": "lsmugvi",
      "body": "[removed]",
      "created_utc": 1729308554.0,
      "score": 0
    },
    {
      "id": "ltj5bd7",
      "body": "Yes I think this is a key piece too. She's getting evaluated soon.",
      "created_utc": 1729785717.0,
      "score": 1
    },
    {
      "id": "lso9l19",
      "body": "Run it again. Complete metabolic panel. Kiddo isn’t coping with therapy alone, ask for a referral to a psychiatrist, they can prescribe meds if need be. \n\nHow’s kiddos diet? Sleep? Does kiddo have a way to blow off steam in a healthy way? Have healthy relationships with their peers? Play a sport perhaps? What does kiddo enjoy? Encourage them to do more of that.",
      "created_utc": 1729339571.0,
      "score": 5
    },
    {
      "id": "lspsror",
      "body": "[removed]",
      "created_utc": 1729359876.0,
      "score": 0
    },
    {
      "id": "lsr7fvg",
      "body": "I’m sorry that you went through that pain and struggle \n\nI became fully suicidal when I turned into a teenager so maybe that’s why I thought that 8 years old is a bit too you young but that’s my ignorance \n\nI still suspect that the 8 year old daughter is suicidal due to bullying \n\nI also wanted to die during the times I was getting bullied",
      "created_utc": 1729377403.0,
      "score": 1
    },
    {
      "id": "lsnm1yg",
      "body": "Ok",
      "created_utc": 1729324948.0,
      "score": -6
    },
    {
      "id": "lsptzr9",
      "body": "My mother \"caught me\" after i'd accidentally clicked on a \"pregnant woman stories\" ad on some fandom site when i was maybe 7? and she screamed at me so loudly the neighbours on both sides heard her screaming. I can remember her face turning red and how much physical violence happened that day and it's just. eugh. I don't understand why parents get so mad at things like that: kids are going to be curious and if anything it's their job to be teaching children what is and isn't okay to be searching up at that age",
      "created_utc": 1729360280.0,
      "score": 21
    },
    {
      "id": "lsouhkj",
      "body": "i was the exact same. i blame the youtubers i used to watch, i remember clearly when 2 girls 1 cup was trending and all the youtubers were reacting to it. curiosity got the best of me and when looking for it i went down a massive rabbit hole, i couldn’t stop returning to shock websites. this started around that age and lasted a while.",
      "created_utc": 1729348291.0,
      "score": 18
    },
    {
      "id": "lsp4yio",
      "body": "> This exactly! My dad made such a big deal about something in my search history when I was around that age. It had a profound effect on the direction my entire life took after that.\n\nSame. It really impacted me. He said and did so many things that changed my whole life and he will never understand.",
      "created_utc": 1729351925.0,
      "score": 13
    },
    {
      "id": "lsqii5v",
      "body": "When parents make kids feel bad about something they did, they don’t learn to stop doing that thing. What they learn is to not to share everything with their parents.",
      "created_utc": 1729368513.0,
      "score": 6
    },
    {
      "id": "lspedzx",
      "body": "This, seriously. I was a very depressed and socially anxious kid, and the only people I really trusted were my internet friends. My mom would sometimes ground me with no electronics, but she didn't understand how devastating it was to me because I had nobody to talk to in those moments.",
      "created_utc": 1729355152.0,
      "score": 16
    },
    {
      "id": "lx9ltuo",
      "body": "My cat is responsible for giving me a massage when she wants me to wake up and feed her, she knows the rule lol x",
      "created_utc": 1731680167.0,
      "score": 1
    },
    {
      "id": "lson7hf",
      "body": "Not yet but it's on my list to look into asap.",
      "created_utc": 1729345540.0,
      "score": 30
    },
    {
      "id": "lsrcyb8",
      "body": "Never will you be diagnosed with bipolar by a fully trained professional at that age. I reccomend you get re evaluated when you are older.",
      "created_utc": 1729379456.0,
      "score": 0
    },
    {
      "id": "lt8pr9d",
      "body": "Yes I’m aware they can call it suspected emerging personality disorder at that age. As they did for me, but they cannot give a fully diagnosis at that age",
      "created_utc": 1729633194.0,
      "score": 1
    },
    {
      "id": "lsno00g",
      "body": "I have/had the same issues with my mom. When my father left I followed her everywhere, even to the mailbox and to the bathroom where I would literally turn around while she went. If I looked around and couldn’t find her, I’d cry and scream for her. I was 8 when it started. You’re a good mom for supporting her 💕",
      "created_utc": 1729326319.0,
      "score": 3
    },
    {
      "id": "lsmx6oi",
      "body": "No. My dad still works and it would just be too much to ask my mom to oversee her education full time. They already bend over backwards to help us at times, I just couldn't put that on their plate even if they were willing.",
      "created_utc": 1729309823.0,
      "score": 3
    },
    {
      "id": "lsoa4fd",
      "body": "She has always had sensory issues when it comes to food. She currently has about 15 safe foods that she will eat, so diet is not great despite my attempts at nutrition. These are great questions that I will consider and explore with her. A lot of people have suggested an underlying medical issue and I'm definitely going to her to the doctor for more evaluation asap.",
      "created_utc": 1729339836.0,
      "score": 5
    },
    {
      "id": "lsptjtq",
      "body": "[deleted]",
      "created_utc": 1729360134.0,
      "score": 1
    },
    {
      "id": "lspt9ow",
      "body": "[deleted]",
      "created_utc": 1729360041.0,
      "score": 0
    },
    {
      "id": "lsnmcbk",
      "body": "You’re just completely dismissing and invalidating this child’s feelings! Please, if you have children, please don’t react like this \nIt’s often just as if not more damaging than the initial problem",
      "created_utc": 1729325150.0,
      "score": 8
    },
    {
      "id": "lu3qnc5",
      "body": "same, after i tried telling her that, she looked through all my personal conversations and it shattered my trust in her.",
      "created_utc": 1730076568.0,
      "score": 2
    },
    {
      "id": "lsonexv",
      "body": "I feel terrible for your daughter and you. Good luck to you two!",
      "created_utc": 1729345622.0,
      "score": 12
    },
    {
      "id": "lspoury",
      "body": "I’m very sorry to hear about your daughter! It’s devastating to read. I can’t imagine being 8 yo and feeling like I want to end my life. \n\n\nI feel this is your best option right now. Finding a psychiatrist. 💯🙌💜 You will prolly need a referral from your GP or the hospital. \n\nThey are usually equipped to handle these issues and they can find out WHERE these thoughts are coming from! Like others have mentioned it could very well be a Mental Health Issue or a Physical Health Problem.",
      "created_utc": 1729358591.0,
      "score": 9
    },
    {
      "id": "lsre24s",
      "body": "Are you a mental Health professional? Every mental health professional I’ve asked has said it’s not common for people that young to be diagnosed with bipolar but it does happen",
      "created_utc": 1729379863.0,
      "score": 1
    },
    {
      "id": "lt8oouy",
      "body": "Things have changed. That’s how it was before. Maybe research this stuff.",
      "created_utc": 1729632846.0,
      "score": 0
    },
    {
      "id": "lt8qqre",
      "body": "Ok so why argue about it if she can still get a mental health evaluation and medication to help.",
      "created_utc": 1729633511.0,
      "score": 0
    },
    {
      "id": "lsoz5ep",
      "body": "This could be due to an ocd or being autistic?",
      "created_utc": 1729349919.0,
      "score": 3
    },
    {
      "id": "lsoqjk7",
      "body": "Ok, that’s something. See a licensed dietitian.",
      "created_utc": 1729346835.0,
      "score": 2
    },
    {
      "id": "lspti53",
      "body": "[removed]",
      "created_utc": 1729360117.0,
      "score": 0
    },
    {
      "id": "lsnmdmm",
      "body": "Ok. i agree",
      "created_utc": 1729325176.0,
      "score": -1
    },
    {
      "id": "lu401a4",
      "body": "That's utterly mortifying, I'm so sorry",
      "created_utc": 1730080020.0,
      "score": 1
    },
    {
      "id": "lsrr8ix",
      "body": "You can have it at that age, I’m not debating that. But you do not get diagnosed at that age. Any mental health professionals who are practicing properly will not diagnose it until you are at least near the age of 18, most won’t even consider it until your 18 though. I’ve received my bpd diagnosis at age 17 1/2. I’ve had symptoms and signs for years but they would not diagnose it until I was older. That’s just how it is. It’s the same for bipolar.",
      "created_utc": 1729384871.0,
      "score": 0
    },
    {
      "id": "lt8oych",
      "body": "Mate, I think you need to research respectfully.",
      "created_utc": 1729632932.0,
      "score": 0
    },
    {
      "id": "lta1ldt",
      "body": "Think you need to reread",
      "created_utc": 1729649898.0,
      "score": 1
    },
    {
      "id": "lsnmga8",
      "body": "🙏 💞",
      "created_utc": 1729325228.0,
      "score": 3
    },
    {
      "id": "lsrrmjx",
      "body": "Well clearly not bc in my medical records it says bipolar 2 disorder",
      "created_utc": 1729385020.0,
      "score": 1
    },
    {
      "id": "ltn8q4s",
      "body": "No, I’m referring to the original comment.",
      "created_utc": 1729838582.0,
      "score": 1
    },
    {
      "id": "lsrrtr4",
      "body": "That’s literally why I’m saying go get re evaluated. Because any mh professional who is properly practicing would never diagnose before puberty. Ever.",
      "created_utc": 1729385098.0,
      "score": 1
    },
    {
      "id": "lsrs7cq",
      "body": "It was after puberty started and the psychiatrist in the psychiatric hospital was the one who diagnosed me",
      "created_utc": 1729385246.0,
      "score": 1
    },
    {
      "id": "lsrserd",
      "body": "Puberty doesn’t usually start at that age, but if it does it’s the very very start of it. They don’t diagnose it before then. All I’m saying is go get re evaluated because it may not be the correct diagnosis for you. It very well could be but you should not have been diagnosed at age 8",
      "created_utc": 1729385324.0,
      "score": 1
    }
  ]
}