{
  "id": "1hlopbc",
  "title": "Fuck everything. Fuck Christmas. Fuck everyone. ",
  "selftext": "Cheers to the worst one of my life.  \nI can’t figure out a mess free, quick and easy way out so here I am sobbing while I wish that I could slip my face under the water of my bath and never resurface or wishing I had the courage to take a knife to my wrists. But instead I’m a fucking pussy.    \nStop telling me to be strong. Stop commending my resilience. Stop telling me I can’t give up. Stop telling me I have to keep pushing forward.   \nI am fucking tired. I want to find peace, tranquility.  \nI can’t take this hellscape called life much longer.  \nI try and I try and I try but I still get pushed down, demonized, shit on, never enough. Never good enough. Never smart enough. Never pretty enough. Never trying hard enough.     \nI know I’m not the best person but I try fuck I FUCKING TRY SO HARD TO BE GOOD. AND IT MEANS NOTHING.   \nMaybe it’s for the better I have nobody anymore.   \nMaybe soon I’ll get the balls and not give a fuck how I go out as long as I go out.    \nI understand why my mom and her sister both killed themselves now. I really, really do.  ",
  "created_utc": 1735081537.0,
  "score": 505,
  "num_comments": 45,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1hlopbc/fuck_everything_fuck_christmas_fuck_everyone/",
  "comments": [
    {
      "id": "m3nyrt0",
      "body": "I'm not smart or pretty or good enough, either. I won't say it will get better, but I'm in a hole, too. I don't know if either of us will get out. I just know it's painful as fuck. I wish you luck in life.",
      "created_utc": 1735083053.0,
      "score": 103
    },
    {
      "id": "m3pa2tz",
      "body": "No helpful advice here sorry just saying I really felt this one",
      "created_utc": 1735106433.0,
      "score": 42
    },
    {
      "id": "m3plp3r",
      "body": "Relatable… I try to be kind to everyone but shitty thing after shitty thing keeps happening witch way too much loneliness. Not pretty enough, not smart enough, too many wrong turns, too much financial burden… past several months have turned to pull popping to keep me content with how shitty everything was going but I’m running out of pills with no real way of getting more. I’m okay with it because I can tell I’m building a tolerance to them too. Wish I had something to motivate me but I’m too far in a hole",
      "created_utc": 1735114223.0,
      "score": 21
    },
    {
      "id": "m3phkel",
      "body": "[removed]",
      "created_utc": 1735111302.0,
      "score": 18
    },
    {
      "id": "m3pfpor",
      "body": "Yeah I relate",
      "created_utc": 1735110037.0,
      "score": 11
    },
    {
      "id": "m3qrs2t",
      "body": "relatable, fuck every single person and everyone. the world needs to end.",
      "created_utc": 1735140338.0,
      "score": 8
    },
    {
      "id": "m3o9206",
      "body": "Make a trip... To somewhere.\nIf you have the chance.\nIf you need to save money, then save money.\nIf you need to plan, then plan.\nIf you have nothing, go with the not so many things that you have. It's not easy but it's a project that can save your life.\n\nYou don't \"have to be strong\"\nYou're already strong... You still here.\nSo, based in that you're technically not a pussy.\n\nHope to be useful.\nI love you, stranger.\nHope to see your traveling vlogs someday :D💖✨",
      "created_utc": 1735087633.0,
      "score": 16
    },
    {
      "id": "m3ry4ve",
      "body": "Fuck suicide.",
      "created_utc": 1735156559.0,
      "score": 5
    },
    {
      "id": "m3sbkno",
      "body": "Same. I hate this stupid day.",
      "created_utc": 1735161686.0,
      "score": 5
    },
    {
      "id": "m3phz6f",
      "body": "You have no idea who I am, I have no idea who you are. But merry Christmas, you aren’t alone 😉",
      "created_utc": 1735111591.0,
      "score": 9
    },
    {
      "id": "m3qnfiv",
      "body": "I feel this. It’s beyond horrible someone else feels this way, but it’s also comforting in a strange way not to be totally alone. I’m not alone in the sense other people feel similarly to me. I’m sorry life is so shitty and unfair and cruel. It really is a hellscape. Everyone saying “don’t do this” “don’t do that” and “look at it this way” “just do this” are just skipping right past and over the core problems. People don’t even want to look at hard truths, let alone confront them and do something about it. People want you to stfu and smile for their own comfort.",
      "created_utc": 1735138447.0,
      "score": 3
    },
    {
      "id": "m3qnh4a",
      "body": "Yupp everything is fucked, it's unfair, life tastes like shit. I wish someone would just blow my brains out, since I am too pussy to do it myself. Can't wait untill this shit is over. Fuck this",
      "created_utc": 1735138467.0,
      "score": 3
    },
    {
      "id": "m3o9f2f",
      "body": "The ones who post about their suicide and how it’s faild . They still have something strong inside them that really wants to keep fighting . U didn’t reach the lowest point in life \nCuz only the dead ones did \n\nBeat this shitty life and try to live for what makes u happy \nSometimes small things means alot and make us happy",
      "created_utc": 1735087796.0,
      "score": 14
    },
    {
      "id": "m3uih21",
      "body": "I'm sorry you feel that way",
      "created_utc": 1735198817.0,
      "score": 3
    },
    {
      "id": "m3opfji",
      "body": "Are you still here?",
      "created_utc": 1735095460.0,
      "score": 4
    },
    {
      "id": "m3wvcsh",
      "body": "I choose to believe in Christ. There may be a lot of misconception and tired archetypes (and trust me, there's a LOT), but it's comforting knowing there's someone out there, even Jesus, that still forgives me. I also have constant thoughts about suicide just about every waking moment, but it's just nice to have someone who can give me hope, and make me realise whatever little mercy there is in my life. Whatever got you thinking this stuff, it isn't the work of a cruel God, or even bad luck. It's the work of mankind, but if you think about the times people have forgiven you and believed in you, it really says something. If anyone else believes this, please share.",
      "created_utc": 1735239092.0,
      "score": 2
    },
    {
      "id": "m47d12f",
      "body": "I feel the same, I just tried to slit myself and got queezy from the sight of fat in my arm. Why can’t I just do this one thing then …an eternity of no pain ",
      "created_utc": 1735400367.0,
      "score": 2
    },
    {
      "id": "m4djwlf",
      "body": "I think this might be my last Christmas as well, the crazy part is I feel ok with it. After all I’ve been through, I feel calm and ready for the reason and path towards it ending. Like a numb waiting, I haven’t told anyone, it’s been months in the making. I’ve tried before and been terrified but now, I’m calm and ok.",
      "created_utc": 1735491127.0,
      "score": 1
    },
    {
      "id": "m4g9g34",
      "body": "Did you reach into my head and dredge up my inner darkness? 'Cause I totally coulda wrote this!",
      "created_utc": 1735522014.0,
      "score": 1
    },
    {
      "id": "m4inbzt",
      "body": "I really hate this world, nobody likes me, even my family. I don’t know what to do.I’ve tried to do something that makes me happy, but every time there were someone trying to stop my happy time. I just want to be happy, why could it be so difficult?",
      "created_utc": 1735564282.0,
      "score": 1
    },
    {
      "id": "m7c7y9x",
      "body": "I spent last christmas in psychiatric ward at 14.  I feel this",
      "created_utc": 1736975388.0,
      "score": 1
    },
    {
      "id": "m3p1y42",
      "body": "[removed]",
      "created_utc": 1735101855.0,
      "score": -1
    },
    {
      "id": "m3o0vhu",
      "body": "Luck to you too. I’m sorry you know what I’m feeling.",
      "created_utc": 1735083973.0,
      "score": 55
    },
    {
      "id": "m3pissq",
      "body": "Also know what you’re feeling it totally sucks",
      "created_utc": 1735112167.0,
      "score": 16
    },
    {
      "id": "m4hkwsu",
      "body": "Me too, I just hate this world and want to escape.",
      "created_utc": 1735541295.0,
      "score": 1
    },
    {
      "id": "m4cteyj",
      "body": "me too",
      "created_utc": 1735481790.0,
      "score": 1
    },
    {
      "id": "m3qm3pk",
      "body": "Deftonesss",
      "created_utc": 1735137840.0,
      "score": 3
    },
    {
      "id": "m3of07p",
      "body": "Wish I could go on a trip. I need one. Something. anything. Where I’m at now, the hand I’m dealt now in life, so much about it is why I’m feeling this way but the reality is I can run but I cannot hide or escape this darkness.",
      "created_utc": 1735090397.0,
      "score": 15
    },
    {
      "id": "m3oevx1",
      "body": "Just feels like all my failed attempts mean I should’ve tried harder. Every time I think I’m on the upswing and life’s gonna get better I get knocked back 10x worse. I’m tired of relentlessly trying so damn hard for nothing. My soul is tired",
      "created_utc": 1735090340.0,
      "score": 12
    },
    {
      "id": "m4ini3z",
      "body": "I fuck this world, I think I am in a black hole that don’t have an exit door.",
      "created_utc": 1735564359.0,
      "score": 1
    },
    {
      "id": "m3qaeh3",
      "body": "[removed]",
      "created_utc": 1735131839.0,
      "score": 1
    },
    {
      "id": "m3qah00",
      "body": "i’m sorry i contradicted myself. You do not want to die anyway. you just want to pain to stop. I understand",
      "created_utc": 1735131879.0,
      "score": 2
    }
  ]
}