{
  "id": "1jnqq1z",
  "title": "I’m choosing death over a 9-5.",
  "selftext": "Nothing in this entire world can distract me from the fact that humans are born to work. Living under this capitalist hell regime is a never ending nightmare. I’m at the point where im going to choose death over working. I hate money. I hate work. I HATE FUCKING JOBS!! KILL ME FUCKING NOW! I’d rather die now than be a miserable wage slave for 70 years.",
  "created_utc": 1743380421.0,
  "score": 1248,
  "num_comments": 227,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1jnqq1z/im_choosing_death_over_a_95/",
  "comments": [
    {
      "id": "mkm715j",
      "body": "I think about this all the time",
      "created_utc": 1743384639.0,
      "score": 430
    },
    {
      "id": "mkmw2hq",
      "body": "[removed]",
      "created_utc": 1743395193.0,
      "score": 163
    },
    {
      "id": "mkn6h9s",
      "body": "I get it. I'm autistic and I feel like I was given life on hard mode. I honestly don't even want to die in an emotional sense, it's just pure logic. Why am i still doing this when i am mentally incapable to achieve my ambitions? its like, i didnt sign up for this? i didnt sign up for a social disability thats so fucking debilitating and theres no room for us under capitalism. I'm stuck between going through with my plan and keeping going because I don't want to hurt my loved ones, but at some point it feels like I need to evaluate if I can keep prolonging this",
      "created_utc": 1743400809.0,
      "score": 92
    },
    {
      "id": "mkm9c5h",
      "body": "Same. I get up for work in 3 hours and can’t sleep I just want to quit so bad.",
      "created_utc": 1743385522.0,
      "score": 87
    },
    {
      "id": "mklyw3c",
      "body": "Capitalism wants us to think that living from paycheck to paycheck is normal",
      "created_utc": 1743381544.0,
      "score": 172
    },
    {
      "id": "mknvx7j",
      "body": "[deleted]",
      "created_utc": 1743417021.0,
      "score": 43
    },
    {
      "id": "mkojvg4",
      "body": "This is why I don’t want to live. Everything seems fucking pointless. And AI on the rise making me feel unconfident in my career path. Like fucking hell. I feel like everything is going to shit.",
      "created_utc": 1743427587.0,
      "score": 45
    },
    {
      "id": "mknp3dz",
      "body": "We're born just to suffer.",
      "created_utc": 1743412861.0,
      "score": 40
    },
    {
      "id": "mkoswha",
      "body": "I can't believe parents knew about it all and still decided to have kids in such a rotten world.",
      "created_utc": 1743430602.0,
      "score": 45
    },
    {
      "id": "mkmunmq",
      "body": "You should look into joining a commune. Everyone just helps each other and live in peace. It sounds like you might be happier trying that life out.",
      "created_utc": 1743394500.0,
      "score": 40
    },
    {
      "id": "mkocuw2",
      "body": "In the past, you could've walked to an uninhabited area and started building a home from scratch. You could've built a home, grown your own food, and tried to survive like people did hundreds of years ago.\n\nYou can't do that in the modern world because governments and rich people own most of the uninhabited land, at least in the US.",
      "created_utc": 1743424967.0,
      "score": 33
    },
    {
      "id": "mknllzi",
      "body": "I feel the same as you. It feels like everyone around me is crazy and just thinks that I'm a lazy person. They think that being a slave is just a normal part of our life. I'm so tired of capitalism...",
      "created_utc": 1743410548.0,
      "score": 23
    },
    {
      "id": "mknvk2x",
      "body": "Agreed, it's all such bullshit. A miserable existence that people think is \"normal\"",
      "created_utc": 1743416810.0,
      "score": 20
    },
    {
      "id": "mkonezh",
      "body": "i feel this so hard\ni’m not meant for this life\nwhat’s the fucking point???\nit’s literally so depressing and i can’t even imagine a bright future. everything and i mean EVERYTHING is going bad rn people in power don’t give a single fuck about us\nmost people have to work two jobs to try to buy groceries and rent\n\ni wanna get out of this too",
      "created_utc": 1743428822.0,
      "score": 20
    },
    {
      "id": "mkmmecm",
      "body": "I choose to continue living to be a net negative to the system.",
      "created_utc": 1743390741.0,
      "score": 19
    },
    {
      "id": "mkovmu3",
      "body": "bro I don't want to sound corny but we in China  do 6-23 like in those mean ass factories no cap.my dream is a 9-5.",
      "created_utc": 1743431460.0,
      "score": 16
    },
    {
      "id": "mknn796",
      "body": "Here in latam we usually work from 7 to 6 its crazy that we lose our life working",
      "created_utc": 1743411601.0,
      "score": 13
    },
    {
      "id": "mkop58x",
      "body": "Came to this sub to basically post this same thing. At least I'm not alone in this mindset",
      "created_utc": 1743429390.0,
      "score": 13
    },
    {
      "id": "mkprlc4",
      "body": "So me, whenever the thought about how stupid this world is, suicidal thoughts calm me down, I will just tell myself that when I’m exhausted, I can just kill myself, no need to stress things out for now",
      "created_utc": 1743441100.0,
      "score": 13
    },
    {
      "id": "mkpvdcv",
      "body": "There's a coined term for this- Fatalistic suicide. Its when someone would rather die than live in an overly regulated society.",
      "created_utc": 1743442203.0,
      "score": 12
    },
    {
      "id": "mkqljd0",
      "body": "I can't believe there are people who think this alone isn't enough to be suicidal, that you have to just \"suck it up\" or be a lazy piece of shit.  \"Oh, but I work 70 hours.\"  That sucks too, and I feel bad for anyone who does that.",
      "created_utc": 1743449997.0,
      "score": 13
    },
    {
      "id": "mks4mtl",
      "body": "Especially when it comes to being homeless without anyone to turn to. I really don’t think life is worth living at all.",
      "created_utc": 1743468046.0,
      "score": 11
    },
    {
      "id": "mkn7t2k",
      "body": "The only way I cope is telling myself it's either this or s*icide. Either keep living and deal with it, or just die, but also I do have a friend I care about and a mom I don't want to leave alone with grief, so I push on for them as well.",
      "created_utc": 1743401594.0,
      "score": 24
    },
    {
      "id": "mkr35lz",
      "body": "I think about it every single hour of my life. I would rather just die. Pointless life. I hate it.",
      "created_utc": 1743455239.0,
      "score": 11
    },
    {
      "id": "mkn86sp",
      "body": "9-5 is heaven for me.. \nLast time I worked a hell job about 7 to 21..\nBut iam also tired of these slavery jobs..",
      "created_utc": 1743401821.0,
      "score": 9
    },
    {
      "id": "mkmzh2r",
      "body": "I find this sentiment so interesting relative to the place I'm at right now. I used to feel this way until I came to accept my cowardice but then the funniest thing happened, I lost my 9-5 and now I'm having to actively choose life in case another 9-5 is just around the corner to save my life.",
      "created_utc": 1743396930.0,
      "score": 8
    },
    {
      "id": "mknojtm",
      "body": "Some people have to work longer hours for nothing and can't anything this is happening in America alot and here to in Australia,  but least here it's illegal to work over 38 hrs and not be paid the minimum wage, in America it's different",
      "created_utc": 1743412503.0,
      "score": 7
    },
    {
      "id": "mkmgkd0",
      "body": "Yep, being homeless and then starving to death doesnt sound too bad right now.. (joke.. maybe not a joke)",
      "created_utc": 1743388323.0,
      "score": 21
    },
    {
      "id": "mkmzche",
      "body": "[removed]",
      "created_utc": 1743396865.0,
      "score": 6
    },
    {
      "id": "mkq6cd1",
      "body": "I’m thinking about just joining the military for a simpler existence and the chance at death, it sounds like the best option",
      "created_utc": 1743445435.0,
      "score": 6
    },
    {
      "id": "mkrjafk",
      "body": "Working a 9-5 is the equivalent of modern slavery, it removes autonomy from workers in a society that does not value individuality. I think I made up my mind that as soon as I turn 18, I'll end myself as quickly as I can to avoid this perpetual monotony. It's comforting to see other people agree with me on this too.",
      "created_utc": 1743460527.0,
      "score": 6
    },
    {
      "id": "mkp7emr",
      "body": "People are supposed to \"work\". But they should work on a thing they like and enjoy which 99% jobs are not like that. Second thing is that we work way too many hours. But without absolutely nothing to do you would be miserable.",
      "created_utc": 1743435037.0,
      "score": 11
    },
    {
      "id": "mkn0h3p",
      "body": "I completely understand this sentiment... luckily I found a job with 3 12 hour shifts! They do exist! It is soooo much better! I was right there with you for awhile.",
      "created_utc": 1743397453.0,
      "score": 5
    },
    {
      "id": "mko4ovk",
      "body": "I too feel the same",
      "created_utc": 1743421508.0,
      "score": 6
    },
    {
      "id": "mktb2do",
      "body": "As bad as it is . Bangladesh is frightening. The textile industry these poor people have to slave for is nothing short of a nightmare. For them the environment. All for fashion . These people are abused in all areas of their lives . There is no way out for them at all. Little kids working in warehouses they breath in toxic dyes , get doused in toxic dyes . The environment around them is polluted with toxic dyes  \nYet the fashion industry lives on. And think they are beautiful and idolised. \n\nIts fukn gross",
      "created_utc": 1743486234.0,
      "score": 6
    },
    {
      "id": "mknrwyb",
      "body": "I'm going to stay alive out of pure spite for the capitalist system. They want my life so fucking much but they won't have it, and I'll be there to witness their downfall",
      "created_utc": 1743414657.0,
      "score": 11
    },
    {
      "id": "ml4h4qw",
      "body": "Same. \"Suicide is a mental disorder\" they say. Pretty sure the fucked society we are forced into is the issue. Not us. \n\"Leave the job you hate\". So i can be homeless and hungry? Okay. Lol. \nCatch 22.",
      "created_utc": 1743641756.0,
      "score": 4
    },
    {
      "id": "mko2nfb",
      "body": "I don't think you're wrong, BUT... I honestly would prefer to work 9-5 instead of my country regular 8-6.",
      "created_utc": 1743420539.0,
      "score": 3
    },
    {
      "id": "mkpnnem",
      "body": "Here I am dying becoz I can't get the 9-5 job.\nReally makes me think how different people in different situations at different stages think.",
      "created_utc": 1743439920.0,
      "score": 3
    },
    {
      "id": "mkq03z9",
      "body": "Another choice is to acquire some free land move there and try to survive on it. I'm sure your work hours will increase way above 9-5.\nJust a comparative thought.🤣",
      "created_utc": 1743443588.0,
      "score": 3
    },
    {
      "id": "mkqh10v",
      "body": "Why can’t you just find someone who can take care of your bills so that you don’t have to work? I know, easier said than done but look at what you are saying.",
      "created_utc": 1743448636.0,
      "score": 3
    },
    {
      "id": "mkrklnv",
      "body": "It’s like you took the words out of my mouth!!",
      "created_utc": 1743460985.0,
      "score": 3
    },
    {
      "id": "mkse0tv",
      "body": "[deleted]",
      "created_utc": 1743471539.0,
      "score": 3
    },
    {
      "id": "mku8h4c",
      "body": "The idea of being on earth to hustle til ~70, is sickening. Like that’s so much stress to be where you didn’t even ask to be. I often tell my mom, I wish I wasn’t the egg that got fertilized. Just cuz earth as I’ve always said, is exhausting.",
      "created_utc": 1743507246.0,
      "score": 3
    },
    {
      "id": "mkuaffc",
      "body": "Well when you are out of work for long enough that 9-5 you hate is a dream for some. Here even simplest entry level job of filling shelves at grocery store gets 1000 applicants per 5 hired people.",
      "created_utc": 1743508144.0,
      "score": 3
    },
    {
      "id": "mknlfcn",
      "body": "r/vagabond",
      "created_utc": 1743410427.0,
      "score": 5
    },
    {
      "id": "mkn06lr",
      "body": "Work hard now so you don’t have to in the future. My buddy has no high school diploma, got into sales, started with auto sales and is now selling windows. He makes $100k-$200k per year working 30 hours a week. Never stop looking around, try different fields. My passion is cars and motorcycles. I have no high school education but I’ve started an apprenticeship for auto body. It doesn’t feel like a job at all. You aren’t on the right career path if it feels like it’s sucking the life out of you.",
      "created_utc": 1743397301.0,
      "score": 7
    },
    {
      "id": "mkpjns5",
      "body": "[removed]",
      "created_utc": 1743438709.0,
      "score": 2
    },
    {
      "id": "mkrlr1h",
      "body": "I'm not a huge fan of working either and it really scares me. However I believe that work can be meaningful too. Have you thought about a career path that could make sense to you? I think nowadays there are plenty of ways to work differently than 9-5. Some jobs may even be pretty fun",
      "created_utc": 1743461372.0,
      "score": 2
    },
    {
      "id": "mkrxixn",
      "body": "Just wanna give a digital hug to all the people. This is my #1 reason. \n\nI got a designer degree, which got me nowhere, even with a portfolio. Nobody hired me anywhere, and if they did they bullied me and violated labor rights. So I self employed as a private elementary tutor (English). The demand is actually insane (I can even go full time, merely because of demand), and it gets me decent money. But the demand is here because of a collapse of education system. And a growing literacy crisis as a result. Parents are panicking and bringing in 3rd graders that can't read or write, and they perform at pre-school level. Because the modern school program has no structure and doesn't account for child's psychology/thinking process. Plus parental neglect, but it is a problem of capitalism as well. \n\nThe imposter syndrome is unreal. It really makes me sick that it took profiting off a disaster, a literal collapse. Just to get my way in life and have food on the table. I despise capitalism...",
      "created_utc": 1743465439.0,
      "score": 2
    },
    {
      "id": "mkrznkc",
      "body": "I may have something for you to look at as a sincere possible idea for you [https://en.wikipedia.org/wiki/List\\_of\\_American\\_utopian\\_communities](https://en.wikipedia.org/wiki/List_of_American_utopian_communities)",
      "created_utc": 1743466210.0,
      "score": 2
    },
    {
      "id": "mks23fx",
      "body": "type it out, vent it out.",
      "created_utc": 1743467107.0,
      "score": 2
    },
    {
      "id": "mksbmpa",
      "body": "i feel the same way",
      "created_utc": 1743470633.0,
      "score": 2
    },
    {
      "id": "mksipap",
      "body": "I think each and every one of us can recognize major flaws in how our society or at least parts of it are ran. Be the change you want to see",
      "created_utc": 1743473277.0,
      "score": 2
    },
    {
      "id": "mkslf9r",
      "body": "Be a homeless vagabond travel around a bit find work here and there?",
      "created_utc": 1743474306.0,
      "score": 2
    },
    {
      "id": "mksngku",
      "body": "[deleted]",
      "created_utc": 1743475094.0,
      "score": 2
    },
    {
      "id": "mkt93jb",
      "body": "Same \n\nWe don’t love work we work to survive",
      "created_utc": 1743485105.0,
      "score": 2
    },
    {
      "id": "mktejc1",
      "body": "I agree with you. I'm currently not working due health issues, but I can say as the years go by a new torture sets in. Unless you have purpose or something, unhappiness will follow whenever you go it seems.",
      "created_utc": 1743488336.0,
      "score": 2
    },
    {
      "id": "ml4eoy9",
      "body": "I can relate OP I have those thoughts a lot.\nThe more the USA gets screwed up by Trump the more I think about these things.\n\nCapitalism is awful, we could have such a better system but we get the world GREED has given us.\n\nI don’t know what the future holds but I’m ready to die every single day",
      "created_utc": 1743640904.0,
      "score": 2
    },
    {
      "id": "mkmjdcy",
      "body": "This is why I’m a housewife",
      "created_utc": 1743389458.0,
      "score": 6
    },
    {
      "id": "mksyl4u",
      "body": "If reincarnation is real I hope I become born as a jellyfish. I cannot do capitalism again",
      "created_utc": 1743479781.0,
      "score": 3
    },
    {
      "id": "mkny8wv",
      "body": "Capitalism can be horrible yeah, but at least is not communism. I feel like a failure, I'm twenty one and I never had a job so I really don't know what I'm even doing tbh",
      "created_utc": 1743418293.0,
      "score": 4
    },
    {
      "id": "mkuzqpw",
      "body": "same. It's the only thing which really really makes me depressed. The fact this world is forcing us to slave away. We are only slaves and they want us to be grateful for becoming a slave. F\\*\\*\\* OFF!!!",
      "created_utc": 1743517672.0,
      "score": 1
    },
    {
      "id": "mkv41h7",
      "body": "I think the same. But I would take out a loan from the bank and travel as much as possible before I killed myself.",
      "created_utc": 1743519035.0,
      "score": 1
    },
    {
      "id": "mky0cyo",
      "body": "Take some politicians with you ",
      "created_utc": 1743552189.0,
      "score": 1
    },
    {
      "id": "ml0kf2p",
      "body": "I actually agree with you.  I had a successful corporate career.  Climbed the ladder to the top, earned heaps, had investment properties and then I felt “trapped” in a situation with a narcissistic firm and it’s almost killed me.  In fact, I tried to suicide 3 times (seriously, I can’t die!), and was saved all times.  Long story short, I got out… I wound up my firm, liquidated all my assets and retired at 45yo.  I’m now a lecturer at uni.  It’s fun and it’s casual.  I still get really depressed sometimes and do dumb things but over all I don’t feel suicidal anymore because most of the pressure has gone.  That said, I have other complexities in my personality due to upbringing and family relationships etc, sexual assault I suffered.  My life has been rough at times, esp when young.  \n\nI’m not sure what my triggers are but I feel like I’m never far away from trying suicide again.\n\nThe world is crap and yeah you have to earn money to survive.  I’ve learned to live on less to try to be happier and it’s working for the most part.  Occasionally I find myself falling into materialistic crap (I’ve been researching 60ft pleasure cruisers) but realised that I’m craving that buzz again so am trying to work out how to replicate the buzz without spending money and feeling yuck about it after",
      "created_utc": 1743598239.0,
      "score": 1
    },
    {
      "id": "ml0tl9r",
      "body": "I’m at this point. I so tired in every way possible. I don’t want to do this anymore.",
      "created_utc": 1743601697.0,
      "score": 1
    },
    {
      "id": "ml1gwr8",
      "body": "I think about this all the time too. The time I'm losing to breed money for other people while comparatively, I get a grain of rice in return.\n\nI don't have anything to offer you except condolence.",
      "created_utc": 1743608865.0,
      "score": 1
    },
    {
      "id": "ml53d27",
      "body": "I hate money management or any clerical, paperwork.  That is why I work at a warehouse.  I am autistic, have problems with executive function, failed math, can't prioritize, and feel like I would rather die than tackle a difficult task.",
      "created_utc": 1743649965.0,
      "score": 1
    },
    {
      "id": "ml8owyl",
      "body": "It’s not the economic system we live under that is the problem for working, it is literally fundamental to being a living organism. Every country in the world works nearly every day and always has. You’re lucky you live in the west where work is so much less than most of the world.",
      "created_utc": 1743704019.0,
      "score": 1
    },
    {
      "id": "mlgnr3r",
      "body": "I’m starting to get to the stage where I’m tired of all these thoughts and one day I’m just going to go. No big clean out like I said I would, no letter, no goodbyes, just finally silence.",
      "created_utc": 1743810925.0,
      "score": 1
    },
    {
      "id": "mlgvpjm",
      "body": "you dont like anything that money can buy?",
      "created_utc": 1743813967.0,
      "score": 1
    },
    {
      "id": "mlhedrz",
      "body": "There is a big community in the anti-work movement. I think more people are opening their eyes to capitalistic practices and worker exploitation. I know it is a slow process, but I truly believe at least in western countries, which I won’t assume you are from, people are starting to call for work-life balance. There is so much opportunity to transform your feelings into something you would be passionate about working for. To achieve freedom from work exploitation it requires more voices and support, not less.",
      "created_utc": 1743821465.0,
      "score": 1
    },
    {
      "id": "mlqeipz",
      "body": "Rat Race. That’s what we are. \nJust locked up rats in the same cages, trying to get trough life while most of us just get caught up in the race.",
      "created_utc": 1743961974.0,
      "score": 1
    },
    {
      "id": "mno2ez5",
      "body": "The biggest thing that has made me feel so lost and worthless is the centering of labor in our lives. What do you what to be? I never knew I still don't know and it fills me with so much anxiety and stress that i lost hair that has never come back. I feel like I can barely live within the pockets of time I'm not being retraumatized but I'm supposed to have figured everything out.\n\nI feel so utterly worthless and stupid I can't even begin to express it. I made good grades and graduated and I feel so lost and stupid. What did I do in that time? It doesn't feel like enough. I feel like I have no excelling skills. Everything is just basic and mediocre. I don't want to have to compete and step on other people to make myself seem better in front of employers etc.\n\nwe need money to survive but I wish we didn't. I wish I could just be left alone. I don't dream of labor.",
      "created_utc": 1744930212.0,
      "score": 1
    },
    {
      "id": "moucbhb",
      "body": "Hey guys, I made a FREE community on how to escape 9-5, if you're struggling and can't afford a course, just drop in and I'll give you all you need for free, no strings attached.\n\nHere's the link:\n\n[https://www.skool.com/freepreneurs/about?ref=7e4f1e24fada43cda81bd6113dd5eaa4](https://www.skool.com/freepreneurs/about?ref=7e4f1e24fada43cda81bd6113dd5eaa4)",
      "created_utc": 1745522676.0,
      "score": 1
    },
    {
      "id": "mkof9lw",
      "body": "You were born as the only animal who has a civilization. Maybe even in the entire galaxy. Every other insect and animal has to fight every second of everyday to survive. Humans are born to work and so is every other living organism.",
      "created_utc": 1743425896.0,
      "score": 1
    },
    {
      "id": "mks8v3r",
      "body": "Humans are slaves to work but working for humans as a human can sometimes not be so bad …? As in working for yourself",
      "created_utc": 1743469601.0,
      "score": 1
    },
    {
      "id": "mkm5tr1",
      "body": "Interesting stance. But that can't be the Sole reason can it? 9-5 is modern slavework correct. But it is more than possible to break out of that. Buying a cheap house with some land is accesible. My Dream for example is a lucious garden with many animals.\nOf course there is work to do, but if you cut Costs and life modest for some time you are able to achieve a big Chuck of freedom. And all that without  working yourself to death. You can't imagine how many ppl can relate to you, instead  of taking your life you should take Opportunities to feel more free.\n\nSincerely a guy who can't sleep",
      "created_utc": 1743384176.0,
      "score": -5
    },
    {
      "id": "mkqjjhs",
      "body": "Find a purpose in life",
      "created_utc": 1743449391.0,
      "score": 0
    },
    {
      "id": "mkpokaq",
      "body": "I agree, but blaming capitalism is pretty dumb, we would have to work either way",
      "created_utc": 1743440196.0,
      "score": -2
    },
    {
      "id": "mkmm78w",
      "body": "is there anything you actually enjoy doing?  is there any way for you to try and enjoy time outside of your job?  i understand how exhausting it is every single day, especially when ti seems as though there's no end to it... \n\nif there's anything you enjoy doing, maybe try and focusing on the positive as much as you can for the time being as a distraction?  after all, there's a possibility things may still change for the better, maybe you'll finally have an escape to the possibility of a better life",
      "created_utc": 1743390654.0,
      "score": -1
    },
    {
      "id": "mkm72mc",
      "body": "Same. My time is almost here.",
      "created_utc": 1743384655.0,
      "score": 144
    },
    {
      "id": "mkn0p5t",
      "body": "So do I",
      "created_utc": 1743397571.0,
      "score": 13
    },
    {
      "id": "mkmwb70",
      "body": "I have no idea!!! & then to go on & subject someone else to these horrors? Unforgivable.",
      "created_utc": 1743395314.0,
      "score": 40
    },
    {
      "id": "mkn6o7k",
      "body": "I feel the same way. I also have autism & it’s like social suicide. I only have 1 friend who I love more than anything in the entire world. But I can’t live for him when all I want to do is die. I don’t have to stay here & suffer anymore. I just want peace.",
      "created_utc": 1743400920.0,
      "score": 35
    },
    {
      "id": "mkr5khi",
      "body": "I was talking about this Literally today I'm autistic 25 and just have no idea how to spend the next 50 years i don't wanna Do this",
      "created_utc": 1743455995.0,
      "score": 7
    },
    {
      "id": "ml5424i",
      "body": "Same here",
      "created_utc": 1743650249.0,
      "score": 1
    },
    {
      "id": "mklz7ku",
      "body": "It’s definitely not. I’m so glad im leaving soon. I’ll be damned if they try to exploit me for my fucking resources.",
      "created_utc": 1743381666.0,
      "score": 62
    },
    {
      "id": "mkm1tv3",
      "body": "I can assure you, no one thinks this is normal. It's just circumstances some people find themselves in.",
      "created_utc": 1743382653.0,
      "score": 30
    },
    {
      "id": "mlgvtbz",
      "body": "[deleted]",
      "created_utc": 1743814008.0,
      "score": 1
    },
    {
      "id": "mkok6og",
      "body": "I feel the same way. I hope my method doesn’t hurt too bad",
      "created_utc": 1743427697.0,
      "score": 15
    },
    {
      "id": "mlt42tp",
      "body": "I’m an editor and writer—literature is one of very few things that I truly love—and the whole AI issue is extremely triggering. I’m…disgusted…with the direction in which humanity appears to be moving. I often feel like I just don’t belong on this planet.",
      "created_utc": 1743996764.0,
      "score": 2
    },
    {
      "id": "mks20a1",
      "body": "\"no justice, just us\"",
      "created_utc": 1743467075.0,
      "score": 10
    },
    {
      "id": "mlamajd",
      "body": "So stop having more children.",
      "created_utc": 1743726237.0,
      "score": 1
    },
    {
      "id": "ml06f07",
      "body": "I feel I was lied to by every adult that had told me ‘things get better’.",
      "created_utc": 1743591970.0,
      "score": 8
    },
    {
      "id": "mlamqv4",
      "body": "Same here, I'm thinking about this every single day. Not an exaggeration. Every single day.",
      "created_utc": 1743726403.0,
      "score": 2
    },
    {
      "id": "mkv2dji",
      "body": "[deleted]",
      "created_utc": 1743518516.0,
      "score": 2
    },
    {
      "id": "mlktw0a",
      "body": "Is it bad that I don’t like those either? Like, it’s better than our current capitalist hellscape, but I honestly just wanna be left alone. I wish I could just read books and drink coffee without having to work for the common good of some collective.",
      "created_utc": 1743877826.0,
      "score": 2
    },
    {
      "id": "ml54es4",
      "body": "Where do you find a commune?",
      "created_utc": 1743650394.0,
      "score": 1
    },
    {
      "id": "ml8p2kd",
      "body": "You do realize that lifestyle requires SO MUCH MORE work than a 9-5 right?",
      "created_utc": 1743704065.0,
      "score": 2
    },
    {
      "id": "mkowcam",
      "body": "damn life in China must be so different from America",
      "created_utc": 1743431683.0,
      "score": 6
    },
    {
      "id": "ml8p9m2",
      "body": "Americans are so stupid in thinking their 9-5 is bad. It’s better than 90% of the world",
      "created_utc": 1743704123.0,
      "score": -1
    },
    {
      "id": "mksje9d",
      "body": "I used to try to convince myself I was crazy or stupid  for feeling that way about the world, but years went by and my thoughts haven’t changed a bit, even when my suicidal ideations subsided.",
      "created_utc": 1743473536.0,
      "score": 5
    },
    {
      "id": "mkpkizf",
      "body": "That’s really cool that’s you’re pushing on. Wishing you all the best :) You’re inspiring!",
      "created_utc": 1743438975.0,
      "score": 7
    },
    {
      "id": "mkr5t8c",
      "body": "It’s so horrifying. I have to do whatever it takes to kill myself. I genuinely think im in hell. A piece of paper determines whether or not we get to eat. & WE NEED FOOD IN ORDER TO SURVIVE! Meanwhile… not a single person asked to be here. What fresh hell is this?",
      "created_utc": 1743456073.0,
      "score": 9
    },
    {
      "id": "mkmhu3e",
      "body": "I remember when i was homeless. I asked someone for help & she said no sorry before a word could even fall out of my mouth. I was so upset because i have never in my entire life treated a homeless person like that. EVER! I would give money to people just standing outside & they didn’t even have to ask. That bitch was evil as fuck. I could’ve been asking her for ANYTHING! A CUP OF FUCKING WATER! My parents had kicked me out , i ended up in a foreign town & I couldn’t even ask for help because I was a wanted fugitive. WTF LOL",
      "created_utc": 1743388834.0,
      "score": 23
    },
    {
      "id": "mkn8ck6",
      "body": "T-T <3",
      "created_utc": 1743401918.0,
      "score": 3
    },
    {
      "id": "mkr68uy",
      "body": "Same i got nothing better to do at this point",
      "created_utc": 1743456211.0,
      "score": 2
    },
    {
      "id": "mksj09q",
      "body": "I’m someone who’d would never consider joining the military, but fuck at this point, it feels like my options are either that or kill myself, which doesn’t really feel like much of an option",
      "created_utc": 1743473391.0,
      "score": 2
    },
    {
      "id": "mkqfk9k",
      "body": "[deleted]",
      "created_utc": 1743448199.0,
      "score": 4
    },
    {
      "id": "mkubk92",
      "body": "Right now in my country every part-time job filling shelves at a store get 1000 applicants and only a couple are hired.\n\nIt's funny how someone trashes a life that is a dream for others.",
      "created_utc": 1743508651.0,
      "score": 3
    },
    {
      "id": "mkqhgg6",
      "body": "I appreciate this suggestion. I tried to get a sugar daddy but i know old men. The second you aren’t young anymore they will throw you to the wolves + im just sick of being alive honestly. A 9-5 is just the catalyst",
      "created_utc": 1743448766.0,
      "score": 5
    },
    {
      "id": "mkse9a1",
      "body": "Same. I wish I had a gun.",
      "created_utc": 1743471626.0,
      "score": 2
    },
    {
      "id": "mkoy9jd",
      "body": "What if you're stuck in your career path. I have a 4 year old and I'm the only financial support to her. I can not afford to try out different paths because I can't risk my current job with a steady schedule or we might lose our living situation. Plus no one to even watch her while I do that or go to college. It sucks always being just one tiny thing away from being homeless:(",
      "created_utc": 1743432272.0,
      "score": 9
    },
    {
      "id": "mkpk9ug",
      "body": "I’m so sorry. Hopefully you are able to get money without working. Or maybe one day you’ll win the lottery?? Idk we MUST remain positive 😭",
      "created_utc": 1743438896.0,
      "score": 3
    },
    {
      "id": "mks3r2v",
      "body": "# Want To Escape The Modern World? 9 'Utopias' That Really Exist \n\n[https://www.huffpost.com/entry/utopias\\_n\\_3768023](https://www.huffpost.com/entry/utopias_n_3768023)",
      "created_utc": 1743467721.0,
      "score": 1
    },
    {
      "id": "mkub1jw",
      "body": "Humans have never had it easy and they always had to make an effort to survive for thousands of years - until now. Living for years on unemployment benefits and just lying in bed looking at the ceiling is far worse than a wage slave.",
      "created_utc": 1743508418.0,
      "score": 1
    },
    {
      "id": "mktensx",
      "body": "I don’t have a purpose either. I just hope I can get out of here soon. My misery is unending.",
      "created_utc": 1743488414.0,
      "score": 1
    },
    {
      "id": "mkp8cud",
      "body": "Lucky",
      "created_utc": 1743435324.0,
      "score": 4
    },
    {
      "id": "mkn8ly0",
      "body": "Was that, then the beatings came",
      "created_utc": 1743402073.0,
      "score": 11
    },
    {
      "id": "mknybnf",
      "body": "Same. My parents coddled me too much on purpose so I couldn’t live without them & now I have to die.",
      "created_utc": 1743418333.0,
      "score": 8
    },
    {
      "id": "mksjx7a",
      "body": "I was sorta in your shoes at 20, got a job and kept my head down for years, now I’m back to looking for work and feel the low self esteem coming back full swing. Trying to keep a routine of eating clean, exercising daily, and getting sunlight, but it can only help so much. I hope everything gets better for you",
      "created_utc": 1743473734.0,
      "score": 3
    },
    {
      "id": "mlotg6o",
      "body": "\"at least its not communism\" what is the logic here",
      "created_utc": 1743942155.0,
      "score": 1
    },
    {
      "id": "ml0kq92",
      "body": "Bundling up financial suicide also as part of the plan is a great idea unless you survive and have to deal with the consequences of debt you can’t repay.",
      "created_utc": 1743598358.0,
      "score": 1
    },
    {
      "id": "mkm613o",
      "body": "I appreciate your comment more than you know. For me, a 9-5 is like the bane of existence along with pretty much everything else. It can’t be ignored or dismissed. I HAVE to work in order to do practically anything. I’m tired of bills. Hell, im tired of human existence in general. I’m ready for peace.",
      "created_utc": 1743384254.0,
      "score": 17
    },
    {
      "id": "ml8pqn6",
      "body": "Redditors literally have zero knowledge of anything. Typically stupid Americans that have no idea how good the west has it compared to the world and ESPECIALLY compared to anyone 50 years ago or more.",
      "created_utc": 1743704264.0,
      "score": 1
    },
    {
      "id": "mkm7fzc",
      "body": "As much as I wish we didn’t have to live like that, I’m currently trying to find a way around it. Honestly thinking of things to invent or do outside of a 9-5 is a good way to distract from intrusive thoughts. Please stay. There are ways to live a happy life without going to a 9-5 everyday, and I’m going to try my best to find a way. Stay for the hope of finding a passion or skill that you can use to break the cycle of a 40 hour work week.",
      "created_utc": 1743384798.0,
      "score": 64
    },
    {
      "id": "mkpluoz",
      "body": "[deleted]",
      "created_utc": 1743439376.0,
      "score": 25
    },
    {
      "id": "mkn0d34",
      "body": "Fr",
      "created_utc": 1743397394.0,
      "score": 5
    },
    {
      "id": "mni16he",
      "body": "this",
      "created_utc": 1744847898.0,
      "score": 1
    },
    {
      "id": "mkn7zq1",
      "body": "I don't encourage it but would you privately share your plans to do it. I'm still contemplating on ways",
      "created_utc": 1743401704.0,
      "score": 9
    },
    {
      "id": "ml5p8jc",
      "body": "Me three pls",
      "created_utc": 1743660559.0,
      "score": 1
    },
    {
      "id": "mkn8323",
      "body": "Circumstances most of us have been born in.",
      "created_utc": 1743401758.0,
      "score": 20
    },
    {
      "id": "mnyct14",
      "body": "Bullshit, people absolutely love it and want it normalized.",
      "created_utc": 1745082210.0,
      "score": -1
    },
    {
      "id": "mlh8kgr",
      "body": "Alright luh bruh",
      "created_utc": 1743819042.0,
      "score": 1
    },
    {
      "id": "mkolnf5",
      "body": "Yeah I’ve been suicidal for years now. The future just seems more and more bleak. I keep looking for reasons to keep going and it keeps diminishing. I feel like I have nothing else to look forward to, and I’m depressed so it wasn’t much to begin with. 😭",
      "created_utc": 1743428216.0,
      "score": 17
    },
    {
      "id": "mlami0i",
      "body": "Things never get better, your soul just stops feeling more.",
      "created_utc": 1743726313.0,
      "score": 4
    },
    {
      "id": "mkvrvgp",
      "body": "You have to work as in terms of helping the community. Taking turns with things like cooking, child care, etc. A lot of them also have outside little shops people take turns working at. Rules are everywhere. It’s more of an off the grid type of lifestyle. I mean I suggest looking into it if it’s something you be potentially into. There’s a site somewhere that shows you different communes across the world and if they are accepting members, FAQ, etc.",
      "created_utc": 1743526420.0,
      "score": 2
    },
    {
      "id": "mlm1idd",
      "body": "I mean it’s *possible*. Have you ever seen Seeking Sister Wives? The husband stays at home and just reads books while his two wives make the money. Interesting concept. So I mean it’s not impossible I guess. 🤷🏻‍♀️",
      "created_utc": 1743893001.0,
      "score": 2
    },
    {
      "id": "ml565to",
      "body": "https://www.ic.org\n\nI found this!",
      "created_utc": 1743651112.0,
      "score": 4
    },
    {
      "id": "ml93gg7",
      "body": "I never said it was better than a 9-5, so stop with the attitude lol",
      "created_utc": 1743708380.0,
      "score": 7
    },
    {
      "id": "mlt5aiw",
      "body": "Respectfully, I don’t think that’s true—a subsistence lifestyle (in a moderate climate) involves periods of heavy activity (planting, harvesting, establishing new buildings/projects) and periods of comparatively light activity (winter lol). I’m not saying there’s not tons of work—there definitely is—but it’s not much more than 40 hrs/wk,** even during busy times. And you’re in charge of yourself, so it feels much less poisonous.\n\n**Unless you count cooking, mending, cleaning, etc., but office drones have to figure that stuff out, too.",
      "created_utc": 1743997313.0,
      "score": 2
    },
    {
      "id": "ml96ujd",
      "body": "Are we stupid?? I’m pretty sure we’re all suffering in our own way. Be more empathetic.",
      "created_utc": 1743709398.0,
      "score": 7
    },
    {
      "id": "mkmnhd4",
      "body": "Im so sorry to hear that. I feel like the whole world could’ve been kinder but its hard to do that when everyone is so focused on their own plate due to the climate we’re in. Hope this never happens to you again",
      "created_utc": 1743391216.0,
      "score": 9
    },
    {
      "id": "mkn7qmj",
      "body": "I've actually witnessed the same thing happen to someone I developed a way stronger resentment toward humanity after that.",
      "created_utc": 1743401554.0,
      "score": 8
    },
    {
      "id": "mkqgven",
      "body": "Yeah, prpblem also is that if US or europe did this, then china or other parts of the world would destroy us economically.",
      "created_utc": 1743448589.0,
      "score": 3
    },
    {
      "id": "mlanbru",
      "body": "Thanks to elites that pumping those birthrates. Humans worth nothing.",
      "created_utc": 1743726618.0,
      "score": 1
    },
    {
      "id": "mkqho5t",
      "body": "Maybe. Or maybe they die and you inherit all of their money.",
      "created_utc": 1743448830.0,
      "score": 3
    },
    {
      "id": "mkp8dnu",
      "body": "💀",
      "created_utc": 1743435331.0,
      "score": 5
    },
    {
      "id": "mkqf84q",
      "body": "I’m sorry to hear that. :(",
      "created_utc": 1743448098.0,
      "score": 3
    },
    {
      "id": "mlrl7nx",
      "body": "That at least is not communism, have you been in a country under communism?",
      "created_utc": 1743975754.0,
      "score": 1
    },
    {
      "id": "ml1ao01",
      "body": "It gives you strength to try again",
      "created_utc": 1743606990.0,
      "score": 2
    },
    {
      "id": "mkmduvl",
      "body": "No , it can't be dismissed. You have to do some work,   but as i said it can be altered to yout interest. The human existentce part , idk about that you must give me more insight to your thought Process  for me to understand. I would recommend to find peace in interests instead of death. Im on my journey aswell, i have alot of problems in my way to  achieve my peace. But i belive it would be wasted  to give yourself for the things you hate. Like a solider beeing tossed into battle  by a general , running  towards the enemy with no weapon only to be gunned down.",
      "created_utc": 1743387258.0,
      "score": 2
    },
    {
      "id": "mlanqu2",
      "body": "Exactly. They have no idea and weak minded.",
      "created_utc": 1743726775.0,
      "score": 1
    },
    {
      "id": "mkm7p7g",
      "body": "I appreciate your kind words. Please continue to be like that. The world needs people like you to balance all the evil negative people that thrive here. I won’t be able to stay. Once it finally dawned on me that existence itself is a form of slavery I was headed for the deep end. I know I’ll be gone one day but im rushing to the end. I’m ready for this.",
      "created_utc": 1743384896.0,
      "score": 79
    },
    {
      "id": "mkxy72h",
      "body": "Please don't",
      "created_utc": 1743551393.0,
      "score": 8
    },
    {
      "id": "ml53z67",
      "body": "I am 53.  Used precautions and never got pregnant.  I don't regret it at all.",
      "created_utc": 1743650215.0,
      "score": 5
    },
    {
      "id": "mksjfat",
      "body": "Please share with me too",
      "created_utc": 1743473547.0,
      "score": 5
    },
    {
      "id": "mnyehz1",
      "body": "The most ridiculous thing I've heard all day 😂",
      "created_utc": 1745082748.0,
      "score": 2
    },
    {
      "id": "mkoltcu",
      "body": "And I don’t care how “lazy” it sounds, I think about killing myself everyday over working.",
      "created_utc": 1743428275.0,
      "score": 21
    },
    {
      "id": "mml18zm",
      "body": "that’s a good way of putting it, I want to fight so hard because I know everybody is suffering.. one way or another. I just wish I was rich and suffering 😅",
      "created_utc": 1744387606.0,
      "score": 1
    },
    {
      "id": "mln8zi8",
      "body": "What’s the website?",
      "created_utc": 1743910274.0,
      "score": 1
    },
    {
      "id": "mlm9x3c",
      "body": "I guess, lol",
      "created_utc": 1743896119.0,
      "score": 2
    },
    {
      "id": "ml56jcv",
      "body": "Thank you",
      "created_utc": 1743651271.0,
      "score": 2
    },
    {
      "id": "ml98qtt",
      "body": "You obviously were saying it. Your life is objectively better than all of your ancestors lives. That’s not even a question. It’s an objective truth",
      "created_utc": 1743709949.0,
      "score": 1
    },
    {
      "id": "ml992nu",
      "body": "I would say crying about having to work 40 hours a week is a sign you’re stupid. You can complain that you hate your life but a 9-5 is not a good excuse. Life in America and Europe now is better than life has literally ever been in all of human history.",
      "created_utc": 1743710045.0,
      "score": -1
    },
    {
      "id": "mkrmae4",
      "body": "It's ok now ig lol thxs",
      "created_utc": 1743461556.0,
      "score": 3
    },
    {
      "id": "mlrulnb",
      "body": "there isn't a single country that has true communism or socialism",
      "created_utc": 1743979098.0,
      "score": 1
    },
    {
      "id": "mkna50l",
      "body": "That last part sounds enticing, sign me up!",
      "created_utc": 1743403010.0,
      "score": 2
    },
    {
      "id": "mkmnsyg",
      "body": "Before you give up on life give up on the things that stress your life.\n\nWalk out of that job you hate, tell that manager to go fuck himself, try something you’ve never done because you were afraid. Live your fucking life like it’s meant for you before you relinquish it on behalf of the collective “man” keeping us under their thumbs with a paycheck and a string.\n\nI worked 60 hours all month and still can barely afford to do my laundry. Nothing new, either. It sucks, but it is a choice. The alternatives are pretty fucking challenging in their own right, but walking down a sidewalk with no belongings and no place to call home is an unexplainable kind of liberating. I’ve seen both sides, and I know your struggle. Stay tough, friend.",
      "created_utc": 1743391355.0,
      "score": 46
    },
    {
      "id": "mkonn1t",
      "body": "they call us lazy for not wanting to be machines/slaves for capitalism",
      "created_utc": 1743428898.0,
      "score": 22
    },
    {
      "id": "mlr1dyp",
      "body": "www.ic.org\n\nI’m sure there are others but that’s one of them I found that looked decent.",
      "created_utc": 1743969322.0,
      "score": 1
    },
    {
      "id": "ml59n6y",
      "body": "Of course. I personally don’t think I could do it but I’m interested in everyone else’s experiences with them. If you end up finding an interesting please share. I’m always curious about that stuff.",
      "created_utc": 1743652615.0,
      "score": 1
    },
    {
      "id": "mlamx5m",
      "body": "At least he'd have yard,house etc. What will you own huh? Nothing. And you will be happy.",
      "created_utc": 1743726468.0,
      "score": 6
    },
    {
      "id": "mlb30ti",
      "body": "1) I never said it. When you assume, you make an ass out of you and, well... you.\n\n2) If your recent ancestors had your attitude when they were dealing with standard 80 to 100-hour work weeks, you wouldn't even have the time to be on Reddit.\n\nIf you want to keep being grateful, go ahead, but you're screwing over your descendents by accepting the world as the broken mess it is instead of wanting it to be better.\n\nYou're a disappointment to your ancestors and a disgrace to your descendents.",
      "created_utc": 1743732530.0,
      "score": 2
    },
    {
      "id": "ml9cphj",
      "body": "I would say, you deciding what is or is not enough for a human to handle is stupid. Everyone has very unique situations. Instead of judging them, try to be more compassionate as to where people may be coming from. Most of us come to these subreddits for support, not to be judged. That’s a different subreddit, take your judgements there.",
      "created_utc": 1743711093.0,
      "score": 6
    },
    {
      "id": "mlsraq4",
      "body": "So they should try the true one this time?",
      "created_utc": 1743991465.0,
      "score": 1
    },
    {
      "id": "ml5c040",
      "body": "It is money.  I am behind on rent and don't know how to budget.  I am about to get evicted.  I am outta here",
      "created_utc": 1743653681.0,
      "score": 3
    },
    {
      "id": "mks2d98",
      "body": "You are not lazy. All of you young people are right! It is not fair that you are inheriting this technofeudalist society from the boomers. Join or start a commune and just live for yourselves and each other on your own land.",
      "created_utc": 1743467209.0,
      "score": 10
    },
    {
      "id": "mlss8fj",
      "body": "All Im saying is that if the workers don't own the means of production then it isn't communism",
      "created_utc": 1743991835.0,
      "score": 1
    },
    {
      "id": "ml74yhw",
      "body": "I’ve been evicted - twice. It gets really real out here, man, I get it. I know what it feels like to lose everything you have and feel like the world has bottomed out from under you and not even have a job or family to fall back on.",
      "created_utc": 1743687333.0,
      "score": 3
    },
    {
      "id": "mlswkk3",
      "body": "OK commie",
      "created_utc": 1743993593.0,
      "score": 1
    },
    {
      "id": "ml7awrv",
      "body": "I have a job, but no family nearby.  I am doing it in a month.  I want to rys myself of society.",
      "created_utc": 1743689287.0,
      "score": 2
    },
    {
      "id": "mlt6604",
      "body": "that is literally the theory and ideology behind communism but ok.",
      "created_utc": 1743997712.0,
      "score": 1
    }
  ]
}