{
  "id": "1e5zh6j",
  "title": "I’m 44. My husband has a 22 year old girlfriend and broke my nose when I called him a groomer. I can’t find a reason to go on. ",
  "selftext": "Pretty much the title. But it’s a lie; I have a reason to go on. She’s 14 and she loves me, I know she would be lost without a mom. But I’m so fucking lonely. And so humiliated and tired. \n\nETA: he’s known her since she was 13. She was friends with my kids. Hence, groomer. \n\nEdit 2: I get it, I should leave. She’s a legal adult. Yeah, yeah. \n\nWe both have VERY public jobs in a VERY small town. Blowing this up would be humiliating for us all. Should I? Yes! Will I? I’m not strong enough. Hence, this post. ",
  "created_utc": 1721266645.0,
  "score": 624,
  "num_comments": 103,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1e5zh6j/im_44_my_husband_has_a_22_year_old_girlfriend_and/",
  "comments": [
    {
      "id": "ldr14y1",
      "body": "Please don’t leave her. I lost my mom less than a month before I turned 16. It’s such a crucial time for her to have a mother. Please.. do what you can to be safe. Find the better life. It’s out there I PROMISE … but please don’t leave her.",
      "created_utc": 1721298126.0,
      "score": 135
    },
    {
      "id": "ldpkj5l",
      "body": "how are you rn? how are you dealing with it?",
      "created_utc": 1721268409.0,
      "score": 203
    },
    {
      "id": "ldpkp38",
      "body": "It’s okay to feel like this. Your 14 daughter needs you. Your husband is distuging. Please find someone new and someone who could treat you better. Love always can be found. I hope you find a man that can treat you better. I know it’s very hard right now. I promise everything can be better once you find a light.",
      "created_utc": 1721268476.0,
      "score": 191
    },
    {
      "id": "ldpmil9",
      "body": "Sending you strength. Your husband sounds awful and abusive. You might feel alone in this now, but you have your daughter and a bunch of Internet strangers behind you. I hope things get better for you, friend.",
      "created_utc": 1721269217.0,
      "score": 80
    },
    {
      "id": "ldq9ehn",
      "body": "My parents divorced in 05’ and never separated. Stockholm syndrome is very real when dealing with daily abuse. They fought today pretty severely and I had to intervene. That’s why this post speaks to me and compelled me to comment. I hope you separate and never look back. There are Reddit communities for Stockholm if you feel like that may be an issue for trying to stay. People change and show their true selves. Please recognize your strengths and know better days are around the corner. You desire it so keep putting one step in front of the other and I promise it will reclaim your power and get easier with time. Best of luck and know god or the universe or whatever your beliefs are backing this decision. Trust the process.",
      "created_utc": 1721280065.0,
      "score": 41
    },
    {
      "id": "ldr23x9",
      "body": "I was around 36 when the man I’d been with 12 years left me and our children to be in a “relationship” with my 16 year old niece. (Legal in Australia … it’s messed up I know)\n\nSo I can understand, really understand the shock and betrayal you’re feeling right now. I can also understand that you’re trying to make sense of what happened. Please contact a DV agency or support group. Let them help you with safety planning, counselling and support. \n\nIt’s going to be so hard and then I promise you’re going to bloom. Get support. Protect yourself.  Protect your 14 year old. Put on your oxygen mask and NEVER minimize what you’re going through. It’s hard, it’s real and you can do this. \n\nI am sending you all the strength I have. 🩷 one step at a time.",
      "created_utc": 1721298724.0,
      "score": 26
    },
    {
      "id": "lds0u8a",
      "body": "Leave him. Get a divorce. It's done, he's done. Don't give up on your life because of that pile of trash, just try to get as far away from him as possible. This will be good for your child in the long run too.",
      "created_utc": 1721313662.0,
      "score": 8
    },
    {
      "id": "ldqj4jg",
      "body": "I hope I say this correctly, but no POS man is worthy of suicide. \n\nThere’s a danger in having a child and staying with an abuser, teaches them that it’s okay to he treated with disrespect and disdain. \n\nI hope for your child’s sake that you seek treatment and find strength, courage and the ability to better your situation.",
      "created_utc": 1721285994.0,
      "score": 17
    },
    {
      "id": "lds3w79",
      "body": "Yeah he’s an abusive piece of shit. please press charges. I’m sure you’re a good mom. I hope you get better soon… sending you lots of love",
      "created_utc": 1721314678.0,
      "score": 7
    },
    {
      "id": "ldpn8rp",
      "body": "[removed]",
      "created_utc": 1721269517.0,
      "score": 31
    },
    {
      "id": "ldq726y",
      "body": "Please don't die over some creepy dipshit, take your 14 year old and bounce. Starting over is scary but in reality not that hard.",
      "created_utc": 1721278758.0,
      "score": 35
    },
    {
      "id": "ldrz9xm",
      "body": "This is so sad I am so sorry. You’re a good mom and Im sending a long virtual hug 🫂",
      "created_utc": 1721313136.0,
      "score": 4
    },
    {
      "id": "ldsmt5h",
      "body": "Get a divorce and you will be revived. Wish you strength and courage. 🙏🙏🙏",
      "created_utc": 1721321006.0,
      "score": 4
    },
    {
      "id": "ldq62qy",
      "body": "The typical lie an abusive man like this tells you is, “who’s going to want a 44 year old woman with a 14 year old that isnt theirs?” And as a 26 year old man I’d like to tell you more than 50% of us WOULD. It’s a foolish stereotype that woman lose their value after 40, and after having children. There are a lot of men who can’t have children and are happy to raise step children. Some of us have conflicts with having our own children, but have no problem helping a woman raise hers! He’s pushed the line far enough and it’s time you moved on as well. Hell I’m recently single, and I can’t tell you how happy I’d be with with someone in your situation(I’m into older women, sorry to use myself as an example so much) moral of the story, you deserve and can have much better",
      "created_utc": 1721278231.0,
      "score": 20
    },
    {
      "id": "ldpuyht",
      "body": "I will pray for you, hope you get someone better.",
      "created_utc": 1721272823.0,
      "score": 12
    },
    {
      "id": "ldr8tth",
      "body": "Please get away from your husband. Your daughter does not deserve to be raised with such a pig!!",
      "created_utc": 1721302425.0,
      "score": 8
    },
    {
      "id": "ldrv37t",
      "body": "I’m so sorry dear we are  here",
      "created_utc": 1721311687.0,
      "score": 3
    },
    {
      "id": "ldr9y47",
      "body": "Punch him in the nose?!",
      "created_utc": 1721302986.0,
      "score": 4
    },
    {
      "id": "ldscwjj",
      "body": "I'm sorry you're dealing with this. You deserve so much better. It won't be easy, but it's worth it. As you've said, you have a big reason to go on. Hug your daughter. Love her. In time you'll get past this.",
      "created_utc": 1721317612.0,
      "score": 2
    },
    {
      "id": "ldsuwgi",
      "body": "I'm very sorry. Have you started divorce proceedings? Does your daughter know? Has your husband talked to her? Where are you staying? Where is she staying? If he is willing to hit you, he is willing to hit anyone and you and your daughter are not safe there. Do you live in the US? What is your support system like outside of your (hopefully soon to be ex) husband?",
      "created_utc": 1721323616.0,
      "score": 2
    },
    {
      "id": "ldtjt1s",
      "body": "Hey, you're teaching her to not stay in a relationship where someone would betray or hit you - that's a big deal. It makes sense that you're hurt. Also, you're not the one that messed up here. I see you, I hear you. And one day you are gonna thrive so hard.",
      "created_utc": 1721331713.0,
      "score": 2
    },
    {
      "id": "ldtkkd7",
      "body": "I've never been cheated on but it sounds horrible. I hope you can either punch him in the nose back or press charges so you can set an example for your daughter. I can imagine getting cheated on is bad but an extra blow thinking about some hot young and legal women now wanting him.\nTherapy will help the healing \nOr see how many hot 22 yr old guys you can replace him with",
      "created_utc": 1721331964.0,
      "score": 2
    },
    {
      "id": "ldtz5o6",
      "body": "There is a better life out there for you and your daughter. A happier life, the one you both deserve. Please don’t give up hope. I know it’s so fucking hard, but please hold on. She needs you.",
      "created_utc": 1721336669.0,
      "score": 2
    },
    {
      "id": "ldumt2b",
      "body": "Oh this is fucked, and you need to relocate to a safe place with her ASAP, without his knowledge.  Is that feasible atm?  Do you have enough funds saved for such an emergency?  Anyone that you know that is trustworthy that you can stay with?\n\nNot only a groomer, but an unhinged, violent miscreant.",
      "created_utc": 1721346098.0,
      "score": 2
    },
    {
      "id": "ldvowbc",
      "body": "[www.thehotline.org](http://www.thehotline.org)[https://www.benefits.gov/news/article/472](https://www.benefits.gov/news/article/472)\n\nPlease look into these sites, they can help you.  Humiliating?  That's seriously the absolute last thing you should be worried about.  He broke your nose?  Nah.  It's gonna get worse.  Get out., ASAP, and take your daughter with you.",
      "created_utc": 1721361974.0,
      "score": 2
    },
    {
      "id": "ldw3chq",
      "body": "No need to be humiliated. You seem to be a good person and a good mom. You have done nothing wrong. Stay strong for your daughter. In my opinion best thing would be to remove yourself and your daughter from this situation. Start fresh and both of you be happy. And your husband is the one who needs to feel humiliated. Doing this to his family. And being a groomer and a borderline pedo.",
      "created_utc": 1721369966.0,
      "score": 2
    },
    {
      "id": "ldzgsp4",
      "body": "Break his nose and her face. You'll feel better. And if you have a job, in most states, zero will happen to you. ",
      "created_utc": 1721421054.0,
      "score": 2
    },
    {
      "id": "ldpupqj",
      "body": "are you okay rn",
      "created_utc": 1721272714.0,
      "score": 6
    },
    {
      "id": "ldqg70x",
      "body": "OP I believe your story, being in a lost relationship sucks, it feels like the world has become a void and a pit. I was in an abusive relationship before and understand. There really needs to be more context painted around the situation that transpired, should be have hit you? Fuck no! Should you have called him a groomer? Definitely not when it's a consulting adult. Causing injury to another defines a lack of self control and self awareness, he's a jerk for doing that.\n\nOP, there is always hope for those that have something to hope for and cling on to. I don't have that, give her your undivided love, show her compassion, don't vilify him let her come to understand that on her own. Pain begets pain, I know that's not what you need, but it's what you need to hear.",
      "created_utc": 1721284133.0,
      "score": 2
    },
    {
      "id": "ldq6axe",
      "body": "Hey, I’m so sorry for what you went through. Your daughter loves you and will always see you for the strong person that you are. Your husband sucks, he is the one who should be ashamed. \nI understand that right now you feel lonely and down, but I’m sure you will have another chance on feeling loved and appreciated, because that’s what you deserve.",
      "created_utc": 1721278352.0,
      "score": 0
    },
    {
      "id": "ldpvy6d",
      "body": "*gentle, warm hugs*",
      "created_utc": 1721273274.0,
      "score": 0
    },
    {
      "id": "lduso42",
      "body": "[removed]",
      "created_utc": 1721348393.0,
      "score": 1
    },
    {
      "id": "ldv6txt",
      "body": "Wait I'm confused can you explain a little better who's 14 and who's 22?",
      "created_utc": 1721354080.0,
      "score": 1
    },
    {
      "id": "le8jo6b",
      "body": "My heart breaks for you, what a no good xunt in all honesty. ",
      "created_utc": 1721575201.0,
      "score": 1
    },
    {
      "id": "lzqkv7d",
      "body": "I'm here for you. Our stories aren't the same but they are. Please keep going. If you can get away from him just for a week or two you'll realize you've been sucked into this and suddenly it's all not worth it. Please please, save your self. I say that because i need to save me too",
      "created_utc": 1732987164.0,
      "score": 1
    },
    {
      "id": "ldpx1gr",
      "body": "Um. Cops. Call them. Because who knows what he will do with your 14 yr old daughter. Your husband is disgusting",
      "created_utc": 1721273780.0,
      "score": -6
    },
    {
      "id": "ldrxdy7",
      "body": "1. Police\n\n2. And everything else later. Seriously, what is wrong with you people? Why do you, wives, never go to police after being attacked?",
      "created_utc": 1721312493.0,
      "score": 2
    },
    {
      "id": "ldvx21o",
      "body": "Blow it up... he deserves the shame.  \nExpose him, then take your kid, leave town and never look back. \n\nWho knows? you might be saving another kid from a shitty groomer, because... someday, that 22-year-old girl will be too old for him. \n\nI have a boyfriend, he's 47 and we've been dating since i was 20, so believe me when i say that i know the difference between someone who fell in love with another someone from someone who's just an asshole (i mean he broke your nose, come on!!!) AND a groomer.",
      "created_utc": 1721366285.0,
      "score": 1
    },
    {
      "id": "ldq6s29",
      "body": "Yous shouldn't of called him a groomer and he shouldn't of punched you. Call him a cheater, his girlfriend is 22 and of age so unless things are being left out he isn't a groomer 28 or 32 or 44.\n\nGo to a woman's shelter and call the police.",
      "created_utc": 1721278607.0,
      "score": -8
    },
    {
      "id": "lds9f32",
      "body": "[deleted]",
      "created_utc": 1721316485.0,
      "score": 0
    },
    {
      "id": "ldpu93f",
      "body": "I’m alright. The nose breaking is past, so no charges to be pressed. I’m healed physically. I just…am so sad.",
      "created_utc": 1721272506.0,
      "score": 194
    },
    {
      "id": "lds3g6r",
      "body": "What do you even do with a 16 years old girlfiend when you're in your 30s though? Like besides the messed up stuff, it just sounds boring as hell at best and extremely annoying at worst. I'm 23 and can't stand teens already. The idea of being with one romantically and like, moving in, etc, just sounds exhausting. What do you talk about?",
      "created_utc": 1721314532.0,
      "score": 14
    },
    {
      "id": "lds3ztx",
      "body": "yeah. man’s not worthy of her tears. she needs to run",
      "created_utc": 1721314711.0,
      "score": 6
    },
    {
      "id": "ldrs57w",
      "body": "Let's not spread lies. A woman value does go down whenever she has kids, especially young kids/teenagers. But their are guys who are willing to be there for her and her kids. And that goes for a woman of any age. I myself don't mind long as the child is respectful, but it is  hard finding a single mom with respectful children now a days.",
      "created_utc": 1721310629.0,
      "score": -12
    },
    {
      "id": "lds36p1",
      "body": "And do nothing to him while empowering dude to think he's defending himself? No. Fight with your weapons. Get your kid and get the fuck out. No way a woman's punch will do anything to his nose unless she knows what she doing, and I don't think that's the case with OP. Don't play with fire.",
      "created_utc": 1721314444.0,
      "score": 6
    },
    {
      "id": "ldpvazw",
      "body": "I am, thank you.",
      "created_utc": 1721272979.0,
      "score": 4
    },
    {
      "id": "ldusun7",
      "body": "Sooooo serious on the blow it up for fun too. Everyone in his life should know how disgusting he is. He ruined your life, RUIN HIS and then move on! Take your child with you!!",
      "created_utc": 1721348464.0,
      "score": 1
    },
    {
      "id": "ldq83wx",
      "body": "That's reaching a bit.",
      "created_utc": 1721279334.0,
      "score": 24
    },
    {
      "id": "ldq99vq",
      "body": "[removed]",
      "created_utc": 1721279993.0,
      "score": 13
    },
    {
      "id": "ldqakos",
      "body": "It’s pretty gross. His daughter is closer in age than his wife to his girlfriend. They are only 8 years apart. Young enough to be his daughter’s older sister. Also breaking his wife’s nose? He can abuse the daughter physically as well if he has t already",
      "created_utc": 1721280739.0,
      "score": 5
    },
    {
      "id": "ldq9n14",
      "body": "US with their dumbass groomer shit. Next year, the age of consent will be 35",
      "created_utc": 1721280200.0,
      "score": 3
    },
    {
      "id": "ldrs8ze",
      "body": "You're going way overboard with the bs. Smfh!",
      "created_utc": 1721310667.0,
      "score": -1
    },
    {
      "id": "ldu9fsz",
      "body": "It is not always safe to call police. I know women who have called police and if there hadnt been body cam subpoenas the cops would have just made her life worse, siding with the abuser. I'd call a DV hotline but not the police. You're taking a big chance on whether the assigned cop is going to protect women or take up for his brother abuser.",
      "created_utc": 1721340657.0,
      "score": 0
    },
    {
      "id": "ldqjafu",
      "body": "normal people avoid dating someone who is in the age bracket of their own kids.",
      "created_utc": 1721286099.0,
      "score": -2
    },
    {
      "id": "ldqlkus",
      "body": "They probably called each other a bunch of derogatory names or do you think he said nothing mean in response.",
      "created_utc": 1721287616.0,
      "score": -2
    },
    {
      "id": "ldsdcdu",
      "body": "Thats not the question my freind, OP doesn't need a moral lesson now, if her huband cheated on her and broke her nose, she has every right to be angry, tou can't throw thd blame on her when she's a victim",
      "created_utc": 1721317755.0,
      "score": 8
    },
    {
      "id": "ldq7sm5",
      "body": "Wait, why didn't you press charges?",
      "created_utc": 1721279160.0,
      "score": 130
    },
    {
      "id": "ldqqbju",
      "body": "If you broke your nose once a doctor can see that it was broken so you coulf maybe still press charges",
      "created_utc": 1721290834.0,
      "score": 37
    },
    {
      "id": "ldrmzw4",
      "body": "Hey. Do you have the physical and financial means to get away with your child? If not there are resources. Check if you live in a “community property” state and hire a lawyer. There’s much more I can suggest if you are interested. Trust me, I have contemplated the same and chose to get away instead. Please reach out if you would like ideas or resources. I hope you can find moments of peace in this crazy time.",
      "created_utc": 1721308677.0,
      "score": 12
    },
    {
      "id": "ldtvas6",
      "body": "Do you have medical records of that?   If so use it to gain full custody.\n\nLet's be honest, someone who breaks the nose of a child's mother and choses to spend his time on 22 year olds instead of their kid is a shitty father.",
      "created_utc": 1721335421.0,
      "score": 7
    },
    {
      "id": "le1jxei",
      "body": "Right?!  When I asked him why, (not that there’s EVER going to be a why good enough for that) he said that she made him feel special and she gave him the attention he needed. Meanwhile during this twenty minute conversation his phone wouldn’t stop either ringing or getting messages from her….. Walls of text.  \nSo yeah, boring and annoying is a perfect description for that I reckon.",
      "created_utc": 1721453035.0,
      "score": 2
    },
    {
      "id": "ldsx2tq",
      "body": "A woman’s value? What is wrong with you?",
      "created_utc": 1721324307.0,
      "score": 9
    },
    {
      "id": "ldtwku8",
      "body": "Tbh, it really only goes \"down\" (thought I don't like the term 'value') if she's a trainwreck who refuses to set boundaries or parent her kids.  If she can adult, then I don't think many men care (unless they are CF).",
      "created_utc": 1721335832.0,
      "score": 1
    },
    {
      "id": "ldt53u8",
      "body": "First of all it was a half joke second of all don't assume  maybe she is a black belt",
      "created_utc": 1721326924.0,
      "score": 3
    },
    {
      "id": "ldqap5z",
      "body": "Sorry.. what? He broke his own wife’s nose! He could easily abuse the daughter as well. Wake up.",
      "created_utc": 1721280812.0,
      "score": 14
    },
    {
      "id": "ldqal0a",
      "body": "[removed]",
      "created_utc": 1721280744.0,
      "score": -5
    },
    {
      "id": "ldqklfx",
      "body": "That doesn't make someone a groomer. Socialising someone below 18 for the sole purpose for sex and relationships later on or between 18 and the started age is grooming.\n\nStop misusing the word as a throwaway stupid insult, it's for people who actually groom and allow victims to identify people like that.",
      "created_utc": 1721286960.0,
      "score": 17
    },
    {
      "id": "ldrnmu7",
      "body": "There's a world between calling someone something mean to calling them a pedo, tbh. Not that it justifies punching her, obviously",
      "created_utc": 1721308926.0,
      "score": 0
    },
    {
      "id": "ldq87wn",
      "body": "[deleted]",
      "created_utc": 1721279397.0,
      "score": -12
    },
    {
      "id": "ldqca5o",
      "body": "[removed]",
      "created_utc": 1721281747.0,
      "score": -9
    },
    {
      "id": "ldqfr4x",
      "body": "Riiiight… that’s what it is. Infantilisation of women. 🤦‍♀️ you are a misogynist who probably only wants to ‘date’ 20 year olds yourself, just admit it. The words you are saying are actually disgusting",
      "created_utc": 1721283857.0,
      "score": 4
    },
    {
      "id": "ldro4d5",
      "body": "Adults can 100% groom other adults. The word has nothing to do with pedophilia its just commonly associated with it thanks to that being the main context it happens in.",
      "created_utc": 1721309116.0,
      "score": 0
    },
    {
      "id": "ldrit45",
      "body": "Depends on the context. Grooming is always the case in CSA situations. But a lot of organisations advise that adults can be groomed too - where the victim is vulnerable and/or there’s a power imbalance (e.g. age difference, status, etc.).",
      "created_utc": 1721306984.0,
      "score": -1
    },
    {
      "id": "lds3okm",
      "body": "So, just because the words hurt his feelings more that makes it worse and she didn't say pedo she said groomer. Here, you are spinning it into something else, their words. Hurtful words, they were likely saying to each other.",
      "created_utc": 1721314608.0,
      "score": 1
    },
    {
      "id": "ldq9bkg",
      "body": "it’s not “sus” people who are abused often don’t report and it’s shitty to question them because of it",
      "created_utc": 1721280019.0,
      "score": 169
    },
    {
      "id": "ldqfifi",
      "body": "Wow you are actually frightening. She didn’t say she accused him of pedophilia. Adults can groom other adults, it doesn’t always have to involve a minor. He broke her nose. He is dating someone only 7 years older than his daughter, much much closer to her age than his age. She has a right to be upset and maybe he is a groomer. He broke her nose!! Her calling him names never warrants physical violence. He has probably been violent before, he is a danger to her and to his kids. Anyone that could break someone’s nose over name calling. Plus they are still married and so he is cheating on her! The amount of victim blaming you are doing..it’s scary.",
      "created_utc": 1721283707.0,
      "score": 12
    },
    {
      "id": "ldqfngm",
      "body": "Id hold off on the 'I doubt it's all she did,' that's a bit of thin ice. Though we really have to approach it from a totally non biased perspective and see the situation for what it is and call it as such. Which is infidelity and a form of physical, verbal and emotional abuse going on. This is coming from someone who was abused in a relationship before, there has to exist the ability to declare fault in some form such as calling a 44 year old man who is dating a 22 year old adult a groomer and from there discuss perspective, forms of communication and how to cope moving forward.\n\n\nTL;DR I believe OPs story, I agree with Zama but expanded for further context.",
      "created_utc": 1721283793.0,
      "score": 7
    },
    {
      "id": "ldsxyr7",
      "body": "Sorry, but i don't understand it anymore. So, if someone fall in love with other person from other social status or age difference being you an adult is \"grooming\" or \"manipulation\"? Come on... i don't know if this case in particular is grooming (because of the social issolation and other real abusive behaviours are not mentioned) but now we are gonna pretend that, if we don't date someone of the same social status and age, is \"grooming\"?",
      "created_utc": 1721324588.0,
      "score": 3
    },
    {
      "id": "ldq9ubt",
      "body": "[deleted]",
      "created_utc": 1721280316.0,
      "score": -2
    },
    {
      "id": "ldqaf5q",
      "body": "Grooming doesn’t always have to involve a minor.",
      "created_utc": 1721280651.0,
      "score": 58
    },
    {
      "id": "ldqa88w",
      "body": "Wdym “if it did happen” it did, she told us it did. This really isn’t the place to police peoples language. And grooming is about power, so id consider him a groomer aswell.",
      "created_utc": 1721280539.0,
      "score": 47
    },
    {
      "id": "ldqaufs",
      "body": "[deleted]",
      "created_utc": 1721280898.0,
      "score": 1
    },
    {
      "id": "ldtjtf1",
      "body": "It definitely should be saved for minors not grown ass women who are 22...... Hardly grooming",
      "created_utc": 1721331717.0,
      "score": -13
    },
    {
      "id": "ldqapng",
      "body": "[deleted]",
      "created_utc": 1721280820.0,
      "score": -4
    },
    {
      "id": "ldqbwww",
      "body": "A gradually escalating course of leveraging an inequal personal power balance for purposes of exploitation.",
      "created_utc": 1721281531.0,
      "score": 34
    },
    {
      "id": "ldqb2ia",
      "body": "the fact that you don’t see an issue with his behavior doesn’t mean it’s not problematic, it means that your view would side with a groomer too.",
      "created_utc": 1721281030.0,
      "score": 49
    },
    {
      "id": "ldqbajn",
      "body": "[deleted]",
      "created_utc": 1721281162.0,
      "score": 1
    }
  ]
}