{
  "id": "1j7joxj",
  "title": "it's so weird being suicidal and not a teen anymore",
  "selftext": "like when I was a teen I was at least sure someone would care about my death. I think now I could be rotting for at least a week before even someone noticed I'd be gone ",
  "created_utc": 1741559685.0,
  "score": 838,
  "num_comments": 61,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1j7joxj/its_so_weird_being_suicidal_and_not_a_teen_anymore/",
  "comments": [
    {
      "id": "mgxp85g",
      "body": "Sadly a lot of the social support, especially external from acquaintances, etc. Really falls away when you get older. Even more so if you've moved and no longer around anyone you even know. It's a weird feeling, being so isolated. I could die today and I don't think my family would hear about it for months, or at all.\n\nWhen you're a student they make a memorial and everyone sends sympathy.\n\nWhen you're an adult and an employee they simply put up a job listing for your now empty position.\n\nEveryone stops caring after 21. We're all just statistics and ID numbers.",
      "created_utc": 1741562995.0,
      "score": 230
    },
    {
      "id": "mgyz56l",
      "body": "It' takes on a different lifeform than as a teen. During my teenage years, being suicidal was more so produced by how consumed I was in my negative emotional intoxication and expression of psychological states through what I was feeling. Physical sensations of disparity, anger, rage, crying, attachment to people and mood swings. That \"in the chest\" feeling of death. Now as a mid 20s adult, it feels more akin to chronic emptiness, apathy and a depersonalization of my identity.  A chronic sense of absenteeism from life. Its less \"painful\" on a daily basis, but more demoralizing and I have less energy to care. For instance, realizations over depressing things such as social support systems are inadequate. As a teen this realization would've seen shocks of horror through my body. A terror and panic of aloneness that would have me grappling on the ropes of depravity in the nether of life. As an adult, that same realization is met with a cynical attitude of \"of course there's not\", bitterness and a repressed vindictiveness. An automatic subconscious process of dysfunctionality and an intertwined mental system that doesn't let me actually emotionally process the reality of the devastation.  As a teen, there is more exploration that I can't recapture for the life of me. Now it's just apathy and its disgusting, but I cant bring myself to do anything about it. In some ways, I was more alive and had a stronger personality during my teenage years. I had more curiosity and feel that as I have progressed into adulthood, I am shallower as a person.  Yet, I am less proactively suicidal. It's more like dealing with a life sentence in prison. The biggest trap in adulthood is mistaking apathy for wisdom. I see it everyday",
      "created_utc": 1741579886.0,
      "score": 61
    },
    {
      "id": "mgzp74e",
      "body": "[deleted]",
      "created_utc": 1741594960.0,
      "score": 29
    },
    {
      "id": "mgy8rd2",
      "body": "I didn't think I'd live this long. But I thought certainly it will get better if I persevere, right? Putting in the work and energy into therapy and medications? Right? \n\n\nDoesn't seem like it.\n\nSomeone would absolutely notice your absence, and you'd be missed. I'm sure of it.",
      "created_utc": 1741569749.0,
      "score": 37
    },
    {
      "id": "mgycw4r",
      "body": "I think about it every day, I'm finding the courage to do this before I'm 18, but I don't want my mother to be alone after helping me with my problems.",
      "created_utc": 1741571208.0,
      "score": 13
    },
    {
      "id": "mgymjqc",
      "body": "even as a teen no one would notice. my mom would act like i wasn’t dead as i rot in my bedroom, my dad would grieve for a day then forget, and my friends would celebrate i’m gone. teachers would thank god for one less student.",
      "created_utc": 1741574758.0,
      "score": 12
    },
    {
      "id": "mh0ilvo",
      "body": "I’m so done. I hate society. I hate people. I just want to be gone.",
      "created_utc": 1741611024.0,
      "score": 12
    },
    {
      "id": "mgxgn8g",
      "body": "People would notice and would be sad. Somebody from my school killed them self a couple of years ago and my entire year was really shocked and sad, even though most of us weren’t particularly close with him. Just because it feels like nobody cares, doesn’t mean that’s true. Showing that you care can just be tough",
      "created_utc": 1741560119.0,
      "score": 12
    },
    {
      "id": "mh0iv5a",
      "body": "That's why many people get stuck to childhood and regress for attention... The laws and attention are unfair...",
      "created_utc": 1741611127.0,
      "score": 6
    },
    {
      "id": "mgyq181",
      "body": "Not being a teenager doesn’t mean you’re not young anymore it just means you’re an older adolescent or pre adult or a baby adult.",
      "created_utc": 1741576110.0,
      "score": 4
    },
    {
      "id": "mh5n0h7",
      "body": "when i was about 10 i thought that love and attention from others ended when you became an adult. because kids make mistakes and it’s okay because they’re young, but adults are supposed to know everything. i’m an adult now and it turns out i was sort of right. a suicidal teen is more „sad” and people pity you, but adults are just meant to handle it because they’re grown people",
      "created_utc": 1741670051.0,
      "score": 4
    },
    {
      "id": "mh63s4g",
      "body": "this makes me so nervous to becom4 an adult I just want someone to care about me still and be invested in my wellbeing but I don't think anyone cares for me in particular even as a teen and when I'm an adult they'll care even less",
      "created_utc": 1741680070.0,
      "score": 4
    },
    {
      "id": "mhsws28",
      "body": "At a point of life where if i die, people would celebrate.",
      "created_utc": 1741981608.0,
      "score": 3
    },
    {
      "id": "mh1ij3t",
      "body": "i'm 19 and i miss high school for this reason alone. i guess i'm still a teenager but i know in 5 years nobody will give a shit if i am alive. the older you get the colder it gets. I still regret not ending it in high school. at least i'd get attention, be forever young with people noticing. i always wanted to die as a teenager and i know i won't this year and when I turn 20 i know i will regret that.",
      "created_utc": 1741622828.0,
      "score": 5
    },
    {
      "id": "mi6gbj1",
      "body": "Yeah I’m 18 now and everytime I feel like this, I just start to miss the days when me and my friend group all related to this feeling of uncertainty in life. Every time we said we wanted to die, we meant it. We even romanticized it. Wanting to die because it’s all just so painful. I miss high school for the shelter. I hated the control. I feel lost because I have the freedom to do whatever I want. I didn’t know that being able to whatever I want would leave me feeling so empty. But nothing I want makes me happy anymore. Everything feels so shallow and I start to feel this very quiet panic over how apathetic it all is. I just want to feel held. I want to feel inspired. I want to feel assured. Life is a paradox. I still get out of bed everyday and go outside for some exercise. I like singing. I like dancing. I like acting like I’m in some sort of music video. But it just feels like I’m gonna go nowhere with that feeling. I like it in the moment I guess. I’m lucky that I’m blessed with the ability to have charisma and character. But I always come back to this empty panic. It makes me feel like I’m bipolar or something even tho I know I don’t have bipolar disorder. I still have some friends but they’d all just tell me what I would tell them in my situation: “Get help. Also, wanna talk about it..?” At least I can talk to one of them about my mental issues. They KNOW I seriously want to die and that calling some sort of mental institution would make things worse for me. But if I told them my plans, it would scare them. What if I don’t believe in whatever professional is gonna do with me?? I’m so tired of having hope. Hope is a very hard thing to have. I just want the peace of death. So I’ll just wait til they all eventually move into their own different chapters of life and then on a random quiet day I’ll end it. So that’s how I cope. I tell myself that nothings ever worth it ever and that I’ll just die early by my own hands. Alone. Hurting over good days bygone. I miss when I was the king of other peoples perceptions of me. That’s ALWAYS what gave my life meaning, even since I was little. But now the focus has shifted to “study hard and get a good job and be the best person ever or die” and I can’t fucking do that. I HATE doing shit I don’t care about. So now I’m just anxious, and delusionally ambitious but lazy, and I wanna die lmao. I have a simple pizza delivery job and I’m going back to school soon. But like idk. I cant believe there were moments in my teens where I thought I hit rock bottom, cuz it can get a hell of a lot worse. Always.",
      "created_utc": 1742170132.0,
      "score": 2
    },
    {
      "id": "mh3hhtx",
      "body": "Does that really happen?",
      "created_utc": 1741643023.0,
      "score": 1
    },
    {
      "id": "mhel7xz",
      "body": "If you stop commenting or posting longer than normal i will be following up.",
      "created_utc": 1741795615.0,
      "score": 1
    },
    {
      "id": "mhiguok",
      "body": "I feel the actual exact same way.",
      "created_utc": 1741839182.0,
      "score": 1
    },
    {
      "id": "mhlc79f",
      "body": "At this point i’m pretty sure no one would care about my death either.",
      "created_utc": 1741884314.0,
      "score": 1
    },
    {
      "id": "mhp26ah",
      "body": "Creditors are the first to care.",
      "created_utc": 1741926240.0,
      "score": 1
    },
    {
      "id": "mhp641e",
      "body": "I agree especially when you’re in college and you’re trying to get your career figured out and if you’re even cut out for said career and if you’re not then what’s the point of even being in college rn on top of having so many medical problems now that won’t fix I’m constantly thinking about taking a bath with a toaster",
      "created_utc": 1741928105.0,
      "score": 1
    },
    {
      "id": "mi1zhlh",
      "body": "I’ve been thinking about this a lot recently and I’ve been trying to build up the courage to get on with it before I turn 18. It makes me feel all the more like a poser too lol, that I should want people to notice when I’m gone and that it should be all the more tragic that I was “so young” or whatever.\n\nIf anything I think that could strengthen you. There’s no glamour in it anymore, if that ever meant anything.",
      "created_utc": 1742110733.0,
      "score": 1
    },
    {
      "id": "mgxwmuj",
      "body": "I'm not even employed. I'm on disability. No one would miss me, especially. 😖",
      "created_utc": 1741565561.0,
      "score": 69
    },
    {
      "id": "mgyfgtd",
      "body": "that's harsh to read",
      "created_utc": 1741572124.0,
      "score": 30
    },
    {
      "id": "mh04c2s",
      "body": "This hits hard for some reason to read this but it's the sad reality unfortunately.",
      "created_utc": 1741604335.0,
      "score": 14
    },
    {
      "id": "mgz16du",
      "body": "I just turned 22 and it made me bring your comment's vote count down to 21",
      "created_utc": 1741580815.0,
      "score": 4
    },
    {
      "id": "mhah7sp",
      "body": "The line about being adult made me both laugh and cry.",
      "created_utc": 1741733900.0,
      "score": 1
    },
    {
      "id": "mho2v2i",
      "body": "Tbh, I've been feeling like nobody gave a damn when I turned 17.",
      "created_utc": 1741913212.0,
      "score": 1
    },
    {
      "id": "mgzg9tr",
      "body": "It’s weird, it’s not the feeling of wanting to escape, but rather the loss of any excitement to live, If someone were to ask me whether or not I’m suicidal I’d say it’s not like I’ll throw myself onto an incoming bus but I also don’t care if one hits me.",
      "created_utc": 1741589124.0,
      "score": 24
    },
    {
      "id": "mgz7g5a",
      "body": "Perfect way to put it.",
      "created_utc": 1741583962.0,
      "score": 7
    },
    {
      "id": "mgzu554",
      "body": "I feel like people like us see the real truths, like how the world really is.  I am convinced this planet is some kind of purgatory or realm of hell or something.   Something definitely ain't right.",
      "created_utc": 1741598235.0,
      "score": 13
    },
    {
      "id": "mh1948a",
      "body": "I thought the same way as you, but I hung in there and eventually my shrink got my meds right and a week later I woke up to not just no more suicidal feelings, but I wasn’t depressed at all. My anxiety was also gone. \n\n     From the ages of 17 to 39 I was depressed every day and thought about suicide hundreds of times daily. I did make attempts and was clinically dead a few times but people who shouldn’t have been there showed up and saved me. Eventually I stopped making attempts for the sake of my mother, who does love me very much. But yeah, it took 22 years for me to get out of the seemingly endless dark tunnel, but here I am. \n\n     Now I am working out and losing weight since I had long since given up on taking care of myself. I hope you too can hang in there and eventually either your life circumstances improve or perhaps like me you stumble upon the perfect cocktail of meds. \n\n     But yeah when I say those 22 years were bad, they were unbelievably bad. It’s amazing I’m still here and that I’m glad about that fact. I really hope you guys can hang in there and find a way out. I’m proof it can happen.",
      "created_utc": 1741620114.0,
      "score": 4
    },
    {
      "id": "mgzt7m6",
      "body": "Thats really the only thing keeping me from killing myself,  that I wouldn't want my little brother to be sad.  And I never even see him, he rarely answers my texts (no I'm not mad at him or blame him for anything,  he's busy at work, just saying is all)",
      "created_utc": 1741597638.0,
      "score": 3
    },
    {
      "id": "mgz0zmm",
      "body": "Please keep going for you and your mother. one day youll fidn what makes you happy and youll make yourself proud. trust me ive been through it all. i dont know all of the stories but from what it sounds like you and ur mom dont deserve to lose eachother",
      "created_utc": 1741580728.0,
      "score": 2
    },
    {
      "id": "mgz3dlg",
      "body": "I think about it all the time as well but I find peace in death and also living. I also don’t want to hurt my sisters the pain that would bring them.",
      "created_utc": 1741581877.0,
      "score": 1
    },
    {
      "id": "mgyy4qo",
      "body": "Hey man, it ain't worth it. I had a friend who ended things when I was younger. It's something I'll never forget, there's no coming back, right now you can choose. \n\nChoose life.",
      "created_utc": 1741579441.0,
      "score": -2
    },
    {
      "id": "mgztwyb",
      "body": "I heard that about the parents, I feel like mine could be the sorriest two people on the planet, or at least some of them.  Just ridiculous.  They're the main reason I will never believe in a moral kindof god that loves everyone, what a fairy tale croc of sh|t.",
      "created_utc": 1741598090.0,
      "score": 5
    },
    {
      "id": "mgz13y9",
      "body": "Someone out there would care. the right person to show you ur value is waiting out there",
      "created_utc": 1741580783.0,
      "score": 3
    },
    {
      "id": "mk2o3ra",
      "body": "That's just how humans work. It's not that they can't show they care, it's that they truly don't care until after your heart stops beating. Were just sad for losing one of our own, but we didn't care for that person when they were alive.",
      "created_utc": 1743109920.0,
      "score": 1
    },
    {
      "id": "mgyven1",
      "body": "But one day, we’ll be even older than that. At one point, you really are no longer young.",
      "created_utc": 1741578282.0,
      "score": 11
    },
    {
      "id": "mgzqobw",
      "body": "The truth isn’t always pretty.",
      "created_utc": 1741595948.0,
      "score": 20
    },
    {
      "id": "mgzvac5",
      "body": "For me, one of the lines in John Mellencamp's \"Jack and Diane\" really sum up what life is like for the vast majority of people:\n\"Oh yeah, life goes on,\nLong after the thrill of livin' is gone\"",
      "created_utc": 1741598968.0,
      "score": 11
    },
    {
      "id": "mi2b9v2",
      "body": "You know I ask the same question. Why do poor people reproduce when there life is already shit. I sware bro if I die and its just like a fucking video game or something and I just put it on the hardest level IMA crash out.",
      "created_utc": 1742118394.0,
      "score": 3
    },
    {
      "id": "mgz4yr2",
      "body": "I want to continue but I don't know how much I can take",
      "created_utc": 1741582674.0,
      "score": 2
    },
    {
      "id": "mgztg4e",
      "body": "I had a vision the other day about how sad my brother would be, like for real, and I just can't do it to him.  So I live on despite the pain.",
      "created_utc": 1741597792.0,
      "score": 1
    },
    {
      "id": "mi2kyk6",
      "body": "Every damn day just about are just the worst dreams.  Just woke up from one, just so dark and mean and cold dreams.  I swear this is hell we must be in, what else could it be.",
      "created_utc": 1742124266.0,
      "score": 1
    },
    {
      "id": "mgz7gpe",
      "body": "I get it man. from personal experience life can fuckign suck. but its such a secret blessing that from personal experience I realized id rather desperately find what makes me happy before i desperately end my life. i dont know ur story but thats my advice. i hate giving advice tho because i remember how i used to feel",
      "created_utc": 1741583970.0,
      "score": 3
    },
    {
      "id": "mgzb35j",
      "body": "Reading this back, I didn’t mean to say personal experience so much lol. Just wanted to emphasize that I’m not talking without living through it. Also “man” just meant person. Idk what gender you are my bad",
      "created_utc": 1741585989.0,
      "score": 4
    },
    {
      "id": "mgzvlrl",
      "body": "Thank you for the words I need to hear anything that keeps me alive, I don't care about gender so everything is ok👍",
      "created_utc": 1741599173.0,
      "score": 2
    }
  ]
}