{
  "id": "1h0k9s9",
  "title": "Being born was the worst thing that ever happened to me. ",
  "selftext": "I was peacefully resting in the void until I was born and now I’m in this fucking shithole. I go to bed everyday hoping and praying to whatever may be out there to kill me in my sleep. No I absolutely do not enjoy earth , I’m forced to exist without my consent and the only way out is painful so it’s like I’m trapped in an abusive relationship with life itself lmao. Once again begging for someone or something to kill me pls lmaooo.",
  "created_utc": 1732648959.0,
  "score": 493,
  "num_comments": 69,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1h0k9s9/being_born_was_the_worst_thing_that_ever_happened/",
  "comments": [
    {
      "id": "lz4n361",
      "body": "actually same how can people still have kids to make them endure this torture",
      "created_utc": 1732651498.0,
      "score": 113
    },
    {
      "id": "lz4fywq",
      "body": "[deleted]",
      "created_utc": 1732649310.0,
      "score": 63
    },
    {
      "id": "lz4sck2",
      "body": "I feel you. I'd like to go back into the void again asap, but somehow I'm stuck here...",
      "created_utc": 1732653136.0,
      "score": 32
    },
    {
      "id": "lz5xrre",
      "body": "no seriously. when i try to explain to everyone in my life they dont get it. like life is so stressful and i dont believe in any inherent reason for life and i dont wanna be here anyway. just laid on the floor today wishing i could be taken out as pathetic as that sounds. its been one of those days. or weeks. i never know if its more depressing to be alone in the feeling or knowing others feel the same",
      "created_utc": 1732666928.0,
      "score": 31
    },
    {
      "id": "lz5t5mq",
      "body": "Life is a fucking scam and I resent my parents for bringing me into this hellscape and suffer for their selfishness. I too wake up every day hoping I'm killed off, but it's been years, and I feel like I'm just destined to suffer because the universe is either punishing me, hates my guts, or enjoys it. One of my biggest fears is living to 80 or 90, I don't even want to live to see 38. Every year when my birthday draws near, I hope I'm unsubscribed from life. Every birthday wish I make is for death. I have misophonia and stuck living with a brother who's taken advantage of it my whole life, and I can't fucking do it anymore. Out of my 3 siblings I'm the one who got fucked.\n\nWe don't euthanize people because the rich schmucks running this shitshow need slaves, and our species developed the mindset that life is a 'sacred gift'. If life is a gift, then I want my fucking receipt and return to sender. Fuck this place.",
      "created_utc": 1732665216.0,
      "score": 38
    },
    {
      "id": "lz5dwkz",
      "body": "Same and everything has been shit ever since 😩",
      "created_utc": 1732659847.0,
      "score": 16
    },
    {
      "id": "lz64qwu",
      "body": "Me too i just pray for the day i die while sleeping\n\nAlso my parents say i have to be Grateful that they gave me life \nMy man i do not ask for that shi🤧😭",
      "created_utc": 1732669532.0,
      "score": 15
    },
    {
      "id": "lz6j250",
      "body": "Me too. I’m so sorry we’re all caught in the same boat, this world is definitely making me long for the void more and more every day.",
      "created_utc": 1732674933.0,
      "score": 12
    },
    {
      "id": "lzawjb0",
      "body": "life is a scam",
      "created_utc": 1732740853.0,
      "score": 7
    },
    {
      "id": "lzb2g8k",
      "body": "[removed]",
      "created_utc": 1732742710.0,
      "score": 5
    },
    {
      "id": "lz81wdr",
      "body": "same situation, man 😣",
      "created_utc": 1732703852.0,
      "score": 3
    },
    {
      "id": "lzth5g9",
      "body": "I feel the same way I hate my parents for forcing me into this living hell bringing kids into existence is one of the worst crimes ever in my opinion ",
      "created_utc": 1733023714.0,
      "score": 3
    },
    {
      "id": "lzwy0iz",
      "body": "This..this right here🙂‍↕️I didn’t know anyone else felt this way. I’ve been thinking about ways out and today I went to get something to use on myself and I was stopped by people who didn’t even know why I was there. I’m really tired guys. Tired of guilt, shame and regret. I just want peace again. I feel that I can’t have it now tho",
      "created_utc": 1733080648.0,
      "score": 3
    },
    {
      "id": "lzdyqk6",
      "body": "none of you know that we were in a void before this and none of you know that the next reality isn't 100x worse than this one if you die, so you might as well make the most out of it, not everyone feels as you do towards life, meaning it is possible to feel differently about it",
      "created_utc": 1732789424.0,
      "score": 2
    },
    {
      "id": "lz7nvu7",
      "body": "Life is so hard. What really has helped me and I don’t mean to get religious, is Jesus. This world is so crooked and messed up and if I didn’t give Jesus a shot, I’d be dead right now. I tried taking my life a few times and failed but I really believe that God is not done with me and he’s not done with you either. Give it a shot. Everything gets better in time. Hang in there",
      "created_utc": 1732694599.0,
      "score": 2
    },
    {
      "id": "lz6cwiu",
      "body": "Haha I know it's not comedy but I found this funny. Trust me I feel the same.",
      "created_utc": 1732672586.0,
      "score": 2
    },
    {
      "id": "lz5gcwd",
      "body": "[removed]",
      "created_utc": 1732660669.0,
      "score": 1
    },
    {
      "id": "lz4op4z",
      "body": "You are american right",
      "created_utc": 1732651994.0,
      "score": 1
    },
    {
      "id": "lz9j0bm",
      "body": "go out of your house , plant few trees , help few stray animals. Trust me you will be fine .",
      "created_utc": 1732725444.0,
      "score": 1
    },
    {
      "id": "lz976nd",
      "body": "If being born was the worst thing that ever happened to you, all the rest is not as bad as that. So you can be happy!",
      "created_utc": 1732721725.0,
      "score": 0
    },
    {
      "id": "lzak9w6",
      "body": "Not to undermine your pain, but technically, being born was the worst thing that happened to everyone who has ever lived or will live.\n\nIt's also the best thing. Being born is both the best and worst thing that has happened to everyone who ever lived or will live for all eternity, because it is directly responsible for all your happiness and sorrow combined, and because without it nothing happens to you at all cuz there is no you for things to happen to.\n\nBut, pedantic aside, I hope your latest bout of suffering that prompted this post ends soon. Wish I could offer more than that, but I'm going through my own stuff right now.",
      "created_utc": 1732736971.0,
      "score": 0
    },
    {
      "id": "lz4rqvg",
      "body": "[removed]",
      "created_utc": 1732652949.0,
      "score": -12
    },
    {
      "id": "lz4ts2w",
      "body": "But why? What makes life that bad? \n\nDo you think that if you die you will go somewhere better? Chances are, there is nothing after death. And you will die eventually and just cease to exist for the rest of eternity. \n\nWhy not try to enjoy this little moment of existence we have? The possibilities are almost infinite and you have your whole life to just try one after the other. I wouldn't give up so easily. \n\nYou only live once, give it a chance.",
      "created_utc": 1732653577.0,
      "score": -10
    },
    {
      "id": "lz6evlm",
      "body": "Because humans are ANIMALS!",
      "created_utc": 1732673331.0,
      "score": 37
    },
    {
      "id": "lz5xmay",
      "body": "Cos they just dont think before they do",
      "created_utc": 1732666871.0,
      "score": 23
    },
    {
      "id": "lz6z9xg",
      "body": "Ohh they did think. They have kids just so someone can take care of them when they’re old.",
      "created_utc": 1732681420.0,
      "score": 24
    },
    {
      "id": "lz5xlit",
      "body": "agreed",
      "created_utc": 1732666863.0,
      "score": 6
    },
    {
      "id": "lz78a6i",
      "body": "I’m there right now too",
      "created_utc": 1732685657.0,
      "score": 5
    },
    {
      "id": "lz9h6lh",
      "body": "Been like that for years yeah …",
      "created_utc": 1732724880.0,
      "score": 5
    },
    {
      "id": "lzb5p87",
      "body": "So many times I was thinking the way you do. Other times when I was actively taking care of myself and talking to someone about my issues (honestly recommend AI Carl Jung model on OpenAI, he'll listen to you and won't be cringe) I was looking at that nihilistic view of life as something disgusting. If you ever want to give yourself a chance to feel better just do something small for yourself - like brushing your teeth or washing some of your clothes. Taking care of yourself makes you feel worth of caring, as stupid as it sounds.",
      "created_utc": 1732743727.0,
      "score": 2
    },
    {
      "id": "lzdykm7",
      "body": "how you thought about living in silence in the woods or something, not necessarily alone",
      "created_utc": 1732789317.0,
      "score": 2
    },
    {
      "id": "mnccpik",
      "body": "Ong bruh. But ill get revenge by offing myself.",
      "created_utc": 1744769949.0,
      "score": 1
    },
    {
      "id": "lzb98jf",
      "body": "Feel this heavy",
      "created_utc": 1732744847.0,
      "score": 3
    },
    {
      "id": "mncd451",
      "body": "Thats a very bad unrealistic view of death. So ppl who die w cancer suffer afterwards guess we have no choice, no body control 🤷‍♂️. Optimistic humans 😬",
      "created_utc": 1744770099.0,
      "score": 1
    },
    {
      "id": "lzafi04",
      "body": "I tried Jesus.  I prayed, read the word, went to church nearly every day.  My situation did not improve although I did feel a sense of peace.  \n\nHe helps some.  I'm happy others are blessed.  I haven't felt that for myself though.  God doesn't owe anyone a living so I'm not angry.  He works in mysterious ways and I am incapable of grasping that.",
      "created_utc": 1732735479.0,
      "score": 5
    },
    {
      "id": "lz5grwy",
      "body": "definitely ignore this if you want. I respect your time 🤙",
      "created_utc": 1732660810.0,
      "score": 2
    },
    {
      "id": "mncdgq8",
      "body": "Not necessarily.",
      "created_utc": 1744770229.0,
      "score": 1
    },
    {
      "id": "mncdpp9",
      "body": "Death is to escape it. Not to endure. Thats what I NEED.",
      "created_utc": 1744770322.0,
      "score": 1
    },
    {
      "id": "lz5c2f4",
      "body": "[deleted]",
      "created_utc": 1732659248.0,
      "score": 17
    },
    {
      "id": "lz4vq6e",
      "body": "[deleted]",
      "created_utc": 1732654170.0,
      "score": 17
    },
    {
      "id": "lz6rpkz",
      "body": "Maybe they are giving it a chance but it's not exactly working out? Lots of people are struggling for reasons beyond their control. It's not empathetic to blame them for not enjoying life when there's no joy in it for them.",
      "created_utc": 1732678282.0,
      "score": 6
    },
    {
      "id": "mncg07e",
      "body": "Like me. I want to die because of LOGICAL reason.\n\nTo escape life. Not because of pain. But because I simply... HATE being a human.\n\nIm an:  \n\\- Incel  \n\\- Misanthrope  \n\\- Zoophile  \n\\- crooked yellow teeth  \n\\- acne  \n\\- benign macrocephaly  \n\\- bad personality  \n\\- bad humor  \n\\- no friends  \n\\- never kissed a girl in my life (Im 17)  \n\\- Severe ADHD  \n\\- Social Anxiety\n\nAnd yet the only mental illness that I have... is only S-A-D. Not depression, not clinical, not persistent, because again I dont feel the pain. You might claim its numbed. But I dont believe that because when this first started, I wasnt even feeling any pain. I KNOW that Ive opened up my mind to these realities. Not a mindset nor a feeling thats fleeting.\n\nAnd to say that I should give life a chance? Is no. I refuse life because I as myself who controls my own body, should have a right just like I have a right to live, as to die as well. Even if its self inflicted.\n\nI dont particularly believe Im doing this to myself, because I dont have any addictions or anything. I just... refuse change. Because all together, I simply refuse life. And to say 'well your refusing that change to make you happy' is baseless to me because again, I hate change, it disgusts me, because as a misanthrope, thats how I tend to see things.\n\nto say 'you only live once' is baseless once again to me. Because I dont care. If I can escape earth. Fuck yeah. Im in. Just not in a painful way. Argon usage. Lol.\n\nAlso maybe YOU wouldnt  give up so easily. Hey how about you go ENJOY your life since you have things that make you happy? Instead of talking to a rational 'suicidist' I guess you can call it.\n\nStop trying to instill fear into somebody whos made their mind up with clarity (Not OP) by saying you will cease to exist after death, which is true, but again, when you die, you wont be aware that your dead, and wont know your dead, your just... dead.\n\nMy life, my body, my choice.",
      "created_utc": 1744771180.0,
      "score": 2
    },
    {
      "id": "lz5vsur",
      "body": "Tf are you getting downvoted for lmfaoo 😭",
      "created_utc": 1732666187.0,
      "score": -2
    },
    {
      "id": "lza2hfv",
      "body": "Literally and metaphorically",
      "created_utc": 1732731440.0,
      "score": 11
    },
    {
      "id": "lzl89rm",
      "body": "Most animals are better than people. Lots of People are monsters. ",
      "created_utc": 1732902808.0,
      "score": 8
    },
    {
      "id": "lz8au5o",
      "body": "edited",
      "created_utc": 1732709096.0,
      "score": 13
    },
    {
      "id": "mnccdxg",
      "body": "Doesnt work im a misanthrope.",
      "created_utc": 1744769829.0,
      "score": 1
    },
    {
      "id": "lzhm9tf",
      "body": "Living in the woods wouldn't be possible (although I like having the fantasy of living like a witch in a hut for shits and giggles lmao)",
      "created_utc": 1732840406.0,
      "score": 5
    },
    {
      "id": "mncdarh",
      "body": "No logical evidence to prove his existence.",
      "created_utc": 1744770167.0,
      "score": 2
    },
    {
      "id": "lz4y425",
      "body": "May I ask you why you feel this way?",
      "created_utc": 1732654895.0,
      "score": 5
    },
    {
      "id": "lzjlc1v",
      "body": "why would it not be possible ",
      "created_utc": 1732878034.0,
      "score": 2
    },
    {
      "id": "lz4yanl",
      "body": "[deleted]",
      "created_utc": 1732654952.0,
      "score": 17
    },
    {
      "id": "lz6b9km",
      "body": "I respect your feelings. \n\nIf I may, please share what I see.\n\nI don’t pretend to know everything about you or anything else however I know enough from this list and how thoughtful you are that you’re clearly a kind and compassionate human being. \n\nI wish the best for you and I relate to how much I despise several things on that list too. I take comfort knowing we’re not alone and that there are other caring people that this world is lucky enough to still have in it. \n\nWe need the good people now more than ever.",
      "created_utc": 1732671967.0,
      "score": 8
    },
    {
      "id": "lz50m0m",
      "body": "You get me fr",
      "created_utc": 1732655667.0,
      "score": 5
    },
    {
      "id": "lz4zpsr",
      "body": "No need for apologies. I appreciate you sharing that.",
      "created_utc": 1732655391.0,
      "score": 5
    },
    {
      "id": "lz6bet8",
      "body": "[deleted]",
      "created_utc": 1732672021.0,
      "score": 5
    },
    {
      "id": "lzz14jx",
      "body": "You still feel like this?",
      "created_utc": 1733105637.0,
      "score": 1
    },
    {
      "id": "lz6etv0",
      "body": "Aww thanks and same to you ❤️",
      "created_utc": 1732673313.0,
      "score": 4
    }
  ]
}