{
  "id": "1io2z89",
  "title": "Friend killed himself and I’m starting to understand why",
  "selftext": "It was back in 2021. He was a great friend, had a wife and kids. He’d always struggled with mental health and was honest about it, but towards the end he really hid what was going on. \nHe told us he was going on a trip with friends, but he booked a hotel and took all of his medication. He died. It was pretty horrible.\n\nAt the time I couldn’t understand how he could do that, especially to his wife and kids.\nBut I get it now. \nI’m too scared to overdose because of the horror stories, but it worked for him. \n\nI wish there was an easy way out that didn’t make everyone around you hate you. It sucks.\n",
  "created_utc": 1739397450.0,
  "score": 562,
  "num_comments": 34,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1io2z89/friend_killed_himself_and_im_starting_to/",
  "comments": [
    {
      "id": "mcg1ys3",
      "body": "I hear you. 🥺 Usually pills aren't successful but who knows what he took.",
      "created_utc": 1739398283.0,
      "score": 150
    },
    {
      "id": "mcjbhym",
      "body": "There’s no “easy” way to go, but pills can be extremely painful and if you survive can have a lasting impact on your body.\n\nI definitely feel that last line in your post. The only reason why I haven’t done anything is due to a multitude of reasons, the main ones being my friends and the fact that every single way you could end your life comes with risks that I’m not willing to take. \n\nI’m sorry for your loss.",
      "created_utc": 1739448069.0,
      "score": 24
    },
    {
      "id": "mchgdyo",
      "body": "[removed]",
      "created_utc": 1739414343.0,
      "score": 76
    },
    {
      "id": "mciytrx",
      "body": " Sending you a hug, I lost someone in 2020 and almost lost my fiancé man there’s some decisions that we ca not understand but I can tell you that die it’s one of these that you can’t take back or fix, it’s the biggest one",
      "created_utc": 1739440814.0,
      "score": 6
    },
    {
      "id": "mcjl9ux",
      "body": "I wish I wouldnt have to die alone",
      "created_utc": 1739452308.0,
      "score": 6
    },
    {
      "id": "mckcqkn",
      "body": "i respect you for seeing yourseld from the lens of an outsider by looking at his death.",
      "created_utc": 1739461445.0,
      "score": 5
    },
    {
      "id": "mcg2eeg",
      "body": "I hear you. 🥺 So sorry for your loss. Usually pills aren't successful but who knows what he took.",
      "created_utc": 1739398408.0,
      "score": 16
    },
    {
      "id": "mcltztd",
      "body": "My exes brother killed himself in 2003, and at first I was so mad at him because I saw what it did to his family, but as time went on I started to actually be able to see it from his perspective, and I know in my heart that he truly didn't realize the impact his death would have on his family. To me, in a way, that still hits me harder than his actual death. Knowing he went without realizing how much we all loved him.\n\nIf there is anything to be learned from suicide, it's that we are almost always much more loved than we know.",
      "created_utc": 1739476432.0,
      "score": 4
    },
    {
      "id": "mcjp1sa",
      "body": "The strongest thing someone can do, is to choose to keep living when they really don't want to. Things may seem grim/bleak/terrible, but they will/often get better. You just need to be around for when it happens. As someone who has lost many friends and family members, I can say without a doubt that yours want to hear what's going on with you rather than a eulogy or obituary. Please stick around, it can only rain for so long before the sun comes back out.",
      "created_utc": 1739453735.0,
      "score": 3
    },
    {
      "id": "md22fi2",
      "body": "You are making an accurate observation. Find safe people and avoid cowards that run away from their friends because they don’t have empathy ",
      "created_utc": 1739704739.0,
      "score": 1
    },
    {
      "id": "md41xuc",
      "body": "Same thoughts I had when my aunt and a few acquaintances took their own lives. Most of them seemed to be doing alright, but as time passed I realised it was only a superficial impression",
      "created_utc": 1739730455.0,
      "score": 1
    },
    {
      "id": "mdjpoyr",
      "body": "Soo sorry for your loss of your friend",
      "created_utc": 1739932637.0,
      "score": 1
    },
    {
      "id": "mch2eib",
      "body": "[deleted]",
      "created_utc": 1739409713.0,
      "score": -11
    },
    {
      "id": "mdmjwzy",
      "body": "there is no easy way (full stop)",
      "created_utc": 1739978450.0,
      "score": 2
    },
    {
      "id": "mcilruq",
      "body": "Taking pills sounds fine and cool until you actually try it. So, you won’t die right away, but you will sit there and wait…knowing you might die in a few minutes. That wait time is quite scary, at least it was for me.",
      "created_utc": 1739432499.0,
      "score": 30
    },
    {
      "id": "mci3yxk",
      "body": "[removed]",
      "created_utc": 1739423183.0,
      "score": 28
    },
    {
      "id": "mcikci2",
      "body": "from someone who has tried with pills, it’s not worth it, trust me. i wouldn’t say it gets better in a cliche way, but it becomes more bearable and you begin to see the light of day. it takes time tho brother :)",
      "created_utc": 1739431646.0,
      "score": 10
    },
    {
      "id": "mciw9dx",
      "body": "I don’t know what he took. I just know he was on very strong antidepressants, and he look a LOT",
      "created_utc": 1739439193.0,
      "score": 6
    },
    {
      "id": "mckw0yj",
      "body": "Did you find out the pills?",
      "created_utc": 1739466900.0,
      "score": 1
    },
    {
      "id": "mdmjzuh",
      "body": "we all do",
      "created_utc": 1739978473.0,
      "score": 1
    },
    {
      "id": "mcurk2w",
      "body": "[removed]",
      "created_utc": 1739594235.0,
      "score": 2
    },
    {
      "id": "mcojga2",
      "body": "Thanks for putting the 'often' there; I've been varying degrees of suicidal for over a decade and it hasn't gotten better, in a lot of ways it's gotten worse. There's nothing I've lived through since I was 14 that makes me feel glad I didn't kill myself then. Everyone says 'it'll get better' so confidently when what they really mean is that in killing yourself you prevent the option of it ever getting better. As long as you're alive it theoretically 'could' get better. But I mean just look at the state of the world though..",
      "created_utc": 1739508121.0,
      "score": 8
    },
    {
      "id": "mckblbm",
      "body": "[deleted]",
      "created_utc": 1739461116.0,
      "score": 0
    },
    {
      "id": "mciltzz",
      "body": "[removed]",
      "created_utc": 1739432534.0,
      "score": -2
    },
    {
      "id": "mciqxx1",
      "body": "[removed]",
      "created_utc": 1739435730.0,
      "score": 12
    },
    {
      "id": "mckw4e0",
      "body": "It’s not sad, this world is messed up",
      "created_utc": 1739466926.0,
      "score": 10
    },
    {
      "id": "md41jzm",
      "body": "Eh depends. If you have a chronic physical or acute mental illness there's only so much love can do. I was in a very happy relationship and definitely felt loved by them, but my depression still caught up regardless",
      "created_utc": 1739730347.0,
      "score": 4
    },
    {
      "id": "mcruj9x",
      "body": "The world is going to do whatever it wants to. You need to focus on you and the things in your control. I've had my fair share of ideation and attempts. I lost a lot of friends in Afghanistan. I lost even more when we came home. Look out for your friends. Focus on things within your control. Don't worry about things outside of your control. Things may get worse, but more often than not, they do get better. Don't use a permanent solution for temporary problems. We all want you around. I don't know you, but I know you're loved by those around you. Reach out, please.",
      "created_utc": 1739558322.0,
      "score": 1
    },
    {
      "id": "mckqtp0",
      "body": "Because people in this sub are suicidal and they want understanding (commiseration, usually by those who are also suicidal). Many feel judged by “normal” healthier people who try to dissuade them from suicide. It’s the “misery loves company” thing.",
      "created_utc": 1739465446.0,
      "score": 3
    },
    {
      "id": "mcimia0",
      "body": "I don’t want to get into specifics to give people ideas, but alcohol mixed with certain other sedatives.",
      "created_utc": 1739432948.0,
      "score": 14
    },
    {
      "id": "mcmyuy9",
      "body": "This. Even though I want to die, it makes me sad when I hear someone else does. I don’t want anyone on this subreddit to die. Maybe it’s me just being selfish (I can die but you’re not allowed to, ha), but hopefully we can find another way to escape the pain of living in this shitty world other than death.",
      "created_utc": 1739488193.0,
      "score": 5
    },
    {
      "id": "mcnba2y",
      "body": "Well said. No one wants to hear this cliché “it will get better” crap because in all honesty, it might not. I’ve been depressed since I was 18, and now I’m 38 and things have only gotten worse. I don’t judge others who have suicidal thoughts because I have them myself. I do wish there was another way out of this life, but it gives me comfort knowing that if things get bad enough, taking my life is an option.",
      "created_utc": 1739492276.0,
      "score": 2
    }
  ]
}