{
  "id": "1hvckwc",
  "title": "“You’re not alone” is the biggest bullshit ever ",
  "selftext": "I am alone. I’ve always been alone and I’ll always be alone. Being told that I’m wrong and actually there is some mythical person in the world who gives a shit about me is like telling me that Santa Claus loves me. It’s bullshit. I have no friends and my family doesn’t give a fuck about me. Nobody in the rest of the world cares. Everyone just cares about themselves and there is no such thing as empathy or basic human kindness or whatever bullshit. It doesn’t exist. \n\nIt’s embarrassing when I have to make some bullshit “suicide plan” so I can reassure some doctors who don’t actually give a shit that I won’t kill myself, and they ask me to list people who I can talk to when I’m in a crisis and I cannot come up with a single fucking name. And they’re always like “ohhh that’s so sad, really, you don’t have anyone? You can’t think of anyone?” Nope. It’s like they can’t fucking fathom that someone doesn’t have any support system. That never happens in magical happy doctor land. And then the “suicide plan” that I’m forced to make is never mentioned again, and I just go on with my merry life all by myself as usual. It’s such Bull Shit with a capital fucking B. No one actually gives a fuck.\n\nIt’s great how I live every day wanting to kill myself and if I show any sign of not being happy I either get screamed at and berated or I get fake sympathy from people who forget about me the second after I stop talking to them. Nobody actually cares. I could kill myself and I doubt anyone would even notice for a while. Everyone will just go on with their merry little life and I’ll be forgotten. I can’t wait for that to happen, because existing in this bullshit life just sucks. Every day sucks and it gets worse every day. What is the fucking point \n",
  "created_utc": 1736204415.0,
  "score": 716,
  "num_comments": 96,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1hvckwc/youre_not_alone_is_the_biggest_bullshit_ever/",
  "comments": [
    {
      "id": "m5t5g4x",
      "body": "[removed]",
      "created_utc": 1736217836.0,
      "score": 133
    },
    {
      "id": "m5t81c9",
      "body": "I feel you, man. If I were to die today (not even necessarily suicide) I would want NO ONE from my past to pay tribute or crocodile tears or whatever. I’ve gone through some stuff where almost everyone I’ve ever known knew I was going through it. Many people know me as the ‘mental patient’ because I’ve had a few nervous breakdowns over the years where I never hurt anyone and were ultimately not that big of a deal. No one has ever followed up or checked up on me in the years since, and I mean years and years. Childhood friends. People you think you’ll just always be in touch with in some way. And if I do happen to run into them? You can always sense it. They don’t give a fucking shit. It sucks. Wish I had some contrived platitude for you, but I don’t. It’s just how people are, and some of us are just very unfortunate in our ostracism.",
      "created_utc": 1736218729.0,
      "score": 37
    },
    {
      "id": "m5sh7a5",
      "body": "I feel u. And ur not wrong for acknowledging this. Hate those posts that r like \"if no one cares, just know that I love u even tho I dont know u at all\" like stop lying to urself and me.",
      "created_utc": 1736209665.0,
      "score": 88
    },
    {
      "id": "m5t6tc2",
      "body": "I understand where you're coming from. I've never truly felt loved in my life other than my mother who died 29 years ago. I have one friend because most people exhaust me with their bs. People will use you once they get a hold of you so I feel we're better off alone. I've been married twice and they both abused me in different ways. Besides when I get all bent out of shape and need to throw a fit in my home I don't want someone yelling at me to shut up and I always feels so much better afterwards.",
      "created_utc": 1736218308.0,
      "score": 12
    },
    {
      "id": "m5uzlc4",
      "body": "People say \"you're not alone\" but when you actually reach out to them they aren't available 🤦‍♀️🤦‍♀️🤦‍♀️",
      "created_utc": 1736252055.0,
      "score": 8
    },
    {
      "id": "m5sy8yx",
      "body": "It's bs for real. I'm done with people.",
      "created_utc": 1736215341.0,
      "score": 16
    },
    {
      "id": "m5st65d",
      "body": "Yes, we are alone. People do have empathy sometimes, and some may really care, but we are always on our own. That is a basic assumption—granted, a depressing one, but also one that is realistic and thus protective in moments of pain and distress. That does not mean we shouldn’t seek out help, or desperately ruminate over being alone. Sometimes there are poeple such as friends, family, therapists who can give their best to be there for us. It is really not a black and white scenario. But operating under the assumption that we are on our own means that, ideally, we can strengthen our resilience and use our resources to nurture more self-love, self-care, self-compassion. All the best for you.",
      "created_utc": 1736213632.0,
      "score": 17
    },
    {
      "id": "m5wb7n0",
      "body": "Good rant. Just hang in there. The world needs more people to call the mental health system on its shit.",
      "created_utc": 1736268872.0,
      "score": 5
    },
    {
      "id": "m5u6qc1",
      "body": "Everyone is alone. That's the truth. Even if you have others around that care for you, ultimately everyone is so caught up in their own pain and worlds, we have to carry ourselves for the most part. This world is lonely and cruel. Anyone who says otherwise is lying or too dumb to realize it.   \nI wish I was dumb and happy lol",
      "created_utc": 1736234182.0,
      "score": 9
    },
    {
      "id": "m5tjek5",
      "body": "Most people suck but not all, in 2019 I was done with life, had my plan, wife was dead, I was dealing with Autism, ADHD and Bipolar, plus 7 days after wife died I was diagnosed with bowel cancer, mum was in late stage dementia, nearly everyone avoided me, so I was travelling down a road/countdown to the day I finished it all.\n\nOne person a gamer friend on steam who lived on the other side of the world stayed up late every night for me to wake up and checked in on me, (we didn't game because I hadn't been able to game since my Wife died) but this guy all the way over in Australia with his own problems his own challenges every single night waited for me to wake up and just sent me a message.\n\nin the end I was \"lucky\" they removed 40% of my bowels which while I was in hospital made me realise I wasn't a failure for not curing my wife's cancer, those weeks on hospital alone made me realise how much i'd done for her just being there for DR's appointments and hospital that she never went through it alone.\n\nOh that didn't fix it, my bipolar meant I was naturally depressed all the time, i'd lost my anchor, but thank fully a new mental health consultant took over my case and turned things around for me (using my computers, games, audible books and many other things to help me function) I'm still frucked leaving the house is a challenge, everything I do has a coping strategy, triggers and issues are everywhere but I'm still here.\n\nAnd you know what I now have 6 friends, its taken 6 years, 6 real friends, all met online or through vrchat or through games, two of them have visited me at home, one visits regularly every month and we spend the weekend eating chinese food (and suffering for it later due to our bad stomach issues)  playing games and watching anime :D he bought me 13 hentai games on steam for Christmas :D.\n\nThe others live too far away to visit but they have accepted me for who I am, accept my issues and when i mess up or go into a spiral, don't try to change me but do try to help me improve.\n\nin the beginning of 2019 my only options were end of line or hospitalization and while my limitations are vast, I am classed as a non functioning autistic outside of my safe spaces, I now have actual friends and im so glad I didn't end it.\n\nI'm not telling you this to paint a perfect picture or to show it as your future, not grand standing or anything, im saying that I can personally state that there is some good people out there because I wouldn't be here without them.",
      "created_utc": 1736222842.0,
      "score": 4
    },
    {
      "id": "m5w4p7o",
      "body": "this is exactly EXACTLY how i feel down to every word",
      "created_utc": 1736266953.0,
      "score": 4
    },
    {
      "id": "m5xtf5z",
      "body": "I felt this in my soul. Can we stop with all the cliches, and guilt tripping, and “yeah but” scenarios. My pain is not your pain is not my pain. Can we just agree that living in  this century is like a bad dream? There are so many things worse than death, and sometimes suffering daily makes me want to just say fuck it. Some days I can’t decide if I’m a coward for staying in this world, or wanting so desperately to leave it almost everyday. Why am I like this? Sending a little piece of the small light I still have left in me.",
      "created_utc": 1736284543.0,
      "score": 4
    },
    {
      "id": "m5zqnyt",
      "body": "I wish people understood that those of us with cursed lives exist.",
      "created_utc": 1736307098.0,
      "score": 3
    },
    {
      "id": "m5vt38p",
      "body": "[deleted]",
      "created_utc": 1736263425.0,
      "score": 3
    },
    {
      "id": "m5w5txn",
      "body": "Great post I am so fucking sorry and relate so much f*off it won't ever get better and no there's nobody for us. If I die tomorrow only my f* dad will be invited to the funeral the other narcisstic idiots can stay f* away.",
      "created_utc": 1736267287.0,
      "score": 3
    },
    {
      "id": "m5w8f8t",
      "body": "This is extremely true. Like, nobody actually cares, hello?!??? It’s just me, myself, and I, and my thoughts. It’s just dark and lonely, and we are all alone. ",
      "created_utc": 1736268051.0,
      "score": 3
    },
    {
      "id": "m5xwm7e",
      "body": "World full of lies",
      "created_utc": 1736285452.0,
      "score": 3
    },
    {
      "id": "m5yb635",
      "body": "I think lots of people in the world feel this way and have a similar experience. If we all met I bet some of us might care for some of the others. Maybe you haven't met all the people in this world who might care about you one day. I hope you find someone. I hope we all do. ",
      "created_utc": 1736289784.0,
      "score": 3
    },
    {
      "id": "m5zjpok",
      "body": "if i were not alone and anyone did care i think i would've known that",
      "created_utc": 1736304594.0,
      "score": 3
    },
    {
      "id": "m63q92i",
      "body": "I don’t know why people say this. It doesn’t make anyone feel better and we are alone.",
      "created_utc": 1736366160.0,
      "score": 3
    },
    {
      "id": "m645xqv",
      "body": "Empty words help nobody in the long term\n\nPeople need to learn this\n\nInstead, people must look to encourage practical actions that will improve someone in a state like this.",
      "created_utc": 1736370724.0,
      "score": 3
    },
    {
      "id": "m5t7vep",
      "body": "I suffering from something very similar as you. \nWhile I was just planning my suicide. I was like hanging is good option. If done properly. But idea that you are not alone mean is that you are really not alone other people like a lot of here in this group suffer same. We are just not together in this world. We are group but we exist and those who experience it can feel it for others. I feel your pain brother and it is real. I just hope you get inner joy and happiness that you deserve. I have zero courage to commit suicide at the moment but pain I am having is not bearing I have mental health issues",
      "created_utc": 1736218673.0,
      "score": 2
    },
    {
      "id": "m5zmlnh",
      "body": "I agree, people already have their own problems to deal with.\nMy current companions are sheets of paper (which make me more angry) and talking to people (do you want something more pathetic than that?)",
      "created_utc": 1736305602.0,
      "score": 2
    },
    {
      "id": "m5zqiuf",
      "body": "I feel you, and you're not wrong for acknowledging this. I hate those posts that are like, 'If no one cares, just know that I love you, even though I dont know you at all,' like stop lying to yourself and me.",
      "created_utc": 1736307044.0,
      "score": 2
    },
    {
      "id": "m60fkvn",
      "body": "If we started to adopt the mindset that most of everybody feels alone a lot of the time and that it’s normal for humans to feel this way, then we can put the pieces together and figure out that being alone is not that bad. It’s hard to care about others when they’re struggling as well. So it’s all about self-care and self-love and self-improvement when you’re feeling lonely.",
      "created_utc": 1736318308.0,
      "score": 2
    },
    {
      "id": "m64yqbz",
      "body": "Also \"it gets better\". Fuck off with that, honestly.",
      "created_utc": 1736379548.0,
      "score": 2
    },
    {
      "id": "m67ty8a",
      "body": "That’s honestly so real, i, realistically, have no one to talk to",
      "created_utc": 1736427354.0,
      "score": 2
    },
    {
      "id": "m6de0cb",
      "body": "Most adults are on their own in life. Their family lives far away and their friends are just work colleagues and they are best for small talk, nothing else. Don't take it personally because it's quite rare someone will actually care",
      "created_utc": 1736496323.0,
      "score": 2
    },
    {
      "id": "m6pdtql",
      "body": "It's even sadder when the same people who say that end up leaving. They'll say you're not alone and that they'll always be there and then POOF",
      "created_utc": 1736661489.0,
      "score": 2
    },
    {
      "id": "m6vjune",
      "body": "I agree. I have no one to talk to and if I do that’s all I ever get but no one ever shows they actually care. I hate my life more than I can handle sometimes. The only reason I’m here is for my dogs but they’re getting old and way past their life span for pit bulls. I think about it every day and wish I would have died in Afghanistan when I was deployed. I try to be happy and hopeful but life crushes me ever second it can.",
      "created_utc": 1736745321.0,
      "score": 2
    },
    {
      "id": "m5trpkd",
      "body": "Preach. You couldn't have expressed it better",
      "created_utc": 1736226361.0,
      "score": 2
    },
    {
      "id": "m5ub200",
      "body": "Either they mean \"there are people that care about you\" which they can't know is true, and anyway having people care doesn't automatically help. Or they mean \"there are other people feeling this way\" which like... yeah",
      "created_utc": 1736236836.0,
      "score": 2
    },
    {
      "id": "m5vhhg9",
      "body": "Sabotage the system.",
      "created_utc": 1736259512.0,
      "score": 2
    },
    {
      "id": "m5vn6f3",
      "body": "lets end it all together",
      "created_utc": 1736261501.0,
      "score": 2
    },
    {
      "id": "m5wnrhv",
      "body": "Wish I couldn’t relate to this.",
      "created_utc": 1736272531.0,
      "score": 2
    },
    {
      "id": "m5vuaow",
      "body": "What do you mean by \"having no friends?\" Or \"nobody cares?\" Genuine question.",
      "created_utc": 1736263803.0,
      "score": 1
    },
    {
      "id": "m5wun32",
      "body": "What if these other people are just other forms of ourself? \nDoes my self hatred that I learned from them just run THAT deep?\nOn the upside, it will be over for us someday. And I hope that reincarnation is just BS. Endless oblivion sounds really appealing and has for decades now.",
      "created_utc": 1736274523.0,
      "score": 1
    },
    {
      "id": "m6z0zou",
      "body": "I am alone and will kill myself shortly. Grown up loser and quitting this fucked up game. I consider it a win I’m not hurting anyone on the way out.",
      "created_utc": 1736797538.0,
      "score": 1
    },
    {
      "id": "m5sm9gy",
      "body": "I get what you're saying. Really do..the amount of therapy I've had and I still have 1 singular friend.  I am alone too. I have family but the loneliness never escapes you. Its what we have to do within ourselves that makes the difference. F what your horrible brain thinks. Next time it tells you you're better off dead scream back and say F YOU. We are addicted to feeling this way. Its not your fault. But dying is a shitty temporary solution. When you've been close to death you realise that. It doesn't stop the suicidal thoughts not at all. Our brains are programmed to think that way. I genuinely wish I could meet you all. I'm not healed in any way but I have children that rely on me to stay alive. You think you're worthless but you're not. Suicidal people are the most nicest genuine people I have ever met. I get told myself but can't believe it. But you are. You all are.",
      "created_utc": 1736211339.0,
      "score": 1
    },
    {
      "id": "m5t9uc9",
      "body": "Are you okay?",
      "created_utc": 1736219360.0,
      "score": -2
    },
    {
      "id": "m5t1d1o",
      "body": "[deleted]",
      "created_utc": 1736216418.0,
      "score": -7
    },
    {
      "id": "m5uc6jd",
      "body": "[removed]",
      "created_utc": 1736237549.0,
      "score": 36
    },
    {
      "id": "m5usjye",
      "body": "[removed]",
      "created_utc": 1736248199.0,
      "score": 20
    },
    {
      "id": "m5stlwr",
      "body": "Yep, those are really dumb and dishonest. Moderation team should be more wary, I don’t know why they’re not as present in the sub as they were.",
      "created_utc": 1736213779.0,
      "score": 31
    },
    {
      "id": "m5ttupp",
      "body": "Even though they might not mean it, they still say it with good intentions. I don't know about everyone else, but when i was severely depressed, hearing things like that actually helped me. Because it gave me a sense of relief that i am not the only one going through all this. Many others like me are facing the same issues and battling every day. I just kinda feel less lonely. Sorry if it offended you.",
      "created_utc": 1736227347.0,
      "score": 8
    },
    {
      "id": "m5tbmtc",
      "body": "Why is that a lie? Empathy and solidarity are human values. They are literally our adaptation nature gifts us with. It’s how we survive, by having the emotional tools to cooperate together at scale.\n\nIt’s entirely human to feel empathy and solidarity with a person we don’t know. \n\nParticularly when that person is suffering something we do know. It’s just simple, pure humanity to say, I know this suffering, and I want no one to continue through it.\n\nThat is, in fact, just love.",
      "created_utc": 1736219986.0,
      "score": 8
    },
    {
      "id": "m5tcehf",
      "body": "I think this is an offshoot of how this society teaches people to operate as individuals. No, nobody in any natural state of things would be eternally alone, forced to live in emotional self sufficiency all damned day. \n\nThat is a creation. It is a malformed creation of this society which does that. It abandons people who are suffering to their own whims and heart and weight of self. \n\nWe are left alone. We need not, should not, be left alone. And if this society were healthier, we’d have the people we need. But it probably will never get healthier, so we will not have the contact, reliance, and empathy we need.",
      "created_utc": 1736220261.0,
      "score": 13
    },
    {
      "id": "m6de5gu",
      "body": "This advice is great for anxiety and terrible for depression",
      "created_utc": 1736496411.0,
      "score": 4
    },
    {
      "id": "m6amypg",
      "body": "i feel the same. each breath you take is your own. ultimately you will always be alone. i feel extremely vulnerable and hurt by the world. ",
      "created_utc": 1736458505.0,
      "score": 2
    },
    {
      "id": "m5wye1q",
      "body": "I mean that I have no friends and that nobody cares",
      "created_utc": 1736275598.0,
      "score": 7
    },
    {
      "id": "m5yckdh",
      "body": "I'm jealous of your one friend and family. ",
      "created_utc": 1736290214.0,
      "score": 4
    },
    {
      "id": "m5uj5dx",
      "body": "Ik you have good intentions but to be honest at this point that's a dumb question to ask I'm ngl",
      "created_utc": 1736242158.0,
      "score": 6
    },
    {
      "id": "m5usye2",
      "body": "This is absolute NONSENSE and helps no one",
      "created_utc": 1736248436.0,
      "score": 6
    },
    {
      "id": "m5ti85s",
      "body": "You spout bullshit just like anyone else. How do you able to say you care? You did nothing and know nothing",
      "created_utc": 1736222385.0,
      "score": 6
    },
    {
      "id": "m5vnaes",
      "body": "[removed]",
      "created_utc": 1736261539.0,
      "score": 23
    },
    {
      "id": "m5uec45",
      "body": "[removed]",
      "created_utc": 1736238954.0,
      "score": -11
    },
    {
      "id": "m5trevj",
      "body": "You confuse a lot of concepts, although you seem well-intentioned. I agree with you re empathy. But empathy is not love. If you think that telling a stranger online that you love them is genuine love, I really have no way or interest to prove to you that cannot be the case.",
      "created_utc": 1736226225.0,
      "score": 25
    },
    {
      "id": "m5y9one",
      "body": "I agree with this so much.  Being seen as independent and needing noone is valued so highly in the west.  If we express loneliness, a need for love and closeness when we have noone, and sadness, we are seen as 'needy,' which has somehow become a dirty word instead of simply being a description of how we feel when our needs are not being met.  If we want a relationship, we are told we have to be completely happy alone first.  I agree that we should not be left alone.",
      "created_utc": 1736289330.0,
      "score": 5
    },
    {
      "id": "m5tpwiy",
      "body": "Don’t think you understood. Alone or being on your own is not the same as being isolated or forced to become self-sufficient. There are people who may care and be there, some are more and some are less lucky in this respect. But seeing onerself as being on your own can give one agency, decrease dependency and sadness (or desperation) in circumstances when one is or feels abandoned.",
      "created_utc": 1736225557.0,
      "score": 3
    },
    {
      "id": "m5yc35t",
      "body": "Honestly seems like natural selection/survival of the fittist. ",
      "created_utc": 1736290067.0,
      "score": 1
    },
    {
      "id": "m6df8zh",
      "body": "Sorry about that.",
      "created_utc": 1736497102.0,
      "score": 2
    },
    {
      "id": "m5z1tx1",
      "body": "But how do you know? Do you literally have 0 contact with anybody on even a semi regular basis?",
      "created_utc": 1736298464.0,
      "score": 1
    },
    {
      "id": "m5uk5au",
      "body": "I think so too but some people wanna hear it nonetheless. Tbh, atp and ngl? Really?",
      "created_utc": 1736242826.0,
      "score": 2
    },
    {
      "id": "m5ws4ry",
      "body": "This is your own personal experience. You were lucky because people took you seriously. This is a luxury which many of us here do not have.",
      "created_utc": 1736273801.0,
      "score": 20
    },
    {
      "id": "m5usq6p",
      "body": "[removed]",
      "created_utc": 1736248303.0,
      "score": 20
    },
    {
      "id": "m6tfajm",
      "body": "Is it that hard to believe?  Are you that naive?  How old are you?",
      "created_utc": 1736718865.0,
      "score": 5
    }
  ]
}