{
  "id": "1i6uhhf",
  "title": "I killed my dad, and I'm not sure how I'm supposed to live anymore",
  "selftext": "A bit of warning before anyone starts commenting on this. I'll likely not be responding a lot as it's taking a lot out of me just to start writing this, but I'll probably be reading most comments. \n\nA month before my 20th birthday my dad got scammed out of a lot of money on a dating website, it made him extremely pissed off and he attacked me with a knife on his way to get a shotgun. I managed to wrestle him to the ground and get the knife off of him without being stabbed, but I wasn't able to keep him from moving closer to grab the knife again. I ended up using the hose of a tire pump nearby to choke him, but in my panic I didn't think to unwrap it after he was unconscious. I ran away and called the cops and my brother.\n\n  \nI stayed outside when the cops got there and I threw up all over the porch when they told me he was dead. I spent the entire night (9-11 hours) in my pajama pants inside the holding area of the police station. When they released me the next morning I no longer had any keys to my house, my phone, any car, nor did my family want to talk to me or help me at all. I ended up having a neighbor help me open up one of the unlocked windows so I could climb in my room and grab a bag of clothes and my laptop which the cops left behind. I have no job, no money, and now I only have my laptop and a duffel bag filled with clothes. My family hates me and the only reason I'm not on the streats is because a good friend took me in. My sister even got a restraining order on me less than 2 days after it all happened. \n\n  \nWithout any way to support myself, and the constant nightmares and hillucinations of my dad, I can just barely get the energy to get out of bed. And relying exclusively on my friend for feeding and housing me just makes me feel even more guilty.\n\n  \nI just can't see a path forward and I'm hoping that maybe someone here will give me a bit of inspiration or hope that things will get better. Hell, even just finding someone with a similar experience to talk to might be nice, makes me feel fucking evil and insane that I killed my dad.",
  "created_utc": 1737496489.0,
  "score": 1419,
  "num_comments": 147,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1i6uhhf/i_killed_my_dad_and_im_not_sure_how_im_supposed/",
  "comments": [
    {
      "id": "m8fgmot",
      "body": "As a person who detests murderers,  you defended yourself, I’m sorry for what happened if it’s true. You’re too young to be dealing with this. ",
      "created_utc": 1737497481.0,
      "score": 1129
    },
    {
      "id": "m8fkfkj",
      "body": "I've been in a life or death situation before, I can understand how things escalate so quickly. You protected yourself the only way you knew how. Don't take your life, you were given a second chance. I'm sending you my whole heart & I hope you can learn to live with this. You deserve a life you love. What happened to you was never your fault friend. I'll be thinking of you.",
      "created_utc": 1737498563.0,
      "score": 514
    },
    {
      "id": "m8fgfr6",
      "body": "I don't think your insane or evil. You did what you had to do to survive. Sorry you were forced into this position and that I dont have more comforting words.",
      "created_utc": 1737497426.0,
      "score": 555
    },
    {
      "id": "m8fw0iq",
      "body": "It was his life or yours. You chose yours. There's absolutely nothing wrong with choosing to live.",
      "created_utc": 1737502036.0,
      "score": 81
    },
    {
      "id": "m8g8lj2",
      "body": "Your father came at you with a knife. He was very, very troubled.  You had every right to protect yourself.",
      "created_utc": 1737505992.0,
      "score": 77
    },
    {
      "id": "m8fzh2t",
      "body": "You didn’t murder your dad. Your dad tried to murder you.  \nIt’s not your fault he ended up dead by his own actions.",
      "created_utc": 1737503123.0,
      "score": 115
    },
    {
      "id": "m8fofq2",
      "body": "This is a very traumatic event to experience. Do you have access to a therapist?",
      "created_utc": 1737499727.0,
      "score": 82
    },
    {
      "id": "m8gj50y",
      "body": "Your father killed himself, he put you in a life and death situation and unfortunately he passed away because of his own choice. \n\nYou can't blame yourself. What you did was a natural consequence of his choice.\n\nAs for how you can live with yourself, you need to learn to accept that you didn't do this, you aren't responsible for his death, he is.",
      "created_utc": 1737509284.0,
      "score": 27
    },
    {
      "id": "m8fkoo3",
      "body": "Fight or flight and you fought because you couldn't run. It's human nature to want to survive in a situation like that and that's all you did.\n\nYour father's mental instability isn't your fault and it's also not your fault you had to defend yourself and leave in a panic. If the cops thought you were evil and unsafe to the public you'd still be sitting in a jail cell.\n\nDefinitely seek out some professional counseling when you are able, it will definitely help to talk to someone trained to help people cope with these kinds of situations.\n\nDon't end your life. You sound like a good person that was dealt a shitty hand with family and this situation.\n\nTry to focus on just being a good person. Say hi and smile to people in public. You'll find that your own self value improves as you are able to make a positive change in other people's days, even if that change seems so small as a smile. Not enough people smile anymore and you can help be that change.\n\nYou'll get through this. At least you have your friend helping you out. If you have no money or job, your first step is to work on that. Start applying for jobs, it will keep your mind busy finding one and working at one.\n\nThere are also suicide lines you can call to ask for advice and help you get past a particularly dark moment if you are having one.\n\nTake it one day at a time.",
      "created_utc": 1737498635.0,
      "score": 54
    },
    {
      "id": "m8fl6bi",
      "body": "I am sorry,  this sounds awful. \n\nMaybe it helps when you write down what you think or experienced. Like how was your dad, why did he try to harm you, how was your relationship to him, how was your life before the incident. \n\nThe guilt of survived is hard, but when you forgive,  you can obtain freedom. You need a trauma therapist,  be careful taking care of your trauma on your own. \n\nYou decide every minute who you are or want to be. Take care.",
      "created_utc": 1737498776.0,
      "score": 24
    },
    {
      "id": "m8fpu7f",
      "body": "You defended yourself and in a moment of adrenaline and anxiety, you accidentally took your father's life. You have to grapple with that reality. But YOU DID RIGHT by defending yourself and dont you let anyone tell you otherwise. As someone who thought that taking the hits without defense would lead to love, you did what you needed to do to protect yourself. Your family won't care because they can't understand, and it is not your job to make them do so. You were the only one who knows what happened and what you had to do to protect yourself. So please do not feel guilty. Stay strong and surround yourself with people you can love and support. Its a long road and it will be alot of thinking and self growth, but youve got this. I promise. Everyone makes mistakes, but it matters most with how you handle that mistake after.\n\nMuch love, internet stranger. I hope to see a follow up post from you in the future of your success! Stay strong!",
      "created_utc": 1737500144.0,
      "score": 17
    },
    {
      "id": "m8fsuki",
      "body": "Oh babe this is the definition of some hardcore horrible trauma. I understand you want relief from the things you’re experiencing, but topping yourself wouldn’t give you that relief. It would stop everything, including the chance to heal from this. \n\nIs there anybody who can help you and advocate for you to help you get some secure housing? I don’t know how things work where you are but here there are systems in place to help. \n\nYou can be okay from this. You were reacting and keeping yourself safe, and shit happened. Not your fault.",
      "created_utc": 1737501061.0,
      "score": 34
    },
    {
      "id": "m8fyo4i",
      "body": "You were defending yourself, the police agrees. \n\nI do have a question, why did he decide to attack you for his mistake? Does he have a history of aggression?\n\nRegardless, he’s the one who got scammed and tried to somehow put it on you.",
      "created_utc": 1737502869.0,
      "score": 15
    },
    {
      "id": "m8g594o",
      "body": "look, there is no way me to fathom how traumatic of an experience that was and how much pain you are feeling right now but just know that you did nothing wrong and just defended yourself; you don't deserve the pain you're going through. take care.",
      "created_utc": 1737504966.0,
      "score": 12
    },
    {
      "id": "m8frcga",
      "body": "you defended yourself. it’s okay.",
      "created_utc": 1737500597.0,
      "score": 13
    },
    {
      "id": "m8g40d8",
      "body": "I am so sorry your family is treating you this way, you do not deserve it. They may be in shock but if they do not come around very soon, please still just try to make your way and you will create new family for yourself. You do need support, please if there is a reputable church (hopefully non demoninational) or social services to see if you can get counselling.",
      "created_utc": 1737504574.0,
      "score": 9
    },
    {
      "id": "m8fz7fx",
      "body": "You did nothing but defend yourself in a life or death situation. At that point, instinct takes over.\nYou're not in the wrong.",
      "created_utc": 1737503038.0,
      "score": 8
    },
    {
      "id": "m8gn6wf",
      "body": "I suggest reaching out to a local hospital or social services and asking for help. You really need mental support right now and your family is not there for you. There are people like nurses and social workers who care and can help support you and help you wrap your mind around this and get on the road to recovering from a traumatic event as well as helping you connect with support for food and shelter. You can use the 211 website or call 211 to get more info on basic resources and maybe mental health resources as well.",
      "created_utc": 1737510572.0,
      "score": 6
    },
    {
      "id": "m8ii8dy",
      "body": "Your dad wanted to kill YOU because he was angry at the fact He was scammed?!",
      "created_utc": 1737541066.0,
      "score": 8
    },
    {
      "id": "m8g8fo2",
      "body": "Survival is a human instinct, those kicked in and you're not at fault. You're anger and grief belongs with your father not with you since he compelled you to fight to the death.",
      "created_utc": 1737505942.0,
      "score": 6
    },
    {
      "id": "m8ht6qt",
      "body": "I think what you’re experiencing is called survivors guilt. Everyone struggles with this so much considering they feel like the event should’ve changed in a way that was more positive rather than being a negative. You have more life in you than it is to end it all. We are rooting for you buddy. Keep your head up and stay strong!!!",
      "created_utc": 1737526459.0,
      "score": 5
    },
    {
      "id": "m8i68pm",
      "body": "Holy shit. Dude, that’s self defense.",
      "created_utc": 1737533656.0,
      "score": 5
    },
    {
      "id": "m8fjo8f",
      "body": "I really feel sad for you to be in this situation but I think its best if you just try and distract yourself and I know this is generic but it helped me with suicidal thoughts",
      "created_utc": 1737498345.0,
      "score": 17
    },
    {
      "id": "m8g22bl",
      "body": "I know words won’t help much. But you were defending yourself and that’s it. I’m so sorry to hear this and the way you’re being treated. 🖤",
      "created_utc": 1737503945.0,
      "score": 5
    },
    {
      "id": "m8hxi5x",
      "body": "You wanted to live and that’s why you did what you did. Because in that moment it was him or you. Remember that when you’re thinking about not wanting to live now… you wanted to live. Keep living for that person who did what they had to do to live in that moment.",
      "created_utc": 1737528703.0,
      "score": 5
    },
    {
      "id": "m8klkvx",
      "body": "My dad would always say that it’s your job to look out for number 1. He died by suicide 10 years ago. He was also an asshole half the time. Complex grief is hard. When things settle down a little it could be good for you to go to a grief group and talk to people, not just about what happened but about who he was etc. so sorry this has happened.  Maybe pick up a copy of man’s search for meaning.",
      "created_utc": 1737567695.0,
      "score": 4
    },
    {
      "id": "m8lkh38",
      "body": "Just wondering, why the F would your neighbour know how to open your fucking window and not you? What’s with dad’s body and the investigation? “I Didn’t have my keys” but you got released? No. They would release you WITH your belongings minus a cellphone if it may be involved.\n\n\nYou are either trolling, schizophrenic or in a manic state and you need to call 911 right now.\n\nIf this is real, obviously you need to go to some serious psychiatry and therapy and not on Reddit asking this question … given the nature of the crime/incident I think someone would be pointing you in that direction and monitoring you so I still don’t believe you.",
      "created_utc": 1737577010.0,
      "score": 5
    },
    {
      "id": "m8fud2c",
      "body": "Wild thing to happen. I remember trying to defend myself from a couple guys but I didn't turn out so lucky as one pulled out and unloaded onto me (pause). Crazy shit happens sometimes and there just isn't anything you can do but try to survive.",
      "created_utc": 1737501527.0,
      "score": 8
    },
    {
      "id": "m8oho40",
      "body": "Mercy what a horrible situation. \n\nI strongly recommend that you seek out a counselor that deals in post traumatic stress disorder. You’ve been through serious trauma, and having to defend yourself in this situation. Sounds like it was grueling. And for it to be a close relative like your father. I am so sorry for this whole situation. \n\nPlease seek out help. Legitimate self-defense is not murder. Nor is it evil. But it certainly is traumatic and is something that will be very difficult to overcome without a combination of therapy and other forms of treatment.",
      "created_utc": 1737611207.0,
      "score": 3
    },
    {
      "id": "m8giia1",
      "body": "This is a great burden you will live with for the rest of your life. However, you did what had to be done. Your back was against the wall and he put you there.\n\nYou can choose to perceive what happened as a second shot at life or as the end of it. That is up to you. Your family is understandably in a state of shock. It was never your fault.\n\nIt was either you and potentially the rest of your family, or him. \n\nThere are many out there who share the same burden and pain that you are feeling. i guarantee that you are not alone.\n\nYour friend is a good friend. I am sure that if he or she felt like you were a threat to anyone, they would have never offered their hospitality.\n\nTrust yourself and know that you are a good person. I trust that you will make the right decision.",
      "created_utc": 1737509087.0,
      "score": 6
    },
    {
      "id": "m8hs5te",
      "body": "My dad told me if he didn't assault my cousin, 2 days older than me, i was going to be his victim. The only reason i wasn't was because i slept in the bed with Mom, because she banned him to the couch or my room due to his snoring. That's kept me awake for the better part of 5 years. While it's NOTHING and i mean NOTHING compared to what you *had* to do and it is *technically justifiable since it is self defense!!* that pain doesn't just \"go away\" and you're gonna have to find a way to cope with it, either that be something worse, or something like i did, which was start cutting strips of paper and making paper stars over and over and over again until you've gone manic. While this may also be horrible advice, it's something i've slowly come to terms with. I'm half a decade in now and i don't cry about it when i think of it, but i do think of him quite often because that's your dad dude, no matter what horrible things happened, *you do love your parents, and deep down, no matter what, even if they don't say it, they knew that too, and they loved you too, even if that loved changed somewhere over the years, it's still a parents love for their child. that's a reason to keep on going.*",
      "created_utc": 1737525943.0,
      "score": 3
    },
    {
      "id": "m8kj0zf",
      "body": "Self defense all the way, if you speak to a therapist be certain that they are trained specifically to help ptsd.",
      "created_utc": 1737567007.0,
      "score": 3
    },
    {
      "id": "m8m4n6w",
      "body": "Honestly your life will only get better with your family out of the picture. The fact they're treating you like the criminal after your dad literally tried to murder you is super scummy. I've heard stories like this before and it's ridiculous. If my family member killed another in self defense I sure as heck wouldn't defend them. Things will get better and try and forget your family exists",
      "created_utc": 1737582395.0,
      "score": 3
    },
    {
      "id": "m8n01ea",
      "body": "I went to jail for defending myself against my father who beat my head in the floor. He got no punishment for abusing me. I ended up living in homeless shelters for a while. It was a very dark period of my life out of many others, but the injustice was just the worst.",
      "created_utc": 1737591993.0,
      "score": 3
    },
    {
      "id": "m8ohup2",
      "body": "It was you or your father, he was the one who tried to do that to you, he was a murderer...",
      "created_utc": 1737611291.0,
      "score": 3
    },
    {
      "id": "m8ow5ic",
      "body": "Oh my god OP….. please please don’t blame yourself. He attacked you with a knife. You did not mean to kill him. I’m so sorry you’re going through this.",
      "created_utc": 1737618995.0,
      "score": 3
    },
    {
      "id": "m8g93sy",
      "body": "Wow brother sorry to hear that .. Are you religious by chance?",
      "created_utc": 1737506148.0,
      "score": 5
    },
    {
      "id": "m8hhcm8",
      "body": "Baby that's self defense, you didn't mean to hurt him so badly. Your will to live kicked in, and got you out the only way instincts know how. This isn't your fault. I'm so sorry you're going through this. Sending hugs and hope you're way.",
      "created_utc": 1737521108.0,
      "score": 5
    },
    {
      "id": "m8geu4e",
      "body": "I don't understand, if the police deemed you not guilty (which you aren't, its self defense) you still can't access your house because someone in your family owns the house now, and they said you got to leave?",
      "created_utc": 1737507926.0,
      "score": 4
    },
    {
      "id": "m8gcdaf",
      "body": "This isn't your fault bud, absolutely shit hand to be dealt. You have a good heart and if you need to talk some time this stranger is available to listen and re-dispense my many failures as advice. I hope you make it through brother.",
      "created_utc": 1737507155.0,
      "score": 2
    },
    {
      "id": "m8gz96x",
      "body": "It’s human instinct to defend yourself. It sounds like it could have easily been you who was killed. Your body knew that and defended itself whether you were fully conscious of what was happening or not.",
      "created_utc": 1737514524.0,
      "score": 2
    },
    {
      "id": "m8hbaqg",
      "body": "Man I’m so sorry that happened, but it was self defense and it sounds like your dad had a lot bottled up after he got scammed. You are most definitely not evil",
      "created_utc": 1737518754.0,
      "score": 2
    },
    {
      "id": "m8hjyou",
      "body": "Also? I’m so sorry you’re having to endure this. You didn’t do anything wrong. You killed someone and I’m telling you that you didn’t do anything wrong. Everyone else is saying it too because it’s true. Your father did this TO YOU. Sending so much love and hugs and compassion.",
      "created_utc": 1737522196.0,
      "score": 2
    },
    {
      "id": "m8hoiqf",
      "body": "People who think they are bad people usually aren't the bad ones. It was his life or urs",
      "created_utc": 1737524204.0,
      "score": 2
    },
    {
      "id": "m8i7qd4",
      "body": "Sounds to me like he most likely deserved it.",
      "created_utc": 1737534563.0,
      "score": 2
    },
    {
      "id": "m8idpxa",
      "body": "The number one issue is you are having a ton of confrontation inside because you are dealing with three different things - the death of your father, feeling guilty for it, and post-traumatic stress. The first step is to think of the alternative - your dad kills you and spends the rest of his life in prison. The second step is to realize that you feeling guilty and being sad for your dad are two separate feelings. \n\nWhat I am trying to say is that you can be sad for your father but feel no guilt because it was a self-defence. \n\nThe sooner you start taking long walks, doing breathing exercises, and finding an exhausting job - the quicker post-traumatic stress starts fading away. That should release pressure from those emotions and help you figure out what's what.\n\nI did not mention the family on purpose - if this is the path they chose - you should focus on pulling yourself together and getting through this on your own or with other people who can help. Coming out a stronger person at the end. What they did was very irrational and it might change as time goes by and if not you should not worry about it altogether.",
      "created_utc": 1737538299.0,
      "score": 2
    },
    {
      "id": "m8igokr",
      "body": "<3 I'm here for you",
      "created_utc": 1737540136.0,
      "score": 2
    },
    {
      "id": "m8ih3th",
      "body": "Oh bless you. You’re still so young. How would anyone know how to deal with that situation? You defended yourself against someone who was clearly intending to hurt you. You must have been feeling so intensely scared - and our brains will normally prioritise our survival. This isn’t your fault. Therapy will help you realise this. Please get yourself some help, and please listen to everyone telling you that what you did was okay in that situation. You’re experiencing ptsd, from what I can tell from your comments here. A therapist will be able to help you through it, and over time flashbacks etc will improve. But it’s not something you’ll overcome by yourself so please look for some help. ❤️",
      "created_utc": 1737540395.0,
      "score": 2
    },
    {
      "id": "m8jzvz2",
      "body": "my dear that is horrible… should never happen to anyone. you just did what every human would do when threatened. people sometimes underestimate how powerful our instincts and will to live are. I wholeheartedly do not think you are a bad person 😢💖",
      "created_utc": 1737561754.0,
      "score": 2
    },
    {
      "id": "m8kc9od",
      "body": "This is so scary and I’m sorry you had to go through this. I’m glad you’re still alive. You had every right to defend yourself. It’s not your fault that he decided to take his anger out on you. It’s gonna take time to get through this. Be patient with yourself. You deserve help. Is your friend able to help you find therapy ? You could probably speak to a suicide hotline and they may be able to connect you with a therapist.",
      "created_utc": 1737565175.0,
      "score": 2
    },
    {
      "id": "m8lznd5",
      "body": "Bro your free now forget the past and go explore all life has to offer, it won’t be easy and there will be cold lonely nights but you’ll find a home, keep pushing man",
      "created_utc": 1737581060.0,
      "score": 2
    },
    {
      "id": "m8mev3f",
      "body": "You were attacked, your life was on the line. The entire situation is fucked all around. But he made it him or you, and you chose you same as any member of your family would have. Your family sounds as abusive as your father was. Let them live in their misery, as fucked up as it sounds. I'm sorry they are being so awful to you in an awful situation. They should be comforting you and leep9ng you close. The fact that they aren't is a reflection and failure of them. Not you.",
      "created_utc": 1737585337.0,
      "score": 2
    },
    {
      "id": "m8o7928",
      "body": "Your Dad tried to kill you. That is horrible. I am sorry this happened to you and it’s certainly not your fault. Hopefully you are not charged with anything and you can find some free counselling and get a new start soon away from where you are. Your Dad’s actions are responsible for taking your world away not yours. Be grateful for your friend and see what you can do to have a new start. It doesn't sound like you have a Mom either so sending you hugs. You have a whole life ahead of you but you need some support to deal the trauma you have been through. Sending you prayers too. You can do this.\nGood luck.",
      "created_utc": 1737606666.0,
      "score": 2
    },
    {
      "id": "m8o7tgz",
      "body": "Search online for free therapy and support places. There should be some not for-profits and sometimes universities also provide it by doctors training.",
      "created_utc": 1737606896.0,
      "score": 2
    },
    {
      "id": "m8prr3u",
      "body": "1. this was very clearly an accident and self defence, you didn’t mean to kill him just make him unconscious for your own safety. you are not a murderer, you are someone who fought like hell to stay alive and unfortunately your dad died in the process, but you did not have the intent to kill him you were just protecting yourself\n2. if anything, i hope you can see how hard you fought to stay ALIVE. despite all of this, despite how you are feeling, you fought to stay alive. that means something, you have to keep fighting. if you survived this, a LITERAL fight for your life, i promise you can take on anything. you are so incredibly strong. if you are really struggling maybe consider inpatient treatment? it will give you a place to stay and you’ll also be safe and protected. i know this isn’t an option for everyone, please just keep yourself safe",
      "created_utc": 1737636773.0,
      "score": 2
    },
    {
      "id": "m8r60x1",
      "body": "Given that what happened wasn't done deliberately, you need to forgive yourself. You were protecting yourself, as anybody would.  This was your dad's fault, not yours. I dont see that you could have done anything different.  As far as forgetting to do something, that's not your fault either.  You were in shock! Forgive yourself and get on with your life.  You've been thru enough.",
      "created_utc": 1737652433.0,
      "score": 2
    },
    {
      "id": "m8i0q8o",
      "body": "[removed]",
      "created_utc": 1737530470.0,
      "score": 2
    },
    {
      "id": "m8hrcj3",
      "body": "It's not your fault at all, and I really hope that you can constantly remind yourself that. Don't end your life over someone who tried to put their hands on you first 💗",
      "created_utc": 1737525542.0,
      "score": 2
    },
    {
      "id": "m8k0921",
      "body": "Literally not how that works. Either this is a LARP (in which case, yeah, reddit is the place to fall for it) or he died of a heart attack.\n\nWhat the hell is \"he was there and there was a... ughhh... hose of a tire pump nearby... yeah... and I... ughhh... grabbed that and put it around his neck and choked him with it but also it stayed there in that position, because I choked him with a tie, and I also forgot to untie it, which if you believe me, you will certainly believe that it was unintentional.\"\n\n...wtf?",
      "created_utc": 1737561856.0,
      "score": 2
    },
    {
      "id": "m8hp1xh",
      "body": "It depends on how much you work towards a life that holds some resemblance of normalcy, but you can start with forgiving yourself.\nYou acted in self-defense and self-preservation.\nIm sorry you have to go through this, and I pray for you. For things to get better, you cant let this hold you back. Let the guilt and remorse from your actions be your motivation to better yourself mentally and physically so it never happens again. I love you gang",
      "created_utc": 1737524450.0,
      "score": 1
    },
    {
      "id": "m8ipkzi",
      "body": "\nFirstly, I want to say how truly sorry I am that you’ve been through something so devastating. What you’ve experienced is beyond difficult, and the fact that you’re still here and reaching out for help shows incredible strength, even if it doesn’t feel that way right now. You’ve survived something unimaginable, and that deserves recognition.\n\nIt’s important to remember that what happened wasn’t your fault. You acted in self-defence in a moment where your life was at risk. Instincts take over in situations like that, and the fact that you are carrying so much guilt now shows the kind of person you are—a person who never wanted this to happen in the first place. But the situation wasn’t created by you; it was forced upon you, and you had no choice but to protect yourself.\n\nYour pain, your guilt, and the nightmares you’re experiencing are all valid, but they don’t define who you are. You’re not evil. You’re not insane. You’re a human being coping with immense trauma and loss, and that takes time. Healing from this will be a long process, but it is possible with the right support.\n\nSeek support from a trauma therapist or free mental health services, and connect with organisations that can help you navigate legal and personal challenges. Lean on the friend who’s housing you, and take things one day at a time—small steps matter.",
      "created_utc": 1737545276.0,
      "score": 1
    },
    {
      "id": "m8j269r",
      "body": "I would highly recommend seeking support. This seems like a right away problem.\n\nIt's ok to go to the hospital if you need it. You might also benefit from partial hospitalization so your condition is stabilized and you leave with a treatment plan. \n\nI've been there and done that. I'm not currently in crisis but I've been  inpatient and partial a few times.",
      "created_utc": 1737551041.0,
      "score": 1
    },
    {
      "id": "m8j7k8s",
      "body": "You weren't at fault op, you were only doing what you had to do to survive..  . Just know that it wasn't your fault, you were the victim and still are since you don't deserve to lose everything for just defending yourself...",
      "created_utc": 1737553052.0,
      "score": 1
    },
    {
      "id": "m8j8i2w",
      "body": "How much money? I’m always curious how much money would make someone do that",
      "created_utc": 1737553388.0,
      "score": 1
    },
    {
      "id": "m8je47c",
      "body": "He tried to kill you, twice, on purpose. You did not try to kill him on purpose, what happened to him was not your intention it was an accident. Im sorry your family suck, but at least you have a good friend. Please speak to a doctor and try to get some short term meds for grief and shock and referred to therapy asap. Take it at day at a time. Look after yourself, try to remember to eat. I’m sorry this happened to you, you do not deserve any of this when a family is supposed to protect you, but it is not in any way your fault. The only other thing I can think of is if you have a game like Tetris or smth I read it’s supposed to help the brain process traumatic events better",
      "created_utc": 1737555306.0,
      "score": 1
    },
    {
      "id": "m8jes3q",
      "body": "Someone attacked you. What were you supposed to do, take it? Unless you'd rather have him killed you, you did what was necessary. Don't feel bad for taking out a shitty person. I also don't understand why you don't have the house.",
      "created_utc": 1737555523.0,
      "score": 1
    },
    {
      "id": "m8jj5t7",
      "body": "This is unfathomably heavy for me to read and process",
      "created_utc": 1737556924.0,
      "score": 1
    },
    {
      "id": "m8myo6y",
      "body": "He could have killed you. If you're concerned about your friend giving you food/housing, talk to him/her. I'm sure they don't mind you staying with them. \n\nThe initial shock will wear off and things will improve. Then it's just a matter of remembering the experience if something reminds you of him. \n\nYou will be fine and go on to have a normal life. Just trust that things will get better.",
      "created_utc": 1737591563.0,
      "score": 1
    },
    {
      "id": "m8opv9n",
      "body": "Time to start a new life, you have friends, people who are understanding will help you, and from there you can move forward. Plan a route to be where you want to be from where you are now.",
      "created_utc": 1737615384.0,
      "score": 1
    },
    {
      "id": "m8qcivs",
      "body": "Take it one day at a time and put a plan together for yourself to move forward. Think about mental health resources, spiritual resources, shelter resources, employment and education resources. There's no shame in seeking help. Become the best version of the person you fought to save. \nAnd when you finally get yourself where you want to be, and find peace, pay it forward by helping someone else who's been left in the lurch. Maybe donate to a resource that helps you.\nBe kind to yourself. Forgive yourself and (one day) your father and other relatives. But cut off contact from your so-called family. Maybe change your name. They failed you. Miserably. When you recover -- and you will -- you don't want them to find you just to screw your life up again. I'm praying for your swift recovery. 🙏",
      "created_utc": 1737644014.0,
      "score": 1
    },
    {
      "id": "m8umxrk",
      "body": "I have no clue what you are feeling but I have had extremely depressing life and have often thought about killing myself. I’ve keep praying and asking God to help me and to help have the strength to make my life better.. but it only seems to get worse. I feel like I’ve failed everyone I loved and I feel like I can never change or get better. I want to keep trying and I want to get better. Knowing that there is someone out there who has had it much worse than I can only image makes me want to keep trying. If you ever want to talk about everything you’re going through I’m definitely here to listen. Feeling this much pain and sadness every day is unbearable. Sometimes just having someone to listen to you is all you need. I definitely will pray for you and hopefully we can both help each other get thru this life",
      "created_utc": 1737689684.0,
      "score": 1
    },
    {
      "id": "m8fkuao",
      "body": "Was he on drugs, were you on drugs? Is what you're saying the full scope of what happened? I sense there's more here than what you are sharing.",
      "created_utc": 1737498680.0,
      "score": -18
    },
    {
      "id": "m98xksv",
      "body": "I can't believe people actually believe this story. ",
      "created_utc": 1737888567.0,
      "score": 0
    },
    {
      "id": "m8gm27o",
      "body": "𝓗𝓸𝓷𝓮𝔂 𝓲𝓽'𝓼 𝓷𝓸𝓽 𝔂𝓸𝓾𝓻 𝓯𝓪𝓾𝓵𝓽 𝓪𝓷𝓭 𝓲𝓽'𝓼 𝓸𝓴𝓪𝔂 𝓽𝓸 𝓯𝓮𝓮𝓵 𝓰𝓾𝓲𝓵𝓽𝔂 𝓫𝓾𝓽 𝔂𝓸𝓾 𝓭𝓲𝓭𝓷'𝓽 𝓶𝓾𝓻𝓭𝓮𝓻 𝔂𝓸𝓾𝓻 𝓭𝓪𝓭 𝓪𝓷𝓭 𝔂𝓸𝓾𝓻 𝓯𝓪𝓶𝓲𝓵𝔂 𝓲𝓼 𝔀𝓻𝓸𝓷𝓰 𝓯𝓸𝓻 𝓪𝓬𝓽𝓲𝓷𝓰 𝓵𝓲𝓴𝓮 𝓽𝓱𝓪𝓽 𝔂𝓸𝓾 𝓭𝓲𝓭 𝔀𝓱𝓪𝓽 𝔀𝓪𝓼 𝓫𝓮𝓼𝓽 𝓪𝓷𝓭 𝔂𝓸𝓾 𝓭𝓮𝓯𝓮𝓷𝓭𝓮𝓭 𝔂𝓸𝓾𝓻𝓼𝓮𝓵𝓯 𝓹𝓵𝓮𝓪𝓼𝓮 𝓭𝓸𝓷'𝓽 𝓯𝓮𝓮𝓵 𝓰𝓾𝓲𝓵𝓽𝔂 𝓪𝓷𝓭 𝓹𝓵𝓮𝓪𝓼𝓮 𝓭𝓸𝓷'𝓽 𝓴𝔂𝓼 𝓫𝓮𝓬𝓪𝓾𝓼𝓮 𝓲𝓽'𝓼 𝓷𝓸𝓽 𝔂𝓸𝓾𝓻 𝓯𝓪𝓾𝓵𝓽.",
      "created_utc": 1737510213.0,
      "score": -11
    },
    {
      "id": "m8ffpcc",
      "body": "[removed]",
      "created_utc": 1737497222.0,
      "score": -63
    },
    {
      "id": "m8fl8t3",
      "body": "Is there any other way you've found to justify it other than just self defense, because it doesn't feel like enough for me.",
      "created_utc": 1737498796.0,
      "score": 197
    },
    {
      "id": "m8lkzwc",
      "body": "If this is real they should be seeing a therapist or psychiatrist and if they were released they would’ve been released with their keys, they also would’ve been monitored and sent to a psychiatrist or therapist",
      "created_utc": 1737577154.0,
      "score": 13
    },
    {
      "id": "m8ic89q",
      "body": "How should he, he is unfortunately basically homeless. I don't know if he has healthcare but I imagine that it's not the case.",
      "created_utc": 1737537353.0,
      "score": 36
    },
    {
      "id": "m8fopwr",
      "body": "I've been trying, I posted here because I can't not think about it anymore. I can see him in my periphirals randomly throughout the day, and I hear him when I try to watch tv or listen to music.",
      "created_utc": 1737499811.0,
      "score": 29
    },
    {
      "id": "m8m837h",
      "body": "I'd never break into someones house in minecraft because it might be a bannable effense if the server owners found out. I have no idea about the investigation because it's an FBI matter and they don't communicate about it at all. I don't think you've ever intereacted with the FBI before, they simply don't care and probably think the whole thing is a waste of time which is why it's still an ongoing investigation. \n\n  \nAlso I'm really not sure which fantasy land you live in but what government entity would monitor me for my protection? We were never rich and my friend is already on the brink of poverty, he can't afford to drive me around searching for a therapist nor are there any qualified for this that I can even find within an hours drive.",
      "created_utc": 1737583329.0,
      "score": 4
    },
    {
      "id": "m8nf7k1",
      "body": "How were you able to move past the feelings of sadness and betrayal if you don't mind me asking? And is there no quick solution or did it just take an extremely long time like it seems most people are saying?",
      "created_utc": 1737596817.0,
      "score": 1
    },
    {
      "id": "m8gahns",
      "body": "I am not, never was able to have faith in a higher power with my lot in life.",
      "created_utc": 1737506577.0,
      "score": 14
    },
    {
      "id": "m8gf6ws",
      "body": "I'm native american so the local cops couldn't do anything but hold me for the FBI, and the FBI is \"still investigating\" so they have the keys.",
      "created_utc": 1737508039.0,
      "score": 20
    },
    {
      "id": "m8irbes",
      "body": "If so, I can hear the rattling of the jail keys now ….",
      "created_utc": 1737546180.0,
      "score": -1
    },
    {
      "id": "m8m5a45",
      "body": "Like I said in one of the comments, he's pretty active, so we have like 5 [tire pumps](https://www.specialized.com/us/en/air-tool-sport-floor-pump/p/172194?color=229735-172194&searchText=47214-2252&utm_source=google&utm_medium=organic&utm_campaign=surfaces-across-google&utm_term=719676757889&gQT=1) scattered across the house, one was right next to where we fell and it wasn't a tie it just got wrapped around his neck a few times and because he was on his back friction from the floor held it there. \n\n I'd like to ask people looking at this not to downvote the comment above since it's actually a bit funny for me being on this side of the reddit skepticism, and for those wondering why most of my comments are simply correcting people saying this isn't real it's because it lets me disconnect from it, and if I don't I feel nauseous every time I think about it.",
      "created_utc": 1737582565.0,
      "score": 6
    },
    {
      "id": "m8flxfg",
      "body": "The only tangently related drugs were steroids he was on and that just led to a general increase of aggression. And you're right there's a lot more I'm not sharing, but I could barely force myself to format what I did into something understandable, anything more and I'll just be ranting out a barely legible block of text.",
      "created_utc": 1737498994.0,
      "score": 30
    },
    {
      "id": "m8fkro1",
      "body": "Mate this was self-defense (and based on some of your past comments, you look like a troll).\n\nOP you are not evil, any sane dad would not attack his own child even if he was scammed and angry. I hope you find it in yourself to heal. Your friend is being a real one, if you feel bad you can offer to help around the house perhaps or (if that's too taxing) talk with them about the situation",
      "created_utc": 1737498658.0,
      "score": 27
    },
    {
      "id": "m8fkzqw",
      "body": "How the fuck can you say that?",
      "created_utc": 1737498723.0,
      "score": 19
    },
    {
      "id": "m8fngaf",
      "body": "Who put a quid in the dickhead? 🙄",
      "created_utc": 1737499437.0,
      "score": 11
    },
    {
      "id": "m8fr1wh",
      "body": "The simple truth is that, when you kill someone in self defense or in defense of someone else (justifiable homicide), it’s a matter of life and death. When someone says that, what that means is that you’re fighting for your life and your right to live it. Because not fighting means that the other person is going to **kill you.** So, what do you do? Live by killing them, or die by letting them kill you?\n\nIt’s not easy. It’s hard. And I can’t imagine the feelings you must be going through. I’m so, SO sorry. But that’s the reality of what you’re experiencing right now. \n\nAnd let me make this clear: **this is not your fault.** Your father, an abusive man by every definition, created this scenario by living a life of poor and making impulsive, bad decisions. He was bound to die in an ugly way, if he continued abusing steroids and his body. He was destroying his mind as well. And in the end, he continued his abuse towards his family by forcing this on you. He died doing what he’s always done: hurt his family. \n\nIt’s not going to be easy. I imagine the reason you’re getting treated so terribly is because it’s easy to blame you instead of him. You’re a victim too, but you won’t hurt them like he used to, so they can lash out at you using all the pain and anger they had for him. They also likely feel a lot of guilt over forcing you to deal with him, and of never having the chance to mend things, or help your father to a better path. They don’t know what to do with their feelings. What they’re doing isn’t right, but it’s not because of what you did. \n\nIt’s an ugly situation. But let me put it like this too…\n\nYou fought to survive. Your **instinct** is to live, so… Live. Continue fighting. Be a badass and live your life, with or without your family. Make your life worth something! You fought tooth and nail for it. You *deserve* the life you want, so go and seize it. \n\nGood luck. I believe in you. 🖤",
      "created_utc": 1737500507.0,
      "score": 270
    },
    {
      "id": "m8fmx0s",
      "body": "Darling, you were attacked. Someone wished you enough harm they put their hands on you and made you fear for your life. My best friend killed his Dad. He has schizophrenia and killed him because of his illness during a fight they had. He has no release date, he loved his Dad & now he is paying with his life. He's locked away and has to live with what he's done. It's almost punishment enough. I believe you feel such heavy guilt you haven't even paid attention to what you must've felt. I believe it was self defence and I hope you can cope and move on to live a fulfilling life.",
      "created_utc": 1737499282.0,
      "score": 210
    },
    {
      "id": "m8hf7rv",
      "body": "Hey OP, I've fought a knife away from someone trying to kill me. TW description of violence >!I bit the hand the knife was in. I put my hand on the blade, when I couldn't get my whole hand around the handle. Once I got it, I just stood there buffering for a second, then bolted for the door.!< So believe me when I say, you don't need to justify, because your body and mind certainly weren't. In psychiatric settings, we learn about the three levels of functioning we have in our central nervous system. Reptile brain, animal brain, human brain.\n\nHuman brain thinks in logic, words, and justifications. It's responsible for a lot of what makes us human, but also a lot of what can make us unwell. Animal brain thinks in emotions, feelings, concepts, and arguably intuition. It's responsible for some things we hold dear, like love and connection. But also responsible for some of our darker impulses, like rage and jealousy.\n\nReptile brain doesn't have the capacity to care about any of that. Reptile brain doesn't think in words, or emotions. It thinks in reflexes. It thinks in terms of our most fundamental and life sustaining needs. Safety, danger, food, water, fight, flight, freeze. Reptile brain is what keeps you safe, when someone tries to cause you harm. It doesn't answer to logic, it doesn't answer to feelings. It just sees, and does. Input, output.\n\nSo, just as I have no use in trying to justify why I was dumb enough to bite a hand with a knife in it, you don't need to try to justify why you did what you did. Your reptile brain was running the show, whose only concern was to get you to safety. That's why you didn't think to take off the chain, because you weren't thinking. You were reacting. They call fight/flight/freeze \"limbic system hijack mode\". I'd encourage you to learn more about it, before you give up and take your own life.",
      "created_utc": 1737520257.0,
      "score": 49
    },
    {
      "id": "m8fvfl7",
      "body": "The fact that your family is normalizing this means you’ve lived with abuse for a long time. You didn’t do anything to make him do that. You didn’t deserve to get hurt. You deserve to be happy and safe and it breaks my heart as a mom that someone took that from you. You should have been protected and your family failed you. That is not, and will never be, your fault.",
      "created_utc": 1737501855.0,
      "score": 90
    },
    {
      "id": "m8g2knp",
      "body": "He would have badly hurt you, you were defending yourself. It was likely a moment of extreme emotion but you did what you had to do. Please don’t end your life over your dads misjudgment 💓",
      "created_utc": 1737504110.0,
      "score": 42
    },
    {
      "id": "m8gd67t",
      "body": "My father died of a heart attack. Its not even remotely the same but I spent years thinking about how I could have done things better so I could have saved him. Your father was an abuser, the fact he picked up the knife to attack you is insane itself.",
      "created_utc": 1737507404.0,
      "score": 45
    },
    {
      "id": "m8gfbr6",
      "body": "You were fighting for your life and didn't have the intent to kill. He put himself in that situation, he was going for you and he could've grabbed his rifle at any moment. ",
      "created_utc": 1737508082.0,
      "score": 29
    },
    {
      "id": "m8hclob",
      "body": "I think you need post traumatic stress therapy",
      "created_utc": 1737519244.0,
      "score": 21
    },
    {
      "id": "m8mcgeo",
      "body": "If it weren't self defense then you would be in jail facing charges of murder.  I'm sorry about what happened with your father and your family not supporting you.  Please, if you're feeling too depressed and are thinking of harming yourself, go to the ER.  Your father wasn't in his right mind at the end but he wouldn't want this to be the end of the story for you.",
      "created_utc": 1737584613.0,
      "score": 4
    },
    {
      "id": "m8l1so8",
      "body": "If you take another man's life to save your own, make it the best life you could. As in be happy, do yourself favors, be grateful to exist. Don't feel guilty, you'll make it!",
      "created_utc": 1737572007.0,
      "score": 3
    },
    {
      "id": "macksz6",
      "body": "if you could go back and make it so that he wound up surviving after you escaped danger would you? if yes then you know for certain you didnt kill him by choice. that means you are not a murderer.",
      "created_utc": 1738400170.0,
      "score": 1
    },
    {
      "id": "m8n7x5u",
      "body": "In this situation, I would imagine they wouldn't have had time to grab their keys when calling the police and being arrested. They probably were left in the home, hence why they had to even come in through a window. I agree they should see a professional, however.",
      "created_utc": 1737594481.0,
      "score": 7
    },
    {
      "id": "m8ne095",
      "body": "Lord knows the criminal justice system in the US (assuming that's where OP is) is fucked and full if incompetent dummies. So I totally believe this could happen.",
      "created_utc": 1737596429.0,
      "score": 4
    },
    {
      "id": "m8jmwvw",
      "body": "My friend is basically homeless and has access to healthcare, which is why I asked OP the question after reading his post.",
      "created_utc": 1737558064.0,
      "score": 17
    },
    {
      "id": "m8gxowx",
      "body": "You're going to need some intense therapy. It's going to be hard, but so worth it in the end. This is not your fault. You acted in complete self defense.",
      "created_utc": 1737514007.0,
      "score": 13
    },
    {
      "id": "m8nfm7b",
      "body": "It took a very long time. The hurt and anger pops up from time to time because having a drunk abusive father screwed me up mentally in ways that still affect me today. He is dead and gone. I don’t refer to him as dad in conversation. He is Jim to me.",
      "created_utc": 1737596949.0,
      "score": 2
    },
    {
      "id": "m8gapwo",
      "body": "Understood. I’ll pray for you man.",
      "created_utc": 1737506648.0,
      "score": 5
    },
    {
      "id": "m8jalbc",
      "body": "slim continue cobweb rainstorm library stocking snails boast roof crush\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1737554113.0,
      "score": 5
    },
    {
      "id": "m8fmfof",
      "body": "Sounds like he had roid rage. I'm still concerned why your family has turned against you though. Did you have an ongoing beef with your father?",
      "created_utc": 1737499142.0,
      "score": 14
    },
    {
      "id": "m8nd3ax",
      "body": "This is amazingly put. It made me think of the self defense/a second chwnce thing in a new way: that you staying alive means his death wasn't in vain. By killing yourself you would make your self defense and this, your dad's accidental death, all for nothing. Take the yime you need day by day to get through this so you can live the life his was given for. You are stronger than you realize.",
      "created_utc": 1737596137.0,
      "score": 10
    },
    {
      "id": "m9bmo0h",
      "body": "[deleted]",
      "created_utc": 1737921871.0,
      "score": 1
    },
    {
      "id": "m8hmzbb",
      "body": "I saved mine. He was... different after that. If this gives you any comfort, they often come back... different.",
      "created_utc": 1737523506.0,
      "score": 18
    },
    {
      "id": "m8nivre",
      "body": "It's not the answer I wanted to hear but thank you, and I'm sorry you had to live the life you did. Wouldn't want anyone to share that, but I can only hope to be in your position trying to help others like us in the future.",
      "created_utc": 1737598010.0,
      "score": 2
    },
    {
      "id": "m8fof3i",
      "body": "I guess without getting into too much detail some important information is that he was born in 1950 and kept himself in extremely good shape (regularly swimming multiple miles, riding a bicycle 20+ miles every other day, helping me lift 20 ft. trusses to build a patio cover etc.) he was abusive to me growing up, and he's been taking a lot of steroids to keep his ability to live like normal (he had a stroke 6 years ago and I had to help him eat, go to the bathroom, and clean himself, but he recovered with the help of drugs 2-ish years ago) \n\n\n\nMy mom was born in 1985 she left my dad a year after I was born leaving me and my older sister in the process, she's bipolar, and had to get herself clean after getting addicted to heroin. She cut contact with me after the situation with my dad.\n\n  \nThe rest of my family was generally aware of the abuse and his situation, but never said or did anything about it and I've been trying to repair our relationship and I thought we were doing good since we hadn't had a fight physical or verbal in the last 3-4 years. Recently (last year) I've been trying to get my siblings to talk to him because he was getting addicted talking to obvious scammers online and he thought he was falling in love with emma watson.",
      "created_utc": 1737499722.0,
      "score": 40
    },
    {
      "id": "m9csqho",
      "body": "He's in a forensic hospital for maybe the rest of his life",
      "created_utc": 1737933519.0,
      "score": 1
    },
    {
      "id": "m8gr2px",
      "body": "OP you're a victim. You can go anywhere, start over, start fresh, You deserve to heal from this",
      "created_utc": 1737511830.0,
      "score": 27
    }
  ]
}