{
  "id": "1ihvpnx",
  "title": "28F I strangled myself to death almost 3 days ago",
  "selftext": "I decided that Im done with life, drank a lot of liquors, pills and I took a belt wrapped it around my neck and on the door. I managed to strangle to myself till I lost consciousness, unfortunately the belt wasn’t strong enough, I woke up on the floor. \n\nThe next morning I was shocked when I saw myself in the mirror, red eyes, red bumps everywhere on face, and I was coughing blood. I could barely breathe or swallow. \n\nI went to the emergency room and they told im ok, its going to take 10 days to heal, they thought a guy strangled me, I didn’t tell them anything about what happened, I told them I want to keep my private life. \n\nMonday I was on my way back to work, everyone asking why my eyes are red, I told them It was an infection. Life is so absurd. \n\nNobody knows except me. Im sad cause I was so close! ",
  "created_utc": 1738711301.0,
  "score": 645,
  "num_comments": 58,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ihvpnx/28f_i_strangled_myself_to_death_almost_3_days_ago/",
  "comments": [
    {
      "id": "mb1chfi",
      "body": "This is my biggest fear, it not working. I'm really glad you are ok and didn't end up living with like brain damage or something and be so much worse off than before.",
      "created_utc": 1738722304.0,
      "score": 224
    },
    {
      "id": "mb11uup",
      "body": "I don’t know what you need to hear.  \n\nI too am at a loss.\n\nThe children that have left the house act like they don’t really want a lot to do with me. My wife vacillates between wanting to spend all her free time with me and accusing me of emotional affairs.\n\n\nI’ve had A friend tell me that I have a support network but anytime I reach out to anybody they’re unavailable. \n\n\nI don’t wanna be here anymore either, but I found myself glad that you’re still around.",
      "created_utc": 1738718874.0,
      "score": 111
    },
    {
      "id": "mb1xicl",
      "body": "I am sorry you didn't wake up feeling diffetently. ",
      "created_utc": 1738729648.0,
      "score": 31
    },
    {
      "id": "mb3z5cg",
      "body": "I have no clue if this will be helpful or not for you OP, but I felt like sharing.\n\nI have a few plants at home, in a balcony (also in Europe) I tended to them and they mostly looked nice, until a time when I was a bit more down and didn't feel like watering them or moving them to adapt them to the sunlight. Needless to say they mostly went dry, brownish and looked, well, dead... Leaves falling, mold, didn't look good. Took a while, but I then eventually felt like that couldn't go any further.\n\nI watered them all and cut some of the dry, dead leaves, I even watered some plants who seemed absolutely dead. To my surprise some then flourished, with green, Spring-like, beautiful leaves. Some branches didn't actually make it, but the core did, somehow, I don't know. Previously, they just looked like deer antlers really.\n\nThey had it tough, but made it through and have now given me some fruit, I hope you manage to do it too, in your time.",
      "created_utc": 1738765870.0,
      "score": 20
    },
    {
      "id": "mb1uu5v",
      "body": "You should take the rest of the week off of work for recovery - go to a loved one’s home or a close friend - someone who can offer unconditional love for a few days - and spend that time pumping yourself up enough to have a plan and go to work decently - it gets better - I promise",
      "created_utc": 1738728610.0,
      "score": 32
    },
    {
      "id": "mb0kx2s",
      "body": "Take this as a sign from the universe that this is not the way.",
      "created_utc": 1738713306.0,
      "score": 83
    },
    {
      "id": "mb20i37",
      "body": "Glad you survived, feel better.",
      "created_utc": 1738730845.0,
      "score": 11
    },
    {
      "id": "mb1u5o9",
      "body": "im glad you survived",
      "created_utc": 1738728354.0,
      "score": 33
    },
    {
      "id": "mb2q9oa",
      "body": "Im glad you’re okay OP, are you healing up okay? I am 22 years old with many many failed attempts from ages 13-21, I can confidentially say with my whole heart that I’m so glad that I never succeeded. You can do this, it will get better 🖤",
      "created_utc": 1738744071.0,
      "score": 9
    },
    {
      "id": "mb2i615",
      "body": "Don’t torture yourself man, life is already painful. Let life take its course because any second from now it can be taken from you. Live for something, it could be helping someone who will add no value to your life like a homeless man. Buy yourself a video game you wanted as a kid but never got. Do shit like that man, just live in the breathing moment. Fuck the future or the past. Killing yourself won’t give you closure, you can’t take it back. Live out your life, see where it takes you. Maybe things will get better.",
      "created_utc": 1738739285.0,
      "score": 12
    },
    {
      "id": "mb72h2a",
      "body": "I tried to hang myself in 2019 due to anxiety from severe financial issues resulting from a divorce. It was a half-hearted attempt, but I definitely would have succeeded if I had done a \"better\" job of rigging the device that I used. I failed, fell on the floor, cried a bunch, then went for a 10-mile walk to clear my head. My throat hurt like hell the next day. The very next morning on the way to work, my lawyer called me because I was in a bicycle accident about a year prior and told me that the other person's insurance company was going to settle for $5,000 more than we had agreed. I probably got shortchanged in the long run, but I made $55,000 that morning. Of course, My employers short-term disability provider and the lawyer took about half of that because they suck. Still... It's a good thing I didn't die. Financially speaking, I was able to pay off all of my debts and my relationship with my ex-wife never really degraded to the point that I thought it would. Nor did my financial situation, obviously.",
      "created_utc": 1738797214.0,
      "score": 6
    },
    {
      "id": "mb22gr6",
      "body": "I ate rat poison 22 years ago. I had to stay at the icu for a few days. I am so happy I was found before I died. I can assure you that there is nothing to be ashamed of and also, one day you will regret trying it. Life gets better. I promise",
      "created_utc": 1738731650.0,
      "score": 14
    },
    {
      "id": "mb1ya5g",
      "body": "Listen. Op. I dont want to be mean or anything but. How did u feel after? Do u still want to do it? Or do u want to live life now? If u hate ur job. Find another job. If u hate where u live. Find another apartment in ur budget. If u feel like life is dull. Find a hobby or passion. Or even try making a bucket list. Pls do it before do (💀) it again.",
      "created_utc": 1738729953.0,
      "score": 14
    },
    {
      "id": "mb23cdg",
      "body": "damn that sucks",
      "created_utc": 1738732021.0,
      "score": 4
    },
    {
      "id": "mb2uzfv",
      "body": "Be careful, because if you told the hospital that a man done this they could very well call the police and if you look bad they will take pictures and want to find this man! You get in trouble if the police find out you weren’t telling the truth. I don’t mean to scare you but I just want you to know that it’s a possibility. Happened to someone I know and they got in trouble for lying.",
      "created_utc": 1738747052.0,
      "score": 5
    },
    {
      "id": "mb4lsnd",
      "body": "I’m so sorry. I’m glad you’re still here. I won’t say any toxic positivity bs to make you feel worse because life sucks but hang in there",
      "created_utc": 1738772613.0,
      "score": 3
    },
    {
      "id": "mb28dnr",
      "body": "Hey hey hey, calm down. There are some people who do care. You want someone to talk to, I don't mind being here. Also FYI, I'm a guy, but also a eunuch, so there aren't any alterier motives. Just caring about people.",
      "created_utc": 1738734249.0,
      "score": 5
    },
    {
      "id": "mb7s8fy",
      "body": "I hope you find healing and hope! I personally decided to turn to prayer whenever I feel stuck or have these thoughts. Suicide is not a solution",
      "created_utc": 1738805429.0,
      "score": 2
    },
    {
      "id": "mbf45uw",
      "body": "I'm an old man who's always been depressed to the point of wanting out from life, but I've always been too much of a coward to attempt suicide. Don't want any physical pain either.  The older I get, the worse I feel emotionally every day. Talk therapy is useless. I've tried it countless times over the years.  Its effects only last a day or two.  I'm going to try a Psychiatrist again soon. Since this time I'm retired, so now I can do whatever I can to get on some very strong psychotropic drugs that hopefully will make me into a numb blob with no more frustrating libedo.",
      "created_utc": 1738899595.0,
      "score": 2
    },
    {
      "id": "mb39js5",
      "body": "i've heard of people ending up with thyroid injuries and hormonal problems",
      "created_utc": 1738755717.0,
      "score": 4
    },
    {
      "id": "mb29uf4",
      "body": "Wish it was easy to do this but it's not",
      "created_utc": 1738734936.0,
      "score": 2
    },
    {
      "id": "mbl7pia",
      "body": "How come you had red bumps? Was it caused by the liquor + pills?",
      "created_utc": 1738980005.0,
      "score": 1
    },
    {
      "id": "mb1xdzw",
      "body": "Bungee cable is my plan. Same rope used for wakeboarding.",
      "created_utc": 1738729599.0,
      "score": -8
    },
    {
      "id": "mb23fp9",
      "body": "[removed]",
      "created_utc": 1738732059.0,
      "score": -17
    },
    {
      "id": "mb2pjps",
      "body": "Almost 3 days ago or you almost strangled yourself",
      "created_utc": 1738743621.0,
      "score": -3
    },
    {
      "id": "mb2g1wv",
      "body": "[removed]",
      "created_utc": 1738738123.0,
      "score": -20
    },
    {
      "id": "mb23u7z",
      "body": "Hey man, I don't have a wife, but I feel you—very similar circumstances outside marriage.\n\nFeels like the support network that I supposedly have just isn't ever around when I need it. My messages are met with one-word responses or no response at all. \n\nThey're only interested in doing things that align with their preferences. I don't know; I'm just tired of trudging on for people who barely care about me.",
      "created_utc": 1738732229.0,
      "score": 35
    },
    {
      "id": "mb2z9u5",
      "body": "I felt a little better the morning after, survival instincts kicked in I guess. Im trying my best to not do it again. Yes I have to leave my job. Some of the people here are so insensitives, and the work culture is shit. I think with money most of my problems would’ve been resolved. My choices are influenced by money. Because I have no choice.",
      "created_utc": 1738749750.0,
      "score": 13
    },
    {
      "id": "mb2xklt",
      "body": "I didn’t tell them anything, they thought its the case and I told them I want to keep what happened to myself, I’m a 28 years old woman with no past troubles and I live in Europe, it’s different here. The doctor accepted to not tell the police.",
      "created_utc": 1738748699.0,
      "score": 11
    },
    {
      "id": "mb3hb2d",
      "body": "People usually get these problems even without any attempts, and honestly I don’t care. It will just intensify my desire to leave further.",
      "created_utc": 1738759354.0,
      "score": 6
    },
    {
      "id": "mbwv4m2",
      "body": "Sorry I meant petechiae, its caused by the strangulation pressure. It healed completely now.",
      "created_utc": 1739138479.0,
      "score": 1
    },
    {
      "id": "mb2jbzg",
      "body": "May be this is not the place for absurd comments.  Save it for other sub.",
      "created_utc": 1738739948.0,
      "score": 15
    },
    {
      "id": "mb2zce6",
      "body": "Im sorry but I struggle to find the hot part about it",
      "created_utc": 1738749795.0,
      "score": 8
    },
    {
      "id": "mb2ii7f",
      "body": "Wth is wrong with you?",
      "created_utc": 1738739474.0,
      "score": 13
    },
    {
      "id": "mb4n7y7",
      "body": "Wtf? Literally gtfo this sub",
      "created_utc": 1738773009.0,
      "score": 6
    },
    {
      "id": "mb3r9np",
      "body": "I see. Its understandable Having that toxic work environment. And ofc these days money is really tight but i want to let u know that. IM REALLY PROUD. very proud of you. ❤️. Ur taking ur first step to happiness and freedom. I would say pick a part time for different experiences or side hustle. Gonna be hard but it will be very rewarding after. + u have an extra income. It may be little but it is still an income. Aside from ur other job",
      "created_utc": 1738763207.0,
      "score": 7
    },
    {
      "id": "mb7pze5",
      "body": "i can't get diagnosed anyway (i never attempted) and they pin my issues on being somatoform despite being in pain every day and having dysautonomia so i can feel where you're coming from. just watch out for any weight issues, fatigue, weakness, heart rate issues or excessive sweating further down the line",
      "created_utc": 1738804708.0,
      "score": 2
    }
  ]
}