{
  "id": "1iztqij",
  "title": "Shut up with the “Suicide is a permanent solution to a temporary problem” bs.",
  "selftext": "Once you’ve been suicidal for 6+ years now, then its starting to become a lot less temporary.",
  "created_utc": 1740698985.0,
  "score": 992,
  "num_comments": 179,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1iztqij/shut_up_with_the_suicide_is_a_permanent_solution/",
  "comments": [
    {
      "id": "mf76i53",
      "body": "FYI, the \"permanent solution to a temporary problem\" nonsense is on [this evidence-based list of things **not** to say](http://www.speakingofsuicide.com/2015/03/03/what-not-to-say/) from Stacey Freedenthal, one of the world's most respect clinician-authors on suicide intervention.",
      "created_utc": 1740716717.0,
      "score": 1
    },
    {
      "id": "mf67bzw",
      "body": "What people don’t understand is, yes it’s a permanent solution to a temporary problem. But the issue is that problems are permanent. Meaning that once I solve this problem, another one is going to come up. A singular problem might be temporary, but having problems isn’t temporary. THATS what I’m tired of. I’m not tired of this problem in particular, I’m tired of HAVING PROBLEMS",
      "created_utc": 1740704059.0,
      "score": 288
    },
    {
      "id": "mf5y2rc",
      "body": "[removed]",
      "created_utc": 1740700990.0,
      "score": 267
    },
    {
      "id": "mf6dr75",
      "body": "I truly believe Suicide is a beautiful thing.  Sad but beautiful. Going out on your own terms is not a bad thing.  Life sucks most of the time so why fight it.  \n\nIt is a permanent solution, but I argue that many times, the problem is not temporary. I've been living 20 years of hell and I keep hoping it will get better but it gets worse.",
      "created_utc": 1740706270.0,
      "score": 111
    },
    {
      "id": "mf665ys",
      "body": "None of my problems are even temporary. ",
      "created_utc": 1740703666.0,
      "score": 106
    },
    {
      "id": "mf5tjbe",
      "body": "Permanent solution to a permanent problem. Seems fine to me. I want to die too.",
      "created_utc": 1740699493.0,
      "score": 175
    },
    {
      "id": "mf62glm",
      "body": "I never understood that. It honestly makes me want to do it more. Like, you’re telling me it’s a permanent solution. Meaning it’s never gonna come back. Sounds like a win to me 🤷‍♂️",
      "created_utc": 1740702442.0,
      "score": 100
    },
    {
      "id": "mf68lfl",
      "body": "Honestly. I used to feel bad for leaving my family behind but now IDK",
      "created_utc": 1740704483.0,
      "score": 36
    },
    {
      "id": "mf68mia",
      "body": "I agree. I just plan on exhausting all my options first. I’ll go to therapy and take meds which only kind of worked for 6 months the last time, then things went to shit again. If I’m ending it, I’m partying hard, doing reckless shit, then ending it. Suicide is an option for me, and I consider it daily, but it is just the last option.",
      "created_utc": 1740704494.0,
      "score": 33
    },
    {
      "id": "mf6b9rj",
      "body": "Always said by someone who has NEVER considered suicide or only ever had short term problems in their life never long term or permanent ones",
      "created_utc": 1740705408.0,
      "score": 36
    },
    {
      "id": "mf6aave",
      "body": "Oh, yeah.\n\nI've been suicidal most of my life and I got sick of hearing that as a suicidal teenager.\n\nWhat if it's the only solution I want?",
      "created_utc": 1740705072.0,
      "score": 18
    },
    {
      "id": "mf6hrx1",
      "body": "Wtf...my problems actually are permanent. Its illness there is no cure for. I have to live with it as well as something on my body that is no solution for not even in 2025. Medicine still have no solutions for some of us. Also its not like I will miraculously get a new loving family instead of fkn abusers who ruined my mental health since childhood. I wont even dig deeper into my life. There are no temporary problems in it. What was a problem 38 yrs ago is still a problem and will be till the day of my death",
      "created_utc": 1740707661.0,
      "score": 17
    },
    {
      "id": "mf5uk76",
      "body": "This to me is the mother of all suicide cliches which is why I hate it. So is HOPE (Hold On Pain Ends) and other useless, empty feel-good sayings like it.",
      "created_utc": 1740699832.0,
      "score": 31
    },
    {
      "id": "mf6l4un",
      "body": "My problem isn’t temporary it’s an incurable mental disorder that ruins my life",
      "created_utc": 1740708846.0,
      "score": 13
    },
    {
      "id": "mf61uqk",
      "body": "It’s always the same damn answer every time being something like “I’m here for you” or “you’ll get through it” like mf if I was going to get through it it would have happened years ago and to hell with “I’m here for you” that’s what they all say and yet it never means anything",
      "created_utc": 1740702242.0,
      "score": 25
    },
    {
      "id": "mf7bau1",
      "body": "My thoughts on this is any person with an autoimmune disease feeling suicidal is pretty acceptable",
      "created_utc": 1740718766.0,
      "score": 12
    },
    {
      "id": "mf5tbgz",
      "body": "Same here, 6 whole years... it feels like a century to me.. I need it to end ASAP",
      "created_utc": 1740699421.0,
      "score": 19
    },
    {
      "id": "mf6qbk6",
      "body": "Life itself is a permanent problem for many of us",
      "created_utc": 1740710677.0,
      "score": 14
    },
    {
      "id": "mf6435j",
      "body": "I’ve been suicidal for 14+ years. There are more bad moments than good but I try to live for the good. And I hope one day our classist society will rise up and eat the rich….",
      "created_utc": 1740702981.0,
      "score": 7
    },
    {
      "id": "mf6f9k9",
      "body": "I have been suicidal since 60% of my life now... So much to temporary. It just keeps stockpiling.",
      "created_utc": 1740706794.0,
      "score": 7
    },
    {
      "id": "mf6fxvp",
      "body": "My issues are permanent, people assume it’s easy",
      "created_utc": 1740707028.0,
      "score": 7
    },
    {
      "id": "mf7399e",
      "body": "I have genuinely been suicidal nonstop since I was 9. \nI really don’t think it’s going away",
      "created_utc": 1740715434.0,
      "score": 6
    },
    {
      "id": "mf6ktet",
      "body": "Or \"it's gonna get better\". So everyone is by default entitled to a happy ending?",
      "created_utc": 1740708734.0,
      "score": 4
    },
    {
      "id": "mf7zyp4",
      "body": "Lol, yeah, bs. My most important and productive years are wasted, opportunities are gone because I was born to be an excuse of human being and a failure. And nothing of these can be brought back. Too much for a \"temporary problem\", I just have to live with myself for the rest of my life now. Which basically means struggle more years, or struggle less years",
      "created_utc": 1740731910.0,
      "score": 6
    },
    {
      "id": "mf6e33p",
      "body": "Yeah. Suicidal for 10+ years. I've always hated the saying as well.",
      "created_utc": 1740706386.0,
      "score": 4
    },
    {
      "id": "mf7f755",
      "body": "Temporary problem that I've had for 16 years. The same one!",
      "created_utc": 1740720515.0,
      "score": 5
    },
    {
      "id": "mf6abzg",
      "body": "Well said. I too get sick of all that.",
      "created_utc": 1740705083.0,
      "score": 3
    },
    {
      "id": "mf6wa7j",
      "body": "Real it doesn’t get better",
      "created_utc": 1740712811.0,
      "score": 3
    },
    {
      "id": "mf72z3x",
      "body": "i swear to god, I'm so sick and tired of all the \"it always gets better\" no it does not 😭😭😭",
      "created_utc": 1740715323.0,
      "score": 3
    },
    {
      "id": "mf6e0qq",
      "body": "In my suicide attempts, something also stops me. Amazon deliveries for parts don’t arrive, while most of me wants to die a part of me wants to live. Unfortunately all my attempts have failed so far",
      "created_utc": 1740706363.0,
      "score": 2
    },
    {
      "id": "mf8qp1g",
      "body": "is anyone available for a quick call? im genuinely struggling and every time i call a hotline in the navy it never helped",
      "created_utc": 1740746740.0,
      "score": 2
    },
    {
      "id": "mfa1s7z",
      "body": "thats the optimism of a guy that's never wanted to kill themselves 😂",
      "created_utc": 1740761838.0,
      "score": 2
    },
    {
      "id": "mf6x4m6",
      "body": "That’s why I think about it sometimes",
      "created_utc": 1740713120.0,
      "score": 1
    },
    {
      "id": "mf7nbny",
      "body": "Think im on a solid 6 years. Wish I wasnt such a wuss but putting a plan in motion",
      "created_utc": 1740724557.0,
      "score": 1
    },
    {
      "id": "mf7u68g",
      "body": "[removed]",
      "created_utc": 1740728391.0,
      "score": 1
    },
    {
      "id": "mf80nl1",
      "body": "my dad said that to me when i was in high school and my ideation was finally being realized by my family as an actual problem and i genuinely believe he was trying to help and i appreciate that, i can’t blame him for not understanding how i felt but it was really fucking cringe ngl",
      "created_utc": 1740732346.0,
      "score": 1
    },
    {
      "id": "mf8bt8a",
      "body": "Not permanent solution to a temporary problem but more like transferring your problem unto someone else but life goes on",
      "created_utc": 1740739320.0,
      "score": 1
    },
    {
      "id": "mf8g9ed",
      "body": "Lot of problems make permenant effect on us",
      "created_utc": 1740741852.0,
      "score": 1
    },
    {
      "id": "mf8j2su",
      "body": "Over 20 years of suicidal thoughts here but so much worse over the last 2 years. I'm never going to get better.",
      "created_utc": 1740743320.0,
      "score": 1
    },
    {
      "id": "mf9428i",
      "body": "Sometimes problems are just permanent.",
      "created_utc": 1740751642.0,
      "score": 1
    },
    {
      "id": "mf96asn",
      "body": "Yeah that's kinda the point ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
      "created_utc": 1740752396.0,
      "score": 1
    },
    {
      "id": "mf9a2j2",
      "body": "It’s been over 15 years for me I literally cannot take this omfg 😭",
      "created_utc": 1740753637.0,
      "score": 1
    },
    {
      "id": "mf9h090",
      "body": "Omg EXACTLY I’m so sick of seeing that or the “if you have letters to write you have reasons to stay “ bs",
      "created_utc": 1740755825.0,
      "score": 1
    },
    {
      "id": "mf9xel7",
      "body": "You are not alone. Sometimes I feel like there’s only so much that can be said too. We all do care about you and cherish you being here.",
      "created_utc": 1740760599.0,
      "score": 1
    },
    {
      "id": "mfa31qk",
      "body": "Been suicidal since I was 10 after my dad died I only told someone when I was 16, I'm now nearly 36 such fun",
      "created_utc": 1740762199.0,
      "score": 1
    },
    {
      "id": "mfa4zza",
      "body": "Going on 15 years since my first attempt, 23 years since my first therapy session. It’s like telling someone their 25 year career is a temp job.",
      "created_utc": 1740762757.0,
      "score": 1
    },
    {
      "id": "mfahvh1",
      "body": "Yes it can be permanent decision for stupid small issue!! Every suicide story is unique. You can’t compare yours to others.",
      "created_utc": 1740766449.0,
      "score": 1
    },
    {
      "id": "mfaipmn",
      "body": "Although that is sometimes the case, people need to also acknowledge that there are some conditions in a person's life that are permanent and not everyone is just having a knee-jerk reaction.",
      "created_utc": 1740766685.0,
      "score": 1
    },
    {
      "id": "mfb1v2r",
      "body": "I'm only 15, but all I've ever felt was depression and feeling suicidal. It took me losing literally everyone to get my happiness, or whatever.\n\nFor me, I had to switch my mindset from, I want to die, to I want to live. And I had to fully believe it, and cooperate, and work on it. I don't know how, but I've felt emotionally better than ever. You need to change your space and your habits, maybe even friends, if possible. I haven't changed my friends, I have one that came back after I healed. And I've noticed my mental health declining ever since.\n\nYou may think I'm just a kid with no life experience, but this is my perspective, I never thought I'd feel the content I do now, but after taking tai chi, looking at self-help, and majorly improving my eating and drinking, it's really helped",
      "created_utc": 1740772020.0,
      "score": 1
    },
    {
      "id": "mfbb3j5",
      "body": "That’s very true. I’ve been suicidal for years now, seeming like the best option available than dealing with non stop suffering.",
      "created_utc": 1740774592.0,
      "score": 1
    },
    {
      "id": "mfbl2fd",
      "body": "felt this way since i was a young child, before i even knew feeling like that had a name. this saying will never help.",
      "created_utc": 1740777383.0,
      "score": 1
    },
    {
      "id": "mfbu2s8",
      "body": "Lmao bc problems r permanent",
      "created_utc": 1740779934.0,
      "score": 1
    },
    {
      "id": "mfc9oyv",
      "body": "Been suicidal since i was 7yrs old.. I’m in my mid 30s. Use to hear that it would get better or it will go away eventually. Well it hasn’t and im tired of the CPTSD, BPD and chronic pain. People put pets down all the time because they don’t want them to suffer so why can’t i be put down? Am i not suffering enough? Some bs i tell ya.",
      "created_utc": 1740784676.0,
      "score": 1
    },
    {
      "id": "mfcab8m",
      "body": "I have said this for AGES. It is so fucking condescending. My problems don’t FEEL temporary because I’ve had them almost my whole life",
      "created_utc": 1740784873.0,
      "score": 1
    },
    {
      "id": "mfckppn",
      "body": "Exactly. It seems I have a damn lifetime membership to misfortune lmao, technically alot of people do if you think about it.",
      "created_utc": 1740788336.0,
      "score": 1
    },
    {
      "id": "mfcqh63",
      "body": "my only regret is not doing it when i was still a teenager. that way my partner would not miss me.",
      "created_utc": 1740790247.0,
      "score": 1
    },
    {
      "id": "mfcrqfq",
      "body": "I have been suicidal since I was a teenager, I am 25 today and I no longer have the right to want to die or even die because I have a child. Imagine my ordeal I am obliged to live so I am forbidden from making an attempt I will live with the desire to end it but I will continue to live without the choice x'(",
      "created_utc": 1740790670.0,
      "score": 1
    },
    {
      "id": "mfct1lt",
      "body": "I get the gesture behind it but yeah. My problems definitely aren’t temporary and so are most people’s especially when you’re deeply traumatized. I wish people had better wording when it comes to genuinely wanting to help a suicidal person",
      "created_utc": 1740791115.0,
      "score": 1
    },
    {
      "id": "mfds8pn",
      "body": "right like sycau a solution is a solution",
      "created_utc": 1740804155.0,
      "score": 1
    },
    {
      "id": "mfgph57",
      "body": "Fr and even if it is “temporary” technically, as you said in the post, when it’s indefinite and there’s no real end in sight, it doesn’t feel temporary. \n\nAtp idek if therapy is going to help bc I have so much baggage and trauma, idek how to articulate or talk about it anymore and I feel like I’m just losing my mind being here, esp w my crappy situation and esp since it’s a bit of a catch-22. Need to be better to get out but need to get out to get better and even then, getting better isn’t a guarantee atp either. \n\nI don’t know if I have it in me to end it atp but I mostly don’t have it in me to try anymore either. \n\nI get what they’re trying to say with it but they really don’t get how truly unbearable it actually feels. It’s hard to not want to give up. ",
      "created_utc": 1740850847.0,
      "score": 1
    },
    {
      "id": "mfka91f",
      "body": "Who said it was a solution in the first place. It serves as a vessel for so many other things. I want to escape this reality itself, so I will.",
      "created_utc": 1740894796.0,
      "score": 1
    },
    {
      "id": "mfkwcx2",
      "body": "Same here\nBeen thinking of deleting myself for more than 6 years.\nI just want to be brave enough to do it this time.",
      "created_utc": 1740907608.0,
      "score": 1
    },
    {
      "id": "mg2n5wx",
      "body": "Exactly! How is 13 years a \"temporary\" problem????",
      "created_utc": 1741139420.0,
      "score": 1
    },
    {
      "id": "mg2zw1l",
      "body": "Who or What are you, why are you even part of this topic. The way of your attitude & lack of empathy will come back to you, you will be affected. Your telling people to shut up Grow up",
      "created_utc": 1741143647.0,
      "score": 1
    },
    {
      "id": "mg70p0n",
      "body": "Thats the most Bullshit quote I have ever heard ,\nLmao makes no sense ,\nThat temporary problem will come back in another form or it isnt just temporary  and permanent solution??? Lmfao whoever quoted this must have believed that if someone doesnt commit suicide  then they will achive immortality and we never die expect by suicide wtf.\nA permanent solution? Bro wtf life isnt permanent itself then how can there be a permanent solution, there is only coping mechanism and escape, no solutions in many severe cases and if one solves a problem another problem arises  ,yes sometimes there is no point in being alive . \nI am totally againts this quote ,one day we will die anyway so why to keep enduring it till one dies naturally or accidentally what logic is that.",
      "created_utc": 1741201237.0,
      "score": 1
    },
    {
      "id": "mg7q2x8",
      "body": "Exactly. I was put on antidepressants at age 9 after I told my mother I wanted to die. I'm 22 now and I only feel worse.",
      "created_utc": 1741208283.0,
      "score": 1
    },
    {
      "id": "mgcomb4",
      "body": "Suicide is a permanent solution to a permanent problem",
      "created_utc": 1741278475.0,
      "score": 1
    },
    {
      "id": "mgf8b5x",
      "body": "My problems aren’t theoretically permanent, but I never have enough energy to solve them. I think it might be because of one issue that, in theory, could be resolved, but in practice, has been dragging me down my entire life. I was bullied almost every day until I finished high school, and even now, I still experience it from random people on the street because of how I look. Each day, it gets harder for me to work towards my goals. I'm 23 years old, a sober stimulant addict, autistic, have borderline personality disorder, and struggle with severe body dysphoria. I've never attempted suicide, but I've been thinking about it since I was 14. Sometimes, I believe I can reach my goals, but I just don’t have the energy to achieve them.",
      "created_utc": 1741305167.0,
      "score": 1
    },
    {
      "id": "mpb9odo",
      "body": "100% right to OP. It's a stupid fucking phrase that means literally nothing. I've heard so many people say \"suicide is a permanent solution to a temporary problem\" so often but they really don't know shit about why people resort to suicide in the first place. There's an endless list of things that are NOT Temporary. ",
      "created_utc": 1745762010.0,
      "score": 1
    },
    {
      "id": "mf5u49y",
      "body": "[removed]",
      "created_utc": 1740699686.0,
      "score": -20
    },
    {
      "id": "mf6oj9a",
      "body": "What the heck do you want people to say?",
      "created_utc": 1740710045.0,
      "score": -8
    },
    {
      "id": "mf6o786",
      "body": "bro, exactly. and people don’t get it.",
      "created_utc": 1740709927.0,
      "score": 46
    },
    {
      "id": "mf7re0c",
      "body": "Someone finally put it into words. We forced to be here because leaving will make everyone around us sad… what about ME?? What about the person that has to live to live in my body everyday and endure everything alone??",
      "created_utc": 1740726782.0,
      "score": 37
    },
    {
      "id": "mf6ejco",
      "body": "Well said. Real talk. 💯",
      "created_utc": 1740706543.0,
      "score": 19
    },
    {
      "id": "mf7bukz",
      "body": "It’s a waste of time and energy. I want peace.",
      "created_utc": 1740719008.0,
      "score": 10
    },
    {
      "id": "mfdbi26",
      "body": "The reason people say this particular phrase is because they only look at the surface of suicide cases. To them, it's someone committed suicide because of school or because of a break-up, not understanding that whatever they knew happened last might have simply been the last straw.",
      "created_utc": 1740797614.0,
      "score": 11
    },
    {
      "id": "mf6w4t7",
      "body": "You are so right.",
      "created_utc": 1740712757.0,
      "score": 9
    },
    {
      "id": "mf7067a",
      "body": "so perfectly said",
      "created_utc": 1740714256.0,
      "score": 7
    },
    {
      "id": "mg1vsa5",
      "body": "Problem doesn't exist if I don't exist.",
      "created_utc": 1741130556.0,
      "score": 2
    },
    {
      "id": "mpygc02",
      "body": "many mental illnesses are also \"permanent\". sure, you might learn to cope, manage, perhaps do therapy, take medication, but it will still be there, eating away at your sanity and will to continue on this path. like there's a huge thorn in your foot that you can't get out, but everyone expects/wants you to just keep walking anyway.",
      "created_utc": 1746068129.0,
      "score": 2
    },
    {
      "id": "mfcadia",
      "body": "Exactly.",
      "created_utc": 1740784894.0,
      "score": 1
    },
    {
      "id": "mfqtba0",
      "body": "It would be nice if we could stop having problems while alive. I'm not sure that's possible for anyone.",
      "created_utc": 1740985132.0,
      "score": 1
    },
    {
      "id": "mf69dir",
      "body": "[removed]",
      "created_utc": 1740704753.0,
      "score": 86
    },
    {
      "id": "mf6k1wd",
      "body": "Started when I was around 10 years old and has been a daily consistent struggle for me every FUCKING day since then and I’m 38 now. So when someone says that to me, I tell them that and usually they shut up.",
      "created_utc": 1740708463.0,
      "score": 32
    },
    {
      "id": "mf700kl",
      "body": "Just over 30 years for me as well.",
      "created_utc": 1740714198.0,
      "score": 11
    },
    {
      "id": "mf7clgl",
      "body": "same ive felt this way since i was 15",
      "created_utc": 1740719343.0,
      "score": 18
    },
    {
      "id": "mfaw3cz",
      "body": "It is last or for some also first act of free will.",
      "created_utc": 1740770422.0,
      "score": 12
    },
    {
      "id": "mg0jfq0",
      "body": "I'm 50 years old. I've been dealing with depression and suicidal thoughts since I was a kid. My mom first took me to a therapist when I was in 6th grade. I have wanted to kill myself since at least then. I actually tried twice, once at 18 and then again at 22. I seriously threatened to do so many more times than that. I've been hospitalized numerous times, although not since I was in my late 20s. That doesn't mean it's gone away, just that I hide it better.\n\nMy 20 year marriage ended a few years ago. We're still friends, but the spark just died. One of my kids is grown, while the other one is in high school. Now, I might lose my job and let them down, too.\n\nI want to die. I wish I could say it gets better, but I cannot. Every single time I think it has, the rug just gets pulled out from under me. I only wish I had had the courage to finish what I started decades ago so my kids wouldn't have to deal with it. I know it will be painful for them, but it will be far worse if I have to deal with the ever present agony of living much longer.\n\nI am a loser. I was born a loser. I need to die to put myself out of everyone else's misery. I'm not saying this is the right solution for anyone else, but it damn sure feels like the right one -- the ONLY one -- for me.",
      "created_utc": 1741116817.0,
      "score": 7
    },
    {
      "id": "mfcokad",
      "body": "u understand me",
      "created_utc": 1740789610.0,
      "score": 4
    },
    {
      "id": "mg6jr8o",
      "body": "I'm eighteen and I live with autism spectrum disorder. I get no help from my collage despite having a EHC plan, I wanted to do Criminology but they said I have to do English, maths to get to Criminology level 3 and work experience despite the fact that I have trouble with executive functioning, so I lack independence. My mum still looks after me, I can't even put my own socks on because of my dyspraxia, so my mum does it. I read a lot of books on psychology, I love academic books, because it's my interests. I have no friends in college, my family is extremely disconnected too. I only have my mum really and when she dies, I think I'll be alone. I've lost all motivation to keep working now. So, yes, you are right, it really is a beautiful thing, even just thinking about it makes you feel good.",
      "created_utc": 1741196557.0,
      "score": 3
    },
    {
      "id": "mfw2m37",
      "body": "agree sir! you understand",
      "created_utc": 1741053914.0,
      "score": 2
    },
    {
      "id": "mg4uyy0",
      "body": "People that say those phrases don’t even know what real problems are",
      "created_utc": 1741177003.0,
      "score": 4
    },
    {
      "id": "mf6k0vx",
      "body": "As somebody with chronic degenerative pain, I felt this in my soul.",
      "created_utc": 1740708453.0,
      "score": 32
    },
    {
      "id": "mfng223",
      "body": "Right? My biggest problem is literally permanent lol",
      "created_utc": 1740942178.0,
      "score": 2
    },
    {
      "id": "mf69rw4",
      "body": "LOL right?",
      "created_utc": 1740704890.0,
      "score": 28
    },
    {
      "id": "mf6dygl",
      "body": "It depends. I'm not appreciated by my family, so I'm not worrying about that.",
      "created_utc": 1740706341.0,
      "score": 26
    },
    {
      "id": "mf6ogbj",
      "body": "me. \n\ni figured if i am gonna end it, i gotta sell all my shit first. \n\nif at the end of selling i feel better cuz i own less bullshit and now have more money (major reason for my desire to gtfo of life), then i’ll stay. \n\nit’s a game i play w/ myself cuz i know i can’t do the deed until my mom’s dead. she deserves to be as happy as possible.\n\nand plus, i think part of me really believes i can make this shit happen. apparently i called 911 after attempting an OD back in 2021. waking up in the hospital after two days was a mindfuck.",
      "created_utc": 1740710017.0,
      "score": 13
    },
    {
      "id": "mg3yt56",
      "body": "Not true at all there’s plenty of people who are glad they are still alive after years of being suicidal. But of course that’s not the case for everyone",
      "created_utc": 1741158334.0,
      "score": 2
    },
    {
      "id": "mfngjnf",
      "body": "Felt.",
      "created_utc": 1740942323.0,
      "score": 1
    },
    {
      "id": "mf9rm2w",
      "body": "Realistically the phrase “I’m here for you” is just untrue. It’s not possible to be here for them when it’s continuous ongoing issue, heck it may even be looping in the worst cases. Sure u can try and be there for them, but I’ve always seen it as only alleviating some of the burden temporarily. You will always have to carry the burden at the end of the day",
      "created_utc": 1740758933.0,
      "score": 4
    },
    {
      "id": "mf7cywe",
      "body": "Thank you. I have 7 autoimmune diseases and I am so tired of it all. Including being a burden",
      "created_utc": 1740719509.0,
      "score": 8
    },
    {
      "id": "mf6j9te",
      "body": "More than 50 years of  clinical treatment resistant depression for me.",
      "created_utc": 1740708184.0,
      "score": 14
    },
    {
      "id": "mf6n3d8",
      "body": "Same and considering everything <30 are supposed to be our “best” years I’m not positive about the remaining years. Like statistically speaking, the chance of things getting better is low.",
      "created_utc": 1740709538.0,
      "score": 4
    },
    {
      "id": "mfqleh3",
      "body": "Same here.",
      "created_utc": 1740980829.0,
      "score": 1
    },
    {
      "id": "mpbbvty",
      "body": "Sounds about right! ",
      "created_utc": 1745762782.0,
      "score": 2
    },
    {
      "id": "mf65agn",
      "body": "This is a place for us to all vent about a phrase we’ve heard that has made us feel misunderstood. Evidently, you don’t understand either.\n\nThere’s no invalidating being done here. If it helps you, then great. It makes us feel like shit.",
      "created_utc": 1740703378.0,
      "score": 14
    },
    {
      "id": "mf6juna",
      "body": "There's a reason the sub's rules specifically state that people shouldn't tell folk here those tired cliches. They are unhelpful and can actually worsen the issue.",
      "created_utc": 1740708390.0,
      "score": 5
    },
    {
      "id": "mf6ng7r",
      "body": "You were on my other comment, replying similar things. Why do you go on a Suicide Watch subreddit only to invalidate the feelings of others? If this post isn’t about you, move along. Don’t make others feel bad for feeling the way they feel. You should be thankful you can’t relate if anything",
      "created_utc": 1740709663.0,
      "score": 2
    },
    {
      "id": "mf6g48v",
      "body": "Agreed.",
      "created_utc": 1740707087.0,
      "score": 1
    },
    {
      "id": "mfa74tt",
      "body": "Nothing",
      "created_utc": 1740763368.0,
      "score": 3
    },
    {
      "id": "mfbc3ot",
      "body": "And people tell you that your family will be sad . Okay but they’ll get over the sadness after a week or so. I just want to be dead already.",
      "created_utc": 1740774879.0,
      "score": 10
    },
    {
      "id": "mfql3sm",
      "body": "Especially when the people around make no effort to help or prevent it.",
      "created_utc": 1740980677.0,
      "score": 3
    },
    {
      "id": "mf8qc79",
      "body": "peace is subjective. i want it to end but i don’t want my pain to cause other pain. i just want mine to stop or at least not constantly",
      "created_utc": 1740746592.0,
      "score": 6
    },
    {
      "id": "mg4utgm",
      "body": "That’s another part of the insensitive mockery. They’ll say oh are you just gonna end your life over and then mention some minor trivial thing and then laugh at you. And then when you say it, it’s not because of that it’s because of some extremely deep unchangeable, tragedy, or series of tragedies the can’t be changed or ruined life. They just laugh at you and say oh that’s such a minor thing to take your life over they just don’t give a shit. ",
      "created_utc": 1741176933.0,
      "score": 1
    },
    {
      "id": "mpbadfj",
      "body": "I've read stories of people who've committing suicide for some really truly dumb shit and in those cases I would say perhaps that phrase applies, but for a lot of us, our reasoning behind suicide is not because of a \"temporary problem\", but instead one that is everlasting and/or chronic. ",
      "created_utc": 1745762255.0,
      "score": 1
    },
    {
      "id": "mrd7k81",
      "body": "Then just do it already if you think that",
      "created_utc": 1746763952.0,
      "score": 1
    },
    {
      "id": "mf6frpn",
      "body": "[removed]",
      "created_utc": 1740706969.0,
      "score": 20
    },
    {
      "id": "mf916ms",
      "body": "My biggest fear as well. I'm 21, been suicidal for two years, and there is still no change for the better. I'm afraid to imagine myself in my thirties and still being suicidal.",
      "created_utc": 1740750647.0,
      "score": 6
    },
    {
      "id": "mf8dmgi",
      "body": "Having suicidal thoughts long-term (since 1987) like I have doesn't necessarily have to be *the worst*. For my particular blend of MH stuff I was told and believe that my suicidal thoughts are escape fantasies; for me, it's a (distressing) way of coping with OTT emotions. To imagine not feeling bad is to imagine being dead. I am capable of feeling joy/okayness/excitement/pleasure/whatever, but when I'm feeling bad I just forget that. \n\n\nYMMV",
      "created_utc": 1740740385.0,
      "score": 5
    },
    {
      "id": "mf8dgoh",
      "body": "Is that me?",
      "created_utc": 1740740293.0,
      "score": 1
    },
    {
      "id": "mfbi1cp",
      "body": "I have been since i was 9 i am 25",
      "created_utc": 1740776537.0,
      "score": 1
    },
    {
      "id": "mg7szqg",
      "body": "Have you heard of \"The Telepathy Tapes\"?",
      "created_utc": 1741209091.0,
      "score": 2
    },
    {
      "id": "mpbasod",
      "body": "You're right. People just spit out random dumb shit phrases that aren't even based in reality. They are not us, so they don't have a lick of what we go thru. ",
      "created_utc": 1745762403.0,
      "score": 1
    },
    {
      "id": "mpbb6oy",
      "body": "The ones you hear about are the half percent of people who tried to commit suicide and failed, then went on to advocate against ever trying it. ",
      "created_utc": 1745762539.0,
      "score": 1
    },
    {
      "id": "mf7dp1v",
      "body": "I have 2 and feel like shit all the time .. u handling 7 .. man I feel you",
      "created_utc": 1740719832.0,
      "score": 4
    },
    {
      "id": "mf7xu5e",
      "body": "Ditto",
      "created_utc": 1740730589.0,
      "score": 2
    },
    {
      "id": "mf65vus",
      "body": "Exactly. This is our space.",
      "created_utc": 1740703574.0,
      "score": 11
    },
    {
      "id": "mf6q2on",
      "body": "[removed]",
      "created_utc": 1740710589.0,
      "score": -1
    },
    {
      "id": "mgar3zi",
      "body": "U say that now but there’s also amazing things to enjoy in life. We only get one experience why not live it up while u can ",
      "created_utc": 1741249443.0,
      "score": 1
    },
    {
      "id": "mf6gag7",
      "body": "If I **had** the ability to do it then I myself wouldn't hesitate",
      "created_utc": 1740707146.0,
      "score": 34
    },
    {
      "id": "mf79v9b",
      "body": "Oooooeee I feel that. I often daydream about different scenarios around trying that to solve the puzzle of my perfect exit. It’s either this over dramatic production or like running into a vast wilderness alone so the animals and the land can claim my otherwise useless existence. Then my family pops into my head and ruins the entire fucking thing. I’m a coward to the guilt of what it would do to them. Feels like being a prisoner sometimes but I find some solace that they’re worth it. Thanks for letting me get that off my chest 😮‍💨",
      "created_utc": 1740718144.0,
      "score": 20
    },
    {
      "id": "mf8p24f",
      "body": "the cowardice is failing to be strong for people who cannot afford to stand alone. think of the consequences of a comment then think of how shitty you have to be to ask someone who is here to do it",
      "created_utc": 1740746058.0,
      "score": 0
    },
    {
      "id": "mf8p3un",
      "body": "eat hot shit dude",
      "created_utc": 1740746079.0,
      "score": 0
    },
    {
      "id": "mf9bsrx",
      "body": "[removed]",
      "created_utc": 1740754195.0,
      "score": 4
    },
    {
      "id": "mg8erob",
      "body": "No, I haven't. I just looked it up. It looks interesting",
      "created_utc": 1741215219.0,
      "score": 2
    },
    {
      "id": "mf7dzr9",
      "body": "It fucking sucks. I’m sorry you have 2. My wife left because she was “tired of taking care of me” and she cheated. And no one understands why I want to end it all",
      "created_utc": 1740719963.0,
      "score": 5
    },
    {
      "id": "mf6xz12",
      "body": "If you get pissed about suicidal people being on a suicide subreddit this place isn’t for you and you need to get out or someone will alert the mods to do it for you. Maybe the downvotes tell you that your advice (although meant well) is not appreciated and therefore is better kept to yourself next time",
      "created_utc": 1740713433.0,
      "score": 5
    },
    {
      "id": "mf83ph3",
      "body": "I live alone. And my family finding my rotten body scares me more than anything.",
      "created_utc": 1740734302.0,
      "score": 7
    },
    {
      "id": "mf8pr1x",
      "body": "[removed]",
      "created_utc": 1740746348.0,
      "score": 1
    },
    {
      "id": "mfar4f2",
      "body": "I genuinely wish you luck and all the best. I truly hope you'll get better, even when it seems there's no hope",
      "created_utc": 1740769034.0,
      "score": 1
    },
    {
      "id": "mgego2y",
      "body": "I just want to bring to your attention that there's more to the materialism of this \"physical\" world.\n\nMaybe you can develop some of these skills because it'll be easier for you since you have the autism ability. You're more connected to the real world than the \"voice speakers\". The real world is everything that's unseen.\n\nWhen you develop these other skills maybe many doors will open up to you and you can work in the criminology field but in a different capacity.",
      "created_utc": 1741296423.0,
      "score": 2
    },
    {
      "id": "mf99lvh",
      "body": "Was about to say \"well, you could just...\" and then I realized that problem solving probably isn't the right play here",
      "created_utc": 1740753487.0,
      "score": 6
    },
    {
      "id": "mfb4nqb",
      "body": "I can’t abandon my cats, they’re all I have.",
      "created_utc": 1740772788.0,
      "score": 3
    },
    {
      "id": "mf8tjh3",
      "body": "no one told you to tell others to harm themselves. i don’t wish that for you or anyone. hear yourself. you don’t want it now. if you want others to live that mean you think there are things to live for",
      "created_utc": 1740747870.0,
      "score": 1
    }
  ]
}