{
  "id": "1kg1v5a",
  "title": "\"if you're actually suicidal, you would did it already\"",
  "selftext": "Fuck u, fuck u. Everyone who was depressed, suicidal or had other serious issue knows how fucking hard it is to overcome your natural instinct. ",
  "created_utc": 1746530131.0,
  "score": 1194,
  "num_comments": 136,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1kg1v5a/if_youre_actually_suicidal_you_would_did_it/",
  "comments": [
    {
      "id": "mqv7kaq",
      "body": "Yeah this isn't how suicide works. It's not, oh I need a pee I'll go to the bathroom. It's the weight of a nightmare and depression growing larger and larger until it's rivaling our instinct to survive. Then they fight it out and we attempt suicide or fail. And it's exhausting as fuck having your brain have the conversation / battle with itself for weeks and weeks until the breaking point arrives and one of them wins until the next time.",
      "created_utc": 1746530730.0,
      "score": 383
    },
    {
      "id": "mqvafp3",
      "body": "This this is why people still commit suicide - everyone’s always like just reach out and ask for help & the helps like “I’m sure you’ll be fine” or just puts you on medication that makes it worse",
      "created_utc": 1746531998.0,
      "score": 123
    },
    {
      "id": "mqvfrnd",
      "body": "A lot of people fail to understand that suicide isn't literally the wish to die. It's being in so much pain to a point where we can't endure the pain anymore. While our heart might have a deathwish, we human naturally have a system that WILL keep us alive, no matter what. Until the heart overpowers that survival instinct and we actually following through.\n\nThat's why I don't like the wording of \"commiting suicide\". It's not an active choice but rather our Mental Illness taking fully over. (in most cases.) After years of constant battling to maintaining control. .\n\nFeeling suicidal is also a warning sign of our brain saying \"Something is REALLY REALLY WRONG HERE AND WE LOOSE RESOURCES TO COPE!\" (sorry for the caps, I just wanted to demonstrate how loud this warning sign is!\" \n\nIt's literally like losing control of your car for minutes, hours, days, months. Sometimes even years. (especially if society lets you drive with this broken car without offering help (for example, a better health care system, more and better access to qualified Therapy etc).",
      "created_utc": 1746534184.0,
      "score": 75
    },
    {
      "id": "mqvivq4",
      "body": "People that say that shit are legit brain dead. Not a single working brain cell. ",
      "created_utc": 1746535387.0,
      "score": 43
    },
    {
      "id": "mqwy2pn",
      "body": "I mean I don't wish to live, everyone already seems fake to me like others mentioned before. Therapy is a joke, suicide hotline is a joke, and I'm just hoping one day to take myself out.",
      "created_utc": 1746550973.0,
      "score": 27
    },
    {
      "id": "mqy39f5",
      "body": "If I had a guaranteed painless, fearless option, I’d take it. If an anesthesiologist came to me and said “we’re going to put you under and stop your heart but you have to go right this minute,“ I would extend my arm and say “go for it!”. I’m suicidal However, if I had a choice to wait until I’m beyond my breaking point, I  would try to hold out, a little longer. I’ve played the anesthesia role over and over again, in my head. I think about it every day. Anesthesia is the only thing I want. It’s fucking great. Your whole body could be shredded and you’d never know. The legality and money comes into play. Darn. 🌊",
      "created_utc": 1746562734.0,
      "score": 17
    },
    {
      "id": "mqx24p9",
      "body": "If anyone said that to me I'd lose my shirt because I'm actually trying so hard to get rid of my self preservation instinct. Building tolerance for pain and all. Does it really mean nothing when someone is fighting their own body's will to live as long as they don't commit?",
      "created_utc": 1746552105.0,
      "score": 11
    },
    {
      "id": "mr0t7aa",
      "body": "i’m so tired",
      "created_utc": 1746598140.0,
      "score": 10
    },
    {
      "id": "mqvegzz",
      "body": "In a world that makes you suicidal to begin with, it's just more of the same. It's a display of them, not you. How people treat us tells us about them, how we respond tells about us.",
      "created_utc": 1746533668.0,
      "score": 20
    },
    {
      "id": "mr2asew",
      "body": "It’s actually a bit more difficult than just swallowing some random bottle of pills like the movies make it out to be. People will watch some movie where they just simply slit a wrist and lay in a tub and assume it’s that simple.",
      "created_utc": 1746625059.0,
      "score": 7
    },
    {
      "id": "mqxctre",
      "body": "There's probably a time if circumstances around or inner don't change, where the survival instinct turns to plan to save you from further suffering/pain instead of living survival.",
      "created_utc": 1746555125.0,
      "score": 7
    },
    {
      "id": "mqzxsa2",
      "body": "Whoever says that is a brain dead moron. Humans thrive to live, we want to live. It's ingrained in us. That's why it's so hard to commit suicide. Doesn't mean you're any less suicidal or don't wish it was all over.",
      "created_utc": 1746584274.0,
      "score": 6
    },
    {
      "id": "mqvdp1j",
      "body": "[removed]",
      "created_utc": 1746533355.0,
      "score": 8
    },
    {
      "id": "mqw4qhs",
      "body": "You don't wanna die, you just wanna get out of it, death is not what you want , actually what you want is life, what you in is not liveble life, that's why we just don't kill ourselves.",
      "created_utc": 1746542539.0,
      "score": 8
    },
    {
      "id": "mqwvngz",
      "body": "It's a ever going battle. Also I recently have a new one. Burn Burn Burn everything.",
      "created_utc": 1746550298.0,
      "score": 4
    },
    {
      "id": "mqzotgn",
      "body": "See that’s what I’m thinking and it makes each day harder \n\nI’m failing to meet expectations here\n\nAmong other thoughts",
      "created_utc": 1746581231.0,
      "score": 3
    },
    {
      "id": "mr03u0u",
      "body": "[deleted]",
      "created_utc": 1746586466.0,
      "score": 4
    },
    {
      "id": "mqxqmq6",
      "body": "People who are suicidal don’t really want to die we just want to end the never stopping pain so we want to take the only way out which goes against our natural instinct. People always say like: Oh just call a hotline, get therapy, get better. Not gonna work. We need real help and like a wonder that will change our lives otherwise were just lost completely.",
      "created_utc": 1746559119.0,
      "score": 7
    },
    {
      "id": "mr16323",
      "body": "My sister always says this to me",
      "created_utc": 1746605958.0,
      "score": 3
    },
    {
      "id": "mr2xeld",
      "body": "that’s disgusting actually killing your self takes a bloody lot to go threw with i’ve tried enough \nfind one thing to cling on to and like for mine are my kids even tho my daughter hates me takin my life would destroy there’s\nbut i’m still depressed and suicidal just have to fight every day",
      "created_utc": 1746631870.0,
      "score": 3
    },
    {
      "id": "mr8ezp6",
      "body": "“Just cheer up” is what I used to hear all the time",
      "created_utc": 1746707121.0,
      "score": 3
    },
    {
      "id": "mrcj4dn",
      "body": "yes, continue to reach out for help.  vent it out here online, or to anyone who might listen.",
      "created_utc": 1746754051.0,
      "score": 3
    },
    {
      "id": "mr7oskk",
      "body": "That's a dumb comment.",
      "created_utc": 1746693863.0,
      "score": 2
    },
    {
      "id": "mr2mr79",
      "body": "I wonder how they would feel about the impact of their words with if action was planned and  the next day. Their way of thinking will bite them I the ass eventually. And I hope it haunts them.",
      "created_utc": 1746628771.0,
      "score": 1
    },
    {
      "id": "mr6ltuv",
      "body": "For others - a weirder part might be attempting but then backing off. Like they might say \"why didn't you do it?\" bitch do it yourself and THEN ask why.\n\nActually seeing YOURSELF at the edge makes you have a moment of the  biggest realizations in life. Biggest question and THE BIGGEST decision. Do it or not? And for some it's an easy decision, but for others, it's a difficult, rock tough one. I know from my own experience. I tried not just once, and before each I asked myself. \"Do I really want to do it?\". And out of 4 or 5 \"attempts\" only ONE was an actual attempt. But failed - an ambulance knocked at my door when I was about to.",
      "created_utc": 1746673178.0,
      "score": 1
    },
    {
      "id": "mr7prat",
      "body": "I had two good friends who did.I often wonder why I didn’t .At one time one of them even brought up the idea of taking me out then himself.I thought about it I really did.Unfortunately they ended up doing it.Not at the same time they didn’t know each other but a year apart.I think why could they and I couldn’t?",
      "created_utc": 1746694471.0,
      "score": 1
    },
    {
      "id": "mrb0a66",
      "body": "everyone in my life tells me \"well we all wanna die we just choose to stay here\" is this really fucking true?  so me wanting to die on and off for 10 years with gory visuals of my dead body something that every single person experiences?  because according to the way my family, friends, coworkers, etc we all always wanna die.  whenever i say stuff about wanting to die they always respond with \"well u think i dont?\"  always making it about them smh",
      "created_utc": 1746735344.0,
      "score": 1
    },
    {
      "id": "mrie23i",
      "body": "It’s a little different when you’re bi polar",
      "created_utc": 1746836361.0,
      "score": 1
    },
    {
      "id": "mrmnxxu",
      "body": "Is English your first language?",
      "created_utc": 1746902507.0,
      "score": 1
    },
    {
      "id": "mrmwyfe",
      "body": "Yea all... IM FUCKIN TRYING ITS HARD. My plan is too messy, idk where to get tarp to cover my bathtub, what if someone needs to clean it after, or if they move my body, the blood would spill on the floor and my roommate wouldn't....\n\n\nJesus nvm, point is there's much planning that needs to go into it or else someone will have to clean up your smelly poor body since...body kinda starts to get a bit messy after you pass.",
      "created_utc": 1746905625.0,
      "score": 1
    },
    {
      "id": "mrp52g8",
      "body": "And if you fail An attempt then they might hospitalize you and you have to pretend to get better to gain back independence and freedom",
      "created_utc": 1746936264.0,
      "score": 1
    },
    {
      "id": "ms0iedw",
      "body": "I've been thinking about it for many, many years. The only reason why I haven't is because I don't want to hurt my family and friends.\n\nFuck those who minimize this issue.",
      "created_utc": 1747098385.0,
      "score": 1
    },
    {
      "id": "ms0j1a5",
      "body": "I’m so tired, and that line alone makes me want to off myself even more.",
      "created_utc": 1747098609.0,
      "score": 1
    },
    {
      "id": "ms2f99k",
      "body": "The thing with me is although incredibly suicidal, I'm trying to hold back. \n\nThe reasons for being suicidal is because my life is completely ruined and just cannot be changed. Something happened to stuff my life up so badly that I'm at rock bottom all the time. There's no getting better, improving or changing things. \n\nThat's not to say I've got it the worst, but certainly people have killed themselves over less. \n\nI often feel too gutless to do something so final, but that doesn't mean I wouldn't do it, but instead, I do health damaging things that's more like slow suicide such as having mega drinking blowouts and eating junk. Somewhat to make life more bearable but also for it to be not me who has to make the choice as to when and how. The booze will kill my liver, the junk food stop my heart, but it won't be me having to decide when and where.",
      "created_utc": 1747131654.0,
      "score": 1
    },
    {
      "id": "ms4ymn0",
      "body": "It's only a matter of time I think... Those of us who are still young have some hope to cling on to... But as the years go by and you realize your life is never gonna improve no matter how hard you try, then it's time to call it quits.",
      "created_utc": 1747161807.0,
      "score": 1
    },
    {
      "id": "mt66ivt",
      "body": "just wanna say thanks for this post. also any notion of having plenty to live for, or you have so much going for you just hurts more.",
      "created_utc": 1747681899.0,
      "score": 1
    },
    {
      "id": "mtpiru9",
      "body": "I’ve tried but failed",
      "created_utc": 1747941951.0,
      "score": 1
    },
    {
      "id": "mtprcge",
      "body": "I (34F) have started to feel like this since 2023. Dark thoughts, ways to die that won't be hard to clean up, when and where. If I should leave a letter. The whole scenario over and over again. It's exhausting trying to keep my mind busy from the thoughts. I have also noticed myself wanting to interact with my family less and less , like if I'm not around the death won't hurt as much. My mother has noticed and has tried to talk to me but all I can see is I'm worrying her even more. The only thing keeping me from actually doing it is my life responsibilities. I feel like an NPC in this world. Given directions and orders.",
      "created_utc": 1747944476.0,
      "score": 1
    },
    {
      "id": "muiucnt",
      "body": "I don't think people get how frustrating it is, wanting to die but not being able to do it. Idk, am I not brave enough to do it? Idk. But the way my brain blanks out at the thought of killing is inexplicable. Something is soothing about thinking of dying, but it's a torture not being able to do it.",
      "created_utc": 1748356932.0,
      "score": 1
    },
    {
      "id": "mqw4zdf",
      "body": "You don't wanna do that, you just wanna get out of it, it's not what you want , actually what you want is life, what you in is not liveable life, that's why we just don't do it.",
      "created_utc": 1746542613.0,
      "score": 0
    },
    {
      "id": "mqx37hq",
      "body": "[deleted]",
      "created_utc": 1746552403.0,
      "score": -3
    },
    {
      "id": "mr0hc6v",
      "body": "[deleted]",
      "created_utc": 1746592035.0,
      "score": 0
    },
    {
      "id": "mqxhdme",
      "body": "it is.. but here is the catch, it does get easier. Try finding someone to talk to and it will be easier",
      "created_utc": 1746556432.0,
      "score": -5
    },
    {
      "id": "mqvaoyx",
      "body": "that’s decently demonstrated!! please don’t mock me for this (or maybe i’m okay with that): i’ve told my dr nearly the same thing that i didn’t think i was actively suicidal but those difficult thoughts kept popping in almost intrusively and it’s been so hard, SO HARD, to even try to argue against. \n\n‘i’m sorry, dr [*name*], it’s just so exhausting to tell myself out of this on a daily basis for an indefinite period. i think i’ll get sick of this and consequently give up some day.’",
      "created_utc": 1746532109.0,
      "score": 51
    },
    {
      "id": "mqvxsyu",
      "body": "honestly.. people who haven’t experienced it will never know the pain leading up to the attempt, or even the joy, which at least I experience, when someone who is suicidal thinks they’re finally going to die. People who aren’t suicidal can’t understand what it is like to WANT to die or to actively try to. If you didn’t succeed, no one really cares or they call you selfish for attempting and reminding of you of “just how many people want you here”, if you succeeded, all of a sudden it’s tears and saying how unexpected it was..",
      "created_utc": 1746540446.0,
      "score": 45
    },
    {
      "id": "mqvdmc9",
      "body": "Honestly it can go on for years",
      "created_utc": 1746533325.0,
      "score": 30
    },
    {
      "id": "mr1ke8x",
      "body": "people forget that fight is a civil war. no matter who wins you still lose",
      "created_utc": 1746614609.0,
      "score": 12
    },
    {
      "id": "mqzh4xj",
      "body": "You explained it perfectly",
      "created_utc": 1746578503.0,
      "score": 7
    },
    {
      "id": "mqv81m4",
      "body": "Exactly this!!​",
      "created_utc": 1746530950.0,
      "score": 10
    },
    {
      "id": "mqy2wmo",
      "body": "Not even from non-depressed people. One time I told the story how I tried to jump in front of a train when I was 13yo. Head-wise, I was completely convinced...but my legs just wouldn't move. Just like that. Stone pillars. I joked that \"I'm not even good at dying\", because my survival instinct was just too damn high. In fact, it still is, and the reason I gave up after enough attempts.\n\nGot the reply \"Guess you aren't *truly* suicidal. If you were, 'survival instinct' wouldn't be a problem\"\n\n...like. bruh. Are you serious? his is not the time to play depression-Olympics! Are you trying to gatekeep suicide? Are you trying to push said person to try again?! Holy hell!",
      "created_utc": 1746562637.0,
      "score": 35
    },
    {
      "id": "mqxr8u7",
      "body": "Lol right. All the medication that's supposed to help has suicide ideation and depressions as a side effect 😂",
      "created_utc": 1746559299.0,
      "score": 15
    },
    {
      "id": "mqvdx3o",
      "body": "[removed]",
      "created_utc": 1746533444.0,
      "score": 14
    },
    {
      "id": "ms7jdcb",
      "body": "Or no one actually cares. I told my husband a few days ago I was having these thoughts and he told me today he’s just waiting for me to be gone. He’s literally waiting for me to complete. So sometimes it’s just that the world’s better when you’re gone. I can’t leave. I don’t have the money or anywhere to go. The only way out for me.",
      "created_utc": 1747192258.0,
      "score": 1
    },
    {
      "id": "mr57qch",
      "body": "They really have a skewed perception of what it actually is, the survival instinct doesn't go away.\n\nThere's even a story of a brother of a man that killed himself, where he says he thought his brother was a coward, until he caught the same \"bug\" and kept going to the cliff and sitting there, not able to do the thing that his brother did. He says that's the moment he realized in how much pain his brother was to do what he couldn't.\n\nUnfortunately only people who can really get us are others who feel the same way.",
      "created_utc": 1746655736.0,
      "score": 14
    },
    {
      "id": "mr3wcjx",
      "body": "Wow bro, that was so... it !",
      "created_utc": 1746641869.0,
      "score": 4
    },
    {
      "id": "ms1jmry",
      "body": "Interesting you used an out of control car as your analogy .. my fiancé died by suicide 9 months ago.. I just had a dream the other night where my consciousness was with his standing on a shoreline and we were both watching his body in this car as he drove the car onto  these plastic slippery docks. The car was out of control, swerving almost fishtailing off the docks , I was yelling at him from the shore to slow the car down because it was going too fast slipping around on this narrow dock that had all these different directions like a maze but some broken or missing pieces .. the car eventually slipped off one of the docks the back wheels were hanging off and I was yelling at him to get out of the car and push it back up.. but then it just sank. I feel the dream really helped me process how out of control the situation was for both him and myself",
      "created_utc": 1747113052.0,
      "score": 1
    },
    {
      "id": "mqx5awd",
      "body": "Same here, I feel like a complete outsider even when surrounded by family. No one cares! It is the harsh truth. The longer I pretend to be someone else the more I want to off myself, therapy isn't helping just meds after meds, I just can't cope with how everything is.",
      "created_utc": 1746552993.0,
      "score": 12
    },
    {
      "id": "mr5r2rc",
      "body": "I’m hoping to just go in my sleep",
      "created_utc": 1746662292.0,
      "score": 8
    },
    {
      "id": "mryoij7",
      "body": "Me too",
      "created_utc": 1747077147.0,
      "score": 1
    },
    {
      "id": "mr4pj7g",
      "body": "If there were a way out, no pain, no waking, just the switch turned off, I’d reach for it with steady hands. I’ve already made peace with leaving. I’ve left in my mind a thousand times. Now, I’m only here for the delay.",
      "created_utc": 1746650297.0,
      "score": 12
    },
    {
      "id": "mryorfz",
      "body": "I wish this would happen. Why are we obligated to stay when we don't want to?... painless and guaranteed death would be good for everyone...",
      "created_utc": 1747077221.0,
      "score": 3
    },
    {
      "id": "mrbsyh1",
      "body": "A thought that never leaves my mind , literally just want some peace, I’m tired",
      "created_utc": 1746744495.0,
      "score": 6
    },
    {
      "id": "mqvlmak",
      "body": "[removed]",
      "created_utc": 1746536395.0,
      "score": 13
    },
    {
      "id": "mr1jl5v",
      "body": "My husband told me to go  ahead and do it I didn’t not know why I’m still here",
      "created_utc": 1746614201.0,
      "score": 3
    },
    {
      "id": "mqxqwlx",
      "body": "Btw not very nice of you with the fuck you’s, there are people here who are in a dark place and need a bit of light and then you’re just being a storm thats covering the sun.",
      "created_utc": 1746559198.0,
      "score": 0
    },
    {
      "id": "mrqcuno",
      "body": "That is not a normal response",
      "created_utc": 1746961953.0,
      "score": 1
    },
    {
      "id": "mqx4ufl",
      "body": "What other way?",
      "created_utc": 1746552862.0,
      "score": 4
    },
    {
      "id": "mr0hrll",
      "body": "What? I tried to kill myself 3 times. It's not my quote, i was told that. Did you read whole post? The title is in \"\"",
      "created_utc": 1746592232.0,
      "score": 1
    },
    {
      "id": "mqxtjnt",
      "body": "Not everyone has someone to talk to and that's part of the problem.",
      "created_utc": 1746559969.0,
      "score": 8
    },
    {
      "id": "mr53r4i",
      "body": "That's been my experience as well, I have a feeling how this will end, sooner or later...",
      "created_utc": 1746654464.0,
      "score": 13
    },
    {
      "id": "ms02x4c",
      "body": "The thoughts occur Every 20 minutes of every waking hour since 2012 here….still going….somehow",
      "created_utc": 1747093060.0,
      "score": 1
    },
    {
      "id": "mqzuhno",
      "body": "Years and 5 planned serious attempts.. lots of experience.",
      "created_utc": 1746583137.0,
      "score": 9
    },
    {
      "id": "mqy4v8z",
      "body": "Exactly my experience! Because I don’t “actively” have a plan to die, they care less\n\nApparently wanting to be dead all the time isn’t a mental illness anymore",
      "created_utc": 1746563178.0,
      "score": 24
    },
    {
      "id": "mrbsaak",
      "body": "Me too",
      "created_utc": 1746744259.0,
      "score": 5
    },
    {
      "id": "mr5zq49",
      "body": "That is mythology that people like to hear.",
      "created_utc": 1746665359.0,
      "score": 1
    },
    {
      "id": "mrkoa1b",
      "body": "I feel exactly the same, I would sign right now like this.",
      "created_utc": 1746877352.0,
      "score": 2
    },
    {
      "id": "ms1k5od",
      "body": "What about the people you love? You don’t think about them? I’m genuinely just curious . My fiancé died by suicide 9 mo the ago and im so broken… i just question if he ever loved me at all . I feel like I wasn’t worth staying for and it all just hurts too much for me sometimes",
      "created_utc": 1747113318.0,
      "score": 2
    },
    {
      "id": "msa4kdo",
      "body": "Even if there was a switch, it'll still take a huge mind battle to pull it, that's the hardest part about suicide",
      "created_utc": 1747234943.0,
      "score": 2
    },
    {
      "id": "mr72y9x",
      "body": "Exactly! You summed it up in 3 sentences. 🌊",
      "created_utc": 1746680849.0,
      "score": 1
    },
    {
      "id": "mryonnl",
      "body": "Me too",
      "created_utc": 1747077190.0,
      "score": 1
    },
    {
      "id": "ms378pi",
      "body": "“Why are we obligated to stay when we don't want to?” Excellent question. I ask myself this question every day, especially when I see others doing very risky, dangerous, LEGAL activities that could lead to serious injuries or death. But, that’s their freedom. Their choice. Where’s OUR freedom and choice, right? 🌊",
      "created_utc": 1747143169.0,
      "score": 1
    },
    {
      "id": "mqw0hhv",
      "body": "[removed]",
      "created_utc": 1746541263.0,
      "score": 3
    },
    {
      "id": "mr4qnxt",
      "body": "Even if you find the strength to stay,  and I hope you do, his words will echo long after the pain fades. A man who meets your suffering with silence or permission to disappear is not a safe place to rest your heart. Love is proven in the moments we shatter. And when someone can watch you bleed and simply say “go ahead,” they are telling you who they truly are. Believe them. You didn’t deserve that kind of emptiness,  not then, not ever.",
      "created_utc": 1746650614.0,
      "score": 3
    },
    {
      "id": "mqx5o6d",
      "body": "[deleted]",
      "created_utc": 1746553101.0,
      "score": -7
    },
    {
      "id": "mr2n0f0",
      "body": "Or the money to achieve the results desperately needed.",
      "created_utc": 1746628847.0,
      "score": 2
    },
    {
      "id": "mr5jng1",
      "body": "sigh… hopefully it gets better for you",
      "created_utc": 1746659783.0,
      "score": 6
    },
    {
      "id": "mtgbrjv",
      "body": "For me it's from 2021.. but still alive.. don't know how much long can keep going",
      "created_utc": 1747825586.0,
      "score": 1
    },
    {
      "id": "mre5adw",
      "body": "And the people who do it the first time? We all know how...",
      "created_utc": 1746783608.0,
      "score": 1
    },
    {
      "id": "mr0qw6j",
      "body": "Ok but seriously! I've had suicidal ideations since my preteens (I'm in my 30s now) and a few years ago my mother put herself in the hospital, I asked her what made her decide to go...she told me she had suicidal thoughts and that was why, when I told her that I have literally always had that she just kinda shrugged it off .....maybe a week later at like 3am(at work) i called a help line cuz I felt like I was in a crisis, they made me feel like it just wasn't enough and the line disconnected. So having suicidal thoughts all my life wasn't enough cuz I haven't had a active plan or I was faking it. I also grew up around \"suicidal ppl r selfish\" so talking about any suicidal thoughts was not a thing. Asking for help seems pointless most of the time",
      "created_utc": 1746596857.0,
      "score": 18
    },
    {
      "id": "mrpj5r0",
      "body": "It's not a mental illness if you have a logical, perfectly understandable reason to not want to be alive anymore.",
      "created_utc": 1746943607.0,
      "score": 3
    },
    {
      "id": "msfn97p",
      "body": "I will try to change the way you perceive it, if you are open to that.\n\nDepression is a lethal **symptom** of some kind of underlying problem: Debts, disability, poverty, PTSD, sexual abuse & bullying as a couple examples. Depression itself is as deadly as any other terminal illness. It is never a choice to \"*end your own life and leave everyone you love behind*\" but it is the result of being stuck in a situation with no other perceived - sometimes even objectivly - viable means to escape from your pain & worries. No one is going to forgive your overwhelming debts *(as an example)* because you are suicidal.\n\nYou dont get any breaks in society for being depressed - in contrast - cancer patients gets lots of sympathy for their situation. The ones judging suicidal people are the ones who havent experienced that amount of mental anguish themselves. As it is very common in society for people to shame the deceased who was \"weak and selfish\" in their opinion.\n\nYou dont commit suicide, you die of depression. It builds little by little over time, often over many years. Until it becomes unbearable. Pessimistic outlooks on life is not attractive for partners nor does it make it easier to make any friends. Depression ruins everything in your life slowly. Until you are left like a shell of your former self. It feels like your soul and personality died long before your body gets to leave. Yet it is expected of you to still function in your day-to-day life.\n\nA cancer patient can love their partner very much and still die from it. It is exactly the same way with depression. It is not a choice but a result of untreated unbearable pain. I am 100% that your partner loved you very much and I am sorry for your loss.",
      "created_utc": 1747310245.0,
      "score": 2
    },
    {
      "id": "ms38rgf",
      "body": "Right? I can totally see a world where suicide is legal. Legal and painless.\n\nNot everyone who wants to die will go through with it anyways.\n\nWe have so many people in this world already, and people who decide to go, go with so much pain and suffering. Suicide SHOULD be legal. Nobody should be forced to stay here when they don't want anymore, and they should be allowed to go in a calm way.\n\nI would love to. I'm really tired of it",
      "created_utc": 1747143675.0,
      "score": 2
    },
    {
      "id": "mscz74m",
      "body": "Same bc like I don’t want to shock ppl that would walk by and retrieve my body, I don’t want to inconvenience ppl going to work or delay any trip, I don’t want to be a burden to the ppl that would have to clean up the scene, but you can only die with dignity when you’re physically ill in like Belgium or other countries like that and I’m like, guys we are just at the end or our own road",
      "created_utc": 1747265761.0,
      "score": 2
    },
    {
      "id": "mqw49md",
      "body": "[removed]",
      "created_utc": 1746542400.0,
      "score": 2
    },
    {
      "id": "mqx673u",
      "body": "What do you think i did almost my whole life?",
      "created_utc": 1746553253.0,
      "score": 9
    },
    {
      "id": "mr5ot6c",
      "body": "You too",
      "created_utc": 1746661513.0,
      "score": 4
    },
    {
      "id": "mrklyao",
      "body": "How? pills?",
      "created_utc": 1746876208.0,
      "score": 1
    },
    {
      "id": "mso0ubr",
      "body": "Thank you for that, I really appreciate it. While I recognise it as an illness just as cancer and totally agree with you that it should be viewed in the same way,  the emotional wounds that his suicide  left me with just can’t catch up with that understanding and it’s left me in such excruciating pain that I’ve contemplated taking my own. I appreciate your response though I hope to someday have my emotions catch up and really believe in the love sometimes I am there but then I’ll spiral back into feeling so confused and not understanding again. It’s been a vicious cycle that I hope to heal and break out of .",
      "created_utc": 1747419422.0,
      "score": 1
    },
    {
      "id": "ms3da9a",
      "body": "Welp, dead people don’t generate medical bills. I’m so tired of the hypocrisy, regarding suicide. 🌊",
      "created_utc": 1747145117.0,
      "score": 1
    },
    {
      "id": "mqxajfg",
      "body": "[deleted]",
      "created_utc": 1746554472.0,
      "score": -4
    },
    {
      "id": "mr5p77k",
      "body": "thanks & take care",
      "created_utc": 1746661646.0,
      "score": 4
    },
    {
      "id": "mr3xe2x",
      "body": "Lol sorry but go and sleep",
      "created_utc": 1746642171.0,
      "score": 3
    }
  ]
}