{
  "id": "1h16gl0",
  "title": "i think i am a pedophile.",
  "selftext": "i feel so disgusted with myself. i’m nauseous and overwhelmed.\n\ni am attracted to my best friend’s 14 year old brother. he just turned 14, i am 19. i’ve known about him, but last week i officially met him, he reminds me of my ex i dated in high school\n\ni got drunk with my best friend and i couldn’t stop telling her brother how handsome he was and played with his hair. i kept asking him if he was comfortable but what the fuck is wrong with me he doesn’t know any better\n\ni want to fucking kill myself the thoughts won’t go away, i can’t stop thinking about him. i have a wonderful boyfriend but i can’t stop thinking about this KID???????? it’s driving me insane. i’ve never experienced anything like this, i’m losing my mind. \n\nedit: everyone’s being so helpful and nice, thank you for the honesty. i will be seeking help, i don’t want to go down a dark path",
  "created_utc": 1732720160.0,
  "score": 648,
  "num_comments": 222,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1h16gl0/i_think_i_am_a_pedophile/",
  "comments": [
    {
      "id": "lz98a04",
      "body": "[removed]",
      "created_utc": 1732722077.0,
      "score": 916
    },
    {
      "id": "lzcfuxl",
      "body": "Aside from the therapy comments I'd also suggest not getting drunk around him again",
      "created_utc": 1732760702.0,
      "score": 68
    },
    {
      "id": "lza7b41",
      "body": "You might not be attracted to him, but the fact he reminds you of your ex.",
      "created_utc": 1732732929.0,
      "score": 197
    },
    {
      "id": "lz9d3ha",
      "body": "Seek therapy. You can talk to them about this, and you won’t get in trouble. In the meantime , management is key. Keep your distance and do not interact with the kid. If this is the only younger person you’ve been attracted to I doubt you’re a pedophile. Just the years ago it would be not normal but accepted that a 19 ur old date a 14ye old. In fact when I was in high school seniors dated freshman. It was icky but not pedophilia. For your sake and the kids… do not interact and do not drink around him? Find a therapists so you can work on why you are attracted to this person AND why you are tempted to cheat on your current partner. There are two issue here. Good luck. I think you’ll be fine in the long run.",
      "created_utc": 1732723608.0,
      "score": 318
    },
    {
      "id": "lz9v23e",
      "body": "I’m spitballing here but there’s a couple important points to bring up in therapy:\n\nA) Have you had sexual thoughts about other minors?\n\nB) What was your relationship with your ex like? Was there any trauma or perhaps the relationship ended without closure of some kind? Our brains have a hard time understanding past and present, especially where trauma is involved. It’s why we can get panic attacks 10 years after an event/why old folk feel 21 when they’re 89.\n\nI’m sort of concluding that your brain is stuck somewhere in that past relationship and it’s been involuntarily triggered. Also be careful when drinking. We all make mistakes when drunk but flirting with minors is an unspoken boundary that you don’t cross. \n\nTry to see it as a situation that could have been worse but has been caught early. Sadly you’re not the first 19 y/o to flirt with a minor. But you actually don’t want to and know it’s fucked, so seek some help. \n\nGood luck x",
      "created_utc": 1732729164.0,
      "score": 104
    },
    {
      "id": "lz9l9nk",
      "body": "Being honest with yourself and admitting it to us was the first step. Seek help and make sure you aren’t drinking around him again. This doesn’t seem like pediphilia to me, as it seems you might just be into him cause he looks like your ex.",
      "created_utc": 1732726133.0,
      "score": 82
    },
    {
      "id": "lz9c0c6",
      "body": "Hey, look you did the right thing coming on here and being honest about it. That’s the first step many people don’t take , and it takes a lot of courage to be honest about it. This doesn’t make you inherently bad, you know deep down it’s wrong, and if you haven’t acted on it, there’s clearly a good conscious clouded behind those thoughts. This is what I would start with, what do you think makes you feel attracted to them ? I would look into therapy, specifically someone who deals with this type of issue (I don’t know any specific, but I’ve seen resources online that you can go to when having these thoughts, that can point you in the right direction. Imo a lot of those thoughts come from some subconscious issues that cause the desire to do these things ) but as I said you coming on here and being open  about it is the first step, and very good of you to come out and be honest , looking for help.",
      "created_utc": 1732723261.0,
      "score": 51
    },
    {
      "id": "lzad2xl",
      "body": "this is why anti-recovery for paraphilias is so awful. Please go and seek help. Go to a doctor, you haven't done anything awful yet, so you have time. Please please please seek help.",
      "created_utc": 1732734724.0,
      "score": 38
    },
    {
      "id": "lz9iw91",
      "body": "Prostatia.org \nhttps://prostasia.org/project/map-support-club/\nTherapy is also good but be careful they might report you as a potential danger",
      "created_utc": 1732725409.0,
      "score": 18
    },
    {
      "id": "lz9ftjm",
      "body": "You have someone you love, don't leave him alone for something you can fix. Gonna be cliché, but therapy is the way to go.",
      "created_utc": 1732724461.0,
      "score": 31
    },
    {
      "id": "lzcqpn2",
      "body": "this probably isnt even pedophilia if this is the only time its happened",
      "created_utc": 1732765079.0,
      "score": 8
    },
    {
      "id": "lz9zfbl",
      "body": "Tbh this age gap is not large enough for you to call yourself a \"pedophile\". Actual pedophiles are attracted to people who aren't teenagers yet. And being attracted to a 14 year old at age 19 is common but it's usually considered polite to keep it to yourself",
      "created_utc": 1732730499.0,
      "score": 51
    },
    {
      "id": "lzcfiaz",
      "body": "You're not a pedophile, you're just not gotten  over with your ex boyfriend ! You are completely alright and you don't need therapy!",
      "created_utc": 1732760564.0,
      "score": 11
    },
    {
      "id": "lz9dx44",
      "body": "I also recommend therapy, and I wouldn't freak out too much about it if it has only happened once and you do not have urges to have sex with him. Thoughts are precisely that—thoughts. A therapist can help you work through these emotions. As a therapist, I can confidently say that you will not get in trouble. The law protects you. A therapist pretty much can't report you unless you are going to harm yourself or someone else. You do not sound like you fall into that category. \n\nOnce again, thoughts are just thoughts; you do not seem to have these feelings for other children you see. I wouldn't be so hard on yourself, and I wouldn't say Im a pedophile yet. According to the DSM 5 TR, the book used by therapists to diagnose pedophilia as a disorder, one criterion is that you must have strong sexual urges for children.",
      "created_utc": 1732723865.0,
      "score": 16
    },
    {
      "id": "lz9pyi3",
      "body": "First big step you made is realizing the immorality and the fault of your being, it's normal and it's brave to even write so here. Now what I recommend like every other comment is therapy. Hell in some countries there are organizations to help with exactly that.",
      "created_utc": 1732727585.0,
      "score": 16
    },
    {
      "id": "lz9dknr",
      "body": "It’s not your fault you feel these things, it is an illness not a choice. You need help and admitting and realising it’s harmful is a good first step.",
      "created_utc": 1732723758.0,
      "score": 29
    },
    {
      "id": "lzdezc3",
      "body": "i suggest seeing a therapist. they are there to listen and fully breakdown the thought patterns and emotional responses from possible past events that couldve lead you to these thoughts. you will not get in trouble for voicing thoughts and asking for help. any therapist would want full honesty so they can truly help you get out of this. you getting help will not only help you not feel so lost but could also prevent a child from getting hurt. theres no point in holding shame and keeping your thoughts all bottled up, as that can further escalate things. talking things out goes a long way",
      "created_utc": 1732776882.0,
      "score": 6
    },
    {
      "id": "lz9olvg",
      "body": "You're incredible for recognizing things about yourself that clearly isn't well.\n\nBuild from that, get therapy, and love yourself. \n\n\nGood job on admitting you have a problem, now go get 'em, and fix it up.\n\nYou'd ruin the kid, yourself, and your partner if you are unwise friend..!",
      "created_utc": 1732727167.0,
      "score": 11
    },
    {
      "id": "lz9pq90",
      "body": "Therapy - go now before you do something wrong",
      "created_utc": 1732727514.0,
      "score": 15
    },
    {
      "id": "lzagpzm",
      "body": "You can’t control how you feel but you can control how you act, and that kinda goes for everything in life",
      "created_utc": 1732735861.0,
      "score": 8
    },
    {
      "id": "lzd97qb",
      "body": "I think you’re not a pedo just misses your ex. And it’s not like you’re attracted to all children right that you want to do stuff to them",
      "created_utc": 1732773725.0,
      "score": 5
    },
    {
      "id": "lzeuu05",
      "body": "Op, It may not be a popular opinion, and it's one i don't necessarily support, but you and the 14 year old are only 5 years apart. Its not THAT big a difference. When i was 19 I was very attracted to a 14 year old at a party. I'd assumed everyone was the same age range, which is where we differ and where your anxiety is probably originating from, and she and I hit it off. She'd already developed and had a curvy figure.  Through conversation, there was not any indicator that she was that much younger than me. Things were gonna get heavy but she got up to go to the bathroom and something nagged at me to dig in her purse and pull out an ID.  It was a gd school id with that year on it. She was a fucking freshman. I didn't even say shit. Got up and gtfo. My ass would of been sitting in prison if I hadn't had some kind of pre-nut clarity and some kind of Devine intervention that nagged at me. \n\nI'm putting that story out there bc i think it kinda relates. I do think its a good sign that you're stressed out about it though. Seek therapy and work through it.  Unfortunately, attraction isn't a choice. If folks don't think so, there were loads of gay people when it was way less socially acceptable to be gay.  That should be proof enough.  Gay folks then had a choice to act on their desire.  A choice just like you do. That's the part where you reach the fact that it's on you. \n\nYour next step is dependent on what you find in therapy and some hard soul searching. Again, I think its a good sign that you're stressed about it. So do that and get you some answers so you know what to do next.",
      "created_utc": 1732805288.0,
      "score": 5
    },
    {
      "id": "lza6006",
      "body": "At least you have a moral compass\n\nSome people wouldn't even care or think they did anything wrong \n\nTo be fair, 19 is not too far from 14. I'm not saying this is perfectly okay. If you were 36 saying this, it would be a SERIOUS issue. \n\nDo you like guys that age or like you said he reminded you of a junior high crush? \n\nI would probably just leave that situation alone\n\nEnjoy today - get some sunshine, exercise, listen to music\n\nSeek counseling",
      "created_utc": 1732732525.0,
      "score": 13
    },
    {
      "id": "lzbk1cn",
      "body": "Okay - therapists are useless at this point \n\nI think keep a journal, stay transparent \n\nYou’re just a kid honestly, yourself still. Technically still, in my book \n\nWe don’t know how mature looking this boy is \n\nNow if you were like 26 and the kid was 12- diff story\n\nGo ahead  and downvote away \nI don’t give a rat’s ass",
      "created_utc": 1732748541.0,
      "score": 13
    },
    {
      "id": "lzc3u7k",
      "body": "This may also be OCD!",
      "created_utc": 1732756051.0,
      "score": 8
    },
    {
      "id": "lze7twa",
      "body": "It sounds like you have some unresolved issues from your previous relationship, and you are manifesting them with this child.\n\nIt's good that you reached out for help, but seeing a professional would benefit you greatly. You probably have some underlying attachment issues that need to be addressed.",
      "created_utc": 1732795070.0,
      "score": 3
    },
    {
      "id": "lzezodm",
      "body": "You aren’t a pedophile. It’s likely linked to your ex bit you need to seek help and stop contacting/being around the child immediately. Dont touch him don’t talk to him nothing.",
      "created_utc": 1732807025.0,
      "score": 3
    },
    {
      "id": "lzfjoxm",
      "body": "Do you just think he’s attractive or are you sexually attracted to him.\n\nI can find people years younger than me attractive but I don’t find them sexually attractive, ask yourself in your own mind ‘would you have sex with them if they offered’ if the thought repulses you, you just find them attractive and that’s fine.\n\nIf you feel your feelings towards them could be sexual then i would suggest speaking to someone about these feelings, nothing you are doing or feeling is illegal, unless you act on this. And I really would pry not to act on this",
      "created_utc": 1732813682.0,
      "score": 3
    },
    {
      "id": "lzi5teb",
      "body": "I’m not sure that makes you a pedophile. A pedophile is attracted to children, usually pre pubescent. You are attracted to someone who is sexually mature and not THAT far away from you in age. Your attraction is violating a social norm and if you act on it, a law. You are not a pedophile.",
      "created_utc": 1732848843.0,
      "score": 3
    },
    {
      "id": "lz9i5wg",
      "body": "You don’t seem like a pedophile to me. But you are clearly having trouble with some thoughts and, as most of the people commented, therapy would be your best choice. Please give it a try.",
      "created_utc": 1732725183.0,
      "score": 10
    },
    {
      "id": "lzcp43e",
      "body": "Pedophiles don't stop themselves. Pedos don't think it's wrong. You're not that. Honestly at 19 you're a kid yourself. Kids being attracted to other kids isn't wrong. Especially if this kid is going through puberty and looks older. Now the law has to draw a line somewhere and that's usually 18. So obviously if you did something with him that would be illegal. But there's nothing wrong with you for having such thoughts.\n\nIf you're still having these sort of thoughts about other young kids and as you grow older, then you probably need therapy.",
      "created_utc": 1732764405.0,
      "score": 7
    },
    {
      "id": "lzaviw0",
      "body": "Technically, you'd be a hebephile or an ephebophile, not a pedophile (which exclusively refers to prepubescent children).\n\nThat said, the answer is the same. Therapy.\n\nGood on you for coming forward rather than keeping it to yourself. Now seek additional help before you let the feelings fester.\n\nGood luck.",
      "created_utc": 1732740539.0,
      "score": 5
    },
    {
      "id": "lz9r2u1",
      "body": "Crushes happen. I had a crush on my uncle's stepdaughter. She was 15 and I was 20. Never acted on it, never mentioned it til now. As far as I know no one ever knew. \nHaving the crush didn't make me a bad person.\nActing on that crush would have.\nAs long as can control your urges while sober or drunk you don't have to worry about being a pedophile.",
      "created_utc": 1732727935.0,
      "score": 15
    },
    {
      "id": "lz9zy6f",
      "body": "Youre not a pedophile you was trying to live out your memories and nostalgic high through her brother you just need therapy on finding inner peace you want connections and thats all",
      "created_utc": 1732730660.0,
      "score": 5
    },
    {
      "id": "lzanywe",
      "body": "this isn't your fault",
      "created_utc": 1732738144.0,
      "score": 5
    },
    {
      "id": "lz9papc",
      "body": "The 1st thing you need to do is Get off this site. Go outside and get some fresh air. You know these feelings are wrong, so that is the 1st step. Its not much different from a crush on a relative. Keep your distance from him and keep telling yourself that you're smarter than this.",
      "created_utc": 1732727380.0,
      "score": 4
    },
    {
      "id": "lzaz833",
      "body": "Maybe you’re not what you think you are, you feel this way because he reminds you of your ex. Just take a deep breath, acknowledge that is wrong and be away from him. If you feel that towards other minors, tho, it’s a problem and I advise you to seek therapy.",
      "created_utc": 1732741705.0,
      "score": 3
    },
    {
      "id": "lzb6ti0",
      "body": "It’s a disease get it treated please 🙏🏿 try your hardest to not hurt any kids please",
      "created_utc": 1732744083.0,
      "score": 5
    },
    {
      "id": "lzbhv4k",
      "body": "Did you commit to any of those thoughts if not seek help... And ending yourself is not the solution... As long as you don't act on those thoughts you can overcome them... And the fact that you feel terrible about having such thoughts is a step in the right direction already.",
      "created_utc": 1732747761.0,
      "score": 2
    },
    {
      "id": "lzc9fb1",
      "body": "As others have said, get help. Good for you for catching it. There are a million other ways to go before going down the darkest path.",
      "created_utc": 1732758199.0,
      "score": 2
    },
    {
      "id": "lzcabpm",
      "body": "Hey, you admitting it and feeling remorse over the *thought* of it, and going to therapy about it, is leaps ahead of most other pedos. Look, sometimes the wires get crossed in a person's brain and they find themselves attracted to people they shouldn't be. What matters is that you caught yourself, you identified it is wrong, and you are taking steps to protect this child from yourself by keeping distance and going to therapy.\n\nA lot of people are suicidal because we were victims of pedophiles, which permanently screwed up our brains and led to our depression. So you might not find much sympathy in a subreddit about suicidal people. But that's why it's so important that you go to therapy, you will get the help you need to keep others and yourself safe, and it will make you hate yourself a little less. \n\nYour therapist will not get you in trouble. No one has ever been convicted of a crime because they thought something. People get convicted of crimes when they act out that thought, or there is evidence that they are going to act out that thought. You haven't committed any crime yet. But to keep it that way, and to keep another child from becoming a depressed adult on this subreddit because they were groomed and abused as a kid, therapy is critical.\n\nBest of luck with everything.",
      "created_utc": 1732758541.0,
      "score": 2
    },
    {
      "id": "lzcgm2r",
      "body": "Just don’t act on it and try to get better. I think you should go to therapy. You won’t get in trouble, and it will help you most likely. Also, I think it’s mostly just because he looks like your ex, if you’re not attracted to other minors",
      "created_utc": 1732760998.0,
      "score": 2
    },
    {
      "id": "lzcpmnf",
      "body": "Well obviously in Australia thd legal age is 18 but if ur 19 his 14 fast track the age difference going forward if u were same yrs apart but both legal age it be ok but u have to just forget bout him I guess it'd normal to think these things ifk cause I've never been in ur situation I would maybe think if u were 7 yrs older then I would go for u but I wouldn't even think that idk I msube would but yeh just chil I guess when I was 14 I always went for older guys",
      "created_utc": 1732764623.0,
      "score": 2
    },
    {
      "id": "lzd7v6v",
      "body": "please talk to a professional. they wont tell the police or anything so you dont have to worry about that but i really recommend you get help before anyone gets hurt!! i hope you get better soon<3 you cant control having a pedophilic disorder but you can control your actions!! i believe in u",
      "created_utc": 1732773023.0,
      "score": 2
    },
    {
      "id": "lzd9148",
      "body": "If you are in Canada, [Talking for Change](https://talkingforchange.ca/) offers anonymous support and free counselling therapy for anyone experiencing troubling thoughts or urges about children.\n\nYour awareness and courage to seek help are admirable. A therapist can absolutely help you make sense of this all — you got this.",
      "created_utc": 1732773629.0,
      "score": 2
    },
    {
      "id": "lzfhsf3",
      "body": "You are not a pedophile. You’re just a kid yourself. Cut yourself some slack. You have hormones and feelings that are new, intense, and probably out of control, you are not far from his age groups physical development. If you were in your late 20’s I’d say there would be cause for concern. Just get through your physical urges without making anyone uncomfortable. If it becomes an issue in a few years when you are surrounded by a much older crowd, then maybe take a second look at this.",
      "created_utc": 1732813059.0,
      "score": 2
    },
    {
      "id": "lzhxwfj",
      "body": "Speak to a therapist URGENT. They WILL help you.",
      "created_utc": 1732845408.0,
      "score": 2
    },
    {
      "id": "lzi66il",
      "body": "https://en.wikipedia.org/wiki/Hebephilia",
      "created_utc": 1732848999.0,
      "score": 2
    },
    {
      "id": "lzan1he",
      "body": "you are not a pedophile because you are not an abuser. and you feel bad about this.\n\nyes, its something very bad but you can be fixed. go to therapy. think about yourself. hell even it will go away in a while and the situation is just a huge coincidence and you had hormonal changes recently and you *think* you feel 'that way' around him. its more common than you think.\n\n\nthough even if it is not the case remember that you wabt to change. so you are not a bad person. everyone can experiment a mental disorder and you just happened to feel like this. stay strong and get better. do better",
      "created_utc": 1732737847.0,
      "score": 3
    },
    {
      "id": "lzazhlq",
      "body": "Thoughts are just thoughts, and if it stays thoughts, then you’re fine. Chances are they will just stay thoughts too; if I’m remembering right not only are the majority of pedophiles non-offending, but a good chunk of people who do commit CSA aren’t actually pedophiles. If you choose to go the therapy route, know that the therapy won’t make it go away, but it can make it a lot easier to deal with. \nMaybe you are a pedophile. Maybe you aren’t. It’s okay if you are, it’s okay if you aren’t. It doesn’t make you inherently evil if you are, and you deserve to have a good and fulfilling life just like anybody else, pedophile or not. Your thoughts and feelings aren’t your actions. I hope you’re able to work things out and I hope you get help if you need/want it.",
      "created_utc": 1732741789.0,
      "score": 4
    },
    {
      "id": "lzdfm0a",
      "body": "Hey dud, I want you to here me, I forgive you, if you’re looking for forgiveness, you still have a life time ahead of you, don’t let this destroy you’re life, seek a therapist so the thoughts don’t tear you’re mined apart.",
      "created_utc": 1732777239.0,
      "score": 3
    },
    {
      "id": "lz9fdv7",
      "body": "Just stop thinking about it and giving it energy and reprogram your mind. But whatever you do, don't pursue it because that's a DARK road where the entire world will hate you. Anybody reading this, run as far away from any thoughts that even resemble that.\n\nI could write a lot more about this but I'm not in the mood. FUCKING DON'T GO THERE PEOPLE. Have seen lives destroyed. Don't look for images even if you think no one is watching, your life will be ruined. You have been warned.",
      "created_utc": 1732724325.0,
      "score": 4
    },
    {
      "id": "lza00ov",
      "body": "honey, you're not a bad person. I'm so proud of you for talking about it and realizing these thoughts, you should seek help from professionals that deal with stuff like this!",
      "created_utc": 1732730682.0,
      "score": 4
    },
    {
      "id": "lzaakfs",
      "body": "Man that sucks, having shame is a step in the right direction. Hold onto the drive of self improvement. Things will be ok",
      "created_utc": 1732733939.0,
      "score": 2
    },
    {
      "id": "lzacic4",
      "body": "Thoughts won’t get you in trouble my dear, but acting on those thoughts is a whole other animal, which your not doing.   But there are a lot of shitty therapists out there who might get uncomfortable about those type of thoughts.  The key is to find a therapist who is completely non judgmental about your thoughts, aka a good therapist.",
      "created_utc": 1732734548.0,
      "score": 2
    },
    {
      "id": "lzae5h7",
      "body": "You need to discuss how you feel with a therapist or councilor. Those thoughts without any physical urges, can be a symptom of OCD. Link below for information. I am not a medical professional so please speak to a professional but check what those individuals can/can’t do - as the level of confidentiality will vary by country.\n\nhttps://iocdf.org/expert-opinions/am-i-a-monster-an-overview-of-common-features-typical-course-shame-and-treatment-of-pedophilia-ocd-pocd/",
      "created_utc": 1732735058.0,
      "score": 2
    },
    {
      "id": "lzc9qfw",
      "body": "you need therapy",
      "created_utc": 1732758316.0,
      "score": 2
    },
    {
      "id": "lzdlzqx",
      "body": "Just wait. 5 year difference is nothing when it superior to 18",
      "created_utc": 1732781056.0,
      "score": 2
    },
    {
      "id": "lzddruu",
      "body": "If this was a male 19 yo who was attracted to a female 14 yo everyone would have reactions that were way different, and they wouldn't be wrong. Though here people are saying \"ahh therapy and you'll be fine!\" Instead of \"castrate the mf!\"",
      "created_utc": 1732776206.0,
      "score": 3
    },
    {
      "id": "lza4aa1",
      "body": "You're 19. I know 18 is considered adulthood, but legal drinking age is 25 in my country. Please don't feel too bad about yourself yet, you don't know what's wrong by just one such interaction. Please just see a therapist. And don't think about silly things like suicide! You'll be fine, love. Just promise to go see someone soon!",
      "created_utc": 1732731997.0,
      "score": 2
    },
    {
      "id": "lzclwxh",
      "body": "you are aware its wrong which is the first step",
      "created_utc": 1732763098.0,
      "score": 1
    },
    {
      "id": "lzcp1fc",
      "body": "As someone who was in a relationship with someone who was a pedophile, but not in this way, I highly suggest getting help. Please go to therapy. Unless you are actively hurting yourself or someone else, it won’t be reported. For the sake of your livelihood, therapy",
      "created_utc": 1732764374.0,
      "score": 1
    },
    {
      "id": "lzcz1gk",
      "body": "Whatever assessment you're thinking of yourself is not true 9 times out of 10.\n\nWhen you say you're bad, that's not true.\n\nUnless a professional authority, or a large group of people say you are bad, you are NOT bad, you are NOT evil.",
      "created_utc": 1732768776.0,
      "score": 1
    },
    {
      "id": "lzd3p33",
      "body": "Therapy is honestly your best course of action. \n\n\nThe fact that you’re aware this is wrong and you’re willing to admit it means a lot! On top of that therapists can help you out on figuring out if these feelings are real or if they’re just intrusive thoughts. \n\n\nHope for the best of you, it’s horrible that you’re having these feelings but it’s good that you’re at least willing to get help before you do something unforgivable. \nAlso maybe stay away from children and specifically this child in the mean time until you’re able to get help and work through this.",
      "created_utc": 1732770961.0,
      "score": 1
    },
    {
      "id": "lze67d6",
      "body": "Are you attracted to him because of his age? Did it happen before? If the answer to both is no, you're overreacting. Just get over the crush.",
      "created_utc": 1732794142.0,
      "score": 1
    },
    {
      "id": "lzf3bbr",
      "body": "Pedophile hate culture has done so much damage",
      "created_utc": 1732808282.0,
      "score": 1
    },
    {
      "id": "lzghd9m",
      "body": "This thread is wild first of all.\n\nSecond of all, I’d wanna know if this is the first time OP has been attracted to minors to know if it warrants therapy.",
      "created_utc": 1732824892.0,
      "score": 1
    },
    {
      "id": "lzigckr",
      "body": "You find him attractive and told him so. There’s nothing wrong with that but leave it at that. \n\nAs far as pedophilia goes, you’re talking one person, one time. That’s an inappropriate crush. \n\nIn HS, I saw teachers with inappropriate favorites and “crushes” all the time and that is vastly different ages. \n\nBecause if the legality, age does matter for you, but once they are 18, age becomes irrelevant and this behavior overnight becomes normal. ",
      "created_utc": 1732853512.0,
      "score": 1
    },
    {
      "id": "lzoprz3",
      "body": "As others said, please seek a therapist. They cannot get you convicted for a crime you didn’t commit. From how you are feeling, this really sounds like it could be just very bad intrusive thoughts. Would you be with him if you could without getting in trouble? Thats an important thing to think about if you are afraid you are a pedo. This isn’t your fault and you are not a bad person. This is a mental issue like any other and with work you can overcome it. What matters the most is you go to therapy and don’t act on those thoughts you have about him (or any other minor) I really hope you can get the help you need and I love you.",
      "created_utc": 1732954226.0,
      "score": 1
    },
    {
      "id": "lzpxcvz",
      "body": "Ok so first things first, you said he reminded you of your ex. Maybe you just see your ex in him, doesn’t mean you are attracted to minors. Secondly you were drunk. People get fucked up when they get drunk. Have you ever had any attraction to other minors or just him, OP? There might be many factors why you are attracted to him and that doesn’t mean you are a pedophile. However, if this isn’t the first time you are feeling attraction to a minor. I suggest you get help in the form of therapy. ",
      "created_utc": 1732978944.0,
      "score": 1
    },
    {
      "id": "m1ga5jf",
      "body": "I might get flamed for this, but I’ve seen a lot of posts like this and I’m sort of convinced that the personality and lust are nebulous and you can pull anything out of the void if you think about it for too long. There’s a darkness inside us sometimes to want to kill people or even just rage. People watch all kinds of porn but there’s only one that is forbidden. Sometimes I think that forbidden fruit is alluring.\n\nYou need therapy. It’s a dark subject but you gotta deal with it sooner rather than later. Could also be OCD I think. Some people say that it convinces them of something about themselves that isn’t true.",
      "created_utc": 1733878613.0,
      "score": 1
    },
    {
      "id": "msbtshu",
      "body": "Don't feel bad it's okay. Everyone has problems. Things from our past does things to us and stuff and I've liked grown ass men since I was 13 and acted on it when I was 14 and I still like them now and I'm only 18 and the feeling isn't gonna go away so I deal with it not wanna kill myself. Just accept to yourself that this is who you are or whatever. Just don't be a bad girl by forcing yourself on any boys.",
      "created_utc": 1747252549.0,
      "score": 1
    },
    {
      "id": "lzca4l3",
      "body": "Dude, you’re young - you’re fine. Many people go through phases like this. Don’t be so harsh on yourself. Just don’t act on any devious sexual thoughts and you’ll be just fine. We’re humans, forgive yourself. You’re definitely not alone, not nearly.",
      "created_utc": 1732758466.0,
      "score": 0
    },
    {
      "id": "lze0agv",
      "body": "i feel bad for bf ...aint no pain like this hope he dont find out ive went thru 10x worse i have severe ptsd from it  .. dont cheat if your unhappy leave .. i hope u figure it out",
      "created_utc": 1732790443.0,
      "score": 1
    },
    {
      "id": "lz9lq6h",
      "body": "[removed]",
      "created_utc": 1732726277.0,
      "score": -19
    },
    {
      "id": "lzdkej7",
      "body": "A 19-yr old getting attracted to a 14-yr old is pedophilia??🙄 19 yrs is hardly an adult & 14-yr old hardly a child!! Is it just the numbers?? And labelling such thoughts as \"mental illness\" sounds highly problematic.",
      "created_utc": 1732780090.0,
      "score": -3
    },
    {
      "id": "lzak6hm",
      "body": "[removed]",
      "created_utc": 1732736941.0,
      "score": -3
    },
    {
      "id": "m01suuy",
      "body": "You might ask your doctor for an MRI as well.  If you've never been attracted to kids,  and suddenly are now,  there could be something physically malfunctioning in your brain.  It is rare,  but it does happen.  \n\n\nhttps://www.newscientist.com/article/dn2943-brain-tumour-causes-uncontrollable-paedophilia/",
      "created_utc": 1733154612.0,
      "score": 0
    },
    {
      "id": "lzb01lk",
      "body": "[deleted]",
      "created_utc": 1732741962.0,
      "score": -18
    },
    {
      "id": "lza25ri",
      "body": "[deleted]",
      "created_utc": 1732731340.0,
      "score": -41
    },
    {
      "id": "lz9957j",
      "body": "[removed]",
      "created_utc": 1732722352.0,
      "score": -61
    },
    {
      "id": "lzaxhtd",
      "body": "[removed]",
      "created_utc": 1732741156.0,
      "score": -2
    },
    {
      "id": "lz99m6h",
      "body": "what would i tell them? i wouldn’t get in trouble? i can just say things like this?",
      "created_utc": 1732722500.0,
      "score": 282
    },
    {
      "id": "lze4hoz",
      "body": "And jail",
      "created_utc": 1732793106.0,
      "score": -5
    },
    {
      "id": "lze1om1",
      "body": "Or any minors if OP feels like they are a risk to them. \n\nOP - you can get therapy and change, you did a really bad thing but you are self aware. Please keep yourself at a distance from this boy and any other minors you feel anything towards and work on yourself.",
      "created_utc": 1732791337.0,
      "score": 21
    },
    {
      "id": "lzez3s4",
      "body": "That’s just dishonest dude. Plenty—— and I mean most known serial killers have killed because they remind them of someone. It can be as simple as having the same hair, gender, age, etc.\n\nSome have even committed grape on others while imagining that person they actually want.\n\nDon’t make this situation sound light. “You’re don’t actually like him tho, just his face and mannerisms so you’re okay” yeah, you didn’t say literally that to OP is okay, but you might as well have.",
      "created_utc": 1732806823.0,
      "score": 7
    },
    {
      "id": "lz9dyas",
      "body": "okay i will work on these issues and seek therapy, thank you",
      "created_utc": 1732723875.0,
      "score": 118
    },
    {
      "id": "lz9iydl",
      "body": "[deleted]",
      "created_utc": 1732725427.0,
      "score": -38
    },
    {
      "id": "lze0az4",
      "body": "Not common but I wouldnt call it being a pedophile either, but definetly morally wrong",
      "created_utc": 1732790453.0,
      "score": 2
    },
    {
      "id": "lzeypw8",
      "body": "common?? for who?? dont try and rationalize this, they need help and are aware enough to recognize it.",
      "created_utc": 1732806686.0,
      "score": 0
    },
    {
      "id": "lzcjh75",
      "body": "Id say that if they don’t want therapy, they don’t have to and no one can force them into it, therapy isn’t for everyone, including me. But I think it could be beneficial for them to get some type advice, talk to someone, or get help. It could help them understand why this is happening, how to let go of their ex, be told they are not as horrible as they think they are, etc. Not hating on OP or you though, just providing my thoughts. :)",
      "created_utc": 1732762126.0,
      "score": 3
    },
    {
      "id": "lz9hbzt",
      "body": "How is that an illness???",
      "created_utc": 1732724926.0,
      "score": -36
    },
    {
      "id": "lzciamf",
      "body": "How ocd?",
      "created_utc": 1732761661.0,
      "score": 2
    },
    {
      "id": "lza6l0j",
      "body": "When I was 16 I liked a 20 year old guy.\n\nI hope I didn't make him uncomfortable.\n\nIt's odd because my aunt was actually married at age 16 to a 20 year old. This isn't in the USA. \n\nI do not think you are odd. \n\nIt's a cultural norm. If I were in a different country, at age 16 I would rather be married to a 20-24 year old than a 40 year old.",
      "created_utc": 1732732705.0,
      "score": 1
    },
    {
      "id": "lzddbh4",
      "body": "I'd like to piggyback off this comment by saying that alcohol can remove your ability to not act on intrusive thoughts. An intrusive thought is one that is inherently not something you actually want, and they can stem from past experiences such as unresolved business with an ex.",
      "created_utc": 1732775951.0,
      "score": 5
    },
    {
      "id": "m06fuiv",
      "body": "Yes it is",
      "created_utc": 1733219608.0,
      "score": 1
    },
    {
      "id": "lzdicvi",
      "body": "I'm not sure about other people here, but I would've reacted the same way regardless. There's no need to jump to extremes here, mostly because 1) they didn't act on it, 2) they are actively seeking advice and help to ensure they don't go down the wrong path, and 3) considering the facts, the likelihood of this being pedophilia is pretty low. They are likely only feeling this way because the brother looked like their ex, and they haven't gotten over them yet. That's absolutely not an excuse when you act on the thoughts, but they didn't, and again, are actively looking for help. The more likely issue here is POCD or an effect of the break-up.",
      "created_utc": 1732778844.0,
      "score": 10
    },
    {
      "id": "m0024g1",
      "body": "I know what you mean but holy sht the way you worded it sounds so wrong",
      "created_utc": 1733122240.0,
      "score": 3
    },
    {
      "id": "lza6h5k",
      "body": "This post and the answers is very strange for me. Here in Brazil is legal even marry a 14yo (between 14 and 18 need permits of the parents). Some people find strange if is a big gap of age but 14 and 19 very few people would think is strange.",
      "created_utc": 1732732672.0,
      "score": 10
    },
    {
      "id": "lza5x84",
      "body": "Wow I can’t believe you’re being downvoted for facts. Then again, this is reddit.",
      "created_utc": 1732732502.0,
      "score": 8
    },
    {
      "id": "lzanl4g",
      "body": "its still something that someone should not feel. its not normal",
      "created_utc": 1732738022.0,
      "score": 1
    },
    {
      "id": "lzb6l32",
      "body": "[removed]",
      "created_utc": 1732744008.0,
      "score": 1
    },
    {
      "id": "lzbesca",
      "body": "This isn’t the sub to play around in but you can wait a few more years. Secondly, that’s basically the drinking age in a lot of countries. \n\nYou’re not a pedo, just be rash and talk to someone like others have said",
      "created_utc": 1732746694.0,
      "score": 4
    },
    {
      "id": "lzap09s",
      "body": "this is a disturbing thing to say",
      "created_utc": 1732738471.0,
      "score": 17
    },
    {
      "id": "lz9da2a",
      "body": "ew??",
      "created_utc": 1732723665.0,
      "score": 20
    },
    {
      "id": "lz9cxnr",
      "body": "Crazy 😭",
      "created_utc": 1732723557.0,
      "score": 16
    },
    {
      "id": "lz9h8iu",
      "body": "weirdo",
      "created_utc": 1732724896.0,
      "score": 8
    },
    {
      "id": "lz9o966",
      "body": "Be who???",
      "created_utc": 1732727056.0,
      "score": 3
    },
    {
      "id": "lz9gl3g",
      "body": "Please tell me that what you said is a sick joke. The OP is doing well by being open and seeking therapy on this and you want to JOKE about it?!",
      "created_utc": 1732724695.0,
      "score": 8
    },
    {
      "id": "lzb7jfp",
      "body": "[deleted]",
      "created_utc": 1732744318.0,
      "score": 2
    },
    {
      "id": "lz9e7qz",
      "body": "You won’t go to jail. They can’t sentence you for your thoughts. Unless you act on them, no you won’t",
      "created_utc": 1732723957.0,
      "score": 519
    },
    {
      "id": "lz9gtsg",
      "body": "It matters where you live. I live in Germany and here the doctors have something called \"Schweigepflicht\". That means they are not allowed to tell the police what you told them. No matter what. You can tell them anything. I don't know about America. I would be cautious if they can report you.",
      "created_utc": 1732724769.0,
      "score": 241
    },
    {
      "id": "lz9a47a",
      "body": "[removed]",
      "created_utc": 1732722660.0,
      "score": 52
    },
    {
      "id": "lz9ipkm",
      "body": "you won't get into trouble, because an offence has not been committed and you aren't planning on it. only time they can break confidentiality is if you say you have or will cause harm to yourself or others.",
      "created_utc": 1732725352.0,
      "score": 13
    },
    {
      "id": "lz9h20e",
      "body": "nope, you get in trouble for an actual physical offense",
      "created_utc": 1732724841.0,
      "score": 38
    },
    {
      "id": "lza0hyc",
      "body": "Pedophilia isn't a crime in most places. Abusing children is.\n\nEdit: Why am I being downvoted? Pedophilia is an mental illness / paraphilia, rape / abuse is the crime. Not that hard to understand.",
      "created_utc": 1732730828.0,
      "score": 54
    },
    {
      "id": "lzdd024",
      "body": "i saw another post on reddit except this person was late 20’s but no it’s not like you have committed any crime, unless you have then yes that is a problem or if you talk about comitting a crime yes but aslong as you haven’t committed one then please go to therapy",
      "created_utc": 1732775776.0,
      "score": 2
    },
    {
      "id": "lzclxce",
      "body": "You would not get in any trouble for seeking help for unwanted thoughts at least in the US. There are people out there to help you.",
      "created_utc": 1732763102.0,
      "score": 1
    },
    {
      "id": "lzozxgo",
      "body": "I don't think so, this might just be a one off attraction... she may never be attracted to a minor ever again. I still think she's wrong to be attracted to a child but I think it's too early to label her a pedo\n\nFurthermore, she hasn't even committed a crime yet. Its not a crime to have thoughts.",
      "created_utc": 1732961217.0,
      "score": 0
    },
    {
      "id": "lz9e61z",
      "body": "You’re going to be ok. Just remember you haven’t done anything overtly wrong , yet. Don’t put so much pressure on yourself as that can increase those kinds of thoughts in an obsessive way. You will be ok.",
      "created_utc": 1732723943.0,
      "score": 71
    },
    {
      "id": "m9umtsc",
      "body": "I'd off myself too if I felt tingling in my ding-a-ling after looking at an vnderage girl. And no the issue is not ped0philia. Rather, it is hebephilia/ephebophilia. I wish there was a conversion camp for people who ought to do away with any attraction to minors, because I'd definitely sign up for it, as long as there is no activity showing actual C P or coercion by the staff to go into a dark room and do actual m1nors for fear of some punishment. I know a similar situation happened to some individual known as DE, except HE was the victim. He was a gay teenager who got deliberately infected with HIV because the staff were HIV-positive and they told their subjects that they would die of AIDS anyway since their homosexuality was nothing but a burden in those sick people's minds.\n\nI hope never to have to fvck a m1n0r under duress. I have never heard of such a thing happening, so I should be safe, at least in my current life",
      "created_utc": 1738170121.0,
      "score": 1
    },
    {
      "id": "lz9jpe6",
      "body": "ya no cure they would just practice suppressing it",
      "created_utc": 1732725658.0,
      "score": 36
    },
    {
      "id": "lzadi0c",
      "body": "it depends though. Like, is this the first kid he's liked? then it's probably not even pedophilia, its just being reminded of an Ex. Even so, stuff like this makes people ashamed and makes them not reach out to get help, which is more harmful than not.",
      "created_utc": 1732734855.0,
      "score": 8
    },
    {
      "id": "lzf0kg9",
      "body": "common as in statistically. a lot of 19 year olds find 14 year olds attractive. i am not suggesting anyone act on it",
      "created_utc": 1732807334.0,
      "score": 3
    },
    {
      "id": "lz9heir",
      "body": "Wdym?",
      "created_utc": 1732724947.0,
      "score": 22
    },
    {
      "id": "lzdedlj",
      "body": "It's okay, these people are sick, they only think this because it's a female who wants a young male. If it was a male wanting a young female they'd have different reactions. It's disgusting both ways, but they think it's an illness because it's female to male. I know I'll get down voted like you but it's true. People think \"aww it's not your fault honey\" until it's male wanting a young female. BOTH ARE WRONG, ITS GROSS EITHER WAY. Being gay is not a choice, but being a pedo? That is totally different.",
      "created_utc": 1732776542.0,
      "score": -6
    },
    {
      "id": "lzdhe82",
      "body": "There's a specific kind of OCD called POCD, or Pedophile-Themed Obsessive-Compulsive Disorder. It makes you constantly worry about if you're a pedophile or not and can give you certain intrusive thoughts involving children.",
      "created_utc": 1732778275.0,
      "score": 10
    },
    {
      "id": "lzaoqj5",
      "body": "I doubt you made him uncomfortable if you were subtle. It may have even flattered him and made him wish you were a couple years older. \n  Crushes are normal, even ones that shouldn't be acted on. \n  I have never chosen to have a crush and never choosen the person I had a crush on. They just sorta hit like lightning. It is because it is brain chemistry behind it. \n  Most of them never knew I had a crush on them.",
      "created_utc": 1732738386.0,
      "score": -10
    },
    {
      "id": "lz9j6js",
      "body": "Question. Is this true even if you’ve killed people and admit to it?",
      "created_utc": 1732725496.0,
      "score": 65
    },
    {
      "id": "m351g71",
      "body": "This is called confidentiality in English and generally there is an exception - when you imminently intend to hurt yourself or others.\n\nOP would probably get in trouble if he said he wants and plans to assault the kid. But just having thoughts of doing so is fine.",
      "created_utc": 1734791392.0,
      "score": 1
    },
    {
      "id": "lz9agi1",
      "body": "okay, thank you",
      "created_utc": 1732722770.0,
      "score": 30
    },
    {
      "id": "lzboj87",
      "body": "[deleted]",
      "created_utc": 1732750204.0,
      "score": 1
    },
    {
      "id": "lzusubj",
      "body": "Literally addressed this statement. Again, dishonest.",
      "created_utc": 1733050961.0,
      "score": 2
    },
    {
      "id": "lzbuj1u",
      "body": "This is really important. Well said advice!",
      "created_utc": 1732752488.0,
      "score": 11
    },
    {
      "id": "lzcbyvj",
      "body": "I agree.  I know legally it doesn’t matter, but unless you are finding yourself attracted to literal children, you are not a pedophile.",
      "created_utc": 1732759173.0,
      "score": 6
    },
    {
      "id": "lz9kcyj",
      "body": "The feelings.",
      "created_utc": 1732725858.0,
      "score": -17
    },
    {
      "id": "lzeow02",
      "body": "God.. what are you even saying? Being “gross” is not what makes pedophilia wrong, what makes it wrong is it puts children at risk of being harmed and traumatised. OP deserves help so they don’t act on these urges. Their THOUGHTS are not a choice, it IS a mental illness, and people with it deserve help and treatment before it can escalate.",
      "created_utc": 1732802984.0,
      "score": 2
    },
    {
      "id": "lze10xp",
      "body": "i knew there‘d be a male crying in here, lmaoo. you don‘t even know if this is a girl. there are so many people arguing that it‘s okay and natural for a 25 year old man to want a 16 year old, because of ThE BiOlOgIcAl ClOcK. what are you telling those people?\n\neven better - what‘s your opinion on [this dude](https://www.reddit.com/r/SuicideWatch/s/gpNVidQw7t), who gets the exact same support?\n\nor [this one](https://www.reddit.com/r/SuicideWatch/s/4Euhg8Y9EU).\n\nor [this one](https://www.reddit.com/r/SuicideWatch/s/FXLJuRoAbx).",
      "created_utc": 1732790916.0,
      "score": -1
    },
    {
      "id": "lzcdjtq",
      "body": "that’s fucking disgusting",
      "created_utc": 1732759793.0,
      "score": 8
    },
    {
      "id": "lzcoppz",
      "body": "Please delete those first two sentences for the sake of this comment.",
      "created_utc": 1732764240.0,
      "score": 4
    },
    {
      "id": "lz9w3fy",
      "body": "[removed]",
      "created_utc": 1732729480.0,
      "score": 137
    },
    {
      "id": "lz9sgvm",
      "body": "I think so. They have to sign a legal contract when they finish Uni that if they will work as a doctor they can't tell what the patient tells them. But they can encourage the patient to go to the police themselves.",
      "created_utc": 1732728365.0,
      "score": 34
    },
    {
      "id": "lz9b0wp",
      "body": "[removed]",
      "created_utc": 1732722949.0,
      "score": 60
    },
    {
      "id": "lzdncoi",
      "body": "So, your therapist will go over everything that would need to be disclosed before you even start so that you know. That said, I think some therapists might feel that a mandated report is needed, but that’s why you should go to a therapist that specializes in this issue. They have a better understanding of what you’re experiencing and therefore can better understand the situation.",
      "created_utc": 1732781914.0,
      "score": 3
    },
    {
      "id": "lzbu9x9",
      "body": "You’re being downvoted but there are studies that show this. It is classified as a mental illness (paraphilia), but it’s like an orientation in that it’s rigid and unchangeable. The younger their preference, the less important gender is. \n\nI’m wary of calling it an orientation in modern society because there’s no nuance and people often conflate homosexuality with pedophilia which is homophobic bullshit.",
      "created_utc": 1732752391.0,
      "score": 40
    },
    {
      "id": "lzcf2wf",
      "body": "Probably bc when someone’s gay or a lesbian it doesn’t hurt the other person. I was molested at age 5 by my biological father then my 50 year old neighbor came on me when I was 16/17. It hurts the literal child- for the rest of their life.",
      "created_utc": 1732760393.0,
      "score": 11
    },
    {
      "id": "lzcydc9",
      "body": "Children are not sexual partners. It's not a sexual orientation. If this is too hard to grasp, then please don't become a parent or allow yourself to ever be responsible for anyone else's children. Even suggesting such a thing (these days) is a threat to defenseless children.",
      "created_utc": 1732768464.0,
      "score": 9
    },
    {
      "id": "lzbughp",
      "body": "It’s biologically an aberration of sexual attraction.",
      "created_utc": 1732752461.0,
      "score": 2
    },
    {
      "id": "lziforj",
      "body": "By that logic should beastiality be a sexuality ?",
      "created_utc": 1732853205.0,
      "score": 1
    },
    {
      "id": "lzamrpt",
      "body": "“Pedophilia (alternatively spelled paedophilia) is a psychiatric disorder in which an adult or older adolescent experiences a primary or exclusive sexual attraction to prepubescent children.” \n\n(“Pedophilia.” Wikipedia, Wikimedia Foundation, 27 Nov. 2024, en.m.wikipedia.org/wiki/Pedophilia.)",
      "created_utc": 1732737759.0,
      "score": 18
    },
    {
      "id": "lze3599",
      "body": "Okay? This shouldn't be \"did this guy cry about this or that?\" My opinion is: that guy you linked is just as disgusting, his gender doesn't mean anything it's JUST AS DISGUSTING. This should be anyone who wants to creep on a child is disgusting no matter what. But you're defending being a creep to a child just because it's a female. Proving my point. I agreed with the person before who said \"they didn't do anything therefore it shouldn't be an issue\" but here you are complaining about a totally different issue, the bio clock? Wtf who mentioned that at all? You're assuming I support that for your own argument, the people who mention that are just as disgusting.",
      "created_utc": 1732792261.0,
      "score": -2
    },
    {
      "id": "lzeasaq",
      "body": "I never said I was a victim, I don't get how your still angry even though I agreed with you, the people who say it's okay because of some \"biological\" clock are are still wrong. Yet you're still arguing, so that can only mean that you're okay with it just because they're female.",
      "created_utc": 1732796658.0,
      "score": -2
    },
    {
      "id": "lzco808",
      "body": "What's disgusting ",
      "created_utc": 1732764036.0,
      "score": 2
    },
    {
      "id": "lzcicck",
      "body": "Pull my finger and the aroma of popcorn will be released. Perhaps that would be more agreeable to your sense and sensibilities.",
      "created_utc": 1732761680.0,
      "score": -2
    },
    {
      "id": "lzcyanq",
      "body": "I could but I see no need. I realize my words don't mean the same thing to you as they do to me.  I am simply sharing what  my perspective and experience have taught me. If you can enlighten me so I can increase the accuracy of my understanding, it would be welcome.",
      "created_utc": 1732768428.0,
      "score": 2
    },
    {
      "id": "lzcsp3x",
      "body": "They can report you if you tell them you intend to kill someone, but not if you confess something that already happened.",
      "created_utc": 1732765924.0,
      "score": 38
    },
    {
      "id": "lz9egu4",
      "body": "Exactly this. This is one of the most shameful things and here you are coming and asking us advice about it. That is VERY commendable and I applaud you for it buddy. I'm an ex-con, so pedos and I don't get along AT ALL and I am very pleased that you see this as a potential problem and we're willing to ask for help BEFORE something serious, regretful and shameful was done. I give you all the credit in the world. You aren't a bad person.",
      "created_utc": 1732724037.0,
      "score": 45
    },
    {
      "id": "lz9c3j8",
      "body": "i appreciate your kindness and help, thank you again",
      "created_utc": 1732723289.0,
      "score": 21
    },
    {
      "id": "lzdm82l",
      "body": "Paraphilias are sexual orientations. It's classified as a mental illness because it creates suffering, for either the subject themself or the abused children. \n\nI'm no expert, but as far as I understand, that's all what differntiates mental illnesses from healthy mental states: If it makes the person or other people suffer in an unhealthy way.",
      "created_utc": 1732781200.0,
      "score": 5
    },
    {
      "id": "lzdmwnu",
      "body": "When someone likes foots, death animals, cars sexually, their dad mom or family, they doesnt hurt too.  Being attracted by children, same sexe, animal, very old people,member of family is not a crime. Agress them or having sex without consent is. In the case of children they cant be consent under 18. Death people or animal cant.",
      "created_utc": 1732781629.0,
      "score": 1
    },
    {
      "id": "lzdxd8b",
      "body": "Sorry what???",
      "created_utc": 1732788530.0,
      "score": -1
    },
    {
      "id": "lzdiq2a",
      "body": "Calling it a sexual orientation does not imply that it's okay to act on.",
      "created_utc": 1732779064.0,
      "score": 12
    },
    {
      "id": "lzeawr2",
      "body": "??????? me jumping to conclusions. i was not referencing this original post at all.",
      "created_utc": 1732796722.0,
      "score": 2
    },
    {
      "id": "lzcsqym",
      "body": "[removed]",
      "created_utc": 1732765947.0,
      "score": -51
    },
    {
      "id": "lzbu8c3",
      "body": "You have self awareness and are conscious about things. Please, please get help for yourself.",
      "created_utc": 1732752374.0,
      "score": 11
    },
    {
      "id": "lze0m8l",
      "body": "thank you. this is why homosexuality is no longer classified as a mental illness. there is no suffering, just love.",
      "created_utc": 1732790652.0,
      "score": 10
    },
    {
      "id": "lzecbpt",
      "body": "Randomly putting a foot fetish in this list of Incest, Bestiality and Paedophilia like 😬",
      "created_utc": 1732797449.0,
      "score": 4
    },
    {
      "id": "lzeavgo",
      "body": "Incest is a crime, pedophilia is a crime, necrophilia is a crime, bestiality is a crime. Where tf are you from?",
      "created_utc": 1732796704.0,
      "score": 1
    },
    {
      "id": "lzeart3",
      "body": "Are you mentally okay?",
      "created_utc": 1732796651.0,
      "score": 1
    },
    {
      "id": "lzeamm8",
      "body": "When someone’s gay (men who likes another man) or a lesbian (woman who likes woman) it doesn’t hurt the person their with. Pedos do. That’s a grown up with a kid. \nDid you not know that or something?",
      "created_utc": 1732796575.0,
      "score": 1
    },
    {
      "id": "m16iceu",
      "body": "You don't even believe this. If you did, you'd have no problem sharing this opinion -- in person -- with your local police department, or a parent who's child was sexually assaulted. It's an illness. A harmful one that devastates lives for generations. Even the OP is terrified of himself because of it, which makes him far more sensible than what I've read from you.",
      "created_utc": 1733744910.0,
      "score": 0
    },
    {
      "id": "lzd4hqp",
      "body": "Sorry about that, I thought I was answering the person above you. I stopped reading there. Didn't mean to steal your thunder",
      "created_utc": 1732771347.0,
      "score": 29
    },
    {
      "id": "lzf8dn6",
      "body": "Don’t forget the necrophilia 🤣",
      "created_utc": 1732809979.0,
      "score": 1
    },
    {
      "id": "lzgro47",
      "body": "Read again after you will argue. Someone who never stole , is he a thief? Necrophilia is a crime okay if you never did anything with any dead corps, are you necrophile? I guess no! There are what you think, there are the law and everything is written.\n\nYou dont act, you dont do any crime.",
      "created_utc": 1732828351.0,
      "score": 0
    },
    {
      "id": "lzgqlq8",
      "body": "I described a situation. Okay you?",
      "created_utc": 1732827983.0,
      "score": 0
    },
    {
      "id": "lznqkgi",
      "body": "Pedo has zero to do with being gay. But keep on…",
      "created_utc": 1732936207.0,
      "score": 0
    },
    {
      "id": "m1h8eqf",
      "body": "Call it what you will, but that's how I'm wired. I discovered it in my teens, as most of us do. Therapy was helpful, and I haven't acted on it or accessed illegal content. I think it's good for people like me to know that it can be lived with safely and without harm.",
      "created_utc": 1733892114.0,
      "score": 1
    },
    {
      "id": "lzf8q6w",
      "body": "Thank goodness you were here to remind me 😅",
      "created_utc": 1732810096.0,
      "score": 2
    },
    {
      "id": "lznqrca",
      "body": "I was replying to the original comment that got deleted, I never said they were?",
      "created_utc": 1732936284.0,
      "score": 1
    },
    {
      "id": "lznqxjv",
      "body": "And I was explaining that pedos do hurt the child they try to be with explaining that has nothing to do with that,",
      "created_utc": 1732936355.0,
      "score": 1
    },
    {
      "id": "m1hlmuq",
      "body": "Agreed. Respect for taking control. It takes a lot of strength and courage.",
      "created_utc": 1733898917.0,
      "score": 2
    }
  ]
}