{
  "id": "1ep6qei",
  "title": "I was raped and I’m out to kill myself",
  "selftext": "I 16m was groomed and raped from the ages of 8-14. I’ve been very poor for my whole life, and my mother died at childbirth. My father blames me for her death. When I met a woman at the park who was nice to me it was the first time I ever felt welcomed. She would become what I thought was something of a mother to me and she would buy me various things. She got me hooked on drugs. When my dad was drunk I would go over to her house and spend the night. When I was 10 years old she got naked for me to see and explore her. After a couple of months of just touching her she told me to get naked and would have sex with me, she told me that if anyone found out then we couldn’t be friends anymore and that I would go back to being a kid who got no attention and was abused at home. For the 4 years that we had been sexual she would stick thing up my butt and in my urethra. When I was 14 I had finally woken up to what was happening but everyone I told either dismissed it or congratulated me. I feel violated and disgusting. Nobody I talk to seems to care and I’m violently afraid of women. I’m sitting in the woods with a bottle of pills right now and I’m ready to kill my self. I’m just waiting for a reason not to. Though I doubt anyone would care like always",
  "created_utc": 1723333344.0,
  "score": 1310,
  "num_comments": 141,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ep6qei/i_was_raped_and_im_out_to_kill_myself/",
  "comments": [
    {
      "id": "lhinnho",
      "body": "I wish I could hug you 🫂❤️‍🩹 Please throw out that bottle of pills. You deserve to live on this earth for many more decades, healing and living a happy life. What she did to you does not define who you are.",
      "created_utc": 1723335931.0,
      "score": 422
    },
    {
      "id": "lhiikna",
      "body": "As a victim of rape/CSA myself. I see you. What she did to you was disgusting and evil and you deserved so much more. You deserved better. ",
      "created_utc": 1723333874.0,
      "score": 326
    },
    {
      "id": "lhiodun",
      "body": "Ur not disgusting the person who did the act is. Ur more than what happened to u. U r enough. U r worthy of life. U r awesome. Ur not what happened to u.",
      "created_utc": 1723336236.0,
      "score": 86
    },
    {
      "id": "lhijs6f",
      "body": "I can be your friend and talk you out of it. Please, brother, consider rehabilitation and get counseling.",
      "created_utc": 1723334355.0,
      "score": 209
    },
    {
      "id": "lhimc3c",
      "body": "Listen I have no experience with that personally. But my father raped my sisters. My oldest sister since the age of 5-16. She went through a really hard life. Foster homes, the streets, She got into drugs, had a lot of men issues, drinking. She had it bad. At like 25ish she totally turned her life around. She decided not to allow the past to control her future. She know is married, has 3 kids, her own home, and has become the person she has always wanted to be. The lesson in this story is, what your going through right now isn’t forever, things change, people change, you can change. If she had taken her life when she was younger, which she has several suicide attempts, she would of missed out on everything she has now. She is genuinely a happy, grateful person. If you ask her how she got to where she is, she would tell you she allowed her child hood and past to motivate her and create a life she never expected. Don’t do it, who knows what you will miss out on in your future. ♥️ \n\nI’m also so sorry you went through what you did. Some humans are fuckin sick and deserve to die, like my father. But, it’s not all humans. I know it’s dark and life is hurtful, but you will find some light, you will overcome this and become a version you never thought possible. Sending you massive amounts of love and care!",
      "created_utc": 1723335393.0,
      "score": 120
    },
    {
      "id": "lhj3l7g",
      "body": "Men who are/were sexually assaulted are more common than people think you aren’t alone in this friend I’m sorry that happened to you I’m sure that is a terrible experience. Things may feel hopeless right now but I promise you they are not. Therapy is important in cases like this to have someone to help you process what happened and that it wasn’t your fault. I’ll say that part again. IT WASNT YOUR FAULT. You got this man those pills are a mistake I promise you people care about you. Ik we do.",
      "created_utc": 1723342607.0,
      "score": 27
    },
    {
      "id": "lhiq5p6",
      "body": "Please look into EMDR therapy. It’s usually effective in PTSD. Sorry it’s been tough.",
      "created_utc": 1723336967.0,
      "score": 47
    },
    {
      "id": "lhiodel",
      "body": "Hey, really, really sorry that this is happening to you. That experience sounds truly horrible. Please stay",
      "created_utc": 1723336231.0,
      "score": 23
    },
    {
      "id": "lhir8ql",
      "body": "I can be your friend.  I went through the same thing that you did, and it really helps to have someone who understands what I've been through",
      "created_utc": 1723337415.0,
      "score": 20
    },
    {
      "id": "lhj7do4",
      "body": "Man 🫂 I’m a guy who was molested you can say, and it’s hard to overcome it at that age. I had panic attacks like crazy. I just wish you’re alive and reading this. You’re 16, you have so much ahead of you man. I’m 25 and I’m telling you 25 year old you would love you so much for holding on rn",
      "created_utc": 1723344260.0,
      "score": 19
    },
    {
      "id": "lhizejf",
      "body": "Please let us know that your alright everyone is here for you no matter what time of day or night",
      "created_utc": 1723340849.0,
      "score": 16
    },
    {
      "id": "lhit7qt",
      "body": "Everything's just horrible. I understand your pain. I feel so sorry you had to deal with hell back and forth... we are with you. Stay with us.",
      "created_utc": 1723338236.0,
      "score": 14
    },
    {
      "id": "lhizj5x",
      "body": "Please don’t go. I am so sorry for what happened to you. It was so so wrong. She saw that you were vulnerable. She is a predator and a monster. It wasn’t your fault. It wasn’t your fault. It wasn’t your fault.",
      "created_utc": 1723340902.0,
      "score": 14
    },
    {
      "id": "lhj95ai",
      "body": "OP please don't. What that monster did to you was heinous, but you are nowhere responsible for it. Don't think low of yourself. I am almost the same age as you, and it sends shivers along my spine what you had to suffer for about 4 years. It seems like you have no responsible adult  figure in your life, try to inform some trustworthy school teachers/good friends..or maybe post information about that monster in the subreddit of the state where you live..\nMore power to you OP. You are really strong for surviving through such torture.\nIf you need help/mental support, free feel to reach out.\nLove and hugs ❤️\nFrom a younger sister",
      "created_utc": 1723345043.0,
      "score": 13
    },
    {
      "id": "lhillfe",
      "body": "That woman wins if you end it.",
      "created_utc": 1723335089.0,
      "score": 56
    },
    {
      "id": "lhj8xvk",
      "body": "When I told people I was being taken advantage of, they responded largely the same way. You're not alone :/",
      "created_utc": 1723344949.0,
      "score": 10
    },
    {
      "id": "lhj4wz1",
      "body": "If life wants you to die, live out of spite.",
      "created_utc": 1723343179.0,
      "score": 7
    },
    {
      "id": "lhj7g7p",
      "body": "Omfg kid, I’m so sorry that all those people failed you and abused you. You didn’t do anything wrong, you’re the kid and they’re the adults that are supposed to protect you.\nPlease know that they don’t represent everyone and there are good people out there. You deserve love and protection and you can get that. Also you can totally get that pedo that abused you arrested if you go to the police and make a report of what happened. \nShe’s the one that should feel like a complete piece of shit - she doesn’t deserve you taking your life over and not getting to experience love and happiness.\nDon’t let the crappy people win, please get help. You can heal and be happy again.. it will take time and patience but you can get there. Hugs ❤️",
      "created_utc": 1723344291.0,
      "score": 8
    },
    {
      "id": "lhj2bge",
      "body": "Keep telling everyone and anyone. Don’t give in to that voice of despair. Even though it’s two years later there are survivors counseling and they can help you. They will listen and they can get the cops involved without anyone else knowing what could happen. You are loved and wanted in this world. If you need to talk I will listen, sometimes it helps talking to an outside party. I’m in your corner, as well as the others commenting on your post. So please stay alive and you’ll get through this.",
      "created_utc": 1723342060.0,
      "score": 6
    },
    {
      "id": "lhj0799",
      "body": "🫂❤️‍🩹 you are so strong. I’m so sorry you had to go through that.",
      "created_utc": 1723341180.0,
      "score": 6
    },
    {
      "id": "lhjeh4n",
      "body": "How can someone pray on a child. Its not your fault. Not the grooming or the SA or your mothers death. Stay alive. Stay alive to prove yourself wrong and to see who you will be if you go forward. Youve had a hard life. Continue for yourself and for your child self. You got this.",
      "created_utc": 1723347499.0,
      "score": 5
    },
    {
      "id": "lhitvv8",
      "body": "I’m so sorry 😢 I’m here for you if you need anyone",
      "created_utc": 1723338518.0,
      "score": 6
    },
    {
      "id": "lhiv51e",
      "body": "I’m sorry happened to you but there are always alternatives that might help you cope.",
      "created_utc": 1723339051.0,
      "score": 6
    },
    {
      "id": "lhj1j69",
      "body": "I care. I’ve been there. Went to a psych clinic. Do it voluntarily sign yourself in through er. (Voluntary) they get your meds right and discuss everything until your safe or better. Don’t do it I care. ❤️ stay plz I’m on Wellbutrin it has helped me a lot.",
      "created_utc": 1723341733.0,
      "score": 5
    },
    {
      "id": "lhj3q6e",
      "body": "Please don't OP!!",
      "created_utc": 1723342668.0,
      "score": 5
    },
    {
      "id": "lhjj2ma",
      "body": "It's not your fault. To hell with these people. You are strong, and you deserve peace. You're a beautiful person, and nobody can take that from you. Remember that.",
      "created_utc": 1723349727.0,
      "score": 5
    },
    {
      "id": "lhiq9ay",
      "body": "We have a safe place for you to stay!",
      "created_utc": 1723337009.0,
      "score": 8
    },
    {
      "id": "lho81tg",
      "body": "You didn't do anything wrong. There is nothing bad about you. The monster that did those things is completely at fault. \n\nI know it is hard right now, you should contact the police or CPS, they can help connect you with resources that can help you get through the hard times.\n\n(At least in the USA, I don't know where you are.)\n\nThe very fact that an adult took advantage of a literal child is awful, the fact that no one is protecting you is terrible, you deserve to be safe no matter what anyone says.",
      "created_utc": 1723422545.0,
      "score": 4
    },
    {
      "id": "lhj87zb",
      "body": "Dude im so so sorry",
      "created_utc": 1723344633.0,
      "score": 3
    },
    {
      "id": "lhj9zts",
      "body": "Your feelings are valid. You are not alone. You are a survivor. We are here for you. You can help others who are going thru the same by letting them know ow that you can make it out and live a good life. You are strong. You are beautiful. You are courageous. You are benevolent. You are destined to do great things in life. No matter what your past is. You are a soldier.",
      "created_utc": 1723345427.0,
      "score": 3
    },
    {
      "id": "lhjbw5w",
      "body": "Have you reached out to the police or a school counselor. Depending on where you live there are resources out there that will help you. And if you live somewhere where there are not a lot of resources I promise you you will make it out of there. You are not stuck. You will not be the 16 year old traumatized and sacred in the woods forever. I'm sorry this happened. I know how it feels to not be heard. But we hear you. You are not alone.",
      "created_utc": 1723346300.0,
      "score": 3
    },
    {
      "id": "lhjgtvt",
      "body": "It’ll get better. I know how shit it sounds. I’ve felt like you. I promise it will get better.",
      "created_utc": 1723348626.0,
      "score": 3
    },
    {
      "id": "lhjgzlh",
      "body": "I care!! I'm so sorry this happened.  I was groomed and raped as a child too. You aren't alone.",
      "created_utc": 1723348702.0,
      "score": 3
    },
    {
      "id": "lhkkhb2",
      "body": "It may get better, went through similar things, I hope it gets better ❤️",
      "created_utc": 1723373213.0,
      "score": 3
    },
    {
      "id": "lhjiytn",
      "body": "I am a victim of CSA as well, and I understand your shame and disgust. It may help you to see a 10 year old, and how little they know of the world, and realize that that was you. What she did was evil in the most foul way. You may think that you're somehow responsible because you participated, but you didn't. You did what an adult you trusted told you to do, which is what children do. You had no filter and no way to understand how cruel and selfish what she asked you to do was. You were a good kid, and desperate for love and attention. People like her know how to exploit that. \n\nIf you'd like, it may help to press charges against her. At the least, you can file a lawsuit and get money for the suffering she put you through. If you can't do that, and there's nothing wrong if you can't, then you can speak out against her, and tell anyone who knows her what she did. No one will think sexual assault against a 10 year old is forgivable. If you can't do that, write her a letter and let her know what she did to you, without sending it. Pour out your feelings and get them out. \n\nTherapy is also a good idea. If you can't afford it, many universities have free or very low cost counseling available. \n\nNone of this is your fault. She is the criminal. You do not deserve the guilt, disgust, and shame you're feeling. It was forced upon you by an evil woman who deserves to spend her life in prison.",
      "created_utc": 1723349674.0,
      "score": 2
    },
    {
      "id": "lhjx87c",
      "body": "What this absolutely hideous horrible horrible disgusting horrible disgusting creepy vile horrible horrible subhuman like monster woman has done is unforgivable!\n\nYou bear no guilt, no shame, the blame lies entirely with her.\n\nYou are worth your life and future, don't let this monster win, never let any monster win!",
      "created_utc": 1723357667.0,
      "score": 2
    },
    {
      "id": "lhjyfuf",
      "body": "Please stay here - you are deserving of good things and what happened to you was wrong",
      "created_utc": 1723358427.0,
      "score": 2
    },
    {
      "id": "lhk2h3y",
      "body": "i can’t believe a father could make their child feel so isolated in this world :( i’m so sorry people have been cruel to you, i wish i could give you a hug, please hit up a survivors hotline, the way you were dismissed is vile to say the least, please remember there are people, like genuine loving people in this world that care 🫶",
      "created_utc": 1723361008.0,
      "score": 2
    },
    {
      "id": "lhk40zx",
      "body": "You need to go to a psychologist , you need someone to tell that you can trust ! No one outside will understand what you are going through and unfortunately A Young Nale being Raped by an older female is seen mostly as a fantasy . So most likely no one will be able to Aleviate that pain or disgust except a professional or someone who truly cares about you. Unfortunately sometimes it’s easier to seek out a professional than finding someone who truly cares . Seek out professional help if you are underage you can get that shit quick. \n\nYou got raped and no matter what anyone says that is a fact and you need professional help. I hope you find a reason to stay here I know it sucks but you got so much left to do.",
      "created_utc": 1723362041.0,
      "score": 2
    },
    {
      "id": "lhkf15w",
      "body": "I feel for you young boy, please give yourself some sympathy you’ve been hurt and deserve comfort, safety, and love. As men it’s not easy to understand our softer loving side when the world conditions to embrace our masculine stoic side. Your idea of love has been distorted, understand that loving a women is to be with someone you are completely comfortable with and when you first try again it will feel uncomfortable for both of you but this is not something you need to rush. You need to find a partner who you can open up to and understand the pace you take the relationship and just bc you have been exposed to these behaviours before doesn’t mean it’s okay to rush back into it with others. Take your time and understand yourself first, you aren’t disgusting. Don’t think guys who haven’t been through what you have will ever understand what you’ve been through. Take care of yourself man.",
      "created_utc": 1723369550.0,
      "score": 2
    },
    {
      "id": "lhlwvoe",
      "body": "I know your pain is immense but you can’t let this pain kill you. You owe it to your younger self, the child who was abused and neglected, and the adult you will become, to give them a better life. They deserve a better life and you are the only person to give it to them. You have to be their hero because in the end we have to be our own hero’s. We have to save ourselves from the trauma we faced so we may lead the lives we want and help those we love. The most important thing you can do right now is SAVE YOURSELF. The first thing any first responder or fire fighter must do is make sure they are in a safe enough position so that they are ABLE to save others. For you to save yourself, you’ve got to throw those pills away and be kind to yourself. This may be the hardest thing you will ever have to do, but it is the only true justice you can give your former and future self. You must be strong for them. \n\nIt doesn’t have to be impossible. Start small. Throw those pills away, make sure your environment is as safe as you can, and try to reach out to someone to talk to. Try to find a therapist that deals with rape and talk to them about what happened because the next step of saving yourself is trying to heal yourself as best as you can. It doesn’t have to be perfect. Just make sure that you are patient and kind to yourself while you deal with this. NONE of this is your fault, but the responsibility to repair yourself is on you. I know you can do this.",
      "created_utc": 1723393395.0,
      "score": 2
    },
    {
      "id": "lhm68yp",
      "body": "Can't pdo women just fucking d¡e like for real. \nI'm so sorry you had to suffer that, you should consider going to therapy. Even online or irl. Please don't die, you deserve better, you can heal.",
      "created_utc": 1723396584.0,
      "score": 2
    },
    {
      "id": "lhmj0cd",
      "body": "I don't blame you for being afraid of women, I am afraid of men for similar reasons unfortunately.\n\nMy mother served me and my siblings up to churchmen on a silver platter, occasionally women too. \n\nYou're not alone, there's a lot of us out here and you deserve to be in community with people who have been where you are, or at least in the neighborhood, and know how to navigate towards a life worth living.\n\nIf the worst has already happened to you, there isn't much more you couldn't risk to live a life you not only don't hate but that is downright pleasant most of the time. \n\nThere are some really good groups of severe trauma survivors who would not only be of help but of great fellowship and community to you.\n\nI never thought in a million years that I could not only talk about what happened to me and my loved ones in detail to people who have survived the same and worse... But that we could tell terrible dark jokes to each other about it and actually laugh without so much pain.\n\nI'm not better, not by much, but I can see that maybe I will be if I keep this up.\n\nI don't find men too scary to be around most of the time now, but I do take them seriously as a threat, just like you do with women since we're some of the scariest creatures on the planet, us humans I mean.\n\nThere's healing in this world, and you are 16 at one of the hardest parts of life (in my experience) and your brain hasn't even had a chance to heal nevermind become fully functional in ways you can't imagine yet.\n\nIf you can stay, if you can change your life fundamentally in ways that will benefit you... Would it be worth it to see if you can taste a life worth having? Just to see if it's worth sticking around?",
      "created_utc": 1723400900.0,
      "score": 2
    },
    {
      "id": "lhvxszd",
      "body": "boy/men getting graped no one cares, girl/women getting graped everyone will care🤦😂",
      "created_utc": 1723543385.0,
      "score": 2
    },
    {
      "id": "lhinver",
      "body": "[removed]",
      "created_utc": 1723336022.0,
      "score": 1
    },
    {
      "id": "lhji34p",
      "body": "What you've gone through is just the worst. I understand, as a girl I've gone through many things too. Nothing is a little thing being a guy experiencing this can just be the most awful. I just wanna hug you. I wanna hug you and be there for you. I wanna be with you in there woods and listen to you. I wish we could've spend time and make good memories that we would talk about in a roadside cafe at the evening. I wish I was happy with you. I've experienced stuff too and all I ever wanted was this and I wish you were that person. Oh how amazingly we would've understood each other !",
      "created_utc": 1723349238.0,
      "score": 1
    },
    {
      "id": "lhjplao",
      "body": "Give up, and they've won. Stay strong, the future isn't the past.",
      "created_utc": 1723353167.0,
      "score": 1
    },
    {
      "id": "lhjrbad",
      "body": "Sir, I feel your pain in that trauma, if you want to talk I'm always here",
      "created_utc": 1723354142.0,
      "score": 1
    },
    {
      "id": "lhjrutm",
      "body": "I promise you it gets better. I have witnessed so many survivors not only survive but thrive. Listen to those here telling you the same thing. There is help for you please reach out to those resources .",
      "created_utc": 1723354455.0,
      "score": 1
    },
    {
      "id": "lhkcykj",
      "body": "As someone who was exploited, I believe you! I’m truly sorry you went through that and I wished I could give you a hug.",
      "created_utc": 1723368114.0,
      "score": 1
    },
    {
      "id": "lhkd15g",
      "body": "Jesus, you have been through the worse of humanity. THIS IS NOT YOUR FAULT. AT ALL. I am so sorry OP. I am really not surprised you feel so low and are considering suicide. You were failed by your dad, who didn't protect you, and pushed you out on your own, by the predator that found you and then by other adults who wouldn't listen to you or who seem to think it's a joke. I have been raped, but it wasn't as violent and degrading as what you've been through. I am so so sorry.",
      "created_utc": 1723368164.0,
      "score": 1
    },
    {
      "id": "lhkdpv8",
      "body": "Hey you still there? I’m here if you need someone to talk to :)",
      "created_utc": 1723368634.0,
      "score": 1
    },
    {
      "id": "lhkpgtj",
      "body": "I’m so sorry for your pain you never deserved such hurt",
      "created_utc": 1723376172.0,
      "score": 1
    },
    {
      "id": "lhksils",
      "body": "I understand the way you're feeling and the thought process, but things don't have to remain thia way or result in ending your life. I'm willing to listen to you if want to, without judgement. There's also professionals who can help you come to terms with this and approach resources thar will benefit your mental health.\n You did nothing wrong, you're the victim, with therapy and support from friends I hope you can deal with this and have a better outlook on life.",
      "created_utc": 1723377783.0,
      "score": 1
    },
    {
      "id": "lhkwtg0",
      "body": "Honey please tell me you’re still with us life does NOT have to be this way and none of this is your fault in the slightest!",
      "created_utc": 1723379899.0,
      "score": 1
    },
    {
      "id": "lhl546n",
      "body": "I am so so sorry that happened to you.\nI see you and believe you.\n\nHope you'll be able to find people around you that treat you with the respect, consideration and compassion you deserve.\n\nI'm not going to say \"everything will be fine\" or anything, because I can't predict the future; noone can.\n\nBut there are ways to work through trauma and I hope you'll find one that will help you and that your life will get better.\n\nAnd you also are at an age when everything feels so much more extreme, than later in life. \n\nYou have survived so far and I hope you'll find a way to survive a little longer, so you get a chance to live and thrive at one point.  <3",
      "created_utc": 1723383532.0,
      "score": 1
    },
    {
      "id": "lhl59fs",
      "body": "What this evil person did to you does NOT define you! It defines THEM!!! I’m praying God grabs you tightly and holds you where you feel Him and you are able to breathe and feel safe.",
      "created_utc": 1723383593.0,
      "score": 1
    },
    {
      "id": "lhliinj",
      "body": "Im so sorry you have to deal with this. Please dont kill your self because you have alot to live for.",
      "created_utc": 1723388532.0,
      "score": 1
    },
    {
      "id": "lhm7emn",
      "body": "you are not alone there are many people just like you, you have a strong community of survivors don’t let what one person did to you ruin your perception of yourself you deserve to live the remainder of your life happy",
      "created_utc": 1723396979.0,
      "score": 1
    },
    {
      "id": "lhmbyhy",
      "body": "Please contact the police.",
      "created_utc": 1723398518.0,
      "score": 1
    },
    {
      "id": "lhn1ee1",
      "body": "Dude, I have gone through a similar thing. My half-sister, who was 15 abused me when I was 9. You must not die. No one takes females abusing males seriously, it took me years before I was able to finally sit in a room, full of CSA specialists, to tell them of the damage it did. \nYou need to throw out the bottle and talk to someone. A professional who specialises in this is ideal, but any therapist would help. You need to tell your story. With the right help, it won’t kill the pain, but you can heal and learn to live a better life.",
      "created_utc": 1723407143.0,
      "score": 1
    },
    {
      "id": "lhn2ib5",
      "body": "I’m so sad you had to go through that. I wish I could be there for you in any helping way possible. \n\nI was groomed & abused when I was a child. Now I’m in my 40s and have a son that I love so much.  I learned to love live.\n\nRemember, my dear friend:\nSuicide is a permanent solution for a temporary problem! Always. \n\nPlease go to a hospital.  They are specialized to help you. You only need to tell them what YOU WANT to tell. They see cases like ours often, unfortunately. They know how to help.\n\nP L E A S E ! !",
      "created_utc": 1723407510.0,
      "score": 1
    },
    {
      "id": "lhnf9hp",
      "body": "as a victim myself, (even recently..) i can tell you, coping does get better. your life is not over because of what happened to you. if the people in your life really “don’t care”, they’re not your friends.",
      "created_utc": 1723411809.0,
      "score": 1
    },
    {
      "id": "lhntfxq",
      "body": "Sorry to hear that. Most people who hook people into drugs need to control them. Many sex workers, actors, models etc have a bad rep for getting hooked on substances. It's not fair, but you owe it firstly to yourself to get clean and make the most of your life. Get a journal  AND write down your feelings. Take long walks and try to find good positive people to surround yourself in the community. Think about what you want and need out of life and pursue it. Also, stay far away from this so called \"woman\" you may think she was something due to your ties in the past , but she  most likely isn't going to change .  Try to network and create a good support network for yourself as well. If you can afford it you can also look into therapy to help with the trauma you have been through",
      "created_utc": 1723416941.0,
      "score": 1
    },
    {
      "id": "lhny140",
      "body": "Hey man, I know I'm an internet stranger, but I see you. \n\nI was molested and raped growing up, and I had  people not believe me, especially when starting to get help. At the end of the day, if you know what happened to you, then it is your hurt, your pain, your trauma, and only you can truly know the extent of it and how to treat/fix it. \n\nThat being said, please look into therapy or a support group. In my state people can start therapy as young as 15-16 without parents being involved,l. I'd recommend looking into all options, and seeing how you can get the help you deserve.\n\nAll I can say is you are more than the pain, and hurt, and bad things; a swords gotta be put through  fire and be forged multiple times before it's anywhere near the finally product. \n\nI'm here if you need to talk!",
      "created_utc": 1723418669.0,
      "score": 1
    },
    {
      "id": "lhowyhu",
      "body": "I’m so sorry this happened to you. I’m here for you",
      "created_utc": 1723432849.0,
      "score": 1
    },
    {
      "id": "lhpt838",
      "body": "You can't die without getting justice. There's a special place in hell for her.",
      "created_utc": 1723451889.0,
      "score": 1
    },
    {
      "id": "lhqva6q",
      "body": "The woman should be charged and arrested. Can't OP take legal advice since he is a minor. She literally destroyed his life and he is barely living because of her. If there is a hell, she is going there.",
      "created_utc": 1723471163.0,
      "score": 1
    },
    {
      "id": "lhvadkf",
      "body": "That’s terrible what happened to you. I would definitely care and try to help you overcome.",
      "created_utc": 1723527961.0,
      "score": 1
    },
    {
      "id": "lhvxdbs",
      "body": "I wish I could save you, people need to help you. All the adults around you have been failing miserably...\n\nAre you in school or anything? Is there any authority you can talk to about this or have they all been dismissive? How bad is it at home, is your father abusive every day?",
      "created_utc": 1723543110.0,
      "score": 1
    },
    {
      "id": "lihqt5q",
      "body": "I’m sorry this atrocious, evil act was forced on you. This woman is evil, what she did to you was evil, and she will reap evil in her life for the unjust, unprovoked harm she’s put on you. You are the innocent person here, not her. \n\nUnfortunately, sexual predators seek out children who are alone and without adult/parent supervision in their lives—where children are at their most vulnerable. So, now that you know, protect yourself from more sadistic adults and teenagers alike. \n\nI don’t know if this will help, but maybe it’ll make you feel better to watch episodes or clips of “To Catch a Predator” on YouTube. Or watch other YouTubers bust child predators by luring them out. ",
      "created_utc": 1723853797.0,
      "score": 1
    },
    {
      "id": "lkt5c2x",
      "body": "I’m really sorry , I hope you get better with moving forward",
      "created_utc": 1725097469.0,
      "score": 1
    },
    {
      "id": "lnnu3gc",
      "body": "I hate the advice everyone is giving you.  Are you still alive? Where do you live?",
      "created_utc": 1726620127.0,
      "score": 1
    },
    {
      "id": "lhiur7k",
      "body": "Life will get better eventually I promise you just have to keep fighting. 🖤",
      "created_utc": 1723338888.0,
      "score": 1
    },
    {
      "id": "lhkf5sr",
      "body": "[removed]",
      "created_utc": 1723369638.0,
      "score": 1
    },
    {
      "id": "lhiwa9t",
      "body": "[removed]",
      "created_utc": 1723339540.0,
      "score": -21
    },
    {
      "id": "lhmak9d",
      "body": "[removed]",
      "created_utc": 1723398047.0,
      "score": -4
    },
    {
      "id": "li4kjhs",
      "body": "[removed]",
      "created_utc": 1723665472.0,
      "score": -7
    },
    {
      "id": "lhinz29",
      "body": "[removed]",
      "created_utc": 1723336065.0,
      "score": -282
    },
    {
      "id": "li51wff",
      "body": "Your comment gave me so much hope. Thank you and I’m so glad your sister found happiness after struggling with addiction. So many struggle with addiction because of childhood trauma and I hope our society will grow to recognize that help, rather than punishment, is justified. ",
      "created_utc": 1723670928.0,
      "score": 2
    },
    {
      "id": "lhl5g2b",
      "body": "I’m currently doing this AND chiropractic care for trauma is OUTSTANDING!!!",
      "created_utc": 1723383668.0,
      "score": 11
    },
    {
      "id": "lhk2eo7",
      "body": "Live to spite your enemies ftw",
      "created_utc": 1723360964.0,
      "score": 18
    },
    {
      "id": "lhl79fw",
      "body": "THISSS.",
      "created_utc": 1723384397.0,
      "score": 6
    },
    {
      "id": "lhwwfqr",
      "body": "That’s not true. In some cultures, places and communities, women are always the ones to be blamed. Even then, people just don’t care for others in general. It doesn’t matter who the victim is. People always blame the victim as they think that’s the easiest thing to do. There are tons of studies and reports about the culprits but almost no studies and reports about the victims. No one is talking or listening to what the victims have to say. ",
      "created_utc": 1723558752.0,
      "score": 0
    },
    {
      "id": "lhm0lfj",
      "body": "because it’s about power, getting a kick from controlling someone. they r disgusting.",
      "created_utc": 1723394663.0,
      "score": 2
    },
    {
      "id": "lhvxplq",
      "body": "lol😭",
      "created_utc": 1723543325.0,
      "score": 1
    },
    {
      "id": "lhipet5",
      "body": "I mean you never know. Shit like this does happen? Do you live under a rock or are you just ignorant asf.",
      "created_utc": 1723336660.0,
      "score": 149
    },
    {
      "id": "lhirn33",
      "body": "This post is perfectly believable.",
      "created_utc": 1723337582.0,
      "score": 90
    },
    {
      "id": "lhivqnb",
      "body": "Just like you took the time to write that, people will take the time to write shit like this and be 100 % real .",
      "created_utc": 1723339306.0,
      "score": 35
    },
    {
      "id": "lhipqjv",
      "body": "there can still be a small chance its real and if it is, its extremely significant and we should help. if its fake in the end youre only spending a few seconds writing a comment anyway",
      "created_utc": 1723336793.0,
      "score": 47
    },
    {
      "id": "lhkdm2l",
      "body": "Why would we not belive it? People like you are part of the problem. Besides, I’d rather reach out and be caring with a chance that this is fake rather than dismiss it and be rude and leave a child to die feeling alone.",
      "created_utc": 1723368561.0,
      "score": 10
    },
    {
      "id": "lhkdw3i",
      "body": "This post is perfectly believable. And anyways, the risk of reacting to it and it ends up being fake is nothing close to ignoring it because it might be fake and we lose another brother.",
      "created_utc": 1723368752.0,
      "score": 7
    },
    {
      "id": "lhk2ink",
      "body": "But the truth is that op needs attention and it's normal.",
      "created_utc": 1723361036.0,
      "score": 7
    },
    {
      "id": "li5ef2d",
      "body": "I witnessed some horrific things as a child and addiction was a huge part of my story. I was so angry at the world I had to drink and do drugs to escape. My goal in life was to kill my father when he got out of jail so I didn’t care about my own. Then I found recovery and realized I was still allowing him to control my life when he wasn’t even there. There was a moment I decided to take my life back and make a change. I achieved 5 years of recovery and totally changed my life. Got married, built a house, have an amazing puppy, and have found some inner peace. My other sister who was also raped by my father still is in active addiction, 10 different psych meds, lives in the project and has a horrible life, she wasn’t able to make that decision. Be the one who makes that session please. As shitty as life is and as fucked up people are, I promise there is still beauty and good people. Don’t allow your past to define your future. I don’t even know you but I believe in you and literally am praying for you. Much love to you. If I can recommend some books it would be the power of now, unteathered soul, and the 4 agreements.",
      "created_utc": 1723675189.0,
      "score": 1
    }
  ]
}