{
  "id": "1g9n4sx",
  "title": "Switching From Passively Suicidal to Actively Suicidal Actually Gave Me Relief?",
  "selftext": "*Has anyone else had this feeling? Or find it somewhat relatable?*\n\nI \\[24M\\] have been passively suicidal for a few months now, but yesterday was an exceptionally awful day. I slept super late, I forgot I was scheduled to work, couldn't get dressed, couldn't leave the house, tried to fix my bike but ended up breaking it even more. Then I gave into pretty much all of my self-sabotaging vices (drugs, porn, shitty food, video games, you name it). \n\n  \nI swear something snapped. I cried a *ridiculous* amount throughout the day and spent the rest of the night feverishly reading up on suicide. I actually figured out my gameplan. I found a whole document outlining the specifics and answered all the little questions I had (sorry not sharing — don't even ask me) plus a backup option in case I'm desperate enough to do something quicker. For now, I'm in the stage of acquiring the materials and getting my affairs in order.\n\n  \nSince I got my suicide method figured out, I'm in a strangely upbeat mood. \n\nIt's an odd paradox. Finalizing my plan of action to end my life made me feel motivated to go out and live it. I'm getting chores done with no sweat, I'm dancing and listening to fun music, I'm gaining bits of my personality back. A great weight has been lifted off my shoulders.\n\nFrom what I heard, it's common for people to act calm or joyful the days before they make an attempt. Is that what I'm experiencing? Maybe it's because I have a goal now? Like my days don't feel meaningless like they persistently have? Or maybe finally there's an escape route to break free from the shitshow that is my life. I don't feel as trapped and hopeless anymore. \n\nAnyways, I wanted to see if this anyone here had a similar experience or wants to weigh in on this situation.\n\nTL:DR - I'm actively suicidal for the first time in my life and I feel much better after I figured out my method. What's the meaning behind this?\n\n\n\n ",
  "created_utc": 1729616437.0,
  "score": 957,
  "num_comments": 75,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1g9n4sx/switching_from_passively_suicidal_to_actively/",
  "comments": [
    {
      "id": "lt8ii59",
      "body": ">From what I heard, it's common for people to act calm or joyful the days before they make an attempt.\n\nYes, this is very common.  I mean, why would someone be super worried, upset, etc. if they were certain everything would be over in a few days anyway?",
      "created_utc": 1729630913.0,
      "score": 350
    },
    {
      "id": "lt8leua",
      "body": "It sounds like you are euphoric for feeling a sense of control with your life.",
      "created_utc": 1729631805.0,
      "score": 372
    },
    {
      "id": "lt8iuf0",
      "body": "[deleted]",
      "created_utc": 1729631016.0,
      "score": 198
    },
    {
      "id": "lt8oafv",
      "body": "Man, for me, back when I used to remember \"If my life isn't together by 25 I can always just use the escape route\", it would feel... cathartic. I think in my case, it was the pressure and anxiety being lifted. I had (am still working through it but it hasn't gone away) really bad anxiety and I guess the idea of nothing mattering in a couple years made life a little more bareable. Not having to worry about my relationships with others, trying to get everyone to like me, trying to make everyone happy at the cost of my own happiness, is a really damn good feeling. And I don't think I ever pieced that together in my younger years, I thought it was just that I wanted to get to the end asap. \n\nSo, TLDR, for me it was a lack of anxiety and pressure that gave me this sense of freedom and lifted spirit. I think, Idk I mean you never really know anything ig but I'm pretty sure.",
      "created_utc": 1729632716.0,
      "score": 57
    },
    {
      "id": "lt8ncjm",
      "body": "It’s from the sense of control. It does show though that you’re still capable of feeling that way though. A different avenue could make you feel similar/in control as well. I’m passively suicidal in that I haven’t made a plan but I can totaly see myself feeling the same. Rn im going through my bucket list and it’s made me feel good. Sometimes things we don’t expect to make a difference do. Every small action or inaction causes a domino effect",
      "created_utc": 1729632415.0,
      "score": 52
    },
    {
      "id": "lt8x26w",
      "body": "[deleted]",
      "created_utc": 1729635645.0,
      "score": 13
    },
    {
      "id": "lt9h0sg",
      "body": "Sorry you’re feeling this way man. I can relate - I originally was going to kill myself a long time ago. I felt so euphoric while I was getting ready. Then a friend realized what I was going to do and called the cops to stop me. When they did, the feeling faded and I realized it was just a short-term rush. Everything felt even worse for the next few days, but I got through it.\n\nI hope you’re still around in the future. Just know it’s normal to have especially bad days, and it isn’t the end of your life. This too shall pass. Jobs, clothes, bikes…it can all be replaced. And clean streaks can be restarted.\n\nLet me know if you want to talk! Stay safe man.",
      "created_utc": 1729642610.0,
      "score": 22
    },
    {
      "id": "lt8ouep",
      "body": "Perhaps ‘control and/or acceptance’. \n\nI’ve experienced this same feeling at times, and it is a weird paradox. It’s either been that everything has piled up so much in my life that suddenly my mind snaps and I can accept the bad without feeling I have to control it, or that I can accept it all because I’ve taken back control by planning my end. \n\nPerhaps through therapy or counselling you may discover a way to experience this liberating feeling from another means. I’m not saying it’ll be easy. For me the passive suicidal side is still there, but there are things I can do to feel that sense of control or acceptance of my situation without the suicide plan. Nothing I have found to be a permanent solution, but some things work for long enough to get through the worst days.",
      "created_utc": 1729632896.0,
      "score": 7
    },
    {
      "id": "lt8qaib",
      "body": "It is the same for me. I've heard a psychotherapist (Dr. K on YouTube) say that passive suicidality is your brain/mind seeing your life going in a downward trajectory. You don't have a since of control or a roadmap for your future. And I guess in some way, having a plan, a means, an end date gives you a sense of agency and roadmap.",
      "created_utc": 1729633367.0,
      "score": 16
    },
    {
      "id": "lt8qgtz",
      "body": "This is very relatable, but I kinda made a use of it. I'm no longer suicidal, but I still enjoy this mood, so I enjoy all kinds of suicidal content - be it a game, music, or just imagining some scenario that I will end my life tomorrow and do all the things I've always wanted to do. Besides a feeling of control, I think there is something beautiful about it. So, maybe it's possible to feel this relief and not actually proceed.",
      "created_utc": 1729633423.0,
      "score": 11
    },
    {
      "id": "lt9fxaf",
      "body": "Very common. Every time i have a plan, thinking about it makes me happy. Only thing that works.",
      "created_utc": 1729642225.0,
      "score": 5
    },
    {
      "id": "lta5prk",
      "body": "I know the feeling. I have been planning mine for a while and almost have everything in order. It feels like a relief, knowing that it all will be over soon.",
      "created_utc": 1729651393.0,
      "score": 5
    },
    {
      "id": "lt998c3",
      "body": "I feel this. Right before I was admitted to the mental hospital by a friend, I was exceptionally happy a few days before. It gets a bit easier, man",
      "created_utc": 1729639890.0,
      "score": 8
    },
    {
      "id": "lt9ktjq",
      "body": "This sounds so much like me and the timing is almost exactly the same, down to most of the small details, that I'm seriously convinced this is a sign. I don't know what the universe is trying to tell me but I hope things get better for us",
      "created_utc": 1729643926.0,
      "score": 3
    },
    {
      "id": "lt8vbja",
      "body": "Yes. I think it's akin to the home stretch in a race where you know the effort is almost over but you find that final burst of energy when you see that finish line in the distance.\n\nHas anything in day to day life starting getting better for you in that time?",
      "created_utc": 1729635049.0,
      "score": 7
    },
    {
      "id": "lt7eaxe",
      "body": "Well I’m 14 make and I kind of feel the same I figured out I wanna die basically it’s pretty normal but please don’t do it like at least try a bit",
      "created_utc": 1729618604.0,
      "score": 9
    },
    {
      "id": "lt98687",
      "body": "Finding recourses and detailed instructions brought me a relief as well. Although im still stuck and it didnt do this much for me, because i know my fear of death will keep me trapped here. But knowing I could do it if i ever felt I could is comforting in its own weird way.",
      "created_utc": 1729639525.0,
      "score": 3
    },
    {
      "id": "lt99l9v",
      "body": "I wish I felt this way. Having a plan has only fed into my self hatred as I’m to much of a coward to risk it. Like even when I don’t have the impulse and am thinking more clearly it still just feels horrible and makes all of my other struggles feel amplified. I’m terrified that  this is going to get the best of my before I can fix my life.",
      "created_utc": 1729640015.0,
      "score": 3
    },
    {
      "id": "lt9q652",
      "body": "That's exactly how I feel at this moment. It went just like you  said, but I'm postponing it because I'm having trouble writing my final letter...\nI have everything gathered, I just need to say what I wanted to say and... Give in, finally... Just finally be able to take control and end everything.",
      "created_utc": 1729645806.0,
      "score": 3
    },
    {
      "id": "lt8ipf3",
      "body": "So uh. What if instead of making death a goal, we gave ourselves a little bit easier of a goal? You can have goals you work towards without it being the end of your life :(",
      "created_utc": 1729630974.0,
      "score": 8
    },
    {
      "id": "lt90ibq",
      "body": "I imagine you feel more in control rather than a passive victim and that’s nice.",
      "created_utc": 1729636844.0,
      "score": 2
    },
    {
      "id": "lta83s8",
      "body": "Yes, I would say this is a shared experience. I've been going through a lot of shit myself and feel like a complete fucking failure and a burden in this world. I'm constantly stressed and having panic attacks about how much worse my life will get and have constant thoughts about killing myself. These thoughts usually help because it gives me a sense of hope that all of this could maybe end, but the problem is I have no fucking idea how I'm going to go about doing so, so that is also stressing me out. I feel like once I have the materials and an actual plan that I am confident in, I too will finally be able to live my last few days in a more positive sense, similar to what you're experiencing right now.",
      "created_utc": 1729652333.0,
      "score": 2
    },
    {
      "id": "ltavs5q",
      "body": "When realizing I could just kms I stopped worrying about at lot of stuff just waiting for the day I mess up",
      "created_utc": 1729664007.0,
      "score": 2
    },
    {
      "id": "ltavsau",
      "body": "There's philosopher once said “I live only because it is in my power to die whenever I want; without the idea of suicide I would have killed myself a long time ago.”",
      "created_utc": 1729664010.0,
      "score": 2
    },
    {
      "id": "ltchhjf",
      "body": "I feel like I couldn't get to that level without having my cremation set up and paid for, my pics picked out for whatever service my family ends up doing, and all my belongings packed up and ready to be donated.",
      "created_utc": 1729693673.0,
      "score": 2
    },
    {
      "id": "lu2fxwp",
      "body": "I was the same.\nHaving a goal, even suicide is better than having no goal.",
      "created_utc": 1730061151.0,
      "score": 2
    },
    {
      "id": "m46nsl3",
      "body": "I'm currently experiencing this- the moment I finalized my plans, I became more happy and upbeat.",
      "created_utc": 1735389399.0,
      "score": 2
    },
    {
      "id": "mmqw1kj",
      "body": "This was me a few days ago. Got everything planned out and the materials in my cart. I was on top of the world. \nThen the tariffs hit and my shipment got cancelled. I'm so pissed.",
      "created_utc": 1744471845.0,
      "score": 2
    },
    {
      "id": "lta4arf",
      "body": "I'm happy for you. \n\nI remember the feeling I had when I completed the step that would end my life. Complete bliss and euphoria. Literally never had a feeling like it that I can remember. The absolute knowledge I had done the right thing and the pain was almost over.\n\nUnfortunately I was saved and have to take some time to get everything ready to go again but it's coming and I'm looking forward to it.\n\nGood luck on your journey, no matter how it goes.",
      "created_utc": 1729650885.0,
      "score": 2
    },
    {
      "id": "ltaqvsp",
      "body": "“Sorry not sharing - don’t even ask me”\nOk…I get it on a surface level. You think you’re being ethical or whatever. \nBut you need to know, to other desperately suicidal people, this is like saying “I found the buried treasure and I’m not sharing”.\nCongrats on the clarity tho",
      "created_utc": 1729661112.0,
      "score": 2
    },
    {
      "id": "ltawp64",
      "body": "I'm not sure if it's the same, but I just came to terms with feeling suicidal. I guess it's accepting the inevitable. I feared the day of reaching that amount of indifference, but it does feels so liberating knowing you can just quit whenever you want and no one can stop you. \nNo emotions, just cold, clinical detachment.",
      "created_utc": 1729664582.0,
      "score": 1
    },
    {
      "id": "ltbz7qe",
      "body": "It’s cause you have control and it feels like you are doing your duities. Often times people don’t want to die they just want to change their reality,\nIt’s happen with me too\nGive it some time and see if you can keep this control going a little by little\nHeck if you have to gaslight yourself think you will die every night just worry about the day",
      "created_utc": 1729687168.0,
      "score": 1
    },
    {
      "id": "ltcv4iq",
      "body": "i wonder. do you have ADHD by chance?",
      "created_utc": 1729697934.0,
      "score": 1
    },
    {
      "id": "lte6dc5",
      "body": "Knowing one has a way out, a clear plan Z - is the most comforting thing a severely depressed person may have.",
      "created_utc": 1729712404.0,
      "score": 1
    },
    {
      "id": "ltq52ya",
      "body": "For me, it's because I know I have a way out. A final option in case things never work out and I can't take the burden anymore. Knowing I have this option makes me feel less scared about trying this life thing some more, because I know I don't HAVE to.\n\n\nI described it to my therapist as having a comfort blanket. I don't plan to actually do it, but I know there's an option. It's the freedom of knowing that I have a CHOICE. ",
      "created_utc": 1729881249.0,
      "score": 1
    },
    {
      "id": "lu4ojwq",
      "body": "I want to have the strength to do this I’m searching for the easiest way to do it and I’m not even good at that I feel like a failure even when I want out of this life crazy know ",
      "created_utc": 1730090575.0,
      "score": 1
    },
    {
      "id": "ltafp1k",
      "body": "This happened to me too. Once i set a date to do it a weight was lifted. It was like i was relieved to not have anymore duties or obligation to anyone. But the day i attempted i was suddenly filled with anxiety and sadness. I took a picture of my house as I pulled out of the driveway crying cuz i would never see it again. It was a traumatic day but im glad it didn’t work because so many people have told me how much they would’ve missed me. U really mean more to people than you know. I might be in pain but it’s better than giving my siblings and parents a lifetime of pain. Lots of love🫶",
      "created_utc": 1729655558.0,
      "score": 1
    },
    {
      "id": "lt9ejop",
      "body": "You answered your own questions in the last big paragraph. The only thing that makes some of us happy at this point is thinking about this life without ourselves in it. I do hope you can feel better and get help without attempting. I've never gotten that freeing euphoria for some reason idk but I would ride that wave as long as I could if I were you",
      "created_utc": 1729641744.0,
      "score": 0
    },
    {
      "id": "lta7il6",
      "body": "Did you have a similar planning phase and a similar sentiment of release, except without it being about suicide?",
      "created_utc": 1729652101.0,
      "score": 0
    },
    {
      "id": "lt9u209",
      "body": "Some people are just emotionally attached to life. Some aren't",
      "created_utc": 1729647189.0,
      "score": 63
    },
    {
      "id": "lta20ra",
      "body": "I think you're right. My life has gotten so off the rails and I lost that feeling of agency a very long time ago. This is the first time I trusted my decision-making in well over two years. It's a shame it's leading me out of this world instead of bringing me into it. A dark path is a path nonetheless.",
      "created_utc": 1729650055.0,
      "score": 82
    },
    {
      "id": "lta5662",
      "body": "100% agreed. I never realized how much of a difference it makes. It's more logical and less abstract. Not a matter of if you can do it, but when do you chose to. Strangely empowering. \n\nAnyways, I'm glad you found a sense of peace. Hopefully I find some for myself going forward.",
      "created_utc": 1729651182.0,
      "score": 52
    },
    {
      "id": "lt8qyn8",
      "body": "So what stopped you?  I'm 23 and kind of curious as to whether I'll end up doing it.  Hard to say with my mood swings",
      "created_utc": 1729633583.0,
      "score": 12
    },
    {
      "id": "lt9qld0",
      "body": "Very similar to me, but my anxiety is actively delaying things, as I cant write my final letters. There's a lot a have to say and to clarify...",
      "created_utc": 1729645960.0,
      "score": 2
    },
    {
      "id": "ludi5mi",
      "body": "You don't know it was a short term rush. It was ended by someone else. I am not saying you should have completed the plan but you don't actually know it was a short term rush, it just happened to be when your plans were changed. ",
      "created_utc": 1730220566.0,
      "score": 2
    },
    {
      "id": "ltacz9u",
      "body": "If you think it's a sign, than it must be saying that you're in the right place. That's what it felt like to me. I would never wish this on anyone, but it is nice to know that others can in fact relate. I hope things get better too. Best of luck on whatever you chose to do.",
      "created_utc": 1729654361.0,
      "score": 2
    },
    {
      "id": "ltaklmq",
      "body": "exactly this.",
      "created_utc": 1729657857.0,
      "score": 2
    },
    {
      "id": "lta9c8k",
      "body": "This exactly. What an amazing discovery OP made, to find that he still has the capacity to feel good about having a goal, whatever that goal is. Would be a shame to waste that potential. Believing you can only feel good about ending your life and nothing else would be illogical and downright ridiculous.",
      "created_utc": 1729652831.0,
      "score": 1
    },
    {
      "id": "lttka4t",
      "body": "Can you expand on this?",
      "created_utc": 1729930921.0,
      "score": 1
    },
    {
      "id": "lta8dib",
      "body": "What are the odds that this is the only thing you could feel this good about? Even in a universe that's based on pure randomness, not governed by any laws, you would accidentally find other things that may even be better. Let alone in ours. Think about it. You have a baseline you can aim for.",
      "created_utc": 1729652440.0,
      "score": 35
    },
    {
      "id": "lu2h669",
      "body": "Last week read that Shirel a young woman who was 22 in Israel, killed herself during her birthday party.\nShe had been depressed for a year.\nI cannot understand how someone so young who has her life in front of her, loved ones, has the courage and can kill herself.\nI am a woman late 50's and cannot squeeze the trigger on my dogs and me.\nCannot abandon them either.\nI am a failure at happiness, life and am a coward.\nGave birth to 2 children who are 28 and 19 though and happy and successful.",
      "created_utc": 1730061507.0,
      "score": 1
    },
    {
      "id": "lt8uuz2",
      "body": "I graduated college, but I hated the idea of going for a Master's. My sister got married, and I was living with her so I had to move back in with my parents. I had obviously not been good for awhile, but it got so much worse. But the thing that stopped me was a particularly bad episode where I got angry and resentful at everyone who loved me, every tie I had to this earth that kept me here. So I opened up to my mother about it. \n\nI had been to two therapists before, and thought it was all a bunch of bs. Their stupid, flowery language and bullshit reassurances. But this time, it was different. She was blunt, said what she meant, and told me when she was sugarcoating things. Got diagnosed with MDD and GAD, along with what she thinks is undiagnosed ADHD. I fucking hated the idea of meds, I hated having to stay alive for everyone else, and after the first two doses didn't work I was starting to slip again. \n\nBut the third dosage def shifted things. I still had all the same thoughts, but without that overbearing haze of hopelessness. Started getting more enthusiastic in therapy, opening up more and learning more about myself.\n\nTurns out I had no sense of identity because the idea of having wants and needs were emotionally drained out of me at a very young age. I still have trouble with what I want, and even more trouble expressing it.\n\nBut this is the best I have ever been, for as long as I can remember. It's never left my mind as an option, I'll be real, but it's... not the only option anymore. Found websites that could hook you up with jobs around the states, and it's been huge. Getting away from the cycles of unaware emotional abuse that my family unwillingly follows was, I think, the biggest turning point for me. And I never realized all of the things that were abuse and neglect.\n\nSorry if it's long-winded, but I feel like everything was necessary to explain what made me stop going to suicide as a last resort. Best advice I have: don't quit on therapy bc of a few bad therapists. And think about why you were curious about what changed my mind 😗\n\nFeel free to reach out if you ever wanna talk",
      "created_utc": 1729634892.0,
      "score": 24
    },
    {
      "id": "lt99xez",
      "body": "I can totally relate i really want to make it but when you suddenly dive to a ungodly low point that unexpectedness makes it really scary Hopefully we can both push through and make it to better times I’ll be keeping you in my thoughts.",
      "created_utc": 1729640132.0,
      "score": 6
    },
    {
      "id": "luqf6sr",
      "body": "Fair. I guess I just realized it wasn’t really what I wanted - it was a false sense of happiness. Like when I’m actually happy about something, and someone interrupts me I just want the conversation to end so I can get back to whatever it is. But it wasn’t like that this time - I didn’t want to go back to my plan. I was actually really unhappy and just lying to myself that following through on my plan was going to take my troubles away and was what I actually wanted. I actually wanted to live, I just wanted my troubles to end somehow and I was on the verge of giving up. But my friends made me realize there was still hope for me.",
      "created_utc": 1730398220.0,
      "score": 1
    },
    {
      "id": "lufbvbd",
      "body": "apparently people with adhd are very motivated by urgency. ironically, the last week of life, might be the best week of life for us because of it. its too bad there wasn’t a way to (no pun intended) surpass the deadline and keep living that way.",
      "created_utc": 1730240386.0,
      "score": 2
    },
    {
      "id": "lt8vzxh",
      "body": "The sad thing is I'm a counseling major, but I've never found therapy to do much.",
      "created_utc": 1729635282.0,
      "score": 8
    },
    {
      "id": "lt924j7",
      "body": "I totally get that man. Like, I know it took me three tries to get a good one, but I know multiple people who had to go through like 10+ or just gave up because it's hard to find one you jive with. it was also a lack of motivation in me that made progress slow before the meds. I hope you keep looking though, man, it gets much better when you find you're therapist.",
      "created_utc": 1729637413.0,
      "score": 6
    }
  ]
}