{
  "id": "1jc95rn",
  "title": "If i had a gun i would shoot myself right now",
  "selftext": "I did nothing else but cry the whole day. My heart is so heavy. I tried to find ways to hang myself this morning but even for that im to tired. I wish i just had a gun and could end everything quickly. Im so sensitive i cant take anyone hurting me anymore. My birthday is in 10 days and i think im gonna go before it. I would turn 15, but who even cares. I dont want any people saying „ur to young to die, its just your hormones“, „your still so young you dont know life“ i genuinely dont care, im giving up. Everyone disappointed me, even myself. In my past, i was raped and used. Now, people steal from me, still emotionally use me, nobody was ever true to me. Im embarrassed on how i turned out. I hate myself so much im the biggest disappointment someone could ever have, i wouldnt wish on anyone to have a daughter, or friend like me. ",
  "created_utc": 1742084462.0,
  "score": 479,
  "num_comments": 77,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1jc95rn/if_i_had_a_gun_i_would_shoot_myself_right_now/",
  "comments": [
    {
      "id": "mi0qdtk",
      "body": "Same buddy",
      "created_utc": 1742089375.0,
      "score": 27
    },
    {
      "id": "mi0m1u3",
      "body": "I'm glad you don't and that you are here. I'm new to this space and it's great to cross paths with you. Life sure can be heavy.",
      "created_utc": 1742087778.0,
      "score": 36
    },
    {
      "id": "mi1a861",
      "body": "Happy early birthday. I'm sorry that you are going through a lot right now. Please try to take care of yourself right now, and just give yourself a break.",
      "created_utc": 1742097293.0,
      "score": 14
    },
    {
      "id": "mi0eu0j",
      "body": "brutaaaaal , too bad we didin;t have to choose to be born or not to be",
      "created_utc": 1742085160.0,
      "score": 32
    },
    {
      "id": "mi1i655",
      "body": "same dude. same.",
      "created_utc": 1742100924.0,
      "score": 3
    },
    {
      "id": "mi2bftz",
      "body": "I’ve been suicidal for a long time now too. I get you, and I have felt the same desperation before. I still do. Several times this month I’ve thought about just finding a way to off myself on impulse.\n\nI won’t tell you not to do it. It doesn’t sound like you’re in a place where that’d be appreciated, and I understand. But you do deserve better. What we get doesn’t always equate to what we deserve, and I’ve learned that the hard way, but I mean it no less. You deserve to have people in your life that make you feel loved. Sending you my kindest regards, no matter what you decide to do or not do. I hope things get better. I’m sorry they’re not good right now.",
      "created_utc": 1742118501.0,
      "score": 3
    },
    {
      "id": "mi2d9mp",
      "body": "Same here buddy",
      "created_utc": 1742119666.0,
      "score": 3
    },
    {
      "id": "mi3c2k6",
      "body": "You sound EXACTLY like me when I was 14.  Even my own mom stole everything she could.  What wasn't of much value she would break in front of me, trash, or give away.  I'm in my 40s now and I wish I could say things have gotten better.  But I hang on, and don't ask me why (well, I do know one reason, the only reason perhaps, is that I wouldn't want my little brother to be sad).  But thats the very reason I don't keep guns in my home, they're too instant, take no time to think its just bam, and yer done.  With a rope or blade for example (both terrible ways to go btw, and even a gun might not get the job done right away or worse, leave you paralyzed to the point you cant even off yourself, just think of the physical pain), it takes time to prepare.  By the time its all set up you could change your mind but not with a gun.  Bam, and its over.  I often regret not having one but not when I look at the big picture.\n\nI do want to say this though (and btw they say I was raped when I was 4, I don't remember it but I wonder if this has to do with the horrible dreams I've had my entire life), I don't cry all day every day like I used to.  I lift weights like a madman.  I work out more than anyone at that gym.  I have definitely improved over the years even though I am still a mess.  I keep trying to remind myself that it IS possible to get better, and it happens so slowly I almost don't even notice it.  But I gotta say this, and I wouldn't be saying this if it wasn't for your age:  One thing that I really don't like about this world is the system itself.  It seems to me if you don't have it all down by the time ur out of highschool, you are phucked for life.  I didn't want to play their stupid game (I still think its stupid tbh) and boy did I hate school, HATED it.  When I tried I got straight As, but eventually dropped out and ran away (I did have a terrible household/family btw but I should've tried to ignore that, because there WAS a way out at that time and it wasn't suicide).  Not keeping those As (or at least decent grades) is probably the biggest regret I have today, especially after studying chemistry on my own for several years.  Its really the only thing I ever loved (and when I say love, I mean it.  When I first started I remember thinking about how cool it would be to be able to make anything I wanted, and it became more than that even).  I wish I had known that now, that there was actually something there I could've actually liked, but I let myself get distracted by others' bullsh|t, and that is all on me now.  I DID go to \"college\", and I did get straight A's the whole time, but it turned out to be an \"unaccredited school\" (\"University\" of Phoenix) something I can't believe is even legal.  And they STILL want their student loans paid back.  Anyway, I know this comment is getting really long and I could make it much longer, but let me just get to the point already, and I'm sure you've heard this before.  Even if you hate it like I did, do your best in school.  Maybe go to your school counselor and explain what ur going through (depression and everything, and its up to you whether you want to bring up the gun and all that but if you do they may put you in a psychiatric hospital involuntarily, possibly even search your room at home for weapons (or ask your parent/guardian to search it).  Psychiatric hospitals you may want to stay out of (they only made my life more miserable, but thats just me), BUT maybe I shouldn't say that because sometimes, they do help people (but even if I DID get a PhD in chemistry, is anyone really gonna want someone thats been in an asylum in their lab around so many hazardous compounds?).  Some say the meds they give do help I'm just saying they never seemed to help me is all, but more importantly (in my opinion at least) tell them that despite all this, you want a new path, a chance to get the best grades you possibly can.  As far as the other stuff, you can make the solutions rather simple believe it or not:  If someone steals from you, don't allow them into your home or near you at all.  They aren't your friends anyway and don't care about you.  If someone lies to you, stop talking to them.  Hell you could actually ignore everyone if you choose, those grades are what is important believe it or not.   They are are gonna be the main thing that determines how much life is going to suck later (I'm talkin possibly 90 more years here).  Not to mention your life can be better than those other people later in life BECAUSE your grades were better in the past.  People often say \"its never too late\", but in your case, that is true.  It's not true for everyone, in fact people often say it to make someone else feel better but I mean it when I say it to you.  I hope you take this advice.  \n\nAnd btw, if you ever wanted to message me ur welcome to anytime of the day (I am often up late-nights too) you can.  And not just if you \"need someone to talk to\", but about anything.   Like say someone is bothering you and ur not sure what to do or say, just message me.  Sorry this comment is so long btw, I wish you eventual happiness and peace.   I hope you master a science (I say science because to me a lot of school in my opinion is a waste of time and just training really, but if you play this game well now, all the other games later in life won't suck as hard, or might even be something you like) or something cool, thats what I really hope for you.  Good luck friend, to the moon.  \n\nEdit:  I just found a new subreddit the other day, its my new favorite sub and I'm wondering if it would help you like it has me:  r/raisedbynarcissists  It is FULL of people that have been badly mistreated, I don't feel so alone since I found it.",
      "created_utc": 1742135488.0,
      "score": 3
    },
    {
      "id": "mi6jnwm",
      "body": "I was just looking into the process of buying one to off myself.",
      "created_utc": 1742171282.0,
      "score": 3
    },
    {
      "id": "mi1a0p2",
      "body": "Bro, you just need to vent your emotions with someone, you need to see hope, just think about the future , Who knows what it holds for you",
      "created_utc": 1742097200.0,
      "score": 2
    },
    {
      "id": "mi0e1jl",
      "body": "honey ik how you are feeling. and i know it hurts so bad. and it sounds so cliche to say it will get better, but it genuinely will. life will always have ups and downs and yours might be stronger than the average person, but the bad feelings won’t last and the good will shine through again. do you have anyone to talk to? a friend or family member or school counsellor? please please stay a little longer, please stay for your birthday okay even if it feels like nobody cares i do. ik im a stranger but i genuinely care and it breaks my heart that you are struggling. stay one more day bby",
      "created_utc": 1742084882.0,
      "score": 6
    },
    {
      "id": "mi0s9tt",
      "body": "It is best to talk with someone about what you're dealing with. Committing harm to oneself is not the answer.",
      "created_utc": 1742090071.0,
      "score": 2
    },
    {
      "id": "mi3v0u8",
      "body": "Hang in there. You don't have to live for anyone else but yourself. There will be days where you feel down, you will feel the weight on your shoulders. You will feel the World crashing down. But understand that those are just \"feelings\" that can come and go. Let the worst of days pass you right by. Live to see another day. You are good enough. You are worthy. You are the best. No one can take that away from you. I was once in the same position you are now. I have anger problems, but I'm the nicest guy you will ever meet. People resent me because I would lash out. I don't just lash out, I do it in self defense. For the longest, I have been ignored and abused. People don't understand me, they hate that I'm not easily manipulated. My confidence is unshakeable. My mind as cold as ice now. Please know that you are not alone.",
      "created_utc": 1742141430.0,
      "score": 1
    },
    {
      "id": "mi4kfne",
      "body": "I'm 31, same things happened to me but much worse. Am i fine now, definitely NO. So why am I holding up, cruz i have survived a suicide attempt and that was the ugliest phase of my life. \n\nJust hold in der. Wait till it turns bearable to continue. Its definitely gonna leave a hole in your heart thats never gonna be filled. But trust me, ul learn to live with that. \n\nWe r the sensitive lot, that's finding it hard to survive in this insensitive world.",
      "created_utc": 1742148980.0,
      "score": 1
    },
    {
      "id": "mi5elen",
      "body": "Iam glad someone like me at least cried",
      "created_utc": 1742157959.0,
      "score": 1
    },
    {
      "id": "miirerd",
      "body": "Sam'e but that's quite harsh way",
      "created_utc": 1742337513.0,
      "score": 1
    },
    {
      "id": "mimxdnm",
      "body": "I’ve said the same thing! Sorry you’re in this too.",
      "created_utc": 1742399480.0,
      "score": 1
    },
    {
      "id": "misqeru",
      "body": "dude, if your 14 you still have like 60 years or so ahead of you, things can always turn around jus sayin, there;re so many bueatiful things in lie to end urself this early ykyk",
      "created_utc": 1742479799.0,
      "score": 1
    },
    {
      "id": "mj3sk6u",
      "body": "me too. hang in there",
      "created_utc": 1742622572.0,
      "score": 1
    },
    {
      "id": "mj481a3",
      "body": "Dont know your situation but if someone who's taking care of you is responsible time to go to the authorities and get yourself away from them. Tell someone dont carry the shame like I did for 35 years. It will eat at you until you realize that it wasn't you fault and that it wasn't something wrong with you its them.  You are 15 life hasn't even started you haven't even reached an age that you can even say you tried or failed. Authorities can help, sometimes the systems fails but better to roll the dice then stay in an unsafe place.",
      "created_utc": 1742632546.0,
      "score": 1
    },
    {
      "id": "mj9i4oe",
      "body": "I'll take your place, i know you're worth something",
      "created_utc": 1742705118.0,
      "score": 1
    },
    {
      "id": "mjaiu71",
      "body": "based on the timing of this post, i’m assuming your birthday is now in 2-3 days. first, happy early birthday!! \nsecond, i am so sorry that you are hurting like this right now. i’ve been in that place before and it’s awful. i didn’t think i’d even make it to the end of my 8th grade year and reach my 14th birthday, but i just passed the 5 year anniversary of my lowest point when i had to be hospitalized. i can hardly believe that i’m still here, so much longer than i thought i would be, but most days, i’m glad for it.\ni won’t say that it gets better. in some ways it might, but you’ll probably still feel like shit a lot of the time. but the point is that if you can just last one more day, life keeps going. every day that you stay alive is a hard won accomplishment. there are ups and downs, but if you fight through the lows, you’re going to also experience good moments that you’ll never have the chance to experience if you end things now.\nsometimes looking at the big picture is helpful, but when i’ve been at my lowest, it can also be completely overwhelming. my #1 recommendation is to focus on small goals, even if they might seem insignificant to other people. maybe you don’t know if you can make it through another week, but fight to make it one more day. if it’s a thursday, you might as well stick around to experience one more weekend. sometimes trying to keep going for just one more day and then maybe one more day after that feels more manageable than trying to make it for one more year. i’ve spent a lot of the past several years thinking of things in terms of singular days, but it adds up. it’s been hard and there’s been plenty of times when i’ve wanted to off myself since then, but somehow, by fighting to keep going for “just one more day” i’ve made it 5 years longer than 13 year old me ever imagined i would.\nhowever many days it is until your birthday, try to make it at least that much longer. you’ve survived so many days before, so maybe you can make it 2 or 3 more days. and then maybe a few more days after that, and after that. chances are, you are stronger than you think. it hurts so badly sometimes, but you’ve made it this far. try to make it a little longer because you deserve to see at least one more day and things aren’t all bad. little moments of good will eventually come, but if you end things now, you’ll lose any chance of experiencing good things in the future.\nit hurts right now but it won’t always. know that you’re not alone even when it feels like it. there are so many people who understand what you’re going through and who know how much strength it takes to still be here. i really hope you stick around, at least a little longer. i believe in you and maybe you will eventually, too. know that a random stranger on the internet (a lot of strangers, really) wants things to get better for you and are wishing you a happy birthday :)",
      "created_utc": 1742727534.0,
      "score": 1
    },
    {
      "id": "mjd4j4y",
      "body": "At least you can cry. I can’t even feel emotion. Hang in there",
      "created_utc": 1742760312.0,
      "score": 1
    },
    {
      "id": "mi1090a",
      "body": "[removed]",
      "created_utc": 1742093118.0,
      "score": -11
    },
    {
      "id": "mi0uwx5",
      "body": "Well.....Don't do that\nI tried to be funny but also serious😐",
      "created_utc": 1742091067.0,
      "score": -10
    },
    {
      "id": "mieh4rn",
      "body": "U don't know this person. R u also happy that 8 billion other people are here? Such a stupid thing to say.",
      "created_utc": 1742283795.0,
      "score": 3
    },
    {
      "id": "mi3ijci",
      "body": "Oh yeah, happy early birthday from me as well.  Maybe give yourself the greatest birthday present ever by putting it all behind you.  I know, easier said than done but you say noone cares, but look at these commenters.  There ARE good people out there, and this is a reminder for me as well.  These people don't even know you yet took the time to try and cheer you up.  And if you hang in thereyou will eventually get to meet people just like this.",
      "created_utc": 1742137584.0,
      "score": 5
    },
    {
      "id": "miyxduk",
      "body": "Thats why I will no have any baby.",
      "created_utc": 1742563431.0,
      "score": 1
    },
    {
      "id": "mi1081r",
      "body": "[removed]",
      "created_utc": 1742093107.0,
      "score": -55
    },
    {
      "id": "mi0ec6c",
      "body": "I dont have anyone to talk to atm but i really appreciate your words. I hope it gets better for you too",
      "created_utc": 1742084986.0,
      "score": 14
    },
    {
      "id": "mifwmd5",
      "body": "Sorry for that. I'm happy that people who are on this app and reaching out are here. You can't reach or help or encourage everyone but I try to touch as far as my arms can reach. again so sorry if I said the wrong thing.",
      "created_utc": 1742307991.0,
      "score": 6
    },
    {
      "id": "mj3rkmn",
      "body": "YOUR reply is stupid and very unnecessary. you’re being rude to this person and all they’re doing is trying to help. what’s your problem?",
      "created_utc": 1742621993.0,
      "score": 4
    },
    {
      "id": "mi4ij9d",
      "body": "Thank you... and yes, people do care about you. Just take life one day at a time... and try to relax. Everything will work itself out. I hope you have a good day my friend.",
      "created_utc": 1742148417.0,
      "score": 2
    },
    {
      "id": "mi1w7qe",
      "body": "So what's wrong with being gay",
      "created_utc": 1742108668.0,
      "score": 18
    },
    {
      "id": "mi3hlss",
      "body": "I'm asking out of curiosity not to judge, but why of all places did you decide to say that?  I understand ur a South Park fan and so am I, but do you realize this sub is full of people right on that edge?  I mean I believe in free speech and everything but I'm asking out of curiosity.",
      "created_utc": 1742137287.0,
      "score": 7
    },
    {
      "id": "mi24ehh",
      "body": "Fuck off",
      "created_utc": 1742113903.0,
      "score": 10
    },
    {
      "id": "mi1jota",
      "body": "Why do people say to appreciate life when it's difficult to appreciate it because of all the things people go through",
      "created_utc": 1742101674.0,
      "score": 3
    },
    {
      "id": "mih23xd",
      "body": "I don't think you've said the wrong thing, imo. Nothing wrong with wanting to say kind words to someone, especially a person who's struggling with suicidal ideation. And it's not even about making yourself feel good but being a decent human being.",
      "created_utc": 1742319984.0,
      "score": 10
    },
    {
      "id": "mj74gwq",
      "body": "Because it's not always a downward slope. I am 32. I wanted to end my life in February, less than a week before my birthday. Because I was so full of self-hate and not feeling like things would ever change. I'm glad I didn't go through with it though because since then, I've had so many moments I am grateful for - ones I wouldn't have seen if I had ended things. I have a young child too, so knowing how that would impact them and never getting to see them grow weighs on me as well.\n\nIt's hard to see anything worth living for if you're constantly in the midst of shitty situations - like an abusive home environment, etc. A lot of folks encourage people to make it a goal to get out of there as soon as they can - even if that's surviving until adulthood until they can get out - or leaving as teens. \n\nThere are downs in life but there are ups. If we choose out, we may never get the opportunity to see or create an up. You don't have to be grateful for what you endure - like abuse or anything - but you may find appreciation for life at a point when things are finally calm and looking up, when there are experiences you didn't think would ever happen that are good. \n\nI hope that any youth who are dealing with bad stuff at home are able to get out of there asap. Talking with a counselor or someone at school is important, especially if it's abuse. Eventually (or if possible, sooner), therapy is useful. \n\nMy sibling and I experienced abuse and death threats as children, and were constantly exposed to dangerous situations - like a parent shooting up or smoking drugs, etc. We got lucky with a good foster family that we went to. Therapy felt repetitive and was kind of unwanted in youth, but it would have actually helped me a lot in my 20s, as there was (and still is) so much to heal from and work through, especially with entering relationships (where childhood relationship dynamics resurface), and if one eventually has a kid(s).\n\nLife isn't perfect and it can often suck ass. You don't have to appreciate life or be grateful for it, but I hope you and everyone here one day has the opportunity to see a better side of things and be glad they stuck around to find something worth living for.",
      "created_utc": 1742673427.0,
      "score": 1
    },
    {
      "id": "mj7wptt",
      "body": "You can still appreciate things in life even if u r depressed. For example, if my friend invites me to the beach and takes me there, I will appreciate it and be grateful. But deep down inside , I still feel horrible",
      "created_utc": 1742682820.0,
      "score": 1
    },
    {
      "id": "mokcmvy",
      "body": "I hear you",
      "created_utc": 1745388010.0,
      "score": 2
    }
  ]
}