{
  "id": "1gfgcu0",
  "title": "Killing myself tonight. ",
  "selftext": "I loaded a .308 rifle with 3 rounds. Already wrote a note. Planning on going out in the woods and shooting myself twice in the chest and once in the head, should be enough to end it without the possibility of surviving. \n\nI remember being a kid full of hopes and dreams, going outside to play with a stick and pretending to be an astronaut while swinging on a vine. Never would have thought it would get to this point. \n\nDisowned from my entire family due to my lack of religious belief, no friends, no partner, no job, no hobbies, nothing. There is no point in life, there is no reason to continue when you’ve lost before you ever began. \n\nIt’s almost comedic how tragic and catastrophic my life has been. Well, goodbye Reddit. People on Reddit were nicer to me than anyone in my real life was. ",
  "created_utc": 1730270321.0,
  "score": 705,
  "num_comments": 155,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1gfgcu0/killing_myself_tonight/",
  "comments": [
    {
      "id": "lui1lgs",
      "body": "Why not just move to a new place? Legitimately, take everything and leave without a trace.\n\nYou’d essentially be killing that social perception of yourself without actually ending it for good.\n\nI know people who lived in the South and ran away at 15. Some of those people are now 23 with a college degree working in the suburbs up in Michigan. It’s not over for you as a person, even if you believe that the place you currently are at is a dead end.",
      "created_utc": 1730285380.0,
      "score": 298
    },
    {
      "id": "lui2o4m",
      "body": "if you’re still around and decided not to do it, please say something. and i’m so sorry i didnt see this in time. im so sorry someone didn’t find you and help you beforehand. ",
      "created_utc": 1730285946.0,
      "score": 46
    },
    {
      "id": "lui6jfc",
      "body": "i,ve tried 3 times but then i moved to a new place then fakes my address.never feel better than that",
      "created_utc": 1730287893.0,
      "score": 52
    },
    {
      "id": "luhmjt1",
      "body": "I wish I could have known you outside of Reddit. I am also not religious. Life can be insufferable but so many of us are online...but we're real people. Like you, we need each other. \n\nIt's people like you, who understand how fucked up life can be, that make the best of friends. \n\nThe world needs people like you. Please don't leave us here to deal with life without you.",
      "created_utc": 1730275712.0,
      "score": 48
    },
    {
      "id": "luhr6w9",
      "body": "Don't judge yourself by stupid society standards... I hate society in general with its stupid rules, but not all people, some are awesome. You are not what people think of you, man!!! You are just a human, as we all are!!! Really hoping it gets better for you!!!",
      "created_utc": 1730278972.0,
      "score": 42
    },
    {
      "id": "lum04jr",
      "body": "I highly doubt you will make it to your head after a chest shot with a 308 round.   Be incapacitated.   Be a very painful death.   \n\nPlease don't do it.   Stick around you never know what tomorrow will bring.",
      "created_utc": 1730331454.0,
      "score": 19
    },
    {
      "id": "lv47fsb",
      "body": "Goodnight, @Orion43410. I hope you find solace in your eternal sleep.",
      "created_utc": 1730599476.0,
      "score": 10
    },
    {
      "id": "lujabcs",
      "body": "Are you still here?",
      "created_utc": 1730301905.0,
      "score": 9
    },
    {
      "id": "luhex5q",
      "body": "Aye man you left a note so that means there's people you actually care about think about them",
      "created_utc": 1730270441.0,
      "score": 52
    },
    {
      "id": "lulntqv",
      "body": "Baby if you are there i beg u Just wait.\nThe day After a long night Is gonna be shiny, theres Always Hope.\nCant Rain fover",
      "created_utc": 1730327343.0,
      "score": 8
    },
    {
      "id": "lukdsuc",
      "body": "Aye bro you still here right?",
      "created_utc": 1730313580.0,
      "score": 8
    },
    {
      "id": "lukamtt",
      "body": "This person is more than likely dead now.",
      "created_utc": 1730312649.0,
      "score": 12
    },
    {
      "id": "luhxkda",
      "body": "i’m so sorry i hope you’re still here",
      "created_utc": 1730283110.0,
      "score": 16
    },
    {
      "id": "luia4yc",
      "body": "I'm wondering, if you've reached the true bottom of life, don't you feel at least a little bit free to do whatever you want? You can go an live a hedonistic lifestyle, move somewhere new, basically act and do whatever tf you want since you can exit anytime you want, you no longer have to fear rejection or not meeting expectations of others, etc. You've got nothing to lose basically.",
      "created_utc": 1730289548.0,
      "score": 17
    },
    {
      "id": "luhqv4m",
      "body": "Chances of getting three shots off on yourself are slim .",
      "created_utc": 1730278747.0,
      "score": 37
    },
    {
      "id": "lujk4cu",
      "body": "Please respond, are you still here? You don’t need your immediate family’s acceptance to live. I promise. Get yourself a dog, move to a new city, start a new job and meet new people. You CAN do this.",
      "created_utc": 1730304860.0,
      "score": 5
    },
    {
      "id": "luo436n",
      "body": "I'm here to talk if you need anyone and still here. This goes to anyone. *hugs*",
      "created_utc": 1730366858.0,
      "score": 4
    },
    {
      "id": "lukn8fo",
      "body": "I feel you 100%...you still here with us bro????",
      "created_utc": 1730316377.0,
      "score": 4
    },
    {
      "id": "lukunf3",
      "body": "I hope you are still here.",
      "created_utc": 1730318556.0,
      "score": 5
    },
    {
      "id": "lunbdw9",
      "body": "If you’re still with us, please check in?  We’re not strangers. We’re not blood, true, but blood are often the most toxic relationships we will ever have. Over religion or for whatever reason, you are one of millions, in good company, that had to go no contact. It’s not right, it’s not fair, but it’s not you. You feel everything so deeply and you should, things that matter, higher things.  But not this, not like this.  You are not alone. ❤️",
      "created_utc": 1730348454.0,
      "score": 5
    },
    {
      "id": "lv4at1y",
      "body": "Did he do it?",
      "created_utc": 1730600769.0,
      "score": 4
    },
    {
      "id": "lulkboh",
      "body": "Is there a hospital 🏥 you can walk into and self submit? Sometimes that what we have to do to get in the system for full on support so we can be seen and heard . Through this you can get assistance with jobs , friendships, therapy , assistance living and more . It’s hard now but hopefully 🤞🏼 you’ll get through . I’ve been there and still have my days . We get better ❤️‍🩹 as we learn other coping mechanisms",
      "created_utc": 1730326204.0,
      "score": 6
    },
    {
      "id": "luiypio",
      "body": "Please don’t ! If you are alive - I’m glad! Please please!!\nI lost my daughter. I’ll be listening 🙏",
      "created_utc": 1730298366.0,
      "score": 8
    },
    {
      "id": "luiaccw",
      "body": "You deserve way better. Honestly I understand. But I truly hope you're still here.",
      "created_utc": 1730289638.0,
      "score": 3
    },
    {
      "id": "lul4vuz",
      "body": "Please dont.",
      "created_utc": 1730321489.0,
      "score": 3
    },
    {
      "id": "lulyons",
      "body": "How many different antidepressants have you tried?",
      "created_utc": 1730330972.0,
      "score": 3
    },
    {
      "id": "lumoaq7",
      "body": "Please don’t",
      "created_utc": 1730339586.0,
      "score": 3
    },
    {
      "id": "lune3vr",
      "body": "Still with us?",
      "created_utc": 1730349778.0,
      "score": 3
    },
    {
      "id": "lunq9w7",
      "body": "I hope you’re still here ticking along with the rest of us. Yes. Things seemed hopeful and bright and wide open when we were kids and then the constraints of reality encroach but it doesn’t mean there isn’t a point. There is. Live. Love. Get out there and show the world you’re here for those two reasons. I too lost before I began but I swing at it every single day to show those who turned away from me that they hold no power over my life. If I died because they ostracized me and left me for dead then I am showing them they win. They had enough influence or power to hurt me to death. Nope. They can eat it.",
      "created_utc": 1730357096.0,
      "score": 3
    },
    {
      "id": "luidj77",
      "body": "I hope you're still here, the world is shit, but there are bits that make life worth it, I second the other guy that said about moving away, that fresh start is so much better than you think it is",
      "created_utc": 1730290982.0,
      "score": 2
    },
    {
      "id": "luigskn",
      "body": "I hope you didn’t go through with it. Cash out and move someon where new and start over. The worlds huge there’s more life out there for you to live",
      "created_utc": 1730292282.0,
      "score": 2
    },
    {
      "id": "lujigqj",
      "body": "Dude i also want to do that but i don't have the material. Im always joking with my mother and little brother that i suffer so hard that i want to die. It isn't a joke and ik bet they know it. Only the step of being alive to being dead is huge. Think about it. You literally need to make yourself dead. It isn't natural by all sense",
      "created_utc": 1730304350.0,
      "score": 2
    },
    {
      "id": "lukfmz6",
      "body": "What religion? Why not sue them",
      "created_utc": 1730314116.0,
      "score": 2
    },
    {
      "id": "lukn695",
      "body": "If you're still here I'll share my list of places I'd go start over if I wasn't tied to my location. Sometimes when you see all the places you could be, being seems less awful",
      "created_utc": 1730316359.0,
      "score": 2
    },
    {
      "id": "lul6dcm",
      "body": "Op are you still here. I wanted to kms but I got through it",
      "created_utc": 1730321926.0,
      "score": 2
    },
    {
      "id": "lunbl4j",
      "body": "I hope you are still around to see this, and I really hope you stay on this side of life and feel better.",
      "created_utc": 1730348549.0,
      "score": 2
    },
    {
      "id": "lupcf2i",
      "body": "Are you okay?",
      "created_utc": 1730386075.0,
      "score": 2
    },
    {
      "id": "lurteta",
      "body": "Don't do it! Please don't!",
      "created_utc": 1730414944.0,
      "score": 2
    },
    {
      "id": "lv5fi2o",
      "body": "One of the hardest things for us to accept is that some of us can be in a situation where this is rationally the best option. ",
      "created_utc": 1730622917.0,
      "score": 2
    },
    {
      "id": "ly07h8t",
      "body": "Are you still with us??........ We're hoping....",
      "created_utc": 1732055968.0,
      "score": 2
    },
    {
      "id": "lyp62cw",
      "body": "Still here buddy?",
      "created_utc": 1732426644.0,
      "score": 2
    },
    {
      "id": "lui35nc",
      "body": "You deserve a better family. If you decide to live you can start building a new one.",
      "created_utc": 1730286201.0,
      "score": 3
    },
    {
      "id": "lui4eta",
      "body": "Poor baby :( I’m sorry.",
      "created_utc": 1730286846.0,
      "score": 3
    },
    {
      "id": "luifb9f",
      "body": "Brother are you there?",
      "created_utc": 1730291698.0,
      "score": 3
    },
    {
      "id": "luii3xf",
      "body": "New place, new people! That would help you to get socialised again. Hit some apps to meet people!\n\nIt is not over, just hard arm.",
      "created_utc": 1730292784.0,
      "score": 4
    },
    {
      "id": "luily8x",
      "body": "How about you go have coffee tonight instead? Just one more day.",
      "created_utc": 1730294182.0,
      "score": 3
    },
    {
      "id": "luliwq0",
      "body": "You know I don’t want to you to die but everything you said is how I feel all the fucking time and I’m honestly right there with you I just don’t think I have the guts to do it my self I’d probably go by cop",
      "created_utc": 1730325751.0,
      "score": 3
    },
    {
      "id": "luk5o0s",
      "body": "So why not fucking skip town??? If you're really this set on it, and your family is really making life that shit, leave. Call some ski resorts and ask for winter work with housing, take an Amtrak to the nearest city with a shelter and get looking. Do you want to stop living entirely or do you just want a life where you can decide how to live it?",
      "created_utc": 1730311191.0,
      "score": 2
    },
    {
      "id": "lulm9a6",
      "body": "Hope you here bro",
      "created_utc": 1730326827.0,
      "score": 2
    },
    {
      "id": "lulrtto",
      "body": "Are you still with us?",
      "created_utc": 1730328674.0,
      "score": 2
    },
    {
      "id": "luldmxy",
      "body": "Don’t do it man. Love will find you.  Even in the dark.",
      "created_utc": 1730324118.0,
      "score": 1
    },
    {
      "id": "luljbox",
      "body": "Please dont. Please dont do this 🙏🏻❤️people out there love you, you just need to find the right ones. Move somewhere else. Start again. A fresh start a blank page. It helps. You got this, don’t give up❤️🙏🏻",
      "created_utc": 1730325882.0,
      "score": 1
    },
    {
      "id": "lulp43l",
      "body": "Why not do something crazy instead like moving to a comply differently country , you never know , your dreams may still be possible",
      "created_utc": 1730327773.0,
      "score": 1
    },
    {
      "id": "lump35q",
      "body": "i hope that you’re still here, i’m so sorry that life hasn’t treated you the best but please, killing yourself isn’t worth it. you deserve nothing but love and happiness and i’m sorry that you haven’t experienced that. please know that you’re not alone and that you deserve the world. if you are still here with us, please let us know. much love my friend",
      "created_utc": 1730339854.0,
      "score": 1
    },
    {
      "id": "luni8d1",
      "body": "Hey Orion im in the same boat",
      "created_utc": 1730351995.0,
      "score": 1
    },
    {
      "id": "lut4d4l",
      "body": "I wish you well in your travels friend",
      "created_utc": 1730433686.0,
      "score": 1
    },
    {
      "id": "lvdnkln",
      "body": "Can you do something that might make you feel better like volunteering to walk dogs at an animal shelter or something?",
      "created_utc": 1730741465.0,
      "score": 1
    },
    {
      "id": "lwnwd7z",
      "body": "Dude in such a better superior place now and im not even considering heaven",
      "created_utc": 1731367780.0,
      "score": 1
    },
    {
      "id": "m2n6r5f",
      "body": "Is he gone?\nIt's been a month",
      "created_utc": 1734521546.0,
      "score": 1
    },
    {
      "id": "luhzoxv",
      "body": "I understand that you must feel empty, but all those things that you mentioned that you don't have like friends or a partner, I'm sure that you will get them in the future if you keep fighting 😿 You can join a support group, there you can meet people, I hope you can find a job and access therapy, don't give up buddy",
      "created_utc": 1730284337.0,
      "score": 1
    },
    {
      "id": "lui3mxx",
      "body": "Please don’t do it",
      "created_utc": 1730286453.0,
      "score": 1
    },
    {
      "id": "luk6amh",
      "body": "I want to mourn you, it is sad to see a human being full of hope deciding to end his life, yes sometime a long chapter of life is suffering but not all of it, change where you live be hobo but don’t unalive yourself…\nSometime life is hard asf but not to this level i believe.\nPlease consider that there is some reason to stay alive",
      "created_utc": 1730311374.0,
      "score": 1
    },
    {
      "id": "lulazw1",
      "body": "please don't",
      "created_utc": 1730323316.0,
      "score": 1
    },
    {
      "id": "lum2ryc",
      "body": "OP are you still here? I hope so.",
      "created_utc": 1730332342.0,
      "score": 1
    },
    {
      "id": "luk8wn2",
      "body": "[removed]",
      "created_utc": 1730312144.0,
      "score": 0
    },
    {
      "id": "lui01of",
      "body": "You will be a loving father with a cute family, just wait and fight for it, remember all your dreams, depression has cure, if meds don't work there is also electroconvulsive therapy and it works! It's used on bipolar people, schizo, and resistant depression ",
      "created_utc": 1730284535.0,
      "score": -12
    },
    {
      "id": "luki4e4",
      "body": "See you tomorrow bro.",
      "created_utc": 1730314845.0,
      "score": -13
    },
    {
      "id": "luiy30w",
      "body": "[deleted]",
      "created_utc": 1730298171.0,
      "score": -4
    },
    {
      "id": "lujbkw4",
      "body": "It never cease to amaze me how people think they gave it so bad when someone somewhere in 5his world is sitting there in a wheelchair w no legs or arms wo the ability to move their head just wishing they could have a somewhat decent life, like basics just wishing to have arms and legs, then there's another poor soul somewhere starving to death bc of extreme poverty, then what about the human that gets sx assaulted everyday by their own father/mother and nobody believes them, im not saying ur feelings are not valid they are and you don't deserve to feel like shit but cmon I guarantee you someone has it way worse, you atleast have the ability to change all these things you complain about! Find a hobby, it's not hard anything that feels good, get a job if you're not able to do these things bc of a mental thing get help, your life is short and it will not be this way forever, you make it what it is, I hope you really understand what I'm saying! Happiness is out there",
      "created_utc": 1730302285.0,
      "score": -38
    },
    {
      "id": "luk3wiz",
      "body": "This is a really nice comment. The less you have though, the more strength and effort it takes to successfully leave, and people have less and less nowadays.",
      "created_utc": 1730310684.0,
      "score": 68
    },
    {
      "id": "lul3d75",
      "body": "I did this at 35 no regerts 😄",
      "created_utc": 1730321042.0,
      "score": 18
    },
    {
      "id": "lun2dz1",
      "body": "You need money to move",
      "created_utc": 1730344705.0,
      "score": 5
    },
    {
      "id": "lui713f",
      "body": "not to make your situation looks better but once someone said to me when im suicidal.he knows someone who work at psychiatry hospital that was trafficked when he was kid and been abused physically, emotionally, been force drugged and rn see where he at.",
      "created_utc": 1730288130.0,
      "score": 13
    },
    {
      "id": "luhf0rj",
      "body": "No it’s a note telling my family to go fuck themselves. And an apology for the EMT/Paramedic for the mess.",
      "created_utc": 1730270507.0,
      "score": 154
    },
    {
      "id": "lunipmz",
      "body": "I agree, there will always be a way.\n\nBeing at the bottom means you could only climb up from there.\n\nGoodness, i hope he's still around here.\n\nThere are government jobs that are willing to teach even homeless how to do some blue collar jobs. It's decent and they can provide with food and shelter.\n\nLife is not over man... I wanna be positive but i can understand why OP is like this. World is a messed up place. I'm similar situation to him but i ain't giving up yet. Too damn soon OP.\n\nKeep fighting if you can read this guy above me and this comment. Keep standing up despite the hardships and adversities, keep going man.",
      "created_utc": 1730352277.0,
      "score": 2
    },
    {
      "id": "luio7u0",
      "body": "This.  I’ve always thought “I had nothing left to lose” when my life was going shit. So I decided to say fuck it and do whatever I can to live it since I had no one telling me what to do or no one I was putting up with anymore.",
      "created_utc": 1730294969.0,
      "score": 15
    },
    {
      "id": "luhwmw8",
      "body": "Gee, nice contribution",
      "created_utc": 1730282555.0,
      "score": -26
    },
    {
      "id": "lvkl5qe",
      "body": "i think so.",
      "created_utc": 1730834292.0,
      "score": 5
    },
    {
      "id": "lumyqzq",
      "body": "Those places dont help.",
      "created_utc": 1730343308.0,
      "score": 8
    },
    {
      "id": "luk0idd",
      "body": "So sorry for your loss 🩷",
      "created_utc": 1730309699.0,
      "score": 8
    },
    {
      "id": "mai396g",
      "body": "Please tell me you didn’t go though with that l, you have so much to live for and you sound so cool…. Life will get better please respond so Ik your okay and didn’t do it.",
      "created_utc": 1738471067.0,
      "score": 1
    },
    {
      "id": "luktn2c",
      "body": "don't",
      "created_utc": 1730318268.0,
      "score": 4
    },
    {
      "id": "lui0l25",
      "body": "A lot of people who ask for it sadly endlessly get denied the access like me for it.",
      "created_utc": 1730284832.0,
      "score": 2
    },
    {
      "id": "luiz9au",
      "body": "hmm, interesting, why be like this",
      "created_utc": 1730298537.0,
      "score": 1
    },
    {
      "id": "luklagx",
      "body": "i will put your comment on my wall",
      "created_utc": 1730315796.0,
      "score": 20
    },
    {
      "id": "lukljc6",
      "body": "I’ve been closer to his shoes than most people in my life these days know. It’s not impossible to get out\n\nAlso thank you for the appreciation",
      "created_utc": 1730315870.0,
      "score": 11
    },
    {
      "id": "lun2esw",
      "body": "How did you get money to move?",
      "created_utc": 1730344713.0,
      "score": 6
    },
    {
      "id": "luo2w4f",
      "body": "If you’re in the US, not sure if this is something you’d be interested in but check out “coolworks.com”. They have tons of seasonal jobs. Most of them provide housing. With the winter coming there’s a lot of ski resorts hiring. Anything from maintenance, instructors, kitchen, wait staff, or just anything in hospitality! People come from all over the world, all different ages. If you have the gas money to drive there, that’s pretty much all you need! Plus, there’s some pretty cool experiences that come along with it!",
      "created_utc": 1730366044.0,
      "score": 2
    },
    {
      "id": "luhf5tc",
      "body": "Ohh damn then we on the same page the day I check out I won't leave a note I can't be bothered",
      "created_utc": 1730270600.0,
      "score": 49
    },
    {
      "id": "mobdw07",
      "body": "I’m crying over a stranger I wish I could have said something better then.",
      "created_utc": 1745267325.0,
      "score": 1
    },
    {
      "id": "lunqftj",
      "body": "[deleted]",
      "created_utc": 1730357207.0,
      "score": 2
    },
    {
      "id": "lup6mwc",
      "body": "Why? I hate feeling this way. I can't seem to get better no matter what I try",
      "created_utc": 1730384183.0,
      "score": 1
    },
    {
      "id": "lui5d8w",
      "body": "I am not from the United States, but I know that you have many programs and opportunities for unemployed and mentally ill people. I think that the state also gives them medicine. Here in Latin America there is not so much help.The truth is that I have also thought about giving up many times, I feel inadequate for being autistic, last year at 26 years old I was able to make friends, I guess that gave me hope that things can get better.I have always felt like a failed and misunderstood alien, unable to see any achievement or good in myself. But sometimes I enjoy little things, like feeling the sun, watching birds or reading psychology books. I am also asexual, but I was able this year to have a partner, I didn't think anyone was going to accept me for being like that. Sometimes everything gets better and you just have to wait. ",
      "created_utc": 1730287322.0,
      "score": 2
    },
    {
      "id": "lun2s4u",
      "body": "I had savings I used but moving really doesn't cost a lot if u just take what u can fit in ur car. I either sold or donated all my furniture and even my PC, yearbooks, \"keepsakes\", etc. It's all crap that's really just weighs most ppl down",
      "created_utc": 1730344861.0,
      "score": 5
    },
    {
      "id": "luhf8d3",
      "body": "✌️",
      "created_utc": 1730270646.0,
      "score": 29
    },
    {
      "id": "lurc1b8",
      "body": "I tend to disagree. With how poor healthcare is, I tend to doubt it. \n\nSomeone gets taken in and cant work so they lose their job and cant pay their bills.\n\nDoctor slap them on meds and say good luck!\n\nSo many have complained of how poor the mental health hotlines are.\n\nAlso, mental health is becoming more and more rejected by insurance and therapists dont take it because it doesnt pay.\n\nIt is a luxury to afford proper care.",
      "created_utc": 1730408695.0,
      "score": 1
    },
    {
      "id": "lui7mpu",
      "body": "I am not from USA either, but from Poland. To get any electroconvulsive therapy for depression you basically have to be like a vegetable in a catatonic state.\n\nAnd how about things being bad like they were already years ago and only getting worse from that point on like it is in my specific case? How did you get friends as an autistic person? I'm definitely on the spectrum too and I'm alone",
      "created_utc": 1730288413.0,
      "score": 2
    },
    {
      "id": "lun4ggr",
      "body": "Yeah but you gotta have money for that first month of rent and however long it takes to find a job. I have about 800 dollars rn",
      "created_utc": 1730345532.0,
      "score": 2
    },
    {
      "id": "lurcg26",
      "body": "I totally get what you are saying but compared to other options what else is there but to try 🤷🏽‍♀️",
      "created_utc": 1730408833.0,
      "score": 1
    },
    {
      "id": "lun64vq",
      "body": "I rented a room on an air bnb for $700/month, became cool with the lady who owned the house who lived there too and stayed for 6 months eventually getting a cheap studio after I had my job for a bit. I think I had about 3k at the time when I first got there. 800 is a good start, if we're to do it again I wouldn't go anywhere without 5k in case u have car troubles or whatever else go wrong. Depending on the situation or how desperate/motivated someone is living in ur car can absolutely help, I did it for months, different lifestyle for sure but got me out of a shit situation back home",
      "created_utc": 1730346213.0,
      "score": 2
    },
    {
      "id": "lurcuoh",
      "body": "I think sometimes we have to let people do what they feel is best for them and their life, and respect that.\n\nNot advocating for anything, just trying to sympathize. I wish I had an answer, as so many do.",
      "created_utc": 1730408970.0,
      "score": 3
    },
    {
      "id": "lun98bt",
      "body": "I can’t get 5k. My deadline to move out is the end of the year. I had a big payment that set me behind but I should have close to 3k by January",
      "created_utc": 1730347486.0,
      "score": 4
    },
    {
      "id": "lun9b93",
      "body": "I make 500 a week rn but I can’t save it all",
      "created_utc": 1730347521.0,
      "score": 2
    },
    {
      "id": "lurdbz3",
      "body": "Same wish we had better options and care",
      "created_utc": 1730409135.0,
      "score": 2
    },
    {
      "id": "lund19l",
      "body": "You'll be ok, might have to think outside the box and make some calls but a lot is doable with 3k",
      "created_utc": 1730349243.0,
      "score": 1
    },
    {
      "id": "lunexnf",
      "body": "Try the trusted house sitter thing.. people let you stay at their homes for free if you agree to care for their pets while they’re away. If I wasn’t tied down I’d definitely just do that and Instawork and travel all over.",
      "created_utc": 1730350202.0,
      "score": 1
    }
  ]
}