{
  "id": "1jn4fr7",
  "title": "my wife killed herself 3 weeks ago, i want to join her so fucking bad",
  "selftext": "The first 2 weeks were manageable only because I know I had to make sure she was taken care of and cremated after her service, she was always so impatient and wanted things to be taken care of quickly so I felt it was right I handled everything as quick and as best as possible for her. \n\nNow that everything has been handled for her, this week has been so fucking hard for me and I can not stop thinking about taking my own life to be back with her. I miss her so fucking much, shes my soulmate and I love her so fucking much, I lost myself the day she left me. I dont want this to be my “new normal”, I dont want to keep going without her. I tried a grief counselor and it didnt help me, my friends and family have been very supportive but my mind only stays distracted for so long. We both didnt want to live till we were old but I still wanted us to live out our lives a little while longer. \n\nI want to kill myself so fucking bad to be back with her but I know I dont have the balls to do it and its eating me alive. Im so scared that I will fail (Ive attempted before and never succeeded, this was before I met her) and im so scared that I dont know what happens after. Will be back with her? Will it just be a dark abyss of nothing? I dont fucking know and its the hardest part. I just want to talk to her, hold her, kiss her, be with her. I know ill never be able to pull a trigger, Im just hoping that when I hop on my street bike I just happen to wreck at 180+ and instantly go because this pain is so fucking unbearable. \n",
  "created_utc": 1743307723.0,
  "score": 769,
  "num_comments": 92,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1jn4fr7/my_wife_killed_herself_3_weeks_ago_i_want_to_join/",
  "comments": [
    {
      "id": "mkgzelw",
      "body": "I'm sorry for your loss. I can't even begin to imagine. I want to help you to survive this. Nothing I could ever say would ever even begin to make this tragedy seem like something you could get past eventually. I really hope you stay with us.",
      "created_utc": 1743309223.0,
      "score": 122
    },
    {
      "id": "mkgx5vb",
      "body": "I think you need to admit your self in a mental hospital. I had to be admitted 4 times in last few months for attempts. It has helped me, it can help you too. There are treatments that can help you.",
      "created_utc": 1743308117.0,
      "score": 245
    },
    {
      "id": "mkh04az",
      "body": "I’m so sorry this happened. I’m not sure what to say. I know as a stranger I can’t fix it. I often wonder how my death would hurt the ones I love. Sometimes I think they will get hurt but they will move on. But what I’m reading here is a whole nother things. I’m torn as to what to say because I myself am suicidal. On one hand I don’t want you to suffer and on the other I don’t want you to go. But I understand the ache. The pain of staying sometimes is second by second breath by breath. I think if you have never had a go at hospitalization and mental health treatment then get healed. No matter what you choose. Know that you are loved. Everyone who loves you wants you well and healed. Reach for them. Be thankful they are there. I’m sure your wife wants you to keep reaching out for the love in your life. When you’re ready, make her proud that you did your best. So when your together again there are no regrets. Just smiles, laughs and love. I hope you make it. Remember it doesn’t have to be perfect. Just true. 🩷",
      "created_utc": 1743309579.0,
      "score": 25
    },
    {
      "id": "mkhe22l",
      "body": "it sounds like you had an amazing love",
      "created_utc": 1743317576.0,
      "score": 19
    },
    {
      "id": "mkh9acp",
      "body": "I would recommend finding an anchor. Adopt a dog or a cat or some type of pet (That's what I did). Life sucks and is hard.",
      "created_utc": 1743314608.0,
      "score": 50
    },
    {
      "id": "mkgzyr5",
      "body": "I'm sorry for your loss. You mean a lot to so many people, and you don't even realize it sometimes. But you're cared for, your loved, and you deserve to be happy. Loss can cause a lot of problems. Especially suicide. And someone once told me, \"You know the pain you're feeling right now? If you were to do what you're considering, it would pass all of that onto the people you love, and leave them there, trying to peice together what they could have done to help.\" And that made me realize, sometimes it's better not to follow your original plan. Much love sent to you, and your family, and hers aswell.",
      "created_utc": 1743309503.0,
      "score": 28
    },
    {
      "id": "mkim8op",
      "body": "Please join r/suicidebereavement. You aren’t alone in This pain. That community can support you",
      "created_utc": 1743342337.0,
      "score": 9
    },
    {
      "id": "mkhdmkp",
      "body": "The best decision I’ve ever made was checking myself in to a mental hospital. Just to get away from everything. It was life changing… not in the way you’re expecting but just understanding it was a step to start reframing your mindset. I want to give you a hug. Please don’t hurt yourself my friend. You wouldn’t hurt me or your friends. So please treat yourself the same. Show grace towards yourself.",
      "created_utc": 1743317307.0,
      "score": 8
    },
    {
      "id": "mkh3ms4",
      "body": "I’m so sorry for your loss may her memory be for a blessing. \n\nThat being said I’m not going to tell you what to do but the best I can say is really consider and ask yourself if that is the decision she would want you make. I hope you decide to get help and keep going but G-D knows I would be in the same frame of mind if I lost my wife so I can understand why you feel this way.",
      "created_utc": 1743311382.0,
      "score": 6
    },
    {
      "id": "mkjic4k",
      "body": "As someone who has been thrown into psychiatric hospitals like 7 times, Id highly advise against going to one. The doctors and staff will take total control of your treatment, keep you in the hospital for as long as they see fit, prescribe you meds that the side effects can be literally debilitating and the staff dgaf. If you think you can handle that though, then more power to you ig. My advice is to get a group of understanding friends and giving yourself time to heal. That has been far more helpful for me.",
      "created_utc": 1743352829.0,
      "score": 6
    },
    {
      "id": "mkhbz5e",
      "body": "I’m so sorry you’re going through this. There’s no ‘new normal’, don’t feel like there has to be. Cry and be angry when you feel it. You knew this special soul for a period of time, it’s so hard that the length of time wasn’t guaranteed.\n\nYou might be that person someone meets in a few years that needed you. Hand on your back friend.",
      "created_utc": 1743316265.0,
      "score": 4
    },
    {
      "id": "mkhgawz",
      "body": "Have you tried reading books on grief and suicide loss? It can help a lot",
      "created_utc": 1743319037.0,
      "score": 5
    },
    {
      "id": "mkhldnz",
      "body": "Your title made my tear up… I’m so sorry for your loss. I’m wishing the best for you. Consider admitting yourself to the hospital, they can help you keep an eye on you while you sort yourself. I feel you deeply. I’m sure your wife would have been impatient as well out of love and wanted you to get better asap. She loves you. \n\nAllow yourself to grieve so you can heal. It’s okay. It’s still very fresh. \nSending my love to you. May you feel your wife’s warm embrace and those loving kisses from her lips on your cheek.  🌹",
      "created_utc": 1743322402.0,
      "score": 6
    },
    {
      "id": "ml8z7p1",
      "body": "I know this black empty never-ending pit of pain all too well. What I can tell you is, and what really helped for me, is find a hypno therapist. It's real and it's legit. You lay down, they talk to you and they do their thing. I had headphones on and music was playing while I heard her voice. I wound up falling asleep. I was a crying nervous wreck when I got there. After the session I was night and day different. The pain was just, removed somehow. I still cared but I felt no pain like I did. I could function. I highly recommend it for you ASAP. Just go. The dr. I went to said they have cured smokers of 20 or more years with just ONE SESSION and they never had a cigarette again. I did it to ease the pain and she did just that.",
      "created_utc": 1743707100.0,
      "score": 3
    },
    {
      "id": "mkhosic",
      "body": "I’m so sorry. \n\nThere’s no way I’d be as strong as you.  I wouldn’t have even written this.",
      "created_utc": 1743324696.0,
      "score": 2
    },
    {
      "id": "mkkcspi",
      "body": "sorry i’m a bit late to this, but please don’t. you need to honour her memory by living to remember her. keep the love for her alive, out of everyone on earth only you loved her the way you did. she would want you to keep living, i’m sure of it. stay strong, don’t give in",
      "created_utc": 1743362067.0,
      "score": 2
    },
    {
      "id": "mkm7chi",
      "body": "Look, what my counselor said to me was in a year you will feel completely different.  And she was right, I was still rough but in a much better place.  You’ll be ok, the pain is your brain rewiring itself to be where you are.  It’s very pleasant to train your brain to be in love, very unpleasant to train it to be alone again.  But you will feel much better a year from now.  It’s going to be ok.",
      "created_utc": 1743384761.0,
      "score": 2
    },
    {
      "id": "mkn3kgs",
      "body": "I’m really sorry for your loss.",
      "created_utc": 1743399137.0,
      "score": 2
    },
    {
      "id": "mkvk7q0",
      "body": "im so sorry, my soulmate, my whole world committed 6 days ago and its all i think about. seriously, its the only comfort i have knowing he will be the last thing i see if i do it. i know how you feel to have this complete emptiness like absolutely nothing matters anymore, i cant stand the thought that i will miss him for the rest of my life. i just want to be back with him. i know how you feel and i guess like everyone says (which is so fucking repetitive youve probably heard it so many times) we have to keep living for them. even though it literally feels fucking pointless without them here. please hang on. just know my heart aches with you. im so sorry",
      "created_utc": 1743524044.0,
      "score": 2
    },
    {
      "id": "mlgq2on",
      "body": "Please dont :(",
      "created_utc": 1743811802.0,
      "score": 2
    },
    {
      "id": "mlnl4lg",
      "body": "I'm SO sorry for your loss, I can't imagine how great of a wife she was and without her you feel empty. Life is hard sometimes and sometimes its so hard you feel like ending it is worth it, pain is temporary, death is permanent. I really hope you get through it, to feel happy again and live a great life.",
      "created_utc": 1743915975.0,
      "score": 2
    },
    {
      "id": "mlnu205",
      "body": "I'm so sorry. My husband of 21 years died 3 weeks ago. Not to sound trite..but it really is better to have loved and lost than never to have loved. And I think the deeper the love, the more intense the pain. I tell myself vodka helps. I think I might be wrong. By drinking, I don't process it. I'm very sorry for your loss.  Try dif grief counselors. I was surprised how effective one session was w one of em. but I drink too. I tried 3 shrinks so far. \nAn exercise that helped me was  2 chairs facing each other, u in one her 'in' the other..say to the chair what you want to say to her. Ask her the questions that you need the answers to. Maybe have pillows to hug/squeeze. That exercise helped me the most so far. That and a treadmill. Breathing exercises. Good luck\n.",
      "created_utc": 1743920861.0,
      "score": 2
    },
    {
      "id": "mkh247e",
      "body": "I hope you stay to find out it was worth the wait for the beauty ahead. 💕",
      "created_utc": 1743310588.0,
      "score": 3
    },
    {
      "id": "mkhn4dv",
      "body": "Praying for you and that you find the strength to stay, take it easy, go to the hospital for a bit, you should be taken care of right now. You deserve to feel better 💐",
      "created_utc": 1743323574.0,
      "score": 1
    },
    {
      "id": "mkhr9p0",
      "body": "I'm so sorry for you man. I wish I could help you beyond this. Please accept a hug from a stranger. My heart goes to you.",
      "created_utc": 1743326325.0,
      "score": 1
    },
    {
      "id": "mkiueea",
      "body": "I’m really sorry for your loss. :( please hang in there!",
      "created_utc": 1743345196.0,
      "score": 1
    },
    {
      "id": "mklytuc",
      "body": "You need to be with your family like immediately if you're not already man, you're worth sticking around cause life goes on and we just keep fighting for our lives cause life is worth living no matter how hard it gets. I'm so sorry for your loss, buddy, but it gets better. Trust me.",
      "created_utc": 1743381521.0,
      "score": 1
    },
    {
      "id": "mkolr9r",
      "body": "Grief is so hard. First off my condolences the pain so unbelievable. I have no words when something similar happened to me I don’t know how I got out of it. My advice is it’s still very raw in your heart. There is no right way to grieve. You grieve the way you Need too. It’s ok not to be ok. Support groups helped more than therapy. Maybe look into that man this sucks. My heart breaks for you. Hugs to you I wish I could tell you it will get better but it doesn’t. We just learn to cope with it. Fucking sucks though. ",
      "created_utc": 1743428254.0,
      "score": 1
    },
    {
      "id": "mkq748a",
      "body": " I'm so sorry for everything that has happened.\n\nI agree with a lot of people here, you need to check yourself in a mental hospital. Stay calm, make sure you let someone know what you are doing and that you have someone to look after your belongings. There's nothing a grief counselor or I could say that would ease this pain. A place where you could be away from everything is your best option.",
      "created_utc": 1743445666.0,
      "score": 1
    },
    {
      "id": "mkr2zom",
      "body": "I'm sorry for youre loss, I cant even imagine the amount of pain you're holding inside. But you need to stay strong no matter what not for me or anyone else, but for her. This post has actually made me cry halfway trough. I empathize with you. Stay strong man.",
      "created_utc": 1743455188.0,
      "score": 1
    },
    {
      "id": "mkr5nmq",
      "body": "Lucky her. You need time to be able to process things, wish you luck",
      "created_utc": 1743456023.0,
      "score": 1
    },
    {
      "id": "mks5keh",
      "body": "As others have mentioned here, please consider admitting yourself to a hospital for psychiatric care for extreme trauma. Her death is not your fault, and you need serious professional help! Please take care and understand that no matter the cost, nothing is worth taking your own life.",
      "created_utc": 1743468385.0,
      "score": 1
    },
    {
      "id": "mkt7cyz",
      "body": "[removed]",
      "created_utc": 1743484147.0,
      "score": 1
    },
    {
      "id": "mkyuko5",
      "body": "Please take very care yourself for your family.",
      "created_utc": 1743563779.0,
      "score": 1
    },
    {
      "id": "ml83fnw",
      "body": "[removed]",
      "created_utc": 1743697755.0,
      "score": 1
    },
    {
      "id": "ml91my1",
      "body": "How old was she and how old are you?",
      "created_utc": 1743707833.0,
      "score": 1
    },
    {
      "id": "mlc6y09",
      "body": "I'm sorry for your loss and know that you're loved and needed by others. I can't imagine what you're going through I'm not married but I have lost people. I like to believe we're all reunited with our loved ones when we pass away. \n\n\nSo perhaps it will bring comfort knowing that you will see her again someday. I'm pretty sure your wife wants you to be happy and live a prosperous life. So take as long as you need to grief, there is no right way to grief so really take as long as you need. Get a dog they love you unconditionally and will support you in this difficult period in your life. I hope you decide to stay with us. ",
      "created_utc": 1743751655.0,
      "score": 1
    },
    {
      "id": "mlhivvj",
      "body": "listen man.. real talk. think about what she would say? would you be able to look at her and say that you hurt yourself for her? i dont think so. she would want you to respect and live out her wishes and memories.. if she was a cat or cow or sheep lover.. she would be happy knowing you didnt artifically cut your time short and honored her. or something along those lines. if you guys were bikers.., i know she would swoon and love at that moment in the future when you share those tender moments that you helped some people needing training like kids or older people going for a safe ride.. i know any girl thats worth it would melt over that and you guys would have the best hug and kiss and reunion down the line. do it for that feeling my man.\n\ni know the feeling.\n\ni understand your pain and mines still alive, just texting a clown man that she spreads her legs for.. and not me. the man that actually liked her for everything.. nonstop convos for years.. but i wasnt enough. his dick was bigger he was a little bit taller. it was that simple unfortunately. i just wish so badly she would snap out of this evil uncaring cold black ice haze shes in and come home",
      "created_utc": 1743823449.0,
      "score": 1
    },
    {
      "id": "mlj4syh",
      "body": "At least you care about your wife. My husband doesnt care. I have ptsd from childhood trauma he knows it and i struggle with depression. Two months ago we had a miscarriage and he couldnt care less; i have been a shell of myself since then. He continously tells me what an awful person i am and sides by my family when he knows what they have done to me too. I honestly dont have the guts to end my life because i have a five year old son but im death alive. I want this to be over",
      "created_utc": 1743856444.0,
      "score": 1
    },
    {
      "id": "mkhof0g",
      "body": "[deleted]",
      "created_utc": 1743324446.0,
      "score": 0
    },
    {
      "id": "mkoalqu",
      "body": "It's what is when before you born",
      "created_utc": 1743424060.0,
      "score": 0
    },
    {
      "id": "mkgy9zg",
      "body": "[removed]",
      "created_utc": 1743308664.0,
      "score": -31
    },
    {
      "id": "mkh6lra",
      "body": "look into halfway houses but for suicide watch. It’s a program where after you are 51-50’d you go to a home for as long as they see fit. Therapy, meals, excursions, and activities. visiting hours, journaling, and in some places your own room! It’s not glamorous but it definitely saved my life to have been there!",
      "created_utc": 1743313020.0,
      "score": 72
    },
    {
      "id": "mkhg84s",
      "body": "Not all mental hospitals are good. The one in my town told my schizophrenic brother to kill himself so he did.",
      "created_utc": 1743318985.0,
      "score": 69
    },
    {
      "id": "mklgho5",
      "body": "[deleted]",
      "created_utc": 1743374948.0,
      "score": 7
    },
    {
      "id": "ml4hh8i",
      "body": "A mental hospital made me 10x worse. It was a nightmare.",
      "created_utc": 1743641877.0,
      "score": 4
    },
    {
      "id": "mkm7nsp",
      "body": "[removed]",
      "created_utc": 1743384881.0,
      "score": 1
    },
    {
      "id": "mlc3t0p",
      "body": "That's an amazing reply and can only come from someone who is going through the same. Stay strong and know that you're loved. ",
      "created_utc": 1743749707.0,
      "score": 2
    },
    {
      "id": "mkhglxj",
      "body": "I also adopted a pet when I lost my bro and now my cat and his cat play together and idk there’s something nice about that",
      "created_utc": 1743319238.0,
      "score": 38
    },
    {
      "id": "mlc26qh",
      "body": "What's hypno therapy",
      "created_utc": 1743748793.0,
      "score": 1
    },
    {
      "id": "mlc27qx",
      "body": "What's hypno therapy mean?",
      "created_utc": 1743748809.0,
      "score": 1
    },
    {
      "id": "mkvq0ea",
      "body": "So sorry for your loss hope you are doing well 🙏🏾",
      "created_utc": 1743525844.0,
      "score": 1
    },
    {
      "id": "mky1kdq",
      "body": "im so sorry you for your loss and that you are now sadly apart of this fucked up club, its so hard to deal with. The way my brain works I cant stop thinking of all the what if’s and the wishes and everything else that grief is kicking my ass with. I genuinely do not see any reason to keep going anymore, she was my whole world and the only reason I looked forward to waking up the next day. I know everyone keeps telling me to keep going for her but its hard. She’s not here to do all the things she wanted to do with me, she wanted me to succeed in all of my passions and supported me no matter what. It doesnt feel right to go through life without her by my side.",
      "created_utc": 1743552642.0,
      "score": 1
    },
    {
      "id": "ml95b9y",
      "body": "Sorry for your loss.",
      "created_utc": 1743708935.0,
      "score": -1
    },
    {
      "id": "mkt8avg",
      "body": "Mine is taking a long minute.  So hard. \n4 years. Yesterday \nThere must be a reason. I do believe the times that taking a breath takes all my strength.... I have to!  \nIdk 🤷‍♂️ why. I'll find out, as will you.\nHas absolutely nothing to do with GOD.  May he burn in.... ",
      "created_utc": 1743484665.0,
      "score": 1
    },
    {
      "id": "ml8dld4",
      "body": "I dont plan on wrecking it but at this point, i have nothing else to lose so i dont care if i go down or not. \n\ni have a 2016 R1S, I just wear whatever is comfortable for me. i dont wear leathers though",
      "created_utc": 1743700737.0,
      "score": 1
    },
    {
      "id": "mlj8a3y",
      "body": "my wife also went through childhood trauma and had a miscarriage before we met. i dont want to tell you what to do, but i think in your best interest take your son, run and never look back. find someone who will appreciate you and will help you\n\nI did everything i could to help my wife, i know she struggled but she always re-assured me i helped her. she had been very sick recently (on top of having Type 1 diabetes) and i think she just couldnt take the physical pain anymore and didnt want to be a burden to me but she never was. i always wanted her to be healthy and happy, i tried my best but i just keep feeling like i didnt do enough and i didnt help her enough.",
      "created_utc": 1743857953.0,
      "score": 1
    },
    {
      "id": "mkirwx0",
      "body": "I know she never wanted to hurt me, i know she thought i would “be okay” but im not. She had dealt with a lot of trauma before me, was T1 Diabetic since middle school, and on top of that was dealing with a sickness for the past year that no doctor could give an answer to as to why. I know she didnt want to be in pain anymore, i know she probably felt as her constantly being sick was a burden to me but it wasnt. I just wanted her to be healthy and happy and i know she knew that. She always told me i helped her in so many ways and she loved me more than anything in this world. I knew she was the one when i first laid eyes on her, i know ill never be able to find anyone that can make me feel how she made me feel. Part of me wants to keep going for her but the other part of me just doesnt want to go through life without her. We were attached at the hip from Day 1 and the hardest part of all of this is dealing with the silence and the nothingness I have to wake up to, come home to and go to sleep to.\n\nI dont plan on taking my own life. I know I cant go through with it and part of me doesnt want to hurt any of my family and friends, but I just genuinely hope I go soon so I can be back with her and feel her love again.",
      "created_utc": 1743344348.0,
      "score": 11
    },
    {
      "id": "mkh3r8c",
      "body": "This is not the place to push your religion.",
      "created_utc": 1743311447.0,
      "score": 21
    },
    {
      "id": "mkh2wbc",
      "body": "Jesus lies in comforting ways. The devil speaks an unpleasant truth, but at least he keeps his word.",
      "created_utc": 1743310991.0,
      "score": 8
    },
    {
      "id": "mlh7fht",
      "body": "Those places are horrible. ",
      "created_utc": 1743818577.0,
      "score": 2
    },
    {
      "id": "mlnuex0",
      "body": "I was put in a detox rehab place. Checked out early cuz funeral stuff",
      "created_utc": 1743921058.0,
      "score": 2
    },
    {
      "id": "mkhhx1e",
      "body": "My brother went to one and said it made it much worse then what he was already dealing with they put him with a roommate that was “playing with himself” in the same room. My brother too ended up taking his own life. We got him out of there but it caused him more trauma just make sure you look into the place if you decide to go that route.",
      "created_utc": 1743320104.0,
      "score": 45
    },
    {
      "id": "ml48lch",
      "body": "I'm so sorry Tenno",
      "created_utc": 1743638760.0,
      "score": 3
    },
    {
      "id": "mklmcll",
      "body": "My insurance took care of it all. So yes I do know.",
      "created_utc": 1743376974.0,
      "score": -1
    },
    {
      "id": "mkkxk8j",
      "body": "While unrelated to grief, adopting my cat saved my life when I was diagnosed with MS and wanted to end things. She made me laugh when all I wanted to do was cry. When I did cry, she’d jump in my lap and comforted me. She gave me something to live for. Animals are amazing and there is research that shows how much comfort they provide us.",
      "created_utc": 1743368503.0,
      "score": 5
    },
    {
      "id": "ml8h42z",
      "body": "Those Yamaha's are awesome man. Go ride that bike and try to enjoy the feeling it gives you.",
      "created_utc": 1743701755.0,
      "score": 1
    },
    {
      "id": "mljsbf7",
      "body": "I just sent my last letter to him. I cant do this anymore",
      "created_utc": 1743865326.0,
      "score": 1
    },
    {
      "id": "mli5ph9",
      "body": "My program was great! A lovely set of women with an in house therapist. It looked like a rundown house from charmed but we were very well taken care of! Journals, food 3x a day and snacks we could eat. So not all of them but that’s why you research! Though it’s also up to what’s available",
      "created_utc": 1743835267.0,
      "score": 1
    },
    {
      "id": "mnddqf2",
      "body": "I’m really sorry for this we need to sort these hospitals out they need making accountable",
      "created_utc": 1744787683.0,
      "score": 1
    },
    {
      "id": "mnddk5e",
      "body": "Thank you xx",
      "created_utc": 1744787573.0,
      "score": 1
    },
    {
      "id": "mli7v6r",
      "body": "Great for you. Unfortunately, the realistic thing is that someone is hospitalized and transferred to an in network facility, meaning it’s run by a private mega company. Your experience is great, but extremely uncommon. \n\nThere are overwhelming majorities of past patients saying mental facilities are glorified prisons that strip you of basic freedoms in the name of treatment when they actually deprive you of your basic human rights, freedoms, and create extreme trauma from the unstable environment and frequent violent outbursts, and even patients attacking them for no reason.\n\nI have had consistently horrible experiences in the 5 places I’ve been in (mind you they’re in different networks, and one was even non-profit) for this exact reason and it boiled down to the fact they took people who didn’t belong in those programs because it was profitable and filled up beds, and the staff abuses patients verbally, emotionally and even sometimes physically to be entertained. I literally got sexually assaulted at one of the places. And I got punched in the head that they not only punished me for despite the fact I did nothing and that person attacked me before for no reason, but initially refused to get me help for until my mom forced them to, to make sure I was okay. Well, I had a concussion and brain swelling. At another I was manhandled and purposefully provoked to force me to stay longer AND punish me. We weren’t fed decent food. We didn’t get to go outside when we wanted. We didn’t get to watch tv, listen to music, or talk to people on the phone without permission or a time limit of 5-10 minutes. We didn’t see our doctors or clinicians for more than 30 minutes every 1-2 weeks. We didn’t get to even do our laundry or take a nap if we were tired. How is that beneficial when you’re not being prepared to actually handle the real world that put you there in the first place?\n\nOne of the head staff at the second place I was forced to was charged for physically abusing a patient. This is horrifically common and to tell people to “just research it” doesn’t help whatsoever. The places I went were recommended and direct referrals from previous treatment. But it wasn’t what my mom and i were told it was. It was hell. I’m glad you had a good experience. But 99% of us didn’t. Those places exist to stop you from killing yourself, hurting yourself, hurting others, engaging in harmful behavior, etc. most of them keep you 7-10 days or 1-3 months. If treatment was a priority, you wouldn’t meet your clinician once every two weeks, or a prescriber every month. \n\nI don’t know what lala land you’re living in but just because you had a positive experience doesn’t change the fact the healthcare system in the US is a corporate nightmare with little to no interest for the person at hand who needs the care. More time means more money from the insurance companies, meaning more money from the person paying for the insurance itself. And I could say maybe it used to be, but it never was. It never has been. This entire concept was based on locking up, and essentially forcibly experimenting on mentally ill people. Autistic children were literally chained to radiators. It’s never been about helping people. It’s an abusive system that’s gotten better at masking it. Locking people away against their will doesn’t have positive benefits. It further damages their psyche. It teaches them to hide their actual emotions because they don’t want to be punished or end up back somewhere like that. It stunts development and prevents people from properly functioning in society. When addiction recovery sober living houses have more freedom than most mental health facilities, shouldn’t that ring some bells? People who literally are doing drugs per their initial choice and are a liability under the law have more freedom than someone who’s suffering against their will? The same negative impact is found with literal prisoners. Shouldn’t that say something? Please stop suggesting and normalizing impatient treatment just because you had a good experience, because it’s almost always a dystopian traumatic borderline prison nightmare wrapped in cold ventilation, pants and shoes with their laces cut out, and grippy socks meant to enlist fear, and dehumanize the people forced to be there against their will.",
      "created_utc": 1743836552.0,
      "score": -1
    },
    {
      "id": "mli9fj3",
      "body": "Your experience is your own, my experience is my own. It’s easy to see the world in black and white. And watch your attitude! i literally almost took my life today so your intentions tho well, are misguided in execution! Yes there are shitty and great programs and I’m sorry that every single one of you’ve been to has been bad. I’ve had bad experiences too I never said I hadn’t. I said that specific house was great and came from researching! Please get the help you need because you’re screaming at me, but it’s not at me. Wishing you lots of healing",
      "created_utc": 1743837469.0,
      "score": 1
    },
    {
      "id": "mlia45h",
      "body": "And so did for the last two weeks. I also sobbed for an hour and a half today. I don’t have an attitude. and that doesn’t change the fact that I just said the truth, whether you like it, or not, which you don’t... It IS the cold, hard, ugly truth. And the fact of the matter is, most of those places do not help long term. Because they are not simply not designed to. That’s why so many people who have gone to them are deathly afraid to ASK for help, because they were traumatized when they tried to. I’m not being gaslit by someone who wants to write off people’s trauma because they weren’t affected by that kind of experience. You’re inherently committing the behavior that continues the cycle of harmful invalidation and discrediting of peoples’ struggles and emotions.\n\nAgain, like I said, your experience isn’t everyone else’s. Quite the opposite, actually. The majority say the complete opposite. Getting a therapist and psychiatrist, as well as outpatient partial programs is actually productive and beneficial. Locking someone away is dehumanizing and harmful to most people. Human beings are not meant to be locked away or isolated. You had a choice. Most people do not have that luxury. And it’s not even an accessible resource. Do better.",
      "created_utc": 1743837880.0,
      "score": 0
    },
    {
      "id": "mlic092",
      "body": "No hun you spoke YOUR TRUTH! we weren’t allowed outside all the time because they can account for all of us and have had incidences in the past, they don’t have good food because they don’t have great funding, they have so many people because our mental health system is shit. So yeah in some regards your right, but you’re looking at it from a lense of THEY TOOK FROM ME, when you’re still here…. the whole point of the program structure is to fill your days with MULTIPLE coping mechanisms and tools. Again you’re not yelling at me, you’re in pain and I’m not the one",
      "created_utc": 1743839084.0,
      "score": 1
    }
  ]
}