{
  "id": "1esnf65",
  "title": "Nobody here truly cares.",
  "selftext": "You act concerned and considerate and it’s all a fucking act. It doesn’t matter if I come in here screaming that my life has been nothing but neglect and abuse and that I’m on nine antidepressants and slowly losing my damn mind. I just want to bash your fucking faces into the wall for how fake you all are. It doesn’t matter if I rent a wood chipper and jump headfirst and turn myself into toothpaste. You’ll run to this post and say you care, and then tomorrow you’ll just move on and forget about me. BECAUSE YOU DON’T ACTUALLY CARE.",
  "created_utc": 1723700230.0,
  "score": 485,
  "num_comments": 127,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1esnf65/nobody_here_truly_cares/",
  "comments": [
    {
      "id": "li79gfw",
      "body": " I get your need to be seen and heard believe me. \n\nAnd please understand that most people on this subreddit are also suicidal or depressed so unfortunately as much as they care and want to help you and other people out, they are themselves fighting their own internal battle.",
      "created_utc": 1723703951.0,
      "score": 166
    },
    {
      "id": "li79hgq",
      "body": "[removed]",
      "created_utc": 1723703968.0,
      "score": 247
    },
    {
      "id": "li793op",
      "body": "[removed]",
      "created_utc": 1723703728.0,
      "score": 335
    },
    {
      "id": "li7bqgt",
      "body": "Not to be too poetic, but I think that's almost part of the appeal? Meaning, yes it's true that none of us here can ever truly care for each other the way people can in your immediate area, but look at the marvel of humanity washing over this little corner repeatedly for people we've never known.\n\nTo be posting on this subreddit is to cry out to humanity about your pain and no matter how isolated you are by physical distance, you still receive a rush of care in return. \n\nYou're right, none of us care the way you deserve in person. But as a collective you can get a genuine glimpse at how humanity cares about you as a whole.",
      "created_utc": 1723705360.0,
      "score": 106
    },
    {
      "id": "li77e3u",
      "body": "Are you trying to say you want genuine friendship instead of support? People are going to come here today and say they care and then be gone tomorrow because they have no other reason to stay. They come to serve the purpose of this subreddit, to offer help and support then move on to other people.",
      "created_utc": 1723702669.0,
      "score": 71
    },
    {
      "id": "li7trj8",
      "body": "You cannot blame people for not totally understanding where you are and what you need, they don't genuinely know you. There are other, longer ways to find friends who will get to know you and support you in an entirely new way.  \nOn this sub, the main purpose is to get peer support for your suicidal thoughts, you came here and posted. People did what they can, they offered what they had, just like you and me and anyone. It's not their fault you went through all this pain, or that they don't know how to truly help.\n\nJust like you, they are doing their best with what they have. Bashing them is not the way, your anger is misplaced. You are angry because of all the terrible shit that has happened to you. It's terrible, it's shitty, but in the end, nobody can truly save you but yourself. Cliche, I know.  \nYou can choose to end it all, but maybe you can choose to prove those abusive assholes wrong and live better than they ever did.\n\nWhen I was little, and nobody gave a shit about me, I had to be the one to give a shit about myself. Eventually, you could find people who will genuinely care, but you might have to fight and dig for it. Sadly, it won't be right now. People can only sympathize or empathize so hard with your posts, that deeper connection has to be found in a different way.\n\nI empathize with you, with the feeling of people not caring about me or what happens to me. I don't know you, but I do have hope for you, even if I never see your posts again, that you overcome this in some way, just like I hope for everyone that I come across with on here.  \nThe hard truth is that sometimes, when you need people most, they aren't there. Nobody was there for me either.\n\nBut I was there for me.  \nI hope you're there for you, too.\n\nGive yourself a pat on the back for getting it this far, because god, has it been hell.",
      "created_utc": 1723717079.0,
      "score": 24
    },
    {
      "id": "li74h23",
      "body": "[removed]",
      "created_utc": 1723700943.0,
      "score": 27
    },
    {
      "id": "li7dbfi",
      "body": "The reason I am on this sub was due to me being suicidal, with some very close attempts. To say others don't care is coming from a place of deep hurt within you, but fundamentally, *you* have made that assertion/assumption/accusation. The same reason that you think I don't care (reason being that I don't know you) is the same reason you cannot assert that I don't (because you don't know me). I fundamentally don't want people to die to suicide, because suicidal thoughts and ideation are a symptom of what is happening to you, not a cure for it. Fundamentally, I believe fully that you deserve happiness, but you cannot achieve happiness if dead. I don't know if you can read my post history, but I out something on this sub a year ago and got help from it, please.read it. My physical situation has not changed, I am still a very ill person, but I am more mentally well. I don't just think that suicide ideation is bad for you and those around you, I know it is. I have lost relationships due to.my suicidal thoughts, I have lost friends to their own hand. I don't want others to feel that pain. Believe me or don't, but don't tell me and others we don't care. We do.",
      "created_utc": 1723706372.0,
      "score": 20
    },
    {
      "id": "li7a9iz",
      "body": "Well, the person who shoud care most about you is yourself. Everybody has their own problems. I am sorry but you are right. Nobody really cares. But they are not bad people, it is just how human nature is.",
      "created_utc": 1723704447.0,
      "score": 14
    },
    {
      "id": "li7fiup",
      "body": "I don't think there is anything fake. This is a support group for suicidal people. You post here and most of the time someone will come and try to help you, may be sad for some of you but how much would you want a stranger to care about you? I see this subreddit like situations in real life where, I don't know, you tripped and someone came to check up on you? They cared at that moment but won't check up on you tomorrow to see if your ankle still hurts. Then, if you actually develop a friendship, that's something else..",
      "created_utc": 1723707806.0,
      "score": 7
    },
    {
      "id": "li7p41j",
      "body": "I don't think we have much of a control over your suicidal tendencies, let's be real here. The least that anonymous reddit users can do, on a post about suicidewatch and depression, are the words they can send on the comments section. \n\nHow does \"really caring\" actually work on this platform?",
      "created_utc": 1723714204.0,
      "score": 4
    },
    {
      "id": "li7pdb5",
      "body": "Unfortunately, you are right, no one genuinely cares in depth about you because they are not your friend or family, if you want people to genuinely care about you then turn to them, on here it’s just people encouraging you not to do self harm and trying to empathize. At the end of the day we all got our own shit to deal with so most of us only say the words but it means nothing other than words.",
      "created_utc": 1723714374.0,
      "score": 5
    },
    {
      "id": "lib8dpn",
      "body": "If you give a dime to a homeless, it means you care. It doesn't mean he will become your new best friend, it means that you care about human beings around you, online or offline. Even for a second, a day, a year or a lifetime, caring is valuable no matter how long it lasts.",
      "created_utc": 1723759634.0,
      "score": 5
    },
    {
      "id": "li7xeoy",
      "body": "I understand this, I myself have always struggled with that alone feeling even till this day shit is numbered but I’ve been thinking lately people do care it’s just me, it’s my brain, it’s that rotting hole in the center of my being that convinced me people don’t care about me. Don’t matter how many women I’ve held in bed, don’t matter how many close friends shootin shits with, don’t matter if it’s by family by blood. No matter how much I tell my self people care this other part of me tells me I’m alone. Even if I’m not I still am. Maybe it’s ptsd from when I was a kid I’m still young in my mid 20s. I haven’t found the answers yet expect filling my souls crater with oxy. Life is sad & unfair but also can be fun and beautiful so why can’t I just understand this and feel better ? Wanting to die but wanting to live in the slight chance I can get better and maybe help some one like me. Oh the duality. Let me shut up with all this stupid nonsense n take my happy pills",
      "created_utc": 1723719122.0,
      "score": 3
    },
    {
      "id": "li9xkly",
      "body": "People here mostly talk to other suicidal people mostly as a way of talking to themselves. If they feel like they helped you it's like they're helping themselves. Just an absolute selfish move unfortunately.",
      "created_utc": 1723744649.0,
      "score": 3
    },
    {
      "id": "lid94u0",
      "body": "I see this sub as more of a place to vent and receive self help recommendations. Even if we put our all into helping you, you’d have to help yourself for anything to change. We are not professionals. We can listen, but frustration aside, we’re all here because our lives aren’t the best either. Sorry OP.",
      "created_utc": 1723790459.0,
      "score": 3
    },
    {
      "id": "li7bcxj",
      "body": "It's superficial caring. Because we are all strangers. Thats it.",
      "created_utc": 1723705124.0,
      "score": 4
    },
    {
      "id": "li8iafn",
      "body": "I'm surprised you even thought people on the internet cared in the first place. \n\nEven irl, people dont REALLY care that deeply about anyone, not even their mothers, partners, children, best friends, etc. people ultimately are alone with themselves inside of their heads even when physically near other people, and only truly, genuinely, care about themselves. \n\nEvery feeling, every burden, every suffering one feels is all upto oneself to carry and deal with. No one else can alleviate ones suffering but oneself. It sucks, but thats just how it is and I've accepted it a long time ago.",
      "created_utc": 1723728189.0,
      "score": 4
    },
    {
      "id": "li8fm77",
      "body": "What I care about is nobody should ever feel as trapped as I used to. I know what misery to that level is like. I'm not gonna be your best friend but I'm here to talk and I don't want anyone to kill themselves I want everyone to have a chance at life.",
      "created_utc": 1723727192.0,
      "score": 2
    },
    {
      "id": "libq4e6",
      "body": "I can try but the only thing I can't do is to comprehend you're suffering because no matter what everyone live life and suffer differently.",
      "created_utc": 1723765935.0,
      "score": 2
    },
    {
      "id": "lic0x08",
      "body": "Everyone here is struggling and they are not really in a position to provide support. You need to find supports in your community, specifically people who aren’t just as depressed and suicidal as you are.",
      "created_utc": 1723769913.0,
      "score": 2
    },
    {
      "id": "lidwc2i",
      "body": "I understand your pain and i get it but this is such an out of touch post. Reddit is an completely anonymous website on the internet dude. We can't make actual human connection therefor we tend to forget what people say. Nothing against u but it's the internet my guy you can't expect everyone to be asking how you are 24/7",
      "created_utc": 1723805291.0,
      "score": 2
    },
    {
      "id": "lilmdls",
      "body": "Fr people do care. Hurts my soul to hear people say the things you said. I feel your pain, so on that basis alone I already care because we have a shared emotion.",
      "created_utc": 1723919111.0,
      "score": 2
    },
    {
      "id": "ljbp2se",
      "body": "Don't you think logically you need to care for yourself the same way people here care about you and we're not available ALL THE TIME for you because we have our own lives and struggles as well? The harsh truth is that you need to care about yourself more and accept kindness when it's shown to you instead of rejecting it and complaining that nobody cares about you when we have our own lives and you should care for yourself as well and be kind to yourself the same way we're all trying to be kind to you. Depression sometimes makes us narcissistic and makes it seem as if people should care about us more than we should care about ourselves.",
      "created_utc": 1724298046.0,
      "score": 2
    },
    {
      "id": "lmjtele",
      "body": "Whether or not people care is not binary. It isn’t as simple as yes they care or no they don’t. What people value is complex and everchanging, and it isn’t accurate to state that people have zero care for you when in reality they just don’t have as much as you want them to.\n\nPeople’s lives are complex too. I comment here when I can, but I’m young, my relatives are all dead, and I have a younger brother who’s still in school and needs me. I live in the dystopian hellhole of the United States, and I don’t have time to build a relationship with someone who is in need and offer reliable support because I’m struggling to keep my brother and I alive as is.\n\nThis is a social media platform. It is designed to provide a relatively high number of relatively low depth interactions. No one here is in a position to offer anyone else here a high degree of care, but there are a lot of people who are offering a little degree of care.\n\nIf you want to have a high degree of care, you need to find someone who can offer that, and that only happens when you meet someone in person.",
      "created_utc": 1726024773.0,
      "score": 2
    },
    {
      "id": "li7lznj",
      "body": "Yeah, you're right. This place isn't actually helpful.",
      "created_utc": 1723712109.0,
      "score": 2
    },
    {
      "id": "li7wfg9",
      "body": "I mean, nobody here knows each other personally.",
      "created_utc": 1723718593.0,
      "score": 2
    },
    {
      "id": "li8f6ow",
      "body": "Think about the pre-Reddit days. There were no safe places to discuss this subject. You think nobody cares? You should’ve been around in the 70s. Literally, no anonymous place to connect with anyone. That’s when my suicidal ideation started. I was on my own, emotionally, since age 12. No Reddit. I actually appreciate this place. I know that these people don’t know me, personally and I don’t know them…so the “not caring“ goes both ways.\n\n Like others have said, it’s not a personal feel because it’s not in person. Ive seen people, here, try all day and night to keep others from committing. Majority of the folks, here, still try to save lives….people they never met. I lurk in the r/Assistance sub and those folks are very helpful and kind. Most people do care, up to a point. The next level would be personal family and friends. I’ll take Reddit as I’m fresh out of family and friends. 🌊",
      "created_utc": 1723727026.0,
      "score": 2
    },
    {
      "id": "libqmlo",
      "body": "People really do care.  You're just in such a bad place you can't see it ❤️",
      "created_utc": 1723766118.0,
      "score": 2
    },
    {
      "id": "li7i9ij",
      "body": "I feel this. At then end of the day you just feel like a number that doesn’t really matter; I’ll be replaced by someone better eventually.\n\nIt’s only a matter of time at this point. Counting down the days to do it and finally be free. You’re never alone.",
      "created_utc": 1723709628.0,
      "score": 1
    },
    {
      "id": "liasrxm",
      "body": "Yep, I agree",
      "created_utc": 1723754549.0,
      "score": 1
    },
    {
      "id": "lib1jb3",
      "body": "yeah maybe",
      "created_utc": 1723757349.0,
      "score": 1
    },
    {
      "id": "libaib8",
      "body": "You're 100% right.",
      "created_utc": 1723760371.0,
      "score": 1
    },
    {
      "id": "lifzo9w",
      "body": "You have to live for you.  Nobody can give you a reason to live.  We can share our thoughts, our pain etc.  But no one here is going to give you a reason to live.  That’s something we all struggle with, & that answer lies within us.  Your path to healing will never come from the outside, it will come from you, when you do the work.  That’s the shitty thing about adverse mental health…the Dr’s can prescribe the medication, the therapists can listen.  But until you are willing to face yourself & the things in your life, you’ll never heal.  I’m near 50 & I’m still learning on how to heal myself.  I do know one thing though, nobody will heal me, that’s my job.",
      "created_utc": 1723831932.0,
      "score": 1
    },
    {
      "id": "ljbfm3g",
      "body": "You're right.  It doesn't matter how bad any of us feel about **our own awful situations** --- if we don't commit 100% to yours and forget about ours, it means we don't care.",
      "created_utc": 1724294106.0,
      "score": 1
    },
    {
      "id": "li831kj",
      "body": "That's not what this sub is for",
      "created_utc": 1723721917.0,
      "score": 1
    },
    {
      "id": "lia1q7s",
      "body": "Son, do you think I do this because it makes me happy? If I didn’t care I wouldn’t do it because let me tell you, helping people is fucking hard. It’s tiring, it’s repetitive and it’s almost entirely thankless. \n\nNobody does this for themselves, they do it because it’s decent",
      "created_utc": 1723745954.0,
      "score": 1
    },
    {
      "id": "lide15h",
      "body": "Okay, so what. I don't know you, and you don't know me, so as far as I'm concerned, you're probably just making a scene. I'd care more about you if you actually tried to accept it.",
      "created_utc": 1723793585.0,
      "score": 1
    },
    {
      "id": "li7b2qu",
      "body": "ppl just care about their egos",
      "created_utc": 1723704951.0,
      "score": -2
    },
    {
      "id": "li73m7p",
      "body": "[removed]",
      "created_utc": 1723700456.0,
      "score": -8
    },
    {
      "id": "li83awg",
      "body": "Lol do you think you’re the only one that comes in here to whine about your existence? Get in line bud.",
      "created_utc": 1723722036.0,
      "score": 0
    },
    {
      "id": "li7cbgi",
      "body": "dont expect ppl to care",
      "created_utc": 1723705733.0,
      "score": -4
    },
    {
      "id": "li8bed9",
      "body": "Welcome to adulthood",
      "created_utc": 1723725541.0,
      "score": -1
    },
    {
      "id": "lic3fq7",
      "body": "Nobody owes you anything. \n\nPeople just want to stop other humans taking their own life. There’s nothing fake about that. This post screams entitlement.\n\nI really hope you do get better. But yes, I’ll carry on with my own life either way.",
      "created_utc": 1723770869.0,
      "score": 0
    },
    {
      "id": "lidtdok",
      "body": "nobody actually cares, bitter truth of life.  \nour parents too move on with their life, the one we call LOVE OF OUR LIFE they would also find someone better or worse.. the word FOREVER is a lie. there's nothing like forever. your FRIENDS will also get their new friends. LIFE GOES ON, NOBODY CARES ABOUT YOU OR ME NOBODYYYY \n\nwe aree tooo delusional and innocent to think that people would miss us or care about us...hahahah what a lie.. live or die nobody cares dude.   \nall the best try your best to survive, (i am also trying my REAL best) ngl idk when i would lose this   \ni am scared of myself..... nobody cares about mental health, do they? fuck none   \nwords are fake, never expect anything to anyone  \ni am not gonna trust humans anymore, i have lost myself already 1 am 18 and i realised i have been this suicidal for like 12 years. let's see how much i can survive more. \n\n  \nbbye take care",
      "created_utc": 1723803624.0,
      "score": 0
    },
    {
      "id": "li88sdb",
      "body": "People who write here to others actually do take the care as they dedicate their time to read and also to answer.\nMost of people are here anyway because are suicidal too... In one post they ask for help in other posts they reply comforting others. This is a first aid kit.\nIf you want to heal, you have to find IRL people who can help. You don't find such? No wonder, but if so, you have to organize your own safe space.",
      "created_utc": 1723724460.0,
      "score": -1
    },
    {
      "id": "li8bmth",
      "body": "Buying a wood chipper is cheaper in the long run.",
      "created_utc": 1723725637.0,
      "score": -1
    },
    {
      "id": "li8xwiq",
      "body": " I'm sorry to hear, I feel the same way, it motivates me to work on myself",
      "created_utc": 1723733464.0,
      "score": -1
    },
    {
      "id": "liapfze",
      "body": "Nobody ever cares. Forever :)",
      "created_utc": 1723753511.0,
      "score": -1
    },
    {
      "id": "lidua8u",
      "body": "[removed]",
      "created_utc": 1723804154.0,
      "score": -1
    },
    {
      "id": "m1gptvk",
      "body": "yeah, this place is more for commiseration and to find people who mirror how you're feeling so you don't feel like you're the only one feeling like this. Real support comes from the links in the resource tab.",
      "created_utc": 1733884497.0,
      "score": 1
    },
    {
      "id": "li9tswj",
      "body": "I don't want another life even it was a good one.",
      "created_utc": 1723743481.0,
      "score": 17
    },
    {
      "id": "li816ku",
      "body": "Its pissing me off and its not helpful for ANYONE! Its not helpful for the ops, and its not helpful for the viewers and commenters. People will feel guilty for whatever bullshit op is spewing and that in turn makes them even worse considering most people on the depression subreddit are obv depressed. Thank you for pointing it out, you are right.",
      "created_utc": 1723721031.0,
      "score": 70
    },
    {
      "id": "liawi94",
      "body": "That is not a good thing to say on a suicide watch post...you can get to know them personally via chat. Like talking in person. I'm very certain anyone would care especially if it's on such a serious topic like suicide, regardless if you know them or not.",
      "created_utc": 1723755716.0,
      "score": 3
    },
    {
      "id": "li8nm8c",
      "body": "Thank you for this",
      "created_utc": 1723730087.0,
      "score": 8
    },
    {
      "id": "li8claj",
      "body": "[removed]",
      "created_utc": 1723726019.0,
      "score": -16
    },
    {
      "id": "li7a9wc",
      "body": "True, and that's just how it works. :/",
      "created_utc": 1723704453.0,
      "score": 8
    },
    {
      "id": "li7adxc",
      "body": "Which is why it's fake. Posting in other reddits about friendship I get nothing. I post in here and get told to live. \n\nEveryone wants me to serve and be a slave. That's it",
      "created_utc": 1723704523.0,
      "score": -8
    },
    {
      "id": "li7a7sq",
      "body": "Very true. Although I really honestly wish that I can care for all the people (especially on this subreddit), it's just too damn impossible to do so. So I totally agree with you. It's a really sad fact. :(",
      "created_utc": 1723704417.0,
      "score": 10
    },
    {
      "id": "li7gohu",
      "body": "I am sorry you’ve had that experience. Sometimes I think people say unintentionally hurtful and inaccurate things because they aren’t sure what to say but feel the need to try to encourage you to keep trying at this life stuff. I don’t know anyone here personally but I have to believe that for the most part it is good hearted people uplifting in the way they know hosnvia",
      "created_utc": 1723708572.0,
      "score": 2
    },
    {
      "id": "li7f4zw",
      "body": "for real, i thought it was a phase until my depression went away for a few months then came back",
      "created_utc": 1723707553.0,
      "score": 1
    },
    {
      "id": "li8vryx",
      "body": "I don't agree that it's human nature. I'm lonely and I need attention (IRL). Others can provide that to me and I can provide that to them, but they are either killing time with Reddit, video games and such (me right now), or they are giving their time away for money (most of the time the services provided or goods produced were unnecessary, my job for example). This is the way this society is built, people are focused on things other than people around them, things that are meaningless.",
      "created_utc": 1723732788.0,
      "score": 5
    },
    {
      "id": "li8raiu",
      "body": "Helpful? Not sure.\n\nEnjoyable? Hell yeah.\n\n\nEdit:\nOw yeah I can see how this sounds mean.\n\nTo be clear, I generally don't get off on other people's misery.\n\nI enjoy the feeling that I'm not alone in my misery.\n\n   ---____---\n\nBut I do think people have a point this place isn't helpfull. I don't think this place makes people less likely to want to kill themselves. I assume that's the goal.",
      "created_utc": 1723731325.0,
      "score": -1
    },
    {
      "id": "li7ifqc",
      "body": "We’re here offering support voluntarily because many of us have experienced suicidality ourselves. We’re all anonymous here. What exactly do you expect people to do? If you think everyone trying to help is just being egotistic, maybe it’s best not to participate.",
      "created_utc": 1723709741.0,
      "score": 4
    },
    {
      "id": "li7nz5z",
      "body": "The enture circus",
      "created_utc": 1723713453.0,
      "score": 2
    },
    {
      "id": "li7zkfy",
      "body": "😭😭",
      "created_utc": 1723720242.0,
      "score": 1
    },
    {
      "id": "li7ej4a",
      "body": "I think we as a species should make caring universally expectable. That's the only way a collective species can thrive",
      "created_utc": 1723707153.0,
      "score": 4
    },
    {
      "id": "ljum86w",
      "body": "But people stop it other humans from deciding when they had enough of living isn't entitled?",
      "created_utc": 1724590324.0,
      "score": 2
    },
    {
      "id": "lior87o",
      "body": "Oh grow up",
      "created_utc": 1723968239.0,
      "score": 1
    },
    {
      "id": "lia0r1l",
      "body": "I do know that. I was telling myself I was alright and when that wasn't enough, I came here (only recently) and will continue to run till I can't. Till I feel like it's my last straw, I can't push myself and will go mad. What we want is a psychiatrist or therapist (as per their need) who will help us (not care) for the money we give them. That's what and how humans are. I screamed to you too. But you too won't care with your own problems bagged in. And I've accepted that too. These are social platforms not a cure. Please know that.",
      "created_utc": 1723745650.0,
      "score": 7
    },
    {
      "id": "lkclo5h",
      "body": "what did they type lol",
      "created_utc": 1724856795.0,
      "score": 1
    },
    {
      "id": "li8k4qn",
      "body": "Sir this is a Wendy’s",
      "created_utc": 1723728862.0,
      "score": 21
    },
    {
      "id": "li7ch3p",
      "body": "What do you expect from others?",
      "created_utc": 1723705832.0,
      "score": 14
    },
    {
      "id": "li910ym",
      "body": "To be fair you posted on r/penpals and r/makenewfriendshere and your posts are extremely dead. Reddit isn't a good place to find friendship either. Bunch of actual apps out there for making friends you could try out",
      "created_utc": 1723734459.0,
      "score": 1
    },
    {
      "id": "liqqy6o",
      "body": "I started noticing this and just see this problem everywhere. ",
      "created_utc": 1724000956.0,
      "score": 3
    },
    {
      "id": "li8aycb",
      "body": "humans will never be perfect, we r jus animals. ur disappointing urself",
      "created_utc": 1723725358.0,
      "score": -2
    },
    {
      "id": "lke34aj",
      "body": "They were telling op that they dont know us and its not up to us i think. Thats how i remember",
      "created_utc": 1724873406.0,
      "score": 1
    },
    {
      "id": "lic31o4",
      "body": "[deleted]",
      "created_utc": 1723770719.0,
      "score": 0
    },
    {
      "id": "li7cixs",
      "body": "Nothing. That's why my death day is coming",
      "created_utc": 1723705865.0,
      "score": 0
    },
    {
      "id": "li91kfx",
      "body": "This is my vent account. I also have a regular one. A friendship one. And one for my business. Same results. \n\nAnd I've tried practically every website for friendship too. None work",
      "created_utc": 1723734631.0,
      "score": 5
    },
    {
      "id": "li8b915",
      "body": "Perfection is boring anyway. True connections are built when two people sense the darkness within each other that they both enjoy",
      "created_utc": 1723725479.0,
      "score": 3
    },
    {
      "id": "lic347t",
      "body": "Did you *see* that guy’s comment?",
      "created_utc": 1723770747.0,
      "score": 1
    },
    {
      "id": "li7d0l6",
      "body": "I believe by posting this here you want to be heard.\nYou yearn for connection interaction. ",
      "created_utc": 1723706177.0,
      "score": 25
    },
    {
      "id": "li8k1ov",
      "body": "Do you want someone to talk to every day ?",
      "created_utc": 1723728831.0,
      "score": 1
    },
    {
      "id": "liovj04",
      "body": "Can you look for meetups? I feel like the friend apps aren’t that great either because you’re not seeing the person face to face, you’re better off looking on Meetup and going to a board game event or seeing if there is a class you want to take to meet others.",
      "created_utc": 1723971163.0,
      "score": 1
    },
    {
      "id": "lic3k4h",
      "body": "Sorry, I read incorrectly, thought you were replying to the guy who thank the \"not to be poetic\" comment. My bad",
      "created_utc": 1723770915.0,
      "score": 2
    },
    {
      "id": "li7d5fu",
      "body": "Oh I do yearn for interaction. I am not denying that at all.",
      "created_utc": 1723706265.0,
      "score": 8
    },
    {
      "id": "li8s1iw",
      "body": "Not even necessarily every day. Just something.",
      "created_utc": 1723731571.0,
      "score": 1
    },
    {
      "id": "lic3nwa",
      "body": "lol no worries no the other guy was having a total meltdown and being verbally abusive to the people who come here for support",
      "created_utc": 1723770956.0,
      "score": 3
    },
    {
      "id": "li7edow",
      "body": "If that is the case, I am willing to openly interact. And if both of us like it, we can foster a connection. Because yes, I care, albeit superficially. That's the abstraction, to care about all regardless. To change the abstract to material, a connection must be made. For that, we must keep faith in our abstractiona because, well, we are stupid humans with small brains",
      "created_utc": 1723707055.0,
      "score": 19
    },
    {
      "id": "li7fjxy",
      "body": "I am nowhere near where I wanted to be and everyday is a torture, another mask another lie.\nMy progress is microscopic, invisible and maybe I made no progress at all (I wrote this in my journal this morning).\n\n\nIt is painful and pointless, life is pain for me, today, yesterday, tomorrow. \n\n\nI spent 22 hour a day inside my room, due to multiple conditions.\nAnd I see very little reason and value to go outside. (I never imagined I would ended up this way).\n\n\nBut I have this vision and dream to move abroad and live my life truly as myself without a mask. Today it's impossible to be myself. \n\n\nOfc I dream of glory and happy ending where I live comfortably, but up until now and my time is ticking it's absolutely not happening in foreseeable future. Idk maybe it would never happen.\n\n\nOur problem may differ but I know the pain and wanting to end all this suffering.\n\n\n\n\nIt is indeed suffering. But a little hope and a dream even if it seems impossible, can help you stay alive.\nI believe you there's hope and dream inside you that you burried.\nI don't think human with this brain with consciousness have no dream or hope.\n\n\n\n\nToday I wrote this, but there are many times where I'm so close to death.\nMy everyday internal monolog consists of wishes to end it all, death, sickness, tragedy, destruction, revenge, to see those who wronged me suffer.",
      "created_utc": 1723707826.0,
      "score": 1
    },
    {
      "id": "li7eldo",
      "body": "Oh I'm all for abstract connections to start with. If I wasn't I wouldnt message people on different sites trying to find something. Anything.",
      "created_utc": 1723707193.0,
      "score": 10
    },
    {
      "id": "li7fqjm",
      "body": "I feel you on that. I'm here for you. To talk or vent or anything",
      "created_utc": 1723707947.0,
      "score": 1
    },
    {
      "id": "li7ex4b",
      "body": "That is indeed a good start. Even whilst you harbour the deepest of resentments and pessimism, you find a way to believe in abstractions of genuine human goodwill, simply because these abstractions do find a place in this vanity of existence\n\nI'd love to help you on a deeper level, stranger. It's hell but maybe it ain't if everyone is in it",
      "created_utc": 1723707408.0,
      "score": 8
    },
    {
      "id": "li7fd48",
      "body": "i just want to say i understand on a deep level. i was really isolated a few years ago and it genuinely was taking a toll on me. im doing better now and i hope the same happens to you. i know we are just strangers but i couldnt help myself from trying to give you any reassurance, even if it means we probably wont see each other later",
      "created_utc": 1723707700.0,
      "score": 3
    },
    {
      "id": "li7f2jh",
      "body": "I do believe in the abstracts. But the issue is that I'm not worth others pursuing more then \"Oh don't do it\" and then disappearing.",
      "created_utc": 1723707508.0,
      "score": 2
    },
    {
      "id": "li7ftmq",
      "body": "Well I have about 6 months to see if things do get better",
      "created_utc": 1723708003.0,
      "score": 1
    }
  ]
}