{
  "id": "1k9zcal",
  "title": "I was raped and he didn’t use a condom and I don’t know what to do and I don’t wanna be here any more (nsfw)",
  "selftext": "This is a bit explicit\n\nI only just turned 16. This happened a few days ago. I was drunk. The whole time I was telling him to stop and I was saying “it hurts” and “can you please stop”. I never consented in the first place. When he pushed me onto the bed and started doing it I was crying and telling him I didn’t want to get pregnant. So to shut me up he put on a condom and told me to be quiet. I was sobbing the whole time and looked down and noticed he took the condom off and I started telling him I didn’t want a kid at 16. He just told me to shut the fuck up and “be a good girl”. I tried telling him that I don’t like doing sexual things with guys because when I was a kid I was sexually abused by a close family friend for a period in my life and he didn’t care and kept going which scared me. I asked him if I can give him head instead because it hurts so much and I was terrified. He said yes but since it was my first time I wasn’t very good and he got annoyed and said I was bad at it and went back to doing what he was doing before and held me down and started choking me. He ending up finishing inside me. Without a condom. The day after I walked to the nearest pharmacy and met my best friend there so I could buy a plan B. When I went home I told my dad what happened and he got mad at me and said he hoped I learned my lesson by being alone with a boy and said I should’ve screamed. Idk why I didn’t, I was just crying and repeating “stop”. So I guess I could’ve done something. But today I’ve been sick and I have been peeing blood and stuff so I think he gave me a disease. I don’t want to go to my dad again. I don’t speak to my mother (not since 2021). Honestly I don’t think life is worth living anymore and I don’t know if I will be here much longer. I’ve never felt like this before. I seriously don’t know what to do. I have always loved life and wanted to live it to the fullest but ever since this I just haven’t felt the same and I’m scared. Im also scared if the plan B doesn’t work because I googled it and there’s a chance it doesn’t work. I don’t want to have a disease or be pregnant. And I don’t know how to move on. I don’t think I will ever get over this. ",
  "created_utc": 1745856524.0,
  "score": 681,
  "num_comments": 121,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1k9zcal/i_was_raped_and_he_didnt_use_a_condom_and_i_dont/",
  "comments": [
    {
      "id": "mpif01x",
      "body": "Get a rape kit done ASAP so they have his DNA. He needs to be locked up. I’m so sorry this happened to you",
      "created_utc": 1745859527.0,
      "score": 617
    },
    {
      "id": "mpib054",
      "body": "this world is so evil sweet girl; i hope you heal and find peace from this horrible experience. just know a whole world of women stand behind you and many understand how you feel right now 😔🩷",
      "created_utc": 1745858364.0,
      "score": 180
    },
    {
      "id": "mpijo47",
      "body": "Go to the ER. Bring the clothes you wore. They'll handle everything, including police and connect you with a support center.\n\n\nGood luck.\n\n\nI see OPs account was deleted. For reference, the best advice is to not eat, drink, brush your teeth, shower, or change your clothes so you have as much DNA proof as possible and go to the ER immediately. They'll handle everything, including police and connect you with a support center. Don't deal with it on your own. It helps no one. Don't let yourself be/stay a victim.",
      "created_utc": 1745860887.0,
      "score": 145
    },
    {
      "id": "mpibd0m",
      "body": "[removed]",
      "created_utc": 1745858472.0,
      "score": 54
    },
    {
      "id": "mpiaxgd",
      "body": "I'm very sorry you experienced this and the people in your life aren't supportive. \n\nSee if you can get tested for STIs at a local clinic, if I'm not mistaken you can start to visit your PCP without a parent starting age 12. \n\nAnd if you're afraid about the Plan B not working there's: https://www.plancpills.org/",
      "created_utc": 1745858342.0,
      "score": 47
    },
    {
      "id": "mpi6jv9",
      "body": "[deleted]",
      "created_utc": 1745857046.0,
      "score": 133
    },
    {
      "id": "mpia9xi",
      "body": "[removed]",
      "created_utc": 1745858151.0,
      "score": 89
    },
    {
      "id": "mpiklbx",
      "body": "Your dad's reaction is garbage, it is in no way your fault and saying no in any form is enough. I've had similar things happen to me, so I understand, but you can and will get through this. It'll be hard pared with a lot of denial and self blame, but you will overcome this, and know that this is 100% not your fault. \n\nSTDs are pretty hard to get from a one time encounter, so you should be fine, and plan B is overall pretty effective if taken quickly, which you did. I understand you not wanting to report it but having a kit on file would help a lot if you change your mind in the future. I and many people stand with you and are on your side in this, you'll be ok with time.",
      "created_utc": 1745861151.0,
      "score": 41
    },
    {
      "id": "mpibgdd",
      "body": "This world fucking sucks. I'm so sorry this happened to you love, I wish the best for you :)",
      "created_utc": 1745858499.0,
      "score": 15
    },
    {
      "id": "mpishxk",
      "body": "Get a rape kit. That asshole deserves to go to jail",
      "created_utc": 1745863429.0,
      "score": 14
    },
    {
      "id": "mpi9tsy",
      "body": "Omg I’m so sorry. Just know it was NOT your fault this happened, especially since you were drunk. Your sense of judgement was impaired and people shouldn’t blame others for being alone with another man. Many have experienced this even with people they trusted or family members. You can’t predict this happening, even if it was a woman\n\nMany people don’t scream during it in fear that they will get hurt or killed, or their body just freezes up. Your father was a piece of shit to tell you it was your fault like that, please start seeing a school counselor as soon as possible for this. Trauma is not an easy thing to go through alone, and I wish you well",
      "created_utc": 1745858018.0,
      "score": 29
    },
    {
      "id": "mpiav38",
      "body": "I'm really sorry this happened to you...about a week ago something similar happened to me but it was my bf. im still upset w myself for not trying to do more to prevent it.\n\nKeep your head up and stay safe love 🤍",
      "created_utc": 1745858323.0,
      "score": 12
    },
    {
      "id": "mpicbnk",
      "body": "Hey, I'm sorry this happened to you and by no means is it your fault. I would consider going to the police I know it's alot but they have officers that are specialised in this sort of thing, they will get you counselling, they will get you help to make sure you don't have any stds and also they will get you help to make sure that piece of 💩 doesnt do it to anyone again and also to get justice for you.\n\nIf you can't do that please see a female doctor and explain what happened. There are so many places available to help you just know you did absolutely nothing wrong and your not alone. ❤️",
      "created_utc": 1745858754.0,
      "score": 10
    },
    {
      "id": "mpi8sa7",
      "body": "I am sorry to learn about your situation. The way your dad handled you being honest with him is also inappropriate, and it sounds a lot like he's victim blaming.\n\nDo you have a trusted adult you can speak to, like a teacher or an extended family member?",
      "created_utc": 1745857710.0,
      "score": 9
    },
    {
      "id": "mpij2pj",
      "body": "This is a serious situation not normal you truly need to report this we're rooting for you and I'm soo sorry like hella fucking sorry this is not good and you deserve help support care and love and your family have failed instead and you're not alone",
      "created_utc": 1745860717.0,
      "score": 8
    },
    {
      "id": "mpj0adm",
      "body": "Im extremely sorry for that. I'm 16 and I am just pissed off that someone can do that. Especially to ppl our age and shit. I wish the absolute worst on that guy. Now this fucks with me. I couldn't fathom how serial killers could do it and now that I've witnessed a first hand account I have a whole different perspective on the evil ass people. Wish that hadn't happened to you.",
      "created_utc": 1745865756.0,
      "score": 7
    },
    {
      "id": "mpjf14w",
      "body": "I wish I had any advice to give, but I don't. I'm so, so sorry you went through that. You didn't deserve that and know many rape victims don't scream. It's fight, flight, and FREEZE. I know it's easy to look back and judge yourself for not \"fighting back enough\" as if you weren't in panic mode, going off instinct to survive. The guy who did that to you deserves to rot in hell and I hope he gets his comeuppance. It's scary reporting it and I'm not going to try and pressure you to. It's terrifying to open up about something so horrific and something men often blame women for. Whatever you choose to do, I support you. Again, sorry I don't have any tangible advice, but I hope support at least helps a bit.",
      "created_utc": 1745870219.0,
      "score": 7
    },
    {
      "id": "mpiew8t",
      "body": "Horrible human being that guy is inhumane and deserves to spend life in prison. I hate people who’s objectify people like that they don’t deserve to be called human. I’m really sorry you had to go through that hope things get better for you.\n\nPlease report this peice of shit and try and get legal action or smth. Your the same age as me and were so young I can’t imagine how your feeling right now. Please get this sack of shit what he deserves and ensure you tell your parents and law enforcement.",
      "created_utc": 1745859496.0,
      "score": 5
    },
    {
      "id": "mpidiyc",
      "body": "Please report to the police, not only to get a fair revenge on this motherfucker, but also to avoid him doing that repeatedly to other vulnerable persons.\n\nYou will find the right support, I am sure. You don't deserve what happened to you, and you are not guilty.\nYour dad is also confused and probably didn't know any better.\n\nReport and get this motherfucker shamed and persecuted.\n\nI am not sure in which country you are from, but you might want to visit a doctor and talk with him, you can do a std screening after some time and make sure everything is ok on that side.\n\nSorry again, if you need some advice, I am happy to help you.",
      "created_utc": 1745859104.0,
      "score": 4
    },
    {
      "id": "mpik5bx",
      "body": "Something similar happened to me but I was on pain killers for my back I had just broken and a \"friend\" I thought I could trust to help me did the same when I was 16. Please get a rape kit done. This man went on to become a convicted trafficker.",
      "created_utc": 1745861024.0,
      "score": 3
    },
    {
      "id": "mpj65qj",
      "body": "please take care",
      "created_utc": 1745867515.0,
      "score": 3
    },
    {
      "id": "mpja39r",
      "body": "I'm so sorry girl, none of this is your fault. Please seek justice.",
      "created_utc": 1745868715.0,
      "score": 5
    },
    {
      "id": "mpjo7g2",
      "body": "I’m sorry that happened. I don’t know what to say to get you to stay but please don’t go.",
      "created_utc": 1745872955.0,
      "score": 4
    },
    {
      "id": "mpjxjxf",
      "body": "Oh baby I’m so sorry 💔 I promise you’re not alone. I myself am a CSA victim and went through a lot of that, and it’s hard, it really is. But at the end of the day, you’ll start to look at your future more, find people who treat you right, and discover what you love. It’s a hard road but I promise it will get better, you just need to hold on.",
      "created_utc": 1745875859.0,
      "score": 4
    },
    {
      "id": "mpldubg",
      "body": "I hope that f**ker gets k!lled.",
      "created_utc": 1745893983.0,
      "score": 5
    },
    {
      "id": "mpi8b7m",
      "body": "Ok so first of all if you took plan B you’re not pregnant get that out of your head.\n\nSecond it’s normal for you to have some injuries so peeing blood might be ok, give it a day to see if it gets better\n\nHave you reported this to the authorities? I guess depending on where you’re from it might be hard…\n\nIt won’t be easy leading with rape but please check for assistance and help lines in your country, I’m here if you need to talk by the way. You will have a road ahead of you on dealing with this, but the good news is that you will be able to move on eventually. Your dad’s reaction is not normal at all, he probably doesn’t think you were really raped, and it’s possible some people won’t believe you but unfortunately society is like that. You have a lot to live for, a lot of good people to meet and to show that you’re strong. Again I’m here if you need to talk",
      "created_utc": 1745857570.0,
      "score": 7
    },
    {
      "id": "mpi6z59",
      "body": "I went through the same thing exept I'm a boy it was a girl and I was 6",
      "created_utc": 1745857172.0,
      "score": 7
    },
    {
      "id": "mpid7tb",
      "body": "Hospital or Planned Parenthood should be able to help you with post sexual assault STI prophylactic care.  They’ll give you some pills you take that prevent HIV and pregnancy. I don’t remember all I was given but they take care of all that. You don’t need to consent to a rape kit so timing shouldn’t be an issue if you get there within the week of the assault I believe. I’m so sorry sweetie, it’s normal I think to feel this way after. I know I did. It doesn’t last forever though - this part doesn’t last forever. You don’t think that way in the moment. But it’s true. There’s also free counseling through RAINN. Sending you love and hope",
      "created_utc": 1745859014.0,
      "score": 3
    },
    {
      "id": "mpifr4q",
      "body": "i’m so sorry…it’s not your fault.",
      "created_utc": 1745859745.0,
      "score": 3
    },
    {
      "id": "mpihhqz",
      "body": "hey love, first i just wanna say i'm so fucking sorry this has happened to you, i know there must be so much going on in your mind. this is something you have to take one day at a time, it's not something to magically get over right away. it will take time and it will be a journey but you're already doing a good job. \n\ntaking that plan B was a good first step, and having your friend with you for support was a good idea. if your friend is willing to support you through this, it might make the next steps easier. any kind of support will help. if your friend can go with you to get a kit done, that might help take the pressure off and i think it would be good for you, but it's very important you get is done as soon as possible, please, within the next couple days if you can. his DNA is very likely to still be in you. unfortunately if you've showered or may wash some of it away, but there's still a chance they can get some of it. sperm can survive in a body for up to five days, so again, getting a kit done and reporting it ASAP is very important. i know it will be hard, but doing it sooner rather than later will make it easier in the long run to make a report so hopefully this piece of shit will be caught. if there's any way you can get access to the bedding you were on for DNA that might help too, but i don't know where you guys were so maybe that's not possible. \n\nif there's any statements from anybody that may link him to this crime that's good to have too. u said his best friend said something about how he got punched because of something he's done before, if there's any way to get in contact with people who will help u form a story better, and anything about his past actions from other word of mouth or even confessions from another possible victim, that should help. \n\nagain honey I'm so sorry you're having to deal with this, please surround yourself with people you trust, try to hang out with your friend and make sure you're feeding yourself and drinking water. ask your friend to go with you to get the kit done and please report this, this menace will do something like this again. i know it will be an exhausting process, but you don't have to go through it alone",
      "created_utc": 1745860256.0,
      "score": 3
    },
    {
      "id": "mpkhpne",
      "body": "i don’t know how to help and i don’t know what to say and probably shouldn’t say anything at all. except that your are strong and brave and it was not your fault that some people in this world are pure vile monsters. but you are a beautiful human that deserves the happiest of lives.",
      "created_utc": 1745882733.0,
      "score": 3
    },
    {
      "id": "mpmrd8z",
      "body": "Don't take a shower, go straight to the ER, tell them all what happened, don't go to the cops,",
      "created_utc": 1745919479.0,
      "score": 3
    },
    {
      "id": "mpnvjfy",
      "body": "Go to the police/ER/any public service ASAP, that person deserves get it's shit beat out in jail. Please, please do not harm yourself.",
      "created_utc": 1745936130.0,
      "score": 3
    },
    {
      "id": "mpp5mgg",
      "body": "Your dad is a piece of shit for blaming you. It wasn't your fault at all and i hope the rapist gets his dick chopped off.",
      "created_utc": 1745949448.0,
      "score": 3
    },
    {
      "id": "mqf3shd",
      "body": "That just made me so mad 😡 \nWho says that to their own daughter ?!",
      "created_utc": 1746300057.0,
      "score": 3
    },
    {
      "id": "mpiayqs",
      "body": "I’m sorry this happened to you and I understand how scary this is. Yes Plan B doesn’t always work but good at the time it does and I would maybe talk to your dad or just talk to someone if you can get into the therapist because this was truly traumatic to go through and I think that talking about it with someone in person might really help you. It’s a long path to get to the healing phase. His feelings are completely normal in the circumstances cause he’s away. Just remember you are still important. He has not ripped any importance away from you as a person. You matter.",
      "created_utc": 1745858353.0,
      "score": 2
    },
    {
      "id": "mpkvsp0",
      "body": "I'm so sorry you didn't deserve that...",
      "created_utc": 1745887618.0,
      "score": 2
    },
    {
      "id": "mplpn6k",
      "body": "I'm sorry this happened to you and please know it wasn't your fault or anything you did to deserve this. That person is evil. When you feel ready i would report this to your school or the police so there's a chance he can be held accountable and it doesn't happen to someone else. Your dad placed so much blame on you so i need to reiterate this was not your fault. You don't deserve to be told what you should have done while being assaulted, especially by your father, a man who should be protecting you and fighting for you. \n\nyour history of sexual abuse adds another layer of trauma to this already traumatic and horrific event. I really hope if you have the accessibility to get a therapist or help unpacking this with a professional (school counselor, community mental heath center, outpatient therapist).  \n\nplease see a doctor/obgyn if you have one to report this and the symptoms you're having. there are options to manage any outcome here. most importantly reach out for professional support from a trusted adult like a counselor/coach/teacher so someone knows what you're going through. \n\nabove all please stay. your pain and anguish right now is valid. when you've been assaulted like this it takes a piece of your heart and soul. give yourself some time to process this. there is a light at the end of the tunnel and some trauma we never truly get over but we do learn to live with it and manage to be able to find joy again. you deserve to feel joy again! all love",
      "created_utc": 1745898489.0,
      "score": 2
    },
    {
      "id": "mpneohj",
      "body": "please, tell somebody. i think the best option is going to the ER or telling the police. i promise you, you will feel so much better, they will check on your symptoms and make sure your okay, and they will have that rapist arrested. stay strong, this makes me super emotional because i’m only a year younger and i cannot even imagine this, you’re so so strong.",
      "created_utc": 1745930496.0,
      "score": 2
    },
    {
      "id": "mppxr3h",
      "body": "Sweet girl. I just want you to know this ain’t your fault. I’m so sorry this happened to you.",
      "created_utc": 1745957564.0,
      "score": 2
    },
    {
      "id": "mpq1z54",
      "body": "Just know not all guys are like that. I’m so so sorry you had to go through that. I pray you can heal with time and the man who did this to you gets justice delivered to him. I’ll be praying for you",
      "created_utc": 1745958760.0,
      "score": 2
    },
    {
      "id": "mpqpg5t",
      "body": "Please please please do a rape kit. I’m so sorry this is horrible :((",
      "created_utc": 1745965946.0,
      "score": 2
    },
    {
      "id": "mpk55ap",
      "body": "This triggered me so bad oh god. I experienced something similar when I was 17. The only difference was I wasn't drunk, he was and he raped me from behind. The things you said were the same as what I told him while he was doing it. I cried, begged him to stop, told him it hurt. It was like I was talking to a wall. I didn't need to worry about pregnancy but it bled for days and I couldn't tell anyone. To this day I only talk about it in places like reddit. I hate the fact that your dad told you those things. Do they really think screaming or fighting works? Anyways, I know it's cheesy to say but I assure you, it'll get better. I am 25 now, attempted several times, obviously wasn't successful. Dying is harder than moving on, trust me. I still get triggered when someone holds me a certain way, or say certain things. But I keep telling myself that letting it affect me means letting him win, it sort of works. It always sticks to you but after a while you'll stop thinking about it as much. Don't let that fucking rapist win",
      "created_utc": 1745878433.0,
      "score": 3
    },
    {
      "id": "mpjaxq8",
      "body": "[removed]",
      "created_utc": 1745868976.0,
      "score": 2
    },
    {
      "id": "mpls5sc",
      "body": "This is not your fault at all, please go to the ER and they will be able to help you. Take care",
      "created_utc": 1745899560.0,
      "score": 1
    },
    {
      "id": "mpmc419",
      "body": "I am sorry that you have to go through this. What was done to you was awful, and while it would be beneficial to hold the perpetrator accountable, your safety and well-being are most important right now. Are you comfortable reaching out to any of the suicide hotlines listed in the resource page? You might benefit further from trained assistance and if you're not comfortable going in to the best hospital, this could be your next best option.",
      "created_utc": 1745909731.0,
      "score": 1
    },
    {
      "id": "mpnouml",
      "body": "Holy shit, cut this monsters dick off…. Wth is wrong with some people… I wish you so much love and strength going through this. I hope you can find support ❤️",
      "created_utc": 1745934019.0,
      "score": 1
    },
    {
      "id": "mpp22pv",
      "body": "I'm so fucking that it happened to you, I truly hope this disgusting asshole will be locked up soon enough and rot there. I'm sending you a big hug, it's not your fault, you did nothing wrong and mostly you don't have to keep it to yourself. I'm there if you need to vent. \n\n\nMuch love and sorry once again.",
      "created_utc": 1745948466.0,
      "score": 1
    },
    {
      "id": "mpppcmf",
      "body": "Report him to the police go to ER for rape kit. No none of this was your fault at all. You didn’t deserve it and you didn’t know.",
      "created_utc": 1745955167.0,
      "score": 1
    },
    {
      "id": "mpqt9zl",
      "body": "Pls don’t leave this world, yes it’s full of cruel ppl, but also full of supportive ppl. Reach out to survivors groups, and more than anything ignore what ur dad was telling u! He’s an ignorant, heartless man for screaming at u, and u deserve so much more love than he can give. You are not alone and there are so many people who will help and support you (ps, pls go the hospital, and get yourself checked out—and know that there is no shame in going and there is no shame is being afraid, and just know none of this, and I mean none, is your fault)",
      "created_utc": 1745967212.0,
      "score": 1
    },
    {
      "id": "mpw46aa",
      "body": "Go to the ER immediately. They'll get you a rape kit and also some emergency contraception.",
      "created_utc": 1746040710.0,
      "score": 1
    },
    {
      "id": "mpx43pq",
      "body": "Oh dear I’m so so sorry. This breaks my heart. I wish you all the healing in the world. Your dad is scum for that reaction, you did absolutely nothing wrong as many have already said here. Sending you so much love 😕🩷",
      "created_utc": 1746051446.0,
      "score": 1
    },
    {
      "id": "mpxliv1",
      "body": "Please don't let the bastard win. Stay alive. Fight back. One day, you will realize you are special and someone else will know that as well. Maybe a dog will notice that first. Or an old friend. \n\nJust don't let the bastard win.",
      "created_utc": 1746057313.0,
      "score": 1
    },
    {
      "id": "mpy0a1a",
      "body": "Go to the ER. Your life is still worth living! Nothing has changed in that regard. Please keep us posted. We are ALL rooting for you! A lot of people have been in your shoes (or similar) and have persevered. You can too!",
      "created_utc": 1746062416.0,
      "score": 1
    },
    {
      "id": "mq18854",
      "body": "tell the police and go to the doctors to get the dna checked so they find that idiot and put him behind bars i wish for life. ",
      "created_utc": 1746113443.0,
      "score": 1
    },
    {
      "id": "mq68tx8",
      "body": "Holy shit.. I am so sorry for my dad kinda people.",
      "created_utc": 1746181946.0,
      "score": 1
    },
    {
      "id": "mqaehhw",
      "body": "I’m so sorry. If you ever need to talk…",
      "created_utc": 1746229843.0,
      "score": 1
    },
    {
      "id": "mqh0z9n",
      "body": "I’m so incredibly sorry for what happened to you. I know this is going to be hard, really hard, but if you have the strength, please report it.\n\nI know the community has its rules, but I need to say this: this is not the end of the world. It might feel like it, for a long time, but it’s not. It’s going to hurt for a long time, maybe even feel endless, but eventually, it’ll become a distant memory you only revisit sometimes.\n\nI won’t tell you it gets better, because for some of us, it doesn’t. But this doesn’t have to be the end.\n\nWhen it happened to me, I wish I had reported it. I regret not doing it. But he paid for it anyway,  and honestly, it was so damn satisfying. You deserved to see him pay too. You can’t let that bastard win.",
      "created_utc": 1746325114.0,
      "score": 1
    },
    {
      "id": "mqj52u0",
      "body": "Im so sorry",
      "created_utc": 1746364592.0,
      "score": 1
    },
    {
      "id": "mqkr8yc",
      "body": "Just enjoy. You got free hard on and didn't even need to pay for it like most women",
      "created_utc": 1746382939.0,
      "score": 1
    },
    {
      "id": "mtwdjez",
      "body": "Hey, whatever might or might not happen in the immediate future - a possible (but not likely) pregnancy, a disease - it’s all solvable. It will just turn into a chapter in your life. One bad thing in a timeline of many things, some of which will be okay and some of which will be amazing. \nAs far as I can understand, your dad is very bad with victim blaming, but he probably won’t let you keep an unwanted pregnancy or abandon you if you require medical treatment, right? And if that fails, teach out to girlfriends and try to spend as much time as possible with them and process. Perhaps you could find more compassion in friend’s mothers, women standing for each other. Right now it feels like the world is crumbling upon you, but this is not the whole world, just a chapter.\nSo sorry this happened to you. i experienced something similar when I was 16. I wanted to wash myself for eternity until I scrub him off. It passed, and I survived. Couldn’t find support in parents then, but time made it’s thing and I met new people I could confide in, moved away from home (to random temporary arrangements first, to solid apartments later). 15 years later, it’s just a story, a painful one, but a story, and each year I’m living feels better than the previous ones. This too shall pass. 🖤",
      "created_utc": 1748032349.0,
      "score": 1
    },
    {
      "id": "mtxg424",
      "body": "Medical abortion doesn't too hurt",
      "created_utc": 1748045462.0,
      "score": 1
    },
    {
      "id": "mpivtuf",
      "body": "[removed]",
      "created_utc": 1745864422.0,
      "score": -1
    },
    {
      "id": "mqkuoon",
      "body": "if you want to do just do easily.",
      "created_utc": 1746383997.0,
      "score": 0
    },
    {
      "id": "mpkunb8",
      "body": "This… please..",
      "created_utc": 1745887216.0,
      "score": 84
    },
    {
      "id": "mqj52es",
      "body": "this!!!",
      "created_utc": 1746364587.0,
      "score": 1
    },
    {
      "id": "mqpic5q",
      "body": "I know it may seem like the right thing to do I thought the same thing but nothing came of it in a similar situation and it was deeply traumatizing. Just if you choose to do this proceed  knowing justice is rare ",
      "created_utc": 1746453638.0,
      "score": 1
    },
    {
      "id": "mpibuhr",
      "body": "Thank you so much it means a lot I appreciate it 💕",
      "created_utc": 1745858614.0,
      "score": 11
    },
    {
      "id": "mpi7f3n",
      "body": "It really is evil and thank you 💕",
      "created_utc": 1745857305.0,
      "score": 10
    },
    {
      "id": "mpiakui",
      "body": "I might report later for that reason because my best friend was talking to his best friend and his best friend said he “got punched for doing something to a girl”. So I guess it’s not his first time. I’ve heard the process is really hard though so I’m not sure",
      "created_utc": 1745858240.0,
      "score": 10
    },
    {
      "id": "mpnpgbp",
      "body": "Hope it will be your ex then.. boundaries are to be respected and protected",
      "created_utc": 1745934216.0,
      "score": 3
    },
    {
      "id": "mpi9lzn",
      "body": "Thank you so much. 💞 I don’t think I will report (at least for a while) because it’s a really hard process I think and I hope he didn’t give me an STD or anything like that . Your comment means a lot",
      "created_utc": 1745857953.0,
      "score": 2
    },
    {
      "id": "mpi7cca",
      "body": "It’s not your fault I hope you know that and I hope u can heal from this I know that it’s hard but I hope you will get through the trauma :(",
      "created_utc": 1745857282.0,
      "score": 2
    },
    {
      "id": "mpi7lmp",
      "body": "[deleted]",
      "created_utc": 1745857359.0,
      "score": 17
    },
    {
      "id": "mpib06t",
      "body": "[removed]",
      "created_utc": 1745858365.0,
      "score": 42
    },
    {
      "id": "mpib2x9",
      "body": "It’s important to get a rape kit test done as soon as possible. Especially if you’re showing signs of bruising around the neck where he choked you and bleeding",
      "created_utc": 1745858388.0,
      "score": 11
    },
    {
      "id": "mpif50h",
      "body": "Although it's understandable you don't want to report immediately you absolutely should, you don't want to report later and the lack of DNA evidence ends up vindicating him as \"not guilty\" in front of you and a trial of your peers due to a lack of evidence. I'm sure it's hard and you should do what you believe is best for yourself as your going through so much right now, but like others have urged here PLEASE do a rape kit ASAP, it's paramount to proving these sorts of cases, prevent him from being able to do this to other vounerable women and make him face the consequences of his crime. None of this is your fault, but the buck can stop here",
      "created_utc": 1745859567.0,
      "score": 8
    },
    {
      "id": "mpi7yeb",
      "body": "Thank you it means a lot 💓 guys are scary",
      "created_utc": 1745857465.0,
      "score": 3
    },
    {
      "id": "mpic54v",
      "body": "This. Please get the kit done asap, the sooner the better. They would also test for any possible STDs and would be able to provide medical treatment if necessary. It would also get him locked up sooner, especially if he repeats and they report it as well. Men like this are repeating offenders, and they will do it again to someone else",
      "created_utc": 1745858701.0,
      "score": 25
    },
    {
      "id": "mpi843j",
      "body": "[deleted]",
      "created_utc": 1745857513.0,
      "score": -20
    },
    {
      "id": "mpkokac",
      "body": "[What's wrong with \"It Gets Better\"? What if it doesn't? : r/SuicideWatch](https://www.reddit.com/r/SuicideWatch/comments/25igd7/whats_wrong_with_it_gets_better_what_if_it_doesnt/)\n\nRead this bro",
      "created_utc": 1745885085.0,
      "score": 6
    },
    {
      "id": "mpi9a9u",
      "body": "Thank you and maybe I will who knows",
      "created_utc": 1745857856.0,
      "score": 5
    },
    {
      "id": "mpiadzl",
      "body": "[deleted]",
      "created_utc": 1745858184.0,
      "score": -18
    },
    {
      "id": "mpj1y4e",
      "body": "Not appropriate right now, dude.",
      "created_utc": 1745866251.0,
      "score": 39
    },
    {
      "id": "mpj4ozd",
      "body": "[deleted]",
      "created_utc": 1745867073.0,
      "score": -11
    },
    {
      "id": "mplf9qi",
      "body": "trying to make men look good is not the thing to do now.",
      "created_utc": 1745894510.0,
      "score": 11
    },
    {
      "id": "mpji2h0",
      "body": "What you are displaying is NOT empathy.\n\n\nSomeone is hurting and your response was, \"not all men,\" so I'm guessing you're part of the problem.\n\n\nYou aren't a white knight. You're a creep.",
      "created_utc": 1745871133.0,
      "score": 24
    }
  ]
}