{
  "id": "1g6p1r5",
  "title": "\"Help is Available\" = Please continue to work a shitty 9-5 job, slaving, living paycheque to paycheque, paying us taxes, being depressed. \"We care so much about you :D\"",
  "selftext": "\"Go speak to someone\" = Go PAY someone to pretend to give a shit about your feelings and give you advice they learned from some asshat at school who thinks they know how to help depressed people.  \nIts all about fucking money. Not a SINGLE person gives a shit about you besides your parents. And BOO FUCKING HOO of course my parents are gonna cry when I kill myself Why the FUCK would I live this miserable existance to please them.",
  "created_utc": 1729275885.0,
  "score": 888,
  "num_comments": 74,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1g6p1r5/help_is_available_please_continue_to_work_a/",
  "comments": [
    {
      "id": "lslrdok",
      "body": "This is so true and it makes me so angry. I used to never feel good talking to my therapist because I knew deep down that she only cared because I was paying her. Oh well, now I can't afford it so 🤷‍♀️",
      "created_utc": 1729292617.0,
      "score": 101
    },
    {
      "id": "lsm7ktw",
      "body": "They will tell you something is wrong with you for being suicidal in the hellhole system they created, and push meds on you that fuck with your brain.",
      "created_utc": 1729298905.0,
      "score": 64
    },
    {
      "id": "lskkedp",
      "body": "Nah man even parents don’t give a fuck about their kids",
      "created_utc": 1729277902.0,
      "score": 69
    },
    {
      "id": "lso83gl",
      "body": "People only \"care\" when you're dead. Nobody gives a shit while you're suffering or asking for help.",
      "created_utc": 1729338839.0,
      "score": 30
    },
    {
      "id": "lsmnupm",
      "body": "I tried calling the suicide hotline once and nobody answered lol",
      "created_utc": 1729305655.0,
      "score": 26
    },
    {
      "id": "lsmfrdg",
      "body": "[deleted]",
      "created_utc": 1729302248.0,
      "score": 21
    },
    {
      "id": "lslrae0",
      "body": "Sadomasochism is an ideology",
      "created_utc": 1729292583.0,
      "score": 12
    },
    {
      "id": "lso5reu",
      "body": "In the end it's only about the money and the benefits",
      "created_utc": 1729337625.0,
      "score": 10
    },
    {
      "id": "lsm1lor",
      "body": "😥 feel exactly like this and everything just seems meaningless",
      "created_utc": 1729296553.0,
      "score": 9
    },
    {
      "id": "lsklq72",
      "body": "Hey, I want you to know that this actually talked me out of it. I couldn't have said it better myself and I started thinking of something encouraging to say to you and in so doing accidentally said what I needed to hear myself, which is this:\n\nDo not let the bastards win. Fight.",
      "created_utc": 1729278334.0,
      "score": 57
    },
    {
      "id": "lsp366c",
      "body": "And get this? Some peoples parents don't even give a f*ck?(like mine)",
      "created_utc": 1729351310.0,
      "score": 9
    },
    {
      "id": "lsq24ya",
      "body": "Yep.\n\n“You must live at all costs!!”\n\n“What for?”\n\n“Uuuuhhhh…. Hey, flowers and birds are nice aren’t they?!”",
      "created_utc": 1729362953.0,
      "score": 9
    },
    {
      "id": "lsnp753",
      "body": "In many many many cases not even your “parents” The most abusive person I have ever had the misfortune of dealing with is the egg donor",
      "created_utc": 1729327162.0,
      "score": 7
    },
    {
      "id": "lslnceb",
      "body": "hey man it's not right, but how else than they benefit so much off of others 🤷‍♀️",
      "created_utc": 1729291106.0,
      "score": 6
    },
    {
      "id": "ltc6rht",
      "body": "These days it’s not even “9-5” anymore, it’s “8-5”, because corporations can’t pay you to sit on your ass for *gasp* a whole hour. \n\nThings continue to get worse and life is quickly running out of reasons to continue. Everything is getting shittier in terms of quality and there is literally no hope in sight. \n\nBut hey! At least the solution is money!\n\n…which nobody can get because prices continue to go up while wages stay exactly the same as 10 goddamn years ago.",
      "created_utc": 1729690007.0,
      "score": 3
    },
    {
      "id": "lsllc9o",
      "body": "Do you want things to be different?",
      "created_utc": 1729290357.0,
      "score": 3
    },
    {
      "id": "lslqbfr",
      "body": "I feel ya. That’s how I feel alot of the time.",
      "created_utc": 1729292218.0,
      "score": 3
    },
    {
      "id": "lsm5m02",
      "body": "I feel the same way.",
      "created_utc": 1729298121.0,
      "score": 3
    },
    {
      "id": "lspue0d",
      "body": "I know- nobody cares 😢",
      "created_utc": 1729360411.0,
      "score": 3
    },
    {
      "id": "lspwr94",
      "body": "I tried to call the suicide crisisline once and got hung up on TWICE because the crisisline counselor found out I was in China which is outside of the service range.",
      "created_utc": 1729361195.0,
      "score": 3
    },
    {
      "id": "ltibfis",
      "body": "You’re not alone.\n\nI know it doesn’t really help, but maybe it gives you a bit of strength knowing others are feeling similar.\n\nTry to stay strong friend.",
      "created_utc": 1729776219.0,
      "score": 3
    },
    {
      "id": "lvooair",
      "body": "They need us because they need manpower to work. \n\nThey gaslight us into making us think that we're useless to society for not giving in to capitalist demands. When in reality, there are lots of things that we could do for society like sweeping the floor, recycling, planting trees, caring for animals and the poor, and whatnot. But those that I've mentioned aren't enough to make a living.\n\nIt's like you're a useless piece of shit in this world if you won't contribute to mindless production of this shitty consumerist world that we've created which is run by narcissists and greedy assholes. \n\nThey would shame you for ending your life. E.g. \"You're too weak!\" if you decided to when in reality, it's just fucking draining at this point.\n\nThose wellness coaches, psychologists, psychiatrists, etc. aren't that helpful either. Besides, you'll have to spend money for a psychiatric session just for them to tell you what meds to drink which still cost a lot.",
      "created_utc": 1730888880.0,
      "score": 3
    },
    {
      "id": "lslu21l",
      "body": "The only thing that actually matters, that's real, is work, is the things people physically do to keep everything working. It doesn't matter how happy people are, it matters whether or not they can work.",
      "created_utc": 1729293633.0,
      "score": 5
    },
    {
      "id": "lsn6w3z",
      "body": "Depression is a lot of work. And I feel your pain.",
      "created_utc": 1729314997.0,
      "score": 2
    },
    {
      "id": "lsnose2",
      "body": "This is how I think as well",
      "created_utc": 1729326873.0,
      "score": 2
    },
    {
      "id": "lsnvh4t",
      "body": "True but sometimes they help you in stopping your brain from torturing you.",
      "created_utc": 1729331463.0,
      "score": 2
    },
    {
      "id": "lspuhjf",
      "body": "Sometimes I just wanna live alone on an abandonned island. but not everything is possible, there's always gonna be someone that's gonna try and stop you, while ignoring the reasons. I'm sick of it",
      "created_utc": 1729360444.0,
      "score": 2
    },
    {
      "id": "lsmz39i",
      "body": "Parents have control now but there will be a time they will beg for u -it can be abt anything but I swear that’s the only thing driving me to stay- they will come for money an forgiveness cause they are so lonely cause they don’t believe in friendship other thank for financial or emergency reasons 🙄",
      "created_utc": 1729310763.0,
      "score": 1
    },
    {
      "id": "lsmivci",
      "body": "sometimes i have to think really hard about why someone would want to monetize their compassion",
      "created_utc": 1729303538.0,
      "score": 40
    },
    {
      "id": "lsmmqya",
      "body": "Agree 👍, depresso meds fuck with your brain and you dont know what youre taking will be beneficial or have negative effects.",
      "created_utc": 1729305181.0,
      "score": 13
    },
    {
      "id": "lsnopcv",
      "body": "[removed]",
      "created_utc": 1729326814.0,
      "score": 20
    },
    {
      "id": "ltaizhr",
      "body": "I want to die and Im going to regardless (cancer)  sweet deal.\n\n\n \nIm not brave so it would all just have hurt worse, (I take tons of meds)\n\n\n  Im sorry I didnt want to bother you.",
      "created_utc": 1729657083.0,
      "score": 3
    },
    {
      "id": "ltj3njd",
      "body": "I think there is nuance to it, but capitalism definitely doesn't help people who aren't in top something of the richest people, especially these with mental scars",
      "created_utc": 1729785219.0,
      "score": 2
    },
    {
      "id": "lsnwfel",
      "body": "My parents pick their religion over me all the time",
      "created_utc": 1729332091.0,
      "score": 11
    },
    {
      "id": "lsp5g4q",
      "body": "for real. Ima be turning in my grave when all those fake fucks show up to my funeral crying. NONE of them gave a shit while i was suffering.",
      "created_utc": 1729352093.0,
      "score": 12
    },
    {
      "id": "lsp3n49",
      "body": "Wow wtf",
      "created_utc": 1729351471.0,
      "score": 3
    },
    {
      "id": "ltj3x4b",
      "body": "I'm so sorry for how horrible your parents are, i get it",
      "created_utc": 1729785298.0,
      "score": 2
    },
    {
      "id": "lsmmnib",
      "body": "We feel its meaningless because in fact it is meaningless",
      "created_utc": 1729305140.0,
      "score": 7
    },
    {
      "id": "lslnck9",
      "body": "They won the day they forced me into this world.\n\n\nThey keep winning the longer I live, thus am forced to work for them.",
      "created_utc": 1729291108.0,
      "score": 45
    },
    {
      "id": "lskndnm",
      "body": "If you continue to fight you let win them, because they need their slaves to stay alive as long as possible.",
      "created_utc": 1729278874.0,
      "score": 46
    },
    {
      "id": "lsl4c1u",
      "body": "Tragic Optimism\n\nSomeone to love\n\nSomething to fight for\n\nAnd work that matters to you",
      "created_utc": 1729284416.0,
      "score": 12
    },
    {
      "id": "lskobf2",
      "body": "The world is too strong.. I was into the warrior mindset but they're all too strong and evil",
      "created_utc": 1729279179.0,
      "score": 18
    },
    {
      "id": "lsm3gl7",
      "body": "For what it's worth, I'm glad you were talked out of it. You have more life to live.",
      "created_utc": 1729297274.0,
      "score": 9
    },
    {
      "id": "lsmho59",
      "body": "fight!",
      "created_utc": 1729303042.0,
      "score": 1
    },
    {
      "id": "lsm5hyc",
      "body": "Yes",
      "created_utc": 1729298077.0,
      "score": 12
    },
    {
      "id": "ltin401",
      "body": "Thank you I appreciate it",
      "created_utc": 1729780161.0,
      "score": 3
    },
    {
      "id": "lsnmd9m",
      "body": "We do care. But we’re unfortunately forced to live in the same capitalist nightmare as everyone else - we need to make money to live. But most people that work in mental health don’t make a whole lot… we don’t get into it for the money. Majority of us get into that line of work because we’ve been where you are… some of us are still there, too. \n\nThere’s bad therapists and counsellors, of course. Like with any other profession. But please believe, we do care. We celebrate your victories, we cry for your pain. You stay in our minds long after our appointment ends. We truly, sincerely want you to be happy and have the life you deserve.",
      "created_utc": 1729325169.0,
      "score": 31
    },
    {
      "id": "lsmmt2k",
      "body": "It effed me up, i cant cry anymore stopped taking them 6 months ago",
      "created_utc": 1729305207.0,
      "score": 9
    },
    {
      "id": "lso6qwy",
      "body": "I should have died on those meds back then. I started self harming, cutting myself without care only after I started them, I was in a complete state of apathy and my body became completely numb. I also gained so much weight, ruining my previous model like looks, I used to get constantly complimented, these things ruined me. And I got very severe PSSD, it has been 10 years, I still am chemically castrated, can't feel anything down there and can't fall in love. I will never have a partner because I trusted these fucking doctors who scrambled up my brain. I can't even solve a fucking sudoku puzzle my mind is so blank. I was a brilliant artist before this.",
      "created_utc": 1729338150.0,
      "score": 15
    },
    {
      "id": "lso8dv8",
      "body": "Exactly my experience!!!",
      "created_utc": 1729338984.0,
      "score": 7
    },
    {
      "id": "lt9lx7g",
      "body": "Mine too. My mom is absolutely obsessed with her religion. ",
      "created_utc": 1729644308.0,
      "score": 6
    },
    {
      "id": "lskvyyt",
      "body": "Don't let it convince you it's stronger than you. Bunch of dodgy, perverted, wanna be's. Don't let them win.",
      "created_utc": 1729281669.0,
      "score": 5
    },
    {
      "id": "lsnx3vw",
      "body": "I try to remind myself of this - that my therapist has to make a living too. But $200/hr????? (once my situation discount ends) \n\nI asked her why I have to literally PAY just to be alive. And well, she compared it to people who have to pay for treatments for physical illnesses to stay alive. I get it but it's not the same thing. At that time I didn't even want to be alive, so why should I pay for something I don't even want???",
      "created_utc": 1729332520.0,
      "score": 17
    },
    {
      "id": "lsq4doq",
      "body": "I wish that would apply to the therapists and my fellow psychology students in Germany ",
      "created_utc": 1729363685.0,
      "score": 4
    },
    {
      "id": "lso7k8d",
      "body": "[removed]",
      "created_utc": 1729338574.0,
      "score": 8
    },
    {
      "id": "lspak15",
      "body": "Some private practices do charge exorbitant amounts. I know how futile it feels to spend money just to talk to someone when you feel like you’re a lost cause. :( No one should have to pay for treatment for physical OR mental illness, the world is so fucked up. I really hope you’re able to find hope, and purpose. I wish I could say something more helpful. You deserve to be happy.",
      "created_utc": 1729353841.0,
      "score": 6
    },
    {
      "id": "lso8fr5",
      "body": "How many people who commit suicide seriously do it just because of these poison pills? I feel completely deceived and my trust violated so badly, I trusted these people. And I can't even talk about what was done to me, they brush me off automatically because they consider me just some insane mentally ill patient, while they put me in a state where I couldn't defend myself...",
      "created_utc": 1729339009.0,
      "score": 8
    },
    {
      "id": "lsrw26k",
      "body": "Thank you kind stranger",
      "created_utc": 1729386756.0,
      "score": 2
    }
  ]
}