{
  "id": "1gme7vo",
  "title": "This world is not a good place and life isn't precious",
  "selftext": "From the very beginning we have been brainwashed into thinking that our life's are precious and we all suffer due to a reason and all that kind of crap. \n\nWell the reality is this shit ain't precious. It's hell. As you read this there are murders, r**es, theft and what not happening in the world. There is freaking war going on right now. People dying left right and centre. \n\nYou open your eyes when you are born and are on the mercy of luck. The parents you get, the household, the money and all. If you happen to be born in a first world nation, life's competitively easy but if you are born a woman in Afghanistan. It's worse than hell. \n\nThis world makes no sense and I can't wait to get out of it. ",
  "created_utc": 1731055852.0,
  "score": 579,
  "num_comments": 87,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1gme7vo/this_world_is_not_a_good_place_and_life_isnt/",
  "comments": [
    {
      "id": "lw2rkh7",
      "body": "Yeah idk why suicide is frowned upon when we live in such a fucked up world and it probably won’t change enough in our lifetime :/",
      "created_utc": 1731073166.0,
      "score": 149
    },
    {
      "id": "lw3y00l",
      "body": "We are all nothing but a number.",
      "created_utc": 1731086271.0,
      "score": 40
    },
    {
      "id": "lw3a6ei",
      "body": "They need population up for the shareholders. This is protest, too.",
      "created_utc": 1731079312.0,
      "score": 29
    },
    {
      "id": "lw575i4",
      "body": "Ever think about how things that are good for you always suck and anything that feels good is always bad for you? Why is the universe designed like that? It's like a sadistic simulation.",
      "created_utc": 1731099690.0,
      "score": 18
    },
    {
      "id": "lw6bmur",
      "body": "One reason I quit therapy is that they have to be dishonest when you say things like this. Even if they understand it's true, they have to lie. They have to pretend your thoughts and feelings are the problem.",
      "created_utc": 1731113103.0,
      "score": 17
    },
    {
      "id": "lw506x0",
      "body": "Sometimes you need time to mourn for the world that doesn’t exist. For the kind of world we want but only seems to appear briefly sometimes. It’s a lot to come to terms with.",
      "created_utc": 1731097580.0,
      "score": 11
    },
    {
      "id": "lw3dxnz",
      "body": "I've been contemplating for a while now and talked down by friends and chosen family who love me. I'm a queer disabled man who relies on things like food stamps and SSI and Medicaid and all those things are going to be going away. I'm completely fucked. I want to stick around and help fight but I fight my body everyday with my chronic pain and disability. And I'm so fucking tired. It's wild how everybody is all about bodily autonomy until we decide we don't want to be here anymore. Nobody asked to be born. I don't know what I'll do but I don't see things getting better. It's likely I still do it.",
      "created_utc": 1731080435.0,
      "score": 32
    },
    {
      "id": "lw2hi1u",
      "body": "Amen. Im over it too.",
      "created_utc": 1731069276.0,
      "score": 27
    },
    {
      "id": "lw6z562",
      "body": "The more you open your eyes, the clearer you can see how the planet is full of cruelty. There is no order in the universe and everything is chaos. We have control over little in terms of the cards we are dealt with. As someone  with a chronic condition that is expensive to treat, I’m just living to work to pay my medical bills to stay functional enough to work to pay medical bills.. and all for what? Watching the world constantly on fire? To experience the moral apathy of a majority of folk around us. We don’t have a say in the cards we are dealt but we should be allowed to leave on our own terms. I think about this everyday. Everyday I find fewer reasons to hang on.",
      "created_utc": 1731121740.0,
      "score": 9
    },
    {
      "id": "lw74vd6",
      "body": "Yeah life fucking sucks",
      "created_utc": 1731124085.0,
      "score": 7
    },
    {
      "id": "lw2t33e",
      "body": "It’s worse than I’ve ever experienced in my life time. And I feel like I’ve been really naive about many things. But I disagree about how precious life is. I want to shield people, because I know how hard it can be. How much this world beats people down. And it’s not fair that some people have advantages that they use for cruelty. \n\nIf I can stand in the way and block some of that force so that people like you can have a little room to breathe, then I will do what I can to help. \n\nIt sucks. But I can walk with you a little while. And maybe make the hits a little less intense.",
      "created_utc": 1731073702.0,
      "score": 23
    },
    {
      "id": "lw40z2t",
      "body": "I heavily agree, just the simple idea of cherishing life overall else.. is hypocritical.",
      "created_utc": 1731087135.0,
      "score": 8
    },
    {
      "id": "lw7f1u7",
      "body": "Yeah this world is broken it was never supposed to be like this. Especially the technology we are using at the moment…pure evil.",
      "created_utc": 1731128684.0,
      "score": 4
    },
    {
      "id": "lw2uu3m",
      "body": "This is one SW post I can get on board with cuz fuck life. It's really isn't anything special to the majority of us, so we really just have to take what we got and make the most of it. Easier said than done, trust I know. But life IS worth fighting another day. Who knows what tomorrow might have in store for you?",
      "created_utc": 1731074320.0,
      "score": 9
    },
    {
      "id": "lw6yinf",
      "body": "Right behind you il be exiting withing the month",
      "created_utc": 1731121502.0,
      "score": 3
    },
    {
      "id": "lw3b21n",
      "body": "I understand how you feel, and I agree with you, at least in part.\n\nI don’t see life as something without value, and I don’t think you do either. The frustration you feel toward all this already shows me that, deep down, you value life — but feel free to correct me if I’m wrong.\n\nIt really is upsetting and absurd how basic rights and opportunities vary so much, just based on where you’re born.\n\nIt’s only natural for us, especially when we don’t have the resources to change this reality, to feel uncomfortable, frustrated, and even down about this injustice. But to me, that just shows how much life is worth; it shouldn’t be wasted this way. At least, that’s how I see it.",
      "created_utc": 1731079577.0,
      "score": 7
    },
    {
      "id": "lw7mait",
      "body": "Right there with you I can’t wait either",
      "created_utc": 1731132452.0,
      "score": 2
    },
    {
      "id": "lwavtos",
      "body": "Life is precious, but we don’t suffer for a reason. We suffer because of entropy, chaos, and the cruelty of other people. But life is precious, and good exists, always waiting to be found again. People fight with everything they have to have more time in this world with people they love. That means something. Suffering is horrible, but not purposeful, though we can find meaning in it. But life is always precious.",
      "created_utc": 1731183648.0,
      "score": 2
    },
    {
      "id": "lw553fq",
      "body": "That is true but only half of the truth the world has all this terrible things but also some goods. My life is merely extreme emotional pain but even that is interrupted with at least some halfway pleasant things",
      "created_utc": 1731099071.0,
      "score": 3
    },
    {
      "id": "lw6x92i",
      "body": "The world consumes, flowers consume, animals consume, everything living in life consumes, and everything produced is consumed.\n\nIt is difficult to find your own balance in this consumer world. Before you feel yourself engulfed by the world as if your mental mind has become someone else's food.\n\nDon't let the world eat you, don't let others eat your mind.",
      "created_utc": 1731121023.0,
      "score": 3
    },
    {
      "id": "lw7eatu",
      "body": "I bet you pay taxes too",
      "created_utc": 1731128325.0,
      "score": 1
    },
    {
      "id": "lw8c8u0",
      "body": "Religious brainwash you,if you suicide you will go to hell bla bla bla you will keep suicide repeatedly until you are old then go to hell. 🙄",
      "created_utc": 1731149146.0,
      "score": 1
    },
    {
      "id": "lw2hx7i",
      "body": "But we get to be good human beings. We have a choice to do good. That's all I'm saying. Life is not something inherently good, yes. There are soooo many bad actors. But i choose to be someone better than what I hate. Someone better than the shitty crappy jerk I've been. Because love is the only thing that can change matters. It's not the only thing, yes. But only love and our want for genuine goodness can turn things around",
      "created_utc": 1731069456.0,
      "score": -4
    },
    {
      "id": "lw2axvz",
      "body": "The world is not a good place, because not all people are good. But that doesn't mean that you can't be good. Why not be a force of good? There are so many people who got dealt a shit hand in life and they didn't despair and still used their less-than-ideal life condition to be a force of good for others. Do what you can and this world be a better place tomorrow then it is today. You can find joy and purpose in doing good. \n\nEven though there is a lot of evil in the world, there is still a lot of good and joy. You can choose if you want to make this place a better or worse place. In the end no good deed is ever wasted.",
      "created_utc": 1731066242.0,
      "score": -14
    },
    {
      "id": "lw3nw4p",
      "body": "I know you’re saying what you feel and I’m not trying to diminish that, but I think it’s wrong to assume that just because there is no purpose for it that life isn’t precious.\n\nIt is precious because of its scarcity in the universe. It is precious because as far as we know, we are the only planet in the universe with life on it at all. Yes it is awful, yes it is painful, yes there are atrocities at every single turn, yes nature itself threatens to drive itself into extinction at every moment.\n\nThe fact that any of this occurs at all; the odds are so astronomically stacked against it, so against the fact that you are here to rationalize and reason with it at all, it defies almost all logic.\n\nThis does not invalidate anyone’s feelings towards the state of their own life, or the lives of others. Just because that someone may have earned the right to end their own suffering does not mean that their life isn’t or wasn’t precious and valuable. \n\nCall it radical nihilistic optimism or whatever if you must, but this is how I feel in my heart. I hope it at least gives you some kind relief or peace, knowing that you are **not worthless**: simply by virtue of being alive.",
      "created_utc": 1731083351.0,
      "score": -5
    },
    {
      "id": "lw6i279",
      "body": "[deleted]",
      "created_utc": 1731115386.0,
      "score": -4
    },
    {
      "id": "lw41a2f",
      "body": "if that were true, the people suffering in gaza should kill themselves faster than we do. but thats not what happens, because its not true that life is hell. hell is separation from or ignorance of all that is truly good. a mindset like this is hell; you should not think this way.",
      "created_utc": 1731087225.0,
      "score": -5
    },
    {
      "id": "lw5uvr5",
      "body": "[removed]",
      "created_utc": 1731107244.0,
      "score": -6
    },
    {
      "id": "lw28wrn",
      "body": "We are all in this together. You matter, and we are right we with you",
      "created_utc": 1731065169.0,
      "score": -9
    },
    {
      "id": "lw1ycxk",
      "body": "[removed]",
      "created_utc": 1731058914.0,
      "score": -36
    },
    {
      "id": "lw34qf8",
      "body": "[deleted]",
      "created_utc": 1731077623.0,
      "score": -11
    },
    {
      "id": "lw4o0zd",
      "body": "I agree that Life is tough and a lot of horrible things are happening in the world today but I do think that Life is precious. The Fact if you are an average healthy person, you can see, walk, move your limbs freely, you can taste and smell. In this giant universe where Life is no where to be found millions of miles from earth, the chances of you being alive here in the present was very very minuscule. If you go back a thousand years, human life was probably 6X worse than it is today. Life expectancy was in the 40's, rape and murder was a weekly/daily occurrence with almost no repercussions. Food was more scarce, medicine almost non existent but somehow our ancestors persevered and made a life with whatever they could. It is true that being a woman born in a Machismo country sucks but there's ways to survive until you escape, it's unfortunate but possible. Even being born in a country like that is still better than it was hundreds of years ago. I guess what i'm saying is that there is more hope in humanity than there ever was thanks to technology. If you hate how evil the world is today maybe you can be part of that change to make this planet we all share more tolerable.",
      "created_utc": 1731093896.0,
      "score": -4
    },
    {
      "id": "lw4aua1",
      "body": "\"bad, worse, special, and precious\" are all just interpretations and are not reality. reality is beyond words and concepts. we have a lot of thoughts about what \"this\" is, but most of use are just locked in a prison of ideas: ideas of past, future, \"me\", \"them\", and so on. I suggest you explore \"this\", what's right in front of you right now, a little while longer before you say you know what \"this\" is. youre right, the world makes absolutely no sense! but whats the hurry?",
      "created_utc": 1731090009.0,
      "score": -5
    },
    {
      "id": "lw4457d",
      "body": "You sound lazy why not go fight to end all the bad of wars instead of sitting here posting about it?",
      "created_utc": 1731088055.0,
      "score": -15
    },
    {
      "id": "lw3y6sl",
      "body": "In other societies such as Japan or India it’s not frowned upon.  It may even be respectable",
      "created_utc": 1731086326.0,
      "score": 37
    },
    {
      "id": "lw53oy8",
      "body": "Again most people are hypocrites",
      "created_utc": 1731098649.0,
      "score": 10
    },
    {
      "id": "lw9b375",
      "body": "[removed]",
      "created_utc": 1731165247.0,
      "score": 4
    },
    {
      "id": "lwzs2q7",
      "body": "I feel like It's just a smoke screen to distract people and make them feel like the government cares when it's more about criminalization and eugenics",
      "created_utc": 1731537294.0,
      "score": 1
    },
    {
      "id": "lw41hun",
      "body": "it is not rational if you have a life where you prioritize love and work",
      "created_utc": 1731087288.0,
      "score": -34
    },
    {
      "id": "lw4xfs6",
      "body": "\"The comfort of the rich depends upon an abundant supply of the poor.\"\n\n\\- Voltaire",
      "created_utc": 1731096735.0,
      "score": 23
    },
    {
      "id": "lwzstrx",
      "body": "Yes, therapy in the USA is very white/capitalist centric. To assume that the problems lie within the person and ignore the rampant causes of injustice/discrimination/racism are just a myth or something. Just name some colors and sounds and you will be fine... You don't have to react to it!!!  Effective for perpetuating complacency",
      "created_utc": 1731537540.0,
      "score": 3
    },
    {
      "id": "lw3yqw4",
      "body": "First off you don’t know that your government benefits are going away, you don’t know the future.  They may very well be increased.  In our country people look down on suicide but there are other societies where it is normal-India and Japan",
      "created_utc": 1731086490.0,
      "score": 7
    },
    {
      "id": "lw8coqb",
      "body": "I'm so sorry.  It will all end some day, and that is what is 100% certain.",
      "created_utc": 1731149432.0,
      "score": 3
    },
    {
      "id": "lwn5wtr",
      "body": "I hate to say this cuz of the potential downvotes.  In your situation you should be receiving government benefits and the maximum allowable.  You should get food stamps, Medicaid and whatever else there is.  That’s why I know we’re nothing but a number, none of us means anything in the scheme of things.  It really doesn’t matter if we’re dead or alive.",
      "created_utc": 1731359294.0,
      "score": 3
    },
    {
      "id": "lwt6te5",
      "body": "[deleted]",
      "created_utc": 1731445399.0,
      "score": 2
    },
    {
      "id": "lw50j1m",
      "body": "This reminds me of a favorite part of a specific book … iykyk",
      "created_utc": 1731097683.0,
      "score": 4
    },
    {
      "id": "lw8cu9i",
      "body": "You can only say that about your own life, nobody can decide the value of another's life - it is up to them to decide the worth of their own life and them alone.",
      "created_utc": 1731149530.0,
      "score": 5
    },
    {
      "id": "lwr2l7o",
      "body": "Tomorrow?  For me?  I will wake at around 0500.  Take pills.  Walk the dog.  Clean.  Take pills.  Sleep for a couple hours.  Veg for a couple hours.  Take pills.  Dogs dinner.  Veg for a few hours.  Take pills.  Bed around Midnight.  Same as all the other days.",
      "created_utc": 1731421425.0,
      "score": 1
    },
    {
      "id": "lwr30nd",
      "body": "So life is worth it to feel uncomfortable, frustrated and down?  I see value in life, just not mine.  It's a waste me being here.",
      "created_utc": 1731421582.0,
      "score": 3
    },
    {
      "id": "lx0coxe",
      "body": "It would be better to explain how not to let ourselves get consumed then give a cliched \"Stay strong\" type of comment.",
      "created_utc": 1731544403.0,
      "score": 1
    },
    {
      "id": "lx1cbh7",
      "body": "I pay taxes. I like the things that taxes should provide. \n\nI’m not preaching about how everything is fabulous. I’m not described by anyone as “bubbly”. \n\nI want roads and schools and national parks. The fire department did their best to save my house but it is gone with everything I had. I was grateful the men and women put their lives on the line and tried. \n\nI’ve been let down by government programs that should have been a safety net. An autistic son who’s 25 would have fallen between the cracks but I wouldn’t let him. I hate that the taxes I paid into for ever did next to nothing to help that young man. My other child? Type 1 diabetes tried to kill him. The cost of insulin alone could have destroyed us and the ER visits tried to ruin us. \n\nHe’s trans. This country sees him as a threat. 3 years ago he moved to Australia where it’s safer. \n\nI still pay taxes. I’m retired and my social security has been promised to be removed within six years. \n\nFuck these filthy creatures who call themselves “Godly” - grow the fuck up and realize we are an incredible accident of the cosmos. \n\nGod has done nothing for humanity. ",
      "created_utc": 1731557568.0,
      "score": 2
    },
    {
      "id": "lx0cw5g",
      "body": "Not by choice.",
      "created_utc": 1731544474.0,
      "score": 1
    },
    {
      "id": "lw6sl0h",
      "body": "Bullies ruined my life after ten years of being subjected to it. I was a special gift to them. I was the perfect target.",
      "created_utc": 1731119245.0,
      "score": 6
    },
    {
      "id": "lw2uxvd",
      "body": "Anndddd your a dick",
      "created_utc": 1731074356.0,
      "score": 9
    },
    {
      "id": "lw2khkn",
      "body": "And if they don't live in the 1st world? The rest of the planet does in fact exist.",
      "created_utc": 1731070504.0,
      "score": 11
    },
    {
      "id": "lw257qf",
      "body": "[deleted]",
      "created_utc": 1731063066.0,
      "score": -10
    },
    {
      "id": "lw7110g",
      "body": "[deleted]",
      "created_utc": 1731122490.0,
      "score": -1
    },
    {
      "id": "lwdgkvd",
      "body": "Nobody wants to fight anymore. We're tired of watching all our work end up as meaningless. That's why its called R/SuicideWatch. These people have long had their spirit and will to keep going killed. ",
      "created_utc": 1731218794.0,
      "score": 1
    },
    {
      "id": "lw8bgsg",
      "body": "In japan, suicide was seen as honorable until the 50s ish if you brought misfortune or dishonour to your family",
      "created_utc": 1731148636.0,
      "score": 5
    },
    {
      "id": "lwa548q",
      "body": "Seppuku!!!!",
      "created_utc": 1731175038.0,
      "score": 1
    },
    {
      "id": "lw4skyw",
      "body": "oh you’re own of those “focus on the positive, and ignore the bad” type person. doesn’t work",
      "created_utc": 1731095261.0,
      "score": 43
    },
    {
      "id": "lx1968j",
      "body": "I’m one of those few who read The Heritage Foundation’s draconian plan, Project 2025. The promises within it assure us, who live in the US, a dystopian society that ensures a future where billionaires use our skulls to make a staircase for the oligarchs to climb onto their thrones. Their god, the same imbecile who does the buying for Hobby Lobby, is diabolically linked to a plethora of ways to systematically remove the rights that we’ve clawed our way to enjoy. Autonomously allowed to make medical decisions not based on hyperbolic imaginations clutched from a book of fiction, which contradicts not only itself but mature, peer reviewed scientific knowledge. We are being forced into a state run religion wherein all minorities and females are the enemy of their religion of self determination to remove the constitution and replace it with the Taliban. \n\nSocial media has become so poisoned that it has led, in Pied Piper fashion, fifty percent of the masses into believing that children in the second grade are receiving gender affirming surgery at public schools. What the absolute fuck? Trans people statistically make up less than one percent of our population. They are now the target of a campaign so stupid, it’s comical. It’s comical until you see the ignorance of the mass hysteria of imbeciles who have grasped onto this as the defining moment of their existence. I don’t think I need to belabor the obvious fact that switching genitals is not being performed on children right before lunch at elementary schools. In fact nothing is further from the truth and fuck anyone who is stupid enough to accept this fairytale. \nThe LGBTQ+ community should be afraid. They are the target and anyone who wants equality for our Queer and Trans brothers and sisters is the enemy. \n\nI live in a swing state that, for the first time, went fucking red. \n\nAlthough I truly understand why suicide feels attractive, I’ve suffered with depression, anxiety and ideation of giving up for as far back as I can remember, I just cannot give up on that tiny shred of allusive hope that keeps driving me to create and write. I’m an artist. I’m an author. In this I find just enough drive to remain the fucked up shard of glass in the shoe of those who want to walk over us. \n\nFuck them. Fuck the idiots that voted for this bunch of fools and liars who want to end this brilliant experiment that’s far from perfect but is still what made it possible for a simple, uneducated religiously brainwashed asshole like me to be intellectually curious enough to change and make something better of my rather imperfect self. ",
      "created_utc": 1731556254.0,
      "score": 3
    },
    {
      "id": "lx0z5ll",
      "body": "if they're American, they must assuredly are going away. it's a very similar situation to me and I'm terrified too ",
      "created_utc": 1731552449.0,
      "score": 2
    },
    {
      "id": "lwnlwj1",
      "body": "Almost everyone I talk to with my condition is on disability but half their treatments are not covered. I’ve seen how Medicaid denies all the claims. Eventually people opt to exit on their own terms. I live alone so I’m not burdening anyone but myself but at some point I won’t be able to keep pushing myself. I’d let someone unalive me if that was an option. You work your issues and I get to be free.",
      "created_utc": 1731364262.0,
      "score": 2
    },
    {
      "id": "lx5s08h",
      "body": "I really appreciate that. I’m always open to a new friend. Especially right now.",
      "created_utc": 1731622461.0,
      "score": 2
    },
    {
      "id": "lwtjhvp",
      "body": "Groundhog day, huh? I feel ya. Same here pretty much",
      "created_utc": 1731449545.0,
      "score": 1
    },
    {
      "id": "lwrz92f",
      "body": "I believe life is worth it because people aren’t defined only by their difficult moments. I feel that life’s value is found in the little things.\n\nI don’t say this out of empty optimism or blind faith in something greater, but because I’ve also gone through difficult times, and I found that those small, sometimes invisible, virtues kept giving me strength. In those moments, I realized that a desperate choice isn’t always the same one we’d make after taking a moment to breathe.\n\nI don’t know what you’re going through, but if you feel comfortable talking about it, I’m here to listen.",
      "created_utc": 1731432012.0,
      "score": 2
    },
    {
      "id": "lx0ha08",
      "body": "Saying staing strong, is the last thing I want to write, because it doesn't help, when you are or feel like a cut down pile of wood!\n\nWhat I'm trying to describe is the feeling that everything around eats you up, to recognize it, rather than trying to deny it.\n\nBut you cannot see something, recognize it until you can accept your own reality, because if it is black, then you cannot see it in other colors until you can stop in your own blackness.\n\nIt is then, you can finally see everything else and feel your own worth to want to live!\n\nIt takes tho a lot of time.",
      "created_utc": 1731546023.0,
      "score": 2
    },
    {
      "id": "lw25k2r",
      "body": "[deleted]",
      "created_utc": 1731063268.0,
      "score": 21
    },
    {
      "id": "lwdg6v2",
      "body": "You're surprised? What did you expect from a crowd of people who hit rock bottom, then find themselves breaking bedrock? ",
      "created_utc": 1731218578.0,
      "score": 1
    },
    {
      "id": "lwdys9w",
      "body": "I dont mean to come out as rude its general advice i have made other comments on different lost with different advice. Truth is you can go about it two ways and in both your spirit ain’t got much to do with it. It’s just lazy ness you can give up or go do something about it.  I will never knock down someone trying life is just a game of patience waiting for moments. Until then stay busy",
      "created_utc": 1731230137.0,
      "score": 1
    },
    {
      "id": "lw5r2pr",
      "body": "youre probably doing it wrong",
      "created_utc": 1731105967.0,
      "score": -23
    },
    {
      "id": "m05oyaf",
      "body": "Are you still here?",
      "created_utc": 1733202952.0,
      "score": 1
    },
    {
      "id": "lx0odq1",
      "body": "You're right, I'm sorry.",
      "created_utc": 1731548566.0,
      "score": 2
    },
    {
      "id": "m3pund6",
      "body": "Fuck are you talking about? Nigga talking about he don't wanna be rude, well I've had enough, I'm getting more than rude. Go and research depression you fucktard and tell me if thats laziness or if you quite literally don't have the willpower. Better yet, let me kill your unborn child, i want you to personally experience this pain, this \"laziness\" you speak of. Niggas always think you can just get up and go, nigga if that were the case these niggas wouldn't be killing themselves!",
      "created_utc": 1735120909.0,
      "score": 1
    }
  ]
}